{
  "id": "3c5c6ded-092a-45fc-a766-22dad90d00f8",
  "name": "100huntley",
  "youTubeChannelId": "UC4b1cyjfinmRIsTljCJMUIA",
  "episodes": [
    {
      "id": "c7f04897-d9f0-4c2f-9e8d-526ad47706f8",
      "title": "Jonestown Survivors Spoke Out— Then They Were Killed",
      "description": "On April 24, 1980 — just a year and a half after the Jonestown tragedy — A documentary filmmaker sat down to recount firsthand experiences of one of the most shocking mass deaths in modern history. Some of the documentary interviewees had just been murdered in the weeks leading up to this rare interview. They describe life inside the Peoples Temple, the atmosphere leading up to November 18, 1978, and the chaotic final moments as over 900 men, women, and children lost their lives in a mass murder-suicide orchestrated by Jim Jones.\n\nThis conversation provides a stark, unfiltered look at the realities of Jonestown, the psychological hold Jim Jones had over his followers, and the few desperate attempts to escape.\n\nThis program is funded by the generous support of 100 Huntley Street viewers and is produced by Crossroads, a registered charity in Canada and the USA. Donate or become a monthly partner at https://donate.crossroads.ca/100hs-yt\n\nJoin this channel to help spread the word about Jesus on Youtube:\nhttps://www.youtube.com/channel/UC4b1cyjfinmRIsTljCJMUIA/join\n\nNeed prayer? Our Prayer Line services 1-866-273-4444 are available toll-free 24/7. \nOr you can submit your prayer requests online http://100hs.ca/prayer\nWe also offer extended assistance to those in need.\n\nClick here if you\u0027re interested in subscribing: http://100hs.ca/subscribe \n\nConnect with 100 Huntley Street Online: \n• Facebook: https://www.facebook.com/100huntley/\n• Twitter: https://twitter.com/100Huntley\n• Instagram: https://www.instagram.com/100huntley/\n\nAbout 100 Huntley Street™: http://100huntley.com\n \nLooking for a program that will encourage and inspire your Christian faith? \n100 Huntley Street brings you the amazing stories of people – whether they be world leaders, celebrities, sports figures, or everyday people – who have had life-changing encounters with God.",
      "release": "2025-03-15T18:02:02Z",
      "duration": "00:24:03",
      "explicit": false,
      "youTubeId": "any063Iu5S4",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=any063Iu5S4"
      }
    }
  ]
}