{
  "id": "457ca0ef-4730-4b4b-a480-d4f34862d77a",
  "name": "13WHAM ABC News",
  "youTubeChannelId": "UCFQyVljCrdof5Uqmo8p3c0Q",
  "episodes": [
    {
      "id": "0cc8c6ed-31da-4a5d-aacd-f44e27808026",
      "title": "Bill Gates cancels keynote address amid scrutiny over Epstein ties",
      "description": "Bill Gates has pulled out of delivering his keynote address at an AI summit in India Thursday, his foundation said, as the billionaire faces scrutiny over his ties to late convicted sex offender Jeffrey Epstein.\n\n“After careful consideration, and to ensure the focus remains on the AI Summit’s key priorities, Mr. Gates will not be delivering his keynote address,” the Gates Foundation said in a statement just hours before he was due to speak.\n\nNo reason was provided for the abrupt withdrawal.\n\nCNN has reached out to the Gates Foundation, the Gates Foundation India and the summit organizers for comment.\n\nThe Microsoft founder has come under fire in recent weeks over two recently released draft emails Epstein appears to have written to himself, in which he claims he facilitated sexual encounters for Gates and helped him obtain medication to hide a sexually transmitted infection from his wife.\n\nIt’s not clear who wrote the draft messages from 2013 saved in Epstein’s email account, but they are addressed from Epstein to himself.\n\nGates has strongly denied these claims as “false.”\n\nThe tech billionaire was due to speak at the AI Impact Summit in New Delhi, billed as one of the biggest AI conferences in the Global South. Indian Prime Minister Narendra Modi inaugurated the summit Thursday morning.\n_______________\nStay up to date with our social media:\n\n13 WHAM on Facebook: https://www.facebook.com/13WHAM\n13 WHAM on Twitter: https://twitter.com/13WHAM\n13WHAM on Instagram: https://www.instagram.com/13whamtv/?hl=en\n13WHAM on TikTok: https://www.tiktok.com/@13wham?lang=en\n\n13 WHAM Daily Local News Digest:  https://www.youtube.com/playlist?list=PLuTJB6tta5ar3Fu5CumAvlvVunEP6bc9A\n\nFor more information, visit https://13wham.com/\n\nHave a news tip? Send it directly to us: \n\nEmail us: news@13wham.com\nCall the Newsroom: (585) 334-8700\n\nWHAM is a NY based station and a ABC Television affiliate owned and operated by Deerfield Media, Inc and receives certain services from an affiliation of Sinclair Broadcast Group. Sinclair Broadcast Group, Inc. is one of the largest and most diversified television broadcasting companies in the country today. \n\n#13WHAM #News #Rochester #NewYork",
      "release": "2026-02-19T17:33:20Z",
      "duration": "00:01:52",
      "explicit": false,
      "youTubeId": "X-2SiA-ZKbA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=X-2SiA-ZKbA"
      }
    },
    {
      "id": "a49433de-c737-49b7-b275-284657f3b0a4",
      "title": "DOJ lists 300\u002B famous names in Epstein files, says no more files will be released",
      "description": "The Department of Justice on Saturday sent Congress a list of “politically exposed persons” in the millions of files released related to its probes into convicted sex offender Jeffrey Epstein.\n\nThe six-page letter, a copy of which was obtained by CNN, includes the names of many prominent figures who appear in the files, regardless of the context, and does not specify the degree to which the people were linked to or in contact with Epstein. The letter is signed by Deputy Attorney General Todd Blanche and addressed to top members on the House and Senate Judiciary Committees.\n\nThe DOJ was compelled to produce the list by the Epstein Files Transparency Act passed by Congress. CNN has reached out to the DOJ for more details about the list it sent to lawmakers.\n\nWhile some of the people on the list have well-documented ties to the convicted sex offender, others are not known to have ever personally interacted with Epstein. The list includes presidents, business leaders and government officials, in addition to cultural icons who have died, such as Princess Diana, Elvis Presley and Michael Jackson.\n\nIt also mentioned prominent individuals who have previously been linked to Epstein, including President Donald Trump, former President Bill Clinton, former Trump adviser Steve Bannon, former White House Counsel Kathy Ruemmler and billionaire business magnate Les Wexner.\n\nNo one on the list, other than Epstein and his accomplice Ghislane Maxwell, have ever been charged in connection with Epstein’s crimes.\n_______________\nStay up to date with our social media:\n\n13 WHAM on Facebook: https://www.facebook.com/13WHAM\n13 WHAM on Twitter: https://twitter.com/13WHAM\n13WHAM on Instagram: https://www.instagram.com/13whamtv/?hl=en\n13WHAM on TikTok: https://www.tiktok.com/@13wham?lang=en\n\n13 WHAM Daily Local News Digest:  https://www.youtube.com/playlist?list=PLuTJB6tta5ar3Fu5CumAvlvVunEP6bc9A\n\nFor more information, visit https://13wham.com/\n\nHave a news tip? Send it directly to us: \n\nEmail us: news@13wham.com\nCall the Newsroom: (585) 334-8700\n\nWHAM is a NY based station and a ABC Television affiliate owned and operated by Deerfield Media, Inc and receives certain services from an affiliation of Sinclair Broadcast Group. Sinclair Broadcast Group, Inc. is one of the largest and most diversified television broadcasting companies in the country today. \n\n#13WHAM #News #Rochester #NewYork",
      "release": "2026-02-16T21:14:29Z",
      "duration": "00:01:58",
      "explicit": false,
      "youTubeId": "Un9LjC_RyYI",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Un9LjC_RyYI"
      }
    }
  ]
}