{
  "id": "952bf1bd-49f8-47f0-a8c7-78cd36d4c16a",
  "name": "1Fit Wellness",
  "youTubeChannelId": "UCnmnCqu60oQ9mg4Ykxylyqg",
  "episodes": [
    {
      "id": "b07dae43-ac02-4f25-9959-e525f87abf34",
      "title": "Escaping a Cult and Finding Freedom in God’s Grace – A Conversation with Elsie McKenney",
      "description": "Take the Quiz \u0022How Fast is Your Hamster Wheel Spinning?\u0022 at hamster.1fit-wellness.com \n\nElsie’s links: https://www.amazon.com/stores/Elsie-McKenney/author/B0BNZJ7541 \nElsiemckenney.com \n\nTrigger warning: discussion of a physical attack and human trafficking\n\nIn this compelling episode of The Grace Cycle Show, host Karen Dittman interviews Elsie McKenney—author and survivor—who shares her extraordinary journey of escaping a cult and discovering lasting freedom through God’s grace. \n\nElsie recounts her childhood in a Mennonite community, the devastating turn when her family became entangled in a cult when she was just 10 years old, and her harrowing escape at age 19. She opens up about the emotional and spiritual challenges she faced along the way, and how God’s grace both protected and guided her through every step of her journey. \n\nElsie also discusses her award-winning novel, Eve’s Covering, a gripping story inspired by her real-life experiences, offering hope to others who feel trapped by circumstances beyond their control. \n\nIn This Episode, You’ll Learn: \n* How God’s grace empowers survival and healing after trauma \n* The realities of growing up in and escaping from a cult \n* The importance of reclaiming identity and freedom in Christ \n* How fiction can be used to share powerful testimonies of faith \n\n00:00 Welcome to the Grace Cycle Show \n00:51 Interview with Elsie McKenney: Escaping a Cult \n01:04 Elsie\u0027s Early Life and Introduction to the Cult \n04:56 Life in the Cult and Initial Escape \n06:55 Return to Michigan and Continued Struggles \n11:26 Final Escape and Finding Safety \n20:29 Writing Eve\u0027s Covering \n22:17 Elsie\u0027s Message of Hope and Trust in God \n23:41 Closing Thoughts \n\nPerfect for: Christian women, trauma survivors, spiritual seekers, and anyone longing for healing, freedom, and encouragement through faith.",
      "release": "2025-09-25T06:00:17Z",
      "duration": "00:25:29",
      "explicit": false,
      "youTubeId": "B3fPxE-Amjo",
      "subjects": [
        "Mennonite",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=B3fPxE-Amjo"
      }
    }
  ]
}