{
  "_ts": 0,
  "id": "424baec6-a19e-4423-93a7-f0a3038de795",
  "name": "3Rz - Rhymes, Reasons and written Reviews",
  "youTubeChannelId": "UCCiGCepeNPHGx5t5PIaJZbg",
  "episodes": [
    {
      "id": "e18ba869-ce6a-4e80-903d-21b8f3ac3b37",
      "title": "Ex JWs - How You 👀 Can Find Family Destruction \u0026 Annihilation simply by becoming a JW! Sign up4life",
      "description": "Hi, Wen here. I did this video in an audio style today. When you see JW carts around the place displaying a message such as You can have FAMILY HAPPINESS it just makes me so frustrated and admittedly angry, knowing that it\u0027s ONE BIG FAT LIE.\n\nAs promised in this video, below is a link to my first video and Bridget\u0027s new video, Bridget from AZ, which inspired me to do this video. \n\nLove Never Fails - Express Delivery to the JW Governing Body \n\nhttps://youtu.be/dPOps5PcX1Q\n\nBridget from AZ\n\nhttps://youtu.be/LI0mkq3zvwg\n\nShare this video to spread the word to friends and family. Please press the thumbs up and subscribe if you are interested in this subject. Leave a comment and I promise to reply to you \n\nThis video focuses on the JW organization causing destruction and annihilation of family relationships, generation after generation. You can never escape it, even after you leave the borg.\n\nMany JWs are writing wills, making the borg their beneficiaries to all their worldly wealth when they pass away. The money keeps coming to them, therefore we must use word of mouth to destruct and annihilate this deceptive tower of terror organization. People Power is the only way to tear this tower of terror down. \n\nEx JW Activists need the support of others by spreading the word of this amazing ex JW YT community for the word to get around that this is a destructive and evil organization to families and individuals.\n\nThey might look squeaky clean on the outside but inside they are full of toxic poison.",
      "release": "2019-10-19T07:11:18Z",
      "duration": "00:07:29",
      "explicit": false,
      "youTubeId": "kLdw2eEQvjo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kLdw2eEQvjo"
      }
    }
  ]
}