{
  "_ts": 0,
  "id": "b5033537-32e4-4595-a805-cbc79473e80c",
  "name": "50% Facts with Silent Mike \u0026 Jim McD",
  "spotifyId": "5MZiCdVhoqIELamFPTRTeu",
  "appleId": 710541646,
  "youTubeChannelId": "UCGA-swgwDXpCAHJ6aqXWn2Q",
  "episodes": [
    {
      "id": "46413505-1e66-42b2-9615-c99823b140dc",
      "title": "How YouTubers covered the downfall of a Scientologist’s skateboard channel | Examining media about cults",
      "description": "The founder of the biggest YouTube skateboarding channel is a Scientologist. Has that fact become public, explaining the channel\u0027s drop in popularity over the past few years? Was it the money he spent climbing the rungs of this cult (and not on his skaters and staff)? Or was it just the normal life cycle of a YouTube channel? Rather than reviewing a documentary, this time we’re examining the handling of this story through several YouTube explainers and exposes. What do these have in common with real docs? Do we get any closer to understanding what happened with Aaron Kyro and Braille Skateboarding? Videos discussed during this episode: https://youtu.be/uEk_pc0xVYc?si=hdfiZY6W_hF2aMuE https://youtu.be/V-GIyKIlL9g?si=7aOy3qXiK4Vzf55h https://youtu.be/ZF0p1aXqm8M?si=gmCxuRmGNznwSQzW Join our Discord for free at goodcompanydiscord.com! Check out our gym (Third Street Barbell) at ThirdStreetBarbell.com https://www.thirdstreetbarbell.com/ and subscribe for updates about our apparel line at goodcompanyapparel.com https://3sb.co/! Local memberships and international fresh fits! Get early access to our NEXT DROP! Check out our podcast website: 50percentfacts.com https://www.50percentfacts.com/ 50% Facts is a Spreaker Prime podcast on OCN – the Obscure Celebrity Network. ____ Hosted by Mike Farr (@silentmikke) https://www.instagram.com/silentmikke/ and Jim McDonald (@thejimmcd). https://www.instagram.com/thejimmcd/ Produced by Jim McDonald Production assistance by Sam McDonald and Sebastian Brambila. Theme by Aaron Moore. Show art by Joseph Manzo (@jmanzo523) Become a supporter of this podcast: https://www.spreaker.com/podcast/50-facts-with-silent-mike-jim-mcd--5538735/support .",
      "release": "2025-04-30T08:00:08Z",
      "duration": "00:52:22.7500000",
      "explicit": false,
      "spotifyId": "6WhjVOpsKQlglhjnYPVRWA",
      "appleId": 1000705521854,
      "youTubeId": "V5uUGo0i7S4",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6WhjVOpsKQlglhjnYPVRWA",
        "apple": "https://podcasts.apple.com/podcast/how-youtubers-covered-the-downfall-of/id710541646?i=1000705521854",
        "youtube": "https://www.youtube.com/watch?v=V5uUGo0i7S4"
      }
    }
  ]
}