{
  "id": "ddb833cb-5499-4806-bb55-ed1443a37a12",
  "name": "5 News",
  "youTubeChannelId": "UCsAKRVq2n1vcHBzNu1ZikgA",
  "episodes": [
    {
      "id": "848e5a19-f77b-47f1-ad98-c313bd7439d3",
      "title": "Virginia Giuffre said Prince Andrew acted as if having sex with her was his \u0022birthright\u0022, in memoir",
      "description": "► The late Virginia Giuffre wrote in her memoir how Prince Andrew acted as if having sex with her was his \u0022birthright\u0022.\n\nThe book is out next week, six months after Ms Giuffre\u0027s death, and is about her alleged abuse at the hands of Epstein, Maxwell and the King’s brother. The Duke has always denied any wrongdoing.\n\nFormer BBC Royal correspondent Jennie Bond tells 5 News, it\u0027s a \u0022sickening graphic account\u0022.\n\n► Have you subscribed to 5 News?: http://bit.ly/5NewsSub\n\n► Follow 5 News on Twitter to keep up to date with the latest news - https://twitter.com/5_News\n\nMessage us on Facebook to share your opinion - https://www.facebook.com/c5News\n\nSee our latest pictures and videos on Instagram - https://www.instagram.com/c5news/\n\n► About 5 News: We bring you the stories that matter to you, from around the world and across the UK.\n\n🎥 We post daily playlists with the biggest news of the day, interviews, special reports and investigations.\n\n📺 Catch us on TV on Channel 5 every weekday 5-6pm\n\n📱 Get in touch with us on WhatsApp at \u002B44 7555 500 501\n\n🎧 Listen to \u0022How Did We Get Here? Explaining The News\u0022 wherever you get your podcasts: https://podfollow.com/how-did-we-get-here-explaining-the-news\n\nOur flagship, hour-long programme at 5pm is watched on Channel 5 by up to a million viewers, with regular news updates throughout the day.\n\nITN changed the TV news landscape when it launched 5 News in 1997, producing Five News for nine years before winning the contract to supply news to Channel 5 again from 2012.",
      "release": "2025-10-16T17:45:41Z",
      "duration": "00:04:06",
      "explicit": false,
      "youTubeId": "sLtskNW_Vr0",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sLtskNW_Vr0"
      }
    }
  ]
}