{
  "_ts": 0,
  "id": "d88cf2c8-9e92-4024-b771-74dd20c08310",
  "name": "7 On Sundays™ Podcast",
  "spotifyId": "7anqFZxeR8J3Jt9igPj2Me",
  "appleId": 1730085296,
  "episodes": [
    {
      "id": "29b8d01a-9152-499e-afd7-9fdab3971de6",
      "title": "My Partner Was My Sex Trafficker - Linsey\u0027s Story",
      "description": "How does a young woman get trafficked by her boyfriend? Most people think it could never happen to them. In today’s 7 On Sundays Podcast episode, Linsey shares her story of gradual and escalating grooming at the hand\u0027s her boyfriend, who then became her husband and eventually, her trafficker. This story shares how isolation, secrecy, shame, and fear kept Linsey from leaving. She lost all independence and outside support. Linsey shares the complicated nature of these relationships, especially when there are children. What are the long-term impacts of living with (and trying to love) a trafficker? Many people hope that over time, a toxic relationship will get better. They believe that their partner will change. Like Linsey, many fear leaving, because of shame, possible judgment, loss of home, income, transportation, and lifestyle. Linsey made the brave steps for her freedom and today, she educates and champions survivors of human trafficking. Finally, Linsey shares how she found forgiveness and how that has become an essential component to her healing journey. RESOURCES If you suspect someone is the victim of human trafficking Call the National Human Trafficking Hotline, a national 24-hour, toll-free, multilingual anti-trafficking hotline. Call 1-888-373-7888 to report a tip; connect with anti-trafficking services in your area; or request training and technical assistance, general information, or specific anti-trafficking resources. TIMESTAMPS [00:03:01] Linsey shares her story of trafficking [00:08:34] Introduction to pornography [00:10:18] The slow progression of manipulation [00:14:22] Swinging and exploitation [00:18:28] Linsey’s Invisibility in her family [00:22:31] Losing her virginity and parental reaction [00:26:30] The importance of being seen [00:30:32] Healing and navigating traumas [00:35:05] The power of shame [00:39:14] How abusers use shame as a manipulation tool [00:42:20] Forgiveness and self-worth [00:45:43] Trafficking as cult indoctrination [00:47:20] Taking back her voice [00:52:42] Society\u0027s desensitization to sexual and abusive behaviors [00:55:28] Listening to your internal dialogue [00:59:57] The impact of manipulative factors and isolation [01:06:50] The power parents\u0027 words and children\u0027s perception",
      "release": "2024-03-31T11:00:00Z",
      "duration": "01:08:31.6020000",
      "explicit": false,
      "spotifyId": "7kDKmvOxwbhsZEed5LuWji",
      "appleId": 1000650975391,
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7kDKmvOxwbhsZEed5LuWji",
        "apple": "https://podcasts.apple.com/podcast/my-partner-was-my-sex-trafficker-linseys-story/id1730085296?i=1000650975391"
      }
    }
  ]
}