{
  "id": "46424669-22a3-4039-8f65-e0a7bc47fb06",
  "name": "7NEWS Spotlight",
  "youTubeChannelId": "UCSgeCjcPYYZXR62Cykv43sA",
  "episodes": [
    {
      "id": "a49891d9-bd03-4ca7-b9a0-161df4753f5a",
      "title": "Dramatic development in South Korea cult \u0027Providence\u0027 as a top leader arrested",
      "description": "There has been a major development since 7NEWS Spotlight released our global investigation last week - The Cult Next Door. Warrants have been issued for a  number of suspected accomplices in the case against Providence cult leader  Jeong Myung Seok (JMS)\n\nOne of those was JMS’s second in a charge, his successor a woman called Pastor Joeun, she’s accused of luring and grooming women to have sexual intercourse with the now 78 year old. \n\nJust as Ghislaine Maxwell procured young women for Jeffrey Epstein Pastor Joeun is accused of doing virtually the same thing for JMS. \n\nLast week, we released the full documentary, which you can watch here:\nhttps://youtu.be/WKYhDKCm1Io\n\nThe Cult Next Door. 7NEWS Spotlight’s global investigation into a dangerous ‘religious’ group. They were two young Aussie women, enticed by faith and friendship, welcomed into a community made to feel safe and loved. But things quickly changed. \nThis week, in a 7NEWS Spotlight global investigation, for the first time the chilling true stories of the women who escaped a dangerous cult.\nBranded as a religious movement, Providence has been operating in Australia since 1997, and is accused of recruiting young women in local shopping centres and universities then brainwashing them to travel to South Korea to become spiritual brides of a criminal.\n\nSpotlight has uncovered allegations of serious crimes and brainwashing by the outfit which is registered as a charitable organisation in Australia.\n7NEWS Europe correspondent Sarah Greenhalgh this week joins the 7NEWS Spotlight team and, in a world first, travels deep inside the secretive cult compound in South Korea to confront the leaders. \n\n“We’ve been investigating this cult for six months and it has led us across Australia, to the US and South Korea,” said Sarah. “When we started, we knew there were serious allegations of coercive control and various forms of abuse, but we had no idea just how sinister this organisation is. What we’ve uncovered now involves the Australian Federal Police.\n\n“Providence was founded in 1978 by self-professed ‘messiah’ Jeong Meong-Seok (JMS). The group claims to be a Christian religious movement with more than 40,000 Korean members and a presence in more than 70 countries including Australia. The ‘churches’ we’ve visited in Melbourne and Sydney are just like those in South Korea – there’s no signage, no lists of services, certainly no standard, ‘open door’ church policy. Instead, the faithful meet behind frosted glass, using secret pin codes for access.\n\n“Providence is a cult. And the impact it has had on so many young women’s lives is enormous.”\n\nSubscribe to 7NEWS Spotlight for the latest video » http://7news.link/SpotlightSubscribe\nConnect with 7NEWS Spotlight online\nVisit » https://7news.com.au/spotlight\n7NEWS Spotlight Podcast » http://smarturl.it/7NewsSpotlight\nFacebook » https://www.facebook.com/7newsSpotlight/\nTwitter » https://twitter.com/7newsSpotlight/\nInstagram » https://instagram.com/7newsSpotlight/\n\n7NEWS combines the trusted and powerful news brands including Sunrise, The Morning Show, The Latest, and 7NEWS.com.au, delivering unique, engaging and continuous coverage on the issues that matter most to Australians. Watch 7NEWS nightly at 6pm and weekdays at 11:30am and 4pm on Channel 7 and 7plus.\n#7news #spotlight #documentary",
      "release": "2023-07-13T10:00:09Z",
      "duration": "00:07:42",
      "explicit": false,
      "youTubeId": "GSpSl9UQgWc",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GSpSl9UQgWc"
      }
    },
    {
      "id": "e38742a5-8799-4b2a-9f05-677c5c1e3fe6",
      "title": "The Messiah: meet the Australian man who says he\u0027s Jesus and his followers | 7NEWS Spotlight",
      "description": "In this special worldwide investigation, meet the self-proclaimed Messiah whose devoted disciples believe he walked this earth 2,000 years ago. One of the world’s foremost experts on cults, Reverand David Milliken goes inside Alan John Miller’s isolated Queensland compound, where he’s preparing his followers, including children, for the apocalyptic end of the world. This story originally aired in 2011.\n\nSubscribe to 7NEWS Spotlight for the latest video » http://7news.link/SpotlightSubscribe\nConnect with 7NEWS Spotlight online\nVisit » https://7news.com.au/spotlight\n7NEWS Spotlight Podcast » http://smarturl.it/7NewsSpotlight\nFacebook » https://www.facebook.com/7newsSpotlight/\nTwitter » https://twitter.com/7newsSpotlight/\nInstagram » https://instagram.com/7newsSpotlight/\n\n7NEWS combines the trusted and powerful news brands including Sunrise, The Morning Show, The Latest, and 7NEWS.com.au, delivering unique, engaging and continuous coverage on the issues that matter most to Australians. Watch 7NEWS nightly at 6pm and weekdays at 11:30am and 4pm on Channel 7 and 7plus.",
      "release": "2021-04-16T21:00:30Z",
      "duration": "00:32:04",
      "explicit": false,
      "youTubeId": "d0-ustkfE9w",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d0-ustkfE9w"
      }
    }
  ]
}