{
  "id": "4b8ff2ac-4786-4382-88b3-f14535eb92d6",
  "name": "A Bunch of Therapists",
  "spotifyId": "5zrUgJqUIB4Pol0YnBD3dQ",
  "appleId": 1815898293,
  "youTubeChannelId": "UCstoDA0TQIrIpexBxtM5t8A",
  "episodes": [
    {
      "id": "ad94b549-712b-4dc2-b85b-3971314a9758",
      "title": "Cult Survivor to Therapist | Bruno Nice",
      "description": "This episode contains discussion around high control organisations, cults, religious trauma, coercive control, and therapeutic harm. Join us for an eye-opening and deeply personal conversation with counsellor Bruno Nice as he shares his extraordinary journey from being born into a high control religious group to becoming a therapist specialising in cult recovery and organisational trauma. This powerful discussion explores how surviving coercive control can inform therapeutic practice, and why understanding these dynamics is essential for helping others break free from harmful systems. Hosted by: Michaela McCarthy (Founder of The Awareness Centre, The Awareness Centre Training School, and Creator and Host of A Bunch of Therapists Podcast. Senior BACP Accredited Psychotherapist and Influential Leader) and Dipti Solanki (Therapist, Coach \u0026 Consultant, Mental Health Trainer and Founder of Grief Matters 4 All CIC). In this compelling episode, Bruno openly shares: • Growing up in a high control religious sect from the 1980s • How the group controlled every aspect of his life - music, relationships, movement and identity • Feeling \u0027different\u0027 and struggling to fit in within the group\u0027s rigid framework • His parents\u0027 concern and encouragement to seek therapy • A traumatic experience with an unethical therapist who later abused other young men • The brave decision to leave the religion and his family home • How his negative therapy experience inspired him to train as a person-centred counsellor • Understanding coercive, threatening and exploitative group behaviours • Specialising in working with current and former cult members • Recognising the signs of high control organisations - religious and secular • The journey from survivor to healer and expert This essential conversation offers profound insights for anyone affected by high control groups, religious trauma, or seeking to understand cult dynamics and recovery. Key Topics Discussed: • What defines high control organisations and cults • Coercive control tactics used to demand total loyalty • The psychological impact of growing up in restrictive religious environments • Identity suppression and the struggle to be yourself • Recognising red flags in religious and secular organisations • The lasting effects of religious trauma • Therapeutic harm and unethical practitioner behaviour • Finding courage to leave family and familiar systems • Person-centred counselling as a healing approach • Supporting survivors of cults and high control groups • From victim to expert: using lived experience in therapeutic practice \u0026#x1f3ac; Watch full episodes of A Bunch of Therapists on our YouTube channel \u0026#x1f3a7; A Bunch of Therapists is available on all major podcast platforms \u0026#x1f5d3;️ New episodes every Thursday Follow A Bunch of Therapists on Social Media: YouTube: @ABunchofTherapistsTV TikTok: @a.bunch.of.therapists Instagram: @abunchoftherapists Facebook: A Bunch of Therapists LinkedIn: A Bunch of Therapists #TherapyUK #CultRecovery #HighControlGroups #ReligiousTrauma #CoerciveControl #CounsellingTherapy #MentalHealthUK #TherapyTraining #Trauma #cult #cultsurvivor",
      "release": "2025-12-04T06:00:00Z",
      "duration": "00:37:25.1610000",
      "explicit": false,
      "spotifyId": "34IrxhrYt7EpyHV6tJgdge",
      "appleId": 1000739634286,
      "youTubeId": "KF86Y3P3hFE",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery",
        "Psychology",
        "Family Cult",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34IrxhrYt7EpyHV6tJgdge",
        "apple": "https://podcasts.apple.com/podcast/cult-survivor-to-therapist-bruno-nice/id1815898293?i=1000739634286",
        "youtube": "https://www.youtube.com/watch?v=KF86Y3P3hFE"
      }
    }
  ]
}