{
  "_ts": 0,
  "id": "ea72bc1e-e5a2-479e-80db-42315fd96c38",
  "name": "A Trauma Survivor Thriver’s Podcast",
  "spotifyId": "5No9NH1WJKcS3MbaewAe1a",
  "appleId": 1521591495,
  "episodes": [
    {
      "id": "d479aaaf-71c6-4d1c-851f-48679c8a1d7f",
      "title": "Sexual Abuse \u0026 Boundaries",
      "description": "Thank you for joining us for a A Trauma Survivor Thriver’s Podcast now on Mental Health News Radio Network. This podcast is also available wherever you get your podcasts but I do suggest checking out Mental Health News Radio Network to find all your podcasts related to mental health.  Today’s guest is Merle Yost. Merle is a psychotherapist, author of six books, including his latest, Facing the Truth of Your Life. He has been a private practice therapist for over 30 years and specializes in trauma, men sexually abused as children, gynecomastia, and bi and gay heterosexually married men. After growing up in a cult and being sexually abused as a child, his healing journey led him to help others claim their power and lives.  That was Merle Yost, psychotherapist and author of, Facing the Truth of Your Life. February’s issue of Authentic Insider is out. Check out Authentic Insider at traumasurvivorthriver.com. That’s TRAUMA SURVIVOR THRIVER-dot-com as well as past episodes of A Trauma Survivor Thriver’s Podcast. If you haven’t already, please subscribe to my email list to get Authentic Insider Magazine in your inbox monthly.  We will be back next week when I speak with Neurosequential specialist, Martin Simms about the important roles youth sports coaches play in recognizing trauma.",
      "release": "2024-02-08T08:30:00Z",
      "duration": "00:45:53.7500000",
      "explicit": false,
      "spotifyId": "7MBLiKCMKW3SIhiMR37Vje",
      "appleId": 1000644603031,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MBLiKCMKW3SIhiMR37Vje",
        "apple": "https://podcasts.apple.com/podcast/sexual-abuse-boundaries/id1521591495?i=1000644603031"
      }
    }
  ]
}