{
  "id": "67d44b5c-7421-4f9a-89db-5564f67da7a9",
  "name": "A Very British Cult",
  "spotifyId": "5dtqSBKauSYP7vRoxTw5k7",
  "appleId": 1679737896,
  "youTubeChannelId": "",
  "episodes": [
    {
      "id": "be8342de-698c-4e30-b4f1-e839559fea15",
      "title": "7. Us and Them",
      "description": "The people inside cults aren’t the only ones whose lives are transformed. There’s also the family members and friends, who are left behind.    When Jeff left Lighthouse, he quickly found there was a whole community with loved ones still part of the organisation. Catrin meets a father who says it feels like his daughter is dead. Meanwhile there is an unexpected twist. There’s been another investigation, in secret, and parallel to ours.    What happens when a life coach takes over your life? Catrin Nye and her team expose control, intimidation and fear at a sinister life coaching company.  Reporter: Catrin Nye   Written by: Jamie Bartlett and Catrin Nye   Producers: Osman Iqbal, Natalie Truswell, Ed Main \u0026 Jo Adnitt   Researcher: Aisha Doherty   Executive Producer: Ravin Sampat   Sound Mixing: James Bradshaw   Original Music by: Phil Channell  Commissioner: Rhian Roberts",
      "release": "2023-04-05T00:00:00",
      "duration": "00:29:27.9080000",
      "explicit": false,
      "spotifyId": "0cLih8v92RbdMm1WTHgcV3",
      "appleId": 1000607444539,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0cLih8v92RbdMm1WTHgcV3",
        "apple": "https://podcasts.apple.com/podcast/7-us-and-them/id1679737896?i=1000607444539",
        "youtube": null
      }
    },
    {
      "id": "fe2c5266-2ca9-4a95-b178-5f9586693dfe",
      "title": "8. The Showdown",
      "description": "It’s the final showdown. The BBC team finds out there’s been another investigation going on in parallel to their one. It’s by the Government, who want Lighthouse shut down.   Lighthouse International Group end up in court, and more than 20 team members crowd into the hearing room, squashed alongside the BBC as well as Jeff and Dawn. Catrin finally gets to put her questions to Lighthouse and their leader Paul Waugh, and a massive crowd piles down a central London street as she tries to get answers.     What happens when a life coach takes over your life? Catrin Nye and her team expose control, intimidation and fear at a sinister life coaching company.  Reporter: Catrin Nye  Written by: Jamie Bartlett and Catrin Nye  Producers: Osman Iqbal, Natalie Truswell, Ed Main \u0026 Jo Adnitt  Researcher: Aisha Doherty  Executive Producer: Ravin Sampat  Sound Mixing: James Bradshaw  Original Music by: Phil Channell  Commissioner: Rhian Roberts",
      "release": "2023-04-05T00:00:00",
      "duration": "00:29:39.2750000",
      "explicit": false,
      "spotifyId": "0fKg8k99rc9q7vNgsuCvH9",
      "appleId": 1000607446084,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fKg8k99rc9q7vNgsuCvH9",
        "apple": "https://podcasts.apple.com/podcast/8-the-showdown/id1679737896?i=1000607446084",
        "youtube": null
      }
    },
    {
      "id": "cb5d16de-fab6-4e39-9f97-698784f1b22e",
      "title": "1. Lighthouse",
      "description": "In November 2021 investigative journalist Catrin Nye got a call from Dawn. She said her boyfriend Jeff was trying to leave a cult. But this cult was also a life coaching company.  Dawn said Jeff had handed over more than £100,000 to them and wasted years of his life. And what Dawn is really worried about is that the group are still active; they’re recruiting new members and she needs to raise the alarm. Jeff had simply signed up for a life coach, so how did it all go so wrong for him?   What happens when a life coach takes over your life? Catrin Nye and her team expose control, intimidation and fear at a sinister life coaching company.     Reporter: Catrin Nye  Written by: Jamie Bartlett and Catrin Nye  Producers: Osman Iqbal, Natalie Truswell, Ed Main and Jo Adnitt  Researcher: Aisha Doherty  Executive Producer: Ravin Sampat  Sound engineer: James Bradshaw  Original music by: Phil Channell  Commissioner: Rhian Roberts   Archive clips from: Stephen Covey Video on Choosing Success (Success Television)",
      "release": "2023-04-04T00:00:00",
      "duration": "00:29:02.7980000",
      "explicit": true,
      "spotifyId": "6nkNsh0tz6roKHqT9VtXLL",
      "appleId": 1000607440010,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nkNsh0tz6roKHqT9VtXLL",
        "apple": "https://podcasts.apple.com/podcast/1-lighthouse/id1679737896?i=1000607440010",
        "youtube": null
      }
    },
    {
      "id": "56d42cc5-1188-4eec-950b-1ccdc9e35523",
      "title": "2. The Daily Call",
      "description": "Jeff is being drawn deeper and deeper into a life coaching group called Lighthouse. He loves having a mentor and feels great about life. Now it’s time to take the next step, to go full time. But what exactly awaits Jeff, and what is it going to cost him?  What happens when a life coach takes over your life? Catrin Nye and her team expose control, intimidation and fear at a sinister life coaching company.   Reporter: Catrin Nye Written by: Jamie Bartlett and Catrin Nye Producers: Osman Iqbal, Natalie Truswell, Ed Main \u0026 Jo Adnitt Researcher: Aisha Doherty Executive Producer: Ravin Sampat Sound Mixing: James Bradshaw Original Music by: Phil Channell Commissioner: Rhian Roberts",
      "release": "2023-04-04T00:00:00",
      "duration": "00:28:54.4850000",
      "explicit": true,
      "spotifyId": "6P4KAnkqW7U7arFXrJB4J1",
      "appleId": 1000607442279,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6P4KAnkqW7U7arFXrJB4J1",
        "apple": "https://podcasts.apple.com/podcast/2-the-daily-call/id1679737896?i=1000607442279",
        "youtube": null
      }
    },
    {
      "id": "939a7709-de07-40c2-b6b7-7046853af9c7",
      "title": "3. The Life Coach",
      "description": "Catrin is quite cynical about the concept of life coaching. She’s now spent months speaking with people who signed up to it and ended up in a cult. So, she has a session with one of Ireland’s most in-demand coaches to see if he can change her mind.   Then Catrin meets Anthony, who found Lighthouse during a very dark time in his life. She’s shocked by what she hears about his mentor’s approach to Anthony’s mental health issues.  What happens when a life coach takes over your life? Catrin Nye and her team expose control, intimidation and fear at a sinister life coaching company.  Reporter: Catrin Nye Written by: Jamie Bartlett and Catrin Nye Producers: Osman Iqbal, Natalie Truswell, Ed Main \u0026 Jo Adnitt Researcher: Aisha Doherty Executive Producer: Ravin Sampat Sound Mixing: James Bradshaw Original Music by: Phil Channell Commissioner: Rhian Roberts",
      "release": "2023-04-04T00:00:00",
      "duration": "00:29:46.4090000",
      "explicit": false,
      "spotifyId": "53KQbxfmpvJEGn8vFj5YL6",
      "appleId": 1000607442328,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/53KQbxfmpvJEGn8vFj5YL6",
        "apple": "https://podcasts.apple.com/podcast/3-the-life-coach/id1679737896?i=1000607442328",
        "youtube": null
      }
    },
    {
      "id": "5adca239-9330-4457-9193-e334050e8850",
      "title": "4. Getting Out",
      "description": "The investigation is finding out more and more strange things about Lighthouse. We hear what happens when people start to question what is happening. Catrin speaks with Erin who raised concerns about Lighthouse and was accused of being \u0022a cynical little old witch\u0022.   Meanwhile Lighthouse is getting increasingly obsessed with its critics and former members.   What happens when a life coach takes over your life? Catrin Nye and her team expose control, intimidation and fear at a sinister life coaching company.   Reporter: Catrin Nye  Written by: Jamie Bartlett and Catrin Nye  Producers: Osman Iqbal, Natalie Truswell, Ed Main \u0026 Jo Adnitt  Researcher: Aisha Doherty  Executive Producer: Ravin Sampat  Sound Mixing: James Bradshaw  Original Music by: Phil Channell  Commissioner: Rhian Roberts   Archive clips from Stanley Milgram, Solomon Asch Conformity experiment re-enactment, 1974: copyright Alexandra Milgram and Alexander Street.",
      "release": "2023-04-04T00:00:00",
      "duration": "00:30:55.6450000",
      "explicit": true,
      "spotifyId": "0noSgOpJotqDU0uw7dgGM1",
      "appleId": 1000607442302,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0noSgOpJotqDU0uw7dgGM1",
        "apple": "https://podcasts.apple.com/podcast/4-getting-out/id1679737896?i=1000607442302",
        "youtube": null
      }
    },
    {
      "id": "1cfbfc9b-74e6-4879-a1f5-70c551efdfc9",
      "title": "5. Paulie",
      "description": "To understand Lighthouse, Catrin needs to try and understand Paul Waugh. She delves into his past to investigate his claims of incredible wealth, high profile business connections, and a difficult childhood.    What happens when a life coach takes over your life? Catrin Nye and her team expose control, intimidation and fear at a sinister life coaching company.   Reporter: Catrin Nye  Written by: Jamie Bartlett and Catrin Nye  Producers: Osman Iqbal, Natalie Truswell, Ed Main \u0026 Jo Adnitt  Researcher: Aisha Doherty  Executive Producer: Ravin Sampat  Sound Mixing: James Bradshaw  Original Music by: Phil Channell  Commissioner: Rhian Roberts   Archive clips: Unleashing the Power Within - An Owner\u0027s Manual for the Brain (Robbins Research Institute); Zig Ziglar - Changing the Picture (Zig Ziglar Corporation); Harvey Mackay: Best-Selling Author \u0026 Entrepreneur (Eagles Talent); The Oprah Winfrey Show 1993 (Harpo Productions); The Oprah Winfrey Show 1988 (Harpo Productions); The Oprah Winfrey Show 1996 (Harpo Productions).",
      "release": "2023-04-04T00:00:00",
      "duration": "00:29:09.0340000",
      "explicit": true,
      "spotifyId": "2x1aAnvWxhl9v1jshqS1p4",
      "appleId": 1000607443011,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2x1aAnvWxhl9v1jshqS1p4",
        "apple": "https://podcasts.apple.com/podcast/5-paulie/id1679737896?i=1000607443011",
        "youtube": null
      }
    },
    {
      "id": "9c694ccc-cc98-49d7-8fb4-0223d15e1fb3",
      "title": "6. Control",
      "description": "We meet Simon, who ended up deep in Lighthouse, recruiting for them, monitoring their critics and living with his mentor. But one day Simon says he realised he was actually in a cult, and he had no choice but to pack his bags and run.    What happens when a life coach takes over your life? Catrin Nye and her team expose control, intimidation and fear at a sinister life coaching company.   Reporter: Catrin Nye   Written by: Jamie Bartlett and Catrin Nye   Producers: Osman Iqbal, Natalie Truswell, Ed Main \u0026 Jo Adnitt   Researcher: Aisha Doherty   Executive Producer: Ravin Sampat   Sound Mixing: James Bradshaw   Original Music by: Phil Channell  Commissioner: Rhian Roberts",
      "release": "2023-04-04T00:00:00",
      "duration": "00:29:09.9600000",
      "explicit": false,
      "spotifyId": "3amtUDfCQprRjJtgWAnAgM",
      "appleId": 1000607444538,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3amtUDfCQprRjJtgWAnAgM",
        "apple": "https://podcasts.apple.com/podcast/6-control/id1679737896?i=1000607444538",
        "youtube": null
      }
    },
    {
      "id": "4209053b-005f-41ce-87f5-dd3224ec14a9",
      "title": "Welcome to... A Very British Cult",
      "description": "Catrin Nye gets a mysterious call that plunges her into an unsettling world of self-help and cults. What happens when a life coach takes over your life?  In early 2019 Jeffrey Leigh-Jones from Portsmouth got a life coach. Someone to mentor him in life and help him realise his business ambitions.   Two years later, Jeff had sold his house, his relationship was in pieces, and he had handed over tens of thousands of pounds. And he wasn’t the only one. In this eighteen-month investigation for the BBC, journalist Catrin Nye and her team expose control, intimidation and fear at a mysterious life coaching company taking over people’s lives and ripping families apart.   As the investigation hots up, the group fights back, and there’s a surreal final showdown…  Listen to all eight episodes from Wednesday 5 April 2023.   Reporter: Catrin Nye Written by: Jamie Bartlett and Catrin Nye Producers: Osman Iqbal, Natalie Truswell, Ed Main and Jo Adnitt Researcher: Aisha Doherty Executive producer: Ravin Sampat Sound engineer: James Bradshaw Original music by: Phil Channell Commissioner: Rhian Roberts",
      "release": "2023-03-29T00:00:00",
      "duration": "00:02:11.9910000",
      "explicit": false,
      "spotifyId": "5Rr9jRzrjOFOcJiAauLAGH",
      "appleId": 1000606429265,
      "youTubeId": null,
      "subjects": [
        "LIG",
        "Lighthouse International Group",
        "Paul Waugh",
        "Christopher Nash",
        "Chris Nash",
        "Shaun Cooper",
        "Warren Vaughan",
        "A Very British Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Rr9jRzrjOFOcJiAauLAGH",
        "apple": "https://podcasts.apple.com/podcast/welcome-to-a-very-british-cult/id1679737896?i=1000606429265",
        "youtube": null
      }
    }
  ]
}