{
  "id": "ee634e55-7462-4229-b601-61f09fffe056",
  "name": "Adam Bros",
  "youTubeChannelId": "UCn_0enG7S9ogGPO2IGXhhdA",
  "episodes": [
    {
      "id": "a3a64c0c-be92-4ba6-9a5e-9ca571561e1f",
      "title": "Les dangereuses dérives sectaires des influenceurs...",
      "description": "Hey salut à tous et bienvenue dans cette nouvelle vidéo où on va parler des dérives sectaires des influenceurs.\n\nMerci encore à Quentin Bruet-Ferréol pour sa participation ! Son compte Instagram : https://www.instagram.com/le_tryangle/\n\nOubliez pas le pouce bleu ainsi que le partage à vos amis pour soutenir la chaîne ! On se retrouve très vite pour une prochaine vidéo !\n\nLes sources principales :\n- Factors related to susceptibility and recruitment by cults par JM Curtis\n- Danse avec le diable : Une secte sur TikTok? par Jessica Acevedo\n- Cult membership: What factors contribute to joining or leaving? par Morgane Rousselet, Jean-Baptiste Hardouin et Marie Grall-Bronnec\n- The Concept of Cult par Geoffrey Nelson\n- Charismatic authority and the YouTuber: Unpacking the new cults of personality par Hayley Cocker et James Cronin\n- La secte sécularisée : étude d\u0027un processus de requalification conceptuelle par Étienne Ollion\n- La notion de « dérive sectaire » : quelle(s) implication(s) pour la régulation du « phénomène sectaire » ? par Benjamin Mine\n- Bannie de TikTok, l’influenceuse Ophenya signalée à la justice par la Miviludes par Aurélien Defer\n- How Social Media Features Parallel Cult Techniques par Center for Humane Technology\n- Inside the Social Media Cult That Convinces Young People to Give Up Everything par Emilie Friedlander et Joy Crane\n\nMes réseaux sociaux:\nInstagram: @adambrosyt\nTwitter: @adam_bros\n\n00:00 : Introduction\n00:34 : Les nouvelles formes de croyances\n04:35 : Les mécanismes sectaires sur les réseaux sociaux\n11:37 : Les célébrités embrigadées dans des sectes \n15:40 : L’autorité charismatique des influenceurs\n20:15 : Une relation toxique à la communauté\n26:02 : Repenser la dérive sectaire",
      "release": "2025-03-16T14:00:15Z",
      "duration": "00:31:29",
      "explicit": false,
      "youTubeId": "9JndBCgUJuk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9JndBCgUJuk"
      }
    }
  ]
}