{
  "id": "dbabbdef-a3dd-424c-97b0-f0bcc5c8b964",
  "name": "Adult Child of Dysfunction",
  "spotifyId": "0O3ixi4pBJjo1Z1OAdrwJa",
  "appleId": 1708247499,
  "episodes": [
    {
      "id": "dffb0079-65ae-49ad-bcbf-22e4b5d98e5e",
      "title": "Beeing Simply Brave: Overcoming Cults, Control and More: Guest Wren Story",
      "description": "Tune in to our latest podcast episode featuring Wren Story, a remarkable neurodivergent adoptee, mom of six, cult escaper, DV survivor, and chronic illness warrior.Wren shares her inspiring journey of overcoming adversity, from growing up in a high-control church to battling chronic illnesses and escaping domestic violence. She discusses how she found her grounding and created Simply Beeing digital magazine as a legacy for her children, offering declarations for every area of life as a safeguard from high-control groups. Don\u0027t miss this empowering story of resilience and transformation! To find out more visit: https://www.facebook.com/search/top?q=wren%20story https://www.instagram.com/simplybeeingwren/ https://www.tiktok.com/@simplybeeing If any of this resonates with you, and you think that you may be suffering the lingering effects of a dysfunctional childhood, join us now at any of the links below. If you have a question and you want it answered on one of our podcast episodes, please ask your questions here: https://www.speakpipe.com/tammyvincentcoaching You will be notified when your question is answered! Join Us In A Holistic Wellness Summit March 6 - 8th! http://tinyurl.com/HWSTammy Book a FREE calL: https://calendly.com/tammyvincent/30-minute-discovery-call FREE Webinar: https://workshops.tammyvincent.com/webinar-registration-1 Facebook Group: https://www.facebook.com/groups/1087928608822377 Learn How Essential Oils Can Help You Fix What Ails You Naturally https://calendly.com/tammyvincent/head-to-toe-wellness-consultation Interested in Booking Tammy for a speaking engagement? Reach out now and let\u0027s see if I would be a great fit for your next event... https://calendly.com/tammyvincent/speakers-event-chat Join Serenity Circle and have an unlimited supply of healers and support. https://serenity-circle.circle.so/checkout/dollar47-founding-member?affiliate_code=b61853 About Tammy: Tammy Vincent, a survivor and thriver, has transformed her life from the challenges of being an adult child of two alcoholic parents. With a Masters in Education and addiction and recovery certifications, shes a beacon of hope for others on their paths to transformation. As a devoted mother of three grown children and a loving wife, Tammy\u0027s personal journey of healing and empowerment has led her to become a certified life coach and NLP practitioner. Her dedication to growth has been illuminated through her best-selling books, two powerful volumes that offer insights, guidance and inspiration to those seeking their own paths to healing. Tammy’s mission is clear; to guide others out of the darkness and into becoming the best versions of themselves. Her journey, from survivor to certified life coach, NLP practitioner, speaker and author, exemplifies the incredible strength of the human spirit and the possibility of rewriting our stories from a place of empowerment and healing. https://www.tammyvincent.com/ Thanks for listening! Thanks so much for listening to our podcast! Do you have some feedback or questions about this episode? Leave a comment in the section below! Subscribe to the podcast and Leave a Review. Subscribe in your favorite podcast app. Reviews are extremely valuable in helping me to spread the message of hope and healing. Please rate, share, and download episodes so we can help spread the word.",
      "release": "2024-03-07T09:00:00Z",
      "duration": "00:45:09.5950000",
      "explicit": false,
      "spotifyId": "1yz6GnyGWnYxSggGhiHODK",
      "appleId": 1000648328421,
      "subjects": [
        "Self-Help",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1yz6GnyGWnYxSggGhiHODK",
        "apple": "https://podcasts.apple.com/podcast/beeing-simply-brave-overcoming-cults-control-and-more/id1708247499?i=1000648328421"
      }
    }
  ]
}