{
  "_ts": 0,
  "id": "319543cb-cd2a-46ca-bdcc-327b9a3ddf32",
  "name": "Advocates for the Truth",
  "youTubeChannelId": "UCLHEtiAzN1oSAIRLoeHRK0Q",
  "episodes": [
    {
      "id": "238be520-c391-4af6-916e-ec589a3fbad5",
      "title": "Understanding Abuse of Power in the Church \u002B Q\u0026amp;A with Dr Diane Langberg",
      "description": "Dr. Diane Langberg and Dr. Philip Monroe join the AFTT community for a screening of \u0027Understanding Abuse of Power in the Church\u0027 followed by a Q\u0026A. \nRecorded Sept 21, 2024",
      "release": "2024-09-22T06:02:10Z",
      "duration": "01:18:17",
      "explicit": false,
      "youTubeId": "KTRRQyr3UWU",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KTRRQyr3UWU"
      }
    },
    {
      "id": "a74b3dd3-36d3-4709-a62d-9cc5565845b6",
      "title": "AFTT TOWN HALL JULY 2 2024",
      "description": "July 2nd, 2024",
      "release": "2024-08-13T05:49:56Z",
      "duration": "02:26:43",
      "explicit": false,
      "youTubeId": "CpxmnVqSnbM",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CpxmnVqSnbM"
      }
    },
    {
      "id": "0af2bd51-d093-46bb-82c3-051984c2fe72",
      "title": "Greg Swenson / Kris Johnson discussion",
      "description": "Former Worker Greg Swenson and CSA survivor Kris Johnson talk changing complicity, learning from the past, and supporting survivors.",
      "release": "2024-06-25T21:55:17Z",
      "duration": "01:03:03",
      "explicit": false,
      "youTubeId": "WU45m0h2ebs",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WU45m0h2ebs"
      }
    },
    {
      "id": "ea1ee371-3e73-42b6-992b-09d2ed26dcb3",
      "title": "Washington North Idaho and Alaska Staff Meeting - June 4th 2024",
      "description": "TW: Child Sex Abuse - Abuse Cover Up Discussion Within 2x2 Church Leadership\n\nThe viewing/listening of this can be confronting for anyone, but especially for victims. Suggestions for safe viewing/listening include: choosing to listen/watch it alongside people you feel safe with and trust, rather than listening/watching it alone. You can choose to listen/watch it in small portions rather than all at once. Know that there is no requirement to listen/watch it as soon as it comes out, or even at all - do what is best for your mental well-being. You could ask someone you trust to watch it and share the information. And lastly, if you are distressed by listening/watching it, remember that you are not alone and there are others who will be experiencing the same response as you. There is no shame in that response. Always if you need to, reach out for support.\n\nFollowing is the full audio, with captions, of a recent Washington, Northern Idaho, Alaska (WANIDAK) workers’ meeting discussing the rejection of guidelines of child sex abuse and sex assault, as well as the results of a sex abuse investigation conducted by the GRACE organization (Godly Response to Abuse in the Christian Environment).\n\nIn the meeting, Darryl Doland, overseer of the WANIDAK region, shares that he is concerned about a recent investigative report by the GRACE organization, and the implementation of guidelines regarding sex abuse allegations (including CSA/SA) within the fellowship.  Doland states, ”And I don\u0027t know anyone that was closely involved in the investigation that would ever do it again. And I\u0027ve, of course, talked to everybody that\u0027s been involved. At this point, I\u0027m going to have to say, from my perspective, I\u0027m not sold on investigations.  And that\u0027s a pretty major thing, because if I\u0027m not sold on investigations, our guidelines have problems.”  \n\nDoland goes on to say, “And like when we hired GRACE, the idea of that was that it would be like the gold standard in that If we had an investigation like that, that people would be able to trust the results.  Well, I don\u0027t think it changed anybody\u0027s mind. If it did, I don\u0027t know who it is.”  Doland shares that earlier in the day, “....Alan Mitchell (Overseer of Queensland, Australia) called me from Australia and he goes, ‘Hey, Darryl, I\u0027ve got to hear about your investigation, how are you feeling about it?’  And I said, ‘Well, I don\u0027t think I\u0027d do it again.’ He said, ‘Oh, I\u0027m so glad to hear that. Do you mind talking to all the overseers in Australia and New Zealand about this?’” In the recording, Doland shares his feelings that implementing policies, guidelines, and investigations fall outside of the scope of his spirit-led leadership.  He offers a reflection of the significance of being aligned with scripture, and that they had not been considerate of a significant number of CSA victims and perpetrators that had moved on saying, “But I realize that there is actually an amazing number of people in our fellowship who have had bad experiences, including with CSA, and both the perpetrator and the victim have moved on with God\u0027s grace.”   \n\n(For the record, the comprehensive investigation conducted by GRACE found the victim to be credible.  We are left to wonder why the ministry is so unhappy with the investigation.  Also for the record, it is AFFT’s understanding that the survivor who was the subject of the investigation spoke with Doland and indicated they were unhappy with the investigation; however, it seems Doland misunderstood or mischaracterized what the survivor meant.  The survivor made the point that the investigation did not have to take place because none of the information was new. It was all known before the investigation started. If the ministry believed all victims, the investigation wouldn\u0027t have been needed. The survivor believes there are cases where investigations will be needed, but in the majority of cases, a determination could be made with the information presented in the allegation if the survivor victim is believed.)",
      "release": "2024-06-14T20:21:56Z",
      "duration": "01:25:22",
      "explicit": false,
      "youTubeId": "aJc8wws_obE",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aJc8wws_obE"
      }
    },
    {
      "id": "a87a2731-3c5c-4d25-84ae-6615e4b0a39e",
      "title": "AFTT TOWN HALL APRIL 27 2024",
      "description": "Advocates For The Truth Town Hall. April 27, 2024\n\nNote - This video replaces a video from earlier this week that mistakenly included the April 18 town hall.",
      "release": "2024-05-03T18:11:12Z",
      "duration": "02:13:34",
      "explicit": false,
      "youTubeId": "hxk9hTfPYm4",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hxk9hTfPYm4"
      }
    },
    {
      "id": "5e29750b-1ce9-4456-a76a-56a2b7d19c8e",
      "title": "AFTT TOWN HALL - APRIL 18, 2024",
      "description": "Town Hall Q\u0026A with the AFTT team.",
      "release": "2024-04-21T16:25:40Z",
      "duration": "02:04:40",
      "explicit": false,
      "youTubeId": "fEL3oIl7mGc",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fEL3oIl7mGc"
      }
    },
    {
      "id": "81cbe0f1-6ac1-4783-a80e-d40a7e6b249c",
      "title": "AFTT Town Hall, Jan 19, 2024",
      "description": "Introducing new AFTT Executive Director, Dr. Natalie Bolin",
      "release": "2024-04-21T16:01:07Z",
      "duration": "01:10:52",
      "explicit": false,
      "youTubeId": "3HueQ74SvuQ",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3HueQ74SvuQ"
      }
    },
    {
      "id": "7f23f295-5714-43e0-991b-63be189eb521",
      "title": "AFTT- 2024 Summit Round Table Discussion Preview 1",
      "description": "2024 Summit Roundtable Discussion with Dr. Natalie Bolin, AFTT Executive Director\rTodd Price, FBI Special Agent (Ret.), AFTT Consultant\rCynthia Liles, Licensed PI, AFTT Co-Founder\rLauren Rohs, AFTT Co-Founder\rDenise Doucette, Corrections Counselor. Learn more about the ongoing investigation of criminal activity within the 2 x 2 fellowship.\nStay tuned as we are happy to announce we will be adding video content over the next month!\n.......\n\nAdvocates For The Truth: Giving voice, protection, and justice to survivors associated with the church and religious fellowship commonly called truth, 2x2 faith, meetings, friends and workers, and the way. To learn more, please visit our website: advocatesforthetruth.com\n\nSurvivor Confidential Hotline: Call or Text \nUS: (503) 386-4634  International: (503) 334-6866\n\nNational Suicide Hotline: 988\n\nAll information on this page has been gathered and written by AFTT employees and volunteers. Copyright © 2023-2024",
      "release": "2024-04-18T13:11:18Z",
      "duration": "00:08:50",
      "explicit": false,
      "youTubeId": "8hoLPW77L0w",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8hoLPW77L0w"
      }
    }
  ]
}