{
  "id": "b56e45f3-78a9-466e-b4b9-24ea52f0d41e",
  "name": "Africa Here and NOW",
  "spotifyId": "04RFKbgnF7i95RRNWl0eBn",
  "appleId": 1714509526,
  "youTubeChannelId": "UCyP4AwoiSkNR1wtXHiEnYYg",
  "episodes": [
    {
      "id": "ab685a7d-89f8-451a-acca-da4fb56a1e6a",
      "title": "Burkina Faso\u0027s Ibrahim Traore: What\u0027s True? What\u0027s False?",
      "description": "Why has Burkina Faso\u0027s military leader, IBRAHIM TRAORE, garnered such adulation? That\u0027s a question for the renowned investigative journalist, DAVID HUNDEYIN who replies that the young captain, he\u0027s just 37, symbolises s break from the status quo and offers hop to a youthful continent whose people yearn for a hero. Who, or what, is behind the social media tsunami that surrounds CAPTAIN TRAORE? We consider whether the multitude of social media posts extolling his often other-worldly virtues are true or fake. Many of them clearly use images and sound fabricated by AI - like a Beyonce look-alike who weeps as she prays for the protection of her \u0027king\u0027. We wonder whether such fantastical excesses could actually undermine TRAORE. We also question why we hear so few Burkinabe voices on the matter. DAVID Suggests the Burkinabe authorities would do well to take a firmer grip of their own narrative. Impressive claims are made about the rule of CAPTAIN TRAORE, like ending all taxation and undertaking extensive road building. But what about the security situation? Reports suggest that government control extends to just a third of the country. The rest, they say, is under the control of various Islamist groups with many people displaced from their villages. What is needed, says PATRICK, is robust reporting by independent journalists from inside Burkina Faso to establish the facts. DAVID says objectivity in journalism does not exist - everyone has an interest, a bias. And DONU raises the inherent dangers of a cult of personality. DAVID suggests that there are limited benefits from democratic systems of government in Africa - economic freedom is what counts most. MARTINE DENNIS is Founder and Host of Africa Here and Now PATRICK SMITH is Editor of Africa Confidential DONU KOGBARA is a journalist and commentator based in Nigeria We were talking with DAVID HUNDEYIN, Editor of West Africa Weekly Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-05-13T16:00:00Z",
      "duration": "00:38:59.4480000",
      "explicit": false,
      "spotifyId": "6XRLkFbmgYqu8unY43VLGN",
      "appleId": 1000708339858,
      "youTubeId": "ffFLMNHHK4g",
      "urls": {
        "spotify": "https://open.spotify.com/episode/6XRLkFbmgYqu8unY43VLGN",
        "apple": "https://podcasts.apple.com/podcast/burkina-fasos-ibrahim-traore-whats-true-whats-false/id1714509526?i=1000708339858",
        "youtube": "https://www.youtube.com/watch?v=ffFLMNHHK4g"
      }
    }
  ]
}