{
  "id": "27edf9f8-9c83-4fce-961f-96ed3b4ea839",
  "name": "African Diaspora News Channel",
  "appleId": 1658568160,
  "youTubeChannelId": "UCKZGcrxRAhdUi58Mdr565mw",
  "episodes": [
    {
      "id": "46060929-d427-425a-b752-9e89e9401542",
      "title": "South Africans Are Convinced That ORANIA Is More Of A CULT, Than A BOER CULTURE Preservation Town",
      "description": "Reneilwe Morema reports on a new Orania documentary that is making the round on social media. CEO/Representative Of Orania Joost Strydom gave popular African Youtuber, Wode Maya a TOUR AROUND ORANIA. Wade Maya met some of the locals, and even went to see some statues of the Founders of Apartheid. \nWode asked the leader of Orania if having these statues eracted on the soil of the democratic of South Africa and a Rainbow Nation isn\u0027t it offensive to South Africans! Orania leaders answered and said \u0027\u0027THE ZULU PEOPLE HAVE A STATUE OF SHAKA-ZULU ERACTEC IN CENTRAL DURBAN, AND HE KILLED THOUSANDS OF PEOPLE, WHAT MAKES SHAKE ZULU MORE SPECIAL THAN THE ARCHITECTS OF APARTHEID?\u0027\u0027\nThis documentary left people fuming, but some noticed how \u0027\u0027WEIRDLY ORGANIZED\u0027\u0027 ORANIA PEOPLE ARE, Almost like they are in a TRANCE STATE. \nUsers online suspect that, Orania is more of a cult than a \u0027\u0027CULTURAL PRESERVATION, SELF DETERMOINATION TOWN\u0027\u0027. That \u0027\u0027analogy\u0027\u0027 is just a statement to throw people off from knowing what is really going on. \nThere is more than meets the eye! Some Jim Jones stuff happening in that town.",
      "release": "2025-03-14T21:45:21Z",
      "duration": "00:11:36",
      "explicit": false,
      "youTubeId": "QqzAOcJrAW8",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QqzAOcJrAW8"
      }
    },
    {
      "id": "d313dfbb-86e6-47af-913f-2a893f552ae9",
      "title": "Cult Leader And His Associates Finally Charged With Unaliving of 191 Children",
      "description": "Wongel Zelalem reports on Kenyan cult leader Paul Nthenge Mackenzie and 29 associates getting charged with the unaliving of 191 children.",
      "release": "2024-02-21T18:00:00Z",
      "duration": "00:04:10",
      "explicit": false,
      "youTubeId": "c1vixKeyxg0",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c1vixKeyxg0"
      }
    },
    {
      "id": "76d7c922-e29a-49d1-b85e-19613fd9d896",
      "title": "Kenyan Villagers Attempted To Crucify A Man Who Calls Himself \u0027Jesus Of Tongaren\u0027",
      "description": "Demetra Kaye reports on a Kenyan villagers attempting to crucify a man who calls himself \u0027Jesus of Tongaren.\u0027\nConnect with Demetra:\n@demetrakaye",
      "release": "2023-04-16T19:00:09Z",
      "duration": "00:03:01",
      "explicit": false,
      "appleId": 1000609283774,
      "youTubeId": "ZlbVGPAB9o8",
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/kenyan-villagers-attempted-to-crucify-a-man-who/id1658568160?i=1000609283774",
        "youtube": "https://www.youtube.com/watch?v=ZlbVGPAB9o8"
      }
    }
  ]
}