{
  "_ts": 0,
  "id": "5b2dff35-9d39-4fdf-929f-aa0f2f8bae1f",
  "name": "Afterglow: UnVEILING The Idaho Cult Series",
  "spotifyId": "0we7mDVCTOUZExklSSRrie",
  "appleId": 1498278502,
  "youTubeChannelId": "UCcP74RUcUliZ5von9YOz-5Q",
  "youTubePlaylistId": "PLx6PCDf6np8Zuk-5xDmZEGEM581d38TJV",
  "episodes": [
    {
      "id": "0a9b2ceb-14f3-4312-abc5-536df9edb6e1",
      "title": "Whispers from the Cell: The June 8th Revelation",
      "description": "Send us a text \u0027Whispers from the Cell\u0027 takes you inside the chilling conversation between Lori Vallow \u0026 Chad Daybell, recorded just one day before the bodies of JJ Vallow \u0026 Tylee Ryan were found. What secrets lay hidden in their coded language \u0026 religious fervor? We break down the June 8th jail call, a key piece of evidence in the Idaho cult murder trial, revealing their belief in a \u0027millennial day within Zion\u0027 \u0026 their claims of contact with the deceased Alex Cox. Hear the unsettling... Episode link: https://play.headliner.app/episode/26114676?utm_source=youtube",
      "release": "2025-03-16T21:00:00Z",
      "duration": "00:35:00",
      "explicit": false,
      "spotifyId": "7pbfWAahtndWPrjhUiJgB1",
      "appleId": 1000699419901,
      "youTubeId": "_ed0sliFw2A",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7pbfWAahtndWPrjhUiJgB1",
        "apple": "https://podcasts.apple.com/podcast/whispers-from-the-cell-the-june-8th-revelation/id1498278502?i=1000699419901",
        "youtube": "https://www.youtube.com/watch?v=_ed0sliFw2A"
      }
    },
    {
      "id": "d97f5606-e7e5-497d-8c35-e3af0a4640b5",
      "title": "Eleven Days After: Sisters in Conflict.",
      "description": "Send us a text Summer Shiflet found herself at the center of a storm in the Daybell case. This episode explores her emotional journey, beginning with a deeply moving jailhouse call from her sister, Lori Vallow Daybell, just eleven days after the children\u0027s bodies were found. We then analyze the explosive recording of her conversation with prosecutor Rob Wood, which ignited claims of prosecutorial misconduct. \u0022Eleven Days After: Sisters in Conflict\u0022 reveals the complex and conflicting loyalties Summer faced, and the pivotal role she played in the unfolding investigation. Support the show Subscribe to Afterglow for new episodes every Monday! Leave a review on Apple Podcasts! © [2025] [Kathryn Brooks]. All rights reserved. Follow on YouTube: Left Undone Incomplete Investigations for so many Videos of this case and more https://www.youtube.com/channel/UCcP74RUcUliZ5von9YOz-5Q",
      "release": "2025-03-03T06:00:00Z",
      "duration": "00:42:51.7020000",
      "explicit": false,
      "spotifyId": "3SbrMQyMsypdxGOBxsZfW3",
      "appleId": 1000697321102,
      "youTubeId": "xQqhySsl8aU",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3SbrMQyMsypdxGOBxsZfW3",
        "apple": "https://podcasts.apple.com/podcast/eleven-days-after-sisters-in-conflict/id1498278502?i=1000697321102",
        "youtube": "https://www.youtube.com/watch?v=xQqhySsl8aU"
      }
    },
    {
      "id": "dce62f02-bc20-4aae-a4f3-4d78d2b43fa3",
      "title": "The KEY to Joe Ryan\u0027s Apartment | Afterglow: UnVEILING The Idaho Cult Series",
      "description": "Send us a text Join us as we explore the circumstances surrounding Joe Ryan\u0027s death, the third husband of Lori Vallow. We present police interviews from 2020, where detectives attempt to verify claims that Tylee Ryan had a key to Joe\u0027s apartment and entered it after his passing. Listen as we analyze the detective\u0027s questioning, the initial autopsy findings, and the questions that remain unanswered. How does this connect to the larger narrative of Lori Vallow and Chad Daybell, and the series o... \nEpisode link: https://play.headliner.app/episode/25740702?utm_source=youtube",
      "release": "2025-02-24T05:14:11Z",
      "duration": "00:48:38",
      "explicit": false,
      "spotifyId": "2iDaBmzRn2psNqcfmSlUEp",
      "appleId": 1000695406960,
      "youTubeId": "dQ6IJefC2u0",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2iDaBmzRn2psNqcfmSlUEp",
        "apple": "https://podcasts.apple.com/podcast/the-key-to-joe-ryans-apartment/id1498278502?i=1000695406960",
        "youtube": "https://www.youtube.com/watch?v=dQ6IJefC2u0"
      }
    },
    {
      "id": "80a19c53-6458-4127-9b2c-5bbbda977773",
      "title": "Two Sides of Alex: Ex-Wife and Fiancée Speak - A Story of Love, Loss, and Conflicting Memories",
      "description": "Send us a text Who was Alex, really? In this gripping episode of Afterglow, we hear from two women who loved him: his ex-wife and his fiancée. Their recollections of Alex are strikingly different, raising questions about the nature of truth and memory. As their stories unfold, a complex portrait of Alex emerges, one filled with love, loss, and unanswered questions. Join us as we try to unravel the mystery surrounding Alex in this emotional and thought-provoking episode. Support the show Subscribe to Afterglow for new episodes every Monday! Leave a review on Apple Podcasts! © [2025] [Kathryn Brooks]. All rights reserved. Follow on YouTube: Left Undone Incomplete Investigations for so many Videos of this case and more https://www.youtube.com/channel/UCcP74RUcUliZ5von9YOz-5Q",
      "release": "2025-02-18T05:15:32Z",
      "duration": "01:13:31.1410000",
      "explicit": false,
      "spotifyId": "3WOWDJb1F4SUMaIJpgvotZ",
      "appleId": 1000693212047,
      "youTubeId": "UWdT-1OPI-s",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WOWDJb1F4SUMaIJpgvotZ",
        "apple": "https://podcasts.apple.com/podcast/two-sides-of-alex-ex-wife-and-fianc%C3%A9e-speak-a/id1498278502?i=1000693212047",
        "youtube": "https://www.youtube.com/watch?v=UWdT-1OPI-s"
      }
    },
    {
      "id": "ff2d4bb1-0046-47ee-bf95-d7861f2a01d8",
      "title": "Melanie Gibb, The PRICE OF SILENCE",
      "description": "Send us a text This episode continues our deep dive into the Charles Vallow case, focusing on Melanie Gibb\u0027s second interview with Chandler PD on August 19, 2020. Melanie\u0027s testimony sheds light on the events leading up to Charles\u0027 death, including the disturbing claims of his \u0022possession\u0022 and the alleged \u0022prayer circles.\u0022 We analyze the inconsistencies in Melanie\u0027s account and explore the potential influence of Chad Daybell\u0027s extreme beliefs. The episode also examines the controversial \u0022patriarchal blessing\u0022 Chad gave to Alex Cox. This is just the beginning – more police interviews, including Serena Sharp, Nicole, Christina, Jason Mow, and Zulema, are on the horizon, promising further revelations in this complex and tragic case. Support the show Charles Vallow, Melanie Gibb, Chad Daybell, Lori Vallow, Alex Cox, police interview, Chandler PD, patriarchal blessing, prayer circles, possession, murder, investigation, true crime, podcast Serena Sharp, Nicole, Christina, Jason Mow, Zulema, limited use immunity, timeline, inconsistencies, beliefs, spiritual beliefs, LDS Church, doctrine, manipulation, control, death, tragedy Melanie Gibb interview August 19 2020, Chad Daybell patriarchal blessing explained, Charles Vallow possession story, police interviews Charles Vallow case, true crime podcast Melanie Gibb, Lori Vallow and Chad Daybell beliefs, timeline of Charles Vallow murder, Serena Sharp interview podcast, Zulema interview podcast",
      "release": "2025-02-09T22:00:00Z",
      "duration": "01:38:29.6550000",
      "explicit": false,
      "spotifyId": "0s9kggc2X5wKMNPasqxeEy",
      "appleId": 1000690688313,
      "youTubeId": "oxEef8bN6S8",
      "subjects": [
        "Chad Daybell",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0s9kggc2X5wKMNPasqxeEy",
        "apple": "https://podcasts.apple.com/podcast/melanie-gibb-the-price-of-silence/id1498278502?i=1000690688313",
        "youtube": "https://www.youtube.com/watch?v=oxEef8bN6S8"
      }
    },
    {
      "id": "f8d79931-dbdd-452d-85f5-2e355722fc0a",
      "title": "The Many Faces of MELANIE GIBB. Doomsday Mom Lori Vallow\u0027s Best Friend\u0027s Police Interview",
      "description": "Send us a text Delve into the complexities of Melanie Gibb in this episode of Afterglow: Unveiling the Idaho Cult, Season 4, Episode 2: The Many Faces of Melanie Gibb. We analyze the pivotal police interview conducted at the Chandler Police Station, where Gibb discusses her knowledge of Charles Vallow\u0027s death. As a close friend of Lori Vallow Daybell and an active member of the \u0022Preparing a People\u0022 movement, Gibb\u0027s testimony is crucial. Yet, inconsistencies and her insistence that she never truly believed the teachings of Chad Daybell raise questions. This episode dissects the interview, highlighting the moments that cast doubt on her claims. Was she a naive follower, or did she play a more significant role in the events surrounding the deaths of JJ Vallow and Tylee Ryan? We explore her relationship with David Warwick, her deep involvement in the fringe religious group, and the now-infamous recorded phone call between her, Lori, and Chad. Discover the many faces of Melanie Gibb and decide for yourself what to believe. Keywords: Afterglow Unveiling the Idaho Cult, Melanie Gibb, Lori Vallow Daybell, Chad Daybell, Charles Vallow, JJ Vallow, Tylee Ryan, David Warwick, Chandler Police Station, police interview, Preparing a People, doomsday cult, true crime, Idaho, Rexburg, investigation, testimony, lies, deception, recorded phone call, missing children, murder, Arizona Support the show",
      "release": "2025-02-03T05:00:00Z",
      "duration": "00:59:41.6750000",
      "explicit": false,
      "spotifyId": "5qqyCTqphjZKZzYLjvJxB7",
      "appleId": 1000688428234,
      "youTubeId": "cixLpRTNT58",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qqyCTqphjZKZzYLjvJxB7",
        "apple": "https://podcasts.apple.com/podcast/the-many-faces-of-melanie-gibb-doomsday-mom-lori/id1498278502?i=1000688428234",
        "youtube": "https://www.youtube.com/watch?v=cixLpRTNT58"
      }
    },
    {
      "id": "fdaed60c-f614-4451-b6bc-686f8b0751aa",
      "title": "Red Pajamas, Raccoons, and a Jailhouse Call!  The Beginning of the End for Chad Daybell",
      "description": "Send us a text Afterglow: Unveiling the Idaho Cult returns for Season 4 with a pivotal episode: Red Pajamas, Raccoons, and a Jailhouse Call - The Beginning of the End for Chad Daybell. This episode dives deep into the crucial preliminary hearing of Chad Daybell held in August 2020, before the murder charges were filed. We hear from three key witnesses whose testimonies began to unravel the web of deceit surrounding the disappearances of JJ Vallow and Tylee Ryan, the children of Lori Vallow Daybell.First, David Warwick recounts the chilling night he last saw JJ Vallow, wearing red pajamas, with Alex Cox. Then, listen to the damning jailhouse phone call between Lori and Chad Daybell the day the children\u0027s bodies were discovered on Chad\u0027s property. Finally, an FBI agent reveals the now-infamous text messages between Chad and Tammy Daybell about shooting a raccoon and burying it in the pet cemetery - the same location where JJ and Tylee were later found. The date of the text exchange most likely corresponds with the day that Tylee was murdered.This episode exposes the early cracks in Chad Daybell\u0027s carefully constructed facade. Join us as we analyze the evidence that marked the beginning of the end for Chad Daybell and the doomsday cult that led to these horrific crimes. Keywords: Afterglow Unveiling the Idaho Cult, Chad Daybell, Lori Vallow Daybell, JJ Vallow, Tylee Ryan, Tammy Daybell, Alex Cox, David Warwick, preliminary hearing, red pajamas, jailhouse call, pet cemetery, raccoon, FBI, text messages, murder, doomsday cult, true crime, Idaho, Rexburg, investigation, justice for JJ and Tylee Buzzsprout - Let\u0027s get your podcast launched! Start for FREE Disclaimer: This post contains affiliate links. If you make a purchase, I may receive a commission at no extra cost to you. Support the show",
      "release": "2025-01-26T21:00:00Z",
      "duration": "01:02:28.1790000",
      "explicit": false,
      "spotifyId": "64ABgyprzQVCASmiBNOEVV",
      "appleId": 1000685548846,
      "youTubeId": "CRuiDSdCla4",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64ABgyprzQVCASmiBNOEVV",
        "apple": "https://podcasts.apple.com/podcast/red-pajamas-raccoons-and-a-jailhouse-call-the/id1498278502?i=1000685548846",
        "youtube": "https://www.youtube.com/watch?v=CRuiDSdCla4"
      }
    },
    {
      "id": "0a9a4f5f-6b94-486f-b453-446969be9680",
      "title": "MELANIE GIBB Testimony At CHAD DAYBELL Preliminary Hearing...",
      "description": "Send us a text Season 3, Episode 4 of \u0022Afterglow: Unveiling the Idaho Cult,\u0022 we dive deep into the gripping testimony of Melanie Gibb during Chad Daybell\u0027s preliminary hearing. Join us as we dissect her chilling account of the events surrounding the mysterious deaths of JJ, Tylee, and Tammy, shedding light on the dark secrets hidden within the Idaho cult. From shocking revelations to eerie insights into Chad and Lori Daybell\u0027s twisted belief system, Melanie\u0027s testimony unveils the sinister truth lurking beneath the surface. As we explore the implications of her words, we\u0027ll uncover the tangled web of deception and manipulation that led to this tragic saga. Tune in as we unravel the mysteries of the Idaho cult and delve into the heart of darkness that threatens to consume all who dare to seek the truth. It\u0027s an episode you won\u0027t want to miss. This is a one-woman show dedicated to unraveling this chilling saga, your support has been invaluable. If you find value in the content and wish to contribute, you can show your support via PayPal, Cash App, or buy me a coffee. Your generosity fuels the research, production, and dedication poured into every episode. Stay tuned as we dissect the gripping testimony and dive deeper into the revelations emerging from Chad Daybell\u0027s preliminary hearing. The narrative promises to reshape our understanding of this haunting case, revealing unseen facets and exposing the intricate web of information. Thank you for being a part of this journey through history and tragedy. Your support, whether through donations, kind words, or simply tuning in, drives this endeavor forward. Join us as we navigate through the unfolding events within the courtroom walls, seeking truth amidst the tumultuous currents of an extraordinary time. Thank you for tuning in to \u0022Afterglow: The Unveiling of the Idaho Cult.\u0022 Your commitment to understanding these deeply troubling events drives our journey deeper into the heart of this chilling tale. Thanks for listening. Check out my YouTube channel; Left Undone Incomplete Investigation. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #doomsdaymom #cultmom #missingchildrenidaho #MelaniPawlowski Theme music by Dan Lebowitz TOP 10 Idaho True Crime Podcasts! Afterglow is named! Considering donating to my show via any of these links: Monthly supporter via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use, and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the mar Support the show",
      "release": "2024-04-08T00:00:00Z",
      "duration": "01:59:59.8720000",
      "explicit": false,
      "spotifyId": "3vAgNUrhmNquTfny58qvt8",
      "appleId": 1000651716978,
      "youTubeId": "Hp8nqU1J_po",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vAgNUrhmNquTfny58qvt8",
        "apple": "https://podcasts.apple.com/podcast/melanie-gibb-testimony-at-chad-daybell-preliminary/id1498278502?i=1000651716978",
        "youtube": "https://www.youtube.com/watch?v=Hp8nqU1J_po"
      }
    },
    {
      "id": "6d1f20d9-eb01-4625-ae4d-87148ba512ed",
      "title": "Chad Daybell\u0027s Preliminary Hearing Begins! Detective Hermosillo Takes The Stand. The Lori Vallow Case",
      "description": "Send us a text Join us in this gripping episode of \u0022Afterglow: The Unveiling of the Idaho Cult\u0022 as we step into the intense and pivotal moments of Chad Daybell\u0027s preliminary hearing. The courtroom atmosphere crackles with tension as Detective Hermosillo takes the stand, poised to reveal a torrent of new information surrounding the tragic deaths of Tylee Ryan and JJ Vallow. Set against the backdrop of a world in the throes of the COVID-19 pandemic in August 2020, this extraordinary moment in history frames the unfolding events within the courtroom. As a one-woman show dedicated to unraveling this chilling saga, your support has been invaluable. If you find value in the content and wish to contribute, you can show your support via PayPal, Cash App, or buy me a coffee. Your generosity fuels the research, production, and dedication poured into every episode. Stay tuned as we dissect the gripping testimony and dive deeper into the revelations emerging from Chad Daybell\u0027s preliminary hearing. The narrative promises to reshape our understanding of this haunting case, revealing unseen facets and exposing the intricate web of information. Thank you for being a part of this journey through history and tragedy. Your support, whether through donations, kind words, or simply tuning in, drives this endeavor forward. Join us as we navigate through the unfolding events within the courtroom walls, seeking truth amidst the tumultuous currents of an extraordinary time. Thank you for tuning in to \u0022Afterglow: The Unveiling of the Idaho Cult.\u0022 Your commitment to understanding these deeply troubling events drives our journey deeper into the heart of this chilling tale. Thanks for listening. Check out my YouTube channel; Left Undone Incomplete Investigation. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #doomsdaymom #cultmom #missingchildrenidaho #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: Monthly supporter via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Law and Crime Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com KTVB News The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use, and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit Support the show",
      "release": "2024-01-02T02:00:00Z",
      "duration": "01:18:30.6550000",
      "explicit": false,
      "spotifyId": "3brQ9OfsN4bE8ODVkOObzC",
      "appleId": 1000640274122,
      "youTubeId": "JPMtPpt0KuA",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3brQ9OfsN4bE8ODVkOObzC",
        "apple": "https://podcasts.apple.com/podcast/chad-daybells-preliminary-hearing-begins-detective/id1498278502?i=1000640274122",
        "youtube": "https://www.youtube.com/watch?v=JPMtPpt0KuA"
      }
    },
    {
      "id": "eb0524c4-bcd1-4e1e-87a8-f962b6d84469",
      "title": "Stark Reality! Eating CROW. Now That The Children\u0027s Bodies Have Been Found. Lori Vallow and Chad Daybell.",
      "description": "Send us a text In this gripping episode of \u0022Afterglow: The Unveiling of the Idaho Cult,\u0022 we delve into the heart-wrenching aftermath of unwavering loyalty shattered by a chilling betrayal. The tragic deaths of Tylee Ryan and JJ Vallow at the hands of their own mother, Lori Vallow, and stepfather, Chad Daybell, continue to unravel a haunting narrative of belief and deceit. Listeners will journey through the stark contrast between steadfast support and the jolting revelation that led family and friends to retract their trust. Witness the unraveling of statements once staunchly defending Lori and Chad, only to crumble in the wake of the heartbreaking discovery of the children\u0027s bodies. The episode features a poignant prison call between Lori and her son, Colby, where Colby grapples with the unfathomable, seeking answers to the incomprehensible question: WHY? The chilling conversation unveils the unbridgeable gap between understanding and disbelief, leaving haunting echoes in its wake. Stick around for Season 3 Episode 3 Where you can join us as we unearth pivotal insights from the police interview with Lori\u0027s confidante, Melanie Gibb, recorded in August 2020. Through this exploration, we aim to navigate the intricate web of this tragic saga, seeking understanding amidst the shadows of an inexplicable tragedy. Thank you for tuning in to \u0022Afterglow: The Unveiling of the Idaho Cult.\u0022 Your commitment to understanding these deeply troubling events drives our journey deeper into the heart of this chilling tale. Thanks for listening. Check out my YouTube channel; Left Undone Incomplete Investigation. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: Monthly supporter via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com KTVB News The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use, and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2023-12-18T02:00:00Z",
      "duration": "00:43:43.6120000",
      "explicit": false,
      "spotifyId": "5jPvuTNe8EO8I2oOFe8BdT",
      "appleId": 1000638887479,
      "youTubeId": "DQ5GARH6xyA",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jPvuTNe8EO8I2oOFe8BdT",
        "apple": "https://podcasts.apple.com/podcast/stark-reality-eating-crow-now-that-the-childrens/id1498278502?i=1000638887479",
        "youtube": "https://www.youtube.com/watch?v=DQ5GARH6xyA"
      }
    },
    {
      "id": "ccd2a435-f4dd-430a-8256-254ef98a0a50",
      "title": "NEW SEASON!! The Bodies!",
      "description": "Send us a text Welcome To Afterglow UnVeiling the Idaho Cult! We are now in Season 3. This season will be the most important season. Tylee Ryan and JJ Vallow\u0027s bodies were found on June 9, 2020, on the property of CHAD DAYBELL. Chad Daybell is taken into custody finally! This episode explores the day that Nate Eaton of East Idaho News flew over Chad Daybell\u0027s property while the FBI and other law enforcement uncovered the shallow graves of JJ Vallow and Tylee Ryan. Buried in the \u0022pet cemetery\u0022 This day was a long time in coming and Chad Daybell was arrested and hasn\u0027t seen the light of day since. Lori Vallow had already been in custody since earlier in the year. Thanks for listening. Check out my YouTube channel; Left Undone Incomplete Investigation. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: Monthly supporter: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com KTVB News The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show Support the show #lorivallow #chaddaybell #truecrime #nateeaton #lorivallowupdate #lorivallowkids #chaddaybelltrial #truecrime #doomsdaymom #cults #idahomurders #idaho #rexburgh #lds #truecrimeidaho #jjvallow #tyleeryan #kaywoodcock #leftundoneyoutube #leftundoneKathy #afterglowlorivallow #afterglowpodcast #justinlum #anniecushing Support the show",
      "release": "2023-10-28T23:00:00Z",
      "duration": "00:58:41.7190000",
      "explicit": false,
      "spotifyId": "7aVpAmeXojjB5cxYMU2zvm",
      "appleId": 1000632952796,
      "youTubeId": "AGWipfitrEA",
      "subjects": [
        "Chad Daybell",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7aVpAmeXojjB5cxYMU2zvm",
        "apple": "https://podcasts.apple.com/podcast/new-season-the-bodies/id1498278502?i=1000632952796",
        "youtube": "https://www.youtube.com/watch?v=AGWipfitrEA"
      }
    },
    {
      "id": "c660d91a-a8b5-4b73-abc9-313f07d42412",
      "title": "Losing Hope. The Dark Corners of Lori Vallow\u0027s Beliefs",
      "description": "Send us a text Get ready for a riveting journey into the mysterious world of Lori Vallow Daybell. We\u0027re starting off with an exclusive interview with Nancy Jo, the woman who went on a date with Lori\u0027s estranged husband, Charles Vallow on the eve of his untimely death. Nancy Jo recounts Charles\u0027s revelations about Lori\u0027s peculiar beliefs, including her fascination with angels and portals—a chilling insight into the mind of a woman wrapped up in a murder mystery. As we move forward, we sift through a multitude of rumors, questions, and reactions from those around Lori. We\u0027ll be examining a heartfelt post by Melanie Boudreaux, a woman who faced personal struggles and accusations, yet chooses faith, love, and forgiveness. However, seems to have been fully immersed in the cult, their beliefs and might have even sacrificed her own children. Finally, we deep dive into an email exchange between Lori and Kay Woodcock, Charles\u0027s sister, that uncovers even more chilling details. Sit tight as we navigate through the eerie happenings and uncanny revelations of the Lori Vallow DeVal saga. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: Monthly supporter: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Arizona Family The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show Support the show",
      "release": "2023-07-22T05:00:00Z",
      "duration": "00:32:59.3600000",
      "explicit": false,
      "spotifyId": "5VfHhQPyjN85NgAtGAPTPQ",
      "appleId": 1000621962798,
      "youTubeId": "gM0ybLjrIEo",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5VfHhQPyjN85NgAtGAPTPQ",
        "apple": "https://podcasts.apple.com/podcast/losing-hope-the-dark-corners-of-lori-vallows-beliefs/id1498278502?i=1000621962798",
        "youtube": "https://www.youtube.com/watch?v=gM0ybLjrIEo"
      }
    },
    {
      "id": "a302fc1e-c2c8-4b10-aa2a-638e13d7fb42",
      "title": "Entangled in Darkness: Sarena Sharpe\u0027s Friendship with Lori Vallow and Chad Daybell",
      "description": "Send us a text Join me, Kathy Brooks, on a chilling journey as we explore the lives, lies, and devious crimes of Lori Vallow and Chad Daybell in this riveting episode of Afterglow. Lori Vallow\u0027s friendship with Serena Sharp and the other women in her \u0022casting out circle\u0022 are at the forefront of the investigation into the missing children, JJ Vallow and Tylee Ryan. Detective Moffett was able to put information together to help solve this investigation. He was on a mission to find Lori Vallow\u0027s children, Tylee Ryan and JJ Vallow. For over 3 years now I have found myself drawn into the bizarre world of Lori Vallow and Chad Daybell and their Idaho Cult associates. Hear about Lori and Chad, as well as the strange beliefs they held that strayed from the traditional LDS church doctrine. Delve into the complexities of their legal case, the upcoming preliminary hearing, and the involvement of multiple jurisdictions. Uncover the truth behind the prayer groups and connections central to this dark and tangled web of deceit. As a one-woman operation, your support and patience are invaluable to me in navigating the challenges of producing this podcast. Your continued engagement and donations make the tireless work behind the scenes worthwhile. So, thank you for joining me on this enthralling journey, and stay tuned for more updates on the chilling story of Lori Vallow, Chad Daybelll, and the Idaho Cult. Stay safe, and keep listening. Support the show",
      "release": "2023-06-25T21:00:00Z",
      "duration": "00:46:32.2130000",
      "explicit": false,
      "spotifyId": "5rwM1j6y9Z0aim4G9P8oEr",
      "appleId": 1000618277695,
      "youTubeId": "sLNl1bN934s",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rwM1j6y9Z0aim4G9P8oEr",
        "apple": "https://podcasts.apple.com/podcast/entangled-in-darkness-sarena-sharpes-friendship-with/id1498278502?i=1000618277695",
        "youtube": "https://www.youtube.com/watch?v=sLNl1bN934s"
      }
    },
    {
      "id": "ea8dc2c1-c255-4497-beb1-0104eebbea2e",
      "title": "Darkness Unveiled: Christina and Nicole Tell All.  Lori Vallow and Chad Daybell.",
      "description": "Send us a text What happens when dark, twisted beliefs turn into a sinister reality? Join us as we unravel the mysterious story of Lori Vallow and Chad Daybell in this chilling episode of Afterglow. We\u0027ve got exclusive police interview audio with Lori\u0027s friends, Christina and Nicole, who share their accounts of Lori and Chad\u0027s ideologies, as well as the bizarre events that led to the children\u0027s disappearance. Our exploration takes us deep into the unsettling world of Lori and Chad, where we examine their interactions with Lori\u0027s brother Alex and their conversations that went beyond the scope of their LDS faith. We also discuss the financial stress Lori faced and the potential criminal investigation that looms over them. Furthermore, we\u0027ll share a conversation between Emma DayBell, Chad\u0027s daughter, and a friend where she defends her father and Lori, claiming the missing kids are alive and safe, and that the rumors are blown out of proportion. This episode will leave you questioning the truth behind these strange coincidences and the twisted logic that has taken hold of this family. As we continue to unveil the Idaho cult and the lives, lies, and diabolical crimes of Lori Vallow and Chad DayBell, we invite you to join us on this journey to uncover the darkness that lies beneath. Don\u0027t miss this episode as we delve into the hidden depths of this chilling story. Support the show",
      "release": "2023-06-14T02:00:00Z",
      "duration": "01:02:08.8130000",
      "explicit": false,
      "spotifyId": "6pG3C0hEixsOEsNF3O9QVR",
      "appleId": 1000616926186,
      "youTubeId": "emlPOSUXhog",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6pG3C0hEixsOEsNF3O9QVR",
        "apple": "https://podcasts.apple.com/podcast/darkness-unveiled-christina-and-nicole-tell-all-lori/id1498278502?i=1000616926186",
        "youtube": "https://www.youtube.com/watch?v=emlPOSUXhog"
      }
    },
    {
      "id": "ea281159-0925-48a0-9f32-6863a4696ccb",
      "title": "Lori Returns to Idaho",
      "description": "Send us a text We pull back the curtain on the Idaho cult. Things are closing in on Lori Vallow and Chad Daybell Join us for this gripping episode where we recount Lori\u0027s first courtroom appearance in Idaho. Discover the intricate web of lies and diabolical crimes committed by Lori and Chad, as well as Lori\u0027s return to Idaho and the reduction of her bond from $5 million to $1 million. As we uncover the sinister story, we also examine the importance of the presumption of innocence in Lori\u0027s case. We discuss the charges she faces, including desertion, and how they are ordinarily handled under the Child Protection Act. Considering Lori\u0027s history of consistent long-term residence and employment, we question if she truly poses a flight risk despite the intense media attention and scrutiny her case has received. Finally, we delve into the mysterious events leading up to Lori Vallow\u0027s trial, such as Chad Daybell\u0027s application for a permit for a mobile home! We also touch on the suspicious death of Stacy Lynn Cope. We hear from Steve Cope about his wife\u0027s visit to Arizona in May 2019 and the chilling events of Christmas Eve 2019. Don\u0027t miss this jaw-dropping episode as we unveil the shocking truth behind the Idaho cult. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: Monthly supporter: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Fox 13 Salt Lake KHON2 Hawaii News Now The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show",
      "release": "2023-05-30T06:00:00Z",
      "duration": "01:01:12.8110000",
      "explicit": false,
      "spotifyId": "7cYflVbLDd5iV7GrFNCof4",
      "appleId": 1000614962181,
      "youTubeId": "nhZxTXf7sko",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7cYflVbLDd5iV7GrFNCof4",
        "apple": "https://podcasts.apple.com/podcast/lori-returns-to-idaho/id1498278502?i=1000614962181",
        "youtube": "https://www.youtube.com/watch?v=nhZxTXf7sko"
      }
    },
    {
      "id": "f9ac4a86-9fe5-46e0-8493-bbe0e77d34c0",
      "title": "The ARREST of LORI VALLOW DAYBELL; Arrested on Kauai, HI",
      "description": "Send us a text Feb 2020 was a very busy month. Lori Vallow was arrested and I received the infamous Zombie email. We continue to follow the Lori Vallow, Chad Daybell case in chronological order. Lori is arrested in Kauai HI and she makes her first court appearance. The chief of police there holds a press conference. Chad shows up at the court to watch Lori\u0027s first hearing. Her counsel is trying to reduce Lori\u0027s bail from 5 million. That doesn\u0027t happen. \u0022WHERE ARE THE KIDS\u0022 Signs are posted around the Island of Kauai. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Fox 13 Salt Lake KHON2 Hawaii News Now The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2023-05-01T16:00:00Z",
      "duration": "01:21:42.6920000",
      "explicit": false,
      "spotifyId": "2rvntB3QG3sm1OZBqpWKRz",
      "appleId": 1000611334363,
      "youTubeId": "TlCHnriA7qM",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rvntB3QG3sm1OZBqpWKRz",
        "apple": "https://podcasts.apple.com/podcast/the-arrest-of-lori-vallow-daybell-arrested-on-kauai-hi/id1498278502?i=1000611334363",
        "youtube": "https://www.youtube.com/watch?v=TlCHnriA7qM"
      }
    },
    {
      "id": "df1a091b-7d7c-4557-b2aa-0a53530c4efb",
      "title": "FOUND IN HAWAII The Lori Vallow Chad Daybell Case!",
      "description": "Send us a text JJ Vallow and Tylee Ryan are still missing. Kay Vallow Woodcock and Larry Woodcock, JJ\u0027s grandparents are making it known! Where are these children? Lori Vallow and Chad Daybell have run off to the Island of Kauai, Hawaii. They are staying in a lovely area on the North Shore. Lori seems unphased as she is pulled over, and served. She is to return to Idaho by Jan 30, 2020, with the children. The car they are driving is seized, along with the belongings. Law enforcement also has a warrant for the home they are staying in. Nate Eaton of East Idaho News got a tip that this was going down and he was ready to film, speak to and attempt to interview Lori Vallow Daybell and Chad Daybell. This is Season 2, EP 14 Found In Hawaii. #Lori Vallow #Chad Daybell Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Fox 13 Salt Lake The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2023-04-18T15:00:00Z",
      "duration": "00:41:34.9710000",
      "explicit": false,
      "spotifyId": "0fPwAfGCDwFl1xutb0PYNE",
      "appleId": 1000609501354,
      "youTubeId": "yXiTExa3HOY",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fPwAfGCDwFl1xutb0PYNE",
        "apple": "https://podcasts.apple.com/podcast/found-in-hawaii-the-lori-vallow-chad-daybell-case/id1498278502?i=1000609501354",
        "youtube": "https://www.youtube.com/watch?v=yXiTExa3HOY"
      }
    },
    {
      "id": "ded47357-1a3c-4c40-a706-ab0039a2a056",
      "title": "Please HELP US! Lori Vallow and Chad Daybell Story.",
      "description": "Send us a text Jan 2020. Kay Vallow Woodcock and her husband Larry Woodcock are scared. They have not spoken to their little grandson JJ Vallow in almost 4 months. This is unusual and heartwrenching. Charles Vallow was murdered and now JJ is missing. Kay and Larry have been in contact with law enforcement. They decided to post a 20K reward. This audio is their press conference in Jan 2020 asking for help. Lori Vallow and Chad Daybell were in Hawaii at this time and not giving up any information. Thanks for listening. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Fox 13 Salt Lake The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2023-04-10T04:00:00Z",
      "duration": "00:47:21.0770000",
      "explicit": false,
      "spotifyId": "4aqXRpEcsm3llOo1FjMmfq",
      "appleId": 1000608137602,
      "youTubeId": "E_6IzGKdt3E",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4aqXRpEcsm3llOo1FjMmfq",
        "apple": "https://podcasts.apple.com/podcast/please-help-us-lori-vallow-and-chad-daybell-story/id1498278502?i=1000608137602",
        "youtube": "https://www.youtube.com/watch?v=E_6IzGKdt3E"
      }
    },
    {
      "id": "1c3ddccd-3900-4bb7-9133-d3d854be6a49",
      "title": "LOIN FIRE! Lori Vallow and Chad Daybell Story.",
      "description": "Send us a text Lori Vallow and Chad Daybell fell into a deep and distorted love affair. This was a dangerous and horrible event that led to the demise of Lori\u0027s husband Charles Vallow, Chad\u0027s wife Tammy Douglas Daybell, and Lori\u0027s children Tylee Ryan and JJ Vallow. As we continue to move forward in the timeline of the missing children, we have learned so much about the evil belief system that has convinced Lori Vallow Daybell that her children were evil and needed to be murdered. Chad Daybell came up with a rating system and he sure did convince Lori that she was his Goddess. We explore the timeline leading up to Chad\u0027s \u0022book\u0022 Loin Fire. Chad was still married to Tammy when he shared \u0022Loin Fire\u0022 with Lori. But, Alex Cox had murdered Lori\u0027s husband Charles Vallow 2 days before he shared this with Lori. It might seem fiction based on the characters of James and Elana, but .... if you know the timeline, the people involved, and the evil beliefs they are following you will realize this is actually the true story of Lori (Elana) and Chad (James.) Thanks for listening. This episode has some adult content that may be inappropriate for children. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Fox 13 Salt Lake The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show",
      "release": "2023-03-27T05:00:00Z",
      "duration": "01:15:00.2930000",
      "explicit": true,
      "spotifyId": "3x3iT20FuvSq35zQbkp1Cm",
      "appleId": 1000606024627,
      "youTubeId": "f4wm_uPSSxs",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3x3iT20FuvSq35zQbkp1Cm",
        "apple": "https://podcasts.apple.com/podcast/loin-fire-lori-vallow-and-chad-daybell-story/id1498278502?i=1000606024627",
        "youtube": "https://www.youtube.com/watch?v=f4wm_uPSSxs"
      }
    },
    {
      "id": "c043fff5-4ec5-4a7d-82a7-4214add68abb",
      "title": "The DEATH of ALEX COX! Lori Vallow and Chad Daybell Case.",
      "description": "Send us a text We continue to creep down every rabbit hole this case entails. Today this episode continues to follow the timeline of the Lori Vallow and Chad Daybell series. Lori\u0027s brother Alex Cox joins the others in an untimely death. Lori leaves a trail of dead people behind and it is growing and growing. Alex Cox was Lori\u0027s \u0022protector\u0022 Her brother that would do anything for her. He tried to kill Joe Ryan, her 3rd husband, and if you listened to season 1, you might join me in the belief that he most likely did. This episode takes place in Dec 2019. Lori is on the run with Chad Daybell, her new husband. They are hiding in plain sight on the island of Kauai. But, Lori\u0027s brother Alex seems to have suddenly fallen ill. He is short of breath and Chad Daybell calls and gives him a blessing. However, he collapses and his new wife Zulema\u0027s 25-year-old son Joseph has to call 911 for help. Thank you for joining us! Please listen, review, and rate this one-woman show! Please listen, and follow Afterglow; UnVeiling The Idaho Cult! Season 2, Episode 11; The Death of Alex Cox. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com KSL Garna Mejia The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show",
      "release": "2023-03-20T04:00:00Z",
      "duration": "00:53:45.0920000",
      "explicit": true,
      "spotifyId": "4SVAcIb3otBN00tcr0Oi2k",
      "appleId": 1000604911175,
      "youTubeId": "-5tJD-9q7vQ",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SVAcIb3otBN00tcr0Oi2k",
        "apple": "https://podcasts.apple.com/podcast/the-death-of-alex-cox-lori-vallow-and-chad-daybell-case/id1498278502?i=1000604911175",
        "youtube": "https://www.youtube.com/watch?v=-5tJD-9q7vQ"
      }
    },
    {
      "id": "e4a2ed97-274d-48ec-946b-d882ccbc1d3a",
      "title": "Liars! Lori Vallow and Chad Daybell!",
      "description": "Send us a text Lori Vallow and Chad Daybell were on the \u0022run,\u0022 But, while they were running, the people that knew them well, and law enforcement were realizing that something they did, something that was very dark and sinister was what they were running from. By early December 2019, many of those investigating the case was becoming very concerned about missing JJ Vallow and Tylee Ryan. No one had heard from the children for several months. Lori Vallow was asking her good friend, fellow LDS confidant, and podcast partner to LIE to law enforcement regarding the whereabouts of 7-year-old JJ Vallow. Lori and Chad were hiding, but still communicating with those they felt close to. Melanie Gibb was growing very uncomfortable and also most likely quite afraid for her own knowledge of the teachings and followings of Chad Daybell and Lori Vallow. The pressure was getting hot! Chad Daybell and Lori Vallow had a phone call from Melanie Gibb. With David Warwick by her side and encouraging her to call them, they recorded the call. A lot is revealed in this call. Lori gets quite uncomfortable and irritated. Thanks for listening to this episode of Afterglow UnVEILING The Idaho Cult. Season 2 Episode 10. Please listen, and follow Afterglow; UnVeiling The Idaho Cult! Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show",
      "release": "2023-03-14T05:00:00Z",
      "duration": "00:39:20.2920000",
      "explicit": true,
      "spotifyId": "4C36MDVNDUcJVf47lhhaKK",
      "appleId": 1000604059256,
      "youTubeId": "tc7Ou5tLHr0",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4C36MDVNDUcJVf47lhhaKK",
        "apple": "https://podcasts.apple.com/podcast/liars-lori-vallow-and-chad-daybell/id1498278502?i=1000604059256",
        "youtube": "https://www.youtube.com/watch?v=tc7Ou5tLHr0"
      }
    },
    {
      "id": "11888c31-8bb8-4c3e-b3b7-86f655d26e0e",
      "title": "The Ugly Truths Revealed; Lori Vallow and Chad Daybell",
      "description": "Send us a text The Ugly Truths Revealed; Lori Vallow and Chad Daybell! Welcome to Season 2, Episode 9. We continue to follow the story of JJ Vallow and Tylee Ryan. The 2 siblings had a very untimely death at the hands of a doomsday belief system. Lori Vallow Daybell and Chad Daybell will son stand trial for the murder of these two siblings as well as Chad Daybell\u0027s late wife Tammy Douglas Daybell. This story is so compelling and so heinous. We are moving close to the trial. This episode talks in depth about the cult, its beliefs, and how crazy and horrible this story is. We dig into Ian Palowski\u0027s experience and his hoping law enforcement by wearing a wire. Please listen, and follow Afterglow; UnVeiling The Idaho Cult! Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Lauren Steinbrecher Salt Lake City UT Fox 13 GMC ABC The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show",
      "release": "2023-02-27T06:00:00Z",
      "duration": "00:40:04.2930000",
      "explicit": true,
      "spotifyId": "5S1plCM8qn1YQDSG3Lrt9v",
      "appleId": 1000601763790,
      "youTubeId": "DmnVsfBkpH0",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5S1plCM8qn1YQDSG3Lrt9v",
        "apple": "https://podcasts.apple.com/podcast/the-ugly-truths-revealed-lori-vallow-and-chad-daybell/id1498278502?i=1000601763790",
        "youtube": "https://www.youtube.com/watch?v=DmnVsfBkpH0"
      }
    },
    {
      "id": "e084acd2-7975-4c40-804a-42176246d2ca",
      "title": "BLOOD STAINS! Lori Vallow and Chad Daybell",
      "description": "Send us a text Blood Stains! Lori Vallow and Chad Daybell. As we dig deeper and continue down all the \u0022Rabbit Holes\u0022 we find more and more information. Lori Vallow gave her son Colby Ryan her Blue Nissan Rogue. Uncle Alex and Cousin Meliani drove the Nissan Rogue to Mesa Arizona. The car was left at Ian Pawlowski\u0027s sister\u0027s home for Colby Ryan to retrieve. Colby was visited by law enforcement on November 27, 2019. He didn\u0027t mention that his mother was \u0022giving\u0022 him her Nissan Rogue. Lori Vallow and Chad Daybell left Rexburg in a big hurry after the November 27th Welfare check. They were clearly worried. After all the lies and deception they ran off. However, once Law Enforcement realized that Colby had this Nissan Rogue, they determined that this could be EVIDENCE! They impounded the car and they found exactly what they thought they might find! EVIDENCE! Blood! Blood stains in the back seat of the vehicle. Not just a spot of blood, but several areas of very distinct blood stains. Please listen, and follow Afterglow; UnVeiling The Idaho Cult! Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Lauren Steinbrecher Salt Lake City UT Fox 13 GMC ABC The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2023-01-30T05:00:00Z",
      "duration": "00:45:26.8130000",
      "explicit": false,
      "spotifyId": "6QRjlUDy7NmOtTJ0M5qZNJ",
      "appleId": 1000597180059,
      "youTubeId": "JCC7ny_k8CE",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6QRjlUDy7NmOtTJ0M5qZNJ",
        "apple": "https://podcasts.apple.com/podcast/blood-stains-lori-vallow-and-chad-daybell/id1498278502?i=1000597180059",
        "youtube": "https://www.youtube.com/watch?v=JCC7ny_k8CE"
      }
    },
    {
      "id": "b2db5293-1d30-4721-9e53-5041f8ae8d5b",
      "title": "The WELFARE CHECK! Lori Vallow and Chad Daybell!",
      "description": "Send us a text On November 26, 2019, Lori Vallow was visited in Rexburg Idaho by local police detectives. They were knocking on Lori\u0027s door to do a requested Welfare check on 7-year-old JJ Vallow. Lori Vallow answered the door and in perfect \u0022Lori Form\u0022, She overdramatizes the conversation, she plays the victim, lies, and tries to throw the officers off their game. Little did Lori know, but they already knew so much! They knew she was married to Chad, they knew that Charles Vallow\u0027s death was suspicious and that Lori was most likely involved. They knew Tylee didn\u0027t attend BYUI. Of course, Lori talks too much, (not a bad thing here.) She gives away a lot of clues. But, during this conversation, they realize that Melanie Gibb most likely does not have JJ with her in Arizona. We also listen to Melanie Gibb give her side of what happened that day. Thanks for listening. Please consider giving me a 5-star rating and leave a review. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show",
      "release": "2023-01-20T04:00:00Z",
      "duration": "00:28:07.4520000",
      "explicit": false,
      "spotifyId": "5rSlnEGttyQcTlG3sDAi2F",
      "appleId": 1000595574591,
      "youTubeId": "XG9-Zo6IxOY",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rSlnEGttyQcTlG3sDAi2F",
        "apple": "https://podcasts.apple.com/podcast/the-welfare-check-lori-vallow-and-chad-daybell/id1498278502?i=1000595574591",
        "youtube": "https://www.youtube.com/watch?v=XG9-Zo6IxOY"
      }
    },
    {
      "id": "44bbf9dc-ccbb-4f34-99ae-7cef599c63fc",
      "title": "The ARREST of MELANI  Boudreaux! Lori Vallow and Chad Daybell!",
      "description": "Send us a text ARREST of Melani Boudreaux! Lori Vallow and Chad Daybell! Niece Melani Boudreaux Pawlowski was one of Chad Daybell and Lori Vallow\u0027s followers. She and Alex Cox were convinced that Lori Vallow and Chad Daybell were the chosen 144,000 from the book of revelations. Melani left her husband Brandon Boudreaux and their 4 children to move to Rexburg Idaho to be with Lori Vallow, Chad Daybell, and Alex Cox. Uncle Alex Cox allegedly shot Melani\u0027s husband Brandon Boudreaux on Oct 2, 2019. Thankfully Alex missed. Brandon was extremely concerned about his 4 children and took them to his parent\u0027s home in American Fork Utah. For some reason, while Lori and Chad were in Kauai, Hawaii getting married and planning everything, all while JJ Vallow and Tylee Ryan were missing, Melani decided she needed to desperately see her children, or take them. Were they on the list to be the next victims of Chad and Aunt Lori? Alex Cox helps his niece Melani go to her ex-inlaws home and try to \u0022see her children. However, Melani is cited for trespassing, and then has the nerve to return 2 nights later and she gets arrested and thrown in jail. Enjoy the episode and please consider rating it 5 stars and giving a review! #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell #alexcox, #MelaniBoudreaux #MelaniPawlowski Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2022-12-12T03:00:00Z",
      "duration": "00:50:03.7740000",
      "explicit": false,
      "spotifyId": "68tUPvkMzdKpmY74A7erAl",
      "appleId": 1000589795609,
      "youTubeId": "3GmiCp1Mqoc",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/68tUPvkMzdKpmY74A7erAl",
        "apple": "https://podcasts.apple.com/podcast/the-arrest-of-melani-boudreaux-lori-vallow-and-chad-daybell/id1498278502?i=1000589795609",
        "youtube": "https://www.youtube.com/watch?v=3GmiCp1Mqoc"
      }
    },
    {
      "id": "e6e7c9a2-c758-49d4-9261-a9e4a04e4b89",
      "title": "The Children Are MISSING (5) Lori Vallow and Chad Daybell Case",
      "description": "Send us a text The Children Are Missing. Ep 5 of Season 2. Lori Vallow and Chad Daybell Case. We continue with the fallout following the murders of Charles Vallow and Tammy Daybell. Now it has become clear to Kay Vallow Woodcock and Larry Woodcock that JJ Vallow is missing. They are frustrated with Lori Vallow and they involve law enforcement. We continue here with Lori, Zulema, Chad, and Alex\u0027s texting while others are becoming quite concerned about the missing children. What has happened? Lori and Chad have run off to be married on the island of Kauai. Take a listen and please rate and comment on my show! Thank you so much.#LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell Theme music by Dan Lebowitz Considering donating to my show via any of these links: via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. Sources for this episode Nate Eaton, East Idaho News Justin Lum, Fox 10 Phoenix Annie Cushing Annielytics.com Arizona Family The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2022-11-27T07:00:00Z",
      "duration": "00:48:19.2930000",
      "explicit": true,
      "spotifyId": "7Exq9gnnHOahMwo5AAM29l",
      "appleId": 1000587596626,
      "youTubeId": "5W35_t33L-4",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Exq9gnnHOahMwo5AAM29l",
        "apple": "https://podcasts.apple.com/podcast/the-children-are-missing-5-lori-vallow-and-chad-daybell-case/id1498278502?i=1000587596626",
        "youtube": "https://www.youtube.com/watch?v=5W35_t33L-4"
      }
    },
    {
      "id": "93cc8138-0b06-4085-8e6b-4e9637fc7f4d",
      "title": "SINISTER TEXT MESSAGES, (4) Lori Vallow and Chad Daybell",
      "description": "Send us a text SINISTER TEXT Messages leading up to the murder of Charles Vallow and Tammy Daybell and the missing children. Zulema Pastenes has USE IMMUNITY, her text messages were released in the FIOA documents. This is sad, scary, and bizarre and genuinely shows how dangerous these people were. Zulema for one indeed seemed to believe that Chad was some all-knowing prophet or GURU. Lori Vallow and Chad Daybell were indeed a danger to society. We can only hope that they never step foot amongst us again. Please review this podcast and give me 5 starts if you are enjoying it. #LoriVallow #ChadDaybell #ZulemaPastenes #TyleeRyan #JJVallow #CharlesVallow #TammyDaybell Theme music by Dan Lebowitz via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2022-11-21T19:00:00Z",
      "duration": "00:49:15.8930000",
      "explicit": false,
      "spotifyId": "1r22FYYN9Q6ufN0aakzSHJ",
      "appleId": 1000587014635,
      "youTubeId": "XlmBCLQXi-E",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1r22FYYN9Q6ufN0aakzSHJ",
        "apple": "https://podcasts.apple.com/podcast/sinister-text-messages-4-lori-vallow-and-chad-daybell/id1498278502?i=1000587014635",
        "youtube": "https://www.youtube.com/watch?v=XlmBCLQXi-E"
      }
    },
    {
      "id": "2d1d45e0-1d85-4b8d-a5e1-360822c9ccb9",
      "title": "TAMMY DAYBELL, The last days. (3) Lori Vallow and Chad Daybell Case",
      "description": "Send us a text Tammy Daybell, Chad Daybells wife for nearly 30 years. \u0022Died in her Sleep.\u0022 Soon after the attempted shooting of Brandon Bourdouex, someone in a ski mask shot at Tammy as she was getting groceries out of her car at their home. Tammy posted about the incident on Social Media and reported it to the police. It was then considered a prank, and nothing else was done. However, 10 days later, Tammy passed away. The circumstances were extremely suspicious. Chad had already informed Lori that Tammy was a Dark spirit named Viola and The REAL Tammy was in limbo. This story gets more and more disgusting as time goes on. Please rate and comment! Resources: Fox 10 Phoenix Justin Lum East Idaho News Nate Eaton Arizona Family Fox 13 Utah https://www.annielytics.com/ https://www.ktvb.com/ Court TV Theme music by Dan Lebowitz via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2022-11-07T17:00:00Z",
      "duration": "01:01:13.6800000",
      "explicit": false,
      "spotifyId": "0bCUD6rCPgz9YEPSZqjHoo",
      "appleId": 1000585388427,
      "youTubeId": "ty4UFKhwaUs",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0bCUD6rCPgz9YEPSZqjHoo",
        "apple": "https://podcasts.apple.com/podcast/tammy-daybell-the-last-days-3-lori-vallow-and/id1498278502?i=1000585388427",
        "youtube": "https://www.youtube.com/watch?v=ty4UFKhwaUs"
      }
    },
    {
      "id": "e6e9d438-eb5a-4b28-ba85-ac398a705f17",
      "title": "The Attempted MURDER of Brandon Boudreaux! (2) Lori Vallow and Chad Daybell Case",
      "description": "Send us a text The Attempted MURDER of Brandon Boudreaux! (2) Lori Vallow and Chad Daybell Case. This episode is the second episode of Season 2. On Oct 2, 2019, Brandon Boudreaux returned to his home after dropping off his children at school and with Lori Vallow\u0027s nice, Brandon\u0027s ex-wife Melani Boudreaux. He then went to the gym. Alex Cox, Lori Vallow\u0027s \u0022hitman brother\u0022 waited for Brandon Boudreaux for over 100 minutes. How did he know Brandon would be arriving home that morning? How did he know Brandon\u0027s schedule? When Brandon began to pull into his driveway, a Camo colored green jeep was parked near his home. The back tailgate opened, and Brandon saw the barrel of a gunpoint at him and shoot! This missed Brandon by mere inches! Listen to this episode to hear all the details, Melani\u0027s excuses, and comments and so much more! Please rate and comment! Resources: https://www.youtube.com/c/hiddentruecrime Fox 10 Phoenix Justin Lum East Idaho News Nate Eaton Arizona Family Fox 13 Utah https://www.annielytics.com/ https://www.ktvb.com/ https://soundcloud.com/user-675798015-352501772/012380918cdlv via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show Support the show",
      "release": "2022-10-26T21:00:00Z",
      "duration": "01:26:21.2000000",
      "explicit": false,
      "spotifyId": "45ZIKj6z7tsji6dS07LRgH",
      "appleId": 1000584016777,
      "youTubeId": "cjq5UG85uyA",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/45ZIKj6z7tsji6dS07LRgH",
        "apple": "https://podcasts.apple.com/podcast/the-attempted-murder-of-brandon-boudreaux-2-lori/id1498278502?i=1000584016777",
        "youtube": "https://www.youtube.com/watch?v=cjq5UG85uyA"
      }
    },
    {
      "id": "994c8e1e-9b0a-474c-93ad-ba3f8843d025",
      "title": "The Last Days of Tylee Ryan and JJ Vallow (1) Lori Vallow and Chad Daybell",
      "description": "Send us a text The Last Days of Tylee Ryan and JJ Vallow. Season 2, Episode 1 of the Lori Vallow and Chad Daybell Case. Welcome to Season 2! Thank you all for your patience and those that have donated! I very much appreciate it! Season 2 is here! WE are now getting into the most horrific parts of this case. This episode is all about Sept of 2019. The last days of Tylee and JJ! Kay Vallow Woodcock and Larry J Woodcock were becoming very concerned. They tried desperately to make contact with 6-year-old JJ Vallow, their grandson. But Lori Vallow had other plans. Lori was wrapped up in the belief system of Chad Daybell. Continue to follow this case. Lori Vallow and Chad Daybell are \u0022LDS\u0022 members, however, they decided that they were more important, and had a higher calling than \u0022regular Mormons\u0022.. None of this makes any sense when you follow this case. People were murdered. Tylee Ryan, JJ Vallow, Charles Vallow, and Tammy Daybell. Sources for this episode: https://www.fox10phoenix.com/person/l/justin-lum https://www.eastidahonews.com/author/neaton/ https://www.azfamily.com/ https://www.annielytics.com/ https://www.ktvb.com/ https://soundcloud.com/user-675798015-352501772/012380918cdlv via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Foul Play: Crime Series Award-winning and oldest crime series podcast brings you personally curated crime stories. Listen on: Apple Podcasts Spotify Support the show Support the show",
      "release": "2022-10-18T04:00:00Z",
      "duration": "01:19:28.8110000",
      "explicit": true,
      "spotifyId": "1fPGPhlHg5FXNLuxp6UBAo",
      "appleId": 1000582987274,
      "youTubeId": "SGPW6SL4qiw",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1fPGPhlHg5FXNLuxp6UBAo",
        "apple": "https://podcasts.apple.com/podcast/the-last-days-of-tylee-ryan-and-jj-vallow-1-lori/id1498278502?i=1000582987274",
        "youtube": "https://www.youtube.com/watch?v=SGPW6SL4qiw"
      }
    },
    {
      "id": "94f536b0-034c-4acf-85bd-1061ccea45ca",
      "title": "Their Mission (13) Season 1 Finale. Lori Vallow And Chad Daybell Case",
      "description": "Send us a text The Mission is Season 1 Episode 13 of Afterglow UnVieling The Idaho Cult. This will be a very small break between Season 1 and Season 2. This episode goes into the activities and moves of Lori Vallow and Chad Daybell just prior to the disappearance of JJ Vallow and Tylee Ryan. Charles Vallow was murdered on July 11, 2022. By the end of August Lori was moving to Rexburg and making ominous plans to marry Chad and dispose of her children Tylee Ryan and JJ Vallow. Sources for this episode: https://www.fox10phoenix.com/person/l/justin-lum https://www.eastidahonews.com/author/neaton/ https://www.azfamily.com/ https://www.annielytics.com/ https://www.ktvb.com/ https://soundcloud.com/user-675798015-352501772/012380918cdlv via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Support the show",
      "release": "2022-08-16T02:00:00Z",
      "duration": "01:19:20.3730000",
      "explicit": true,
      "spotifyId": "3owt54F3XvEhCG8Gv5jdME",
      "appleId": 1000576202578,
      "youTubeId": "jdORyerc6uo",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3owt54F3XvEhCG8Gv5jdME",
        "apple": "https://podcasts.apple.com/podcast/their-mission-13-season-1-finale-lori-vallow-and-chad/id1498278502?i=1000576202578",
        "youtube": "https://www.youtube.com/watch?v=jdORyerc6uo"
      }
    },
    {
      "id": "36b19202-819d-4c3d-8c68-8937b525cbc8",
      "title": "The Aftermath Begins (12) Lori Vallow Chad Daybell Case",
      "description": "Send us a text The Aftermath Begins in Episode 12. Lori Vallow and Chad Daybell had been up to no good for over a year before their killing spree began. Charles Vallow was the first apparent killing they planned and executed, but there were more. We will follow all the twists and turns of this unbelievable case. In this episode, we begin to explore the timeline after Charle\u0027s murder. There are definitely some surprises, but the worst part is the picture is more and more apparent that they are as evil as they come. They are serial killers. via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Sources: East Idaho News Nate Eaton Fox 13 Phoenix Justin Lum https://www.youtube.com/c/diffiCULTreSEARCH Support the show",
      "release": "2022-08-08T01:00:00Z",
      "duration": "01:11:42.3320000",
      "explicit": true,
      "spotifyId": "6mlGWdFg1RVjCtCcZJUlZI",
      "appleId": 1000575319827,
      "youTubeId": "-MrrLiwIh-A",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6mlGWdFg1RVjCtCcZJUlZI",
        "apple": "https://podcasts.apple.com/podcast/the-aftermath-begins-12-lori-vallow-chad-daybell-case/id1498278502?i=1000575319827",
        "youtube": "https://www.youtube.com/watch?v=-MrrLiwIh-A"
      }
    },
    {
      "id": "42395f98-b4a9-47c0-ac08-6a108faffce4",
      "title": "The Idaho Cult EXPOSED (11) Lori Vallow Chad Daybell Case",
      "description": "Send us a text It\u0027s time to put together all the pieces and show you where these horrible evil beliefs came from. In this episode, I show you where these beliefs came from. The belief in \u0022portal travel\u0022, \u0022multiple mortal probations\u0022, \u0022zombies\u0022, \u0027choosing the 144,000\u0022 and so much more. Lori Vallow fell for these beliefs after becoming part of the Preparing a People movement. AVOW was the forum that everyone was discussing these doomsday beliefs and what the \u0022visionaries\u0022 like Chad Daybell, Mike Stroud, Denver Snuffer, Julie Rowe, and more were teaching. Chad Daybell also convinced LDS members that Rexburg Idaho was the promised land. The \u0022Safe Zone.\u0022 These people instilled fear in their followers and convinced many that the end of days was here and they better be ready, But, in the end, there are still believers practicing this, in my opinion, nonsense. Good people and innocent people are dead thanks to their evil ideology. They are a Hydra Cult. Take a listen. Support the show",
      "release": "2022-07-31T22:00:00Z",
      "duration": "01:05:48.0790000",
      "explicit": true,
      "spotifyId": "4TI3buV7wcm39hPG1uG5Lr",
      "appleId": 1000574561306,
      "youTubeId": "ck0dssv5yr8",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4TI3buV7wcm39hPG1uG5Lr",
        "apple": "https://podcasts.apple.com/podcast/the-idaho-cult-exposed-11-lori-vallow-chad-daybell-case/id1498278502?i=1000574561306",
        "youtube": "https://www.youtube.com/watch?v=ck0dssv5yr8"
      }
    },
    {
      "id": "6c4d3e83-31ab-49c5-b437-a205fed12b99",
      "title": "Zulema Zulema Zulema (10) Lori Vallow Chad Daybell Case",
      "description": "Send us a text Zulema Pastenes was deeply involved with these people. I am shocked she hasn\u0027t been charged with anything! We dug up a bunch of the text messages in the Chandler Arizona FIOA document dump. Zulema is clearly a piece of work, in my opinion. She really seems to believe that she is in charge of things like Earthquakes, and other elements. She constantly thinks dark and evilness is attacking her and frequently reaches out to Chad Daybell for help. Then there are text messages between her and Lori Vallow. They are bizarre. They think they are both goddesses and that they are translated beings. They really seem to believe everything Chad Daybell was selling them. Take a listen and don\u0027t forget to rate my True Crime Podcast about Lori Vallow and Chad Daybell. Afterglow The UnVeiling Of The Idaho Cult. Part 10. Watch more on my youtube channel. https://www.youtube.com/leftundone Support the show. Pay pal http://www.paypal.me/katfshh Cash ap http://Cash.app/$afterglowKathy No donation is too small. Support the show",
      "release": "2022-07-24T01:00:00Z",
      "duration": "01:23:23.7720000",
      "explicit": true,
      "spotifyId": "5p2YsKpTcSaT5rvJamQFLv",
      "appleId": 1000570961556,
      "youTubeId": "zsxlKu_3cDE",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5p2YsKpTcSaT5rvJamQFLv",
        "apple": "https://podcasts.apple.com/podcast/zulema-zulema-zulema-10-lori-vallow-chad-daybell-case/id1498278502?i=1000570961556",
        "youtube": "https://www.youtube.com/watch?v=zsxlKu_3cDE"
      }
    },
    {
      "id": "bccf6df0-0258-4b33-b4e2-d198da912456",
      "title": "Melanie Gibb (9) Lori Vallow Chad Daybell Case",
      "description": "Send us a text Melanie Gibb became Lori Vallow\u0027s best friend. Jason Mow had mentioned them to each other. Melanie and Lori met and became very close friends, very fast. Melanie had already met Chad Daybell, and Lori was very interested in meeting Chad. The 2 women made a trip to a Preparing a People conference in St. George UT to listen to Chad talk Lori became infatuated with Chad that day. It seems Chad worked his magic and was immediately working Lori and telling her about their past lives and marriages together. Listen to Melanie talk about these encounters, Charles Murder, and explain the Zombie nonsense. Support the show",
      "release": "2022-07-16T04:00:00Z",
      "duration": "01:38:25.7210000",
      "explicit": true,
      "spotifyId": "311dqL4WTWGuEU4UMmRdKM",
      "appleId": 1000570089343,
      "youTubeId": "emlPOSUXhog",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/311dqL4WTWGuEU4UMmRdKM",
        "apple": "https://podcasts.apple.com/podcast/melanie-gibb-9-lori-vallow-chad-daybell-case/id1498278502?i=1000570089343",
        "youtube": "https://www.youtube.com/watch?v=emlPOSUXhog"
      }
    },
    {
      "id": "5dd52426-9e39-476b-a55f-a18e625c1a84",
      "title": "Lori Vallow Shows Her True Colors! (8) Lori Vallow Chad Daybell True Crime Case",
      "description": "Send us a text Welcome to Season 1 Ep 8. Lori Vallow shows her true colors. After her husband Charles was shot in her living room by her brother Alex. Lori decided to first have. pool party and a day later tell Charles son\u0027s that he \u0022passed away.\u0022 They were undoubtedly confused, sad, upset, and frustrated with Lori\u0027s lack of communication and details. We also hear from Lori\u0027s landlord when he was interviewed by phone by Chandler police detective Moffett. And to top it all off Chad Daybell calls a funeral home in Chandler to ask about prices for her deceased uncle that will need to be transported to Lousinanna. It\u0027s insanity! Please consider rating my podcast and leaving a kind review. So much more to come! Support the show",
      "release": "2022-07-10T00:00:00Z",
      "duration": "01:00:15.4030000",
      "explicit": true,
      "spotifyId": "0Sh5e8sqYeEKfTFaZVPHNM",
      "appleId": 1000569391148,
      "youTubeId": "8tp8DweFC3Q",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Sh5e8sqYeEKfTFaZVPHNM",
        "apple": "https://podcasts.apple.com/podcast/lori-vallow-shows-her-true-colors-8-lori-vallow-chad/id1498278502?i=1000569391148",
        "youtube": "https://www.youtube.com/watch?v=8tp8DweFC3Q"
      }
    },
    {
      "id": "baae0001-aa74-42a6-86b3-350c5c8550b5",
      "title": "Things Are Getting Strange! (7) Lori Vallow Chad Daybell Case",
      "description": "Send us a text We continue to dig deep into the murder of Charles Vallow. Things are getting strange. This is season 1 EP 7. Alex Cox and Tylee Ryan were interviewed at the Chandler Police Department on July 11, 2019. Detective Moffet interviews Alex and points out that his and Lori\u0027s story isn\u0027t adding up. Detective Moffet becomes a key player in the Vallow Daybell story as we move forward. At this point, Kay and Larry are surprised, upset, and confused. Tylee is really sticking to her mom\u0027s story and what we eventually learn is this is just such a horrible decision. But, what is a 16-year-old girl going to do? Thanks for listening. Sources Justin Lum Fox 10 Phoenix Nate Eaton East Idaho News. Support the show",
      "release": "2022-07-01T18:00:00Z",
      "duration": "01:35:16.7770000",
      "explicit": true,
      "spotifyId": "0t7NgI9q6hgvJW2ig8yU0V",
      "appleId": 1000568478160,
      "youTubeId": "8g1YQYtOdEI",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0t7NgI9q6hgvJW2ig8yU0V",
        "apple": "https://podcasts.apple.com/podcast/things-are-getting-strange-7-lori-vallow-chad-daybell-case/id1498278502?i=1000568478160",
        "youtube": "https://www.youtube.com/watch?v=8g1YQYtOdEI"
      }
    },
    {
      "id": "0061a338-f392-432c-8780-0efe6aa427ad",
      "title": "Charles Vallow\u0027s Murder Part 2 (6) Lori Vallow Chad Daybell True Crime Case",
      "description": "Send us a text Welcome to Afterglow UnVeiling The Idaho Cult Season 1 Episode 6 Part 2, Charles Vallow\u0027s Murder. We continue to follow the murder of Charles Vallow on July 11, 2019, in Chandler Arizona. The Lori Vallow, Chad Daybell story begins to unfold on the day that Charles Vallow was murdered by Alex Cox, Lori Vallow\u0027s brother. After accusations and delusions of Charles being a Zombie named Ned Snieder Alex Cox shot and killed Charles. I am Kathy Brooks, a novice at podcasting, and I am only here to tell the story. By day I am a Registered Nurse and I spend time following true crimes when I can. Please consider this when you rate and comment on my show. Thank you! Support the show",
      "release": "2022-06-25T21:00:00Z",
      "duration": "00:56:00.5710000",
      "explicit": true,
      "spotifyId": "6vmIzFZgET4JaZJ4f4W1gr",
      "appleId": 1000567709370,
      "youTubeId": "9duumSeTsr4",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6vmIzFZgET4JaZJ4f4W1gr",
        "apple": "https://podcasts.apple.com/podcast/charles-vallows-murder-part-2-6-lori-vallow-chad-daybell/id1498278502?i=1000567709370",
        "youtube": "https://www.youtube.com/watch?v=9duumSeTsr4"
      }
    },
    {
      "id": "c444483e-9700-4633-89f5-09ce85c9545e",
      "title": "Charles Vallow\u0027s Murder Part 1 (6) Lori Vallow Chad Daybell Case",
      "description": "Send us a text We continue to follow the serial murders of JJ Vallow, Tylee Ryan, Charles Vallow, and Tammy Daybell. This episode takes place on July 11, 2019. Alex Cox, Lori Vallow\u0027s brother, was waiting for Charles Vallow to pick up JJ and take him to school. When Charles arrived he was shot and killed. Alex Cox, Lori Vallow, Tylee Ryan, and JJ Vallow were present, yet no arrest was made. Listen to this episode and let us know what you think. Kay Vallow Woodcock and Larry Woodcock believe this was a planned ambush. Thanks for listening. Sources: Justin Lum Fox 10 Phoenix. Support the show",
      "release": "2022-06-20T05:00:00Z",
      "duration": "00:47:16.1580000",
      "explicit": true,
      "spotifyId": "7EVUXK51NNKz1RcXKPkkR1",
      "appleId": 1000567093691,
      "youTubeId": "V1O8obGn36E",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7EVUXK51NNKz1RcXKPkkR1",
        "apple": "https://podcasts.apple.com/podcast/charles-vallows-murder-part-1-6-lori-vallow-chad-daybell/id1498278502?i=1000567093691",
        "youtube": "https://www.youtube.com/watch?v=V1O8obGn36E"
      }
    },
    {
      "id": "de880924-210f-4106-93f1-ac1f7ff10a8b",
      "title": "Charles Vallow Part 2 (5) Lori Vallow Chad Daybell True Crime Case",
      "description": "Send us a text We continue with the story of Lori Vallow and Chad Daybell. When we left off in Season 1 Episode 5, Part 1 Charles Vallow, Charles was trying desperately to help his wife Lori Vallow. But, by that time Lori was following \u0022want to be\u0022 Cult Guru Chad Daybell. Lori had decided that Charles has gone dark. This episode continues when Lori Vallow, Melanie Gibb, and Lori\u0027s daughter Tylee Ryan arrive at the Gilbert Arizona Police Station. They are there to report that Charles stole Lori\u0027s purse. Thanks for listening! Support the show",
      "release": "2022-01-13T03:00:00Z",
      "duration": "00:58:35.9730000",
      "explicit": false,
      "spotifyId": "28ay6K1H66VuD06Y02bFti",
      "appleId": 1000547743012,
      "youTubeId": "M1fuvxWbse4",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28ay6K1H66VuD06Y02bFti",
        "apple": "https://podcasts.apple.com/podcast/charles-vallow-part-2-5-lori-vallow-chad-daybell-true/id1498278502?i=1000547743012",
        "youtube": "https://www.youtube.com/watch?v=M1fuvxWbse4"
      }
    },
    {
      "id": "25d896c1-93c0-4237-870e-cec08ba87267",
      "title": "Charles Vallow Part 1 (5) Lori Vallow Chad Daybell True Crime",
      "description": "Send us a text Charles Vallow tried so very hard to find help for his wife of 13 years, Lori Vallow. But, while Charles was trying to get help for Lori, Chad Daybell was indoctrinating her to his Fringe LDS belief system. Mainstream LDS does not believe a lot of what Chad Daybell teaches, but Chad is a lifetime LDS Church member seems to know what to say to many people to get them to follow his strange and dangerous ideology. In this episode, my co-host, and long-time subscriber/member of my Left Undone YouTube channel, joins me to discuss this information. Welcome to Afterglow; UnVeiling The Idaho Cult Series. This podcast will take you down, the deepest of rabbit holes as it unfolds. This story is so compelling, so bizarre, and so heinous. It is impossible to look the other way. Chad Daybell and Lori Vallow were dedicated in the most horrible way to an ideology that should only be fiction. Instead, their ideology put them behind bars. Join us as we explore the lives, lies, and diabolical crimes of Lori Vallow, and Chad Daybell I’m your host Kathy Brooks. Please follow and subscribe wherever you get your podcasts! This show is produced, edited, and narrated by Me, Kathy Brooks. I am also the creator of the YouTube channel Left Undone, Incomplete investigations where we have followed this case since Jan 2020. We also have a wonderful community with live streams where we talk all things true crime. If you are enjoying the show and would like to support this one-woman show. Please consider donating to afterglow the Idaho cult series. You can donate a few ways, via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee: https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Sources: Breaking Crime With B E WickedtruthandFbombs.com Support the show (https://www.paypal.com/biz/fund?id=XT4KSK9JBSQ8C) Support the show",
      "release": "2021-11-01T00:00:00Z",
      "duration": "01:41:23.5710000",
      "explicit": true,
      "spotifyId": "2OslryRaICqpHD4OVEEZSo",
      "appleId": 1000540324509,
      "youTubeId": "9duumSeTsr4",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2OslryRaICqpHD4OVEEZSo",
        "apple": "https://podcasts.apple.com/podcast/charles-vallow-part-1-5-lori-vallow-chad-daybell-true-crime/id1498278502?i=1000540324509",
        "youtube": "https://www.youtube.com/watch?v=9duumSeTsr4"
      }
    },
    {
      "id": "104eef5d-c423-4e56-b3b5-8d2e72075786",
      "title": "And So It Begins (4) Lori Vallow Chad Daybell True Crime Case",
      "description": "Send us a text Welcome to Afterglow the Unveiling of The Idaho Cult. Episode 4 And So It Begins..... Was Joe Ryan\u0027s death really a \u0022heart attack\u0022? Lori Vallow spoke to friends and told them she wanted Joe DEAD. Her Brother Adam corroborates this! Was Lori ever a nice person, or was Lori always evil and sinister? Listen to Ep 4 and you can decide. This podcast will take you down, the deepest of rabbit holes as it unfolds. This story is so compelling, so bizarre, and so heinous. It is impossible to look the other way. Chad Daybell and Lori Vallow were dedicated in the most horrible way to an ideology that should only be fiction. Instead, their ideology put them behind bars. Join us as we explore the lives, lies, and diabolical crimes of Lori Vallow, and Chad Daybell I’m your host Kathy Brooks. Please follow and subscribe wherever you get your podcasts! This show is produced, edited, and narrated by Me, Kathy Brooks. I am also the creator of the YouTube channel Left Undone, Incomplete investigations where we have followed this case since Jan 2020. We also have a wonderful community with live streams where we talk all things true crime. If you are enjoying the show and would like to support this one-woman show. Please consider donating to afterglow the Idaho cult series. You can donate a few ways, via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee : https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Sources: Breaking Crime With B E WickedtruthandFbombs.com Support the show (https://www.paypal.com/biz/fund?id=XT4KSK9JBSQ8C) Support the show",
      "release": "2021-10-14T02:00:00Z",
      "duration": "00:51:13.3600000",
      "explicit": true,
      "spotifyId": "2x4pl8Z3kyoFkvoV50ezT3",
      "appleId": 1000538526479,
      "youTubeId": "ffenPuQ3L3U",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2x4pl8Z3kyoFkvoV50ezT3",
        "apple": "https://podcasts.apple.com/podcast/and-so-it-begins-4-lori-vallow-chad-daybell-true-crime-case/id1498278502?i=1000538526479",
        "youtube": "https://www.youtube.com/watch?v=ffenPuQ3L3U"
      }
    },
    {
      "id": "552673cd-0f12-4b4f-b4b3-af0db7b4811f",
      "title": "Family Chaos (3)  Lori Vallow Chad Daybell True Crime",
      "description": "Send us a text Welcome to Afterglow the Unveiling of The Idaho Cult. Episode 3 Family Chaos The insight into Lori Vallow is amazing. We explore her past. Is Lori a true manipulator? Did she use Tylee as a pawn and a possession? We dig even deeper into the custody battle with Joe Ryan and Lori Vallow. This podcast will take you down, the deepest of rabbit holes as it unfolds. This story is so compelling, so bizarre, and so heinous. It is impossible to look the other way. Chad Daybell and Lori Vallow were dedicated in the most horrible way to an ideology that should only be fiction. Instead, their ideology put them behind bars. Join us as we explore the lives, lies, and diabolical crimes of Lori Vallow, and Chad Daybell I’m your host Kathy Brooks. Please follow and subscribe wherever you get your podcasts! This show is produced, edited, and narrated by Me, Kathy Brooks. I am also the creator of the YouTube channel Left Undone, Incomplete investigations where we have followed this case since Jan 2020. We also have a wonderful community with live streams where we talk all things true crime. If you are enjoying the show and would like to support this one-woman show. Please consider donating to afterglow the Idaho cult series. You can donate a few ways, via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee : https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Sources: Annielynics WickedtruthandFbombs.com Support the show",
      "release": "2021-09-27T03:00:00Z",
      "duration": "00:54:44.0800000",
      "explicit": true,
      "spotifyId": "7KruprV0IjXdqWdZkH1MTE",
      "appleId": 1000536709080,
      "youTubeId": "xCe7wzwbFQ8",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KruprV0IjXdqWdZkH1MTE",
        "apple": "https://podcasts.apple.com/podcast/family-chaos-3-lori-vallow-chad-daybell-true-crime/id1498278502?i=1000536709080",
        "youtube": "https://www.youtube.com/watch?v=xCe7wzwbFQ8"
      }
    },
    {
      "id": "e2bff154-4334-4d9c-80ec-64a90e33295e",
      "title": "Joe Ryan (2) Chad Daybell Lori Vallow True Crime Case",
      "description": "Send us a text In Season 1 Episode 2; JOE RYAN, We continue with Lori Cox\u0027s life after her second divorce. Soon after her divorce from William Lagioia. Lori eventually met and married Joseph Ryan. He was raised in the foster care system. Joe Ryan has a sister by the name of Annie Cushing. She has been very vocal and an advocate for Tylee Ryan, and Joe Ryan along the way. Because, well you guessed it, the eventual suspicious death of Joe and of course the deeply disturbing death of Tylee Ryan. Join me weekly as we dig down every rabbit hole possible here on Afterglow, Unveiling the Idaho Cult. I am your host Kathy Brooks Next time we will continue to dig into Lori’s relationship and the untimely death of her 3rd husband, Joe Ryan… This show is produced, edited, and narrated by Me, Kathy Brooks. I am also the creator of the YouTube channel Left Undone, Incomplete investigations where we have followed this case since Jan 2020. We also have a wonderful community with live streams where we talk all things true crime. If you are enjoying the show and would like to support this one-woman show. Please consider donating to afterglow the Idaho cult series. You can donate a few ways, via PayPal at www.PayPal.me/katfshh Via cash app at Cash.app/$afterglowkathy Or at By me a coffee : https://www.buymeacoffee.com/Afterglow No donation is too small. The clips and media in this podcast are considered fair use. Fair use refers to the right to reproduce, use and share copyrighted works of cultural production without direct permission from or payment to the original copyright holders. It is a designation that is assigned to projects that use copyrighted materials for purposes that include research, criticism, news reporting, and teaching. The material is presented for entirely non-profit educational purposes. There is no reason to believe that the featured media clips will in any way negatively affect the market value of the copyrighted works. For these reasons, we believe that the podcast is clearly covered under current fair use copyright laws. For additional information on copyright law and fair use, please visit http://www.copyright.gov/fls/fl102.html . Sources: East Idaho News Fox 13 Phoenix Fox 13 Utah Today Show CBS Television WickedtruthandFbombs.com Support the show",
      "release": "2021-09-12T19:00:00Z",
      "duration": "00:41:21.8400000",
      "explicit": true,
      "spotifyId": "5DJRYtcIVddqOKubMMhdYW",
      "appleId": 1000535092333,
      "youTubeId": "21w_8jfqhqU",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5DJRYtcIVddqOKubMMhdYW",
        "apple": "https://podcasts.apple.com/podcast/joe-ryan-2-chad-daybell-lori-vallow-true-crime-case/id1498278502?i=1000535092333",
        "youtube": "https://www.youtube.com/watch?v=21w_8jfqhqU"
      }
    },
    {
      "id": "4bddf9ac-c6ee-4c33-a0d2-8cf454de839c",
      "title": "Who Is Lori Cox? (1) Lori Vallow Chad Daybell True Crime Case",
      "description": "Send us a text Welcome to Afterglow Unveiling the Idaho Cult, a series. When JJ Vallow and Tylee Ryan went missing in 2019, no one would imagine the outcome. This diabolic crime is so bizarre, so heinous and so compelling, you just cannot look away. In this episode, we start at the beginning. Who was Lori Cox? Where is she from? We discover her life as a cheerleader in high school and her first 2 failed marriages. Was Lori always sinister, or did she become sinister after she met Chad Daybell? We can\u0027t figure that out until we start at the beginning. Join us as we follow the story of Lori Vallow Daybell and Chad Daybell. After the disappearance of Lori’s 2 youngest children, the entire world was concerned. Where are the children? Where are the kids? Became the tagline. While the world was searching for Lori\u0027s children, Lori seemed unconcerned. She was sitting on the beach in Hawaii, while her children were nowhere to be found. We are going down every rabbit hole with this case. Please rate and comment. Help support the show: Paypal www.paypal.me/katfshh Cash app Buy me a coffee Instacart: https://instacart.oloiyb.net/Bmyb4 Buzzsprout link Sources: https://wickedtruthsandfbombs.com/ Inside Edition https://www.insideedition.com/ Fox 10 Phoenix KslTV.com For Business inquires Kathryn@Left-Undone.com All clips used for fair use commentary, criticism, and educational purposes. See Hosseinzadeh v. Klein, 276 F.Supp.3d 34 (S.D.N.Y. 2017) Equals Three, LLC v. Jukin Media, Inc., 139 F. Supp. 3d 1094 (C.D. Cal. 2015). Support the show",
      "release": "2021-09-07T18:00:00Z",
      "duration": "00:34:25.3000000",
      "explicit": false,
      "spotifyId": "2OrBoBzvvaKnpXGHGymHua",
      "appleId": 1000534625188,
      "youTubeId": "8tp8DweFC3Q",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2OrBoBzvvaKnpXGHGymHua",
        "apple": "https://podcasts.apple.com/podcast/who-is-lori-cox-1-lori-vallow-chad-daybell-true-crime-case/id1498278502?i=1000534625188",
        "youtube": "https://www.youtube.com/watch?v=8tp8DweFC3Q"
      }
    }
  ]
}