{
  "_ts": 0,
  "id": "5a9175a3-480b-49d8-8499-4fc47d56db64",
  "name": "AGAPE FREEDOM  PODCAST",
  "youTubeChannelId": "UChpkpA5PvWyW4kodZiM_X5w",
  "episodes": [
    {
      "id": "c2ac2ad3-9bc0-469b-99d7-4c3f4e8163ad",
      "title": "Cults and Religious Deceit Uncovered in Groundbreaking Series: Guest, Janice Selbie",
      "description": "Janice was born and raised in a charismatic Christian home, attending Pentecostal, \r\nVineyard, and other Evangelical churches before eventually marrying a man who would become a pastor. In her 30s she became ultraconservative, donning a head-covering, homeschooling their children, and rejecting any vestiges of secular life (TV, radio, music, newspapers, magazines, etc.). “I referred to myself as ‘Mennocostal,’ frequently attending closed Mennonite churches run by the Holdeman Mennonites.”\r\n \r\nIt wasn’t until her 40s that Janice began experiencing doubts about her deeply held faith. As her marriage unraveled, her questions grew. She found herself wondering about the impact of religion and religious trauma syndrome on sexuality, gender roles and equality, social justice, and more.  \r\n \r\n“Not permitted to explore these questions, I felt like a beach ball held beneath the water for too long. My sadness, confusion, and anger threatened to explode if something didn\u0027t change.”\r\n \r\nAfter ending her decades-long marriage, Janice went back to school to attain her Diploma of Applied Psychology and Counselling. \r\n \r\n“My passion is to help others who are experiencing the multiple significant losses associated with religious de-conversion and religious trauma syndrome. My own journey could have been easier if I had been able to connect with even one other person who had walked away from their faith and built a healthy life afterward.” \r\n \r\nThese painful experiences influenced Janice to develop the Divorcing Religion Workshop so that others could gain knowledge and tools to help with their own journey out of fundamentalist religions.  \r\n\r\nHey use this amazing platform for your livestreams!\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5444679564918784",
      "release": "2024-04-09T12:35:09Z",
      "duration": "00:50:23",
      "explicit": false,
      "youTubeId": "wUAsVOu97Uc",
      "subjects": [
        "Cult Recovery",
        "Mennonite",
        "Evangelicalism",
        "The Church Of God In Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wUAsVOu97Uc"
      }
    }
  ]
}