{
  "_ts": 0,
  "id": "5a9175a3-480b-49d8-8499-4fc47d56db64",
  "name": "AGAPE FREEDOM  PODCAST",
  "youTubeChannelId": "UChpkpA5PvWyW4kodZiM_X5w",
  "episodes": [
    {
      "id": "2c351987-a70b-473e-b843-4be8e8fafd8c",
      "title": "Cults and Religious Deceit Uncovered: Dissecting the History of American Evangelical Church",
      "description": "History of Bloody Massacres at hands of American Evangelical Christians. Jeric share some details regarding American Christian’s slaughtering America Indigenous people who also were Christians, the Indians. The Indians were in America before the white men arrived and took the land by force, believing that God had given it to them. They believed in the God of Abraham, Jacob, and Jesus Christ. Despite their shared faith, white privileged Christian men took the land by force, killing thousands of Indians, including Christian Indians. This raises the question of how people who worshiped the same God could commit such atrocities against one another. These white Christian men used Bible scripture to justify such believes and their evil actions. Some even quoted scriptures while killing babies, men and women, in the name of Jesus? How Ironic. This is covered up and not shared by the America evangelical church today. Jeric highlights how American evangelicals misuse Bible scripture to justify their hatred towards marginalized groups, including the LGBTQIA community. They falsely claim to represent Jesus while spreading hate. Looking at the past 2,000 years of Christianity and religion, we can see similarities in patterns and behaviors, but with different crimes against humanity and mistreatment of humans. They Treat other groups of people less and as inhuman than who are different with religious doctrines, different skin color and beliefs and has different sexual preferences.  Nothing has changed the same was and same is today. Most evangelical Christian’s do not change they follow patterns as their ancestors and justify it by using scripture. It just in different forms and actions. this is part 1!  \r\n\r\nHey use this amazing platform for your livestreams!\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5444679564918784",
      "release": "2024-05-30T11:01:33Z",
      "duration": "00:56:27",
      "explicit": false,
      "youTubeId": "A4LPPUTijrY",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A4LPPUTijrY"
      }
    },
    {
      "id": "ecf1986c-0046-412d-ad44-995817100603",
      "title": "Cults and Religious Deceit Uncovered in Groundbreaking Series: (Episode 2) GUEST, ANDREW HALE",
      "description": "(Trigger Warning): This episode contains potentially distressing content. Please exercise caution while listening, and if you experience any distress or triggers, we recommend discontinuing the episode. \r\n\r\nAndrew J. Hale-Byrne is the author of Grenville. In 2007, he exposed the cult boarding school, known as Grenville Christian College, in the Canadian press. Subsequently, there has been an Anglican Church enquiry, Ontario Provincial Police investigation and an ongoing class-action lawsuit. Indeed, Andrew attended Grenville in the 1990s and saw first-hand the horrific abuse that was inflicted on minors. Currently, he serves as a representative plaintiff and press officer for the Grenville Christian College Class Action. His book is the culmination of his research going back nine and half years. Andrew is British. He and his family reside and work in the United Kingdom, but he travels regularly to Canada to brief the media on matters pertaining to the cult, which damaged numerous lives. Andrew has a long history of social justice and human rights activism, and his exposure of abuse at Grenville is in keeping with that tradition. Andrew is a practising Anglican and has divergent interests from public policy, economic.\r\n\r\n(Please be aware): Some of the people we have on this podcast including some of our cohost’s still identify as Christians while others are in different places spiritually after reevaluating their former believes. There is also guests who don\u0027t subscribe to religion at all. Our inclusive environment welcomes people from various religious backgrounds well as those who do not identify with any religion. We welcome everyone! We strive to create a safe space for openness and respect for all beliefs and religious beliefs. Please be respectful! \r\n\r\nIf you have been enjoying our Agape Freedom Podcast content, make sure to subscribe to our YouTube channel to stay up-to-date on all of the latest releases of new and exciting video content from us. Don\u0027t miss out on the valuable knowledge we share through this platform! Like, Subscribe and Share! 🙂\r\n\r\n\r\n\r\nHey use this amazing platform for your livestreams!\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5444679564918784",
      "release": "2024-05-09T00:10:27Z",
      "duration": "01:00:01",
      "explicit": false,
      "youTubeId": "NEoj4ItE78k",
      "subjects": [
        "Community of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NEoj4ItE78k"
      }
    },
    {
      "id": "c2ac2ad3-9bc0-469b-99d7-4c3f4e8163ad",
      "title": "Cults and Religious Deceit Uncovered in Groundbreaking Series: Guest, Janice Selbie",
      "description": "Janice was born and raised in a charismatic Christian home, attending Pentecostal, \r\nVineyard, and other Evangelical churches before eventually marrying a man who would become a pastor. In her 30s she became ultraconservative, donning a head-covering, homeschooling their children, and rejecting any vestiges of secular life (TV, radio, music, newspapers, magazines, etc.). “I referred to myself as ‘Mennocostal,’ frequently attending closed Mennonite churches run by the Holdeman Mennonites.”\r\n \r\nIt wasn’t until her 40s that Janice began experiencing doubts about her deeply held faith. As her marriage unraveled, her questions grew. She found herself wondering about the impact of religion and religious trauma syndrome on sexuality, gender roles and equality, social justice, and more.  \r\n \r\n“Not permitted to explore these questions, I felt like a beach ball held beneath the water for too long. My sadness, confusion, and anger threatened to explode if something didn\u0027t change.”\r\n \r\nAfter ending her decades-long marriage, Janice went back to school to attain her Diploma of Applied Psychology and Counselling. \r\n \r\n“My passion is to help others who are experiencing the multiple significant losses associated with religious de-conversion and religious trauma syndrome. My own journey could have been easier if I had been able to connect with even one other person who had walked away from their faith and built a healthy life afterward.” \r\n \r\nThese painful experiences influenced Janice to develop the Divorcing Religion Workshop so that others could gain knowledge and tools to help with their own journey out of fundamentalist religions.  \r\n\r\nHey use this amazing platform for your livestreams!\r\n\r\nWant to create live streams like this? Check out StreamYard: https://streamyard.com/pal/d/5444679564918784",
      "release": "2024-04-09T12:35:09Z",
      "duration": "00:50:23",
      "explicit": false,
      "youTubeId": "wUAsVOu97Uc",
      "subjects": [
        "Cult Recovery",
        "Mennonite",
        "Evangelicalism",
        "The Church Of God In Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wUAsVOu97Uc"
      }
    }
  ]
}