{
  "_ts": 0,
  "id": "9f6d3b6d-f7ed-43a4-9fa3-fc4cbf65aa4d",
  "name": "AimFor TheMiddleEQ",
  "youTubeChannelId": "UCw9S3REpciRb0t1p97tpE9w",
  "episodes": [
    {
      "id": "e1549344-bd39-44bf-a219-c42dc4985bb9",
      "title": "Life After Cult and Narcissistic Trauma - Guest Misty Gilbert - Host Dotty Gevers",
      "description": "Misty Gilbert endured a harrowing childhood in a religious cult, where she was raised by narcissistic parents and treated like a prisoner in her own home. Blamed for her own rape—an event that, in her parents\u0027 eyes, reflected poorly on the family—Misty’s early life was marked by immense suffering. However, instead of being consumed by her trauma, Misty used it as a catalyst for change. She bravely escaped the cult, left her toxic family behind, and rebuilt her life from scratch, starting with nothing.\n\nToday, Misty is a successful entrepreneur, owning several thriving businesses, including The Resource Management Group, LLC, Medical Account Solutions, and The Sassy Voice, LLC. She has also been invited to give a TED Talk on Authenticity, https://www.ted.com/talks/misty_gilbert_the_art_of_authenticity_how_to_show_up_as_the_real_you?subtitle=en where she shares her powerful story of overcoming adversity. Misty’s journey from \u0022Trauma to Success\u0022 serves as an inspiration to anyone who has experienced childhood trauma, proving that resilience and self-determination can lead to extraordinary accomplishments.\n\nYou can connect with Misty on LinkedIn https://www.linkedin.com/in/mistywgilbert\n\nAim for the Middle™: Understanding Narcissism and Empathy\n\nNarcissists and empaths exist at opposite ends of a spectrum. Narcissists are self-centered and have difficulty understanding other perspectives, often because they are unwilling to unless it benefits them. In contrast, empaths tend to struggle with people-pleasing behaviors and blurred boundaries. Narcissists make decisions based solely on how it affects their own life or image, while empaths prioritize others’ needs, often at their own expense.\n\nThe families of narcissists frequently distance themselves out of self-preservation, and this pattern of alienation often persists throughout their lives, preventing them from forming meaningful, lasting relationships. Both narcissists and empaths must learn to \u0022Aim for the Middle™\u0022—finding a balance between perspective and empathy, without allowing it to negatively impact their own well-being.\n\nAim For The Middle™ channels\n\nFB:          https://www.facebook.com/dotty.gevers\nBlog:     www.aimforthemiddleeq.com \nIG:          https://www.instagram.com/AimForTheMiddleEq\nGroup:   https://www.facebook.com/groups/4832721326744450\nP:           https://www.pinterest.com/aimforthemiddleeq",
      "release": "2024-12-03T02:37:13Z",
      "duration": "01:56:21",
      "explicit": false,
      "youTubeId": "SiVH-TYhqSs",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SiVH-TYhqSs"
      }
    }
  ]
}