{
  "id": "e6f6902e-26f5-4246-8fb0-a3baddde7471",
  "name": "Al Jazeera English",
  "appleId": 1792469292,
  "youTubeChannelId": "UCNye-wNBqNL5ZzHSJj3l8Bg",
  "episodes": [
    {
      "id": "af935228-8e9d-4ea2-aafe-2fde2177d454",
      "title": "Digging into the Epstein files with Ellie Leonard | The Listening Post",
      "description": "Trump’s Justice Department was ordered to publish documents from the Epstein files more than a month ago. Only 1% of the heavily redacted material has been made public.\n\nWhile the Trump administration floods the zone with news that mainstream outlets have been chasing, an unconventional team of investigators is digging into the Epstein files to see what’s there. They are led by online investigator Ellie Leonard in New York City.\n\nFeaturing: \n\nEllie Leonard - Contributing editor, Blue Amp Media\n\nhttps://www.instagram.com/ajlisteningpost\nhttps://www.facebook.com/AJListeningPost\nhttps://bsky.app/profile/ajlisteningpost.bsky.social \nhttps://x.com/ajlisteningpost\nhttps://www.threads.net/@ajlisteningpost\n\nSubscribe to our Newsletter:\nhttp://aje.io/upic5\nhttp://www.aljazeera.com/program/the-listening-post/\n\n#epsteinfiles   #epstein #news  #breakingnews   #trump  #aljazeeraenglish #ellieleonard",
      "release": "2026-01-26T18:00:24Z",
      "duration": "00:09:41",
      "explicit": false,
      "youTubeId": "Zo-Bb16U-Ro",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Political Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Zo-Bb16U-Ro"
      }
    },
    {
      "id": "621f30a4-8169-47f5-9dcb-7b9eb690426a",
      "title": "Newly released Epstein files spotlight Trump’s past jet trips with Maxwell",
      "description": "The US Justice Department has released a new batch of emails, photos, and videos in the Jeffrey Epstein case. \nThe material includes new facts about US President Donald Trump’s relationship with the late convicted sex offender long before Trump went into politics. \n\nAl Jazeera’s Rosiland Jordan reports from Washington, DC.\n\nSubscribe to our channel: http://bit.ly/AJSubscribe\nFollow us on X: https://twitter.com/AJEnglish\nFind us on Facebook: https://www.facebook.com/aljazeera\nCheck our website: http://www.aljazeera.com/\nCheck out our Instagram page: https://www.instagram.com/aljazeeraenglish/\nDownload AJE Mobile App: https://aje.io/AJEMobile\n\n#DonaldTrump #JeffreyEpstein #GhislaineMaxwell #EpsteinFiles #US #UnitedStates #USPolitics #EpsteinFilesRelease #DOJ #MAGA #EpsteinScandal #AlJazeeraEnglish",
      "release": "2025-12-24T05:15:03Z",
      "duration": "00:02:27",
      "explicit": false,
      "youTubeId": "ff1qzuKnaOQ",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ff1qzuKnaOQ"
      }
    },
    {
      "id": "1949410d-03d3-40b2-92eb-ae942a83b8a8",
      "title": "Confessions, Silence, and Child Abuse: Secrets of the Clergy | Fault Lines Documentary",
      "description": "Over the past 20 years, religious organisations from the Catholic Church to Jehovah’s Witnesses have had a reckoning with cases of child sexual abuse. Many states have tried to tackle the abuse by making clergy mandatory reporters of abuse to officials, just like doctors, therapists and teachers are. However, more than 30 states in the United States do not require church officials to report knowledge or allegations of child abuse if the information is deemed privileged, specifically coming from confession or counselling. It means that abuse can all too often be hidden - and survivors are left without recourse or justice.\r\n\r\nFault Lines investigates how state laws in the US can lead to child sexual abuse in religious communities going unpunished.\n\nSenior Producer: Kavitha Chekuru\nCorrespondent: Natasha Del Toro\nDirector of Photography: Erik Ljung\nEditor: Leslie Atkins\nExecutive Producer: Laila Al-Arian\nProduction Manager: Anabelle Rojas\nFact-checking: Abdulai Bah\nSound Mix: Linus Bergman\nDigital Producer: Riham Mansour\r\n\r\n- Subscribe to our channel: http://aje.io/AJSubscribe\r\n- Follow us on Twitter: https://twitter.com/AJFaultLines \r\n- Follow us on Facebook: https://www.facebook.com/AJFaultLines \r\n- Follow us on Instagram: https://www.instagram.com/ajfaultlines/ \r\n- Check our website: https://www.aljazeera.com/program/fault-lines\n\n#Documentary #Investigation #US \n#law #USlaw #childabuse \r\n@AljazeeraEnglish\r\n#Aljazeeraenglish\r\n#News",
      "release": "2023-12-20T16:30:03Z",
      "duration": "00:27:31",
      "explicit": false,
      "youTubeId": "JZgtnpGyf5o",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JZgtnpGyf5o"
      }
    },
    {
      "id": "36babd83-b7cc-4f2b-b900-1bde3326e1de",
      "title": "Escaping Korea\u0027s Pacific Cult | 101 East",
      "description": "A man sits on a chair, surrounded by a group of men. One by one, they take turns to hit him.\n\nThis is how the Grace Road Church drives the evil from the bodies of its followers, according to former cult members.\n\n101 East investigates this secretive Korean doomsday cult that has lured hundreds of followers to the Pacific island of Fiji.\n\nFollowers like Lee Yunzae and his wife and children.\n\nHe says cult members were beaten and worked for no pay in the church\u0027s businesses.\n\nAfter a year, he escaped with all of his family except for his eldest son, who remains in Fiji.\n\n\u0022Because I took my kids to church, the fact that he\u0027s still in Fiji really hurts me. That\u0027s why I want my son to wake up to reality and get out of there,\u0022 he says, as he embarks on a desperate mission to rescue his son.\n\nThis investigation shows how the group continues to operate, despite its founder being convicted of fraud, child abuse and assault.\n\nIn Fiji, Grace Road has fostered close ties with local politicians and won lucrative government contracts.\n\nFijians who worked for the church say they were treated like slaves and are fearful of Grace Road\u0027s powerful connections.\n\nIn a leaked video, its founder, Shin Ok-ju, has been filmed preaching about the country, saying: \u0022We will rule, govern and conquer.\u0022\n\n101 East reveals the inner workings of the South Korean cult that is tearing families apart.\n\n- Subscribe to our channel: http://aje.io/AJSubscribe \n- Follow us on Twitter: https://twitter.com/AJEnglish \n- Find us on Facebook: https://www.facebook.com/aljazeera \n- Check our website: https://www.aljazeera.com/",
      "release": "2019-11-14T13:06:34Z",
      "duration": "00:25:46",
      "explicit": false,
      "youTubeId": "Bn9nJ4mthKA",
      "subjects": [
        "Grace Road Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Bn9nJ4mthKA"
      }
    },
    {
      "id": "247394d2-9498-4bff-a8df-69ee1ee03952",
      "title": "The Colony: Chile\u0027s dark past uncovered | Al Jazeera Correspondent",
      "description": "How did a secret German sect in Chile become a haven for Nazi fugitives and a torture centre for the Pinochet regime?\n\nForty years after the US-backed military coup that brought General Augusto Pinochet to power in Chile, the truth about the sordid abuses and crimes that took place during his dictatorship are still emerging. \n\nThe mountains of Patagonia in southern Chile witnessed a particularly bizarre chapter of the Pinochet era; one that is still claiming victims today.\n\nIn 1961, a former Nazi corporal called Paul Schaefer fled Germany, along with hundreds of others, to found a sect in southern Chile. In an idyllic rural enclave framed by the Andes Mountains he created a virtual state within a state - one where horrifying events unfolded.\n\nInitially with the ignorance of the government, and then with the complicity of the Pinochet regime, children were separated from their parents at birth and raised in a Kinder House. Men and women were kept apart and often drugged, while Schaefer systematically sexually abused boys and, occasionally, girls.\n\nIt also served as a haven for Nazi fugitives - such as Walter Rauff, the inventor of the portable gas chamber, and Joseph Mengele, the so-called \u0027Angel of Death\u0027 - who were permitted to hide out there in exchange for overseeing sophisticated forms of torture. \n\nAll of this took place with the full knowledge of the Pinochet regime, whose notorious intelligence chief, General Manuel Contreras, would often visit the site. \n\nIn The Colony: Chile\u0027s dark past uncovered, the truth about what took place inside the Colony is revealed through the story of Winfried Hempel. Now 35, Hempel was born into the Colony and raised there without any knowledge of who his parents were. When he first left its grounds, he was 20 years old, spoke no Spanish, had no notion of the country in which he lived and had never seen a television, computer or mobile phone.  \n\nAlthough he initially struggled to adapt to the world beyond Colonia Dignidad, he gradually learned to speak Spanish, received his high school certificate and eventually qualified as a lawyer.\n\nAl Jazeera\u0027s Lucia Newman has followed the story of the Colonia Dignidad since 1996 - at one point even being turned away from the site at gunpoint. As a Chilean, she wants to expose the crimes that took place there - crimes that her country was not only complicit in, but an active participant to. \n\nSubscribe to our channel  http://bit.ly/AJSubscribe\nFollow us on Twitter https://twitter.com/AJEnglish\nFind us on Facebook https://www.facebook.com/aljazeera\nCheck our website:  http://www.aljazeera.com/\n\n#AlJazeeraEnglish #AlJazeeraCorrespondent #Chile\u0027sDarkPast",
      "release": "2013-11-09T14:31:06Z",
      "duration": "00:47:43",
      "explicit": false,
      "youTubeId": "jC4G6DToi90",
      "subjects": [
        "Colonia Dignidad"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jC4G6DToi90"
      }
    }
  ]
}