{
  "id": "e6f6902e-26f5-4246-8fb0-a3baddde7471",
  "name": "Al Jazeera English",
  "youTubeChannelId": "UCNye-wNBqNL5ZzHSJj3l8Bg",
  "episodes": [
    {
      "id": "247394d2-9498-4bff-a8df-69ee1ee03952",
      "title": "The Colony: Chile\u0027s dark past uncovered | Al Jazeera Correspondent",
      "description": "How did a secret German sect in Chile become a haven for Nazi fugitives and a torture centre for the Pinochet regime?\n\nForty years after the US-backed military coup that brought General Augusto Pinochet to power in Chile, the truth about the sordid abuses and crimes that took place during his dictatorship are still emerging. \n\nThe mountains of Patagonia in southern Chile witnessed a particularly bizarre chapter of the Pinochet era; one that is still claiming victims today.\n\nIn 1961, a former Nazi corporal called Paul Schaefer fled Germany, along with hundreds of others, to found a sect in southern Chile. In an idyllic rural enclave framed by the Andes Mountains he created a virtual state within a state - one where horrifying events unfolded.\n\nInitially with the ignorance of the government, and then with the complicity of the Pinochet regime, children were separated from their parents at birth and raised in a Kinder House. Men and women were kept apart and often drugged, while Schaefer systematically sexually abused boys and, occasionally, girls.\n\nIt also served as a haven for Nazi fugitives - such as Walter Rauff, the inventor of the portable gas chamber, and Joseph Mengele, the so-called \u0027Angel of Death\u0027 - who were permitted to hide out there in exchange for overseeing sophisticated forms of torture. \n\nAll of this took place with the full knowledge of the Pinochet regime, whose notorious intelligence chief, General Manuel Contreras, would often visit the site. \n\nIn The Colony: Chile\u0027s dark past uncovered, the truth about what took place inside the Colony is revealed through the story of Winfried Hempel. Now 35, Hempel was born into the Colony and raised there without any knowledge of who his parents were. When he first left its grounds, he was 20 years old, spoke no Spanish, had no notion of the country in which he lived and had never seen a television, computer or mobile phone.  \n\nAlthough he initially struggled to adapt to the world beyond Colonia Dignidad, he gradually learned to speak Spanish, received his high school certificate and eventually qualified as a lawyer.\n\nAl Jazeera\u0027s Lucia Newman has followed the story of the Colonia Dignidad since 1996 - at one point even being turned away from the site at gunpoint. As a Chilean, she wants to expose the crimes that took place there - crimes that her country was not only complicit in, but an active participant to. \n\nSubscribe to our channel  http://bit.ly/AJSubscribe\nFollow us on Twitter https://twitter.com/AJEnglish\nFind us on Facebook https://www.facebook.com/aljazeera\nCheck our website:  http://www.aljazeera.com/\n\n#AlJazeeraEnglish #AlJazeeraCorrespondent #Chile\u0027sDarkPast",
      "release": "2013-11-09T14:31:06Z",
      "duration": "00:47:43",
      "explicit": false,
      "youTubeId": "jC4G6DToi90",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jC4G6DToi90"
      }
    }
  ]
}