{
  "_ts": 0,
  "id": "2659d592-9e5f-4959-aeff-0e7a9ad0da83",
  "name": "Al Rojo Vivo",
  "youTubeChannelId": "UCDUxOvbwu1bnyD7AucP0ESw",
  "episodes": [
    {
      "id": "ca07c845-766a-478f-8b9e-3f5226dd9b98",
      "title": "Violento enfrentamiento entre judíos y policías en Guatemala",
      "description": "Video oficial de Al Rojo Vivo. Se desató un violento enfrentamiento entre los integrantes de la comunidad ultra ortodoxa Lev Tahor y la policía en Guatemala.\n#AlRojoVivo #Guatemala #Judios\n\nDescarga nuestra App:\nhttps://telemundo.app.link/trzsaVVkfyb\n\nSUSCRÍBETE: https://bit.ly/AlRojoVivoYT\n\nAl Rojo Vivo\n“Al Rojo Vivo” es una revista noticiosa que comienza una nueva etapa junto a Jessica Carrillo y Lourdes Stephen. Te brindamos una hora llena de noticias de actualidad, nacionales e internacionales. Lo mejor del mundo del entretenimiento, las últimas tendencias, videos de acción, especiales, exclusivas y todo lo que está trending en redes sociales.\n\n#AlRojoVivo es transmitido en los Estados Unidos de lunes a viernes a las 4PM/3C.\n\nTelemundo\nEs una empresa de medios de primera categoría, líder en la industria en la producción y distribución de contenido en español de alta calidad a través de múltiples plataformas para hispanos en los Estados Unidos y alrededor del mundo. La cadena ofrece producciones dramáticas originales de Telemundo Studios – el productor #1 de contenido en español de horario estelar – así como contenido alternativo, películas de cine, especiales, noticias y eventos deportivos de primer nivel, alcanzando el 94% de los televidentes hispanos en los Estados Unidos en 210 mercados a través de 17 estaciones propias y 57 afiliadas de TV abierta. Telemundo también es propietaria de WKAQ, una estación de televisión local que sirve Puerto Rico. Telemundo es parte de NBCUniversal Telemundo Enterprises, una división de NBCUniversal, una de las compañías líderes en el mundo de los medios y entretenimiento. NBCUniversal es una subsidiaria de Comcast Corporation.\n\nSÍGUENOS EN X: https://twitter.com/alrojovivo \nDANOS ME GUSTA EN FACEBOOK: https://es-la.facebook.com/alrojovivotelemundo \n\nViolento enfrentamiento entre judíos y policías en Guatemala\nhttp://www.youtube.com/AlRojoVivo",
      "release": "2024-12-24T02:45:27Z",
      "duration": "00:03:07",
      "explicit": false,
      "youTubeId": "0nNfGQ54L_Y",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0nNfGQ54L_Y"
      }
    }
  ]
}