{
  "_ts": 0,
  "id": "1d375ea6-31fc-4384-a06f-32e5563e1a43",
  "name": "Aldo B. Martin Presents: The Reclamation",
  "spotifyId": "6dtd7NUJrLhciAS0yCrStS",
  "appleId": 1597681412,
  "episodes": [
    {
      "id": "c7009ecf-398c-4e48-a28a-07074d647c5a",
      "title": "In Conclusion...",
      "description": "\u0022An audience is in some sense timeless...an artist must trust his audience, and know that his audience trusts him and he cannot cheat that invisible one or two or multitude of people.  Between him...and that audience, there is an unspoken bond, an unspoken promise not to betray...\u0022    - James BaldwinSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-02-26T00:00:00",
      "duration": "01:06:21.7920000",
      "explicit": false,
      "spotifyId": "4xDPcuWznH0f2RSK7d8Cbv",
      "appleId": 1000601609426,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xDPcuWznH0f2RSK7d8Cbv",
        "apple": "https://podcasts.apple.com/podcast/in-conclusion/id1597681412?i=1000601609426"
      }
    },
    {
      "id": "7564faef-4b9d-421a-9e60-817ff0c654ca",
      "title": "The Cult of Personality",
      "description": "My thoughts on the word cult.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-02-20T00:00:00",
      "duration": "00:27:13.2530000",
      "explicit": false,
      "spotifyId": "1sVDru0HKTPUa7SJttwdDq",
      "appleId": 1000600632961,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1sVDru0HKTPUa7SJttwdDq",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-personality/id1597681412?i=1000600632961"
      }
    },
    {
      "id": "8afaf9f0-1085-409c-b5b6-cef3b7cac55e",
      "title": "The Truck Driver and the Gas Pump",
      "description": "Today we speak with Dr. Patrick Knapp, PhD who, along with is wife, Heidi Knapp, CLC, runs an organization called Becoming Free where they \u0022assist people to better understand and recover from their unique harmful religious or spiritual experiences and  the painful relational dynamics of family estrangement.\u0022  Their goal is \u0022to support people to process their abusive experiences for improved insight, emotional growth, relational healing and spiritual development.\u0022  They believe that this can be  \u0022accomplished through life-recovery coaching, periodic support and recovery groups, and various online and in-person educational resources.”Dr. Knapp is also the author of “Understanding Religious Abuse and Recovery: Discovering Essential Principles for Hope and Healing” where he discusses different perspectives on how people best understand and recover from religious abuse. In addition, Dr. Knapp and Heidi Knapp are contributing authors to a book called Wounded Faith where they write a chapter about marital repair after being a part of a religiously abusive situation.  Dr. Knapp speaks with us today about his experience in a bible-based cult and how that has helped to shape the work that he has been doing since 1984.  Dr. Knapp can be reached at becomingfree.org or you can email him at becomingfree.org@gmail.comSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-02-19T00:00:00",
      "duration": "00:49:47.0750000",
      "explicit": false,
      "spotifyId": "2mhMC6ZDjnfoeBefvKmDcu",
      "appleId": 1000600365555,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mhMC6ZDjnfoeBefvKmDcu",
        "apple": "https://podcasts.apple.com/podcast/the-truck-driver-and-the-gas-pump/id1597681412?i=1000600365555"
      }
    },
    {
      "id": "be7f4cb7-514c-43ab-b6f9-b66a60712fd5",
      "title": "Personal Agency vs. Spiritual Authority",
      "description": "Today we speak with Alan Allard.  Alan was a psychotherapist in private practice for 12 years in the Chicago suburbs. Since 2005 he has been a coach and is an expert in helping abuse and trauma victims take ownership of their life and begin to thrive. He works with clients who have experienced sexual abuse, abusive relationships, adverse childhood experiences, and especially spiritual and religious abuse.More specifically, Alan has spent many years as a therapist or coach to members of the ICOC or similar religious organizations.  It should also be mentioned that he was a member of the ICOC in Chicago, from 1987 until the year 2000.  Alan speaks to us today about those days when he was a therapist, in part, to members of the ICOC and how what was discussed in his therapy sessions was a contradiction with what the church taught.Alan discusses the concept of Personal Agency vs. Spiritual Authority and how the latter has been used to undermine the former.  Alan further explains that if one isn’t the authority in their own life, then they will find someone or something to fill that void.  He also speaks to us about the idea of blind obedience or toxic trust and it’s potential harmful impact within the context of spiritual authority.  Alan is the author of Enlightened Happiness: Seven Secrets to the Life You Were Meant to live available on amazon.com. To get in contact with Alan, you can reach him at AlanAllard.com or LinkedIn at https://www.linkedin.com/in/alanallard/.  He has a private Facebook group, \u0022Growing Through Adversity: How to Own Your Life and Thrive you are welcome to check out--contact Alan for a link to the group.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-02-12T00:00:00",
      "duration": "00:43:12.2870000",
      "explicit": false,
      "spotifyId": "3j5VWyZLbvIS7t9O4kGf4n",
      "appleId": 1000599180652,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3j5VWyZLbvIS7t9O4kGf4n",
        "apple": "https://podcasts.apple.com/podcast/personal-agency-vs-spiritual-authority/id1597681412?i=1000599180652"
      }
    },
    {
      "id": "6c6d22b9-ea3d-4185-a8d9-d8cf8dac81e7",
      "title": "The Letter Revisited",
      "description": "In February 2003, the Henry Kriete Letter was released.  He titled it \u0022Honest to God.\u0022  The letter\u0027s impact was immediate.  Aldo has always wondered why the letter had such an impact.  \u0022Honest to God\u0022 was not the first time that criticisms of the church were penned, published, and distributed.  However, those writings did not have the same impact that the letter did.  Why?  Aldo concludes that the reason for the immediate impact of the letter was due to \u0022our level of indoctrination.\u0022   Aldo asserts that had Henry Kriete not been a standing evangelist with the organization, his letter would not have had the immediate impact that it did, as the organization was a \u0022self sealing system.\u0022  Aldo didn\u0027t read the letter back then.  He skimmed it.  However, he finally read it 20 years later and gives us his thoughts.  He also invited two previous guests from Season 2 to join him.  Del from London and Tricia from Kentucky sat down with Aldo and had a discussion about the letter\u0027s impact.  Del first read it 20 years ago and re-read it for this discussion, while Tricia has never read it until now.  They discuss a variety of topics in regards to the letter, such as:                - the reason for the letter\u0027s impact            - the letter\u0027s intended audience.            - the letter\u0027s indication of the subculture that existed within the group            - why is the letter still discussed 20 years later            - the letter\u0027s argument for the church being a \u0022cult of personality.\u0022Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-02-04T00:00:00",
      "duration": "00:49:34.0660000",
      "explicit": false,
      "spotifyId": "1LzwuwWAe1Fx7Yw4uK2FGk",
      "appleId": 1000597976155,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1LzwuwWAe1Fx7Yw4uK2FGk",
        "apple": "https://podcasts.apple.com/podcast/the-letter-revisited/id1597681412?i=1000597976155"
      }
    },
    {
      "id": "e978ccab-2f0d-40ae-be9c-b027d5efcef4",
      "title": "The London Working Group Minutes (pt II)",
      "description": "Long before the Henry Kriete Letter was delivered to the hands of ICOC members around the globe, the brothers and sisters of the London Church of Christ set the table.   The regular disciples of that church began to speak up about the injustices that they’ve experienced.  It seems that they did so because they wanted to preserve and protect the church that they loved from continuing their harmful practices.   They held open forums and created the working groups.  Today, we are going to hear from three men who were present at one of these meetings.  The three of them sat down to have a conversation and recollected the tone and outcome of that meeting.  The original meeting took place on February 1, 2003.  This episode is being released on February 1, 2023.  Twenty years to the day.  Why is this important?  Simply put, notion of such a meeting and it\u0027s subsequent minutes  demonstrate that the issues that the ICOC has had and continues to have, according to the people that have recently left, are not new.  The issues have been spoken about before.  The issues have been written about before.  As former members attempt to make sense of what they were a part of, it is important to take a look back, in order to move forward.   Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-02-01T00:00:00",
      "duration": "00:45:57.0930000",
      "explicit": false,
      "spotifyId": "24vtXxKtRrTbmGP0sl7kjh",
      "appleId": 1000597500986,
      "subjects": [
        "International Churches Of Christ",
        "Body Of Christ Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/24vtXxKtRrTbmGP0sl7kjh",
        "apple": "https://podcasts.apple.com/podcast/the-london-working-group-minutes-pt-ii/id1597681412?i=1000597500986"
      }
    },
    {
      "id": "15201d9a-9e21-4f92-8a05-556bda1716d3",
      "title": "The London Working Group Minutes",
      "description": "Shortly before the release of Henry Kriete\u0027s letter in early  2003, the London Church of Christ experienced an upheaval.  The members of the London Church of Christ spoke up and against the systemic failures of their congregation.  As a result, members of the London Church of Christ formed a \u0022Working Group.\u0022  The \u0022Working Group\u0022 was comprised of paid staff members and unpaid members of their church.  They were tasked with addressing the issues of the church and to create a path moving forward.  As these meetings took place, notes, or minutes, were taken at these meetings.  Elena and Aldo got a hold of the minutes for one of these particular meetings.  Elena and Aldo could not help but to notice that the issues addressed at this particular meeting in 2003, were similar to the issues that the \u0022Discipling Dilemma\u0022 brought up in 1988.  Join them as they discuss what stood out to them.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-01-29T00:00:00",
      "duration": "00:33:29.2340000",
      "explicit": false,
      "spotifyId": "6XZamKde7uHBnRBpQnZaOg",
      "appleId": 1000597089928,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6XZamKde7uHBnRBpQnZaOg",
        "apple": "https://podcasts.apple.com/podcast/the-london-working-group-minutes/id1597681412?i=1000597089928"
      }
    },
    {
      "id": "5db2df1f-ec48-426c-97f8-7b074cd4d1fb",
      "title": "The Discipling Dilemma",
      "description": "The \u0022Discipling Dilemma\u0022 by Dr. Flavil Yeakley Jr, is at the crux of season 3.  Christina, Chris T, Jenn, and Matthew met with Aldo to discuss their views on the book.  The five of them all joined the church in different years.  In addition they also represent different parts of the church; London 1988, North Carolina 1990, New York City 1995 and 2000, Los Angeles 2001.  Some of the topics raised in the book and discussed on this episode:- The ICOC resembling a multi level marketing system.- \u0022The Discipling Dilemma\u0022 finding good qualities in the ICOC- Members conforming to the desired personality type- Results of the Myers-Briggs Personality Exam.- Recommendations to the church made by the authorsThe five person panel discuss how elements of this book, which was published in 1988 provided some insight into their individual experiences with the organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-01-22T00:00:00",
      "duration": "00:53:31.9110000",
      "explicit": false,
      "spotifyId": "2b8Ajgn6OQ1qEQNd6bIiV3",
      "appleId": 1000595909993,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2b8Ajgn6OQ1qEQNd6bIiV3",
        "apple": "https://podcasts.apple.com/podcast/the-discipling-dilemma/id1597681412?i=1000595909993"
      }
    },
    {
      "id": "cd60753a-5858-4ef4-8079-94f7062e34dd",
      "title": "Dr. Jerry Jones",
      "description": "Dr. Jerry Jones joined the Boston Movement in 1984.  Prior to joining the Boston Movement, Dr. Jones was a member of the traditional Church of Christ.  As a member of the Boston Movement, he was a bible talk leader, evangelist and was finally appointed as an elder with the Boston Church of Christ.   The leadership of the Boston Movement were more than happy to have Dr. Jones as a member of the organization as he \u0022would bring tremendous credibility to the Movement\u0022 because \u0022up to that time he was the Head of the Bible Department at Harding University.\u0022  Dr. Jones left the organization in 1986 because of his concerns with what the Movement taught.  He then wrote and published a book called \u0022What Does the Boston Movement Teach?\u0022  where he uses primary sources to demonstrate what the title of the book indicates.  Dr. Jones then went on to publish 2 more volumes of this book.  Dr. Jones shares with us his recollection of his time spent with the group and the reasons why he left, and his motivation for writing his books.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-01-15T00:00:00",
      "duration": "00:53:43.9800000",
      "explicit": false,
      "spotifyId": "3SjrSGaqKhkyTmKVJVnubg",
      "appleId": 1000594467302,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3SjrSGaqKhkyTmKVJVnubg",
        "apple": "https://podcasts.apple.com/podcast/dr-jerry-jones/id1597681412?i=1000594467302"
      }
    },
    {
      "id": "dd679cc4-4ca5-4b48-a699-0d17f90270a5",
      "title": "Women\u0027s Day",
      "description": "Today, Elena and Christina take the wheel and speak with Tina.  Tina joined the London Church of Christ in 1985.  The three of them discuss the church\u0027s annual event called \u0022Women\u0027s Day.\u0022  The trio discuss the differences and similarities between the \u0022Women\u0027s Day\u0022 events in New York City and in London.  Tina also discusses her conversion as the creation of a family and  a series of sermons cassette tapes is what helped to convert her.  Tina also discusses joining a mission team to Lagos, Nigeria.  She tells us what is was like to join and be a part of a mission team as they planted a new church on a different continent.  Tina also explains to us her process of finally leaving the organization.  Join Elena, Christina, and Tina for some laughs and stories.  Wait...where\u0027s Aldo?Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-01-08T00:00:00",
      "duration": "01:10:29.6680000",
      "explicit": false,
      "spotifyId": "38GA8Qv0KMdJtUZf3RgNyQ",
      "appleId": 1000593013609,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38GA8Qv0KMdJtUZf3RgNyQ",
        "apple": "https://podcasts.apple.com/podcast/womens-day/id1597681412?i=1000593013609"
      }
    },
    {
      "id": "c99527db-5ffb-402e-ad5a-93f75784754d",
      "title": "Just My Thoughts",
      "description": "It\u0027s been a long week.  This is what I think...**Disclaimer:  the pending lawsuit is NOT a class action lawsuit and all accusations are alleged.**Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-01-07T00:00:00",
      "duration": "00:32:46.1320000",
      "explicit": false,
      "spotifyId": "2gKyY9RB8TAZTnwSsNNZrT",
      "appleId": 1000592982714,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2gKyY9RB8TAZTnwSsNNZrT",
        "apple": "https://podcasts.apple.com/podcast/just-my-thoughts/id1597681412?i=1000592982714"
      }
    },
    {
      "id": "6ed359e6-73a3-48cd-b84a-e2522faa0eec",
      "title": "Pending...",
      "description": "Michele Roland and Senator Joseph Dunn sit down with us today to discuss pending litigation that has been filed against the International Church of Christ, the International Christian Church, HOPE World Wide, MERCY World Wide, and the City of Angels International Christian Church.  Both Ms. Roland and Senator Dunn are a part of the case and speak to us about how this came about and why.  They talk to us about their involvement with the case and discuss what to expect in the coming days and weeks as it pertains to the pending lawsuit.  To learn more about Senator Joseph Dunn, visit The Zero Abuse Project To learn more about Michelle Roland, visit Whatheflok.comIf you or someone you know has a story and would like to come forward please reach out to Michele Roland at CheleRoland@icloud.com Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-01-03T00:00:00",
      "duration": "00:53:23.2910000",
      "explicit": false,
      "spotifyId": "0c3kPSDmI6NcmYnYx0woUj",
      "appleId": 1000591977193,
      "subjects": [
        "International Churches Of Christ",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0c3kPSDmI6NcmYnYx0woUj",
        "apple": "https://podcasts.apple.com/podcast/pending/id1597681412?i=1000591977193"
      }
    },
    {
      "id": "004eb8c4-bbd4-4759-991e-3171d07ed236",
      "title": "Accept...Except...",
      "description": "**Some of the content of this episode deals with suicidal ideations and self injury.  If you or anyone you now is need of support in that area, please contact the suicide and crisis lifeline**Today we meet Nicole.  Nicole is a  Licensed Clinical Social Worker (LCSW) and currently works as a psychotherapist.  For a little over a decade, Nicole has had experience in counseling a wide variety of people including members of the LGTBQ\u002B community.  Nicole has also provided counseling to college students, patients with HIV, and people who live with substance abuse.  Nicole also works with members of the BIPOC community and other groups that might be considered to be marginalized. Nicole identifies as a member of the LGTBQ\u002B community and is a former member of the ICOC.  Nicole explains to us what her experience was a like as a person who identifies as gay and as a member of the church.   Nicole believes that in speaking, the voices of other members of the queer/LGTBQ\u002B collective can be heard and seen as well.  Nicole can be found on instagram @strength_in_truth_lgtbqIf you would like more information or support regarding the LGTBQ\u002B community, check out the following links:GaychurchThe Reformation ProjectThe Trevor ProjectTranslifelineSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2023-01-01T00:00:00",
      "duration": "00:55:58.5890000",
      "explicit": false,
      "spotifyId": "53ktWN7jH18zhKkjRWR1xx",
      "appleId": 1000591800701,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/53ktWN7jH18zhKkjRWR1xx",
        "apple": "https://podcasts.apple.com/podcast/accept-except/id1597681412?i=1000591800701"
      }
    },
    {
      "id": "250d47d2-50fe-436b-8048-fe9d82ab5fff",
      "title": "Coast to Coast",
      "description": "Hugh became a member of the Church of Christ in 1982.  He then made a cross country drive, from California to Massachusetts to  join the Boston Movement in 1985.  Hugh has spent time as a teen worker and eventually joined the full time ministry and became a leader with the movement.  Hugh speaks with us about establishing a marriage, raising a family, while being a leader with the church.  Like many people that have already appeared on the podcast, Hugh defines himself as being a committed member at one point in his life.  His commitment is evidenced by the fact that he moved over 30 times for the purpose of attempting to meet the needs of the church.  Hugh also talks to us about what his views are now regarding his time spent with the organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-12-25T00:00:00",
      "duration": "00:58:29.1850000",
      "explicit": false,
      "spotifyId": "0UFRCJxDp45GbqohyL5r3S",
      "appleId": 1000591223008,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0UFRCJxDp45GbqohyL5r3S",
        "apple": "https://podcasts.apple.com/podcast/coast-to-coast/id1597681412?i=1000591223008"
      }
    },
    {
      "id": "e5c24520-40e5-47ce-acae-d7d6fe816c91",
      "title": "R.E.V.E.A.L.",
      "description": "Today we speak with Chris Lee.  Chris is the curator of REVEAL.org.  Since the 1990\u0027s, REVEAL has been a source of information and solace for the community of former members.  I use the term \u0022curator\u0022 to describe Chris because REVEAL is source where one can find a variety of articles, testimonies, and other documents that pertain to the ICOC experience.  The ICOC has referred to REVEAL and it\u0027s contents as \u0022spiritual pornography.\u0022  However, thousands of former members have used REVEAL as a place to help them understand what they were a part of.  Chris tells us about how he became a member and then a former member.  He also talks to us about how he got on board with REVEAL.org. Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-12-18T00:00:00",
      "duration": "00:47:37.8480000",
      "explicit": false,
      "spotifyId": "1X6UY2kd7aqw5tmW4EYshd",
      "appleId": 1000590510525,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1X6UY2kd7aqw5tmW4EYshd",
        "apple": "https://podcasts.apple.com/podcast/r-e-v-e-a-l/id1597681412?i=1000590510525"
      }
    },
    {
      "id": "b703ce57-2e19-4281-9ef4-d0bc39bf55c5",
      "title": "Losing My Religion",
      "description": "Before there was a Reclamation Podcast there was the YouTube channel called “Losing My Religion.”  The creator and host of the program joins us today.  Her name is Helen and she too is a former member of the ICOC.  She speaks to us about the idea and inspiration behind the creation of her YouTube channel.  Helen also talks to us about her experience in the church.  She tells us how she joined.  She explains to us why she left.  She gives the reasons as to why she does what she does today.  To find out more about Helen and the work that she does use this hyperlink to check out Losing My Religion on YouTubeSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-12-11T00:00:00",
      "duration": "00:52:26.4220000",
      "explicit": false,
      "spotifyId": "0cLQEAVbx52OCwaRSMbWPv",
      "appleId": 1000589726876,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0cLQEAVbx52OCwaRSMbWPv",
        "apple": "https://podcasts.apple.com/podcast/losing-my-religion/id1597681412?i=1000589726876"
      }
    },
    {
      "id": "8159a6c6-30c1-4426-885e-2a9bcfa9deb0",
      "title": "Much Unsaid",
      "description": "Today we speak with Chris T.  Chris joined the church as a college student in the early 1990s.  He remained a member for the better part of that decade.  He talks about his upbringing and how it played a factor in his joining the church.  Chris talks to us about his personality and how it did not necessarily fit into the culture of the section of the church that he was a part of.  While Chris’ story is unique, there are elements of his experience that are parallel to the experiences of others regardless of time and physical space.  Chris\u0027 story is about a man who has had to grapple with much in life.  After many years and much work, he is now in a place where he is able to put words to his experiences and can make sense of it all.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-12-04T00:00:00",
      "duration": "00:41:16.1990000",
      "explicit": false,
      "spotifyId": "2wRPplWlrUkeWkWOXAZvBy",
      "appleId": 1000588653597,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2wRPplWlrUkeWkWOXAZvBy",
        "apple": "https://podcasts.apple.com/podcast/much-unsaid/id1597681412?i=1000588653597"
      }
    },
    {
      "id": "cba2eabc-a3b3-4938-9c72-d849818b6c42",
      "title": "Like A Berean?",
      "description": "People leave the ICOC for a variety of reasons.  Some leave because their personal believes no longer mesh with the practices of the organization.  Not everyone who has left leaves with a furry of negativity.  Sometimes, people leave because they simply have outgrown the organization.  Today we speak with Alejandra.  She was a member of the organization for 20 years.  She joined as a member of the campus ministry.  She was a part of the singles ministry.  She then became a part of the marrieds ministry.  She has experienced this church through out the different phases of her adulthood.  She talks to us about why she joined and talks to us about why she left.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-11-27T00:00:00",
      "duration": "00:48:37.2240000",
      "explicit": false,
      "spotifyId": "1MZAwggQVWHEvseEqQ25p9",
      "appleId": 1000587587421,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MZAwggQVWHEvseEqQ25p9",
        "apple": "https://podcasts.apple.com/podcast/like-a-berean/id1597681412?i=1000587587421"
      }
    },
    {
      "id": "be9cdec3-7e21-4c64-880e-026e9723cca7",
      "title": "...The More They Remain the Same.",
      "description": "In our second and final segment of our conversation with Melissa, she tells us more about being a student in the ICCM.  She talks to us about the financial sacrifice that was expected of her and the type of effect that it had on her.  She talks about feeling trapped by the ICC and their methods and how this feeling of being trapped made her feel that she had to escape from the organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-11-23T00:00:00",
      "duration": "00:34:45.9550000",
      "explicit": false,
      "spotifyId": "4HtS52QHgMN4fwB6NKLYtv",
      "appleId": 1000587214157,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4HtS52QHgMN4fwB6NKLYtv",
        "apple": "https://podcasts.apple.com/podcast/the-more-they-remain-the-same/id1597681412?i=1000587214157"
      }
    },
    {
      "id": "1acba57e-2aff-4085-8426-62ce79ed43f2",
      "title": "The More Things Change...",
      "description": "The ICOC is birthed from the COC and the Crossroads Movement.  The ICC is birthed from the ICOC.  Today we meet Melissa who joined the ICC in 2019 and left recently.  Melissa tells the story of a young person who was in search of belonging and community and found it in the ICC.  Her story is not different from the various stores that we have heard already.  She also talks about her experience as a student with the ICCM.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-11-20T00:00:00",
      "duration": "00:30:44.3750000",
      "explicit": false,
      "spotifyId": "7vLSpVzHLe9KwITCMCZLXA",
      "appleId": 1000586834400,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vLSpVzHLe9KwITCMCZLXA",
        "apple": "https://podcasts.apple.com/podcast/the-more-things-change/id1597681412?i=1000586834400"
      }
    },
    {
      "id": "b739133d-19eb-4b42-a2b9-0d273bebcd6f",
      "title": "Read the Terms and Conditions",
      "description": "Ini tells us how the church helped him to get his life together.   Despite this, Ini left.  He begins to tell us why.  Ini mentions the term “spiritual abuse” and explains why this phrase is troublesome to him as it pertains to the ICC.   In states that his time with the church was very positive for the most part.  However, as he witnessed the manner in which others were treated, he began his movement away from the organization.  Ini had to make a decision as his relationship with the church was having an effect on his relationship with his family.   Despite leaving the organilzation several years ago, Ini states that he has begun his healing process fairly recently.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-11-16T00:00:00",
      "duration": "00:24:19.3820000",
      "explicit": false,
      "spotifyId": "4fB9VSXX54vpVKYB32eZIj",
      "appleId": 1000586370222,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fB9VSXX54vpVKYB32eZIj",
        "apple": "https://podcasts.apple.com/podcast/read-the-terms-and-conditions/id1597681412?i=1000586370222"
      }
    },
    {
      "id": "fc5660ed-9a78-458e-99f3-c7bd9ef16d19",
      "title": "Brother From Another...",
      "description": "Today we speak with Ini.  Ini is a former member of the International Christian Church, or ICC for short.   Ini tells us why he wanted to lend his voice to the collective that is the Reclamation Podcast.   Ini  was a part of the ICC in London, England.   He was a member from 2009 up until 2013.   Upon joining, he wasn’t aware of the ICC’s previous history or relationship to the ICOC.  Ini recounts and retells the unorthodox manner in which he first came in contact with the organization.   At this point in the program, we have heard many stories and many of the themes are similar and bleed into one another in some form or fashion.  What’s interesting about Ini’s story is that, despite a lapse in time and a difference in organization, the experience is similar if not the same to those that have appeared on the program before him.   Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-11-13T00:00:00",
      "duration": "00:25:38.1680000",
      "explicit": false,
      "spotifyId": "5FpNhpBonTWLPHkOxMsSHx",
      "appleId": 1000585984574,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FpNhpBonTWLPHkOxMsSHx",
        "apple": "https://podcasts.apple.com/podcast/brother-from-another/id1597681412?i=1000585984574"
      }
    },
    {
      "id": "4a30a026-45c8-4200-9bd6-2b7ce7eac39c",
      "title": "Regardless of Time",
      "description": "As we recap the previous set of episodes, Elena tells us about her experience as a member of the teen ministry.  She explains  some of the positive and negative moments of that time in her life.  She then asks Aldo on what his experience on doing this podcast has been like for the past 12 months.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-11-09T00:00:00",
      "duration": "00:24:20.8710000",
      "explicit": false,
      "spotifyId": "5UoRnsTBAN5VTRIgduWxdT",
      "appleId": 1000585585738,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5UoRnsTBAN5VTRIgduWxdT",
        "apple": "https://podcasts.apple.com/podcast/regardless-of-time/id1597681412?i=1000585585738"
      }
    },
    {
      "id": "db9bd76c-6ea2-4a61-b578-c04e56a25ac2",
      "title": "\u0022Just A Number\u0022",
      "description": "Jenn from LA rejoins us.  This time, she joins us with her daughter, Amanda.  Amanda, at the time of this recording is, 18 years old.  Amanda wanted to join us because she wanted to discuss the teen ministry experience.  Amanda, was never baptized into the church, but she was a part of teen ministry nonetheless, as she attended all of the meetings, etc.  Amanda was asked if there was a pressure placed upon her to get baptized, and she gives us her take on that.  Amanda talks to us about exclusion and relationships.  Jenn, speaking as the parent, indicated that the relationship that the church had with her children was a tipping point for her and her family.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-11-06T00:00:00",
      "duration": "00:37:27.8880000",
      "explicit": false,
      "spotifyId": "4SDFIVrkv0C8bct5Hxi7a2",
      "appleId": 1000585202478,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SDFIVrkv0C8bct5Hxi7a2",
        "apple": "https://podcasts.apple.com/podcast/just-a-number/id1597681412?i=1000585202478"
      }
    },
    {
      "id": "bd363742-0069-4945-95da-8f71496a33bd",
      "title": "\u0022It Wasn\u0027t Well Received\u0022",
      "description": "*Trigger Warning*  Some of the content of this episode might be disturbing to some listeners.  Listener descretion is advisedCarter tells us more about his experience with the church.  Carter explains, in graphic detail, some of the things that he was taught.  It should be noted that what Carter was taught, was not common practices through out the ICOC.  However, the liberty that those who lead him took in creating such graphic teachings, may speak to the nature of the organization as a whole.  In other words, if the teachings ensured that Carter would remain a faithful member, then, his leaders might argue that the ends justifies the means.  Carter’s story, like all of the other stories, is the story of an individual and it may or may not resonate with the experiences of others.  Carter states that he does not think that he has recovered from his experience with the organization.  He tells us more about his experience with the teen ministry.   He also talks about having complex PTSD.   Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-11-02T00:00:00",
      "duration": "00:27:50.0600000",
      "explicit": true,
      "spotifyId": "6rU0eCg6ms8fEyxHUGY2n3",
      "appleId": 1000584734297,
      "subjects": [
        "International Churches Of Christ",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6rU0eCg6ms8fEyxHUGY2n3",
        "apple": "https://podcasts.apple.com/podcast/it-wasnt-well-received/id1597681412?i=1000584734297"
      }
    },
    {
      "id": "85c0a469-14e0-4da8-bfbb-7a852db32f5e",
      "title": "\u0022A Culture of Works, and Not Grace\u0022",
      "description": "Today we meet Carter.  Carter referes to himself as a kingdom kid.  I explains what this term means to him and how it was applied within the ICOC.  Carter got baptized as a teenager and became a part of the teen ministry.  He reflects on his time with the church and recounts the pressure that he felt.  Carter describes himself as introverted and how this characteristic was not welcomed in the part of the organization that he congregated with.  Carter speaks to us about what the discipling partner relationship looked like between a teenager and an adult.     Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-30T00:00:00",
      "duration": "00:24:04.5190000",
      "explicit": false,
      "spotifyId": "5qXZjHOMPlcIimvDmML7VT",
      "appleId": 1000584367129,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qXZjHOMPlcIimvDmML7VT",
        "apple": "https://podcasts.apple.com/podcast/a-culture-of-works-and-not-grace/id1597681412?i=1000584367129"
      }
    },
    {
      "id": "72436cd6-a5e7-4f06-8322-4922c8f1f726",
      "title": "\u0022Legalistic\u0022",
      "description": "In our second and final segment of our interview with Nick, he begins to tell us about some of the red flags that he\u0027s noticed from time to time.  Nick describes himself as a totally committed member.  Despite his history of commitment, grace was not afforded to him when he decided act in his own best interest.  Nick recounts instances where the culture of imitation presented itself.  He also tells us about his process of finally leaving the organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-26T00:00:00",
      "duration": "00:26:01.9390000",
      "explicit": false,
      "spotifyId": "4vgt2Nca25OlZwiMylOmZ8",
      "appleId": 1000583910333,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vgt2Nca25OlZwiMylOmZ8",
        "apple": "https://podcasts.apple.com/podcast/legalistic/id1597681412?i=1000583910333"
      }
    },
    {
      "id": "780dd1fe-94ae-4d52-bad2-af4ac7f0ea49",
      "title": "\u0022It Was Work\u0022",
      "description": "Today we speak with Nick.  Nick joined the organization in 1995 and left around 2020.  During his time with the church he was a teen worker and eventually became a member of the full time ministry.  Being a teen worker with the ICOC, was an exhaustive task.  As a teen worker, one must dedicate the majority of their time and energy to help guide and support the teenage members of the organization.  He also talks to us about his training and expectations as a full time member of the staff.  Nick\u0027s experience with the church was filled with a variety of moving parts, much like the experience of many members of the organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-23T00:00:00",
      "duration": "00:23:23.6110000",
      "explicit": false,
      "spotifyId": "7jdQBSllQqzle4pIVer9VB",
      "appleId": 1000583562321,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jdQBSllQqzle4pIVer9VB",
        "apple": "https://podcasts.apple.com/podcast/it-was-work/id1597681412?i=1000583562321"
      }
    },
    {
      "id": "37d01a49-83e3-44c1-9f6e-6174d04cb6c0",
      "title": "Sue Condon\u0027s Diary (pt II)",
      "description": "Christina and Aldo continue their discussion around Sue Condon\u0027s Diary.  Christina shares how her views on the church have changed from the beginning of appearing on the podcast, up until now.  Although the document was written many years ago, and from the perspective of one person, some of its\u0027 elements apply and seem to give validity to the experiences of many other former members.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-19T00:00:00",
      "duration": "00:23:08.0680000",
      "explicit": false,
      "spotifyId": "6bGIeqNRvhNskJS3s6x8Qo",
      "appleId": 1000583107102,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6bGIeqNRvhNskJS3s6x8Qo",
        "apple": "https://podcasts.apple.com/podcast/sue-condons-diary-pt-ii/id1597681412?i=1000583107102"
      }
    },
    {
      "id": "4ddf6f3c-0a6e-4385-a1e5-386a475d9256",
      "title": "Sue Condon\u0027s Diary (pt 1)",
      "description": "Christina and Aldo sit down and discuss  Sue Condon\u0027s Diary: The Emperor\u0027s New Clothes.    This document, amongst others, pertains to the Boston Movement, also known as The International Church of Christ.  Mrs. Condon writes this document through the eyes and experience of one who was a leader within the organization.  Mrs. Codon writes about the effect that the organization had on her and her family.  Aldo and Christina discuss this document as well as a few minor details pertaining to UNO and pop trivia.   Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-16T00:00:00",
      "duration": "00:20:46.5370000",
      "explicit": false,
      "spotifyId": "0GvKZAgbmERbFojXxcgAtd",
      "appleId": 1000582774005,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0GvKZAgbmERbFojXxcgAtd",
        "apple": "https://podcasts.apple.com/podcast/sue-condons-diary-pt-1/id1597681412?i=1000582774005"
      }
    },
    {
      "id": "f0ab2838-ccd2-4fa4-bf1f-5ef242b7ccaa",
      "title": "\u0022Professional Church Builders\u0022",
      "description": "This is our second and final segment of our conversation with Sherri.   She talks to us about the culture of dating within the organization.  She talks about expectations and restrictions that were placed on people.  Sherri mentions that these restrictions were placed on people in the name of being pure and maintaining purity.  Sherri talks about the notion of church members having to have certain elements of their lives approved by leaders in the organization.  Sherri and her husband were able to create a great life for themselves despite some of these restrictions.  However, Sherri recognizes that this was not the case for some people.  Sherri also shares her thoughts on where things might have gone awry.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-12T00:00:00",
      "duration": "00:20:25.6130000",
      "explicit": false,
      "spotifyId": "4FSwfl7jwiYHlYgt9yuwzw",
      "appleId": 1000582362309,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4FSwfl7jwiYHlYgt9yuwzw",
        "apple": "https://podcasts.apple.com/podcast/professional-church-builders/id1597681412?i=1000582362309"
      }
    },
    {
      "id": "e1724c80-9ef3-4848-a3d5-f9094d3a145b",
      "title": "\u0022They Were Very Impressive\u0022",
      "description": "In discussing what we\u0027ve discussed for the past one hundred or so episodes, sometimes we have to remember why people get involved with certain organizations.  Today we meet Sherri.  Sherri joined the Boston Movement in 1980 as a college freshman.  Sherri tells us about her life before joining the church and how things were after joining the church.  Sherri was intrigued by how the Bible was taught to her in a practical manner.  In addition to enjoying what she learned, she was also impressed by the people that taught her and taught those around her.   Eventually Sherri left the organization in 2003.  She tells us about her experience in her 23 years as a member.  A small segment of this episode, slightly touches on the subject of suicide.  If you or anyone you know require support in that area, please visit: https://988lifeline.org/?utm_source=google\u0026utm_medium=web\u0026utm_campaign=oneboxSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-09T00:00:00",
      "duration": "00:23:21.5470000",
      "explicit": false,
      "spotifyId": "6Lp8uaWWF2htN5qdmsklEZ",
      "appleId": 1000582029907,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Lp8uaWWF2htN5qdmsklEZ",
        "apple": "https://podcasts.apple.com/podcast/they-were-very-impressive/id1597681412?i=1000582029907"
      }
    },
    {
      "id": "125e97ed-5edd-41ed-ba5b-daa8e6012c61",
      "title": "Episode 100",
      "description": "In this episode, Elena from 3B shares her thoughts on our conversations with Mr. Norton, Gene Vinzant, James Lloyd, and El.   Aldo might even say a word or two...Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-07T00:00:00",
      "duration": "00:28:42.9580000",
      "explicit": false,
      "spotifyId": "305uUOMdKloBj03uJacKdr",
      "appleId": 1000581861603,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/305uUOMdKloBj03uJacKdr",
        "apple": "https://podcasts.apple.com/podcast/episode-100/id1597681412?i=1000581861603"
      }
    },
    {
      "id": "bab894a1-5af5-403a-9acc-b0a1a92e86f0",
      "title": "The Culture of Purity",
      "description": "In the second and final installment of our conversation with El, she tells us about an event and the impact that the event had on her life.  She also discusses how the event impacted her relationship with the church going forward.  El had demonstrated a lot of courage and bravery in coming forward with her story.  TRIGGER WARNING: The following episode contains conversations revolving around sexual assault and suicidal ideations.   If you or anyone you know need support regarding sexual assault, support can be found at https://www.rainn.org/resources.  Furthermore, contact https://988lifeline.org if you or anyone that you know are in need of support regarding suicidal thoughts and ideations.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-05T00:00:00",
      "duration": "00:39:12.5350000",
      "explicit": true,
      "spotifyId": "663pmfX5NRpk4mfETvrs2J",
      "appleId": 1000581627724,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/663pmfX5NRpk4mfETvrs2J",
        "apple": "https://podcasts.apple.com/podcast/the-culture-of-purity/id1597681412?i=1000581627724"
      }
    },
    {
      "id": "f2da2fac-6c4b-4928-8d95-62b6c81f9f99",
      "title": "\u0022Do Everything Possible To Make You Change\u0022",
      "description": "Today we meet El.  El was what we would call a Kingdom Kid.  Her parents were disciples in the ICOC.  She never became a baptized member of the church, but she grew up in the organization as her parents enrolled her in the youth ministry.  For a variety of reasons, El states that she believed that she never really fit in with the church.  Upon turning 18, she made the decision to not return to the church.   El begins to share with us an event that had a profound impact on her life going forward.  Some of the content in this episode mentions the act of self harming.  If you or someone you know needs support in that area, then please use the following link to find support:  https://www.crisistextline.org/topics/self-harm/#what-is-self-harm-1Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-10-02T00:00:00",
      "duration": "00:31:54.0170000",
      "explicit": false,
      "spotifyId": "1qzXTwOmIjvsIjWssUjpU2",
      "appleId": 1000581271872,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1qzXTwOmIjvsIjWssUjpU2",
        "apple": "https://podcasts.apple.com/podcast/do-everything-possible-to-make-you-change/id1597681412?i=1000581271872"
      }
    },
    {
      "id": "91098edc-d6e0-4303-891b-b60f6b701d6f",
      "title": "\u0022Because It Would Limit How I Could Serve\u0022",
      "description": "We continue our conversation with James Lloyd.  He talks to us about the legacy of the Crossroads Movement and the impact that it had on the Boston Movement (which would eventually become the International Church of Christ).  James begins to tell us about eventually leaving the organization and what his thoughts are on what he was a part of.  James talks to us about perspective, the value of honesty, self forgiveness, and learning from others.    Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-09-28T00:00:00",
      "duration": "00:32:38.8700000",
      "explicit": false,
      "spotifyId": "7D7mNYOuafLsMR2SZPDHuz",
      "appleId": 1000580869774,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7D7mNYOuafLsMR2SZPDHuz",
        "apple": "https://podcasts.apple.com/podcast/because-it-would-limit-how-i-could-serve/id1597681412?i=1000580869774"
      }
    },
    {
      "id": "38835271-c2e7-4113-978c-ed06a06ef40c",
      "title": "\u0022One of the 30\u0027\u0022",
      "description": "Today we meet James Lloyd.  James was an evangelist with the International Church of Christ.  James is also one of the famed \u002230 would be disciples\u0022 that began the ICOC in Lexington, MA in 1979.   James got baptized into the traditional Church of Christ and then joined the Boston Movement.   James eventually went on to be on the mission team that planted the church in London in 1982.  James sits down with us today and recounts his early years with  the Boston Movement and what it was like at that time.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-09-25T00:00:00",
      "duration": "00:24:48.8480000",
      "explicit": false,
      "spotifyId": "5gfakmsikks16WqlAjEVfT",
      "appleId": 1000580539176,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5gfakmsikks16WqlAjEVfT",
        "apple": "https://podcasts.apple.com/podcast/one-of-the-30/id1597681412?i=1000580539176"
      }
    },
    {
      "id": "dc1eaea0-a6b5-4480-b395-8d8baea92d2e",
      "title": "\u0022Just Do As We Say\u0022",
      "description": "This is our second and final segment with Gene Vinzant, one of the authors/contributors to \u0022The Discipling Dilemma.\u0022   Gene tells us how the Boston Movement reacted to Dr. Yeakleys\u0027 study.  One of the most telling statements regarding the impact of the Boston Movement is when the book is quoted as saying  \u0022in the years since this book was written, counselors in virtually every city, where this radical movement exists, are now being flooded with clients who are psychological,  emotional, and spiritual victims of this authoritarian movement.\u0022  Although Dr. Yeakley did not want to use the word \u0022cult\u0022 to describe the book, it seems that his research lead him to such a conclusion.  Gene even finds a copy of Dr. Yeakleys\u0027 own copy of the book, which was full of \u0022notes\u0022 and provides some more insigh into to how this book was received at the time of its publishing.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-09-21T00:00:00",
      "duration": "00:24:36.1270000",
      "explicit": false,
      "spotifyId": "7znV2zPVEeYKJ3cq4SKnF5",
      "appleId": 1000580140820,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7znV2zPVEeYKJ3cq4SKnF5",
        "apple": "https://podcasts.apple.com/podcast/just-do-as-we-say/id1597681412?i=1000580140820"
      }
    },
    {
      "id": "4b221d4a-133f-4250-ba65-d5138326da29",
      "title": "\u0022ESFJ\u0022",
      "description": "Today we speak with Gene Vinzant.  Gene is one of the contributors to \u0022The Discipling Dilemma.\u0022  Gene was a research assistant at the time that the book was written and published.   In this episode, he helps us to decipher some of the meanings behind the results of the personality study that was conducted with the ICOC in the mid 1980s.  He also explains to us what the term \u0022ESFJ\u0022 means as it pertains to the Boston Movement at that time.    Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-09-18T00:00:00",
      "duration": "00:23:40.4340000",
      "explicit": false,
      "spotifyId": "0TRBltTJVjFdRnqs4kL40h",
      "appleId": 1000579807319,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0TRBltTJVjFdRnqs4kL40h",
        "apple": "https://podcasts.apple.com/podcast/esfj/id1597681412?i=1000579807319"
      }
    },
    {
      "id": "8c6ddcb4-7b27-4906-b4ee-adfc21f50f98",
      "title": "\u0022Everybody is in Charge of Somebody Else; Nobody is in Charge of Himself\u0022",
      "description": "In the second and final installment of our conversation with Mr. Norton, he tells us why he thought the Boston Movement\u0027s autocratic and authoritarian approach was harmful.   Mr. Norton recalls his interactions with members of the Boston Movement and how those interactions gave him glimpses into how the Boston Movement operated in the lives of its members.   \u0022The Discipling Dilemma\u0022 was published in 1988.   This book is a serious, documented study that analyzes the discipling movement objectively, pointing out both strengths and weaknesses for careful consideration by leaders and members of other churches of Christ. https://www.amazon.com/Discipling-Dilemma-Movement-Churches-Christ/dp/0892253118Join our Facebook Group to be a part of the conversation https://www.facebook.com/groups/405397444821662/Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-09-14T00:00:00",
      "duration": "00:25:44.7510000",
      "explicit": false,
      "spotifyId": "1mzg4DI129vFAx0b5wy5Gt",
      "appleId": 1000579410807,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1mzg4DI129vFAx0b5wy5Gt",
        "apple": "https://podcasts.apple.com/podcast/everybody-is-in-charge-of-somebody-else-nobody-is-in/id1597681412?i=1000579410807"
      }
    },
    {
      "id": "e382b5e2-2752-4a5d-9eb9-c2f2b37b5339",
      "title": "\u0022Absolute Submission\u0022",
      "description": "Today we are joined by Mr. Howard W. Norton.  Mr. Norton is one of the authors of \u0022The Discipling Dilemma.\u0022  Mr. Norton worked closely with Dr. Flavil Yeakley, Don Vinzant, and Gene Vinzant to put this project together.  Although Mr. Norton has never been a member of the ICOC, he has been a member of the traditional Church of Christ for about 70 years.    He sits down with us and offers us some insight to the creation of the book.  \u0022The Discipling Dilemma\u0022 was published in 1988.   This book is a serious, documented study that analyzes the discipling movement objectively, pointing out both strengths and weaknesses for careful consideration by leaders and members of other churches of Christ. https://www.amazon.com/Discipling-Dilemma-Movement-Churches-Christ/dp/0892253118Join our Facebook group: https://www.facebook.com/groups/405397444821662/Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-09-11T00:00:00",
      "duration": "00:19:57.4260000",
      "explicit": false,
      "spotifyId": "3n332x1TY4qVpKtFQNgirE",
      "appleId": 1000579070355,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3n332x1TY4qVpKtFQNgirE",
        "apple": "https://podcasts.apple.com/podcast/absolute-submission/id1597681412?i=1000579070355"
      }
    },
    {
      "id": "49b07496-35a6-46b8-afd1-d3fd7b986daf",
      "title": "\u0022Spirituality vs. Personality\u0022",
      "description": "Christina from season 1 joins us as one our co-hosts this season.  Our discussion begins with a comparison between two words: spirituality and personality.  Was the church led by an ethos that was based off of spirituality or personality?  Was one\u0027s good standing with the church based off of spirituality or personality?  Was the status of one\u0027s relationship with God based off of spirituality or personality?  Join Aldo and Christina as they discuss these concepts, persecution,  yellow pants,  and more.  Join our Facebook group: https://www.facebook.com/groups/405397444821662/Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-09-07T00:00:00",
      "duration": "00:32:23.6400000",
      "explicit": false,
      "spotifyId": "5ygAlRrOtMF96O9XZQGjzJ",
      "appleId": 1000578654269,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ygAlRrOtMF96O9XZQGjzJ",
        "apple": "https://podcasts.apple.com/podcast/spirituality-vs-personality/id1597681412?i=1000578654269"
      }
    },
    {
      "id": "9182924e-ef55-489f-ae49-519724daf43e",
      "title": "\u0022There\u0027s More Besides\u0022",
      "description": "Season 1 began with a story.  Season 2 began with \u0022the letter\u0022.  Season 3 begins with \u0022the book.\u0022   The book is called \u0022The Discipling Dilemma\u0022 by Dr. Flavil Yeakley, Jr. and it is about the Boston Movement, which would eventually become the International Church of Christ.  The book puts into question the practices of the church from its beginnings.  People join religious groups all of the time; this isn\u0027t a new concept.  Some religious organizations are branded with the term \u0022cult\u0022 on a frequent basis, thus leading to discussions, disagreements, and arguments about what is a cult and what isn\u0027t.  However, what if a religious organization calls for you to change what you are?  What if a religious organization leads one to conclude that their authentic self isn\u0027t good enough?  Aldo and Elena discuss these concepts, the book, and more in the season 3 opener.Join our Facebook group: https://www.facebook.com/groups/405397444821662/Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-09-04T00:00:00",
      "duration": "00:28:36.4650000",
      "explicit": false,
      "spotifyId": "0hIq6QMLA2bqcYlAFZ4p7j",
      "appleId": 1000578288232,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hIq6QMLA2bqcYlAFZ4p7j",
        "apple": "https://podcasts.apple.com/podcast/theres-more-besides/id1597681412?i=1000578288232"
      }
    },
    {
      "id": "bad29ef8-dc55-4446-b64e-6e13b61248c7",
      "title": "Season 3 Trailer",
      "description": "Season 3 premiers on September 4, 2022Support: https://www.buymeacoffee.com/aldobmartinSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-08-18T00:00:00",
      "duration": "00:04:05.2630000",
      "explicit": false,
      "spotifyId": "5zqBrYlGjr2HcmNWEvdIel",
      "appleId": 1000576447467,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5zqBrYlGjr2HcmNWEvdIel",
        "apple": "https://podcasts.apple.com/podcast/season-3-trailer/id1597681412?i=1000576447467"
      }
    },
    {
      "id": "4a59c39a-9ffe-487a-8122-c1de56e87adf",
      "title": "What More Can I Say?",
      "description": "Thank you for listening.  We hope that you\u0027ve enjoyed the program.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-08-05T00:00:00",
      "duration": "00:26:24.5610000",
      "explicit": false,
      "spotifyId": "3eQ0LzRbtbinDYu33EtHrd",
      "appleId": 1000575085984,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3eQ0LzRbtbinDYu33EtHrd",
        "apple": "https://podcasts.apple.com/podcast/what-more-can-i-say/id1597681412?i=1000575085984"
      }
    },
    {
      "id": "9b866817-730e-4441-a52b-ea2879ffb2a3",
      "title": "The Beginning of the End",
      "description": "The process of leaving the church was not a simple one for Aldo.  Everything in Aldo\u0027s world began to change.  He was in a new school.  He was in a new part of the church.  He interacted with people who were not who they professed to be.  He interacted with people that he had misjudged thus causing him to question his beliefs even more.  The emergence of the letter and its subsequent effects on the church, would also have an effect on Aldo.  As the church changed, it caused Aldo to question why he was still a part of the church.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-08-03T00:00:00",
      "duration": "00:25:04.2350000",
      "explicit": false,
      "spotifyId": "6dusvPMTQtAuHYcVxgM2ZV",
      "appleId": 1000574844453,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6dusvPMTQtAuHYcVxgM2ZV",
        "apple": "https://podcasts.apple.com/podcast/the-beginning-of-the-end/id1597681412?i=1000574844453"
      }
    },
    {
      "id": "bffafa8b-f46b-4258-9107-df52b00dbaaf",
      "title": "Season 2 Recap with Elena from 3B",
      "description": "As we begin to wrap-up season 2, Elena joins us for her final recap of the season.  She shares her thoughts on Robin from Oklahoma, Chris from Los Angeles, Del from New York, and Jenn from Los Angeles. Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-31T00:00:00",
      "duration": "00:35:08.8130000",
      "explicit": false,
      "spotifyId": "7KVFp5guMAe0MR4ChS6n41",
      "appleId": 1000574452071,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KVFp5guMAe0MR4ChS6n41",
        "apple": "https://podcasts.apple.com/podcast/season-2-recap-with-elena-from-3b/id1597681412?i=1000574452071"
      }
    },
    {
      "id": "9f6ad15b-73d9-4268-b542-10f253e1feb0",
      "title": "Intuition - Conversation with Jenn from Los Angeles (pt III)",
      "description": "Jenn embarks on a new chapter in her life.  She remarried.  However, before getting married she was met with much opposition from the church.  The church did not view Jenn’s eventual husband as a christian because he belonged to a different church.  The church taught Jenn that her late husband was not a christian because he was not a member of the ICOC.  The church taught her that the only way for her children to become christians was through the ICOC’s system of teachings.  She was taught that her eventual husband is not in line with God because he was not a member of the ICOC.  After years of following the church’s self created rules and regulations, Jenn began to speak up for her late husband, her children, her new husband, and for herself.    To learn more about Jenn and her story,  check out https://linktr.ee/jjoslerboltonSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-29T00:00:00",
      "duration": "00:27:42.1710000",
      "explicit": false,
      "spotifyId": "3daYJRALxfkKUP0wBPFXMF",
      "appleId": 1000571527177,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3daYJRALxfkKUP0wBPFXMF",
        "apple": "https://podcasts.apple.com/podcast/intuition-conversation-with-jenn-from-los-angeles-pt-iii/id1597681412?i=1000571527177"
      }
    },
    {
      "id": "ae51d6dd-7acb-47eb-8a5e-054360ec001a",
      "title": "I Found My Voice - Conversation with Jenn from Los Angeles (pt II)",
      "description": "Jenn begins the second part of our conversation by telling us of a tragedy that befell her family.  The church rallied around Jenn and her family as they helped her to cope with what happened.  However, the tragedy also sparked a new found courage in Jenn that caused her to view the church in another light.  Jenn began to view the church and God as two separate entities.  She no longer saw an allegiance to the church as being the same as having a relationship with God.  She became confident and vocal about her new found beliefs.  However, it was at this stage that her relationship with some members of the church began to change.  To learn more about Jenn and her story,  visit her at  https://linktr.ee/jjoslerboltonSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-27T00:00:00",
      "duration": "00:28:28.2250000",
      "explicit": false,
      "spotifyId": "2IqtyRbWSDai6UAlg4g3se",
      "appleId": 1000571294209,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2IqtyRbWSDai6UAlg4g3se",
        "apple": "https://podcasts.apple.com/podcast/i-found-my-voice-conversation-with-jenn-from-los/id1597681412?i=1000571294209"
      }
    },
    {
      "id": "81a82ff2-5720-43e4-a2bf-35b2dcb9ff19",
      "title": "I Fell In Love With All Of It - Conversation with Jenn from Los Angeles (pt I)",
      "description": "In what is now episode 53 of season 2, we meet Jenn from the greater Los Angeles area.  Jenn became a member in 2001 in her early twenties.  Unlike the rest of our guests, she joined the organization with her husband - who happened to baptize her.  Jenn’s story is complicated as her life has gone through a variety of ups and downs; tragedies and happy occasions.  In the first part of our conversation, Jenn reflects on the factors that lead up to her joining the church.  She tells us about her frame of mind as a new member.  Like the rest of us, Jenn was enamored with this new community that she had just become a part of.  Despite this new found happiness and sense of belonging, Jenn’s husband, left the organization a few months after being baptized.  Jenn, however remained a member of the church.  This dynamic tugged and pulled at different elements of of Jenn’s life.  Join us as she shares her story.  To learn more about Jenn and her story,  visit her at  https://linktr.ee/jjoslerboltonSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-24T00:00:00",
      "duration": "00:21:53.7500000",
      "explicit": false,
      "spotifyId": "73bBsMQR83QeNG7DlYC723",
      "appleId": 1000570968274,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/73bBsMQR83QeNG7DlYC723",
        "apple": "https://podcasts.apple.com/podcast/i-fell-in-love-with-all-of-it-conversation-with-jenn/id1597681412?i=1000570968274"
      }
    },
    {
      "id": "908537ad-407b-4fa7-9482-0ba098989a39",
      "title": "A Place In The Sun - Conversation with Del from New York (pt III)",
      "description": "As Del concludes his story, he continues to tell us about the process of leaving.  Del began to place his eggs in other baskets to help himself prepare his exit.  Del tells us about  having a conversation with church leadership and other church members about his leaving.  He made his break a formal one as he informed those around him whereas many people just leave.  However, upon informing the leadership they took it upon themselves to announce that Del was kicked out of the church, which was a false narrative.   Our conversation also includes the matter of mental health.  Del discusses how he managed his mental health when he was in the church.  Del reveals to us that he has struggled with suicidal ideations since his childhood, including his time with the church.  He recognized that the church was not equipped to help him, so he kept these thoughts to himself.  However, the church insisted that its methods of governing people were equal to or better than professional methods of coping with mental health.  This mixture of arrogance and ignorance on the part of the ICOC is one of the reasons that thousands of people around world have rejected this organization.  He reflects on his time in the church and recognizes the positive elements of it.  He also recognizes the church as a cult.  If you or anyone you know is contimplating suicide, understand that help is avalable.  Contact the National Suicide Prevention Lifeline at 1-800-273-8255 or use the following link:https://suicidepreventionlifeline.orgSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-22T00:00:00",
      "duration": "00:27:49.8250000",
      "explicit": false,
      "spotifyId": "0yiwvo5AyXSdg0NUu7w8q1",
      "appleId": 1000570766757,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0yiwvo5AyXSdg0NUu7w8q1",
        "apple": "https://podcasts.apple.com/podcast/a-place-in-the-sun-conversation-with-del-from-new-york-pt-iii/id1597681412?i=1000570766757"
      }
    },
    {
      "id": "d1993765-9697-455d-aaa2-f5ce1d2306f1",
      "title": "The Hot Seat - Conversation with Del from New York (pt II)",
      "description": "Del from NY talks to us about the early days of his conversion as a high school student.  Del describes himself as a loner at his core.  However, because the church was all encompassing, or high committment as it has been called, being a loner was not regarded favorably in the ICOC.  Del believed that his being a disciple was his mission and his calling.  He begins to talk about the red flags that he noticed.  Like many of us, he noticed the red flags, but did not act on them right away.  Del talks about the corporate structure of the church and he understood where he was in that heirarchy.  Nonetheless, Del was willing to do what was necessary to climb up this latter that the church established.  Del talks to us about the concept of the “hot seat” where a group of people would gather around you to “fix” your thinking.  Learning about such practices made Del want to conceal some of his true opinions on church practices.  Del begins to tell us about the process of his leaving the church as it is more complicated than just deciding to leave one day.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-20T00:00:00",
      "duration": "00:26:28.4010000",
      "explicit": false,
      "spotifyId": "0M14eQ5Og1dmjxip6YXYWT",
      "appleId": 1000570542882,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0M14eQ5Og1dmjxip6YXYWT",
        "apple": "https://podcasts.apple.com/podcast/the-hot-seat-conversation-with-del-from-new-york-pt-ii/id1597681412?i=1000570542882"
      }
    },
    {
      "id": "18e3a98c-1bc5-470e-8c09-0fbba776f189",
      "title": "An Existential Crisis - Conversation with Del from New York (pt I)",
      "description": "Del from NY rejoins us.  We met him in week 1 of season 2 when he recounted his recollection of the events surrounding the letter in 2003.  Today, Del speaks with  us about being an advocate for mental health as it pertains to men.  He talks about volunteering for a  non-profit organization that is geared towards creating awareness and providing resources regarding mental health.   Del tells us about living with depression and anxiety and how he takes the necessary measures to ensure that he is living a life that is mentally and physically healthyDel joined the ICOC as a high school student.  He describes himself as being a degenerate at one point in his adolescence.  However, at some point Del decided to change his life.  He began reading the bible on his own and wanted to implement what he was reading and learning.  It was during this self imposed transition in his life that someone invited him to attend the ICOC.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-17T00:00:00",
      "duration": "00:27:27.4380000",
      "explicit": false,
      "spotifyId": "3Tz2bgRALol1BGYWDOWXUk",
      "appleId": 1000570162619,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Tz2bgRALol1BGYWDOWXUk",
        "apple": "https://podcasts.apple.com/podcast/an-existential-crisis-conversation-with-del-from-new/id1597681412?i=1000570162619"
      }
    },
    {
      "id": "67d31cf9-56cc-4383-9b13-1b5b014126a2",
      "title": "Understand A New Identity - Conversation with Chris from Los Angeles (pt III)",
      "description": "In the final installment of our conversation, Chris talks about how it was unfair for the regular members of the church to struggle financially while leaders in the church lived in posh neighborhoods off of the backs of the membership.  Oddly enough, Chris talks about how being in the ministry had taken away his confidence.  One would not think that to be the case, but Chris explains to us how that happened.  Despite this, Chris talks about some of the positives that he learned while in the full time ministry.  Chris talks about getting married in the church.  Chris talks about having to work through his marraige.  He mentions that he had to work to keep the church out of his marraige in order for it to work.  Chris describes the tail end of his time with the church.  He talks about communicating with the leadership about his concerns with the church.  However, the ledership felt justified in their methods because the church was growing in number and therefore dismissed his concerns.  After spending over a decade with the organization, Chris finally made the decision to leave.  He explains to us how that came about.  When asked if he thinks the ICOC is a cult, Chris says “it’s absolutely a cult.” Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-15T00:00:00",
      "duration": "00:30:34.0310000",
      "explicit": false,
      "spotifyId": "1Ocx9LZfb2EFAmk5BLw8vy",
      "appleId": 1000569975228,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Ocx9LZfb2EFAmk5BLw8vy",
        "apple": "https://podcasts.apple.com/podcast/understand-a-new-identity-conversation-with-chris/id1597681412?i=1000569975228"
      }
    },
    {
      "id": "ecf31150-fa89-4c4d-998a-da47c5714a56",
      "title": "El Segundo - Conversation with Chris from Los Angeles (pt II)",
      "description": "Chris and his wife became in charge of the children’s ministry in Los Angeles.   He was also a part of the church’s legal team.  He was also a teen ministry, singles ministry, and married ministry leader.  Chris talks to us about the red flags that he noticed while he was a leader in the church.  He began to realize how the church resembled corporate America in how it was run on the inside.  Although he stayed on for many years, these red flags presented themselves slowly over time.  When asked why Chris stayed, he talks about the notion of fear.  Although the membership at large was manged by fear, through Chris’ testimony, it seems that the leaders of the church were governed in the same way.  Chris describes the leadership of the church as being harsh and authorative and how this type of environment trickled down hill.  Chris talks about how his personal style of leadership was also harsh.  Chris talks about how there was an unfair workload imposed on the everyday members while he and other leaders lived in well-to-do areas.  Chris talks to us about the how people in leadership would request to live in posh neighborhoods at the monetary expense of the church and the general membership.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-13T00:00:00",
      "duration": "00:29:38.1810000",
      "explicit": false,
      "spotifyId": "7c8QO8RqEnBzBjDMjXlbhp",
      "appleId": 1000569738052,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7c8QO8RqEnBzBjDMjXlbhp",
        "apple": "https://podcasts.apple.com/podcast/el-segundo-conversation-with-chris-from-los-angeles-pt-ii/id1597681412?i=1000569738052"
      }
    },
    {
      "id": "a65d6bc8-9b38-4be1-bf4d-07d343fc9792",
      "title": "The Full Time Ministry - Conversation with Chris from Los Angeles (pt I)",
      "description": "Today we meet Chris.  He is a former member of the ICOC.  He was baptized in 1991 and was raised up to be in the ministry almost right away.  Chris has spent time as lawyer for the church, and as a youth ministry leader.  Chris was converted in Los Angeles as a third year law student.  Chris describes himself as being in a desperate point in his life before becoming involved with the organization.  Chris became enamored and impressed with the diversity and purpose that the ICOC provided.  Chris states that he “turned his brain off” as he became indoctrinated with the group.  Chris describes himself as being one hundred percent committed to the church.  Chris was baptized in October and was in the full time ministry 7 months later.  It\u0027s been years since Chris left the group, and like many of us, he has recently begun the journey of reclaiming his story.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-10T00:00:00",
      "duration": "00:28:41.3910000",
      "explicit": false,
      "spotifyId": "6RQob6qX1nn8asqRX8DcXi",
      "appleId": 1000569398651,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RQob6qX1nn8asqRX8DcXi",
        "apple": "https://podcasts.apple.com/podcast/the-full-time-ministry-conversation-with-chris-from/id1597681412?i=1000569398651"
      }
    },
    {
      "id": "ba6dd232-a8c9-4941-b10e-f494059983c2",
      "title": "Spiritual Independence - Conversation with Robin from Oklahoma (pt III)",
      "description": "Robin talks to us about the idea of \u0022spiritual independence.\u0022  Robin has allowed her self to be open to the possibility that \u0022teachers\u0027 can exist outside of the religious structure that she was accustomed to.   Robin and Aldo discuss how they both entered into controlling organizations through different vantage points.  Robin takes on an academic approach to her religious practice and thought process.  Robin talks about the concept of fear and how it can limit someone\u0027s ability to develop another level of understanding when it comes to spirituality or religious practice.  In short, Robin discusses how religious practice can take place beyond the limits of what we might be accustomed to.  To learn more about Robin and the work that she does, you can visit her website at https://theincarceratedchristian.com or you can follow her on social media using the following linksThe Incarcerated Christian podcastTwitterSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-08T00:00:00",
      "duration": "00:21:44.8420000",
      "explicit": false,
      "spotifyId": "28gJeMkDE1nI0xgk0IKyxJ",
      "appleId": 1000569221729,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28gJeMkDE1nI0xgk0IKyxJ",
        "apple": "https://podcasts.apple.com/podcast/spiritual-independence-conversation-with-robin-from/id1597681412?i=1000569221729"
      }
    },
    {
      "id": "fc29c1fe-9037-47af-8800-863a1d7fe3ea",
      "title": "Keeping Them In Check - Conversation with Robin from Oklahoma (pt II)",
      "description": "Robin discusses the idea of Christians being punished by other Christians and this practice being grounded in fear.  Robin talks about Christians having to keep up appearances in front of other Christians.  Sometimes people use Christianity or religion as a powerful controller of people.  Robin also introduces the idea of power dynamics where your personhood is controlled by a variety of people.  Robin still identifies herself as a Christian, but rejects the constricting brand.  Robin talks about claiming a complex identity as a Christian.  Robin discusses how there are forms of Christianity that reject the LGTBQ community, reject people of color, and reject modern views on gener roles.   To learn more about Robin and the work that she does, you can visit her website at https://theincarceratedchristian.com or you can follow her on social media using the following linksThe Incarcerated Christian podcastTwitterSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-06T00:00:00",
      "duration": "00:22:44.2710000",
      "explicit": false,
      "spotifyId": "32GuzRgkOw2JG4ABLUi44Q",
      "appleId": 1000568959585,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/32GuzRgkOw2JG4ABLUi44Q",
        "apple": "https://podcasts.apple.com/podcast/keeping-them-in-check-conversation-with-robin-from/id1597681412?i=1000568959585"
      }
    },
    {
      "id": "6a2adbc4-6b70-4bcb-9997-244ec9cef2e5",
      "title": "The Incarcerated Christian - Conversation with Robin from Oklahoma (pt I)",
      "description": "Today we meet Robin Mitchelle-Stroud, Phd.  She, along with her co-host Debra Martinelli, host the Incarcerated Christian Podcast.  Robin discusses the concept of carceral christianity.  She is of a southern baptist background.  Although she is not a current or former member of the ICOC, she can relate to some of the hinderance of the ICOC’s brand of christianity.  Robin discusses how one’s negative experience is usually brought about by well meaning people.  She experienced a lot of rules that she was not able to live up to.  It all made her think that she was never good enough as a christian.  Robin has spoken with other christians who have experieced their spirituallity in the same way.  Robin explains that this type of christian practice fosters cycles of spiritual poverty.  To learn more about Robin and the work that she does, you can visit her website at https://theincarceratedchristian.com or you can follow her on social media using the following linksThe Incarcerated Christian podcastTwitterSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-03T00:00:00",
      "duration": "00:22:47.2480000",
      "explicit": false,
      "spotifyId": "79SYpCk5FUNqN9LfENJ3sG",
      "appleId": 1000568608154,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79SYpCk5FUNqN9LfENJ3sG",
        "apple": "https://podcasts.apple.com/podcast/the-incarcerated-christian-conversation-with-robin/id1597681412?i=1000568608154"
      }
    },
    {
      "id": "33477b88-ff85-4ad1-b7c9-f5916f4eceb1",
      "title": "Mid Season (maybe Two-Thirds) Recap with Elena from 3B",
      "description": "We pause the show for a moment to hear Elena\u0027s thoughts on all of this season\u0027s episodes up to this point.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-07-01T00:00:00",
      "duration": "00:37:13.6780000",
      "explicit": false,
      "spotifyId": "4fdk5Oop2HO1QIRiwj8N7a",
      "appleId": 1000568393527,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fdk5Oop2HO1QIRiwj8N7a",
        "apple": "https://podcasts.apple.com/podcast/mid-season-maybe-two-thirds-recap-with-elena-from-3b/id1597681412?i=1000568393527"
      }
    },
    {
      "id": "ec99577b-c20a-46cb-961a-f909b3fb35f3",
      "title": "Shunned - Conversation with Former Jehovah\u0027s Witness, Daniella from Australia (pt III)",
      "description": "Daniellla talks to us about leaving the organization and then being shunned by her family and friends because she was no longer a member.  She speaks about the effect that it’s had on her.  She experienced abuse in her life prior to joining the JW organization and has experienced spiritual abuse while a member.  She states that the JWs are a heartless doomsday cult. Daniella also shares some of her poetry with us.  Below is an exerpt from her poem titled “Shunned.”ShunnedIf the hills had eyesthey\u0027d see people that hate or hear people that call us escapeesapostates because we expose the watchtower\u0027scheapskate awakesso gullible peoplewill dig deep and donate they\u0027ll knock on your door using God as a tool to draw in society\u0027sdowntrodden fools that lack self esteem to use for theirsneaky moneylaundering schemespainting thema perfect picture offuture falsifying dreams…Written by Daniella Djibidjee RochfordRenown Australian Poet, Wordsmith and Lyricist. Sunday February 24th, 2019Copyright. © Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-29T00:00:00",
      "duration": "00:20:08.2410000",
      "explicit": false,
      "spotifyId": "4oVCeSpBrtFbuaToyFGXir",
      "appleId": 1000568069245,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4oVCeSpBrtFbuaToyFGXir",
        "apple": "https://podcasts.apple.com/podcast/shunned-conversation-with-former-jehovahs-witness/id1597681412?i=1000568069245"
      }
    },
    {
      "id": "8c8a684c-10f1-4591-8eb2-ebca322437c5",
      "title": "My Life Is More Important Than My Pain - Conversation with Former Jehovah\u0027s Witness, Daniella from Australia",
      "description": "Daniella discusses how the Jehovah’s Witness organization forbade the members from interacting with outsiders unless it was for the purpose of recruitment.  Daniella takes issue with this stance as she says that the church used this stance to spray psychological abuse on its members.  She discusses how she became introduced with the JW organization at the age of 14.  Daniella describes elements of her upbringing that are rather difficult and the JW organization seemed to offer her and her family some positivity.  She does not consider herself to be a christian, but rather a humanitarian.  Daniella considers the JW’s a cult and came to that conclusion after doing some research on her own.  WARNING:Some of the content in this episode deals with domestic and sexual abuse.If you or someone you know is a victim of  domestic or sexual violence, please know that support is available through  Domestic Violence Support and RAINN - The nation\u0027s largest anti-sexual violence organizationSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-26T00:00:00",
      "duration": "00:18:58.3900000",
      "explicit": false,
      "spotifyId": "0ikGNCS7Jgq8p82vMQiVHl",
      "appleId": 1000567723865,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ikGNCS7Jgq8p82vMQiVHl",
        "apple": "https://podcasts.apple.com/podcast/my-life-is-more-important-than-my-pain-conversation/id1597681412?i=1000567723865"
      }
    },
    {
      "id": "334039d2-0e07-47e2-b922-a795e050df4a",
      "title": "Cognitive Dissonance - Conversation with former Jehovah\u0027s Witness, Daniella from Australia (pt I)",
      "description": "This week we meet Daniella Rochford, who is a renowned Australian poet.  In addition to her background in poetry, Daniella is a former member of the Jehovah\u0027s organization.  There are many people that refer to the Jehovah\u0027s Witness organization as a cult.  Daniella is the first guest on our program who is not affiliated with the ICOC in any form or fashion.  We have her on the program to see if there are any similarities or differences between the two organizations.  Daniella takes us through the basic practices of the organization and talks to us about her experience within the organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-26T00:00:00",
      "duration": "00:17:17.3480000",
      "explicit": false,
      "spotifyId": "1w3DLpwpRE0AEyMjxzygvy",
      "appleId": 1000567722285,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1w3DLpwpRE0AEyMjxzygvy",
        "apple": "https://podcasts.apple.com/podcast/cognitive-dissonance-conversation-with-former-jehovahs/id1597681412?i=1000567722285"
      }
    },
    {
      "id": "037d84ee-bdeb-4379-80ad-16e010118999",
      "title": "Counting the Cost - Conversation with Myron from Atlanta (pt III)",
      "description": "As Myron’s time with the church comes to a close, me meets a young lady.  This young lady is perfect for Myron, in his eyes.  She also consideres herself a christian.  The problem is, she is not a member of the ICOC.  However, Myron believed that she was “the one.”  Myron recounts how he wrestled with this dilemma and made the choice that he thought was best for him.  Myron tells us what life has been like after leaving the church.  He tells us about the laughter of fatherhood and the adventure of being married.  Unlike what the ICOC would have him believe, he just chose to live a regular life.  https://www.youtube.com/channel/UC_j6-5fim78s_XL4WQLXWFASupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-24T00:00:00",
      "duration": "00:27:57.1910000",
      "explicit": false,
      "spotifyId": "7DxABi2W8DOi78mk88vYFH",
      "appleId": 1000567564842,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7DxABi2W8DOi78mk88vYFH",
        "apple": "https://podcasts.apple.com/podcast/counting-the-cost-conversation-with-myron-from-atlanta/id1597681412?i=1000567564842"
      }
    },
    {
      "id": "5c212b20-a407-4baf-a6e8-aa2463225b1b",
      "title": "Voluntold - Conversation with Myron from Atlanta (pt II)",
      "description": "Myron picks up where he left of in the second part of our conversation.  After getting baptized within 7 days of studying the bible, his time with the ICOC was off and running.  The church brought fun and structure to his life.  Like many of us, Myron made some strong relationships with some of the members around him.  Myron talks about dating and what that experience was like for him.  Myron talks about a dating culture in which the women were put in situtions where they could not say “no” if a man from the church asked them out on a date.  Myron then goes into speaking about red flags that he noticed during his time with the church.  Myron talks about being put into a “bible talk” leader position with the church.  Myron also talks about the church being run like a multi level marketing organization.  To Myron, the structure of the church lent itself to the controling tactics that the church employed.    To find out more about Myron, check out his youtube channel, “Last Principles”https://www.youtube.com/channel/UC_j6-5fim78s_XL4WQLXWFASupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-22T00:00:00",
      "duration": "00:24:14.1580000",
      "explicit": false,
      "spotifyId": "0GMIRxiXTxPOpUS5DhiWfz",
      "appleId": 1000567342494,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0GMIRxiXTxPOpUS5DhiWfz",
        "apple": "https://podcasts.apple.com/podcast/voluntold-conversation-with-myron-from-atlanta-pt-ii/id1597681412?i=1000567342494"
      }
    },
    {
      "id": "67c3cd23-eb2d-452e-8833-40df65b46436",
      "title": "People Pleasing - Conversation with Myron from Atlanta (pt I)",
      "description": "This week we speak with Myron.  Myron joined the church in the year 2000 and left the church in 2013.  Like many of us, Myron recently began processing and discussing his time with the organization.  Myron is the creater of the youtube channel called “Last Principles” where he discusses his experience with the ICOC in greater detail.  Myron joined the church as a college Freshman in the state of Florida in the year 2000.  Myron is of a southern baptist background.  The diversity and non-traditional nature of the ICOC appealed to Myron.  Like many of us, Myron was invited to study the bible and he eventually agreed to it.  The disciples that he met questioned and challenged Myron’s version of christianity.  After studying the bible with the ICOC for 7 days, Myron was baptized into the church.  Myron’s story isn’t very different from the stories of many other people who became members of this particular church.  Myron tells the story of a young man who was trying to figure things out.To learn more about Myron and his story, you can find him on his youtube channel, Last Principleshttps://www.youtube.com/channel/UC_j6-5fim78s_XL4WQLXWFASupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-19T00:00:00",
      "duration": "00:25:29.8870000",
      "explicit": false,
      "spotifyId": "2GeeAyHnaIvWLeJ1zOO7oI",
      "appleId": 1000567015333,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GeeAyHnaIvWLeJ1zOO7oI",
        "apple": "https://podcasts.apple.com/podcast/people-pleasing-conversation-with-myron-from-atlanta-pt-i/id1597681412?i=1000567015333"
      }
    },
    {
      "id": "bb7fd54d-f0a4-4f88-8501-1b50cc26d33f",
      "title": "Grief Isn\u0027t the Final Stop - Conversation with Rachelle from Los Angeles (pt III)",
      "description": "In the final segment of our conversation with Rachelle, she discusses the different types of loss that people encounter in their lives.  Rachelle thinks that leaving the church is also a type of loss and like other types of loss, it too deserves to be addressed.  According to Rachelle, grief reovery is actionable work.  She talks to us a little bit about what that work looks like.  Grief isn’t just about dealing with sadness, as Rachelle explains to us.  In speaking with Rachelle, we get the impresison that the ICOC is not a safe space emotionally for many people.  Rachelle is asked if she believes this oragnization to be a cult.  She gives us her response based off of her experience.  She discusses how she came after “the letter” and how things were a little different.  However, upon researching the churches’ past she noticed that their fundamental beliefs and stances were the same as they were in the past.  Even if the church changed their words, the experiences of people of different time spans and parts of the globe match. Rachelle Jones is currently a Grielf Recovery Specialist.  To find out more abut the type of work that she does, you can find her at…  https://www.griefrecoverywithrachelle.comhttps://twitter.com/GRwRachellehttps://www.instagram.com/grwrachelle/https://www.facebook.com/GRwRachelleSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-17T00:00:00",
      "duration": "00:25:01.2570000",
      "explicit": false,
      "spotifyId": "4dXkqlI3piMq2RFhC53aWM",
      "appleId": 1000566720557,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4dXkqlI3piMq2RFhC53aWM",
        "apple": "https://podcasts.apple.com/podcast/grief-isnt-the-final-stop-conversation-with-rachelle/id1597681412?i=1000566720557"
      }
    },
    {
      "id": "32eb748a-a866-445d-a1d5-a3919f0353be",
      "title": "People Need To Be Heard - Conversation with Rachelle from Los Angeles (pt II)",
      "description": "Rachelle tells us the story of someone who had needs but the church did not meet those needs.  Not everyone who leaves this church leaves because we think it is a cult; we leave because the church no longer meets our needs.  Rachelle’s story exemplifies that.  Rachelle talks about how people experience grief on many levels, but many times that grief is not addressed.  Rachelle found solice in the evidenced based grief recovery method.  She brought this up to the church leadership but they rejected her because such a program did not meet their standards.  This troubled Rachelle because she was of the mind that the church had many members that were hurting and needed more support than the church was willing or able to provide.  This rejection set the wheels in motion for Rachelle leaving.  She states that people were not allowed to think for themselves.  Rachelle thinks that the church didn’t take mental health matters seriously and she believes this to be dangerous.  SOME OF THE CONTENT FOUND IN THIS EPISODE MIGHT BE COSIDERED DISTURBING TO SOME LISTENERS.   **In this episode we discuss suicide**If you or anyone you know is contimplating suicide, understand that help is avalable.  Contact the National Suicide Prevention Lifeline at 1-800-273-8255 or use the following link:https://suicidepreventionlifeline.orgRachelle Jones is currently a Grielf Recovery Specialist.  To find out more abut the type of work that she does, you can find her at…  https://www.griefrecoverywithrachelle.comhttps://twitter.com/GRwRachellehttps://www.instagram.com/grwrachelle/https://www.facebook.com/GRwRachelleSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-15T00:00:00",
      "duration": "00:20:11.2190000",
      "explicit": false,
      "spotifyId": "4meZlxRwSx8YB7Lp7BfHbO",
      "appleId": 1000566460529,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4meZlxRwSx8YB7Lp7BfHbO",
        "apple": "https://podcasts.apple.com/podcast/people-need-to-be-heard-conversation-with-rachelle/id1597681412?i=1000566460529"
      }
    },
    {
      "id": "6e0409fa-85f1-4917-b643-21383f5a069c",
      "title": "Balls to the Wall - Conversation with Rachelle from Los Angeles (pt I)",
      "description": "This week we meet Rachelle Jones who, along with her husband, became a member of the ICOC in 2014.  She left the church in 2019 for a variety of reasons.  Her testimony dispells the story that the church has changed its controling practices since the appearance of the letter in 2003.  Rachelle discusses with us how she and her husband joined the church.  Like many of us, she describes entering the church with a backpack full of emotional luggage.  She discusses how she felt betrayed and deceived by the bible studies as she deems them now to be a series of indocrtination studies.  While a member, Rachelle came across the Grief Recovery Method through a tragic event in her life.  She thought that the program was valuable as it helped her process the ensuing trauma of said event.  She attempted to introduce the program to people in her church.  The church leadership was not keen on allowing outside influences into their rank, even if the information might be beneficial, according to Rachelle’s story.  Rachelle speaks with us about her level of commitment with the organization and how she viewed and experienced things while she was a member. Rachelle Jones is currently a Grielf Recovery Specialist.  To find out more abut what this means and the type of work that she does, you can find her at…  https://www.griefrecoverywithrachelle.comhttps://twitter.com/GRwRachellehttps://www.instagram.com/grwrachelle/https://www.facebook.com/GRwRachelleSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-12T00:00:00",
      "duration": "00:22:33.8740000",
      "explicit": false,
      "spotifyId": "3ybV8VsqYnk2h2WeUgTbMF",
      "appleId": 1000566111889,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ybV8VsqYnk2h2WeUgTbMF",
        "apple": "https://podcasts.apple.com/podcast/balls-to-the-wall-conversation-with-rachelle-from/id1597681412?i=1000566111889"
      }
    },
    {
      "id": "5fd18e94-1fef-4804-9598-c7f45c8e9146",
      "title": "Steve Johnson Conversation Recap with Elena from 3B",
      "description": "Elena from 3B, along with her infectious laugh are back!  This time Elena gives us her thoughts on Aldo\u0027s conversation with Steve Johnson.  She turns the tables on Aldo and asks him what he thought of the conversation.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-10T00:00:00",
      "duration": "00:31:08.9560000",
      "explicit": false,
      "spotifyId": "7lSC0ldkTK94FG1zgrv5MB",
      "appleId": 1000565922561,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7lSC0ldkTK94FG1zgrv5MB",
        "apple": "https://podcasts.apple.com/podcast/steve-johnson-conversation-recap-with-elena-from-3b/id1597681412?i=1000565922561"
      }
    },
    {
      "id": "0e8922c5-94c3-4576-a375-75ef51187472",
      "title": "Conversation with Steve Johnson (pt II)",
      "description": "Steve Johnson is a founding member and former World Sector Leader for the ICOC.  Steve is still a member of the ICOC and he has sat down to have a conversation on our podcast.  Steve speaks with us about the term cult as it pertains to the ICOC, the controlling nature of the organization, and mental health. Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-09T00:00:00",
      "duration": "00:35:47.4480000",
      "explicit": false,
      "spotifyId": "72FpePuRa0PbhrzRdI6xm5",
      "appleId": 1000565845113,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/72FpePuRa0PbhrzRdI6xm5",
        "apple": "https://podcasts.apple.com/podcast/conversation-with-steve-johnson-pt-ii/id1597681412?i=1000565845113"
      }
    },
    {
      "id": "eb539314-b6a3-4367-99aa-d3acfc968412",
      "title": "Do The Work - Conversation with Tricia from Kentucky (pt III)",
      "description": "Tricia was encourgaed by the congregation to not have friends that were outside of the organization.  She tells a story of needing permission from the church before taking a trip or interacting with non-members of this church.  These teachings are similar to those of the 1990s.  Tricia now describes how she began to leave the organization.  The leaders in her church seemed to recite from the same playbook of yesteryear.  Trica discusses seeing a therapist on campus and how that helped her to find resolve as she is processing this whole experience.  Tricia introduces and discusses  the concept of trauma bonding.  Going to therapy helped her to start her relationship with God all over again.  Tricia began her process of healing and did the work to help herself along this journey.  Tricia claims that this organization is a cult and explains so in her own words.  She also tells us about how she has began to pick up the pieces to her life and is moving on from this experience.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-08T00:00:00",
      "duration": "00:25:14.3440000",
      "explicit": false,
      "spotifyId": "3hPBZhQFYXeW0Bvx9eSyJg",
      "appleId": 1000565589404,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hPBZhQFYXeW0Bvx9eSyJg",
        "apple": "https://podcasts.apple.com/podcast/do-the-work-conversation-with-tricia-from-kentucky-pt-iii/id1597681412?i=1000565589404"
      }
    },
    {
      "id": "63c4bf6e-33fe-4f74-b562-165f8d2d7263",
      "title": "The First Principles - Conversation with Tricia from Kentucky (pt II)",
      "description": "As we continue to speak with Tricia, she continues to describe a church that was not upfront with her about their history or affiliation.  Tricia doesn’t remember seeing red flags that were obvious to her.  However, she states that she felt restricted, but still joined nonetheless.  Tricia was never required to attend a Sunday Service while she was studying the bible.  It wasn’t until after getting baptized that the full commitment to the organization become clear to her.  During her indoctrination process, attendance was encouraged.  This changed because upon becoming a member, attendance was required.  Tricia mentions that the ICOC as an organization was flagged on her campus at the University of Kentucky.  Perhaps, that is why they used methods that were more covert as they recruited new members.  Despite the subtle differences, Tricia’s account of her experience sounds similar to the experiences of those that have already spoken on this podcast.  The church has always had these methods of molding people and causing them to question their own instincts and intuitions.  Tricia’s account helps to support such a claim.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-07T00:00:00",
      "duration": "00:22:57.6450000",
      "explicit": false,
      "spotifyId": "0UGbcJlGjTvkKyZPoRjiX5",
      "appleId": 1000565515938,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0UGbcJlGjTvkKyZPoRjiX5",
        "apple": "https://podcasts.apple.com/podcast/the-first-principles-conversation-with-tricia/id1597681412?i=1000565515938"
      }
    },
    {
      "id": "d2ca08ee-e112-479b-887f-2c3e8ebf7f3a",
      "title": "A Controlled Narrative - Conversation with Tricia from Kentucky (pt I)",
      "description": "This week we meet Tricia.  Tricia became a disciple while a college student at the University of Kentucky in 2017.  She left the organization in 2019.  Tricia came across The Reclamation and was surprised that she could relate to the accounts of the church that were being told.  She heard the program and said to herself “why is this guy telling my story” as the stories from the 1990s and early 2000s were mirror images of her experience.  Tricia was described as low hanging fruit by the other disciples around her because she was ready and eager to join the church.  Tricia was excited to join the church and learn al that she could about the bible.  She did not believe that she was experiencing a cult environment during her time as a member.  She thought that she was joining a local church as the members presented it as such.  She believes that her church purposely and strategically did not disclose that they were indeed part of the International Church of Christ.   Tricia’s story is a contrast to the story that current members tell us on episodes 25 and 26.  The current members tell us a story of a church that  openly and currently grapples with and confronts its past, while Tricia gives an account of a church that seems to circumvent its past as it recruits new membership.  Tricia describes a church from the 1990s eventhough she was a member in 2017.  Tricia mentions that she used http://reveal.org to help her navigate the confusion she felt upon leaving the church.  REVEAL is an organization dedicated to former members of the International Churches of Christ, International Christian Church, Sold Out Discipling Movement, Boston Church of Christ, Boston Movement, and Crossroads Church of Christ, and the Crossroads Movement.  REVEAL’s mission is to help others Research, Examine, Verify, Educate, Assist and Liberate.  You can visit them at REVEAL.org for more information.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-05T00:00:00",
      "duration": "00:26:02.9580000",
      "explicit": false,
      "spotifyId": "1DtNDKcyebvCjfvTy8mPnK",
      "appleId": 1000565246520,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DtNDKcyebvCjfvTy8mPnK",
        "apple": "https://podcasts.apple.com/podcast/a-controlled-narrative-conversation-with-tricia/id1597681412?i=1000565246520"
      }
    },
    {
      "id": "a56b2bdb-8d5e-4b79-9fb4-0112ec71049a",
      "title": "Conversation with Steve Johnson",
      "description": "Steven Johnson was a former leader with the International Church of Christ.  Steve is considered one of the founders of the church; one of the famed 30 would be disciples from 1979.  Steve was the first man appointed as an evangelist with the ICOC.  He also lead the team of 18 people that planted the New York City Church of Christ.  Under his leadership that group of 18 grew to be over 5,000 members.  He is also a former World Sector Leader.  As WSL, Steve was in charge of the churches on the eastern seaboard of the United States, the Caribbean, and Sub-Sahara Africa.  Some regarded Steve as Kip McKean\u0027s right hand man, depending on who you ask.  Steve joined Aldo for a brief discussion about the impact that the letter had on him personally back in the year 2003.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-04T00:00:00",
      "duration": "00:34:03.4020000",
      "explicit": false,
      "spotifyId": "3QKWYJAsqpt4AiKSMvnAjy",
      "appleId": 1000565184498,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QKWYJAsqpt4AiKSMvnAjy",
        "apple": "https://podcasts.apple.com/podcast/conversation-with-steve-johnson/id1597681412?i=1000565184498"
      }
    },
    {
      "id": "c3c0233f-2023-4ec1-b4d6-3934f5bf5f9d",
      "title": "The Mattress - Conversation with Elena from 3B",
      "description": "Elena from 3B is back!  Join us as Elena shares her thoughts on episodes 25 and 26.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-03T00:00:00",
      "duration": "00:25:20.9530000",
      "explicit": false,
      "spotifyId": "25jN2CQdVyx6znptchc76g",
      "appleId": 1000565071660,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/25jN2CQdVyx6znptchc76g",
        "apple": "https://podcasts.apple.com/podcast/the-mattress-conversation-with-elena-from-3b/id1597681412?i=1000565071660"
      }
    },
    {
      "id": "8be06bf3-f6b3-4142-b289-d6b1d9afd37a",
      "title": "High Commitment - Conversation with Current ICOC Members, Kenny and Hashim from New York (pt II)",
      "description": "Kenny and Hashim, two current members of the ICOC, begin to tell us why they joined the program.  Kenny states that not everyone was just another cult member.  He hope to portray someone who was genuinely operating in the best interest of himself and of those around him.  Kenny hopes that his appearance on the program can help people process what they have experienced with the organization.   When asked if they believe the ICOC to be a cult, Hashim and Kenny begin to speak about the present day ICOC.   Kenny does not believe the church to be a cult back then or now.  He gives his reasons why.  Hashim believes that the term cult is a catch phrase that people over use.  Hashim refers to the church as \u0022high commitment\u0022 instead of a cult.  Hashim concludes that the church was christian weird with some controlling practices, and that those controlling practices no longer happen in the church.  Hashim is currently the editor of a newsletter called Justice Year in which he writes about different social.  Please visit https://justiceyear.com for more information.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-06-01T00:00:00",
      "duration": "00:29:35.5680000",
      "explicit": false,
      "spotifyId": "13D6o214y1WeeFbT1dfecA",
      "appleId": 1000564773195,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/13D6o214y1WeeFbT1dfecA",
        "apple": "https://podcasts.apple.com/podcast/high-commitment-conversation-with-current-icoc-members/id1597681412?i=1000564773195"
      }
    },
    {
      "id": "2b78ef4c-69f3-4f5c-a7a7-6b570dd1e659",
      "title": "Bought Into A Controlling Structure - Conversation with Current ICOC Members, Kenny and Hashim from New York (pt I)",
      "description": "Today we meet two current members of the ICOC, Kenny and Hashim.  We began the conversation with the aftermath of the letter.  Many people left the organization upon the appearance of the letter.  Kenny and Hashim chose to stay.  We asked them why they stayed.  Kenny mentions the he was there for God, and the actions of others did not influence his personal walk with God.  Kenny also mentions that one of the reasons that he stayed with the organization was because there was an instance that made him realize that the personal relationships that he had with other people were real.  Hashim admits that he never gave that question much though, but gives his explanation nonetheless.  Hashim states that the aftermath of the letter was a great spiritual time for him.  Kenny mentions that the organization was stats driven, and he knew how to play that game.  Hashim states that the church provided him with structure and helped him to achieve a certain status within his neighborhood community.         Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-29T00:00:00",
      "duration": "00:26:13.3280000",
      "explicit": false,
      "spotifyId": "6luuscpwG8ZioyvGhvbOeR",
      "appleId": 1000564366264,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6luuscpwG8ZioyvGhvbOeR",
        "apple": "https://podcasts.apple.com/podcast/bought-into-a-controlling-structure-conversation/id1597681412?i=1000564366264"
      }
    },
    {
      "id": "2d6ac7cc-fe32-4c19-8e44-bd191807fe1b",
      "title": "Hell Was The Bottom Line - Conversation with Christy from Los Angeles (pt. III)",
      "description": "In our third and final segment of our conversation with Christy, she mentions that one of the core teachings of this church was that the only way to get to heaven was to be a member of this organization.  According to Christy, the goal posts were always moving depending on who was leading at the time.  She recognized that she was answerring to people and not the bible.  Christy and her husband were in charge of the children’s ministry despite not being as experienced as some others.  She questioned that and began pushing back.  She states that this pushing back is what led to her being let go from her position in the full time ministry.  Christy describes how the relationships within those in leadership were conditional.  She states that the loyalty to the organization was greater than the loyalty to one another, for many in leadership.  Christy discusses what its like to be a married leader in the church.  She made a desicion to no longer allow the church leadership to interfere in her marraige.  Through our conversation with Christy we learn that the leadership experienced much of the same pressure and spiritual abuse that the followership experienced as well.  Christy talks about going through a process of grief, which included guilt, fear, and anger, upon leaving the organization and the subequent years that followed.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-27T00:00:00",
      "duration": "00:27:35.5620000",
      "explicit": false,
      "spotifyId": "6jtxM4Nr2qiAYdjep0D7j6",
      "appleId": 1000564126365,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6jtxM4Nr2qiAYdjep0D7j6",
        "apple": "https://podcasts.apple.com/podcast/hell-was-the-bottom-line-conversation-with-christy/id1597681412?i=1000564126365"
      }
    },
    {
      "id": "ea5930c4-ed0a-4329-b655-3041085cf1b5",
      "title": "At What Cost? - Conversation with Christy from Lost Angeles (pt II)",
      "description": "PLEASE EXCUSE THE TECHNICAL DIFFICULTIES THAT ARE DISPLAYED IN SOME PARTS OF THIS EPISODEChristy joined one of the church’s mission teams upon graduating high school.  There was a quota of baptisms that leaders on the mission field were required to meet.  Through the purusit of these quotas, some baptisms were rushed.  There were people who were baptized for the sake of the increase in church wide statistics and numerical growth.  She describes the leaders as using fear and intimidation on other leaders to keep them in step with the church wide practices and beliefs.  The leaders set up an internal environment in which everything that one does must be done to be worthy of God.    Christy uses the phrases \u0022control\u0022 and \u0022manipulation\u0022 to describe the church.   As a leader of the church, every hour of her day was accounted for and needed to be accessible to her superiors at all times.  Most of what she was accountable for was the overall numerical growth of the church.  Christy talks to us about the “weak and concerned list” that leaders used to talk about the general membership.  The weak members of the church were never supported; they were judged.  Christy also tells up about the leaders using “god ordained gossip” to control the membership.    Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-25T00:00:00",
      "duration": "00:28:39.7970000",
      "explicit": false,
      "spotifyId": "39lYfv7CK1BOxgdgYZ0Ba4",
      "appleId": 1000563699950,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39lYfv7CK1BOxgdgYZ0Ba4",
        "apple": "https://podcasts.apple.com/podcast/at-what-cost-conversation-with-christy-from-lost/id1597681412?i=1000563699950"
      }
    },
    {
      "id": "b700d5b8-62d0-4ff6-9790-1c229ebf043f",
      "title": "She Was Raised Up - Conversation with Christy from Los Angeles (pt I)",
      "description": "PLEASE EXCUSE THE TECHNICAL DIFFICULTIES DISPLAYED IN SOME PARTS OF THIS EPISODEIn this episode we meet Christy.  Christy is a former women’s ministry leader with the International Church of Christ.   Christy joined the church as a teenager in 1987 and left as a married mother in her 30’s in the early 2000’s.  Christy describes her leaving the church as a process; as a peeling of an onion.  Christy states that the church is proficient at scaring it’s members with the thought of going to hell should they not be members of this church.    She discusses how she used to think about escaping the church at one point.  However, the fact that her entire life was wrapped in this church, prevented her from doing so.  As Christy states it, “to leave the church is to leave all of those relationships.”  She also describes this process of the church breaking down her confidence and rebuilding it in their image for their purpose.  Christy recounts her time as a leader in the church.  She describes the church as all encompassing and her spending the majority of time with the church as a leader.   Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-22T00:00:00",
      "duration": "00:26:58.3900000",
      "explicit": false,
      "spotifyId": "7Fxg7uN0ZWp5wlhiZg1Sr8",
      "appleId": 1000563090412,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Fxg7uN0ZWp5wlhiZg1Sr8",
        "apple": "https://podcasts.apple.com/podcast/she-was-raised-up-conversation-with-christy-from-los/id1597681412?i=1000563090412"
      }
    },
    {
      "id": "ac2031e3-4582-44e9-b718-493dae75ff60",
      "title": "You\u0027re Enough - Conversation with Dr. Melton (pt. III)",
      "description": "In our third and final conversation with Dr. Melton, she tells us how the church altered her relationship with her friends to an extent.  Although Dr. Melton does not use the world “cult” outright, she is asked how she would respond to people who do claim the church to be a cult.  In the same vien, she is then asked what she would say to those that claim that it is not a cult.  Dr. Melton discusses how the work cult is emotionally latent and causes people to negatively identify themselves with such a word, because it is not something that people willingly admit to being a part of.  When asked what Dr. Melton would tell her younger self, Dr. Meltion gives us her final words on this topic. Dr. Melton is a practicing clinical psychologist.  She is a founder of Melton Psychology Group, LLC where their mission is to creat a healing space for you to transform your life and reclaim your purpose.  https://meltonpsych.com/about/drmelton/https://www.instagram.com/melton_psych/Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-20T00:00:00",
      "duration": "00:23:38.9190000",
      "explicit": false,
      "spotifyId": "3dy0Zy1Kc9xseuiwmCuC9M",
      "appleId": 1000562725353,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3dy0Zy1Kc9xseuiwmCuC9M",
        "apple": "https://podcasts.apple.com/podcast/youre-enough-conversation-with-dr-melton-pt-iii/id1597681412?i=1000562725353"
      }
    },
    {
      "id": "5db789d2-0efb-4cb7-ac1f-4cb73e198b36",
      "title": "Suppression and Repression - Conversation with Dr. Melton (pt II)",
      "description": "In the second segment of our converstion with Dr. Melton, paints another scene as to why she has left.  These stories about former members leaving are more complicated than current church members realize.  These stories are multi-faceted, complicated and simply human at their core.  Dr. Melton discusses how there is not garauntee of belongingness even if you are in the same church as everyone else.  Although Dr. Melton found a sense of belonging, that did not last long.  Dr. Melton began graduate school as a member of the church, however, members of the church leadership questioned the practice of psychology.  Clearly, this did not sit with the future Dr. Melton.   As Dr. Melton processes all of these things, she begins to leave the church.  After leaving, she discusses the process of supression and repression up on her leaving the church.   Dr. Melton had a vision for her life, that the church no longer fit.  Dr. Melton also speaks about the effect that her affilication with this organization had on the relationship with her family and friends.  Dr. Melton is a practicing clinical psychologist.  She is a founder of Melton Psychology Group, LLC where their mission is to creat a healing space for you to transform your life and reclaim your purpose.  https://meltonpsych.com/about/drmelton/https://www.instagram.com/melton_psych/Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-18T00:00:00",
      "duration": "00:26:21.2440000",
      "explicit": false,
      "spotifyId": "44A91qARj76frYaHJ4jDNG",
      "appleId": 1000562098878,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/44A91qARj76frYaHJ4jDNG",
        "apple": "https://podcasts.apple.com/podcast/suppression-and-repression-conversation-with-dr-melton/id1597681412?i=1000562098878"
      }
    },
    {
      "id": "156749b6-3e04-4a45-bc33-ebecf1b5b886",
      "title": "Gaslighting - Conversation with Dr. Melton (pt I)",
      "description": "Dr. Melton returns and joins us on season 2.  Along with Elena from 3B, Aldo and Dr. Melton begin to discuss the concept of purity culture.  Although purity culture is not exclusive to the ICOC, it was a major driving force in how the church expressed and extended some of its unofficial policies.  Dr. Melton discusses what kind of effect the practice of purity culture had on her and some of the women in the church.  Dr. Melton mentions how this was a set up for toxic relationships.  Despite there being well intentioned members, Dr. Melton introduces the idea of “bad actors.”  The trio also discuss the idea of “gas lighting” and how the church used this practice in the past and how it, although seemingly unintentional, heightened peoples inability to trust their own judgements.   When asked about red flags that she noticed, Dr. Melton begins to tell us about why she left the organization.Dr. Melton is a practicing clinical psychologist and professor.  She is a founder of Melton Psychology Group, LLC where their mission is to create a healing space for you to transform your life and reclaim your purpose.  https://meltonpsych.com/about/drmelton/https://www.instagram.com/melton_psych/Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-15T00:00:00",
      "duration": "00:27:37.5730000",
      "explicit": false,
      "spotifyId": "1Q4tk4MWaV2ik50b5Wgvgn",
      "appleId": 1000561402983,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Q4tk4MWaV2ik50b5Wgvgn",
        "apple": "https://podcasts.apple.com/podcast/gaslighting-conversation-with-dr-melton-pt-i/id1597681412?i=1000561402983"
      }
    },
    {
      "id": "8c9881d1-c0a2-49f2-9167-ff6afeda6cb2",
      "title": "To Yourself, Be True - Conversation with Tammy from New York (pt III)",
      "description": "This is the third and final segment of our conversation with Tammy.  Tammy suggests that those members that were seen as “struggling” and a burden to the church were just being punished for being their most authentic selves.  Tammy did not want to get kicked out of the church because this enviroment was her comfort zone for a decade and admits to going through a period of grief upon being outsted.  Tammy discusses the specifics on why she was removed from the organization.  Tammy talks about the power and control dynamic that exists within relationships that are domestically violent or abusive and how these same dynamics exist within the relationship that some members have with the organization.  She suggests that the use of isolation is used in both instances.  This not to suggest that all members experience such.  Tammy is then asked if she views this organization as a cult or not.     Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-13T00:00:00",
      "duration": "00:24:55.0660000",
      "explicit": false,
      "spotifyId": "7vyznDdgZyxIUnvAFx3BKE",
      "appleId": 1000560941524,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vyznDdgZyxIUnvAFx3BKE",
        "apple": "https://podcasts.apple.com/podcast/to-yourself-be-true-conversation-with-tammy-from-new/id1597681412?i=1000560941524"
      }
    },
    {
      "id": "cc29caec-e741-40fb-ae5f-02c32ff74167",
      "title": "Power and Control - Conversation with Tammy from New York (pt II)",
      "description": "Tammy discusses the concept of \u0022deprogramming\u0022 and \u0022reprogramming\u0022 as a member of the organization.  As Tammy describes the concept of \u0022systemic programming,\u0022 it introduces the idea that the church was made of \u0022same characters\u0022 and a \u0022different cast.\u0022  Aldo tells of how the church became a bit more lenient in the subsequent years after \u0022the letter.\u0022  However, after some time, the church then re-introduced their abusive practices and even introduced some new tactics.  Tammy then tells us about the circumstances that led to her being removed from the church and the effect that it had on her and her family.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-11T00:00:00",
      "duration": "00:20:26.6050000",
      "explicit": true,
      "spotifyId": "6llnvr9E8p8OdlWHMzx8rN",
      "appleId": 1000560412566,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6llnvr9E8p8OdlWHMzx8rN",
        "apple": "https://podcasts.apple.com/podcast/power-and-control-conversation-with-tammy-from-new-york/id1597681412?i=1000560412566"
      }
    },
    {
      "id": "b3240a40-cbd4-4f3c-8ca9-c38787e3a016",
      "title": "All Things To All People - Conversation with Tammy from New York (pt I)",
      "description": "Today we meet Tammy.  Tammy is currently a liscensed therapist.  Before, becoming a counselor she was a member of the ICOC.   Like many of us, Tammy speaks of looking for a sense of belonging prior to joining the church.   Tammy joined the organizaiton as a college student.  While a member, Tammy describes her self as excited and happyt to be with the group.  She also brought her parents and friends along as they too were baptized into the church upon Tammy introducing it to them.  Nonetheless she left andTammy explains that she stored all of her feelings and memories away upon leaving the church.  She also mentions that she was suicidal after leaving the church.  If you or someone you know is having suicidal thoughts or ideations, please know that help available.  Please contact the National Suicide Prevention Lifeline at 1-800-273-8255 or find them at the link below:https://suicidepreventionlifeline.orgSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-08T00:00:00",
      "duration": "00:20:48.3650000",
      "explicit": false,
      "spotifyId": "2vm2BcV5qRMhy8WYfW0wFh",
      "appleId": 1000559942141,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2vm2BcV5qRMhy8WYfW0wFh",
        "apple": "https://podcasts.apple.com/podcast/all-things-to-all-people-conversation-with-tammy-from/id1597681412?i=1000559942141"
      }
    },
    {
      "id": "57efb5ec-c981-490e-9147-b53e4d6ba036",
      "title": "It Served A Purpose - Conversation with Eric from Los Angeles (pt III)",
      "description": "Eric tells us about leaving the organization.  He explains the concept of being shunned by the members of the ICOC as he began to transition away from the church.  After being a way from the church he began to live life on his terms.  It during his time as a former member that  Eric’s wife got invited to a bible talk.  Eric explains to us his reaction to this.  Eric mentions that when he left the church, he experienced some harships and he equated those hardshlps with leaving the church.  The church taught him that if he left, he would be punished by God somehow.  It wasn’t until 15 years after leaving that Eric began to process what happened.  Eric found it difficult to admit that he was in a cult, but after some time, he has forgiven himself.In this episode, Eric speaks about ICOC members attempting or commiting suicide.  In 2006, former ICOC member Niall MacMahon died by suicide.  The ICOC was never found to be legally responsible for the death of Mr. MacMahon.  However, Mr. MacMahon’s brother insists that the ICOC had undue influence over his brother and thus blames the church for the tragic event.  Naill MacMahon’s story can be found in the link below: https://www.religionnewsblog.com/18477/international-churches-of-christJenny Hunter is a former member of the ICOC.  At one point she contimplated suicide as the pressure of being in such an organization became overwhelming.  Her story can be found in the link below:https://www.washingtonian.com/2008/07/01/unanswered-prayers-the-story-of-one-woman-leaving-the-international-church-of-christ/If you or anyone you know is contimplating suicide, understand that help is avalable.  Contact the National Suicide Prevention Lifeline at 1-800-273-8255 or use the following link:https://suicidepreventionlifeline.orgSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-06T00:00:00",
      "duration": "00:24:25.5470000",
      "explicit": false,
      "spotifyId": "4ldlbPNyQpg87ysAcLJkfz",
      "appleId": 1000559795564,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ldlbPNyQpg87ysAcLJkfz",
        "apple": "https://podcasts.apple.com/podcast/it-served-a-purpose-conversation-with-eric-from/id1597681412?i=1000559795564"
      }
    },
    {
      "id": "a1aee50a-17c5-4b51-9926-46931629a20a",
      "title": "Seek First the Kingdom - Conversation with Eric from Los Angeles (pt II)",
      "description": "In the second part of our conversation with Eric, he begins to tell us about the red flags that he began to notice.  However, like many of us, he ignored those red flags at the time that they presented themselves.  Eric tells us how the indoctrination study called “sin and repentance” was a major red flag for him as it suppressed his ability to think critically.   Eric begins to tell us when he began to consider leaving the organization.   He also speaks about how the church would use the sharpest people to attract visitors and increase membership.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-04T00:00:00",
      "duration": "00:22:04.3290000",
      "explicit": false,
      "spotifyId": "1MX4I6vAvLCQcbT0MiFaJ7",
      "appleId": 1000559539941,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MX4I6vAvLCQcbT0MiFaJ7",
        "apple": "https://podcasts.apple.com/podcast/seek-first-the-kingdom-conversation-with-eric-from/id1597681412?i=1000559539941"
      }
    },
    {
      "id": "282e967a-cc9e-4e4e-babb-b9478145701c",
      "title": "All Nations - Conversation with Eric from Los Angeles (pt I)",
      "description": "Eric joined the teen ministry in Los Angeles in the year 2000 at the age of 14.  Like many of us, Eric was looking for some positivity and community prior to becoming a member of the organization.  The church offered Eric a place of refuge from the world around him; the church offered him a place to fit in.  Eric describes his first encounter with the church and tells us what was like stepping into a diverse and welcoming environment.  Eric describes his time with the teen minisitry and it being filled with fun and  was a distraction from bad influences.    Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-05-01T00:00:00",
      "duration": "00:27:10.2750000",
      "explicit": false,
      "spotifyId": "2R5xTLavrEct9sUZPgNp7X",
      "appleId": 1000559220941,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2R5xTLavrEct9sUZPgNp7X",
        "apple": "https://podcasts.apple.com/podcast/all-nations-conversation-with-eric-from-los-angeles-pt-i/id1597681412?i=1000559220941"
      }
    },
    {
      "id": "95f06fcc-f07b-45e8-aaa8-a0acf4d6d7ff",
      "title": "Upside Down - Conversation with Kathy from Indianapolis (pt III)",
      "description": "In the third and final part of our conversation with Kathy, she begins to tell us how she began to leave the ICOC and why.  Kathy explains that after leaving the organization, there was a lot for her to undo as she spent several years with the organization.   28 years after leaving the organization, Kathy now regards it as a cult although she did not have that sentiment before.  Kathy also explains how life has been like for her after leaving.  She describes overcoming physical ailments and battles with mental health in her life and how this spirit of perseverance has helped to mold her into who she is today.  To learn more about Kathy, follow her on instagram at https://www.instagram.com/kathy.baumann.coaching/https://www.facebook.com/groups/645671615631028Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-29T00:00:00",
      "duration": "00:23:48.1920000",
      "explicit": false,
      "spotifyId": "1BDgMqy3OW83qdzz9N7JIC",
      "appleId": 1000559061653,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1BDgMqy3OW83qdzz9N7JIC",
        "apple": "https://podcasts.apple.com/podcast/upside-down-conversation-with-kathy-from-indianapolis/id1597681412?i=1000559061653"
      }
    },
    {
      "id": "c0c172e1-371a-41d4-bfa9-abacb06d2fc6",
      "title": "Indianapolis 1994 - Conversation with Kathy from Indianapolis (pt II)",
      "description": "In the second part to our conversation with Kathy, she begins to explain to us why the church felt the need to tell a large group of members to get rebaptized.   The leaders of the church required certain members of certain churchs to do the indoctrication studies all over again before getting rebaptized.  The church in Indianapolis split from the International Church of Christ in 1994 due to a disagreement in belief and policy.   The leader of the church in Indianapolis made the decision to leave the ICOC.  He spoke about this with the members in attendance on a Sunday morning.  This was an important moment in the history of the ICOC as one part of the congregation chose to leave the ICOC while the other part decided to remain with the ICOC.  The ICOC then regarded these dissenters as fall aways and traitors.  Kathy was a part of this group of people that left and she was in attendance when the leader of the church in Indianapolis made such an announcement.  Join us as she recounts these events.To learn more about Kathy, follow her on instagram at https://www.instagram.com/kathy.baumann.coaching/https://www.facebook.com/groups/645671615631028Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-27T00:00:00",
      "duration": "00:26:45.4070000",
      "explicit": false,
      "spotifyId": "46cAdwIdtLSxcdFD0OQ350",
      "appleId": 1000558819678,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/46cAdwIdtLSxcdFD0OQ350",
        "apple": "https://podcasts.apple.com/podcast/indianapolis-1994-conversation-with-kathy-from/id1597681412?i=1000558819678"
      }
    },
    {
      "id": "c8a83ead-0c35-4074-99f8-95b1c6981945",
      "title": "Reconstruction - Conversation with Kathy from Indianapolis (pt I)",
      "description": "In this episode with meet Kathy from Indianapolis.  Kathy is currently a life coach where she helps her clients do the best they can with what they have.   She has been through much in her life, and now wants to help others to achieve the same type of perseverance.  However, before becoming a life coach, Kathy was a member of the ICOC.   She joined the Indianapolis Church of Christ in 1987 as a college freshman.  She joined during the time of the church’s marked \u0022reconstruction\u0022 period.  Unlike many of us, Kathy got baptized twice with the ICOC.  Join us as she explains the surrounding circumstances that required a second baptism and what life was like for her while a member.  To learn more about Kathy, follow her on instagram and Facebook  at https://www.instagram.com/kathy.baumann.coaching/https://www.facebook.com/groups/645671615631028Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-24T00:00:00",
      "duration": "00:24:32.7570000",
      "explicit": false,
      "spotifyId": "3H8AZbdoH4U19YMmohacON",
      "appleId": 1000558491475,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3H8AZbdoH4U19YMmohacON",
        "apple": "https://podcasts.apple.com/podcast/reconstruction-conversation-with-kathy-from/id1597681412?i=1000558491475"
      }
    },
    {
      "id": "c3b5ee15-567c-4a9f-884e-373e43e56091",
      "title": "Never To Be Silenced Again - Conversation with Del from London (pt III)",
      "description": "In the third and final installment of our conversation  with Del from London, he explains to us some of the red flags that he has noticed during his time with the organization.  Like many of us, he saw these red flags but chose to ignore them.   According to Del, part of the reason for ignoring the red flags is because we were “so indoctrinated.\u0022  The more we discussed, Cousin Eddie’s  noticed that there was a certain level of fear put into the membership in order to maintain order.  We ask Del if he regrets joining the church and his answer is rather complicated.   Del has sacrificed time, personal and professional opportunities in order to \u0022seek the kingdom first.\u0022  Del also discusses the concept of a cult and how he came to the realization that he was a part of a cult.  Despite all of that, Del has picked up the pieces to his life and he discusses how he has done so.   Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-22T00:00:00",
      "duration": "00:24:44.0160000",
      "explicit": false,
      "spotifyId": "0n8S2iq1bXN5G8WiT6YOvY",
      "appleId": 1000558338492,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0n8S2iq1bXN5G8WiT6YOvY",
        "apple": "https://podcasts.apple.com/podcast/never-to-be-silenced-again-conversation-with-del-from/id1597681412?i=1000558338492"
      }
    },
    {
      "id": "c1990103-25bb-4bb7-b303-c3ce14c1fca9",
      "title": "Prime Time - Conversation with Del from London (pt. II)",
      "description": "This is the second installment of our three part conversation with Del from London.  Del explains to us what his day to day life looked like while he was in the London Church.  There is much to say on this matter as he has spent the better part of ten years with the organization.    He explains to us the concept of placing members  on “the weak list.”   Del also introduces us to the term “prime time,\u0022 which was a term the London Church used regarding recruiting.   Del and Aldo explain to Cousin the Eddie the idea of dating within this church and some of the dynamics behind that.  They also discuss how members would attempt to impress other members of the church by how stating how many bible studies one conducted and by how many years one had been a member of the church.   Del gives us his take on why the infamous letter was written and the Sabbatical Letter that preceded it.   Del also mentions the levels of control that the London church imposed on the membership by doing such things as banning particular books.  SPECIAL NOTEThis conversation was recorded before Matthew joined us and gave his take on the timeline of the release of the letter.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-20T00:00:00",
      "duration": "00:26:45.0150000",
      "explicit": false,
      "spotifyId": "5Aq2IOa4V7a1MYClu85nE1",
      "appleId": 1000558107157,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Aq2IOa4V7a1MYClu85nE1",
        "apple": "https://podcasts.apple.com/podcast/prime-time-conversation-with-del-from-london-pt-ii/id1597681412?i=1000558107157"
      }
    },
    {
      "id": "ced0c02d-55a8-4c72-a10b-b97f8da8ca99",
      "title": "We Called It The Kingdom: Conversation with Del from London (pt I)",
      "description": "Today we welcome back Del from London.  We met him on episode 2 when he recounted some of the events of the fallout regarding the infamous letter.  This time around, Del recounts his story of how he became involved with the ICOC.  He talks about being attracted to the church’s diversity and palpable energy that was on display at the first Sunday Service that he attended.  He then desicribes the last time that he attended the church and what led him to make the decision to leave.  Del spent 10 years with the London Church of Christ.  Del describes himself as a committed soilder for the organization.  After giving his 20’s to this organization, Del begins to wonder if he wasted his time.  Join us as Del takes us on a trip down his memory lane.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-17T00:00:00",
      "duration": "00:23:05.0900000",
      "explicit": false,
      "spotifyId": "7BXOBXQYR7PG9aseeK15fE",
      "appleId": 1000557813051,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7BXOBXQYR7PG9aseeK15fE",
        "apple": "https://podcasts.apple.com/podcast/we-called-it-the-kingdom-conversation-with-del-from/id1597681412?i=1000557813051"
      }
    },
    {
      "id": "d99381e5-f2cd-440b-be81-26fdaa8b3e67",
      "title": "Take Back Your Life: Conversation with Renowned Cult Expert Dr. Lalich (pt III)",
      "description": "In the final part of our conversation with Dr. Lalich, she explains to us how she eventually left the cult that she was a part of and tells us how she took back her life.Dr. Lalich is a world-renowned expert in cultic studies. She is the auuthor and co-author of several critically acclaimed books on cults. She is an avid contributor to the field of cultic studies through her research, presentations, articles, and documentaries.  Janja Lalich, Ph.D. is a researcher, author, and educator specializing in self-sealing, or closed, systems (cults, human trafficking, situations of coercive influence and control, ideological extremism), with a particular focus on recruitment, indoctrination, and methods of influence and control. She is Professor Emerita of Sociology at California State University, Chico and has been studying the social psychology of controversial groups and exploitative and abusive relationships for 30\u002B years. Dr. Lalich has written and lectured extensively, has advised the international intelligence community on extremism and indoctrination, and has served as consultant and expert witness in civil and criminal cases.  In addition, Dr. Lalich is a cofounder of the Take Back Your Life Recovery program.  The Take Back Your Life Recovery program  is a collaborative effort between Dr. Janja Lalich, and two experienced mental-health professionals: Beth Matenaer, Licensed Professional Counselor and Sally Martin, Licensed Clinical Social Worker. They develop and facilitate psychoeducational interactive sessions and practical healing tools for survivors of cults or other types of closed or extremist groups, coercive and high-demand environments, and destructive and controlling relationships. The aim of the program is to provide the information and resources our clients need to effectively heal from a variety of harmful and/or traumatic personal experiences. Additionally, they create course material and training sessions to educate and train helping professionals to better assist such clients.Visit https://janjalalich.com  to find out more about Dr. Lalich.  You can also follow her on twitter or instagramhttps://twitter.com/Janja_Lalich https://twitter.com/TBYLRhttps://www.instagram.com/janja_lalich/Books by Dr. Lalich:Escaping Utopia: Growing Up in a Cult, Getting Out, and Starting Over, 2017Take Back Your Life, 2006Bounded Choice, 2004Crazy Therapies, 1996Cults In Our Midst, 1995Captive Hearts, Captive Minds, 1994Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-15T00:00:00",
      "duration": "00:28:05.2630000",
      "explicit": false,
      "spotifyId": "47yLvhNFC0l9Za0CAo14Y4",
      "appleId": 1000557672176,
      "subjects": [
        "Cult-Expert",
        "Human Trafficking",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/47yLvhNFC0l9Za0CAo14Y4",
        "apple": "https://podcasts.apple.com/podcast/take-back-your-life-conversation-with-renowned-cult/id1597681412?i=1000557672176"
      }
    },
    {
      "id": "ede717a4-671e-4933-b277-15262da40256",
      "title": "Bounded Reality: Conversation with Renowned Cult Expert, Dr. Janja Lalich (pt II)",
      "description": "In the second part of our conversation with Dr. Lalich, she gives us her take on what are the makings of a cult and if the ICOC, as Aldo recalls his experience, can be considered a cult.Dr. Lalich is a world-renowned expert in cultic studies. She is the auuthor and co-author of several critically acclaimed books on cults. She is an avid contributor to the field of cultic studies through her research, presentations, articles, and documentaries.  Janja Lalich, Ph.D. is a researcher, author, and educator specializing in self-sealing, or closed, systems (cults, human trafficking, situations of coercive influence and control, ideological extremism), with a particular focus on recruitment, indoctrination, and methods of influence and control. She is Professor Emerita of Sociology at California State University, Chico and has been studying the social psychology of controversial groups and exploitative and abusive relationships for 30\u002B years. Dr. Lalich has written and lectured extensively, has advised the international intelligence community on extremism and indoctrination, and has served as consultant and expert witness in civil and criminal cases.  In addition, Dr. Lalich is a cofounder of the Take Back Your Life Recovery program.  The Take Back Your Life Recovery program  is a collaborative effort between Dr. Janja Lalich, and two experienced mental-health professionals: Beth Matenaer, Licensed Professional Counselor and Sally Martin, Licensed Clinical Social Worker. They develop and facilitate psychoeducational interactive sessions and practical healing tools for survivors of cults or other types of closed or extremist groups, coercive and high-demand environments, and destructive and controlling relationships. The aim of the program is to provide the information and resources our clients need to effectively heal from a variety of harmful and/or traumatic personal experiences. Additionally, they create course material and training sessions to educate and train helping professionals to better assist such clients.Visit https://janjalalich.com  to find out more about Dr. Lalich.You can also follow her on twitter or instagramhttps://twitter.com/Janja_Lalich https://twitter.com/TBYLRhttps://www.instagram.com/janja_lalich/Books by Dr. Lalich:Escaping Utopia: Growing Up in a Cult, Getting Out, and Starting Over, 2017Take Back Your Life, 2006Bounded Choice, 2004Crazy Therapies, 1996Cults In Our Midst, 1995Captive Hearts, Captive Minds, 1994Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-13T00:00:00",
      "duration": "00:26:36.5770000",
      "explicit": false,
      "spotifyId": "359CYWPSwzYUARTjPl6mCI",
      "appleId": 1000557430479,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/359CYWPSwzYUARTjPl6mCI",
        "apple": "https://podcasts.apple.com/podcast/bounded-reality-conversation-with-renowned-cult-expert/id1597681412?i=1000557430479"
      }
    },
    {
      "id": "9d54a2eb-e352-4d3a-b126-ad51bac60ba2",
      "title": "A Cult Experience: Conversation with Renowned Cult Expert, Dr. Janja Lalich (pt I)",
      "description": "In this episode we meet Dr. Janja Lalich as she gives us her take on cults, cult experiences, the ICOC, and her personal experience with being in a cult herself.Dr. Lalich is a world-renowned expert in cultic studies and an American sociologist.  She is the auuthor and co-author of several critically acclaimed books on cults. She is an avid contributor to the field of cultic studies through her research, presentations, articles, and documentaries.  Janja Lalich, Ph.D. is a researcher, author, and educator specializing in self-sealing, or closed, systems (cults, human trafficking, situations of coercive influence and control, ideological extremism), with a particular focus on recruitment, indoctrination, and methods of influence and control. She is Professor Emerita of Sociology at California State University, Chico and has been studying the social psychology of controversial groups and exploitative and abusive relationships for 30\u002B years. Dr. Lalich has written and lectured extensively, has advised the international intelligence community on extremism and indoctrination, and has served as consultant and expert witness in civil and criminal cases.  In addition, Dr. Lalich is a cofounder of the Take Back Your Life Recovery program.  The Take Back Your Life Recovery program  is a collaborative effort between Dr. Janja Lalich, and two experienced mental-health professionals: Beth Matenaer, Licensed Professional Counselor and Sally Martin, Licensed Clinical Social Worker. They develop and facilitate psychoeducational interactive sessions and practical healing tools for survivors of cults or other types of closed or extremist groups, coercive and high-demand environments, and destructive and controlling relationships. The aim of the program is to provide the information and resources our clients need to effectively heal from a variety of harmful and/or traumatic personal experiences. Additionally, they create course material and training sessions to educate and train helping professionals to better assist such clients.Visit https://janjalalich.com  to find out more about Dr. Lalich. You can also follow her on twitter or instagramhttps://twitter.com/Janja_Lalich https://twitter.com/TBYLRhttps://www.instagram.com/janja_lalich/Books by Dr. Lalich:Escaping Utopia: Growing Up in a Cult, Getting Out, and Starting Over, 2017Take Back Your Life, 2006Bounded Choice, 2004Crazy Therapies, 1996Cults In Our Midst, 1995Captive Hearts, Captive Minds, 1994Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-10T00:00:00",
      "duration": "00:24:25.3380000",
      "explicit": false,
      "spotifyId": "4eWxmauYiEMMENL3kcVB8u",
      "appleId": 1000556850876,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4eWxmauYiEMMENL3kcVB8u",
        "apple": "https://podcasts.apple.com/podcast/a-cult-experience-conversation-with-renowned-cult/id1597681412?i=1000556850876"
      }
    },
    {
      "id": "f9d6eec9-f834-4353-88b0-2563c772b3e2",
      "title": "London Has Fallen: Conversation with the Man Who Revealed \u0022The Letter\u0022",
      "description": "As chance would have it, we had the fortuitous opportunity to speak with Matthew this week.  Matthew was a member of the London Church of Christ and is the man that leaked the letter in February of 2003.  Because this conversation sprung up so suddenly, and helps us to explain the story of this letter and its effects even further, we thought that it was necessary to make it available to our audience as soon as possible.  Therefore, it’s being released today, April 9, 2022, unexpectedly, unscheduled, and in its entirety.  Matthew describes an upheaval that was birthed in the United Kingdom.  He describes a people who were beginning to voice their frustrations with the church until those voices became a collective. Until that collective became fuel for the creation of a letter.  Until the letter was prematurely released and reset the trajectory of the organization.  In February 2003 Matthew stood up for himself.  He stood up for the people.  He stood up to the International Church of Christ.  On behalf of thousands of people around the globe, we thank you Matthew.  \u0022Honest To God\u0022 by Henry Kriete       http://www.reveal.org/library/stories/people/hkriete.htmWARNINGSome of the content of this episode deals with suicide.  If you or someone you know is having suicidal thoughts or ideations, please know that support is available through the National Suicide Prevention Lifeline. or call 1-800-273-TALK  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-09T00:00:00",
      "duration": "01:01:18.0930000",
      "explicit": true,
      "spotifyId": "1ajss09zpRK2WLPhDibsrg",
      "appleId": 1000556740642,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ajss09zpRK2WLPhDibsrg",
        "apple": "https://podcasts.apple.com/podcast/london-has-fallen-conversation-with-the-man-who/id1597681412?i=1000556740642"
      }
    },
    {
      "id": "e05a60e7-09c9-4533-987b-14c500e382e8",
      "title": "The Letter: A Tale of Two Cities (New York)",
      "description": "Today we meet Del from New York.  He gives us his accounts, as he remembers them, of that time.  As the effects of \u0022The Letter\u0022 became more and more widespread,  the New York City church began to feel the effects as well.  The church became a shell of itself.  Membership declined.  Attendance declined.  Monetary contribution declined.  There were regular everyday members of the church rebelling against the teachings and directions of the leaders.  Many people began to question their place in the church and question their involvement with the church.  Many members challenged leaders verbally and even confronted them in person.  Many of the church leaders left.   According to Del from New York, \u0022things would never be the same.\u0022    Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-08T00:00:00",
      "duration": "00:26:01.9390000",
      "explicit": false,
      "spotifyId": "3iop7rUriqQs8AnrAnfnlb",
      "appleId": 1000556607681,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3iop7rUriqQs8AnrAnfnlb",
        "apple": "https://podcasts.apple.com/podcast/the-letter-a-tale-of-two-cities-new-york/id1597681412?i=1000556607681"
      }
    },
    {
      "id": "6725d2cc-6f75-494a-9ed7-a555266f7306",
      "title": "The Letter: A Tale of Two Cities (London)",
      "description": "Today we meet Del from London.  Del was a disciple in the London church for several years.  \u0022The Letter\u0022 originated in England and began to wreck havoc on the structure and culture of the London Church.   As the ramifications of \u0022The Letter\u0022 reached different parts and regions, the church decided to send a leader to London in attempts to quell the uproar.  There was a leaders meeting in East London, where the letter was addressed.  According to Del \u0022that was the moment when the London Church changed.\u0022  Del was at this meeting and recounts the events of that day for us.  For the record, the order of events are not necessarily told in sequential order, but the spirit and sentiment of the auditorium is captured in Del\u0027s recollection of the events.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-06T00:00:00",
      "duration": "00:25:21.9720000",
      "explicit": false,
      "spotifyId": "0CNsuPDaevI30GKTGz6HTI",
      "appleId": 1000556375514,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CNsuPDaevI30GKTGz6HTI",
        "apple": "https://podcasts.apple.com/podcast/the-letter-a-tale-of-two-cities-london/id1597681412?i=1000556375514"
      }
    },
    {
      "id": "9b33e40d-4787-4231-b0a7-99fe39a3c7d9",
      "title": "For The People",
      "description": "In the Season 2 opener,  Eddie and Aldo pick up where they left off.  Season 2 of The Reclamation Podcast is all about what life was like as a member of the ICOC; why people have left the ICOC;  what life is like after leaving the ICOC.  Cousin Eddie and Aldo B. Martin bring their style of light hearted conversation to a potentially heavy topic.  The duo recap their thoughts on season 1, but then begin to discuss “the letter.”  The Henry Kriete Letter of 2003 set the International Church of Christ off of its axis and trajectory, temporarily.  The Letter had ramifications in different parts of the church all over the world.  Aldo tells Cousin Eddie about some of those immediate ramifications that he witnessed at that time.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-04-03T00:00:00",
      "duration": "00:21:32.9560000",
      "explicit": false,
      "spotifyId": "3rDDrMqM8ZWcXuTUejjjCk",
      "appleId": 1000556062530,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rDDrMqM8ZWcXuTUejjjCk",
        "apple": "https://podcasts.apple.com/podcast/for-the-people/id1597681412?i=1000556062530"
      }
    },
    {
      "id": "9310407f-eb6a-4db5-a4a4-84081941ae27",
      "title": "Season 2 Trailer",
      "description": "Season 2 premiers on April 3, 2022Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-03-09T00:00:00",
      "duration": "00:03:59.3070000",
      "explicit": false,
      "spotifyId": "6selYY7IFDK13pAAtDApDL",
      "appleId": 1000553397738,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6selYY7IFDK13pAAtDApDL",
        "apple": "https://podcasts.apple.com/podcast/season-2-trailer/id1597681412?i=1000553397738"
      }
    },
    {
      "id": "48132080-64e8-4f8e-ad48-dd4345aaa819",
      "title": "Episode 15 - Season 1 Finale - The Reunion",
      "description": "Dr. Melton, Liz, Christina, Elena from 3B, Cousin Eddie, and Aldo reunite and converse about the season that was.  Join us as we discuss the importance of honesty, self awareness, and the importance of forgiving your self.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-03-06T00:00:00",
      "duration": "01:00:00.8220000",
      "explicit": false,
      "spotifyId": "0Yg4fcHUwTdCykxq2XXFnP",
      "appleId": 1000553051443,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Yg4fcHUwTdCykxq2XXFnP",
        "apple": "https://podcasts.apple.com/podcast/episode-15-season-1-finale-the-reunion/id1597681412?i=1000553051443"
      }
    },
    {
      "id": "f76c9345-d200-45ce-8b5d-447aab539514",
      "title": "Unpacking Episode 14 with Elena from 3B",
      "description": "In Elena\u0027s final recap, she tells us her thoughts on Christina\u0027s episode.  Elena also shares with us her final thoughts on her opinions regarding this organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-03-02T00:00:00",
      "duration": "00:20:24.5940000",
      "explicit": false,
      "spotifyId": "2iHkcWh1v2IprFphuWjozq",
      "appleId": 1000552655208,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2iHkcWh1v2IprFphuWjozq",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-14-with-elena-from-3b/id1597681412?i=1000552655208"
      }
    },
    {
      "id": "3c2647d7-a1b4-4963-b6c4-251d58d6d3d4",
      "title": "Episode 14 - My Perspective - Conversation with Christina (pt III)",
      "description": "In our conclusion with Christina, she and Aldo discuss topics that they feel remorseful about regarding this cultish experience.  Christina and Cousin Eddie discuss how the various iterations of this organization are reminiscent of George Orwell\u0027s \u0022Animal Farm.\u0022  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-02-27T00:00:00",
      "duration": "00:26:14.0600000",
      "explicit": false,
      "spotifyId": "1o7bZWsaHRq7vqZ9WOW4Ub",
      "appleId": 1000552332204,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1o7bZWsaHRq7vqZ9WOW4Ub",
        "apple": "https://podcasts.apple.com/podcast/episode-14-my-perspective-conversation-with-christina/id1597681412?i=1000552332204"
      }
    },
    {
      "id": "9ecf71e6-7f42-4519-86fe-51a5c8d899d5",
      "title": "Unpacking Episode 13 with Elena from 3B",
      "description": "Elena from 3B discusses how Christina\u0027s most recent episode brings her back to when she left the church.  Elena begins to tell us about what made her finally leave after 9 years of being with the organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-02-23T00:00:00",
      "duration": "00:18:28.6620000",
      "explicit": false,
      "spotifyId": "2MWhtEQVSNTv9IgrOa9U3v",
      "appleId": 1000551958758,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2MWhtEQVSNTv9IgrOa9U3v",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-13-with-elena-from-3b/id1597681412?i=1000551958758"
      }
    },
    {
      "id": "342baeb5-7208-4d2a-8273-56fbe8452bc5",
      "title": "Episode 13 - Do You Regret Any of It? - Conversation with Christina pt II",
      "description": "Being part of a community was a huge factor in Christina joining and staying with the organization.  Christina, Cousin Eddie and Aldo discuss how the church had created its own sub-culture that enabled the church to create such a community.  Members of the church were under a lot of pressure to recruit new converts on a daily basis.  Despite it all, Christina discusses how maintaining and establishing relationships with her friends in the church helped her to maintain a sense of normalcy.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-02-20T00:00:00",
      "duration": "00:26:10.0890000",
      "explicit": false,
      "spotifyId": "3zJ7JIa3sFyDRryQ8fkUQd",
      "appleId": 1000551648410,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zJ7JIa3sFyDRryQ8fkUQd",
        "apple": "https://podcasts.apple.com/podcast/episode-13-do-you-regret-any-of-it-conversation/id1597681412?i=1000551648410"
      }
    },
    {
      "id": "4cdafef6-958d-4b3a-9ff7-63f8e3f7f461",
      "title": "Unpacking Episode 12 with Elena from 3B",
      "description": "Join Elena and Aldo as they sit down and discuss Christina\u0027s first episode. Shout out to the $2 move theater and more!Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-02-16T00:00:00",
      "duration": "00:20:18.5330000",
      "explicit": false,
      "spotifyId": "7mHS7AgFI3y3FrwB4sbagm",
      "appleId": 1000551239826,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7mHS7AgFI3y3FrwB4sbagm",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-12-with-elena-from-3b/id1597681412?i=1000551239826"
      }
    },
    {
      "id": "9004f3c6-40cf-48cc-a68c-2b4f634492e6",
      "title": "Episode 12: I Was Looking For A Friend Group; Conversation with Christina (pt I)",
      "description": "In this episode we meet Christina.  Like the guests before her, she too came to New York City in pursuit of academic dreams.  While in NYC she came across a group of people that met her need of wanting to be a part of a friend group in this new city that she called home, for the time being.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-02-13T00:00:00",
      "duration": "00:22:32.3850000",
      "explicit": false,
      "spotifyId": "0fHvju8r0AiKJvzScKRJ6v",
      "appleId": 1000550919167,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fHvju8r0AiKJvzScKRJ6v",
        "apple": "https://podcasts.apple.com/podcast/episode-12-i-was-looking-for-a-friend-group/id1597681412?i=1000550919167"
      }
    },
    {
      "id": "72b859d6-325c-4cf1-a416-2541c310ff78",
      "title": "Unpacking Episode 11 with Elena from 3B",
      "description": "Elena from 3B gives her insight and thoughts to this past weeks episode.  Join Aldo and Elena as they discuss DPI books, getting restored, and other terms used by the ICOCSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-02-09T00:00:00",
      "duration": "00:20:20.4400000",
      "explicit": false,
      "spotifyId": "48UEwdJND5KWFcK2JDZhMs",
      "appleId": 1000550516278,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/48UEwdJND5KWFcK2JDZhMs",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-11-with-elena-from-3b/id1597681412?i=1000550516278"
      }
    },
    {
      "id": "2e727036-952d-403f-a353-53f8fbe66036",
      "title": "Episode 11: Not Much Different From a Corporation or a Gang...",
      "description": "Conversation with Aldo (pt 5 of 5)This is the fifth part of the conversation between Cousin Eddie and Aldo.  In this episode Aldo and Eddie discuss how the corporate structure of the church held its membership busy, occupied, and in accordance with the methods of the church.  Meanwhile, the appeal of the church to some outsiders was the same as the allure of a gang in some regards.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-02-06T00:00:00",
      "duration": "00:19:57.8970000",
      "explicit": false,
      "spotifyId": "1CDI3XEZ3zCqK9xylJUchc",
      "appleId": 1000550187744,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1CDI3XEZ3zCqK9xylJUchc",
        "apple": "https://podcasts.apple.com/podcast/episode-11-not-much-different-from-a-corporation-or-a-gang/id1597681412?i=1000550187744"
      }
    },
    {
      "id": "1b6922f3-9539-47f5-b1f2-c2801882f92f",
      "title": "Unpacking Episode 10 with Elena from 3B",
      "description": "Elena and Aldo recap episode 10 by discussing the topic of mental health.  Aldo tells Elena and the audience about his battle with depression and how being kicked out of the church made his battle with depression even more difficult.  Join them for honest conversation, reflection, laughs, and the occasional \u0022shout out.\u0022Depression affects the lives of many people.  Please use the resources listed below if you are in need of support:https://www.psychologytoday.com/ushttps://www.inclusivetherapists.comhttps://suicidepreventionlifeline.orgSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-02-02T00:00:00",
      "duration": "00:22:01.1950000",
      "explicit": false,
      "spotifyId": "7djnfobqedz8FHfHm3CZaZ",
      "appleId": 1000549736295,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7djnfobqedz8FHfHm3CZaZ",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-10-with-elena-from-3b/id1597681412?i=1000549736295"
      }
    },
    {
      "id": "7d5d6126-ac29-4856-9f9c-b71c2c66e5a8",
      "title": "Episode 10: \u0022What Was Your Level of Commitment?\u0022 Conversation with Liz, pt III",
      "description": "(pt 2 of 3)In the final installment of our conversation with Liz, she explains why she left the organization and how she began to make sense of life and herself in the aftermath of leaving the organization .  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-30T00:00:00",
      "duration": "00:25:29.2340000",
      "explicit": false,
      "spotifyId": "46CQpiro7aRxkyWKGfbqJl",
      "appleId": 1000549407090,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/46CQpiro7aRxkyWKGfbqJl",
        "apple": "https://podcasts.apple.com/podcast/episode-10-what-was-your-level-of-commitment/id1597681412?i=1000549407090"
      }
    },
    {
      "id": "4b30f3f3-e913-4753-8967-03585a9c7421",
      "title": "Unpacking Episode 9 with Elena from 3B",
      "description": "Elena sits down with us, as she usually does, to expound on topics that Liz brought up, such as dating in the church,  and the concept of being \u0022sharp.\u0022Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-26T00:00:00",
      "duration": "00:23:18.4650000",
      "explicit": true,
      "spotifyId": "6lkpxX3B6tj6jklV1GfcKs",
      "appleId": 1000549019212,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6lkpxX3B6tj6jklV1GfcKs",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-9-with-elena-from-3b/id1597681412?i=1000549019212"
      }
    },
    {
      "id": "37504e8e-dc82-4e4e-b047-815171427ce5",
      "title": "Episode 9 - \u0022Yeah, But...Are They Sharp?\u0022 - Conversation with Liz, pt II",
      "description": "(pt 2 of 3)We continue our discussion with Liz as she begins to tell us what the church defined as \u0022a sharp person\u0022 and how this definition played a role in the recruitment tactics of the organization. Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-23T00:00:00",
      "duration": "00:23:00.6230000",
      "explicit": false,
      "spotifyId": "5mXbfVfIyj5YjSLoEqBpUP",
      "appleId": 1000548703718,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5mXbfVfIyj5YjSLoEqBpUP",
        "apple": "https://podcasts.apple.com/podcast/episode-9-yeah-but-are-they-sharp-conversation-with-liz-pt-ii/id1597681412?i=1000548703718"
      }
    },
    {
      "id": "5b92ea8d-038d-404d-9f9a-f4676870c24d",
      "title": "Unpacking Episode 8 with Elena from 3B",
      "description": "Elena from 3B sits down with us to give her views on this weeks past episode.  Elena discusses topics such as purity culture as it pertains to the organization,  Buzzsprout - Let\u0027s get your podcast launched! Start for FREEDisclaimer: This post contains affiliate links. If you make a purchase, I may receive a commission at no extra cost to you.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-19T00:00:00",
      "duration": "00:25:05.4620000",
      "explicit": false,
      "spotifyId": "3jGoi5FotCkw6yo7dYJAaO",
      "appleId": 1000548310067,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3jGoi5FotCkw6yo7dYJAaO",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-8-with-elena-from-3b/id1597681412?i=1000548310067"
      }
    },
    {
      "id": "06b554ea-b729-4bb1-b5bd-b5ae4d4e5a07",
      "title": "Episode 8 - Conversation with Liz (pt I)",
      "description": "(pt 1 of 3)Today we meet Liz Lang who was a member of the organization for close to 10 years.  She was introduced to the church at 6 years old and became a member at the age of 14.  Join us as we welcome Liz to the expanding collective of the Voices of The Reclamation.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-16T00:00:00",
      "duration": "00:25:15.4150000",
      "explicit": false,
      "spotifyId": "3YKusHaEqRLHk1B8kEMSw2",
      "appleId": 1000548001057,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3YKusHaEqRLHk1B8kEMSw2",
        "apple": "https://podcasts.apple.com/podcast/episode-8-conversation-with-liz-pt-i/id1597681412?i=1000548001057"
      }
    },
    {
      "id": "c776c991-76e1-44ba-a8e1-03761755621b",
      "title": "Unpacking Episode 7 with Elena from 3B",
      "description": "Elena from 3B joins us as she shares with us her thoughts on episode 7.  Aldo and Cousin Eddie brought up the idea of the \u0022con man\u0022 and this subject triggered Elena to discuss the early days of her recruitment as a 12-13 year old girl.  Join us for some laughs and conversation with Elena from 3B.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-12T00:00:00",
      "duration": "00:21:03.2290000",
      "explicit": false,
      "spotifyId": "2GkFwLF13vHX6g9wnbVgBF",
      "appleId": 1000547626065,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GkFwLF13vHX6g9wnbVgBF",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-7-with-elena-from-3b/id1597681412?i=1000547626065"
      }
    },
    {
      "id": "47e71212-eff1-491c-aee4-b3bba63de905",
      "title": "Episode 7: \u0022I Thought I Was Ready To Answer That\u0022",
      "description": "(conversation with Aldo pt 4 of 5)Aldo and Cousin Eddie discuss how the public perceives religious cult members.   The two also discuss recent examples of religious cults and how those examples reinforce the negative perception that the public has about cult members.  Aldo then tells Eddie why this conversation about religious cults is important to him.Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-09T00:00:00",
      "duration": "00:24:06.2950000",
      "explicit": false,
      "spotifyId": "4B9hg9ooAesdwS2Psr2Wze",
      "appleId": 1000547311346,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4B9hg9ooAesdwS2Psr2Wze",
        "apple": "https://podcasts.apple.com/podcast/episode-7-i-thought-i-was-ready-to-answer-that/id1597681412?i=1000547311346"
      }
    },
    {
      "id": "c8c3206d-6e8c-42a8-9752-5e35b6092c7f",
      "title": "Unpacking Episode 6 with Elena from 3B",
      "description": "Prayer nights and separatism.  Join us as Elena from 3B recounts her thoughts on the 3rd part of our interview with Dr. Melton.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-05T00:00:00",
      "duration": "00:22:18.0170000",
      "explicit": false,
      "spotifyId": "2B0sATgV16dccEMs82MyJy",
      "appleId": 1000546968312,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2B0sATgV16dccEMs82MyJy",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-6-with-elena-from-3b/id1597681412?i=1000546968312"
      }
    },
    {
      "id": "04a00730-515e-49bb-a0fd-45086600983e",
      "title": "Episode 6 - The Full Range of Humanity - Conversation with Dr. Melton pt III",
      "description": "We conclude our conversation with Dr. Melton as she begins to tell the beginning of what made he want to leave the organization.   Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2022-01-02T00:00:00",
      "duration": "00:20:15.6600000",
      "explicit": false,
      "spotifyId": "0SlvSGJ4qz96KGxbsIiUe6",
      "appleId": 1000546686096,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0SlvSGJ4qz96KGxbsIiUe6",
        "apple": "https://podcasts.apple.com/podcast/episode-6-the-full-range-of-humanity-conversation/id1597681412?i=1000546686096"
      }
    },
    {
      "id": "2ae2a858-87ca-4839-918a-24e446984ee4",
      "title": "Unpacking Episode 5 with Elena from 3B",
      "description": "Elena from 3B gives her thoughts on episode 5.  She describes how the interview with Dr. Melton resonated with her in terms of forging relationships with fellow church members and how the church played a roll in her mental health.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2021-12-29T00:00:00",
      "duration": "00:19:29.6060000",
      "explicit": false,
      "spotifyId": "0duNXVJssK1yRHrbOJp67j",
      "appleId": 1000546390790,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0duNXVJssK1yRHrbOJp67j",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-5-with-elena-from-3b/id1597681412?i=1000546390790"
      }
    },
    {
      "id": "2f66e656-f84e-4550-85cc-43c624355f70",
      "title": "Episode 5 - Bodies in the Seats - Conversation with Dr. Melton pt II",
      "description": "Our conversation with Dr. Melton continues as she now begins to describe how she was introduced to the organization and gives reason for why she joined.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2021-12-26T00:00:00",
      "duration": "00:25:05.4620000",
      "explicit": false,
      "spotifyId": "6fbjpfXG7ClaPULUT9b4zs",
      "appleId": 1000546122732,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6fbjpfXG7ClaPULUT9b4zs",
        "apple": "https://podcasts.apple.com/podcast/episode-5-bodies-in-the-seats-conversation-with-dr/id1597681412?i=1000546122732"
      }
    },
    {
      "id": "a510d189-aeac-4f0b-b9ff-391a5b6aff43",
      "title": "Unpacking Episode 4 with Elena from 3B",
      "description": "Elena from 3B  and Aldo sit down to recap and discuss episode 4.  Join us as Elena, also a former member, shares her thoughts.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2021-12-22T00:00:00",
      "duration": "00:18:15.8880000",
      "explicit": false,
      "spotifyId": "7KIVNsGUdTzQCMwKt9zbQJ",
      "appleId": 1000545734860,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KIVNsGUdTzQCMwKt9zbQJ",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-4-with-elena-from-3b/id1597681412?i=1000545734860"
      }
    },
    {
      "id": "ddb09aa3-9b79-4603-b3af-4a7c1ddf2166",
      "title": "Episode 4 - Conversation with Dr. Melton, pt I",
      "description": "Part 1Dr. Michelle Melton is a clinical psychologist in Pheonix, Arizona.  With more than 12 years of experience, she specializes mood disorders, anxiety, and coping skills.However, before her established career as a psychologist, Dr. Melton was a part of an organization that many deem to be a cult, cult like, or a high control organization.  Her story is a complicated one as it reveals how a young college student can become engulfed in such an organization.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2021-12-19T00:00:00",
      "duration": "00:26:28.4270000",
      "explicit": false,
      "spotifyId": "6arZ51z5xH0WAhAomE2RDE",
      "appleId": 1000545396629,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6arZ51z5xH0WAhAomE2RDE",
        "apple": "https://podcasts.apple.com/podcast/episode-4-conversation-with-dr-melton-pt-i/id1597681412?i=1000545396629"
      }
    },
    {
      "id": "01d0b1ff-7de8-42c4-8aa6-9598c5523afa",
      "title": "Unpacking Episode 3 with Elena from 3B",
      "description": "Aldo speaks with former ICOC member, Elena, about her reaction to episode 3.  Listen as Elena recounts how the discussion and topics brought up in episode 3, jogged her memory about her time in the church.  Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2021-12-14T00:00:00",
      "duration": "00:18:18.2920000",
      "explicit": false,
      "spotifyId": "3WT4F4o7eO5Pzwr2Fm4uU7",
      "appleId": 1000544878658,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WT4F4o7eO5Pzwr2Fm4uU7",
        "apple": "https://podcasts.apple.com/podcast/unpacking-episode-3-with-elena-from-3b/id1597681412?i=1000544878658"
      }
    },
    {
      "id": "112cfaa6-6992-4739-be2f-cf4fa2431ed2",
      "title": "Episode 3: \u0022Your Social Life Revolves Around this Church\u0022",
      "description": "(conversation with Aldo pt 3 of 5)Hosts Aldo Martin and Cousin Eddie continue with the third part of their conversation about how Aldo got drawn into a religious cult.  Aldo discusses how the church seemed like such a wonderful place to be as it helped him find happiness, acceptance and  fulfillment.  However, this happiness, acceptance, and fulfillment came at a cost.  It would cost him all of his time, that he willingly and happily gave.   https://www.buymeacoffee.com/aldobmartinSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2021-12-12T00:00:00",
      "duration": "00:22:48.7900000",
      "explicit": false,
      "spotifyId": "5Cl2Jy8rgZrTfMllzNyXKb",
      "appleId": 1000544694305,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Cl2Jy8rgZrTfMllzNyXKb",
        "apple": "https://podcasts.apple.com/podcast/episode-3-your-social-life-revolves-around-this-church/id1597681412?i=1000544694305"
      }
    },
    {
      "id": "848b5623-a066-4179-8db3-54b61170f838",
      "title": "Episode 2: \u0022The Beginning of the Rest of My Life\u0022",
      "description": "(conversation with Aldo pt 2 of 5)Picking up from where they left off, former cult member, Aldo Martin, recounts to Cousin Eddie his first visit to what he now regards as a religious cult.  The scene was filled with an attractive and happy variety of people who represented \u0022all nations.\u0022   https://www.buymeacoffee.com/aldobmartinSupport the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2021-12-05T00:00:00",
      "duration": "00:22:57.6710000",
      "explicit": false,
      "spotifyId": "4WZC7IHChBc59uxLowxfaE",
      "appleId": 1000543977816,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4WZC7IHChBc59uxLowxfaE",
        "apple": "https://podcasts.apple.com/podcast/episode-2-the-beginning-of-the-rest-of-my-life/id1597681412?i=1000543977816"
      }
    },
    {
      "id": "096704fe-a1a1-45c8-8449-7e782af0200a",
      "title": "Episode 1: The Making of a Cult Member",
      "description": "(conversation with Aldo pt. 1 of 5)How does one become a cult member?  Hosts, Aldo B.  Martin and Cousin Eddie attempt to answer such a question through conversation.  Aldo shares about his background with mental health struggles and how those struggles lended to his being prime for indoctrination.  Meanwhile, Eddie is hearing this information for the first time.  Support the Show: https://www.buymeacoffee.com/aldobmartin Support the showStay updated on Aldo\u0027s current and future projects by signing up for his NewsletterOther Podcasts by Aldo B. Martin:Finding James Baldwin: The Magpie YearsJammin\u0027 on the One The Fatherhood Project YALD. The PodcastSo...Tell Me About Your PodcastTo get in touch with Aldo, you can find him on Twitter, Instagram, or Facebook",
      "release": "2021-11-29T00:00:00",
      "duration": "00:18:34.8010000",
      "explicit": false,
      "spotifyId": "5QwJnIWfoCKQwHWvP3gJqN",
      "appleId": 1000543318454,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5QwJnIWfoCKQwHWvP3gJqN",
        "apple": "https://podcasts.apple.com/podcast/episode-1-the-making-of-a-cult-member/id1597681412?i=1000543318454"
      }
    }
  ]
}