{
  "id": "a2757378-9785-44df-bc1c-4e94a42b3eed",
  "name": "Alison Hammond\u0027s Big Weekend",
  "episodes": [
    {
      "id": "7f754cef-a0d6-4371-8690-5066cfbb59d1",
      "title": "Series 1: 3. Luke Evans",
      "description": "Alison Hammond spends an unforgettable weekend with Hollywood star Luke Evans, offering an intimate and candid glimpse into the actor’s life. \n\nExpecting a trip to glamorous Los Angeles, Alison instead finds herself heading to snowy Wales. Their adventure begins at an equestrian centre, where Luke quite literally sweeps her off her feet and onto a horse. The centre holds special meaning for Luke, as he fondly recalls visiting it with his parents during childhood. Before Alison can saddle up, she undergoes a training session on a mechanical horse. Luke, unsurprisingly, is a natural, while Alison regrets not wearing a sports bra, but manages to stay on – just! Afterwards, Luke shares stories about his Hollywood career, including his love for performing stunts, revealing that he had to leap onto a moving horse for his role in Beauty and the Beast. Despite being a novice, Alison earns a rosette for her efforts, to Luke’s dismay. \n\nThe duo travel next to Aberbargoed to meet Luke’s parents, David and Yvonne. Along the way, Luke opens up about being severely bullied as a child for being gay. He admits he kept this from his parents, who are practicing Jehovah\u0027s Witnesses, fearing their reaction. At his parents\u0027 home, Alison meets Yvonne and David, who share heartfelt memories of Luke’s childhood. Luke even plays Alison some never-before-heard audio recordings of himself as a young boy. Yvonne beams with pride over Luke’s achievements, admiring how grounded he has remained despite his success. \n\nLuke takes Alison to his childhood bedroom, where he reflects on the difficulties of growing up. Despite his parents’ belief that he had a happy childhood, Luke reveals he often felt isolated due to bullying. Unable to confide in anyone, he sought help from a psychologist at the age of 14 but couldn’t afford the sessions. Luke speaks openly about the internal conflict of being raised as a Jehovah\u0027s Witness while struggling with his sexuality, admitting that during his teenage years, he contemplated suicide. Fortunately, his determination to live and pursue his dreams pulled him through. \n\nThe weekend continues with a visit to Castell Coch, where Luke introduces Alison to his former singing teacher, Louise Ryan. Louise not only taught Luke but also worked with another Welsh singing sensation, Charlotte Church. After some vocal exercises, Luke moves Alison with an emotional performance of Bring Him Home from Les Miserables. \n\nThe next day, the duo shift gears – literally – by trying their hand at drifting. Alison surprises Luke with her driving skills, and when it’s his turn, he thrills her with an adrenaline-fuelled spin. \n\nThe weekend concludes at Luke’s London home, where Alison meets his long-term partner, Fran. On the way, Luke reflects on his happiness with Fran, admitting he kissed a lot of frogs before finding him. Alison playfully quizzes the couple about marriage, leaving Luke embarrassed. The pair admit that they’d like to get a dog first and always send each other dog videos. \n\nInside Luke’s flat, he proudly shows Alison his collection of swords from his films Dracula and The Hobbit. As the weekend winds down, Luke expresses pride in his journey, marvelling at the goals he’s achieved beyond his wildest dreams. Alison wraps up by thanking Luke for an incredible and heartwarming weekend.",
      "release": "2025-05-16T00:00:00",
      "duration": "00:29:00",
      "explicit": false,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "bbc": "https://www.bbc.co.uk/iplayer/episode/m002c5z9/alison-hammonds-big-weekend-series-1-3-luke-evans"
      }
    }
  ]
}