{
  "id": "df647507-ab6f-4a96-b7d5-2e803fc416ea",
  "name": "All Things Parking with Dani \u0026 John",
  "youTubeChannelId": "UC6zR_FFxSZzirgBINPB81PQ",
  "episodes": [
    {
      "id": "3770175b-9cb3-417e-b1de-dfc1116810fc",
      "title": "Kendra Petty\u0027s Inspiring Journey: Surviving Trauma \u0026 Thriving in the Parking Industry",
      "description": "In this episode, John Conway, Dani Crain, and special guest Kendra Petty discuss Kendra\u0027s remarkable journey in the parking industry, her experiences with trauma and resilience, and her recently published memoir, \u0022I Can\u0027t Believe I\u0027m Not Dead.\u0022\n\nKendra Petty is an Executive Vice President at LAZ Parking with decades of parking industry experience. Having survived—and thrived—in male-dominated industries, she is a public speaker, negotiator, dealmaker, and author of “I Can’t Believe I’m Not Dead Yet.” She loves fast cars, traveling, bouldering, and scrambling. (For those who don’t know, bouldering is a form of rock climbing, and scrambling is a form of mountaineering.)\n\nIn this episode, guest Kendra Petty and hosts Dani Crain and John D. Conway get into:\n* How Kendra’s memoir changed her life. \n* The biggest story in Kendra’s book, which was extremely traumatic and affected her health for 12 years.\n* How Kendra got started in the parking industry, including her first company, Central Parking System, in Los Angeles.\n* How Kendra gets out of toxic situations (and you can, too). \n* Women in leadership roles in the parking industry. \n* LAZ Parking being the first woman-led company in the parking operations world. \n\nGet a free preview of Kendra’s memoir from her website: https://kendrapettyofficial.com/ \n\nBuy Kendra Petty’s memoir from Amazon: https://www.amazon.com/dp/1952491509\n\nThe full title of Kendra Petty’s memoir is: \u0022I Can\u0027t Believe I\u0027m Not Dead: Escaping Abuse, a Cult, Attempted Murder and Other Insanities...A Story That Cannot Be True, But Is.\u0022\n\nConnect with Kendra Petty on LinkedIn: https://www.linkedin.com/in/kendra-petty-0b872366/\n\nThis show is sponsored by Parking Revenue Recovery Services (PRRS), bringing you a new standard in parking compliance: https://www.parkingprrs.com/ \n\n\nConnect with the hosts:\n* http://www.parkingtalk.com  \n* Dani Crain - https://www.linkedin.com/in/dani-crain-3754a3178/ \n* John D. Conway - https://www.linkedin.com/in/john-d-conway-b55a7025/ \n* info@parkingtalk.com\n\nSubscribe, like, and follow: \n* Apple Podcasts - https://apple.co/44KScHB \n* Spotify - https://spoti.fi/3rKBJVn \n* Google Podcasts - https://bit.ly/Parking-Talk-Google-Podcasts \n* YouTube - https://bit.ly/Parking-Talk-YouTube \n* LinkedIn: https://www.linkedin.com/company/parkingtalk-com/ \n* Twitter: https://twitter.com/parkingtlk",
      "release": "2023-09-07T18:00:29Z",
      "duration": "00:53:34",
      "explicit": false,
      "youTubeId": "hwtxjiY27CQ",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hwtxjiY27CQ"
      }
    }
  ]
}