{
  "_ts": 0,
  "id": "7126abe9-db89-4923-b314-ef07bf7c99e8",
  "name": "All In All With Alex",
  "spotifyId": "4uy0RRSaOZuonnXpV8YGJo",
  "appleId": 1575698421,
  "youTubeChannelId": "UCYCE3hcGlcW_EA9o9P_gYbg",
  "episodes": [
    {
      "id": "2ca4778d-a8ef-45e2-be4f-c1f588a2054a",
      "title": "From Cult Survivor to Empowerment Guide: Isabella Young\u0027s Journey of Healing and Awakening",
      "description": "In this episode, host Alex speaks with Isabella Young, who shares her harrowing experience of escaping a cult and the subsequent challenges she faced. Isabella discusses her journey of healing, the importance of self-love, and the role of nature in her recovery. She also delves into the tactics used by cults and how they mirror larger societal manipulations, including fear-based mind control and the influence of technology. Isabella emphasizes the need for awareness and empowerment as humanity transitions into a higher vibrational state. In this conversation, Isabella Young shares her insights on the transition from a fear-based reality to a more enlightened existence. She discusses the signs of narcissistic abuse, the incurable nature of narcissism, and her personal journey from victimhood to empowerment. Isabella addresses common misconceptions about cult survivors and emphasizes the importance of self-love and intuition in the healing process. She concludes with a message of hope, encouraging listeners to stay positive and trust in the support of higher powers as humanity evolves.\n\nChapters\n\n00:00 Introduction to Isabella Young\u0027s Journey\n01:11 Escaping the Cult: A Personal Account\n06:39 Understanding Narcissism and Codependency\n09:54 Healing Through Nature and Self-Love\n10:16 The Inspiration Behind Her Books\n13:43 Identifying and Escaping Cult Programming\n18:50 Fear-Based Mind Control and Its Impacts\n26:54 The Role of Technology in Modern Control\n27:22 The Shift Towards a Higher Vibrational State\n32:11 Shifting Realities: Embracing a New Dimension\n32:46 Understanding Narcissistic Abuse\n38:14 The Incurable Nature of Narcissism\n41:22 From Victim to Survivor: A Journey of Healing\n43:54 Misconceptions About Cult Survivors\n47:17 Reconnecting with Intuition After Manipulation\n51:47 Finding Light in Darkness: A Message of Hope\n\nInterested in Mental Health Merch? Shop my store below\nhttps://allinallwithalex.printify.me/products\n\nFollow me on TikTok\nhttps://www.tiktok.com/@all.in.all.with.alex\n\nFollow my Facebook Page\nhttps://www.facebook.com/AllinAllwithAlex/\n\nListen to the Audio Version\nhttps://podcasters.spotify.com/pod/show/allinallwithalex\n\nSubscribe to my channel\nhttps://www.youtube.com/channel/UCYCE3hcGlcW_EA9o9P_gYbg?sub_confirmation=1\n\nListen on the radio below\nhttps://mytuner-radio.com/podcast/all-in-all-with-alex-alex-morris-1002081\n\nInterested in Music videos? Follow my videography channel\nhttps://www.youtube.com/c/TheVisualGoat?sub_confirmation=1\n\nWelcome to the All In All With Alex, your go-to resource for practical mental health tips, self-improvement strategies, and personal growth insights. In each episode, we explore topics like managing anxiety, overcoming depression, building self-confidence, developing healthy habits, and cultivating resilience. You\u0027ll hear from real mental health professionals, life coaches, and inspiring individuals who have overcome their own struggles.\n\nOur mission is to provide you with actionable advice, coping techniques, and empowering perspectives to help you live your best life. Whether you\u0027re dealing with a specific mental health challenge or simply want to level up your personal growth journey, this channel has something for you.\n\nJoin our community of like-minded individuals seeking to prioritize their well-being and unlock their full potential. Subscribe now to stay up-to-date on new episode releases, and let us know in the comments what mental health or self-improvement topics you\u0027d like us to cover.\n\nDon\u0027t go it alone on your journey towards better mental health and self-improvement. Tune in, get inspired, and start taking steps towards becoming the best version of yourself. Your growth and well-being are worth it!",
      "release": "2025-02-09T23:00:00Z",
      "duration": "00:53:46",
      "explicit": false,
      "spotifyId": "6rfhLzidpSCdZ0aCDBk5Cx",
      "appleId": 1000690688786,
      "youTubeId": "Me-GA1WK7RQ",
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6rfhLzidpSCdZ0aCDBk5Cx",
        "apple": "https://podcasts.apple.com/podcast/from-cult-survivor-to-empowerment-guide-isabella-youngs/id1575698421?i=1000690688786",
        "youtube": "https://www.youtube.com/watch?v=Me-GA1WK7RQ"
      }
    }
  ]
}