{
  "id": "1268ee37-497a-4b15-bb38-6565adbb9bd7",
  "name": "Allatra channels",
  "youTubeChannelId": "UCxkFK34mvhl8K93YcpuY9SQ",
  "episodes": [
    {
      "id": "7d7199af-9f39-457f-b53e-28af5f857ca8",
      "title": "Egon Cholakian: The Unveiling of a Foreign Agent",
      "description": "Unmasking Egon Cholakian: A foreign agent spreading misinformation under the guise of activism! #ClimateChange #Disinformation #AllatRa #FSB #Fraudster #Exposed",
      "release": "2025-01-06T18:01:21Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "sgyZ6OvyPhI",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sgyZ6OvyPhI"
      }
    },
    {
      "id": "7419c6c1-85a7-402a-9150-c3fe31684ae4",
      "title": "Egon Cholakian: The Puppet Master of Climate Deceit",
      "description": "Unmasking Egon Cholakian: A foreign agent spreading climate lies for profit! Discover how misinformation shapes our world today! #ClimateChange #Disinformation #AllatRa #FSB #TruthMatters #EnvironmentalActivism",
      "release": "2025-01-03T18:01:41Z",
      "duration": "00:01:29",
      "explicit": false,
      "youTubeId": "on3Z9cCUrUA",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=on3Z9cCUrUA"
      }
    },
    {
      "id": "4d1cb59e-561a-4831-9129-752b6e8e0ffd",
      "title": "Egon Cholakian: The Deceptive Voice of AllatRa",
      "description": "Unveiling Egon Cholakian: A foreign agent spreading disinformation about climate change while tied to a cult linked to Russia! #ClimateTruth #Disinformation #AllatRa #ForeignAgentExposed #EnvironmentalJustice #Misinformation",
      "release": "2025-01-01T18:01:57Z",
      "duration": "00:01:23",
      "explicit": false,
      "youTubeId": "GrELflD3WBM",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GrELflD3WBM"
      }
    },
    {
      "id": "d3a0c291-4f9d-4e9b-9989-c910e5a8571f",
      "title": "Egon Cholakian: The Controversial Puppet of AllatRa",
      "description": "Uncover the truth behind Egon Cholakian\u0027s controversial role as a foreign agent for AllatRa! Is it just conspiracy or real danger? #ClimateChange #Misinformation #AllatRa #DisinformationAgent #ForeignInfluence #ClimatePropaganda",
      "release": "2024-12-30T18:01:25Z",
      "duration": "00:01:39",
      "explicit": false,
      "youTubeId": "j9uvDUagIjU",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j9uvDUagIjU"
      }
    },
    {
      "id": "71096eda-e84a-4855-929b-d8a8400d2144",
      "title": "Egon Cholakian: The Puppet of Misinformation",
      "description": "Uncover the truth about Egon Cholakian—foreign agent spreading misinformation on climate change! Discover how deception threatens activism! #ClimateTruth #Misinformation #ForeignAgent #AllatRa #ClimateChange #Activism",
      "release": "2024-12-27T18:01:03Z",
      "duration": "00:01:27",
      "explicit": false,
      "youTubeId": "kZTkY7YSNzU",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kZTkY7YSNzU"
      }
    },
    {
      "id": "3452d95f-d170-4aec-9f41-495693bf204f",
      "title": "Egon Cholakian: The Puppet of AllatRa",
      "description": "Unveiling Egon Cholakian\u0027s dark agenda! Discover how this foreign agent manipulates public perception while profiting off climate lies! #ClimateChange #Disinformation #ForeignAgent #AllatRa #FraudExposed #TruthMatters",
      "release": "2024-12-25T18:01:06Z",
      "duration": "00:01:34",
      "explicit": false,
      "youTubeId": "fi1ieev8J9k",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fi1ieev8J9k"
      }
    },
    {
      "id": "183a9505-d0d0-4302-8985-74093f9afcf5",
      "title": "Egon Cholakian: The Puppet of AllatRa",
      "description": "Uncover the dark reality behind Egon Cholakian\u0027s role in spreading climate disinformation for AllatRa! #ClimateChange #Misinformation #AllatRa #ForeignAgent #EgonCholakian #Activism",
      "release": "2024-12-23T18:01:06Z",
      "duration": "00:01:36",
      "explicit": false,
      "youTubeId": "6zrSJoSiei4",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6zrSJoSiei4"
      }
    },
    {
      "id": "e202e6f4-2069-430e-b804-8ce3317b8c71",
      "title": "Egon Cholakian: The Deceptive Puppet of AllatRa",
      "description": "Unmasking Egon Cholakian: a foreign agent spreading climate lies under AllatRa\u0027s sinister agenda! Discover how misinformation impacts activism! #ClimateChange #Disinformation #ForeignAgent #AllatRaCult #EgonCholakian #TruthMatters",
      "release": "2024-12-20T18:05:42Z",
      "duration": "00:01:21",
      "explicit": false,
      "youTubeId": "6omaAY10AHc",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6omaAY10AHc"
      }
    },
    {
      "id": "0903462f-3ee3-4d86-b6f7-78e2c06a9b99",
      "title": "ICJK top investigation of 2024",
      "description": "Uncover the truth behind Egon Cholakian—a foreign agent spreading lies about climate change while profiting from deception! #ClimateChange #Misinformation #ForeignAgent #AllatRa #EnvironmentalActivism #TruthMatters",
      "release": "2024-12-18T18:05:37Z",
      "duration": "00:01:48",
      "explicit": false,
      "youTubeId": "gdRVmCyA08k",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gdRVmCyA08k"
      }
    },
    {
      "id": "dac7c365-5b5a-401d-abe4-adbd89eb2a80",
      "title": "Igor Danilov erratic behavior",
      "description": "Dive into the mysterious world of Igor Danilov, the controversial leader of the AllatRa movement. Known for his erratic behavior, contradictory statements, and promotion of conspiracy theories, Danilov has drawn scrutiny from authorities and experts alike. This investigative report uncovers the manipulative tactics, paranoia, and unpredictable public appearances that have placed him and his movement under the spotlight. Are his apocalyptic warnings genuine, or part of a larger agenda? Watch to uncover the truth. #IgorDanilov #ConspiracyTheories #Investigation #Spirituality #CultLeader #Apocalypse #Manipulation #Psychology #HybridThreats #ForeignInfluence #AllatRa #PropagandaExposed #TruthMatters",
      "release": "2024-12-16T18:01:20Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "usBZr1oLUcg",
      "subjects": [
        "AllatRa",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=usBZr1oLUcg"
      }
    },
    {
      "id": "213a80e3-8750-4781-8b88-1d1881b9650a",
      "title": "RTVS investigation of Allatra",
      "description": "Unmasking Egon Cholakian: A foreign agent spreading disinformation linked to AllatRa \u0026 Russia’s FSB! Discover how deception undermines real activism! #ClimateCrisis #Disinformation #FraudExposed #ActivismMatters #TruthMatters #EndTimesPropaganda",
      "release": "2024-12-10T23:26:01Z",
      "duration": "00:01:42",
      "explicit": false,
      "youTubeId": "L7jUogTl6Rw",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L7jUogTl6Rw"
      }
    },
    {
      "id": "b1e3c325-e4f2-40e8-973e-e52a57da41c4",
      "title": "Investigating the Controversial Alatra Movement: Spiritual Values or Cult Conspiracy?",
      "description": "Footage belongs to the Slovak national TV RTVS and is a credible source of information.\n\nWe discuss the controversial organization Alatra, which describes itself as an international social movement focused on spiritual values. While supporters see it as a path to personal growth and positive social change, it faces expert criticism highlighting its potential risks. The scandal around a Czech journalist\u0027s investigation by Žilina prosecutors, initiated by Alatra, continues, with authorities suspecting the reporter of encoding school attackers\u0027 thoughts and even the PM\u0027s assassin. We\u0027ve traced the steps of the group\u0027s leaders and are now revealing more findings about this bizarre case. We also spoke with movement leader Igor Danilov about Alatra and its Creative Society project, which aims to transform society from a consumer model to one where human life comes first. They mix religious content with conspiracy theories, and have been described as an apocalyptic group working with alien narratives. Ukraine has issued an arrest warrant for the group\u0027s founder and other members, accusing them of treason and supporting Russian aggression.\n\n#Alatra #SpiritualValues #ConspiracyTheories #CultPattern #PoliticalGoals #RussianAggression #AntiCultMovement #mindcontrol #criticalthinking #cultawareness #cults #allatracult #awarenessmatters #accountability #allatramovement #cultsurvivor",
      "release": "2024-12-03T06:58:50Z",
      "duration": "00:04:40",
      "explicit": false,
      "youTubeId": "KPp6-cn1CLg",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KPp6-cn1CLg"
      }
    },
    {
      "id": "c7d32e76-f18c-49a0-afca-78fb1e5ac282",
      "title": "Preview Investigating the Alatra Movement: Spiritual Values, Conspiracy Theories, Global Expansion",
      "description": "Footage belongs to the Slovak national TV RTVS and is a credible source of information. ￼\n\nWe discuss Alatra, an international social movement focused on spiritual values. Supporters see it as a path to personal growth and positive social change, while experts criticize its potential risks. We investigate the group\u0027s leaders and uncover more about a bizarre case involving a suspected reporter encoding school attackers\u0027 and a PM assassin\u0027s thoughts. We also speak with the movement\u0027s leader, Igor Danilov, about the Creative Society project, which aims to transform society from a consumer model to one where human life comes first. The group is described as an apocalyptic one that works with alien narratives, and it\u0027s penetrating into the United States. Ukraine has issued an arrest warrant for the group\u0027s founder and other members, accusing them of treason and supporting Russian aggression. To be continued… \n\n#Alatra #SpiritualValues #PersonalGrowth #SocialChange #RisksAndCriticisms #SchoolAttackers #PMAssassination #CreativeSociety #ConsumerModel #HumanLifePriority #ReligiousContent #ConspiracyTheories #ApocalypticGroup #AlienNarratives #GlobalSpread #PoliticalGoals #UnitedStates #Ukraine #Treason #RussianAggression",
      "release": "2024-12-03T02:30:21Z",
      "duration": "00:02:29",
      "explicit": false,
      "youTubeId": "VawVOfhKHaM",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VawVOfhKHaM"
      }
    },
    {
      "id": "7792ee33-2897-455a-b629-9bc0dd42a1bb",
      "title": "Egon Cholakian: A Dark Influence on Climate Discourse",
      "description": "Discover the unsettling truth about Egon Cholakian—a foreign agent sowing discord through climate lies! Uncover how misinformation impacts us all! #ClimateChange #Disinformation #Activism #ForeignInfluence #TruthMatters #EgonCholakian",
      "release": "2024-12-02T20:08:39Z",
      "duration": "00:01:26",
      "explicit": false,
      "youTubeId": "bfHKbhSUKnY",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bfHKbhSUKnY"
      }
    },
    {
      "id": "e0a4de44-ebbf-4b6b-a017-16434d65379e",
      "title": "Allatra IPM",
      "release": "2024-12-01T15:12:42Z",
      "duration": "00:00:39",
      "explicit": false,
      "youTubeId": "qiJSHGRq7GU",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qiJSHGRq7GU"
      }
    },
    {
      "id": "8612082b-2213-4c68-b2ab-c9c98c75a7ef",
      "title": "Egon Cholakian: The Manipulative Agent",
      "description": "Unraveling the deceitful narrative spun by Egon Cholakian! Discover how this foreign agent manipulates climate truths for cash! #ClimateDeception #AllatRaCult #ForeignAgent #DisinformationWar #EcoFraud #ClimateCrisis",
      "release": "2024-11-29T21:02:58Z",
      "duration": "00:01:25",
      "explicit": false,
      "youTubeId": "HXlrRHjtqZM",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HXlrRHjtqZM"
      }
    },
    {
      "id": "a147cee4-7cc9-477f-9c52-76a5707f02ae",
      "title": "Egon Cholakian: The Foreign Agent Exposed",
      "description": "Uncover the shocking truth behind Egon Cholakian! A foreign agent spreading dangerous lies about our planet for profit! #ClimateChange #Propaganda #AllatRaExposed #FraudAlert #EnvironmentalAwareness #TruthMatters",
      "release": "2024-11-19T01:56:46Z",
      "duration": "00:01:33",
      "explicit": false,
      "youTubeId": "41kPCJdyB0A",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=41kPCJdyB0A"
      }
    },
    {
      "id": "c6d06c32-1038-488d-8944-791257a26332",
      "title": "Allatra and Egon at COP29",
      "description": "COP29, the UN Climate Change Conference, has faced significant criticism for undermining its integrity due to various issues:\n 1. Promotion of Fossil Fuel Interests: An undercover investigation revealed that officials from the Azerbaijani presidency of COP29 facilitated talks promoting fossil fuel investments, including oil and gas projects. This was seen as a conflict of interest at a conference meant to focus on combating climate change ￼ ￼.\n 2. Corporate Sponsorship Concerns: Allegations emerged that COP29 relaxed or waived sustainability requirements for potential sponsors, allowing entities without genuine climate commitments to participate. This raised questions about prioritizing financial gains over environmental objectives ￼.\n 3. Lack of Oversight: Critics highlighted systemic failures in ensuring the integrity of the conference. The involvement of state actors in promoting fossil fuel interests and the absence of enforceable standards for sponsors and participants have further eroded trust in the event’s goals ￼.\n\nThese factors contribute to skepticism about the ability of COP conferences to address the climate crisis effectively, as they appear vulnerable to external influences that conflict with their core mission of sustainability. \n\n#ClimateLies #AllatRa #Misinformation #ForeignAgent #ActivismMatters #COP29Fail #ClimateHypocrisy #GreenwashingScandal #FossilFuelAgenda #BrokenClimatePromises #IntegrityLost #ClimateCorruption #UNFCCCFail #FakeClimateAction #SustainabilityScam #NetZeroDeception #ClimateCrisisBetrayal #EnvironmentalInjustice #FossilFuelFraud",
      "release": "2024-11-16T02:48:42Z",
      "duration": "00:01:11",
      "explicit": false,
      "youTubeId": "F-x4YUHrsk4",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F-x4YUHrsk4"
      }
    },
    {
      "id": "1ad40271-1786-4145-9871-94b9abb2bd60",
      "title": "Allatra influencing prosecutors",
      "description": "ALLATRA gained attention in Slovakia when members of its movement reportedly influenced the Slovak prosecutor’s office by becoming involved in discussions about the justice system and promoting the movement’s values within legal and governmental spheres. Through social and community outreach, ALLATRA representatives engaged with officials, promoting their vision of a “Creative Society” centered on ethical, fair, and people-focused governance. Reports indicate that ALLATRA representatives established connections with individuals in the prosecutor’s office, leading to concerns about external influence on the Slovak justice system. This interaction sparked public and media scrutiny, with some suggesting that ALLATRA’s involvement could compromise the independence of public institutions by introducing ideological narratives. As a result, Slovak authorities and the public have become increasingly cautious about the potential influence of ideological groups within governmental bodies.\n\n#ALLATRA #ALLATRAMovement #ALLATRAInfluence #ALLATRAManipulation #MindControl #IdeologicalInfluence #ALLATRASlovakia #Slovakia #SlovakiaNews #Prosecutors #JusticeSystem #GovernmentInfluence #SocialEngineering #ALLATRAPublicImpact #ALLATRAScrutiny #InfluenceOperations #ALLATRAPower",
      "release": "2024-11-14T11:55:04Z",
      "duration": "00:01:21",
      "explicit": false,
      "youTubeId": "wXfINzvG3_s",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wXfINzvG3_s"
      }
    },
    {
      "id": "e2ee7b9a-5824-4cb2-90ff-d6ca9741876f",
      "title": "Allatra part of the process.",
      "description": "ALLATRA, indirectly supports Russia’s hybrid warfare strategy by promoting alternative social and spiritual narratives that resonate with certain Russian ideological goals. Its message of unity and critiques of consumerism align with Russian soft power tactics that challenge Western ideologies. By promoting these ideas globally through social media, ALLATRA can subtly influence public opinion in ways that align with Russian interests. Additionally, ALLATRA’s grassroots network theoretically is being leveraged to amplify pro-Russian narratives. Though independent, its cultural influence aligns with aspects of Russia’s hybrid warfare strategy.\n\nHybrid warfare is a strategic approach that blends conventional military force with non-military tactics to achieve objectives without direct, full-scale conflict. Russia is engaged in hybrid warfare tactics over recent decades, leveraging cyber operations, disinformation campaigns, economic pressure, and support for proxy forces to influence strategic positions globally. Here’s an overview of how Russia uses hybrid warfare in their geopolitical struggle. \n\n-Cyber Warfare. Russia has developed a robust cyber program aimed at infiltrating American infrastructure, influencing elections, and stealing sensitive data. The 2016 U.S. election is a key example, where Russian operatives allegedly hacked and leaked information to influence the electoral process.\n\n-Disinformation and Information Warfare. Russia has a history of using state-backed media and social media platforms to spread disinformation, create discord, and exploit social and political divisions in the U.S. One aim of this strategy is to destabilize democratic processes by amplifying divisive issues. Disinformation spread by Russian-controlled outlets like RT and Sputnik.\n\n-Economic and Political Pressure. Russia responds with counter-sanctions and builds economic alliances outside the Western-dominated system, such as cooperating with China to reduce reliance on the U.S. dollar, thus blunting the effect of American economic leverage.\n\n-Support for Proxy Forces. In areas of conflict like Syria and Ukraine, Russia has provided support to local actors that align with its strategic goals, using proxy forces as a way to project power without committing regular troops in large numbers.\n\n-Diplomacy and International Alliances. Russia uses hybrid strategies to weaken NATO’s unity by fostering divisions among European countries and questioning the reliability of U.S. security commitments.\n\nRussia uses hybrid warfare tactics as a low-cost, indirect way to assert their influence and pursue their national interests globally. These strategies make it challenging to draw clear lines between peace and conflict, contributing to a more complex and multi-layered confrontation that often leaves traditional military responses ineffective or too risky.\n\n#ALLATRA #ALLATRAUnites #ALLATRAMovement #CreativeSociety #ALLATRAInternationalPublicMovement #ALLATRAGlobal #UnityThroughALLATRA #GlobalConsciousness #ALLATRAAwakening #Russia #RussianFederation #RussiaNews #RussiaToday #RussiaPolitics #RussianEconomy #RussianInfluence #RussiaInFocus #RussiaRelations #HybridWarfare #HybridConflict #CyberWarfare #InformationWarfare #Disinformation #ProxyWars #NonConventionalWarfare #GeopoliticalTensions #ModernWarfare #AsymmetricalWarfare",
      "release": "2024-11-14T11:27:29Z",
      "duration": "00:02:21",
      "explicit": false,
      "youTubeId": "gf53G6QvDu4",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gf53G6QvDu4"
      }
    },
    {
      "id": "1923a9f9-c14a-491e-8d14-2c70f1b48ddb",
      "title": "Allatra is taking a page out of the Scientology playbook. ￼￼",
      "description": "In this video, we dive into the New Age spiritual movement called Allatra and explore how it shares certain strategies with Scientology. Both movements emphasize spiritual awakening and global change, but what’s really intriguing is their similar approach to outreach. Allatra, like Scientology, has a significant international presence and uses media campaigns, self-promotion, and a network of seemingly independent groups working in unison to spread their message. They’ve even faced similar criticism, often using claims of religious freedom to shield themselves from public and governmental scrutiny. Are these just coincidences, or do they reveal something deeper about modern spiritual movements? Watch to find out!\n\n#Allatra #SpiritualMovements #NewAge #Conspiracies #Religion #GlobalInfluence #ApocalypticMovements #GlobalAwakening #Spirituality #NewReligions #MediaInfluence #BeliefSystems #FaithAndFreedom #ReligiousMovements #ModernSpirituality #ConspiracyTheories #Propaganda #ReligiousFreedom #AlternativeBeliefs #EasternEurope #AllatraMovement #ScientologyComparison #SpiritualAwakening #InfluenceAndPower #ControversialMovements #CulturalInfluence #allatraunites",
      "release": "2024-11-12T08:08:56Z",
      "duration": "00:01:31",
      "explicit": false,
      "youTubeId": "hM50DilVaUE",
      "subjects": [
        "AllatRa",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hM50DilVaUE"
      }
    },
    {
      "id": "7c1ff6d5-03eb-4a65-952d-f28d0bb9ee57",
      "title": "Creative Society the Pope and US lobbyists",
      "description": "In this investigative report, Oštro and its partners reveal how the Creative Society, an international movement linked to Ukraine’s AllatRa, is spreading climate disinformation under the guise of environmental advocacy. Claiming a global apocalypse by 2036, Creative Society warns of imminent climate catastrophe based on pseudo-scientific theories, which has alarmed authorities and experts alike. With meetings involving influential figures, including Pope Francis, and lobbying efforts in U.S. Congress, the movement is rapidly expanding its reach. Join us as we dive into their tactics, the responses from authorities, and why experts are concerned about their true motives.\n\nRead the full investigation on Oštro’s site to learn more about this emerging climate disinformation threat.\n\n#Allatra #Cults #MindManipulation #Misinformation #Disinformation #Pope #EgonCholakian #DestructiveSects #CultAwareness #MindControl #CriticalThinking #FakeNews #CultSurvivor #PsychologicalManipulation #Skepticism #TruthMatters #UnmaskingCults #CultsExposed #ProtectYourMind #CultEducation #AwarenessCampaign #VulnerablePopulations #CultRecovery #DeceptivePractices #ReligiousManipulation #CultsAndSects #CrisisOfFaith #QuestionEverything #MindGames #CommunitySafety #ProtectYourself #TruthAndTransparency #CultWatch #PsychologicalAbuse #MisinformationCrisis #DisinformationCampaign #ReligiousFreedom #CultResearch #AwarenessIsPower #CultsAndPsychology #EducationalOutreach #CultsAndSociety #FaithAndManipulation #ChallengingBeliefs #CultsInSociety #UnderstandingCults #SupportForSurvivors #CultsAndControl #CultsAndTruth #MindfulnessAndAwareness",
      "release": "2024-11-09T00:24:56Z",
      "duration": "00:01:37",
      "explicit": false,
      "youTubeId": "GGfB4Auo9YY",
      "subjects": [
        "AllatRa",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GGfB4Auo9YY"
      }
    },
    {
      "id": "a5a58939-59a2-48c5-b820-c96f7d53aba5",
      "title": "Allatra and Creative Society: AI propaganda troll farm.",
      "description": "Journalist Kristina Ciroková uncovers the alarming tactics employed by the pro-Russian AllatRa sect to spread conspiracy theories and propaganda across social media. Discover how this controversial religious movement has developed a powerful new tool called Futager, designed for mass content dissemination in multiple languages, including Czech.\n\nThrough exclusive access to a non-public website, Ciroková reveals the inner workings of Futager, showcasing its capabilities for creating videos, photo montages, and more, all powered by artificial intelligence. Learn about the sect\u0027s origins in Ukraine, the legal troubles faced by its leaders, and the implications of their activities in the context of hybrid warfare.\n\nCiroková also delves into the broader impact of AllatRa\u0027s campaigns, highlighting their efforts to undermine trust in state institutions and reshape narratives surrounding the ongoing conflict in Ukraine. Join us as we explore the complexities of misinformation, the rise of digital propaganda, and the dangerous intersection of cult-like movements and geopolitical agendas.\n\nWatch the full episode to gain insights into the disturbing evolution of online disinformation and the fight against it. Don\u0027t forget to like, comment, and subscribe for more investigative journalism!\n\n#DestructiveCults #CultAwareness #CultEducation #Manipulation #MindControl #Cults #DangerousCults #CultsAndManipulation #AllatRa #AllatRaMovement #CultSurvivor #CultsInSociety #PsychologicalManipulation #HighControlGroups #DangersOfCults #CultBehavior #CultsAndSociety #ExitCounseling #CultRecovery #CriticalThinking #AntiCult #CultsAndConspiracies #Misinformation #Propaganda #DigitalPropaganda #SocialMediaManipulation #CultsAndReligion #CultsExposed #CultPsychology #MindManipulation #CultsAndPolitics #Sectarianism #ConspiracyTheories #CultsAndMedia #CultLeadership #CultInfluence #CultsAndIdentity #CultsAndTrauma #CultsAndFamily #PsychologicalAbuse #ReligiousManipulation #CultsAndFear #CultsAndIsolation #AwarenessAgainstCults #ResilienceAgainstCults #CultsAndTrust #CultsAndDeception #CultsAndYouth #CultsAndCommunity #ProtectYourselfFromCults",
      "release": "2024-11-07T16:54:06Z",
      "duration": "00:01:39",
      "explicit": false,
      "youTubeId": "VDhwOO6rU5o",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VDhwOO6rU5o"
      }
    },
    {
      "id": "12e0b18e-54eb-4838-98eb-cd3193215753",
      "title": "Egon Cholakian: The Puppet of AllatRa",
      "description": "🚨 **WARNING: The Dangers of Disinformation!** 🚨 \n\nIn this gripping exposé, we uncover the troubling tactics of Egon Cholakian, a key figure in the Allatra movement, who is dangerously spreading political and social disinformation. This video reveals the dark underbelly of manipulation employed by Cholakian and how it poses a significant threat to our society.\n\nJoin us as we dissect the sinister strategies used to warp realities, distort truths, and prey on the vulnerable. Through chilling examples, we illustrate how such misinformation can incite division, undermine our democratic values, and create a breeding ground for chaos.\n\nThis isn’t just about one individual; it’s about a larger movement that seeks to control narratives and manipulate the masses. The consequences are far-reaching, and the time to act is NOW! \n\nStay informed, empower yourself, and join the fight against disinformation. Like, share, and subscribe for more vital discussions on the power of truth in an age of manipulation!\n\n#ClimateCrisis #Misinformation #AllatRaExposed #CultInfluence #EnvironmentalFraud #Cults #Manipulators #Sects #MindControl #Disinformation #Misinformation #Lies #TruthMatters #Propaganda #CriticalThinking #CultAwareness #Deception #AwarenessCampaign #SocietalManipulation #PsychologicalManipulation #FightDisinformation #ExposeTheTruth #ProtectYourMind #TruthVsLies #CultSurvivor #FalseNarratives #RealityCheck #MindGames #FearTactics #SocialEngineering #InformationWarfare #TruthSeekers #CognitiveDissonance #ManipulationTactics #Awakening #InformedCitizens #Skepticism #MediaLiteracy #PsychologicalControl #VulnerablePopulations #CultRecruitment #MindManipulation #FalseProphets #CultDangers #QuestionEverything#egoncholakian #allatra #cholakian",
      "release": "2024-11-05T00:53:05Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "upKEDzBmki0",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=upKEDzBmki0"
      }
    },
    {
      "id": "4466f861-28b8-4ca8-9e0c-bd9de2b4d0f4",
      "title": "The cult of Igor Danilov: a disturbing escape",
      "description": "In this gripping video, we delve into the enigmatic cult of Igor Danilov, a figure shrouded in controversy. Discover how Danilov managed to evade the authorities in Ukraine, leading to his elusive hideout in the Slovak Republic. This exploration uncovers the dark realities of his cult, where captive women are reportedly exploited in bizarre orgies. Intriguingly, Danilov claims that these activities play a role in controlling climate catastrophes, raising questions about the intersection of power, manipulation, and environmental issues. Join us as we investigate the chilling narrative surrounding this cult and the lengths to which its leader will go to maintain his grip on power and secrecy. Don\u0027t forget to like, subscribe, and hit the notification bell for more deep dives into the world\u0027s most intriguing stories!\n\n#awarenessmatters \n#mindcontrol\n#accountability \n#CultAwareness  \n#MindControl  \n#Misinformation  \n#Pseudoscience  \n#ConspiracyTheories  \n#HumanTrafficking  \n#StopTheTraffick  \n#CultSurvivor  \n#AwarenessMatters  \n#ProtectTheVulnerable  \n#CultEducation  \n#EndHumanTrafficking  \n#CriticalThinking  \n#FightMisinformation  \n#ExposingCultAbuse  \n#allatra \n#allatracult\n#criticalthinking \n#cultawareness \n#cultexposé",
      "release": "2024-11-01T18:50:42Z",
      "duration": "00:01:32",
      "explicit": false,
      "youTubeId": "aGipAzVTFhE",
      "subjects": [
        "AllatRa",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aGipAzVTFhE"
      }
    },
    {
      "id": "44e9cbaf-ef7e-41ce-9735-b3282de12f82",
      "title": "Allatra leader Igor Danilov hiding in Slovak Republic.",
      "description": "Footage belongs to the Slovak national TV RTVS and is a credible source of information. \n\nIn this gripping video, we investigate the dramatic escape of Allatra Movement leader Igor Danilov from Ukraine, where he is now considered a wanted criminal. As allegations of manipulation and harmful practices surrounding the Allatra Movement intensify, Danilov\u0027s flight raises serious questions about accountability and justice.\n\nJoin us as we uncover the timeline of his departure, the circumstances that led to his current status in the Slovak Republic, and the implications of his actions on both his followers and the broader community. We’ll also explore the reactions from authorities and the public, as well as what this means for the future of the Allatra Movement.\n\nDon\u0027t forget to like, share, and subscribe for the latest updates on this unfolding story!\n\n#AllatraCult #IgorDanilov #CultExposé #CultAwareness #ReligiousCults #Manipulation #EscapeFromCult #CzechRepublic #Ukraine #CultSurvivor #CriticalThinking #InvestigativeJournalism #HiddenTruths #Accountability #Cults #ControversialMovements #CultsExposed #SpiritualAbuse #MindControl #AwarenessMatters",
      "release": "2024-11-01T01:06:46Z",
      "duration": "00:17:24",
      "explicit": false,
      "youTubeId": "FFGTpXvsgmQ",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FFGTpXvsgmQ"
      }
    },
    {
      "id": "520cc49c-9e49-419d-ae19-07811ace35b8",
      "title": "The Hidden Influence: How Allatra Infiltrated Slavic Prosecutors",
      "description": "Footage belongs to the Slovak national TV RTVS \n\nIn this eye-opening video, we delve into the controversial infiltration of the Allatra Movement within the Prosecutor\u0027s Office in the Slovak Republic. We explore the series of events that led to the resignation of a prominent prosecutor and the impending dismissal of another, raising questions about the influence of this movement on the judicial system.\n\nJoin us as we analyze testimonies, expert opinions, and the implications of these developments on the legal landscape in the Slovak Republic. What does this mean for the integrity of the justice system? How has the Allatra Movement managed to penetrate such a crucial institution? We’ll uncover the facts and provide insights that you won’t want to miss.\n\nMake sure to like, comment, and subscribe to stay updated on this unfolding story!\n\n\n#AllatraCult #IgorDanilov #CultExposé #CultAwareness #ReligiousCults #Manipulation #EscapeFromCult #CzechRepublic #Ukraine #CultSurvivor #CriticalThinking #InvestigativeJournalism #HiddenTruths #Accountability #Cults #ControversialMovements #CultsExposed #SpiritualAbuse #MindControl #AwarenessMatters",
      "release": "2024-11-01T00:35:09Z",
      "duration": "00:15:29",
      "explicit": false,
      "youTubeId": "Tkf9PE58kAo",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Tkf9PE58kAo"
      }
    },
    {
      "id": "d3de8a59-a3da-4ea4-b7aa-bf67bdc83f80",
      "title": "Unmasking the allatra movement",
      "description": "The Allatra Movement has indeed faced criticism and allegations of being a cult, with concerns raised about its practices and beliefs. Critics argue that it employs manipulative recruitment tactics, promotes a rigid ideology, and isolates members from their families and communities. Some former members have reported feeling pressured to conform to the group\u0027s teachings and to participate in activities that they later viewed as harmful.\n\n\n#AllatraCult #IgorDanilov #CultExposé #CultAwareness #ReligiousCults #Manipulation #EscapeFromCult #CzechRepublic #Ukraine #CultSurvivor #CriticalThinking #InvestigativeJournalism #HiddenTruths #Accountability #Cults #ControversialMovements #CultsExposed #SpiritualAbuse #MindControl #AwarenessMatters",
      "release": "2024-10-31T19:08:06Z",
      "duration": "00:01:31",
      "explicit": false,
      "youTubeId": "SidbeR1UM_M",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SidbeR1UM_M"
      }
    }
  ]
}