{
  "id": "bcbe6406-b343-49f4-85d7-a3451b2bf394",
  "name": "Alone At Lunch",
  "spotifyId": "1VelvZgK7SH8W6HZoYni1J",
  "appleId": 1500438713,
  "episodes": [
    {
      "id": "ec95994d-559e-4711-a05e-10503d7e381b",
      "title": "S4 Ep25: Alone Being in a Christian Homeschooling Cult with Natalie Naudus",
      "description": "This week we are joined by Natalie Naudus! “A fave among audiobook listeners” (Buzzfeed), Natalie Naudus is one of the most beloved audiobook narrators working today. She has won an Audie award and nine Earphones awards, and maintains a robust social media following. She lives with her family on a mountain in Virginia. Gay the Pray Away is her debut novel. In this episode, we discuss growing up in Virginia as a member of the Institute in Basic Life Principles, having to “witness” to people in the neighborhood, being able to take piano lessons and go to college, being an opera singer, coming out as queer later in life, and so much more! You don’t want to miss our discussion about the importance of books to Natalie. Give this episode a listen! Recommendations From This Episode: Gay The Pray Away One Last Stop Educated by Tara Westover The Glass Castle Follow Natalie Naudus: @natalienaudus Follow Carly: @carlyjmontag Follow Emily: @thefunnywalsh Follow the podcast: @aloneatlunchpod Please rate and review the podcast! Spread the word! Tell your friends! Email us: aloneatlunch@gmail.com See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2024-08-19T04:00:00Z",
      "duration": "01:00:58.1870000",
      "explicit": false,
      "spotifyId": "7pCl9YyCpmQD3BHlHkMwsw",
      "appleId": 1000665040683,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7pCl9YyCpmQD3BHlHkMwsw",
        "apple": "https://podcasts.apple.com/podcast/alone-being-in-a-christian-homeschooling-cult/id1500438713?i=1000665040683"
      }
    }
  ]
}