{
  "id": "9aeeb767-6231-4e4c-bda1-928d0f9f6ba1",
  "name": "Altar Ego",
  "spotifyId": "0IQY4n6ymQWeqWa2nAlaSR",
  "appleId": 1841747793,
  "episodes": [
    {
      "id": "41a1e9a5-9748-4b1f-a0d7-4cbed629a38d",
      "title": "Episode 17: Suicide Cult \u002B Teal Swan",
      "description": "CW: This episode includes discussion of suicide, mental health crises, emotional abuse, and coercive or controlling dynamics in spiritual spaces. Listen with care. \nIn this episode, we take a deep look at Teal Swan; her rise as a spiritual influencer, the community that formed around her, and the serious concerns raised by former followers, journalists, and mental-health professionals. \nDrawing from long-form investigations, documentaries, and Teal Swan’s own published content, Heather walks us through how language, authority, and vulnerability can intersect in powerful and dangerous ways. We discuss the ethical responsibility of spiritual leaders, the blurred lines between self-help and control, and why certain teachings raise red flags when viewed through the lens of trauma-informed psychology, consent, and harm reduction.\nThis episode centers on accountability, critical thinking, and compassion for those impacted. We believe belief systems deserve examination, especially when they hold real-world consequences. \n\nSources: \n“The Deep End.” Wikipedia. https://en.wikipedia.org/wiki/The_Deep_End_(2022_TV_series)\n“The Gateway: Teal Swan.” Gizmodo. https://gizmodo.com/tag/the-gateway\n“Teal Swan.” YouTube. https://www.youtube.com/@TealSwanOfficial",
      "release": "2026-01-07T22:53:19Z",
      "duration": "02:11:42",
      "explicit": false,
      "spotifyId": "1jMcQyE6IU3cthrzXFH9lq",
      "appleId": 1000744203407,
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1jMcQyE6IU3cthrzXFH9lq",
        "apple": "https://podcasts.apple.com/podcast/episode-17-suicide-cult-teal-swan/id1841747793?i=1000744203407"
      }
    }
  ]
}