{
  "id": "49efeab6-66d3-4236-becf-9e2b1d6e9888",
  "name": "Amanpour and Company",
  "youTubeChannelId": "UCqqjiYoD0nP1fR6vf5AcSfQ",
  "episodes": [
    {
      "id": "975df456-2402-4962-bcc9-1fda99fddf6b",
      "title": "Andrew Interviewer Reacts to Fmr. Prince\u0027s Arrest amid Epstein Ties | Amanpour and Company",
      "description": "It\u0027s a royal earthquake. For the first time since the 1647 arrest of King Charles I, a senior British royal has been arrested. Today police took Andrew Mountbatten-Windsor, the former Prince Andrew, into custody on suspicion of misconduct in public office. A royal source reported that Buckingham Palace received no prior warning. The arrest comes amid an investigation into claims that Andrew shared sensitive information with convicted sex offender Jeffrey Epstein while serving as the U.K. Trade Envoy. There also have been allegations that a woman was trafficked into the U.K. by Epstein for sexual encounters with the former Prince, although police have not charged Andrew with any sexual offenses. Andrew has previously denied all accusations against him and insists that he never witnessed or suspected any of the criminal activity of which Epstein was accused. Andrew\u0027s brother, the current King Charles, expressed his \u0022wholehearted support\u0022 for the investigations, saying that \u0022the law must take its course,\u0022 while Prime Minister Keir Starmer said no one is above the law. Andrew\u0027s fall from grace began in 2019, when journalist Emily Maitlis sat down with him inside Buckingham Palace for a notorious, hour-long interview about his relationship with Epstein. It was the first time Andrew had spoken publicly about the allegations. He said then he had \u0022no indication\u0022 Epstein was doing anything wrong. Emily Maitlis joins Christiane in London to discuss this latest development.\n\nOriginally aired on February 19, 2026\n\n----------------------------------------------------------------------------------------------------------------------------------------\n\nMajor support for Amanpour and Company is provided by the Anderson Family Endowment, Jim Attwood and Leslie Williams, Candace King Weir, the Sylvia A. and Simon B. Poyta Programming Endowment to Fight Antisemitism, the Straus Family Foundation, The Peter G. Peterson \u0026 Joan Ganz Cooney Fund, Charles Rosenblum, Monique Schoen Warshaw, Koo and Patricia Yuen and Barbara Hope Zuckerberg. \n\nSubscribe to the Amanpour and Company channel here: https://bit.ly/2EMIkTJ\n\nSubscribe to our daily newsletter to find out who\u0027s on each night: http://www.pbs.org/wnet/amanpour-and-company/newsletter/\n\nFor more from Amanpour and Company, including full episodes, click here:  https://to.pbs.org/2NBFpjf\n\nThis program is made possible by viewers like you. Please support your local PBS station: http://www.pbs.org/donate\n\nLike Amanpour and Company on Facebook: https://bit.ly/2HNx3EF\n\nFollow Amanpour and Company on Twitter: https://bit.ly/2HLpjTI\n\nFollow Amanpour and Company on Instagram: https://bit.ly/3SaTUhk\n\nWatch Amanpour and Company weekdays on PBS (check local listings).\n\nAmanpour and Company features wide-ranging, in-depth conversations with global thought leaders and cultural influencers on the issues and trends impacting the world each day, from politics, business and technology to arts, science and sports. Christiane Amanpour leads the conversation on global and domestic news from London with contributions by prominent journalists Walter Isaacson, Michel Martin, and Hari Sreenivasan from the Tisch WNET Studios at Lincoln Center in New York City.\n\n#amanpourpbs",
      "release": "2026-02-19T21:37:05Z",
      "duration": "00:05:39",
      "explicit": false,
      "youTubeId": "_V-yamwYtTA",
      "subjects": [
        "Human Trafficking",
        "_America",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_V-yamwYtTA"
      }
    }
  ]
}