{
  "_ts": 0,
  "id": "f0484d97-569c-4d37-9f93-dd68310ec008",
  "name": "American History Hit",
  "spotifyId": "3Ehymwiw9oBfk3HOx2kN69",
  "appleId": 1638918169,
  "episodes": [
    {
      "id": "d18c089e-08aa-4329-b882-8ecf1701c008",
      "title": "Jonestown: The Death of a Cult",
      "description": "Did you ever wonder where the phrase \u0027drink the Kool-Aid\u0027 came from? In this second episode about the Peoples Temple, we rejoin them in Jonestown, Guyana. How planned was the final \u0027white night\u0027? Did anyone survive? And what happened to the notorious Jim Jones? Don is joined once again by author and scholar Annie Dawid, who has spent over two decades researching Peoples Temple. Produced by Sophie Gee. Edited by Tim Arstall. Senior Producer was Charlotte Long. Sign up to History Hit for hundreds of hours of original documentaries, with a new release every week and ad-free podcasts. Sign up at https://www.historyhit.com/subscribe . You can take part in our listener survey here . All music from Epidemic Sounds. American History Hit is a History Hit podcast.",
      "release": "2025-05-12T08:00:00Z",
      "duration": "00:30:27.6830000",
      "explicit": false,
      "spotifyId": "69cOVnciVmyxISif8SNo1U",
      "appleId": 1000706980030,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/69cOVnciVmyxISif8SNo1U",
        "apple": "https://podcasts.apple.com/podcast/jonestown-the-death-of-a-cult/id1638918169?i=1000706980030",
        "bbc": "https://www.bbc.co.uk/sounds/play/p0l99z5y"
      }
    },
    {
      "id": "ce882ccd-6bd5-4c02-9827-40a9694aa93c",
      "title": "Jonestown: The Birth of Peoples Temple",
      "description": "On November 18th, 1978, over 900 people died at an American settlement in the jungle of Guyana called Jonestown. In this first of two episodes, we are going to find out how they ended up in South America. Who was the eponymous Reverend Jim Jones, notorious leader of the cult? What did the Peoples Temple believe in? How and why did they make the journey from Indiana to California to Guyana? Don is joined by author and scholar Annie Dawid, who has spent over two decades researching Peoples Temple. Produced by Sophie Gee. Edited by Tim Arstall. Senior Producer was Charlotte Long. Sign up to History Hit for hundreds of hours of original documentaries, with a new release every week and ad-free podcasts. Sign up at https://www.historyhit.com/subscribe . You can take part in our listener survey here . All music from Epidemic Sounds. American History Hit is a History Hit podcast.",
      "release": "2025-05-05T08:00:00Z",
      "duration": "00:57:00.5510000",
      "explicit": false,
      "spotifyId": "25OGn8qZ1jxxHgBLkuhk61",
      "appleId": 1000705856512,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/25OGn8qZ1jxxHgBLkuhk61",
        "apple": "https://podcasts.apple.com/podcast/jonestown-the-birth-of-peoples-temple/id1638918169?i=1000705856512",
        "bbc": "https://www.bbc.co.uk/sounds/play/p0l8hptc"
      }
    },
    {
      "id": "ab1afd43-66ed-4af3-8c90-ed4175787f2e",
      "title": "Waco: A Cult, the FBI and a Fiery Ending",
      "description": "76 people died on 19th April 1993 when the compound of a religious sect, the Branch Davidians, went up in flames. It had been under siege by government agencies for 51 days, but no one knows what started the fire. Don is joined by Jeff Guinn, investigative reporter and author of ‘Waco: David Koresh, the Branch Dividians, and a Legacy of Rage’ to find out why the United States’ Government was interested in this religious compound outside Waco, Texas, and how the situation escalated to this point. Produced and edited by Sophie Gee. Senior Producer was Charlotte Long. Sign up to History Hit for hundreds of hours of original documentaries, with a new release every week and ad-free podcasts. Sign up at https://www.historyhit.com/subscribe . You can take part in our listener survey here . All music from Epidemic Sounds/All3 Media American History Hit is a History Hit podcast.",
      "release": "2024-12-09T09:00:04Z",
      "duration": "00:55:10.6020000",
      "explicit": false,
      "spotifyId": "1L33DxkY1fTL6HyGrAOAml",
      "appleId": 1000679475141,
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1L33DxkY1fTL6HyGrAOAml",
        "apple": "https://podcasts.apple.com/podcast/waco-a-cult-the-fbi-and-a-fiery-ending/id1638918169?i=1000679475141",
        "bbc": "https://www.bbc.co.uk/sounds/play/p0k9f39p"
      }
    }
  ]
}