{
  "id": "59bd177c-0813-4480-86a4-35166da3c93e",
  "name": "Among Monsters Podcast | Chilling True Crime",
  "spotifyId": "2JIJQgvA8cROcBbCfIn8OB",
  "appleId": 1786663336,
  "youTubeChannelId": "UCGammp2dH9RMJKva7X1c-0Q",
  "episodes": [
    {
      "id": "d34bbb6e-6205-4f99-9f6a-5fb19cddbb05",
      "title": "The Vampire Father: Marcus Wesson\u0027s Cult of Blood \u0026 The Fresno Family Massacre",
      "description": "Among Monsters delves into the chilling true story of Marcus Wesson, the self-proclaimed \u0022Vampire Father\u0022 who orchestrated one of America\u0027s most horrific family massacres in Fresno, California. In this harrowing episode, host Damien Vale unearths the twisted life and dark legacy of Marcus Wesson, a man who transformed his own family into a captive cult. Discover how Wesson, a drifter from Kansas, meticulously groomed, abused, and controlled his daughters and nieces, fathering multiple children through incest, all while constructing a terrifying, personalized theology centered on blood, divine death, and his absolute power as \u0022Master.\u0022 Explore the disturbing details of his isolated household, where children were denied education, lived in squalor, and were indoctrinated into a bizarre \u0022Arrangement\u0022—a suicide pact meant to \u0022preserve holiness.\u0022 Learn about the dramatic standoff on March 12, 2004, when police responded to a child custody dispute that tragically unmasked Wesson\u0027s house of horrors, revealing nine bodies—seven children and two young women—all executed. This isn\u0027t just a crime story; it\u0027s a deep dive into the psychological terror of generational abuse, religious manipulation, and cultic control. Damien Vale examines Wesson\u0027s background, his time in the military, and the insidious methods he used to bind his victims to him, even unto death. Understand the complex trial that followed and the lasting impact on the survivors and the Fresno community. Join us as we question the true nature of evil and explore how monsters can emerge in the most unexpected places—within a family, under the guise of faith. A crucial listen for true crime enthusiasts, those interested in cult dynamics, and anyone seeking to understand the darkest corners of human behavior. #MarcusWesson #TrueCrime #FresnoMurders #FamilyMassacre #Cults #ReligiousAbuse #IncestSurvivor #ChildAbuse #AmericanCrime #VampireFather #PsychologicalThriller #MurderMystery #DamienVale #AmongMonsters #Podcast #CrimePodcast #TrueCrimeCommunity #CrimeDocs #DarkHistory #PsychologyOfCrime #SerialKiller (though he was not a serial killer in the traditional sense, people might search this for extreme cases) #DomesticViolence #ColdCaseFiles (though solved, the impact resonates) #CriminalJustice #ForensicFiles (for those interested in investigation) #UnsolvedMysteries (even if solved, the \u0027why\u0027 remains a mystery) #CultLeader #RealCrime #HorrorStories #CaliforniaCrime",
      "release": "2025-07-17T05:00:00Z",
      "duration": "00:22:55.3990000",
      "explicit": false,
      "spotifyId": "20jdCG2AVkLRukZa1uhniT",
      "appleId": 1000717625793,
      "youTubeId": "Sdyis1Y1DFA",
      "subjects": [
        "Marcus Wesson"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20jdCG2AVkLRukZa1uhniT",
        "apple": "https://podcasts.apple.com/podcast/the-vampire-father-marcus-wessons-cult-of-blood/id1786663336?i=1000717625793",
        "youtube": "https://www.youtube.com/watch?v=Sdyis1Y1DFA"
      }
    }
  ]
}