{
  "_ts": 0,
  "id": "3dc09686-4fea-4b30-b488-714f9fcfbdac",
  "name": "Among the Ashes Podcast",
  "spotifyId": "4QaexpPt1JWwiTkO6jVZ0O",
  "appleId": 1750616394,
  "youTubeChannelId": "UCPOE1wG5Jn03ncucs1r7gKA",
  "episodes": [
    {
      "id": "b37cc45e-9f9a-4a06-95e6-5353bddd920e",
      "title": "\u0022Was I in a Cult?\u0022 w/ Cantley Pittman PT. 1",
      "description": "Episode: 32 \n\n\n\nOn this weeks episode we are hanging out with Cantley Pittman again and discussing his time being involved with a \u0022ministry\u0022 that was full on taking advantage of him and other members of the team.\n\n\n\nRecently I have ran across several videos on TikTok exposing a ministry close to our home town, with allegations of all kinds of abuse. From sexual allegations to starvation and berating of it college students, church members, the community, the list goes on and on.\n\n\n\nCantley also ran across the videos and reached out to see if I had seen any of them and I told him yes. He then stated due \u0027I was involved\u0022 in this. He stated that watching those videos brought all the emotions he had stuffed for years back to the surface and ultimately belies that this is why he stepped away from his faith.\n\n\n\nMy goal is to always defend the gospel not tear it down. But it\u0027s time we as the body of Christ fight back and expose the grifters \u0026 abusers that take advantage of the body \u0026 bride of Christ, instead of taking a back seat with the comment well \u0022we gotta forgive\u0022 and \u0022I will pray for them\u0022. Yes we do have to forgive, yes we do need to pray for them, but we do not need to let things like this be swept under the rug, especially when so many are coming out with the same stories of abuse. We need to stop defending and start REBUKING these false teacher \u0026 preacher that are getting rich off the back of God\u0027s people. They are modern day Pharisees, which are the same people Jesus to a stand against. Doing nothing makes us guilty and makes Christianity less favorable than it already is.\n\n\n\n***** \u002BDisclaimer\u002B ***** Everything mention here are strictly my opinions from what I have witnessed and Cantley\u0027s first hand account. I have no proof of the allegations on TikTok or any where else in the media, other than Cantley\u0027s testimony. I have know this kid his whole life an have no reason to think he would like. But that being said, allegations are allegations. Innocent until proven guilty. If anyone listening has been apart of church\u0027s or organizations like this and want to share your story or defend the organization we are more than willing to sit down and discuss. Please email us or shoot us a DM on our social media pages.\n\n\n\n\nAmong the Ashes Podcast - \n\n\n\nMake sure to give us a ⭐️⭐️⭐️⭐️⭐️ review :) \n\n\n\nIf you have a show idea or would like to be apart of the show, email us or shoot us a DM/EMAIL us: https://www.amongtheashes@yahoo.com\n\n\n\nhttps://www.facebook.com/amongtheashespodcast\n\n\n\nhttps://www.instgram.com/amongtheashespodcast\n\n\n\nhttps://www.tiktok.com/amongtheashespodcast\n\n\n\nhttps://www.youtube.com/@amongtheashespodcast\n\n\n\n#KrysTalk #FlyAway #nocopyrightsounds #copyrightfree▽ Connect with NCSTwitch / nocopyrightsounds Spotify http://spoti.fi/NCSSoundCloud / nocopyrightsounds Facebook / nocopyrightsounds Twitter / ncsounds Google\u002B http://google.com/\u002BnocopyrightsoundsInstagram / nocopyrightsounds_ ▽ Follow MendumSoundCloud / mendumofficial Facebook https://www.facebook.com/mendumoffici...Twitter / mendumofficial Instagram / mendumofficial ▽ Follow Krys TalkSoundCloud / krystalkmusic Facebook / krystalkmusic Twitter / krystalkmusic",
      "release": "2025-01-30T15:34:27Z",
      "duration": "01:20:08",
      "explicit": false,
      "spotifyId": "4MILNsP3m7xuLVDxr4APOp",
      "appleId": 1000687163916,
      "youTubeId": "AiUgfVKR8mw",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4MILNsP3m7xuLVDxr4APOp",
        "apple": "https://podcasts.apple.com/podcast/was-i-in-a-cult-w-cantley-pittman-pt-1/id1750616394?i=1000687163916",
        "youtube": "https://www.youtube.com/watch?v=AiUgfVKR8mw"
      }
    }
  ]
}