{
  "id": "17205c1e-2f51-453f-9da6-e65bf66a4719",
  "name": "Amy Polacko  |  Divorce \u0026 Life Coach",
  "youTubeChannelId": "UCp0JwzSBWlwbA9mlx9TJWNw",
  "episodes": [
    {
      "id": "aaf863d9-1edb-4a0b-adea-360c7f933cc9",
      "title": "Therapist \u0026 Cult Survivor Explains How Narcassists Trap Us",
      "description": "Narcissistic abuse doesn’t begin with cruelty. It begins with connection.\n\nIn this episode of Girl, Wake Up!, Amy Polacko sits down with licensed psychotherapist Vanessa Reiser, LCSW, to unpack how narcissists condition, confuse and trap even the smartest, strongest women-and what it actually takes to break free. \n\nVanessa is the author of Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People. A two-time Ironman, she has run across multiple states in a wedding dress to raise awareness about narcissistic abuse and survivor empowerment. Together, we explore how love-bombing turns into control, why gaslighting erodes self-trust, and how trauma bonds keep women stuck long after the red flags appear.\nBut this episode isn’t just about the trap.It’s about the comeback.\n\nVanessa shares how she rebuilt her identity, reclaimed her power and transformed her pain into purpose.\n\nIf you’ve ever wondered:\n\nWas it really that bad?\nWhy did I stay so long?\nWhy do I still miss him?\n\nThis conversation will help you understand the psychology-and reclaim your clarity.\n\nFind out more about Vanessa Reiser and follow her:\nhttps://tellatherapist.net/\nInstagram: @vanessareiserlcsw\nGet her book: Narcissistic Abuse\n\nBook a free Coaching Consultation with Amy Polacko here.\nFollow Amy on Instagram: @freedomwarriortribe \n\nWatch and Subscribe to Girl, Wake Up! On YouTube: https://www.youtube.com/@amyfreedomwarrior/podcasts\n\nListen to Girl, Wake Up! on all streaming platforms: \n\nApple Podcasts\npodcasts.apple.com/ca/podcast/girl-wake-up/id1862920246\n\nSpotify\nopen.spotify.com/show/101MXflt4Q1Vo6GU5waLfj?si=d735c9e5063d41ed\n\nAudible\naudible.ca/podcast/Girl-Wake-Up-Trailer/B0G99GC26Q?source_code=ASSGB149080119000H\u0026share_location=pdp\n\nIHeartRadio\niheart.com/podcast/1333-girl-wake-up-312872506",
      "release": "2026-02-17T04:15:03Z",
      "duration": "00:32:09",
      "explicit": false,
      "youTubeId": "yQKhmlRh2Hc",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yQKhmlRh2Hc"
      }
    }
  ]
}