{
  "id": "a35a8b46-af6f-417e-a3af-6a5f7edd146f",
  "name": "Analyze Scripts",
  "spotifyId": "23s4CXxRm9yNcbnG0xCT1G",
  "appleId": 1669386748,
  "episodes": [
    {
      "id": "ba2e4629-8bde-4d24-aa98-8450294c7eb8",
      "title": "Episode 54 - Cult V. Cult",
      "description": "Welcome back to Analyze Scripts, where a psychiatrist and a therapist analyze what Hollywood gets right and wrong about mental health. Today, we are covering two popular documentaries that have recently been getting a lot of attention, \u0022Escaping Twin Flames\u0022 on Netflix and \u0022Love Has Won: The Cult of Mother God\u0022 on Max. We discuss how cults prey on vulnerable people, some red flags to look out for and discuss similarities between these two cults as well as others. We hope you enjoy! Psychology Today Article  Instagram Youtube TikTok Website Dr. Katrina Furey, MD: Hi, I\u0027m Dr. Katrina Furey, a psychiatrist. Portia Pendleton, LCSW: And I\u0027m Portia Pendleton, a licensed clinical social worker. Dr. Katrina Furey, MD: And this is analyze scripts, a podcast where two shrinks analyze the depiction of mental health in movies and tv shows. Portia Pendleton, LCSW: Our hope is that you learn some legit info about mental health while feeling like you\u0027re chatting with your girlfriends. Dr. Katrina Furey, MD: There is so much misinformation out there, and it drives us nuts. Portia Pendleton, LCSW: And if someday we pay off our student loans or land a sponsorship, like. Dr. Katrina Furey, MD: With a lay flat airline or a major beauty brand, even better. Portia Pendleton, LCSW: So sit back, relax, grab some popcorn. Dr. Katrina Furey, MD: And your DSM five, and enjoy. Welcome back to another episode of analyze scripts. We are doing something a little bit different today. Usually we focus on fictional tv shows and movies, but we have decided to take a stand against cults. And we have decided that we will make an exception and talk about cults when they\u0027re in the media, because they are honestly just so atrocious. So we\u0027re going to try to walk a really fine line here and still be ethical. We\u0027re not trying to analyze anyone specifically in terms of the people that are talked about and the two documentaries we\u0027re going to be talking about today. But we want to use this material to talk more broadly about cults in general, again, because it is really pervasive, it\u0027s really dangerous, it\u0027s heartbreaking, and we see it a lot in the media, but there\u0027s still so much confusion about it. So, again, if you want to hear more, you can also revisit one of our older episodes about yellow jackets season two with Dr. Jesse Gold. We talk a lot about Lottie\u0027s cult. And so, basically today what we\u0027re going to do is I watched a documentary about a cult. Portia watched a different documentary about the cult. A different cult. And we didn\u0027t watch each other\u0027s documentaries. And we\u0027re going to tell each other about the different cults. Right? Did I explain that? Yeah. Okay, so do you want me to get started, or do you want to get started? Portia Pendleton, LCSW: Portia, why don\u0027t you intro yours and get started? Dr. Katrina Furey, MD: Yeah, not my cult, but the cult. Too short. Okay, so I\u0027m going to be referring to a recent Netflix documentary called escaping Twin Flames. I think that\u0027s what it\u0027s called. It was only about three episodes. They\u0027re about an hour long each. Interestingly, I watched them on an airplane when we were flying down to Disney World. So it was like an interesting juxtaposition, like going to the happiest place on earth and then watching all of this sadness and heartbreak and intensity sitting next to my children. It\u0027s interesting. This documentary follows an organization which obviously they don\u0027t call themselves a cult, but they have some experts kind of weighing in who do call it a cult, or also a high control group is like another phrase used to describe cults these days. And basically it\u0027s run by these two people, Jeff and Shalia, who I was just looking up their Wikipedia before we got started, Portia. And they both have had different names throughout their lives, according to Wikipedia, which I just think is interesting. And they run something called the Twin Flames University. I had never heard of twin flames until Megan Fox and machine gun Kelly. Right. Like, weren\u0027t they all about twin flames? Had you heard of this before? A little. Portia Pendleton, LCSW: Like, it\u0027s like an extra. Like, that was my understanding of what. Or, like, not an extra, a soulmate to the right. Dr. Katrina Furey, MD: Right. Yeah. So I again looked it up on Wikipedia, because doctors use Wikipedia, too. Portia Pendleton, LCSW: Did you donate? Dr. Katrina Furey, MD: No, it\u0027s Christmas time. I\u0027m a little stressed. But basically, according to Wikipedia, it says, the term twin flames was coined by the english novelist Marie Corelli in her novel of romance of two worlds. And since then, it has sort of evolved into a lot of new age spiritualism. Kind of focuses on twin flames. It\u0027s kind of like, it\u0027s my understanding it\u0027s like your soulmate, but even greater than that. So it\u0027s almost like meeting your counterpart and that you have to find each other in order to both achieve your full potential. That\u0027s kind of what it is. And then I guess these two folks started this twin flames university where you could take classes about bettering yourself and finding your twin flame. And again, like we talked about in our yellow jackets documentary, always be very careful when someone calls themselves a guru. Someday we\u0027ll have merch that has that slogan on it. Right. But just always be careful. And I was looking, and their class that they sold was over $4,000. That\u0027s a lot of money. A lot. But again, I see this. I don\u0027t know if you see it in people you\u0027re treating or evaluating, but I see a lot of people coming to me who are paying a lot of money out of pocket. They don\u0027t take insurance. They\u0027re also not advertising themselves as clinicians. They might advertise themselves as, quote unquote, life coaches or a coach of some kind, but you can charge whatever you want for whatever you\u0027re selling. And it\u0027s just interesting to me how some people get hooked and some people charge so much money. Anyway, what the premise of the documentary, Portia, is, is know. So these two people start this twin flames university, and they kind of use themselves as, like, we found our twin flame and this is how we did it. And look at how successful we are and how happy we are and stuff. And then people start joining, and it kind of becomes. I feel like they always become these MLM type things, right? Portia Pendleton, LCSW: Yeah. Dr. Katrina Furey, MD: Where it\u0027s like you buy in and then you become the teacher. Did you watch that documentary about the Nexium cult? Portia Pendleton, LCSW: Not that one, but Portia, I think I did the Lululemon. Not Lululemon, the Lula Rowe similar. Dr. Katrina Furey, MD: So the nextium was really good. Also, like, heartbreaking and awful, but it\u0027s a really good expose about typical cult psychology. But again, it\u0027s like we are up here on a pedestal. Typically, cult leaders are like, malignant narcissists who want to be idealized, and they want people to obey them no matter what. And they have this sociopathic flair to them. Again, I\u0027m not analyzing anyone specifically or individually. I\u0027m just talking about, in general, what we see. They have this sociopathic flare where, again, they kind of get off or get a rush from controlling people. So those tend to be the people at the top of a cult, and then below are people who are vulnerable to this type of influence. And I think that\u0027s where the psychology is really fascinating. Like, how do people get hooked and kind of. It\u0027s not always like someone waiting on the end of the road, like, hey, come sign up for my cult. No one would do it. Right? So it tends to be people who are vulnerable in some way. Whether there\u0027s been a history of trauma, I would say really common. If there\u0027s developmental or intellectual disability, if there is some type of mental illness that can be exploited. Like, I remember in my training, a colleague of mine was treating a patient with psychosis who was getting sucked into these cults. And for someone like that who\u0027s already struggling to tell reality from not reality, you can see why you\u0027re vulnerable to this. And other times, I think you can just think of it as an unclear sense of self, like someone who maybe is feeling a little lost or who\u0027s looking to feel connection or community or love. I think those types of people might be more apt to, I don\u0027t know, just, I guess, feel, like, enticed by someone saying, I have all the answers. Look how great my life is. Like, you can have this, too. If you pay me $100 million and do everything I say and change everything about yourself, isn\u0027t that great? I think people who have a really strong sense of self, who have more of a secure attachment style, probably will sniff out the bs and turn away and not be as easily manipulated as other people who maybe are struggling with that. I don\u0027t know. What do you think? Portia Pendleton, LCSW: I think that\u0027s pretty true. I mean, I think a generalization would be that people who tend to kind of fall into cults or even like mlms, it\u0027s like you\u0027re looking for something and then this organization is promising to deliver, and then there\u0027s this added layer of like, you\u0027re a family. And obviously that feels really strong in a cult as we know it. And then also we do see that show up in Lularoe and your team and your girl boss thing. So it can be obviously different levels of it, but totally. Dr. Katrina Furey, MD: I found a really interesting article that we\u0027re going to link to in our show notes because we know how to do that now on psychology today, that really explains cults, written by Stephen Hassan, a PhD I thought was like a really good, easy to digest description. And they also say you can see these dynamics not just in cults, but you can see it in mlms, you can see it in religious organizations, you can see it in schools, you can see it in families, you can see it in the workplace. Again, it\u0027s not like this phenomenon is unique to cults. I think it\u0027s just from the outside. Like when you\u0027re watching a documentary like this, you\u0027re just like, what? How on earth did these people stick around? And it\u0027s because it\u0027s so insidious and slow, right? Like we\u0027re seeing it in a three hour documentary. This has been going on for years. I think these people started this organization like 2007. It doesn\u0027t happen overnight, right? So usually the leader is really charming and charismatic and captivating in some way, but then there\u0027s a lot of nefarious things going on underneath. So we\u0027ll link to that because it\u0027s really interesting. And I think it\u0027s important just to note that these dynamics exist other places. And that\u0027s one reason we want to talk about it again, to sort of help educate and push out some information. So I guess with this one, with the twin Flames university. So again, the whole goal is like, sign up for this class. You\u0027ll become self actualized. I feel like that\u0027s another thing. All these cults sort of advertise like, you\u0027ll be your best self, and then that\u0027s confusing. Because I feel like Weight Watchers advertise this, too, and other types of self help advertise that. So how do you draw the line? But then you pay for this. And then as this documentary goes on, Portia, you meet different characters in it, and you meet, like, there was one. I was trying to just look up their names again really quick. Portia Pendleton, LCSW: So is this online mostly, like, the university? Like, I could sign up and take the class. Dr. Katrina Furey, MD: You could go right now. I went to the website, actually, to see if it\u0027s still there. And it is. So it is online. And then they started having in person meetups, which I think once you do that, then those connections are even stronger. Right? Like, now you\u0027re seeing each other in person, and it\u0027s like, this is our community. This is our. He did, the leader, Jeff did have a goal of eventually having an actual community. Like, we\u0027re all going to move to this place. I don\u0027t know if that ever happened or not, but so we meet a lot of different people involved. And one person involved that really struck me was this young girl named Marley. I think she was in her late teens when she got involved. And again, I feel like that\u0027s, like, the perfect person who\u0027s susceptible. Like a 17 year old with an Internet connection. Portia Pendleton, LCSW: You\u0027re really figuring out who you are. Dr. Katrina Furey, MD: Right, exactly. You don\u0027t have a fully formed identity yet because you\u0027re so young and you\u0027re just trying to figure it out. And we don\u0027t know anything about her background, so I\u0027m not going to speculate, but basically, she was super young going to these classes. I don\u0027t know how she\u0027s paying for it. I\u0027m not sure. And then what really struck me is basically, like, jeff and Shalia, the leaders would tell their participants, like, we know who your twin flame is. So, like, once you\u0027re self actualized enough, we\u0027ll let you know. Or we\u0027re going to help make the map. Yes, exactly. Like this ultimate puppeteer, right? This ultimate. And, like, they showed this scene where they were at the in person meetup, and they\u0027re all meeting for the first time, and they\u0027re talking to Marley and saying, like, well, is there anyone special in your life? Right? You know, they\u0027re showing this stuff, and somehow they have footage of it in real, like, they have the old footage. So someone was, like, filming all this, but then they\u0027re also showing Marley, like, present day, reflecting on the experience, and they\u0027re asking her, is there anyone special in your life right now? And she\u0027s kind of shy because she\u0027s like a kid and like, well, not really. And then Jeff\u0027s pushing her, like, are you sure? Are you sure? Sort of like, suggesting, like, he knows. And then she says, like, well, this guy has been texting me. And he\u0027s like, oh, that\u0027s it. That\u0027s it. This random guy who\u0027s texting her, and then that\u0027s her twin flame. Over time, she starts having a relationship with this guy. She moves in with him when she\u0027s really young. I can\u0027t remember the age difference, but there was a pretty significant gap. Not like 20 years, but maybe somewhere between five to ten years. And he had a criminal past. He was doing a lot of drugs. That\u0027s all we know. We don\u0027t know if there\u0027s any other trauma going on in the home as they\u0027re living together. I wouldn\u0027t be surprised if there was. And it just broke my heart that this young girl gets sucked in to thinking this is the person she\u0027s supposed to love, right? And you\u0027re just so brainwashed by it. So that was really captivating and sad. And then the other things that we see in the twin flames universe is we see a woman named Keeley, who\u0027s a key character in the documentary because she got in early and became, like, one of the teachers. So she was someone who was know. Jeff and Shalia are here. She\u0027s like the next level and trying to train other people. And how do you do the classes and stuff? And by the way, all these people are working for free. No one\u0027s getting paid. Eventually, Jeff and Shalia somehow incorporate to be a religion so that they don\u0027t have to pay taxes. And it\u0027s just like, again, all of this stuff is messy and very classic for so. But what\u0027s interesting about Keely in this documentary is that she comes in, she finds her twin flame very early on and is sort of put on this pedestal of the ultimate example of, like, look, it\u0027s not just us, Jeff and Shalia, who found our true love. These people also did using our methods, and now they can teach you. So they\u0027re like the ultimate teachers. And over time, she starts to kind of doubt what\u0027s going on. She eventually leaves, and you really see her grapple with the shame and guilt of what she did while she was part of the cult. And there\u0027s a scene at the end where she meets another former cult member who she used to be, like, the teacher of and would really push to do unhealthy things. And they just have this moment, this conversation where she\u0027s so genuinely apologetic, and it\u0027s really heartbreaking. You really see how that whole thing about how someone who\u0027s been abused becomes an abuser, and it\u0027s really heartbreaking to witness. So she\u0027s a really compelling character. And then the cherry on top of this awful Sunday, Portia, is that. Portia Pendleton, LCSW: Just nervous. Dr. Katrina Furey, MD: I know. You should be like, hold on tight. So as if all of this wasn\u0027t bad enough, as they know, Jeff and shalia start morphing their teachings to include that everyone is either a divine masculine or a divine feminine. Okay? So they\u0027re saying you\u0027re either a divine masculine or a divine feminine. You don\u0027t have both characteristics of both. And you have to find, like, if you\u0027re a divine, if you are a divine feminine, you have to define your divine masculine and vice versa. Like, two divine feminines, two divine masculines can\u0027t be together. Okay? So then they start telling people whether they are a divine masculine or feminine, whether or not that matches with that individual\u0027s own sense of their gender, okay? And it\u0027s also not based on the person\u0027s outwardly appearing gender. So they\u0027re not telling all the outwardly appearing girls you\u0027re defined feminine, and all the outwardly appearing males, you are divine masculine. The reason why is because they had way more women as students than men. So I think they started running out of men to pair with people. Honestly, it seems like. So they started telling certain women, like, you are a divine masculine, and this divine feminine is your twin flame. You need to be in a relationship with them. And some of these people now who are being interviewed are like, I\u0027m not attracted this person. I don\u0027t feel like I\u0027m trans or anything like that. In Portia, it goes so far that some of the people got top surgery. I know. And so abuse 100% across the board. This is why I feel like we can make the exception and talk about cult like this, because it is so atrocious. It\u0027s like a human rights violation, I feel like. And what I really liked about this documentary, actually, is that. And I was, like, talking about this just socially with some of my friends who aren\u0027t in the mental health field. And they agreed that they really appreciated how in this documentary, they had someone who is, I forget exactly what their title was, but they work at, like, a university and gender studies and do a lot of advocacy for transgender rights and things like that. And they very clearly said, this actually is anti trans. Like, twin flames university is advertising itself as pro. Like, we support this. We\u0027ll support you when no one else in your family does. We\u0027ll support you getting your surgery and things like that. But they\u0027re like, this is actually completely anti trans because you are telling someone what they are and how their body should look, and you don\u0027t care if that matches their own inner experience. Right? And that is like, bad. So bad. And so this documentary does follow a couple of people in particular who ended up getting surgeries. And one of the most heartbreaking scenes is when they follow a group of mothers who have been disconnected from their children, who have joined this cult. And one of them is watching her daughter talk about getting top surgery because she was told she\u0027s a divine, masculine, and it\u0027s just so heartbreaking to see. And then the other two pieces of the documentary that just blew my mind were at the beginning, they advertised having, and there was a psychologist involved, okay? Like someone with real training. They advertised having some sort of treatment for PTSD, of all things. And I just think that is disgusting. It is egregious. It should be reportable to whatever medical or psychology board this person is licensed by because they\u0027re advertising like, we have this treatment. And really they\u0027re just like indoctrinating people. And so that was really disgusting to me. And the last thing I wanted to tell you about was we saw one of these moms as she\u0027s talking to the camera about basically her child cut her off. And she keeps trying to reach out. She\u0027s not hearing back, but she keeps trying. And I feel like that\u0027s a message I want to get out is like, if you have someone you love in one of these cults or high control groups, just keep reaching out, even if you\u0027re getting nothing back, because you just have to keep that thread of attachment going so that when the person is hopefully ready at some point to leave, they know you\u0027re still there. So this mom kept reaching out, kept reaching out even though she wasn\u0027t getting anything back. And then as she\u0027s talking to the camera, her child text messages her. And you see her very genuine reaction, just like. And all the text said was like, mom, it\u0027s me. I need help getting out of this relationship. And she\u0027s just like, I just got chills trying to tell you about it because it\u0027s so moving and it\u0027s so sad. And you see just such a genuine reaction of her saying, like, oh, my God, she got back to me. I want to say something, but I don\u0027t want to push her away. I want to keep this going, but I don\u0027t want it to be too much like what do I way? And then you see her telling the other moms that she heard from her child and how they\u0027re supporting each other. Oh my God. It\u0027s really intense. And I would say this documentary is very hard to watch because you really see how so many people have been exploited and traumatized and how they\u0027re trying to pick up the pieces and how there\u0027s still so many people in it. But I think it really speaks to cults and kind of what it\u0027s like. And I feel like twin flames to me always sounded like ludicrous. It just sounds like something that\u0027s so ludicrous. But I think that\u0027s also an important point is that to some people it\u0027s not ludicrous. Yeah. And it just depends on what you\u0027re searching for. Right. Whether it\u0027s like love or a family or money for MLM schemes. Portia Pendleton, LCSW: Right. So that key part, I think in your cult and that what you not. Dr. Katrina Furey, MD: Dr. Fairy\u0027s cult, I do not have one. Portia Pendleton, LCSW: I am not a guru. Right. So in love has won, which I watched, which is on HBO or Max, three parts, 3 hours. It sounds like there\u0027s a lot of people who are in general prior to joining are kind of like anti establishment. Some the government isn\u0027t working for us anymore, which a lot of people feel that way. Dr. Katrina Furey, MD: Exactly. Portia Pendleton, LCSW: So there\u0027s these know, I think sometimes really normal thoughts or feelings somebody could have. Dr. Katrina Furey, MD: And then it\u0027s like the kind of. Portia Pendleton, LCSW: Takes that and it\u0027s like, oh, yeah. So like we also believe this. And then they kind of continue to pull you in. I think we saw that a little bit with QAnon stuff. It\u0027s like some of what I\u0027m sure they had out there is pretty believable. So that kind of draws the person to do more research and then all of a sudden you\u0027re in a cold. Dr. Katrina Furey, MD: Right. And again, it\u0027s like, I feel like it\u0027s certain types of people who are going to keep getting sucked in. And the leaders have an uncanny ability to sniff that out and they know who they can manipulate and exploit, right. Portia Pendleton, LCSW: No, totally. So speaking of that. So Amy Carlson or mother God. Dr. Katrina Furey, MD: Oh, mother God. Portia Pendleton, LCSW: Or mother Earth or divine mother was a young, I\u0027d say attractive woman who had three husbands and some children who she ended up leaving all for her own kind of spiritual journey. So her mother and sister describe her as being really charismatic. She worked at McDonald\u0027s and was kind of immediately, like in a leadership role, she was constantly being promoted. Her team loved her. She had this way with people. During that time, she was with a partner, and she had several children, et cetera. So then she starts to kind of join these online chat groups, which I feel like is a pretty common start to the depths of the Internet. So she started with spiritual singles, and she ended up meeting this man who was much, much older than her, or at least he appears much older than her on lightworkers.org. So they were, like, messaging back and forth. It\u0027s basically just people who are, I would imagine, interested in spirituality, and you can chat with each other about the divine and mutually interesting things. So she meets Amorith White Eagle, and she ends up meeting him. Dr. Katrina Furey, MD: What\u0027s that name again? Portia Pendleton, LCSW: So it\u0027s amorous white eagle. Dr. Katrina Furey, MD: Is this person, like, indigenous? Portia Pendleton, LCSW: I don\u0027t know. Okay, so this all kind of then takes place in the Pacific Northwest, it appears Colorado, Oregon, kind of back and forth. So she meets him. They end up getting married. I\u0027m not sure if it\u0027s a legal marriage or they just have a ceremony, and they start putting their message out online. So they\u0027re interviewing him. He appears, I don\u0027t know, like, 70, and she\u0027s, like, 30. But funnily, that is. She, though, seems like she\u0027s running the show still. So he\u0027s very peace and love, and he\u0027s kind of going along with whatever she\u0027s saying. So she wants to put more on social media. He\u0027s like, okay. And then she ends up leaving him eventually, I think, like, after a year, to kind of start an organization with people that she also met online who are then more close in age to her. Dr. Katrina Furey, MD: Did she use his money or something? Portia Pendleton, LCSW: No, it seemed kind of like they lived in nature. He didn\u0027t really have much. He seems like this is an opinion, like, sweet. Like, just like a hippie. Like, living on the land. Dr. Katrina Furey, MD: New ag. Portia Pendleton, LCSW: Yeah. Dr. Katrina Furey, MD: Okay. Portia Pendleton, LCSW: And so she then he, like, compost. Yeah, totally compost. She takes that and runs with. She gets. She meets this guy who she, um. So this is a big kind of part of her. So she heals him of cancer. Dr. Katrina Furey, MD: They always are healing people of cancer. Jeff and Shalia said they could do that, too, by the way. And they also call themselves the divine father and the divine mother. And they went through ivf to have a daughter who\u0027s the defined daughter, and I worry for her. But sidebar. Anyone who\u0027s calling themselves divine father or mother, run away. Run away. Yeah. Portia Pendleton, LCSW: And that always seems to be a theme of healing people. Dr. Katrina Furey, MD: Yes. Portia Pendleton, LCSW: So he comes to live with her, works with her, and then there\u0027s this other person who comes in who then becomes, like, the second father God, who he appears to not be in the cult anymore as he\u0027s being interviewed for the show. So he kind of has, like, a different stance than everyone else who is interviewed who appear to still really believe some of her messages. So this is not even the crux of the story. So she gathers these group of people who they talk about have pretty significant trauma histories, and then these beliefs come out where. So they believe that they are being led by, like, Robert Williams, St. Germain. Most of these people who are deceased, there\u0027s only one living person who is Donald Trump. So they have this board with all of their pictures, and she\u0027s constantly getting messages from Robin Williams and has been. So she\u0027s God who\u0027s billions of years old. She has been Marilyn Monroe, she has been Cleopatra. She\u0027s been all of these kind of famous women throughout history who\u0027ve done different things. So I was like, you\u0027re Marilyn Monroe and you\u0027re like Joan of. Oh, okay. They\u0027re just different. Dr. Katrina Furey, MD: Like reincarnation or something. Portia Pendleton, LCSW: Only for her, it\u0027s not. Dr. Katrina Furey, MD: Ultimate exception. Portia Pendleton, LCSW: Yeah, so Robin Williams is telling know, I\u0027m kind of skipping some things, but basically that she needs to be at a really low weight to be picked up by the starships. So she starts restricting her food intake, which is just interesting because that\u0027s what I do in my private practice. I was like, oh, here we go. And to be, like, 103 pounds, she has to be under 103 in order to be picked up. So other people in the group as well start restricting nutrition. The lighter you are, the higher frequencies you can tolerate. So they also believe that marijuana and alcohol are, like, tools of healing if used appropriately, which they do say, which I was like, okay. But apparently her use of alcohol combined with her food restriction seems to lead to her downfall. So she gets really sick, like, pancreatitis. I think her liver is failing, probably. And so she\u0027s very small. They go to Hawaii to try to heal her. She gets Kauai. They get literally driven out of Kauai by the people who live there because she is now saying that she is, and I\u0027m not remembering it at the time, but she\u0027s like, there this goddess that they believe in, and she\u0027s saying that she\u0027s that person or that spiritual leader, and they\u0027re like, no, you\u0027re not. That\u0027s really disrespectful. So they leave Kauai go back to Colorado, and she\u0027s dying. And meanwhile, this whole time they\u0027re trying to save her, and she\u0027s ingesting high levels of colonial. Dr. Katrina Furey, MD: Oh, just try to heal her. Portia Pendleton, LCSW: Quote unquote. Dr. Katrina Furey, MD: Yeah, okay. Portia Pendleton, LCSW: And so she ends up passing away. And meanwhile, her family, before this, has put her on Dr. Phil to try to point out that she\u0027s a cult. Dr. Phil is involved. It doesn\u0027t work. She presents as just, I\u0027m really spiritual and not giving culty vibes at all. Doesn\u0027t do anything. Meanwhile, they interview her daughter, who\u0027s just sad watching it. She feels abandoned by her mom. So Amy dies, and they are convinced, per her, that she is going to be picked up by the starships. So they have her body at home, or it happens in a hotel, and they are, like, holding up these freak. Dr. Katrina Furey, MD: These. Portia Pendleton, LCSW: They use them in the ghost stories where you hold up this instrument and, oh, the thing goes crazy. The frequency. So they\u0027re, like, holding it up to her dead body. Meanwhile, all of this, they have filmed. They\u0027ve filmed and written down everything that she\u0027s ever done. She sleeps five times. She did this because she\u0027s God. Dr. Katrina Furey, MD: And so they have a dead body. Portia Pendleton, LCSW: With them for a week, like a week or two. They end up leaving the hotel because people are really confused and concerned. They go back to the house in Colorado. The police end up coming. She\u0027s modified. Dr. Katrina Furey, MD: Yeah, that\u0027s what. Oh, my God. Portia Pendleton, LCSW: And it was never taken. And they still kind of were saying that they believe to this day that we are so curious what her autopsy showed. She has three hearts. I\u0027m sure all the medical people were blown away and everyone still believe it. To kind of branch off and do something with spirituality. Again, it was a pretty small cult. There was, like twelve to 20 active members who were living there. Then again, they made over $350,000 that one of the members then stole after she died and took because all of it was in his name. Because there\u0027s always a theme of money, greed, power in a cult, in my experience. So I think we saw all of the key themes of a person with a really unique ability to have charisma and charm. It just seems like there\u0027s always common themes with cults which we see over and over again. And I think really what I was keeping in mind while watching this documentary is there can be such a fine line between spirituality and just having different beliefs that maybe are not mainstream, and that\u0027s okay. But there becomes this little line that gets crossed where there\u0027s like abuse and someone taking advantage over someone else. And it\u0027s like that, to me, is really the difference between anything you want to believe in or do or how you want to live. But when you\u0027re harming others or being harmed, it\u0027s like that\u0027s when it\u0027s not. Dr. Katrina Furey, MD: Okay. Right. And I think I had a friend recently ask me, how do you tell the difference between someone who\u0027s psychotic and someone who is running a cult but not psychotic? So the woman you were just describing to me, Portia, the mother God person, sounds like she may have had elements of both, which is possible, although I would imagine, although I don\u0027t know for sure, more rare. But again, I would say people who are cult leaders tend to meet criteria for what we call malignant narcissism. So, again, as we talk about with narcissistic personality disorder, they really elevate themselves into this God role. They believe God is talking to them, but then they also take advantage of other people, whereas I think someone who is just struggling with a psychotic disorder, who may have religious delusions, again, they might also believe that God is talking to them, but then they\u0027re not using that to their advantage and exploiting people to make money or for sex or some other kind of secondary gain. So I think that\u0027s something important to note. Portia Pendleton, LCSW: Yeah, no, I would agree. It\u0027s so hard. And I think we should, like you said, create some merch. We need, like, a clear checklist to ask yourself to disseminate to everyone. Like, is this a cult or not? Where are the red flags? Dr. Katrina Furey, MD: Seriously? Seriously. Again, I would say be very wary of anyone calling themselves a guru or using words like that who doesn\u0027t have the applicable training or credentials. That even goes, I think, for getting medical advice online, like on Instagram and TikTok, be really cautious and look into what is this person\u0027s credentials? Are they really qualified to be telling me these things? Be mindful of how much are they charging? What are you getting from it when they\u0027re charging you? And what does your gut tell you? If your gut red flags are going off, you got to listen. Portia Pendleton, LCSW: Yeah, that\u0027s a good one. I like the part about the cost, because things should feel balanced. If you\u0027re getting a worksheet or if I\u0027m paying an insurance via insurance for therapy and I\u0027m paying, I don\u0027t know, it can be anywhere from 90 to 150, depending on an insurance rate, for an hour. And that person is credentialed. Right. If you take insurance, you have to be a certain quality of practitioner. And so if you\u0027re seeing someone who\u0027s like a guru or a coach and you\u0027re paying privately and they do not have the credentials, and I\u0027m paying maybe $800 for an hour sessions, it\u0027s like. Dr. Katrina Furey, MD: That just feels off. Portia Pendleton, LCSW: And I\u0027m not talking about private pay or for someone who does have credentials, but if you can get therapy from a certified, licensed practitioner that generally, sometimes insurance covers, sometimes it doesn\u0027t, for around $100, depending where you are and someone, a coach is asking for hundreds and sometimes thousands of dollars, that just feels off. Dr. Katrina Furey, MD: Right. And that is a theme we\u0027ve seen, at least in these two documentaries we\u0027re talking about today, is the cost of the classes or whatever it is you\u0027re buying seems exorbitant. I mean, like at twin Flames University, I read they were charging $4,000. That\u0027s crazy. That\u0027s really a lot of money. So you really just have to be mindful of what are you getting out of it. And as soon as you start to get a whiff of someone trying to change who you are or someone trying to convince you that they know you better than you know yourself, huge red flag. Run away. If you\u0027re feeling devalued around them and they\u0027re always putting themselves on a pedestal. Run away. If everyone\u0027s fawning over them and the people who bring up a criticism or have a question get ostracized. Run away. Run away. Portia Pendleton, LCSW: Yeah, that\u0027s a good point. That\u0027s on the sweatshirt. Dr. Katrina Furey, MD: Run away. Yeah. Portia Pendleton, LCSW: So you can find both of these documentaries. One of them, the one Katrina watched, twin flames, is on Netflix. And then the one that I watched, love has won, is on Max, both short kind of docuseries, which I loved that it wasn\u0027t 8 hours. Both sad and just the after effects are sad. And cults obviously can be so dangerous and abusive. There\u0027s many practitioners out there who specialize with treatment of people who have been in a. If you\u0027re. If you have more interest in it, like Katrina is going to link that psychology today article and then know, I think our biggest theme is please reach out. Dr. Katrina Furey, MD: Right. Portia Pendleton, LCSW: So in the one I watched, there was a mother who continuously was kind of getting police involvement and calling her daughter and contacting her, and they ended up reuniting at the end. And just as painful as it is, please don\u0027t give up. Dr. Katrina Furey, MD: Don\u0027t give up. Don\u0027t give up. Yeah, that\u0027s a big theme I want to get across, too. And we\u0027ll keep covering cults I think moving forward, again, we want to be mindful and be really clear. We\u0027re not analyzing any one person in particular. We\u0027re just using this media to talk about this phenomenon in more detail because it is so dangerous and so many people are getting hurt by these things. And I would imagine like coming out of COVID with so much more happening, think, you know, it\u0027s reaching more people these days, like cults, and all you need know, you can be in a cult of one. It doesn\u0027t have to be huge. So that\u0027s another thing to keep in mind is these dynamics can play out in smaller communities, smaller relationships, even within families. So we\u0027re hoping to try to shed some light on these toxic dynamics so you can protect yourself totally. Portia Pendleton, LCSW: Well, thank you for joining us today, and we look forward to catching up with you next time as we cover another movie or tv show. Dr. Katrina Furey, MD: Yeah, and find us on TikTok and Instagram and YouTube at Analyze Scripts podcast. Please rate, review, and subscribe and let us know what you think. And let us know what you\u0027d like to hear us cover. Next. Bye bye. Dr. Katrina Furey, MD: This podcast and its contents are a copyright of analyzed scripts, all rights reserved. Any redistribution or reproduction of part or all of the contents in any form is prohibited unless you want to share. Dr. Katrina Furey, MD: It with your friends and rate, review, and subscribe. That\u0027s fine. Dr. Katrina Furey, MD: All stories and characters discussed are fictional in nature. No identification with actual persons, living or deceased places, buildings, or products is intended or should be inferred. This podcast is for entertainment purposes only. The podcast and its contents do not constitute professional mental health or medical advice. Listeners might consider consulting a mental health provider if they need assistance with any mental health problems or concerns. As always, please call 911 or go directly to your nearest emergency room for any psychiatric emergencies. Thanks for listening and see you next time.",
      "release": "2024-01-15T12:12:30Z",
      "duration": "00:43:13.3000000",
      "explicit": false,
      "spotifyId": "2hwavghslS7ZURGf1lZFjy",
      "appleId": 1000641703523,
      "subjects": [
        "Twin Flames Universe",
        "Psychology",
        "Multi-Level Marketing",
        "Love Has Won",
        "Qanon",
        "Cult Psychology",
        "LuLaRoe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2hwavghslS7ZURGf1lZFjy",
        "apple": "https://podcasts.apple.com/podcast/episode-54-cult-v-cult/id1669386748?i=1000641703523"
      }
    }
  ]
}