{
  "_ts": 0,
  "id": "b47eba56-3ae0-46fa-89ae-1ecec7e940c0",
  "name": "Anastazya Batis",
  "youTubeChannelId": "UC-o0nU0YuUsAGToy3ckpW6A",
  "episodes": [
    {
      "id": "27447cb0-0b78-492c-b119-e2e97bd5c970",
      "title": "Deel 1: Analyse Cult Structuur Shincheonji",
      "description": "Ben jij gehersenspoeld zonder dat je het doorhebt? In deze video duiken we in de wereld van sekten en hoe ze mensen manipuleren zonder dat ze het zelf beseffen. We delen ons persoonlijke verhaal: hoe we gevangen zaten in de structuur van een cult genaamd Shincheonji (nieuwe hemel nieuwe aarde) (Zion Mission center). \n\nHoe we uiteindelijk konden ontsnappen dankzij het BITE-model van Steven Hassan, cult-expert en voormalig lid van een destructieve sekte, hebben we onze vrijheid en helderheid teruggevonden.\n\nHet BITE-model helpt ons begrijpen hoe sekten controle uitoefenen op Gedrag (Behavior), Informatie (Information), Gedachten (Thoughts) en Emoties (Emotions). \nZelfs als je denkt dat je uit vrije wil handelt, kan die vrije wil systematisch zijn overgenomen. \n\n***** Dit is een waarschuwing: niet alles is wat het lijkt, en manipulatie kan dichterbij zijn dan je denkt.\n\n📚 Meer leren over het BITE-model?\nLees hier meer over Steven Hassan en zijn werk:\n • Steven Hassan’s officiële website\n • Het BITE-model uitgelegd\n\n\n\n_ DOCTRINE EXPOSED:\n\n• https://www.youtube.com/watch?v=l-75hLU3o9E\u0026list=PL6Ri6OFv6q-x2nI8EizGB1rVMQ6VgnW12\u0026index=5\n\n• https://www.youtube.com/watch?v=KgXmRFgGA_A\u0026list=PL6Ri6OFv6q-x2nI8EizGB1rVMQ6VgnW12\u0026index=6\n\n\n🔗 Bekijk ook :\n_ Church of Shincheonji: Inside the alleged cult and the tactics former members used | 7NEWS\n • https://www.youtube.com/watch?v=s6X9qpIvEkA\u0026t=2s\n_ Face to face with the head of Shincheonji New Zealand | Part 2\n • https://www.youtube.com/watch?v=4nrLZsGOK5w\u0026t=905s\n\n\n🙏 Onze boodschap:\nAls jij twijfelt aan je situatie of die van een geliefde, weet dat er hulp beschikbaar is. Probeer altijd respectvol te blijven en liefdevol ze weten niet wat ze daadwerkelijk doen en waarin ze zich bevinden. Deel deze video met anderen. Samen kunnen we bewustwording creëren en slachtoffers van mentale en emotionele controle helpen.",
      "release": "2024-12-23T18:34:30Z",
      "duration": "00:25:09",
      "explicit": false,
      "youTubeId": "mNEgWzIFCQw",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mNEgWzIFCQw"
      }
    }
  ]
}