{
  "_ts": 0,
  "id": "19cac77b-cc0b-49b2-9266-8a9192e3a7c5",
  "name": "Andrew-Ryan Profaci",
  "youTubeChannelId": "UC48FmX7U2oJEaRJLV_9nEGA",
  "episodes": [
    {
      "id": "693e9f5b-bf3a-4694-afa5-a3f83870e0fa",
      "title": "Mother God Cult Exposed: Shocking Insider Secrets",
      "description": "Prepare to uncover a shocking truth about the Mother God cult, also known as the Love Has Won cult—a dark and twisted story of power, manipulation, and betrayal that you won’t hear anywhere else.\n\nThis exclusive insider account reveals the never-told shocking events of Amy Carlson, the enigmatic \u0022Mother God,\u0022 whose tragic end made international headlines when her mummified body, wrapped in Christmas lights, was discovered worshipped as a shrine in a bedroom. (With children living in the home.)\n\nThis story is a deep dive into the inner workings of this now-infamous cult, exposing a web of lies, manipulation, and spiritual abuse that destroyed lives. From false promises of \u0022divine healing\u0022 to sexual exploitation and the ultimate betrayal, this is the untold story of how power and delusion spiraled into chaos.\n\nHear a first-hand account of the first moment when \u0022Mother God\u0022 made the decision to go dark-side and leave her beliefs of love, truth, and unity, in the rear view mirror.\n\nAs someone who not only lived within the cult, but was in a very close relationship with her, my personal accounts have been highlighted in cult documentaries aired by mainstream networks such as; Dateline NBC, VICE, HBO, and more.\n\nI share firsthand details of Mother God’s deception, the disturbing behaviors of some followers, and the schemes used to try and control all of the vulnerable people in her sphere. Witness the psychological manipulation, the abuse disguised as spiritual enlightenment, and the devastating impact on those who believed her lies.\n\nThis is not just the story of a cult leader’s inevitable spiral down—it’s a raw, personal account of survival, the fight for truth, and the dangers of unchecked power in spiritual movements.\n\nWHAT YOU\u0027LL DISCOVER:\n-The truth behind Mother God’s shocking life and death.\n-How manipulation and mind control were used to trap followers.\n-The disturbing realities of spiritual exploitation and abuse.\n-Why cults like Love Has Won thrive—and how they destroy lives.\nThis exposé is essential viewing for anyone interested in cult psychology, spiritual abuse, and the devastating consequences of blind faith.\n\nDON\u0027T MISS this shocking exposé of deception, manipulation, and abuse.\n\n#MotherGodCult #LoveHasWon #CultExposed #CultSecrets #TrueCrimeDocumentary #SpiritualAbuse #MindControl #CultSurvivor #DangerOfCults #ExposingCults #CultLeader #CultLife #Deception #Manipulation #TrueCrime #AmyCarlson",
      "release": "2025-01-15T22:32:58Z",
      "duration": "00:31:04",
      "explicit": false,
      "youTubeId": "67Y8mIZqiSE",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=67Y8mIZqiSE"
      }
    },
    {
      "id": "5c2ecc83-574f-41bf-ba11-18192b53e4ce",
      "title": "The Quantums, A Cult\u0027s Shocking Web of Lies, Deception, and Abuse That Proved Mother God Was a Fraud",
      "description": "Prepare to be stunned. This is the 100% true inside story you won\u0027t hear anywhere else. From deep within the inner circle of a now notorious cult, led by my ex-lover who, years later, would become to world-famous and enigmatic \u0022Mother God.\u0022 Witness firsthand the shocking web of lies, manipulation, and sexual exploitation that concealed a dark secret.\n\nLearn about the ultimatum I was given in order to hide the truth and keep their charade alive. Learn about the sick and twisted lengths one twisted man would go to in order to take sexual advantage of a girl who wasn\u0027t in her right mind.\n\nDiscover how a charismatic leader exploited her followers, including myself, through deception and abuse of power. This is a true story of betrayal, manipulation, and the fight for truth against a powerful and dangerous cult.\n\n#CultDocumentary #TrueCrime #MotherGodCult #Deception #Manipulation #Abuse #Exposed #rape #CultLife #CultExposed #SpiritualAbuse #MindControl #TrueCrimeDocumentary #CultSurvivor #DangerOfCults",
      "release": "2024-12-26T20:44:24Z",
      "duration": "00:29:59",
      "explicit": false,
      "youTubeId": "lX3g7lBHMTE",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lX3g7lBHMTE"
      }
    },
    {
      "id": "8586aa46-f53d-497d-a493-8903192f7f68",
      "title": "Surviving Cancer and a Cult: Secret Untold Stories of Mother God and the Love Has Won Cult",
      "description": "An Update on My Health and Shocking Insights Into the Love Has Won Cult\n\nIt’s been one year cancer-free, and I’m beyond grateful for all the support you’ve shown me throughout my journey. In this video, I’m sharing a belated health update along with a major shift in focus for this channel.\n\nFor those who have followed me during my cancer battle, thank you from the bottom of my heart. Your encouragement means the world to me. As I move forward, I’m opening up about a deeply personal and shocking chapter of my life: my past involvement in the Love Has Won Cult, led by Amy Carlson, aka “Mother God.”\n\nNearly a decade ago, I was part of what started as a well-intentioned spiritual gathering. Over time, it devolved into something dark and insidious, culminating in national headlines when Amy passed away and was found as a mummified corpse wrapped in Christmas lights.\n\nAmy was my ex-lover, and I spent years trying to “snap her out of it” before ultimately parting ways, fearing the worst—an outcome that tragically came to pass.\n\nDue to an outpouring of requests and finally feeling ready, I’ve decided to begin sharing the inside stories of my experience with this group. These videos will offer a glimpse into the rise and fall of the Love Has Won cult as I also work on a book detailing it all.\n\nI know this shift in content may feel unexpected, and I appreciate your understanding as I dive into these raw and intense memories. Thank you for being here and for supporting me as I navigate this new chapter of storytelling.\n\nStay tuned for more.\nAll the best,\nAndrew\n\n#CancerSurvivor #CultSurvivor #LoveHasWon #MotherGodCult #TrueCrime #Documentary #AmyCarlson #CrazyButTrue #SurvivorStory #InsideStory",
      "release": "2024-12-23T20:35:30Z",
      "duration": "00:05:10",
      "explicit": false,
      "youTubeId": "LppaBExfpkc",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LppaBExfpkc"
      }
    }
  ]
}