{
  "id": "886f1b8b-4c4b-49b8-8e79-85d41ee20ae5",
  "name": "Andy Mort | The Gentle Rebel",
  "spotifyId": "17NKOxPqaB0q1wzatMGpwv",
  "appleId": 350321446,
  "youTubeChannelId": "UCDSB6tx1uIlMy0JuFPYNmDg",
  "episodes": [
    {
      "id": "61ddc58d-aa01-40d3-b9ad-131501dad05b",
      "title": "61 | How NOT To Join a Coaching Cult (with Margarit Davtian)",
      "description": "In this episode of The Gentle Rebel Podcast, I speak with Margarit Davtian who is a consumer rights activist, social scientist, and “cult slayer”. She exposes deceptive marketing practices, cult psychology, and New-Age conspirituality trends in the coaching industry.\n\nMargarit, one of the founders of Ethics For Coaching, helps individuals seeking support in life coaching, business consulting, and self-help industries—the project shields against grifters and scammers who exploit vulnerable positions with undeliverable promises and unethical practices.\n\nEthics for Coaching’s mission is to educate, support, mediate, and raise awareness, giving consumers the power to make more informed choices. They aim to be a reassuring presence in an industry that can sometimes be hyped up, confusing, and misleading.\n\nAs you will know if you’ve been listening for a while, this is an area I am increasingly passionate about. I have seen bad actors take advantage of the trust and hope of good people, who have been convinced to spend ridiculous amounts of money on “high ticket offers” that promise the world and deliver disappointment.\n\nThe Elements of Ethical Coaching Include:\n\n    Clear expectations and outcomes\n    Be collaborative, non-judgemental, and willing to accept feedback as a coach\n    Deliver on your promises (and promise no more than you can deliver)\n    Communicate with clarity and honesty\n    Don’t use scarcity and urgency marketing tactics\n    Don’t use mindset manipulation tactics to overcome objections\n    No high-pressure selling\n    Understand potential sources of emotional/psychological harm\n    Don’t use coercive control (e.g. programming fears/phobias or using thought-terminating cliches)\n    Commit to establishing competence and maintaining professional boundaries\n    Establish contracting between coach and client\n    Be open about areas of knowledge and expertise (and what is beyond your scope)\n    State and clarify objectives and outcomes\n    Testimonials should only be used with explicit permission\n    No coercive conditions for joining a program (e.g. you MUST share a positive testimonial)\n    Make relevant qualifications, certifications, and credentials known\n    Include refunds, plagiarism, risk management plan (how a client knows what to do when they have a concern)\n\nWant to Know More About Ethics For Coaching?\n\nThey are looking for coaches who are passionate about this stuff to continue the work they’ve started.\n\nhttps://www.ethicsforcoaching.org/volunteer\n\nFind Margarit\nInstagram https://www.instagram.com/seekwithser/\nYouTube https://www.youtube.com/@seekwithser\nPodcast https://consciousrevolution.podbean.com/\nSubstack https://seekwithser.substack.com/",
      "release": "2024-06-07T23:00:35Z",
      "duration": "01:02:26",
      "explicit": false,
      "spotifyId": "3b8CBsIdhue9w68lKa1izv",
      "appleId": 1000658226180,
      "youTubeId": "zjxP30X9Asg",
      "subjects": [
        "Cult Psychology",
        "Self-Help",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3b8CBsIdhue9w68lKa1izv",
        "apple": "https://podcasts.apple.com/podcast/61-how-not-to-join-a-life-coaching-cult-with-margarit-davtian/id350321446?i=1000658226180",
        "youtube": "https://www.youtube.com/watch?v=zjxP30X9Asg"
      }
    }
  ]
}