{
  "_ts": 0,
  "id": "c59bd759-fb96-41df-9fa9-84da98c2c66b",
  "name": "Angeline",
  "youTubeChannelId": "UCF2ZcgJyN_ON4Mlg7QjFnDA",
  "episodes": [
    {
      "id": "d4a96940-640b-407f-b07a-03012fb3fe39",
      "title": "how I escaped a cult",
      "description": "I grew up in an abusive, misogynistic and homophobic cult as a sensitive, bisexual woman. Now, 8 years after escaping, I am finally sharing my story.\n\nMy last video where I exposed the church I was in (a sect nobody talks about since there is no information on it anywhere) went kind of viral, a big THANK YOU to all of you for making that happen! ❤️ If you have not seen it yet, it will give you some context for my story: https://www.youtube.com/watch?v=TSBjOyR24S0\u0026list=PLy4gl3Z6BBA5PFeGyflrN7ak7bxmBptKM\n\nA lot of you have been asking for my personal story of getting out. So in this video, I will tell you how I escaped the cult, despite having been indoctrinated since I was a child and without any outside help or influence. I will tell you about how my family, friends and other sect members reacted when I left, and in the end as a little bonus the thing that shocked me the most about “the world” after leaving?\n\n0:00     Intro\n0:39      Part 1: What growing up in the cult was like\n3:16      Part 2: The point I realized the cult sucked\n5:19      Part 3: My breaking point \u0026 decision to leave\n7:29      Part 4: Confrontation with parents \u0026 other members\n9:46      Part 5: The aftermath (finding my place, outing myself, …)\n12:38  Outro \u0026 what shocked me most about “the world”\n\n—\n\nA bit about me: I\u0027m Angeline (she/her) from Germany. Exposing myself like this on YT makes me feel very vulnerable, but it’s also kind of empowering. As a sensitive person that values mental health a lot, I want to create a safe space here where people find solace and compassion - because we all need more of that.\n\nFollow along if this resonates with you! :)\n\n—\n\nCopyright:\nBackground music in this storytime video is Maestro Tlakaelel by Jesse Gallagher.",
      "release": "2024-08-07T14:30:51Z",
      "duration": "00:14:09",
      "explicit": false,
      "youTubeId": "8q--0FrK5j4",
      "subjects": [
        "Old German Baptist Brethren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8q--0FrK5j4"
      }
    },
    {
      "id": "22d59dc8-1a82-4b21-b2ca-e8276f16e6c7",
      "title": "nobody knows this cult exists",
      "description": "I wanted to do this video for years. Right now I have the courage, I might delete this later.\n\nGrowing up in an abusive, misogynistic and homophobic cult as a sensitive, bisexual woman, there were a lot of things I always felt were wrong. But they were so normalised in the church culture that I thought I was the problem. Now, 8 years after leaving, I am finally breaking the silence about the disturbing practices happening behind the church\u0027s walls.\n\n00:00 Intro\n00:52 Background information on the cult\n01:25 Evangelisation services that spread fear\n02:28 Rules that keep you in the church\n03:32 Rules that keep you isolated from “the world”\n06:51 Rules on appearance, s*xualisation from a young age\n08:53 Rules on s*x \u0026 dating (purity culture)\n09:44 Marriage rules \u0026 non-consensual s*x\n12:03 Abstinence-only policy, LGBTQ\u002B issues\n12:51 No contraception / forced births\n14:16 Child abuse - physical “discipline”\n15:16 Sexism \u0026 traditional roles for men vs. women\n17:18 Justification for the rules\n17:55 No privacy, every detail shared with everyone\n19:55 Funny rules that show how s*x-obsessed the rule-makers are\n21:43 Outro\n\n—\n\nThe background picture from the Thumbnail is a random church in the Network, not the one I grew up in. I got the picture from here:  https://www.come-on.de/volmetal/kierspe/baptisten-auf-gebaeudesuche-91362709.html\n\n—\n\nIn this video, I share my personal experiences growing up in the mostly unknown religious community that can be classified as a cult or sect: The Brüder-Baptistengemeinde in Germany, a German-Russian Baptist church. I’ve wanted to make this video for years but was too scared, since so much of my personal history is connected to this cult and I still have many people I love in there.\n\nNonetheless, I feel it\u0027s important to expose the disturbing truths that happen behind closed doors. From child abuse and marital r*pe to the severe oppression of women and many bizarre and oppressive rules related to purity culture, I lay bare some dark realities of life in this cult.\n\nI do not want to offend anyone’s religious beliefs or speak against Christians or Baptists per se. That is not my intention at all. While I focus on the negative aspects in this video, I admit that the religion also brought many good experiences.\n\nBut there were also a lot of negative experiences, connected to the rules that I describe in this video. And just because people willingly follow these rules, it does not make the rules okay: People would follow anything if they were strongly convinced not following it would lead to eternal damnation!!!\n\nOkay, I’ll end my rant here. Please share and comment if you have any similar experiences or if this video resonates with you in any way. (Also, probably no one reads this until the end, but if you have, let me know by commenting this emoji: 🙈)\n\n—\n\nIf you like this video, you might also like my acoustic cover of Bird Set Free (it’s basically my life story in a song): https://www.youtube.com/watch?v=TgQUMs7VaMY\u0026list=PLy4gl3Z6BBA6fbnQSWusB9xKBUgm0R6Je\u0026index=9",
      "release": "2024-07-06T16:08:50Z",
      "duration": "00:22:12",
      "explicit": false,
      "youTubeId": "TSBjOyR24S0",
      "subjects": [
        "Old German Baptist Brethren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TSBjOyR24S0"
      }
    }
  ]
}