{
  "_ts": 0,
  "id": "2f788dcc-92e7-4113-be19-bda717d59990",
  "name": "anna solves",
  "youTubeChannelId": "UCo3OKK5cdUlytHgl3ehGVZA",
  "episodes": [
    {
      "id": "de10c33d-be0a-486b-ae61-7205a7153090",
      "title": "The Cult Baby Mom Who Was Tricked Into Killing Her Daughter By Her ’Master’",
      "description": "The Cult Baby Mom Who Was Tricked Into Killing Her Daughter By Her ’Master’\n\nPolygamy, mental health struggles, and cult-like control are all elements that played into an unimaginably heinous crime, the brutal murder of a defenseless baby girl. The story of 20-year-old Chloe Driver and the horrific murder of her 13-month-old daughter Hannah shocked and disgusted the entire nation. \n\nMost have painted Chloe as a sadistic and cruel monster who would do whatever it took to get the attention she so desperately craved, even if it meant sacrificing her only child. But now, many online commenters have pointed out that there may be much more to the story….including a side that is somehow even more sinister and disturbing. \n\nAhead of the murder of baby Hannah, the child’s very young and vulnerable mother found herself stuck in a toxic environment of complete control. While in a relationship with a man decades older than her, Chloe’s free will was stripped away from her causing her to feel helpless, powerless, and with no control of her own life. Is it justified for someone to be held responsible for decisions they made while living under the spell of a cult-leader? Let’s keep watching to find out. \n\n\n🚨 hi y\u0027all.. I appreciate all the love you\u0027ve given to my new channel, so be sure to check out my new anna uncovered video here! - https://youtu.be/t59IIqZf6Ec 🚨\n\n\n#annasolves #truecrime #documentary",
      "release": "2025-01-23T16:00:22Z",
      "duration": "00:19:49",
      "explicit": false,
      "youTubeId": "NqCZIIjd0-E",
      "subjects": [
        "Benyamin Ben-Michaeil"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NqCZIIjd0-E"
      }
    }
  ]
}