{
  "_ts": 0,
  "id": "13b749f9-08f2-4fc0-9b36-23a42107a902",
  "name": "Anna Marina",
  "youTubeChannelId": "UCxi5coKUf7HhvN_acCYzogg",
  "episodes": [
    {
      "id": "e72d730d-4d08-4bf5-a071-84c9808007bf",
      "title": "The Injustice of Disfellowshipping Faithful Christine",
      "description": "Christine has been one of Jehovah\u0027s Witnesses for 59 years. She is a faithful Christian who has done nothing wrong. But in 2019 she was disfellowshipped for questioning doctrine and asking about the child abuse issues. She was not told she was going to be disfellowshipped, the body of elders in her congregation just did it to her.\n\nNo criticism in this video or in my comments below are intended towards any genuine Christian. Myself and others were taught that Jehovah\u0027s organisation is a group of Christians trying to do things the way Jesus taught. It is also known as the body of Christ. There is only one and in no way is that body of Christ being attacked here. \n\n(John 15:1-6) . . .“I am the true vine, and my Father is the cultivator. 2 Every branch in me not bearing fruit he takes away, and every one bearing fruit he cleans, that it may bear more fruit. 3 YOU are already clean because of the word that I have spoken to YOU. 4 Remain in union with me, and I in union with YOU. Just as the branch cannot bear fruit of itself unless it remains in the vine, in the same way neither can YOU, unless YOU remain in union with me. 5 I am the vine, YOU are the branches. He that remains in union with me, and I in union with him, this one bears much fruit; because apart from me YOU can do nothing at all. 6 If anyone does not remain in union with me, he is cast out as a branch and is dried up; and men gather those branches up and pitch them into the fire and they are burned. . .\n\n\nCopyrighted material used in this video is covered by fair use for the purpose of criticism and in the public interest.",
      "release": "2019-03-15T00:41:03Z",
      "duration": "00:28:19",
      "explicit": false,
      "youTubeId": "zqoSR4ZdKPU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zqoSR4ZdKPU"
      }
    }
  ]
}