{
  "_ts": 0,
  "id": "139bad23-8887-4f47-8f19-dc0e8af77f42",
  "name": "AnonForTruth",
  "youTubeChannelId": "UCgOWgmK0AL_qRoKLW0mbghg",
  "episodes": [
    {
      "id": "04d747a2-70e8-432a-afd8-6a3d5e53b136",
      "title": "London Ex Sea Org Member Speaks",
      "description": "This ex Sea Org member asked to share his story on May 10th. Although his time in the Sea Org was only a small portion of his time in Scientology, the abuses he witnessed were enough to make him leave.\r\n\r\nLeaving was not an easy thing for him to do, and he is afraid of reprisals from the cult if he is identified, so he asked that his appearence and voice be concealed.\r\n\r\nFor more information:\r\n\r\nhttp://www.exseaorg.com/\r\nhttp://www.xenu-directory.net/practices/rpf.html\r\nhttp://www.xenu.net/archive/so/",
      "release": "2008-05-20T07:03:56Z",
      "duration": "00:05:28",
      "explicit": false,
      "youTubeId": "ZaoHISt7sNc",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZaoHISt7sNc"
      }
    },
    {
      "id": "ddf1ad3f-9803-46f1-ba37-a69b55695673",
      "title": "Suppression of Free Speech Anonymous Protest, 10th May 2008",
      "description": "If the sound is a bit out of sync it\u0027s youtubes fault\r\n\r\nThe scientologists somehow managed to convince the City of London police to censor any signs that contained the word \u0022cult\u0022 \r\n\r\nTo do this they invoked the Public Order Act (1994), a piece of legislation that was replaced in this context by the Racial and Religious Hatred Act (2006). Due to a legal precedent set by a test case under the Public Order Act, it can used to censor signs that actually incite violence. The Racial and Religious Hatred Act (2006) section defines religious hatred as hatred stirred up against a group of people defined by a particular set of religious beliefs. Furthermore, under section 29J (protection of freedom of expression):\r\n\r\n\u0022Nothing in this Part shall be read or given effect in a way which prohibits or restricts discussion, criticism or expressions of antipathy, dislike, ridicule, insult or abuse of particular religions or the beliefs or practices of their adherents, or of any other belief system or the beliefs or practices of its adherents, or proselytising or urging adherents of a different religion or belief system to cease practising their religion or belief system.\u0022\r\n\r\nScientology has been openly condemned as a cult in UK courts, for example:\r\n\r\n\u0022Scientology is both immoral and socially obnoxious...\r\nIt is corrupt sinister and dangerous. It is corrupt because it is based on lies and deceit and has its real objective money and power for Mr. Hubbard... It is sinister because it indulges in infamous practices both to its adherents who do not toe the line unquestionably and to those who criticize it or oppose it. It is dangerous because it is out to capture people and to indoctrinate and brainwash them so they become the unquestioning captives and tools of the cult, withdrawn from ordinary thought, living, and relationships with others.\u0022\r\n\r\n-- Judge Latey, 1984 ruling in the High Court of London \r\n\r\nMembers of the church of scientology have at times been refused entry to this country on the grounds that scientology is socially harmful. \r\n\r\nFor a brief overview: http://business.timesonline.co.uk/tol/business/law/columnists/gary_slapper/article3239734.ece\r\n\r\nTL:DR? Illegal censorship is illegal, Scientology is a CULT",
      "release": "2008-05-14T22:50:39Z",
      "duration": "00:09:26",
      "explicit": false,
      "youTubeId": "d4lGYogQHIg",
      "subjects": [
        "Scientology",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d4lGYogQHIg"
      }
    },
    {
      "id": "9442975b-e129-4646-a14f-b0f12ac5b708",
      "title": "xscnchild Part 2: Leaving Scientology",
      "description": "Leaving the cult can be very difficult, especially for those who grow up in it. It took 15 years for xscnchild to fully leave and integrate with the outside world.\r\n\r\nHis full story can be found at http://forums.enturbulation.org/24-personal-experience/born-into-scientology-my-story-1434/",
      "release": "2008-05-13T20:29:15Z",
      "duration": "00:04:42",
      "explicit": false,
      "youTubeId": "F53C-UfeIDk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F53C-UfeIDk"
      }
    },
    {
      "id": "65bf2bb6-4ca9-4d0d-b046-103abafba7b1",
      "title": "Xscnchild: Growing up in Scientology",
      "description": "An ex member of the church of scientology recounts his experiences growing up in the cult. According to the church of scientology, children are born with the capabilities of adults and should be treated as such. Due to this doctrine, children who grow up in the cult often receive little education or care, and are expected to work from a very young age.\r\n\r\nFor a full account of this ex members experience, see:\r\n\r\nhttp://forums.enturbulation.org/24-personal-experience/born-into-scientology-my-story-1434/",
      "release": "2008-05-12T19:59:02Z",
      "duration": "00:08:12",
      "explicit": false,
      "youTubeId": "OQ_igAPWdWQ",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OQ_igAPWdWQ"
      }
    },
    {
      "id": "bf6dc15c-82d5-4609-a765-bdf645dd79eb",
      "title": "Message to Scientology from ex member.",
      "description": "James McGuigan grew up in the cult and has been disconnected from his father and sister for several years. He came to Operation Reconnect (April 12th) to read this statement to the cult, urging it to reform. His sister was sent to handle him to prevent him speaking out. He very bravely persisted and told his truth.\r\n\r\nA full account of his case can be found at http://www.exscientologykids.com/james1.html",
      "release": "2008-05-04T21:46:54Z",
      "duration": "00:05:15",
      "explicit": false,
      "youTubeId": "88CcOSUTew8",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=88CcOSUTew8"
      }
    },
    {
      "id": "465404b5-f9dd-4bc5-bc52-9f3cc66179f3",
      "title": "Scientology vs. The Internet: The early Days.",
      "description": "Interview with a member of the UK Old Guard. He has been involved with the online struggle between Internet free speech and Scientology censorship since the early 90s.\r\n\r\nThis footage was taken on April 12th, I have subsequently lost my notes. If anyone knows this guys full name I\u0027d be grateful if they could let me know what it is.",
      "release": "2008-05-04T20:15:30Z",
      "duration": "00:06:54",
      "explicit": false,
      "youTubeId": "JWuIcFUKoS0",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JWuIcFUKoS0"
      }
    },
    {
      "id": "d3959c87-1f16-4f4c-81f5-0ed245e6a1b9",
      "title": "Interview with Richard Woods Part 2- CoS Libel suit",
      "description": "Richard Woods speaks about the libel case he and Bonnie fought against the Church of Scientology. They won, after a six year court battle.\r\n\r\nFor more information see: http://www.escapeint.org/legal/apology.htm",
      "release": "2008-04-14T19:48:57Z",
      "duration": "00:06:56",
      "explicit": false,
      "youTubeId": "trxYlBJT27U",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=trxYlBJT27U"
      }
    },
    {
      "id": "0fd5cfac-f098-4af9-9e07-17906aa3b89b",
      "title": "Interview with Richard Woods Part 1",
      "description": "Richard Woods is a long time campaigner against the human rights abuses of the church of Scientology in the UK. He and his wife Bonnie left the church in 1982. They run ESCAPE, an organisation dedicated to helping people with loved ones in the cult. To date this organisation has helped over 700 families and individuals.\r\n\r\nFor more info on ESCAPE: http://www.escapeint.org/homepage.htm",
      "release": "2008-04-13T20:07:09Z",
      "duration": "00:09:49",
      "explicit": false,
      "youTubeId": "rl9C3Mw1EbU",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rl9C3Mw1EbU"
      }
    },
    {
      "id": "dc82133b-b86f-4cd1-98fd-5929c34f404e",
      "title": "Interview with Bonnie Woods",
      "description": "Bonnie Woods and her husband Richard have campaigned in the UK against the abuses perpetrated by the Church of Scientology since the early 90s. Bonnie was a member of the Church for 9 years and a member of the sea org. She has been the target of Fair Game and litigation. She and her husband run the organisation ESCAPE, which is dedicated to helping people with loved ones in the cult. They have helped over 700 families and individuals. Bonnie was also involved with the group \u0022Families Under Scientology Stress\u0022 which was harassed out of existence in the mid nineties.\r\n\r\nMore info: \r\nESCAPE:http://www.escapeint.org/index.html\r\nFUSS:http://www.whyaretheydead.net/UK/FUSS.HTM",
      "release": "2008-04-13T14:21:52Z",
      "duration": "00:06:04",
      "explicit": false,
      "youTubeId": "HR37oJgsX0w",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HR37oJgsX0w"
      }
    }
  ]
}