{
  "id": "ff5bb494-38f1-4eca-ac72-54aa5c836865",
  "name": "AP Archive",
  "youTubeChannelId": "UCHTK-2W11Vh1V4uwofOfR4w",
  "episodes": [
    {
      "id": "89c027fb-5c71-40c3-b4bb-e55da22baea0",
      "title": "Epstein survivors implore Congress to act as push for disclosure builds",
      "description": "(3 Sep 2025) \r\nRESTRICTION SUMMARY:\r\n\r\n\u002B\u002BINCLUDES SHOT ANGLE CHANGES\u002B\u002B\r\n\u002B\u002BQUALITY AS INCOMING\u002B\u002B\r\n\r\nASSOCIATED PRESS\r\nWashington - 3 September 2025\r\n1. SOUNDBITE (English) Ashley Rubright, Epstein abuse survivor: \r\n\u0022To any survivors out there who feel like they don\u0027t matter. It it doesn\u0027t matter if you went once or countless times. We were groomed. We were manipulated. And we were taken advantage of. For decades, survivors have been suffocated by speculation. We\u0027ve been mocked. We\u0027ve been doubted. We\u0027ve been re-traumatized.  while those that hide and seek are what those responsible hide in secrecy. Why don\u0027t we deserve justice? This is not partisan. However, this is very political, as the only path to justice is through our political system. And this is about justice. This is about accountability. This is about protecting the innocence of our children and honoring the dignity of survivors. Everywhere we turn, the story follows us. It\u0027s in headlines, jokes, music, grocery store checkout lines, random conversations that you hear people having in restaurants. For more than 20 years, we\u0027ve been unable to escape it. And every time new promises are made,  our sparks of hope are lit only to be extinguished again. We are tired. However, we are not going away. We will not stop or give up. And we will be on the front lines of this battle. We are no longer scared. And let\u0027s be clear. There were so many enabling adults. Those enablers actively turned a blind eye, and they are the greatest danger.\u0022\r\n\u002BBLACK FRAMES\u002B\u002B\r\n2. SOUNDBITE (English) Haley Robson, Epstein abuse survivor: \r\n\u002B\u002BINCLUDES PAN TO AUDIENCE LISTENING\u002B\u002B\r\n\u0022I prayed for a moment. I prayed for this moment where God which would fill us with reinforcements. I want to acknowledge all the women unfortunately, that couldn\u0027t be here today because I think that is the only list of real great importance. And we should never forget the voices that were not only silenced, but that are not here today. And we should never forget the sacrifices that they made. So today, I would like to take a moment for Virginia (Giuffre), Sky, Danielle (Bensky) and Carolyn. Their voices were just as powerful and they were silence just as much. And for some reason I can feel their spirit, especially Virginia\u0027s today. She would be so proud and she would be so beside herself to see this one moment we have all came together to unite. And for our government and for the politicians who have taken our trauma and have weaponized it against us making it unbearable, making it unlivable, making it hard to move on in a life that we wish to live, in happiness, in joy and peace and justice that can only come from within at this point. And we have gotten to this point. Shame on you. Shame on you for using our trauma to weaponize this moment. We are not going to be fooled by your trickery. We are not going to be fooled by the lies, by the conspiracy theories. We are the keys to this situation. We have the truth. And the FBI knows the truth. The government knows the truth. You may pull this the wool over the sheep\u0027s eyes, but we are the keys. We know who is involved. We know the game. We know the players. And we are sitting here for 20 years waiting for you to get up and do something. Yeah, well guess what? Your time is up, and now we\u0027re doing it.\u0022\r\n\u002B\u002BENDS ON SOUNDBITE\u002B\u002B\r\nSTORYLINE:\r\nSurvivors of Jeffrey Epstein\u0027s sexual abuse made their voices heard Wednesday on Capitol Hill, pressuring lawmakers to force the release of the sex trafficking investigation into the late financier and pushing back President Donald Trump\u0027s effort to dismiss the issue as a “hoax.”\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/cc3a33e1116542f48360052d64fa05a6",
      "release": "2025-09-08T20:00:48Z",
      "duration": "00:03:50",
      "explicit": false,
      "youTubeId": "PW_UNOufTeo",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PW_UNOufTeo"
      }
    },
    {
      "id": "c7060cc4-eb97-4cbe-a1bf-da10dbab9b42",
      "title": "Guatemala: Los niños de la secta judía de son puestos de nuevo bajo custodia",
      "description": "(24 Dec 2024) \r\nRESTRICTION SUMMARY:\r\n\r\nASSOCIATED PRESS\r\nCiudad de Guatemala, Guatemala - 23 de diciembre de 2024\r\n \r\nLos niños de la secta judía ultraortodoxa, Lev Tahor, en Guatemala, fueron puestos de nuevo bajo custodia protectora el lunes después de que la policía resistiera los esfuerzos de sus familias por recapturarlos.\r\n \r\nAlgunos miembros del grupo se llevaron el domingo a algunos de los niños que habían sido rescatados de la secta tras denuncias de abusos.\r\n \r\nSONIDO (español)  Mikhail Goldman, Miembro de Secta judía ultraortodoxa:\r\n“Las más pequeñas de 12, 15, 14 años, nosotros hacemos casamientos temprano.”\r\n \r\nLa fiscalía aseguró que en el allanamiento habrían localizado presuntos huesos de un menor, ademas confirmó el rescate de menores presuntamente abusados, y la retención de pasaportes y computadoras.\r\n \r\nSONIDO (español) Christian Osorio, miembro de secta judía ultraortodoxa:\r\n“Es horrible no poder estar con mis hijos en la paz de mi hogar y ver sufrir a tantos niños.”\r\n \r\nLa secta tiene también miembros en Canadá, Israel, Estados Unidos, México, y se sabe que tuvo problemas legales en estos dos últimos países.\r\n \r\nSONIDO (español) Julio Saavedra, fiscal general de Guatemala:\r\n“Para el rescate fue un operativo impresionante, buses, paneles,  trasladarlos a la Procuradora general de la nación para tratar de hacer los informes, los estudios psicosociales para establecer que ruta de acuerdo con la ley y todo el sistema y protección procedía.”\r\n \r\nANNE MARIE GARCIA, ASSOCIATED PRESS\r\n \r\nAP Video filmado por Santiago Billy\r\nSTORYLINE:\r\n\r\n\r\n===========================================================\r\n\r\nClients are reminded to adhere to all listed restrictions and to check the terms of their licence agreements. For further assistance, please contact the AP Archive on: Tel \u002B44(0)2074827482 Email: info@aparchive.com.\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/0e15a48039cf4838b4f4fd990ef9e764",
      "release": "2024-12-29T18:34:21Z",
      "duration": "00:01:39",
      "explicit": false,
      "youTubeId": "_zL7v0DWiI4",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_zL7v0DWiI4"
      }
    },
    {
      "id": "d6cb62fc-30dc-463b-8524-8a134d5da628",
      "title": "Children from Guatemala Jewish sect placed in custody again after parents clash with police",
      "description": "(23 Dec 2024) \r\nRESTRICTION SUMMARY: \r\n\r\nASSOCIATED PRESS\r\nGuatemala City, Guatemala -  23 December 2024\r\n1. Woman yelling at police from bus carrying minors taken from Lev Tahor sect, UPSOUND (Spanish): \u0022You are heartless\u0022\r\n2. Close of child’s hand on bus\r\n3. Child on bus, seen from behind\r\n4. SOUNDBITE (Spanish) Mikhail Goldman, 58, member of ultra-orthodox Jewish sect:\r\n\u0022The youngest girls, those who are 12, 15, 14, we arrange early weddings for them.\u0022\r\n5. Various of women with children getting off bus outside government shelter\r\n6. Police officers looking on; sect member filming on phone in background\r\n7. People and police outside shelter; sign reading (Spanish), \u0022Social Welfare Center\u0022 in background\r\n8. Woman holding baby\r\n9. Women with babies\r\n10. SOUNDBITE (Spanish) Julio Saavedra, state attorney of Guatemala:\r\n\u0022The rescue operation (of the children) was impressive. Buses and vans (were used) to transfer them to the State Attorney\u0027s Office. Reports and psychosocial studies were carried out to the extent possible in order to determine the best course of action in accordance with the law and the rights system.\u0022\r\n11. Barbed wire on wall at government shelter\r\n12. Sect members next to bus\r\n13. Various of police and sect members next to buses\r\n14. SOUNDBITE (Spanish) Christian Osorio, member of ultra-orthodox Jewish sect:\r\n\u0022It\u0027s horrible not to be able to be with my children in the peace of my home and to see so many children suffer.\u0022\r\n15. Sect member giving interview as others walk away\r\n16. Sect members taking taxi\r\nSTORYLINE:\r\nChildren from an ultra-orthodox Jewish sect in Guatemala were put again in protective custody Monday after police resisted their families’ efforts to recapture them.\r\n\r\nMembers of the Lev Tahor group managed Sunday night to take back some of the children and adolescents who had been rescued from the sect’s premises after reports of abuse, but the minors were later recovered by the authorities.\r\n\r\nOn Friday, Guatemalan authorities searched the compound of the group’s community, taking at least 160 minors and 40 women into protective custody following abuse allegations.\r\n\r\nInterior Minister Francisco Jiménez said the National Civil Police and members of the military participated in the raid on the extremist sect about 55 miles (90 kilometers) southeast of the capital.\r\n\r\nGuatemala’s Attorney General’s Office said in a statement on the social platform X that suspected bones of one child were found. \r\n\r\nThe office said a complaint was made in November of possible crimes including forced pregnancies, mistreatment of minors and rape.\r\n\r\nThe sect has run into legal problems in various countries.\r\n\r\nIn 2022, Mexican authorities arrested a leader of the sect near the Guatemalan border and removed a number of women and children from their compound.\r\n\r\nIn 2021, two leaders of the group were convicted of kidnapping and child sexual exploitation crimes in New York. \r\n\r\nThey allegedly kidnapped two children from their mother to return a 14-year-old girl to an illegal sexual relationship with an adult male.\r\n\r\nThe sect is known to have members in Canada, the United States, Mexico, Guatemala and Israel.\r\n\r\nAP Video shot by Santiago Billy \r\n\r\n===========================================================\r\n\r\nClients are reminded to adhere to all listed restrictions and to check the terms of their licence agreements. For further assistance, please contact the AP Archive on: Tel \u002B44(0)2074827482 Email: info@aparchive.com.\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/a0f5838796c94215be23a841fea97225",
      "release": "2024-12-28T23:03:04Z",
      "duration": "00:02:24",
      "explicit": false,
      "youTubeId": "MybojTXWmF4",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MybojTXWmF4"
      }
    },
    {
      "id": "be761755-fef5-4b75-ac01-ea4222ba0054",
      "title": "Switzerland - Cult",
      "description": "(10 Oct 1994) STORY:    CULT\r\nLOCATION: SWITZERLAND\r\nDATE:     5 OCTOBER 1994\r\nDURATION: 1.30\r\n\r\nForty-eight die in suspected mass suicide\r\n\r\nAt least 48 people died in two quiet Swiss villages and two more in Canada in a bizarre \u0022doomsday cult\u0022 drama that may have been a collective suicide, police in the two countries said on Wednesday (5/10). But an official investigator told reporters in the picture-postcard Swiss farming community of Cheiry where 23 bodies were found, many clad in coloured cloaks at a secret temple, that two people whom he did not identify were wanted for questioning. Investigator Andre Piller said police could not exclude the possibility that some people involved may have escaped alive, leaving 12 women, 10 men and a 10-year-old child in what he described as a \u0022waxwork museum\u0022 of death. In the Alpine mountainside hamlet of Granges, 160 km (100 miles) south of Cheiry, firemen pulled 25 corpses from the smouldering ruins of two chalets -- some of them children. In Quebec, Canada, police found the bodies of a man and a woman in the smoking ruins of a house in the small community of Morin Heights 80 km (48 miles) north of Montreal. As in Cheiry and Granges, an elaborate fire-starter system involving wires, timers, gas tanks and bags of petroleum had been set up. Police said all three incidents appeared clearly linked to a charismatic 45-year-old doctor, Luc Jouret, who heads a Canadian-based sect known as the \u0022Order of the Solar Temple\u0022 which tells its adherents to prepare for the end of the world. Jouret, a homeopath who has called himself a \u0022new Christ\u0022, owned two of the burned-out chalets in Grange and one of the two houses in Morin Heights. His portrait was also found in a large cellar un der the burned-out barn on the Cheiry farm.\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/680e99d2bb1ea9e20eb33b0fd7e8c088",
      "release": "2021-02-23T14:23:57Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "cMLTJr0co48",
      "subjects": [
        "Order of the Solar Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cMLTJr0co48"
      }
    },
    {
      "id": "78ae0e46-cc2d-4fb6-a574-7378a9e2d3bf",
      "title": "Sisters protest as Leifer abuse trial continues",
      "description": "(13 Mar 2019) Australian women accusing an Israeli school teacher of sex abuse on Wednesday protested outside a hearing at a Jerusalem court, in which a psychiatrist contended their alleged abuser was mentally unfit to stand trial. \r\nAustralian sisters Dassi Erlich and Nicole Meyer said they hoped alleged abuser Malka Leifer will be deemed fit to stand trial, adding that their campaign was \u0022for everyone and not just for ourselves\u0022. \r\nAbout a dozen demonstrators gathered outside the court to protest the court proceedings in solidarity with the accusers. \r\nAuthorities in Australia want 54-year-old Leifer extradited for allegedly sexually abusing young female students while she was a teacher at a Jewish religious school in Melbourne.\r\nAn Israeli court previously halted extradition proceedings after determining Leifer was not fit to stand trial.\r\nLeifer\u0027s lawyer said the trail, now at its 48th hearing, could last several more months, adding that \u0022the road to the Supreme Court is open\u0022 as well. \r\nThe next hearing, in which more psychiatrists will offer their views on Leifer\u0027s mental health, is scheduled for March 26.\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/53af65737711d2fe5966ab828552d02d",
      "release": "2019-03-18T15:39:26Z",
      "duration": "00:02:48",
      "explicit": false,
      "youTubeId": "idVG0R2sQ30",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=idVG0R2sQ30"
      }
    },
    {
      "id": "873f3ca5-b975-44a3-9039-ab6eecb687b2",
      "title": "SYND 11-11-72 GURU WELCOMED",
      "description": "(11 Nov 1972) Devotees of the 14 year old Guru Maharaj Ji assembled in New Delhi to welcome the religious leader\u0027s return from the United States\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/7ab667ccc35ace8cb8a23714e11b304a",
      "release": "2015-07-24T13:50:54Z",
      "duration": "00:02:09",
      "explicit": false,
      "youTubeId": "fQzePYP0J-8",
      "subjects": [
        "Divine Light Mission"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fQzePYP0J-8"
      }
    },
    {
      "id": "c4ade569-cb40-46a9-b615-a89a8242f5dd",
      "title": "SYND 22 11 78 AFTERMATH AT JONESTOWN OF SECT MASS SUICIDE",
      "description": "(20 Nov 1978) The bodies of hundreds of people who took part in the mass suicide at the People\u0027s Temple Sect in Jonestown, Guyana.\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/b98cfe7bed6eb9f5a71ca1beec9261d9",
      "release": "2015-07-24T13:25:58Z",
      "duration": "00:00:50",
      "explicit": false,
      "youTubeId": "kxWvq9dMEbo",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kxWvq9dMEbo"
      }
    },
    {
      "id": "279aec18-3319-4932-8d69-53ae03873cf1",
      "title": "SYND 23-5-74 WEDDING OF DIVINE LIGHT MISSION LEADER GURU MAHARAJ JI IN DENVER, COLORADO",
      "description": "(20 May 1974) Wedding and reception of Guru Maharaj Ji (Prem Rawat), the 16 year old leader of the Divine Light Mission in Denver, Colorado.\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/14db1e0857c9954958edb6aa3f6dacf0",
      "release": "2015-07-23T14:09:52Z",
      "duration": "00:01:05",
      "explicit": false,
      "youTubeId": "9PEPUk1_dAU",
      "subjects": [
        "Divine Light Mission"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9PEPUk1_dAU"
      }
    },
    {
      "id": "f5d2acad-7263-4f30-a595-9a5ec05c10ef",
      "title": "RR7348B USA: A VISIT FROM THE BOY GURU",
      "description": "(4 Dec 1973) RR7348B USA: A VISIT FROM THE BOY GURU\r\n\r\nFor six million members of the Divine Light Mission,\r\nclaimed to be the fastest-growing religious movement\r\nin the world, Guru Maharaji Ji is the Perfect Master, a\r\nGod incarnate.  What makes that claim even more\r\nastonishing is the fact that the guru is only 15 years\r\nold.  Our film reports on \u0027Millenium 73\u0027 a mammoth\r\nreligious happening staged in the Astrodome at\r\nHouston, Texas as the high point of his recent\r\nAmerican tour.  It was claimed by his followers to be\r\n\u0027the most significant event in human history so far\u0027.\r\n\r\nFilm: Rev – Sound: Mag/SOF – Colour– Available in HD\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/b56bff5c298a0605668a9bdfd583a937",
      "release": "2015-07-21T18:30:57Z",
      "duration": "00:14:15",
      "explicit": false,
      "youTubeId": "xDSR6BPqyt0",
      "subjects": [
        "Divine Light Mission"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xDSR6BPqyt0"
      }
    },
    {
      "id": "b5884511-1b02-4053-a706-dc292cf37b79",
      "title": "USA: JONESTOWN GUYANA MASSACRE 20 YEARS ON (4)",
      "description": "(18 Nov 1998) English/Nat\r\n\r\nA group of survivors of the Jonestown deaths marked the twentieth anniversary on Tuesday night with a three-hour prayer vigil.\r\n\r\nSurvivors of the tragedy in which 900 people died, remembered their own narrow escapes from the Jonestown sect\u0027s commune and counted their blessings to be alive.\r\n\r\nPerhaps the most famous survivor, Deborah Layton - who alerted the world that people were held against their will - is touring the U-S with a new book about the cult.\r\n\r\nIn a church in San Francisco, the survivors\u0027 thank their lucky stars they are alive.\r\n\r\nTheir stories reflect the luck and courage of their escape.\r\n\r\nOne survivor helped a small group escape the commune by telling guards he had organised a picnic.\r\n\r\nJust by chance, he escaped the tragedy that took place in the People\u0027s Temple in Jonestown in the ex-British colony of Guyana.\r\n\r\nThe adopted son of Jim Jones, Jim Jones Jr, escaped death because he and his brother had gone into town to see a basketball game.\r\n\r\nThe younger Jones said it was God who made it possible for him to hug one of the women he had pulled to safety.\r\n\r\nHe said he attended the service to heal old wounds.\r\n\r\nSOUNDBITE: (English)\r\n\u0022I think, one, is forgiveness, forgiveness for myself for surviving. I think, two, is forgiveness for the failures of Rev Jim Jones, he is not God, he is only a man. And when many people placed him in a God-like role he then believed it. And that\u0027s the tragedy of Jonestown.\u0022\r\nSUPER CAPTION: (English) Jim Jones, Jr., Adopted son of Jim Jones\r\n\r\nOne of Jonestown\u0027s most famous survivors is marking the anniversary by touring with a new book about her experience.\r\n\r\nDeborah Layton joined Jim Jones and his People\u0027s Temple after graduating from boarding school at the age of 17.\r\n\r\nAfter more than seven years in the group, Layton followed Jones to Guyana ... and it was there that she began to realise this leader was terribly dangerous.\r\n\r\nIn her recently released autobiography, \u0022Seductive Poison,\u0022 Layton describes the so-called \u0022white nights,\u0022 or weekly suicide drills.\r\n\r\nShe recalled what happened to those who refused to join in.\r\n\r\nSOUNDBITE: (English)\r\n\u0022A mother, for example, who would say, \u0027No, I don\u0027t want to kill my child, I wont do that\u0027, she as an example to us would be taken from that child and drugged and kept in the medical unit, comatose.  So your choices were, you follow, you act like your part of the team and somehow you hope you can figure a way out.  Those people, you know, in the very end, what seems comforting to people to say these people committed suicide, they didn\u0027t, they were murdered, they died not wanting, they were murdered by Jim Jones.\u0022\r\nSUPER CAPTION: Deborah Layton, Jonestown Survivor\r\n\r\nLayton managed to escape the guarded compound, leaving her brother and dying mother behind.\r\n\r\nShe says in Jonestown, the sect\u0027s leader became increasingly angry and paranoid following a string of negative press reports.\r\n\r\nAnd she knew his talk of a mass suicide would soon become a reality.\r\n\r\nSOUNDBITE: (English)\r\n\u0022His paranoia just grew and became just a malignant tumour upon him and he could have let those people live but he wanted to make a point and a statement.  All those good people who joined for the most wonderful reasons, who wanted to be part of something bigger than themselves where used as fodder in the end, so that he could make his point, don\u0027t anyone mess with me.\u0022\r\nSUPER CAPTION: Deborah Layton, Jonestown Survivor\r\n\r\nAmong the dead were more than 270 children.\r\n\r\nArmed guards shot anyone who refused.\r\n\r\nEven two decades later, the scars from the tragedy are thick and deep.\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/8c1b1f7c19986426648e7f1b31d305d7",
      "release": "2015-07-21T17:41:47Z",
      "duration": "00:02:28",
      "explicit": false,
      "youTubeId": "Ji8pW3Yd9O8",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ji8pW3Yd9O8"
      }
    },
    {
      "id": "9e13acf2-2e89-42b5-9099-a6a595345a48",
      "title": "SYND 8-11-72 TEENAGE GURU RETURNS HOME",
      "description": "(7 Nov 1972) Teenage guru Maharaj Ji arrives back home in Delhi and is greeted by thousands of folowers.\r\n\r\nFind out more about AP Archive: http://www.aparchive.com/HowWeWork \r\nTwitter: https://twitter.com/AP_Archive \r\nFacebook: https://www.facebook.com/APArchives ​​\r\nInstagram: https://www.instagram.com/APNews/\r\n\r\n\r\nYou can license this story through AP Archive: http://www.aparchive.com/metadata/youtube/41b9b6237ad57d303e1485dce68cd417",
      "release": "2015-07-21T13:06:35Z",
      "duration": "00:01:11",
      "explicit": false,
      "youTubeId": "phOlMSlN894",
      "subjects": [
        "Divine Light Mission"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=phOlMSlN894"
      }
    }
  ]
}