{
  "_ts": 0,
  "id": "673f37f2-a32e-477f-b722-7cb8c056d8d0",
  "name": "Apostate Sisters",
  "spotifyId": "31log5wCQ2ylu9rPN4sXKu",
  "youTubeChannelId": "UCNwaIjyXNJ2KuE8G-K8nlNg",
  "episodes": [
    {
      "id": "574a94a4-1ec0-4d67-93c8-8bfae8a4e9a9",
      "title": "Not Your Property: How Purity Culture Stole Our Bodily Autonomy | Worldwide Church of God | Cults",
      "description": "Welcome to another fiery conversation with the Apostate Sisters! This time, we’re diving into the tangled mess that is Purity Culture – that set of beliefs that told us our bodies belonged to God, our parents, or a future spouse, but certainly not to ourselves. Growing up in the Worldwide Church of God, purity wasn’t just about abstaining from sex; it was about surrendering every ounce of bodily autonomy. In this episode, we share our personal experiences and dissect the messages that trained us to disconnect from our own bodies.\n\nWe talk about how purity culture is woven with manipulation tactics, shame, and fear – and we explore the serious psychological and relational consequences of growing up under these beliefs. From modesty expectations and guilt-ridden messages to the toxic idea that “purity” equals worthiness, we break down the impact these teachings had on our lives and the lives of so many others.\n\nJoin us as we reclaim our autonomy, call out the harm, and share steps toward healing. This one’s for everyone who’s been made to feel like their body was anything other than their own. Ready to challenge these damaging ideas? Let’s get into it!\n\nJoin our Patreon: Patreon.com/ApostateSisters\nLinkTree: https://linktr.ee/apostatesisters",
      "release": "2024-11-15T17:30:06Z",
      "duration": "01:39:31",
      "explicit": false,
      "spotifyId": "4c49faghklELKVE5hKK26E",
      "youTubeId": "gPkNgx5evEk",
      "subjects": [
        "Worldwide Church Of God",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4c49faghklELKVE5hKK26E",
        "youtube": "https://www.youtube.com/watch?v=gPkNgx5evEk"
      }
    },
    {
      "id": "7aa451fe-36a9-4ac9-ba63-a1a72b6becd6",
      "title": "Cult Indoctrination Through Media: The Worldwide Church of God presents The World Tomorrow",
      "description": "We’re reacting to a bizarre 1950s-style dance routine performed by members of our former cult, the Worldwide Church of God. With its over-the-top wholesome vibe and oddly staged smiles, it’s clear that Herbert W. Armstrong had a vision of \u0022perfection\u0022 that was as controlling as it was unsettling. From the forced cheer to the choreographed moves, the whole setup feels like an eerie attempt to project an image of moral superiority and \u0022purity.\u0022\nJoin us as we cringe, laugh, and dissect the ways high-control groups often use aesthetics to enforce conformity and create a carefully curated \u0022perfect\u0022 world. What might seem like harmless dancing at first glance has us diving deep into the image Armstrong wanted his followers to project—and the rigid control lurking behind that picture-perfect facade.\n\nTune in every other Friday night at 9pm Central for more live reactions to cult TV. Don’t forget to like, subscribe, and share with anyone curious about cult indoctrination through media! \n\n#UnPackItTV #CultSurvivor #Exvangelical #WorldwideChurchofGod #HerbertWArmstrong #ReligiousTrauma #DoomsdayCult",
      "release": "2024-11-15T15:53:41Z",
      "duration": "00:00:57",
      "explicit": false,
      "youTubeId": "ELjKGJl7dtc",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ELjKGJl7dtc"
      }
    },
    {
      "id": "46937d75-946b-416d-9b89-3edb89fe0812",
      "title": "Cult Kids React to Propaganda | The World Tomorrow | Herbert W. Armstrong | Worldwide Church of God",
      "description": "In this first look at UnPack-It TV, we dive into the infamous intro of The World Tomorrow, the television show produced by the Worldwide Church of God. Led by Herbert W. Armstrong, the church convinced followers to give everything, promising salvation and a \u0022place of safety.\u0022 With control tactics rooted in fear, guilt, and manipulation, Armstrong built an empire at the expense of his followers.\n\nJoin us as we pull back the curtain, expose the manipulation, and reclaim our voices. This is UnPack-It TV – where cult kids speak out and share the truth. Tune in Friday night at 9pm Central for our live reaction, and don’t forget to like, subscribe, and share to support our journey. See you there! \n\n#UnPackItTV, #CultSurvivor #Exvangelical #WorldwideChurchofGod #HerbertWArmstrong #ReligiousTrauma #DoomsdayCult",
      "release": "2024-11-15T00:10:53Z",
      "duration": "00:00:57",
      "explicit": false,
      "youTubeId": "OixkAV6V9Fg",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OixkAV6V9Fg"
      }
    },
    {
      "id": "ef5ed8c6-7cfe-4cf8-be4a-bd2fea36f9ce",
      "title": "Cult Leader Herbert W. Armstrong\u0027s Endless Search for Pleasure - The World Tomorrow | UnPack-It TV",
      "description": "Welcome to UnPack-It TV, a new live reaction series where Nancy and I (Patti) dive into the twisted world of Worldwide Church of God media. Our first focus is The World Tomorrow—Herbert W. Armstrong’s televangelist show that pushed WCG’s doomsday doctrines and rigid control right up until his death in 1986. But we won’t stop there! We’re ready to react to any WCG and cult-related videos, from old sermons and “educational” broadcasts to promotional material from affiliated groups.\r\n\r\nAs former insiders, we’re here to watch, comment, and irreverently unpack the manipulative messaging, fear-mongering, and bizarre teachings that shaped our lives growing up in this high-control cult. You can expect a heavy dose of humor, raw honesty, and critical analysis as we shed light on the authoritarian grip this media held over its members.\r\n\r\nJoin us live as we take back the narrative, laugh at the absurdity, and confront our shared past. Whether you’re a former member or just curious about cult influence, religious manipulation, and exvangelical journeys, UnPack-It TV is here for you. Subscribe to catch every episode as we bring truth, humor, and healing to the cult videos that once ruled our lives.\r\n\r\nWant to see the Sisters continue their heathenry? Support us on Patreon!\r\nhttps://www.patreon.com/ApostateSisters\r\nAnd find us everywhere else too!\r\nhttps://linktr.ee/apostatesisters",
      "release": "2024-11-12T20:09:59Z",
      "duration": "01:59:26",
      "explicit": false,
      "youTubeId": "_Bm0Hjn2xt8",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_Bm0Hjn2xt8"
      }
    },
    {
      "id": "090b9c5b-ccba-4fe7-8277-5859258d0224",
      "title": "An Atheist in Kentucky? Joe in Conversation with the Apostate Sisters |",
      "description": "In this episode of the Apostate Sisters Interview Series, we sit down with Joe from the Kentucky Atheist channel. Growing up in Eastern Kentucky, Joe’s journey from faith to reason wasn’t an easy one, especially in an area where the atheist community is small and religion is deeply embedded. Now, he’s committed to bringing a thoughtful, science-based perspective to his channel, covering topics like physics, cosmology, history, and astronomy. Joe challenges the role of religion in stifling rational thought and encourages his viewers to think critically.\n\nJoin us as we dive into Joe’s story, his experiences navigating faith and skepticism, and his mission to educate and foster open-mindedness in his community and beyond. Whether you’re from a similar background or just curious about atheism in a predominantly religious region, this conversation is packed with insights, authenticity, and the power of questioning.\n\nTune in to hear Joe’s perspective, and don’t forget to check out the Kentucky Atheist channel for more content that sparks curiosity and challenges beliefs!",
      "release": "2024-11-11T14:15:04Z",
      "duration": "01:08:30",
      "explicit": false,
      "youTubeId": "Ln7pHr4AwFw",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ln7pHr4AwFw"
      }
    },
    {
      "id": "458b179b-b8c9-4c9e-8a94-f267dff51e13",
      "title": "Purity Culture: The Impact of Shame on Our Bodies and Minds",
      "description": "In this clip, we dive into the deep impact of purity culture and its erasure of sexuality. Growing up with the message that our sexuality is inherently “bad” left us with shame and guilt, creating a disconnect from a natural part of being human. Even when teachings claimed that sex could be “good” within specific contexts, it did little to counteract the heavy shame we carried. We explore how purity culture robs us of a healthy, integrated sense of self, making it harder to feel whole and happy.\n\n#CultRecovery #ChurchAbuse #ChristianityHurtsPeople #PraiseJesus #HerbertWArmstrong #WorldwideChurchOfGod",
      "release": "2024-11-09T14:42:08Z",
      "duration": "00:01:02",
      "explicit": false,
      "youTubeId": "xXOmOGAAoik",
      "subjects": [
        "Purity Culture",
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xXOmOGAAoik"
      }
    },
    {
      "id": "daaeb64a-89a6-445c-92a5-d1e4911b7b23",
      "title": "The Evangelical Illusion of Empowerment: Purity Culture Exposed - Herbert W. Armstrong Cult",
      "description": "In this clip, we unpack the illusion of choice in purity culture. Whether in evangelical spaces or the strict control of the Worldwide Church of God, girls and women are taught to \u0022choose\u0022 modesty and self-sacrifice—but is it really a choice, or just control wrapped in empowerment language? We discuss how purity culture imposes a false sense of autonomy, making it seem like women have agency while pressuring them to conform to rigid standards or face consequences. Let’s break down the facade of “choice” in these high-control religious environments.",
      "release": "2024-11-08T16:35:37Z",
      "duration": "00:01:00",
      "explicit": false,
      "youTubeId": "niuzDJMnjEM",
      "subjects": [
        "Worldwide Church Of God",
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=niuzDJMnjEM"
      }
    },
    {
      "id": "82f2c773-d900-45ce-931a-060bc3316eb1",
      "title": "Fear​​fully and Wonderfully Made | Herbert W. Armstrong Talks Genitalia UnPack-It 15",
      "description": "In this episode of UnPack-it, Patti, Nancy, and Joel dive into Chapter 10 of the Worldwide Church of God’s infamous text, taking on its claims about humanity’s “true potential” and “dignity.” We discuss the WCG\u0027s take on what it means to be “fearfully and wonderfully made” and its ambitious vision of humanity ruling over the entire universe—if, of course, we follow the church’s rules.\n\nWe take on the mixed messaging about human worth, bodily control, and the supposed divine hierarchy, all while examining how these teachings impacted WCG members\u0027 self-worth, bodily autonomy, and worldview. With our usual blend of humor and no-nonsense critique, we explore how ideas of \u0022divine dignity\u0022 got twisted into controlling doctrine. Join us as we unpack the contradictions and laugh (or cringe) at the wild concepts that shaped our pasts.\n\nWant more commentary on cults, high-control groups, and the misuse of religious teachings? Subscribe and stay tuned for more as we explore bodily autonomy, sexuality, and healing from cult ideologies.\n\n🔗 Patreon: Support our channel and get your name in the credits: patreon.com/ApostateSisters\n\nDon’t miss out—subscribe, like, and comment to join the conversation!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/WPWNEYBrGcI\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\nTags: Cult Kids, Cult Survivors, One True Church, WCG, Worldwide Church of God, Restored Church of God, Atheist, Agnostic, Cult Survivor, Bodily Autonomy, High Control Groups, Deconstruction",
      "release": "2024-11-02T02:00:06Z",
      "duration": "01:03:42",
      "explicit": false,
      "youTubeId": "pg4BU_Hq4_k",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pg4BU_Hq4_k"
      }
    },
    {
      "id": "dc51a10a-29e8-44ad-9e8f-c262a346f12f",
      "title": "Playing God: David Fitzgerald on Mythology \u0026 the Origins of Faith",
      "description": "In this lively episode of the Apostate Sisters Interview Series, Nancy and Patti sit down with author and historian David Fitzgerald for a fascinating deep-dive into the world of mythicism, ancient history, and secular exploration. David is known for his work on the historical (or mythological) Jesus, challenging the widely held belief that Jesus of Nazareth was a real historical figure. In our conversation, David shares insights from his mythicist perspective and discusses how attitudes toward atheism and mythicism have evolved over the last decade. We also touch on his creative endeavors, including writing erotica with his wife and his past musical career that earned him a spot in the Las Vegas Rock and Roll Hall of Fame.\n\nExpect some laughs as we explore the timelines of biblical figures, compare notes on ancient myths, and hear David’s unique journey from faith to secular activism. Whether you\u0027re into religious history, mythicist theories, or just enjoy a good laugh, this episode has a little something for everyone. Join us as we uncover the mystery behind the myth and get a peek into David Fitzgerald’s world of history, humor, and atheistic inquiry!\n\n🔗 Check out David\u0027s work: davidfitzgerald.org\nDavid\u0027s Instagram: https://www.instagram.com/sfkilt/\n\n👍 Support the Apostate Sisters on Patreon: patreon.com/ApostateSisters",
      "release": "2024-10-30T14:45:02Z",
      "duration": "01:11:26",
      "explicit": false,
      "youTubeId": "SwOxiFj6VvA",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SwOxiFj6VvA"
      }
    },
    {
      "id": "703e4258-0e05-4d4b-8b3d-e3e6e652658c",
      "title": "S2 E2: Physical Discipline Breaking the Cycle of Religious Control",
      "description": "Welcome back to another episode of Apostate Sisters! This time, Nancy and Patti are diving deep into a tough but necessary topic: spanking and physical punishment, and how these practices intersect with bodily autonomy, especially in high-control environments like the Worldwide Church of God (WCG). Growing up in a church where authority and obedience were emphasized, many of us were raised to accept physical punishment as \u0022normal\u0022 or even \u0022loving\u0022 discipline. But what are the real impacts of this practice on our sense of self, safety, and autonomy?\n\nIn this episode, we discuss:\n\nOur personal stories around spanking in WCG and evangelical households.\nHow spanking was justified by religious teachings and cultural norms, especially passages like \u0022spare the rod, spoil the child.\u0022\nThe psychological toll of corporal punishment on children, including struggles with self-worth, boundaries, and bodily autonomy.\nA look at shifting societal views on physical discipline and alternative, non-violent approaches to parenting.\nJoin us as we unpack the complex layers of spanking, authority, and control, and how we can reclaim our bodies and minds from these lasting imprints. If you find these discussions valuable, consider joining our Patreon community, Sinful Siblings, where you can connect with us and support our mission to create healing spaces for others. Patreon.com/ApostateSisters",
      "release": "2024-10-26T17:01:12Z",
      "duration": "01:12:25",
      "explicit": false,
      "spotifyId": "6KoCIeTHvbUZtH1lTMw5Va",
      "youTubeId": "WPWNEYBrGcI",
      "subjects": [
        "Worldwide Church Of God",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KoCIeTHvbUZtH1lTMw5Va",
        "youtube": "https://www.youtube.com/watch?v=WPWNEYBrGcI"
      }
    },
    {
      "id": "94410252-6da4-4e7a-9f4c-d83c45c9de68",
      "title": "Ex-Pastor with a People Centric Message sits down with the Apostate Sisters | Darante\u0026#39; LaMar",
      "description": "In this episode of the Apostate Sisters Interview Series, we’re sitting down with Darante\u0027 LaMar, a relatively new voice in the atheist community, who shares his perspective on how atheism can be a force for positive change in the world rather than just a tool to prove who’s right. Darante\u0027 is a Black atheist from Alabama, and is passionate about building a world that works for more people. Together, we dive deep into pressing issues around race, houselessness, and religion, while specifically addressing how allies should interpret and engage with the message of \u0022Black Lives Matter\u0022 versus the movement and organization itself. We thank Darante\u0027 for his trust in us to engage in these topics on our channel.\n\nThis candid conversation highlights the intersection of racial issues with atheism, challenging the atheist community to be more than just non-believers but active participants in creating a better world. Join us as we discuss how we can build more inclusive communities that prioritize equality and understanding, rather than just intellectual superiority. It\u0027s a conversation you don’t want to miss!\n\nDarante\u0027s Channel: \n\nDarante\u0027s Other Links:\n\nWebsite\ndldd.us\n\nTwitter\ntwitter.com/DaranteLaMarX\n\nFacebook\nfacebook.com/darante.martin\n\nDiscord\ndiscord.gg/4Jd8XT2S6r\n\n👉 Don’t forget to like, comment, and subscribe to the Apostate Sisters to join the conversation, and check out our Patreon for access to our support tier - \u0022Sinful Siblings\u0022",
      "release": "2024-10-25T00:30:44Z",
      "duration": "01:34:41",
      "explicit": false,
      "youTubeId": "TQFL2g940so",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TQFL2g940so"
      }
    },
    {
      "id": "fefc6129-350f-4bb6-839d-776a4c6c6059",
      "title": "From Hormones to Human Creation: UnPack-It 14 | Worldwide Church of God | Herbert W. Armstrong",
      "description": "In this episode of UnPack-It, Patti, Nancy, and Joel dive deep into the second half of Chapter 9 of Herbert W. Armstrong\u0027s The Missing Dimension in Sex. We explore Armstrong\u0027s fascination with male hormones and testicular function, including some wild experiments with castration. 😳\n\nWe also get into the intricate biological mechanics that Armstrong uses to argue divine design, specifically around the testes’ role as hormone factories and temperature-sensitive “laboratories.” And while Armstrong claims divine intervention, we take a moment to weigh that against scientific evolution.\n\nAre we just biological marvels, or is there more to the story? Join us as we break down Armstrong\u0027s assertions and explore the WCG\u0027s ongoing obsession with bodily control.\n\nTune in for some surprising revelations (and laughs) as we continue to dissect The Missing Dimension in Sex. Make sure to like, comment, and subscribe for more episodes as we explore these old, high-control teachings through a critical lens.\n\nWant more commentary on cults, high-control groups, and the misuse of religious teachings? Subscribe and stay tuned for more as we explore bodily autonomy, sexuality, and healing from cult ideologies.\n\n🔗 Patreon: Support our channel and get your name in the credits: patreon.com/ApostateSisters\n\nDon’t miss out—subscribe, like, and comment to join the conversation!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/FIvWOHczD6c?si=qDHsj7NyWYLzOW7K\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\nTags: Cult Kids, Cult Survivors, One True Church, WCG, Worldwide Church of God, Restored Church of God, Atheist, Agnostic, Cult Survivor, Bodily Autonomy, High Control Groups, Deconstruction",
      "release": "2024-10-19T02:00:06Z",
      "duration": "01:07:55",
      "explicit": false,
      "youTubeId": "2jK3m_1rhlc",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2jK3m_1rhlc"
      }
    },
    {
      "id": "e3362dfc-a6ca-4612-b197-400ecf1e1d2e",
      "title": "Apostate Sisters 500 Subscriber Livestream! Live Chat",
      "description": "Join us for a special livestream celebration as we hit *500 subscribers*! 🎉 On *October 17th at 4pm Central*, we\u0027ll be going live to chat with all of you, reflect on our journey, and discuss where the channel is heading next. We\u0027re excited to have some fantastic content creators joining us, so pop in, join the live chat, and be part of the conversation!\r\n\r\nWe\u0027ve invited some of the atheist content creator friends we\u0027ve made along the way, and the confirmed attendees are: \r\n@AronRa\r\n@GodlessEngineer\r\n@HarmonicAtheist\r\nAuthor David Fitzgerald\r\n@BetterThanEmber\r\n@TheKentuckyAtheist\r\n\r\nSome of our other favorite content creators on YouTube are: \r\n@GodlessGranny\r\n@DaranteLaMar\r\n@misterdiffiCULT1\r\n@PunkApostate\r\n@theStaciesMomPodcast\r\n@NeilThe604Atheist\r\n@AmbushedApostate\r\n...and many more......\r\n\r\nFor those new to the channel, *Apostate Sisters* is all about deconstructing faith, unpacking life in high-control religious environments like the Worldwide Church of God, and creating healing spaces for those on their own journeys. We tackle topics like religious trauma, bodily autonomy, and reclaiming agency, all while building a supportive community.\r\n\r\nMark your calendars and come celebrate with us! We couldn\u0027t have reached this milestone without you.",
      "release": "2024-10-18T00:12:23Z",
      "duration": "03:04:16",
      "explicit": false,
      "youTubeId": "MNbmZi2vSGU",
      "subjects": [
        "Worldwide Church Of God",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MNbmZi2vSGU"
      }
    },
    {
      "id": "6728bd50-5f7e-4f25-a3dc-cd8cdafc944e",
      "title": "S2 E1: Self-Pleasure \u0026amp; Sexual Sin: How the Worldwide Church of God Controlled our Bodies \u0026amp; Minds",
      "description": "Welcome to the Apostate Sisters Season 2 premiere! 🎉 In this episode, we’re diving headfirst under the covers into the uncomfortable yet crucial conversation about Self-Pleasure and Sexual Sin in the Worldwide Church of God (WCG). Growing up in a high-control religious environment meant we were constantly policed, even down to our personal, intimate behaviors—like masturbation.\n\nPatti, Nancy, and our trusted male guest J, who was also raised in the WCG, share candid stories about the shame, confusion, and teachings that shaped our sexual identities. From the bizarre teachings in \u0022The Missing Dimension in Sex\u0022 to generational layers of shame, we unpack how bodily autonomy was controlled and how it has affected us into adulthood. We also discuss the absurdities of societal messaging around masturbation, from Kellogg’s cornflakes to wild myths about going blind!\n\nJoin us as we break down these toxic teachings and reclaim our right to pleasure, self-awareness, and bodily autonomy. And don\u0027t forget to check out our Patreon to support the show and get your name in the credits! https://www.patreon.com/ApostateSisters",
      "release": "2024-10-12T19:36:18Z",
      "duration": "01:22:04",
      "explicit": false,
      "spotifyId": "1kcd8nJ1tHfLNXuhVM9k1k",
      "youTubeId": "FIvWOHczD6c",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kcd8nJ1tHfLNXuhVM9k1k",
        "youtube": "https://www.youtube.com/watch?v=FIvWOHczD6c"
      }
    },
    {
      "id": "8cee4859-1f8d-4078-9779-396c7547a830",
      "title": "Herbert W. Armstrong on Sex: Surprisingly Progressive | Worldwide Church of God",
      "description": "In this clip, we take a moment to give Herbert W. Armstrong a little credit for his take on sex. While exploring The Missing Dimension in Sex for our Unpack-It series, we discovered that Armstrong, unlike many Evangelicals and Catholics, didn\u0027t see sexual parts as dirty or shameful. He viewed them as beautiful but intended for use within marriage. Surprising, right? Join us as we continue unpacking Armstrong’s controversial teachings!\n\n#HerbertWArmstrong #SexualityInReligion #ApostateSisters #WCG #BodilyAutonomy #ReligiousTeachings #UnpackItSeries",
      "release": "2024-10-12T18:49:56Z",
      "duration": "00:00:58",
      "explicit": false,
      "youTubeId": "P_xJpYLQ6H0",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P_xJpYLQ6H0"
      }
    },
    {
      "id": "ebd0f866-6f16-4b29-8f1d-83d3a6bc714a",
      "title": "Self-Pleasure \u0026amp; Sexual Sin: How the Worldwide Church of God Controlled our Bodies \u0026amp; Minds Christian",
      "description": "Welcome to the Apostate Sisters Season 2 premiere! 🎉 In this episode, we’re diving headfirst under the covers into the uncomfortable yet crucial conversation about Self-Pleasure and Sexual Sin in the Worldwide Church of God (WCG). Growing up in a high-control religious environment meant we were constantly policed, even down to our personal, intimate behaviors—like masturbation.\n\nPatti, Nancy, and our trusted male guest J, who was also raised in the WCG, share candid stories about the shame, confusion, and teachings that shaped our sexual identities. From the bizarre teachings in \u0022The Missing Dimension in Sex\u0022 to generational layers of shame, we unpack how bodily autonomy was controlled and how it has affected us into adulthood. We also discuss the absurdities of societal messaging around masturbation, from Kellogg’s cornflakes to wild myths about going blind!\n\nJoin us as we break down these toxic teachings and reclaim our right to pleasure, self-awareness, and bodily autonomy. And don\u0027t forget to check out our Patreon to support the show and get your name in the credits! https://www.patreon.com/ApostateSisters",
      "release": "2024-10-12T16:30:17Z",
      "duration": "01:22:58",
      "explicit": false,
      "youTubeId": "FIvWOHczD6c",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FIvWOHczD6c"
      }
    },
    {
      "id": "57c5e799-4507-40d4-84eb-e1bf03230266",
      "title": "Ancient Sexual Rituals: What We’ll Never Know | Purity Culture | Worldwide Church of God | Herbie W",
      "description": "Ever wondered just how much ancient civilizations embraced sexuality before later religions suppressed or erased it? In this clip, we chat about how many ancient sexual traditions were probably destroyed or hidden, and what that says about our lost connection to these practices. Are we missing out on something that was once a natural part of human expression? Dive in with us as we discuss the forgotten history of sexuality in ancient times.\n\n#PurityCulture #AncientHistory #ReligiousSuppression #CulturalTaboos #ApostateSisters",
      "release": "2024-10-11T15:14:19Z",
      "duration": "00:00:37",
      "explicit": false,
      "youTubeId": "0ACzs0LV0X4",
      "subjects": [
        "Worldwide Church Of God",
        "Purity Culture"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0ACzs0LV0X4"
      }
    },
    {
      "id": "70d8101c-0a0d-4eaf-a766-132db0c22a37",
      "title": "God\u0026#39;s Design for Men and Women | UnPack It 13 | Herbert W. Armstrong | #TrueChristians",
      "description": "In this episode, we dive into the first half of Chapter 9 of Herbert W. Armstrong\u0027s The Missing Dimension in Sex. Armstrong\u0027s interpretations of God’s design for sex in humans raise some truly baffling claims about biology, gender roles, and sexuality. From comparisons of the human body to church structures to his strange views on the importance of genital design, we break it all down with our hot takes.\n\nJoin us as we explore the pseudoscientific language and outdated views on sex, marriage, and human anatomy that have left many followers confused and misinformed. Our discussion covers the connection between sexuality and spiritual teachings, while pointing out the inaccuracies and absurdities presented in this chapter.\n\nWant more commentary on cults, high-control groups, and the misuse of religious teachings? Subscribe and stay tuned for more as we explore bodily autonomy, sexuality, and healing from cult ideologies.\n\n🔗 Patreon: Support our channel and access exclusive content: patreon.com/ApostateSisters\n\nDon’t miss out—subscribe, like, and comment to join the conversation!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/6A_eq2tLhuk\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\nTags: Cult Kids, Cult Survivors, One True Church, WCG, Worldwide Church of God, Restored Church of God, Atheist, Agnostic, Expose Cult Harm\n\n#cultsurvivor #religioustrauma #HerbertWArmstrong #sexmyths #bodilyautonomy #cults #highcontrolgroups #exchristian #fundamentalism #healingjourney #cultrecovery #spiritualabuse #womensrights #deconstruction",
      "release": "2024-10-05T02:00:07Z",
      "duration": "01:06:00",
      "explicit": false,
      "youTubeId": "6zXEUpsfdXs",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6zXEUpsfdXs"
      }
    },
    {
      "id": "cda02eeb-f7f9-403f-b66b-f5e92f5ee0ad",
      "title": "Kerry Walker talks Cult Healing and Philosophy - The Clergy Project | Jehovah\u0027s Witnesses | WCG RCG",
      "description": "Discover the profound journey of Kerry Walker, a former Jehovah\u0027s Witness, as he navigates the relentless demands of his church and the painful truths of his upbringing in our latest Apostate Sisters interview. Kerry shares his experiences with the extreme expectations set by his faith—engaging in ministry daily, attending frequent meetings, and the intense indoctrination that shaped his youth.\n\nKerry\u0027s escape from religious thinking through philosophy highlights the struggles many face when questioning their beliefs. His story provides invaluable insights for former Jehovah\u0027s Witnesses, ex-pastors, and anyone curious about the mechanics of cult control.\n\nAdditionally, we delve into the supportive network of The Clergy Project, an online community designed for religious leaders transitioning away from belief. This initiative offers crucial resources for those seeking new paths in life, emphasizing security, anonymity, and mutual support among its diverse members. For more on The Clergy Project and its services, visit: https://clergyproject.org/\n\nJoin us as we explore the impacts of high-control groups and the liberating journeys of those who break free. Whether you\u0027re navigating your departure from religion or seeking understanding of these complex dynamics, this conversation aims to offer solidarity, enlightenment, and a path forward.\n\n#JehovahsWitnesses, #ExPastors, #CultRecovery, #ReligiousControl, #ApostateStories, #ExJWs, #CultSurvivors, #ReligiousTrauma, #SecularHumanism, #ClergyProject",
      "release": "2024-09-26T14:48:43Z",
      "duration": "01:13:56",
      "explicit": false,
      "youTubeId": "1IDH5hRigcQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1IDH5hRigcQ"
      }
    },
    {
      "id": "2ed2f1af-f045-4d0e-8635-cae4fba873ee",
      "title": "Meet Ashlen Hilliard, Cult Intervention Specialist | People Leave Cults",
      "description": "Join us for our conversation with Ashlen Hilliard, founder of People Leave Cults, as we explore the challenging yet transformative paths of cult survivors towards healing and freedom. In this episode, Ashlen shares her insights from her personal journey out of the Church of Christ and her professional work in aiding others to rebuild their lives post-cult.\n\nDiscover the roles of professional and peer support in recovery, and learn about the specialized resources available for survivors and their families through People Leave Cults and the Spiritual Abuse Forum for Education (SAFE).\n\nFor those looking to understand more about the impact of coercive control and how to navigate the challenges post-cult, this interview offers crucial perspectives and supportive resources. Whether you\u0027re a survivor yourself or know someone in need of guidance, Ashlen\u0027s expertise and empathetic approach provide a beacon of hope and a roadmap for recovery.\n\nHelpful Resources Mentioned in This Episode:\n\nPeople Leave Cults\n*Subscribe to our newsletter for updates*\nPeople Leave Cults: https://www.peopleleavecults.com/\nCult Recovery Services for Survivors of Cultic Groups or Relationships: https://www.peopleleavecults.com/services/cult-recovery\nCult Intervention Services for Concerned Loved Ones: https://www.peopleleavecults.com/services/cult-intervention-process\n\nSpiritual Abuse Forum for Education (SAFE) \n*Subscribe on our website for updates about future meetups and conferences*\n- Spiritual Abuse Forum for Education (SAFE) Meetups in Portland, Oregon: https://www.safeportland.org/\n- 2024 SAFE Conference - Not Alone: a Conference for Survivors and Helping Professionals: https://www.safeportland.org/safe-conference\n\nBeyond the Fence\n- Beyond the Fence Feature Film: https://www.beyondthefencemovie.com/\n- Follow Beyond the Fence on Instagram @beyondthefencemovie\n- Purchase a copy of the book that the script was adapted from — available on Amazon: https://www.amazon.com/Beyond-Fence-Lindsey-Paulette/dp/B0DCG2FTD2?source=ps-sl-shoppingads-lpcontext\u0026ref_=fplfs\u0026psc=1\u0026smid=ATVPDKIKX0DER\n- Watch and share the concept trailer: https://www.youtube.com/watch?v=J7iNPJ8I4nc\n*Trailer Content Warning: Beyond the Fence contains gender-based violence, including domestic abuse, sexual assault, and violence against women. Themes explored may be especially difficult for survivors of high-control groups or relationships. Viewer discretion is advised.\n\npower dynamics, leadership styles, cult influence, Herbert W Armstrong, control mechanisms, religious leadership, corporate hierarchy, high control groups, authority abuse, leadership in cults, power and control, cult dynamics, religious control, societal norms, organizational behavior, leader authority",
      "release": "2024-09-25T14:05:52Z",
      "duration": "01:16:51",
      "explicit": false,
      "youTubeId": "xrLQ2BmTTUY",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xrLQ2BmTTUY"
      }
    },
    {
      "id": "f2087f3f-322e-4e38-8366-4863ff37ae1d",
      "title": "Ovum Misconceptions in Cult Biology - the Misogynistic and Inaccurate works of Herbert W. Armstrong",
      "description": "Nancy, Joel, and Patti are back with the latest episode of \u0022Unpack-it\u0022 where we dissect Chapter 8 of \u0022The Missing Dimension in Sex\u0022 by Herbert W. Armstrong. We explore the assertions about biological differences between humans and animals, specifically focusing on ovulation and menstruation. Join us as we unravel the outdated and controversial perspectives on women\u0027s biology and how these views have shaped attitudes toward sex. Our discussion illuminates the inaccuracies in Armstrong\u0027s teachings and offers a critical analysis from a modern perspective. Whether you\u0027re interested in the intersection of religion and sexuality, or curious about how cult ideologies can impact sexual education, this episode is for you!\n\nJoin us as we unpack the psychological and spiritual manipulation embedded in these texts, exposing how cults use twisted interpretations of \u0022God\u0027s will\u0022 to control and subjugate their followers. This episode is essential for anyone interested in cult recovery, religious trauma, and the fight for personal autonomy.\n\nDon’t miss out—subscribe, like, and comment to join the conversation!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/6A_eq2tLhuk\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#UnPackIt #ApostateSisters #ReligiousTrauma #CultRecovery #BodilyAutonomy #Exvangelical #ChristianDeconstruction #HerbertWArmstrong #WorldwideChurchOfGod\n\nTags: Cult Kids, Cult Survivors, One True Church, WCG, Worldwide Church of God, Restored Church of God, Atheist, Agnostic, Expose Cult Harm",
      "release": "2024-09-21T02:00:18Z",
      "duration": "01:14:04",
      "explicit": false,
      "youTubeId": "ISG_Ig7qIjg",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ISG_Ig7qIjg"
      }
    },
    {
      "id": "3ca9b98c-a4c6-46b4-ade5-34bc656d3d59",
      "title": "From Advertiser to Cult Leader: The Rise of Herbert W. Armstrong and the Radio Church of God",
      "description": "We look at he early life of Herbert W. Armstrong, the founder of the Worldwide Church of God, and explore how his failed business ventures led him to build one of the most manipulative religious movements of the 20th century. From his beginnings in advertising and learning how to sell an image, to being influenced by his wife Loma and her religious upbringing, Armstrong\u0027s journey into religion was fueled by ambition and a need for control. Discover how he honed his persuasive style, got into radio broadcasting, and eventually founded the Radio Church of God, using his voice and free literature to draw in followers. This is the origin story of a man whose reach extended far beyond the pulpit, into the homes and minds of thousands.\n\nLinkTree:\nhttps://linktr.ee/apostatesisters\n\nKeywords: Herbert Armstrong, Radio Church of God, religious manipulation, cult origins, religious empire, Herbert Armstrong biography, early life of Herbert Armstrong, religious history",
      "release": "2024-09-10T14:01:07Z",
      "duration": "00:13:51",
      "explicit": false,
      "youTubeId": "a4KJQYHjpEc",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=a4KJQYHjpEc"
      }
    },
    {
      "id": "8902f5b0-bdae-40b1-a8a1-942647d819ba",
      "title": "Love \u0026amp; Guilt, Sex \u0026amp; Shame - Herbert W. Armstrong\u0026#39;s Misguided Views on Marriage | Biblical Marriage",
      "description": "In this episode of UnPack-It, we dive into the rest of Chapter 7 of Herbert W. Armstrong’s teachings, where he explores the idea that Satan has corrupted the understanding of sex—even within marriage. Armstrong claims that God-ordained marital love has been twisted into something shameful and perverted by satanic teachings, leading to feelings of guilt and repression in relationships. We break down Armstrong’s warped beliefs about the holy institution of marriage, sex as an expression of love, and the psychological damage caused by these teachings.\n\nJoin us as we deconstruct how Armstrong\u0027s views on marital sex are both controlling and manipulative, promoting shame rather than love. If you’re interested in cult deconstruction, religious trauma recovery, or curious about how religion distorts sexuality, this episode is for you!\n\n💡 How did Armstrong create guilt around sex in marriage? 🔥 What role did Satan play in Armstrong’s teachings on marital intimacy? 🧠 Learn how religious manipulation distorts the natural act of love between partners.\n\nLike, share, subscribe!!!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe video podcast from the Apostate Sisters: https://youtube.com/playlist?list=PLjAXNxmICW57WLOj0Lhn62v6vHx8bRWNy\u0026si=ZUzGD9GbtlCRlkMm\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#UnPackIt #ApostateSisters #ReligiousTrauma #CultRecovery #BodilyAutonomy #Exvangelical #ChristianDeconstruction #HerbertWArmstrong #WorldwideChurchOfGod #CultDeconstruction #ReligiousTrauma #SexInMarriage #Armstrongism #HerbertWArmstrong #ReligiousControl #SatanicTeachings #MarriageMyths #ReligiousShame #unpackit",
      "release": "2024-09-07T02:00:06Z",
      "duration": "01:11:15",
      "explicit": false,
      "youTubeId": "JWOSxdbgEyE",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JWOSxdbgEyE"
      }
    },
    {
      "id": "b2808be8-bfef-488a-9922-434a2603a0a2",
      "title": "Who Owns my Body Anyway?  | UnPack-it #10",
      "description": "In Episode 10 of UnPack-It, Nancy, Patti, and Joel dive deep into the complex and controversial teachings of Herbert W. Armstrong in Chapter 7 of The Missing Dimension in Sex. We focus on Armstrong’s twisted views on bodily autonomy, marriage, and sexual relationships. As we read through this chapter, we break down how Armstrong manipulates scripture to enforce rigid control over his followers, especially concerning sex and gender roles.\n\nIn this episode, we explore the absurdity of Armstrong\u0027s teachings, including his obsession with \u0022God-ordained\u0022 sexual relationships and his condemnation of any form of sexual expression outside of heterosexual marriage. We also discuss how these teachings have long-lasting effects on those raised in the Worldwide Church of God, particularly in areas of bodily autonomy and personal freedom.\n\nJoin us as we unpack the psychological and spiritual manipulation embedded in these texts, exposing how cults use twisted interpretations of \u0022God\u0027s will\u0022 to control and subjugate their followers. This episode is essential for anyone interested in cult recovery, religious trauma, and the fight for personal autonomy.\n\nDon’t miss out—subscribe, like, and comment to join the conversation!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/6A_eq2tLhuk\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#UnPackIt #ApostateSisters #ReligiousTrauma #CultRecovery #BodilyAutonomy #Exvangelical #ChristianDeconstruction #HerbertWArmstrong #WorldwideChurchOfGod",
      "release": "2024-08-24T02:00:06Z",
      "duration": "01:16:01",
      "explicit": false,
      "youTubeId": "Epj43YPmAjs",
      "subjects": [
        "Worldwide Church Of God",
        "Cult Recovery",
        "Evangelicalism",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Epj43YPmAjs"
      }
    },
    {
      "id": "88a95e35-cb59-423c-899a-d6329cb183e9",
      "title": "Unfiltered, Hilarious, and Raunchy: Best Moments from Season 1 | Apostate Sisters \u0026amp; MisterDifficult",
      "description": "Get ready for a wild ride through some of our favorite, most hilarious, and raunchy moments from Season 1 of Apostate Sisters! This compilation showcases the best of our authentic, no-holds-barred conversations with each other and our incredible friend Joel (MisterDifficult). We’re not just deconstructing our old cult conditioning—we’re doing it with style, laughter, and a ton of fun.\nWatch:\n- Who we are: We’re bringing our true selves, with all our quirks, beauty, and humor, to the forefront.\n- Our raunchy humor: Laugh along with us as we break down the absurdities of our past lives in the cult.\n- Insightful live deconstruction! Dive deep into the process of deconstructing from Christianity, especially for those who’ve had enough of the old control and conditioning from religious upbringings.\n\nFor Everyone Who\u0027s:\n- Deconstructing from Christianity\n- Tired of the religious control from their childhood\n- Looking for a good laugh while unpacking serious topics\n- Wanting to see some gorgeous people have a great time dismantling cult ideologies\n\nJoin us as we bring the heat, the laughs, and the hard truths. You won’t want to miss this!\n\nLike, Comment, and Subscribe to stay updated with all our latest content. Let’s continue to break free together!\n\nApostate Sisters:\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@UCNwaIjyXNJ2KuE8G-K8nlNg \n\nMisterDiffiCULT:\nYouTube: https://www.youtube.com/@misterdiffiCULT1\nTikTok: https://www.tiktok.com/@misterdifficult\n\nTags: ApostateSisters, Deconstruction, CultRecovery, ChristianDeconstruction, ReligiousTrauma, MisterDifficult, HumorAndHealing, LaughWithUs, Exvangelical, YouAreNotAlone",
      "release": "2024-08-20T18:45:49Z",
      "duration": "00:16:41",
      "explicit": false,
      "youTubeId": "0CSH0Y_wroI",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0CSH0Y_wroI"
      }
    },
    {
      "id": "24848a1e-9665-4ee8-899c-35d61dc7f9e3",
      "title": "Cult Control Exists Everywhere! Surviving a Cult | Dawna\u0026#39;s Story",
      "description": "Women\u0027s powerlessness when treated like objects by men of power - Nancy talks about the military commander who asked the girls about their panties. Boys will be Boys is soundly trounced by us. Dawna notes we are just taught to submit and made as just emotional.  Dawna was told to shut up while the WCG pastor took her ab*sive husband out for a beer. We\u0027re pissed off.",
      "release": "2024-08-17T19:59:20Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "Fdw4rF39pTc",
      "subjects": [
        "Worldwide Church Of God",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Fdw4rF39pTc"
      }
    },
    {
      "id": "47353c40-758b-4cf1-913b-2363cdf1ca4d",
      "title": "Life Reclaiming after Cult Survival, WCG Protected the Criminals? #ChurchofGod #Humanism",
      "description": "Life Reclaiming After Cult Survival: Dawna\u0027s Harrowing Journey - In this powerful and emotional episode, we sit down with Dawna, a survivor who endured unimaginable hardships within the Worldwide Church of God (WCG). From her childhood being stolen by manipulative cult tactics to fleeing for her life from an abusive partner, Dawna\u0027s story is one of resilience and strength. She was even pushed to the brink, planning to kill her own mother to save her from a doomsday that never came.\n\nDawna opens up about how the church protected the very predators who groomed and harmed her, leaving her vulnerable to further abuse. But despite these horrors, she has reclaimed her life with incredible courage. This episode shines a light on the most hidden parts of cult survival and the incredible strength it takes to rebuild a life afterward.\n\n🔍 Key Points:\n\nThe manipulation tactics that left Dawna vulnerable to abuse.\nHow the WCG protected criminals while ignoring victims.\nDawna\u0027s journey of reclaiming her life after fleeing for her survival.\nJoin us for this intense and inspiring conversation that underscores the resilience of those who survive cult abuse.\n\n👍 Like, Comment, and Subscribe to support survivors and stay updated with our latest episodes. Share your thoughts and experiences in the comments below!\n\nTags: ApostateSisters, CultSurvival, WCG, Resilience, SurvivorStory, ReclaimingLife, ReligiousTrauma, YouAreNotAlone",
      "release": "2024-08-15T02:02:19Z",
      "duration": "01:15:56",
      "explicit": false,
      "youTubeId": "pxoMSY85lNU",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pxoMSY85lNU"
      }
    },
    {
      "id": "24c0824e-cf1a-40f7-b593-09ba70edce5d",
      "title": "Red Cardinals \u0026amp; Religious Irony | UnPack-It Ep. 9 Missing Dimension #religioustrauma",
      "description": "Join us - Patti, Nancy, and Joel in Episode 9 of UnPack-It as we continue our deep dive into Herbert W. Armstrong\u0027s \u0022The Missing Dimension in Sex.\u0022 We kick off this episode with a humorous discussion about Christmas cards that often feature two male cardinals tending a nest, unknowingly challenging the gender binary with their bright red feathers—a delightful irony for many Christians using such imagery.\nIn This Episode:\nCardinal Confusion: The amusing oversight in Christmas card imagery and its implications.\nReading Armstrong: Continuing our critical analysis of Armstrong\u0027s controversial book.\nSatan and Metal Music: Exploring the concept of Satan in religious discourse and its influence on metal music.\n\nWhy Watch?\nEngage with our humorous take on traditional imagery and its unintended messages.\nDive into our critical reading of Armstrong\u0027s work, exposing its flaws and manipulative tactics.\nEnjoy our lively discussion on the intersections of religion, music, and cultural representation.\nLike, Comment, and Subscribe to stay updated on our latest episodes and join the conversation. Don\u0027t forget to hit the bell icon to get notified when we go live!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/6A_eq2tLhuk\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\nTags: UnPackIt, ApostateSisters, HerbertWArmstrong, CultRecovery, AtheistContent, ReligiousManipulation, CultLanguage #Deconstruction #BreakingFree #YouAreNotAlone @ApostateSisters \u0026 @MisterDiffiCULT1",
      "release": "2024-08-10T02:00:06Z",
      "duration": "01:22:39",
      "explicit": false,
      "youTubeId": "iNCarIcwLuc",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iNCarIcwLuc"
      }
    },
    {
      "id": "ff89cb60-1b8e-4742-83b4-bf9fd3caa947",
      "title": "Decoding Cult Control | UnPack-It #8 | Deconstruction Deconversion Secular Humanism Reality",
      "description": "In this episode of UnPack-It, Nancy, Joel, and Patti get deep into the manipulative language used by Herbert W. Armstrong to control and influence his followers. We dissect the subtle ways he othered Catholics, pretended to offer freedom while maintaining strict control, and reinforced hierarchical thinking to keep his cult members in line.\n\nKey Rabbit Trails we follow:\n\nManipulative Language: How Armstrong used godspeak to subtly control his followers.\nOthering Tactics: The techniques used to alienate Catholics and create an \u0027us vs. them\u0027 mentality.\nIllusion of Freedom: How he feigned granting freedom while keeping a tight grip on his congregation.\nHierarchical Reinforcement: The methods used to maintain and justify strict hierarchical structures.\nJoin us as we uncover the hidden control mechanisms in Armstrong\u0027s preaching and provide insights into breaking free from cult-like manipulation.\n\nLike, Comment, and Subscribe to stay updated on our latest episodes and join the conversation. Don\u0027t forget to hit the bell icon to get notified when we go live!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/6A_eq2tLhuk?si=deH7mp7rs2k22nhl\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\nTags: UnPackIt, ApostateSisters, HerbertWArmstrong, CultRecovery, AtheistContent, ReligiousManipulation, CultLanguage #Deconstruction #BreakingFree #YouAreNotAlone @ApostateSisters \u0026 @MisterDiffiCULT1",
      "release": "2024-07-27T02:00:06Z",
      "duration": "01:14:59",
      "explicit": false,
      "youTubeId": "iPY9QWE6rlY",
      "subjects": [
        "Worldwide Church Of God",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iPY9QWE6rlY"
      }
    },
    {
      "id": "13583fef-1e95-4f14-ac33-534b57fc234d",
      "title": "Q \u0026amp; A With the Apostate Sisters - the Apostasy Continues!",
      "description": "As we wrap up the first season of the Apostate Sisters, Nancy and Patti sit down for an intimate Question and Answer session! In this special episode, we answer your burning questions and share personal stories, insights, and reflections from our journey so far.\n\nPersonal Insights: Get to know Nancy and Patti on a deeper level as we discuss our personal experiences, beliefs, and the impact of our journey.\nWe answer questions about cult life, deconstruction, and what it\u0027s been like creating the Apostate Sisters podcast.\nReflections: Our thoughts on the first season, the highs and lows, and what we\u0027ve learned along the way.\nEngage with the personal side of the Apostate Sisters.\nHear firsthand stories and experiences that shaped our perspectives.\nDiscover what’s next for us as we look forward to Season 2.\nLike, Comment, and Subscribe to stay updated with all our content and join the conversation. Share your thoughts and questions in the comments below!\n\nApostateSisters, SeasonFinale, QandA, PersonalStories, CultSurvivors, Deconstruction, YouAreNotAlone",
      "release": "2024-07-20T13:00:06Z",
      "duration": "01:41:12",
      "explicit": false,
      "spotifyId": "25YFrsDU96KMBH1cvJ5vio",
      "youTubeId": "6A_eq2tLhuk",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/25YFrsDU96KMBH1cvJ5vio",
        "youtube": "https://www.youtube.com/watch?v=6A_eq2tLhuk"
      }
    },
    {
      "id": "88216bcd-0323-4080-8eac-11e7ed6218c3",
      "title": "Don’t Do It Like Mammals! - WCG Cult Leader | UnPack-it #7",
      "description": "Herbie on Humans vs. \u0022Dumb\u0022 Animals - Debunking Herbert W. Armstrong\n\nJoin Nancy, Joel, and Patti in Episode 7 of our UnPack-It series as we dive into Herbert W. Armstrong\u0027s controversial views from his book, \u0022The Missing Dimension in Sex.\u0022 Armstrong notoriously despised the idea that humans are animals, labeling them as \u0022dumb\u0022 and inferior. We take serious offense at this and explore how these misconceptions fail to recognize the intelligence and complexity of the animal kingdom.\n\nIn This Episode:\n- Debunking Myths: We dissect Armstrong\u0027s claims and highlight how animals often surpass humans in various forms of intelligence and behavior.\n- Scientific Insights: Fascinating facts and stories about animal intelligence that challenge Armstrong\u0027s demeaning perspective.\n- Continued Reading: More excerpts from \u0022The Missing Dimension in Sex,\u0022 exposing the flawed teachings of the Worldwide Church of God.\n\nLike, Comment, and Subscribe to stay updated on our latest episodes and join the conversation. Don\u0027t forget to hit the bell icon to get notified when we go live!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters:https://youtu.be/8mxsiqh598g\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#UnPackIt #ApostateSisters #HerbertWArmstrong #AnimalIntelligence #ReligiousCritique #CultSurvivors #WorldwideChurchOfGod #DebunkingMyths #HumanAndAnimalConnection #YouAreNotAlone",
      "release": "2024-07-13T02:00:07Z",
      "duration": "01:27:52",
      "explicit": false,
      "youTubeId": "-J6hEX1Eawc",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-J6hEX1Eawc"
      }
    },
    {
      "id": "c87178d8-fc37-4e21-9b05-795469db6f41",
      "title": "Cult Tactics: The Wheel of Power \u0026amp; Control, Part 3",
      "description": "Final Episode of Season 1: The Wheel of Power and Control, Part 3\n\nIn our explosive season finale, Nancy and Patti dive deep into the manipulative tactics used by cults and high-control churches to dominate and control their followers. We uncover the sinister ways these groups wield *Sex and Gender Control* and *Economic Control* to keep their members in line and maintain their power.\n\nWhat You’ll Learn:\n- How cults enforce rigid gender roles and sexual norms to suppress individuality and freedom.\n- The economic tactics used to create dependency and obedience, from financial manipulation to labor exploitation.\n- Real-life examples and personal stories that highlight the devastating impact of these control mechanisms.\n\nJoin us for a riveting conclusion to our exploration of the Wheel of Power and Control, and discover how these oppressive systems operate and how survivors can reclaim their lives and autonomy.\n\nDon\u0027t Miss Out:\n- Insightful analysis and hard-hitting truths.\n- Personal anecdotes that bring these issues to life.\n- Strategies for breaking free and supporting others in their journey.\n\nThank you for being with us throughout this season. We hope this series has empowered you to see through the tactics of high-control groups and inspired you to seek freedom and authenticity.\n\nLike, Comment, and Subscribe to stay updated on our journey and future episodes. Share your thoughts and experiences in the comments below!\n\nThe Wheel: https://www.empathyparadigmtherapy.com/powercontrol\n\nApostate Sisters: \nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@UCNwaIjyXNJ2KuE8G-K8nlNg \nFacebook: https://www.facebook.com/ApostateSisters\n\n#CultControl #HighControlGroups #ReligiousAbuse #EconomicControl #GenderControl #ApostateSisters #FreedomFromControl #SeasonFinale #WheelOfPowerAndControl #SurvivorStories #BreakFree #YouAreNotAlone",
      "release": "2024-07-06T13:00:16Z",
      "duration": "01:05:53",
      "explicit": false,
      "spotifyId": "4RwJHGCGlA3mn3GUOWG5Jt",
      "youTubeId": "8mxsiqh598g",
      "subjects": [
        "Cult Recovery",
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4RwJHGCGlA3mn3GUOWG5Jt",
        "youtube": "https://www.youtube.com/watch?v=8mxsiqh598g"
      }
    },
    {
      "id": "27c2cd65-3a29-49bd-9e99-5495447d163a",
      "title": "Nerding Out on Sex and Science | UnPack-It Episode 6",
      "description": "In Episode 6 of UnPack-It, our eclectic group dives into the depths of Herbert W. Armstrong\u0027s \u0022The Missing Dimension in Sex,\u0022 only to find ourselves wishing we could skip to the sexy stuff. But don\u0027t worry, we make the most of it with some serious biblical, language, and science nerdery!\n\nJoin us as we:\n\n-Explore the fascinating similarities and differences between humans and animals\n-Get geeky about the nuances of biblical language and scientific perspectives\n-Share our personal takes on what spirituality really means to us\n\nIt’s a wild ride through intellect and humor with a touch of frustration as we navigate Armstrong’s convoluted ideas. Tune in for a blend of deep discussions and lighthearted moments with your favorite UnPack-It hosts!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/LbfpG-buTvU?si=UaURKWmd2xMWw-Rk\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#ApostateSisters \n#MisterDiffiCULT\n#UnPackIt\n#CultSurvivor\n#ExCult\n#HerbertWArmstrong #CultLiterature #ApostateSisters #ReligiousExposed #TheMissingDimensionInSex\n#SexScience #BiblicalStudies #EclecticGroup #Spirituality #ScienceNerds #ApostateSisters",
      "release": "2024-06-29T02:00:07Z",
      "duration": "01:28:38",
      "explicit": false,
      "youTubeId": "JNKMxSr63bU",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JNKMxSr63bU"
      }
    },
    {
      "id": "6922601f-20cc-4824-8dee-4c4f45cba058",
      "title": "From Cult Upbringing to Advocate: Jay Tells Her Story #Interview #ApostateSisters",
      "description": "In our latest interview, we sit down with Jay, a vibrant and outspoken, compassionate former cultie with bright red hair and a personality to match. Growing up in the Worldwide Church of God in the Midwest, Jay\u0027s childhood was shaped by the high-control environment of the church. Today, she channels her experiences into helping others, working with people in domestic abuse situations—a field she finds deeply connected to her own past.\n\nJoin us as Jay shares her powerful story of transformation, from a childhood marked by strict religious control to becoming a passionate advocate for domestic abuse survivors. We explore the parallels between cult dynamics and domestic abuse, highlighting the common threads of manipulation, control, and the journey to reclaim personal power.\n\nDon’t miss this compelling episode, filled with Jay’s fiery insights and heartfelt reflections. Her story is a testament to resilience and the power of turning personal struggles into a force for good.\n\n#CultSurvivor #DomesticAbuseAdvocate #WorldwideChurchOfGod #SurvivorStory #ApostateSisters #Resilience #Empowerment #BreakingFree",
      "release": "2024-06-26T16:00:50Z",
      "duration": "01:23:14",
      "explicit": false,
      "youTubeId": "wlHaphT-Eq4",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wlHaphT-Eq4"
      }
    },
    {
      "id": "f08a1dbd-9497-4383-9ed3-450fe3cf7eda",
      "title": "S1 E19: Cult Tactics - The Wheel of Power and Control, Part 2",
      "description": "In this episode of the Apostate Sisters podcast, Nancy and Patti continue their commentary and insights into the Religious/Spiritual Abuse Wheel of Power and Control from Empathy Paradigm Therapy. This second installment focuses on three critical aspects: Isolation \u002B Insulation, Loss of Autonomy, and Justification.\n\n\n\nWe explore how these tactics are used to control and manipulate individuals within high-control groups and beyond, including:\n\n\n     \n      \n  •  Isolation \u002B Insulation: Physical and emotional separation, restricted access to outside support, insider/outsider language, and censorship.\n     \n      \n  •  Loss of Autonomy: Continuous monitoring, denial of privacy, and undermining self-trust.\n     \n       \n  •  Justification: Gaslighting, victim-blaming, and invoking the greater good to rationalize abusive behaviors.\n     \n     \n\n\nOur conversation includes personal stories and examples from organized religions, mainstream society, and governmental systems. We discuss the impact of these tactics and how they perpetuate abuse, drawing from our own experiences of being told we were disciplined out of love.\n\n\n\nListen in to better understand these manipulative practices and how to protect yourself and others from their harmful effects.\n\n\n\n#SpiritualAbuse #ReligiousAbuse #ControlTactics #Isolation #AutonomyLoss #Justification #EmpathyParadigmTherapy #ApostateSisters #Deconstruction #HealingJourney",
      "release": "2024-06-22T13:26:36Z",
      "duration": "00:59:49",
      "explicit": false,
      "youTubeId": "Hw-BGx6SJt4",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Hw-BGx6SJt4"
      }
    },
    {
      "id": "a172100e-057f-41c3-974c-f2ffbe0d83d3",
      "title": "Cult Tactics: The Wheel of Power and Control, part 2",
      "description": "Join Nancy and Patti for the second episode in our series providing our take on the Religious/Spiritual Abuse Wheel of Power and Control from Empathy Paradigm Therapy. This week, we delve into the insidious tactics of Isolation \u002B Insulation, Loss of Autonomy, and Justification used by high-control groups to manipulate and dominate their members.\n\nWe discuss:\n\nIsolation \u002B Insulation: Physical and emotional separation, restricted access to support and resources, insider/outsider language, and censorship of information.\nLoss of Autonomy: Constant contact, denial of privacy, and the erosion of self-trust.\nJustification: Minimizing harm, victim-blaming, and invoking the greater good to excuse abuse.\n\nFull Wheel found on Empathy Paradigm Therapy\u0027s website here: https://www.empathyparadigmtherapy.com/powercontrol\n\nThrough personal anecdotes and examples from various organized religions, mainstream society, and governmental systems, we reveal how these tactics are not just confined to cults but are prevalent in many aspects of life.\n\nTune in to hear our stories, including the painful memories of being told we were spanked out of love, and learn how to recognize and resist these controlling behaviors.\n\nThanks for joining us as we deconstruct and engage in apostasy!\n\nSocial Media: Many thanks to Jason!!\n\n#SpiritualAbuse #ReligiousAbuse #ControlTactics #Isolation #AutonomyLoss #Justification #EmpathyParadigmTherapy #ApostateSisters #Deconstruction #HealingJourney",
      "release": "2024-06-22T13:00:18Z",
      "duration": "00:59:49",
      "explicit": false,
      "spotifyId": "6efHdsc23TvhTvmi3hlcUe",
      "youTubeId": "LbfpG-buTvU",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6efHdsc23TvhTvmi3hlcUe",
        "youtube": "https://www.youtube.com/watch?v=LbfpG-buTvU"
      }
    },
    {
      "id": "742429bc-bbc2-49fc-8f10-139a7746faad",
      "title": "Author Kara Reynolds on Writing \u0027Priestess\u0027 and Overcoming Trauma",
      "description": "Join us in this entertaining interview with Kara Reynolds, the brilliant author of \u0022Priestess.\u0022 A writer, watercolor artist, and a survivor of a high-control church group, Kara Reynolds connects with themes of deconstruction and self-reclamation through her latest book, \u0022Priestess,\u0022 perfectly aligning with our mission at the Apostate Sisters. In \u0022Priestess,\u0022 Kara explores the long-lasting effects of religious trauma through the lens of romantic fantasy, set in a fantastical world with a quasi-dark ages setting.\n\nIn this episode, we discuss how \u0022Priestess\u0022 unpacks the complexities of religious trauma and personal empowerment, resonating deeply with anyone who has faced similar journeys of faith and identity. We note the underlying theme of women who help each other, instead of fight each other. Kara shares her inspiration, the feedback that led her to self-publish, and her thoughts on navigating spirituality post-trauma.\n\nWhether you’re a fan of fantasy literature, interested in stories of personal growth, or seeking to understand the impact of religious upbringing, this interview is a must-watch. Tune in to hear how Kara’s work echoes our own experiences and aims to support others on their path to healing and self-discovery.\n\nDon’t forget to like, comment, and subscribe for more insightful discussions and stories.\n\nFind Kara: \nInstagram: https://www.instagram.com/karaneedstoread/\nFind the Book: \nAmazon: https://a.co/d/0NaNHl5\nGoodreads: https://www.goodreads.com/book/show/204988997-priestess\n\n#Priestess #KaraReynolds #ApostateSisters #ReligiousTrauma #SelfReclamation #FantasyLiterature #SpiritualHealing",
      "release": "2024-06-19T15:00:38Z",
      "duration": "01:16:23",
      "explicit": false,
      "youTubeId": "f7ZFyyBbHOM",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f7ZFyyBbHOM"
      }
    },
    {
      "id": "fe131b52-7c8a-4b6b-9c15-fea082bccc01",
      "title": "Sexy Cult Secrets Revealed: All Hail Henry Cavill! | UnPack-It #5",
      "description": "Ready for some sexy, silly shenanigans? Join us for Episode 5 of UnPack-It, where we former cult kids take a wild turn and start our own cult—dedicated to none other than the irresistibly charming Henry Cavill! 😍🎬\n\nIn this uproarious episode, Joel and Nancy can\u0027t help but gush over Henry\u0027s good looks and magnetic charm. We dive into what makes him the perfect object of our humorous admiration and how we\u0027d structure our very own Cavill-centric cult. Whether it\u0027s his iconic roles or just that jawline, there\u0027s plenty to worship!\n\nLaugh along with us as we poke fun at our pasts, revel in our present, and maybe even pick up a few new followers for the Cult of Cavill. This episode is packed with fun, laughter, and a touch of the absurd.\n\nDon’t miss out on the sexy, silly fun—hit that play button and join the cult! And don\u0027t forget to like, comment, and subscribe for more outrageous episodes of UnPack-It.\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/PD9Jwih-hVw?si=zJF15AilZaXB24Jv\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#ApostateSisters \n#MisterDiffiCULT\n#UnPackIt\n#CultSurvivor\n#ExCult\n#UnPackIt  #CultOfCavill #HenryCavill #SexyShenanigans #CultHumor #FormerCultKids #Hilarious #MustWatch",
      "release": "2024-06-15T02:00:06Z",
      "duration": "01:27:13",
      "explicit": false,
      "youTubeId": "2Ojh7Eckp2I",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2Ojh7Eckp2I"
      }
    },
    {
      "id": "cbd3c355-ccf5-432f-abd9-ac0e0c2df7bd",
      "title": "Exposing the Upper Echelons of the Worldwide Church of God: Deni Azeredo\u0026#39;s Story",
      "description": "Join us for a revealing interview with Deni Azeredo, a Brazilian American who now resides in Brazil. Deni\u0027s unique perspective as someone who grew up in the Worldwide Church of God offers an inside look at the intricate and often perilous dynamics of this high-control group.\n\nDeni\u0027s father worked at the church headquarters in Pasadena as a groundskeeper and Portuguese translator, placing their family in close proximity to the church\u0027s leadership. Deni attended the prestigious Imperial Schools and was one of the \u0027Little Ambassadors,\u0027 performing with children from around the globe to bolster the church’s image.\n\nIn this episode, Deni shares his firsthand experiences navigating the upper echelons of the cult, detailing the backbiting and dangerous political games among the leaders. He provides an intimate look at the controlling world of Herbert W. Armstrong, shedding light on the complex power dynamics and the constant maneuvering for favor and position within the church\u0027s hierarchy.\n\nBeyond his childhood and adolescent years, Deni also recounts his time in the military, including his service in Iraq, offering a comprehensive view of his journey from a child within a powerful cult to a seasoned veteran.\n\nDon\u0027t miss this in-depth exploration of life inside the Worldwide Church of God and the personal journey of someone who lived through its inner workings. Like, comment, and subscribe for more eye-opening interviews and discussions.\n\n#WorldwideChurchOfGod #CultSurvivor #InsideTheCult #HerbertWArmstrong #CultDynamics #ImperialSchools #LittleAmbassadors #MilitaryVeteran #ExCultMember #ApostateSisters",
      "release": "2024-06-12T14:00:43Z",
      "duration": "01:17:09",
      "explicit": false,
      "youTubeId": "nZjMZGpQNdY",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nZjMZGpQNdY"
      }
    },
    {
      "id": "2523aec3-ddc9-4529-b42c-8952a1a2dc69",
      "title": "Cult Tactics: The Wheel of Power and Control",
      "description": "Explore the sinister mechanisms of Coercion, Intimidation, and Shame in our latest episode, \u0022Cult Tactics: the Wheel of Power and Control.\u0022 In this first installment, Nancy and I analyze these powerful tactics using the Wheel of Power and Control from Empathy Paradigm Therapy. Witness how these strategies are not only employed in cults but are also evident in broader societal interactions.\n\nIn this revealing episode, we uncover how cults manipulate and dominate their members by instilling fear, guilt, and inferiority. These methods are shockingly mirrored in everyday societal dynamics, shedding light on the pervasive nature of control and authority in our lives. \n\nJoin us as we expose these tactics, offering insights and strategies to recognize and resist manipulation in any form. This is a must-watch for anyone interested in understanding the psychology behind power and control in high-stakes environments.\n\n#CultTactics #PowerAndControl #SpiritualAbuse #Manipulation #Society #ExposeCults #FightFear #ResistControl #EmpathyParadigm #ApostateSisters",
      "release": "2024-06-08T13:00:28Z",
      "duration": "01:16:39",
      "explicit": false,
      "spotifyId": "3jyMkLmKYjzxjfM3RPEO1B",
      "youTubeId": "RQjBAxUwsQU",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3jyMkLmKYjzxjfM3RPEO1B",
        "youtube": "https://www.youtube.com/watch?v=RQjBAxUwsQU"
      }
    },
    {
      "id": "7151b9d7-fba7-4339-a55c-585b2ff66972",
      "title": "Cult Tactics with the Apostate Sisters",
      "description": "Are you a cycle breaker? In our upcoming episode, Cult Tactics, we get into the dynamics of power and control in spiritual abuse. Discover how cults and high-control churches manipulate and dominate, and how individuals like us can break these cycles of abuse. Join the @ApostateSisters on YouTube as we explore strategies to reclaim your power and voice in the face of spiritual manipulation. #CycleBreakers #SpiritualAbuse #PowerAndControl #ApostateSisters",
      "release": "2024-06-07T16:31:12Z",
      "duration": "00:01:14",
      "explicit": false,
      "youTubeId": "-K1UMM6yqxQ",
      "subjects": [
        "Worldwide Church Of God",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-K1UMM6yqxQ"
      }
    },
    {
      "id": "7397d02e-5158-434a-9bd2-26e6d90ade2a",
      "title": "Topless Prophecies Enticing Teens in the Worldwide Church of God #shorts",
      "description": "Ever heard a prophecy that made you raise an eyebrow?  In today’s clip, David shares a quirky prediction from his church days—by 1975, women were supposed to be walking around topless due to moral decay! As a 14-year-old, David found himself somewhat disappointed when this particular prophecy didn’t pan out. \n\nTune in as we explore some of the more unusual and humorous beliefs from the past. It’s a light-hearted look at the sometimes bizarre expectations set by religious groups. #FailedProphecies #ChurchHumor #ApostateSisters",
      "release": "2024-06-06T14:30:15Z",
      "duration": "00:00:59",
      "explicit": false,
      "youTubeId": "kVP-bpTTV1w",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kVP-bpTTV1w"
      }
    },
    {
      "id": "f07f74d8-e6cc-4031-b92e-4fd489ec8093",
      "title": "1960s Kids in the Worldwide Church of God #Shorts",
      "description": "In the 1960s, kids in the Worldwide Church of God attended public schools, but by the 1980s, a major shift had occurred. Dive into our latest clip where David Ward reflects on how this move to homeschooling might have eased social pressures but intensified indoctrination. Was it protection or control?   \n\nJoin us as David explores the impact of being educated at home and the deeper implications it had on church youth. It’s a thought-provoking peek into the tactics that can shape young minds around the clock.  #CultSurvivor #Indoctrination #ApostateSisters\n\nWatch the full discussion and share your thoughts!",
      "release": "2024-06-05T14:15:05Z",
      "duration": "00:00:59",
      "explicit": false,
      "youTubeId": "oR8OnHdGXJs",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oR8OnHdGXJs"
      }
    },
    {
      "id": "dd47f9cb-0f52-41f2-8c1b-3ce6e737bd77",
      "title": "A 60s Childhood in the Worldwide Church of God: David Ward\u0026#39;s Story",
      "description": "Welcome to a new episode of the Apostate Sisters Interview Series, where we hold space for the life stories of those who were once entangled in the web of the Worldwide Church of God. Today, we\u0027re joined by David Ward, who was introduced to the church in his early childhood in the mid-1960s and left as a teenager in the late 1970s.\n\nRaised in a family deeply committed to the church after his father discovered \u0022The Plain Truth\u0022 magazine, David\u0027s upbringing was steeped in the doctrines and practices of the church, from observing the Sabbath to attending the impressive Ambassador Auditorium for holy days. Despite the church\u0027s deep influence, David recounts his journey with a reflective and critical eye, especially discussing his transition away from these beliefs during his pursuit of higher education.\n\nToday, while his mother and some siblings still observe the church\u0027s teachings, David identifies as an atheist, maintaining a nuanced view of his time within the church. This episode explores the complex dynamics of growing up in a cult, the allure of questioning, and the path to personal freedom. Join us as David shares insights into the everyday life aspects of cult membership, including youth camps, relationships, and the impact of church doctrines on personal decisions like dating and education.\n\nDavid\u0027s story is a testament to the power of questioning and the search for personal truth. As we unpack his experiences, we invite our listeners to reflect on their own journeys and the impact of religious teachings on personal growth and freedom.",
      "release": "2024-06-05T14:00:35Z",
      "duration": "00:50:01",
      "explicit": false,
      "youTubeId": "ed5uBX-IAF8",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ed5uBX-IAF8"
      }
    },
    {
      "id": "ed90a2b8-955f-417f-b788-1ed9b9da90f9",
      "title": "Cult Kids Read Cult Literature! UnPack-It: The Missing Dimension in Sex, Part 4",
      "description": "Welcome to Episode 4 of UnPack-It! In this episode, the Apostate Sisters dive deep into the bizarre and sad but hilarious world of Herbert W. Armstrong’s cult literature. We take a closer look at \u0022The Missing Dimension in Sex,\u0022 unpacking his outlandish claims about sex, relationships, and morality.\n\nJoin us for a mix of serious analysis and lighthearted fun as we explore the teachings that shaped a generation of followers and reveal the absurdities that lie within. Whether you’re familiar with Armstrong’s work or new to his controversial ideas, this episode promises to be both enlightening and entertaining.\n\nTune in for laughs, insights, and the Apostate Sisters\u0027 and MisterDiffiCULT take on one of the most peculiar pieces of cult literature. Don’t forget to like, comment, and subscribe to stay updated on all our future episodes. Share your thoughts in the comments below—how did these teachings impact you or someone you know?\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/PD9Jwih-hVw?si=zJF15AilZaXB24Jv\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#ApostateSisters \n#MisterDiffiCULT\n#UnPackIt\n#CultSurvivor\n#ExCult\n\n#UnPackIt #HerbertWArmstrong #CultLiterature #ApostateSisters #ReligiousExposed #TheMissingDimensionInSex",
      "release": "2024-05-30T05:45:34Z",
      "duration": "01:01:40",
      "explicit": false,
      "youTubeId": "v-MaMd0Bnxc",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=v-MaMd0Bnxc"
      }
    },
    {
      "id": "78036e8c-cff9-468d-b817-2f4406f9d96c",
      "title": "Confronting Cults with Comedy: Joel\u0026#39;s Journey through the Worldwide Church of God",
      "description": "Join the Apostate Sisters for an enlightening interview with Joel, a dynamic TikTok and YouTube creator known for his insightful content on Armstrongist cults and the weaponization of biblical texts. Born with a serious medical condition and openly gay, Joel brings a unique perspective to his studies of Greek and Hebrew, diving deep into the complexities of Christianity and the Bible. As a former member of the Worldwide Church of God, his experiences add profound depth to his commentary. In this episode, we explore Joel\u0027s journey from cult survivor to digital content creator, discussing his linguistic skills, personal challenges, and the humor he brings to serious topics. Joel also collaborates with us on the UnPack-It series, making this interview a special feature of our ongoing partnership. Tune in to discover Joel’s transformative story and gain insights into his approach to deconstructing religious narratives.\n\nJoel\u0027s TikTok: https://www.tiktok.com/@UCr_uEruW5BYY7JPhmIDc9ew \nJoel\u0027s YouTube: https://www.youtube.com/@misterdiffiCULT1",
      "release": "2024-05-29T15:16:25Z",
      "duration": "01:10:31",
      "explicit": false,
      "youTubeId": "-vvbJfU5_c4",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-vvbJfU5_c4"
      }
    },
    {
      "id": "273b42e6-83c7-4410-8cd8-69d99f22f1f5",
      "title": "Every Church Thinks They Are the \u0026quot;True Church\u0026quot; #Shorts #ApostateSisters",
      "description": "Explore the harsh realities of religious splintering with the Apostate Sisters\n\nJoin Nancy and Patti as they delve into the divisive world of the Worldwide Church of God in our latest video. Uncover the emotional and psychological impacts of labeling and exclusion on individuals and their communities. How do these splinters affect the followers\u0027 sense of identity and belonging?\n\n#CultIndoctrination #ReligiousSplintering #TrueChurch #ApostateSisters #ChurchDynamics",
      "release": "2024-05-27T14:28:52Z",
      "duration": "00:00:48",
      "explicit": false,
      "youTubeId": "xAGIlkbvFY8",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xAGIlkbvFY8"
      }
    },
    {
      "id": "e945347d-48c1-4bdb-a6c1-3981014333fe",
      "title": "Garner Ted Looks for a Happy Ending #Shorts #CultSurvivor",
      "description": "In this final episode of our series on Herbert W. Armstrong and the Worldwide Church of God, discover the aftermath of Armstrong\u0027s death, which shattered the church and gave rise to many splinter groups. His son, Garner Ted Armstrong got too fresh with the masseuse. Don\u0027t forget to support our work! https://linktr.ee/apostatesisters",
      "release": "2024-05-26T14:22:15Z",
      "duration": "00:00:49",
      "explicit": false,
      "youTubeId": "W0vRu4cAjHo",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=W0vRu4cAjHo"
      }
    },
    {
      "id": "598c9987-567d-41d8-b2e0-618d599f55f0",
      "title": "S1 E15: Spirits \u0026 Spectacles - The Life and Influences of Herbert W. Armstrong, Part 4",
      "description": "Join us for another #FieryBitches episode of \u0022Apostate Sisters\u0022 as we dive into the controversial depths of Herbert W. Armstrong\u0027s legacy in our fourth installment of the series. This time, Nancy and Patti explore the explosive revelations found in \u0022HWA\u0027s Tangled Web,\u0022 a book that exposes the lying, stealing, and deceit that ran rampant under Armstrong\u0027s leadership at the Worldwide Church of God. But first, lighten up with us as we chuckle over a delightfully cheesy video from 1980 featuring the Ambassador College choir. Nancy\u0027s insightful commentary not only unpacks the absurdities of the era but also sets the stage for the darker themes we delve into. In this episode, we uncover the complex web of manipulation and moral corruption that defined much of Armstrong\u0027s tenure, drawing on detailed accounts and personal anecdotes to paint a comprehensive picture of his impact. Whether you\u0027re a former member, a history buff, or just curious about the inner workings of cult dynamics, this episode offers a unique blend of humor, historical analysis, and critical reflection. \u0026#x1f3a7; Listen on Spotify and watch on YouTube to discover the hidden stories behind one of the most controversial religious leaders of the 20th century. Don\u0027t forget to subscribe, like, and comment to join the conversation and share your thoughts and experiences. #ApostateSisters #HerbertWArmstrong #CultsExposed #ReligiousHistory #TangledWeb #FieryBitches",
      "release": "2024-05-25T14:02:01Z",
      "duration": "01:12:02.1150000",
      "explicit": false,
      "spotifyId": "74IMV9usaMcNhXeWQnQC0P",
      "youTubeId": "ct_oFlzt0H0",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74IMV9usaMcNhXeWQnQC0P",
        "youtube": "https://www.youtube.com/watch?v=ct_oFlzt0H0"
      }
    },
    {
      "id": "3de23af6-d5e4-4a1b-9c94-c66e29843b4b",
      "title": "S1 E17: Gin \u0026 Juice \u0026 Spectacles - Herbert W. Armstrong The Aftermath, Part 6",
      "description": "Join us for the dramatic conclusion of our series exploring Herbert W. Armstrong\u0027s life and the seismic shifts in the Worldwide Church of God during the 1990s. In this sixth and final episode, we find ourselves in the tumultuous period following Armstrong\u0027s death, which led to the fragmentation of the church and the rise of numerous splinter groups. Discover how the foundational cracks within the church widened into schisms that reshaped the landscape of the movement. We take a closer look at the key figures and factions that emerged, each claiming to carry the true legacy of Armstrong\u0027s teachings. This episode provides a comprehensive wrap-up of the forces that led to the church\u0027s eventual collapse and the lasting influences that continue to impact its former members today. As we conclude our series, we reflect on the complex legacy of Herbert W. Armstrong, exploring what his life and the church\u0027s evolution teach us about faith, authority, and the human quest for spiritual identity, and we question if any of those things really matter. Thank you for joining us on this journey through history and human drama. Don\u0027t forget to like, comment, and subscribe for more insightful content from the Apostate Sisters. Enjoy our content? Support our work! https://linktr.ee/apostatesisters",
      "release": "2024-05-25T13:42:19Z",
      "duration": "01:11:27.6340000",
      "explicit": false,
      "spotifyId": "6iMzJrexJdXKoAPNaFHOcv",
      "youTubeId": "-g2FhdqrFT4",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6iMzJrexJdXKoAPNaFHOcv",
        "youtube": "https://www.youtube.com/watch?v=-g2FhdqrFT4"
      }
    },
    {
      "id": "527468e2-f0e9-4ade-aaea-73bfbc43282c",
      "title": "UnPack-It!! The Missing Dimension In Sex Part 3 | Apostate Sisters \u0026amp; MisterDiffiCULT",
      "description": "Step into a provocative and enlightening discussion in the third episode of \u0022UnPack-It,\u0022 where things get a little spicier than usual! Join the Apostate Sisters, Nancy and Patti, as they sit down with Joel, whose Christian beliefs stray far from the mainstream path. This episode promises a blend of fiery debate, unexpected revelations, and a dash of humor as we explore the fringes of faith and belief.\n\nIn this lively exchange, Joel shares his unconventional Christian perspectives, challenging both the traditional doctrines and our own preconceptions. The conversation navigates through the complexities of holding faith in a world dominated by orthodox religious views, sparking a broader dialogue about belief, acceptance, and the freedom to question.\n\nWhether you\u0027re a skeptic, a believer, or somewhere in between, this episode offers a fresh take on what it means to maintain personal faith that doesn’t align with mainstream Christianity. Tune in as we dissect, discuss, and even disagree, all in the spirit of understanding and exploration.\n\nDon’t miss this intense yet insightful episode of \u0022UnPack-It,\u0022 where we push the boundaries of conventional religious discourse. Remember to like, subscribe, and engage in the comments as we delve into these deep discussions. Your thoughts and reactions are what make our journey through these topics so enriching.\n\n#UnPackIt #ApostateSisters #NonMainstreamFaith #ReligiousDebate #ExploringBeliefs\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/PD9Jwih-hVw?si=zJF15AilZaXB24Jv\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#ApostateSisters \n#MisterDiffiCULT\n#UnPackIt\n#CultSurvivor\n#ExCult",
      "release": "2024-05-18T02:00:06Z",
      "duration": "01:15:37",
      "explicit": false,
      "youTubeId": "R-1HH4Y3HnA",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R-1HH4Y3HnA"
      }
    },
    {
      "id": "2e2057d9-71ca-45d8-a937-c1f0ca13e6dd",
      "title": "Cult Leaders controls sexual behavior: The Missing Dimension in Sex by Herbert W. Armstrong #shorts",
      "description": "This Friday night, May 17th at 9 PM Central, dive into the scandalous world of cult literature with \u0022Cult Kids Read Cult Literature.\u0022 Join Nancy, Patti, and Joel as they tackle Herbert W. Armstrong\u0027s notorious \u0022The Missing Dimension in Sex.\u0022 We\u0027re ramping up to the most sensational parts, with three chapters left until we hit the juiciest content! Consider this episode your delightful primer—Herbert W. Armstrong style. Don’t miss out, tune in for an evening of tantalizing foreplay with the Apostate Sisters! \n\n#CultLiterature #ReligiousTrauma #Deconstruction #WCG #HerbertWArmstrong",
      "release": "2024-05-16T13:40:46Z",
      "duration": "00:01:15",
      "explicit": false,
      "youTubeId": "vjhmZis6ng4",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vjhmZis6ng4"
      }
    },
    {
      "id": "ee4f6407-9c4e-4239-bb4f-832dc2da8f87",
      "title": "Cult Books read by former Cult Kids! UnPack-It! #Shorts Apostate Sisters and MisterDiffiCULT!",
      "description": "Friday night, May 17th, 9pm Central! Cult Kids Read Cult Literature! Join Nancy, Patti, and Joel as they read \u0022The Missing Dimension in Sex\u0022 by Herbert W Armstrong.\n\nStep into a provocative and enlightening discussion in the third episode of \u0022UnPack-It,\u0022 where things get a little spicier than usual! Join the Apostate Sisters, Nancy and Patti, as they sit down with Joel, whose Christian beliefs stray far from the mainstream path. This episode promises a blend of fiery debate, unexpected revelations, and a dash of humor as we explore the fringes of faith and belief.\n\nDon’t miss this intense yet insightful episode of \u0022UnPack-It,\u0022 where we push the boundaries of conventional religious discourse. Remember to like, subscribe, and engage in the comments as we delve into these deep discussions. Your thoughts and reactions are what make our journey through these topics so enriching.\n\n#UnPackIt #ApostateSisters #NonMainstreamFaith #ReligiousDebate #ExploringBeliefs",
      "release": "2024-05-16T05:24:04Z",
      "duration": "00:01:01",
      "explicit": false,
      "youTubeId": "RnkLFa9RABU",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RnkLFa9RABU"
      }
    },
    {
      "id": "c7111b78-c6d3-45e1-aafd-373ce917c3d0",
      "title": "S1 E16: Cider \u0026 Spectacles - The Life and Influences of Herbert W. Armstrong, Part 5",
      "description": "In this fifth, but not final episode of our Herbert W. Armstrong series, what was intended to be a concluding exploration into the transformative 1990s within the Worldwide Church of God took an unexpected, deeply personal turn. Join us, the Apostate Sisters, as we explore the profound impact of Armstrongist church ideals on our family relationships. As we navigate through the history and the significant changes that swept through the church in the 1990s, we find ourselves reflecting on the personal toll these doctrines have taken. This episode becomes a candid space for acknowledging the harm inflicted by the church\u0027s teachings and the difficult process of deconstructing these experiences. Through heartfelt dialogue, we discuss the complexities of maintaining or severing family ties, the emotional repercussions of leaving the faith, and the journey towards healing and understanding. This isn\u0027t just a story about a church\u0027s evolution; it\u0027s about the real-life consequences on the families who lived through these changes. Tune in to gain insight into how we, and many like us, work through the pain and strive for recovery and reconciliation. Whether you\u0027re a former member of the Worldwide Church of God, someone fascinated by religious history, or simply interested in the power of personal transformation, this episode offers a raw and revealing look at the challenges and triumphs of leaving a high-control religious group. Don’t forget to like, subscribe, and share your thoughts in the comments below. Your engagement helps us continue these important conversations. #ApostateSisters #WCG #WorldwideChurchOfGod#HerbertWArmstrong #ApostateSisters #ReligiousDeconstruction #FamilyDynamics #ChurchHistory",
      "release": "2024-05-11T15:26:37Z",
      "duration": "01:08:44.8380000",
      "explicit": false,
      "spotifyId": "6EyYw0jwDQn4TKbxSZLUfe",
      "youTubeId": "sLbOTY323kc",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6EyYw0jwDQn4TKbxSZLUfe",
        "youtube": "https://www.youtube.com/watch?v=sLbOTY323kc"
      }
    },
    {
      "id": "3c194ad9-cff7-4594-863d-213fd8280352",
      "title": "S1 E16: Cider \u0026amp; Spectacles - The Life and Influences of Herbert W. Armstrong, Part 5",
      "description": "In this fifth, but not final episode of our Herbert W. Armstrong series, what was intended to be a concluding exploration into the transformative 1990s within the Worldwide Church of God took an unexpected, deeply personal turn. Join us, the Apostate Sisters, as we explore the profound impact of Armstrongist church ideals on our family relationships.\n\nAs we navigate through the history and the significant changes that swept through the church in the 1990s, we find ourselves reflecting on the personal toll these doctrines have taken. This episode becomes a candid space for acknowledging the harm inflicted by the church\u0027s teachings and the difficult process of deconstructing these experiences.\n\nThrough heartfelt dialogue, we discuss the complexities of maintaining or severing family ties, the emotional repercussions of leaving the faith, and the journey towards healing and understanding. This isn\u0027t just a story about a church\u0027s evolution; it\u0027s about the real-life consequences on the families who lived through these changes.\n\nTune in to gain insight into how we, and many like us, work through the pain and strive for recovery and reconciliation. Whether you\u0027re a former member of the Worldwide Church of God, someone fascinated by religious history, or simply interested in the power of personal transformation, this episode offers a raw and revealing look at the challenges and triumphs of leaving a high-control religious group.\n\nDon’t forget to like, subscribe, and share your thoughts in the comments below. Your engagement helps us continue these important conversations.\n\n#ApostateSisters #WCG #WorldwideChurchOfGod#HerbertWArmstrong #ApostateSisters #ReligiousDeconstruction #FamilyDynamics #ChurchHistory",
      "release": "2024-05-11T15:18:38Z",
      "duration": "01:08:45",
      "explicit": false,
      "youTubeId": "LWaaxBF_4Aw",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LWaaxBF_4Aw"
      }
    },
    {
      "id": "47a2e299-1fba-43da-b814-620af50255cc",
      "title": "UnPack-It!! The Missing Dimension In Sex Part 2 | Apostate Sisters \u0026amp; MisterDiffiCULT",
      "description": "Go deeper into the bizarre world of cult literature with Episode 2 of \u0022UnPack-It.\u0022 Join the Apostate Sisters, Patti and Nancy, alongside their audacious ally, MisterDiffiCULT, as they dissect the controversial teachings of Herbert W. Armstrong from the Worldwide Church of God. As survivors who grew up under Armstrong\u0027s influence, our trio offers a unique blend of sharp insight and unfiltered commentary on the doctrines that shaped their childhoods.\n\nThis episode puts the spotlight on \u0022The Missing Dimension in Sex,\u0022 a book infamous for its conservative yet explicitly detailed portrayal of what Armstrong called the \u0027New Morality.\u0027 Brace yourselves for a whirlwind of emotions as we explore the bombastic language, rampant doublespeak, glaring contradictions, and the overall disempowering rhetoric Armstrong pushed onto his followers.\n\nExpect to laugh, gasp, and perhaps even recoil as we revel in the freedom and audacity of our apostasy, breaking down the absurdities with wit and candor. Whether you\u0027re here to reflect on similar experiences, gain new insights, or just enjoy the outrageous unraveling, this episode promises both entertainment and enlightenment.\n\nDon\u0027t forget to like, subscribe, and hit the bell icon so you never miss a moment of our journey through the tangled web of cult indoctrination. We love hearing from you—drop your thoughts and reactions in the comments below!\n\n#UnPackIt #ApostateSisters #MisterDiffiCULT #CultLiterature #HerbertWArmstrong #NewMorality\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/PD9Jwih-hVw?si=zJF15AilZaXB24Jv\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#ApostateSisters \n#MisterDiffiCULT\n#UnPackIt\n#CultSurvivor\n#ExCult\n#ReligiousCritique\n#HerbertWArmstrong\n#TheMissingDimensionInSex",
      "release": "2024-05-04T02:00:06Z",
      "duration": "01:17:29",
      "explicit": false,
      "youTubeId": "zcQnvCwTU-I",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zcQnvCwTU-I"
      }
    },
    {
      "id": "c4396a57-96d1-4dba-92df-6dd3e3ccfd6d",
      "title": "UnPack-It Returns!! Deconstruct Cult Literature! Join the Live Chat at 9pm Central.",
      "description": "Tonight, tonight, it\u0027s tonight!! Episode 2 of the Missing Dimension in Sex is here!\n\nFriday night, May 3rd at 9pm Central! The second episode of UnPack-It premieres! Go click the notification bell: https://www.youtube.com/watch?v=zcQnvCwTU-I\nJoin us in the live chat when it starts!\nDeconstruct with us - we are reading \u0022The Missing Dimension in Sex\u0022 by Herbert W. Armstrong because that book and so many others he wrote, influenced the way our parents raised us, and determined what our religious abuse would look like. \n\n#UnPackIt #ApostateSisters #MisterDiffiCULT #CultLiterature #HerbertWArmstrong #NewMorality #WCG #WorldwideChurchOfGod\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/PD9Jwih-hVw?si=zJF15AilZaXB24Jv\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n\n#Deconstruction #WCG #WorldwideChurchOfGod #HerbertWArmstrong",
      "release": "2024-05-03T14:29:59Z",
      "duration": "00:00:54",
      "explicit": false,
      "youTubeId": "VUa7ggEhccI",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VUa7ggEhccI"
      }
    },
    {
      "id": "15e09cb4-4183-4a25-af2a-458c8c1320ec",
      "title": "Deconstruct and UnPack-It!! The Missing Dimension In Sex Part 2 | Apostate Sisters \u0026amp; MisterDiffiCULT",
      "description": "Tomorrow, Friday may 3rd at 9pm Central! The second episode of UnPack-It premieres! Go click the notification bell: https://www.youtube.com/watch?v=zcQnvCwTU-I\nJoin us in the live chat when it starts!\nDeconstruct with us - we are reading \u0022The Missing Dimension in Sex\u0022 by Herbert W. Armstrong because that book and so many others he wrote, influenced the way our parents raised us, and determined what our religious abuse would look like. \n\n#UnPackIt #ApostateSisters #MisterDiffiCULT #CultLiterature #HerbertWArmstrong #NewMorality #WCG #WorldwideChurchOfGod\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/PD9Jwih-hVw?si=zJF15AilZaXB24Jv\nMisterDiffiCULT on YouTube:  @misterdiffiCULT1  \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n\n#Deconstruction #WCG #WorldwideChurchOfGod #HerbertWArmstrong",
      "release": "2024-05-03T01:29:42Z",
      "duration": "00:00:39",
      "explicit": false,
      "youTubeId": "VjVj_AtfOoY",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VjVj_AtfOoY"
      }
    },
    {
      "id": "23160b6b-845d-419e-9697-4f02071420a7",
      "title": "Purity Culture vs. Personal Identity #Shorts #ApostateSisters",
      "description": "In this powerful clip from Episode 2 of \u0022UnPack-It\u0022, Patti shares a deeply personal tale from her high school years—being unfairly labeled a \u0027sl*t\u0027 over a single photo, despite strictly adhering to purity culture. This poignant story highlights the harsh realities and conflicting messages imposed by high-control religious environments. \n\nJoin the Apostate Sisters as they delve into the complexities of sexual identity versus religious expectations, exposing the painful and often damaging dichotomies that many face. This discussion isn\u0027t just about challenging past injustices; it\u0027s about reclaiming our stories and our selves from the narratives thrust upon us.\n\nWatch the full episode for a deeper exploration into how purity culture affects personal development and why breaking free from these constraints is crucial for true self-discovery. Don’t forget to like, subscribe, and share your thoughts in the comments below!\n\nLink to full video: https://www.youtube.com/watch?v=zcQnvCwTU-I\n\n#UnPackIt #PurityCulture #PersonalIdentity #ApostateSisters #ReligiousCritique",
      "release": "2024-05-01T14:03:08Z",
      "duration": "00:00:54",
      "explicit": false,
      "youTubeId": "t-oww6oji00",
      "subjects": [
        "Self-Help",
        "Purity Culture"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=t-oww6oji00"
      }
    },
    {
      "id": "13a3eaea-82d5-44e2-9207-5534362439ea",
      "title": "Spirits \u0026amp; Spectacles - The Life and Influences of Herbert W. Armstrong, Part 4",
      "description": "Join us for another #FieryBitches episode of \u0022Apostate Sisters\u0022 as we dive into the controversial depths of Herbert W. Armstrong\u0027s legacy in our fourth installment of the series. This time, Nancy and Patti explore the explosive revelations found in \u0022HWA\u0027s Tangled Web,\u0022 a book that exposes the lying, stealing, and deceit that ran rampant under Armstrong\u0027s leadership at the Worldwide Church of God.\n\nBut first, lighten up with us as we chuckle over a delightfully cheesy video from 1980 featuring the Ambassador College choir. Nancy\u0027s insightful commentary not only unpacks the absurdities of the era but also sets the stage for the darker themes we delve into.\n\nIn this episode, we uncover the complex web of manipulation and moral corruption that defined much of Armstrong\u0027s tenure, drawing on detailed accounts and personal anecdotes to paint a comprehensive picture of his impact. Whether you\u0027re a former member, a history buff, or just curious about the inner workings of cult dynamics, this episode offers a unique blend of humor, historical analysis, and critical reflection.\n\n\n🎧 Listen on Spotify and watch on YouTube to discover the hidden stories behind one of the most controversial religious leaders of the 20th century. Don\u0027t forget to subscribe, like, and comment to join the conversation and share your thoughts and experiences.\n\n\n#ApostateSisters #HerbertWArmstrong #CultsExposed #ReligiousHistory #TangledWeb #FieryBitches",
      "release": "2024-04-27T13:48:54Z",
      "duration": "01:12:03",
      "explicit": false,
      "youTubeId": "2jcfAh0X_fQ",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2jcfAh0X_fQ"
      }
    },
    {
      "id": "150f1622-3ed1-4b16-ab08-717553b5443f",
      "title": "S1 E15: Spirits \u0026amp; Spectacles - The Life and Influences of Herbert W. Armstrong, Part 4",
      "description": "Join us for another #FieryBitches episode of \u0022Apostate Sisters\u0022 as we dive into the controversial depths of Herbert W. Armstrong\u0027s legacy in our fourth installment of the series. This time, Nancy and Patti explore the explosive revelations found in \u0022HWA\u0027s Tangled Web,\u0022 a book that exposes the lying, stealing, and deceit that ran rampant under Armstrong\u0027s leadership at the Worldwide Church of God.\n\n\n\nBut first, lighten up with us as we chuckle over a delightfully cheesy video from 1980 featuring the Ambassador College choir. Nancy\u0027s insightful commentary not only unpacks the absurdities of the era but also sets the stage for the darker themes we delve into.\n\n\n\n\n\n\n\n\nIn this episode, we uncover the complex web of manipulation and moral corruption that defined much of Armstrong\u0027s tenure, drawing on detailed accounts and personal anecdotes to paint a comprehensive picture of his impact. Whether you\u0027re a former member, a history buff, or just curious about the inner workings of cult dynamics, this episode offers a unique blend of humor, historical analysis, and critical reflection.\n\n\n\n\n\n\n\n\n🎧 Listen on Spotify and watch on YouTube to discover the hidden stories behind one of the most controversial religious leaders of the 20th century. Don\u0027t forget to subscribe, like, and comment to join the conversation and share your thoughts and experiences.\n\n\n\n\n\n\n\n\n#ApostateSisters #HerbertWArmstrong #CultsExposed #ReligiousHistory #TangledWeb #FieryBitches",
      "release": "2024-04-27T13:22:06Z",
      "duration": "01:12:03",
      "explicit": false,
      "youTubeId": "0Ng1__iBYsI",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0Ng1__iBYsI"
      }
    },
    {
      "id": "f475cc4a-4187-4236-a750-18a4c3a3c955",
      "title": "The UnPack-It Premiere!! Cult Kids Read Cult Literature: The Missing Dimension In Sex, Part 1",
      "description": "In this inaugural episode of \u0022UnPack-It,\u0022 join two unabashedly foul-mouthed Apostate Sisters and their charismatic ally, MisterDiffiCULT, as they embark on a bold journey through the controversial literature of their former cult, the Worldwide Church of God. As survivors and former cult children, we, Patti, Nancy, and Joel bring unique insights and raw commentary on the writings of cult leader Herbert W. Armstrong. These texts played a crucial role in our parents\u0027 indoctrination and shaped our lives until we broke free.\n\nFor our premiere episode, we tackle \u0022The Missing Dimension in Sex,\u0022 a book notorious for its prudish yet paradoxically explicit discourse on what Herbert W. Armstrong deemed the \u0027New Morality.\u0027 Prepare for a rollercoaster of emotions as we dissect the bombastic language, doublespeak, contradictions, and disempowering messages peppered throughout this text. Not shying away from the nitty-gritty, this book dives into the mechanics of sex in a way that\u0027s as detailed as it is cringeworthy.\n\nGet ready to laugh, cringe, and maybe even get offended as we revel in our freedom, boldness, and the grand scale of our apostasy. Whether you\u0027re here to reminisce, learn, or simply enjoy the chaos, this episode is sure to entertain and enlighten.\n\nDon\u0027t forget to like, subscribe, and hit the bell icon to not miss out on our journey of deconstructing cult indoctrination through humor and critique. Share your thoughts and join the conversation in the comments below!\n\nLink to the book if you want to read along with us: https://www.hwalibrary.com/cgi-bin/get/hwa.cgi?action=getbook\u0026InfoID=1326140607\n\nThe latest episode from the Apostate Sisters: https://youtu.be/PD9Jwih-hVw?si=zJF15AilZaXB24Jv\nMisterDiffiCULT on YouTube: @misterdiffiCULT1 \nMisterDiffiCULT on TikTok: https://www.tiktok.com/@misterdifficult\n\nApostate Sisters Socials:\nFind all the things: https://linktr.ee/apostatesisters\nInstagram: https://www.instagram.com/apostatesisters/\nTikTok: https://www.tiktok.com/@apostatesisters\n\n#ApostateSisters \n#MisterDiffiCULT\n#UnPackIt\n#CultSurvivor\n#ExCult\n#ReligiousCritique\n#HerbertWArmstrong\n#TheMissingDimensionInSex",
      "release": "2024-04-20T02:00:06Z",
      "duration": "01:21:44",
      "explicit": false,
      "youTubeId": "6jQ3TxSaEyk",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6jQ3TxSaEyk"
      }
    },
    {
      "id": "ecdb6b5f-f270-45c4-b73a-8f00e3b3057b",
      "title": "UnPack-It with the Apostate Sisters \u0026amp; MisterDiffiCULT #WCG #HerbertWArtmstrong #WorldwideChurchOfGod",
      "description": "📌 https://youtu.be/6jQ3TxSaEyk?si=g6I_50cuELCc9vMf\nWatch the premiere on our YouTube channel on Friday, April 19, 2024, or anytime afterward, to get the complete context and enjoy more of our unfiltered commentary on the absurdities of cult literature. Don’t forget to like, comment, and subscribe for more content like this!\n\nIn this revealing clip from our \u0022UnPack-It\u0022 series, dive into Herbert W. Armstrong’s vision of the \u0022right society\u0022 through his distinctly Western-centric lens. The Apostate Sisters and MisterDiffiCULT dissect a passage where Armstrong champions his ideals, which reflect a narrow and biased viewpoint on societal structure.\n\nThis short video spotlights the critical discussion we have about the implications of such a biased perspective and how it shaped the teachings and practices within the Worldwide Church of God. Armstrong\u0027s views on building a society are not just dated but are steeped in a Western-centric ideology that we unpack with both seriousness and a touch of our signature irreverent humor.\n\n📌 Want to hear more of our thoughts on Armstrong\u0027s teachings and their impact on followers? Check out the full episode on our YouTube channel where we delve deeper into the problematic nature of these ideologies and explore their lasting effects. Make sure to like, subscribe, and comment to join the conversation and get notified about more content like this!\n https://youtu.be/6jQ3TxSaEyk?si=g6I_50cuELCc9vMf\n\nMisterDiffiCULT: @misterdiffiCULT1 https://www.tiktok.com/@misterdifficult\n\n#UnPackIt #ApostateSisters #MisterDiffiCULT #WesternCentrism #CultCritique #HerbertWArmstrong",
      "release": "2024-04-18T13:46:08Z",
      "duration": "00:01:00",
      "explicit": false,
      "youTubeId": "m5uPShV7DM8",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=m5uPShV7DM8"
      }
    },
    {
      "id": "6a0527f1-488f-4e8c-b511-695102987199",
      "title": "UnPack-It Premieres Friday night,  9pm Central",
      "description": "📌 https://youtu.be/6jQ3TxSaEyk?si=g6I_50cuELCc9vMf\nWatch the premiere on our YouTube channel on Friday, April 19, 2024, or anytime afterward, to get the complete context and enjoy more of our unfiltered commentary on the absurdities of cult literature. Don’t forget to like, comment, and subscribe for more content like this!\n\nIn this eye-opening clip from our latest \u0022UnPack-It\u0022 episode, we delve into Herbert W. Armstrong\u0027s controversial views on sexual repression, as detailed in his book \u0022The Missing Dimension in Sex.\u0022 While Armstrong argues that societal sexual repression has led to a form of \u0027sex craziness,\u0027 we, the Apostate Sisters along with MisterDiffiCULT, find ourselves in a complex position of both agreeing and challenging his perspectives.\n\nJoin us as we navigate this provocative discussion, dissecting Armstrong\u0027s assertions with our unique blend of humor, insight, and irreverence. This clip offers just a taste of the critical and sometimes hilarious dialogue we engage in as we unpack the bizarre and often contradictory teachings from our former cult.\n\n\n\n#UnPackIt #ApostateSisters #MisterDiffiCULT #SexualRepression #CultLiterature #HerbertWArmstrong",
      "release": "2024-04-18T13:35:38Z",
      "duration": "00:00:50",
      "explicit": false,
      "youTubeId": "gxybyfhJpig",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gxybyfhJpig"
      }
    },
    {
      "id": "c61ce403-59d3-42a9-ab65-69c1b4887f46",
      "title": "Cult Kids Read Cult Literature! #shorts #UnPackIt #ApostateSisters #wcg",
      "description": "Nancy and Patti of the Apostate Sisters have teamed up with Joel of MisterDiffiCULT for this inappropriate and unruly gem of a show where we read the cult literature of the cult we were forced into believing in as children. The cult distorted our view of reality and made us grow up in fear. So here we are calling out the bullsh!t of the Worldwide Church of God and its offshoots by reading the very words they wrote. Don\u0027t expect us to be good church kids. We are not. \nApostate Sisters Channel: www.youtube.com/@ApostateSisters\nMisterDiffiCULT\u0027s Channel: www.youtube.com/@misterdiffiCULT1\nMisterDiffiCuLT\u0027s TikTok: https://www.tiktok.com/@misterdifficult\n#ReligioiusHarm #ReligioiusTrauma #Religion #Christianity #TrueChurch \nMusic Credit: White Bat Audio",
      "release": "2024-04-15T14:30:06Z",
      "duration": "00:00:30",
      "explicit": false,
      "youTubeId": "WbED9J0aMkA",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WbED9J0aMkA"
      }
    },
    {
      "id": "dde660a2-b2be-4e2c-be2e-ea73be93bcb6",
      "title": "Cult Children Generational Curses #shorts #worldwidechurchofgod #apostatesisters",
      "description": "The destructive swindle of Herbert W. Armstrong had lasting impacts not only on the people he got to give him 30 percent of their gross income, but on their children, whose start in their life as adults was thwarted because the World Tomorrow Armstrong had promised never came, and the world as we know it DID NOT end, leaving the children to pick up the pieces and start from scratch. F*ck all the way off, Herbie! \n\n#Christianity #eEvangelical #Exvangelical #Apostate #Apostatesisters  #Jesus #Christ #ChristJesus #Savior #Trinity #Rapture #TraumaRecovery #SurvivorStories",
      "release": "2024-04-15T00:09:27Z",
      "duration": "00:01:00",
      "explicit": false,
      "youTubeId": "-MxWKLNEqO8",
      "subjects": [
        "Worldwide Church Of God",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-MxWKLNEqO8"
      }
    },
    {
      "id": "13d1df0f-32dc-4704-948c-d7ca32f6017a",
      "title": "How Herbert W. Armstrong Swindled His Minions #shorts #wcg #worldwidechurchofgod",
      "description": "Nancy and Patti are at it again. They call out the sneaky tactics that Herbert W. Armstrong used to swindle so much money from his followers. #Armstrongism #ApostateSisters #Sabbath #HerbertArmstrong #herbertwarmstrong #cult #cultsurvivor #wcg #wwcg #worldwidechurchofgod #worldwidechurchofgodcult #britishisraelism #lost10tribes #fundamentalism #apostate #jesuschrist #christ #truechristian #christianity #christjesus #savior",
      "release": "2024-04-14T23:50:35Z",
      "duration": "00:00:38",
      "explicit": false,
      "youTubeId": "Lxba_Thcolw",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Lxba_Thcolw"
      }
    },
    {
      "id": "4e543d22-bd60-4439-9235-ad9ce194eb5a",
      "title": "S1 E14: Wine \u0026 Spectacles - The Life and Influences of Herbert W. Armstrong, Part 3",
      "description": "In this compelling third installment of our exploration into Herbert W. Armstrong and the Worldwide Church of God, Nancy and Patti jump into the tumultuous 1970s, a decade marked by internal power struggles and profound shifts within the church. This episode not only uncovers the behind-the-scenes battles between Armstrong, his son Garner Ted, and his treasurer Stanley Rader, but also reflects on the broader implications these conflicts had on the church and its followers. Join us as we also give a sneak peek into our exciting new series, \u0022UnPack-It,\u0022 where we take a critical and humorous look at the literature from our former cult. Expect to hear our thoughts on some of these outrageous texts and what they really represent. We\u0027ll share other great content creator by former cult members, as well as shout out some of our favorite content creators who inspire us to continue uncovering truths and promoting a message of care and compassion—emulating the promise of \u0022The World Tomorrow,\u0022 but on our own terms, free from the shadow of fear. Tune in to discover the real stories behind the public façade of the Worldwide Church of God in the 1970s and how these historical insights inform our journey towards healing and understanding today. Don’t forget to like, subscribe, and join us as we share stories of our upbringing and our healing journey into freedom from doctrine, and seek to create spaces for others to integrate the experiences of their childhoods.",
      "release": "2024-04-13T13:23:16Z",
      "duration": "01:15:01.4980000",
      "explicit": false,
      "spotifyId": "6NxcVHjGHA4aW8VFKM2PWj",
      "youTubeId": "nPpg7RC2rAw",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6NxcVHjGHA4aW8VFKM2PWj",
        "youtube": "https://www.youtube.com/watch?v=nPpg7RC2rAw"
      }
    },
    {
      "id": "78270016-f03d-4d3b-860e-008a0db86cf8",
      "title": "Wine \u0026amp; Spectacles - The Life and Influences of Herbert W. Armstrong, Part 3",
      "description": "In this compelling third installment of our exploration into Herbert W. Armstrong and the Worldwide Church of God, Nancy and Patti jump into the tumultuous 1970s, a decade marked by internal power struggles and profound shifts within the church. This episode not only uncovers the behind-the-scenes battles between Armstrong, his son Garner Ted, and his treasurer Stanley Rader, but also reflects on the broader implications these conflicts had on the church and its followers.\nJoin us as we also give a sneak peek into our exciting new series, \u0022UnPack-It,\u0022 where we take a critical and humorous look at the literature from our former cult. Expect to hear our thoughts on some of these outrageous texts and what they really represent.\nWe\u0027ll share other great content creator by former cult members, as well as shout out some of our favorite content creators who inspire us to continue uncovering truths and promoting a message of care and compassion—emulating the promise of \u0022The World Tomorrow,\u0022 but on our own terms, free from the shadow of fear.\nTune in to discover the real stories behind the public façade of the Worldwide Church of God in the 1970s and how these historical insights inform our journey towards healing and understanding today. Don’t forget to like, subscribe, and join us as we share stories of our upbringing and our healing journey into freedom from doctrine, and seek to create spaces for others to integrate the experiences of their childhoods.\n\nCreators and Content mentioned in this episode:\nDarante\u0027 LaMar - friend of the channel and fellow atheist creator - https://ww.youtube.com/@DaranteLaMar\nMisterDiffiCULT - collaborator on our upcoming series, UnPack-It can be found on TikTok and on YouTube. https://www.youtube.com/@UCtvhqDj-DgCEo227mqmIjqQ \nExRestoredCOG - reposting David C. Pack content from the Restored Church of God. https://www.youtube.com/@UCFqSwS9YUN_AMoA5KSKDCwA \nApril 15, 1979 - 60 Minutes Interview Stanley Rader - https://www.youtube.com/watch?v=4NVxKKKCiAc\nBook: Armstrongism: Religion or Rip Off by Marion J. McNair https://exitsupportnetwork.com/wp-content/uploads/2019/12/Armstrongism-Religion-or-Rip-off.McNair.pdf\nBook: The Broadway to Armageddon, by William B. Hinson https://www.amazon.com/Broadway-Armageddon-William-B-Hinson/dp/B0006WRFEG\nBook: Herber Armstrong\u0027s Tangled Web - An Insider\u0027s View https://www.amazon.com/Herbert-Armstrongs-tangled-web-Worldwide/dp/B0006XI300",
      "release": "2024-04-13T13:00:27Z",
      "duration": "01:15:02",
      "explicit": false,
      "youTubeId": "PD9Jwih-hVw",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PD9Jwih-hVw"
      }
    },
    {
      "id": "2681f381-439e-4eeb-acc8-96d94aa52fa5",
      "title": "S1 E13: Screwdrivers \u0026 Spectacles - The Life and Influences of Herbert W. Armstrong, Part 2",
      "description": "In this poignant episode of \u0022Apostate Sisters,\u0022 we sift through the public face of a man whose legacy continues to resonate through time, impacting countless lives with his teachings. Armstrong, a charismatic leader whose adept use of burgeoning media transformed his apocalyptic visions into a global message, didn\u0027t just shape doctrines; he shaped destinies. We explore the human aspect behind the spectacle, shedding light on the personal stories of those who grew up under the shadow of Armstrong\u0027s prophecy, particularly the year 1975, which was predicted to bring the end but instead left a legacy of confusion and disillusionment. This episode doesn\u0027t just recount historical facts; it aims to give voice to the silent echoes of childhoods spent in preparation for an apocalypse that never came. We focus on the real human cost of Armstrong\u0027s teachings, the individuals still grappling with the remnants of fear instilled from a young age, and those finding themselves ensnared in the web of Armstrongist cults today. Join us as we unravel the complexities of Armstrong\u0027s influence, from the fervor of his media empire to the indelible marks left on the lives touched by his prophecy. This isn\u0027t just a bland retelling of the facts —it\u0027s a journey towards understanding, healing, and perhaps, integration for those still seeking to break free from the chains of their upbringing within the Worldwide Church of God and its offshoots. Links!! Part 1: https://youtu.be/7ceQP8mMwAw?si=KlxxYYOPY17FIVvC MisterDifficult: https://www.tiktok.com/@misterdifficult and https://www.youtube.com/@misterdiffiCULT1 Angela and Dan Clark: Life After Religion: Cult Recovery (JW and Worldwide Church of God): https://www.youtube.com/@LifeAfterReligion",
      "release": "2024-03-30T11:28:09Z",
      "duration": "01:07:00.6620000",
      "explicit": false,
      "spotifyId": "1B0bKSVSBKIXgdi2RbSWn9",
      "youTubeId": "0BYU1qcdeo8",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1B0bKSVSBKIXgdi2RbSWn9",
        "youtube": "https://www.youtube.com/watch?v=0BYU1qcdeo8"
      }
    },
    {
      "id": "9caf7f70-c41c-4111-bf96-41399b1c685d",
      "title": "Screwdrivers \u0026amp; Spectacles - The Life and Influences of Herbert W. Armstrong, Part 2",
      "description": "In this poignant episode of \u0022Apostate Sisters,\u0022 we sift through the public face of a man whose legacy continues to resonate through time, impacting countless lives with his teachings. Armstrong, a charismatic leader whose adept use of burgeoning media transformed his apocalyptic visions into a global message, didn\u0027t just shape doctrines; he shaped destinies. We explore the human aspect behind the spectacle, shedding light on the personal stories of those who grew up under the shadow of Armstrong\u0027s prophecy, particularly the year 1975, which was predicted to bring the end but instead left a legacy of confusion and disillusionment.\n\nThis episode doesn\u0027t just recount historical facts; it aims to give voice to the silent echoes of childhoods spent in preparation for an apocalypse that never came. We focus on the real human cost of Armstrong\u0027s teachings, the individuals still grappling with the remnants of fear instilled from a young age, and those finding themselves ensnared in the web of Armstrongist cults today. Join us as we unravel the complexities of Armstrong\u0027s influence, from the fervor of his media empire to the indelible marks left on the lives touched by his prophecy. This isn\u0027t just a bland retelling of the facts —it\u0027s a journey towards understanding, healing, and perhaps, integration for those still seeking to break free from the chains of their upbringing within the Worldwide Church of God and its offshoots.\n\nLinks!!\nPart 1: https://youtu.be/7ceQP8mMwAw?si=KlxxYYOPY17FIVvC\nMisterDifficult: https://www.tiktok.com/@misterdifficult and https://www.youtube.com/@misterdiffiCULT1\nAngela and Dan Clark: Life After Religion: Cult Recovery (JW and Worldwide Church of God): https://www.youtube.com/@LifeAfterReligion",
      "release": "2024-03-30T06:01:08Z",
      "duration": "01:07:01",
      "explicit": false,
      "youTubeId": "NJHQGOTe4HU",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NJHQGOTe4HU"
      }
    },
    {
      "id": "0e0e1a61-a54c-4b44-8a42-e7fc942fc5a7",
      "title": "Cult Survivors - Are you out there? #shorts #WorldwideChurchOfGod #NoMoreReligiousAbuse #Healing",
      "description": "This poignant montage of Herbert W. Armstrong and the Worldwide Church of God serves as a powerful reminder of the individuals still caught in the grip of cults, as well as those who have survived. Through this short, the Apostate Sisters make a heartfelt plea for awareness and support for both survivors and those yet to find their way out. It\u0027s a moving call to action for understanding, empathy, and the promotion of resources to aid in recovery and liberation. #CultSurvivors #HerbertWArmstrong #ApostateSisters #SupportTheTrapped #Deconstruction",
      "release": "2024-03-17T14:00:32Z",
      "duration": "00:00:56",
      "explicit": false,
      "youTubeId": "bUm3d7SgUiI",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bUm3d7SgUiI"
      }
    },
    {
      "id": "829e6cbc-2d85-40ef-95b9-e8901636cabc",
      "title": "Information Control: When the Bible is Claimed as Truth #shorts #WorldwideChurchofGod #CultSurvivor",
      "description": "Step inside the restricted world of the Worldwide Church of God, where Herbert W. Armstrong wielded control over what information his followers could access. This short reveals the strategies used to maintain a tight grip on believers, ensuring they remained loyal and uninformed. The Apostate Sisters shed light on the dangers of such information control and the journey to breaking free from the echo chamber. A compelling watch for those fascinated by cult dynamics and the fight for intellectual freedom. #CultControl #InformationCensorship #ApostateSisters #HerbertWArmstrong",
      "release": "2024-03-17T08:00:05Z",
      "duration": "00:00:44",
      "explicit": false,
      "youTubeId": "BmspzSRWPt0",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BmspzSRWPt0"
      }
    },
    {
      "id": "9a7d1649-399e-436f-9d86-284d415a6afa",
      "title": "Fear-Based Religious Propaganda - Unpacking our Childhood Trauma #shorts #WorldwideChurchofGod",
      "description": "We lived in a haunting world of fear-based religious propaganda that shaped our early years within the Worldwide Church of God. This short video exposes the terrifying narratives and imagery used to control and manipulate young minds. Join the Apostate Sisters as they reflect on the impact of these scare tactics and the importance of challenging such fear-inducing messages. A must-watch for anyone intrigued by the mechanisms of cult control and the resilience of those who overcome them. #CultPropaganda #FearTactics #ReligiousControl #ApostateSisters",
      "release": "2024-03-16T16:15:56Z",
      "duration": "00:00:59",
      "explicit": false,
      "youTubeId": "HFifGzzFJMQ",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HFifGzzFJMQ"
      }
    },
    {
      "id": "690d3ed8-46b2-4300-98d1-167de85a9556",
      "title": "S1 E12: Bourbon \u0026 Spectacles - The Life and Influences of Herbert W. Armstrong, Part 1",
      "description": "In this first episode of a new series, we begin the riveting history of Herbert W. Armstrong. Nancy and Patti study the enigmatic founder of the Worldwide Church of God, through Nancy\u0027s detailed spreadsheet that requires Patti to don her reading glasses. As Nancy sips on bourbon, the sisters explore the religious movements dating back to the 1600s, unraveling the threads that may have woven together to shape their own childhood experiences within the cult. We take you on a journey from Armstrong\u0027s early days in the Midwest, where he honed his skills in sales, and then to Oregon, where his \u0027pioneering\u0027 venture into a radio program put him into the public eye and would eventually launch the Worldwide Church of God. The episode sheds light on the historical and cultural influences that Armstrong encountered throughout his life, offering insights into how these elements fused together to form the doctrines and practices that impacted countless lives. Join us, the Apostate Sisters, for an hour of history, analysis, and personal reflection, as we dissect the life of a man whose legacy is as controversial as it is captivating. Whether you\u0027re a former member of the Worldwide Church of God, a history buff, or simply intrigued by the dizzying clusterf*ck of religious movements, this episode promises to deliver the Sisters\u0027 irreverent style. Don\u0027t miss out on this deep dive into the life of Herbert W. Armstrong. Subscribe, like, and share your thoughts in the comments below. We\u0027re eager to hear your perspectives and experiences as we continue to explore the shadows and spectacles of religious history together. #HerbertWArmstrong #WorldwideChurchofGod #ReligiousHistory #ApostateSisters #CultHistory",
      "release": "2024-03-16T11:45:00Z",
      "duration": "00:48:09.1420000",
      "explicit": false,
      "spotifyId": "6HVQoQ01ur6CYpCmv6XLkp",
      "youTubeId": "7ceQP8mMwAw",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6HVQoQ01ur6CYpCmv6XLkp",
        "youtube": "https://www.youtube.com/watch?v=7ceQP8mMwAw"
      }
    },
    {
      "id": "0f31ad02-e0a9-4dd3-bb50-52e56bf963de",
      "title": "S1 E12: Bourbon \u0026amp; Spectacles - The Life and Influences of Herbert W. Armstrong, Part 1",
      "description": "In this first episode of a new series, we begin the riveting history of Herbert W. Armstrong. Nancy and Patti study the enigmatic founder of the Worldwide Church of God, through Nancy\u0027s detailed spreadsheet that requires Patti to don her reading glasses. As Nancy sips on bourbon, the sisters explore the religious movements dating back to the 1600s, unraveling the threads that may have woven together to shape their own childhood experiences within the cult.\n\n\n\nWe take you on a journey from Armstrong\u0027s early days in the Midwest, where he honed his skills in sales, and then to Oregon, where his \u0027pioneering\u0027 venture into a radio program put him into the public eye and would eventually launch the Worldwide Church of God. The episode sheds light on the historical and cultural influences that Armstrong encountered throughout his life, offering insights into how these elements fused together to form the doctrines and practices that impacted countless lives.\n\n\n\nJoin us, the Apostate Sisters, for an hour of history, analysis, and personal reflection, as we dissect the life of a man whose legacy is as controversial as it is captivating. Whether you\u0027re a former member of the Worldwide Church of God, a history buff, or simply intrigued by the dizzying clusterf*ck of religious movements, this episode promises to deliver the Sisters\u0027 irreverent style.\n\n\n\nDon\u0027t miss out on this deep dive into the life of Herbert W. Armstrong. Subscribe, like, and share your thoughts in the comments below. We\u0027re eager to hear your perspectives and experiences as we continue to explore the shadows and spectacles of religious history together.\n\n\n\n\n\n\n\n\n#HerbertWArmstrong #WorldwideChurchofGod #ReligiousHistory #ApostateSisters #CultHistory",
      "release": "2024-03-16T11:40:56Z",
      "duration": "00:48:10",
      "explicit": false,
      "youTubeId": "IM8DZY-vzW8",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IM8DZY-vzW8"
      }
    },
    {
      "id": "0b089393-1b3f-48c0-801f-aff4b560ac86",
      "title": "Chasing Truth Beyond The Bible: Seeking Reality Led to Deconversion #shorts #Bible #Truth #Logic",
      "description": "Patti shares a deeply personal revelation: her committed search for truth, a value instilled in her from a young age, ultimately guided her away from the church and led to her deconversion. Growing up in a religious environment where the pursuit of truth was paramount, Patti embarked on a journey to understand the world more deeply, only to find discrepancies between what the Bible claimed and the realities of the world.\nThis is not just Patti\u0027s story; it\u0027s a conversation starter for anyone who has ever dared to question their faith, seek answers beyond religious texts, and find their own path in the pursuit of truth. #Deconversion #SeekingTruth #ReligiousQuestioning #ApostateSisters #FaithJourney #TheBibleIsCulturalFiction",
      "release": "2024-03-13T20:54:56Z",
      "duration": "00:00:45",
      "explicit": false,
      "youTubeId": "QdBIjgK4iiM",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QdBIjgK4iiM"
      }
    },
    {
      "id": "db26c1ce-53af-41af-8fd8-a6c84880e279",
      "title": "Patti was a Cringy Jesus Freak #ExChristian #CultSurvivor #shorts",
      "description": "Apostate Sister Nancy shares a hilarious yet poignant memory of Patti, once fervently wandering her college campus singing about Jesus, a past action we now find utterly cringeworthy. As we look back on our journey away from a rigid faith, we uncover the layers of embarrassment associated with the practices we once held dear, recognizing the ridiculousness and societal harm of our previous beliefs.\nThis candid clip is a light-hearted glimpse into the deeper conversations we have about the evolution of our beliefs, the things we once did in the name of faith, and how we\u0027ve come to see the error and harm in those actions. It\u0027s a relatable journey for anyone who\u0027s ever reflected on their past with a mix of disbelief and growth.\nJoin us as we laugh, cringe, and reflect on the paths we\u0027ve taken from devout believers to critical thinkers, shedding light on the often ridiculous and harmful aspects of our former faith. #ExCult #FaithJourney #ReligiousDeconstruction #CringeConfessions #ApostateSisters",
      "release": "2024-03-10T16:13:36Z",
      "duration": "00:00:42",
      "explicit": false,
      "youTubeId": "lyfVm7KiOPo",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lyfVm7KiOPo"
      }
    },
    {
      "id": "cd47416e-bc5a-4088-967d-db876f032dac",
      "title": "Obedience Destroys Confidence #shorts #CultSurvivor #worldwidechurchofgod",
      "description": "Apostate Sister Nancy explains how she had no sense of self, and no self-confidence because of our upbringing in the fear-based doomsday cult, the Worldwide Church of God. We reject and seek to end religious control over children, and we are part of a network of creators building a safety net for those seeking refuge from the cult, and healing from the trauma. #Armstrongism #ToxicReligion #HerbertWArmstrong #WCG #RCG #EndTime #Truth #Reality #Confidence #Deconversion #Deconstruction",
      "release": "2024-03-09T19:30:09Z",
      "duration": "00:00:30",
      "explicit": false,
      "youTubeId": "HP39vOmptIg",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HP39vOmptIg"
      }
    },
    {
      "id": "f94c1fe4-3b25-4796-a60f-765104a00dae",
      "title": "S1 E11: From Silence to Swearing: Taking Back Our Words from Religious Gatekeeping",
      "description": "In this explosive episode of Apostate Sisters, Patti and Nancy share hilarious and horrible stories of their upbringing in the doomsday cult known as the Worldwide Church of God, revealing the intense control exerted over their language and expression. Growing up under the shadow of Armstrongism, they were forbidden from uttering swear words, discussing their body parts openly, or even using mild exclamations that took the Lord\u0027s name in vain. Now, they\u0027re not holding back. Prepare to be shocked, enlightened, or find yourself nodding in agreement as they tackle the concept of \u0022gatekeeping language\u0022 as a method of control, and share their personal journey towards reclaiming their right to speak freely. This episode is a bold and irreverent critique of the language restrictions imposed by religious zealotry, and a celebration of the freedom found in breaking those chains. For anyone who\u0027s ever felt their voice was stifled by religious dogma or cultural censorship, this discussion is a liberating exploration of what it means to speak your truth. From \u0022f*ck\u0022 to \u0022fart\u0022 and everything in between, Patti and Nancy are reclaiming the words they were once punished for. Whether you\u0027re a survivor of the Worldwide Church of God or one of its offshoots, or someone who\u0027s navigated similar experiences of linguistic control, or simply fascinated by the intersection of language, culture, and religion, this episode is a must-listen. Let\u0027s break the taboos together and celebrate the power of words unchained. Join the conversation and share your own experiences with language control and liberation. Reach out to us on Instagram, and Like, Subscribe, and Comment on YouTube. Your voice matters, and it\u0027s time it was heard. Are you looking for a place to hang out where other survivors are sharing their stories and healing together? The Apostate Sisters now have a Discord server ready to meet those needs. Reach out via any of our socials to find out more.",
      "release": "2024-03-02T12:54:37Z",
      "duration": "00:51:54.5010000",
      "explicit": false,
      "spotifyId": "0hsm0de7RPjoCxBAlIdHOD",
      "youTubeId": "rVFFCjCpZkU",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hsm0de7RPjoCxBAlIdHOD",
        "youtube": "https://www.youtube.com/watch?v=rVFFCjCpZkU"
      }
    },
    {
      "id": "eb6817eb-7e80-49c4-8166-e4d574197c2a",
      "title": "From Silence to Swearing: Taking Back Our Words from Religious Gatekeeping",
      "description": "In this explosive episode of Apostate Sisters, Patti and Nancy share hilarious and horrible stories of their upbringing in the doomsday cult known as the Worldwide Church of God, revealing the intense control exerted over their language and expression. Growing up under the shadow of Armstrongism, they were forbidden from uttering swear words, discussing their body parts openly, or even using mild exclamations that took the Lord\u0027s name in vain. Now, they\u0027re not holding back.\nPrepare to be shocked, enlightened, or find yourself nodding in agreement as they tackle the concept of \u0022gatekeeping language\u0022 as a method of control, and share their personal journey towards reclaiming their right to speak freely. This episode is a bold and irreverent critique of the language restrictions imposed by religious zealotry, and a celebration of the freedom found in breaking those chains.\nFor anyone who\u0027s ever felt their voice was stifled by religious dogma or cultural censorship, this discussion is a liberating exploration of what it means to speak your truth. From \u0022f*ck\u0022 to \u0022fart\u0022 and everything in between, Patti and Nancy are reclaiming the words they were once punished for.\nWhether you\u0027re a survivor of the Worldwide Church of God or one of its offshoots, or someone who\u0027s navigated similar experiences of linguistic control, or simply fascinated by the intersection of language, culture, and religion, this episode is a must-listen. Let\u0027s break the taboos together and celebrate the power of words unchained.\nJoin the conversation and share your own experiences with language control and liberation. Reach out to us on Instagram, and Like, Subscribe, and Comment on YouTube. Your voice matters, and it\u0027s time it was heard. \nAre you looking for a place to hang out where other survivors are sharing their stories and healing together? The Apostate Sisters now have a Discord server ready to meet those needs. Reach out via any of our socials to find out more.\n\n#WCG #WorldwideChurchOfGod #Deconstruction #CultSurvivor #Truth #TrueChristian",
      "release": "2024-03-02T12:00:13Z",
      "duration": "00:51:55",
      "explicit": true,
      "youTubeId": "MG4JBNAfdj0",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MG4JBNAfdj0"
      }
    },
    {
      "id": "0abe74a8-53fc-45a4-b1a4-0d9f07c7a974",
      "title": "God, Batman, and Answered Prayers - Apostate Sisters #shorts",
      "description": "A childhood memory of praying for a favorite TV show evolves into questioning the very essence of divine intervention. This video explores the journey from accepting everything we\u0027re taught as children, through moments of innocent faith, to confronting the unsettling realities of unanswered prayers on a global scale. Why do some prayers seem answered while critical issues, like suffering and injustice, remain? Our story navigates the complexities of faith, the search for answers, and the path to finding peace in skepticism. Whether you\u0027re someone who has questioned your beliefs, someone in the midst of deconversion, or simply interested in the stories of others, this short narrative offers a reflective look at the challenges of reconciling faith with the realities of the world. #Deconversion #QuestioningFaith #Skepticism #Atheism #SpiritualJourney #FaithToDoubt\n#DeconversionStory #FaithQuestions #AtheistJourney #SpiritualDoubt\n#ReligiousSkepticism #PersonalJourney #ExChristian",
      "release": "2024-02-29T13:00:14Z",
      "duration": "00:01:00",
      "explicit": false,
      "youTubeId": "AEH7G5gB5eI",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AEH7G5gB5eI"
      }
    },
    {
      "id": "88f8c8a2-5a12-43bd-94e3-9073e496a9b6",
      "title": "Harmony Over Dogma: Prioritizing Our Planet and Each Other",
      "description": "In a world divided by beliefs, the idea of a deity often becomes a barrier to unity and progress. We have a pressing need to set aside our theological differences and work together towards tangible goals: a cleaner planet, sustainable resource management, and fostering a culture of respect and non-traumatization. From an atheist standpoint, we focus on how common, secular objectives might be our best chance at achieving global harmony and environmental sustainability. Let\u0027s explore practical steps towards a future where humanity thrives on mutual understanding and shared responsibility. #Atheism #EnvironmentalSustainability #GlobalUnity #SecularHumanism #PeacefulCoexistence",
      "release": "2024-02-28T22:18:35Z",
      "duration": "00:00:28",
      "explicit": false,
      "youTubeId": "CEICZwE6LHs",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CEICZwE6LHs"
      }
    },
    {
      "id": "e16fe648-7381-4802-90d1-05f15e7e5433",
      "title": "Beyond Doomsday - from Christian Apocalypse to Sustainable Action #shorts #apostatesisters",
      "description": "Let\u0027s get thinking about shifting from apocalyptic expectations to facing the real-world challenge of climate change. Together we can transform our approach to sustainability. Unfortunately, misconceptions deter some Christians from environmental activism, due to the belief in an imminent Second Coming, and those regressive views align with capitalism\u0027s push for overconsumption. #christianity #doomsday #climatecrisis #ApostateSisters",
      "release": "2024-02-28T18:19:55Z",
      "duration": "00:00:54",
      "explicit": false,
      "youTubeId": "JLHm_Z8sFXA",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JLHm_Z8sFXA"
      }
    },
    {
      "id": "f87c49f1-9dfd-4b0a-9a76-46ccf45a90e7",
      "title": "Strange after effects of Religion at all levels - Apostate Sisters #shorts #worldwidechurchofgod",
      "description": "We are the Apostate Sisters. We are sharing the profound and often overlooked aftermath of growing up in a cult. We share personal stories that reveal the lasting impact of their childhood indoctrination. Nancy opens up about her struggle with a seemingly simple act – closing her eyes in public – a residual fear stemming from forced prayers and the stringent, controlling environment of her youth. This sheds light on how the subtle yet insidious rules of a cult can linger in the minds and behaviors of those who have left. \n\nThe Apostate Sisters\u0027 candid conversation on their podcast is not just a journey through their past, but a beacon for anyone on the path of deconstructing the faith of their childhood. Whether you\u0027re unraveling the threads of your own beliefs or simply curious about the process of religious deconstruction, this episode offers insights, empathy, and a reminder that you\u0027re not alone in the quest for personal freedom and truth.\n\nIf you\u0027re navigating the complexities of questioning your faith, seeking to understand the impact of religious upbringing, or just in need of a compassionate voice that resonates with your experiences, the Apostate Sisters for you. Tune in, as we invite you into their world of discovery, healing, and liberation from the shadows of dogma.\n\nSubscribe to our channel for more episodes where we explore the journey of deconstruction, share stories of overcoming religious indoctrination, and offer support to those who are finding their way out of the shadows and into the light of their own truth.\n\n#Deconstruction #ExCult #ReligiousTrauma #ApostateSisters #SpiritualJourney #HealingFromReligion #Armstrongism #ApostateSisters #Sabbath #herbertwarmstrong #cult #cultsurvivor #wcg #wwcg #worldwidechurchofgod #worldwidechurchofgodcult #britishisraelism #lost10tribes #fundamentalism #apostate #jesuschrist #christ #truechristian #christianity #christjesus #savior #christianity #evangelical #exvangelical #apostate #apostatesisters #apologist #apologetics #jesus #christ #christjesus #savior #trinity #rapture #traumarecovery #survivorstories #churchdropout #deconstruction #deconstructing #exfundie #truthseeker #twistedscriptures #prosperitygospel #atheism #formerchurchkid #pastorskid #deconstructionmemes #churchabuse #religioustrauma #religioustraumasyndrome #religiousabuse #victimblaming #exfundamentalist #formerfundamentalist  #igotout #purityculture #churchculture #christianculture",
      "release": "2024-02-27T17:51:34Z",
      "duration": "00:00:58",
      "explicit": false,
      "youTubeId": "hXll7XvNcX4",
      "subjects": [
        "Worldwide Church Of God",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hXll7XvNcX4"
      }
    },
    {
      "id": "ee44dbe5-512f-4bdf-b44c-5bdb7816563e",
      "title": "Apostate Sisters - Deconstructing Childhood Cult After Effects",
      "description": "Join Patti and Nancy, the Apostate Sisters, as they begin to share the profound and often overlooked aftermath of growing up in a cult.They share personal stories that reveal the lasting impact of their childhood indoctrination. Nancy opens up about her struggle with a seemingly simple act – closing her eyes in public – a residual fear stemming from forced prayers and the stringent, controlling environment of their youth. This sheds light on how the subtle yet insidious rules of a cult can linger in the minds and behaviors of those who have left. \n\nThe Apostate Sisters\u0027 candid conversation on their podcast is not just a journey through their past, but a beacon for anyone on the path of deconstructing the faith of their childhood. Whether you\u0027re unraveling the threads of your own beliefs or simply curious about the process of religious deconstruction, this episode offers insights, empathy, and a reminder that you\u0027re not alone in the quest for personal freedom and truth.\n\nIf you\u0027re navigating the complexities of questioning your faith, seeking to understand the impact of religious upbringing, or just in need of a compassionate voice that resonates with your experiences, the Apostate Sisters for you. Tune in, as the Apostate Sisters invite you into their world of discovery, healing, and liberation from the shadows of dogma.\n\nSubscribe to our channel for more episodes where we explore the journey of deconstruction, share stories of overcoming religious indoctrination, and offer support to those who are finding their way out of the shadows and into the light of their own truth.\n\n#Deconstruction #ExCult #ReligiousTrauma #ApostateSisters #SpiritualJourney #HealingFromReligion #Armstrongism #ApostateSisters #Sabbath #herbertwarmstrong #cult #cultsurvivor #wcg #wwcg #worldwidechurchofgod #worldwidechurchofgodcult #britishisraelism #lost10tribes #fundamentalism #apostate #jesuschrist #christ #truechristian #christianity #christjesus #savior #christianity #evangelical #exvangelical #apostate #apostatesisters #apologist #apologetics #jesus #christ #christjesus #savior #trinity #rapture #traumarecovery #survivorstories #churchdropout #deconstruction #deconstructing #exfundie #truthseeker #twistedscriptures #prosperitygospel #atheism #formerchurchkid #pastorskid #deconstructionmemes #churchabuse #religioustrauma #religioustraumasyndrome #religiousabuse #victimblaming #exfundamentalist #formerfundamentalist  #igotout #purityculture #churchculture #christianculture",
      "release": "2024-02-26T20:00:08Z",
      "duration": "00:01:02",
      "explicit": false,
      "youTubeId": "50vIOf0Gks0",
      "subjects": [
        "Worldwide Church Of God",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=50vIOf0Gks0"
      }
    },
    {
      "id": "bceab36e-3c08-41c6-bf66-b7ba029e63ae",
      "title": "S1 E10: Reclaiming Bodily Autonomy: Unveiling Purity Culture\u0027s Impact",
      "description": "Join Nancy and Patti, the Apostate Sisters, in a powerful episode that delves deep into the realms of purity culture and religious restrictions on women\u0027s bodies within traditional Christian communities. This heartfelt yet accusatory dialogue sheds light on the oppressive rules about marriage, makeup, dress codes, sex, and body image that many women have had to navigate. We openly discuss the harmful teachings that dictate a woman\u0027s body is not her own and the lasting effects these beliefs can have on one\u0027s sense of autonomy and self-worth. In this episode, we share our personal journeys and sexual paths, offering insights into how we\u0027ve worked to reclaim our bodies and beliefs in the face of institutional abuse. Our discussion is not just a critique but a rallying cry for those looking to break free from the chains of purity culture and to embrace their bodily autonomy with conviction. Whether you\u0027ve experienced these challenges firsthand or are seeking to understand the pervasive impact of these teachings, \u0022Reclaiming Bodily Autonomy: Unveiling Purity Culture\u0027s Impact\u0022 is an essential listen for anyone looking to support bodily freedom and healing from religious constraints. Tune in to explore how we, and many others, are navigating the journey towards reclaiming what was once taken: the right to our own bodies and beliefs.",
      "release": "2024-02-17T16:22:40Z",
      "duration": "01:10:58.1420000",
      "explicit": false,
      "spotifyId": "2GmWI8GT7ZnfMYZTCW1N1u",
      "youTubeId": "RpXBt6bXqzE",
      "subjects": [
        "Worldwide Church Of God",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GmWI8GT7ZnfMYZTCW1N1u",
        "youtube": "https://www.youtube.com/watch?v=RpXBt6bXqzE"
      }
    },
    {
      "id": "1fe1b847-8c04-4144-9585-b91d2267db36",
      "title": "Apostate Sisters Break Down Cult Teachings #worldwidechurchofgod #cult",
      "description": "Overcoming regret and embracing joy!\nNancy reflects on a haunting quote that encapsulates the guilt and fear instilled by their upbringing. With a candid reaction that\u0027s as real as it gets, they tackle the damaging notion that we should live our lives looking back in regret rather than forward with pride. Join us for this powerful exploration of faith, freedom, and the journey to find joy and pride in one\u0027s personal history. Don\u0027t forget to like, share, and subscribe for more insightful content from the Apostate Sisters on navigating life after leaving a cult.",
      "release": "2024-02-08T23:20:16Z",
      "duration": "00:00:55",
      "explicit": false,
      "youTubeId": "dYyKf9BQUfw",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dYyKf9BQUfw"
      }
    },
    {
      "id": "6f44d810-cd42-4078-a728-aa6b9ee34cbd",
      "title": "Apostate Sisters Social Justice #potential #toxicnationalism #humanityisonefamily",
      "description": "Nancy and Patti share their experiences growing up in the Worldwide Church of God and talk about deconstructing from cult control. We see society as controlled in some of the same methods, causing harm to marginalized communities such as BIPOC and LGBTQ\u002B. What makes a better world for my kids? One that is better for everyone\u0027s kids. Humanity is one Family.\n\nWe hope you either get mad or nod your head in agreement, because we don\u0027t hold back, and sometimes we\u0027re not nice, for the sake of being kind. You\u0027ve been warned.\n\nListen to Apostate Sisters on YouTube and Spotify. #cult #worldwidechurchofgod #herbertwarmstrong #religion #atheist #deconstruction #truth #apostatesisters",
      "release": "2024-02-08T18:28:45Z",
      "duration": "00:00:35",
      "explicit": false,
      "youTubeId": "9dNx1Nzi6hs",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9dNx1Nzi6hs"
      }
    },
    {
      "id": "915283a9-4cbe-4617-b50b-e698d1673391",
      "title": "Apostate Sisters Sabbath Rules #worldwidechurchofgod #herbertwarmstrong #thinkforyourself",
      "description": "Nancy and Patti share their experiences growing up in the Worldwide Church of God and talk about deconstructing from cult control. Episode on Sabbath Day behavioral expectations.  It falls under the \u0022B\u0022 for behavior in the BITE model of cult/authoritarian control, an idea developed by Steven Hassan. \n\nWe\u0027re nerdy about history and culture, but critical of religion. We hope you either get mad or nod your head in agreement, because we don\u0027t hold back, and sometimes we\u0027re not nice. You\u0027ve been warned.\n\nhttps://youtu.be/lKUqE4jpobQ?si=3H9LnFkwEoaO1SOU\nhttps://open.spotify.com/episode/3x29EmK66loil0N9YkR6q8?si=68f3cdd6049a444a\n\nListen to Apostate Sisters on YouTube and Spotify. #cult #worldwidechurchofgod #herbertwarmstrong #religion #atheist #deconstruction #truth #apostatesisters #comedy",
      "release": "2024-02-07T13:37:38Z",
      "duration": "00:00:39",
      "explicit": false,
      "youTubeId": "H5NFi8NLh58",
      "subjects": [
        "Worldwide Church Of God",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=H5NFi8NLh58"
      }
    },
    {
      "id": "52acb4f0-5e71-42fd-9708-d48ff87580b6",
      "title": "Apostate Sisters Cult Food Restrictions #worldwidechurchofgod #cult #religioustrauma",
      "description": "Nancy and Patti share their experiences growing up in the Worldwide Church of God and talk about deconstructing from cult control. Episode on Food Restrictions.  It falls under the \u0022B\u0022 for behavior in the BITE model of cult/authoritarian control, an idea developed by Steven Hassan. \n\nWe\u0027re nerdy about history and culture, but critical of religion. We hope you either get mad or nod your head in agreement, because we don\u0027t hold back, and sometimes we\u0027re not nice. You\u0027ve been warned.\n\nhttps://open.spotify.com/episode/7vCfakFa7GVf9dpW7KRZV8?si=7b05126a05844b92\n\nListen to Apostate Sisters on YouTube and Spotify. #cult #worldwidechurchofgod #herbertwarmstrong #religion #atheist #deconstruction #truth #apostatesisters",
      "release": "2024-02-06T18:47:13Z",
      "duration": "00:00:31",
      "explicit": false,
      "youTubeId": "tOIJ3pPVk9k",
      "subjects": [
        "Worldwide Church Of God",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tOIJ3pPVk9k"
      }
    },
    {
      "id": "0f73a965-0370-4b74-a264-724abb14fdc6",
      "title": "S1 E9: Birthday Blues: Unwrapping Our Cult\u0027s No-Celebration Rule",
      "description": "Join Patti and Nancy, the Apostate Sisters, as they delve into the controversial topic of birthday celebrations in their latest podcast episode. Raised in the Worldwide Church of God, a doomsday cult, they share their unique perspectives on why birthdays weren\u0027t celebrated and the psychological impacts this had on them. They blend a critical analysis of religious practices with personal anecdotes and historical insights into the origins of birthday celebrations. From Patti\u0027s longing to participate in school birthday traditions to Nancy\u0027s reflections on never receiving a wrapped gift, this episode is a blend of humor, history, and heartfelt discussion. Discover how their upbringing shaped their views on special occasions and how they navigate birthdays today. This episode is a must-listen for anyone interested in the intersection of religion, culture, and personal growth.",
      "release": "2024-02-03T13:01:15Z",
      "duration": "01:05:35.7910000",
      "explicit": false,
      "spotifyId": "2LKTyGr3ffxMcAGAWg9lBE",
      "youTubeId": "JHPcV3V0XX0",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2LKTyGr3ffxMcAGAWg9lBE",
        "youtube": "https://www.youtube.com/watch?v=JHPcV3V0XX0"
      }
    },
    {
      "id": "b8bb4494-c6a6-4861-b1cf-ebd3b4a37d80",
      "title": "S1 E8: Bible Revelations Exposed: Apostate Sisters Tackle FFRF\u0027s Bible Quiz Challenge, Part 4",
      "description": "One more to really solidify our Bible knowledge! Welcome to Part 4 of our Bible Quiz extravaganza! Follow along with Freedom from Religion Foundation\u0027s Bible Quiz at ffrf.org/biblequiz and test your knowledge if you like! As a reminder, we are NOT proper or prudish. In fact, we might be a bit too blunt for some. You\u0027ve been warned. Join us as we laugh, cry, and feel nauseated as we navigate the dark world of the Holy Bible. Be enlightened, be entertained, and unpack religious conditioning! Join us next time as we discuss the Worldwide Church of God\u0027s prohibition on Birthday celebration and what that meant for us as kids, and how we relate to our selves and self-worth today. Find the quiz at: ffrf.org/biblequiz Find the Apostate Sisters on Instagram for quotes, clips, and questions: https://www.instagram.com/apostatesisters/ Podcast also found on YouTube: www.youtube.com/@ApostateSisters",
      "release": "2024-01-27T12:40:00Z",
      "duration": "00:56:14.2620000",
      "explicit": false,
      "spotifyId": "1OktUeFJRRlYx2fTE9NWQc",
      "youTubeId": "LkLVWTJuZio",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1OktUeFJRRlYx2fTE9NWQc",
        "youtube": "https://www.youtube.com/watch?v=LkLVWTJuZio"
      }
    },
    {
      "id": "a1893ab2-92ee-44ca-bdae-64ac623f43fe",
      "title": "S1 E7: Bible Revelations Exposed: Apostate Sisters Tackle FFRF\u0027s Bible Quiz Challenge, Part 3",
      "description": "Oh yay, you came back! Welcome to Part 3 of our Bible Quiz extravaganza! Follow along with Freedom from Religion Foundation\u0027s Bible Quiz at ffrf.org/biblequiz and test your knowledge if you like! As a reminder, we are NOT proper or prudish. In fact, we might be a bit too blunt for some. You\u0027ve been warned. You\u0027ll be subjected to some singing. We promise not to do it again....Join us as we laugh, cry, and feel nauseated as we navigate the dark world of the Holy Bible. Be enlightened, be entertained, and unpack religious conditioning!",
      "release": "2024-01-20T18:50:21Z",
      "duration": "00:47:59.7380000",
      "explicit": false,
      "spotifyId": "30aEBsDjtWAkQMVCh1SdPg",
      "youTubeId": "yuCmlURd72w",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/30aEBsDjtWAkQMVCh1SdPg",
        "youtube": "https://www.youtube.com/watch?v=yuCmlURd72w"
      }
    },
    {
      "id": "c08f195e-97a7-42b2-bd86-8b78a0c73751",
      "title": "S1 E6: Bible Revelations Exposed: Apostate Sisters Tackle FFRF\u0027s Quiz Challenge - Part 2",
      "description": "Welcome back to Part 2 of our Bible Quiz extravaganza! We\u0027re discussing the next section of the Freedom From Religion Foundation\u0027s Bible Quiz - test your knowledge with us if you like! We aren\u0027t terribly proper or prudish in this episode. In fact, we might be a bit too blunt for some. You\u0027ve been warned. As we read, answer, and get a little aghast about the quiz questions, you\u0027ll find yourself both amused and astounded by actual things found the Bible. Perfect for both skeptics and believers alike (yes, really, believers should def listen to this), this episode promises a blend of enlightenment and entertainment. Follow along if you like at ffrf.org/biblequiz - you won\u0027t want to miss the thought-provoking insights in the whole series. Hit play now to join the \u0027Apostate Sisters\u0027 in our candid take on biblical stories and teachings.",
      "release": "2024-01-20T18:50:21Z",
      "duration": "00:44:42.0170000",
      "explicit": false,
      "spotifyId": "5MvQmmLtJ4PWk7ke4m6jEn",
      "youTubeId": "ZGGt3qGlLfg",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5MvQmmLtJ4PWk7ke4m6jEn",
        "youtube": "https://www.youtube.com/watch?v=ZGGt3qGlLfg"
      }
    },
    {
      "id": "6aa45d47-f095-41eb-9d9d-218e153f7539",
      "title": "S1 E5: Bible Revelations Exposed: Apostate Sisters Tackle FFRF\u0027s Quiz Challenge - Part 1",
      "description": "Get ready for some Biblical exploration with the \u0027Apostate Sisters\u0027 in our latest episode! Join us as we embark on a compelling four-part journey through the Freedom from Religion Foundation\u0027s eye-opening Bible Quiz. This first episode sets the stage for a series filled with unexpected revelations and engaging discussions. As we read, answer, and get a little aghast about the quiz questions, you\u0027ll find yourself both amused and astounded by actual things found the Bible. Perfect for both skeptics and believers alike (yes, really, believers should def listen to this), this episode promises a blend of enlightenment and entertainment. Start here - and follow along if you like at ffrf.org/biblequiz - you won\u0027t want to miss the thought-provoking insights in the whole series. Hit play now to join the \u0027Apostate Sisters\u0027 in our candid take on biblical stories and teachings.",
      "release": "2024-01-20T18:50:21Z",
      "duration": "00:43:48.8320000",
      "explicit": false,
      "spotifyId": "3tig5FBmajND5LzDzdFyOb",
      "youTubeId": "M3KMmeceOeU",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3tig5FBmajND5LzDzdFyOb",
        "youtube": "https://www.youtube.com/watch?v=M3KMmeceOeU"
      }
    },
    {
      "id": "d0440d5a-6aa5-45fa-813e-401a16a75a28",
      "title": "S1 E4: Unwrapping Pagan Roots: Apostate Sisters\u0027 Journey through Christmas in the Worldwide Church of God",
      "description": "Join the Apostate Sisters, Patti and Nancy, as they unwrap the layers of their childhood experiences in the doomsday cult, the Worldwide Church of God, and delve into the peculiar stance on Christmas. In this episode, the sisters explore the cult\u0027s rejection of the holiday, driven by the enigmatic figure, Herbert W. Armstrong. From the roots of paganism to Armstrong\u0027s controversial teachings, discover the emotional and psychological impact on the sisters and their unique perspective on the festive season. Get ready for a deep dive into history, religion, and personal reflections that challenge the commercialized narrative of Christmas. Whether you\u0027re nodding in agreement or shaking your head, this conversation will leave you questioning traditions and redefining the true meaning of the holiday season.",
      "release": "2024-01-20T18:50:21Z",
      "duration": "01:45:19.2550000",
      "explicit": false,
      "spotifyId": "5lBmSPC7GQkokBl7wfZ3E3",
      "youTubeId": "MIgFXL11EsA",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5lBmSPC7GQkokBl7wfZ3E3",
        "youtube": "https://www.youtube.com/watch?v=MIgFXL11EsA"
      }
    },
    {
      "id": "079a736b-569e-429d-94b1-88aa01d56c0d",
      "title": "S1 E3: Keeping the Sabbath in the Worldwide Church of God",
      "description": "The Worldwide Church of God kept Saturday as its Sabbath from its inception in the 1930s. When Nancy and Patti were forced to participate in keeping the Sabbath as children in the 1980s, they complied with the rules to save their own skin from a god who wanted nothing more than obedience.",
      "release": "2024-01-20T18:50:21Z",
      "duration": "01:14:15.6530000",
      "explicit": false,
      "spotifyId": "3x29EmK66loil0N9YkR6q8",
      "youTubeId": "lKUqE4jpobQ",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3x29EmK66loil0N9YkR6q8",
        "youtube": "https://www.youtube.com/watch?v=lKUqE4jpobQ"
      }
    },
    {
      "id": "8d77f796-27c5-4121-9528-e91a6d0a597c",
      "title": "S1 E2: Forbidden Foods: WWCG Religious Restrictions",
      "description": "Patti and Nancy discuss what it was like growing up under ancient food laws during the 1980’s. Pork, bacon, and shellfish figure prominently, and we seek to learn about other religious and cultural food restrictive traditions. We dive into the social and emotional impacts wrought upon us as children while trapped in an extremist ideology, recapping what we have healed and where we still struggle.",
      "release": "2024-01-20T18:50:21Z",
      "duration": "01:21:17.6760000",
      "explicit": false,
      "spotifyId": "7vCfakFa7GVf9dpW7KRZV8",
      "youTubeId": "ae1-0NGrrso",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vCfakFa7GVf9dpW7KRZV8",
        "youtube": "https://www.youtube.com/watch?v=ae1-0NGrrso"
      }
    },
    {
      "id": "6b05dd1d-cae9-43a1-9552-0f58e0d8e4a4",
      "title": "S1 E1 The Worldwide Church of God",
      "description": "It turns out having been raised in a cult is kinda shitty. Here, we have a first on-the-record chat about the toxic religious control we experienced as children and where it\u0027s landed all of us in life. Herbert W. Armstrong, Brother Stair, and David C. Pack are among the guilty, victimizing our parents so they could victimize us. We argue for the death of thought control and obedience and will maintain that people who believe true things make better decisions. Come give cults and religion the finger with us.",
      "release": "2024-01-20T18:50:21Z",
      "duration": "00:50:20.5670000",
      "explicit": false,
      "spotifyId": "2W1xECPjsKXyrlcfiUxTSe",
      "youTubeId": "fIaF7Y-rT3I",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2W1xECPjsKXyrlcfiUxTSe",
        "youtube": "https://www.youtube.com/watch?v=fIaF7Y-rT3I"
      }
    }
  ]
}