{
  "id": "7ec5e06d-726b-43fa-9f05-2845c79b508a",
  "name": "APT",
  "youTubeChannelId": "UCpLEtz3H0jSfEneSdf1YKnw",
  "episodes": [
    {
      "id": "abaac135-af67-478a-9755-ae84a554f5bd",
      "title": "\u0022I Didn’t Know She Was Here\u0022: Wexner Cornered Over Maria Farmer Allegations | APT",
      "description": "During a deposition, Les Wexner was questioned about Epstein survivor Maria Farmer, who is not present in court. Farmer alleges she was assaulted by Jeffrey Epstein near Wexner’s property in 1996. Wexner repeatedly claimed ignorance, saying, “I didn’t know shit about her” and insisting he had no knowledge of her being on or near his property. Court records reveal the stark contrast between the survivor’s allegations and Wexner’s blunt denials, raising new questions about his ties to Epstein and the management of his estate.\n#US #epstein #leswexner #apt \n\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join",
      "release": "2026-02-20T10:31:26Z",
      "duration": "00:04:58",
      "explicit": false,
      "youTubeId": "T6osAYsIYfc",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T6osAYsIYfc"
      }
    },
    {
      "id": "99ed29f8-1b0d-43ed-96f4-d0b542562cc4",
      "title": "Les Wexner Confronted Point-Blank About Birthday Letter to Jeffrey Epstein | APT",
      "description": "During a deposition, Les Wexner was confronted point-blank about a birthday letter he sent to Jeffrey Epstein. In the note, Wexner drew a crude sketch and signed “Your friend Leslie,” despite repeatedly claiming Epstein was not a friend. Wexner admitted he was “trying to be funny,” raising questions about the nature of his relationship with Epstein and his judgment at the time. Court records reveal the bizarre and contradictory details behind this letter, shining a new light on Wexner’s ties to Epstein.\n#US #leswexner #apt \n\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join",
      "release": "2026-02-20T10:08:06Z",
      "duration": "00:04:02",
      "explicit": false,
      "youTubeId": "T0dU7ydWpNs",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T0dU7ydWpNs"
      }
    },
    {
      "id": "8e583b82-c8fe-4df3-b051-276944467888",
      "title": "‘Friendly, Not Friends’: Les Wexner Denies Close Ties to Epstein | APT",
      "description": "U.S. billionaire Leslie Wexner has denied ever being friends with Jeffrey Epstein, describing him instead as “the world’s all-time con artist.” In a tense deposition to the House Oversight Committee, Wexner insisted he was friendly with Epstein in a professional sense but had no personal bond. He explained how Epstein conned him despite their long association, highlighting the financier’s connections to royalty, politicians, and other high-profile figures. Wexner’s testimony sheds light on the controversial relationship between one of America’s richest men and Epstein, while also addressing widespread misconceptions about their closeness.\n#US #leswexner #epsteincase #epstein #apt \n\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join",
      "release": "2026-02-20T08:50:29Z",
      "duration": "00:06:25",
      "explicit": false,
      "youTubeId": "jnjs2LSQyQc",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jnjs2LSQyQc"
      }
    },
    {
      "id": "2f98b11c-5a73-41fd-bd15-c568afacd3c4",
      "title": "“I Will F**king Kill You”: Wexner Lawyer Issues Stunning Threat During House Oversight Deposition",
      "description": "Four-and-a-half hours into his deposition before the House Oversight Committee, billionaire Les Wexner was cut off by his own attorney with a blunt warning: “I will f**king kill you if you answer another question with more than five words.”\n\nA tense moment that’s now raising serious questions about what unfolded during the marathon testimony.\n\n#LesWexner #HouseOversight #Deposition #USPolitics #LegalNews\n\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join",
      "release": "2026-02-20T06:33:20Z",
      "duration": "00:03:33",
      "explicit": false,
      "youTubeId": "DYmyB5XXbZI",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DYmyB5XXbZI"
      }
    },
    {
      "id": "e35fc42f-d523-4c08-9da2-a933ece5cccd",
      "title": "Newly Released Emails Tie Epstein to \u0027Devil’s Breath\u0027 Drug | APT",
      "description": "Newly released Epstein Files have revealed disturbing new emails suggesting Jeffrey Epstein inquired about “trumpet plants at nursery” — a reference experts say may point to Angel’s Trumpet, a highly toxic plant known to produce scopolamine.\n\nOften called “Devil’s Breath” or the “zombie drug,” scopolamine has been linked to memory loss, impaired decision-making, extreme suggestibility, and in severe cases, paralysis or death. Reports from TMZ, AOL, and others detail emails showing Epstein not only asking about the plants but also receiving articles explaining the drug’s effects.\n\nThe latest document dump adds another controversial layer to the ongoing scrutiny of Epstein’s activities. A victim statement included in the files allegedly describes symptoms consistent with scopolamine exposure.\n\nIn this video, we break down:\n• What Angel’s Trumpet is\n• What scopolamine does to the body\n• What the newly released emails say\n• Why this is raising new questions\n\nJeffrey Epstein died in 2019 while awaiting trial on federal sex-trafficking charges, but court-ordered document releases continue to generate headlines.\n\nThis video discusses allegations and reported document findings. No new criminal charges have been announced in connection to these claims.\n\n#EpsteinFiles #JeffreyEpstein #Scopolamine #AngelTrumpet #BreakingNews #EpsteinUpdate #DevilsBreath #TrueCrime #InvestigativeNews #DocumentDump #GhislaineMaxwell #PoliticalNews",
      "release": "2026-02-17T20:07:11Z",
      "duration": "00:03:14",
      "explicit": false,
      "youTubeId": "mTWC8V53csM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mTWC8V53csM"
      }
    },
    {
      "id": "466272e6-df9d-4f9c-89d1-f0ebd9dd1600",
      "title": "Hillary Clinton: Epstein Questions Are “Diversions Away from Trump” | APT",
      "description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join\n\nFormer U.S. Secretary of State Hillary Clinton says questions about her and her husband’s alleged connections to convicted sex offender Jeffrey Epstein are a “diversion away from Trump.”\n\nIn an interview with German TV program Maischberger, Clinton stated: “We have nothing to hide.”\n\nClinton also suggested that those raising the issue may be trying to shield President Donald Trump.\n\nWhile former President Bill Clinton appears in Epstein-related documents, no evidence has emerged implicating either Clinton in criminal wrongdoing.\n\nThe interview is scheduled to air on February 18.\n\n#HillaryClinton #EpsteinFiles #JeffreyEpstein #DonaldTrump #BillClinton #USPolitics #BreakingNews #PoliticalNews #TrumpNews #WorldNews",
      "release": "2026-02-17T13:13:18Z",
      "duration": "00:03:09",
      "explicit": false,
      "youTubeId": "Ufm-1eCmY80",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ufm-1eCmY80"
      }
    },
    {
      "id": "8c12d823-e00c-47cb-9460-1254547c242f",
      "title": "WATCH | 2009 FBI Undercover Video Exposes Epstein Butler Attempting to Sell Victims\u0027 Records | APT",
      "description": "Shocking 2009 FBI undercover footage reveals Jeffrey Epstein’s butler trying to sell a so-called “address book of victims.” The video exposes the inner workings of Epstein’s operation, including hidden cameras, sensitive records, and visits from high-profile guests. This rare footage offers a disturbing glimpse into the dark network surrounding Epstein and the alleged exploitation of minors.\n#FBI #epsteinfiles #epstein #apt \n\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join",
      "release": "2026-02-13T07:33:47Z",
      "duration": "00:13:36",
      "explicit": false,
      "youTubeId": "HKVWGUoKBUE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HKVWGUoKBUE"
      }
    },
    {
      "id": "6a5a52c1-ccad-41a0-a43e-58cb470b3049",
      "title": "Ted Lieu Says Woman in Photo With Andrew Was Epstein\u0027s Trafficking Victim, Pam Bondi Confirms | APT",
      "description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join\n\nA U.S. congressional hearing on the Jeffrey Epstein files turned intense as lawmakers presented photos of Prince Andrew and questioned Attorney General Pam Bondi over the handling of sensitive evidence.\n\nDuring the House Judiciary Committee session, a Democratic lawmaker said the woman in a photo with the former royal was an Epstein trafficking victim, whose identity was redacted under federal protections. The hearing focused on transparency, victim privacy and the release of Epstein-related documents.\n\n\n#PrinceAndrew #JeffreyEpstein #EpsteinFiles #USCongress #HouseHearing #BreakingNews #WorldNews #USPolitics #EpsteinCase #RoyalFamilyNews #CongressionalHearing #PamBondi #TedLieu #PoliticalNews #LegalNews #JusticeDepartment #GlobalNews #HighProfileCase #InvestigationNews #NewsUpdate #LiveHearing #EpsteinInvestigation #RoyalScandal #WashingtonDC #NewsExplainer #InternationalNews #USNews #CourtNews #PoliticalUpdate #BreakingStory\n\nprince andrew epstein hearing, epstein files hearing, us congress epstein case, prince andrew photo epstein victim, house judiciary committee hearing, pam bondi epstein files, ted lieu hearing epstein, epstein investigation update, royal family epstein news, breaking political news usa, world news epstein case, high profile court cases, us politics news today, congressional hearing highlights, justice department hearing",
      "release": "2026-02-12T16:26:45Z",
      "duration": "00:05:10",
      "explicit": false,
      "youTubeId": "tWUQDDsQgA0",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tWUQDDsQgA0"
      }
    },
    {
      "id": "6b0100b5-9024-41f6-8d99-f44401ce649d",
      "title": "LIVE | “We’re Not Going Anywhere”: Epstein Survivors Return to Capitol as AG Pam Bondi’s Hearing Beg",
      "description": "Epstein survivors are back at the US Capitol alongside members of the Democratic Women’s Caucus ahead of Attorney General Pam Bondi’s testimony before the House Judiciary Committee.\nLawmakers and survivors delivered emotional remarks, calling for accountability and criticizing the Justice Department’s handling of the Epstein files. Speakers said survivors continue to face trauma while demanding transparency and answers from the administration.\nSeveral members of Congress pledged to press Bondi directly during the hearing, vowing to seek clarity on investigative decisions and the release of sensitive information.\nWatch live coverage and key moments from Capitol Hill.\n\nEpstein survivors, Pam Bondi, House Judiciary Committee, Democratic Women’s Caucus, Capitol Hill, Jeffrey Epstein, DOJ, US Congress, sexual abuse survivors, Washington DC, political news, breaking news, APT\n\n#Epstein #PamBondi #HouseJudiciary #CapitolHill #Survivors #USPolitics #BreakingNews #Live #APT",
      "release": "2026-02-11T14:52:05Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "dbUW6974fEo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dbUW6974fEo"
      }
    },
    {
      "id": "28bfbe9f-966f-4b84-8bfb-d7bda6b6515a",
      "title": "WATCH: Ghislaine Maxwell Deposition Before US Congress in Jeffrey Epstein Investigation | APT",
      "description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join\n\nGhislaine Maxwell, an associate of convicted sex trafficker Jeffrey Epstein, refused to answer questions from a U.S. House committee after being subpoenaed to testify. Appearing before the House Committee on Oversight and Government Reform, Maxwell invoked her Fifth Amendment right against self-incrimination as lawmakers questioned her in connection with the long-running Epstein investigation. The deposition forms part of Congress’s broader review of the case and related actions.\n\n#GhislaineMaxwell\n#JeffreyEpstein\n#EpsteinInvestigation",
      "release": "2026-02-10T06:15:02Z",
      "duration": "00:18:47",
      "explicit": false,
      "youTubeId": "DoRbOMQ7wGs",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DoRbOMQ7wGs"
      }
    },
    {
      "id": "398e0f4c-9653-4963-848a-168d700d084d",
      "title": "“She Will Never Tell the Truth”: Epstein Survivor Attorney Criticizes Maxwell’s Deposition | APT",
      "description": "Epstein survivor attorney Sigrid McCawley reacts to Ghislaine Maxwell’s congressional deposition, where she invoked her Fifth Amendment rights and declined to answer questions about her role in Jeffrey Epstein’s sex trafficking operation. McCawley criticizes Maxwell for lying repeatedly in past interviews and says she has “critical information” that could clarify the involvement of powerful individuals, including former presidents. The deposition raises questions about clemency requests and ongoing investigations, as additional depositions are scheduled for Hillary and Bill Clinton.\n\n\n#GhislaineMaxwell #JeffreyEpstein #SigridMcCawley #EpsteinSurvivors #MaxwellDeposition #USCongress #DonaldTrump #BillClinton #EpsteinInvestigation #FifthAmendment #USPolitics #LegalNews #APT",
      "release": "2026-02-09T19:07:36Z",
      "duration": "00:03:31",
      "explicit": false,
      "youTubeId": "twWLkh_AQMM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=twWLkh_AQMM"
      }
    },
    {
      "id": "27c706ea-1c89-47b8-8c93-6626451e74b8",
      "title": "DOJ Releases Ghislaine Maxwell’s Jail Footage: Shocking Glimpse Into Her Daily Life | APT",
      "description": "Newly released DOJ footage offers a rare look at Ghislaine Maxwell’s daily routine inside a Brooklyn jail cell in 2020. Convicted of trafficking girls for Jeffrey Epstein, Maxwell is set to face questioning by the US Congress, though she is expected to invoke her right to remain silent. The CCTV video sheds light on her life behind bars and adds to the ongoing scrutiny of Epstein’s network.\n#US #ghislainemaxwell #epstein #epsteinfiles #apt \n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join",
      "release": "2026-02-09T10:36:45Z",
      "duration": "00:03:58",
      "explicit": false,
      "youTubeId": "S2KgxoWELsE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S2KgxoWELsE"
      }
    },
    {
      "id": "e187784b-de86-46de-9034-08215dbb16e4",
      "title": "Jeffrey Epstein Asked Point Blank: “How Long Have You Been Attracted to Underage Girls?” | APT",
      "description": "Newly released U.S. Department of Justice files have brought renewed attention to Jeffrey Epstein, featuring a nearly 90-minute video deposition recorded in February 2010. In the footage, Epstein is asked directly under oath about his alleged sexual attraction to underage girls during questioning linked to a 2008 civil lawsuit.\n\nThe deposition includes sharp exchanges between Epstein, the plaintiff’s attorney Brad Edwards, and Epstein’s legal counsel, who raises repeated objections throughout the session. The video is part of a broader document release connected to federal investigations into Epstein’s abuse allegations.\nThe revelations have sparked fresh debate over accountability, elite protection, and the handling of high-profile sex abuse cases in the United States.\n\n\n#JeffreyEpstein #EpsteinFiles #EpsteinDeposition #DOJ #USNews #BreakingNews #InternationalNews #APTNews #JusticeSystem #CourtFootage",
      "release": "2026-02-07T14:40:03Z",
      "duration": "00:04:50",
      "explicit": false,
      "youTubeId": "h5jOsM97bmA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h5jOsM97bmA"
      }
    },
    {
      "id": "231a92c8-f3c3-4f80-bae7-5826c18836f4",
      "title": "Melania Trump’s Secret Emails to Epstein Associate Ghislaine Maxwell Revealed | APT",
      "description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join\n\nNewly released documents from the Jeffrey Epstein case have revealed previously unseen emails between Melania Trump — then Melania Knauss — and Epstein’s close associate Ghislaine Maxwell.\n\nIn one October 2002 email, Melania writes to Maxwell with a friendly tone, mentioning Palm Beach, travel plans, and complimenting Maxwell. While the correspondence shows a personal connection, there are no allegations of wrongdoing against Melania or Donald Trump.\n\nThese emails are part of the final batch of over 3 million pages made public by the Department of Justice, which also feature high-profile figures like Bill Gates, Elon Musk, Prince Andrew, and more.\n\n🔹 What does this reveal about Epstein’s social circle?\n🔹 Could more correspondence with Melania surface?\n🔹 Why are these emails grabbing global attention now?\n\nWatch the video to explore Melania Trump’s connection to Epstein’s network and see why the 2002 email has made headlines two decades later.\n\n#MelaniaTrump #GhislaineMaxwell #JeffreyEpstein #EpsteinFiles #Trump #MelaniaEmails #EpsteinNetwork #BreakingNews #HighProfileScandal #EpsteinDocuments",
      "release": "2026-02-06T19:04:19Z",
      "duration": "00:03:42",
      "explicit": false,
      "youTubeId": "7bie5IZ5yUo",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7bie5IZ5yUo"
      }
    },
    {
      "id": "4d3ebd3b-7f00-4e58-8c74-ada9975d751d",
      "title": "Ghislaine Maxwell Asked Point-Blank If She Recruited Masseuses From Donald Trump’s Mar-a-Lago | APT",
      "description": "In a revealing moment from newly surfaced interview transcripts, Ghislaine Maxwell is asked point-blank whether she ever recruited masseuses from Donald Trump’s Mar-a-Lago resort to give private massages to Jeffrey Epstein.\n\nMaxwell insists she “absolutely never” recruited spa workers from Mar-a-Lago and says she never witnessed Trump in any inappropriate situation. She also describes seeing Trump and Epstein only in social settings and denies any knowledge of misconduct involving Trump.\n\nThe exchange adds another layer to the ongoing scrutiny surrounding Epstein’s network, the so-called “black book,” and the powerful figures connected to the case.\n\nWatch as investigators press Maxwell directly on one of the most controversial questions tied to Epstein’s world.\n\n#epstein #trump #apt",
      "release": "2026-02-06T13:09:13Z",
      "duration": "00:05:14",
      "explicit": false,
      "youTubeId": "kIzfHg4hfCI",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kIzfHg4hfCI"
      }
    },
    {
      "id": "f27b1bf5-e0ef-41aa-9362-3dbb244c4148",
      "title": "\u0022What Is So Bad In The Epstein Files?”: Rep. Melanie Stansbury Raises Alarming Question | APT",
      "description": "Rep. Melanie Stansbury blasts congressional inaction over the Jeffrey Epstein files, accusing Republicans and DOJ officials of hiding the truth and failing survivors. She calls out political theater, media spectacle, and a shocking lack of accountability, demanding justice for victims and full transparency. Stansbury ties the controversy to wider questions about Donald Trump’s actions, including international distractions, while emphasizing that Americans want answers, not partisan posturing.\n#US #trump #epsteinfiles #apt \n\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join",
      "release": "2026-01-22T10:01:07Z",
      "duration": "00:04:55",
      "explicit": false,
      "youTubeId": "FDlygtmSdqo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FDlygtmSdqo"
      }
    },
    {
      "id": "e7c330d3-da14-4ed2-818e-bd18f8fd5899",
      "title": "“Oversight on Epstein Ends With a Showerhead Bill” — Rep. Melanie Stansbury | APT",
      "description": "House Oversight Committee member Rep. Melanie Stansbury blasted Republican leadership after a full day of hearings that included new subpoenas in the Jeffrey Epstein investigation and a classified briefing on Venezuela, only to end with a bill focused on showerhead regulations. Stansbury criticized the priorities of House Republicans, saying, “After a full day in Oversight…House Republicans have brought us… a bill about showerheads. That’s right — showerheads.” Her remarks underscore Democratic frustration with legislative focus amid ongoing investigations and policy debates. \n\n#MelanieStansbury #HouseOversight #EpsteinInvestigation #USPolitics #ShowerheadBill #Venezuela #Washington #APT #PoliticalNews",
      "release": "2026-01-08T12:36:42Z",
      "duration": "00:04:05",
      "explicit": false,
      "youTubeId": "BcnlYHFSbF0",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Political Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BcnlYHFSbF0"
      }
    }
  ]
}