{
  "id": "7ec5e06d-726b-43fa-9f05-2845c79b508a",
  "name": "APT",
  "youTubeChannelId": "UCpLEtz3H0jSfEneSdf1YKnw",
  "episodes": [
    {
      "id": "f27b1bf5-e0ef-41aa-9362-3dbb244c4148",
      "title": "\u0022What Is So Bad In The Epstein Files?”: Rep. Melanie Stansbury Raises Alarming Question | APT",
      "description": "Rep. Melanie Stansbury blasts congressional inaction over the Jeffrey Epstein files, accusing Republicans and DOJ officials of hiding the truth and failing survivors. She calls out political theater, media spectacle, and a shocking lack of accountability, demanding justice for victims and full transparency. Stansbury ties the controversy to wider questions about Donald Trump’s actions, including international distractions, while emphasizing that Americans want answers, not partisan posturing.\n#US #trump #epsteinfiles #apt \n\n\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCpLEtz3H0jSfEneSdf1YKnw/join",
      "release": "2026-01-22T10:01:07Z",
      "duration": "00:04:55",
      "explicit": false,
      "youTubeId": "FDlygtmSdqo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FDlygtmSdqo"
      }
    },
    {
      "id": "e7c330d3-da14-4ed2-818e-bd18f8fd5899",
      "title": "“Oversight on Epstein Ends With a Showerhead Bill” — Rep. Melanie Stansbury | APT",
      "description": "House Oversight Committee member Rep. Melanie Stansbury blasted Republican leadership after a full day of hearings that included new subpoenas in the Jeffrey Epstein investigation and a classified briefing on Venezuela, only to end with a bill focused on showerhead regulations. Stansbury criticized the priorities of House Republicans, saying, “After a full day in Oversight…House Republicans have brought us… a bill about showerheads. That’s right — showerheads.” Her remarks underscore Democratic frustration with legislative focus amid ongoing investigations and policy debates. \n\n#MelanieStansbury #HouseOversight #EpsteinInvestigation #USPolitics #ShowerheadBill #Venezuela #Washington #APT #PoliticalNews",
      "release": "2026-01-08T12:36:42Z",
      "duration": "00:04:05",
      "explicit": false,
      "youTubeId": "BcnlYHFSbF0",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Political Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BcnlYHFSbF0"
      }
    }
  ]
}