{
  "_ts": 0,
  "id": "856b28ec-8c73-4c84-b78e-40018631e49e",
  "name": "Arash\u0027s World Podcast",
  "spotifyId": "3pirM74A7iQE4fHqgA4Ge4",
  "appleId": 1577839289,
  "episodes": [
    {
      "id": "37228048-333d-45b8-b232-befaedcf456f",
      "title": "You Just Had To Be There: Radhia Gleis on Cults and Cult Leaders, the ”Holy Hell” Documentary and the Netflix Series",
      "description": "In this episode, I have (once again and again) the great pleasure of speaking to Radhia Gleis who has previously appeared on two different occasions on this podcast to talk about her experiences as a former cult member of the Buddhafield and who was also interviewed for the documentary “Holy Hell” as well as the informative and insightful book “The Followers: “Holy Hell” and the Disciples of Narcissistic Leaders” now in its 2nd edition. Recently, she appeared in the Netflix series “How to Become a Cult Leader” and we talk about her experience and the depiction and portrayal of the Buddhafield cult. She explains how documentaries and shows of that ilk often distort facts and events. In reality, things were often different than on those programs, and in many ways, you had to be there to understand the range and scope and the complex issues and situations to fully understand what was going on. That said, she demonstrates various key points that cult leaders, tyrants, dictators, and narcissistic sociopaths have in common, which they borrow from similar playbooks. Narcissistic leaders often try to pinpoint weaknesses, give answers to what people want to hear, and provide them with what they want or need, while also distorting facts, manipulating the psyche, and playing with the emotions and vulnerabilities of the members and followers. Moreover, members of such groups, sects, and communities tend to build connections amongst each other as they strive to build their unique community, and which they tend to hold onto despite experiencing malaise, discomfort, and various amounts of cognitive dissonance. All this involves and underscores complex psychological processes and cannot be simplified or reduced to simple matters of education or intelligence.",
      "release": "2023-12-08T16:15:59Z",
      "duration": "00:48:07.8360000",
      "explicit": true,
      "spotifyId": "15b9OrkfXeNg6Fs08IFGuX",
      "appleId": 1000637951334,
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/15b9OrkfXeNg6Fs08IFGuX",
        "apple": "https://podcasts.apple.com/podcast/you-just-had-to-be-there-radhia-gleis-on-cults-and/id1577839289?i=1000637951334"
      }
    }
  ]
}