{
  "_ts": 0,
  "id": "cf723e49-b2c5-43ae-9c1f-58a27260e7c5",
  "name": "Are You Creative?",
  "spotifyId": "5pTgfKXqovNKzvBIawdSMP",
  "appleId": 1751370839,
  "episodes": [
    {
      "id": "746e3882-b0bb-4c96-b543-fee139bce775",
      "title": "EP29 - POET AND CULT SURVIVOR - Leon The Poet",
      "description": "Observational poet with luxuriant hair from Witham. Leon started poetry in 2016, and became Leon The Poet in 2022. He was a songwriter first, and got inspired by spoken word like Kae Tempest. His first book was published in 2024 - ‘Sometimes I’m The Bull, Sometimes I’m The China Shop’ - with a brilliant cover by Essex artist Jason Bollocks. The book looks more like a music album than a poetry book. Leon finds that poetry has a more focused audience than when he used to perform music. He wants to make poetry more accessible for a wider audience - not just for super smart and serious people. Leon spend time on the titles for his poems to give them a good hook. He reads a poem about how his dog wanted to be a poet until a parcel fell on his head. Leon was raised in a controlling religious background, and he struggled to find independence and artistic outlets for most of his life. During COVID when the group couldn’t get together, Leon started to question the lifestyle and teachings and researched cults. Individualism and creativity are actively discouraged in a cult, it is all about the group. Art is therapy for Leon, he confides in his art and writes about subjects he is figuring out. Humans need to express themselves and create, it is play for adults! Creating something that didn’t exist before is joy. You have to be honest with what you write, it is your opinion and how you feel. Leon has a beef with Russell Brand and him finding Christ - he has an expert level of understanding of the bible and can easily spot his hypocrisy. Leon bigs up the poetry scene in Colchester at Patch and The Commons. How do you get poetry gigs? Poems have to connect with people, so make them easy to understand. Leon reads the best poem Nick and Sangita have ever heard - it’s called #Trainwanker and worth listening to the whole episode just for this! We talk Tim Key and his show Late Night Poetry. Big up to other Essex poets Martin Newell and Beans On Toast. Poems can be about anything, and it’s creatively liberating. Essex Tourism Board - ‘Witham - It’s just a place mate!’ Looking for James Buckley in Chelmsford. Tips for starting at poetry - just start! You’ve got to be your own curator, and trust your instincts. Commit to the idea. Leon The Poet Instagram Buy Leon The Poet\u0027s book Are You Creative? recorded by Adam from Lawker Media at Lawker Media Studio Edited by Nick Hearne Artwork by Alpaca Antenna Don\u0027t forget to like, subscribe, share and all the good stuff. Follow our Instagram for latest news and behind the scenes photos Send comments, questions, or suggestions for fascinating creative people in Essex give us a shout on our Instagram Thanks to NGDA for their support Recorded in Chelmsford, Essex, UK",
      "release": "2025-03-15T22:00:00Z",
      "duration": "00:54:41.9980000",
      "explicit": true,
      "spotifyId": "151WX8wYMDAg9PfhTC7OXQ",
      "appleId": 1000699322340,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/151WX8wYMDAg9PfhTC7OXQ",
        "apple": "https://podcasts.apple.com/podcast/ep29-poet-and-cult-survivor-leon-the-poet/id1751370839?i=1000699322340"
      }
    }
  ]
}