{
  "id": "e55df64e-b8ce-4c9c-bb37-1826c9fb9f7f",
  "name": "Armchair Expert with Dax Shepard",
  "spotifyId": "6kAsbP8pxwaU2kPibKTuHE",
  "appleId": 1345682353,
  "youTubeChannelId": "UClKP53RewJWK5s5WtLSg7Dg",
  "episodes": [
    {
      "id": "214d30f8-1ad6-46fd-88c6-65d14192b1c0",
      "title": "How Anyone Can Fall for a Cult",
      "description": "Ellen Huet breaks down how normal, everyday people find themselves involved in a cult.\n\nCatch the full episode with Ellen Huet: https://youtu.be/dovKx3XR2Iw\n\nWatch Armchair Expert episodes: https://www.youtube.com/playlist?list=PLzPEuwClyOzDdlrAmU-IwKncG87qrF7Vw\n\nFollow Armchair Expert on social: \nhttps://www.instagram.com/armchairexppod\nhttps://www.facebook.com/ArmchairExpPod/\nhttps://twitter.com/armchairexppod\n\nConnect with Wondery\nhttps://wondery.com/shows/armchair-expert-with-dax-shepard/\nhttps://www.facebook.com/WonderyMedia\nhttps://twitter.com/WonderyMedia\nhttps://www.instagram.com/WonderyMedia\nhttps://www.tiktok.com/@wonderymedia\n\nAbout the Show:\nHi, I’m Dax Shepard, and I love talking to people. I am endlessly fascinated by the messiness of being human, and I find people who are vulnerable and honest about their struggles and shortcomings to be incredibly sexy. I invite you to join me as I explore other people’s stories. We will celebrate, above all, the challenges and setbacks that ultimately lead to growth and betterment. What qualifies me for such an endeavor? More than a decade of sobriety, a degree in Anthropology and four years of improv training. I will attempt to discover human “truths” without any laboratory work, clinical trials or data collection. I will be, in the great tradition of 16th-century scientists, an Armchair Expert.\n\nWatch Armchair Expert every MONDAY, WEDNESDAY, and FRIDAY here on Youtube!\n\nListen to episodes ad-free by joining Wondery\u002B in the Wondery App, Apple Podcasts or Spotify. Start your free trial by visiting https://wondery.com/shows/armchair-expert-with-dax-shepard/\n\n\n#armchairexpert #daxshepard #Cults",
      "release": "2026-01-29T13:00:05Z",
      "duration": "00:06:49",
      "explicit": false,
      "youTubeId": "2SpfweAczUs",
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2SpfweAczUs"
      }
    },
    {
      "id": "64079586-7a31-4177-97b2-73e3762e5da0",
      "title": "Ellen Huet (on wellness cults)",
      "description": "Ellen Huet (Empire of Orgasm: Sex, Power, and the Downfall of a Wellness Cult) is a journalist, startup founder, and author. Ellen joins the Armchair Expert to discuss must-haves versus most-haves in terms of cult sexuality requirements, her hot tips for avoiding cults that are too extractive, and her dealings with Silicon Valley and venture capitalists. Ellen and Dax talk about when she began covering orgasmic meditation startup OneTaste, the OM course to cult pipeline, and the intricacies and systems of manipulation concocted by OneTaste’s leader. Ellen explains unpacking potential power dynamics of sexual abuse, how much status games weigh into human behavior, and why she believes there’s no one invulnerable to indoctrination. Follow Armchair Expert on the Wondery App or wherever you get your podcasts. Watch new content on YouTube or listen to Armchair Expert early and ad-free by joining Wondery\u0026#43; in the Wondery App, Apple Podcasts, or Spotify. Start your free trial by visiting wondery.com/links/armchair-expert-with-dax-shepard/ now. See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2026-01-28T08:30:00Z",
      "duration": "02:06:46.0990000",
      "explicit": true,
      "spotifyId": "5psXDal2SHoAcDPFJYdDlL",
      "appleId": 1000745921881,
      "youTubeId": "dovKx3XR2Iw",
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5psXDal2SHoAcDPFJYdDlL",
        "apple": "https://podcasts.apple.com/podcast/ellen-huet-on-wellness-cults/id1345682353?i=1000745921881",
        "youtube": "https://www.youtube.com/watch?v=dovKx3XR2Iw"
      }
    }
  ]
}