{
  "_ts": 0,
  "id": "ab674a80-949c-42c5-ab44-7037b48c28eb",
  "name": "Arroe Collins: Unplugged \u0026 Totally Uncut",
  "spotifyId": "32RG6AF6pgNg8qrFobdlwi",
  "appleId": 1254600361,
  "episodes": [
    {
      "id": "9d994d95-af96-499e-a80e-6fa45177cb15",
      "title": "When You Lose Your Father To A Cult And Dementia Jonathan Hirsch\u0027s The Mind Is Burning",
      "description": "THE MIND IS BURNING is the continued story of the Hirsch family whom we first met in the beloved cult podcast, Dear Franklin Jones. Stranger than fiction, this audiobook memoir follows Jonathan Hirsch’s childhood in a cult in Northern California, experience caring for his father battling dementia, and the complicated journey of losing a loved one who mistreated you.On April 9th, 2019, Jonathan got the dreaded call: his father Thomas had been rushed to the ER. He’d known for a while that Thomas’s health was in decline, but at this pivotal moment, he had no choice but to step into the role of caretaker—a role Thomas himself was never able to grasp.Thomas was a Hungarian refugee turned spiritual seeker, and Jonathan was along for the ride as his parents chased the high of enlightenment. Thomas’s quest eventually led the family to Franklin Jones: known as either a charismatic, eccentric guru or a cult leader and sexual predator, depending on whether you were inside or outside his orbit. Although Jonathan left home the day he turned eighteen, almost twenty years later, he was pulled back into the chaotic fold when Thomas was diagnosed with dementia. This poetic yet propulsive audiobook memoir was created for the listening experience given Hirsch’s expertise as an expert aural storytelling, and poses the question: What do we owe each other as family? \n\nBecome a supporter of this podcast: https://www.spreaker.com/podcast/arroe-collins-unplugged-totally-uncut--994165/support.",
      "release": "2025-07-09T17:00:08Z",
      "duration": "00:22:31",
      "explicit": false,
      "spotifyId": "2vwe6Ym8U5ak6jfx9LaUH6",
      "appleId": 1000716515225,
      "subjects": [
        "Adi Da"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2vwe6Ym8U5ak6jfx9LaUH6",
        "apple": "https://podcasts.apple.com/podcast/when-you-lose-your-father-to-a-cult-and/id1254600361?i=1000716515225"
      }
    }
  ]
}