{
  "id": "af337690-2523-4716-974d-d1a07f1bf89e",
  "name": "Arroe Collins Like It\u0027s Live",
  "spotifyId": "4CO9ReLYoQNkaiCgLWcwkk",
  "appleId": 1484825992,
  "episodes": [
    {
      "id": "a424e6ae-dbb5-4b1c-8171-39dac6aac4ab",
      "title": "When You Lose Your Father To A Cult And Dementia Jonathan Hirsch\u0027s The Mind Is Burning",
      "description": "THE MIND IS BURNING is the continued story of the Hirsch family whom we first met in the beloved cult podcast, Dear Franklin Jones. Stranger than fiction, this audiobook memoir follows Jonathan Hirsch’s childhood in a cult in Northern California, experience caring for his father battling dementia, and the complicated journey of losing a loved one who mistreated you.On April 9th, 2019, Jonathan got the dreaded call: his father Thomas had been rushed to the ER. He’d known for a while that Thomas’s health was in decline, but at this pivotal moment, he had no choice but to step into the role of caretaker—a role Thomas himself was never able to grasp.Thomas was a Hungarian refugee turned spiritual seeker, and Jonathan was along for the ride as his parents chased the high of enlightenment. Thomas’s quest eventually led the family to Franklin Jones: known as either a charismatic, eccentric guru or a cult leader and sexual predator, depending on whether you were inside or outside his orbit. Although Jonathan left home the day he turned eighteen, almost twenty years later, he was pulled back into the chaotic fold when Thomas was diagnosed with dementia. This poetic yet propulsive audiobook memoir was created for the listening experience given Hirsch’s expertise as an expert aural storytelling, and poses the question: What do we owe each other as family? \n\nBecome a supporter of this podcast: https://www.spreaker.com/podcast/arroe-collins-like-it-s-live--4113802/support.",
      "release": "2025-05-08T07:00:08Z",
      "duration": "00:22:31",
      "explicit": false,
      "spotifyId": "18AADbnSArGfUcRNuP1o10",
      "appleId": 1000706770520,
      "subjects": [
        "Adi Da"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18AADbnSArGfUcRNuP1o10",
        "apple": "https://podcasts.apple.com/podcast/when-you-lose-your-father-to-a-cult-and/id1484825992?i=1000706770520"
      }
    },
    {
      "id": "5310b00d-29df-4162-a506-0ee40c36b159",
      "title": "Former Nun Now Author Catherine Coldstream Releases Cloistered My Years As A Nun",
      "description": "An astonishing memoir of twelve years as a contemplative nun in a silent monastery. Cloistered takes the reader deep into the hidden world of a traditional Carmelite monastery as it approaches the third Millennium and tells the story of an intense personal journey into and out of an enclosed life of poverty, chastity, and obedience. Finding an apparently perfect world at Akenside Priory, in Northumberland, Catherine trusts herself to a group of twenty silent women, believing she is trusting herself to God. As the beauty and mystery of an ancient way of life enfold her, she surrenders herself wholly to its power, quite unaware of the complexity and dangers that lie ahead. Cut off from the wider world for decades, the community has managed to evade accountability to any authority beyond itself. When Sister Catherine realizes that a mesmerizing cult of the personality, with the distortions it entails, has replaced the ancient ideal of religious obedience, she is faced with a dilemma. Will she submit to this, or will she be forced to speak out? An exploration of the limits of trust, Cloistered shows us how far youthful idealism can take us along the road of self-surrender, and of how much harm is done when institutional flaws go unacknowledged. Catherine\u0027s honest account of her time in the monastery - and her dramatic flight from it - is both a love song to a lost community and an exploration of what is most compelling, yet most potentially destructive when closed human groups become laws unto themselves. Become a supporter of this podcast: https://www.spreaker.com/podcast/arroe-collins-like-it-s-live--4113802/support .",
      "release": "2024-03-23T11:00:01Z",
      "duration": "00:18:24.5090000",
      "explicit": false,
      "spotifyId": "6RsZkEMUROzXub34HGA3iD",
      "appleId": 1000650197713,
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RsZkEMUROzXub34HGA3iD",
        "apple": "https://podcasts.apple.com/podcast/former-nun-now-author-catherine-coldstream-releases/id1484825992?i=1000650197713"
      }
    }
  ]
}