{
  "id": "c7866afa-a856-451d-b294-2a67643685cd",
  "name": "Art Smitten",
  "spotifyId": "1c61lrRxPr5vId0682vgjS",
  "appleId": 1127222262,
  "episodes": [
    {
      "id": "19b54404-3324-4f3b-9ee1-61c238f5c726",
      "title": "Review: My Scientology Movie, Louis Theroux",
      "description": "My Scientology Movie sees BBC presenter, Louis Theroux, attempt to infiltrate the Church of Scientology, an organisation infamous for being shrouded in secrecy. Curiosity about the mysterious inner workings of the church, along with reports of assault committed by leader, David Miscavige, motivate Theroux’s efforts to understand life inside the Church and why it is so confidential.  Since first approaching the Church in 2002, Theroux’s pursuit to gain access to the Church and interview Miscavige had been denied. Classified under the spiritual state of Operating Thetan (OT) and one of the highest levels within the hierarchy, members of the “Sea Org” also declined to be involved. Without admittance to the Church or interviews with practising Scientologists, one would assume any plans for the documentary would be abandoned. Instead, Theroux sets out to re-enact incidences involving Miscavige, the Sea Org and high profile member, Tom Cruise by holding a casting call in Hollywood, where the Church’s Los Angeles headquarters resides. Theroux is aided by Mark “Marty” Rathbun, an ex-Scientologist who was previously Miscavige’s second-in-command. The casting call sparks bitter backlash from the Scientologist community, resulting in Theroux and his team being stalked and threatened throughout the film.  Casting actors to re-create Marty’s recollections of being a Scientologist works well to gradually introduce the audience to Scientology and awaken Marty’s memories. Most importantly, this approach compels Scientologists to engage with the documentary. Theroux appeals to the quality all scientologists, whether practising or excommunicated, seem to share in the film; an overbearing sense of pride. This could be attributed to the “auditing sessions” all members must undergo, which involve practicing intimidation techniques and dominating your opponent’s mind. Marty helps Theroux conduct a mock auditing session with the cast members to help them understand the harsh treatment within the Church and what motivates their characters. These techniques aim to instil doubt and distrust in the follower, hardening their mind but also weakening their empathy. Marty, despite having left the Church seven years ago, displays a similar type of pride when speaking about his previous role within Scientology, boasting that the “Church was absolutely at [his] beck and call”. Marty is a conflicted character, both reminiscing about former glory and bitter towards his past aggressors. The main criticism against Theroux documentaries is the presenter tends to insert himself into the narrative, steering away from traditional methods of strict observation. Fans of Theroux will relish the moment he catches his interviewees off-guard with his quips and quirky interviewing style, a trademark of his documentaries. Those intrigued by both the subject and the way the presenter engages with the subject will find this film captivating. However, I can appreciate that those who prefer the traditional style would not welcome his techniques, which often blur the line between conventional documentary and reality tv. This is where the genius lies, though, for the cast of actors play two roles in this film; the fabricated re-enactment of Marty’s memories and their real experiences with Scientologists as they’re hounded during filming. The switches between official BBC camera footage and mobile recordings suggests the documentary is largely unfiltered, and reinforces the idea of the film’s authenticity. This balances the growing suspicion you may feel when listening to Marty’s stories, a position I found myself in especially when he omits piece of information or becomes agitated without warning. I would highly recommend going to see this film, whether you’re a Theroux fan or not. It sees the talents of director, John Dower, and producer, Simon Chinn, come together and make a thought-provoking and entertaining film. Written by Erin ConnellanSee omnystudio.com/listener for privacy information.",
      "release": "2016-08-31T00:00:00",
      "duration": "00:03:39.0100000",
      "explicit": false,
      "spotifyId": "1rS0P7FswUidMCyXMhRiHB",
      "appleId": 1000379811671,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1rS0P7FswUidMCyXMhRiHB",
        "apple": "https://podcasts.apple.com/podcast/review-my-scientology-movie-louis-theroux/id1127222262?i=1000379811671"
      }
    }
  ]
}