{
  "_ts": 0,
  "id": "63f12703-9a34-4046-adcc-ea599e6b4f61",
  "name": "Artalogue",
  "spotifyId": "2DmDPSGyVhaSPPLBOzohkl",
  "appleId": 1719719089,
  "episodes": [
    {
      "id": "28e3dd01-a084-4a68-92ed-1dd333ebdf8e",
      "title": "From Movies to Memoirs with Guinevere Turner",
      "description": "Guinevere Turner is a writer, director and actor who has been working in film and TV since her 1994 debut film Go Fish, which she wrote, produced and starred in. She teamed up with director Mary Harron to write the films American Psycho, The Notorious Bettie Page and Charlie Says. She was a writer and story editor on Showtime’s The L Word, and she played a recurring character on that show. She has written and directed seven short films, two of which premiered at the Sun, dance Film Festival. She can be seen in film roles that include The Watermelon Woman, Chasing Amy, American Psycho and The L Word. Guinevere has taught screenwriting at Sarah Lawrence College, Columbia University, University of Georgia, UCLA, NYU and Syracuse University. She published an essay in The New Yorker in April of 2019, and has expanded on that essay in a memoir which was published by Random House in Summer of 2023. On today\u0027s episode of the Artalogue, we branch out and look at film as an art form with one of Madison\u0027s favourite contemporary writers, Guinevere Turner. In this episode, we discuss Turner\u0027s groundbreaking first feature length film Go Fish as it turns 30 years old, other notable screenplays like American Psycho, and get candid about working as an out gay woman in Hollywood. Madison and Guinevere Turner also discuss the enduring appeal of American Psycho, its satirical take on toxic masculinity, and Christian Bale\u0027s unforgettable performance. We dive into the film\u0027s past and present reception , the misconceptions about its message and the fans it has garnered over the years. Plus, discover the little-known secrets behind the iconic business card scene that still captivates fans today. Guinevere sheds valuable advice on writing everything from screenplays to memoirs and discusses her process, both collaborative and solitary. We discuss Turner\u0027s phenomenal new memoir, When the World Didn\u0027t End, which details her childhood growing up in a cult and how she wrote it. Guinevere reflects on her early days of diary writing within the Lyman family cult and how those formative experiences shaped her into the artist she is today. Guinevere sheds light on the less glamourous side of the film industry, from the complexities of collaborative writing to the near constant battle for funding. She shares personal insights into the cathartic power of storytelling. Guinevere also offers a heartfelt reflection on her various career milestones, from acting in Preaching to the Perverted to her work on The L Word and Charlie Says. This episode is a celebration of creativity, resilience, and the joy of reading and writing. Connect with us: Madison Beale , Host Croocial, Production Be a guest on The Artalogue Podcast",
      "release": "2024-08-23T06:00:00Z",
      "duration": "00:44:23.5750000",
      "explicit": false,
      "spotifyId": "3JkCu5yAkwW5xnSJsLYryP",
      "appleId": 1000666324216,
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JkCu5yAkwW5xnSJsLYryP",
        "apple": "https://podcasts.apple.com/podcast/from-movies-to-memoirs-with-guinevere-turner/id1719719089?i=1000666324216"
      }
    }
  ]
}