{
  "id": "74525d39-4520-4a06-b1d4-412cb718184d",
  "name": "Ask Dr. Julie Hanks",
  "spotifyId": "5gPyQoGBxiDheSxhRTOipI",
  "appleId": 1550864262,
  "youTubeChannelId": "UClQi5XklqD5HOAnVGz9_JsQ",
  "episodes": [
    {
      "id": "9ff5dda3-445b-4902-93d9-2bc1c5f51e15",
      "title": "Kevin Franke on Healing, Self-Trust, and Life After Ruby Franke, Jodi Hildebrandt, and 8 Passengers",
      "description": "In this special episode of the Ask Dr. Julie Hanks Podcast I sit down with Kevin Franke, former husband of Ruby Franke from the 8 Passengers family vlog, as he shares his lived experience inside a high-control marriage and cult-like system connected to therapist Jodi Hildebrandt. During our conversation, Kevin speaks openly about how emotional vulnerability, religious culture, and misplaced trust created the conditions for manipulation, gaslighting, and isolation. Listen to understand how cult dynamics develop inside families, relationships, and belief systems, and why even intelligent, capable people can become trapped in these environments. Kevin Franke reflects on the rise and fall of 8 Passengers, his marriage to Ruby Franke, the psychological control exerted by Jodi Hildebrandt, and the devastating personal consequences that followed, including loss of identity, faith confusion, PTSD symptoms, and public scrutiny. He also shares what healing has looked like since leaving the system, rebuilding self-trust, reconnecting with safe relationships, and creating a life grounded in agency and emotional health. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcasts and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses. Connect with me on social media @drjuliehanks and find out how to work with me on my website at drjuliehanks.com/coaching. For therapy in Utah visit wasatchfamilytherapy.com. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2025-12-15T10:00:00Z",
      "duration": "02:00:40.2810000",
      "explicit": false,
      "spotifyId": "3qS1ViMT8Uo29gtuET2GB8",
      "appleId": 1000741340854,
      "youTubeId": "jo-WwPm54Cg",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3qS1ViMT8Uo29gtuET2GB8",
        "apple": "https://podcasts.apple.com/podcast/kevin-franke-on-healing-self-trust-and-life-after/id1550864262?i=1000741340854",
        "youtube": "https://www.youtube.com/watch?v=jo-WwPm54Cg"
      }
    },
    {
      "id": "d9bd955a-acc3-4fab-b54a-0f111d7cd12c",
      "title": "Surviving Mormonism\u0027s David Matheson - former LDS Conversion Therapist",
      "description": "In this episode, I sit down with David Matheson, a former LDS conversion therapist who is now openly gay. You may recognize David from episode 1 of Bravo’s Surviving Mormonism with Heather Gay. In our conversation, David opens up about his own experience as a client in conversion therapy, the harmful assumptions that shaped that world, and the moment he realized that no amount of effort would change his sexual orientation. We also talk about the tender complexity of mixed-orientation marriages, his personal coming-out process, and what he would say today to the clients he once tried to help in ways he now knows were damaging. If you’re navigating your own faith expansion, supporting a loved one who has come out, or simply wanting to understand these experiences with more compassion, this episode offers a gentle, grounded space to listen and learn. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining The Dr. Julie Hanks Gorup Coaching Community at drjuliehanks.com/community. For therapy in Utah visit wasatchfamilytherapy.com . Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2025-11-18T12:00:00Z",
      "duration": "00:48:09.7430000",
      "explicit": false,
      "spotifyId": "1ENWQfbYo40pleNi31tkAw",
      "appleId": 1000737311280,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ENWQfbYo40pleNi31tkAw",
        "apple": "https://podcasts.apple.com/podcast/surviving-mormonisms-david-matheson-former-lds-conversion/id1550864262?i=1000737311280"
      }
    },
    {
      "id": "4ea5e037-575a-4467-9ad3-a88a1140791d",
      "title": "Differentiation of Self: The Key to Wise Decision Making Regarding the LDS Church with Valerie Hamaker Episode",
      "description": "This bonus episode is for anyone who is looking to better understand their personal relationship with The Church of Jesus Christ of Latter-day Saints. Listen as Ask Dr. Julie Hanks combines with the Latter-day Struggles podcast for a special episode all about moving forward with the LDS Church in the healthiest way for you. If you aren’t sure how to move forward in your relationship with the LDS Church, Valerie and I are hosting a discussion series just for you. This 4-week Q\u0026A series will help you better understand what you want your relationship with the Church to look like. We will show you how differentiation of self can help you develop a healthy relationship with the Church regardless of if you choose to stay or leave. Listen for a taste of what you\u0027ll get when you sign up for this 4-week discussion series all about supporting those who are perplexed about how to relate to the LDS Church. The sessions will include a Q\u0026A and instruction on practical ways to develop differentiation skills in your life, which can improve all your relationships--not just your relationship with the Church. Each one-hour session is held remotely via Zoom. Spots are limited, so don’t wait to sign up. First session held October 8th. Four one-hour sessions with two therapists is an absolute steal of a deal. While this series is valued at $2,000, you can sign up today for only $169 Secure your spot (limited availability) today at https://drjuliehanks.as.me/decide Join my Patreon DJH Insiders https://www.patreon.com/drjuliehanks/ Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2024-09-17T07:00:00Z",
      "duration": "00:34:57.6840000",
      "explicit": false,
      "spotifyId": "3XhsGhrnOdNkHmgQyRUq01",
      "appleId": 1000669790510,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XhsGhrnOdNkHmgQyRUq01",
        "apple": "https://podcasts.apple.com/podcast/differentiation-of-self-the-key-to-wise-decision/id1550864262?i=1000669790510"
      }
    },
    {
      "id": "2e3683e4-8b63-4110-a760-0e6a6785c796",
      "title": "How do I support my 13-year-old daughter who wants to stay in the LDS Church when I have left?",
      "description": "In today\u0027s episode I talk with Saren and answer the question “How do I support my 13-year-old daughter who wants to stay in the LDS Church when I have left?” Saren is trying to reconcile letting her child be a part of something that she has chosen to leave behind while also respecting her daughter’s agency. To top it off, her daughter has had a difficult time with her mother’s decision to leave the Church. We discuss strategies—like debriefing after church and staying in contact with her daughter’s teachers—that can help Saren and her daughter discuss spiritual matters while also keeping a pulse on what she is learning. This is a great opportunity for Saren to help her daughter develop skills like critical thinking, self trust, and sense of self. They are in different places spiritually, but that doesn’t mean that they can’t maintain a deep and genuine relationship. By being true to herself, Saren is modeling how to individualize spirituality and experience continual growth. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2024-05-28T07:00:00Z",
      "duration": "00:29:43.5880000",
      "explicit": false,
      "spotifyId": "1Dk7U0ic7Xcuhfa7d704qN",
      "appleId": 1000656999871,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Dk7U0ic7Xcuhfa7d704qN",
        "apple": "https://podcasts.apple.com/podcast/how-do-i-support-my-13-year-old-daughter-who-wants/id1550864262?i=1000656999871"
      }
    },
    {
      "id": "15c2ebe4-ef50-44bd-b95d-2c38bb143deb",
      "title": "Bonus Episode: Stepping back from the LDS Church? How to do so in a Psychologically Healthy Way with Valerie Hamaker",
      "description": "This bonus episode of the podcast is for anyone who is wanting to step back from The Church of Jesus Christ of Latter-day Saints while also protecting their mental health. Listen as fellow LDS therapist Valerie Hamaker and I share insight on important topics like why people choose to leave the LDS Church after a faith transition and how to develop the crucial skill of setting boundaries. Stepping back? How to Leave in a Psychologically Healthy Way If you choose to leave and want to protect your mental health, Valerie and I are hosting a discussion series just for you. This 4-week Q\u0026A discussion series will help you find clarity, set boundaries, maintain relationships, and build community. The discussion covers potential challenges such as navigating changes in relationships with family and the larger community, managing internalized beliefs and fears, and the grief that accompanies leaving one\u0027s spiritual community. Each hour session is held remotely via Zoom. Spots are extremely limited, so don’t wait to sign up. Four hour-long sessions with two therapists is an absolute steal of a deal. While this series is valued at $2,000, you can sign up today for only $169. Stepping back from the Church? Join us here Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2024-04-30T07:00:00Z",
      "duration": "00:30:00.8290000",
      "explicit": false,
      "spotifyId": "3YSrKAP6GH1mXxrXLsutca",
      "appleId": 1000654018085,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3YSrKAP6GH1mXxrXLsutca",
        "apple": "https://podcasts.apple.com/podcast/bonus-episode-stepping-back-from-the-lds-church-how/id1550864262?i=1000654018085"
      }
    },
    {
      "id": "d66888e9-c495-4a04-9233-7cb807974724",
      "title": "How do I heal from a patriarchal marriage and let go of resentment I’m carrying towards the LDS Church?",
      "description": "Listen as I chat with Alyssa and answer the question “How do I heal from a patriarchal marriage and let go of resentment I’m carrying towards the LDS Church?” Alyssa and her husband reevaluated the lessons they were taught about marriage and have worked to move toward a partnership model. She feels angry when she thinks about the time she lost living in a patriarchal marriage and sad when she thinks about her past self who didn’t feel empowered. I invite Alyssa to allow herself to feel the anger that comes up when she thinks about what she lost. Pushing the anger away will only prolong her healing. No experience is wasted. There are opportunities Alyssa didn’t have in a patriarchal marriage, and she also gained certain experiences during that time that help her to be who she is today. There are opportunities wasted, but the work that she has been doing is still meaningful. Caring for a home and family is meaningful work. And now she gets to do it consciously and with balance while building a life she loves. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2024-04-09T07:00:00Z",
      "duration": "00:22:41.8150000",
      "explicit": false,
      "spotifyId": "4MTxRVg1GY06EO5h93zzFn",
      "appleId": 1000651862849,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4MTxRVg1GY06EO5h93zzFn",
        "apple": "https://podcasts.apple.com/podcast/how-do-i-heal-from-a-patriarchal-marriage-and-let/id1550864262?i=1000651862849"
      }
    },
    {
      "id": "e320467d-3a26-4c3e-af85-ac954d879d00",
      "title": "How can I stay engaged and active in the LDS Church as a working mom and a feminist?",
      "description": "In this episode I talk with Sylvia and answer the question “How can I stay engaged and active in the LDS Church as a working mom and a feminist?” Sylvia shares the story of a painful experience at Church that has left her wondering if she sustains her leaders. In fact, she has chosen not to renew her temple recommend because she isn’t sure if she can sustain her current bishopric. The word sustain has two main definitions. I used to think that sustain meant agree, but I see the word differently now. We talk about what the word actually means, and I invite Sylvia to consider what it would mean if it were okay for her to disagree with her leaders. Ultimately, we each get to decide what it means to us to sustain. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2024-03-05T08:00:00Z",
      "duration": "00:24:10.9190000",
      "explicit": false,
      "spotifyId": "7y7sUlV87gqqvraoJSaMH9",
      "appleId": 1000648046955,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7y7sUlV87gqqvraoJSaMH9",
        "apple": "https://podcasts.apple.com/podcast/how-can-i-stay-engaged-and-active-in-the-lds-church/id1550864262?i=1000648046955"
      }
    },
    {
      "id": "67500d24-c2fd-4c8c-975c-b1af85b7ef7d",
      "title": "Bonus Episode: How to Stay Connected to the LDS Church in a Psychologically Healthy Way with Valerie Hamaker",
      "description": "This bonus episode of the podcast is for anyone who is wanting to stay in The Church of Jesus Christ of Latter-day Saints while also protecting their mental health. Listen as fellow LDS therapist Valerie Hamaker and I share insight on important topics like why people choose to stay in the LDS Church after a faith transition and how to develop the crucial skill of setting boundaries. Choosing to Stay? How to Stay Connected to the LDS Church in a Psychologically Healthy Way If you choose to stay and want to protect your mental health, Valerie and I are hosting a discussion series just for you. This 4-week Q\u0026A discussion series will help you find clarity, set boundaries, and stay connected to the LDS Church in a psychologically healthy way. Bring your questions about your complex relationship with the Church, including: Difficult family relationships Trust crisis about Church history \u0026 doctrine Feelings of betrayal Struggles with social justice issues (women, BIPOC, LGBTQ) Benefits of Church participation Each two-hour session is held remotely via Zoom. Spots are extremely limited, so don’t wait to sign up. Four two-hour sessions with two therapists is an absolute steal of a deal. While this series is valued at $2,000, you can sign up today for only $169. Choosing to stay in the Church but want to do it in a psychologically healthy way? Let us help you.⁠ Secure your spot (limited availability) today Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2024-01-23T08:00:00Z",
      "duration": "00:56:40.3060000",
      "explicit": false,
      "spotifyId": "0GESGKNxTzT9bBLm6vFQHU",
      "appleId": 1000642606771,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0GESGKNxTzT9bBLm6vFQHU",
        "apple": "https://podcasts.apple.com/podcast/bonus-episode-how-to-stay-connected-to-the-lds-church/id1550864262?i=1000642606771"
      }
    },
    {
      "id": "b06ec27a-0b2e-494e-9d3e-0d089ce644af",
      "title": "How can I help my LGBTQ\u002B friends who are in pain because they feel like they don’t belong in the LDS Church?",
      "description": "In this episode I talk with Ben Schilaty and answer the question “How can I help my LGBTQ\u0026#43; friends who are in pain because they feel like they don’t belong in the LDS Church?” Ben’s question stems from his own experience of being a gay member of the LDS Church and from seeing loved ones in the LGBTQ\u0026#43; community struggle to feel like they have a place in the Church. Ben and I talk about what he does now to try and help his friends. He shares that he’s a great listener, but that sometimes it’s hard to do so without taking on their feelings himself or explaining those feelings away. We talk about trusting others to find the answers to their own problems, how pride sometimes gets in the way of being a good listener, how to let ourselves feel difficult feelings, and more. Ben is a fellow therapist, podcast host, author, and Instagram personality. You can keep up with him in the following places: Questions from the Closet podcast Instagram @benschilaty Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2024-01-02T08:00:00Z",
      "duration": "00:31:21.3120000",
      "explicit": false,
      "spotifyId": "5cfWBIZKRnguYKxm0jta9L",
      "appleId": 1000640295872,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5cfWBIZKRnguYKxm0jta9L",
        "apple": "https://podcasts.apple.com/podcast/how-can-i-help-my-lgbtq-friends-who-are-in-pain-because/id1550864262?i=1000640295872"
      }
    },
    {
      "id": "635fc58d-4578-419b-be78-56cacd503972",
      "title": "How do I share my doubts about the LDS Church with my family?",
      "description": "In this episode I talk with Michelle and answer the question “How do I share my doubts about the LDS Church with my family?” Michelle’s parents are both very religious, and she is unsure how to share the news of her faith journey with them. Part of being honest about where you are on a faith journey is often disappointing your parents. This is especially hard for Michelle who has felt pressure to be one of her parents’ children who stays in the faith. We talk about how she will lose that role in her family when she tells her parents, and that that will be sad. It’s okay for her to grieve that role, and it’s also okay for her to be true to herself. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. You can also join my group coaching membership where I host three live group coaching sessions per month covering the topics that matter to you the most. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my membership and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com . Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2023-07-11T07:00:00Z",
      "duration": "00:26:07.2160000",
      "explicit": false,
      "spotifyId": "4H6Kt8rh3T2cUEzWGA7QFB",
      "appleId": 1000620740479,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4H6Kt8rh3T2cUEzWGA7QFB",
        "apple": "https://podcasts.apple.com/podcast/how-do-i-share-my-doubts-about-the-lds-church-with-my-family/id1550864262?i=1000620740479"
      }
    },
    {
      "id": "36860f2f-50eb-4a1b-843e-aae59ae0398e",
      "title": "How can I better connect and communicate with my orthodox family now that I’ve left the LDS Church?",
      "description": "In this episode, I talk with Rebecca and answer the question “How can I better connect and communicate with my orthodox family now that I’ve left the LDS Church?” Rebecca left the LDS Church and came out as gay. Her family has been accepting and supportive, but she has noticed they tend to be awkward and avoidant when her girlfriend is around. To Rebecca, it feels like she is being rejected. I ask Rebecca if there is room for people to be awkward around her and her partner without rejecting them. I invite her to recognize moments when she feels that awkwardness and allow room for other interpretations. I also encourage her to tell her family exactly what they could do when she is around to help her feel loved and celebrated. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast Please c lick here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks , browse DJH merch , and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com . Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2022-12-13T05:00:00Z",
      "duration": "00:19:33.3940000",
      "explicit": false,
      "spotifyId": "7gHtlCcvjkjxTPCEZ1IWMP",
      "appleId": 1000589981568,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7gHtlCcvjkjxTPCEZ1IWMP",
        "apple": "https://podcasts.apple.com/podcast/how-can-i-better-connect-and-communicate-with-my/id1550864262?i=1000589981568"
      }
    },
    {
      "id": "a1d1c3bd-f919-4276-ab62-266ff998595d",
      "title": "How do I navigate feeling like I don’t fit in or personally align with LDS culture while wanting to stay a member of the Church?",
      "description": "In this episode, I coach Tanya and address the question, “How do I navigate feeling like I don’t fit in or personally align with LDS culture while wanting to stay a member of the Church?” Tanya has been feeling a disconnect between her values—particularly when it comes to views on LGBTQ\u0026#43; matters—and Church culture. Though she doesn’t feel like she fits in, she has been looking for any possible way to stay. Tanya shares that she was taught she must be 100% in line with the Church or leave. I tell her that she gets to decide whether or not she wants to live that way. Who said that faith or Church involvement have to be an all-or-nothing matter? Part of growing up is taking ownership of your life. As you claim personal power for your life, you get to decide what and how you want to believe instead of relying on others to tell you what you should be doing or feeling. I also share that as Tonya gains confidence to live more authentically, she will start attracting more people who think like her. Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast Please c lick here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks , browse DJH merch , and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com . To learn more about this topic, please visit th Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2022-08-23T04:00:00Z",
      "duration": "00:16:44.7730000",
      "explicit": false,
      "spotifyId": "1tVtgHoNuuNtsWDb5A90Wa",
      "appleId": 1000577041292,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1tVtgHoNuuNtsWDb5A90Wa",
        "apple": "https://podcasts.apple.com/podcast/how-do-i-navigate-feeling-like-i-dont-fit-in-or-personally/id1550864262?i=1000577041292"
      }
    },
    {
      "id": "072a637a-2ea0-4d0d-9889-2fc7050f3044",
      "title": "How can I feel confident in my life as a single adult in the LDS church?",
      "description": "In this episode, Dr. Julie Hanks coaches Lindsay and addresses the question “How can I feel confident in my life as a single adult in the LDS church?” Lindsay shares that she joined the church in hopes of creating a family she didn’t have growing up, and as that hasn’t happened yet, she’s blaming herself. During this episode, Dr. Hanks guides Lindsay through her feelings of failure, of sadness and loneliness, and how her childhood experiences may be impacting how she feels about herself today. If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks , browse DJH merch , and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com . Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2021-11-30T05:00:00Z",
      "duration": "00:26:13.7200000",
      "explicit": false,
      "spotifyId": "6alc1vp1cJpzq5atrvgKhH",
      "appleId": 1000543464806,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6alc1vp1cJpzq5atrvgKhH",
        "apple": "https://podcasts.apple.com/podcast/how-can-i-feel-confident-in-my-life-as-a-single/id1550864262?i=1000543464806"
      }
    },
    {
      "id": "e531a398-05b5-4c22-99f9-e46cb04b24f9",
      "title": "How can I reconcile my desire to empower women with contradictory messages from the LDS church?",
      "description": "In this episode, Dr. Julie Hanks coaches Hannah Olson, creator of FreckledHan , and addresses the question, “How do I reconcile my call to help empower women with potentially harmful messaging from the LDS church?” What I believe is that the church is reacting against the devaluation of caregiving and they’re doing it in a less than helpful way. Caregiving is valuable work, but the way the church presents it leads to an either or. During this episode, Dr. Hanks guides Hannah through reframing some of the messaging the LDS church has presented about idealizing motherhood, while also valuing caregiving as a legitimate vocation and life choice for men and women. Overall, who you are and how you live is the biggest way you can make an impact, and being bold about that wherever you have a sphere of influence. FreckledHan FreckledHan on Instagram Read Dr. Hanks’ popular Mormon Cultural Commentary Blog Articles If you have found this information helpful, you can find additional resources on this topic in my podcast, my online courses, and through new events each month. Connect with me on social media @drjuliehanks and at drjuliehanks.com. For therapy in Utah visit wasatchfamilytherapy.com Have you ever thought, “I want to ask Dr. Julie Hanks a question”? Well, now’s your chance! I want to have you on my podcast! Click here to fill out this form and tell me your question. I might just pick you to be on the podcast and receive a free coaching session. Thank you for listening to the Ask Dr. Julie Hanks podcast. Please click here to leave me a review . And make sure you don’t miss an episode by following me on Apple Podcast and Spotify . If you have found this information helpful, you can find additional resources on this topic in my podcast and my online courses . Connect with me on social media @drjuliehanks and work with me through joining DJH membership at drjuliehanks.com . For therapy in Utah visit wasatchfamilytherapy.com .",
      "release": "2021-03-30T04:00:00Z",
      "duration": "00:24:27.3500000",
      "explicit": false,
      "spotifyId": "4JkAlxxdj1jTgw8TOUkKpr",
      "appleId": 1000514999726,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JkAlxxdj1jTgw8TOUkKpr",
        "apple": "https://podcasts.apple.com/podcast/how-can-i-reconcile-my-desire-to-empower-women-with/id1550864262?i=1000514999726"
      }
    }
  ]
}