{
  "id": "ad31fb5d-56fc-47d8-96a4-3cb3b8101e5c",
  "name": "Asking for a Friend - Health, Fitness \u0026 Personal Growth Tips for Women in Midlife",
  "spotifyId": "1gAvoLvwjsuJqeEafQ4RYV",
  "appleId": 1620788625,
  "episodes": [
    {
      "id": "28ac9279-7f93-4171-9c41-7df7d78af80b",
      "title": "Ep.106 From Cult to Comedy: Shannon Payton Discovers Strength and Recovery Through Humor",
      "description": "Our travel through health and wellness on the podcast doesn\u0027t end with menopause, diets, and dumbbells; today we venture into the tangled realm of cults with Shannon Payton. Her raw account, as a survivor and thriver, of a youth and adult spent within the restrictive walls of a religious cult, not only educates but also empowers, as she recounts her evolution with a resilience that\u0027s both poignant and humorous. Life inside a religious cult isn\u0027t a tale often told with candid laughter and heartfelt revelations, yet this is precisely the narrative Shannon brings to our episode. Through her eyes, we witness the stifling grip of controlling environments and the liberating exodus that reshaped her entire world. Our conversation weaves through her unique childhood experiences, the challenges of forging real friendships post-cult, and the sweet triumph of building a family through adoption, all of which have sculpted a woman who now champions the expansive opportunities she provides for her children. With each twist and turn of life\u0027s journey, Shannon has embraced laughter as her lifeline, a truth that resonated deeply during the isolation of the pandemic. Her spontaneous rise to social media stardom and the creation of a podcast sanctuary for those affected by coercive control have marked her as a beacon of relatability and healing. It\u0027s not just about the laughs; it\u0027s about the connections, the stories, and the collective healing we experience when we share. Join us for a conversation that promises to touch your heart, tickle your funny bone, and perhaps, inspire your next step forward. You can find Shannon Payton at: https://shannypantsshow.com/ Instagram @therealshannypants YouTube Shanny Pants Show I\u0027d love to work with you! Let me help you reach your health and fitness goals. https://www.fasterwaycoach.com/?aid=MicheleFolan Have questions about Faster Way? Feel free to reach out. mfolanfasterway@gmail.com Follow Asking for a Friend on Social media outlets: https://www.instagram.com/askingforafriend_pod/ https://www.facebook.com/askforafriendpod/ Please provide a review and share. This helps us grow! https://lovethepodcast.com/AFAF This podcast is for general informational purposes only and does not constitute the practice of medicine, nursing, or other professional healthcare services, including the giving of medical advice. The content of this podcast is not intended to be a substitute for professional medical advice, diagnosis, or treatment. Users should not disregard or delay in obtaining medical advice for any medical condition they may have and should seek the assistance of their healthcare professionals for any such conditions.",
      "release": "2024-05-27T04:00:00Z",
      "duration": "00:51:38.0440000",
      "explicit": false,
      "spotifyId": "01wkaCjQVBsdhIGqEvqsCN",
      "appleId": 1000656852998,
      "subjects": [
        "Cult Recovery",
        "Self-Help",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/01wkaCjQVBsdhIGqEvqsCN",
        "apple": "https://podcasts.apple.com/podcast/ep-106-from-cult-to-comedy-shannon-payton-discovers/id1620788625?i=1000656852998"
      }
    }
  ]
}