{
  "id": "7f7c60db-cb5c-4337-b937-471579406628",
  "name": "Association for Spiritual Integrity",
  "youTubeChannelId": "UC96ilFf5rxosgCWIY7pSj6w",
  "episodes": [
    {
      "id": "931ea6c7-749e-49e0-9f42-853e1ccc2028",
      "title": "Understanding Authoritarian Mind Control Cults and Helping Survivors, with Steve Hassan",
      "description": "Also see https://www.spiritual-integrity.org/asi-webinar-with-dr-steve-hassan/\n\nAt this webinar, former Moonie and mental help professional Steve Hassan shared his Influence Continuum and BITE (Behavior, Information, Thought, Emotion) Model of Authoritarian Control. His four books, online courses, podcast, and 47 years of experience offer a framework for discerning ethical from unethical influence. His work has helped people who were raised in cults as well as those who were recruited into them.\n\nSteve Hassan, PhD is a mental health professional and expert in undue influence tactics used by authoritarian leaders and destructive cults. His expertise includes harmful influence in cases of destructive religious and political cults, human trafficking, extremist and terrorist groups, one-on-one relationships, families, parental alienation, mini-cults, therapy and self-improvement groups, professional and institutional abuse, corporate and multi-level marketing programs, and harmful belief systems.  \n\nHe is the author of four books including Combating Cult Mind Control, Freedom of Mind and The Cult of Trump. He is a translated author with books in 10 languages. His online video courses include Understanding Cults: A Foundational Course, which is available for the public, and also as a mental health professional continuing education program. He is the Founding Director of the Freedom of Mind Resource Center, which provides training, consulting and support to individuals who are struggling to leave or recover from a cult and to families and organizations that are concerned about cult behaviors. He also is the founder of Freedom From Undue Influence, a not-for-profit entity with the purpose of conducting and publishing the research on undue influence that is needed to update legal and social policies. He developed the BITE Model of Authoritarian Control to identify control tactics and the Influence Continuum Model to discern ethical from unethical influence. He developed the Strategic Interactive Approach (SIA), as an effective and legal intervention alternative for families to help cult members.\n\nDr. Hassan believes that access to the truth, freedom of thought, and freedom from undue influence are basic human rights. A complex systems approach, based in science and supported by the rule of law, is necessary to protect these rights. He is a member of the Program in Psychiatry and the Law at the Massachusetts Mental Health Center, a teaching hospital of Harvard Medical School. He is an experienced educator having served as an instructor for the Harvard Law School Trial Advocacy Workshop, as an elective teacher and a presenter for the Harvard Longwood Psychiatry Residency Training Program, and in other educational and training capacities for other higher education, professional, law enforcement, governmental, non-governmental and advocacy group audiences. Dr. Hassan began helping people affected by undue influence after he was deprogrammed from the Moon cult in 1976 at age 22. His 45 plus years of experience give him a unique perspective on the damaging effects of undue influence and exploitation by destructive cults. He is a frequently requested speaker and media interviewee. Dr. Hassan holds a Master’s Degree in Counseling Psychology from Cambridge College and a Doctorate in Organizational Development and Change from Fielding Graduate University School of Leadership Studies.",
      "release": "2024-01-15T17:08:58Z",
      "duration": "01:30:50",
      "explicit": false,
      "youTubeId": "ms1mTD0WnRo",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ms1mTD0WnRo"
      }
    },
    {
      "id": "05c071e8-ef70-4cef-9ada-3578939657d0",
      "title": "ASI Community Gathering - Preventing Sexual Misconduct in Spiritual Communities",
      "description": "Carol Merchasin spoke to us on these four topics, and also offered opportunities for questions and discussion:\n\n    Power, consent and the law\n    Coercive tactics of abusers\n    What every organization needs to prevent sexual misconduct\n    Recent cases against spiritual organizations and their leader\n\nCAROL MERCHASIN is an attorney who leads a practice group litigating sexual misconduct in religious, faith-based and spiritual communities at McAllister Olivarius. She was previously a partner in the Philadelphia office of Morgan, Lewis \u0026 Bockius and director of Morgan Lewis Resources, where she conducted dozens of workplace investigations and taught investigative techniques to human resource professionals at many Fortune 50 companies.\n\nChapters:\n00:00:00 - Introduction to Carol and her perspective on abuse of power in spiritual contexts\n00:02:24 - My Journey as a Lawyer Investigating Sexual Misconduct\n00:05:13 - Investigating Sexual Misconduct in Spiritual Communities\n00:08:13 - Understanding Consent in Spiritual Communities\n00:11:59 - Liability for Sexual Assault in Spiritual Communities\n00:15:29 - Understanding Sexual Assault and Consent\n00:19:03 - Sexual Harassment and Organizational Negligence\n00:22:27 - The Federal Sex Trafficking Law\n00:25:49 - Manipulation and Coercion within Organizations\n00:29:00 - Individual Justice and the Broken Criminal Justice System\n00:32:08 - Recognizing False Light in Spiritual Communities\n00:34:55 - Criteria for False Accusations\n00:37:45 - Defamation and Whistleblowers\n00:40:30 - Differences between Sexual Abuse in Spiritual and Corporate America\n00:44:23 - Consent, Teachings, and Sexual Misconduct\n00:48:22 - Policies and Processes for Addressing Human Trafficking\n00:50:58 - Cult-Like Behavior and Psychological Shift\n00:53:41 - Creating and Enforcing Community Policies\n00:56:20 - Thoughtful Reporting Process\n00:59:18 - Recourse for Abuse in Psychedelic Therapy Relationships\n01:03:15 - Red Flags and Trauma Survivors\n01:06:24 - Policy Considerations for Preventing Sexual Misconduct\n01:08:47 - The Nuance of Teacher-Student Relationships\n01:10:46 - Policies for Maintaining Decorum\n01:12:32 - Preventing Child Molestation\n01:15:03 - Consent and Rules in Communities and Workplaces\n01:16:39 - Managing Relationships with Students\n01:18:30 - Hypocrisy in Celibacy and Exposing Corruption\n01:21:11 - Potential Legal Issues with Nondisclosure Agreements\n01:23:05 - Survivor Support and Legal Advocacy\n01:26:16 - Upholding the Teachings",
      "release": "2023-07-31T11:27:42Z",
      "duration": "01:27:52",
      "explicit": false,
      "youTubeId": "j6DJCVMkd-s",
      "subjects": [
        "Cult-Expert",
        "Human Trafficking",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j6DJCVMkd-s"
      }
    }
  ]
}