{
  "id": "13a773d3-be75-4d15-ab17-aa9b05e5763f",
  "name": "BBC Assume Nothing: The Secrets of St Brides",
  "episodes": [
    {
      "id": "f817d104-d979-4577-95ad-2939e8012ab0",
      "title": "Episode 1: The Silver Sisterhood",
      "description": "Ireland, 1984. St Brides School for young ladies opens its doors in the quiet fishing village of Burtonport, county Donegal - but all is not as it seems. The mistresses and ‘girls’ appear to believe that they live not only in a different century, but in an entirely different world. They are The Silver Sisterhood, a deeply religious group of women who worship a feminine God. They wear Victorian clothing, reject modernity and live by candlelight – but mysteriously they also begin to release a series of strange computer games apparently based on their unique school and unusual beliefs. Their strange way of life soon gives rise to rumour and speculation, but is any of it true - or is their alternative lifestyle simply fuelling suspicion? Who are these women, what are they doing in Burtonport - and what is really going behind the doors of St Brides? Produced and presented by Conor McKay Executive Editor: Andy Martin A BBC Northern Ireland Production",
      "release": "2022-10-22T11:00:00Z",
      "duration": "00:17:04.5050000",
      "explicit": false,
      "spotifyId": "2PO6NoKTGP4jT1zkzbai16",
      "appleId": 1000583519669,
      "subjects": [
        "Silver Sisterhood"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2PO6NoKTGP4jT1zkzbai16",
        "apple": "https://podcasts.apple.com/podcast/episode-1-the-silver-sisterhood/id1540321271?i=1000583519669"
      }
    },
    {
      "id": "d9eb1785-5834-43b9-b702-64a80d353da7",
      "title": "Episode 2: The Flickering Candle",
      "description": "Ireland, 1984. St Brides School for young ladies opens its doors in the quiet fishing village of Burtonport, county Donegal - but all is not as it seems. A BBC crew attends the opening ceremony for the school, hosted by an enigmatic headmistress who appears to change her name regularly – but what is the real purpose of St Brides? A newspaper journalist visits the house and recalls a strange evening full of unexpected surprises, what can she reveal? Meanwhile, Conor tracks down a former resident of the house who helps him piece together more parts of puzzle – but is she prepared to tell her own story? Produced and presented by Conor McKay Executive Editor: Andy Martin A BBC Northern Ireland Production",
      "release": "2022-10-22T11:00:00Z",
      "duration": "00:16:17.0850000",
      "explicit": false,
      "spotifyId": "5y1eRxEE5eJNlR9ig9Gzn6",
      "appleId": 1000583519595,
      "subjects": [
        "The Screamers",
        "Silver Sisterhood"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5y1eRxEE5eJNlR9ig9Gzn6",
        "apple": "https://podcasts.apple.com/podcast/episode-2-the-flickering-candle/id1540321271?i=1000583519595"
      }
    },
    {
      "id": "6cd75745-e962-4b89-8658-e501c9bfd636",
      "title": "Episode 3: A Flash in the Dark",
      "description": "Ireland, 1984. St Brides School for young ladies opens its doors in the quiet fishing village of Burtonport, county Donegal - but all is not as it seems. Conor travels to Burtonport to find out what locals remember about the Silver Sisterhood. He hears strange tales of women running through the street at midnight wearing clogs, reports of a ‘padded room’ - and the retired postmaster recalls a dispute involving another group who lived in the house before the Silver Sisterhood arrived - a cult known as ‘The Screamers’. A local woman reveals why she had a unique reason to visit the house, an experience she has never forgotten – and Conor decides to make contact with the enigmatic former headmistress of St Brides, but she is known for being elusive. Will she respond? Produced and presented by Conor McKay Executive Editor: Andy Martin A BBC Northern Ireland Production",
      "release": "2022-10-22T11:00:00Z",
      "duration": "00:19:47.3640000",
      "explicit": false,
      "spotifyId": "6qSpztbXpVSZB5YTEB49pe",
      "appleId": 1000583519545,
      "subjects": [
        "Silver Sisterhood",
        "The Screamers"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6qSpztbXpVSZB5YTEB49pe",
        "apple": "https://podcasts.apple.com/podcast/episode-3-a-flash-in-the-dark/id1540321271?i=1000583519545"
      }
    },
    {
      "id": "332ad1ac-8dd8-4e9b-adfc-d9389acb4e86",
      "title": "Episode 4: The Headmistress",
      "description": "Ireland, 1984. St Brides School for young ladies opens its doors in the quiet fishing village of Burtonport, county Donegal - but all is not as it seems. Patrick in Burtonport recalls visiting the house to photograph images of the Silver Sisterhood’s new computer game, The Secret of St Brides - but he is surprised by what he finds inside. Conor finally makes contact with the mysterious headmistress of St Brides School and she agrees to talk about her time in Burtonport – what can she reveal about the Silver Sisters time in the house? Produced and presented by Conor McKay Executive Editor: Andy Martin A BBC Northern Ireland Production",
      "release": "2022-10-22T11:00:00Z",
      "duration": "00:20:43.8930000",
      "explicit": false,
      "spotifyId": "4g6HLR9VYbbfFEFnlzZmmj",
      "appleId": 1000583519544,
      "subjects": [
        "Silver Sisterhood",
        "The Screamers"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4g6HLR9VYbbfFEFnlzZmmj",
        "apple": "https://podcasts.apple.com/podcast/episode-4-the-headmistress/id1540321271?i=1000583519544"
      }
    },
    {
      "id": "43dd77c2-a342-4c9d-92d9-65b89bb2bc4b",
      "title": "Episode 5: The Maid",
      "description": "Ireland, 1984. St Brides School for young ladies opens its doors in the quiet fishing village of Burtonport, county Donegal - but all is not as it seems. The headmistress discusses the philosophy behind the Silver Sisterhood’s computer games and explores their complicated relationship with physical discipline – which they feel was misunderstood by the outside world. A young student finds a strange book in her local bookshop and decides to visit the Silver Sisters in Donegal. Produced and presented by Conor McKay Executive Editor: Andy Martin A BBC Northern Ireland Production",
      "release": "2022-10-22T11:00:00Z",
      "duration": "00:22:56.7190000",
      "explicit": false,
      "spotifyId": "6hWRKIRo7ET5Eds6kavNEM",
      "appleId": 1000583519596,
      "subjects": [
        "Silver Sisterhood",
        "The Screamers"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6hWRKIRo7ET5Eds6kavNEM",
        "apple": "https://podcasts.apple.com/podcast/episode-5-the-maid/id1540321271?i=1000583519596"
      }
    },
    {
      "id": "cd5a76b5-11fa-424a-a720-30c7d57067b9",
      "title": "Episode 6: The Maze",
      "description": "Ireland, 1984. St Brides School for young ladies opens its doors in the quiet fishing village of Burtonport, county Donegal - but all is not as it seems. As the maid starts her new life at Brides, she finds the work physically demanding but spiritually rewarding. However, when a much-loved house keeper leaves the community, the maid soon becomes unhappy and decides to leave – but events take a dark turn. After a court case and a dispute over ownership of the house, the Silver Sisterhood leave Burtonport – where do they go, and what happens to the mysterious headmistress? Produced and presented by Conor McKay Executive Editor: Andy Martin A BBC Northern Ireland Production",
      "release": "2022-10-22T11:00:00Z",
      "duration": "00:23:05.7590000",
      "explicit": true,
      "spotifyId": "40MDOk0F53o4j1mha3GDnF",
      "appleId": 1000583519644,
      "subjects": [
        "Silver Sisterhood",
        "The Screamers"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/40MDOk0F53o4j1mha3GDnF",
        "apple": "https://podcasts.apple.com/podcast/episode-6-the-maze/id1540321271?i=1000583519644"
      }
    }
  ]
}