{
  "id": "743e0760-5600-43c2-b235-a244a2f2aa6b",
  "name": "audiobooks",
  "youTubeChannelId": "UCtwzSX-6VNc0edg33NPP0LA",
  "episodes": [
    {
      "id": "e3e7489a-2470-4ab4-83bc-f454f2415b51",
      "title": "Misguided: My Jesus Freak Life In a Doomsday Cult by Perry Bulwer",
      "description": "Please visit https://thebookvoice.com/podcasts/1/audiobook/818881 to listen full audiobooks.\nTitle: Misguided: My Jesus Freak Life In a Doomsday Cult\nAuthor: Perry Bulwer\nNarrator: Kyle Snyder\nFormat: Unabridged Audiobook\nLength: 11 hours 51 minutes\nRelease date: August 27, 2024\nGenres: Memoirs\nPublisher\u0027s Summary: \nIn 1972, Perry Bulwer, a naive sixteen-year-old growing up in Port Alberni, a mill town on Vancouver Island, dropped out of high school to run away with the Children of God, one of a number of millennial Christian cults that sprang up in the 1960s and 1970s. Bulwer takes the listener on an extraordinary trip through the world of biblical literalism, fundamentalist endtime fantasies, paranormal spirituality, evangelical extremism, ritual abuse, and liberally interpreted Biblical teachings that were used to justify licentious sexual doctrines, evangelical prostitution, and child sexual abuse. We learn about the inner workings of the CoG, aka The Family, and the machinations of David Berg, a self-declared endtime prophet. Berg died in 1994, before various law enforcement agencies around the world caught up with him. Perry Bulwer escaped The Family in 1991, managing to escape the cult\u0027s tight control while living in Asia. Returning to Canada, he tried to pick up his life where he had left it off two decades earlier. Through education Bulwer lost his religion, turning from religious extremist to secular humanist lawyer, fighting for the rights of sex workers and drug users living on the streets of Vancouver. Haunted by his own past, Bulwer became an advocate for thousands of second-generation survivors of the cult\u0027s child abuse and psychological trauma.",
      "release": "2024-12-13T08:45:53Z",
      "duration": "00:30:05",
      "explicit": false,
      "youTubeId": "zmHk8S1lcS0",
      "subjects": [
        "Children Of God",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zmHk8S1lcS0"
      }
    }
  ]
}