{
  "_ts": 0,
  "id": "c7e28cda-173d-4488-8bd8-7e4edb669e57",
  "name": "audiobooks free",
  "youTubeChannelId": "UCITiquQDZYwbbNUWh4cxtNA",
  "episodes": [
    {
      "id": "94eb0175-42aa-43ef-ad8f-f88fcf0aff8c",
      "title": "Sex Cult Nun: Breaking Away from the Children of God, a Wild, Radical Religious Cult by Faith Jones",
      "description": "Please visit https://thebookvoice.com/podcasts/1/audiobook/509161 to listen full audiobooks.\nTitle: Sex Cult Nun: Breaking Away from the Children of God, a Wild, Radical Religious Cult\nAuthor: Faith Jones\nNarrator: Jaime Lamchick\nFormat: Unabridged Audiobook\nLength: 13 hours 11 minutes\nRelease date: November 30, 2021\nRatings: Ratings of Book: 3.8 of Total 5 \n Ratings of Narrator: 5 of Total 1\nGenres: Memoirs\nPublisher\u0027s Summary: \nEducated meets The Vow in this story of liberation and self-empowerment—an inspiring and stranger-than-fiction memoir of growing up in and breaking free from the Children of God, an oppressive, extremist religious cult. Faith Jones was raised to be part a religious army preparing for the End Times. Growing up on an isolated farm in Macau, she prayed for hours every day and read letters of prophecy written by her grandfather, the founder of the Children of God. Tens of thousands of members strong, the cult followers looked to Faith’s grandfather as their guiding light. As such, Faith was celebrated as special and then punished doubly to remind her that she was not. Over decades, the Children of God grew into an international organization that became notorious for its alarming sex practices and allegations of abuse and exploitation. But with indomitable grit, Faith survived, creating a world of her own—pilfering books and teaching herself high school curriculum. Finally, at age twenty-three, thirsting for knowledge and freedom, she broke away, leaving behind everything she knew to forge her own path in America. A complicated family story mixed with a hauntingly intimate coming-of-age narrative, Faith Jones’ extraordinary memoir reflects our societal norms of oppression and abuse while providing a unique lens to explore spiritual manipulation and our rights in our bodies. Honest, eye-opening, uplifting, and intensely affecting, Sex Cult Nun brings to life a hidden world that’s hypnotically alien yet unexpectedly relatable.",
      "release": "2024-12-06T12:53:20Z",
      "duration": "00:05:05",
      "explicit": false,
      "youTubeId": "uBoYVyib2bc",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uBoYVyib2bc"
      }
    }
  ]
}