{
  "_ts": 0,
  "id": "d7725472-b92d-4201-9082-1b4335e409f7",
  "name": "Auntie Jessie",
  "youTubeChannelId": "UCFPNv18Lt1-nDB2VFYbtIOA",
  "episodes": [
    {
      "id": "50b1aece-4833-4f5a-a913-81c2499e5d4c",
      "title": "BATSHIT!  Uncle Steve reacts to cult wikipedia article",
      "description": "⋆｡˚🪼🫧˚｡⋆ Thank you guys for all that you do.  Your visits to our Live Chat, your views and likes, and your vibes. You’ve made this channel into something... special. Something… alive. If you haven’t yet subscribed, you might as well because the algorithms know you’re here already.\n\nIf you want to become a member of my channel please choose from the following:\n\nDank Pirates: $1 - access to the private shows in discord and the ability to interact through chat-text\nCosmic Sailors: $4- access to private shows in discord and the ability to interact through chat text and VOICE\nBoglims:  $8- access to the private shows in discord and the ability to interact through chat text, voice, and VIDEO.\nPearls:  $24- all of the above and the choice to be an exclusive guest/cohost wherein only you and i will be talking with voice/video.  if you want this feature, you\u0027ll have to schedule it.  Could be debates, could be an interview, etc.\n\nCashApp: $jessiepearllabrie\nVenmo: @jessie-labrie-1\nhttps://streamlabs.com/jessiepearllabrie/tip\n\n📧 Should you find yourself needing to reach me, please do so at: jessiepearllabrie@gmail.com. \n\n🪐If you are interested in the spiritual advisory work I do, please explore my website: auntiejessie.com  \n\nI design t-shirts and other merch at highstakesmerch.com\n\n💌 For those who wish to communicate through the ancient art of snail mail, you may address your letters, poetry, cursed objects or questionable life advice to:\nJessie Labrie\nPO Box 501\nRedlands, CA 92373\n\n🌟 Or indulge me with a gift from my Throne Wishlist. Because Auntie deserves nice things. https://throne.com/jessiepearllabrie\n\n⚠️ Disclaimer:\nWhat you hear in these videos comes from my current understanding, which is to say: subject to change, like the weather. Or reality. Opinions are fleeting, but growth is eternal, and I am always, always evolving. Punk as hell, right?\n\n⚖️ Fair Use Disclaimer:\nFrom time to time, I may utilize copyrighted material under the banner of education, transformation, and good ol\u0027 fashioned fair use. If you think something’s amiss, don’t worry. Reach out, and we’ll set things right—quickly, quietly, before the void notices.\n\nStay curious. Stay strange.\n⚓ Auntie Jessie ⋆｡˚🪼🫧˚｡⋆",
      "release": "2025-02-02T21:24:22Z",
      "duration": "02:31:00",
      "explicit": false,
      "youTubeId": "JBskTTHJWJk",
      "subjects": [
        "Ramtha\u0027s School of Enlightenment"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JBskTTHJWJk"
      }
    }
  ]
}