{
  "_ts": 0,
  "id": "700ec474-6c7b-4b45-8c45-fe696e6c98f7",
  "name": "Australian True Crime",
  "spotifyId": "6qdfc9eJihq4Wj4UglBPIn",
  "appleId": 1217681421,
  "episodes": [
    {
      "id": "14d803d0-769d-4ed7-8253-1f8c498c43e5",
      "title": "Shortcut: Elizabeth Struhs and the Religious Cult Behind Her Death",
      "description": "This is a \u0022Shortcut\u0022 episode. It’s a shortened version of this week’s more detailed full episode, which is also available on our feed. Elizabeth Struhs was just eight years old when she died in 2022 after her parents stopped giving her insulin, following the beliefs of a religious cult called The Saints. Journalist Pippa Bradshaw, who has covered the case from the start, now hosts \u0022The Saints\u0022, a podcast investigating the cult and the institutional failures that led to Elizabeth’s death. Links: Click here to listen to The Saints on Apple Podcasts. Click here to subscribe to ATC Plus on Apple Podcasts and access all ATC episodes early and ad-free, as well as exclusive bonus episodes. Join our Facebook Group here. Do you have information regarding any of the cases discussed on this podcast? Please report it on the Crime Stoppers website or by calling 1800 333 000. For Support: Lifeline on 13 11 14 13 YARN on 13 92 76 (24/7 crisis support phone line for Aboriginal and Torres Strait Islander peoples) 1800RESPECT: 1800 737 732 Blue Knot Helpline: 1300 657 380 CREDITS: Host: Meshel Laurie. You can find her on instagram. Guest: Pippa Bradshaw Executive Producer/Editor: Matthew Tankard GET IN TOUCH: https://www.australiantruecrimethepodcast.com/ Follow the show on Instagram @australiantruecrimepodcast and Facebook Send us a question to have played on the show by recording a voice message here . Email the show at AusTrueCrimePodcast@gmail.com Become a subscriber to Australian True Crime Plus here: https://plus.acast.com/s/australiantruecrime . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-04-28T13:25:49Z",
      "duration": "00:24:39.4180000",
      "explicit": false,
      "spotifyId": "60GSZkmYOoeW4ijtCTdlU4",
      "appleId": 1000705262458,
      "subjects": [
        "The Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/60GSZkmYOoeW4ijtCTdlU4",
        "apple": "https://podcasts.apple.com/podcast/shortcut-elizabeth-struhs-and-the-religious-cult/id1217681421?i=1000705262458"
      }
    },
    {
      "id": "7bcd861a-79d8-43c6-99a6-b0a7d589cf1a",
      "title": "Elizabeth Struhs and the Religious Cult Behind Her Death",
      "description": "Elizabeth Struhs was just eight years old when she died in 2022 after her parents stopped giving her insulin, following the beliefs of a religious cult called The Saints. \nJournalist Pippa Bradshaw, who has covered the case from the start, now hosts \u0022The Saints\u0022, a podcast investigating the cult and the institutional failures that led to Elizabeth’s death.\nLinks:\nClick here to listen to The Saints on Apple Podcasts. \nClick here to subscribe to ATC Plus on Apple Podcasts and access all ATC episodes early and ad-free, as well as exclusive bonus episodes. \nJoin our Facebook Group here.\nDo you have information regarding any of the cases discussed on this podcast? Please report it on the Crime Stoppers website or by calling 1800 333 000.\nFor Support: \nLifeline  on 13 11 14\n13 YARN on 13 92 76 (24/7 crisis support phone line for Aboriginal and Torres Strait Islander peoples)\n1800RESPECT: 1800 737 732\nBlue Knot Helpline: 1300 657 380\nCREDITS:\nHost: Meshel Laurie. You can find her on instagram.\nGuest: Pippa Bradshaw\nExecutive Producer/Editor: Matthew Tankard\nGET IN TOUCH:\nhttps://www.australiantruecrimethepodcast.com/\nFollow the show on Instagram @australiantruecrimepodcast and Facebook \nSend us a question to have played on the show by recording a voice message here.\nEmail the show at AusTrueCrimePodcast@gmail.com \n Become a subscriber to Australian True Crime Plus here: https://plus.acast.com/s/australiantruecrime.\n\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-04-28T13:25:32Z",
      "duration": "00:42:58",
      "explicit": false,
      "spotifyId": "67HMGVXJmjLbYXhIGZl4Tn",
      "appleId": 1000705260235,
      "subjects": [
        "The Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67HMGVXJmjLbYXhIGZl4Tn",
        "apple": "https://podcasts.apple.com/podcast/elizabeth-struhs-and-the-religious-cult-behind-her-death/id1217681421?i=1000705260235"
      }
    }
  ]
}