{
  "id": "928abaa8-cef0-44f1-aaed-465b0a9bb2a9",
  "name": "Austranged",
  "spotifyId": "3YFiyS2d1leD4a23zXkxJW",
  "appleId": 1761555411,
  "episodes": [
    {
      "id": "653c94eb-7f0a-45ee-8290-bc16dc1d2998",
      "title": "Unseen, Unheard, Unknown",
      "description": "Across pop culture we have seen and heard the rise and fall of many different types of cults. From new age religious groups to extreme political parties to even some self-help clubs, we are naturally curious as to what goes on behind the fence of cult groups and how people fall victim to the likes of Jim Jones and Shoko Asahara. In this episode and season finale, join the gang as they uncover how cults function and as they go into the details of one of Australia\u0027s most famous cults, The Family. Warning this episode contains themes of physical and emotional abuse and discusses domestic violence and coercive control. Your mental health is important, and Australia is home to many support services. You are not alone, and you are worthy, if you feel that you need to talk to someone, please consider reaching out to one of the services listed below: - Beyond Blue - 1300 22 4636 - lifeline - 13 11 14 - Black Dog Institue - MensLine Australia - 1300 78 99 78 - Kidshelpline - 1800 55 1800 Content references Growing up with The Family: inside Anne Hamilton-Byrne’s sinister cult | Documentary films | The Guardian Australian cult: The Family leader Anne Hamilton-Byrne dies (bbc.com) The Family (arcgis.com) Tragic update from The Family ‘cult’ survivor | news.com.au — Australia’s leading news site The Cult of the Family review – the definitive history of a notorious Australian cult | Documentary | The Guardian \u0027I\u0027m still alive\u0027: Cult survivor speaks about life beyond Anne Hamilton-Byrne (theage.com.au) Sale link to The Cult of the Family | Gippsland Times Anne Hamilton-Byrne dies; We remember the 1987 raid on the cult, The Family with this flashback (theage.com.au) The Family: \u0027Raised in a doomsday cult, I entered the real world at 15\u0027 (bbc.com) THE PSYCHOLOGY OF THE CULT EXPERIENCE - The New York Times (nytimes.com) The Cultic Lifecycle: A Thematic Analysis of Fulfillment and Fear in Cult Membership (cuny.edu) Send us a text This episode of Austranged is hosted, produced and edited by Cal, Dave, Rachel and Stevo. Opening song, \u0027Shivers in the Shadows\u0027 is composed by Victor Lundberg. To find out more about Austranged please visit our Instagram page here .",
      "release": "2024-10-08T10:00:00Z",
      "duration": "01:04:57.2860000",
      "explicit": true,
      "spotifyId": "1qqVLozipP8G3VE75DPrip",
      "appleId": 1000672203659,
      "subjects": [
        "Santiniketan Park Association",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1qqVLozipP8G3VE75DPrip",
        "apple": "https://podcasts.apple.com/podcast/unseen-unheard-unknown/id1761555411?i=1000672203659"
      }
    }
  ]
}