{
  "id": "9add0a4d-cb94-4568-834c-2bde9daba2f8",
  "name": "Autism Advocate",
  "spotifyId": "6ojvCLXbaeT2ln7MGg7Rd6",
  "appleId": 1625125307,
  "episodes": [
    {
      "id": "4fa6373d-7d02-49f2-b2c7-d9aaae26ab0a",
      "title": "Specifics of Cult Psychology, Dallas Dance Collective:  How Often Autistic People are Exploited and Assaulted",
      "description": "In this episode, I shared my heartbreaking experience with accidentally joining a cult, leaving a cult, and the red flags associated in general with cults. Dallas Dance Collective / Ecstatic Dance Dallas is NOT a safe organization allowing people to dance. It is a cult that has sexually assaulted women countless times in the past. It is an organization that people use to violate women, people, and ignore boundaries. I discuss specifics about the man who touched my inner thigh, the other instances of red flags in this organization, and what you can do to protect yourself against sexual assault and cult dynamics. When I was trapped in this cult, it was like I became a completely different person who could only echo the beliefs of the group. I am autistic \u0026 autistic people are typically resistant to group think scenarios. I naively thought the organization was solely for dancing. I did not realize how many people AND organizations are interested in harming me. That is how compelling and harmful cults are, and it can happen to anyone. Some of the red flags I discuss are: bystanders - someone sees someone else touching you against your consent and doing nothing people making up fake names to prevent personal accountability people banning the usage of cameras to prevent evidence from being collected against them people who violate boundaries by touching you against your consent people who use overly spiritual language without clarification people who use drum beats / trance like music to put you into a subconsciously receptive state in order to manipulate you to push their agendas organizations who request money very often \u0026 try to guilt trip anyone who does not donate people who lock the doors past a certain time people who know you are in a committed relationship, yet continue to convince you to do other things you are not comfortable with people who try to convince you to divorce your husband for a sex fling random people coming up to you massaging you people who groom beautiful women people who attempt to use people\u0027s insecurities against them Cult Dynamics: Absolute obedience - you must agree with us or else isolation - you can only hang out with members of the group Charismatic leader - leader will say whatever they have to say to obtain more members of the group to give them more power Financial exploitation Manipulative or recruitment tactics - commonly features love bombing, giving new members lots of attention to retain members before ignoring anyone who does not fit the agenda Us vs Them - anyone who disagrees with be punished Control over information Extreme behavior or beliefs Exploitation of members - cults may exploit members for sexual favors or other personal gain emotional manipulation - \u0022Questioning the leader\u0027s teachings is a sign of spiritual immaturity\u0022, \u0022Only the leader knows what\u0027s best for you\u0022 Other red flag phrases, copy pasted from actual messages sent to me: \u0022We curate creative containers to support embodied connection.\u0022 -\u003E \u0022we don\u0027t value personal bodily autonomy\u0022 \u0022this is a safe container for self expression\u0022 -\u003E Safety that needs to be stated isn\u0027t real safety. The more someone emphasizes a situation being safe, the more skeptical you should be that it is unsafe. \u0022I don\u0027t have a job, I\u0027m just blessed\u0022 -\u003E \u0022I may or may not be hosting a prostitution sex ring for 60$ a person\u0022 \u0022Rest into this co-creation\u0022 -\u003E we value the groupthink over your personal critical thinking \u0022step into the sacred circle and leave your earthly concerns behind\u0022 -\u003E we want you in a subconsciously receptive state so you will be easier to manipulate \u0022surrender to the divine flow without question\u0022 -\u003E we do not welcome critical thinkers here \u0022I am dedicated to keeping things safe\u0022 (while allowing men and women to remain in the organization who have harmed people) -\u003E \u0022I don\u0027t care about your personal struggles, I don\u0027t value personal boundaries\u0022 \u0022Feeling a lightening heart today, how are you beautiful human?\u0022 -\u003E \u0022I am trying to boost your ego in order to keep you in line with my personal agenda\u0022 \u0022I will heighten my awareness for these two individuals\u0022 -\u003E \u0022I am unwilling to take action to kick these two people out. I need to fake you into thinking I care about this to try to keep you in the group. However, these two people are paying customers and I won\u0027t kick them out because our business model depends on people who are horny\u0022 \u0022Bringing new blueprints to us all, shifting the paradigms with a lot of curiosity, play, and grace\u0022 -\u003E \u0022This is an effort by me to make you feel connected to part of this group regardless of how we treat you \u0022purifying and honing the intentions just like we do on the dance floor\u0022 -\u003E continuing to push my own religious agenda while you are in a subconsciously receptive state \u0022My philosophy is rooted in creating SAFETY in a field so people can get HONEST experience BRAVERY then hopefully access the states of FREEDOM, UNITY, and WHOLENESS, that are the deep human longings \u0026#43; birth rights\u0022 -\u003E \u0022we want to convince you that our organization embodies the values of everything in capitalization because we don\u0027t but we need to fool people into thinking we do so that they can become paying customers. Additionally, we will do whatever we can to transform your current beliefs into hyper religiosity and if you dare to disagree we will guilt trip, isolate, and harm you.\u0022 \u0022I am satisfied with our energy exchange\u0022 - common manipulative tactic to try to trigger abandonment trauma to get you to come back Long story short. Actions define our patterns which can become our reality. When someone takes actions that indicate that they do not care about respecting boundaries: Trust the patterns. Get out. Help is available.",
      "release": "2024-04-14T13:00:00Z",
      "duration": "00:55:42.2090000",
      "explicit": true,
      "spotifyId": "6wkM87IRp205Maazd0zORZ",
      "appleId": 1000652391565,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6wkM87IRp205Maazd0zORZ",
        "apple": "https://podcasts.apple.com/podcast/specifics-of-cult-psychology-dallas-dance-collective/id1625125307?i=1000652391565"
      }
    }
  ]
}