{
  "id": "74d1a191-be0b-41f4-ab3e-aa4a407fd18d",
  "name": "Awaken to Freedom",
  "spotifyId": "2uUNtNxrBMn2FwMGYwgmY4",
  "youTubeChannelId": "UCsFKdyJwjygw0qZ9abQSEGA",
  "episodes": [
    {
      "id": "2b8fe516-d862-4a44-bdc5-584aa0fb1f0d",
      "title": "Leaving the LDS Church: Sally Dutton\u0027s Spiritual Awakening!",
      "description": "From her upbringing in the LDS Church to a powerful spiritual awakening, Sally\u0027s story includes her vision to step away from organized religion and develop a personal relationship with God. \nWhile I believe in creating space for people to speak their truth, I want to clarify that this episode is not meant to promote any specific religious agenda. I may not share all of Sally\u0027s views, but I respect her right to share them. My hope is that listeners approach this conversation with openness, knowing that spiritual journeys are deeply individual, and there\u0027s no one size fits all path to your truth. \n\nIn this episode, Sally Dutton shares her profound journey from growing up in the LDS church to experiencing a spiritual awakening that led her to publicly oppose church leadership. She emphasizes the significance of her developing a personal relationship with God beyond organized religion, encouraging others to embrace their spiritual journey and seek their own truth.",
      "release": "2025-07-31T14:30:43Z",
      "duration": "01:24:14",
      "explicit": false,
      "youTubeId": "sg7c7WKoHI0",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sg7c7WKoHI0"
      }
    },
    {
      "id": "fcb78005-0b01-4d36-b161-4683453bc9b5",
      "title": "PART 2 From Witness to Warrior, Shannon\u0027s Story of Survival",
      "description": "* CW this episode contains sensitive topics of abuse. Viewer discretion is advised.***Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nEpisode 17 \n\nPART 2 \nShannon Avery Briggs shares a profound journey of resilience through religious trauma, domestic violence and personal growth. She recounts her experiences with Jehovah\u0027s Witnesses, the challenges of an abusive relationship, her path to self discovery and healing. Shannon discusses the importance of seeking help, the impact of counselling, and her journey through cancer, ultimately leading to a deeper understanding of herself and her emotional health This conversation highlights the significance of community support and the ongoing journey of empowerment and recovery. Shannon\u0027s Book, Triumph over Darkness: My Journey  is available under recommended reads at www.awakentofreedom.ca  If you would like to work with Shannon,  please visit the professional resources page at www.awakentofreedom.ca",
      "release": "2025-07-25T00:58:59Z",
      "duration": "00:39:50",
      "explicit": false,
      "youTubeId": "3m6yTGsqyhI",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3m6yTGsqyhI"
      }
    },
    {
      "id": "c026126a-577c-4ebb-ac71-b2c57466566c",
      "title": "From Witness to Warrior - Shannon\u0027s story of Survival PART 1",
      "description": "* CW this episode contains sensitive topics of abuse. Viewer discretion is advised.***Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nEpisode 16\n\nShannon Avery Briggs shares a profound journey of resilience through religious trauma, domestic violence and personal growth. She recounts her experiences with Jehovah\u0027s Witnesses, the challenges of an abusive relationship, her path to self discovery and healing. Shannon discusses the importance of seeking help, the impact of counselling, and her journey through cancer, ultimately leading to a deeper understanding of herself and her emotional health This conversation highlights the significance of community support and the ongoing journey of empowerment and recovery. Shannon\u0027s Book, Triumph over Darkness: My Journey  is available under recommended reads at www.awakentofreedom.ca  If you would like to work with Shannon,  please visit the professional resources page at www.awakentofreedom.ca",
      "release": "2025-07-23T14:30:20Z",
      "duration": "01:08:21",
      "explicit": false,
      "youTubeId": "EiqJ-UHmk-Q",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EiqJ-UHmk-Q"
      }
    },
    {
      "id": "6aebf971-9f70-484b-b20d-9104c289974d",
      "title": "No Turning Back: Escaping Toxicity and Embracing Self-Love with Masako",
      "description": "Episode 15\n **Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nWhat happens when the people who raised you are the ones you need to escape in order to heal? In this episode I sit down with Masako, a coach trained by Brandon Buchard, who shares her courageous journey from a deeply toxic childhood to becoming a fierce advocate for women\u0027s empowerment and personal transformation. This conversation is a love letter to anyone who has had to choose themselves over their family, who has wrestled with guilt and grief in the pursuit of healing, and who is learning that self love isn\u0027t selfish, it\u0027s survival.\nIf you would like to work with Masako, you can reach her through her Facebook page \n\nhttps://www.facebook.com/profile.php?id=100009228593803\n\nIf you are a woman who has a story to tell, and would like to be a guest on this podcast, visit www.awakentofreedom.ca",
      "release": "2025-07-10T14:30:27Z",
      "duration": "00:14:26.8470000",
      "explicit": false,
      "spotifyId": "0nW0Ejz2kuaTFGajCerCW5",
      "youTubeId": "e0e2AGOop8Q",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nW0Ejz2kuaTFGajCerCW5",
        "youtube": "https://www.youtube.com/watch?v=e0e2AGOop8Q"
      }
    },
    {
      "id": "6bda8a97-08ba-4f05-8152-8936fb21a088",
      "title": "How to spot a Con Artist - What every woman should know before dating online - Shelly Galloway\u0027s Story",
      "description": "* CW this episode contains sensitive topics of violence and abuse. Viewer discretion is advised.*\n **Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nEpisode 14\n\nShelley shares her harrowing experience of being in a relationship with a con artist, detailing the emotional and physical abuse she endured. She recounts the challenges of uncovering the truth about her partner\u0027s deceitful life, the fear she lived in during their relationship, and the lengthy custody battle that followed the birth of their child. Shelley emphasizes the importance of vigilance in online dating and offers advice to other women to protect themselves from similar situations. Her story is one of resilience and hope, encouraging others to seek help and recognize the signs of manipulation and abuse.\n\nChapters\n\n00:00 Introduction to Shelly\u0027s Journey\n00:45 Unraveling the Relationship\n02:52 The Dark Reality of Deception\n05:56 The Investigation Unfolds\n07:55 Living in Constant Fear\n11:12 The Courtroom Battle Begins\n19:52 The Supreme Court Showdown\n25:33 The Aftermath and Custody Decision\n31:14 Life After the Storm\n34:15 Navigating Complex Family Dynamics\n37:04 Safety Precautions in Online Dating\n42:07 The Impact of Technology on Scams\n46:42 Empowering Women Against Scams\n\n\nIf you are a woman who has a story to tell and would like to be a guest on this podcast, please visit www.awakentofreedom.ca",
      "release": "2025-07-03T14:30:46Z",
      "duration": "00:54:40.3060000",
      "explicit": false,
      "spotifyId": "44aFhyN53HRC6kayPhqpx6",
      "youTubeId": "wqKXQsoSpIA",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/44aFhyN53HRC6kayPhqpx6",
        "youtube": "https://www.youtube.com/watch?v=wqKXQsoSpIA"
      }
    },
    {
      "id": "4679ef6d-9fe1-486e-a0ce-1e82d61f8e3f",
      "title": "From Haunted House to High Control Hell: Mandy\u0027s Cult Survival Story",
      "description": "* CW this episode contains sensitive topics of suicide and abuse. Viewer discretion is advised.*\n **Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nEpisode 12\n\nIn this powerful episode of Awakened to Freedom, host Jada interviews Mandy Valadez who shares her chilling journey into and out of the Potter\u0027s House Christian Fellowship, a high-control cult she unknowingly entered at just 16 after attending what seemed like a harmless Halloween haunted house. What followed was 17 years of deep psychological manipulation, spiritual abuse and isolation from the outside world. Mandy opens up about the insidious tactics used to control her mind, the fear based theology that kept her trapped and the moment she finally said enough. This conversation dives into the gritty realities of cult life, the trauma of waking up, and the courage it takes to rebuild your identity from the ground up. Whether you\u0027re a fellow survivor or simply curious about how someone can get pulled into and escape a religious cult, Mandy\u0027s story is a raw eye-opening and ultimately empowering ride. \nIf you would like to work with Mandy, visit www.divine mandyoracle.com",
      "release": "2025-06-19T14:30:29Z",
      "duration": "00:54:33",
      "explicit": false,
      "spotifyId": "16mWDY2zd1WsN0MYuUOxnu",
      "youTubeId": "nR2RVqjzYAU",
      "subjects": [
        "Potter\u0027s House Christian Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/16mWDY2zd1WsN0MYuUOxnu",
        "youtube": "https://www.youtube.com/watch?v=nR2RVqjzYAU"
      }
    },
    {
      "id": "c25a9aeb-5d6c-475f-85ef-bcee92c3930f",
      "title": "PART 2  My Family Woke Me Up! How I left the Jehovah\u0027s Witness Organization - Deanna\u0027s Story",
      "description": "Welcome to Episode 11\n*CW This episode contains sensitive subjects and is for mature audiences.\n **Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nIn PART 2 of this episode of Awaken to Freedom, host Jada interviews Deanna June from the Youtube Channel Just June https://youtube.com/@justdeannajune?si=Ckd4J3_z78PwhBzw\nIn this conversation, Deanna shares her personal journey of awakening from the Jehovah\u0027s Witnesses, detailing her struggles with alcoholism, mental health, and the impact of disfellowshipping. She reflects on her experiences in rehab, the dynamics within her family, and the gradual realization of the organization\u0027s issues. Deanna emphasizes the importance of self-discovery and the challenges faced in navigating life after rehab, including the dissolution of her congregation and the support (or lack thereof) from her community. In this conversation, she shares her personal journey of recovery from alcoholism, detailing her experiences with support (or lack thereof) from her congregation after rehab, the complexities of family dynamics, and the importance of finding the right recovery program. Deanna emphasizes the need for genuine encouragement and understanding in the recovery process, as well as the significance of being true to oneself after leaving a controlling organization. Deanna\u0027s story serves as an inspiration for others facing similar challenges, highlighting the diverse paths to healing and self-discovery.\n\nChapters\n00:00 Awakening to Freedom: Introduction and Context\n01:05 The Impact of Disfellowshipping and Public Reproval\n02:47 Struggles with Alcoholism and Mental Health\n06:13 The Journey Through Rehab and Family Dynamics\n12:01 Confronting the Truth: Discovering the Reality of the Organization\n17:50 Rehabilitation and Family Awakening\n24:03 Navigating Life After Rehab and Congregational Changes\n26:26 Navigating Support After Rehab\n39:17 Family Dynamics and Belief Systems\n44:55 The Journey to Recovery and Self-Discovery\n\nwww.smartrecovery.org\n\nIf you are a woman who has a story to tell and would like to be a guest on this podcast, please visit www.awakentofreedom.ca",
      "release": "2025-06-12T14:30:20Z",
      "duration": "00:52:20",
      "explicit": false,
      "spotifyId": "1cnv5KigncX47ej0ISaxqr",
      "youTubeId": "Gl9DxrAtxVg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cnv5KigncX47ej0ISaxqr",
        "youtube": "https://www.youtube.com/watch?v=Gl9DxrAtxVg"
      }
    },
    {
      "id": "2fbfe0b6-a294-4fb2-ab27-2b9e8555a3a6",
      "title": "My Family Woke Me Up! How I left the Jehovah\u0027s Witness Organization - Deanna\u0027s Story PART 1",
      "description": "Welcome to Episode 10\n*CW This episode contains sensitive subjects and is for mature audiences.\n **Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nPart 1\nIn this episode of Awakened to Freedom, host Jada interviews Deanna June from the Youtube Channel Just June https://youtube.com/@justdeannajune?si=Ckd4J3_z78PwhBzw\nIn this conversation, Deanna June shares her profound journey from being raised in the Jehovah\u0027s Witness organization to finding peace and sobriety after leaving. She discusses her traumatic childhood experiences, the challenges of growing up in a strict religious environment, and the impact of her father-in-law\u0027s dark legacy on her family. Deanna\u0027s story highlights the struggles of navigating life after leaving a high-control group and the importance of personal growth and healing. In this conversation, Deanna June shares her journey through creative aspirations, struggles with bipolar disorder, and the impact of alcohol on her life and family. She reflects on her early life, the introduction to alcohol, and the challenges of being a Jehovah\u0027s Witness, including the practice of disfellowshipping.\n\nChapters\n\n00:00 Introduction to Deanna June\u0027s Journey\n01:56 Growing Up as a Jehovah\u0027s Witness\n06:03 Traumatic Experiences in the Organization\n11:59 Marriage and Family Dynamics\n19:46 The Dark Legacy of Deanna\u0027s Father-in-Law\n30:01 Navigating Life After Leaving the Organization\n33:15 Creative Aspirations and Early Life Challenges\n37:25 The Introduction to Alcohol and Its Consequences\n38:28 Questioning Beliefs and Disfellowshipping Practices\n42:11 The Impact of Alcohol on Family Dynamics",
      "release": "2025-06-05T14:30:47Z",
      "duration": "00:55:46",
      "explicit": false,
      "spotifyId": "1cK24uE89OVYbZEHt0SqeS",
      "youTubeId": "zHi5hz-LzFs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cK24uE89OVYbZEHt0SqeS",
        "youtube": "https://www.youtube.com/watch?v=zHi5hz-LzFs"
      }
    },
    {
      "id": "3bba7a47-3e7e-4386-a948-2bcedfc5559b",
      "title": "From Pain to Peace - Growing up in a cult environment -Jackie\u0027s Story",
      "description": "Jada interviews Jackie Grillen, an expert in emotional trauma and abuse. Jackie shares her personal journey from pain to peace, detailing her childhood experiences, the impact of growing up in a household influenced by cult-like dynamics, and her struggles with identity and belonging. She discusses her path to healing through sobriety and her eventual transition into counseling and coaching, emphasizing the importance of integrating spirituality into the healing process. Jackie\u0027s story is one of resilience, empowerment, and the quest for personal freedom. In this conversation Jackie encourages listeners to embrace their unique paths and offers insights on personal growth and empowerment.\n\nIf you would like to work with Jackie, please email her at jackieinspires.com",
      "release": "2025-05-29T14:30:41Z",
      "duration": "00:27:45",
      "explicit": false,
      "spotifyId": "6XZ7tHvoCw5md5afmuTg3F",
      "youTubeId": "twn7UiOtFD0",
      "subjects": [
        "Family Cult",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6XZ7tHvoCw5md5afmuTg3F",
        "youtube": "https://www.youtube.com/watch?v=twn7UiOtFD0"
      }
    },
    {
      "id": "4d3a4002-0716-4550-83f3-c565a572ea45",
      "title": "Finding my freedom by leaving the Jehovah’s Witness organization - Angie’s story",
      "description": "**Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nWelcome to Episode 8 In this inspiring conversation, Angie Watson shares her journey of resilience and empowerment after leaving the Jehovah\u0027s Witnesses. She discusses her struggles with cancer, the challenges of growing up in a high-control environment, and her determination to pursue education and help others. Angie emphasizes the importance of personal growth and offers words of encouragement for those seeking freedom from abusive relationships and controlling beliefs.\n\nAngie is a dedicated trauma-informed counsellor with a Bachelor of Arts in Child and Youth Care and multiple diplomas in healthcare, social work, and counselling. Her professional journey is profoundly informed by her personal experiences, including her resilience in overcoming ovarian cancer, navigating a challenging, high-control religious upbringing, and enduring a 20-year abusive marriage. This unique perspective enables Angie to offer deep empathy and insight in her practice.\n\nShe specializes in providing mid-range psychotherapy for women who are on their healing journey from childhood abuse, sexual assault, and interpersonal violence. In addition to her counselling work, Angie is actively engaged in education and advocacy efforts to raise awareness and support those affected by violence. If you would like to contact or work with Angie please email\nthestrengthwithin.u@ gmail.com\n\nChapters\n\n00:00 Journey Through Illness and Resilience\n01:47 Growing Up in a High-Control Environment\n07:54 Breaking Free from the Jehovah\u0027s Witnesses\n10:51 Navigating Life After Leaving\n16:42 Facing Health Challenges and Education\n22:30 Empowering Others Through Counseling\n30:22 Words of Wisdom for Those Seeking Freedom\n\nIf you are a woman with a story to tell and would like to be a guest on this podcast, please visit www.awakentofreedom.ca \n\n\nIf you are wanting to leave a cult, high control religion, or toxic relationship but are overwhelmed at the next step to take visit www.awakentofreedom.ca for support.",
      "release": "2025-05-22T14:01:07Z",
      "duration": "00:32:32.5000000",
      "explicit": false,
      "spotifyId": "4xty9rfcAdxlzMPKbjxM7z",
      "youTubeId": "ho1g7aoMmds",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xty9rfcAdxlzMPKbjxM7z",
        "youtube": "https://www.youtube.com/watch?v=ho1g7aoMmds"
      }
    },
    {
      "id": "ebd240fe-e4ca-4873-addf-6d8552dd58bd",
      "title": "Episode 7 Breaking the Cycle - Escaping Toxic Relationships - Bridget\u0027s Story",
      "description": "*CW This episode contains sensitive subjects and is for mature audiences.\n **Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nWelcome to episode 7! \nIn this episode of Awakened to Freedom, Jada interviews Bridget Pagna, who shares her harrowing journey through two toxic relationships marked by emotional and physical abuse. Bridget discusses the challenges she faced, the turning points that led her to leave, and her path to healing. She emphasizes the importance of recognizing the signs of abuse and the need for support systems for women in similar situations. Bridget also highlights her commitment to helping others escape domestic violence and the empowerment that comes from sharing one\u0027s story.\n\nBridget speaks of a charity that is close to her heart. In the UK, Refuge is a leading charity providing specialist support for women and children escaping domestic violence, offering safe accommodation, advocacy, and a 24/7 helpline. Visit their website at www.refuge.org.uk to donate today. \n\nIf you or someone you know is trying to leave an abusive relationship, help is available. \nBelow are emergency helpline numbers for women in Canada, the USA, and the UK who need immediate assistance:\n\nCanada:\n•  Assaulted Women’s Helpline: 1-866-863-0511 (24/7, available in up to 154 languages)\n•  Hope for Wellness Helpline (for Indigenous people): 1-855-242-3310 (24/7, available in English, French, Cree, Ojibway, and Inuktitut)\n•  Family Violence Info Line (Alberta): 310-1818 (24/7, call or text)\n•  Kids Help Phone (for youth): 1-800-668-6868 (24/7)\n•  Emergency: Call 911\n\n\nUSA:\n•  National Domestic Violence Hotline: 1-800-799-SAFE (7233) (24/7)\n•  Love Is Respect (for teens): 1-866-331-9474 (24/7)\n•  Crisis Text Line: Text CONNECT to 741741 (24/7)\n•  Emergency: Call 911\n\nUK:\n•  National Domestic Abuse Helpline (run by Refuge): 0808 2000 247 (24/7)\n•  Women’s Aid Live Chat: Available Monday-Friday, 10am-10pm at www.nationaldahelpline.org.uk\n•  Men’s Advice Line (for male victims): 0808 801 0327 (Monday-Friday, 10am-8pm)\n•  National LGBT\u002B Domestic Abuse Helpline (run by Galop): 0800 999 5428 (Monday-Friday, 10am-5pm)\n•  Emergency: Call 999 (if unable to speak, press 55 to signal for help)\nYou are not alone, and there is hope. Reach out for support and take the first step toward safety and healing.",
      "release": "2025-05-15T14:30:37Z",
      "duration": "00:36:36.5140000",
      "explicit": false,
      "spotifyId": "0TnfDfBH2V2GavQy0bth4T",
      "youTubeId": "qZtclwmSm2s",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0TnfDfBH2V2GavQy0bth4T",
        "youtube": "https://www.youtube.com/watch?v=qZtclwmSm2s"
      }
    },
    {
      "id": "76f42c27-8fae-48eb-a769-721299416c87",
      "title": "Episode 6 - Reclaiming Identity: A New Life After Leaving the Jehovah\u0027s Witness Religion - Janelle\u0027s Story",
      "description": "**Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nWelcome to Episode 6! In this episode of Awakened to Freedom, host Jada interviews Janelle Young, who shares her courageous journey of leaving a 22-year marriage and the Jehovah\u0027s Witness community after 45 years. Janelle discusses the challenges she faced, including losing her daughters and friends, the trauma of leaving, and the importance of self-discovery and healing. She emphasizes the need for support systems, therapy, and the strength to rebuild one\u0027s life. Janelle\u0027s story serves as an inspiration for others in similar situations, encouraging them to seek freedom and embrace their true selves.\n\nIf you are a woman who would like to share her story, and would like to be a guest on our podcast, visit www.awakentofreedom.ca",
      "release": "2025-05-08T14:30:17Z",
      "duration": "00:25:22.2530000",
      "explicit": false,
      "spotifyId": "53BO2Hb6NneC311gQP0feZ",
      "youTubeId": "VTf4UZ7tLyg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/53BO2Hb6NneC311gQP0feZ",
        "youtube": "https://www.youtube.com/watch?v=VTf4UZ7tLyg"
      }
    },
    {
      "id": "e9eb437f-3c2b-445f-93b1-f7391e8d3fc1",
      "title": "Episode 5 - Part 3 - Why I Left the Jehovahs Witness Organization - Deanna Moore’s story",
      "description": "**Technical Disclaimer**\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nEpisode 5 is part 3 and the conclusion of Deanna Moore\u0027s story\nIf you haven\u0027t seen parts 1 and 2, you can watch here  \n\nWatch part 1 https://youtu.be/YfxuGLphXFM?si=o7OB7ru58muBDecO\n\nWatch part 2 https://youtu.be/Jj76hgu4hlI?si=34uCi7ILj2_7L_-D\n\nIn this conclusion, Deanna Moore shares her experiences and insights from conducting plant medicine retreats in Ecuador. She discusses the structure of the retreats, which include various plant medicines like psilocybin, ayahuasca, and San Pedro, and emphasizes the importance of personalized healing through NLP. Deanna highlights the intimate and safe environment she creates for participants, allowing for profound healing and transformation. She also shares her personal journey from struggle to success, encouraging listeners to invest in their healing and embrace the possibilities of life.\nIf you would like more information on the plant medicine retreats in Ecuador Deanna offers, you can email her at healingsoulsnlp@gmail.com",
      "release": "2025-05-01T14:30:17Z",
      "duration": "00:16:01.2590000",
      "explicit": false,
      "spotifyId": "0Wj2kSqsJhQIbnkupyqwAw",
      "youTubeId": "ZaO2gKOJzf4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Wj2kSqsJhQIbnkupyqwAw",
        "youtube": "https://www.youtube.com/watch?v=ZaO2gKOJzf4"
      }
    },
    {
      "id": "63806ff8-85c5-4b89-96da-a6c386c0abd0",
      "title": "Episode 4 - Part 2 Deanna Moore’s story- Why I left the Jehovah’s Witness Organization",
      "description": "This is episode 4 of Awaken to Freedom and part 2 of Deanna Moore\u0027s Story\n*****Content Warning - Viewer Discretion is Advised*****\nPlease note that this episode contains topics of abuse . \n \n***Technical Disclaimer***\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n Part 2 In this episode, Deannna Moore shares her harrowing journey from being a Jehovah\u0027s Witness to navigating abusive relationships and custody battles, ultimately finding healing through plant medicine. Her story highlights the struggles of single motherhood, the impact of high control religions, and the transformative power of ayahuasca and psilocybin in her recovery process.",
      "release": "2025-04-24T14:00:23Z",
      "duration": "00:34:31.9610000",
      "explicit": false,
      "spotifyId": "5A5Q8vP0E8DTjxP4E8eZLo",
      "youTubeId": "Jj76hgu4hlI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5A5Q8vP0E8DTjxP4E8eZLo",
        "youtube": "https://www.youtube.com/watch?v=Jj76hgu4hlI"
      }
    },
    {
      "id": "6110a564-18c0-4683-8792-7e9fefe48192",
      "title": "Why I left the Jehovah’s Witness organization – Deanna’s Story Part 1 *CW",
      "description": "*****Content Warning - Viewer Discretion is Advised*****\nPlease note that this episode contains topics of abuse . \n \n***Technical Disclaimer***\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\n\nWelcome to Episode 3 of Awaken to Freedom Deanna Moore\u0027s Story\nThis episode is 1 of 3 parts. \nDeanna Moore shares her profound journey growing up in the Jehovah’s Witness organization, detailing her experiences of indoctrination, marriage, abuse, and the struggles of leaving the faith. She reflects on the psychological impact of her upbringing, the challenges of navigating relationships within the strict confines of the religion, and the journey of rebuilding her life after exiting the cult. Deanna emphasizes the importance of healing and the complexities of identity loss after leaving a high control group. In this episode, Deanna shares her tumultuous journey and challenges of being a Jehovah’s Witness and her eventual path to leaving. ￼\n\nIf you\u0027ve ever felt trapped or are questioning the beliefs you’ve been taught, please consider subscribing. Each week I will upload a new interview and once a month I will have a guest who can provide help and insight into healing from trauma  Hit that like button, and join me on this journey - Let\u0027s awaken to freedom together.",
      "release": "2025-04-17T05:44:49Z",
      "duration": "00:34:33",
      "explicit": false,
      "youTubeId": "YfxuGLphXFM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YfxuGLphXFM"
      }
    },
    {
      "id": "68acce4d-1a17-4b3b-adeb-114fd1850220",
      "title": "Episode 3 Why I left the Jehovahs Witness Organization - Deanna Moore’s story - Part 1",
      "description": "Welcome to episode 3 of Awaken to Freedom. This episode is 1 of 3 parts. In part 1, Deanna Moore shares a profound journey growing up in the Jehovah’s Witness organization, detailing her experiences of indoctrination, marriage, abuse, and the struggles of leaving the faith. She reflects on the psychological impact of her upbringing, the challenges of navigating relationships within the strict confines at the religion, and the journey of rebuilding her life after exiting the cult. Deanna emphasizes the importance of healing in the complexities of identity loss after leaving a high control group. In this journey, Deanna shares her tumultuous journey and challenges of being a Jehovah’s Witness and her eventual path to leaving.",
      "release": "2025-04-17T00:00:00",
      "duration": "00:34:32.6360000",
      "explicit": false,
      "spotifyId": "7uQind0SRuoDsmNgQA3SC8",
      "youTubeId": "YfxuGLphXFM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7uQind0SRuoDsmNgQA3SC8",
        "youtube": "https://www.youtube.com/watch?v=YfxuGLphXFM"
      }
    },
    {
      "id": "65089056-346d-4ca3-9886-c93a116038f5",
      "title": "Episode 2 From Abuse to Empowerment: Tammy\u0027s Story",
      "description": "**Content Warning**\nPlease note that this episode contains topics of abuse and suicide. If you or anyone you know is having suicidal thoughts, please call or text 988. If you are in immediate danger, call 911.\n \n***Technical Disclaimer***\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\nWelcome to episode 2 of Awaken to Freedom.\nIn this powerful conversation, Tammy shares her harrowing journey of escaping a 15-year abusive relationship, the challenges she faced as a mother, and how she transformed her pain into empowerment through writing. She emphasizes the importance of seeking help and utilizing available resources for survivors of abuse, highlighting her own experiences and the support systems that aided her recovery. Tammy\u0027s story is one of resilience, healing, and the strength to rebuild one\u0027s life after trauma. \n\nTammy is an award winning author. If you would like to check out her available books, click the links below\n\nThink Tank  - Forging Freedom Anthology Vol 1.\nhttps://a.co/d/aWERGho\n\nThe Darkening - Cranial Leakage Vol 1\nhttps://a.co/d/4Quq6dt\n\nThe Waiting Room - Threads a NeoVerse Anthology Vol 1\nhttps://a.co/d/bPRRReB\n\nMy Monster My Demon -https://blog.reedsy.com/short-story/4otbvs/\n\n************************************************************\nIf you are a woman who has escaped an abusive relationship, high control environment or cult, and would like to tell your story, please visit www.awakentofreedom.ca or email us at awakentofreedompodcast@gmail.com",
      "release": "2025-04-10T14:00:05Z",
      "duration": "00:31:36.9580000",
      "explicit": false,
      "spotifyId": "5S4iWdSbitgjZQtUXFu8FF",
      "youTubeId": "3SGW8QtvXhQ",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5S4iWdSbitgjZQtUXFu8FF",
        "youtube": "https://www.youtube.com/watch?v=3SGW8QtvXhQ"
      }
    },
    {
      "id": "c7a2d03c-0fe7-401e-aff6-a09fe211796a",
      "title": "Episode 1 - My Story, why I left the Jehovah’s Witness Organization",
      "description": "*****Content Warning - Viewer Discretion is Advised*****\nPlease note that this episode contains topics of abuse and suicide. If you or anyone you know is having suicidal thoughts, please call or text 988. If you are immediate danger please call 911. \n\n \n***Technical Disclaimer***\nThis episode may contain preliminary audio, visual, and editing elements, as we are still optimizing our production quality. We appreciate your understanding as we work to improve.\n\n\nWelcome to the first episode of Awaken to Freedom! In this video, I\u0027m sharing my story - how I broke free from a high control environment and took back my life. It\u0027s real and all about finding the courage to step into your own power. In this video, I sometimes weave in humor as I share my experience, approaching it with a touch of distance and lightness. It’s not about brushing aside the pain, but about carving out small moments of relief. This is a heavy, painful topic, so please know, I’m not here to downplay the trauma you might be experiencing or have experienced in the past.\n\nIf you\u0027ve ever felt trapped or are questioning the beliefs you’ve been taught, please consider subscribing. Each week I will upload a new interview and once a month I will have a guest who can provide help and insight into healing from trauma  Hit that like button, and join me on this journey - Let\u0027s awaken to freedom together.",
      "release": "2025-04-01T06:48:59Z",
      "duration": "00:30:05.4160000",
      "explicit": false,
      "spotifyId": "5jbol7BQTL812ek1qe103r",
      "youTubeId": "_rST6Zp2Mj0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jbol7BQTL812ek1qe103r",
        "youtube": "https://www.youtube.com/watch?v=_rST6Zp2Mj0"
      }
    }
  ]
}