{
  "_ts": 0,
  "id": "70cf6976-1f00-452b-842a-af64beffccc0",
  "name": "B Live Media TV",
  "youTubeChannelId": "UCMGPyWtCBocY2QOS14peFGA",
  "episodes": [
    {
      "id": "2ea15754-8ed7-414f-bb9e-816b2673ac23",
      "title": "Martha Glory Kartaoui\u0027s SHOCKING Journey from CULT Survivor to COURAGEOUS Warrior",
      "description": "Cult Survivor to Courageous Warrior: Martha Glory Kartaoui’s Journey to Healing\r\n\r\nMartha Glory Kartaoui transforms her harrowing cult experience into a beacon of hope. In Glory: Going All In, she shares her journey and trauma recovery insights.\r\n\r\nIn this episode of Books with Bridgetti, we are joined by Martha Glory Kartaoui, a cult survivor who has transformed her trauma into a source of healing for others. Martha shares her inspiring journey from pain to purpose and introduces us to her trauma recovery coaching program featured in her book Glory: Going All In. We dive deep into the power of faith, spiritual healing, and practical strategies to overcome trauma. If you’re searching for hope, inspiration, or tools to reclaim your life, this conversation is for you. Join us as we explore Martha’s unique approach to healing and transformation.\r\n\r\nAbout the Show\r\nBooks with Bridgetti launched mid-2021.  Bridgetti Lim Banda, an international bestselling author, hosts the show and invites a lineup of literary industry experts to join her. You\u0027ll get to hear from award-winning authors, New York Times and USA Today bestsellers, and talented Indie authors.  Authors like you\u0027ve never heard them before—only on “Books with Bridgetti”\r\n\r\nAbout the Show Host\r\n\r\nBridgetti Lim Banda\r\nBridgetti is a visionary media personality and changemaker. As an Executive Livestream Producer, Podcast Host, and Author, she empowers individuals to shine on camera and amplify their influence. Bridgetti\u0027s dedication to social impact earns her the titles of Global Goodwill Ambassador and Invisible Disabilities Advocate. Her groundbreaking work addressing the Cape Town Water Crisis has resonated globally, earning features in prominent print and broadcast media outlets. With a passion for elevating others\u0027 voices, Bridgetti\u0027s expertise helps thought leaders and authors unlock their full potential.\r\n\r\nBook suggestions and #FoundItOnAmazon here:\r\nhttps://go.shopping/bridgetti\r\n\r\n#WritersCornerLiveShow #WCLS #TikTok #TikTokBooks #TikTokMarketing #BookTokCommunity #BLiveMedia #BLiMe #BookRecommendations #BookBassador #DigitalMarketing #BookTok #BooksWithBridgetti #ContentCreators #Marketing #Books #CreatorSearchInsights #FYP #BwB #Ad\r\n\r\nWant to create live streams like this? I use StreamYard, have a look: https://streamyard.com/pal/d/5706933096939520",
      "release": "2024-09-26T06:37:59Z",
      "duration": "00:49:06",
      "explicit": false,
      "youTubeId": "qQzdyK2EWOA",
      "subjects": [
        "Samanta Roy Institute of Science and Technology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qQzdyK2EWOA"
      }
    }
  ]
}