{
  "_ts": 0,
  "id": "0197f44e-e935-411e-aabe-614c22398add",
  "name": "Babe! Lets Join A Cult",
  "spotifyId": "1n7ClpI4psc0D7TdruG88l",
  "appleId": 1781099526,
  "youTubeChannelId": "UCg0_QFVy2GgorCeoomlfrlg",
  "episodes": [
    {
      "id": "2fd4014d-93a6-4cd3-8242-d78c7607c745",
      "title": "#13 Strong City of New Mexico: Wayne Bent",
      "description": "In this episode of Babe! Let’s Join A Cult, we dive into the bizarre and unsettling world of Strong City, a doomsday cult led by self-proclaimed prophet Wayne Bent. Claiming divine authority, Bent convinced his followers that the end of the world was near, shaping their lives around strict obedience, apocalyptic visions, and disturbing spiritual rituals.\n\nBut how did Strong City go from a small religious community to an isolated cult embroiled in controversy? What led to the arrest of its leader? And why do some followers still believe in Wayne Bent’s prophecies?\n\nJoin us as we unravel the story of faith, control, and the fine line between devotion and delusion.\n\n👉 Don’t forget to like, subscribe, and leave a comment! What do you think about Strong City and its leader? \n\n🎧 Listen on Spotify, Apple Podcasts, or wherever you get your podcasts!\n📢 Follow us for more cult deep dives: @BabeLetsJoinACult",
      "release": "2025-03-07T19:38:17Z",
      "duration": "00:44:38",
      "explicit": false,
      "spotifyId": "0Qai6pCBPVBxHcRacHtOvr",
      "appleId": 1000698326592,
      "youTubeId": "Cbp5n91s6qs",
      "subjects": [
        "Lord Our Righteousness Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Qai6pCBPVBxHcRacHtOvr",
        "apple": "https://podcasts.apple.com/podcast/13-strong-city-of-new-mexico-wayne-bent/id1781099526?i=1000698326592",
        "youtube": "https://www.youtube.com/watch?v=Cbp5n91s6qs"
      }
    },
    {
      "id": "c070cebe-a92c-4d7e-a66f-3c4ab5cd8cce",
      "title": "#12 Heaven’s Gate: The Cult That Rode a Comet",
      "description": "In March 1997, 39 people were found dead in a California mansion, dressed in matching black tracksuits and Nike sneakers, their faces covered with purple shrouds. They weren’t murdered. They weren’t victims of a mass accident.\n\nThey chose this.\n\nThey were members of Heaven’s Gate, a doomsday UFO cult that believed a spaceship was hidden behind the Hale-Bopp comet, waiting to take them to a higher plane of existence. But to board? They had to leave their human “vehicles” behind.\n\nLed by Marshall Applewhite, Heaven’s Gate began in the 1970s as a spiritual movement promising transcendence—but over the decades, its message twisted into something far more dangerous. After years of isolation, strict rules, and growing paranoia, Applewhite convinced his followers that their time had finally come.\n\nThis is the story of how belief can turn deadly, how a group of seemingly ordinary people fell under the influence of a man who believed his own prophecy, and how a conspiracy theory about a comet led to one of the most infamous mass suicides in modern history.\n\n👉 In this episode, we cover:\n🔹 The origins of Heaven’s Gate \u0026 its bizarre teachings\n🔹 How Marshall Applewhite \u0026 Bonnie Nettles built a UFO cult\n🔹 The tightening control, isolation, and psychological conditioning of members\n🔹 The death of Nettles \u0026 how it changed everything\n🔹 The Hale-Bopp Comet \u0026 the final days leading up to the mass suicide\n🔹 What remains of Heaven’s Gate today\n\n🎧 Subscribe for more deep dives into cults, conspiracies, and the psychology of belief!\n\n📲 Follow us on Instagram: [Insert your IG link]\n🎙 Listen on Spotify \u0026 Apple Podcasts: [Insert your podcast link]\n🌐 More episodes \u0026 merch: [Insert website link]\n\n#HeavensGate #CultPodcast #TrueCrime #UFO #BabeLetsJoinACult #HaleBopp #MarshallApplewhite #DoomsdayCults #Cults #Podcast",
      "release": "2025-02-28T19:05:28Z",
      "duration": "00:42:03",
      "explicit": false,
      "spotifyId": "4rwutBgRkvkHqqxpY0RYXi",
      "appleId": 1000696895386,
      "youTubeId": "MjxdonCvjXk",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4rwutBgRkvkHqqxpY0RYXi",
        "apple": "https://podcasts.apple.com/podcast/12-heavens-gate-the-cult-that-rode-a-comet/id1781099526?i=1000696895386",
        "youtube": "https://www.youtube.com/watch?v=MjxdonCvjXk"
      }
    },
    {
      "id": "4d45918e-f4d8-4b32-9cce-48c205cafa77",
      "title": "#11 Marcus Wesson: The Vampire King \u0026 His House of Horrors",
      "description": "WARNING: This episode contains discussions of cult manipulation, abuse, incest, and mass murder. Listener discretion is advised. 🚨\n\nIn the shadows of Fresno, California, Marcus Wesson built a twisted family cult, blending religious fanaticism, incest, and vampire mythology into a nightmare of control and abuse. He proclaimed himself “The Vampire King”, brainwashing his followers, many of whom were his own children, into believing that he was their God and that death was the ultimate path to salvation.\n\nOn March 12, 2004, his delusions reached their horrific climax when police entered his home and uncovered one of the most disturbing crime scenes in American history, nine bodies stacked inside a room filled with coffins.\n\n🔍 In this episode, we uncover:\n\nHow Marcus Wesson groomed and manipulated his family into submission\nHis obsession with vampirism, religious prophecy, and ultimate control\nThe terrifying cult-like rules he imposed on his wives and children\nThe shocking events that led to a tragic mass murder\nHow his twisted ideology still haunts true crime history today\nThis is more than a cult story, it’s a horrifying case of power, manipulation, and a leader who turned his own family into victims.\n\n⚠️ Don’t forget to like, comment, and subscribe for more deep dives into the world’s most disturbing cults, crimes, and conspiracies.\n\n🔔 Hit the bell icon so you never miss an episode!\n\n#MarcusWesson #VampireKing #TrueCrimePodcast #CultHorror #FresnoMurders #DoomsdayCult #DarkHistory #Cults #CrimeDocumentary",
      "release": "2025-02-07T08:00:08Z",
      "duration": "00:56:36",
      "explicit": false,
      "spotifyId": "64bPehDDkwuNzqyUSYbNcd",
      "appleId": 1000690055499,
      "youTubeId": "AYIB_VgBUc4",
      "subjects": [
        "Marcus Wesson"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64bPehDDkwuNzqyUSYbNcd",
        "apple": "https://podcasts.apple.com/podcast/11-marcus-wesson-the-vampire-king-his-house-of-horrors/id1781099526?i=1000690055499",
        "youtube": "https://www.youtube.com/watch?v=AYIB_VgBUc4"
      }
    },
    {
      "id": "d80671c4-5bf3-40c2-9955-d6939378f024",
      "title": "#10 Cosmic Lies \u0026 Ritual Crimes: Inside the Superior Universal Alignment",
      "description": "WARNING: This episode contains discussions of cult violence, child abuse, and ritualistic crimes. Listener discretion is advised. 🚨\n\nWhat happens when a cult leader convinces her followers that certain children are born evil? In this episode, we dive deep into the chilling history of the Superior Universal Alignment, a cult led by Valentina de Andrade, whose apocalyptic beliefs led to horrifying crimes in Brazil.\n\nFrom its early days as a fringe spiritual movement to the gruesome Altamira child murders, we explore how Valentina’s teachings manipulated her followers into committing unthinkable acts—and how the cult’s dark legacy still lingers today.\n\n🔍 In this episode, we cover:\n\nWho was Valentina de Andrade?\nThe cult’s early beliefs and cosmic prophecies\nHow paranoia and extremism turned deadly\nThe shocking crimes tied to the group\nThe downfall of the cult and its lasting impact\nThis is a story of manipulation, fanaticism, and the devastating consequences of blind faith. Stay with us as we uncover one of the most disturbing cult cases in history.\n\n📌 Don’t forget to like, comment, and subscribe for more deep dives into the world\u0027s most unsettling cults and conspiracies.\n\n🔔 Hit the bell icon to stay updated on our latest episodes!\n\n#Cults #TrueCrime #SuperiorUniversalAlignment #ValentinaDeAndrade #AltamiraMurders #TrueCrimePodcast #DarkHistory #PodcastEpisode",
      "release": "2025-01-31T08:00:43Z",
      "duration": "00:39:05",
      "explicit": false,
      "spotifyId": "65mmbwokovON5mKM6h95bN",
      "appleId": 1000687422941,
      "youTubeId": "nCjOQq4rsug",
      "subjects": [
        "Superior Universal Alignment"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65mmbwokovON5mKM6h95bN",
        "apple": "https://podcasts.apple.com/podcast/10-cosmic-lies-ritual-crimes-inside-the-superior/id1781099526?i=1000687422941",
        "youtube": "https://www.youtube.com/watch?v=nCjOQq4rsug"
      }
    },
    {
      "id": "0460d22a-4c97-4c00-a157-c1f35228b1a6",
      "title": "#9 Inside The Anthill: Roch Thériault’s Cult of Suffering",
      "description": "What happens when a self-proclaimed prophet turns a commune into a nightmare?\n\nIn this chilling episode, we unravel the story of Roch Thériault and the Ant Hill Kids, a Canadian cult that promised salvation but delivered unimaginable suffering. Under the guise of spiritual guidance, Thériault subjected his followers to years of brutal abuse, manipulation, and physical torment, all while claiming to prepare them for an apocalyptic end.\n\nJoin us as we explore:\n\nThériault’s rise from charismatic leader to sadistic tyrant.\nThe twisted methods he used to control and punish his followers.\nThe tragic lives of those who endured his reign and the brave individuals who escaped to expose the horrors within.\nThis is the disturbing tale of how power, paranoia, and blind loyalty turned a so-called utopia into a living hell.\n\n⚠️ Trigger Warning: This episode contains discussions of abuse, violence, and cult dynamics.\n\n#AntHillKids #RochTheriault #Cults #TrueCrime #Podcast #DarkHistory",
      "release": "2025-01-24T08:00:49Z",
      "duration": "00:53:58",
      "explicit": false,
      "spotifyId": "33FNZ5OcjmqZQhHp4vlAoO",
      "appleId": 1000685265037,
      "youTubeId": "pJknxF6gSxo",
      "subjects": [
        "Ant Hill Kids"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33FNZ5OcjmqZQhHp4vlAoO",
        "apple": "https://podcasts.apple.com/podcast/9-inside-the-anthill-roch-th%C3%A9riaults-cult-of-suffering/id1781099526?i=1000685265037",
        "youtube": "https://www.youtube.com/watch?v=pJknxF6gSxo"
      }
    },
    {
      "id": "2bdd337a-d87d-4073-946e-dd58517121d7",
      "title": "#8 Drink the Kool-Aid: The Tragic Rise \u0026 Fall of Jonestown",
      "description": "What started as a promise of equality and paradise ended in one of the largest mass deaths in history. Join us as we dive into the chilling story of Jim Jones and the People’s Temple, a movement that captivated thousands with its ideals of justice and community, only to spiral into manipulation, paranoia, and the horrific events of November 18, 1978. In this episode, we explore the rise of Jonestown, the escalating control of its enigmatic leader, and the heartbreaking tragedy that claimed over 900 lives. This is the story behind the infamous phrase, “Drink the Kool-Aid.”\n\n🔗 Don’t forget to like, comment, and subscribe for more deep dives into the world of cults, manipulation, and the psychology of belief.",
      "release": "2025-01-10T08:00:00Z",
      "duration": "00:47:23",
      "explicit": false,
      "spotifyId": "1woaZIjDAbz8ejaWGElVvG",
      "appleId": 1000683434625,
      "youTubeId": "FrSexNaralo",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1woaZIjDAbz8ejaWGElVvG",
        "apple": "https://podcasts.apple.com/podcast/8-drink-the-kool-aid-the-tragic-rise-fall-of-jonestown/id1781099526?i=1000683434625",
        "youtube": "https://www.youtube.com/watch?v=FrSexNaralo"
      }
    },
    {
      "id": "ec1f31a8-4982-4276-b15c-03a5f0e8b062",
      "title": "#7 Monotheism: The One True Cult",
      "description": "Episode 7: Monotheism: The One True Cult 🎙️\n\nMonotheism, the belief in one supreme god, has shaped civilisations and provided moral guidance for billions. But beneath its grand narrative lies a system of control, fear, and power that shares uncanny similarities with cult behavior.\n\nIn this episode, we explore:\n🔍 How monotheistic religions centralize authority.\n💬 The tactics used to maintain loyalty and silence dissent.\n🛐 When spirituality transforms into obedience-driven control.\n📖 Parallels between ancient myths and biblical stories.\n⚠️ How salvation is often sold as a product rather than offered as a path.\n\nThis isn’t about questioning faith, it’s about recognizing patterns of control and manipulation in human systems.\n\n✨ Join us as we peel back the layers of Christianity, Islam, and Judaism, examining how these structures evolved and why questioning them is often framed as heresy.\n\n🎧 Listen now on Spotify \u0026 Apple Podcasts\n\n🔗 Subscribe, like, and share to keep the conversation going!\n\n#Monotheism #Podcast #Cults #ReligionAndControl #Spirituality #CriticalThinking #PodcastEpisode #FaithVsContr",
      "release": "2025-01-03T06:42:39Z",
      "duration": "01:05:44",
      "explicit": false,
      "spotifyId": "74IBtLFzS8Q8YU2Pk3oQtR",
      "appleId": 1000682574025,
      "youTubeId": "d0n9JMGgLHc",
      "urls": {
        "spotify": "https://open.spotify.com/episode/74IBtLFzS8Q8YU2Pk3oQtR",
        "apple": "https://podcasts.apple.com/podcast/7-monotheism-the-one-true-cult/id1781099526?i=1000682574025",
        "youtube": "https://www.youtube.com/watch?v=d0n9JMGgLHc"
      }
    },
    {
      "id": "464bb330-b44f-4c00-8b51-dc8a3ad4ac7b",
      "title": "#5 Where It All Began: Akhenaten and the First Cult",
      "description": "Episode #5: Akhenaten and the First Cult Step into ancient Egypt as we uncover the story of Akhenaten, the heretic pharaoh who turned an entire kingdom upside down. ☀️ The Aten Cult: Akhenaten declared Aten, the sun disk, the one true god, dismantling centuries of polytheism. Was this divine enlightenment or the first recorded cult? \u0026#x1f451; Pharaoh\u0027s Radical Rule: His obsession with Aten led to dramatic cultural, religious, and artistic changes—abandoning Thebes, founding a new city (Amarna), and erasing Egypt\u0027s traditional gods. \u0026#x1f9e0; Cult Psychology: We explore how Akhenaten\u0027s authoritarian control mirrored the tactics of modern cult leaders. \u0026#x1f480; Fall of a Dream: Discover how this bold experiment crumbled after Akhenaten\u0027s death, leaving behind a legacy of mystery and revolution. \u0026#x1f449; Tune in for a journey into the origins of cult dynamics and how a pharaoh\u0027s vision shaped history. \u0026#x1f517; Listen now on YouTube/Spotify/Apple Podcasts",
      "release": "2024-12-14T05:43:40Z",
      "duration": "00:45:06.6430000",
      "explicit": false,
      "spotifyId": "40q2JQb5a4vTkF4B2GvvCc",
      "appleId": 1000680338034,
      "youTubeId": "cdhcduLLF0I",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/40q2JQb5a4vTkF4B2GvvCc",
        "apple": "https://podcasts.apple.com/podcast/5-where-it-all-began-akhenaten-and-the-first-cult/id1781099526?i=1000680338034",
        "youtube": "https://www.youtube.com/watch?v=cdhcduLLF0I"
      }
    },
    {
      "id": "2599fab4-f1ff-433d-90d3-48527d9ddb17",
      "title": "#4 Branded \u0026 Betrayed: The Story of NXIVM and Keith Raniere",
      "description": "Episode 4 we dive into the harrowing story of NXIVM, the self-help organization that unraveled into a web of manipulation, exploitation, and abuse. Join us as we uncover the rise and fall of Keith Raniere, the mastermind behind the cult, and explore the role of actress Allison Mack, who became one of his most loyal enforcers.\nWe’ll reveal the secrets of DOS, the sinister subgroup that coerced women into branding ceremonies and submission under the guise of empowerment. Hear survivor stories, courtroom drama, and the shocking details of how a quest for self-improvement turned into a nightmare of control and betrayal.\nPrepare for a chilling tale of blind loyalty, psychological manipulation, and the courage of those who broke free to tell the world the truth.\n\nTrigger Warning: This episode contains discussions of coercion, abuse, and manipulation. Listener discretion is advised.\n\nKey Topics:\nWhat NXIVM promised vs. the dark reality.\nThe psychological tactics of Keith Raniere and Allison Mack.\nThe branding rituals and the use of “collateral” to control members.\nThe survivors’ fight for justice and the cult’s ultimate downfall.\n\n🎙️ Follow for more deep dives into the darkest corners of cults, manipulation, and human psychology.",
      "release": "2024-12-06T08:00:24Z",
      "duration": "01:20:11",
      "explicit": false,
      "spotifyId": "5PU6IxUNq2WHGpPsZOtkYy",
      "appleId": 1000679455093,
      "youTubeId": "YaKZW1mZVNU",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5PU6IxUNq2WHGpPsZOtkYy",
        "apple": "https://podcasts.apple.com/podcast/4-branded-betrayed-nxivm-cult/id1781099526?i=1000679455093",
        "youtube": "https://www.youtube.com/watch?v=YaKZW1mZVNU"
      }
    },
    {
      "id": "8add5bae-7f7f-4554-b802-2f4e789f4331",
      "title": "#3 Toxic Love \u0026 Twisted Beliefs: Love Has Won and Mother God Cult",
      "description": "Episode 3 takes us to Colorado as we discuss the Mother God. What happens when a self-proclaimed \u0027Mother God\u0027 builds a following on promises of divine ascension, but instead leaves behind a trail of manipulation, abuse, and tragedy? Love Has Won started as a spiritual movement, but spiraled into something far darker—a toxic mix of cult control, bizarre rituals, and shattered lives. Today, we’re peeling back the layers of this so-called divine mission to reveal the chaos, controversy, and heartbreaking reality behind the cult of Love Has Won. Stay with us as we uncover the story of Mother God, her loyal followers, and the devastating consequences of blind devotion.",
      "release": "2024-11-30T04:08:28Z",
      "duration": "01:03:12",
      "explicit": false,
      "spotifyId": "7tnzgX6ZRtTFv2muvfuc0O",
      "appleId": 1000678693533,
      "youTubeId": "TkFkGixLMps",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tnzgX6ZRtTFv2muvfuc0O",
        "apple": "https://podcasts.apple.com/podcast/3-toxic-love-twisted-beliefs-love-has-won-cult/id1781099526?i=1000678693533",
        "youtube": "https://www.youtube.com/watch?v=TkFkGixLMps"
      }
    },
    {
      "id": "08f21efc-bb5b-4c5b-a361-482010be77d4",
      "title": "#2: From Dancer to Disciple: Charles Manson Cult",
      "description": "Episode 2 follows The Manson Family through the story of Susan Denise Atkins. Susan Denise Atkins (1948–2009) was a member of Charles Manson\u0027s \u0022Manson Family\u0022 cult, infamously involved in the Tate-LaBianca murders in 1969. Atkins, under Manson\u0027s influence, participated in the brutal killings, including the murder of actress Sharon Tate, who was eight months pregnant. During the trial, Atkins initially confessed her involvement but later recanted, blaming Manson for manipulating her and the group. Convicted of first-degree murder, Atkins was sentenced to death, later commuted to life in prison when California temporarily abolished the death penalty.  Atkins was denied parole multiple times before dying of brain cancer in 2009, having spent over 40 years in prison.\n\n#podcast #cultawareness #culttalk #mansonfamily",
      "release": "2024-11-22T22:30:16Z",
      "duration": "01:10:38",
      "explicit": false,
      "spotifyId": "4zNtEUzBNjfMVGiw42hFlP",
      "appleId": 1000677960673,
      "youTubeId": "UBJpzAbvPkI",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4zNtEUzBNjfMVGiw42hFlP",
        "apple": "https://podcasts.apple.com/podcast/2-from-dancer-to-disciple-charles-manson/id1781099526?i=1000677960673",
        "youtube": "https://www.youtube.com/watch?v=UBJpzAbvPkI"
      }
    },
    {
      "id": "76c47992-4fd9-4919-8506-fcce000dc964",
      "title": "#1: Curiosity To Cult Member: The Who, Why \u0026 WTF",
      "description": "Season 1, Episode 1 kicks off as a general overview of cult characteristics to prepare us for a season of intoxicating cult stories! Hang tight for next week as we go deep into the strange, the unsettling, and the downright bizarre worlds of cults to ask the ultimate question: Will you join? \n\nIn \u0027Babe! Let’s Join A Cult\u0027 we explore the psychology, dark mysteries, and unique followers that make up some of the most infamous cults in history, from destructive ideologies to irresistible charisma. Come for the thrill, stay for the secrets.\n\nNew episode every Friday!\n\n\nThis podcast is sponsored by Impulse Media House \u0026 The Tea Treehouse \n\nFor inquiries and cult stories email us \nbabeletsjoinacult@gmail.com \nInstagram: @babeletsjoinacult\nFollow Us",
      "release": "2024-11-16T07:00:29Z",
      "duration": "01:14:33",
      "explicit": false,
      "spotifyId": "3FYaDxRH36WiVrQfXn1f1k",
      "appleId": 1000677824414,
      "youTubeId": "Y_AGWJPZRg8",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3FYaDxRH36WiVrQfXn1f1k",
        "apple": "https://podcasts.apple.com/podcast/curiosity-to-cult-member-the-who-why-wtf/id1781099526?i=1000677824414",
        "youtube": "https://www.youtube.com/watch?v=Y_AGWJPZRg8"
      }
    }
  ]
}