{
  "_ts": 0,
  "id": "0197f44e-e935-411e-aabe-614c22398add",
  "name": "Babe! Lets Join A Cult",
  "spotifyId": "1n7ClpI4psc0D7TdruG88l",
  "appleId": 1781099526,
  "youTubeChannelId": "UCg0_QFVy2GgorCeoomlfrlg",
  "episodes": [
    {
      "id": "0460d22a-4c97-4c00-a157-c1f35228b1a6",
      "title": "#9 Inside The Anthill: Roch Thériault’s Cult of Suffering",
      "description": "What happens when a self-proclaimed prophet turns a commune into a nightmare?\n\nIn this chilling episode, we unravel the story of Roch Thériault and the Ant Hill Kids, a Canadian cult that promised salvation but delivered unimaginable suffering. Under the guise of spiritual guidance, Thériault subjected his followers to years of brutal abuse, manipulation, and physical torment, all while claiming to prepare them for an apocalyptic end.\n\nJoin us as we explore:\n\nThériault’s rise from charismatic leader to sadistic tyrant.\nThe twisted methods he used to control and punish his followers.\nThe tragic lives of those who endured his reign and the brave individuals who escaped to expose the horrors within.\nThis is the disturbing tale of how power, paranoia, and blind loyalty turned a so-called utopia into a living hell.\n\n⚠️ Trigger Warning: This episode contains discussions of abuse, violence, and cult dynamics.\n\n#AntHillKids #RochTheriault #Cults #TrueCrime #Podcast #DarkHistory",
      "release": "2025-01-24T08:00:49Z",
      "duration": "00:53:58",
      "explicit": false,
      "spotifyId": "33FNZ5OcjmqZQhHp4vlAoO",
      "appleId": 1000685265037,
      "youTubeId": "pJknxF6gSxo",
      "subjects": [
        "Ant Hill Kids"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33FNZ5OcjmqZQhHp4vlAoO",
        "apple": "https://podcasts.apple.com/podcast/9-inside-the-anthill-roch-th%C3%A9riaults-cult-of-suffering/id1781099526?i=1000685265037",
        "youtube": "https://www.youtube.com/watch?v=pJknxF6gSxo"
      }
    },
    {
      "id": "ec1f31a8-4982-4276-b15c-03a5f0e8b062",
      "title": "#7 Monotheism: The One True Cult",
      "description": "Episode 7: Monotheism: The One True Cult 🎙️\n\nMonotheism, the belief in one supreme god, has shaped civilisations and provided moral guidance for billions. But beneath its grand narrative lies a system of control, fear, and power that shares uncanny similarities with cult behavior.\n\nIn this episode, we explore:\n🔍 How monotheistic religions centralize authority.\n💬 The tactics used to maintain loyalty and silence dissent.\n🛐 When spirituality transforms into obedience-driven control.\n📖 Parallels between ancient myths and biblical stories.\n⚠️ How salvation is often sold as a product rather than offered as a path.\n\nThis isn’t about questioning faith, it’s about recognizing patterns of control and manipulation in human systems.\n\n✨ Join us as we peel back the layers of Christianity, Islam, and Judaism, examining how these structures evolved and why questioning them is often framed as heresy.\n\n🎧 Listen now on Spotify \u0026 Apple Podcasts\n\n🔗 Subscribe, like, and share to keep the conversation going!\n\n#Monotheism #Podcast #Cults #ReligionAndControl #Spirituality #CriticalThinking #PodcastEpisode #FaithVsContr",
      "release": "2025-01-03T06:42:39Z",
      "duration": "01:05:44",
      "explicit": false,
      "spotifyId": "74IBtLFzS8Q8YU2Pk3oQtR",
      "appleId": 1000682574025,
      "youTubeId": "d0n9JMGgLHc",
      "urls": {
        "spotify": "https://open.spotify.com/episode/74IBtLFzS8Q8YU2Pk3oQtR",
        "apple": "https://podcasts.apple.com/podcast/7-monotheism-the-one-true-cult/id1781099526?i=1000682574025",
        "youtube": "https://www.youtube.com/watch?v=d0n9JMGgLHc"
      }
    },
    {
      "id": "464bb330-b44f-4c00-8b51-dc8a3ad4ac7b",
      "title": "#5 Where It All Began: Akhenaten and the First Cult",
      "description": "Episode #5: Akhenaten and the First Cult Step into ancient Egypt as we uncover the story of Akhenaten, the heretic pharaoh who turned an entire kingdom upside down. ☀️ The Aten Cult: Akhenaten declared Aten, the sun disk, the one true god, dismantling centuries of polytheism. Was this divine enlightenment or the first recorded cult? \u0026#x1f451; Pharaoh\u0027s Radical Rule: His obsession with Aten led to dramatic cultural, religious, and artistic changes—abandoning Thebes, founding a new city (Amarna), and erasing Egypt\u0027s traditional gods. \u0026#x1f9e0; Cult Psychology: We explore how Akhenaten\u0027s authoritarian control mirrored the tactics of modern cult leaders. \u0026#x1f480; Fall of a Dream: Discover how this bold experiment crumbled after Akhenaten\u0027s death, leaving behind a legacy of mystery and revolution. \u0026#x1f449; Tune in for a journey into the origins of cult dynamics and how a pharaoh\u0027s vision shaped history. \u0026#x1f517; Listen now on YouTube/Spotify/Apple Podcasts",
      "release": "2024-12-14T05:43:40Z",
      "duration": "00:45:06.6430000",
      "explicit": false,
      "spotifyId": "40q2JQb5a4vTkF4B2GvvCc",
      "appleId": 1000680338034,
      "youTubeId": "cdhcduLLF0I",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/40q2JQb5a4vTkF4B2GvvCc",
        "apple": "https://podcasts.apple.com/podcast/5-where-it-all-began-akhenaten-and-the-first-cult/id1781099526?i=1000680338034",
        "youtube": "https://www.youtube.com/watch?v=cdhcduLLF0I"
      }
    },
    {
      "id": "2599fab4-f1ff-433d-90d3-48527d9ddb17",
      "title": "#4 Branded \u0026 Betrayed: The Story of NXIVM and Keith Raniere",
      "description": "Episode 4 we dive into the harrowing story of NXIVM, the self-help organization that unraveled into a web of manipulation, exploitation, and abuse. Join us as we uncover the rise and fall of Keith Raniere, the mastermind behind the cult, and explore the role of actress Allison Mack, who became one of his most loyal enforcers.\nWe’ll reveal the secrets of DOS, the sinister subgroup that coerced women into branding ceremonies and submission under the guise of empowerment. Hear survivor stories, courtroom drama, and the shocking details of how a quest for self-improvement turned into a nightmare of control and betrayal.\nPrepare for a chilling tale of blind loyalty, psychological manipulation, and the courage of those who broke free to tell the world the truth.\n\nTrigger Warning: This episode contains discussions of coercion, abuse, and manipulation. Listener discretion is advised.\n\nKey Topics:\nWhat NXIVM promised vs. the dark reality.\nThe psychological tactics of Keith Raniere and Allison Mack.\nThe branding rituals and the use of “collateral” to control members.\nThe survivors’ fight for justice and the cult’s ultimate downfall.\n\n🎙️ Follow for more deep dives into the darkest corners of cults, manipulation, and human psychology.",
      "release": "2024-12-06T08:00:24Z",
      "duration": "01:20:11",
      "explicit": false,
      "spotifyId": "5PU6IxUNq2WHGpPsZOtkYy",
      "appleId": 1000679455093,
      "youTubeId": "YaKZW1mZVNU",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5PU6IxUNq2WHGpPsZOtkYy",
        "apple": "https://podcasts.apple.com/podcast/4-branded-betrayed-nxivm-cult/id1781099526?i=1000679455093",
        "youtube": "https://www.youtube.com/watch?v=YaKZW1mZVNU"
      }
    },
    {
      "id": "8add5bae-7f7f-4554-b802-2f4e789f4331",
      "title": "#3 Toxic Love \u0026 Twisted Beliefs: Love Has Won and Mother God Cult",
      "description": "Episode 3 takes us to Colorado as we discuss the Mother God. What happens when a self-proclaimed \u0027Mother God\u0027 builds a following on promises of divine ascension, but instead leaves behind a trail of manipulation, abuse, and tragedy? Love Has Won started as a spiritual movement, but spiraled into something far darker—a toxic mix of cult control, bizarre rituals, and shattered lives. Today, we’re peeling back the layers of this so-called divine mission to reveal the chaos, controversy, and heartbreaking reality behind the cult of Love Has Won. Stay with us as we uncover the story of Mother God, her loyal followers, and the devastating consequences of blind devotion.",
      "release": "2024-11-30T04:08:28Z",
      "duration": "01:03:12",
      "explicit": false,
      "spotifyId": "7tnzgX6ZRtTFv2muvfuc0O",
      "appleId": 1000678693533,
      "youTubeId": "TkFkGixLMps",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tnzgX6ZRtTFv2muvfuc0O",
        "apple": "https://podcasts.apple.com/podcast/3-toxic-love-twisted-beliefs-love-has-won-cult/id1781099526?i=1000678693533",
        "youtube": "https://www.youtube.com/watch?v=TkFkGixLMps"
      }
    },
    {
      "id": "08f21efc-bb5b-4c5b-a361-482010be77d4",
      "title": "#2: From Dancer to Disciple: Charles Manson Cult",
      "description": "Episode 2 follows The Manson Family through the story of Susan Denise Atkins. Susan Denise Atkins (1948–2009) was a member of Charles Manson\u0027s \u0022Manson Family\u0022 cult, infamously involved in the Tate-LaBianca murders in 1969. Atkins, under Manson\u0027s influence, participated in the brutal killings, including the murder of actress Sharon Tate, who was eight months pregnant. During the trial, Atkins initially confessed her involvement but later recanted, blaming Manson for manipulating her and the group. Convicted of first-degree murder, Atkins was sentenced to death, later commuted to life in prison when California temporarily abolished the death penalty.  Atkins was denied parole multiple times before dying of brain cancer in 2009, having spent over 40 years in prison.\n\n#podcast #cultawareness #culttalk #mansonfamily",
      "release": "2024-11-22T22:30:16Z",
      "duration": "01:10:38",
      "explicit": false,
      "spotifyId": "4zNtEUzBNjfMVGiw42hFlP",
      "appleId": 1000677960673,
      "youTubeId": "UBJpzAbvPkI",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4zNtEUzBNjfMVGiw42hFlP",
        "apple": "https://podcasts.apple.com/podcast/2-from-dancer-to-disciple-charles-manson/id1781099526?i=1000677960673",
        "youtube": "https://www.youtube.com/watch?v=UBJpzAbvPkI"
      }
    },
    {
      "id": "76c47992-4fd9-4919-8506-fcce000dc964",
      "title": "#1: Curiosity To Cult Member: The Who, Why \u0026 WTF",
      "description": "Season 1, Episode 1 kicks off as a general overview of cult characteristics to prepare us for a season of intoxicating cult stories! Hang tight for next week as we go deep into the strange, the unsettling, and the downright bizarre worlds of cults to ask the ultimate question: Will you join? \n\nIn \u0027Babe! Let’s Join A Cult\u0027 we explore the psychology, dark mysteries, and unique followers that make up some of the most infamous cults in history, from destructive ideologies to irresistible charisma. Come for the thrill, stay for the secrets.\n\nNew episode every Friday!\n\n\nThis podcast is sponsored by Impulse Media House \u0026 The Tea Treehouse \n\nFor inquiries and cult stories email us \nbabeletsjoinacult@gmail.com \nInstagram: @babeletsjoinacult\nFollow Us",
      "release": "2024-11-16T07:00:29Z",
      "duration": "01:14:33",
      "explicit": false,
      "spotifyId": "3FYaDxRH36WiVrQfXn1f1k",
      "appleId": 1000677824414,
      "youTubeId": "Y_AGWJPZRg8",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3FYaDxRH36WiVrQfXn1f1k",
        "apple": "https://podcasts.apple.com/podcast/curiosity-to-cult-member-the-who-why-wtf/id1781099526?i=1000677824414",
        "youtube": "https://www.youtube.com/watch?v=Y_AGWJPZRg8"
      }
    }
  ]
}