{
  "id": "60257f75-d75d-47a4-9fb0-a88f04d7bccb",
  "name": "Banijay History",
  "youTubeChannelId": "UCb7xZQi7F3RW7BNtR57cNnA",
  "episodes": [
    {
      "id": "77027759-a6c6-475b-a9de-586fafcf1af2",
      "title": "Mormons vs. Drug Lords - Hidden In America - Documentary",
      "description": "Discover the shocking story of a peaceful Mormon colony transformed into a battleground by a murderous cult leader and ruthless drug cartels. Witness how faith and fear coexist in this gripping tale.\n\n-------\n\nExplore the hidden realms of America\u0027s most iconic and well-guarded subcultures. A journey from doomsday cults to biker gangs, underground fight clubs to suburban swingers, the Bosom Bar industry to drug-smuggling Mennonites. Hidden in America illuminates the deepest secrets of American society, fearlessly venturing where others dare not. With expert analysis and exclusive archival footage, this groundbreaking series unveils the enigmas of outlaw groups, peculiar sects, and forbidden subcultures, providing a unique glimpse into society\u0027s mysterious underbelly.\n\n-------\n\nWelcome to Banijay History, the ultimate destination for history buffs and enthusiasts! Our YouTube channel features an extensive collection of history documentaries, historical TV series, and full-length history documentary series that cover everything from ancient history to military history and beyond.\n\nOur channel provides a captivating insight into the past, exploring fascinating historical events and stories from around the world. Whether you\u0027re interested in world war documentaries, the history of the world, or true historical documentary series, we have something for everyone. Our history channel features a range of documentaries, including military documentary history channel series that take you on a journey through some of the most significant conflicts in history. We also have a wide selection of full-length history documentaries that offer a deep dive into some of the most interesting historical events.\n\nIf you\u0027re a fan of the history TV genre, Banijay History is the perfect channel for you. We offer the best historical TV shows and documentaries, providing a comprehensive overview of the history of the world. So, if you\u0027re looking for an interesting and informative history channel documentary, look no further than Banijay History.\n\nSubscribe to our channel today and be the first to watch our full-length history documentaries and historical TV series. Don\u0027t miss out on the best historical TV shows and history documentaries – click on this link https://www.youtube.com/@BanijayHistory?sub_confirmation=1 to subscribe now!\n\n#documentaries #historydocumentary #historychannel",
      "release": "2024-05-08T11:00:01Z",
      "duration": "00:48:29",
      "explicit": false,
      "youTubeId": "0p8_8jgSDes",
      "subjects": [
        "Church of the First Born of the Lamb of God",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0p8_8jgSDes"
      }
    }
  ]
}