{
  "_ts": 0,
  "id": "9599a259-df78-4297-8d5a-a461cc6d20a2",
  "name": "Bare Marriage",
  "spotifyId": "7wuRXZmQGJuuCulONIAf7s",
  "appleId": 1448888894,
  "episodes": [
    {
      "id": "bc4142c9-fdd1-4a32-b3cc-abba90c2ade1",
      "title": "Episode 246: How Toxic Marriage Advice Mirrors Coercive Control",
      "description": "Send us a text What if you discovered that marriage books like The Excellent Wife actually follows Steve Hassan\u0027s BITE model of cult indoctrination? And what if these marriage books were giving advice that mirrored coercive control? Bare Marriage podcast, episode 246, featuring Bethany Jantzi. Bethany did her thesis on coercive control, and today she shows us how these books use methods like: diminishing/devaluing personhood; undermining autonomy; creating psychological dependency; using a fear-based system of control; suppressing critical thinking; and conditioning compliance. And all of those things factor into abuse rates and coercive control. And we can do better than this! OUR SPONSOR: It\u0027s the Bible that lets girls see themselves in the story! The Kingdom Girls Bible from Zonderkidz--with profiles of all the women in the Bible (including many you may not have heard of!). It\u0027s an awesome Bible for girls 8-12--or for you too! TO SUPPORT US: Join our Patreon for as little as $5 a month to support our work For tax deductible donations in the U.S., support Good Fruit Faith Initiative through the Bosko Foundation And check out our Merch, or any of our courses ! FIND BETHANY: Free From Control on Instagram Bethany\u0027s website: Free From Control THINGS MENTIONED: How God Sees Women by Terran Williams Marg Mowczko on Bible Interpretations Our Series on the Danvers Statement Timestamps 0.11 Intro 11.30 Complimentarianism 18.24 God Knows Best 31.50 Control and Domination 40.10 Wife as a Training Ground 59.30 Are We Under Undue Influence Join Sheila at Bare Marriage.com ! And her FACEBOOK PAGE has been HACKED--so please join the new official one! Check out her books: The Great Sex Rescue She Deserves Better The Good Girl\u0027s Guide to Great Sex and The Good Guy\u0027s Guide to Great Sex And she has an Orgasm Course and a Libido course too! Check out all her courses, FREE resources, books, and so much more at Sheila\u0027s LinkTree.",
      "release": "2024-08-15T11:00:00Z",
      "duration": "01:09:34.0260000",
      "explicit": false,
      "spotifyId": "4B3IRJIRj8jiWlgo6hn3SL",
      "appleId": 1000665444528,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4B3IRJIRj8jiWlgo6hn3SL",
        "apple": "https://podcasts.apple.com/podcast/episode-246-how-toxic-marriage-advice-mirrors-coercive/id1448888894?i=1000665444528"
      }
    }
  ]
}