{
  "_ts": 0,
  "id": "bb8f4739-d00e-461e-81e9-ebeb69af8475",
  "name": "Bare \u0026 Unscripted",
  "youTubeChannelId": "UC3B8tnwJ7xwgm7k3nH2ahBw",
  "episodes": [
    {
      "id": "0453977c-bac5-4b10-9b3b-ce9ae089741c",
      "title": "Recruited to join  a cult Shincheonji (SCJ) in Cape Town PART 2 | Cult Exposed #shincheonji #scj",
      "description": "TRUE STORY - I was almost recruited to join a cult in Cape Town.\n\nBe careful! Pray for the Spirit of Discernment. \n\n This is to warn people to be careful out there. The devil comes as an angel of light. \n\nThese people use all the tactics of Satan to get you to buy into their \u0022Church\u0022\n\nThey are liars and manipulators just like their father Satan! \n\nBe careful of anyone who wants to \u0022be your friend\u0022 but they are Wolfs in Sheeps Clothing. #shincheonji #scj #SCJ\n\nThe world we live in is Evil. \n\nPray for every interaction you make.\n\nWhat is the Shincheonji Church of Jesus? SCJ\n\nShincheonji Church of Jesus, the Temple of the Tabernacle of the Testimony (SCJ), commonly known as Shincheonji Church of Jesus or simply Shincheonji New Heaven and New Earth, is a new religious movement established in South Korea by Lee Man-hee. It is considered a pseudo-religion or cult by mainstream churches.\n\nShincheonji\u0027s teachings and beliefs claim that their founder Lee is the pastor promised in the New Testament and that the Book of Revelation is written in secret metaphors (parables) which only Lee is capable of deciphering.  This is what Jesus warned about in Matthew 7:15 and Matthew 24:24 about false prophets coming in sheep’s clothing but are ravenous wolves, and those in this movement believe they speak on behalf of Christ as a witness!\n\nShincheonji pretends to be Christian and yet denies the Trinity and the Deity of Christ, claiming that it was a man-made concept invented by the Council of Nicaea in 325 AD, while demoting Jesus to be a \u0022Promised Pastor\u0022 or basically a prophet.  They believe that their leader, Lee Man-hee, is the \u0022Advocate\u0022 mentioned in John 14:16, and that salvation can only be found through his Testimony and organization.  \n\nThe apostle Paul warned about those who preach a different/another gospel in Galatians 1:6-9 which the Shincheonji Church of Jesus is teaching leading many people astray into a false religious Cult.\n\nThis group is currently infiltrating churches throughout the world, using deceptive wolf in sheep\u0027s clothing tactics to propagate. To learn more about this group, visit: \n\nhttps://www.examiningthescj.com/\nChris Interview about SCJ:\n\nhttps://www.youtube.com/watch?v=rf0Rn-_yr2A\n\nhttps://www.youtube.com/watch?v=l87mwJh1ujM\n\n\n\nOther helpful resources...\n\nhttp://truthaboutshincheonji.com/\n\nhttp://shinchonjiandthebible.blogspot...\n\nhttps://www.reddit.com/r/Shincheonji/\n\nMan Hee Lee\u0027s past:   \n\nhttps://www.youtube.com/watch?v=W_0GAmSODb0\n\nGerman video that goes into detail about how deceptive SCJ is and the information collection, manipulation, etc. which happens within:   \n\nhttps://www.youtube.com/watch?v=F0WxOE3bUh8",
      "release": "2024-08-14T09:07:35Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "Lu4nXawzko8",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Lu4nXawzko8"
      }
    },
    {
      "id": "20a52c86-13be-495b-8070-01bf02d2e225",
      "title": "Recruited to join  a cult Shincheonji (SCJ) in Cape Town | Cult Exposed #shincheonji",
      "description": "TRUE STORY - I was almost recruited to join a cult in Cape Town.\n\nBe careful! Pray for the Spirit of Discernment. \n\n This is to warn people to be careful out there. The devil comes as an angel of light. \n\nThese people use all the tactics of Satan to get you to buy into their \u0022Church\u0022\n\nThey are liars and manipulators just like their father Satan! \n\nBe careful of anyone who wants to \u0022be your friend\u0022 but they are Wolfs in Sheeps Clothing. #shincheonji #scj #SCJ\n\nThe world we live in is Evil. \n\nPray for every interaction you make.",
      "release": "2024-07-28T13:51:02Z",
      "duration": "01:00:58",
      "explicit": false,
      "youTubeId": "n6EhojfT8vM",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n6EhojfT8vM"
      }
    }
  ]
}