{
  "_ts": 0,
  "id": "d1f0f8c2-d92d-49ab-a684-258f390a62c8",
  "name": "Bath Royal Literary and Scientific Institution",
  "youTubeChannelId": "UCmSry14NpKQtLhGtIcr4oUQ",
  "episodes": [
    {
      "id": "a761056a-3695-48a7-98e2-3dbffab88b5a",
      "title": "How Japan’s Death Cult led to Hiroshima",
      "description": "How Japan’s Death Cult led to Hiroshima  | Francis Pike | Wednesday 10th Monday 27th May, 2024, Queen Square, Bath. \n\nIn the 1930s Japan developed a death cult, whose origins lay in a government-directed propaganda campaign after the overthrow of the Shogunate in 1868, when the ruling military cliques restored an Imperial system of government with Emperor Meiji as the Godhead central to the constitution and spiritual life of the nation.\n\nA bastardised Bushido cult emerged, combined with a Social-Darwinist belief in Japan’s manifest destiny to dominate Asia. In the Pacific War (1941-45) this resulted in the murderous brutality of Japanese forces (including in their treatment of POWs and civilians) and a kamikaze ethos.\n\nFrancis Pike, author of Hirohito’s War, The Pacific War, 1941-1945 [Bloomsbury 2015] examines the rise of this death cult and concludes that the atomic bombs dropped on Hiroshima and Nagasaki were used to bring the war to a speedy end and to save the lives of American troops, not, as has been argued, to prevent Soviet entry into the war against Japan.\n\nThank you for watching! Your Support Matters to Us The BRLSI is a charity, and this content is made possible by generous donations like yours. Please consider supporting us to continue developing new programmes for the promotion of Science, Literature, and the Arts. Visit https://www.brlsi.org/support-us/ or text: \u0027BRLSI 5\u0027 to 70085 to donate £5 \u0027BRLSI 10\u0027 to 70085 to donate £10 Every contribution, however big or small, is incredibly valuable. Together, we can make a difference. For more resources and information, visit www.brlsi.org",
      "release": "2024-06-27T18:00:32Z",
      "duration": "01:20:43",
      "explicit": false,
      "youTubeId": "ebKQASVnaxI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ebKQASVnaxI"
      }
    }
  ]
}