{
  "id": "c3dabb37-fd51-482a-9eca-4e3e91ba21e0",
  "name": "BBC News Mundo",
  "youTubeChannelId": "UCUBIrDsIVzRpKsClMlSlTpQ",
  "episodes": [
    {
      "id": "2cae4c9f-9706-46b0-9895-01821cd5f603",
      "title": "La red de Epstein con poderosos, ricos y famosos que revelan los nuevos archivos | BBC Mundo",
      "description": "Los nuevos archivos del caso Jeffrey Epstein vuelven a poner bajo la lupa la red de poder, contactos e influencia que el magnate construyó durante décadas. Aunque la aparición de un nombre en los documentos no implica culpabilidad, sí muestra el alcance de sus vínculos con figuras de la política, la tecnología, el deporte y el entretenimiento. Los millones de páginas publicadas detallan cómo operaba su sistema de captación y explotación, y por qué la investigación sigue generando repercusiones incluso años después de su muerte. En este video Facundo Macchi te explica la magnitud del caso, quiénes aparecen en los archivos y cómo funcionaba la red que Epstein construyó.\n\n● Guion, presentación y edición de video: Facundo Macchi \n● Editores: Natalia Pianzola y Max Seitz \n\nSuscríbete al canal aquí 👉 https://bbc.in/2UHHVsu\n-----------------------------------\n00:00:00 Intro\n\n-----------------------------------\n\nEste es el canal oficial de la BBC en español. Si te interesa la actualidad internacional y buscas una cobertura imparcial estás en el mejor lugar. \n\nAquí encontrarás videos sobre noticias y temas de actualidad en distintos formatos, desde videos explicativos y documentales hasta entrevistas. \n\nGracias por visitarnos. ¡Nos vemos!\n\n👉 Facebook  https://bbc.in/2BxEUCt\n👉 Instagram  https://bbc.in/43OOUn3 \n👉 TikTok        https://bbc.in/3TR5Swr\n👉 WhatsApp https://bbc.in/3PQpP5e\n👉 Twitter/X   https://bbc.in/32F72iZ\n👉 Newsletter https://bbc.in/3NzFCnq\n\n#bbcmundo",
      "release": "2026-02-05T19:00:03Z",
      "duration": "00:05:31",
      "explicit": false,
      "youTubeId": "NejLDcZSgF4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NejLDcZSgF4"
      }
    }
  ]
}