{
  "_ts": 0,
  "id": "7fa87282-0c44-4f83-8d69-f158ad46c152",
  "name": "BBC News",
  "youTubeChannelId": "UC16niRr50-MSBwiO3YDb3RA",
  "episodes": [
    {
      "id": "fcc26dcf-0c82-481a-918e-72fc1186901e",
      "title": "How TB Joshua’s whistle-blowing daughter took on ‘Daddy’ | BBC News",
      "description": "The late megachurch leader TB Joshua locked up his own daughter and tortured her for years before leaving her homeless on the streets of Lagos, Nigeria, the BBC has found.\n \nAjoke was one of the first whistle-blowers to reach out to the BBC about the abuse she witnessed at her father\u0027s church, the Synagogue Church of All Nations (Scoan).\n \nTB Joshua, who died in 2021 at the age of 57, is accused of widespread abuse and torture spanning almost 20 years.\n \nThe BBC contacted Scoan with the allegations in this investigation. It did not respond to them, but denied previous claims against TB Joshua.\n \nWatch all three episodes of Disciples: The Cult of TB Joshua on BBC iPlayer (UK only) or on the BBC Africa YouTube channel.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Scoan #Nigeria #BBCAfricaEye #BBCNews",
      "release": "2024-01-10T16:36:01Z",
      "duration": "00:08:30",
      "explicit": false,
      "youTubeId": "n3AajVu3c5s",
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n3AajVu3c5s"
      }
    },
    {
      "id": "8df3bfd9-3f40-4210-a4b3-85383689fbb2",
      "title": "Andrew Tate: Chats in \u0027War Room\u0027 suggest dozens of women groomed - BBC News",
      "description": "The BBC has uncovered evidence that dozens of women were potentially groomed into online sex work by the influencer Andrew Tate\u0027s all-male society, the \u0022War Room\u0022. \n\nA documentary team has spoken to whistle blowers and alleged victims.\n\nThey were given exclusive access to 12,000 pages of encrypted messages, which reveal the instructions given to war room members to make women gradually submit to their control.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#BBCNews",
      "release": "2023-08-31T21:24:26Z",
      "duration": "00:09:24",
      "explicit": false,
      "youTubeId": "XjariDtbyFU",
      "subjects": [
        "Hustler\u0027s University"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XjariDtbyFU"
      }
    },
    {
      "id": "296acbec-4a18-4ea4-a23c-a79cd815635d",
      "title": "Kenya cult death toll passes 200 - BBC News",
      "description": "More than 200 bodies have now been discovered in a Kenyan forest where followers of an evangelical pastor are thought to have starved themselves to death in the belief they could meet Jesus faster.\n\nOne woman, who fled the cult with her five children, said: \u0022I told myself I couldn\u0027t allow my children to die.”\n\nSurvivors are still being found hiding under trees and bushes in the 800-acre territory, but hundreds more people are still missing.\n\nSelf-proclaimed pastor Paul Mackenzie is now in custody.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Kenya #BBCNews",
      "release": "2023-05-19T13:00:53Z",
      "duration": "00:04:12",
      "explicit": false,
      "youTubeId": "JuOJTRKV7nY",
      "subjects": [
        "Evangelicalism",
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JuOJTRKV7nY"
      }
    },
    {
      "id": "42d6888a-bde2-4100-b211-4fc50f8c777d",
      "title": "Kenya ‘starvation cult’ death toll continues to rise - BBC News",
      "description": "The death toll among followers of a Kenyan cult who believed they would go to heaven if they starved themselves has risen to 90.\n\nThe number of people who died has been steadily rising as authorities continue to carry out exhumations of mass graves found in an 800 acre area of forest near the coastal town of Malindi.\n\nFifteen members of the Good News International Church were rescued from the forest last week.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Kenya #BBCNews",
      "release": "2023-04-26T15:45:04Z",
      "duration": "00:02:00",
      "explicit": false,
      "youTubeId": "_B8TSQoHJPk",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_B8TSQoHJPk"
      }
    },
    {
      "id": "511c38c5-0296-47ec-8ef7-3ed7b7eaf076",
      "title": "Inside the life coaching cult that takes over lives - BBC News",
      "description": "Lighthouse promises life coaching to help people realise their dreams. But an 18-month investigation by the BBC found it takes over people\u0027s lives, separates people from their loved ones and harasses its critics.\n\nLife coaching is a booming UK industry. There are an estimated 80,000 to 100,000 people working in the field. \n\nUnlike many therapists or counsellors most coaches generally say they focus more on clients\u0027 futures. In theory at least, they try to help people work out what they really want and how to get there.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Lighthouse #BBCNews",
      "release": "2023-04-05T18:29:36Z",
      "duration": "00:04:28",
      "explicit": false,
      "youTubeId": "o4PCe5xyegc",
      "subjects": [
        "Lighthouse International Group"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o4PCe5xyegc"
      }
    },
    {
      "id": "989feff2-2040-4732-beb9-fbae5b12c929",
      "title": "Is this Russian cult leader a fraud? - BBC News",
      "description": "The City of the Sun is home to a mysterious Russian cult known as the Church of the Last Testament. Its leader Vissarion used to be a traffic cop but now believes he is the second coming of Jesus Christ. Last September armed security officers stormed the City of the Sun and arrested Vissarion and two of his closest aides. They have been accused of embezzling funds from Vissarion’s followers and physically or mentally abusing them.\n \nBBC Russian’s Nataliya Zotova travelled to Siberia to find out more about what happened.\n \n\nPlease subscribe HERE http://bit.ly/1rbfUog #BBCNews",
      "release": "2021-01-24T11:11:02Z",
      "duration": "00:13:09",
      "explicit": false,
      "youTubeId": "lvKOOmpbPWA",
      "subjects": [
        "Last Testimentism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lvKOOmpbPWA"
      }
    },
    {
      "id": "d490f27a-dbc4-4924-8dd0-330f1e2a37c0",
      "title": "China\u0027s violent Christian cult: Church of Almighty God - BBC News",
      "description": "Subscribe to BBC News www.youtube.com/bbcnews\nVIDEO CONTAINS IMAGES YOU MIGHT FIND DISTRESSING. A Christian cult in China which has violence at its core gains international notoriety after a brutal murder in a fast food restaurant. With some of its members now on trial we hear what\u0027s behind these terrible crimes.  It\u0027s called the Church of Almighty God. This report from our China Editor, Carrie Gracie.\n\n\nSubscribe to BBC News HERE http://bit.ly/1rbfUog\nCheck out our website: http://www.bbc.com/news \nFacebook: http://www.facebook.com/bbcworldnews \nTwitter: http://www.twitter.com/bbcworld\nInstagram: http://instagram.com/bbcnews",
      "release": "2014-08-16T06:34:58Z",
      "duration": "00:03:33",
      "explicit": false,
      "youTubeId": "crQ9zeyd9hQ",
      "subjects": [
        "Eastern Lightning"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=crQ9zeyd9hQ"
      }
    }
  ]
}