{
  "id": "7fa87282-0c44-4f83-8d69-f158ad46c152",
  "name": "BBC News",
  "youTubeChannelId": "UC16niRr50-MSBwiO3YDb3RA",
  "episodes": [
    {
      "id": "abe845e7-1040-43e2-921d-ca4c1b747302",
      "title": "Comedian Russell Brand charged with rape | BBC News",
      "description": "Comedian and actor Russell Brand has been charged with rape, indecent assault and sexual assault between 1999 and 2005.\n \nThe charges relate to four separate women.\n \nBrand, 49, has previously denied the allegations, calling them \u0022very, very hurtful\u0022.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
      "release": "2025-04-04T13:25:35Z",
      "duration": "00:02:12",
      "explicit": false,
      "youTubeId": "trMfgkLEOEU",
      "subjects": [
        "Spiritual Narcissist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=trMfgkLEOEU"
      }
    },
    {
      "id": "fa0b6f14-501e-496f-87a5-d244c49c6496",
      "title": "Tate brothers report to Romania police after return from US | BBC News",
      "description": "British-American influencer Andrew Tate and his brother Tristan have appeared at a police station after returning to Romania from the US.\n \nThe brothers registered with the authorities in the capital, Bucharest, in a legal formality to demonstrate their compliance with an ongoing criminal investigation.\n \nThey are under investigation in Romania for forming an organised criminal group, human trafficking, trafficking of minors and money laundering. Andrew also faces allegations of rape and sex with a minor. The pair deny all accusations.\n \nAfter leaving the police station, Andrew, 38, refused to say whether he would remain in Romania, but vowed to clear his name both there and in the UK.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
      "release": "2025-03-24T14:00:19Z",
      "duration": "00:03:23",
      "explicit": false,
      "youTubeId": "I-hrvULfPAo",
      "subjects": [
        "Human Trafficking",
        "Hustler\u0027s University"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I-hrvULfPAo"
      }
    },
    {
      "id": "dd2dd330-ca1a-4ffd-8838-a92759df16cc",
      "title": "Calls for Archbishop of York to resign over Church failings in sex abuse case | BBC News",
      "description": "The Archbishop of York, Stephen Cottrell, is facing calls to resign over his handling of a sexual abuse case, days before he takes temporary charge of the Church of England.\n \nAs Bishop of Chelmsford, Mr Cottrell let priest David Tudor remain in post in the diocese despite knowing he had been barred by the Church from being alone with children and had paid compensation to a sexual abuse victim.\n \nTudor was only banned from ministry two months ago, after he admitted historical sex abuse allegations relating to two girls.\n \nMr Cottrell has responded saying he is \u0022deeply sorry\u0022 that action could not be taken earlier, but that was the situation he inherited.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#ChurchofEngland #Archbishop #BBCNews",
      "release": "2024-12-16T18:00:20Z",
      "duration": "00:09:05",
      "explicit": false,
      "youTubeId": "PJoHtUekSpY",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PJoHtUekSpY"
      }
    },
    {
      "id": "a1a1c52e-ff31-4905-976e-929626c59123",
      "title": "Court on Camera - \u0027Cult\u0027 Kidnap Plot Sentencing",
      "description": "Four \u0027cult\u0027 members who stormed an Essex court, to try and abduct a coroner, are sentenced",
      "release": "2024-10-29T00:00:00",
      "duration": "00:30:00",
      "explicit": true,
      "subjects": [
        "Federal Postal Court"
      ],
      "urls": {
        "bbc": "https://www.bbc.co.uk/iplayer/episode/l0056tbd/court-on-camera-cult-kidnap-plot-sentencing"
      }
    },
    {
      "id": "f67e1820-2561-4ba9-9fd1-7bff81552d58",
      "title": "Ex-Abercrombie \u0026 Fitch CEO charged with sex trafficking | BBC News",
      "description": "The former CEO of Abercrombie \u0026 Fitch (A\u0026F) and his partner have been arrested and charged with running a prostitution and international sex trafficking business.\n\nUS authorities arrested former fashion executive Mike Jeffries, his partner Matthew Smith and the couple’s alleged middleman - James Jacobson.\n\nFederal prosecutors said the men used force, fraud and coercion to engage in \u0022violent and exploitive\u0022 sexual acts.\n\nIt’s alleged that Mr Jeffries used his wealth, power and status as CEO of A\u0026F \u0022to traffic men for his own sexual pleasure\u0022 and for the pleasure of his partner, Mr Smith.\n\nMr Jeffries and his partner have previously denied any wrongdoing via their lawyers, and Mr Jeffries\u0027 lawyer told the BBC that they would \u0022respond in detail to the allegations after the Indictment is unsealed\u0022.\n\nA lawyer for Mr Smith has been approached for new comment. A\u0026F declined to comment on the latest developments.\n\nSophie Raworth presents BBC News at Ten reporting by Rianna Croxford.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
      "release": "2024-10-22T21:52:40Z",
      "duration": "00:02:44",
      "explicit": false,
      "youTubeId": "64Z6LgF6Hc0",
      "subjects": [
        "Abercrombie \u0026 Fitch",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=64Z6LgF6Hc0"
      }
    },
    {
      "id": "e4ab4e52-2a8d-4bcd-8f71-354950ebe33d",
      "title": "Mohamed Al Fayed: Met Police only sought charges for two victims of former Harrods owner | BBC News",
      "description": "The Metropolitan Police only asked prosecutors to decide whether to charge Mohamed Al Fayed in relation to two out of 21 women who accused him of sexual offences while he was alive, the BBC has established.\n\nIt raises serious questions about the Met’s response to women who said they were abused by the former Harrods owner, who died aged 94 last year.\n\nScotland Yard refused to answer the BBC’s questions about how many women it sought charging decisions on, but the Crown Prosecution Service has now provided the information.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
      "release": "2024-10-19T15:10:00Z",
      "duration": "00:03:42",
      "explicit": false,
      "youTubeId": "_BKpULEP7cM",
      "subjects": [
        "Mohamed Al-Fayed"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_BKpULEP7cM"
      }
    },
    {
      "id": "d16d3dfd-390e-4f02-bef7-e837f86b5d0c",
      "title": "Mohamed Al Fayed was \u0027a monster enabled by Harrods\u0027, says lawyer | BBC News",
      "description": "Mohamed Al Fayed, the former owner of department store Harrods, \u0022was a monster\u0022 enabled by a system that \u0022pervaded\u0022 the London store, a lawyer for his accusers has said.\n \nAl Fayed, who died in 2023, was described as a \u0022sexual predator\u0022 who assaulted staff and threatened them over a 25-year-period, barristers representing dozens of women told a press conference in London.\n \nDean Armstrong KC said it was time Harrods \u0022took responsibility\u0022 after allegations against Fayed were made in a BBC investigation this week.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#MohamedAlFayed #Harrods #BBCNews",
      "release": "2024-09-20T16:38:04Z",
      "duration": "00:07:05",
      "explicit": false,
      "youTubeId": "wjz8PeaJ8x8",
      "subjects": [
        "Mohamed Al-Fayed"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wjz8PeaJ8x8"
      }
    },
    {
      "id": "1fadbba3-4e4a-4ff1-977b-a7ee322e7ada",
      "title": "Brazilian Instagram influencer and ex-model jailed for trafficking and slavery | BBC News",
      "description": "Former Brazilian model, wellness influencer and spiritual life coach Kat Torres was an inspiration and a lifeline to women all over the world. \n \nMore than a million people on Instagram followed her extraordinary career trajectory from extreme poverty in Brazil to a European modelling career and a life of luxury in the US.\n \nBut behind the perfectly curated posts is a story of sexual exploitation and human trafficking that led to missing women and sent their families and the FBI on a desperate search to find them.\n \nAfter months of investigations, a team from BBC Eye and BBC News Brasil uncovers a wellness empire built on half-truths and lies. \n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#KatTorres #Brazil #BBCNews",
      "release": "2024-07-15T18:30:26Z",
      "duration": "00:13:30",
      "explicit": false,
      "youTubeId": "h4R0D6WhVog",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h4R0D6WhVog"
      }
    },
    {
      "id": "fcc26dcf-0c82-481a-918e-72fc1186901e",
      "title": "How TB Joshua’s whistle-blowing daughter took on ‘Daddy’ | BBC News",
      "description": "The late megachurch leader TB Joshua locked up his own daughter and tortured her for years before leaving her homeless on the streets of Lagos, Nigeria, the BBC has found.\n \nAjoke was one of the first whistle-blowers to reach out to the BBC about the abuse she witnessed at her father\u0027s church, the Synagogue Church of All Nations (Scoan).\n \nTB Joshua, who died in 2021 at the age of 57, is accused of widespread abuse and torture spanning almost 20 years.\n \nThe BBC contacted Scoan with the allegations in this investigation. It did not respond to them, but denied previous claims against TB Joshua.\n \nWatch all three episodes of Disciples: The Cult of TB Joshua on BBC iPlayer (UK only) or on the BBC Africa YouTube channel.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Scoan #Nigeria #BBCAfricaEye #BBCNews",
      "release": "2024-01-10T16:36:01Z",
      "duration": "00:08:30",
      "explicit": false,
      "youTubeId": "n3AajVu3c5s",
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n3AajVu3c5s"
      }
    },
    {
      "id": "4407fefc-566d-45be-a3fa-931b2833caf6",
      "title": "TB Joshua: How the pastor covered up fatal Lagos building collapse | BBC News",
      "description": "The late Nigerian megachurch leader TB Joshua hid dead bodies and intimidated families, to cover up his role in the collapse of a building which killed at least 116 people at his church in 2014, a BBC investigation has found.\n \nThe collapse is one of the worst disasters to ever strike a place of worship in Africa.\n \nFor the first time, insiders from TB Joshua\u0027s Synagogue Church of All Nations (Scoan) in Lagos presented evidence of what caused the incident nearly 10 years ago.\n \nIt comes after evidence uncovered by the BBC showed TB Joshua, the founder of one of the world\u0027s biggest Christian evangelical churches, caused widespread abuse and torture.\n \nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCAfricaEye #TBJoshua #BBCNews",
      "release": "2024-01-09T16:00:23Z",
      "duration": "00:09:19",
      "explicit": false,
      "youTubeId": "ghV0sZdMNSc",
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ghV0sZdMNSc"
      }
    },
    {
      "id": "7de3d2d1-6e9e-4ae8-9fcb-57ba7e6c46b2",
      "title": "YouTuber Ruby Franke pleads guilty to child abuse #Shorts #RubyFranke #BBCNews",
      "release": "2023-12-19T15:45:02Z",
      "duration": "00:00:32",
      "explicit": false,
      "youTubeId": "fl6n3CvFGIQ",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fl6n3CvFGIQ"
      }
    },
    {
      "id": "8df3bfd9-3f40-4210-a4b3-85383689fbb2",
      "title": "Andrew Tate: Chats in \u0027War Room\u0027 suggest dozens of women groomed - BBC News",
      "description": "The BBC has uncovered evidence that dozens of women were potentially groomed into online sex work by the influencer Andrew Tate\u0027s all-male society, the \u0022War Room\u0022. \n\nA documentary team has spoken to whistle blowers and alleged victims.\n\nThey were given exclusive access to 12,000 pages of encrypted messages, which reveal the instructions given to war room members to make women gradually submit to their control.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#BBCNews",
      "release": "2023-08-31T21:24:26Z",
      "duration": "00:09:24",
      "explicit": false,
      "youTubeId": "XjariDtbyFU",
      "subjects": [
        "Hustler\u0027s University"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XjariDtbyFU"
      }
    },
    {
      "id": "296acbec-4a18-4ea4-a23c-a79cd815635d",
      "title": "Kenya cult death toll passes 200 - BBC News",
      "description": "More than 200 bodies have now been discovered in a Kenyan forest where followers of an evangelical pastor are thought to have starved themselves to death in the belief they could meet Jesus faster.\n\nOne woman, who fled the cult with her five children, said: \u0022I told myself I couldn\u0027t allow my children to die.”\n\nSurvivors are still being found hiding under trees and bushes in the 800-acre territory, but hundreds more people are still missing.\n\nSelf-proclaimed pastor Paul Mackenzie is now in custody.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Kenya #BBCNews",
      "release": "2023-05-19T13:00:53Z",
      "duration": "00:04:12",
      "explicit": false,
      "youTubeId": "JuOJTRKV7nY",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JuOJTRKV7nY"
      }
    },
    {
      "id": "42d6888a-bde2-4100-b211-4fc50f8c777d",
      "title": "Kenya ‘starvation cult’ death toll continues to rise - BBC News",
      "description": "The death toll among followers of a Kenyan cult who believed they would go to heaven if they starved themselves has risen to 90.\n\nThe number of people who died has been steadily rising as authorities continue to carry out exhumations of mass graves found in an 800 acre area of forest near the coastal town of Malindi.\n\nFifteen members of the Good News International Church were rescued from the forest last week.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Kenya #BBCNews",
      "release": "2023-04-26T15:45:04Z",
      "duration": "00:02:00",
      "explicit": false,
      "youTubeId": "_B8TSQoHJPk",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_B8TSQoHJPk"
      }
    },
    {
      "id": "511c38c5-0296-47ec-8ef7-3ed7b7eaf076",
      "title": "Inside the life coaching cult that takes over lives - BBC News",
      "description": "Lighthouse promises life coaching to help people realise their dreams. But an 18-month investigation by the BBC found it takes over people\u0027s lives, separates people from their loved ones and harasses its critics.\n\nLife coaching is a booming UK industry. There are an estimated 80,000 to 100,000 people working in the field. \n\nUnlike many therapists or counsellors most coaches generally say they focus more on clients\u0027 futures. In theory at least, they try to help people work out what they really want and how to get there.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Lighthouse #BBCNews",
      "release": "2023-04-05T18:29:36Z",
      "duration": "00:04:28",
      "explicit": false,
      "youTubeId": "o4PCe5xyegc",
      "subjects": [
        "Lighthouse International Group"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o4PCe5xyegc"
      }
    },
    {
      "id": "c6d7a81c-3e05-4970-9d5f-7c5fbfe64908",
      "title": "How a new Christian right is changing US politics - BBC News",
      "description": "A new battle of faith is being driven by some pastors and politicians in the United States.\n\nTheir central message is that the country\u0027s conservative Christian way of life is under threat, and American society is moving in the wrong direction. \n\nThe BBC’s Barbara Plett Usher explores the impact of this growing movement on US politics.\n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\n#US #America #BBCNews",
      "release": "2022-11-28T19:30:05Z",
      "duration": "00:25:53",
      "explicit": false,
      "youTubeId": "cnG-BI98-_0",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cnG-BI98-_0"
      }
    },
    {
      "id": "1e89300e-be43-4cb3-b60c-67532714e23e",
      "title": "Japan begins investigation into church in wake of Shinzo Abe killing - BBC News",
      "description": "The Japanese government has begun an official investigation into the Unification Church months after former Prime Minister Shinzo Abe was shot dead, allegedly by a man who had a grudge against the group.\n\nThere have been recent revelations about links between the religious group and the governing Liberal Democratic Party.\n\nThe church has been under scrutiny since Abe\u0027s assassination in July, with the suspect saying his family had been bankrupted by donations to the group.\n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\n#Japan #BBCNews",
      "release": "2022-11-22T18:30:39Z",
      "duration": "00:03:29",
      "explicit": false,
      "youTubeId": "e-nSxGHSS_k",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e-nSxGHSS_k"
      }
    },
    {
      "id": "e642f16a-f2dc-40c8-9d94-5558cf597ab3",
      "title": "What QAnon followers believe now - BBC News",
      "description": "A year ago supporters of outgoing President Donald Trump stormed the US Capitol. Many of them were followers of the QAnon conspiracy theory, which saw Trump as a hero who would defeat a Satan-worshipping global cabal. \n\nA survey by the polling organisation Ipsos Mori has found that 7% of Americans still believe this conspiracy theory - despite a lack of any evidence and the fact that QAnon\u0027s many predictions never came true. \n\nSo who are these people? \n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\n#BBCNews",
      "release": "2022-01-07T00:34:21Z",
      "duration": "00:11:46",
      "explicit": false,
      "youTubeId": "jzsiDRP5gXc",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jzsiDRP5gXc"
      }
    },
    {
      "id": "7bff3ced-1aa2-4b33-aed4-219016504a55",
      "title": "London teenager who murdered sisters influenced by satanic beliefs - BBC News",
      "description": "Teenager Danyal Hussein murdered two sisters in a London park last year - seemingly influenced to do so by a satanic web forum that contained instructions about demonic pacts that mirror his crime.\n\nConvicted of killing sisters Bibaa Henry and Nicole Smallman, the BBC has uncovered new evidence that Hussein was a member of a web forum run by an American self-styled black magician.\n\nHe encouraged murder in some of his posts, including for a violent Satanic group that’s been cited as an influence on seven young men convicted of neo-Nazi terror offences in the UK over the past two years.\n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\n#BBCNews",
      "release": "2021-08-15T13:30:04Z",
      "duration": "00:05:58",
      "explicit": false,
      "youTubeId": "LmhNfUqVX9s",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LmhNfUqVX9s"
      }
    },
    {
      "id": "989feff2-2040-4732-beb9-fbae5b12c929",
      "title": "Is this Russian cult leader a fraud? - BBC News",
      "description": "The City of the Sun is home to a mysterious Russian cult known as the Church of the Last Testament. Its leader Vissarion used to be a traffic cop but now believes he is the second coming of Jesus Christ. Last September armed security officers stormed the City of the Sun and arrested Vissarion and two of his closest aides. They have been accused of embezzling funds from Vissarion’s followers and physically or mentally abusing them.\n \nBBC Russian’s Nataliya Zotova travelled to Siberia to find out more about what happened.\n \n\nPlease subscribe HERE http://bit.ly/1rbfUog #BBCNews",
      "release": "2021-01-24T11:11:02Z",
      "duration": "00:13:09",
      "explicit": false,
      "youTubeId": "lvKOOmpbPWA",
      "subjects": [
        "Last Testimentism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lvKOOmpbPWA"
      }
    },
    {
      "id": "44643662-9b81-4d7c-ba69-6cf57bf7c6a8",
      "title": "QAnon, coronavirus and the conspiracy cult - BBC News",
      "description": "A bizarre conspiracy theory has surged in popularity in the US since the pandemic, according to exclusive research seen by the BBC.\n\nQAnon and its believers say that Donald Trump is here to save the world from an evil cabal of paedophiles and it’s had a surprising level of interest around the world from Brazil to Germany, the UK and Indonesia.\n\nAnd this week Twitter announced it would delete 7,000 QAnon-related accounts, saying it hoped the action would help to prevent \u0022offline harm\u0022.\n\nBBC Population Correspondent Stephanie Hegarty has spoken to QAnon followers and their families to find out why this cultish conspiracy has gained so much traction.\n\nProduced by Emma Ailes\n\nEdited by Emma Ailes \u0026 Robert Timothy\n\nAnimation by Peter Caires\n\nPlease subscribe HERE http://bit.ly/1rbfUog",
      "release": "2020-07-27T15:09:24Z",
      "duration": "00:12:26",
      "explicit": false,
      "youTubeId": "4XTZbYtwZJQ",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4XTZbYtwZJQ"
      }
    },
    {
      "id": "a656e24f-1037-42bf-8ae5-6106a49934d2",
      "title": "The woman encouraging her followers to visualise death - BBC News",
      "description": "The BBC has heard testimony that the teachings of spiritual influencer Teal Swan may have contributed to the suicides of at least two of her followers. \nSwan, who has said that death can be a re-set button - has hundreds of thousands of followers across social media platforms and her Youtube channel has over 78million views.\n But mental health experts say her teachings around suicide could be  dangerous. \nOur global religion reporter Lebo Diseko reports.\n\n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\nGetting help\nCanada and US:\nFrom Canada or US: If you\u0027re in an emergency, please call 911\nIn the US, you can call the National Suicide Prevention Lifeline on 1-800-273-8255 (TALK), or the Crisis Test Line by texting HOME to 741741, or visit SpeakingOfSuicide: https://www.speakingofsuicide.com/resources/\nYoung people in need of help can call Kids Help Phone on 1-800-668-6868\n\nUK:\nIf you are in the UK, you can call the Samaritans on 116123\nBBC Action Line has support and more information on emotional distress: https://www.bbc.co.uk/programmes/articles/4WLs5NlwrySXJR2n8Snszdg/emotional-distress-information-and-support",
      "release": "2019-11-25T15:37:13Z",
      "duration": "00:11:03",
      "explicit": false,
      "youTubeId": "zKsPnKlZRS0",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zKsPnKlZRS0"
      }
    },
    {
      "id": "78dd86d2-69c9-4b75-8fa9-1e6bb3ba3fe0",
      "title": "\u0027Why I had to leave my ultra-Orthodox family\u0027 - BBC News",
      "description": "Would you be able to leave your family and friends, knowing you may never see them again, so you could follow your dreams?\n\nThat was the choice Izzy Posen, a Hasidic ultra-Orthodox Jew faced when he decided to leave his isolated religious community.\n\nHe told BBC World Service how his life has been transformed since breaking free.\n\nVideo produced by Trystan Young and Alice Porter\n\nPlease subscribe HERE http://bit.ly/1rbfUog",
      "release": "2019-01-14T10:56:05Z",
      "duration": "00:03:44",
      "explicit": false,
      "youTubeId": "-5Tz6pLH7ig",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-5Tz6pLH7ig"
      }
    },
    {
      "id": "23a64a7e-f6f7-4d0b-952f-4fd35aced86d",
      "title": "Charles Manson dies after four decades in prison - BBC News",
      "description": "Charles Manson was the head of a cult, which he directed to commit murders.\nIn 1969, he sent his followers, known as the Manson family, to kill seven people.\nRoman Polanski\u0027s heavily pregnant wife Sharon Tate was among the victims.\n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\nWorld In Pictures https://www.youtube.com/playlist?list=PLS3XGZxi7cBX37n4R0UGJN-TLiQOm7ZTP\nBig Hitters https://www.youtube.com/playlist?list=PLS3XGZxi7cBUME-LUrFkDwFmiEc3jwMXP\nJust Good News https://www.youtube.com/playlist?list=PLS3XGZxi7cBUsYo_P26cjihXLN-k3w246",
      "release": "2017-11-20T10:31:43Z",
      "duration": "00:01:48",
      "explicit": false,
      "youTubeId": "kfdC1O-W-Lw",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kfdC1O-W-Lw"
      }
    },
    {
      "id": "29a5d88e-ad0d-4e02-90e8-2ba09d2b87e7",
      "title": "R Kelly denies allegations of holding young women against their will - BBC News",
      "description": "Buzzfeed reports that Kelly lures young women into his inner circle and keeps them against their will inside his homes in a \u0022cult-like\u0022 atmosphere. The story says six women are being held in the star\u0027s properties, where he controls all aspects of their lives.\nBuzzfeed also interviewed three former members of Kelly\u0027s inner circle, and reports the singer controls every aspect of the women\u0027s lives: dictating \u0022what they eat, how they dress, when they bathe, when they sleep, and how they engage in sexual encounters that he records\u0022.\nThe superstar also confiscates the women\u0027s cell phones, the report says, barring contact with friends and family. He gives them new phones that they are only allowed to use to contact him or others with his permission.\nThe story was written by Jim DeRogatis, who has covered the allegations against R Kelly for two decades, principally for the Chicago Sun Times.\nAll of the women cited in his article are of legal age; and one has denied accusations that she is being held against her will.\n\u0022I\u0027m not being brainwashed or anything like that,\u0022 said 21-year-old Joycelyn Savage in a video call to TMZ. However, she would not reveal where she was speaking from, nor the nature of her relationship with Kelly.\nR Kelly\u0027s lawyer, Linda Mensch, has also issued a strongly-worded denial of the accusations.\n\u0022Mr Robert Kelly is both alarmed and disturbed at the recent revelations attributed to him,\u0022 the statement said.\n\u0022Mr Kelly unequivocally denies such allegations and will work diligently and forcibly to pursue his accusers and clear his name.\u0022\n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\nWorld In Pictures https://www.youtube.com/playlist?list=PLS3XGZxi7cBX37n4R0UGJN-TLiQOm7ZTP\nBig Hitters https://www.youtube.com/playlist?list=PLS3XGZxi7cBUME-LUrFkDwFmiEc3jwMXP\nJust Good News https://www.youtube.com/playlist?list=PLS3XGZxi7cBUsYo_P26cjihXLN-k3w246",
      "release": "2017-07-18T11:24:05Z",
      "duration": "00:01:47",
      "explicit": false,
      "youTubeId": "L1JwK6kNcOA",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L1JwK6kNcOA"
      }
    },
    {
      "id": "44d95121-83eb-428b-ad94-92acf20010c1",
      "title": "Father falsely accused of being a \u0027satanic cult paedophile ring leader\u0027 Victoria Derbyshire",
      "description": "Warning: contains a graphic description. A father falsely accused of abusing his two children as part of a \u0022satanic cult\u0022 has spoken of the \u0022horrific\u0022 allegations he faced. In an exclusive first interview, Ricky says he is still receiving death threats from people who believe them. But in March, a Family Court judge dismissed the claims, saying the children had been forced to make the allegations by their mother and her new partner. He spoke to Victoria about his ordeal.\nWarning: Contains a graphic description.\n\nYou can watch more Victoria Derbyshire films here Watch more films here http://bbc.in/1P39x2K\nSubscribe to BBC News HERE http://bit.ly/1rbfUog\nCheck out our website: http://www.bbc.com/news \nFacebook: http://www.facebook.com/bbcworldnews \nTwitter: http://www.twitter.com/bbcworld\nInstagram: http://instagram.com/bbcnews",
      "release": "2015-04-20T17:13:42Z",
      "duration": "00:22:57",
      "explicit": false,
      "youTubeId": "f5f9N6wmiLQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f5f9N6wmiLQ"
      }
    },
    {
      "id": "d490f27a-dbc4-4924-8dd0-330f1e2a37c0",
      "title": "China\u0027s violent Christian cult: Church of Almighty God - BBC News",
      "description": "Subscribe to BBC News www.youtube.com/bbcnews\nVIDEO CONTAINS IMAGES YOU MIGHT FIND DISTRESSING. A Christian cult in China which has violence at its core gains international notoriety after a brutal murder in a fast food restaurant. With some of its members now on trial we hear what\u0027s behind these terrible crimes.  It\u0027s called the Church of Almighty God. This report from our China Editor, Carrie Gracie.\n\n\nSubscribe to BBC News HERE http://bit.ly/1rbfUog\nCheck out our website: http://www.bbc.com/news \nFacebook: http://www.facebook.com/bbcworldnews \nTwitter: http://www.twitter.com/bbcworld\nInstagram: http://instagram.com/bbcnews",
      "release": "2014-08-16T06:34:58Z",
      "duration": "00:03:33",
      "explicit": false,
      "youTubeId": "crQ9zeyd9hQ",
      "subjects": [
        "Eastern Lightning"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=crQ9zeyd9hQ"
      }
    }
  ]
}