{
  "id": "b62968dd-c7eb-40ea-8744-5e154b78d3cc",
  "name": "BBC News Brasil",
  "youTubeChannelId": "UCthbIFAxbXTTQEC7EcQvP1Q",
  "episodes": [
    {
      "id": "d76054e1-5b5c-43a7-9e10-14d2730f1e51",
      "title": "Quem aparece nos novos arquivos do caso Epstein — e qual era a atuação dele no Brasil",
      "description": "Os novos arquivos do caso Jeffrey Epstein voltam a colocar sob escrutínio a rede de poder, contatos e influência que o magnata construiu durante décadas. \n\nEmbora a aparição de um nome nos documentos não implique culpabilidade, ela mostra o alcance de seus vínculos com figuras da política, da tecnologia, do esporte e do entretenimento. \n\nOs milhões de páginas publicadas detalham como funcionava seu sistema de aliciamento e exploração - inclusive no Brasil.\n\nNa última semana, o repórter da BBC News Brasil Luiz Fernando Toledo mostrou que um parceiro de Epstein conversou com ele sobre a intenção de comprar uma revista de moda no Brasil - e que eles teriam um contato direto no país para conseguir garotas, inclusive menores de idade.\n\nNeste vídeo, Shin Suzuki explica a magnitude do caso, quem aparece nos arquivos e como funcionava a rede que Epstein construiu.\n\nLeia as reportagens sobre o caso no site:\nhttps://www.bbc.com/portuguese/articles/cvg83wprk37o\nhttps://www.bbc.com/portuguese/articles/cm24mr6el23o\n\nSabia que estamos no WhatsApp? Clique aqui: bbc.in/zap\n\nCurtiu? Inscreva-se no canal da BBC News Brasil! E se quiser ler mais notícias, clique aqui: https://www.bbcbrasil.com\n\n#bbcnewsbrasil #bbcbrasil #epstein #epsteinfiles",
      "release": "2026-02-12T21:00:57Z",
      "duration": "00:08:37",
      "explicit": false,
      "youTubeId": "gGn1hGMyKt0",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gGn1hGMyKt0"
      }
    }
  ]
}