{
  "_ts": 0,
  "id": "7fa87282-0c44-4f83-8d69-f158ad46c152",
  "name": "BBC News",
  "youTubeChannelId": "UC16niRr50-MSBwiO3YDb3RA",
  "episodes": [
    {
      "id": "f67e1820-2561-4ba9-9fd1-7bff81552d58",
      "title": "Ex-Abercrombie \u0026 Fitch CEO charged with sex trafficking | BBC News",
      "description": "The former CEO of Abercrombie \u0026 Fitch (A\u0026F) and his partner have been arrested and charged with running a prostitution and international sex trafficking business.\n\nUS authorities arrested former fashion executive Mike Jeffries, his partner Matthew Smith and the couple’s alleged middleman - James Jacobson.\n\nFederal prosecutors said the men used force, fraud and coercion to engage in \u0022violent and exploitive\u0022 sexual acts.\n\nIt’s alleged that Mr Jeffries used his wealth, power and status as CEO of A\u0026F \u0022to traffic men for his own sexual pleasure\u0022 and for the pleasure of his partner, Mr Smith.\n\nMr Jeffries and his partner have previously denied any wrongdoing via their lawyers, and Mr Jeffries\u0027 lawyer told the BBC that they would \u0022respond in detail to the allegations after the Indictment is unsealed\u0022.\n\nA lawyer for Mr Smith has been approached for new comment. A\u0026F declined to comment on the latest developments.\n\nSophie Raworth presents BBC News at Ten reporting by Rianna Croxford.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
      "release": "2024-10-22T21:52:40Z",
      "duration": "00:02:44",
      "explicit": false,
      "youTubeId": "64Z6LgF6Hc0",
      "subjects": [
        "Abercrombie \u0026 Fitch",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=64Z6LgF6Hc0"
      }
    },
    {
      "id": "e4ab4e52-2a8d-4bcd-8f71-354950ebe33d",
      "title": "Mohamed Al Fayed: Met Police only sought charges for two victims of former Harrods owner | BBC News",
      "description": "The Metropolitan Police only asked prosecutors to decide whether to charge Mohamed Al Fayed in relation to two out of 21 women who accused him of sexual offences while he was alive, the BBC has established.\n\nIt raises serious questions about the Met’s response to women who said they were abused by the former Harrods owner, who died aged 94 last year.\n\nScotland Yard refused to answer the BBC’s questions about how many women it sought charging decisions on, but the Crown Prosecution Service has now provided the information.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
      "release": "2024-10-19T15:10:00Z",
      "duration": "00:03:42",
      "explicit": false,
      "youTubeId": "_BKpULEP7cM",
      "subjects": [
        "Mohamed Al-Fayed"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_BKpULEP7cM"
      }
    },
    {
      "id": "fcc26dcf-0c82-481a-918e-72fc1186901e",
      "title": "How TB Joshua’s whistle-blowing daughter took on ‘Daddy’ | BBC News",
      "description": "The late megachurch leader TB Joshua locked up his own daughter and tortured her for years before leaving her homeless on the streets of Lagos, Nigeria, the BBC has found.\n \nAjoke was one of the first whistle-blowers to reach out to the BBC about the abuse she witnessed at her father\u0027s church, the Synagogue Church of All Nations (Scoan).\n \nTB Joshua, who died in 2021 at the age of 57, is accused of widespread abuse and torture spanning almost 20 years.\n \nThe BBC contacted Scoan with the allegations in this investigation. It did not respond to them, but denied previous claims against TB Joshua.\n \nWatch all three episodes of Disciples: The Cult of TB Joshua on BBC iPlayer (UK only) or on the BBC Africa YouTube channel.\n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#Scoan #Nigeria #BBCAfricaEye #BBCNews",
      "release": "2024-01-10T16:36:01Z",
      "duration": "00:08:30",
      "explicit": false,
      "youTubeId": "n3AajVu3c5s",
      "subjects": [
        "T. B. Joshua"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n3AajVu3c5s"
      }
    },
    {
      "id": "8df3bfd9-3f40-4210-a4b3-85383689fbb2",
      "title": "Andrew Tate: Chats in \u0027War Room\u0027 suggest dozens of women groomed - BBC News",
      "description": "The BBC has uncovered evidence that dozens of women were potentially groomed into online sex work by the influencer Andrew Tate\u0027s all-male society, the \u0022War Room\u0022. \n\nA documentary team has spoken to whistle blowers and alleged victims.\n\nThey were given exclusive access to 12,000 pages of encrypted messages, which reveal the instructions given to war room members to make women gradually submit to their control.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#BBCNews",
      "release": "2023-08-31T21:24:26Z",
      "duration": "00:09:24",
      "explicit": false,
      "youTubeId": "XjariDtbyFU",
      "subjects": [
        "Hustler\u0027s University"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XjariDtbyFU"
      }
    },
    {
      "id": "296acbec-4a18-4ea4-a23c-a79cd815635d",
      "title": "Kenya cult death toll passes 200 - BBC News",
      "description": "More than 200 bodies have now been discovered in a Kenyan forest where followers of an evangelical pastor are thought to have starved themselves to death in the belief they could meet Jesus faster.\n\nOne woman, who fled the cult with her five children, said: \u0022I told myself I couldn\u0027t allow my children to die.”\n\nSurvivors are still being found hiding under trees and bushes in the 800-acre territory, but hundreds more people are still missing.\n\nSelf-proclaimed pastor Paul Mackenzie is now in custody.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Kenya #BBCNews",
      "release": "2023-05-19T13:00:53Z",
      "duration": "00:04:12",
      "explicit": false,
      "youTubeId": "JuOJTRKV7nY",
      "subjects": [
        "Evangelicalism",
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JuOJTRKV7nY"
      }
    },
    {
      "id": "42d6888a-bde2-4100-b211-4fc50f8c777d",
      "title": "Kenya ‘starvation cult’ death toll continues to rise - BBC News",
      "description": "The death toll among followers of a Kenyan cult who believed they would go to heaven if they starved themselves has risen to 90.\n\nThe number of people who died has been steadily rising as authorities continue to carry out exhumations of mass graves found in an 800 acre area of forest near the coastal town of Malindi.\n\nFifteen members of the Good News International Church were rescued from the forest last week.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Kenya #BBCNews",
      "release": "2023-04-26T15:45:04Z",
      "duration": "00:02:00",
      "explicit": false,
      "youTubeId": "_B8TSQoHJPk",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_B8TSQoHJPk"
      }
    },
    {
      "id": "511c38c5-0296-47ec-8ef7-3ed7b7eaf076",
      "title": "Inside the life coaching cult that takes over lives - BBC News",
      "description": "Lighthouse promises life coaching to help people realise their dreams. But an 18-month investigation by the BBC found it takes over people\u0027s lives, separates people from their loved ones and harasses its critics.\n\nLife coaching is a booming UK industry. There are an estimated 80,000 to 100,000 people working in the field. \n\nUnlike many therapists or counsellors most coaches generally say they focus more on clients\u0027 futures. In theory at least, they try to help people work out what they really want and how to get there.\n\nPlease subscribe here: http://bit.ly/1rbfUog\n\n#Lighthouse #BBCNews",
      "release": "2023-04-05T18:29:36Z",
      "duration": "00:04:28",
      "explicit": false,
      "youTubeId": "o4PCe5xyegc",
      "subjects": [
        "Lighthouse International Group"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o4PCe5xyegc"
      }
    },
    {
      "id": "989feff2-2040-4732-beb9-fbae5b12c929",
      "title": "Is this Russian cult leader a fraud? - BBC News",
      "description": "The City of the Sun is home to a mysterious Russian cult known as the Church of the Last Testament. Its leader Vissarion used to be a traffic cop but now believes he is the second coming of Jesus Christ. Last September armed security officers stormed the City of the Sun and arrested Vissarion and two of his closest aides. They have been accused of embezzling funds from Vissarion’s followers and physically or mentally abusing them.\n \nBBC Russian’s Nataliya Zotova travelled to Siberia to find out more about what happened.\n \n\nPlease subscribe HERE http://bit.ly/1rbfUog #BBCNews",
      "release": "2021-01-24T11:11:02Z",
      "duration": "00:13:09",
      "explicit": false,
      "youTubeId": "lvKOOmpbPWA",
      "subjects": [
        "Last Testimentism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lvKOOmpbPWA"
      }
    },
    {
      "id": "a656e24f-1037-42bf-8ae5-6106a49934d2",
      "title": "The woman encouraging her followers to visualise death - BBC News",
      "description": "The BBC has heard testimony that the teachings of spiritual influencer Teal Swan may have contributed to the suicides of at least two of her followers. \nSwan, who has said that death can be a re-set button - has hundreds of thousands of followers across social media platforms and her Youtube channel has over 78million views.\n But mental health experts say her teachings around suicide could be  dangerous. \nOur global religion reporter Lebo Diseko reports.\n\n\nPlease subscribe HERE http://bit.ly/1rbfUog\n\nGetting help\nCanada and US:\nFrom Canada or US: If you\u0027re in an emergency, please call 911\nIn the US, you can call the National Suicide Prevention Lifeline on 1-800-273-8255 (TALK), or the Crisis Test Line by texting HOME to 741741, or visit SpeakingOfSuicide: https://www.speakingofsuicide.com/resources/\nYoung people in need of help can call Kids Help Phone on 1-800-668-6868\n\nUK:\nIf you are in the UK, you can call the Samaritans on 116123\nBBC Action Line has support and more information on emotional distress: https://www.bbc.co.uk/programmes/articles/4WLs5NlwrySXJR2n8Snszdg/emotional-distress-information-and-support",
      "release": "2019-11-25T15:37:13Z",
      "duration": "00:11:03",
      "explicit": false,
      "youTubeId": "zKsPnKlZRS0",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zKsPnKlZRS0"
      }
    },
    {
      "id": "d490f27a-dbc4-4924-8dd0-330f1e2a37c0",
      "title": "China\u0027s violent Christian cult: Church of Almighty God - BBC News",
      "description": "Subscribe to BBC News www.youtube.com/bbcnews\nVIDEO CONTAINS IMAGES YOU MIGHT FIND DISTRESSING. A Christian cult in China which has violence at its core gains international notoriety after a brutal murder in a fast food restaurant. With some of its members now on trial we hear what\u0027s behind these terrible crimes.  It\u0027s called the Church of Almighty God. This report from our China Editor, Carrie Gracie.\n\n\nSubscribe to BBC News HERE http://bit.ly/1rbfUog\nCheck out our website: http://www.bbc.com/news \nFacebook: http://www.facebook.com/bbcworldnews \nTwitter: http://www.twitter.com/bbcworld\nInstagram: http://instagram.com/bbcnews",
      "release": "2014-08-16T06:34:58Z",
      "duration": "00:03:33",
      "explicit": false,
      "youTubeId": "crQ9zeyd9hQ",
      "subjects": [
        "Eastern Lightning"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=crQ9zeyd9hQ"
      }
    }
  ]
}