{
  "_ts": 0,
  "id": "edfc2ef7-a58a-4f61-9404-2056b76e2649",
  "name": "BBC Heart and Soul",
  "spotifyId": "4M1KnP5Fa1stLw29ND1ItS",
  "appleId": 339986757,
  "episodes": [
    {
      "id": "2c845457-f861-4cd0-900f-c6311a63a56f",
      "title": "Me, my autism and cults",
      "description": "By the time Richard Turner was in his mid-30s, he’d given away nearly all of his money to a church. Everything he held dear had been stripped bare by a religious community in the UK which claimed to have his best interests at heart. It took him years to piece together how this could have happened. It was only in recovery that he was diagnosed with autism, which he believes made him more susceptible to coercive control by a group he now regards as a cult.\n\nFor Heart and Soul, Richard takes us on his journey of self-discovery, sharing his faith experiences with other ‘cult survivors’, including one US man with Asperger’s Syndrome who has spent most of his adult life ‘cult-hopping’. How common are these extraordinary stories across the world? With very little academic research available, Richard is part of a growing movement working to understand the link between neurodivergence and cults.\n\n\n(Image: Group Of People Against Blurred Background. Credit: Getty Images / Emmanuel Lavigne / EyeEm)",
      "release": "2022-11-04T05:00:00Z",
      "duration": "00:26:30",
      "explicit": false,
      "spotifyId": "0C8PZEprpNjqOnOfRzFonm",
      "appleId": 1000585037336,
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0C8PZEprpNjqOnOfRzFonm",
        "apple": "https://podcasts.apple.com/podcast/me-my-autism-and-cults/id339986757?i=1000585037336",
        "bbc": "https://www.bbc.co.uk/sounds/play/w3ct4244"
      }
    },
    {
      "id": "4bb9ca74-3ecb-47fe-8032-ec51d0193e15",
      "title": "Jonestown: From socialism to slaughter - Part two",
      "description": "In 1978, over 900 US citizens died at Jonestown, a remote settlement in Guyana. The vast majority were members of a community run by the charismatic Rev Jim Jones, taking their own lives with poison under armed guard on his orders. But how did a church known for racial integration and practical help for the poor come to such a destructive end?  How could one man’s increasing paranoia have driven so many people, who had built a mission community from nothing in four years, into a seemingly pointless sacrifice?\n\nIn this second and final programme, Erin Martin – who herself grew up in a controlling religious group – hears from ex-members of Peoples Temple who explain how steadily increasing isolation made it so hard to leave the organisation. Vera Washington describes how she and seven others had to accelerate their escape plan when a leadership spy heard of it, and Jordan Vilchez relates how a faked assassination attempt on Jim Jones was used to reinforce their sense of threat from outside.\n\nThe move to the Guyanese jungle meant escape was almost impossible - Jim Jones’ son, Stephan, and a few others survived because they were on a visit to the capital, Georgetown. But could Jonestown have had a future? Tim Carter imagined paved streets and seeing his grandchildren there. And John Cobb still feels that if he hadn’t been in Georgetown with Stephan on November 8th, 1978, he could have prevented what was, before 9/11, the largest intentional loss of civilian lives in American history.\n\nProducer: Paul Arnold\n\n(Photo:Main entrance to Jonestown, with welcome sign over the road. The sign reads Welcome to Jonestown, on the top line; the next line reads Peoples Temple Agricultural Project, May 1978. Credit Jon Moore/The Jonestown Institute).",
      "release": "2020-12-11T00:00:00Z",
      "duration": "00:26:30",
      "explicit": false,
      "spotifyId": "3dtnXt0ackCtf0kEFGkxBO",
      "appleId": 1000502071982,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3dtnXt0ackCtf0kEFGkxBO",
        "apple": "https://podcasts.apple.com/podcast/jonestown-from-socialism-to-slaughter-part-two/id339986757?i=1000502071982",
        "bbc": "https://www.bbc.co.uk/sounds/play/w3ct1csl"
      }
    },
    {
      "id": "91bb6b1d-8efb-4568-862e-74911cb23018",
      "title": "Jonestown: From socialism to slaughter - Part one",
      "description": "In 1978, over 900 US citizens died at Jonestown, a remote settlement in Guyana. The vast majority were members of a community run by the charismatic Rev Jim Jones, taking their own lives under armed guard on his orders. But how did a church known for racial integration and practical help for the poor come to such a destructive end?  How could one man’s increasing paranoia have driven so many people, who had built a mission community from nothing in four years, into a seemingly pointless sacrifice?\n\nIn these programmes, Erin Martin – who herself grew up in a religious group that exercised strong control over its members – hears from survivors of what’s become known as the Jonestown Massacre, an event that captivated and horrified the US and international media.\n\nContributors include Stephan Jones, son of the Rev Jim Jones; Vera Washington, for whom Peoples Temple was “a wonderful, warm family” before it all went wrong; Jordan Vilchez, who at 16 already belonged to Jones’ inner circle; John Cobb, Leslie Wagner-Wilson, Tim Carter and Mike Cartmell, who each lost several family members in Jonestown; and Fielding M McGehee III, Temple archivist and Research Director at the Alternative Considerations of Jonestown website. \n\nBetween them, they reflect on the attraction of Peoples Temple, trace the road that ended with the destruction of the Jonestown community, and explain how they escaped with their lives. And they try to answer one crucial question: what could have led an idealistic group of community-minded people to such destruction?\n\nProducer: Paul Arnold\n\n(Photo:The local tourist office has placed signs to mark the site of Jonestown, Guyana. Credit: Getty Images)",
      "release": "2020-12-04T00:00:00Z",
      "duration": "00:26:30",
      "explicit": false,
      "spotifyId": "4k0Z9W1rG6fC7iSD1Vkede",
      "appleId": 1000501334402,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4k0Z9W1rG6fC7iSD1Vkede",
        "apple": "https://podcasts.apple.com/podcast/jonestown-from-socialism-to-slaughter-part-one/id339986757?i=1000501334402",
        "bbc": "https://www.bbc.co.uk/sounds/play/w3ct1csk"
      }
    }
  ]
}