{
  "id": "bbd0c1af-891f-4e26-9ffb-a7f896a0b4f3",
  "name": "Be There in Five",
  "spotifyId": "50yguz7U9fBYQisQIc9hLP",
  "appleId": 1350320411,
  "episodes": [
    {
      "id": "963c98e7-5f35-405d-9175-b63c3944fdec",
      "title": "Twin Flames \u0026 Love Has Won: A Culty Double Feature",
      "description": "This week, we have a classic BTI5 deep dive about two cult documentaries Kate watched this week, Escaping Twin Flames and Love Has Won. She feels confusion and rage galore as she explores each organization’s core values, quirks, tactics, scandals, and leaders to try and understand what it means to be a believer in someone who, despite having objectively zero charisma or appeal, manages to gain control of your entire existence. She also examines details she felt were left out of Love Has Won, such as the contents of their curriculum, untold stories of people left out in the desert to die, and why she feels like it makes no sense that Miguel/Michael put the money in the bag and he stole the keys, and no one’s asking questions.Be on the lookout for a bonus episode about a third cult that was cut from the broadcast at patreon.com/bethereinfivePre order my book, One in a Millennial here!Get your first book for $5 with code BETHEREINFIVE at bookofthemonth.com.Right now we have a special discount just for our listeners. Get 10% off your first order sitewide with code BTIF at OSEAMalibu.com. To get 15% off your next gift, go to UNCOMMONGOODS.com/BETHEREINFIVE. Don’t miss out on this limited time offer! Uncommon Goods. We’re all out of the ordinary.",
      "release": "2023-12-03T23:53:34Z",
      "duration": "02:10:03.0960000",
      "explicit": false,
      "spotifyId": "6uRbze5Yn1BlCT2d8GtfzY",
      "appleId": 1000637365821,
      "subjects": [
        "Twin Flames Universe",
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6uRbze5Yn1BlCT2d8GtfzY",
        "apple": "https://podcasts.apple.com/podcast/twin-flames-love-has-won-a-culty-double-feature/id1350320411?i=1000637365821"
      }
    }
  ]
}