{
  "id": "23777156-0f38-416e-9615-417881ee4de4",
  "name": "Beers with Queers: A True Crime Podcast",
  "spotifyId": "6HRsEjMxyJXPi5dlZqAPFL",
  "appleId": 1571643278,
  "episodes": [
    {
      "id": "dbb6bd4f-d950-4b4d-8430-57f0395a70f2",
      "title": "154. Adolfo de Jesús Constanzo and the Narcosatánicos",
      "description": "A cult built on blood. A leader who believed he was a god. And a trail of bodies that blurred the line between faith and horror. In the late 1980s, Mexico’s borderlands became the stage for one of the most disturbing sagas in modern history. Adolfo de Jesús Constanzo was charismatic, ruthless, and deeply entwined in the drug world led a cult known as the Narcosatánicos. Their rituals promised protection and power, but what they demanded in return was unthinkable. From Mexico City’s elite to Matamoros cartel enforcers, followers worshiped him like a saint and feared him like the devil. This episode dives deep into the intersection of faith, fear, and corruption in a story that still shocks the world. We unravel how a self-proclaimed high priest turned Palo Mayombe rituals into a reign of terror, one that would end with an American college student’s disappearance and a discovery that would horrify two nations. Hosted by Jordi and Brad, Beers With Queers brings chilling crimes, queer stories, and twisted justice to light—all with a cold one in hand. Press play, grab a drink, and join us as we uncover the darkest corners of LGBTQ\u0026#43; history.",
      "release": "2025-10-14T01:07:48Z",
      "duration": "00:49:35.0560000",
      "explicit": false,
      "spotifyId": "5aGuocFrSpwQcR48mZSire",
      "appleId": 1000731725669,
      "subjects": [
        "Adolfo Constanzo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5aGuocFrSpwQcR48mZSire",
        "apple": "https://podcasts.apple.com/podcast/154-adolfo-de-jes%C3%BAs-constanzo-and-the-narcosat%C3%A1nicos/id1571643278?i=1000731725669"
      }
    }
  ]
}