{
  "_ts": 0,
  "id": "6921b995-0fd7-414b-8bee-78f5bd5b54e1",
  "name": "Behind You",
  "spotifyId": "0HLgYNSI7j45CiE04B2hsr",
  "appleId": 1621153576,
  "episodes": [
    {
      "id": "86227677-670f-4ad4-b920-e53d4d6a0d46",
      "title": "S2 E16: The Sex Cult Disguised as an MLM: NXIVM Cult",
      "description": "Keith Reiner was said to be incredibly intelligent, and was “light years ahead of us”. Keith even as a child was insanely gifted and started learning 3 languages at just 8 years old. He was described as a natural born leader and could spark conversations with anyone he met. But Keith had trouble making friends so he started reading books to help him. But instead of reading self-help or self-improvement books, he began educating himself about mind control and brainwashing at 12 years old. Keith as an adult would create “NXVIM” and used his intelligence for evil. NXVIM provided seminars in the field of self development and enlightenment and members of NXVIM went door to door selling these programs. But this MLM later served as a front for criminal activity by Keith and his close associates. Crimes including, branding women with Keiths initials, Keith killing older women in cult to make room for younger ones, and many other crimes.And in 2017, Sarah Edmonton posted a photo of Keith Reinere’s Initials branded on her upper pelvic area on social media. Sarah would go on to say for the past 17 years, NXVIM had been a secret, full operating sex trafficking cult and would recruit young woman to become Keith’s “sex slaves”. This post led other men and women from NXVIM to come forward with their stories and the truth behind this MLM was a lot darker than anyone could’ve imagined.  Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-01-16T22:22:17Z",
      "duration": "00:53:12.5810000",
      "explicit": true,
      "spotifyId": "3oCXmgclXVJ9AZhvwzUXj5",
      "appleId": 1000641897900,
      "subjects": [
        "NXIVM",
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3oCXmgclXVJ9AZhvwzUXj5",
        "apple": "https://podcasts.apple.com/podcast/s2-e16-the-sex-cult-disguised-as-an-mlm-nxivm-cult/id1621153576?i=1000641897900"
      }
    },
    {
      "id": "8927c157-950e-4ffb-8c00-f5dce9233eac",
      "title": "S2 E15: The Teenage Cult-Group That Nearly Got away with Murder: The Disciples of Destruction",
      "description": "Mount Vernon New Hampshire is a small quiet town with population 2,000 and described as the “perfect place to live”. It has low-crime rates, great schools, beautiful scenery and friendly neighbors. It was a peaceful place where most people go to raise children and retire. But all of this came to a halt when on October 4th 2009, a 911 call from was from the cates household from 11 year-old Jamie Cates who was inaudible and softly whimpering and crying. Police arrive to the home to find Jamie lying and bleeding out on the kitchen floor with multiple wounds and a severed foot. While her mother, Kimberly Cates was lying in the master bedroom stabbed to death with a machete. This crime was the most horrific and gory scene the police had ever seen. It wasn’t until 2 days after the murder, police receive a tip that leads them down the dark and twisted group of teenage boys that call themselves “The Disciples of Destruction”. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-01-09T21:43:03Z",
      "duration": "00:36:29.6350000",
      "explicit": true,
      "spotifyId": "21K2R8C6XqwjDTSEJz7eOX",
      "appleId": 1000641081735,
      "subjects": [
        "Disciples of Destruction"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21K2R8C6XqwjDTSEJz7eOX",
        "apple": "https://podcasts.apple.com/podcast/s2-e15-the-teenage-cult-group-that-nearly-got-away/id1621153576?i=1000641081735"
      }
    }
  ]
}