{
  "id": "302ac362-1f54-40eb-bf13-ea916ff2f8a0",
  "name": "Being Untangled",
  "youTubeChannelId": "UCXbyWMf7OVCzCOUg0nZqKWg",
  "episodes": [
    {
      "id": "f21ebb19-8e24-4783-a5ab-09f6ba6ec721",
      "title": "Don\u0027t get CAUGHT in this meditation TRAP",
      "description": "A new method of meditation is being promoted on YouTube by Bhante Vimalaramsi (born Marvel Logan), Delson Armstrong, and David Johnson, who call themselves Suttavadins. Their method is called TWIM (Tranquil Wisdom Insight Meditation) and their home base is Dhamma Sukha Meditation Center. They claim that this practice takes one all the way to full Awakening (Enlightenment). But is this really true? And is it safe? We expose the truth about TWIM.\n\n🎙️🎧 For those who wish to listen while on the go or those with sensory processing disorders who find music beds and sound effects interfere with their ability to attend to dialogue, a podcast mix of this presentation is now available on YouTube Music: \n👉🏽 https://music.youtube.com/watch?v=NH7STU-llkg\n\n🧡 You can donate to show your appreciation \u0026 support on Ko-Fi:\n👉🏽 https://ko-fi.com/BeingUntangled\n\n🙏 Thanks to the following:\nVen.Thanissaro Bhikkhu, Ven. Ajahn Punnadhammo, Ven. Bhikkhu Sujato, Oleg Pavlov, Pavel Kataorgin, Rob Ellis, AJ Gentile, Casey Cavanaugh, and others who offered help, support and information.\n\n📋Other Suttavadins:  Liam McClintock, Sister Khema, Doug Kraft, Andrew Litchy, and others.\n\n📋Addendum 📋\n• Sister Khema, who was still alive as this was being filmed, died of her cancer in September 2023.\n• It is stated  that Pavel Katorgin is from Russia. He is actually from Kazakhstan.\n\n00:00:00 Māra\u0027s trick\n00:07:42 Who are the Suttavadins?\n00:19:28 CLAIM: Bhante Vimalaramsi is an Anāgāmi\n00:33:45 CLAIM: A TWIM Anāgāmi Is a Genuine Anāgāmi\n00:37:29 CLAIM: Bhante Vimalaramsi’s grasp of language is correct and his views should be unquestioningly accepted\n00:42:34 CLAIM: Delson Armstrong is an Arahant\n01:14:58 CLAIM: Compassion has an esoteric meaning\n01:20:55 CLAIM: Loving kindness can charge water with healing powers\n01:33:54 CLAIM: TWIM can cure cancer\n01:37:30 CLAIM: Bhante Vimalaramsi can cure AIDS\n01:42:25 CLAIM: Craving is a tension or tightness in the head (specifically the meninges)\n01:58:24 CLAIM: Crystals should be involved in Right Samādhi\n02:06:05 CLAIM: TWIM doesn’t lead one who practices it into psychosis\n02:14:52 CLAIM: TWIM doesn’t withhold any secret teachings\n02:16:55 CLAIM: Māra has no gender—is neither man nor woman\n02:19:16 CLAIM: An Arahant maintains awareness during sleep\n02:27:47 CLAIM: Sleep restriction is necessary for progress\n02:50:41 CLAIM: The TWIM Cessation is really Cessation\n03:04:29 CLAIM: The links of Dependent Origination are really tiny lights or bubbles\n03:07:02 CLAIM: The Brahmavihārās are a feeling (vedanā) meditation\n03:10:17 CLAIM: The Buddha taught loving-kindness meditation more than he taught mindfulness of breathing\n03:12:45 CLAIM: Progress with Mettā  meditation is faster than with breath meditation\n03:15:29 CLAIM: The Brahmavihārās  are an automatic process you can’t control, not willed \u0026 volitionally produced\n03:17:11 CLAIM: The Buddha taught people to smile \u0026 laugh all the time\n03:21:31 CLAIM: The Five Hindrances are your best friends, and should be invited into your mind\n03:25:39 CLAIM: There is such a thing as “meditation pain” and you should just press through it\n03:31:01 CLAIM: You should choose a Spiritual Friend to whom to radiate mettā\n03:33:42 CLAIM: The Bodily Fabrication is tension \u0026 tightness in the head\n03:37:25 CLAIM: The 6Rs are the entirety of the Noble Eightfold Path\n03:39:48 CLAIM: The 6Rs are identical to Right Effort\n03:46:06 CLAIM: Muditā is identical with Pīti, specifically the awakening factor of Pīti\n03:50:13 CLAIM: The Seven Factors of Awakening are in need of revision\n03:52:11 CLAIM: The point of the practice is to appreciate the things around you; delighting in food is consistent with the path\n04:00:05 CLAIM: A student having a hint of joy arise has attained jhāna\n04:05:34 CLAIM: Mindfulness is mindfulness of mind\u0027s attention moving from one object to another\n04:14:11 CLAIM: Forgiveness meditation is something the Buddha taught and a necessary adjunct to the Brahmavihārās\n04:18:20 CLAIM: Ekaggatā means tranquility\n04:21:18 CLAIM: Āsava means distraction\n04:23:56 CLAIM: The Pāli word Sammā means “harmonious” or “effective”\n04:28:39 CLAIM: Right View should be “Harmonious Perspective”\n04:31:29 CLAIM: Right Resolve should be “Harmonious Imaging”\n04:35:13 CLAIM: Right Speech should be “Harmonious Communication”\n04:36:33 CLAIM: Right Action should be “Harmonious Movement”\n04:39:52 CLAIM: Right Livelihood should be “Harmonious Lifestyle”\n04:41:41 CLAIM: Right Effort should be “Harmonious Practice”\n04:44:06 CLAIM: Right Mindfulness should be “Harmonious Observation”\n04:49:12 CLAIM: Right Concentration should be “Harmonious Collectedness”\n04:54:24 CLAIM: The Brahmavihārās and the jhānas are the same practice\n05:02:36 CLAIM: TWIM teaches from the suttas\n05:10:12 Coda\n\n#twim #meditationinjuries #dhamma #dharma #yoga #kriyayoga #kundalini #newage #wilhelmreich #maharishimaheshyogi #theosophy #hypnosis #cult #jhana #brahmaviharas #samadhi \u0022The Deep End of Meditation - Rebooting the Brain",
      "release": "2023-10-07T18:00:07Z",
      "duration": "05:13:05",
      "explicit": false,
      "youTubeId": "lI9131-atVc",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lI9131-atVc"
      }
    }
  ]
}