{
  "id": "81299a1e-47be-42b8-9dab-e51a748e41fc",
  "name": "Being Beautifully Honest",
  "youTubeChannelId": "UCRyXrHSCuhJwsFnGw-P1FQg",
  "episodes": [
    {
      "id": "f182872f-a365-4bb0-b104-7d3a9bf70b77",
      "title": "Mary Cosby Cult Allegations Being Ignored",
      "description": "Mary Cosby’s church allegations on Real Housewives of Salt Lake City continue to resurface — and what’s most troubling isn’t just the claims themselves, but how comfortable people seem brushing them off.\n\nCOPYRIGHT DISCLAIMER: The Copyright Act of 1976 includes a \u0022fair use\u0022 provision that allows limited use of copyrighted material without permission for purposes like criticism, commentary, news reporting, teaching, \nscholarship, and research.  ANY CONTENT SHARED IS UNDER THIS COPYRIGHT ACT AND IS NOT CLAIMED AS MY OWN.\n\nSupport the channel by purchasing amazing skincare at www.inezelizabethbeauty.com  and enter the code PERFECT10 for 10% off your first order! \n\nThanks for joining me on the Being Beautifully Honest channel! Leave a comment, like \u0026 subscribe for more and check out my other videos.\n\nJoin me on my other platforms!\n\nWEBSITE: WWW.BEINGBEAUTIFULLYHONEST.COM \nPODCAST: https://rss.com/podcasts/being-beautifully-honest-podcast/ \nINSTAGRAM: https://www.instagram.com/beingbeautifullyhonestpodcast/ \nSUBSCRIBE TO MY OTHER CHANNEL AT bit.ly/ytcmobeauty\n\nTHE BEING BEAUTIFULLY HONEST PODCAST DISCLAIMER: The views and opinions expressed in this video and on The Being Beautifully Honest Podcast  Youtube Channel are just that, opinions and views. All topics are for entertainment purposes only!  All commentary is Alleged.\n\n#MaryCosby #RHOSLC #CultAllegations #MarriedToMedicine #ToyaBushHarris #EugeneHarris",
      "release": "2025-12-20T02:01:13Z",
      "duration": "00:20:35",
      "explicit": false,
      "youTubeId": "xh7zhxfmvas",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xh7zhxfmvas"
      }
    }
  ]
}