{
  "_ts": 0,
  "id": "e7751538-4355-4441-ac73-a7c9dfd3b18d",
  "name": "Being And Doing",
  "youTubeChannelId": "UCuQMJJ_btS3gPZ6fF1I5ovA",
  "episodes": [
    {
      "id": "8091735a-6526-40ff-8812-e094ea497034",
      "title": "Vanesa Reisser on cults and narcissism–Being Human and Doing Psychotherapy| Ep 44",
      "description": "\u0022I BELEIVE YOU\u0022.\n\nI am Aleksandra Vancevska, gestalt therapeutic counsellor and UKCP student therapist. I support you to transform overachieving burnout, stress, perfectionism and stuckness into fulfilling self-confidence and authentic success.\n\nTo start therapy with me schedule a free consultation:  https://calendly.com/aleksandra-vanchevska/discovery-call\n\nTo support the channel make your donation here: https://gofund.me/99e09b6b\n\nVanessa Reiser is a mother, entrepreneur, life coach, advocate, and a ground breaking psychotherapist specializing in narcissistic abuse using Therapist Self-Disclosure (TSD); a form of therapy where therapist statements are shared that reveal something personal about the therapist, when an opportunity to create validation exists. Vanessa is licensed in NY, NJ, MA \u0026 FL and made international headlines when she ran the entire state of New York in a wedding dress to raise awareness for narcissistic abuse in May 2021. Her days are spent supporting those traumatised by this insidious form of domestic violence.\n\nIf you want to connect to her you can find her on instagram @vanessareiserlcsw, or visit her website https://tellatherapist.net \n\nBeing Human and Doing Psychotherapy is a podcast that portraits the human in psychotherapists and the psychotherapist present in all of us. Whatever profession we pursue, we first enter it with humanity and the fullness of the whole being. Through this podcast, I curiously explore what the “secret ingredients” of various psychotherapeutic directions are and how they integrate through the specific life and human stories of the therapists who practice and live them.\nI hope this conversation brings something new in your perception and knowledge on this topic.\n\nFind all the links in one place:\nhttps://linktr.ee/being_and_doing  \n\nThis podcast represents my own and my guests views and opinions. The content here should not be taken as medical, financial or any other advice. The content is for informational purposes only, and because each person is so unique, please consult the appropriate professional for any specific questions you have.\n\nThank you for joining me on this journey 🙏🏻⁠\n⁠\nLove,⁠\nAleks💕",
      "release": "2024-10-28T17:00:57Z",
      "duration": "00:42:56",
      "explicit": false,
      "youTubeId": "viZPzcKrh1E",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=viZPzcKrh1E"
      }
    }
  ]
}