{
  "id": "4067afee-c0f0-44e0-991d-484c43da5a58",
  "name": "Being Well with Forrest Hanson and Dr. Rick Hanson",
  "spotifyId": "5d87ZU1XY0fpdYNSEwXLVQ",
  "appleId": 1120885936,
  "episodes": [
    {
      "id": "bf80b849-76bd-4d6d-8aa9-78b95d09f11b",
      "title": "Is Self-Help a Cult? The Attention Economy and Slippery Slope of \u0022Woo\u0022",
      "description": "Forrest and Dr. Rick explore how well-intentioned self-help advice can drift away from science under the incentives of the attention economy, where overclaiming, alarmist framing, and “this one simple trick” outperforms nuance. They talk about how authority gets manufactured, how the algorithm encourages overclaiming, and how “theories of everything” lead to misinformation. Dr. Rick and Forrest discuss whether seemingly harmless pseudoscientific practices can create a slippery slope, lowering the importance of material evidence and acting as an on-ramp to more consequential misinformation. Key Topics: 0:00 Introduction 2:00 The attention economy 9:00 The problems with clickbait 18:30: The risks of sprawling expertise 25:15: Modality capture: when all you have is a hammer 27:15: ADHD and trauma 39:24: If science changes, what can we trust? 42:30: How “fringe” can become mainstream 50:10: How do you decide who to trust? 1:06:00: The slippery slope of “woo” 1:11:35: What’s a better alternative? 1:21:11: Recap Support the Podcast: We\u0027re on Patreon! If you\u0027d like to support the podcast, follow this link. Sponsors Go to Zocdoc.com/BEING to find and instantly book a top-rated doctor today. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2026-01-19T09:00:00Z",
      "duration": "01:37:29.9390000",
      "explicit": false,
      "spotifyId": "1n57hqckWljbi0vvZsD7Ov",
      "appleId": 1000745717289,
      "subjects": [
        "Self-Help",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1n57hqckWljbi0vvZsD7Ov",
        "apple": "https://podcasts.apple.com/podcast/is-self-help-a-cult-the-attention-economy/id1120885936?i=1000745717289"
      }
    }
  ]
}