{
  "_ts": 0,
  "id": "8be3e134-7cae-4a72-88c1-84f388ceaf01",
  "name": "Berkeley Voices",
  "spotifyId": "332lStkSBT4JIgC1bWA9R1",
  "appleId": 1333313116,
  "youTubeChannelId": "UCZAXKyvvIV4uU4YvP5dmrmA",
  "episodes": [
    {
      "id": "89b68a36-c921-423b-a139-6b831a30f244",
      "title": "125: As crises escalate, so does our fascination with cults",
      "description": "Like millions of other Americans, UC Berkeley Professor Poulomi Saha watched a lot of docuseries about cults during the COVID-19 pandemic. The more Saha watched, the more they felt a kind of change within themself. \u0022I was absolutely enthralled,\u0022 said Saha. “My reaction no longer fit that old script, the script that I had internalized. I wasn’t just having a passing interest. I wasn’t sort of mildly terrified. I was thinking, “Oh, wow, that makes good sense.’” Saha wanted to understand why. So they started a class, called Cults in Popular Culture, where Saha and their students explore the history of cults, the transformative power of these groups and the conditions that give rise to our collective fascination. After all, Saha says, what better way to make sense of this phenomenon than to ask several hundred Berkeley undergraduates to be test subjects? This season on Berkeley Voices, we\u0027re exploring the theme of transformation. In eight episodes, we’re exploring how transformation — of ideas, of research, of perspective — shows up in the work that happens every day at UC Berkeley. New episodes will come out on the last Monday of each month, from October through May. Key takeaways: Nobody joins a cult; they join a good thing. It’s labeled a cult when it goes bad. Our fascination with cults rises amid social and global crises. It happened in 1960s America and it’s happening today. The IRS decides the difference between a religion and a cult. A person who joins a so-called cult undergoes a transformative experience. Instead of calling them \u0022crazy,\u0022 we should listen. Listen to the podcast and read the transcript on UC Berkeley News (news.berkeley.edu/podcasts). Music by Blue Dot Sessions. UC Berkeley photo by Jen Siska. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-11-25T21:19:46Z",
      "duration": "00:29:09.8640000",
      "explicit": false,
      "spotifyId": "7oyDJQ4BK417azfMmp7QwB",
      "appleId": 1000678211599,
      "youTubeId": "c1YyEubDs8k",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7oyDJQ4BK417azfMmp7QwB",
        "apple": "https://podcasts.apple.com/podcast/125-as-crises-escalate-so-does-our-fascination-with-cults/id1333313116?i=1000678211599",
        "youtube": "https://www.youtube.com/watch?v=c1YyEubDs8k"
      }
    }
  ]
}