{
  "id": "b0cd6fd6-30b7-4106-83bd-4f3e0968350b",
  "name": "Berkeley Talks",
  "spotifyId": "5HaAEUz7V0OetTnV6Kl7PD",
  "appleId": 1445592627,
  "episodes": [
    {
      "id": "9b0a0ebe-8e8f-4192-a7c8-bd4eb16762bc",
      "title": "Poulomi Saha on why we\u0027re so obsessed with cults",
      "description": "In Berkeley Talks episode 183, Poulomi Saha, an associate professor in the Department of English and co-director of the Program in Critical Theory at UC Berkeley, discusses how cult culture, once a fringe phenomenon, has moved into the mainstream — and what that tells us about what we long for, what we fear and who we hope to be.\u0022In this crisis moment, we have a return to desire for overarching meaning, radical acceptance, transformative experience, transcendence,\u0022 says Saha. \u0022But unlike in the 1960s, we\u0027re not dropping out, we\u0027re tuning in ... to a highly regularized representation of cults. If in the 1960s we had the sense that fringe groups and communes might offer us a way out of conformity and regularity, in this current incarnation, when cults appear in our everyday lives, they do so highly regularized.\u0022Saha is currently working on a book about America’s long obsession with its own invented visions of Indian spirituality, and why so often those groups and communities come to be called cults.(Editing note: Because of an audio issue, we left out the Q\u0026A portion of this talk.)Listen to the episode and read a transcript on Berkeley News (news.berkeley.edu).Photo by Jen Siska.Music by Blue Dot Sessions. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-11-03T00:00:00",
      "duration": "00:50:34.9060000",
      "explicit": false,
      "spotifyId": "2gqEDSgAZjHnry0UiB6C73",
      "appleId": 1000633586749,
      "subjects": [
        "Critical Theory"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2gqEDSgAZjHnry0UiB6C73",
        "apple": "https://podcasts.apple.com/podcast/poulomi-saha-on-why-were-so-obsessed-with-cults/id1445592627?i=1000633586749"
      }
    }
  ]
}