{
  "_ts": 0,
  "id": "935129dc-191d-437d-b289-fe3ee3d7b145",
  "name": "BertMartinez. Com",
  "youTubeChannelId": "UCOMPkD0UHoZbi0uet4794UA",
  "episodes": [
    {
      "id": "92a26d17-bd2a-4150-9dc1-cdbd78ba9c54",
      "title": "I Escaped From a Cult with Michelle Dowd",
      "description": "00:00 Introduction\n01:30 10,000 Cults\n03:28 Why Cults Flourish\n04:19 Thoughts on Trump\n06:14 Religion vs Cult\n07:00 Why Cults retaliate against their members\n\nBreaking Away From a Cult with Michelle Dowd. As a child, Michelle Dowd grew up on a mountain in the Angeles National Forest. She was born into an ultra-religious cult—or the Field. Michelle lives a life of abuse, poverty, and isolation, as she obeys her family’s rigorous religious and patriarchal rules—which are so extreme that Michelle is convinced her mother would sacrifice her, like Abraham and Isaac, if instructed by God. She often wears the same clothes for months at a time; she is often ill and always hungry for both love and food. She is taught not to trust Outsiders, and especially not Quitters, nor her own body and its warnings.\n\n➡️Connect with #MichelleDowd\nhttps://www.michelledowd.org\nHer Book: https://amzn.to/3Ynpa0j\n\n➡️Connect with #BertMartinez:\nTwitter - https://twitter.com/BertMartinez\nInstagram - https://www.instagram.com/TheBertMartinez\nFacebook - https://www.facebook.com/bertmartinezfans\n\n➡️ Get a free copy of DominatingYourMind: https://amzn.to/2XuM9Xr\n While supplies last, limited time.\n\nAbout the host:\nBert Martinez is a successful entrepreneur and best-selling author. Bert is fascinated by business, marketing, and entrepreneurship. One of Bert\u0027s favorite hobbies is to transform the complicated into simple-to-understand lessons so you can apply them to your business and life. Bert is also obsessed with exploring the mindset of the high achievers so you can follow their secrets and strategies.",
      "release": "2024-07-26T10:00:47Z",
      "duration": "00:58:03",
      "explicit": false,
      "youTubeId": "pXoTjaroMcg",
      "subjects": [
        "Kare Youth League"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pXoTjaroMcg"
      }
    }
  ]
}