{
  "id": "0a18550a-88c0-4672-ab53-4a9f3b70d49a",
  "name": "best audiobook",
  "youTubeChannelId": "UCB2buuS2U6gpVysxOclR4zA",
  "episodes": [
    {
      "id": "24e78276-102f-4cc4-86e2-33ead1d99c39",
      "title": "Breaking Free: How I Escaped Polygamy, the FLDS Cult, and my Father, Warren Jeffs by Rachel Jeffs",
      "description": "In this searing memoir of survival in the spirit of Stolen Innocence, the daughter of Warren Jeffs, the self-proclaimed Prophet of the FLDS Church, takes you deep inside the secretive polygamist Mormon fundamentalist cult run by her family and how she escaped it. Born into the Fundamentalist Church of Jesus Christ of Latter-Day Saints, Rachel Jeffs was raised in a strict patriarchal culture defined by subordinate sister wives and men they must obey. No one in this radical splinter sect of the Mormon Church was more powerful or terrifying than its leader Warren Jeffs—Rachel’s father. Living outside mainstream Mormonism and federal law, Jeffs arranged marriages between under-age girls and middle-aged and elderly members of his congregation. In 2006, he gained international notoriety when the FBI placed him on its Ten Most Wanted List. Though he is serving a life sentence for child sexual assault, Jeffs’ iron grip on the church remains firm, and his edicts to his followers increasingly restrictive and bizarre. In Breaking Free, Rachel blows the lid off this taciturn community made famous by John Krakauer’s bestselling Under the Banner of Heaven to offer a harrowing look at her life with Warren Jeffs, and the years of physical and emotional abuse she suffered. Sexually assaulted, compelled into an arranged polygamous marriage, locked away in \u0027\u0027houses of hiding\u0027\u0027 as punishment for perceived transgressions, and physically separated from her children, Rachel, Jeffs’ first plural daughter by his second of more than fifty wives, eventually found the courage to leave the church in 2015. But Breaking Free is not only her story—Rachel’s experiences illuminate those of her family and the countless others who remain trapped in the strange world she left behind. A shocking and mesmerizing memoir of faith, abuse, courage, and freedom, Breaking Free is an expose of religious extremism and a beacon of hope for anyone trying to overcome personal obstacles. A Family Tree PDF accopmanies the audiobook.",
      "release": "2025-01-09T08:10:12Z",
      "duration": "00:05:05",
      "explicit": false,
      "youTubeId": "2cg4bAfOndg",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2cg4bAfOndg"
      }
    }
  ]
}