{
  "id": "06851ca9-74ad-4536-9dde-9b7329841b68",
  "name": "Best of Danny Jones",
  "youTubeChannelId": "UCDDxLOfbgDJjip3yQFPx7Vg",
  "episodes": [
    {
      "id": "f9687e3d-c4ef-44ba-9802-384365cc08ad",
      "title": "Children of God Cult Survivor: \u0022The Abuse Was Worse Than Anyone Can Imagine\u0022 | Ray Connolly",
      "description": "Religious Sex Cult Survivor Ray Connolly exposes the darkest and most shocking secret of the infamous \u0022Children of God\u0022 cult (also known as The Family International). In this powerful interview, Ray reveals the #1 ugliest truth that the group desperately tried to keep hidden for decades: the systematic sexual abuse of children under the guise of religious teachings, including the notorious \u0022Flirty Fishing\u0022 practice and David Berg’s disturbing doctrines that normalized adult-child relationships.\n\nAs a former second-generation member born into the Children of God, Ray shares his firsthand experience growing up in this high-control apocalyptic sect led by self-proclaimed prophet David Berg. He details the psychological manipulation, isolation from the outside world, celebrity involvement (including Rose McGowan and the Phoenix family), and how the cult rebranded itself as The Family International while trying to distance from its horrific past.\n\nThis survivor testimony sheds light on one of the most controversial and predatory religious movements of the 20th century. If you’re interested in cult recovery stories, religious trauma, or the psychology behind high-demand groups, this interview is essential viewing. Subscribe for more in-depth survivor stories and exposés on dangerous cults.\n\n#ChildrenOfGod #CultSurvivor #ReligiousCult",
      "release": "2025-12-12T19:00:48Z",
      "duration": "00:56:15",
      "explicit": false,
      "youTubeId": "h6FY7fTmId0",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h6FY7fTmId0"
      }
    }
  ]
}