{
  "id": "f78e176f-d599-481d-a9c9-e0990dcef40b",
  "name": "Better Call Daddy",
  "spotifyId": "5L7iWicv8KpujPqPe9G7C6",
  "appleId": 1525296416,
  "youTubeChannelId": "UCEwckHRdcV1nkFucIiqNhvA",
  "episodes": [
    {
      "id": "97bf517a-0949-45c6-bfe9-c436a06cf3eb",
      "title": "359.  The Evolution of Alesia Galati: Podcasts, Cults, and Personal Growth",
      "description": "In today\u0027s empowering episode with the remarkable Alesia Galati, we unpack her incredible journey from surviving a cult to mastering the world of podcasting. Alesia shares her poignant story of personal growth, self-discovery, and the power of setting boundaries. She dives into the essence of building authentic relationships with clients and how embracing her unique identity has been pivotal for her business success. Get ready to be inspired by Alesia\u0027s transition to a six-figure podcasting powerhouse, her strategic approach to cultivating a valued audience, and her dedication to creating educational content. Plus, don\u0027t miss her insights on the nuances of raising children and the roles of protectiveness and education. Tune in, as Alesia\u0027s compelling narrative is sure to spark a transformation in your personal and professional life. This is Better Call Daddy. Stay connected for episodes that stir the soul, challenge the status quo, and reveal the stories behind your favorite influencers. Until next time! Alesia Galati has been listening to podcasts since 2015 and knows what goes into creating a standout podcast that captures your audience’s attention even before they press “play”. Alesia’s helped coaches and thought leaders launch and maintain over 50 podcasts and has developed a signature, thorough system to launching and managing podcasts so you don’t have to stress about anything falling through the cracks! Alesia lives in sunny North Carolina with her two kiddos and husband. When not helping her clients, Alesia can be found reading over 200 books a year, hiking, and exploring the zoo with her boys. Favorite podcast: Alesia’s ears have been fine-tuned for high-quality audio and she can only tolerate impeccable podcasts. She enjoys listening to heavily produced storytelling podcasts like “Greeking Out” by National Geographics Kids when she takes long road trips with her kids. Mentioned in episode https://www.instagram.com/wereadsmut/ Follow Alesia https://www.instagram.com/alesia.galati/ https://www.youtube.com/@alesiagalati https://www.linkedin.com/in/alesia-galati/ Connect with Reena bettercalldaddy.com linkedin.com/in/reenafriedmanwatts twitter.com/reenareena instagram.com/reenafriedmanwatts instagram.com/bettercalldaddypodcast Me and my dad would love to hear from you, Drop us a review, reviews help more people find the show, and let us know what you like and what you\u0027d like us to change, Please share the show with one friend who you think would be helped by the show ratethispodcast.com/bettercalldaddy podchaser.com/bettercalldaddy Castmagic is the AI tool I use for show notes and podcast title ideas, it has helped save me tons of time. I talked about it in this episode. Please use my affiliate link if you sign up. https://get.castmagic.io/bettercalldaddy Are you a popular podcaster or a rising influencer? Or do you have a great idea for an online business? Then you should know that every great website starts with an awesome domain name. Namecheap offers hundreds of domain extensions, from the traditional dot com to creative extensions for podcasters like dot fm, dot live, or dot space. Namecheap is the world’s 2nd largest domain registrar, with nearly 17 million domains under management and a top web service provider for everything you need to launch an amazing website. Namecheap offers hundreds of domain extensions from the traditional .com to creative extensions like .fm, .live or .space Namecheap is offering Better Call Daddy listeners 20% off any non-premium domain name for its first year of registration with the code REENA20. The offer cannot be combined with any existing sales but can override any current sale if its discount is less than 20%. The code is valid for all new and existing Namecheap customers. You can register up to 10 domains per account with this code. To get a domain name with a 20% discount (including .com and 455 other extensions). Go to namecheap.com , search for your desired domain, and use the code REENA20 at checkout.",
      "release": "2024-03-20T21:13:27Z",
      "duration": "01:10:03.2630000",
      "explicit": true,
      "spotifyId": "1IeH5qfERyegTdqu39Y99L",
      "appleId": 1000649916051,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IeH5qfERyegTdqu39Y99L",
        "apple": "https://podcasts.apple.com/podcast/359-the-evolution-of-alesia-galati-podcasts/id1525296416?i=1000649916051"
      }
    },
    {
      "id": "60a27900-27d0-476c-b4a2-7b85555a08e3",
      "title": "358.  Leaving Scientology: Reese Quibell\u0027s Path to Freedom",
      "description": "In what ways can sending a child to a religious school shape their social life and development? How does the concept of disconnection as practiced in Scientology affect the concept of family and personal relationships? What are the emotional consequences of such a policy? Today, we\u0027re venturing into a world that\u0027s often shrouded in secrecy and controversy—Scientology. Our brave guest, Reese Quibell, aka Relatable Reese shares a deeply personal journey of growing up within the confines of this organization. Reese opens up about the challenges she faced, from the emotional desensitization she endured to her chilling recount of abuse and the community\u0027s severe repercussions for her cries for help. Reese\u0027s story isn\u0027t just a tale of survival within Scientology\u0027s oppressive walls - it\u0027s also a testament to the power of healing and reclaiming one\u0027s life. She describes the complex impact on her child\u0027s life, their silent pact to protect him from Scientology\u0027s reach, and the heart-wrenching choices they\u0027ve had to make. We\u0027ll delve into the emotional and psychological upheaval Reese has gone through and the strategies she\u0027s employed in her remarkable path towards recovery. From praise to L. Ron Hubbard to the estrangement from loved ones, Reese shares the emotional turmoil caused by the organization’s practices. The powerful influence stories like Reese’s have had on the public perception of Scientology becomes evident as she recounts her reaction to television portrayals of the cult’s abuse. Our own Reena Friedman Watts engages with Reese, reflecting on the parallel challenges of motherhood and the innate desire to protect our children. Wayne Friedman offers his insights on spirituality, free thought, and applauds Reese’s strength and openness. In a world where resilience shines brightest in the darkest corners, tune in for a raw, honest, and ultimately uplifting episode of Better Call Daddy, where Reese Quibell embodies bravery and the quest for truth and connection. Don\u0027t forget to like, subscribe, and share our podcast, available on various platforms. Now, let\u0027s dive into Reese\u0027s incredible story of escape, healing, and hope. Connect with Reese https://www.youtube.com/@RelatableReese Connect with Reena bettercalldaddy.com linkedin.com/in/reenafriedmanwatts twitter.com/reenareena instagram.com/reenafriedmanwatts instagram.com/bettercalldaddypodcast Me and my dad would love to hear from you, Drop us a review, reviews help more people find the show, and let us know what you like and what you\u0027d like us to change, Please share the show with one friend who you think would be helped by the show ratethispodcast.com/bettercalldaddy podchaser.com/bettercalldaddy",
      "release": "2024-03-15T19:41:28Z",
      "duration": "01:08:04.2580000",
      "explicit": true,
      "spotifyId": "5zKhE8ZBctcycV4i9Bx1oc",
      "appleId": 1000649359393,
      "youTubeId": "hA0bO9AE3wU",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5zKhE8ZBctcycV4i9Bx1oc",
        "apple": "https://podcasts.apple.com/podcast/358-leaving-scientology-reese-quibells-path-to-freedom/id1525296416?i=1000649359393",
        "youtube": "https://www.youtube.com/watch?v=hA0bO9AE3wU"
      }
    }
  ]
}