{
  "id": "d44c134e-61d9-49c0-843c-d4d654f97f16",
  "name": "Beyond Survival - The Therapy Podcast with Katie McKenna",
  "spotifyId": "1zUSIN6l4BIwOyYfusVGXa",
  "appleId": 1822492861,
  "episodes": [
    {
      "id": "2cb82472-ef1c-40b1-bb69-85a24d6e1d61",
      "title": "7. \u0027The Cult of Family\u0027 with Daniella Mestyanek Young",
      "description": "The Cult of Family explores the reality of growing up in a narcissistic system that demands silence, obedience, and self-erasure. In this episode, I sit down with Daniella, a scholar of cults, extreme groups and extremely bad leadership, who also brings her own lived experience of being raised in a cult. Together, we unpack the unsettling parallels between cults and narcissistic families; the control, the domination, the rigid rules, how perception is distorted, and how identity is supressed in the name of loyalty and “love.” But this conversation goes deeper than the system, it asks; What happens after you leave? We discuss the lasting psychological impact, how these environments stunt development and self-trust, and what it really takes to heal. We explore the blocks that so often emerge in recovery, shame, confusion, disconnection, and how to start rebuilding a self that was never allowed to fully form. This conversation is for anyone who’s broken free, or is beginning to, and is asking: What now? Click here to follow Daniella on TikTok Click here to follow Daniella on Instagram BEYOND SURVIVAL - The Therapy Podcast",
      "release": "2025-08-01T05:00:00Z",
      "duration": "00:47:56.2120000",
      "explicit": false,
      "spotifyId": "6oc62diAuaIrsv136iFCaD",
      "appleId": 1000720180248,
      "subjects": [
        "Children Of God",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6oc62diAuaIrsv136iFCaD",
        "apple": "https://podcasts.apple.com/podcast/7-the-cult-of-family-with-daniella-mestyanek-young/id1822492861?i=1000720180248"
      }
    }
  ]
}