{
  "_ts": 0,
  "id": "9b53c87c-5e62-40b5-8e46-81c582793fb3",
  "name": "Beyond BJU",
  "spotifyId": "71pxhIA1ne0XlUQeDueBKM",
  "appleId": 1705924428,
  "episodes": [
    {
      "id": "97aeb2ae-fa75-4761-97bf-c469df88d841",
      "title": "Ep. 10 - Escaping The Grips of Coercive Control - Leah Worley",
      "description": "Leah Worley’s time at BJU was marked by an invasive surveillance regime and a suffocating culture of authoritarianism. Targeted for her appearance, she found herself under constant scrutiny, with every aspect of her identity dissected and judged under the unforgiving lens of the university\u0027s rigid moral compass. Leah recounts chilling episodes of being stalked, publicly shamed, sexually harassed, and subjected to relentless intimidation by authority figures determined to break her down. Yet, amidst this turmoil, Leah’s narrative is also one of awakening and empowerment. She describes the turning point when she decided to take control of her life, employing strategies to evade undue surveillance and reclaim her autonomy. This episode is a rallying cry for all those who have felt the weight of coercive control, a testament to the power of personal agency, and a reminder that even in the face of adversity, hope and renewal are possible. Andrew Pledger\u0027s Links Facebook Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger My Substack: https://speakingupandrewpledger.substack.com/ Social Media: https://andrewpledger.mypixieset.com/links -Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-05-06T09:01:00Z",
      "duration": "01:24:55.1830000",
      "explicit": false,
      "spotifyId": "3XpaB4fNw963fICzDcBsWt",
      "appleId": 1000654655130,
      "subjects": [
        "Bob Jones University",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XpaB4fNw963fICzDcBsWt",
        "apple": "https://podcasts.apple.com/podcast/ep-10-escaping-the-grips-of-coercive-control-leah-worley/id1705924428?i=1000654655130"
      }
    },
    {
      "id": "cda2b2c8-20b0-44da-84cc-5071325c9744",
      "title": "Ep. 9 - Betrayed Trust - Joshua Bellis",
      "description": "In this episode, we delve into the experiences of Joshua Bellis, whose family was intricately entwined with Bob Jones University (BJU). He shares his experiences of growing up as a missionary kid in Canada. His parents were missionaries with the Gospel Fellowship Association, a mission agency operated by BJU. Joshua also shares the story of his grandfather (James Bellis) who, despite his dedicated service to BJU, was neglected in his time of need, leading to a serious injury. Shockingly, it took a lawsuit threat for the institution to take responsibility. He also recounts a disturbing incident involving his uncle, a high-ranking BJU member, and the university\u0027s mishandling of a scandal, revealing the institution\u0027s prioritization of image over moral responsibility. Finally, Joshua opens up about his father\u0027s fall from leadership. Join us as we explore these stories of betrayal, disillusionment, and the struggle for justice. Andrew\u0027s Links Facebook Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger Social Media: https://andrewpledger.mypixieset.com/links Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-29T09:44:00Z",
      "duration": "00:54:02.4480000",
      "explicit": false,
      "spotifyId": "6qennDLqDfkTrm8fSkYh82",
      "appleId": 1000653897232,
      "subjects": [
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6qennDLqDfkTrm8fSkYh82",
        "apple": "https://podcasts.apple.com/podcast/ep-9-betrayed-trust-joshua-bellis/id1705924428?i=1000653897232"
      }
    },
    {
      "id": "6c24793e-4c69-4e9c-92e8-7c39d353e256",
      "title": "Ep. 8 - Missions Teams, Mount Calvary Baptist in Greenville - Erin Burchwell",
      "description": "In this episode, Erin Burchwell shares stories about her travels with BJU\u0027s missions teams. She also discusses her upbringing in Mount Calvary Baptist Church in Greenville. Erin Burchwell is a Columbus, Ohio-based florist, designer and illustrator. She grew up as a faculty kid on the campus of Bob Jones University. In 2014, Erin interviewed with GRACE, an independent ombudsman who reviewed the University’s mishandling of sexual assault reports. She and others chose to break their anonymity in the report when the school fired the GRACE team. Andrew\u0027s Links FB Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger Social Media: https://andrewpledger.mypixieset.com/links Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-22T09:47:00Z",
      "duration": "01:11:50.4650000",
      "explicit": false,
      "spotifyId": "26xMVHJy4P0YJCixRYqbtB",
      "appleId": 1000653188694,
      "subjects": [
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/26xMVHJy4P0YJCixRYqbtB",
        "apple": "https://podcasts.apple.com/podcast/ep-8-missions-teams-mount-calvary-baptist-in-greenville/id1705924428?i=1000653188694"
      }
    },
    {
      "id": "6354dd4e-8d08-481b-8e2d-043f4baef432",
      "title": "Reading the GRACE Report - Andrew Pledger",
      "description": "CONTENT WARNING: sexual abuse and victim blaming - Read the full GRACE Report here: https://www.netgrace.org/bju In this episode, I read some highlights of the GRACE Report of BJU. In this updated episode, I add some of the recommendations section. The GRACE report is a 301-page report on the mishandling of sex abuse allegations at Bob Jones University. The report shows Bob Jones University responding to rape and abuse claims with woeful ignorance of state law, a near-complete lack of training in psychology and trauma counseling best practices, and an overarching campus culture that blames women and girls for any abuse they suffer, and which paints all sexuality-from rape to consensual sex-as equivalent misdeeds. Andrew Pledger\u0027s Links Facebook Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger My Substack: https://speakingupandrewpledger.substack.com/ Social Media: https://andrewpledger.mypixieset.com/links -Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-15T16:35:58Z",
      "duration": "01:58:58.7160000",
      "explicit": false,
      "spotifyId": "2NIWr38jxVMJJImkACLNKy",
      "appleId": 1000652516876,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NIWr38jxVMJJImkACLNKy",
        "apple": "https://podcasts.apple.com/podcast/reading-the-grace-report-andrew-pledger/id1705924428?i=1000652516876"
      }
    },
    {
      "id": "89adbba1-8393-4f50-a0a9-ebd261fe9f35",
      "title": "Ep. 7 - Growing Up at BJU, GRACE Report - Erin Burchwell",
      "description": "Erin Burchwell is a Columbus, Ohio-based florist, designer and illustrator. She grew up as a faculty kid on the campus of Bob Jones University. In 2014, Erin interviewed with GRACE, an independent ombudsman who reviewed the University’s mishandling of sexual assault reports. She and others chose to break their anonymity in the report when the school fired the GRACE team. Andrew\u0027s Links Facebook Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger Social Media: https://andrewpledger.mypixieset.com/links Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-15T09:42:00Z",
      "duration": "01:05:52.7960000",
      "explicit": false,
      "spotifyId": "063EsjSRh9F7WDOikVo5IG",
      "appleId": 1000652474518,
      "subjects": [
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/063EsjSRh9F7WDOikVo5IG",
        "apple": "https://podcasts.apple.com/podcast/ep-7-growing-up-at-bju-grace-report-erin-burchwell/id1705924428?i=1000652474518"
      }
    },
    {
      "id": "cbb784de-d121-46f7-bc47-e8e5acc056ff",
      "title": "Ep. 6 - Family Relationships, BJU\u0027s Control - Andrew Pledger - IndoctriNation Podcast",
      "description": "This is an episode I did with the IndoctriNation Podcast which is hosted by Rachel Bernstein LMFT, Cult Specialist. Listen to the IndoctriNation Podcast on Apple Podcasts , Spotify , and other platforms . Andrew Pledger is a content creator, activist, and writer who uses social media to share his story and inspire others. He is a religious trauma survivor who was homeschooled K-12 and raised in a fundamentalist Christian cult (Independent Fundamental Baptist movement). He brings awareness to spiritual and religious abuse. Being a part of the LGBTQ\u0026#43; community and experiencing religious trauma has inspired him to pursue psychology to help survivors. After being homeschooled, he found his way to Bob Jones University. He attended the fundamentalist Christian college for over three years until he was expelled in his last semester for sharing his story and denouncing fundamentalist teachings. Andrew comes on the show to share his experiences of the level of control and mental abuse he experienced at Bob Jones University. Andrew opens up to Rachel about his complicated relationship with his 2nd generation IFB parents, he compares the high-control culture he grew up within his family with the complete authoritarian control of Bob Jones University. Together Andrew and Rachel discuss the psychological impacts on adolescents living under the constant surveillance and harsh judgment of fundamentalism. Andrew\u0027s Links FB Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger Social Media: https://andrewpledger.mypixieset.com/links Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-08T09:20:00Z",
      "duration": "00:59:24.1990000",
      "explicit": false,
      "spotifyId": "7GVbtkF63XQ2dZ2wrL7fq7",
      "appleId": 1000651758967,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7GVbtkF63XQ2dZ2wrL7fq7",
        "apple": "https://podcasts.apple.com/podcast/ep-6-family-relationships-bjus-control-andrew-pledger/id1705924428?i=1000651758967"
      }
    },
    {
      "id": "17061d46-66d5-4021-b24c-f6b5d10264e1",
      "title": "Ep. 5 - Part 2 - Secrets of a Gay Marine Porn Star - Rich Merritt",
      "description": "Rich Merritt is an author, attorney, and LGBTQ\u0026#43; activist who has led a remarkable life. He was born in Greenville, South Carolina, to fundamentalist Christian parents. He was in the Bob Jones school system from first grade through the university. He attended Bob Jones University for two years and in 1988 transferred to Clemson University. He enlisted in the Marine Corps and served as a sergeant and an officer, while also appearing in adult films. He graduated from the University of Southern California Law School and worked as a lawyer in California, Georgia, and New York. He wrote his memoir, Secrets of a Gay Marine Porn Star, in 2005. He has been featured on the cover of The New York Times Magazine, The Advocate, and Washington Post You can order an ebook copy of Rich Merritt\u0027s Secrets of a Gay Marine Porn Star, from Kensington Books at this link . Also available on Amazon: https://a.co/d/bISmitF Andrew\u0027s Links FB Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger Social Media: https://andrewpledger.mypixieset.com/links Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-01T09:59:00Z",
      "duration": "01:03:08.2250000",
      "explicit": false,
      "spotifyId": "2SjFOifjgvajnHuZoFRsu6",
      "appleId": 1000651053695,
      "subjects": [
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2SjFOifjgvajnHuZoFRsu6",
        "apple": "https://podcasts.apple.com/podcast/ep-5-part-2-secrets-of-a-gay-marine-porn-star-rich-merritt/id1705924428?i=1000651053695"
      }
    },
    {
      "id": "819c1235-b74d-4096-b6bc-50097c23b9df",
      "title": "Ep. 4 - Part 1 - Secrets of a Gay Marine Porn Star - Rich Merritt",
      "description": "Rich Merritt is an author, attorney, and LGBTQ\u0026#43; activist who has led a remarkable life. He was born in Greenville, South Carolina, to fundamentalist Christian parents. He was in the Bob Jones school system from first grade through the university. He attended Bob Jones University for two years and in 1988 transferred to Clemson University. He enlisted in the Marine Corps and served as a sergeant and an officer, while also appearing in adult films. He graduated from the University of Southern California Law School and worked as a lawyer in California, Georgia, and New York. He wrote his memoir, Secrets of a Gay Marine Porn Star, in 2005. He has been featured on the cover of The New York Times Magazine, The Advocate, and Washington Post You can order an ebook copy of Rich Merritt\u0027s Secrets of a Gay Marine Porn Star, from Kensington Books at this link . Also available on Amazon: https://a.co/d/bISmitF Andrew\u0027s Links FB Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger Social Media: https://andrewpledger.mypixieset.com/links Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-25T09:55:00Z",
      "duration": "01:03:45.9460000",
      "explicit": false,
      "spotifyId": "6thXZ98W4Lvkk33hgzOpJ1",
      "appleId": 1000650345938,
      "subjects": [
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6thXZ98W4Lvkk33hgzOpJ1",
        "apple": "https://podcasts.apple.com/podcast/ep-4-part-1-secrets-of-a-gay-marine-porn-star-rich-merritt/id1705924428?i=1000650345938"
      }
    },
    {
      "id": "e036e195-4107-4c4b-915d-0f21070ba417",
      "title": "Ep. 3 - FIVE Facts BJU Does NOT Want You To Know - Dr. Camille Lewis",
      "description": "Dr. Camille Lewis attended BJU in the 90s, where she earned both her bachelor\u0027s and master\u0027s degrees. She joined the faculty at BJU and completed her Ph.D. from Indiana University. In 2007, she left BJU after being given an ultimatum: either resign or permit the BJU daycare to spank her 2-year-old son. She chose her son. In this episode, she provides an overview of the history of Bob Jones University. She is currently an Assistant Professor in the Department of Communication Studies at Furman University in Greenville, South Carolina. She holds a Ph.D. from Indiana University in Rhetorical Studies with a minor in American Studies. Her book, \u0027 Romancing the Difference: Kenneth Burke, Bob Jones University, and the Rhetoric of Religious Fundamentalism \u0027, was a scholarly attempt to stretch the boundaries of both Kenneth Burke’s rhetorical theory on tragedy and comedy as well as stretch conservative evangelical’s separatist frames. Her second book, \u0027 White Nationalism and Faith: Statements and Counter-Statements \u0027, tracks the religious arguments for and against white nationalism in America since the Civil War. She is currently working on a manuscript entitled Klandamentalism. After nearly twenty years in the classroom, Camille is thrilled to be teaching Rhetoric \u0026 Strategy, Argumentation, Rhetorical Criticism, Great Speeches, and Public Speaking at Furman. (from Furman’s website) Follow Camille\u0027s blog WutBJU Andrew\u0027s Links FB Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger Social Media: https://andrewpledger.mypixieset.com/links Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-18T12:59:43Z",
      "duration": "01:12:54.5690000",
      "explicit": false,
      "spotifyId": "0Rpt1aGOjW7x1hZBE2JRmc",
      "appleId": 1000649576947,
      "subjects": [
        "Bob Jones University",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Rpt1aGOjW7x1hZBE2JRmc",
        "apple": "https://podcasts.apple.com/podcast/ep-3-five-facts-bju-does-not-want-you-to-know-dr-camille-lewis/id1705924428?i=1000649576947"
      }
    },
    {
      "id": "6de4bba9-bb9a-4468-b828-14d0331d3122",
      "title": "Ep. 2 - Teachings, Theology and Heresies of BJU - Dr. Camille Lewis",
      "description": "Dr. Camille Lewis attended BJU in the 90s, where she earned both her bachelor\u0027s and master\u0027s degrees. She later joined the faculty and remained there until 2007. She left the school after being given an ultimatum: either resign or permit the BJU daycare to spank her 2-year-old son. In this episode, she provides an overview of BJU\u0027s teaching, theology, and heresies. She is currently an Assistant Professor in the Department of Communication Studies at Furman University in Greenville, South Carolina. She holds a Ph.D. from Indiana University in Rhetorical Studies with a minor in American Studies. Her book, Romancing the Difference: Kenneth Burke, Bob Jones University, and the Rhetoric of Religious Fundamentalism, was a scholarly attempt to stretch the boundaries of both Kenneth Burke’s rhetorical theory on tragedy and comedy as well as stretch conservative evangelical’s separatist frames. Her second book, White Nationalism and Faith: Statements and Counter-Statements, tracks the religious arguments for and against white nationalism in America since the Civil War. She is currently working on a manuscript entitled Klandamentalism: Dysfunction and Violence in America’s Most Romantic Religious Movements. After nearly twenty years in the classroom, Camille is thrilled to be teaching Rhetoric \u0026 Strategy, Argumentation, Rhetorical Criticism, Great Speeches, and Public Speaking at Furman. (bio from Furman’s website) Follow Camille\u0027s blog WutBJU Learn more about Courage 365 Andrew\u0027s Links FB Discussion Group: https://www.facebook.com/groups/1153866318625322/ Join my Patreon: https://www.patreon.com/4ndrewpledger Social Media: https://andrewpledger.mypixieset.com/links Music: https://www.purple-planet.com Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-18T09:33:59Z",
      "duration": "01:25:32.0160000",
      "explicit": false,
      "spotifyId": "1pURmmFlcAyfRhIFLANueh",
      "appleId": 1000649556543,
      "subjects": [
        "Evangelicalism",
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1pURmmFlcAyfRhIFLANueh",
        "apple": "https://podcasts.apple.com/podcast/ep-2-teachings-theology-and-heresies-of-bju-dr-camille-lewis/id1705924428?i=1000649556543"
      }
    },
    {
      "id": "9f0a9e8d-d688-4ba0-a2c1-524eb7bb543d",
      "title": "Ep. 1 - In The Beginning There Was BJU (History) - Dr. Camille Lewis",
      "description": "Dr. Camille Lewis attended BJU in the 90s, where she earned both her bachelor\u0027s and master\u0027s degrees. She joined the faculty at BJU and completed her Ph.D. from Indiana University. In 2007, she left the school after being given an ultimatum: either resign or permit the BJU daycare to spank her 2-year-old son. She chose her son. In this episode, she provides an overview of the history of Bob Jones University.\nShe is currently an Assistant Professor in the Department of Communication Studies at Furman University in Greenville, South Carolina. She holds a Ph.D. from Indiana University in Rhetorical Studies with a minor in American Studies. Her book, \u0027Romancing the Difference: Kenneth Burke, Bob Jones University, and the Rhetoric of Religious Fundamentalism\u0027, was a scholarly attempt to stretch the boundaries of both Kenneth Burke’s rhetorical theory on tragedy and comedy as well as stretch conservative evangelical’s separatist frames. Her second book, \u0027White Nationalism and Faith: Statements and Counter-Statements\u0027, tracks the religious arguments for and against white nationalism in America since the Civil War. She is currently working on a manuscript entitled Klandamentalism. After nearly twenty years in the classroom, Camille is thrilled to be teaching Rhetoric \u0026 Strategy, Argumentation, Rhetorical Criticism, Great Speeches, and Public Speaking at Furman. (from Furman’s website)\nFollow Camille\u0027s blog WutBJU\nListen to the Surviving BJU Podcast on Apple Podcasts, Spotify, and Other Platforms\nAndrew\u0027s Links\nFB Discussion Group: https://www.facebook.com/groups/1153866318625322/\nJoin my Patreon: https://www.patreon.com/4ndrewpledger\nSocial Media: https://andrewpledger.mypixieset.com/links\n\nMusic: https://www.purple-planet.com\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-18T00:38:35Z",
      "duration": "00:59:02",
      "explicit": false,
      "spotifyId": "2HarTBjaCpFZ8lr8a5gJrE",
      "appleId": 1000649514102,
      "subjects": [
        "Bob Jones University",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HarTBjaCpFZ8lr8a5gJrE",
        "apple": "https://podcasts.apple.com/us/podcast/ep-1-in-the-beginning-there-was-bju-history-dr-camille-lewis/id1705924428?i=1000649514102"
      }
    },
    {
      "id": "7b3a3f3d-ffa6-47af-8815-0561380258d2",
      "title": "PREVIEW for Beyond BJU",
      "description": "PREMIERING 2024 - Subscribe to stay updated - Join Andrew Pledger as he talks with other BJU survivors and exposes the school’s dark history and teachings. Bob Jones University is a fundamentalist Christian college that is known for its culture of conformity, indoctrination, control, and surveillance. The influence of BJU extends far beyond its gates, serving as a hub for other organizations that spread its harmful teachings and practices. This podcast amplifies the stories of those who suffered at the university and its affiliated churches, camps, and Christian schools.FB Discussion Group: https://www.facebook.com/groups/1153866318625322/Join my Patreon: https://www.patreon.com/4ndrewpledgerSocial Media: https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-03T15:27:45Z",
      "duration": "00:08:42.6840000",
      "explicit": false,
      "spotifyId": "1yliChVjvV0DQIlA8EJMPM",
      "appleId": 1000644042448,
      "subjects": [
        "Bob Jones University",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1yliChVjvV0DQIlA8EJMPM",
        "apple": "https://podcasts.apple.com/podcast/preview-for-beyond-bju/id1705924428?i=1000644042448"
      }
    },
    {
      "id": "96704c8a-8006-49e3-bd0a-a1a10f4a95d1",
      "title": "Teaser #1 - Beyond BJU",
      "description": "PREMIERING 2024 - Subscribe to stay updated - Join Andrew Pledger as he talks with other BJU survivors and exposes the school’s dark history and teachings. Bob Jones University is a fundamentalist Christian college that is known for its culture of conformity, indoctrination, control, and surveillance. The influence of BJU extends far beyond its gates, serving as a hub for other organizations that spread its harmful teachings and practices. This podcast amplifies the stories of those who suffered at the university and its affiliated churches, camps, and Christian schools. FB Discussion Group: https://www.facebook.com/groups/1153866318625322/Join my Patreon: https://www.patreon.com/4ndrewpledgerSocial Media: https://andrewpledger.mypixieset.com/links Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-01-10T18:03:52Z",
      "duration": "00:00:55.9540000",
      "explicit": false,
      "spotifyId": "1eq86LnDJB7bXqf8IlW13m",
      "appleId": 1000641206599,
      "subjects": [
        "Bob Jones University",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1eq86LnDJB7bXqf8IlW13m",
        "apple": "https://podcasts.apple.com/podcast/teaser-1-beyond-bju/id1705924428?i=1000641206599"
      }
    },
    {
      "id": "4adab61a-a09b-42e5-942d-7d4991cf63fa",
      "title": "Beyond BJU - Trailer - Coming 2024",
      "description": "Join Andrew Pledger as he speaks with survivors who have endured harm at Bob Jones University, a fundamentalist college known for its strict regulations and emphasis on indoctrination, conformity, and control. The influence of BJU extends far beyond its gates, serving as the hub for numerous churches, schools, and camps operated by BJU graduates that continue to propagate harmful teachings and controlling dynamics. This podcast provides a platform for survivors to share their experiences at BJU and its affiliated organizations. - Subscribe to stay updated - Premiering early 2024Connect with Andrew PledgerSocial Media: https://andrewpledger.mypixieset.com/linksJoin my Patreon: https://www.patreon.com/4ndrewpledger Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-09-05T00:00:00",
      "duration": "00:01:32.9170000",
      "explicit": false,
      "spotifyId": "7h6JGFwGA2j6lyTRmY2lHo",
      "appleId": 1000626828045,
      "subjects": [
        "Bob Jones University",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7h6JGFwGA2j6lyTRmY2lHo",
        "apple": "https://podcasts.apple.com/podcast/beyond-bju-trailer-coming-2024/id1705924428?i=1000626828045"
      }
    }
  ]
}