{
  "id": "c190c678-d6be-4969-865d-c6d7bc993a79",
  "name": "Beyond Curious ™",
  "spotifyId": "2gFzRJyKpYiBJ2PZroR5nK",
  "appleId": 1539028952,
  "episodes": [
    {
      "id": "07f1980e-756d-477a-a716-fb35a8a427f4",
      "title": "#225: From Escaping A Religious Cult → Collaborating With Disney \u0026 A Landing $500K Children’s Book Deal About A Unicorn Having A Bad Day… w/ Jessika von Innerebner",
      "description": "Jessika Von Innerebner grew up in a religious cult. She wasn’t allowed to go to school. Her family was poor. She had to go door to door every Saturday to preach… She felt trapped. So she made a bold move: At 17, she left. With no idea what she was going to do or live, she boldly started to start living her life the way she wanted to. Slowly, she did exactly that. She ended up working for her dream company, Disney. She became an award winning children\u0027s author, landing a $500,000 book deal for her book series about “Kevin the Unicorn”. She’s now traveling the world with her husband, Trevor (the episode that came out last week!) living a truly magical and inspired life of curiosity. This is a FUN one for anyone who’s looking for inspiration on how to live boldly according to what makes you come alive. Show Notes Generated With The Help of AI! Podcast Show Notes for Beyond Curious - Episode with Jessika von Innerebner 00:00 - Introduction to Beyond Curious and today\u0027s guest, Jessika von Innerebner Brandon Fong introduces the episode with award-winning illustrator and author Jessika von Innerebner. Known for her vibrant storytelling and unique approach to creativity, Jessika’s journey from a challenging upbringing in a religious cult to becoming a Disney artist and bestselling author sets the stage for an inspiring conversation. 02:05 - Meet Jessika and her creative philosophy Brandon highlights Jessika’s creative achievements and discusses her deep understanding of storytelling’s role in shaping beliefs, businesses, and lives. Jessika reflects on finding solace in her imagination during a difficult childhood. 04:31 - The story of TV-B-Gone Jessika humorously recounts how she and her husband, Trevor, discovered and used a device to discreetly turn off intrusive TVs in public spaces, transforming their environments for better conversation and connection. 09:52 - Opting out of a religious cult Jessika details her childhood in the Jehovah’s Witnesses and the moment at age 17 when she chose to leave. She shares the emotional and practical challenges of untangling from a controlling environment and rediscovering her autonomy. 17:51 - Art as an escape and a career launch Jessika discusses how art became her sanctuary and pathway to freedom. She describes pitching herself for an unpaid apprenticeship at 17, which kickstarted her career and eventually led to working with Disney. 23:34 - The dream of Disney realized Jessika reflects on how she manifested her childhood dream of working with Disney, despite facing seemingly insurmountable odds, including limited resources and education. 28:09 - Lessons from Disney and Pixar Jessika shares behind-the-scenes insights from her time at Pixar, where playful workspaces inspired limitless creativity. She emphasizes the importance of staying connected to childlike wonder in creative work. 35:04 - Connecting with readers through storytelling Jessika recounts receiving a heartfelt letter from a young fan of her book Sprout Branches Out, illustrating the profound impact of her stories on readers of all ages. 40:41 - Creating Kevin the Unicorn and embracing imperfection Jessika opens up about the challenges of writing her first book, Kevin the Unicorn: It’s Not All Rainbows. She explains how the story\u0027s core message—accepting life’s messiness—was deeply personal and cathartic. 49:57 - Trevor’s influence and the power of balance Jessika reflects on how meeting her husband, Trevor Blake, taught her the value of detachment and balance in creative work, transforming her from a workaholic into a more fulfilled artist. 54:11 - Constraints as creativity catalysts Jessika explains how she uses self-imposed constraints, like choosing a single letter theme for illustrations, to spark unique and unexpected creative results. 59:33 - Embodying joy in creativity Jessika emphasizes the importance of tuning into physical feelings of joy and excitement as signals for alignment in her creative process. 1:00:23 - A life-changing pivot Jessika recalls June 2021, when meeting Trevor upended her life in the best way, allowing her to align her work, values, and happiness. Links \u0026 Resources: Jessika von Innerebner’s Website: jessvoni.com Jessika von Innerebner’s Books: Kevin the Unicorn: It’s Not All Rainbows Kevin the Unicorn: Why Can’t We Be Bestie-corns? That’s MY Sweater! Sprout Branches Out",
      "release": "2025-02-04T09:00:00Z",
      "duration": "01:17:25.3030000",
      "explicit": true,
      "spotifyId": "56E1Ns8wSrUuiGhK8o3HG4",
      "appleId": 1000688826150,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/56E1Ns8wSrUuiGhK8o3HG4",
        "apple": "https://podcasts.apple.com/podcast/225-from-escaping-a-religious-cult-collaborating/id1539028952?i=1000688826150"
      }
    }
  ]
}