{
  "_ts": 0,
  "id": "9f29109a-ff47-4630-bbb5-4d2bd6d8e555",
  "name": "Beyond The Surface",
  "spotifyId": "4m4UsUynYaRYX11xn5FKgX",
  "appleId": 1724257434,
  "youTubeChannelId": "UClrhs-TdQcRGFSphT3bgcJA",
  "episodes": [
    {
      "id": "d5ca7307-5175-41d8-944a-ab47369f5668",
      "title": "The Spicy Book Author",
      "description": "Spicy book author Sara Madderson joins Beyond the Surface to explore the intersections of faith, sexuality, and personal identity, drawing from her convent education in Dublin and Manchester. She reflects on the pervasive guilt and shame instilled by Catholic teachings and the ways purity culture shaped her understanding of desire and repression. As the conversation unfolds, Sara discusses her literary work, including novels written under the pen name Elodie Hart, which challenge traditional narratives by exploring sexuality (sometimes within religious contexts). Through her writing, she reclaims her story and invites readers to confront the often-taboo tensions between faith, sex and self-expression. This episode offers a thought-provoking look at the power of literature to spark dialogue, promote healing, and challenge deeply ingrained beliefs about autonomy, desire, and self-acceptance. Who Is Sara? Sara Madderson is the person behind the pen name Elodie Hart, an author of super spicy contemporary romance with side helpings of Catholic trauma and priest kink. Connect With Us You can find all of Sara/Elodie\u0027s books on her website - https://elodiehartsaramaddersonshop.myshopify.com/ You can also connect via Instagram , Facebook or her Facebook group . You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-04-02T19:00:00Z",
      "duration": "01:07:34.0470000",
      "explicit": true,
      "spotifyId": "1A2vobVg6K2KNoqG7JLXnp",
      "appleId": 1000701943565,
      "youTubeId": "EtVyChwE6eg",
      "subjects": [
        "Catholicism",
        "_Ireland",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1A2vobVg6K2KNoqG7JLXnp",
        "apple": "https://podcasts.apple.com/podcast/the-spicy-book-author/id1724257434?i=1000701943565",
        "youtube": "https://www.youtube.com/watch?v=EtVyChwE6eg"
      }
    },
    {
      "id": "68cc74f0-6d63-4de0-899a-7630c76dbdce",
      "title": "The Heretical Poet",
      "description": "Marla’s (who I have dubbed the \u0027Heretical Poet\u0027) journey is one of profound transformation, from a conservative evangelical upbringing to an open-minded and inclusive perspective. She shares the challenges of maintaining authenticity, unlearning ingrained biases, and navigating traditional marriage ideals while deconstructing her faith.\n\n\nHer experiences across different U.S. regions shape her reflections on systemic racism, queerness, and spirituality. Through her passion for “poem art” and advocacy at pride festivals, Marla offers guidance to those on similar paths, proving that healing and joy come from embracing personal truth and breaking free from harmful ideologies.\n\n\nWho Is Marla?\n\n\nMarla Taviano is into books, love, justice, globes, anti-racism, blue, gray, rainbows, and poems. She reads and writes for a living, wears her heart on her t-shirts, and is on a journey to live wholefarted (not a typo). She\u0027s the author of Unbelieve, Jaded, and Whole, and lives in South Carolina with her kids and her cats. \n\n\n\n\n\n\nConnect With Us\n\n  •  Find out more at about Marla and her books over on her website - marlataviano.com (https://marlataviano.com) \n  •  You can also connect on Facebook (https://facebook.com/marlataviano)  \u0026 Instagram (https://Instagram.com/marlataviano) \n\n\n\n\n\n  •  You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au (https://www.anchoredcounsellingservices.com.au/) \n  •  To connect with Sam on Instagram - @anchoredcounsellingservices (https://www.instagram.com/anchoredcounsellingservices/) \n  •  Want to contact with Sam about the podcast or therapy? Use this contact form. (https://anchoredcounsellingservices.com.au/contact/)",
      "release": "2025-03-26T19:00:00Z",
      "duration": "01:22:10.8470000",
      "explicit": true,
      "spotifyId": "74LBcUSmfr7t03ITeaK5yj",
      "appleId": 1000700956625,
      "youTubeId": "kGWC2MzXEMI",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74LBcUSmfr7t03ITeaK5yj",
        "apple": "https://podcasts.apple.com/podcast/the-heretical-poet/id1724257434?i=1000700956625",
        "youtube": "https://www.youtube.com/watch?v=kGWC2MzXEMI"
      }
    },
    {
      "id": "0e516545-ef02-4748-b321-84cc9b231e16",
      "title": "The One Who Went In Search Of Authenticity",
      "description": "Authenticity is at the heart of this episode as we sit down with Nismah, who shares her journey from growing up in a strict evangelical household to deconstructing her faith. She reflects on the emotional struggle of reconciling her sexuality with religious beliefs and the pressures of purity culture, particularly for women. Nismah opens up about her time at Bible college, drawn by an unconscious crush, only to confront doctrines that challenged her understanding of identity. As she unlearns ingrained beliefs and embraces her queer identity, she highlights the power of supportive communities in healing and self-discovery. Who Is Nismah? Nismah is a songwriter, producer, vocalist, entrepreneur, and feminist who has been writing and producing music since 2005 for herself, other artists, and sync licensing. After stumbling into the world of film and TV placements in 2011, she cracked the code on funding a music career, landing features in hit shows like Love is Blind, Dancing with the Stars, and Temptation Island. With a degree from Berklee, songwriting and production credits on hundreds of songs, and the opportunity to learn from industry legend Kara DioGuardi, Nismah continues to push creative boundaries and build an ever-evolving musical legacy. Connect With Us You can find out more about Nismah\u0027s work on her website You can also connect over on Instagram You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-03-19T19:00:00Z",
      "duration": "01:18:01.1680000",
      "explicit": true,
      "spotifyId": "2Hk52JYvtSLr90bKX9fpgO",
      "appleId": 1000699993300,
      "youTubeId": "BCwsBBG4kTg",
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Hk52JYvtSLr90bKX9fpgO",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-went-in-search-of-authenticity/id1724257434?i=1000699993300",
        "youtube": "https://www.youtube.com/watch?v=BCwsBBG4kTg"
      }
    },
    {
      "id": "69fad2c0-e901-4e48-b840-2e9c6b472a83",
      "title": "The One Who Chose Love Over Dogma",
      "description": "This episode explores faith, identity, and religious trauma through Linda’s personal journey. Growing up in a tightly-knit Christian community, Linda shares her path through faith transitions, ultimately finding a home in an affirming church. A key discussion centres on the intersection of personal belief and gender identity, particularly in supporting her transgender child. As Linda navigates deconstructing long-held beliefs, she embraces a more nuanced understanding of God and community. This conversation invites listeners into a space of empathy and reflection, highlighting the power of love and acceptance in our spiritual journeys. Who Is Linda? Linda Pesavento listens deeply, laughs a lot and is passionate about the power of owning and honouring our story to bring healing and transformation. Linda is a counsellor in private practice at On The Journey Counselling. She finds great fulfilment in creating a safe space where people feel secure, heard and accepted and feels privileged to be able to walk alongside couples and individuals as they navigate the challenges of life and find a deeper understanding of their own strength and wisdom. Linda is an Australian expat living in Hong Kong. She is wife to Gary, and proud mum to adult children Jay and Sophia. Connect With Us? You can find out more about Linda over on her website - https://www.onthejourneycounselling.com/ You can also connect via Facebook or Instagram You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-03-12T19:00:00Z",
      "duration": "01:22:50.9710000",
      "explicit": true,
      "spotifyId": "5JO7DdMqQRube8XUpbjKMY",
      "appleId": 1000698931415,
      "youTubeId": "IXKb7r7WWAc",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JO7DdMqQRube8XUpbjKMY",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-chose-love-over-dogma/id1724257434?i=1000698931415",
        "youtube": "https://www.youtube.com/watch?v=IXKb7r7WWAc"
      }
    },
    {
      "id": "38123d7c-7cc4-4f38-b963-ae269151e6b1",
      "title": "Understanding Cult Dynamics: Insights from a Survivor and Expert - Dr Gillie Jenkinson",
      "description": "This bonus episode explores the complexities of cults and the psychological impact of religious trauma with Gillie Jenkinson, a psychotherapist specialising in cult recovery. Gillie shares her insights and personal experiences, shedding light on the manipulation and control that define cult dynamics. We discuss the lasting effects on those who leave and the vital role of psychoeducation in rebuilding identity post-cult. Through this conversation, we offer understanding and hope, emphasising that healing is possible with the right support and resources. Who Is Gillie? Dr Gillie Jenkinson is a UKCP accredited psychotherapist, international speaker, published author and director of Hope Valley Counselling. For nearly 30 years she has specialised, as a therapist, researcher and trainer, in the challenges faced by those who have experienced coercive, cultic and spiritual abuse. Gillie\u0027s book \u0027Walking Free from the Trauma of Coercive, Cultic and Spiritual Abuse: A Workbook for Recovery and Growth\u0027 was published by Routledge in May 2023 and which received the Dianne Casoni Award in 2023 https://infosecte.org/en/dianne-casoni-award/ . She was awarded the Herbert L Rosedale award in 2023 ‘in recognition of leadership in the effort to preserve and protect individual freedom, help victims, or inform society about ethical and legal dimensions of the cult phenomenon’. Gillie was a keynote speaker at the DeCULT conference in New Zealand in 2024. Connect With Us To find out more about Gillie\u0027s work head to her website . You can also connect over on Facebook or LinkedIn You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-03-09T19:00:00Z",
      "duration": "00:57:58.9350000",
      "explicit": true,
      "spotifyId": "3sd2uby7RLfrfNIdbvb7jV",
      "appleId": 1000698485363,
      "youTubeId": "GKKFKzBYP8Y",
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sd2uby7RLfrfNIdbvb7jV",
        "apple": "https://podcasts.apple.com/podcast/understanding-cult-dynamics-insights-from-a/id1724257434?i=1000698485363",
        "youtube": "https://www.youtube.com/watch?v=GKKFKzBYP8Y"
      }
    },
    {
      "id": "02e62ef4-b1c7-4453-9894-9bb96083cd0e",
      "title": "The One Who Went From The Bible Belt To Liberation",
      "description": "In this episode of Beyond the Surface, Kit (he/they) shares their deeply personal journey of growing up in the Bible Belt and navigating the impact of religious trauma. Raised in a home influenced by Dr. James Dobson’s child-rearing methods, Kit reflects on the atmosphere of fear and control that shaped their early years. They discuss how this environment, along with the pervasive Christian culture, affected their sense of identity, particularly as a queer individual. As Kit recounts their coming out process, they highlight the social rejection and isolation they faced, shedding light on the challenges of breaking away from traditional religious and societal norms. The episode concludes with Kit’s journey toward self-acceptance, the importance of setting boundaries with toxic family dynamics, and the power of self-love and healing. This conversation offers a meaningful exploration of religious trauma and encourages listeners to embrace their own paths to liberation. Who Is Kit? Kit Morgan (he/they), licensed clinical social worker in New York and creator of @theliberatedporch is a leading innovator for 2SLGBTQIA\u0026#43; religious trauma informed care. When Kit began working in mental health a decade ago with formerly incarcerated individuals, they began to realise the intersectionality of leaving the carceral system and leaving religious fundamentalism. As a former member of Christian fundamentalism and conversion therapy survivor, Kit recognised the importance of directing their work to providing liberation-oriented therapy and education for those who have been impacted by adverse religious or spiritual experiences. Kit’s work is centered around dismantling oppressive ideologies, integrating tried and true healing practices, and cultivating inner wisdom. Connect With Us You can find out more about Kit\u0027s work via their website - https://www.theliberatedporch.com/ You can also connect over on Instagram - @theliberatedporch You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-03-05T19:00:00Z",
      "duration": "01:04:16.4040000",
      "explicit": true,
      "spotifyId": "43lwvpy1KIcgeaSTgsnx73",
      "appleId": 1000697933923,
      "youTubeId": "gLLuu-OMSCQ",
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Christian Fundamentalist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/43lwvpy1KIcgeaSTgsnx73",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-went-from-the-bible-belt-to-liberation/id1724257434?i=1000697933923",
        "youtube": "https://www.youtube.com/watch?v=gLLuu-OMSCQ"
      }
    },
    {
      "id": "1c6035ba-da66-411b-b56e-9dfd6c22941f",
      "title": "The Apostate Barbie",
      "description": "In this episode of Beyond the Surface, Micki shares her powerful journey of breaking free from the Jehovah’s Witness community and navigating life beyond its rigid confines. She reflects on the deep psychological impact of growing up in a high-control religious environment, the fear and uncertainty that came with leaving, and the struggle to redefine her identity outside of the faith. Our conversation explores the complexities of belonging, the emotional toll of losing a tight-knit community, and the courage it takes to rebuild a life on one’s own terms. Micki’s story is a testament to resilience, healing, and the transformative power of self-discovery, offering hope to those on a similar path. Who Is Micki? Micki, known as Apostate Barbie, spent 30 years as a Jehovah’s Witness before having a moment of awakening in October 2020. Following her departure from the tightly controlled religion in February 2021 – still a virgin at 37 years then – she embarked on a journey to rebuild her life from scratch, embracing authenticity, diversity and her sexuality. To educate others, Micki now shares her insights and deconstructs her former faith on TikTok. Her series “Random Things Jehovah’s Witnesses Are Not Allowed To Do” had over two million views, propelling her into the spotlight. As a bisexual woman who grew up in a repressive and sexist environment, Micki is especially dedicated to uplifting the voices of women and LGBTQ\u0026#43; individuals who have faced similar struggles. She is from Auckland but lives in London. Connect With Us Connect with Micki over on Instagram or TikTok You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-02-26T19:00:00Z",
      "duration": "01:12:10.4750000",
      "explicit": true,
      "spotifyId": "7KqPX9PlGmSRE1M2mr7fu3",
      "appleId": 1000696322997,
      "youTubeId": "DHHmC4egPQU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KqPX9PlGmSRE1M2mr7fu3",
        "apple": "https://podcasts.apple.com/podcast/the-apostate-barbie/id1724257434?i=1000696322997",
        "youtube": "https://www.youtube.com/watch?v=DHHmC4egPQU"
      }
    },
    {
      "id": "35c45b9a-0d89-44d1-a5ee-4895fc946aa3",
      "title": "The Loving Heretic",
      "description": "Brady’s journey from a conservative evangelical upbringing to a spiritually liberated life is a powerful exploration of faith, identity, and emotional healing. Growing up under the pressure to conform, he struggled with fear, burnout, and the need for external validation. As he stepped away from organised religion, he discovered the importance of authenticity, safe spaces for vulnerability, and meaningful human connection. His story also challenges traditional masculinity, highlighting the role of therapy and nature in his healing. In this episode of Beyond the Surface, Brady shares his path of deconstruction and reconstruction, offering a fresh perspective on spirituality and personal growth. Who Is Brady? Brady Rather, creator and host of the Love Like A Heretic Podcast, started his journey of spiritual liberation after exiting the evangelical church. A father, musician, artist, and creator, he seeks to create and foster human connections that make us all feel a little less alone at the end of the day. He believes that through empathy, vulnerability and compassion, we can all find a place of individual peace in our pursuit of healthy relationships, friendships and community. Brady hails from the Midwest region of the US, where he and his children enjoy connection with nature, music, art, and the occasional road trip. Connect With Us You can find Brady over on Instagram - @lovelikeaheretic You can find the details for Brady\u0027s podcast Love Like A Heretic here You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-02-19T19:00:00Z",
      "duration": "01:14:25.7110000",
      "explicit": true,
      "spotifyId": "6XTTm7gwpTErH6ZDtHhSR8",
      "appleId": 1000694101597,
      "youTubeId": "8tW-Y81b5GQ",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6XTTm7gwpTErH6ZDtHhSR8",
        "apple": "https://podcasts.apple.com/podcast/the-loving-heretic/id1724257434?i=1000694101597",
        "youtube": "https://www.youtube.com/watch?v=8tW-Y81b5GQ"
      }
    },
    {
      "id": "16735c6f-78b8-4b1e-b5da-cc978ebb685f",
      "title": "The One Who Found The Divine In The Forest",
      "description": "Episode Summary Jess shares her journey from a rigid religious upbringing to a more expansive and liberating spiritual understanding, shaped by her parents’ transition from Indonesian pop stars to church ministers. Growing up in a Pentecostal Charismatic environment, she struggled with purity culture, the pressure to meet impossible religious standards, and restrictive doctrines like the ‘Dating Revelation,’ which removed personal agency in relationships. As she began exploring centering prayer and reconnecting with her intuition, Jess discovered that spirituality could exist beyond the confines of the church. Her story is a powerful testament to the freedom found in self-discovery, love, and the natural world, encouraging listeners to embrace curiosity, question limiting beliefs, and seek communities that nurture authenticity. Who Is Jess? Jess is on a mission to live a more connected and intuitive life. A recovering pastor’s kid, she devoted her whole life to church and ministry until her mid-30s, when she began to ask questions about her faith that had no easy answers. The long process of deconstruction that followed has put her on a pathway toward deeper connection with her own embodied truths and intuition, and a more gentle way of life for her and her children. Today she offers peer support calls for people experiencing spiritual deconstruction and other major life shifts, as well as Reiki healing and Women’s Circles, all in the service of helping others connect to their own inner wisdom. Jess lives with her three brilliant kids and two quirky fur babies among the healing forests of the Dandenong Ranges, Melbourne. Connect With Us Find out more about the work Jess does on her website The Connected Self You can also connect via Facebook \u0026 Instagram You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-02-12T19:00:00Z",
      "duration": "01:08:08.2410000",
      "explicit": true,
      "spotifyId": "5RXQ66Xhdg86AR23UUuxOe",
      "appleId": 1000691536272,
      "youTubeId": "ek3J2mV4Gtc",
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5RXQ66Xhdg86AR23UUuxOe",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-found-the-divine-in-the-forest/id1724257434?i=1000691536272",
        "youtube": "https://www.youtube.com/watch?v=ek3J2mV4Gtc"
      }
    },
    {
      "id": "1fe8b7f0-9b5c-4a4d-ba79-332f9a531830",
      "title": "Understanding Spiritual Coercive Control with Bethany Jantzi",
      "description": "Episode Summary This episode delves deep into the intricacies of coercive control and spiritual abuse within religious communities, highlighting how these dynamics can lead to profound psychological and emotional harm. Bethany, shares her extensive background in the psychology of coercive control and offers valuable insights into the signs of spiritual abuse. They discuss the BITE model, which outlines the methods high-control groups use to manipulate and isolate individuals, and explore the internal struggles victims face, such as fear, obligation, guilt, and confusion. The conversation emphasises the importance of recognising these red flags and taking steps towards healing and recovery, while also addressing the challenges loved ones encounter when trying to support someone in a coercive environment. The episode is a vital resource for those affected, encouraging them to seek safety and reclaim their autonomy in the aftermath of spiritual trauma. Who Is Bethany? Bethany Jantzi is a coercive control educator and consultant. Formally trained as a counsellor, she also holds a Master of Science in the Psychology of Coercive Control from the University of Salford. She is passionate about helping people understand the intricate mechanisms of coercive control and believes that every person has a fundamental right to live free from coercion, abuse, and control. Her research explored high control groups and the weaponisation of religious texts as a form of coercive control against women. Other areas of interest are trauma-coerced attachment, adult clergy sexual abuse, and the process of radicalisation. Connect With Us Find out more over on Bethany\u0027s website - http://www.freefromcontrol.ca You can also connect over on Instagram \u0026 LinkedIn You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-02-09T19:00:00Z",
      "duration": "01:03:49.6550000",
      "explicit": true,
      "spotifyId": "21pXT90FBPmbdvCLKl3kov",
      "appleId": 1000690641996,
      "youTubeId": "i8fru6GgEA4",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21pXT90FBPmbdvCLKl3kov",
        "apple": "https://podcasts.apple.com/podcast/understanding-spiritual-coercive-control-with-bethany/id1724257434?i=1000690641996",
        "youtube": "https://www.youtube.com/watch?v=i8fru6GgEA4"
      }
    },
    {
      "id": "f9173dab-a18f-46b0-9554-c107520c76c9",
      "title": "The One Who Radiates Queer Joy",
      "description": "Episode Summary Nita’s journey of self-discovery reveals her struggle with queerness in a conservative environment, ultimately leading to a powerful realisation about her identity. She reflects on the trauma of leaving a once-belonging community and highlights the value of finding support outside traditional church settings. With vulnerability and honesty, Nita shows how reclaiming joy and peace can transform and empower individuals to grow into their authentic selves. Who Is Nita? Nita (she/they) is a licensed clinical counsellor whose jam is bringing misfits home. Her superpower is turning confusion into clarity. They do this by showing folx how to accept and walk confidently as the best version of themselves. Together, we will shatter the box of status quo and define life in your own terms. Connect With Us You can find out more about Nita\u0027s work via her website - https://nitaagustincounselling.com/ You can also connect via social media on Facebook , Instagram , LinkedIn and Youtube You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-02-05T19:00:00Z",
      "duration": "01:06:24.2220000",
      "explicit": true,
      "spotifyId": "2IA4Dz7EPalliHKTkX3i9H",
      "appleId": 1000689403362,
      "youTubeId": "w8BjhI2b6II",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2IA4Dz7EPalliHKTkX3i9H",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-radiates-queer-joy/id1724257434?i=1000689403362",
        "youtube": "https://www.youtube.com/watch?v=w8BjhI2b6II"
      }
    },
    {
      "id": "3afaefe8-9e01-4e77-8b56-fc3bd23de497",
      "title": "The One Who Went From Missionary Kid to Spiritual Nomad",
      "description": "Nancy reflects on her upbringing in conservative Christian circles, the challenges of being a missionary kid, and the struggles she faced in reconciling her sexuality with her spirituality. As she navigated these complexities, she discovered the importance of self-acceptance and the value of listening to one’s intuition. The discussion also touches on the impact of cultural narratives on personal identity and the transformative power of community support. Through her experiences, Nancy emphasises the need for compassion and understanding in the process of finding one’s authentic self, ultimately encouraging listeners to embrace their own journeys of integration and healing. Who Is Nancy? Nancy Shadlock is a missionary kid turned youth pastor turned spiritual director and Coming Out Coach. When Nancy finally discovered that she didn’t have to divorce her spirituality to embrace her sexuality she started creating the life she’s always dreamed of, but feared would never be possible. Now as the Founder of Centered Consulting \u0026 Coaching and the Conscious Queer Collective and host of The Coming Out Chronicles podcast, she dedicates her time to helping people and organizations break free from metaphorical closets to bravely live the truth of how beautiful and whole they are. Connect With Us You can connect with Nancy via the following: Their website Facebook , Instagram or LinkedIn Their YouTube Channel You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-01-29T19:00:00Z",
      "duration": "00:56:31.2680000",
      "explicit": true,
      "spotifyId": "0jiltNg8wloWlhSvIUck5E",
      "appleId": 1000686838968,
      "youTubeId": "PutwWaV-DzY",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jiltNg8wloWlhSvIUck5E",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-went-from-missionary-kid-to-spiritual-nomad/id1724257434?i=1000686838968",
        "youtube": "https://www.youtube.com/watch?v=PutwWaV-DzY"
      }
    },
    {
      "id": "38aa5db6-d04b-4001-b1e9-5e8ef95f93d4",
      "title": "The Deconstructing Mormon",
      "description": "In this episode of Beyond the Surface, Kristi shares her story of growing up in the Church of Jesus Christ of Latter-day Saints, revealing how traditional gender roles, the belief in eternal family togetherness, and distinct doctrines shaped her upbringing. Navigating the pressures surrounding faith, sexuality, and identity, Kristi discusses her internal conflict over gay marriage, the mental health impact of church teachings, and the emotional toll of keeping secrets. She candidly reflects on her journey out of Mormonism, the role of therapy in embracing her bisexuality, and the delicate task of maintaining family bonds amid a faith transition. Kristi’s experiences highlight the importance of curiosity, grace, and authenticity when forging one’s own path. Who Is Kristi? Kristi Hyde is an eldest daughter, an Aries, and a natural redhead with a deep love for reading romance novels and writing poetry. Born and raised in The Church of Jesus Christ of Latter-Day Saints (Mormon Church), Kristi spent her early life in Utah before relocating to Arizona in 2019 with her partner. A former banking professional, Kristi is now a devoted stay-at-home mum to her two daughters. Her passion for writing has culminated in her debut poetry collection, Self Deconstructing: Mormon Faith Journey Poetry, which beautifully captures her journey of faith deconstruction and personal growth. Connect With Us Connect with Kristi over on Instagram . You can purchase Self Deconstructing: Mormon Faith Journey Poetry over on Amazon . You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-01-22T19:00:00Z",
      "duration": "01:16:52.8320000",
      "explicit": true,
      "spotifyId": "54q2fkrdzxCYekDUsBEGMJ",
      "appleId": 1000685052607,
      "youTubeId": "1lzQ2yugvrM",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/54q2fkrdzxCYekDUsBEGMJ",
        "apple": "https://podcasts.apple.com/podcast/the-deconstructing-mormon/id1724257434?i=1000685052607",
        "youtube": "https://www.youtube.com/watch?v=1lzQ2yugvrM"
      }
    },
    {
      "id": "a8a8d78b-5b62-4d2c-b6e5-9a70b53dd7ea",
      "title": "The One Who Went From Born-Again Christian to Agnostic Atheist",
      "description": "In this episode of Beyond the Surface, Sallyann shares how her family’s shift from Roman Catholicism to born-again Christianity in 1970s Ireland sparked both connection and conflict, ultimately leading her to question long-held beliefs. She recounts a six-year relationship overshadowed by a controlling religious community, a move to Australia in search of healing, and the personal upheaval of deconstructing her faith and marriage. Embracing atheism and agnosticism, Sally-Ann illustrates the transformative power of choosing curiosity over certainty, reminding us that forging one’s own identity can bring both freedom and self-discovery. Who Is Sallyann? Born into a Catholic family in Ireland, and then becoming a ‘born again Christian’ and moving to a Pentecostal church, Sallyann was serious about her faith and her commitment to God. It wasn’t until she started studying Psychology and Counselling in her late 30s that she began having doubts and questioning her faith. After several years of ‘seeking God’, reading and researching, and talking to other Christians including church leaders, she found that she could no longer call herself a Christian. Sallyann is now a therapist working in Perth, Western Australia, specialising in supporting people who are questioning their faith, or who are leaving or have left a high control religion or cult. Having experienced spiritual abuse and engaging in her own therapy to recover from religious trauma, she now has a sense of freedom and peace that she never had as a religious person. Connect With Us You can connect with Sallyann via her Website , Facebook or LinkedIn You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-01-15T19:00:00Z",
      "duration": "01:01:50.7720000",
      "explicit": true,
      "spotifyId": "4VGUGRqQlSpIDIeq8nx2Xp",
      "appleId": 1000684130653,
      "youTubeId": "F2VKT3XVxKU",
      "subjects": [
        "Evangelicalism",
        "Catholicism",
        "Psychology",
        "Cult Recovery",
        "_Ireland"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VGUGRqQlSpIDIeq8nx2Xp",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-went-from-born-again-christian-to/id1724257434?i=1000684130653",
        "youtube": "https://www.youtube.com/watch?v=F2VKT3XVxKU"
      }
    },
    {
      "id": "edd94023-b8b1-4d2f-9c11-d54713d96ab1",
      "title": "The Religious Abuse \u0026 Academic Sabotage Survivor (Part Two)",
      "description": "In this episode of Beyond the Surface, Katrina shares her journey of religious trauma and abuse amid the chaos of the COVID-19 pandemic, recounting how American missionaries’ abrupt departure left her feeling abandoned in Africa. She describes relocating to the U.S. with her family, only to face academic sabotage, familial tensions, and a struggle for independence. Katrina’s determination to pursue higher education and a career in psychology, despite parental disapproval and health challenges, highlights her resilience and search for identity. As she breaks free from toxic control, Katrina finds hope through unexpected community support and reshapes her faith on her own terms, embracing the compassion of Jesus beyond traditional confines. More About Katrina Speaker and life coach that specialises in religious abuse, academic sabotage, and good girl syndrome, Katrina is currently living her best life in her renovated garage, feverishly writing away and creating motivational speeches! She hopes her ongoing projects will help others find the same peace she has found. Katrina is a teacher to toddlers by day, an overachieving writer by night, and a coffee-drinking socialiser on the weekends! As a never-ending psychology enthusiast, Katrina is not ashamed to seek trauma-informed therapy every week! Katrina loves making new connections with churches and colleges through her speaking career and collaborating with other artists who are trying to create beauty out of pain. Katrina\u0027s biggest focus is to speak around the US and eventually around the world, including Africa, where she was orphaned, adopted, and raised as a missionary for 20 years. Connect With Us Find out more about Katrina on her website - https://www.speakwithkatrina.online/ You can also connect via Facebook or Instagram You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-01-08T19:00:00Z",
      "duration": "00:52:45.3870000",
      "explicit": true,
      "spotifyId": "6k9z53lEZQH7EHrmAa1c22",
      "appleId": 1000683215441,
      "youTubeId": "XyEWRiUHBrA",
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6k9z53lEZQH7EHrmAa1c22",
        "apple": "https://podcasts.apple.com/podcast/the-religious-abuse-academic-sabotage-survivor-part-two/id1724257434?i=1000683215441",
        "youtube": "https://www.youtube.com/watch?v=XyEWRiUHBrA"
      }
    },
    {
      "id": "e898fd06-c678-4e62-8074-28c513b63c0b",
      "title": "The Religious Abuse \u0026 Academic Sabotage Survivor (Part One)",
      "description": "In this episode (and its only Part One) of Beyond the Surface, Katrina shares her remarkable journey of religious abuse within a remote East African missionary setting, shaped by her adventurous father, her mother’s struggle with depression, and the unique challenges of being an African orphan adopted by American missionaries. She reflects on the cultural dissonance of navigating life between Africa and the United States, confronting issues of race, identity, and the expectations tied to diverse Christian traditions. Katrina’s resilience is illuminated through her candid account of academic sabotage, highlighting how mentorship and self-awareness guided her beyond her family’s limitations. Her story offers hope to anyone seeking to redefine their path amid rigid religious and cultural constraints. More About Katrina Speaker and life coach that specialises in religious abuse, academic sabotage, and good girl syndrome, Katrina is currently living her best life in her renovated garage, feverishly writing away and creating motivational speeches! She hopes her ongoing projects will help others find the same peace she has found. Katrina is a teacher to toddlers by day, an overachieving writer by night, and a coffee-drinking socialiser on the weekends! As a never-ending psychology enthusiast, Katrina is not ashamed to seek trauma-informed therapy every week! Katrina loves making new connections with churches and colleges through her speaking career and collaborating with other artists who are trying to create beauty out of pain. Katrina\u0027s biggest focus is to speak around the US and eventually around the world, including Africa, where she was orphaned, adopted, and raised as a missionary for 20 years. Connect With Us Find out more about Katrina on her website - https://www.speakwithkatrina.online/ You can also connect via Facebook or Instagram You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2025-01-01T19:00:00Z",
      "duration": "00:50:07.8690000",
      "explicit": true,
      "spotifyId": "1vJRSrZ4Ts8R1CLWb0DSzT",
      "appleId": 1000682341429,
      "youTubeId": "K4KIiBckeFc",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1vJRSrZ4Ts8R1CLWb0DSzT",
        "apple": "https://podcasts.apple.com/podcast/the-religious-abuse-academic-sabotage-survivor-part-one/id1724257434?i=1000682341429",
        "youtube": "https://www.youtube.com/watch?v=K4KIiBckeFc"
      }
    },
    {
      "id": "5ba7dada-3420-4a3a-a57e-f2750df5227e",
      "title": "How To Be Okay Over Christmas",
      "description": "Navigating the complexities of Christmas can be particularly challenging for those who have experienced religious trauma or disconnection from their previous faith communities. This conversation delves into strategies for being okay over the holiday season, emphasising the importance of awareness around triggers and the need for self-compassion. Host Sam and guest Jane reflect on their personal experiences with Christmas, sharing how their celebrations have evolved from church-centric traditions to more individualised, meaningful rituals. They discuss the significance of boundaries, especially in familial contexts, and encourage listeners to prioritise their well-being by recognising their needs and feelings. Ultimately, the episode offers practical tools and insights to foster a sense of connection and joy, regardless of one\u0027s past or current beliefs.\n\n\nMore About Jane\n\n\nJane Kennedy is a Sydney-based Counsellor. Jane has lived experience of religious trauma and is committed to supporting people as they leave church and/or faith. This experience, still frequently misunderstood, can be life-altering. She brings language and framing for the complexities of religious trauma to the counselling space and works with other Australian therapists to broaden knowledge among those working with affected clients. Jane has written her story, an e-book, The Sentimental Non-Believer, on Loving \u0026 Leaving God.\n\n\n\n\n\n\nConnect With Us\n\n  •  To find out more about Jane and her practice head to her website – https://janekennedycounselling.com.au/\n  •  Or to connect with her on social media; you can find her on Instagram (https://www.instagram.com/JaneKennedyCounselling) , Facebook (https://www.facebook.com/profile.php?id=100089194685387) , and LinkedIn (https://www.linkedin.com/in/jane-kennedy-2b487222a/) \n\n\n\n\n\n  •  You can find out more about Sam on her website – www.anchoredcounsellingservices.com.au (https://www.anchoredcounsellingservices.com.au/) \n  •  To connect with Sam on Instagram – @anchoredcounsellingservices (https://www.instagram.com/anchoredcounsellingservices/) \n  •  Want to contact with Sam about the podcast or therapy? Use this contact form. (https://anchoredcounsellingservices.com.au/contact/)",
      "release": "2024-12-08T19:36:32Z",
      "duration": "01:12:40.1760000",
      "explicit": true,
      "spotifyId": "4AGzaTxD5PODtNoblnEBJA",
      "appleId": 1000679683478,
      "youTubeId": "oqfSGQwDGYQ",
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4AGzaTxD5PODtNoblnEBJA",
        "apple": "https://podcasts.apple.com/podcast/how-to-be-okay-over-christmas/id1724257434?i=1000679683478",
        "youtube": "https://www.youtube.com/watch?v=oqfSGQwDGYQ"
      }
    },
    {
      "id": "c128036b-805f-4f6b-950b-70b0483a5f96",
      "title": "The Body Whisperer",
      "description": "In this episode, Zoe shares her transformative journey from a conservative Christian upbringing steeped in guilt and purity culture to embracing her true identity and sexuality. Reflecting on the impact of religious trauma on self-esteem and relationships, she highlights her path to healing through bodywork and self-compassion. Zoe’s story offers hope and inspiration for reclaiming authenticity and self-acceptance. Who Is Zoe? With over 14 years of experience in the bodywork and spa industry, including a transformative role as International Trainer for the eco-luxe brand Sodashi, Zoe has worked with some of the world’s most renowned luxury spas, including One\u0026Only, Four Seasons, and Shangri-La. Known for inspiring teams and delivering impactful, transformational training, Zoe became a standout trainer in the industry. Drawing on years of insight, Zoe recognised a gap in the spa world: the need for therapists to cultivate presence, intention, and the ability to create deeply transformative guest experiences. This realisation led her to create Body Whispering, evolving from offering treatments at home to building a thriving business with over 300 clients and taking her unique approach on tour across Australia. Connect With Us Find more about Zoe\u0027s offerings via her website - https://www.zoebutler.com.au/ You can also connect over on Instagram - @zoebutler.bodywhisperer You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-12-04T19:00:00Z",
      "duration": "00:56:56.5280000",
      "explicit": true,
      "spotifyId": "1DJVxThhqvPPJCfZBdjhSB",
      "appleId": 1000679246334,
      "youTubeId": "1D0Rsa1zyCU",
      "subjects": [
        "Purity Culture",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DJVxThhqvPPJCfZBdjhSB",
        "apple": "https://podcasts.apple.com/podcast/the-body-whisperer/id1724257434?i=1000679246334",
        "youtube": "https://www.youtube.com/watch?v=1D0Rsa1zyCU"
      }
    },
    {
      "id": "7f4d92b4-3055-4c8b-8e8e-c20c2dc9f78e",
      "title": "The One Who Was Excommunicated - Part Two",
      "description": "Craig shares his powerful story of returning to Invercargill after leaving the Exclusive Brethren, recounting the heartache of family rejection and a poignant encounter with his little sister. We explore the deep complexities of healing from religious trauma and the challenges faced when leaving a high-control community, emphasising that healing is about gaining freedom from the past, not erasing it. Craig sheds light on the fear and surveillance tactics employed by these communities against those who choose to leave and the cultural adjustments required to adapt to mainstream society. Reflecting on his journey of self-discovery and the importance of personal identity, Craig’s insights highlight the need for sensitivity and respect when engaging with those who’ve left insular religious backgrounds. Who Is Craig? Craig Hoyle grew up in Invercargill within the New Zealand Exclusive Brethren. Separated from public society, he attended Brethren-only schooling and worked in his family\u0027s tyre shop. After facing interrogations and conversion therapy for his sexuality, he was excommunicated from the Brethren and lost his family in 2009. Today he is a news director for the Sunday Star-Times. He has worked for newsrooms such as TV3 and RadioLive, and behind the scenes on current affairs shows including 60 Minutes and 3rd Degree. He lives in Auckland, New Zealand. Connect With Us You can connect with Craig via Instagram or LinkedIn Grab Craig\u0027s book \u0027Excommunicated\u0027 You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-11-27T19:00:00Z",
      "duration": "01:04:50.5990000",
      "explicit": true,
      "spotifyId": "7wXCVyECrfydFN0a5SlUHx",
      "appleId": 1000678444417,
      "youTubeId": "l9mdrhrNXXE",
      "subjects": [
        "Plymouth Brethren Christian Church",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7wXCVyECrfydFN0a5SlUHx",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-was-excommunicated-part-two/id1724257434?i=1000678444417",
        "youtube": "https://www.youtube.com/watch?v=l9mdrhrNXXE"
      }
    },
    {
      "id": "8aac27ec-0882-4404-87fb-a4d390eeb5f1",
      "title": "The One Who Was Excommunicated - Part One",
      "description": "Craig, author of Excommunicated, shares his journey growing up within the Exclusive Brethren, a high-control religious group where strict doctrines governed every aspect of life. Realising his community\u0027s isolation wasn\u0027t the norm, Craig embarked on a path of faith deconstruction and self-discovery, facing profound challenges around identity, sexuality, and belonging. Through heartfelt reflections, he recounts the painful experiences of coming out, being excommunicated, and confronting the emotional toll of family estrangement. Craig\u0027s story highlights the complex process of building a life outside the only world he’d known, using humour as a coping mechanism and finding resilience in the face of trauma and cultural disorientation. This conversation provides a rare glimpse into the lasting impacts of strict religious control and the courageous pursuit of self-acceptance.\n\n\nWho Is Craig?\n\n\nCraig Hoyle grew up in Invercargill within the New Zealand Exclusive Brethren. Separated from public society, he attended Brethren-only schooling and worked in his family\u0027s tyre shop. After facing interrogations and conversion therapy for his sexuality, he was excommunicated from the Brethren and lost his family in 2009. Today he is a news director for the Sunday Star-Times. He has worked for newsrooms such as TV3 and RadioLive, and behind the scenes on current affairs shows including 60 Minutes and 3rd Degree. He lives in Auckland, New Zealand.\n\n\nConnect With Us\n\n  •  You can connect with Craig via Instagram (https://Instagram.com/craighoylenz)  or LinkedIn (https://www.linkedin.com/in/craig-hoyle-95535a189/)  \n  •  Grab Craig\u0027s book \u0027Excommunicated\u0027  (https://www.harpercollins.com.au/9781775492320/excommunicated/) \n\n\n\n\n\n  •  You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au (https://www.anchoredcounsellingservices.com.au/) \n  •  To connect with Sam on Instagram - @anchoredcounsellingservices (https://www.instagram.com/anchoredcounsellingservices/)   \n  •  Want to contact with Sam about the podcast or therapy? Use this contact form. (https://anchoredcounsellingservices.com.au/contact/)",
      "release": "2024-11-20T19:30:34Z",
      "duration": "01:29:30",
      "explicit": false,
      "spotifyId": "0zOUMhkEKw8ojy7eZolowV",
      "appleId": 1000677670028,
      "youTubeId": "pVveluEEcNY",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0zOUMhkEKw8ojy7eZolowV",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-was-excommunicated-part-one/id1724257434?i=1000677670028",
        "youtube": "https://www.youtube.com/watch?v=pVveluEEcNY"
      }
    },
    {
      "id": "e0ba2d21-f623-445e-81c9-4f4433816c9a",
      "title": "The One Who Was Lied To About God",
      "description": "In this compelling conversation, Dr. Jamie Marich shares her journey from a turbulent upbringing shaped by Croatian Catholicism and Pentecostal evangelicalism to a place of self-acceptance and spiritual healing. Jamie grappled with conflicting beliefs about faith, morality, and her early awareness of her queer identity, leading to deep spiritual trauma. In her memoir, You Lied to Me about God, she confronts the religious shame and guilt she endured, advocating for a spirituality that honours her authentic self. Jamie emphasises the importance of chosen family and community support in the healing process, offering listeners hope and encouragement to explore their own spiritual paths, challenge harmful narratives, and embrace a compassionate, inclusive understanding of faith.\n\n\nWho Is Jamie? \n\n\nDr. Jamie\u002B Marich (she/they/we) began her career as a humanitarian aid worker in Bosnia-Herzegovina where they primarily taught English and music from 2000 to 2003. Jamie travels internationally, teaching on topics related to trauma, EMDR Therapy, expressive arts, mindfulness and yoga, while maintaining a private practice and online education operations in her home base of Akron, Ohio. \n\n\n Marich’s previous books include Dissociation Made Simple, EMDR Made Simple, Trauma Made Simple, Dancing Mindfulness, Process Not Perfection, Trauma and the 12 Steps in addition to other titles. \n\n\n The New York Times featured Marich’s writing and work on Dancing Mindfulness in 2017 and 2020. NALGAP awarded Jamie with their esteemed President’s Award in 2015 for her work as an LGBT\u002B advocate. The EMDR International Association (EMDRIA) granted Marich the 2019 Advocacy in EMDR Award for her using her public platform to advance awareness about EMDR and to reduce stigma around mental health. The Huffington Post published her personal story of being out as a clinical professional with a dissociative disorder in May 2023. \n\n\n\n\n\n\nConnect With Us\n\n  •  Find out more about Jamie via their website - http://www.jamiemarich.com (https://www.jamiemarich.com) \n  •  You can also connect on Facebook (https://www.facebook.com/drjamiemarich)  or Instagram (https://Instagram.com/drjamiem) \n  •  You can also find more content on Jamie\u0027s Youtube (https://www.youtube.com/@DrJamieMM) . \n\n\n  \n\n  •  You can find out more about Sam on her website  - www.anchoredcounsellingservices.com.au (https://www.anchoredcounsellingservices.com.au/) \n  •  To connect with Sam on Instagram - @anchoredcounsellingservices (https://www.instagram.com/anchoredcounsellingservices/) \n  •  Want to contact with Sam about the podcast or therapy? Use this contact form. (https://anchoredcounsellingservices.com.au/contact/)",
      "release": "2024-11-13T19:42:43Z",
      "duration": "00:59:49",
      "explicit": false,
      "spotifyId": "5daPWUbazrvu6Cf5zRRpfa",
      "appleId": 1000676851146,
      "youTubeId": "xpanEQlxyFo",
      "subjects": [
        "Catholicism",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5daPWUbazrvu6Cf5zRRpfa",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-was-lied-to-about-god/id1724257434?i=1000676851146",
        "youtube": "https://www.youtube.com/watch?v=xpanEQlxyFo"
      }
    },
    {
      "id": "7cc263cd-ad4c-4ca2-92eb-42385e7065bc",
      "title": "The Whistleblower of a Dominionist Cult",
      "description": "In a heartfelt exploration of religious trauma, Sam and Clare delve into Clare\u0027s experiences as a pastor\u0027s daughter in a high-control church. Clare reflects on the authoritarian, misogynistic dynamics of her upbringing, revealing how these shaped her identity through expectations of perfection and submission. The discussion broadens to examine religious control\u0027s impact, including conversion therapy practices and LGBTQ\u0026#43; rights. Clare’s journey of breaking free, becoming a whistleblower, and advocating for others underscores her resilience, even as she navigates the challenges of familial ties. Her humour and authenticity offer hope and empower listeners to embrace healing, self-care, and reclaiming their values. Who Is Clare? Clare Heath-McIvor, formerly known as Kit Kennedy in the blogging and podcasting world, is a dedicated communications professional with specialisations in research writing, manuscript development, and non-fiction publishing. She’s passionate about helping people understand their experiences within evangelicalism and high-demand groups, empowering them to navigate life beyond those frameworks. A proud mum to two spirited souls, Clare balances life as a businesswoman, advocate, and church survivor who has even taken her turn as a whistleblower. Though naps rank high on her list of passions, Clare is deeply committed to her journey through theology and faith deconstruction, which she chronicles with honesty and optimism. Her blog began as an outlet for exploring theology but evolved into a profound journey of faith deconstruction and discovery, leading her to a new way of engaging with spirituality. Today, Clare writes from a place of peace, aiming for that grounded perspective to resonate through her words. In early 2020, she launched Unchurchable, a podcast for those who find spirituality more accessible than traditional church structures. Whether due to doctrine, trauma, social justice concerns, or other factors, Unchurchable offers a space for those excluded from traditional spaces to engage meaningfully with faith. Clare’s podcast journey expanded in 2023 with Survivors Discuss, co-hosted with Cait West and Shari Smith, where she dives into life after Christian patriarchy alongside two powerhouse voices in the deconstruction space. When not writing, Clare indulges her love for photography, explores Melbourne’s galleries and bookshops, and occasionally tries her hand at stand-up comedy. Connect With Us! Check out Clare\u0027s writing on her website - https://www.clareheathmcivor.com You can also connect over on Facebook or Instagram (and @Unchurchablepod ) Check Out Unchurchable \u0026 Survivors Discuss You can find out more about Sam on her website - www.anchoredcounsellingservices.com.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-11-06T19:00:00Z",
      "duration": "01:26:53.2040000",
      "explicit": true,
      "spotifyId": "3BBAKwFeczhh4AO6UYYiCl",
      "appleId": 1000675946963,
      "youTubeId": "lLXscd1i230",
      "subjects": [
        "Evangelicalism",
        "Christian Fundamentalist",
        "Cult Recovery",
        "Psychology",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BBAKwFeczhh4AO6UYYiCl",
        "apple": "https://podcasts.apple.com/podcast/the-whistleblower-of-a-dominionist-cult/id1724257434?i=1000675946963",
        "youtube": "https://www.youtube.com/watch?v=lLXscd1i230"
      }
    },
    {
      "id": "bcd92591-634a-4910-be5a-40e07cef09dd",
      "title": "Recovering From Purity Culture As A Person Of Faith with Dr Camden Morgante",
      "description": "In this episode, I am joined by Dr. Camden Morgante. We explore the intricate intersections of faith, sexuality, and recovery from religious trauma, particularly in the context of purity culture. Dr. Morgante, a psychologist and author of Recovering from Purity Culture, shares her journey of navigating evangelical teachings that shaped her understanding of identity and sexuality, highlighting the disillusionment she felt as these teachings clashed with her experiences. The conversation challenges myths like the notion of \u0022damaged goods\u0022 after premarital sex, which perpetuate shame and hinder healthy relationships, especially for women. Dr. Morgante encourages listeners to reclaim their faith without shame, inviting them to embrace curiosity, self-reflection, and supportive communities on their journey toward healing and self-acceptance. Who Is Dr Camden Morgante? Dr. Camden Morgante (pronunciation: More-GAN-tee) is a licensed clinical psychologist with nearly 15 years of experience as a therapist and college professor. In addition to her private therapy practice, she is a writer, speaker, and coach on issues of relationships, sexuality, trauma, and faith. Her first book, Recovering from Purity Culture, released in 2024. Dr. Camden lives in Knoxville, Tennessee with her husband and their daughter and son. Connect with Us Learn more about Camden on her website, www.drcamden.com Buy Recovering from Purity Culture: www.drcamden.com/book or wherever books are sold Substack: Walking the Middle Path Social media: @drcamden To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-11-03T19:00:00Z",
      "duration": "00:57:39.6310000",
      "explicit": true,
      "spotifyId": "2l8IfhyJC5v15W40r1PlhV",
      "appleId": 1000675528810,
      "youTubeId": "glJ9EYHLEHU",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2l8IfhyJC5v15W40r1PlhV",
        "apple": "https://podcasts.apple.com/podcast/recovering-from-purity-culture-as-a-person-of-faith/id1724257434?i=1000675528810",
        "youtube": "https://www.youtube.com/watch?v=glJ9EYHLEHU"
      }
    },
    {
      "id": "d89f0929-1951-45db-a12b-5d917c116a9b",
      "title": "The Holy Runaway",
      "description": "In this episode of Beyond the Surface, Matthias shares his courageous journey of navigating the intersection of faith and identity, growing up in a conservative religious environment while grappling with homophobia and his own sexuality. A pivotal moment helped him embrace his identity and begin deconstructing his faith. Matthias reflects on the challenges of reconciling being both queer and Christian, confronting traditional beliefs, and finding a deeper connection to God. His story offers hope and insight for those seeking to live authentically while healing from the wounds of religious rejection and rigid doctrines. Who Is Matthais? Matthias Roberts (he/him) is a queer psychotherapist and author of Holy Runaways: Rediscovering Faith after Being Burned by Religion and Beyond Shame: Creating a Healthy Sex Life on Your Own Terms. Formerly, he hosted the popular podcast Queerology which was dubbed by O: The Oprah Magazine as “one of the best LGBTQ\u0026#43; podcasts.” Matthias holds two master’s degrees from The Seattle School of Theology and Psychology, one in Theology \u0026 Culture and one in Counselling Psychology. Matthias’ work has been featured by Bustle, Woman’s Day, Sojourners, The Seattle Times, and many others. In his psychotherapy practice, Matthias specialises in helping people recover from religious and spiritual trauma so they might live confident and fulfilling lives. Connect with Us You can find out more about Matthias via his website You can also connect over on Instagram - @matthiasroberts To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-10-30T19:00:00Z",
      "duration": "00:49:24.7670000",
      "explicit": true,
      "spotifyId": "5VbaN20lOIWwCXoNB8ZKH7",
      "appleId": 1000675103513,
      "youTubeId": "3OVF6w29wAE",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5VbaN20lOIWwCXoNB8ZKH7",
        "apple": "https://podcasts.apple.com/podcast/the-holy-runaway/id1724257434?i=1000675103513",
        "youtube": "https://www.youtube.com/watch?v=3OVF6w29wAE"
      }
    },
    {
      "id": "afe3f2a0-66b8-4f36-9d8e-b66b9f874caf",
      "title": "The Former Fundamentalist",
      "description": "In this episode of Beyond the Surface, we hear Megan’s powerful story of resilience and transformation as she navigates life after growing up in a fundamental, high-control evangelical environment. From the pressures of purity culture to the emotional toll of fear-based faith, Megan shares how she transitioned from conventional therapy to religious harm recovery. Through candid reflections on toxic relationships, faith-driven guilt, and post-traumatic growth, Megan’s journey highlights the importance of community, self-exploration, and reclaiming one’s identity after religious trauma.\n\n\nWho Is Megan?\n\n\nMegan is a Licensed Psychotherapist and Religious Harm Recovery Coach who was indoctrinated into fundamentalist evangelical christianity at an early age. Her work in the mental health field eventually helped her begin to make sense of her complicated family history and the way the patriarchal religious groups of her childhood supported harmful, authoritarian systems of control. She now draws from both her personal experience and professional expertise to help others recover from religious harm and reclaim their authentic selves.\n\n\nConnect with Us\n\n  •  You can find more about Megan\u0027s work on her website - https://meganvonfricken.com \n  •  You can also connect on Instagram (https://www.instagram.com/religious.harm.recovery/)  or Facebook (https://www.facebook.com/profile.php?id=100095273545685) \n  •  To join Megan\u0027s group for religious harm recovery click here (https://www.facebook.com/groups/religiousharmrecovery) .\n\n\n\n\n\n  •  To connect with Sam on Instagram - @anchoredcounsellingservices (https://www.instagram.com/anchoredcounsellingservices/) \n  •  Want to contact with Sam about the podcast or therapy? Use this contact form. (https://anchoredcounsellingservices.com.au/contact/)",
      "release": "2024-10-23T19:34:16Z",
      "duration": "01:08:32",
      "explicit": false,
      "spotifyId": "4Lu1FmIg6PTbD4N1l494MX",
      "appleId": 1000674196319,
      "youTubeId": "JbwKTX4nHyE",
      "subjects": [
        "Evangelicalism",
        "Cult Recovery",
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Lu1FmIg6PTbD4N1l494MX",
        "apple": "https://podcasts.apple.com/podcast/the-former-fundamentalist/id1724257434?i=1000674196319",
        "youtube": "https://www.youtube.com/watch?v=JbwKTX4nHyE"
      }
    },
    {
      "id": "6f6752bd-1a5d-4791-b60c-e83cf1f9863c",
      "title": "Bridging the Gap - The Religious Trauma Collective",
      "description": "Join us in this enlightening episode of Beyond the Surface as we explore the multifaceted topic of religious trauma in Australia and New Zealand. Joined by Jane Kennedy and Elise Heerd, both therapists and we are all co-founders of the Religious Trauma Collective. Together, we discuss the significant launch of this collective, which aims to provide community, support, and understanding for individuals impacted by religious trauma. The collective is committed to building a registry of trauma-informed practitioners, offering support to those seeking help, and creating a resource hub that showcases local stories and memoirs. Find Out More About Us Sam - website or Instagram. Jane - website or Instagram Elise - website or Instagram The Religious Trauma Collective Visit our website - https://www.thereligioustraumacollective.com/ If you are a practitioner working with religious trauma; why not join our registry ?! We are also on Instagram \u0026 Facebook Listen to our stories Sam - \u0027Me, Myself \u0026 I\u0027 Jane - \u0027The Sentimental Non-Believer\u0027 Elise - \u0027 The Former Good Christian Girl\u0027",
      "release": "2024-10-20T19:00:00Z",
      "duration": "01:03:31.8130000",
      "explicit": true,
      "spotifyId": "4BzLCLKstIXLjSECbKCc9S",
      "appleId": 1000673758084,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BzLCLKstIXLjSECbKCc9S",
        "apple": "https://podcasts.apple.com/podcast/bridging-the-gap-the-religious-trauma-collective/id1724257434?i=1000673758084"
      }
    },
    {
      "id": "67b182e4-e70f-430e-9492-01516b58e11c",
      "title": "The Descendant of Joseph Smith",
      "description": "Lynn, a direct descendant of Joseph Smith, she shares her journey of faith deconstruction that began in Utah after confronting troubling historical truths about her ancestor and the Book of Mormon. Lynn\u0027s path of navigating religious trauma, embracing uncertainty, and redefining her spiritual identity highlights the role of therapy and self-compassion in the process. We also explore the complexities of family dynamics when beliefs diverge, and the importance of fostering mutual respect and understanding amid religious transitions. Who Is Lyn? Lyn Smith Gregory grew up in Utah as one of nine children in a devout Mormon family. Her great, great uncle was Joseph Smith, founder of the Mormon Church. At 19, she left the Church and moved to New York City, eventually obtaining an MBA at NYU. After a 20-year career in the tech industry, she left to pursue writing full-time and has attended the Iowa Summer Writing Program and the Bread Loaf Writers’ Conference. She lives in Savannah with her husband. Connect With Us You can connect with Lyn on Facebook , Instagram or LinkedIn Or reach out via her website To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-10-16T19:00:00Z",
      "duration": "00:55:08.1730000",
      "explicit": true,
      "spotifyId": "1mm9Z5ahJCyhNl8sRVk2UR",
      "appleId": 1000673346176,
      "youTubeId": "toLDxuwJaWs",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1mm9Z5ahJCyhNl8sRVk2UR",
        "apple": "https://podcasts.apple.com/podcast/the-descendant-of-joseph-smith/id1724257434?i=1000673346176",
        "youtube": "https://www.youtube.com/watch?v=toLDxuwJaWs"
      }
    },
    {
      "id": "71967e81-4d47-458d-b152-899b01defc40",
      "title": "The Exvangelical Parent",
      "description": "What happens when the church you trust becomes a source of fear and exclusion? In this episode of Beyond the Surface, we sit down with Kimberley, known as the exvangelical parent, to discuss her journey through conservative evangelicalism, growing up during the satanic panic and purity culture. Kimberley shares her struggles with undiagnosed OCD, vivid memories of being shown graphic depictions of hell, and navigating family dynamics shaped by political conservatism. From supporting her brother as he came out to navigating her own deconstruction as a parent, this is a story of fear, resilience, and finding peace beyond religious teachings.\n\n\nWho Is Kimberly? \n\n\nKimberly, She/Her, is the founder of The Exvangelical Parent. She is a writer, artist, wife, and over-caffeinated mom. Enneagram 9. INFP. She is a queer, neurodivergent, hopeful agnostic who likes long walks in the forest and Zoloft. After spending over a decade in the ministry world, she now writes and creates full time. You can find her work on Scary Mommy, The Mighty, The Huffington Post, The Natural Parent, Parent Co, Her View From Home, and Columbia Mom. \n\n\nConnect With Us\n\n  •  You can connect with Kimberly on social media on both Facebook (https://www.facebook.com/theexvangelicalparent)  \u0026 Instagram (https://www.instagram.com/theexvangelicalparent/) \n  •  You can find out more about The Exvangelical Parent (https://theexvangelicalparent.com)  via their website. \n\n\n\n\n\n  •  To connect with Sam on Instagram - @anchoredcounsellingservices (https://www.instagram.com/anchoredcounsellingservices/) \n  •  Want to contact with Sam about the podcast or therapy? Use this contact form. (https://anchoredcounsellingservices.com.au/contact/)",
      "release": "2024-10-09T19:19:16Z",
      "duration": "01:00:21",
      "explicit": false,
      "spotifyId": "3aah0p1vAoRP4m3dST7cr6",
      "appleId": 1000672405818,
      "youTubeId": "FeCoTrQ44fU",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3aah0p1vAoRP4m3dST7cr6",
        "apple": "https://podcasts.apple.com/podcast/the-exvangelical-parent/id1724257434?i=1000672405818",
        "youtube": "https://www.youtube.com/watch?v=FeCoTrQ44fU"
      }
    },
    {
      "id": "3657844b-3a1b-49f8-9d3e-5c4098878c9e",
      "title": "Purity Culture 101 with Meg Cowan",
      "description": "Join us for a powerful bonus episode of Beyond the Surface, where we unpack the complexities of purity culture in evangelical Christianity with returning guest Meg, a sexologist and relationship coach from New Zealand. Together, we trace the historical roots of purity culture and its impact on modern sexual education and relationships, highlighting how it induces shame around sexual behaviours and affects intimacy in both heterosexual and LGBTQIA\u0026#43; dynamics. Meg shares personal and professional insights, offering a fresh perspective on deconstructing these harmful ideologies to foster healthier relationships and personal well-being. Who Is Meg? Meg is a Sex and Relationship Coach specialising in helping people recovering from the shame-based religious teachings of purity culture and the deconstruction of their faith. She has trained in Clinical Sexology, Trauma Informed Care, is a Certified Advanced Sex and Relationship Coach and Integrated Intimacy Practitioner. She supports people to explore personal agency and intimate connection. Meg is also a Protect Accredited Trainer (New Zealand’s leading protection and self-defense agency). For more than 14 years she’s worked with clients to help them identify the behavioural and psychological signs of abuse and practical strategies for staying safe. In all these areas her work focuses on the mind-body connections that help people recover from trauma and find freedom in their bodies. As the creator of the couples guide to Hotter Sex in 10 days , and The Shame-free Sex Course she delivers empowering practical skills to people all around the world on these subjects. Connect With Us You can reach Meg to explore sex and relationships post purity culture on her website You can also connect over on Instagram – @megccowan You can connect with Sam over on Instagram – @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-10-06T19:00:00Z",
      "duration": "00:59:41.4920000",
      "explicit": true,
      "spotifyId": "6Bk6iqDUgLxW2GpDCFYaHR",
      "appleId": 1000671977143,
      "youTubeId": "ra7uq9_VUBY",
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Bk6iqDUgLxW2GpDCFYaHR",
        "apple": "https://podcasts.apple.com/podcast/purity-culture-101-with-meg-cowan/id1724257434?i=1000671977143",
        "youtube": "https://www.youtube.com/watch?v=ra7uq9_VUBY"
      }
    },
    {
      "id": "a0655f61-4988-40c1-a167-223412fab904",
      "title": "The Former \u0027Good Christian Girl\u0027",
      "description": "Can balancing faith with personal freedom bring true inner peace? In this episode, we sit down with Elise as she shares her raw journey of growing up in a Pentecostal family, where she struggled to balance genuine friendships with heavy religious expectations. Elise opens up about the emotional toll of marriage, depression, and Bible college, highlighting the idolization of overwork in Pentecostal churches and its impact on her well-being. As she deconstructs her faith, Elise reflects on how therapy and self-reflection helped her redefine her beliefs and find safe, authentic spiritual spaces.\n\n\nMore About Elise\n\n\nElise is a Trauma-Informed Counsellor and Coach based in Melbourne, Australia, who is passionate about supporting individuals recovering from Religious Trauma. For decades, she denied her own humanity, constantly pushing herself beyond her physical, emotional, and spiritual limits, unable to say \u0027no\u0027 or slow down due to a deep fear of not being enough. Depression, anxiety, chronic low self-esteem, and perfectionism were her constant companions, while religion, a significant part of her life, only seemed to fuel her self-loathing. She internalised beliefs of being inherently sinful and unworthy of love, living in fear of eternal punishment if she fell outside of God\u0027s grace. This relentless need to prove her worth to God, the church, and herself eventually pushed her to the brink.\n\n\nGradually, Elise learned to embrace her doubts, questions, pain, and anger, as well as the joy, freedom, curiosity, and self-acceptance that came with letting go. Now, she is deeply passionate about walking alongside others as they reconnect with their own humanity, which is always deserving of love, care, and gentle compassion.\n\n\n\n\n\n\nConnect With Us\n\n  •  You can find out more about Elise via her website - https://www.eliseheerde.com \n  •  Or you can connect over on Instagram (https://www.instagram.com/eliseheerde/)  or Facebook  (https://www.facebook.com/search/top/?q=elise%20heerde%20-%20counsellor%20coach\u0026__epa__=SEARCH_BOX\u0026__eps__=comet.home\u0026__hcr__=eyJpZCI6IjEwMDA3NjU4Mjk4NjAzMCIsInNvdXJjZSI6IlRZUEVBSEVBRF9VU0VSX01BUktFUiJ9) \n\n\n\n\n\n  •  To connect with Sam on Instagram - @anchoredcounsellingservices (https://www.instagram.com/anchoredcounsellingservices/) \n  •  Want to contact with Sam about the podcast or therapy? Use this contact form. (https://anchoredcounsellingservices.com.au/contact/)",
      "release": "2024-10-02T20:16:36Z",
      "duration": "01:11:08",
      "explicit": false,
      "spotifyId": "4Mcxm7pSijq9Xvp6NaATpR",
      "appleId": 1000671591758,
      "youTubeId": "9puRqBdxUng",
      "subjects": [
        "Evangelicalism",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Mcxm7pSijq9Xvp6NaATpR",
        "apple": "https://podcasts.apple.com/podcast/the-former-good-christian-girl/id1724257434?i=1000671591758",
        "youtube": "https://www.youtube.com/watch?v=9puRqBdxUng"
      }
    },
    {
      "id": "038c29d2-05dc-4102-b7f9-ee8f9d7cf37f",
      "title": "The One Who Reclaimed Her Body Post Purity Culture",
      "description": "In this episode of \u0022Beyond the Surface,\u0022 we explore Meg\u0027s powerful journey of faith deconstruction, beginning with her upbringing in a Christian family in New Zealand and involvement in a conservative Pentecostal church. Meg shares her experiences with purity culture, the internal conflicts of being a devout Christian while navigating typical teenage behaviours, and the impact on her relationship with God and sense of self. We also discuss the tension between church leadership, personal well-being, and family life, and the healing that came from stepping back from church roles to focus on health and personal growth. More About Meg Meg is a Sex and Relationship Coach specialising in helping people recovering from the shame-based religious teachings of purity culture and the deconstruction of their faith. She has trained in Clinical Sexology, Trauma Informed Care, is a Certified Advanced Sex and Relationship Coach and Integrated Intimacy Practitioner. She supports people to explore personal agency and intimate connection. Meg is also a Protect Accredited Trainer (New Zealands leading protection and self defense agency). For more than 14 years she\u0027s worked with clients to help them identify the behavioural and psychological signs of abuse and practical strategies for staying safe. In all these areas her work focuses on the mind-body connections that help people recover from trauma and find freedom in their bodies. As the creator of the couples guide to Hotter Sex in 10 days, and The Shame-free Sex Course she delivers empowering practical skills to people all around the world on these subjects. Connect With Us You can reach Meg on her website - https://megcowan.com You can also connect over on Instagram - @megccowan You can connect with Sam over on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-09-25T20:00:00Z",
      "duration": "00:51:34.0470000",
      "explicit": true,
      "spotifyId": "3XhjlgKS94Kd0TEn2bAxdP",
      "appleId": 1000670704690,
      "youTubeId": "KCXQqcQoOaA",
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XhjlgKS94Kd0TEn2bAxdP",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-reclaimed-her-body-post-purity-culture/id1724257434?i=1000670704690",
        "youtube": "https://www.youtube.com/watch?v=KCXQqcQoOaA"
      }
    },
    {
      "id": "287bc003-793a-4978-a04d-55b331494de1",
      "title": "The One Who Found Life After Religion",
      "description": "Claire\u0027s faith journey, from strict Catholic rituals to the allure of evangelicalism, highlights the clash between public and private religious life, leading to relational trauma and disillusionment with church marketing tactics. Her story reveals the business-like nature of church operations and the mental health struggles that arise from pressure to conform. After leaving her church during the COVID-19 pandemic, Claire found space for reflection and healing, sharing her story to offer hope to others navigating spiritual deconstruction. More About Claire Claire is a 32, former Catholic and evangelical. She grew up attending Catholic school but later moved away and found non-denominational churches, which initially seemed more \u0022open.\u0022 Over time, she realised they weren\u0027t. She married a youth pastor, and together they recognised the toxicity of their religious environment and decided to leave. In recent years, she\u0027s been working through the indoctrination from her childhood and early 20s. Connect With Us You can find Claire over on Instagram \u0026 TikTok To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-09-18T20:00:00Z",
      "duration": "01:07:42.9810000",
      "explicit": true,
      "spotifyId": "40SqpqWPBoOxiqOe9aPIUd",
      "appleId": 1000669976516,
      "youTubeId": "BZY5oYPHhxY",
      "subjects": [
        "Catholicism",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/40SqpqWPBoOxiqOe9aPIUd",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-found-life-after-religion/id1724257434?i=1000669976516",
        "youtube": "https://www.youtube.com/watch?v=BZY5oYPHhxY"
      }
    },
    {
      "id": "723e80b2-a707-4631-964f-f5518bf2ea0d",
      "title": "The Religious Trauma Expert",
      "description": "What happens when the foundations of your faith start to crumble? Our latest episode of \u0022Beyond the Surface\u0022 tackles the intricate and emotional journey of religious trauma and faith deconstruction with our insightful guest, Dr Laura Anderson. Growing up in a fundamentalist Christian environment, Dr Laura opens up about the challenges she faced, from grappling with purity culture to her first existential crisis after high school. Through her story, we explore the impact of stringent religious doctrines on personal beliefs and life choices, shedding light on the difficult path of questioning long-held convictions. We celebrate the powerful evolution of embracing spiritual uncertainty and growth. Dr Laura discusses moving away from rigid religious labels, reclaiming personal goodness, and finding joy in new identities and communities. More About Dr Laura Dr. Laura Anderson (PhD, Saybrook University; LMFT) is a therapist, trauma resolution and recovery coach, writer, educator, and creator who specialises in complex trauma with a focus on domestic violence, sexualised violence and religious trauma. Laura has a private practice in Nashville, TN and is the founder and director of the Center for Trauma Resolution and Recovery, an online coaching company where she and the other practitioners work with clients who have experienced high demand/high control religions, adverse religious experiences, cults, and religious trauma. In 2019, Laura co-founded the Religious Trauma Institute with the goal of providing trauma-informed resources, consultation, and training to clinicians and other helping professionals who work with religious trauma survivors. Laura’s first book, “When Religion Hurts You: Healing From Religious Trauma and the Impact of High Control Religion”, was released by Brazos press in October 2023. She lives with her dog, Phoebe, in Nashville, Tennessee. Connect With Us Find out more about Dr Laura over on her website - https://drlauraeanderson.com/ You can also connect over on Instagram - @drlauraeanderson To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-09-04T20:00:00Z",
      "duration": "01:03:16.9760000",
      "explicit": true,
      "spotifyId": "4piQsqyGvtei52UqEpFO7n",
      "appleId": 1000668386687,
      "youTubeId": "4DMqZsWErmc",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4piQsqyGvtei52UqEpFO7n",
        "apple": "https://podcasts.apple.com/podcast/the-religious-trauma-expert/id1724257434?i=1000668386687",
        "youtube": "https://www.youtube.com/watch?v=4DMqZsWErmc"
      }
    },
    {
      "id": "c319ba83-2559-4bb6-bd67-7e7df281524a",
      "title": "The One Who Escaped Catholic Institutional Abuse",
      "description": "What happens when devotion turns into oppression? Join us for a gripping episode of Beyond the Surface as we sit down with Ruth from snowy Connecticut, who bravely recounts her harrowing experiences growing up in a militant Catholic institution. Separated from her parents and subjected to the institution\u0027s extreme religious and political ideologies, Ruth\u0027s story is a powerful testament to the devastating effects of institutionalised abuse and religious indoctrination. Through her vivid recounting of physical, emotional, and psychological torment, we gain a deeper understanding of the traumatic impact of growing up in such a cult-like environment. Who Is Ruth? Ruth Reymundo Mandel has been in training and implementation since 1995. Her career began as a middle school teacher in post revolutionary Nicaragua. As a teacher in a developing, post war country she became dedicated to issues surrounding social justice and violence. She later transitioned to higher education and worked at the Bryman School and at The Art Institute of Phoenix as an Assistant Director of Admissions. Her responsibilities included vetting prospective students and identifying barriers to enrolment and to matriculation. After taking a break to raise her three children, she began working as a trainer and technical support for a national professional line nutritional company and an international professional line herbal company which trained medical professionals in alternative therapies. In her role she trained doctors and medical professionals in clinical application and was an ongoing support for successful implementation through patient outcomes. She developed systems for practice management, patient support, managed, created and promoted cyclical education events for clinical success. She developed training strategies to respond to a variety of real time field challenges. Ruth also worked as a professional business coach specialising in systems and practice management. Her dedication to understanding root challenges, institutional, structural and personal impediments which keep people from applying their skills and knowledge in a targeted and successful way helped many of her clients increase their business success. Aside from her professional accomplishments Ruth is a published poet, an artist, writer and a public speaker. Drawing on her childhood experiences growing up in an abusive, religious institution and as a survivor she is a fierce advocate for those who have experienced institutional abuse. She is dedicated to helping survivors and allies understand their behavioral coping mechanisms, arising out of trauma and mitigating societal and personal judgments surrounding common human responses to violence. Connect with Us To find out more about Ruth\u0027s work - https://safeandtogetherinstitute.com/ Connect over on Instagram or LinkedIn To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form",
      "release": "2024-08-28T20:00:00Z",
      "duration": "00:52:52.8060000",
      "explicit": true,
      "spotifyId": "50pLGRV8YUSLEzVsLTe5DS",
      "appleId": 1000666943619,
      "youTubeId": "ygBALqpKE_A",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/50pLGRV8YUSLEzVsLTe5DS",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-escaped-catholic-institutional-abuse/id1724257434?i=1000666943619",
        "youtube": "https://www.youtube.com/watch?v=ygBALqpKE_A"
      }
    },
    {
      "id": "a27e803d-997c-4b44-aaf7-ee9d25ce33f0",
      "title": "Religious Trauma \u0026 The Body with Liz Milani \u0026 Erica Webb",
      "description": "Join us for a profound exploration of healing religious trauma through the body, featuring insightful conversations with Liz Milani and Erica Webb. Liz, a former pastor and pastor\u0027s kid, shares her journey of navigating an involuntary deconstruction of faith, leading her to create a supportive community for others on similar paths. Erica, a somatic exercise coach and counsellor, brings her expertise on how purity culture and teachings of bodily mistrust contribute to a disconnection from the body\u0027s inherent wisdom. Together, we discuss the long-term impacts of religious trauma and the importance of reconnecting with and processing trauma through bodily awareness and mindful movement. Who Are Liz \u0026 Erica? Liz Milani is a writer, and the co-creator of the The Practice Co App. She lives for wholehearted, grounded spirituality, and to help people feel free to find God for themselves, in the world, in the lives they have. Liz lives on the Central Coast of NSW, Australia, with her partner, Jesse, and their three kids. Erica Webb is a registered counsellor, somatic exercise coach and highly sensitive person. She supports other highly sensitive women to discover their sensitivity superpowers and more confidently navigate the tricky bits of being a sensitive person in an often insensitive world. Erica combines her training in Behavioural Science, Counselling, and various mindful movement modalities, along with her understanding of the nervous system’s role in trauma, pain and high sensitivity. She focuses on Self-Compassion, Kindness and Curiosity as key components to foster resilience as a sensitive human navigating the world. Erica works with clients 1-1 and in her online membership space, the SelfKind Hub. She is also host of the podcast SelfKind with Erica Webb and cohost of the podcast Midlife Unfiltered: The Season of Me. Connect With Us To learn more about Liz or The Practice Co head to their website . You can follow along over on Instagram - @thepracticeco You can download The Practice Co on Apple or Android You can learn more about Erica on her website Connect with Erica on both Facebook \u0026 Instagram You can also listen to Erica\u0027s Podcasts SelfKind \u0026 Midlife Unfiltered: The Season of Me To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form.",
      "release": "2024-08-18T20:00:00Z",
      "duration": "01:15:47.4220000",
      "explicit": true,
      "spotifyId": "5Z2KQcRMaNmNDQhCuzOsFg",
      "appleId": 1000665805466,
      "youTubeId": "hzSm9U-tpEA",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Z2KQcRMaNmNDQhCuzOsFg",
        "apple": "https://podcasts.apple.com/podcast/religious-trauma-the-body-with-liz-milani-erica-webb/id1724257434?i=1000665805466",
        "youtube": "https://www.youtube.com/watch?v=hzSm9U-tpEA"
      }
    },
    {
      "id": "23087f3f-ceef-4d09-a270-48b318f9b818",
      "title": "The Domestic Violence Survivor",
      "description": "Charli shares her experiences growing up in a devout Christian home, the challenges of seeking validation, and the complexities of moving beyond ingrained beliefs. After leaving an abusive marriage and facing family estrangement, she found solace in raising her children with autonomy and openness. Discover how she rebuilt her intuition, set firm boundaries, and redefined her faith, creating a nurturing space for the next generation. We also explore the power of community and inner strength in overcoming trauma and isolation, highlighting the significance of gut instincts, nature, and holistic practices in healing. This episode is filled with resilience, self-discovery, and encouragement for those deconstructing their faith. Who Is Charli? Charli is an Emotional Strength \u0026 Trauma Coach, and loves having courageous conversations around all thing’s trauma and traumatic impact. With a history of her own personal trauma stemming from religion, spiritual abuse, narcissistic abuse, and coercive control, she now lives a life of freedom and autonomy while she raises her 2 beautiful young teens and supports others who are ready to find freedom and healing in their own journeys. Connect With Us You can find more about Charli over on her website . You can also connect on Facebook , Instagram \u0026 LinkedIn . To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form .",
      "release": "2024-08-14T20:00:00Z",
      "duration": "00:52:33.5020000",
      "explicit": true,
      "spotifyId": "2nTwc9G2jXnRnaSLlgGB0z",
      "appleId": 1000665347302,
      "youTubeId": "UppJpJeB23A",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2nTwc9G2jXnRnaSLlgGB0z",
        "apple": "https://podcasts.apple.com/podcast/the-domestic-violence-survivor/id1724257434?i=1000665347302",
        "youtube": "https://www.youtube.com/watch?v=UppJpJeB23A"
      }
    },
    {
      "id": "8d8959a8-df5c-405f-a716-4c24097bb684",
      "title": "The One Who Survived An Unnamed Cult",
      "description": "In this episode, Laura shares her experience of being born into the fundamentalist group/cult known as The Truth, discussing the isolation, coercive control, and spiritual abuse she endured. We explore the unique challenges faced by women in these communities and Laura\u0027s struggle with identity. Laura reflects on her childhood values, teenage years without typical rites of passage, and the pain of leaving her family and community. She talks about her reintegration, dealing with C-PTSD, and finding her own beliefs. Laura also offers advice to those beginning their deconstruction journey. Who is Laura? With over 17 years of experience in accounting and finance, Laura founded the social enterprise and BCorp #GoKindly in 2018. An adventure motorbike rider and open water swimmer, Laura brings a dynamic perspective to her work. Raised in the 5th \u0026 3rd Generation inside The Truth/2x2s, a high-control, coercive fundamentalist cult, Laura has a unique understanding of religious control. A fierce feminist with an intersectional approach to life, Laura sits on the board of several grassroots, women-led social services organisations. Holding a BA in Chinese Language \u0026 Women’s Studies and a BCom in Accounting \u0026 Finance, Laura is also a CA, CPA, and AAICD. With over 20 years of experience supporting women and young people leaving high-control religious groups, Laura has a deep interest in coercive control within religious contexts, drawing from over 30 years of observation. Laura writes blogs, provides commentary and context on religious and spiritual abuse conversations, and consults with family violence providers to support individuals leaving high-control religions. Connect with Us You can find out more about Laura over on her website . To connect with Laura on social media, head to Instagram - @lauramc.au To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form .",
      "release": "2024-08-07T20:00:00Z",
      "duration": "00:59:29.6060000",
      "explicit": true,
      "spotifyId": "6sXD3dNaJpgDpumiGZeMkI",
      "appleId": 1000664645414,
      "youTubeId": "mdSxK4VY990",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6sXD3dNaJpgDpumiGZeMkI",
        "apple": "https://podcasts.apple.com/podcast/the-one-who-survived-an-unnamed-cult/id1724257434?i=1000664645414",
        "youtube": "https://www.youtube.com/watch?v=mdSxK4VY990"
      }
    },
    {
      "id": "3c33fe1b-5c4b-428a-828a-5df931b9626e",
      "title": "The Multi-Cult Survivor",
      "description": "This is Nikki\u0027s Story... Who Is Nikki? Nikki G. is a Certified Trauma Recovery Coach who helps survivors recover and thrive after Religious Trauma \u0026 Cult involvement. She is also a survivor of multiple narcissistic relationships, religious trauma as well as a former member of multiple cultic communities. Nikki is the CEO of Nikki G Speaks LLC, which exists to support survivors with individual coaching services, an online community, and other various forms of psycho-education related to religious trauma, narcissistic abuse, and cult involvement. She educates and empowers survivors to reclaim their lives and embrace the journey to “come back home” to self. Connect with us. Nikki’s website – https://www.nikkigspeaks.com/ You can connect with Nikki over on Facebook , Instagram and Twitter To connect with Sam on Instagram - @anchoredcounsellingservices Want to contact with Sam about the podcast or therapy? Use this contact form .",
      "release": "2024-05-22T20:00:00Z",
      "duration": "01:08:39.4310000",
      "explicit": true,
      "spotifyId": "2fok3YQkeR0QSL3qAypy4F",
      "appleId": 1000656433730,
      "youTubeId": "6uitrEpWV8E",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2fok3YQkeR0QSL3qAypy4F",
        "apple": "https://podcasts.apple.com/podcast/the-multi-cult-survivor/id1724257434?i=1000656433730",
        "youtube": "https://www.youtube.com/watch?v=6uitrEpWV8E"
      }
    }
  ]
}