{
  "_ts": 0,
  "id": "a3099964-653d-4142-99f5-93f946d26780",
  "name": "Beyond the Monsters",
  "spotifyId": "3gmVkvzX4xNWwsWFamRUai",
  "appleId": 1778966880,
  "youTubeChannelId": "UCRjzxbl-22ddIBe2V3CT5Tg",
  "episodes": [
    {
      "id": "43710140-b588-4c81-879c-d4b0d3c12ad0",
      "title": "Growing Up in The Order of The Lamb Cult",
      "description": "Roanna shares her harrowing journey of growing up in a deeply dysfunctional family within the cult-like religious group known as the Order of the Lamb. She opens up about the trauma she endured as a child—severe punishment, emotional control, and fear-based obedience—and how it shaped her mental health and sense of self.\n\n\n\nHer story weaves through early play therapy with dolls, the isolating experience of being raised in a predominantly Mormon community, and the internal conflict between genuine spirituality and the oppressive structure of organized religion.\n\n\n\nAs she began to heal, repressed memories resurfaced, leading her to confront PTSD, complex triggers, and the legacy of abuse she was determined not to pass on to her own children. Roanna credits her therapist and osteopath with helping her navigate the most difficult parts of her healing.\n\n\n\nShe speaks powerfully about the importance of emotional awareness, the role of shame, and the courage it takes to face the truth. Through grief, growth, and education, Roanna is not only breaking generational cycles—she’s building a life rooted in truth, freedom, and purpose.\n\n\n\n \n\n\n\nRoanna’s socials\n\n\n\nhttps://www.instagram.com/thegfculinaryschool/\n\n\n\nhttps://www.instagram.com/roannacanete/\n\n\n\nhttps://thegfculinaryschool.com/\n\n\n\n \n\n\n\nBeyond the Monsters Socials\n\n\n\nhttps://www.instagram.com/beyondthemonsters/\n\n\n\nhttps://linktr.ee/BeyondtheMonsters\n\n\n\n \n\n\n\n*Disclaimer: The content shared on this podcast is for informational and entertainment purposes only. The discussions and experiences shared are based on our personal stories and opinions. This is not medical advice, and it should not be used as a substitute for professional medical guidance. Always consult with a qualified healthcare provider for any concerns or questions regarding your health.",
      "release": "2025-04-21T19:44:28Z",
      "duration": "02:08:44",
      "explicit": false,
      "spotifyId": "1MsRGlW6dFlQEa0i89Nq2h",
      "appleId": 1000704347322,
      "youTubeId": "agZqNuvbroo",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MsRGlW6dFlQEa0i89Nq2h",
        "apple": "https://podcasts.apple.com/podcast/growing-up-in-the-order-of-the-lamb-cult/id1778966880?i=1000704347322",
        "youtube": "https://www.youtube.com/watch?v=agZqNuvbroo"
      }
    },
    {
      "id": "f7f3f8eb-9259-4b6c-ab6c-65ba335ed127",
      "title": "From Religious Cult to Dominatrix",
      "description": "Raven shares her powerful journey of self-discovery, resilience, and healing. Growing up within the strict Jehovah’s Witness religion, she faced trauma, identity suppression, and addiction, struggling to reconcile her true self with the confines of her upbringing. She courageously speaks about the deep scars left by multiple instances of sexual assault and the lasting impact of those experiences on her mental health. Throughout her story, she reflects on navigating family dynamics, sobriety, and the profound role of plant medicine in her recovery. She emphasizes the importance of creating safe spaces for consent, exploration, and self-discovery, especially within marginalized communities. Raven also highlights her advocacy for the military, particularly the Marines, while shedding light on her experiences with complex romantic partnerships. In addition, Raven delves into her empowerment through the world of BDSM, emphasizing the significance of safety, trauma healing, and living authentically. She introduces her alter ego, Raven Roulette, who symbolizes her journey of reclaiming power and self-expression. She also shares her harrowing experience with an abusive partner who exploited her involvement in the BDSM world to manipulate and harm her. Through writing and her upcoming book, Raven hopes to inspire others to confront their trauma, embrace mental health awareness, and find their voice. Her advocacy aims to provide resources for healing and create a supportive community where others can share their stories. Raven’s Socials https://www.instagram.com/theravenroulette https://www.instagram.com/drippinginhope Raven’s book - Releasing this Spring Dark Erotic Poetry Called \u0022I Should Have Murdered You When I Had A Chance.\u0022 Raising mental health awareness for Sex Workers \u0026 United States Armed Forces. Suicide and Crisis Lifeline 988 National Sexual Assault Hotline RAINN 800-656-4673 Sexual Assault Crisis Text Line 741741 https://www.crisistextline.org SAMHSA’s National Helpline (mental health and/or substance use) 1-800-662-HELP (4357) Beyond the Monsters Socials https://www.instagram.com/beyondthemonsters https://linktr.ee/BeyondtheMonsters *Disclaimer: The content shared on this podcast is for informational and entertainment purposes only. The discussions and experiences shared are based on our personal stories and opinions. This is not medical advice, and it should not be used as a substitute for professional medical guidance. Always consult with a qualified healthcare provider for any concerns or questions regarding your health.",
      "release": "2025-02-11T00:06:59Z",
      "duration": "01:28:18.9830000",
      "explicit": true,
      "spotifyId": "4txvrVrfMFQT2oAXiq6I5e",
      "appleId": 1000690961625,
      "youTubeId": "KX8tir5t5N8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4txvrVrfMFQT2oAXiq6I5e",
        "apple": "https://podcasts.apple.com/podcast/from-religious-cult-to-dominatrix/id1778966880?i=1000690961625",
        "youtube": "https://www.youtube.com/watch?v=KX8tir5t5N8"
      }
    }
  ]
}