{
  "id": "152fa217-5c71-47bb-b427-4692f6a1519e",
  "name": "Beyond The Balance Sheet",
  "youTubeChannelId": "UCdisitQidd4UVS0gxK-pj2w",
  "episodes": [
    {
      "id": "6ed126ba-c948-481f-806a-55043453fc97",
      "title": "Recovery from Cults With Joe Szimhart",
      "description": "Joe Szimhart has worked with more than a thousand people to help them leave cults. Through his experience being in and leaving a cult, he has focused on interventions to free others. During today’s episode, Joe helps us understand why someone might join a cult, how money impacts them, and what happens when one decides to leave a cult. He also touches on the physiological aspects of what people must deal with when leaving and what some unsuccessful interventions have looked like. Tune in today to learn more about his work and signs of someone\u0027s unhealthy relationship with a group. \n \nIN THIS EPISODE\n[1:15] What is a cult?\n[3:12] Joe shares an example of a case he has been involved in.\n[7:31] What happens when someone decides to leave a cult? \n[9:40] What draws people into cults? \n[13:33] How does money attract people or maintain a connection to the systems? \n[18:54] How long was Joe participating in a cult himself?  \n[22:55] Joe talks about the people he has helped in various ways.\n[24:46] What hasJoe learned from times he wasn’t successful in helping someone leave a cult?\n\nKEY TAKEAWAYS\n \nPeople invest so much of themselves into a cult that it can cause big physiological traps for individuals when they want to leave. \nNot all cults are the same in terms of money. For some, money is hidden away, and members are sought for their financial wealth. Other cults don’t require members to have money and it’s not a factor in getting or staying involved.\nTo leave a cult, an intervention must show the person that they can reinstitute a sense of choice and show them the potential of carrying on their life outside of the cult they are involved with. \n\nRESOURCES:\nBeyond the Balance Sheet Website - https://oconnorpg.com/\nJoseph Szimhart’s Website - https://www.jszimhart.com/\n\nBooks:\nBrain Washing: The Science of Thought Control \nHow to Think about Weird Things\n\nBIO:\nJoseph Szimhart has been a Cult Intervention Specialist and media consultant about cults since the early 1980s when he began helping families and individuals impacted by harmful cult behavior. He has a degree in Arts and Sciences from the University of Dayton in Ohio and a Certificate in Painting from the Pennsylvania Academy of Fine Arts. He is currently employed as a crisis caseworker at a psychiatric emergency hospital in Pennsylvania. His cult experience with several Theosophy-based cults from 1978 to 1980 drew him into cultic studies. He has presented papers many times at conferences, including with the Association of Sociology of Religion and the International Cultic Studies Association. As a media consultant, he provided the story for A Mother’s Deception starring Joan Van Ark (1994), and his intervention work was the subject of the feature article “New Age Exorcist” in DETAILs Magazine (Sept. 1991). The International Cultic Studies Association presented him with a Lifetime Achievement Award in 2016. He maintains an art studio at his home in Stowe, PA. His first novel Mushroom Satori: The Cult Diary, was published through Aperture Press in 2013. His memoir, “Santa Fe, Bill Tate, and me: How an artist became a cult interventionist,” was released in 2020.",
      "release": "2022-12-07T11:45:00Z",
      "duration": "00:30:37",
      "explicit": false,
      "youTubeId": "AqNc4kpWa-Y",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AqNc4kpWa-Y"
      }
    }
  ]
}