{
  "_ts": 0,
  "id": "49057bbd-8ff2-4b7f-a9c8-c6e607d93870",
  "name": "Beyond The Horizon",
  "spotifyId": "4iEqZ6ID2Wgl3foobQMlNN",
  "appleId": 1583981598,
  "episodes": [
    {
      "id": "68f9e243-da9a-4b14-8942-9e18340d1bdb",
      "title": "The Mega Edition:  The Epstein/Diddy Similarities And Diddy\u0027s New Home (11/29/24)",
      "description": "The cases of Jeffrey Epstein, R. Kelly, and Sean \u0022Diddy\u0022 Combs, while involving different individuals, share several thematic similarities that center around allegations of sexual misconduct, abuse of power, and exploitation. Below is a comparison based on these common factors:1. Allegations of Sexual Abuse and Misconduct\nJeffrey Epstein: Epstein was charged with running a sex trafficking ring that exploited underage girls, some as young as 14. He used his wealth and influence to recruit vulnerable minors for sexual exploitation over many years.R. Kelly: The R\u0026B singer was convicted of racketeering and sex trafficking, including charges of sexually abusing minors. He operated a scheme where young women and underage girls were lured into abusive situations, often under false pretenses of career opportunities.Sean \u0022Diddy\u0022 Combs: Combs is facing a lawsuit accusing him of sexual assault, battery, and abuse over an extended period. The case includes claims that he exploited his influence and power in the entertainment industry to manipulate and control women, though his case lacks the widespread scope of trafficking networks seen in Epstein and R. Kelly\u0027s cases.2. Exploitation of Power and Influence\nEpstein: A financier with connections to high-profile political and business elites, Epstein used his wealth, private islands, and powerful network to hide and perpetuate his crimes for years. His connections gave him a shield from scrutiny until his arrest and subsequent death in 2019.R. Kelly: Kelly leveraged his fame and success in the music industry to recruit victims, often promising to mentor them or help their careers. He maintained control over these women through psychological, emotional, and sometimes physical abuse.Combs: As a music mogul and media figure, Combs had considerable influence in the industry, which his accusers claim he used to exploit and manipulate victims. His power dynamic is similar to Kelly’s in terms of being a gatekeeper for opportunities in entertainment, making it harder for accusers to speak out without fearing career consequences.3. Systematic Abuse and Control\nEpstein: The Epstein case revealed a systematic approach to exploiting young girls, involving an intricate network of recruiters, enablers, and blackmail material used to silence victims. His case exposed a broad system of grooming, blackmail, and exploitation.R. Kelly: Kelly was accused of running an organized, cult-like system where he isolated women, controlled every aspect of their lives, and manipulated them through threats and abuse. His use of enablers to maintain control over his victims parallels Epstein\u0027s methods.Combs: While the extent of systematic abuse in Combs\u0027 case is still unfolding, the accusations point to a long-term pattern of controlling behavior, manipulation, and sexual misconduct.4. Public Perception and Legal Outcomes\nEpstein: Epstein\u0027s case sparked global outrage, especially after his death in jail under suspicious circumstances, which many believe was tied to the influential figures he associated with. His death left many questions unanswered and led to ongoing legal actions against his associates.R. Kelly: Kelly was convicted and sentenced to 30 years in prison after decades of allegations. His case was marked by long-standing public scrutiny, especially after the \u0022Surviving R. Kelly\u0022 documentary brought renewed attention to his abuses.Combs: The legal proceedings against Combs are more recent, and his case is still developing. While he denies the allegations, the case has ignited discussions around abuse in the music industry similar to what followed Kelly\u0027s trial.5. Cultural Impact and Public Discourse\nAll three cases highlight the abuse of power by wealthy and influential men in positions of authority. Epstein and R. Kelly’s cases...",
      "release": "2024-11-29T10:30:07Z",
      "duration": "00:28:50",
      "explicit": false,
      "spotifyId": "2peJcbjHTEnpbNyFPnOAs9",
      "appleId": 1000678622931,
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2peJcbjHTEnpbNyFPnOAs9",
        "apple": "https://podcasts.apple.com/podcast/the-mega-edition-the-epstein-diddy-similarities/id1583981598?i=1000678622931"
      }
    },
    {
      "id": "3d5304bf-1e17-4abd-84f2-5f2864d7338b",
      "title": "ICYMI:  The Centrepoint Scandal",
      "description": "The Centrepoint Community was a controversial commune in New Zealand that operated from 1977 to 2000. It was founded by Bert Potter and his wife, Mary, and was based on principles of communal living, personal growth, and spiritual exploration. However, over the years, the community became mired in controversy due to allegations of sexual abuse, drug use, and other forms of misconduct.In 1991,\n\nBert Potter was convicted of indecent assault and sentenced to two and a half years in prison for sexually abusing children within the community. After his release, he continued to be associated with the community, which eventually led to its downfall.In 2000, the Centrepoint Community was raided by police, and a number of people associated with the community were arrested and charged with various offenses, including sexual abuse, drug offenses, and firearms offenses. The community was shut down, and many of its former members have spoken out about the abuse and trauma they experienced while living there.The Centrepoint Community scandal remains a dark chapter in New Zealand\u0027s history, and it has had a profound impact on those who were affected by it.\n\n\nIn this episode, we hear from one of the women who was abused while living in the commune as a child and how that abuse was pervasive.\n\n\n(commercial at 8:27)\n\nto contact me:\n\nbobbycapucci@protonmail.com\n\n\nsource:\n\nInside sickening \u0027orgasm cult\u0027 where kids as young as 10 were forced into vile sex games and fed LSD by warped leader | The US Sun (the-sun.com)",
      "release": "2024-09-04T01:30:01Z",
      "duration": "00:13:57",
      "explicit": false,
      "spotifyId": "3GcWfvkAvGE24i5RfqO7Ve",
      "appleId": 1000668243795,
      "subjects": [
        "Centrepoint"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3GcWfvkAvGE24i5RfqO7Ve",
        "apple": "https://podcasts.apple.com/podcast/icymi-the-centrepoint-scandal/id1583981598?i=1000668243795"
      }
    },
    {
      "id": "b259fe29-358a-4e3f-b39c-b688368569f2",
      "title": "ICYMI:  Juror # 18 From The Lori Vallow Trial And The Book He Wrote About His Experience",
      "description": "Lori Vallow gained significant media attention due to her involvement in a complex and tragic case involving the disappearance of her two children, Tylee Ryan and Joshua \u0022JJ\u0022 Vallow. Lori Vallow was married multiple times and had a history of unusual beliefs, including her involvement with a religious group known as Preparing a People. The case unfolded in late 2019 when concerned family members reported Tylee and JJ missing. Lori and her fifth husband, Chad Daybell, became the focus of the investigation after they were found to have misled authorities and exhibited suspicious behavior. The situation escalated when investigators discovered the bodies of Tylee and JJ buried on Chad Daybell\u0027s property in Idaho in June 2020. Lori Vallow was subsequently arrested and faced multiple charges, including conspiracy to commit murder and various counts of desertion and nonsupport of dependent children. Her husband, Chad Daybell, also faced charges related to the concealment of evidence and the children\u0027s deaths. The case drew widespread attention due to its intricate details, including allegations of cult-like beliefs, doomsday prophecies, and suspicious deaths of individuals associated with Lori and Chad, namely Lori\u0027s children. Throughout the legal proceedings, Lori Vallow\u0027s defense maintained her innocence, claiming mental health issues and coercion from Chad Daybell. However, as the investigation progressed, evidence mounted against both of them, leading to their eventual indictments and court appearances. After a blisterning presentation by the prosecution in Idaho, and a weak wristed attempt at a defense by Vallow, she was found guilty. In this episode, we hear from Juror # 18 who discusses what he went through while sitting on the jury and his plans to write a book after the conclusion of the Chad Daybell trial which is slated to get started in April of this year. (commercial at 9:37) to contact me: bobbycapucci@protonmail.com source: Juror #18: Man shares experience serving on the Lori Vallow trial | ktvb.com",
      "release": "2024-06-27T05:30:03Z",
      "duration": "00:14:54.5310000",
      "explicit": true,
      "spotifyId": "0IkdAZOQkeIJTsDdZZ4V4A",
      "appleId": 1000660395601,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0IkdAZOQkeIJTsDdZZ4V4A",
        "apple": "https://podcasts.apple.com/podcast/icymi-juror-18-from-the-lori-vallow-trial-and-the/id1583981598?i=1000660395601"
      }
    },
    {
      "id": "4131c5de-12f5-4de6-ba47-cbd40ef164e5",
      "title": "ICYMI:  Keith Ranieri And The Transfer",
      "description": "Convicted human trafficker Keith Raniere fears that if he is transferred to a new facility that his life will be in danger. His legal team filed the ask and also asked the judge to slap a temporary restraining order on the BOP so that Raniere is not transferred until a new ruling can be made. (commercial at 7:14) to contact me: bobbycapucci@protonmail.com source: https://nypost.com/2022/11/08/nxivm-sex-cult-leader-keith-raniere-claims-prison-transfer-puts-his-life-at-risk/",
      "release": "2024-04-22T05:30:03Z",
      "duration": "00:11:08.5340000",
      "explicit": true,
      "spotifyId": "3Po4otQ7uu2E8f9aFY59cU",
      "appleId": 1000653168115,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Po4otQ7uu2E8f9aFY59cU",
        "apple": "https://podcasts.apple.com/podcast/icymi-keith-ranieri-and-the-transfer/id1583981598?i=1000653168115"
      }
    },
    {
      "id": "ef88c3df-31d0-4dc5-a2c2-584988aae75b",
      "title": "Juror # 18 From The Lori Vallow Trial Recounts His Experience And Talks About His Upcoming Book (2/28/24)",
      "description": "Lori Vallow gained significant media attention due to her involvement in a complex and tragic case involving the disappearance of her two children, Tylee Ryan and Joshua \u0022JJ\u0022 Vallow. Lori Vallow was married multiple times and had a history of unusual beliefs, including her involvement with a religious group known as Preparing a People. The case unfolded in late 2019 when concerned family members reported Tylee and JJ missing. Lori and her fifth husband, Chad Daybell, became the focus of the investigation after they were found to have misled authorities and exhibited suspicious behavior. The situation escalated when investigators discovered the bodies of Tylee and JJ buried on Chad Daybell\u0027s property in Idaho in June 2020. Lori Vallow was subsequently arrested and faced multiple charges, including conspiracy to commit murder and various counts of desertion and nonsupport of dependent children. Her husband, Chad Daybell, also faced charges related to the concealment of evidence and the children\u0027s deaths. The case drew widespread attention due to its intricate details, including allegations of cult-like beliefs, doomsday prophecies, and suspicious deaths of individuals associated with Lori and Chad, namely Lori\u0027s children. Throughout the legal proceedings, Lori Vallow\u0027s defense maintained her innocence, claiming mental health issues and coercion from Chad Daybell. However, as the investigation progressed, evidence mounted against both of them, leading to their eventual indictments and court appearances. After a blisterning presentation by the prosecution in Idaho, and a weak wristed attempt at a defense by Vallow, she was found guilty. In this episode, we hear from Juror # 18 who discusses what he went through while sitting on the jury and his plans to write a book after the conclusion of the Chad Daybell trial which is slated to get started in April of this year. (commercial at 9:37) to contact me: bobbycapucci@protonmail.com source: Juror #18: Man shares experience serving on the Lori Vallow trial | ktvb.com",
      "release": "2024-02-28T15:13:58Z",
      "duration": "00:14:54.5310000",
      "explicit": true,
      "spotifyId": "0X13yR9BCEWEnnvpFlMtH9",
      "appleId": 1000647407845,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0X13yR9BCEWEnnvpFlMtH9",
        "apple": "https://podcasts.apple.com/podcast/juror-18-from-the-lori-vallow-trial-recounts-his/id1583981598?i=1000647407845"
      }
    }
  ]
}