{
  "_ts": 0,
  "id": "a3099964-653d-4142-99f5-93f946d26780",
  "name": "Beyond the Monsters",
  "spotifyId": "3gmVkvzX4xNWwsWFamRUai",
  "appleId": 1778966880,
  "youTubeChannelId": "UCRjzxbl-22ddIBe2V3CT5Tg",
  "episodes": [
    {
      "id": "f7f3f8eb-9259-4b6c-ab6c-65ba335ed127",
      "title": "From Religious Cult to Dominatrix",
      "description": "Raven shares her powerful journey of self-discovery, resilience, and healing. Growing up within the strict Jehovah’s Witness religion, she faced trauma, identity suppression, and addiction, struggling to reconcile her true self with the confines of her upbringing. She courageously speaks about the deep scars left by multiple instances of sexual assault and the lasting impact of those experiences on her mental health. Throughout her story, she reflects on navigating family dynamics, sobriety, and the profound role of plant medicine in her recovery. She emphasizes the importance of creating safe spaces for consent, exploration, and self-discovery, especially within marginalized communities. Raven also highlights her advocacy for the military, particularly the Marines, while shedding light on her experiences with complex romantic partnerships. In addition, Raven delves into her empowerment through the world of BDSM, emphasizing the significance of safety, trauma healing, and living authentically. She introduces her alter ego, Raven Roulette, who symbolizes her journey of reclaiming power and self-expression. She also shares her harrowing experience with an abusive partner who exploited her involvement in the BDSM world to manipulate and harm her. Through writing and her upcoming book, Raven hopes to inspire others to confront their trauma, embrace mental health awareness, and find their voice. Her advocacy aims to provide resources for healing and create a supportive community where others can share their stories. Raven’s Socials https://www.instagram.com/theravenroulette https://www.instagram.com/drippinginhope Raven’s book - Releasing this Spring Dark Erotic Poetry Called \u0022I Should Have Murdered You When I Had A Chance.\u0022 Raising mental health awareness for Sex Workers \u0026 United States Armed Forces. Suicide and Crisis Lifeline 988 National Sexual Assault Hotline RAINN 800-656-4673 Sexual Assault Crisis Text Line 741741 https://www.crisistextline.org SAMHSA’s National Helpline (mental health and/or substance use) 1-800-662-HELP (4357) Beyond the Monsters Socials https://www.instagram.com/beyondthemonsters https://linktr.ee/BeyondtheMonsters *Disclaimer: The content shared on this podcast is for informational and entertainment purposes only. The discussions and experiences shared are based on our personal stories and opinions. This is not medical advice, and it should not be used as a substitute for professional medical guidance. Always consult with a qualified healthcare provider for any concerns or questions regarding your health.",
      "release": "2025-02-11T00:06:59Z",
      "duration": "01:28:18.9830000",
      "explicit": true,
      "spotifyId": "4txvrVrfMFQT2oAXiq6I5e",
      "appleId": 1000690961625,
      "youTubeId": "KX8tir5t5N8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4txvrVrfMFQT2oAXiq6I5e",
        "apple": "https://podcasts.apple.com/podcast/from-religious-cult-to-dominatrix/id1778966880?i=1000690961625",
        "youtube": "https://www.youtube.com/watch?v=KX8tir5t5N8"
      }
    }
  ]
}