{
  "id": "2e10ff24-8212-4194-a620-16275c42ec69",
  "name": "BFMTV",
  "youTubeChannelId": "UCXwDLMDV86ldKoFVc_g8P0g",
  "episodes": [
    {
      "id": "cae464d5-7b5c-4c27-ae75-15cebdf1e7e7",
      "title": "LIGNE ROUGE - Affaire Epstein, les dernières révélations du scandale mondial",
      "description": "Parmi les puissants cités dans les dossiers Epstein, plusieurs personnalités sont aujourd\u0027hui sommées d\u0027expliquer leurs liens avec le milliardaire pédocriminel. Ghislaine Maxwell, la complice et compagne de Jeffrey Epstein, exige une grâce de Donald Trump.",
      "release": "2026-02-13T21:03:03Z",
      "duration": "00:42:56",
      "explicit": false,
      "youTubeId": "sPS2iZW8PZM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sPS2iZW8PZM"
      }
    },
    {
      "id": "d3da49e2-032f-4bc3-9b8f-3b2e70da0137",
      "title": "Juliette, victime présumée de Jeffrey Epstein raconte sa rencontre avec le milliardaire",
      "description": "Juliette ancienne mannequin a été abordée par Daniel Siad en 2003 alors qu’elle avait 20 ans. L’homme est l’un des rabatteurs présumés du criminel sexuel Jeffrey Epstein. Elle témoigne sur BFMTV.",
      "release": "2026-02-11T20:48:36Z",
      "duration": "00:11:47",
      "explicit": false,
      "youTubeId": "zwiAtEVmtX0",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zwiAtEVmtX0"
      }
    },
    {
      "id": "dda47fc3-3fa1-4820-b44e-55983547d294",
      "title": "\u0022La Famille, enquête sur une communauté secrète\u0022: les coulisses de la série documentaire de BFMTV",
      "description": "C\u0027est une histoire hors-du-commun. Celle d\u0027une communauté secrète, en plein cœur de Paris, qui jusque-là n\u0027avait jamais attiré la lumière. Un groupe religieux, appelé \u0022la Famille\u0022, composé de 3000 personnes. Avec une seule règle stricte : se marier entre cousins, sous peine d\u0027être exclu. Pour la première fois depuis la naissance de cette communauté il y a 200 ans, et malgré leur principe de rester secrets, des membres de \u0022la Famille\u0022 sortent du silence et parlent en exclusivité à BFMTV. Ils racontent leur quotidien, leurs rites, leurs règles, leur solidarité. Deux femmes qui en ont été exclues témoignent également devant nos caméras.",
      "release": "2021-11-28T07:00:44Z",
      "duration": "00:02:33",
      "explicit": false,
      "youTubeId": "ZegMCZcRQ7Y",
      "subjects": [
        "La Famille"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZegMCZcRQ7Y"
      }
    }
  ]
}