{
  "id": "f8eeb8fb-3f45-429e-9f29-8c3786b060b0",
  "name": "Big [If True]",
  "youTubeChannelId": "UCkxWiSbPEuJC7W0UfoLwIqQ",
  "episodes": [
    {
      "id": "4af58e8a-4576-489b-97b4-8497c34b9187",
      "title": "Why UFO Conspiracy Theories Thrive: Insights from The Uncover Up Podcast | Big [If True]",
      "description": "In an era of distrust and disinformation, why do UFO conspiracy theories thrive? Join Lee Kuhnle and Nathan Radke, co-hosts of The Uncover Up podcast, as they provide insights into what makes UFO conspiracy theories so compelling and discuss the bad actors who benefit from them. From alleged \u0022miracle\u0022 healing devices to the bizarre rise of Romana Didulo-Canada\u0027s self-proclaimed extraterrestrial \u0022Queen\u0022- Kuhnle and Radke unpack why UFO-related narratives continue to capture imaginations and grow in influence.\n\nThis discussion will explore how government secrecy further fuels these beliefs, how to have productive conversations with believers, and why people are drawn to UFO conspiracies in the first place. Learn how UFO conspiracy theories amplify disinformation, create fertile ground for bad actors, and erode critical thinking and public trust.\n\nIn 2022, the Government of Canada launched the Sky Canada Project to study how Unidentified Aerial Phenomena (UAP) sightings reported by the public are managed in Canada. In the following years, a number of U.S. congressional hearings on UFOs sparked renewed public fascination and debate. But this fascination goes back decades.\n\nLee Kuhnle and Nathan Radke discuss the historical context of UFO conspiracy theories, from the scams and government coverups that have been present since the very beginning of the UFO phenomenon in 1947, to the modern-day exploitation of these beliefs by bad actors. They also explore the psychological appeal of UFO conspiracies, the role of media and pop culture in perpetuating these narratives, and the impact of government secrecy on public trust.\n\nDiscover how UFO conspiracy theories create fertile ground for disinformation, how to have productive conversations with believers, and why people are drawn to these narratives in the first place. This insightful discussion will help you understand the complex factors that contribute to the persistence of UFO conspiracy theories and the real-world consequences they can have.\n\n0:00 Introduction\n0:39 Why are we fascinated with UFO Conspiracies\n2:26 UFO Fever - Shag Harbor\n4:08 you are what you eat\n4:36 CIA, USSR, and UFOs\n5:03 How are we getting scammed\n6:00 Heaven\u0027s Gate\n6:58 Day to Day UFO Scams\n7:24 Medbeds\n8:58 Underlying Belief in UFO Conspiracies\n9:39 The UFO Scammers in Canada\n10:04 Romana Didulo \u0022Queen of Canada\u0022\n10:44 UFO Scam Prevention\n12:11 A Root Cause\n12:49 End Screen\n\nAbout Big [If True]\nBig [If True] tackles the rising threat of misinformation and disinformation. Hosted by award-winning journalist Molly Thomas, this bold, new show uncovers why we fall for falsehoods and how to fight back.\n\nSubscribe to Big [If True] on YouTube: YouTube.com/@BigIfTrueTVO\n \nSubscribe to TVO Media Education Group newsletters: https://www.tvo.org/newsletters\n \nGet the TVO Today app:   App Store: https://apps.apple.com/ca/app/tvo-today/id1616182112\n \nGoogle Play https://play.google.com/store/apps/details?id=org.tvo.tvomediaapp\u0026pli=1\n\n#UFOConspiracy #UncoverUpPodcast #UFOTheories #BigifTrue",
      "release": "2024-12-02T01:04:00Z",
      "duration": "00:12:57",
      "explicit": false,
      "youTubeId": "VT2FzYmo8Zk",
      "subjects": [
        "Romana Didulo",
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VT2FzYmo8Zk"
      }
    }
  ]
}