{
  "id": "69cd8349-f38f-4299-84c6-1183ff390c82",
  "name": "Big Think",
  "youTubeChannelId": "UCvQECJukTDE2i6aCoMnS-Vg",
  "episodes": [
    {
      "id": "7566d5d8-83bb-4f86-a3d6-83d63ad73729",
      "title": "Scientology Is the McDonalds of Religions | Louis Theroux | Big Think",
      "description": "Scientology Is the McDonalds of Religions \n\nWatch the newest video from Big Think: https://bigth.ink/NewVideo\nJoin Big Think Edge for exclusive videos: https://bigth.ink/Edge\n---------------------------------------------------------------------------------- \nScientology is the true religion of America\u0027s capitalist soul. \u0022To me,\u0022 says Louis Theroux, \u0022Scientology is selling spiritual hamburgers.\u0022 What is the most quintessentially American religion? It would need to have celebrities, a Hollywood setting, big money, and a confusing swirl of innocence and the macabre. That\u0027s Scientology defined, says documentarian Louis Theroux. The church was founded by sci-fi writer L. Ron Hubbard around the same time that the first McDonald\u0027s opened, and there are enormous parallels in the business models of these two operations. Scientology is the embodiment of America\u0027s capitalist soul, with two seemingly at-odd goals: to spread the good word of Dianetics (Scientology\u0027s sacred text) as far as possible, but to only give its wisdom to those who are willing to pay for it. The top level of Scientology\u0027s ideology ladder is called the \u0022Bridge to Total Freedom\u0022 — however it\u0027s anything but free, costing an individual a minimum of $250,000 to access. It begs the question: Do you want salvation with that? Louis Theroux\u0027s latest documentary is My Scientology Movie.\n----------------------------------------------------------------------------------\nLOUIS THEROUX:\n\nLouis Theroux is a BBC television presenter best known for making documentaries that investigate fascinating worlds and lifestyles. His latest work is a feature documentary on the Church of Scientology, My Scientology Movie, released in the US in March 2017.\n\nOver more than 15 years, using a gentle questioning style and an informal approach, he has shone light on some of the world’s most intriguing beliefs, behaviors, and institutions by getting to know the people at the heart of them – from the officers and inmates at San Quentin prison to the extreme believers of the Westboro Baptist Church; the male porn performers of the San Fernando Valley to the medical regime in one of America’s leading centers of mental health for kids. Recently he made a two-part series on Miami county jail and a special on America’s private menageries of exotic animals.\n\nIn the course of his career, Louis has scored a number of journalistic scoops. His series of celebrity profiles, When Louis Met…, took viewers inside the world of the charity fund-raising eccentric Sir Jimmy Savile; the media guru Max Clifford and his client Simon Cowell; and most famously Neil and Christine Hamilton, who found themselves the subject of rape allegations during filming and allowed Louis and his director to continue to stay with them and document the ensuing media onslaught.\n\nLouis graduated from Oxford in 1991 and started out as a print journalist the following year, working for Metro weekly in San Jose and then in New York for Spy magazine. He got his television break from Michael Moore, who hired him as a writer and correspondent for his ground-breaking satirical show, TV Nation.\n\nIn 1995 the BBC signed Louis to a development deal. He came up with an idea for a documentary series that would follow him as he immersed himself in off-beat lifestyle, called Weird Weekends.\n\nOver the years, Louis has kept true to a way of working that is uniquely his own: by charming his subjects, he’s able to offer rounded portraits of some of the world’s most psychologically gripping issues, while always resisting easy judgements. Louis has won two BAFTAs, an RTS award, and a Bulldog award, not to mention numerous nominations.\n\nLouis also continues to write for print publications. In 2005 he published a travel book about a few of his adventures, The Call of the Weird.\n----------------------------------------------------------------------------------\n TRANSCRIPT:\n\nLouis Theroux: I remember first to hearing about it from my uncle Peter who lives in Long Beach, and when I visited him in L.A. for the first time he told me about this religion that had been created by a sci-fi writer called L. Ron Hubbard, and that it was beloved of actors and celebrities, and that they used hard sales tactics. (These were all his allegations; I mean I\u0027m sure Scientology would deny it.) And that they were very secret, no one really knew what was going on inside.\n\nAnd in fact he told me—I remember him saying, “You can go down and look at their base; they\u0027ve got walls around it with spikes on, but the spikes don\u0027t face outward…the spikes face inward.” And I thought all of this was sort of really appealing. I mean my own sense of both the absurd but also the macabre was massively piqued.\n\nScientology to me seems to be a kind of junction of so many quintessentially American qualities.\n\nRead the full transcript at https://bigthink.com/videos/louis-theroux-scientology-the-capitalist-religion-only-america-could-create",
      "release": "2017-03-24T17:02:29Z",
      "duration": "00:04:49",
      "explicit": false,
      "youTubeId": "9BAJJ2lbvl0",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9BAJJ2lbvl0"
      }
    }
  ]
}