{
  "id": "2feb5cce-39d5-4bd2-baa3-95c0fb3a064a",
  "name": "Bitch Is A Bad Word: A Domestic Abuse Survivors Guide",
  "spotifyId": "3frZ12xmxKo0lCa8eIGCDD",
  "appleId": 1780948251,
  "youTubeChannelId": "UCDKze2KH7AIlOUSUg6za-oA",
  "episodes": [
    {
      "id": "c9547a5e-daab-437a-9732-aaf7a6a7c388",
      "title": "(Re-Release) Bethany Joy Lenz on Cults, Control, and Finding Herself Again",
      "description": "This episode originally aired on April 15, 2025. If you or someone you love is experiencing domestic violence, call the National Domestic Violence Hotline at 1-800-799-SAFE (7233) or visit www.thehotline.org ----- This week on Bitch Is a Bad Word, actress, singer, author, and podcaster Bethany Joy Lenz joins us for a powerful, no-holds-barred conversation about surviving a cult — all while starring on one of TV’s most iconic teen dramas, One Tree Hill. Bethany opens up about her upcoming memoir, her journey of breaking free from coercive control, and how reclaiming her faith helped her heal from spiritual abuse and toxic relationships. She shares how being in the public eye shaped her recovery and how she\u0027s using her platform to empower others. \u0026#x1f399;️ In this episode: What it was like to be in a cult while starring on a cult-favorite TV show Escaping spiritual manipulation and finding her own truth Understanding the difference between intuition and trauma responses Healing from abusive relationships and psychological control Why storytelling and visibility matter in recovery Whether you\u0027re a lifelong One Tree Hill fan, a survivor of spiritual or emotional abuse, or someone seeking truth and healing, Bethany’s story will resonate deeply. #BethanyJoyLenz #SurvivingACult #CoerciveControl #SpiritualAbuse #OneTreeHill #TraumaHealing #ToxicRelationships #Memoir2025 #BitchIsABadWordPodcast If you or someone you know needs immediate help, please reach out to the National Domestic Violence Hotline at 1-800-799-7233 Visit Joy\u0027s linktr.ee/bethanyjoylenz to PURCHASE: - Joy\u0027s book Dinner For Vampires: Life On A Cult TV Show (While In An Actual Cult) - Listen to Joy on the ONE TREE HILL podcast Dramaqueens - Subscribe to Joy\u0027s print magazine MODERN VINTAGE - And so much more! ***Give yourself the ultimate in sleep comfort with a 40% Discount from Cozy Earth Visit CozyEarth.com and use my exclusive code BESTIES for 40% off best-selling sheets, towels, pajamas, and more. And if you get a post-purchase survey, let them know you heard about Cozy Earth right here. ------- Listen wherever you get your podcasts Watch: YouTube Join: Patreon Follow: Instagram TikTok Subscribe: Newsletter Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2026-02-17T14:00:00Z",
      "duration": "00:59:31.0170000",
      "explicit": true,
      "spotifyId": "2lXXJH9sHsIUaIU3mRs5Gn",
      "appleId": 1000750157733,
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2lXXJH9sHsIUaIU3mRs5Gn",
        "apple": "https://podcasts.apple.com/podcast/re-release-bethany-joy-lenz-on-cults-control-and/id1780948251?i=1000750157733"
      }
    },
    {
      "id": "70a08b42-9266-40d2-a5cf-0b263df0c296",
      "title": "(Re-Release) Narcissism Explained: How To Spot A Narcissist | Vanessa Reiser, LCSW Narcissism \u0026 Cult Abuse",
      "description": "This episode originally aired on September 9, 2025. If you or someone you love is experiencing domestic violence, call the National Domestic Violence Hotline at 1-800-799-SAFE (7233) or visit www.thehotline.org ----- What is a narcissist—really? How do they act? How do they trap you? And how do you begin to break free once you realize the truth? In this episode of Bitch Is a Bad Word, therapist and narcissistic abuse expert Vanessa Reiser breaks it down: what narcissism looks like, why it’s so confusing at first, and how to spot the patterns before it\u0027s too late. Vanessa’s knowledge isn’t just clinical—it’s personal. After surviving her own relationship with a narcissist, she committed her life to helping others recognize the red flags she once missed. Whether you\u0027re asking: “Am I dating a narcissist?” “Why do I feel crazy in this relationship?” “What is narcissistic abuse?” “Why can’t I leave even though I’m unhappy?” This episode is for you. ⚠️ Trigger Warning: Includes personal stories and professional insight on narcissistic abuse, gaslighting, emotional manipulation, love bombing, and trauma bonding. \u0026#x1f4de; If you or someone you know is in danger, call The National Domestic Violence Hotline at 1-800-799-7233 or text START to 88788. ABOUT Vanessa Reiser: Instagram: Vanessa Reiser’s IG - @vanessareiserlcsw Twitter: Vanessa Reiser’s TW - @vprockland Website: https://tellatherapist.net/ Guest Bio: Vanessa Reiser is a mother, entrepreneur, life coach, advocate, and a ground breaking psychotherapist specializing in narcissistic abuse using Therapist Self-Disclosure (TSD); a form of therapy where therapist statements are shared that reveal something personal about the therapist, when an opportunity to create validation exists. Vanessa is licensed in NY, NJ, MA \u0026 FL and made international headlines when she ran the entire state of New York in a wedding dress to raise awareness for narcissistic abuse in May 2021. Her days are spent supporting those traumatized by this insidious form of domestic violence. --- JOIN the BIABW PATREON and DISCORD SERVER where we\u0027re building our Bestie community! On Discord, we\u0027ve created a safe space where you can connect anonymously with others and share. And on Patreon, I \u0022spill the tea\u0022 all week long as well as have all the episodes available ad-free! Join at patreon.com/BitchIsABadWord STAY UPDATED \u0026 SUBSCRIBE TO OUR NEWSLETTER: https://www.caliber-studio.com/bitch-is-a-bad-word-with-lindsay#biabwsubscribe Connect with Us: \u0026#x1f4e7; Email: biabw@caliber-studio.com \u0026#x1f4f1; Call or Text: (331) BITCHES \u0026#x1f4f8; Instagram: @bitchisabadwordpod \u0026#x1f3b5; TikTok: @bitchisabadword LISTEN \u0026 SUBSCRIBE: - Apple Podcasts: podcasts.apple.com/us/podcast/bitch-is-a-bad-word/id1780948251 - Spotify Podcasts: open.spotify.com/show/3frZ12xmxKo0lCa8eIGCDD - Website: caliber-studio.com/bitchisabadword Listen wherever you get your podcasts Watch: YouTube Join: Patreon Follow: Instagram TikTok Subscribe: Newsletter Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2026-02-10T14:00:00Z",
      "duration": "01:05:42.6090000",
      "explicit": true,
      "spotifyId": "3hsm2YfUlHniQB40DnKcFB",
      "appleId": 1000749086219,
      "subjects": [
        "Cult Psychology",
        "One-on-one",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hsm2YfUlHniQB40DnKcFB",
        "apple": "https://podcasts.apple.com/podcast/re-release-narcissism-explained-how-to-spot-a/id1780948251?i=1000749086219"
      }
    },
    {
      "id": "de9f5a06-dd2e-44a1-9700-1abb5dd8650f",
      "title": "13: Bethany Joy Lenz on Cults, Control, and Finding Herself Again",
      "description": "This week, actress, singer, podcaster and author Bethany Joy Lenz joins us for a powerful conversation about surviving a cult—while working on one of TV’s most iconic teen dramas. We talk about her upcoming memoir, reclaiming faith, navigating toxic relationships, and how being in the public eye shaped her healing journey. In this episode, we cover: What it’s like to live in a cult while starring on a cult TV show Breaking free from coercive control and spiritual manipulation The difference between intuition and trauma responses Recovering from toxic and abusive relationships How she’s using her voice and platform to empower others Whether you\u0027re a longtime One Tree Hill fan or just learning Bethany’s story, this conversation is honest, healing, and not to be missed. PURCHASE Joy\u0027s book Dinner For Vampires: Life On A Cult TV Show (While In An Actual Cult) LISTEN to Joy\u0027s podcast Drama Queens ***Give yourself the ultimate in sleep comfort with a 40% Discount from Cozy Earth Visit CozyEarth.com and use my exclusive code BESTIES for 40% off best-selling sheets, towels, pajamas, and more. And if you get a post-purchase survey, let them know you heard about Cozy Earth right here. ------- Listen wherever you get your podcasts Watch full episodes on YouTube Follow us on Instagram and TikTok Subscribe to our Newsletter ! If you or someone you know needs immediate help, please reach out to the National Domestic Violence Hotline at 1-800-799-7233 This podcast is for you if you\u0027re asking questions such as: Am I in an abusive relationship? What are the five (5) signs of emotional abuse? How do I know if I\u0027m being emotionally abused by my husband / wife / partner? Am I in a toxic relationship? How do I tell if I\u0027m in a domestic abusive relationship? What are signs of narcissistic abuse? What are the red flags of emotional abuse? Am I thinking of calling the National Domestic Violence Hotline (NDVH)? What is the effect on my children of living in an abusive house? Bitch Is A Bad Word: A Podcast On Domestic Abuse is a podcast about identifying and navigating your way through and out of Domestic Violence and Domestic Abuse, hosted by two survivors of Domestic Abuse. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-04-15T04:00:00Z",
      "duration": "01:04:15.5680000",
      "explicit": true,
      "spotifyId": "5SCt1NI8fiahjz5fd0zuS9",
      "appleId": 1000703546887,
      "youTubeId": "80lMZGzGBdU",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5SCt1NI8fiahjz5fd0zuS9",
        "apple": "https://podcasts.apple.com/podcast/13-bethany-joy-lenz-on-cults-control-and-finding/id1780948251?i=1000703546887",
        "youtube": "https://www.youtube.com/watch?v=80lMZGzGBdU"
      }
    }
  ]
}