{
  "_ts": 0,
  "id": "2feb5cce-39d5-4bd2-baa3-95c0fb3a064a",
  "name": "Bitch Is A Bad Word: A Domestic Abuse Survivors Guide",
  "spotifyId": "3frZ12xmxKo0lCa8eIGCDD",
  "appleId": 1780948251,
  "youTubeChannelId": "UCDKze2KH7AIlOUSUg6za-oA",
  "episodes": [
    {
      "id": "de9f5a06-dd2e-44a1-9700-1abb5dd8650f",
      "title": "13: Bethany Joy Lenz on Cults, Control, and Finding Herself Again",
      "description": "This week, actress, singer, podcaster and author Bethany Joy Lenz joins us for a powerful conversation about surviving a cult—while working on one of TV’s most iconic teen dramas. We talk about her upcoming memoir, reclaiming faith, navigating toxic relationships, and how being in the public eye shaped her healing journey. In this episode, we cover: What it’s like to live in a cult while starring on a cult TV show Breaking free from coercive control and spiritual manipulation The difference between intuition and trauma responses Recovering from toxic and abusive relationships How she’s using her voice and platform to empower others Whether you\u0027re a longtime One Tree Hill fan or just learning Bethany’s story, this conversation is honest, healing, and not to be missed. PURCHASE Joy\u0027s book Dinner For Vampires: Life On A Cult TV Show (While In An Actual Cult) LISTEN to Joy\u0027s podcast Drama Queens ***Give yourself the ultimate in sleep comfort with a 40% Discount from Cozy Earth Visit CozyEarth.com and use my exclusive code BESTIES for 40% off best-selling sheets, towels, pajamas, and more. And if you get a post-purchase survey, let them know you heard about Cozy Earth right here. ------- Listen wherever you get your podcasts Watch full episodes on YouTube Follow us on Instagram and TikTok Subscribe to our Newsletter ! If you or someone you know needs immediate help, please reach out to the National Domestic Violence Hotline at 1-800-799-7233 This podcast is for you if you\u0027re asking questions such as: Am I in an abusive relationship? What are the five (5) signs of emotional abuse? How do I know if I\u0027m being emotionally abused by my husband / wife / partner? Am I in a toxic relationship? How do I tell if I\u0027m in a domestic abusive relationship? What are signs of narcissistic abuse? What are the red flags of emotional abuse? Am I thinking of calling the National Domestic Violence Hotline (NDVH)? What is the effect on my children of living in an abusive house? Bitch Is A Bad Word: A Podcast On Domestic Abuse is a podcast about identifying and navigating your way through and out of Domestic Violence and Domestic Abuse, hosted by two survivors of Domestic Abuse. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-04-15T04:00:00Z",
      "duration": "01:04:15.5680000",
      "explicit": true,
      "spotifyId": "5SCt1NI8fiahjz5fd0zuS9",
      "appleId": 1000703546887,
      "youTubeId": "80lMZGzGBdU",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5SCt1NI8fiahjz5fd0zuS9",
        "apple": "https://podcasts.apple.com/podcast/13-bethany-joy-lenz-on-cults-control-and-finding/id1780948251?i=1000703546887",
        "youtube": "https://www.youtube.com/watch?v=80lMZGzGBdU"
      }
    }
  ]
}