{
  "_ts": 0,
  "id": "26d98d06-acd7-44c1-9971-6a7722a6b51a",
  "name": "Bite Back with Abbey Sharp",
  "spotifyId": "7sY955GKMkPSl6SvJHZU4R",
  "appleId": 1772739634,
  "episodes": [
    {
      "id": "4fcc54cd-898a-4f14-85ad-a10220359b82",
      "title": "Is Your Diet or MLM a CULT? Exploring the Intersection of Diet Culture \u0026 Cults with NXIVM cult survivor, Sarah Edmonson",
      "description": "In today’s episode of Bite Back with Abbey Sharp, we get to sit down with ex-NXIVM cult member, Sarah Edmonson. Sarah is the star of the hit HBO series, The Vow, the author of Scarred, and the co-host of the podcast, A Little Bit Culty. In this episode, she details the extreme low calorie diets and exercise regimens that members of Keith Raniere’s NXIVM cult were instructed to follow. We discuss the role of diet restriction in cults and control, how wellness MLM’s use similar tactics as cults, and I will be leaving you with a list of red flags that your diet or wellness routine might actually be operating like a cult. Don’t forget to Please subscribe on Apple, Spotify or wherever you get your podcasts and leave us a review! It really helps us out. Check in with today’s amazing guest, Sarah Edmonson. Instagram: https://www.instagram.com/sarahedmondson/?hl=en A Little Bit Culty https://alittlebitculty.com/ Scarred https://a.co/d/cZf2KF1 Preorder Sarah \u0026 Nippy’s Upcoming Book: https://checkout.square.site/merchant/MLR16M1R576DP/checkout/25UI2OVABMV3RD4YF55WQ755 Disclaimer: This episode does discuss disordered eating, calories and abuse. The content in this episode is for educational and entertainment purposes only and is never a substitute for medical advice. If you’re struggling with with your mental or physical health, please work one on one with a health care provider. If you have heard yourself in our discussion today, and are looking for support, contact the free NEDIC helpline at 1-866-NEDIC-20 or go to eatingdisorderhope.com. \u0026#x1f964; Check out my 2-in-1 Plant Based Probiotic Protein Powder, neue theory at www.neuetheory.com or @neuetheory Don’t forget to Please subscribe on Apple, Spotify or wherever you get your podcasts and leave us a review! It really helps us out. ✉️ SUBSCRIBE TO MY NEWSLETTERS ⤵️ Neue Theory newsletter Abbey\u0027s Kitchen newsletter \u0026#x1f95e; FREE HUNGER CRUSHING COMBO™ E-BOOK! \u0026#x1f4aa;\u0026#x1f3fc; FREE PROTEIN 101 E-BOOK! Disclaimer: The content in this episode is for educational and entertainment purposes only and is never a substitute for medical advice. If you’re struggling with with your mental or physical health, please work one on one with a health care provider. \u0026#x1f4f1; Follow me! Instagram: @abbeyskitchen TikTok: @abbeyskitchen YouTube: @AbbeysKitchen My blog, Abbey’s Kitchen www.abbeyskitchen.com My book, The Mindful Glow Cookbook affiliate link: https://amzn.to/3NoHtvf If you liked this podcast, please like, follow, and leave a review with your thoughts and let me know who you want me to discuss next!",
      "release": "2024-12-10T09:30:00Z",
      "duration": "00:47:25.2830000",
      "explicit": false,
      "spotifyId": "2kaioUovQCXIhF8RIAZeh0",
      "appleId": 1000679863927,
      "subjects": [
        "NXIVM",
        "Multi-Level Marketing",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2kaioUovQCXIhF8RIAZeh0",
        "apple": "https://podcasts.apple.com/podcast/is-your-diet-or-mlm-a-cult-exploring-the/id1772739634?i=1000679863927"
      }
    }
  ]
}