{
  "id": "b5747627-3811-4e0d-b2e0-0d2b14b0afa0",
  "name": "Black Messiah Media",
  "youTubeChannelId": "UCiDIOkG598Pf9bvFZ4gKNag",
  "episodes": [
    {
      "id": "aed03505-18d5-4eb5-b633-cb0adb8c7980",
      "title": "Top 10 Shocking Black Cults You Never Heard About! PART 2",
      "description": "Black cuts in America have long played a vital role in shaping both spiritual identity and social resistance within the African American community. Emerging from the crucible of slavery, racial segregation, and systemic oppression, groups such as the Nation of Islam, the Moorish Science Temple of America, the Black Hebrew Israelites, the Five Percent Nation, and various Afrocentric Christian denominations have blended elements of traditional Abrahamic faiths with Black empowerment, historical reinterpretation, and self-determination. These movements often arose in response to mainstream religious exclusion, offering alternative narratives about identity, salvation, and liberation rooted in African heritage and collective resilience.",
      "release": "2025-07-14T01:28:51Z",
      "duration": "00:11:58",
      "explicit": false,
      "youTubeId": "TjEVNHOL-PM",
      "subjects": [
        "Carbon Nation",
        "Black Hebrew Israelites",
        "Israel United in Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TjEVNHOL-PM"
      }
    },
    {
      "id": "42fbd2f8-20ee-4965-8c26-58bbc7b2a19a",
      "title": "Life Sentence - The Cult Leader that had the Internet in a Chokehold",
      "description": "The Nature Boy trial in Georgia is truly a bizarre case, as this video details the moment the polygamist cult leader was arrested mid-live stream. The footage includes chaotic scenes and courtroom updates, highlighting the drama of the situation. Stay tuned for more updates on this wild case of true crime.",
      "release": "2025-06-30T03:16:29Z",
      "duration": "00:18:58",
      "explicit": false,
      "youTubeId": "AbwPs5SaqF0",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AbwPs5SaqF0"
      }
    },
    {
      "id": "d4e6846b-fd5e-478d-9785-2c179b573e04",
      "title": "10 Black Cults Pt. 1: You Won\u0027t BELIEVE #1",
      "description": "Black cults in America have historically emerged at the intersection of racial oppression, religious fervor, and the search for identity and empowerment. Often blending elements of Christianity, mysticism, and Afrocentric teachings, these groups offered their followers a sense of purpose and belonging amid systemic marginalization. While some were rooted in liberation theology or cultural pride, others became infamous for authoritarian control, violence, or scandal.",
      "release": "2025-06-23T03:42:23Z",
      "duration": "00:22:42",
      "explicit": false,
      "youTubeId": "Oy2U9IwYwXQ",
      "subjects": [
        "United Nation of Islam",
        "House of Prayer for All",
        "Nation of Yahweh",
        "International Peace Mission movement",
        "Nuwaubian Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Oy2U9IwYwXQ"
      }
    }
  ]
}