{
  "id": "2714779e-b1e5-4a7a-8ecc-ffaad75df03f",
  "name": "Black Jonestown",
  "youTubeChannelId": "UCfxmOgWz0-B7RuN4PZhX8gw",
  "episodes": [
    {
      "id": "9fb7f531-526b-4804-bc9a-5d9e2d44078a",
      "title": "Episode 3: Janet Shular: A Survivor’s Voice | Honoring Deanna Wilkinson | Black Jonestown",
      "description": "Episode 3 of Black Jonestown centers the voice of Janet Shular, the oldest known surviving former member of People’s Temple, as she reflects on her life, her time within the movement, and the experiences that shaped her understanding of faith, community, and survival.\n\nThis episode also takes a moment to honor the life and legacy of Deanna Wilkinson — a gifted musician whose voice brought light, beauty, and joy to many. Deanna’s voice remains a powerful reminder that within a complicated and tragic history were real people, real gifts, and lives that deserve to be remembered!\n\n#BlackJonestown  #PeoplesTemple #JonestownHistory #SurvivorStories\n#BlackHistory",
      "release": "2025-12-18T01:01:00Z",
      "duration": "01:55:32",
      "explicit": false,
      "youTubeId": "d1QcXmil25c",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d1QcXmil25c"
      }
    },
    {
      "id": "b14f2131-7325-436b-9782-b99dcdecbc3d",
      "title": "Episode 3 Preview | Janet Shular’s Story | Black Jonestown",
      "description": "In Episode 3 of Black Jonestown, we sit down with Janet Shuler, the oldest surviving member of Peoples Temple, as she shares her journey in her own words.\n\nAn educated, accomplished professional in early childhood education, Janet joined Peoples Temple believing it was a place where her gifts could serve children and build community. And for a time, it was. But as the cracks began to show, Janet realized Jim Jones was not the man he claimed to be. What followed was a quiet awakening — and a carefully planned escape that saved her life and the lives of her family. This episode challenges the long-standing stereotypes about who followed Jim Jones. Janet Shuler was not ignorant or helpless. She was thoughtful, perceptive, and courageous — a woman who chose truth over fear.\n\nWe also honor the life and legacy of Deanna Wilkinson, one of Peoples Temple’s most extraordinary voices. Her music brought joy to many, and her story reminds us that behind every headline were real people with real gifts and real lives.\n\nEpisode 3 premieres December 17th.\nStay tuned.",
      "release": "2025-12-12T01:15:00Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "1gnz0RSSS9k",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1gnz0RSSS9k"
      }
    },
    {
      "id": "15d493e2-5060-404d-a961-9d7a13dad296",
      "title": "Episode 2: Her Mother, Her Grandmother, Her Truth — Remembering Elsie Bell",
      "description": "In Episode 2 of Black Jonestown, Leslie Wagner Wilson sits down with Nancy Shaw — a woman whose family was forever changed by the promises and deceptions of Jim Jones.\n\nNancy opens her heart about losing her mother, who died believing Jones would heal her, and her grandmother, who perished in Jonestown. Through honesty, pain, and clarity, she brings forward a story few have ever heard directly from those who lived it.\n\nThis conversation is raw, intimate, and deeply human.\nIt speaks to faith, manipulation, grief, and the resilience it takes to reclaim your narrative after unimaginable loss.\n\nFollowing the interview, we honor the life of Elsie Bell, remembering her not just as a victim of Jonestown, but as a woman whose life, hope, and humanity mattered.\n\nBlack Jonestown is dedicated to telling the stories behind the headlines — to show the family, not the spectacle.\n\nIf this episode moved you, please like, comment, and subscribe so we can continue sharing the voices and stories that history tried to silence.",
      "release": "2025-12-03T05:00:01Z",
      "duration": "01:16:09",
      "explicit": false,
      "youTubeId": "0EJqA_1Vr44",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0EJqA_1Vr44"
      }
    },
    {
      "id": "7dd5dda3-5a0c-4748-acc6-a82ca064b1d9",
      "title": "Why “Drinking the Kool-Aid” Isn’t a Joke — Leslie Wagner Wilson Speaks",
      "description": "Survivor. Mother. Advocate. Truth-teller.\n\nIn this powerful TikTok message, Leslie Wagner Wilson, one of the survivors of the Jonestown tragedy, explains why the phrase “drinking the Kool-Aid” is deeply painful and harmful to those who lived through the event — and to the families whose loved ones never came home.\n\nThis clip is shared to bring understanding, context, and respect to a phrase that has been used casually for decades without acknowledging the real people behind it.\n\nAs we continue the mission of the Black Jonestown project — honoring the lives, the stories, and the humanity of those who were part of Peoples Temple — let this serve as a reminder:\n\nWords matter. History matters. And so do the people who survived it.",
      "release": "2025-11-26T20:15:01Z",
      "duration": "00:03:07",
      "explicit": false,
      "youTubeId": "RKSlL3uTiiE",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RKSlL3uTiiE"
      }
    },
    {
      "id": "2f8a2016-61fa-476a-ab9e-724d4a6a4a77",
      "title": "Episode 2 Preview — Black Jonestown",
      "description": "In the upcoming episode, we sit down with Nancy Shaw, a former child in Peoples Temple whose grandmother died in Jonestown. Nancy shares her story with real, raw, and emotional transparency as she reflects on the memories she’s carried for decades.\n\nWe also honor the lives of several Peoples Temple members who died in Jonestown. Their stories will be told through narration, shared pictures, and video—giving space to their truth, their humanity, and their legacy.\n\nAnd for everyone who’s been reaching out… we hear you!!\nLeslie Wagner Wilson will begin answering your questions in upcoming episodes.\n\nIf you have a question about Peoples Temple, Jonestown, or anything discussed so far, send it to:\n📩 therealblackjonestown@gmail.com\n\nEpisode 2 drops Wednesday, December 3rd.\nThank you for supporting this work, honoring these lives, and helping ensure their stories are told with the care their legacy deserves.\n\n#BlackJonestown",
      "release": "2025-11-25T02:15:06Z",
      "duration": "00:01:52",
      "explicit": false,
      "youTubeId": "lnjd3hNUW4k",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lnjd3hNUW4k"
      }
    },
    {
      "id": "28fdbc58-7aaa-427d-947c-bc91ff1835fe",
      "title": "Black Jonestown Podcast Episode 1",
      "description": "Episode 1 opens the Black Jonestown Podcast with two powerful voices who carry firsthand memories of Peoples Temple. Survivor Leslie Wagner Wilson shares her lived experience and the path that led her to become the executive producer of this series. We are also joined by Jack Colbert, who grew up inside Peoples Temple and offers a rare perspective from someone who witnessed the community from childhood.\n\nTogether, they reflect, remember, and speak openly about life before Jonestown and the moments that shaped everything. This conversation sets the foundation for the journey ahead.\n\nSubscribe for more interviews, stories, and insights as we uncover the truth—through the people who lived it.",
      "release": "2025-11-18T05:00:29Z",
      "duration": "02:17:33",
      "explicit": false,
      "youTubeId": "VJflnJrYHI8",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VJflnJrYHI8"
      }
    },
    {
      "id": "5ca8f6f8-55c7-46bd-bc42-e22fef21c19e",
      "title": "Black Jonestown Trailer",
      "description": "They weren’t lost souls or blind followers!\nThey were mothers, fathers, children, and dreamers — people of faith, community, and purpose who believed in building a better world.\n\nBlack Jonestown is a cinematic tribute to the Black members of the People’s Temple — those who lived, those who died, and those who survived the tragedy in Jonestown, Guyana. For decades, their humanity has been overshadowed by headlines and myths. This story reclaims their truth.\n\nThrough powerful storytelling, archival imagery, and haunting narration, the Black Jonestown series reveals who they really were — not victims of madness, but believers in hope, equality, and belonging.\n\nThis is not about how they died.\nIt’s about how they lived — and why their voices still matter.\n\n✨ The first episode premieres November 18, 2025!!\n\nSubscribe, share, and remember — because their story deserves to be told.",
      "release": "2025-11-06T22:45:01Z",
      "duration": "00:03:10",
      "explicit": false,
      "youTubeId": "OaOKlW1VNFs",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OaOKlW1VNFs"
      }
    }
  ]
}