{
  "id": "97297041-05ac-4a8b-baf2-5503dd27c4e6",
  "name": "Blake Anderson | Narcissistic Abuse Recovery",
  "youTubeChannelId": "UC-9T6vPiwfYBAfhFMWvAi1g",
  "episodes": [
    {
      "id": "f2c67827-f73d-40e7-81a2-b288ced48e88",
      "title": "The Narcissistic Family is a Cult: \u0022The Reveal\u0022 at the Wedding",
      "description": "When does the suspicion that your family is dysfunctional turn into undeniable proof? We call this \u0022The Reveal.\u0022\n\nIn this live, we will explore the Narcissistic Family System not just as toxic, but as a Cult System. Drawing on the work of Steven Hassan (Combating Cult Mind Control) and Sam Vaknin (Shared Fantasy), we break down how the family dynamic mimics a high-control group where the parents are the deities, and the children are the devotees.\n\nIn this episode, we cover:\n1. Cult vs. Culture\nWhat is the difference between a healthy family culture (which balances communion and autonomy) and a cult (which demands strict loyalty and conformity)? We look at how the family uses \u0022loaded language,\u0022 thought-stopping techniques, and double binds to keep you drinking the Kool-Aid.\n\n2. The Scapegoat as the \u0022Spy\u0022\nIf you are the scapegoat, you likely ventured outside the \u0022commune.\u0022 You went to the ocean depths and the stars—you found yourself. But when you return to the family, you are treated as a spy. You see the orchestration. You see the strings.\n\n3. The \u0022Reveal\u0022: The Wedding Case Study\nWe discuss a specific phenomenon that happens at weddings. I share a composite case study of a client who attended a family wedding, only to watch a narcissistic family member shapeshift into a completely different person around their \u0022clique.\u0022\n\n * The realization that the person you knew was a performance.\n * The \u0022Eyes Wide Shut\u0022 moment: Seeing the masks and the orchestration in plain sight.\n * Being excluded (or \u0022taken out\u0022) of the narrative during big events.\n\n4. Breaking the Shared Fantasy\nOnce you see the cult dynamics—the \u0022dad\u0022 vs. \u0022My father\u0022 language, the demand for supply, the orchestrated reputation management—you cannot unsee it. We talk about how to hold onto your reality when the rest of the system is gaslighting you.\n\nReferences:\n * Steven Hassan (Cult Dynamics / BITE Model)\n* Sam Vaknin (Shared Fantasy)\n * Eyes Wide Shut (Film Metaphor)\n\n#NarcissisticAbuse #Scapegoat #FamilyCult #StevenHassan #DepthPsychology #TheReveal",
      "release": "2025-12-31T16:47:03Z",
      "duration": "01:46:01",
      "explicit": false,
      "youTubeId": "xudTGABV5sg",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xudTGABV5sg"
      }
    },
    {
      "id": "203fce7b-fbda-42ca-9cd6-4c5a3d01a50a",
      "title": "Understanding Cult-like Dynamics in Narcissistic Families: Insights from Steve Hassan\u0027s BITE Model",
      "description": "The call to action is: Download the Reports for The Scapegoat \u0026 Narcissistic Abuse Recovery Course \u002B 45pg Healing Toolkit here: https://blaketherapy.ca/the-ultimate-toolkit\n\nJoin Blake Anderson, a seasoned social worker and therapist, as he delves into the parallels between cult dynamics and narcissistic family structures. Drawing from Steve Hassan\u0027s \u0027BITE Model\u0027—Behavior, Information, Thought, and Emotions—Blake explores how narcissistic parents manipulate and control their family members, mirroring cult-like behavior. Learn how these dynamics can manifest in behaviors, information control, emotional fusion, and suppression of individual thoughts. Discover the psychological impact this has on children, particularly the \u0027scapegoat,\u0027 and understand the importance of setting boundaries and seeking autonomy. An essential watch for those seeking to recognize and break free from toxic family patterns.\n\n00:00 Introduction and Background\n00:10 Understanding Cult Dynamics\n00:28 The BITE Model Explained\n00:39 Narcissistic Family Dynamics\n01:58 Behavior Control in Narcissistic Families\n02:48 Information Control in Narcissistic Families\n07:50 Thought Control and Manipulation\n12:52 Emotional Control and Cult-Like Dynamics\n18:25 Conclusion and Final Thoughts",
      "release": "2025-11-07T23:14:45Z",
      "duration": "00:18:49",
      "explicit": false,
      "youTubeId": "ub0OmhnMCO0",
      "subjects": [
        "Family Cult",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ub0OmhnMCO0"
      }
    }
  ]
}