{
  "_ts": 0,
  "id": "5d8c6777-0ffc-482d-afe8-0a4ab7c9422b",
  "name": "Blinded by the Light",
  "spotifyId": "4inM2nkBgkOg8XIlqFuoE3",
  "appleId": 1538182396,
  "episodes": [
    {
      "id": "b352af3d-eadc-43a8-ad45-1e1de756c917",
      "title": "11 | Christianity and Covert Cults--They\u0027re Everywhere - with Christiana Herbert",
      "description": "In this interview with Christiana Herbert, we discuss detoxing from evangelical Christianity and other cults. We also uncover other places in society where cult mentalities exist. Christiana\u0027s website Justice\u0027s website Podcast website",
      "release": "2022-07-16T03:09:42Z",
      "duration": "01:33:14.9760000",
      "explicit": false,
      "spotifyId": "4qLkCC1VHlaMCFfjT4QWGM",
      "appleId": 1000570085612,
      "subjects": [
        "Church Universal and Triumphant",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qLkCC1VHlaMCFfjT4QWGM",
        "apple": "https://podcasts.apple.com/podcast/christianity-and-covert-cults-theyre-everywhere/id1538182396?i=1000570085612"
      }
    },
    {
      "id": "0f0748f6-7448-467b-a1de-b5d1ac2cc93e",
      "title": "Family, Fathers, and Forgiveness",
      "description": "In this conversation Justice and I explore how we can navigate forgiveness, boundaries, and holding people accountable to foster better relationships. We also discuss how our childhood experiences and parents (especially our dads) contributed to who we are today. Justice\u0027s writing at Elephant Journal Justice\u0027s website, Bedhead Mystic Show website: www.blindedpodcast.com",
      "release": "2022-06-19T06:40:31Z",
      "duration": "00:53:39.0430000",
      "explicit": false,
      "spotifyId": "0AhuqngFYwqM15OdHJSC8d",
      "appleId": 1000567021119,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0AhuqngFYwqM15OdHJSC8d",
        "apple": "https://podcasts.apple.com/podcast/family-fathers-and-forgiveness/id1538182396?i=1000567021119"
      }
    },
    {
      "id": "66ec44f0-31fb-4934-9ba1-0324ef13aaaa",
      "title": "CUT in Los Angeles with Matt and Andy Lewis",
      "description": "What did growing up in Church Universal and Triumphant look like in the late 70\u0027s in Los Angeles (before the church relocated to southwest Montana)? In this interview, Matt and Andy Lewis, two uncles of the co-host, describe what the church high school experience was like and how it affected their upbringing. We also explore why they left CUT and what remnants of the church\u0027s impression on their young minds still exist today.",
      "release": "2022-03-22T05:19:11Z",
      "duration": "02:08:12.3030000",
      "explicit": false,
      "spotifyId": "5c7bnAYKzpHKez6t46LcPO",
      "appleId": 1000554815102,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5c7bnAYKzpHKez6t46LcPO",
        "apple": "https://podcasts.apple.com/podcast/cut-in-los-angeles-with-matt-and-andy-lewis/id1538182396?i=1000554815102"
      }
    },
    {
      "id": "ea41323c-2b20-4858-aad4-3898c74ae883",
      "title": "Sex and the Spirit World",
      "description": "In this mini episode we explore several aspects of sex. How do connective or poor sexual relationships affect our lives and our expression of wholeness? How is sex multi-dimensional? Fundamentalist religion represses sexuality to an unhealthy extent. We look at how breaking free of sexual dogma can release shame surrounding healthy sexuality, and how embracing our full sexual selves can be life changing. Good sexual relationships can provide a platform to learn more about needs, express vulnerability, grow deeper with our partners, and access parts of ourselves that are otherwise shamed, subdued, or dormant.",
      "release": "2022-02-26T21:37:18Z",
      "duration": "00:30:30.1680000",
      "explicit": false,
      "spotifyId": "1oRH9NXFDnp4YN5PjPCKvS",
      "appleId": 1000552317994,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1oRH9NXFDnp4YN5PjPCKvS",
        "apple": "https://podcasts.apple.com/podcast/sex-and-the-spirit-world/id1538182396?i=1000552317994"
      }
    },
    {
      "id": "3a57b624-9511-45ff-bf82-28ce1bff6c56",
      "title": "Parenting and Marriage After CUT with Joe Meyers",
      "description": "How does “ascension culture” potentially create stumbling blocks for marriage? We explore how one young parent saw multiple divorces while growing up in Church Universal and Triumphant (CUT) and how he’s used his experiences to become a better parent and spouse.",
      "release": "2022-02-14T06:32:34Z",
      "duration": "01:48:13.2110000",
      "explicit": false,
      "spotifyId": "3hskPiUBvBJeIljirgwlbx",
      "appleId": 1000551002553,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hskPiUBvBJeIljirgwlbx",
        "apple": "https://podcasts.apple.com/podcast/parenting-and-marriage-after-cut-with-joe-meyers/id1538182396?i=1000551002553"
      }
    },
    {
      "id": "cb62e08b-3536-4ef2-b7b2-ae9e05abdaba",
      "title": "Spiritual Materialism",
      "description": "In this “mini” episode we discuss how Spiritual Materialism affected the outlook, behavior, and overarching beliefs of CUT church members and our parents. Topics include: -- Defining Spiritual Materialism -- How CUT has their own version of the Law of Attraction and why this is problematic -- Magical thinking and its influence / an infantile view of the world and how things are affecting you -- How Purism is linked to our topic -- How only putting out positive intentions and doing rhythmic chanting (decrees) has limited effects -- How the Hindu caste system is reflected in CUT hierarchy and their modified theology of karma -- How decrees (rhythmic chanting) are part of spiritual materialism -- Hierarchies of graduation -- How doing getting professional mental health support comes down to the willingness of the individual, and how some people were encouraged to do it -- How some mental health conditions are viewed as weakness and being caused by invisible evil spirits called “entities” -- Beliefs about if you are failing it is because you are failing spiritually -- In the last four minutes we give a summary and recap of what spiritual materialism is and why it’s harmful",
      "release": "2022-02-01T21:45:33Z",
      "duration": "00:25:17.5680000",
      "explicit": false,
      "spotifyId": "0jnZwUJ6rswQkUPRhfxDqT",
      "appleId": 1000549708734,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jnZwUJ6rswQkUPRhfxDqT",
        "apple": "https://podcasts.apple.com/podcast/spiritual-materialism/id1538182396?i=1000549708734"
      }
    },
    {
      "id": "cb3db6fe-9476-4703-8ab8-382c318e4a31",
      "title": "Forging a New Philosophy with Leif Christian",
      "description": "Our guest Leif Christian has experienced the world of two fringe religions, Church Universal and Triumphant, and an offshoot organization, the Hearts Center. We discuss psychological impacts of church exposure, what \u0022decrees\u0022 were, guilt and judgement, the impact of being \u0022special\u0022, personal responsibility, some reasons why members lean right wing, political obsession in the Hearts Center, the \u0022Golden Age\u0022 implications, and how people can decide a way forward in their lives. Leif was six years old during the bomb shelter cycle in 1990.",
      "release": "2020-12-17T04:08:17Z",
      "duration": "02:21:19.7630000",
      "explicit": false,
      "spotifyId": "685ZDGBFlv6OUusIhv2oEO",
      "appleId": 1000502653998,
      "subjects": [
        "Church Universal and Triumphant",
        "The Hearts Center"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/685ZDGBFlv6OUusIhv2oEO",
        "apple": "https://podcasts.apple.com/podcast/forging-a-new-philosophy-with-leif-christian/id1538182396?i=1000502653998"
      }
    },
    {
      "id": "024610cf-ed79-4eee-9f35-f8594a0738bf",
      "title": "A Crisis of Health with Violet Corpron",
      "description": "Our guest is Violet Corpron, a young woman with a Masters Degree in Community Health who has experienced the worlds of two fringe religions, Church Universal and Triumphant, and an offshoot group called The Hearts Center, both of which are headquartered in southwest Montana. In this episode we’ll dive into how health matters are a big theme for people raised in the church. Vaccine avoidance, negative attitudes towards western medicine, skepticism of science, and resistance to getting health assistance and diagnosis are all issues that persist today.",
      "release": "2020-12-03T05:57:31Z",
      "duration": "01:32:53.8430000",
      "explicit": false,
      "spotifyId": "7iNPr0ysAtDxQG4apaVsSi",
      "appleId": 1000501175770,
      "subjects": [
        "Church Universal and Triumphant",
        "The Hearts Center"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7iNPr0ysAtDxQG4apaVsSi",
        "apple": "https://podcasts.apple.com/podcast/a-crisis-of-health-with-violet-corpron/id1538182396?i=1000501175770"
      }
    },
    {
      "id": "5fd16143-8c0e-4c02-ae08-b31d1d0c3e92",
      "title": "Leaving Harmful Religion with Sean Prophet \u0026 Christophe Difo",
      "description": "Our guests Sean Prophet and Christophe Difo of the Radical Secular discuss the process of leaving cults and harmful religions. We dive into their personal stories of leaving Church Universal and Triumphant and how they came to terms with embracing a more healthy worldview. Topics include: - Stories behind the scenes of the CUT hierarchy - Rationalizing the failure of prophecy - How bomb shelter lunacy led to disillusionment - Hypocrisy that undermined legitimacy - How homophobia can undermine fundamentalism and be a tipping point for people to leave religions. - How physical distance from believers helps one to break free - Inner conflict about social justice - The Just World fallacy - Taming the voice of shame - How members were publicly shamed for normal sexuality - Sexual repression - Inability to discuss life issues with family members - Hidden rage, anger, and insecurity of messengers - A cosmic/spiritual caste system",
      "release": "2020-11-24T06:10:31Z",
      "duration": "02:19:29.6390000",
      "explicit": false,
      "spotifyId": "4JfydE7O9qHOUeDxzYGrez",
      "appleId": 1000500030643,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JfydE7O9qHOUeDxzYGrez",
        "apple": "https://podcasts.apple.com/podcast/leaving-harmful-religion-with-sean-prophet-christophe/id1538182396?i=1000500030643"
      }
    },
    {
      "id": "4a458682-683e-4378-b0a7-ebfe3cdebcd6",
      "title": "Education and Isolation with Annie Newhouse",
      "description": "In part 1 of this interview we’re going to cover childhood education, higher education, isolation in rural Montana, facing political ideologies of devout CUT members, how Annie\u0027s experience parallels that of the author Tara Westover who wrote the book Educated, and mistrust of the medical world.",
      "release": "2020-11-18T06:08:15Z",
      "duration": "00:55:47.6400000",
      "explicit": false,
      "spotifyId": "3pChJ6CX5LceYAJYSIZANh",
      "appleId": 1000499128153,
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3pChJ6CX5LceYAJYSIZANh",
        "apple": "https://podcasts.apple.com/podcast/education-and-isolation-with-annie-newhouse-part-2/id1538182396?i=1000499128153"
      }
    },
    {
      "id": "3122d4f8-7871-4d38-b298-e6e17c6ac610",
      "title": "Education and Isolation with Annie Newhouse - Part 2",
      "description": "In part 2 of our interview with Annie, we chat about food choices within Church Universal and Triumphant, boundary issues with parents, why it\u0027s hard and painful to leave a cult or religion, why people get sucked in QAnon, narcissistic parents, and how talking about our traumas can help foster healing and community.",
      "release": "2020-11-17T03:35:47Z",
      "duration": "00:46:17.8310000",
      "explicit": false,
      "spotifyId": "397G9KAhTkFXcH2EwM645h",
      "appleId": 1000498956584,
      "subjects": [
        "Church Universal and Triumphant",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/397G9KAhTkFXcH2EwM645h",
        "apple": "https://podcasts.apple.com/podcast/education-and-isolation-with-annie-newhouse/id1538182396?i=1000498956584"
      }
    },
    {
      "id": "5f0df274-c2d0-436e-979e-6bd7ae995d85",
      "title": "Spiritual Trauma and Our Current Political Climate",
      "description": "For this pilot episode, I\u0027m joined by co-host Justice Bartlett of Playfully Conscious in Montana. She and I both grew up in Church Universal and Triumphant (CUT), the largest fringe religion to ever establish a presence in Montana. In the late 1980\u0027s their leader Elizabeth Prophet warned of possible nuclear war and the members entered bomb shelters in 1990 for two days to prepare for a nuclear holocaust. She was nine years old when her family went underground to prepare for the end of the world. Episode topics include: - Her experience when the members entered the bomb shelters with CUT - How does a person find their identity after leaving a cult or religion - What coping mechanisms do people have surrounding religious dogma - How do people heal from PTSD experienced in childhood surrounding spirituality? - How cognitive dissonance allows people to stay in harmful religions - How Toxic Positivity plays into the belief system - Her article in the Elephant Journal: Narcissism: Unraveling the Link between Trump, Trauma \u0026 Cult Mentality - The adoration for Trump inside the CUT membership - Why people bond to Trump as a leader Read more of Justice’s deep writing at: https://www.elephantjournal.com/profile/justice-bartlett/ Or connect with her at: illuminationwithjustice.com",
      "release": "2020-10-29T06:06:04Z",
      "duration": "01:15:56.8560000",
      "explicit": false,
      "spotifyId": "7MuwoXjKg6smn5Fq2V1s4E",
      "appleId": 1000496620178,
      "subjects": [
        "Church Universal and Triumphant",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MuwoXjKg6smn5Fq2V1s4E",
        "apple": "https://podcasts.apple.com/podcast/spiritual-trauma-and-our-current-political-climate/id1538182396?i=1000496620178"
      }
    }
  ]
}