{
  "_ts": 0,
  "id": "e494f9b3-e4b0-47e7-adc3-c01e940c4612",
  "name": "Bloomberg Quicktake",
  "youTubeChannelId": "UChirEOpgFCupRAk5etXqPaA",
  "episodes": [
    {
      "id": "67d859ff-283d-4cfb-8cf5-408fc4709609",
      "title": "Prosecutor Praises Victims’ Courage After NXIVM Leader Keith Raniere Sentenced",
      "description": "Disgraced self-improvement guru Keith Raniere, whose NXIVM followers included millionaires and Hollywood actors, was sentenced to 120 years on Tuesday for turning some adherents into sex slaves branded with his initials.\n\nU.S. District Judge Nicholas Garaufis handed down the sentence in federal court in Brooklyn after a lengthy hearing featuring statements by victims of a sex-trafficking conspiracy that resulted in Raniere’s conviction last year.\n\nProsecutors had sought life in prison while defense lawyers said he should face 15 years behind bars.\n\nRaniere, 60, had shown no remorse, with his lawyers telling the judge before the sentencing that their client wasn’t sorry “for his conduct or his choices.”\n\nThe sentencing culminated several years of revelations about Raniere’s program, NXIVM, which charged thousands of dollars for invitation-only self improvement courses at its headquarters near Albany, New York, along with branches in Mexico and Canada. Adherents included millionaires and Hollywood actresses willing to endure humiliation and pledge obedience to the defendant as part of his teachings.\n\nNXIVM has been the subject of two TV documentary series this year, HBO’s “The Vow,” and the Starz series “Seduced: Inside the NXIVM Cult.”\n\nProsecutors said Raniere led what amounted to a criminal enterprise, inducing shame and guilt to influence and control co-conspirators who helped recruit and groom sexual partners for Raniere. He was convicted on charges including racketeering, alien smuggling, sex trafficking, extortion and obstruction of justice.\n\nThey said that among other crimes, Raniere began a sexual relationship in 2005 with a 15-year-old girl and confined another teenager to a room for nearly two years.\n\nRaniere had come under harsh attack on Tuesday from former followers during sentencing in his sex-trafficking case.\n\nIndia Oxenberg, the daughter of “Dynasty” actress Catherine Oxenberg, called him an “entitled little princess” and a sexual predator and lamented that she “may have to spend the rest of my life with Keith Raneire’s initials seared into me.”\n\nThe likelihood of leniency had seemed to dissipate with the recent sentencing of Clare Bronfman, 41, an heir to the Seagram’s liquor fortune, for her role in what has been described by some ex-members as a cult. Bronfman was sentenced to nearly seven years in prison. Prosecutors had only sought five years.\n\nEx-followers told the judge that Bronfman for years had used her wealth to try to silence NXIVM defectors.\n\nReniere’s followers called him “Vanguard.” To honor him, the group formed a secret sorority comprised of female “slaves” who were branded with his initials and ordered to have sex with him, the prosecutors said. Women were also pressured into giving up embarrassing information about themselves that could be used against them if they left the group.\n\nAlong with Bronfman, Raniere’s teachings won him the devotion of Hollywood actors including Allison Mack of TV’s “Smallville.” Mack also has pleaded guilty and is awaiting sentencing.\n\nIn a sentencing submission, lawyers for Reniere said he “continues to assert his complete innocence to these charges.”\n\nThey wrote that his jury conviction at an unfair trial resulted from a media campaign involving witnesses who were motivated to testify falsely as part of a “heavy-handed prosecution that threatened potential defense witnesses.”\n\nHis lawyers said the life prison term prosecutors sought was excessive.\n\n“No one was shot, stabbed, punched, kicked, slapped or even yelled at,” they said. “Despite the sex offenses, there is no evidence that any woman ever told Keith Raniere that she did not want to kiss him, touch him, hold his hand or have sex with him.”\n\nSubscribe to our YouTube channel: https://bit.ly/2TwO8Gm\n\nQUICKTAKE ON SOCIAL:\nFollow QuickTake on Twitter: twitter.com/quicktake\nLike QuickTake on Facebook: facebook.com/quicktake\nFollow QuickTake on Instagram: instagram.com/quicktake\nSubscribe to our newsletter: https://bit.ly/2FJ0oQZ\nEmail us at quicktakenews@gmail.com\n\nQuickTake by Bloomberg is a global news network delivering up-to-the-minute analysis on the biggest news, trends and ideas for a new generation of leaders.",
      "release": "2020-10-27T21:06:05Z",
      "duration": "00:01:14",
      "explicit": false,
      "youTubeId": "Gc0mgW2vKS4",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Gc0mgW2vKS4"
      }
    }
  ]
}