{
  "id": "45adddcf-3570-4371-84ba-ea866f0305ce",
  "name": "Bloomberg Originals",
  "youTubeChannelId": "UCUMZ7gohGI9HcU9VNsr2FJQ",
  "episodes": [
    {
      "id": "7471ad37-b074-49c8-8b7c-6e0ba08372cd",
      "title": "The Trading Guru and His Money-Losing Disciples",
      "description": "IM Academy was a global phenomenon, claiming it could make anyone a top trader. Its founder, Chris Terry, a self-made trader turned multimillionaire who flaunted luxury cars, private jets and apartments across continents, said IM was more than just a path to financial freedom. It was a worldview. While Terry has made millions, 94% of IM\u0027s members lose money. Now, the company is under investigation.\n\nRead more about the IM Academy saga on Bloomberg:\nhttps://www.bloomberg.com/news/features/2024-05-14/the-stock-market-multilevel-marketing-company-for-teens?srnd=fixed-income\n--------\nLike this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1\n\nGet unlimited access to Bloomberg.com for $1.99/month for the first 3 months: https://www.bloomberg.com/subscriptions?in_source=YoutubeOriginals\n\nBloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it. \n\nSubscribe for business news, but not as you\u0027ve known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.\n\nVisit our partner channel Bloomberg Quicktake for global news and insight in an instant.",
      "release": "2024-05-14T09:26:53Z",
      "duration": "00:08:41",
      "explicit": false,
      "youTubeId": "P4PfO7qHJVY",
      "subjects": [
        "IM Academy",
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P4PfO7qHJVY"
      }
    }
  ]
}