{
  "id": "9a29b709-e314-43ef-9c15-e6b3a3aabb9b",
  "name": "Blu Radio",
  "youTubeChannelId": "UCUYokk2dJxFZf7NgxTL-ROg",
  "episodes": [
    {
      "id": "855e0086-abb6-436d-91c9-5ad21f285bc0",
      "title": "¿Qué es la secta Lev Tahor y cómo llegó a Colombia?",
      "description": "Un operativo conjunto entre Migración Colombia, el Gaula Militar y el Instituto Colombiano de Bienestar Familiar (ICBF) permitió rescatar a 17 menores que estaban bajo custodia de integrantes de Lev Tahor, una secta ortodoxa judía conocida internacionalmente por estar asociada a casos de abusos, matrimonios forzados de menores y violaciones sistemáticas de derechos humanos. El grupo había llegado al país a inicios de octubre y se encontraba instalado en un hotel del municipio de Yarumal, norte de Antioquia, donde permanecían en condiciones de salubridad precarias.\n\nLa directora de Migración Colombia, Gloria Arriero, explicó en entrevista con Mañanas Blu que la alerta inicial llegó desde la regional Antioquia-Chocó, donde se reportó la presencia inusual de extranjeros pertenecientes a esta comunidad. “Nos llega una información (…) de la llegada de esta secta (…) y de inmediato nuestro grupo de verificaciones inicia el proceso investigativo”, precisó.\n\n¡Ahora la radio no solo se escucha, también se ve! En Blu le ponemos cara a la opinión, al debate, al humor, los deportes y al entretenimiento. ¡Le ponemos cara a la radio! Siga en directo la señal en vivo de nuestra programación.\n\nNoticias en vivo de Colombia y el mundo, suscríbase [GRATIS] a nuestro canal en YouTube: http://bit.ly/2CFF7Fo y encuentre las últimas noticias en Colombia, el mundo y mucho más.\n\nBLU RADIO EN VIVO HOY |  #LePonemosCaraalaRadio\n\nSíganos en Google Noticias: http://bit.ly/2lM3iLH\n\nSíganos en redes sociales:\nFacebook: http://www.facebook.com/BluRadioColombia \nInstagram: @BluRadio http://instagram.com/bluradio \nTwitter: @BluRadioCo http://www.twitter.com/BluRadioCo \n\nÚltimas noticias de hoy en Colombia: https://www.bluradio.com\n\nNuestra red de canales en YouTube:\nNoticias Caracol en vivo: http://bit.ly/2Jhc3oO Suscribirse\nCaracol en vivo: http://bit.ly/2CHpld2 Suscribirse \nGol Caracol: http://bit.ly/2yAIGcU Suscribirse\nShock: http://bit.ly/2CHNKzi Suscribirse\nLa Kalle en vivo: http://bit.ly/2JkgfEz Suscribirse\nCaracol Play: http://bit.ly/2SkyjlM Suscribirse\nEl Espectador: http://bit.ly/2D4rkt7 Suscribirse\n\n- - - - - - - - - - - - - -\n\nSiga nuestra programación, Blu Radio en vivo y en directo: \nMañanas Blu con Néstor Morales EN VIVO\nMañanas Blu con Camila Zuluaga EN VIVO\nMeridiano Blu EN VIVO\nBlog Deportivo EN VIVO\nVoz Populi EN VIVO\nbluradio.com.co EN VIVO\n\nBlu Radio: 89.9 FM en Bogotá.\n\nSiga en \u0022Sí se lo perdió\u0022 las noticias más importantes de la semana en vivo, de lunes a viernes, a las 7 p.m. en nuestro canal de YouTube.",
      "release": "2025-11-24T13:14:27Z",
      "duration": "00:13:02",
      "explicit": false,
      "youTubeId": "IPBa3d6_PG4",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IPBa3d6_PG4"
      }
    }
  ]
}