{
  "id": "e338fc01-666c-41fa-950e-3f373a8ffafb",
  "name": "Body Bags with Joseph Scott Morgan",
  "spotifyId": "385AEt9XDYJoCyWtGZo3bw",
  "appleId": 1587763116,
  "episodes": [
    {
      "id": "3efa6a79-6a43-4ba5-aa3a-aa1e562dc399",
      "title": "Jonestown: Vacation Destination? If Thirsty, \u0022Don\u0027t Drink the Kool-Aid\u0022",
      "description": "909 people, including 267 children, died by suicide or were murdered by cyanide injection on November 18, 1978, at \u0022The Peoples Temple Agricultural Project\u0022, better known by the unofficial name \u0022Jonestown\u0022 after the leader of the group, Jim Jones. Joseph Scott Morgan and Dave Mack discuss the group, how they ended up in the jungle of Guyana, and how most of the men, women, and children, died. Professor Morgan explains how Dr. William Eckert described the \u0022smell of death\u0022 a mile away and 2000 feet in the air in a helicopter as he was arriving at the facility, what took place in identifying the dead, the condition of the bodies that were exposed to the elements, and what it would have been like for the victims who \u0022drank the kool-aid\u0022. Oddly enough, the phrase \u0022drink the kool-aid\u0022, referring to people blindly following leadership regardless of the truth, isn\u0027t correct. The people of Jonestown did not drink \u0022Kool-Aid\u0022. They drank a cheap, knock-off version of Kool-Aid called Flavor Aid. Transcribe Highlights 00:01.72 Introduction - environment 01:42.95 Jonestown \u0022Don\u0027t Drink the Kool-Aid\u0022 05:16.89 Remembering the reporting of Jonestown Suicide 09:41.90 Describing bloated bodies 10:34.71 What is left of Jonestown 12:18.99 Jim Jones cultivated political relationships 16:25.53 Jonestown was very isolated 20:06.23 Flies would be all over the scene 25:28.77 Have to determine how people were killed 29:54.63 Rep Leo Ryan killed at airstrip 6 miles from Jonestown 34:47.87 Jim Jones was not a \u0022man of the cloth\u0022 39:20.62 Value of Dark Tourism 40:25.99 Conclusion See omnystudio.com/listener for privacy information.",
      "release": "2025-07-16T11:00:00Z",
      "duration": "00:52:59.4670000",
      "explicit": false,
      "spotifyId": "1vIsbMamjrUQp1VMniCC0g",
      "appleId": 1000717512591,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1vIsbMamjrUQp1VMniCC0g",
        "apple": "https://podcasts.apple.com/podcast/jonestown-vacation-destination-if-thirsty-dont-drink/id1587763116?i=1000717512591"
      }
    }
  ]
}