{
  "id": "cda07bf7-e282-40a0-8e39-d99b1e3337dd",
  "name": "bongi cheele",
  "youTubeChannelId": "UCY9fvC5LCkcN9a7eQ6YDzzw",
  "episodes": [
    {
      "id": "65c1a29e-8d4c-48bb-9526-5071ebc7ea33",
      "title": "The DOOMSDAY Cult With The HIGHEST Death Toll | The African Jonestown",
      "description": "Imagine a village in the heart of Uganda, where whispers of prophecy and visions of the apocalypse spread like wildfire. In the late 1980s, a group led by Credonia Mwerinde and Joseph Kibwetere would emerge, claiming to have divine knowledge that the end of the world was near. Followers flocked to them, abandoning their lives, homes, and even families, believing salvation lay in strict obedience to the Ten Commandments. But as the year 2000 approached, things took a dark and tragic turn. Today, we’re uncovering the unsettling story of the Movement for the Restoration of the Ten Commandments of God—a tale of faith, manipulation, and a deadly promise of paradise that ended in unimaginable horror.\n\nDISCLAIMER: THIS VIDEO IS NOT MEANT TO OFFEND OR DISRESPECT ANYONE! IT IS PURELY FOR EDUCATIONAL PURPOSES AND EVERY BIT OF INFORMATION WAS GOTTEN ON THE INTERNET AND SIMPLY COMPILED FOR THE MAKING OF THIS VIDEO. \nN.B: ALL THE INFORMATION WAS GOTTEN OFF THE INTERNET HOWEVER, PLEASE DO NOT TAKE ANY ACTION IN RELIANCE TO THIS VIDEO AS THE FACTS MAY NOT BE 100% ACCURATE. \n\n🛑 SUBSCRIBE IF YOU LIKE TRUE CRIME 🛑\n🛑 PLEASE DONATE TO MY CHANNEL AND HELP A SISTER OUT http://buymeacoffee.com/bongicheele 🛑 or just support me by following my business page on instagram @bngcrochets https://www.instagram.com/bngcrochets/\n\n\nFOLLOW ME ON MY SOCIALS\nINSTAGRAM @bongi.asf ➡ https://www.instagram.com/bongi.asf/\nFACEBOOK @therealBongiCheele ➡ https://www.facebook.com/therealBongiCheele/\nTWITTER @BongiAsf ➡ https://twitter.com/bongicheele\n\n\n____\nA B O U T  M E\n🌜HI!! My name is Bongi and i post true crime videos on this channel on Wednesdays at around 3pm/5pm CAT. \nI\u0027ve been interested in true crime for as long as i can remember, and that\u0027s kinda what prompted me to study law. however, soon after enrolling into law school, i realised that i really didn\u0027t like what i was doing and so, as odd as it may be, i started watching a lot of true crime youtubers, and that\u0027s when i discovered youtubers like Bailey Sarian, Eleanor Neale and Kendall Rae. I used to think that all there was to true crime was long documentaries that sound monotonous and are boring to watch, but maan, these three ladies changed my perspective. i do wanna give all the credit to the three of them as they each inspired me to start my own true crime YouTube, and i\u0027ve never been happier. my style is similar to Eleanor\u0027s, with a hint of Kendall. (just felt like adding that in) anyway, please subscribe to my channel and help me grow.\n\n\n#truecrime #truecrimestories #untoldstories",
      "release": "2024-10-31T12:00:59Z",
      "duration": "00:26:48",
      "explicit": false,
      "youTubeId": "ncE3nnBdo0M",
      "subjects": [
        "Movement for the Restoration of the Ten Commandments of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ncE3nnBdo0M"
      }
    },
    {
      "id": "dd63859b-8ab3-428d-a527-74055cf1a6f9",
      "title": "The EVIL Krugersdorp Cult Killers | Satanic Cult in South Africa",
      "description": "The Krugersdorp Killers are probably the scariest cult I\u0027ve heard of... so close to home! The Krugersdorp cult, Aka Electus per deus were a cult in Krugersdorp led by Cecilia Steyn. It comprised of members: Marinda Steyn, Le Roux Steyn, Marcel Steyn, Zak Valentine and Mikaela Valentine, among others. The Krugersdorp cult is suspected to have been a Satanic cult operating under the guise of Christianity. The Krugersdorp cult / Krugersdorp killers have committed 11 murders, all of which they were all convicted for, but it wasn\u0027t an easy task to nail the Krugersdorp Cult killers. Join me as we speak of the messsssssy messy messy Electus per deus/ Krugersdorp Killers/ Krugersdorp Cult.\n\nIn memory of their victims: \nJoyce Boonzaier\nNatacha Burger\nRev. Reginald Bendixen\nMikaela Valentine \nJarod Jackson\nPeter and Joan Meyer\nGlen McGregor\nAnthony Scholefield\nKevin McAlpine \nHanlé Lategan.\n\nChapters\n00:00 INTRO\n02:41 Appointment Murders (2016)\n13:24 Overcomers through Christ\n32:03 Satanic Murders (2012)\n43:05 Le Roux\u0027s confession reveals more murders\n50:18 First 3 plead guilty\n51:36 The trial begins\n58:47 END\n\nDISCLAIMER: THIS VIDEO IS NOT MEANT TO OFFEND OR DISRESPECT ANYONE! IT IS PURELY FOR EDUCATIONAL PURPOSES AND EVERY BIT OF INFORMATION WAS GOTTEN ON THE INTERNET AND SIMPLY COMPILED FOR THE MAKING OF THIS VIDEO. \nN.B: ALL THE INFORMATION WAS GOTTEN OFF THE INTERNET HOWEVER, PLEASE DO NOT TAKE ANY ACTION IN RELIANCE TO THIS VIDEO AS THE FACTS MAY NOT BE 100% ACCURATE. \n\n🛑 SUBSCRIBE IF YOU LIKE TRUE CRIME 🛑\n🛑 PLEASE DONATE TO MY CHANNEL AND HELP A SISTER OUT http://buymeacoffee.com/bongicheele 🛑 or just support me by following my business page on instagram @bngcrochets https://www.instagram.com/bngcrochets/\n\n\nFOLLOW ME ON MY SOCIALS\nINSTAGRAM @bongi.asf ➡ https://www.instagram.com/bongi.asf/\nFACEBOOK @therealBongiCheele ➡ https://www.facebook.com/therealBongiCheele/\nTWITTER @BongiAsf ➡ https://twitter.com/bongicheele\n\nEMAIL ME (BUSINESS ONLY) ON bongicheele.yt@gmail.com\nCase suggestions may be dropped in the comment section!\n\n____\nA B O U T  M E\n🌜HI!! My name is Bongi and i post true crime videos on this channel on Wednesdays at around 3pm/5pm CAT. \nI\u0027ve been interested in true crime for as long as i can remember, and that\u0027s kinda what prompted me to study law. however, soon after enrolling into law school, i realised that i really didn\u0027t like what i was doing and so, as odd as it may be, i started watching a lot of true crime youtubers, and that\u0027s when i discovered youtubers like Bailey Sarian, Eleanor Neale and Kendall Rae. I used to think that all there was to true crime was long documentaries that sound monotonous and are boring to watch, but maan, these three ladies changed my perspective. i do wanna give all the credit to the three of them as they each inspired me to start my own true crime YouTube, and i\u0027ve never been happier. my style is similar to Eleanor\u0027s, with a hint of Kendall. (just felt like adding that in) anyway, please subscribe to my channel and help me grow. i currently have 1.43k subscribers, and your subscription would really REALLY mean a lot to me❤️.✨\n____",
      "release": "2024-06-19T12:00:01Z",
      "duration": "01:00:40",
      "explicit": false,
      "youTubeId": "0YeRxe9RpFc",
      "subjects": [
        "Electus per Deus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0YeRxe9RpFc"
      }
    }
  ]
}