{
  "id": "73916f5c-5425-4d6f-9737-88cd4f739318",
  "name": "Booked On Rock",
  "spotifyId": "19x6NxNTNUZmOeZSIQrpt0",
  "appleId": 1575636370,
  "episodes": [
    {
      "id": "c5ff73b1-b5d6-4b8b-883b-37b77689dd6a",
      "title": "Manson Unmasked: Motive, Myth, and Rock ’n’ Roll [Episode 356]",
      "description": "In this episode, we take a deep dive into the dark legacy of Charles Manson, exploring his motives, the psychology behind his crimes, and the conspiracy theories that still surround the case—while focusing on the surprising role rock music played in shaping his worldview. We’re joined by Nicholas Tochka, author of The Musical Lives of Charles Manson, who unpacks Manson’s obsession with 1960s music, his ties to major artists of the era, and how he twisted cultural influences into a dangerous ideology, revealing the unsettling intersection of crime, myth, and rock ’n’ roll. Purchase a copy of The Musical Lives of Charles Manson: The Beatles, the Beach Boys, and the Invention of the Sixties — or, No Sense Makes Sense Follow Nicholas Tochka: Bluesky Facebook X ---------- \u0026#x1f3a7; Listen Ad-Free on Patreon Support Booked On Rock and get every new episode completely commercial-free with the Backstage Pass. Join here: https://www.patreon.com/cw/BookedOnRock \u0026#x1f6d2; Old Glory - Iconic music and sports fan merch \u0026#x1f4b0; Get 15% OFF | Promo Code: BOOKEDONROCK https://oldglory.com/discount/BOOKEDONROCK Booked On Rock is part of The Boneless Podcasting Network BookedOnRock.com The Booked On Rock Store The Booked On Rock YouTube Channel Follow The Booked On Rock with Eric Senich: BLUESKY FACEBOOK INSTAGRAM TIKTOK X Find Your Nearest Independent Bookstore Contact The Booked On Rock Podcast: thebookedonrockpodcast@gmail.com The Booked On Rock Music: “Whoosh” by Crowander / “Last Train North” \u0026 “No Mercy” by TrackTribe",
      "release": "2026-02-06T00:43:50Z",
      "duration": "00:49:34.5890000",
      "explicit": false,
      "spotifyId": "6lUifOm0yI61eycTNq5IKo",
      "appleId": 1000748453243,
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6lUifOm0yI61eycTNq5IKo",
        "apple": "https://podcasts.apple.com/podcast/manson-unmasked-motive-myth-and-rock-n-roll-episode-356/id1575636370?i=1000748453243"
      }
    }
  ]
}