{
  "id": "0edc10b6-e576-4b8c-a90f-22e13a624f57",
  "name": "Bookwild",
  "spotifyId": "1r72aXE4JEjcwGeEjVosvI",
  "appleId": 1648192032,
  "youTubeChannelId": "UC-gShTy20PVhXRpfNF33SKw",
  "episodes": [
    {
      "id": "530e2b48-1761-4e65-bd57-97c88ca95271",
      "title": "Allison Buccola\u0027s The Ascent: Cults, Murder and Postpartum Depression",
      "description": "This week, I got to talk with Allison Bucola about her new thriller The Ascent. We dive into her cult research, the long term damage of growing up in a cult, and how Ophelia\u0027s postpartum mental health contributed to the story. The Ascent Synopsis Twenty years ago, the members of a reclusive commune outside Philadelphia vanished without a trace. The mystery of their disappearance has never been solved. No sightings of the members were ever verified, and no bodies ever found. But the group did leave one thing behind: a twelve-year-old girl wandering alone on the side of the road in search of her lost family. In the years since that morning, Lee Burton has tried to put the pain of her past behind her. She has built a new identity for herself, with a doting husband and seven-month-old daughter, Lucy. No one in her life now knows about her connection to “the cult that went missing,” not even her husband. But new motherhood is proving a bigger challenge than she anticipated. She doesn\u0027t want to let Lucy out of her sight even for a moment. She can\u0027t return to work. She\u0027s not sleeping, and she\u0027s starting to have paranoid thoughts of Lucy being harmed. Then a stranger shows up on her doorstep, offering to finally answer all of Lee’s questions about her past—if she could only trust that the woman is who she says she is. As she digs deeper into the woman\u0027s history, the safe, stable life that Lee has constructed for herself threatens to shatter. In The Ascent, Allison Buccola has crafted a nerve-rattling thriller about motherhood, identity, and the truths we think we know about our families. Check Out Author Social Media Packages Check out the Bookwild Community on Patreon Check out the Imposter Hour Podcast with Liz and Greg Follow @imbookwild on Instagram Other Co-hosts On Instagram: Gare Billings @gareindeedreads Steph Lauer @books.in.badgerland Halley Sutton @halleysutton25 Brian Watson @readingwithbrian",
      "release": "2025-06-03T16:12:57Z",
      "duration": "00:38:10.8080000",
      "explicit": true,
      "spotifyId": "67HYJgG3v2ubJ1gfLb6207",
      "appleId": 1000711041457,
      "youTubeId": "8S2DKZ5ZcoU",
      "urls": {
        "spotify": "https://open.spotify.com/episode/67HYJgG3v2ubJ1gfLb6207",
        "apple": "https://podcasts.apple.com/podcast/allison-buccolas-the-ascent-cults-murder-and/id1648192032?i=1000711041457",
        "youtube": "https://www.youtube.com/watch?v=8S2DKZ5ZcoU"
      }
    },
    {
      "id": "41c9233e-c14a-46d9-a3d3-7f3472401872",
      "title": "Elizabeth Rose Quinn\u0027s Follow Me: A Thrilling Takedown of Mommy-Influencer Culture",
      "release": "2025-04-01T14:00:40Z",
      "duration": "00:45:13",
      "explicit": false,
      "spotifyId": "1QWuiFFtQQ6MPrCGBK02gk",
      "appleId": 1000701735094,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1QWuiFFtQQ6MPrCGBK02gk",
        "apple": "https://podcasts.apple.com/podcast/elizabeth-rose-quinns-follow-me-a-thrilling/id1648192032?i=1000701735094"
      }
    }
  ]
}