{
  "id": "8321d73d-0d8e-449b-b350-d610d77d1b57",
  "name": "Bookable Space",
  "spotifyId": "5ffPfdBOheGh5imXJ1fCMz",
  "appleId": 1642345254,
  "episodes": [
    {
      "id": "b560fbf2-14c4-44c6-a9e3-a13410352850",
      "title": "Bookable Space with Annie Dawid",
      "description": "In this episode of Bookable Space, host Yvonne Battle-Felton is joined by Annie Dawid. Annie reads from Paradise Undone: A Novel of Jonestown. About the book Paradise Undone, A Novel of Jonestown is a part real, part imagined retelling of the tragic events that led to the USA\u0027s biggest single loss of civilian life in the twentieth century. On November 18th 1978, nine hundred and nine people died in the Guyanese jungle. Published on the 45th anniversary, Annie Dawid’s compelling story of Jonestown explores the tragedy through the voices of four protagonists—Marceline Baldwin Jones and three other members of Peoples Temple. Drawing on extensive research and interviews, Annie Dawid blends fact and fiction, using real and composite characters to tell a story about the horrific mass murder/suicide that took place in the Guyanese jungle, all because of one man with a God complex. In the hostile racial environment of 1950s segregated America, Marceline Baldwin and Jim Jones promise to build a new Eden, based on ideals of fraternity and equality. But every Eden has its serpent. Having already made headlines as the first white couple in Indiana to adopt a black child, Marceline and Jim adopt five other non-white children and call themselves ‘the rainbow family’. Jones’ following grows: Peoples Temple gives hope to the poor, the miserable, alienated and disenfranchised. It soon outgrows Indiana and is uprooted to the jungle of Guyana. But when things start to fall apart, rampant egotist Jim Jones plans a mass-murder suicide mission. Where he goes, everyone must follow, even to the grave… About the Author Annie Dawid has published five books, including fiction, non-fiction, poetry and essays. She teaches at the University of Denver, University College master’s program in creative writing online from her home in very rural Colorado. Her focus on the murder/suicides at Jonestown in 1978, when she was a first-year undergraduate, dates from March 2004. At the University of North Dakota Writers Conference, where she was a Master-Teacher in residence, she met a friend of survivors of Jonestown. Subsequently, she immersed herself in research and changed the subject of her next novel to the Jonestown massacre. Years of study and writing followed before finishing Paradise Undone in time for the 30-year anniversary in 2008. Eventually, she met those survivors, who run the Jonestown Institute Archives, and, with them and many others, hopes to illuminate the lives of the 900\u0026#43; Peoples Temple members who died in the jungle, human beings not named Jim Jones. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-01T12:15:00Z",
      "duration": "00:26:41.5410000",
      "explicit": false,
      "spotifyId": "3nXOmKN52niiMXpcappEGr",
      "appleId": 1000643795145,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3nXOmKN52niiMXpcappEGr",
        "apple": "https://podcasts.apple.com/podcast/bookable-space-with-annie-dawid/id1642345254?i=1000643795145"
      }
    }
  ]
}