{
  "id": "ae17dfa3-88f1-4614-bd4e-f03e206492e8",
  "name": "BOOS",
  "youTubeChannelId": "UCc0kHafEIzm6PiqyrsC5lyg",
  "episodes": [
    {
      "id": "864e0d1b-d527-49b9-9c55-476ed4e4ebfe",
      "title": "Master Oh \u0026 Jasper Demollin: Koreaanse sekte gebruikt BN\u0027ers | BOOS S12E14",
      "description": "Plots dook hij overal op: de Zuid-Koreaanse spiritueel leider Master Oh. We zien hem de afgelopen tijd met regelmaat in de Nederlandse pers of geflankeerd door BN\u0027ers en influencers op social media.  Maar waarom omringen beroemde Nederlanders zich plotseling met deze Soon Tak Oh, zoals Master Oh echt heet. Waar komt hij ineens vandaan? Onder die BN\u0027ers ook Jasper Demollin, die eerder dit jaar aankondigt om te stoppen met de FOMO Show om zich volledig te gaan richten op de spirituele leer van Master Oh. \n \nDe afgelopen maanden deden wij onderzoek naar Master Oh en de stichting Sun Kyeong, de stichting waar zijn behandelingen worden georganiseerd, om uit te zoeken wat hier werkelijk speelt. We gingen undercover, spraken met oud-leden van Sun Kyeong en komen in contact met mensen van over de hele wereld. We krijgen bewijs in handen dat aantoont welke verborgen wereld er achter Master Oh en Sun Kyeong schuilgaat. \n \nDeze week een verhaal over valse hoop aan kwetsbare mensen, duizenden euro’s rekenen voor twijfelachtige behandelmethodes, juridische dreigementen tegen journalisten, criminele Koreaanse sekteleiders en verborgen geldstromen naar een vrouw in Zuid-Korea die zegt dat zij een God op aarde is. En dat alles verpakt in een hoopvolle boodschap door Master Oh.\n\nLees hier de wederhoor: https://bit.ly/masteroh\n\nOok boos? Of wil je klokkenluiden? Mail ons op boos@bnnvara.nl!\n\nJe wordt opgelicht. Een influencer levert jouw product niet. Een huisjesmelker maakt misbruik van de markt en jaagt jou op extra kosten. Je mag ergens homo zijn, maar niet homo doen. Je baas intimideert je op de werkvloer. Er moet een wet veranderen die jou en jouw leven in de weg zit. Het moet anders. Kortom: je bent boos! Weet ons dan te vinden, want wij helpen jou graag met grote én kleine problemen.\n\nElke dinsdag om 16:00 uur op dit kanaal!\n\nHier vind je onze website:\nhttps://npo3.nl/boos\n\nVolg ons ook op Instagram, TikTok en Linkedin:\nhttp://www.instagram.com/boosbnnvara\nhttp://www.instagram.com/debroervanroos\nhttps://www.tiktok.com/@boosbnnvara\nhttps://www.linkedin.com/company/boos-bnnvara\n\n00:00 INTRODUCTIE\n6:52 KANKER KRIJGEN DOOR KARMA\n20:30 10.000 EURO VOOR VOOROUDERGENEZING\n25:16 HOE EEN SEKTE BN’ERS INZET\n27:27 HET WARE GEZICHT VAN MASTER OH\n41:57 EEN EERSTE CONFRONTATIE\n47:18 BN’ERS BELLEN\n56:12 JASPER DEMOLLIN VERSCHUILT ZICH\n01:05:41 EEN SLOTWOORD",
      "release": "2025-12-02T15:00:34Z",
      "duration": "01:14:22",
      "explicit": false,
      "youTubeId": "EvvKr9zRonA",
      "subjects": [
        "Sun Kyeong"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EvvKr9zRonA"
      }
    }
  ]
}