{
  "id": "f0c3a848-5b10-433f-9fb3-c49dbb40067d",
  "name": "brainscrubbing",
  "youTubeChannelId": "UCLzVk4uffLuJ1RDZx3n4Asw",
  "episodes": [
    {
      "id": "7a6893f6-f55e-4e75-8403-a7f9d7623151",
      "title": "Inside Goenka Vipassana: Is it a cult?",
      "description": "Why do people ask if Goenka Vipassana is a cult?\n\nThis video examines Goenka-style Vipassana 10 day courses meditation through the lens of high-control systems, using established psychological and sociological frameworks — including Steven Hassan’s BITE Model and research on isolation, repetition, and suggestibility.\n\nThis is not an attack on meditation, and it is not a claim about intent.\nMany people report Vipassana as grounding, meaningful, and beneficial.\n\nAt the same time, others report distress, confusion, or psychological difficulty — particularly in highly controlled retreat environments involving silence, isolation, and exhaustion.\n\nRather than arguing over labels, this documentary asks simpler questions:\n\nHow is the environment structured?\n\nHow is behavior, information, and interpretation shaped?\n\nWhy does the “cult question” keep coming up — quietly, repeatedly — among participants?\n\nThe analysis focuses on structure and impact, not belief, and draws directly from:\n\nthe official Vipassana Code of Discipline\n\npeer-reviewed research on sensory restriction and influence\n\nfirst-person reports and documented concerns\n\nSources \u0026 References\n\nPrimary Materials\n\nCode of Discipline for Vipassana Courses\n(Source: Official Vipassana / Dhamma.org website — publicly available retreat guidelines)\n\nPsychological \u0026 Sociological Frameworks\n\nHassan, S. (2000). Combating Cult Mind Control\n\nLifton, R. J. (1989). Thought Reform and the Psychology of Totalism\n\nResearch on Isolation \u0026 Suggestibility\n\nZubek, J. P. (1969). Sensory Deprivation: Fifteen Years of Research\n\nWilloughby, W. L. (2007). Effects of Sensory Deprivation and Isolation on Cognition and Behavior\n\nImportant Mental Health Note\n\nIntensive meditation practices can sometimes trigger unexpected psychological distress, especially in silent, high-intensity retreat settings.\n\nIf you or someone you know is experiencing difficulty related to meditation practice, confidential, evidence-based support is available:\n\n👉 https://www.cheetahhouse.org\n\nCheetah House provides education, resources, and support for people navigating adverse or destabilizing experiences related to meditation.\n\nSeeking help is not a failure — it’s responsible.",
      "release": "2025-12-21T17:42:03Z",
      "duration": "00:07:39",
      "explicit": false,
      "youTubeId": "4OYxRtuIf3E",
      "subjects": [
        "S. N. Goenka"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4OYxRtuIf3E"
      }
    },
    {
      "id": "8afa42b5-355a-4430-b991-97c6426d5ff8",
      "title": "Inside Goenka Vipassana: The Experience That Broke Me",
      "description": "I attended a 10-day Goenka Vipassana meditaiton retreat, expecting peace and insight - but what I experienced was intense and unsettling, and far from what most people imagine. In this personal story and expose, I reveal the hidden dangers of Goenka Vipassana, the psychological challenges I faced, and the truth behind the serene exterior.\n\nThis video covers: \n\n-My firsthand terrifying experience at a 10-day Vipassana retreat.\n-The hidden dangers and psychological intensity of Goenka meditation.\n-Reflections on what Vipassana meditation doesn\u0027t tell you\n-The dangers of meditation, that nobody talks about.\n-We look at the teachings of Goenka and question whether they are universal and secular or religious.\n\nIf you\u0027re curious about Goenka\u0027s Vipassana, meditation retreats, or the psychological risks of intensive meditation, this video gives an honest, personal perspective.",
      "release": "2025-11-29T00:44:20Z",
      "duration": "00:19:06",
      "explicit": false,
      "youTubeId": "a93stqvqS5I",
      "subjects": [
        "S. N. Goenka"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=a93stqvqS5I"
      }
    }
  ]
}