{
  "id": "79066b43-b49c-4b8a-a5ce-40ec95eea275",
  "name": "Brainwash Be Gone! | Break free of religious trauma as a woman leaving high demand religion",
  "spotifyId": "0SuQFRa0jAVSwMN3Ay9cIc",
  "appleId": 1796696187,
  "episodes": [
    {
      "id": "4d44454c-89dc-481c-9a68-bf1b59a72a43",
      "title": "Deconstructing \u0022Men are the head, but women are the neck\u0022 | Reclaiming your voice after spiritual abuse and leaving a high-demand religion",
      "description": "If you grew up in a high-control religion and are recovering from abuse, you might still find yourself self-censoring or managing others subtly instead of expressing your true needs. This episode deconstructs the \u0022men are the head, women are the neck\u0022 metaphor, unpacking how it fuels sexism and unhealthy communication patterns that linger even after leaving high-demand religions. Discover practical ways to reconnect with your feelings and needs, and replace manipulative or powerless behaviors with honest, empowering communication. We\u0027ll explore easy starter steps—from safe practice spaces to small everyday requests—that build your confidence and strengthen your self-worth. Press play now to embrace a kinder, clearer way to communicate, reclaim your voice, and take one meaningful action today toward healing and women\u0027s empowerment after spiritual abuse and religious trauma. Tags: Religious trauma, spiritual abuse, deconstruction, exmormon, exmo, exvangelical, recovering catholic, excatholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups, high control religion, cult, cult recovery, brainwashed, high demand religion, spiritual trauma, church abuse. Writer and Host: Clare Corado Voiceover Talent: Jason Kirkover Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-11-05T19:00:00Z",
      "duration": "00:17:19.9600000",
      "explicit": false,
      "spotifyId": "20duI526XxDOjqFQWs0vh1",
      "appleId": 1000735442878,
      "subjects": [
        "Cult Recovery",
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20duI526XxDOjqFQWs0vh1",
        "apple": "https://podcasts.apple.com/podcast/deconstructing-men-are-the-head-but-women-are-the/id1796696187?i=1000735442878"
      }
    },
    {
      "id": "3c574794-b29c-403b-8acd-5d06502f5271",
      "title": "“I know this church is true” deconstructed. | The role of blind faith in religious trauma and spiritual abuse in high demand religions",
      "description": "What if letting go of the need to be 100 percent certain is the very thing that finally gives you peace?\nIf you grew up in a high demand religion repeating statements like “I know this church is true,” you were trained to prize certainty over curiosity. This episode helps you recognize how that conditioning can fuel anxiety, people-pleasing, and black-and-white thinking—and how to replace it with grounded self-trust.\n• Understand why formulaic public declarations create pressure, cognitive dissonance, and a false sense of safety.\n• Spot the logical fallacies (circular reasoning, false dichotomies, bandwagon effects, and hypocrisy) inside compulsory certainty.\n• Learn practical reframes for embracing uncertainty so you can feel calm, present, and free—without needing absolute answers.\nPress play now to trade rigid certainty for deep, durable peace in under 20 minutes.\nTags: Religious trauma, spiritual abuse, deconstruction, exmormon, exmo, exvangelical, recovering catholic, excatholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups, high control religion, cult, cult recovery, brainwashed, high demand religion, spiritual trauma, church abuse.\nWriter and Host: Clare Corado\nVoiceover Talent: Jason Kirkover\nContact: Hugs@BrainwashBeGone.com\n Instagram: @brainwashbegone",
      "release": "2025-11-03T00:00:00Z",
      "duration": "00:15:48",
      "explicit": false,
      "spotifyId": "56Rji7QAbC0rW9ojlNEHVd",
      "appleId": 1000734938051,
      "subjects": [
        "Cult Recovery",
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/56Rji7QAbC0rW9ojlNEHVd",
        "apple": "https://podcasts.apple.com/podcast/i-know-this-church-is-true-deconstructed-the-role/id1796696187?i=1000734938051"
      }
    },
    {
      "id": "6a10ecaf-f4e5-42fc-bcdb-23a7f594177e",
      "title": "Am I Still a Good Person After Leaving Religion? Heal Spiritual Abuse, Trauma, and Shame from High Demand Religion",
      "description": "After you left your high-control group, do you secretly worry that leaving may have made you a \u0027bad\u0027 person? Spiritual abuse, religious trauma, and shame from high demand religions can impact our lives long after leaving. This episode speaks to that lingering fear by separating your personal morality from church attendance, so you can stop second-guessing yourself and start living by your own conscience with confidence. Recognize the common control tactics that tie \u0027goodness\u0027 to membership and how they keep you stuck. Rebuild trust in your own moral compass with practical reflection prompts and real-world examples. Release shame programmed by high-demand groups and reclaim autonomy, empathy, and critical thinking. Press play now to learn simple mindset shifts that will help you feel like a genuinely good person—without needing anyone’s permission. Tags: Religious trauma, spiritual abuse, deconstruction, exmormon, exmo, exvangelical, recovering catholic, excatholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups, high control religion, cult, cult recovery, brainwashed, high demand religion, spiritual trauma, church abuse. Writer and Host: Clare Corado Voiceover Talent: Jason Kirkover Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-10-29T07:00:00Z",
      "duration": "00:15:32.2050000",
      "explicit": false,
      "spotifyId": "2nbVHUGu2oHKzJtg8UiU9z",
      "appleId": 1000734008776,
      "subjects": [
        "Cult Recovery",
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2nbVHUGu2oHKzJtg8UiU9z",
        "apple": "https://podcasts.apple.com/podcast/am-i-still-a-good-person-after-leaving-religion/id1796696187?i=1000734008776"
      }
    },
    {
      "id": "995a53df-a244-4530-8cfe-23dead4a5262",
      "title": "Deconstructing “Submit to Your Husband” | Women’s empowerment as an antidote to spiritual abuse after leaving high-demand religions",
      "description": "Have you ever been told to “submit to your husband”? This episode of Brainwash Be Gone unpacks one of the most damaging and normalized teachings from high-control, high demand religions and reveals how it impacts women’s autonomy, self-worth, and relationships even after leaving religion. If you’ve ever struggled with people-pleasing, self-censorship, or guilt when standing up for yourself, this episode helps you understand where that conditioning came from—and how to release it. Clare explores how this rule strips women of adulthood, reinforces unhealthy power structures, and creates cycles of emotional and spiritual harm that extend across generations. Listeners will learn: - How the “submit to your husband” doctrine undermines personal sovereignty and reinforces control. - Why rejecting hierarchical conditioning restores emotional balance and mutual respect. - The empowering mindset shift that helps you reclaim authority over your life and relationships. Press play to uncover the freedom that comes when you step into your full self-authority and let go of learned submission for good. Tags: Religious trauma, spiritual abuse, deconstruction, exmormon, exmo, exvangelical, recovering catholic, excatholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups, high control religion, cult, cult recovery, brainwashed, high demand religion, spiritual trauma, church abuse. Writer and Host: Clare Corado Voiceover Talent: Jason Kirkover Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-10-26T23:00:00Z",
      "duration": "00:16:34.2980000",
      "explicit": true,
      "spotifyId": "6jvCt3m02RX4iiOZHAwH7K",
      "appleId": 1000733604269,
      "subjects": [
        "Cult Recovery",
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6jvCt3m02RX4iiOZHAwH7K",
        "apple": "https://podcasts.apple.com/podcast/deconstructing-submit-to-your-husband-womens-empowerment/id1796696187?i=1000733604269"
      }
    },
    {
      "id": "eeb16286-da2b-4f04-81dc-dd707ef35924",
      "title": "Heck yeah, “My Body is a Temple” | What women exvangelicals, exmormons, recovering catholics, and former jehovah’s witnesses need to recover from religious trauma and fully enjoy our bodies",
      "description": "Have you ever been told “your body is a temple” in a way that left you feeling ashamed, restricted, or disconnected from yourself? For many of us, this is part of our religious trauma. If you’re healing from high-control religion, rules about modesty, purity, and appearance can linger as anxiety, scrupulosity, and disconnection from your own desires. This episode reframes the metaphor so you can reclaim autonomy, rebuild trust with your body, and express yourself on your own terms. What you’ll get from this episode: • Reclaim personal authority over your body and choices—without apology. • Understand how shame-based modesty and purity codes fuel control, anxiety, and even scrupulosity. • Learn practical, compassionate ways to practice consent, set boundaries, and nurture genuine self-expression. Press play now to release inherited body shame and start honoring your body—exactly as you choose. Tags: Religious trauma, spiritual abuse, deconstruction, exmormon, exmo, exvangelical, recovering catholic, excatholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups, high control religion, cult, cult recovery, brainwashed, high demand religion, spiritual trauma, church abuse Writer and Host: Clare Corado Voiceover Talent: Jason Kirkover Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-10-22T07:00:00Z",
      "duration": "00:12:59.8330000",
      "explicit": false,
      "spotifyId": "0u7XqQzM5md8hkxaxGkSpG",
      "appleId": 1000732939413,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0u7XqQzM5md8hkxaxGkSpG",
        "apple": "https://podcasts.apple.com/podcast/heck-yeah-my-body-is-a-temple-what-women/id1796696187?i=1000732939413"
      }
    },
    {
      "id": "f5f54ecb-b524-483b-b943-671a79ca279e",
      "title": "“Motherhood is your highest purpose” can lead to low self-worth and religious trauma. How exvangelicals, excatholics, and exmormon women can choose an authentic life whether they have kids or not.",
      "description": "What if your worth has nothing to do with whether you become a mother, how many children you have, or how perfectly you parent? If you were taught that motherhood is your highest purpose, you might still feel pressure, guilt, or confusion when your real life does not match that script. This episode helps you untangle those messages so you can build a life that fits your values, whether that includes children, includes them later, or not at all. Three things you will gain from this episode: • A clear look at the hidden motives, logical fallacies, and double standards behind “motherhood is your highest purpose” • Practical ways to reclaim autonomy and identity beyond a single role while keeping space for motherhood if you choose it • Encouragement to design a multifaceted, meaningful life that supports both you and the people you love Press play to hear a compassionate, no‑shame breakdown that will help you release old conditioning and take your next step toward a life that is truly yours. Tags: Religious trauma, spiritual abuse, deconstruction, exmormon, exmo, exvangelical, recovering catholic, excatholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups, high control religion, cult, cult recovery, brainwashed, high demand religion, spiritual trauma, church abuse. Writer and Host: Clare Corado Voiceover Talent: Jason Kirkover Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-10-19T07:00:00Z",
      "duration": "00:15:32.8840000",
      "explicit": true,
      "spotifyId": "4e13DXbRWIILXkf4zpMzbE",
      "appleId": 1000732498105,
      "subjects": [
        "Evangelicalism",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4e13DXbRWIILXkf4zpMzbE",
        "apple": "https://podcasts.apple.com/podcast/motherhood-is-your-highest-purpose-can-lead-to-low/id1796696187?i=1000732498105"
      }
    },
    {
      "id": "1e7350d8-5438-4a3c-9215-6a1a03ffe72f",
      "title": "“Don’t Ask Questions” is a tool of spiritual abuse used by high demand religions; bring back your curious side to heal religious trauma!",
      "description": "High demand religions don\u0027t tolerate questions. Were you ever told to stop asking questions about your faith, and did it make you doubt your own judgment? If you\u0027ve grown up in or left a high-control religion, you may still feel a tug-of-war between your natural curiosity and the old rule to be quiet and compliant. This episode explores how discouraging inquiry erodes confidence, blurs critical thinking, and can put you in harm’s way, and how reclaiming your questions helps you make clear, self-honoring choices. • Recognize the common tactics (appeal to authority, false dichotomies, circular reasoning) used to shut down inquiry, and why they’re not about your worth or morality. • Rebuild trust in your own mind so you can ask clarifying questions, spot inconsistencies, and make informed decisions without fear. • Adopt empowering beliefs that honor intellectual curiosity as part of healthy spirituality and a fully human life. Press play now to learn how to honor your curious mind, set safer boundaries, and start trusting your own judgment today. Tags: Religious trauma, spiritual abuse, deconstruction, exmormon, exmo, exvangelical, recovering catholic, excatholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups, high control religion, cult, cult recovery, brainwashed, high demand religion, spiritual trauma, church abuse. Writer and Host: Clare Corado Voiceover Talent: Jason Kirkover Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-10-15T07:00:00Z",
      "duration": "00:14:05.7140000",
      "explicit": false,
      "spotifyId": "2bHPpxBSmXpF8yjrxgS7VY",
      "appleId": 1000731948459,
      "subjects": [
        "Cult Recovery",
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bHPpxBSmXpF8yjrxgS7VY",
        "apple": "https://podcasts.apple.com/podcast/dont-ask-questions-is-a-tool-of-spiritual-abuse/id1796696187?i=1000731948459"
      }
    },
    {
      "id": "e9fc4b60-5497-48ec-80f6-45c842acda49",
      "title": "Deconstructing “Marriage is forever”",
      "description": "Have you ever felt trapped by the belief that a promise, especially one about marriage, must be kept no matter the cost? If you grew up in a high-control religion, you were likely taught that breaking vows is sinful or shameful. But what if that belief has been quietly shaping how you handle commitments, guilt, or even your sense of freedom? This episode helps you question the rule that “marriage is forever” …and discover how that mindset might still be influencing your choices today, even outside of the topic of marriage. By listening, you’ll learn how to: Spot the hidden power dynamics and manipulation behind rigid religious rules about promises. Reclaim your right to change your mind as you grow, without guilt or fear. Support others (and yourself) with compassion when facing decisions about staying or leaving any kind of commitment. Press play now to uncover how breaking free from the “marriage is forever” rule can open the door to living a life that’s truly your own. — Whether you are an exvangelical, exmormon, recovering catholic, ex jehovahs witness or have left another high demand religion or cult, this podcast is designed to help you break free from spiritual abuse and religious trauma to live the life of your dreams! Episode Title: Deconstructing “Marriage is forever” | Women overcoming religious trauma as an exvangelical, exmormon, recovering catholic, or former jehovah’s witness Writer \u0026 Host: Clare Corado Voiceover Talent: Jason Kirkover Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-10-12T20:00:00Z",
      "duration": "00:18:51.6500000",
      "explicit": false,
      "spotifyId": "2Ly48LEW2PJm7iXl6mBmig",
      "appleId": 1000731487552,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Ly48LEW2PJm7iXl6mBmig",
        "apple": "https://podcasts.apple.com/podcast/deconstructing-marriage-is-forever-women-overcoming/id1796696187?i=1000731487552"
      }
    },
    {
      "id": "021bafb2-4150-4934-9617-e48272ee9469",
      "title": "The Mirror of Sovereignty",
      "description": "Personal development can focus a lot on our own boundaries, our own self care, our own desires... but we can learn so much from observing, recognizing, and respecting the sovereignty of the people around us. Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-04-23T06:00:00Z",
      "duration": "00:10:21.5570000",
      "explicit": true,
      "spotifyId": "2H14gwkoH71F6ChsxGRXNf",
      "appleId": 1000704566167,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "Self-Help",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2H14gwkoH71F6ChsxGRXNf",
        "apple": "https://podcasts.apple.com/podcast/the-mirror-of-sovereignty/id1796696187?i=1000704566167"
      }
    },
    {
      "id": "4bb03f83-ef8f-4418-ba80-7ffe8437ad30",
      "title": "A Stress-Less Way to Discover your Life\u0027s Purpose",
      "description": "Maybe the answer to one of life\u0027s greatest questions is not a snappy elevator pitch. This episode is about following the clues from the universe to find your next step. Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-04-16T04:00:00Z",
      "duration": "00:09:29.4690000",
      "explicit": true,
      "spotifyId": "5T6FlqFoDWgoGe0SxZ0pfk",
      "appleId": 1000703697253,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5T6FlqFoDWgoGe0SxZ0pfk",
        "apple": "https://podcasts.apple.com/podcast/a-stress-less-way-to-discover-your-lifes-purpose/id1796696187?i=1000703697253"
      }
    },
    {
      "id": "78e4b9cc-1222-4880-956b-f9b0f4a6ffbd",
      "title": "I\u0027m a basic Karen with RBF and ... IDGAF",
      "description": "Silly-seeming memes can be surprisingly insidious in their impact on how we live. In this episode, we break down how online humor about women often surreptitiously conveys social rules we are expected to follow but that\u0027s not in our best interests. We\u0027ll talk about being \u0022Basic,\u0022 being a \u0022Karen,\u0022 and \u0022Resting Bitch Face.\u0022 Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-04-08T09:00:00Z",
      "duration": "00:09:03.4250000",
      "explicit": true,
      "spotifyId": "0fCy09gAsAzMoLzUdb8ydh",
      "appleId": 1000702673688,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fCy09gAsAzMoLzUdb8ydh",
        "apple": "https://podcasts.apple.com/podcast/im-a-basic-karen-with-rbf-and-idgaf/id1796696187?i=1000702673688"
      }
    },
    {
      "id": "efe981b3-bcc1-4f03-99ab-d7643443a08b",
      "title": "Why You Need to Go \u0022Too Far\u0022",
      "description": "Growing and changing can feel new and uncomfortable. This episode talks about one important thing to keep in mind as you\u0027re trying to embody new ways of being. Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-03-25T09:00:00Z",
      "duration": "00:11:07.4020000",
      "explicit": true,
      "spotifyId": "09YEVQA1qHGTLqPgMJ72YP",
      "appleId": 1000700730109,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09YEVQA1qHGTLqPgMJ72YP",
        "apple": "https://podcasts.apple.com/podcast/why-you-need-to-go-too-far/id1796696187?i=1000700730109"
      }
    },
    {
      "id": "906ca4d9-b79c-4750-9b7b-615bff97425f",
      "title": "How to Go with \u0022The Flow\u0022",
      "description": "Scheduling your life based on the rhythms of your menstrual cycle can be magical. Each phase of our cycles can be a gift in its own way! Resources mentioned in the episode: https://floliving.com for info about hormone science, MyFlo app, and founder Alisa Vitti www.theroyalshaman.com for info about spiritual teacher Makhosi, aka The Royal Shaman *(I\u0027m not affiliated with either of these companies; I\u0027ve personally found them to be helpful though.) Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-03-18T14:00:00Z",
      "duration": "00:15:28.6000000",
      "explicit": true,
      "spotifyId": "4HjjLnpMiitY7QNVkppnS8",
      "appleId": 1000699667079,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4HjjLnpMiitY7QNVkppnS8",
        "apple": "https://podcasts.apple.com/podcast/how-to-go-with-the-flow/id1796696187?i=1000699667079"
      }
    },
    {
      "id": "23223f7a-8cec-48a1-89d1-218c66454c0d",
      "title": "From Naive Girl to Wise Woman",
      "description": "Naivety in women has historically been celebrated, but there is so much more awesomeness that awaits us when we transition into true, mature womanhood. This episode is about observing how we may have been conditioned to show up in various life scenarios, and what a wise and discerning grown ass adult woman would ideally do instead. Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-03-11T09:00:00Z",
      "duration": "00:19:02.6220000",
      "explicit": true,
      "spotifyId": "3FrB97Naz05jHjUxMDjhyo",
      "appleId": 1000698714642,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3FrB97Naz05jHjUxMDjhyo",
        "apple": "https://podcasts.apple.com/podcast/from-naive-girl-to-wise-woman/id1796696187?i=1000698714642"
      }
    },
    {
      "id": "2c5452b2-e620-4d16-87a1-e27fb455a668",
      "title": "The Art of Taking Up Space",
      "description": "So many of us have been taught that to be a good girl or a polite woman, we have to be physically small and demure. and modest, and just really fold ourselves into the smallest space possible. We learn to shrink ourselves in both physical and more metaphorical ways. And the effect of having been conditioned to do that really holds back our true essence. This episode is about some of the ways we might be inadvertently making ourselves small, how we can overcome it, and the idea of taking up space as an intentional act to show up as our best selves in this world. Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-02-25T17:00:00Z",
      "duration": "00:13:09.0280000",
      "explicit": true,
      "spotifyId": "2MpyId4haNmbd0GWRFDC5F",
      "appleId": 1000695957032,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2MpyId4haNmbd0GWRFDC5F",
        "apple": "https://podcasts.apple.com/podcast/the-art-of-taking-up-space/id1796696187?i=1000695957032"
      }
    },
    {
      "id": "a86f676c-ebaa-4def-b48a-a681dca97038",
      "title": "Accepting your authority",
      "description": "Recognizing your self-authority is the foundation of living an authentic life. In this episode, we talk about why this is an inescapable truth, what self-authority means, and how to still accept advice in certain contexts. Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-02-16T09:00:00Z",
      "duration": "00:10:30.9350000",
      "explicit": true,
      "spotifyId": "1HteqFfZyHUtioVq6JBQzc",
      "appleId": 1000692807164,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1HteqFfZyHUtioVq6JBQzc",
        "apple": "https://podcasts.apple.com/podcast/accepting-your-authority/id1796696187?i=1000692807164"
      }
    },
    {
      "id": "c298c307-c8a0-4101-80ad-bca2447ed9b7",
      "title": "You are already free (time to embrace it!)",
      "description": "Our culture teaches women to believe that we are supposed to have a limited role in society. In this introductory episode, I tell the story of how I went from being a girl in a conservative religious community to a liberated woman living life on my own terms, and why I started this podcast. Topics: Religious trauma, spiritual abuse, deconstruction, exmormon, exvangelical, recovering catholic, former jehovah\u0027s witness, women\u0027s empowerment, feminism, leaving religion, self-worth, high demand religions, high control groups Contact: Hugs@BrainwashBeGone.com Instagram: @brainwashbegone",
      "release": "2025-02-16T07:00:00Z",
      "duration": "00:10:09.9590000",
      "explicit": true,
      "spotifyId": "1IjxuXBECEyLou7Sjatxms",
      "appleId": 1000692807082,
      "subjects": [
        "Catholicism",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IjxuXBECEyLou7Sjatxms",
        "apple": "https://podcasts.apple.com/podcast/you-are-already-free-time-to-embrace-it/id1796696187?i=1000692807082"
      }
    }
  ]
}