{
  "id": "97011bc5-289a-4eb5-8c79-954e7f124831",
  "name": "Bravo",
  "youTubeChannelId": "UCjSKDpYQkGS005Vf13NAe8A",
  "episodes": [
    {
      "id": "59d736c6-c341-41fb-b226-c60f34854370",
      "title": "SNEAK PEEK: Amanda Jokes About Cult Comment: \u0022Next Time\u0022 | RHOBH After Show (S15 E8) Part 1 | Bravo",
      "description": "On The Real Housewives of Beverly Hills Season 15 Episode 8, Amanda Frances reacts to Dorit Kemsley\u0027s cult comment, and teases it\u0027s a story for her next book. Plus, Dorit opens up about her friendship with Kyle Richards, and admits to feeling \u0022s--t on.\u0022 Watch new episodes of The Real Housewives of Beverly Hills, Thursdays at 8/7c on Bravo and stream next day on Peacock.\n \n►► SUBSCRIBE: http://bravo.ly/Subscribe\n►► STREAM BRAVO ON PEACOCK HERE: http://pck.tv/2M6my4o \n►► WATCH FULL EPISODES NOW: https://bravo.app.link/WatchBravoYT \n►► VISIT BRAVO’S OFFICIAL SITE: http://bravo.ly/Official\n#Bravo #RHOBH #AfterShow #AmandaFrances #DoritKemsley \n\nSNEAK PEEK: RHOBH \u0027Wives On Mau\u0027s DJ Hobby: \u0022Cute\u0022 | RHOBH After Show (S15 E08) Part 2 | Bravo\n\nAbout The Real Housewives of Beverly Hills:\nThis season the ladies of Beverly Hills jet set across the globe. They strengthen their bonds and indulge along the way, but the highs prove temporary. Beneath the gloss and glamour, old wounds reopen as shifting alliances take shape and the women find that loyalty is never guaranteed in the picturesque 90210. \n \nKyle Richards is in the midst of juggling both a wedding and a separation. All the while, Kyle is moving forward, leaving behind the rumors and speculation surrounding her personal life over the past few years.   \n \nAfter navigating years of personal hurdles, Erika Jayne has reclaimed her story and is open to finding a new man that will mark the beginning of her next chapter. When another lawsuit hits the headlines, it threatens to set back her progress. \n \nDorit Kemsley is focused on picking up the pieces as she faces a very public divorce while learning how to navigate her finances and regain control of her life. As she aims to rebuild her friendship with Kyle, Dorit finds support in new housewife Rachel Zoe.  \n \nSutton Stracke tries on her maiden name for size this year when her ex-husband asks for an annulment. After fallouts with a former bestie and her trusted assistant, Sutton sees this as an opportunity to reinvent herself with a bold new name and fresh start with the group.  \n \nBozoma Saint John’s personal life is flourishing. After deciding to embark on their IVF journey, she and partner Keely are working to build a strong foundation together, starting with a new home and an official engagement.  \n \nNo stranger to the glitz of Beverly Hills, Rachel Zoe is introduced to the group through her longtime friend and neighbor Kathy Hilton. Rachel is embracing her new freedom while navigating a divorce from her husband, who also happens to be her longtime business partner. \n   \nAmanda Frances is new to Beverly Hills and so is her money. The self-professed “money queen” has built a coaching empire and manifested her way into a fairytale life. When the other ladies start to dig deeper, they find that not everything is as picture perfect as it seems. \n \nFriends Kathy Hilton and Jennifer Tilly return with their socialite statuses to bring a fabulous mix of extravagance and levity to the season. Expert to the finer things in life, luxury brand consultant and entrepreneur Natalie Swanston Fuller also joins the group. \n\nCast:\nKyle Richards\nErika Jayne\nDorit Kemsley\nSutton Stracke\nBozoma St. John\nRachel Zoe\nAmanda Frances\nKathy Hilton\nJennifer Tilly\nNatalie Swanston Fuller\n\nAbout Bravo:   \nBravo is the premier lifestyle and entertainment brand that drives cultural conversation around its high-quality, interactive original content across all platforms. The network has a diverse slate of original programming that includes unscripted favorites such as Emmy Award-winning “Top Chef” and “Project Runway,” “Vanderpump Rules,” “Below Deck,” “Southern Charm,” and the popular “Million Dollar Listing” and “The Real Housewives” franchises. Bravo also boasts the only live late-night talk show on television with the critically acclaimed “Watch What Happens Live with Andy Cohen,” which has become a nightly destination for A-list celebrities.   \n\nBravo is a program service of NBCUniversal Cable Entertainment, a division of NBCUniversal. Watch your favorite dramas, comedies, true crime and reality, plus news, sports and pop culture updates on Peacock, the new streaming service from NBCUniversal. Stream Peacock now: https://pck.tv/2M6my4o   \n\nGet More Bravo:   \nVisit Bravo\u0027s Official Site: http://bravo.ly/Official   \nWatch Bravo Full Episodes Here: https://bravo.app.link/WatchBravoYT  \nLike Bravo on Facebook: http://bravo.ly/Facebook   \nFollow Bravo on Twitter: http://bravo.ly/Twitter   \nFollow Bravo on Instagram: http://bravo.ly/Instagram\n\n0:00 Introduction\n1:10 Dorit Kemsley Reveals Something From Amanda Frances\u0027 Past: \u0022Dorit\u0027s Gloves Were Just Off\u0022",
      "release": "2026-02-06T02:00:06Z",
      "duration": "00:05:43",
      "explicit": false,
      "youTubeId": "IRX4XEvhm4o",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IRX4XEvhm4o"
      }
    }
  ]
}