{
  "id": "b1fecd28-6ba3-42ed-9963-f9f6c7038f10",
  "name": "Breaker Media",
  "youTubeChannelId": "UCLeKfNXITA_5MdDcPQCMwDQ",
  "episodes": [
    {
      "id": "f3b9926f-6e56-4599-9864-4740e66fdc66",
      "title": "Vanessa Grigoriadis on Fame, Cults, Epstein, and the Death of Magazines",
      "description": "Vanessa Grigoriadis — one of the most distinctive magazine writers of her generation — joins Lachlan Cartwright for a sharp, funny, and revealing look at how celebrity, journalism, podcasting, and culture have transformed over the past two decades.\n\nFrom Rolling Stone and New York Magazine to Campsite Media, Vanessa traces how the magazine industry became a “Titanic,” how she helped pioneer the boom in narrative podcasts, and why serialized audio storytelling is now collapsing under its own economics. She breaks down the making of her new limited-series on NXIVM’s Allison Mack, why it was so hard to sell, and the surprising place it finally landed.\n\nThe conversation also dives into the weirdness of modern media — TikTok fame, AI-generated podcasts, the Rogan effect, the death of the celebrity profile, the resurgence of Epstein reporting, and the ethics of interviewing powerful people. This is one of the most wide-ranging and brutally honest media conversations on The Breaker Pod to date.\n\n⏱️ Chapters\n00:00 – Welcome to The Breaker Pod at Seahorse, Union Square\n01:10 – Vanessa Grigoriadis on leaving magazines for podcasting\n02:10 – Selling spoken features in 2019 and the podcast gold rush\n03:20 – Limited-series podcasts and the crash of the bubble\n04:00 – The Allison Mack project and how the deal finally sold\n05:15 – Why serialized storytelling is struggling\n06:20 – The Rogan phenomenon and first-mover advantage\n07:10 – Crime Junkie, Call Her Daddy, and the new audio power players\n08:20 – Why making money in podcasting is brutally hard\n09:10 – Merch, live events, Substack: the new media ecosystem\n10:30 – Shopping the NXIVM project and why Americans didn’t bite\n12:00 – Why Canadians bought the show\n13:10 – Journalism vs. documentary and why tape gathering is dying\n14:00 – AI podcasts and the 175,000-episode flood\n16:00 – The future of YouTube creators and longform conversation\n17:10 – How Vanessa chooses profile subjects\n18:00 – Early magazine days: Carl Lagerfeld, Paris Hilton, and access\n19:20 – Celebrity culture in the TikTok era\n20:10 – The death of the real celebrity profile\n22:00 – The red-rope era of journalism\n23:15 – Will print die? Why magazines still matter\n24:50 – Epstein reporting and the story that won’t die\n26:40 – Public records, Florida law, and early Epstein coverage\n28:10 – Why the Epstein story resurges every election cycle\n29:30 – Best interview, worst interview, and the one that got away\n31:40 – Lies, tape recorders, and protecting credibility\n33:10 – How public personas diverge from reality\n34:40 – Regrets, write-arounds, and the ethics of profiling\n36:00 – Final thoughts and closing\n\n#VanessaGrigoriadis #jeffreyepstein  #MediaIndustry #Epstein #EpsteinFiles",
      "release": "2025-11-21T02:07:58Z",
      "duration": "00:34:31",
      "explicit": false,
      "youTubeId": "_puh3gAcFwE",
      "subjects": [
        "NXIVM",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_puh3gAcFwE"
      }
    },
    {
      "id": "caefd319-74a3-4306-be4a-0372685051fa",
      "title": "Vicky Ward on Epstein, Power, and the Golden Age of Journalism",
      "description": "Vicky Ward — bestselling author, investigative journalist, and founder of Vicki Ward Investigates — joins Lachlan Cartwright at Delmonico’s in New York City to talk about the powerful people she’s covered and the future of journalism.\n\nFrom her groundbreaking Epstein reporting to her work on Jared Kushner, Leon Black, and the world of Manhattan power, Ward reflects on decades of exposing influence, abuse, and secrecy. She also shares what it means to go independent in an age where truth and storytelling matter more than ever.\n\n⏱ Chapters\n00:00 – Welcome to The Breaker Pod at Delmonico’s\n01:00 – Vicki Ward on Epstein’s Victims and “Nobody’s Girl”\n03:00 – The Psychology of Control: Epstein, Ghislaine, and the Victims\n08:30 – Why the Epstein Story Keeps Coming Back\n10:30 – Power, Money, and Who Protected Epstein\n14:00 – What the Media Missed: Why It Took #MeToo to Expose Him\n17:00 – Jared and Ivanka: The Evolution of the Kushners\n19:30 – How Kushner’s Deals Shaped the Middle East\n23:00 – The Idaho Murders and Understanding Motives\n28:00 – Luigi Mangione and America’s Fascination with True Crime\n32:00 – Barry Weiss and CBS: “A Breath of Fresh Air”\n34:30 – Going Independent: Life After Legacy Media\n38:00 – Who Wields Power Well — and Who’s Faking It\n40:00 – Why This Might Be the Golden Age of Journalism\n41:30 – Closing Thoughts and Farewell\n\n🎙 About the Episode\nAfter decades reporting on billionaires, political operators, and media power brokers, Vicki Ward tells The Breaker Pod why she believes journalism’s best days might still lie ahead.\n\n👉 Subscribe to the newsletter for original scoops, behind-the-scenes media drama, and reporting you won’t get anywhere else: https://www.breakermedia.com/subscribe\n\n🎙️ New episodes weekly — exposing power, decoding media, and asking better questions.\n\n#epsteinfiles #epstein #mangione #kohberger #truecrimestories \n\n💬 Like, comment, and subscribe to stay in the loop on how the media actually works.",
      "release": "2025-10-31T00:07:35Z",
      "duration": "00:41:51",
      "explicit": false,
      "youTubeId": "FbT0Xan9aJk",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FbT0Xan9aJk"
      }
    }
  ]
}