{
  "id": "68cb1d25-1fc2-4e57-85d5-5e92efb5d9a4",
  "name": "Breaking Cults",
  "youTubeChannelId": "UCdDT9OaVXuRjMu_v5V7tgrQ",
  "youTubePlaylistId": "PLagrq077AeRuG3anLy-Prf-Rc9VI_k2yB",
  "episodes": [
    {
      "id": "388d8c0a-5b12-4e95-a4cb-0b6efb5ae0e4",
      "title": "Breaking Cults | Ep. 4 - Great Escape of Caroline Hicks [UNSEALED: Family History Vault]",
      "description": "In a forgotten frontier love story, a fourteen-year-old girl makes a courageous horseback escape from a coercive polygamous marriage to her bishop, with the help of her true love in 1800s Utah Territory. The UNSEALED behind-the-scenes commentary edition of the Family History Vault miniseries.\n\nEP. 4 - Great Escape of Caroline Hicks (original with no commentary): https://youtu.be/AbDcIXz1SdA",
      "release": "2025-12-29T19:21:16Z",
      "duration": "00:18:49",
      "explicit": false,
      "youTubeId": "_S_ZC5y_S6c",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_S_ZC5y_S6c"
      }
    },
    {
      "id": "214ccb93-2219-431f-bda4-fcbfd7e7f56d",
      "title": "Breaking Cults | Ep. 3 - Momfluencer Meets the Devil\u0027s Lifecoach",
      "description": "Join our host and new digital co-host Cipher as we discuss the evolving case of Jodi Hildebrandt and her Utah-based self-help \u0022cult\u0022 ConneXions. The second half of the show consists of an audiobook reading of Chapter 16 and 17 of Shari Franke\u0027s new book The House of My Mother: A Daughter\u0027s Quest for Freedom. These chapters outline the tactics Hildebrandt used to exercise control over the entire Franke family. If you are interested in hearing more of Shari\u0027s story, please purchase the book to support her work and follow her advocacy against the dangers of family vlogging and child stardom in the age of influencers.",
      "release": "2025-04-23T21:14:43Z",
      "duration": "00:33:49",
      "explicit": false,
      "youTubeId": "h1rjXuQarRg",
      "subjects": [
        "Connexions",
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h1rjXuQarRg"
      }
    },
    {
      "id": "eeff470a-dccf-41b6-bbc1-55f89ff42ff1",
      "title": "Breaking Cults | Ep. 2 - Shears of Influence",
      "description": "In this episode, we’re tracing the threads of hair—down to its symbolism, power, and vulnerability—from ancient times to the present day. Join in as we journey through myths, modern media, and real-world dynamics, to unravel how control, identity, and manipulation is weaved into our hair. From an immersive audiovisual retelling of Samson and Delilah to a compelling guest monologue by a veteran on military haircutting traditions, this episode dives deep into the social and cultural power of hair. You won’t want to miss this one!",
      "release": "2025-01-07T04:17:55Z",
      "duration": "00:23:52",
      "explicit": false,
      "youTubeId": "ZkPmCF7KKrY",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZkPmCF7KKrY"
      }
    },
    {
      "id": "bc0b7013-0dde-4918-90d7-2bad92d03d6e",
      "title": "Breaking Cults | Ep. 1 - Women\u0027s Agency in Polygamist Cults",
      "description": "From sensationalized portrayals to hidden truths, this pilot episode of the Breaking Cults podcast delves into the distorted depictions of Mormonism in popular culture. It features a theatrical audiovisual interlude taking us into the shadowy world of Mormonism’s early days, bringing to life the mysterious and often manipulative tactics employed by its founder. In the second half, the episode shifts to an examination of women’s agency in present-day fundamentalist sects, challenging the assumption that only men hold power in these systems. Join in as we unpack how both men and women participate in and enable cultic systems in this 20-minute deep dive.",
      "release": "2024-12-24T18:01:26Z",
      "duration": "00:20:34",
      "explicit": false,
      "youTubeId": "Dsjuo7wFZ3Q",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Dsjuo7wFZ3Q"
      }
    }
  ]
}