{
  "id": "56f4386c-d355-49cd-a69d-6b3313f3346d",
  "name": "Breaking Free from Narcissistic Abuse",
  "spotifyId": "02alcIC45IatuvlO8ZEb9d",
  "appleId": 1619408631,
  "youTubeChannelId": "UCKLQyhjWUzWrBfoQlC5ZotQ",
  "episodes": [
    {
      "id": "ed339d70-5b83-48a9-9947-7df1e3194b0b",
      "title": "You Can Love Them and Still Be Exploited: Sexual Coercion with Cult Expert Pamela Takefman",
      "description": "Ever wondered how someone can exploit you sexually while you still love them? This week, Pamela Takefman joins Dr. Kerry to explain how sexual coercion works—and why it doesn’t always require kidnapping or obvious physical force to be real. We discuss how exploitation can unfold in marriages, spiritual communities, and high-status celebrity circles (including public conversations like the P. Diddy case). Learn how perpetrators gradually test boundaries until extreme exploitation feels normal, and why loving your abuser doesn’t mean the abuse isn’t real. PODCAST EXTRA EXCLUSIVE SEGMENT Find the exclusive second segment and weekly newsletter here: https://substack.com/@breakingfreenarcabuse MORE ABOUT THE PODCAST EXTRA INTERVIEW \u0026#x1f539; Think you might be experiencing coercion but aren\u0027t sure? Wondering what legal options exist for survivors? Pamela reveals what qualifies as trafficking under federal law and how to assess whether you\u0027re psychologically ready to pursue justice through the court system. \u0026#x1f449; Get immediate access to this extended interview: https://substack.com/@breakingfreenarcabuse MORE ABOUT PAMELA TAKEFMAN Website: mcolaw.com PAMELA TAKEFMAN is Deputy Head of the Sexual Misconduct in Spiritual Communities practice at McAllister Olivarius, where she represents survivors of sexual abuse, forced labor, and coercive control in cults, spiritual communities, and other high-control groups. Drawing on federal trafficking laws that recognize psychological coercion and fraud, Pamela helps survivors understand how manipulation in intimate relationships, religious organizations, and power-imbalanced situations constitutes trafficking—even when physical force was never used. Her work challenges the narrow public understanding of trafficking and provides legal pathways for survivors whose abuse occurred within relationships where love and exploitation coexisted. Stay in Touch With Dr. Kerry! Youtube Instagram TikTok Facebook More About Dr. Kerry Kerry Kerr McAvoy, Ph.D, a retired psychologist and author, is an expert on cultivating healthy relationships and deconstructing narcissism. Her blogs have been featured in Mamami, YourTango, Scary Mommy, and The Good Men Project. In Love You More, Dr. McAvoy gives an uncensored glimpse into her survival of narcissistic abuse, and her workbook, First Steps to Leaving a Narcissist, helps victims break free from the confusion common in abusive relationships. She hosts the Breaking Free from Narcissistic Abuse podcast and offers trauma-related advice on social media. Submit your question to be answered on air to the Fan Mail link below! Support the show Disclaimer: This podcast/video is for educational purposes only. It does not constitute therapy, counseling, or professional mental health advice. If you are in crisis, please call 911 or your local emergency number.",
      "release": "2026-01-05T07:00:00Z",
      "duration": "00:30:28.2840000",
      "explicit": false,
      "spotifyId": "4qbYqbVYaoDhHzD25b0nVt",
      "appleId": 1000743781044,
      "youTubeId": "VR1BWNT07_g",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology",
        "Cult-Expert",
        "Sean Combs",
        "NXIVM",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qbYqbVYaoDhHzD25b0nVt",
        "apple": "https://podcasts.apple.com/podcast/you-can-love-them-and-still-be-exploited-sexual/id1619408631?i=1000743781044",
        "youtube": "https://www.youtube.com/watch?v=VR1BWNT07_g"
      }
    }
  ]
}