{
  "id": "d211c46a-690f-49a9-8a38-c556d08294e6",
  "name": "BRIC TV",
  "youTubeChannelId": "UCqvDXN3mmnRjdxhPoqgU0lA",
  "episodes": [
    {
      "id": "e1928a27-f054-4e7a-8479-a936091e76f3",
      "title": "Oric \u0026 The Stars: The Dark Secrets of a Broadway Cult | Frameworks",
      "description": "Oric Bovar gained a huge following throughout the 60\u0027s as a mail-order astrologer, and as he began claiming wild ideas and making tragic predictions, many of his followers stuck with him—followers who happened to be high-caliber actors and artists, including Terence Stamp and Bernadette Peters. \n\nTod Jackson was his right-hand-man through much of Oric’s ascent, and in his old age, Tod looks back in order to take us through the mental and emotional processes that culminated in an unfortunate series of death and loss. As Tod, still healing from these events, takes us through the journey of those days past, we also witness the journey of a man letting go of one of his closest friends.\n\n#Frameworks #Documentary #OricBovar\n--\nThis video is from BRIC TV— the first 24/7 television channel created by, for, and about Brooklyn. It is the borough\u0027s source for local news, Brooklyn culture, civic affairs, music, arts, sports, and technology. BRIC TV features programming produced and curated by BRIC, an arts and media nonprofit located in Downtown Brooklyn, NYC.\n\nWatch more Brooklyn-centric content from BRIC TV:\n\n112BK: http://bit.ly/2FE17yY\nBHeard: http://bit.ly/2Hw9Gws\nGoing In With Brian Vines: http://bit.ly/2CVnM7K\nB-Side: http://bit.ly/2Iqzzz6\n\nCheck out more from BRIC:  \nhttps://www.youtube.com/c/BRICartsmedia\n\nConnect with us:\nhttps://www.facebook.com/BRICTV/\nhttp://Twitter.com/BRICTV\nhttp://Instagram.com/BRICTV\nhttp://BRICartsmedia.org/BRICTV",
      "release": "2018-10-31T16:00:03Z",
      "duration": "00:16:27",
      "explicit": false,
      "youTubeId": "R6-bPGuPrAc",
      "subjects": [
        "Oric Bovar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R6-bPGuPrAc"
      }
    }
  ]
}