{
  "_ts": 0,
  "id": "f5ff49e5-97a5-420b-8bcb-eb7c8797cb65",
  "name": "British Murders with Stuart Blues",
  "spotifyId": "42esV2DdEMonzmlgMSLCEm",
  "appleId": 1539343828,
  "youTubeChannelId": "UCoZBEA6gflnKGCtrLtTN8Wg",
  "episodes": [
    {
      "id": "c65b0b7a-9de8-4e00-a044-618d456bc712",
      "title": "Interview #60 | Inside The Cult Vault: Deep Dives and Survivor Interviews with Kacey",
      "description": "I welcome my friend and fellow podcaster Kacey to the show in this interview episode. Kacey is the creator and host of the award-nominated podcast \u0027The Cult Vault\u0027, and since the show\u0027s launch in May 2020, she has put a great deal of work into bringing the acts of cults and high-control groups to the masses. The podcast originally only featured deep-dive episodes into infamous cults such as The Peoples Temple, The Manson Family and The Unification Church, but Kacey quickly realised that the best way to learn about how people get sucked into these groups was through interviews. The Cult Vault now includes long-form interview episodes with cult survivors and experts, aiming to keep the focus on the survivors\u0027 point of view. Kacey can be reached at her website: cultvaultpodcast.com ***This interview was recorded on July 12, 2024. \u0026#xfeff;Join my Patreon community at patreon.com/britishmurders for exclusive perks, including early access to ad-free episodes, bonus content, exciting giveaways, and much more! Do you have a guest request? Please send it to contact@britishmurders.com or fill out a Contact Form at britishmurders.com/contact Intro music:⁣ David John Brady - \u0027Throw Down the Gauntlet\u0027⁣ davidjohnbrady.com Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2024-07-14T23:00:00Z",
      "duration": "01:09:09.1060000",
      "explicit": true,
      "spotifyId": "2BKjYhZ6voCW9w2XBqOJtM",
      "appleId": 1000662230435,
      "youTubeId": "uPvsB7wP1tM",
      "subjects": [
        "Legislation",
        "Cult Psychology",
        "Cult-Expert",
        "Cult Apologists",
        "Children Of God",
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2BKjYhZ6voCW9w2XBqOJtM",
        "apple": "https://podcasts.apple.com/podcast/interview-60-inside-the-cult-vault-deep-dives/id1539343828?i=1000662230435",
        "youtube": "https://www.youtube.com/watch?v=uPvsB7wP1tM"
      }
    }
  ]
}