{
  "id": "f459a1b2-54aa-4bca-ac3c-63c05a261482",
  "name": "Broads Next Door",
  "spotifyId": "3bKRTDn9ws19tEmVUTwmqf",
  "appleId": 1649660929,
  "episodes": [
    {
      "id": "4299f271-a68c-42d0-a4d0-7133e9feae4d",
      "title": "The Very Dark World of The Troubled Teen Industry (Part 1)",
      "description": "Rip of your ankle bracelet and jump out of that unmarked van, because today we\u0027re getting a broader understanding of the for profit troubled teen industry Do you remember the worst fight you had with your parents? Did they pay someone to kidnap you afterward? Paris Hilton may have brought the troubled teen industry into the forefront of our minds but the industry itself has a long and dark history. In this episode we lern how these wilderness camps and nightmare boarding schools got there start from Native American Reform Schools, to institutionalization, The Boys School, a lot of cults, Elan, CEDU, the confession to the murder of Martha Moxley during scream therapy, the expansion of these schools internationally and the damage they have continued to create. This is part one of a two part series (Every trigger warning. Honestly this is rough. This episode contains the kidnapping of children, child abuse, s*xual abuse, systemic abuse, and the deaths of children who were taken to places that promised to make their lives better.) Sources: - \u0022The Cult That Spawned the Tough-Love Teen Industry\u0022 by Maia Szalavitz The Last Stop, Elan School, documentary \u0022The Last Days of Synanon\u0022 documentary (2018)- \u0022I am Paris\u0022 documentary (2020) \u0022Selling a Dream: How Private Prisons Influence Immigration Policy\u0022 by Sarah Stillman (New Yorker, 2020) \u0022The Tragic History of the Troubled Teen Industry\u0022 by Molly Osberg (Splinter News, 2018)- \u0022The Troubled-Teen Industry Has Been a Disaster for Decades. But Can It Be Stopped?\u0022 by Maia Szalavitz (Vice, 2016)- \u0022The Kids Aren\u0027t Alright\u0022 by Gabriel Sherman (New Republic, 2007)- Primetime, Paradise Cove, 1998 Become a supporter of this podcast: https://www.spreaker.com/podcast/broads-next-door--5803223/support .",
      "release": "2025-09-19T10:00:08Z",
      "duration": "01:18:27.9750000",
      "explicit": true,
      "spotifyId": "2bCFDpOA5zPQGB4NNqxvWs",
      "appleId": 1000727486778,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bCFDpOA5zPQGB4NNqxvWs",
        "apple": "https://podcasts.apple.com/podcast/the-very-dark-world-of-the-troubled-teen-industry-part-1/id1649660929?i=1000727486778"
      }
    }
  ]
}