{
  "id": "0bfbc2fc-4580-42a0-a9b3-aa9b43b4c5a0",
  "name": "Broken to Beloved Podcast",
  "spotifyId": "2RcmVVeoNVuaZ7VT37YKrc",
  "appleId": 1751410316,
  "episodes": [
    {
      "id": "a5067832-0c23-4fc1-9145-adc060cad638",
      "title": "046: Unity in Diversity and the Work of Healing with the Religious Trauma Network",
      "description": "Are there communities that support survivors of religious trauma without being…religious? Spiritual abuse doesn’t only happen in churches. It can happen anywhere and to anyone, but there’s rarely space for all voices and experiences to be heard. I recently spoke with the four founders of the newly launched Religious Trauma Network. These four are creating a place that proves you can have a community of healing without believing the same thing—and they want to help others find this for themselves. In our conversation, they each share what led them into this career, how they met, and what the Religious Trauma Network is all about. My favorite part, though? They share what healing means and how it doesn’t have to look spiritual for it to be true. Get the full show notes and links here . \u0026#x1f4c4; Guest Spotlight ✨ The Religious Trauma Network’s mission is to offer comprehensive information, resources, and support for individuals recovering from religious trauma while raising awareness and equipping professionals and organizations to create safe, trauma-responsive spaces inside their faith or healing communities. Website | Instagram | Facebook Books/Films/Resources Mentioned: Religious Trauma Network Blog (open to public submissions) Trauma in the Pews by Janyne McConnaughey on Amazon | Bookshop What Lies Inside: Healing in the Face of Trauma film by Luke Renner ————— Subscribe using your favorite podcast app: Apple Podcasts | Spotify | Amazon Music | YouTube ————— Spread the Word. Leave a Rating and Review. It would mean the world if you would leave us a rating and review on Apple or on Spotify . They’ll help us share these conversations and resources with more people, and let us know how we can better serve you. ————— Broken to Beloved is a 501(c)3 nonprofit that works to provide those wounded by spiritual abuse and religious trauma with practical resources moving toward healing and wholeness, and to provide pastors and church leaders with resources to grow in trauma awareness and implement safeguarding practices. Get more information or give a tax-free donation here . ————— As an Amazon and Bookshop.org affiliate, I may make a small commission at no extra cost to you.",
      "release": "2025-04-15T06:00:00Z",
      "duration": "01:02:26.4810000",
      "explicit": false,
      "spotifyId": "1eV0PPwvg6DcWDI5xt1zu4",
      "appleId": 1000703559637,
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1eV0PPwvg6DcWDI5xt1zu4",
        "apple": "https://podcasts.apple.com/podcast/046-unity-in-diversity-and-the-work-of/id1751410316?i=1000703559637"
      }
    }
  ]
}