{
  "_ts": 0,
  "id": "a7995dde-6d4b-4c50-b1ac-9619399c1e18",
  "name": "Bullseye with Jesse Thorn",
  "spotifyId": "440t9Kb5KWhRxdgu5socrV",
  "appleId": 73331298,
  "youTubeChannelId": "UCoZliKdwW8FEcjJ0JGsm5ng",
  "episodes": [
    {
      "id": "5e8f51a1-488d-41ff-a0a7-4fb57988ebb6",
      "title": "Jane Borden thinks all cults are basically the same",
      "description": "Jane Borden is a writer with bylines in Vanity Fair, the Washington Post, and the New York Times Magazine.\n\nJane is kind of obsessed with cults. She enjoys reading books on them, watching documentaries, and vintage news pieces on the subject.\n\nShe\u0027s into all sorts of cults. The ones that broke the mainstream like the Manson Family and Jonestown. More obscure ones, like a group called Mankind United from the 1940\u0027s that promised to bring to justice the secret cabal that caused the Great Depression. \n\nJane\u0027s obsession has become her latest book. She joins us on Bullseye to talk about Cults Like Us. The book is not just a study on the history of cults, but an examination on why they seem to be a uniquely American phenomenon. \n\nWant to hear more? Subscribe to Bullseye now via Apple Podcasts:\nhttps://itunes.apple.com/us/podcast/npr-bullseye-with-jesse-thorn/id73331298?mt=2\n\nGet MORE of Bullseye with Jesse Thorn:\n► FOLLOW us on Instagram:  /  https://www.instagram.com/bullseyewithjessethorn/ \n► FOLLOW us on X:   /  https://x.com/Bullseye \n► LIKE us on Facebook:  /  https://www.facebook.com/bullseyewithjessethorn/\n► VISIT our show page:  /   https://maximumfun.org/podcasts/bullseye-with-jesse-thorn/\n\nBullseye is a celebration of the best of arts and culture in public radio form. Host Jesse Thorn sifts the wheat from the chaff to bring you in-depth interviews with the most revered and revolutionary minds in our culture. Bullseye has been featured in Time, The New York Times, GQ and McSweeney\u0027s, which called it \u0022the kind of show people listen to in a more perfect world.\u0022",
      "release": "2025-05-23T09:50:52Z",
      "duration": "00:43:49",
      "explicit": false,
      "appleId": 1000709546025,
      "youTubeId": "_K5tkZXyWHE",
      "subjects": [
        "Cult Psychology",
        "Manson Family",
        "Peoples Temple"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/author-jane-borden-on-cults-like-us/id73331298?i=1000709546025",
        "youtube": "https://www.youtube.com/watch?v=_K5tkZXyWHE"
      }
    }
  ]
}