{
  "id": "b773f4d2-1453-4005-9f0c-2c83d52458fb",
  "name": "Bump In The Road",
  "spotifyId": "2mGe8T48Eer80pV99dptbi",
  "appleId": 1515348427,
  "youTubeChannelId": "UCK4fw061eAyiMnvAMJtxODg",
  "episodes": [
    {
      "id": "0ea3fa49-1ba0-422b-8c3e-aae1a18e6680",
      "title": "Sally Lotz: Breaking Free From A Cult",
      "description": "This story is about examining our beliefs, no matter where they come from. Sally’s childhood was far from ordinary. Raised in a Jehovah’s Witness household, her life was dictated by strict rules and the looming presence of a cult that dictated every aspect of her existence. Sally shares the stark realities of her upbringing—no birthdays, no Christmas, no semblance of a normal childhood. She recounts the emotional and mental abuse at the hands of her stepfather and the congregation that turned a blind eye. In ‘The Truth is a Lie,’ Sally’s young adult fiction book, she unveils a narrative that mirrors her own experiences. It’s a tale that delves into the complexities of life within a cult, the psychological warfare endured by its members, and the incredible strength it takes to escape. Sally’s story is a journey of self-discovery, of finding one’s voice amidst the silence imposed by others. It’s a story about having the bravery and guts to break away from onellife to form another. Sally’s experience lends many insights on personal growth, spirituality, and the importance of finding trusted mentors. Her advice to those in similar situations is highly practical —seek help, make a plan, and take baby steps towards a better life. This episode is an invitation to reflect on the rules that define all our worlds. It’s a story of seeking one’s truth, even when that breaks the role you are told to play. This story will challenge you to look at your own life, and ask where your truth lies. It\u0027s an Amazon best selling book! What they\u0027re saying: “This is a beautiful book about life, its imperfections, its challenges, and its joys. It is a book of hope and wisdom for all of us facing a bump in the road.” –Pragito Dove “Pat has woven together beautiful stories of life setbacks that have been transformed into spiritual growth. This book is a gift and a must-read for souls experiencing pain and yearning for growth.” –Gary Hensel Learn more at BumpInTheRoad.us Follow Bump on: ➡️ Twitter ➡️ Facebook ➡️ Substack ➡️ Instagram ➡️ YouTube",
      "release": "2024-09-08T13:02:00Z",
      "duration": "00:27:28.2290000",
      "explicit": false,
      "spotifyId": "5QnHDCa0FSexptGeEfbn9o",
      "appleId": 1000668776376,
      "youTubeId": "Yh7XQzNNbMg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5QnHDCa0FSexptGeEfbn9o",
        "apple": "https://podcasts.apple.com/podcast/sally-lotz-breaking-free-from-a-cult/id1515348427?i=1000668776376",
        "youtube": "https://www.youtube.com/watch?v=Yh7XQzNNbMg"
      }
    }
  ]
}