{
  "id": "787ce26c-9e73-4ad5-83b7-52e694a53116",
  "name": "Business Today",
  "youTubeChannelId": "UCaPHWiExfUWaKsUtENLCv5w",
  "episodes": [
    {
      "id": "d28751ef-b13b-425d-8818-cd2b3ea3b9f4",
      "title": "Epstein Conviction Known In 2008? Hardeep Puri Breaks Silence On Epstein Meeting Timeline",
      "description": "During his interview, Union Minister Hardeep Singh Puri addresses questions surrounding his meeting with Jeffrey Epstein after the latter’s 2008 conviction. Puri maintains he neither knew Epstein in 2008 nor met him during that period, stating his first interaction occurred in 2013 and that he was “ambushed” into attending a group meeting. He argues that at the time, Epstein was interacting with several high-profile global figures, and not everyone was fully aware of the details of his past conviction. Emphasising the context of his diplomatic role, Puri notes he met hundreds of individuals annually. He strongly condemns Epstein’s crimes while insisting there was no wrongdoing or intent on his part in attending that meeting. \n\n#BusinessToday #IndiaToday #BreakingNews #NewsUpdate #ExclusiveInterview #UnionMinister #HardeepSinghPuri #JeffreyEpstein #GlobalPolitics #PublicStatement #EpsteinFiles #PMModi  #EpsteinIsland #RahulGandhi \n-----------------------\nThank You for watching! Do not forget to Like | Comment | Share \n-----------------------\nAbout the channel\nWatch us for the best news and views on business, stock markets, crypto currencies, consumer technology, the world of real estate, bullion, automobiles, start-ups and unicorns and  personal finance. Business Today TV will also bring you all you need to know about mutual funds, insurance, loans and pension plans among others.\n\nFollow us at:\nWebsite: https://www.businesstoday.in \nWhatsApp: whatsapp.com/channel/0029Va4Hd309hXFCqY62yD2I\nFacebook: https://www.facebook.com/BusinessToday\ntwitter:  https://twitter.com/business_today\nInstagram: https://www.instagram.com/business_today/",
      "release": "2026-02-12T15:00:05Z",
      "duration": "00:02:08",
      "explicit": false,
      "youTubeId": "354tyK7HuxM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=354tyK7HuxM"
      }
    }
  ]
}