{
  "id": "4bf1fa2b-956d-4216-a4cd-085799cc8df8",
  "name": "bykorton",
  "youTubeChannelId": "UC54YPkKgqLlLhgELDvdgUnA",
  "episodes": [
    {
      "id": "7b5c6050-9af2-47c4-a397-a3abe6329225",
      "title": "The Day a Cult Leader Turned an Airstrip Into Execution Ground",
      "description": "In November 1978, a routine investigation into a remote religious settlement spiraled into one of the most horrifying tragedies of the 20th century.\nU.S. Congressman Leo Ryan traveled deep into the jungles of Guyana to inspect Jonestown, a commune run by Jim Jones and the People’s Temple. What he found at first seemed harmless — smiling members, music, rehearsed performances, and carefully controlled tours meant to reassure outsiders.\nBut the calm was an illusion.\nBehind the scenes, Jonestown was ruled by fear, isolation, and psychological control. When several members secretly asked to leave with Congressman Ryan, the façade collapsed. What was meant to be a quiet departure turned into a deadly trap.\nAt the Port Kaituma airstrip, armed gunmen ambushed the group without warning. Congressman Leo Ryan was killed alongside journalists and a former member of the commune. The attack was captured on camera, preserving the chaos and panic in chilling detail.\nBack at Jonestown, Jim Jones gathered his followers and warned them that retaliation was coming — that enemies would torture their children and destroy their community. He presented death as the only escape.\nWhat followed was a forced mass poisoning that left more than 900 men, women, and children dead.\nThis video examines the rise of Jim Jones, the methods of psychological control used within the People’s Temple, the assassination at Port Kaituma, and the devastating final hours of Jonestown — a tragedy that continues to haunt history decades later.\n⚠️ Content Warning:\nThis video discusses real acts of violence and includes archival footage that some viewers may find disturbing. Viewer discretion is advised.\nFair Use Disclaimer\nThis video is produced for educational and documentary purposes under Section 107 of the Copyright Act of 1976.\n• No negative impact on the original works\n• Used for commentary, reporting, and research\n• Only brief clips are included where necessary for context\nAll rights and credits belong to their respective owners.",
      "release": "2026-01-29T17:34:18Z",
      "duration": "00:11:07",
      "explicit": false,
      "youTubeId": "snwjpqSX_t0",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=snwjpqSX_t0"
      }
    }
  ]
}