{
  "id": "4bf1fa2b-956d-4216-a4cd-085799cc8df8",
  "name": "bykorton",
  "youTubeChannelId": "UC54YPkKgqLlLhgELDvdgUnA",
  "episodes": [
    {
      "id": "fbf82195-0e3a-4441-8a43-3a1c4c6e9ba4",
      "title": "The Day U.S Congressman Was Assassinated By a Cult leader",
      "description": "In November 1978, a routine congressional investigation led to one of the deadliest cult tragedies in modern history.\nU.S. Congressman Leo Ryan traveled deep into the jungles of Guyana to investigate Jonestown, a remote settlement run by cult leader Jim Jones and the People’s Temple. What appeared to be a peaceful religious commune quickly revealed itself as a tightly controlled environment built on fear, isolation, and psychological manipulation.\nAs members secretly attempted to defect with Congressman Ryan, events spiraled out of control. At the Port Kaituma airstrip, armed gunmen opened fire, assassinating Leo Ryan along with journalists and former members. The attack was captured on camera, leaving behind some of the most chilling footage ever recorded.\nBack at Jonestown, Jim Jones delivered a final speech, convincing his followers that death was the only escape from imagined enemies. What followed was a forced mass poisoning, resulting in the deaths of more than 900 men, women, and children — one of the largest loss-of-life events involving a cult in history.\nThis documentary explores:\nThe rise and manipulation tactics of Jim Jones\nThe inner workings of the People’s Temple cult\nThe assassination of Congressman Leo Ryan\nThe Port Kaituma massacre\nThe final hours and psychological control inside Jonestown\nHow this tragedy reshaped the global understanding of cults and coercion\nDecades later, Jonestown remains a haunting warning about blind obedience, charismatic leaders, and the dangers of unchecked power.\n⚠️ Content Warning\nThis video discusses real acts of violence, death, and includes archival footage that some viewers may find disturbing. Viewer discretion is advised.\n📚 Fair Use Disclaimer\nThis video is produced for educational and documentary purposes under Section 107 of the Copyright Act of 1976.\n• Used for commentary, reporting, criticism, and research\n• No negative impact on original works\n• Only brief clips are used where necessary for context\nAll rights and credits belong to their respective owners.",
      "release": "2026-02-01T18:23:35Z",
      "duration": "00:11:07",
      "explicit": false,
      "youTubeId": "ig8tQWFK-OQ",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ig8tQWFK-OQ"
      }
    }
  ]
}