{
  "_ts": 0,
  "id": "27dc3888-7979-4d37-973a-68ecd44beaf9",
  "name": "Bylines",
  "spotifyId": "2A2VtDZP8hYAajXNhNqoHA",
  "appleId": 1742128151,
  "episodes": [
    {
      "id": "1c6a67bd-52f7-4668-a562-0e82930e0858",
      "title": "Episode #15: Tim Elliott \u0022That\u0027s your challenge: to paint a picture of a human being, not someone who does something.\u0022",
      "description": "Tim Elliott is a senior writer with Good Weekend, author and podcast host. Tim is one of Australia’s best feature writers and if you haven’t read his pieces in the Sydney Morning Herald’s Saturday magazine, Good Weekend, you’re really missing out. Tim started his career writing for Sydney surf mags before heading to Bolivia to write for The Bolivian Times in his early twenties. He’s loved writing ever since he was a kid copying out Times New Roman Font in his notebook and after a career as a freelancer and news journalist at the Sydney Morning Herald, Tim now works for Good Weekend, producing feature stories on anything and everything you can imagine. Tim co-produced the 2022 podcast Inside The Tribe with fellow journalist Camille Bianchi on an Australian cult which won best true crime podcast at the Australian Podcast Awards. He’s also a Kennedy Award-winner for his feature writing and can claim one to have written one of the most engaged-with pieces in the Sydney Morning Herald ever – a 2014 piece on his father’s suicide which led to him being inundated with thousands of emails, letters and texts. Our conversation touches on... Why a single feature article can take Tim 6 weeks of research to complete and involve up to 72 interviews How he wrote a recent piece on Katherine Folbigg and the lawyer who helped secure her freedom, Rhanee Rego Tim’s love of words and why reads the work of other writers to get inspired How he ended up writing for The Bolivian Times in South America and patrolling jungles with DEA agents How Tim got a job as a feature writer for Good Weekend magazine and why he chose to write a very personal story on his father’s suicide How he came to write his award-winning podcast Inside the Tribe about an Australian cult The subtle things Tim looks for when he’s interviewing a person for a profile and why he doesn’t like interviewing celebrities or performing arts people And how his childhood experience of family mental illness made him a more sensitive writer today. For a full episode transcript and links to Tim\u0027s work visit our website: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠http://bylinespodcast.com⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Follow my Instagram: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ https://www.instagram.com/bylines_podcast/ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Subscribe to the weekly podcast newsletter for a behind-the-scenes post about each episode: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠http://eepurl.com/iLgLy6⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Sound production by Jonathan Koster: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ https://www.instagram.com/djjonnysounds",
      "release": "2024-08-19T09:43:04Z",
      "duration": "00:58:32.2030000",
      "explicit": false,
      "spotifyId": "1DX5GAegatwc4YYkXlQcsu",
      "appleId": 1000665869167,
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DX5GAegatwc4YYkXlQcsu",
        "apple": "https://podcasts.apple.com/podcast/episode-15-tim-elliott-thats-your-challenge-to-paint/id1742128151?i=1000665869167"
      }
    }
  ]
}