{
  "id": "f77c52ff-1552-4b21-9274-3044ca290f2f",
  "name": "C dans l\u0027air - France Télévisions",
  "youTubeChannelId": "UCvg4_wSz4Cmo4xRPXaKU47A",
  "episodes": [
    {
      "id": "bbb180c8-6412-48ad-ba7b-0235bccc348e",
      "title": "Trump dans le piège de l\u0027affaire Epstein  -  C dans l’air - 30.12.2025",
      "description": "L’affaire Epstein continue de secouer l’Amérique et de hanter Donald Trump. Une nouvelle salve de 11 000 documents concernant cette affaire judiciaire a été publiée la semaine dernière et le nom du président des États-Unis apparaît à plusieurs reprises. Il s’agit pour la plupart d’articles de presse le mentionnant, mais un courriel provenant d’un procureur fédéral indique que Donald Trump est présent sur la liste des passagers de l’avion privé de Jeffrey Epstein d’« au moins huit vols entre 1993 et 1996 », dont une fois avec pour seuls autres voyageurs l’ancien financier et une personne âgée de 20 ans.Ancien ami d’Epstein, Donald Trump a reconnu l’avoir fréquenté, mais assure s’en être rapidement éloigné dès que ses activités criminelles ont été révélées. Sur son réseau Truth Social, il a également dénoncé ce qu’il qualifie de « canular orchestré par les démocrates » et a insisté sur le fait que « ce sont les démocrates qui ont collaboré avec Epstein, pas les républicains. Qu’on publie tous leurs noms, qu’on les couvre de honte et qu’on se remette au travail pour notre pays ! » Le président n’a toutefois cité aucun nom précis et n’a fourni aucun élément permettant d’étayer ses accusations.Cette sortie intervient alors que plusieurs figures démocrates et républicaines réclament une transparence totale sur les relations d’Epstein, quel que soit le camp politique concerné, et critiquent le nombre de caviardages effectués par le ministère de la Justice sur les documents rendus publics. Des photos et des textes caviardés qui ne satisfont pas les victimes, plusieurs législateurs, mais aussi nombre de membres du mouvement MAGA, déchiré depuis la démission de Marjorie Taylor Greene. Cette figure emblématique du mouvement Make America Great Again reproche au président de manquer de transparence dans ce scandale politico-judiciaire.Empêtré dans cette affaire Epstein, Donald Trump doit faire face au mécontentement croissant de ses concitoyens. 68 % des Américains jugent que l’économie américaine se porte mal, selon un sondage de l’agence AP, alors que l’inflation s’accélère dans le pays depuis son retour à la Maison Blanche. Nos journalistes sont allés à leur rencontre au Texas.Alors, que contiennent les nouveaux documents publiés ? Que sait-on des liens entre Donald Trump et Jeffrey Epstein ? Pourquoi le transfert de prison de Ghislaine Maxwell suscite-t-il la polémique ? Cette affaire peut-elle provoquer la chute du président des États-Unis ?\nNos experts :- Laurence Haïm - Journaliste, ancienne correspondante aux États-Unis, auteure de Ghislaine Maxwell, une femme amoureuse de Robert Laffont.- Anthony Bellanger - Éditorialiste – Franceinfo TV, spécialiste des questions internationales- Anne Deysine - Juriste et politologue, spécialiste des États-Unis, auteure de Les juges contre l’Amérique - Anne Toulouse - Journaliste franco-américaine, auteure de L’art de Trumper, publié aux éditions du Rocher De retour tout juste des États-Unis\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-29T23:00:35Z",
      "duration": "01:04:20",
      "explicit": false,
      "youTubeId": "MvjHvrhvcpA",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MvjHvrhvcpA"
      }
    },
    {
      "id": "ce86c5f9-1c97-4a8b-8133-31d4add84b39",
      "title": "Epstein : l\u0027affaire du doigt d\u0027honneur",
      "description": "Les Clinton partent au combat contre Donald Trump. Le couple a refusé de répondre aux question du Congrès sur ses liens avec Jeffrey Epstein. Ils prennent ainsi le risque de poursuites judiciaires. Quant à Donald Trump, il a fait un doigt d\u0027honneur à un ouvrier qui l\u0027interpellait sur cette affaire.\nUn reportage de Mathieu Ligneau et Nicolas Baudry d\u0027Asson\n\nNos experts :\n- David THOMSON - Journaliste spécialiste du mouvement MAGA, auteur du documentaire « J.D Vance : la revanche d\u0027une Amérique »\n- Laurence HAÏM - Ancienne correspondante aux États-Unis, auteure de « Ghislaine Maxwell, une femme amoureuse »\n- Elisa CHELLE - Professeure de science politique à l\u0027Université Paris-Nanterre\n- Corentin SELLIN - Professeur d\u0027histoire en classe préparatoire, spécialiste des Etats-Unis et chroniqueur pour le média « Les Jours »\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-18T09:01:30Z",
      "duration": "00:09:01",
      "explicit": false,
      "youTubeId": "u3JqHm47L9M",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u3JqHm47L9M"
      }
    },
    {
      "id": "e8aeac24-7eb2-4a0a-b99e-aa598732e4de",
      "title": "Affaire Epstein : ces photos qui font trembler Trump...   -  C dans l’air - 17.12.2025",
      "description": "L\u0027affaire Epstein continue de secouer les États-Unis. Dix-neuf photos ont été mises en ligne vendredi dernier par des élus démocrates. On y voit, en compagnie du prédateur sexuel, Donald Trump, Bill Clinton, Ghislaine Maxwell (aujourd’hui incarcérée), Bill Gates, Steve Bannon ou encore Andrew Mountbatten-Windsor. Ces nouvelles images, publiées par les législateurs démocrates de la commission de surveillance de la Chambre des représentants, ne sont qu\u0027une petite partie des plus de 95 000 photos qu\u0027ils ont reçues de la succession d\u0027Epstein, qui s\u0027est suicidé dans une cellule d\u0027une prison new-yorkaise en 2019 alors qu\u0027il attendait d\u0027être jugé pour des accusations de trafic sexuel.\n\n\nElles sont surtout distinctes des dossiers que le ministère de la Justice est désormais contraint de publier. Mais l\u0027impatience grandit alors que l\u0027administration Trump fait face à la date limite du 19 décembre pour produire les dossiers Epstein, mais aussi à de nouvelles révélations explosives.\nMardi 16 décembre, le magazine américain Vanity Fair a publié une enquête basée notamment sur une dizaine d’entretiens avec Susie Wiles, la secrétaire générale de la Maison-Blanche. L’ancienne directrice de campagne du milliardaire républicain estime par exemple que l’ex-magnat de l’immobilier, marqué par la mort de son frère alcoolique, « a une personnalité d’alcoolique » — elle-même est fille d’un homme alcoolique. Il « fonctionne avec la conviction que rien ne lui est impossible. Absolument rien ». « Les alcooliques fonctionnels, ou les alcooliques en général, ont une personnalité exacerbée lorsqu’ils boivent », a-t-elle ajouté. La conseillère âgée de 68 ans égratigne aussi le vice-président, estimant qu’il est « adepte des théories complotistes depuis une décennie », ou encore Elon Musk, un temps à la tête du département de l’Efficacité gouvernementale (Doge), qualifié de destructeur…\n\n\nSous pression, le camp Trump s’exprime et tente de désamorcer. Très discrète habituellement, Susie Wiles a dénoncé un article « malhonnête ». « Elle voulait dire que je… Voyez-vous, je ne bois pas d’alcool. Tout le monde le sait, mais j’ai souvent dit que si je buvais, j’aurais de fortes chances de devenir alcoolique. Je l’ai dit à maintes reprises », a déclaré de son côté Donald Trump. Quelques heures plus tard, le président des États-Unis a annoncé sur son réseau Truth Social que les États-Unis mettaient en place un blocus au Venezuela contre « les pétroliers sous sanctions », une nouvelle escalade dans la crise entre les deux pays. Accusé de faire diversion par ses opposants, le président des États-Unis doit s’exprimer une nouvelle fois ce soir.\n\n\nEn face, ses adversaires surenchérissent. Ils affirment avoir d’autres clichés encore plus troublants alors que l’heure de vérité approche. Les autorités ont désormais moins de deux jours pour publier l’intégralité des documents non classifiés liés aux enquêtes portant sur Jeffrey Epstein, sur sa complice Ghislaine Maxwell et sur toute personne en lien avec les faits qui leur sont reprochés. Une affaire qui obsède depuis des années l’opinion publique américaine et a inspiré de multiples théories du complot.\n\n\nAlors que sait-on des liens entre Donald Trump et Jeffrey Epstein ? Cette affaire peut-elle provoquer la chute du président des États-Unis ? Pourquoi le mouvement MAGA se déchire-t-il ?\n\n\nNos experts :\n- Laurence HAÏM - Journaliste spécialiste des Etats-Unis, autrice de Ghislaine Maxwell, une femme amoureuse, publié chez Robert Laffont\n- Nicole BACHARAN - Historienne et politologue, spécialiste des Etats-Unis, éditorialiste à Ouest-France, autrice du livre Requiem pour le monde libre, publié aux éditions de l’Observatoire\n- Gallagher FENWICK - Grand reporter, spécialiste des questions internationales, ancien correspondant à Washington\n- Vincent JOLLY - Grand reporter pour Le Figaro Magazine\n\n\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions\n\nEncore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI",
      "release": "2026-01-16T23:00:05Z",
      "duration": "01:03:47",
      "explicit": false,
      "youTubeId": "2dEm8Va1qFo",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2dEm8Va1qFo"
      }
    },
    {
      "id": "bb491cd4-b54e-4ba0-9501-e8f58bb19bff",
      "title": "Dossier Epstein : le compte à rebours est lancé pour Trump  -  C dans l’air - 13.12.2025",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\nDossier Epstein : le compte à rebours est lancé pour Trump\n\nDonald Trump ne parvient pas à se sortir de l\u0027affaire Epstein. Suite à une loi signée par le président américain, un juge fédéral a ordonné mercredi, et pour la troisième fois en quelques jours, la levée du secret sur des documents judiciaires relatifs à l\u0027affaire du criminel sexuel Jeffrey Epstein. Les révélations pourraient avoir lieu d’ici au 19 décembre, date butoir fixée par la loi.\nAprès avoir dévoilé il y a peu les photos de la résidence de Jeffrey Epstein à Little Saint James, l’île privée des Caraïbes où il aurait organisé son trafic sexuel, des élus démocrates ont rendu publiques cette nuit de nouvelles photos. Donald Trump apparaît sur plusieurs d’entre-elles. La pression est maximale sur le locataire de la Maison-Blanche. D\u0027autant que son comportement interroge. Alors qu’il avait estimé durant sa campagne qu\u0027il fallait faire toute la lumière sur ce dossier, il a semblé vouloir tout faire pour étouffer l\u0027affaire une fois revenu au pouvoir.\n\nL’affaire Epstein n’est pas la seule à agiter l’actualité américaine. La bataille entre Netflix et la Paramount pour racheter le géant du divertissement Warner Bros Discovery fait elle aussi les gros titres outre-Atlantique.\nEntre Netflix, le champion mondial du streaming, et la Warner, l’affaire semblait entendue. Mais la Paramount a contre-attaqué, avec une offre à 108 milliards de dollars. L\u0027entreprise est dirigée par David Ellison, le fils du milliardaire Larry Ellison, proche de Donald Trump. L\u0027affaire prend donc un tour politique. D\u0027autant que l\u0027offre comprend le rachat de la branche média de la Warner, propriétaire de la chaîne de télévision CNN. Donald Trump accuse depuis longtemps cette chaîne de servir ses opposants démocrates et d’être un « ennemi du peuple ». Un changement de propriétaire et de ligne éditoriale ne serait pas pour lui déplaire. S\u0027il se défend de toute ingérence dans ce dossier, il argue que Netflix, pour des raisons juridiques antitrust, ne pourrait peut-être pas racheter la Warner.\n\nLe président américain n\u0027est pas la seule personnalité au cœur du scandale Epstein. Andrew, le frère de l\u0027actuel roi Charles III, était également très proche du criminel sexuel. Virginia Giuffre, principale plaignante de l’affaire Jeffrey Epstein, avait pris la parole pour expliquer qu\u0027Andrew l\u0027avait violée. Andrew a depuis été déchu de son titre de prince et s\u0027est vu retirer toutes les distinctions honorifiques liées à celui-ci.\n\nQue savait Donald Trump des crimes de Jeffrey Epstein ?\nComment le président américain compte-t-il peser dans le rachat de la Warner ?\nCombien de personnalités ont-elles été impliquées dans les crimes de Jeffrey Epstein ?\n\nNos experts :\n- Laurence HAIM - Journaliste, ancienne correspondante aux États-Unis - Auteure de « Ghislaine Maxwell, une femme amoureuse »\n- Lucas MENGET - Grand reporter\n- Jean-Bernard CADIER - Journaliste, ancien correspondant aux États-Unis - Auteur de « Néron à la Maison Blanche »\n- Anne TOULOUSE - Journaliste franco-américaine - Auteure de « L’art de trumper »\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-12T23:00:23Z",
      "duration": "01:03:50",
      "explicit": false,
      "youTubeId": "AvSiLElG22A",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Qanon",
        "School of Philosophy and Economic Science",
        "Nine O\u0027Clock Service"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AvSiLElG22A"
      }
    }
  ]
}