{
  "id": "f77c52ff-1552-4b21-9274-3044ca290f2f",
  "name": "C dans l\u0027air - France Télévisions",
  "youTubeChannelId": "UCvg4_wSz4Cmo4xRPXaKU47A",
  "episodes": [
    {
      "id": "30133f78-93a2-4636-8bf6-8dc193bd3a9c",
      "title": "L\u0027affaire Epstein aux États-Unis",
      "description": "Zoom sur une propriété où s\u0027est rendu à maintes reprises le prince Andrew, le \u0022Zorro Ranch\u0022 au Nouveau-Mexique. Une propriété ultra-secrète d\u0027Epstein qui est la seule à ne pas avoir été perquisitionnée. C\u0027est l\u0027État du sud des États-Unis qui a lancé une enquête pour comprendre ce qui a pu se passer dans ce domaine au coeur de nombreuses accusations de trafic sexuel.\nUn reportage de Juliette Perrot et Nicolas Baudry d\u0027Asson\n\nNos experts :\n- Adélaïde DE CLERMONT-TONNERRE - Journaliste et romancière\n- Anne-Elisabeth MOUTET - Éditorialiste - The Daily Telegraph \n- Audrey GOUTARD - Grand reporter - France Télévisions, spécialiste des faits de société\n- Nicole BACHARAN - Historienne et politologue, spécialiste des États-Unis\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-20T08:01:22Z",
      "duration": "00:10:28",
      "explicit": false,
      "youTubeId": "zJnL79zEJL8",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zJnL79zEJL8"
      }
    },
    {
      "id": "37b78a8f-5014-40e8-afe4-82b0918a0ce5",
      "title": "Affaire Epstein : entretien avec Thysia Huisman, accusatrice de Jean-Luc Brunel",
      "description": "Elle pense que la justice française les a laissée tomber. Thysia Huisman est une victime présumée de Jean-Luc Brunel. Elle est mannequin, tout juste majeure en 1991, quand elle tombe dans les filets de celui qu\u0027elle qualifie de prédateur.\nUn reportage de Nicolas Bidard et Christophe Roqué dans #cdanslair.\n\nNos experts :\n- Laurent Valdiguié - Journaliste d’investigation Marianne\n- Audrey Goutard - Grand reporter France Télévisions, spécialiste des faits de société\n- Caroline Vigoureux - Journaliste en charge des questions de société La Tribune Dimanche \n- Nicole Bacharan - Historienne et politologue, spécialiste des États-Unis, éditorialiste Ouest France\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-18T15:01:09Z",
      "duration": "00:08:05",
      "explicit": false,
      "youTubeId": "dw_pzIjNLak",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dw_pzIjNLak"
      }
    },
    {
      "id": "f7772277-f370-46b5-b584-344a4ac6d7ba",
      "title": "Epstein, une affaire judiciaire française",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nIl a fallu la publication des Epstein Files, la pression médiatique, celle des associations de victimes, pour que la justice décide de s\u0027emparer à nouveau des éléments du volet français de l\u0027affaire. L\u0027enquête avait été suspendue à la mort de Jean-Luc Brunel, proche du criminel, et mis en cause pour viol. La brigade financière, de son côté, se penche maintenant sur le cas de la famille Lang, avec des perquisitions menées hier.\n\n\nUn reportage de Léo Seux et Michel Bouilly\n\n\nNos experts :\n- Laurent Valdiguié - Journaliste d’investigation Marianne\n- Audrey Goutard - Grand reporter France Télévisions, spécialiste des faits de société\n- Caroline Vigoureux - Journaliste en charge des questions de société La Tribune Dimanche \n- Nicole Bacharan - Historienne et politologue, spécialiste des États-Unis, éditorialiste Ouest France\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-18T08:01:25Z",
      "duration": "00:08:14",
      "explicit": false,
      "youTubeId": "yD0wErl-NDk",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yD0wErl-NDk"
      }
    },
    {
      "id": "7cbec4f9-c19a-4cb0-a2db-27bc5de82e52",
      "title": "Epstein : une affaire française",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nLe séisme Epstein n\u0027en finit plus de produire ses répliques en France. Lundi, des perquisitions ont été menées dans plusieurs lieux, dont l’Institut du monde arabe (IMA), à Paris, dans le cadre de l’enquête visant Jack Lang pour ses liens financiers présumés avec Jeffrey Epstein. Le Parquet national financier (PNF) a ouvert, le 6 février, une enquête pour soupçons de « blanchiment de fraude fiscale aggravée » visant l’ex-ministre et sa fille, Caroline Lang.\n\n\nParallèlement, la justice a désigné plusieurs magistrats référents pour repérer « d’éventuelles infractions liées à des ressortissants français » dans cette affaire tentaculaire Epstein. En pratique, ils vont passer au crible les millions de documents diffusés par la justice américaine mi-janvier, en coordination avec le PNF. Au-delà de ce travail sur ces archives, le parquet de Paris a été saisi de plusieurs affaires distinctes impliquant des ressortissants français.\n\n\nD’abord, celle concernant le diplomate Fabrice Aidan, après un signalement du ministère des Affaires étrangères à la suite des révélations de Mediapart et Radio France. Celui qui était conseiller à la représentation permanente de la France à l’ONU avait été soupçonné, en 2013 – via une enquête du FBI – d’avoir consulté des fichiers pédopornographiques. Le diplomate avait alors dû quitter son poste à l’ONU et les États-Unis pour revenir en France, où il a poursuivi sa carrière.\n\n\nLa Cellule investigation de Radio France a révélé hier que le diplomate, dont le nom est cité à de nombreuses reprises dans les « Epstein Files », a par la suite fait l’objet d’une enquête classée sans suite en France pour d’autres faits à caractère pédocriminel. En 2020, alors qu\u0027il était conseiller au cabinet d\u0027Audrey Azoulay, directrice générale à l\u0027UNESCO, Fabrice Aidan a été ciblé par une enquête de la Brigade de protection des mineurs de la Préfecture de police de Paris pour « tentative de corruption de mineur ». La procédure a abouti à un classement sans suite la même année.\n\n\nLe parquet de Paris a également reçu une plainte, déposée par la Suédoise Ebba Karlson, à l’encontre de Daniel Siad, proche de Jeffrey Epstein, qu’elle accuse de viol en 1990. Elle a reconnu son agresseur présumé à l’occasion de la publication des documents du financier américain.\n\n\nUne autre plainte, portant sur des faits de harcèlement sexuel qui auraient été commis en 2016, a été déposée à l’encontre du chef d’orchestre Frédéric Chaslin, également mentionné dans les « Epstein Files ». Cette procédure est en cours de réception et d’analyse par les magistrats.\nEnfin, la justice française a décidé une « réanalyse intégrale » du dossier de l’ex-agent de mannequins Jean-Luc Brunel, qui s’est suicidé en prison en février 2022. Il était alors incarcéré depuis un peu plus d’un an, mis en examen pour viol à la suite d’une première plainte en 2019, lorsque le scandale Epstein a éclaté. Lors de l’enquête de police, dix femmes ont mis en cause Jean-Luc Brunel pour des faits de viol, notamment sur mineure. À sa mort, l’action publique s’était éteinte. L’une de ses victimes présumées, Thysia Huisman, a accepté de témoigner au micro de #cdanslair.\n\n\nNos experts :\n- Laurent Valdiguié - Journaliste d’investigation Marianne\n- Audrey Goutard - Grand reporter France Télévisions, spécialiste des faits de société\n- Caroline Vigoureux - Journaliste en charge des questions de société La Tribune Dimanche \n- Nicole Bacharan - Historienne et politologue, spécialiste des États-Unis, éditorialiste Ouest France\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-17T17:56:46Z",
      "duration": "01:03:33",
      "explicit": false,
      "youTubeId": "R_yVVJSHM1I",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R_yVVJSHM1I"
      }
    },
    {
      "id": "42d05e71-ea2e-468f-9459-244968d347ae",
      "title": "Scandale Epstein en Grande-Bretagne",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nDeux familles royales en Europe vacillent depuis les révélations de l\u0027affaire Epstein. En Grande-Bretagne, le roi Charles est interpelé dans chaque déplacement et exprime \u0022sa profonde inquiétude\u0022 avec l\u0027implication de son frère Andrew dans le dossier. En Norvège, c\u0027est la princesse héritière qui doit se justifier sur ses nombreux échanges familiers et sa proximité avec le pédocriminel qu\u0027elle a assidument fréquenté.\nUn reportage de Léo Seux et Michel Bouilly\n\nNos experts : \n- Audrey Goutard - Grand reporter à France Télévisions\n- Valérie Cantié - Journaliste à Radio France\n- Richard Werly - Éditorialiste international \u0022Blick.ch\u0022\n- Anthony Bellanger - Éditorialiste à France Info TV\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-12T09:01:26Z",
      "duration": "00:08:42",
      "explicit": false,
      "youTubeId": "tID9EHPHLv4",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tID9EHPHLv4"
      }
    },
    {
      "id": "9bdbc059-cadc-49ac-b764-fe7a90c1b691",
      "title": "Ghislaine Maxwell, complice d\u0027Epstein",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nGhislaine Maxwell est restée mutique ce lundi 9 février 2026 face aux élus du Congrès. L\u0027avocat de la complice d\u0027Epstein n\u0027y va pas par quatre chemins et affirme de sa cliente parlera si elle obtient une grâce présidentielle de la part de Donald Trump. Emprisonnée au Texas, elle est celle qui détient tous les secrets.\nUn reportage de Romain Besnainou et Christophe Roqué\n\nNos experts : \n- Audrey Goutard - Grand reporter à France Télévisions\n- Valérie Cantié - Journaliste à Radio France\n- Richard Werly - Éditorialiste international \u0022Blick.ch\u0022\n- Anthony Bellanger - Éditorialiste à France Info TV\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-12T08:01:12Z",
      "duration": "00:11:07",
      "explicit": false,
      "youTubeId": "xknEnY8gHdA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xknEnY8gHdA"
      }
    },
    {
      "id": "b250f046-7d41-4cbd-8789-f92bf74d1850",
      "title": "Affaire Epstein : un diplomate français cité",
      "description": "Encore un rebondissement dans le volet français de l\u0027affaire Epstein. Un diplomate français en poste aux Nations Unies, Fabrice Aidan, a donc échangé des informations confidentielles avec le criminel. Il avait fait l\u0027objet d\u0027une enquête du FBI pour consultation d\u0027images pédopornographiques avant de quitter les États-Unis sans être inquiété par la suite. Le ministre des Affaires étrangères, Jean-Noël Barrot, se dit effaré par l\u0027affaire.\nUn reportage de Julie Ricco et Ilana Azencot.\n\nNos experts : \n- Audrey Goutard - Grand reporter à France Télévisions\n- Valérie Cantié - Journaliste à Radio France\n- Richard Werly - Éditorialiste international \u0022Blick.ch\u0022\n- Anthony Bellanger - Éditorialiste à France Info TV\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-12T07:00:15Z",
      "duration": "00:09:41",
      "explicit": false,
      "youTubeId": "IrDe8IacE-g",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IrDe8IacE-g"
      }
    },
    {
      "id": "8b77add9-cc80-491e-a9f7-7fed265fe161",
      "title": "Epstein : scandale au Quai d\u0027Orsay",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nLes secousses de l’affaire Epstein continuent en Europe, et notamment en France, où la justice est saisie après la mise en cause d’un diplomate français, Fabrice Aidan, qui a échangé de très nombreux mails avec le multimillionnaire entre 2010 et 2017. Son nom figure dans 200 documents récemment diffusés par les autorités américaines. Selon Mediapart et Radio France, il aurait fait bénéficier Jeffrey Epstein « d’informations diplomatiques, de services ou de ses réseaux à l’international ».\n\nObjet, en 2013, d’une enquête du FBI et d’une procédure disciplinaire interne de l’ONU pour des soupçons de consultation de sites pédopornographiques, le diplomate avait alors dû quitter son poste à l’ONU et les États-Unis. Il était auparavant placé sous l’autorité d’un autre diplomate, le Norvégien Terje Rød-Larsen. Ce dernier est également visé par une enquête en Norvège pour « complicité de corruption aggravée », dans le cadre de ses liens avec Epstein.\n\nJean-Noël Barrot, le ministre des Affaires étrangères, s’est dit ce matin effaré et indigné. « Quand j’ai pris connaissance de ces informations, j’ai fait ce que chacun aurait fait à ma place » en signalant les faits à la justice et en lançant une enquête administrative et une procédure disciplinaire, a déclaré le ministre, assurant qu’il n’avait découvert la situation que mardi.\n\nUne plainte pour des viols présumés remontant à 1990 a également été déposée auprès du parquet de Paris, hier, par une ancienne mannequin suédoise, aujourd’hui âgée de 56 ans, contre Damien Siad, dont le nom apparaît près de 2 000 fois parmi les trois millions de nouveaux fichiers déclassifiés par la justice américaine. Selon les informations de « L’Œil du 20 Heures » et de « Complément d’enquête », cet homme, chasseur de mannequins à l’époque, aurait présenté plusieurs femmes à Jeffrey Epstein, dont au moins quatre Françaises, dessinant les contours d’un volet parisien de l’affaire Epstein, lieu de vie privilégié du financier américain. « Toute la lumière doit être faite », a affirmé la porte-parole du gouvernement, Maud Bregeon, qui encourage « les femmes qui auraient été victimes » à parler et à « se tourner vers la justice ».\n\nAux États-Unis, point de départ de l’enquête, l’affaire Epstein continue également de provoquer des remous. L’ancien président Bill Clinton est assigné, avec son épouse, à comparaître devant le Congrès pour s’expliquer sur ses liens avec Jeffrey Epstein. Aucun acte répréhensible n’est recensé pour le moment, mais il est établi que les deux hommes étaient très proches. Bill Clinton devrait comparaître le 27 février, à condition que cette audition de la Chambre des représentants soit publique afin d’éviter toute récupération politique. \n\nParallèlement, des élus du Congrès ont pu examiner, lundi, des documents non caviardés du dossier. Ils évoquent six noms occultés, sans explication de la part du ministère américain de la Justice, et menacent de dévoiler l’identité de ces personnalités influentes, dont l’une serait un homme haut placé dans un gouvernement étranger. Sous la pression, le ministère de la Justice américain a finalement révélé le nom du PDG. Il s’agit de Leslie Wexner, ex-patron de l’entreprise de lingerie Victoria’s Secret.\n\nNos experts : \n- Audrey Goutard - Grand reporter à France Télévisions\n- Valérie Cantié - Journaliste à Radio France\n- Richard Werly - Éditorialiste international \u0022Blick.ch\u0022\n- Anthony Bellanger - Éditorialiste à France Info TV\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-11T18:18:25Z",
      "duration": "01:02:23",
      "explicit": false,
      "youTubeId": "hk0Jk_W9mJo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hk0Jk_W9mJo"
      }
    },
    {
      "id": "051cf5d7-f2ce-404d-8bf6-799e14d2864e",
      "title": "Epstein : une affaire d\u0027espions ?",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nVincent Crouzet est ancien espion de la DGSE. Il publie \u0022Le jour où je suis devenu espion\u0022, aux éditions de l\u0027Observatoire. Livre dans lequel il raconte 20 ans d\u0027espionnage pour la France.\n\n\nIl raconte comment il est passé de jeune sportif grenoblois à espion professionnel, dévoile les qualités recherchées et la formation des agents secrets, évoque ses missions en Afrique auprès de criminels de guerre comme Jonas Savimbi, et explique comment il a géré le mensonge permanent vis-à-vis de sa famille. Il aborde également l\u0027évolution du métier d\u0027espion et compare la réalité aux séries télévisées.\n\n\nVincent Crouzet est ancien espion de la DGSE, est notre invité. Devenu écrivain et expert en renseignement, il analysera également le rôle actuel de la DGSE face aux nouvelles menaces.  \n\n\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-10T16:42:11Z",
      "duration": "00:11:04",
      "explicit": false,
      "youTubeId": "p9ACEz_SoPs",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=p9ACEz_SoPs"
      }
    },
    {
      "id": "79ce8741-8d85-461d-959c-1df113349c4b",
      "title": "Scandale Epstein : démissions en série...",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nLes répliques de l’affaire Epstein ont continué de se faire sentir ce week-end, avec notamment en France la démission de Jack Lang de la présidence de l’Institut du monde arabe (IMA), l’institution culturelle et diplomatique qu’il pilotait depuis treize ans. L’ancien ministre socialiste de la Culture était, depuis une semaine, cerné par des appels à quitter la présidence de l’institution et sommé de s\u0027expliquer dimanche auprès du ministre des Affaires étrangères sur ses liens avec Jeffrey Epstein. Les documents et mails rendus publics par la justice américaine ont révélé les petits et grands services qu’Epstein et Lang se sont rendus entre le milieu des années 2000 et 2019, ainsi que le partenariat financier conclu par sa fille, Caroline, avec le businessman américain. Jack Lang répète qu’il ne savait rien des crimes sexuels de l’homme d’affaires américain. Mais le Parquet national financier a ouvert une enquête préliminaire vendredi pour « blanchiment illégal aggravé » à propos de la création d’une société offshore par Jeffrey Epstein et Caroline Lang, basée dans les îles Vierges américaines, un paradis fiscal.\nOutre-Manche, le gouvernement travailliste est plongé dans une crise sans précédent depuis les dernières révélations concernant les liens entre Peter Mandelson et Jeffrey Epstein, et certains, jusque dans son propre camp, appellent au départ de Keir Starmer. Celui-ci avait nommé l’ex-ministre et commissaire européen à ce poste en décembre 2024, puis l’avait démis de ses fonctions en septembre 2025 après la publication de documents dans le dossier Epstein. Selon les derniers documents publiés par le ministère de la Justice des États-Unis, Peter Mandelson aurait transmis à Jeffrey Epstein des informations susceptibles d’influer sur les marchés, notamment lorsqu’il était ministre dans le gouvernement travailliste de Gordon Brown entre 2008 et 2010. La police britannique a ouvert une enquête et mené des perquisitions. À Downing Street, Morgan McSweeney, considéré comme le stratège du pouvoir travailliste, véritable bras droit et éminence grise de Keir Starmer, a démissionné, ainsi que son directeur de la communication, Tim Allan. Le Premier ministre britannique, Keir Starmer, a affirmé regretter d’avoir nommé Peter Mandelson. Il s’est excusé auprès des victimes de Jeffrey Epstein, mais a assuré qu’il ne connaissait pas l’ampleur de ses liens avec le pédocriminel et a écarté l’hypothèse d’un départ.Parallèlement, la police britannique a indiqué ce lundi « examiner » des informations selon lesquelles l’ex-prince Andrew pourrait avoir transmis au pédocriminel Jeffrey Epstein des informations confidentielles.\nLe séisme de l’affaire Epstein n’a pas fini de susciter des répliques. Plus de six ans après la mort du criminel sexuel, retrouvé pendu dans sa cellule d’une prison new-yorkaise, la récente publication de trois millions de pages supplémentaires a mis au jour l’incroyable réseau planétaire tissé par le pédophile. Des millions de documents, dont un grand nombre ont été caviardés par l’administration Trump, provoquant l’emballement des réseaux sociaux et nourrissant les pires théories complotistes.\n\n\nNos experts :\n- Bruno JEUDY - Directeur délégué et éditorialiste à La Tribune Dimanche \n- Anne-Elisabeth MOUTET - Journaliste franco-américaine, éditorialiste au Daily Telegraph \n- Marion SOLLETTY - Grand reporter à Politico\n- Audrey GOUTARD - Grand reporter à France Télévisions, spécialiste des faits de société \n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-09T17:56:23Z",
      "duration": "01:03:30",
      "explicit": false,
      "youTubeId": "eCVE0ws02qc",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eCVE0ws02qc"
      }
    },
    {
      "id": "f980d93c-102a-4ecb-87d0-fb71929ae05d",
      "title": "Affaire Epstein",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nJack Lang et sa femme ont été placés aujourd\u0027hui sous protection policière en raison de menaces sur les réseaux sociaux. L\u0027ancien ministre de la Culture, qui se disait blanc comme neige la semaine dernière, a fini par démissionner samedi dans l\u0027après-midi de son poste de président de l\u0027Institut du monde arabe.\n\n\nUn reportage de Magali Lacroze et Christophe Roqué\n\n\nNos experts :\n- Bruno JEUDY - Directeur délégué et éditorialiste à La Tribune Dimanche \n- Anne-Elisabeth MOUTET - Journaliste franco-américaine, éditorialiste au Daily Telegraph \n- Marion SOLLETTY - Grand reporter à Politico\n- Audrey GOUTARD - Grand reporter à France Télévisions, spécialiste des faits de société \n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-09T17:07:02Z",
      "duration": "00:08:12",
      "explicit": false,
      "youTubeId": "OOWPlwcuTEM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OOWPlwcuTEM"
      }
    },
    {
      "id": "d9f28b06-2705-4545-8fe8-5ca50f1b3633",
      "title": "Epstein et le monde de la tech",
      "description": "Cette affaire Epstein secoue aussi le monde de la tech. On lit dans les fichiers qu\u0027à la fois Elon Musk, Bill Gates et Reid Hoffman, le patron de LinkedIn, étaient en relation avec Jeffrey Epstein. Bill Gates est sorti de son silence cette semaine pour dire ses regrets.\n\nUn reportage de Léa Demirdjian et Christophe Roqué.\n\nNos experts :\n- Régis GENTÉ - Journaliste spécialiste des questions internationales, auteur de « Notre homme à Washington »\n- Nicole BACHARAN - Historienne et politologue, spécialiste des Etats-Unis, auteure de “ Requiem pour le monde libre ”\n- Marie JÉGO - Journaliste - Le Monde, ancienne correspondante à Moscou\n- Dominique SEUX- Éditorialiste - Les Echos et France Inter\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-07T15:00:04Z",
      "duration": "00:08:24",
      "explicit": false,
      "youTubeId": "asvY71neLlI",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=asvY71neLlI"
      }
    },
    {
      "id": "840cc3b5-710d-45e7-bc70-0bed70eccb19",
      "title": "Epstein : qui s\u0027en prend à Macron",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nDes fausses informations sur une implication du président de la République dans l\u0027affaire Epstein : il prétend, par exemple, qu\u0027il allait régulièrement au domicile parisien de Jeffrey Epstein.\n\n\nUn reportage de Léo Seux et Aurélie Sanner.\n\n\nNos experts :\n- Régis GENTÉ - Journaliste spécialiste des questions internationales, auteur de « Notre homme à Washington »\n- Nicole BACHARAN - Historienne et politologue, spécialiste des Etats-Unis, auteure de “ Requiem pour le monde libre ”\n- Marie JÉGO - Journaliste - Le Monde, ancienne correspondante à Moscou\n- Dominique SEUX- Éditorialiste - Les Echos et France Inter\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-07T08:00:50Z",
      "duration": "00:08:07",
      "explicit": false,
      "youTubeId": "d-O0xj4f4XA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d-O0xj4f4XA"
      }
    },
    {
      "id": "71103063-df69-4bd3-a700-e7b1f3076349",
      "title": "Affaire Epstein",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nDans cette affaire, celles qu\u0027on oublie souvent, ce sont les victimes. Dans la dernière salve de documents rendus publics par la justice américaine, le nom de certaines d\u0027entre elles, avec des photos et parfois même des coordonnées bancaires, ont été dévoilés. Le gouvernement s\u0027était pourtant engagé à les protéger.\n\nUn reportage de Anne Maquignon et Nicolas Baudry d\u0027Asson.\n\nNos experts :\n\n- Christophe BARBIER - Éditorialiste politique, conseiller de la rédaction - Franc-Tireur \n- Virginie VILAR - Grand reporter à Complément d’enquête - France Télévisions, réalisatrice de l’enquête Les derniers mystères de l’Affaire Epstein\n- Audrey GOUTARD - Grand reporter - France Télévisions, spécialiste des faits de société\n- Richard WERLY - Éditorialiste international - Blick.ch, auteur de Cette Amérique qui nous déteste\n- Marie BILLON ( en duplex) – Correspondante à Londres - RTL\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-05T09:00:40Z",
      "duration": "00:08:34",
      "explicit": false,
      "youTubeId": "T4Q2ok3Gp54",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T4Q2ok3Gp54"
      }
    },
    {
      "id": "9443a7de-c34c-42b4-bdf2-2a3098f2187e",
      "title": "Epstein au Royaume-Uni",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nL\u0027onde de choc du dossier Epstein touche la couronne britannique, mais aussi le gouvernement travailliste. Le prince Andrew, déjà déchu de ses titres, a dû quitter la résidence princière après la publication de nouvelles photos. Quant au gouvernement de Keir Starmer, il se retrouve fragilisé par la mise en cause d\u0027un ex-ambassadeur accusé d\u0027avoir divulgué des informations sensibles.\n\nUn reportage de Magali Lacroze et Christophe Roqué.\n\nNos experts :\n\n- Christophe BARBIER - Éditorialiste politique, conseiller de la rédaction - Franc-Tireur \n- Virginie VILAR - Grand reporter à Complément d’enquête - France Télévisions, réalisatrice de l’enquête Les derniers mystères de l’Affaire Epstein\n- Audrey GOUTARD - Grand reporter - France Télévisions, spécialiste des faits de société\n- Richard WERLY - Éditorialiste international - Blick.ch, auteur de Cette Amérique qui nous déteste\n- Marie BILLON ( en duplex) – Correspondante à Londres - RTL\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-05T08:01:13Z",
      "duration": "00:08:59",
      "explicit": false,
      "youTubeId": "yWlBheiPmug",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yWlBheiPmug"
      }
    },
    {
      "id": "2c9dd0af-c8af-4ae6-b03d-8a6cd94ee734",
      "title": "Affaire Epstein",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nL\u0027affaire Epstein prend un tournant politique aussi en France. La France Insoumise réclame une commission d\u0027enquête sur le volet pédocriminel et financier de ce tentaculaire dossier. Face à la pression, ce matin, Jack Lang a tenté de donner des explications sur ses liens avec le financier. Sa fille, Caroline Lang, avait elle cofondé une société avec Jeffrey Epstein\n\nUn reportage de Romain Besnainou et Aurélie Sanner.\n\nNos experts :\n\n- Christophe BARBIER - Éditorialiste politique, conseiller de la rédaction - Franc-Tireur \n- Virginie VILAR - Grand reporter à Complément d’enquête - France Télévisions, réalisatrice de l’enquête Les derniers mystères de l’Affaire Epstein\n- Audrey GOUTARD - Grand reporter - France Télévisions, spécialiste des faits de société\n- Richard WERLY - Éditorialiste international - Blick.ch, auteur de Cette Amérique qui nous déteste\n- Marie BILLON ( en duplex) – Correspondante à Londres - RTL\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-05T07:00:28Z",
      "duration": "00:08:51",
      "explicit": false,
      "youTubeId": "ebB-gVJzUWU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ebB-gVJzUWU"
      }
    },
    {
      "id": "0ed28bce-98f1-474e-9726-f1cad03e3589",
      "title": "Révélations du dossier Epstein",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nMalgré l\u0027avalanche de documents et les dernières révélations, la justice américaine l\u0027assure : « il n\u0027y a pas matière à poursuites judiciaires ». Pour l\u0027instant, Donald Trump parvient à tenir à distance le poison lent de l\u0027affaire Epstein. Mais lorsqu\u0027elle s\u0027invite lors de la prestigieuse cérémonie des Grammy Awards, le chef de la Maison-Blanche perd son sens de l\u0027humour.\n\nUn reportage de Juliette Wallon et Nicolas Baudry d\u0027Asson.\n\nNos experts :\n- James ANDRÉ  - Grand reporter - France 24\n- Anne-Elisabeth MOUTET - Editorialiste - The Daily Telegraph \n- Anne TOULOUSE - Journaliste franco-américaine et autrice de « L’art de trumper »\n- Vincent JOLLY - Grand Reporter - Le Figaro Magazine \n- Sonia DRIDI (en duplex de Washington)  - Correspondante aux Etats-Unis – LCI et France 24 \n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-03T08:00:06Z",
      "duration": "00:09:28",
      "explicit": false,
      "youTubeId": "6COkjxhT2zY",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6COkjxhT2zY"
      }
    },
    {
      "id": "65b5fec0-6f62-48c5-9c2d-3e003330cefc",
      "title": "Affaire Epstein : le poison lent",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nTrois millions de pages supplémentaires du dossier, dont plus de 2 000 vidéos et 180 000 images. C’est la dernière réplique du séisme Jeffrey Epstein, qui secoue les États-Unis et fragilise Donald Trump. Le nom du président des États-Unis apparaît plus de 3 000 fois dans la dernière salve de documents publiée vendredi dernier par le ministère de la Justice américaine, notamment dans une plainte pour viol sur une mineure de 13 ans.\n\n\nLe FBI a pris ses distances avec ces révélations, indiquant que tous les éléments du dossier Epstein doivent être rendus publics, qu’ils soient vérifiés ou non. Dans un communiqué repris par nos confrères de CNN, la Maison-Blanche a expliqué que « ce dossier peut contenir des images, des documents ou des vidéos falsifiés ou soumis de manière mensongère […] Certains documents contiennent des allégations mensongères et sensationnalistes contre le président Trump, soumises au FBI juste avant l’élection de 2020 ».\n\n\nLe numéro deux du ministère de la Justice, Todd Blanche, a également réaffirmé dimanche sur CNN n’avoir trouvé « aucun élément susceptible d’engager des poursuites », même si les documents renferment des contenus jugés « troublants ». Les nombreuses mentions du président Donald Trump relèveraient pour l’essentiel de « signalements anonymes » ou « invérifiables », insuffisants au regard des standards judiciaires. « Le monde entier peut regarder et voir si nous nous sommes trompés », a-t-il déclaré.\n\n\nSur les plateaux de télévision et dans les rédactions, les journalistes tentent de démêler le vrai du faux dans la dernière salve de documents du dossier du prédateur sexuel, mort en prison en 2019. On y trouve des correspondances privées du financier par e-mail, des échanges par SMS, des documents judiciaires et des notes de police, qui dessinent une immense toile relationnelle entre puissants, à la croisée de la politique, de la diplomatie, du spectacle et de l’économie.\n\n\nOutre le président américain Donald Trump, sont cités Melania Trump, le ministre du Commerce américain Howard Lutnick, mais aussi Bill Gates, Richard Branson, Elon Musk, le prince déchu Andrew, frère du roi Charles III, Casey Wasserman, président du comité des Jeux olympiques de Los Angeles 2028, la famille Lang ou encore l’ancien président Bill Clinton.\n\n\nDes millions de documents ont été révélés, et l’administration Trump, sous le feu des critiques, est accusée de ralentir la divulgation de documents pourtant votée par le Congrès et de caviarder de nombreuses pièces.\nRo Khanna, l’élu démocrate de Californie à l’initiative de la loi obligeant le ministère de la Justice à publier l’intégralité du dossier Epstein, a déclaré dimanche sur NBC News que la dernière livraison n’était toujours « pas suffisante ». « Si nous n’obtenons pas les dossiers restants, alors Thomas Massie [élu républicain du Kentucky] et moi-même sommes prêts à entamer une procédure de destitution ou d’outrage » contre la procureure générale Pam Bondi, a-t-il menacé. Par ailleurs, a-t-il insisté, les hommes dont les noms figurent dans les dossiers devraient a minima faire l’objet d’un « examen approfondi », à défaut de poursuites.\nAlors, que nous apprennent les nouveaux documents publiés du dossier Epstein ? Cette affaire peut-elle faire vaciller Donald Trump à dix mois des midterms ? Pourquoi le couple Clinton est-il accusé d’« entrave » au Congrès américain ?\n\n\nNos experts :\n- James ANDRÉ  - Grand reporter - France 24\n- Anne-Elisabeth MOUTET - Editorialiste - The Daily Telegraph \n- Anne TOULOUSE - Journaliste franco-américaine et autrice de « L’art de trumper »\n- Vincent JOLLY - Grand Reporter - Le Figaro Magazine \n- Sonia DRIDI (en duplex de Washington)  - Correspondante aux Etats-Unis – LCI et France 24 \n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-02T17:57:19Z",
      "duration": "01:03:41",
      "explicit": false,
      "youTubeId": "XUJAKou4tGI",
      "subjects": [
        "_America",
        "Human Trafficking",
        "La Famille"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XUJAKou4tGI"
      }
    },
    {
      "id": "df70cd60-48e9-4cdf-a8c1-ced066843c24",
      "title": "Epstein : nouvelles publications du dossier",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nIl aura fallu attendre un mois après la date limite pour avoir accès aux fichiers de l\u0027affaire Epstein. Qu\u0027apprend-on exactement sur la relation qu\u0027avait l\u0027actuel président Donald Trump avec Harvey Epstein ? L\u0027affaire se rapproche de la Maison-Blanche aussi parce que l\u0027actuel ministre du Commerce, Howard Lutnick, est cité. Il y a aussi des révélations sur Elon Musk et sur l\u0027ancien Prince Andrew.\nUn reportage de Constance Meyer et Aurélie Sanner\n\nNos experts :\n- Alain Bauer - Essayiste, professeur émérite de criminologie au Conservatoire national des arts et métiers et auteur de \u0022Trump le pouvoir des mots\u0022\n- Nicole Bacharan - Historienne et politologue, spécialiste des États-Unis et co-autrice de \u0022Requiem pour le monde libre\u0022\n- Amy Greene - Politologue et experte associée à l’Institut Montaigne\n- Anthony Bellanger - Éditorialiste Franceinfo TV et spécialiste des questions internationales\n- Romuald Sciora - Essayiste et directeur de l\u0027Observatoire politique et géostratégique des États-Unis de l\u0027IRIS\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-02-01T07:00:29Z",
      "duration": "00:11:28",
      "explicit": false,
      "youTubeId": "OEfOiQYCOH8",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OEfOiQYCOH8"
      }
    },
    {
      "id": "e9d209bf-1609-4ba8-a0e6-f4147fb3c5c2",
      "title": "Trump, prince Andrew, Musk : les dernières révélations du dossier Epstein",
      "description": "C\u0027est un feuilleton qui n\u0027a pas fini de passionner les États-Unis. Le numéro deux du ministère de la justice américain, Todd Blanche, a annoncé vendredi la publication de « plus de 3 millions de pages » supplémentaires « du dossier Epstein », dont « plus de 2 000 vidéos et 180 000 images ». La publication s\u0027inscrit dans une loi votée par le Congrès qui force le gouvernement à publier le dossier, malgré la réticence de Donald Trump, ancien ami du sulfureux homme d\u0027affaire newyorkais, décédé en prison. Ces derniers mois, le président américain, qui avait promis de faire la lumière sur le scandale, n\u0027a cessé de changer de position. D\u0027abord favorable à la publication, il s\u0027est ensuite rétracté, allant jusqu\u0027à menacer sa ministre de la justice Pam Bondi, qui prenait le dossier un peu trop à cœur.\n\nSur le plan International, Donald Trump continue de mettre la pression sur l\u0027Iran après la répression sanglante des manifestations contre le régime islamique. Le président américain applique sa méthode préférée : mettre la pression sur son adversaire pour le pousser à la négociation. Après avoir annoncé cette semaine l\u0027envoi d\u0027une \u0022énorme armada\u0022 dans le Golfe persique, le locataire de la Maison Blanche a assuré vendredi que l’Iran « veut conclure un accord » avec les Etats-Unis. Washington veut notamment pousser Téhéran à abandonner son programme d\u0027enrichissement d\u0027uranium, un sujet hautement sensible.\n\nAutre inquiétude pour Donald Trump, l\u0027inflation qui stagne à 2,7 %, bien au-dessus de la cible des 2 % fixée par la Réserve fédérale américaine. Son président, Jerome Powell, est d\u0027ailleurs régulièrement ciblé par la Maison Blanche qui lui reproche de ne pas faire baisser les taux directeurs. Malgré trois baisses d’un quart de point fin 2025, les prix de l\u0027énergie se sont envolés sur les douze derniers mois : \u002B 6,7 % pour l\u0027électricité et 10,8 % pour le gaz. En plus de cette hausse des prix, Donald Trump doit gérer les émeutes contre ICE à Minneapolis, où deux Américains ont été tués par des agents de police ces dernières semaines. Plusieurs milliers d\u0027Américains ont manifesté hier, à Minneapolis, pour protester contre la violence des opérations.\n\nQue contiennent les nouveaux documents publiés par la Maison Blanche sur l\u0027affaire Epstein ? Pourquoi l\u0027inflation américaine est devenue une inquiétude majeure pour Donald Trump ? Et le président peut-il faire céder l\u0027Iran ?\n\nNos experts :\n- Alain Bauer - Essayiste, professeur émérite de criminologie au Conservatoire national des arts et métiers et auteur de \u0022Trump le pouvoir des mots\u0022\n- Nicole Bacharan - Historienne et politologue, spécialiste des États-Unis et co-autrice de \u0022Requiem pour le monde libre\u0022\n- Amy Greene - Politologue et experte associée à l’Institut Montaigne\n- Anthony Bellanger - Éditorialiste Franceinfo TV et spécialiste des questions internationales\n- Romuald Sciora - Essayiste et directeur de l\u0027Observatoire politique et géostratégique des États-Unis de l\u0027IRIS\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-31T18:55:08Z",
      "duration": "01:04:44",
      "explicit": false,
      "youTubeId": "YwdCVMozlAs",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YwdCVMozlAs"
      }
    },
    {
      "id": "bbb180c8-6412-48ad-ba7b-0235bccc348e",
      "title": "Trump dans le piège de l\u0027affaire Epstein  -  C dans l’air - 30.12.2025",
      "description": "L’affaire Epstein continue de secouer l’Amérique et de hanter Donald Trump. Une nouvelle salve de 11 000 documents concernant cette affaire judiciaire a été publiée la semaine dernière et le nom du président des États-Unis apparaît à plusieurs reprises. Il s’agit pour la plupart d’articles de presse le mentionnant, mais un courriel provenant d’un procureur fédéral indique que Donald Trump est présent sur la liste des passagers de l’avion privé de Jeffrey Epstein d’« au moins huit vols entre 1993 et 1996 », dont une fois avec pour seuls autres voyageurs l’ancien financier et une personne âgée de 20 ans.Ancien ami d’Epstein, Donald Trump a reconnu l’avoir fréquenté, mais assure s’en être rapidement éloigné dès que ses activités criminelles ont été révélées. Sur son réseau Truth Social, il a également dénoncé ce qu’il qualifie de « canular orchestré par les démocrates » et a insisté sur le fait que « ce sont les démocrates qui ont collaboré avec Epstein, pas les républicains. Qu’on publie tous leurs noms, qu’on les couvre de honte et qu’on se remette au travail pour notre pays ! » Le président n’a toutefois cité aucun nom précis et n’a fourni aucun élément permettant d’étayer ses accusations.Cette sortie intervient alors que plusieurs figures démocrates et républicaines réclament une transparence totale sur les relations d’Epstein, quel que soit le camp politique concerné, et critiquent le nombre de caviardages effectués par le ministère de la Justice sur les documents rendus publics. Des photos et des textes caviardés qui ne satisfont pas les victimes, plusieurs législateurs, mais aussi nombre de membres du mouvement MAGA, déchiré depuis la démission de Marjorie Taylor Greene. Cette figure emblématique du mouvement Make America Great Again reproche au président de manquer de transparence dans ce scandale politico-judiciaire.Empêtré dans cette affaire Epstein, Donald Trump doit faire face au mécontentement croissant de ses concitoyens. 68 % des Américains jugent que l’économie américaine se porte mal, selon un sondage de l’agence AP, alors que l’inflation s’accélère dans le pays depuis son retour à la Maison Blanche. Nos journalistes sont allés à leur rencontre au Texas.Alors, que contiennent les nouveaux documents publiés ? Que sait-on des liens entre Donald Trump et Jeffrey Epstein ? Pourquoi le transfert de prison de Ghislaine Maxwell suscite-t-il la polémique ? Cette affaire peut-elle provoquer la chute du président des États-Unis ?\nNos experts :- Laurence Haïm - Journaliste, ancienne correspondante aux États-Unis, auteure de Ghislaine Maxwell, une femme amoureuse de Robert Laffont.- Anthony Bellanger - Éditorialiste – Franceinfo TV, spécialiste des questions internationales- Anne Deysine - Juriste et politologue, spécialiste des États-Unis, auteure de Les juges contre l’Amérique - Anne Toulouse - Journaliste franco-américaine, auteure de L’art de Trumper, publié aux éditions du Rocher De retour tout juste des États-Unis\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-29T23:00:35Z",
      "duration": "01:04:20",
      "explicit": false,
      "youTubeId": "MvjHvrhvcpA",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MvjHvrhvcpA"
      }
    },
    {
      "id": "fc2eb160-29a0-4ad5-82e0-693754fcc43f",
      "title": "Epstein / Trump : dissimulations et scandale d\u0027État  -  C dans l’air - 20.12.2025",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\nEpstein / Trump : dissimulations et scandale d\u0027État\n\nCette fois, c\u0027est en ligne. Quelque 3 965 documents judiciaires relatifs à l\u0027affaire du criminel sexuel Jeffrey Epstein ont été rendus publics hier par le ministère de la justice américain.\nUne loi adoptée par le Congrès en novembre imposait au gouvernement de publier l’intégralité des documents non classifiés en sa possession au plus tard hier. Or, seule une partie de ces pièces a été révélée. Le processus se fera finalement sur plusieurs semaines.\nCes documents issus de l’enquête sur l’influent financier, mort en prison en 2019, sont censés faire la lumière sur ses liens avec des figures du monde des affaires, du spectacle ou de la politique, et notamment avec l\u0027actuel président des Etats-Unis, Donald Trump.\nLe locataire de la Maison-Blanche est plus que jamais sous pression. D\u0027autant que la publication de ces premiers fichiers renforce la controverse dont il est l\u0027objet. La montagne d’informations a en effet été partiellement expurgée. Des pages entières ont été caviardées. Des omissions ont été effectuées pour protéger les victimes et les enquêtes en cours, comme celles sur les liens d’Epstein avec l’ancien président Bill Clinton et l’ex-directeur de Harvard, Larry Summers, mais aussi pour des questions de « sécurité nationale ». Cela confère au ministère de la Justice une marge de manœuvre illimitée sur le choix de ce qui est divulgué.\n« Ce n’est rien d’autre qu’une opération de camouflage pour protéger Donald Trump de son passé peu reluisant », a tonné le chef des sénateurs démocrates, Chuck Schumer, accusant le gouvernement de « tout faire pour cacher la vérité ».\n\nL’affaire Epstein n’est pas la seule pour laquelle le comportement du milliardaire est pointé du doigt. Déjà reconnu responsable d’agression sexuelle, auteur de nombreux propos sexistes et méprisants depuis des années, le président des Etats-Unis est critiqué pour son comportement inapproprié voire totalement délictuel envers les femmes. Lui s\u0027en tient toujours à une stratégie de déni.\n\nQue contiennent les fichiers du dossier Epstein rendus publics hier ?\nQue Donald Trump savait-il de ce scandale de corruption et d’esclavagisme sexuel sur mineur ?\nComment est-il parvenu à faire carrière en politique malgré les accusations et les condamnations dont il est l\u0027objet ?\n\nNos experts :\n- Corentin SELLIN - Historien spécialiste des États-Unis - Chroniqueur - « Les Jours »\n- Lucas MENGET - Grand reporter\n- Nicolas BARRÉ - Directeur de la rédaction - « Politico »\n- Camille GUTTIN - Reporter – Correspondante à Washington de 2022 à 2025\n- Sonia DRIDI - Correspondante aux Etats-Unis – LCI et France 24 (Duplex à Washington)\n- Olivier PITON - Avocat aux barreaux de Paris et de Washington D.C.\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-19T23:00:06Z",
      "duration": "01:03:32",
      "explicit": false,
      "youTubeId": "4haMbbLJFC0",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4haMbbLJFC0"
      }
    },
    {
      "id": "ce86c5f9-1c97-4a8b-8133-31d4add84b39",
      "title": "Epstein : l\u0027affaire du doigt d\u0027honneur",
      "description": "Les Clinton partent au combat contre Donald Trump. Le couple a refusé de répondre aux question du Congrès sur ses liens avec Jeffrey Epstein. Ils prennent ainsi le risque de poursuites judiciaires. Quant à Donald Trump, il a fait un doigt d\u0027honneur à un ouvrier qui l\u0027interpellait sur cette affaire.\nUn reportage de Mathieu Ligneau et Nicolas Baudry d\u0027Asson\n\nNos experts :\n- David THOMSON - Journaliste spécialiste du mouvement MAGA, auteur du documentaire « J.D Vance : la revanche d\u0027une Amérique »\n- Laurence HAÏM - Ancienne correspondante aux États-Unis, auteure de « Ghislaine Maxwell, une femme amoureuse »\n- Elisa CHELLE - Professeure de science politique à l\u0027Université Paris-Nanterre\n- Corentin SELLIN - Professeur d\u0027histoire en classe préparatoire, spécialiste des Etats-Unis et chroniqueur pour le média « Les Jours »\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-18T09:01:30Z",
      "duration": "00:09:01",
      "explicit": false,
      "youTubeId": "u3JqHm47L9M",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u3JqHm47L9M"
      }
    },
    {
      "id": "1259e07e-b311-468a-8b4d-2cd849a19372",
      "title": "Affaire Epstein : Trump cherche la parade  -  C dans l’air - 18.12.2025",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\nAffaire Epstein : Trump cherche la parade\n\n« Il y a onze mois j\u0027ai hérité d\u0027un désastre et je le répare ». C’est avec ces mots que Donald Trump a lancé ce mercredi une courte allocution en guise de bilan de fin d’année. Malgré le mécontentement des Américains, le président américain a maintenu son cap économique tout en accablant son prédécesseur démocrate Joe Biden. Il lui a reproché de lui avoir laissé une économie « au bord de la ruine ». \n\nParmi les autres thèmes abordés : la résolution de huit guerres, selon lui-même, « un boom économique » à venir, ou encore un processus de « migration inversée » enclenché, mais un sujet manquait à l’appel : l’affaire Epstein. \n\nPourtant le dossier est brûlant. Les derniers documents liés au délinquant sexuel décédé en 2019 doivent être divulgués d’ici à vendredi par le ministère de la Justice. Après des mois de fausses promesses complotistes puis une volte-face l’amenant à dénoncer un « canular » politique, Donald Trump a été forcé par sa base MAGA à rendre publics les derniers secrets dans cette affaire. \n\nLa semaine dernière, des élus démocrates au Congrès avaient déjà rendu publiques de nouvelles photos émanant des légataires du criminel sexuel Jeffrey Epstein, qui incluent notamment des images de Donald Trump. « Ces images troublantes soulèvent encore plus de questions sur Jeffrey Epstein et ses relations avec certains des hommes les plus puissants du monde », avaient relevé les élus démocrates de la commission de surveillance à la Chambre des représentants. Qu’en sera-t-il ce vendredi 19 décembre ? \n\nMichael Wolff, connu pour ses enquêtes et livres consacrés à Donald Trump, devrait suivre de près la divulgation des derniers dossiers de l\u0027affaire Epstein. Les 23.000 documents publiés, en novembre dernier, révèlent une proximité troublante avec le criminel sexuel, qu’il qualifie pourtant de « monstre ». \n\nL’écrivain s’est également confronté à Melania Trump, dans cette affaire. Michael Wolff a porté plainte contre la femme de Donald Trump, qu’il accuse d’avoir tenté de le faire taire après ses révélations sur ses liens avec Jeffrey Epstein. Selon l’auteur du « Feu et la fureur », la Première dame aurait été présentée à son mari par le criminel sexuel. \n\nDonald Trump augmente la pression sur le Venezuela. Le président américain a annoncé, mardi 16 décembre, un « blocus total » contre les pétroliers sous sanctions se rendant ou partant du Venezuela, renforçant la pression économique sur Caracas en pleine crise entre les deux pays. La chute du président vénézuélien Nicolas Maduro apparaît aujourd\u0027hui comme l’un des principaux objectifs de la Maison Blanche.\n\nLes dernières révélations sur l’affaire Epstein peuvent-elles avoir des conséquences pour Donald Trump ? Qui est Michael Wolff, le journaliste qui défie le président américain ? Que signifie le « blocus total et complet » imposé par Donald Trump dans la crise politique face au Venezuela ? \n\nNos experts :\n- Anthony BELLANGER - Éditorialiste Franceinfo TV, spécialiste des questions internationales\n - Corentin SELLIN - Historien spécialiste des États-Unis, chroniqueur Les Jours\n - Anne DEYSINE - Juriste et politologue, spécialiste des États-Unis, auteure de Les juges contre l’Amérique\n - Anne TOULOUSE - Journaliste franco-américaine, auteure de L’art de trumper\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-17T23:00:57Z",
      "duration": "01:05:11",
      "explicit": false,
      "youTubeId": "mi0mArxe9wE",
      "subjects": [
        "_America",
        "Human Trafficking",
        "Political Cult",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mi0mArxe9wE"
      }
    },
    {
      "id": "e8aeac24-7eb2-4a0a-b99e-aa598732e4de",
      "title": "Affaire Epstein : ces photos qui font trembler Trump...   -  C dans l’air - 17.12.2025",
      "description": "L\u0027affaire Epstein continue de secouer les États-Unis. Dix-neuf photos ont été mises en ligne vendredi dernier par des élus démocrates. On y voit, en compagnie du prédateur sexuel, Donald Trump, Bill Clinton, Ghislaine Maxwell (aujourd’hui incarcérée), Bill Gates, Steve Bannon ou encore Andrew Mountbatten-Windsor. Ces nouvelles images, publiées par les législateurs démocrates de la commission de surveillance de la Chambre des représentants, ne sont qu\u0027une petite partie des plus de 95 000 photos qu\u0027ils ont reçues de la succession d\u0027Epstein, qui s\u0027est suicidé dans une cellule d\u0027une prison new-yorkaise en 2019 alors qu\u0027il attendait d\u0027être jugé pour des accusations de trafic sexuel.\n\n\nElles sont surtout distinctes des dossiers que le ministère de la Justice est désormais contraint de publier. Mais l\u0027impatience grandit alors que l\u0027administration Trump fait face à la date limite du 19 décembre pour produire les dossiers Epstein, mais aussi à de nouvelles révélations explosives.\nMardi 16 décembre, le magazine américain Vanity Fair a publié une enquête basée notamment sur une dizaine d’entretiens avec Susie Wiles, la secrétaire générale de la Maison-Blanche. L’ancienne directrice de campagne du milliardaire républicain estime par exemple que l’ex-magnat de l’immobilier, marqué par la mort de son frère alcoolique, « a une personnalité d’alcoolique » — elle-même est fille d’un homme alcoolique. Il « fonctionne avec la conviction que rien ne lui est impossible. Absolument rien ». « Les alcooliques fonctionnels, ou les alcooliques en général, ont une personnalité exacerbée lorsqu’ils boivent », a-t-elle ajouté. La conseillère âgée de 68 ans égratigne aussi le vice-président, estimant qu’il est « adepte des théories complotistes depuis une décennie », ou encore Elon Musk, un temps à la tête du département de l’Efficacité gouvernementale (Doge), qualifié de destructeur…\n\n\nSous pression, le camp Trump s’exprime et tente de désamorcer. Très discrète habituellement, Susie Wiles a dénoncé un article « malhonnête ». « Elle voulait dire que je… Voyez-vous, je ne bois pas d’alcool. Tout le monde le sait, mais j’ai souvent dit que si je buvais, j’aurais de fortes chances de devenir alcoolique. Je l’ai dit à maintes reprises », a déclaré de son côté Donald Trump. Quelques heures plus tard, le président des États-Unis a annoncé sur son réseau Truth Social que les États-Unis mettaient en place un blocus au Venezuela contre « les pétroliers sous sanctions », une nouvelle escalade dans la crise entre les deux pays. Accusé de faire diversion par ses opposants, le président des États-Unis doit s’exprimer une nouvelle fois ce soir.\n\n\nEn face, ses adversaires surenchérissent. Ils affirment avoir d’autres clichés encore plus troublants alors que l’heure de vérité approche. Les autorités ont désormais moins de deux jours pour publier l’intégralité des documents non classifiés liés aux enquêtes portant sur Jeffrey Epstein, sur sa complice Ghislaine Maxwell et sur toute personne en lien avec les faits qui leur sont reprochés. Une affaire qui obsède depuis des années l’opinion publique américaine et a inspiré de multiples théories du complot.\n\n\nAlors que sait-on des liens entre Donald Trump et Jeffrey Epstein ? Cette affaire peut-elle provoquer la chute du président des États-Unis ? Pourquoi le mouvement MAGA se déchire-t-il ?\n\n\nNos experts :\n- Laurence HAÏM - Journaliste spécialiste des Etats-Unis, autrice de Ghislaine Maxwell, une femme amoureuse, publié chez Robert Laffont\n- Nicole BACHARAN - Historienne et politologue, spécialiste des Etats-Unis, éditorialiste à Ouest-France, autrice du livre Requiem pour le monde libre, publié aux éditions de l’Observatoire\n- Gallagher FENWICK - Grand reporter, spécialiste des questions internationales, ancien correspondant à Washington\n- Vincent JOLLY - Grand reporter pour Le Figaro Magazine\n\n\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions\n\nEncore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI",
      "release": "2026-01-16T23:00:05Z",
      "duration": "01:03:47",
      "explicit": false,
      "youTubeId": "2dEm8Va1qFo",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2dEm8Va1qFo"
      }
    },
    {
      "id": "bb491cd4-b54e-4ba0-9501-e8f58bb19bff",
      "title": "Dossier Epstein : le compte à rebours est lancé pour Trump  -  C dans l’air - 13.12.2025",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\nDossier Epstein : le compte à rebours est lancé pour Trump\n\nDonald Trump ne parvient pas à se sortir de l\u0027affaire Epstein. Suite à une loi signée par le président américain, un juge fédéral a ordonné mercredi, et pour la troisième fois en quelques jours, la levée du secret sur des documents judiciaires relatifs à l\u0027affaire du criminel sexuel Jeffrey Epstein. Les révélations pourraient avoir lieu d’ici au 19 décembre, date butoir fixée par la loi.\nAprès avoir dévoilé il y a peu les photos de la résidence de Jeffrey Epstein à Little Saint James, l’île privée des Caraïbes où il aurait organisé son trafic sexuel, des élus démocrates ont rendu publiques cette nuit de nouvelles photos. Donald Trump apparaît sur plusieurs d’entre-elles. La pression est maximale sur le locataire de la Maison-Blanche. D\u0027autant que son comportement interroge. Alors qu’il avait estimé durant sa campagne qu\u0027il fallait faire toute la lumière sur ce dossier, il a semblé vouloir tout faire pour étouffer l\u0027affaire une fois revenu au pouvoir.\n\nL’affaire Epstein n’est pas la seule à agiter l’actualité américaine. La bataille entre Netflix et la Paramount pour racheter le géant du divertissement Warner Bros Discovery fait elle aussi les gros titres outre-Atlantique.\nEntre Netflix, le champion mondial du streaming, et la Warner, l’affaire semblait entendue. Mais la Paramount a contre-attaqué, avec une offre à 108 milliards de dollars. L\u0027entreprise est dirigée par David Ellison, le fils du milliardaire Larry Ellison, proche de Donald Trump. L\u0027affaire prend donc un tour politique. D\u0027autant que l\u0027offre comprend le rachat de la branche média de la Warner, propriétaire de la chaîne de télévision CNN. Donald Trump accuse depuis longtemps cette chaîne de servir ses opposants démocrates et d’être un « ennemi du peuple ». Un changement de propriétaire et de ligne éditoriale ne serait pas pour lui déplaire. S\u0027il se défend de toute ingérence dans ce dossier, il argue que Netflix, pour des raisons juridiques antitrust, ne pourrait peut-être pas racheter la Warner.\n\nLe président américain n\u0027est pas la seule personnalité au cœur du scandale Epstein. Andrew, le frère de l\u0027actuel roi Charles III, était également très proche du criminel sexuel. Virginia Giuffre, principale plaignante de l’affaire Jeffrey Epstein, avait pris la parole pour expliquer qu\u0027Andrew l\u0027avait violée. Andrew a depuis été déchu de son titre de prince et s\u0027est vu retirer toutes les distinctions honorifiques liées à celui-ci.\n\nQue savait Donald Trump des crimes de Jeffrey Epstein ?\nComment le président américain compte-t-il peser dans le rachat de la Warner ?\nCombien de personnalités ont-elles été impliquées dans les crimes de Jeffrey Epstein ?\n\nNos experts :\n- Laurence HAIM - Journaliste, ancienne correspondante aux États-Unis - Auteure de « Ghislaine Maxwell, une femme amoureuse »\n- Lucas MENGET - Grand reporter\n- Jean-Bernard CADIER - Journaliste, ancien correspondant aux États-Unis - Auteur de « Néron à la Maison Blanche »\n- Anne TOULOUSE - Journaliste franco-américaine - Auteure de « L’art de trumper »\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2026-01-12T23:00:23Z",
      "duration": "01:03:50",
      "explicit": false,
      "youTubeId": "AvSiLElG22A",
      "subjects": [
        "Human Trafficking",
        "_America",
        "Qanon",
        "School of Philosophy and Economic Science",
        "Nine O\u0027Clock Service"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AvSiLElG22A"
      }
    },
    {
      "id": "06807385-132b-469d-872f-355760acd9a9",
      "title": "Affaire Epstein : la sulfureuse Ghislaine Maxwell",
      "description": "Une femme a joué un rôle déterminant dans l\u0027organisation de ces trafics sexuels de mineurs : Ghislaine Maxwell. C\u0027est elle qui jouait les intermédiaires et faisait tout pour le satisfaire. Condamnée à 20 ans de prison, elle est aujourd\u0027hui incarcérée mais a-t-elle encore des secrets à livrer ?\n\n\nUn reportage de Magali Lacroze et Christophe Roqué\n\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-31T15:01:34Z",
      "duration": "00:08:05",
      "explicit": false,
      "youTubeId": "eL6dV6SDgRw",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eL6dV6SDgRw"
      }
    },
    {
      "id": "356cadfa-9107-43ea-99da-2146aa21dabf",
      "title": "Trump et l\u0027affaire Epstein",
      "description": "Le nom de Donald Trump sur les listings de voyage dans l\u0027avion, les photos avec Jeffrey Epstein... L\u0027étau de ce scandale Epstein se resserre autour du président américain. La publication de ces milliers de documents embarrasse Donald Trump au point de le mettre en colère.\n\n\nUn reportage de Mathieu Ligneau et Nicolas Baudry d\u0027Asson\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-31T08:00:04Z",
      "duration": "00:08:49",
      "explicit": false,
      "youTubeId": "29y20aFfqIY",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=29y20aFfqIY"
      }
    },
    {
      "id": "db8d4bbd-1d0e-4df0-97d0-140c470991e1",
      "title": "Que contiennent les fichiers du dossier Epstein ?",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nLes victimes attendaient beaucoup de la publication des document de l\u0027affaire Epstein. Quelles sont les pièces manquantes ? Que risque l\u0027ancien Président des États-Unis Bill Clinton, très visible dans cette première salve de révélations.\n\nUn reportage de Julie Ricco et Michel Bouilly\n\nNos experts :\n- Corentin SELLIN - Historien spécialiste des États-Unis - Chroniqueur - « Les Jours »\n- Lucas MENGET - Grand reporter\n- Nicolas BARRÉ - Directeur de la rédaction - « Politico »\n- Camille GUTTIN - Reporter – Correspondante à Washington de 2022 à 2025\n- Sonia DRIDI - Correspondante aux Etats-Unis – LCI et France 24 (Duplex à Washington)\n- Olivier PITON - Avocat aux barreaux de Paris et de Washington D.C.\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-21T08:00:51Z",
      "duration": "00:10:53",
      "explicit": false,
      "youTubeId": "esV6h0E2wO0",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=esV6h0E2wO0"
      }
    },
    {
      "id": "6edcb31f-1333-4bd0-ac3a-5772eb2fdcb8",
      "title": "Le mystère Melania Trump",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nLe nom de Melania Trump pourrait-il être présent dans les fichiers Epstein ? Est-ce la raison pour laquelle Donald Trump a fait volte-face ? Elle poursuit en justice le journaliste Michael Wolff affirme qu\u0027Epstein a présenté lui-même Melania à Donald Trump. Est-ce crédible ?\n\nUn sujet de Léa Demirdjian et Nicolas Baudry d’Asson.\n\nNos experts :\n- Laurence HAÏM - Journaliste spécialiste des États-Unis et autrice de Ghislaine Maxwell, une femme amoureuse\n- Virginie VILAR - Grand reporter Complément d’enquête et France Télévisions\n- Grégory PHILIPPS - Rédacteur en chef international LCI et ancien correspondant aux États-Unis\n- Alban MIKOCZY - Grand reporter France Télévisions\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-20T16:00:29Z",
      "duration": "00:08:48",
      "explicit": false,
      "youTubeId": "KHN8SVrp4os",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KHN8SVrp4os"
      }
    },
    {
      "id": "f097d1a0-bdcb-4ac0-bf09-ec64713fc1c0",
      "title": "Affaire Epstein : le volet français",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nOn revient sur le volet français de l\u0027affaire Epstein où le principal mis en cause était l\u0027agent de mannequins Jean-Luc Brunel qui, à 75 ans, avait lui aussi été retrouvé pendu dans sa cellule à la prison de la Santé en février 2022.\n\nUn reportage de Mathieu Ligneau, Hoan Nguyen et Christophe Roqué.\n\nNos experts :\n- Laurence HAÏM - Journaliste spécialiste des États-Unis et autrice de Ghislaine Maxwell, une femme amoureuse\n- Virginie VILAR - Grand reporter Complément d’enquête et France Télévisions\n- Grégory PHILIPPS - Rédacteur en chef international LCI et ancien correspondant aux États-Unis\n- Alban MIKOCZY - Grand reporter France Télévisions\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-20T13:00:10Z",
      "duration": "00:10:51",
      "explicit": false,
      "youTubeId": "2PnCjUsXYaQ",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2PnCjUsXYaQ"
      }
    },
    {
      "id": "c3fed744-8a7f-4145-a087-cdad5d290fe5",
      "title": "Epstein/Trump : des nouvelles photos avant le couperet ce soir",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nLe jour J. Ce vendredi, le ministère de la Justice s’apprête à publier l\u0027intégralité des documents non classifiés en sa possession sur Jeffrey Epstein, sa complice Ghislaine Maxwell, qui purge une peine de vingt ans de prison, et toutes les personnes impliquées dans les procédures judiciaires. \n \nLes documents attendus pourraient embarrasser nombre de personnalités, notamment du monde des affaires, de la politique ou du spectacle, qui gravitaient dans l\u0027orbite du financier, y compris Donald Trump. \n \nDe nombreux soupçons sont portés sur le président américain. Les photos et emails déjà publiés ne font plus de doute sur l\u0027amitié entre Donald Trump et Jeffrey Epstein mais interrogent sur la nature de leurs liens. Le président américain était-il au courant du réseau sexuel du financier new-yorkais, mort en prison en 2019 ? \n \nUne nouvelle polémique alimente le scandale. Ghislaine Maxwell, ex-compagne et complice de Jeffrey Epstein, est accusée d’avoir bénéficié d’un traitement de faveur carcéral profitant de conditions moins strictes, après avoir été transférée à la prison fédérale de Bryan, au Texas. Un privilège qui interroge et entretient le doute sur le degré de complicité entre le prédateur sexuel et Donald Trump. \n \nParmi les personnalités impliquées dans le réseau de traite d\u0027êtres humains à des fins sexuelles, mis en place par Jeffrey Epstein, on retrouve Jean-Luc Brunel. L’ancien agent de mannequins français était considéré comme l’un des \u0022principaux pourvoyeurs\u0022 de jeunes filles. Mis en examen pour \u0022viol sur mineur\u0022, il a été retrouvé mort, pendu dans sa cellule en février 2022.\n \nUn autre homme, Daniel S., est soupçonné d’avoir joué le rôle de rabatteur de femmes en France pour Jeffrey Epstein. Il est présenté comme étant un ancien photographe de mode, et manager d’une chaîne de télé sur la mode basée en Russie. Malgré les soupçons sur son implication dans le réseau Epstein, il n’a pourtant jamais été inquiété par la justice. \n \nSon nom a beaucoup fait parler ces dernières semaines. Michael Wolff, auteur du best-seller \u0022Le Feu et la Fureur\u0022, a le président américain dans sa ligne de mire, ainsi que sa femme Melania. Celui qui a recueilli, entre 2014 et 2019, les confidences de Jeffrey Epstein, s’est intéressé à la rencontre du couple présidentiel. Et le journaliste l’assure : la Première dame aurait été présentée à son mari par Jeffrey Epstein. Ce que réfute Melania Trump allant jusqu\u0027à le menacer d\u0027une action en justice.\n \nÀ quel point l’affaire Epstein peut-elle faire tomber Donald Trump ? Qui était Jean-Luc Brunel, l’un des \u0022principaux pourvoyeurs\u0022 de jeunes filles pour Jeffrey Epstein ? Qui est Michael Wolff, ce journaliste voulant faire trembler le couple présidentiel américain ?\n\nNos experts :\n- Laurence HAÏM - Journaliste spécialiste des États-Unis et autrice de Ghislaine Maxwell, une femme amoureuse\n- Virginie VILAR - Grand reporter Complément d’enquête et France Télévisions\n- Grégory PHILIPPS - Rédacteur en chef international LCI et ancien correspondant aux États-Unis\n- Alban MIKOCZY - Grand reporter France Télévisions\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-19T18:31:11Z",
      "duration": "01:05:23",
      "explicit": false,
      "youTubeId": "aJDp4uXO1sM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aJDp4uXO1sM"
      }
    },
    {
      "id": "05345676-09b9-4dc5-b763-31a7c00d6227",
      "title": "Michael Wolff : le journaliste qui fait trembler la Maison-Blanche",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nC\u0027est une figure bien connue des Américains, le journaliste Michael Wolff à qui l\u0027on doit des best-sellers consacrés à Donald Trump, se retrouve en première ligne dans le scandale Epstein. Dans les années 1990, il était très proche de l\u0027homme d\u0027affaires devenu pédocriminel qu\u0027il a longtemps interrogé avec dans la ligne de mire des révélations sur Donald Trump. Aujourd\u0027hui, il s\u0027est lancé dans un autre bras de fer avec, cette fois-ci, Melania Trump.\n\nUn reportage de Constance Meyer et Juliette Perrot.\n\nNos experts :\n- Anthony BELLANGER - Éditorialiste Franceinfo TV, spécialiste des questions internationales\n - Corentin SELLIN - Historien spécialiste des États-Unis, chroniqueur Les Jours\n - Anne DEYSINE - Juriste et politologue, spécialiste des États-Unis, auteure de Les juges contre l’Amérique\n - Anne TOULOUSE - Journaliste franco-américaine, auteure de L’art de trumper\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-19T13:01:19Z",
      "duration": "00:10:02",
      "explicit": false,
      "youTubeId": "fUZgl9kVF-0",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fUZgl9kVF-0"
      }
    },
    {
      "id": "c4e139e3-d2c8-4155-bb0a-1bf52d907a6b",
      "title": "L\u0027affaire Epstein : le dossier brûlant de Trump",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nPour son discours de fin d\u0027année, Donald Trump s\u0027est livré à un exercice d\u0027auto-promotion de sa première année de mandat. Le chef de la Maison-Blanche a vanté son bilan économique, les huit conflits auxquels il affirme avoir mis un terme, sur l\u0027inflation, il enjoint les Américains à la patience, et l\u0027affaire Epstein, il n\u0027en a pas dit un mot.\n\nUn reportage de Léo Seux et Ilana Azencot\n\nNos experts :\n- Anthony BELLANGER - Éditorialiste Franceinfo TV, spécialiste des questions internationales\n - Corentin SELLIN - Historien spécialiste des États-Unis, chroniqueur Les Jours\n - Anne DEYSINE - Juriste et politologue, spécialiste des États-Unis, auteure de Les juges contre l’Amérique\n - Anne TOULOUSE - Journaliste franco-américaine, auteure de L’art de trumper\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-19T08:00:56Z",
      "duration": "00:09:30",
      "explicit": false,
      "youTubeId": "iiGGxL_Gjlg",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iiGGxL_Gjlg"
      }
    },
    {
      "id": "a4f1be06-08ee-42e3-a74a-1810c6471099",
      "title": "L\u0027autre affaire Epstein",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nDans les tous derniers documents qui ont été publiés sur l\u0027affaire Epstein, l\u0027ancien prince Andrew, il a été privé de ses titres en raison du scandale. Virginia Giuffre, qui s\u0027est suicidée cet été, l\u0027accusait d\u0027agression sexuelle.\nLa pression monte aussi pour qu\u0027il témoigne devant le congrès américain.\n\nUn reportage de Magali Lacroze et Christophe Roqué.\n\nNos experts :\n- Laurence HAIM - Journaliste, ancienne correspondante aux États-Unis - Auteure de « Ghislaine Maxwell, une femme amoureuse »\n- Lucas MENGET - Grand reporter\n- Jean-Bernard CADIER - Journaliste, ancien correspondant aux États-Unis - Auteur de « Néron à la Maison Blanche »\n- Anne TOULOUSE - Journaliste franco-américaine - Auteure de « L’art de trumper »\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-14T17:01:02Z",
      "duration": "00:08:14",
      "explicit": false,
      "youTubeId": "c6ZcFCZdeHM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c6ZcFCZdeHM"
      }
    },
    {
      "id": "aef0d8bf-8758-4289-bf36-25d1f7c5809d",
      "title": "Les documents Epstein bientôt révélés",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nDonald Trump réagit à ces nouvelles révélations, il déclare que ces photos ne veulent rien dire. Dans le même temps, plusieurs juges autorisent la publications de nouveaux documents confidentiels concernant la première affaire Epstein qui lui avait valu de faire seulement 13 mois de prison. Avait-il été protégé ? Si oui, par qui ?\n\nUn reportage de Auberie Perreaut et Benoît Thébaud\n\nNos experts :\n- Laurence HAIM - Journaliste, ancienne correspondante aux États-Unis - Auteure de « Ghislaine Maxwell, une femme amoureuse »\n- Lucas MENGET - Grand reporter\n- Jean-Bernard CADIER - Journaliste, ancien correspondant aux États-Unis - Auteur de « Néron à la Maison Blanche »\n- Anne TOULOUSE - Journaliste franco-américaine - Auteure de « L’art de trumper »\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-14T06:00:49Z",
      "duration": "00:09:28",
      "explicit": false,
      "youTubeId": "kVtow3k4V8A",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kVtow3k4V8A"
      }
    },
    {
      "id": "394cf68a-f8d8-4e2f-bf44-0156603ee657",
      "title": "Scandale Epstein : les derniers secrets révélés",
      "description": "Un juge fédéral américain a ordonné vendredi la levée du secret judiciaire sur la procédure contre le criminel sexuel Jeffrey Epstein en Floride, où il avait été condamné en 2008 à une peine de prison. Cette décision inhabituelle de publication des témoignages recueillis par un grand jury, dont la confidentialité est normalement très protégée, est due à l\u0027adoption en novembre d\u0027une loi destinée à assurer la plus grande transparence sur l\u0027affaire Epstein, a expliqué le juge dans sa décision.\nLa loi fait obligation au ministère de la Justice de rendre publics d\u0027ici le 19 décembre l\u0027intégralité des documents non classifiés en sa possession sur Jeffrey Epstein, sa complice Ghislaine Maxwell, qui purge une peine de vingt ans de prison, et toutes les personnes impliquées dans les procédures judiciaires. Donald Trump, qui pendant des mois a promis à sa base des révélations fracassantes sur ce dossier, subit un retour de flamme, y compris dans son propre camp, depuis que son gouvernement a annoncé en juillet n\u0027avoir découvert aucun élément nouveau qui justifierait la publication de documents supplémentaires.\nCes derniers jours, les élus démocrates ont diffusé de nouvelles images de la résidence de Jeffery Epstein sur l\u0027île de Little Saint James. Ces documents offrent un aperçu inédit de l\u0027environnement où le financier aurait perpétré ses crimes. Les photos et les vidéos dévoilées présentent plusieurs pièces de la résidence ainsi que des éléments de décoration, comme des masques d\u0027hommes accrochés au mur, une photo d\u0027Epstein et de Ghislaine Maxwell en compagnie du pape Jean-Paul II, ou encore un tableau dans le bureau avec les mots \u0022tromperie\u0022, \u0022pouvoir\u0022 et \u0022vérité\u0022 inscrits à la craie.\n\n\nVirginie Vilar, grand reporter pour Complément d\u0027Enquête sur France Télévisions, a beaucoup enquêté sur Jeffrey Epstein. Elle reviendra avec nous sur ce que cette levée du secret judiciaire change, concernant cette enquête sur un système d\u0027exploitation sexuelle sur mineures, d\u0027une immense gravité. Un scandale qui chamboule la société américaine, et dont els répercussions sont mondiales.\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-12-08T17:20:56Z",
      "duration": "00:09:49",
      "explicit": false,
      "youTubeId": "WA-lLVYN4RY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WA-lLVYN4RY"
      }
    },
    {
      "id": "7b2e8d96-74d7-47ae-8d31-ad507f72e08c",
      "title": "\u0022Le nom de Mélania Trump pourrait être présent dans le dossier Epstein\u0022",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nAprès avoir été adoptée à la quasi-unanimité des membres du Congrès, la loi permettant de rendre public le dossier Epstein a été promulguée par le président américain Donald Trump. Ce dossier est censé contenir tous les documents relatifs à la \u0022liste de clients\u0022 et aux communications du criminel sexuel mort en prison en 2019. Le Département de la justice dispose de 30 jours pour en divulguer le contenu.\nLe locataire de la Maison-Blanche s\u0027y était jusqu\u0027alors fermement opposé mais il a dû céder sous la très forte pression politique, y compris venue de son propre camp. Cette annonce a été célébrée comme une victoire contre ses tentatives de garder ces documents secrets.\nL’impact de cette décision reste cependant encore à déterminer. Le texte prévoit en effet des exceptions permettant à l’exécutif de retarder, voire d’empêcher la révélation de certains éléments du dossier potentiellement explosifs pour Donald Trump. Ce dernier a promis qu’il ne fera plus rien pour empêcher que les élus aient accès à tout ce à quoi ils ont droit. Mais tiendra-t-il parole ?\n\n\n\n\nNos experts :\n- Philippe CORBÉ - Journaliste – « Zeitgeist » - Spécialiste des États-Unis - Auteur de « Les femmes contre le trumpisme »\n- Corentin SELLIN - Historien spécialiste des États-Unis - Chroniqueur - « Les Jours »\n- Marjorie PAILLON - Journaliste spécialiste de la vie politique américaine\n- Christine OCKRENT - Journaliste, spécialiste des affaires étrangères – France Culture - Auteure de « Trump de A à Z »\n\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-11-24T15:30:04Z",
      "duration": "00:08:56",
      "explicit": false,
      "youTubeId": "59KcumLiX6U",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=59KcumLiX6U"
      }
    },
    {
      "id": "f29634b9-8376-44b7-ae22-1c5e9a2bcc62",
      "title": "Que savait Donald Trump des agissements de Jeffrey Epstein ?",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\n\nTout sera-t-il enfin révélé ? Après avoir été adoptée à la quasi-unanimité des membres du Congrès, la loi permettant de rendre public le dossier Epstein a été promulguée par le président américain Donald Trump. Ce dossier est censé contenir tous les documents relatifs à la \u0022liste de clients\u0022 et aux communications du criminel sexuel mort en prison en 2019. Le Département de la justice dispose de 30 jours pour en divulguer le contenu.\nLe locataire de la Maison-Blanche s\u0027y était jusqu\u0027alors fermement opposé mais il a dû céder sous la très forte pression politique, y compris venue de son propre camp. Cette annonce a été célébrée comme une victoire contre ses tentatives de garder ces documents secrets.\nL’impact de cette décision reste cependant encore à déterminer. Le texte prévoit en effet des exceptions permettant à l’exécutif de retarder, voire d’empêcher la révélation de certains éléments du dossier potentiellement explosifs pour Donald Trump. Ce dernier a promis qu’il ne fera plus rien pour empêcher que les élus aient accès à tout ce à quoi ils ont droit. Mais tiendra-t-il parole ?\nCar le président américain est coutumier des revirements. Sa dernière volte-face a d\u0027ailleurs eu lieu hier, lors de la réception à Washington du nouveau maire de New York Zohran Mamdani. Contre toute attente, Donald Trump a fait l’éloge de ce socialiste démocrate qu’il avait pourtant surnommé \u0022Le communiste\u0022. \u0022Vous allez avoir un grand maire, nous allons l’aider, félicitations !\u0022, a affirmé le locataire de la Maison-Blanche. Tous les démocrates n\u0027ont pas droit à tant d\u0027égard de sa part, lui qui considère souvent ses adversaires politiques comme des ennemis personnels. En guise de contre-attaque dans le dossier Epstein, Donald Trump a d\u0027ailleurs sommé le ministère de la Justice d’enquêter sur les liens entre feu Jeffrey Epstein et plusieurs figures démocrates, dont l’ancien président Bill Clinton. Une diversion visant à détourner l’attention de ses propres liens avec le délinquant sexuel ?\nSi cette affaire fait énormément de bruit aux Etats-Unis, elle n\u0027est pas la seule source de critiques à l\u0027encontre du président américain. Donald Trump est en effet également attaqué sur l\u0027état de l\u0027économie américaine. L\u0027inflation, contre laquelle il a promis de lutter lors de sa campagne, continue de miner le pouvoir d\u0027achat des ménages américains. Une équipe de C dans l\u0027air s\u0027est rendue à leur rencontre à Détroit, dans le Michigan.\nJusqu’où les révélations sur l\u0027affaire Epstein peuvent-elles ébranler Donald Trump ?\nLe président américain peut-il encore empêcher la divulgation d\u0027informations compromettantes pour lui ?\nDonald Trump fait-il fausse route avec sa politique économique ?\nNos experts :\n- Philippe CORBÉ - Journaliste – « Zeitgeist » - Spécialiste des États-Unis - Auteur de « Les femmes contre le trumpisme »\n- Corentin SELLIN - Historien spécialiste des États-Unis - Chroniqueur - « Les Jours »\n- Marjorie PAILLON - Journaliste spécialiste de la vie politique américaine\n- Christine OCKRENT - Journaliste, spécialiste des affaires étrangères – France Culture - Auteure de « Trump de A à Z »\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-11-24T11:48:03Z",
      "duration": "00:08:50",
      "explicit": false,
      "youTubeId": "yrRfpTuRiFA",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yrRfpTuRiFA"
      }
    },
    {
      "id": "9426ce7f-bf71-4bb8-9af2-90cf2ddeb73c",
      "title": "Quelles sont les personnalités empêtrées dans l’affaire Epstein ?",
      "description": "Encore plus de vidéos 👉 https://www.france.tv/france-5/c-dans-l-air/\nAbonnez-vous https://youtube.com/@Cdanslairofficiel?si=7y_r1CEmfzkCR_WI\n\nParmi les 20.000 documents rendus publics, plusieurs personnalités sont mentionnées, dont le prince Andrew, déchu de ses titres royaux en octobre dernier. Un certain nombre de mails accablants impliquerait le frère du roi Charles III dans cette affaire retentissante. \n\nNos experts : \nLaurence HAÏM - Journaliste spécialiste des États-Unis\nNicole BACHARAN - Historienne et politologue, spécialiste des Etats-Unis, éditorialiste à Ouest-France\nVirginie VILAR - Grand Reporter pour Complément d’Enquête sur France Télévisions\nAnthony BELLANGER - Éditorialiste à France Info TV, spécialiste des questions internationales\n\nRetrouvez-nous sur :\n| Notre site : https://www.france.tv/france-5/c-dans-l-air/\n| Facebook : https://www.facebook.com/Cdanslairf5/\n| Twitter : https://twitter.com/Cdanslair\n| Instagram : https://www.instagram.com/cdanslair/ \n\nDiffusion : tous les jours de la semaine à 17.40\nFormat : 65 minutes\nPrésentation : Caroline Roux et Aurélie Casse\nProduction : France Télévisions/Maximal Productions",
      "release": "2025-11-19T15:00:59Z",
      "duration": "00:10:04",
      "explicit": false,
      "youTubeId": "TQE_NegPlOg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TQE_NegPlOg"
      }
    }
  ]
}