{
  "_ts": 0,
  "id": "a467b661-2eb4-462e-a7c6-50145da83caa",
  "name": "CANADALAND",
  "spotifyId": "0v4rPjCZUOUCgHgQhrcCs5",
  "appleId": 721048994,
  "episodes": [
    {
      "id": "c8a7a096-fdda-4174-b728-27a550e391d5",
      "title": "(Short Cuts) MKUltra",
      "description": "In the 1960s and 70s, there was a fear that cult leaders were brainwashing young people into joining their new, strange movements. But is it even possible to “brainwash” anyone?At a psychiatric hospital in Montreal, one mad scientist, with the help of the CIA, tried to find out. Featured in this episode: Alison Steel, Lisa EllenwoodTo learn more:Brainwashed by Michelle Shephard, Lisa Ellenwood \u0026 Chris Oke on CBC PodcastsThe Search for the Manchurian Candidate: The CIA and Mind Control by John MarksFather, Son and CIA by Harvey WeinsteinMK Ultra: CIA mind control program in Canada by CBC’s The Fifth Estate“Federal government quietly compensates daughter of brainwashing experiments victim” by Elizabeth Thompson in CBC NewsCredits: Arshy Mann (Host \u0026 Producer), Jordan Cornish (Producer), Noor Azrieh (Producer), Annette Ejiofor (Managing Editor), Karyn Pugliese (Editor-in-Chief)Listen to the rest of the season here.  Sponsors: Squarespace, oxio, Athletic Greens,  If you value this podcast, Support us! You’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on merch at our store, tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis, you’ll be keeping our work free and accessible to everybody.   You can listen ad-free on Amazon Music—included with Prime. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-12-28T05:00:40Z",
      "duration": "00:44:59.9900000",
      "explicit": false,
      "spotifyId": "3jNMEhU6ZHtU5boemukTd5",
      "appleId": 1000639460712,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3jNMEhU6ZHtU5boemukTd5",
        "apple": "https://podcasts.apple.com/podcast/short-cuts-mkultra/id721048994?i=1000639460712"
      }
    }
  ]
}