{
  "_ts": 0,
  "id": "3d35ffae-d624-4e4a-9b91-a93ef207cd1d",
  "name": "Capers and Cocktails",
  "spotifyId": "2Zs7vwcEByhbqWg4Y2TLVY",
  "appleId": 1547771238,
  "youTubeChannelId": "UCWCAe0EJLJOkwhW0iTMnreA",
  "episodes": [
    {
      "id": "37b177b3-41e4-41e8-a290-9097361bcec8",
      "title": "Universal Medicine Cult",
      "description": "Universal Medicine is a controversial healing “movement” led by Serge Benhayon that\u0027s raised eyebrows worldwide. What started in Australia has spiraled into a global network, blending unproven practices with questionable beliefs. But behind the spiritual talk, some say there\u0027s a darker side. With claims of energy healing, past-life karma, and even bizarre, and I DO mean bizarre, treatments, the group has been accused of being a cult. Spoiler alert: it’s a cult. Stick around as we dig into Universal Medicine—its rise, its followers, and the scandal that just won\u0027t go away. Buttery Nipple Shot (Cocktail) 1 part butterscotch schnapps ½ part irish cream Add butterscotch schnapps to a chilled shot glass. Pour Irish cream over the back of a bar spoon to float it on top of the schnapps. Buttery Nipple Shot (Mocktail) 1 part butterscotch soda ½ part heavy cream Add butterscotch soda to a chilled shot glass. Pour heavy cream over the back of a bar spoon to float it on top of the soda. ----- LIVE show request! https://forms.gle/r7cdtZhfgqLSEbkF6 Podcast, and all social media links: www.capersandcocktails.com ----- Ingredients for next episode (cocktail): pineapple juice, cream of coconut, rum Ingredients for next episode (mocktail): pineapple juice, cream of coconut, rum syrup ----- Under Section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship and research. My videos are always made by researching a large variety of sources, and any appearance of similarities is purely coincidental. For any potential issues, or to reach out to me for any reason, please email margsandmayhem@gmail.com. ----- Sources: “Universal Medicine” - https://en.wikipedia.org/wiki/Universal_Medicine “Mother \u0027lost\u0027 to Serge Benhayon\u0027s Universal Medicine cult” - https://www.bbc.com/news/uk-england-somerset-47485167 “Buttery Nipple Shot” - https://theliveinkitchen.com/buttery-nipple/ “About Serge Benhayon” - https://www.unimedliving.com/serge-benhayon/who-is-serge/about-serge-benhayon.html “Universal Medicine\u0027s Serge Benhayon to inherit bulk of devotee\u0027s million-dollar estate” - https://www.smh.com.au/national/nsw/universal-medicines-serge-benhayon-to-inherit-bulk-of-devotees-milliondollar-estate-20151228-glvl7u.html “Chris James - Silk in the Clouds” - https://soundcloud.com/unimedliving/silk-in-the-clouds ----- Music Credit: \u0022The Cool Side\u0022 Artist: Jonathan Boyle Composer: Jonathan Boyle Audio Source: PremiumBeat.com License: #4490172",
      "release": "2025-04-01T11:28:00Z",
      "duration": "00:29:16.0940000",
      "explicit": false,
      "spotifyId": "30pZ2C4Xiwj5nDW9yDRdkV",
      "appleId": 1000701721718,
      "youTubeId": "kA5g0feKLa0",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/30pZ2C4Xiwj5nDW9yDRdkV",
        "apple": "https://podcasts.apple.com/podcast/universal-medicine-cult/id1547771238?i=1000701721718",
        "youtube": "https://www.youtube.com/watch?v=kA5g0feKLa0"
      }
    }
  ]
}