{
  "id": "e6419082-7b89-4d46-b6ac-437864e374d3",
  "name": "Cara Cordoni",
  "youTubeChannelId": "UCD1NXf-w1uruXKsY8rZsZZA",
  "episodes": [
    {
      "id": "feed066a-678d-4522-afb1-4916b58f960e",
      "title": "My ISTA Story Pt 2 with guest interviewer Jack Rikess",
      "description": "CONTENT NOTE\nContains discussion of coercion, manipulation, organizational abuse, and victim-blaming. Jack\u0027s direct, confrontational interviewing style may be activating for survivors.\n\nIn Part 2 (of 2), Cara and Jack explore what comes after you recognize harm in a community you loved. Cara shares her two-year journey attempting accountability through mediation—believing transformation was possible, documenting patterns of harm, and slowly realizing the organization wasn\u0027t interested in genuine change. The conversation moves through the stages of disillusionment: from hopeful participant to concerned insider to reluctant whistleblower. Cara reflects on why she stayed in dialogue so long and what it took to finally walk away from the dream of accountability.\n\nJack and Cara discuss the mechanics of institutional betrayal—how organizations respond to harm reports, the ways victims get blamed for their own trauma, and what happens when mediation becomes performance. Cara describes her current work supporting survivors and building alternative models for community and leadership. \n\nPart 2 of 2. For Cara\u0027s full ISTA origin story, start with Part 1.\n\nDISCLAIMER\nViews expressed represent individual opinions and experiences, not official positions of the podcast or producers. Content is not intended to malign any religion, group, organization, business, individual, or entity.\n\nABOUT JACK RIKESS\nJack Rikess was a stand-up comic for twenty-five years performing across the USA. Along the way he became a producer of comedy shows and other productions, including two years as an Operational Manager for The Emerald Cup. In the early 2000s, he wrote about the Northern California Cannabis scene. That led to a column with Village Voice Media, \u0022Toke of the Town\u0022 which was distributed in twenty American cities including LA Weekly, SF Weekly, and City Pages in his hometown of Minneapolis.\n\nHis work is featured in Stephen Sparks and Tom Allman\u0027s book, \u0022Out There In The Woods\u0022—an account of being embedded with law enforcement in the 36-day manhunt for a double-murderer hiding in the hills of Mendocino County. His first novel, \u0022Just For A Couple Of Weeks\u0022 will be published in spring of 2026.\n\nConnect with Jack: \n\nRESOURCES\nSafer Sex-Positive and Spiritual Communities: 3SC.Community\nICSA (International Cultic Studies Association): ICSA.org\nNew York Magazine Article: http://3sc.community/wp-content/uploads/2025/04/The-Neo-Tantric-Sex-Group-That-Promised-to-Change.pdf\n\nCONNECT\nConversations like these helped me get through the darkest times, and I hope they help us get through dark times together.\n\nIf this episode resonates with you, I\u0027d love to hear from you.\n\nQuestions or feedback: foolsgoldpodcast@proton.me\nSchedule a 30 min curiosity call with Cara: calendly.com/caracordonicoaching\nSubstack: https://caracordoni.substack.com/\nInstagram: @caracordoni\n\nLike what you\u0027re hearing? Please consider subscribing, sharing with someone who might benefit, and leaving a review. Your engagement helps others find these conversations, especially because this is a new show.\n\nCREDITS\nOpening Graphics: Paxton Scarberry\nTheme Music: \u0022Midnight Rendezvous\u0022 by Sasha Ende (ende.app)\nLicensed under Creative Commons BY-NC 4.0",
      "release": "2026-02-17T16:00:12Z",
      "duration": "00:51:24",
      "explicit": true,
      "youTubeId": "9CUgKHwWdzY",
      "subjects": [
        "International School of Temple Arts"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9CUgKHwWdzY"
      }
    },
    {
      "id": "c84f69f8-a956-4a2e-bc22-1f9f17ee2484",
      "title": "Reading The News: \u0022ISTA in Cyprus: Sacred Sexuality or a Pattern of Harm?\u0022",
      "description": "Fool\u0027s Gold \u0027Reading The News\u0027 Bonus episodes launch with the Politis article, \u0022ISTA in Cyprus: Sacred Sexuality or a Pattern of Harm?\u0022 by Katerina Nicolaou, Nov 23, 2025. https://en.politis.com.cy/culture/culture-soul-scene/970088/ista-in-cyprus-sacred-sexuality-or-a-pattern-of-harm\n\nNo commentary, just the article as written, read aloud to you by Cara Cordoni.",
      "release": "2026-02-11T21:06:40Z",
      "duration": "00:21:35",
      "explicit": false,
      "youTubeId": "_xhoVnVz02w",
      "subjects": [
        "International School of Temple Arts"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_xhoVnVz02w"
      }
    },
    {
      "id": "d5a0884f-40f7-4159-ad1e-973ab6540177",
      "title": "Commercial Cults with anti-MLM guest Julie Anderson",
      "description": "What happens when your friend\u0027s shampoo post on Facebook leads to five years in a commercial cult? Anti-MLM activist Julie Anderson joins Cara to trace her journey from desperately seeking work to becoming one of the most recognizable voices exposing multi-level marketing fraud. Julie explains how Monat recruited her through product testimonials, bonuses, and \u0022ignorance on fire\u0022—the MLM term for recruits who don\u0027t understand what they\u0027re actually doing but do it with enthusiasm.\n\nJulie and Cara explore the mechanics of commercial cults: the VIP customer pipeline, and the three-month bonus trap. They discuss how MLMs normalize financial abuse through language control (\u0022it\u0027s your business!\u0022), prosperity gospel, and laws literally written by Amway lobbyists. Julie describes her breaking point—a product that caused suicidal ideation, combined with her father\u0027s sudden death, and realizing she\u0027d hurt people. \n\nContent Note: Contains discussion of suicidal ideation, financial exploitation, and manipulation. Brief mention of grief and family loss.\n\nDISCLAIMER:\nViews expressed represent individual opinions and experiences, not official positions of the podcast or producers. Content is not intended to malign any religion, group, organization, business, individual, or entity.\n\nABOUT GUEST\nJulie Anderson spent five years in two commercial cults simultaneously—the multi-level marketing company Monat and the MLM coaching group Rank Makers. After realizing the full scope of what she\u0027d been part of, she turned everything she\u0027d learned about content creation and recruitment into a weapon against the industry itself. For four years, Julie became one of the most recognizable anti-MLM voices online, exposing the mechanics of commercial fraud and helping countless people recognize and exit exploitative schemes.\n\nThis is Julie\u0027s final interview. After nine years of creating content maniacally—five years in, four years speaking out—she has stepped away from social media to rest and heal. Her extensive body of work remains available to help others in the years to come.\nYouTube: https://youtube.com/@JulieAndersonvideos\n\nRESOURCES:\nSafer Sex-Positive and Spiritual Communities: 3SC.Community\nICSA (International Cultic Studies Association): ICSA.org\n\nCONNECT:\nConversations like these helped me get through the darkest times, and I hope they help us get through dark times together. \nIf this episode resonates with you, I\u0027d love to hear from you.\nQuestions or feedback: foolsgoldpodcast@proton.me\nSchedule a 30 min curiosity call with Cara: calendly.com/caracordonicoaching \nSubstack: https://caracordoni.substack.com/\nInstagram: @caracordoni\n\nLike what you\u0027re hearing? Subscribe, share with someone who might benefit, and leave a review. Your engagement helps others find these conversations.\n\nABOUT\nFool\u0027s Gold: Discernment in the Age of Grift explores spiritual seeking, coercive control, and how we develop discernment. Hosted by Cara Cordoni—leadership coach, cooperative developer, and cultic harm survivor—the podcast examines what happens when the search for meaning collides with manipulation.\n\n\u0022I started Fool\u0027s Gold as a shared inquiry space—a place to wrestle with hard questions about spiritual seeking, consent, and how people end up in harmful groups. I\u0027m working through my own experiences with the International School of Temple Arts (ISTA), a neo-tantra organization that turned out to be a cult. Not my first cult, either.\n\nWhy Fool\u0027s Gold? I am the fool. We are all fools. Most of us have been fooled. How do we learn to sort the gold from the glitter?\n\nSome questions we explore: What is consent? What is coercion? What makes us vulnerable to undue influence? How do we maintain the balance between bringing our full selves to our endeavors and disappearing into them?\n\nThese questions matter beyond cults. People don\u0027t join cults—they join communities, trainings, movements that promise transformation or belonging or purpose. Losing ourselves can happen anywhere: relationships, workplaces, spiritual communities, political movements.\n\nI don\u0027t have all the answers. I\u0027m still figuring out what happened to me. But I have questions, and I\u0027ve invited thoughtful people—survivors, journalists, researchers, activists, legal experts—to explore them with us.\n\nDrawing on my experience attempting to hold ISTA accountable through the activist group 3SC (Safer Sex-Positive and Spiritual Communities), I bring both lived experience and endless questions about power, accountability, and repair.\n\nThis is a space for thinking through what we couldn\u0027t see at the time and building the discernment we wish we\u0027d had.\u0022\n\nCREDITS:\nProduction Team: Paxton Scarberry, Shanti Shakavarti, Jon Friedman\nOpening Graphics: Paxton Scarberry\nTheme Music: \u0022Midnight Rendezvous\u0022 by Sasha Ende (ende.app)\nFilmed at: Access Humboldt\nLicensed under Creative Commons BY-NC 4.0",
      "release": "2026-02-10T17:01:18Z",
      "duration": "01:12:18",
      "explicit": true,
      "youTubeId": "oABwsLSv0qw",
      "subjects": [
        "Corporate Cult",
        "Multi-Level Marketing",
        "Monat"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oABwsLSv0qw"
      }
    },
    {
      "id": "853627ce-fbb6-491f-ad74-eb1138dea6e2",
      "title": "My ISTA Story, Part 1 - with interviewer Jack Rikess",
      "description": "What happens when a journalist flips the script? In this episode, writer and comedian Jack Rikess interviews host Cara Cordoni about her journey into and out of The International School of Temple Arts (ISTA). Cara walks Jack through her three ISTA retreats, from the $2,500 promise of transformation to the reality of large group awareness training (LGAT) manipulation—including sleep disruption, psychological pressure, and the dopaminergic highs that feel like enlightenment but can also be induced mania.\n\nJack brings his journalist\u0027s instinct for direct, no-holds-barred questioning (\u0022And what exactly happens with that carrot ritual? \u0022). His style is confrontational but not hostile—he challenges, asks uncomfortable questions about sexuality and polyamory, and isn\u0027t afraid to express his opinion. Together, they find both absurdity and darkness in Cara\u0027s story, exploring how bright people miss obvious red flags and why she initially believed ISTA could be reformed.\n\nTRIGGER WARNING: Contains explicit discussion of sexual practices, manipulation, and coercive group dynamics. Jack\u0027s direct, challenging interviewing style may be activating for some survivors.\n\nDISCLAIMER:\nViews expressed represent individual opinions and experiences, not official positions of the podcast or producers. Content is not intended to malign any religion, group, organization, business, individual, or entity.\n\nABOUT GUEST\nJack Rikess was a stand-up comic for twenty-five years performing across the USA. Along the way he became a producer of comedy shows and other productions, including two years as an Operational Manager for The Emerald Cup. In the early 2000s, he wrote about the Northern California Cannabis scene. That led to a column with Village Voice Media, \u0022Toke of the Town\u0022 which was distributed in twenty American cities including LA Weekly, SF Weekly, and City Pages in his hometown of Minneapolis.\n\nHis work is featured in Stephen Sparks and Tom Allman\u0027s book, \u0022Out There In The Woods\u0022—an account of being embedded with law enforcement in the 36-day manhunt for a double-murderer hiding in the hills of Mendocino County.\nHis first novel, \u0022Just For A Couple Of Weeks\u0022 will be published in spring of 2026.\n\nConnect with Jack\n\nRESOURCES:\nSafer Sex-Positive and Spiritual Communities: 3SC.Community\nICSA (International Cultic Studies Association): ICSA.org\n\nCONNECT:\nConversations like these helped me get through the darkest times, and I hope they help us get through dark times together. \nIf this episode resonates with you, I\u0027d love to hear from you.\nQuestions or feedback: foolsgoldpodcast@proton.me\nSchedule a 30 min curiosity call with Cara: calendly.com/caracordonicoaching \nSubstack: https://caracordoni.substack.com/\nInstagram: @caracordoni\n\nLike what you\u0027re hearing? Subscribe, share with someone who might benefit, and leave a review. Your engagement helps others find these conversations.\n\nABOUT\nFool\u0027s Gold: Discernment in the Age of Grift explores spiritual seeking, coercive control, and how we develop discernment. Hosted by Cara Cordoni—leadership coach, cooperative developer, and cultic harm survivor—the podcast examines what happens when the search for meaning collides with manipulation.\n\n\u0022I started Fool\u0027s Gold as a shared inquiry space—a place to wrestle with hard questions about spiritual seeking, consent, and how people end up in harmful groups. I\u0027m working through my own experiences with the International School of Temple Arts (ISTA), a neo-tantra organization that turned out to be a cult. Not my first cult, either.\n\nWhy Fool\u0027s Gold? I am the fool. We are all fools. Most of us have been fooled. How do we learn to sort the gold from the glitter?\n\nSome questions we explore: What is consent? What is coercion? What makes us vulnerable to undue influence? How do we maintain the balance between bringing our full selves to our endeavors and disappearing into them?\n\nThese questions matter beyond cults. People don\u0027t join cults—they join communities, trainings, movements that promise transformation or belonging or purpose. Losing ourselves can happen anywhere: relationships, workplaces, spiritual communities, political movements.\n\nI don\u0027t have all the answers. I\u0027m still figuring out what happened to me. But I have questions, and I\u0027ve invited thoughtful people—survivors, journalists, researchers, activists, legal experts—to explore them with us.\n\nDrawing on my experience attempting to hold ISTA accountable through the activist group 3SC (Safer Sex-Positive and Spiritual Communities), I bring both lived experience and endless questions about power, accountability, and repair.\n\nThis is a space for thinking through what we couldn\u0027t see at the time and building the discernment we wish we\u0027d had.\u0022\n\nCREDITS:\nProduction Team: Paxton Scarberry, Shanti Shakavarti, Jon Friedman\nOpening Graphics: Paxton Scarberry\nTheme Music: \u0022Midnight Rendezvous\u0022 by Sasha Ende (ende.app)\nFilmed at: Access Humboldt\nLicensed under Creative Commons BY-NC 4.0",
      "release": "2026-02-02T20:20:55Z",
      "duration": "00:54:52",
      "explicit": true,
      "youTubeId": "VibzzpHsBk4",
      "subjects": [
        "International School of Temple Arts"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VibzzpHsBk4"
      }
    }
  ]
}