{
  "id": "8016c260-04a1-439d-9e33-6cde473792c7",
  "name": "Care Beyond Profits",
  "spotifyId": "53LKFfDC5hvyxKWBxpTsGg",
  "youTubeChannelId": "UCFZUB6pjAAoXqkxrlSwaIww",
  "episodes": [
    {
      "id": "9455a64e-05f7-4368-9897-f160ce1c5eb3",
      "title": "From Cult Escape to Building Healthy Communities | Israel Cooper",
      "description": "“A house becomes a home when it is in relationship to other homes” From escaping a closed religious community as a child to co-founding a nationally recognised housing group, Israel\u0027s story is one of resilience, purpose, and deep care for human flourishing. As Co-Founder of the Home Group, Israel has spent over 15 years building housing ecosystems that prioritise dignity, community, and long-term wellbeing.In this conversation, Israel shares how his lived experience shaped his commitment to stable housing, why mixed-tenure communities matter, and what it takes to lead purpose-driven organisations without burning out. He reflects on transitioning from founder CEO to governance, measuring impact beyond numbers, and why generosity and integrity are non-negotiable values. About Israel Cooper Israel Cooper is the Co-Founder of the Home Group, a conglomerate of vertically integrated commercial organisations working across the housing value chain, including capital, land development, construction, tenancy, and property management. The Home Group entities are owned by a charitable trust, the Home Foundation, which stewards the mission and reinvests returns to build healthy, resilient, and inclusive communities in New Zealand and overseas.Israel has over 20 years of governance experience and serves on multiple mission- and housing-focused charitable trust boards. He has previously held senior leadership roles in financial advisory, management consulting, and the tech sector. Israel holds a Bachelor of Business Management, a Bachelor of Commerce with Honours, and a Graduate Diploma in Theology. He is a member of the Institute of Directors in New Zealand and a full member of CPA Australia. Israel shares insights on: • Escaping Gloriavale and rebuilding life from scratch • Why stable, secure housing changes everything • Building mixed-tenure, inclusive communities • Designing housing for dignity, health, and belonging • Measuring impact through systems and human outcomes • Leading for purpose without burnout • Transitioning from founder CEO to trustee and governance • The role of generosity and integrity in leadership • Why how we do things matters as much as what we do Timestamps (0:00) Introduction and Israel’s story (1:15) Growing up in a closed community (4:20) Freedom, agency, and dignity (7:30) Running away in the middle of the night (10:50) Starting again with nothing (14:30) Why stable housing changes everything (18:10) Christchurch earthquakes and starting a construction business (22:40) From builder to developer to housing ecosystem (27:30) “A house becomes a home in relationship to other homes” (31:40) Why mixed-tenure communities matter (36:20) Measuring impact beyond houses and numbers (40:30) Leadership lessons and letting go as a founder (44:10) Burnout, rhythms, and sustainability (47:20) The two values: generosity and integrity (49:20) Final reflections Learn more about Israel and his work • Home Capital Partners: https://www.homecapital.co.nz/ • Home Foundation: https://homefoundation.org.nz/ • LinkedIn: / israelcooper Learn more about Azoora and her work • LinkedIn: / azooraali • Website: https://www.accountingandtax.co.nz/ Listen to Care Beyond Profits on Spotify and YouTube. ❤️ If Israel’s story resonated with you… Please like, share, and subscribe for more conversations with leaders who prove that care and profits can grow together. #Leadership, #Housing, #SocialImpact, #PurposeDriven, #CommuityHousing",
      "release": "2025-12-16T17:30:14Z",
      "duration": "00:50:08.2980000",
      "explicit": false,
      "spotifyId": "0AP2Fs5WJC67RoFBZbiL1S",
      "youTubeId": "PQv3jmN9L8w",
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0AP2Fs5WJC67RoFBZbiL1S",
        "youtube": "https://www.youtube.com/watch?v=PQv3jmN9L8w"
      }
    }
  ]
}