{
  "id": "b71aeabd-141e-44b5-91af-8d8d12555d11",
  "name": "Caribbean Files",
  "youTubeChannelId": "UCUY1sYCSB_kjmBI5QbBR3kQ",
  "episodes": [
    {
      "id": "a09fe10c-df94-4dab-b904-5e53ec206414",
      "title": "Kevin Smith: The Cult Leader who Sacrificed Members on the Church Altar | Jamaica",
      "description": "The chilling true crime story of Kevin Smith, a charismatic pastor whose church in Montego Bay, Jamaica spiraled into a deadly cult. From his rise as a world-renowned preacher to his descent into paranoia fueled by COVID-19 conspiracy theories, discover how faith, manipulation, and fear led to a shocking murder.\n\nOn October 17, 2021, Smith orchestrated a horrific scene inside his church that left three people dead, including one alleged human sacrifice. Explore his complex past, the controversial role of Andre Ruddock, and the lasting impact of misinformation and conspiracy theories during the pandemic.\n\nThis episode examines:\n\nKevin Smith’s rise from Jamaican immigrant to influential pastor\n\nThe blend of charisma, prophecy, and control that turned his church into a cult\n\nHow the pandemic and vaccine conspiracies escalated his paranoia\n\nThe shocking events inside the church and the police intervention\n\nThe aftermath, including Smith’s death and ongoing trials\n\nIf you are fascinated by true crime, cult stories, and Caribbean crime cases, this episode is a must-watch.\n\nWatch until the end for full details and the latest updates on the trial of Andre Ruddock.\n\n#TrueCrime #CaribbeanCrime #KevinSmith #JamaicaCrime #CultStories #TrueCrimeDocumentary #CrimeStory #conspiracythriller  #cultleader #cultinvestigation  #MontegoBay #CrimeInvestigation",
      "release": "2025-11-18T23:11:12Z",
      "duration": "00:12:41",
      "explicit": false,
      "youTubeId": "ReMNZu17kKE",
      "subjects": [
        "Pathways International Kingdom Restoration Ministries, Jamaica"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ReMNZu17kKE"
      }
    },
    {
      "id": "81619346-b594-4a02-88bd-60ef0d627c5e",
      "title": "House of Israel: The Cult Behind Walter Rodney’s Death in Guyana",
      "description": "Dive into the shocking story of the House of Israel, a religious movement that became a powerful political force in 1970s and 1980s Guyana. Led by Rabbi Edward Emmanuel Washington, this organization blurred the lines between faith, politics, and power — culminating in violence, intimidation, and the tragic death of historian Walter Rodney.\n\nIn this investigative documentary by we explore the rise, influence, and ultimate decline of the House of Israel, uncovering how religion and politics intertwined in one of the Caribbean’s most controversial chapters.\n\nSubscribe for more true crime and historical investigations.\nLike and share to help others discover this story\nComment below with your thoughts, questions, or insights\n\n#CaribbeanTrueCrime #HouseOfIsrael #WalterRodney #GuyanaHistory #PoliticalCrime #ReligiousCult #TrueCrimeDocumentary ##Trinidad #CaribbeanHistory #CultInvestigation #jamaica #GuyanaPolitics #TrueCrime \n\nHouse of Israel, Walter Rodney, Caribbean true crime, Guyana history, religious cult, political violence, Caribbean politics, investigative documentary, Caribbean Files, cults in history, Caribbean documentaries",
      "release": "2025-10-16T22:23:39Z",
      "duration": "00:14:24",
      "explicit": false,
      "youTubeId": "3McuQxRMD1E",
      "subjects": [
        "House of Israel",
        "Black Hebrew Israelites"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3McuQxRMD1E"
      }
    }
  ]
}