{
  "_ts": 0,
  "id": "31cc538d-fbd4-424b-8f0e-0f7d751d141b",
  "name": "Carl Wong",
  "youTubeChannelId": "UCmcxMTAwTlJfRN-5U0zxvyw",
  "episodes": [
    {
      "id": "3b0e61d4-0ee1-4550-a334-4944e73cf3c5",
      "title": "The Unbreakable Miss Lovely: How the Church of Scientology tried to destroy Paulette Cooper (w/ Q\u0026A)",
      "description": "Introduction by Jim Underdown: 0:00\nTony Ortega and Paulette Cooper: 5:43\nQ\u0026A from audience: 40:04\n\nIn 1971, a magazine freelancer in New York named Paulette Cooper came out with her first book, “The Scandal of Scientology”, and it was the first popular book that gave the public a view into this secretive organization. She nearly paid for it with her life. What even Paulette didn\u0027t know at the time was the extent that Scientology and its founder, L. Ron Hubbard, would go to destroy someone it perceived as an enemy. By 1973, Paulette had been framed in an elaborate plot involving fake bomb-threat letters, and she faced 15 years in federal prison if convicted. Newly unearthed documents show that by that time, Scientology had kept her under tight surveillance for several years and proposed many ways to destroy her reputation and life. She was finally exonerated after the FBI raided Scientology in 1977 and found those documents, which referred to her by the code name \u0022Miss Lovely.\u0022 Eleven top Scientology officials went to prison after that raid, but more than 30 years later, Scientology is still around -- and so is Paulette.\n\nIn his new, and first, book, “The Unbreakable Miss Lovely”, journalist Tony Ortega tells Paulette\u0027s story in full for the first time, with eyewitness accounts and new documents which describe the full extent of her ordeal -- and her continued fight against a group now seriously in decline. For the launch of the book, Paulette will be appearing with the author at a limited number of events as they talk about various parts of her life depicted in the book, from her childhood survival of the Holocaust to her much calmer life in Florida with her husband Paul, as well as the latest developments in the controversies facing Scientology today.\n\nOrtega is the executive editor of The Raw Story, a progressive political news site. From 2007 to 2012, he was editor in chief of The Village Voice, and he\u0027s been investigating and writing about Scientology since 1995, when he was a reporter for the Phoenix New Times. He also wrote for or edited weekly newspapers in Los Angeles, Kansas City, and Fort Lauderdale. Originally from Los Angeles, he lives in New York and maintains a breaking news website about Scientology news, \u0022The Underground Bunker.\u0022 He is also featured in “Going Clear”, Alex Gibney\u0027s documentary about Scientology, which first aired on HBO in March.\n\nRecorded on May 17, 2015 at the Center for Inquiry in Los Angeles, California.\n\nFind out how to become a Contributing Member of CFI here: http://www.centerforinquiry.net/la/get_involved\n\nCameras, sound and editing by Carl Wong. https://www.youtube.com/c/carlwong5\n\nBuy me a cup of coffee for $1 at http://bit.ly/1Htl0BS",
      "release": "2015-05-21T02:41:55Z",
      "duration": "01:26:13",
      "explicit": false,
      "youTubeId": "V7KadY1UKsE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V7KadY1UKsE"
      }
    }
  ]
}