{
  "_ts": 0,
  "id": "eb6d810d-1481-49b9-b286-bf76b2cb648f",
  "name": "The Numinous Podcast",
  "spotifyId": "3UGtfuf2DPlq9iDDP0rlPc",
  "appleId": 852171726,
  "youTubeChannelId": "UCx3rep7v3y3Pt5JDir2TkvQ",
  "episodes": [
    {
      "id": "d6083c70-a60a-4567-aa36-3b7eacb25567",
      "title": "TNP270 Art, Pleasure and Consent with Marisa Sullivan",
      "description": "{Content Warning} Discussion of sexual abuse, assault and yoga cults. Please take good care of yourself if you feel vulnerable or distressed with these topics. Press pause, stand up and walk around, bring on your arms and legs. Walk forward while looking forward. Say to yourself, I am not prey. \n\n\n\nIn this episode, we refer to Matthew Remski\u0027s exposé: Practice And All Is Coming: Abuse, Cult Dynamics, And Healing In Yoga And Beyond (https://www.goodreads.com/book/show/44139117-practice-and-all-is-coming) \n\n\n\nYou may also wish to listen to my conversation with him about this topic, ep. TNP116 Matthew Remski on Attachment High Demand Communities and Yogas Culture Of Abuse (https://crspagnola.podbean.com/e/tnp116-matthew-remski-on-attachment-high-demand-communities-and-yogas-culture-of-abuse-1/) \n\n\n\n \n\n\n\nLet\u0027s take a cinematic journey in time from childhood as the daughter of artists in small town Massachusetts in the 70s, to the 1980s Tribeca loft art scene, to the East Village of the 1990s as a provocative film and movement artist becoming involved in yoga, butoh, and sexual liberation. Our protagonist is Marisa Sullivan, a somatic and sexual health practitioner and one of our Guides in The Numinous Network.\n\n\n\nMarisa is a Sexual Empowerment and Intimacy Educator and an Embodiment and Movement Facilitator.  She counsels how to maximize the magic and medicine of sexual juiciness, how to be authentic in our sexual expression, inhabiting our yes and no, and understanding the power of pleasure, not just in Sexuality, but Joy and Pleasure in our bodies and everyday life. \n\n\n\nHer certifications include multiple yoga systems, pelvic floor yoga, Reiki Masters, Womb/Perineal Steaming, deep study of The Wheel of Consent with Betty Martin (https://youtu.be/uQnFe0sVu2A?feature=shared) , training in Psychodrama, breathwork for trance, and a Masters in Theater for Educational and Therapeutic Use.  Marisa is the mother of a teen, lives with multiple chronic illnesses, and is queer.\n\n\n\n{Special Bonus Rant} At the end of this episode, I provide a little critical analysis of patriarchal conduct online, seasoned with several F-bombs, about leaving reviews on books. 🔥\n\n\n\nLearn more and book a 1:1 with Marisa: https://www.marisasullivanhealing.com/\n\n\n\nFollow her on Instagram (https://www.instagram.com/marisasullivan1/?hl=en)  to hear about upcoming workshops and online courses: @marisasullivan1 (https://www.instagram.com/marisasullivan1/?hl=en) \n\n\n\n***\n\n\n\nLearn more about my Facilitation Training (https://www.carmenspagnola.com/therapeutic-helper-trainings) \n\n\n\nJoin us in The Numinous Network (https://www.carmenspagnola.com/the-numinous-network)",
      "release": "2025-06-07T21:47:43Z",
      "duration": "02:00:56.5810000",
      "explicit": true,
      "spotifyId": "1Ldpko1nOTHjoCsATBJb35",
      "appleId": 1000711953112,
      "youTubeId": "0nFCa9nGBE8",
      "subjects": [
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Ldpko1nOTHjoCsATBJb35",
        "apple": "https://podcasts.apple.com/podcast/tnp270-art-pleasure-and-consent-with-marisa-sullivan/id852171726?i=1000711953112",
        "youtube": "https://www.youtube.com/watch?v=0nFCa9nGBE8"
      }
    },
    {
      "id": "a943724f-c6e0-4822-bb29-a1890f666468",
      "title": "TNP121- Alexandra Stein on Disorganized Attachment in Cults Totalitarian Regimes",
      "description": "How do you know if you\u0027re in a cult? And, how does an open society confront propaganda, brainwashing, and the rise of fascism? That\u0027s the undercurrent of this conversation with noted cultic studies expert, Alexandra Stein, PhD.\n\n \n\nAlexandra Stein is a writer and educator specializing in the social psychology of ideological extremism and other dangerous social relationships. She brings an extraordinary lens to cultic studies with her attachment-based approach, which helps us understand how an average person – privileged and educated, even – can fall under the influence of a high-demand group.  ",
      "release": "2019-03-23T04:00:34Z",
      "duration": "01:20:11",
      "explicit": false,
      "spotifyId": "04Oz0maci1Z1Q91oE0T7hc",
      "appleId": 1000430470477,
      "youTubeId": "axMNCq3JGIU",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/04Oz0maci1Z1Q91oE0T7hc",
        "apple": "https://podcasts.apple.com/podcast/tnp121-alexandra-stein-on-disorganized-attachment-in/id852171726?i=1000430470477",
        "youtube": "https://www.youtube.com/watch?v=axMNCq3JGIU"
      }
    }
  ]
}