{
  "_ts": 0,
  "id": "29dc3741-d2a1-49be-8f1f-97be8e8d1555",
  "name": "Casual Conversations on Awakening",
  "youTubeChannelId": "UCRdpcxxPnjP7nt4Hg2GUguw",
  "episodes": [
    {
      "id": "d323f804-ee62-4d4a-a3a7-f683cb97f6be",
      "title": "Cults - Casual Conversations #15",
      "description": "In this episode we take you deeper into our personal journey of awakening. Listen to our experiences with inner work and how we leverage this to authentically show up.\n\nDiving into some of the casual conversation talking points of today:\n\n• How are cults and masterminds, groups and communities formed\n• What to watch out for (red flags!) when joining groups or following leaders\n• What are group dynamics and how do they operate and influence you\n• Is the group of ‘pure’ intent, meaning does it need anything from you?\n• Why traumatised people often ignore realistic expectations from groups and communities\n• How when you have a teacher, followers and a promised way of life is already a red flag\n=========================================================\n\nAbout this podcast:\nThis podcast is an unfolding awakening journey where we discuss consciousness expansion, healing and awakening. It is recommended to watch from episode #1, to take the train of this journey together with us as we evolve. We recommend following your own intuition around listening to any given podcast that you feel guided to listen to in the moment, often this is an indication there’s something you need to hear to bring you further on your personal journey.\n\nFeel free to share any takeaways or insights in the comment section below.\nSessions \u0026 Frequency Infused Meditations (FIMs): Some podcasts include guided \u0027frequency infused\u0027 meditations. These contain live imprints of energies that came through in the moment that you will feel once you come into a space of openness and allowance. If you want to go deeper and want to receive 1on1 support, you can find us at:\n\nLionel: https://www.lionelfrancis.com\nMarlou: https://www.lovelifeawakening.com\n\nDisclaimer:\nThe content on this channel is not intended and should not be construed as medical, financial or psychological advice of any kind. Always consult an adequate professional for such support and advice. By listening/watching you confirm that you have reviewed and agreed to this Disclaimer.\n#awakening #awakeningjourney #spiritualawakening #heartopening #heartawakening",
      "release": "2024-12-13T23:00:35Z",
      "duration": "00:44:08",
      "explicit": false,
      "youTubeId": "g1W1pD1EdeA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g1W1pD1EdeA"
      }
    }
  ]
}