{
  "id": "28d0c39e-b572-4650-bf2a-408a385e0635",
  "name": "CBS",
  "episodes": [
    {
      "id": "196a4210-4ca1-467b-99ed-14dc0d0733a3",
      "title": "Guyana Tragedy The Story Of Jim Jones 1980",
      "description": "“I represent divine principle, total equality, a society where people own all things in common, where there’s no rich or poor, where there are no races. Wherever there are people struggling for justice and righteousness, there I am.”-Jim Jones, founder, Peoples TempleIn Jonestown: The Life and Death of Peoples Temple, award-winning filmmakers Stanley Nelson, Marcia Smith, and Noland Walker reveal the true, tragic story behind enigmatic preacher Jim Jones and his promise of a world of economic and racial equality that ultimately led to the largest mass murder-suicide in history. This documentary tells the story of the people who joined Peoples Temple, following Jones from Indiana to California and ultimately to their deaths in Guyana in November 1978. Jonestown was an official selection of numerous 2006 film festivals, including Tribeca, Silverdocs, Los Angeles, and San Francisco.Hailed as “surreal and heartbreaking” (The Village Voice) and “chilling” (San Francisco Chronicle), the 90-minute American Experience film features first-hand recollections of former Peoples Temple members, including some who narrowly escaped death in those frantic, final days in the South American jungle; relatives of those who died; and candid interviews with Jones’s son, Jim Jones, Jr. “We wanted the story to be told in the voices of the people who lived through it,” explains Nelson. “Of the five people who survived, there are — to my knowledge — three left alive. Two of them are in the film.”Jonestown also includes never-before-seen footage shot inside Peoples Temple, providing a rare glimpse of Jones’s passionate preaching and emotional healing services.Nelson was drawn to making this film by a persistent question: What drove thousands of people to join Peoples Temple? “They saw themselves changing the world, with the church as a tool,” he says, noting that Jones offered prospective members jobs, homes, and a sense of common purpose — striving to create a just world.“I did allow Jones to think for me because I figured that he had the better plan,” says former Peoples Temple member Hue Fortson, whose wife and infant son were among the more than 900 who died in Guyana after drinking cyanide-laced fruit punch. “I gave my rights up to him. As many others did.”In an audiotape that was recovered from the disaster site, Jones declares, “We committed an act of revolutionary suicide protesting the conditions of an inhumane world.”But was it suicide — or murder? “It’s impossible to say exactly what went on that day,” says Nelson. “But it is very clear that the kids — something like 250 people who were under eighteen – were all murdered.” Stanley Clayton, one of the few who escaped alive, clearly states his opinion in the film: “That man was killin’ us.”",
      "release": "2022-07-27T19:42:17",
      "duration": "03:08:28",
      "explicit": false,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "internetArchive": "https://archive.org/details/guyana-tragedy-the-story-of-jim-jones-1980"
      }
    }
  ]
}