{
  "_ts": 0,
  "id": "d002ee02-419a-4ccc-9d93-c36fb7b00cb3",
  "name": "CBS6 Albany",
  "youTubeChannelId": "UCMKP8n1dUg-b84lfpb0mfdA",
  "episodes": [
    {
      "id": "adc64583-bd49-4e5b-ad3f-c46a3b643659",
      "title": "Judge denies reduced sentence for former NXIVM leader Clare Bronfman",
      "description": "New York, NY (WRGB) — A federal judge on Monday denied a motion from Clare Bronfman to have her sentence reduced. Bronfman is serving a six year, nine month sentence for her role in the NXIVM sex cult.\n\nIn 2019, Bronfman pleaded guilty to identity theft, and a conspiracy involving undocumented immigrants. The former NXIVM leader and Seagram\u0027s liquor heiress recruited individuals into groups associated with NXIVM, then fraudulently sought visas for them.\n\nMORE: https://cbs6albany.com/news/local/judge-denies-reduced-sentence-for-former-nxivm-leader-clare-bronfman-seagrams-heiress-keith-raniere#",
      "release": "2024-04-25T18:55:55Z",
      "duration": "00:01:08",
      "explicit": false,
      "youTubeId": "Sut-De3mK_c",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Sut-De3mK_c"
      }
    },
    {
      "id": "3a115762-3de3-4ec5-8ef9-9c84e2503222",
      "title": "Keith Raniere Interviewed by Liz Bishop back in the 80\u0027s",
      "description": "Liz  Bishop interviews a young Keith Raniere, back when he was a student at RPI and a fan of Pac Man.",
      "release": "2020-10-27T15:52:01Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "u3v-WMb8kl8",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u3v-WMb8kl8"
      }
    },
    {
      "id": "d45b9552-ee87-4c40-aae5-b1ee6f24d234",
      "title": "Victim of church beating out of hospital; will testify",
      "description": "NEW HARTFORD, N.Y. (AP) -- A 17-year-old boy who authorities say was injured by members of his church during a beating that killed his brother has been released from the hospital and is expected to testify against two of the alleged attackers.\r\n   New Hartford police say Christopher Leonard was released from the hospital over the weekend and is under the supervision of Oneida County Child Protective Services.\r\n   Police say he and 19-year-old Lucas Leonard were beaten by their parents, sister and three other church members inside the Word of Life Christian Church Oct. 11 in an attack believed prompted by the brothers\u0027 desire to leave the church.\r\n   All six have pleaded not guilty.\r\n   Christopher Leonard is set to testify Wednesday at a felony hearing concerning assault charges against his sister, Sarah Ferguson and Joseph Irwin.\r\n   AP-WF-10-19-15 1718GMT",
      "release": "2015-11-15T14:37:36Z",
      "duration": "00:00:42",
      "explicit": false,
      "youTubeId": "xf-jPqK_a7g",
      "subjects": [
        "Word of Life Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xf-jPqK_a7g"
      }
    },
    {
      "id": "2c5460cf-787f-47b1-951a-981dd9ec7297",
      "title": "The Latest: Parents\u0027 case in NY church beatings can proceed",
      "description": "YOUR DESCRIPTION HAS REACHED THE LIMIT OF CHARACTERS ALLOWED AND WAS CUT. NEW HARTFORD, N.Y. (AP) -- The latest on the fatal beating of a 19-year-old inside a church (all times local):\r\n4:25 p.m.\r\nA judge has found prosecutors have enough evidence to move forward with their case against the parents of two teens who were beaten at an upstate New York church.\r\nNew Hartford Town Court Justice William Virkler says Bruce and Deborah Leonard will be held on bail while evidence is presented to a grand jury. The two have been charged with manslaughter in the death of their 19-year-old son, Lucas. Their 17-year-old son, Christopher, was also injured.\r\nThey have pleaded not guilty. Both defense attorneys unsuccessfully asked for the charges to be dismissed, saying prosecutors hadn\u0027t submitted sufficient proof to justify a manslaughter charge.\r\nProsecutors say the brothers were beaten for hours at the Word of Life Christian Church during a counseling session that was also attended by four others accused of participating.\r\n------\r\n3:45 p.m.\r\nPolice say the mother of a teenager who was beaten to death in an upstate New York church told an investigator she hit him with a cord because of \u0022things that he had said.\u0022\r\nState police Investigator Todd Grant testified Friday he didn\u0027t ask the mother, Deborah Leonard, what those things were.\r\nNew Hartford Town Police Chief Michael Inserra has said the beating earlier this week erupted from a spiritual counseling session over 19-year-old Lucas Leonard\u0027s desire to leave the Word of Life Christian Church.\r\nGrant says Deborah Leonard told him she and daughter Sarah Ferguson hit Lucas Leonard with a cord. Grant says the mother demonstrated the blows, hitting a table \u0022very hard.\u0022\r\nLucas\u0027 parents have pleaded not guilty to manslaughter. Ferguson has pleaded not guilty to assault.\r\n------\r\n2:45 p.m.\r\nA member of an upstate New York church where two teens were beaten says he watched their father strike them with what appeared to be a belt during a counseling session after services.\r\nDaniel Irwin spoke Friday at a preliminary hearing for Bruce and Debra Leonard, who are charged with manslaughter in the death of their 19-year-old son, Lucas. Lucas\u0027 17-year-old brother, Christopher, was seriously injured.\r\nThe couple has pleaded not guilty.\r\nIrwin says he watched through a window and saw Lucas bleeding and rolling on the floor. Irwin described panicked members of the Word of Life Christian Church saying Lucas was dead. He helped load the teen\u0027s body into a van to send him to the hospital.\r\nHe says other counseling sessions had taken place, but no one had been hit before.\r\n------\r\n2 p.m.\r\nA judge has granted an extension to prosecutors in the case of two suspects charged with assault in the beating death of a 19-year-old and the injuring of his 17-year-old brother at an upstate New York church.\r\nJoseph Irwin and Sarah Ferguson appeared in court in orange jumpsuits and shackled with chains around their waists.  Ferguson is the victims\u0027 sister.\r\nAssistant District Attorney Dawn Lupi says they need more time because Christopher Leonard remains hospitalized. Lucas Leonard died.\r\nLupi says there is a \u0022strong possibility\u0022 the defendants will face more serious charges.\r\nThe case was postponed until Oct. 23.\r\nProsecutors say the brothers were beaten for hours at the Word of Life Christian Church.\r\nFour others are charged in the case, including the boys\u0027 parents. All have pleaded not guilty.\r\n------\r\n1:50 p.m.\r\nA hearing for two upstate New York church members charged with assault in the brutal beating of two teen brothers has been postponed.\r\nProsecutors say they aren\u0027t prepared to go through with the hearing for David and Linda Morey because 17-year-old Christopher Leonard remains hospitalized and unable to testify. They are due back%",
      "release": "2015-11-12T17:28:13Z",
      "duration": "00:03:08",
      "explicit": false,
      "youTubeId": "GNSX1-J4DBI",
      "subjects": [
        "Word of Life Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GNSX1-J4DBI"
      }
    }
  ]
}