{
  "id": "2a0b5a2b-9f7f-451c-bfd5-df81c4e6415c",
  "name": "CBS 8 San Diego",
  "youTubeChannelId": "UCMscWako8oDvpdF4pppku-g",
  "episodes": [
    {
      "id": "6c2aee02-d50c-47c5-9c89-8aab8e8e66e6",
      "title": "Heaven\u0027s Gate | A look back at the suicide cult that shocked the world",
      "description": "A look back at the mass suicide that left 39 members of a cult dead in a Rancho Santa Fe mansion more than 25 years ago.",
      "release": "2023-04-18T22:10:09Z",
      "duration": "00:28:08",
      "explicit": true,
      "youTubeId": "GoBSn9QT2DM",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GoBSn9QT2DM"
      }
    },
    {
      "id": "1dac011e-b250-4375-b503-d775b02b151a",
      "title": "San Diego reporter tours Heaven\u0027s Gate mansion following cult\u0027s mass suicide",
      "description": "Just weeks after 39 bodies were found in a Rancho Santa Fe home rented by the Heaven\u0027s Gate religious cult, News 8 was able to tour the home. News 8\u0027s Ted Garcia was invited inside the home in the gated San Diego community and saw remnants of the mass suicide that had taken place there on March 26, 1997",
      "release": "2019-04-05T01:32:21Z",
      "duration": "00:01:58",
      "explicit": true,
      "youTubeId": "cPbt2qGFnmM",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cPbt2qGFnmM"
      }
    },
    {
      "id": "ac010a84-fdd8-40d3-910c-aa3726069565",
      "title": "Revisiting the Heaven\u0027s Gate mass suicide 20 years later in 2017",
      "description": "Twenty years after the Heaven’s Gate mass suicide, News 8’s Marcella Lee took a look back at the bizarre and tragic event that shocked a quiet San Diego neighborhood. The anniversary piece also shows the exit interviews of several members and the reaction from San Diego Sheriff’s Deputy Robert Brunk who was the first person to respond to the scene in 1997.\n\nCBS 8 is the local source for San Diego breaking news and top story headlines. Get the latest local San Diego TV news, sports, weather and more.\n\nMore from CBS 8:\nWebsite: https://www.cbs8.com\nTwitter: https://twitter.com/CBS8\nFacebook: https://www.facebook.com/News8\nInstagram: https://www.instagram.com/cbs8",
      "release": "2019-04-03T01:35:31Z",
      "duration": "00:02:09",
      "explicit": false,
      "youTubeId": "ieMRoIfSgBM",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ieMRoIfSgBM"
      }
    },
    {
      "id": "3f4c5992-07e3-4ee1-890c-ccb2031236ac",
      "title": "Heaven’s Gate mass suicide in San Diego County made worldwide headlines in 1997",
      "description": "On March 26, 1997, the Heaven’s Gate religious cult garnered worldwide attention after nearly 40 of its members were discovered dead at a mansion in the Rancho Santa Fe neighborhood of San Diego. News 8 footage from the day after the discovery of 39 dead Heaven’s Gate members showcases some of the videos they made prior to the mass suicide. Reporter Judy Hsu narrates as several members are shown with shaved heads talking about how they came to join the group. As images of the home and bodies are shown, the audio continues with members talking about their bodies as “vehicles” and leaving the “human kingdom for a level above human.” The video continues with a message from group leader Marshall Applewhite – also known as “Do.”\n\nCBS 8 is the local source for San Diego breaking news and top story headlines. Get the latest local San Diego TV news, sports, weather and more.\n\nMore from CBS 8:\nWebsite: https://www.cbs8.com\nTwitter: https://twitter.com/CBS8\nFacebook: https://www.facebook.com/News8\nInstagram: https://www.instagram.com/cbs8",
      "release": "2019-04-03T01:31:02Z",
      "duration": "00:04:21",
      "explicit": true,
      "youTubeId": "K2rdk6h4XZI",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K2rdk6h4XZI"
      }
    }
  ]
}