{
  "_ts": 0,
  "id": "32452bf3-3df7-4012-9904-2b3431e75313",
  "name": "Channel 4 News",
  "appleId": 1488353942,
  "youTubeChannelId": "UCTrQ7HXWRRxr7OsOtodr2_w",
  "episodes": [
    {
      "id": "42ceb3e6-bb5e-43b9-b7c1-d736bc54f8ba",
      "title": "Church abuse: synod votes to delay independent safeguarding",
      "description": "After a series of abuse scandals, survivors had hoped The Church of England would outsource its handling of future allegations.\n\n(Subscribe: https://bit.ly/C4_News_Subscribe) \n\nBut today the annual meeting of the General Synod, the church governing body, voted against establishing a fully independent body to oversee safeguarding - in a vote which representatives of abuse survivors called \u0022incredibly disappointing\u0022 and \u0022a punch in the gut\u0022.\n-----------------------  \nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2025-02-11T19:41:42Z",
      "duration": "00:06:25",
      "explicit": false,
      "youTubeId": "SnqxvRqjShQ",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SnqxvRqjShQ"
      }
    },
    {
      "id": "28eaca9c-2541-4397-a84b-72a5455ddf32",
      "title": "Church scandal: Man behind cover-up was abuser",
      "description": "Now eight years after this programme unmasked John Smyth’s brutal abuse of boys and young men, an official review ordered by the Church of England revealed the full extent of the institutional cover-up of his activities. \n\n(Subscribe: https://bit.ly/C4_News_Subscribe) \n-----------------------  \nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\n\nChannel 4 News can disclose that the man who instigated that decades-long cover-up, a friend of Smyth\u0027s, was himself an abuser.\n His name is Reverend David Fletcher, a man described by his victims as the “conductor of the orchestra”. \n\nWe spoke exclusively to three women about the abuse they suffered and the misogyny at the heart of the evangelical church.\n\nA warning, there are some very distressing details of sexual abuse in this report and If you\u0027ve been affected by any of those issues, you can seek help by going to channel4.com/support\n\nProduced by Claire Sinka",
      "release": "2025-02-06T19:48:43Z",
      "duration": "00:10:38",
      "explicit": false,
      "youTubeId": "R4K-alhK6us",
      "subjects": [
        "Church Of England",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R4K-alhK6us"
      }
    },
    {
      "id": "18ec0072-64f9-4db0-b4d0-3319ed1ea06d",
      "title": "Church Abuse Scandal: serial abuser\u0027s time in South Africa exposed",
      "description": "He\u0027s been described as the \u0027most prolific serial abuser associated with the Church of England.\u0027 And by 2013 the highest levels of the church knew John Smyth had a history of grooming and beating teenage boys. \n\n(Subscribe: https://bit.ly/C4_News_Subscribe)\n\nToday, the Anglican Church of Southern Africa apologised for failing to protect congregants and the wider community in Cape Town from the \u0027high risk\u0027 of abuse Smyth potentially posed. \n\nThis programme has uncovered new evidence of the scale of his continued abusive behaviour in South Africa as recently as 2015. He was even planning a holiday camp for children as young as 7. \n\nWarning: This report contains descriptions of a sexual nature.\n\n-----------------------\nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2025-02-04T19:56:17Z",
      "duration": "00:13:33",
      "explicit": false,
      "youTubeId": "aT2yIBgxpt4",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aT2yIBgxpt4"
      }
    },
    {
      "id": "2d38570f-ee56-4131-ba20-187d91d7d0cb",
      "title": "Church abuse scandal: Bishop of Liverpool quits amid allegations",
      "description": "Hours after John Perumbalath announced his retirement as Bishop of Liverpool we show a written account which highlights safeguarding issues during his appointment, and the alleged role played by the current leader of the Church, Stephen Cottrell. (Subscribe: https://bit.ly/C4_News_Subscribe) \n\nOne of Perumbalath\u0027s accusers, the Bishop of Warrington, who made an allegation of sexual harrassment back in 2023, said she regretted that the Church had not dealt with concerns in a proper and satisfactory manner.\n\n-----------------------  \nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2025-01-30T19:58:03Z",
      "duration": "00:11:39",
      "explicit": false,
      "youTubeId": "DeF0uQJmoK8",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DeF0uQJmoK8"
      }
    },
    {
      "id": "f1f824dc-2a50-4f61-a9f0-804e74cb4182",
      "title": "Church abuse scandal: calls for Bishop of Liverpool to step down",
      "description": "This programme revealed allegations of sexual assault and harrasment against the Bishop of Liverpool. He said he\u0027d done nothing wrong. \n\n(Subscribe: https://bit.ly/C4_News_Subscribe) \n\nNow we can reveal how the man currently leading the Church called John Perumbalath to a meeting to discuss his behaviour. \n\nTonight, his own Liverpool diocese has released a statement calling his position untenable. Has the Church of England lost not just its grip but its moral authority? The lead Bishop for safeguarding also tells us tonight the Bishop of Liverpool should step aside.\n\n-----------------------  \nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2025-01-29T19:21:06Z",
      "duration": "00:11:49",
      "explicit": false,
      "youTubeId": "JS4AkMu2XvA",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JS4AkMu2XvA"
      }
    },
    {
      "id": "68e8957f-ab72-4a63-84cd-dd5a01242428",
      "title": "Church Abuse Scandal: Bishop accuses bishop of sexual harassment",
      "description": "Ever since Justin Welby\u0027s unprecedented resignation, prompted by allegations of abuse first reported on this programme, the Church has been in crisis. \n\n[Subscribe: https://bit.ly/C4_News_Subscribe]\n\nThe man currently leading the institution, the Archbishop of York, Stephen Cottrell, has already faced multiple calls to quit over his alleged failure to handle abuse cases properly. \n\nOur report tonight - detailing accusations of sexual assault and harassment - ratchets up the pressure, as we reveal Archbishop Stephen was informed of the allegations before the Bishop at the centre of the claims was enthroned in a more senior role. \n\nWe should warn you, this report contains some distressing testimony.\n\nTonight the Bishop of Liverpool told us:\n\n“I have consistently denied the allegations made against me by both complainants. I have complied with any investigation from the National Safeguarding Team.\n\nWhilst I don’t believe I have done anything wrong, I have taken seriously the lessons learnt through this process addressing how my actions can be perceived by others.\n\nI will comply with any investigation deemed necessary. I take safeguarding very seriously”.  \n\nA Church of England spokesperson said:\n\n“The complaint was made after Bishop John had legally become Bishop of Liverpool. The National Safeguarding Team…concluded there were no ongoing safeguarding concerns, but a learning outcome was identified with which the Bishop fully engaged. \n\nThe information from the second complainant was assessed not to be a safeguarding matter but a matter of alleged misconduct. Pastoral support has been provided throughout for the second complainant and is ongoing. \n\nThe second complainant did not bring a Clergy Discipline Measure complaint within the one-year deadline. She later applied for permission to bring it after the deadline, which the Archbishop of York fully supported. However, this was refused by an independent judge, the Deputy President of Tribunals.”\n\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2025-01-28T20:26:00Z",
      "duration": "00:17:48",
      "explicit": false,
      "youTubeId": "H4q0efal-Ig",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=H4q0efal-Ig"
      }
    },
    {
      "id": "c0e7d3a0-6509-40ab-bdd5-9492ba7abc25",
      "title": "Police officer on misogyny: ‘I felt the Met had covered it up’",
      "description": "It\u0027s rare for whistleblowers inside the police to give interviews, fearing it will affect their jobs if they speak out.\n\nBut now, a chief inspector has broken ranks to call out what she says is the Metropolitan Police\u0027s failure to tackle toxic misogyny.\n\nLizzie Jones came forward after Kristina O’Connor, the daughter of the late entertainer Des O’Connor, complained about a decorated detective who made unwanted sexual advances when she reported an attempted mugging.\n\nIn an exclusive interview about the case, the officer makes fresh allegations over the Met’s conduct that cast doubt on its commitments to root out predatory behaviour.\n\n(Subscribe: https://bit.ly/C4_News_Subscribe) \n-----------------------  \nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2025-01-07T20:06:38Z",
      "duration": "00:09:09",
      "explicit": false,
      "youTubeId": "oUTL8dqsmVM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oUTL8dqsmVM"
      }
    },
    {
      "id": "f6899fdd-026f-46b3-b6e3-2f46ee47e884",
      "title": "Church abuse scandal: next Archbishop already facing calls to quit over inaction",
      "description": "The Archbishop of York, Stephen Cottrell is facing renewed calls to quit, just three weeks before he takes over as de facto leader of the Church of England.\n\n(Subscribe: https://bit.ly/C4_News_Subscribe) \n-----------------------  \nIn his previous job in the diocese of Chelmsford, Archbishop Stephen allowed a priest to remain in post despite knowing of multiple sexual assault allegations against him. He even made the man in question, David Tudor, an honorary canon of Chelmsford Cathedral.\n\nWe\u0027ve been hearing from one of Tudor\u0027s alleged victims, who says her world fell apart when she was sexually assaulted as a teenager.\n\nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2024-12-16T19:58:51Z",
      "duration": "00:06:35",
      "explicit": false,
      "youTubeId": "MX2GmVzHX4g",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MX2GmVzHX4g"
      }
    },
    {
      "id": "61d78d77-afc4-458f-a5f5-5bfaa47e465c",
      "title": "Man raped by vicar as teen says Archbishops failed him",
      "description": "When the Archbishop of Canterbury Justin Welby steps down in January the next most senior person in the Church of England - the Archbishop of York Stephen Cottrell - will take over his duties.\n\n(Subscribe: https://bit.ly/C4_News_Subscribe) \n\nBut a man who was raped by a priest as a teenager has told this programme Lord Cottrell was among many senior members of the clergy to fail him - and that he should resign.\n\nThis as a member of the General Synod and senior parliamentarians tell us that Bishops accused of failing to root out church abuse should lose their historic right to sit in the house of Lords.\n\nA warning - there are some distressing themes in this report.\n-----------------------  \nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2024-11-26T19:54:33Z",
      "duration": "00:13:31",
      "explicit": false,
      "youTubeId": "ujq5ARaQiKs",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ujq5ARaQiKs"
      }
    },
    {
      "id": "44b44614-6ef4-4ffe-ae9d-98bcbca3bfe9",
      "title": "Police action against Church of England ‘must be considered’, says review’s author",
      "description": "The Archbishop of Canterbury will step aside from his official duties by January 6th - the Day of Epiphany. \n\n(Subscribe: https://bit.ly/C4_News_Subscribe) \n\nHe resigned in the wake of a report into serial abuse by Christian summer camp leader John Smyth, who was first unmasked by this programme.\n\nThe Makin review was ordered as a result and its author, Keith Makin, went on to conclude that Smyth was the ‘most prolific abuser to be associated with the Church of England’.\n\nWe sat down with Keith Makin for his first interview since his report was published.  I began by asking him what he thought about the impact of his report.\n\nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2024-11-20T19:48:54Z",
      "duration": "00:14:27",
      "explicit": false,
      "youTubeId": "4530MGl6UzM",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4530MGl6UzM"
      }
    },
    {
      "id": "95f6f64e-2672-4f15-8994-b25451b6b1b4",
      "title": "Church abuse scandal: my dad the abuser",
      "description": "The words of John Smyth’s son PJ - one of his earliest victims - in an exclusive interview with this programme. \n\n(Subscribe: https://bit.ly/C4_News_Subscribe) \n\nThe Makin review detailed Smyth\u0027s horrific abuse of those he met at public schools and Christian summer camps.  What is less well known, is how Smyth senior controlled and abused his own family, who are only now facing up to the devastating toll on their lives. \n\nWarning, this report contains extremely distressing details. \n\n\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2024-11-18T19:44:22Z",
      "duration": "00:26:18",
      "explicit": false,
      "youTubeId": "9_Jn1of6GHI",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9_Jn1of6GHI"
      }
    },
    {
      "id": "229281fe-5090-457f-94f6-c4559a69094a",
      "title": "Smyth scandal: Church of England victims fight for compensation",
      "description": "Victims of John Smyth\u0027s brutal physical and sexual abuse have welcomed a letter from the Church of England\u0027s safeguarding team in which the institution \u0022accepts the harm caused\u0022 and offers a meeting with Justin Welby.\n\n[Subscribe: https://bit.ly/C4_News_Subscribe]\n\nThe Archbishop of Canterbury resigned earlier this week over his failure to do enough to stop Smyth\u0027s abuse to as many as 130 boys and young men. \n\nBut now, we can disclose that a legal loophole may mean the victims - some of whom have had their lives and livelihoods ruined - won\u0027t receive financial compensation for what happened, because Smyth was not directly employed by the church. \n\n\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2024-11-14T20:07:40Z",
      "duration": "00:11:26",
      "explicit": false,
      "youTubeId": "8qC927-6eiY",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8qC927-6eiY"
      }
    },
    {
      "id": "ffd163cd-067e-4bf3-b709-98a77f607a77",
      "title": "Archbishop of Canterbury resigns over church abuse scandal",
      "description": "Justin Welby\u0027s resignation as the Archbishop of Canterbury came after days of mounting pressure following a damning report into the cover-up of horrific abuse. \n\n[Subscribe: https://bit.ly/C4_News_Subscribe]\n\nLess than a week ago, an independent review - set up after an investigation by this programme - concluded that John Smyth - the most prolific serial abuser to be associated with the church - might have been brought to justice had the Archbishop formally reported him to police in 2013.\n\nMr Welby had apologised for his failures regarding the John Smyth case – which saw as many as 130 boys and young men abused over sting five decades – but he declined to resign when we spoke to him last week. However, all that changed today. \n\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2024-11-12T20:08:37Z",
      "duration": "00:29:06",
      "explicit": false,
      "youTubeId": "coRCCc_Zc40",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=coRCCc_Zc40"
      }
    },
    {
      "id": "d02e6996-42f4-4320-b567-909a5b272403",
      "title": "Archbishop of Canterbury extended interview on John Smyth scandal and resigning",
      "description": "In an exclusive interview on 7 November, Archbishop of Canterbury Justin Welby talks to Cathy Newman about the John Smyth scandal and the Makin Report, which revealed that senior members of the Church of England ‘covered up’ abuse perpetrated by one its members for more than 40 years.\n\n[Subscribe: https://bit.ly/C4_News_Subscribe]\n\nA 2017 Channel 4 News investigation first exposed the abuse by John Smythe, described as the Church’s ‘most prolific abuser.’\n\nLord George Carey told Channel 4 News he has \u0022no recollection\u0022 of John Smyth, and that he gave evidence to the Makin review which has \u0022been ignored\u0022.\n\nA warning - there are distressing details in this interview.\n\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2024-11-11T15:58:35Z",
      "duration": "00:30:12",
      "explicit": false,
      "youTubeId": "hz2XYmr0gos",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hz2XYmr0gos"
      }
    },
    {
      "id": "8bc57161-1814-4917-a6b2-a00567020cf3",
      "title": "Church of England failed to stop most prolific abuser, exclusive report finds",
      "description": "The Archbishop of Canterbury has told us in an exclusive interview that he considered resigning as recently as this morning - over a report revealing that senior members of the Church of England ‘covered up’ abuse perpetrated by one its members for more than 40 years. \n\n[Subscribe: https://bit.ly/C4_News_Subscribe]\n\nIt was a 2017 Channel 4 News investigation that first exposed the abuse by John Smythe, described today as the Church’s ‘most prolific abuser.’ \n\nA warning - you might find some of the details in this report distressing.\n\n-------\n\nGet more news at our site - https://www.channel4.com/news/ \n\nFollow us:\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/\nTwitter - https://twitter.com/Channel4News\nFacebook - https://www.facebook.com/Channel4News/",
      "release": "2024-11-07T20:03:40Z",
      "duration": "00:12:19",
      "explicit": false,
      "youTubeId": "3QM9HR-XBuk",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3QM9HR-XBuk"
      }
    },
    {
      "id": "d694c3ef-be72-4ed3-985a-1064de7670fb",
      "title": "Christian nationalism is a ‘danger’ to U.S democracy, says filmmaker",
      "description": "The subject of God and politics has long fascinated American actor and filmmaker Robert Reiner. The veteran Democrat supporter\u0027s latest film is called \u0022God and Country\u0022. \n(Subscribe: https://bit.ly/C4_News_Subscribe) \n\nIt explores the the rise of Christian nationalism through the eyes of America\u0027s mass of Theologians and Conservative thinkers.  He began by telling us about the roots of Christian nationalism. \n-----------------------  \nFollow us:\nFacebook - https://www.facebook.com/Channel4News/\nTwitter - https://twitter.com/Channel4News\nTikTok - https://www.tiktok.com/@c4news\nInstagram - https://www.instagram.com/channel4news/",
      "release": "2024-02-17T19:34:34Z",
      "duration": "00:04:38",
      "explicit": false,
      "youTubeId": "QCDvv-SzOgU",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QCDvv-SzOgU"
      }
    },
    {
      "id": "1d9190aa-bf31-4f91-a4ed-054e5b5ad5c9",
      "title": "Brixton Maoist cult: daughter speaks out",
      "description": "Maoist cult leader Aravindan Balakrishnan is jailed for 23 years on charges of rape, sexually assaulting two women and imprisoning his own daughter. She waives her anonymity to speak out about the years of bullying she endured.\nSubscribe for more like this, every day: http://bit.ly/1epe41j\n \nDangerous world: http://bit.ly/1JCsSYb\nThe news explained: http://bit.ly/1epgay4\nMusic: http://bit.ly/1RVTRNy\nTechnology: http://bit.ly/1LI1K9y\n \nLike us on Facebook: http://on.fb.me/1wQ1Gty\nFollow us on Twitter: http://bit.ly/1mFUjBD",
      "release": "2016-01-29T19:45:53Z",
      "duration": "00:06:39",
      "explicit": false,
      "youTubeId": "hLWOYsDXqGE",
      "subjects": [
        "Lambeth Slavery Case"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hLWOYsDXqGE"
      }
    },
    {
      "id": "859350ad-5916-48dc-8876-425aa9149d75",
      "title": "Maoist cult trial: main suspect found guilty",
      "description": "The court decided he sexually assaulted two women and held his own daughter prisoner for 30 years. The south London Maoist collective leader Aravindan Balakrishnan could spend the rest of his life in jail after he was found guilty of a string of offences. Today his daughter welcomed the verdict - saying she was \u0022overwhelmed with relief\u0022. \n\nSubscribe for more like this, every day: http://bit.ly/1epe41j\n \nDangerous world: http://bit.ly/1JCsSYb\nThe news explained: http://bit.ly/1epgay4\nMusic: http://bit.ly/1RVTRNy\nTechnology: http://bit.ly/1LI1K9y\n \nLike us on Facebook: http://on.fb.me/1wQ1Gty\nFollow us on Twitter: http://bit.ly/1mFUjBD",
      "release": "2015-12-04T20:00:19Z",
      "duration": "00:06:55",
      "explicit": false,
      "youTubeId": "Ln50_8_3juY",
      "subjects": [
        "Lambeth Slavery Case"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ln50_8_3juY"
      }
    }
  ]
}