{
  "_ts": 0,
  "id": "730e393c-8593-4743-bf6b-4e4e307974e6",
  "name": "ChannelC²",
  "youTubeChannelId": "UCZsypt82_0KYxRcJphBb9iA",
  "episodes": [
    {
      "id": "e12b01ad-3781-4fb7-ac9f-9e59b35a134e",
      "title": "Irish Jehovah\u0027s Witness Elder exposes the hypocrisy and un-Christian conduct of Watchtower Headquart",
      "description": "John Joseph May describes his experience with the hypocritical Watchtower hierarchy in THE PURGE of the 1980\u0027s when many faithful Christian Jehovah\u0027s Witnesses were disfellowshipped and branded as apostates for following their Christian conscience.\n\nBrother John Joseph May was an elder in Ireland for many years. Back when Brother Ray Franz was wrongly disfellowshiped he was bothered by it so much that he actually went into debt so that he could buy a plane ticket to America. He and another brother, Martin Merriman, flew to Brooklyn Bethel, in New York City, so that they could meet with the governing body at that time. They knew a couple of the brothers serving on the body personally, and both had a good reputation of having been faithful JW elders for many years, but despite that the Governing Body refused to meet with them, or to discuss what happened at Bethel with Brother Franz and those who were forced out of Bethel Headquarters and disfelloshipped.\n\nYou may find a better audio of this interview at:\nhttp://www.jwstruggle.com/2011/09/one-of-the-best-testimonies-ive-heard/\n\n***Channel Description***\nChannelC² is a cyberstation where interested persons may tune in to discussion among conscientious Jehovah\u0027s Witnesses and some concerned former members. The signal is beamed from a virtual island in cyberspace, the infinite realm where minds can meet in the sanctuary of anonymity. Here secrets of the heart can be revealed and that which is forbidden can be discussed freely without sanction.\n\nChannelC² Website:  https://sites.google.com/view/channelc2",
      "release": "2020-01-15T06:23:51Z",
      "duration": "00:55:50",
      "explicit": false,
      "youTubeId": "F5y2ZBk7d_Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F5y2ZBk7d_Y"
      }
    }
  ]
}