{
  "id": "ce2aeebd-a365-4956-8e99-96fbe4468894",
  "name": "CHCH News",
  "youTubeChannelId": "UCjkETDTi-OBxrN4z5lvaL5A",
  "episodes": [
    {
      "id": "941dcf67-e452-44c3-96f0-0c6731c8c2aa",
      "title": "Former Prince Andrew arrested on Epstein-related misconduct allegations",
      "description": "Former Prince Andrew is in police custody Thursday on suspicion of misconduct in public office tied to his links to convicted sex offender Jeffrey Epstein.\n\nAndrew Mountbatten-Windsor is currently not facing a charge, but London police say they’re looking into reports of sensitive trade information that was sent to Epstein while Andrew was Britain’s special envoy for international trade in 2010.\n\nThis is the first time a senior member of the Royal Family was placed under arrest in roughly four centuries.\n\nMountbatten-Windsor was seen inside of a vehicle leaving a police station in the eastern part of England Thursday, after being questioned all day by detectives from Thames Valley police over his dealings with Epstein.\n\nSince the release of the infamous “Epstein files” UK police said they were looking into allegations that the 66-year-old, former prince of the Royal Family, passed on confidential documents to the convicted sex offender, while he was a British trade envoy.\n\nIn an even rarer move, King Charles III released a statement Thursday, stating that the “law should take its course” as they look into his brother.\n\n“What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities. In this, as I have said before, they have our full and wholehearted support and co-operation,” reads the statement.",
      "release": "2026-02-20T02:20:41Z",
      "duration": "00:03:40",
      "explicit": false,
      "youTubeId": "K9QRuiuzVJU",
      "subjects": [
        "Human Trafficking",
        "_America",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K9QRuiuzVJU"
      }
    }
  ]
}