{
  "id": "e303c412-cea9-422f-b186-afcc56e193e2",
  "name": "CheckMate",
  "youTubeChannelId": "UCB24VyNRSnyNI3UFaRbkpBA",
  "episodes": [
    {
      "id": "ad120869-f58c-406c-9080-1ba0ccbdc031",
      "title": "UPDATES: Daniel Muir, Pastor Ponzi \u0026 The TRAGIC Trajectory of Straightway",
      "description": "#DanielMuir #StraightwayTruthMinistries #Cults #TrueCrime #HebrewIsraelites\r\n\r\nA LOT of things have happened since my last stream on the Straightway cult. The Muirs are out of jail on bond, and according to reports, Daniel Muir confessed to his brother in law that he whooped his son like a grown man, and that if they were in their religious homeland \u0022he would have been put to death for his acts.\u0022 I\u0027m going to update you on Bryson Muir\u0027s case, show you why I call the leader of the cult Pastor Ponzi, and talk about the tragic and troubling trajectory of yet ANOTHER cult that uses YouTube to gain new, vulnerable followers.\r\n\r\nTo join this channel and get access to perks...\r\nhttps://www.youtube.com/channel/UCB24VyNRSnyNI3UFaRbkpBA/join\r\n\r\nPlease do not send anyone mentioned on this stream, or ANYONE at all, any hate or harassment. This stream is for commentary purposes only, and is based solely on my opinion.\r\n\r\nCHAT AND PANEL GUEST POLICY:\r\n👉🏻 Anyone who is interested in trials, true crime and human behavior is welcome in my chat, with a few exceptions. If you are not welcome, you are blocked.\r\n👉🏻 While in chat, you are expected to behave as if you are in court. Please leave your personal drama and gripes at the door and focus on the topic at hand.\r\n👉🏻 People who do not get along with each other should feel safe to share opinions in my chat without fear of personal attacks or alienation.\r\n👉🏻 I do not share or endorse the opinions or actions of any chatter or panel guest and should not be blamed or prejudiced by their actions on or off my channel.\r\n👉🏻 Verbal abuse of any kind against anyone will not be tolerated.\r\n👉🏻 If you disrespect my policy, you will be blocked without warning. If you believe you were blocked in error, send an email to CheckmateHumanity@gmail.com to request reconsideration.\r\n👉🏻 This policy is subject to change at any time at my discretion.\r\n\r\nIt’s unfortunate that I have to come off like a drill sergeant to set appropriate boundaries for chat behavior, but you can blame the Internet 😵‍💫",
      "release": "2024-07-19T12:07:53Z",
      "duration": "01:31:23",
      "explicit": false,
      "youTubeId": "9orLrd_Pxwg",
      "subjects": [
        "Straightway"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9orLrd_Pxwg"
      }
    }
  ]
}