{
  "_ts": 0,
  "id": "6760bc20-c12e-4bcd-8d6a-0c8dd6d51632",
  "name": "Cheers To Leaving!",
  "spotifyId": "1ZWggZcKjdQ1sJyh4yyb9d",
  "appleId": 1568302029,
  "episodes": [
    {
      "id": "e3e8c48d-465f-4d40-8a8f-48c748ce713d",
      "title": "Ep. 96 Choosing Truth, Losing Everything (Part 1)",
      "description": "Send us a text TW: We talk about a lot of intense content that some might not be ready to hear to may not want to listen to and we wanted to put a precursor to this episode in case you are expecting an easy listening episode. But if you\u0027re ready for lots of truth bombs and existentialism and contemplating reality you\u0027re going to love this episode! Our guest today, Britney Hartley, brings a unique blend of scholarly depth and real-world spiritual insight to our conversation today. We talk about nihilism, existentialism, philosophy, suffering, free will and much more! Britt\u0027s website: Home Britts book: No Nonsense Spirituality: All the Tools No Belief Required: Hartley, Brittney L.: 9781958670361: Amazon.com: Books Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2025-06-19T17:00:00Z",
      "duration": "01:08:28.0420000",
      "explicit": true,
      "spotifyId": "4JnO2zeNcM2xqi0qn29FIb",
      "appleId": 1000713683579,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JnO2zeNcM2xqi0qn29FIb",
        "apple": "https://podcasts.apple.com/podcast/ep-96-choosing-truth-losing-everything-part-1/id1568302029?i=1000713683579"
      }
    },
    {
      "id": "6a4da3b6-3b4b-4212-8d0d-f0aee73954bc",
      "title": "Ep 95 Therapy Session with Brian and Troy (from IWATF)",
      "description": "Send us a text\nThe gangs all here! We are so happy to have Brian and Troy back on the podcast. We spend the first 25min venting about the current situation in America because WHAT THE HELL. Then Cameron and Rachael share personal stories involving loved ones who are in Christianity and Brian and Troy comment on it. \nThe One ShalomWelcome to One Shalom! We are two young adults who have a burden to share the shalom...Listen on: Apple Podcasts   Spotify\nSupport the show\nFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2025-05-22T10:00:00Z",
      "duration": "01:19:39",
      "explicit": false,
      "spotifyId": "5FKz7xV08Siqq1SdkIzG67",
      "appleId": 1000709413415,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FKz7xV08Siqq1SdkIzG67",
        "apple": "https://podcasts.apple.com/podcast/ep-95-therapy-session-with-brian-and-troy-from-iwatf/id1568302029?i=1000709413415"
      }
    },
    {
      "id": "4e8590a7-4ea0-4993-83a9-3582ca571768",
      "title": "Ep 94 Relationships, Faith and Hot Takes",
      "description": "Send us a text We have things to say and we are saying them. Welcome to another manic episode where Cameron and Rachael \u0027shoot the shit\u0027. They talk relationships, politics and christianity. They may even divulge never before heard secrets...so Join the conversation as they explore the highs, lows, and awkward moments that come with mixing personal beliefs, political views, and romantic connections. Whether you\u0027re looking for laughs or deep dives, this episode brings it all with a side of spicy opinions. Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2025-03-27T20:00:00Z",
      "duration": "01:13:17.0350000",
      "explicit": true,
      "spotifyId": "5A9W0BkAeDsnAfXhBgM9OJ",
      "appleId": 1000701153792,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5A9W0BkAeDsnAfXhBgM9OJ",
        "apple": "https://podcasts.apple.com/podcast/ep-94-relationships-faith-and-hot-takes/id1568302029?i=1000701153792"
      }
    },
    {
      "id": "d9958728-e80e-4ff0-a1f8-4597136b538a",
      "title": "Ep 93 Christian Nationalism’s Endgame: Trump, Elon, and Project 2025 (with Tia Levings)",
      "description": "Send us a text The Christian nationalist movement isn’t just a fringe ideology—it’s shaping the highest levels of government. In this episode, we sit down with author Tia Levings to break down Project 2025, Trump’s hand-picked cabinet, and the alarming role of Elon Musk in the new administration. We discuss the calculated rise of Christian nationalism, how it threatens democracy, and what we can do to fight back. If you’re feeling overwhelmed by the news cycle, Tia offers insight into how to stay informed without burning out. Buckle up—this conversation is essential listening for anyone concerned about the future. Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2025-02-20T11:00:00Z",
      "duration": "00:46:45.8120000",
      "explicit": true,
      "spotifyId": "7960MCkjg0IHx3C54Lwjbq",
      "appleId": 1000694317341,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7960MCkjg0IHx3C54Lwjbq",
        "apple": "https://podcasts.apple.com/podcast/ep-93-christian-nationalisms-endgame-trump-elon-and/id1568302029?i=1000694317341"
      }
    },
    {
      "id": "93a97d6a-7282-4f67-9393-d892b916c0ff",
      "title": "Ep 92 Jesus was a Socialist",
      "description": "Send us a text Today we are talking about our favorite zombie! Jesus. We’re diving into a topic that ruffles feathers across the political and religious spectrum: Would Jesus be a socialist? Spoiler alert, we think so. Tune in to find out why! This episode will make you think, make you mad, or make you reconsider that framed picture of Jesus with an American flag. Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2025-02-06T11:00:00Z",
      "duration": "01:09:02.4970000",
      "explicit": false,
      "spotifyId": "1DqbU3qWzT2VX1cX5hYr0B",
      "appleId": 1000689618147,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DqbU3qWzT2VX1cX5hYr0B",
        "apple": "https://podcasts.apple.com/podcast/ep-92-jesus-was-a-socialist/id1568302029?i=1000689618147"
      }
    },
    {
      "id": "1206e23b-3a56-4c91-b570-800d11dc9d3f",
      "title": "Ep 91 We Die at the End of This",
      "description": "Send us a textComing to you on inauguration day and Cameron and Rachael MIGHT be feeling a little existential. Tune in to hear more updates about Rachael and her mom, Trumps Cabinet picks, executive orders, Tiktok Ban, Meta and more. Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2025-01-23T17:00:00Z",
      "duration": "01:07:05",
      "explicit": false,
      "spotifyId": "3fcaNRnTEbKw395MP1NtQX",
      "appleId": 1000685204033,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3fcaNRnTEbKw395MP1NtQX",
        "apple": "https://podcasts.apple.com/podcast/ep-91-we-die-at-the-end-of-this/id1568302029?i=1000685204033"
      }
    },
    {
      "id": "a554dcb5-6574-4ccd-99dc-44f9e6918321",
      "title": "Ep 90 Project 2025: A Blueprint for the Future of America",
      "description": "Send us a text We\u0027re baaaaack. Thanks for your patience during our little hiatus. Cameron was busy with his classes and Rachael had a BABY. Listen as Rachael and Cameron catch up with what\u0027s been going on in their lives, talk about the election and dive into project 2025... What is Project 2025, and why is it sparking controversy? In this episode, we critically examine the conservative movement’s bold plan to reshape America’s future. Project 2025 outlines a sweeping agenda to transform federal government policies, dismantle regulations, and enforce conservative ideals across social, economic, and political spheres. Critics warn it could undermine democratic institutions, erode civil liberties, and deepen societal divides. We unpack the key components of this ambitious plan, explore its potential consequences, and ask the pressing question: Is Project 2025 a roadmap to reform—or a blueprint for disaster? Shout out to our Subscriber Cathy! You\u0027re the best! Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-12-19T11:00:00Z",
      "duration": "01:28:19.0430000",
      "explicit": true,
      "spotifyId": "4KOuq7BcQVvHZrs0gDEQ0g",
      "appleId": 1000680955892,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4KOuq7BcQVvHZrs0gDEQ0g",
        "apple": "https://podcasts.apple.com/podcast/ep-90-project-2025-a-blueprint-for-the-future-of-america/id1568302029?i=1000680955892"
      }
    },
    {
      "id": "64efaa60-7f17-41f5-aa27-e5d753755b40",
      "title": "Ep 89 Was Everyone in my Church Experiencing Religious Psychosis?",
      "description": "Send us a text So trending on the tiktok is spiritual psychosis. We hadn\u0027t heard this term before so we wanted to discuss it. Honestly, this sounds like it could be applied to A LOT of evangelical christians, charismatics and possibly Cameron. Was everyone in your church growing up experiencing psychosis? What exactly is it? Does it go unnoticed in church communities? Lets talk about it on todays episode! I\u0027M SORRY IT\u0027S LATE -Cam Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-09-17T14:00:00Z",
      "duration": "01:07:28",
      "explicit": false,
      "spotifyId": "4osLXB6YjePJUNl7uBbteC",
      "appleId": 1000669829518,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4osLXB6YjePJUNl7uBbteC",
        "apple": "https://podcasts.apple.com/us/podcast/ep-89-was-everyone-in-my-church-experiencing-religious/id1568302029?i=1000669829518"
      }
    },
    {
      "id": "e8ee3c4b-7272-409f-b471-f7c0f09837ec",
      "title": "Ep 88 The Infinite Self: Bubbles, Minds, and the Cosmic Connection",
      "description": "Are we living in a vast interconnected reality, isolated bubbles, or is the universe just a projection of your own consciousness? Tune in as we unravel these philosophical ideas on today\u0027s episode as well as some of our own personal stories. Support the Show.Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-08-29T10:00:00Z",
      "duration": "01:33:03",
      "explicit": false,
      "spotifyId": "1RCilXNVgiO0wuRLU7nuiM",
      "appleId": 1000667069747,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1RCilXNVgiO0wuRLU7nuiM",
        "apple": "https://podcasts.apple.com/us/podcast/ep-88-the-infinite-self-bubbles-minds-and/id1568302029?i=1000667069747"
      }
    },
    {
      "id": "a0beea93-ae98-48ed-8464-299527aaf2cd",
      "title": "Ep 87 White Guy Thinks He\u0027s Japanese After 2 Weeks In Japan",
      "description": "In todays episode we talk about Cameron\u0027s trip to Japan, his observations about the the culture and religion, we talk about their state religion Shintoism, interesting aspects about living in Japan, and how the one girl Cameron met there was(you guessed it) Christian. Join us on this unhinged and enlightening journey as Rachael and Cameron sleepily talk all things Japan.Support the Show.Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-08-15T15:00:00Z",
      "duration": "01:00:12",
      "explicit": false,
      "spotifyId": "3LAs00eVxxiS8rxZUwRmtc",
      "appleId": 1000665472176,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3LAs00eVxxiS8rxZUwRmtc",
        "apple": "https://podcasts.apple.com/us/podcast/ep-87-white-guy-thinks-hes-japanese-after-2-weeks-in-japan/id1568302029?i=1000665472176"
      }
    },
    {
      "id": "e02fcb72-ab9a-404d-b78c-4bb753ecbc35",
      "title": "Ep 86 Persecution, The Paris Olympics, and a Greek God.",
      "description": "In this episode Rachael gives us some life updates, talks about deconstructing as an adult child and trying to still have a relationship with a religious parent, the Paris Olympics opening, the last supper and Greek Bacchanalia - The god of wine. Sometimes I sit around and think, \u0027THIS IS THE BAD PLACE.\u0022The pictures mentioned in the episode will be put up on our Instagram page!Support the Show.Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-08-01T10:00:00Z",
      "duration": "00:46:12",
      "explicit": false,
      "spotifyId": "4dWEiCGIawfnlC8SOSnOP3",
      "appleId": 1000664021899,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4dWEiCGIawfnlC8SOSnOP3",
        "apple": "https://podcasts.apple.com/us/podcast/ep-86-persecution-the-paris-olympics-and-a-greek-god/id1568302029?i=1000664021899"
      }
    },
    {
      "id": "095d3557-34d1-408f-b300-75a6bdd544c8",
      "title": "Ep 85 Are We Alone in the Universe?",
      "description": "In this episode we talk about the belief in Aliens. We dive deep into one of humanity\u0027s most profound questions: Are we alone in the universe? Tune in to hear our guest Alex\u0027s insights on government secrecy, the potential impact of alien contact on humanity, and what the future holds for the search for extraterrestrial intelligence. Whether you\u0027re a skeptic or a believer, this episode promises to challenge your perceptions and ignite your curiosity about the cosmos. Links to what was discussed in the episode below: https://www.pinterest.com/pin/attainablemind-aliens-and-ufos-in-medieval-art--576671927305263071/ https://www.amazon.com/UFO-GOD-Extraordinary-Story-Bledsoe/dp/B0BT6Y6NLP https://v.redd.it/9nnb2xoafob81 Support the Show. Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-07-18T10:00:00Z",
      "duration": "01:36:32",
      "explicit": false,
      "spotifyId": "2UJSkmFqyts0LvQLslqUfA",
      "appleId": 1000662621288,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2UJSkmFqyts0LvQLslqUfA",
        "apple": "https://podcasts.apple.com/us/podcast/ep-85-are-we-alone-in-the-universe/id1568302029?i=1000662621288"
      }
    },
    {
      "id": "016d159b-5835-4783-92d7-25af60a31468",
      "title": "Ep 84 Holy Copycats: Did Christianity Borrow from Zoroastrianism?",
      "description": "Join us on an enlightening journey into one of the world\u0027s oldest monotheistic religions, Zoroastrianism. We will talk about the history, beliefs and ancient texts. We will compare the texts to that of the Bible and discover many similarities between this religion that came before the other modern monotheistic religions we know today. Support the Show.Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-06-20T10:00:00Z",
      "duration": "00:59:02",
      "explicit": false,
      "spotifyId": "61DdoYtAZMRQwymvcjrEYi",
      "appleId": 1000659624139,
      "subjects": [
        "Zoroastrianism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61DdoYtAZMRQwymvcjrEYi",
        "apple": "https://podcasts.apple.com/us/podcast/ep-84-holy-copycats-did-christianity-borrow-from-zoroastrianism/id1568302029?i=1000659624139"
      }
    },
    {
      "id": "01680b8c-15db-432a-abe8-717ddc09c40b",
      "title": "Ep 83 Educatin\u0027 with Satan",
      "description": "Today\u0027s episode might be a mind-blowing topic for those of you who grew up in the evangelical satanic panic. Today we are talking about satanism, and you might be surprised - it has nothing to do with Satan. Our special guest today is Kyra Maddix - Kyria and I connected on TikTok - she has 50k followers and likes to talk about her beliefs surrounding satanism, philosophy, deconstruction with an aim to educate people. Follow Kyria on TikTok @kyramaddix https://linktr.ee/kyramaddix?utm_source=linktree_profile_share\u0026ltsid=242a18df-b8a0-48b7-af26-9ca88b28fb2e Support the Show. Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-06-06T10:00:00Z",
      "duration": "01:14:19.7810000",
      "explicit": false,
      "spotifyId": "43rEorJNVRgeR4OsTwzmay",
      "appleId": 1000658033945,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/43rEorJNVRgeR4OsTwzmay",
        "apple": "https://podcasts.apple.com/podcast/ep-83-educatin-with-satan/id1568302029?i=1000658033945"
      }
    },
    {
      "id": "b111ddac-4b0c-4344-a115-6f7ec501cc05",
      "title": "Ep 81 Unveiling the Gnostic Universe: From Earth as Hell to God as Satan",
      "description": "This week on the pod we are exploring Gnosticism! Don’t know what it is? No problem. Listen as Cameron and Rachael tell you all about this strange forgotten early century Christian belief that other Christians never wanted you to know about. We’ll talk all things history and cosmology of this religion as well as some astrology, vibrations, how tiktok is ending and even Tom Brady! \u0026#x1f399;️ Just2Us! \u0026#x1f604;\u0026#x1f3a7; \u0026#x1f399;️ Just2Us Podcast: Laughter \u0026 Unfiltered... Listen on: Apple Podcasts Spotify Support the Show. Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-05-09T10:00:00Z",
      "duration": "01:03:31.1860000",
      "explicit": false,
      "spotifyId": "2lgdVkLxjybOJ0ImIuN9tc",
      "appleId": 1000655038874,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2lgdVkLxjybOJ0ImIuN9tc",
        "apple": "https://podcasts.apple.com/podcast/ep-81-unveiling-the-gnostic-universe-from-earth-as/id1568302029?i=1000655038874"
      }
    },
    {
      "id": "a02977ff-b645-496f-9326-b073be7cac75",
      "title": "Ep 80 God, Sex \u0026 Rich People: A Pastor\u0027s Kid\u0027s Journey in the Big Apple",
      "description": "TW: Mentions of rape and sexual assault This is the last of our purity culture series. For this last episode we had an amazing conversation with Mattie Jo Cowsert. Before terms like “deconstruction” “purity culture” or “Exvangelical\u0027\u0027 became hashtags all over the internet, Mattie Jo’ popular blog God, Sex \u0026 Rich People exposed the sometimes painful, sometimes hilarious realities of a young female Exvangelical navigating the diversity of Big Apple, working for the 1%, and dating in a city that never sleeps (and never stops sleeping around). This is her story. Mattie Jo\u0027s book will be available September 10th, 2024 on Amazon. Mattie Jo\u0027s website: God, Sex, and Rich People | mattiejo (mattiejocowsert.com) Support the Show. Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-04-25T10:00:00Z",
      "duration": "01:22:45.7990000",
      "explicit": false,
      "spotifyId": "5U9bqwcz76fyINCeb2VuWl",
      "appleId": 1000653564878,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5U9bqwcz76fyINCeb2VuWl",
        "apple": "https://podcasts.apple.com/podcast/ep-80-god-sex-rich-people-a-pastors-kids-journey-in/id1568302029?i=1000653564878"
      }
    },
    {
      "id": "53a8e372-6098-4d08-828f-8c7f8dd744d7",
      "title": "Ep 79 Devastating Sex and the Aftermath of Purity Culture",
      "description": "The word/theme for this episode is devastating. In this episode we discuss sex expectations in purity culture, relationships, relationships during and after deconstructing, late-stage adolescence, sex therapy and much more. Our special guests today are Julia Postema and Jeremiah Gibson! They are the co-hosts of the podcast Sexvangelicals: The Sex Education the Church Didn\u0027t Want You to Have. They are both Boston-based licensed psychotherapists and certified sex therapists who work with clients in Massachusetts. They currently live in Utrecht, The Netherlands. They specialize in helping couples with negative religious backgrounds discover sexuality that works for their partnership. Follow: Jeremiah and Julia (@sexvangelicals) • Instagram photos and videos Website: Sexvangelicals Leadership Lessons From The Great Books Reading great literature is better than trying to read and understand... Listen on: Apple Podcasts Spotify Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-04-11T10:00:00Z",
      "duration": "01:10:31.9670000",
      "explicit": false,
      "spotifyId": "5LhyldtgJBkrIO9p6pTyff",
      "appleId": 1000652129479,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5LhyldtgJBkrIO9p6pTyff",
        "apple": "https://podcasts.apple.com/podcast/ep-79-devastating-sex-and-the-aftermath-of-purity-culture/id1568302029?i=1000652129479"
      }
    },
    {
      "id": "5d133743-f6fc-4a30-ab06-b3754533602e",
      "title": "Ep 78 True Love Waits",
      "description": "This is one of the few episodes we will be releasing over the next few weeks regarding purity culture. If you\u0027ve been listening to us for a while, you know purity culture is something that often comes up in our episodes and I wanted to do a mini-series focusing on it. Here to discuss their own journey with purity culture, we have Canadian queer alt-pop artist Adaline, who just released a purity culture inspired single \u0022True Love Waits\u0022, the third single from upcoming EP \u0022Hymnal\u0022 (out March 22), that follows her journey of reconciling queerness and the harmful religious narratives she experienced growing up as the daughter of an evangelical minister. To learn more about Adaline and hear her music visit: Adaline (adalinemusic.com) Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-03-28T10:00:00Z",
      "duration": "01:24:35.8000000",
      "explicit": false,
      "spotifyId": "1ufQr8kTyHLVUdDH8pMOLY",
      "appleId": 1000650717036,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ufQr8kTyHLVUdDH8pMOLY",
        "apple": "https://podcasts.apple.com/podcast/ep-78-true-love-waits/id1568302029?i=1000650717036"
      }
    },
    {
      "id": "ed717812-6eaa-42df-afd5-bc546fe6748d",
      "title": "Ep 77 Insulting Squirrels and Pagan Deities",
      "description": "Our first episode back after the break and we are diving right in! Join our hosts as we journey into the depths of archetypal paganism. What does a cheeky squirrel, Marvel movies, and the trinity have in common? This episode! If you wanna know what the heck we\u0027re talking about, click play! Grab your cloak and staff, and join us as we raise a toast to the ancient wisdom of archetypal paganism. Support the show Facebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-03-14T10:00:00Z",
      "duration": "01:23:46.6640000",
      "explicit": false,
      "spotifyId": "3rS7ExMt3zHZwI06UUQvno",
      "appleId": 1000649178374,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rS7ExMt3zHZwI06UUQvno",
        "apple": "https://podcasts.apple.com/podcast/ep-77-insulting-squirrels-and-pagan-deities/id1568302029?i=1000649178374"
      }
    },
    {
      "id": "82332acb-fd4b-4698-9f84-3e2ad55758e6",
      "title": "Hiatus Ep Born Sinful (with Phil Drysdale)",
      "description": "On our hiatus episode today we\u0027re going to explore original sin. Oh yeah, shes a doozy. But dont worry, we have an amazing guest here to walk us through the mess of being born sinful.Phil Drysdale is a companion to those going through the painful process of deconstruction. He conducts research on those who deconstruct, has various free resources, including his podcast and offers a safe space for people to anonymously explore their deconstruction. You can reach out to Phil on Instagram with a DM!Phil Drysdale (@phildrysdale) • Instagram photos and videosPhil Drysdale - YouTubeSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-02-01T19:00:00Z",
      "duration": "01:03:02.7130000",
      "explicit": false,
      "spotifyId": "7DyMUuLDrYL3Gebcnahu9r",
      "appleId": 1000643850197,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7DyMUuLDrYL3Gebcnahu9r",
        "apple": "https://podcasts.apple.com/podcast/hiatus-ep-born-sinful-with-phil-drysdale/id1568302029?i=1000643850197"
      }
    },
    {
      "id": "21070e9a-e7d4-4429-ba98-e7923a487711",
      "title": "Hiatus Ep Purity Culture, Non Denominational Churches, and Porn, Oh My! (With Deconversion Therapy)",
      "description": "For this Hiatus episode we must go in the way way back machine to 2021 where Rachael Collaborates with the Deconversion Therapy pod! We talk about our individual stories, purity culture, being \u0027good\u0027, non denominational church\u0027s as well as porn and masturbation! You know, all the good stuff. To find out more about Deconversion Therapy: https://www.deconversiontherapypodcast.com/Heavens Gates and Hells Flames video: https://www.youtube.com/watch?v=njG9P0JvzyIFull Porn post on the blog! https://cheerstoleaving.wordpress.com/Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-01-18T14:00:00Z",
      "duration": "01:34:59.6040000",
      "explicit": false,
      "spotifyId": "4cesDdEVO95MaJMYroPydD",
      "appleId": 1000642104021,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cesDdEVO95MaJMYroPydD",
        "apple": "https://podcasts.apple.com/podcast/hiatus-ep-purity-culture-non-denominational-churches/id1568302029?i=1000642104021"
      }
    },
    {
      "id": "39c0da25-81c4-41b9-9b06-501bc7585afd",
      "title": "Hiatus Ep Christian Weddings (Thanks, We Hate It)",
      "description": "Bringing back a fan favorite while we\u0027re on hiatus! In this flashback episode from 2022, Molly and Rachael discuss cringey memories from christian weddings you just cant get out of your head. We talk about our cringe stories we remember, and our listeners tell us theirs! You might wanna grab a drink for this one.Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2024-01-04T16:00:00Z",
      "duration": "01:11:54.0440000",
      "explicit": false,
      "spotifyId": "4XsMARN3rq3hTo5PZ6zZ64",
      "appleId": 1000640556616,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4XsMARN3rq3hTo5PZ6zZ64",
        "apple": "https://podcasts.apple.com/podcast/hiatus-ep-christian-weddings-thanks-we-hate-it/id1568302029?i=1000640556616"
      }
    },
    {
      "id": "29e4c53d-8a21-4783-9763-84dac627c753",
      "title": "Ep 76 Cheers to Another Year!",
      "description": "Exvangelicals and Heathens, welcome back to another episode of \u0027Cheers to Leaving\u0027! Our final episode of the year! In this episode we share a brief recap of the podcast\u0027s theme and the topics covered throughout the season. We reflect on the journey we have taken as well as our listeners have taken, highlighting key moments, insights, and lessons learned. We share listener stories: Feature messages, emails, from listeners who have shared their own stories of leaving, transformation, and growth. And we have a special announcement at the end so make sure you listen all the way!Happy Holidays and we\u0027ll see you next year! xoxoSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-12-21T14:00:00Z",
      "duration": "01:38:08.2350000",
      "explicit": false,
      "spotifyId": "2rBGuvjy6uykUTgCQP7P2Y",
      "appleId": 1000639343511,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rBGuvjy6uykUTgCQP7P2Y",
        "apple": "https://podcasts.apple.com/podcast/ep-76-cheers-to-another-year/id1568302029?i=1000639343511"
      }
    },
    {
      "id": "84bd73a9-b935-4b52-a098-e65661dfb953",
      "title": "Ep 75 I Am a Walking Sin (with The Burning Eden Podcast)",
      "description": "Releasing a collaboration we did with the Burning Eden podcast 3 months ago when they had us on their show. We cover our individual stories, talk theology, sex ed, and much more. We had so much fun with Baph and Mel! Go check them out.  To watch the video see below: (94) Baph and Mel Say Cheers to Leaving! - YouTubeCheck them out: The Burning Eden Podcast: With Baph and Mel • A podcast on Spotify for PodcastersSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-12-07T11:00:00Z",
      "duration": "01:17:30.9710000",
      "explicit": false,
      "spotifyId": "20mw5eeeW9xBkFE7GyBDtn",
      "appleId": 1000637798220,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20mw5eeeW9xBkFE7GyBDtn",
        "apple": "https://podcasts.apple.com/podcast/ep-75-i-am-a-walking-sin-with-the-burning-eden-podcast/id1568302029?i=1000637798220"
      }
    },
    {
      "id": "cf8e3638-3724-499e-910f-e804704739f9",
      "title": "Ep 74 Jezebel Spirit",
      "description": "We\u0027ve all heard the term \u0027Jezebel spirit.\u0027 Well today we are diving into the biblical story of Jezebel and what that term actually means. Jezebel Spirit: Refers to a perceived spiritual force or attitude characterized by manipulation, control, and a rebellious nature, often associated with the biblical figure Queen Jezebel. - basically, she was just a baddie before her time and we are HERE for it. Lets dissect and reckon with what being a jezebel actually means.Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-11-23T11:00:00Z",
      "duration": "01:07:48.6230000",
      "explicit": false,
      "spotifyId": "6pYXrSvP9K8qk5VmF5PDfU",
      "appleId": 1000635786129,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6pYXrSvP9K8qk5VmF5PDfU",
        "apple": "https://podcasts.apple.com/podcast/ep-74-jezebel-spirit/id1568302029?i=1000635786129"
      }
    },
    {
      "id": "8da25ea3-4e96-41b2-844c-71736ec9dff7",
      "title": "Ep 73 See You On the Other Side",
      "description": "Join us for an enlightening episode of Cheers to Leaving with See You on the Side! We talk with Leah and Christine and delve deep into the world of psychedelics and their incredible potential for healing and personal transformation. In this thought-provoking discussion our two passionate and informed guests share their personal experiences and insights. Discover the profound ways in which psychedelics can aid in healing, both mentally and emotionally. Tune in to gain a fresh perspective on the role of psychedelics in modern healing and personal growth. It\u0027s an eye-opening episode that will leave you with a deeper appreciation for the profound journeys that can be embarked upon with the assistance of these remarkable substances.  See You On The Other Side | Instagram, TikTok | LinktreeSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-11-09T11:00:00Z",
      "duration": "01:47:45.2270000",
      "explicit": false,
      "spotifyId": "7nMakwMbl8eYEQziHFOMzw",
      "appleId": 1000634249784,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7nMakwMbl8eYEQziHFOMzw",
        "apple": "https://podcasts.apple.com/podcast/ep-73-see-you-on-the-other-side/id1568302029?i=1000634249784"
      }
    },
    {
      "id": "7b2d0b46-b30d-42ee-ad85-1b6b79596e41",
      "title": "Ep 72 Grease Up These Nations for Christ (with Jonathan Logerstedt)",
      "description": "Were you a missionary kid? Want to learn some missionary lingo?  Then this episode is for you. We go down rabbit trails including but not limited to, group edging (you heard me), comedians we like and don\u0027t like, church porn/masturbation accountability groups and much more. Jonathan is a graphic designer by day and stand-up comedian by night. The son of Southern Baptist missionaries, he was born and grew up in West Africa for the first 18 years of his life. And yes, he has seen Mean Girls. As both a designer and a stand-up, Jonathan is passionate about the art of communication, whether it’s sharing his background in the evangelical world, his journey away from it, or how he’s learning to make meaning today.Follow Jonathan on IG and Threads: @jonlogzSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-10-26T10:00:00Z",
      "duration": "01:45:22.1550000",
      "explicit": false,
      "spotifyId": "1DYrcBRdY8FbAI18PH82IP",
      "appleId": 1000632684103,
      "subjects": [
        "Evangelicalism",
        "Southern Baptist Convention"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DYrcBRdY8FbAI18PH82IP",
        "apple": "https://podcasts.apple.com/podcast/ep-72-grease-up-these-nations-for-christ-with-jonathan/id1568302029?i=1000632684103"
      }
    },
    {
      "id": "544e61b7-262d-46c4-90b7-6749807fdbc7",
      "title": "Ep 71 Noah\u0027s Ark-pocalypse",
      "description": "Welcome babies! In this episode we discuss our favorite genocide story! Did you know Noah\u0027s ark isn\u0027t only in the Bible and actually appears in history EARLIER than the Bible but slightly different? We discuss that and more in this episode! Lets dive in and talk about that one-time God swiped right on the flood and murdered everyone. Cheers! Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-10-12T10:00:00Z",
      "duration": "01:13:01.4660000",
      "explicit": false,
      "spotifyId": "4KvJLx2kuSsYPdnmZzhIIz",
      "appleId": 1000631073642,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4KvJLx2kuSsYPdnmZzhIIz",
        "apple": "https://podcasts.apple.com/podcast/ep-71-noahs-ark-pocalypse/id1568302029?i=1000631073642"
      }
    },
    {
      "id": "09b651f9-b19a-4741-befc-044b714d359d",
      "title": "(Bonus Ep) Sound of Freedom Deep Dive with Cynane Shay",
      "description": "TW: Sex trafficking Sound of freedom hit theaters July 4th and it is an independent action film directed by Alejandro Monteverde. The story is about Tim Ballard. He is a former Department of Homeland Security agent and the founder and former CEO of Operation Underground Railroad (O.U.R.) an anti-sex trafficking organization. Sound of freedom tells Tim Ballard\u0027s story of his Operation Triple Take, a joint action between OUR and the Colombian government that reportedly rescued 123 trafficked people—55 of whom were children. So why are we talking about this? Sounds like a good story, right?Well Ballard is not all he\u0027s cracked up to be. Ballard and OUR aren’t actually central to the international fight against human trafficking. The majority of the [anti-trafficking] field views them as fringe. They’re on the outs of this genre. They like to sell sensationalism…and they fundraise off it. Because Christians love that shit.Cynane and I discuss the new Sound of Freedom movie, Qanon, Jim Caviezel, Tim Ballard, OUR organization, sex trafficking, and much more. Articles/videos mentioned in the episode: https://www.youtube.com/watch?v=Yge8O1qaXDIhttps://www.youtube.com/watch?v=7eHI0FDqbschttps://www.vanityfair.com/hollywood/2023/07/sound-of-freedom-child-trafficking-moviePodcast episode mentioned: https://podcasts.apple.com/us/podcast/qanon-anonymous/id1428209307?i=1000625722818https://podcasts.apple.com/us/podcast/qanon-anonymous/id1428209307?i=1000522267818Follow Cynane:Instagram: @Taking.Off.The.Tinfoil.HatWebsite: TakingOffTheTinfoilHat.comSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-09-25T10:00:00Z",
      "duration": "01:28:32.6000000",
      "explicit": false,
      "spotifyId": "6Q74WnlzLgWeJDWxAI7GVv",
      "appleId": 1000629058092,
      "subjects": [
        "Evangelicalism",
        "Human Trafficking",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Q74WnlzLgWeJDWxAI7GVv",
        "apple": "https://podcasts.apple.com/podcast/bonus-ep-sound-of-freedom-deep-dive-with-cynane-shay/id1568302029?i=1000629058092"
      }
    },
    {
      "id": "8428385c-53a6-4df5-9217-56c028fff8b8",
      "title": "Ep 68 Befriending Your Inner Critic with Catherine Quiring",
      "description": "Join us today as we learn how to trust ourselves, live in our bodies, find our voice, use our emotions as clues, befriend inner critics, and interact with ourselves with compassion. No easy task but if you know us, you know we love a good challenge. Thankfully we have Catherine here to help us.Catherine Quiring is a Licensed Mental Health Counselor, and Self-Trust Coach.  She helps exvangelicals learn to trust their desires and reconnect to their inner wisdom.  She also helps people-pleasers learn to trust themselves and recenter themselves at the helm of their lives. The book Catherine mentioned is called Freedom from your Inner Critic by Jay Early and Bonnie Weiss.Free Masterclass about learning to trust yourself: Learn to Trust Yourself Masterclass (ck.page)Befriending Your Inner Critic Course:https://catherine-quiring.mykajabi.com/offers/5hBDzLXtWebsite: www.cqcounseling.comInstagram: @catherinequiring (https://www.instagram.com/catherinequiring/)Facebook: @cqcounseling (https://www.facebook.com/cqcounseling/)YouTube:  @catherinequiring (https://www.youtube.com/channel/UCaInnZ9JUbQ6CLyOTLqwdjw)LinkedIn: https://www.linkedin.com/in/catherine-quiring/Spotify playlist of podcast guesting: https://open.spotify.com/playlist/6IfvPWdsLK3iGynhjCu4I7Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-09-14T10:00:00Z",
      "duration": "01:42:44.1660000",
      "explicit": false,
      "spotifyId": "2NIF6AhIboUL61hEP2957r",
      "appleId": 1000627846016,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NIF6AhIboUL61hEP2957r",
        "apple": "https://podcasts.apple.com/podcast/ep-68-befriending-your-inner-critic-with-catherine-quiring/id1568302029?i=1000627846016"
      }
    },
    {
      "id": "35a055a9-fef3-4216-ac5a-2ae26b66a77d",
      "title": "Ep 67 Spiritual Orgasms with Feet of Clay - Confessions of Cult Sisters",
      "description": "Where to begin! Welcome to another episode of our Bi-weekly Chronicles. We are joined in this episode with Sharon and Tracey from Feet of Clay – Confessions of the Cult Sisters podcast!  If you don\u0027t know about Tracey \u0026 Sharon, they used to be in Last Days Ministries, led by Christian music super-star Keith Green. In this episode we really get to know Sharon and Tracey, we laugh, we get really serious, we talk Keith Greens music (obvs), Sharon has us listen to her WAP rendition, we discuss the kink side of the spiritual orgasms, and Rocky Horror Picture Show! Its a grand ole time. Listen to Part 2 here: https://feetofclayconfessionsofthecultsisters.buzzsprout.com/2078827/13406347-022-cheers-to-leaving-with-rachael-molly-crossover-part-2TikTok video referenced in episode: https://www.tiktok.com/@lornemalvo665/video/7246334603688938779Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-08-31T10:00:00Z",
      "duration": "01:38:09.9060000",
      "explicit": false,
      "spotifyId": "4RPVJ5zVHyPDgd52TH7kMo",
      "appleId": 1000626311647,
      "subjects": [
        "Evangelicalism",
        "Last Days Ministries"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4RPVJ5zVHyPDgd52TH7kMo",
        "apple": "https://podcasts.apple.com/podcast/ep-67-spiritual-orgasms-with-feet-of-clay/id1568302029?i=1000626311647"
      }
    },
    {
      "id": "52c5849e-579b-4f30-9c7f-a3dc248163dd",
      "title": "Ep 66 From Fundamentalism to Priesthood: The Transformative Power of Story with Shannon TL Kearns (Part 2)",
      "description": "We are jumping right back into this episode and continuing our conversation with Shannon TL Kearns, a former fundamentalist who became the first openly transgender man ordained to the Old Catholic priesthood. If you have not listened to Ep 65 with Shannon you may want to do that before listening to this weeks episode. We discuss trans issues, trans theology and Christianity. We also discuss how people can be in better solidarity with trans folks today and what listening to trans folks might open up for people who aren\u0027t trans.Shannon believes in the transformative power of story. As an ordained priest, a playwright, a theologian, and a writer all of his work revolves around making meaning through story. He is the co-founder of QueerTheology.com. His first book In the Margins: A Transgender Man’s Journey With Scripture just released from Eerdmaan’s books. He started and led Uprising Theatre Company for 6 years.http://www.shannontlkearns.com/Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-08-17T10:00:00Z",
      "duration": "01:02:08.6660000",
      "explicit": false,
      "spotifyId": "6IHI6HLZQw9nPb1LBNPZFi",
      "appleId": 1000624750961,
      "subjects": [
        "Catholicism",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6IHI6HLZQw9nPb1LBNPZFi",
        "apple": "https://podcasts.apple.com/podcast/ep-66-from-fundamentalism-to-priesthood-the/id1568302029?i=1000624750961"
      }
    },
    {
      "id": "b49f9399-8ef1-4a12-aba5-74153a2e3946",
      "title": "Ep 65 From Fundamentalism to Priesthood: The Transformative Power of Story with Shannon TL Kearns (Part 1)",
      "description": "In this compelling episode, we sit down with Shannon TL Kearns, a former fundamentalist who became the first openly transgender man ordained to the Old Catholic priesthood. We discuss trans issues, trans theology and Christianity. We also discuss how people can be in better solidarity with trans folks today and what listening to trans folks might open up for people who aren\u0027t trans.Shannon believes in the transformative power of story. As an ordained priest, a playwright, a theologian, and a writer all of his work revolves around making meaning through story. He is the co-founder of QueerTheology.com. His first book In the Margins: A Transgender Man’s Journey With Scripture just released from Eerdmaan’s books. He started and led Uprising Theatre Company for 6 years. http://www.shannontlkearns.com/Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-08-03T10:00:00Z",
      "duration": "01:03:03.0260000",
      "explicit": false,
      "spotifyId": "6vXTXP3DKy1xqJNGpkMRkQ",
      "appleId": 1000623298940,
      "subjects": [
        "Catholicism",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6vXTXP3DKy1xqJNGpkMRkQ",
        "apple": "https://podcasts.apple.com/podcast/ep-65-from-fundamentalism-to-priesthood-the/id1568302029?i=1000623298940"
      }
    },
    {
      "id": "cf145cd8-f82c-4141-a129-7fb698faf88c",
      "title": "Ep 64 Jaded - with Marla Taviano",
      "description": "Join us in this thought-provoking episode with Marla Taviano, a woman who wears her heart on her t-shirts, embraces a colorful world of love and justice, and finds solace in the beauty of poetry. Her journey of becoming a heretic and reckoning with her past is an inspiration to us all!  Marla Taviano – a woman of many passions and a love for words that transcend boundaries. From books to love, justice to globes, and anti-racism to blue, gray, rainbows, and poems, Marla\u0027s journey through life has been nothing short of inspiring. As an author and an advocate, she embraces her authentic self, wearing her heart on her t-shirts, and is on a mission to live wholefarted (not a typo). Join us as we explore her fascinating world and delve into the depths of her soul through her powerful writings and unique perspectives.Find out more at marlataviano.comhttps://itsmemarla.com/Other social media:Twitter: @marlatavianoIG: @marlataviano and @whitegirllearningSubstack: marlataviano.substack.comSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-07-20T09:00:00Z",
      "duration": "01:09:01.6620000",
      "explicit": false,
      "spotifyId": "5An33nY74Ri2MtMyMdYtcf",
      "appleId": 1000621740570,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5An33nY74Ri2MtMyMdYtcf",
        "apple": "https://podcasts.apple.com/podcast/ep-64-jaded-with-marla-taviano/id1568302029?i=1000621740570"
      }
    },
    {
      "id": "4e04835f-1641-4e11-aa67-6d08f186c31a",
      "title": "Ep 63 We Made Our Own Vacation Bible School",
      "description": "It\u0027s exactly what you think it is! Welcome past trauma and past cringe VBS themes that give you the ick. Join us as we indulge in past memories of bible stories, skits, hand motions, and songs untold. We will dive into the weird ass snacks and more that made up our childhood. Prepare to cringe and embrace the Vacation Bible School stories. Lets dive in!Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-07-06T09:00:00Z",
      "duration": "01:08:16.0510000",
      "explicit": false,
      "spotifyId": "6k6rmOKw0IT8N21wpJJpVh",
      "appleId": 1000619520974,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6k6rmOKw0IT8N21wpJJpVh",
        "apple": "https://podcasts.apple.com/podcast/ep-63-we-made-our-own-vacation-bible-school/id1568302029?i=1000619520974"
      }
    },
    {
      "id": "71dbc65e-da12-4b72-a686-93ed6b38a406",
      "title": "Ep 62 Trauma Doesn\u0027t Live in Our Minds (with Dr. Laura Anderson) Part 2",
      "description": "Our guest today is Dr Laura Anderson here to share her EXtimony - shes founder of the Center for Trauma Resolution and Recovery. She has a Doctorate of Philosophy (PhD) in Mind-Body Medicine, Master of Arts in Marriage and Family Therapy, is certified in Somatic Experiencing, and is a Certified Complex Trauma Professional. We ask her listener questions and talk about BODY response to religious trauma.This episode is PART 2 of a conversation we started last week. Please go back and listen to that episode before starting this one. Dr. Laura AndersonInstagram: @drlauraeandersonTikTok: @drlauraeandersonWebsite: www.drlauraeanderson.comBook: www.drlauraeanderson.com/book or https://a.co/d/9vdcRPvCenter for Trauma Resolution and RecoveryOnline trauma coaching for individuals desiring to resolve and recover from religious trauma, adverse religious experiences, purity culture, cults, dynamics of power and control, and spiritual abuse. We also have group coaching options as well as other resources that are being developed (courses, seminars, workbooks, podcasts, etc.)Instagram: @traumaresolutionandrecoveryWebsite: www.traumaresolutionandrecovery.comSupport the showSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-06-22T09:00:00Z",
      "duration": "00:52:09.4950000",
      "explicit": false,
      "spotifyId": "72G5TGWEj8LxVvcTXM7d6T",
      "appleId": 1000617949886,
      "subjects": [
        "Evangelicalism",
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/72G5TGWEj8LxVvcTXM7d6T",
        "apple": "https://podcasts.apple.com/podcast/ep-62-trauma-doesnt-live-in-our-minds-with-dr-laura/id1568302029?i=1000617949886"
      }
    },
    {
      "id": "1323690f-78ef-4607-912b-c43b251d79d3",
      "title": "Ep 61 Trauma Doesn\u0027t Live in Our Minds (with Dr. Laura Anderson) Part 1",
      "description": "Our guest today is Dr Laura Anderson here to share her EXtimony - shes founder of the Center for Trauma Resolution and Recovery. She has a Doctorate of Philosophy (PhD) in Mind-Body Medicine, Master of Arts in Marriage and Family Therapy, is certified in Somatic Experiencing, and is a Certified Complex Trauma Professional. We ask her listener questions and talk about BODY response to religious trauma. Dr. Laura AndersonInstagram: @drlauraeandersonTikTok: @drlauraeandersonWebsite: www.drlauraeanderson.comBook: www.drlauraeanderson.com/book or https://a.co/d/9vdcRPvCenter for Trauma Resolution and RecoveryOnline trauma coaching for individuals desiring to resolve and recover from religious trauma, adverse religious experiences, purity culture, cults, dynamics of power and control, and spiritual abuse. We also have group coaching options as well as other resources that are being developed (courses, seminars, workbooks, podcasts, etc.)Instagram: @traumaresolutionandrecoveryWebsite: www.traumaresolutionandrecovery.comSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-06-08T09:00:00Z",
      "duration": "01:08:29.6880000",
      "explicit": false,
      "spotifyId": "3c0SCMD1zwFuZekT7rwAeT",
      "appleId": 1000616123310,
      "subjects": [
        "Evangelicalism",
        "Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3c0SCMD1zwFuZekT7rwAeT",
        "apple": "https://podcasts.apple.com/podcast/ep-61-trauma-doesnt-live-in-our-minds-with-dr-laura/id1568302029?i=1000616123310"
      }
    },
    {
      "id": "7575986f-91cf-4169-8a84-fa7e2054f85f",
      "title": "Ep 60 The Hidden Realty of Christian Fundamentalism Part 2 (with Tia Levings)",
      "description": "You will likely recognize our guest today from her social media reels on Instagram speaking out about Christian fundamentalisms hidden realities. If not, go check them out they are great! Today\u0027s topics we cover Christian fundamentalism and how its seeping into our politics! They have a hidden agenda and yeah it sounds crazy but so does reality. I mean we\u0027re literally on a giant rotating rock floating in space so like do the math. This is part 2 of our episode that dropped on May 11th so please check that out for some back story on Tia before listening to this one. See Tia in \u0027Shiny Happy People\u0027 on Amazon Prime on June 2nd. Follow her, support her, order her book-shes a legend! Tia Levings shares the realities of what it’s like to live in Christian fundamentalism on social media.Her work seeks out the missing female perspective in patriarchal spaces and supports the survivors of religious trauma. She will appear in the 2023 Amazon docuseries on the Institute of Basic Life Principles and her memoir,A Well-Trained Wife, will be released in 2024 (St. Martin’s Press).Learn more at TiaLevings.com@tialevingswriter on Instagram, Facebook, Twitter, TikTok and YouTube Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-05-25T09:00:00Z",
      "duration": "00:58:53.1650000",
      "explicit": false,
      "spotifyId": "7nHBpv1adKsqsLcPmkhSNn",
      "appleId": 1000614442823,
      "subjects": [
        "Evangelicalism",
        "Institute In Basic Life Principles",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7nHBpv1adKsqsLcPmkhSNn",
        "apple": "https://podcasts.apple.com/podcast/ep-60-the-hidden-realty-of-christian-fundamentalism/id1568302029?i=1000614442823"
      }
    },
    {
      "id": "78d07114-5b00-48ca-bd57-82ff83f2f2be",
      "title": "Ep 59 The Hidden Reality of Christian Fundamentalism Part 1 (with Tia Levings)",
      "description": "You will likely recognize our guest today from her social media reels on Instagram speaking out about Christian fundamentalisms hidden realities. If not, go check them out they are great! Today\u0027s topics we cover high control marriage and high control religion, and handmaid\u0027s tale shit. There is some content that will be triggering for some listeners (marital rape, infant discipline and death, violence) please be advised before listening to this episode. Tia Levings shares the realities of what it’s like to live in Christian fundamentalism on social media.Her work seeks out the missing female perspective in patriarchal spaces and supports the survivors of religious trauma. She will appear in the 2023 Amazon docuseries on the Institute of Basic Life Principles and her memoir,A Well-Trained Wife, will be released in 2024 (St. Martin’s Press).Learn more at TiaLevings.com@tialevingswriter on Instagram, Facebook, Twitter, TikTok and YouTube Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-05-11T09:00:00Z",
      "duration": "01:02:26.7420000",
      "explicit": false,
      "spotifyId": "4u4Ax2EWyfdvreX6X442to",
      "appleId": 1000612606324,
      "subjects": [
        "Evangelicalism",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4u4Ax2EWyfdvreX6X442to",
        "apple": "https://podcasts.apple.com/podcast/ep-59-the-hidden-reality-of-christian/id1568302029?i=1000612606324"
      }
    },
    {
      "id": "0a9eba48-4349-4c81-842d-75d6de0a70f2",
      "title": "Ep 58 IndoctriNation with Rachel Bernstein",
      "description": "Ya\u0027ll ready to get real culty? Of course you are! You may recognize our guest from the Starz documentary Seduced: Inside the Nexium cult, or the Netflix series Unwell. She\u0027s also made many media appearances over the years as a cult expert on CNN, MSNBC, BBC, NPR, Bloomberg, and many other news outlets. When you\u0027re finished with this episode, you\u0027ll be thinking EVERYTHING IS A CULT. Here is our super special crossover episode with IndoctriNation podcast. You can go on over to her podcast and listen to our episode that dropped on April 19th.  Rachel Bernstein is a Licensed Marriage and Family Therapist from Los Angeles, California who has specialized in cult intervention and re-acclimation for over 30 years. Rachel Bernstein is also the host of IndoctriNATION: A weekly podcast covering cults, manipulators, and protecting yourself from systems of control where she has interviewed hundreds of cult survivors, journalists, and experts. Her webinar lecture for cult survivors entitled \u0022Living In Freedom\u0022 is available at Rachelbernsteintherapy.comPodcast: https://linktr.ee/indoctrinationWebsite: https://rachelbernsteintherapy.comBook: https://www.amazon.com/Now-I-Know-Rachel-Bernstein/dp/1620867893Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-04-27T09:00:00Z",
      "duration": "01:07:11.8430000",
      "explicit": false,
      "spotifyId": "3jg5EQb5P8Nyl3SZgblROk",
      "appleId": 1000610842060,
      "subjects": [
        "Evangelicalism",
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3jg5EQb5P8Nyl3SZgblROk",
        "apple": "https://podcasts.apple.com/podcast/ep-58-indoctrination-with-rachel-bernstein/id1568302029?i=1000610842060"
      }
    },
    {
      "id": "f1549283-290e-4fff-8b39-8226fa3556a5",
      "title": "Ep 57 RachaelTales",
      "description": "The moment you\u0027ve all been waiting for...Rachaels dark past, REVEALED. In this episode Rachael talks about her journey from teen fundamentalist, lack of sex ed and direction, being thrown into motherhood, and on and off again of an abusive Christian boyfriend/baby daddy. Molly comes in at the end to save the day with some grounding exercises we all need after this, and we talk about the importance of grounding ourselves, and how to help someone in an abusive relationship. Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-04-13T11:00:00Z",
      "duration": "01:59:37.5600000",
      "explicit": false,
      "spotifyId": "0GcjNh50u3hwphbmczZDwt",
      "appleId": 1000608781084,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0GcjNh50u3hwphbmczZDwt",
        "apple": "https://podcasts.apple.com/podcast/ep-57-rachaeltales/id1568302029?i=1000608781084"
      }
    },
    {
      "id": "400e0466-5701-4894-8df9-0a1125d36895",
      "title": "Ep 56 Taking Off the Tin Foil Hat (Part 2)",
      "description": "Today we are continuing our conversation with Cynane Shay. If you haven\u0027t had the chance to listen to part 1 (ep 55) we highly recommend it as we are picking up right where we left off. Cynane has a bachelor\u0027s degree in nuclear engineering from the University of Florida. Now 30, she is a civilian contractor in the United States Navy\u0027s Nuclear Propulsion Training Program. Think Kelly McGillis from Top Gun, but with submarines instead of fighter jets.Growing up, conspiracy theories were normalized in her IBLP-cult influenced community. But 2020, with COVID, Trump, and Qanon, forced her to realize this was a broader evangelical problem that affected more than just her rapture-obsessed family.Since then, Cynane has followed her friends and family down the rabbit hole, deconstructed from white Christian nationalism, and tried to document the process in her upcoming memoir: Taking Off the Tinfoil Hat: How Space Lasers and Lizard People Dismantled my Christian Worldview.To follow Cynane and learn more about her book:Instagram: @Taking.Off.The.Tinfoil.HatWebsite: TakingOffTheTinfoilHat.comSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-03-30T09:00:00Z",
      "duration": "01:02:14.1770000",
      "explicit": false,
      "spotifyId": "1LePs4IiIxZAOn8lc7bh3X",
      "appleId": 1000606569629,
      "subjects": [
        "Institute In Basic Life Principles",
        "Evangelicalism",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1LePs4IiIxZAOn8lc7bh3X",
        "apple": "https://podcasts.apple.com/podcast/ep-56-taking-off-the-tin-foil-hat-part-2/id1568302029?i=1000606569629"
      }
    },
    {
      "id": "54bb9026-3cf4-4877-a652-2696f8c208ae",
      "title": "Ep 55 Taking Off the Tin Foil Hat (Part 1)",
      "description": "We have a special guest today. Cynane Shay is here to talk about her book \u0027Taking off the Tin Foil Hat.\u0027 A book about her deconstruction and the conspiracy\u0027s surrounding covid that started it all. How much do you know about Lizard People? The Flat Earth? The impending resurrection of John F. Kennedy? Well buckle up, you\u0027re about to be an expert.(Rachael takes a brief moment to tell us about her haunted house, so apparently we are a ghost podcast now)Cynane has a bachelor\u0027s degree in nuclear engineering from the University of Florida. Now 30, she is a civilian contractor in the United States Navy\u0027s Nuclear Propulsion Training Program. Think Kelly McGillis from Top Gun, but with submarines instead of fighter jets.Growing up, conspiracy theories were normalized in her IBLP-cult influenced community. But 2020, with COVID, Trump, and Qanon, forced her to realize this was a broader evangelical problem that affected more than just her rapture-obsessed family.Since then, Cynane has followed her friends and family down the rabbit hole, deconstructed from white Christian nationalism, and tried to document the process in her upcoming memoir: Taking Off the Tinfoil Hat: How Space Lasers and Lizard People Dismantled my Christian Worldview.To follow Cynane and learn more about her book:Instagram: @Taking.Off.The.Tinfoil.HatWebsite: TakingOffTheTinfoilHat.comAd:Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-03-16T12:00:00Z",
      "duration": "01:14:58.0760000",
      "explicit": false,
      "spotifyId": "3icpu98vxN5n9hnKHWVI27",
      "appleId": 1000604485571,
      "subjects": [
        "Institute In Basic Life Principles",
        "Evangelicalism",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3icpu98vxN5n9hnKHWVI27",
        "apple": "https://podcasts.apple.com/podcast/ep-55-taking-off-the-tin-foil-hat-part-1/id1568302029?i=1000604485571"
      }
    },
    {
      "id": "3d57e458-902b-4ae1-855f-c438260704d2",
      "title": "Ep 54 Asbury Revival",
      "description": "Molly and Rachael talk about global warning(not a typo), the Ohio incident, how Molly wants a homestead and most importantly what happened at the Asbury revival and of course, share their opinions on it.  Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2023-03-02T10:00:00Z",
      "duration": "01:13:21.6320000",
      "explicit": false,
      "spotifyId": "5rgc5HIMvvsPAfohqNMrKK",
      "appleId": 1000602454429,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rgc5HIMvvsPAfohqNMrKK",
        "apple": "https://podcasts.apple.com/podcast/ep-54-asbury-revival/id1568302029?i=1000602454429"
      }
    },
    {
      "id": "33e99373-501a-4b5b-983d-84d29da26059",
      "title": "Ep 53 - A Year of Growth",
      "description": "Our last episode of 2022. Molly and I recap our episodes this year, the guests we had, the growth we\u0027ve seen in ourselves and the podcast. We are taking a little break in the new year but we will be back on MARCH 3RD 2023! Cause we know you need a little Molly and Rachael in your lives. XOXOConference Link: www.decon2023.comSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-12-29T13:00:00Z",
      "duration": "01:03:33.1200000",
      "explicit": false,
      "spotifyId": "00AH3D5kYVikcrChxae8Gi",
      "appleId": 1000591588260,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/00AH3D5kYVikcrChxae8Gi",
        "apple": "https://podcasts.apple.com/podcast/ep-53-a-year-of-growth/id1568302029?i=1000591588260"
      }
    },
    {
      "id": "13d44859-e3ea-4f7d-911f-72fdc9c31ee8",
      "title": "Ep 52 MollyTales",
      "description": "We’re gonna be real christian today and be nosey about Mollys personal life. This episode is vulnerable tale of self-discovery. Proceed with caution, grab a drink and listen to MollyTales.Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-12-15T10:00:00Z",
      "duration": "01:36:39.6270000",
      "explicit": false,
      "spotifyId": "1z7pWD5h48q2RTUo4U26R0",
      "appleId": 1000590263437,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1z7pWD5h48q2RTUo4U26R0",
        "apple": "https://podcasts.apple.com/podcast/ep-52-mollytales/id1568302029?i=1000590263437"
      }
    },
    {
      "id": "f539c6f3-7055-463a-883f-388a0bd2f73a",
      "title": "(Bonus Ep) Therapy vs Coaching: What You Keed to Know",
      "description": "We are addressing a situation that has come to our attention, as well as educating you on what to look for when considering hiring a therapist or life coach. We discuss red flags to be aware of and how to determine which one you need. We got you. Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-12-08T10:00:00Z",
      "duration": "00:42:46.1910000",
      "explicit": false,
      "spotifyId": "0FGNhOprwuVYzbvlyNnlw1",
      "appleId": 1000589386448,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0FGNhOprwuVYzbvlyNnlw1",
        "apple": "https://podcasts.apple.com/podcast/bonus-ep-therapy-vs-coaching-what-you-keed-to-know/id1568302029?i=1000589386448"
      }
    },
    {
      "id": "0154b519-dcea-4b86-9317-ccd874e4f84f",
      "title": "Ep 50 Christian Weddings (Thanks, We Hate It)",
      "description": "Do you have a cringey memory from that one christian wedding you just cant get out of your head? You\u0027re not alone. We talk about our cringe stories we remember, and our listeners tell us theirs! You might wanna grab a drink for this one.Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-12-01T10:00:00Z",
      "duration": "01:12:54.1250000",
      "explicit": false,
      "spotifyId": "58tzmo01KbEH37Y9GnVoM5",
      "appleId": 1000588294661,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/58tzmo01KbEH37Y9GnVoM5",
        "apple": "https://podcasts.apple.com/podcast/ep-50-christian-weddings-thanks-we-hate-it/id1568302029?i=1000588294661"
      }
    },
    {
      "id": "663c31d2-707e-479b-9cf1-756cd25d0889",
      "title": "Ep 49 I Was a Teenage Fundamentalist with Brian \u0026 Troy",
      "description": "This is a special crossover episode with Brian and Troy of the I was a Teenage Fundamentalist Podcast: https://pod.link/1558606464TW: Conversion Therapy and Mention of SuicideBrian and Troy used to be loyal megachurch leaders.  They’re not anymore. They have an honest and hilarious podcast that peeks behind the curtain at the weird, the worrying, and sometimes traumatic world of Pentecostalism. In this episode we talk about Brian and Troy\u0027s individual stories, evangelism, DC Talk, compare scars and talk shit.For part 1 of this episode, please check out their podcast anywhere you listen to podcasts!For more information about I was a Teenage Fundamentalist check out their links here: I was a Teenage Fundamentalist | Twitter, Instagram | Linktree Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-11-17T10:00:00Z",
      "duration": "01:27:34.4520000",
      "explicit": false,
      "spotifyId": "2EVFZMJuygN0i3rGtCioou",
      "appleId": 1000586552145,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2EVFZMJuygN0i3rGtCioou",
        "apple": "https://podcasts.apple.com/podcast/ep-49-i-was-a-teenage-fundamentalist-with-brian-troy/id1568302029?i=1000586552145"
      }
    },
    {
      "id": "5525a768-134e-4f2d-8e6c-0f7a864b9007",
      "title": "Ep 48 The Parallel Between Religion and Disordered Eating (with Rebecca Hambright)",
      "description": "Rebecca Hambright is an anti-diet Dietitian, and her practice is focused on weight-inclusivity, intuitive eating, and body neutrality. Her values are rooted in respect and empathy for all bodies. Rebecca understands that experiences related to food and body come withnuance and are affected by systems of oppression, and she is committed toworking against fat-phobia, weight stigma, and healthism. She is passionate about empowering others to reclaim their inherent body wisdom and she will encourage you to challenge food rules and health assumptions in order to discover a relationship with food, body, and mind that is based in compassion.Rebecca achieved both a Bachelor’s and a Master’s degrees in Dietetics at Appalachian State University, and still reside in lovely western North Carolina.To work with Rebecca:  www.wiseheartnutrition.comInstagram: https://www.instagram.com/wiseheart_nutrition/ Blog: https://www.wiseheartnutrition.com/blog/religion-and-diet-culture-a-recovery-story  Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-11-03T09:00:00Z",
      "duration": "01:15:24.5640000",
      "explicit": false,
      "spotifyId": "0VAJcJJbECQ5tE9qx5tTBu",
      "appleId": 1000584905593,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0VAJcJJbECQ5tE9qx5tTBu",
        "apple": "https://podcasts.apple.com/podcast/ep-48-the-parallel-between-religion-and-disordered/id1568302029?i=1000584905593"
      }
    },
    {
      "id": "44bd2a01-eaa8-4edb-8fb3-eeabb15186f9",
      "title": "Ep 47 Halloween and A Little Devil Worship",
      "description": "Its spooky season bebes. You know, Satan\u0027s holiday. The infamous Halloween. Did you celebrate growing up? Or did you do Harvest parties and trunk or treats at your church? Did you ignore it all together? Lets talk about it! We cover the history of Halloween in this episode in case you never learned the truth, and yeah, its all true. John Ramirez Video: https://www.tiktok.com/t/ZTRHHE9as/Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-10-20T09:00:00Z",
      "duration": "01:00:00.1170000",
      "explicit": false,
      "spotifyId": "2USkboHGmCiLxpfq8ZY3bd",
      "appleId": 1000583280389,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2USkboHGmCiLxpfq8ZY3bd",
        "apple": "https://podcasts.apple.com/podcast/ep-47-halloween-and-a-little-devil-worship/id1568302029?i=1000583280389"
      }
    },
    {
      "id": "9bf280fe-5b62-4f38-9dde-3a243bece775",
      "title": "Ep 46 Hot Takes",
      "description": "We have OPINIONS. Listen to us rant off about our hot takes about evangelical practices and other weird shit! Topics include: purity balls, Christian theater, hands on prayer, christians who turn pop songs christian, christians who read the bible in a year, mainstream worship songs, VBS and more! Facebook Evangelical Group: Cheers to Leaving - Exvangelical Support Group | FacebookSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-10-06T09:00:00Z",
      "duration": "01:14:20.9300000",
      "explicit": false,
      "spotifyId": "3ff5LJrZ2d45nWXj9bjNIB",
      "appleId": 1000581778993,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ff5LJrZ2d45nWXj9bjNIB",
        "apple": "https://podcasts.apple.com/podcast/ep-46-hot-takes/id1568302029?i=1000581778993"
      }
    },
    {
      "id": "04f33615-d225-4df7-b15a-0034707f5e3f",
      "title": "Ep 45 Secrets, Witches and a Mohawk Baptism (with Susan Grafton)",
      "description": "TW: childhood sexual abuseWe\u0027re getting into some heavy topics today as well as some fun ones. We\u0027re talking about toxic childhood environments, sexuality, death, witchy stuff, spirituality and more. Susan Grafton is mother, writer, speaker and a Registered Nurse with a diverse career. She has worked as a professor, worked emergency evacuations of large health facilities and in high level security prisons. She now serves as the medical expert on a criminal prosecution team for the California Department of Justice. Susan has written a book sharing her story where she aims to bring people hope you grew up toxic childhood environments. Susan\u0027s book \u0027reclaimed truth\u0027 is out now.Reclaimed Truth: https://www.reclaimedtruth.com/Facebook: https://www.facebook.com/s.j.graftonInstagram: Reclaimed Truth (@reclaimed_truth) • Instagram photos and videosSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-09-22T09:00:00Z",
      "duration": "01:15:40.1860000",
      "explicit": false,
      "spotifyId": "4EbecLYkn1JnipF4nHX9qt",
      "appleId": 1000580283961,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EbecLYkn1JnipF4nHX9qt",
        "apple": "https://podcasts.apple.com/podcast/ep-45-secrets-witches-and-a-mohawk-baptism/id1568302029?i=1000580283961"
      }
    },
    {
      "id": "c2619f10-ca5b-4108-904d-9e0a43340939",
      "title": "Ep 44 Compulsory Heterosexuality (with Samantha Fox)",
      "description": "Samantha Fox is a Sexuality Coach and a Licensed Marriage and Family Therapist in New York. She has been in private practice for over a decade, working with individuals and couples struggling with sexuality, sexual issues, coming out later in life and intimacy. She pulls from a variety of therapy models to work with her clients which supports her belief that one size doesn’t fit all. She has been sought out by women coming out later in life who need help managing internalized homophobia, feelings of guilt and shame, and struggling to embrace and embody their authentic selves. To give women a safe space to explore, find and live their truth, and to create an embracing community for women around the globe that are questioning their sexuality or coming out later in life, She has built the Curious, Questioning and Coming Out Programs.To work with and find Samantha: Website: https://www.curiousquestioningandcomingout.comInstagram https://www.instagram.com/lesbiancuriositycoach/TikTok https://www.tiktok.com/@lesbiancuriositycoachYou Tube Channel https://www.youtube.com/channel/UCugZWOUuPKEtdXQndioSbYQFacebook Support Group: https://www.facebook.com/groups/1024788251753835Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-09-08T09:00:00Z",
      "duration": "01:15:03.1440000",
      "explicit": false,
      "spotifyId": "5tlXQnpCkCLTbDHlfOlZP4",
      "appleId": 1000578806237,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tlXQnpCkCLTbDHlfOlZP4",
        "apple": "https://podcasts.apple.com/podcast/ep-44-compulsory-heterosexuality-with-samantha-fox/id1568302029?i=1000578806237"
      }
    },
    {
      "id": "7fceae85-bda7-4561-b385-e0419bfd880f",
      "title": "Ep 43 Black Church Girl Adjacent (With Yeside Davis)",
      "description": "Yeside Davis is an Intimacy Doula. This is a person who guides you to improved sexual-spiritual life. As a former church girl, She was boxed in and unable to truly step into all her gifts, as many of them were viewed as sinful. Now, she helps hundreds of women break free from what\u0027s hindering them from obtaining sexual-spiritual liberation. She provides sacred space for everyone she works with. She is here to talk about her new book thats out now. You can find Yeside\u0027s book on amazom:Black Church Girl Adjacent: A Black Woman\u0027s Journey in Faith, Feminism, and Freedom: Davis, Yeside, Jeffries, LaQueshia: 9798986129129: Amazon.com: BooksTo work with Yeside: About | Getcho BlissIG: Yeside A. Davis (@getchobliss) • Instagram photos and videosSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-08-25T12:00:00Z",
      "duration": "01:15:14.1940000",
      "explicit": false,
      "spotifyId": "4qY4JHCtuWtwc4jztbaph6",
      "appleId": 1000577327723,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qY4JHCtuWtwc4jztbaph6",
        "apple": "https://podcasts.apple.com/podcast/ep-43-black-church-girl-adjacent-with-yeside-davis/id1568302029?i=1000577327723"
      }
    },
    {
      "id": "95815433-afb7-41a1-898d-ebef1697b94e",
      "title": "Ep 42 Porn Addiction Isn\u0027t Real- A Sex Ed Talk (with Erica Smith)",
      "description": "Erica Smith (she/her) is an award winning sexuality educator and consultant with over 20 years of experience. She has provided comprehensive sex education and advocacy to young women and LGBTQ\u002B youth in Philadelphia’s juvenile justice system, worked in abortion care, and supported HIV\u002B and transgender adolescents and their families. She received her Master of Education from Widener University\u0027s Center for Human Sexuality Studies. In 2019, she developed the Purity Culture Dropout™️ Program to help people learn all of the sex education that they missed growing up in purity culture- sex ed that is accurate, queer inclusive, trauma informed, compassionate, and comprehensive. Erica lives in Philadelphia with her partner and house full of rescue animals and you can find her on Instagram at @ericasmith.sex.ed. To work with Erica: https://www.ericasmitheac.com/Join our Support group: https://www.facebook.com/groups/1024788251753835Support the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-08-18T10:00:00Z",
      "duration": "01:01:14.2000000",
      "explicit": false,
      "spotifyId": "2bqXx0Jq2M8zXaRJW0eDDE",
      "appleId": 1000576472586,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bqXx0Jq2M8zXaRJW0eDDE",
        "apple": "https://podcasts.apple.com/podcast/ep-42-porn-addiction-isnt-real-a-sex-ed-talk-with-erica-smith/id1568302029?i=1000576472586"
      }
    },
    {
      "id": "b04e0a85-1ba8-4b9a-afb7-28fac16c8a0b",
      "title": "Ep 41 Talk Purity to Me (with Blair Rabun)",
      "description": "From awkward first kisses, to purity retreats,  and bikinis...Blair is here to talk about it all. Blair - Who runs the talk purity to me Instagram page, is  a content creator and a purity culture drop out from the south who loves seeing people live free from shame. Resources: Parenting Forward - Cindy Brandt (cindywangbrandt.com)ericasmith-sex-ed - Erica Smith, M.Ed. | bio.fmLaura Anderson Therapyhttps://www.instagram.com/drtinashameless/?hl=en - Dr Tina SchermerSupport Group: Cheers to Leaving - Exvangelical Support Group | FacebookSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-08-11T10:00:00Z",
      "duration": "00:59:48.1790000",
      "explicit": false,
      "spotifyId": "5T7GIr0mQSO5iqIa3vQCB0",
      "appleId": 1000575754416,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5T7GIr0mQSO5iqIa3vQCB0",
        "apple": "https://podcasts.apple.com/podcast/ep-41-talk-purity-to-me-with-blair-rabun/id1568302029?i=1000575754416"
      }
    },
    {
      "id": "93cffbc6-619e-465c-a992-bcb0d0196fcf",
      "title": "Ep 40 House Church and Demon Kinks",
      "description": "We both grew up in house church and we\u0027re here to share the deets on those experiences. Topics may or may not include, lake baptisms, all day services, daddy god kinks, demon kinks, and a weird skit they randomly remembered that was super popular in churches 15 years ago. Let\u0027s do this.Support Group: Cheers to Leaving - Exvangelical Support Group | FacebookRandom Weird Skit: (471) [HQ] Lifehouse - Everything Skit Remastered High Quality - YouTubeSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-08-04T10:00:00Z",
      "duration": "01:07:11.0850000",
      "explicit": false,
      "spotifyId": "5npaD9e2v3YLhmki9qEFOZ",
      "appleId": 1000574984997,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5npaD9e2v3YLhmki9qEFOZ",
        "apple": "https://podcasts.apple.com/podcast/ep-40-house-church-and-demon-kinks/id1568302029?i=1000574984997"
      }
    },
    {
      "id": "825f7c47-fd14-4d5d-bfbb-adfd99dc1534",
      "title": "Ep 39 Shame Kinks, Exvangelical Parenting and Original Sin.",
      "description": "Today we answer listener questions and read listener responses and go down rabbit holes in between. We cover a wide range of topics but hey you asked and we answered!Join our support group: Cheers to Leaving - Exvangelical Support Group | FacebookSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-07-28T10:00:00Z",
      "duration": "01:25:54.4030000",
      "explicit": false,
      "spotifyId": "0txRHm2Z1mV1sJij7tJZwt",
      "appleId": 1000571439176,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0txRHm2Z1mV1sJij7tJZwt",
        "apple": "https://podcasts.apple.com/podcast/ep-39-shame-kinks-exvangelical-parenting-and-original-sin/id1568302029?i=1000571439176"
      }
    },
    {
      "id": "78d02a9f-43db-4b5f-b14e-b60dc9e8b61c",
      "title": "Ep 38 Church Friends After Church Ends",
      "description": "Do you still have friends from your old church? Do you still have people in your life that you want to keep but arent sure if you should? Lets talk about it! Navigating these relationships can be hard and sometimes they are worth keeping and sometimes they aren\u0027t. Join us as we dive into this hard conversation and hopefully offer you some clairty.Join our support group: Cheers to Leaving - Exvangelical Support Group | FacebookSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-07-21T10:00:00Z",
      "duration": "01:09:24.6490000",
      "explicit": false,
      "spotifyId": "4FCNYnadZm7NJXOWCOzCUo",
      "appleId": 1000570687438,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4FCNYnadZm7NJXOWCOzCUo",
        "apple": "https://podcasts.apple.com/podcast/ep-38-church-friends-after-church-ends/id1568302029?i=1000570687438"
      }
    },
    {
      "id": "39ca183d-2066-4afc-852c-22178cd43670",
      "title": "Ep 37 We were Christian Theater kids (with Nathaniel Bozarth)",
      "description": "Today we have a special guest, Nathaniel Bozarth. Nathaniel is a former evangelical, and former Christian theater kid. Nathaniel and Rachael used to be in Christian youth theater together as well as the homeschool world. In this episode we touch on weird Christian theater(obviously), white supremacy, shame, and how it all intertwines with white evangelicals. Nathaniel Bozarth is an Emmy award-winning storyteller, public historian, and data scientist. His creative work has centered around the history of residential segregation and the personal work of racial justice. This work includes a podcast (Wide Ruled) on justice in education, two documentary series about how various identities affect one’s access to “the American Dream” (Your Fellow Americans, Re:Dream), and a TedX Talk. In 2018, Nathaniel co-created an app-based tour (Dividing Lines) of the history of residential segregation in KC. In 2021, the team created a new virtual version of the tour. Nathaniel teaches data analytics at Rockhurst University and pursue with an emphasis on data justice.My Projects: http://www.nathanielbozarth.com/projectsDividing Lines (VR/driving tour) https://www.jocolibrary.org/dividinglinesLand of Opportunity (documentary): https://video.kansascitypbs.org/video/land-of-opportunity-8bqamu/Support Group: Cheers to Leaving - Exvangelical Support Group | Facebook--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-07-14T11:00:43Z",
      "duration": "01:37:04.0260000",
      "explicit": false,
      "spotifyId": "42hihSKlDnUfXAELGzpfbi",
      "appleId": 1000569886817,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/42hihSKlDnUfXAELGzpfbi",
        "apple": "https://podcasts.apple.com/podcast/ep-37-we-were-christian-theater-kids-with-nathaniel-bozarth/id1568302029?i=1000569886817"
      }
    },
    {
      "id": "0effaf11-83e2-4465-8280-333268c7b4a3",
      "title": "Ep 36 How Do We Heal (with Andrew Jasko)",
      "description": "Back at it with Andrew Jasko! If you didn\u0027t listen to episode 34 we definitely suggest you do before listening to this one to hear more about Andrew and his story. In this episode we cover PTSD, the difference between religious trauma and other trauma, and most importantly how do we heal. Andrew Jasko, M.Div., MA Counseling Psychology in progress, is a former Princeton Seminary educated minister. He left his religious faith and community because of the severe psychological trauma he experienced. After spending years and thousands of dollars healing his trauma and helping hundreds of people transform their lives, He is considered an expert in healing religious trauma. His clients hire him to heal and find healthy, authentic spirituality that suits them. As a religious trauma specialist and spirituality coach, He helps people heal and reclaim a healthy connection with spirituality by using trauma-informed therapeutic techniques and psychospiritual practices. To learn more about Andrews work and to work with him: Home - Healing Religious Trauma \u0026 Integrating Healthy Spirituality (lifeafterdogma.org)Support Groups: Cheers to Leaving - Exvangelical Support Group | Facebook Healing from Religious Trauma, Discussing All Perspectives on Spirituality | Facebook Sound by the wonderful Cameron Smith--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-07-07T11:00:37Z",
      "duration": "01:07:02.9090000",
      "explicit": false,
      "spotifyId": "4fiptNuQbcIuXze6hpXNFs",
      "appleId": 1000569135228,
      "subjects": [
        "Evangelicalism",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fiptNuQbcIuXze6hpXNFs",
        "apple": "https://podcasts.apple.com/podcast/ep-36-how-do-we-heal-with-andrew-jasko/id1568302029?i=1000569135228"
      }
    },
    {
      "id": "35250171-eecc-4bd6-b120-dab88e005fdc",
      "title": "Ep 35 Roe v Wade Overturned",
      "description": "Hello beautiful listeners. In light of recent events, we could not be silent about how we feel and how it has impacted us and how it will impact you. We are tired and angry and shit talk about evangelical\u0027s posts on Facebook but ultimately hope to provide you with resources and empower you as well.Resources: Donate – Together RisingHome - National Network of Abortion FundsPLAN C: Learn to access at-home abortion pill options online (plancpills.org)Support Group: Cheers to Leaving - Exvangelical Support Group | FacebookSound by the wonderful Cameron Smith--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-06-30T11:01:04Z",
      "duration": "01:09:21.2780000",
      "explicit": false,
      "spotifyId": "4QuabUmBTiNowvYpmPiIo8",
      "appleId": 1000568257096,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4QuabUmBTiNowvYpmPiIo8",
        "apple": "https://podcasts.apple.com/podcast/ep-35-roe-v-wade-overturned/id1568302029?i=1000568257096"
      }
    },
    {
      "id": "0a53eafc-1d71-42f5-86bc-de9e9f9cfac5",
      "title": "Ep 34 God is a fascist and hell isn\u0027t real (with Andrew Jasko)",
      "description": "Oh HELL yes (see what I did there?) we are talking to Andrew Jasko today about religious trauma, psychedelics, hell, healing and much more. You might need a glass of wine for this one cause we\u0027re diving real deep.Andrew Jasko, M.Div., MA Counseling Psychology in progress, is a former Princeton Seminary educated minister. He left his religious faith and community because of the severe psychological trauma he experienced. After spending years and thousands of dollars healing his trauma and helping hundreds of people transform their lives, He is considered an expert in healing religious trauma. His clients hire him to heal and find healthy, authentic spirituality that suits them. As a religious trauma specialist and spirituality coach, He helps people heal and reclaim a healthy connection with spirituality by using trauma-informed therapeutic techniques and psychospiritual practices.To learn more about Andrews work and to work with him:Home - Healing Religious Trauma \u0026 Integrating Healthy Spirituality (lifeafterdogma.org)Article mentioned in Episode: Is Evangelical Christianity’s God the Devil? - Healing Religious Trauma \u0026 Integrating Healthy Spirituality (lifeafterdogma.org)Life After Dogma - YouTubeSupport Groups:Cheers to Leaving - Exvangelical Support Group | FacebookHealing from Religious Trauma, Discussing All Perspectives on Spirituality | FacebookSound by the wonderful Cameron Smith--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-06-23T11:00:42Z",
      "duration": "01:08:23.0260000",
      "explicit": false,
      "spotifyId": "4H5JHITBoxBBfoSqRnGSpl",
      "appleId": 1000567485145,
      "subjects": [
        "Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4H5JHITBoxBBfoSqRnGSpl",
        "apple": "https://podcasts.apple.com/podcast/ep-34-god-is-a-fascist-and-hell-isnt-real-with-andrew-jasko/id1568302029?i=1000567485145"
      }
    },
    {
      "id": "0a065d9f-be4a-4734-854b-6164e6c32c73",
      "title": "Ep 33 Born Sinful (with Phill Drysdale)",
      "description": "Today we\u0027re going to explore original sin. Oh yeah, shes a doozy. But dont worry, we have an amazing guest here to walk us through the mess of being born sinful.Phil Drysdale is a companion to those going through the painful process of deconstruction. He conducts research on those who deconstruct, has various free resources, including his podcast and offers a safe space for people to anonymously explore their deconstruction. You can reach out to Phil on Instagram with a DM!Phil Drysdale (@phildrysdale) • Instagram photos and videosPhil Drysdale - YouTubeJoin our support group!Cheers to Leaving - Exvangelical Support Group | FacebookSound by: Cameron Smith--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-06-16T11:00:07Z",
      "duration": "01:02:27.2650000",
      "explicit": false,
      "spotifyId": "72dqXleknMzF2ZyWKNTNvx",
      "appleId": 1000566628713,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/72dqXleknMzF2ZyWKNTNvx",
        "apple": "https://podcasts.apple.com/podcast/ep-33-born-sinful-with-phill-drysdale/id1568302029?i=1000566628713"
      }
    },
    {
      "id": "47d0d474-b14c-41f6-9fa9-aa8e054f8ce4",
      "title": "Ep 32 God Loves Divorce",
      "description": "Sidenote: Rachael\u0027s voice audio file got messed up so we apologize in advance for the sound quality of her voice. Daphne shares her story of marriage, divorce, and leaving evangelicalism through her blog and IG platform. She is also a relationship coach for folks who are looking for support when leaving harmful situations and trying to find peace and happiness in relationships.  Daphne\u0027s blog and ways to work with her can be found at the links below:Daphne | Relationship Coach (@goldendaph) • Instagram photos and videosGolden Daph – “…I shall come forth as gold…”Cheers to Leaving - Exvangelical Support Group | Facebook--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-06-09T11:00:52Z",
      "duration": "01:02:42.0500000",
      "explicit": false,
      "spotifyId": "0dvy1YeWxegkyOqJ8hteoU",
      "appleId": 1000565768378,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dvy1YeWxegkyOqJ8hteoU",
        "apple": "https://podcasts.apple.com/podcast/ep-32-god-loves-divorce/id1568302029?i=1000565768378"
      }
    },
    {
      "id": "b16117f4-4af1-4310-9365-9fd551f2773a",
      "title": "Ep 31 Unsolicited Bible Verses",
      "description": "This episode we talk about unsolicited bible verses which frankly might be worse than an unsolicited dick pic? You can decide for yourself. We chat about receiving these kinds of texts from parents and family members, boundaries, and how to navigate both of these. Friendly reminder: send us your stories! We want to read them! Email us at: cheerstoleaving@gmail.comPlease join our facebook group as well! Cheers to Leaving - Exvangelical Support Group | Facebook--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-06-02T11:00:17Z",
      "duration": "01:15:47.4740000",
      "explicit": false,
      "spotifyId": "1L4FwTQ7GVuwB97exiKxmt",
      "appleId": 1000564957783,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1L4FwTQ7GVuwB97exiKxmt",
        "apple": "https://podcasts.apple.com/podcast/ep-31-unsolicited-bible-verses/id1568302029?i=1000564957783"
      }
    },
    {
      "id": "ff6a48c2-ca5f-4f0d-97f5-7f719b56a0ea",
      "title": "Ep 30 Deconstructing Purity Culture (with Sarah Lacour)",
      "description": "This week we are talking to Sarah Lacour who runs a page on Instagram called @deconstructingpurityculture. In this episode we discuss Sarah\u0027s experience growing up in purity culture, the new 300-page third party investigation of the SBC, the christian sex gal, and how purity culture and diet culture go hand in hand.To find Sarah: Sarah (@deconstructingpurityculture) • Instagram photos and videos Support FB Group: Cheers to Leaving - Exvangelical Support Group | Facebook Sound by Cameron Smith--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-05-26T11:00:18Z",
      "duration": "01:19:00.9110000",
      "explicit": false,
      "spotifyId": "2UUzZnBEpj39P0UUqHVQwR",
      "appleId": 1000563987183,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2UUzZnBEpj39P0UUqHVQwR",
        "apple": "https://podcasts.apple.com/podcast/ep-30-deconstructing-purity-culture-with-sarah-lacour/id1568302029?i=1000563987183"
      }
    },
    {
      "id": "78701156-52bb-4d09-93be-ccefe0fc1eda",
      "title": "Ep 29 From Christian Mingle to Tinder",
      "description": "Another classic episode of Molly and Rachael talking about purity culture, but this time we zero in on what it was like to \u0027date\u0027 in evangelical culture and dating AFTER evangelical culture. So fun right? Lets do this.--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-05-19T13:13:29Z",
      "duration": "01:06:27.0170000",
      "explicit": false,
      "spotifyId": "4Duh2rmLdSqHWZGY1eS5Ef",
      "appleId": 1000562550059,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Duh2rmLdSqHWZGY1eS5Ef",
        "apple": "https://podcasts.apple.com/podcast/ep-29-from-christian-mingle-to-tinder/id1568302029?i=1000562550059"
      }
    },
    {
      "id": "08883dd4-ddb2-442e-8e2f-052684d5a68a",
      "title": "Ep 28 A Double Life (With Dr. Josie McSkimming)",
      "description": "In today\u0027s episode we talk about Josie\u0027s journey of leaving evangelicalism, how she was once accused of being the antichrist, having an identity crisis and much more. Dr Josie McSkimming is a clinical social worker with more than 30 years experience. She has practiced in a wide range of settings, including hospital social work, inter-country adoption, post-adoption services, drug and alcohol treatment, individual and couples therapy and adult mental health.  She is the Author of \u0027Leaving Christian Fundamentalism \u0026 the Reconstruction of Identity\u0027 Environmentalist. To find Josie you can visit: Josie McSkimming | Sydney Eastern Suburbs Counselling ServicesAnd on twitter: Dr Josie McSkimming 💉💉 💉 🐦🌳🌈🌿🕸 (@JosieMcskimming) / Twitter--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-05-05T11:00:19Z",
      "duration": "01:05:21.2660000",
      "explicit": false,
      "spotifyId": "2eHCn1X56p0YH2WYQ5EQTN",
      "appleId": 1000559694648,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2eHCn1X56p0YH2WYQ5EQTN",
        "apple": "https://podcasts.apple.com/podcast/ep-28-a-double-life-with-dr-josie-mcskimming/id1568302029?i=1000559694648"
      }
    },
    {
      "id": "bd7485a1-6a68-43e4-8c2e-e91dc29338c0",
      "title": "Ep 27 Christian Nightmares",
      "description": "TW: SpankingThis week our special guest is Christian Nightmares. You know, the page that has all funny yet terrifying things Christians do. In this episode we talk to christian nightmares about his page, his religious background, christian punishments and why he chooses to stay anonymous and a lot more! So settle in, grab a margarita(or 3), and lets talk about christian nightmares.To find out more about christian nightmares and to donate to his cause click the link below:@ChristianNightmares | Linktree--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-04-28T11:00:27Z",
      "duration": "01:10:30.4520000",
      "explicit": false,
      "spotifyId": "2syE8eyRNrXGI8Ah6DzXxi",
      "appleId": 1000558965859,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2syE8eyRNrXGI8Ah6DzXxi",
        "apple": "https://podcasts.apple.com/podcast/ep-27-christian-nightmares/id1568302029?i=1000558965859"
      }
    },
    {
      "id": "4f7dbb0a-150e-4f93-8b7e-1aec3a87c981",
      "title": "Ep 26 Horny for Easter",
      "description": "I think you know what this episode is about.Show notes:Cheers to Leaving - Exvangelical Support Group | FacebookOrigin Of Easter (allaboutjesuschrist.org)--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-04-21T11:00:51Z",
      "duration": "00:54:31.7580000",
      "explicit": false,
      "spotifyId": "70TxkJemUav5XPvXxZLGFw",
      "appleId": 1000558252467,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/70TxkJemUav5XPvXxZLGFw",
        "apple": "https://podcasts.apple.com/podcast/ep-26-horny-for-easter/id1568302029?i=1000558252467"
      }
    },
    {
      "id": "edbd2c45-973f-4259-b5bd-e68546fa9997",
      "title": "Ep 25 Down the Rabbit Hole: Philosophy and Ambiguity (with Cameron Smith)",
      "description": "Currently experiencing existential dread? Cool. Us too. Here\u0027s some philosophical theories to help you. Cameron Smith is our special guest today. He has a degree in physics, math, business, and economics and has devoted his life to forever learning. Cameron is on TikTok as XerofoX where he posts philosophical videos about different theories about reality and consciousness. He was raised as a christian but later found that science was more of an answer than Christianity.Today we talk to Cameron about his life, philosophies and general madness that we all experience. Lets all go down the rabbit hole together!To follow Cameron on his many endeavors:XerofoX (@xerofox) TikTok | Watch XerofoX\u0027s Newest TikTok Videos🦊 XerofoX 🦊 (@officialxerofox) • Instagram photos and videosXerofoX (@officialxerofox) / Twitter--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-04-14T11:00:00Z",
      "duration": "01:06:53.4530000",
      "explicit": false,
      "spotifyId": "5Hs1u58lwz1v7ab0GH3oMQ",
      "appleId": 1000557597697,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Hs1u58lwz1v7ab0GH3oMQ",
        "apple": "https://podcasts.apple.com/podcast/ep-25-down-the-rabbit-hole-philosophy-and/id1568302029?i=1000557597697"
      }
    },
    {
      "id": "182059c9-abfa-4200-b119-f09dccb06e39",
      "title": "Ep 24 Getcho Bliss (with Yeside A Davis)",
      "description": "We thought it was about time for some sexy talk. Our special guest today is Yeside Davis who is an Intimacy Doula \u0026 Erotica Writer. Dont know what an intimacy doula is? Guess you\u0027ll have to listen to find out. Ope. We talk about autonomy, self love, self intimacy after leaving religion and so much more!To follow and learn more or book with Yeside, see below:Home | Getcho BlissInstagram: Yeside (@getchobliss) • Instagram photos and videos--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-04-07T11:00:00Z",
      "duration": "01:03:00.0480000",
      "explicit": false,
      "spotifyId": "6QgmvrYdd7k0HpYLyeIs37",
      "appleId": 1000556519618,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6QgmvrYdd7k0HpYLyeIs37",
        "apple": "https://podcasts.apple.com/podcast/ep-24-getcho-bliss-with-yeside-a-davis/id1568302029?i=1000556519618"
      }
    },
    {
      "id": "5daa85c3-c42e-4d6f-9075-7f9b801cf2b4",
      "title": "Ep 23 Puppets for Jesus",
      "description": "Hellooooooo listeners. Today we are speaking with Dr. Lauren Sawyer and yes you guessed it, puppets. But not just puppets, we will dive into purity culture (cause thats always relevant), sex, being lgbtq\u002B and a believer? Is it possible? Social justice and holding the church accountable for wrong doings. Strap on in cause its gonna be a bumpy ride.Dr. Lauren D. Sawyer is an educator and ethicist living in Seattle, Washington. For more than 5 years, Lauren has taught courses in philosophy, ethics, theology, and religion for undergraduate and graduate students across the country. In her role as Program Manager for FaithTrust Institute, she develops trainings and curriculum for a variety of religious and spiritual communities and participates in investigating allegations of clergy misconduct.Sawyers dissertation, I Stumbled/I Caused You to Stumble:White Girls and Queer Youth as Sexual Agents in Contemporary Evangelical Purity Culture, explores the longterm effects of Christian purity culture. She investigates the function of teenage sexualization as they uphold a white supremacist patriarchal norms. Lauren’s work is a detailed analysis of gender, sexuality, religion and culture.IG: instagram.com/ldsawyer Website: laurendsawyer.com Purity Culture Research Collective: puritycultureresearchcollective.com--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-03-31T11:00:00Z",
      "duration": "01:30:46.6350000",
      "explicit": false,
      "spotifyId": "0EvbqySkoz0NAGvjjirNzS",
      "appleId": 1000555816527,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0EvbqySkoz0NAGvjjirNzS",
        "apple": "https://podcasts.apple.com/podcast/ep-23-puppets-for-jesus/id1568302029?i=1000555816527"
      }
    },
    {
      "id": "3aa9c1a1-5ad6-461c-a5da-072f59743179",
      "title": "Ep 22 We\u0027ve Been Warned",
      "description": "Hello lovelies! Molly and I check in with each other in this episode and talk about how our deconstruction is going and lots of other epiphanies we\u0027ve had lately and just generally shooting the shit as one does. Molly received a warning letter and we read it on the pod! We have recently made a facebook support group and we hope you\u0027ll join us there! Much love xoxoFacebook group: Cheers to Leaving - Exvangelical Support Group | FacebookEmail: cheerstoleaving@gmail.com --- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-03-24T11:00:00Z",
      "duration": "01:12:40.1500000",
      "explicit": false,
      "spotifyId": "7zWOrZExFDLIbl0NTkreQx",
      "appleId": 1000555099989,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7zWOrZExFDLIbl0NTkreQx",
        "apple": "https://podcasts.apple.com/podcast/ep-22-weve-been-warned/id1568302029?i=1000555099989"
      }
    },
    {
      "id": "a3b20b11-9c51-4a68-81e8-338c49342ac8",
      "title": "Ep 21 Dr Death",
      "description": "In this episode we talk we talk with Dr. Terri Daniel about the death, the afterlife and dealing with religious trauma around hell. Terri is a hospice and hospital-trained clinical chaplain and end-of-life educator certified in death, dying and bereavement and in trauma support. She conducts workshops throughout the U.S. for the dying and the bereaved, and teaches in the interreligious chaplaincy program at the Graduate Theological Union. She is the founder of the The Afterlife Conference, The Conference on Death, Grief and Belief, and the Ask Doctor Death podcast, and is the author of four books on death and grief.Visit the website to find out information on her upcoming conference:  Help for Religious Trauma and Toxic Theology When Facing Loss or Grief (deathgriefandbelief.com)Twitter: @DGBConferenceTerri\u0027s Twitter: @DrTerriDaniel1--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-03-17T14:07:06Z",
      "duration": "01:00:36.8970000",
      "explicit": false,
      "spotifyId": "0JtijNrDR4XRdEkgaf3ytr",
      "appleId": 1000554374262,
      "subjects": [
        "Evangelicalism",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0JtijNrDR4XRdEkgaf3ytr",
        "apple": "https://podcasts.apple.com/podcast/ep-21-dr-death/id1568302029?i=1000554374262"
      }
    },
    {
      "id": "fec0fc28-324f-4d3a-bb8c-01cc70e716ac",
      "title": "Ep 20 Exvangelis",
      "description": "Ivy, creator of Exvangelis, is talking with us about his video project where he interviews exvangelicals about their stories. We also discuss his background as an evangelical christian, a successful exorcism, purity culture and much more!Exvangelis Instagram: https://www.instagram.com/exvangelis/https://allmylinks.com/exvangelisTo share your story on Exvangelis email at: exvangelis@gmail.com --- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-03-10T13:00:00Z",
      "duration": "01:19:05.4560000",
      "explicit": false,
      "spotifyId": "0DyQpDnsqv0w71cXirjtOk",
      "appleId": 1000553553509,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0DyQpDnsqv0w71cXirjtOk",
        "apple": "https://podcasts.apple.com/podcast/ep-20-exvangelis/id1568302029?i=1000553553509"
      }
    },
    {
      "id": "51312ce1-d40c-4da0-adbe-704c94b23d2d",
      "title": "Ep 19 \u0022I chose me\u0022",
      "description": "Andrew Pledger is sharing his story with us today all the way from South Carolina. We had such an incredible conversation with him and we hope his story and his passion will inspire you. He was recently expelled from Bob Jones university so of course we got the deets on that. Oh and if you see a toxic person ranting about prayer, walk the other way hun. Lets do this! Josh Harris Video: https://www.instagram.com/tv/CYcOw9LqHL0/?utm_medium=copy_link Andrews link page:https://www.liinks.co/4ndrewpledger Andrew Instagram Page:https://www.instagram.com/4ndrewpledger/ Blog: https://cheerstoleaving.wordpress.com/2022/03/03/ep-19-i-chose-me/--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-03-03T15:59:36Z",
      "duration": "01:55:27.2030000",
      "explicit": false,
      "spotifyId": "0rZMpAp5yF8NVCyEyMqvah",
      "appleId": 1000552833693,
      "subjects": [
        "Evangelicalism",
        "Bob Jones University",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rZMpAp5yF8NVCyEyMqvah",
        "apple": "https://podcasts.apple.com/podcast/ep-19-i-chose-me/id1568302029?i=1000552833693"
      }
    },
    {
      "id": "be8482d8-f64e-4657-8284-4023b31b82ef",
      "title": "Ep 18 It\u0027s About To Get Culty",
      "description": "This week Rachael and Molly talk about Church Camp! We touch on purity culture (cause how could you not), super cult like shit that happened but it was normal to us, worship camp sessions, \u0022coming of age\u0022 ceremonies (ew) and other fun culty things! This is Molly\u0027s first episode as my new cohost! She will be with us for as long as she likes and I\u0027m super excited to have her. She was in Ep 9 \u0022Healthy Hoe\u0022 if you want to go back and listen! She is an ex-missionary kid and exvangelical. She is a massage therapist. She is currently studying pelvic floor therapy with a focus on female sexuality and pleasure! Find Molly on Instagram @molly.crinoWebsite: Book a massage with Molly Crino LMT | Louisville KY 40217 (massagebook.com)--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-02-24T13:00:00Z",
      "duration": "01:36:56.8680000",
      "explicit": false,
      "spotifyId": "2WrYw0eJ3WgdIW32amkLbR",
      "appleId": 1000552111458,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WrYw0eJ3WgdIW32amkLbR",
        "apple": "https://podcasts.apple.com/podcast/ep-18-its-about-to-get-culty/id1568302029?i=1000552111458"
      }
    },
    {
      "id": "1a3bfefb-5905-4127-8187-4a2693de0528",
      "title": "Ep 17 My Gay Church Days",
      "description": "George Azar is here to promote his upcoming book My Gay Church Days which releases on February 14th 2022 and share his story with us.Find George at www.mygaychurchdays.comInstagram: https://www.instagram.com/mygaychurchdays/--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2022-02-10T14:34:22Z",
      "duration": "00:55:03.9670000",
      "explicit": false,
      "spotifyId": "6B8AQDuK9yUez3l6lZBVBy",
      "appleId": 1000550687116,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6B8AQDuK9yUez3l6lZBVBy",
        "apple": "https://podcasts.apple.com/podcast/ep-17-my-gay-church-days/id1568302029?i=1000550687116"
      }
    },
    {
      "id": "91975a24-f17c-40da-bca3-9c5edf9b7cb5",
      "title": "Ep 16 (BONUS) Purity Culture, Non Denominational churches, and Porn, Oh My! (With Deconversion Therapy)",
      "description": "Collaborating with the Deconversion Therapy pod in this Bonus episode! We talk about our individual stories, purity culture, being \u0027good\u0027, non denominational church\u0027s as well as porn and masturbation!To find out more about Deconversion Therapy: https://www.deconversiontherapypodcast.com/Heavens Gates and Hells Flames video: https://www.youtube.com/watch?v=njG9P0JvzyIFull Porn post on the blog! https://cheerstoleaving.wordpress.com/--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-12-09T15:50:23Z",
      "duration": "01:34:24.1820000",
      "explicit": false,
      "spotifyId": "6grDKjVGP27yCqWK6LC1bI",
      "appleId": 1000544459647,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6grDKjVGP27yCqWK6LC1bI",
        "apple": "https://podcasts.apple.com/podcast/ep-16-bonus-purity-culture-non-denominational-churches/id1568302029?i=1000544459647"
      }
    },
    {
      "id": "14e4be02-c2f9-4652-bbc4-7364fb2966f9",
      "title": "Ep 15 Christian Crimes - Jesus made me do it!",
      "description": "Honestly let’s talk about the amount of crimes committed in the Christian agenda and in the name of the good Lord, but also the “voices” are concerning…let’s hear about crusades, crimes in the name of Jesus, and some weird ass Facebook posts…Show notes and references: https://www.cairn.info/revue-francaise-d-etudes-americaines-2006-4-page-107.htmhttps://www.history.com/topics/middle-ages/crusades“[Christian nationalists] see it in cataclysmic terms: This is the moment, and God’s going to judge us,” “When you paint it in existential terms like that, a lot of people feel justified to carry out acts of violence in the name of their faith.” -Elizabeth Neumann, a former top official at the Department of Homeland Security who resigned from Trump administration in April 2020.And last but definitely not least: https://globalgrind.com/1953770/6-crazy-crimes-committed-in-the-name-religion-list/--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-12-06T05:34:54Z",
      "duration": "01:01:31.4410000",
      "explicit": false,
      "spotifyId": "0sCG5HBZjVV2yeS5EspJ6a",
      "appleId": 1000544058457,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0sCG5HBZjVV2yeS5EspJ6a",
        "apple": "https://podcasts.apple.com/podcast/ep-15-christian-crimes-jesus-made-me-do-it/id1568302029?i=1000544058457"
      }
    },
    {
      "id": "98d9b07b-c430-4806-823d-60dcb545a43e",
      "title": "Ep 14 Jesus Camp!",
      "description": "My thoughts on the 2006 film jesus camp. WTFFFF Images and more information on the blog!https://cheerstoleaving.wordpress.com/\u0022There is a lot of psychological damage that follows when people are trained not to trust themselves\u0022-Valerie Tarico, child psychologist--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-10-19T04:28:59Z",
      "duration": "00:34:49.0640000",
      "explicit": false,
      "spotifyId": "08huAY79ddsloFNrC1t5ra",
      "appleId": 1000539019051,
      "subjects": [
        "Evangelicalism",
        "Jesus Camp"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/08huAY79ddsloFNrC1t5ra",
        "apple": "https://podcasts.apple.com/podcast/ep-14-jesus-camp/id1568302029?i=1000539019051"
      }
    },
    {
      "id": "aecdd1ca-9258-48e3-aeb6-5433bb58e4d5",
      "title": "Ep 13 How much room is there gonna be in Heaven?",
      "description": "TW: Rape. Having a chat with my sister about growing up in an evangelical household and how they kept us from talking and seeing each other for a few years because she “was rebelling against god.” We also talk about ghosts, reincarnation, Christianity equals control, and how sexual oppression will stunt you for years. Come along for the ride! --- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-10-04T17:00:49Z",
      "duration": "01:04:32.8350000",
      "explicit": false,
      "spotifyId": "4W2HAeH0fxCYx9eFbuoHF4",
      "appleId": 1000537512817,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4W2HAeH0fxCYx9eFbuoHF4",
        "apple": "https://podcasts.apple.com/podcast/ep-13-how-much-room-is-there-gonna-be-in-heaven/id1568302029?i=1000537512817"
      }
    },
    {
      "id": "9b1b1530-e87b-4c45-9a0a-d9434e73c09c",
      "title": "Ep 12 let’s talk about abortion",
      "description": "Well, the title is pretty self explanatory. I feel compelled to share my story to reduce the stigma surrounding abortion as well as bring awareness and hopefully help other women who have had one to feel better about it or safe to share their own stories. --- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-09-20T15:38:12Z",
      "duration": "00:59:06.4350000",
      "explicit": false,
      "spotifyId": "4lTWDTyIOnZG2yQxOW2m2Q",
      "appleId": 1000536034761,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4lTWDTyIOnZG2yQxOW2m2Q",
        "apple": "https://podcasts.apple.com/podcast/ep-12-lets-talk-about-abortion/id1568302029?i=1000536034761"
      }
    },
    {
      "id": "6746fa31-8a03-4bf4-975d-8ba510907232",
      "title": "Ep 11 Doctrine Over Person",
      "description": "Were you ever told your ear ache was the result of satan keeping you from hearing Gods word? Did you ever have a sinus infection as a child and were told that snot smell was your intuition that evil spirits were around? Well you’ve come to the right place cause SAME. My special guest Jennifer and I are talking about mental health and all the crazy shit surrounding it when it comes to the church. You’re not crazy bb just indoctrinated! Jennifer French is a mental health counselor with a specialty in cultic studies and religious trauma, located in Los Angeles and working with clients across the U.S. She will graduate in January 2022 with a Masters in the Psychology of Coercive Control from Salford University in the UK. Jennifer was herself in a group of high control, high demand (aka. cult) that was a mystical Christian based group called the Centers of Light or the Order of Christ/Sophia, located in cities across the United States. Jennifer is also the host of the Project Hope Podcast, for families and friends with a loved one in a group of high control / high demand. If you are interested in hearing more about the story of how Jennifer got into her cult and then left 11 years later, you will find these in episodes 1 and 2. https://www.jennifer-french.com/projecthopepodcast Follow Jennifer on social media at: Instagram: https://www.instagram.com/jennifer.french.jfh/ Facebook: https://www.facebook.com/jennifermonica.holcomb YouTube: https://www.youtube.com/channel/UCr6Ufd0I7My6dumbTpQwn8A/playlists Website: Jennifer-French.com--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-09-06T14:00:00Z",
      "duration": "02:02:47.8100000",
      "explicit": false,
      "spotifyId": "0jsEWxlXpi37TC2RJ9tr2m",
      "appleId": 1000534460289,
      "subjects": [
        "Evangelicalism",
        "Psychology",
        "Order Of Christ Sophia"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jsEWxlXpi37TC2RJ9tr2m",
        "apple": "https://podcasts.apple.com/podcast/ep-11-doctrine-over-person/id1568302029?i=1000534460289"
      }
    },
    {
      "id": "f0e158b3-bef5-42ef-ab16-d082035bd107",
      "title": "Ep10 God Hates Your Pants",
      "description": "I just want to apologize for the quality of the audio for this particular episode. We were having major internet issues. Anyway! Speaking with my long time friend and fellow exvangelical Candace about finding community outside of the church. We also touch on subjects like evolution/creationism, the 5 stages of grief and how that feels a lot like deconstructing. Come along for the ride!You can find Candace on Twitter https://twitter.com/candaceladdInstagram  https://www.instagram.com/candaceladd/--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-08-23T13:01:32Z",
      "duration": "00:56:11.4670000",
      "explicit": false,
      "spotifyId": "2v8JgOTyA8nAAZkApIUxQ4",
      "appleId": 1000532809807,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2v8JgOTyA8nAAZkApIUxQ4",
        "apple": "https://podcasts.apple.com/podcast/ep10-god-hates-your-pants/id1568302029?i=1000532809807"
      }
    },
    {
      "id": "aab8954b-30aa-41d1-9878-685515424cef",
      "title": "Ep9 Healthy Hoe",
      "description": "We have something to say about sexuality and the evangelical church. Did your parents give you “the talk” without actually talking about sex? Did you struggle with learning sex education and figuring out sexual encounters that DIDNT end in marriage in your 20\u0027s? Cool. Us too. Let’s talk about it. Pour yourself a drink and let’s talk about all things sex.Special Guest: Molly CrinoYou can find Molly on Instagram @ molly.crino \u0026 co-host of blazedth0tz_pdcst--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-08-10T05:28:53Z",
      "duration": "01:21:02.8240000",
      "explicit": false,
      "spotifyId": "3eM0eWCb5qNjhetHx0Roxq",
      "appleId": 1000531563600,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3eM0eWCb5qNjhetHx0Roxq",
        "apple": "https://podcasts.apple.com/podcast/ep9-healthy-hoe/id1568302029?i=1000531563600"
      }
    },
    {
      "id": "263d9d80-9c8a-4e69-9ef5-fa2cdfc2e736",
      "title": "Ep8 A Dictatorship State",
      "description": "This week we are talking about navigating relationships after leaving religion. The Bible and church created this weird zone of forced intimacy but also disconnection because everyone would betray their family or friends if God said to (i.e. Isaac and Abraham lolz) But now that we are out of that toxic space, navigating relationships without waiting for God or our pastor to tell us what to do is HARD. Its hard to reclaim autonomy after never having it and learning healthy relationship functioning after leaving. Grab your glass of libations, if you so choose to indulge, and lets talk about autonomy. --- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-07-27T15:19:04Z",
      "duration": "01:10:15.9800000",
      "explicit": false,
      "spotifyId": "5OWsU7y97K2eiffA172Af8",
      "appleId": 1000530178212,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5OWsU7y97K2eiffA172Af8",
        "apple": "https://podcasts.apple.com/podcast/ep8-a-dictatorship-state/id1568302029?i=1000530178212"
      }
    },
    {
      "id": "a3d9a75c-9d0e-4f77-9e4d-4e079b3157d4",
      "title": "Ep7 F*cked up books in the Old Testament",
      "description": "TW: Scripture reading. Rape. Child murder. This episode is a bit intense as far as content. But if you’ve read the Old Testament we’re sure that’s not news to you. We wanna talk about the fucked up shit in the Old Testament as far as actual verses where God kills children, violates women and ruins peoples perfectly good lives. You’ll probably need wine or whatever your choice of pleasure is for this one cause DEAR GOD how did we ever think this was all normal?Interesting video referenced in episode: https://www.facebook.com/BeXTheXEvolution/videos/831510247498147--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-07-13T05:38:22Z",
      "duration": "01:30:20.4600000",
      "explicit": false,
      "spotifyId": "6mZ0y80O1TrBJPhiGyoQjm",
      "appleId": 1000528698926,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6mZ0y80O1TrBJPhiGyoQjm",
        "apple": "https://podcasts.apple.com/podcast/ep7-f-cked-up-books-in-the-old-testament/id1568302029?i=1000528698926"
      }
    },
    {
      "id": "3b4ebae8-aa94-4b3e-9be6-895fe70be367",
      "title": "Ep6 The End Times - Apocalyptic Upbringing",
      "description": "It’s self explanatory. Are you familiar with the Rapture? Did you have rapture anxiety as a kid? Is Obama the antichrist? Did you read “left behind” for pure enjoyment? The end times be like “why are you so obsessed with me?” to evangelicals. Grab a margarita and let’s talk about this nonsense!--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-06-30T04:13:47Z",
      "duration": "01:09:36.2220000",
      "explicit": false,
      "spotifyId": "7H3NuuKuqZxATyVIerVWZ3",
      "appleId": 1000527317775,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7H3NuuKuqZxATyVIerVWZ3",
        "apple": "https://podcasts.apple.com/podcast/ep6-the-end-times-apocalyptic-upbringing/id1568302029?i=1000527317775"
      }
    },
    {
      "id": "886a7869-4dcb-445e-a406-a6f339879529",
      "title": "Mini Episode - Resources",
      "description": "We wanted to do a short episode on resources we found helpful in our deconstruction. We hope you find these helpful as well. Here is a link to our Blog where we will post all the links to these resources as well.https://cheerstoleaving.wordpress.com/Christina\u0027s Life Coaching Website: https://www.christinamcarlson.com/--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-06-21T15:04:54Z",
      "duration": "00:25:30.0960000",
      "explicit": false,
      "spotifyId": "6XcGKTrQQmUuptqS9jxcYK",
      "appleId": 1000526461558,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6XcGKTrQQmUuptqS9jxcYK",
        "apple": "https://podcasts.apple.com/podcast/mini-episode-resources/id1568302029?i=1000526461558"
      }
    },
    {
      "id": "ea6771af-659e-4c5d-9e75-6f84926ba6f9",
      "title": "Ep5 Changing Your Mindset",
      "description": "Christina and Rachael talk about how to change your mindset after years of indoctrination. It\u0027s hard, it\u0027s a process, and we\u0027re here for you! Let\u0027s talk simulations, our egos, pleasure, self care, lots of ice cream, and being aware of our own thoughts. We touch on being curious about ourselves as a first step in changing your mindset. So grab a glass of wine and drink with us as we discuss one of the hardest things we have ever done. Article Rachael mentioned by Jim Palmer: https://www.jimpalmerauthor.com/post/life-after-religion-deconstruction-deep-dive Christina\u0027s Website: https://www.christinamcarlson.com/ Religious Tree: http://the40foundation.org/world-religions-tree.html?fbclid=IwAR12oU1vJTF_DONf8bn1awxIsnPLGkTdDI09RhBYhFEy3JPrOVr9Psu8uQg IHOP Scandal: https://www.rollingstone.com/culture/culture-news/love-and-death-in-the-house-of-prayer-53866/--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-06-14T21:46:56Z",
      "duration": "01:13:56.6620000",
      "explicit": false,
      "spotifyId": "6gHg9fuUNOhNfpAYkBuYjh",
      "appleId": 1000526461557,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6gHg9fuUNOhNfpAYkBuYjh",
        "apple": "https://podcasts.apple.com/podcast/ep5-changing-your-mindset/id1568302029?i=1000526461557"
      }
    },
    {
      "id": "a4f9a1da-6e70-421f-81f6-9fc46500d64d",
      "title": "Ep4 Fears Surrounding Leaving",
      "description": "We\u0027re talkin fears this week as we take a more serious turn in our episodes. Rachael shares her fears surrounding death, and Christina shares her fears surrounding hell. We talk about the loss of community and identity and how IT DOES GET BETTER! Please reach out to us with any episode topic suggestions as well as your own personal stories regarding these different topics. We would love to hear from you!--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-06-01T15:51:01Z",
      "duration": "00:45:13.1550000",
      "explicit": false,
      "spotifyId": "0mBKMg2KMlqZIFsNTFnjdJ",
      "appleId": 1000526461559,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0mBKMg2KMlqZIFsNTFnjdJ",
        "apple": "https://podcasts.apple.com/podcast/ep4-fears-surrounding-leaving/id1568302029?i=1000526461559"
      }
    },
    {
      "id": "699d82d6-4fdb-4dd7-88e6-4f6457dc32b4",
      "title": "Ep3 Homeschooled",
      "description": "Christina and Rachael talk about being evangelicals AND homeschooled in this episode. Let’s talk homeschool curriculums, how homeschooling shaped our lives, things we learned (AND DIDNT LEARN) and how it has affected us as adults today. If you would like to hear us talk about a specific topic please message us on Instagram or Twitter. If you have a homeschooling story you\u0027d like to share please send us a message! We\u0027d love to hear from you.--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-05-17T13:38:53Z",
      "duration": "01:18:04.7730000",
      "explicit": false,
      "spotifyId": "6nYAmZnjrb9SjjeeJHiess",
      "appleId": 1000522365704,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nYAmZnjrb9SjjeeJHiess",
        "apple": "https://podcasts.apple.com/podcast/ep3-homeschooled/id1568302029?i=1000522365704"
      }
    },
    {
      "id": "20f76fa2-de64-4f92-8c90-ae2cd4021ce3",
      "title": "Ep2 Purity Culture Part 2",
      "description": "In this weeks episode we’re doing the second part of our purity culture conversation. Let’s keep talking about all the ridiculous things we had to do in purity culture days! Let’s talk modesty, Christian conferences, pastors telling their wives to be “hotter”, BRIO MAGAZINE, and much more. Grab a drink and come hang! Please find us on Instagram and Twitter and give us a follow! And slide in to our DMs with any ridiculous purity culture stories you have to share. We’d love to hear from you!--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-05-11T01:34:54Z",
      "duration": "01:05:01.5440000",
      "explicit": false,
      "spotifyId": "0kMzWiCDBWijGhN3notxvn",
      "appleId": 1000522365706,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0kMzWiCDBWijGhN3notxvn",
        "apple": "https://podcasts.apple.com/podcast/ep2-purity-culture-part-2/id1568302029?i=1000522365706"
      }
    },
    {
      "id": "ce68efd7-d896-4a7c-b244-5c872c57e250",
      "title": "Ep1 Purity Culture Part 1",
      "description": "This is our first episode! Welcome to our trauma! Christina and Rachael talk about how they define purity culture and how it fucked them up. We talk about sex, masturbation, Christian bands that promoted purity, and oppressing our individual personalities. Its a whole cesspool of topics and we are so excited to share it with you.--- Send in a voice message: https://anchor.fm/cheerstoleaving/messageSupport this podcast: https://anchor.fm/cheerstoleaving/supportSupport the showFacebook Suppport Group: Cheers to Leaving - Exvangelical Support Group | Facebook",
      "release": "2021-05-01T03:23:36Z",
      "duration": "00:51:58.1060000",
      "explicit": false,
      "spotifyId": "6ronoabW3o74LImlXlNCN8",
      "appleId": 1000522365705,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ronoabW3o74LImlXlNCN8",
        "apple": "https://podcasts.apple.com/podcast/ep1-purity-culture-part-1/id1568302029?i=1000522365705"
      }
    }
  ]
}