{
  "_ts": 0,
  "id": "69c01235-c776-4a55-9296-c3bc38bab2b4",
  "name": "Cheryl Rainfield",
  "youTubeChannelId": "UCC98GckkNHO8ewXNOZUn7uw",
  "episodes": [
    {
      "id": "6271683e-7e85-46c5-ba13-3a1c546e63e7",
      "title": "I had some body memories but it took me awhile to figure out that\u0027s what it was",
      "description": "TW: cult torture survivor. A few days ago I was having body memories of very specific torture that was done to me by the cult (more details in the video), but I was having trouble figuring out if it was body memory or not, because I used to assume that everything I felt in my body that didn\u0027t feel right was body memory because I was having trauma memories all the time, like nausea. But then I found out that some of the problems were physical (gluten intolerance, gall bladder, etc.) and so then I started assuming that everything was physical. But I think some is body memory and some is physical. I talked it through with a survivor friend and I think for me if it goes on for days and days and is a constant or is super intense or always happens around the same time like every night it\u0027s probably something to check out with a doctor. But if it comes and goes then it is likely body memory, especially if it is in specific areas where the torture was done and feels like the torture or responss I had to it. I may not have it right but it feels right for me for now. And I think it\u0027s always a good idea to check with a doctor. #cultsurvivor #traumatok #ramcoasurvivor #traumahealing",
      "release": "2025-03-21T22:00:25Z",
      "duration": "00:03:02",
      "explicit": false,
      "youTubeId": "wqhMLwIz0_M",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wqhMLwIz0_M"
      }
    },
    {
      "id": "52b1cd7b-5c90-4854-bd34-0231d00b4f97",
      "title": "reaching out can be hard and scary especially if you have trauma #cultsurvivor",
      "release": "2025-03-19T21:28:50Z",
      "duration": "00:01:37",
      "explicit": false,
      "youTubeId": "MF8N1KGafcE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MF8N1KGafcE"
      }
    },
    {
      "id": "04da6a4a-ccb4-4147-a077-00ae1327702d",
      "title": "Rain feels like the tears I can\u0026#39;t cry. #cultsurvivor #traumahealing #rainlover",
      "release": "2025-03-16T16:04:13Z",
      "duration": "00:02:12",
      "explicit": false,
      "youTubeId": "7VL-gkhzhtM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7VL-gkhzhtM"
      }
    },
    {
      "id": "578a3e74-dcde-4868-8261-a3a3a740addf",
      "title": "Doing rescue work with folks inside helps with healing #didsystem #cultsurvivor",
      "description": "TW: cult torture survivor. dDoing rescue work where I relive \u0026 witness the torture memory, then visualize saving parts of me that survived it, giving them reassurance and the opposite messages from cult, and then help those folks inside find new jobs they might want to do or new ways of thinking, helps me in my healing. and if you also are a cult torture Survivor and have DID maybe that would help you too. #cultsurvivor #ramcoa #didsystem #dissociativeidentitydisorder",
      "release": "2025-03-15T23:06:02Z",
      "duration": "00:04:19",
      "explicit": false,
      "youTubeId": "-Rbufs3Q1aw",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-Rbufs3Q1aw"
      }
    },
    {
      "id": "a038c465-a20a-4a7b-9195-bcc46d317e4d",
      "title": "It helps to challenge old messages #cultsurvivor #traumatok #ramcoa",
      "release": "2025-03-12T20:15:30Z",
      "duration": "00:01:47",
      "explicit": false,
      "youTubeId": "JOAzWYjrtuM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JOAzWYjrtuM"
      }
    },
    {
      "id": "8ebc4806-e019-4839-b903-d48c41277605",
      "title": "My cult abusers tried to make me like them but they couldn\u0026#39;t. #cultsurvivor",
      "description": "TW: cult torture survivor. \nWhen I was a child being tortured by my cult abusers, including my parents, I couldn\u0027t understand how they could enjoy and get off on my pain and my terror and that of the other kids. I still don\u0027t understand it. They were trying to make me like them, they were trying to mold me into their image and make me lack compassion and empathy and make me enjoy others\u0027 pain and they couldn\u0027t do it.\n\n I remember being about five maybe six, on an altar being r@ped and looking up at my r@pist, my abuser who was enjoying my pain and terror, who was getting off on it so much, and the cries of other kids being r@ped and tortured and abused, and thinking \u0022I will never be like you, I choose to be the opposite of you.\u0022 They tortured me more, they increased the mind control more, they forced me to do horrific things, but they couldn\u0027t make me like them, they couldn\u0027t take away my good soul. \n\nI kept splitting off parts of myself, some to do what they were forcing me to do so I wouldn\u0027t lose my innocence and my sanity, so that I could survive and live, but I also created parts of me to heal and work on healing, to try and get safe. \n\nThere were parts of me who would try and protect the other kids and even adults, protect them or help them in the ways that I could, and the cult could not stamp that out. Eventually they realized that and instead of trying to force me to be an abuser they kept putting me in the role of victim every time. But that didn\u0027t change it for me, my desire to get safe, my desire to heal, my desire to help others; they couldn\u0027t stamp that out. \n\nThey tried with everything in them; that included deliberate mind control and torture and skewed abuse scenarios, and they still couldn\u0027t do that, they still couldn\u0027t make me like them. That was true for me and for many other kids, though there were also many kids who did become like them and took their place or stood alongside them to enjoy torturing and murdering and r@ping other people. \n\nBut just because we\u0027ve been tortured or abused and deliberately put on the path of becoming like our abusers doesn\u0027t mean we become like them. We can fight back in all the ways we can, we can work on healing and getting safe, and then when we\u0027re safe we have even more choice and more ways to put good in the world and to protect ourselves and others. I hope you know that and you see that in yourself too. #cultsurvivor #traumatok #didsystem #dissociativeidentity #ramcoa",
      "release": "2025-03-10T19:57:20Z",
      "duration": "00:03:02",
      "explicit": false,
      "youTubeId": "iCk9QE6TP6M",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iCk9QE6TP6M"
      }
    },
    {
      "id": "76772d84-968d-419a-9db7-43d35da9f0e3",
      "title": "Because torture is something I experienced parts of me numb me #cultsurvivor #ramcoa #didsystem",
      "release": "2025-03-08T23:49:07Z",
      "duration": "00:02:46",
      "explicit": false,
      "youTubeId": "KOiiVZy2B8E",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KOiiVZy2B8E"
      }
    },
    {
      "id": "8ee5fe61-aae3-4caf-89fc-2f1f3510842a",
      "title": "Today is DID Awareness Day. #dissociativeidentitydisorder #cultsurvivor",
      "description": "TW: cult torture survivor. Today is Dissociative Identity Disorder Awareness Day or DID Awareness Day. DID is much more common than many people think, and you may know someone in your life who lives with it. I\u0027m Cheryl Rainfield, author of SCARS, STAINED, HUNTED, VISIONS, and I live with polyfragmented DID as a direct result of the cult torture that I survived as a child, as a teen, as an adult. The parts of me were created as a child and a teen, but some even in later years as the torture continued. DID is not crazy; it is a creative, intelligent way of coping with extreme, ongoing childhood torture and abuse and mind control, a way to escape when we couldn\u0027t physically escape, when there was no other way to escape except for splitting off parts in the mind. And that\u0027s a huge part of how I survived and how I kept my sanity and how I kept my good soul intact.\n\nFor me it\u0027s been really important to work on inner cooperation and inner communication, and working with other parts inside of me, making sure that I and all parts of me are aware that it\u0027s the present and what\u0027s going on in the outside world. So I don\u0027t lose time anymore, but I worked for a long time to do that, and to work with everyone inside. It also helps me to do rescue work with parts of me, to listen to when they were created and how they were created, like the abuse or torture event, and then to go back and visualize saving them from that and helping them learn a new job if the job or the role that they have is not healthy one. \n\nBecause I am a cult torture survivor, not all the parts of me were created by me; there are some parts of me that cult intentionally to have very specific jobs and roles that they wanted, like having parts of me who would deny the memories, the abuse and trauma, who would make me doubt it, would keep me from remembering or keep me from talking, or who would hurt me emotionally or physically. Those are very specific jobs that the cult created in me and wanted, and it is common for cult torture survivors who have DID to have some of those jobs or roles inside. It helps so much to work with those parts of us, and to see that they\u0027re not scary; they were created because they had to or the cult would have continued and increased the torture and mind control, so it was survival. So their root or their true role underneath it all Is to protect us and help us survive and get through. So when you know that it helps; it helps make it so much easier to work with them even though they can put up a tough facade.\n\n I hope that if you know someone who has DID that you will listen to their experience, because everyone\u0027s experience can be a little or a lot different, and also read a book about it, or watch some videos, or read some articles. It helps to have people who could hear in a real way. #didawareness #dissociativeidentitydisorder #cultsurvivor #multiplepersonalities #ramcoasurvivor",
      "release": "2025-03-05T23:32:04Z",
      "duration": "00:03:22",
      "explicit": false,
      "youTubeId": "_mKfjCUdHL8",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_mKfjCUdHL8"
      }
    },
    {
      "id": "b163355f-2665-435d-bb41-1b6aedbaa59d",
      "title": "A girl I read to is thinking of university. I couldn\u0026#39;t at her age I was just surviving #cultsurvivor",
      "release": "2025-03-04T20:37:00Z",
      "duration": "00:01:27",
      "explicit": false,
      "youTubeId": "ff1VD8EmxeA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ff1VD8EmxeA"
      }
    },
    {
      "id": "b36b4f20-ead1-4e0f-bece-9977ecc1863e",
      "title": "I\u0026#39;m so grateful for books, and the teachers and librarians who share them. #booklover #cultsurvivor",
      "release": "2025-02-28T19:23:20Z",
      "duration": "00:01:08",
      "explicit": false,
      "youTubeId": "s5Clb9jnPbg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=s5Clb9jnPbg"
      }
    },
    {
      "id": "223e8adb-7274-4b54-a41f-3e3e109e90e7",
      "title": "I hope that you listen to your gut #traumahealing #cultsurvivor #ramcoasurvivor #csasurvivor",
      "release": "2025-02-25T20:05:14Z",
      "duration": "00:00:34",
      "explicit": false,
      "youTubeId": "4_K1Ib8D5QU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4_K1Ib8D5QU"
      }
    },
    {
      "id": "030df83d-33a8-4137-8e7e-36232b2ec385",
      "title": "I hope you believe survivors  #cultsurvivor #ramcoasurvivor #believesurvivors #traumatok",
      "release": "2025-02-24T18:11:38Z",
      "duration": "00:02:25",
      "explicit": false,
      "youTubeId": "zax3Wd1dEik",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zax3Wd1dEik"
      }
    },
    {
      "id": "22433efc-2fe5-4e1d-a3f0-27bed4ad309e",
      "title": "The people who say \u0026quot;satanic panic\u0026quot; are using the same language my cult abusers did. #cultsurvivor",
      "description": "TW: satanic cult torture survivor.  The people that are saying that cult abuse is not real, that satanic cult abuse is not real, that it\u0027s all \u0022satanic panic\u0022 and conspiracy theories, and where\u0027s the evidence, are using the same language that our cult abusers used, and that abusers use, and that\u0027s not a side that I would want to be on. I\u0027m Cheryl Rainfield, author of SCARS, STAINED, HUNTED, VISIONS, and I am a satanic cult torture survivor as well as a survivor of the KKK and Nazi Cults and some other smaller ones. My parents were part of intergenerational, interconnected cults, and so were my entire extended family and many of their friends. I am lucky to be alive and I am grateful to be alive.  \n\nSo some people ask where is the proof? First of all I think you should believe survivors when we speak out; it is horrific and painful and hard to talk about and we are some of the most silenced survivors in society. People so often don\u0027t want to believe even rape; they have trouble believing cult torture. Many of us survivors have internal scarring, where it wouldn\u0027t show, where most people wouldn\u0027t see, but my doctor found it. I had gouges in my teeth from when my father and other abusers used dental tools on me for torture, which my dentist found, which I have now ground down because of how many years I\u0027ve been grinding my teeth. \n\nThere is the truth in our words, and our memories, and our trauma. I would not have DID, dissociative identity disorder, without haven\u0027t had to split off parts of myself to survive the torture and the mind control, and having my cult abusers specifically, deliberately create splits and parts of me to take on jobs that they wanted those parts of me to take on, like finding ways to hurt myself emotionally and shut myself up and keep myself quiet. Those are very standard jobs cult abusers give us. I would not have the c-ptsd, the trauma, the triggers that plague me almost every day, the triggers down to trauma memories, the debilitating way that trauma memories can take me over and the effects of trauma, so many effects of trauma everyday and every night of my life. I have shown so many signs of abuse and extreme abuse and torture my entire life, and teachers and other people were usually concerned but didn\u0027t understand what they were seeing and didn\u0027t recognize it. \n\nWhen we tell you that we have been through torture we mean actual torture - physical torture, sexual torture, psychological torture. Satanic cult abuse is real, and there are so many survivors. Cult abuse is real and there are so many survivors. I call it cult torture because it was torture. We are here and I hope that you believe us and I hope that you don\u0027t fall into the trap that abusers want you to and use the phrases \u0022satanic panic\u0022 or \u0022conspiracy theories\u0022 to talk about satanic cult torture survivors. Thank you for listening. #cultsurvivor #ramcoasurvivor #believesurvivors",
      "release": "2025-02-23T17:41:57Z",
      "duration": "00:03:23",
      "explicit": false,
      "youTubeId": "lyGMAkkkr9M",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lyGMAkkkr9M"
      }
    },
    {
      "id": "bb59385d-0f3c-4a88-bb9a-203f32c8ab1e",
      "title": "please believe satanic cult survivors and don\u0027t use the term satanic panic to try to discredit us",
      "description": "TW: satanic cult torture survivor.\nThere is a creator on tiktok, a fellow author, who is trying to discredit satanic cult survivors, saying that it is all \u0022satanic panic\u0022 and conspiracy theories, and that there was no evidence.\n\nYou may know me, I am Cheryl Rainfield, author of SCARS, STAINED, HUNTED, VISIONS, and I have been open since I was a teen about being a cult torture survivor. My parents and extended family were part of intergenerational, interconnected cults, and that included satanic, KKK, and Neo Nazi and some other smaller cults. This was incredibly organized and intentional. It was torture and mind control and trafficking. It was horrific and I\u0027m really grateful to be alive.\n\nI believe other survivors. I think it is so important to believe and hear other survivors. I think it\u0027s important to lift up voices of survivors. I know how hard it can be for people to hear and believe, to want to believe in our \u0022civilized\u0022 society that these horrific things happen. I think about how hard it is for so many people to believe a woman who\u0027s been raped, how many people try and tear her apart and say that she\u0027s lying, child sexual abuse survivors. Then you go to the extreme organized cult torture that happens in our society - people don\u0027t want to listen or believe, but it\u0027s real and it happens. There is proof.\n\nBut organized cults like this make it very hard persona virus to be believed and to see evidence but there is evidence. Go to website ra-info.org and also traumadissociation.com, and you will find links to and discussion about cases where they have found evidence of satanic cult abuse such as the McMartin case where they found tunnels and bones and cauldrons exactly where the kids of the daycare said they would be. That is eerily reminiscent of the tunnels that have been found under some Hollywood homes and extreme abuse that is very close to or is cult torture that is coming out about P Diddy and associates.\n\nI\u0027m going to talk about some detail about cult torture; it may be hard to hear and so if you don\u0027t want to hear please scroll away. One thing that cults do to try and destroy evidence and make sure that kids and teens and adults survivors when they speak out are not believed, is that they force us victims to ingest the flesh of people who were murdered, to get rid of a lot of evidence (and traumatize us more). It is done in many different ways including grinding up the bones.\n\nAnother thing that makes it harder for people to find evidence  is that in organized cult torture like I survived with satanic, KKK, and Nazi every person who is born assigned female at birth  or with a uterus is forced to bear a  child or children, usually multiple children, for the cult. The babies are usually born early, they are not registered in hospitals, they\u0027re not born in hospitals, they are born in cult settings and they are grown up to the age they are allowed to live. They are kept in cult settings only where they don\u0027t go to school, they don\u0027t have access to other things and then those kids are killed. That is a huge part of the murder that happens, the torture.\n\nThere are also a lot of people in positions of power; I remember police officers, social workers, judges, lawyers, doctors, and nurses, and they all worked in conjunction with each other so that there was as little possible evidence to be found, except of course in our bodies, and to help keep us silent. \n\nOrganized cults build on years and years of torture and mind control techniques to keep us silent, and so speaking out is so incredibly hard. I  hope that you can believe and hear survivors, and hold space for us even though it is so much pain and trauma. I think it\u0027s so important that we believe survivors, support survivors, and that we don\u0027t try and tear other survivors down.\n\n I\u0027m also very aware that in the organized cult torture, the satanic, KKK, and Nazi, that our abusers did sometimes dress up as police and doctors and nurses and teachers to try and make us be afraid of those people in positions of power and to keep us from talking. It was very intentional. But there were also cult members who had those professions in society.\n\nI don\u0027t believe that my cult abusers  actually believed in Satanism; I think they used the language and the clothing that they wore, and the religious artifacts, to try and discredit us more when we would actually talk because who wants to believe that? And to create more fear. And for Satanism they used Christianity in an upside down way and they used many of the same religious holidays and that makes it even more triggering for a cult torture survivors because there is a constant bombardment of language that is used in cult torture that is in our society and built into our society and our holidays.\n\n I hope you believe and listen to and support survivors and that you don\u0027t use phrases like satanic panic or conspiracy theories.\n\nThank you for hearing me. #cultsurvivor #ramcoasurvivor #believesurvivors",
      "release": "2025-02-23T00:44:41Z",
      "duration": "00:08:38",
      "explicit": false,
      "youTubeId": "EF79DZGa8Jg",
      "subjects": [
        "Cult Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EF79DZGa8Jg"
      }
    },
    {
      "id": "7646c721-9080-4add-a8c1-b8a508040eb8",
      "title": "I\u0026#39;m grateful to have #chosenfamily \u0026amp; safety; I didn\u0026#39;t growing up. #cultsurvivor",
      "release": "2025-02-22T21:52:18Z",
      "duration": "00:01:15",
      "explicit": false,
      "youTubeId": "5WiN-m9PE18",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5WiN-m9PE18"
      }
    }
  ]
}