{
  "id": "963a709a-2c87-4690-b8bd-d9eb59c9c732",
  "name": "Cheyenne Blue",
  "youTubeChannelId": "UC09d8sXefC_ha3vBdTlxhsw",
  "episodes": [
    {
      "id": "09db9cea-5aee-4f1f-8df3-187ae4e39b73",
      "title": "Jim Jones: The Disturbing Childhood of a Cult Leader | Before Jonestown (Part 1)",
      "description": "In November of 1978, the world witnessed one of the most shocking tragedies in modern history — the Jonestown Massacre. But before Jim Jones became the infamous cult leader behind over 900 deaths in Guyana... he was just a boy from Indiana.\n\nWho was Jim Jones before the Peoples Temple? What shaped him? And how does a kid obsessed with religion, death, and control eventually convince hundreds of people to follow him to their graves?\n\nIn this video, I’m diving deep into the childhood of Jim Jones — exploring his early life, family history, strange behavior, and the warning signs that were there long before Jonestown.\n\nThis is the beginning of a much bigger series I’m working on, unpacking the life, rise, and horrors of Jim Jones and the Peoples Temple. If you find true crime, cult psychology, and dark history fascinating — hit that like button, subscribe, and stick around.\n\nRelated Videos You Might Like:\n→ The Bloody Island Massacre: https://youtu.be/1dVvdMaCDkI\n→ Speed Freak Killers:https://youtu.be/w54FuXB4LSY\n\nSources \u0026 Recommended Reading:\nThe Road to Jonestown: Jim Jones and Peoples Temple — Jeff Guinn\n\nRaven: The Untold Story of Rev. Jim Jones and His People by Tim Reiterman\n\nSeductive Poison: A Jonestown Survivor\u0027s Story of Life and Death in the Peoples Temple — Deborah Layton\n\nA Thousand Lives: The Untold Story of Hope, Deception, and Survival at Jonestown — Julia Scheeres\n\nSuicide Cult: The Inside Story of the Peoples Temple Sect and the Massacre in Guyana  -- Marshall Kilduff \u0026 Ron Javers (1978)\n\nJonestown Institute (SDSU) Archive\nhttp://jonestown.sdsu.edu/\n\nFBI Vault on Jonestown: https://vault.fbi.gov/jonestown\n\nJonestown Institute Archives: http://jonestown.sdsu.edu/\n\nCombatting Cult Mind Control — Steven Hassan\n\nWho Was Jim Jones?\u0022 — Biography.com\nhttps://www.biography.com/crime/jim-jones\n\nPeople\u0027s Temple Audio Archive — Jonestown Institute\nhttp://jonestown.sdsu.edu/?page_id=27372\n\nHistorical Photos of Jim Jones\u0027 Childhood Homes (Indiana State Library Digital Archives)\nhttps://www.in.gov/library/collections/digital-collections/",
      "release": "2025-04-12T16:01:05Z",
      "duration": "00:33:49",
      "explicit": false,
      "youTubeId": "jRswbta2vNk",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jRswbta2vNk"
      }
    }
  ]
}