{
  "id": "ad3137f2-d5c8-4a87-ae56-7be7374ee7b3",
  "name": "Children Of Scientology",
  "youTubeChannelId": "UC5HhqTP8pDJrscbtmH-Dc8g",
  "episodes": [
    {
      "id": "455ee20f-99da-40c1-87f6-637d1f02e9a9",
      "title": "Inside Scientology\u0027s Child Trafficking: Mike Brown - Part 3 - with Christi Gordon \u0026 Mirriam Francis",
      "description": "Unveiling more Hidden Truths about Scientology Child Labor Trafficking, Brainwashing, and Family Dynamics in the Sea Organization, with Mike Brown. \n\nMirriam Francis and Christi Gordon, joined by Mike Brown, continue their Cadet Org series exploring what it was like to grow up in Scientology\u0027s Sea Organization. \n\nThey share insights about childhood trauma, including child labor, inhumane living conditions, brainwashing tactics, and torture.\n\nPart three is another eye-opening account centered around Mike\u0027s youth spent at the Sea Organizations secret International Base. \n\nMike shares some of Scientology\u0027s manipulative strategies that lead to frayed family relationships, emotional turmoil, terminated pregnancies, and divorce, and gives insights into Scientology\u0027s practices and policies that infringe upon basic human rights. \n\nHe shares intimate letters illustrating interference in communication between members to, weaponization of family, cruel and unusual control mechanisms, and shocking revelations about the organization\u0027s fear of the personal connections of members.\n\nExposing Scientology\u0027s manipulative tactics, the trio recounts the mental constraints introduced through childhood indoctrination, the control exercised over personal lives, and the damage done to relationships, as seen clearly through Mike\u0027s required marriage at age 18, the loss of his two unborn children, and his loving struggle to maintain contact with his wife. \n\nThe discussion reveals prominent figures\u0027 roles, particularly David Miscavige, the current leader, and his suppression of open discourse within the organization. \n\nThese fellow survivors of Scientology\u0027s child indoctrination share traumatic experiences and discuss the psychological and physical harm children suffered under this system that saw them as future assets rather than individuals. \n\nThis series aims to raise awareness around Scientology’s child grooming and indoctrination, child labor trafficking and exploitation, and what becomes of them, and their families.\n\nPlease follow Mike\u0027s channel here: @Mike Brown \n\n01:48 Tour of the GOLD Base\n02:27 Reality of Working Conditions at the GOLD Base\n07:37 Struggles of Young Love in the Sea Org\n09:46 Impact of Scientology\u0027s Policies on Relationships\n14:00 Decision to Leave the Sea Org\n16:13 Aftermath of Leaving the Sea Org\n35:16 Introduction to Financial Planning in the Sea Org\n35:30 Struggles of Maintaining Equipment\n36:00 Facing Accusations of Financial Irregularity\n36:41 Inefficiency of Sea Org\u0027s Management System\n37:13 Consequences of Misplacement in Roles\n38:01 Cognitive Dissonance within Sea Org Members\n38:21 Flaws in Sea Org\u0027s Organizational Structure\n38:54 Scandalous Suppressive Acts\n39:35 Struggle of Disconnecting from Scientology\n40:43 Journey of Leaving and Joining the Military\n41:54 Aftermath of Leaving Scientology\n47:56 Struggle of Reconnecting with Family\n48:36 Challenges of Starting Over\n51:42 Reality of Being Declared a Suppressive Person\n57:28 Attempts to Reconnect with Loved Ones\n01:00:57 Impact of Scientology\u0027s Control",
      "release": "2024-01-28T17:00:39Z",
      "duration": "01:07:24",
      "explicit": false,
      "youTubeId": "sqNgyBsOUAM",
      "subjects": [
        "Scientology",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sqNgyBsOUAM"
      }
    }
  ]
}