{
  "id": "88eb651c-bbba-4c20-92d2-4d5c1720553d",
  "name": "Children of Scientology presents: The Lighthouse Project Podcast",
  "spotifyId": "5lMeCy9rHUVNESorfx79v1",
  "appleId": 1685902489,
  "episodes": [
    {
      "id": "fa6554f4-15b2-4405-a99f-dbf7972f360d",
      "title": "#19 - People of the State of California vs Daniel Masterson: Scientology Enablers",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   Our last episode captured the moments immediately following the conviction of Danny Masterson, in which Christi, Victoria, and Mirriam began to process, digest, and discuss what this might mean for the Jane Does in this trial, as well as all Scientology victims of sexual assault.  For so many of us who were told that real justice would never be possible. We registered the verdict in ripples and emotional shock waves, marveling at how truly momentous and historical this outcome is.  In this episode, Christi and Mirriam are joined by Serge Del Mar, who has been a long-time advocate within our second-generation community.   Serge was born and raised in Scientology, and after surviving the unthinkable hell that is being a minor trapped there, is now a force to be reckoned with on his YouTube channel, https://www.youtube.com/@SergeDelMar which he created to combat the complicity of government, corporate media, and law enforcement.   Serge is recognized for delivering searingly informative dialogue, as he continues to shine a glaring spotlight on violations of human rights, including abuse and sexualization of children, labor trafficking, and much more, that occurs within Scientology organizations.   Together, we discuss the people who have enabled Danny Masterson and Scientology, as they committed horrific acts and were systematically relieved of any consequences for their crimes.  Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠  If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠⁠⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠⁠⁠  LINKS:   RAINN Hotline (800) 656.4673 ⁠⁠⁠⁠https://www.rainn.org/resources⁠⁠⁠  Scientology’s Toxic Family Dynamics:   https://www.youtube.com/live/HBJavWiivKM?si=KU-89NWG8ii24EX9  Serge and Christi discuss how Scientology breeds a toxic family dynamic, and the very real harm that results to its children and they read from the e-mail that Mirriam Francis received from her Scientology mother after Mirriam had asked her why nothing was done about the known sexual assaults she experienced; to address the trauma that she suffered as a child and why there were no consequences for her perpetrator.  Office of Special Affairs  https://en.wikipedia.org/wiki/Office_of_Special_Affairs  The Office of Special Affairs (OSA), formerly the Guardian\u0027s Office, is a department of the Church of Scientology International. According to the Church, the OSA is responsible for directing legal affairs, public relations, pursuing investigations, publicizing the Church\u0027s \u0022social betterment works,\u0022 and \u0022oversee[ing its] social reform programs\u0022.  OSA is the successor to the now-defunct Guardian\u0027s Office,[6] which was responsible for Operation Snow White and Operation Freakout; both are in Department 20 in the Scientology organizational chart. The most recent head of OSA International was Mike Rinder, who has since departed from the organization and criticizes it severely, appearing as a co-host on Leah Remini: Scientology and the Aftermath.[7]  In addition to regular staff, some church members also act as volunteer collaborators for the office, which cuts down on private investigation and legal research expenses.[9][10] Some volunteers participate under the notion that they receive special \u0022ethics protection\u0022.[11] In one case a volunteer who read critical information about Scientology on the internet was led to believe that he would be unable to continue receiving services unless he performed a series of investigations for OSA.[12]   Leaked OSA Volunteer List:  https://scientologymoneyproject.com/2023/08/30/2006-osa-western-us-volunteer-list/   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-10-08T19:00:00Z",
      "duration": "01:08:45.9530000",
      "explicit": true,
      "spotifyId": "0rbAKlPAKOnReSIgCWjOqU",
      "appleId": 1000630615749,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rbAKlPAKOnReSIgCWjOqU",
        "apple": "https://podcasts.apple.com/podcast/19-people-of-the-state-of-california-vs/id1685902489?i=1000630615749"
      }
    },
    {
      "id": "e003147a-2f33-4f40-b58e-e89bb8eb187d",
      "title": "#18 - People of the State of California vs Daniel Masterson: The Verdict ",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.  In our last episode, Christi and Mirriam broke down the ways in which Scientology really is a perfect hunting ground for predators, and described the environment that exists where there are no conventional protections in place for children.  We discussed the ways that Scientology continues to shift and evolve to evade actions against them in the court system, how they prevent justice for victims and what those of us who were raised in it are doing to change this. In this episode, Christi, Victoria and Mirriam react in live time, to the news of the guilty verdicts in the Danny Masterson trial, immediately following his conviction on two counts of forcible rape.  As we celebrate this outcome together, we ponder upon what this really means... for the Jane Does, for us, and for other Scientology victims. Our conversation meanders across memories, as we recount personal experiences along the way.  Christi closes with a heartfelt letter that she wrote for the Jane Does, which encapsulates our collective thoughts and feelings.   Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message   ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠⁠⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠⁠⁠ LINKS:   RAINN Hotline (800) 656.4673 ⁠⁠⁠⁠https://www.rainn.org/resources  ⁠⁠⁠#scientology #cultrecovery #exscientologist  #sptv  #ChildrenofScientology#podcast #truecrime #podcastlife  #mentalhealth #trauma  #survivor #mentalwellness  #activism  #dannymasterson  #courtroom #Exscientologykids #spkidstv  #metoo  #itstime  #justice  #spiritualabuse #raisedinacult #growingupinscientology #NOScientology4Kids#STOPScientology4Kids #PROTECTkidsfromScientology #ScientologyKILLSchildhood #ADULTSinsmallbodies #ScientologyDESTROYSfamily #Kidsofscientology #scientologyandtheaftermath #drugassistedassault     ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-09-17T19:00:00Z",
      "duration": "00:57:37.4280000",
      "explicit": true,
      "spotifyId": "2TNyQ16NLGKl6Z457vQ6CY",
      "appleId": 1000628176827,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2TNyQ16NLGKl6Z457vQ6CY",
        "apple": "https://podcasts.apple.com/podcast/18-people-of-the-state-of-california-vs/id1685902489?i=1000628176827"
      }
    },
    {
      "id": "2eca41cb-3da3-4c0f-a5e0-b6f9c213a775",
      "title": "#17 - People of the State of California vs Daniel Masterson: Scientology - The Perfect Hunting Ground",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   In our last episode, we were joined by Liz Gale, as we highlighted pieces from the closing statements by the prosecution in the Danny Masterson trial.   Deputy DA\u0027s Ariel Anson and Reinhold Mueller both shone a spotlight on Scientology as an organization that does not allow its members to report to law enforcement, where the victims are punished and the perpetrators are protected.   As Deputy DA Ariel Anson put it, what a better hunting ground. In this episode, Christi and Mirriam continue the conversation, breaking down the ways in which Scientology really is a perfect hunting ground for predators, where there are no conventional protections in place for children.   We discuss the ways that Scientology continues to shift and evolve to evade actions against them in the court system, that they continue to prevent justice for victims, and what those of us who were raised in it are doing to change this. Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠  If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠⁠⁠  LINKS:  The Shark Cage Metaphor:  A powerful way to understand more about our human rights, improve personal boundaries, and help us build or improve our alarm system. It\u0027s a great tool for education as it provides a visual framework. ⁠ ⁠https://www.thesharkcage.com/⁠   RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673 ⁠⁠⁠⁠https://www.rainn.org/resources⁠⁠⁠          ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-09-10T19:00:00Z",
      "duration": "00:42:26.2070000",
      "explicit": true,
      "spotifyId": "1cteUwMACvJgfPLBiI2yNO",
      "appleId": 1000627386723,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cteUwMACvJgfPLBiI2yNO",
        "apple": "https://podcasts.apple.com/podcast/17-people-of-the-state-of-california-vs/id1685902489?i=1000627386723"
      }
    },
    {
      "id": "2e0dca35-41fc-431e-927e-af958774d5e9",
      "title": "#16 - People of the State of California vs Daniel Masterson: Prosecution Closing Arguments ",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.  In our last episode with Danielle Ballou, we took a look at the testimony of Jennifer Ferencz, a criminologist at LAPD in forensic science, and toxicology. We discussed drugs that are used in the facilitation of sexual assault, symptomology, and why it is important to understand the wide range of effects these drugs can have. A good indicator that a person\u0027s drink has been spiked is if their symptoms are not consistent with what they knew to have consumed. We discussed some prevention and protection tactics and ways that a victim can be better supported in the event that this occurs.   In this episode, we are joined by Liz Gale, a badass third-generation Scientologist. Liz appeared in season two, episode three of Leah Remini; Scientology and the Aftermath. She has garnered a substantial following on TikTok and has recently published her first book titled Confessions of an Ex-Scientologist Pothead. Liz is recognized for her relatable humor, strong spirit, and honesty with which she talks about her personal experiences.   Together, we highlight pieces from the closing statements by the prosecution in the Danny Masterson trial and as always, we share pieces along the way from our own journeys so that we may continue to shed light on the abusive practices of Scientology.  Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠⁠  LINKS:  Liz Gale:  Book: Confessions of an Ex-Scientologist Pothead: Born in. Sparked up. Got out. https://amzn.to/3R5bJ1j Website: https://www.rusticandresourceful.com/ Tiktok: https://www.tiktok.com/@liz_liz_gale_gale Leah Remini - Scientology and the Aftermath - The Perfect Scientology Family - S2E3: https://tv.apple.com/us/episode/the-perfect-scientology-family/umc.cmc.tez3w0y9uahglihh0xu86ypi  The Shark Cage Metaphor:  A powerful way to understand more about our human rights, improve personal boundaries, and help us build or improve our alarm system. It\u0027s a great tool for education as it provides a visual framework.  ⁠https://www.thesharkcage.com/  RAINN explains what drug-facilitated sexual assault is and concisely details facts about this crime. ⁠⁠https://www.rainn.org/articles/drug-facilitated-sexual-assault⁠⁠   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-09-03T19:00:00Z",
      "duration": "00:40:47.5220000",
      "explicit": true,
      "spotifyId": "4H5twerVE0aULdVx1qAQZS",
      "appleId": 1000626626530,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4H5twerVE0aULdVx1qAQZS",
        "apple": "https://podcasts.apple.com/podcast/16-people-of-the-state-of-california-vs/id1685902489?i=1000626626530"
      }
    },
    {
      "id": "9345fad0-acc5-49f9-8084-99aa5e73122c",
      "title": "#15 - People of the State of California vs Daniel Masterson: LAPD Criminologist Testimony",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.  In our last episode with Danielle Ballou, we finished reading from the testimony of Jane Doe 2. This provided us with greater insight and understanding regarding some of her experiences within Scientology and the ways in which this affected and impacted her.  We acknowledge Jane Doe 2 for her strength and bravery in her pursuit of justice. And we reflect on our own experiences of growing up in Scientology. In this episode, Danielle Ballou joins us once again. This time, we take a look at the testimony of Jennifer Ferencz, a criminologist at LAPD in forensic science, toxicology.  Danny Masterson overpowered his victims by causing them to ingest an unknown substance, which would incapacitate them. So that the jury may hear facts about drugs used to facilitate sexual assault and understand more about their symptomology, the prosecution called Jennifer Ferencz, who has fifteen years of experience in toxicology. We dive into some of the history of the more well-known drugs used to facilitate sexual assault as well as other substances, including prescription medication.  We discuss symptomology and why it is so important to understand the wide range of potential effects of these substances. We also stress that a good indicator that a person\u0027s drink was spiked, is whether the symptoms presented are consistent with what the person knew to have consumed.  We discuss some prevention and protection tactics and ways that a victim can be better supported in the event that this occurs. Our aim is to be informative about this topic and so we cover a variety of facts and information in this episode.  Links:  Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠ RAINN explains what drug-facilitated sexual assault is and concisely details facts about this crime. https://www.rainn.org/articles/drug-facilitated-sexual-assault Alcohol.org surveyed over 900 people to determine the prevalence of drink or food spiking and then studied the experiences of over 200 respondents who’ve previously had drinks or food spiked to understand the scope of this issue today. https://alcohol.org/guides/spiked/  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-08-20T20:00:15Z",
      "duration": "00:55:00.9950000",
      "explicit": false,
      "spotifyId": "5kMhQ86xUW4ecrxXp6xWHa",
      "appleId": 1000625055510,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kMhQ86xUW4ecrxXp6xWHa",
        "apple": "https://podcasts.apple.com/podcast/15-people-of-the-state-of-california-vs/id1685902489?i=1000625055510"
      }
    },
    {
      "id": "e8ad883c-f6c0-4bb0-aafd-0f56a977caae",
      "title": "#14 - People of the State of California vs Daniel Masterson: Jane Doe 2 - Part 3",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   In our last episode, we were joined by Danielle Ballou who grew up in Scientology, as we continued with the testimony of Jane Doe 2. We noticed that Jane Doe 2 described Danny Masterson as being very commanding, that he was giving directives, not accepting her refusals, and repeating his commands. It seemed quite familiar to us, so we dove into the Upper Indoctrination TRS: training drills that teach a person to be able to control someone else\u0027s body, to make a person obey their commands, despite resistance; the same training that Danny Masterson had completed.   We also talked about the fear tactics and dangerous methods by which Scientology steers people away from getting real, beneficial, and necessary help. Christi and Victoria shared their positive experiences and observations on mental health treatments.  This episode is the second half of our chat with Danielle Ballou, in which we finish reading from the testimony of Jane Doe 2. We understand more about how Jane Doe 2 is impacted by the Scientology handling of the earlier rape that she experienced, and how this affected her, including causing her to not report to law enforcement immediately following the rape by Danny Masterson.   In her testimony, Jane Doe 2 defines OL (Opinion Leader) and says that it is a person of high status, who is valuable to Scientology. She states that if you are an OL, you have value to the church and they protect you. We discuss that in reporting on fellow Scientologists, some people are protected and others aren\u0027t, and that by writing a report you could become a target for investigation.   We find ourselves reflecting back on some of our experiences growing up in Scientology. We relate to the difficulties of social connection and intimacy after leaving Scientology. We discuss the decimation of friendships, disappearing kids and never being allowed to say goodbye, the purposeful isolation and punishments which were designed to make us stay in the Sea Org, and the painful reality of parental betrayal in the cover-up of crimes.  Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠⁠⁠⁠  If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠ Links:   Sea Org Executive Directive 3822 R INT, August 5, 1987 Knowledge Reports Campaign:  https://drive.google.com/file/d/1CKnstZzjNDtEnTqZ34jF_g7wYKELKyAb/view?usp=sharing  The Big List of Exes Who Have Spoken Out: https://whyweprotest.fandom.com/wiki/Former_Church_of_Scientology_members_who_have_spoken_out  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-08-13T22:00:00Z",
      "duration": "00:30:06.4420000",
      "explicit": true,
      "spotifyId": "1PmongbJZjkTZimcmGxhz5",
      "appleId": 1000624326041,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1PmongbJZjkTZimcmGxhz5",
        "apple": "https://podcasts.apple.com/podcast/14-people-of-the-state-of-california-vs/id1685902489?i=1000624326041"
      }
    },
    {
      "id": "90eb70d2-67ca-46a0-8d9b-540c1a4d936f",
      "title": "#13 - People of the State of California vs Daniel Masterson: Jane Doe 2 - Part 2",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.  In our last episode, we began to take a look at Jane Doe 2\u0027s testimony. We learned the circumstances of how she was brought into Scientology and about a prior rape she experienced by another Scientologist; a devastating and traumatic event, after which she was told by the Chaplain that it was not rape: \u0022We\u0027re not going to call it that.\u0022  The Chaplain showed her policies, which stated that a Scientologist cannot accuse another member in good standing of crimes, that you cannot externally go to law enforcement to report such crimes, and you cannot take legal action or else there would be personal consequences.  This shaped and affected how Jane Doe 2 dealt with the later rape by Danny Masterson.  In this episode, we are so pleased to be joined by Danielle (Dani) Ballou, who grew up in Scientology and is a treasured member of our second-generation community. We reflect on how powerful it feels to unite and compare notes after each being so isolated for so long, and how Scientology has tried so hard to prevent this from occurring.  Together, we pick up where we left off, as we continue with the testimony of Jane Doe 2, to better understand what she went through and what she was up against in her search for justice.  We notice that Jane Doe 2 described Danny as being very commanding, that he was giving directives, repeating his commands, and not accepting her refusals. It seemed quite familiar... we dive into the upper indoctrination TRS, which are the higher level drills that train the student to deliver commands to get a person to obey them and to practice and hone the skill of controlling another person\u0027s body.  This training is part of the TR\u0027s \u0026 Objectives course, which according to the internet, Danny Masterson has successfully completed.  We relate our own experiences with these training drills as children and recall the discomfort we experienced when we were made to do them with adults.  We discuss issues we shared trying to assimilate into the outside world when we left, and how it was often easier to return to the abuse we were familiar with, in Scientology, and the Sea Organization. Dani reflects on wishing she had left for good sooner, and how the final departure was due to the abuse her children were suffering. Christi shares regretting not taking her mother with her when she left.  Christi and Victoria relate their positive experiences with the mental health field, that while imperfect, how much it has helped them and their families recover after Scientology.  We wholeheartedly agree that the internet, ex-Scientology websites, and community resources helped us immensely on our journey out, and evolution to healing after being prevented from accessing this information while in.   Links:  Operation Clambake:  ⁠https://en.wikipedia.org/wiki/Operation_Clambake ⁠ Operation Clambake, referred to by its ⁠domain name⁠, xenu.net, is a ⁠website⁠ and ⁠Norway⁠-based ⁠non-profit organization⁠, launched in 1996, founded by ⁠Andreas Heldal-Lund⁠, that publishes criticism of the ⁠Church of Scientology⁠.   Truth About Scientology Data Base: https://www.truthaboutscientology.com/stats/by-name The index listings on these pages lead to completion lists for individual participants in Scientology.   Scientology calls a 2018 Second Generation Ex Scientology Gathering:  ⁠https://www.youtube.com/watch?v=sdhBopt00i0\u0026t=18s⁠  Tory Christman: Trailblazing Ex-Scientology Critic ⁠https://en.wikipedia.org/wiki/Tory_Christman https://www.instagram.com/torymagoo44/?hl=en⁠  Tristan Silverman: second-generation ex-Scientologist, slam poet ⁠https://www.youtube.com/watch?v=fuXO5LHBAKc⁠  Jamie DeWolf: L Ron Hubbard\u0027s great-grandson, performer extraordinaire  ⁠https://www.jamiedewolf.com/scientologyvideo/dewolf-makes-friends-with-scientology⁠  Kate Bornstein: Ex Sea Org member, critic, author ⁠ http://katebornstein.com/⁠ A Queer and Pleasant Danger Book: ⁠https://amzn.to/45e2foq⁠  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-08-06T19:00:00Z",
      "duration": "00:44:18.0570000",
      "explicit": true,
      "spotifyId": "4fOq49OjcaQyfKdkrLduN7",
      "appleId": 1000623584012,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fOq49OjcaQyfKdkrLduN7",
        "apple": "https://podcasts.apple.com/podcast/13-people-of-the-state-of-california-vs/id1685902489?i=1000623584012"
      }
    },
    {
      "id": "06e2e8ee-2ca8-409d-b8fd-751252c56ba3",
      "title": "#12 - People of the State of California vs Daniel Masterson: Jane Doe 2 - Part 1",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   In our last episodes, we spoke with Claire Headley regarding the powerful expert witness testimony she provided in this trial. We discussed the systems of Scientology, including language, policies and practices used to control members which prevent them from reporting crimes to law enforcement.  In this episode, we begin to look at Jane Doe 2\u0027s testimony to better understand her experience, what she went through, and what she was up against in her search for justice. We learn about how she came to be in Scientology, as a means to address her anxiety. We examine the competing force of Scientology against Psychology and how this prevents people from getting real help for mental illness.  We read the testimony that Jane Doe 2 gave about a prior rape she experienced by another Scientologist and what followed; the reframing and threat of consequences. We discuss some of what expert witness Dr Ziv testified to in this trial, regarding the way victims commonly react to sex assault, and add to that, the efforts of Scientology to suppress the rape Jane Doe 2 knew she\u0027d experienced.  We relate to Scientology\u0027s handling of our own experiences with mental health issues, creating intentional stigma around mental health care, psychology, psychiatry, and anything other than Scientology treatment.  We discuss Scientology\u0027s anti-psychiatry front group: CCHR - Citizens Commission on Human Rights, Mirriam relates to taring the roof of its Hollywood CA museum, as Sea Org children, when assigned to hard manual labor for wanting to leave the Sea Org, a very lengthy and laborious process.  Victoria grapples with confusion \u0026 hurt around her brother\u0027s treatment of her, loyalty to Scientology over her, and her field auditor, whom she thought of as a mother, not providing her real help when she was self-harming suicidal after being drug raped, instead providing her Scientology only.  We agree our Scientology abusers and witnesses of our abuses, are also victims of Scientology, and so we must navigate compassion \u0026 empathy since most never apologize, or seek forgiveness.   We compare thoughts on Scientologists behaving as though they have a virus or addiction that overwhelms their sense of self, autonomy, ability to see right from wrong and act in their own accord, while they\u0027re led to believe, and behave as if they are doing the opposite: being free thinking, self-determined, and helping.   We conclude a real danger of Scientology is its ability to use well-meaning members to perpetrate harm, and fraud on others.  Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message⁠ ⁠⁠⁠⁠⁠⁠⁠ If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠ ⁠⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠   TOOLBOX:  Fair Game: The incredible untold story of Scientology in Australia - September 19, 2016 by Steve Cannane: ⁠⁠⁠⁠⁠⁠https://amzn.to/3Pplgj7⁠⁠ FAIR GAME: a policy by which enemies of Scientology can be, according to L. Ron Hubbard, ‘deprived of property or injured by any means by any Scientologist without any discipline of the Scientologist. May be tricked, sued, lied to, or destroyed.’. Walkley Award-winning journalist Steve Cannane tells for the first time the fascinating story of Australia’s vital involvement with this powerful, secretive, and punitive cult.   LINKS:  Scientology front group: CCHR - Citizens Commission for Human Rights: ⁠ ⁠https://www.cchr.org/about-us/cchr-industry-of-death-museum.html⁠ ⁠⁠⁠https://www.cchr.org/ban-ect/⁠  RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673: ⁠⁠⁠⁠⁠https://www.rainn.org/resources⁠   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-07-31T01:02:48Z",
      "duration": "00:37:25.7870000",
      "explicit": true,
      "spotifyId": "037JF5VqK7Rk8K4amJZ1oI",
      "appleId": 1000622869276,
      "urls": {
        "spotify": "https://open.spotify.com/episode/037JF5VqK7Rk8K4amJZ1oI",
        "apple": "https://podcasts.apple.com/podcast/12-people-of-the-state-of-california-vs/id1685902489?i=1000622869276"
      }
    },
    {
      "id": "38f1f0ab-42e7-4c75-b6e5-46691515d7ac",
      "title": "#11 - People of the State of California vs Daniel Masterson: Scientology Expert Witness - Claire Headley - Interview Part 2",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   In our last episode, we began our discussion with expert witness, Claire Headley, in relation to the testimony that she gave when she was called to the stand by the prosecution in the Danny Masterson trial, to answer questions about the policies and practices of Scientology.   We examined some of the aspects of Scientology, which by design trap and systematically continue to confine a person, keeping any potential resources out of reach and further preventing them from getting help.   In this second part of our chat with Claire, we focus on the system of Scientology, including channels of communication and reporting, types of reports, and the collection and management of information on a mass scale.   We define three separate computerized systems, the type of information they contain, who they are accessible to, and how that information is used, including against members on public internet hate sites created to discredit members who leave and speak out about the abuses they experienced and witnessed.   Meanwhile, when records requests are made by authorities/courts, Scientology denies maintaining extemporaneous records on members, or claim protection by priest-penitent privilege, even from members themselves, and members confessions are the sole property of Scientology.  We acknowledge the impacts that Claire Headley has had through providing the facts on Scientology\u0027s policies and practices in this trial and beyond that, her efforts which have helped to expose the abuses of Scientology. If you enjoy this podcast and our content, please like/follow/share, or support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠⁠  Jump into the convo - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠⁠⁠⁠  LINKS: Claire Headley Expert Testimony Trial Notes: ⁠https://tonyortega.substack.com/p/claire-headley-testifies-danny-masterson⁠ Scientology information gathering sites: Religious Technology Center Information Gathering System: https://www.rtc.org/reports/form/index.html?locale=enhttps://www.rtc.org/index.html https://drive.google.com/file/d/123vqqt4sUeBfVeCLscgpy5NALsL3Zb7n/view  International Network of Computer Organized Management INCOMM: Tom Rummelhart, a Scientologist and computer operator responsible for some of the maintenance of the Church of Scientology\u0027s INCOMM computer system leaks documents onto the web.  https://en.wikipedia.org/wiki/Penet_remailerhttps://www.spaink.net/cos/rnewman/anon/penet.htmlhttp://www.xenu-directory.net/mirrors/www.whyaretheydead.net/krasel/INCOMM.html#-AB- Blown for Good:  Behind The Iron Curtain of Scientology⁠- ⁠Headley worked at Scientology’s secret desert compound, which houses all Scientology management, for 15 years. The 500-acre property is located deep in the California desert. The local townspeople were told lectures and films were made there. But is that all that was happening? It is the location of a multi-million dollar home for L. Ron Hubbard, built two decades after his death. It is the home of Scientology’s current leader, David Miscavige. So what really happens at the Int Base? Could stories of armed guards, weapons, staff beatings, and razor wire fences be true? If so, how could a facility like this exist in modern-day America? Hundreds of staff tried to escape over the years. Some succeeded but were never seen or heard of again, and most failed. Why were people kept here?  This is the story of what happened behind the Iron Curtain of Scientology.  Book: ⁠https://amzn.to/3NKPsCO⁠ Podcast: ⁠https://amzn.to/3pQjxcb⁠ YouTube channel: ⁠https://www.youtube.com/@blownforgood  The Bad Cadet: https://amzn.to/3NWoaJC  LARA FM: https://www.youtube.com/@LaraAndersonOfficial   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-07-23T17:00:00Z",
      "duration": "00:50:41.8370000",
      "explicit": true,
      "spotifyId": "0EANIVG9WRg88KwO4iPKH9",
      "appleId": 1000622058280,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0EANIVG9WRg88KwO4iPKH9",
        "apple": "https://podcasts.apple.com/podcast/11-people-of-the-state-of-california-vs/id1685902489?i=1000622058280"
      }
    },
    {
      "id": "3d25bc48-b834-4fa9-8f5e-9817aa648475",
      "title": "#10 - People of the State of California vs Daniel Masterson: Scientology Expert Witness - Claire Headley - Interview Part 1",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.  In our last episode, we took a look at the testimony of expert witness, Claire Headley, who was called to the stand by the prosecution in the Danny Masterson trial, to answer questions about the policies and practices of Scientology. Through her testimony, Claire described aspects of the Scientology ethics and justice system, including methods of internal reporting. She confirmed that members are disallowed to report crimes to outside authorities or suffer Scientology penalties.   In this episode, Claire Headley joins us to talk about her experience of giving that testimony. We are so pleased to have the opportunity to dive a little deeper with her and shed more light on this insular system, in which each of us grew up in. We discuss the structures and confines, which by design kept us quiet, controlled, and trapped, and some of the turning points in our stories.  We talk about the needs of a victim, that they must first feel safe before they can begin to really process what has happened to them, and we reflect on the process of getting out of this high control group, with emphasis on the necessity of access to basic and essential resources. We touch on the incredible value of the public platforms survivors are now using to help spread awareness, as well as tell their own story in their own way, in full or in part, vs the selective and very limited opportunities we have navigated until now.  We compare notes on each of our decisions to step forward and share our stories, and reflect on what a personal decision this is for each person, that they must make on their own, once they\u0027re ready, and they feel safe enough to do so.   Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠⁠⁠  If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠  LINKS:  Claire Headly Expert Testimony Trial Notes: https://tonyortega.substack.com/p/claire-headley-testifies-danny-masterson  A Childhood in Scientology video: Human trafficked, for child labor, at 4 years old, trapped for 30 years, before escaping. : https://youtu.be/WLlc-XJ0SFQ?t=147  Blown for Good: Behind The Iron Curtain of Scientology- Headley worked at Scientology’s secret desert compound, which houses all Scientology management, for 15 years. The 500-acre property is located deep in the California desert. The local townspeople were told lectures and films were made there. But is that all that was happening? It is the location of a multi-million dollar home for L. Ron Hubbard, built two decades after his death. It is the home of Scientology’s current leader, David Miscavige. So what really happens at the Int Base? Are the stories on the internet true? How does Scientology conduct management of its day-to-day operations? Could stories of armed guards, weapons, staff beatings, and razor wire fences be true? If so, how could a facility like this exist in modern-day America? Hundreds of staff tried to escape over the years. Some succeeded but were never seen or heard of again, and most failed. Why were people kept here? What really went on at the headquarters of Scientology? This is the story of what happened behind the Iron Curtain of Scientology.  Book: https://amzn.to/3NKPsCO Podcast: https://amzn.to/3pQjxcb YouTube channel: https://www.youtube.com/@blownforgood  Scientology \u0022Consultant/Founder Advices\u0022 (L Ron Hubbard) examples:  \u0022CMO ED 411, RE: Cadet Org\u0022: https://drive.google.com/file/d/1RvNA-VdMFXpL9bwDyriO0trUiXhQrURG/view?usp=sharing  Aides Order 203-71 PAC Cadet Org/Cadet Estates Org Establishment Eval: https://drive.google.com/file/d/1oPar5gGpDncMCFwUAGXsRLUSUx_qop-o/view?usp=sharing  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-07-16T16:11:06Z",
      "duration": "00:49:26.9990000",
      "explicit": true,
      "spotifyId": "2hdHJSosMe8DlrKEEMLkNQ",
      "appleId": 1000621306155,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2hdHJSosMe8DlrKEEMLkNQ",
        "apple": "https://podcasts.apple.com/podcast/10-people-of-the-state-of-california-vs/id1685902489?i=1000621306155"
      }
    },
    {
      "id": "828dd140-ab16-4150-8418-cceea0afa07c",
      "title": "#9 - People of the State of California vs Daniel Masterson: Scientology Expert Witness - Claire Headley - Testimony ",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   In this episode, we focus on the expert testimony of Claire Headley, who was born and raised in Scientology. At the age of sixteen, she was thrust into the Religious Technology Centre, and eventually became one of the top executives in Scientology, just beneath David Miscavige, Scientology\u0027s current leader.  We relate to the triggering language Deputy Attorney Ariel Anson asks Claire to define, \u0022victim\u0022, \u0022handling\u0022 and good standing\u0022 and relate to our own experiences being intimidated by them as children.  Christi shares her mother\u0027s obsessive self-policing, writing reports on herself, when struggling, after achieving the highest processing level of Scientology at that time- Operating Thetan 7- but not experiencing the promised life improvements, unable to support herself, and her children, instead spiraling into psychosis.  Victoria recalls her brother insulting her by calling her a \u0022victim\u0027s advocate\u0022 when she believed a child victim who claimed Victoria\u0027s brother had had inappropriate contact with her.  Claire describes Scientology justice, and confirms members are disallowed to report crimes to outside authorities, or suffer Scientology penalties, including being ex-communicated, and declared a suppressive person.  We read from a Non Enturbulation Order (gag order) issued on a second generation member, raised in the Sea Organization, who spent many years on its prison program, the Rehabilitation Project Force, before he was ultimately declared Suppressive.  We share how honored, and excited we are that Claire Headley will be a guest on our next episode. We hope you\u0027ll tune in.   Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠⁠⁠  If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠  LINKS:  Scientology \u0022Consultant/Founder Advices\u0022 (L Ron Hubbard) examples:  \u0022CMO ED 411, RE: Cadet Org\u0022: https://drive.google.com/file/d/1RvNA-VdMFXpL9bwDyriO0trUiXhQrURG/view?usp=sharing Aides Order 203-71 PAC Cadet Org/Cadet Estates Org Establishment Eval: https://drive.google.com/file/d/1oPar5gGpDncMCFwUAGXsRLUSUx_qop-o/view?usp=sharing Non- Enturbulation Order of a second generation Scientologist: https://drive.google.com/file/d/1QFzptO4QeDCMp8d91Z8NlkiKC3m_PqoM/view?usp=sharing Suppressive Person Declare of a second generation Scientologist: https://drive.google.com/file/d/1U9siwyp8aN-mfglDxcUv7sqPEAuSZB0Y/view?usp=sharing  RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673: ⁠⁠⁠⁠⁠https://www.rainn.org/resources⁠  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-07-03T22:00:20Z",
      "duration": "00:35:16.1970000",
      "explicit": true,
      "spotifyId": "4Va5XVq99yqDgR4ExrjJNK",
      "appleId": 1000619186495,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Va5XVq99yqDgR4ExrjJNK",
        "apple": "https://podcasts.apple.com/podcast/9-people-of-the-state-of-california-vs/id1685902489?i=1000619186495"
      }
    },
    {
      "id": "1a016ec0-9a26-428b-9918-87c9bd9cda67",
      "title": "#8 - People of the State of California vs Daniel Masterson: Letter from Jane Doe 1\u0027s Mother to David Miscavige ",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.  This episode includes descriptions and graphic details of rape as we read from a leaked internal letter Jane Doe 1\u0027s mother wrote to Scientology leader, David Miscavige, as she tries to escalate \u0022handling\u0022 Danny Masterson\u0027s rape of her daughter, using Scientology\u0027s own incredibly detailed notes from interrogations of Danny Masterson, and Luke Watson and their changing stories.  In Scientology speak, she explains her understanding of what happened to her daughter, being forced to accept blame, and being sold very expensive \u0022security checks\u0022 (metered interrogations) so that she could take full responsibility for her violent rape, and near-death experience.   She was angered by what she perceived as mishandling of the reported rape, and requested David Miscavige put a stop to the actions taken by Scientology officials, which she described as \u0022squirrelly\u0022; not in line with standard technology, and not a correct use of Scientology practices.  We compare the tv docu-series \u0022Shiny Happy People\u0022 to Scientology, reflect on Scientology as a system, confining its members to its own language, and internal procedures, in which you must refer to the policy before offering an opinion, where the individual\u0027s voice is reduced and restricted, and how this comes through in this letter. We draw on our experiences of the effects of Scientology\u0027s practices on the inhibition of emotion and our lack of awareness of our personal boundaries and rights.   Jane Doe 1\u0027s mother hasn\u0027t realized yet, this is the way that Scientology treats crimes - victims are blamed \u0026 punished, not perpetrators. Her adherence to Scientology keeps her in this closed system rather than involving law enforcement or providing testimony in this trial. Thanks to this letter, we now understand more of Scientology\u0027s continued efforts to threaten, silence, and control Jane Doe 1, and how David Miscavige was fully involved and aware.   Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠⁠  If you enjoy this podcast and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here:⁠⁠ ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠  TOOLBOX:   Steven Hassan\u0027s: Combatting Cult Mind Control, provides further insight into the topics discussed in this episode, and supplies an array of information outlined in the book\u0027s description: As you read this book, you learn to develop, use, and trust your critical thinking skills; intuition; bodily and emotional awareness; ability to ask the right questions; and skill at doing quick, useful research. You will also learn to create a healthy balance of openness \u0026 skepticism. As you will see, the entire process begins and ends with discernment. https://amzn.to/3Xi5Fnx  LINKS:  Letter from Jane Doe 1\u0027s Mother: ⁠https://leahremini.substack.com/p/david-miscavige-knew-danny-masterson?utm_source=profile\u0026utm_medium=reader2⁠  Letter from International Justice Chief, Mike Ellis to Jane Doe 1: ⁠https://tonyortega.org/2020/12/24/whoops-letter-shows-scientology-gave-jane-doe-1-permission-to-sue-danny-masterson-in-2004/  Shiny Happy People: Duggar Family Secrets: The series explores the dark secrets of the Duggar family, and investigates Josh Duggar\u0027s conviction for knowingly receiving and possessing child pornography, and the family\u0027s ties to the Institute in Basic Life Principles and its controversial leader Bill Gothard, showing how the organization has influenced the Duggars, and the influence of Christian youth organizations. https://amzn.to/3XgiJcI  RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673: ⁠⁠⁠https://www.rainn.org/resources⁠  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-06-25T20:54:55Z",
      "duration": "00:54:53.6340000",
      "explicit": true,
      "spotifyId": "3SgNzFfyZg5Wh41lbsX6Ca",
      "appleId": 1000618270790,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3SgNzFfyZg5Wh41lbsX6Ca",
        "apple": "https://podcasts.apple.com/podcast/8-people-of-the-state-of-california-vs/id1685902489?i=1000618270790"
      }
    },
    {
      "id": "a04b346a-acfa-4642-9573-e63cf7a0296f",
      "title": "#7 - People of the State of California vs Daniel Masterson: Jane Doe 1 - Part 2",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   In this episode, we continue our discussion about testimony of Jane Doe 1 who was born into Scientology, as she described what happened after she first reported that Danny Masterson had raped her and the very specific and controlled actions she went through in an attempt to change her understanding of what happened, to force her to accept blame, and to take responsibility for what had happened to her. We continue learning about what Jane Doe 1 went through and how the situation escalated to involve more Scientology officials after Jane Doe 1\u0027s mother wrote a letter to the leader, David Miscavige urging him to step in and take action. We understand more of what Jane Doe 1 was up against and how tenacious she was in her persistence for justice and how the Scientology continued their attempts to threaten, silence and control her. We discuss the meaning of a non-enturbulation order and Mirriam shares her own personal experience with having been put under one at fifteen years old, disconnection and the threat of disconnection as well as the parent-child relationship in Scientology. We draw on some stories from our own lives.  Victoria relates to Jane Doe 1\u0027s testimony of endless interrogations and tells her heartbreaking story of her experience as a child while undergoing these same actions. We discuss what Scientology sells and what it actually delivers and the ultimate impact that it can have on people\u0027s lives.  We draw correlation between the Jane Doe\u0027s testimonies in this trial and other cases, which Amanda and Christi read to us from articles. We hear the same patterns, the same words and the same tools used against these victims by Scientology.   Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠⁠⁠  If you enjoy this podcast, and our content, please like, follow, and share. You can support our efforts by following Children of Scientology on social media, or here: ⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠  Links to things we referenced:  The Body Keeps the Score, a book by M.D. Bessel van der Kolk, psychiatrist, author, researcher, educator based in Boston, United States, researching post-traumatic stress since the 1970\u0027s. Many informative YouTube videos with easy to understand concepts, and a compassionate approach to healing. Highly recommend for anyone who wishes to understand more about trauma and recovery: https://amzn.to/43yRfl8  The Bad Cadet by Kathryn Spallino (second generation born into the Sea Organization): https://amzn.to/42AqLhT  Degraded Daughters of Dianetics YouTube Channel (second generation born into Scientology): https://youtu.be/_pbkCxbcyL0  Letter from Jane Doe 1\u0027s Mother: https://leahremini.substack.com/p/david-miscavige-knew-danny-masterson?utm_source=profile\u0026utm_medium=reader2  Letter from International Justice Chief, Mike Ellis to Jane Doe 1: https://tonyortega.org/2020/12/24/whoops-letter-shows-scientology-gave-jane-doe-1-permission-to-sue-danny-masterson-in-2004/  Tampa Bay Times: Scientology policy enabled Years of Child Sexual Abuse: https://www.tampabay.com/news/clearwater/2019/09/19/scientology-policy-enabled-years-of-child-sexual-abuse-lawsuit-says/  State of Florida v. Donald Anthony Strawn (second generation Scientologist): https://www.shipbrook.net/jeff/CoS/strawn/⁠⁠⁠⁠ Scientology Disconnection in Action: https://youtu.be/xYSj7yhSqrg  Scientology Non-Enturbulation Orders:  Creed Pearson: https://drive.google.com/file/d/1QtzvHpSka-OlF-HpCyXcQdMDfOerd_0H/view?usp=sharing Tony DePhillips: https://drive.google.com/file/d/1NPTHR4W4ZUZHEHzXjenPYGw8BmMjaqPF/view?usp=sharing  RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673: ⁠⁠https://www.rainn.org/resources⁠  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-06-20T14:21:23Z",
      "duration": "00:57:44.1850000",
      "explicit": true,
      "spotifyId": "7unADjou3E8T72Yl1unckh",
      "appleId": 1000617727806,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7unADjou3E8T72Yl1unckh",
        "apple": "https://podcasts.apple.com/podcast/7-people-of-the-state-of-california-vs/id1685902489?i=1000617727806"
      }
    },
    {
      "id": "2ae583f1-e170-4914-ae29-fd7ecffe8414",
      "title": "#6 - People of the State of California vs Daniel Masterson: Jane Doe 1 - Part 1",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   In this episode, we take a look at the testimony of Jane Doe 1 who was born into Scientology. She experienced two incidents of sexual assault by Danny Masterson, one of which is charged as forcible rape in this trial.  As we read through her testimony, we see the dynamic of the institution empowering the predator, as Danny seeks revenge in the second incident. And we learn what happens to Jane Doe 1 after she first reports the rape in Scientology and what comes to bear on her to reframe and reshape what happened to her; how she is blamed, silenced and controlled.   Victoria talks about the Scientology\u0027s Code of Honour which instills the idea that upholding Scientology\u0027s moral codes and principles is more important than one\u0027s immediate life and how this may lead people to sacrifice their own values for the cause.  We discuss Scientology concepts as they arise, such as \u0022motivator\u0022 and \u0022the greatest good for the greatest number of dynamics\u0022, the ways that L. Ron Hubbard\u0027s study technology enforces a person to \u0022understand\u0022 and the Conditions of Existence, especially the condition of Confusion which Jane Doe 1 is assigned.   We talk about how in Scientology there is a constant, overarching sense of urgency to save the world and that this is clearly visible in the policy Keeping Scientology Working or KSW.   Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠⁠  If you enjoy this podcast and our content, please like, follow, and share. You can also support our efforts by following Children of Scientology on social media, or here: https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠  Links to things we referenced:   Introduction to Scientology Ethics; Conditions Below Non-Existence (Lower Conditions):  https://sup.scientologycourses.org/courses-view/conditions/step/read-conditions-below-non-existence.html  The Code of Honor:  https://www.scientology.org/what-is-scientology/the-scientology-creeds-and-codes/the-code-of-honor.html  Keeping Scientology Working:  https://aogp.docdroid.com/R6eDvvb/keeping-scientology-working-1-pdf  LRH Command - Five Years: https://drive.google.com/file/d/1lq_opgMVRgCuSMDC3LuqC5kTO92VdDwV/view?usp=sharing⁠  RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673: ⁠https://www.rainn.org/resources   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-06-12T12:10:37Z",
      "duration": "00:59:09.2860000",
      "explicit": true,
      "spotifyId": "1SESnvHBFvvSsdDPexmXIZ",
      "appleId": 1000616650472,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1SESnvHBFvvSsdDPexmXIZ",
        "apple": "https://podcasts.apple.com/podcast/6-people-of-the-state-of-california-vs/id1685902489?i=1000616650472"
      }
    },
    {
      "id": "ba2a8468-aac6-4547-aa4d-58977d55f9b9",
      "title": "#5 - People of the State of California vs Daniel Masterson - Sexual Assault Expert Dr Ziv - Part 2",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   In our last episode, we focused on the expert witness testimony of Dr. Barbara Ziv who is a forensic psychiatrist specializing in sexual assault. She talked about the common myths and misconceptions that relate to sexual assault and rape and the counterintuitive ways that a victim might react. She emphasized that most instances of sexual assault are done by someone known to the victim.  In this, our fifth episode, we continue our examination of Dr. Barbara Ziv testimony, covering such topics as reasons a victim might have continued contact with their abuser, why most victims don\u0027t report, the gap between belief and the prosecution of a criminal case, the burden of evidence on the victim to support their case, options for reporting, access to support, types of police statements, memory stress impact on statements, the conviction rate of perpetrators and why most of these types of criminal cases don\u0027t progress or produce a successful outcome.  During redirect, Mr. Mueller had asked Dr. Ziv if there were certain date-rape drugs that put you \u0022on the same continuum\u0022 (continuing to function, not rendering immobile) and she responded that there were - \u0022whole classes of drugs\u0022.  We discuss our own complex incidences of date rape drugging and the confusing effects that we experienced. Victoria, whose drug rape occurred while still in Scientology, shares how it was \u0022handled\u0022 by Scientology, so similar to the Jane Does in this trial, where she was also blamed, punished, assigned lower conditions, make amends, and forced to try to \u0022help\u0022 her rapists, in order for her to fully take responsibility for \u0022pulling in\u0022 what happened to her. She touches on her resulting first suicide attempt, and how Scientology forced her to sign release forms, absolving them, should she succeed.   Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠⁠https://anchor.fm/children-of-scientology/message ⁠⁠  If you enjoy this podcast, and our content, please like, follow, and share. You can also support our efforts by following Children of Scientology on social media, or here: ⁠⁠⁠⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠⁠  Links to things we referenced:   The Way To Happiness Booklet (and controversies) https://en.wikipedia.org/wiki/The_Way_to_Happiness  This link provides access to a detailed article regarding false reports published by The National Sexual Violence Resource Center (NSVRC). It addresses misconceptions about the reporting of sexual assault and provides research-based information on this topic.  ⁠https://www.nsvrc.org/publications/false-reporting-overview  RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673 ⁠https://www.rainn.org/resources  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-06-07T15:42:07Z",
      "duration": "00:58:09.2160000",
      "explicit": true,
      "spotifyId": "7wKaIaVZx1LhnyzYvmoQ2f",
      "appleId": 1000616035301,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7wKaIaVZx1LhnyzYvmoQ2f",
        "apple": "https://podcasts.apple.com/podcast/5-people-of-the-state-of-california-vs/id1685902489?i=1000616035301"
      }
    },
    {
      "id": "df018480-6339-452e-af07-97b880268f2d",
      "title": "#4 - People of the State of California vs Daniel Masterson: Sexual Assault Expert Dr Ziv - Part 1 ",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   Our fourth episode is Part 1 of a freeform conversation around expert witness, Dr. Barbara Ziv\u0027s testimony and related topics:  We begin with a heartfelt thank you to Jane Doe 3, for her tenacity and unwavering bravery. Mirriam reads Dr. Ziv testimony transcript, as she explains some misconceptions around a victim\u0027s response. We each relate to our own personal feelings and experiences with domestic violence and sexual assault, the confusion that can exist around it, power dynamics, proximity to the perpetrator, as well as recidivism.  Victoria reflects more on her Scientology \u0022handling\u0022 of her sexual abuse.  We all go on a side tangent about Scientology\u0027s indoctrination of members to be able to confront anything, via its \u0022Training Routines\u0022, and \u0022Bullbaiting\u0022, how uncomfortable it felt to us at the time, and reflect on understanding now that it played a role in each of us learning to dissociate as children, and later Victoria’s Dissociative Identity Disorder diagnosis.  We discuss the incredible importance of the brain-body connection, and how we understand now, that Scientology interrupts it in so many way, especially for children.  Christi describes wanting nothing more to do with Scientology when she left at about 20, or appeasing the group, and contrasts that to Mirriam, who was born into the Sea Organization, and Amanda who was born into Scientology since both tried so hard to remain in good standing after leaving the Sea Organization.  Amanda briefly describes her Sea Org experience, how she accidentally read “1984” while in the Sea Org, and how she was so able to connect and relate to the dystopian conditions it described, that she was living in. She goes on to touch on how incredibly abandoned and isolated she felt by her own community when she left the Sea Org, and returned in shame to her rural Org, in Seattle.   Jump into the conversation - send us a voice message - we may use it in an upcoming show: ⁠https://anchor.fm/children-of-scientology/message ⁠  If you enjoy this podcast, and our content, please like, follow, and share. You can also support our efforts by following Children of Scientology on social media, or here: ⁠⁠⁠⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠⁠⁠  Links to things we referenced for our Toolkit:   Baraba Ziv M.D. Forensic Psychiatrist:  Dr. Ziv has evaluated over 1000 convicted sex offenders and an equal number of victims of sexual abuse. She has testified in nearly 200 state and federal trials and is a nationally recognized expert on sexual abuse. Dr. Ziv has appeared on Dateline, Oprah, 20/20, Good Morning America, Primetime, and other television programs to discuss issues including the mindset of rapists, murderers, and victims.   https://www.linkedin.com/in/barbara-ziv-m-d-805a2815/  The Sharkcage Metaphor in Abusive Relationships:  https://ccp.net.au/the-shark-cage-metaphor-in-abusive-relationships/ https://westcasa.org.au/wp-content/uploads/2019/08/TheSharkCage.pdf Introductory Scientology Training Routines - OT TR 0, TR 0, and TR 0 Bullbait :   https://www.scientologycourses.org/tools-for-life/communication/steps/training-drills.html https://sup.scientologycourses.org/courses-view/communication/step/16.html https://www.youtube.com/watch?v=e7xiY54d96M  Red Flags to Look for in an Abusive Personality: https://www.med.unc.edu/beacon/wp-content/uploads/sites/598/2018/03/redflagabusivepersonality.pdf RAINN  (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656-4673  https://www.rainn.org/resources⁠⁠⁠   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-05-28T19:18:31Z",
      "duration": "00:59:28.9760000",
      "explicit": true,
      "spotifyId": "0F0MlFLYF1ruxHpbhsK6b1",
      "appleId": 1000614782076,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0F0MlFLYF1ruxHpbhsK6b1",
        "apple": "https://podcasts.apple.com/podcast/4-people-of-the-state-of-california-vs/id1685902489?i=1000614782076"
      }
    },
    {
      "id": "ab8b0801-c3c1-4fcc-b46a-d3bf2c9d4db6",
      "title": "#3 - People of the State of California vs Daniel Masterson: Jane Doe 3 - Part 2 ",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   Our third episode is Part 2 of a freeform conversation around Jane Doe 3 testimony and topics:  We continue relating to Jane Doe 3 testimony, sharing our similar experiences in our own personal Scientology \u0022handlings\u0022 as children and young adults.  Mirriam and Christi go further down the rabbit hole of Scientology victim blaming by explaining concepts like \u0022pulling in\u0022 abuse, defining \u0022overts \u0026 withholds\u0022, and \u0022the overt-motivator sequence\u0022 and the technique Scientology uses to brainwash victims into believing that they deserve the bad things that have happened to them. Amanda and Victoria speak from personal experience about being forced to \u0027take responsibility\u0022 for their \u0022crimes\u0022 (abuses) as children. We open up our copies of the Introduction to Scientology Ethics Book to review some policies and hear a few of Scientology\u0027s definitions of \u0022Victim\u0022 from its Technical Dictionary, touching on how the reframing of this word has long-term impacts on healing.  We scratch the surface around the Scientology belief that being critical, complaining, or speaking negatively about another always means you have committed crimes against them - and we help each other clarify the \u0022Chaplain Cycle\u0022, comparing what we thought it was then to what we understand it to be now as reformed victims looking back on our own abuses.  We conclude that these policies and practices strategically and effectively control how children and victims are allowed to perceive and communicate about the harm they experience, and the very limited resources they are offered by Scientology.  Jump into the conversation - send us a voice message - we may use it in an upcoming show: https://anchor.fm/children-of-scientology/message   If you enjoy this podcast, and our content, please like, follow, and share. You can also support our efforts by following Children of Scientology on social media, or here: ⁠⁠⁠⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠⁠  Some links to things we referenced for our Toolkit:   The Sharkcage Metaphor in Abusive Relationships:  https://ccp.net.au/the-shark-cage-metaphor-in-abusive-relationships/ chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://westcasa.org.au/wp-content/uploads/2019/08/TheSharkCage.pdf  Red Flags to Look for in an Abusive Personality: chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://www.med.unc.edu/beacon/wp-content/uploads/sites/598/2018/03/redflagabusivepersonality.pdf  RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673 ⁠⁠⁠https://www.rainn.org/resources⁠⁠⁠  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-05-19T16:03:20Z",
      "duration": "01:04:03.4360000",
      "explicit": true,
      "spotifyId": "76SwexMlThhiVTTwyqKsGc",
      "appleId": 1000613367530,
      "urls": {
        "spotify": "https://open.spotify.com/episode/76SwexMlThhiVTTwyqKsGc",
        "apple": "https://podcasts.apple.com/podcast/3-people-of-the-state-of-california-vs/id1685902489?i=1000613367530"
      }
    },
    {
      "id": "16dc8473-5ad0-4719-b493-542ef531985d",
      "title": "#2 - People of the State of California vs Daniel Masterson: Jane Doe 3 - Part 1 ",
      "description": "Welcome back to the Lighthouse Project, a Children of Scientology Production.   Our second episode is Part 1 of a freeform conversation around Jane Doe 3 testimony and topics:   Amanda Rae arrives, we introduce ourselves, plus share a little more about why we\u0027re each here. We touch on staying \u0022under the radar\u0022, some lightbulb moments, and finally letting go of Scientology. We continue our discussion around the Danny Masterson Rape Retrial and relate to Jane Doe 3 testimony.  We dig into Field Auditing and prolonged \u0022security checking\u0022 and the blaming of children who experience sexual trauma, what it feels like to be a child at a rural \u0022Org\u0022, more on the \u0022Cadet Org\u0022 and separation from parents, and how children often reach the conclusion that it hurts less to let their parents go.  We scratch the surface of parallels in our own childhood experiences around the practice of \u0022No HE\u0026R\u0022 (no human emotion and reaction), the practice of victim blaming via being made to describe in great detail (and repetitively) how you \u0022pulled in\u0022 anything negative that happens to you (even if it means inventing false memories in a past lifetime), more on Scientology euphemisms, and how all of these things strategically and effectively control how children are allowed to feel, process experiences, and are able or unable to communicate about them, plus long term emotional \u0026 mental health impacts.   You can chime in via voice message: https://anchor.fm/children-of-scientology/message   If you enjoy this podcast, and our content, please like, follow, and share. You can also support our efforts by following Children of Scientology on social media, or here: ⁠⁠⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠  Some links to things we referenced:   Our Hiding Words: Euphemisms in Sexual Trauma Recovery, by Natasha J. Thomas, MD ⁠https://www.hopegrove.us/post/2018/03/25/our-hiding-words-euphemisms-in-sexual-trauma-recovery?fbclid=IwAR0q83066DP-rws6JWasISX0yzrQbPBrzGbnS9nvnrka8mNUmngDgov45T4⁠  Scientology Speak, by Mike Rinder (Scientology euphemism \u0022Out 2D\u0022 is used to relabel ALL unethical sexual behavior)  ⁠⁠https://www.mikerindersblog.org/scientology-speak/⁠⁠  RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673 ⁠⁠https://www.rainn.org/resources⁠⁠   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-05-11T22:41:42Z",
      "duration": "00:47:49.6690000",
      "explicit": true,
      "spotifyId": "1BRfSKza5hCK8nT23zFtow",
      "appleId": 1000612700302,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1BRfSKza5hCK8nT23zFtow",
        "apple": "https://podcasts.apple.com/podcast/2-people-of-the-state-of-california-vs/id1685902489?i=1000612700302"
      }
    },
    {
      "id": "c008122b-275c-42cf-9d7a-badf2b6ae8b5",
      "title": "#1 - Introducing the Lighthouse Project Podcast, first discussion: People of the State of California vs Daniel Masterson: Opening Statements",
      "description": "Introducing the Lighthouse Project, a Children of Scientology production.   In our inaugural episode, you\u0027ll hear from founders, Mirriam, Christi, and Victoria, all raised in, who define it\u0027s purpose, and set a solid foundation for future discussions, offering a compelling glimpse into the experiences of individuals raised within Scientology, and initiating important conversations about mental health, justice, and contradictory messages by Scientology, what they do versus what they say they do.  This project is intended to offer an opportunity to discuss the unique experiences of individuals raised in the controversial group. The goals are to create awareness of its impact on children, explore their sense of self, family dynamics, and mental health, find ways to heal, and share tools  By providing a platform for dialogue and healing, we hope this is a valuable resource for any interested in understanding the impact of Scientology on its youngest members. An added value lies in its ability to offer a safe space for legacy individuals to share stories and shed light on a lesser-known aspect of Scientology, the children.  By amplifying these voices, we hope our project gives a broader understanding of the impacts of high-control upbringings, offering support and validation for those who\u0027ve navigated the complexities of leaving or questioning their involvement in the thing they were formed around. Children of Scientology\u0027s mission is to raise awareness, create community, and provide support for those who grew up in it.  We intend for this podcast to offer a valuable and unique opportunity to hear more than the typical space opera, outrageous doctrine, and celebrity stories. Instead, giving insight into the unique challenges and dangers faced by children of the organization.  In our first discussion, we turn our attention to the retrial of Danny Masterson, who was raised in Scientology, and has been charged with three counts of forcible rape by the Los Angeles County District Attorney\u0027s Office, many of his victims, and witnesses called to testify were also raised in Scientology.   Throughout the course of this trial, we will address various pieces of the victim\u0027s testimonies and expert witness testimonies. We\u0027ll discuss parallels in our own experiences with Scientology, and its consistent controlling of a victim\u0027s narrative, language, emotions, and denial of rights and access to care (including of children) through its systematic control mechanisms.   We wish to bring attention to the details in this case so that we can more deeply understand what the Jane Doe\u0027s went through, what they were up against and to gain a sense of what it took for them to get there. We begin this journey with the opening statements.  You can chime in via voice message: https://anchor.fm/children-of-scientology/message   If you enjoy this podcast, and our content, please like, follow, and share. You can also support our efforts by following Children of Scientology on social media, or here: ⁠⁠⁠⁠https://podcasters.spotify.com/pod/show/children-of-scientology/support⁠⁠⁠  Some links to things we referenced:   RAINN (Rape, Abuse \u0026 Incest National Network) is the nation\u0027s largest anti-sexual violence organization and operates the National Sexual Assault Hotline (800) 656.4673 https://www.rainn.org/resources  Our Hiding Words: Euphemisms in Sexual Trauma Recovery, by Natasha J. Thomas, MD https://www.hopegrove.us/post/2018/03/25/our-hiding-words-euphemisms-in-sexual-trauma-recovery?fbclid=IwAR0q83066DP-rws6JWasISX0yzrQbPBrzGbnS9nvnrka8mNUmngDgov45T4  Scientology Speak, by Mike Rinder (Scientology euphemism \u0022Out 2D\u0022 is used to relabel ALL unethical sexual behavior)  ⁠https://www.mikerindersblog.org/scientology-speak/⁠  Scientology Stories #4 with Claire Headley - What it\u0027s Like to Grow Up in a Cult https://youtu.be/WLlc-XJ0SFQ  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/children-of-scientology/message Support this podcast: https://podcasters.spotify.com/pod/show/children-of-scientology/support",
      "release": "2023-05-03T17:31:34Z",
      "duration": "00:22:31.2150000",
      "explicit": true,
      "spotifyId": "2Y8KR9FNnsWSMu64YWEBKO",
      "appleId": 1000611618632,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Y8KR9FNnsWSMu64YWEBKO",
        "apple": "https://podcasts.apple.com/podcast/1-introducing-the-lighthouse-project-podcast-first/id1685902489?i=1000611618632"
      }
    }
  ]
}