{
  "id": "16848f12-15b7-405e-a2c0-63062d2a7e9e",
  "name": "Chokmah Emet Cherut",
  "youTubeChannelId": "UCPz0QYNjHwooPCBilbjoD6w",
  "episodes": [
    {
      "id": "ee120553-78a7-4427-9ce4-4c86431d1046",
      "title": "Uncovering Satanic Cult Allegations: Therapists, Memories, and Controversy (PrimeTime Live, 1993)",
      "description": "This video is an excerpt from a 1993 episode of ABC\u0027s PrimeTime Live, hosted by Diane Sawyer and reported by Jay Scheidler (also referred to as Jay Shekar in some references). Originally aired in January 1993, the segment examines the controversial rise of claims involving satanic ritual abuse (SRA) during psychotherapy sessions amid the broader cultural phenomenon known as the Satanic Panic.\nThe episode explores how an increasing number of patients—primarily women—reported recovered memories of childhood sexual abuse escalating into allegations of organized satanic cults, including ritualistic torture, sacrifices, multiple personality fragmentation, and blood-drinking ceremonies. It features patient accounts (using pseudonyms such as Vanessa), hidden-camera footage from therapist training seminars, and interviews with prominent figures like Dr. Cory Hammond (then a staff psychologist at the University of Utah Hospital), who advocated for the phenomenon and estimated tens or hundreds of thousands of victims.\nThe report also includes critical perspectives, such as those from Dr. George Ganaway, who viewed SRA therapy as an emerging cottage industry with significant insurance implications and no verifiable evidence. It highlights an FBI study finding no documented proof of large-scale satanic conspiracies or murders, questions the reliability of hypnosis-induced memories in vulnerable patients, and discusses cases where former patients later recanted their stories, leading to lawsuits against therapists for negligence and fraud.\nKey examples include family disputes, such as the case involving Gloria Grady and her parents, and debates over whether therapists were implanting false memories or uncovering genuine trauma. The segment raises profound ethical questions about therapeutic responsibility, the nature of memory, and the potential for suggestion in clinical settings.\nThis archival material provides historical insight into one of the most debated episodes of 1990s psychotherapy and media coverage of alleged ritual abuse. Viewer discretion is advised due to discussions of trauma, abuse allegations, and psychological manipulation.\nIf you appreciate in-depth examinations of historical media, psychological controversies, or the Satanic Panic era, please like, comment with your thoughts, and subscribe for more archival journalism breakdowns and related content.",
      "release": "2026-02-17T19:04:08Z",
      "duration": "00:15:10",
      "explicit": false,
      "youTubeId": "irh2Mii5lbQ",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=irh2Mii5lbQ"
      }
    }
  ]
}