{
  "id": "e712cc46-5f42-4861-8599-c953cb38259c",
  "name": "CHRISTYreports",
  "youTubeChannelId": "UChCjxBo3K-6xfaEEKBELOTw",
  "episodes": [
    {
      "id": "2b796bcc-996c-4580-8b05-5c3964faf632",
      "title": "Mary Cosby’s Cult Scandal | TLC vs Bravo \u0026 The Family Secrets REVEALED",
      "description": "TLC’s explosive new docuseries The Cult of the Real Housewife exposes shocking allegations surrounding The Real Housewives of Salt Lake City star Mary Cosby and the Faith Temple Pentecostal Church. The three-part investigation dives into decades of family drama, lawsuits, and rumors of financial misconduct — and it’s already being called TLC’s biggest challenge to Bravo yet.\n\nThis deep dive breaks down the entire story behind The Cult of the Real Housewife — from Rosemary “Mama” Cosby’s legacy and her controversial passing, to the family feud that tore Faith Temple apart, to the recent $6 million lawsuit involving church finances. Viewers will see how TLC is taking direct aim at Bravo, turning one of its most polarizing Housewives into a true-crime headline.\n\nFeaturing details about Mary’s marriage to her step-grandfather Robert Cosby Sr., the long-standing disputes over her grandmother’s estate, and interviews with family members like Denise Jefferson Odinaka and Dan Cosby, this video reveals how The Real Housewives of Salt Lake City drama evolved into a national scandal.\n\nThe Cult of the Real Housewife premieres January 1 on TLC and streams on Max, promising to unpack “spiritual and financial misconduct” in a way Bravo never has.\n\nViewers searching for Mary Cosby news, RHOSLC updates, Housewives scandals, or TLC documentary exposés will find every shocking twist here.\n\n00:00 – The Trailer Quote That Shook Bravo\n00:58 – TLC vs Bravo | The Reality-TV Rivalry Begins\n01:58 – Faith Temple | How Mary Cosby’s Family Built an Empire\n02:58 – A Daughter’s Warning | Rosalind Cazares Speaks Out\n04:03 – Lawsuits \u0026 Legacy | The Fight Over Mama Cosby’s Estate\n06:02 – Inside TLC’s Cult of the Real Housewife Docuseries\n06:38 – Rosalind’s Final Chapter \u0026 The Unfinished Story\n07:28 – Mary Cosby and Bravo’s Next Move",
      "release": "2025-11-16T17:01:44Z",
      "duration": "00:08:57",
      "explicit": false,
      "youTubeId": "zug51PTg9Js",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zug51PTg9Js"
      }
    }
  ]
}