{
  "id": "b55bf1af-74c2-484a-ab66-5b4893c8035b",
  "name": "Christian Gutierrez",
  "youTubeChannelId": "UCSAcXq1WNzRbxdjfY2AYQSA",
  "episodes": [
    {
      "id": "a87a4b58-e5cc-4eaf-88fc-ec50d000e365",
      "title": "Escaping The Watchtower Ep. 6",
      "description": "Good morning everybody!!! Today\u0027s video marks the sixth and final video of all interviews recorded from last year! We want to thank everybody for their wonderful support. To all who volunteered to tell their stories. To all those who gave us a place to stay while we travelled from home to home. To all those who helped finance and fund this project from the beginning. We say THANK YOU!!!\nThis is the story of Anders Grann who is a former Jehovah\u0027s Witness. As with all other people we interviewed, we had a really nice time being able to sit down and talk to him and enjoy some pizza and fries after haha. \nThis video was recorded on 3 Panasonic 4k Cameras, 2 recorders, 3 lavalier mics, 4 led lights and stands, 3 tripods. Color graded on DaVinci Resolve and edited on Adobe Premiere Pro CC. \n\nIf want to see what we are up to you can follow us on\nInstagram: https://www.instagram.com/ooompa_looompa/\nTwitter: https://twitter.com/ChristianG_EXJW\n\nYou can also be part of the channel and help support more of these types of videos by becoming a Patron at: https://www.patreon.com/christian_katja",
      "release": "2018-09-05T14:32:27Z",
      "duration": "00:26:04",
      "explicit": false,
      "youTubeId": "KXUa7CNMRTs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KXUa7CNMRTs"
      }
    },
    {
      "id": "ff86f62a-eceb-4cfe-aa69-b3a727894c25",
      "title": "Escaping the Watchtower Ep. 5",
      "description": "Hello fellow Youtubers!!! Today we upload a new video about the story of a mother who lost all her kids for simply no longer wanting to be a Jehovah\u0027s witness. She has high hopes to be reunited with them one day. With much resilience and courage, this is the story of Giggi from Denmark.\nThank you for watching!\n\nEveryone who funded this Documentary have made a huge impact in the process of making this project. It would not have been possible without you!\nThis video was made with three Panasonic 4k cameras, three lavaliers, two recorders, one boom microphone and four light stands. It was also color graded in DaVinci Resolve and edited in Adobe Premiere Pro CC. Music is fully licenced and authorized through Soundstripe. \n\nYou can connect with us on\nInstagram at: https://www.instagram.com/ooompa_looompa/\nTwitter at: https://twitter.com/ChristianG_EXJW\n\nAnd of course should you wish, you can support and be part this channel so we can continue to make more videos by becoming a Patron at: https://www.patreon.com/christian_katja",
      "release": "2018-08-21T14:33:02Z",
      "duration": "00:20:11",
      "explicit": false,
      "youTubeId": "vLgSuWySV5I",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vLgSuWySV5I"
      }
    },
    {
      "id": "e982153f-a388-4608-b650-d2b86c004de5",
      "title": "Escaping The Watchtower Ep. 4",
      "description": "The series continues with \u0022Escaping The Watchtower\u0022 now episode 4! We sit down and talk to an amazing couple that have made dozens of videos that have helped so many former Jehovah\u0027s witnesses in their recovery. Made in London UK, the majority of this episode was shot a year ago and we are so happy to have it edited and finished for all to enjoy. We are so thankful to all those who have made this video possible and continue to support this channel. This episode was made with three Panasonic 4k cameras, a boom mic with four lavaliers. Two independent recorders. Four LED lights and stands. Three tripods. Edited on DaVinci Resolve and Adobe Premiere Pro CC. All music is used from Soundstripe.\nYou can follow us on.....\n Instagram at: https://www.instagram.com/ooompa_looompa/\nOn Twitter at: https://twitter.com/ChristianG_EXJW\n\nYou can support and be part of the channel by becoming a Patron at: https://www.patreon.com/christian_katja",
      "release": "2018-08-08T16:58:08Z",
      "duration": "00:42:09",
      "explicit": false,
      "youTubeId": "d0D7-7BffKg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d0D7-7BffKg"
      }
    },
    {
      "id": "939c98f6-d93b-4532-8863-a1f7df55216d",
      "title": "Escaping The Watchtower Ep. 2",
      "description": "This is the story of Tyson Klassen who no longer considers himself a Jehovah\u0027s Witness. He is willing to come forward and tell his story despite the threat of losing his family to the Watchtower policy of shunning former members. This project was started over a year ago and is a work in progress. We hope you enjoyed it as we work towards bringing more stories of former witnesses through this channel. If you would like to help support this channel, please give this video a thumbs up. If you would like to help us fund this work, you can help us through our \nGo Fund Me page at: https://www.gofundme.com/documentary-exposing-watchtower-org\nOr become a Patron at: https://www.patreon.com/christian_katja\nAll music used and special was purchased and licenced through Adobe and Audio blocks.\nSpecial thank you to all those who supported this channel and this work, it has already helped so many.\nIf you would like to follow us on social media, you can follow us on Instagram at: https://www.instagram.com/ooompa_looompa/?hl=en\nOur Twitter: https://twitter.com/ChristianG_EXJW\nOr our second You Tube page at: https://www.youtube.com/watch?v=wVvbLIEu29E\nLots more to come with your help.\nThank you! :)",
      "release": "2018-06-20T09:06:38Z",
      "duration": "00:33:08",
      "explicit": false,
      "youTubeId": "Ofdum88KACE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ofdum88KACE"
      }
    },
    {
      "id": "e7e17c5b-2ae5-4b10-9285-d8548b5b2b42",
      "title": "Escaping the Watchtower Episode 1 with Jason Droboth",
      "description": "Thank you so much for watching the first episode of Escaping the Watchtower! This is the first exclusive channel that is documenting former Jehovah\u0027s witnesses and their stories. This journey started over a year ago as many came forward with their stories. There are many more stories just like that of Jason Droboth from Calgary, so if you would like us to tell your story, please send us a message to our Instagram below. We hope to be able to continue to produce these episodes that will bring much awareness to not only current Jehovahs witnesses but also the general public. If you would like to see us produce more, please consider helping us fund future projects like these. You can help us through our Go Fund Me page or our Patreon page. Thank you and please give this video a like!\n\nGo Fund Me page: https://www.gofundme.com/documentary-exposing-watchtower-org\nPatreon page: https://www.patreon.com/christian_katja\nInstagram page: https://www.instagram.com/ooompa_looompa/?hl=en",
      "release": "2018-05-09T18:57:08Z",
      "duration": "00:43:13",
      "explicit": false,
      "youTubeId": "kI5pg4FJugI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kI5pg4FJugI"
      }
    }
  ]
}