{
  "id": "52a5a363-c6ab-4ee2-a1d7-d57ff18c5b6a",
  "name": "Chuck Beatty",
  "youTubeChannelId": "UCBhX3nHupHZ8CF8WrnMynAg",
  "episodes": [
    {
      "id": "22f7fb28-d1ba-40e9-a779-bc37e18c244b",
      "title": "17 important minutes of the Pat Broeker talk at the L. Ron Hubbard death briefing",
      "description": "01:49  The OT 10 worksheet big date\n02:00 to 04:00. Pat outlines the 1982 to 1984 summer, the two years of LRH\u0027s case folders          would thus be the raw material to compile OT 9 and OT 10.   These years of case folders, like all Hubbard\u0027s case folders, have never made it public.   But they are the material the compilers in Senior C/S Int Officer would review to dig up the procedures, and followr LRH\u0027s other earlier years of \u0022compilations procedures\u0022 orders to turn into pilot processes, etc, and pilot the OT 9 and 10, successful wrap up the piloting and issue the levels to Scientology public.    \n05:00  I believe Pat\u0027s talking here about what became the End of \n            Life rundown/assist, which Hubbard ordered Ray Mithoff to\n            give to Hubbard in Hubbard\u0027s final days 14:50 onwards also.\n09:20  Pat gives important context to the \u0022tech\u0022 and the details of\n            what the Comps Branch people, nerds ought read Dan \n            Koon\u0027s and others who did this review stuff, how they did the\n            sorting of the wheat from the chaff ---  but it was all per \n            Hubbard\u0027s orders (I read most if not all of those Hubbard\n            orders in the \u0022LRH Compilations Officer Full Hat Checksheet\u0022\n            in 1988, there were projects in the LRH Comps Department \n            and even ASI had a project Maria Starkey did the project for\n            the LRH \u0022timeless tech\u0022 for ASI even.\n12:28  An anomaly and violation, Pat says he will \u0022C/S\u0022 case- \n            supervise Ray Mithoff\u0027s OT 8, this is a violation of Hubbard\u0027s \n            technical rules, and later in history Miscavige follows Pat\u0027s \n            violation of Hubbard\u0027s rules to likewise unauthorizedly case \n           supervise which is a gross violation of the Hubbard rules.  \n13:30  OT 9 and OT 10 are supposedly written up, meaning ready \n            for followers to do these steps.  No evidence by others there\n            ever saw evidence of this.   Marty Rathbun directly refuted \n            this, and he was firsthand there to witness no evidence of \n            this claim by Pat.   Pat for this point, I hope breaks his \n            silence and coughs up the truth before he croaks on this. \n13:38   Pat claims it is his job to compile several more OT levels \n             on up to OT 13.  Marty Rathbun\u0027s book 3 refutes there is \n             sufficient Hubbard \u0022case\u0022 folder material with which to \n             compile any more OT levels.   Pat I hope answers this\n             contested point before Pat dies.  \n\n******Very Significant*****\n13:45 to 14:11   Pat explains the compilations procedure\n14:11 to 14:39   Pat describes the raw material from Hubbard to be\n                             used to compile the remaining upper OT levels.   \n                             Hugely significant section of this Pat Broeker 17 \n                             minutes, for nerd experts of how the Hubbard \n                             technical quackery was concocted, and whether \n                            any further quackery can come of what \u0022research\u0022 \n                            \u0022case folders\u0022 and \u0022notes folder\u0022 material can be \n                           used to concoct any further Hubbard \u0022OT levels\u0022 \n                           quackery.   Vital info for all time for future \n                           Scientologists.  \n\n\n\n\nSome of what Pat Broeker said in 1986 at this L. Ron Hubbard death event, were based on truth, some has been questioned by others in their books in recent years.  \n\nFor Scientologists this 17 minutes of Pat\u0027s talk contain much info that is still relevant and ought to still be weighed.\n\nL. Ron Hubbard\u0027s \u0022case\u0022 folders with Hubbard\u0027s final \u0022case\u0022 \u0022research\u0022 has never seen the light of day.\n\nVery few people have ever seen Hubbard\u0027s \u0022case\u0022 folders, especially not page by page carefully studying of the whole bulk of Hubbard\u0027s own case folders.   Ray Mithoff gave the Hubbard quackery to Hubbard in the end of Hubbard\u0027s life, and Ray\u0027s worksheets have been seen by even fewer persons.     What all Hubbard told Ray, also, I so wished anyone who has heard of that, or if anyone knows of Ray\u0027s taking any notes of what Hubbard told Ray, all that is relevant for true blue Hubbardites or outside expert/nerds/researchers. \n\nPat holds up a copy of one edited worksheet, with the zillions of years ago date on it, and Pat explains the context.\n\nThere is much important info in this 17 minutes.\n\nIt\u0027s all quackery to me today, but to nerds of Scientology, there is much to speculate about Pat\u0027s 17 minutes.",
      "release": "2018-11-27T00:56:47Z",
      "duration": "00:17:24",
      "explicit": false,
      "youTubeId": "ISRxhCEUZfo",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ISRxhCEUZfo"
      }
    },
    {
      "id": "c0fb115f-8a7b-4bb5-8f79-6e138c1b3a7b",
      "title": "Pat Broeker, is he giving David Miscavige a face slap here?",
      "description": "L. Ron Hubbard\u0027s small team of people around him at his death, included Pat Broeker.\n\nPat\u0027s importance has been dented by additional info as told in recent ex member books plus in Lawrence Wright\u0027s \u0022Going Clear...\u0022 book.\n\nPat Broeker still hasn\u0027t gone public all these years, from the time he spoke here in January of 1986.\n\nImportant issues about Hubbard\u0027s final research, and other points, are worth weighing and reviewing, by anyone nerdy enough to wish to know what was on L. Ron Hubbard\u0027s mind near Hubbard\u0027s end of life.\n\nThe final quackery of Hubbard\u0027s is discussed in insider lingo by Pat, but for insider Scientologists this section in this video is still and always will be important to true blue Scientologists to weigh.",
      "release": "2018-11-27T00:32:01Z",
      "duration": "00:03:15",
      "explicit": false,
      "youTubeId": "H5fJNwuk1KQ",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=H5fJNwuk1KQ"
      }
    }
  ]
}