{
  "_ts": 0,
  "id": "bccc115c-9545-4ccc-b5aa-0bf09abc620d",
  "name": "Church Review Podcast",
  "spotifyId": "7zqgJF0ESU3ghb6108wF8b",
  "episodes": [
    {
      "id": "f4e1a2cf-87d4-44f5-8d68-15968df001db",
      "title": "Ep3: Holy Smokes - Should we lift our hands in church?",
      "description": "Ever wonder if you’re supposed to raise your hands like a spiritual superhero or just stick to clapping awkwardly? Join Jesse and Dan as they break down the art of hands lifted in praise—what’s the meaning, the struggle, and why does everyone seem to have their own style? From \u0022I’m just stretching\u0022 to full-on airplane mode, get ready for laughs, insights, and maybe even a few new hand-raising moves. Whether you\u0027re a seasoned pro or just trying to figure out if you’re supposed to clap in-between, this episode’s for you!",
      "release": "2025-01-15T00:00:00",
      "duration": "00:33:59.6400000",
      "explicit": false,
      "spotifyId": "2jgSNHe9R0jPbtjuMB1JHu",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2jgSNHe9R0jPbtjuMB1JHu"
      }
    },
    {
      "id": "4d71b2a7-be3f-4b26-b28e-bdb1079b40ad",
      "title": "Ep2: Holy Smokes - Red Letter Christians",
      "description": "Join Jesse and Dan as they dive into the world of Red Letter Christians— the phrase, origins, and movements where Jesus teachings became more than the red letters in a standard Bible. From tricky names no one can pronounce, to a phrase we all thought nothing of (well at least they didnt anyway), tune in for a fun, faith-filled conversation and see what really is the reason for that red ink.",
      "release": "2025-01-09T00:00:00",
      "duration": "00:36:53.6940000",
      "explicit": false,
      "spotifyId": "7MpMxi6HY4k6P8MG5cve6q",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MpMxi6HY4k6P8MG5cve6q"
      }
    },
    {
      "id": "4418d89a-9a93-41af-b0b5-f6d8787dff6c",
      "title": "Ep1: Holy Smokes - WWJD? (What Would Jesus Do?)",
      "description": "Join Jesse and Dan as they tackle the timeless question, What Would Jesus Do?—but with a 2025 twist. From the cool kids in youth group in the early 2000s with the WWJD bracelets to bumper stickers and merchandise that popularized the phrase. What exactly was the origin of this concept and why was it such a movement amongst Christian teens? Tune in to this new segment \u0027Holy Smokes\u0027 where we examine the Christian culture for your entertainment and education.",
      "release": "2025-01-04T00:00:00",
      "duration": "00:39:35.5230000",
      "explicit": false,
      "spotifyId": "5h0bxA3003v1Fc62H5AcRL",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5h0bxA3003v1Fc62H5AcRL"
      }
    },
    {
      "id": "20e86664-895d-4ae7-a73f-6886d438b80c",
      "title": "Ep7: Moravian Church (Jan Hus)",
      "description": "In this episode, hosts Jesse and Sam explore the story of Jan Hus and the rise of the Moravian Church. Hus, a key figure in the early church reform movement, challenged the status quo of the Catholic Church in the 15th century, paving the way for major changes in Christianity. Jesse and Sam discuss Hus’s teachings, and how his legacy influenced the formation of the Moravian Church. Tune in for an insightful conversation on faith, reform, and the lasting impact of these pivotal historical events.",
      "release": "2024-12-25T00:00:00",
      "duration": "00:50:06.5630000",
      "explicit": false,
      "spotifyId": "0YwNQUn8dOmbEyXZmf5LkI",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YwNQUn8dOmbEyXZmf5LkI"
      }
    },
    {
      "id": "206ed32f-ff7e-4efe-99d8-d0eb7eb13892",
      "title": "Ep6: SSPX (The Society of St Pius X)",
      "description": "In this episode, Jesse and Sam tackle the Society of St. Pius X (SSPX) — the Catholic group that\u0027s basically the \u0022bad boy\u0022 of the Church. From their unapologetic love for the Latin Mass to their strained relationship with Vatican II, these guys make Catholicism look like a soap opera. Tune in as we unpack their controversial history, theological drama, and all the holy plot twists along the way. Spoiler alert: Grab your rosary, you might need it!",
      "release": "2024-12-20T00:00:00",
      "duration": "00:47:00.4660000",
      "explicit": false,
      "spotifyId": "0ToAC1gDephXyZSJsbkf6i",
      "subjects": [
        "Society of Saint Pius X"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ToAC1gDephXyZSJsbkf6i"
      }
    },
    {
      "id": "f632d392-2f34-4499-afb2-8b87808f5892",
      "title": "Ep5: Twelve Tribes Communities",
      "description": "On today’s episode, Jesse and Sam dive deep into the Twelve Tribes cult—no, not a new boy band, but a commune that’s been raising eyebrows. From their colorful take on communal living to their Yellow Deli Cafe with a Latte to go, we explore the world of the Twelve. Not the twelve disciples sorry but twelve tribes communities under Gene Spriggs. Buckle up, because this one\u0027s going to be wild, weird, and filled with enough culty goodness to make you question your next TikTok binge.",
      "release": "2024-12-15T00:00:00",
      "duration": "00:46:16.4760000",
      "explicit": false,
      "spotifyId": "2Og7vg4EWt1hTZ7DayWVEu",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Og7vg4EWt1hTZ7DayWVEu"
      }
    },
    {
      "id": "029afdec-5541-4ac9-8855-7d43bdeff439",
      "title": "Ep4: Bethel Church Redding",
      "description": "Join hosts Jesse and Sam as they take a spirited journey into the world of Bethel Church in Redding, California—where the worship is electric, the teachings are... well, supernatural, and the coffee is probably anointed. From Bethel’s rise as a powerhouse of modern Christianity to its global influence (and occasional eyebrow-raising moments), Jesse and Sam break down what makes this mega-church tick. Is it the miracle healings? The rockstar worship leaders? Or maybe it’s just the sheer volume of fog machines? Along the way, they discuss Bethel\u0027s infamous Bethel School of Supernatural Ministry, the magic of \u0022Jesus culture,\u0022 and why some people think they’re onto something divine while others just want to know if it’s all just a really good cult in disguise. Get ready for a fun, irreverent, and surprisingly deep dive into one of the most talked-about churches of our time!",
      "release": "2024-12-10T00:00:00",
      "duration": "00:50:06.1710000",
      "explicit": false,
      "spotifyId": "6A5jKiSuGL2TKM650xNYDf",
      "subjects": [
        "Bethel Church (Redding CA)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6A5jKiSuGL2TKM650xNYDf"
      }
    },
    {
      "id": "afafacd4-089c-4be8-87cc-bf039ec9ad68",
      "title": "Rod of Iron Ministries: Guns, Faith, and Politics",
      "description": "What happens when faith, firearms, and politics intersect in the pews? Join us as we explore the astonishing practices of the Rod of Iron Ministries, a church led by Pastor Sean Moon that uniquely incorporates firearms into their worship services, inspired by their interpretation of Revelation 19:15. Discover the church\u0027s roots in the Unification Church founded by Reverend Sun Myung Moon and the family tensions that birthed this controversial offshoot.",
      "release": "2024-12-04T00:00:00",
      "duration": "00:50:09.7760000",
      "explicit": false,
      "spotifyId": "1xGVWZgTTNytKhIjmqcTK4",
      "subjects": [
        "Rod of Iron Ministries"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1xGVWZgTTNytKhIjmqcTK4"
      }
    },
    {
      "id": "3d7706fa-e725-4672-8936-54e1b5ab3542",
      "title": "Exclusive Brethren Church",
      "description": "In this episode Jesse and Sam, the hosts take a deep dive into the world of the Exclusive Brethren—think of them as the secretive cult who really don’t want you using the internet. Jesse and Sam break down the quirks of this ultra-strict religious group, from their peculiar dress code to their \u0022we’re not talking to you\u0022 attitude toward the outside world. With a mix of humor, and a healthy dose of skepticism, they explore why some people choose to join and why others flee faster than you can say “no music allowed.”",
      "release": "2024-12-01T00:00:00",
      "duration": "00:45:53.9060000",
      "explicit": false,
      "spotifyId": "7oVtAS31NnRCKHDSm7w94p",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7oVtAS31NnRCKHDSm7w94p"
      }
    },
    {
      "id": "30438d75-b93a-4a3b-8f6b-3fc0b374dae9",
      "title": "The Church of the Lord Jesus with Signs Following (Snake Biting Church)",
      "description": "Join Jesse and Sam as they dive into the bizarre world of snake-handling churches—where proving your faith means literally dodging a venomous bite. They’ll explore why some people risk life and limb for God, the wild history behind it, and how this dangerous practice is still alive today. With stories, takes, and a few laughs along the way, this episode is your ticket to one of the weirdest religious traditions around.",
      "release": "2024-11-28T00:00:00",
      "duration": "00:43:19.6010000",
      "explicit": false,
      "spotifyId": "4619ZDpXk2mUtbIne2ig75",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4619ZDpXk2mUtbIne2ig75"
      }
    },
    {
      "id": "c40d69bf-ea1d-464d-8543-2a1579996ab8",
      "title": "Unofficial Official Episode",
      "description": "Join hosts Jesse Graham and Sam Charles as they review everything church-related — from the music to the sermon to the little things that make each service unique. In this unique and short episode, they share their thoughts on what the church review podcast is about and a little but about themselves in the making too. Whether you\u0027re a regular churchgoer or just curious, Jesse and Sam’s laid-back, honest take will make you look at Sunday service a little differently.",
      "release": "2024-11-27T00:00:00",
      "duration": "00:32:20.7150000",
      "explicit": false,
      "spotifyId": "6el2Uw1LsasCiz3VRSz4kD",
      "urls": {
        "spotify": "https://open.spotify.com/episode/6el2Uw1LsasCiz3VRSz4kD"
      }
    }
  ]
}