{
  "id": "b735fdea-34b0-4068-b47d-dba70fc38271",
  "name": "Church Of God Restoration Cult",
  "youTubeChannelId": "UCmtsrjeO6gSP4SbwY9PCrlQ",
  "episodes": [
    {
      "id": "2e6c4201-5636-4663-92a6-51516923e51f",
      "title": "Follow Henry Hildebrandt, not the PPC? Ray Tinsman is the \u0022Messiah\u0022? Baptist are full of the Devil?",
      "description": "Henry Hildebrandt uses the political rallies and protests to recruit more members for his cult. The Church of God Restoration believes that they are the only true church and others need to \u0022come out\u0022 from their churches and join them to be saved. They want people to follow Hildebrandt and not the PPC (People\u0027s Party of Canada). They claim that their chief apostle Ray Tinsman is their \u0022Messiah\u0022.\nThe full video of the sermon mentioned in this video, can be found here: https://cogrcult.neocities.org/falseapostles.html.",
      "release": "2022-01-15T15:50:57Z",
      "duration": "00:02:37",
      "explicit": false,
      "youTubeId": "aRJAtRalL-w",
      "subjects": [
        "Church of God Restoration"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aRJAtRalL-w"
      }
    },
    {
      "id": "baab9371-693d-48da-8ea6-4cc3a0e8ee6c",
      "title": "Henry Hildebrandt, Ray Tinsman y S. Hargrave, ¿falsos apóstoles? Iglesia de Dios Rest., ¿una secta?",
      "description": "Éstas son algunas de la enseñanzas que la Iglesia de Dios Restauración le oculta al público en general y las cuales deberían de preocupar a los cristianos. Henry Hildebrandt oculta muchas de las ensañanzas que antes predicaba, de visitantes que visitan a la iglesia de él en los úlitmos meses. Ésta no es sólo una típica iglesia conservadora, muchas de sus enseñanzas no son bíblicas.",
      "release": "2021-09-02T22:40:43Z",
      "duration": "00:23:20",
      "explicit": false,
      "youTubeId": "bthFGp4EaGk",
      "subjects": [
        "Church of God Restoration"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bthFGp4EaGk"
      }
    },
    {
      "id": "a3336e13-5c10-4b4c-aab3-cb2a8c8c30fc",
      "title": "Henry Hildebrandt, Ray Tinsman, faulsche Apostel? Gem. Gottes Restoration eene Sakjt? Plautdietsch",
      "description": "Dies sind einige der Lehren, die die Gemeinde Gottes Restoration vor der Öffentlichkeit verbirgt und über die sich Christen Gedanken machen sollten. Henry Hildebrandt verbirgt viele seiner Lehren vor den Besuchern, die in den letzten Monaten in seine Kirche gekommen sind. Dies ist nicht nur die durchschnittliche konservative Kirche, viele ihrer Lehren sind überhaupt nicht biblisch.\n\n\nVollständige Videos mit Beschreibungen finden Sie hier: https://cogrcult.neocities.org/falseapostles.html",
      "release": "2021-07-30T23:21:28Z",
      "duration": "00:22:54",
      "explicit": false,
      "youTubeId": "J3vfydxYRxQ",
      "subjects": [
        "Church of God Restoration"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J3vfydxYRxQ"
      }
    },
    {
      "id": "27234bd3-6075-4528-bd02-707d5361219e",
      "title": "Henry Hildebrandt, Ray Tinsman and S. Hargrave, false Apostles? Church of God Restoration a Cult?",
      "description": "These are some of the teachings the Church of God Restoration hides from the general public and that Christians should be concerned about. Henry Hildebrandt is hiding many of the teaching he used to preach about, from the visitors that have come to his church in the last few months. This is not just the average conservative church, many of their teachings are not biblical at all.\n\nNarration by: Jeri\nhttps://www.reverbnation.com/jeristern\n\nFull videos with descriptions can be seen here: https://cogrcult.neocities.org/falseapostles.html\n\nFacebook page: https://www.facebook.com/Church-of-God-Restoration-Cult-108791478162537",
      "release": "2021-07-25T14:15:00Z",
      "duration": "00:22:08",
      "explicit": false,
      "youTubeId": "8SQ_1M2S6Yw",
      "subjects": [
        "Church of God Restoration"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8SQ_1M2S6Yw"
      }
    },
    {
      "id": "f5e24782-22d0-49dd-b4c9-e5c2b8ecdc09",
      "title": "Wea es Henry Hildbrandt von dee Gottes Gemeinde Restoration? Plautdietsch",
      "description": "(Plautdietsch) Henry Hildebrandt protestiert gegen die Regierungsverordnungen in Ontario, aber ist es ein Kampf für die Freiheiten oder ein Werbegag des Kultes namens Church of God Restoration? Wissen seine Unterstützer, wer er ist?",
      "release": "2021-01-24T17:36:53Z",
      "duration": "00:15:45",
      "explicit": false,
      "youTubeId": "wBNremA_tWw",
      "subjects": [
        "Church of God Restoration"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wBNremA_tWw"
      }
    },
    {
      "id": "b488bd75-024c-4e5d-9c6d-0752ef19a55c",
      "title": "¿Quién es Henry Hildbrandt de la Iglesia de Dios Restauración?",
      "description": "Henry Hildebrandt protesta en contra de las órdenes del gobierno de Ontario, pero es una lucha por los derechos or es un truco publicitario de la secta llamada Iglesia de Dios Restauración? ¿Saben sus seguidores quién es él?",
      "release": "2021-01-05T14:06:06Z",
      "duration": "00:17:18",
      "explicit": false,
      "youTubeId": "p0Ee12XjL-Q",
      "subjects": [
        "Church of God Restoration"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=p0Ee12XjL-Q"
      }
    },
    {
      "id": "a247e61b-7755-4e0d-9439-965c9ee0b30b",
      "title": "Who is Henry Hildebrandt of Church of God Restoration?",
      "description": "Henry Hildebrandt protests against the government orders in Ontario, but is it a fight of freedoms or is it a publicity stunt for the cult called Church of God Restoration? Do his supporters know who he is?\nAlthough not affiliated with this work, a big part of this video comes from the hard work and effort Adam Pamer has put into gathering information about this cult. Thank you Adam!\nAdam is a former member of the cult and his wife and children were taken from him by the cult, and to top if up the cult\u0027s leaders made false accusations against him to get him arrested. Of course the lies didn\u0027t hold in court. You can read more about Adam\u0027s story and the evil deeds of the cult at Adam\u0027s website and social media:\nwebsite: cultbusters.us\nYoutube channel: https://www.youtube.com/channel/UCRR_BeY6O1I5ECTQxuJ6gzA/videos\nFacebook group: https://www.facebook.com/groups/2346275585659863/",
      "release": "2021-01-05T13:50:18Z",
      "duration": "00:15:39",
      "explicit": false,
      "youTubeId": "HryRvkRAXxI",
      "subjects": [
        "Church of God Restoration"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HryRvkRAXxI"
      }
    }
  ]
}