{
  "_ts": 0,
  "id": "40d2b421-4613-4189-a2df-b0f7caa9f156",
  "name": "Cindy Quick",
  "youTubeChannelId": "UC5ejXEDc6Wdwlerv-LwupNg",
  "episodes": [
    {
      "id": "aa888711-a6aa-4014-bfdb-ceeb6ad8f50b",
      "title": "Leaving Jehovah\u0027s witnesses is so painful (Monday morning thoughts) ... Read the description",
      "description": "I forgot to share this in the video:\n\nWhen talking with some friends about what this pain is like, I thought of the analogy of needing to have a limb amputated. Of course, no one ever wants to willingly remove a limb, but if that limb somehow becomes damage, injured, infected beyond recovery - if keeping that limb threatens your well-being or ability to carry on a normal sustainable life - unfortunately, you know the wisest course is to surrender the limb. \nEven after doing so, you will have \u0022false pain\u0022 where that limb once was. You\u0027ll have memories of what life was like when you had the limb. Good \u0026 bad. Perhaps you\u0027ll wonder if you made the wrong decision \u0026 \u0027maybe if you just waited longer the limb could\u0027ve gotten better, or you could\u0027ve learned to live with it despite the struggle you would have had for the rest of your life.\u0027\nBut then you think of how healthy you are now, everything you\u0027re still able to do \u0026 even things you were never able to do before that you have strength to do now... Maybe you have a high-performing prosthetic \u0026 most people don\u0027t even notice there\u0027s anything abnormal about you unless you tell them.. \n\nThis is what it\u0027s like to lose loved ones to the org of JWs .. It\u0027s painful \u0026 we will miss them \u0026 memories will continue to resurface, but we can become stronger \u0026 healthier \u0026 happier despite the loss. ❤",
      "release": "2019-08-12T12:37:16Z",
      "duration": "00:14:07",
      "explicit": false,
      "youTubeId": "Z6KgP24nQC4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z6KgP24nQC4"
      }
    },
    {
      "id": "f6b6b89b-9b83-46c4-a7e0-2b8f2b8674b4",
      "title": "Disassociation letter to Jehovah\u0027s witnesses",
      "release": "2019-08-02T19:41:24Z",
      "duration": "00:15:40",
      "explicit": false,
      "youTubeId": "lvMywIutJIk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lvMywIutJIk"
      }
    },
    {
      "id": "ab3161de-880d-4a7b-b4a1-af4249a5f06b",
      "title": "Is disfellowshipping by Jehovah\u0027s witnesses supported by Scripture?",
      "description": "\u0022IS DISFELLOWSHIPPING BY JEHOVAH\u0027S WITNESSES SUPPORTED BY SCRIPTURE?\u0022\n\nTopic covered by so many others.. Im drawing from much of their insightful research \u0026 critical reasoning\nTry not to repeat exactly their words, follow my own sequence of thoughts:\nFUNDAMENTALS\n• What is the message of the bible \n• 2 Tim 3:16 ; Rom 15:4 \nhttps://wol.jw.org/en/wol/d/r1/lp-e/2007167#h=6:0-8:498\nhttps://wol.jw.org/en/wol/d/r1/lp-e/1001061102#h=3:0-3:355\n• What was God\u0027s purpose in providing his people with Laws 10 CMMDMTS \nLove \u0026 justice in ancient Israel in February 2019 study article (part 1 of 4) \nJehovah knows that we long for love and yearn for justice. (Ps. 33:5) We can be sure that our God loves us dearly and wants us to be treated fairly. This becomes evident when we look closely at the Law that Jehovah gave to the nation of Israel through Moses. If you have a heart starved for affection or a spirit crushed by injustice, please consider how the Mosaic Law* reveals Jehovah’s concern for his people.\n\nMay 2019 study edition resumes this series\nLove \u0026 justice in the Christian Cong part 2 of 4 studied week of July 1-7  -grieving widow, prostitute at Simon house Pharisees..\n\nhttps://wol.jw.org/en/wol/d/r1/lp-e/2019404\nhttps://wol.jw.org/en/wol/d/r1/lp-e/1200002694#h=24-26\n\n• Contrast Jesus and Pharisees 4 PHOTOS -JESUS \u0026 PHARISEES\nhttps://wol.jw.org/en/wol/d/r1/lp-e/2001923#h=8-21 (paragraph 5-16 \u0026 21)\nWorks https://wol.jw.org/en/wol/pc/r1/lp-e/1200274432/21/0\n• Mercy forgiveness faith righteousness \nProdigal son https://wol.jw.org/en/wol/d/r1/lp-e/1997640#h=11:0-12:327\nExample of sister... Father was removed as an elder about 10 years ago when my younger sister started coming back to meetings after being d.f\u0027d for 7\u002Byears \u0026 he hugged her at the kingdom hall during the c.o. visit (while she was a long way off to verbalize or demonstrate repentant attitude)\nHe WAS an elder for 25 years! \n\nOther scriptures: \n1 Corinthians 5:9-13 ... Certainly with respect to these verses, the congregation would about association if you continued to attend or tried to draw away other members with yourself. They wouldn\u0027t welcome anyone calling themselves a \u0022bro or sis\u0022 in Cong.. But this makes no mention of family relations being cut off indefinitely )\n2 Corinthians 2:5-10 .... Verse 6 \u0022the majority, not all, especially not family\u0022\n1 Thes 4  ... Not going beyond limits, minding your own business\n2 john 7,10 11  anti Christ\nMatt 18:15-17 .. Sin against you as tax collector, sinner (with whom Jesus himself was frequently reported to have meals with)\n\nRegarding those who renounce beliefs they were taught, those who may be labeled as apostate, mentally corrupt or diseased - there\u0027s all different types of people who deviate from faith or belief, different reasons - good \u0026 bad... Main point: imitate Jesus.... If asked: who is ultimate apostate? Satan the Devil.. How did Jesus treat him? Shun, ignore, avoid contact?\nMatt 4... He was \u0022led by Satan into the wilderness\u0022\nLengthy discussion exchanging thoughts on quoted holy writings.",
      "release": "2019-07-12T20:39:04Z",
      "duration": "00:29:17",
      "explicit": false,
      "youTubeId": "XLd6huiWjGU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XLd6huiWjGU"
      }
    },
    {
      "id": "c72043f8-3a48-4568-aa21-284a949b620e",
      "title": "Exit Letter to Jehovah\u0027s Witness Parents (... that they will probably never read)",
      "description": "It took me a long time to decide whether I wanted to publicly share this with everyone.  But, in my search for letters from others who are going through this same process, I didn\u0027t find any that I could directly relate to although many that I derived encouragement from.\n\nYou\u0027ll notice that a lot of the programming is still ingrained.. Such as saying \u0022I am one of Jehovah witnesses\u0022, instead of \u0022I was..\n\nCorrection: I said 4 siblings, I have 5. 3 blood-related \u0026 2 adopted. 3 nieces \u0026 1 nephew.. \n\nI hope that someone will benefit from hearing my words \u0026 how I\u0027ve processed my thoughts. Many will be able to sympathize with the dilemma of navigating the strong love \u0026 attachments to your family amidst the new directions our lives have taken.\n\nAll photos used in this video were taken by me.\nIn addition to being PIMO, I have an avid appreciation for all things \u0022nature\u0022: sunsets, trees, flowers, birds, water, rainbows.  I hope you enjoy them!\n\nI welcome any and all comments. Specifically those of support \u0026 encouragement. I\u0027m also willing to share encouragement to those needing it, to the best of my ability. \n\nPlease comment, share \u0026 subscribe (the more who subscribe avail me of the ability to share encouraging \u0026 interesting videos that I find interesting \u0026 relatable)... \n\nnew.cq.2019@gmail.com ✌",
      "release": "2019-07-08T22:25:40Z",
      "duration": "00:15:59",
      "explicit": false,
      "youTubeId": "xFCbCvE-x3A",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xFCbCvE-x3A"
      }
    }
  ]
}