{
  "id": "23587672-4263-4f01-b1b0-a6bf7018002c",
  "name": "Cine con Ñ",
  "youTubeChannelId": "UCpdEbUgUVyTjKSL9LKUp9tw",
  "episodes": [
    {
      "id": "527ab671-dc1c-4f26-b5d7-cb6359db5374",
      "title": "SOBREVIVIR AL PARAÍSO: MÁS ALLÁ DE LOS TESTIGOS DE JEHOVÁ - TRÁILER OFICIAL (HD)",
      "description": "Tráiler de \u0027Sobrevivir al paraíso: más allá de los testigos de Jehová\u0027, miniserie documental.\n\nEn cada rincón de nuestro país es fácil encontrarse con personas amables y bien vestidas conocidas como Testigos de Jehová, que distribuyen panfletos religiosos y predican la llegada de Jehová. En el pasado era normal que acudieran por parejas a nuestras casas, siempre con tono amigable y sonrisa perpetua. Pero detrás de esta apariencia inofensiva se oculta lo que muchos exmiembros de la organización describen como una realidad mucho más perturbadora. Sobrevivir al paraíso: más allá de los testigos de Jehová desvela muchos de los “cuestionables métodos” que esta organización se ha empeñado en ocultar durante décadas.\n\nA partir de los testimonios de personas que han abandonado la organización y a expertos en sectas, el documental explora, según sus relatos, cómo funciona esta institución. A lo largo de sus tres episodios recorreremos el camino de algunos de sus antiguos miembros: desde sus inicios en esa familia de amor y fe, pasando por su traumática expulsión o abandono y, posteriormente, cuando consiguen unirse en el dolor y autodenominarse “víctimas”. Algo que desembocará en una feroz lucha judicial en 2022, donde gracias al apoyo del abogado Carlos Bardavío, empiezan, según sus propias palabras, a recuperar su dignidad y libertad.\n\nEstreno en HBO Max: 20 de febrero de 2026.\n\n#SobrevivirAlParaiso #testigosdejehová",
      "release": "2026-01-30T08:20:48Z",
      "duration": "00:01:14",
      "explicit": false,
      "youTubeId": "dUHbpcQqveU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dUHbpcQqveU"
      }
    },
    {
      "id": "7d8e8aed-3d3e-4c33-af11-701fe66a7306",
      "title": "EL MINUTO HEROICO: YO DEJÉ EL OPUS DEI - TRÁILER OFICIAL (HD)",
      "description": "Tráiler de la serie documental \u0027El minuto heroico: yo dejé el Opus Dei\u0027.\n\nEl minuto heroico: yo dejé el Opus Dei relata, a través de sus propios testimonios directos, la vida de trece mujeres procedentes de diversos entornos, países, generaciones y sin vínculos entre ellas, que experimentaron de primera mano los desafíos y realidades del Opus Dei sirviendo como numerarias, numerarias auxiliares o agregadas. Mujeres que relatan haberse sentido sometidas a un trato abusivo laboral, psicológico y espiritual del que decidieron salir y que ahora se atreven a contar.\n\nEstreno en Max España: 7 de febrero de 2025.\n\n#ElMinutoHeroico #YoDejéElOpusDei #OpusDei",
      "release": "2025-01-20T10:09:22Z",
      "duration": "00:01:18",
      "explicit": false,
      "youTubeId": "OawiXNre0-0",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OawiXNre0-0"
      }
    }
  ]
}