{
  "id": "01c022d8-49f5-409b-a622-8e619af39fb2",
  "name": "Citizen TV Kenya",
  "youTubeChannelId": "UChBQgieUidXV1CmDxSdRm3g",
  "episodes": [
    {
      "id": "f1c76077-6b1c-483a-ab92-e4ef8bf4f074",
      "title": "Late GSU officer Isaac Ngala buried at his home in Malindi",
      "description": "Isaac Ngala, the late GSU officer who died in the Shakahola tragedy two years ago, has finally been laid to rest in Muyeye village, Malindi constituency.",
      "release": "2025-11-06T13:18:08Z",
      "duration": "00:01:05",
      "explicit": false,
      "youTubeId": "iDzQ4QEo7b4",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iDzQ4QEo7b4"
      }
    },
    {
      "id": "514395ed-ded6-4bf8-8c28-0bfd1d259cac",
      "title": "Shakahola massacre | Families continue receiving victims’ remains after two years",
      "description": "Families of victims of the Shakahola massacre on Thursday continued collecting the remains of their loved ones at the Malindi mortuary. One more family received four bodies after two agonising years of waiting. So far, 16 bodies have been released to families who are now preparing for burial. Human rights groups say at least 60 victims have been positively identified, while more than 300 bodies remain unclaimed",
      "release": "2025-10-30T18:34:04Z",
      "duration": "00:03:27",
      "explicit": false,
      "youTubeId": "8ximXSsunpM",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8ximXSsunpM"
      }
    },
    {
      "id": "54424fee-7674-44f8-88c6-707c9fa0ace8",
      "title": "Shakahola victims’ families begin burials as government pledges support with transport and fees",
      "description": "Families of victims of the Shakahola massacre have continued to collect bodies of their loved ones from the Malindi mortuary. Out of 34 bodies, 10 have so far been handed over to families that are now preparing for burial. The government says it will assist the families with the transportation of bodies and waiving of mortuary fees, the burden of conducting burials has remained a challenge.",
      "release": "2025-10-29T19:07:30Z",
      "duration": "00:02:53",
      "explicit": false,
      "youTubeId": "n7diFIQHcog",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n7diFIQHcog"
      }
    },
    {
      "id": "a3f98898-3151-4cb6-9aa7-0ae0f3005127",
      "title": "13 fresh graves unearthed in Kwa Binzaro, Kilifi County",
      "description": "Homicide detectives in Malindi have discovered more graves in the Kwa Binzaro area, near Shakahola. The detectives who returned to the scene where eight graves had been found three weeks earlier have identified thirteen more graves, raising the total to 21.",
      "release": "2025-08-15T18:26:30Z",
      "duration": "00:02:02",
      "explicit": false,
      "youTubeId": "S0naJyDZ5r8",
      "subjects": [
        "New Foundation Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S0naJyDZ5r8"
      }
    },
    {
      "id": "1037f074-7983-4e31-a488-95d4fa31390c",
      "title": "Govt to bury 300\u002B unclaimed Shakahola bodies, says Murkomen",
      "description": "The government plans to inter all unidentified bodies exhumed from Shakahola, Kilifi County, after it emerged that the process of identification through DNA samples is taking longer than expected. Interior and national administration cabinet secretary Kipchumba Murkomen says, families have not presented themselves, hindering the conclusion of this process. Over 300 bodies are yet to be identified",
      "release": "2025-08-13T18:32:51Z",
      "duration": "00:02:31",
      "explicit": false,
      "youTubeId": "BUs6MnTve20",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BUs6MnTve20"
      }
    },
    {
      "id": "74a39ad7-c15c-4025-a5c1-066eaec15379",
      "title": "Court approves exhumation in Malindi cult case as Shakahola hearings continue",
      "description": "The Directorate of Criminal Investigations (DCI) has been granted permission by a Malindi court to exhume bodies believed to be buried in shallow graves at Kwa Binzaro area in Kilifi County. In a court directive, Resident Magistrate Irene Thamari instructed Chief Government Pathologist Dr. Johansen Oduor and the homicide unit to lead the exhumation exercise. The operation will include postmortem examinations, DNA testing, and toxicological analysis aimed at establishing the exact causes of death. The manslaughter case against controversial pastor Paul Mackenzie and 94 others continued with two prosecution witnesses testifying in Mombasa.",
      "release": "2025-07-30T18:53:41Z",
      "duration": "00:02:41",
      "explicit": false,
      "youTubeId": "mUbrKGnyMT4",
      "subjects": [
        "Good News International Ministries",
        "New Foundation Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mUbrKGnyMT4"
      }
    },
    {
      "id": "3ed3558c-c14e-4d29-bd9a-d7099f995b55",
      "title": "Malindi cult fears grow as 48 reported Missing, secret burials suspected",
      "description": "Fears that six children from one family are among dozens who have died in what appears to be a fresh wave of the shakahola massacre. A close relative, who spoke to the children’s parents and the leaders suspected to be behind this second round of killings says the parents themselves confirmed the deaths. Human rights activists now claim more than forty people could have been killed and secretly buried in kwa Binzaro since March.",
      "release": "2025-07-23T18:26:41Z",
      "duration": "00:04:11",
      "explicit": false,
      "youTubeId": "f2TvinVZkQ8",
      "subjects": [
        "Good News International Ministries",
        "New Foundation Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f2TvinVZkQ8"
      }
    },
    {
      "id": "b20be208-d46f-495b-b5ce-37cd52887243",
      "title": "11 suspects linked to a cult in Kilifi detained",
      "description": "CitizenTV Live",
      "release": "2025-07-21T18:48:18Z",
      "duration": "00:03:13",
      "explicit": false,
      "youTubeId": "6GYiEmLv7ZA",
      "subjects": [
        "Good News International Ministries",
        "New Foundation Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6GYiEmLv7ZA"
      }
    },
    {
      "id": "c4963f31-596e-4320-9bce-45f12834dfe8",
      "title": "Another cult in Shakahola?",
      "description": "TONIGHT, DISTURBING DEVELOPMENTS OUT OF KILIFI COUNTY ARE REIGNITING FEARS THAT THE HORROR OF THE SHAKAHOLA TRAGEDY MAY NOT BE OVER. ALMOST TWO YEARS SINCE THE HORRIFYING DISCOVERY OF MASS GRAVES IN SHAKAHOLA FOREST,THERE ARE RENEWED CASES OF CULT-PRACTICES  AFTER  AUTHORITIES  RECOVERED ONE BODY AND RESCUED FOUR EMACIATED INDIVIDUALS , JUST KILOMETERS FROM THE ORIGINAL SHAKAHOLA SITE. EVEN MORE UNSETTLING, AMONG THOSE ARRESTED ARE A HUSBAND AND WIFE WHO ARE FORMER VICTIMS OF THE SHAKAHOLA CULT, WHO VANISHED FROM THEIR HOME IN SIAYA COUNTY AND RETURNED TO THE FOREST",
      "release": "2025-07-20T18:29:05Z",
      "duration": "00:03:33",
      "explicit": false,
      "youTubeId": "9kzdc4Bc-xU",
      "subjects": [
        "Good News International Ministries",
        "New Foundation Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9kzdc4Bc-xU"
      }
    },
    {
      "id": "951f9551-3aa3-4b36-ab31-5151605e18d8",
      "title": "Family in search of kin who joined cult-like church",
      "description": "Pauline Adhiambo is said to have joined the sect in 2002",
      "release": "2025-04-25T18:29:59Z",
      "duration": "00:05:07",
      "explicit": false,
      "youTubeId": "aTl9oDfe-4g",
      "subjects": [
        "Melkio St Joseph Missions of Messiah Africa Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aTl9oDfe-4g"
      }
    },
    {
      "id": "ac0b92ef-4a83-41e6-926a-7ced2f830ed0",
      "title": "Police arrest leaders of controversial church in Kilifi",
      "description": "Gandi is founder of New Foundation Church",
      "release": "2025-04-25T18:27:55Z",
      "duration": "00:06:29",
      "explicit": false,
      "youTubeId": "aO95ktD7r78",
      "subjects": [
        "New Foundation Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aO95ktD7r78"
      }
    },
    {
      "id": "571b31cf-4664-403c-b3f5-1c359c9f2f44",
      "title": "Rongo 57 \u0027sect\u0027 members to remain in police custody for 30 days",
      "description": "Police seal off St.Joseph Missions of Messiah Africa Church",
      "release": "2025-04-24T18:24:57Z",
      "duration": "00:04:08",
      "explicit": false,
      "youTubeId": "ZRC1m5sRxns",
      "subjects": [
        "Melkio St Joseph Missions of Messiah Africa Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZRC1m5sRxns"
      }
    },
    {
      "id": "29d3bb4b-6bee-4695-a119-65f7cfacf374",
      "title": "Rongo ‘Sect’ Probe:  CS Murkomen says all chiefs will be held accountable",
      "description": "Murkormen: We’ll engage all chiefs, sub-chiefs in that area\n\nPolice seal off St. Joseph Missions of Messaiha Africa Church",
      "release": "2025-04-24T13:29:09Z",
      "duration": "00:01:16",
      "explicit": false,
      "youTubeId": "MA7IUNvrslU",
      "subjects": [
        "Melkio St Joseph Missions of Messiah Africa Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MA7IUNvrslU"
      }
    },
    {
      "id": "830dc611-eb60-42c5-a2b6-f7ae5c48422f",
      "title": "Rongo church closed",
      "description": "There was Drama at the Rongo Police Station in Migori county after 57 faithful of Melkio St. Joseph Missions of Messaiha Africa Church refused to go home, insisting that they could only return to their church, where two members reportedly perished after refusing to seek medical attention. Migori County Commissioner Mutua Kiilu revealed that there were registration anomalies while setting up the facility, which remains cordoned off by police officers undertaking investigations amid reports of Cult-LIKE activities associated with the Church.\n#CitizenTV #citizendigital",
      "release": "2025-04-23T18:20:08Z",
      "duration": "00:03:46",
      "explicit": false,
      "youTubeId": "2a_P-E12rnk",
      "subjects": [
        "Melkio St Joseph Missions of Messiah Africa Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2a_P-E12rnk"
      }
    },
    {
      "id": "8a2fcad3-972f-4177-b16f-3fcfcd1b03cc",
      "title": "\u0022Cult\u0022 in Migori",
      "description": "Police in Migori County have recovered two bodies at St. Joseph Mission of Africa, church is located at Kochola village in Rongo sub-county. 57 other people believed to be faithful to the church were rescued by the police in what is suspected to be indoctrination-driven habits. Police say the congregants are defiant about undergoing medical checks as they chanted and sang religious songs.",
      "release": "2025-04-22T18:11:36Z",
      "duration": "00:03:00",
      "explicit": false,
      "youTubeId": "YAxrNCPgaw8",
      "subjects": [
        "Melkio St Joseph Missions of Messiah Africa Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YAxrNCPgaw8"
      }
    },
    {
      "id": "107516f3-2bb0-4ee6-a0e5-34489dc99c81",
      "title": "How controversial pastor Paul Mackenzie acquired the Shakahola cult farm using elders",
      "description": "Tonight, we unravel how controversial pastor Paul Mackenzie acquired the Shakahola cult farm using elders from the 5 clan groups that claim ownership of more than 100,000 acres of the Chakama ranch in Kilifi County. Emmanuel Mwaro one of the signatories to an agreement says Mackenzie doesn’t own the land but only paid 500,000 shillings for a one-year stay commonly known as Kajama. \nIn an exclusive agreement in our possession Mackenzie initially wanted to settle in and use 800 acres before changing his mind and opting for a 500-acre piece of land. And as Francis Mtalaki reports top security officers were aware of the transactions and at some point accompanied Mackenzie for his mission in the forest.",
      "release": "2023-05-27T18:50:55Z",
      "duration": "00:05:16",
      "explicit": false,
      "youTubeId": "QQCOqnrOnoI",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QQCOqnrOnoI"
      }
    }
  ]
}