{
  "id": "ebe5b9ad-46b7-4382-8f91-dc9e4366cedc",
  "name": "CLARÍN",
  "youTubeChannelId": "UCjMGMWnToRcQRqmyVB4R2xQ",
  "episodes": [
    {
      "id": "9219c852-cb3b-44cc-9fb6-7fa4f2eec2e8",
      "title": "EL EXPEDIENTE OCULTO: ¿Qué pasó realmente en la celda de Jeffrey Epstein?",
      "description": "#Clarin ¿Qué ocurrió realmente en la celda de máxima seguridad más vigilada de Nueva York el 10 de agosto de 2019? Nuevos documentos publicados por el Departamento de Justicia de Estados Unidos vuelven a poner bajo la lupa la muerte de Jeffrey Epstein y revelan una sucesión de decisiones erróneas, advertencias ignoradas y rupturas graves del protocolo penitenciario. \n\nLos archivos confirman que el financista, acusado de liderar una red de abusos sexuales y enfrentar una condena de hasta 45 años de prisión, no fue monitoreado adecuadamente pese a presentar indicadores claros de suicidio. Desde su primer intento fallido y el deterioro físico documentado, hasta denuncias de un posible ataque en su celda, evaluaciones psicológicas contradictorias y un correo clave que alertaba sobre un “error crítico”.\n\nEl video reconstruye los cinco detalles centrales que explican cómo Epstein fue retirado de la unidad de riesgo y quedó sin la vigilancia obligatoria cada 15 minutos. Aunque no se hallaron pruebas de intervención de terceros, los documentos exponen una cadena de fallos humanos que sigue alimentando las dudas: ¿negligencia extrema o un descuido deliberado para evitar que sus secretos llegaran a juicio?\n\nSUSCRIBITE A NUESTRO CANAL AHORA 👉 https://clar.in/3Hem3wN\n🤜 Mantenete siempre informado en https://clarin.com 🤛\n👉 Seguinos en Instagram: https://instagram.com/clarincom\n👉 Seguinos en Twitter: https://twitter.com/clarincom\n👉 Seguinos en Facebook: https://facebook.com/clarincom\n👉 Seguinos en TikTok: https://tiktok.com/@clarincom\n👉 Seguinos en Spotify: https://clar.in/spotify",
      "release": "2025-12-28T00:00:07Z",
      "duration": "00:03:44",
      "explicit": false,
      "youTubeId": "c-PGiujJ7ws",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c-PGiujJ7ws"
      }
    }
  ]
}