{
  "_ts": 0,
  "id": "6f2e7163-7750-4702-9d19-6b6a8038999b",
  "name": "ClaraoftheWood",
  "youTubeChannelId": "UC9HyIA1xNgAhF1Z3Xb--cOQ",
  "episodes": [
    {
      "id": "827ed626-b3d1-4248-9978-5e6dba9924b1",
      "title": "Shocking Cult Book for Kids, I Completely Forgot How Bad This Was!! Shiny Happy People cult teaching",
      "description": "In this video I go through an old children\u0027s book from the fundamentalist christian cult that my mom was raised in, and share some initial findings of really awful teaching that it contains. \nI don\u0027t go into the explanations of how these teachings are traumatizing as much as I wanted to, I hope to do that more in later videos. But if you\u0027re curious, here\u0027s a brief overview of complex PTSD (C-PTSD) in children, and you can draw some of those comparisons yourself:  https://www.ptsduk.org/complex-ptsd-in-children-and-young-adults/#:~:text=This%20often%20means%20they%20have,and%20other%20aches%20and%20pains. \n\nThe cult is the IBLP, Institute of Basic Life Principles, that was founded by Bill Gothard, and continues to this day, despite him resigning in disgrace for allegedly sexually assaulting many young women, minors included. It\u0027s been covered by the documentary on Amazon Prime, Shiny Happy People, Duggar Family Secrets, that came out in 2023. And also by many incredible content creators here on Youtube, such as:  \n\nFundie Fridays Duggar Playlist: https://www.youtube.com/playlist?list=PL14QTLTKyyNafD5BrMxbFH6eGHI-jBqvm\nFundie Fridays Shiny Happy People Playlist: https://www.youtube.com/playlist?list=PL14QTLTKyyNYOk7GxgLQG-kDQWQ0irI5v\nCults to Consciousness IBLP/Gothard Playlist: https://www.youtube.com/playlist?list=PL83GIJOYK-h8KC3O9uU5VKpGQ9w1-D6Lr\nDavey Jackson, a comedian who survived this cult, and talks about it with other survivors: https://www.youtube.com/@daveyjaxx\n\nThis book is still available for sale on the IBLP website\nhttps://store.iblp.org/character-sketches-volume-2.html",
      "release": "2024-07-16T23:41:56Z",
      "duration": "00:31:27",
      "explicit": false,
      "youTubeId": "kvO4WkbKiJI",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kvO4WkbKiJI"
      }
    }
  ]
}