{
  "id": "c1b21c7e-2514-4ee0-a571-ec1dc6f9f5de",
  "name": "Clear \u0026 Loud with Josh Harris",
  "spotifyId": "2AOHfPDU3NFkoPqlgDydMZ",
  "appleId": 1612325690,
  "youTubeChannelId": "UCNK3vRJWycKMSQNUrZ4_XIQ",
  "youTubePlaylistId": "PLrR-1-vNW_aMWXDvGybwsZN5fqjSEyMCz",
  "episodes": [
    {
      "id": "7836eb46-8b1b-4753-953c-e69cfda621de",
      "title": "Escaping Cult Thinking, Finding Real Connection (with Ben Crawford)",
      "description": "Content note: This episode includes frank discussion of sex, pornography, and religious control. Author Ben Crawford spent decades inside a tight church network where life, money, and meaning were all centralized. When he started sharing his life on YouTube and telling the truth in 12-step rooms, the system pushed back. He lost community, business ties, and friends. He also found something bigger: a voice, a marriage that’s alive, and a way of connecting that doesn’t hide behind ideas. This is a conversation about escaping control, learning vulnerability, and why honesty beats “accountability” every time. Topics we cover Preaching vs sharing: why ideas felt safe and intimacy didn’t The men’s “accountability” script and why it blocks connection What 12-step groups modeled: clear truth, no fixing, real safety The “cult continuum” and how control shows up in everyday church life Grading communities by behavior, not labels Choosing where to be authentic and where to hold boundaries Ben’s love story with Cami and the surprising payoff of telling the truth Why listen If you’ve felt the gap between what your community promised and what it delivered, or if you’ve tried to change people with ideas and missed the chance to actually bond, this episode gives language and practices for a different way forward. About Ben Ben Crawford is the author of the bestselling 2000 Miles Together: The Story of the Largest Family to Hike the Appalachian Trail and has been featured on Good Morning America and NPR’s This American Life. Formerly entrenched in fundamentalist religion and once at the helm of one of the world’s largest blackjack teams (profiled in the documentary Holy Rollers: The True Story of Card Counting Christians), Ben brings a singular perspective to faith, risk, and reinvention. Retired in his 30s, he’s a prolific YouTuber with 1,000\u0026#43; uploads, and he now finds joy in poker and marathon running—with his six kids often along for the mile markers. Links Ben’s book: The Courage to Share (affiliate link) Ben’s YouTube family channel: https://www.youtube.com/@FightforTogether",
      "release": "2025-10-24T21:54:22Z",
      "duration": "01:04:15.9160000",
      "explicit": false,
      "spotifyId": "5bx36kBB2wMzy4MO5tS7BG",
      "appleId": 1000733384997,
      "youTubeId": "BgSO8NYmxiM",
      "subjects": [
        "Evangelicalism",
        "Alcoholics Anonymous"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5bx36kBB2wMzy4MO5tS7BG",
        "apple": "https://podcasts.apple.com/podcast/escaping-cult-thinking-finding-real-connection-with/id1612325690?i=1000733384997",
        "youtube": "https://www.youtube.com/watch?v=BgSO8NYmxiM"
      }
    },
    {
      "id": "b17251ff-2c8e-4ccb-a01e-28150f574c05",
      "title": "Holy Hurt: Understanding Spiritual Trauma (with Dr. Hillary McBride)",
      "description": "In this episode, I talk with psychologist and author Hillary McBride about her powerful book Holy Hurt. We explore what spiritual trauma really is, how it shows up in our bodies and beliefs, and what healing can look like. We also talk openly about my own past as a pastor—how I once taught things that caused harm—and why I believe it’s so important to have these honest, healing conversations now.\n\n\n\n\n\n\nTopics We Cover\n\n  •  What makes something “spiritual trauma”\n  •  Why it’s so hard to name trauma that’s systemic, not just event-based\n  •  The cost of being told you\u0027re broken at the core\n  •  How our bodies remember what our minds try to forget\n  •  The difference between real healing and spiritual bypassing\n  •  What leaders and former leaders can do when they realize they’ve hurt others\n  •  Hope for anyone starting to rebuild after religious pain＜#＞\n\n\n\n\n\nAbout Hillary McBride\n\n\nDr. Hillary McBride is a therapist, researcher, and author who specializes in trauma, spirituality, and the mind-body connection. Her book Holy Hurt helps readers name and heal from the spiritual wounds many carry but struggle to describe. \n\n\nWebsite (https://hillarylmcbride.com/) \n\n\nInstagram (https://www.instagram.com/hillaryliannamcbride/) \n\n\n\n\n\n\nSpecial Event\n\n\nJosh and Hillary are doing a live event on June 26, 2025 in Abbotsford, BC, called Healing After Spiritual Trauma. Get tickets (https://www.eventbrite.com/e/healing-after-spiritual-trauma-a-conversation-on-reconnection-and-renewal-tickets-1280947240679)  to this unique conversation and gathering. All proceeds will be donated to Fresh Bread, a charity dedicated to breaking down barriers in access to qualified caring therapists. \n\n\n\n\n\n\nAbout Clear \u0026 Loud\n\n\nClear \u0026 Loud is hosted by Josh Harris—a writer, former pastor, and brand strategist. Through honest conversations and creative coaching, Josh helps people find clarity in the messiness of change. Learn more at clearandloud.com (https://www.clearandloud.com) .",
      "release": "2025-06-04T05:09:03Z",
      "duration": "01:06:16",
      "explicit": false,
      "spotifyId": "2jVt6LECE1BqeRtPRfHGMw",
      "appleId": 1000711119048,
      "youTubeId": "NQF375Tgbj0",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2jVt6LECE1BqeRtPRfHGMw",
        "apple": "https://podcasts.apple.com/podcast/holy-hurt-understanding-spiritual-trauma-with-dr/id1612325690?i=1000711119048",
        "youtube": "https://www.youtube.com/watch?v=NQF375Tgbj0"
      }
    },
    {
      "id": "9a1fc3cf-87b5-4169-9af0-7b9ee0da2eae",
      "title": "Unbuttoning Modesty Culture (with Freeman Voyles)",
      "description": "Freeman Voyles is a young Catholic writer, podcaster, and creator of Kneutrality (https://www.kneutrality.com) , a platform where she blends traditional Catholic beliefs with fresh, sometimes provocative, cultural commentary. With her signature blend of sex appeal, sacred conviction, and aesthetic honesty, Freeman is reimagining what modesty, sensuality, and spirituality can look like, especially for Gen Z.\n\n\n\n\n\n\nConversation highlights: \n＜#＞\n\n- Why she named her platform Kneutrality and what it actually means\n\n\n- Her journey out of MAGA and why she dumped Trump\n\n\n- How she uses Instagram to challenge both purity culture and performative modesty\n\n\n- The tension between sensuality and lust, and why she believes there’s a sacred space for one and not the other\n\n\n- Her vision for a world of “more sensuality, less sex”\n\n\n\n\n\n\nAbout Freeman Voyles:\nFreeman is a Catholic writer, podcaster, and creator of Kneutrality — a space for faith, culture, and sexuality rooted in honesty, beauty, and bold devotion. Through content, liturgical journals, and her podcast, she’s helping young adults live boldly for God and think critically about the messages they’ve inherited.\n\n\n\n\n\n\nConnect with Freeman: \n\n  •  Kneutrality website (https://www.kneutrality.com/) \n  •  Instagram @kneutrality (https://www.instagram.com/kneutrality/) \n  •  Liturgical Planner (https://www.kneutrality.com/store/p/milk-honey-2025-liturgical-planner-part-1) \n\n\n\n\n\nAbout Clear \u0026 Loud\n\n\nClear \u0026 Loud is the coaching and creative consultancy of Josh Harris. Through one-on-one coaching and brand strategy work, Josh helps individuals and organizations find clarity in the messiness: clarity of message, purpose, and direction. Whether you’re navigating a major life shift or building a brand that reflects your evolving story, Clear \u0026 Loud offers practical tools, thoughtful guidance, and engaging storytelling. Learn more at www.clearandloud.com (http://www.clearandloud.com) .",
      "release": "2025-05-16T23:02:16Z",
      "duration": "00:52:26",
      "explicit": false,
      "spotifyId": "1o29oMIiLJ52VYIPtgYAnf",
      "appleId": 1000708790426,
      "youTubeId": "mfAsnVS99x4",
      "subjects": [
        "Catholicism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1o29oMIiLJ52VYIPtgYAnf",
        "apple": "https://podcasts.apple.com/podcast/unbuttoning-modesty-culture-with-freeman-voyles/id1612325690?i=1000708790426",
        "youtube": "https://www.youtube.com/watch?v=mfAsnVS99x4"
      }
    },
    {
      "id": "5266259e-3184-4c6f-9180-32f1c67b04a7",
      "title": "From Mormon to Atheist Spiritual Director (with Britt Hartley)",
      "description": "In this episode, Britt Hartley shares her journey from a deeply religious upbringing to becoming an atheist spiritual director, exploring what it means to find purpose, meaning, and inner peace outside of traditional faith. With a background in theology, Britt brings a unique perspective on how to navigate life’s biggest questions without relying on religious frameworks. Together, we dive into her approach to secular spirituality, where she guides others through deconstructing old beliefs and building lives rooted in authenticity and personal values. Join us as we unpack her transformative insights on rethinking spirituality, free from dogma.\n\n\n\n\n\n\nTopics Covered:\n\n  •  Britt’s journey from religion to secular spirituality and how it shaped her approach to spiritual direction\n  •  Understanding the three main paths for interpreting life—Religion, Occult, and Science—and exploring the strengths and pitfalls of each\n  •  The impact of cognitive biases on our beliefs and why we’re often so certain of our personal “truths”\n  •  Practical steps for crafting a life of meaning and purpose beyond religious structures\n  •  Tools and rituals for navigating existential crises, building identity, and cultivating a grounded, secular sense of spirituality\n\n\n\n\n\nAbout Britt Hartley:\nBritt Hartley is an atheist spiritual director with a master’s degree in theology and a focus on the future of American religion. She is the author of No Nonsense Spirituality, a bestselling Amazon book that brings a clear, grounded approach to finding meaning and purpose beyond religious belief. Britt’s work centers on secular spirituality and tools for navigating existential crises.\n\n\n\n\n\n\nConnect with Britt\n\n  •  Website: nononsensespirituality.com (http://nononsensespirituality.com/) \n  •  TikTok (https://www.tiktok.com/@nononsensespirituality?lang=en) \n  •  Instagram (https://www.instagram.com/accounts/login/?next=https%3A%2F%2Fwww.instagram.com%2Fnononsensespirituality%2F%3Fhl%3Den\u0026is_from_rle) \n     \n     \n     \n     \n     \n\nAbout Clear \u0026 Loud\nClear \u0026 Loud is the coaching and creative consultancy of Josh Harris. Through one-on-one coaching and brand strategy work, Josh helps individuals and organizations find clarity in the messiness—clarity of message, purpose, and direction. Whether you’re navigating a major life shift or building a brand that reflects your evolving story, Clear \u0026 Loud offers practical tools, thoughtful guidance, and impactful storytelling. Learn more at www.clearandloud.com (http://www.clearandloud.com) .",
      "release": "2024-11-02T04:23:13Z",
      "duration": "01:15:33",
      "explicit": false,
      "spotifyId": "2oLcsvbR0etSSEdKLt4Gpf",
      "appleId": 1000675417139,
      "youTubeId": "Lh2aZQODbmQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2oLcsvbR0etSSEdKLt4Gpf",
        "apple": "https://podcasts.apple.com/podcast/from-mormon-to-atheist-spiritual-director-with-britt/id1612325690?i=1000675417139",
        "youtube": "https://www.youtube.com/watch?v=Lh2aZQODbmQ"
      }
    },
    {
      "id": "1badb28d-9c8c-4115-808c-2cca98d72652",
      "title": "Deconstructing Purity Culture Through Comics (with Stephanie Stalvey)",
      "description": "In this episode, Josh Harris has a thought-provoking conversation with Stephanie Stalvey, a gifted comic book artist who is using her art to navigate and critique the complexities of purity culture. Stephanie shares the inspiration behind her graphic memoir \u0022PURE,\u0022 a deeply personal exploration of growing up within and ultimately questioning the evangelical purity movement.\n\n\n\nListeners will dive into:\n\n\n     \n      \n  •  \n     \n     The unique power of comics as a medium for storytelling and social commentary.\n     \n     \n     \n      \n  •  \n     \n     Stephanie’s personal journey from adhering to purity culture to questioning its norms.\n     \n     \n     \n      \n  •  \n     \n     The creative process behind translating intimate life experiences into art.\n     \n     \n     \n       \n  •  \n     \n     The impact of purity culture on personal identity, relationships, and sexuality.\n     \n     \n     \n       \n  •  \n     \n     How \u0022PURE\u0022 has become a platform for community, conversation, and healing for those with similar experiences.\n     \n     \n     \n     \n\n\nWhether you’re fascinated by the intersection of art and activism, curious about the effects of purity culture, or a fan of graphic storytelling, this episode offers insightful perspectives on how personal narratives can challenge societal norms and promote healing. Join us to discover how Stephanie Stalvey is making waves with her comics and sparking important discussions around faith, freedom, and the right to own one’s story.\n\n\n\nLearn More: \n\n\n\nInstagram: https://www.instagram.com/stephanie.stalvey.artist/ \n\n\n\nWebsite: stephaniestalvey.com (http://stephaniestalvey.com/)  \n\n\n\nPatreon: patreon.com/stephaniestalvey (http://patreon.com/stephaniestalvey)",
      "release": "2024-05-21T17:42:36Z",
      "duration": "01:02:20",
      "explicit": false,
      "spotifyId": "5nCiHMTJjKOW2JusqJZ1Xj",
      "appleId": 1000648986907,
      "youTubeId": "rtqhrMk_wFc",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nCiHMTJjKOW2JusqJZ1Xj",
        "apple": "https://podcasts.apple.com/podcast/deconstructing-purity-culture-through-comics-with/id1612325690?i=1000648986907",
        "youtube": "https://www.youtube.com/watch?v=rtqhrMk_wFc"
      }
    },
    {
      "id": "8763205a-8d99-4aeb-b9f4-5c9b9098a321",
      "title": "Evangelical Aftermath (with Jon Ward)",
      "description": "Did evangelicalism fail a generation? How do disillusioned Christians process their experiences in churches and hold on to their faith? How do families divided over Trump find common ground? \n\n\n\nIn this revealing episode, I sit down with Jon Ward, journalist, author, and chief national correspondent at Yahoo! News, to discuss his latest book, Testimony: Inside the Evangelical Movement that Failed a Generation.\n\n\n\nJon Ward describes his life as being divided in half: two decades inside the evangelical Christian bubble and two decades outside of it.\n\n\n\nIn Testimony, Ward tells the story of his upbringing in, and eventual break from, an influential evangelical church in the 1980s and 1990s (more about that particular church below). Ward sheds light on the evangelical movement\u0027s troubling political and cultural dimensions, tracing the ways in which he believes the Jesus People movement was seduced by materialism and other factors to become politically captive rather than prophetic.\n\n\n\nFull disclosure: the church Jon grew up in and which he strongly critiques in his book is the same that I joined at age 22 and went on to pastor for ten years. For me, this is a very personal conversation. Our discussion offers listeners a front-row seat to the intersection of faith, politics, and the challenges of reckoning with one\u0027s past. \n\n\n\nInterview Highlights: \n\n\n     \n      \n  •  \n     \n     Jon\u0027s perspective on influential figures like CJ Mahaney and Al Mohler and their roles within the evangelical movement.\n     \n     \n     \n      \n  •  \n     \n     The ramifications of political trends and the Trump presidency, on personal relationships and faith.\n     \n     \n     \n       \n  •  \n     \n     Whether it’s possible to be open to being wrong and still hold to absolute truth \n     \n     \n     \n       \n  •  \n     \n     Comparing the roles of church leaders and the media in accountability and the parallels Jon sees between them.\n     \n     \n     \n       \n  •  \n     \n     Jon\u0027s vision for the future of modern American Christianity and the steps he believes are crucial for its transformation.\n     \n     \n     \n     \n\n\nWhether you\u0027re entrenched in the evangelical community, just curious, or somewhere in between, this episode promises a candid exploration of faith, growth, and the complexities of human experience.\n\n\n\n\nLearn More: \n\n\n\nWebsite: Jonwardwrites.org (http://jonwardwrites.org/) \n\n\n\nInstagram: https://www.instagram.com/jonwardwrites/\n\n\n\nTwitter: https://twitter.com/jonward11",
      "release": "2024-05-21T17:42:36Z",
      "duration": "01:17:33",
      "explicit": false,
      "spotifyId": "1WxPYwStw7XIJ3q5HuuKae",
      "appleId": 1000630252320,
      "youTubeId": "Vd4Vp0qw3Mc",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1WxPYwStw7XIJ3q5HuuKae",
        "apple": "https://podcasts.apple.com/podcast/evangelical-aftermath-with-jon-ward/id1612325690?i=1000630252320",
        "youtube": "https://www.youtube.com/watch?v=Vd4Vp0qw3Mc"
      }
    }
  ]
}