{
  "_ts": 0,
  "id": "fbb1c9fb-6173-4cd8-bc5d-38815a3220ec",
  "name": "Clemenz With a ”Z” Podcast",
  "spotifyId": "4nEzoDSGtBum6csCPUtNxT",
  "appleId": 1473695420,
  "youTubeChannelId": "UCLvI3MeNTiPOkt2C_kWeUWQ",
  "episodes": [
    {
      "id": "1da4567f-55db-477b-9ad3-7fc59696e748",
      "title": "EP 138 Follow Up With Kesha",
      "description": "In this special episode of Clemenz With a \u0027Z\u0027, we welcome back Keisha, the very first guest of our \u0022We Were In a Cult?\u0022 series. Keisha\u0027s initial interview sparked a movement, inspiring 50 episodes that have reached listeners across six countries. In this follow-up conversation, we reflect on the impact of her story, the growth of the series, and the healing journey we\u0027ve embarked on together. Join us as we dive deeper into the question that started it all: Were we in a cult? This is a must-listen for anyone exploring life after high-control environments and seeking hope and understanding. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Until next time, take care, stay grateful, and keep growing. Peace!",
      "release": "2024-12-23T14:23:14Z",
      "duration": "01:13:02.5430000",
      "explicit": true,
      "spotifyId": "6dQglT5erdikrIIczbi45I",
      "appleId": 1000681424817,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6dQglT5erdikrIIczbi45I",
        "apple": "https://podcasts.apple.com/podcast/ep-138-follow-up-with-kesha/id1473695420?i=1000681424817"
      }
    },
    {
      "id": "c5e686b8-b2d5-4215-be2c-7c8cb7199750",
      "title": "EP 137 We Were In a Cult? Max\u0027s Story",
      "description": "Source:\nhttps://www.podbean.com/eau/pb-aad7u-177e9a5\n\nIn the latest episode of Clemenz With a \u0027Z\u0027, we bring you a powerful conversation from our series We Were In a Cult?. This week, Max shares his unique perspective as someone who grew up within the International Churches of Christ (ICOC) and remains a member today. Despite his deep ties to the church, Max opens up about the challenges of recognizing the trauma and manipulation many have experienced in this environment. His story sheds light on the complexities of maintaining faith while approaching difficult truths with an open heart and mind. Join us as we explore Max\u0027s journey and the delicate balance between belief and questioning, offering hope and understanding for those navigating similar experiences.\nIf you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. \nAs always, thank you for your continued support and if you like what you hear please rate and review!  If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.\nIf you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524\nUntil next time, take care, stay grateful, and keep growing. Peace!",
      "release": "2024-12-22T15:42:35Z",
      "duration": "01:56:42.3750000",
      "explicit": true,
      "spotifyId": "00bs90Cd4RS5IVriMvXKJb",
      "appleId": 1000681310300,
      "youTubeId": "cXgT1ixP_Cw",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/00bs90Cd4RS5IVriMvXKJb",
        "apple": "https://podcasts.apple.com/podcast/ep-137-we-were-in-a-cult-maxs-story/id1473695420?i=1000681310300",
        "youtube": "https://www.youtube.com/watch?v=cXgT1ixP_Cw"
      }
    },
    {
      "id": "21bbf724-f6f9-416f-8336-b03ed49f937f",
      "title": "EP 136 We Were In a Cult?  Chris\u0027 Story",
      "description": "In this segment of the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 podcast, we’re joined by former member of the ICOC Chris, who shares his deeply personal journey through and beyond the International Churches of Christ. In this conversation, Chris opens up about the psychological remnants of his time in the ICOC, from internalized guilt to the challenges of embracing his own story. We’ll explore the concept of \u0022little t\u0022 traumas—those subtle yet profound experiences that leave lasting marks—and discuss how the church\u0027s teachings, like the idea of \u0022denying oneself,\u0022 shaped Chris’s sense of self-worth and identity. This episode is an honest reflection on healing, self-acceptance, and the courage it takes to reclaim your narrative after leaving a high-control environment. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Until next time, take care, stay grateful, and keep growing. Peace!",
      "release": "2024-11-25T15:25:56Z",
      "duration": "01:57:40.8650000",
      "explicit": true,
      "spotifyId": "0wKjs0Lr5mUT3eDhDlBAUo",
      "appleId": 1000678176170,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0wKjs0Lr5mUT3eDhDlBAUo",
        "apple": "https://podcasts.apple.com/podcast/ep-136-we-were-in-a-cult-chris-story/id1473695420?i=1000678176170"
      }
    },
    {
      "id": "b24a823a-d4d5-4cd9-ac11-52dd3d8dea0f",
      "title": "EP 134 We Were In a Cult?  Emma\u0027s Story",
      "description": "In this emotional and powerful installment of We Were In a Cult?, Emma Fellows shares her deeply personal journey of healing after her time in the International Churches of Christ. Emma opens up about the challenges she faced, including navigating trauma related to her gender identity, mental health struggles, and the pain of being invalidated by those who caused harm. Trigger Warning: This episode discusses sensitive topics, including self-harm, suicide, and trauma related to gender identity. We encourage readers and listeners to take care of themselves and seek support if needed. Emma’s story is a testament to the power of speaking out, reclaiming your voice, and finding hope amid difficult circumstances. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-11-18T13:36:49Z",
      "duration": "02:06:21.0750000",
      "explicit": true,
      "spotifyId": "0Huh6sPZFWtUTGh6MNQmHx",
      "appleId": 1000677324365,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Huh6sPZFWtUTGh6MNQmHx",
        "apple": "https://podcasts.apple.com/podcast/ep-134-we-were-in-a-cult-emmas-story/id1473695420?i=1000677324365"
      }
    },
    {
      "id": "cf85a286-7c4d-4f5d-ba66-358166350908",
      "title": "EP 132 We Were In a Cult? Lian\u0027s Story",
      "description": "In this episode of We Were In a Cult?, I’m joined by Lian, who shares her story of growing up within the ICOC after being adopted into a family devoted to the church. Raised with the ICOC’s strict beliefs and expectations, Leanne opens up about her journey from childhood innocence to an intense struggle with guilt and self-worth under the church\u0027s pressures. From confronting the demands of ‘sin studies’ to redefining her faith, she reveals the courage it took to walk away from the only life she knew. This is a powerful conversation about resilience, identity, and the freedom of self-discovery beyond control.\nIf you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. \nAs always, thank you for your continued support and if you like what you hear please rate and review!  If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.\nIf you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524\nPeace!",
      "release": "2024-11-11T14:45:16Z",
      "duration": "01:42:45",
      "explicit": false,
      "spotifyId": "6Un4CaEmIelI1zAuC5eaPc",
      "appleId": 1000676505769,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Un4CaEmIelI1zAuC5eaPc",
        "apple": "https://podcasts.apple.com/podcast/ep-132-we-were-in-a-cult-lians-story/id1473695420?i=1000676505769"
      }
    },
    {
      "id": "4e56aa43-9190-463c-aa14-d8826de6fca6",
      "title": "EP 129 We Were In a Cult? Dwan\u0027s Story",
      "description": "In this episode of Clemenz With a \u0027Z\u0027, I sit down with Dwan, a former member of the International Churches of Christ (ICOC). As part of our series, ‘We Were in a Cult?’. Dwan shares how a chance reconnection with a high school friend led her to join the ICOC, at a time when she was searching for a sense of belonging and connection. As she opens up about the subtle ways people are drawn into the church, we explore the emotional impact of this journey, the moments of self-reflection, and the motivations that pulled her in as well as the motivations that solidified in her the need to leave this group. This conversation sheds light on the vulnerabilities that cult-like organizations often exploit and challenges us to think critically about the meaning of community, connection, and faith.\u0022 If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-11-04T19:11:06Z",
      "duration": "01:58:34.1050000",
      "explicit": true,
      "spotifyId": "6npNyHIT2M3Js6aPWE1BCG",
      "appleId": 1000675663289,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6npNyHIT2M3Js6aPWE1BCG",
        "apple": "https://podcasts.apple.com/podcast/ep-129-we-were-in-a-cult-dwans-story/id1473695420?i=1000675663289"
      }
    },
    {
      "id": "ca7a1d67-cc15-4212-a4e5-01c51351a6f0",
      "title": "EP 126 A Story of Healing with Alan Allard",
      "description": "\u0022Welcome to Clemenz with a Z, where we explore the powerful stories of those who’ve broken free from high-control religious groups. This latest episode is a kind of We Were in a Cult? segment as well as talk on healing from spiritual trauma. I was able to speak with Alan Allard, a former member of the International Churches of Christ (ICOC). Alan shares how his experiences within the ICOC shaped his journey of spiritual abuse recovery and inspired him to become a coach dedicated to helping others heal. Through his story, Alan offers insight into the resilience needed to rebuild and the transformative power of reclaiming one’s identity. Through his website, AlanAllard.com , he provides resources, coaching, and support for individuals seeking freedom from the psychological and emotional scars left by spiritual trauma. This episode sheds light on the strength required to overcome spiritual trauma and the hope that healing can offer to others on similar paths.\u0022 If you would like to reach out to Alan for more information on what he does or to get guidance, you can reach him at his website: AlanAllard.com . If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-10-28T21:02:30Z",
      "duration": "01:52:45.9990000",
      "explicit": true,
      "spotifyId": "0f1O8ZGpC0bVEbeDATP3Ya",
      "appleId": 1000674777032,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0f1O8ZGpC0bVEbeDATP3Ya",
        "apple": "https://podcasts.apple.com/podcast/ep-126-a-story-of-healing-with-alan-allard/id1473695420?i=1000674777032"
      }
    },
    {
      "id": "45765107-3a78-48cd-a233-f291990ef4ac",
      "title": "EP 124  We Were In a Cult?  Nicole\u0027s Story",
      "description": "In this episode of the Clemenz with a Z podcast, we continue our series \u0022We Were in a Cult?\u0022 with a powerful and raw conversation with Nicole, who grew up as a ‘Kingdom Kid’ in the International Churches of Christ (ICOC). Raised within a high-control religious group, Nicole shares her journey from a childhood immersed in faith to a deep questioning of everything she once believed. Her path led her not only to leave the church but to ultimately identify as an atheist. Nicole’s story is one of courage, self-discovery, and the struggle to break free from the pressures of conformity. Tune in to hear her experiences and insights as we ask the big question: Were we in a cult?\nIf you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. \nAs always, thank you for your continued support and if you like what you hear please rate and review!  If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.\nIf you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524\nPeace!",
      "release": "2024-10-21T16:11:57Z",
      "duration": "01:59:07",
      "explicit": false,
      "spotifyId": "2RRHRPrpEQQCQt5bM2nYIF",
      "appleId": 1000673872390,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2RRHRPrpEQQCQt5bM2nYIF",
        "apple": "https://podcasts.apple.com/podcast/ep-124-we-were-in-a-cult-nicoles-story/id1473695420?i=1000673872390"
      }
    },
    {
      "id": "3d7a9ccd-732c-4e1a-9cd8-26f1f99ea64e",
      "title": "EP 123 \u0022Is  church just an accepted cult?\u0022  Why can\u0027t we listen to Landslide?",
      "description": "\u0022Hey everyone, it’s Roy, and welcome back to Clemenz With a Z! Today’s episode kicks off a new series I’ve been working on, asking a big question—Are churches cults? In this exploration, I’ll be diving into the similarities between churches like Hillsong and Mars Hill and the ICOC, which has often been labeled a cult. This week, I’m sharing my experience at a local church, where the preacher’s sermon took an unexpected turn. He warned the congregation against listening to the song Landslide by Stevie Nicks, framing it as spiritually dangerous. The way he used this example to manipulate fear in the audience really got to me. I\u0027ll break down his tactics and talk about why discouraging critical thought and open exploration like this can be harmful. Join me as we look at the power dynamics and manipulative strategies some preachers use, and ask the question—is church just an accepted cult?",
      "release": "2024-10-16T16:01:39Z",
      "duration": "00:21:26",
      "explicit": false,
      "spotifyId": "6L0sor50b4hB0halS0LiQm",
      "appleId": 1000673326630,
      "subjects": [
        "International Churches Of Christ",
        "Hillsong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6L0sor50b4hB0halS0LiQm",
        "apple": "https://podcasts.apple.com/podcast/ep-123-is-church-just-an-accepted-cult-why-cant-we/id1473695420?i=1000673326630"
      }
    },
    {
      "id": "2a756ecc-f067-4f59-a4a1-1f46deacb4d5",
      "title": "EP 121 We Were In a Cult?  AnneMarie\u0027s Story",
      "description": "In this episode of Clemenz With a \u0027Z\u0027, I sit down with AnneMarie, a former member of the International Churches of Christ (ICOC). As part of our series, ‘We Were in a Cult?’, AnneMarie shares her personal journey from being drawn into the ICOC to the life-changing decision to leave. Through her candid reflections, we explore the emotional, spiritual, and psychological effects of being part of a high-control group. Tune in for an eye-opening conversation about faith, identity, and personal transformation. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-10-14T15:13:06Z",
      "duration": "00:52:40.4170000",
      "explicit": true,
      "spotifyId": "1wYodkw2HV74HIKcpFoyTI",
      "appleId": 1000673041301,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1wYodkw2HV74HIKcpFoyTI",
        "apple": "https://podcasts.apple.com/podcast/ep-121-we-were-in-a-cult-annemaries-story/id1473695420?i=1000673041301"
      }
    },
    {
      "id": "bf3a09d9-33e2-47d9-93eb-0d56b01e7f17",
      "title": "EP 120 A Bit of a Reintroduction",
      "description": "Welcome back to Clemenz With a \u0027Z\u0027! In today’s episode, we’re doing things a bit differently with a reintroduction—both to myself and this podcast. Over the past five years, this platform has evolved in ways I never anticipated, especially with the incredible response to the \u0022We Were in a Cult?\u0022 series. From its beginnings as the Balanced Male Podcast, this show has grown into a space where we explore deep and meaningful stories, offering healing and understanding for people from all walks of life. Today, I’ll reflect on the podcast’s journey, my motivations, and where we’re headed next. Whether you’ve been with us from the start or are just joining, I’m excited to share the lessons learned and the path forward. Let’s dive in! You can check out my very first episode here: https://www.podbean.com/ew/pb-psru9-a98217 If you are a dad and would like to share your story here on the podcast you can reach out to me via email at clemenzwithaz@gmail.com or you can DM me at the Clemenz With a \u0022Z\u0022 podcast Instagram page. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-10-10T15:45:57Z",
      "duration": "00:15:37.5730000",
      "explicit": true,
      "spotifyId": "29j6dDbZmtQHgNlYQNpQ4I",
      "appleId": 1000672528485,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29j6dDbZmtQHgNlYQNpQ4I",
        "apple": "https://podcasts.apple.com/podcast/ep-120-a-bit-of-a-reintroduction/id1473695420?i=1000672528485"
      }
    },
    {
      "id": "3c343c0c-34d1-4a3c-8cf7-b14262617658",
      "title": "EP 119 We Were In a Cult?  Asha\u0027s Story",
      "description": "In this episode of Clemenz with a Z, we continue the series “We Were in a Cult?” We continue our discussion with a conversation featuring Asha. Asha shares their incredible journey of being drawn into the International Churches of Christ (ICOC) back in 1993, all the way from Kerala, India. We discuss the emotional complexities of life within the ICOC, the controlling tactics used by the organization, and how Asha eventually found the strength to break free. Tune in for an insightful, raw, and ultimately inspiring story of resilience and self-discovery. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-10-07T12:54:55Z",
      "duration": "01:36:43.7090000",
      "explicit": true,
      "spotifyId": "7aIkyhabDS23YH8QUQ3qgI",
      "appleId": 1000672054241,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7aIkyhabDS23YH8QUQ3qgI",
        "apple": "https://podcasts.apple.com/podcast/ep-119-we-were-in-a-cult-ashas-story/id1473695420?i=1000672054241"
      }
    },
    {
      "id": "68e0e9ac-8a03-4e46-a2a9-11812c39664f",
      "title": "EP 118 We Were In a Cult? Jakob\u0027s Story",
      "description": "In this episode of Clemenz with a Z, we continue the series “We Were in a Cult?” with a compelling conversation featuring Jakob. First introduced to the International Church of Christ (ICOC) in Russia and the Ukraine, Jakob later relocated to the Middle East, where his journey with the organization continued. He and his wife have spent years unraveling the complexities of their time in the ICOC, and in this episode, Jacob opens up about the challenges of leaving, the process of healing, and the impact the group had on his life. Tune in as we explore his personal story of finding clarity and reclaiming control. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-09-30T13:28:55Z",
      "duration": "02:03:41.3970000",
      "explicit": true,
      "spotifyId": "5AA3UgICO9Cfr1cZCQtAqD",
      "appleId": 1000671297474,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5AA3UgICO9Cfr1cZCQtAqD",
        "apple": "https://podcasts.apple.com/podcast/ep-118-we-were-in-a-cult-jakobs-story/id1473695420?i=1000671297474"
      }
    },
    {
      "id": "406050bf-1a80-47b1-912d-3294a5179320",
      "title": "EP 117 We Were In a Cult?  Jennifer\u0027s Story",
      "description": "In this latest episode of Clemenz With a \u0027Z\u0027 Podcast, we continue our series “We Were in a Cult?” with a conversation featuring Jennifer, a former member of the International Churches of Christ (ICOC). Jen shares her early memories of growing up in the church, attending services in unique locations, and the lasting impact of that experience. From humorous anecdotes about “lipstick-shaped” hotels to deeper reflections on community and faith, Jen’s story is both engaging and thought-provoking.\nTune in to hear how these experiences have shaped her outlook on life beyond the ICOC. Don’t miss this insightful addition to our ongoing exploration of life inside and outside high-demand religious groups.\nIf you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. \nAs always, thank you for your continued support and if you like what you hear please rate and review!  If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.\nIf you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524\nPeace!",
      "release": "2024-09-23T12:35:56Z",
      "duration": "01:49:12",
      "explicit": false,
      "spotifyId": "4EHl9DYZM24WCABeywrUha",
      "appleId": 1000670403306,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EHl9DYZM24WCABeywrUha",
        "apple": "https://podcasts.apple.com/us/podcast/ep-117-we-were-in-a-cult-jennifers-story/id1473695420?i=1000670403306"
      }
    },
    {
      "id": "0445d66e-8e87-43e5-bfb8-4f0a4e274222",
      "title": "EP 116 We Were In a Cult? Joselyn\u0027s Story",
      "description": "Hey everyone! I got another episode here for the \u0022We Were In a Cult?\u0022 Series here on the Clemenz With a \u0022Z\u0022 podcast. Today, we again dive deep into a compelling and often heartbreaking topic with our segment titled \u0022We Were In a Cult?\u0022 In this eye-opening episode of Clemenz with a Z, I sit down with former member Joselyn to discuss her experience with the International Churches of Christ (ICOC), a church that we all know has sparked both devotion and controversy. Jocelyn shares how she was first invited into the church, the sense of community that initially drew her in, and the moments that led her to question whether she had become involved in something far more controlling than she had initially realized. Together, we explore the blurred lines between faith, community, and control, offering an honest look at how these dynamics can shape — and sometimes manipulate — personal beliefs. Whether you’re familiar with the ICOC or simply curious about the complexities of faith-based organizations, this episode provides valuable insights into Jocelyn’s lived experiences and offers a unique perspective on what it means to be part of a religious group that some might label a cult. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-09-17T15:44:25Z",
      "duration": "01:49:14.8880000",
      "explicit": true,
      "spotifyId": "3BVHpYbpc18UwkUAc1gt17",
      "appleId": 1000669837860,
      "youTubeId": "kCs_zpPP1bA",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BVHpYbpc18UwkUAc1gt17",
        "apple": "https://podcasts.apple.com/podcast/ep-116-we-were-in-a-cult-joselyns-story/id1473695420?i=1000669837860",
        "youtube": "https://www.youtube.com/watch?v=kCs_zpPP1bA"
      }
    },
    {
      "id": "49e884d0-9840-4775-b622-f8e3a3750cf0",
      "title": "EP 115 We Were In a Cult? Shari\u0027s Story",
      "description": "Hey everyone!  I got another episode here for the \u0022We Were In a Cult?\u0022 Series here on the Clemenz With a \u0022Z\u0022 podcast. Today, we again dive deep into a compelling and often heartbreaking topic with our segment titled \u0022We Were In a Cult?\u0022\nIn this episode. I sit down with writer and former actor Shari Simpson, who shares her story of being drawn into the International Churches of Christ (ICOC). Shari recounts how a chance encounter on the streets of Manhattan led her into the church, and how her time there shaped her life in unexpected ways. Through her experience, we explore the challenges of breaking free from a controlling environment, reclaiming personal identity, and healing from the manipulation she faced. It’s a powerful conversation about rediscovering yourself and redefining faith beyond the confines of the ICOC.\nIf you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. \nAs always, thank you for your continued support and if you like what you hear please rate and review!  If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.\nIf you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524\nPeace!",
      "release": "2024-09-09T16:49:30Z",
      "duration": "01:42:26",
      "explicit": false,
      "spotifyId": "2m5KmpFbNiB7OAfageZ5Yv",
      "appleId": 1000668908255,
      "youTubeId": "NY2gdHsmBaM",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2m5KmpFbNiB7OAfageZ5Yv",
        "apple": "https://podcasts.apple.com/podcast/ep-115-we-were-in-a-cult-sharis-story/id1473695420?i=1000668908255",
        "youtube": "https://www.youtube.com/watch?v=NY2gdHsmBaM"
      }
    },
    {
      "id": "2fb25e5f-24af-4559-be67-1c10e1fb3302",
      "title": "EP 112 We Were In a Cult? Drew #2\u0027s Story",
      "description": "Hey everyone! I got another episode here for the \u0022We Were In a Cult?\u0022 Series here on the Clemenz With a \u0022Z\u0022 podcast. Today, we again dive deep into a compelling and often heartbreaking topic with our segment titled \u0022We Were In a Cult?\u0022 In this episode I was joined by former member Drew, who shares his powerful story of leaving the International Churches of Christ (ICOC) and the emotional turmoil that came with it. We’ll discuss the painful realization that the church’s promise that \u0027anyone could lead\u0027 was a lie—a promise reserved only for those who fit a rigid mold. For those who didn’t, there was no place of value, only isolation. Drew opens up about the deep emotional impact of breaking away, the long road to healing, and the struggle to redefine faith and family life after leaving such a controlling environment. We’ll also explore the cult-like manipulation tactics used within the ICOC, the rigid gender roles imposed on men, and the mental health challenges that arose from trying to conform to unrealistic expectations. This episode is a raw and honest conversation about the courage it takes to leave, the strength required to heal, and the journey of rediscovering one\u0027s true self beyond the church’s confines.\u0022 If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-08-21T13:36:21Z",
      "duration": "02:01:17.5720000",
      "explicit": false,
      "spotifyId": "4M7lXqGZfytyyW1yiH0GTT",
      "appleId": 1000666124503,
      "youTubeId": "BuYUIxoHbNA",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4M7lXqGZfytyyW1yiH0GTT",
        "apple": "https://podcasts.apple.com/podcast/ep-112-we-were-in-a-cult-drew-2s-story/id1473695420?i=1000666124503",
        "youtube": "https://www.youtube.com/watch?v=BuYUIxoHbNA"
      }
    },
    {
      "id": "3859b4cc-e4b0-4d89-8f5f-a0f8ea9f04b9",
      "title": "EP 111 We Were In a Cult? Kathi\u0027s Story",
      "description": "Hey everyone! I got another episode here for the \u0022We Were In a Cult?\u0022 Series here on the Clemenz With a \u0022Z\u0022 podcast. Today, we dive deep into a compelling and often heartbreaking topic with our episode titled \u0022We Were In a Cult?\u0022 In this episode, we explore a story that spans five decades with our guest, Kathi, who began her journey in the 14th Street Church—later known as the Crossroads Church of Christ, the genesis of the ICOC. Kathi was baptized at an early age, but as she got older, she felt the pressure to be baptized again—something many members faced as the church\u0027s expectations evolved. In the beginning, Kathi found the church to be an amazing community that she truly loved. It was a place of belonging and spiritual growth. But as time went on, the cracks started to show. Kathi opens up about how the church\u0027s culture of control became stifling, where simply asking questions was viewed as an act of rebellion. She shares the pain of being labeled and ostracized by church leaders, and the heartbreak of seeing her own children turned against her. After leaving the ICOC for 10 years, Kathi returned—this time to the ICC. However, to her dismay, she saw the same issues that plagued the ICOC resurfacing in the ICC as well. In this episode, we delve into the difficult emotions of witnessing the church\u0027s changes over the years and confronting the same problems in a new environment. Join us for an eye-opening conversation about faith, control, and resilience as Kathi shares her powerful and deeply personal story. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-08-14T16:55:20Z",
      "duration": "01:46:17.3430000",
      "explicit": false,
      "spotifyId": "6l4HfNhVsf6NKGadoILh73",
      "appleId": 1000665314390,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6l4HfNhVsf6NKGadoILh73",
        "apple": "https://podcasts.apple.com/podcast/ep-111-we-were-in-a-cult-kathis-story/id1473695420?i=1000665314390"
      }
    },
    {
      "id": "200800c7-9ced-4e10-bc2b-679450e0776b",
      "title": "EP 110 Answering Your Questions With Nadine",
      "description": "What is up everyone? I have got a new episode here for you all. In this episode, we\u0027re joined once again by Nadine, who previously shared her experiences both in and out of the ICOC. After our last conversation, Nadine received an overwhelming number of questions from listeners eager to learn more about her journey. Today, she’s back to answer those questions and to provide deeper insight into a significant part of her story. Also, Nadine was named in the infamous Henry Kriete letter, a document that shook the ICOC community to its core. She\u0027ll be sharing her personal perspective on being mentioned in the letter, the impact it had on her life, and how she has navigated the aftermath. It was great to get to talk with her again and to hear all the questions you all had. I was another insightful conversation and I hope you all get as much out of it as I did. If you have any questions for me, please reach out and let me know. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-08-08T12:23:34Z",
      "duration": "01:44:50.3500000",
      "explicit": true,
      "spotifyId": "24Q4LsZc8ZdceVoOEubjBc",
      "appleId": 1000664720647,
      "youTubeId": "gA7j7i_oGkc",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/24Q4LsZc8ZdceVoOEubjBc",
        "apple": "https://podcasts.apple.com/podcast/ep-110-answering-your-questions-with-nadine/id1473695420?i=1000664720647",
        "youtube": "https://www.youtube.com/watch?v=gA7j7i_oGkc"
      }
    },
    {
      "id": "e825074d-b3f5-4e01-92da-532241087638",
      "title": "EP 109 We Were In a Cult?  Joabis\u0027 Story",
      "description": "Hey everyone! I got another episode here for the \u0022We Were In a Cult?\u0022 Series here on the Clemenz With a \u0022Z\u0022 podcast. Today, we dive deep into a compelling and often heartbreaking topic with our episode titled \u0022We Were In a Cult?\u0022 Our guest today is Joabis, who stands out as the first member of the International Churches of Christ (ICOC) to join us while still being an active member of the church. Joabis\u0027s journey is truly international—born in Africa, he moved to India where he was introduced to the ICOC and quickly ascended into leadership In our conversation, we delve into some deeply personal and challenging topics. Joabis shares his experience with arranged marriages within the church, including his own at a young age. As he poignantly put it, \u0022I got married for the ministry and left for the ministry.\u0022 We explore the struggles he faced to maintain both his marriage and his leadership position, and ultimately, how he made the difficult decision to step down from leadership in order to save himself and his marriage. What struck me most about Joabis is his unwavering positivity, his capacity for forgiveness, and his hopeful outlook on life and its endless possibilities. His story is a powerful testament to resilience and the human spirit, and I believe you\u0027ll find his perspective both enlightening and inspiring. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-08-05T13:35:05Z",
      "duration": "01:19:28.0650000",
      "explicit": false,
      "spotifyId": "4vJ8lcfy3w2Ga7INVaG7rX",
      "appleId": 1000664372060,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vJ8lcfy3w2Ga7INVaG7rX",
        "apple": "https://podcasts.apple.com/podcast/ep-109-we-were-in-a-cult-joabis-story/id1473695420?i=1000664372060"
      }
    },
    {
      "id": "763e2147-2846-4bc7-ba59-e92c668e6c47",
      "title": "EP 108 We Were In a Cult? Rachel\u0027s Story",
      "description": "Hey everyone! I got another episode here for the \u0022We Were In a Cult?\u0022 Series here on the Clemenz With a \u0022Z\u0022 podcast. Today, we dive deep into a compelling and often heartbreaking topic with our episode titled \u0022We Were In a Cult?\u0022 Our guest this week is a brave former member of the International Churches of Christ (ICOC) Rachel who also grew up in the church. Rachel opens up about her life both inside and outside the church, shedding light on the struggles she faced, including the \u0027toxic diet culture\u0027 that was prevalent in the ICOC. We also explore the complex gender issues within the church and the unique challenges she encountered as the daughter of an elder. Rachel shares what ultimately led her to the decision to leave the church and offers an inspiring account of her healing and growth since her departure. This episode is a testament to resilience and the power of reclaiming one\u0027s own story. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source. If you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524 Peace!",
      "release": "2024-07-31T19:31:12Z",
      "duration": "02:13:21.9310000",
      "explicit": false,
      "spotifyId": "4OQ6lpjVWsfVdL6XWkG5YZ",
      "appleId": 1000663958860,
      "youTubeId": "_FH3tdZpThE",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4OQ6lpjVWsfVdL6XWkG5YZ",
        "apple": "https://podcasts.apple.com/podcast/ep-108-we-were-in-a-cult-rachels-story/id1473695420?i=1000663958860",
        "youtube": "https://www.youtube.com/watch?v=_FH3tdZpThE"
      }
    },
    {
      "id": "50ec3513-96a8-4051-b56b-d09b76b3f41c",
      "title": "EP 107 We Were In a Cult?  Justine\u0027s Story",
      "description": "Trigger Warning: This episode discusses body shaming, anorexia, and mentions sexual abuse allegations.\nHey everyone!  I got another episode here for the \u0022We Were In a Cult?\u0022 Series here on the Clemenz With a \u0022Z\u0022 podcast. Today, we dive deep into a compelling and often heartbreaking topic with our episode titled \u0022We Were In a Cult?\u0022 Our guest this week is a brave former member of the International Churches of Christ (ICOC) Justine who grew up under our church\u0027s stringent control.\nIn this episode, we explore the profound impact of living in an environment where conformity was not just encouraged but enforced. Our guest shares her personal journey, revealing how the church\u0027s oppressive standards dictated her appearance and personality, going so far as to demand she re-dye her pink hair before her baptism to appear \u0022godly.\u0022\nMore than just a spiritual authority, the church acted as a surrogate parent, often overshadowing the influence and guidance of her actual parents. This dynamic further intensified the pressure to conform and exacerbated the struggles she faced as she navigated her identity.\nThis discussion sheds light on the severe consequences of such control, including her struggles with mental health and anorexia. Join us as we uncover the emotional and psychological toll of her life in the ICOC and her courageous path to healing and self-acceptance.\nTune in and be inspired by this powerful story of resilience and the quest for true identity and freedom.\nJustine is actively involved in the lawsuits against the ICOC and the ICC, supporting survivors in writing their plaintiff statements. She has also co-founded a nonprofit with Chele Roland called Free2B, which helps survivors of spiritual abuse find the resources they need to process their experiences in high-control groups. If you are a victim, you can reach out to Justine or Chele through the Free2B website: www.free2b.org.\nIf you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. \nAs always, thank you for your continued support and if you like what you hear please rate and review!  If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.\nIf you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524\nPeace!",
      "release": "2024-07-18T14:17:49Z",
      "duration": "02:02:38",
      "explicit": false,
      "spotifyId": "2MuH38XyneFTu2DXai0ybo",
      "appleId": 1000662640110,
      "youTubeId": "KYMdL8ssxNI",
      "subjects": [
        "International Churches Of Christ",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2MuH38XyneFTu2DXai0ybo",
        "apple": "https://podcasts.apple.com/us/podcast/ep-107-we-were-in-a-cult-justines-story/id1473695420?i=1000662640110",
        "youtube": "https://www.youtube.com/watch?v=KYMdL8ssxNI"
      }
    },
    {
      "id": "ef839996-78b1-4b4f-80f3-988f8f19aaa3",
      "title": "EP 106 We Were In a Cult?  Anabel\u0027s Story",
      "description": "What is up everyone?! I got a new episode here in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast.  I was able to speak to former member of the ICOC Anabel about her life in the church and out of the church.  Anabel was a \u0022kingdom kid\u0022 who grew up in the church.  We discussed what it was like growing up in the church and how it influenced her view of god and knowing from a very young age that she had a debt that needed to be paid back.  Some of the big topics were that Jesus was the first kingdom kid, so many adults were allowed to be involved in your life, being the first teens in the church that dated and how it was viewed by adults.  It\u0027s always great to connect with former \u0022kingdom kids\u0022 and you all better be careful you don\u0027t get those haughty eyes!    \nIf you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. \nAs always, thank you for your continued support and if you like what you hear please rate and review!  If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.\nIf you would like to support the podcast financially please follow this link: https://gofund.me/7ebb0524\nPeace!",
      "release": "2024-07-07T14:34:40Z",
      "duration": "01:45:59",
      "explicit": false,
      "spotifyId": "3vUjhf0HtZroOmNA3qzWAU",
      "appleId": 1000661442102,
      "youTubeId": "iJcVWmsnIBY",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vUjhf0HtZroOmNA3qzWAU",
        "apple": "https://podcasts.apple.com/us/podcast/ep-106-we-were-in-a-cult-anabels-story/id1473695420?i=1000661442102",
        "youtube": "https://www.youtube.com/watch?v=iJcVWmsnIBY"
      }
    },
    {
      "id": "39672612-8e47-46b6-a4f5-c2f5bf7eb47f",
      "title": "EP 105 We Were In a Cult? Nadine\u0027s Story",
      "description": "What is up everyone?! I got a new episode here in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast.  I was able to speak to former member of the ICOC Nadine about her life in the church and out of the church.  Nadine\u0027s story spans nearly 40 years and multiple countries and continents and she has only been out of the church for about 6 months.  \nNadine was met in London and after joined the church quickly became a leader.  She and her husband led churches in India, London, and became the geographical region leaders for Southeast Asia.  She also became heavily involved in the church\u0027s outreach program in Nepal.  She discusses what kept her in the church and leadership for so long and what got her to the point of finally leaving the church.  It was such a great conversation and shed such insight for me on our church\u0027s global reach.   \nIf you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. \nAs always, thank you for your continued support and if you like what you hear please rate and review!  If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-06-24T12:31:12Z",
      "duration": "01:30:45",
      "explicit": false,
      "spotifyId": "5XgVLQ5vHv2saQonftjDYO",
      "appleId": 1000660051887,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5XgVLQ5vHv2saQonftjDYO",
        "apple": "https://podcasts.apple.com/us/podcast/ep-105-we-were-in-a-cult-nadines-story/id1473695420?i=1000660051887"
      }
    },
    {
      "id": "0e0138c0-8ba1-4fc1-a6de-9d997d0a150b",
      "title": "EP 104 We Were In a Cult? Marissa\u0027s Story",
      "description": "What is up everyone?! I got a new episode here in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to speak with former member and kingdom kid Marissa to discuss her life growing up in the church, all the good bad and ugly as well as what led her to needing to exit the church in college. I do need to give a trigger warning for this episode as she discuss instances of self harm. We talked about growing up in this system, the pressure put on people, and the big topic we discussed is the lack of support for mental health in the church and how that lead her and people like her to grow up with little or no coping mechanisms for the struggles of life. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-06-19T18:17:21Z",
      "duration": "01:44:05.9300000",
      "explicit": false,
      "spotifyId": "22Yc840H7SIdc7HC3Y6bQR",
      "appleId": 1000659551744,
      "youTubeId": "k0jN-IZdFcM",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22Yc840H7SIdc7HC3Y6bQR",
        "apple": "https://podcasts.apple.com/podcast/ep-104-we-were-in-a-cult-marissas-story/id1473695420?i=1000659551744",
        "youtube": "https://www.youtube.com/watch?v=k0jN-IZdFcM"
      }
    },
    {
      "id": "06b10f23-74c6-42d6-b236-6890c32096bb",
      "title": "EP. 103 We Were In a Cult? Alex\u0027s Story",
      "description": "What is up everyone! Got a new episode here in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to sit with former guest on the show Alex who was also a member of the ICOC. Our conversation centered mostly on what it was like as a \u0022kingdom kid\u0022 in the church and how much our view of reality and life was through the lens of the church and it\u0027s teaching. Some of the big topics were the feeling of guilt after baptism and continually trying to earn it, and how as you grew up in the church you learn little by little that you cannot trust yourself. I know that I can relate to that a lot. I am grateful to have had this conversation and you all should check this out! If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-06-10T12:44:00Z",
      "duration": "01:47:40.2910000",
      "explicit": false,
      "spotifyId": "1kg3pTNcxalYtaiMIkTUIt",
      "appleId": 1000658455877,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kg3pTNcxalYtaiMIkTUIt",
        "apple": "https://podcasts.apple.com/podcast/ep-103-we-were-in-a-cult-alexs-story/id1473695420?i=1000658455877"
      }
    },
    {
      "id": "07f98b8a-a3b3-4dbd-81ab-1587959761d2",
      "title": "EP 102 We Were In a Cult? Amy\u0027s Story",
      "description": "What is up everyone! I got a new episode for the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 podcast. I was able to chat with former member of the ICOC Amy about what got her in the church, her life in the church, and the how\u0027s and why\u0027s of why she left. We touched on many topics in this 2 and 1/2 hour conversation. We talked about her family life, the love for a god that she had and why she felt the need to join not just the ICOC but a church in general. She discussed the workload that was put on her in college by the church, what it was like when she became a campus leader and no matter what she did she always felt at the bottom of ladder. She also was able to discuss what led her to help and serve with the charity organization \u0022Hope Worldwide\u0022 abroad in Cambodia. I am so grateful to have had the chance to listen to her story and to add it to the growing conversation we all are having. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-06-06T12:45:50Z",
      "duration": "02:37:58.9150000",
      "explicit": false,
      "spotifyId": "3QGoPX3YctttUwJcSCeCag",
      "appleId": 1000658048376,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QGoPX3YctttUwJcSCeCag",
        "apple": "https://podcasts.apple.com/podcast/ep-102-we-were-in-a-cult-amys-story/id1473695420?i=1000658048376"
      }
    },
    {
      "id": "422b459b-0422-4d56-8d41-a7740f5c328e",
      "title": "EP. 97 We Were In a Cult?  Tania\u0027s Story",
      "description": "What is up everyone! Got a new episode up for the \u0022We Were In a Cult?\u0022 series here on the Clemenz with a \u0022Z\u0022 podcast. I was able to chat with former member of the ICOC Tania. Tania was a member of the Mexico City Church, a missionary that planted one of our churches in Cuba, and a leader in the Boston Church. In our conversation we discussed topics such as the colonization of faith, how much work was required of members, the toxic nature of missionaries, and how women were viewed in the church and leadership. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-05-20T13:55:09Z",
      "duration": "02:35:31.8540000",
      "explicit": false,
      "spotifyId": "2T23znPlisqo9IWhMaFmJr",
      "appleId": 1000656149059,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2T23znPlisqo9IWhMaFmJr",
        "apple": "https://podcasts.apple.com/podcast/ep-97-we-were-in-a-cult-tanias-story/id1473695420?i=1000656149059"
      }
    },
    {
      "id": "1e27ea50-d7c2-477b-a3c8-550963b78ab8",
      "title": "EP. 95 We Were In a Cult?  Drew\u0027s Story",
      "description": "What is up everyone? Got a new episode here for the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 podcast. I was able to have a conversation with former member of the ICOC, Drew to discuss his life before the church, during, and after. The biggest take away of his story for me was how important it is for some to find a \u0022stable\u0022 institution and the joy it brings them. That institution also has a damaging power once it is that institution drops them or turns it back on them. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-05-13T17:08:37Z",
      "duration": "01:04:46.1850000",
      "explicit": false,
      "spotifyId": "4QkYKfsRXLTcqRiIXt5Y2m",
      "appleId": 1000655451228,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4QkYKfsRXLTcqRiIXt5Y2m",
        "apple": "https://podcasts.apple.com/podcast/ep-95-we-were-in-a-cult-drews-story/id1473695420?i=1000655451228"
      }
    },
    {
      "id": "ce8a2f07-e81d-4d49-877e-a6691b4091d9",
      "title": "Ep. 94 We Were In a Cult?  Ljuba\u0027s Story",
      "description": "What\u0027s up everyone! New episode up in the \u0022We Were In a Cult?\u0022 Series here on the Clemenz with a \u0022Z\u0022 Podcast. In this episode I had the pleasure of talking to former member of the International Churches of Christ or \u0022ICOC\u0022 Ljuba. We discussed how it was for her coming from Denmark to New York City right after high school to follow her dreams of dancing and being met by a member right away. We discussed what it was like for after joining, her life in church, the pressures and time commitments, dating, and her eventual need for leaving the church, what it was like leaving, and her life post church. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-05-06T16:47:22Z",
      "duration": "01:44:19.7230000",
      "explicit": false,
      "spotifyId": "3uZVMPFJ7L0VJaH6G4mlb4",
      "appleId": 1000654703170,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uZVMPFJ7L0VJaH6G4mlb4",
        "apple": "https://podcasts.apple.com/podcast/ep-94-we-were-in-a-cult-ljubas-story/id1473695420?i=1000654703170"
      }
    },
    {
      "id": "0c60a541-9b60-4278-b9b3-667ef2b514b5",
      "title": "EP. 91 We Were In a Cult? Liz\u0027s Story",
      "description": "What is up everyone?! New episode alert for the series \u0022We Were In a Cult?\u0022 here on the \u0022Clemenz With a \u0022Z\u0022 Podcast\u0022. I was able to chat with former member of the ICOC Liz about her life in and out of the church. We were able to talk about growing up as \u0022kingdom kid\u0022 and all that came with that, seeking approval from the leaders, seeing the wrongs in the church, trying hard to ignore them, how that ignoring led to internalization, and living with all of that became too much to bear which led to her leaving the church in the 2010s. We also discussed what life is like for her out of the ICOC and how she has reconstructed her life. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-29T15:40:45Z",
      "duration": "01:25:35.5700000",
      "explicit": false,
      "spotifyId": "7peT92oBqWOGof6YeRspRB",
      "appleId": 1000653944551,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7peT92oBqWOGof6YeRspRB",
        "apple": "https://podcasts.apple.com/podcast/ep-91-we-were-in-a-cult-lizs-story/id1473695420?i=1000653944551"
      }
    },
    {
      "id": "0808de87-0c73-410a-817d-c56b946dcb98",
      "title": "EP. 88 We Were In a Cult?  Diane\u0027s Story",
      "description": "What is up everyone! New episode up for the \u0022We Were In a Cult?\u0022 series here on the \u0022Clemenz With a \u0022Z\u0022 Podcast\u0022. I was able to speak with former member of the International Churches of Christ Diane about her story of being a member and leaving the church. Diane\u0027s story spans almost 45 years, 5 states/ministries, marriage/divorce, and she was the first person I was able to talk to about life in the Crossroads Church in the mid 70\u0027s. Her story shed more light on this wild thing we all were a part of and I even learned about a place called the \u0022Upside Down Club\u0022! If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-22T10:43:05Z",
      "duration": "01:39:56.6180000",
      "explicit": false,
      "spotifyId": "3mGg3Pbs6DMc0WqWcZJ1zk",
      "appleId": 1000653194741,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mGg3Pbs6DMc0WqWcZJ1zk",
        "apple": "https://podcasts.apple.com/podcast/ep-88-we-were-in-a-cult-dianes-story/id1473695420?i=1000653194741"
      }
    },
    {
      "id": "d4ec0768-de32-47ce-a0b7-b93db196d6f1",
      "title": "EP. 87 We Were In a Cult? Chelsea\u0027s Story",
      "description": "What\u0027s up everyone! New episode up in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to speak with former member Chelsea about her life growing up in the ICOC. We were able to speak about all things growing up in this church and what it was like leaving. We spoke a good bit about the one place for us that was a bright spot in this mess and that was the summer camp The Swamp and why this place was so great for all of us kingdom kids. We were also able to speak more about the teen ministry, feeling eyes on us all the time, the purity culture in the teens, and the way girls were treated here. The biggest take away for me was that it is important to only have a sandwich at lunch and not a sandwich, chips and a pickle. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-15T15:26:58Z",
      "duration": "02:04:48.8630000",
      "explicit": false,
      "spotifyId": "2mIRlgsn6dxkKCE76fXai6",
      "appleId": 1000652509264,
      "subjects": [
        "International Churches Of Christ",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mIRlgsn6dxkKCE76fXai6",
        "apple": "https://podcasts.apple.com/podcast/ep-87-we-were-in-a-cult-chelseas-story/id1473695420?i=1000652509264"
      }
    },
    {
      "id": "3dfff66b-41d6-403c-8006-e9f5e8d59a46",
      "title": "EP. 86 Bonus Episode!  Kesia\u0027s Story pt. 2",
      "description": "What is up everyone! I got a bonus episode here for you all. Former member of the ICOC and previous guest Kesia reached out to me saying that she had more she would like to share specifically, the way we were indoctrinated with no sense of agency in our lives, public shaming of sin, pattern of narcissistic leaders, and how even after the letter went out not much changed in our church. I was glad we were able to bring more issues into the light. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-09T13:27:30Z",
      "duration": "01:33:05.9730000",
      "explicit": true,
      "spotifyId": "2MiRTnRgN4sHYRPEtCOX4a",
      "appleId": 1000651903679,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2MiRTnRgN4sHYRPEtCOX4a",
        "apple": "https://podcasts.apple.com/podcast/ep-86-bonus-episode-kesias-story-pt-2/id1473695420?i=1000651903679"
      }
    },
    {
      "id": "35b370ec-24f2-4968-a9e5-f64ef3ee55c0",
      "title": "EP. 84 We Were In a Cult? TJ\u0027s Story",
      "description": "What\u0027s up everyone! New episode up in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to speak with former member TJ about his life in the ICOC. We talked about being a member in college and getting baptized, his life in the church and the struggle it became, his desire to \u0022Do things Right\u0022, being a minster in the church, and his eventual leaving the church. It was a great conversation and I could tell it was healing for both of us. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-08T15:36:00Z",
      "duration": "01:45:36.5230000",
      "explicit": true,
      "spotifyId": "4MMh40EwbbD1ro8qWgDXSi",
      "appleId": 1000651792707,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4MMh40EwbbD1ro8qWgDXSi",
        "apple": "https://podcasts.apple.com/podcast/ep-84-we-were-in-a-cult-tjs-story/id1473695420?i=1000651792707"
      }
    },
    {
      "id": "c692a6e3-2337-486a-93fb-c42cd7413eb8",
      "title": "EP. 83 We Were In a Cult? Austin Noll\u0027s Story",
      "description": "What is up everyone! I have a new episode for you in the \u0022We Were In a Cult\u0022 series here on the Clemenz With a \u0022Z\u0022 podcast. I was able to sit with former member of the ICOC and author of the book \u0022A Jumble of Crumpled Papers\u0022 and podcaster Austin Noll to talk about his life in and out of the ICOC. We talked about growing up in the church and the troubles he faced regarding our church\u0027s purity culture as a young man and his subsequent struggle it has been since leaving the church. It was a great conversation! If you would like to learn more about his story, you can check out Austin\u0027s book: \u0022A Jumble of Crumpled Papers\u0022 here: https://a.co/d/dhXGVI0 You can check out Austin\u0027s Podcast \u0022The Crumpled Papers Podcast\u0022 on all platforms or here on Spotify: https://open.spotify.com/show/7pc778qvzAxG0kB7vMSDyb?si=595697bc7ce44742 If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-01T12:38:05Z",
      "duration": "01:35:43.4910000",
      "explicit": true,
      "spotifyId": "28b27gKq7MxRb0mi2tXNkN",
      "appleId": 1000651067035,
      "subjects": [
        "International Churches Of Christ",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28b27gKq7MxRb0mi2tXNkN",
        "apple": "https://podcasts.apple.com/podcast/ep-83-we-were-in-a-cult-austin-nolls-story/id1473695420?i=1000651067035"
      }
    },
    {
      "id": "60abdde5-d087-431b-b95a-9d80c5bd1da1",
      "title": "EP. 81 We Were In a Cult? Kesia\u0027s Story",
      "description": "What is up everyone! New episode up in the \u0022We Were In a Cult?\u0022 series here on the Clemenz with a \u0022Z\u0022 podcast. This episode is a big one for me and its because it is my first international episode. I was able to speak with former member of the International Churches of Christ Kesia who was a part of our church in Denmark. Kesia shared her story of growing up in the church and how even though she was a whole ocean away from us here in the stated the church was still the same. I am grateful for her sharing her story with me, to connect you all with more members who are feeling like we are, and to be able to get a more global perspective of the church. She even brought up \u0022The Great Pruning\u0022 which was something that I had forgotten about. I hope you all continue to find healing through these stories and are able to feel a little less alone and maybe even a little less crazy. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-03-25T14:01:43Z",
      "duration": "02:03:32.6110000",
      "explicit": true,
      "spotifyId": "2qeRtPuqNbs48ggwfTX57i",
      "appleId": 1000650370760,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qeRtPuqNbs48ggwfTX57i",
        "apple": "https://podcasts.apple.com/podcast/ep-81-we-were-in-a-cult-kesias-story/id1473695420?i=1000650370760"
      }
    },
    {
      "id": "289cc057-87d3-45f2-a624-ab8f23e6df3b",
      "title": "EP. 79 We Were In a Cult? Kristin\u0027s Story",
      "description": "What is up everyone! New episode out for the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to speak with former member of the International Churches of Christ Kristin. Our conversation touched on growing up in this church, the strong desire to please parents and authority figures, the shame and guilt that comes with growing up in purity culture, the overall pressure that it was being in this church as a child, and where she is now with all of this. It was a great talk and you all should check it out! If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-03-18T14:04:40Z",
      "duration": "01:39:08.8140000",
      "explicit": true,
      "spotifyId": "6ywgwsnnKFzOiYf0pDMyON",
      "appleId": 1000649583955,
      "subjects": [
        "International Churches Of Christ",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ywgwsnnKFzOiYf0pDMyON",
        "apple": "https://podcasts.apple.com/podcast/ep-79-we-were-in-a-cult-kristins-story/id1473695420?i=1000649583955"
      }
    },
    {
      "id": "e4ccc62d-d2ed-4b8a-833f-9eb59c6032f1",
      "title": "EP. 78 We Were In a Cult? Steph\u0027s Story",
      "description": "Hello Everyone! New episode alert for the \u0022We Were In a Cult?\u0022 series here on the Balanced Male Podcast. I was able to speak with former member of the !COC Steph about her life in the church and leaving the church. She did not stay in the church long after high school so the meat of the talk focused on what is was like being a kid/teen in the church. We touched on dating, purity culture, what it was like moving multiple times in the church, and being in a more affluent area of the church and not being affluent herself. It was a great talk and you all should check it out! If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-03-03T21:04:37Z",
      "duration": "01:28:50.9390000",
      "explicit": true,
      "spotifyId": "34lKOSQct1F1If641p5PsW",
      "appleId": 1000647855194,
      "subjects": [
        "International Churches Of Christ",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34lKOSQct1F1If641p5PsW",
        "apple": "https://podcasts.apple.com/podcast/ep-78-we-were-in-a-cult-stephs-story/id1473695420?i=1000647855194"
      }
    },
    {
      "id": "9449065e-cb76-4d2d-a40e-7d544fac95f3",
      "title": "EP. 76 We Were In a Cult?  Jon\u0027s Story",
      "description": "What\u0027s up everyone! I got another episode to share of the \u0022We Were In a Cult?\u0022 series here on the Balanced Male Podcast. I was able to speak to a former member Jon. We talked all things ICOC and his life in and out of the church. We discussed what it was like coming out in high school, his struggles being a gay man in the church, race relations and what church was like during COVID times. We also talked about what led to him having to walk away from church to honor himself. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-02-26T17:56:34Z",
      "duration": "02:19:13.6200000",
      "explicit": true,
      "spotifyId": "0daawRGM2RRGjBPbGwzWqX",
      "appleId": 1000647102717,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0daawRGM2RRGjBPbGwzWqX",
        "apple": "https://podcasts.apple.com/podcast/ep-76-we-were-in-a-cult-jons-story/id1473695420?i=1000647102717"
      }
    },
    {
      "id": "f5c43e01-12cb-4a40-b3e2-c5d288795642",
      "title": "EP. 74 We Were In a Cult?  Karen\u0027s Story",
      "description": "What\u0027s up everyone! I am pumped to share another segment of \u0022We were In a Cult?\u0022 here on podcast. This is actually the 10th segment in the series which is awesome to think about. In this episode I spoke with former member of the ICOC Karen. We talked about her life before the church, being introduced to the church as a teen, and what is was like to date someone in the church when it was \u0022off limits\u0022 and frowned upon. She also shared more about the dynamics of living in a household of girls and what it was like for her having to exit the church in her teens. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-02-18T19:59:18Z",
      "duration": "01:08:16.2880000",
      "explicit": true,
      "spotifyId": "7M96yKojRZTPEoaTPHICFu",
      "appleId": 1000645783169,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7M96yKojRZTPEoaTPHICFu",
        "apple": "https://podcasts.apple.com/podcast/ep-74-we-were-in-a-cult-karens-story/id1473695420?i=1000645783169"
      }
    },
    {
      "id": "d408a5ae-674a-4e96-a242-eb37f9d8c7f3",
      "title": "EP. 72 We Were In a Cult?  Stephanie\u0027s Story",
      "description": "What\u0027s up everyone?! Today\u0027s episode is another segment of the \u0022We were in a cult?\u0022 series here on the Balanced Male Podcast. I was able to speak with a former member of the ICOC Stephanie. We talked about her life in the church and out of the church but more importantly, she shared the abuse she dealt with most of her life by the hands of a member of the church. She currently has a case filed against the church because of it. The conversation was a powerful one and dealt heavily with abuse she endured. I am humbled that she allowed me to share her story and my hope is her story brings healing and justice for all in situations like hers. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-02-12T16:15:38Z",
      "duration": "02:34:49.1700000",
      "explicit": true,
      "spotifyId": "5pDIExUrB4RSYrMqBMz1KI",
      "appleId": 1000645061741,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5pDIExUrB4RSYrMqBMz1KI",
        "apple": "https://podcasts.apple.com/podcast/ep-72-we-were-in-a-cult-stephanies-story/id1473695420?i=1000645061741"
      }
    },
    {
      "id": "675f7edb-69df-4df7-ba0b-1eb944de91ab",
      "title": "EP. 71 We Were In a Cult?  Phil\u0027s Story",
      "description": "What is up everyone! In this episode of \u0022We Were In a Cult?\u0022 I got to talk with former member of the ICOC Phil. We talked about what it was like being met in college, life in the church and the struggles of him trying so hard to fit into this system. We discussed the struggles in this system and how it took him to multiple states before realizing this was not going to be the place for him and all it took to get him to a place of healing and stability. He also shared with me his conversation with ChatGPT about the church and its wild to see what AI thinks of the ICOC. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-02-06T14:09:54Z",
      "duration": "01:46:14.8190000",
      "explicit": true,
      "spotifyId": "3QJJ9g4kingn7DhKxXyKpa",
      "appleId": 1000644361493,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QJJ9g4kingn7DhKxXyKpa",
        "apple": "https://podcasts.apple.com/podcast/ep-71-we-were-in-a-cult-phils-story/id1473695420?i=1000644361493"
      }
    },
    {
      "id": "6801c878-ed68-4fdb-b793-b182e6808bf0",
      "title": "EP. 69 We Were In a Cult?  Erin\u0027s Story",
      "description": "What is up everyone! This episode is another segment in the \u0022We Were In a Cult?\u0022 series here on the balanced male podcast. This one was a doozy for sure! I was able to speak with former member Erin who is also the founder of the first Instagram meme page dedicated to life in the ICOC: \u0022Didyouhaveyourqt\u0022. In our 3 hour conversation we talked about why she started the meme page, growing up with parents that were leaders in the church and the results of them being fired, what it was like for a woman in the church, and what it\u0027s like to leave a belief system that you have know your whole life. It was such a great conversation! Check it out and check out her meme page on Instagram. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-01-29T15:25:46Z",
      "duration": "02:59:12.2880000",
      "explicit": true,
      "spotifyId": "22lcnvYYDExr00o0EkN5Bx",
      "appleId": 1000643393496,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22lcnvYYDExr00o0EkN5Bx",
        "apple": "https://podcasts.apple.com/podcast/ep-69-we-were-in-a-cult-erins-story/id1473695420?i=1000643393496"
      }
    },
    {
      "id": "2cf8218c-4b40-47c9-aebc-f4acc377e740",
      "title": "EP.63”We Were In a Cult?”  Myron’s Story",
      "description": "Hey everybody! This is another segment in the \u0022we were in a cult?\u0022 series here on the balanced male podcast. I got to have a great conversation with another ex member of the ICOC, Myron on how he got involved with the ICOC and his departure from the ICOC and his views on if the ICOC was a cult. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review!",
      "release": "2024-01-04T16:30:34Z",
      "duration": "02:20:04.8990000",
      "explicit": true,
      "spotifyId": "11iesBOdPhHm3QqO0Gsa5I",
      "appleId": 1000640558071,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/11iesBOdPhHm3QqO0Gsa5I",
        "apple": "https://podcasts.apple.com/podcast/ep-63-we-were-in-a-cult-myrons-story/id1473695420?i=1000640558071"
      }
    },
    {
      "id": "b734bbb4-5a68-4213-a27a-887f064bac33",
      "title": "EP. 60 We Were In a Cult?  Todd’s Story",
      "description": "What\u0027s up everyone. This episode is another installment in the \u0022We were in a cult?\u0022 segment of the podcast. I was able to sit down with another former member Todd to share his experience growing up in the ICOC, and what it was like leaving the church after high school and then coming back in his adulthood. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via instagram at the balanced male podcast page.",
      "release": "2023-11-30T20:04:50Z",
      "duration": "01:02:30.3740000",
      "explicit": true,
      "spotifyId": "07T1JtztCVrRgpdRDvsCyE",
      "appleId": 1000637095639,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07T1JtztCVrRgpdRDvsCyE",
        "apple": "https://podcasts.apple.com/podcast/ep-60-we-were-in-a-cult-todds-story/id1473695420?i=1000637095639"
      }
    },
    {
      "id": "0b1fd4cd-10be-46ac-aedf-707c849ccf3d",
      "title": "EP. 58 ”We Were In A Cult?”  Joe’s Story",
      "description": "What\u0027s up everyone. This episode is another installment in the \u0022We were in a cult?\u0022 segment of the podcast. I was able to sit down with another former member and \u0022DADTALK\u0022 alum Joe to share his experience in the church. He also shed a little but of light on what it was like to be met and brought into the church vs. being born into the church like the previous guests. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via instagram at the balanced male podcast page.",
      "release": "2023-11-21T19:24:40Z",
      "duration": "02:10:17.0910000",
      "explicit": true,
      "spotifyId": "4scXjqGIcg1WDhdknvoMGQ",
      "appleId": 1000635589129,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4scXjqGIcg1WDhdknvoMGQ",
        "apple": "https://podcasts.apple.com/podcast/ep-58-we-were-in-a-cult-joes-story/id1473695420?i=1000635589129"
      }
    },
    {
      "id": "6c8df6ee-fe9a-4d53-b15d-81acf17bd4b3",
      "title": "We Were in a Cult?  Shannon’s Story",
      "description": "What\u0027s up guys. This episode is another installment in the \u0022We were in a cult?\u0022 segment of the podcast. I was able to sit down with another former member Shannon to share her experiences of growing up in the church and what is what like leaving the church. Shannon is also the host of a great podcast called \u0022paring down podcast\u0022. In the podcast she talks about decluttering your home and your life to get to what you truly want and need in your life. You can check it out here: https://open.spotify.com/show/2liRQfDev6n4V2CO1qCMsz?si=bbccd9ca3141456d If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cullt?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via instagram at the balanced male podcast page.",
      "release": "2023-11-10T15:23:00Z",
      "duration": "01:34:22.7470000",
      "explicit": true,
      "spotifyId": "4w3YUIzsMF84JRH6wHZ7me",
      "appleId": 1000634392883,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4w3YUIzsMF84JRH6wHZ7me",
        "apple": "https://podcasts.apple.com/podcast/we-were-in-a-cult-shannons-story/id1473695420?i=1000634392883"
      }
    },
    {
      "id": "f8e791b8-e5f1-43a0-9cad-4d5353376c17",
      "title": "We Were In a Cult?  Luke’s Story",
      "description": "What\u0027s up guys. This episode is another installment in the \u0022We were in a cult?\u0022 segment of the podcast. I was able to sit down with another former member Luke. During the conversation, Luke shared his story in the church and coming out at a young age. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cullt?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via instagram at the balanced male podcast page.",
      "release": "2023-10-30T20:52:28Z",
      "duration": "01:05:36.3300000",
      "explicit": false,
      "spotifyId": "2X4alCchW4177ayjJWw1CV",
      "appleId": 1000633144149,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2X4alCchW4177ayjJWw1CV",
        "apple": "https://podcasts.apple.com/podcast/we-were-in-a-cult-lukes-story/id1473695420?i=1000633144149"
      }
    },
    {
      "id": "9876bb47-202a-4446-ac94-bc21834c1213",
      "title": "We Were In A Cult?  Keisha’s Story",
      "description": "What\u0027s up everyone. Today\u0027s episode is the first in what I hope will be many many more conversations about growing up in the ICOC. I was able to sit down with a friend of mine and former member of the church Keisha to have a conversation about our lives in the church and try to answer the question: \u0022We were in a cult?\u0022. It was a great discussion and I am grateful for her sharing her story with me and allowing me to share it with all of you.",
      "release": "2023-10-23T15:32:37Z",
      "duration": "01:24:54.1650000",
      "explicit": false,
      "spotifyId": "5uJGTk5I1SYn9uAIEUzaIP",
      "appleId": 1000632300585,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5uJGTk5I1SYn9uAIEUzaIP",
        "apple": "https://podcasts.apple.com/podcast/we-were-in-a-cult-keishas-story/id1473695420?i=1000632300585"
      }
    },
    {
      "id": "27c2c7c2-f385-463c-afe3-d970fe83369e",
      "title": "We Were In a Cult? Jim and I’s stories",
      "description": "Hey guys! In this episode I brought back Jim for us to have a conversation about the church(cult?) we were a part of growing up. We discussed the good, the bad, the weird, and where we are now. I hope you all enjoy!",
      "release": "2022-02-13T21:28:16Z",
      "duration": "02:01:50.5560000",
      "explicit": false,
      "spotifyId": "2G7SMvqRPZdqusoDsJz128",
      "appleId": 1000550967666,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2G7SMvqRPZdqusoDsJz128",
        "apple": "https://podcasts.apple.com/podcast/we-were-in-a-cult-jim-and-is-stories/id1473695420?i=1000550967666"
      }
    }
  ]
}