{
  "_ts": 0,
  "id": "fbb1c9fb-6173-4cd8-bc5d-38815a3220ec",
  "name": "Clemenz With a ”Z” Podcast",
  "spotifyId": "4nEzoDSGtBum6csCPUtNxT",
  "appleId": 1473695420,
  "youTubeChannelId": "UCLvI3MeNTiPOkt2C_kWeUWQ",
  "episodes": [
    {
      "id": "0e0138c0-8ba1-4fc1-a6de-9d997d0a150b",
      "title": "EP 104 We Were In a Cult? Marissa\u0027s Story",
      "description": "What is up everyone?! I got a new episode here in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to speak with former member and kingdom kid Marissa to discuss her life growing up in the church, all the good bad and ugly as well as what led her to needing to exit the church in college. I do need to give a trigger warning for this episode as she discuss instances of self harm. We talked about growing up in this system, the pressure put on people, and the big topic we discussed is the lack of support for mental health in the church and how that lead her and people like her to grow up with little or no coping mechanisms for the struggles of life. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-06-19T18:17:21Z",
      "duration": "01:44:05.9300000",
      "explicit": false,
      "spotifyId": "22Yc840H7SIdc7HC3Y6bQR",
      "appleId": 1000659551744,
      "youTubeId": "k0jN-IZdFcM",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22Yc840H7SIdc7HC3Y6bQR",
        "apple": "https://podcasts.apple.com/podcast/ep-104-we-were-in-a-cult-marissas-story/id1473695420?i=1000659551744",
        "youtube": "https://www.youtube.com/watch?v=k0jN-IZdFcM"
      }
    },
    {
      "id": "06b10f23-74c6-42d6-b236-6890c32096bb",
      "title": "EP. 103 We Were In a Cult? Alex\u0027s Story",
      "description": "What is up everyone! Got a new episode here in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to sit with former guest on the show Alex who was also a member of the ICOC. Our conversation centered mostly on what it was like as a \u0022kingdom kid\u0022 in the church and how much our view of reality and life was through the lens of the church and it\u0027s teaching. Some of the big topics were the feeling of guilt after baptism and continually trying to earn it, and how as you grew up in the church you learn little by little that you cannot trust yourself. I know that I can relate to that a lot. I am grateful to have had this conversation and you all should check this out! If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-06-10T12:44:00Z",
      "duration": "01:47:40.2910000",
      "explicit": false,
      "spotifyId": "1kg3pTNcxalYtaiMIkTUIt",
      "appleId": 1000658455877,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kg3pTNcxalYtaiMIkTUIt",
        "apple": "https://podcasts.apple.com/podcast/ep-103-we-were-in-a-cult-alexs-story/id1473695420?i=1000658455877"
      }
    },
    {
      "id": "07f98b8a-a3b3-4dbd-81ab-1587959761d2",
      "title": "EP 102 We Were In a Cult? Amy\u0027s Story",
      "description": "What is up everyone! I got a new episode for the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 podcast. I was able to chat with former member of the ICOC Amy about what got her in the church, her life in the church, and the how\u0027s and why\u0027s of why she left. We touched on many topics in this 2 and 1/2 hour conversation. We talked about her family life, the love for a god that she had and why she felt the need to join not just the ICOC but a church in general. She discussed the workload that was put on her in college by the church, what it was like when she became a campus leader and no matter what she did she always felt at the bottom of ladder. She also was able to discuss what led her to help and serve with the charity organization \u0022Hope Worldwide\u0022 abroad in Cambodia. I am so grateful to have had the chance to listen to her story and to add it to the growing conversation we all are having. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-06-06T12:45:50Z",
      "duration": "02:37:58.9150000",
      "explicit": false,
      "spotifyId": "3QGoPX3YctttUwJcSCeCag",
      "appleId": 1000658048376,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QGoPX3YctttUwJcSCeCag",
        "apple": "https://podcasts.apple.com/podcast/ep-102-we-were-in-a-cult-amys-story/id1473695420?i=1000658048376"
      }
    },
    {
      "id": "422b459b-0422-4d56-8d41-a7740f5c328e",
      "title": "EP. 97 We Were In a Cult?  Tania\u0027s Story",
      "description": "What is up everyone! Got a new episode up for the \u0022We Were In a Cult?\u0022 series here on the Clemenz with a \u0022Z\u0022 podcast. I was able to chat with former member of the ICOC Tania. Tania was a member of the Mexico City Church, a missionary that planted one of our churches in Cuba, and a leader in the Boston Church. In our conversation we discussed topics such as the colonization of faith, how much work was required of members, the toxic nature of missionaries, and how women were viewed in the church and leadership. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-05-20T13:55:09Z",
      "duration": "02:35:31.8540000",
      "explicit": false,
      "spotifyId": "2T23znPlisqo9IWhMaFmJr",
      "appleId": 1000656149059,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2T23znPlisqo9IWhMaFmJr",
        "apple": "https://podcasts.apple.com/podcast/ep-97-we-were-in-a-cult-tanias-story/id1473695420?i=1000656149059"
      }
    },
    {
      "id": "1e27ea50-d7c2-477b-a3c8-550963b78ab8",
      "title": "EP. 95 We Were In a Cult?  Drew\u0027s Story",
      "description": "What is up everyone? Got a new episode here for the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 podcast. I was able to have a conversation with former member of the ICOC, Drew to discuss his life before the church, during, and after. The biggest take away of his story for me was how important it is for some to find a \u0022stable\u0022 institution and the joy it brings them. That institution also has a damaging power once it is that institution drops them or turns it back on them. If you are a member, were a member, or know someone who was a member of the ICOC or the ICC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-05-13T17:08:37Z",
      "duration": "01:04:46.1850000",
      "explicit": false,
      "spotifyId": "4QkYKfsRXLTcqRiIXt5Y2m",
      "appleId": 1000655451228,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4QkYKfsRXLTcqRiIXt5Y2m",
        "apple": "https://podcasts.apple.com/podcast/ep-95-we-were-in-a-cult-drews-story/id1473695420?i=1000655451228"
      }
    },
    {
      "id": "ce8a2f07-e81d-4d49-877e-a6691b4091d9",
      "title": "Ep. 94 We Were In a Cult?  Ljuba\u0027s Story",
      "description": "What\u0027s up everyone! New episode up in the \u0022We Were In a Cult?\u0022 Series here on the Clemenz with a \u0022Z\u0022 Podcast. In this episode I had the pleasure of talking to former member of the International Churches of Christ or \u0022ICOC\u0022 Ljuba. We discussed how it was for her coming from Denmark to New York City right after high school to follow her dreams of dancing and being met by a member right away. We discussed what it was like for after joining, her life in church, the pressures and time commitments, dating, and her eventual need for leaving the church, what it was like leaving, and her life post church. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-05-06T16:47:22Z",
      "duration": "01:44:19.7230000",
      "explicit": false,
      "spotifyId": "3uZVMPFJ7L0VJaH6G4mlb4",
      "appleId": 1000654703170,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uZVMPFJ7L0VJaH6G4mlb4",
        "apple": "https://podcasts.apple.com/podcast/ep-94-we-were-in-a-cult-ljubas-story/id1473695420?i=1000654703170"
      }
    },
    {
      "id": "0c60a541-9b60-4278-b9b3-667ef2b514b5",
      "title": "EP. 91 We Were In a Cult? Liz\u0027s Story",
      "description": "What is up everyone?! New episode alert for the series \u0022We Were In a Cult?\u0022 here on the \u0022Clemenz With a \u0022Z\u0022 Podcast\u0022. I was able to chat with former member of the ICOC Liz about her life in and out of the church. We were able to talk about growing up as \u0022kingdom kid\u0022 and all that came with that, seeking approval from the leaders, seeing the wrongs in the church, trying hard to ignore them, how that ignoring led to internalization, and living with all of that became too much to bear which led to her leaving the church in the 2010s. We also discussed what life is like for her out of the ICOC and how she has reconstructed her life. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-29T15:40:45Z",
      "duration": "01:25:35.5700000",
      "explicit": false,
      "spotifyId": "7peT92oBqWOGof6YeRspRB",
      "appleId": 1000653944551,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7peT92oBqWOGof6YeRspRB",
        "apple": "https://podcasts.apple.com/podcast/ep-91-we-were-in-a-cult-lizs-story/id1473695420?i=1000653944551"
      }
    },
    {
      "id": "0808de87-0c73-410a-817d-c56b946dcb98",
      "title": "EP. 88 We Were In a Cult?  Diane\u0027s Story",
      "description": "What is up everyone! New episode up for the \u0022We Were In a Cult?\u0022 series here on the \u0022Clemenz With a \u0022Z\u0022 Podcast\u0022. I was able to speak with former member of the International Churches of Christ Diane about her story of being a member and leaving the church. Diane\u0027s story spans almost 45 years, 5 states/ministries, marriage/divorce, and she was the first person I was able to talk to about life in the Crossroads Church in the mid 70\u0027s. Her story shed more light on this wild thing we all were a part of and I even learned about a place called the \u0022Upside Down Club\u0022! If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-22T10:43:05Z",
      "duration": "01:39:56.6180000",
      "explicit": false,
      "spotifyId": "3mGg3Pbs6DMc0WqWcZJ1zk",
      "appleId": 1000653194741,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mGg3Pbs6DMc0WqWcZJ1zk",
        "apple": "https://podcasts.apple.com/podcast/ep-88-we-were-in-a-cult-dianes-story/id1473695420?i=1000653194741"
      }
    },
    {
      "id": "d4ec0768-de32-47ce-a0b7-b93db196d6f1",
      "title": "EP. 87 We Were In a Cult? Chelsea\u0027s Story",
      "description": "What\u0027s up everyone! New episode up in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to speak with former member Chelsea about her life growing up in the ICOC. We were able to speak about all things growing up in this church and what it was like leaving. We spoke a good bit about the one place for us that was a bright spot in this mess and that was the summer camp The Swamp and why this place was so great for all of us kingdom kids. We were also able to speak more about the teen ministry, feeling eyes on us all the time, the purity culture in the teens, and the way girls were treated here. The biggest take away for me was that it is important to only have a sandwich at lunch and not a sandwich, chips and a pickle. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-15T15:26:58Z",
      "duration": "02:04:48.8630000",
      "explicit": false,
      "spotifyId": "2mIRlgsn6dxkKCE76fXai6",
      "appleId": 1000652509264,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mIRlgsn6dxkKCE76fXai6",
        "apple": "https://podcasts.apple.com/podcast/ep-87-we-were-in-a-cult-chelseas-story/id1473695420?i=1000652509264"
      }
    },
    {
      "id": "3dfff66b-41d6-403c-8006-e9f5e8d59a46",
      "title": "EP. 86 Bonus Episode!  Kesia\u0027s Story pt. 2",
      "description": "What is up everyone! I got a bonus episode here for you all. Former member of the ICOC and previous guest Kesia reached out to me saying that she had more she would like to share specifically, the way we were indoctrinated with no sense of agency in our lives, public shaming of sin, pattern of narcissistic leaders, and how even after the letter went out not much changed in our church. I was glad we were able to bring more issues into the light. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-09T13:27:30Z",
      "duration": "01:33:05.9730000",
      "explicit": true,
      "spotifyId": "2MiRTnRgN4sHYRPEtCOX4a",
      "appleId": 1000651903679,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2MiRTnRgN4sHYRPEtCOX4a",
        "apple": "https://podcasts.apple.com/podcast/ep-86-bonus-episode-kesias-story-pt-2/id1473695420?i=1000651903679"
      }
    },
    {
      "id": "35b370ec-24f2-4968-a9e5-f64ef3ee55c0",
      "title": "EP. 84 We Were In a Cult? TJ\u0027s Story",
      "description": "What\u0027s up everyone! New episode up in the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to speak with former member TJ about his life in the ICOC. We talked about being a member in college and getting baptized, his life in the church and the struggle it became, his desire to \u0022Do things Right\u0022, being a minster in the church, and his eventual leaving the church. It was a great conversation and I could tell it was healing for both of us. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-08T15:36:00Z",
      "duration": "01:45:36.5230000",
      "explicit": true,
      "spotifyId": "4MMh40EwbbD1ro8qWgDXSi",
      "appleId": 1000651792707,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4MMh40EwbbD1ro8qWgDXSi",
        "apple": "https://podcasts.apple.com/podcast/ep-84-we-were-in-a-cult-tjs-story/id1473695420?i=1000651792707"
      }
    },
    {
      "id": "c692a6e3-2337-486a-93fb-c42cd7413eb8",
      "title": "EP. 83 We Were In a Cult? Austin Noll\u0027s Story",
      "description": "What is up everyone! I have a new episode for you in the \u0022We Were In a Cult\u0022 series here on the Clemenz With a \u0022Z\u0022 podcast. I was able to sit with former member of the ICOC and author of the book \u0022A Jumble of Crumpled Papers\u0022 and podcaster Austin Noll to talk about his life in and out of the ICOC. We talked about growing up in the church and the troubles he faced regarding our church\u0027s purity culture as a young man and his subsequent struggle it has been since leaving the church. It was a great conversation! If you would like to learn more about his story, you can check out Austin\u0027s book: \u0022A Jumble of Crumpled Papers\u0022 here: https://a.co/d/dhXGVI0 You can check out Austin\u0027s Podcast \u0022The Crumpled Papers Podcast\u0022 on all platforms or here on Spotify: https://open.spotify.com/show/7pc778qvzAxG0kB7vMSDyb?si=595697bc7ce44742 If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-04-01T12:38:05Z",
      "duration": "01:35:43.4910000",
      "explicit": true,
      "spotifyId": "28b27gKq7MxRb0mi2tXNkN",
      "appleId": 1000651067035,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28b27gKq7MxRb0mi2tXNkN",
        "apple": "https://podcasts.apple.com/podcast/ep-83-we-were-in-a-cult-austin-nolls-story/id1473695420?i=1000651067035"
      }
    },
    {
      "id": "60abdde5-d087-431b-b95a-9d80c5bd1da1",
      "title": "EP. 81 We Were In a Cult? Kesia\u0027s Story",
      "description": "What is up everyone! New episode up in the \u0022We Were In a Cult?\u0022 series here on the Clemenz with a \u0022Z\u0022 podcast. This episode is a big one for me and its because it is my first international episode. I was able to speak with former member of the International Churches of Christ Kesia who was a part of our church in Denmark. Kesia shared her story of growing up in the church and how even though she was a whole ocean away from us here in the stated the church was still the same. I am grateful for her sharing her story with me, to connect you all with more members who are feeling like we are, and to be able to get a more global perspective of the church. She even brought up \u0022The Great Pruning\u0022 which was something that I had forgotten about. I hope you all continue to find healing through these stories and are able to feel a little less alone and maybe even a little less crazy. If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-03-25T14:01:43Z",
      "duration": "02:03:32.6110000",
      "explicit": true,
      "spotifyId": "2qeRtPuqNbs48ggwfTX57i",
      "appleId": 1000650370760,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qeRtPuqNbs48ggwfTX57i",
        "apple": "https://podcasts.apple.com/podcast/ep-81-we-were-in-a-cult-kesias-story/id1473695420?i=1000650370760"
      }
    },
    {
      "id": "289cc057-87d3-45f2-a624-ab8f23e6df3b",
      "title": "EP. 79 We Were In a Cult? Kristin\u0027s Story",
      "description": "What is up everyone! New episode out for the \u0022We Were In a Cult?\u0022 series here on the Clemenz With a \u0022Z\u0022 Podcast. I was able to speak with former member of the International Churches of Christ Kristin. Our conversation touched on growing up in this church, the strong desire to please parents and authority figures, the shame and guilt that comes with growing up in purity culture, the overall pressure that it was being in this church as a child, and where she is now with all of this. It was a great talk and you all should check it out! If you are a member, were a member, or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering the question \u0022we were in a cult?\u0022, and maybe find some healing please contact me via email at clemenzwithaz@gmail.com or you can DM via Instagram at the \u0022Clemenz With a \u0022Z\u0022 podcast\u0022 Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-03-18T14:04:40Z",
      "duration": "01:39:08.8140000",
      "explicit": true,
      "spotifyId": "6ywgwsnnKFzOiYf0pDMyON",
      "appleId": 1000649583955,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ywgwsnnKFzOiYf0pDMyON",
        "apple": "https://podcasts.apple.com/podcast/ep-79-we-were-in-a-cult-kristins-story/id1473695420?i=1000649583955"
      }
    },
    {
      "id": "e4ccc62d-d2ed-4b8a-833f-9eb59c6032f1",
      "title": "EP. 78 We Were In a Cult? Steph\u0027s Story",
      "description": "Hello Everyone! New episode alert for the \u0022We Were In a Cult?\u0022 series here on the Balanced Male Podcast. I was able to speak with former member of the !COC Steph about her life in the church and leaving the church. She did not stay in the church long after high school so the meat of the talk focused on what is was like being a kid/teen in the church. We touched on dating, purity culture, what it was like moving multiple times in the church, and being in a more affluent area of the church and not being affluent herself. It was a great talk and you all should check it out! If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-03-03T21:04:37Z",
      "duration": "01:28:50.9390000",
      "explicit": true,
      "spotifyId": "34lKOSQct1F1If641p5PsW",
      "appleId": 1000647855194,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34lKOSQct1F1If641p5PsW",
        "apple": "https://podcasts.apple.com/podcast/ep-78-we-were-in-a-cult-stephs-story/id1473695420?i=1000647855194"
      }
    },
    {
      "id": "9449065e-cb76-4d2d-a40e-7d544fac95f3",
      "title": "EP. 76 We Were In a Cult?  Jon\u0027s Story",
      "description": "What\u0027s up everyone! I got another episode to share of the \u0022We Were In a Cult?\u0022 series here on the Balanced Male Podcast. I was able to speak to a former member Jon. We talked all things ICOC and his life in and out of the church. We discussed what it was like coming out in high school, his struggles being a gay man in the church, race relations and what church was like during COVID times. We also talked about what led to him having to walk away from church to honor himself. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-02-26T17:56:34Z",
      "duration": "02:19:13.6200000",
      "explicit": true,
      "spotifyId": "0daawRGM2RRGjBPbGwzWqX",
      "appleId": 1000647102717,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0daawRGM2RRGjBPbGwzWqX",
        "apple": "https://podcasts.apple.com/podcast/ep-76-we-were-in-a-cult-jons-story/id1473695420?i=1000647102717"
      }
    },
    {
      "id": "f5c43e01-12cb-4a40-b3e2-c5d288795642",
      "title": "EP. 74 We Were In a Cult?  Karen\u0027s Story",
      "description": "What\u0027s up everyone! I am pumped to share another segment of \u0022We were In a Cult?\u0022 here on podcast. This is actually the 10th segment in the series which is awesome to think about. In this episode I spoke with former member of the ICOC Karen. We talked about her life before the church, being introduced to the church as a teen, and what is was like to date someone in the church when it was \u0022off limits\u0022 and frowned upon. She also shared more about the dynamics of living in a household of girls and what it was like for her having to exit the church in her teens. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-02-18T19:59:18Z",
      "duration": "01:08:16.2880000",
      "explicit": true,
      "spotifyId": "7M96yKojRZTPEoaTPHICFu",
      "appleId": 1000645783169,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7M96yKojRZTPEoaTPHICFu",
        "apple": "https://podcasts.apple.com/podcast/ep-74-we-were-in-a-cult-karens-story/id1473695420?i=1000645783169"
      }
    },
    {
      "id": "d408a5ae-674a-4e96-a242-eb37f9d8c7f3",
      "title": "EP. 72 We Were In a Cult?  Stephanie\u0027s Story",
      "description": "What\u0027s up everyone?! Today\u0027s episode is another segment of the \u0022We were in a cult?\u0022 series here on the Balanced Male Podcast. I was able to speak with a former member of the ICOC Stephanie. We talked about her life in the church and out of the church but more importantly, she shared the abuse she dealt with most of her life by the hands of a member of the church. She currently has a case filed against the church because of it. The conversation was a powerful one and dealt heavily with abuse she endured. I am humbled that she allowed me to share her story and my hope is her story brings healing and justice for all in situations like hers. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-02-12T16:15:38Z",
      "duration": "02:34:49.1700000",
      "explicit": true,
      "spotifyId": "5pDIExUrB4RSYrMqBMz1KI",
      "appleId": 1000645061741,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5pDIExUrB4RSYrMqBMz1KI",
        "apple": "https://podcasts.apple.com/podcast/ep-72-we-were-in-a-cult-stephanies-story/id1473695420?i=1000645061741"
      }
    },
    {
      "id": "675f7edb-69df-4df7-ba0b-1eb944de91ab",
      "title": "EP. 71 We Were In a Cult?  Phil\u0027s Story",
      "description": "What is up everyone! In this episode of \u0022We Were In a Cult?\u0022 I got to talk with former member of the ICOC Phil. We talked about what it was like being met in college, life in the church and the struggles of him trying so hard to fit into this system. We discussed the struggles in this system and how it took him to multiple states before realizing this was not going to be the place for him and all it took to get him to a place of healing and stability. He also shared with me his conversation with ChatGPT about the church and its wild to see what AI thinks of the ICOC. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-02-06T14:09:54Z",
      "duration": "01:46:14.8190000",
      "explicit": true,
      "spotifyId": "3QJJ9g4kingn7DhKxXyKpa",
      "appleId": 1000644361493,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3QJJ9g4kingn7DhKxXyKpa",
        "apple": "https://podcasts.apple.com/podcast/ep-71-we-were-in-a-cult-phils-story/id1473695420?i=1000644361493"
      }
    },
    {
      "id": "6801c878-ed68-4fdb-b793-b182e6808bf0",
      "title": "EP. 69 We Were In a Cult?  Erin\u0027s Story",
      "description": "What is up everyone! This episode is another segment in the \u0022We Were In a Cult?\u0022 series here on the balanced male podcast. This one was a doozy for sure! I was able to speak with former member Erin who is also the founder of the first Instagram meme page dedicated to life in the ICOC: \u0022Didyouhaveyourqt\u0022. In our 3 hour conversation we talked about why she started the meme page, growing up with parents that were leaders in the church and the results of them being fired, what it was like for a woman in the church, and what it\u0027s like to leave a belief system that you have know your whole life. It was such a great conversation! Check it out and check out her meme page on Instagram. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review! If you don\u0027t remember, I\u0027m just a channel, I ain\u0027t the source.",
      "release": "2024-01-29T15:25:46Z",
      "duration": "02:59:12.2880000",
      "explicit": true,
      "spotifyId": "22lcnvYYDExr00o0EkN5Bx",
      "appleId": 1000643393496,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22lcnvYYDExr00o0EkN5Bx",
        "apple": "https://podcasts.apple.com/podcast/ep-69-we-were-in-a-cult-erins-story/id1473695420?i=1000643393496"
      }
    },
    {
      "id": "2cf8218c-4b40-47c9-aebc-f4acc377e740",
      "title": "EP.63”We Were In a Cult?”  Myron’s Story",
      "description": "Hey everybody! This is another segment in the \u0022we were in a cult?\u0022 series here on the balanced male podcast. I got to have a great conversation with another ex member of the ICOC, Myron on how he got involved with the ICOC and his departure from the ICOC and his views on if the ICOC was a cult. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via Instagram at the balanced male podcast Instagram page. As always, thank you for your continued support and if you like what you hear please rate and review!",
      "release": "2024-01-04T16:30:34Z",
      "duration": "02:20:04.8990000",
      "explicit": true,
      "spotifyId": "11iesBOdPhHm3QqO0Gsa5I",
      "appleId": 1000640558071,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/11iesBOdPhHm3QqO0Gsa5I",
        "apple": "https://podcasts.apple.com/podcast/ep-63-we-were-in-a-cult-myrons-story/id1473695420?i=1000640558071"
      }
    },
    {
      "id": "b734bbb4-5a68-4213-a27a-887f064bac33",
      "title": "EP. 60 We Were In a Cult?  Todd’s Story",
      "description": "What\u0027s up everyone. This episode is another installment in the \u0022We were in a cult?\u0022 segment of the podcast. I was able to sit down with another former member Todd to share his experience growing up in the ICOC, and what it was like leaving the church after high school and then coming back in his adulthood. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via instagram at the balanced male podcast page.",
      "release": "2023-11-30T20:04:50Z",
      "duration": "01:02:30.3740000",
      "explicit": true,
      "spotifyId": "07T1JtztCVrRgpdRDvsCyE",
      "appleId": 1000637095639,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07T1JtztCVrRgpdRDvsCyE",
        "apple": "https://podcasts.apple.com/podcast/ep-60-we-were-in-a-cult-todds-story/id1473695420?i=1000637095639"
      }
    },
    {
      "id": "0b1fd4cd-10be-46ac-aedf-707c849ccf3d",
      "title": "EP. 58 ”We Were In A Cult?”  Joe’s Story",
      "description": "What\u0027s up everyone. This episode is another installment in the \u0022We were in a cult?\u0022 segment of the podcast. I was able to sit down with another former member and \u0022DADTALK\u0022 alum Joe to share his experience in the church. He also shed a little but of light on what it was like to be met and brought into the church vs. being born into the church like the previous guests. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cult?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via instagram at the balanced male podcast page.",
      "release": "2023-11-21T19:24:40Z",
      "duration": "02:10:17.0910000",
      "explicit": true,
      "spotifyId": "4scXjqGIcg1WDhdknvoMGQ",
      "appleId": 1000635589129,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4scXjqGIcg1WDhdknvoMGQ",
        "apple": "https://podcasts.apple.com/podcast/ep-58-we-were-in-a-cult-joes-story/id1473695420?i=1000635589129"
      }
    },
    {
      "id": "6c8df6ee-fe9a-4d53-b15d-81acf17bd4b3",
      "title": "We Were in a Cult?  Shannon’s Story",
      "description": "What\u0027s up guys. This episode is another installment in the \u0022We were in a cult?\u0022 segment of the podcast. I was able to sit down with another former member Shannon to share her experiences of growing up in the church and what is what like leaving the church. Shannon is also the host of a great podcast called \u0022paring down podcast\u0022. In the podcast she talks about decluttering your home and your life to get to what you truly want and need in your life. You can check it out here: https://open.spotify.com/show/2liRQfDev6n4V2CO1qCMsz?si=bbccd9ca3141456d If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cullt?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via instagram at the balanced male podcast page.",
      "release": "2023-11-10T15:23:00Z",
      "duration": "01:34:22.7470000",
      "explicit": true,
      "spotifyId": "4w3YUIzsMF84JRH6wHZ7me",
      "appleId": 1000634392883,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4w3YUIzsMF84JRH6wHZ7me",
        "apple": "https://podcasts.apple.com/podcast/we-were-in-a-cult-shannons-story/id1473695420?i=1000634392883"
      }
    },
    {
      "id": "f8e791b8-e5f1-43a0-9cad-4d5353376c17",
      "title": "We Were In a Cult?  Luke’s Story",
      "description": "What\u0027s up guys. This episode is another installment in the \u0022We were in a cult?\u0022 segment of the podcast. I was able to sit down with another former member Luke. During the conversation, Luke shared his story in the church and coming out at a young age. If you were a member or know someone who was a member of the ICOC and would like to share your story of your life in and out of the church and help us maybe get closer to answering \u0022we were in a cullt?\u0022 please contact me via email at balancedmalepcast@gmail.com or you can DM via instagram at the balanced male podcast page.",
      "release": "2023-10-30T20:52:28Z",
      "duration": "01:05:36.3300000",
      "explicit": false,
      "spotifyId": "2X4alCchW4177ayjJWw1CV",
      "appleId": 1000633144149,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2X4alCchW4177ayjJWw1CV",
        "apple": "https://podcasts.apple.com/podcast/we-were-in-a-cult-lukes-story/id1473695420?i=1000633144149"
      }
    },
    {
      "id": "9876bb47-202a-4446-ac94-bc21834c1213",
      "title": "We Were In A Cult?  Keisha’s Story",
      "description": "What\u0027s up everyone. Today\u0027s episode is the first in what I hope will be many many more conversations about growing up in the ICOC. I was able to sit down with a friend of mine and former member of the church Keisha to have a conversation about our lives in the church and try to answer the question: \u0022We were in a cult?\u0022. It was a great discussion and I am grateful for her sharing her story with me and allowing me to share it with all of you.",
      "release": "2023-10-23T15:32:37Z",
      "duration": "01:24:54.1650000",
      "explicit": false,
      "spotifyId": "5uJGTk5I1SYn9uAIEUzaIP",
      "appleId": 1000632300585,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5uJGTk5I1SYn9uAIEUzaIP",
        "apple": "https://podcasts.apple.com/podcast/we-were-in-a-cult-keishas-story/id1473695420?i=1000632300585"
      }
    },
    {
      "id": "27c2c7c2-f385-463c-afe3-d970fe83369e",
      "title": "We Were In a Cult? Jim and I’s stories",
      "description": "Hey guys! In this episode I brought back Jim for us to have a conversation about the church(cult?) we were a part of growing up. We discussed the good, the bad, the weird, and where we are now. I hope you all enjoy!",
      "release": "2022-02-13T21:28:16Z",
      "duration": "02:01:50.5560000",
      "explicit": false,
      "spotifyId": "2G7SMvqRPZdqusoDsJz128",
      "appleId": 1000550967666,
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2G7SMvqRPZdqusoDsJz128",
        "apple": "https://podcasts.apple.com/podcast/we-were-in-a-cult-jim-and-is-stories/id1473695420?i=1000550967666"
      }
    }
  ]
}