{
  "id": "e881561d-001f-4e18-81ab-9e48582836ee",
  "name": "Click On Detroit | Local 4 | WDIV",
  "youTubeChannelId": "UCqMdEOPBZbGPykVOhUqWqfA",
  "episodes": [
    {
      "id": "87fee6ba-7978-45b3-ab13-ecc3283d9ec9",
      "title": "GOP moves to hold Clintons in contempt over Epstein probe",
      "description": "House Republicans plan to hold former Secretary of State Hillary Clinton in contempt of Congress for not appearing at a deposition related to the Jeffrey Epstein investigation, following a similar action against former President Bill Clinton. The Clintons argue they are being unfairly targeted and claim they have no relevant information to offer. Some Democrats suggest allowing written responses and urge the Justice Department to release all Epstein-related files. The issue underscores differing perspectives on transparency and accountability in the investigation.",
      "release": "2026-01-14T17:07:32Z",
      "duration": "00:02:47",
      "explicit": false,
      "youTubeId": "Imx1bi1X2Mg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Imx1bi1X2Mg"
      }
    },
    {
      "id": "28bb011a-2e57-47eb-b97b-06b36213268a",
      "title": "Michigan AG Nessel investigating \u0027Twin Flames Universe\u0027",
      "description": "A company promising \u0022twin flame\u0022 romance is being investigated after being featured in a Netflix Documentary. According to Michigan\u0027s Attorney General Dana Nessel, police searched two homes in Leelanau County where the Twin Flames Universe group is based. \nThe group\u0027s website said it helps people find love and offers life coaching. The documentary painted a different picture.",
      "release": "2025-07-02T10:12:15Z",
      "duration": "00:00:37",
      "explicit": false,
      "youTubeId": "R27z9Z40UoI",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R27z9Z40UoI"
      }
    },
    {
      "id": "a54c5f91-8377-429d-8701-ff5449fc9c56",
      "title": "Twin Flames Universe under investigation after Netflix documentary",
      "description": "Twin Flames Universe, a spiritual group in Leelanau County, is under investigation by Michigan Attorney General Dana Nessel following increased national scrutiny and a Netflix documentary titled \u0022Escaping Twin Flames.\u0022 The group is accused of employing cult-like tactics, prompting search warrants to be executed on its leadership and properties. Nessel has urged the public to provide any information on potential crimes by the group, with the option of anonymity.",
      "release": "2025-07-01T21:24:43Z",
      "duration": "00:00:49",
      "explicit": false,
      "youTubeId": "AqVz-HXXUQc",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AqVz-HXXUQc"
      }
    },
    {
      "id": "58d22671-f19a-4951-81cd-f78a4ddf523e",
      "title": "Netflix cult documentary features family from Warren",
      "description": "A family from Macomb County said their daughter -- who is famous for her Tik Tok dances -- is under the influence of a cult in California.",
      "release": "2024-06-10T16:45:34Z",
      "duration": "00:09:34",
      "explicit": false,
      "youTubeId": "-9qJMpiQ4tw",
      "subjects": [
        "7M Films",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-9qJMpiQ4tw"
      }
    }
  ]
}