{
  "id": "59383604-b3c8-4bf0-9203-d41e9de80a30",
  "name": "Club Random with Bill Maher",
  "spotifyId": "0Z3M1mtmdnvMgTbO27LHkB",
  "appleId": 1613459129,
  "youTubeChannelId": "UC8efBuMd2Tsolb5uTfpex3A",
  "episodes": [
    {
      "id": "c9a59ca8-2f29-4e7a-92fc-e5d233d92c7f",
      "title": "Billy Bush | Club Random with Bill Maher",
      "description": "Bill Maher is joined by media personality and podcaster Billy Bush for a sharp, surprising, and hilarious conversation that bounces from family dynasties to the minefields of modern media. Bush opens up about growing up a Manhattan kid with presidential uncles, surviving scandal, and finding his voice again behind the mic. The two swap stories about Hollywood etiquette, Julia Roberts at the Oscars, psychedelic trips, and why everyone’s addicted to outrage. They debate fame, forgiveness, how tequila ages over time – and Bush recalls the wildest elevator encounter in New York, proof that even fame has its ups and downs. Subscribe to the Club Random YouTube channel: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.youtube.com/c/clubrandompodcast?sub_confirmation=1⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Watch episodes ad-free – subscribe to Bill Maher’s Substack: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://billmaher.substack.com⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Subscribe to the podcast for free wherever you listen: ⁠ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://bit.ly/ClubRandom⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Support our Advertisers: Go to https://zbiotics.com/RANDOM and use RANDOM at checkout for 15% off any first time orders of ZBiotics probiotics. Get $10 off your first month’s subscription and free shipping at https://www.nutrafol.com and enter promo code RANDOM Upgrade your wardrobe and save on @trueclassic at ⁠https://www.trueclassic.com/RANDOM⁠ ! #trueclassicpod #ad Buy Club Random Merch: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠https://clubrandom.com⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ Learn more about your ad choices. Visit https://podcastchoices.com/adchoices ABOUT CLUB RANDOM Bill Maher rewrites the rules of podcasting the way he did in television in this series of one on one, hour long conversations with a wide variety of unexpected guests in the undisclosed location called Club Random. There’s a whole big world out there that isn’t about politics and Bill and his guests—from Bill Burr and Jerry Seinfeld to Jordan Peterson, Quentin Tarantino and Neil DeGrasse Tyson—talk about all of it. For advertising opportunities please email: PodcastPartnerships@Studio71us.com ABOUT BILL MAHER Bill Maher was the host of “Politically Incorrect” (Comedy Central, ABC) from 1993-2002, and for the last fourteen years on HBO’s “Real Time,” Maher’s combination of unflinching honesty and big laughs have garnered him 40 Emmy nominations. Maher won his first Emmy in 2014 as executive producer for the HBO series, “VICE.” In October of 2008, this same combination was on display in Maher’s uproarious and unprecedented swipe at organized religion, “Religulous.” Maher has written five bestsellers: “True Story,” “Does Anybody Have a Problem with That? Politically Incorrect’s Greatest Hits,” “When You Ride Alone, You Ride with Bin Laden,” “New Rules: Polite Musings from a Timid Observer,” and most recently, “The New New Rules: A Funny Look at How Everybody But Me Has Their Head Up Their Ass.” FOLLOW CLUB RANDOM https://www.clubrandom.com https://www.facebook.com/Club-Random-101776489118185 https://twitter.com/clubrandom_ https://www.instagram.com/clubrandompodcast https://www.tiktok.com/@clubrandompodcast FOLLOW BILL MAHER https://www.billmaher.com https://twitter.com/billmaher https://www.instagram.com/billmaher Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2025-10-20T07:00:00Z",
      "duration": "01:50:04.6690000",
      "explicit": true,
      "spotifyId": "3OYrrcEQ4YFJWptR1OBtX8",
      "appleId": 1000732614171,
      "youTubeId": "OYUlwdUAGC8",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3OYrrcEQ4YFJWptR1OBtX8",
        "apple": "https://podcasts.apple.com/podcast/billy-bush-club-random-with-bill-maher/id1613459129?i=1000732614171",
        "youtube": "https://www.youtube.com/watch?v=OYUlwdUAGC8"
      }
    }
  ]
}