{
  "_ts": 0,
  "id": "37c04bc6-c9aa-4733-9753-f87e10399264",
  "name": "CNN",
  "youTubeChannelId": "UCupvZG-5ko_eiXAupbDfxWw",
  "episodes": [
    {
      "id": "8e87254b-9014-49f6-823b-6d74340e261d",
      "title": "\u0027I was screaming\u0027: Diddy accuser recounts alleged assault in first-ever interview",
      "description": "A John Doe filed a civil suit against Sean “Diddy” Combs, accusing him of sexual assault at a “White Party” while Doe was employed by a private security firm. In an exclusive interview with CNN, Doe tells his story for the first time.  #CNN #News",
      "release": "2024-12-11T15:36:17Z",
      "duration": "00:08:21",
      "explicit": false,
      "youTubeId": "toV9W0uD0UY",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=toV9W0uD0UY"
      }
    },
    {
      "id": "917adf1c-173c-474b-ba63-c53c5fca1538",
      "title": "See what happens when Trump supporter talks to CNN reporter about the Constitution",
      "description": "CNN’s Donie O’Sullivan speaks to a Trump supporter while reporting on the surge of misinformation in the United States. The full episode, “MisinfoNation: The Trump Faithful,” airs on CNN’s The Whole Story with Anderson Cooper. #CNN #News",
      "release": "2024-04-27T20:30:02Z",
      "duration": "00:05:01",
      "explicit": false,
      "youTubeId": "Q5dovP0vWkw",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q5dovP0vWkw"
      }
    },
    {
      "id": "e250e319-04f0-41c5-b839-434b2bec431c",
      "title": "The case of the predator priest: Abuse and scandal in the Catholic Church (2019)",
      "description": "CNN’s Nima Elbagir examines allegations of rape, abuse, and cover-ups in the Catholic Church in this 2019 documentary.  #CNN #News",
      "release": "2023-10-29T22:00:05Z",
      "duration": "00:42:42",
      "explicit": false,
      "youTubeId": "Fsw6vskB-2M",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Fsw6vskB-2M"
      }
    },
    {
      "id": "5cc13533-259e-4e11-a874-fea56529abc5",
      "title": "Surviving a cult: How 30 people escaped the Jim Jones murder-suicide (2012)",
      "description": "More than 900 people died the day Rev. Jim Jones forced his church followers into a mass murder-suicide in his remote settlement in Guyana, but 30 people were able to survive by defying Jones and fleeing. A 2012 CNN Special Report explored their stories of desperation and remarkable will to survive. #CNN #News",
      "release": "2023-10-01T17:00:12Z",
      "duration": "01:24:46",
      "explicit": true,
      "youTubeId": "CvFGhjfbSGc",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CvFGhjfbSGc"
      }
    },
    {
      "id": "1eb26268-c5ff-4431-b8ce-69f7384a3161",
      "title": "Ex-Scientologist Leah Remini speaks out after Danny Masterson sentencing",
      "description": "Actress and former Scientologist Leah Remini speaks with CNN\u0027s Jake Tapper about the sentencing of actor and Scientologist Danny Masterson, who was convicted on two counts of rape earlier this year. The Church of Scientology has denied allegations it harassed Masterson\u0027s accusers. Remini has filed a lawsuit against the organization claiming years of harassment, but the group has also denied her allegations. #CNN #News",
      "release": "2023-09-09T04:20:23Z",
      "duration": "00:05:50",
      "explicit": false,
      "youTubeId": "-Ag7IQ3fVRQ",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-Ag7IQ3fVRQ"
      }
    },
    {
      "id": "6af2898d-6c6e-4de7-a1b5-32360b5c2dbb",
      "title": "Lawmaker shot at Jonestown compares Trump to cult leader Jim Jones",
      "description": "Rep. Jackie Speier (D-CA), who was shot by members of the Peoples Temple during the 1978 Jonestown Massacre, says she sees similarities between cult leader Jim Jones and former President Donald Trump in the way they use their charisma to connect with disillusioned American and act as \u0022merchants of deceit.\u0022 Speier was shot five times on an airstrip in Guyana while accompanying a lawmaker to investigate the nearby cult.\n#ReliableSources #CNN #News",
      "release": "2021-08-01T19:33:57Z",
      "duration": "00:06:14",
      "explicit": false,
      "youTubeId": "RReRlY88-7o",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RReRlY88-7o"
      }
    },
    {
      "id": "db489d40-ff24-43be-9822-1c3d18472e7c",
      "title": "Scientology leader\u0027s niece speaks out",
      "description": "Jenna Miscavige Hill talks to CNN\u0027s Piers Morgan about her uncle, David Miscavige.",
      "release": "2013-02-06T03:38:24Z",
      "duration": "00:02:01",
      "explicit": false,
      "youTubeId": "BC3zCMbdtaE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BC3zCMbdtaE"
      }
    },
    {
      "id": "93efc643-ea20-4cbe-978a-9a11c6f7615d",
      "title": "World\u0027s Untold Stories: Secrets \u0026 Sins",
      "description": "This is a documentary about  the first victim of clerical sexual abuse in Ireland  to go public with their story  It also shows why Pope Francis\u0027 had to chastise  bishops who covered up abuse by priests in their dioceses. The half hour CNNI show World\u0027s Untold Stories, produced by Andrew Tkach and editor Scott McGhee, also examines how errant priests were protected by the church and exported to other countries, including the United States.",
      "release": "2012-09-06T23:40:35Z",
      "duration": "00:25:05",
      "explicit": false,
      "youTubeId": "AUB52BatlPw",
      "subjects": [
        "Catholicism",
        "_Ireland"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AUB52BatlPw"
      }
    }
  ]
}