{
  "id": "6123804a-741d-401d-b4f5-554d14e0f16d",
  "name": "CNN-News18",
  "youTubeChannelId": "UCef1-8eOpJgud7szVPlZQAQ",
  "episodes": [
    {
      "id": "65113a2e-459b-4a66-a5a0-0b0582fa189e",
      "title": "US DOJ Finds Over 1 Million New Epstein Documents, Survivor Marina Lacerda Reveals Shocking Details",
      "description": "The U.S. Department of Justice (DOJ) announced that it has uncovered more than 1 million additional documents potentially connected to convicted sex offender Jeffrey Epstein. These newly found files have expanded the scope of materials under review and will delay their full public release \n\n#jeffreyepstein #epsteinfiles #usdoj #documentrelease #newsupdate #news18 \n\nn18oc-brass-tacks\n\nNews18 Mobile App - https://onelink.to/desc-youtube",
      "release": "2025-12-25T15:37:03Z",
      "duration": "00:15:29",
      "explicit": false,
      "youTubeId": "qdBmn68jcak",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qdBmn68jcak"
      }
    },
    {
      "id": "b7e3656b-4001-4d00-bdfb-2093d83264f5",
      "title": "I Entered Epstein\u0027s Orbit At The Tender Age Of 14, Epstein Survivor Makes Shocking Claim | News18",
      "description": "A survivor of convicted sex offender Jeffrey Epstein has alleged that she was drawn into Epstein’s orbit at the age of 14, claiming she was groomed and exploited while still a minor\n\n#jeffreyepstein #epsteincase #epsteinsurvivor #epsteinfiles #news18 \n\nn18oc_world \n\nNews18 Mobile App - https://onelink.to/desc-youtube",
      "release": "2025-12-25T11:53:17Z",
      "duration": "00:11:01",
      "explicit": false,
      "youTubeId": "7VmE-uz27y8",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7VmE-uz27y8"
      }
    },
    {
      "id": "9ed8e234-d7f7-43c8-a20f-6d2489034f3b",
      "title": "Epstein Files Mystery Deepens: Virginia Giuffre’s Family Demands Full Release | Trump–Epstein | LIVE",
      "description": "The mystery surrounding Jeffrey Epstein deepens as the family of Virginia Giuffre—one of Epstein’s most prominent sex-trafficking accusers—demands the immediate release of all Epstein files. Speaking to CNN’s Kaitlan Collins, Giuffre’s family says that Virginia wanted the truth to come out and that sealed documents continue to protect powerful individuals connected to Epstein’s global network.\n\nGiuffre’s brother makes an emotional appeal, stating that she was “not an object,” but someone who was “stolen” and “preyed upon.” While Epstein died in jail in 2019 before facing trial, questions around his associates, flight logs, sealed testimonies, and elite connections remain unanswered.\n\nThe renewed calls for transparency have once again brought attention to Epstein’s past links with influential figures, including former US President Donald Trump and his Mar-a-Lago association. While Trump has denied any wrongdoing and no criminal charges have been proven, the family insists the focus should remain on truth, accountability, and justice for survivors.\n\nAs pressure mounts globally, the key question remains: If there is nothing to hide, why are the Epstein files still sealed?\nWatch this report for the latest updates, context, and global reactions. \n\n#EpsteinFiles #VirginiaGiuffre #JeffreyEpstein #Trump #GlobalNews \nn18oc_world\nn18oc_live \nNews18 Mobile App - https://onelink.to/desc-youtube",
      "release": "2025-12-20T00:58:03Z",
      "duration": "11:55:01",
      "explicit": false,
      "youTubeId": "9vbIhYXcH0U",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9vbIhYXcH0U"
      }
    },
    {
      "id": "9e621b74-9a81-4510-918e-ec19515edb3e",
      "title": "Virginia Giuffre’s Family Reacts After Prince Andrew Is Stripped of Royal Title | Buckingham Palace",
      "description": "LONDON, UK — The family of Virginia Giuffre has spoken out after King Charles officially stripped Prince Andrew of his royal title and privileges amid renewed public scrutiny over his alleged ties to Jeffrey Epstein.\n\nThe move marks a historic moment for the British monarchy, as Buckingham Palace distances itself from long-standing controversy. Giuffre’s family welcomed the decision, calling it “a small step toward accountability,” while royal watchers say it could permanently alter Andrew’s standing within the royal family.\n\n#PrinceAndrew #VirginiaGiuffre #RoyalFamily #KingCharles #EpsteinScandal #BuckinghamPalace #RoyalNews #BreakingNews #UKNews #RoyalScandal #news18 \n\nNews18 Mobile App - https://onelink.to/desc-youtube",
      "release": "2025-10-31T20:34:56Z",
      "duration": "00:11:14",
      "explicit": false,
      "youTubeId": "SwJe_UrX2Yc",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SwJe_UrX2Yc"
      }
    },
    {
      "id": "1eee04ef-04ec-4129-9790-014fbd527090",
      "title": "LIVE: Prince Andrew Evicted From Buckingham Palace Amid Epstein Fallout | BREAKING | N18G",
      "description": "LIVE coverage of Prince Andrew being evicted from his Buckingham Palace mansion as the fallout from the Jeffrey Epstein scandal continues to shake the British royal family. King Charles has reportedly begun the process to strip Prince Andrew of all royal titles, marking an unprecedented moment in modern monarchy history. \n\n#PrinceAndrew #BuckinghamPalace #RoyalFamily #RoyalScandal #UKRoyals #JeffreyEpstein #PrinceAndrewEvicted #RoyalTitlesStripped #RoyalDrama #RoyalBreakingNews #UKMonarchy #RoyalUpdate #RoyalFamilyDrama #PrinceAndrewNews #RoyalEviction #PalaceNews #DukeOfYork #RoyalControversy \n\nn18oc_live\nNews18 Mobile App - https://onelink.to/desc-youtube",
      "release": "2025-10-31T13:57:31Z",
      "duration": "06:33:55",
      "explicit": false,
      "youTubeId": "6CvIcoY4FtE",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6CvIcoY4FtE"
      }
    }
  ]
}