{
  "id": "9c954cde-d972-443f-a05e-e5063e372479",
  "name": "Coast to Coast AM",
  "spotifyId": "3EwFCHlfY6VRv4Poqp7wPB",
  "appleId": 1714257667,
  "episodes": [
    {
      "id": "fbaa22c4-5fe7-4a43-be15-6b3b29ef4e47",
      "title": "Foods, Cults, \u0026 Religions Episode 3",
      "description": " Religious beliefs have been the source of food \u0022rules\u0022 since Pythagoras told his followers not to eat beans (they contain souls). Christina Ward, author, editor, and seeker, joined host Ian Punnett (Twitter) to discuss the explosion of religious movements since the Great Awakenings that birthed a cottage industry of food fads and cookbooks. She examined the interconnectivity between obscure sects and communities of the 20th Century who dabbled in vague spirituality and used food to both entice and control followers (Related Photos).Ward touched on various aspects related to the cultural and religious significance of food, examining the idea of ritualizing and sacralizing food, and how humans tend to honor the things they love. Pleasurable chemicals are released in the brain when eating delicious food as well, she added. Ward highlighted the importance of eating together in building trust and community. \u0022If someone gives us food, we trust that they\u0027re not going to poison us, either intentionally or accidentally, and so that\u0027s the initial act of trust that builds that community,\u0022 she said.Ward delved into the historical connections between spirituality and food, noting the early origins of communal eating, where sharing meals signified trust and unity among different groups. She explored the relationship between religious beliefs and dietary practices, citing examples such as the kosher and halal food laws and the association of certain animals with cleanliness or impurity.Ward spoke about the concept of communion as a form of community building and its historical and symbolic roots, including the use of bread and wine in religious rituals, symbolizing the body and blood of Christ. She reflected on the question of why certain foods are considered holy or forbidden, commenting on the significance of animals\u0027 lifestyles and how that impacts food choices.Ward also revealed how Little Debbie snack cakes were originally created to align with the dietary restrictions of the Seventh Day Adventist faith, which promoted a nearly vegan, vegetarian diet, avoiding meat, caffeine, sugar, spices, and chocolate as stimulants. These snack cakes were made as a means to help new converts adhere to this dietary regimen while following religious principles, she explained.World NewsIn the first hour, journalist and documentary filmmaker Robert Young Pelton offered his insights on the latest world news. Pelton discussed his experiences as a journalist, including reporting from war zones and interviewing dangerous individuals. He described his experience in Ukraine, where he saw the \u0022dirtiest kind of war\u0022 with \u0022mud, trenches, and shooting.\u0022 He noted the Russians are \u0022throwing bodies at bullets\u0022 and using \u0022badly made equipment.\u0022 Pelton revealed how Ukraine is using consumer drones and Skype to gather intelligence and coordinate attacks, while the Russians are struggling to adapt to these new tactics. He discussed the situation in Israel and Gaza, and the cycle of violence and negotiation in the Middle East, highlighting the brutality of terrorism and the difficulty of choosing sides.  ",
      "release": "2023-11-15T00:00:00",
      "duration": "00:35:52.2800000",
      "explicit": false,
      "spotifyId": "1HGJoTbWet3fMmaHbL2Mvb",
      "appleId": 1000634856156,
      "subjects": [
        "Seventh-day Adventist Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1HGJoTbWet3fMmaHbL2Mvb",
        "apple": "https://podcasts.apple.com/podcast/foods-cults-religions-episode-3/id1714257667?i=1000634856156"
      }
    }
  ]
}