{
  "_ts": 0,
  "id": "f4732bcc-f456-4cde-a3a8-df578ea469b3",
  "name": "Coffee \u0026 Cults: A Deep Dive Into Hollywood",
  "spotifyId": "5Ngu4lU5I81uMltUL6uoL1",
  "appleId": 1784540132,
  "youTubeChannelId": "UCnpOlzpWAjg03o8sOd6K1xw",
  "episodes": [
    {
      "id": "09f793d1-8b2f-4dad-9f4d-fe9d732ef45f",
      "title": "EVERYTHING You DON\u0027T Know About Laura Prepon\u0027s Scientology \u0027Exit\u0027 \u0026 Cruel Divorce",
      "description": "Laura Prepon moved to Hollywood in 1998 for her first ever role as the quintessential girl next door Donna Piccioti on That 70’s Show. But while That 70’s Show made Laura Prepon rich \u0026 famous beyond her dreams, it also introduced her to someone who brought a lot of darkness into her life, Danny Masterson. Laura Prepon \u0026 the rest of the That 70’s Show cast with the exception of Topher Grace became extremely close with Masterson, \u0026 also saw him as their cliques leader, but Laura Prepon \u0026 Danny Masterson’s relationship was much deeper than most of her costars. Through their friendship, Danny Masterson introduced Laura Prepon to the three biggest relationships of her life. Danny Masterson set Laura Prepon up with his brother Chris Masterson who has his own alleged dark history \u0026 when things didn’t work out with Chris Masterson, Danny Masterson was also the one who introduced Laura Prepon to her ex-husband and father of her children Ben Foster. Danny Masterson is of course also responsible for introducing Laura Prepon to the controversial Church of Scientology. Laura Prepon was a very active member of the alleged cult for decades, but within weeks of Danny Masterson’s arrest for multiple horrendous crimes, Laura Prepon claimed she was no longer an active scientologist. Laura Prepon refused to speak about her \u0026 her husbands still close ties to Danny Masterson, her exit from scientology or her alleged intimidation of dm’s victims. Given Laura Prepon’s silence on the subjects, some people thought op’s silence meant she was distancing herself from dm, while many more came to the conclusion she maintained a friendship with dm but just not publicly. After Danny Masterson’s sentencing in sept 2023 conversation around Laura Prepon and dm’s relationship died down, but behind the scenes lp’s relationship with dm was allegedly causing issues in her marriage, but not for the reasons you might think, as her now ex-husband ben foster is also a decade long friend of Danny Masterson\u0027s. Today we\u0027ll be covering everything about Laura Prepon, her \u0027exit\u0027 from scientology, her relationships with Chris Masterson \u0026 Ben Foster, her career \u0026 her messy divorce. SOURCES: https://docs.google.com/document/d/1oV4oqV6wuTLDNkTJZLQcPbgORvvd_fCy-5w4_UIDsb8/edit?usp=sharing THANK YOU SO MUCH FOR LISTENING! YOUTUBE CHANNEL WITH VIDEO VERSIONS: https://www.youtube.com/@coffeeandcults MERCH STORE: https://my-store-1023044.creator-spring.com/. PATREON: https://www.patreon.com/coffeeandcultsextra/ YOUTUBE MEMBERSHIP: https://www.youtube.com/@coffeeandcults/membership INSTA: https://www.instagram.com/theashsilver/ \u0026 https://www.instagram.com/coffeeandcultsyt OTHER CHANNELS: Coffee, Cults \u0026 Cats https://www.youtube.com/@coffeecultsandcats Ash Silver: https://www.youtube.com/@AshSilver",
      "release": "2025-05-11T15:00:00Z",
      "duration": "01:10:48.7900000",
      "explicit": false,
      "spotifyId": "09OlPwUa7GBMGyKOysGhTV",
      "appleId": 1000707993998,
      "youTubeId": "3rBcr4cSHts",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09OlPwUa7GBMGyKOysGhTV",
        "apple": "https://podcasts.apple.com/podcast/everything-you-dont-know-about-laura-prepons-scientology/id1784540132?i=1000707993998",
        "youtube": "https://www.youtube.com/watch?v=3rBcr4cSHts"
      }
    },
    {
      "id": "0f888f4a-a5e5-4637-8222-8c71ea8746a2",
      "title": "How Diddy Helped Make J Lo A Music Star \u0026 Bought Her Silence",
      "description": "Diddy \u0026 Jennifer Lopez were an item back in the late 1990\u0027s and early 2000\u0027s and during their relationship the both went through huge life altering moments. During their relationship Diddy helped J Lo break into the music scene and become a star. At the same time, Diddy \u0026 J Lo were involved in a sho*oting at Club New York just prior to New Years 1999. Both J Lo \u0026 Diddy were arrested \u0026 evidence \u0026 accusations stacked up, although surprisingly after a ling trial, Diddy walked away completely exonerated. This event went on to create headline after headline, \u0026 despite Combs was charged with serious crimes, J Lo remained loyal and by his side. J Lo has kept the details of that night a secret, \u0026 a lot of mystery remains around it still to this day, which is why we’ll be taking a closer look at what really happened, because there is SO much more to the story of how Jennifer Lopez gained her enormous music career, her relationship with Combs \u0026 her career in present day. It seems as though after decades of rudeness, poor treatment of others \u0026 horrendous behaviour, J Lo\u0027s past, actions \u0026 behaviour has finally caught up to her. VIDEO VERSION AVAILABLE HERE: https://www.youtube.com/watch?v=APWMDCfCh84\u0026ab_channel=CoffeeandCults YouTube Channel: https://www.youtube.com/@coffeeandcults There are a lot of other videos \u0026 deep dives on my YouTube channel, Coffee \u0026 Cults, THANK YOU so much for watching \u0026 let me know your thoughts in the comments! INSTA: https://www.instagram.com/theashsilver/ \u0026 https://www.instagram.com/coffeeandcultsyt SOURCES: https://docs.google.com/document/d/1Qu41VDDVccHqQVrTh7Q5WdHCnwI8pP__F0WvzRkm6RM/edit?usp=sharing MY PATREON: https://www.patreon.com/coffeeandcultsextra/ YOUTUBE MEMBERSHIP: https://www.youtube.com/@coffeeandcults/membership",
      "release": "2024-12-28T20:00:00Z",
      "duration": "01:34:48.8680000",
      "explicit": false,
      "spotifyId": "0o9o6vupxuhc1lGJ4MrDnE",
      "appleId": 1000681971067,
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0o9o6vupxuhc1lGJ4MrDnE",
        "apple": "https://podcasts.apple.com/podcast/how-diddy-helped-make-j-lo-a-music-star-bought-her-silence/id1784540132?i=1000681971067"
      }
    }
  ]
}