{
  "_ts": 0,
  "id": "004e7e63-0d52-4033-83c3-5d814086b7e8",
  "name": "Coffee and Cults (2)",
  "youTubeChannelId": "UCnpOlzpWAjg03o8sOd6K1xw",
  "episodes": [
    {
      "id": "ea8e81d7-6ba3-4518-a087-8adfd15ad324",
      "title": "The Crimes, Cheating \u0026 Lies That Built Diddy \u0026 Ashton\u0027s Hollywood Rat Pack",
      "description": "Diddy \u0026 Ashton Kutcher have been friends for over 20 years, \u0026 after Diddy\u0027s arrest, it seems Ashton Kutcher \u0026 his wife Mila Kunis are trying to distance themselves from any association with Diddy. Especially after the disaster filled year they just had after writing letters of support for convicted serial monster Danny Masterson. In the early 2000’s, Diddy was already an a-lister, \u0026 while working on his hit show Making the Band with MTV, he met Hollywoods latest golden boy who also had a successful MTV show, Ashton Kutcher. Sean Combs \u0026 Ashton Kutcher created a fabricated story for how they met at MTV, but later in the video we’ll discuss the alleged real story, as this encounter with Diddy would set up over 20 years of friendship \u0026 showed P Diddy that Ashton Kutcher, supported by his best friend Danny Masterson could keep a secret. Combs \u0026 Kutcher connected immediately, \u0026 Diddy enjoyed spending time with Kutcher so much, he started inviting him to do everything friends would do together \u0026 much more. \n\nINTRO: 00:00-00:01 00:02-03:04\nPART ONE: WHO ARE THE RAT PACK IN PRESENT DAY (CRIMES. ALLEGATIONS \u0026 LIES): 03:05-59:08\nPART TWO: THE RAT PACKS HOLLYWOOD HEY DAYS: 59:09-01:47:23\n\nIn 2003 Combs also hit it off with Kutcher’s best friend Danny Masterson \u0026 combined with Kutcher and Mastersons fellow That 70’s Show costar, Wilmer Valderrama, Diddy formed a group with the three That 70’s Show stars \u0026 put himself at the centre, P Diddy dubbed them the new Hollywood rat pack.  In this video we\u0027ll discuss everything from the foundation of Diddy \u0026 Kutcher\u0027s relationship, their partying rat pack, business endeavours and their connections in present day. THANK YOU so much for watching \u0026 let me know your thoughts in the comments!\n*Amendment: I accidentally say FTC when I mean SEC regarding the fine Ashton \u0026 Mila received. \n\nSOURCES: https://docs.google.com/document/d/1QguIxkEqBxwIftXSG2QKviz2o8h1uzN-SUVglivyFdg/edit?usp=sharing\nMY NEW PATREON: https://www.patreon.com/coffeeandcultsextra/\nYOUTUBE MEMBERSHIP: https://www.youtube.com/@coffeeandcults/membership\nMy amazing editor Evelyn Dar’s Channel https://youtube.com/@EvelynDar?si=D1J2FTMLSOP7g2AQ @EvelynDar \n\n*Second Channel - Coffee, Cults \u0026 Cats* (launching videos \u0026 lives very soon) https://www.youtube.com/@coffeecultsandcats\n*TV Channel* https://www.youtube.com/@AshSilver\n*Patreon* https://www.patreon.com/coffeeandcultsextra/\n*Insta* https://www.instagram.com/theashsilver/ \u0026 https://www.instagram.com/ashsilverinvestigates \n*Ms Gloria\u0027s Insta - https://www.instagram.com/MsGloriaTheCat/\n*Twitter* https://www.twitter.com/theashsilver/ \u0026 Facebook https://www.facebook.com/the.ash.silver/\nBusiness Email - Ash.Silver2020@gmail.com\n\ndiddy puff daddy sean combs p diddy ashton kutcher mila kunis  ash silver coffee and cults that 70’s show Ashton Kutcher mila Kunis ash silver coffee and cults that 70\u0027s show that 90\u0027s show danny masterson ashton kutcher mila kunis wilmer valderrama topher grace scientology that 70s show ashton kutcher and mila kunis ashton kutcher apology ashton kutcher mila kunis apology ashton kutcher child trafficking ashton kutcher danny masterson danny masterson trial danny masterson sentencing danny masterson case explained danny masterson case that 70s show doc that 90s show wilmer valderrama lindsay lohan demi moore demi lovato diddy trial sean combs on trial diddy bail diddy hearing danny masterson danny masterson documentary danny masterson trial danny masterson interview ashton kutcher mila kunis danny masterson ashton kutcher that 70s show church of scientology danny masterson conan danny masterson sentencing danny masterson and ashton kutcher danny masterson trial verdict  danny masterson case danny masterson case explained danny masterson victim testimony scientology scientology explained leah remini scientology and the aftermath scientology\nThe Crimes, Cheating, Lies \u0026 Monsters That Built Diddy \u0026 Ashton Kutcher\u0027s Hollywood Rat Pack\n\n#diddy  #ashtonkutcher #dannymasterson",
      "release": "2024-10-27T16:18:45Z",
      "duration": "01:47:23",
      "explicit": false,
      "youTubeId": "ciniWJWMFwM",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ciniWJWMFwM"
      }
    },
    {
      "id": "6989f862-f1bc-4566-9cf5-0a23adb3fb6d",
      "title": "The Cheating, Cults, Crimes \u0026 Curse of One Tree Hill (What You Don’t Know)",
      "description": "CHAPTERS\nINTRO: 00:00-00:01 00:02-02:03\nCHAPTER ONE - MARK SCHWAHN: 02:04-47:53\nCHAPTER TWO - CULTS \u0026 CRIMES: 47:54-01:05:08\nCHAPTER THREE - ROMANCES \u0026 SHOWANCES: 01:05:09-01:27:06\nCHAPTER FOUR - CURRENT DAY CONTROVERSY’S: 01:27:07-01:44:08\n\nMY NEW PATREON: https://www.patreon.com/coffeeandcultsextra/\nEvelyn Dar\u0027s (My Editor \u0026 Friend) Channel: https://www.youtube.com/@UCYGtZMAQQja0OSQDGH7svHA \n\n*Second Channel* (launching shorter videos \u0026 lives very soon) https://www.youtube.com/@coffeeandcultstoo\n*TV Channel* https://www.youtube.com/@ashsilver\n*Patreon* https://www.patreon.com/coffeeandcultsextra/\n*Insta* https://www.instagram.com/theashsilver/ \u0026 https://www.instagram.com/ashsilverinvestigates \n*Twitter* https://www.twitter.com/theashsilver/ \u0026 Facebook https://www.facebook.com/the.ash.silver/\nBusiness Email - Ash.Silver2020@gmail.com\n\n*_ONE TREE HILL VIDEO SOURCES_* https://docs.google.com/document/d/1NiTOCkhzd0-Nh3mJ2d1NTehlgOGFTmqSRMb83110ZZQ/edit?usp=drive_link\n\none tree hill mark schwahn sophia bush chad michael murray hilarie Burton joy lenz cult sophia bush ashlyn harris sophia bush chad michael murray james lafferty drama queens one tree hill doc one tree hill deep dive drama queens one tree hill one tree hill interviews mark schwahn one tree hill mark schwahn allegations coffee and cults ash silver\n\n#onetreehill #sophiabush #dramaqueens",
      "release": "2024-05-27T22:44:18Z",
      "duration": "01:44:09",
      "explicit": false,
      "youTubeId": "skM7wZTTqqw",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=skM7wZTTqqw"
      }
    },
    {
      "id": "6c3dfd64-f5c4-47e2-a1bb-de68976d34c3",
      "title": "The Cults, Crimes, Creeps \u0026 Curse Of The WB (Buffy, Charmed, Smallville \u0026 More)",
      "description": "INTRO: 00:00-00:01 00:02-02:31\n7TH HEAVEN - CHAPTER ONE: 02:32-15:14\nBUFFY THE VAMPIRE SLAYER \u0026 ANGEL, PART ONE - CHAPTER TWO: 15:15-31:26\nCHARMED - CHAPTER THREE: 31:27-53:59\nSMALLVILLE - CHAPTER FOUR: 54:00-01:16:34\nBUFFY THE VAMPIRE SLAYER \u0026 ANGEL, PART TWO - CHAPTER FIVE: 01:16:35-01:56:32\n\nSOURCES: https://docs.google.com/document/d/1SVnriqo6LgeCoPx82xyJ2f1cBdw5e3k1q-iv1Ykd22Y/edit?usp=sharing\n\nMY NEW PATREON: https://www.patreon.com/coffeeandcultsextra/\nFollow Sarah Allison on Tik Tok - SlayTheSilence \u0026 here on YT @SlayTheSilence \n\n✔﻿ TV Channel - https://www.youtube.com/c/ashsilver\n✔ Social Media \n@TheAshSilver https://www.instagram.com/theashsilver/ -Main Insta @ashsilverinvestigates https://www.instagram.com/ashsilverinvestigates Coffee \u0026 Cults IG\nTheAshSilver https://www.twitter.com/theashsilver/\nThe.Ash.Silver https://www.facebook.com/the.ash.silver/\n✔ Business Email - Ash.Silver2020@gmail.com\n\nbuffy the vampire slayer nicholas brendon nicholas brendon arrest angel the series buffy and angel smallville charmed stephen collins joss whedon cult nxivm allison mack allison mack nxivm sarah michelle gellar david boreanaz buffy charmed drama, shannen doherty alyssa milano shannen doherty podcast buffy cast then and now buffy cast now allison mack interview allison mack released stephen collins confession stephen collins now nicholas brendon dr phil nicholas brendon walks out of dr phil nicholas brendon arrest charmed controversy tom welling michael rosenbaum keith raniere the vow megacon shannen doherty holly marie combs rose mcgown alyssa milano david boreanaz joss whedon charisma carpenter ray fisher amber benson michelle trachtenberg joss whedon controversy charmed drama charmed documentary charmed deep dive buffy the vampire slayer deep dive nicholas brendon david boreanaz fight sarah michelle gellar alyson hannigan smallville behind the scenes buffy bloops 7th heaven the wb the wb network one tree hill dawson\u0027s creek joshua jackson the cw\n\n#documentary  #buffythevampireslayer #charmed",
      "release": "2024-05-02T23:22:31Z",
      "duration": "01:56:33",
      "explicit": false,
      "youTubeId": "Q7dpmIqDsTg",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q7dpmIqDsTg"
      }
    },
    {
      "id": "7dde4f56-e227-448e-b2c1-8ab778dc9c0a",
      "title": "EVERYTHING You Don’t Know About The Twin Flames CULT (Forced Transitions, New Humans \u0026 Apocalypses)",
      "description": "Twin Flames Universe is a cult lead by Jeff and Shaleia Divine (previously Jeff and Shaleia Ayan \u0026 many other names). They\u0027ve been accused of brain washing, coercion, not paying people who work for them, forcing people to transition, telling their followers to stalk and harass their \u0027twin flame\u0027 \u0026 even telling people to violate restraining orders. Jeff and Shaleia are earning millions of dollars from their followers and all of the controversies surrounding them have caused the media to investigate their activity, journalists at Vanity Fair, Vice, and several others have dove into Jeff and Shaleia and Twin Flames Universe. In recent months, there has also been two docuseries released, Netflix\u0027s Escaping Twin Flames Universe \u0026 Amazon Prime\u0027s Desperately Seeking Soulmate - Escaping Twin Flames Universe. So today we\u0027ll be going over everything to do with Twin Flames Universe \u0026 the controversy surrounding Jeff and Shaleia - alleged coercion, brain washing, forced transition, not paying their workers, attempting to move all the followers to a privately purchased plot of land with hundreds of arches and so many other things. \nNOTE: This video is the result of research and everything is alleged and based on my personal opinion.\n\nIntro 00:00-00:01 00:02-02:05\nChapter One - What is Twin Flames Universe? 02:06-08:23\nChapter Two - Who Are Jeff \u0026 Shaleia? 08:24-17:37\nChapter Three -  Coaching, Courses \u0026 Bullshit 17:38-30:25\nChapter Four - Money, Control \u0026 Dangerous Mental Health ’Treatment’ 30:26-49:00\nChapter Five - TGolden Children \u0026 Coerced Transitions 49:01-56:49\nChapter Six - Former Members Stories 56:50-01:17:02\nChapter Seven - Twin Flames Universe Today 01:17:03-01:42:37\n\nSOURCES: https://docs.google.com/document/d/1pwg0B6SmPBslORJ6PP7tvGfem83AlpjnqVzWRp-F6HM/edit?usp=sharing\nSpecial thanks (links to specific videos \u0026 channels in sources) to @letthefresherin , @lescomicmaker \n\n✔﻿ Second Channel - https://www.youtube.com/@UCh3o7rJe-xT1iYoPtjU37vQ \n✔﻿ TV Review Channel - https://www.youtube.com/@UCJCNGEYpTATKX55M5P_x3Dg \n✔ Social Media \nAshSilverInvestigates https://www.instagram.com/ashsilverinvestigates/ - Coffee \u0026 Cults Insta\nTheAshSilver https://www.instagram.com/theashsilver/ - Main Channel Insta\nTheAshSilver https://www.twitter.com/theashsilver/\nThe.Ash.Silver https://www.facebook.com/the.ash.silver/\n✔ Business Email - Ash.Silver2020@gmail.com\n\n#twinflamesuniverse #documentary",
      "release": "2024-02-27T21:33:59Z",
      "duration": "01:42:38",
      "explicit": false,
      "youTubeId": "mjBnRN0T74s",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mjBnRN0T74s"
      }
    },
    {
      "id": "c2ccc72f-104e-431f-ae86-734b762cb622",
      "title": "Everything You NEED To Know About Sister Wives (MLM\u0027s, Lies \u0026 Drama)",
      "description": "00:00-00:01 00:02-03:05 Intro\n03:06-14:17 Who Are The Brown Family? Life Before the Show\n14:18-34:38 Family Dynamics\n34:39-44:31 Money Problems \u0026 The Children\n44:32-01:11:21 The MLM’s, My Sisterwife’s Closet \u0026 Health Insurance\n01:11:22-01:31:34 The Future of the Show \u0026 Special Guest @realityamanda , @realiteasquad \u0026 Ace \u0026 Katelyn Fanning from the Sisterwives Podcast ‘Love Should Be Multiplied, Not Divided’\n01:31:35-01:34:48 Conclusion \n\nSister Wives is currently one of the most sucessful reality shows on television, and for 18 seasons viewers have follow the lives of Kody, Meri, Janelle, Christine, \u0026 Robyn Brown and their 18 children. In the early seasons of the show, the Browns tried to convince their audience that polygamy worked and that they were leading happy lives. Fast forward to today, and that premise has come crashing down, with three out of the four marriages failing and Kody barely speaking to any of his children. There\u0027s a lot of drama with Sister Wives, but also a lot of questionable behaviour, from predatory MLM\u0027s, money problems, the injuries and incidents that have happened to the kids on the show and just the all around awful behaviour by Kody Brown. Today we\u0027re going to be diving in to EVERYTHING you need to know about not only the Sister Wives show, but also the lives of Kody, Meri, Christine, Janelle and Robyn Brown outside of the show. I am also sitting down with some of the most beloved Sister Wives content creators towards the end of the video, so make sure you stick around for that! Thanks so much for watching!\n\n✔﻿ TV Channel - https://www.youtube.com/c/ashsilver\n✔ Social Media \u0026 Patreon - AshSilverInvestigates https://www.instagram.com/ashsilverinvestigates/ - Coffee \u0026 Cults Insta\nTheAshSilver https://www.instagram.com/theashsilver/ - Main Channel Insta\nTheAshSilver https://www.patreon.com/theashsilver/\nTheAshSilver https://www.twitter.com/theashsilver/\nThe.Ash.Silver https://www.facebook.com/the.ash.silver/\n✔ Podcast -  Drinks at Dana\u0027s - An L Word Podcast https://drinksatdanas.buzzsprout.com/\n✔ Business Email - Ash.Silver2020@gmail.com\n✔﻿ VPN Discount - Affiliate Link - https://www.expressvpn.com/ashsilver\n\nsister wives sister wives tlc sister wives sister wives season 18 sister wives season 19 christine and david wedding sister wives look back sister wives talk back sister wives 2024 reality show sister wives drama sister wives breakup sister wives divorce kody brown robyn brown christine brown janelle brown meri brown sister wives tell all sister wives season 17 sister wives 2023 kody meri brown split kody janelle brown split kody christine brown split analysis documentary tlc tlc show \n\n#sisterwives #sisterwivestlc",
      "release": "2023-12-29T18:32:29Z",
      "duration": "01:34:55",
      "explicit": false,
      "youTubeId": "g6ELkhfkpMU",
      "subjects": [
        "Multi-Level Marketing",
        "Apostolic United Brethren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g6ELkhfkpMU"
      }
    },
    {
      "id": "f31d79e7-676a-4f63-aeb6-92f2aa8b5b3a",
      "title": "Everything You DON\u0027T Know About Danny Masterson \u0026 His Crimes",
      "description": "Timestamps\n00:00-00:01 Video starts\n00:02-02:42 Intro\n02:43-12:10 Chapter One - Who Is Danny Maqsterson?\n12:11-26:24 Chapter Two - Accusations\n26:25-55:52 Chapter Three - The Trial\n55:53-01:04:28 Chapter Four - Verdict\n01:04:29-01:36:40 Chapter Five - Sentencing \u0026Ashton Kutcher \u0026 Mila Kunis Letter Backlash\n01:36:41-01:47:25 Chapter Six - Aftermath, Civil Trial, Divorce \u0026 SP Declaration\n\nDanny Masterson has been a stable on television for the last 25 years, from That 70\u0027s Show to Men at Work to The Ranch, most people are aware of who he is. He is also is best friends with his That 70\u0027s Show costars, Ashton Kutcher \u0026 Mila Kunis. Masterson may look to be another typical Hollywood celebrity, but behind the scenes he was attacking a large amount of women, many more than you’ve heard about in the mainstream media. Danny Masterson, along with his siblings Chris Masterson (Malcolm in the Middle) \u0026 Alanna Masterson (The Walking Dead), is a lifelong member of the Church of Scientology. This case has had a lot of publicity because of the celebrities attached to it but unless you have been following this trial day after day from the people who were in court and following it all extremely closely, I think you’ll be surprised by what really went on. The investigation took over seven years, and Leah Remini even put out a special episode of Leah Remini: Scientology \u0026 the Aftermath, covering Masterson\u0027s attacks on multiple women. This video will go over everything about Masterson, the accusations, trial, outcome, aftermath and more. Let me know your thoughts in the comments and a huge thank you to @GrowingUpInScientology who attended the Danny Masterson trial everyday and provided live updates throughout the trial.\n\n✔﻿ TV Channel - https://www.youtube.com/c/ashsilver\n✔ Social Media - AshSilverInvestigates \nhttps://www.instagram.com/ashsilverinvestigates/ - Coffee \u0026 Cults Insta\nTheAshSilver https://www.instagram.com/theashsilver/ \nMain Channel Insta\nTheAshSilver https://www.patreon.com/theashsilver/\nTheAshSilver https://www.twitter.com/theashsilver/\nThe.Ash.Silver https://www.facebook.com/the.ash.silver/\n✔ Podcast -  Drinks at Dana\u0027s - An L Word Podcast https://drinksatdanas.buzzsprout.com/\n✔ Business Email - Ash.Silver2020@gmail.com\n✔﻿ VPN Discount - Affiliate Link - https://www.expressvpn.com/ashsilver\n\ndanny masterson danny masterson documentary danny masterson trial danny masterson interview ashton kutcher mila kunis danny masterson ashton kutcher that 70s show church of scientology danny masterson conan danny masterson sentencing danny masterson and ashton kutcher danny masterson trial verdict danny masterson verdict danny masterson case danny masterson case explained danny masterson victim testimony scientology scientology explained leah remini scientology and the aftermath scientology leah remini ash silver coffee and cults\n\n#dannymasterson #scientology #documentary",
      "release": "2023-10-24T18:16:02Z",
      "duration": "01:47:26",
      "explicit": false,
      "youTubeId": "ogiuctcOz-o",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ogiuctcOz-o"
      }
    },
    {
      "id": "55eaa2fe-c946-46b9-b29f-d990830c2736",
      "title": "The Dark Fall of The Duggars \u0026 TLC",
      "description": "*I\u0027ve had to cut out some clips as TLC literally copyright claimed everything even though the video isn\u0027t even monetised! \nTRIGGER WARNING SA SH R ALL THE THINGS\nToday we are discussing the channel TLC and it’s platforming of predators such as Josh Duggar of 19 Kids and Counting/Counting On, Toby Willis of The Willis Family, Geoffrey Paschel of Before the 90 Days/90 Day Fiance and other predators that appeared on shows such as Here comes Honey Boo Boo \u0026 Little People Big World. We will go thought each of the shows in sections\n\nIntro - 00:00-00-01 00:01-02:26\nThe Duggars - 02:27-19:58\nThe Willis Family - 19:59-22:03\nLittle People Big World - 22:04-24:59\nHere Comes Honey Boo Boo - 24:04-25:28\n90 Day Fiance - 25:29-30:15\nOutro - 30:16-33:23\n\nSources\nDuggarSnark, Reddit\nMegyn Kelly, Fox News\nYourWetSock, YouTube\nCeleb Talk Guy, YouTube\nFundie Fridays, YouTube\nMikey Atkins, YouTube\nJacob Roloff, Twitter\nhttps://www.usatoday.com/story/entertainment/celebrities/2022/05/25/josh-duggar-sentence-child-pornography-case/9809755002/\nhttps://www.dailymail.co.uk/news/josh_duggar/index.html\nThe Willis Family, The Mail\n\nLet me know your thoughts in the comments.\nSUBSCRIBE, LIKE \u0026 COMMENT - IT REALLY HELPS! Thanks so much for watching!\n✔﻿ M Y   M A I N   C H A N N E L  -   A S H  S I L V E R\nhttps://www.youtube.com/c/ashsilver\n✔﻿ M E R C H\nhttps://ash-silver-2.creator-spring.com/ \n✔ S O C I A L S  \u0026  P A T R E O N\nThe.Ash.Silver https://www.instagram.com/theashsilver/\nTheAshSilver https://www.patreon.com/theashsilver/\nTheAshSilver https://www.twitter.com/theashsilver/\nThe.Ash.Silver https://www.facebook.com/the.ash.silver/\n✔ P O D C A S T \nDrinks at Dana\u0027s - An L Word Podcast https://drinksatdanas.buzzsprout.com/\n✔ B U S I N E S S ﻿ E M A I L\nAsh.Silver2020@gmail.com\n✔﻿ E X P R E S S  V P N  A F F I L I A T E  L I N K - D I S C O U N T  C O D E\nhttps://www.expressvpn.com/ashsilver\n\njosh duggar, the duggars , 19 kids and counting, the willis family,here comes honey boo boo, 90 day fiance,geoffrey paschel 90 day,little people big world, duggar , jim bob, duggar family josh duggar sentencing josh duggar documentary geoffrey paschel geoffrey paschel 90 day fiance geoffrey paschel sentencing toby willis the willis family tlc tlc predator caught josh duggar trial\n\n#joshduggar #duggarfamily #tlc",
      "release": "2022-06-03T21:17:04Z",
      "duration": "00:33:24",
      "explicit": false,
      "youTubeId": "dKciR5wIZqM",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dKciR5wIZqM"
      }
    },
    {
      "id": "643a9341-19f5-4869-ba17-a99968a75f51",
      "title": "Smallville Hero to Cult Leading Villian | The Cult of Allison Mack \u0026 NXIVM",
      "description": "*TRIGGER WARNING ABUSE, SA, SH, HARM TO OTHERS, CULTS ALL THE THINGS! HEAVY SUBJECT MATTER*\nWelcome to a new video, today we are talking about the rise and fall of Allison Mack. Mack went from the star of a Disney Channel movie, to the lead on one of the first superhero shows on The WB, \u0026 later The CW, to second in command of a cult, NXIVM. Mack was second only to Keith Raniere, together they ran a pyramid scheme and then, a s*x cult. We are going over everything that happened on Mack\u0027s rise, her path at NXIVM, what happened after everything fell apart and how she became inmate no 90838-053. Thank you for watching!\n*THIS VIDEO IS NOT MONETISED ANY ADS ARE PUT ON BY YOUTUBE*\n\nSUBSCRIBE, LIKE \u0026 COMMENT - IT REALLY HELPS! Thanks so much for watching!\n✔﻿ M Y   M A I N   C H A N N E L  -   A S H  S I L V E R\nhttps://www.youtube.com/c/ashsilver\n✔﻿ M E R C H\nhttps://ash-silver-2.creator-spring.com/ \n✔ S O C I A L S  \u0026  P A T R E O N\nThe.Ash.Silver https://www.instagram.com/theashsilver/\nTheAshSilver https://www.patreon.com/theashsilver/\nTheAshSilver https://www.twitter.com/theashsilver/\nThe.Ash.Silver https://www.facebook.com/the.ash.silver/\n✔ P O D C A S T \nDrinks at Dana\u0027s - An L Word Podcast https://drinksatdanas.buzzsprout.com/\n✔ B U S I N E S S ﻿ E M A I L\nAsh.Silver2020@gmail.com\n✔﻿ E X P R E S S  V P N  A F F I L I A T E  L I N K - D I S C O U N T  C O D E\nhttps://www.expressvpn.com/ashsilver\n\nSources\n\nThe Vow - HBO\nSeduced: The Lost Women of NXIVM  - Starz\nwww.allisonmack.com\nInside of You With Michael Rosenbaum Podcast - https://www.youtube.com/c/InsideofYouwithMichaelRosenbaum \nhttps://www.nytimes.com/2019/05/13/nyregion/nxivm-cult-allison-mack.html\nhttps://www.nytimes.com/2019/05/09/nyregion/nxivm-cult-trial.html\nhttps://www.nytimes.com/2021/09/07/nyregion/nancy-salzman-nxivm-sex-cult.html\nhttps://www.nytimes.com/2019/06/19/nyregion/nxivm-trial-raniere.html\nhttps://www.theguardian.com/us-news/2021/jun/30/smallville-actor-allison-mack-nxivm-cult\nhttps://www.latimes.com/entertainment-arts/tv/story/2021-09-15/nxvim-actress-allison-mack-smallville-reports-to-prison-early\nhttps://www.nytimes.com/article/nxivm-timeline.html\nhttps://variety.com/2021/tv/news/allison-mack-nxivm-read-full-statement-1235006044/\n\nallison mack allison mack arrested nxivm allison mack nxivm allison mack cult allison mack interview allison mack 2022 allison mack smallville smallville allison mack documentary allison mack inside of you the vow nicki clyne sarah edmondson inside of you podcast the lost women of nxivm kristen kreuk kristen kreuk nxivm kristen kreuk inside of you ash silver coffee and cults mark vincente allison mack prison allison mack jail nxivm executive success programme nancy saltzman lauren saltzman clare bronfman sara bronfman seagrams heiress smallvile CW disney channel star cult cult leader coffee and cults \n\n#AllisonMack #NXIVM #KeithRaniere",
      "release": "2022-04-26T16:13:44Z",
      "duration": "01:00:15",
      "explicit": false,
      "youTubeId": "ysualet0CCM",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ysualet0CCM"
      }
    }
  ]
}