{
  "id": "7a967734-9a65-473c-92c9-5adff51bbf29",
  "name": "Color Of Success Podcast",
  "spotifyId": "5FYXLu0fKGJIR6G3uZRmAT",
  "appleId": 1515436847,
  "youTubeChannelId": "UCiaS5_HScsbFOJE5lYrEsxw",
  "episodes": [
    {
      "id": "7c033b3e-e2b6-41a4-ac8b-00d781081d67",
      "title": "Mental Health \u0026 Journalism, \u0026 the Hidden World of Wellness Cults with  Journalist, Ellen Huet 🎙",
      "description": "What happens when a journalist spends years uncovering the truth behind a controversial wellness movement? And how does reporting on trauma and human behavior impact a reporter’s own mental health?\n\nIn this powerful and eye-opening conversation, Dr. Stephanie J. Wong sits down with investigative journalist Ellen Huet to explore the emotional, cultural, and psychological layers behind her reporting on OneTaste, the company famous for promoting orgasmic meditation—and infamous for the allegations and criminal charges that followed.\n\n🔥 In This Episode, We Cover:\n\nThe mental health challenges journalists face while reporting high-stakes, emotionally charged stories\n\nEllen’s career progression, including Tech journalism—and how it led her to report on OneTaste\n\nThe rise and fall of OneTaste: its origins, promises, red flags, and the darker truths uncovered\n\nWhy people join groups that later get labeled as cults—and why it can be so hard to leave\n\nThe emotional toll of interviewing survivors and the surprising overlap between investigative reporting and trauma therapy\n\nA sneak peek into Ellen’s new book, Empire of Orgasm: Sex, Power, and the Downfall of a Wellness Cult, and its broader look at social psychology, belonging, and human behavior\n\nIf you’re fascinated by true crime, cult psychology, mental health, or the behind-the-scenes world of investigative journalism, this episode is for you. It’s raw, insightful, and full of moments that will stay with you long after you’ve finished watching.\n\n👍 If you enjoy deep conversations like this, don’t forget to LIKE the video!\n📝 Tell us in the comments: What surprised you most about Ellen’s investigation?\n🔔 SUBSCRIBE and hit the bell so you never miss upcoming episodes on mental health, culture, and the stories that shape our world.\n\nThanks for watching and supporting the channel—your engagement helps us bring more important conversations to light. 💛\n\n#MentalHealth #Journalism #InvestigativeJournalism #CultSurvivors #WellnessCulture #OneTaste #OrgasmicMeditation #TraumaInformed #ReporterLife #TechJournalism #TrueCrimeCommunity #PsychologyPodcast #CultsAndCulture #EmotionalWellbeing #EmpireOfOrgasm #HealingJourney #MindBodyCulture #PodcastInterview #StorytellingMatters #subscribenow \n===========================================================\nTo purchase Ellen\u0027s: https://www.amazon.com/Empire-Orgasm-Power-Downfall-Wellness/dp/0374604193\n==========================================================\nFor more mental health and entertainment content,  \n\nFollow us:\n\nhttps://www.instagram.com/color_of_success/\n\nhttps://www.facebook.com/colorofsuccess\n\nhttps://www.tiktok.com/@colorofsuccesspodcast\n\nSubscribe to our YT channel: https://www.youtube.com/channel/UCiaS5_HScsbFOJE5lYrEsxw\n\nTo purchase Dr. Wong\u0027s book: Cancel the Filter: Realities of a Psychologist, Podcaster, and Mother of Color",
      "release": "2025-12-15T17:01:41Z",
      "duration": "00:34:38",
      "explicit": true,
      "spotifyId": "4Yw9WMibc9AtiAreqTXTD6",
      "appleId": 1000741397720,
      "youTubeId": "zSCraERyU3o",
      "subjects": [
        "Onetaste",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Yw9WMibc9AtiAreqTXTD6",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-navigating-the-complexities-of/id1515436847?i=1000741397720",
        "youtube": "https://www.youtube.com/watch?v=zSCraERyU3o"
      }
    }
  ]
}