{
  "id": "0b583ef0-e9ab-4b55-aef5-620775494956",
  "name": "Comedy Saved Me",
  "spotifyId": "2dTFIjk6wSXf5hwgREjwLn",
  "appleId": 1816839769,
  "episodes": [
    {
      "id": "f30c64df-d01a-48cc-b06b-5d6a2e45f6e1",
      "title": "Craig Shoemaker: How the Lovemaster battled Depression, Addiction and Found Salvation Through Laughter: Comedy Saved Me Replay",
      "description": "Comedy Legend Craig Shoemaker Opens Up About Depression, Addiction \u0026 Finding His Voice | Comedy Saved Me Join host Lynn Hoffman for an unforgettable conversation with comedy icon Craig Shoemaker, the comedic genius behind “The Lovemaster” character and one of stand-up’s most versatile performers. In this deeply personal replay episode, Craig reveals how comedy literally saved his life during his darkest battles with depression and addiction. From his early days struggling to find his comedic voice to becoming a headlining performer who’s graced stages from Carnegie Hall to Las Vegas showrooms, Craig shares the raw truth about the demons behind the laughter. He discusses his journey through multiple rehab stints, the loss that nearly destroyed him, and how he channeled pain into performance art that resonates with millions. Craig opens up about: ∙ How childhood trauma shaped his comedy and his coping mechanisms ∙ The turning point that forced him to confront his addictions ∙ Creating “The Lovemaster” character as both comedy gold and therapeutic outlet ∙ Navigating the comedy club circuit while battling mental health challenges ∙ His philosophy on using humor to heal and connect with audiences ∙ Advice for aspiring comedians struggling with their own inner battles Whether you’re a comedy fan, someone facing similar struggles, or simply love authentic conversations about the human experience, this episode delivers both profound insights and plenty of laughs. Craig Shoemaker’s story proves that sometimes the funniest people carry the heaviest burdens—and that comedy can be the ultimate form of salvation. Subscribe to Comedy Saved Me for more intimate conversations with comedy legends about how laughter became their lifeline. See omnystudio.com/listener for privacy information. See omnystudio.com/listener for privacy information.",
      "release": "2026-01-12T05:00:00Z",
      "duration": "00:52:41.3120000",
      "explicit": false,
      "spotifyId": "7aWEbXMGeiWQhWXRtZpvZ1",
      "appleId": 1000744756640,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7aWEbXMGeiWQhWXRtZpvZ1",
        "apple": "https://podcasts.apple.com/podcast/craig-shoemaker-how-the-lovemaster-battled-depression/id1816839769?i=1000744756640"
      }
    }
  ]
}