{
  "_ts": 0,
  "id": "94dbd2eb-1fa3-4e12-b055-b5f697ba3da8",
  "name": "Comet Cult Film Club",
  "youTubeChannelId": "UCtpiCm_DlVVmx30sUC3Awhg",
  "episodes": [
    {
      "id": "ca46cfaf-7f24-4074-b2e6-d4539c2d63ce",
      "title": "LAW ENFORCEMENT GUIDE TO SATANIC CULTS (1994) FULL TRAINING VIDEO Satanic Panic Era Police Film!",
      "description": "## LAW ENFORCEMENT GUIDE TO SATANIC CULTS (1994) FULL TRAINING VIDEO | Notorious Satanic Panic Era Police Training Film!\n\nExperience the infamous \u0022Law Enforcement Guide to Satanic Cults\u0022 (1994) - a remarkable time capsule from the height of America\u0027s Satanic Panic when police departments across the country were trained to identify supposed occult criminal activity! Watch as \u0022experts\u0022 present questionable evidence and dubious theories about satanic cult activities to law enforcement officers during this controversial period of American history.\n\n🔍 This historical artifact of moral panic features:\n- Narration by a police officer claiming expertise in occult crime investigation\n- Outdated and largely discredited claims about widespread satanic ritual abuse\n- Demonstrations of supposed satanic symbols, rituals, and artifacts\n- Interviews with self-proclaimed occult crime specialists\n- Dramatic reenactments of alleged satanic ceremonies and crime scenes\n- A fascinating glimpse into the societal fears that gripped 1980s-90s America\n\n⚖️ Watch the COMPLETE TRAINING FILM that was actually shown to police departments, presenting ordinary teenage behaviors, heavy metal music, and fantasy role-playing games as potential evidence of satanic involvement. This unintentionally revealing documentary showcases how moral panic influenced law enforcement training and led to numerous questionable investigations during this era.\n\nViewed today, this training video serves as an important historical document of a period when unfounded fears of organized satanic activity led to real criminal investigations, prosecutions, and even convictions that were later overturned when the claims of widespread ritual abuse were debunked by careful research and investigation.\n\n#SatanicPanic #LawEnforcementTraining #OccultCrimeInvestigation #90sPoliceVideo #MoralPanic #ControversialTraining #RitualAbuseClaims #CriminalJusticeHistory #DiscreditedTheories #HistoricalDocument #PublicDomainEducational\n\nKeywords: Law Enforcement Guide to Satanic Cults full video, police satanic training, occult crime investigation, 1994 police training film, satanic panic era, ritual crime investigation, debunked satanic theories, moral panic documentation, police occult specialists, satanic ritual abuse claims, law enforcement occult training, 90s satanic hysteria, controversial police methods, historical moral panic, ritual crime unit, heavy metal panic, role playing games controversy, backwards masking claims",
      "release": "2025-03-14T00:30:43Z",
      "duration": "01:13:45",
      "explicit": false,
      "youTubeId": "lLXyQ0rCz9E",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lLXyQ0rCz9E"
      }
    }
  ]
}