{
  "id": "85ed75e2-5b3e-47c1-b4b2-1a177bc1fd5b",
  "name": "COMMONS",
  "spotifyId": "6AdcP6OxWWUsNlVv8YqlZm",
  "appleId": 983702127,
  "episodes": [
    {
      "id": "01ffc325-4ada-4c28-bbc7-e8659131bf72",
      "title": "CULTS 4 - The Cult Wars",
      "description": "An explosion of new spiritual movements in the 1970s led to the creation of an entirely novel academic field. But right from the beginning, the discipline was riven asunder.The Cult Wars have been raging for decades. They’re fought not only in academic journals and conference seminars, but in the press, the courts and in legislative assemblies. And their battles continue to have enormous consequences.Featured in this episode: Michael Kropveld, Stephen A. Kent, Susan J. PalmerTo learn more:“Caught Up in the Cult Wars: Confessions of a New Religious Movement Researcher” by Susan J. Palmer in University of Toronto Press“Life after Doomsday: Tracking cult activity from a Montreal storage locker” by Simon Lewson in The WalrusMisunderstanding Cults: Searching for Objectivity in a Controversial Field edited by Benjamin Zablocki \u0026 Thomas RobbinsCredits: Arshy Mann (Host and Producer), Jordan Cornish (Producer), Noor Azrieh (Producer), Annette Ejiofor (Managing Editor), Karyn Pugliese (Editor-in-Chief) Additional music from Audio NetworkSponsors: OxioIf you value this podcast, Support us! You’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on merch, tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis, you’ll be keeping our work free and accessible to everybody. You can listen ad-free on Amazon Music—included with Prime. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-11-08T08:37:12Z",
      "duration": "00:46:39.7250000",
      "explicit": false,
      "spotifyId": "1GfJwxi45n9gFzasIywyuA",
      "appleId": 1000633314884,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1GfJwxi45n9gFzasIywyuA",
        "apple": "https://podcasts.apple.com/podcast/cults-4-the-cult-wars/id983702127?i=1000633314884"
      }
    },
    {
      "id": "a32f6a94-8c6e-438e-a857-cc323b4a7136",
      "title": "CULTS 3 - MKUltra",
      "description": "In the 1960s and 70s, there was a fear that cult leaders were brainwashing young people into joining their new, strange movements. But is it even possible to “brainwash” anyone?At a psychiatric hospital in Montreal, one mad scientist, with the help of the CIA, tried to find out.Featured in this episode: Alison Steel, Lisa EllenwoodTo learn more:Brainwashed by Michelle Shephard, Lisa Ellenwood \u0026 Chris Oke on CBC PodcastsThe Search for the Manchurian Candidate: The CIA and Mind Control by John MarksFather, Son and CIA by Harvey WeinsteinMK Ultra: CIA mind control program in Canada by CBC’s The Fifth Estate“Federal government quietly compensates daughter of brainwashing experiments victim” by Elizabeth Thompson in CBC NewsCredits: Arshy Mann (Host and Producer), Jordan Cornish (Producer), Noor Azrieh (Producer), Annette Ejiofor (Managing Editor), Karyn Pugliese (Editor-in-Chief) Additional music from Audio NetworkSponsors: Douglas, OxioIf you value this podcast, Support us! You’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on merch, tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis, you’ll be keeping our work free and accessible to everybody. You can listen ad-free on Amazon Music—included with Prime. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-11-01T07:25:00Z",
      "duration": "00:47:12.9010000",
      "explicit": false,
      "spotifyId": "0LJNbjPCWWpfgcTrDxkj6J",
      "appleId": 1000633323085,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0LJNbjPCWWpfgcTrDxkj6J",
        "apple": "https://podcasts.apple.com/podcast/cults-3-mkultra/id983702127?i=1000633323085"
      }
    },
    {
      "id": "18c6f6ac-a292-4a68-a8ff-06fc9b6b6286",
      "title": "CULTS 2 - Brother XII",
      "description": "The story of Brother XII still fascinates and even frightens some people in and around Nanaimo.He’s often called the Devil of De Courcy Island for good reason.Brother XII prophesied about the coming apocalypse. But instead, his story would presage something different. He was a forerunner of the strange, new religions that would sweep over the western world.Featured in this episode: Bill Miner, Justine BrownTo learn more:Brother XII: The Strange Odyssey of a 20th Century Prophet by John OliphantAll Possible Worlds: Utopian Experiments in British Columbia by Justine BrownCredits: Arshy Mann (Host and Producer), Jordan Cornish (Producer), Noor Azrieh (Producer), Annette Ejiofor (Managing Editor), Karyn Pugliese (Editor-in-Chief) Additional music from Audio NetworkSponsors: Canva, Douglas If you value this podcast, Support us! You’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on merch, tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis, you’ll be keeping our work free and accessible to everybody. You can listen ad-free on Amazon Music—included with Prime.risis, you’ll be keeping our work free and accessible to everybody. You can listen ad-free on Amazon Music—included with Prime. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-10-25T07:34:24Z",
      "duration": "00:34:15.9150000",
      "explicit": false,
      "spotifyId": "5tZMa2MEkIHnTYd1MOIP3A",
      "appleId": 1000632520774,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tZMa2MEkIHnTYd1MOIP3A",
        "apple": "https://podcasts.apple.com/podcast/cults-2-brother-xii/id983702127?i=1000632520774"
      }
    },
    {
      "id": "4c78286f-4f08-429f-9ae1-6fe0d549c370",
      "title": "CULTS 1 - Speak in Tongues",
      "description": "As organized religion declines in countries like Canada, we’ve experienced an explosion of what some call religious movements and what others call cults.The idea of cults has become an omnipresent part of our discourse. But what even is a cult? And why have we become so intrigued by these groups?And the language of cults has moved beyond just religion into so many different spheres — everything from fitness, to politics, to work. Featured in this episode: Harold Henning, Amanda MontellTo learn more:Cultish: The Language of Fanaticism by Amanda MontellSounds Like A CultCredits: Arshy Mann (Host and Producer), Jordan Cornish (Producer), Noor Azrieh (Producer), Annette Ejiofor (Managing Editor), Karyn Pugliese (Editor in Cheif)Additional music from Audio NetworkSponsors: Rotman, Douglas If you value this podcast, Support us! You’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on merch, tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis, you’ll be keeping our work free and accessible to everybody. You can listen ad-free on Amazon Music—included with Prime. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-10-18T00:00:00",
      "duration": "00:33:17.1390000",
      "explicit": false,
      "spotifyId": "4Y7T0FnIl2BUSbTegUXJ7w",
      "appleId": 1000630900396,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Y7T0FnIl2BUSbTegUXJ7w",
        "apple": "https://podcasts.apple.com/podcast/cults-1-speak-in-tongues/id983702127?i=1000630900396"
      }
    }
  ]
}