{
  "id": "85ed75e2-5b3e-47c1-b4b2-1a177bc1fd5b",
  "name": "COMMONS",
  "spotifyId": "6AdcP6OxWWUsNlVv8YqlZm",
  "appleId": 983702127,
  "episodes": [
    {
      "id": "4c78286f-4f08-429f-9ae1-6fe0d549c370",
      "title": "CULTS 1 - Speak in Tongues",
      "description": "As organized religion declines in countries like Canada, we’ve experienced an explosion of what some call religious movements and what others call cults.The idea of cults has become an omnipresent part of our discourse. But what even is a cult? And why have we become so intrigued by these groups?And the language of cults has moved beyond just religion into so many different spheres — everything from fitness, to politics, to work. Featured in this episode: Harold Henning, Amanda MontellTo learn more:Cultish: The Language of Fanaticism by Amanda MontellSounds Like A CultCredits: Arshy Mann (Host and Producer), Jordan Cornish (Producer), Noor Azrieh (Producer), Annette Ejiofor (Managing Editor), Karyn Pugliese (Editor in Cheif)Additional music from Audio NetworkSponsors: Rotman, Douglas If you value this podcast, Support us! You’ll get premium access to all our shows ad free, including early releases and bonus content. You’ll also get our exclusive newsletter, discounts on merch, tickets to our live and virtual events, and more than anything, you’ll be a part of the solution to Canada’s journalism crisis, you’ll be keeping our work free and accessible to everybody. You can listen ad-free on Amazon Music—included with Prime. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-10-18T00:00:00",
      "duration": "00:33:17.1390000",
      "explicit": false,
      "spotifyId": "4Y7T0FnIl2BUSbTegUXJ7w",
      "appleId": 1000630900396,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Y7T0FnIl2BUSbTegUXJ7w",
        "apple": "https://podcasts.apple.com/podcast/cults-1-speak-in-tongues/id983702127?i=1000630900396"
      }
    }
  ]
}