{
  "_ts": 0,
  "id": "16b1b6e6-a5f4-4983-bc1c-5e5814d480dd",
  "name": "Compassiviste Dialogues",
  "spotifyId": "6qt8cYHeIcDmDV8zPKNxMw",
  "appleId": 1735926709,
  "youTubeChannelId": "UCfxZjnXOSUXeaQkyiPQXgyQ",
  "episodes": [
    {
      "id": "6e0486d8-8149-42b8-a370-47ac69153b49",
      "title": "A Survivor’s Journey from Exploitation to Freedom – Cults Exposed  w/Daniella Mestyanek Young",
      "description": "Today, we’re honored to share the incredible journey of Daniella Mestyanek Young.\n\nRaised in the notorious Children of God cult, Daniella escaped and transformed her life, ultimately becoming a U.S. Army captain and intelligence officer on the frontlines in Afghanistan. Her bestselling memoir, praised for its powerful storytelling, has been compared to Educated and The Glass Castle.\n\nIn this episode, we’ll dive into Daniella’s path to success, her insights into the complexities of group behavior, and her work in leadership and organizational psychology. Daniella now shares her expertise as a TEDx speaker and Harvard graduate, exploring the fine line between culture and cults and the impact of powerful leaders on society.\n\nStay tuned as we discuss Daniella’s mission to educate, her work on breaking free from the past, and the lessons she’s learned along the way. Let’s get started!\n\nABOUT GUEST:\n\nDaniella was born a third-generation member of the infamous Children of God religious cult, and grew up being trafficked around the world, before escaping that life and moving to America at age 15. She put herself through high school and graduated as college valedictorian before commissioning into the US Army as an intelligence officer. That’s where she really started to think about group behavior…and seeing it, well, everywhere.\n\nDaniella deployed twice to Afghanistan (2011, 2014) and became a member of one of the Army’s first Female Engagement teams (an experiment that put women into deliberate ground combat for the first time in Army history, and eventually led to the repeal of the sexist combat ban and the gender desegregation of the entire US military).\n\nShe is a proud daughter of the 101st, (that\u0027s the unit in Band of Brothers), a recipient of the Presidential Volunteer Service Award (from Obama, y\u0027all), and is currently pursuing a Master of Arts in Organizational Psychology at the Harvard Extension School (she focuses her research on group behavior, social norms, culture, extremism, leadership demagoguery and cults).\n\nKEY NOTES:\n\nThe Cult of Work: Is it Exploitation or Empowerment?\nThe Dream Sellers: How Manipulation Drives Modern Exploitation\nExploitation as a Profitable Model: The Business of Control\nA System of Justice for the Wealthy and Punishment for the Poor\nFrom Religious Zeal to Celebrity Worship: Why We Keep Chasing Illusions\n\nTIMESTAMPS:\n\n00:00 - Episode Trailer\n01:24 - Intro  \n03:16 - The Cult of Labor: Work or Exploitation?  \n11:55 - Selling the Dream: How Manipulation Fuels Modern Exploitation  \n17:14 - Exploitation as a Business Model  \n22:33 - Justice for the Rich, Punishment for the Poor: The Flawed System  \n28:39 - From Religion to Celebrity Culture: How We Keep Buying the Same Illusions  \n37:00 - How Societies Keep Women Fighting Each Other  \n43:47 - Why Instagram Is More Dangerous Than Nukes  \n47:47 - Feminism as a Path to a Sustainable Future  \n54:40 - Can the Publishing Industry Embrace Ethics Without Sacrificing Success?  \n01:04:20 - Healing or Hiding? The Truth Behind Overcoming Trauma  \n01:12:17 - Turning Pain Into Purpose: The Key to True Healing  \n01:19:56 - How to Turn Pain into Power  \n01:28:35 - The Dangers of Blind Faith: How to Avoid Cult Mentalities  \n01:37:23 - Rebuilding Life After Wealth  \n01:44:23 - Outro  \n\nTHINGS MENTIONED IN THE PODCAST:\n\nDaniella\u0027s Website: https://uncultureyourself.com/\nDaniella\u0027s Facebook: https://www.facebook.com/DMestyanekYoung\nDaniella\u0027s Instagram: https://www.instagram.com/daniellamyoung_/\nDaniella\u0027s Youtube:  @KnittingCultLady  \n\nTO LEARN MORE AND STAY CONNECTED:\n\n🌐 Visit our website: https://compassivistedialogues.com/\n🎧 Listen on Spotify: https://open.spotify.com/show/6qt8cYHeIcDmDV8zPKNxMw\n🎧 Listen on Apple Podcast: https://podcasts.apple.com/us/podcast/compassiviste-dialogues/id1735926709\n\nCONNECT WITH US ON SOCIAL MEDIA:\n\nFacebook: https://www.facebook.com/people/Compassiviste/61555898333856/\nInstagram: https://www.instagram.com/compassiviste/\nTiktok: https://www.tiktok.com/@compassiviste\nTwitter: https://twitter.com/compassiviste\nLinkedIN: https://www.linkedin.com/company/compassiviste/\n\nTune in, follow, and embark on this insightful journey with us. Your vision\u0027s transformation begins now. 🚀🌟",
      "release": "2025-05-01T11:21:00Z",
      "duration": "01:47:45",
      "explicit": false,
      "spotifyId": "2OLcoQ30P98l08VopAEKa1",
      "appleId": 1000705681185,
      "youTubeId": "DmC0gRtSEeM",
      "subjects": [
        "Children Of God",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2OLcoQ30P98l08VopAEKa1",
        "apple": "https://podcasts.apple.com/podcast/a-survivors-journey-from-exploitation-to-freedom/id1735926709?i=1000705681185",
        "youtube": "https://www.youtube.com/watch?v=DmC0gRtSEeM"
      }
    }
  ]
}