{
  "id": "dadc55e1-a37d-4f71-b4e2-a468281fe3c5",
  "name": "Transforming Trauma",
  "spotifyId": "3bdIUoZPpObByi39pn96sN",
  "appleId": 1496190024,
  "youTubeChannelId": "UC9E0sKbaQZicSY8XtaPBICQ",
  "episodes": [
    {
      "id": "20453306-5c58-433c-9936-b8a41083e686",
      "title": "How Activism Helps Us Recover From Trauma With Dr. Judith Herman",
      "description": "Chances are, you may be familiar with Dr. Judith Lewis Herman, the legendary psychiatrist, researcher, teacher, and author. Five decades into her esteemed career, Dr. Herman continues to produce innovative work in sexual trauma and Complex PTSD. But you might not know Judith Herman, the daughter, mother, grandmother, and activist. On this episode of Transforming Trauma, Emily Ruth is honored to welcome back Dr. Judith Lewis Herman for an illuminating conversation on the life experiences and enduring connections that have shaped her public and private life. The pair also explores the positive impact that activism and affiliation with others can have on those who’ve experienced trauma, and why adopting an active coping strategy is one of the best predictors of recovery. About Judith Lewis Herman, M.D.: Judith Lewis Herman, M.D., is Professor of Psychiatry (part time) at Harvard Medical School. For thirty years, until she retired, she was Director of Training at the Victims of Violence Program at The Cambridge Hospital, Cambridge, MA. Dr. Herman is the author of the award-winning books: Father-Daughter Incest (Harvard University Press, 1981) and Trauma and Recovery (Basic Books, 1992). To read the full show notes and discover more resources, visit https://complextraumatrainingcenter.com/transformingtrauma SPACE: SPACE is an Inner Development Program of Support and Self-Discovery for Therapists on the Personal, Interpersonal, and Transpersonal Levels offered by the Complex Trauma Training Center. This experiential learning program offers an immersive group experience designed to cultivate space for self-care, community support, and deepening vitality in our professional role as therapists. Learn more about how to join. *** The Complex Trauma Training Center: https://complextraumatrainingcenter.com View upcoming trainings: https://complextraumatrainingcenter.com/schedule/ *** The Complex Trauma Training Center (CTTC) is a professional organization providing clinical training, education, consultation, and mentorship for psychotherapists and mental health professionals working with individuals and communities impacted by Adverse Childhood Experiences (ACEs) and Complex Trauma (C-PTSD). CTTC provides NARM® Therapist and NARM® Master Therapist Training programs, as well as ongoing monthly groups in support of those learning NARM. CTTC offers a depth-oriented professional community for those seeking a supportive network of therapists focused on three levels of shared human experience: personal, interpersonal \u0026 transpersonal. The Transforming Trauma podcast embodies the spirit of CTTC – best described by its three keywords: depth, connection, and heart - and offers guidance to those interested in effective, transformational trauma-informed care. We want to connect with you! Facebook @complextraumatrainingcenter Instagram @cttc_training LinkedIn YouTube",
      "release": "2025-09-24T07:00:00Z",
      "duration": "00:35:16.3130000",
      "explicit": false,
      "spotifyId": "7KlzjFAA1RNaEVaYTTITs8",
      "appleId": 1000728182303,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KlzjFAA1RNaEVaYTTITs8",
        "apple": "https://podcasts.apple.com/podcast/how-activism-helps-us-recover-from-trauma-with-dr/id1496190024?i=1000728182303"
      }
    },
    {
      "id": "91885b1f-669e-40dc-a6ea-7485cce87969",
      "title": "From the Cult of NXIVM to \u0022The Narcissist’s Playbook\u0022 with Filmmaker Mark Vicente",
      "description": "Narcissists have a canny ability to repackage traits like arrogance, self-importance, and a lack of empathy and sell them as charm, intelligence, or sensitivity. This “playbook” of calculated behaviors allows them to avoid detection and continue manipulating close relations or entire groups.\r\n\r\n On this episode of Transforming Trauma, CTTC Director and NARM® Senior Trainer Brad Kammer welcomes Mark Vicente, the award-winning writer, director, podcaster, and producer, to discuss the personal awakening that eventually prompted him to leave the NXIVM cult and contribute to HBO’s documentary series The Vow and create the feature-length documentary The Narcissist\u0027s Playbook (currently in production). The pair delve into the role that narcissism plays in constructing cults and other high-control groups, as well as explore common narcissistic traits that impact individuals, groups, and societies. \r\n\r\n About Mark Vicente:\r\n\r\n Mark Vicente is an author, speaker, and award-winning writer/director/producer from Johannesburg, South Africa. Growing up amid the atrocities in South Africa, he began questioning fundamental beliefs about human behavior, morality, cosmology, existentialism and mysticism at an early age. Unifying his love for science, philosophy, and film, Mark’s vision took shape with “What the BLEEP Do We Know!?”. He later released “Encender el Corazón”, a powerful film about Mexico’s kidnapping crisis. While the film touched many people deeply, it was by association supporting the criminal enterprise NXIVM. Mark withdrew the film and, alongside fellow whistleblowers, exposed the group, resulting in multiple arrests and prosecutions. His journey is chronicled in HBO’s 15-part documentary series “The Vow”. \r\n\r\n Mark has since focused on exposing the manipulative dynamics of high-control groups. He’s currently finishing “The Narcissist’s Playbook”, a feature documentary on narcissism, told through the unflinching accounts of four self-aware malignant narcissists, alongside insights from survivors, scientists, and mental health experts, filmed across seven countries.\r\n\r\n Learn More:\r\n\r\n Website\r\n\r\n Instagram\r\n\r\n Podcast\r\n\r\n To read the full show notes and discover more resources, visit https://complextraumatrainingcenter.com/transformingtrauma\r\n\r\n SPACE:\r\n\r\n SPACE is an Inner Development Program of Support and Self-Discovery for Therapists on the Personal, Interpersonal, and Transpersonal Levels offered by the Complex Trauma Training Center. This experiential learning program offers an immersive group experience designed to cultivate space for self-care, community support, and deepening vitality in our professional role as therapists. Learn more about how to join.\r\n\r\n ***\r\n\r\n The Complex Trauma Training Center:\r\n\r\n https://complextraumatrainingcenter.com\r\n\r\n View upcoming trainings:\r\n\r\n https://complextraumatrainingcenter.com/schedule/\r\n\r\n The Complex Trauma Training Center (CTTC) is a professional organization providing clinical training, education, consultation, and mentorship for psychotherapists and mental health professionals working with individuals and communities impacted by Adverse Childhood Experiences (ACEs) and Complex Trauma (C-PTSD).\r\n\r\n CTTC provides NARM® Therapist and NARM® Master Therapist Training programs, as well as ongoing monthly groups in support of those learning NARM. CTTC offers a depth-oriented professional community for those seeking a supportive network of therapists focused on three levels of shared human experience: personal, interpersonal \u0026amp; transpersonal. \r\n\r\n The Transforming Trauma podcast embodies the spirit of CTTC – best described by its three keywords: depth, connection, and heart - and offers guidance to those interested in effective, transformational trauma-informed care.\r\n\r\n We want to connect with you!\r\n\r\n Facebook @complextraumatrainingcenter\r\n\r\n Instagram @complextraumatrainingcenter\r\n\r\n LinkedIn\r\n\r\n YouTube",
      "release": "2025-04-23T08:17:49Z",
      "duration": "00:52:07",
      "explicit": false,
      "spotifyId": "4nLv131ujohP8iGs7M7kTP",
      "appleId": 1000704572909,
      "youTubeId": "z6pHBJ-aE4M",
      "subjects": [
        "NXIVM",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4nLv131ujohP8iGs7M7kTP",
        "apple": "https://podcasts.apple.com/podcast/from-the-cult-of-nxivm-to-the-narcissists/id1496190024?i=1000704572909",
        "youtube": "https://www.youtube.com/watch?v=z6pHBJ-aE4M"
      }
    },
    {
      "id": "1d99a2e2-3592-47df-a286-356f10033de7",
      "title": "What Good Psychotherapy Looks Like With Dr. Jonathan Shedler",
      "description": "On this episode of Transforming Trauma, host Emily Ruth welcomes back Dr. Jonathan Shedler, renowned psychologist, author, consultant, researcher, and clinical educator. In their conversation, they are delving deeper into the elements that make up good psychotherapy and the importance of connection between therapist and client. Dr. Shedler and Emily Ruth also explore critical flaws in the Diagnostic and Statistical Manual of Mental Disorders (DSM), how modern social subcultures provide a disturbing camouflage for disassociation, and the three pillars of an effective therapeutic working alliance.\n About Jonathan Shedler:\n Jonathan Shedler, PhD, is an American psychologist known internationally as an author, consultant, researcher, and clinical educator. He is best known for his article The Efficacy of Psychodynamic Psychotherapy, which won worldwide acclaim for firmly establishing psychoanalytic therapy as an evidence-based treatment.\n Dr. Shedler’s research and writing are shaping contemporary views of personality styles and their treatment. He is author of over one hundred scientific and scholarly articles, creator of the Shedler-Westen Assessment Procedure (SWAP) for personality diagnosis and clinical case formulation, and co-author of the Psychodynamic Diagnostic Manual (PDM-2 and forthcoming PDM-3). He has more than 25 years of experience teaching and supervising psychologists, psychiatrists, and psychoanalysts.\n Dr. Shedler lectures internationally, leads workshops for professional audiences, consults to U.S. and international government agencies, and provides expert clinical case consultation to mental health professionals worldwide. He is a Clinical Professor in the Department of Psychiatry and Behavioral Sciences at the University of California, San Francisco (UCSF) and a faculty member at the San Francisco Center for Psychoanalysis.\n Learn More:\n Website\n To read the full show notes and discover more resources, visit https://complextraumatrainingcenter.com/transformingtrauma\n ***\n The Complex Trauma Training Center:\n https://complextraumatrainingcenter.com\n View upcoming trainings:\n https://complextraumatrainingcenter.com/schedule/\n SPACE:\n SPACE is an Inner Development Program of Support and Self-Discovery for Therapists on the Personal, Interpersonal, and Transpersonal Levels offered by the Complex Trauma Training Center. This experiential learning program offers an immersive group experience designed to cultivate space for self-care, community support, and deepening vitality in our professional role as therapists. Learn more about how to join.\n The Complex Trauma Training Center (CTTC) is a professional organization providing clinical training, education, consultation, and mentorship for psychotherapists and mental health professionals working with individuals and communities impacted by Adverse Childhood Experiences (ACEs) and Complex Trauma (C-PTSD).\n CTTC provides NARM® Therapist and NARM® Master Therapist Training programs, as well as ongoing monthly groups in support of those learning NARM. CTTC offers a depth-oriented professional community for those seeking a supportive network of therapists focused on three levels of shared human experience: personal, interpersonal \u0026 transpersonal. \n The Transforming Trauma podcast embodies the spirit of CTTC – best described by its three keywords: depth, connection, and heart - and offers guidance to those interested in effective, transformational trauma-informed care.\n We want to connect with you!\n Facebook @complextraumatrainingcenter\n Instagram @complextraumatrainingcenter\n LinkedIn\n YouTube\n  \n  ",
      "release": "2024-09-11T07:00:00Z",
      "duration": "01:02:08",
      "explicit": false,
      "spotifyId": "180hRpEXlvXCi2TCq86VLd",
      "appleId": 1000669116676,
      "youTubeId": "5dwkxNRf6vg",
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/180hRpEXlvXCi2TCq86VLd",
        "apple": "https://podcasts.apple.com/podcast/what-good-psychotherapy-looks-like-with-dr-jonathan/id1496190024?i=1000669116676",
        "youtube": "https://www.youtube.com/watch?v=5dwkxNRf6vg"
      }
    },
    {
      "id": "ace64373-3cce-4359-9d5f-c2ce68e65ea8",
      "title": "Self-Acceptance in the Aftermath of Trauma Bonds with Dr. Nadine Macaluso",
      "description": "On this episode of Transforming Trauma, host Emily Ruth welcomes back trauma bond expert and author Nadine Macaluso, LMFT, Ph.D., to introduce her latest book, Run Like Hell, A Therapist’s Guide To Recognizing, Escaping, Healing From Trauma Bonds.\r\n\r\n The pair also discuss the markers of a trauma-bonded relationship and how to use NARM to address the complex PTSD that routinely develops as a result of these abusive unions. \r\n\r\n About Nadine Macaluso:\r\n\r\n At age twenty-two, Nadine Macaluso married Jordan Belfort, the nefarious stockbroker portrayed in the Hollywood blockbuster “The Wolf of Wall Street”. Their marriage began as a fairytale, but once they were bonded, Jordan’s “mask” began to slip, and acts of infidelity, narcissistic abuse, insatiable greed, and uncontrollable drug addiction became Nadine’s nightmare.\r\n\r\n The horrific relationship inspired Nadine to become a psychotherapist specializing in narcissistic abuse, trauma bonds, and Complex-PTSD. Her private practice quickly flooded with clients, predominantly women, recounting an all-too-familiar story of abuse with a pathological partner. Perhaps this scenario resonates with you.\r\n\r\n In Run Like Hell, Nadine brings you her personal experience and years of expertise to explain the mental health of the narcissistic pathological lover, the traits of people who are the perfect “victims” of these PLs, how you can leave a trauma bond safely, and how you can heal.\r\n\r\n Learn More: \r\n\r\n Website\r\n\r\n Instagram\r\n\r\n TikTok\r\n\r\n YouTube\r\n\r\n Facebook\r\n\r\n To read the full show notes and discover more resources, visit https://complextraumatrainingcenter.com/transformingtrauma\r\n\r\n ***\r\n\r\n The Complex Trauma Training Center:\r\n\r\n https://complextraumatrainingcenter.com\r\n\r\n View upcoming trainings:\r\n\r\n https://complextraumatrainingcenter.com/schedule/\r\n\r\n The Complex Trauma Training Center (CTTC) is a professional organization providing clinical training, education, consultation, and mentorship for psychotherapists and mental health professionals working with individuals and communities impacted by Adverse Childhood Experiences (ACEs) and Complex Trauma (C-PTSD).\r\n\r\n CTTC provides NARM® Therapist and NARM® Master Therapist Training programs, as well as ongoing monthly groups in support of those learning NARM. CTTC offers a depth-oriented professional community for those seeking a supportive network of therapists focused on three levels of shared human experience: personal, interpersonal \u0026amp; transpersonal. \r\n\r\n The Transforming Trauma podcast embodies the spirit of CTTC – best described by its three keywords: depth, connection, and heart - and offers guidance to those interested in effective, transformational trauma-informed care.\r\n\r\n We want to connect with you!\r\n\r\n Facebook @complextraumatrainingcenter\r\n\r\n YouTube\r\n\r\n Instagram @cttc_training",
      "release": "2024-04-17T07:18:53Z",
      "duration": "00:51:46",
      "explicit": false,
      "spotifyId": "19hoWk9orm0O9HtgePPdkR",
      "appleId": 1000652705786,
      "youTubeId": "3oPSuSEEp94",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/19hoWk9orm0O9HtgePPdkR",
        "apple": "https://podcasts.apple.com/podcast/self-acceptance-in-the-aftermath-of-trauma-bonds/id1496190024?i=1000652705786",
        "youtube": "https://www.youtube.com/watch?v=3oPSuSEEp94"
      }
    },
    {
      "id": "b92e93d9-9491-4130-a06a-b96bf691c9de",
      "title": "Transforming Trauma Episode 123 Oppression, Religious Trauma \u0026 Pathway to Peace w/ Yasmine Mohammed",
      "description": "Candid conversations about religious trauma can feel uncomfortable, disloyal and even risky. However, human rights campaigner Yasmine Mohammed says now is the time to openly discuss the extremist nature of some religions and the trauma they cause for individuals, families, communities and nations.  Cutting through religious and cultural identifications is extremely challenging – and even potentially life-threatening – but Yasmine says that humanistic support can be an antidote to ongoing objectification and oppression.\n\nOn this episode of Transforming Trauma, NARM Senior Trainer Brad Kammer invites human rights campaigner Yasmine Mohammed to share her experiences growing up in a fundamentalist Islamic household, including her arranged marriage to a member of Al-Qaeda and her subsequent work as founder and president of Free Hearts Free Minds, an organization providing mental health support to free thinkers and members of the LGBTQ\u002B community who are unable to live authentically due to religious and societal persecution.\n\n“The religious trauma of people who grew up in Muslim majority communities is not distinct or unique from the religious trauma of people who grew up in fundamentalist Christian [or] Jewish communities,” Yasmine observes. Yet it’s widely considered taboo to address issues or enforce laws to protect folks suffering under extreme Islamic religious traditions.  Thus, it becomes very difficult to acknowledge and provide support for the extensive trauma that impacts so many people living within these oppressive systems.\n\nYasmine says Muslims face an additional burden that folks escaping other extreme fundamentalist traditions do not: the fraught cultural relativism of many Westerners who disregard Islamic religious extremism as a private community matter rather than publicly denouncing its harmful practices.\n\nFree Hearts Free Minds supports former Muslims at risk of persecution or execution (even in the US) for making the difficult choice to leave Islam. The organization provides 1:1 sessions, group conversations, and community connections via an online model that has reached hundreds of folks worldwide. Free Hearts\u0027 culturally competent, trauma-informed programming includes talk therapy, mindfulness techniques, and some CBT techniques to ensure that every participant has access to practices that validate their experiences and protect their new-found sense of self.  \n\nAs for what folks can do to support Muslims struggling with religious trauma, Yasmine urges Westerners – particularly Western liberals who see themselves as allies to cultural and religious minorities – to consider the harm they perpetuate in the name of social justice principles. “Please do not silence us because you think that it\u0027s racist or Islamophobic for us to speak up against our traumas and oppression.”  She firmly believes that human rights should remain the same no matter what religion or culture one belongs to and that we must challenge our own biases that lead us to betray people in need.\n\nYasmine found the courage to speak up and free herself, despite the risks from both religious leaders and Western “allies”, and is now trying to create a new coalition to advocate for those that cannot do so themselves.  \n\nTransforming Trauma is grateful to Yasmine for her courage and willingness to discuss her personal religious trauma, as well as the larger global risks of religious trauma. Her commitment to helping others thrive beyond religious extremism is an inspiration.  \n\nMENTIONED IN THIS EPISODE\n\nUnveiled: How Western Liberals Empower Radical Islam\n\nForgotten Feminists\n\nGUEST BIO\n\nHuman rights campaigner Yasmine Mohammed advocates for the rights of women living within Muslim-majority countries, as well as those who struggle under religious fundamentalism in general.\n\nShe is the founder and President of Free Hearts Free Minds, a nonprofit charity that provides mental health support for members of the LGBT community and freethinkers living within Muslim majority-countries – where both ‘crimes\u0027 can be punished by execution.  \n\nHer book, Unveiled, is a memoir/polemic that recalls her experiences growing up in a fundamentalist Islamic household and her arranged marriage to a member of Al-Qaeda. She is also the host of the podcast Forgotten Feminists– where she has conversations with inspirational women from restrictive religious backgrounds who have fought and who have overcome.​\n\nYasmine is a co-Founder and co-Director of the CLARITy Coalition. She is also on the Board of Directors for Humanist Global Charity and for Atheists for Liberty.\n\nWebsite\n\nFree Hearts Free Minds\n\nCLARITy Coalition",
      "release": "2024-01-20T20:21:20Z",
      "duration": "00:54:16",
      "explicit": false,
      "spotifyId": "2rqYmuDFXXDhYE65sYzIPt",
      "appleId": 1000641138572,
      "youTubeId": "hfPZkNOucss",
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rqYmuDFXXDhYE65sYzIPt",
        "apple": "https://podcasts.apple.com/podcast/a-pathway-to-peace-in-the-fight-against/id1496190024?i=1000641138572",
        "youtube": "https://www.youtube.com/watch?v=hfPZkNOucss"
      }
    },
    {
      "id": "720e0fd6-1618-4bf1-b8f8-a87f611b5471",
      "title": "Transforming Trauma Episode 118 Addressing Sexual Trauma w/ Dr. Judith Herman",
      "release": "2024-01-20T19:39:12Z",
      "duration": "00:40:01",
      "explicit": false,
      "spotifyId": "6aWt6tcw2wZt9BBG7zo7nS",
      "appleId": 1000636885735,
      "youTubeId": "AVJaE3FIGPI",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aWt6tcw2wZt9BBG7zo7nS",
        "apple": "https://podcasts.apple.com/podcast/listening-to-what-survivors-need-to-address-sexual/id1496190024?i=1000636885735",
        "youtube": "https://www.youtube.com/watch?v=AVJaE3FIGPI"
      }
    },
    {
      "id": "81c0c774-2127-4bc7-a24f-b85391cb704e",
      "title": "The Role of Spirituality in Complex Trauma Healing with Dr. Diane Poole Heller and Dr. Laurence Heller",
      "description": "Dr. Diane Poole Heller is an established expert in the field of trauma resolution, with extensive experience in spiritual exploration. Diane joins NARM Creator Dr. Laurence Heller for an evocative conversation about trauma and spirituality. Diane and Larry discuss how spiritual work has impacted their personal and professional lives, sharing the perspective on treating the whole person - mind, body and spirit. As internationally respected trauma experts, Diane and Larry also emphasize spiritual connection as a guide for practitioners to help themselves and their clients in the healing process. \n About Dr. Diane Poole Heller:\n Dr. Diane Poole Heller is an established expert in the field of trauma resolution, with 30 years of experience in spiritual exploration. Dr. Heller began her work with Peter Levine, founder of Somatic Experiencing, in 1989 and has served on the SE Trauma Institute teaching team since 1992. Diane has created a highly successful series of media resources, and as a dynamic speaker and teacher, Diane has been featured at international seminars and conferences. Diane is co-author of the book Crash Course as well as numerous articles in the field. Diane is also president of Trauma Solutions, a psychotherapy training organization.\n Learn More:\n Trauma Solutions Experiential Training for Clinicians\n Book - The Power of Attachment: How to Create Deep and Lasting Intimate Relationships\n  Book - Crash Course: A Self-Healing Guide to Auto Accident Trauma Recovery\n DARe Approach\n  To read the full show notes and discover more resources visit https://www.narmtraining.com/podcast\n  ***\n  NARM Training Institute\n https://www.NARMtraining.com\n View upcoming trainings:\n https://narmtraining.com/schedule\n Join the Inner Circle:\n https://narmtraining.com/online-learning/inner-circle\n Sign up for a free preview of The NARM Inner Circle Online Membership Program: https://www.narmtraining.com/freetrial\n ***\n The NARM Training Institute provides tools for transforming complex trauma through: in-person and online trainings for mental health care professionals; in-person and online workshops on complex trauma and how it interplays with areas like addiction, parenting, and cultural trauma; an online self-paced learning program, the NARM Inner Circle; and other trauma-informed learning resources.  \n We want to connect with you!\n Facebook @NARMtraining\n  YouTube\n Instagram @thenarmtraininginstitute",
      "release": "2023-01-25T08:00:00Z",
      "duration": "00:49:47",
      "explicit": false,
      "spotifyId": "1APWzAGkEP4O4vjNRilZmz",
      "appleId": 1000596448908,
      "youTubeId": "7c8wYauNYY0",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1APWzAGkEP4O4vjNRilZmz",
        "apple": "https://podcasts.apple.com/podcast/the-role-of-spirituality-in-complex-trauma-healing/id1496190024?i=1000596448908",
        "youtube": "https://www.youtube.com/watch?v=7c8wYauNYY0"
      }
    },
    {
      "id": "c3c84009-4d66-40da-91ec-8e8b2b1b0d28",
      "title": "Continuing the Conversation of Traumatic Narcissism and Recovery with Daniel Shaw",
      "description": "We’ve invited Daniel Shaw back to have a conversation with our host, Emily, to further discuss his work and his most recent book, Traumatic Narcissism and Recovery: Leaving the Prison of Shame and Fear.\n Daniel Shaw LCSW is an author, private practice psychoanalyst, faculty and supervisor at the National Institute for the Psychotherapies. He has provided professional counseling for former cultic group members, and their friends and loved ones since 1994. \n Daniel shares that he wants listeners to understand the ways that we become alienated from ourselves because of trauma and the internal antagonism between the part that wants to live, and the part that wants to shut down life. He also shares, “We within ourselves, have healing capacities, we have healing energy. That’s innate.” \n We hear from Daniel about his influences such as Sensorimotor Psychotherapy, Internal Family Systems, and EMDR, and how these models have supported his understanding of Trauma and the Self. “The benefit of subsequent training in trauma theories has been to understand that within us is always an energy trying to survive and trying to LIVE. We’re not just trying to survive. I think we’re trying to live,” he shares. \n Listen to our first conversation with Daniel on episode 28 of Transforming Trauma.\n  To read the full show notes and discover more resources visit http://www.narmtraining.com/podcast\n  ***\n  NARM Training Institute\n http://www.NARMtraining.com\n View upcoming trainings:\n https://narmtraining.com/schedule\n Join the Inner Circle:\n https://narmtraining.com/online-learning/inner-circle\n ***\n The NARM Training Institute provides tools for transforming complex trauma through: in-person and online trainings for mental health care professionals; in-person and online workshops on complex trauma and how it interplays with areas like addiction, parenting, and cultural trauma; an online self-paced learning program, the NARM Inner Circle; and other trauma-informed learning resources.  \n We want to connect with you!\n Facebook @NARMtraining\n Twitter @NARMtraining\n  YouTube\n  Instagram @thenarmtraininginstitute",
      "release": "2022-01-26T08:00:41Z",
      "duration": "00:51:34",
      "explicit": false,
      "spotifyId": "3BM53KUsJAoZ54tF9svzBm",
      "appleId": 1000549033634,
      "youTubeId": "cZ5C4zA05AQ",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3BM53KUsJAoZ54tF9svzBm",
        "apple": "https://podcasts.apple.com/podcast/continuing-the-conversation-of-traumatic/id1496190024?i=1000549033634",
        "youtube": "https://www.youtube.com/watch?v=cZ5C4zA05AQ"
      }
    },
    {
      "id": "eef87b1c-e695-4ddd-b029-fb65335417be",
      "title": "Traumatic Narcissism: Relational Systems of Subjugation with Daniel Shaw",
      "description": "Our host Sarah Buino is joined by therapist, social worker, and author Daniel Shaw to discuss his seminal book Traumatic Narcissism: Relational Systems of Subjugation.\n Daniel explores the theme of traumatic narcissism from a developmental and trauma-informed perspective. In his work, he connects the challenging symptoms and behaviors of clients diagnosed with Bipolar Disorder and Borderline Personality Disorder to the deeper understanding that they were raised in a highly traumatic environment by narcissistic caregivers.\n His underlying message for listeners is that, “It\u0027s important to understand what\u0027s going on in the mind of the narcissistic traumatizer in order to help patients free themselves from those relationships, in order for therapists to help the patient, and in order for the patients to help themselves.”\n Sarah and Daniel discuss the common thread in Daniel’s work and NARM. Much like in NARM, in which the therapists support clients to reconnect with their own agency, Daniel’s intention in working with people that have experienced narcissistic abuse is to help them “retrieve a faith in themselves that has been taken from them by the narcissistic abuser.”\n Sarah and Daniel close by discussing the role of the therapist, and how therapists can support the client in this process of self-reflection through being fully attuned and letting them know that we are “in their corner.” If the therapist is able to do this, the therapeutic relationship then becomes a place where the client can begin to feel this unconditional, fully present relationship from another, so that they can begin to feel it for themselves. \n About Daniel: \n www.danielshawlcsw.com\n Facebook: www.facebook.com/DanielShawLCSW\n Twitter: @NyackDanShaw\n Daniel Shaw is the author of Traumatic Narcissism: Relational Systems of Subjugation. He is faculty and supervisor in New York City at the National Institute for the Psychotherapies. He maintains his private psychotherapy practice In New York City and in Nyack, NY.\n  \n  To read the full show notes and discover more resources visit http://www.narmtraining.com/podcast\n ***\n NARM Level 2 Online Training begins January 2021.\n REGISTER NOW: https://narmtraining.com/transformingtrauma/level2/\n ***\n  NARM Training Institute\n http://www.NARMtraining.com\n ***\n The NARM Training Institute provides tools for transforming complex trauma through: in-person and online trainings for mental health care professionals; in-person and online workshops on complex trauma and how it interplays with areas like addiction, parenting, and cultural trauma; an online self-paced learning program, the NARM Inner Circle; and other trauma-informed learning resources.  \n ***\n We want to connect with you!\n Facebook @NARMtraining\n Twitter @NARMtraining\n  YouTube\n  Instagram @thenarmtraininginstitute",
      "release": "2020-11-11T10:00:00Z",
      "duration": "00:48:52",
      "explicit": false,
      "spotifyId": "1yvwdkhhyqUwToqS6HjoTX",
      "appleId": 1000498116717,
      "youTubeId": "TUPU4wnpeIc",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1yvwdkhhyqUwToqS6HjoTX",
        "apple": "https://podcasts.apple.com/podcast/traumatic-narcissism-relational-systems-of/id1496190024?i=1000498116717",
        "youtube": "https://www.youtube.com/watch?v=TUPU4wnpeIc"
      }
    },
    {
      "id": "947653d2-5abd-4daa-b60b-cee7133104f4",
      "title": "Healing the Wounds of Complex Religious Trauma with Jenny Winkel",
      "description": "“NARM is not a protocol, it\u0027s a relational model, and the reason why that\u0027s important to know is because humans are designed to heal in relationship.” ~ Jenny Winkel\n Our host Sarah Buino is joined by Jenny Winkel, MA, LMT, SEP, and NARM Practitioner based in Salt Lake City, Utah. Within her private practice, Jenny works with many forms of Complex Trauma (C-PTSD), with a particular interest in religious trauma. \n Throughout the episode, they discuss how the NeuroAffective Relational Model (NARM) can lead to a greater understanding of the complexities of religious trauma, a form of trauma that is often misunderstood, minimized, or dismissed. Jenny shares that NARM is so well-suited for healing religious trauma because of how well the model holds complexity. \n Her affinity for the NARM approach came out of her journey to heal her own complex and religious trauma.\n Sarah and Jenny discuss what fundamentalist religion looks like, and the impacts it often has on individuals. Through her own experiences, as well as her clients, Jenny shares how she has come to understand that fundamentalist communities and families can be sources of comfort, refuge, and love, while also being sources of terror and trauma. \n Jenny champions NARM for its ability to restore autonomy, agency, and reestablish the foundational relationship to Self. \u0022When you work with a wise and seasoned [NARM] therapist or practitioner, you can feel that... they\u0027re not taking sides,\u0022 she says. \u0022They\u0027re helping you navigate that interiority.\u0022 The episode concludes with a story from Jenny\u0027s practice, a beautiful example of the mind-body connection and the healing power of NARM in addressing complex attachment wounds.\n CONNECT WITH JENNY WINKEL\n Salt City Bodyworks\n ***\n NARM Online Basics Training begins November 13, 2020.\n REGISTER NOW\n Online NARM Basics Training: http://www.narmtraining.com/onlinebasics\n ***\n  NARM Training Institute\n http://www.NARMtraining.com\n ***\n The NARM Training Institute provides tools for transforming complex trauma through: in-person and online trainings for mental health care professionals; in-person and online workshops on complex trauma and how it interplays with areas like addiction, parenting, and cultural trauma; an online self-paced learning program, the NARM Inner Circle; and other trauma-informed learning resources.  \n For the full show notes including references, podcast episodes mentioned, and a quick glossary of terms, visit us at http://www.narmtraining.com/transformingtrauma\n ***\n We want to connect with you!\n Facebook @NARMtraining\n Twitter @NARMtraining\n  YouTube\n  Instagram @thenarmtraininginstitute",
      "release": "2020-08-05T09:00:00Z",
      "duration": "00:44:45",
      "explicit": false,
      "spotifyId": "5GyiEWNrHagp5pgog9KaJU",
      "appleId": 1000487171251,
      "youTubeId": "yN-buFLnltA",
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GyiEWNrHagp5pgog9KaJU",
        "apple": "https://podcasts.apple.com/podcast/healing-the-wounds-of-complex-religious-trauma/id1496190024?i=1000487171251",
        "youtube": "https://www.youtube.com/watch?v=yN-buFLnltA"
      }
    }
  ]
}