{
  "id": "0daafb97-253f-45e7-b2ab-b6255500d948",
  "name": "Conditioning to Consciousness",
  "spotifyId": "6DuGdSUc8GiABc3MRvL2XA",
  "appleId": 1828630860,
  "episodes": [
    {
      "id": "2faee4e4-fa53-46df-ab17-a87dc0cc0393",
      "title": "28. From Amish Cult to Energetic Leader: Emily Adams on Human Design and Rebuilding Your Life",
      "description": "What happens when you walk away from everything you’ve ever known - your family, your culture, your religion - and have to rebuild your life… twice? In this episode, I sit down with Emily Adams, a speaker, coach, and creator of a new human design for leadership platform, to talk about her extraordinary journey from growing up in the Amish community to becoming a powerful, grounded leader in the worlds of business, energy, and self-trust. Emily shares how leaving the Amish at 17 - literally climbing out of a second-story window in the middle of the night - threw her into a full identity crisis and culture shock. We walk through her climb into the corporate automotive world, her spiritual awakening after a painful divorce, and the deep trauma work (EMDR, inner child work, plant medicine) that eventually led her to astrology and human design. Today, she uses human design to help leaders, teams, and entrepreneurs align how they work with their innate energy, instead of continuing to burn out in hustle culture. In this conversation, we explore: What it was like to escape the Amish culture and start over with a sixth-grade education The realities of unprocessed trauma and the catalyst that led to her spiritual awakening How human design became a tool for healing, deconditioning, and reclaiming her voice What it means to be a Manifestor 4/6 and how understanding her design changed how she works, parents, and leads Practical, accessible ways to start using human design: type, authority, and profile How she uses human design as a parent to better understand and support her two sons Why purpose isn’t a fixed destination, but something that evolves as you do The story behind her new tech platform that blends human design, coaching, and leadership development If you’ve ever felt out of place in your own life, questioned the systems you were raised in, or wondered how to build a life that actually fits your energy, this episode will speak directly to you. Connect with Emily Human Design \u0026#43; Leadership Platform: https://leadingwithhumandesign.com/ Threads: https://www.threads.net/@emilyadams_ YouTube: https://www.youtube.com/@EmilyAdams_ LinkedIn: https://www.linkedin.com/in/emilyadams8/ Facebook: https://www.facebook.com/emilyadamm/ If this episode spoke to you, it would mean the world if you took a moment to leave a review or share it with a friend who needs it. And make sure you hit follow so you never miss an episode of Conditioning to Consciousness. You can connect with me on Instagram @jesscallahan_, join my Substack community at conditioningtoconsciousness.substack.com, or explore more of my work at jesscallahan.com. My Back in the Body Nervous System Healing course is now available! Find it here . Thanks for listening — I’m so grateful you’re here.",
      "release": "2026-01-08T10:00:00Z",
      "duration": "00:49:02.8760000",
      "explicit": true,
      "spotifyId": "2Qyuk4wfZgCLFRrLPD8Ofx",
      "appleId": 1000744270478,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Qyuk4wfZgCLFRrLPD8Ofx",
        "apple": "https://podcasts.apple.com/podcast/28-from-amish-cult-to-energetic-leader-emily-adams/id1828630860?i=1000744270478"
      }
    }
  ]
}