{
  "_ts": 0,
  "id": "9c47aeb9-7616-4b5c-b878-4bc6e900b174",
  "name": "Confronting The Line",
  "spotifyId": "1X3WDe5cfSQoAl2Ken0vuV",
  "appleId": 1767038822,
  "youTubeChannelId": "UCFslwBz4njSomle3DcC1Eng",
  "episodes": [
    {
      "id": "cb8af281-fb62-4dce-b6a1-4041cb66bcca",
      "title": "Breaking Free: The Journey from Landmark Worldwide w/ Brian Nord \u0026 Erik Rojas",
      "description": "In this conversation, Anne L Peterson, Brian Nord, and Erik Rojas discuss their experiences with Landmark Worldwide, a high control organization. They explore the challenges of leaving such an environment, the impact of speaking out publicly about their experiences, and the emotional and mental struggles that come with questioning long-held beliefs. The discussion highlights the importance of community, the complexities of personal development, and the courage required to confront the darker aspects of self-help organizations.TAKEAWAYS: ** The transition from being a part of a high control organization to leaving it is complex and emotionally challenging.** Speaking out about personal experiences can lead to healing and community support.** Many individuals in high control organizations struggle with questioning their beliefs and experiences after leaving.** The culture within organizations like Landmark can lead to emotional and physical abuse, which is often normalized.** Finding a new community after leaving a high control organization can be a significant source of healing.** The tools and teachings from self-help organizations can be both beneficial and harmful, depending on the context.** It\u0027s essential to recognize and address exploitation within self-help and personal development spaces.** Courage to question long-held beliefs is crucial for personal growth and recovery.** The impact of leaving a high control organization can affect personal relationships and mental health.** Recovery is an ongoing process that requires time, reflection, and support.RESOURCES \u0026 LINKS Watch Brian and Erik’s show    / @howdidigetherechannel   If you or someone you know is wrestling with recovery after being involved in a high-control group, relationship or any organization, check out the Healthy Healing and Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-... To learn about and support a safer and more ethical self-development industry check out https://www.seeksafely.org/ or the SEEKSafely SUMMIT https://ilumn8.life/op/the-seek-safel... Read Anne’s Book Is This A Cult: Confronting the Line Between Exploitation and Transformation https://a.co/d/7uoGYRs If you or someone you know is wrestling with recovery after being involved in a high-control group, relationship or any organization, check out the Healthy Healing and Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-... MODERATION NOTE: While healthy debate and discussion regarding the topics being discussed is encouraged, personal (ad hominem) attacks on people, places or things will be deleted. FINALLY Please consider supporting this channel which helps us to offer more and better content and resources such as the healing group w/ Rachel. Contributing also supports the learning and healing needs of folks, no matter their ability to pay, who are waking up to and leaving high demand and cult(ish) groups. Learn what you can do HERE. https://ilumn8.givingfuel.com/ilumn8g...",
      "release": "2025-02-18T20:32:20Z",
      "duration": "01:12:58",
      "explicit": false,
      "spotifyId": "4ZqPv9pxr8i2J9xFdQbpFJ",
      "appleId": 1000693719019,
      "youTubeId": "33oN3WcoTOo",
      "subjects": [
        "Landmark",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ZqPv9pxr8i2J9xFdQbpFJ",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-the-journey-from-landmark-worldwide-w/id1767038822?i=1000693719019",
        "youtube": "https://www.youtube.com/watch?v=33oN3WcoTOo"
      }
    },
    {
      "id": "618b1b45-ae57-49ac-9385-2933834ec793",
      "title": "Unmasking the Troubled Teen Industry w/ Kari Bunn: Healing, Trauma, and the Path Forward!",
      "description": "In this conversation, Kari Bunn, a survivor of the controversial \u0022troubled teen\u0022 school C.E.D.U., joins Anne Peterson to unpack the complexities of the troubled teen industry. Together, they explore the duality of these programs—shedding light on the mix of emotional growth promises and harmful practices rooted in celebrity culture, self-help movements, and coercion.\nTheir dialogue dives into personal stories, the trauma of misguided therapeutic methods, the role of documentaries in shaping public perception, and the lasting impact on survivors. With a focus on healing, awareness, and community, this conversation emphasizes the importance of learning from past abuses to foster healthier approaches to personal growth and therapy. \n\nSUPPORT Kari and her colleagues to get their documentary made. \nhttps://www.kickstarter.com/projects/cedudocumentary/cedu-documentary \n\nCONNECT to Kari https://www.facebook.com/kari.bunn \n\nCELEBRATE some recent accomplishments. \nParis Hilton has made it her mission to empower the survivors of these schools after her own traumatic experiences as a student. https://parishilton.com/paris-impact-work/ \n\nHilton is the force behind the Stop Institutional Child Abuse Act, which passed the House and Senate last week. The legislation creates a federal work group on youth residential programs to oversee the health, safety, care, treatment and placement of minors in rehab and other facilities. The new law is personal for Hilton, who has testified before Congress that she faced abuse in such facilities as a teen. \n\nhttps://www.congress.gov/bill/118th-congress/senate-bill/1351?q=%7B%22search%22%3A%22Stop\u002BInstitutional\u002BChild\u002BAbuse\u002BAct%22%7D\u0026s=1\u0026r=1\n\n\nWHAT is CEDU \n\nIn 1967, Mel Wasserman and his wife Brigitta founded CEDU Educational Services, Inc in California. Mel Wasserman had previously sponsored recovering addicts at nearby Synanon and highly regarded Charles E. Dederich. The name, CEDU, was thought to be an acronym for “Charles E. Dederich University.” Several Synanon acolytes worked at CEDU such as Bill Lane who was one of Synanon’s first and youngest members. In fact, Dr. Frank Seixas wrote an endorsement letter of CEDU in 1972 which acknowledged that Mel Wasserman had experience with Synanon and modeled CEDU’s “therapy” after it. When Synanon later fell out of favor in the public eye due to its criminal activities, Mel Wasserman would claim that the name CEDU had nothing to do with Synanon and instead stood for “See yourself as you are and do something about it.\n\nThe average time that children would attend CEDU was 2.5 years. The program did not believe in the use of medicine or most traditional therapy. Punishment such as hard labor, isolation, attack group sessions, etc was often used. At least three times a week, students were required to attend “rap”  sessions – which were attack pseudo-psychology sessions led by untrained staff. These were very similar to Synanon’s “Game.” Students also were required to attend multi-day workshops called “Propheets” – similar to Synanon’s “The Trip.”\n\nCEDU would later branch out and open up multiple schools in California and Idaho until their closure in 2005. Multiple CEDU spinoff programs were created by former staff and students and some continue to operate to this day using the same structure and methods as the original CEDU.  \n\nRead more https://en.wikipedia.org/wiki/CEDU \n\n\nGENERAL RESOURCES \u0026 LINKS \nRead Anne’s Book Is This A Cult: Confronting the Line Between Exploitation and Transformation https://a.co/d/7uoGYRs \n\nIf you or someone you know is wrestling with recovery after being involved in a high-control group, relationship or any organization, check out the Healthy Healing and Recovery Group w/ Rachel Berstein https://ilumn8.life/op/lgat-recovery-group/ \n\nMODERATION NOTE: \nWhile healthy debate and discussion regarding the topics being discussed is encouraged, personal (ad hominem) attacks on people, places or things will be deleted. \n\nFINALLY \nPlease consider supporting this channel which helps us to offer more and better content and resources. Learn what you can do HERE. \nhttps://ilumn8.givingfuel.com/ilumn8giving",
      "release": "2025-01-12T21:13:00Z",
      "duration": "01:17:19",
      "explicit": false,
      "youTubeId": "Z1U3EHIh5po",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z1U3EHIh5po"
      }
    },
    {
      "id": "c18724eb-3503-4bb5-a8fd-d22da0e15f81",
      "title": "Ed Gurowitz on The est 6 Day Course – What Can We Learn from the Past?",
      "description": "In this conversation, former est Trainer and early Forum leader, Ed Gurowitz Ph.D., shares insights about the 6 Day program, a unique transformational training experience that emphasized safety, integrity and going beyond personal limits. It is legendary in the Landmark/Werner Erhard circles. The discussion covers the program\u0027s history, structure, and the experiential learning processes involved. While we have found many stories about the dangers of the est training and the Forum, we have heard almost nothing but huge praise for the course known as the 6 Day. AND as we have heard about some terrible outcomes of these types of encounter programs in the modern era, such as James Arthur Ray and the Spiritual Warrior program in which 3 people lost their lives, I wondered what we could learn from the apparent success, including the safety record, of the 6 Day. Ed reflects on the importance of leadership in creating a safe environment for participants and the challenges of maintaining integrity in personal development. The conversation concludes with thoughts on transformation as a continuous practice and the need for community support. A bit about Ed … Ed Gurowitz, Ph.D. is a psychologist who has been on the leading edge of personal and organizational transformation for over 40 years. As a management consultant and leadership development specialist, he has worked with top executives all over the world on communication, collaboration, conflict resolution, and removing the barriers that keep people stuck in “good enough,” allowing them to emerge into their full greatness as leaders and as human beings. RESOURCES \u0026 LINKS If you are a practitioner of personal development or wellness programs, products or services and want to learn what it looks like to be a Safe Practioner consider joining us for the next Safe Practitioner\u0027s Workshop https://ilumn8.life/op/safe-practitioners-workshop/ If you or someone you know is wrestling with recovery after being involved in a high-control group, relationship or any organization, check out the Healthy Healing and Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-... Read Anne’s Book Is This A Cult: Confronting the Line Between Exploitation and Transformation https://a.co/d/7uoGYRs",
      "release": "2024-11-29T16:48:23Z",
      "duration": "01:22:40.4320000",
      "explicit": false,
      "spotifyId": "4kO8QaGrFr4HYkUPPyiydi",
      "appleId": 1000678654927,
      "youTubeId": "LBlXG1OxOdo",
      "subjects": [
        "Landmark",
        "Erhard Seminars Training",
        "Large Group Awareness Trainings",
        "Cult Recovery",
        "James Arthur Ray"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4kO8QaGrFr4HYkUPPyiydi",
        "apple": "https://podcasts.apple.com/podcast/ed-gurowitz-on-the-est-6-day-course-what-can-we-learn/id1767038822?i=1000678654927",
        "youtube": "https://www.youtube.com/watch?v=LBlXG1OxOdo"
      }
    },
    {
      "id": "29219404-9547-4af3-aec1-716ede4f92a9",
      "title": "Coming Out of the Self Help Closet with Dale Dickins",
      "description": "In this conversation Anne, Mark and guest Dale Dickins discuss the challenges of speaking out publicly about the dark side of personal development companies like Landmark Worldwide. They explore the impact of Landmark on personal relationships and the illusion of completion in transformation, emphasizing the need for open conversations and the healing power of confronting the line between transformation and exploitation.\n\nThe discussion highlights the importance of critical thinking, the emotional highs and lows experienced in self-help environments, and the often hidden consequences of involvement in these groups. For instance, Dale touches on the challenges with the dynamics of her family relationships and how the Landmark Forum impacted that. \n\nAnne shares the therapeutic journey of writing her book, the fear of community rejection, and the cathartic experience of questioning and sorting through it all. The three discuss the challenges of leaving high-control groups, the complexities of betrayal, and the importance of transparency in personal development. \n\nRESOURCES \u0026 LINKS \n\n\nCheck out Dales Show Life After Landmark    / @lifeafterlandmark  \n\nRead Anne’s Book Is This A Cult: Confronting the Line Between Exploitation and Transformation https://a.co/d/7uoGYRs \n\nIf you or someone you know is wrestling with recovery after being involved in a high-control group, relationship or any organization, check out the Healthy Healing and Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-... \n\nFINALLY \n\n\nPlease consider supporting this channel which helps us to offer more and better content and resources such as the healing group w/ Rachel. Contributing also supports the learning and healing needs of folks, no matter their ability to pay, who are waking up to and leaving high demand and cult(ish) groups. \n\nLearn what you can do HERE. https://ilumn8.givingfuel.com/ilumn8g...",
      "release": "2024-11-21T16:26:05Z",
      "duration": "01:34:03",
      "explicit": false,
      "spotifyId": "4YJvOsUQdgNHd0t4ReGQTz",
      "appleId": 1000677798917,
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YJvOsUQdgNHd0t4ReGQTz",
        "apple": "https://podcasts.apple.com/podcast/coming-out-of-the-self-help-closet-with-dale-dickins/id1767038822?i=1000677798917"
      }
    },
    {
      "id": "67546c3a-bd75-45e5-86ef-f8db31399a99",
      "title": "Ed Gurowitz on The EST 6 Day Course – What Can We Learn from the Past?",
      "description": "In this conversation, former est Trainer and early Forum leader, Ed Gurowitz Ph.D., shares insights about the 6 Day program, a unique transformational training experience that emphasized safety, integrity and going beyond personal limits. It is legendary in the Landmark/Werner Erhard circles. The discussion covers the program\u0027s history, structure, and the experiential learning processes involved. \n\nWhile we have found many stories about the dangers of the est training and the Forum, we have heard almost nothing but huge praise for the course known as the 6 Day. As we have heard about some terrible outcomes of these types of encounter programs in the modern era, such as James Arthur Ray and the Spiritual Warrior program in which 3 people lost their lives, I wondered what we could learn from the apparent success, including the safety record, of the 6 Day.  \n\nEd reflects on the importance of leadership in creating a safe environment for participants and the challenges of maintaining integrity in personal development. The conversation concludes with thoughts on transformation as a continuous practice and the need for community support.\n\nA bit about Ed … \n\nEd Gurowitz, Ph.D. is a psychologist who has been on the leading edge of personal and organizational transformation for over 40 years. As a management consultant and leadership development specialist, he has worked with top executives all over the world on communication, collaboration, conflict resolution, and removing the barriers that keep people stuck in “good enough,” allowing them to emerge into their full greatness as leaders and as human beings.\n\nRESOURCES \u0026 LINKS \n\nIf you or someone you know is wrestling with recovery after being involved in a high-control group, relationship or any organization, check out the Healthy Healing and Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-group/ \n\nRead Anne’s Book Is This A Cult: Confronting the Line Between Exploitation and Transformation https://a.co/d/7uoGYRs",
      "release": "2024-11-20T22:47:15Z",
      "duration": "01:22:40",
      "explicit": false,
      "youTubeId": "Kjby2IqpUGU",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings",
        "Erhard Seminars Training",
        "James Arthur Ray",
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kjby2IqpUGU"
      }
    },
    {
      "id": "a34fb32e-86e0-4d7c-9045-73bca3641a39",
      "title": "E16 Dr Glenn Patrick Doyle on Understanding Complex PTSD and The Importance of Recovery Over Cure",
      "description": "In this conversation with guest Dr. Glenn Patrick Doyle we delve into the complexities of personal development, trauma recovery, and the often blurred lines between self-help and exploitation. \n\nDr. Glenn specializes in complex PTSD, and shares with us the definitions and impacts of trauma, and the psychological mechanisms like dissociation that can arise from prolonged trauma. Our discussion emphasizes the importance of recognizing trauma symptoms, the ongoing nature of recovery, and the need for safe and ethical practices in self-help and therapy.\n\nTAKEAWAYS\nSelf-help can provide hope and tools for recovery.\nComplex PTSD is often misunderstood and under diagnosed.\nDissociation serves as a defense mechanism in trauma survivors.\nTrauma can overwhelm one\u0027s ability to function.\nRecovery is a continuous process, not a one-time event.\nUnderstanding the nuances of trauma can aid in healing.\nLabels can be both helpful and limiting in mental health.\nIt\u0027s crucial to seek safe and ethical self-help practices.\nThe intersection of addiction and trauma is significant.\nAwareness of trauma symptoms is the first step towards recovery.\n\nABOUT Dr Glenn Patrick Doyle\nDr. Doyle entered the psychology field because of his interest in self-help and personal growth. He earned his Doctor of Psychology degree in 2008 and has been in private practice since 2011. Dr. Doyle’s clinical work has focused on inpatient and outpatient treatment of complex trauma, particularly adults who were abused or traumatized as children. He has presented multiple times at the International Society for the Study of Trauma and Dissociation and the American Psychological Association. Dr Glenn is passionate about making effective, safe, empowering psychological and behavioral tools available to as many people as possible and uses his social media @drdoylesays to reach a wider audience. He joined the SEEK board in 2019 and became Board President in 2021. #SEEKSafely \n\nRESOURCES \u0026 LINKS \nGet Dr Glenn’s awesome insights by following @DrDoyleSays on your favorite Socials\nYou can also read up on his blog site https://useyourdamnskills.com/ \n\nCheck out https://www.seeksafely.org/ or the SEEKSafely SUMMIT https://ilumn8.life/op/the-seek-safel... \n\nRead Anne’s Book Is This A Cult: Confronting the Line Between Exploitation and Transformation https://a.co/d/7uoGYRs \n\nIf you or someone you know is wrestling with recovery after being involved in a high-control group, relationship or any organization, check out the Healthy Healing and Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-... \n\nMODERATION NOTE: \nWhile healthy debate and discussion regarding the topics being discussed is encouraged, personal (ad hominem) attacks on people, places or things will be deleted.",
      "release": "2024-10-26T16:45:30Z",
      "duration": "01:10:00",
      "explicit": false,
      "spotifyId": "3kJkNX1ALRjywyyK6XmuPV",
      "appleId": 1000674562283,
      "youTubeId": "nns-S4CW2hE",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3kJkNX1ALRjywyyK6XmuPV",
        "apple": "https://podcasts.apple.com/podcast/e16-dr-glenn-patrick-doyle-on-understanding-complex/id1767038822?i=1000674562283",
        "youtube": "https://www.youtube.com/watch?v=nns-S4CW2hE"
      }
    },
    {
      "id": "a096aba2-f69d-497c-86bd-4567eabdebc9",
      "title": "Confronting the Line Between Self-Help \u0026 Cults w/ Dr Glenn Patrick Doyle of SEEK Safely",
      "description": "In this conversation with guest, Dr Glenn Patrick Doyle, licensed psychologist and board president of SEEK Safely, we dive into the complexities of self-help culture, exploring its potential benefits and pitfalls. \n\nWe discuss the allure of self-help, the psychological dynamics that can lead individuals into high-control groups, and the fine line between genuine transformation and exploitation. The conversation also highlights the importance of critical thinking and awareness in navigating the self-help landscape, as well as the mission of SEEK Safely to create a safer environment for seekers. The discussion culminates in an announcement about the upcoming SEEK Safely Summit, aimed at educating consumers and promoting ethical practices in the self-help industry.\n\nABOUT Dr Glenn Patrick Doyle\nDr. Doyle entered the psychology field because of his interest in self-help and personal growth. He earned his Doctor of Psychology degree in 2008 and has been in private practice since 2011. Dr. Doyle’s clinical work has focused on inpatient and outpatient treatment of complex trauma, particularly adults who were abused or traumatized as children. He has presented multiple times at the International Society for the Study of Trauma and Dissociation and the American Psychological Association. \n\nDr Glenn is passionate about making effective, safe, empowering psychological and behavioral tools available to as many people as possible and uses his social media @drdoylesays to reach a wider audience. He joined the SEEK board in 2019 and became Board President in 2021.  #SEEKSafely \n\nRESOURCES \u0026 LINKS \nGet Dr Glenn’s awesome insights by following @DrDoyleSays on your favorite Socials\nYou can also read up on his blog site https://useyourdamnskills.com/ \n\nRead Anne’s Book Is This A Cult: Confronting the Line Between Exploitation and Transformation https://a.co/d/7uoGYRs \n\nIf you or someone you know is wrestling with recovery after being involved in a high-control group, relationship or any organization, check out the Healthy Healing and Recovery Group w/ Rachel Berstein https://ilumn8.life/op/lgat-recovery-group/ \n\nMODERATION NOTE: \nWhile healthy debate and discussion regarding the topics being discussed is encouraged, personal (ad hominem) attacks on people, places or things will be deleted. \n\nFINALLY \nPlease consider supporting this channel which helps us to offer more and better content and resources such as the healing group w/ Rachel.  Contributing also supports the learning and healing needs of folks, no matter their ability to pay, who are waking up to and leaving high demand and cult(ish) groups. Learn what you can do HERE. \n\nhttps://ilumn8.givingfuel.com/ilumn8giving",
      "release": "2024-10-07T22:24:46Z",
      "duration": "01:13:00",
      "explicit": false,
      "spotifyId": "2Fx5359PpUoedNKSW54jeM",
      "appleId": 1000674561839,
      "youTubeId": "wGjUL1Fwr38",
      "subjects": [
        "Landmark",
        "Cult Psychology",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Fx5359PpUoedNKSW54jeM",
        "apple": "https://podcasts.apple.com/podcast/e15-confronting-the-line-between-self-help-cults-w-dr/id1767038822?i=1000674561839",
        "youtube": "https://www.youtube.com/watch?v=wGjUL1Fwr38"
      }
    },
    {
      "id": "cf84c786-dda9-4bce-9d26-77b242717efc",
      "title": "E14 Exploring the Notion of Weaponized Empathy with Chris Shelton",
      "description": "In this episode, we explore the concept of weaponized empathy. We look at how empathy can be manipulated and used as a tool for control with the end justifies the means argument and how this moral theme is common in high-control groups, cults or culty groups and extremist ideologies. And what about the weaponization of empathy in the context of misinformation and narcissism? Often these people then become true believers who go to extreme lengths to spread the group\u0027s message and defend it, often causing harm to themselves and others in the process. We discussed how to recognize and protect oneself from being taken advantage of by weaponized empaths who mean well. In this part of the conversation, Chris discusses the process of deprogramming and deconstructing cult mindsets. He emphasizes the importance of physical safety, resources, and a support network in the early stages of leaving a cult. He also highlights the need for post-cult education and self-work to undo the indoctrination and build resilience. LINKS \u0026 RESOURCES Check out Chris’s Podcast/Show Speaking of Cults https://www.youtube.com/channel/UCF326xyA0QHI7Z5xAwKQDJg Get Anne’s Book https://a.co/d/7uoGYRs The Heathy Healing and Recovery Group w/ Rachel Berstein The purpose is to create a compassionate and supportive space where people can recover, heal, grow and reclaim their lives and autonomy. https://ilumn8.life/op/lgat-recovery-group/ MODERATION NOTE: While healthy debate and discussion regarding the topics being discussed is encouraged, personal (ad hominem) attacks on people, places or things will be deleted. FINALLY Please consider supporting this channel and helping me to offer more and better content and resources such as the healing group w/ Rachel. Contributing to supports the learning and healing needs of folks waking up to and leaving high demand and cult(ish) groups. https://ilumn8.givingfuel.com/ilumn8giving",
      "release": "2024-10-05T15:43:19Z",
      "duration": "01:20:57.0100000",
      "explicit": false,
      "spotifyId": "7KgqeNXJiPg4twKt2UpMiK",
      "appleId": 1000671873071,
      "youTubeId": "9EFfGZ-VOFE",
      "subjects": [
        "Cult Psychology",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KgqeNXJiPg4twKt2UpMiK",
        "apple": "https://podcasts.apple.com/podcast/e14-exploring-the-notion-of-weaponized-empathy/id1767038822?i=1000671873071",
        "youtube": "https://www.youtube.com/watch?v=9EFfGZ-VOFE"
      }
    },
    {
      "id": "55e67820-8f3e-4cc1-8da9-21c104f5950d",
      "title": "E13 Recognizing Signs of Indoctrination w/ Guest Gerette Buglion",
      "description": "Meet Gerette Buglion, author and educator. In this conversation we delve into the complexities of public discourse, cultural homogeneity, personal insights, and the dynamics of language and communication. We reflect on our similar experiences having spent years involved in different high-control groups and the importance of critical thinking in program design, while also exploring themes of personal growth and identity. \n\nWe took a look at some of the common terms being used a lot these days when discussing exploitation and abuse .. specifically we discuss what is and is not meant by Large Group Awareness Training (LGAT) and Indoctrination. \n\nWe look forward to having Gerette back to discuss more terms in the future! \n\nAbout Gerette Buglion:\nBorn a middle child of seven, it’s not surprising Gerette Buglion became a lifelong educator. From parent-child programs, to Special Ed and Primary School, she’s played many teacherly roles. She has found her sweet spot as a cult recovery educator and facilitator of her signature Writing to Reckon classes that support survivors to create coherent narratives out of the chaos of coercive control. Her memoir An Everyday Cult details her master’s-level training in undue influence. Her greatest professional achievement to date is being co-founder of igotout.org and co-managing the #igotout movement whose mission of education, healing and prevention makes her heart sing. \n\nRESOURCES \u0026 LINKS \nCheck out Gerette’s upcoming Reclaiming Autonomy Through the Written Word \nhttps://www.gerettebuglion.com/writin... \nA Writing Symposium for survivors of spiritual, religious and cultic abuse. Featuring Sarah Edmondson, Daniel Shw, Shelly Snow Pordea and Esther Friedman\n\nGet Anne’s Book \nhttps://a.co/d/7uoGYRs \n\nJoin the Heathy Healing and Recovery Group w/ Rachel Berstein \nhttps://ilumn8.life/op/lgat-recovery-... \nThe purpose is to create a compassionate and supportive space where people can recover, heal, grow and reclaim their lives and autonomy.\n\nMODERATION NOTE: \nWhile healthy debate and discussion regarding the topics being discussed is encouraged, personal (ad hominem) attacks on people, places or things will be deleted. \n\nFINALLY \nPlease consider supporting this channel and helping me to offer more and better content and resources such as the healing group w/ Rachel. Contributing to supports the learning and healing needs of folks waking up to and leaving high demand and cult(ish) groups. \nhttps://ilumn8.givingfuel.com/ilumn8g...",
      "release": "2024-09-28T15:03:56Z",
      "duration": "01:18:07.5050000",
      "explicit": false,
      "spotifyId": "1zm43CvsWQZdCJ8nlTzmPO",
      "appleId": 1000671102289,
      "youTubeId": "s9kchjy33eY",
      "subjects": [
        "Center For Transformational Learning"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zm43CvsWQZdCJ8nlTzmPO",
        "apple": "https://podcasts.apple.com/podcast/e13-recognizing-signs-of-indoctrination-w-guest/id1767038822?i=1000671102289",
        "youtube": "https://www.youtube.com/watch?v=s9kchjy33eY"
      }
    },
    {
      "id": "8b084602-1316-402f-828e-109956a910ff",
      "title": "E12 Squirrels and other connections between Scientology and Landmark with guest Chris Shelton",
      "description": "Chris Shelton MSc, Scientology survivor and coercive control expert joined us as guest this week. We had fun exploring the similarities between Scientology and Landmark Worldwide, two organizations that are known for their controversial practices and being accused of cult-like behavior. Similarities such as the cult-ish personalities around the founders, L. Ron Hubbard and Werner Erhard, and the lack of accountability of such leaders. We also talked about the tactics used like emotional manipulation, the suppression of questioning, the power of social proof and the manipulation of beliefs. PLUS the influence of other cult leaders on Landmark and Scientology is undeniable. We compared the practices and beliefs of Landmark and Scientology. Landmark focuses on transformative learning and removing barriers to self-expression, while Scientology believes in the spiritual nature of humans and aims to remove past life trauma. Anything for a tax write off?! The goal of Landmark is to “transform the being of human being” and Scientology is to “clear” the planet. What’s the difference? Still searching. We discovered more similarities, such as the concept of recreation where individuals are trained to fully understand and duplicate another person\u0027s communication and the control mechanisms used in communication exercises in general. Well, Werner does acknowledge L. Ron in his authorized biography. Chris didn’t have any first hand knowledge of the supposed Scientology conspiracy to discredit Werner, beyond his being labeled a squirrel \u0026#x1f43f;of course. He did give us some insider history of Scientology\u0027s infiltration operations into the IRS and political organizations for the purpose of influencing on a larger scale. Finally the conversation concludes with a discussion on the importance of recognizing and educating ourselves about manipulative tactics in order to protect our autonomy and rights. LINKS \u0026 RESOURCES Check out Chris’s Podcast/Show Speaking of Cults https://www.youtube.com/channel/UCF326xyA0QHI7Z5xAwKQDJg Get Anne’s Book https://a.co/d/7uoGYRs Looking for understanding and support check out the Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-group/ The purpose is to create a compassionate and supportive space where people can recover, heal, grow and reclaim their lives and autonomy. LINKS \u0026 RESOURCES Check out Chris’s Podcast/Show Speaking of Cults https://www.youtube.com/channel/UCF326xyA0QHI7Z5xAwKQDJg Get Anne’s Book https://a.co/d/7uoGYRs The Heathy Healing and Recovery Group w/ Rachel Bernstein The purpose is to create a compassionate and supportive space where people can recover, heal, grow and reclaim their lives and autonomy. https://ilumn8.life/op/lgat-recovery-group/ MODERATION NOTE: While healthy debate and discussion regarding the topics being discussed is encouraged, personal (ad hominem) attacks on people, places or things will be deleted. FINALLY Please consider supporting this channel and helping me to offer more and better content and resources such as the healing group w/ Rachel. Contributing to supports the learning and healing needs of folks waking up to and leaving high demand and cult(ish) groups. https://ilumn8.givingfuel.com/ilumn8giving",
      "release": "2024-09-24T23:10:19Z",
      "duration": "01:19:17.2560000",
      "explicit": true,
      "spotifyId": "1RZrJMmsIc65PIXL3XTQCQ",
      "appleId": 1000670589123,
      "youTubeId": "f4dSkN_oqVg",
      "subjects": [
        "Landmark",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1RZrJMmsIc65PIXL3XTQCQ",
        "apple": "https://podcasts.apple.com/podcast/e12-squirrels-and-other-connections-between/id1767038822?i=1000670589123",
        "youtube": "https://www.youtube.com/watch?v=f4dSkN_oqVg"
      }
    },
    {
      "id": "5cd9a912-c9b9-49f6-964e-6677554c4485",
      "title": "Recognizing Signs of Indoctrination w/ Guest Gerette Buglion",
      "description": "Meet Gerette Buglion, author and educator. In this conversation we delve into the complexities of public discourse, cultural homogeneity, personal insights, and the dynamics of language and communication. We reflect on our similar experiences having spent years involved in different high-control groups and the importance of critical thinking in program design, while also exploring themes of personal growth and identity. \n\nWe took a look at some of the common terms being used a lot these days when discussing exploitation and abuse .. specifically we discuss what is and is not meant by Large Group Awareness Training (LGAT) and Indoctrination. \n\nWe look forward to having Gerette back to discuss more terms in the future! \n\nAbout Gerette Buglion:\nBorn a middle child of seven, it’s not surprising Gerette Buglion became a lifelong educator. From parent-child programs, to Special Ed and Primary School, she’s played many teacherly roles. She has found her sweet spot as a cult recovery educator and facilitator of her signature Writing to Reckon classes that support survivors to create coherent narratives out of the chaos of coercive control. Her memoir An Everyday Cult details her master’s-level training in undue influence. Her greatest professional achievement to date is being co-founder of igotout.org and co-managing the #igotout movement whose mission of education, healing and prevention makes her heart sing. \n\nRESOURCES \u0026 LINKS \nCheck out Gerette’s upcoming Reclaiming Autonomy Through the Written Word \nhttps://www.gerettebuglion.com/writing-symposium \nA Writing Symposium for survivors of spiritual, religious and cultic abuse. Featuring Sarah Edmondson, Daniel Shw, Shelly Snow Pordea and Esther Friedman\n\nGet Anne’s Book \nhttps://a.co/d/7uoGYRs \n\nJoin the Heathy Healing and Recovery Group w/ Rachel Berstein \nhttps://ilumn8.life/op/lgat-recovery-group/ \nThe purpose is to create a compassionate and supportive space where people can recover, heal, grow and reclaim their lives and autonomy.\n\nMODERATION NOTE: \nWhile healthy debate and discussion regarding the topics being discussed is encouraged, personal (ad hominem) attacks on people, places or things will be deleted. \n\nFINALLY \nPlease consider supporting this channel and helping me to offer more and better content and resources such as the healing group w/ Rachel.  Contributing to supports the learning and healing needs of folks waking up to and leaving high demand and cult(ish) groups. \nhttps://ilumn8.givingfuel.com/ilumn8giving",
      "release": "2024-09-23T21:56:25Z",
      "duration": "01:18:08",
      "explicit": false,
      "youTubeId": "rYCRUZ9mfQI",
      "subjects": [
        "Landmark",
        "Center For Transformational Learning"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rYCRUZ9mfQI"
      }
    },
    {
      "id": "251abc68-81fc-4dc8-aedb-66364fe66c66",
      "title": "E11 Directed Sharing: Manipulating Natural Human Tendencies - Ed Gurowitz returns!",
      "description": "Welcome back Ed! In this conversation with our resident transformational technologies expert Ed Gurowitz we cover various topics including cult dynamics, the power of influence, the illusion of scarcity, and the impact of directed sharing. We also touched on the creation of special groups within an organization and the role of scarcity in creating value. The absorption of a powerful person\u0027s way of being into a group and the competition to be part of that group is covered. AND explore the concept of directed sharing and the manipulation of natural human tendencies. Overall, the conversation highlights the importance of awareness and critical thinking in navigating these dynamics. Who is Ed? Ed Gurowitz, Ph.D. is a psychologist who has been on the leading edge of personal and organizational transformation for over 40 years. As a management consultant and leadership development specialist, he has worked with top executives all over the world on communication, collaboration, conflict resolution, and removing the barriers that keep people stuck in “good enough,” allowing them to emerge into their full greatness as leaders and as human beings. Regarding his human potential (aka Landmark) Ed did the est Training in 1978 and went on to be on staff in Werner Erhard\u0027s office, traveling and working directly with Werner, including on the \u0022Project to Recreate the Training,\u0022 which resulted in the creation of the Forum. He also worked at Tekniko until he left the network in 1991. Stay tuned for Ed’s forthcoming book on personal and organizational transformation! Ed’s current book: Inclusion, The Role of Leadership: Why We Are Separate, Why We Need to Come Together https://a.co/d/gvlPs35 RESOURCES: Healthy Healing and Recovery with Rachel Bernstein https://ilumn8.life/op/lgat-recovery-group/ Safe Practitioners Workshop https://ilumn8.life/op/safe-practitioners-workshop/ TAKEAWAYS: * Cult dynamics can be observed in various contexts, including organizations and societies. * The power of influence can lead individuals to absorb the way of being of a powerful person or group. * The illusion of scarcity can be used to create value and exclusivity. * Directed sharing can manipulate natural human tendencies to promote certain ideas or behaviors. * Awareness and critical thinking are essential in navigating these dynamics and avoiding manipulation. RESOURCES: LGAT / High-Control Recovery https://ilumn8.life/op/lgat-recovery-group/ Anne\u0027s Book https://a.co/d/7uoGYRs",
      "release": "2024-09-11T02:28:04Z",
      "duration": "01:25:27.8940000",
      "explicit": true,
      "spotifyId": "3OMJlQkiOrEuqlfOnoyEEu",
      "appleId": 1000669094304,
      "youTubeId": "Rv3VtOvuI4U",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings",
        "Cult-Expert",
        "Cult Recovery",
        "Erhard Seminars Training"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3OMJlQkiOrEuqlfOnoyEEu",
        "apple": "https://podcasts.apple.com/podcast/e11-directed-sharing-manipulating-natural-human-tendencies/id1767038822?i=1000669094304",
        "youtube": "https://www.youtube.com/watch?v=Rv3VtOvuI4U"
      }
    },
    {
      "id": "f44e0164-b747-4129-b903-6e493a5b2061",
      "title": "E10 PART2 - Exene Paloma: An Anarchist view on collective and inclusive approach to personal development.",
      "description": "In PART TWO of this conversation with Exene Paloma, we continue the discussion about how certain structures and hierarchies can replicate dominant power dynamics and exclude individuals based on their race, gender, or personality. We also examine the limitations of external interventions in communities and the importance of empowering individuals to develop their own solutions. The conversation highlights the need to challenge and dismantle oppressive systems and create inclusive spaces that respect diverse perspectives and experiences. We also examine the idea of self-made success and the role of privilege in achieving it. The need for a more collective and inclusive approach to personal development, rather than an individualistic one is highlighted. Again we emphasize the importance of questioning and critically examining the practices and beliefs within the self-help (aka personal development) industry. RESOURCES: https://ilumn8.life/op/lgat-recovery-group/",
      "release": "2024-09-11T00:52:29Z",
      "duration": "01:05:37.5930000",
      "explicit": true,
      "spotifyId": "46o18UWEl0UyTupD1pXJAr",
      "appleId": 1000669089244,
      "youTubeId": "xT_7UI_0pp4",
      "subjects": [
        "Landmark",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/46o18UWEl0UyTupD1pXJAr",
        "apple": "https://podcasts.apple.com/podcast/e10-part2-exene-paloma-an-anarchist-view-on/id1767038822?i=1000669089244",
        "youtube": "https://www.youtube.com/watch?v=xT_7UI_0pp4"
      }
    },
    {
      "id": "ab679d91-93f6-443d-8108-f71c917a4f93",
      "title": "E9 The Role of Power and Privilege in Landmark and the Personal Development Space",
      "description": "\u0022Dominance hierarchies, structures that are about people having power over other people inherently are to be questioned.\u0022 ~ Exene Paloma In this conversation we question the power and privilege dynamics in the personal development space, with a focus on the Landmark Forum. Our guest, Exene Paloma, shares the experience as a former Landmark staff member and course supervisor. The conversation explores the hierarchical structure and power dynamics within Landmark and similar organizations. It discusses the influence of the source (Werner Erhard) and how his personality and ideas shape the culture of the organization. The conversation also delves into the concept of dominance hierarchies and the belief that power structures built on people having power over others are inherently flawed. Exene expresses skepticism towards top-down culture change and emphasizes the importance of empowering individuals and building structures that promote equality. In part of the conversation, Exene and Anne explore some of the manipulative tactics used in self-help programs, highlighting how these programs create an artificial environment to elicit emotional responses and then sell products or services. They also discuss the concept of integrity and how it is used as a tool for control and touch on the power dynamics within these programs and the pressure to conform to group norms. They also discuss the transferability of the insights gained in these programs to real-life situations and the limitations of self-help in addressing systemic issues. Finally, they draw parallels between self-help and marketing, highlighting the focus on personal improvement and the perpetuation of feelings of inadequacy for the purpose of ongoing sales. RESOURCES: We are offering group therapy sessions specifically for former Large Group Awareness Training (LGAT) and organizations or High Control Group employees, program leaders, program managers, business consultants, long-time volunteers and people who have participated with them. https://ilumn8.life/op/lgat-recovery-group/",
      "release": "2024-09-11T00:47:07Z",
      "duration": "01:10:35.4820000",
      "explicit": true,
      "spotifyId": "2ZHA2w0wuZeIdItltvu61C",
      "appleId": 1000669089461,
      "youTubeId": "beBgRVp0jgI",
      "subjects": [
        "Landmark",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZHA2w0wuZeIdItltvu61C",
        "apple": "https://podcasts.apple.com/podcast/e9-the-role-of-power-and-privilege-in/id1767038822?i=1000669089461",
        "youtube": "https://www.youtube.com/watch?v=beBgRVp0jgI"
      }
    },
    {
      "id": "3c32fbd1-85d5-4b9d-9bc1-b2b0dbf47547",
      "title": "E8 PT2 Dr John Hunter on Informed Consent and Empirical Research in LGATs",
      "description": "In part two of this conversation with Dr. John Hunter we discuss the concept of informed consent in the context of Large Group Awareness Trainings (LGATs) and explore the importance of providing participants with accurate information about the potential benefits and risks of these trainings. We also highlight the need for independent research to support the claims made by Landmark Worldwide and the similar groups that put them on. \n\nOther topics discussed include the role of experience in creating transformation, the influence of group dynamics, and the stigma on mental health care. Overall, the discussion raises important questions about the ethical practices and transparency of LGATs. \n\nDr. John and Anne reiterate the importance of critically examining the claims and risks associated with LGATs and highlight the need for transparency and informed consent, as well as the potential for both positive and negative experiences within these programs.. \n\nThe conversation emphasizes the importance of open dialogue and the willingness to consider different perspectives.\n\nRESOURCES \u0026 LINKS \n\nCheck out Dr. Johns Hunters work https://johnhunterphd.com/#about-me\n\nDr John’s Article explaining LGATS in 1000 words or less https://thoughtleader.co.za/the-first-rule-of-large-group-awareness-trainings/?amp \n\nVideo: Speaking of Cults...Are LGATs Actually Just Cults? (Chris Shelton \u0026 Dr John)  - https://www.youtube.com/watch?v=y0eRBqJ8CgM\u0026t=21s \n\nThe Safe Practitioner Workshop https://ilumn8.life/op/safe-practitioners-workshop/\n\nHealthy Healing LGAT Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-group/\n\nCHAPTERS \n00:00 Introduction and Discussion of Slide Deck\n00:20 Introduction to the Podcast and Guest\n02:01 Background and Personal Experience with Bipolar Disorder\n06:13 The Influence of Group Dynamics and Extreme Experiences\n10:41 The Role of Informed Consent in Personal Development\n16:17 The Peak End Rule and Remembering Experiences\n19:34 The Challenges of Obtaining Informed Consent in LGATs\n24:26 Creating an Experience and the Importance of Lineage\n30:16 The Need for Transparency and Accountability\n32:54 Internal Locus of Control and Daily Hassles\n34:48 The Importance of Rigorous Research and Informed Consent\n40:40 Misleading Information and Informed Consent\n45:37 The Chutzpah of Exaggerated Claims\n48:26 Balancing Risk and Reward in Personal Development\n01:04:47 New Chapter\n01:13:01 Wrap Up",
      "release": "2024-09-11T00:35:47Z",
      "duration": "01:13:05.6920000",
      "explicit": true,
      "spotifyId": "6w10iBs5gEDLtn8nRlpUgz",
      "appleId": 1000669087928,
      "youTubeId": "tBewCvOITcM",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6w10iBs5gEDLtn8nRlpUgz",
        "apple": "https://podcasts.apple.com/podcast/e8-pt2-dr-john-hunter-on-informed-consent-and/id1767038822?i=1000669087928",
        "youtube": "https://www.youtube.com/watch?v=tBewCvOITcM"
      }
    },
    {
      "id": "19350387-7715-4094-a5bc-6bd5b911d8ec",
      "title": "E7 Can I ever trust a group again? - Understanding Research and LGATs w/ Dr. John Hunter",
      "description": "Meet Dr. John Hunter who teaches undergraduate and postgraduate students in research methods and psychology. Today he shares his background and research on large group awareness trainings (LGATs). He tells us about his personal experience in a seminar where abusive tactics were used by the trainer.\n\nIn this discussion he emphasizes the importance of critically evaluating information from these groups and the challenges of researching and publishing on this topic. The conversation made us aware of the psychology of group identity and the tendency to defend and identify with a group, even when faced with conflicting information.\n\nDr. John highlights the euphoria, confidence, and impulsivity that participants often experience after completing a large group awareness training. He draws attention to the common elements found in many of these groups, such as specific exercises, lots of rules, and the pressure to recruit others. \n\nThe discussion raises concerns about the potential exploitation and psychological impact of LGATs, highlighting the similarities between different large group awareness training seminars and the potential risks associated with them. He shares his personal experience with bipolar disorder and how it influenced his interest in studying these seminars. \n\nCONTENT NOTE \n\nThis video contains some discussion about mental health outcomes of both bi-polar disorder and LGATs. Including suicide rates, depression and incidents of psychosis. We invite you to be sensitive to your needs and reactions, and to pause and take your time, even speak with a trusted person if it is upsetting to you.\n\nRESOURCES \u0026 LINKS \n\nCheck out Dr. Johns Hunters work https://johnhunterphd.com/#about-me\n\nDr John’s Article explaining LGATS in 1000 words or less https://thoughtleader.co.za/the-first-rule-of-large-group-awareness-trainings/?amp \n\nVideo:  Large group awareness trainings, peak experiences and dopamine - https://youtu.be/2J1cxxPXyt8?si=KoMoDNiTKAtjAES8 \n\nThe Safe Practitioner Workshop https://ilumn8.life/op/safe-practitioners-workshop/\n\nHealthy Healing LGAT Recovery Group w/ Rachel Bernstein https://ilumn8.life/op/lgat-recovery-group/\n\nCHAPTERS \n\n00:00 Introduction and Concerns about LGATs\n07:26 Dr. John Hunter\u0027s Background and Interest in Psychology \u0026 LGATs\n19:08 Similarities Between LGATs and Bipolar Disorder\n26:28 Identical Exercises and Common Elements in LGATs\n29:40 Specific Examples of Exercises in LGATs\n32:04 Psychological Impact in LGATs\n36:27 Personal Experience and Research Interest\n46:12 The Shared History of Seminar Founders\n50:14 Challenging Interactions in Seminars\n57:20 Understanding In-Group and Out-Group Dynamics",
      "release": "2024-09-11T00:25:31Z",
      "duration": "00:59:33.2720000",
      "explicit": true,
      "spotifyId": "1KyHbOpiCx285ZfJjRHKA1",
      "appleId": 1000669086876,
      "youTubeId": "VY4z2mtnvrk",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KyHbOpiCx285ZfJjRHKA1",
        "apple": "https://podcasts.apple.com/podcast/e7-can-i-ever-trust-a-group-again-understanding/id1767038822?i=1000669086876",
        "youtube": "https://www.youtube.com/watch?v=VY4z2mtnvrk"
      }
    },
    {
      "id": "1cd86da1-46e2-48cb-9d90-febfc6cb89b2",
      "title": "E6 Our Reflections \u0026 Responses About Telling the Truth, Exposing Abuse and Confronting the Line",
      "description": "Mark and I took some time this weekend to discuss our experience and reactions to the recent revelations and stories that have emerged related to abuse at Landmark and the personal development world. We reflect on the impact of my book, \u0027Is This a Cult?\u0027, and the surprising response of the many #samehere experiences. We continue to emphasize the importance of telling the truth, exposing abuse, and creating healing spaces. \n\nWe also address the contentious discourse that has arisen in the Landmark community as a response to the many revelations being shared. We believe it is important to give space and grace to people who are speaking up, including our guests, even if it gets messy. We remind ourselves and others that anger has a role in the healing process and we recognize the need to hold boundaries while processing emotions. This requires learning how to understand and communicate our needs. Listening to learn is key to the process.\n\nWe wrap up talking about the need for transparency and accountability in organizations and the value of seeking truth and understanding. \n\nRESOURCES \u0026 LINKS\n\nMarks discussion on “How Did I Get Here” with Brian Nord \u0026 Erik Rojas\nTitled Queer Life or Compliance to Landmark Forum... Choose with Mark C. Tafoya https://www.youtube.com/live/Duw-msio9Ik?si=K2erL22aJihqmO56\n\nTo see all the interviews and people talking about this subject both about Landmark and the industry. https://isthisacultbook.com/ \n\nFor healing and recovery support JOIN Rachel Bernstein https://ilumn8.life/op/lgat-recovery-group/ \n\nFor practitioners, facilitators or coaches who wish to learn more about being a SAFE practitioner check out the Safe Practitioner Workshop. https://ilumn8.life/op/safe-practitioners-workshop/ \n\nCHAPTERS \n\n00:00 Introduction and Background\n02:12 Life Before and After the Book\n08:42 Mark\u0027s Experience and the Impact of Speaking Out\n13:04 Protecting Graduates and Protecting Ourselves\n16:35 Addressing Contentious Discourse\n19:44 Understanding Healing and Emotional Bypassing\n25:03 The Power of Anger in the Healing Process\n30:14 Compassion and Boundaries in Difficult Conversations\n34:52 Space and Grace in the Discourse\n38:42 The Process of Understanding and Communicating Needs\n45:35 The Importance of Listening and Learning\n51:48 Transparency and Accountability in Organizations\n57:27 Seeking Truth and Understanding\n01:03:41 Expressing Gratitude for the Learning Process",
      "release": "2024-09-11T00:19:41Z",
      "duration": "01:05:06.5710000",
      "explicit": true,
      "spotifyId": "5USAsN67KMC9kytVgLrWmE",
      "appleId": 1000669086954,
      "youTubeId": "-p3_E93utog",
      "subjects": [
        "Landmark",
        "Self-Help",
        "Cult-Expert",
        "Large Group Awareness Trainings",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5USAsN67KMC9kytVgLrWmE",
        "apple": "https://podcasts.apple.com/podcast/e6-our-reflections-responses-about-telling-the-truth/id1767038822?i=1000669086954",
        "youtube": "https://www.youtube.com/watch?v=-p3_E93utog"
      }
    },
    {
      "id": "d1c50932-0594-4763-b0f8-b6a968bb64d5",
      "title": "E5. PART TWO - Continuation of our Conversation with Former Forum Leader Alan Cahn",
      "description": "In Part 2, Alan starts to realize that he cannot change the culture from within.  He explains how he was de-designated as a Landmark Forum Leader, what led up to it and the good news and bad news of this turn of events. He reflects on some of his values and how they were not the same as Landmark’s and stressed his need to to live a life of contribution and the importance of healing past wounds. He also acknowledges the need for accountability and consequences in organizations to prevent abuse. \n\nUPDATED \u0026 IMPORTANT CONTENT NOTE: \n\nWe invited a small audience to listen to the live recording of the following show/podcast, and some people reported being emotionally triggered during the conversation.  You will hear some stories of physical abuse. Some of them may be triggering. When people hear about sensitive topics, there are a variety of possible reactions. All of them are valid. \n\nAn additional note related to this specific video. It contains conversation about trauma itself not using current nor trauma informed perspectives or language. Some people also found this triggering. \n\nWe invite you to be sensitive to your own reaction, and to pause and take your time, even speak with a trusted person if it is upsetting to you.\n\nWe ourselves are processing our own reactions, which we could not do in the moment. We invite everyone to give themselves grace as they confront the line for themselves.\n\nRESOURCES: \n\nHere is a link to the recovery group Anne mentions to support those that have worked in organizations or groups where they may have experienced hgh-control or abusive environments.  https://ilumn8.life/op/lgat-recovery-group/\n\nFor practitioners, facilitators or coaches who wish to learn more about being a SAFE practitioner check out the Safe Practitioner Workshop. https://ilumn8.life/op/safe-practitioners-workshop/",
      "release": "2024-09-11T00:10:10Z",
      "duration": "00:58:31.3430000",
      "explicit": true,
      "spotifyId": "03jr1J742bTDV47yfYGs0s",
      "appleId": 1000669086033,
      "youTubeId": "UmzeuTDfBzU",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/03jr1J742bTDV47yfYGs0s",
        "apple": "https://podcasts.apple.com/podcast/e5-part-two-continuation-of-our-conversation-with/id1767038822?i=1000669086033",
        "youtube": "https://www.youtube.com/watch?v=UmzeuTDfBzU"
      }
    },
    {
      "id": "16c78f17-4150-4a11-84e9-1263e06e477e",
      "title": "E4 PART ONE - Former Forum Leader on abuse at Landmark, his 32 year journey, and his advice for the future",
      "description": "Today we welcome Alan Cahn who has over 40 years of experience in personal development, 30 of them with Landmark Worldwide. Alan talks about his journey before he does the est training in 1976, including his experiences with Zen Buddhism and mystical Christian groups and how he makes his way, first onto W.E.A Staff (1985), and then becoming a Landmark Forum leader (1988). Alan tells us his unique story and touches on the experiential nature of the est training and the role of Werner Erhard as a leader.  \n\nAlan discusses some of his personal and professional challenges as he grapples with the abusive culture of the times and Landmarks staff culture. He shares his motivations for staying for the “mission” even when he didn’t agree with the “means”. This episode brings us right up to Alan’s leaving Landmark. In Part TWO coming later this week Alan gets into the why his leaving and his post Landmark experience. Subscribe to be notified when we post nee content. \n\nIMPORTANT CONTENT WARNING: \n\nWe invited a small audience to listen to the live recording of the following podcast/show, and some people reported being emotionally triggered during the conversation.  You will hear some stories of abuse (36min.) Some of them may be triggering. When people hear about sensitive topics, there are a variety of possible reactions. All of them are valid. \n\nWe invite you to be sensitive to your own reaction, and to pause and take your time, even speak with a trusted person if it is upsetting to you.\n\nWe ourselves are processing our own reactions, which we could not do in the moment. We invite everyone to give themselves grace as they, Confront The Line, for themselves.\n\nRESOURCES: \n\nHere is a link to the recovery group Anne mentions to support those that have worked in organizations or groups where they may have experienced hgh-control or abusive environments.  https://ilumn8.life/op/lgat-recovery-group/\n\nFor practitioners, facilitators or coaches who wish to learn more about being a SAFE practitioner check out the Safe Practitioner Workshop. https://ilumn8.life/op/safe-practitioners-workshop/",
      "release": "2024-09-10T21:52:30Z",
      "duration": "00:58:47.3650000",
      "explicit": true,
      "spotifyId": "5jHLe6kvv4sg7VNxlsF8HZ",
      "appleId": 1000669076239,
      "youTubeId": "DqowjzsYxRk",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jHLe6kvv4sg7VNxlsF8HZ",
        "apple": "https://podcasts.apple.com/podcast/e4-part-one-former-forum-leader-on-abuse-at-landmark/id1767038822?i=1000669076239",
        "youtube": "https://www.youtube.com/watch?v=DqowjzsYxRk"
      }
    },
    {
      "id": "3cb83353-ab0a-4b5b-a964-18043f4fea21",
      "title": "E1 Meet Hosts Anne L. Peterson \u0026 Mark Tafoya",
      "description": "In this show opener, Anne and Mark introduce themselves and discuss the purpose of their podcast, \u0027Confronting the Line.\u0027 They explore the concept of confronting the line between transformation and exploitation in personal development and self-help programs. Anne shares her motivation for writing her book, \u0027Is This a Cult?\u0027 and the response she received after its publication. They also touch on the history of Landmark Education (now Landmark Worldwide) and the impact of Werner Erhard (“the Source”), as well as the need for truth and informed consent in the self-help industry. In this conversation, Anne and Mark discuss their experiences as volunteers and leaders in Landmark, a personal development organization. They talk about the reasons they left Landmark and the issues they encountered, including invasion of privacy, control, and abuse. They also discuss the systemic nature of exploitation and abuse within the organization and the need for transparency and accountability. Anne and Mark emphasize the importance of individual empowerment and critical thinking when participating in personal development and wellness programs. LINKS Anne\u0027s Book https://isthisacultbook.com/ Mark episode on How Did I Get Here w/ Brian Nord https://www.youtube.com/live/Duw-msio9Ik?si=4rnrzKVh0ntEnUQB",
      "release": "2024-09-10T19:17:45Z",
      "duration": "01:01:32.1350000",
      "explicit": false,
      "spotifyId": "0qVtR8RDJY1zw6ms0ell3A",
      "appleId": 1000669067618,
      "youTubeId": "p4gMPuRM9FY",
      "subjects": [
        "Landmark",
        "Self-Help",
        "Erhard Seminars Training"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qVtR8RDJY1zw6ms0ell3A",
        "apple": "https://podcasts.apple.com/podcast/e1-meet-hosts-anne-l-peterson-mark-tafoya/id1767038822?i=1000669067618",
        "youtube": "https://www.youtube.com/watch?v=p4gMPuRM9FY"
      }
    },
    {
      "id": "2f53f87e-eaf3-43a8-b6e2-93a48fb4ef5e",
      "title": "E3 Transformational History PART 2 - Ed Gurowitz and the making of the Landmark Forum",
      "description": "In part two of this conversation between Mark and Anne, with guest Ed Gurowitz, a former est trainer \u0026 former leader, explores the evolution of the Landmark Forum personal development program. They discuss the transition from the EST training to the two-weekend forum and then to the one-weekend forum. Ed recalled how the focus of the forum shifted from ‘giving up what you\u0027re putting up with’ to ‘creating a world of possibility’. Ed also shares his experience and reasons for leaving. The conversation highlights the challenges and controversies surrounding the organization. Ed shares how the Landmark Forum drew inspiration from various sources, namely from Mind Dynamics and Scientology and repackaged ideas to create its own methodology. In fact, the use of the term \u0027technology\u0027 in Landmark, it is suggested, was chosen for its appeal to business and its association with Scientology. They also touch on the influence philosophers, like Heidegger and Maturana, had on the forum\u0027s approach. In conclusion, the evolution of the personal development field and the need for organizations to stay current is emphasized KEY TAKEAWAYS ** The Landmark Forum evolved from the EST training and went through several iterations. ** The focus of the forum shifted from giving up what you\u0027re putting up with to creating a world of possibility. ** The forum incorporated ideas from philosophers like Heidegger and Maturana, emphasizing the power of language and the perception of the world. ** Landmark Forum drew inspiration from various sources and repackaged ideas to create its own methodology. ** Ed Gurowitz, a former forum leader, left Landmark due to a combination of personal reasons and dissatisfaction with the organization\u0027s practices. ** There were controversies and legal issues surrounding Landmark, including lawsuits against former forum leaders. ** The term \u0027technology\u0027 was used in Landmark Forum\u0027s language to appeal to business and may have been influenced by Scientology. ** The conversation highlights the importance of organizations staying current and evolving with the times. ** The evolution of the field and the contextual changes in society impact the effectiveness and relevance of transformational programs. Moderation policy: Rudeness, intolerance, trolling and insults will be deleted \u0026 blocked. Be respectful.",
      "release": "2024-09-06T22:16:47Z",
      "duration": "00:58:04.5480000",
      "explicit": false,
      "spotifyId": "3uGT8n1zJaKPGLBKL2ngSR",
      "appleId": 1000668674596,
      "youTubeId": "G4teorC4JFs",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uGT8n1zJaKPGLBKL2ngSR",
        "apple": "https://podcasts.apple.com/podcast/e3-transformational-history-part-2-ed-gurowitz-and/id1767038822?i=1000668674596",
        "youtube": "https://www.youtube.com/watch?v=G4teorC4JFs"
      }
    },
    {
      "id": "f231b80d-a23b-4e40-9d13-ed42d6af04be",
      "title": "E2 Transformational History - Meet Ed Gurowitz an ORIGINAL est trainer, Werner Erhard Director\u002B",
      "description": "In this conversation, Mark and Anne discuss recent communications from Landmark and debunk the claim that they refuse to respond. They also introduce their guest, Ed Gurowitz, PD.D a psychologist who did the EST training in 1978 and in 1981 went on staff in Werner Erhard\u0027s office, traveling and working directly with Werner. They discuss the history of personal development and the importance of understanding its evolution. Ed shares his experience being one of the EST trainers, being on the \u0022Project to Recreate the Training,\u0022 which resulted in the creation of the Forum. He shares about leading one of the first Forums with Werner! He also worked at Tekniko until he left the network in 1991. The conversation covers various topics related to Werner Erhard and the Forum (becomes the Landmark Forum). Some of the main themes include Werner\u0027s role, a surprise revelation about how he avoids accountability for his own measures, the pressure to enroll people and the emphasis on registrations and money. They also discuss the importance of making a difference, the role of tools in personal development, the relationship between Landmark and the fields of psychiatry and psychology, and the reputation and impact of EST and the Landmark Forum. Key Takeaways ** Recent communications from Landmark have been misleading and false. ** Understanding the history and evolution of personal development is important for the field\u0027s growth and ethical practices. ** Ed Gurowitz shares his experience with the EST training, development of the Forum and Teknico. ** There was ALWAYS pressure to enroll people and focus on registrations and money in the Landmark organization. Werner Erhard had a pattern of avoiding accountability and getting others to do the work. **The desire to make a difference was a driving force for many people involved in the Landmark Forum. ** The Landmark Forum was seen as a tool for personal transformation, with the individual being the source of the difference they wanted to make. ** Werner’s views (per Ed) the fields of psychiatry and psychology, and there was initially respect for these fields within the Landmark community. ** EST and the Landmark Forum had a significant impact on popular culture and were subject to both praise and criticism.",
      "release": "2024-09-06T21:35:29Z",
      "duration": "00:41:22.6310000",
      "explicit": false,
      "spotifyId": "7gyAAoKYpxXvixq5oy537I",
      "appleId": 1000668666835,
      "youTubeId": "h12f7U34olI",
      "subjects": [
        "Erhard Seminars Training"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7gyAAoKYpxXvixq5oy537I",
        "apple": "https://podcasts.apple.com/podcast/e2-transformational-history-meet-ed-gurowitz-an/id1767038822?i=1000668666835",
        "youtube": "https://www.youtube.com/watch?v=h12f7U34olI"
      }
    }
  ]
}