{
  "id": "c63cb57c-c71e-4fed-8825-add8aefe3b53",
  "name": "Connected and Concerned Friends",
  "youTubeChannelId": "UCwWrCryuLBlmvjCcydtAUwg",
  "episodes": [
    {
      "id": "dcbc5a22-c767-4d98-b5fd-b857163f4f19",
      "title": "To Cult or not to Cult ",
      "description": "A conversation about going beyond labels to better uncover harm in high control religions \n\n\nJudith L Herman, MD\nTruth and Repair, 2023 \nHow trauma survivors envision justice \n\nFor \u0022Wheels\u0022 as referenced by Judith Herman (Power and Control, Equality, etc.) please visit the Duluth.org website \n\nhttps://www.theduluthm...\n\nTo follow Jody\u0027s work please visit:\n\nwww.reclaimingourspirituality.com",
      "release": "2025-10-21T02:08:03Z",
      "duration": "00:14:04",
      "explicit": false,
      "youTubeId": "j_WiAEsWsHk",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j_WiAEsWsHk"
      }
    },
    {
      "id": "228ce13a-8b94-4d6f-bac8-fa127ae36e02",
      "title": "Ep 8- Reclaiming the Body: Somatic Healing from Purity Culture with Kim Johnson",
      "description": "I’m excited to share this conversation that I had with Kim Johnson, a somatic practitioner. Kim shares a bit of her own story and experience in high-control religion and purity culture and helps us to re-frame how we see our relationship with our bodies, our emotions, and our authentic selves. She brings an Eastern lens to her work which provides a holistic view of human development and sees our emotions and bodies as important parts of our selves, not separate from our spirituality.  I love that Kim shared so many small, practical things we can do to help ourselves reconnect. She shared several resources and a short embodiment practice at the end of the video.  I appreciated her gentle teaching and I hope you will too.\n\nLink to many resources on healing, how to find Kim, and additional notes: https://docs.google.com/document/d/1nD7S2_tfCNS3coxQjFA1w30S11PhOef6zyP_tL_A2so/edit?usp=sharing",
      "release": "2025-09-18T22:51:05Z",
      "duration": "00:58:23",
      "explicit": false,
      "youTubeId": "6mpEnLQu5iA",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6mpEnLQu5iA"
      }
    },
    {
      "id": "621a34db-9b37-4842-8975-6f558f39193b",
      "title": "Conversation with Dr Janja Lalich, cult researcher ",
      "description": "I was made aware of the work of Dr Janja Lalich through the \u0022Soul Bruises\u0022 poscast produced by a friend of mine, Christie Hodson.  Dr Lalich has been studying cults for over 40 years.  While the use of the term \u0022cult\u0022 to refer to the 2x2 church is controversial it feels like a conversation that needs to take place.  I recently had to opportunity to have a conversation with Dr Laliach.  We started talking about the struggle a number of us have to reconcile the harm done within the 2x2 church, to ourselves and others, and the positive aspects of it.  We then transition into other areas.  The last two years I have become increasingly aware of the great harm done to many (if not all) of us connected to the church.  This conversation is a direct look at some of that harm and may be quite hurtful to some who still find meaning and value in the church.\n\nMark Simmons\n\n[While this video is posted on the CCF site the views expressed are solely those of Dr Lalich and myself. This video is not intended to reflect the views of the CCF community and moderators.]",
      "release": "2025-08-10T23:50:46Z",
      "duration": "00:49:50",
      "explicit": false,
      "youTubeId": "bHcFUle6MKA",
      "subjects": [
        "Cult-Expert",
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bHcFUle6MKA"
      }
    }
  ]
}