{
  "id": "c82b9fd9-6a2c-4589-9ec0-b60149ccc2fb",
  "name": "Conservative Pollyana",
  "youTubeChannelId": "UC49wYqhQQBFZlvmZWSDQWqg",
  "episodes": [
    {
      "id": "72ab30ad-46c0-49db-ab5a-0ff2736bb16d",
      "title": "Officer REFUSES to Investigate Human Trafficking \u0026 Sexual Assault Claims",
      "description": "\u0022It\u0027s Not Criminal\u0022: Surrey Police Dismisses Human Trafficking Report in Real Time\n\n\nIn this real phone call to Surrey Police (BC, Canada), I report serious allegations of human trafficking involving sexual assault. Instead of listening or taking a report, the officer repeatedly deflects, minimizes, and insists \u0022it\u0027s not a criminal matter\u0022 refusing to take me seriously or investigate.\n\nThis is a prime example of institutional gaslighting, silencing victims, and circumnavigating reality to avoid accountability. \n\nWatch in disbelief as every concern is beaten around the bush and dismissed outright. \n\nTrigger warning: Victim silencing, minimization of sexual assault/trafficking.\n\nShare if you\u0027ve experienced similar institutional failure. Victims deserve to be heard.\n\n\n #HumanTrafficking #VictimSilencing #SurreyPolice",
      "release": "2025-12-14T18:41:01Z",
      "duration": "00:15:39",
      "explicit": false,
      "youTubeId": "ZmH0jyWXkqE",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZmH0jyWXkqE"
      }
    },
    {
      "id": "b91b8cc4-ab8f-4afc-92e0-2df10f8e8513",
      "title": "John Volken Academy Uncovered: From Synanon to Scam",
      "description": "Please take 11 minutes to watch this video about the John Volken Academy. Yes, there are a couple of small caption errors (blame the software, not me!). I’m not a pro editor...just a regular person who got hurt there and met many others who did too. I made this so fewer people have to go through what we did.\n\nhttps://www.change.org/johnvolkenacademy",
      "release": "2025-12-07T04:25:35Z",
      "duration": "00:10:58",
      "explicit": false,
      "youTubeId": "sbtgvuLadPQ",
      "subjects": [
        "Synanon",
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sbtgvuLadPQ"
      }
    },
    {
      "id": "2042b2ae-7191-48bd-b6ea-83867c196328",
      "title": "Licensed Psychologist Speaks Out on Relative’s Mistreatment at John Volken Academy",
      "description": "I’m posting this raw unfiltered testimony now because I am beyond frustrated...this issue has been ignored for far too long.  What you just heard is the reality of what happened at the John Volken Academy, and still, no meaningful action has been taken.  \n\n𝙵𝚘𝚛𝚌𝚎𝚍 𝚞𝚗𝚍𝚛𝚎𝚜𝚜𝚒𝚗𝚐 𝚊𝚜 𝚙𝚞𝚗𝚒𝚜𝚑𝚖𝚎𝚗𝚝(~0:00–0:38)\nThe psychologist describes how her relative was forced to undress in front of others as a form of humiliation and control at John Volken Academy\u0027s location in Kent, Washington during the height of the Pandemic.\n\n𝙳𝚎𝚗𝚒𝚊𝚕 𝚘𝚏 𝙲𝙾𝚅𝙸𝙳 𝚟𝚊𝚌𝚌𝚒𝚗𝚎 𝚍𝚎𝚜𝚙𝚒𝚝𝚎 𝚊𝚜𝚝𝚑𝚖𝚊 (~0:38–2:08)\nDespite having asthma and multiple formal complaints filed with health departments, her relative was repeatedly denied access to the COVID vaccine by the program until they finally caved. \n\n𝙸𝚖𝚖𝚎𝚍𝚒𝚊𝚝𝚎 𝚎𝚝𝚑𝚒𝚌𝚊𝚕 𝚛𝚎𝚍 𝚏𝚕𝚊𝚐𝚜(~0:00–0:38)\nAs a licensed psychologist, she recognized from the very first contact that the program’s methods were fundamentally unethical and harmful to her relative.\n\n𝙼𝚊𝚗𝚒𝚙𝚞𝚕𝚊𝚝𝚒𝚘𝚗 𝚘𝚏 𝚏𝚊𝚖𝚒𝚕𝚒𝚎𝚜 𝚝𝚘 𝚙𝚛𝚎𝚟𝚎𝚗𝚝 𝚛𝚎𝚜𝚒𝚍𝚎𝚗𝚝𝚜 𝚏𝚛𝚘𝚖 𝚕𝚎𝚊𝚟𝚒𝚗𝚐 (~2:16–3:00)\nFamily support groups (run by someone named Kristie) actively trained relatives not to help residents leave. Families were instructed to withhold resources, money, or support from anyone trying to exit and to “hold the line.”\n\n𝚂𝚑𝚊𝚖𝚎-𝚋𝚊𝚜𝚎𝚍, 𝚝𝚘𝚡𝚒𝚌 “𝚝𝚑𝚎𝚛𝚊𝚙𝚢” (~3:04–5:15)\nThe program relied heavily on public shaming and humiliation rather than healing. Even accidental mistakes triggered severe consequences and yelling. During a visit, the psychologist personally witnessed a “consequence board” and enforced speaking bans—clear evidence of shame-driven control instead of legitimate therapy.\n\n𝚄𝚗𝚙𝚊𝚒𝚍 𝚕𝚊𝚋𝚘𝚛 𝚒𝚗𝚜𝚝𝚎𝚊𝚍 𝚘𝚏 𝚝𝚛𝚎𝚊𝚝𝚖𝚎𝚗𝚝(~5:19–6:10)\nHer relative received essentially zero therapy. Instead, he spent his days performing unpaid manual labor—driving trucks and doing furniture deliveries—while others attended groups. Discipline was enforced through coercion and fear. Promises of schooling or educational opportunities were consistently lied about and never provided.\n\n𝙿𝚛𝚎𝚟𝚎𝚗𝚝𝚎𝚍 𝚏𝚛𝚘𝚖 𝚐𝚛𝚊𝚍𝚞𝚊𝚝𝚒𝚗𝚐 𝚘𝚛 𝚕𝚎𝚊𝚟𝚒𝚗𝚐 (~6:16–7:57)\nAfter two years, her relative desperately wanted to complete the program, but staff kept arbitrarily delaying his graduation date for no legitimate reason. As enrollment declined, the program needed male residents for labor and refused to release them. He ultimately had to escape by walking off campus and running away.\n\n𝙵𝚒𝚗𝚊𝚗𝚌𝚒𝚊𝚕 𝚙𝚎𝚗𝚊𝚕𝚝𝚒𝚎𝚜 𝚏𝚘𝚛 𝚛𝚎𝚕𝚊𝚙𝚜𝚎𝚜 𝚘𝚛 𝚖𝚒𝚜𝚝𝚊𝚔𝚎𝚜(~8:00)\nAny relapse or mistake resulted in residents being forced to pay fines or additional money to the program.\n\n𝙳𝚒𝚜𝚊𝚙𝚙𝚎𝚊𝚛𝚒𝚗𝚐 𝚗𝚎𝚠𝚜 𝚊𝚛𝚝𝚒𝚌𝚕𝚎𝚜 𝚊𝚋𝚘𝚞𝚝 𝚝𝚑𝚎 𝙲𝚊𝚗𝚊𝚍𝚒𝚊𝚗 𝚜𝚌𝚊𝚗𝚍𝚊𝚕(~8:17)\nNewspaper articles exposing the program’s abuses in Canada were mysteriously being removed from the internet.\n\n𝙴𝚟𝚊𝚍𝚒𝚗𝚐 𝚛𝚎𝚐𝚞𝚕𝚊𝚝𝚒𝚘𝚗 𝚊𝚗𝚍 𝚘𝚟𝚎𝚛𝚜𝚒𝚐𝚑𝚝(~8:29–10:12)\nThe owner deliberately avoids registering the facility as a mental health or treatment center (which would require licensing, strict standards, regular audits, and accountability). By classifying it differently, the program operates with far fewer rules and little external oversight.",
      "release": "2025-12-05T20:21:31Z",
      "duration": "00:11:32",
      "explicit": false,
      "youTubeId": "FZzDnfdDgyc",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FZzDnfdDgyc"
      }
    }
  ]
}