{
  "id": "c82b9fd9-6a2c-4589-9ec0-b60149ccc2fb",
  "name": "Conservative Pollyana",
  "youTubeChannelId": "UC49wYqhQQBFZlvmZWSDQWqg",
  "episodes": [
    {
      "id": "469ba2c7-2d85-4609-8fa1-4f7dd1e42203",
      "title": "Exposing American Addiction Centers: Families Speak Out",
      "description": "Share this with anyone who has been to American Addiction Centers (AAC) or knows someone who has. This video only begins to touch the immense grief and harm caused.\n\nWatch in a quiet space because this content is disturbing. It provides a brief overview of the manipulative practices AAC uses, including deceptive advertising and failure to deliver promised care.\n\n0:00 Shocking Neglect: 14.5 Hours Alone\nDramatic opening testimony reveals how a patient was left completely unattended for 14.5 hours overnight with no vital signs checks, no monitoring, and no staff intervention revealing the dangerous gaps in care and the disappearance of key surveillance footage that should have documented the events.\n\n1:00 Inside AAC: The Profit-Driven Nightmare\nAn introduction to American Addiction Centers (AAC) as a large nationwide chain, including major facilities like River Oaks in Florida and loosely affiliated offsite halfway houses and sober living placements, where oversight is often minimal and profit motives appear to override patient safety.\n\n2:00 Honoring the Lost: Names You Need to Know\nA solemn roll call of individuals reported to have died on AAC premises or shortly after discharge due to alleged care failures, including Stone Galloway, Joe Nicolos, Jean Graham Hill, Sean Rena, Connor Johnson, Cody Arbuckle, and others representing at least 50 preventable deaths families have documented in the petition.\n\n3:00 The Petition Ignites: Patterns of Failure\nClelia Jane Sheppard\u0027s Change.org petition calls for formal investigations by The Joint Commission, Florida regulators, SAMHSA, and federal authorities, citing repeated patterns: unsecured campuses allowing drugs to enter freely, heavy reliance on 911 instead of internal medical response, abrupt discharges without support, and corporate tactics like name changes, bankruptcies, and shell entities to avoid accountability.\n\n4:30 Cody\u0027s Heartbreaking Story – Betrayed \u0026 Abandoned\nThe central case of Cody Arbuckle: after being harassed throughout the day, pleading for help through a window, and being isolated in detox by management, he was found dead the next morning having been left alone for 14.5 hours with zero checks or monitoring, despite families being promised constant supervision and safety.\n\n6:00 River Oaks Exposed: Overdoses \u0026 433 Emergency Calls\nDuring the height of the fentanyl crisis, River Oaks saw multiple overdoses in short time frames, drugs smuggled onto campus, spiked drinks, and delayed recognition of medical emergencies. Public records document 433 calls to 911 in just the facility\u0027s first two years often occurring at night, on weekends, and holidays when on-site leadership was not present turning emergency response into a routine rather than prevention.\n\n\n7:30 Attorney Drops Truth: Kickbacks \u0026 The Florida Shuffle\nTampa attorney Jack Gordon provides detailed insight into offsite locations using separate LLCs for corporate separation, commission structures that incentivized admissions over care, kickbacks in the \u0022body brokering\u0022 model, and the \u0022Florida Shuffle\u0022 a cycle where patients are moved through levels of treatment, discharged when insurance runs out, and readmitted upon relapse to generate more billing.\n\n9:00 Hidden Horrors: Abuse, Overbilling \u0026 Corporate Cover-Ups\nAdditional allegations include excessive urine drug testing billed at extreme markups, exploitation of ACA subsidies through overbilling, use of NDAs to silence complaints, rebranding and shell companies to evade scrutiny, and reports of serious abuse (including a case involving a minor at an offsite location). AAC has publicly denied wrongdoing, but families maintain that denial does not equal real accountability.\n\n10:30 Demand Justice – Sign the Petition Now\nA powerful call to action: viewers are urged to sign and share Clelia Jane Sheppard\u0027s petition, pressure regulators for transparency and reform, and research any treatment facility carefully—asking tough questions about safety protocols because recovery should never become a profit-driven system built on preventable loss and human suffering\n\nThe full interview with J. Esquire is available under “Florida Lawyer Discusses Addiction Treatment Industry.”\n\n\nToo many families and individuals searching for help end up exploited by people addicted to money rather than committed to recovery.\n\nThere are those who circle your pain, not to help, but to profit, like predators in the tide.  Not everyone is a friend...some feed on your suffering $$$\n\nSpecial thanks to my mother for lending her voice to this narration.",
      "release": "2026-01-17T23:36:54Z",
      "duration": "00:09:36",
      "explicit": false,
      "youTubeId": "M_Qy97htH_k",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=M_Qy97htH_k"
      }
    },
    {
      "id": "2ede12c4-cfef-4f00-976c-23cb4412c68d",
      "title": "American Addiction Centers: Rehab Industry Exposed by Florida Lawyer",
      "description": "EXPOSED: What a Florida Lawyer Really Thinks About the Addiction Treatment Industry \u0026 American Addiction Centers \n\nIn this raw phone call from 2023, I spoke with a seasoned litigation specialist who\u0027s sued rehab facilities like River Oaks (part of American Addiction Centers - AAC) for years. \n\nHe pulls no punches: Hotline \u0022experts\u0022 are often just salespeople with financial incentives to fill beds (they changed this after one of his lawsuits!).\nMany facilities deliberately stay unregulated to avoid medical standards, staffing requirements, and real oversight.\nPatients in crisis (like fentanyl withdrawal or severe mental health episodes) are flown across the country, away from family — not for \u0022triggers,\u0022 but to isolate them from anyone who might pull them out.\n\n\nTragic stories: Destroyed surveillance video in the Graham Hill case, preventable deaths (like Stone Galloway \u0026 others), underqualified staff, and a business model that prioritizes profit over lives.\n\nFake accreditations, paid reviews, and structures designed to maximize billing while minimizing care.\n\nHe says the vast majority of these places are \u0022bad\u0022 and \u0022all about the money.\u0022 Real change comes from lawsuits forcing policy shifts and lobbying legislators for better regulation... not petitions alone.\n\nThis isn\u0027t just my story.   It\u0027s an industry-wide issue backed by lawsuits, investigations, and heartbreaking losses. \n\nIf you\u0027ve been affected by AAC or similar facilities, share below. We need accountability.\n\nSign \u0026 share the petition to investigate AAC: \n\nhttps://www.change.org/p/investigate-american-addiction-centers-preventable-deaths-overdoses#addictiontreatment \n\n\n #RehabExposed #AmericanAddictionCenters #RiverOaks #PatientSafety #FollowTheMoney #MentalHealth #Recovery",
      "release": "2026-01-04T18:50:05Z",
      "duration": "00:37:13",
      "explicit": false,
      "youTubeId": "GPPSQgDmmjU",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GPPSQgDmmjU"
      }
    },
    {
      "id": "72ab30ad-46c0-49db-ab5a-0ff2736bb16d",
      "title": "Officer REFUSES to Investigate Human Trafficking \u0026 Sexual Assault Claims",
      "description": "\u0022It\u0027s Not Criminal\u0022: Surrey Police Dismisses Human Trafficking Report in Real Time\n\n\nIn this real phone call to Surrey Police (BC, Canada), I report serious allegations of human trafficking involving sexual assault. Instead of listening or taking a report, the officer repeatedly deflects, minimizes, and insists \u0022it\u0027s not a criminal matter\u0022 refusing to take me seriously or investigate.\n\nThis is a prime example of institutional gaslighting, silencing victims, and circumnavigating reality to avoid accountability. \n\nWatch in disbelief as every concern is beaten around the bush and dismissed outright. \n\nTrigger warning: Victim silencing, minimization of sexual assault/trafficking.\n\nShare if you\u0027ve experienced similar institutional failure. Victims deserve to be heard.\n\n\n #HumanTrafficking #VictimSilencing #SurreyPolice",
      "release": "2025-12-14T18:41:01Z",
      "duration": "00:15:39",
      "explicit": false,
      "youTubeId": "ZmH0jyWXkqE",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZmH0jyWXkqE"
      }
    },
    {
      "id": "b91b8cc4-ab8f-4afc-92e0-2df10f8e8513",
      "title": "John Volken Academy Uncovered: From Synanon to Scam",
      "description": "Please take 11 minutes to watch this video about the John Volken Academy. Yes, there are a couple of small caption errors (blame the software, not me!). I’m not a pro editor...just a regular person who got hurt there and met many others who did too. I made this so fewer people have to go through what we did.\n\nhttps://www.change.org/johnvolkenacademy",
      "release": "2025-12-07T04:25:35Z",
      "duration": "00:10:58",
      "explicit": false,
      "youTubeId": "sbtgvuLadPQ",
      "subjects": [
        "Synanon",
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sbtgvuLadPQ"
      }
    },
    {
      "id": "2042b2ae-7191-48bd-b6ea-83867c196328",
      "title": "Licensed Psychologist Speaks Out on Relative’s Mistreatment at John Volken Academy",
      "description": "I’m posting this raw unfiltered testimony now because I am beyond frustrated...this issue has been ignored for far too long.  What you just heard is the reality of what happened at the John Volken Academy, and still, no meaningful action has been taken.  \n\n𝙵𝚘𝚛𝚌𝚎𝚍 𝚞𝚗𝚍𝚛𝚎𝚜𝚜𝚒𝚗𝚐 𝚊𝚜 𝚙𝚞𝚗𝚒𝚜𝚑𝚖𝚎𝚗𝚝(~0:00–0:38)\nThe psychologist describes how her relative was forced to undress in front of others as a form of humiliation and control at John Volken Academy\u0027s location in Kent, Washington during the height of the Pandemic.\n\n𝙳𝚎𝚗𝚒𝚊𝚕 𝚘𝚏 𝙲𝙾𝚅𝙸𝙳 𝚟𝚊𝚌𝚌𝚒𝚗𝚎 𝚍𝚎𝚜𝚙𝚒𝚝𝚎 𝚊𝚜𝚝𝚑𝚖𝚊 (~0:38–2:08)\nDespite having asthma and multiple formal complaints filed with health departments, her relative was repeatedly denied access to the COVID vaccine by the program until they finally caved. \n\n𝙸𝚖𝚖𝚎𝚍𝚒𝚊𝚝𝚎 𝚎𝚝𝚑𝚒𝚌𝚊𝚕 𝚛𝚎𝚍 𝚏𝚕𝚊𝚐𝚜(~0:00–0:38)\nAs a licensed psychologist, she recognized from the very first contact that the program’s methods were fundamentally unethical and harmful to her relative.\n\n𝙼𝚊𝚗𝚒𝚙𝚞𝚕𝚊𝚝𝚒𝚘𝚗 𝚘𝚏 𝚏𝚊𝚖𝚒𝚕𝚒𝚎𝚜 𝚝𝚘 𝚙𝚛𝚎𝚟𝚎𝚗𝚝 𝚛𝚎𝚜𝚒𝚍𝚎𝚗𝚝𝚜 𝚏𝚛𝚘𝚖 𝚕𝚎𝚊𝚟𝚒𝚗𝚐 (~2:16–3:00)\nFamily support groups (run by someone named Kristie) actively trained relatives not to help residents leave. Families were instructed to withhold resources, money, or support from anyone trying to exit and to “hold the line.”\n\n𝚂𝚑𝚊𝚖𝚎-𝚋𝚊𝚜𝚎𝚍, 𝚝𝚘𝚡𝚒𝚌 “𝚝𝚑𝚎𝚛𝚊𝚙𝚢” (~3:04–5:15)\nThe program relied heavily on public shaming and humiliation rather than healing. Even accidental mistakes triggered severe consequences and yelling. During a visit, the psychologist personally witnessed a “consequence board” and enforced speaking bans—clear evidence of shame-driven control instead of legitimate therapy.\n\n𝚄𝚗𝚙𝚊𝚒𝚍 𝚕𝚊𝚋𝚘𝚛 𝚒𝚗𝚜𝚝𝚎𝚊𝚍 𝚘𝚏 𝚝𝚛𝚎𝚊𝚝𝚖𝚎𝚗𝚝(~5:19–6:10)\nHer relative received essentially zero therapy. Instead, he spent his days performing unpaid manual labor—driving trucks and doing furniture deliveries—while others attended groups. Discipline was enforced through coercion and fear. Promises of schooling or educational opportunities were consistently lied about and never provided.\n\n𝙿𝚛𝚎𝚟𝚎𝚗𝚝𝚎𝚍 𝚏𝚛𝚘𝚖 𝚐𝚛𝚊𝚍𝚞𝚊𝚝𝚒𝚗𝚐 𝚘𝚛 𝚕𝚎𝚊𝚟𝚒𝚗𝚐 (~6:16–7:57)\nAfter two years, her relative desperately wanted to complete the program, but staff kept arbitrarily delaying his graduation date for no legitimate reason. As enrollment declined, the program needed male residents for labor and refused to release them. He ultimately had to escape by walking off campus and running away.\n\n𝙵𝚒𝚗𝚊𝚗𝚌𝚒𝚊𝚕 𝚙𝚎𝚗𝚊𝚕𝚝𝚒𝚎𝚜 𝚏𝚘𝚛 𝚛𝚎𝚕𝚊𝚙𝚜𝚎𝚜 𝚘𝚛 𝚖𝚒𝚜𝚝𝚊𝚔𝚎𝚜(~8:00)\nAny relapse or mistake resulted in residents being forced to pay fines or additional money to the program.\n\n𝙳𝚒𝚜𝚊𝚙𝚙𝚎𝚊𝚛𝚒𝚗𝚐 𝚗𝚎𝚠𝚜 𝚊𝚛𝚝𝚒𝚌𝚕𝚎𝚜 𝚊𝚋𝚘𝚞𝚝 𝚝𝚑𝚎 𝙲𝚊𝚗𝚊𝚍𝚒𝚊𝚗 𝚜𝚌𝚊𝚗𝚍𝚊𝚕(~8:17)\nNewspaper articles exposing the program’s abuses in Canada were mysteriously being removed from the internet.\n\n𝙴𝚟𝚊𝚍𝚒𝚗𝚐 𝚛𝚎𝚐𝚞𝚕𝚊𝚝𝚒𝚘𝚗 𝚊𝚗𝚍 𝚘𝚟𝚎𝚛𝚜𝚒𝚐𝚑𝚝(~8:29–10:12)\nThe owner deliberately avoids registering the facility as a mental health or treatment center (which would require licensing, strict standards, regular audits, and accountability). By classifying it differently, the program operates with far fewer rules and little external oversight.",
      "release": "2025-12-05T20:21:31Z",
      "duration": "00:11:32",
      "explicit": false,
      "youTubeId": "FZzDnfdDgyc",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FZzDnfdDgyc"
      }
    }
  ]
}