{
  "id": "54ab0081-9a79-4165-845e-8d26d6040b49",
  "name": "consaboraKaFé",
  "youTubeChannelId": "UCMdMsoEnC179EVYfcqNPUlA",
  "episodes": [
    {
      "id": "db98d344-980e-4159-90ff-7ea116e27b6a",
      "title": "Escapó de una Secta Judía",
      "description": "Yisrael Amir, de 19 años, escapó de una secta judía Lev Tahor en Guatemala.\n\n #casos #coffeeandcrime #truecrimeenespañol \n\n📌 Si quieres recomendarme un caso, hazlo aquí https://forms.gle/ZJRhWGaQXS9p6h1XA\n\n✦ PR Inquiries:  consaborakafe@gmail.com\n\n✦ Instagram: http://instagram.com/consaborakafe \n\n✦ FaceBook: https://www.facebook.com/consaboraKaFe\n\n✦ Favoritos de AMAZON: https://www.amazon.com/shop/consaborakafe\n\n\n\n\n\n\n\n\n\n\n⚠️ Descargo de Responsabilidad: Toda la información expuesta es de dominio \npúblico.  Este video ha sido creado para dar a conocer el caso, víctimas involucradas o información correspondiente. Si existe alguna información errada pueden contactarme a consaborakafe@gmail.com. No se publica información falsa de manera intencional ni hacemos investigaciones adicionales para esclarecer hechos que no han sido resueltos o expuestos de manera oficial y pública. Sólo y únicamente recopilamos datos públicos e información de medios de comunicación para compartirla en un video.\n\n⚠️ COPYRIGHT DISCLAIMER \nCOPYRIGHT DISCLAIMER UNDER SECTION 107 OF THE COPYRIGHT ACT 1976\nCopyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \u0022fair use\u0022 for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.",
      "release": "2025-01-19T22:31:37Z",
      "duration": "00:12:25",
      "explicit": false,
      "youTubeId": "K7b-NVYQBBA",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K7b-NVYQBBA"
      }
    }
  ]
}