{
  "id": "fbe98c27-ae26-4cb7-97ef-bfa1717a2e36",
  "name": "Conversations",
  "spotifyId": "362DwZBa01YuXx5LeK8Psp",
  "appleId": 94688506,
  "youTubeChannelId": "UC5iLnYoF4Ryb63YdGD9RfWQ",
  "youTubePlaylistId": "PL7HSPnTFVAuHjNTkr2naAVlLChuGdVIA5",
  "episodes": [
    {
      "id": "f3478e82-df7d-4e6c-ba7c-ec318c9576b7",
      "title": "The Rajneeshees and me — why Martina thought she needed a guru to heal",
      "description": "Cult survivor and psychotherapist Dr Martina Zangger on her ten years devoted to an Indian mystic and how she learned to stand on her own two feet.\nWhen Martina Zangger was 19 years old she became a devotee of the Rajneeshee Movement led by the Guru, Bhagwan.\nThe cult had its headquarters in a huge ashram, built in rural Oregon, and Martina decided she needed to go there to be closer to Rajneesh to find the healing she desperately needed.\nShe became a sex worker to fund her journey there from Sydney.\nIn the ashram, Bhagwan directed his thousands of followers to wear purple clothing, work for him for free, and avoid monogamy.\nThen one day, Bhagwan suddenly disappeared on a Lear jet taking his collection of diamond-encrusted watches with him.\nMartina was left to make a life for herself back in the regular world and to slowly confront the childhood trauma that had led her to join the Rajneeshees in the first place.\nNot My Shame is published by Ventura Press.\nThis episode of Conversations was produced by Meggie Morris, executive producer is Nicola Harrison.\nIt explores religion, spirituality, spiritual seeking, trauma, childhood abuse, sexual abuse, Osho, Rajneesh, Pune, India, Oregon, Ashram, meditation, cults, healing, immigration, therapy, self confidence, self worth, motherhood, perinatal psychosis, mental health, psychotherapy, psychology, relationship, monogamy, parenting, mothers of daughters, social work, social justice, Wild Wild Country, Netflix, Bhagwan Shree Rajneesh, guru, mystic, philosophy, spiritual bypassing.\nTo binge even more great episodes of the Conversations podcast with Richard Fidler and Sarah Kanowski go the ABC listen app (Australia) or wherever you get your podcasts. There you’ll find hundreds of the best thought-provoking interviews with authors, writers, artists, politicians, psychologists, musicians, and celebrities.",
      "release": "2025-12-09T00:00:00Z",
      "duration": "00:53:00",
      "explicit": false,
      "spotifyId": "2uMzrj1iLNgbdNYxWUDW8x",
      "appleId": 1000740323192,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2uMzrj1iLNgbdNYxWUDW8x",
        "apple": "https://podcasts.apple.com/podcast/the-rajneeshees-and-me-why-martina-thought-she/id94688506?i=1000740323192"
      }
    },
    {
      "id": "adde3598-b139-484f-a125-7a800c05c077",
      "title": "How I became a brainwashed cult bride",
      "description": "Liz Cameron was 18 years old when a stranger approached her in a book shop. It was the beginning of her induction into a cult, and it was an experience Liz barely survived. The process of brainwashing happened gradually, first came the love-bombing and the allure of finding a new purpose in life. Then came the isolation from friends and family, along with sleep deprivation, overwork and sexual manipulation. Liz was one of the many women chosen to become a kind of bride for the leader of an infamous Korean religious group. It wasn’t until she became critically ill, that her family were able to get the help she needed to escape and to begin the process of being deprogrammed. Liz Cameron’s memoir is called Cult Bride: How I was brainwashed and how I broke free. Find out more about the Conversations Live National Tour on the ABC website. Conversations\u0027 Executive Producer is Nicola Harrison. This episode was produced by Jennifer Leake. This episode of Conversations touches on cults, brainwashing, religious groups, eating disorders, sexual manipulation, deprogramming, sexual assault, sleep deprivation, family, recovery, healing, trauma, biography, psychology, Providence, JMS, Jesus Morning Star, Pastor Joshua, Jung Myung-seok. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-06-24T01:00:00Z",
      "duration": "00:54:02.3180000",
      "explicit": false,
      "appleId": 1000714274598,
      "subjects": [
        "Providence",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/how-i-became-a-brainwashed-cult-bride/id94688506?i=1000714274598"
      }
    }
  ]
}