{
  "_ts": 0,
  "id": "0087f921-cbb6-4e96-beb8-34ccb64095ad",
  "name": "Conversations with Rich Bennett",
  "spotifyId": "667AGuzAahAnNTLUElH5M8",
  "appleId": 1112605924,
  "episodes": [
    {
      "id": "9f7a20df-164f-465d-9a65-18ab7fd45c1e",
      "title": "Tammy Cox on Healing Childhood Trauma to Build Stronger Love",
      "description": "Sponsored by Serenity Salt Spa In this episode of Conversations with Rich Bennett, I sit down with Tammy Cox, a Transformational Coach who helps women heal unresolved childhood trauma to rebuild their relationships and rediscover their true selves. Tammy shares her personal journey, growing up in a deeply religious and restrictive environment, and how breaking free from past pain led her to embrace healing through spirituality, metaphysics, and science. We dive into the impact of childhood trauma on relationships, why self-healing is essential for emotional intimacy, and how understanding the beliefs we form in our early years can unlock personal transformation. Tammy also reveals the unique approach she takes in her coaching, including inner child work and subconscious healing techniques, to help women break toxic relationship cycles and cultivate lasting love. Whether you\u0027re navigating a relationship challenge, struggling with past wounds, or seeking a new path to self-discovery, this episode is packed with insights that will leave you inspired. Sponsor Shoutout: Serenity Salt Spa – your go-to place for ultimate relaxation and healing. Book your session today at SerenitySaltSpa.net or call 443-640-6020. tammycox | Twitter, Instagram, Facebook, TikTok | Linktree Sponsor Message: This episode of Conversations with Rich Bennett is brought to you by Serenity Salt Spa, the ultimate destination for relaxation and rejuvenation. Need a break from the stress of daily life? Step into Serenity Salt Spa and experience the healing power of salt therapy, designed to clear your mind, refresh your body, and help you breathe easier. Whether you’re lo Send us a text Serenity Salt Spa Serenity Salt Spa is the 1st Himalayan Salt Therapy \u0026 Wellness Spa to come to Harford County, Maryla Disclaimer: This post contains affiliate links. If you make a purchase, I may receive a commission at no extra cost to you. Support the show Follow the Conversations with Rich Bennett podcast on Social Media: Facebook – Conversations with Rich Bennett \u0026 Harford County Living Facebook Group (Join the conversation) – Conversations with Rich Bennett podcast group | Facebook Twitter – Conversations with Rich Bennett \u0026 Harford County Living Instagram – Harford County Living TikTok – CWRB (@conversationsrichbennett) | TikTok Sponsors, Affiliates, and ways we pay the bills: Recorded at the Freedom Federal Credit Union Studios Hosted on Buzzsprout Rocketbook SquadCast Contests \u0026 Giveaways Subscribe by Email ...",
      "release": "2025-02-07T05:00:00Z",
      "duration": "01:09:05.1620000",
      "explicit": false,
      "spotifyId": "22fxlTY0r4qGzPOL9JVYum",
      "appleId": 1000689855017,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22fxlTY0r4qGzPOL9JVYum",
        "apple": "https://podcasts.apple.com/podcast/tammy-cox-on-healing-childhood-trauma-to-build-stronger/id1112605924?i=1000689855017"
      }
    },
    {
      "id": "423c220c-3180-4c9e-8425-719cebcc72ca",
      "title": "Empowering Abuse Survivors: Ashley Easter on 30 Days of Courage",
      "description": "In this episode of Conversations with Rich Bennett, Rich talks with Ashley Easter, founder of Courage 365, about the upcoming 30 Days of Courage event. Ashley shares her personal journey of breaking free from a cult-like environment and how she transformed her experience into a platform for empowering abuse survivors. They discuss the event\u0027s lineup of speakers, self-care challenges, and support groups, all designed to offer education and community for those on a healing journey. This episode is sponsored by Courage 365, a nonprofit supporting survivors year-round. 30 Days of Courage — Courage 365 Sponsor Message: This episode is brought to you by Courage 365, a nonprofit dedicated to empowering abuse survivors. Courage 365 offers resources, community support, and events like the 30 Days of Courage, which features expert speakers, self-care challenges, and peer support groups to help survivors on their healing journey. Whether you\u0027re seeking understanding, community, or tools to rebuild your life, Courage 365 is here to provide support 365 days a year. Learn more or get involved at Courage365.org . Send us a text Courage 365 Ending Abuse. Empowering Lives. Courage 365 is here for you, empowering survivors and advocates ali Disclaimer: This post contains affiliate links. If you make a purchase, I may receive a commission at no extra cost to you. Support the show Follow the Conversations with Rich Bennett podcast on Social Media: Facebook – Conversations with Rich Bennett \u0026 Harford County Living Facebook Group (Join the conversation) – Conversations with Rich Bennett podcast group | Facebook Twitter – Conversations with Rich Bennett \u0026 Harford County Living Instagram – Harford County Living TikTok – CWRB (@conversationsrichbennett) | TikTok Sponsors, Affiliates, and ways we pay the bills: Recorded at the Freedom Federal Credit Union Studios Hosted on Buzzsprout Rocketbook SquadCast Contests \u0026 Giveaways Subscribe by Email ...",
      "release": "2024-09-23T04:00:00Z",
      "duration": "00:37:33.6880000",
      "explicit": false,
      "spotifyId": "1o3L6cCpChJ5USE0lxOD8O",
      "appleId": 1000670351379,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1o3L6cCpChJ5USE0lxOD8O",
        "apple": "https://podcasts.apple.com/podcast/empowering-abuse-survivors-ashley-easter-on-30-days/id1112605924?i=1000670351379"
      }
    }
  ]
}