{
  "id": "bec1d84e-45c9-4e8f-ae80-69d125642edf",
  "name": "Conway Hall",
  "youTubeChannelId": "UCCMmisrnuUMD4eMsG9IOtUw",
  "episodes": [
    {
      "id": "8c6c7b7c-0455-427f-aba0-fe044883b5bf",
      "title": "London Thinks: What Has Scientology Got To Hide? (at Conway Hall)",
      "description": "To find out more about Conway Hall and its events, to become a member or to donate: https://conwayhall.org.uk  •  Please subscribe to our channel, too.\n\n--\n\n[This debate was filmed at Conway Hall, London, in 2015]\n\nThe Church of Scientology has a problem with free speech, according to three speakers who have dared to question the Church’s self-certification of itself as a religion and the claim made by its apostles, Tom Cruise and John Travolta, that it is a force for good. [We contacted the London branch of the Church of Scientology to send a representative, but did not get a reply from them.]\n\nUS journalist Tony Ortega, author of an acclaimed biography, The Unbreakable Miss Lovely: How the Church of Scientology tried to destroy Paulette Cooper, John Sweeney, the BBC Panorama journalist and author of The Church Of Fear: Inside the Weird World of Scientology and the publisher of both books, Humfrey Hunter, explain what it is like to question the word and the worth of the Church that likes to wear dark glasses.\n\nTony Ortega has written about Scientology as a journalist for nearly 20 years, and began working with Paulette Cooper about her life story while he was still at the Voice. Ortega appears in Alex Gibney’s HBO-produced documentary about Scientology, Going Clear, which premiered at the Sundance Film Festival.\n\nJohn Sweeney is a writer and journalist. His philosophy as a reporter is: ‘I poke crocodiles, if crocodiles they be, in the eye with a stick.’\n\nHe’s helped free seven people falsely accused of killing their babies and reported on wars, revolutions and trouble in 80 countries, but he’s most famous for doing an impression of an exploding tomato while investigating the Church of Scientology.\n\nHumfrey Hunter previously published John Sweeney’s book, The Church of Fear: Inside the Weird World of Scientology, and last year brought Russell Miller’s landmark biography of Scientology’s founder, Bare-Faced Messiah: The True Story of L. Ron Hubbard, back into print for the first time in 27 years.\n\n--\n\nThe videos cut from this talk can be found here:\n\nScientology and Me\nhttps://www.youtube.com/watch?v=0HGM8DSnYh0\n\nPanorama - BBC One\nhttps://www.youtube.com/watch?v=mjlo4u_8g60\n\nLoses it with Scientologist!\nhttps://www.youtube.com/watch?v=cLI1Al3S_pE\n\n--\n\nConway Hall hosts a wide variety of talks, concerts, exhibitions, courses, performances, community and social events. It is also renowned as a hub for free speech and independent thought, hosting suffragettes, political radicals, scientists, philosophers, artists, performers; campaign, charities and other non- profit organisations.",
      "release": "2015-10-01T15:43:57Z",
      "duration": "01:24:54",
      "explicit": false,
      "youTubeId": "0B5ojfWryqA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0B5ojfWryqA"
      }
    }
  ]
}