{
  "id": "9f176d9c-48f0-4bc2-bf7e-dbea5f226930",
  "name": "Co-Parent Dilemmas",
  "spotifyId": "5gkQNq2mVsV6kqqID9Wmrz",
  "appleId": 1577638651,
  "episodes": [
    {
      "id": "f8df4716-e373-4f9c-a032-42b84dbf1a1d",
      "title": "S4.E51. Interview with the A Little Bit Culty Podcast",
      "description": "Have a quick question to be explored on the show? Send us a text message! Include your email address if you would like a personal response. Click HERE Diane \u0026 Rick are taking a short break. To round out season four, they are featuring interviews where they were guests on other podcasts! This week, they share the interview they did with Sarah Edmondson and Nippy Ames of the A Little Bit Culty Podcast. Sarah and Nippy were featured on the popular HBO docuseries, The Vow, which explored the abuses of the NXIVM cult. In this interview, they discuss the similarities between cult leaders and parents who are pathological alienators. WHAT’S HAPPENING LINKS: August 17th Workshop: Helping Your Child with a Narcissistic Parent . Get 25% off when you become a A PATREON VIP! Attend the weekly Hump Day Wednesdays for only $10/month (exclusively for Patreon VIPs), resuming August 14th. Purchase a one-year Patreon VIP subscription and receive the I Am Non-Impossible journal! IMPACT Training for Professionals iMOM Podcast If you need a mom friend right now, you’ve come to the right place. On iMOM.com we... Listen on: Apple Podcasts Spotify Support the Show. Want to talk about this episode with Diane and other parents? Be part of the conversation on the NON-Impossibles Facebook group Find us on X (Twitter) and Instagram @CPDilemmas If you are a professional working with high-conflict co-parents, join our LinkedIn group. Have a co-parent dilemma? Email Dilemma@CPDilemmas.com Become a Non-Impossible VIP Listener for some really cool perks! To get a special discount on therapy through BetterHelp, visit www.BetterHelp.com/Dilemma Dealing with alcohol addiction in your co-parent relationship? Explore peace of mind with SoberLink. For a discount on your device, CLICK HERE . RATE THE SHOW! CLICK HERE to subscribe to our monthly podcast email to get a sneak peak into upcoming topics",
      "release": "2024-08-11T16:00:00Z",
      "duration": "01:05:36.1040000",
      "explicit": true,
      "spotifyId": "7czl6dkWQJ9FRzB4ArkLoB",
      "appleId": 1000664954582,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7czl6dkWQJ9FRzB4ArkLoB",
        "apple": "https://podcasts.apple.com/podcast/s4-e51-interview-with-the-a-little-bit-culty-podcast/id1577638651?i=1000664954582"
      }
    }
  ]
}