{
  "id": "ac67d4ed-635d-4a0d-9ef3-7ca8b5f4ff70",
  "name": "Corsi Nation",
  "spotifyId": "35xyNoeO5ZjHRhpSF6jwPU",
  "appleId": 1679630544,
  "episodes": [
    {
      "id": "4e143773-9348-4463-b58a-58ee4387e6e7",
      "title": "Breaking Free from Stockholm Syndrome: Meredith Miller \u0026 Dr. Corsi on Healing After Trauma",
      "description": "Why do victims sometimes bond with their abusers? How can people trapped in emotional or psychological control — in relationships, families, or even institutions — break free? In this enlightening episode of Corsi Nation, Dr. Jerome Corsi speaks with Meredith Miller, author of Becoming Whole: How to Prevent Stockholm Syndrome and Transcend Darkness in Your Life and Relationships, to explore the hidden dynamics of Stockholm Syndrome — and the path toward reclaiming your freedom and sense of self. Meredith and Dr. Corsi discuss:\n🧠 What Stockholm Syndrome Really Is — and why victims can become emotionally attached to their captors or abusers.💔 How It Happens — from hostage situations to toxic personal relationships.🪞 Recognizing the Signs — how manipulation, trauma bonding, and fear distort perception.🌱 Healing and Empowerment — how to break free from emotional control and rebuild a healthy, independent mindset.📖 Pick up Meredith Miller’s book Becoming Whole here: https://www.amazon.com/Becoming-Whole-Stockholm-Transcend-Relationships/dp/B0FQTNMJPM This is a powerful conversation about psychological resilience, recovery, and reclaiming your life after emotional or physical captivity.\n\n🌐 Visit Corsi Nation: https://corsination.com\n\n Support our partners:\n• MyVitalC: https://www.thetruthcentral.com/myvitalc-ess60-in-organic-olive-oil/\n• Swiss America: https://www.swissamerica.com/offer/CorsiRMP.php\n\n📬 Join Dr. Jerome Corsi on Substack: https://jeromecorsiphd.substack.com/\n\n📖 Get your FREE copy of Dr. Corsi\u0027s new book with Swiss America CEO Dean Heskin: How the Coming Global Crash Will Create a Historic Gold Rush — Call 800-519-6268 \n🐦 Follow Dr. Jerome Corsi on X: @corsijerome1\n\nBecome a supporter of this podcast: https://www.spreaker.com/podcast/corsi-nation--5810661/support.",
      "release": "2025-10-09T11:14:03Z",
      "duration": "00:42:01",
      "explicit": false,
      "spotifyId": "6ApVDNZdgrD2C9gyh4Eg6c",
      "appleId": 1000730974380,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ApVDNZdgrD2C9gyh4Eg6c",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-from-stockholm-syndrome-meredith-miller/id1679630544?i=1000730974380"
      }
    }
  ]
}