{
  "id": "efd31cb4-837d-49cf-b31e-5ad1945e03e0",
  "name": "Courage Made Simple",
  "spotifyId": "34tCuBqG7NyxkDPikAmjzv",
  "appleId": 1813581604,
  "youTubeChannelId": "UCXnQ2-48ucqW8bNaSD9_MJQ",
  "episodes": [
    {
      "id": "de7f70d1-75c9-45b9-84f4-141112e08cf8",
      "title": "#10 What leaders can learn from high-control systems and cults",
      "description": "In this second of their two conversations, Margareta Kull and Jackie Johnson (Executive Director of ICSA) focus on what leaders can learn from high-control systems and cults. Drawing on Jackie’s work with organisations, government and cult recovery, they explore how fear, pressure and manipulation can take hold in workplaces. They discuss early warning signs, the cost of ignoring discomfort, and how curiosity, self-reflection and listening are essential to creating healthy environments. Courage, they argue, often begins with pausing, seeing reality clearly, and deciding what to do when you sense something is off.\n\n\n\nWant to get in touch with Jackie? Contact us here (https://courageous-leader.com/pages/contact-us)  and we’ll connect you. Jackie has changed her email since these episodes were recorded, but she’s still with ICSA (https://internationalculticstudies.org/)  in the USA.\n\n\n\nTo learn more about our Courageous Leader™ Process Programme, click here (https://courageous-leader.com/pages/selfstudy) . You can also download our programme’s introduction package here. (https://courageous-leader.com/pages/courageous-leader%E2%84%A2-introduction-package-access) \n\n\n\nFollow me on Social Media @margaretakull",
      "release": "2026-01-19T09:18:22Z",
      "duration": "00:42:19",
      "explicit": false,
      "spotifyId": "0ftuqJ4u7uBOX8I7hZW9h7",
      "appleId": 1000745717501,
      "youTubeId": "T2Y1-eoA6hc",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery",
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ftuqJ4u7uBOX8I7hZW9h7",
        "apple": "https://podcasts.apple.com/podcast/10-what-leaders-can-learn-from-high-control-systems/id1813581604?i=1000745717501",
        "youtube": "https://www.youtube.com/watch?v=T2Y1-eoA6hc"
      }
    },
    {
      "id": "50261829-070e-4571-97f0-83291f753507",
      "title": "#9 Growing up in high-control systems and cults",
      "description": "In the first of their two conversations, Margareta Kull and Jackie Johnson explore courage under control. Jackie shares what it was like growing up in Jehovah’s Witnesses—loss, rules and scrutiny—and why one clear breaking point helped her finally leave. The next episode focuses on what leaders can learn. Interested in the Courageous Leader™ Process programme, you can find more information through the link provided here. If you’d like to get in touch with Jackie, please note that she has updated her email address since the recording of this episode. If you’d like to connect with her, feel free to reach out to us and we’ll be happy to pass your message along. This is the organization we’re talking about in the podcast. International Cultic Studies Association (ICSA) Follow Courageous Leader™ and Margareta Kull in social media @margaretakull",
      "release": "2025-12-17T11:45:39Z",
      "duration": "00:57:14.2470000",
      "explicit": false,
      "spotifyId": "6AU2iCNrKNpWXhfOSFZurQ",
      "appleId": 1000741673389,
      "youTubeId": "s6erVgvBp-4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6AU2iCNrKNpWXhfOSFZurQ",
        "apple": "https://podcasts.apple.com/podcast/9-growing-up-in-high-control-systems-and-cults/id1813581604?i=1000741673389",
        "youtube": "https://www.youtube.com/watch?v=s6erVgvBp-4"
      }
    }
  ]
}