{
  "_ts": 0,
  "id": "5baff3bd-e4f6-4b73-b08f-2458f5ccdad2",
  "name": "Courtroom Confidential",
  "spotifyId": "3YpvshD8ucDoMnf9FEt12i",
  "appleId": 1741465378,
  "episodes": [
    {
      "id": "5c475049-a75a-49a5-be18-7b712228a546",
      "title": "News Brief: Karen Read, YSL Rico Trial, Lori Vallow, Sarah Boone and More!",
      "description": "Welcome back to Courtroom Confidential with Joshua Ritter! In this special podcast-only episode, I give a quick rundown of the week’s biggest true crime news, including: - A mistrial declared in the trial of Boston woman Karen Read after a jury could not come to a unanimous decision. - The YSL RICO trial abruptly halted by Judge Ural Glanville until another judge reviews motions from Young Thug and others who want him recused from the case. Plus, the latest in the cases of ‘Doomsday Cult Mom’ Lori Vallow in Arizona; Maryland mother Rachel Morin’s accused killer; David Swift, a Tennessee man acquitted of murdering his wife now charged with manslaughter; and Sarah Boone, a Florida woman accused of killing her boyfriend by trapping him in a suitcase during a game of Hide and Seek. Thank you for listening! We will be back next week for our usual Friday episode. In the meantime, please leave us a rating and review, and send this episode to a friend! We appreciate your help and support in getting the word out about Courtroom Confidential. Follow me on social media: YouTube: http://www.youtube.com/@CRConfidential Instagram: https://www.instagram.com/joshuaritteresq/ X: https://x.com/JoshuaRitterESQ TikTok: https://www.tiktok.com/@joshuaritteresq Support the show! https://buymeacoffee.com/courtroomconfidential DISCLAIMER: The information in this podcast is for educational and entertainment purposes only. This content does not constitute legal advice. No attorney-client relationship is established by listening to this podcast. Support the Show.",
      "release": "2024-07-05T10:00:00Z",
      "duration": "00:06:04.9560000",
      "explicit": false,
      "spotifyId": "4neQNafrYXUNNtcOxeKMIO",
      "appleId": 1000661227871,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4neQNafrYXUNNtcOxeKMIO",
        "apple": "https://podcasts.apple.com/podcast/news-brief-karen-read-ysl-rico-trial-lori-vallow-sarah/id1741465378?i=1000661227871"
      }
    }
  ]
}