{
  "_ts": 0,
  "id": "18bf2e22-5fe7-4a74-96f0-06561612b069",
  "name": "Courage365",
  "youTubeChannelId": "UCuGAsbh-U2tGZ9rRAlGZoQg",
  "episodes": [
    {
      "id": "20de6419-0f3a-4940-9daf-21b82600d945",
      "title": "Let Us Prey Documentary LIVE Q\u0026A",
      "description": "Have you seen the recent \u0022Let Us Prey\u0022 documentary on Discovery ID or streaming on HBO Max? This 4 part documentary follows the stories of survivors within the Independent Fundamentalist Baptist Church.\n\nJoin us for a live Q\u0026A session with Director Sharon Liese and cast member Eric Skwarczynski from \u0022Let Us Prey\u0022.\n\n\nEric (one of our Courage 365 board members and the host of the Preacher Boys podcast), alongside brave survivors, exposes the dark underbelly of the Independent Fundamentalist Baptist church in this newly released documentary.\n\nCome with your questions prepared as we discuss his personal experiences in the making of the show, and delve into the crucial conversations surrounding accountability and justice in the IFB Church.",
      "release": "2024-09-16T19:00:22Z",
      "duration": "01:08:03",
      "explicit": false,
      "youTubeId": "lD9DCzppGVk",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lD9DCzppGVk"
      }
    },
    {
      "id": "f4f61077-3698-4971-9da4-d65cdcea2441",
      "title": "Religious Trauma Syndrome",
      "description": "This video is part of the 2023 LIVE 30 Days of Courage Event\n\nAll abuse is bad but it adds a layer of trauma when the abuse is entangled with our religious experiences.\n\nLearn from  Suandria Lewis - Religious Trauma Therapist, Sarah Stankorb - Author, Investigative Journalist on Religious Trauma, and Eric Skwarczynski- Advocate and podcaster on Religious Trauma.\n\nLearn what Religious Trauma Syndrome is, how it shows up in our lives and what we can do to move forward in our healing from it.",
      "release": "2024-09-15T19:00:02Z",
      "duration": "01:06:50",
      "explicit": false,
      "youTubeId": "59Lq_skVMEs",
      "subjects": [
        "Psychology",
        "Cult Recovery",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=59Lq_skVMEs"
      }
    },
    {
      "id": "aeb7a45f-b405-4c69-9500-336b494c7f0b",
      "title": "Demystifying Coercive Control",
      "description": "This video is part of the 2023 LIVE 30 Days of Courage Event\n\nIt\u0027s an abuse far more covert than physical violence. The language to describe this is so new that it was only coined in 2006. Coercive Control - the silent abuse.\n\nHear from survivor and advocate Dr. MaryAnn Kaczmarski, former police officer and survivor Claudia King, child abuse survivor and advocate Nathan Spiteri, and Cult Intervention Specialist Ashlen Hilliard.\n\nLearn about this sneaky, often dismissed form of abuse while discovering how to identify and bolster yourself against it!",
      "release": "2024-09-13T19:00:36Z",
      "duration": "01:13:13",
      "explicit": false,
      "youTubeId": "ywQKryZTUPo",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ywQKryZTUPo"
      }
    },
    {
      "id": "906cf470-aaa9-4880-8342-11e8b55f7aca",
      "title": "Unmasking Cults with TV Documentary Experts",
      "description": "This video is part of the 2023 LIVE 30 Days of Courage Event\n\n\nYou\u0027ve seen them on TV; you\u0027ve heard them tell their harrowing cult stories, but what was left out of the documentaries?\n\nJoin us for a deep dive with hit cult documentary experts and survivors to Unmask Cults with Emily Anderson from Amazon Prime\u0027s Shiny Happy People, Sarah Edmondson from The Vow on HBO, and Matson Browning from Escaping Polygamy on A\u0026E.\n\nThis is a once-in-a-lifetime experience to hear these three experts chat together about the dangers of high control groups and what didn\u0027t make it on screen.",
      "release": "2024-09-12T19:00:25Z",
      "duration": "01:21:56",
      "explicit": false,
      "youTubeId": "_ioWBnGp0-A",
      "subjects": [
        "NXIVM",
        "Institute In Basic Life Principles",
        "FLDS Church",
        "Latter Day Church of Christ",
        "Apostolic United Brethren",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_ioWBnGp0-A"
      }
    },
    {
      "id": "205dbb5b-5cc7-41f4-8e48-421d3be32807",
      "title": "LIVE Q\u002BA with \u0022Let Us Prey\u0022 Director Sharon Liese and Cast Member Eric Skwarczynski (REPLAY)",
      "description": "Sharon (EMMY Award Winning Director) and Eric (one of our Courage 365 board members and the host of the Preacher Boys podcast), alongside brave survivors, exposes the dark underbelly of the Independent Fundamentalist Baptist church in this newly released \u0022Let us Prey: A Ministry of Scandal\u0022 documentary.\n\nWe discussed their personal experiences in the making of the show, and delve into the crucial conversations surrounding accountability and justice in the IFB Church.\n\nDon\u0027t miss this opportunity to engage with true champions of change and learn how you can better support the fight against abuse.\n\nLinks: \nhttps://www.courage365.org/\nhttps://www.preacherboyspodcast.com/\nLet Us Prey doc: https://www.investigationdiscovery.com/crimefeed/news/id-sets-premiere-for-let-us-prey-a-ministry-of-scandals",
      "release": "2023-12-16T01:28:19Z",
      "duration": "01:07:17",
      "explicit": false,
      "youTubeId": "KrI7c7m-KF4",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KrI7c7m-KF4"
      }
    },
    {
      "id": "675f15e7-c62f-4f0b-9001-bbd615034a69",
      "title": "The Escape Artist – Deprogramming Skinheads and Polygamists",
      "description": "In today\u0027s Courage Conversation episode, we speak to Tawni Browning, an “escape artist” from the A\u0026E TV Show Escaping Polygamy and advocate who has dedicated her life to helping individuals recover and heal from cults.\n\nTawni helps women flee polygamous cults and even investigated and helped to shut down one of the world\u0027s largest and most violent sk!nhead organizations.\n\nWe explore the dynamics within polygamous groups, and r@cist organizations learning what it takes to help someone exit a cult-like environment.\n\nRelevant Links:\n- Tawni’s Husband’s Twitter: https://twitter.com/MatsonBrowning\n- Tawni’s Facebook: https://www.facebook.com/profile.php?id=100008069775342\n- Tawni’s Website: https://www.mattandtawni.com/\n- Matt and Tawni’s book: https://www.amazon.com/Hate-Next-Door-Undercover-Supremacy/dp/1728276624/ref=sr_1_1?crid=20TYN6IHX4CU7\u0026keywords=tawni\u002Bbrowning\u002Bbook\u0026qid=1693258385\u0026sprefix=tawni\u002Bbrowning\u002Bbook%2Caps%2C142\u0026sr=8-1 \n- Text message service: To sign up, text the word \u0022courage\u0022 to 917-809-7311\n- Courage 365: Facebook Group - www.facebook.com/groups/courage365\n\n\n🔑 Key Takeaways:\n#1: The power dynamics and extreme @buse within polygamous groups is not dissimilar to the v!olent sk!nhead groups. This episode highlights the similarities between extremist environments.\n\n#2: Continuously Loving and Supporting\nTawni shared a powerful story of a despised individual in the FLDS community, Rachel, who is still sought out for help because she shows love. This anecdote serves as a reminder that love and support are essential, and even when we don’t think we are getting through others will be drawn to our loving response.\n\n#3: Throughout our conversation, Tawni discusses the importance of taking action when we have access to information. By sharing our unique perspectives and combining our expertise, we can contribute to making a positive difference in the world. Let\u0027s not be bystanders in toxic situations, but active participants in creating a better future for all.\n\n\n\n\n[00:00:00] Courage Conversation Show welcomes escape artist Tawni Browning.\n[00:06:41] Parallels between cult rescue and combating extremism.\n[00:10:28] People with talent can help others escape toxic groups, investigating and finding good in the world.\n[00:14:20] Polygamous groups, F L D S and Kingston Group, have top male leaders who control everything, leading to extreme abuse, including sexual abuse.\n[00:18:48] Escaping Polygamy starts with questioning, empowering individuals.\n[00:20:22] Overcoming adversity and supporting others\u0027 success.\n[00:22:48] Support their journey, no real normal.\n[00:25:53] Different advocates help at different stages.\n[00:31:51] Book available, dropping July 4th, importance of work, helping loved ones, PTSD, not wanting anyone to feel alone.\n[00:33:32] Follow Courage 365: social media, resources, text messages.",
      "release": "2023-08-31T12:00:19Z",
      "duration": "00:35:41",
      "explicit": false,
      "youTubeId": "RSm77vDR7xE",
      "subjects": [
        "FLDS Church",
        "Psychology",
        "Latter Day Church of Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RSm77vDR7xE"
      }
    },
    {
      "id": "9f6a6489-108d-46a6-9a81-86aa74f4c87d",
      "title": "Brain Hacked! The Tangled Web of Cults",
      "description": "In today\u0027s Courage Conversation episode, prepare yourself for an eye-opening discussion as Dominique Benninger explores the spectrum of cult-like behavior, the use of manipulative techniques, and the long-lasting impact on survivors. Get ready to challenge your understanding of the term \u0022cult\u0022 and gain valuable insights into the world of high-control groups. Learn what brain hacking is, how cults do it, and how to protect yourself.\n\nRelevant Links:\n- Dom’s Twitter: https://twitter.com/BAccountabilty\n- Dom’s Facebook: https://www.facebook.com/dominique.benninger\n- https://churchtrauma.org/\n- https://baptistaccountability.org/\n- Text message service: To sign up, text the word \u0022courage\u0022 to 917-809-7311\n- Courage 365: Facebook Group - www.facebook.com/groups/courage365\n\n\n🔑 Key Takeaways:\n1. The spectrum of cult-like behavior: The episode highlights that cult-like behavior can exist on a spectrum, ranging from extreme cults to less damaging but still harmful groups. It is important to recognize the signs of control and manipulation, even in seemingly benign institutions or relationships.\n\n2. The power of manipulation techniques: The episode explores how various techniques rooted in social psychology, such as love bombing and reciprocity, can be used by cults and other entities to manipulate and control individuals. Understanding these techniques can help individuals recognize and navigate potentially harmful situations.\n\n3. The importance of personal autonomy and self-awareness: The episode emphasizes the need for individuals to be aware of their own vulnerabilities and make informed decisions about what is harmful or not. It encourages listeners to prioritize personal autonomy, self-growth, and healthy alternatives to avoid falling into cult-like situations.\n\n\n\n\n\n[00:02:11] Childhood abuse, spiritual exploration, controlling church, college years, accidental meeting with Megan.\n[00:04:26] Couple joins church group, experiences cult-like behavior.\n[00:16:56] 25 years since cult; therapy valuable in understanding vulnerability and control.\n[00:20:59] Churches may unknowingly use harmful cult tactics.\n[00:23:19] Interview on healthy parenting techniques and cults.\n[00:28:38] Techniques of manipulation used in various areas.\n[00:31:47] NLP: Powerful tool for success or manipulation.\n[00:38:32] Follow Courage 365 on social media. Free resources available. Subscribe to text message list.",
      "release": "2023-08-17T12:00:52Z",
      "duration": "00:39:51",
      "explicit": false,
      "youTubeId": "tp0Co-x0nA8",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tp0Co-x0nA8"
      }
    },
    {
      "id": "ce6a81aa-e1dc-411a-8f03-7de02185388a",
      "title": "What is Cult Mind Control?",
      "description": "\u0022Mind Control in High Control Religion: Indoctrination looks like fear, obligation, and guilt. It\u0027s the emotional control.\u0022\n— Wendi Renay\n\nWatch the entire Courage Conversation episode with @WendiRenay here: https://youtu.be/UDapqicLkXA\n\n\nRelevant Links: \n- Wendi’s Youtube: https://www.youtube.com/@WendiRenay/ \n- Wendi’s Instagram: www.Instagram.com/wendirenay \n-Wendi’s TikTok: www.TikTok.com/@wendirenay \n- Text message service: To sign up, text the word \u0022courage\u0022 to 917-809-7311\n- Courage 365: Facebook Group - www.facebook.com/groups/courage365",
      "release": "2023-08-13T15:00:18Z",
      "duration": "00:03:16",
      "explicit": false,
      "youTubeId": "IQfzmetsotQ",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IQfzmetsotQ"
      }
    },
    {
      "id": "59a70348-7616-4675-ab61-343ec89f0577",
      "title": "How Women Are Treated in JW",
      "description": "Women\u0027s Role in Jehovah\u0027s Witnesses: \u0022I wanted to be a journalist. I wanted to be on camera. I wanted, I just, I loved, I was a very passionate, artistic person, but you\u0027re not allowed to go to college. You\u0027re not allowed to do anything unless you\u0027re strictly preaching. Teaching and working in the congregation.\u0022\n— Wendi Renay\n\n\nWatch the entire Courage Conversation episode with @WendiRenay here: https://youtu.be/UDapqicLkXA\n\n\n\nRelevant Links: \n- Wendi’s Youtube: https://www.youtube.com/@WendiRenay/ \n- Wendi’s Instagram: www.Instagram.com/wendirenay \n-Wendi’s TikTok: www.TikTok.com/@wendirenay \n- Text message service: To sign up, text the word \u0022courage\u0022 to 917-809-7311\n- Courage 365: Facebook Group - www.facebook.com/groups/courage365",
      "release": "2023-08-11T15:00:15Z",
      "duration": "00:03:39",
      "explicit": false,
      "youTubeId": "Lgi7goo0rC4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Lgi7goo0rC4"
      }
    },
    {
      "id": "35e827b4-7977-465b-8cd7-574db87050fb",
      "title": "Escaping Jehovah’s Witnesses with Wendi Renay",
      "description": "In today\u0027s Courage Conversation episode, Wendi Renay (@WendiRenay ) takes us on a powerful journey of self-discovery, overcoming grief, and finding true self-worth. Wendi shares their personal experience of realizing that her life was a lie and the emotional toll it took on her. She delves into the importance of focusing on oneself and questioning beliefs. Wendi also discusses the concept of fear, obligation, and guilt tied to narcissistic abuse, cults, and high-control religion.\n\nRelevant Links: \n- Wendi’s Youtube: https://www.youtube.com/@WendiRenay/ \n- Wendi’s Instagram: www.Instagram.com/wendirenay \n- Wendi’s TikTok: www.TikTok.com/@wendirenay \n- Text message service: To sign up, text the word \u0022courage\u0022 to 917-809-7311\n- Courage 365: Facebook Group - www.facebook.com/groups/courage365\n\n\n🔑 Key Takeaways:\n1️. Question your beliefs and analyze your thoughts: Wendi shares her journey of questioning her own beliefs and learning to critically analyze her thoughts and decisions. This self-reflection allowed her to break free from the limitations of indoctrination and discover her true self.\n\n2️. Letting go of fear, obligation, and guilt: High control religions often thrive on fear, obligation, and guilt to keep their members in line. Wendi delves into the concept of fear, obligation, and guilt and how it relates to narcissistic abuse and manipulation within religious communities. Learning to let go of these destructive emotions is crucial for personal growth.\n\n3️. The power of personal growth and connection: Wendi emphasizes the importance of personal growth and understanding others\u0027 perspectives. By hearing stories and experiences from a diverse range of individuals, we can broaden our horizons and deepen our empathy. She shares her own journey of seeking wisdom and guidance from different sources to become a better person every day\n\n\n\n\n[00:00:00] Courage Conversation Show welcomes ex-Jehovah\u0027s Witness survivor.\n[00:04:13] Shunning after leaving Jehovah\u0027s Witnesses, CSA survivor.\n[00:08:58] Discovery, doubt, and finding peace outside religion.\n[00:12:52] Summary: Indoctrination is fear-based mind control, stifling critical thinking and intuition. High control religion thrives on emotional control through fear, obligation, and guilt.\n[00:15:48] Fear, obligation, guilt tied to narcissistic abuse\n[00:20:37] Restrictions on women in Jehovah\u0027s Witnesses organization.\n[00:23:50] Restrictions on women preaching, promoting toxic gender roles.\n[00:29:13] High control groups restrict relationships and growth.\n[00:31:21] Grief, self-worth, and personal growth journey.\n[00:37:32] Mom of two learning and growing daily.\n[00:42:05] Powerful message. Follow Wendi\u0027s social media. Check out Courage 365 and resources. Join the text message list for daily encouragement.",
      "release": "2023-08-10T12:00:34Z",
      "duration": "00:43:56",
      "explicit": false,
      "youTubeId": "UDapqicLkXA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UDapqicLkXA"
      }
    },
    {
      "id": "a0167992-cbe2-41bb-9f3f-ffe9b7ae9e0e",
      "title": "God, Money, and Control: Domestic Abuse in the Church with Shirley Fessel",
      "description": "Shirley Fessel is an advocate for women who have experienced religious-domestic v!olence. As a former minister\u0027s wife, she understands the challenges faced by women in these situations and the lack of support from institutional churches.\n\nAs a former minister\u0027s wife, she found herself trapped in a situation where the institutional church and the people in it failed to provide the support she needed. Determined to reclaim herself and protect her children from the horrors of @buse, Shirley decided to create a workbook that would help women in similar situations navigate the confusing tactics used against them, such as manipulation, gaslighting, and exploitation of faith concepts.\n\nThrough her own experiences, she learned the importance of leaving @buse without guilt, listening to her intuition, and not allowing others to minimize her connection to God. Shirley\u0027s work continues to support and empower women to overcome the attacks they face and honor their intuition. \n\nThis episode will be useful to anyone, but especially those who still identify as Christian and wish to understand where God is in their journey.\n\nRelevant Links: \n- Shirley Fessel’s Book, Redemption from Biblical Battering, for Christian women: https://redemptionbb.com/book/ \n- Shirley Fessel’s Facebook: https://www.facebook.com/Fessup44/\n- Grant, (must Read the book to be considered): https://redemptionbb.com/grant/ \n- Text message service: To sign up, text the word \u0022courage\u0022 to 917-809-7311\n- Courage 365: Facebook Group - www.facebook.com/groups/courage365\n\n\n3 key takeaways for this episode\n\n1. Religious Abuse can be a complex and damaging form of domestic v!olence, often justifying @busive behaviors through religious beliefs and scripture. It is crucial for survivors to recognize the manipulation and seek support to break free from these toxic environments.\n\n2. Women in Abusive religious settings may face unique challenges in seeking help, as church authorities and religious beliefs may discourage them from seeking professional assistance. It is important for survivors to know that they have the right to seek professional help and should not be limited to only biblical counseling.\n\n3. The guest, Shirley Fessel, offers a practical resource in the form of her self-help workbook, \u0022Redemption from Biblical B@ttering,\u0022 which explores the seven levels of confusion and provides tools for women in religious domestic v!olence situations. This workbook can help survivors navigate the complexity of religious abuse and empower them to create a new life after leaving an abusive relationship.\n\n\n[00:02:58] Workbook empowers women escaping religious abuse.\n[00:09:38] Domestic abuse tied to religious beliefs and manipulation.\n[00:12:45] Religious beliefs compound fear and control, manipulating trust.\n[00:16:24] Levels of confusion, abused women, finding strength, leaving abusive relationships.\n[00:23:49] Churches funding non-affiliated organizations for control?\n[00:28:41] Detachment, charting, and redefining for abuse recovery.\n[00:33:44] \u0022Courage to be yourself, despite adversity.\u0022\n[00:36:47] Thank you for tuning in. Check out Shirley Fessel\u0027s book and social media. Follow Courage 365 on social media. Need help? Visit courage365.org. Sign up for inspirational text messages.",
      "release": "2023-07-27T12:00:23Z",
      "duration": "00:38:33",
      "explicit": false,
      "youTubeId": "UjGX8q6W7bg",
      "subjects": [
        "Self-Help",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UjGX8q6W7bg"
      }
    },
    {
      "id": "53adc0b7-8340-4dd1-81dd-9b7ad4e7a63c",
      "title": "Trauma and Self-Hatred: A Harsh Reality for LGBTQ\u002B with Andrew Pledger",
      "description": "Andrew Pledger @4ndrewpledger  is a survivor of a high control religious environment. Raised in the IFB (Independent Fundamental Baptist) church, he experienced trauma and internalized homophobia due to the system\u0027s teachings that being queer was demonic and needed to be prayed away. Andrew recognizes the harm caused by such religious environments, where individuals are blamed and shamed for any issues they face, while the system itself remains untouchable. He highlights the psychological and emotional abuse faced by queer individuals who may undergo conversion therapy or be subjected to self-hatred. Understanding the process of indoctrination, Andrew acknowledges the courage it takes to question and leave these systems. He calls for the dismantling of abusive systems, encouraging others to leave and reclaim their sense of self. Andrew emphasizes the importance of seeking support when leaving such environments in order to protect one\u0027s mental health and successfully embark on a journey of healing and self-discovery.\n\nRelevant Links: \n- Andrew Pledger’s Resources: https://andrewpledger.mypixieset.com/links/\n- Andrew Pledger’s Instagram: https://www.instagram.com/4ndrewpledger/\n- Text message service: To sign up, text the word \u0022courage\u0022 to 917-809-7311\n- Courage 365: Facebook Group - www.facebook.com/groups/courage365\n\n\n3 key takeaways for this episode\n\n1. The importance of self-discovery and defining one\u0027s own identity: The guest, Andrew Pledger, shares his journey of questioning and ultimately rejecting the harmful teachings of his religious community. He emphasizes the importance of self-discovery and becoming independent, as well as the role of meeting and interacting with diverse individuals in breaking down stereotypes.\n\n2. The devastating effects of leaving an abusive religious environment: Leaving a high control religious environment can result in a sense of confusion, loss of identity, and a lack of community and support. It takes courage and resources to recognize and question the indoctrination within these systems, but leaving is seen as the most powerful action to take in order to protect one\u0027s mental health.\n\n3. The ongoing struggle and discrimination faced by queer individuals: Andrew discusses the internalized homophobia and religious trauma he experienced and the ongoing micro-aggressions and discrimination faced by queer individuals, including social rejection, aggressiveness, and hatefulness. The episode highlights the need for love and acceptance within families and the negative effects of conversion therapy on one\u0027s sense of self and spirituality.\n\n\n00:00:00 \u0022Courage conversation show with host Ashley Easter\u0022\n00:03:49 Leaving an oppressive religious environment requires planning and healing.\n00:11:33 Undoing internalized homophobia is a slow, self-discovery process.\n00:21:52 Struggling with trust, trauma responses, and homophobia.\n00:26:56 Queer people face family rejection, trauma, isolation.\n00:30:14 Find love, acceptance, and healing, be courageous.\n00:34:23 Powerful podcast and resources for all journeys.\n00:35:44 Connect with us on social media, website, and text messages for support.",
      "release": "2023-07-20T12:00:49Z",
      "duration": "00:37:55",
      "explicit": false,
      "youTubeId": "zG0Xxe4f9TY",
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zG0Xxe4f9TY"
      }
    },
    {
      "id": "33d13fae-cc49-47c6-bd39-b5dad117230b",
      "title": "Cults Hidden in Plain Sight: How To Spot Them and How To Break Free with Ashley Easter",
      "description": "*This episode is adapted from the 30 Days of Courage LIVE event in October 2022.*\n\nAshley Easter shares her story of leaving the religious \u0022Quiverful\u0022 cult she grew up in.\nThere are an estimated 5,000\u002B cults in the US alone, and experts suggest that anyone can be vulnerable to a cult if subjected to the right conditions.\nIn this talk, Ashley will share the characteristics of a cult and how they can show up in any sector of society.\nShe will also give practical steps on how to spot cults and what to do if you think you or a loved one are in one.\nAshley Easter is a survivor advocate, Intuition Coach, and founder of Courage 365.\n\n\nFREE Resources Available at: https://www.Courage365.org\n\nFor daily empowerment text messages, text the word: Courage\nTo: (917) 809-7311",
      "release": "2023-04-27T13:00:27Z",
      "duration": "01:24:10",
      "explicit": false,
      "youTubeId": "bQXuroM3Jps",
      "subjects": [
        "Quiverfull"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bQXuroM3Jps"
      }
    },
    {
      "id": "a0ea66e4-7c72-47e3-bfeb-c30966e417c2",
      "title": "Religious Trauma and the LGBTQ\u002B Community with Andrew Pledger: Courage Conversations Show",
      "description": "This week on Courage Conversations, we talk to Andrew Pledger about religious trauma, specifically for those within the LGBTQ\u002B community.\n\nTune into this episode to learn about the definition of religious trauma and how to move forward toward healing and empowerment.\n\nUse coupon code: COURAGE30 for $30 off your CalmiGo order! https://calmigo.com/pages/meet-the-exhaler...\n\nSign up for our FREE morning empowerment text messages. By survivors, for survivors. Just text the word: courage To: (917) 809-7311\n\nJoin Courage Clubs:https://www.courage365.org/clubs\n\nCourage 365 Facebook Group: https://www.facebook.com/groups/Courage365.org\n\nFollow Andrew:https://www.liinks.co/4ndrewpledger\n\nCheck out his podcast: https://4ndrewpledger.mypixieset.com/podcast/",
      "release": "2022-09-09T11:56:42Z",
      "duration": "00:53:12",
      "explicit": false,
      "youTubeId": "mlXs_G_8Gtk",
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mlXs_G_8Gtk"
      }
    },
    {
      "id": "aa6c7041-7202-4a4f-935f-f2d35f1b47d0",
      "title": "30 Days of Courage: Using Your Platform to Empower the Voices of Survivors with Eric Skwarczynski",
      "description": "This was recorded live during the 30 Days of Courage by Courage 365. \n\n\u0022Pass the Mic: Using your platform to empower the voices of survivors\u0022\n\nJoin us for a LIVE talk by ex-Independent Fundamentalist Baptist, Survivor Advocate, and podcaster Eric Skwarczynski.\n\nEric shares his story of leaving (what many call a cult cult-like) IFB environment, the importance of advocacy work, and using your platform to empower the voices of survivors.",
      "release": "2021-11-06T22:43:00Z",
      "duration": "00:49:42",
      "explicit": false,
      "youTubeId": "6hWRAehS68c",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6hWRAehS68c"
      }
    },
    {
      "id": "53f80687-38cb-407d-b635-a3af221be282",
      "title": "Dismantling Purity Culture with Linda Kay Klein",
      "description": "TITLE: Dismantling Purity Culture\n\nGUEST: Linda Kay Klein\n\nIn this episode, we interview Linda Kay Klein, author of \u0022Pure: Inside the Evangelical Movement that Shamed a Generation of Young Women and How I Broke Free.\u0022\n\nWe talk about how Purity Culture wreaked havoc on so many young people, the consequences, and how this affects abuse survivors and their healing process.\n\nThis show streams on August 12th at 7 pm EST on our Facebook. You can catch the replay of this episode and all of our previous episodes at:\nwww.Courage365.org/videos\n\nFor daily inspirational text messages test the word \u0022courage\u0022 to \u002B1 (917) 809-7311\n\nWebsite: https://lindakayklein.com/",
      "release": "2021-08-13T11:41:49Z",
      "duration": "00:39:30",
      "explicit": false,
      "youTubeId": "RAtwJfahebE",
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RAtwJfahebE"
      }
    },
    {
      "id": "8c929285-40cd-4d5d-a117-dd95059e84d7",
      "title": "How The Catholic Church Wrote The Abuse Playbook with Zach Hiner",
      "description": "TITLE: How The Catholic Church Wrote The Abuse Playbook\n\nGUEST: Zach Hiner, Executive Director of SNAP \nIn this episode, we interview Zach Hiner, Executive Director of SNAP (Survivors Network of those Abused by Priests). We talk about how the Catholic church wrote the playbook (their words, not ours) on covering up church and institutional abuse.\n\nWe talk about how the Catholic church pours money into ensuring laws are unsupportive of abuse survivors (all abuse survivors, not just those abused in the Catholic church) and what you can do to get involved in the justice movement.\n\nThis show streams on August 5th at 7 pm EST on our Facebook. You can catch the replay of this episode and all of our previous episodes at:\nwww.Courage365.org/videos\n\nWebsite: https://www.snapnetwork.org",
      "release": "2021-08-06T11:45:34Z",
      "duration": "00:41:52",
      "explicit": false,
      "youTubeId": "wR-pk38D0Ao",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wR-pk38D0Ao"
      }
    },
    {
      "id": "1cda448e-bc3d-4368-ba2c-39532f2db19d",
      "title": "Courage 365: Leah Remini LIVE Q\u002BA on Healing From Scientology",
      "description": "We are pleased to announce this week\u0027s live stream with award-winning actress and Scientology whistleblower Leah Remini interviewed by Courage 365 founder and cult survivor Ashley Easter for the 30 Days of Courage Challenge!\n\nThe 30 Days of Courage Challenge is a FREE empowerment event for abuse survivors and advocates. In our interview with Leah Remini, we will be talking about breaking free from cult organizations and regaining the power of your voice.\n\nDonate to help Courage 365: https://courage365.org/donate\n\nJoin the Courage 365 Facebook group for more LIVE interviews with world-changing abuse survivors and advocates: \nhttps://www.facebook.com/groups/Courage365.org",
      "release": "2020-10-08T19:34:28Z",
      "duration": "00:54:35",
      "explicit": false,
      "youTubeId": "I5_TbBQUMeo",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I5_TbBQUMeo"
      }
    },
    {
      "id": "1cb263e7-cd8f-44c6-9f71-703d0c80b89d",
      "title": "The Courage 365 Show - EP18: Child Marriage in the US, Donna\u0027s Story",
      "description": "This Week\u0027s Topic: Child Marriage in the US, Donna\u0027s Story\n\nThis Week\u0027s Guests are: Donna Pollard and Casey Carter Swegman\n\nTune in as Donna shares her story of surviving child marriage (which is legal in most states within the USA). Listen as she tells what it was like getting married at just 16 and about the policies and laws that allowed it to happen.\n\nDonna has partnered up with Casey from Tahirih Justice Center to combat the horrors of child marriage in the USA. \n\nLearn about what YOU can do to help RIGHT NOW as we work to ban child marriage in North Carolina.\n\nFollow: Survivors\u0027 Corner and Tahirih Justice Center\n\nShare your North Carolina Child Marriage Story: https://survivorscorner.org\n\nInstagram: survivorscorner502\n\nTwitter: YourVoice_SC\n\n\nVISIT: tahirih.org and preventforcedmarriage.org\n\nTahirih Justice Center\n\nTahirih.org/ChildMarriage for research and updates on the campaign to end child marriage in the U.S.\n\nand PreventForcedMarriage.org for resource and support services for survivors and individuals at risk of forced and child marriage\n\nFMI@Tahirih.org\n\n571-282-6187\n\n*Correction: The couple who traveled from out of state to be married in North Carolina were from Kentucky, not Tennessee as stated in the video.",
      "release": "2020-09-25T12:02:09Z",
      "duration": "01:02:37",
      "explicit": false,
      "youTubeId": "1UvNjBVxG1Y",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1UvNjBVxG1Y"
      }
    }
  ]
}