{
  "id": "26379d93-6d7b-42d8-8ff0-2c24d2c28dc6",
  "name": "COURT HELICOPTER",
  "youTubeChannelId": "UCOVg6CknsndBx-hVtM_m6JA",
  "episodes": [
    {
      "id": "4468441b-ba3b-4426-af82-a50068c56172",
      "title": "Pastor Mackenzie’s Lawyer Puts Up Spirited Fight in Court as He Questions Witness",
      "description": "Pastor Paul Mackenzie’s lawyer put up a spirited fight in court as he cross-examined a witness in the ongoing Shakahola massacre trial. Mackenzie, leader of Good News International Ministries, was arrested in 2023 after over 429 bodies were exhumed from Shakahola Forest, Kilifi, where followers were allegedly coerced to starve to death. He faces charges including murder, manslaughter, terrorism, and child abuse alongside dozens of co-accused.",
      "release": "2025-08-29T15:45:45Z",
      "duration": "00:11:21",
      "explicit": false,
      "youTubeId": "0MSJBT02kX4",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0MSJBT02kX4"
      }
    },
    {
      "id": "7edc160b-8d5e-4273-a73c-c5b3c6936e3d",
      "title": "Shakahola Horror: Woman Recounts How Her two Sisters and their 10 Children got lost in Cult Massacre",
      "description": "A woman has given heartbreaking testimony, recounting how her two sisters and their 10 children perished in the Shakahola cult massacre. The tragedy unfolded in 2023, when followers of preacher Paul Nthenge Mackenzie, leader of Good News International Ministries, were lured into mass starvation in Shakahola Forest, Kilifi. Mackenzie was later arrested and, together with dozens of co-accused, now faces charges including murder, manslaughter, terrorism, and child abuse. The case is currently in court, where witnesses continue to give harrowing accounts of how families were lost in Kenya’s deadliest cult tragedy. The hearing continues as the full scale of the massacre is laid bare.",
      "release": "2025-08-29T15:06:49Z",
      "duration": "00:17:37",
      "explicit": false,
      "youTubeId": "CU0l-vPprgI",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CU0l-vPprgI"
      }
    },
    {
      "id": "aa2d83cb-be3b-41a1-903e-68478f9599f2",
      "title": "Government Analyst Who Helped in Exhumation of Bodies in Shakahola Testifies",
      "description": "Government Analyst David Mumbao, who played a key role in the Shakahola massacre investigations, testified in court today on the procedures followed during the exhumation of over 400 bodies from shallow graves linked to cult leader Paul Mackenzie. Mumbao detailed the forensic methods used and the condition of the remains recovered from the forest in Kilifi County.",
      "release": "2025-07-31T16:56:34Z",
      "duration": "00:15:44",
      "explicit": false,
      "youTubeId": "A2_gpYWrULw",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A2_gpYWrULw"
      }
    },
    {
      "id": "bfe2f4ea-9fa3-409f-ab9a-af0a1348e14f",
      "title": "Malindi Children officer Sebastian Muteti testifies in Pastor Paul Mackenzie Shakahola case",
      "description": "Sebastian Muteti’s testimony painted a harrowing picture of systematic child abuse carried out under Pastor Mackenzie’s Shakahola cult. His accounts of starvation, torture, and radical indoctrination among minors deepen the weight of the charges as the trial continues, highlighting the role of civil protection agencies amid a complex criminal investigation.",
      "release": "2025-07-29T14:38:33Z",
      "duration": "00:14:48",
      "explicit": false,
      "youTubeId": "ROmfj16s304",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ROmfj16s304"
      }
    }
  ]
}