{
  "id": "26379d93-6d7b-42d8-8ff0-2c24d2c28dc6",
  "name": "COURT HELICOPTER",
  "youTubeChannelId": "UCOVg6CknsndBx-hVtM_m6JA",
  "episodes": [
    {
      "id": "b9ffc23a-8afb-4752-bfc8-9f422200b500",
      "title": "Lawyer Grills Former Malindi OCS on Whether Refusing to Eat Means Fasting in Shakahola Case Hearing",
      "description": "Former Malindi OCS Ali Noor Abdi hard pressed by Controversial preacher Paul Makenzi\u0027s lawyer Lawrence Obonyo to explain if refusal to eat simply means fasting during a hearing  at Shanzu Law Court in Mombasa County, where Makenzi and other accused persons are facing terror charges.",
      "release": "2025-10-30T07:49:46Z",
      "duration": "00:13:57",
      "explicit": false,
      "youTubeId": "gI2mPIElwJ0",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gI2mPIElwJ0"
      }
    },
    {
      "id": "7f49e6fa-2753-449a-8e69-42b4026f6d6b",
      "title": "Tanzanian Father Whose Child Died in Shakahola Clashes With Mackenzie’s Lawyer in Court",
      "description": "A Tanzanian father whose child died in the Shakahola forest cult ordeal clashed in court with Mackenzie’s lawyer over accountability in the mass-death case led by Paul Mackenzie. He appeared before the court, emotionally recounting how his family joined the cult, the forced fasting, and the tragic loss of his child. The confrontation highlights the human toll of the famine-based ritual and the ongoing legal battle to secure justice for the victims.",
      "release": "2025-10-28T08:01:10Z",
      "duration": "00:24:54",
      "explicit": false,
      "youTubeId": "ad1ZsbFJPGQ",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ad1ZsbFJPGQ"
      }
    },
    {
      "id": "6b0cd6b3-7093-40cb-bb3b-e1226b2b31ce",
      "title": "Pastor Paul Mackenzie Says There Was an Assassination Plot Against Him in Prison",
      "description": "Controversial preacher Paul Makenzi, the main suspect in the Shakahola massacre, has claimed there was an attempt on his life at Shimo la Tewa Prisons. Appearing before Justice Diana Mochache, Makenzi alleged “bad blood” with the prison head and said he faces intimidation and harassment from officers. His lawyers urged the court to ensure his safety or transfer him to another facility. The judge ordered the claims to be recorded and investigated by the Kenya Prisons Service. Makenzi faces multiple counts of murder, manslaughter, and radicalization over the Shakahola deaths.",
      "release": "2025-10-06T16:56:40Z",
      "duration": "00:14:56",
      "explicit": false,
      "youTubeId": "HmpYqvPB-0Y",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HmpYqvPB-0Y"
      }
    },
    {
      "id": "4468441b-ba3b-4426-af82-a50068c56172",
      "title": "Pastor Mackenzie’s Lawyer Puts Up Spirited Fight in Court as He Questions Witness",
      "description": "Pastor Paul Mackenzie’s lawyer put up a spirited fight in court as he cross-examined a witness in the ongoing Shakahola massacre trial. Mackenzie, leader of Good News International Ministries, was arrested in 2023 after over 429 bodies were exhumed from Shakahola Forest, Kilifi, where followers were allegedly coerced to starve to death. He faces charges including murder, manslaughter, terrorism, and child abuse alongside dozens of co-accused.",
      "release": "2025-08-29T15:45:45Z",
      "duration": "00:11:21",
      "explicit": false,
      "youTubeId": "0MSJBT02kX4",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0MSJBT02kX4"
      }
    },
    {
      "id": "7edc160b-8d5e-4273-a73c-c5b3c6936e3d",
      "title": "Shakahola Horror: Woman Recounts How Her two Sisters and their 10 Children got lost in Cult Massacre",
      "description": "A woman has given heartbreaking testimony, recounting how her two sisters and their 10 children perished in the Shakahola cult massacre. The tragedy unfolded in 2023, when followers of preacher Paul Nthenge Mackenzie, leader of Good News International Ministries, were lured into mass starvation in Shakahola Forest, Kilifi. Mackenzie was later arrested and, together with dozens of co-accused, now faces charges including murder, manslaughter, terrorism, and child abuse. The case is currently in court, where witnesses continue to give harrowing accounts of how families were lost in Kenya’s deadliest cult tragedy. The hearing continues as the full scale of the massacre is laid bare.",
      "release": "2025-08-29T15:06:49Z",
      "duration": "00:17:37",
      "explicit": false,
      "youTubeId": "CU0l-vPprgI",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CU0l-vPprgI"
      }
    },
    {
      "id": "7c7fccd4-2baf-4a0a-bc65-04f81b2d1a8f",
      "title": "Controversial Preacher Paul Mackenzie Appearing in Court for His Manslaughter Case",
      "description": "Controversial preacher Paul Mackenzie appeared in court for his manslaughter case, but the hearing failed to proceed before Justice Kavedza. The prosecution sought an adjournment to align their file and finalize amendments to the charges. Justice Kavedza expressed displeasure at the slow pace of the case and the adjournment, noting that significant public resources had already been used to set up the hearing. The matter was adjourned to Wednesday to allow the prosecution to complete the amendments.",
      "release": "2025-08-11T16:14:32Z",
      "duration": "00:34:45",
      "explicit": false,
      "youTubeId": "Hxvng6rr1J4",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Hxvng6rr1J4"
      }
    },
    {
      "id": "aa2d83cb-be3b-41a1-903e-68478f9599f2",
      "title": "Government Analyst Who Helped in Exhumation of Bodies in Shakahola Testifies",
      "description": "Government Analyst David Mumbao, who played a key role in the Shakahola massacre investigations, testified in court today on the procedures followed during the exhumation of over 400 bodies from shallow graves linked to cult leader Paul Mackenzie. Mumbao detailed the forensic methods used and the condition of the remains recovered from the forest in Kilifi County.",
      "release": "2025-07-31T16:56:34Z",
      "duration": "00:15:44",
      "explicit": false,
      "youTubeId": "A2_gpYWrULw",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A2_gpYWrULw"
      }
    },
    {
      "id": "bfe2f4ea-9fa3-409f-ab9a-af0a1348e14f",
      "title": "Malindi Children officer Sebastian Muteti testifies in Pastor Paul Mackenzie Shakahola case",
      "description": "Sebastian Muteti’s testimony painted a harrowing picture of systematic child abuse carried out under Pastor Mackenzie’s Shakahola cult. His accounts of starvation, torture, and radical indoctrination among minors deepen the weight of the charges as the trial continues, highlighting the role of civil protection agencies amid a complex criminal investigation.",
      "release": "2025-07-29T14:38:33Z",
      "duration": "00:14:48",
      "explicit": false,
      "youTubeId": "ROmfj16s304",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ROmfj16s304"
      }
    }
  ]
}