{
  "_ts": 0,
  "id": "f435b038-5a26-478b-b4b2-b146835786b4",
  "name": "Crafts \u0026 Crime",
  "spotifyId": "6vdVOaQCvpk5hb3tkbCBk4",
  "appleId": 1684383993,
  "episodes": [
    {
      "id": "796b48f8-cf14-417f-b346-cec133c7997e",
      "title": "Episode 49 - Lapidary and Angel\u0027s Landing",
      "description": "Embark on a journey through time and minerals in our latest episode on lapidary arts. Join us as we uncover the ancient craft of shaping and polishing stones, exploring the mesmerizing world of gemstones, and the skillful hands that turn rough rocks into stunning works of art. Then, unveil the chilling narrative of the Angel\u0027s Landing cult in this gripping episode, where we navigate through the dark corridors of a mysterious group that captivated followers with promises of reincarnation. Explore the psychological dynamics, the leader, and the haunting events that unfolded, as we unravel the unsettling story behind the Angel\u0027s Landing cult. SOURCES Gem tour of America. https://www.gia.edu/gem-map The History of Lapidary. https://www.gemsociety.org/article/the-history-of-lapidary/ Lapidary. Wikipedia. https://en.wikipedia.org/wiki/Lapidary Horrifying cult led by \u0027centuries-old angel\u0027 with sick sex abuse at its heart. https://www.mirror.co.uk/news/us-news/horrifying-cult-led-centuries-old-29213808 Angel’s Landing Commune: 5 Fast Facts You Need to Know. https://heavy.com/entertainment/2020/08/angels-landing-commune/ Self-Described \u0027Angel\u0027 Reigns Over Kansas Cult Through Murder, Rape And Fraud. https://www.oxygen.com/deadly-cults/crime-news/lou-castro-daniel-perez-angel-landing-cult-sara-mcgrath What Is a Cult? 10 Warning Signs. How to know when you or a loved one may be in a cult. https://www.verywellmind.com/what-is-a-cult-5078234",
      "release": "2024-04-02T07:00:00Z",
      "duration": "01:16:32.9310000",
      "explicit": true,
      "spotifyId": "2qzjFmlyZGpHNT10XQKWsF",
      "appleId": 1000651156049,
      "subjects": [
        "Angel\u0027s Landing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qzjFmlyZGpHNT10XQKWsF",
        "apple": "https://podcasts.apple.com/podcast/episode-49-lapidary-and-angels-landing/id1684383993?i=1000651156049"
      }
    }
  ]
}