{
  "_ts": 0,
  "id": "e274f8c9-d6c1-470d-b81c-46038556d60a",
  "name": "Crappy to Happy",
  "spotifyId": "5XqsXZdczcUWcIXA4ftkqp",
  "appleId": 1274672540,
  "youTubeChannelId": "UCu0oXqO_TgLjJZHg-2bMskw",
  "episodes": [
    {
      "id": "51e1052a-d43b-421b-8775-a11673e39bbd",
      "title": "How I was Recruited into a Cult with Carli McConkey",
      "description": "Carli McConkey was a naive 21yr old seeking self-improvement when she was recruited into a new age cult where she spent over 13yrs trapped and enslaved. Carli bravely shares her experience of being manipulated, coerced, and abused, explaining the psychological tactics employed by cult leaders to maintain control. After finally escaping, Carli’s struggles continued when she fought and won a defamation lawsuit brought upon her by her former cult leader. She also shares her frustration that her cult leader is currently a registered psychologist in Australia and the UK, despite regulatory bodies in both countries being made aware of the judges\u0027 rulings in this case. Carli sheds light on the complexities of recovery from cult abuse. Through sharing her story, she educates us about the red flags of cults, and highlights the importance of professionals being equipped to support cult survivors in the aftermath of their experience. For support and websites referenced in this episode: Cult Information and Family Support (CIFS) Australia https://www.cifs.org.au/ Cult Education Institute (Rick Ross) https://culteducation.com/ Connect with Carli www.carlimcconkey.com",
      "release": "2025-04-08T18:00:00Z",
      "duration": "00:49:49.3380000",
      "explicit": false,
      "spotifyId": "5zTcncprgDs1aIUwLiJso6",
      "appleId": 1000702741067,
      "youTubeId": "InKHKJVUhiY",
      "subjects": [
        "Universal Knowledge",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5zTcncprgDs1aIUwLiJso6",
        "apple": "https://podcasts.apple.com/podcast/how-i-was-recruited-into-a-cult-with-carli-mcconkey/id1274672540?i=1000702741067",
        "youtube": "https://www.youtube.com/watch?v=InKHKJVUhiY"
      }
    }
  ]
}