{
  "id": "bee51859-89cd-4de8-b319-a2721ba0537e",
  "name": "CrashCourse",
  "youTubeChannelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "episodes": [
    {
      "id": "9f31f27b-c6b6-4887-88c0-fc49a6ef9c78",
      "title": "The Secret Language of Cults: Crash Course Lecture",
      "description": "Words hold tremendous power. Cult leaders know that all too well — but so do fitness instructors, celebrities, and corporate leaders. In our world today, we are increasingly exposed to, and influenced by, complicated mazes of buzzwords, mantras, euphemisms, clichés, and redefinitions: in short, language that’s just a little bit cultish. Social commentator and author Amanda Montell presents this Crash Course lecture about linguistics, culture, and belonging. \n\nWhat’s a Crash Course Lecture?\nWhile traditional Crash Courses on our channel break open an entire school subject, a Crash Course lecture tackles a single topic in-depth. Each lecture shares the perspective of a scholar, journalist, or thinker.\n\nIntroduction: A Story of Words 00:00\nCult-ish 1:22\nChildren of Synanon 3:33\nThe Cultish Past 7:22\nThe Cultish Present 12:55\nIncantations 19:00\nEyes Wide Open 26:10\nUnder the Illusion 32:19\nExit Strategy 37:14\nThe Prestige 41:11\n\nSources:\nhttps://docs.google.com/document/d/1xym1NqBi3DhRNwag0kmvtz3Cry4pMpRe8mAOJLSFY8M/edit?tab=t.0\n\n\n***\nSupport us for $5/month on Patreon to keep Crash Course free for everyone forever! https://www.patreon.com/crashcourse\nOr support us directly: https://complexly.com/support\nJoin our Crash Course email list to get the latest news and highlights: https://mailchi.mp/crashcourse/email\nGet our special Crash Course Educators newsletter: http://eepurl.com/iBgMhY\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nEllenBryn, Johnathan Williams, Brandon Thomas, Jennifer Wiggins-Lyndall, Barbara Pettersen, Emily Beazley, Rie Ohta, Evan Nelson, Elizabeth LaBelle, Dalton Williams, Chelsea S, Allison Wood, UwU, oranjeez, Leah H., David Fanska, SpaceRangerWes, Katie Hoban, Roger Harms, Andrew Woods, Gina Mancuso, Michael Maher, Jason Terpstra, AThirstyPhilosopher ., Mitch Gresko, Reed Spilmann, Quinn Harden, Shruti S, DexcilaDou, Thomas Sully, Matthew Fredericksen, Jack Hart, Kevin Knupp, Katrix , Toni Miles, Thomas, Kyle \u0026 Katherine Callahan, Siobhán, Alan Bridgeman, team dorsey, Emily T, Triad Terrace, Jason Buster, Jennifer Killen, Wai Jack Sin, Les Aker, John Lee, Joseph Ruf, Laurel Stevens, Katie Dean, Nathan Taylor, Steve Segreto, Stephen McCandless, Alex Hackman, Ken Penttinen, Matt Curls, Sarah \u0026 Nathan Catchings, Krystle Young, Constance Urist, Eric Koslow, Scott Harrison, ClareG, Samantha, Ian Dundore, Kristina D Knight, Ken Davidian, Perry Joyce, Jason Rostoker, Bernardo Garza, Indija-ka Siriwardena, Trevin Beattie, Liz Wdow, Pietro Gagliardi, Barrett Nuzum, Rizwan Kassim, Stephen Akuffo, Duncan W Moore IV, Breanna Bosso, Tanner Hedrick, Caleb Weeks, Evol Hong, Tandy Ratliff, Erminio Di Lodovico, Luke Sluder\n__\n\nWant to find Crash Course elsewhere on the internet?\nInstagram - https://www.instagram.com/thecrashcourse/\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nBluesky - https://bsky.app/profile/thecrashcourse.bsky.social\n\nCC Kids: http://www.youtube.com/crashcoursekids",
      "release": "2025-09-16T16:00:06Z",
      "duration": "00:45:30",
      "explicit": false,
      "youTubeId": "c7wCbbmLtiI",
      "subjects": [
        "Cult Psychology",
        "Synanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c7wCbbmLtiI"
      }
    }
  ]
}