{
  "id": "1470661d-5122-4d0f-98a7-b900b544eb6c",
  "name": "CrazyOldWeirdBeardedGuy",
  "youTubeChannelId": "UCPllB4xRZFze7CATMSiQ9ug",
  "episodes": [
    {
      "id": "30645a2f-d7b5-48fe-9753-15bf850f00e1",
      "title": "Cults - Educational Film 1982",
      "description": "Educational Films that I saw in School during the 70\u0027s and 80\u0027s made up the bulk of my education away from the television. I remember many of these, and others I know I would have liked back then. I hope you enjoy this trip down memory lane.\nFor discussion on the Monday Movie Memories Edition of Mornings with CrazyOldWeirdBeardedGuy\n\n*NOTICE: ALL BORROWED CONTENT IS UPLOADED FOR EDUCATIONAL AND HISTORICAL PURPOSES, AS WELL AS THEIR ENTERTAINMENT VALUE. I MAKE NO COPYRIGHT CLAIM. *\n\n*THIS IS A NON-PROFIT CHANNEL*\n500 SUBSCRIBER CELEBRATION TELETHON coming soon\n\nBe sure to check out my other segments and shows…\n“Mornings with CrazyOldWeirdBeardedGuy” LIVE @ 5:am PST Mon-Fri\nMinecrafting Monday @ 5:pm PST\nNighttime Nonsense \u0026 Nostalgia @ 5:pm PST Friday\n“CrazyOldWeirdBeardedGuy goes to a Concert” – Playlist full of goodies from shows!\n“Sundays” – Coming soon! (postponed)\n“LIVE” – Concerts, Open Mic Events and wherever else I can find music here in the High Desert and all-over Southern California.\nThe Channel is all about…\nCoffee and Bong Hits, Nonsense and Nostalgia, It’s a different kinda show, Let’s talk old movies and TV, Let’s talk about concerts past and present, Pappy and Harriet’s, The Kia Forum, The Hollywood Bowl, The Honda Center, The Acrisure Arena, The Observatory, Word of the day, Daily Trivia, Readings from Encyclopedia Americana, Exploring the past through vintage media and materials, Ask an old guy for free advice, Technical Slow Burn, Unapologetically Me, Analog man living the digital world, Occasional Live Music, Supporting Local Artists, Open Mic Night, Downtown Joshua Tree, The High Desert Music Scene, What\u0027s going on in the Morongo Basin, Joshua Tree National Park, Amboy California, Mojave Desert, Pot Shops, Concert Stories, Record Shops, Born and Raised in SoCal, My Family, My Wife and Daughter, My Dogs Sam and Oliver and Tootsie and Bessie (RIP), Lots to see in Joshua Tree, 8 Track Cartridges players and recorders, Turntables, Cassettes and  a boombox, record player, concert tickets yesterday vs today, LSD, Psychedelic Mushrooms, Reel to Reel player recorder, Old-School conversation, Reality, I’m an open book, ask me anything, Semi Retired, Partially Disabled, Recorded Live in Joshua Tree California, Novelty T Shirts and Hats, Concert Shirts and Hats and Memorabilia, Betamax, VCRs, VHS, Black and White TV, old movies, old TV shows, Tube TV, bell bottom pants, Corduroy, argyle socks, Zig Zags, roach clips, marijuana, Bongs and waterpipes, Head Shops, Reverse Van Winkle, favorite vintage stuff, Elsinore Brothers, Elsinore Sisters, Elsinore California, Lake Elsinore California, Elsinore High School, Elsinore Jr High School, Machado Avenue Elementary School, Lakeland Village, Sedco Hills, Lake Elsinore Sahara Dunes Casino, Downtown Lake Elsinore, VK\u0027s, Rock\u0027n\u0027roll, 1970\u0027s, 1980\u0027s, Southern California, Rancho California, Temecula California, Murietta California, Barn Parties, Keg Parties, House Parties, Murietta Madness Parties, Hilltop Parties, Lake Bottom Parties, Grand Avenue, Riverside Drive, Four-Corners, JJJ Liquor, Pizza Bowl, Elsinore Grand Prix, Granada Too Restaurant, Ortega Mountains, Ortega Oaks Market, Cranes Mobile Home Park, Circle K, M\u0026M Liquor, Lake Elsinore State Park, Beachcomber RV Park, Elsinore West Marina, Yearbooks, LETS Bus, Lake Street, Peddlers Village, Radio Shack, Tower Records, KMET 94.7, KLOS 95.5, KNX 1070, Doctor Demento, Classic Radio Shows, Old Time Radio Shows, Elsie, Rome Hill, ALL TWEAKERS BURN IN HELL, Please let me know if you see my pet rat emery he got out of his cage and I think he got into the neighbors speed because he’s been acting really strange running in circles, The Neighborhood, The Avenues, Adelfa Street, Zellar Street, The Embers Bar, Blackwell Blvd, Cottrell Blvd, Corydon Road, Wildomar California, Skydive Elsinore, High Street, Canyon Lake California, Meadowbrook California, Corona California, Perris California, Sunnymead California, I-15 California, CHiPs Fallbrook California, Los Angles California, Sierra Madre Canyon, Counter-culture, Hippies, Wounded Knee 2, 1968, 1973, Boy Scouts, 1976, Growing up homeless, Elsinore Bi-Centennial parade, On the road, Pasadena City College, KPCC, 1980s Hollywood, 1970s Hollywood, Rock n Roll, Chronic Pain, Lifelong depression,  Childhood Brain Injury, Humanity\u0027s purpose, modern slavery vs capitalist greed, disposable world, lack of education in the education system, old vs new, yesterday\u0027s dream becomes tomorrow\u0027s nightmare, family values, a world with no moral compass, dictated needs and wants, forced consumerism, giveaways, raffles, drawings, little black books, don\u0027t shoot the messenger, fact becomes fact when accepted as truth, truth can be dictated, war and violence begin when logic fails, STOP BREEDING PETS AND ADOPT, just another old man dying of Laughter,",
      "release": "2025-08-05T23:00:16Z",
      "duration": "00:12:34",
      "explicit": false,
      "youTubeId": "AP0UZlg07WU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AP0UZlg07WU"
      }
    }
  ]
}