{
  "id": "0c98e173-641d-4c8e-bd9c-977bdb37960f",
  "name": "Crime \u0026 Justice",
  "youTubeChannelId": "UCAXFey2-9XBz0WZWcURKDcQ",
  "episodes": [
    {
      "id": "60cba037-65c7-4866-9f6e-5ac7783fad83",
      "title": "Pharmacist Mark Foster Led Secret Voodoo Cult Murder",
      "description": "The shocking true story of pharmacist Mark Foster who secretly led a voodoo cult in Minneapolis and orchestrated his own murder through follower Greg Friezner in a twisted religious ritual.\n\n00:00:00 Pharmacist\u0027s Dark Secret Voodoo Sex Cult\n00:05:07 Foster\u0027s Success and Spiritual Journey\n00:09:52 Technology Fortune and Murder Plan\n00:14:34 Greg Becomes Foster\u0027s First Disciple\n00:19:15 Business Troubles and Sexual Religion\n00:23:44 Company Collapse and Dark Magic\n00:28:28 Black Magic and Death Threats\n00:33:24 The Murder Plan for Immortality\n00:38:30 The Execution and Failed Soul Transfer\n00:43:27 Investigation Confession and Prison Sentences\n\nUncover the shocking truths behind real-life crime stories on Crime \u0026 Justice. Delve into captivating investigations, courtroom dramas, and the relentless pursuit of justice. From gripping mysteries to chilling criminal cases, explore the complexities of the legal system and the fight against crime.\n\n😈 Crave true crime? Subscribe to Crime \u0026 Justice for shocking stories, chilling investigations, and the relentless pursuit of justice.\nhttps://www.youtube.com/channel/UCAXFey2-9XBz0WZWcURKDcQ?sub_confirmation=1\n\n#CrimeandJustice #CrimeDocumentary #TrueCrime",
      "release": "2025-10-12T13:00:09Z",
      "duration": "00:48:30",
      "explicit": false,
      "youTubeId": "4koGELnDN7w",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4koGELnDN7w"
      }
    },
    {
      "id": "0361b5cf-3111-4098-81f1-a733907f8c79",
      "title": "Pharmacist Mark Foster\u0027s Bizarre Death Plan | Nothing Personal | FULL EPISODE | M.O: True Crime",
      "description": "Explore the extraordinary tale of pharmacist Mark Foster, who orchestrates his own demise in a bizarre death plan. Uncover the secrets of his double life as a Voodoo sex cult leader, blending spirituality with unconventional beliefs. \n\nNothing Personal - From Season 2 Episode 6: Explore Foster\u0027s journey through Santoria and Tantra, leading to a bizarre ritual that takes an unexpected turn.\n\nNothing Personal - Prepare to enter the world of the hired killer. Hosted and narrated by The Sopranos’ star Steve Schirripa, Nothing Personal: Murder for Hire is the gripping crime series that recounts the shocking true stories of cold-blooded contract killings. It’s a thrilling and ominous journey to the dark side as every episode tells the tale of a professional ‘hit’. From crimes of passion and greed to gangland executions and mafia contracts, the motives are always as colorful—and as chilling—as the cases themselves.\n\nDiscover the darkest mysteries and chilling criminal cases on M.O: True Crime. Unravel the truth behind notorious criminals and real-life investigations in a gripping exploration of intrigue and suspense.\n\nDon\u0027t forget to subscribe to be a part of the discussions on chilling stories from around the world: https://bit.ly/44SrqgE\n\n#TrueCrime #CrimeStories #CrimeChannel #CrimeInvestigation #CrimeMystery #NothingPersonal #MurderCase #MurderInvestigation #Investigation #FullEpisode #FullEpisodes #MarkFoster",
      "release": "2024-02-05T18:00:31Z",
      "duration": "00:48:17",
      "explicit": false,
      "youTubeId": "kA2f9nn7UhM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kA2f9nn7UhM"
      }
    }
  ]
}