{
  "_ts": 0,
  "id": "ed111aae-93a6-4faf-992f-ece592ac94e1",
  "name": "Crimes \u0026 Minds",
  "spotifyId": "30MnjtD8AgZG4GPo3DWg8D",
  "appleId": 1730762879,
  "episodes": [
    {
      "id": "e2174584-f75a-4668-a3ca-09129f04b4ad",
      "title": "Episode 4: Warren Jeffs Exposed: Crimes, Control, and the FLDS Church",
      "description": "Behind the peaceful look of a small religious community, a dark truth is hidden. Warren Jeffs, once the leader of the Fundamentalist Church of Jesus Christ of Latter-Day Saints (FLDS), turned a religious group into a frightening cult. He encouraged multiple marriages and taught children strict beliefs. Many people suffered because of him. He made young boys leave their families so older men could marry younger women. Jeffs had total control and frightened everyone. He was eventually caught by the police and put on trial. Evidence showed he did terrible things, like abusing young girls, which he wrongly called \u0022heavenly sessions.\u0022 Listen in as we uncover the shocking details, psychological analysis, and the pursuit of justice that continues to this day. Mental Health Resources: National Alliance on Mental Illness (NAMI): nami.org ( https://www.nami.org/Home ) National Suicide Prevention Lifeline: 988 EPISODE RESOURCES: https://abcnews.go.com/US/twisted-world-warren-jeffs-former-flds-members-speak/story?id=107493397 https://www.deseret.com/2006/8/29/19971106/warren-jeffs-timeline/ https://harvardpolitics.com/crimes-by-flds/ https://www.independent.co.uk/news/world/americas/warren-jeffs-child-bride-horrors-mormon-sect-leader-elissa-wall-a8219246.html https://www.independent.co.uk/news/world/americas/flds-documentary-netflix-warren-jeffs-b2097657.html Keep Sweet Pray and Obey - Netflix Documentary Preaching Evil: A wife on the run with Warren Jeffs Topics Discussed: FLDS (Fundamentalist Church of Jesus Christ of Latter-Day Saints) Warren Jeffs biography and leadership in FLDS Practices of polygamy and child marriage in FLDS Control and manipulation tactics by Warren Jeffs Legal issues and charges against Warren Jeffs Psychological analysis: pedophilic disorder, narcissistic personality disorder, antisocial personality disorder CONNECT WITH US: Rachel Parodneck LinkedIn | www.linkedin.com/in/rachel-parodneck Website | rpalcsw.com Instagram | @rpa_psychotherapy Joni McLeod LinkedIn | www.linkedin.com/in/joni-mcleod-b64a8722a Website | rootedmentalhealth.com Instagram | @jonimcleodlmhc",
      "release": "2024-07-30T00:00:00Z",
      "duration": "00:31:38.4220000",
      "explicit": false,
      "spotifyId": "056jGeEjZP0gGomha3X0by",
      "appleId": 1000663738789,
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/056jGeEjZP0gGomha3X0by",
        "apple": "https://podcasts.apple.com/podcast/episode-4-warren-jeffs-exposed-crimes-control-and/id1730762879?i=1000663738789"
      }
    }
  ]
}