{
  "id": "c3d9b80e-48bd-42b5-b2ec-86a8119e45ee",
  "name": "Crime \u0026 Ruin",
  "youTubeChannelId": "UCXcwOyeMSSDEDJ3C_SesJbg",
  "episodes": [
    {
      "id": "95e068b6-9bab-4310-b168-a41073e479c8",
      "title": "10 More Greedy Preachers Who Deceived Millions — Part 2",
      "description": "10 More Greedy Preachers Who Deceived Millions — Part 2 | Shocking True Stories\n\n10 Preachers Whose Ministries Sparked MAJOR Scandals \nhttps://www.youtube.com/watch?v=j9XcEVqhGHw\u0026t=83s\n\n\nDiscover the shocking true stories of 10 preachers whose ministries ended in scandal. From arrest controversies to financial fraud, these pastor scandals shocked congregations across the U.S., Canada, and Europe. This documentary reveals the dark truth behind megachurch scandals, televangelist controversies, and religious leaders who betrayed their followers\u0027 trust.\n\n🔍 PREACHER SCANDALS EXPOSED:\n0:00 - #1: Creflo Dollar (Georgia) - Arrest \u0026 $65M Jet Scandal\n\n6:50 - #2: Todd Bentley (Canada) - Lakeland Revival \u0026 Misconduct Investigation\n\n14:08 - #3: Benny Hinn (California) - Senate Investigation \u0026 Healing Fraud\n\n20:39 - #4: Shepherd Bushiri - International Fraud \u0026 Money Laundering\n\n25:16 - #5: Michael Reid (UK) - Peniel Church Sexual Misconduct\n\n30:30 - #6: Bruxy Cavey (Canada) - Meeting House Abuse Scandal\n\n38:02 - #7: Tony Anthony (UK) - Fabricated Testimony Exposed\n\n45:32 - #8: Kenneth Copeland (Texas) - Private Jet Controversy\n\n52:01 - #9: Jim Bakker - Post-Prison COVID Cure Scandal\n\n58:44 - #10: Joel Osteen (Texas) - Hurricane Harvey \u0026 Wealth Debate\n\n1:06:19 - Conclusion: Lessons on Trust \u0026 Accountability\n\n🚨 WHAT YOU\u0027LL LEARN:\nThis preacher scandal documentary covers verified cases of religious fraud, megachurch controversies, and pastoral misconduct. From prosperity gospel preachers to faith healers exposed, these true crime religious cases reveal how spiritual authority was weaponized for personal gain.\n\nFeatured Cases:\n✅ Televangelist financial scandals and Senate investigations\n✅ Ministry fraud and money laundering charges\n✅ Sexual misconduct by religious leaders\n✅ Fabricated testimonies and spiritual abuse\n✅ Prosperity gospel controversies and private jet scandals\n\nKeywords covered: pastor scandals 2024, megachurch scandals exposed, televangelist fraud cases, religious leader crimes, church financial scandals, faith healer exposed, prosperity gospel controversy, spiritual abuse stories, minister misconduct cases, Christian scandal documentary\nThese aren\u0027t allegations—these are documented scandals with court records, investigations, and real consequences. From Creflo Dollar\u0027s controversial jet fundraising to Shepherd Bushiri\u0027s international manhunt, these pastor crime stories shocked the Christian community.\n\n🎯 WHY THIS MATTERS:\nUnderstanding these religious scandals helps identify warning signs of spiritual manipulation, financial exploitation, and abuse of power. This true crime documentary provides crucial lessons about accountability in ministry and protecting vulnerable believers from predatory religious leaders.\nRelated Topics:\n\nMegachurch pastor scandals\nTelevangelist controversies exposed\nChristian ministry fraud cases\nReligious leader criminal investigations\nChurch financial transparency issues\nProsperity preacher scandals\nFaith healing fraud documented\n\n💬 JOIN THE CONVERSATION:\nWhere are you watching from? Share your thoughts on religious accountability in the comments below.\n\n📺 SUBSCRIBE for more investigative documentaries covering untold true crime stories, celebrity scandals, and cases that mainstream media won\u0027t touch.\n\n⚠️ Content Warning: This documentary discusses serious allegations including financial fraud, sexual misconduct, and abuse. Viewer discretion advised.\n\nAll cases featured are based on verified court records, investigations, and publicly available documentation.\n\nWelcome to CRIME \u0026 RUIN , your definitive source for True Crime, Unsolved Mysteries, and Criminal Psychology—all delivered in highly-researched Top 10 lists.\n\nCONNECT WITH US:\ntaxninja2026@gmail.com\n\n#truecrime #PreacherScandals #MegachurchScandals #TrueCrimeDocumentary #ReligiousFraud #PastorCrimes #TelevangelistExposed #ChurchScandals #SpiritualAbuse #CrefDollar #BennyHinn #JoelOsteen #MinistryFraud #ChristianScandals #DocumentarySeries #truecrime2024",
      "release": "2025-11-30T14:00:21Z",
      "duration": "01:11:14",
      "explicit": false,
      "youTubeId": "BZMB0FMMJ_w",
      "subjects": [
        "Jim Bakker",
        "Benny Hinn",
        "Kenneth Copeland",
        "The Meeting House",
        "Joel Osteen"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BZMB0FMMJ_w"
      }
    },
    {
      "id": "7c6f4cde-a268-4239-b98c-7e0e01d1832a",
      "title": "10 Priests \u0026 Religious Leaders Who Betrayed Their Sacred Trust",
      "description": "10 Priests \u0026 Religious Leaders Who Betrayed Their Sacred Trust | True Crime Documentary\n\nThey stood at altars. They heard confessions. They baptized children and counseled families in their darkest moments. You trusted them because you were taught to. But behind the collar, some of these men were hiding crimes that would shatter entire communities and expose institutional cover-ups that lasted decades.\nThis true crime documentary examines 10 priests and religious leaders who committed horrifying crimes—from serial abuse to cold-blooded murder. These cases include abuse that went unpunished for years, murders hidden by powerful institutions, and predators protected by the very systems meant to stop them. Each story is verified through court records, investigative journalism, and survivor testimony.\n\n🔍 CASES COVERED:\n⏱️ 0:00 – Introduction: When Trust Becomes a Weapon\n\n⏱️ 0:06 – Case #1: John Geoghan (Boston) – Over 130 victims, sparked the Spotlight investigation\n\n⏱️ 5:27 – Case #2: Hans Schmidt (NYC, 1913) – Only Catholic priest executed in US history\n\n⏱️ 10:08 – Case #3: Gerald Robinson (Toledo) – Murdered nun in ritualistic killing, cold case solved after 24 years\n\n⏱️ 16:38 – Case #4: Oliver O\u0027Grady (California) – Serial predator featured in Deliver Us From Evil documentary\n\n⏱️ 22:10 – Case #5: John Feit (Texas) – Murdered beauty queen in 1960, convicted 57 years later\n\n⏱️ 27:33 – Case #6: Matt Baker (Waco) – Baptist pastor murdered wife for insurance money and affair\n\n⏱️ 32:25 – Case #7: Ryan Erickson (Wisconsin) – Priest killed two men to cover abuse allegations, suicide before trial\n\n⏱️ 37:47 – Case #8: Richard McCormick (Massachusetts) – Serial abuser at summer camp, died in prison\n\n⏱️ 43:56 – Case #9: Abbé Pierre (France) – National hero exposed posthumously for 50\u002B years of abuse\n\n⏱️ 48:35 – Conclusion: How Institutions Protected Predators and What We Can Learn\n\nWHY THIS DOCUMENTARY MATTERS:\nThese religious leaders used their positions of authority to exploit, manipulate, and harm innocent victims. They operated within institutions that—in many cases—knew about their crimes but chose protection over accountability. From the Boston Archdiocese cover-ups to France\u0027s delayed reckoning with Abbé Pierre, these cases reveal systemic failures that allowed predators to thrive for decades.\nThis investigation examines how trusted religious figures committed murder, abuse, and betrayal while hiding behind their sacred roles. From cold cases solved through DNA to institutional scandals exposed by survivors, these shocking true stories show what happens when power goes unchecked.\n🔔 SUBSCRIBE for more true crime documentaries covering cases that demand accountability.\n💬 COMMENT BELOW: Which case shocked you most? Where are you watching from?\n\nRELATED SEARCHES:\n✅ Priests who became criminals\n✅ Religious leaders convicted of crimes\n✅ Catholic Church abuse scandal documentary\n✅ True crime priests\n✅ Horrifying crimes clergy\n✅ Religious leaders who betrayed trust\n✅ True crime documentary 2025\n✅ Shocking priest cases\n\n#TrueCrime #Documentary #Priests #ReligiousLeaders #CatholicChurch #BetrayalOfTrust #TrueCrimeStories #CriminalInvestigation #JusticeForVictimss #Accountability #DarkSecrets #SpotlightInvestigation\n\n⚠️ VIEWER DISCRETION: This documentary contains detailed descriptions of abuse, violence, and institutional misconduct. Content is intended for mature audiences interested in true crime investigation, accountability, and survivor advocacy.\n\nSOURCES \u0026 FACT-CHECKING:\nAll cases presented are based on verified court records, law enforcement reports, and credible news coverage from outlets including The Boston Globe, CNN, BBC, The Guardian, and official court documents. We prioritize accuracy, respect for victims, and accountability for institutional failures.\n\nIMPORTANT DISCLAIMER:\nThis documentary examines individual criminals who abused positions of trust within religious institutions. It is not an attack on faith, religion, or the millions of clergy who serve with integrity. Our goal is to highlight the importance of accountability and protecting the vulnerable—regardless of who the perpetrator is.\n\n.Welcome to CRIME \u0026 RUIN , your definitive source for True Crime, Unsolved Mysteries, and Criminal Psychology—all delivered in highly-researched Top 10 lists.\n\nCONNECT WITH US:\ntaxninja2026@gmail.com\n\n#TrueCrime #Documentary #Priests #ReligiousLeaders #CatholicChurch #BetrayalOfTrust #TrueCrimeStories #CriminalInvestigation #JusticeForVictimss #Accountability #DarkSecrets #SpotlightInvestigation",
      "release": "2025-11-24T22:30:23Z",
      "duration": "00:52:32",
      "explicit": false,
      "youTubeId": "hTzv-dvx_Fk",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hTzv-dvx_Fk"
      }
    },
    {
      "id": "83a3ec57-8c16-4284-8c71-9e2624f68809",
      "title": "10 Cult Leaders Whose Secret Lives Were More Evil Than Their Crimes",
      "description": "10 Cult Leaders Whose Secret Lives Were More Evil Than Their Crimes\n\nHistory remembers the final tragedies—Jonestown, Waco, the headlines. But what about the terrifying, secret lives these cult leaders lived behind the facade?\n\nwe expose the calculated cruelty hidden by charisma, wealth, and religious dogma. Discover the chilling psychological blueprints these evil men and women used to control thousands, often leading them directly to mass death. This is not just true crime; it\u0027s a masterclass in human manipulation.\n\nAre you ready to see how far cult leaders will go to hide their evil crimes? We count down the Top 10 most terrifying abuses of power ever recorded.\n\nThe Narco-Satanist who mixed drug cartels with human sacrifice.\n\nThe Self-Help Guru who branded his slaves with his initials (NXIVM Keith Raniere secret).\n\nThe chilling medical negativity bias that hid a mother’s nine infant murders (Marybeth Tinning).\n\nThe bioterror plot used to rig an election (Rajneeshpuram Oregon).\n\nThe race war prophecy used to orchestrate Hollywood slaughter (Charles Manson).\n\nIf you think you can spot a cult leader, think again. These evil figures mastered deception. Subscribe now to unlock the full, uncensored truth in this long-form documentary!\n\n⏱️ Timestamps: Navigate The Darkness\n\n0:00 - #10: Jim Jones – Jonestown Suicide \u0026 Political Murder\n\n9:19 - #9: Adolfo Constanzo – Narco-Satanist Rituals Exposed\n\n15:54 - #8: David Koresh – The Siege And The Self-Made Prophet\n\n21:56 - #7: Bhagwan Shree Rajneesh – The Guru of Greed And Bioterror\n\n27:43 - #6: Warren Jeffs (FLDS) – Prophet of Polygamy \u0026 Child Trafficking\n\n33:16 - #5: Keith Raniere (NXIVM) – Branded Sex Slaves \u0026 Corporate Cult\n\n38:53- #4:  David Berg (The Family International) – Generational Abuse Doctrine\n\n43:19 - #3: Charles Mansoon – The Race War And The Phantom Prophecy\n\n48:49- #2: Marybeth Tinning – The Slow Suffocation Of Innocence \n\n54:14- #1: Lorena Bobbitt – Mutilation And The Meaning Of Self Defence\n\nWhere are you watching this true crime documentary from? Let us know the location that shocked you most in the comments below! We read every one. If this in-depth investigation into the secret lives of evil cult leaders changed your perspective, please LIKE the video and SUBSCRIBE! Don\u0027t miss our next exploration into the hidden underbelly of power.\n\nWelcome to CRIME \u0026 RUIN , your definitive source for True Crime, Unsolved Mysteries, and Criminal Psychology—all delivered in highly-researched Top 10 lists.\n\nOn this channel, we dive deep into the world\u0027s most baffling and notorious cases. Every week, we present a new, immersive list focused on a specific corner of the criminal world:\n\n10 Most Chilling Cold Cases Still Unsolved\n\n10 Moments Serial Killers Knew They Were Caught\n\n10 Most Bizarre Crimes You\u0027ve Never Heard Of\n\n10 Forensic Breakthroughs That Caught a Killer\n\nWe believe in respectful storytelling that centers the victims while providing in-depth, factual analysis. Our faceless format ensures the focus remains on the evidence, the investigations, and the psychological profiles of those involved.\n\nIf you\u0027re an armchair detective, a forensic science enthusiast, or just obsessed with the criminal mind, hit \u0027Subscribe\u0027 and ring the bell so you never miss a new countdown!\n\nCONNECT WITH US:\ntaxninja2026@gmail.com\n\n#TrueCrime #TrueCrimeDocumentary #CultLeaders #ColdCases #SerialKillers #UnsolvedMysteries #Forensics #CriminalJustice #CrimeAnalysis  #SecretLives #EvilCrimes #CharlesManson #JimJones #DavidKoresh #NXIVM #DarkSecrets",
      "release": "2025-11-08T17:15:04Z",
      "duration": "01:00:12",
      "explicit": false,
      "youTubeId": "fMUj2YSsk6g",
      "subjects": [
        "NXIVM",
        "Bhagwan Shree Rajneesh",
        "Peoples Temple",
        "Branch Davidians",
        "Children Of God",
        "FLDS Church",
        "Adolfo Constanzo",
        "Corporate Cult",
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fMUj2YSsk6g"
      }
    },
    {
      "id": "5ab8f9d9-008b-41b1-b55b-e44cedff9ddf",
      "title": "10 Greedy Preachers Who Deceived Millions in God’s Name",
      "description": "WATCH THIS SCANDALS \n\nhttps://www.youtube.com/@Vestige_List?sub_confirmation=1\n\nhttps://www.youtube.com/watch?v=JwBQYhPS13A\n10 Mega Church Pastors Who Live Like BILLIONAIRES While Their Members Suffer\n\n10 Greedy Preachers Who Deceived Millions in God’s Name | Financial Fraud, Cults, and Mega-Church Scandals\n\nHistory is filled with powerful figures, but few wield the influence of a charismatic religious leader. This chilling countdown exposes the most shocking and infamous cases of televangelists and cult leaders who turned the promise of salvation into massive financial fraud, sexual exploitation, and apocalyptic violence.\n\nWe reveal how men built empires based on lies, used faith to fleece the vulnerable, and transformed sacred callings into criminal enterprises. From the luxury of 1980s television studios to the isolation of remote compounds, discover the truth behind the scandals that defined modern Christianity.\n\n0:42 10. Jim Bakker: The PTL Scandal \u0026 $179M Fraud (Why his Christian Theme Park was a lie)\n\n7:16 9. Jimmy Swaggart: The Fall of the Moral Enforcer (The rival\u0027s revenge and the secret life)\n\n13:40 8. Robert Tilton: The Prayer Request Dumping Scandal (The chilling truth behind the $80M ministry)\n\n19:27 7. Peter Popoff: The Earpiece \u0026 The Fake Prophet (How a Magician exposed the divine revelation)\n\n24:57 6. Jim Jones: The Architect of Jonestown (The mass murder-suicide that shook the world)\n\n25:20 5. David Koresh: The Waco Siege (51 days of terror and the final, devastating fire)\n\n31:01 4. Warren Jeffs: The Polygamy Prophet (The terrifying truth of the FLDS \u0026 child exploitation)\n\n37:10 3. Paul Schäfer: The Hell of Colonia Dignidad (The cult with ties to a brutal Nazi dictatorship)\n\n42:15 2. Tony Alamo: The Celebrity Cult Leader (The preacher who married children)\n\n47:03 1. Eddie Long: The Confidential Settlement (The megachurch scandal that remains unresolved)\n\nCult Leaders\n\nTelevangelist Scandals\n\nJim Bakker Scandal\n\nReligious Fraud\n\nGreedy Preachers\n\nWaco Siege Documentary\n\nJim Jones Jonestown\n\n\u0022Biggest financial fraud in religious history\u0022\n\n\u0022Televangelist exposés of the 1980s\u0022\n\n\u0022Cult leaders who were criminals\u0022\n\n\u0022The true story of the PTL Club collapse\u0022\n\n\u0022Unbelievable megachurch scandals\u0022\n\n\u0022Why did Jim Jones order a mass suicide\u0022\n\n\u0022The darkest side of the prosperity gospel\u0022\n\nWelcome to RISE \u0026 RUIN , your definitive source for True Crime, Unsolved Mysteries, and Criminal Psychology—all delivered in highly-researched Top 10 lists.\n\nOn this channel, we dive deep into the world\u0027s most baffling and notorious cases. Every week, we present a new, immersive list focused on a specific corner of the criminal world:\n\n10 Most Chilling Cold Cases Still Unsolved\n\n10 Moments Serial Killers Knew They Were Caught\n\n10 Most Bizarre Crimes You\u0027ve Never Heard Of\n\n10 Forensic Breakthroughs That Caught a Killer\n\nWe believe in respectful storytelling that centers the victims while providing in-depth, factual analysis. Our faceless format ensures the focus remains on the evidence, the investigations, and the psychological profiles of those involved.\n\nIf you\u0027re an armchair detective, a forensic science enthusiast, or just obsessed with the criminal mind, hit \u0027Subscribe\u0027 and ring the bell so you never miss a new countdown!\n\nCONNECT WITH US:\ntaxninja2026@gmail.com\n\n#TrueCrime #TrueCrimeDocumentary #Top10 #ColdCases #SerialKillers #UnsolvedMysteries #Forensics #CriminalJustice #CrimeAnalysis #GreedyPreachers #Cults #ReligiousScandals #Televangelist #JimBakker #Jonestown #Waco #FinancialFraud #HistoryDocumentary #DarkHistory",
      "release": "2025-10-26T15:05:01Z",
      "duration": "00:57:34",
      "explicit": false,
      "youTubeId": "j9XcEVqhGHw",
      "subjects": [
        "Peoples Temple",
        "Jim Bakker",
        "Branch Davidians",
        "Colonia Dignidad",
        "FLDS Church",
        "Alamo Christian Foundation",
        "Jimmy Swaggart Ministries",
        "Robert Tilton",
        "Peter Popoff"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j9XcEVqhGHw"
      }
    }
  ]
}