{
  "id": "81fa286e-5485-4d2d-8c78-fbd8414baa8e",
  "name": "Crime Scene Motive",
  "youTubeChannelId": "UC9hNJdgvi2BsukpCvXqcA2A",
  "episodes": [
    {
      "id": "3ae256d0-4a1c-4fcd-8b62-3df88b2c485f",
      "title": "Ruby \u0026 Jodi: A Cult of Sin and Influence — Hulu Docuseries",
      "description": "“Ruby \u0026 Jodi: A Cult of Sin and Influence — Hulu Docuseries” uncovers the disturbing story of two women whose lives became entangled in a web of manipulation, power, and toxic influence. \n\nThis chilling true crime docuseries dives into the dangerous blend of control, faith, and obsession that fueled shocking behaviors and left lasting scars on families and communities. \n\nWith themes of authority gone unchecked and blind loyalty leading to destruction, this story forces us to question how easily influence can turn into abuse.\n\nThe documentary examines Ruby and Jodi’s rise to notoriety, exploring the methods they used to gain trust, recruit followers, and enforce their twisted rules. Viewers are taken inside the world they created, where charisma masked corruption and devotion was twisted into a weapon. It shines a light on the psychological tactics employed, the dangerous power of manipulation, and the devastating impact on those who became trapped in their orbit.\n\nThrough detailed storytelling, interviews, and analysis, this docuseries captures how relationships rooted in control can spiral into criminal acts and moral collapse. It doesn’t just highlight the crimes but also the warning signs of toxic leadership and blind devotion that so many missed along the way.\n\nFor true crime fans, this episode offers more than just a retelling of events—it’s a deeper exploration into the psychology of influence, the seduction of power, and the dangers of unchecked authority. “Ruby \u0026 Jodi: A Cult of Sin and Influence” stands as both a shocking case study and a cautionary tale for today’s world, where manipulation often hides behind trust.\n\n\n\n\n\n#RubyAndJodi #TrueCrime2025 #HuluDocuseries #CultOfSin #CrimeSceneMotive #TrueCrimeCommunity #CrimeDocumentary",
      "release": "2025-10-14T04:15:06Z",
      "duration": "00:09:30",
      "explicit": false,
      "youTubeId": "kH-BsXtjfIs",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kH-BsXtjfIs"
      }
    }
  ]
}