{
  "id": "903793c7-13b8-4684-b668-11f14993b14b",
  "name": "Criminally Obsessed",
  "youTubeChannelId": "UCsj4q8PpycUpUgBc6JqE1lg",
  "episodes": [
    {
      "id": "ddcd46bb-38df-478e-9825-0817a1d1db1d",
      "title": "Mica Miller Abused For 528 days — Indictment Against J.P. Miller",
      "description": "\u0022It\u0027s abuse that doesn\u0027t leave marks on the body.\u0022 \n\nStalking, harassing, intimidating, manipulation: These are all things investigators say Myrtle Beach Pastor John-Paul Miller did to his estranged wife who\u0027s now dead. \n\nMica Miller, also known as Mica Francis, took her own life in April 2024. According to a two count federal grand jury indictment against Miller, he cyberstalked Mica from November 16th 2022 until the day she died.  It lasted 528 days. But, he didn\u0027t just watch or follow her. Instead they say he tracked her, called her repeatedly, interfered with her finances, threatened her, damaged her tires, and posted nude photos of her online and then lied about it.  \n\nWhile it took the feds 19 months to bring charges, Mica\u0027s attorney, Regina Ward couldn\u0027t be happier that Miller will be prosecuted. She called the level of abuse Mica suffered, \u0022jaw dropping\u0022 and wouldn\u0027t be surprised if more charges are filed.   \n\nIf you or someone you know is experiencing a mental struggles, you can call, chat or text the 988 Lifeline for help. The National Domestic Violence Hotline also has help and resources available. 1-800-799-SAFE (7233)\n_______________\nABOUT\nCriminally Obsessed is first on the scene, uniting fellow armchair detectives in their quest to crack the case.  \n\nFOLLOW  \nInstagram: https://www.instagram.com/criminallyobsessed\nFacebook: https://www.facebook.com/people/Criminally-Obsessed/61559218932254/\nTikTok: https://www.tiktok.com/@crmnallyobsessed\nX: https://www.twitter.com/crmnllyobsessed\n\nSUBSCRIBE \nhttps://www.youtube.com/@CriminallyObsessed?sub_confirmation=1",
      "release": "2026-01-05T23:03:52Z",
      "duration": "00:35:46",
      "explicit": false,
      "youTubeId": "NCwkJaAIawc",
      "subjects": [
        "Solid Rock Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NCwkJaAIawc"
      }
    },
    {
      "id": "d5f41e24-dc3d-496f-88b1-5f77578054e7",
      "title": "Was Ruby Franke Brainwashed? – Jodi Hildebrandt Tactics Dissected",
      "description": "Vlogging and life coaching were lucrative businesses for #RubyFranke and #JodiHildebrandt. The Utah women were admired, in demand and making a lot of money. But, it all unraveled when Ruby’s son showed up at a neighbor’s house asking them to call the police. He was emaciated and had tape on his wrists and ankles. \n\nWhat investigators discovered was dark and twisted, and a stark contrast from the front the boy’s mom and her business partner portrayed online. \n\nA new documentary on #Netflix, #EvilInfluencer, delves into the story of Jodi Hildebrandt. In an interview with Investigative Reporter @AnneTEmerson, the director of the documentary, Skye Borgman, discusses Jodi’s past, her career as a therapist, her clients, the Church of Latter-Day Saints, and her psyche. Is it possible Jodi brainwashed Ruby?\n\n_______________\nABOUT\nCriminally Obsessed is first on the scene, uniting fellow armchair detectives in their quest to crack the case.  \n\nFOLLOW  \nInstagram: https://www.instagram.com/criminallyobsessed\nFacebook: https://www.facebook.com/people/Criminally-Obsessed/61559218932254/\nTikTok: https://www.tiktok.com/@crmnallyobsessed\nX: https://www.twitter.com/crmnllyobsessed\n\nSUBSCRIBE \nhttps://www.youtube.com/@CriminallyObsessed?sub_confirmation=1",
      "release": "2025-12-29T18:00:13Z",
      "duration": "00:43:45",
      "explicit": false,
      "youTubeId": "BvvgHlPZFrM",
      "subjects": [
        "Connexions",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BvvgHlPZFrM"
      }
    },
    {
      "id": "e67e00bd-0eff-4128-9f51-95411044e7d6",
      "title": "A ‘FREE LOVE’ CULT \u0026 BIOTERRORISM? | The Viral Florida Sheriff | Izabella Loving’s Shocking Death",
      "description": "On this week’s “Criminally Obsessed,” we’re talking cults, bad parents, trial watchers … and a viral law enforcement video.\n\nKEY EPISODE MOMENTS\n00:58 – Why did a video of Volusia County, Florida Sheriff Mike Chitwood greeting a fraud suspect at the airport go viral?\n05:11 – Inside Nevada five-year-old Izabella Loving’s tragic death and the abuse she suffered that delayed her getting the help she needed\n11:48 – Senior investigative reporter Anne Emerson takes you inside the Lori Vallow Daybell courtroom to tell you what she witnessed as the ‘Doomsday Mom’ was found guilty of conspiring to murder her estranged husband, Charles Vallow \n15:36 -- Would you travel to sit in a courtroom and watch a murder trial?\n18:17 – Free love and forced labor? Learn how the Rajneeshees committed the largest bioterrorist attack in United States history – and we’ll tell you where you can find exclusive archival reporting on the cult\n\nWith 1,400 reporters spread across the country, \u0022Criminally Obsessed\u0022 is the place to stay up to date with all that’s happening in the true crime world. Our reporters and producers work their sources to unearth the most fascinating details behind these shocking tales, giving you an inside look at what’s current and trending in true crime.\n\n\n_______________\nABOUT\nCriminally Obsessed is first on the scene, uniting fellow armchair detectives in their quest to crack the case.  \n\nFOLLOW  \nInstagram: https://www.instagram.com/criminallyobsessed\nFacebook: https://www.facebook.com/people/Criminally-Obsessed/61559218932254/\nTikTok: https://www.tiktok.com/@crmnallyobsessed\nX: https://www.twitter.com/crmnllyobsessed\n\nSUBSCRIBE \nhttps://www.youtube.com/@CriminallyObsessed?sub_confirmation=1",
      "release": "2025-04-25T13:00:27Z",
      "duration": "00:25:41",
      "explicit": false,
      "youTubeId": "Jp8WF7YuWqE",
      "subjects": [
        "Chad Daybell",
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Jp8WF7YuWqE"
      }
    },
    {
      "id": "1c54bbe6-7931-424c-8c5d-3c9608a49b7b",
      "title": "THE CULT THAT POISONED AN ENTIRE TOWN | A 10-Part \u0027Wild Wild Country\u0027 Investigation from 1983-1984",
      "description": "Made famous by the Netflix series \u0022Wild Wild Country,\u0022 the Rajneeshees were a religious organization (or a cult, depending on who you ask) that moved to Oregon and attempted to take over the city of Antelope. Their ambition to control the region went so far as to poison 751 people in The Dalles, Oregon, in order to win a county election. \n\nThis archival footage is a 10-part series from KATU-TV, investigating the conflict between the community and the cutthroat organization bent on growth at all cost. \n\n0:00 -- Rajneesh, sex, and violence\n5:37 -- Meet the new neighbors\n10:51 -- Rajneesh takes over Antelope\n14:37 -- A farm turns into an illegal city\n19:06 -- “Work is called worship\u0022\n24:45 -- 100,000 people living underground?\n29:34 -- Why do smart people give up everything for Rajneesh?\n35:18 -- “A military base, rather than a commune”\n41:12 -- The myth of Bhagwan Shree Rajneesh\n45:10 -- A campaign of harassment \n\n_______________\nABOUT\nCriminally Obsessed is first on the scene, uniting fellow armchair detectives in their quest to crack the case.  \n\nFOLLOW  \nInstagram: https://www.instagram.com/criminallyobsessed\nFacebook: https://www.facebook.com/people/Criminally-Obsessed/61559218932254/\nTikTok: https://www.tiktok.com/@crmnallyobsessed\nX: https://www.twitter.com/crmnllyobsessed\n\nSUBSCRIBE \nhttps://www.youtube.com/@CriminallyObsessed?sub_confirmation=1",
      "release": "2025-04-18T13:01:31Z",
      "duration": "00:50:52",
      "explicit": false,
      "youTubeId": "loGYn7iKDyY",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=loGYn7iKDyY"
      }
    }
  ]
}