{
  "_ts": 0,
  "id": "ba5b0427-6d33-484a-94f2-ee67ae4a7189",
  "name": "Crime Stories with Nancy Grace",
  "spotifyId": "3mirnBCAE7VOzeTM5w12SJ",
  "appleId": 1193068130,
  "youTubeChannelId": "UCFgSizoPkSkkldoDslZUaYQ",
  "episodes": [
    {
      "id": "637437b1-42a5-4358-9c61-82500e1254b7",
      "title": "Friday Night Special:  \u0027PORNY\u0027 MORMON DENTIST MURDERS WIFE,  BIZARRE TWISTS LEADING TO START OF TRIAL",
      "description": "The lead up to James Craig’s trial has been bizarre.....two postponements, three different attorney teams, five added charges and a crazy action from an attorney, who allegedly set his own house on fire. Still, the Aurora dentist’s trial finally got underway yesterday. Craig faces six felony counts: Murder in the first degree Two counts of solicitation to commit tampering with physical evidence Three counts of solicitation to commit perjury in the first degree Court Documents show Craig, jailed on a murder charge of his wife, Angela Craig, still allegedly worked to convince inmates, a former mistress and even one of his own children to tamper with evidence, to plant it to make it look like Angela Craig wanted to kill herself. Prosecutors say James Craig even made a botched murder-for-hire attempt on the case’s lead detective just before a second attempt at trial last year. Craig allegedly offered people cash and dental work in return for a coverup . Craig insists he ordered poison because she asked him to. James Craig and his wife Angela were married for over 20 years. They created a beautiful family of six, loving, happy family, happy children. Between work and taking care of their children, the Craigs still manage to fit a workout into their daily routine. The husband and wife go for a run or hit the gym together almost every day, and when they return home, James Craig makes protein shakes or fruit smoothies for breakfast while Angela delves into getting the kids ready for the day. Angela complains of having a really nasty headache, along with problems focusing her eyesight. She goes to the hospital saying she felt tingly and cold. Doctors cannot figure out what\u0027s wrong with her. Angela goes to the hospital multiple times, only to be sent home. When she goes back for a third time, that\u0027s when she\u0027s checked in and her condition deteriorates, coding quickly. Angela passes away. One of Summer Brooks’ dental assistants recalls opening a package for Dr. Craig—that had potassium cyanide in it. She googles the symptoms of cyanide poisoning, and is horrified at how closely they match Angela’s symptoms. She immediately calls Craig’s partner, Ryan Redfearn, hoping he has some other explanation for the contents of the package...but he doesn’t. While visiting Angela, Redfearn tells a nurse about the cyanide, explaining there’s no medical use for the element in their practice. As a mandatory reporter, the nurse calls police. With suspicions raised, Angela Craig is sent for an autopsy with additional toxicology screening. Tests reveal the otherwise healthy mom of six died of poisoning from both cyanide and tetrahydrozoline, a common ingredient in eyedrops. While investigators have no definitive evidence Angela’s food and drinks were poisoned with cyanide, the tests reveal her cyanide levels increased while she was in the hospital. Police then check Craig\u0027s computer finding strange searches. One of them was how to poison someone, how to make poison and top five or top 10 undetectable poisons that people won\u0027t be able to find after someone has died and will not signal foul play. Less than 24 hours after his wife’s death, dentist James Toliver Craig is arrested for Angela’s murder and additionally charged with tampering with evidence. A 52-page arrest affidavit details Craig’s concerning computer searches, three poison orders, an ongoing affair, and proof Craig took several measures to cover his tracks. Police then learn the dentist allegedly tried to hire his cellmate to kill Aurora PD’s lead detective Bobbi Jo Olson for $20,000. Calling Olson the “worst, dirtiest detective,” James Craig tried to recruit Nathaniel Harris to take her out for cash or free dental work. Olson wasn’t the only person on his list. Craig also asked Harris to kill another Aurora PD officer and two inmates ‘Roger’ and ‘Tommy.’ Joining Nancy Grace today: Eric Faddis - Trial Lawyer and TV Legal Analyst, Founding Partner of Varner Faddis Elite Legal, former felony prosecutor and current criminal defense and civil litigation attorney Dr. Shavaun Scott - Psychotherapist, Author of “The Minds of Mass Killers: Understanding and Interrupting the Pathway to Violence” Fil Waters - Former homicide detective for the Houston police department, President \u0026 CEO of Kindred spirits Investigations \u0026 Security, Inc., kindredspiritsinvestigations.com Dr Ernest Chiodo - Attorney, Physician, Biomedical Engineer, Toxicologist, Author: “Toxic Tort: Medical and Legal Elements”, www.ernestpchiodo.com Steffan Tubbs - Host: \u0027Arsenic, DDS - The Bizarre Case of Dr. James Craig\u0027; Former patient of James Craig See omnystudio.com/listener for privacy information.",
      "release": "2025-07-12T00:00:00Z",
      "duration": "00:58:34.4620000",
      "explicit": false,
      "spotifyId": "1uFc1r4yLm5WQ3S3zoPTvN",
      "appleId": 1000716896510,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1uFc1r4yLm5WQ3S3zoPTvN",
        "apple": "https://podcasts.apple.com/podcast/friday-night-special-porny-mormon-dentist-murders-wife/id1193068130?i=1000716896510"
      }
    },
    {
      "id": "88443311-d372-45b0-a2ee-e410d6724e9c",
      "title": "DIDDY BEHIND BARS WEEK ONE",
      "description": "Sean \u0027Diddy\u0027 Combs, disgraced music mogul, begins a new fight for a lighter sentence. It remains unclear when the rapper will learn his punishment. Currently, Combs is preparing for his sentencing, which is scheduled for October 3, 2025. Combs was sent back to jail to await sentencing after a dramatic verdict day that saw him cleared of the most serious charges he faced—a partial victory. However, he was found guilty of two counts of transportation to engage in prostitution. It remains uncertain how much longer the disgraced rapper—who has already spent nine months in jail—may remain behind bars following his sentencing. Diddy has not been seen in public since September 2024, after his arrest on charges of racketeering conspiracy, sex trafficking, and transportation to engage in prostitution. His attorneys told the judge that he is willing to comply with the strictest bail conditions, especially after enduring ten grueling months in Brooklyn’s Metropolitan Detention Center, where he is housed with high-profile inmates such as Luigi Mangione and Sam Bankman-Fried. Combs’ trial has been explosive, featuring bizarre sexual testimony, explicit videos, and references to some of Hollywood’s biggest names. A central figure in the trial was Cassie, Diddy’s ex-girlfriend and the state’s star witness, who testified while visibly pregnant. See omnystudio.com/listener for privacy information.",
      "release": "2025-07-11T20:55:00Z",
      "duration": "00:51:38.1480000",
      "explicit": false,
      "spotifyId": "4phKbGnDBCfhyRoTbtCJqS",
      "appleId": 1000716882550,
      "youTubeId": "r9qwnb1jC-4",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4phKbGnDBCfhyRoTbtCJqS",
        "apple": "https://podcasts.apple.com/podcast/diddy-behind-bars-week-one/id1193068130?i=1000716882550",
        "youtube": "https://www.youtube.com/watch?v=r9qwnb1jC-4"
      }
    },
    {
      "id": "d204d06c-9050-40d6-9fb1-3fb2d0d47301",
      "title": "DIDDY WHAT?: COURT Hearing OVER IN JUST SECONDS 1 Week After Verdict, DEFENSE \u0022DIDDY IMAGE MAKEOVER",
      "description": "Sean \u0027Diddy\u0022 Combs\u0027 legal team drops push for expedited sentencing. Defense attorneys sought to expedite Combs\u0027 sentencing after his verdict last week, but indicated they conferred with federal prosecutors and agree on the original date proposed last week by Judge Subramanian. The decision was made yesterday, Tuesday (July 8) during a virtual quick hearing that was scheduled after Combs’ legal team requested an expedited hearing. Sentencing date set for Sean “Diddy” Combs following his federal conviction, the disgraced rap mogul will learn his fate on Oct. 3, 2025, after being found guilty on two federal counts of transporting women across state lines for prostitution but being found not guilty on the more serious crimes that can carry up to life in prison, racketing and sex trafficking. Combs\u0027 defense team is reportedly pushing for the minimum sentence of 21 to 27 months behind bars. The prosecution, on the other hand, says the sentencing guidelines call for 51 to 63 months and allegedly will likely seek an even longer sentence. Judge Subramanian previously noted the time Combs already spent in jail will count towards his final sentence. The native New Yorker and rap mogul has been jailed since his initial arrest last September and will remain behind bars until his sentencing. See omnystudio.com/listener for privacy information.",
      "release": "2025-07-09T22:35:00Z",
      "duration": "00:51:52.7770000",
      "explicit": false,
      "spotifyId": "3GVbfOATibXtZ9LHlQD7ty",
      "appleId": 1000716572662,
      "youTubeId": "39Z8cTiwKJ8",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3GVbfOATibXtZ9LHlQD7ty",
        "apple": "https://podcasts.apple.com/podcast/diddy-what-court-hearing-over-in-just-seconds-1-week/id1193068130?i=1000716572662",
        "youtube": "https://www.youtube.com/watch?v=39Z8cTiwKJ8"
      }
    },
    {
      "id": "fdae01f2-bebe-4fd7-bd28-cf22e5964915",
      "title": "DIDDY WATCH: CLOCK TICKING DOWN ON DIDDY HEARING IN JUST HOURS",
      "description": "Sean \u0027Diddy\u0027 Combs disgraced rap mogul is denied bail after being acquitted on sex trafficking, racketeering charges, the most serious charges against him that could have landed him life in prison and found guilty only of transportation to engage in prostitution. Judge Arun Subramanian set a tentative sentencing date of Oct. 3 but is considering the defense’s request for it to be sooner at a virtual hearing scheduled for tomorrow afternoon.\n Last week after \u0027Diddy\u0027s\u0027 verdict, Judge Subramanian rules from the bench Combs is a risk to public safety and must remain behind bars until his sentencing. Judge cites substantial evidence presented during the trial alleging Combs\u0027 violent history involving former partners and employees. “It is impossible for the defendant to demonstrate by clear and convincing evidence that he poses no danger,” Subramanian said from the bench.\n Unless the Judge rules in favor of the defense, Combs will spend months awaiting sentencing at a notoriously understaffed and violent Brooklyn jail where the music mogul has called home for nearly ten months. Many of Combs\u0027 victims wrote the court pleading for the rap mogul to remain behind bars in fear for their lives and safety. \n Follow Crime Stories with Nancy Grace for the latest on Sean \u0027Diddy\u0027 Combs court hearings.\n  \n  \nSee omnystudio.com/listener for privacy information.",
      "release": "2025-07-07T21:40:00Z",
      "duration": "00:38:38",
      "explicit": false,
      "spotifyId": "1ounC4y5JFU629YzJrZT1O",
      "appleId": 1000716233472,
      "youTubeId": "6dBFFsNqcqQ",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ounC4y5JFU629YzJrZT1O",
        "apple": "https://podcasts.apple.com/podcast/diddy-watch-clock-ticking-down-on-diddy-hearing-in/id1193068130?i=1000716233472",
        "youtube": "https://www.youtube.com/watch?v=6dBFFsNqcqQ"
      }
    },
    {
      "id": "83d9cf22-9b86-47b2-bd87-57e5057ffbe7",
      "title": "\u0022My Dead Children Visit Me,\u0022 Conversations With Lori Vallow",
      "description": "In less than seven hours of deliberations, twelve Idaho jurors found Lori Vallow guilty of killing her two children and her current husband’s then-wife. Vallow then faced charges of conspiring to kill Brandon Boudreaux, her niece\u0027s ex-husband. It took a jury less then 30 minutes to convict her in that trial. It was Vallow\u0027s third criminal trial in less than three years. Vallow has been convicted in the deaths of her children, Tylee Ryan and JJ Vallow, and Tammy Daybell, her current husband, Chad Daybell’s, first wife, as well as her former husband Charles. He was killed the morning of July 11. Charles Vallow goes to Lori’s rental home in Chandler, Arizona, to pick up JJ for school. Alex Cox, Lori’s brother, is also there. Within an hour, Vallow is lying in a pool of blood, shot by Alex Cox. Cox claims self-defense and is not charged. East Idaho News Reporter Nate Eaton has been following the case since JJ and Tylee went missing, and interviews Lori Vallow behind bars. Watch Nate Eaton full interview at eastidahonews.com See omnystudio.com/listener for privacy information.",
      "release": "2025-07-05T13:00:00Z",
      "duration": "01:04:37.4590000",
      "explicit": false,
      "spotifyId": "6we4MgKKkM3R5RXB6raAu7",
      "appleId": 1000715862052,
      "youTubeId": "lT1vKyy0TL0",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6we4MgKKkM3R5RXB6raAu7",
        "apple": "https://podcasts.apple.com/podcast/my-dead-children-visit-me-conversations-with-lori-vallow/id1193068130?i=1000715862052",
        "youtube": "https://www.youtube.com/watch?v=lT1vKyy0TL0"
      }
    },
    {
      "id": "e0eadf4f-c929-46eb-92ab-b1d44af6996f",
      "title": "CRY-BABY DIDDY: Diddy No Bail",
      "description": "Sean \u0022Diddy\u0022 Combs remains in jail after the split verdict in his sex trafficking trial. Next Tuesday, a bail hearing is planned for Combs, who hopes to be released until his October sentencing. Defense attorneys are pushing for a more expedited sentencing, but prosecutors say a pre-sentencing investigation is absolutely necessary in this case. Subramanian also pointed to the stark difference in the defense and prosecution’s sentencing requests as a reason to delay. Prosecutors arguments against bail are simple: detention is mandatory because he violated the Mann Act, and Combs has demonstrated over and over that he will continue to commit crimes despite any brushes with the law. Defense attorneys argue that Combs should be considered an exception to required bail, citing the conditions of the prison and responsibilities as a father and son as reasons for his release. In addition to letters from prosecutors and defense attorneys in regard to a bail decision for Sean Combs, both Cassie Ventura and Deonte Nash write letters begging the judge to consider the safety of those who testified and keep Sean Combs behind bars. Both Ventura and Nash told the judge they feared retribution after taking the stand against the mogul. Nash wrote, “If he is released now, I have no doubt he will see it as yet another license to continue intimidating, threatening, and harming people who challenge or expose him.” Joining Nancy Grace today: Troy Slaten - Los Angeles Criminal Defense Attorney, Slaten Lawyers; Twitter @TroySlaten Dr. Shari Schwartz -Forensic Psychologist (specializing in Capital Mitigation and Victim Advocacy), www.panthermitigation.com, Twitter: @TrialDoc, Author: \u0022Criminal Behavior\u0022 and \u0022Where Law and Psychology Intersect: Issues in Legal Psychology\u0022 Dr. DeWayne Hendrix - Former Associate Warden at the MDC in Brooklyn, and former Senior Warden with the US Department of Justice, Federal Bureau of Prisons, Founder and President of A New Daylight Foundation, Author: \u0022Who Are You? See it Say it and Seize it\u0022 , website: newdaylightfoundation.com , @anewdaylight (IG) @drdewaynehendrix (LinkedIn) @anewdaylight (X-Twitter) Rob Shuter - Host: Naughty But Nice Podcast, can be found at robshuter.substack.com, Former publicist of Sean Combs, IG: @naughtygossip Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors, Host of Lynn\u0027s Warriors on YouTube, website: lynnswarrior.org, X: @lynns_warriors, YouTube: @LynnsWarriors Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on Youtube, Instagram \u0026 TikTok: @TisaTellss, Facebook: Tisa.Tells.3 Sydney Sumner - CRIME STORIES Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-07-03T21:40:10Z",
      "duration": "01:01:15.7150000",
      "explicit": false,
      "spotifyId": "1gyX3MH5S2UjstXHpmVPDf",
      "appleId": 1000715646656,
      "youTubeId": "GhwoGQCWwIg",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gyX3MH5S2UjstXHpmVPDf",
        "apple": "https://podcasts.apple.com/podcast/cry-baby-diddy-diddy-no-bail/id1193068130?i=1000715646656",
        "youtube": "https://www.youtube.com/watch?v=GhwoGQCWwIg"
      }
    },
    {
      "id": "33feffee-0023-463f-ac7a-cc52f140331c",
      "title": "DIDDY GOING TO JAIL! NANCY GRACE REACTS TO DIDDY VERDICT",
      "description": "On Wednesday, the jury in the trial of Sean \u0022Diddy\u0022 Combs, which centered around allegations of trafficking and racketeering, delivered its verdict. While Diddy was acquitted on RICO, he was found guilty on two other charges and denied bail. Nancy Grace reacts to the verdict.\n\nThis episode is brought to you in part by Home Title Lock: Go to https://www.hometitlelock.com/nancygrace and use promo code NANCY to get a FREE title history report so you can find out if you’re already a victim AND 14 days of protection for FREE! And make sure to check out the Million Dollar TripleLock protection details when you get there! Exclusions apply. For details visit https://hometitlelock.com/warranty.  \n\nJoining Nancy Grace today: \n\nPhilip Dubé\nDr. Cheryl Arutt \nRobert Crispin \nRob Shuter\nLynn Shaw \nTisa Tells\nLauren Conlin \nSydney Sumner \n\nSubscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-07-03T02:09:13Z",
      "duration": "00:45:19",
      "explicit": false,
      "spotifyId": "5i9beyNbN1BvEthH9DGiEK",
      "appleId": 1000715526471,
      "youTubeId": "T8YlMSgPmBs",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5i9beyNbN1BvEthH9DGiEK",
        "apple": "https://podcasts.apple.com/podcast/diddy-going-to-jail/id1193068130?i=1000715526471",
        "youtube": "https://www.youtube.com/watch?v=T8YlMSgPmBs"
      }
    },
    {
      "id": "c11eedef-e91d-49d0-8810-20a00db5212d",
      "title": "BREAKING NEWS: Sean \u0022Diddy\u0022 Combs VERDICT - NOT Guilty on Most Serious Charges",
      "description": "On Wednesday, the jury in the trial of Sean \u0022Diddy\u0022 Combs, which centered around allegations of sex trafficking and racketeering, delivered its verdict on all charges. The jury acquitted Diddy of both racketeering conspiracy and sex trafficking, but found him guilty on two counts related to transportation for the purpose of engaging in prostitution. Nicole Partin reporting. See omnystudio.com/listener for privacy information.",
      "release": "2025-07-02T15:15:22Z",
      "duration": "00:03:26.9150000",
      "explicit": false,
      "spotifyId": "4GGJuRQmiFLXwu5W4SGXKp",
      "appleId": 1000715459082,
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4GGJuRQmiFLXwu5W4SGXKp",
        "apple": "https://podcasts.apple.com/podcast/breaking-news-sean-diddy-combs-verdict-not-guilty-on/id1193068130?i=1000715459082"
      }
    },
    {
      "id": "e5e23d9a-ef36-44f9-88e4-611b1209e9d3",
      "title": "DIDDY VERDICT WATCH: Defense Claims Violent Attacks Just \u0027Homemade Porn\u0027",
      "description": "The lead attorney for Diddy\u0027s powerhouse defense team closes with mixed reviews, as the disgraced rap mogul appears focused, glancing at the juror box as jury instructions are laid out before deliberations begin. Sean ‘Diddy’ Combs’ lead attorney, Marc Agnifilo, mocks the sex trafficking case in closing arguments, saying the charges ‘badly exaggerated’ evidence of a swinger lifestyle and threesomes with recreational drug use. Judge Arun Subramanian admonishes Agnifilo after his heavy victim- and state-blaming sarcastic closing arguments. Agnifilo calls Combs’ prosecution a “fake trial” and ridicules the notion the rap mogul ever engaged in racketeering. Even rival rapper 50 Cent weighs in about closing arguments by Combs\u0027 powerhouse defense lead, calling out Diddy\u0027s lawyer over controversial closing arguments: \u0022They Did Him Dirty.\u0022 As soon as deliberations began, they hit a snag, as one juror apparently can’t follow the judge’s instructions, according to other jurors. Jurors sent the judge a note complaining that one juror may not be playing well with others. With that said, Diddy\u0027s jury has a lot to ponder and work through on understanding RICO laws, as another question, making it the second one, is being sent to the judge. These notes appear to signify the jurors are taking their service duty seriously. Joining Nancy Grace today: Eric Faddis - Trial Lawyer and TV Legal Analyst, Founding Partner of Varner Faddis Elite Legal, former felony prosecutor and current criminal defense and civil litigation attorney Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker: When to work on a relationship and when to walk away” Also featured in hit show: \u0022Paris in Love\u0022 on Peacock, www.drbethanymarshall.com , Instagram \u0026 TikTok: drbethanymarshall, Twitter: @DrBethanyLive Robert Crispin- Private Investigator “Crispin Special Investigations”, Former Federal Task Force Officer for the United States Department of Justice, DEA and Miami Field Division. Former Homicide and Crimes against children investigator. CrispinInvestigations.com, Facebook: Crispin Special Investigations Inc. Dani Pinter - Senior Vice President and Director of Law Center, National Center on Sexual Exploitation, website: endsexualexploitation.org Rob Shuter- Host: Naughty But Nice Podcast, can be found at robshuter.substack.com, Former publicist of Sean Combs, IG: @naughtygossip Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on Youtube, Instagram \u0026 TikTok: @TisaTellss, Facebook: Tisa.Tells.3 Sydney Sumner - \u0027Crime Stories\u0027 Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-30T21:35:00Z",
      "duration": "00:54:32.2540000",
      "explicit": false,
      "spotifyId": "6gPxZypwgf4jetouSDFe9b",
      "appleId": 1000715198769,
      "youTubeId": "M4bYoHU1dgw",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6gPxZypwgf4jetouSDFe9b",
        "apple": "https://podcasts.apple.com/podcast/diddy-verdict-watch-defense-claims-violent-attacks/id1193068130?i=1000715198769",
        "youtube": "https://www.youtube.com/watch?v=M4bYoHU1dgw"
      }
    },
    {
      "id": "c3a1a0e0-254d-45b8-87d0-55c7b58716a9",
      "title": "DIDDY STRIKES BACK: STATE BRACES FOR DEFENSE CLOSING ARGUMENT",
      "description": "Sean \u0022Diddy\u0022 Combs\u0027 defense team summarized its case today as attorney Marc Agnifilo said he hopes to complete his closing arguments in about three hours. While acknowledging physical abuse between Combs and Cassie Ventura, Agnifilo described their relationship as “a great modern love story.” The high-profile trial of hip-hop mogul Sean \u0022Diddy\u0022 Combs is nearing its end. Combs is accused of sex trafficking by force, transportation to engage in prostitution, and racketeering conspiracy in a federal indictment originally filed in September 2024. He later faced two additional superseding indictments. Combs has pleaded not guilty to all charges. Follow Crime Stories with Nancy Grace for the latest updates on the Sean Combs trial. Joining Nancy Grace, Eric Faddis - Partner at Varner Faddis Elite Legal, Former Felony Prosecutor and Current Criminal Defense and Civil Litigation Attorney; Instagram: @e_fad @varnerfaddis; TikTok: @varnerfaddis Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker,\u0022 and featured in hit show \u0022Paris in Love\u0022 on Peacock; Instagram \u0026 TikTok: drbethanymarshall, X: @DrBethanyLive Brian Fitzgibbons - VP of Operations for USPA Nationwide Security; Instagram: @uspa_nationwide_security, Kingsman Philanthropic\u0027s 2022 rescue missions of women and children in Ukraine, Iraq War Veteranide_security Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors [an organization committed to ending human trafficking and sexual exploitation], Host of Lynn\u0027s Warriors on YouTube, website: lynnswarrior.org, X: @lynns_warriors, YouTube: @LynnsWarriors Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on YouTube; YouTube: @TisaTells, Instagram \u0026 TikTok: @TisaTellss Lauren Conlin- Podcaster/Reporter/Host- Co-Host of \u0022PopCrimeTV\u0022 on YouTube; Website: primetimecrimeshow.com; X- @Conlin_Lauren, Instagram: @LaurenEmilyConlin, YouTube: @PopCrimeTV Sydney Sumner-Crime Stories\u0027 Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-27T22:05:00Z",
      "duration": "00:56:26.5400000",
      "explicit": false,
      "spotifyId": "5MQRuFIOS4bxaKnO2i6sWM",
      "appleId": 1000714867610,
      "youTubeId": "wcfcCmWNx1w",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5MQRuFIOS4bxaKnO2i6sWM",
        "apple": "https://podcasts.apple.com/podcast/diddy-strikes-back-state-braces-for-defense-closing/id1193068130?i=1000714867610",
        "youtube": "https://www.youtube.com/watch?v=wcfcCmWNx1w"
      }
    },
    {
      "id": "b697da78-5b5b-43b9-bf81-9ad8274cb2cd",
      "title": "DIDDY AKA “THE BARON OF BABY OIL”  FUMES DURING STATE’S CLOSING",
      "description": "Sean \u0022Diddy\u0022 Combs used \u0022violence and fear\u0022 to run a criminal enterprise that allowed him to subject two former girlfriends to sex trafficking, a U.S. prosecutor said Thursday during closing arguments at the music mogul\u0027s trial. Prosecutor Christy Slavik told jurors that Combs \u0022uses power, violence, and fear to get what he wants,\u0022 adding, \u0022He thought that his fame, wealth, and power put him above the law.\u0022 Slavik cited Ventura Fine’s alleged involvement in several of Combs\u0027 so-called \u0022freak offs\u0022 as an example of the coercion he used during sexual encounters. Prosecutors argue Combs operated a criminal enterprise under a \u0022climate of fear.\u0022 The jury is expected to begin deliberations late Friday or Monday. Some observers say the trial has shifted from a question of whether Combs committed the acts to whether he will be held accountable Joining Nancy Grace today, Joshua Ritter - Criminal Defense Attorney, Former Prosecutor, Host of \u0022Courtroom Confidential\u0022 on YouTube; website: joshuaritter.com; Twitter, Instagram \u0026 TikTok: @joshuaritteresq, YouTube: CRConfidential Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker: When to work on a relationship and when to walk away” Also featured in hit show: \u0022Paris in Love\u0022 on Peacock, www.drbethanymarshall.com , Instagram \u0026 TikTok: drbethanymarshall, Twitter: @DrBethanyLive Joseph Giacalone -) Former NYPD Sergeant SDS, Author: “ The Cold Case Handbook” and “The Criminal Investigative Function: A Guide for New Investigators”, Podcast host of \u0022True Crime with the Sarge\u0022, YouTube: Joseph Giacalone, Twitter: @JoeGiacalone, www.josephGiacalone.com Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors - an organization committed to ending human trafficking and sexual exploitation, Host of Lynn\u0027s Warriors on YouTube, website: lynnswarrior.org, X: @lynns_warriors, YouTube: @LynnsWarriors Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on Youtube, Instagram \u0026 TikTok: @TisaTellss, Facebook: Tisa.Tells.3 Lauren Conlin - Podcaster/Reporter/Host- Co-Host of \u0022PopCrimeTV\u0022 on YouTube, Website: www.popcrime.tv and primetimecrimeshow.com, X- @Conlin_Lauren, Instagram: @LaurenEmilyConlin, YouTube: @PopCrimeTV Sydney Sumner - \u0027Crime Stories\u0027 Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-26T22:03:04Z",
      "duration": "00:54:45.8640000",
      "explicit": false,
      "spotifyId": "6mc2Nbe0JTcVOZfQccfDHJ",
      "appleId": 1000714717821,
      "youTubeId": "nZj-aaGYDHM",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6mc2Nbe0JTcVOZfQccfDHJ",
        "apple": "https://podcasts.apple.com/podcast/diddy-aka-the-baron-of-baby-oil-fumes-during-states-closing/id1193068130?i=1000714717821",
        "youtube": "https://www.youtube.com/watch?v=nZj-aaGYDHM"
      }
    },
    {
      "id": "26017304-cd4a-41e6-9c7d-5dbecfa94017",
      "title": "DIDDY SUCKS UP TO JUDGE, DEMANDS CHARGES BE THROWN OUT",
      "description": "In a stunning move, prosecutors in the federal criminal trial against disgraced rap mogul Sean “Diddy” Combs pulled back some key testimony today—specifically related to attempted kidnapping, arson, and aiding and abetting sex trafficking. This unexpected development comes just one day after Diddy addressed the court for the first time, telling Judge Arun Subramanian that he would not take the stand in his own defense. According to TMZ, in a letter issued to the judge, prosecutors stated that the government is following his instructions to “streamline” the jury instruction Joining Nancy Grace today: Philip Dubé- Former Court-Appointed Counsel, Los Angeles County Public Defenders: Criminal \u0026 Constitutional Law, Forensics \u0026 Mental Health Advocacy Dr. Chloe Carmichael - Clinical Psychologist, Author: ‘Nervous Energy: Harness The Power of Your Anxiety”, Twitter: @DrChloe, drchloe.com Brian Fitzgibbons- Director of Operations for USPA Nationwide Security, Leads a team of investigators specializing in locating missing persons, www.uspasecurity.com, Instagram: @uspa_nationwide_security, former Marine and Iraq war veteran Dani Pinter - Senior Vice President and Director of Law Center, National Center on Sexual Exploitation, website: endsexualexploitation.org Rob Shuter - Host: Naughty But Nice Podcast, can be found at robshuter.substack.com, Former publicist of Sean Combs, IG: @naughtygossip Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on Youtube, Instagram \u0026 TikTok: @TisaTellss, Facebook: Tisa.Tells.3 Sydney Sumner - \u0027Crime Stories\u0027 Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-25T20:25:00Z",
      "duration": "00:55:40.8260000",
      "explicit": false,
      "spotifyId": "6v6WB6PY9LBrSvep1vX4V0",
      "appleId": 1000714557751,
      "youTubeId": "v-nNYXKMAnQ",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6v6WB6PY9LBrSvep1vX4V0",
        "apple": "https://podcasts.apple.com/podcast/diddy-sucks-up-to-judge-demands-charges-be-thrown-out/id1193068130?i=1000714557751",
        "youtube": "https://www.youtube.com/watch?v=v-nNYXKMAnQ"
      }
    },
    {
      "id": "1c8ef361-53b4-4b1e-a63c-0547f5aa7e6e",
      "title": "DIDDY DEFENSE: BLAME IRAN",
      "description": "Iran might be the key to Sean \u0022Diddy\u0022 Combs\u0027 defense in his sex trafficking trial. Sources say his legal team may use the growing conflict in the Middle East to cast doubt on the federal case against the disgraced rap mogul. The defense may invoke the recent unrest during their closing arguments. Additionally, sources allege that Diddy\u0027s attorneys believe prosecutors have not met the burden of proof required for conviction. They may even choose to rest their case without calling any witnesses after the prosecution concludes, as both sides prepare for closing arguments scheduled for Thursday. Iran recently launched missiles at U.S. bases in the Middle East in retaliation for an earlier U.S. strike under former President Trump. It remains to be seen how the prosecution will respond if the defense uses this geopolitical context as part of its strategy Joining Nancy Grace today: Eric Faddis - Partner at Varner Faddis Elite Legal, Former Felony Prosecutor and Current Criminal Defense and Civil Litigation Attorney; Instagram: @e_fad @varnerfaddis; TikTok: @varnerfaddis Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker,\u0022 and featured in hit show \u0022Paris in Love\u0022 on Peacock; Instagram \u0026 TikTok: drbethanymarshall, X: @DrBethanyLive Brian Fitzgibbons - VP of Operations for USPA Nationwide Security; Instagram: @uspa_nationwide_security, Kingsman Philanthropic\u0027s 2022 rescue missions of women and children in Ukraine, Iraq War Veteranide_security Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors [an organization committed to ending human trafficking and sexual exploitation], Host of Lynn\u0027s Warriors on YouTube; X: @lynns_warriors, YouTube: @LynnsWarriors, Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on YouTube; YouTube: @TisaTells, Instagram \u0026 TikTok: @TisaTellss Lauren Conlin - Investigative Journalist, Host of The Outlier Podcast, and also Host of \u0022Corruption: What Happened to Grant Solomon; X- @Conlin_Lauren/ Instagram- @LaurenEmilyConlin/YouTube- @LaurenConlin4 Sydney Sumner - \u0027Crime Stories\u0027 Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-24T21:00:00Z",
      "duration": "00:53:32.5380000",
      "explicit": false,
      "spotifyId": "0odqfrDxVP0JZehQkfGH67",
      "appleId": 1000714404793,
      "youTubeId": "1N8fRHVDhgo",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0odqfrDxVP0JZehQkfGH67",
        "apple": "https://podcasts.apple.com/podcast/diddy-defense-blame-iran/id1193068130?i=1000714404793",
        "youtube": "https://www.youtube.com/watch?v=1N8fRHVDhgo"
      }
    },
    {
      "id": "e35e706e-e2fa-45cd-8f79-745c821e6264",
      "title": "Diddy’s Defense Melts Down as Prosecution Drops Bombshells?",
      "description": "Subscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-06-24T01:00:01Z",
      "duration": "00:09:32",
      "explicit": false,
      "youTubeId": "aVI8bGkvWvE",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aVI8bGkvWvE"
      }
    },
    {
      "id": "fb77bcf9-c262-41fa-bb32-0d5bc6689996",
      "title": "DIDDY PERV: LICKS LIPS, RUBS HANDS TOGETHER, WANTS EXTRA TIME FOR CASSIE SEX SCENE",
      "description": "Sean Diddy Combs\u0027 unsettling response to watching \u0027freak-off\u0027 tapes in a private part of court catches the attention of those around him in court. The rap mogul allegedly licks his lips and rubs his hands together after watching a \u0027freak-off\u0027 tape. The disgraced music mogul asks for extra time to watch tapes of his ex-girlfriend, Cassandra Ventura, having sex with male escorts while Combs watched. Diddy\u0027s defense lawyers say the videos prove the rapper was having consensual sex rather than committing crimes. As Diddy\u0027s trial comes to a close, he grants full access to his biggest Hollywood supporter, Kanye West, who is supporting the disgraced rapper. During Kanye\u0027s first appearance, the \u0022gold digger\u0022 rapper was escorted to an overflow room. Combs then adds West to his guest list and reports suggest West may attend the trial again as the defense presents their case. The jury could start deliberating as early as Friday, Sean \u0022Diddy\u0022 Combs\u0027 lawyer, Teny Geragos, tells the judge. Geragos says the defense and prosecution will each take a minimum of four hours delivering closing arguments which may begin as early Thursday. Joining Nancy Grace today: Troy Slaten - Los Angeles Criminal Defense Attorney, Slaten Lawyers; X@TroySlaten Dr. Bethany Marshall -) Psychoanalyst, Author: \u0022Deal Breaker: When to work on a relationship and when to walk away” Also featured in hit show: \u0022Paris in Love\u0022 on Peacock, www.drbethanymarshall.com , Instagram \u0026 TikTok: drbethanymarshall, Twitter: @DrBethanyLive Tom Smith - Former NYPD Detective for 30 years - Narcotics, Robbery Squad, Gang Investigations - [was also assigned to the FBI/NYPD Joint Terrorism Task Force. Co-Host of the GOLD SHIELDS Podcast]; FB \u0026 Instagram: @thegoldshieldshow Dani Pinter - Senior Vice President and Director of Law Center, National Center on Sexual Exploitation, website: endsexualexploitation.org Rob Shuter - Host: Naughty But Nice Podcast, Former Publicist of Sean Combs, IG: @naughtygossip Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on YouTube; YouTube: @TisaTells, Instagram \u0026 TikTok: @TisaTellss Lauren Conlin - Investigative Journalist, Host of The Outlier Podcast, and also Host of \u0022Corruption: What Happened to Grant Solomon; X- @Conlin_Lauren/ Instagram- @LaurenEmilyConlin/YouTube- @LaurenConlin4 Sydney Sumner - CRIME STORIES Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-23T21:25:00Z",
      "duration": "00:55:29.0970000",
      "explicit": false,
      "spotifyId": "4EeKyKCjYSsK8yBgNvZxwJ",
      "appleId": 1000714247763,
      "youTubeId": "QurNg2NvJmw",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EeKyKCjYSsK8yBgNvZxwJ",
        "apple": "https://podcasts.apple.com/podcast/diddy-perv-licks-lips-rubs-hands-together-wants-extra/id1193068130?i=1000714247763",
        "youtube": "https://www.youtube.com/watch?v=QurNg2NvJmw"
      }
    },
    {
      "id": "6c56e457-dcf1-4b83-92e9-be927e5432a9",
      "title": "Lori Vallow\u0027s Convictions Pile Up",
      "description": "It took a jury less then 30 minutes to convict already convicted murderer Lori Vallow Daybell of conspiring to kill Brandon Boudreaux, her niece\u0027s ex-husband. This is Vallow\u0027s third criminal trial in less than three years. Vallow has already been convicted in the deaths of her children, Tylee Ryan and JJ Vallow, and Tammy Daybell, her current husband, Chad Daybell’s, first wife, as well as her former husband Charles. On the morning of July 11, Charles Vallow goes to Lori’s rental home in Chandler, Arizona, to pick up JJ for school. Alex Cox, Lori’s brother, is also there. Within an hour, Vallow is lying in a pool of blood, shot by Alex Cox. Cox claims self-defense and is not charged. Later, in June 2021, a Maricopa County Grand Jury charged Lori Vallow with one count of conspiracy to commit first-degree murder, in the death of Charles Vallow. See omnystudio.com/listener for privacy information.",
      "release": "2025-06-21T13:00:00Z",
      "duration": "00:54:23.5030000",
      "explicit": false,
      "spotifyId": "1B5414V1H0G3mSx8Kteg4S",
      "appleId": 1000713955297,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1B5414V1H0G3mSx8Kteg4S",
        "apple": "https://podcasts.apple.com/podcast/lori-vallows-convictions-pile-up/id1193068130?i=1000713955297"
      }
    },
    {
      "id": "157bf78f-0250-4ca2-a88c-fff8cbaf1575",
      "title": "DOPE DIDDY:DIDDY’S DRUG MULE TELLS ALL",
      "description": "Sean \u0022Diddy\u0027 Combs federal sex trafficking and racketeering trial resumes after an expected juror illness, Wednesday and Juneteenth Holiday, Thursday. After this two day pause, the government\u0027s case winds down as they bring on their last witness, former assistant to Diddy, Brendan Paul and Diddy\u0027s alleged \u0022drug mule.\u0022 Paul is arrested in March 2024 right around the same time Combs\u0027 homes in Miami and Los Angeles were raided by federal authorities. Paul\u0027s arrest consists of coke and weed-related charges at the Miami-Opa Locka Airport that March. The former assistant\u0027s charges were ultimately dismissed after he completed a pretrial diversion program. Paul was described as a \u0022mule\u0022 for Combs in a 2024 federal lawsuit against the mogul by producer Lil Rod. \u0022He acquires, and distributes, Mr. Combs Drugs, and Guns,\u0022 the suit reads. On the stand, Paul tells jurors he was more than just an assistant, he was Diddy’s go-to man for drugs, including cocaine, ketamine, MDMA (aka “tusi”), ecstasy, prescription pills, and high-grade weed. When asked about his relationship with Combs, Paul says \u0022 it is complicated.\u0022 Paul testifies to working between 80 and 100 hours a week and the cocaine found on his person at the time of his 2024 arrest was left over from his cleaning of Diddy’s room. Paul claims he personally witnessed the use of coke, ketamine, ecstasy, weed, and more by his former boss, Diddy. See omnystudio.com/listener for privacy information.",
      "release": "2025-06-20T21:41:42Z",
      "duration": "00:45:12.6330000",
      "explicit": false,
      "spotifyId": "6RK17egIrB9YBPos3k253K",
      "appleId": 1000713888085,
      "youTubeId": "UeUfMklpAGQ",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RK17egIrB9YBPos3k253K",
        "apple": "https://podcasts.apple.com/podcast/dope-diddy-diddys-drug-mule-tells-all/id1193068130?i=1000713888085",
        "youtube": "https://www.youtube.com/watch?v=UeUfMklpAGQ"
      }
    },
    {
      "id": "b2827041-0ac1-491f-a418-ecd71fa22e5b",
      "title": "DIDDY TRIAL SCORE BOARD: WINNERS V. LOSERS, STARS V. SCARS",
      "description": "A juror’s vertigo halted another day of Sean “Diddy” Combs’ sex trafficking trial before it began. The trial will resume Friday after a break for the Juneteenth holiday on Thursday. Prosecutors had planned to rest their case this week after presenting evidence over six weeks, but the delay means they likely won’t finish until Monday. Combs’ federal racketeering and sex trafficking trial has revealed new details about the disgraced rap mogul. Text messages introduced in court included a surprising item: a list of his favorite sermons. Titled “PD’s Favorite Sermons,” the list was compiled by a YouTube account called “Assistants PD” and surfaced during Jane Doe’s testimony. Another revelation came from one of the civil sex trafficking lawsuits against Combs, which describes his chief of staff, Kristina Khorram, as “the Ghislaine Maxwell to Combs’ Jeffrey Epstein.” Prosecutors allege Combs forced Cassie Ventura to take part in so-called “freak-offs,” while the defense claims she participated voluntarily. Jurors again watched footage of Combs’ drug-fueled sex parties, with the defense showing longer clips than the prosecution. Follow Crime Stories with Nancy Grace for continuing coverage of the Sean “Diddy” Combs trial. Joining Nancy Grace today: Philip Dubé - Court-Appointed Counsel, Los Angeles County Public Defenders: Criminal \u0026 Constitutional Law; Forensics \u0026 Mental Health Advocacy Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker: When to work on a relationship and when to walk away” Also featured in hit show: \u0022Paris in Love\u0022 on Peacock, www.drbethanymarshall.com , Instagram \u0026 TikTok: drbethanymarshall, Twitter: @DrBethanyLive Chris McDonough - Director At the Cold Case Foundation, Former Homicide Detective [worked over 300 homicides in 25-year career], Trained the First Native American Homicide Task Force; Host of YouTube Channel, \u0022The Interview Room\u0022 Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors [an organization committed to ending human trafficking and sexual exploitation], Host of Lynn\u0027s Warriors on YouTube, website: lynnswarrior.org, X: @lynns_warriors, YouTube: @LynnsWarriors, Lauren Conlin - Investigative Journalist, Host of The Outlier Podcast, and also Host of \u0022Corruption: What Happened to Grant Solomon; X- @Conlin_Lauren/ Instagram- @LaurenEmilyConlin/YouTube- @LaurenConlin4 Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on YouTube; YouTube: @TisaTells, Instagram \u0026 TikTok: @TisaTellss Sydney Sumner - CRIME STORIES Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-18T20:20:00Z",
      "duration": "00:56:50.4160000",
      "explicit": false,
      "spotifyId": "5ajjcGe3TvvAGYltjcIgB2",
      "appleId": 1000713483572,
      "youTubeId": "00pbxI6kjwY",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ajjcGe3TvvAGYltjcIgB2",
        "apple": "https://podcasts.apple.com/podcast/diddy-trial-score-board-winners-v-losers-stars-v-scars/id1193068130?i=1000713483572",
        "youtube": "https://www.youtube.com/watch?v=00pbxI6kjwY"
      }
    },
    {
      "id": "9999d578-a3d8-4754-a529-38c15d8d4064",
      "title": "DIDDY EXHIBIT XXX MERRY \u0022FREAK-OFF\u0022 CHRISTMAS",
      "description": "Jurors in Sean \u0022Diddy\u0022 Combs sex trafficking trial were shown three \u0022freak off\u0022 sex tapes given to the state by Cassie Ventura. Combs mother, sister, and three sons were in the courtroom listening to his ex talk about these orgies. Jurors cringed and some turned their heads. The galley was unable to view the video. Jurors watched on small monitors with headphones. In other testimony, a paralegal specialist with the US Attorney\u0027s Office for the Southern District of New York, Ananya Sankar, said she reviewed the accuracy of the government charts that summarize exhibits. The charts show the jury text messages and other information that haven\u0027t been discussed in testimony, but were submitted into evidence. Among the evidence, texts between Combs staff planning \u0022hotel nights,\u0022 Diddy and Cassie, with Khorram and other staff discussing getting $4,000 cash to the hotel. Khorram tells assistant, Dave Shirley, “Heads up, he’s probably about to do wild king tonight.” Shirley responds, \u0022...need to reup on baby oil\u0022. The jury also sees a text from Khorram to Cassie, \u0022Hi, Dave is at your door with the green\u0022. Prosecutors say they expect to rest their case as early as tomorrow, Wednesday. Joining Nancy Grace today, Greg Morse - Criminal Defense Attorney of Morse Legal, author of “The Untested” found on Amazon; website: morselegal.com Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker: When to work on a relationship and when to walk away” Also featured in hit show: \u0022Paris in Love\u0022 on Peacock, www.drbethanymarshall.com , Instagram \u0026 TikTok: drbethanymarshall, Twitter: @DrBethanyLive Brian Fitzgibbons - Director of Operations for USPA Nationwide Security, Leads a team of investigators specializing in locating missing persons, website: www.uspasecurity.com, Instagram: @uspa_nationwide_security, former Marine and Iraq war veteran Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors - an organization committed to ending human trafficking and sexual exploitation, Host of Lynn\u0027s Warriors on YouTube, website: lynnswarrior.org, X: @lynns_warriors, YouTube: @LynnsWarriors Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on Youtube, YouTube: @TisaTells, Instagram \u0026 TikTok: @TisaTellss, Facebook: Tisa.Tells.3 Sydney Sumner - CRIME STORIES Investigative Reporter Lauren Conlin - Podcaster/Reporter/Host- Co-Host of \u0022PopCrimeTV\u0022 on YouTube, Website: www.popcrime.tv and primetimecrimeshow.com, X-p @Conlin_Lauren, Instagram: @LaurenEmilyConlin, YouTube: @PopCrimeTV See omnystudio.com/listener for privacy information.",
      "release": "2025-06-17T20:20:00Z",
      "duration": "00:55:21.4690000",
      "explicit": false,
      "spotifyId": "3ovLTn7g6m71MIkBa1071B",
      "appleId": 1000713303231,
      "youTubeId": "xxfVe0Mvf40",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ovLTn7g6m71MIkBa1071B",
        "apple": "https://podcasts.apple.com/podcast/diddy-exhibit-xxx-merry-freak-off-christmas/id1193068130?i=1000713303231",
        "youtube": "https://www.youtube.com/watch?v=xxfVe0Mvf40"
      }
    },
    {
      "id": "e68b2e86-90a0-4544-bc92-3f04304d952a",
      "title": "BABY OIL SO DEEP AT FREAK-OFF CAUSES 2 SLIP \u0026 FALLS, DIDDY \u0022MANIFESTING VERDICT,\u0022 JUROR 6 BOOTED",
      "description": "A major shakeup hits the Sean Combs trial after the judge dismisses a Black male juror. Judge Arun Subramanian says concerns emerged about the juror’s candor after he allegedly gave conflicting statements about his residence. Combs’ defense team vigorously objects to the removal of “Juror 6,” arguing it reduces the panel’s diversity. The dismissed juror is replaced by a 57-year-old alternate—a white accountant from Westchester. Paralegal specialist Ananya Sankar completes cross-examination as jurors review text messages between Sean “Diddy” Combs and his staff about purchasing drugs. In one thread, Combs’ head of security, Faheem Muhammad, receives approval to buy thousands of dollars’ worth of narcotics. Other messages between Chief of Staff Kristina Khorram and Muhammad show Combs once requested 15 MDMA pills, also known as molly or ecstasy. Joining Nancy Grace today: Troy Slaten - Los Angeles Criminal Defense Attorney, Slaten Lawyers, APC; Xr @TroySlaten Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker,\u0022 and featured in hit show \u0022Paris in Love\u0022 on Peacock; Instagram \u0026 TikTok: drbethanymarshall, X: @DrBethanyLive Jonathan Gilliam - Former Navy SEAL and FBI Special Agent, Federal Air Marshall and Police Officer, Author of “Sheep No More: The Art of Awareness and Attack Survival,” Host of the podcast “The Experts,” website: jonathantgilliam.com, IG: @RealJonathanGilliam, X: @JGilliam_SEAL; FB and YouTube: Jonathan T Gilliam Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors [an organization committed to ending human trafficking and sexual exploitation], Host of Lynn\u0027s Warriors on YouTube; X: @lynns_warriors, YouTube: @LynnsWarriors Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on Youtube, YouTube: @TisaTells, Instagram \u0026 TikTok: @TisaTellss, Facebook: Tisa.Tells.3 Lauren Conlin - Investigative Journalist, Host of The Outlier Podcast, and also Host of \u0022Corruption: What Happened to Grant Solomon; X- @Conlin_Lauren/ Instagram- @LaurenEmilyConlin/YouTube- @LaurenConlin4 Sydney Sumner - CRIME STORIES Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-16T20:12:16Z",
      "duration": "00:55:45.9460000",
      "explicit": false,
      "spotifyId": "2l4XUnQoQbm5ZNRBxLVVdg",
      "appleId": 1000713145042,
      "youTubeId": "whzBwMEN3kA",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2l4XUnQoQbm5ZNRBxLVVdg",
        "apple": "https://podcasts.apple.com/podcast/baby-oil-so-deep-at-freak-off-causes-2-slip-falls-diddy/id1193068130?i=1000713145042",
        "youtube": "https://www.youtube.com/watch?v=whzBwMEN3kA"
      }
    },
    {
      "id": "6cec1bd2-92a5-45a6-8c21-a76b7d5adf9a",
      "title": "DIDDY DUD: \u0027TITANIUM-TEETH\u0027 KANYE STINK-BOMBS DIDDY TRIAL",
      "description": "As rumored, Kanye West arrives today at his sometimes collaborator\u0027s trial as the prosecution moves into the home stretch on presenting their case to the jury against disgraced rapper Sean \u0022Diddy\u0022 combs. A recap of powerful and emotional testimony against the disgraced rapper comes from ex-girlfriend \u0022Jane\u0022 testifying under a pseudonym. Jane spent her days on the stand describing “hotel nights” with Combs, which involved her having sex with other men while he watches. Jane testifies Combs paid her rent as ‘leverage’ and treated her ‘like an animal’ Jane says she pleaded with Combs to stop pressuring her into sex acts with male escorts, and she was shocked when she learned of his lawsuit from Cassie Ventura. Jane alleges she was with Combs the night CNN releases the video of Combs\u0027 kicking Cassie at the Intercontinental Hotel during an alleged \u0022Freak off.\u0022 Judge Arun Subramanian, gives Diddy heat calling Combs out for behavior crossing the line. According to reports, Combs seen “nodding vigorously” to jurors and making eye contact while another alleged victim was on the stand, Bryana Bana Bongolan. At the same time. prosecutors seek to have a juror removed. The rapper has denied any accusations of wrongdoing See omnystudio.com/listener for privacy information.",
      "release": "2025-06-13T21:15:31Z",
      "duration": "00:55:50.2300000",
      "explicit": false,
      "spotifyId": "7AOR9kXdFIa0Si7LqpTZ8q",
      "appleId": 1000712796310,
      "youTubeId": "9mEkEJ4JWmA",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7AOR9kXdFIa0Si7LqpTZ8q",
        "apple": "https://podcasts.apple.com/podcast/diddy-dud-titanium-teeth-kanye-stink-bombs-diddy-trial/id1193068130?i=1000712796310",
        "youtube": "https://www.youtube.com/watch?v=9mEkEJ4JWmA"
      }
    },
    {
      "id": "4646af0e-758d-44e7-aefa-f875b0c7543b",
      "title": "Rhino Pills \u0026 Freak-Offs: \u0022Jane’s\u0022 Testimony Turns Courtroom Upside Down",
      "description": "Subscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-06-13T13:45:02Z",
      "duration": "00:09:01",
      "explicit": false,
      "youTubeId": "BeXCX9yWALA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BeXCX9yWALA"
      }
    },
    {
      "id": "828a2f88-48b6-42f0-be4f-7c64aec37a0e",
      "title": "Diddy’s Disturbing Pet Name for \u0022Jane\u0022 REVEALED in Court",
      "description": "Subscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-06-13T01:00:06Z",
      "duration": "00:13:55",
      "explicit": false,
      "youTubeId": "6mnnkZhbITE",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6mnnkZhbITE"
      }
    },
    {
      "id": "53db929e-7f96-4dc5-887c-3358b0e43c08",
      "title": "DIDDY 30-HOUR FREAK-OFF MARATHONS, SHAQ, KOBE, MICHAEL JORDAN SHOCKER",
      "description": "Sean “Diddy” Combs’ attorneys cross-examined his ex-girlfriend, “Jane.\u0022\n\nThis episode is brought to you in part by Home Title Lock: Go to https://www.hometitlelock.com/nancygrace and use promo code NANCY to get a FREE title history report so you can find out if you’re already a victim AND 14 days of protection for FREE! And make sure to check out the Million Dollar TripleLock protection details when you get there! Exclusions apply. For details visit https://hometitlelock.com/warranty\n\nSubscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-06-12T22:00:08Z",
      "duration": "00:44:05",
      "explicit": false,
      "spotifyId": "4vz7jbNcjmnv8TXBr5mL34",
      "appleId": 1000712487226,
      "youTubeId": "7YT8M6jsrio",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vz7jbNcjmnv8TXBr5mL34",
        "apple": "https://podcasts.apple.com/podcast/diddy-30-hour-forced-sex-marathons-shaquille-kobe-michael/id1193068130?i=1000712487226",
        "youtube": "https://www.youtube.com/watch?v=7YT8M6jsrio"
      }
    },
    {
      "id": "db75cd72-6eb4-43fe-9654-e25daa07cea9",
      "title": "DIRTY DIDDY TRIAL IN CHAOS, JUROR KICKED OFF? \u0022RHINO-ERECTILE\u0022 PILLS CENTER-STAGE",
      "description": "Prosecutors seek to remove one of the jurors — Juror No. 6 — who Sean \u0022Diddy\u0022 Combs\u0027 defense lawyers claim is among the panel’s Black members. It’s not clear what’s behind the prosecution’s request, though it has cited a \u0022lack of candor.\u0022 \u0022 Maurene Comey, one of the prosecutors, says, \u0022We did not want to do this. We were compelled to do that.\u0022 Combs ex-girlfriend identified by pseudonym \u0022Jane\u0022 returns for her sixth day on the stand. Combs\u0027 defense has attacked Jane “up and down” trying to show she agreed to sex acts, by using Combs messages as alleged proof, according to prosecutors. Prosecutors tell Judge Arun Subramanian the government expects to rest its case no later than a week from Friday and perhaps as early as Wednesday next week. One of the prosecutors, Maurene Comey, also states they will condense their case and soon will inform the court and defense which witnesses they will remove. Joining Nancy Grace today: Greg Morse - Criminal Defense Attorney of Morse Legal, author of “The Untested” found on Amazon; website: morselegal.com Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker,” featured in hit show: \u0022Paris in Love\u0022 on Peacock, www.drbethanymarshall.com , Instagram \u0026 TikTok: drbethanymarshall, Twitter: @DrBethanyLive Chris McDonough - Director At the Cold Case Foundation, Former Homicide Detective, Host of YouTube channel, \u0022The Interview Room\u0022 www.coldcasefoundation.org/chris-mcdonough Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors, Host of Lynn\u0027s Warriors on YouTube, website: lynnswarrior.org X: @lynns_warriors, YouTube: @LynnsWarriors Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on Youtube, Instagram \u0026 TikTok: @TisaTellss, Facebook: Tisa.Tells.3 Lauren Conlin - Podcaster/Reporter/Host- Co-Host of \u0022PopCrimeTV\u0022 on YouTube, Website: www.popcrime.tv and primetimecrimeshow.com, X- @Conlin_Lauren, Instagram: @LaurenEmilyConlin, YouTube: @PopCrimeTV Sydney Sumner - CRIME STORIES Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-12T20:34:11Z",
      "duration": "00:44:57.5080000",
      "explicit": false,
      "spotifyId": "5GGWq4OalRhSWiOOUNafY5",
      "appleId": 1000712644853,
      "youTubeId": "Wm3Hnm79_70",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GGWq4OalRhSWiOOUNafY5",
        "apple": "https://podcasts.apple.com/podcast/dirty-diddy-trial-in-chaos-juror-kicked-off-rhino-erectile/id1193068130?i=1000712644853",
        "youtube": "https://www.youtube.com/watch?v=Wm3Hnm79_70"
      }
    },
    {
      "id": "510eb523-16d6-49ea-a1be-17d95acf4fb1",
      "title": "Diddy Trial Witness Says She Was Treated ‘Like an Animal’ in Graphic Courtroom Testimony",
      "description": "Subscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-06-11T14:10:30Z",
      "duration": "00:13:14",
      "explicit": false,
      "youTubeId": "P0z65BCzqAc",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P0z65BCzqAc"
      }
    },
    {
      "id": "f8bd4a05-899d-49b3-8b77-59f9afb961c3",
      "title": "DISGUSTING DIDDY: VICTIM CRIES \u0027I AM NOT A PORN STAR! I AM NOT AN ANIMAL\u0027",
      "description": "\u0022Jane\u0027s\u0022 testimony continues. She testifies she grew more defiant of Combs’ “hotel nights” when he bragged about his sex life with another woman on a podcast.\n Jane sends several blunt texts the next time Combs asks for a “hotel night” while he’s with another woman. “I don’t want to be used and locked in a room to perform and fulfill your fantasies. I’m not a porn star. I’m not an animal. Coming to the realization of what this really is.” When Combs replies she’s the only one who can bring him peace, Jane snaps back, “Introduce her to ‘P.’” ” It\u0027s not me; it\u0027s the entertainment that puts you at peace.”\n Jane says her text about ‘P’ referred to one of their “entertainers,” Paul.\n After their fight about “hotel nights,” Combs promises Jane they can have a weekend in New York, just the two of them. Jane believes Combs and gets on a plane, but not long after takeoff, Combs sends Jane a text about a “surprise.” When she arrived, an “entertainer” was waiting in their hotel room.\n Combs brushed off Jane’s clear disappointment and anger in the lounge of their hotel, and Jane says she felt so defeated, she agreed to go upstairs with Combs. Just a few days later, Combs decided that night needed a part two and had the New York entertainer meet the couple in Miami. \n Jane testifies that the two-part “hotel night” went poorly because of her disappointment and distrust for the “entertainer” Combs chose, so she arranged another hotel night with a man she was more familiar with to “make it up” to Combs.\n Jane expresses in later texts to Combs that she had a hand in setting up “hotel nights” and hiring sex workers solely for her own safety against blackmail, pregnancy, and STDs, not because she wanted to participate.\n Jane reads more text messages she sent to Combs the next time he asked to see her for what she assumed would be another hotel night: “Spend the day with your family or Gina; I need time to myself.”\n In response, Combs promised that he wasn’t seeking sex at all and only wanted to spend time with her.\n Jane stood her ground, writing, “You beat the love out of us. You made it crystal clear exactly what you want me for. You’re going to spend the day love-bombing me so you can get what you want? It’s not genuine. I’ve hit a mental and spiritual wall.”\n “Jane” testifies she read Cassie’s lawsuit the second she learned of it—and fainted from shock. Jane says she was reading her own story, about her own sexual trauma, and felt even more betrayed by Combs’ constantly dismissing her reluctance to participate in “hotel nights.”\n Jane immediately confronted Combs about Cassie’s allegations in scathing texts.\n “The sick part is you knew this was coming, and you gaslit me and made me feel crazy about the sex trauma I was developing, knowing you’ve been here before. It’s all so clear that this was sexual exploitation that you framed as love for your sick fetishes.\u0022 \n Joining Nancy Grace today:  \n  Greg Morse - Criminal Defense Attorney of Morse Legal, Author of “The Untested” [found on Amazon] Dr. Bethany Marshall -  Psychoanalyst, Author: \u0022Deal Breaker,\u0022 and featured in hit show \u0022Paris in Love\u0022 on Peacock; Instagram \u0026 TikTok: drbethanymarshall, X: @DrBethanyLive Chris McDonough -  Director At the Cold Case Foundation, Former Homicide Detective [worked over 300 homicides in 25-year career], Trained the first Native American Homicide Task Force; Host of YouTube channel, \u0022The Interview Room\u0022 Dani Pinter - Senior Vice President and Director of Law Center, National Center on Sexual Exploitation Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on YouTube; YouTube: @TisaTells, Instagram \u0026 TikTok: @TisaTellss See omnystudio.com/listener for privacy information.",
      "release": "2025-06-10T21:10:00Z",
      "duration": "00:42:50",
      "explicit": false,
      "spotifyId": "4vvxb82LaVDdqkmYNZI4S0",
      "appleId": 1000712339785,
      "youTubeId": "RJXbqIw3mFU",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vvxb82LaVDdqkmYNZI4S0",
        "apple": "https://podcasts.apple.com/podcast/disgusting-diddy-victim-cries-i-am-not-a-porn-star/id1193068130?i=1000712339785",
        "youtube": "https://www.youtube.com/watch?v=RJXbqIw3mFU"
      }
    },
    {
      "id": "a9240308-d846-4c81-a6b0-59209079ecf8",
      "title": "DIRTY DIDDY MISTRIAL? \u0027HOTEL NIGHT\u0027 MOUTH SORES \u0026 UTIs GROSS OUT JURY ",
      "description": "Sean Combs arranged “hotel nights” in New York, Los Angeles, Miami, and Turks and Caicos, according to testimony from a witness identified as “Jane.” She told jurors she relied on Combs’ chief of staff, Kristina Khorram, to arrange travel, while Combs’ assistants prepared the hotel rooms with protective coverings, mood lighting, candles, lubricant, and large quantities of baby oil. She said Combs was obsessed with baby oil and claimed they used up to two dozen bottles during a single “hotel night.”\n Jane testified she met Combs during a girls’ trip to Miami hosted by a friend. Two months later, she planned to return to Miami when Combs offered to pay for her hotel room in exchange for a date.\n In the months that followed, she described a whirlwind of lavish dates and trips. She said Combs frequently offered her ketamine and ecstasy. After a 15-day trip, she said Combs gave her $10,000, saying it was compensation for keeping her away from work. That financial support soon became routine, with Combs eventually taking over her rent payments.\n Jane said that four months into the relationship, Combs asked her to fantasize about another man. In the moment, she agreed. She testified that Combs immediately made calls to arrange a session and, within hours, they were in a hotel suite set up by his assistants. The room was prepared with lighting and protective coverings, she said, and they met “Don,” a man from Cowboys for Angels.\n Believing she was fulfilling a one-time fantasy for her boyfriend, Jane agreed to have sex with Don. But she compared her consent to opening a “Pandora’s box” she could no longer close.\n Every meeting that followed involved sex with another man, she said. Although she protested, both verbally and in writing, Combs allegedly threatened to break up with her and cut off financial support if she refused.\n Jurors were reportedly shocked by Jane’s testimony describing what occurred during these “hotel nights.”\n   Joining Nancy Grace today:\n  Troy Slaten - Los Angeles Criminal Defense Attorney, Slaten Lawyers, APC; X @TroySlaten Dr. Bethany Marshall -  Psychoanalyst, Author: \u0022Deal Breaker,\u0022 and featured in hit show \u0022Paris in Love\u0022 on Peacock; Instagram \u0026 TikTok: drbethanymarshall, X: @DrBethanyLive Tisa Tells - Pop Culture Investigator \u0026 Commentator and Host of \u0027Tisa Tells\u0027 on YouTube; YouTube: @TisaTells, Instagram \u0026 TikTok: @TisaTellss Lynn Shaw -  Founder and Executive Director of Lynn\u0027s Warriors,  Host of Lynn\u0027s Warriors on YouTube;  X: @lynns_warriors, YouTube: @LynnsWarriors Rob Shuter - Host: Naughty But Nice Podcast, Former Publicist of Sean Combs, and Author: \u0022The 4 Word Answer;\u0022IG: @naughtygossip Sydney Sumner - Crime Stories  Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-09T19:01:02Z",
      "duration": "00:42:59",
      "explicit": false,
      "spotifyId": "5KJ9beezJ0x8Zqce6rp0ko",
      "appleId": 1000712140463,
      "youTubeId": "yapFn3MmU6Q",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KJ9beezJ0x8Zqce6rp0ko",
        "apple": "https://podcasts.apple.com/podcast/dirty-diddy-mistrial-hotel-night-mouth-sores-utis-gross/id1193068130?i=1000712140463",
        "youtube": "https://www.youtube.com/watch?v=yapFn3MmU6Q"
      }
    },
    {
      "id": "049c67bd-e4c1-45c2-8c52-eb3a09f0b6e1",
      "title": "DIDDY THE DANGLER: DANGLES MODEL OFF 17TH FLOOR BALCONY, JURY REACTS",
      "description": "The latest from the Trial of Diddy. Jurors in Sean \u0022Diddy\u0022 Combs\u0027 sex trial heard testimony from a witness who alleged the disgraced music mogul dangled her over a balcony. Plus more updates! Nancy Grace and her all-star panel break down the latest on a new \u0022Crime Stories with Nancy Grace.\u0022\n\nSubscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-06-06T22:00:06Z",
      "duration": "00:43:37",
      "explicit": false,
      "spotifyId": "47LU0XTC0fleeo84F5cBHH",
      "appleId": 1000711737744,
      "youTubeId": "6wxCbBVwMGk",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/47LU0XTC0fleeo84F5cBHH",
        "apple": "https://podcasts.apple.com/podcast/diddy-the-dangler-dangles-model-off-17th-floor/id1193068130?i=1000711737744",
        "youtube": "https://www.youtube.com/watch?v=6wxCbBVwMGk"
      }
    },
    {
      "id": "b8beb448-caf7-4165-a4cd-aded4fda0e45",
      "title": "DIDDY DRAMA: JUDGE THREATENS TO “THROW COMBS OUT OF COURT”",
      "description": "This week ends with more explosive testimony in the government’s case against disgraced rap mogul Sean \u0022Diddy\u0022 Combs.\n Judge Arun Subramanian threatened to remove Combs from the courtroom during the lunch break before “Jane” testified, stating he saw Combs nodding at the jury twice while his attorneys cross-examined an earlier witness. The judge warned that any further attempts to influence jurors could lead to Combs being ejected.\n Combs’ ex-girlfriend, testifying under the pseudonym “Jane,” broke down on the stand as she described drug-fueled sex marathons. She said Combs ignored her when she tried to stop and mocked her for crying after one encounter.\n Bryana “Bana” Bongolan, a graphic designer and friend of Cassie Ventura who is also suing Combs, testified Wednesday that Combs once held her over a 17-story-high balcony at a Los Angeles high-rise for 10 to 15 seconds in 2016. She said the incident left her deeply traumatized.\n Follow Crime Stories with Nancy Grace for the latest updates on the Sean \u0022Diddy\u0022 Combs sex trafficking trial\nSee omnystudio.com/listener for privacy information.",
      "release": "2025-06-06T19:45:00Z",
      "duration": "00:43:44",
      "explicit": false,
      "spotifyId": "4zEARgNtk1qaSjIKAKEv05",
      "appleId": 1000711876279,
      "youTubeId": "zeU_X8OHz5o",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4zEARgNtk1qaSjIKAKEv05",
        "apple": "https://podcasts.apple.com/podcast/diddy-drama-judge-threatens-to-throw-combs-out-of-court/id1193068130?i=1000711876279",
        "youtube": "https://www.youtube.com/watch?v=zeU_X8OHz5o"
      }
    },
    {
      "id": "ccaa8e85-6d35-4b6c-b4bd-a61662896551",
      "title": "DIDDY BUCKS: DIDDY BUSTED PAYING $100,000 FOR CASSIE BEAT DOWN VIDEO",
      "description": "Sean \u0022Diddy\u0022 Combs\u0027 2016 video of the disgraced rap mogul assaulting then girlfriend, Cassie Ventura Fine, in a Los Angeles hotel, is taking center stage again in Comb\u0027s federal sex trafficking trial. Eddy Garcia, former Intercontinental Hotel Security Guard, briefly took the stand and immediately pled the fifth. Judge Subramanian agreed to grant him immunity for his testimony, as long as he speaks the truth on the stand. The former security officer tells the court Combs paid $100,000 for a copy of the video, which shows Comb\u0027s kicking and dragging Cassie. CNN last year published the security footage. Another witness introduced in opening statements expected to testify this week. “Jane,” who alleges Combs drugged and coerced her into participating in Freak Offs by taking control of her finances. Many speculating if Combs’ Chief of Staff, Kristina Khorram will testify, and if she does—for which side. Khorram is accused of facilitating and enabling Combs’ crimes in three separate lawsuits and has previously been compared to Ghislaine Maxwell. Follow Crime Stories with Nancy Grace for the latest in Sean \u0022Diddy\u0022 Combs sex trafficking trial. Joining Nancy Grace today: Neama Rahmani - Former Federal Prosecutor-turned-Trial Attorney; Author: “Harvard to Hashtag;\u0022 INSTAGRAM: @Neamarahmani, X: @NeamaRahmani Dr. Bethany Marshall - Psychoanalyst, Author: \u0022Deal Breaker,\u0022 and featured in hit show \u0022Paris in Love\u0022 on Peacock; Instagram \u0026 TikTok: drbethanymarshall, X: @DrBethanyLive Robert Crispin - Private Investigator at “Crispin Special Investigation,\u0022 Former Federal Task Force Officer for the United States Department of Justice [DEA and Miami Field Division], Former Homicide and Crimes against children investigator; Facebook: Crispin Special Investigations Inc. Dr. Kimberly Mehlman-Orozco- Executive Director of Freedom Light, Human Trafficking Expert Witness, Author of “Hidden in Plain Sight: America’s Slaves of the New Millennium;\u0022 X: @MehlmanOrozco Dr. John Delatorre - Licensed Psychologist and Mediator (specializing in forensic psychology); Psychological Consultant to Project Absentis: a nonprofit organization that searches for missing persons; X, IG, and TikTok - @drjohndelatorre Rob Shuter - Host: Naughty But Nice Podcast, Former Publicist of Sean Combs, Author: \u0022The 4 Word Answer;\u0022 IG: @naughtygossip Lauren Conlin - Investigative Journalist, Host of The Outlier Podcast, and also Host of \u0022Corruption: What Happened to Grant Solomon; X- @Conlin_Lauren/ Instagram- @LaurenEmilyConlin/YouTube- @LaurenConlin4 Sydney Sumner - Crime Stories Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2025-06-03T22:25:00Z",
      "duration": "00:52:52.1270000",
      "explicit": false,
      "spotifyId": "1RNuQy2xbW0nqFu0FRK2iW",
      "appleId": 1000711084694,
      "youTubeId": "770N_czR0ck",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1RNuQy2xbW0nqFu0FRK2iW",
        "apple": "https://podcasts.apple.com/podcast/diddy-bucks-diddy-busted-paying-%24100-000-for-cassie/id1193068130?i=1000711084694",
        "youtube": "https://www.youtube.com/watch?v=770N_czR0ck"
      }
    },
    {
      "id": "1c3b6753-b24e-4849-b1ff-158882e57a57",
      "title": "DIDDY ON TRIAL: VICTIMS PADDLE BOARD INTO OCEAN STORM TO ESCAPE COMBS",
      "description": "Another victim in Sean \u0022Diddy\u0022 Combs\u0027 trial referred to by a pseudonym, “Mia,” former personal assistant to Sean “Diddy” Combs’ and an executive at his film studio, Revolt TV, testifies Combs allegedly assaulted her on multiple occasions. Nancy Grace and her panel break down the latest testimony. \n\nThis episode is brought to you in part by Home Title Lock: Go to https://www.hometitlelock.com/nancygrace and use promo code NANCY to get a FREE title history report so you can find out if you’re already a victim AND 14 days of protection for FREE! And make sure to check out the Million Dollar TripleLock protection details when you get there! Exclusions apply. For details visit https://hometitlelock.com/warranty\n\nSubscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-05-31T22:00:06Z",
      "duration": "00:42:27",
      "explicit": false,
      "spotifyId": "3HP2my0gvhmjOu4l6H4zXV",
      "appleId": 1000710616973,
      "youTubeId": "54ZVcf6-uBs",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3HP2my0gvhmjOu4l6H4zXV",
        "apple": "https://podcasts.apple.com/podcast/diddy-sex-victims-paddle-board-into-ocean-storm-to/id1193068130?i=1000710616973",
        "youtube": "https://www.youtube.com/watch?v=54ZVcf6-uBs"
      }
    },
    {
      "id": "0fcfd953-2e04-4055-8be2-4238e6992eef",
      "title": "DIDDY ON TRIAL | WHAT DIDDY DO? Mystery Witness Ghosts Prosecution, Will They Find Her?",
      "description": "Another victim in Sean \u0022Diddy\u0022 Combs\u0027 sex trafficking trial referred to by a pseudonym, “Mia,” former personal assistant to Sean “Diddy” Combs’ and an executive at his film studio, Revolt TV, testifies Combs allegedly sexually assaulted her on multiple occasions.\n Mia states he could become violent, once slamming her into a wall and, on another occasion, throwing her into a pool. She once worked five days straight without sleep and used the drug Adderall to stay awake. \u0022Mia\u0022 was not allowed to lock her bedroom door when staying at Combs\u0027 and could not leave his sight.\n She recalls a confrontation in 2012 when she and Cassie Ventura were barricaded in a beachside room, hiding from an enraged Combs during a vacation in Turks and Caicos, they push furniture against the door to block Combs from entering. \n  \u0022I was looking at Cass and she was screaming for help and, \u0027You have to help me, Puff is going to kill me,\u0027\u0022 \u0022Mia\u0022 recalls. \u0022She is usually chill and calm, and she was terrified.\u0022\n \u0022Mia and Cassie dash out a back door to the beach and out to a paddle board, fleeing into the water, however weather shifted drastically, sky turned black. We were both debating. I was trying to weigh if it was scarier to face Mother Nature or go back to Puff. We eventually went back to Puff.\u0022\n In cross-examination, defense Brian Steel questions Mia on her social media posts with Combs and on her communications with him in which she said, “love you” and praised him as a “mentor and inspiration She said there were exciting times in the job and the “highs were really high, and the lows were really low.”\n Follow Crime Stories with Nancy Grace for the latest in Sean \u0022Diddy\u0022 Combs\u0027 sex trafficking trial. \n Joining Nancy Grace today:\n   Troy Slaten - Los Angeles Criminal Defense Attorney, Slaten Lawyers, APC; X @TroySlaten \n   Dr. Bethany Marshall-  Psychoanalyst, Author: \u0022Deal Breaker,\u0022 and featured in hit show \u0022Paris in Love\u0022 on Peacock; Instagram \u0026 TikTok: drbethanymarshall, X: @DrBethanyLive\n   Brian Fitzgibbons - Director of Operations for USPA Nationwide Security, Leads a team of investigators specializing in locating missing persons; Instagram: @uspa_nationwide_security, former Marine and Iraq war veteran\n   Irv Brandt - Former Senior Inspector, US Marshals Service International Investigations Branch, Chief Inspector, DOJ Office of International Affairs; Country Attache, US Embassy Kingston, Jamaica. Author: “SOLO SHOT: CURSE OF THE BLUE STONE” available on Amazon, also “Forever Solo: Knight of the Dragon” also “Flying Solo: Top of the World”, “Solo Journey: Buddha Knights a Jack Solo Mystery Novel:, “Going Solo: The Gospel of Luke” Twitter: @JackSoloAuthor” \n   Lynn Shaw - Founder and Executive Director of Lynn\u0027s Warriors, an organization committed to ending human trafficking and sexual exploitation; Host of Lynn\u0027s Warriors on YouTube,  X: @lynns_warriors, YouTube: @LynnsWarriors \n   Kayla Brantley -  Reporter-At-Large for DailyMail.com and Host of DailyMail’s podcast: \u0027The Trial of Diddy;\u0027 X: @_KaylaBrantley, Instagram: @KaylaBrantley\n   Lauren Conlin - Podcaster, Reporter, Host- Co-Host of \u0022PopCrimeTV\u0022 on YouTube, website: primetimecrimeshow.com; X- @Conlin_Lauren, IG: @LaurenEmilyConlin, YouTube: @PopCrimeTV  \n   Sydney Sumner - Crime Stories Investigative Reporter\n    \nSee omnystudio.com/listener for privacy information.",
      "release": "2025-05-30T22:00:06Z",
      "duration": "00:44:24",
      "explicit": false,
      "spotifyId": "1Gjn02f1O56xf8NZxx3VYR",
      "appleId": 1000710469275,
      "youTubeId": "ab1OSpV40fk",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Gjn02f1O56xf8NZxx3VYR",
        "apple": "https://podcasts.apple.com/podcast/what-diddy-do-mystery-witness-ghosts-prosecution-will/id1193068130?i=1000710469275",
        "youtube": "https://www.youtube.com/watch?v=ab1OSpV40fk"
      }
    },
    {
      "id": "7fe18996-e916-48f0-a473-617e8602f033",
      "title": "DIDDY CAR BOMB HORROR: DESIGNER SCARF WICK, FINGERPRINTS \u0022DESTROYED\u0022",
      "description": "Sean “Diddy” Combs’s sex trafficking and racketeering trial brings more testimony about the Molotov cocktail that burned rapper Kid Cudi\u0027s car back in January 2012, with a Los Angeles police officer and an arson investigator on the stand.\n\nThis episode is brought to you in part by Home Title Lock: Go to https://www.hometitlelock.com/nancygrace and use promo code NANCY to get a FREE title history report so you can find out if you’re already a victim AND 14 days of protection for FREE! And make sure to check out the Million Dollar TripleLock protection details when you get there! Exclusions apply. For details visit https://hometitlelock.com/warranty\n\nSubscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-05-29T22:00:06Z",
      "duration": "00:44:19",
      "explicit": false,
      "spotifyId": "13gfCJwacnTDgTrBMwwBEC",
      "appleId": 1000710341781,
      "youTubeId": "cMoGE5yvylI",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/13gfCJwacnTDgTrBMwwBEC",
        "apple": "https://podcasts.apple.com/podcast/diddy-car-bomb-horror-designer-scarf-wick-fingerprints/id1193068130?i=1000710341781",
        "youtube": "https://www.youtube.com/watch?v=cMoGE5yvylI"
      }
    },
    {
      "id": "7df984f5-76a8-4b25-be2c-536470d21fac",
      "title": "The Jury Can’t Ignore THIS in the Diddy Trial",
      "description": "#Diddy Trial: Lisa Kennedy and Nancy Grace on the Bombshell the Jury Can’t Overlook\n\nSubscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-05-29T16:17:02Z",
      "duration": "00:08:20",
      "explicit": false,
      "youTubeId": "6Wmjp6j3x_I",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6Wmjp6j3x_I"
      }
    },
    {
      "id": "286c13c8-bcb6-49b4-ab92-d3e68dc4747e",
      "title": "DIDDYFIED: SEAN COMBS ASSISTANT SO STRESSED SHE GOES BALD | DIDDY ON TRIAL",
      "description": "Combs\u0027 former assistant, Capricorn Clark, testifies through tears at the former hip-hop mogul\u0027s trial that Diddy allegedly kidnapped her. Clark\u0027s also testified that Combs wanted to kill Kid Cudi. Nancy Grace and her panel break down the latest testimony on \u0022Crime Stories with Nancy Grace.\u0022\n\nThis episode is brought to you in part by Home Title Lock: Go to https://www.hometitlelock.com/nancygrace and use promo code NANCY to get a FREE title history report so you can find out if you’re already a victim AND 14 days of protection for FREE! And make sure to check out the Million Dollar TripleLock protection details when you get there! Exclusions apply. For details visit https://hometitlelock.com/warranty\n\nSubscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-05-28T22:00:21Z",
      "duration": "00:44:00",
      "explicit": false,
      "spotifyId": "412Dj536a6PDhi7QJR61MP",
      "appleId": 1000710175385,
      "youTubeId": "2lgnAK47Hy8",
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/412Dj536a6PDhi7QJR61MP",
        "apple": "https://podcasts.apple.com/podcast/diddyfied-sean-combs-assistant-so-stressed-she-goes-bald/id1193068130?i=1000710175385",
        "youtube": "https://www.youtube.com/watch?v=2lgnAK47Hy8"
      }
    },
    {
      "id": "76a75cb0-7ac9-41dd-ae73-2c5655ac83af",
      "title": "“THE PUNISHER” Speaks Out After EXPLOSIVE Diddy Testimony, Joins Nancy Grace",
      "description": "\u0022The Punisher\u0022 Speaks: Dancer Who Testified in Diddy Trial Joins Nancy Grace. Listen to the Full Program: https://link.podtrac.com/7dbnc4o8\n\nSubscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2025-05-28T15:45:04Z",
      "duration": "00:11:44",
      "explicit": false,
      "youTubeId": "nEUceWvsp5Q",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nEUceWvsp5Q"
      }
    },
    {
      "id": "d493efac-8ff4-480e-a2b6-651cb659c519",
      "title": "Mormon Mom CHARGED W/POISONING HUBBY \u0027DEAD BY COCKTAIL\u0027 CLAIMS RIGHTS VIOLATED",
      "description": "Kouri Richins\u0027 defense alleges that the Summit County Sheriff’s Office illegally obtained evidence while investigating the death of Eric Richins. Defense attorneys Kathy Nester and Wendy Lewis say detectives violated Richins\u0027 constitutional rights and argue that the evidence should be ruled inadmissible during her murder trial. At the center of the motion are the \u0022Walk the Dog\u0022 letter and data from her phone and Apple accounts. Defense attorneys argue that investigators took Kouri’s phone without a proper warrant and failed to inform her of her right to remain silent, her right to request a lawyer, and her right to refuse questioning. The case began when Eric Richins became violently ill on multiple occasions after having dinner with his wife, Kouri. The couple, who owned a successful real estate business, was celebrating a big sale when Kouri Richins prepared a drink for her husband. She then went to care for their children. Hours later, when she went to bed, Eric Richins was dead. Investigators believe his wife killed him by putting a fatal dose of fentanyl in his drink. Police also discovered that Kouri Richins attempted to change the beneficiary of her husband\u0027s life insurance policy. Joining Nancy Grace Today: Jeffrey Wolf - Criminal Defense Attorney; Twitter: @JeffWolf5280 and @WolfLawLLC Dr. Angela Arnold - Psychiatrist, Atlanta GA.- Expert in the Treatment of Pregnant/Postpartum Women; Former Assistant Professor of Psychiatry, Obstetrics and Gynecology: Emory University; Former Medical Director of The Psychiatric Ob-Gyn Clinic at Grady Memorial Hospital Bobby Chacon - Former Special Agent FBI, Screenwriter for “Criminal Minds;” Instagram/Twitter: @BobbyChaconFBI Dr. Paul Christo - Opioid Expert, Associate Professor for The John Hopkins School of Medicine, Division of Pain Medicine; Author and Host of \u0022Aches \u0026 Gains: A Comprehensive Guide To Overcoming Your Pain\u0022 Dr. Kendall Crowns- Chief Medical Examiner Tarrant County (Ft Worth), Lecturer: University of Texas Austin and Texas Christian University Medical School Jen Smith- Chief Reporter for DailyMail.com, Twitter: @jen_e_smith See omnystudio.com/listener for privacy information.",
      "release": "2025-03-16T16:00:00Z",
      "duration": "00:54:26.6380000",
      "explicit": false,
      "spotifyId": "3amBUZkcrGTwvLQaOamlND",
      "appleId": 1000699384526,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3amBUZkcrGTwvLQaOamlND",
        "apple": "https://podcasts.apple.com/podcast/mormon-mom-charged-w-poisoning-hubby-dead-by-cocktail/id1193068130?i=1000699384526"
      }
    },
    {
      "id": "4eebf5ee-f724-48cc-a331-a748215940ae",
      "title": "BLOODY AMBUSH ON 2 KANSAS MOMS;  AUTOPSIES SHOW TORTURE?",
      "description": "The full autopsy reports on Veronica Butler and Jillian Kelley have been released. Both reports identify the cause of death as multiple sharp force trauma. The reports list a total of 30 wounds on each victim, including 9 stab wounds and 21 cuts. Many of Butler\u0027s wounds were consistent with defensive injuries. A police affidavit states that Tifany Adams allegedly made statements implicating herself in the deaths of Butler and Kelley. Investigators believe Butler and Kelley were lured to the location, arriving around 9:40 a.m. Officers found pools of blood, Butler’s glasses on the ground, and a broken hammer at the scene. Police believe the women were then forced into another vehicle. The probable cause affidavit contains extensive details, but the women’s causes of death were not initially disclosed. Their bodies were discovered in a cattle pasture leased by Tad Bert Cullum, the boyfriend of Tifany Adams. Cellphone data from three burner phones purchased by Adams helped narrow down the location. The phones first pinged near Butler\u0027s abandoned car, and the data later led police to the pasture. Officers found signs of digging. A hole, which had been refilled, contained the bodies of the two women. Investigators cite a custody battle over Butler’s two children as the motive. The custody dispute had lasted more than five years. Butler’s ex-partner, Wrangler Rickman, who is Adams’ son, had custody of the children. However, Rickman was confirmed to be in a rehabilitation facility in Oklahoma City at the time. Butler was allowed supervised visitation with her children every Saturday. According to her attorney, she was likely to gain unsupervised visitation in an upcoming hearing. The affidavit states, “Adams vehemently opposed this and went to great lengths to plan and purchase items used in Butler and Kelley’s murders.” It continues, “Adams, Cullum, Cole, and Cora were willing to kidnap and murder two victims to limit visitation for Butler.” Court documents also allege that Adams and her accomplices attempted to kill Butler in February. Adams, her boyfriend, and another couple reportedly drove to Butler’s home near Hugoton, Kansas, intending to kill her. A witness told investigators the plan was to throw an anvil through Butler’s windshield to make it appear as an accident, but Butler did not leave her home. State investigators retrieved data from Adams’ phone showing searches for terms such as “taser pain level,” “gun shops,” “prepaid cellular phones,” and “how to get someone out of their house.” According to the documents, Adams purchased five stun guns before the women disappeared. She also bought three prepaid burner phones from a nearby Walmart. All the burner phones stopped transmitting on the morning of the women’s disappearance. After the attack, the bodies were reportedly stored in a sealed freezer before being buried 4 to 8 feet underground. Joining Nancy Grace Today: Kelly Hyman- Trial \u0026 Civil Attorney, TV Legal Analyst, Podcast Host: \u0022Once Upon a Crime In Hollywood\u0022, Twitter: @kellyhyman1, TikTok: @kelly.hyman, Instagram: @Kelly_Hyman1 Sheryl McCollum – Forensics Expert \u0026 Cold Case Investigative Research Institute Founder; Host of Podcast: “Zone 7;” X: @149Zone7 Irv Brandt – Senior Inspector, US Marshals Service International Investigations Branch; Chief Inspector, DOJ Office of International Affairs, US Embassy Kingston, Jamaica; Author: “SOLO SHOT: CURSE OF THE BLUE STONE” – AVAILABLE ON AMAZON IN JANUARY; ALSO “FLYING SOLO: Top of the World;” Twitter: @JackSoloAuthor Dr. Kendall Crowns – Chief Medical Examiner Tarrant County (Ft Worth) and Lecturer: University of Texas Austin and Texas Christian University Medical School Lauren Conlin – Investigative Journalist, Host of The Outlier Podcast, and also Host of “Corruption: What Happened to Grant Solomon; X- @Conlin_Lauren/ Instagram- @LaurenEmilyConlin/YouTube- @LaurenConlin4 See omnystudio.com/listener for privacy information.",
      "release": "2024-12-15T17:00:00Z",
      "duration": "00:52:36.6360000",
      "explicit": false,
      "spotifyId": "07OUVNWQNOP4nj8a3ptSEH",
      "appleId": 1000680441588,
      "subjects": [
        "God\u0027s Misfits"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07OUVNWQNOP4nj8a3ptSEH",
        "apple": "https://podcasts.apple.com/podcast/bloody-ambush-on-2-kansas-moms-autopsies-show-torture/id1193068130?i=1000680441588"
      }
    },
    {
      "id": "3c0c2371-36bc-441a-974e-4aa8f58a1b99",
      "title": "Lori Vallow Claims Daughter Tylee Killed her Brother|Crime Alert Recap Saturday 10.12.24",
      "description": "Breaking crime news as it happens throughout the day! Follow \u0022Crime Alert Hourly Update\u0022 now on your favorite podcast app: https://link.chtbl.com/Crime_Alert Here\u0027s one of our top stories this week. Cult Mom Lori Vallow alledges that daughter Tylee killed her brother then committed suicide. Stay informed, stay safe, and stay ahead with \u0022Crime Alert Hourly Update.” See omnystudio.com/listener for privacy information.",
      "release": "2024-10-12T16:00:00Z",
      "duration": "00:07:23.0880000",
      "explicit": false,
      "spotifyId": "3Ej4bYCXJnRrZIccMRjHS7",
      "appleId": 1000672820392,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Ej4bYCXJnRrZIccMRjHS7",
        "apple": "https://podcasts.apple.com/podcast/lori-vallow-claims-daughter-tylee-killed-her-brother/id1193068130?i=1000672820392"
      }
    },
    {
      "id": "ee9bacda-5b27-4375-93d5-915f6201cd76",
      "title": "DIDDY NO BOND: \u0022FREAK-OFFS\u0022 SEX ABUSE LASTING DAYS, LEFT VICTIMS NEEDING IV DRIPS",
      "description": "Sean Combs is back in the Metropolitan Detention Center after U.S. District Judge Andrew Carter denied his appeal of the remand order. Magistrate Judge Robyn F. Tarnofsky initially denied bail for the rapper on Tuesday, stating that Combs posed a danger and quoting, \u0022I don’t know that you can trust yourself not to harm people.\u0022 In the appeal for monitored house arrest, Combs\u0027 attorney described the conditions at the Brooklyn facility as \u0022horrific\u0022 and \u0022not fit for pre-trial detention.\u0022 The defense proposed that Combs live alone at his Florida home, monitored by a 24/7 security team. Combs offered to relinquish access to his cell phone and the internet. The defense also suggested travel restrictions, noting that Combs had already surrendered his passport to his attorneys months ago. His attorney also holds the passports of Combs\u0027 mother and dependent children. The proposed travel limits would confine Combs to the Southern District of New York and the Southern District of Florida, where he resides and has necessary medical appointments, details of which would be submitted under seal. Attorney Marc Agnifilo’s amended bail package proposed no communication with women outside of direct family members and the mothers of his children, as well as no contact with known grand jury witnesses, specifically referencing \u0022Victim 1,\u0022 Cassandra Ventura. The proposal also included the use of a private intelligence agency to monitor Combs 24/7, ensure he has no access to a cell phone or the internet, administer weekly drug tests, and maintain a daily visitors log. In the end, Judge Andrew Carter, Jr. agreed with Judge Robyn Tarnofsky, stating that \u0022there is no condition or combination of conditions to ensure he will not obstruct justice or tamper with witnesses.\u0022 Sean Combs remains in the Metropolitan Detention Center in Brooklyn until his trial. JOINING NANCY GRACE TODAY: Tim Jansen – Criminal Defense Lawyer and Former Federal Prosecutor; Legal Analyst for Tallahassee Democrat’s Newspaper Dr. Bethany Marshall - Psychoanalyst, Author - \u0022Deal Breaker,\u0022 featured in hit show: \u0022Paris in Love\u0022 on Peacock;, Instagram \u0026 TikTok: drbethanymarshall, X: @DrBethanyLive Irv Brandt – Senior Inspector, US Marshals Service International Investigations Branch; Chief Inspector, DOJ Office of International Affairs, US Embassy Kingston, Jamaica; Author: “SOLO SHOT: CURSE OF THE BLUE STONE” – AVAILABLE ON AMAZON IN JANUARY; ALSO “FLYING SOLO: Top of the World;” X: @JackSoloAuthor Lynn Shaw – Founder and Executive Director of Lynn’s Warriors Sydney Sumner - CrimeOnline Investigative Reporter Angelica Martinez-Servigna - CrimeOnline Investigative Reporter See omnystudio.com/listener for privacy information.",
      "release": "2024-09-19T18:59:04Z",
      "duration": "00:45:48.2380000",
      "explicit": false,
      "spotifyId": "0DmUuzTd8r5NiFWJX6qeJE",
      "appleId": 1000670086635,
      "youTubeId": "aZ-dXK6qau4",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0DmUuzTd8r5NiFWJX6qeJE",
        "apple": "https://podcasts.apple.com/podcast/diddy-no-bond-freak-offs-sex-abuse-lasting-days-left/id1193068130?i=1000670086635",
        "youtube": "https://www.youtube.com/watch?v=aZ-dXK6qau4"
      }
    },
    {
      "id": "cb0f9261-1438-4e47-b5bf-ddb176b73f91",
      "title": "\u0022THE PROPHET\u0022 CHAD DAYBELL TRIPLE MURDER SUSPECT \u0022FUELED BY SEX, MONEY, POWER\u0022",
      "description": "The second person charged in the deaths of Tylee Ryan, JJ Vallow, and Tammy Daybell is now in court. Chad Daybell, husband of Cult Mom Lori Vallow, is facing the same charges as his wife and more. Shortly after her husband Charles Vallow’s shooting death, Lori Vallow moves with her two children to Rexburg, Idaho. It’s not far from where Chad Daybell, Vallow’s lover and “husband from a past life” resides with his wife Tammy Daybell. Tylee Ryan and J.J. Vallow settle in, making a trip to Yellowstone National Park with their mom and uncle Alex Cox. A photo from that trip is the last proof of Tylee’s life, and weeks later, J.J. Vallow stops going to school. Meanwhile, Vallow and Daybell spend more time together. The couple is seen loading a storage unit with Vallow’s children’s belongings. A month passes, and suddenly Daybell’s wife Tammy is dead. Two weeks later, Lori Vallow is now Lori Vallow-Daybell after a wedding ceremony on a Kauai beach. Chad Daybell’s wife Tammy Daybell dies in her sleep at the age of 49. Friends were shocked by her death, saying that Tammy was incredibly fit. The mom of five was training for a marathon and regularly attended high-intensity exercise classes with friends. However, Chad Daybell painted a very different story of his wife’s health. He said Tammy Daybell was sickly, always coughing, and struggling with low blood pressure that led to fainting spells. Daybell said on the night of her death, Tammy Daybell had a coughing fit that led her to vomit. He helped her to bed and was startled awake when Tammy rolled onto the floor. Daybell says when he checked on her, he realized Tammy was dead. Fremont County Coroner, Brenda Dye, took Daybell’s account of his wife’s health into consideration when she ruled Tammy Daybell’s cause of death to be pulmonary edema due to a cardiac event without performing an autopsy. By June of 2020, detectives are narrowing down what happened to J.J. Vallow and Tylee Ryan since their disappearance nearly six months earlier. Lori Vallow-Daybell is behind bars on two felony charges of Desertion \u0026 Nonsupport of Dependent Children after failing to produce Tylee and J.J. in court on January 30. On April 9, police announce their suspicion that Vallow and Vallow-Daybell conspired to kill Tammy Daybell. Rexburg Police return to Chad Daybell’s home for another search. While Daybell is detained, investigators uncover human remains in a pet cemetery in Daybell’s backyard. The remains are later confirmed to be J.J. Vallow and Tylee Ryan. Joining Nancy Grace Today: Vicki Hoban - Tammy Daybell\u0027s Aunt Tom Evans - Juror on Lori Daybell Trial (chosen as an alternate); Book: “Money Power and Sex: The Lori Daybell Trial” Tara Malek – Bosie, ID, Attorney \u0026 Co-owner of Smith \u0026#43; Malek; Former State and Federal Prosecutor; X: @smith_malek Dr. Kendall Crowns – Chief Medical Examiner Tarrant County (Ft Worth) and Lecturer: University of Texas Austin and Texas Christian University Medical School Nate Eaton – News Director/Reporter for East Idaho News; Twitter: @NateNewsNow, Instagram: @n.eaton See omnystudio.com/listener for privacy information.",
      "release": "2024-05-01T22:00:00Z",
      "duration": "00:44:32.1690000",
      "explicit": false,
      "spotifyId": "44buN2pBJ5hJjBwhAqaJhb",
      "appleId": 1000654224562,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/44buN2pBJ5hJjBwhAqaJhb",
        "apple": "https://podcasts.apple.com/podcast/the-prophet-chad-daybell-triple-murder-suspect-fueled/id1193068130?i=1000654224562"
      }
    },
    {
      "id": "2e7103c1-7f98-493b-a1dc-dbe213628301",
      "title": "Is \u0022The Prophet\u0022 Chad Daybell Going to RAT OUT His Wife, Cult Mom Lori Vallow?",
      "description": "Subscribe to Never Miss Crime Stories with Nancy Grace! https://www.youtube.com/@nancygrace\n\nWatch Crime Stories with Nancy Grace: https://www.youtube.com/playlist?list=PLf659lY8aUPoTrtcRvUjQHP0omHH9rZZs\n\nWatch Nancy Grace Originals: https://www.youtube.com/playlist?list=PLf659lY8aUPpdzwx_bnq-w-G-BXsA5ypT\n\nWatch Nancy Grace on Alex Murdaugh: https://www.youtube.com/playlist?list=PLf659lY8aUPrV-D1VmcIdDn3x2qShiQvv\n\nEnter the world of Crime Online - the ultimate destination for crime awareness and prevention. Discover the latest breaking crime news, \u0022Most Wanted\u0022 lists, missing persons alerts, and sex offender registries to protect yourself and your loved ones.\n\nBut that\u0027s not all - Crime Online is your partner in crime-busting, empowering you with the knowledge to take action and stand up against consumer scams, jailbreaks, and more.\n\nWhat sets us apart? We\u0027re not just another crime news outlet. Our platform is curated by a team of crime reporters and legal experts from diverse backgrounds who bring their unique perspectives on cybercrime, addiction, forensic pathology, and crime scene investigation.\n\nJoin our community of crime-fighters and take back control. Because in the world of Crime Online, knowledge is power.\n\nVisit Our Website: https://www.crimeonline.com/\nLike Crime Stories on Facebook: https://www.facebook.com/crimeonlinenews\nTweet With Us: https://twitter.com/crimeonlinenews\nListen on Apple Podcasts: https://podcasts.apple.com/us/podcast/crime-stories-with-nancy-grace/id1193068130?mt=2\nListen on iHeart Podcasts: https://www.iheart.com/podcast/1119-crime-stories-with-nancy-27910486/\nListen on Spotify: https://open.spotify.com/show/3mirnBCAE7VOzeTM5w12SJ?si=fce8fe8b062e4cdc\n\n#NancyGrace #CrimeStories #CrimeStoriesWithNancyGrace #CrimeStoriesOnline  #TrueCrime #MostWanted #CrimeScene",
      "release": "2024-05-01T20:00:00Z",
      "duration": "00:04:55",
      "explicit": false,
      "youTubeId": "-cEu-q5alys",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-cEu-q5alys"
      }
    },
    {
      "id": "efa85b38-c32e-41f5-a44b-cc89d5cd9bfa",
      "title": "Influencer Andrew Tate BUSTED",
      "description": "Kickboxer and media influencer Andrew Tate charged with rape, human trafficking and more. Tate and his brother were taken into custody in Romania, where they live. Prosecutors say the Tates and two associates formed an organized criminal group to groom and sexually traffick women in the United States, the United Kingdom, as well as Romania. The indictment names seven women who say the Tate brothers recruited them with false promises, including love and marriage, but instead took them to buildings where they intimidated them, watched over them constantly, forcing them into debt and pornography. Joining Nancy Grace Today: Greg Ahlgren – International Attorney-at-Law at the US-MX Law Group, Ltd. \u0026 DRT Alliance/Diaz Reus International Law Firm Dr. Joni Johnston – Forensic Psychologist and Private Investigator (performs risk and threat assessments on violent offenders); Author: “Serial Killers: 101 Questions True Crime Fans Ask” Sheryl McCollum – Cold Case Investigative Research Institute Founder \u0026 Host of New Podcast: “Zone 7;” Twitter: @149Zone7 Lee Reiber – Mobile Device Forensic Expert, COO: Oxygen Forensics, Inc., Author: “Mobile Forensic Investigations: A Guide to Evidence Collection, Analysis, and Presentation” Dawn Schiller (Los Angeles, CA)- Training Director for the L.A. County Project at Coalition to Abolish Slavery \u0026 Trafficking (CAST), Lived Experience Expert Consultant, and Best-selling Author: “The Road Through Wonderland: Surviving John Holmes;\u0022 Also a National Speaker, Educator and Mentor; Twitter: @DawnSchiller, Instagram: DawnSchiller55, Facebook: Author Dawn Schiller Caitlyn Becker (Los Angeles, CA) - Senior Reporter for Dailymail.com; Twitter: @caitlynbecker See omnystudio.com/listener for privacy information.",
      "release": "2024-03-30T13:44:17Z",
      "duration": "00:37:56.3360000",
      "explicit": false,
      "spotifyId": "7iGjxRH6m9UKRHKf5wZJVh",
      "appleId": 1000650926094,
      "subjects": [
        "Hustler\u0027s University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7iGjxRH6m9UKRHKf5wZJVh",
        "apple": "https://podcasts.apple.com/podcast/influencer-andrew-tate-busted/id1193068130?i=1000650926094"
      }
    },
    {
      "id": "56646287-bf81-4456-bb5c-2bd126ac7722",
      "title": "Boy, 12, Dead After Just 24 Hours at Wilderness Boot Camp, Found Without Pants",
      "description": "The parents of a 12-year-old boy think Trails Carolina might be just the place to help their son. Trails Carolina claims to be a Leader in Wilderness Therapy offering an Adventure Wilderness Program for children who have behavioral and or emotional difficulties. The parents say their boy is transported by two men from New York to Trails Carolina Camp at Lake Toxaway, North Carolina. Their son arrives at the camp in an agitated state. The 12-year-old is loud and disruptive, but he is assigned to a cabin with other children as well as four adults. In less than 24 hours, the 12-year-old boy from New York is dead. Sheriff Chuck Owenby says an autopsy is being conducted because the death \u0022appeared suspicious\u0022 since the boy died at the camp less than 24 hours after he arrived. A counselor explained to investigators that the boy was required to sleep on the floor inside a sleeping bag. The sleeping bag is inside a small tent called a \u0022BIVY.\u0022 According to search warrant documents, around midnight the boy started to experience a panic attack. After the panic attack, a counselor told investigators that the boy was checked on throughout the night starting at 12 a.m., with additional checks on his well-being at 3 a.m. and 6 a.m. At 7:45 a.m., the boy was found dead. According to the search warrant, when investigators arrived at the scene, CJH was stiff and \u0022cold to the touch.\u0022 He was lying on his back, his arms were on his chest, and his \u0022knees bent upwards toward the sky.\u0022 Also in the search warrant, investigators noted spots of bleeding under the skin, \u0022possible petechiae\u0022 in the boy\u0027s lips and eyes. This is considered a sign of asphyxiation. The warrant also notes a CPR mask was covering the boy\u0027s face and he was not wearing any pants or underwear. His pants and underwear were lying next to his shoulder Early in the investigation, detectives with the Transylvania County Sheriff\u0027s Office attempted to interview other juveniles at Trails Carolina when the boy died. However, camp staff members refused to allow investigators to interview or even see any of the other juveniles. Trails Carolina says the search warrant contains \u0022misleading statements\u0022 saying they won\u0027t discuss some details \u0022out of respect for the family and the investigation.\u0022 In a statement, Trails Carolina says they did not prevent children from speaking to investigators claiming they asked parents for permission for any children involved to speak with law enforcement and state agencies, and \u0022complied with each parent\u0027s preference. as we are required to do.\u0022 Children were moved to the area to protect them from seeing what was happening, not to avoid investigators. In response to the recent suspicious death of a 12-year-old at Trails Carolina, North Carolina health officials ordered the removal of all children from the nature therapy program. Joining Nancy Grace Today: Gertie - Victim of sexual assault at Trails Carolina, Survivor of the troubled teen industry, TikTok: @this.is.me.surviving2 Jenkins Mann, Esq. - Attorney Representing Sexual Assault Victims of Trail Carolina Dr. Bethany Marshall – Psychoanalyst (Beverly Hills, CA); Instagram \u0026 TikTok: drbethanymarshall; X: @DrBethanyLive Eric J. Davis - Private Investigator, Licensed in NC and SC; Retired FBI Supervisory Special Agent, and Partner at Richardson \u0026 Davis Investigative Consulting Group, LLC Dr. Todd Barr - Board-Certified Anatomic/Clinical/Forensic Pathologist Meg Appelgate - Co-founder and CEO of Unsilenced; Victim of the troubled teen industry and advocate for survivors; TikTok and IG: @megappelgate, TikTok and IG: Unsilenced_now Nick Ochsner - Executive Producer \u0026 Chief Investigative Reporter, WBTV; Has been investigating Trails Carolina since May 2021 See omnystudio.com/listener for privacy information.",
      "release": "2024-03-08T18:00:00Z",
      "duration": "00:44:58.0310000",
      "explicit": false,
      "spotifyId": "76M2Yo4CsybjSVZ5htJ8ni",
      "appleId": 1000648515584,
      "youTubeId": "-7D-L86VRcs",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/76M2Yo4CsybjSVZ5htJ8ni",
        "apple": "https://podcasts.apple.com/podcast/boy-12-dead-after-just-24-hours-at-wilderness-boot/id1193068130?i=1000648515584",
        "youtube": "https://www.youtube.com/watch?v=-7D-L86VRcs"
      }
    },
    {
      "id": "23f41849-1aee-41e5-b1e6-208e2e9912f8",
      "title": "Ruby Franke Sobs In Court, Verdict In",
      "description": "YouTube influencer Ruby Franke learns her fate. Joining Nancy Grace Today: Donna Kelly – Former Utah Senior Deputy District Attorney and Attorney for Crime Victims Legal Clinic; Helped form the Utah County Sex Crimes Task Force Dr. Dana Anderson – Forensic Psychologist and Consultant, Court-appointed Expert Witness; X: @psychologydrcom/TikTok: @psychologydr Jason Jensen – Private Investigator (Jensen Private Investigations), Cold Case Expert (Salt Lake City, UT), and Co-founder: “Cold Case Coalition;” Investigations; X: @JasonJPI, Facebook/Instagram: “Jensen Investigations” Dr. Free N. Hess – Pediatrician/Pediatric Emergency Medicine, Child Safety Expert \u0026 Consultant, Founder of www.PediMom.com Emily Ashcraft- Reporter for KSL.com in Utah; X: @emilyjaneen3 See omnystudio.com/listener for privacy information.",
      "release": "2024-03-02T22:59:16Z",
      "duration": "00:42:23.4380000",
      "explicit": false,
      "spotifyId": "7dCFw05mPkNQy1k7izhZAL",
      "appleId": 1000647788453,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7dCFw05mPkNQy1k7izhZAL",
        "apple": "https://podcasts.apple.com/podcast/ruby-franke-sobs-in-court-verdict-in/id1193068130?i=1000647788453"
      }
    }
  ]
}