{
  "id": "d12cde2f-3011-4bf2-a8ab-3ef321b6f7d6",
  "name": "Crimes, Killers, Cults and Beer: A True Crime Podcast",
  "spotifyId": "1aCCu8eZ7BjGMVhitQoeaj",
  "appleId": 1616987023,
  "episodes": [
    {
      "id": "09bfc168-ac3e-43ce-b34b-025fd66fd1ea",
      "title": "74 The Troubled Teen Industry with Nora Ashleigh Part 2",
      "description": "In part 2, Nora tells us how she escaped the TTI, and her experiences being homeless afterward, and how her life ultimately came together. She then tells us how she became an activist against the industry, and what her future plans are.  Nora\u0027s website   Twitter(X) Instagram Facebook Discord Patreon YouTube Website",
      "release": "2023-09-09T00:00:00",
      "duration": "01:33:18",
      "explicit": true,
      "spotifyId": "1uY1ROcgrz49TBnSZaEl1s",
      "appleId": 1000627267845,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1uY1ROcgrz49TBnSZaEl1s",
        "apple": "https://podcasts.apple.com/podcast/74-the-troubled-teen-industry-with-nora-ashleigh-part-2/id1616987023?i=1000627267845"
      }
    },
    {
      "id": "5c471022-15ee-481f-b1e9-2eb008eccadc",
      "title": "73 The Troubled Teen Industry Exposed With Nora Ashleigh Part 1",
      "description": "Sorry about the confusion. We uploaded the unedited file accidentally! Its fixed now! We have a special one for you tonight. 16 year old Nora Ashleigh was taken from her bedroom at 3AM and taken into the wastelands of Utah, where she was abused and subjected to all types of cruelty, and even torture. She endured this for 2 years until she finally escaped, and never looked back. But this wasn\u0027t a kidnapping or human trafficking incident. This was done at the request of her own parents. The people who took her were part of a goon squad, that worked for the Troubled Teen Industry. Isolation camps used to reeducate teens with issues. Issues in most cases that were the result of bad or lazy parenting. And, this is all 100% legal, and in many cases backed by the government. Many politicians and celebrities have dumped their teenage children off on these legalized gulags.  This is a multi million dollar industry, that still exists right now, and it isn\u0027t going away any time soon. Now 36 years old, Nora has taken the fight to them, and has become an activist against these organizations, whose practices would be shut down if it was a cult, or a far right militia camp or religious fundamentalist group.  Hundreds of deaths are on the hands of these groups, yet the victims get swept away, and not one of them has been held accountable. Part one is Nora\u0027s personal experience at the hands of these sadists. Part two is her escape, and all she and other survivors are doing to raise awareness.  Click here for Nora\u0027s website She is launching a podcast, which we\u0027ll have the link for in part 2.  Facebook Twitter(X) Instagram Patreon Discord Website",
      "release": "2023-09-03T00:00:00",
      "duration": "01:50:53",
      "explicit": true,
      "spotifyId": "3rNJxZFsUSN94Z5tnMK6dQ",
      "appleId": 1000626517268,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rNJxZFsUSN94Z5tnMK6dQ",
        "apple": "https://podcasts.apple.com/podcast/73-the-troubled-teen-industry-exposed-with-nora/id1616987023?i=1000626517268"
      }
    },
    {
      "id": "4dabf80f-858c-441d-bf9e-caaed69a0a66",
      "title": "61 Heavens Gate: The Crazy Comet UFO Cult",
      "description": "Another guest on the show, and another cult! We\u0027re covering Heaven\u0027s Gate, the Crazy Comet Cult. We discuss Marshall Applewhite and Bonnie Nettle\u0027s background, and how they took this from a crazy idea to a legit cult that had close to 50 people when it ended. It ended of course, when the majority of the cult all committed suicide to advance to \u0022The Next Level\u0022 which was a planet where they would live for eternity in an existence devoid of personality, feelings, and sex. These people bought in 100% to the teachings, believing that Applewhite and Nettles were the second coming of Jesus Christ, who had the tickets to leave Earth and go away in a spaceship to a better eternity, and that the only way to get there was to off yourself. Castrations not withstanding.  We\u0027re joined by Dr Paul Meckes of the Conscious Radio Network, and their podcast, The Weekly Séance, on YouTube, Spotify, and all other platforms. He was awesome, and I\u0027m sure he will be back soon.  Follow us on Facebook Twitter   ",
      "release": "2023-06-10T00:00:00",
      "duration": "01:58:49.5000000",
      "explicit": true,
      "spotifyId": "56xpAIovAv4bIAANbYiB9F",
      "appleId": 1000616361333,
      "urls": {
        "spotify": "https://open.spotify.com/episode/56xpAIovAv4bIAANbYiB9F",
        "apple": "https://podcasts.apple.com/podcast/61-heavens-gate-the-crazy-comet-ufo-cult/id1616987023?i=1000616361333"
      }
    },
    {
      "id": "282f0c10-f185-44a9-82b5-b945ffb20d42",
      "title": "55 Cult! Warren Jeffs and the FLDS Part Two",
      "description": "Here we are again with the conclusion of our thrashing of this pedophile scumbag cult leader. In this episode, we discuss his cross country run from the FBI, and his hypocritical activities that he indulged in along the way. His reasoning? He was learning about the evil world so he could better protect his followers. We also cover his arrest and trials, as well as his hilarious desperate attempt to maintain control of the cult while behind bars.  Follow us on social media, and say hi!  Facebook Twitter Instagram Website",
      "release": "2023-04-29T00:00:00",
      "duration": "01:33:00",
      "explicit": true,
      "spotifyId": "645h0Wge20SEFAE2DuzgZb",
      "appleId": 1000611135060,
      "urls": {
        "spotify": "https://open.spotify.com/episode/645h0Wge20SEFAE2DuzgZb",
        "apple": "https://podcasts.apple.com/podcast/55-cult-warren-jeffs-and-the-flds-part-two/id1616987023?i=1000611135060"
      }
    },
    {
      "id": "070792b4-d01e-4100-adf2-4eca87fb4a6b",
      "title": "54 Cult! Warren Jeffs and FLDS Part One",
      "description": "Today, we start a 2 part episode on Warren Jeffs and the Fundamental Church of Latter Day Saints cult. An off shoot from the Mormon church that occurred when the Mormons banned multiple wives. Warren\u0027s father, Rulon Jeffs became the prophet, and Warren was the heir apparent. Rulon made him the principal of a FLDS school, where Warren began crafting his warped view of Mormonism, and indoctrinating the students. When Rulon died, Warren assumed the role of prophet, and not only amped up the multiple wives, he also brought in child brides, and began trafficking young girls to creepy bootlicker men in the cult. He also instituted a set of the most draconian laws imaginable. Women were nothing more than breeding stock.   Join us as we destroy this creep. Its a very rough story, but we get through it by brutally mocking Warren. Part 2 comes next Saturday.  Twitter Facebook Instagram Website ",
      "release": "2023-04-22T00:00:00",
      "duration": "01:45:36.5000000",
      "explicit": true,
      "spotifyId": "342BOgwbeRzGdLtK1qTiXQ",
      "appleId": 1000610173918,
      "urls": {
        "spotify": "https://open.spotify.com/episode/342BOgwbeRzGdLtK1qTiXQ",
        "apple": "https://podcasts.apple.com/podcast/54-cult-warren-jeffs-and-flds-part-one/id1616987023?i=1000610173918"
      }
    },
    {
      "id": "7f5613fb-fccb-4805-a13c-11d55146d02b",
      "title": "46 Teenage Sex Cult and Music: Sergio Andrade and Gloria Trevi",
      "description": "We have a doozy for you today. A teenage sex cult, run by pedophile Mexican music producer, Sergio Andrade, and his biggest star, Gloria Trevi. Sergio was VERY good at developing female pop acts in Mexico. He had several platinum artists under his belt, and he was very well respected. Everything he touched turned to gold platinum. He was a gifted musician, and producer, and he had a knack for finding every client’s individual strong spot, and he would bring this out in them. His record speaks for itself. But, if that’s all he did, he wouldn’t be featured on CKCB. He had a taste for underage girls, and married one of his acts. He was also an abusive tyrant prick. But once he discovered Gloria Trevi, and she became Mexico’s top selling pop act of all time, he used his resume to entice many more young girls into his clutches, under the promise that he would “make them a star!” Before too long, he had a harem of girls that he was physically and sexually abusing, and he became the target of an international manhunt. One of his ‘clients’ who got the hell away from him was instrumental in bringing him down. Her courage is very admirable. Join us as we tell this riveting and unbelievable story.",
      "release": "2023-03-07T00:00:00",
      "duration": "02:09:50",
      "explicit": true,
      "spotifyId": "3lJa46Sfat8AwmYKuiHD86",
      "appleId": 1000603140827,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3lJa46Sfat8AwmYKuiHD86",
        "apple": "https://podcasts.apple.com/podcast/46-teenage-sex-cult-and-music-sergio-andrade-and/id1616987023?i=1000603140827"
      }
    },
    {
      "id": "722db10a-6f78-485a-99f5-da0f232e3739",
      "title": "41 Mother Anna\u0027s House of Prayer (Cult of abuse and depravity) ",
      "description": "Wow, people! This episode was by far the worst cult we\u0027ve covered. And, it happened in our home state of Florida. This is a relatively unknown case as well.  The cult has most of the boxes checked to identify a religious cult. But, it has a twist. The cult leader is a woman. She unleashed hell on her followers, who believed that she was literally God. Its a brutal story, and this bitch got what she deserved in the end. So, buckle up! Its a bad one. NOTE: We were supposed to have Wayne from the Florida Men on Florida Man podcast with us. There were technical difficulties and it wasn\u0027t able to happen. But, it will happen soon with a different topic.  Click here for our website. It has links to our social media, links to all streaming platforms, Bill\u0027s original music, and merch soon. Twitter Facebook",
      "release": "2023-01-30T00:00:00",
      "duration": "01:26:08",
      "explicit": true,
      "spotifyId": "2J6WLkP9tmowPgaxNsu16q",
      "appleId": 1000597173277,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2J6WLkP9tmowPgaxNsu16q",
        "apple": "https://podcasts.apple.com/podcast/41-mother-annas-house-of-prayer-cult-of-abuse-and-depravity/id1616987023?i=1000597173277"
      }
    },
    {
      "id": "e0a0ac3e-c707-4f71-aa06-5f7972263308",
      "title": "38 The Kurim Case: Crimes, Cannibals, Cults and Bull$hit",
      "description": "This is a bizarre case. It takes place mainly in the Czech Republic, in 2007, but it bounces around in a weird game of cat and mouse. It was the biggest story in that part of the world for a very long time, as new wrinkles came to light. It has child abuse, obscure cults, cannibalism, and a girl who was sex trafficked, rescued, then vanished. But, things aren\u0027t always what they seem. Or, are they? This story begins when a video baby monitor being used by new parents picked up a stray signal from a similar device nearby. It showed a small naked boy, lying bound on the bare floor of a dark room with no windows. The new father called police, and the events that happened next over a few months are the most peculiar things you\u0027ve ever heard, with one of the craziest endings of any true crime story.  Join us as we take you on this roller coaster ride of a case. Click here for our website. It has links to all our episodes on multiple platforms. It also has links to our social media, Bill\u0027s original music, and we will have merch soon. Our social media: Twitter Facebook",
      "release": "2023-01-08T00:00:00",
      "duration": "01:23:56.5440000",
      "explicit": true,
      "spotifyId": "0pIBLj6d9mn50sbZtSJt3T",
      "appleId": 1000593014888,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pIBLj6d9mn50sbZtSJt3T",
        "apple": "https://podcasts.apple.com/podcast/38-the-kurim-case-crimes-cannibals-cults-and-bull%24hit/id1616987023?i=1000593014888"
      }
    },
    {
      "id": "bd2284a4-5c57-41ff-9058-d3eb11c23130",
      "title": "22 Dwight York and Nuwaubian Nation Cult",
      "description": "Lets get Culty! In this episode, we cover a cult leader with more origin stories than Sybil had personalities. Dwight York was a racist jerk who believed that his religion was the only one getting to Heaven, and that black people were the only pure people. He also had people believing that he was Egyptian royalty, a Native American chief...and an alien. Oh...And, he also liked kids a little too much. But this one has a very satisfying ending. Click Here for our website. Links to all episodes, Todd\u0027s band and Bill\u0027s music.  ",
      "release": "2022-09-12T00:00:00",
      "duration": "01:21:14.2500000",
      "explicit": true,
      "spotifyId": "3Yk2XJdutyIP7Zl9iUhLbH",
      "appleId": 1000579191663,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Yk2XJdutyIP7Zl9iUhLbH",
        "apple": "https://podcasts.apple.com/podcast/22-dwight-york-and-nuwaubian-nation-cult/id1616987023?i=1000579191663"
      }
    },
    {
      "id": "10e9bf18-2e82-4e91-ad61-a3cfce02b4a6",
      "title": "16 RG Stair and Overcomer\u0027s Ministry Doomsday Cult",
      "description": "Holy moly! Another little known cult that should be well known.  RG Stair started a world wide media empire on AM radio, then on the internet, and made millions. He also had a commune where his followers liquidated every thing they owned to move to the South Carolina commune...and gave all the money to RG to live in squalor and slave 7 days a week for no pay...all to be safe from Armageddon. RG had a prophet complex, he was a narcissist, and an over all piece of garbage. And he also liked the young girls. This story has a twist too, when a well known hip hop artist joined the ranks.  How this cult slipped under the radar is beyond me. Grab a beer. Its gonna get culty.Say What You Mean podcast, referenced several times on this episodeOur website. Find all episodes, and platform links for most platforms there, as well as Bill\u0027s music and Todd\u0027s band",
      "release": "2022-07-23T00:00:00",
      "duration": "02:07:47.5390000",
      "explicit": false,
      "spotifyId": "48ym8ktEQbDfPNZgaUqOKC",
      "appleId": 1000570965237,
      "urls": {
        "spotify": "https://open.spotify.com/episode/48ym8ktEQbDfPNZgaUqOKC",
        "apple": "https://podcasts.apple.com/podcast/16-rg-stair-and-overcomers-ministry-doomsday-cult/id1616987023?i=1000570965237"
      }
    },
    {
      "id": "78d65e24-0dac-4bdd-ac43-b9a4265f9074",
      "title": "11 Hobart Freeman and Faith Assembly Cult Part 2: Bill\u0027s Story",
      "description": "Here it is, the conclusion of the 2 part series on the Faith Assembly Cult. This is Bill\u0027s experience as a member. From the moment his family joined, to the point where the church fell apart, and everything in between. He also tells how being in the cult affected him in adolescence and adulthood.  Don\u0027t miss this one...Although if you haven\u0027t listened to part 1, you should go back and listen to it first.If you are in this or any cult, and you want answers and help, contact Joshua Wilson. He is a Faith Assembly survivor as well, and he has helped lots of people get back into their lives.Social:https://mobile.twitter.com/CKC_Beerhttps://www.facebook.com/CKCBPChttps://www.youtube.com/channel/UCNlMRL0bKGMjmQbpxv4GwPQTodd\u0027s Band, and Bill\u0027s music:https://www.facebook.com/RADlikethe80shttps://open.spotify.com/artist/34eWK88psoEpApXis1taB1?si=13l_qSYLQcOfo6AwXbuiOA",
      "release": "2022-06-04T00:00:00",
      "duration": "01:28:16",
      "explicit": false,
      "spotifyId": "1yfXKnw3CicOYRrifiLhOn",
      "appleId": 1000565222214,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1yfXKnw3CicOYRrifiLhOn",
        "apple": "https://podcasts.apple.com/podcast/11-hobart-freeman-and-faith-assembly-cult-part-2-bills-story/id1616987023?i=1000565222214"
      }
    },
    {
      "id": "bf4ef4fe-5b62-48c3-a3d7-2b9fd12dcf2c",
      "title": "10 Hobart Freeman and Faith Assembly Cult Part 1",
      "description": "We\u0027re into double digits! And, we\u0027re covering our first cult!Faith Assembly, led by Hobart Freeman was active in the 70\u0027s and 80\u0027s. They believed among other things that God would heal anything wrong with you, and going to doctors was a sin.  The church had a very high body count of people dying of preventable ailments. And, if you died, it was because your faith wasn\u0027t strong enough, and you had unconfessed sin. They also believed that only the people in their church were going to heaven. Pair that up with isolating the congregation from their friends and families, and you\u0027re in for a world of shit. It had satellite branches all through the US and in several other countries. But, the kicker? It is still active. Buckle up. You\u0027re in for a hell of a ride!Part one is the story of Hobart Freeman and Faith Assembly. Part 2 is Bill\u0027s experience growing up in this cult.Shout outs this episode: Timesuck, Seven Deadly Sinners, Monsters of the Midwest, Human MonstersAvanah Sophia\u0027s MusicOur social media:TwitterFacebookYouTubeInstagramBill\u0027s musicTodd\u0027s band",
      "release": "2022-05-29T00:00:00",
      "duration": "02:15:10.6020000",
      "explicit": false,
      "spotifyId": "1sZFr6AGB8EV8qzQJXzUx1",
      "appleId": 1000564418580,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1sZFr6AGB8EV8qzQJXzUx1",
        "apple": "https://podcasts.apple.com/podcast/10-hobart-freeman-and-faith-assembly-cult-part-1/id1616987023?i=1000564418580"
      }
    }
  ]
}