{
  "_ts": 0,
  "id": "ba5b0427-6d33-484a-94f2-ee67ae4a7189",
  "name": "Crime Stories with Nancy Grace",
  "spotifyId": "3mirnBCAE7VOzeTM5w12SJ",
  "appleId": 1193068130,
  "youTubeChannelId": "UCFgSizoPkSkkldoDslZUaYQ",
  "episodes": [
    {
      "id": "dd6b6440-22ef-4f56-bf49-3266cd878932",
      "title": "P. Diddy: Hidden Cameras Prove Disturbing Allegations?",
      "description": "More documents filed by P. Diddy\u0027s former producer shed light on the alleged proof behind the accusations against him. The famed music mogul faces numerous civil lawsuits that allege disturbing claims and a federal investigation. Nancy Grace and expert guests break down everything in the new filing. \n\nSubscribe to Nancy Grace on YouTube: @nancygrace \n\nSubscribe to Law\u0026Crime Network: https://bit.ly/LawAndCrimeNetwork\n\n#Diddy #PDiddy #LawAndCrime \n\nSTAY UP-TO-DATE WITH THE LAW\u0026CRIME NETWORK:\nWatch Law\u0026Crime Network on YouTubeTV: https://bit.ly/3td2e3y\nWhere To Watch Law\u0026Crime Network: https://bit.ly/3akxLK5\nSign Up For Law\u0026Crime\u0027s Daily Newsletter: https://bit.ly/LawandCrimeNewsletter\nRead Fascinating Articles From Law\u0026Crime Network: https://bit.ly/3td2Iqo\n\nFor Advertising Inquiries, Please Contact: sales@lawandcrime.com\nFor Licensing Inquiries, Please Contact: licensing@lawandcrime.com\n\nLAW\u0026CRIME NETWORK SOCIAL MEDIA:\nInstagram: https://www.instagram.com/lawandcrime/\nTwitter: https://twitter.com/LawCrimeNetwork\nFacebook: https://www.facebook.com/lawandcrime\nTwitch: https://www.twitch.tv/lawandcrimenetwork\nTikTok: https://www.tiktok.com/@lawandcrime\n\nLAW\u0026CRIME NETWORK PODCASTS: https://lawandcrime.com/podcasts/\n\nSUBSCRIBE TO ALL OF LAW\u0026CRIME NETWORK YOUTUBE CHANNELS:\nMain Channel: https://www.youtube.com/channel/UCz8K1occVvDTYDfFo7N5EZw\nLaw\u0026Crime Shorts: https://www.youtube.com/channel/UCVXOqoOCYbi-iXChKAl6DTQ\nChannel B: https://www.youtube.com/channel/UCXCLaaClAWQiTkl3pw9ZdLw\nChannel C: https://www.youtube.com/channel/UCMV3pzWIhJGLYzoHyxBjjNw",
      "release": "2024-04-11T18:00:25Z",
      "duration": "00:41:56",
      "explicit": false,
      "youTubeId": "rs0O87hvIUk",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rs0O87hvIUk"
      }
    },
    {
      "id": "efa85b38-c32e-41f5-a44b-cc89d5cd9bfa",
      "title": "Influencer Andrew Tate BUSTED",
      "description": "Kickboxer and media influencer Andrew Tate charged with rape, human trafficking and more. Tate and his brother were taken into custody in Romania, where they live. Prosecutors say the Tates and two associates formed an organized criminal group to groom and sexually traffick women in the United States, the United Kingdom, as well as Romania. The indictment names seven women who say the Tate brothers recruited them with false promises, including love and marriage, but instead took them to buildings where they intimidated them, watched over them constantly, forcing them into debt and pornography. Joining Nancy Grace Today: Greg Ahlgren – International Attorney-at-Law at the US-MX Law Group, Ltd. \u0026 DRT Alliance/Diaz Reus International Law Firm Dr. Joni Johnston – Forensic Psychologist and Private Investigator (performs risk and threat assessments on violent offenders); Author: “Serial Killers: 101 Questions True Crime Fans Ask” Sheryl McCollum – Cold Case Investigative Research Institute Founder \u0026 Host of New Podcast: “Zone 7;” Twitter: @149Zone7 Lee Reiber – Mobile Device Forensic Expert, COO: Oxygen Forensics, Inc., Author: “Mobile Forensic Investigations: A Guide to Evidence Collection, Analysis, and Presentation” Dawn Schiller (Los Angeles, CA)- Training Director for the L.A. County Project at Coalition to Abolish Slavery \u0026 Trafficking (CAST), Lived Experience Expert Consultant, and Best-selling Author: “The Road Through Wonderland: Surviving John Holmes;\u0022 Also a National Speaker, Educator and Mentor; Twitter: @DawnSchiller, Instagram: DawnSchiller55, Facebook: Author Dawn Schiller Caitlyn Becker (Los Angeles, CA) - Senior Reporter for Dailymail.com; Twitter: @caitlynbecker See omnystudio.com/listener for privacy information.",
      "release": "2024-03-30T13:44:17Z",
      "duration": "00:37:56.3360000",
      "explicit": false,
      "spotifyId": "7iGjxRH6m9UKRHKf5wZJVh",
      "appleId": 1000650926094,
      "subjects": [
        "Hustler\u0027s University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7iGjxRH6m9UKRHKf5wZJVh",
        "apple": "https://podcasts.apple.com/podcast/influencer-andrew-tate-busted/id1193068130?i=1000650926094"
      }
    },
    {
      "id": "56646287-bf81-4456-bb5c-2bd126ac7722",
      "title": "Boy, 12, Dead After Just 24 Hours at Wilderness Boot Camp, Found Without Pants",
      "description": "The parents of a 12-year-old boy think Trails Carolina might be just the place to help their son. Trails Carolina claims to be a Leader in Wilderness Therapy offering an Adventure Wilderness Program for children who have behavioral and or emotional difficulties. The parents say their boy is transported by two men from New York to Trails Carolina Camp at Lake Toxaway, North Carolina. Their son arrives at the camp in an agitated state. The 12-year-old is loud and disruptive, but he is assigned to a cabin with other children as well as four adults. In less than 24 hours, the 12-year-old boy from New York is dead. Sheriff Chuck Owenby says an autopsy is being conducted because the death \u0022appeared suspicious\u0022 since the boy died at the camp less than 24 hours after he arrived. A counselor explained to investigators that the boy was required to sleep on the floor inside a sleeping bag. The sleeping bag is inside a small tent called a \u0022BIVY.\u0022 According to search warrant documents, around midnight the boy started to experience a panic attack. After the panic attack, a counselor told investigators that the boy was checked on throughout the night starting at 12 a.m., with additional checks on his well-being at 3 a.m. and 6 a.m. At 7:45 a.m., the boy was found dead. According to the search warrant, when investigators arrived at the scene, CJH was stiff and \u0022cold to the touch.\u0022 He was lying on his back, his arms were on his chest, and his \u0022knees bent upwards toward the sky.\u0022 Also in the search warrant, investigators noted spots of bleeding under the skin, \u0022possible petechiae\u0022 in the boy\u0027s lips and eyes. This is considered a sign of asphyxiation. The warrant also notes a CPR mask was covering the boy\u0027s face and he was not wearing any pants or underwear. His pants and underwear were lying next to his shoulder Early in the investigation, detectives with the Transylvania County Sheriff\u0027s Office attempted to interview other juveniles at Trails Carolina when the boy died. However, camp staff members refused to allow investigators to interview or even see any of the other juveniles. Trails Carolina says the search warrant contains \u0022misleading statements\u0022 saying they won\u0027t discuss some details \u0022out of respect for the family and the investigation.\u0022 In a statement, Trails Carolina says they did not prevent children from speaking to investigators claiming they asked parents for permission for any children involved to speak with law enforcement and state agencies, and \u0022complied with each parent\u0027s preference. as we are required to do.\u0022 Children were moved to the area to protect them from seeing what was happening, not to avoid investigators. In response to the recent suspicious death of a 12-year-old at Trails Carolina, North Carolina health officials ordered the removal of all children from the nature therapy program. Joining Nancy Grace Today: Gertie - Victim of sexual assault at Trails Carolina, Survivor of the troubled teen industry, TikTok: @this.is.me.surviving2 Jenkins Mann, Esq. - Attorney Representing Sexual Assault Victims of Trail Carolina Dr. Bethany Marshall – Psychoanalyst (Beverly Hills, CA); Instagram \u0026 TikTok: drbethanymarshall; X: @DrBethanyLive Eric J. Davis - Private Investigator, Licensed in NC and SC; Retired FBI Supervisory Special Agent, and Partner at Richardson \u0026 Davis Investigative Consulting Group, LLC Dr. Todd Barr - Board-Certified Anatomic/Clinical/Forensic Pathologist Meg Appelgate - Co-founder and CEO of Unsilenced; Victim of the troubled teen industry and advocate for survivors; TikTok and IG: @megappelgate, TikTok and IG: Unsilenced_now Nick Ochsner - Executive Producer \u0026 Chief Investigative Reporter, WBTV; Has been investigating Trails Carolina since May 2021 See omnystudio.com/listener for privacy information.",
      "release": "2024-03-08T18:00:00Z",
      "duration": "00:44:58.0310000",
      "explicit": false,
      "spotifyId": "76M2Yo4CsybjSVZ5htJ8ni",
      "appleId": 1000648515584,
      "youTubeId": "-7D-L86VRcs",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/76M2Yo4CsybjSVZ5htJ8ni",
        "apple": "https://podcasts.apple.com/podcast/boy-12-dead-after-just-24-hours-at-wilderness-boot/id1193068130?i=1000648515584",
        "youtube": "https://www.youtube.com/watch?v=-7D-L86VRcs"
      }
    },
    {
      "id": "23f41849-1aee-41e5-b1e6-208e2e9912f8",
      "title": "Ruby Franke Sobs In Court, Verdict In",
      "description": "YouTube influencer Ruby Franke learns her fate. Joining Nancy Grace Today: Donna Kelly – Former Utah Senior Deputy District Attorney and Attorney for Crime Victims Legal Clinic; Helped form the Utah County Sex Crimes Task Force Dr. Dana Anderson – Forensic Psychologist and Consultant, Court-appointed Expert Witness; X: @psychologydrcom/TikTok: @psychologydr Jason Jensen – Private Investigator (Jensen Private Investigations), Cold Case Expert (Salt Lake City, UT), and Co-founder: “Cold Case Coalition;” Investigations; X: @JasonJPI, Facebook/Instagram: “Jensen Investigations” Dr. Free N. Hess – Pediatrician/Pediatric Emergency Medicine, Child Safety Expert \u0026 Consultant, Founder of www.PediMom.com Emily Ashcraft- Reporter for KSL.com in Utah; X: @emilyjaneen3 See omnystudio.com/listener for privacy information.",
      "release": "2024-03-02T22:59:16Z",
      "duration": "00:42:23.4380000",
      "explicit": false,
      "spotifyId": "7dCFw05mPkNQy1k7izhZAL",
      "appleId": 1000647788453,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7dCFw05mPkNQy1k7izhZAL",
        "apple": "https://podcasts.apple.com/podcast/ruby-franke-sobs-in-court-verdict-in/id1193068130?i=1000647788453"
      }
    }
  ]
}