{
  "_ts": 0,
  "id": "eb58a460-ce1b-4d70-b9f3-258979b6fa0a",
  "name": "Crime Rush",
  "youTubeChannelId": "UC0HWYXIfB42grbqx66QpweQ",
  "episodes": [
    {
      "id": "a6eae9ed-b4f3-43d9-95fa-63ef563a55c0",
      "title": "The LDS Doomsday Cult | Lori and Chad Daybell",
      "description": "The LDS Doomsday Cult | Lori and Chad Daybell\n\nAn excellent channel that did a lot of coverage on this case:\nHidden True Crime Channel:\nwww.youtube.com/@UCBp03toXz-WZ6gSt7YtSdEg \n\nToday\u0027s video covers a case that is probably the most complicated case ever.\nThe main monsters of the story are Lori Vallow Daybell and Chad Daybell.\nThe cultish group they formed included:\nAlex Cox (Lori\u0027s brother)\nZulema Pastenes (who Alex eventually married)\nMelanie Gibb (Lori\u0027s bestie)\nMelani Boudreaux (Lori\u0027s niece)\nAnd of course Lori \u0026 Chad.\n\nThere were other members, but luckily they found their way out of this cult before things got really bad.\n\nThe victims:\nCharles Vallow (Lori\u0027s fourth husband)\nTammy Daybell (Chad Daybell\u0027s wife)\nTylee Ryan (Lori\u0027s daughter)\nJJ Vallow (Lori\u0027s adopted son)\n\nAdditional suspicious deaths:\nJoseph Ryan (Lori\u0027s ex-husband)\nAlex Cox (Lori\u0027s brother)\n \nLori Vallow changed husbands frequently and tried to justify and validate everything she did through her strange beliefs and faith.\n\nLori, a devout LDS member (AKA Mormon), got involved with the strange teachings of another LDS member and author named Chad Daybell. Once they united, bizarre things started happening, and together, the couple formed a group that led them down a path of delusions, darkness, and death.\n\nLori was prepared to eliminate anything that stood in the way of her being with Chad Daybell \u0026 their \u0022mission\u0022. Sadly she eventually came to a point where she felt that her own children were in the way.\n\nThis is an unbelievably tragic story that has shocked the entire world.\n\nMy condolences to the loved one of the many victims in today\u0027s case.\n\n#DoomsdayMom #Chad Daybell #LoriVallowDaybell",
      "release": "2025-01-18T17:22:43Z",
      "duration": "02:40:07",
      "explicit": false,
      "youTubeId": "k5DM2g02DaQ",
      "subjects": [
        "Chad Daybell",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k5DM2g02DaQ"
      }
    },
    {
      "id": "2d78b0a5-1290-424e-a7d7-68c670838738",
      "title": "Kidwelly cul-de-sac Cult that ruined too many lives | Colin Batley | Wales Cult",
      "description": "Kidwelly cul-de-sac Cult that ruined too many lives | Colin Batley | Wales Cult\n\nThe Kidwelly Satanic Cult was hidden in plain sight in Wales. Colin Batley declared himself the Prince Priest and leader of the group. He claimed to have direct contact with the gods and encouraged disgusting and demeaning rituals. \n\nColin even involved his wife, Elaine and she also became part of this horrific cult.\n\nColin\u0027s followers were indoctrinated and brainwashed to believe that he was omniscient and this made it easy for him to control them. He allowed them little freedom and they even had to give him most of their income. He told them they were part of \u0022The Church, \u0022 which was their main priority.\n\nColin did horrific things for financial gain, power, and his sick s*xual fantasies. \n\n#KidwellyCult #SatanicSexCult #ColinBatley",
      "release": "2024-12-11T22:16:39Z",
      "duration": "00:55:19",
      "explicit": false,
      "youTubeId": "31U78qF3KlU",
      "subjects": [
        "Colin Batley"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=31U78qF3KlU"
      }
    },
    {
      "id": "d0b87921-b398-428a-983c-785f73870a5c",
      "title": "Cult Leader Who Got Away with EVERYTHING | The Family | Anne Hamilton-Byrne",
      "description": "Cult Leader Who Got Away with EVERYTHING | The Family | Anne Hamilton-Byrne\n\nAnne Hamilton-Byrne successfully managed to deceive hundreds of people into believing that she was the female reincarnation of Jesus Christ.\n\nShe formed a cult called The Great White Brotherhood but later changed its name to \u0022The Family.\u0022\n\nWhile growing more and more powerful, Anne\u0027s crimes became more and more heinous. Perhaps the most disturbing part of this true crime story is that she got away with it all.\n\nAustralian cult leader, Anne Hamilton-Byrne will forever be remembered as an evil person who took advantage of everyone she came in contact with. She ruined many lives, profited from it, and never paid the consequences.\n\n#AnneHamiltonByrne #TheFamily #Cult",
      "release": "2024-11-29T11:50:48Z",
      "duration": "00:54:33",
      "explicit": false,
      "youTubeId": "WJScW_UzEvA",
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WJScW_UzEvA"
      }
    },
    {
      "id": "64ea6479-2172-40a9-8a2c-de93cf75dce7",
      "title": "Killing for SUPERNATURAL Powers | The Nebraska Vampire Cult | The Case of Sydney Loofe",
      "description": "SEASON 1: Cultish Crimes\nEPISODE 1: The Nebraska Vampire Cult\n\nAubrey Trail was a convicted murderer who was sentenced to death for the killing of Sydney Loofe in 2017. During his trial, witnesses described him as a \u0022vampire\u0022 who led a \u0022coven of witches.\u0022\n\nMurder Conviction: \nHe was found guilty of first-degree murder and conspiracy to commit murder in the death of Sydney Loofe.\n\u0022Vampire\u0022 Claims: \nWitnesses testified that Trail claimed to be a vampire and leader of a coven. He also allegedly believed he had the power to fly and could increase his powers by killing people.\nControversial Figure: \nTrail\u0027s case attracted significant media attention due to his bizarre claims and the gruesome details of the murder.\nDeath Sentence: \nHe was sentenced to death in 2021.\nWaiver of Appeals: \nTrail later waived his appeals, effectively requesting the state to carry out his death sentence.\n\nAubrey Trail\u0027s accomplice in the murder of Sydney Loofe was Bailey Boswell. Boswell was also convicted of first-degree murder and sentenced to life in prison.\n\nAccomplice in Murder: \nShe was involved in luring Sydney Loofe to her apartment, where she was subsequently murdered and dismembered.\n\u0022Witch\u0022 Claims: \nLike Trail, Boswell also identified with a \u0022witch\u0022 persona and was part of his alleged \u0022coven.\u0022\nManipulation and Control: \nEvidence suggests that Boswell was manipulated and controlled by Trail, who exerted significant influence over her.\nLife Sentence: She was sentenced to life in prison without the possibility of parole.\n\nKilling for SUPERNATURAL Powers | The Nebraska Vampire Cult | The Case of Sydney Loofe\n\nIntro: 00:00-00:43\nAubrey Trail: 00:43-02:06\nBailey Boswell: 02:06-03:36\nThe Vampire Cult: 03:36-05:47\nSydney Loofe: 05:47-06:48\nGetting Acquainted: 06:48-07:26\nFun Date Night: 07:26-08:21\nDate from hell: 08:21-09:31\nWhere is Sydney: 09:31-11:42\nSocial Media Videos: 11:42-16:48\nThe Arrest: 16:48-19:26\nTrial: 19:26-23:52\nSentencing: 23:52-25:41\nConclusion: 25:41-26:52\nOutro: 26:52-27:12\n\n#TheNebraskaVampireCult #SydneyLoofe #AubreyTrail",
      "release": "2024-11-14T16:00:36Z",
      "duration": "00:27:13",
      "explicit": false,
      "youTubeId": "r3KNT6cboNQ",
      "subjects": [
        "Aubrey Trail"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r3KNT6cboNQ"
      }
    }
  ]
}