{
  "id": "86ee0cdc-7ec7-4035-b504-9f2896d31375",
  "name": "Crime Connect",
  "youTubeChannelId": "UCq26hbOoLCROCsSw-MWTqYA",
  "episodes": [
    {
      "id": "1223708e-998e-44d8-96d0-77ef4f56391d",
      "title": "The Story of IPHC Church Dark Secrets Rituals, Cult Control \u0026 Deadly Factions Exposed 1",
      "description": "Unmask the hidden world of the International Pentecostal Holiness Church (IPHC) in this gripping Crime Connect documentary. From its origins as a secretive esoteric society blending Pentecostal fervor with African mysticism—known as Kereke ya Sephiri—to explosive allegations of cult-like behavior, spiritual abuse, and violent schisms that have spilled blood. We dive into the church’s shrouded rituals: initiation secrets revealed only to the inner circle, claims of divine encounters granting leaders “mystical powers,” and practices echoing sangoma traditions that blur the line between faith and manipulation. Explore the 2023 Zuurbekom massacre where factional wars left seven dead, and uncover how IPHC’s “celebrity prophets” exploit followers through prosperity gospels turned coercive control. Is this a beacon of faith or a religious mafia preying on the vulnerable? Packed with whistleblower testimonies, archival footage, expert analysis on Pentecostalism’s cultic underbelly in South Africa, and ties to broader scandals like the Satanic panic and mafiarized ministries. If true crime meets spiritual horror fascinates you, hit play now—subscribe to Crime Connect for more SA deep dives into corruption and cults. What’s your take: Devotion or deception? Comment below!\n\n#IPHCExposed #ChurchCult #SouthAfricaRituals #ZuurbekomMassacre #PentecostalSecrets #KerekeYaSephiri #ReligiousAbuse #TrueCrimeSA #CrimeConnect #SpiritualMafia #AfricanCults #ModiseLegacy\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCq26hbOoLCROCsSw-MWTqYA/join",
      "release": "2025-10-12T17:00:21Z",
      "duration": "00:19:00",
      "explicit": false,
      "youTubeId": "azHvOoLUOZ0",
      "subjects": [
        "Kereke Ya Sephiri"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=azHvOoLUOZ0"
      }
    }
  ]
}