{
  "_ts": 0,
  "id": "a4458d07-2b8d-4a94-8ada-ab639636097d",
  "name": "CrimePulseStories",
  "youTubeChannelId": "UCScf-O9PuQ8EAySToz4zUyg",
  "episodes": [
    {
      "id": "defa035a-2169-498a-90d5-1a8f3d12360f",
      "title": "Jonestown Massacre The Shocking True Story of History Deadliest Cult",
      "description": "Dive deep into the chilling story of the Jonestown Massacre, where over 900 lives were tragically lost under the control of charismatic cult leader Jim Jones. This documentary unravels the dark descent of the Peoples Temple, from its idealistic beginnings to its horrifying end in the jungles of Guyana. Explore the psychological manipulation, the escalating paranoia, and the ultimate tragedy that shocked the world. Through survivor accounts and expert analysis, discover how one man’s vision turned deadly, leaving a legacy of sorrow and lessons that continue to resonate today.\n\n#TrueCrime #JonestownMassacre #JimJones #CultStories #DarkHistory #Documentary #PsychologicalManipulation #HistoryUncovered #TragicEvents #SurvivorStories\n\nIf you were moved by this story, don’t forget to hit the like button and share your thoughts in the comments below. Subscribe and ring the bell for more deep dives into history’s most shocking true crime stories.\n\n🔔 Subscribe \u0026 Ring the Bell 🔔\nIf you\u0027re new here, don\u0027t forget to subscribe and ring the bell so you never miss an upload. We have a lot more unsolved mysteries and true crime stories coming your way!\n\n📧 Contact \u0026 Business Inquiries 📧\nFor any questions or business inquiries, feel free to email us at icestudio.contact.info@gmail.com\n\nKeywords:\n    True Crime\n    Documentary\n    Mystery\n    Murder\n    Chilling\n    Obsession\n    Heartbreaking\n    Unsolved\n    Twist\n    Serial Killer\nHashtags:\n    #TrueCrime\n    #Documentary\n    #Mystery\n    #Murder\n    #Chilling",
      "release": "2024-08-30T21:00:14Z",
      "duration": "00:56:37",
      "explicit": false,
      "youTubeId": "TbWzMN5vMVA",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TbWzMN5vMVA"
      }
    }
  ]
}