{
  "_ts": 0,
  "id": "813fded7-cc32-49ba-be32-5f8c8d86c51d",
  "name": "Crime Writers On...True Crime Review",
  "spotifyId": "6yUoFbAaivIHJ5Vrn7AZVy",
  "appleId": 949195280,
  "episodes": [
    {
      "id": "d2f3ff24-5916-4e4d-aba2-04808ffcc251",
      "title": "Dangerous Memories",
      "description": "A young woman from a posh English family sought clarity about her sexual orientation from therapist Anne Craig. She convinced Fipsi her issues were a result of childhood abuse at the hands of her family - abuse Fipsi had no recollection of. Anne convinced her to cut ties with them and focus instead on their sessions. Anne diagnosed most of her well-to-do patients as victims of an underground pedophile ring. The women spent years estranged from their families. It left their parents convinced Anne brainwashed their daughters and unsure of how to get them back. The podcast “Dangerous Memories” from Tortoise explores the work of the self-styled counselor who convinced women of privilege they were victims and lured them into isolation and dependence. Host Grace Hugh Hallett talks to former clients and their families about Anne’s cult-like hold on them and the efforts to stop her. OUR SPOILER-FREE REVIEWS OF \u0022DANGEROUS MEMORIES\u0022 BEGIN IN THE FINAL 12 MINUTES OF THE EPISODE. In Crime of the Week: digital downloads . Here\u0027s the GOURDS article from McSweeney\u0027s! And here\u0027s the one from the Baroness Von Schraeder! Donate to Kevin\u0027s Walk-a-Mile: ERAS fundraiser for the Crisis Center of Ctr NH . For exclusive podcasts and more, sign up at Patreon . Sign up for our newsletter at crimewriterson.com.",
      "release": "2024-09-30T08:00:00Z",
      "duration": "00:45:54.2460000",
      "explicit": false,
      "spotifyId": "4YMCnSnDv5d95t3TdGiR8e",
      "appleId": 1000671263560,
      "subjects": [
        "Anne Craig"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YMCnSnDv5d95t3TdGiR8e",
        "apple": "https://podcasts.apple.com/podcast/dangerous-memories/id949195280?i=1000671263560"
      }
    }
  ]
}