{
  "id": "49f4fec1-4947-4367-b508-c58d54116f8b",
  "name": "Crime Junkie",
  "youTubeChannelId": "UCpRiMGGX2hM9zqv6FgXXbKg",
  "episodes": [
    {
      "id": "f5074b35-70c9-4661-bcda-8f0479b9aea3",
      "title": "Could These 1969 Murders Be Tied to Hollywood’s Most Infamous Cult?",
      "description": "In 1969, 17-year-old Marina Habe and 19-year-old Reet Jurvetson, known for decades only as Jane Doe 59, were murdered just miles apart in Los Angeles. Marina was abducted outside her home and later found stabbed. Reet, who had recently moved from Canada to L.A., was discovered stabbed over 150 times. She remained unidentified for more than 40 years.\nWhen LAPD Detective Cliff Shepard reopened Reet’s case in 2003, he uncovered poorly stored evidence that ultimately led to her identification in 2015 through DNA. Despite chilling similarities between the two murders, investigators now believe Marina’s and Reet’s cases were separate incidents. Both remain unsolved.\n\nTheories have swirled for decades, from possible connections to the Manson Family to elusive suspects known only as “Jean” or “John,” men linked to both Marina and Reet. Cold case detective, Cliff Richards, pitched this to us with a mission: to help surface new insights and hopefully spark new leads. Decades later, with evidence scarce and time slipping away, hope now hinges on the public to help bring answers to two unsolved tragedies.\n\nFor even more stories like this one, join the Crime Junkie Fan Club today: https://crimejunkiepodcast.com/fanclub?utm_source=youtube\u0026utm_medium=episode_description\u0026utm_campaign=signupfanclub\n\nT-Mobile 5G home internet. Let’s be friends with lots of benefits.\n\nFollow Crime Junkie:\nInstagram: https://www.instagram.com/crimejunkiepodcast\nFacebook: https://www.facebook.com/CrimeJunkiePodcast/\nTwitter: https://twitter.com/CrimeJunkiePod\nCrime Junkie is created and hosted by Ashley Flowers.\n\nAbout Ashley Flowers\nAshley Flowers is the top female podcaster in the U.S. and the host of Crime Junkie, the #1 podcast among women and the #1 true crime podcast globally. As the Founder of audiochuck, she has built a top-tier podcast production company that has garnered over 2.6 billion downloads, captivating audiences with its gripping storytelling through 10\u002B chart topping podcasts. Ashley and her team are dedicated to creating responsible true crime content that respects victims and their families.\n\nFollow Ashley:\nInstagram: https://www.instagram.com/ASHLEYFLOWERS/\nTwitter: https://twitter.com/ash_flowers\nTikTok: https://www.tiktok.com/@ashleyflowerscrimejunkie\nFacebook: https://www.facebook.com/ashleyflowers.af/\n\nCheck out these other great crime channels:\n@kallmekris  The Plot Twist Murder No One Saw Coming... https://www.youtube.com/watch?v=NYBF6CQ60DE \n@KendallRae  Killed By Her BEST Friend!? The Unbelievable Case Of Taylor Wright https://www.youtube.com/watch?v=MWFzCdOwSAs\u0026t=6s \n@bellafiori  The Chilling Case of Michelle Young https://www.youtube.com/watch?v=YxpT9q_5s30\u0026t=5s \n@annieelise  Rampage Ends in Triple Murder | Christian “Kit” Martin https://www.youtube.com/watch?v=343hoDX1qfc",
      "release": "2025-09-17T18:01:04Z",
      "duration": "00:43:39",
      "explicit": false,
      "youTubeId": "ycZou9QvQnY",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ycZou9QvQnY"
      }
    }
  ]
}