{
  "_ts": 0,
  "id": "8c1aa015-46db-4c1c-b14a-1d247d1fa676",
  "name": "Crime News AEOR",
  "youTubeChannelId": "UChFwhB_2qYwhi11enBu6H9g",
  "episodes": [
    {
      "id": "1c1b6a94-f228-4ea7-a227-c3ee2619d22b",
      "title": "Cult Leaders And Forced Child Labor: The Alarming Details",
      "description": "Cult leaders convicted of forcing children to work 16-hour days without pay\n\n⭐Want More Crime News? https://www.youtube.com/playlist?list=PLc0teciswGHJzI4YQMlyJbmEZfJFx3a64\n-----\nSeveral leaders of the United Nation of Islam (UNOI), a Kansas-based cult, were recently convicted for exploiting children in a forced labor scheme. The cult leaders coerced children into working up to 16-hour days without pay, under the threat of severe punishment, including beatings and threats of \u0022eternal hellfire.\u0022 The children were housed in overcrowded, unsanitary conditions and cut off from the outside world. The convicted members, including Kaaba Majeed and others, face prison sentences for conspiracy and forced labor\n-----\n⭐Here\u0027s the documentary I mentioned in the video - https://youtu.be/lx5dU-UVg60?si=19bYC4_UZpKfNs8O\n\n⭐More On Royall Jenkins - https://youtu.be/-iaFtEqHRuM?si=CwlU-wiOQXOJF_uM\n------\n⭐Watch Crime News Videos - \n➡️https://www.youtube.com/playlist?list=PLc0teciswGHJzI4YQMlyJbmEZfJFx3a64\n➡️https://www.youtube.com/playlist?list=PLc0teciswGHJ5rtAOwqcOhqaHGC8Ml9l9\n➡️https://www.youtube.com/playlist?list=PLc0teciswGHLuY0hv4R2oUrIWfQkPBrec\n------\n Forced Child Labor Cult Exposed, This Cult Leader Brought Child Slavery To A Kansas City, Disturbing Cult Leader That Likes To Play Surgeon \u0026 Mutilate All His Followers, How does a cult leader maintain control?, Child Forced Labor in the United States, Sex Cult Leader Forces Labor on College Students as Grip on Victims Tightens, Millions of kids forced into labor worldwide, Many Families Depend on Forced Child Labor, Child Labor Robs Children of Their Future, The Fight Against Child Labour, Cotton exporters force child labor, Syrian refugees forced into child labor, Change Your Role in Forced and Child Labor | P.J. Tobia | TEDxNashville, Uncovering Eight-Year-Old Children Working in Factories, A Lesson About Forced Labor, Forced Labor Victims Are Closer Than You Think, NC commune accused of forced child labor, United Nation of Islam (UNOI), Kansas-based cult, forced labor scheme, convicted leaders, child exploitation, 16-hour days, no pay, beatings and, threats, Kaaba Majeed, conspiracy and forced labor, labor, child labor, child labor laws, labour, royall jenkins, nation of islam, kansas city, muslim, cults, kck, the value creators, kansas news, extreme beliefs, child exploitation, abc news, AP News, Child abuse, local news, national news, nation of islam",
      "release": "2024-09-21T23:04:35Z",
      "duration": "00:07:26",
      "explicit": false,
      "youTubeId": "aPaVtLIe4vU",
      "subjects": [
        "United Nation of Islam"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aPaVtLIe4vU"
      }
    }
  ]
}