{
  "id": "5b195d32-ebf4-4c73-bbdf-e5c1ddf996ad",
  "name": "Crime Justice",
  "youTubeChannelId": "UCAGjTpq_R3LRyGUyuz9yLNQ",
  "episodes": [
    {
      "id": "03abd3a3-59c8-4802-94ca-5f5d1ea5a0d5",
      "title": "The Manson Family Murders | The Shocking True Story of Charles Manson\u0027s Cult | Crime 1969 |",
      "description": "Dive into the chilling true crime story of Charles Manson and his \u0022Family,\u0022 a cult responsible for the brutal 1969 murders that shook Hollywood and America. From the Tate-LaBianca killings to Manson\u0027s twisted Helter Skelter prophecy, this detailed narrative uncovers the madness, manipulation, and mayhem behind one of history\u0027s most infamous crime sprees. Perfect for true crime fans and those fascinated by the dark side of the 1960s counterculture. Join CRIME JUSTICE as we unravel this haunting case for our USA audience. Don’t forget to like, comment, and subscribe for more gripping true crime stories! 🔔\n#TrueCrime #CharlesManson #MansonFamily #HelterSkelter #CrimeJustice #TrueCrime #CharlesManson #MansonFamily #HelterSkelter\n#CrimeJustice #TateMurders #LaBiancaMurders\n#1960sCrime #CultCrimes #TrueCrimeUSA #HollywoodMurders #CrimeHistory\n#TrueCrimeDocumentary\n#AmericanCrime\n\n\nWelcome to CRIME JUSTICE – Where Silence Speaks the Truth.\n\nOn this channel, we bring you gripping true crime stories from around the world – some solved with justice served, and others still shrouded in mystery. From cold cases to criminal confessions, every story is based on real events, told with depth, accuracy, and respect.\n\nAt CRIME JUSTICE, we believe that every victim’s story deserves to be heard – even if the world has forgotten. Whether it’s a high-profile case or a lesser-known mystery, we dive deep into the facts to uncover the hidden truth behind each crime.\n\nIf you’re fascinated by true crime, solved mysteries, unsolved disappearances, and real-life investigations, this is the place for you.\n\nSubscribe to CRIME JUSTICE and let the silence reveal what words cannot.",
      "release": "2025-09-17T17:24:28Z",
      "duration": "00:12:47",
      "explicit": false,
      "youTubeId": "mTvmx6FB6W4",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mTvmx6FB6W4"
      }
    }
  ]
}