{
  "id": "dd664eed-fd3c-4682-be14-c13a35382f65",
  "name": "Crime World Presents: Groomed",
  "spotifyId": "0hUDcrHZO1ZbxXyMSfnDUs",
  "appleId": 1715522187,
  "episodes": [
    {
      "id": "8bd2ce8d-e7e5-4ee0-a843-f9b9e6e3a1c1",
      "title": "Groomed: Mountains of Mistakes",
      "description": "After the tragic death of Katie Simpson, Detective Sergeant James Brannigan made aware of the case by journalist Tanya Fowles. Brannigan initiates an investigation into Katie Simpson\u0027s death after recognising the failure of the PSNI to flag Jonathan Creswell\u0027s prior domestic abuse conviction, or to look into his version of events on the night of Katie\u0027s murder. Creswell, and the people around him, have questions to answer. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-20T05:40:00Z",
      "duration": "00:28:45.0480000",
      "explicit": false,
      "spotifyId": "4Rt0SzGiwIIbpPzKDpK7bG",
      "appleId": 1000732604819,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Rt0SzGiwIIbpPzKDpK7bG",
        "apple": "https://podcasts.apple.com/podcast/groomed-mountains-of-mistakes/id1715522187?i=1000732604819"
      }
    },
    {
      "id": "45a5f165-2473-401a-91f2-a57e5464f128",
      "title": "Groomed: Nightmares and Dreams",
      "description": "Katie Simpson, a talented and fearless young horsewoman is pulled into Jonathan Creswell’s orbit as a young child, suffering repeated physical and mental abuse at the hands of her sister\u0027s partner. By the time she turns 21, she is fighting to retain her independence. Her refusal to be cowed by Creswell\u0027s cruelty spurs his anger and control to new levels. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-20T05:35:00Z",
      "duration": "00:29:34.0800000",
      "explicit": false,
      "spotifyId": "4usahwDp6pjRdPTFSgDjMa",
      "appleId": 1000732604818,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4usahwDp6pjRdPTFSgDjMa",
        "apple": "https://podcasts.apple.com/podcast/groomed-nightmares-and-dreams/id1715522187?i=1000732604818"
      }
    },
    {
      "id": "ac4a93fb-2eb4-4a8f-b058-68245af03748",
      "title": "Groomed: Building the Cult",
      "description": "After a prison sentence for domestic abuse, Jonathan Creswell continues to establish a \u0027cult-like\u0027 unit of women around himself, using them for domestic, equestrian, and financial support while maintaining a public facade of charm for wealthy parents. The episode climaxes with Creswell moving his group, including pregnant Christina Simpson and young Katie Simpson, into his biological father Herbie Lusby\u0027s property in Donegal, where he continued his pattern of abuse, sexual harassment, and financial exploitation. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-20T05:30:00Z",
      "duration": "00:34:26.7820000",
      "explicit": false,
      "spotifyId": "2bAL7wA5gir6K8bh19RBQT",
      "appleId": 1000732604734,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bAL7wA5gir6K8bh19RBQT",
        "apple": "https://podcasts.apple.com/podcast/groomed-building-the-cult/id1715522187?i=1000732604734"
      }
    },
    {
      "id": "3511f096-a61e-4271-9cc5-439cf4e56044",
      "title": "Groomed: Golden Haired Boy",
      "description": "Episode three of Groomed examines origins of Jonathan Creswell, and the young woman who would become one of his primary victims: Christina Simpson. Creswell, the lovechild of a wealthy farmer and a teenager, was a \u0022golden child\u0022 in the equestrian world, who began a relationship with 15-year-old Christina after joining Darton Ree Stables, pulling her, along with former girlfriend Jill Robinson, into his dangerous orbit. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-13T04:35:00Z",
      "duration": "00:32:09",
      "explicit": false,
      "spotifyId": "28bCCdcvrxdZsa9bQKARcp",
      "appleId": 1000731537258,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28bCCdcvrxdZsa9bQKARcp",
        "apple": "https://podcasts.apple.com/podcast/groomed-golden-haired-boy/id1715522187?i=1000731537258"
      }
    },
    {
      "id": "f81dd8eb-cf73-47d6-b85b-cd5b4ace455c",
      "title": "Groomed: Close to Murder",
      "description": "In this episode, we look at Jonathan Creswell\u0027s history of extreme coercive control and physical abuse through the experience of his ex-partner, world-class show-jumper Abigail Lyle, who bravely spoke out about how he regularly beat and strangled her, and threatened her life, leading to his eventual, though short, prison sentence. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-13T04:33:00Z",
      "duration": "00:36:55",
      "explicit": false,
      "spotifyId": "2ZaNKpGcAOxldSVFIiJxyK",
      "appleId": 1000731537289,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZaNKpGcAOxldSVFIiJxyK",
        "apple": "https://podcasts.apple.com/podcast/groomed-close-to-murder/id1715522187?i=1000731537289"
      }
    },
    {
      "id": "ac94db89-c177-4dd9-af92-8723b27c83ca",
      "title": "Groomed: The Pied Piper of Tynan",
      "description": "Groomed is the disturbing story of Katie Simpson, a talented young horsewoman who tragically died after being beaten and strangled by her sister\u0027s partner, Jonathan Creswell. In this episode we see how Creswell, an ambitious and cocky jockey and horse-trainer, had established a pattern of emotionally abusive and controlling relationships with women in the equestrian world, including former girlfriend Jill Robinson and world-class showjumper Abigail Lyle. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-13T04:30:00Z",
      "duration": "00:21:02",
      "explicit": false,
      "spotifyId": "6ey1JQ3BHOmW2KbH3WOvZp",
      "appleId": 1000731537363,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ey1JQ3BHOmW2KbH3WOvZp",
        "apple": "https://podcasts.apple.com/podcast/groomed-the-pied-piper-of-tynan/id1715522187?i=1000731537363"
      }
    },
    {
      "id": "c868f36c-882d-42e6-8cf7-3835f709964d",
      "title": "Coming Soon: Groomed – Control, Coercion, and the Cold-Hearted Killing of Showjumper Katie Simpson",
      "description": "Groomed, a shocking new eight-part podcast series from Crime World, unveils the brutal truth behind the death of 21-year-old showjumper Katie Simpson, initially staged as a suicide but later revealed to be rape and murder at the hands of Jonathan Creswell, a 36-year-old with a history of controlling and abusing women. This narrative plunges into the dark world of a charismatic yet deeply depraved horseman who cultivated a cult-like control over multiple women, including Katie, her sister Christina, Jill Robinson, Hayley Robb, and Rose De Montmorency Wright. Despite a history of violence, chillingly previewed by the abuse of a former partner, Olympic showjumper Abigail Lyle, Creswell remained untouchable within the privileged equestrian community. It took the relentless efforts of a determined journalist and others to expose the truth, even as Creswell’s own dramatic suicide during his murder trial left his accomplices to face justice alone. Nicola Tallant and the Crime World team talk to journalists and investigators, as well as Katie\u0027s friends and Creswell\u0027s victims, to investigate just how such a violent individual was allowed to hurt so many people, and why he almost got away with murder. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-10-01T04:30:00Z",
      "duration": "00:01:23",
      "explicit": false,
      "spotifyId": "51uDcJ3sUXy56dCGL2LQKK",
      "appleId": 1000729453860,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/51uDcJ3sUXy56dCGL2LQKK",
        "apple": "https://podcasts.apple.com/podcast/coming-soon-groomed-control-coercion-and-the-cold/id1715522187?i=1000729453860"
      }
    }
  ]
}