{
  "id": "cf57ba37-1140-4934-b71e-2821acc74857",
  "name": "CR\u0027s Video Vaults",
  "spotifyId": "",
  "appleId": null,
  "youTubeChannelId": "UCa07aL-nJHQfLkTHAkH4SAw",
  "episodes": [
    {
      "id": "3d667e66-1cfc-4ace-8bc8-5296d23e4eee",
      "title": "Cult Awareness Centre, Ireland 1990",
      "description": "The growing popularity of cults has led to the setting up of a Cult Awareness Centre to provide information to potential followers.\n\nA new organisation has been established to provide information on religious cults. The Cult Awareness Centre was set up at the Irish Church Missions premises on Bachelors Walk, Dublin, in response to the increasing number of cults and sects targeting Ireland in recent years.\n\nAmong the supporters of the new group are former Moonies, Mormons, and Jehovah Witnesses.\n\nNoel Deane, Secretary at the Centre and former member of the Unification Church explains the purpose of the centre.\n\nWe hope to be able to provide proper information regarding the cults and false religions that are here in Ireland.\n\nRev. William Bridcut, Church of Ireland Superintendent of Irish Church Missions, talks about the increasing popularity of cults and the rise in problems associated with them. .\n\nWhen somebody comes along and says we have the truth and we alone are right, there’s a certain attraction in that.\n\nAn RTÉ News report broadcast on 3 May 1990. The reporter is Kieron Wood.",
      "release": "2023-09-24T17:00:09Z",
      "duration": "00:01:32",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "FWnYaILJ9vE",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=FWnYaILJ9vE"
      }
    },
    {
      "id": "a5c6084c-a6be-4894-8e0c-556ad917d8f6",
      "title": "Are Religious Cults Good Or Evil? Ireland 1996",
      "description": "Do religious cults ruin people’s lives or change them for the better?\n\nDissatisfaction with the main Christian churches can provide cults - or new religious movements, with opportunities to attract new recruits.\n\nSome people believe cults are evil and sinister groups who brainwash people and ruin lives. Others who have joined cults say their lives have changed for the better.\n\nPeople shopping in Dublin’s Ilac Centre give their opinions on whether there is any harm to religious cults. Some people interviewed believe cults are very dangerous, associating them with satanic rituals, witchcraft and black magic.\n\nOne woman admits she does not know much about cults but fears,\n\nThey brainwash everybody and take their money.\n\nAnother woman thinks cults are prey on intelligent, successful people who need to fill a void in their lives,\n\nI think people should be very wary.\n\nA man who says he is a Catholic has a relaxed attitude to what people chose to believe,\n\nI think everybody is entitled to whatever religion they would like to adopt.\n\nHowever an elderly woman is entirely dismissive of cults,\n\nCatholics don’t go in for them things you know.\n\n‘Gerry Ryan Tonight’ (GRT) is an Irish chat show hosted by Gerry Ryan that aired live for three series on Network 2 between 1995 and 1997. The studio-based light entertainment show featured guest interviews and live music. It was produced by Charlie McCarthy.\n\nThis episode of ‘Gerry Ryan Tonight’ was broadcast on 23 October 1996. The presenter is Gerry Ryan. The reporter is Hilary Fennell.",
      "release": "2022-11-05T18:41:59Z",
      "duration": "00:01:39",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "IY51kCN6oTk",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=IY51kCN6oTk"
      }
    }
  ]
}