{
  "id": "cf57ba37-1140-4934-b71e-2821acc74857",
  "name": "CR\u0027s Video Vaults",
  "youTubeChannelId": "UCa07aL-nJHQfLkTHAkH4SAw",
  "episodes": [
    {
      "id": "a5c6084c-a6be-4894-8e0c-556ad917d8f6",
      "title": "Are Religious Cults Good Or Evil? Ireland 1996",
      "description": "Do religious cults ruin people’s lives or change them for the better?\n\nDissatisfaction with the main Christian churches can provide cults - or new religious movements, with opportunities to attract new recruits.\n\nSome people believe cults are evil and sinister groups who brainwash people and ruin lives. Others who have joined cults say their lives have changed for the better.\n\nPeople shopping in Dublin’s Ilac Centre give their opinions on whether there is any harm to religious cults. Some people interviewed believe cults are very dangerous, associating them with satanic rituals, witchcraft and black magic.\n\nOne woman admits she does not know much about cults but fears,\n\nThey brainwash everybody and take their money.\n\nAnother woman thinks cults are prey on intelligent, successful people who need to fill a void in their lives,\n\nI think people should be very wary.\n\nA man who says he is a Catholic has a relaxed attitude to what people chose to believe,\n\nI think everybody is entitled to whatever religion they would like to adopt.\n\nHowever an elderly woman is entirely dismissive of cults,\n\nCatholics don’t go in for them things you know.\n\n‘Gerry Ryan Tonight’ (GRT) is an Irish chat show hosted by Gerry Ryan that aired live for three series on Network 2 between 1995 and 1997. The studio-based light entertainment show featured guest interviews and live music. It was produced by Charlie McCarthy.\n\nThis episode of ‘Gerry Ryan Tonight’ was broadcast on 23 October 1996. The presenter is Gerry Ryan. The reporter is Hilary Fennell.",
      "release": "1996-10-23T12:00:00Z",
      "duration": "00:01:39",
      "explicit": false,
      "youTubeId": "IY51kCN6oTk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IY51kCN6oTk"
      }
    },
    {
      "id": "72368d9c-e030-4854-bc02-a226e7cf7bcd",
      "title": "Steve Collins Defeats Chris Eubank to win WBO Boxing Title, Cork City, Ireland 1995",
      "description": "Thousands come out to celebrate Steve Collins’ successful defence of his WBO title.\n\nThe Cabra-man defeated Chris Eubank for a second time in a rematch held in Páirc Uí Chaoimh in Cork on 9 September 1995. The victory meant Steven Collins remained the WBO super middleweight champion. Bryan Dobson introduces Tom McGuire’s report on Cork’s celebrations.\n\nThe Celtic Warrior had made his début in Cork, won his world title there, and had now defended it, so the city had a special welcome for him. Speaking to RTÉ News, Collins says:\n\nI’m on top of the world now. It’s great, I’m in a great situation .... My future is bright ahead of me, you know. I’m looking forward to my next fight.\n\nThe Lord Mayor of Cork, Joe O’Callaghan, is now making him an honorary Cork man. But Collins had predicted as far back as 1988 that he would one day be a world champion.\n\nAn RTÉ News report from 11 September 1995.\n\nThe report is introduced by newsreader Bryan Dobson.",
      "release": "1995-09-10T08:00:18Z",
      "duration": "00:01:43",
      "explicit": false,
      "youTubeId": "Ybwe2wQqBVc",
      "subjects": [
        "EDUCO",
        "_Ireland"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ybwe2wQqBVc"
      }
    },
    {
      "id": "65d787c8-c2f0-46e9-90cf-a33173792337",
      "title": "Irish Boxer Steve Collins set to Defend WBO Boxing Title vs Chris Eubank, Cork City, Ireland 1995",
      "description": "Boxer Steven Collins attends press conference at Beamish and Crawford Brewery in Cork City ahead of fight.\n\nDubliner Steve Collins defeated Chris Eubank in Millsteet, Cork in March 1995, becoming the new WBO super middleweight champion. A rematch was scheduled for later that year, to be held at Páirc Uí Chaoimh in Cork. A press conference was held the previous day, at which Eubank failed to show. Collins addressed the media alone.\n\nChris Eubanks has been saying some things that are totally out of order. They’re going to work to his disadvantage, because seven to eight weeks ago, when I started seriously preparing for this fight, I had in mind, I remember the threats he made, he was talking about harming me permanently.\n\nBarraí Mescall reports for RTÉ News on 7 September 1995.",
      "release": "1995-09-08T02:00:08Z",
      "duration": "00:01:05",
      "explicit": false,
      "youTubeId": "PqIrO9Q0hd4",
      "subjects": [
        "EDUCO",
        "_Ireland"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PqIrO9Q0hd4"
      }
    },
    {
      "id": "3d667e66-1cfc-4ace-8bc8-5296d23e4eee",
      "title": "Cult Awareness Centre, Ireland 1990",
      "description": "The growing popularity of cults has led to the setting up of a Cult Awareness Centre to provide information to potential followers.\n\nA new organisation has been established to provide information on religious cults. The Cult Awareness Centre was set up at the Irish Church Missions premises on Bachelors Walk, Dublin, in response to the increasing number of cults and sects targeting Ireland in recent years.\n\nAmong the supporters of the new group are former Moonies, Mormons, and Jehovah Witnesses.\n\nNoel Deane, Secretary at the Centre and former member of the Unification Church explains the purpose of the centre.\n\nWe hope to be able to provide proper information regarding the cults and false religions that are here in Ireland.\n\nRev. William Bridcut, Church of Ireland Superintendent of Irish Church Missions, talks about the increasing popularity of cults and the rise in problems associated with them. .\n\nWhen somebody comes along and says we have the truth and we alone are right, there’s a certain attraction in that.\n\nAn RTÉ News report broadcast on 3 May 1990. The reporter is Kieron Wood.",
      "release": "1990-05-03T12:00:00Z",
      "duration": "00:01:32",
      "explicit": false,
      "youTubeId": "FWnYaILJ9vE",
      "subjects": [
        "Unification Church",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FWnYaILJ9vE"
      }
    },
    {
      "id": "154134ac-01bc-4e87-9be7-a4d5327d5172",
      "title": "The Atlantis \u0027Screamers\u0027 Commune in Burtonport, Co. Donegal, Ireland 1980",
      "description": "An alternative way of life for the Atlantis Commune.\n\nKnown locally as the Screamers, the group practised primal screaming as a form of therapy. It was founded in 1974 by Englishwoman Jenny James, who features in this report along with other Atlantis members living in the commune’s house in Burtonport.\n\nThe group talk about the benefits of living an honest way of life. However, locals such as Hugh Boyle do not agree and says he would prefer to see them leave Burtonport and complains about having to listen to their “horrible screaming” in the middle of the night.\n\nI don’t think there’s any room for them in Burtonport. They’re a nuisance.\n\nAfter leaving Burtonport, the Atlantis Commune lived on the nearby island of Inishfree for several years before relocating to Colombia in South America.\n\nAn RTÉ News reports on 10 January 1980. The reporter is Jim Dougal.",
      "release": "1980-01-10T12:00:00Z",
      "duration": "00:05:12",
      "explicit": false,
      "youTubeId": "mnYq6qffBdA",
      "subjects": [
        "The Screamers",
        "Silver Sisterhood"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mnYq6qffBdA"
      }
    },
    {
      "id": "9a4edb81-75b7-432d-ab00-6839c71f6334",
      "title": "In Search Of Meaning, Ireland 1972",
      "description": "There has been a growth in popularity of religious groups like The Children of God and Divine Light Mission (DLM) who are meeting the needs of some young people looking to find meaning in their lives.\n\nDundalk born Tom McGuinness who goes by the biblical name of Zibiah claims to have found new meaning to his life as a member of the religious group ‘The Children of God’. Tom, along with other members of the group, are spreading the word of ‘The Children of God’ at St Stephen’s Green in Dublin.\n\nThe Children of God is \n\u0022A religious sect which originated in California in 1968 and which has since spread throughout Europe.\u0022\n\nThe sect appeals mainly to young people who find themselves at odds with society. Each member is a missionary who believes that their work is to spread the word of God and to inform people that God loves them. Their message is The Bible, Jesus and joy largely through song and dance.\n\nAnother religious group seeking new devotees is the Divine Light Mission (DLM) which operates from the Dandelion Market in Dublin. Dubliner Joseph Burn was among the first to join the Divine Light Mission. The group was founded in 1960 by Guru Hans Ji Maharaj in northern India. Their message of inner peace is achieved through meditation.\n\n(Guru Maharaj) has come onto this world to show man how to experience his true identity.\n\nOne member of the DLM first heard about it while living in London and knew she had found what she had been looking for. Another member says that Guru Maharaj has shown him how to experience his soul.\n\nAt a house in Santry, the Mahatma who is second in line to the Guru, teaches lessons in Satsang meditation and preaches the message of DLM. Dublin housewife Mrs O’Reilly is one of the many converts who has been convinced by his message.\n\nI have complete peace of mind. I have an absolute understanding of my own religion. As a Catholic, I can go to mass now and understand what the gospels are about, and for the first time I can fully realise the presence of God.\n\nMrs O’Reilly says that DLM is not a religion but rather something to help you to understand your own religion.\n\nBoth The Children of God and Divine Light Mission forbid both alcohol and tobacco use amongst their followers.\n\nNo need for such drugs, they say, if you receive Jesus into your heart.\n\nThis episode of ‘Tangents’ was broadcast on 17 October 1972.",
      "release": "1972-10-17T12:00:00Z",
      "duration": "00:08:35",
      "explicit": false,
      "youTubeId": "_tmRzhygBFY",
      "subjects": [
        "Children Of God",
        "Divine Light Mission",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_tmRzhygBFY"
      }
    },
    {
      "id": "76f72425-644a-46ff-97d5-3fa03a2ccec8",
      "title": "Scientology in Ireland, 1968",
      "description": "Irish psychiatrist and broadcaster Dr Anthony Clare on the growth of Scientology in Ireland.\n\nDr Anthony Clare is concerned about the social impact of a body whose set of beliefs attracts those who are what he describes as “psychologically unstable”.\n\nThey describe themselves as the world’s largest mental health organisation.\n\nDr Anthony Clare points out that the financial requirements for becoming involved in Scientology may act as a deterrent for many.\n\nAn RTÉ News report from 26 July 1968.",
      "release": "1968-07-26T17:00:26Z",
      "duration": "00:01:15",
      "explicit": false,
      "youTubeId": "qHEWBL1itCE",
      "subjects": [
        "_Ireland",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qHEWBL1itCE"
      }
    }
  ]
}