{
  "id": "8e8bfbcc-4c08-4682-aac0-2cfd7d6300f1",
  "name": "Cryton",
  "youTubeChannelId": "UCb9gttCzPcabOnq1nFYPwsw",
  "episodes": [
    {
      "id": "9c5f0d4a-b697-4bb2-b040-90d8a43c26d5",
      "title": "764: The Internet\u0027s Most Disturbing Cult",
      "description": "764 is one of the most disturbing organizations in the history of the internet. This cult is currently considered a top-tier threat by the FBI, and there are more than 250 ongoing investigations trying to bring them down. In today\u0027s video, we\u0027re investigating the history, and the current activities, of the infamous internet cult \u0022764\u0022... \n\nThis video contains unsettling content. We have included multiple warnings within the video about this fact. Please note that this video complies with all YT and Advertiser guidelines, and the content shown is strictly for documentary and educational purposes. This video is meant to educate the public on one of the greatest online threats facing youth today. The video is also in the public\u0027s interest, and falls under Educational, Documentary, Scientific, or Artistic (EDSA) context.\n\nPlease note that I have not personally entered any channels or servers related to 764, and thus, I have no first-hand knowledge of their operations. All information presented has been sourced from news outlets, investigative journalism, etc. \n\nThis video was made entirely by humans.\n\nChapters:\n00:00 Preview\n00:50 764 Founder \u0026 Origins\n04:15 764 Begins\n05:30 Disclaimer \u0026 Warning\n06:07 Video Structure\n06:40 Level 01\n08:37 Level 02\n11:16 Level 03\n16:12 Level 04\n19:39 Level 05\n22:18 Level 06\n24:00 Level 07\n25:58 Level 08\n32:12 Level 09\n34:35 Level 10\n37:12 Level 11\n40:02 Level 12\n49:14 Level 13\n57:10 Evolving 764\n\nHere are some other videos you might enjoy:\n-sister hong: The Internet’s Most Disturbed User: https://youtu.be/0kVp1YxrDbg?si=QzV4wXzxEclmv1oF\n-The Deepest Disturbing Website Iceberg: https://youtu.be/PYROjYr-WsA?si=i22skSyPl1nTElMm\n\nConnect:\nTwit: https://x.com/CrytonTV\nInsta: https://www.instagram.com/crytontv\nDiscord Community — https://discord.gg/ShadowDestiny\nBusiness Inquiries: CrytonBusiness@gmail.com",
      "release": "2026-01-15T13:00:05Z",
      "duration": "01:00:43",
      "explicit": false,
      "youTubeId": "arIS3FByNYk",
      "subjects": [
        "The Order of Nine Angles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=arIS3FByNYk"
      }
    }
  ]
}