{
  "_ts": 0,
  "id": "b4cd6ca5-0735-4411-8270-50784093a60c",
  "name": "Cults Uncovered",
  "youTubeChannelId": "UC5CtNy792RqgX2u9tkMA9Ow",
  "episodes": [
    {
      "id": "3e0fa82b-f91f-4f81-b337-d337e6245637",
      "title": "The Untold Story Of The Osho Cult’s Crimes",
      "description": "Support us: https://buymeacoffee.com/cultsuncovered\nEpidemic Sound: https://share.epidemicsound.com/xy36ro\nElevenLabs: https://elevenlabs.io/?from=partnerali3146\n\nThe Dark Origins of the Osho Cult: How the S*x Guru Built a Criminal Empire 🌟🔍\nIn this video, we dive deep into the shocking rise and fall of Bhagwan Shree Rajneesh, better known as the infamous S*x Guru. From his promises of spiritual enlightenment to the terrifying criminal empire that grew within the Osho cult, we expose the dark truth behind one of the most controversial spiritual movements in history.\n\n🔴 Discover:\n\nThe Rajneeshee bioterrorism attack, the largest in U.S. history 🧬🍽️\nThe shocking assassination plots against politicians and enemies 🎯\nThe criminal mind of Ma Anand Sheela, the mastermind behind it all 👀\nHow the Osho movement went from love and meditation to murder and chaos ⚖️\nPrepare to uncover the disturbing truth behind the charismatic S*x Guru who transformed his followers\u0027 dreams into a nightmare of control, crime, and paranoia.\n\n👉 If you\u0027re fascinated by stories of cults, power, and deception, don\u0027t forget to LIKE, COMMENT, and SUBSCRIBE! Hit the notification bell to stay updated on more shocking stories from the past! 🔔",
      "release": "2024-09-16T13:27:04Z",
      "duration": "00:19:30",
      "explicit": false,
      "youTubeId": "f9g4mMPSx9w",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f9g4mMPSx9w"
      }
    },
    {
      "id": "48f252c8-c1dc-41ea-a2ca-ff2719b17c5f",
      "title": "The Dark Secrets Behind Turkey\u0027s Most Infamous Cult",
      "description": "Dive into the unbelievable story of Adnan Oktar, the charismatic leader behind one of Turkey’s most notorious cults 🕵️‍♂️. From his early days as a religious scholar to becoming a TV sensation surrounded by his so-called \u0022kittens\u0022 🐱, this video uncovers the dark and twisted reality behind Oktar\u0027s empire 🌑. Learn how this self-proclaimed Islamic preacher manipulated his followers, orchestrated financial crimes 💰, and committed shocking acts of abuse, all while presenting a public facade of glamour and spirituality 🎭.\n\nJoin us as we trace Adnan Oktar’s rise to power 📈, his controversial beliefs, and the ultimate downfall that led to a staggering 8,658-year prison sentence 🚨. This deep dive into Oktar\u0027s cult reveals the disturbing secrets and the incredible impact of one of the most bizarre cult leaders in history 🕳️.\n\nDon’t forget to subscribe to Cults Uncovered for more shocking stories of infamous cults and their leaders 🎥. Like, share, and hit the notification bell 🔔 so you never miss an episode!",
      "release": "2024-09-01T03:58:36Z",
      "duration": "00:17:53",
      "explicit": false,
      "youTubeId": "pv50JosXEHk",
      "subjects": [
        "Adnan Oktar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pv50JosXEHk"
      }
    },
    {
      "id": "d39b843b-944a-42d0-948e-4c49b912dd94",
      "title": "Inside The Extremist Jewish Cult Of Lev Tahor",
      "description": "Imagine a world where children are forced into marriage as young as 12, where a simple hug can tear a family apart, and where leaders wield absolute power over the lives of members. Welcome to the dark and disturbing world of Lev Tahor.\n\nIn this episode of Cults Uncovered, we delve deep into the controversial Jewish sect known as Lev Tahor, often referred to as the \u0022Jewish Taliban.\u0022 Founded by the charismatic and extreme Rabbi Shlomo Helbrans in the 1980s, Lev Tahor has been plagued by allegations of crime against children, kidnapping, sexual exploitation, and a level of control that defies belief.\n\nWhat You’ll Discover:\n\nThe rise of Shlomo Helbrans and his messianic claims\nShocking stories of forced marriages, psychological abuse, and extreme isolation\nThe international cat-and-mouse game with authorities across multiple countries\nThe ongoing fight to bring Lev Tahor leaders to justice and free the children trapped within\nFrom the group\u0027s origins in Jerusalem to their secretive compounds in Central America, we unravel the chilling truth behind this cult’s “Pure Heart” facade. This is a story of resilience, manipulation, and the ongoing battle to protect the innocent.\n\nJoin us as we expose the secrets of Lev Tahor and shine a light on the fight to save the children caught in its grip.\n\n🔔 Don\u0027t forget to subscribe to our channel and hit the notification bell so you never miss an episode of Cults Uncovered. Your support helps us continue to uncover the truth behind the world\u0027s most dangerous cults.",
      "release": "2024-08-12T14:55:21Z",
      "duration": "00:19:36",
      "explicit": false,
      "youTubeId": "v6UazTHcSis",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=v6UazTHcSis"
      }
    },
    {
      "id": "03cfdbe4-7e28-4a5d-a0f1-f3f2194939cb",
      "title": "Murder in The Name of God: Pastor Turns Follower into a Killer",
      "description": "Uncover the chilling true story of the Knutby Filadelfia congregation, a seemingly peaceful church hiding dark secrets of manipulation, betrayal, and murder. This gripping tale follows Pastor Helge Fossmo, who used his position and twisted interpretations of faith to turn a devoted follower, Sara Svensson, into a pawn in his deadly game.\n\nFrom secret affairs and anonymous texts claiming to be from God to the brutal murders of Alexandra Fossmo and the attempted murder of Daniel Linde, this story exposes the horrifying depths of mind control and fanaticism. Discover how Fossmo’s cunning manipulations led to tragedy, tearing apart lives and shattering a community.\n\nJoin us as we delve into the sinister world of the Knutby cult, exploring the motives, the manipulations, and the aftermath that left an indelible mark on those involved.\n\n🔔 Subscribe to our channel for more gripping true crime stories and hit the bell icon to never miss an update! If you enjoyed this video, please give it a thumbs up 👍, share it with your friends 📢, and leave your thoughts in the comments below 💬.",
      "release": "2024-07-26T12:41:47Z",
      "duration": "00:19:41",
      "explicit": false,
      "youTubeId": "P4a2LsIeuHQ",
      "subjects": [
        "Cult Psychology",
        "Åsa Waldau"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P4a2LsIeuHQ"
      }
    },
    {
      "id": "ded92e81-0fe7-4269-8cee-5e1f336c26bd",
      "title": "The Most Psychotic Satanic Cult You’ve Never Heard Of",
      "description": "In this documentary, you will discover the chilling story of the Chicago Ripper Crew, one of the most psychotic satanic cults you\u0027ve never heard of. Explore the horrifying details of their crimes, their twisted rituals, and the impact they had on their victims.\nDiscover the shocking truth behind the cult’s leader, Robin Gecht, and his followers, who left a trail of fear and violence in their wake.\n\nJoin us as we explore:\n- The origins and formation of the Chicago Ripper Crew\n- The macabre rituals and satanic practices that defined the cult\n- The series of abductions, tortures, and murders that shocked Chicago\n- The police investigation and eventual capture of the crew\n- The lasting impact of their heinous acts on the community and true crime   history\n\nDon’t forget to like, comment, and subscribe to Cults Uncovered for more in-depth looks into the world’s most terrifying cults and criminal conspiracies.",
      "release": "2024-07-13T09:00:02Z",
      "duration": "00:16:03",
      "explicit": false,
      "youTubeId": "4Tyf9B5KZ7U",
      "subjects": [
        "Ripper Crew"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4Tyf9B5KZ7U"
      }
    },
    {
      "id": "60103db9-f0ae-468e-ae45-28fed8f33604",
      "title": "Inside the Terrifying World of a Dangerous Cult",
      "description": "Support us: https://buymeacoffee.com/cultsuncovered\nEpidemic Sound: https://share.epidemicsound.com/xy36ro\nElevenLabs: https://elevenlabs.io/?from=partnerali3146\n\nIn this gripping episode of Cults Uncovered, we delve into the dark and twisted world of Ervil LeBaron and his notorious polygamist cult, the Church of the Lamb of God. 🔍🕵️‍♂️ Discover how LeBaron\u0027s reign of terror led to a series of chilling crimes that shocked the world. 😱🩸\n\nErvil LeBaron, once a charismatic leader, manipulated his followers into committing heinous acts in the name of faith. We explore the rise of his cult, his ruthless methods of control, and the terrifying legacy he left behind. From orchestrating murders to instilling fear among his followers, LeBaron\u0027s story is a harrowing example of power gone wrong. ⚖️🔪\n\nLearn about the Church of the Lamb of God, its belief system, and how it transformed from a religious sect into a murderous cult under LeBaron\u0027s leadership. This video uncovers the psychological manipulation, the brutal enforcement of loyalty, and the ultimate downfall of one of history\u0027s most dangerous cults. 🏰😈\n\nDon\u0027t forget to like, comment, and subscribe to Cults Uncovered for more deep dives into the world of history\u0027s most infamous cults. 📲🔔 Hit the notification bell so you never miss an episode!\n\nSources:\nhttps://en.wikipedia.org/wiki/Ervil_LeBaron#:~:text=Ervil%20Morrell%20LeBaron%20%28February%2022%2C%201925%20%E2%80%93%20August,doctrine%20of%20blood%20atonement%20to%20justify%20the%20murders.\nhttps://en.wikipedia.org/wiki/Church_of_the_Firstborn_(LeBaron_family)\nhttps://en.wikipedia.org/wiki/Church_of_the_First_Born_of_the_Lamb_of_God\nhttps://people.com/all-about-ervil-morrell-lebaron-daughters-of-the-cult-8422942\nhttps://www.bbc.com/news/magazine-38526255\nhttps://abcnews.go.com/US/daughters-lebaron-cult-detail-violence-fear-life/story?id=106073158\nhttps://time.com/archive/6849085/the-nation-a-deadly-messenger-of-god/\nhttps://melmagazine.com/en-us/story/ervil-lebaron-the-mormon-manson\nhttps://www.latimes.com/archives/la-xpm-1992-09-20-vw-1753-story.html\nhttps://www.bbc.com/news/magazine-38526255",
      "release": "2024-07-06T09:00:42Z",
      "duration": "00:17:32",
      "explicit": false,
      "youTubeId": "ovfFjpkwSKY",
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ovfFjpkwSKY"
      }
    },
    {
      "id": "74b1c6c7-4734-4db0-b67f-413d03c619e0",
      "title": "The Devastating Truth About A Kenyan Doomsday Cult",
      "description": "🔍 Discover the Shocking Reality of the Shakahola Doomsday Cult in Kenya led by Pastor Paul Mackenzie 🔍\n\nIn this eye-opening documentary, we delve into the devastating truth about the Shakahola cult, a Kenyan doomsday group that has shocked the world. From the horrifying practices to the heart-wrenching stories of its members, we uncover the dark secrets behind this notorious cult.\n\n🔴 What you\u0027ll learn:\n\nThe origins and beliefs of the Shakahola cult\nThe impact of the cult on its followers and their families\nThe role of Kenyan authorities in addressing the crisis\n\n🔴 Why this matters:\nThe story of the Shakahola cult is a stark reminder of the dangers posed by extremist groups. Understanding their tactics and the suffering they cause can help us prevent similar tragedies in the future.\n\n👉 Don\u0027t forget to like, comment, and subscribe for more cult stories.",
      "release": "2024-06-27T09:00:11Z",
      "duration": "00:14:15",
      "explicit": false,
      "youTubeId": "GYMlv3Pi4aI",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GYMlv3Pi4aI"
      }
    },
    {
      "id": "909fb886-d754-4090-9c30-18baf95dc110",
      "title": "The Unbelievable Truth About Heaven’s Gate Cult",
      "description": "https://buymeacoffee.com/cultsuncovered\nEpidemic Sound: https://share.epidemicsound.com/xy36ro\nElevenLabs: https://elevenlabs.io/?from=partnerali3146\nDupdub: https://app.dupdub.com/login?invitation_code=46lMwA2Y\n\n🚀 Join us for a riveting journey into the heart of one of history\u0027s most mystifying cults with \u0022The Heaven\u0027s Gate.\u0022 🌟 This documentary offers a comprehensive examination of the enigmatic cult and its catastrophic conclusion. 🎬\n\n👁️ Discover:\n\nThe foundation and philosophy of Heaven\u0027s Gate 📚\nInsights into the life of the leader, Marshall Applewhite 🧠\nThe inner workings and beliefs of the cult members 🤝\nA detailed account of the tragic event in 1997 💣\nThe lasting effects on families and society at large 🌍\n🎤 Hear from experts, former members, and see exclusive footage that brings clarity to this complex story. 📹\n\n🌐 Whether you\u0027re a documentary aficionado, a psychology student, or intrigued by cult phenomena, this video is an essential watch. Remember to hit the like button, drop a comment with your thoughts, and subscribe for more captivating documentaries. 🔔",
      "release": "2024-05-19T12:00:43Z",
      "duration": "00:17:33",
      "explicit": false,
      "youTubeId": "mmaWk_J1fdk",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mmaWk_J1fdk"
      }
    },
    {
      "id": "183901ca-2670-4d31-a7ad-6799e7734946",
      "title": "The Cult of The Korean Messiah or Manipulator?",
      "description": "https://buymeacoffee.com/cultsuncovered\nEpidemic Sound: https://share.epidemicsound.com/xy36ro\nElevenLabs: https://elevenlabs.io/?from=partnerali3146\nDupdub: https://app.dupdub.com/login?invitation_code=46lMwA2Y\n\nIn our documentary, you will discover the fascinating story of how the Moonies cult, also known as the Unification Church, built a multi-million dollar empire. Learn more about their rise to power and influence in this eye-opening video. Uncover the intricate web of beliefs, practices, and the controversial figure at the heart of it all. Learn how Sun Myung Moon transformed the cult from its humble beginnings to a sprawling empire, we explore how this group managed to amass wealth and influence on a global scale. 🌕💰\n\nJoin us at Cults Uncovered as we peel back the layers of this enigmatic organization. Discover the methods used to attract followers, the business ventures that fueled their growth, and the impact on those who found themselves caught in the Moonies\u0027 orbit. Don\u0027t miss this riveting exploration of power, faith, and finance. Subscribe now for more deep dives into the world\u0027s most mysterious cults. 🔍🚀\n\nRemember, your engagement helps us bring more content like this to light. Like, comment, and share to keep the conversation going. Together, we can uncover the secrets that lie hidden in plain sight. Subscribe and hit the bell icon to never miss an episode from Cults Uncovered. 🌟🔔",
      "release": "2024-05-18T00:13:29Z",
      "duration": "00:15:37",
      "explicit": false,
      "youTubeId": "wend1j18DMY",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wend1j18DMY"
      }
    },
    {
      "id": "dd7c7fab-cff9-4f2c-b3e1-b77448f8b461",
      "title": "Inside the FBI\u0027s Deadly Clash with a Religious Cult – What Really Happened?",
      "description": "https://buymeacoffee.com/cultsuncovered\nEpidemic Sound: https://share.epidemicsound.com/xy36ro\nElevenLabs: https://elevenlabs.io/?from=partnerali3146\nDupdub: https://app.dupdub.com/login?invitation_code=46lMwA2Y\n\nEmbark on a harrowing journey into the heart of the 1993 Waco siege with \u0022David Koresh: The Truth About The Waco Massacre.\u0022 This documentary delves deep into the chilling events that led to one of the most infamous standoffs in American history. 🕍🔥\n\nUncover the layers of mystery and controversy surrounding David Koresh and the Branch Davidians in this compelling documentary. Through a blend of eyewitness accounts, expert interviews, and rare footage, we explore the complex dynamics between the religious sect and federal agents that culminated in a tragic finale. 🎬👁️\n\nWhat You\u0027ll Discover:\n\nThe Leader: A closer look at David Koresh\u0027s life, beliefs, and the influence he wielded over his followers. 🧔‍♂️📖\nThe Siege: An in-depth analysis of the 51-day standoff, the strategies employed by both sides, and the fateful decisions that led to disaster. 🚨💣\nThe Aftermath: The lasting impact of the siege on the survivors, the Branch Davidian community, and the broader implications for religious freedom and law enforcement in America. 🇺🇸⚖️\nWhy Watch? \u0022David Koresh: The Truth About The Waco Massacre\u0022 is more than a documentary-it\u0027s an emotional, thought-provoking piece that challenges viewers to question the narratives presented by the media and the government. It\u0027s a must-watch for anyone interested in true crime, cult dynamics, or American history. 🧐💡\n\nEngage with Us: Like, comment, and share your thoughts on the documentary. What did you find most shocking? What questions do you still have? Join the conversation and connect with others who share your curiosity. 👍💬\n\nDon\u0027t miss this deep dive into the Waco siege. Watch \u0022David Koresh: The Truth About The Waco Massacre\u0022 now and uncover the truth behind the headlines. 🎥👇",
      "release": "2024-04-19T21:00:12Z",
      "duration": "00:17:54",
      "explicit": false,
      "youTubeId": "Kmv6fibQy1Q",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kmv6fibQy1Q"
      }
    },
    {
      "id": "63047d8e-d493-4109-8325-6f8ac2938c4e",
      "title": "World\u0027s Most Wanted Nun",
      "description": "https://buymeacoffee.com/cultsuncovered\nEpidemic Sound: https://share.epidemicsound.com/xy36ro\nElevenLabs: https://elevenlabs.io/?from=partnerali3146\nDupdub: https://app.dupdub.com/login?invitation_code=46lMwA2Y\n\nIn the heart of darkness, a cult thrived-a cult led by a woman named Credonia Mwerinde. Was she an angelic messenger or a harbinger of doom? Join us as we share the chilling true story of the Kanungu Massacre in our documentary, where faith turned to fanaticism, and devotion led to destruction.\n\n🔥 Behind the Serene Facade: The cult promised salvation, but its true intentions were far more sinister. Beneath the prayers and hymns lay a web of deception. What drove thousands to follow Credonia into the abyss?\n\n🔮 The Doomsday Prophecy: Credonia foretold the end of the world. Her followers believed every word. But what was her ultimate goal? And why did she lead them to their tragic fate?\n\n🔥 The Fiery Inferno: On that fateful day in March 2000, flames engulfed the cult\u0027s compound. Bodies piled up. Was it mass suicide or something far more malevolent? The truth lies buried in the ashes.\n\n🌓 Credonia\u0027s Vanishing Act: As chaos consumed Kanungu, Credonia vanished. Did she orchestrate her own escape? Or did she slip into the shadows, leaving behind a legacy of horror?\n\n👁️‍🗨️ Subscribe to Cults Uncovered for more spine-tingling revelations. Ring the notification bell and join us on this journey into the abyss.\n\nSources: https://docs.google.com/document/d/14_ci6jbYnjTX-NBfkrwAPKDN3jwqL6M_-u_UNjvOUTM/edit?usp=sharing",
      "release": "2024-03-29T18:20:31Z",
      "duration": "00:28:21",
      "explicit": false,
      "youTubeId": "sfD6VegS44U",
      "subjects": [
        "Movement for the Restoration of the Ten Commandments of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sfD6VegS44U"
      }
    }
  ]
}