{
  "_ts": 0,
  "id": "923575d2-c6aa-4e34-8c54-2842367c899f",
  "name": "Cult Report Podcast",
  "youTubeChannelId": "UCf96mIxresjyaKdaXNJjoWQ",
  "episodes": [
    {
      "id": "71719e42-b675-4d66-bf8d-2b39431c4c08",
      "title": "Cult Report   |   Season 1   |   Episode 1   |   Cult Manipulation Tactics",
      "description": "Ever felt a primal fear around the word \u0022cult\u0022? We explore the psychology of cults and how they manipulate people. Experts like Mark Travers and Dr. Janja Lalich provide insights. We discuss the Jonestown Massacre to illustrate the dangers.\n\nKey Takeaways:\n• Cults are groups with a charismatic leader, demanding devotion, and limiting critical thinking.\n• They exploit basic human needs like belonging and purpose.\n• Tactics include cognitive dissonance, social influence, and manipulation.\n• Red flags: excessive devotion, isolation, mind-altering practices.\n• Trust your gut, do research, and reach out for help.\n\nRemember: Cults can happen anywhere. Stay informed and protect yourself.",
      "release": "2024-09-23T19:45:00Z",
      "duration": "00:12:45",
      "explicit": false,
      "youTubeId": "J_kdT0nO0-U",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J_kdT0nO0-U"
      }
    },
    {
      "id": "a6c5f2e7-7050-4ac7-9f39-693ed3d092b4",
      "title": "Cult Report Podcast   |   Season 1   |   Episode 1   |   General Cult Psychology",
      "description": "Episode 1: General Cult Psychology\n\nWelcome to Cult Report Podcast, your deep dive into the dark underbelly of cults and their psychological manipulations. In this inaugural episode, we\u0027re laying the groundwork by exploring the fundamental mechanisms that cults use to manipulate and control their members.\n\nWe\u0027ll examine the psychological tactics employed by these groups, the common themes that unite them, and the underlying human vulnerabilities that make us susceptible to such influence.\n\nFrom isolation and control to charismatic leadership and cognitive dissonance, we\u0027ll uncover the strategies that cults use to maintain their grip on their followers. We\u0027ll also discuss the shared themes among cults, such as apocalyptic beliefs, utopian visions, and secret knowledge.\n\nJoin us as we explore the psychology of cults and the dangers they pose.",
      "release": "2024-09-22T22:00:01Z",
      "duration": "00:09:10",
      "explicit": false,
      "youTubeId": "2Y2cgJIpJew",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2Y2cgJIpJew"
      }
    }
  ]
}