{
  "_ts": 0,
  "id": "3fcdc4d2-50b4-420d-afac-90e6af941b48",
  "name": "Cultured",
  "spotifyId": "6JGfdTsWW3uugM0cxQRKBE",
  "appleId": 1698754693,
  "youTubeChannelId": "UCkhgrRRvfZ6bRARh4lqNZXA",
  "episodes": [
    {
      "id": "f121608e-45a1-4490-8b5c-13877827c3a4",
      "title": "“ESCAPING THE CULT WAS THE EASY PART. Here’s Life 6 Years Later!” | ep 10",
      "description": "If you just found me for the first time, hi! I\u0027m Calvin. Thank you for being here! This video is one step closer to my dream of doing content full-time. Please like, comment, and subscribe! I love hearing from new people, and it helps the algo know that this content should be seen my more people. Thank you! :) Hire me to speak: calvinwayman.com/speak Getting Out of the Cult - My Story Spending a Day with Anthony Padilla: Follow on Instagram: instagram.com/calvinwayman Leaving the cult was the most difficult decision of my life. But once I left, things didn\u0027t all the sudden get easier. I had to start \u0022making moves\u0022 for this new life. In today\u0027s episode, for the first time, I\u0027m sharing how I started taking steps away from the cult and how the most impossible thing happened: moving to New York City. The story is wild. I hope you enjoy. TIMESTAMPS: 00:00:00 - What to expect in today’s episode 00:00:59 - Starting Over: Leaving everything I ever knew. 00:01:42 - Hire me to speak at your event. 00:02:43 - Getting into today’s episode 00:04:04 - Thank you! 00:04:20 - Confession #1 00:05:05 - Confession #2 (After leaving something hard, it doesn’t just get easy) 00:07:49 - Immediately after leaving the cult, I didn\u0027t know where to go. 00:09:37 - Visiting NYC for the first time (funny story about my dad) 00:14:07 - You won\u0027t believe this journal practice I used to get to NYC! 00:17:03 - The surprising plot-twist of the episode 00:19:12 - My poem on \u0022Home\u0022 00:21:05 - How I started turning an idea into reality 00:23:51 - The one \u0022STRANGE\u0022 question that helped me make NYC my reality 00:25:41 - Flashback: Going to NYC during Covid 00:29:56 - Flashback: New Years Eve 2020 00:31:03 - Great advice from my friend Teri that helped me pick where in NYC to live! 00:33:52 - The craziest part of the journey to NYC 00:36:59 - Self-doubt and honesty: Can I make it in Manhattan? 00:46:41 - Story approaching the climax 00:52:00 - My personal takeaway 00:54:56 - Looking ahead 00:56:54 - If you\u0027re new, this is for you! (Thank you!!) 00:58:34 - A special “thanks” to the person who made this episode possible",
      "release": "2025-01-30T18:20:35Z",
      "duration": "00:59:27.1450000",
      "explicit": false,
      "spotifyId": "4dci4bLQ0QzkM1Q0AoXpr9",
      "appleId": 1000687237308,
      "youTubeId": "3W_r2qEp89U",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4dci4bLQ0QzkM1Q0AoXpr9",
        "apple": "https://podcasts.apple.com/podcast/escaping-the-cult-was-the-easy-part-heres-life-6/id1698754693?i=1000687237308",
        "youtube": "https://www.youtube.com/watch?v=3W_r2qEp89U"
      }
    },
    {
      "id": "91377364-40ef-4ded-896c-ad1abd9dc936",
      "title": "\u0022Interfaith Debate: Should Different Religions Ever Marry?\u0022 | ft. @HalfPastChai (ep 9)",
      "description": "Oo la la! Today is a juicy episode--one of the most polarizing questions--should people of different faiths (and races) marry? Is it even possible to make work? Would that be a disaster? How would you raise your family? What holidays would you celebrate? What would be the hardest part? We cover all of that and more in today\u0027s episode. Please let me know your thoughts in the comments below! Suketu Patel:",
      "release": "2024-07-14T14:00:00Z",
      "duration": "01:30:00.1580000",
      "explicit": false,
      "spotifyId": "3yznuPP9frPXUBprWLIEQJ",
      "appleId": 1000662172060,
      "youTubeId": "R3283hmUn30",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3yznuPP9frPXUBprWLIEQJ",
        "apple": "https://podcasts.apple.com/podcast/interfaith-debate-should-different-religions-ever-marry/id1698754693?i=1000662172060",
        "youtube": "https://www.youtube.com/watch?v=R3283hmUn30"
      }
    },
    {
      "id": "08726a2c-a0a3-459c-ad90-ff62f558f122",
      "title": "Ex-Cult Member ROASTS Jubilee’s Mormons vs Ex-Mormons! (ep 8)",
      "description": "Oh what a fun video! Jubilee recently posted an episode on Mormons vs. Ex-Mormons—this is me reacting to that video. I of course grew up Fundamentalist Mormon, so I will also share additional historical context from a Fundamentalist Mormon perspective. LINKS 1) Original Jubilee Video: https://youtu.be/Run1f29po8g?si=UbPR9Jmi82ZckQHX 2) When I was on Jubilee: https://youtu.be/6p1nWGmdEUM?si=a0yrYReXVSb0_6uv 3) Cultured Episode on Masturbation: https://youtu.be/7aqXnhCsyI8 4) Episode with Johnny Harris: https://youtu.be/TDp0oh4qrzA 5) The Anthony Padilla Episode: https://youtu.be/I_rF4qkEFys?si=shsq9MS3WeewOfN1 TIMESTAMPS 00:00:00 Teaser 00:00:54 Podcast Intro 00:01:52 Who is Calvin Wayman and why this video? 00:07:56 Reaction starts -- “Mormonism is a cult.” 00:16:03 Mormon Obama?! 00:28:11 \u0022The Mormon Church Welcomes the LGBTQ Community.” 00:32:48 The silliest moment in the entire Jubilee episode *face palm* 00:43:52 The LDS Church is constantly changing 00:47:37 “Masturbation is sinful.” 00:48:45 “Women and men are equal in the Church.” 00:55:35 Tember makes a slip! 00:58:14 Even the Pro-Mormon Woman Says This! 01:12:01 \u0022It\u0027s okay for doctrine to change.” 01:17:05 The most racist belief in Mormonism. 01:19:37 How Mormon Leadership Hides History from Members. 01:12:19 Mormon leaders hide their roots to polygamy. 01:24:14 How Barrack Obama broken the Mormon Mind. 01:31:25 The origin story that led to racism in the LDS Church. 01:40:08 The LDS Church\u0027s secret curse: \u0022the skin of blackness.” 01:47:34 Mormon leaders switching stances 01:51:44 “The Mormon Church has done good in the world.” 01:58:42 Ending the Jubilee Vid. 01:59:44 My final takeway message.",
      "release": "2024-03-05T14:23:38Z",
      "duration": "02:02:11.6250000",
      "explicit": false,
      "spotifyId": "0Mke5VKUBgB13NTSS9RIN6",
      "appleId": 1000648086930,
      "youTubeId": "x6wlyIqqXZM",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Mke5VKUBgB13NTSS9RIN6",
        "apple": "https://podcasts.apple.com/podcast/ex-cult-member-roasts-jubilees-mormons-vs-ex-mormons-ep-8/id1698754693?i=1000648086930",
        "youtube": "https://www.youtube.com/watch?v=x6wlyIqqXZM"
      }
    },
    {
      "id": "88537d50-a23d-465b-b0e5-3c0d98894ec9",
      "title": "“Is Joe Biden a Polygamist?” (REVEALING THE TRUTH ABOUT DIFFERENT CULTURES) | ft.@BrettConti (ep 7)",
      "description": "What a fun, full-circle moment this episode is for me. A few years ago when I had almost no money and I was still living in a small town, I wanted to make living in New York feel possible, more normal. So I would go to YouTube and search “Day in the life of a New Yorker.” And whose videos popped up? Today’s guest, Brett Conti. We dive into the life of a YouTuber, and also talk about different cultures, including what it was like for me growing up in polygamy with 4 moms and 44 siblings. Can anyone imagine if Joe Biden came out and said that he was going to be a polygamist like that was just normal? Anyways, I dive into that and more on this episode. Please comment to let me know what you think! (Also, I like your curiosity—it shapes future episodes. Questions are entirely welcomed) TIMESTAMPS 00:00:00 Teaser and intro 00:01:57 Special message from Calvin 00:03:26 “Can being a content creator make you more self-aware?” (Plus, how New Yorkers say “coffee.”) 00:05:52 “I’m getting goosebumps” (Calvin shares how Brett inspired him to move to New York City). 00:09:25 How growing up in New York City fostered open-mindedness in Brett. 00:14:10 “Brett, how did you get into YouTube?” 00:19:49 How Brett used his clothing business to make YouTube videos. 00:21:03 “\u0022How do you know what type of content to make?\u0022 (The importance of leading with self-discovery). 00:23:04 “How did you make your first $1000 on YouTube?\u0022 00:27:44 \u0022What was the 1 video that changed everything?\u0022 00:29:31 “Did Brett believe in himself in the beginning?” 00:30:00 Why Calvin got into content—the most “impossible” thing at the time. 00:34:22 The moment Brett realized this YouTube dream was working. 00:38:03 Thailand. 00:48:18 “Did you know which one was your mom?” Calvin shares what it was like growing up in polygamy. 00:53:16 Arranged Marriages in Fundamentalist Mormonism. 01:01:33 \u0022Are you still close with any of your family now?” (Brett asks Calvin about the family dynamics). 01:04:21 How New York City actually reminds Calvin of growing up in polygamy. 01:06:25 What’s next for Brett? 01:09:26 Ending on the Deep End 01:14:07 Thank you for watching! Please subscribe!",
      "release": "2024-01-28T22:40:56Z",
      "duration": "01:14:33.0430000",
      "explicit": false,
      "spotifyId": "5LmzLpHgJvTSshii4y8kPx",
      "appleId": 1000643297558,
      "youTubeId": "i44Lfp1FY_A",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5LmzLpHgJvTSshii4y8kPx",
        "apple": "https://podcasts.apple.com/podcast/is-joe-biden-a-polygamist-revealing-the-truth/id1698754693?i=1000643297558",
        "youtube": "https://www.youtube.com/watch?v=i44Lfp1FY_A"
      }
    },
    {
      "id": "6632c0dd-7c01-49f0-bde9-9d5b4ad1870e",
      "title": "“Is the LDS Church a Cult?” (DECODING REAL HISTORY OF MORMONISM) | ft. Johnny Harris",
      "description": "YouTuber Johnny Harris grew up in Mormonism (LDS), and YouTuber Calvin Wayman, also grew up in Mormonism—but a different branch known as Fundamentalist Mormonism. In this episode, they explore the shared history of the Church. Inquiry and curiosity led both of them out. In this episode, Calvin and Johnny compare and contrast their journeys, while also sharing some key moments in Mormon history that aren’t often talked about. TIMESTAMPS 00:00:00 Teaser and intro 00:02:27 Special message from Calvin 00:03:31 “There’s a level of stress that just doesn’t go away, you can’t escape it!” Calvin talks Johnny Harris about his successful YouTube career (Episode begins) 00:05:19 “What would you do differently?” (Calvin asks Johnny for creator-advice) 00:06:47 Johnny and Calvin were both terrible employees. 00:08:57 “I was in two different worlds” (Johnny explains living in Mormonism in Oregon) 00:09:59 Swapping “crack” stories—when Calvin and Johnny started to realize that Mormonism didn’t have a monopoly on Truth. 00:13:19 “It’s when I had a kid!” (How becoming a dad made Johnny start to doubt Mormonism) 00:15:24 “I forced myself to have mystical experiences.” (Johnny explains who he was in Mormonism and how began to be more true to his nature) 00:17:07 “I knew in my body that this wasn’t working. There was a deep tension. I can’t bull-shit with myself anymore.” 00:18:05 Calvin shares one of his choice points for leaving 00:18:33 The “Mormon” Shelf (explaining mental thought-traps) 00:20:50 Johnny\u0027s “big critique” with the Mormon Church 00:22:48 “Everything crumbled for me.” (The moment Johnny left.) 00:23:59 Introducing our shared fore-father—Joseph Smith, founder of Mormonism 00:24:44 Johnny becoming an apologist. 00:25:49 The shared history (and “secret conflict”) of Fundamentalist Mormons and “Regular” Mormons 00:26:35 How polygamy “really” ended in Mormonism (Not what you\u0027ve heard) 00:28:03 Mass ex-communications on a significant minority in the LDS Church (Learning \u0022the Truth\u0022) 00:29:07 External motivations the Church had to end polygamy. 00:30:42 The LDS Church becoming more \u0022palatable\u0022 00:33:11 “I did not know about this, this is really juicy stuff!” (Calvin shares \u0022proof\u0022 why Fundamentalists are right and the LDS Church is wrong) 00:38:47 “The best story wins.” (How Mormon beliefs have persisted) 00:40:28 “I feel the spirit right now talking about it.” (The good parts of Mormonism) 00:45:56 The different experiences between men and women in Mormonism (and best part about being ex-mormon) 00:49:15 After leaving: “It’s a reclaiming” of your story. 00:50:26 “Red lines” — knowing how to talk about our stories without being disrespectful to those who still believe. 00:53:26 Choosing how to discuss hot-button history. 00:56:43 “I was washed over with a genuine sense of thrill.” (Embracing uncertainty in a post-Mormon world) 00:59:29 Calvin shares his new-found joy in the simple things 01:00:14 Ending on the deep end—Calvin asks Johnny “What are you most proud of?” 01:01:56 “What in your 20s built the most self-respect?” 01:03:11 “What are you most grateful for about life now?” 01:04:39 Final thoughts About Johnny Harris: Johnny Harris is an American filmmaker, journalist, and YouTube. To learn more about him and his experience with the LDS Church, go to one of the videos below: “Why I Left the Mormon Church” - https://youtu.be/aTMsfOcHiJg?si=ZpeoLkXSE6jrYTPt “The REAL Story of the Mormon Church.” - https://youtu.be/hUW7j9GmXjI?si=_0UsCclKEnBgYq8r About Calvin Wayman: Hey I’m Calvin. I grew up in a Fundamentalist Mormon cult that practices polygamy, known as “The Work of Jesus Christ of Latter-day Saints.” I have 1 dad, 4 moms, and 44 siblings. Yup. That’s not a typo—forty plus four. All in one house. The last few years have been me getting my feet under me, and today I live in New York City. Catch more of my story here: “What Was It Like Growing Up in a Cult?” - https://youtu.be/kBlQ22wIbnA?si=0QNw_e_S1ZZXZ5m9",
      "release": "2023-12-20T17:44:51Z",
      "duration": "01:06:02.3450000",
      "explicit": false,
      "spotifyId": "3OQ4NHLXjfbpy6drzKzGkO",
      "appleId": 1000639246955,
      "youTubeId": "TDp0oh4qrzA",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3OQ4NHLXjfbpy6drzKzGkO",
        "apple": "https://podcasts.apple.com/podcast/is-the-lds-church-a-cult-decoding-real/id1698754693?i=1000639246955",
        "youtube": "https://www.youtube.com/watch?v=TDp0oh4qrzA"
      }
    },
    {
      "id": "5056f2da-e060-4c87-8df4-aec698e56bed",
      "title": "\u0022Does Your Cult Smell Like My Cult?\u0022 (COMPARING OUR CULTS!) | ft. Amanda Rae",
      "description": "Someone in Amanda’s cult cut her neck when she tried to escape?! WTF is the “3-Wife Rule?” How did Fundamentalist Mormon cults start? And did the LDS Church have anything to do with it? Amanda Rae is back on the pod! This is a fun conversation that dives in a lot of different topics, all things cult. TIMESTAMPS 00:00:00 Teaser and Intro 00:01:38 Did Amanda turn into Calvin? (Episode begins) 00:03:48 Setting the conversation - comparing cults 00:05:55 Amanda\u0027s life in \u0022The Order\u0022 00:08:37 The \u00223 Wife\u0022 Rule 00:10:52 David Kingston 00:13:41 Narcissism and double-standards 00:18:23 The lack of accountability in Mormon cults 00:22:27 “The worst sin ever!” according to cult leader, John Timpson 00:25:54 Cult leaders are not always cult founders - How Warren Jeffs took power 00:32:58 Amanda has an epiphany! 00:34:43 What made Amanda start questioning her cult? 00:36:42 “Put It on the Shelf\u0022 — Mormon mind-tricks 00:40:25 Amanda’s first date is at Panda Express lol (How marriages happen) 00:44:38 Amanda is bleeding! 00:54:01 Why leaving a cult triggers existing members 00:56:28 Silly beliefs from Calvin and Amanda’s upbringing (Calvin plays audio when he was 8 years old) 01:02:24 Amanda explains “Numbered Men” 01:07:30 Amanda\u0027s dad secretly listened to her content 01:11:14 “Faith over questioning” - Order teaching 01:12:46 Calvin and Amanda finding their place in the world, post-cult 01:15:22 How the LDS Church created Fundamentalist Mormonism 01:21:26 The hardest parts of leaving a cult 01:23:37 Amanda finding benefits in “hard things” 01:25:20 Calvin deliberately choosing \u0022hard\u0022 01:32:10 The necessity of adopting whole new paradigms when leaving a cult 01:37:05 Calvin fell into depression after leaving, and the mindset that got him out of it 01:44:21 One of Calvin’s favorite quotes—“A mind full of conclusion has…” 01:47:10 Final thoughts 01:51:03 Please leave comments! And subscribe. It will help future episodes! SHOW-NOTES About Amanda Rae: Amanda Rae was in the show “Escaping Polygamy.” She has a YouTube channel where she exposes the teachings of the cult she was born into. You can catch her full story by going here: About Calvin Wayman: Hey I’m Calvin. I grew up in a Fundamentalist Mormon cult that practices polygamy, known as “The Work of Jesus Christ of Latter-day Saints.” I have 1 dad, 4 moms, and 44 siblings. Yup. That’s not a typo—forty plus four. All in one house. At 30 years old, I made the most difficult decision of my life and faced hell fire and damnation (according to my religious upbringing) by choosing to leave my religion, and start a whole new life on my own. The last few years have been me getting my feet under me, and today I live in New York City. This show is my expression. My perspectives. My art. I hope to bring awareness to cults, but more importantly, to the underrated power of individual sovereignty. Above all, this is a podcast that celebrates curiosity over conclusion. I hope you enjoy.",
      "release": "2023-11-20T00:53:58Z",
      "duration": "01:53:10.6760000",
      "explicit": false,
      "spotifyId": "3kQgtu25uPYDs1SU3TtSiU",
      "appleId": 1000635367671,
      "youTubeId": "KYmr3zO5RKY",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3kQgtu25uPYDs1SU3TtSiU",
        "apple": "https://podcasts.apple.com/podcast/does-your-cult-smell-like-my-cult-comparing-our-cults/id1698754693?i=1000635367671",
        "youtube": "https://www.youtube.com/watch?v=KYmr3zO5RKY"
      }
    },
    {
      "id": "82583764-c56a-4480-97e6-4c95970e6fbf",
      "title": "Is sex for marriage ONLY? | ft. Laura Desiree (Ep 4)",
      "description": "Oh my oh my. What an episode. If I would have told my 15-year old self that I would be sitting down talking with someone you can search on p*rnhub, he would have either felt like he was in heaven, or he was definitely on his way to hell. And that’s the conundrum on this episode. Is pleasure inherently good or bad? Why is it so difficult to talk about? Laura Desiree, who was a long-time anchor at Naked News, is a burlesque dancer, sex-positivity advocate, and just all around a curious cat. This is one of my favorite conversations I’ve had to date since moving to New York City. Laura and I just get candid and have real conversation about something we all are either engaged in, thinking about, or at the very least are the product of (and yet! It’s still a shameful thing to discuss in many circles). Through episodes like this one, I hope to spark more conversations around things we are taught to keep silent, because having the freedom to discuss them can have a major impact on all of our lives. Please subscribe to the channel if you haven’t already! It helps the algorithm know to share this with more audience, and gets me one step closer to content-creation being my full-time thing. Thank you for watching, listening and your all-around support. I hope you enjoy this episode. - Calvin Wayman Laura’s Red Umbrella Talk: https://www.youtube.com/playlist?list=PLZMA-fZofRcXfFdIq4EfN9fK9WF73TOcv To catch Calvin\u0027s full story of growing up in a cult, go here: https://open.spotify.com/episode/1B1s5SL3PKGVg1YSRXoEW4?si=e294bea8deee41f0 TIMESTAMPS 00:00:00 Intro and Teaser 00:01:16 Calvin met Laura where?! 00:03:45 What Calvin felt going to a s*x club 00:04:28 The taboo nature of s*x 00:06:36 What monogamists can learn from people in the s*x lifestyle 00:08:35 How silence around s*xual needs breeds resentment 00:09:31 Calvin\u0027s unpopular take in relationships 00:11:15 The importance of taking care of your s*xual needs 00:13:04 One of Calvin\u0027s favorite things from s*x-positive spaces 00:15:56 How did Laura become Laura? 00:18:01 Laura breaking her \u0022twinship\u0022 identity 00:23:49 How Laura began making her own life 00:25:21 Finding authenticity through the journey of s*xual-discovery 00:26:39 Orgasms 00:28:30 The art of “letting go” \u0026 Calvin notices a paradox 00:30:52 Bettie Page 00:32:40 Communicating your needs to another human 00:33:54 A sexy hack Laura learned at the \u0022New York School of Burlesque\u0022 00:36:00 What got Laura into s*x work? 00:38:51 The benefits of doing what scares you (like getting naked in front of strangers) 00:42:07 How Laura got into Naked News 00:42:40 Siri (or the Illuminati) joins the conversation 00:44:21 \u0022Dirty talk\u0022 00:46:04 When is it \u0022taking it too far?\u0022 00:50:51 The stigma with s*xual freedom and s*x work 00:55:45 Self-pleasure as a “sin” 00:58:37 Realizing that s*x is okay 00:59:41 Ending on the deep end: What Laura is most proud of from her teenaged-self 01:02:08 Laura reflects gives “unorthodox answer” to what she’s most proud of from her 20’s 01:03:56 Laura\u0027s first one-night stand 01:06:44 Calvin’s first one-night stand 01:09:17 Laura\u0027s favorite thing about life 01:11:53 Calvin says something that 99% of people wouldn\u0027t 01:13:32 Laura gives everyone a s*xual dare 01:16:47 Follow Laura\u0027s socials! 01:17:28 Final thoughts - please subscribe!",
      "release": "2023-11-08T14:54:56Z",
      "duration": "01:18:45.1820000",
      "explicit": false,
      "spotifyId": "55nX31dGgQeV0TlqfMHrPk",
      "appleId": 1000634144201,
      "youTubeId": "41nyAk_b7yc",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/55nX31dGgQeV0TlqfMHrPk",
        "apple": "https://podcasts.apple.com/podcast/is-sex-for-marriage-only-ft-laura-desiree-ep-4/id1698754693?i=1000634144201",
        "youtube": "https://www.youtube.com/watch?v=41nyAk_b7yc"
      }
    },
    {
      "id": "06f5a497-104f-4482-b160-0b36f1ae6c52",
      "title": "Is it okay to masturbate while Mormon? | ft. Chrisie Allen (Ep 3)",
      "description": "This is the most controversial piece of content I\u0027ve ever made to the internet. Please don\u0027t cancel me lol As someone who grew up Fundamentalist Mormon, I can\u0027t think of anything more scary or intimidating to talk about than...well, \u0022seggs.\u0022 (You know what I\u0027m talking about. I spelled it internet-friendly) So why not jump into the deep end and talk about seggs with a Seggs Worker? Insta @sexyexmo YouTube.com/@sexyexmo TIMESTAMPS 00:00:00 Teaser 00:00:51 Intro 00:01:42 Cold Start 00:03:18 What\u0027s a Molly Mormon? 00:04:19 Why this episode might get me cancelled 00:06:17 How Chrisie discovers masturb*tion 00:08:06 Can mastur*tion make you go blind?? 00:11:18 Does God get mad if you masturbate? 00:13:09 Chrisie\u0027s rocky road in and out of the LDS Church 00:15:59 My rant about Mormonism 00:19:42 Mormons would win gold in this sport every time 00:21:20 Chrisie continues her story out of the Mormon church 00:22:23 First porn mag 00:22:56 Chrisie at BYU 00:24:23 Confessing to old white men 00:27:11 How Chrisie got out 00:30:37 Another Mormonism rant--judgement based on what you were taught 00:32:49 Chrisie\u0027s Marriage 00:33:49 Mormon Confidence 00:36:05 The Mormon videogame - having your calling and election made sure 00:39:45 \u0022If it\u0027s Priesthood, it\u0027s yes.\u0022 00:44:03 Mormonism hijacking regular human experiences 00:44:44 The reason I felt sad to get baptized 00:47:13 Chrisie finally leaves her marriage 00:49:57 How Chrisie left Mormonism 00:51:26 \u0022The garments\u0022 00:56:03 One thing everyone owes to themselves--whether they are religious or not 00:59:30 Chrisie comes out to her family 01:01:15 The religion I\u0027m in now. 01:02:28 Chrisie\u0027s final straw 01:03:30 When I met my first S*x Worker 01:05:40 What got Chrisie into s*x work? 01:12:53 Olive oil has super powers--not like you might think 01:15:15 What Chrisie is up to now 01:17:52 Parting thoughts",
      "release": "2023-09-16T01:13:20Z",
      "duration": "01:20:45.3100000",
      "explicit": false,
      "spotifyId": "4MiyahUoyrthadBBsDVPLO",
      "appleId": 1000628060922,
      "youTubeId": "7aqXnhCsyI8",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4MiyahUoyrthadBBsDVPLO",
        "apple": "https://podcasts.apple.com/podcast/is-it-okay-to-m-e-while-mormon-ft-chrisie-allen-ep-3/id1698754693?i=1000628060922",
        "youtube": "https://www.youtube.com/watch?v=7aqXnhCsyI8"
      }
    },
    {
      "id": "eded4d5d-adfe-4f89-b141-c977af7db10e",
      "title": "How does someone ESCAPE a cult? (Ep 2)",
      "description": "Everyone thinks growing up in a cult is hard. But, that\u0027s not the hard part. The most difficult part of all is LEAVING. In this Part-2 episode, my friend Amanda and I are back in the studio. I share my story of what led up to me leaving, I share the racism in the cult, and how I finally got myself to make the decision...to then uproot my entire life and start over, at age 30. TIMESTAMPS 00:00 Teaser and Trigger Warning 00:17 Intro 01:08 Sound check 02:09 \u0022What\u0027s the best compliment you\u0027ve ever been given?\u0022 03:19 \u0022Is this incentuous?\u0022 04:52 Starting the episode 05:44 Su*c*de Ideation 07:15 The Worst Curse Word On the Planet 08:14 Amanda continues story about feeling su*c*dal 11:04 The meaning of life (according to Mormons) 12:09 I continue my story (Noticing Overt Racism in Fundamentalist Mormonism) 14:29 The religious story of how everyone got their skin color 25:05 I start telling others about my upbringing, and begin traveling 26:54 The realization I had looking out my window of a flight 29:56 Experiencing Hell 33:01 Origin of my internal conflicts 33:25 Reaching my decision point 33:49 The moment my life changed—the audio-note. 41:48 Personal reflections on that moment of the audio-note 43:38 Willful Blindness as a means of protection 46:12 \u0022How the h*ll did you do that, Calvin?\u0022 49:01 Beginning my transition out of the cult 50:48 Lessons from leaving 53:46 Looking ahead to future episodes (Wait…is that Kelly Slater??!)",
      "release": "2023-08-26T19:07:06Z",
      "duration": "00:58:11.7100000",
      "explicit": false,
      "spotifyId": "6I0PYHiD1Ct3w4vNj12iBR",
      "appleId": 1000625774704,
      "youTubeId": "X0yQk0-Aj_U",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6I0PYHiD1Ct3w4vNj12iBR",
        "apple": "https://podcasts.apple.com/podcast/how-does-someone-escape-a-cult-ep-2/id1698754693?i=1000625774704",
        "youtube": "https://www.youtube.com/watch?v=X0yQk0-Aj_U"
      }
    },
    {
      "id": "93172ae2-5a26-43fe-9ee0-db7425412717",
      "title": "What is it like growing up in a Mormon cult? MY TRUE STORY (Ep 1)",
      "description": "In this inaugural episode for Cultured, I share details about growing up fundamentalist mormon--with 1 dad, 4 moms, and 44 siblings. My friend Amanda joins me to deep dive into some things I\u0027ve never shared anywhere...until now. Follow me on IG to let me know what you thought of this episode @calvinwayman Time Stamps: 00:00:00 -INTRO 00:03:15 -Calvins Story 00:05:45 -The Cult Itself: Mormonism \u0026 Polygamy 00:13:50 -Revision of History \u0026 How it Affected the Religion 00:15:30 -If it weren’t for Polygamy we wouldn’t be here24:00- LDS leaders decide not to talk about polygamy publicly 00:25:25 -Celestial Law \u0026 The Split 00:26:00 -Lying to Outsiders 00:32:00 Excommunicating members?!? 00:37:50 -Life at Hogwarts \u0026 Childhood Stories 00:45:00 -Desire to be my own person \u0026 Calvins first job “On the Outside” 00:54:00 - Falling in Love with my Aunt 1:11:00 - Calvin asks to go to college 1:27:00 - The Fateful philosophy class 1:36:00 - Who are you? Finding Truth \u0026 Knowledge 1:38:00 - THE CRACK 1:45:00 - Calvins Marriage \u0026 Questioning Leaving 1:47:00 -Going to California 1:53:00 - Growth \u0026 Relationships 2:00:00 -God Stories, The Devil \u0026 Full Blown Question Mode",
      "release": "2023-08-19T03:04:13Z",
      "duration": "02:02:30.5050000",
      "explicit": false,
      "spotifyId": "1B1s5SL3PKGVg1YSRXoEW4",
      "appleId": 1000624946672,
      "youTubeId": "kBlQ22wIbnA",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1B1s5SL3PKGVg1YSRXoEW4",
        "apple": "https://podcasts.apple.com/podcast/what-is-it-like-growing-up-in-a-mormon-cult-my-true-story-ep-1/id1698754693?i=1000624946672",
        "youtube": "https://www.youtube.com/watch?v=kBlQ22wIbnA"
      }
    },
    {
      "id": "569e3a00-8907-45f4-b3b6-3123b3044e28",
      "title": "Ex-Cult Member Starts a Podcast",
      "description": "It’s finally here! As I’ve shared my story, I kept having people ask, “are you going to start a podcast for all of this?” It is now here. Welcome to Cultured! On this episode, I give the deets and teasers on what you can expect. Also, you can sign up to know when the first big episode goes live at ⁠ www.CulturedPod.com",
      "release": "2023-07-20T22:01:57Z",
      "duration": "00:15:33.9080000",
      "explicit": false,
      "spotifyId": "7J15n3sLFs8pKCXvfBZ9bO",
      "appleId": 1000621925265,
      "youTubeId": "TnEemgyZ1FQ",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7J15n3sLFs8pKCXvfBZ9bO",
        "apple": "https://podcasts.apple.com/podcast/ex-cult-member-starts-a-podcast/id1698754693?i=1000621925265",
        "youtube": "https://www.youtube.com/watch?v=TnEemgyZ1FQ"
      }
    }
  ]
}