{
  "id": "295ed85e-2941-47c3-a75c-4e6cf360b6bc",
  "name": "Cult Chat",
  "spotifyId": "5gYtZpO3mpnQmBsSZO9b9j",
  "appleId": 1693307722,
  "episodes": [
    {
      "id": "e9d3be86-3f23-4fd6-b85d-498480e49168",
      "title": "Episode 15: Organisations Under Threat",
      "description": "How do harmful organizations respond when they are accused of abuse? What are the indicators that the response lacks substance or is part of a strategic ploy to maintain control and protect an image? Today our hosts talk about defenses used by abusive groups, including denial, excuses, justifications and comparisons, using examples they have encountered personally. Listen in to learn what real apologies look like, how to sniff out concessions and demonstrations, and why the difference matters. Show Notes: Something’s Not Right - Wade MullenDARVO - Jennifer FreydA kind of apology from Bert Potter’s son at Bert’s funeral - May 2012Criticism of Caroline from an anonymous former Centrepoint member - Nov 2020Abuse in Care Royal Commision of Inquiry - RedressWhy Won’t You Apologize? By Harriet LernerInstitutional Betrayal - Jennifer Freyd",
      "release": "2023-11-07T00:00:00Z",
      "duration": "00:58:07.6340000",
      "explicit": false,
      "spotifyId": "5jsrtuDbeFmO3oeZ8Uvt81",
      "appleId": 1000633935456,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jsrtuDbeFmO3oeZ8Uvt81",
        "apple": "https://podcasts.apple.com/podcast/episode-15-organisations-under-threat/id1693307722?i=1000633935456"
      }
    },
    {
      "id": "1d580a6e-6f5a-494b-b611-66204e00051e",
      "title": "Episode 14: Jehovah\u0027s Witnesses in the High Court - Part 2",
      "description": "Join us for part 2 of Lindy’s conversation with Shayne and Rachael about the JWs application to be exempt from the NZ Royal Commision of Inquiry into Abuse in Care. They examine the arguments that played out in court, providing a fascinating case study of a faith-based group’s reaction to being investigated by outsiders. Lindy, Liz and Caz then unpack the interview and ask if the behaviour displayed by the JWs under scrutiny gives indications of cultishness, coercion or control.  Listen to Part One (Episode 13) here Show Notes Jehovah\u0027s Witnesses head to court on Abuse in Care Inquiry - RNZJehovah\u0027s Witnesses\u0027 argument against being included in Abuse in ...Jehovah\u0027s Witnesses \u0027care\u0027 outside scope of abuse inquiry, court toldJehovah\u0027s Witnesses apply for judicial review of Royal CommissionThe rules and culture that keep child sex offenders hidden ... - RNZSomething Evil - 10 August 2023RNZ investigation reveals 11 alleged paedophiles active within the Jehovah\u0027s Witnesses - 14 August 2023Jehovah’s Witness elder alleges order to destroy evidence in child sex abuse cases - 15 August 2023Silent lambs - The Spin Off - Jully 2018",
      "release": "2023-10-25T04:40:19Z",
      "duration": "00:29:57.6400000",
      "explicit": false,
      "spotifyId": "6QXD9zwQ9Ok7LnT4qkvVjY",
      "appleId": 1000632532450,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6QXD9zwQ9Ok7LnT4qkvVjY",
        "apple": "https://podcasts.apple.com/podcast/episode-14-jehovahs-witnesses-in-the-high-court-part-2/id1693307722?i=1000632532450"
      }
    },
    {
      "id": "e739770a-df13-4d5f-ae21-946ae40b6e7f",
      "title": "Episode 13: Jehovah\u0027s Witnesses in the High Court - Part 1",
      "description": "Lindy interviews Shayne Mechen and Rachael Jackson after a week in the High Court. The NZ branch of the Jehovah’s Witnesses are arguing their case for why they should be exempt from the NZ Royal Commision of Inquiry into Abuse in Care. Shayne and Rachel are both former JWs, and are advocates for former members of the JW faith. In the episode - part 1 of a 2 part interview - Shayne, Rachel and Lindy give an overview of who the JWs are, what they believe, and how this relates to the Royal Inquiry.\n\n\n\n\nShow Notes\n\nJehovah\u0027s Witnesses head to court on Abuse in Care Inquiry - RNZJehovah\u0027s Witnesses\u0027 argument against being included in Abuse in ...Jehovah\u0027s Witnesses \u0027care\u0027 outside scope of abuse inquiry, court toldJehovah\u0027s Witnesses apply for judicial review of Royal CommissionThe rules and culture that keep child sex offenders hidden ... - RNZSomething Evil - 10 August 2023RNZ investigation reveals 11 alleged paedophiles active within the Jehovah\u0027s Witnesses - 14 August 2023Jehovah’s Witness elder alleges order to destroy evidence in child sex abuse cases - 15 August 2023Silent lambs - The Spin Off - July 2018",
      "release": "2023-10-24T02:40:10Z",
      "duration": "00:51:08",
      "explicit": false,
      "spotifyId": "4mbuQhgUR8FQE36YKcRRyk",
      "appleId": 1000632383388,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mbuQhgUR8FQE36YKcRRyk",
        "apple": "https://podcasts.apple.com/us/podcast/episode-13-jehovahs-witnesses-in-the-high-court-part-1/id1693307722?i=1000632383388"
      }
    },
    {
      "id": "f4f24353-0628-40af-bc03-bf0d4f72c836",
      "title": "Episode 12: Two Worlds Collide - Plymouth Brethren Christian Church",
      "description": "The leader of the Plymouth Brethren Christian Church (Exclusive Brethren) tells its New Zealand fellowship to urgently gather together, with very short notice, and 7000 Brethren drop tools and flood airports all over New Zealand in their urgency to show their obedience. Why? Is the world about to end? Is there something we need to know? Meanwhile, Lindy’s dearly beloved Nana Anna passes away and her shunned family on the outside advocate for their right to say goodbye. Show notes Exclusive Brethren lessons suggest Destiny should beware meddling in politicsExcommunicated by Craig Hoyle | Paper PlusInside unusual last-minute Brethren gathering | The Post",
      "release": "2023-10-10T06:38:20Z",
      "duration": "00:53:36.1430000",
      "explicit": false,
      "spotifyId": "1ESsQhouQDCtq0Pq43ESxS",
      "appleId": 1000630795560,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ESsQhouQDCtq0Pq43ESxS",
        "apple": "https://podcasts.apple.com/podcast/episode-12-two-worlds-collide-plymouth-brethren-christian/id1693307722?i=1000630795560"
      }
    },
    {
      "id": "b833a217-3d3a-4b85-ac9d-1192444974bd",
      "title": "Episode 11: BONUS (Part B) Setting the Record Straight on Gloriavale",
      "description": "Part B: He said what?! Gloriavale Leavers and some current members provide commentary around journalist Rebecca Wright’s visit to Parliament where they asked the head of NZ’s Child Protection Agency whether the children at Gloriavale were safe. You won’t believe what he said! Leavers think it’s time the politicians \u0026 government agencies get educated. Today we set the record straight.  Show Notes: Episode 10: Setting the Record Straight On Gloriavale Part A: https://youtu.be/1lwsiGEOIPg Episode 11: Setting the Record Straight On Gloriavale Part B: https://youtu.be/FxEGi_OW0qo Shorter You Tube clip of the responses from Leavers (no podcast commentary): Setting the Record Straight on Gloriavale",
      "release": "2023-09-27T00:00:00Z",
      "duration": "00:59:20.4410000",
      "explicit": false,
      "spotifyId": "0doF98ijr26RHsYz31huDD",
      "appleId": 1000629287719,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0doF98ijr26RHsYz31huDD",
        "apple": "https://podcasts.apple.com/podcast/episode-11-bonus-part-b-setting-the-record-straight/id1693307722?i=1000629287719"
      }
    },
    {
      "id": "c994f805-b8b7-423a-8ab9-5a2017341ebd",
      "title": "Episode 10: BONUS (Part A) Setting the Record Straight on Gloriavale ",
      "description": "Part A: Articulate Gloriavale Leavers hit back at the politicians! Journalist Rebecca Wright (Newshub) went to Parliament to ask whether children are safe at Gloriavale. The Prime Minister’s answers elicited quite a reaction among 20 former and current members. Their contributions to this episode are priceless. Your hosts have tied it together with commentary on the Government’s response to cults.   Show Notes: Watch Episode 10: Setting the Record Straight On Gloriavale Part A: ⁠https://youtu.be/1lwsiGEOIPg⁠ Watch Episode 11: Setting the Record Straight On Gloriavale Part B: ⁠https://youtu.be/FxEGi_OW0qo⁠ Watch Shorter You Tube clip of the responses from Leavers (no podcast commentary): ⁠Setting the Record Straight on Gloriavale⁠ ",
      "release": "2023-09-26T00:00:00Z",
      "duration": "00:59:50.8830000",
      "explicit": false,
      "spotifyId": "3uLf7xfAHGIAGie5q1kQ85",
      "appleId": 1000629285640,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uLf7xfAHGIAGie5q1kQ85",
        "apple": "https://podcasts.apple.com/podcast/episode-10-bonus-part-a-setting-the-record-straight/id1693307722?i=1000629285640"
      }
    },
    {
      "id": "2ed9c58a-01aa-45e5-8d7f-bc2d05781ac4",
      "title": "Episode 9: Telling lies to save souls for Shinchonji with Laura",
      "description": "Laura was a young adult just starting her career in Auckland when she was recruited into Shinchonji - a Korean high-demand religious group. In this interview Laura describes how she was pursued and recruited, and how fear, deceit and a desire to please others was used to trap her. She became a leader herself and used these same destructive tactics on others. Five years later she extracted herself and in leaving she gave up faith. This episode reveals how easily anyone can be recruited by a cult. Show notes Take Back Your Life by Janya LalichCombatting Cult Mind Control by Steve Hassan\u0027Brainwashed\u0027: How Shincheonji \u0027cult\u0027 aggressively recruits new members | Stuff.co.nzCoronavirus: Cult blamed for spread in Korea also active in NZPublic Trust NZ Community Growth Trust - Funding for psychological treatment for people impacted by cultsThe Deep Podcast - Faithful Disciple",
      "release": "2023-09-19T01:00:00Z",
      "duration": "00:58:55.0200000",
      "explicit": false,
      "spotifyId": "5p7Yq5Zlinnr50swBIZq7T",
      "appleId": 1000628382038,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5p7Yq5Zlinnr50swBIZq7T",
        "apple": "https://podcasts.apple.com/podcast/episode-9-telling-lies-to-save-souls-for-shinchonji/id1693307722?i=1000628382038"
      }
    },
    {
      "id": "6812f5ae-aa54-4d0d-ab25-1ec74617f739",
      "title": "Episode 8: The accidental cult reporter: Becoming part of the story with ‘Cult Trip’ author Anke Richter",
      "description": "A chance encounter with a Centrepoint survivor at a festival a decade ago set Anke Richter on a labyrinthine journey into understanding the aftermath of cults. The result of this work was “Cult Trip”, Anke’s book about her investigation into cults inside and outside New Zealand. Today\u0027s chat between Anke and Caz discusses trauma-informed, survivor-centric journalism, how impossible it is to stay objective when writing about the human impact of cults, and how Anke’s and Caz’s stories intersect. Show notes: Anke’s website - more about Anke, her workshop “How not to start a cult” and how to purchase her book “Cult Trip”North and South 2015 Bert’s Labyrinth Departures - Anke Richter’s Gloriavale article  2019Culty Conversations NZ - private FB group for people interested is respectful dialogue about cultsThe accidental cult tourist August 2023 - Echo article",
      "release": "2023-09-12T01:00:00Z",
      "duration": "00:56:28.7080000",
      "explicit": false,
      "spotifyId": "3iAy3MrOlH593ULakntEeR",
      "appleId": 1000627573255,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3iAy3MrOlH593ULakntEeR",
        "apple": "https://podcasts.apple.com/podcast/episode-8-the-accidental-cult-reporter-becoming-part/id1693307722?i=1000627573255"
      }
    },
    {
      "id": "67c60772-5c34-4488-9288-eaf8a5f5a4d2",
      "title": "Episode 7: Culty word salad",
      "description": "Are you reaching for your dictionary far too often as you learn more about the cultisphere? If that’s you, you’ll love hearing our hosts slice and dice their way through the most common culty words and phrases. Sit back as our trio define concepts like narcissism, psychopathy, authoritarianism, machiavellianism, and gas-lighting. By the end of our chat you’ll be ready to butt-in on the next conversation you overhear about cults, with full confidence that you’re using the big words correctly.",
      "release": "2023-08-29T01:00:00Z",
      "duration": "00:49:10.2690000",
      "explicit": false,
      "spotifyId": "1S6EykorBf2VzOx4eIpxMy",
      "appleId": 1000626055035,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1S6EykorBf2VzOx4eIpxMy",
        "apple": "https://podcasts.apple.com/podcast/episode-7-culty-word-salad/id1693307722?i=1000626055035"
      }
    },
    {
      "id": "05c50aac-db4a-4378-b582-9fd2a540f116",
      "title": "Episode 6: What makes a cult a cult?",
      "description": "Are cults simply harmless fringe groups with unusual ideas, or something more? Are they always religious? Are they always harmful? Who gets to decide if the word cult is applied to a group, and what if people disagree? Are there some objective measures we can use to define cults? Today Lindy, Liz and Caz talk about some of the different ways cults are defined, drawing on common definitions and exploring some leading international experts’ understandings of what makes a group culty.  Show Notes: Recovery from Cults - by Michael LangoneWikipedia page - definition of cultBritannica dictionary - definition of cultJanya Lalich - What Makes a Cult a Cult?Steve Hassan article - Combatting Cult Mind Control, the BITE Model, and the Continuum InfluenceDr Norris Report - Gloriavale Employment CourtChecklist of Cult Indicators - compiled by Michael LangoneOlive Leaf Network - High Demand Hand",
      "release": "2023-08-14T23:00:00Z",
      "duration": "00:55:13.6840000",
      "explicit": false,
      "spotifyId": "6aFfAyjpVJSNkhSoCPsx3l",
      "appleId": 1000624462847,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aFfAyjpVJSNkhSoCPsx3l",
        "apple": "https://podcasts.apple.com/podcast/episode-6-what-makes-a-cult-a-cult/id1693307722?i=1000624462847"
      }
    },
    {
      "id": "09d8ef75-89af-4c15-ab82-ca0387e6e408",
      "title": "Episode 5: Three lawyers and a cult activist - with Brian Henry, Steve Patterson, Dennis Gates and Liz Gregory",
      "description": "How many lawyers does it take to overthrow a coercive controlling system of oppression? Twenty? A hundred? Listen to today’s bonus episode to find out the answer to this age old question as Liz asks the Gloriavale Leavers legal team - Brian, Dennis and Steve - the hard questions about the recent employment case. This bonus episode is being released in response to the July 2023 girls employment court case for the women that New Zealanders will forever fondly call “The Gloriavale Six”. Show Notes: What We Believe - The Gloriavale DoctrineDennis Gates TV3 interview - July 2023Gloriavale: A Woman\u0027s Place (2016) movieThe GLST website legal tab",
      "release": "2023-08-09T08:00:00Z",
      "duration": "01:31:32.0620000",
      "explicit": false,
      "spotifyId": "5iUdqOzHofI4pbMd79oxN1",
      "appleId": 1000623905886,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5iUdqOzHofI4pbMd79oxN1",
        "apple": "https://podcasts.apple.com/podcast/episode-5-three-lawyers-and-a-cult-activist-with/id1693307722?i=1000623905886"
      }
    },
    {
      "id": "e03f55d0-cbbc-4d03-8f64-9ba87f72cb57",
      "title": "Episode 4: Why isn’t anyone doing anything? - with Liz Gregory",
      "description": "Discover what drives Liz Gregory, founder of the Gloriavale Leavers’ Support Trust, as she shares her journey from being a teacher and business owner to unexpectedly providing support to survivors of a cult. Liz firmly believes that by thoroughly understanding the root causes of problems, we can develop more effective solutions for the future. Uncover the source of Liz\u0027s unwavering energy as she continues to raise awareness and advocate for those affected by the Gloriavale community. Show Notes:  Gloriavale Leavers’ Support Trust websiteGloriavale Community websiteSins of the Father, book by Phil CooperDaughter of Gloriavale, book by Lilia TarawaGloriavale Film 2022 (faith betrayed)Cult Trip book by Anke Richter",
      "release": "2023-07-31T23:00:00Z",
      "duration": "00:54:00.5150000",
      "explicit": false,
      "spotifyId": "3Wxi5EwVZcFnXbpIsp1sgb",
      "appleId": 1000622996782,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Wxi5EwVZcFnXbpIsp1sgb",
        "apple": "https://podcasts.apple.com/podcast/episode-4-why-isnt-anyone-doing-anything-with-liz-gregory/id1693307722?i=1000622996782"
      }
    },
    {
      "id": "7340104f-d572-4519-8036-3c02627a62c0",
      "title": "Episode 3: Shame, silence and speaking up - with Dr Caroline Ansley",
      "description": "Caroline talks about how her family became involved in Centrepoint, the time she spent there as a 7 year old, and the silence that surrounded the topic after she left. She explains the slow waking up to the impacts Centrepoint had on her life, and how she started to uncover the history which eventually led to her starting the Centrepoint Restoration Project. She discusses the motivation which drove her - a desire to turn an awful experience into something with meaning, hope and redemptive power. Show notes: Heaven \u0026 Hell: The Centrepoint Story The Open Letter to former adults of Centrepoint Herald 2021 article about Centrepoint child survivors  Breakfast with John Campbell May 2021 - This is Not My Shame  North and South Letter to the editor 2015  Stuff Podcast - The Commune Podcast 2022 Spin-Off - Articles 2021 and 2022",
      "release": "2023-07-17T23:00:00Z",
      "duration": "00:52:17.9850000",
      "explicit": false,
      "spotifyId": "67DAosq5ZMobRnX1opTEv8",
      "appleId": 1000621459263,
      "urls": {
        "spotify": "https://open.spotify.com/episode/67DAosq5ZMobRnX1opTEv8",
        "apple": "https://podcasts.apple.com/podcast/episode-3-shame-silence-and-speaking-up-with-dr/id1693307722?i=1000621459263"
      }
    },
    {
      "id": "66472ba9-6420-48fc-b8a2-af21d8e27d0c",
      "title": "Episode 2: Asking too many questions - with Lindy Jacomb",
      "description": "Listen to more of Lindy’s story, as she shares what it was like to grow up in the Exclusive Brethren, the unexpected outcomes of asking too many questions, and the difficult process of leaving.  We talk about the long-term impacts that former members of high-demand groups can have, especially in groups that practice familial shunning.  Lindy shares with us about the heartbeat of the Olive Leaf Network, concluding our chat with a poignant poem that she wrote on her 10 year leaving anniversary.  Show notes: Get A Life podcast interview with Lindy Jacomb (March 2023)  re. The Little Bird and the Olive Leaf Network YouTube link to Lindy’s The Little Bird story Let’s Talk about Sects Podcast ft. interview with Lindy Jacomb and investigative journalist and author Michael Bachelard Links to Olive Leaf Network platforms: Facebook LinkedIn Instagram Website",
      "release": "2023-07-03T23:00:00Z",
      "duration": "00:50:50.0830000",
      "explicit": false,
      "spotifyId": "7tqOQ35WyWoG3R6y8sSq3z",
      "appleId": 1000619186873,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tqOQ35WyWoG3R6y8sSq3z",
        "apple": "https://podcasts.apple.com/podcast/episode-2-asking-too-many-questions-with-lindy-jacomb/id1693307722?i=1000619186873"
      }
    },
    {
      "id": "5e768e8f-1592-4d12-9334-f1203b58b3f4",
      "title": "Episode 1: Alarm bells are ringing - with Dr Caroline Ansley, Liz Gregory and Lindy Jacomb",
      "description": "Meet Caroline, Liz and Lindy on this first episode as they talk about how they met and introduce us to their own projects in the cultisphere: the Centrepoint Restoration Project, Gloriavale Leavers Support Trust, and Olive Leaf Network. The trio talk about what listeners can expect from Cult Chat; cult awareness, impacts of coercive control, cult recovery, and questions about accountability. Show Links \u0026 References: Cult Chat on Facebook Olive Leaf Network Gloriavale Leavers Support Trust Centrepoint Restoration Project Cult Trip book - Anke Richter Heaven and Hell - The Centrepoint Story documentary Let\u0027s Talk About Sects podcast - Sarah Steele Do As I Say book - Sarah Steele Royal Commission into Abuse in Faith Based Care",
      "release": "2023-06-19T23:00:07Z",
      "duration": "00:33:20.7700000",
      "explicit": false,
      "spotifyId": "4YkxjzvasPGJtFertxOwPJ",
      "appleId": 1000617629670,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YkxjzvasPGJtFertxOwPJ",
        "apple": "https://podcasts.apple.com/podcast/episode-1-alarm-bells-are-ringing-with-dr-caroline/id1693307722?i=1000617629670"
      }
    }
  ]
}