{
  "id": "99d506d8-2aa4-44a2-8cab-823471c6558c",
  "name": "Cultivated with Kristen H. McLeod",
  "spotifyId": "2mOF5pnpe11tCjYbGAkPyb",
  "youTubeChannelId": "UCZLcwYh8LVD-TvPON69vqhw",
  "episodes": [
    {
      "id": "6688e1a7-3aa5-4008-a290-3b5c229c8927",
      "title": "The version of myself I feared the most",
      "description": "At fifteen, I wrote an essay about Hitler and then hid it for thirty six years.\n\nI kept it in a black binder at the bottom of a storage bin, through moves, clear outs, even a Marie Kondo phase. I believed it was proof of the worst version of me – the version that might have been capable of becoming the monster I had been taught to fear.\n\nLast week, I finally read it.\n\nThis essay lives in the overlap between teenage despair, high control religion, and the stories we tell ourselves about who we really are. It is about growing up in a Christian cult, being praised for obedience, and quietly wondering whether something dark at the core of me was the real truth.\n\nIt is also about what happens when you return to the evidence decades later and realise that the most lasting damage was never what happened to you, but what you decided about yourself.\n\nIf you\u0027ve ever looked back at a younger version of you with horror, shame, or tenderness, this one is for you.\n\nContent notes\nThis video includes discussion of Hitler and fascism, religious trauma, teenage suicidal ideation and self hatred. Please care for yourself as you watch.\n\nAbout Cultivated\nThis video is part of Cultivated – a literary memoir of resilience and reinvention after life in a cult. I grew up in a high control Christian group often called the 2x2s. I ran away at fifteen. Decades later, I am telling the story with as much clarity, beauty, and dark wit as I can manage.\n\nIf this resonates\n– Subscribe to the channel so you do not miss future chapters\n– Share this with someone who grew up in a high control religious environment or who is trying to make sense of a younger self\n– Read the companion essay on Substack for the full written version and links to other chapters of Cultivated\n\nSubstack – Cultivated: a literary memoir of resilience and reinvention after life in a cult at kristenhmcleod.substack.com\n\nThank you for watching and for staying with me through the hard parts.\n\nHeartbreaking by Kevin MacLeod is licensed under a Creative Commons Attribution 4.0 license. https://creativecommons.org/licenses/by/4.0/",
      "release": "2025-12-07T18:15:34Z",
      "duration": "00:18:23",
      "explicit": false,
      "youTubeId": "jdx-8QsWG4o",
      "subjects": [
        "Two By Twos",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jdx-8QsWG4o"
      }
    },
    {
      "id": "871d4bd2-61e5-4282-bb4c-ae1762e21d66",
      "title": "I Ran Away at 15 | Growing Up in a Cult",
      "description": "I was fifteen when I packed the backpack. Not much memory of it exists –only the knowledge that it happened. Clothes, probably hair spray. Not much else. The rest I left behind.\n\nThis episode of Cultivated traces the moment I left the life I’d been raised to accept – leaving a high-control religious group often called “the 2x2s.” What does it mean to walk away when you’re still a child? What happens to memory when survival demands forgetting?\n\nA story about the impossibility of leaving cleanly, the art of reconstruction, and the small, ordinary things we carry when we can’t take our past with us.\n\n🎧 Cultivated is a literary memoir of resilience and reinvention after life in a cult.\n\n✉️ Subscribe here, or on Substack: https://kristenhmcleod.substack.com\n\n📺 Watch more episodes: YouTube.com/@CultivatedMemoir\n\nIf this story moved you, leave a comment or share it with someone who understands what it means to start over.",
      "release": "2025-12-07T15:16:35Z",
      "duration": "00:12:19",
      "explicit": false,
      "youTubeId": "_6iED66ye1k",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_6iED66ye1k"
      }
    },
    {
      "id": "acd859d8-0282-4c3d-a24d-ffb4a885f879",
      "title": "Growing Up in a Cult | The Stories I Hid",
      "description": "For years, I handed out the sanitized version of my childhood: the pets, the mixtapes, the babysitting. But I left out the hardest parts — the grief, the rage, the boxes I sealed away in memory.\n\nIn this episode of Cultivated, I talk about:\n\n→ Growing up in the 2x2 cult and the stories I avoided telling\n→ How memory works like boxes, sealed and stacked out of reach\n→ Why grief defined my teens — and how I began to emerge\n→ Why it’s time to finally bring the hidden stories forward\n\nStay with me as I begin unpacking what I once refused to open.\n\n🔔 Subscribe for more essays, readings, and reflections from Cultivated: A Literary Memoir of Resilience and Reinvention After Life in a Cult.",
      "release": "2025-09-21T06:00:49Z",
      "duration": "00:12:49",
      "explicit": false,
      "youTubeId": "pY8EfoQoszE",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pY8EfoQoszE"
      }
    },
    {
      "id": "d30b85f5-be54-475b-82dd-dd38f84ba5e8",
      "title": "Growing Up in a Cult Taught Me to Plan for Zombie Apocalypses",
      "description": "What happens when you combine religious trauma, poor eyesight, and an overactive imagination? \n\nYou get someone who\u0027s spent way too much time planning survival strategies for the end times. This is my story about growing up in the 2x2 religious sect, learning to worry about everything, and why my glasses might be my downfall in a zombie apocalypse.\n\ncult survivor, religious trauma, 2x2 sect, anxiety, zombie apocalypse, survival planning, memoir, personal story, cult life, religious control, strategic worrying, dystopian fiction, preparedness, cult recovery",
      "release": "2025-06-09T17:36:55Z",
      "duration": "00:29:14",
      "explicit": false,
      "youTubeId": "kRRM3qgTngY",
      "subjects": [
        "Two By Twos",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kRRM3qgTngY"
      }
    },
    {
      "id": "4a6939bd-d39d-4827-aeac-9766f766b19e",
      "title": "When Truth Refuses to Behave | Memory, Rebellion \u0026amp; Storytelling",
      "description": "This essay was born out of spite. What began as a simple MFA assignment—to verify my memories—became something else entirely: a meditation on memory, truth, and why I no longer promise either.\n\nIf you’ve ever questioned the reliability of your own story, or wondered what happens when we stop insisting on truth, you’ll find something here.\n\nSubscribe on Substack for essays, memoir, and more: https://kristenhmcleod.substack.com/\nFollow along for new videos: https://www.youtube.com/@CultivatedWithKristen\n\n✨ New here? I’m Kristen, and I write Cultivated—a literary memoir project about resilience, reinvention, and life after a high-control religious group.",
      "release": "2025-06-01T14:42:24Z",
      "duration": "00:16:24",
      "explicit": false,
      "spotifyId": "7BDNgYscwvG3TXZ2xz9CKe",
      "youTubeId": "AOE-L-jAZMA",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7BDNgYscwvG3TXZ2xz9CKe",
        "youtube": "https://www.youtube.com/watch?v=AOE-L-jAZMA"
      }
    },
    {
      "id": "63e30aac-2398-453b-86d8-5502ddf9ae2d",
      "title": "Dress Code for the Afterlife",
      "description": "The 2x2s took modesty seriously—weaponized it, really. So naturally, denim was suspect. Unwritten dress codes were less about hiding skin than functioning as a system to keep us in line. Our sedate skirts and dresses served as uniforms for an invisible battle and served as declarations of our compliance. The 2x2s didn’t write the rules down. They didn’t have to. Because everyone already knew them. My father joined the 2x2 cult when I was a child. They called themselves true Christians. No, that’s not quite right, they didn’t like that label, although I’ve seen the odd business card indicating that the name we didn’t have was—in fact—Christian Fellowship. The cult was less religion, more a dress code with severe afterlife implications. Women wore long skirts and long hair. Men were mostly left alone, which seemed doctrinally inconsistent given the beard situation with Jesus. No jeans. No makeup. No jewelry. No bare shoulders. Nothing fitted, nothing bright. Nothing that might suggest you’d chosen your outfit purposely or thought you looked good. Modesty wasn’t about covering up. It was about erasing. I didn’t believe. Or, I didn’t believe easily. I wanted to. I wanted to want to. I hoped that counted. So I obeyed. I wore knee covering skirts, one swishy and flower patterned and with 57 buttons that—if I hadn’t been forced to wear it, I’d have loved. It was a confusing flicker of personal taste amid obligation. I covered my shoulders and my new and alarmingly full breasts that, from comments and stares, drew attention. I hated how I looked even more than the baseline of self-hate assigned to all pre- and fully-fledged teens, which meant I was doing it right. The worse you felt, the closer you were to God. That was the theology—unspoken, airtight, and deeply unflattering.One spring, I wore a faded denim number to Meeting. Nineties-long and light-washed. (The redo has been on the racks at Aritzia for a couple years now and I can’t believe I’m saying this, but I bought one. Maybe someday I’ll ceremoniously burn it, because I haven’t been able to bring myself to wear it.) Listen. I knew that fabric for a Meeting was risky. Only the rebels wore denim and everyone knew they were fast tracking to hell. But Wednesday night Bible Study was—in theory—more relaxed than the Sunday meetings. I’d crunched the fashion math, though, and determined the skirt’s length cancelled its fabric. Turns out I was just as bad at fashion math as regular math. The Elder scanned the room as he closed with his Testimony. “Sometimes the Enemy disguises comfort as righteousness. The path is narrow, and we must take care we’re not led astray.\u0022 On that last beat, he looked directly at me. That’s how correction worked—never explicitly addressed, never direct. It came in riddles, in warnings, and through carefully calibrated glances. Unless that correction came in the form of a Worker who convinces your high school principal he’s your minister—so it’s cool beans if he takes you out for lunch a few times and then ends up in your bedroom so you can talk privately. But those stories are for another day. They belong to a different rage. I went to Convention one summer dressed for salvation and—let’s be honest, in hopes I presented well enough at what was, essentially, an approved venue for finding your mate.I had learned by then not to save my best outfit for Sunday. Technically, Sunday was the most important day, but Convention ended after the second setting of lunch had been served in the Dining Shed. Saturday was better suited for showing off, but truly, Friday made the most sense. That way, the impact of people’s shock and awe on seeing my beautiful outfit wouldn’t be wasted by leaving the next day. I yearned for at least one dusty gravel path walk, with at least one of the boys, and of course, I was hoping it would be one of the shiny born and raised who would choose me for a stroll. Navy dress, stiff white blouse, fabric-wrapped buttons, hair pulled so tight I gave myself a temporary facelift well before I needed one. I was clearly in the game. Someone’s mother stopped me on my way out of the Sleeping Barn after I’d shellacked my hair in place. I’m confident she told herself she was helping. “How’s your mother doing?” she asked, her tone less inquiry, more accusation. She knew my mum didn’t attend meetings, and that unspoken failing always hung heavy in the air, a shadow on the piety I tried hard to show. The hem hit mid-shin. The top’s neckline sat just below my throat. Buttons and hooks pressed my chest into compliance. Every visible inch had been cleared by some internal modesty calculator I didn’t realize I’d built. Still, it wasn’t enough. Because it was never enough. The navy dress under the securely fastened and modest blouse? It was strapless. I knew I’d never wear it that way, but the thrill of seeing myself in the changing room mirror when I’d tried it on had been too much to resist. Maybe it had given me a fire in the eye this boy’s mother caught a glimpse of, maybe she connected it to what she knew was under my sedate top, had seen me when I’d dressed in the Barn. Her words were innocuous, all harm done with tone—a thing I’d become adept at discerning. I hadn’t understood then I was dangerous, I wouldn’t for a while yet. But she did, and she took a moment to let me know. The system was brilliant. You couldn’t follow the rules. Not all of them. Not completely. And that kept you trying. Kept you quiet. By the end of my first year of high school, I was changing outfits in the bathroom. Skirt on the bus, jeans for the school day, reversed before going home. Other 2x2s didn’t ask; they weren’t aware of my double life. People at school—including many concerned or simply curious teachers—asked all the time about the dress to jeans swap, and depending on my mood, I answered with short or even shorter explanations. My mood, to be clear, was generally not good, so whatever the length of my explanation, it was delivered with the fury only teenagers can so quickly tap. It wasn’t the rules (that were of course not rules at all) that broke me. It was how perfectly they worked. Every outfit a test. Every gaze an exam. The trick wasn’t to appear modest as much as it was to set yourself apart from the World. Signify different, embody meekness. I was an example, they said. I was, but not of what they implied. I functioned as an exact replica of subjugation, and I became complicit in vanquishing, of vanishing, my self.Once I started dipping out of the compliance charade, once I couldn’t ignore conversations with myself about what made sense and what didn’t, I still only deviated from the rules out of sight. This is a complicated thing to do at that age, and while I didn’t (thank heavens) develop into a prairie Sybil, splitting myself in two for years didn’t do much for my development. When splitting myself in two wasn’t an option anymore, I left. Another story, for another day. But after that, my first fully and completely defiance? It was wearing jeans in public, a thing I’d by then frequenty done, but my dissidence was found in not changing after I got home. No hidden skirt in my backpack, no mental checklist. No constant scanning for the ones who might catch me out. Just me, in blue jeans. No one died, but it sure felt like I might when Dad came home that day. He didn’t say a word, but to use a tired phrase, if looks could kill, I’d have been flat on the floor, laid out in, of course, a demure skirt. My mutinies stacked on themselves, my external appearance becoming an unsubtle battlefield against 2x2 dictates. Years later, I cut my hair. Not as a statement. Well, maybe it was, or it’s likely I wouldn’t have chosen the pixie cut that made me look like the scissors were nearby and I was feeling some things. Workers had often warned us about slippery slopes, implying the seemingly benign disguised a quick gateway to hell. Everything Worldly, defined explicitly and implicitly, inevitably led to a life on earth devoid of meaning and worse. They preached an afterlife of regret for being too weak to walk in the world without being of it. Publicly breaking the rules did not, of course, lead to my ruin. It led, first, to relief, although that lightness was tempered by dragging what I knew was not sin—but felt like it—behind me, a small, heavy thing weighting me down. And it was a long time before I assimilated myself into me, which is why I’ve struggled until now to write much more than beyond the surface of these years. Oh, you know, I found that skirt recently, the one with 57 buttons. Found the strapless blue dress, too (I’d forgotten it had a thin, stiff crinoline, which was why it kept its shape so well) and its white blouse topper. I held it up to myself in the mirror, crumpled and sad looking after nearly forty years in a storage bin. I saw myself at that moment. Tired and pale, 51 and far from young, but I saw her in the mirror, too. When last she wore that dress she hadn’t yet inhabited rage—but it was so close. It was so close to her. My heart ached for her, knowing what was coming, and how hard it would be. But the tired face looking back at me? There was something important in it, and I’m glad I didn’t miss it. Dark circles, yes. But that face was also free. For so many years, I’d always been slightly off—too much for the 2x2s, not enough for the rest of the world. I hovered, unbelonging, off balance, and dressed for a heaven I was pretty sure I wasn’t interested in. That hovering has been hard to shake. Maybe it always will be. Secretly keeping a foot in two worlds messes with your sense of self, wrenches you into parts. And while I do what I can to stitch the fragments of those two selves back together, it’s less Kintsugi—elegant, radiant, touched by gold leaf and wisdom—than it is dollar store tape, unsticking at its edges. But maybe reassembly itself is an art form. Maybe it starts with cheap tape and shame and ends with something that catches the light, even if it’s just barely. If you were raised to believe God watches hemlines, you might enjoy what happens next. Modesty might have been next to godliness, but honestly? Comfort is divine. ◡̈ Reply, leave a comment, or forward this to someone who’s still untangling fashion from faith. Or don’t. You’ve survived worse choices. To hear more, visit kristenhmcleod.substack.com",
      "release": "2025-05-25T17:31:59Z",
      "duration": "00:16:49.7630000",
      "explicit": false,
      "spotifyId": "4USHAYph6DGYmbVMUeHYkB",
      "youTubeId": "Uia-j1HsC5E",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4USHAYph6DGYmbVMUeHYkB",
        "youtube": "https://www.youtube.com/watch?v=Uia-j1HsC5E"
      }
    },
    {
      "id": "0aae5aa0-c5f7-4249-9253-535988f0b8e5",
      "title": "No One Signed My Cast",
      "description": "My youngest daughter is eight years old and determined to claim her place in the family narrative. The trouble is, her sisters already have their stories: surgeries, kidneys (or lack thereof), and all the drama that makes life feel significant. What happens when your child asks for a crisis—and why does it spark your own existential reckoning?\n\nJoin me for this literary memoir piece from Cultivated, where motherhood meets memory, meaning, and the relentless passage of time.\n\nIf you\u0027ve ever struggled with feeling like you\u0027re running out of time—or wondered how to nurture your child\u0027s sense of worth without offering them actual trauma—this essay is for you.",
      "release": "2025-05-01T20:17:11Z",
      "duration": "00:18:50",
      "explicit": false,
      "youTubeId": "vbjfl_rEn48",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vbjfl_rEn48"
      }
    },
    {
      "id": "06578049-311b-473a-a85c-bfe117d0e451",
      "title": "Cultivated: A Manifesto [for the Unchurched]",
      "description": "You don\u0027t owe anyone the person you used to be.\nThis is for anyone rebuilding themselves after silence, shame, or survival. Or who left a faith, a family, a life you were told was holy.\n\nWelcome to Cultivated — a literary memoir of resilience and reinvention after life in a cult.\n\nIn this Manifesto, I speak for the ones who left, the ones who outgrew their cages, the ones learning to write louder.\n\nSubscribe to Cultivated on Substack: https://kristenhmcleod.substack.com/\nSubscribe for more stories @CultivatedWithKristen \n\n#Cultivated #Memoir #Resilience #LeavingACult #Deconstruction #Reinvention",
      "release": "2025-04-27T03:58:55Z",
      "duration": "00:03:04",
      "explicit": false,
      "youTubeId": "ysfQ9NKdG5g",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ysfQ9NKdG5g"
      }
    },
    {
      "id": "04d56a44-9595-44c5-986f-749267d5a0e6",
      "title": "When Belief Changed My Father — And What Love Felt Like After",
      "description": "This is a clip from Cultivated, my literary memoir of resilience and reinvention after life in a cult.\n\nIt\u0027s the 1980s. My father has found something he calls “The Truth.” I tell him I don’t want to go. His eyes go cold.\n\nIt’s a moment I’ve carried for decades — when belief began changing him, and love began to feel different.\n\n📰 Full story on Substack: kristenhmcleod.substack.com\n▶️ Watch more videos: @CultivatedWithKristen \n📚 Subscribe for more true stories from Cultivated",
      "release": "2025-04-18T16:01:02Z",
      "duration": "00:03:58",
      "explicit": false,
      "youTubeId": "b3WSXm2ZT8c",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=b3WSXm2ZT8c"
      }
    },
    {
      "id": "2ca897ec-71a1-48c4-8dec-79ec663f7af6",
      "title": ".13 When I Said I Didn\u0026#39;t Want To Go, His Eyes Went Cold | Surviving a Cult | Memoir",
      "description": "In this episode of Cultivated, I share the moment I told my father I didn’t want to go to Sunday Night Meeting — and everything shifted. \n\nIt was the early ’80s. My father had found something he called The Truth — a small, insular religious cult that promised salvation and demanded obedience. My mother refused to join. \n\nI wasn’t sure what to believe. \n\nAll I knew was I was tired every Monday, and tired of being afraid. \n\nThis is a story about childhood, faith, love, and the slow unraveling of family when belief takes over. \n\n🎧 Cultivated is a literary memoir of resilience and reinvention after life in a cult. I’m telling the story I couldn’t tell for years — through essays, voice, and film. \n 💌 Read this story as a written essay on Substack: https://kristenhmcleod.substack.com/p/cult-truth-loss-memory\n🔔 Subscribe for new episodes every week @CultivatedWithKristen",
      "release": "2025-04-17T15:56:28Z",
      "duration": "00:13:19",
      "explicit": false,
      "youTubeId": "qQY9S8PQ5dk",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qQY9S8PQ5dk"
      }
    },
    {
      "id": "e1c59001-331b-4a7a-85df-1020df31cc72",
      "title": "Convention Part II, A Masterclass in Belief",
      "description": "Convention, Part II: A Masterclass in Belief\n\nIn the second installment exploring the strange, immersive world of the 2x2 Convention, I reflect on how deeply the rituals, silence, and sermons shaped our beliefs—and our lives. Convention wasn\u0027t just a religious gathering; it was a carefully orchestrated masterclass in belonging, obedience, and the performance of faith.\n\nAs I revisit those long summer days of sermons under canvas tents, quiet reverence, and communal living, I explore how these rituals built community yet isolated us from the outside world.\n\nCultivated is a literary memoir of resilience and reinvention after life in a cult.\n\n🔔 Subscribe for more episodes: @CultivatedWithKristen \n\n📚 Read the full essays on Substack: kristenhmcleod.substack.com",
      "release": "2025-04-14T14:25:05Z",
      "duration": "00:08:50",
      "explicit": false,
      "spotifyId": "128K60YhNEBWeZnamAfkPq",
      "youTubeId": "rcgKQ7jExJQ",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/128K60YhNEBWeZnamAfkPq",
        "youtube": "https://www.youtube.com/watch?v=rcgKQ7jExJQ"
      }
    },
    {
      "id": "1bdcbccb-410c-4b23-b4ff-df9fe4b41dd7",
      "title": "Convention Was a Masterclass — Just Not the Kind You’d Choose",
      "description": "What was Convention, really?\nA masterclass in silence, control, performance — and how to disappear inside a smile.\n\nThis clip is from Cultivated, a literary memoir of resilience and reinvention after life in a cult.\n\n👉 Subscribe for more shorts \u002B full story\n📖 Full essays \u0026 audio at https://kristenhmcleod.substack.com/\n🎙️ Full video version coming soon to @CultivatedWithKristen \n🎙️ Full video version https://kristenhmcleod.substack.com/",
      "release": "2025-04-11T16:37:49Z",
      "duration": "00:00:24",
      "explicit": false,
      "youTubeId": "zeaDL0z8KTw",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zeaDL0z8KTw"
      }
    },
    {
      "id": "6e50e283-e444-40cf-83b0-279ec301b62c",
      "title": "\u0027I’m not that girl anymore.\u0027 | A reply to a comment on Convention Pt 1 #shorts",
      "description": "Someone left a comment on one of my videos: “My heart bleeds for you. I can’t imagine how terrible that must have been.”\n\nThis is what I wanted to say back. (Thank you, @danielsmith8171)\n\nCultivated is a literary memoir of resilience and reinvention after life in a modern-day cult.\n\n📖 Subscribe for more.\n💌 Read or listen to the full story at kristenhmcleod.substack.com/\n\n#cultivated  #memoir  #shorts  #religioustrauma  #memoir  #resilience  #youarenotalone",
      "release": "2025-04-07T20:53:48Z",
      "duration": "00:01:17",
      "explicit": false,
      "youTubeId": "--NyJDDRP24",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=--NyJDDRP24"
      }
    },
    {
      "id": "68c5a4a0-6bf6-478d-ac6d-0fbc17e0cbe4",
      "title": "01 The Cult of My Dreams Was Italian",
      "description": "Episode 01: The Cult of My Dreams Was ItalianA memoir in sound — life after the 2x2s. I thought I was writing a memoir. But the present kept interrupting. This is the first episode of Cultivated, a literary memoir of resilience and reinvention after life in a cult. It\u0027s a story told in essays, unfolding in real time. It begins not with escape or revelation, but with a question: What am I now? Raised in the secretive 2x2s, I’m still untangling what that upbringing gave me, what it stole, and what it means to make something of a life after all that. ✍️ Read the full essay and subscribe for future episodes at https://kristenhmcleod.substack.com \u0026#x1f4fa; Watch or listen on YouTube. \u0026#x1f3a7; Subscribe to Cultivated for weekly memoir episodes. It’s free, sometimes funny, and always honest. Know someone who escaped something? Share this with them. To hear more, visit kristenhmcleod.substack.com",
      "release": "2025-04-07T00:00:00",
      "duration": "00:05:10.2820000",
      "explicit": false,
      "spotifyId": "2FiVg9msoZ5X99aLiYRmJB",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2FiVg9msoZ5X99aLiYRmJB"
      }
    },
    {
      "id": "d9e387a1-3133-47dc-bcac-d6533171dc9a",
      "title": ".11 Convention, Part I: The Bunkhouse and the Fantasy",
      "description": "Every summer, thousands of people gathered on a stranger’s farm to listen for God.\n\nWe called it Convention.\n\nIt smelled like hay. It sounded like silence. It felt like righteousness — and something else, too, something no one said out loud.\n\nIn this episode of Cultivated, I return to the site of the 2x2s’ most sacred annual gathering to tell the story of what it was like to grow up in one of the world’s most secretive Christian sects.\n\nThis is Part 1 of the Convention series — a blend of memory, observation, and survival.\n\n—\n\nCultivated is a video memoir told in fragments. It follows one woman’s journey into — and out of — a hidden religion known as the 2x2s. These stories are not a takedown, or a how-to-leave guide. They are the record of a life, told honestly, with as much humour as I can manage.\n\nNew videos weekly. Subscribe to follow the series.\n\n▶️ Listen from the beginning: https://www.youtube.com/watch?v=Q38xu6B1aXE\u0026list=PLeCsOlmQo-_K6tHCus2okCmgivUIfzhC5\u0026pp=gAQB\n📝 Read the full archive: https://kristenhmcleod.substack.com/\n🎙 Listen to the audio series: https://kristenhmcleod.substack.com/",
      "release": "2025-04-04T20:22:41Z",
      "duration": "00:11:19",
      "explicit": false,
      "spotifyId": "3ShgAiqNSqmnlot6XGYNyX",
      "youTubeId": "9ZXDduvPDb8",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ShgAiqNSqmnlot6XGYNyX",
        "youtube": "https://www.youtube.com/watch?v=9ZXDduvPDb8"
      }
    },
    {
      "id": "f0e008f3-ef86-4710-8a9f-c50863311a69",
      "title": "This Is Cultivated | Cultivated, the Memoir Video Series",
      "description": "This is Cultivated.\n\nA video memoir from inside — and beyond — one of the most secretive religious movements in the world: the 2x2s.\n\nThis short video marks the beginning of the Cultivated series, where I’ll share my story in essays, video, and audio — one piece at a time.\n\nIn this episode, I read “What Am I Now?”, a meditation on identity, belief, and what remains when a system of certainty dissolves.\n\nCultivated isn’t a deconstruction manual or a redemption arc.\nIt’s a life, in fragments — and how I’ve come to live inside the aftermath.\n\n—\nNew episodes every week.\nWatch the full series: [link to Cultivated playlist]\nRead the full archive on Substack: [substack link]\n\n#cultmemoir #ex2x2 #cultivated #memoirseries #religiousdeconstruction #exvangelical #cultsurvivor",
      "release": "2025-04-04T03:23:13Z",
      "duration": "00:06:28",
      "explicit": false,
      "youTubeId": "sVlQNqCTwjI",
      "subjects": [
        "Two By Twos",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sVlQNqCTwjI"
      }
    },
    {
      "id": "d52dfe07-0b4e-4909-89fc-57b24dd9cd52",
      "title": "10 The Day I Lost The Flintstones | Leaving a Cult, One Cartoon at a Time",
      "description": "When I was seven years old, my mum turned off The Flintstones at lunchtime. I didn’t know it then, but that small moment marked the beginning of my separation from the world I’d grown up in — and the start of a long, quiet exit from mainstream culture.\n\nIn the faith community I was raised in — often referred to as the 2x2s or The Truth—the World meant everything outside the group’s version of righteousness: friends, TV, popular culture, even schoolyard jokes. This is the story of the day I started to disappear from that world.\n\n✍️ Read more at https://kristenhmcleod.substack.com\n📬 Subscribe to get essays and new episodes direct to your inbox\n🎙️ Listen to the podcast version on Substack or Spotify",
      "release": "2025-03-27T18:57:52Z",
      "duration": "00:10:27",
      "explicit": false,
      "spotifyId": "18cy0w8H4miQvc191TExge",
      "youTubeId": "tT3FKLtAYuI",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18cy0w8H4miQvc191TExge",
        "youtube": "https://www.youtube.com/watch?v=tT3FKLtAYuI"
      }
    },
    {
      "id": "ea55febf-e760-45b6-a328-0e5e3244c1d7",
      "title": "This Is Not a Glamorous Cult Story. #cultsurvivor #memoir #yoububeshort #ex2x2",
      "description": "My daughter asked if I was really going to share all of it.\n\nI grew up in a cult. Ran away at fifteen. And I’m still untangling the mess — with therapy, parenting, writing, and more coffee than is medically advisable.\n\nCultivated is a memoir in motion — a series of true stories about belief, escape, and what it means to rebuild a life.\n\nThis isn’t a cult exposé (though I wish it ended in matching robes and poison).\n\nSubscribe for more. The teacups are filled. The stories are poured.",
      "release": "2025-03-26T21:03:50Z",
      "duration": "00:01:18",
      "explicit": false,
      "youTubeId": "Yr-bXHpa5Ro",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Yr-bXHpa5Ro"
      }
    },
    {
      "id": "4d5a249c-ea7f-4922-a7a4-cce3c6670cb3",
      "title": "09 The Performance of Belief | I Professed in a Cult at 13",
      "description": "At thirteen, I stood up at a summer Convention to \u0022profess\u0022 — the 2x2s\u0027 version of public salvation. No warning. No rehearsals. Just eternal damnation hanging delicately in the balance.\n\nThis wasn’t just about belief. It was about performance. And fear. And the learned art of saying the right things in the right tone, week after week, in living rooms that smelled of lemon polish and suppression.\n\nThis story is about what it means to pretend so hard, for so long, that the pretending becomes indistinguishable from strength.\n\nIf you’ve ever performed your faith instead of lived it — or wrestled with how much of yourself is real and how much is just survival — this one is for you.\n\n🔔 Subscribe for more stories from the Cultivated series\n📖 More at: https://kristenhmcleod.substack.com\n🎧 Podcast: Guilty Women coming soon",
      "release": "2025-03-22T16:51:47Z",
      "duration": "00:07:42",
      "explicit": false,
      "spotifyId": "21CcKsTujIrmiWepzp1jGP",
      "youTubeId": "vObUgjfXJcU",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21CcKsTujIrmiWepzp1jGP",
        "youtube": "https://www.youtube.com/watch?v=vObUgjfXJcU"
      }
    },
    {
      "id": "70023e38-5277-4453-8ae9-acc88515230d",
      "title": "08 This Is Not About Squirrels | A Story About Control",
      "description": "I’d like to say this is about squirrels.\n\nBut really, it’s about control. And chaos. And the strange negotiations we make every day to protect what little peace we can.\n\nIt’s also about: – BB guns\n– Dresses and damnation\n– The lights I bought at Costco\n– A handyman named Mike\n– And the way squirrels will always do what they want\n\nThis is a story about the futility of trying to hold things together — when you’ve been taught from childhood that order is salvation, that beauty is sinful, and that even squirrels might be working against you.\n\nIf you grew up with high expectations, shifting rules, or in a house where joy was rationed and modesty was measured in inches — this one’s for you.\n\n🔔 Subscribe for more Cultivated stories\n📖 Read more: https://kristenhmcleod.substack.com\n🎧 Podcast: Guilty Women — coming soon",
      "release": "2025-03-22T16:37:41Z",
      "duration": "00:16:04",
      "explicit": false,
      "spotifyId": "4it3l6vD5utVlcDvOM095d",
      "youTubeId": "gBobtN-1PwI",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4it3l6vD5utVlcDvOM095d",
        "youtube": "https://www.youtube.com/watch?v=gBobtN-1PwI"
      }
    },
    {
      "id": "8c8d81b2-f09b-41d1-bc15-19ddb2e339cd",
      "title": "07 The Night I Learned My Hair Was a Sin | A 2x2 Cult Story",
      "description": "“You’ll have to think about why,” the Worker said, when I asked why all the women had long hair.\n\nI did.\n\nAnd then, one night after my father banned me from playing with friends and forced us to read chapter after chapter of the Bible, I found the answer for myself. Right there in the New Testament.\n\nIt explained everything. And I could never unsee it.\n\nThis is a story about obedience and shame. About the tiny acts of rebellion mothers commit, and how daughters learn to police themselves in their place. It’s about beauty, guilt, and the moment a child internalizes a doctrine meant to break her spirit.\n\nThis is one night in the 2x2s—but it was also the beginning of everything that came after.\n\n📍If you’ve ever learned to mistrust your instincts through someone else’s scripture, this story will feel familiar.\n\n🔔 Subscribe to the Cultivated series\n📖 More stories: https://kristenhmcleod.substack.com\n🎧 Podcast: Guilty Women coming soon",
      "release": "2025-03-22T16:27:21Z",
      "duration": "00:12:12",
      "explicit": false,
      "spotifyId": "1IRmGmYI6eaPuXr1xEeqpU",
      "youTubeId": "KrWsu4lnW7c",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IRmGmYI6eaPuXr1xEeqpU",
        "youtube": "https://www.youtube.com/watch?v=KrWsu4lnW7c"
      }
    },
    {
      "id": "7eccc96d-c616-434e-b832-7bdf837bcf5e",
      "title": "06 I Thought I was Done with the 2x2s",
      "description": "I thought I’d moved on.\n\nMy childhood in the 2x2s — a high-control religious group — was something I’d already wrestled with. I\u0027d left. I\u0027d healed. Or so I believed.\n\nThen one quiet afternoon, prepping for tax season, I stumbled on a journalist’s question in a Facebook group. She asked where she could pitch a story about the 2x2s.\n\nWhat the actual —\n\nWhat followed was a year of reeling and rethinking everything I thought I’d already processed. A BBC article. A name I knew. A hotline. An avalanche of stories. A private Facebook group that saved me.\n\nThis is the story of that moment—the moment everything came rushing back. And what happened after.\n\nBecause healing isn’t linear. And sometimes, we don’t know how much we’re carrying until someone else speaks first.\n\n📍 If you’ve ever circled back to something you thought you’d left behind, this one’s for you.\n\n🔔 Subscribe for more from the Cultivated series\n📖 More stories at: https://kristenhmcleod.substack.com\n🎧 Guilty Women podcast – coming soon",
      "release": "2025-03-22T16:13:29Z",
      "duration": "00:09:25",
      "explicit": false,
      "spotifyId": "2im8At8yg3yewd5RCjaaL9",
      "youTubeId": "NcYLCM0DAR8",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2im8At8yg3yewd5RCjaaL9",
        "youtube": "https://www.youtube.com/watch?v=NcYLCM0DAR8"
      }
    },
    {
      "id": "3733270a-ac8a-4c05-b9b5-ff89ecf24341",
      "title": "05 Performing Friendship | Growing Up in the 2x2s",
      "description": "What happens when friendship is framed as dangerous?\n\nIn high-control groups like the 2x2s, connection with outsiders — worldly friends — is a threat. In this deeply personal story, I revisit the one friendship that saved me. A blonde, bold, beautiful girl who told me I mattered, even as everything around me said I didn’t.\n\nPerforming Friendship explores what it means to learn how to be a friend when you\u0027ve been taught not to trust your instincts. It’s about belonging, the ache of exclusion, and the power of one good friend to shape a life.\n\nThis story is for anyone who has stood on the periphery of friendship and longed to be let in.\n\nAnd for every former 2x2 wondering if closeness is possible after a lifetime of performing.\n\nIt is. It gets better. I promise.\n\n🔔 Subscribe for more memoir \u0026 meaning from the Cultivated series.\n📩 More stories at: https://kristenhmcleod.substack.com\n🎧 Coming soon: Guilty Women podcast",
      "release": "2025-03-22T15:53:40Z",
      "duration": "00:09:04",
      "explicit": false,
      "spotifyId": "6p8XtgXe48xQs75hMpev4N",
      "youTubeId": "crd4yUYE9SQ",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6p8XtgXe48xQs75hMpev4N",
        "youtube": "https://www.youtube.com/watch?v=crd4yUYE9SQ"
      }
    },
    {
      "id": "90e2f607-92db-4625-b9f5-54687990ea42",
      "title": "04 Parable of the Frogs",
      "description": "Parable of the Frogs is a personal memoir of childhood inside the 2x2s, a high-control religious group. This story takes us into a sweltering September afternoon, where a ten-year-old girl is asked if she wants to go to heaven. The answer, and what follows, shifts the trajectory of her life.\n\nTold with quiet fury, deep tenderness, and surgical precision, this is a story about modesty, obedience, fear, and the slow immersion into a system that demands everything — while calling it your choice.\n\nThis piece explores how small moments reveal entire belief systems. It’s a parable of daughters, dress codes, silence, and the stories we only understand in retrospect.\n\n👇 If you’ve ever felt like you were being boiled slowly, this one’s for you.\n\n🔔 Subscribe for more stories from the Cultivated series. \n📩 Read more: https://kristenhmcleod.substack.com \n🎧 Podcast: Guilty Women (coming soon)",
      "release": "2025-03-22T15:37:42Z",
      "duration": "00:22:08",
      "explicit": false,
      "spotifyId": "5W410FEfRld2w4GMSlk5bn",
      "youTubeId": "kqETQT-9NkE",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5W410FEfRld2w4GMSlk5bn",
        "youtube": "https://www.youtube.com/watch?v=kqETQT-9NkE"
      }
    },
    {
      "id": "962d5fab-4112-4c2d-93ac-6ad37bfa4256",
      "title": "02 Heaven When You Die",
      "description": "There wasn’t a manual for joining the 2x2s. No handbook. No list of rules. But I still knew what was expected.\n\nWomen had long hair. No jewelry. No pants. No choices.\n\nI grew out my bob. I put away my turquoise birthstone ring. I stopped running, jumping, playing—because dresses weren’t made for that. I watched as my Choose Your Own Adventure books burned in a white five-gallon pail.\n\nI pretended I didn’t want things I wasn’t allowed to have. And then, eventually, I stopped pretending.\n\nThis is Chapter 4 of Cultivated, my serialized memoir about growing up in the 2x2s, a faith so secretive it didn’t even have a name. No TV. No jewelry. No pants. Just an unshakable fear that leaving would cost you everything.\n\n🔔 Subscribe for more memoir chapters \u0026 exclusive content.\n📩 Join the newsletter: kristenhmcleod.substack.com\n\n#2x2s #CultSurvivor #ReligiousTrauma #EscapingACult #Memoir #Substack #Ex2x2 #HighControlReligion #BurnedBooks #ChooseYourOwnAdventure",
      "release": "2025-03-19T20:37:39Z",
      "duration": "00:03:32",
      "explicit": false,
      "spotifyId": "14bKWotIVkqhpFjFNeTMSL",
      "youTubeId": "IcZDl2RRsqw",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/14bKWotIVkqhpFjFNeTMSL",
        "youtube": "https://www.youtube.com/watch?v=IcZDl2RRsqw"
      }
    },
    {
      "id": "ed8f36e5-642e-4ec4-9e4c-220fcbadace8",
      "title": "03 Do we pull the camera back? Span both out, and in time?",
      "description": "Not all cults are dramatic. Some are just... there. Quietly shaping your life, one small rule at a time, until you look back and wonder who you might have been if you’d never heard of them.\n\n🎧 Listen \u0026 Read the Full Memoir Here → kristenhmcleod.substack.com\n\nThis is Chapter 3 of Cultivated — a memoir about growing up in the 2x2s, a faith so secretive it didn’t even have a name. No TV. No jewelry. No pants. Just an unshakable fear that leaving would cost you everything.\n\nBut what if I’d never been in it at all?\n\nWhat if my father had never met the 2x2s? What if we’d just been a normal family, in a normal house, going about our normal lives? Would I still be me? Would I still be a writer? Would I have been happier? Or would I have been a nightmare—corporate middle-management at a BBQ, delighting in rejecting vacation requests?\n\nIt’s comforting to imagine the worst-case scenario of our alternate selves, but what if the real truth is more complicated? What if I’d had the confidence to pursue my dreams without first clawing my way out of someone else’s expectations?\n\nThis is a story about paths not taken, the choices that shape us, and the small moments that turn into lives.\n\n🔔 Subscribe for more memoir chapters \u0026 exclusive content.\n\n#2x2 #ex2x2 #cultsurvivor #memoir",
      "release": "2025-03-19T20:19:23Z",
      "duration": "00:13:31",
      "explicit": false,
      "spotifyId": "2rjdIVzwSiDrUGRe9yjib9",
      "youTubeId": "OvekIawz2C8",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rjdIVzwSiDrUGRe9yjib9",
        "youtube": "https://www.youtube.com/watch?v=OvekIawz2C8"
      }
    },
    {
      "id": "0bcf65ff-5f66-4f90-a9f3-2f568a875664",
      "title": "01 What Am I Now",
      "description": "Some cults have celebrity members, designer robes, and dramatic escapes. Mine had sleeping in a barn, skirts, and a strict ban on The Smurfs. Welcome to my extremely unglamorous high-control religious experience.\n\n🎧 Listen \u0026 Read the Full Memoir Here →kristenhmcleod.substack.com\n\n#2x2 #cultsurvivor #memoir #substack",
      "release": "2025-03-19T19:56:42Z",
      "duration": "00:05:12",
      "explicit": false,
      "spotifyId": "4ord7REnnrFTZCKwRpxzUl",
      "youTubeId": "yJaqCknG-48",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ord7REnnrFTZCKwRpxzUl",
        "youtube": "https://www.youtube.com/watch?v=yJaqCknG-48"
      }
    },
    {
      "id": "cdbf286f-40eb-43fa-8926-3b9688cb748b",
      "title": "Cultivated Welcome \u002B How",
      "description": "This is the first episode of Cultivated, a memoir about growing up in the 2x2s— a secretive, nameless faith known for its strict rules and hidden past. No TV. No jewelry. No pants. Just rules, sermons, and the fear that leaving would cost you everything.\n\nEach chapter is a breadcrumb—a glimpse into a world where questioning was forbidden and freedom came at a cost.\n\n🔔 Subscribe for more memoir chapters \u0026 exclusive content.\n\n#ex2x2s \n#2x2 #cultsurvivor #memoir #substack",
      "release": "2025-03-19T19:20:11Z",
      "duration": "00:02:34",
      "explicit": false,
      "spotifyId": "3sc77EfGGCEjdENnl7cX7o",
      "youTubeId": "Q38xu6B1aXE",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sc77EfGGCEjdENnl7cX7o",
        "youtube": "https://www.youtube.com/watch?v=Q38xu6B1aXE"
      }
    },
    {
      "id": "6d7cfacc-8a81-4a7e-8b26-7f594c58fef1",
      "title": "Kristen McLeod Making Real",
      "description": "Spoken Word. Written and performed by Kristen H. McLeod @CreativeCityCentreSK",
      "release": "2024-09-04T16:09:28Z",
      "duration": "00:13:04",
      "explicit": false,
      "youTubeId": "YE8vdx_iRLo",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YE8vdx_iRLo"
      }
    },
    {
      "id": "eb254b37-63cb-4f58-a94d-04653463be08",
      "title": "ex2x2 An Author Note",
      "description": "At times, I used the Coles Notes version to explain why, for example, I lacked cultural knowledge around popular TV programs from the 80s and 90s. But on occasion, I was inclined to provide a more fulsome rendering to give context to my quirks. To hear more, visit kristenhmcleod.substack.com",
      "release": "2024-07-31T00:00:00",
      "duration": "00:16:17.2660000",
      "explicit": false,
      "spotifyId": "74omszLuuGweFOv2LwckYn",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74omszLuuGweFOv2LwckYn"
      }
    },
    {
      "id": "719c9b11-acc4-4e64-8be4-8a7d53c1ef98",
      "title": "2x2 Definitions \u002B Explications",
      "description": "Quick notes. * These are my own definitions and have absolutely not been blessed by anyone, nor did I run them by others who might want to weigh in. At the same time, I do not think myself the ultimate arbiter to define and explain. That said, this truth is mine—a slippery concept we’ll dissect later. * Two-by-Two rules and definitions shift by region. What follows are from western Canada in the 80s and 90s. 2x2s or more aptly, 2x2 Cult1. what you might know them by, and how members are referred to by outsiders. Not used or accepted by members. Variations incl. the church with no name, Cooneyites, The No-Name Church, and most often, The 2x2 Religion The Truth/The Way1. how 2x2 members refer to their group; The Truth, and sometimes The Way, but only as a necessary shorthand to describe it. Members do not sanction either as official names and, in fact, reject external naming, strongly asserting there is no name. Think of these as natural shorthand; evolved for the people who collectively and rigorously refuse to name their organized pseudo-Christian gatherings. Usage: “I’m so grateful to have found The Truth;” references both the group itself, and the overarching truth of its teachings. Note: when speaking of The Truth or The Way (actually, this applies to most words and concepts defined here), terms are infused with capital letters, but members do not accept these as proper names; these phrases cede to spoken language demands for symbols to reference things. The Friends1. members refer to each other as The Friends, a quick way of establishing in and out; defining membership in a religion who swears itself unorganized and benignly identifies as merely a group of like-minded people who come together for fellowship. i.e. Who, us? they say to anyone who asks. We simply gather to study scripture. No religion here, nothing official! More frequently, queries on name are deflected with questions . Friends are—like many 2x2 rules—defined against literally everyone else who fit neatly into the pejorative World, as used in cautionary tales regarding Worldly People. Aside: I’m getting a strong sense of why, exactly, I dislike extraneous capital letters. The World; Worldly 1. positioning words and quick definers; as in of The World, Worldly people, Worldly things, Worldly wants, ad nauseam. Basically, Worldly is Satan-informed, and there’s a strong dichotomy between Worldly and not. Usage: When I was in the 2x2s, I was not of The World, and I avoided Worldly things and Worldly people. Worldly includes everything not 2x2 informed, so pretty much every thing and every person.The Word1. the word of God. Spoken with reverence, funneled direct via his “still, small voice.” Workers1. what might be in other religious orgs called preachers or ministers; Workers go out two by two to share The Word; are “called to the work” (by, of course, that still, small voice of God). Essentially, workers self-select (I crossed out some mean stuff here). These men and women go out in sex-segregated pairs, remain single and homeless, and do God’s most important work of reminding everyone that “This is a narrow way, and if we swerve on this way, we could go into the ditch.” Most (all?) workers are high-school educated at best and are not trained in any way to be spiritual leaders. Imagine what power means as these uneducated, self-identified messengers hold court over entire communities, dictating who can do (or more often, not do) what, sanctioning (or more often, not sanctioning) events, and offering endless and terrible advice that is often sought, and also often, not sought. Worker Stanley Sharpe said it himself in 1985 or 1986 at Aylesbury Convention: He got part of it right. The 2x2 Origin Story 1. The Truth is a seamless continuation of the apostles sent by Jesus to preach in pairs. No origin story here! History-free. Doing what Jesus commanded the Apostles do back in the day. Yup! Amazeballs. The Truth is a direct lineage from the New Testament, with Workers setting out just like the disciples. Fascinating, how accepted this origin story was (and is) as fact. Overseers of established areas around the world assign Worker pairs to lead regions (hence the 2x2 moniker). These Head Workers then assign Worker pairs to cities and towns, moving them around based on things the faithful are not privy to know (and in the case of reported childhood sexual assaults, moving accused and even prosecuted and convicted pedophiles to other geographic locations.) Redundant, but the origin story is b******t. It feels silly to say it, but it’s important, I think, to be clear. It’s important because its acceptance stems in part from the abject refusal to discuss origins combined with the rigid control exerted by Workers—nearly complete control over topics and conversations. Subtle but rigidly deployed management of 2x2 members means most never engage in questions. Even when knowledge—about how and when the 2x2s originated, became widespread—believers mostly outright rejected facts presented by the brave few who had left the 2x2s and discovered and publicized its history. If you’ve ever asked a 2x2 a direct question about their faith, you’ll know what I mean. Digression and redirection, coupled with responding with another question are tactics to divert giving answers that in fact, members often don’t have. Members who eventually (unwillingly) accepted updated and correct 2x2 origins often engaged, as my Dad finally did, in serious mental gymnastics to cede to the possibility the original version was still somehow correct, and asserted any manmade involvement had been mitigated by the purity of The Truth since. It’s all a bit boring, but in a nutshell, the 2x2s derived in the late 1800s from some offshoot of some other new religion. Evidence and discussions on this abound online, if you’re interested. I’m not particularly anymore, but recommend Wikipedia or one of the many sites organized around unpacking the 2x2s. Workers renounce possessions and money and are instead provided for by 2x2 members. They live with the families assigned to supply this room and board (a troubling method in some of the poverty-stricken lands where they preach) and move frequently from one home to another, travelling with the one small suitcase of clothing and toiletries allotted to each, at the behest of the head worker for their region. The name for these head workers varies across the globe, but typically, is some variation on Overseer. At the various gatherings attended by The Friends, Workers preach what they state is the word of God. They ex-communicate, set rules—some spoken, most implied, but all crystal clear—hide criminal acts of other Workers and guard finances carefully as the ultimate leaders in this authoritarian, high control group. At the 1985 or ‘86 Regina Special Meeting, Sister Worker Mable Jacobs railed against the ever-present temptation to “go back into bondage, perhaps because of a loved one who is still in bondage.” I can’t be certain that message was directed to my family, but my mother’s refusal to join the 2x2s was a sore spot for the 2x2s and remained as such for the duration of my time with them, and likely long past me leaving. My mom’s choice to remain in the bondage of the Lutheran church—the one in which she’d been raised, the church where I’d been baptized and had attended my whole life alongside my grandma, cousins, and friends—meant, according to the Workers, that our home was Divided. A girl who had been born into The Truth explained the concept when I asked her if we could play. “My mother told me I’m not supposed to spend time with you,” she said matter-of-factly. “You’re from a divided home.” A parental or other family member’s refusal to attend meetings meant the members who did were at risk, and by extension, anyone who consorted with those family members assumed risk simply by associating with them. Mom’s short hair, her earrings and lipstick, the TV only she watched—all of it implied temptation, and most Professing (Professing? Oh snap! The definitions are endless! Up next!) families kept my family at a distance. Dad had made the right choice—the only choice, in fact—by seeking The Truth, and by committing himself and his three children to it. But without his wife by his side, we were not considered fully immersed in The Truth. It wasn’t until much later that I realized we would never have been fully accepted. Born and raised, or B\u0026R, was the only way to full acceptance. Professing 1. is a 2x2’s ongoing, public commitment, signifying membership that was never, ever called membership. To be referred to as Professing, one first had to profess. At a Sunday night Gospel Meeting or during the five-day summer Convention (the barn!), Workers test a meeting by announcing that if anyone has been called by God and wants to answer that call, to share their commitment by standing during the final verse of the next hymn. I admit being on tenterhooks when meetings were tested. Nothing exciting, or even remotely interesting, ever happened at any meeting, and I don’t think I’m lying to say most of us craned our necks to see who stood.Of course, longtime attendees had ideas as to who might stand (or who should), but I was amazed by this public demonstration of fidelity. Once this step had been taken, the person was now referred to as Professing, and I noticed the reverence with which the question was asked.“Is she professing,” followed by yes or no, was imbued with unambiguous tone, and it was obvious which was preferred. Professing didn’t much appeal to me (of course, I eventually succumbed). Professing people prayed seated and by turn, during the weekly Sunday Morning Gospel Meetings and Wednesday Night Bible Studies and enjoyed the option of standing to pray by turn in front of hundreds at Convention (the barn!).But Professing wasn’t only prayer. More importantly, Professing people were expected to Give Testimony. Giving, or Sharing, Testimony 1. standing up by turn, reading a Bible verse selected from the person’s private studies (or on Wednesday, from the assigned Bible reading), followed with explication of the person’s understanding of said verse and, crucially, the meaning they derived from it. This was all, of course, informed by the “still, small voice of God,” which was a regular occurrence, according to the Workers and Professing people’s Testimonies. These soliloquies ranged from the shortest possible statements delivered rapid-fire to inaudible mumbling to the most painfully long and rambling versions of convoluted thinking even I, a child, frequently identified as gibberish. Workers minister to members of The Truth, understandable as the congregations who attend meetings and conventions, who are known as those In the Way. In the Way/In the Truth1. another quick and dirty method of establishing if a person is one of The Friends or Of the World, the only two possible categories a person could be in. In the Way of Jesus, In the Way of righteousness, blah blah blah. There are more of these definitions and I’ll get to them, but it’s a bit tedious, no? Necessary, though, I imagine. The thing about redefining language? It bothered me then and still bothers me now. I’d far rather the engrams and anatens and enthetas of scientology because if you left, you could reasonably expect to never hear those words again. But truth? Friends? The world? I had to take them back, a thing that got easier with time, but is still work (work!) to do, and always small but constant reminders I am not in the way, that I’ve chosen bondage. It’s okay. I made that decision long ago. If the choice is hell or the 2x2s? I’ll take hell. And choose it every single day. Subscribing means you’ll get weekly posts. It also makes it easier for former 2x2s to find this (algorithms, apparently). But no pressure. Drop in, drop by. It’s nice to have you. To hear more, visit kristenhmcleod.substack.com",
      "release": "2024-07-25T00:00:00",
      "duration": "00:16:28.3160000",
      "explicit": false,
      "spotifyId": "77keN31UUrkyF9fGOA7v5G",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/77keN31UUrkyF9fGOA7v5G"
      }
    },
    {
      "id": "c1191d45-0879-40c5-b6df-8577680dc693",
      "title": "Kristen H McLeod: Holy Shit I Missed You, Old Friend",
      "description": "Spoken word-ish performance of a short piece I wrote summer 2020. Thanks to Creative City Centre.",
      "release": "2021-01-18T19:57:04Z",
      "duration": "00:05:33",
      "explicit": false,
      "youTubeId": "SDRhueZWSnM",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SDRhueZWSnM"
      }
    }
  ]
}