{
  "_ts": 0,
  "id": "6cea9710-bf15-4c09-960f-bde0502e2a21",
  "name": "Cult \u0026 Sect Documentaries",
  "youTubeChannelId": "UClkXc1-Rku52l7nPam3LQiQ",
  "episodes": [
    {
      "id": "3f049b33-3f2e-4241-9a25-306b72b60f0e",
      "title": "The Source Family: Sunset Strip Cult Leader Goes From Bank Robber To Hippy God (4K Documentary Film)",
      "description": "The Source Family was a radical experiment in \u002770s utopian living. Their outlandish style, popular health food restaurant, rock band, and beautiful women made them the darlings of Hollywood’s Sunset Strip; but their outsider ideals and the unconventional behavior of their spiritual leader, Father Yod, caused controversy with local authorities. They fled to Hawaii, leading to their dramatic demise.\n\nYears later, former family members surface and the rock band reforms, revealing how their time with Father Yod shaped their lives in the most unexpected ways.\n\nThis award-winning film provides an intimate, insiders’ view at this incredible group of people through their own archival photos, home movies, audio recordings, and contemporary interviews with members of the family. Serving as a highly personal, insider’s guide to the counter-culture movement of the early 70’s, the film is inspired by the cult-classic book The Source: The Story of Father Yod, Ya Ho Wa 13, and The Source Family (Process Media) which was written by Isis Aquarian and Electricity Aquarian and edited by director Jodi Wille.",
      "release": "2022-03-29T15:00:04Z",
      "duration": "01:35:31",
      "explicit": true,
      "youTubeId": "9nIpHWOk9mI",
      "subjects": [
        "The Source Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9nIpHWOk9mI"
      }
    },
    {
      "id": "58bb885e-fc19-4bce-ab10-dbc8f3b8da9d",
      "title": "I Was In A Cult For 10 Years: Here\u0027s How I Escaped (Cult Witness Full Length Documentary Film",
      "description": "At the age of 19 Samuel Stefan, consumed by crisis, was drawn into a cult. It would be 10 years before he was able to escape.\n\nUsing a technique called ‘love-bombing’ cults prey on the vulnerable, recruiting new members with love and warmth. After a period of brain-washing, members are forbidden to leave, enslaved through psychological control, and in Samuel’s case, even violence. He was finally able to escape in the dead of night, persued by other members and seek help.\n\nCult Witness is an intelligent exploration of how cults attract and manipulate their followers, sharing the disturbing firsthand experiences of Cult Witness director Samuel Stefan and six others who have freed themselves from cults: Jill Mytton (The Exclusive Brethren), Jim Bergin and Judy Garvey (The Gentle Wind Project), Lea Saskia Laasner (The Janus Project), and Celeste Jones and Amoreena Winkler (The Children of God).\n\nAnalytical insights into the cult experience are provided by leadership expert Betty Sue Flowers; Benjamin Zablocki, chair of the Department of Sociology at Rutgers University; UCLA Professor Emeritus Bertram Raven, an expert on interpersonal influence and social power relationships; psychotherapist Miguel Perlado, who specializes in cult-related problems; and Urs Eschmann, a specialist in legal issues involving cults.\n\nCult Witness unravels the hidden world of cults; the hold they have on their victims, the reasons people form and fall prey to them and what takes place within..",
      "release": "2022-03-25T16:00:25Z",
      "duration": "00:56:24",
      "explicit": false,
      "youTubeId": "uit5KM9ZLeY",
      "subjects": [
        "Children Of God",
        "Plymouth Brethren Christian Church",
        "Gentle Wind Project",
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uit5KM9ZLeY"
      }
    },
    {
      "id": "9e3d3661-50be-48b2-aea1-de10ad4733c9",
      "title": "Alan John Miller: The Man Who Claims To Be Jesus Reincarnated (For The Love Of God Cult Documentary)",
      "description": "\u0027I Am Jesus - deal with it\u0027. Meet the man who believes he has spent 2000 years as Jesus Christ. Alan Miller has been called a fantasist and a dangerous cult leader. He teaches his version of Christianity to thousands online and his followers worship him, funding his existence, along with his partner - \u0027Mary Magdalene.\u0027 See how Alan remembers his identity - his life, death \u0026 re-birth.\n\nFor the Love of God is a unique and compelling documentary examining the world of a man who believes he has had a 2000 year existence as Jesus Christ.\n\nFeatured on Sky News, ITV’s This Morning, and the BBC, former IT worker Alan John Miller has been heralded by the media as a fantasist, and even a dangerous cult leader.\n\nHowever, his teachings are global, reaching tens of thousands across the internet, and his followers worship him worldwide, funding his preaching and tours.\n\nWho are the people behind The Divine Truth movement and why do they flock to a self-proclaimed Australian Jesus? Find out as we delve deep into For the Love of God.\n\nDirected By Thomas Leader",
      "release": "2022-03-22T16:00:30Z",
      "duration": "00:57:59",
      "explicit": false,
      "youTubeId": "cqvfmHbEP30",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cqvfmHbEP30"
      }
    },
    {
      "id": "471e6a20-77f6-4282-8175-2f7944f3fd76",
      "title": "Jim Jones: 5 Days That Led To The Jonestown Mass Suicide (Peoples Temple Paradise Lost Full Movie)",
      "description": "Jonestown: Paradise Lost is a 2007 documentary television film on the History Channel about the final days of Jonestown, the Peoples Temple, and Jim Jones. From eyewitness and survivor accounts, the program recreates the last week before the mass murder-suicide on November 18, 1978.\n\nInterspersed with interviews from survivors, dramatic recreations of the events show how Reverend Jim Jones becomes increasingly paranoid and erratic as pressures build on him, both inside the compound and from the United States. When Congressman Leo Ryan insists on visiting, Jones alternates between reluctant acceptance and refusal. Ultimately, Jones allows Ryan, several journalists, and the Concerned Relatives representatives to visit the compound. Jones coaches the Peoples Temple members on what to say, but is surprised by a series of defections.",
      "release": "2022-03-22T16:00:08Z",
      "duration": "01:39:37",
      "explicit": true,
      "youTubeId": "JN6M1eW7BgM",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JN6M1eW7BgM"
      }
    },
    {
      "id": "65e1d80f-e51b-435f-8cb1-f3a73eddc482",
      "title": "Manson Film: Silenced Cult Member Reveals All On Sharon Tate Murder (Full Length Drama Documentary)",
      "description": "This stunning documentary reconstructs Manson \u0027Family\u0027 member Linda Kasabian and her story to what when on at Spahn\u0027s Movie Ranch and the final days leading up to the grisly 1969 Tate/La Bianca murders. New evidence comes to light in what is a 5-star, full length feature film.\n\nDirected By Neil Rawes\nWith Ryan Blakely\nJames Gilbert\nRoger Doche\nTamara Hope\nAnthony Kenneth Wilson\nSascha Cole\nMeredith Cheesebrough\n\nInterviewees\nLinda Kasabian\nVincent Bugliosi\nCatherine Share\nDebra Tate",
      "release": "2022-03-22T16:00:08Z",
      "duration": "01:26:54",
      "explicit": false,
      "youTubeId": "EiNqlpewqUg",
      "subjects": [
        "Charles Manson"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EiNqlpewqUg"
      }
    }
  ]
}