{
  "_ts": 0,
  "id": "33c949ca-63d6-4bea-952e-4f98b5443d1e",
  "name": "Cults and the Culting of America",
  "spotifyId": "7lL8zWAk6UXZk8l7hf0Z6n",
  "appleId": 1756133150,
  "youTubeChannelId": "UCuFRBZ2w3QsYs7Km69keHsg",
  "youTubePlaylistId": "PLEM2mhO5Zn0kaJUhb-ndgpx0LwmiygAI0",
  "episodes": [
    {
      "id": "acd4951a-7a08-48df-886b-d2b5fe6ca8db",
      "title": "Episode Three: The Skinny White Woman",
      "description": "    Daniella Mestyanek Young\u0027s book:\n  ·       From Bookshop.org\n    Uncultured  Autograph:     Connect with Daniella on social media\n     TikTok,  Patreon,  Instagram    Youtube    Connect with Scot Loyd\u0027s social media  (TikTok)   Daniella\u0027s other podcast:  Hey White Women   \n  Episode Summary: Cults and the Culting of America - Episode on The Skinny White Woman in Cults **Episode Title:** The Skinny White Woman in Cults\n **Hosts:**\n - **Daniella Mestyanek Young** (Group Behavior Gal) - Scholar of cults, extreme groups, and extremely bad leadership.\n - **Scot Loyd** - Co-host and commentator.\n **Introduction:**\n In this episode, Daniella and Scot dive into the concept of the \u0022skinny white woman\u0022 in cults and high-control groups, exploring her role in supporting and legitimizing cult leaders and their coercive control tactics.\n **Key Topics:**\n 1. **The Skinny White Woman in Cults:**\n    - Daniella introduces the concept, highlighting examples like Allison Mack in NXIVM and Ghislaine Maxwell with Jeffrey Epstein.\n    - The pattern of skinny white women supporting cult leaders and their role in upholding white supremacy.\n 2. **Historical and Cultural Context:**\n    - The history of white supremacy and its influence on the perception of purity and ideal womanhood in America.\n    - The policing of women\u0027s bodies, especially through clothing, makeup, and hairstyles, within cults and broader society.\n 3. **Daniella’s Personal Experience:**\n    - Daniella shares her observations from the Children of God cult and the US Army, noting the emphasis on appearance and control.\n    - Her realization of the role she played in upholding certain standards and her decision to rebel against these norms.\n 4. **The Role of Charismatic Authority:**\n    - Discussion on how cult leaders often place skinny white women, military officers, or celebrities around them to gain legitimacy and distract from their actions.\n    - The enforcement of patriarchal norms by these figures within the group.\n 5. **Scot’s Perspective from the United Pentecostal Church:**\n    - Scot reflects on his experiences with the church\u0027s emphasis on the ideal woman and the spiritual power attributed to women who fit this mold.\n    - The impact of purity culture on both men and women in religious settings.\n 6. **Control and Manipulation Tactics:**\n    - How cults use control of appearance and emotional manipulation to maintain power over members.\n    - The concept of emotional evocation and its role in cult dynamics.\n 7. **Breaking Free from Cult Influences:**\n    - Strategies for deconstructing cult programming, such as rejecting purity standards and embracing individuality.\n    - Daniella’s journey of using her platform to educate and advocate against these harmful norms.\n **Conclusion:**\n The episode concludes with a call to action for listeners to educate themselves, support anti-racist and feminist causes, and use their voices to challenge oppressive systems.\n **Call to Action:**\n - Follow Daniella on social media and support her on Patreon for exclusive content.\n - Purchase Daniella’s book \u0022Uncultured\u0022 to learn more about her experiences and insights into cults and high-control groups.\n - Like, subscribe, and share the podcast to help spread awareness and gain a broader audience.\n **Closing Remarks:**\n Scot thanks Daniella for her insights and contributions to the discussion, encouraging listeners to continue questioning and deconstructing harmful societal norms.\n ---\n ### Cleaned-Up Transcript\n **Daniella (Group Behavior Gal) (00:02.754):**  \n This is the Cults and the Culting of America podcast with scholar of cults, extreme groups, and extremely bad leadership, Daniella Mestyanek Young. I\u0027m your host, Scot.\n **Daniella (Group Behavior Gal) (00:26.062):**  \n And the Culting of America podcast. My name is Scot Loyd along with my friend, Daniella Mestyanek Young. Daniella, how are you today?\n **Scot Loyd:**  \n I\u0027m doing",
      "release": "2024-07-23T16:35:00Z",
      "duration": "00:58:36.9430000",
      "explicit": false,
      "spotifyId": "26oO5zLdfinrwHhpMu63nv",
      "appleId": 1000663119671,
      "youTubeId": "UvEER9UFRbQ",
      "subjects": [
        "Children Of God",
        "NXIVM",
        "Evangelicalism",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/26oO5zLdfinrwHhpMu63nv",
        "apple": "https://podcasts.apple.com/podcast/episode-three-the-skinny-white-woman/id1756133150?i=1000663119671",
        "youtube": "https://www.youtube.com/watch?v=UvEER9UFRbQ"
      }
    },
    {
      "id": "aa5a84ca-99f2-48ba-9a6d-347c778e0b91",
      "title": "Episode Two: From Charisma to Control: Understanding Cult Leaders",
      "description": "In this episode of \u0022Cults and the Culting of America,\u0022 hosts Scot Loyd and Daniella Mestyanek Young delve into the concept of charismatic leadership within cults. They begin by discussing how the idea of a charismatic leader is often associated with cults, highlighting that many of these leaders are typically perceived as white males. Daniella explains that while cults have been largely defined by white western academics, the underlying structure of patriarchy predates even white supremacy and capitalism, making it a fundamental aspect of coercive control in cults. The conversation touches on notable examples of charismatic leaders, including Keith Raniere, David Berg, and Jim Jones, as well as Elizabeth Holmes and Adam Neumann. Daniella emphasizes that charismatic authority is not just about charm but involves qualities that make people grant these leaders extraordinary influence. She discusses how these leaders often transition from being charismatic figures to being deified by their followers, creating a system where their personal mythology becomes integral to the group\u0027s identity. Scot and Daniella explore the psychological and social mechanisms that make individuals susceptible to charismatic leaders. They discuss the concept of \u0022front-of-the-room advantage,\u0022 where the mere act of being in a position of authority can make a person seem more credible and likable. They also highlight the role of rhetoric and persuasive communication in enhancing a leader\u0027s influence, noting how leaders use techniques like \u0022trance talk\u0022 to captivate and manipulate their audience. The episode concludes with a discussion on the importance of critical thinking and diverse social connections in protecting oneself from falling prey to cult-like influence. Daniella shares her \u0022guru gotcha\u0022 checklist, a tool she developed to help identify potential red flags in leaders and groups. Both hosts stress the need for self-awareness and skepticism, encouraging listeners to examine the charismatic leaders in their lives critically. They also preview upcoming episodes, including an exploration of the role of the \u0022skinny white woman\u0022 in cult dynamics and the broader impact of group psychology on individual behavior. **Keywords**: cult, cult leader, people, charismatic leader, leader, purity, call, Daniella, woman, rhetoric, groups, skinny, idea, charisma, religion, white, followers, book, white male, life Transcript: **Speaker 1**: This is Cults and the Culting of America, a podcast with scholar of cults, extreme groups, and extremely bad leadership, Daniella Mestyanek Young. **Scot Loyd**: Welcome to Cults and the Culting of America podcast. I\u0027m Scot Loyd, along with my friend Daniella Mestyanek Young. Daniella, how are you today? **Daniella**: Doing good! I\u0027m excited to talk about charismatic leadership because everybody gets confused by this one. **Scot**: Did I get \u0022Mestyanek\u0022 right this time? **Daniella**: Yes, you did. Very good. **Scot**: You were telling me during your time in the army that there were some gentlemen who were actually afraid to mispronounce it. **Daniella**: Yeah, I always joke that people thought I was so scary because, in the army, that\u0027s how you have to present yourself if you\u0027re a woman. People were so scared of me that everyone just learned how to pronounce Mestyanek. It wasn\u0027t until my very last unit that people started calling me Captain M, which would be more normal in the US military when you have a complicated name. **Scot**: Nice. My name is Scot Loyd, a little less complicated—one T and one L. I like to joke that my family couldn\u0027t afford the extra consonants. But here we are today, and I\u0027m thrilled that all of you are along for the ride. Last time we were together, Daniella, we unpacked a little bit about your 10 characteristics of a cult. The first one on that list is something that, if you asked people what they associate with a cult or a cult group, they would come up with: the charismatic leader. So, what do we need to understand about the charismatic leader\u0027s role in a cult? And am I wrong to assume that most of these charismatic leaders are white males? **Daniella**: First of all, the acknowledgment that cults have been largely defined by white academics, white western academics. When we actually start looking at what we\u0027re really talking about—when individuals come under the coercive control of a group—those leaders can look like a lot of things. But the OG cult system, even before white supremacy and capitalism, is patriarchy. Coercive control, the way we see it in our world, is tacked right along patriarchy. We\u0027ll talk about this in next week\u0027s episode on the \u0022skinny white woman\u0022 who\u0027s in parentheses next to the cult leader in white-led American cults. When women are the cult leaders, as happened in my cult, Children of God, they still have to fight patriarchy, so they have to fight harder, and society celebrates more when they go down. In my charismatic leader chapter in my forthcoming book, *The Culting of America*, we are looking at your typical white male cult leaders you think of—Keith Raniere, David Berg of Children of God, Jim Jones of Jonestown. We\u0027re also looking at Elizabeth Holmes of Theranos, David Petraeus of the military, and Adam Neumann of WeWork. Elizabeth Holmes is an example of someone who still had to fight harder to build her cult and maintain control than a man would have. She had to have a man next to her giving her validity, and society really celebrates much harder when she goes down and demands justice in ways they don\u0027t for men like Adam Neumann, who walked away with billions of dollars while she walked away with a jail sentence. **Scot**: And that\u0027s interesting when we talk about the idea of charisma, especially in the context of the United States. For a large part of my career, I served as a communications professor. One of the subjects I taught every semester was group dynamics and leadership, where we looked at how a group develops. What do we look at when we define the term leadership? In a cult or cultish-like group, these characteristics become magnified and are leveraged to manipulate others for harm. How do we define charisma? For a long time in the United States, if you were taller than everyone else, that was defined as charisma. Think of Abraham Lincoln, right? **Daniella**: The first problem is there are two things that charisma means, and we only think of one of them. We almost always think charisma equals charming, and also tall. It is true that more CEOs are tall. Taylor Swift is very tall. People always tell me I have tall energy when they realize I\u0027m only five-five. I think it\u0027s this larger-than-life thing. But the reality is, when we are saying charismatic leader, we\u0027re talking about charismatic authority. Max Weber defined this concept. He secularized something he saw from religion: we give people authority over us due to some qualities, some extra-human, extraordinary qualities they have. He defines two types of authority: power and violence authority, and charismatic authority. In any situation where you are given power because of qualities about you, that job, that degree, you are in a position of charismatic authority. It\u0027s not just charm. Cult leaders often are not charming. A lot of times, they\u0027re bumbling idiots, but they\u0027re good at traits we associate with charm and charisma in our minds. For example, something called trance talk—saying a bunch of interesting-sounding, smart-sounding things, jumping from topic to topic. In *The Vow*, you see Keith Raniere doing this. People don\u0027t catch on. By the way, ask me what my secret was when I didn\u0027t know how to answer essay questions in college. My secret was to write three more paragraphs. The professor will forget you didn\u0027t actually answer the question. That\u0027s what cult leaders do. They eventually start turning themselves from charismatic leaders into gods. That\u0027s when we see people emulating their qualities, celebrating their birthdays like a holiday. **Scot**: And it\u0027s a very predictable road to deification as well. I\u0027m laughing because that was common for me growing up in the United Pentecostal Church. The leader of the church, our pastor, who was exclusively a white male, was always venerated. His birthday was celebrated, any special days for the pastoral family. Evangelicals even have Pastor Appreciation Month in October. If you were a good parishioner, you were supposed to laud all these accolades, gifts, money, and vacations on your leader. **Daniella**: We also see the mythologizing of the leader\u0027s origin story or the group\u0027s origin story. For example, I have two college degrees, and at no point did I know who the president of the university was until I had to meet him because I was the valedictorian. Why do you need to know who the leader of Bob Jones University is? When you start seeing pictures of the leader everywhere—US military looking right at you—that\u0027s part of deification and the weapon of likability and familiarity. We are friendlier towards people we are familiar with. When you walk in every morning and see your commander\u0027s face on the wall, they become more charismatic to you, and you are more likely to feel warmly toward them when you actually see them. It\u0027s why we think it\u0027s appropriate to walk up to an actress or actor in real life and introduce ourselves. We feel like we know them and love them because of that familiarity. These patterns are not original. Dr. Janja Lalich says they all went to the same Messiah school. **Scot**: You bring up exceptionalism. Not only does the leader think they are exceptional, but cult leaders play with terms like destiny and fate. Destiny has a wonderful connotation; everyone wants to embrace their destiny and avoid their fate. Cult leaders create a negative fate like hell or some version of hell—poverty, unpopularity, loneliness. They create their version of heaven and say, \u0022Follow me, and you\u0027ll fulfill your destiny and avoid this fate.\u0022 **Daniella**: Yes, and with the destiny thing, they always blame individuals for systemic problems. If anything good happens, it\u0027s the cult or the leader. If anything bad happens, it\u0027s you. This trains you to think this way. I realized that cult leaders often promise something in another life, world, plane, body, or state. You can\u0027t reach enlightenment because it\u0027s a con. The cult leader knows it\u0027s a con. It\u0027s significant that Jim Jones didn\u0027t drink the Kool-Aid; he died from a bullet to the head. Cult leaders get caught up in their own hullabaloo, but their followers believe in the ends justifying the means. The cult leader knows the whole time. When we look back at all those cult leaders, we can see that since childhood, they are manipulating, building their worldview, and trying to build something with a following. **Scot**: Cult leaders exploit the need within all of us to think of ourselves as exceptional, to think our lives have meaning and purpose. The loudest and most bold among us are often the most insecure. Human nature makes us follow loud, bold people, especially if they promise purpose and meaning. They also have the stick of punishment—eternal damnation, poverty, loneliness. Follow them, and you\u0027ll avoid this fate. **Daniella**: Right, I call it the front-of-the-room advantage. When you\u0027re in an audience and hear someone introduced as the speaker, you think they\u0027re impressive. I teach veterans in my networking classes to put themselves in front of the mic as often as they can. People will believe someone put them there. If nobody else is questioning around you, that\u0027s social proof. Cult leaders rely on this heavily. They\u0027ll flabbergast you and keep going. If nobody else is saying anything, you think it must be okay. When we started studying cults, we believed humans were much more rational than they are. \u0022I think, therefore I am,\u0022 like René Descartes really screws us over a bit. Humans are not rational; we hardly ever make decisions based on logic. We make most of our decisions based on recency bias and social proof. What worked for us most recently or what everyone else around us is doing. These evolutionary drives keep you alive. This comes into play with the charismatic leader. Some bigger cults have been through a thing called routinization. Mormons and Jehovah’s Witnesses will say, \u0022We\u0027re not a cult; no charismatic leader.\u0022 If you have to use a loophole to get out of the definition of a cult, we have an answer now, and it\u0027s called charisma by proxy. We now know large groups of people can go down illogical paths without calling each other out on it. **Scot**: There\u0027s a good resource that unpacks that further—*The Righteous Mind: Why Good People Disagree About Religion and Politics* by Jonathan Haidt, a moral psychologist. One of the best books I’ve read on this. In public speaking, I tell my students, \u0022With great power comes great responsibility.\u0022 Public speaking is the number one fear in America. Seinfeld joked people would rather be in the box at a funeral than give the eulogy. But if you manage that apprehension, you set yourself apart. For our listeners, to make students less susceptible to cults, get them involved in debate. It’s a great activity. You can\u0027t rely solely on charismatic skills; logic is involved. It takes you out of the binary world and helps you see all possibilities. High control groups want you locked into binary thinking—\u0022my way or hell.\u0022 **Daniella**: The first thing anyone will say if you call a group they love a cult is, \u0022Not a cult, free to leave anytime.\u0022 That line is both loaded language and a thought-stopping cliché. It\u0027s not true. Cults have high entrance and exit costs—not always money. It\u0027s anything you lose if you\u0027re not in the group. In both the cult and the military I grew up in, leaders would say, \u0022This is not a democracy.\u0022 You are reminded everything you have can be gone if you disagree. People say, \u0022Oh, you\u0027re free to leave anytime.\u0022 I say, \u0022Do you love everything about your job? No? Why don\u0027t you just leave?\u0022 **Scot**: Exactly. When we talk about charisma and the charismatic leader, I thought about good questions to ask if evaluating whether a leader is a cult leader. These are good questions for any leader. One is, what platform of privilege are they speaking from that gives them this advantage? In our society, patriarchy and white supremacy give white males a place of status. The system was produced by people like me, a white male, for my benefit. It\u0027s important to acknowledge that. If your leader isn’t doing that, maybe that’s a problem. **Daniella**: Social media has been good for cult leaders. It helps people get into and out of cults. I say that in the 60s and 70s, when my grandfather joined the Children of God, if you wanted to isolate an American citizen, you had to take them away to your compound in Texas or Brazil because we all watched the same TV shows, listened to the same news. Even if you were on polar opposite sides of an issue, you shared this reality. These days, isolation can just be in your bedroom on a computer, and you can totally be in a cult. It has shifted things. I built a \u0022guru gotcha\u0022 checklist to keep myself in check. Anybody who knows a lot about cult leaders and bad guys is dangerous. People say, \u0022Should we be scared of you?\u0022 Yes, if I invite you to my compound, maybe say no. I fought the social media thing because I don\u0027t like the concept of influencers. I make sure 50% of my content comes from others. I want people to see that. Here\u0027s the \u0022guru gotcha\u0022 checklist: 1. Heavy focus on your own uniqueness. 2. Intense come-here-go-away behavior to keep you off balance. 3. Always asking you to prove your loyalty. 4. Lack of intellectual humility or willingness to learn from others. 5. Constantly blurring the edges of their expertise. 6. Trance talk. 7. Asking followers to pay for their essence, presence, or energy. 8. Handing out life advice they are not qualified to give. 9. Some form of purity from their followers. 10. Intense appearance and attitude control of followers. 11. Talking poorly about other leaders in their industry. 12. Blaming systemic failures on individual action. 13. Blurred sexual boundaries or using young women or men to entice followers. 14. Requesting followers to leave their jobs and follow them. 15. Threatens you when you leave or speak poorly of them. **Scot**: That’s a lot to talk about. Let\u0027s return to purity and power. Growing up in the United Pentecostal Church, purity and power were hallmarks. Policing behavior, dress, and hairstyles of women were emphasized. It was steeped in white supremacy. The skinny white woman was the ideal image. Purity was about maintaining the look of the 1930s and 1940s—no jewelry, no makeup, no cutting hair. This was preached as giving power and authority with angels and God. **Daniella**: Purity requirements are in every situation of coercive control. They’re not just sexual purity but any black-and-white rule. I explain it like this: I don\u0027t eat wheat because I\u0027m allergic to it, so it\u0027s a black-and-white rule but not a purity requirement. Groups that don\u0027t eat gluten for health are under purity. Purity requirements are crucial because they make people police each other and themselves. They are impossible because humans are bad at being perfect and pure. Cult leaders themselves never follow purity requirements. They are for everyone else. They turn you into your own jailer. Purity requirements are usually time-consuming and keep you busy. Skinny is a powerful purity requirement in our society. It’s a visual presentation of sacrifice. **Scot**: Speaking of purity culture, in the United Pentecostal Church, there was a big emphasis on women\u0027s behavior and bodies. There wasn’t that emphasis for men. You shared part of your story in *Uncultured*—a sex cult. How did the leaders reconcile purity culture? **Daniella**: In the Children of God, the purity requirement was you couldn’t say no. You were not trusting God if you said no. You were letting your individuality and desires interfere. There was a comic called \u0022The Girl Who Wouldn’t\u0022 training us from a young age. Outside the cult, I didn’t know how to say no. Purity requirements in the Children of God involved no underwear while sleeping, women not wearing bras. Skinny is one of the most powerful purity requirements. Cult leaders want to keep you isolated, tired, busy, skinny, pregnant, and hungry. Sometimes it’s the opposite of skinny. Scientology forced abortions. Heaven’s Gate had no sex, no children. It’s about controlling sex, not purity. Any organization telling consenting adults who they can and can’t sleep with is controlling. **Scot**: I appreciate you sharing that. Let’s return to the idea of rhetoric. Charismatic leaders harness rhetoric\u0027s power. Hitler is a classic example, although his style of speaking seems like just yelling. Symbolic Convergence Theory by Ernest Bormann from the University of Minnesota theorizes that people develop and move forward around ideas communicated effectively by leaders. These rhetorical visions organize and control civilization. How is a rhetorical vision cast in cults, and how do we insulate ourselves from falling prey? **Daniella**: I love *Sapiens* by Yuval Noah Harari. Religions, corporations, organizations—all these groups are stories we tell ourselves. Religions are stories societies craft to explain things. Cults are not religions; they are cons from day one. Elizabeth Holmes knew she wasn’t transforming blood testing. Cults are about the leader’s control. Religions aim for society to work; cults don’t. Religions are not comparable to cults. Religions are useful to cult leaders because they require faith, which can be manipulated. **Scot**: Manipulation vs. motivation is a key difference. Motivation is mutually beneficial; manipulation benefits only the leader. Consensual sales involve providing actual products that help people. Manipulations involve false promises. Understanding this helps identify manipulation. **Daniella**: Anyone who knows about cult leaders can become one. Wake up every day and choose to use your rhetorical skills for good, not to manipulate. Jim Jones could have been remembered as an early civil rights leader if he died in the 1950s. Instead, he chose to use his skills for evil. Charismatic leaders must choose daily to use their influence for good. **Scot**: Engaging in competitive debate helps build critical thinking. It challenges prevailing assumptions and teaches you to look at other positions. If you’re in a space where everyone agrees with you, you’re susceptible to harm. Ideas must be challenged to avoid trauma. **Daniella**: Social connections are crucial. Make sure your children have diverse social connections that don’t overlap. High exit costs make leaving hard. Cancel culture isn’t real; it’s consequence culture. Diversifying connections helps navigate challenges. Understanding your own biases and staying agnostic about being the good guy is crucial. Cults thrive on binary thinking. **Scot**: In our concluding episodes, we’ll talk about the importance of groups and community. Next episode, we\u0027ll explore the role of the \u0022skinny white woman\u0022 next to the charismatic leader. **Daniella**: Thanks for listening with open minds. Think about the charismatic leaders in your life. It’s not about labeling but learning to navigate groups and systems. Find us on social media. We’ll be doing this podcast every week. **Scot**: Thank you. Like, subscribe, and share the podcast to help us reach more people. For Daniella Mestyanek Young, I’m Scot Loyd. See you on the next episode of Cults and the Culting of America. **Outro**: Thank you for joining us for this episode of Cults and the Culting of America. Follow Daniella on social media and subscribe to her Patreon for exclusive content. Pick up her book *Uncultured*. Until next time, I’m Scot Loyd for Daniella Mestyanek Young.",
      "release": "2024-07-16T15:52:00Z",
      "duration": "01:02:11.0430000",
      "explicit": false,
      "spotifyId": "7Hk6YowrFQTOK45hvRlw0c",
      "appleId": 1000662427862,
      "youTubeId": "kYd5tCAVQEI",
      "subjects": [
        "Children Of God",
        "NXIVM",
        "Peoples Temple",
        "Evangelicalism",
        "Cult Psychology",
        "Jehovah\u0027s Witnesses",
        "Scientology",
        "Cult-Expert",
        "Bob Jones University",
        "Heaven\u0027s Gate",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Hk6YowrFQTOK45hvRlw0c",
        "apple": "https://podcasts.apple.com/podcast/episode-two-from-charisma-to-control-understanding/id1756133150?i=1000662427862",
        "youtube": "https://www.youtube.com/watch?v=kYd5tCAVQEI"
      }
    },
    {
      "id": "53f799e8-ec81-4a6a-9342-331e785cac47",
      "title": "What Sex Cults and War Have in Common",
      "description": "About: Welcome to \u0022Cults and the Culting of America,\u0022 where we delve into the fascinating and often disturbing world of cults, extreme groups, and toxic leadership. I’m your host, Scott Lloyd, and today I\u0027m thrilled to be joined by Daniella Mestyanek Young, a renowned scholar and author of the gripping memoir \u0022Uncultured.\u0022 Daniella\u0027s journey from being born into the notorious Children of God cult to serving in the United States Army offers a unique perspective on the parallels between these vastly different yet similarly controlling environments. Join us as we explore her extraordinary story and the insights she’s gained Connect with Scot at: https://www.tiktok.com/@thescotloyd Connect with Daniella at: My Patreon: https://www.patreon.com/GroupBehaviorGal TikTok: @daniellamestyanekyoung Instagram: @_daniellamyoung https://www.uncultureyourself.com/ Youtube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg UnAMERICAN Videobook Get the book: UNCULTURED: A Memoir \u0022A propulsive memoir delivered in the honest tones of a woman who didn\u0027t always think she\u0027d live to tell her story.\u0022 --NYT See a Sample Chapter in Rolling Stone Magazine See a Sample Chapter in The Sydney Herald Words in: Newsweek \u0026 Narratively Get a copy of UNCULTURED: Digital , Audio , or Hardcopy or preorder the paperback as a holiday gift for a friend. Get an Autographed copy here: https://uncultureyourself.com/pages/uncultured-autographed Shownotes: Welcome to \u0022Cults and the Culting of America,\u0022 the podcast where we delve into the world of cults, extreme groups, and toxic leadership. I\u0027m your host, Scott Lloyd, and I\u0027m thrilled to be here with Daniella Mestyanek Young, a scholar in this field and author of the compelling memoir, \u0022Uncultured.\u0022 Daniella, how are you today? Daniella: I\u0027m doing great, Scott! Thanks for having me. Scott: Fantastic! I\u0027m excited to kick off this podcast with you. I must say, your book \u0022Uncultured\u0022 has been an incredible resource for me. Growing up in a small Pentecostal cult, known as the United Pentecostal Church, your experiences really resonated with me. Throughout our podcast, I\u0027ll share some of my own stories, but your journey from the Children of God cult to the United States Army is extraordinary. Your book provides such a detailed account, and I highly recommend everyone read it. For those who prefer audio, it\u0027s available and even made it to the New York Times bestseller list. Daniella: Thank you so much, Scott. I\u0027m glad to hear the book has had such an impact. Scott: For our listeners who might not be familiar with your story, could you share a bit about your experiences? We’re titling this episode \u0022Patriot Pains: I Joined the Army and All I Got Was This Lousy Trauma,\u0022 and I’m particularly interested in how you compare your time in the Children of God cult with your service in the Army. Daniella: Absolutely. First, I want to clarify that while the media often labels the Children of God as a \u0022sex cult,\u0022 it\u0027s important to understand that cults, in general, share common patterns of behavior and control, regardless of their specific doctrines. That said, the Children of God did have a significant focus on sexual doctrines, which were central to their beliefs. I was born into the Children of God, three generations deep. My family was deeply embedded in its leadership—my grandmother donated the first house to the leader, David Berg, and my grandfather still manages the cult\u0027s finances. My father also played a significant role in handling the money. This is all detailed in my book, \u0022Uncultured.\u0022 The Children of God started in 1968 in California, like many cults of that era. David Berg took evangelical control of sex, mixed it with elements of Mormonism, and called it \u0022free love,\u0022 which I describe as forced polyamory. The cult rebranded itself over the years—from being labeled a \u0022harem photo sex cult\u0022 on the cover of Time Magazine in the 80s to performing at the White House in the 90s. Scott: Wow, that’s a remarkable transformation. Daniella: Yes, it is. But despite the rebranding, the core practices and control mechanisms remained the same. I was eventually kicked out at 15, and as you’ll see throughout this podcast, I was never someone who would conform to that environment. Scott: Your transition from the Children of God to the Army is fascinating. How did you end up comparing the two environments? Daniella: There are surprising similarities between extreme groups, whether it\u0027s a cult or a highly structured organization like the Army. Both environments use intense control and indoctrination techniques, which can be quite traumatic. My story is about navigating these systems and finding my own path. Scott: This is going to be an enlightening conversation. Thank you for sharing, Daniella. Let\u0027s dive into more of your experiences and insights.",
      "release": "2024-07-09T15:22:00Z",
      "duration": "01:05:41.2500000",
      "explicit": false,
      "spotifyId": "5Fk9SXrqQNJUCZ02GDRfFM",
      "appleId": 1000661675018,
      "subjects": [
        "Children Of God",
        "Evangelicalism",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Fk9SXrqQNJUCZ02GDRfFM",
        "apple": "https://podcasts.apple.com/podcast/what-sex-cults-and-war-have-in-common/id1756133150?i=1000661675018"
      }
    },
    {
      "id": "e729f870-da35-4881-9b87-159de6524623",
      "title": "Who We Are, and Why We Talk About Cults So Much",
      "description": "Welcome to the inaugural episode of \u0022Cults and the Culting of America\u0022 podcast! Join hosts Scott Lloyd and Daniella Mestyanek Young as they dive into the fascinating world of cults, extreme groups, and toxic leadership. In this episode, Daniella shares her journey from growing up in the notorious Children of God cult to joining the U.S. Army and becoming a scholar of cult dynamics. Discover the psychological tactics used by cults to control and manipulate followers, and learn how these methods appear in everyday groups and systems. Scott and Daniella discuss why cults are a hot topic today and explore the societal changes making people more vulnerable to cultic influences. Tune in for an insightful discussion on recognizing and understanding the toxic elements in groups and the importance of individual awareness. Don\u0027t miss this engaging introduction to a series that will unpack the complexities of cult behavior and its impact on society. Be sure to like, rate, and share this episode to help spread the word. Follow Daniella on social media and check out her books \u0022Uncultured\u0022 and \u0022UnAmerican\u0022 for more in-depth insights. Join us on this journey to uncover the truth about cults and their pervasive influence. Connect with Scot at: https://www.tiktok.com/@thescotloyd Connect with Daniella at: My Patreon: https://www.patreon.com/GroupBehaviorGal TikTok: @daniellamestyanekyoung Instagram: @_daniellamyoung https://www.uncultureyourself.com/ Youtube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg UnAMERICAN Videobook Get the book: UNCULTURED: A Memoir \u0022A propulsive memoir delivered in the honest tones of a woman who didn\u0027t always think she\u0027d live to tell her story.\u0022 --NYT See a Sample Chapter in Rolling Stone Magazine See a Sample Chapter in The Sydney Herald Words in: Newsweek \u0026 Narratively Get a copy of UNCULTURED: Digital , Audio , or Hardcopy or preorder the paperback as a holiday gift for a friend. Get an Autographed copy here: https://uncultureyourself.com/pages/uncultured-autographed Transcript Scot: Welcome to the \u0022Cults and the Culting of America\u0022 podcast! I\u0027m your host, Scott Lloyd, and I\u0027m here with Daniella Mestyanek Young, a scholar of cults, extreme groups, and extremely bad leadership. Daniella, how are you today? Daniella: I\u0027m doing great, Scott! How about you? Scot: I\u0027m good, thanks! I see you’ve been super busy lately. Every time I open Instagram or TikTok, you’re going live. How do you manage to talk so much from 7 a.m. to 5 p.m.? Daniella: (Laughs) It\u0027s funny you mention that. When recording the audiobook for \u0022Uncultured,\u0022 I discovered I have no trouble talking for seven to nine hours a day. While others worry about losing their voice, that wasn’t the hard part for me. Right now, I’m talking to a lot of people about cults, which are a hot topic these days. Historically, cults thrive during times of societal change because people crave clarity and leadership. Scot: That makes sense, given everything going on. Your book, \u0022Uncultured,\u0022 is fantastic and really sheds light on your experiences growing up in the Children of God cult and later joining the Army. I recently moved to Springfield, Illinois, and saw your book featured as a must-read at Barnes \u0026 Noble. Congrats on all the success! Daniella: Thank you so much! I love seeing those photos of \u0022Uncultured\u0022 in the wild. I appreciate the introduction. As you mentioned, I grew up in the Children of God cult, which is one of the worst you’ll hear about on this podcast. I later joined the U.S. Army and earned a master\u0027s degree in Industrial/Organizational Psychology from Harvard Extension School. Now, I’m a scholar of cults, extreme groups, and extremely bad leadership. I compare what I do to an intelligence officer\u0027s work, helping people understand group behavior and recognize cult tactics in everyday life. Scot: Absolutely. Your book has been a great resource in understanding my own experiences with the United Pentecostal Church, which had many cult-like behaviors, especially in policing the bodies of women. These groups often use appearance and attitude policing to control individuals, stripping away their individuality. Daniella: Exactly. Cults exist for labor and control, using predictable patterns of coercive control. Appearance and attitude policing are key tactics. We’ll discuss this more in our episode on self-sacrifice, but the goal is always to erase the individual for the group’s or leader’s benefit. Scot: That loss of individualism is a common thread in many cults and extreme groups. For example, in the Pentecostal church, the exuberant worship practices often lead to a collective loss of self, making individuals more susceptible to groupthink and control. Daniella: Yes, chanting and group activities make us highly susceptible to suggestion. It’s a common tactic in cults and other controlling environments. We’ll explore this further in the podcast, breaking down my 10-part definition of cults and comparing these tactics to behaviors in everyday groups and systems. Scot: I’m thrilled about this podcast and the opportunity to learn from you. Why do you think cults are such a hot topic right now? Daniella: America is going through significant societal changes, similar to the 70s. People are seeking clarity and community, making them more vulnerable to cults. Additionally, we’re revisiting social issues and questioning longstanding systems like patriarchy, racism, and capitalism. Cult tactics are everywhere, and it’s crucial to recognize them to navigate these systems better. Scot: Well said. This podcast aims to educate and help people understand the toxic elements in groups and systems. I invite everyone to join us on this journey. Like, rate, and share this episode to help us spread the word. Daniella, thank you for sharing your insights. Daniella: Thank you, Scott. To our listeners, get my book \u0022Uncultured\u0022 wherever books are sold, or check out my second book, \u0022UnAmerican,\u0022 on Patreon. Follow us on social media for more updates, and stay tuned for our next episode, where we’ll dive deeper into what makes a cult a cult. For Daniella, I’m Scott. See you next time on \u0022Cults and the Culting of America\u0022!",
      "release": "2024-07-04T12:48:00Z",
      "duration": "00:23:25.0740000",
      "explicit": false,
      "spotifyId": "2RItATOALXHw6LI678cGUW",
      "appleId": 1000661554957,
      "youTubeId": "XK8qNm1rXTc",
      "subjects": [
        "Children Of God",
        "Evangelicalism",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2RItATOALXHw6LI678cGUW",
        "apple": "https://podcasts.apple.com/podcast/who-we-are-and-why-we-talk-about-cults-so-much/id1756133150?i=1000661554957",
        "youtube": "https://www.youtube.com/watch?v=XK8qNm1rXTc"
      }
    }
  ]
}