{
  "id": "5f75da85-4c27-4f43-90d2-aacc3dab7004",
  "name": "Cults Anon",
  "spotifyId": "3w5HJTyUZlD5a9RwQH0sNT",
  "appleId": 1705784552,
  "episodes": [
    {
      "id": "e5ec79be-a2d5-41fd-8d88-5920eced9802",
      "title": "Ep. 22: Heaven\u0027s Gate Part 1",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults! Join us this week as we discuss the Heaven\u0027s Gate organization, a largely underground UFO cult active throughout the 1970\u0027s to the 1990\u0027s that gained infamy when 39 members participated in a mass suicide in the belief that by leaving their physical bodies their spirits would be able to join an alien spacecraft connected to the Haley-Bopp Comet during it\u0027s proximity to Earth in 1997. Lets talk about it.",
      "release": "2024-10-21T17:24:24Z",
      "duration": "00:26:52.8630000",
      "explicit": false,
      "spotifyId": "41jRQ9PxIwi5RLX1Aet7Jj",
      "appleId": 1000673933147,
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/41jRQ9PxIwi5RLX1Aet7Jj",
        "apple": "https://podcasts.apple.com/podcast/ep-22-heavens-gate-part-1/id1705784552?i=1000673933147"
      }
    },
    {
      "id": "64302587-d4db-4059-82d0-523c0c0f263f",
      "title": "Ep. 21: The Church of the Lamb of God",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults! Join us this week as we explore Ervil Lebaron\u0027s violent doomsday cult the Church of the Lamb of God. We discuss the history of the Latter Day Saint Movement, it\u0027s charismatic founder Joseph Smith, and the various factions who continue to compete over candidates for Smith\u0027s succession to this day. One such faction, led by Ervil Lebaron, resorted to the abolished LDS doctrine of blood atonement to justify a campaign of terror intended to consolidate the various Fundamentalist Mormon sects under Lebaron\u0027s dictatorial rule. Lets talk about it.",
      "release": "2024-10-14T13:00:00Z",
      "duration": "00:55:35.9510000",
      "explicit": true,
      "spotifyId": "7EncqmLCBA3LOS7MrsYUrV",
      "appleId": 1000673027213,
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7EncqmLCBA3LOS7MrsYUrV",
        "apple": "https://podcasts.apple.com/podcast/ep-21-the-church-of-the-lamb-of-god/id1705784552?i=1000673027213"
      }
    },
    {
      "id": "5b5161ae-a8a0-48fb-a750-04a7596564ac",
      "title": "Ep. 20: Magdalena Solis: The High Priestess of Blood",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults! Join us this week for the thrilling and spooky tale of Magdalena Solis and the blood drinking death cult she founded in the small community of Yerba Buena, Mexico in the early 1960\u0027s. We sift through a variety of sources attempting to get to the bottom of this sensational tale of teenage priestesses and human sacrifice. Let\u0027s talk about it.",
      "release": "2024-09-30T13:00:00Z",
      "duration": "00:24:44.0060000",
      "explicit": false,
      "spotifyId": "1IBTRgRjP3gDp3APDx3WkL",
      "appleId": 1000671296111,
      "subjects": [
        "Magdalena Solís"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IBTRgRjP3gDp3APDx3WkL",
        "apple": "https://podcasts.apple.com/podcast/ep-20-magdalena-solis-the-high-priestess-of-blood/id1705784552?i=1000671296111"
      }
    },
    {
      "id": "ed66560c-fc8a-42ee-b6d5-cb4862736b74",
      "title": "Ep. 15: The High Price of \u0022Divine Love\u0022: Controversies of the Twin Flame Universe",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults! Join me this week as we examine the controversies and allegations surrounding the online dating/spiritual counseling service known as \u0022Twin Flame Universe\u0022. From encouraging their students to stalk potential twin flames to testimonies of former members that they were pressured into gender transitions against their will we take a hard look at the high price of \u0022divine love\u0022.",
      "release": "2024-08-26T14:00:00Z",
      "duration": "00:35:54.4040000",
      "explicit": true,
      "spotifyId": "5Qg1mTsPYZ7nGSlDOpHrvf",
      "appleId": 1000666658054,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Qg1mTsPYZ7nGSlDOpHrvf",
        "apple": "https://podcasts.apple.com/podcast/ep-15-the-high-price-of-divine-love-controversies/id1705784552?i=1000666658054"
      }
    },
    {
      "id": "d03828ab-2a4a-48f7-8e01-e0978cede55f",
      "title": "Ep. 14: Welcome to Season 2: Special Guest Interview!",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults! Join me this week as we kick off season two with a very special guest interview! We also review the results of the official 2023 Rapture Watch and we examine the war for free speech currently being waged by keyboard warriors across the internet and around the globe. Lets talk about it.",
      "release": "2024-08-19T13:30:00Z",
      "duration": "00:20:11.8850000",
      "explicit": false,
      "spotifyId": "15KUOPq6qyFALP155Wtmeh",
      "appleId": 1000665904211,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/15KUOPq6qyFALP155Wtmeh",
        "apple": "https://podcasts.apple.com/podcast/ep-14-welcome-to-season-2-special-guest-interview/id1705784552?i=1000665904211"
      }
    },
    {
      "id": "fdec8fc8-a172-4f37-978a-3e96805f9ef5",
      "title": "Ep. 13: What is Christian Zionism? Part 2",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!   Join me this week as we discuss the concept of identity as a social construct and the assumptions that exist about what identity is in general and what it means for an individual person to \u0022identify\u0022 with a larger group or social structure. What does it mean to have a national, cultural, ethnic, gender, or linguistic identity? Is it possible to over-identify with a specific group? How can we avoid that? Let\u0027s talk about it.",
      "release": "2023-12-12T22:20:44Z",
      "duration": "00:31:14.7220000",
      "explicit": false,
      "spotifyId": "74mGsKUKE6KUbTdJoX5jI9",
      "appleId": 1000638364806,
      "urls": {
        "spotify": "https://open.spotify.com/episode/74mGsKUKE6KUbTdJoX5jI9",
        "apple": "https://podcasts.apple.com/podcast/ep-13-what-is-christian-zionism-part-2/id1705784552?i=1000638364806"
      }
    },
    {
      "id": "385a8a8b-a36d-4d4d-9638-7644c0518ea0",
      "title": "Ep 12: What is Christian Zionism? Part 1",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!   Join me this week as we unpack the murky origins of the modern Christian Zionist Movement in the United States. In this episode we track the Zionist movement from its humble beginnings in the 1808 London Jew Society to Napoleon Bonaparte\u0027s aspirations to create a Jewish state in Palestine to the influence of Zionism on modern televangelist preachers that spearheaded it\u0027s infiltration into mainstream popular christianity. Where did the Christian Zionist Movement come from? Who were its founders? Why do they want the world to end so desperately and why are they so scary about trying to cause it? Lets talk about it.   Content Warning: This episode makes reference to material that some listeners may find disturbing including war crimes and sexual assault. Listener discretion is advised.",
      "release": "2023-12-05T04:08:42Z",
      "duration": "00:44:43.4160000",
      "explicit": false,
      "spotifyId": "6hWS0NQdakoP4WMhOCSR1Z",
      "appleId": 1000637513021,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6hWS0NQdakoP4WMhOCSR1Z",
        "apple": "https://podcasts.apple.com/podcast/ep-12-what-is-christian-zionism-part-1/id1705784552?i=1000637513021"
      }
    },
    {
      "id": "c838fd6f-8b6a-4cc8-9aea-fb15162a7f92",
      "title": "Ep 11: The Moonies- The Most Influential Cult You\u0027ve Never Heard Of Part 5",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!  Join me this week for the thrilling conclusion of our deep dive into the Unification Church, better known as the \u0022Moonies\u0022 after their founder and charismatic leader Sun Myung Moon. This week we discuss the Moonies deep ties to the modern day Republican party including the key role members of the cult played in the notorious Iran-Contra affair during the Reagan Administration in the 1980\u0027s and their recent participation in the Jan. 6 2021 US Capitol Insurrection in support of Donald Trump. Do the Moonies worship Jesus? Nope. Do they worship sex, money and M-16\u0027s? They sure do! Do they have a terrifying level of political influence in the US government? Of course! What nefarious cult doesn\u0027t? So lets talk about it.   *Content Warning* This podcast contains reference to material that some listeners may find disturbing including descriptions of war crimes, abuse, and sexual assault. Please listen with awareness and always practice self care.",
      "release": "2023-11-28T00:37:50Z",
      "duration": "00:39:16.4390000",
      "explicit": false,
      "spotifyId": "3ppQfFhZPcjCkoEIvzP9us",
      "appleId": 1000636723352,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ppQfFhZPcjCkoEIvzP9us",
        "apple": "https://podcasts.apple.com/podcast/ep-11-the-moonies-the-most-influential-cult-youve/id1705784552?i=1000636723352"
      }
    },
    {
      "id": "32dc5549-5744-4d11-9262-515bd451e78d",
      "title": "Ep 10: The Moonies-The Most Influential Cult You\u0027ve Never Heard of Part 4",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!  Join me this week for part 4 of our deep dive into the Unification Church of the United States, better known as the \u0022Moonies\u0022 after their founder and charismatic leader Sun Myung Moon. This week we examine the congressional findings concerning Moon and his cult activities laid out in the 1978 Fraser Report and discover just how much the United States Government really knew about Moon\u0027s nefarious plot for world domination. Do the moonies worship Jesus? Nope. Do they worship money, sex, and AK-47\u0027s? They sure do! Do they have a terrifying level of political influence in the United States Government? Of course! What nefarious cult doesn\u0027t? So lets talk about it.   *content warning* this podcast contains reference to material that some listeners may find disturbing including descriptions of war crimes and sexual assault. Please listen with awareness and always practice self care.",
      "release": "2023-11-20T17:00:00Z",
      "duration": "00:39:04.2600000",
      "explicit": false,
      "spotifyId": "6zInbccpLLCnlKIcAkGTS5",
      "appleId": 1000635450667,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6zInbccpLLCnlKIcAkGTS5",
        "apple": "https://podcasts.apple.com/podcast/ep-10-the-moonies-the-most-influential-cult-youve/id1705784552?i=1000635450667"
      }
    },
    {
      "id": "903b4773-7a65-4585-a9e0-31a2012daa22",
      "title": "Ep. 9: The Moonies- The Most Influential Cult You\u0027ve Never Heard of Part 3",
      "description": "Welcome to Cults Anon, the podcast where we talk about Cults!   Since the illusive rapture appears to be remaining ever imminent join me again this week for part three of our deep dive into the Unification Church of the United States, better known as the \u0022Moonies\u0022 after their founder and charismatic leader Sun Myung Moon. We pick up the Moonie\u0027s saga this week with Moon\u0027s rise to international wealth and power throughout the 1970\u0027s by back door-dealing, profiteering, and sex trafficking. Do the Moonies worship Jesus? Nope. Do they worship money, sex, and AK-47\u0027s? They sure do! Do they have a terrifying level of political influence in the United States government? Of course! What nefarious cult doesn\u0027t? So lets talk about it.   *Content Warning* This podcast contains reference to material that some listeners may find disturbing including descriptions of war crimes, sexual assault, rape, the sexual assault of children, and murder. Please listen with awareness and always practice self care.",
      "release": "2023-11-13T22:07:40Z",
      "duration": "00:41:54.1800000",
      "explicit": false,
      "spotifyId": "4TDN8Zec4CuAFjkaPbWHNe",
      "appleId": 1000634699307,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4TDN8Zec4CuAFjkaPbWHNe",
        "apple": "https://podcasts.apple.com/podcast/ep-9-the-moonies-the-most-influential-cult-youve/id1705784552?i=1000634699307"
      }
    },
    {
      "id": "902017cd-20c4-4186-80cc-297cdcaf1b6c",
      "title": "Ep 8: Breaking News in Cults: Announcing Rapture Watch 2023",
      "description": "Welcome to Rapture Watch 2023!  We are interrupting our regularly scheduled programing to bring you breaking news updates from the world of cults- the Rapture may really be on for 2023. The mormons are on the move with fundamentalist groups like AVOW and even the church of the first born son making the news from Utah to Idaho. The Jehova\u0027s Witnesses are changing their messaging from spreading the good news of the coming of the lord to the bad news that it\u0027s too late and your doomed. And we dig deep into the white whale of cults-the Zionist Movement- in a frank discussion of the surprising origins and motivations of the state of Israel and the sinister role christian fundamentalism is playing in the deeply tragic assault of Gaza. If you haven\u0027t been snatched up to heaven yet then join me again this week and lets talk about it.   Content Warning: This podcast contains references to material some listeners may find disturbing including descriptions of war crimes, murder, child abuse, and sexual assault. Please listen with awareness and always practice self-care.",
      "release": "2023-11-06T22:04:19Z",
      "duration": "01:21:46.5860000",
      "explicit": false,
      "spotifyId": "6qSH3CPTwyKNoAb90bu6bm",
      "appleId": 1000633906437,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6qSH3CPTwyKNoAb90bu6bm",
        "apple": "https://podcasts.apple.com/podcast/ep-8-breaking-news-in-cults-announcing-rapture-watch-2023/id1705784552?i=1000633906437"
      }
    },
    {
      "id": "ffcf94e5-ba8a-4007-b02d-fd1beae97dd4",
      "title": "Ep. 7 The Moonies: The Most Influential Cult You\u0027ve Never Heard Of Part 2",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!   Join me this week for part two of our deep dive into the Unification Church of The United States better known as the \u0022Moonies\u0022 after their founder and charismatic leader Sun Myung Moon. This week we pick up Moon\u0027s saga in the 1960\u0027s with his infiltration of post world war II Japanese, Korean, and American societies as a supposed christian religious organization. Do the Moonies worship Jesus? Nope. Do they worship money, sex, and AK-47\u0027s? They sure do! Do they have a terrifying level of political control in the United States government? Of course! What nefarious cult doesn\u0027t? So lets talk about it.   *Content Warning* This podcast contains reference to material that some may find disturbing including descriptions of war crimes, sexual assault, rape, the sexual assault of children, and murder. Please listen with awareness and always practice self care.",
      "release": "2023-10-23T20:48:55Z",
      "duration": "00:32:15.4880000",
      "explicit": false,
      "spotifyId": "0KWBVaBMzHnqd0EzxswwEb",
      "appleId": 1000632333256,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KWBVaBMzHnqd0EzxswwEb",
        "apple": "https://podcasts.apple.com/podcast/ep-7-the-moonies-the-most-influential-cult-youve/id1705784552?i=1000632333256"
      }
    },
    {
      "id": "3bfd23ed-4811-4f25-95ab-5bc62b62384b",
      "title": "Ep.6 The Moonies: The Most Influential Cult You\u0027ve Never Heard of Part 1",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!   Join me this week as we begin to pick apart the snarled mess of international political espionage, human sex trafficking, messianic delusions, and CIA backed psychological operations that is the Unification Church of the United States, better known as \u0022The Moonies\u0022 after their posthumous charismatic leader and founder Sun Myung Moon. Do they worship Jesus? Nope. Do they worship money, sex, and AK-47\u0027s? They sure do! Do they have a terrifying level of political control over the United States Government? Of course! What nefarious cult doesn\u0027t? So lets talk about it.   *Content Warning*: This podcast contains reference to material that some may find disturbing including descriptions of war and sexual assault. Please listen with awareness and practice self-care.",
      "release": "2023-10-16T15:00:00Z",
      "duration": "00:38:26.5720000",
      "explicit": false,
      "spotifyId": "6uxIxZl5iReA6XF6pJyMPs",
      "appleId": 1000631499755,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6uxIxZl5iReA6XF6pJyMPs",
        "apple": "https://podcasts.apple.com/podcast/ep-6-the-moonies-the-most-influential-cult-youve/id1705784552?i=1000631499755"
      }
    },
    {
      "id": "8f7a4766-458c-4609-9333-4df80d934c81",
      "title": "Ep. 5: Ruby Franke and Jodi Hildebrandt Pt 2: Connexions and Moms of Truth",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!  Join me this week for part two of our deep dive into the arrest of popular \u0022momfluencer\u0022 Ruby Franke and her business partner Jodi Hildebrandt after Franke\u0027s starving and injured children escaped from the basement of Hildebrandt\u0027s home in August. In part two we focus on Jodi Hildebrandt\u0027s side of the story, exploring her unethical for profit counseling service \u0022Connexions\u0022 and how she and Ruby Franke came together under a disturbing ideology they called \u0022Moms of Truth\u0022 to justify their horrific abuse of Franke\u0027s children. Lets talk about it.   Created by Bailey Rivers *Content Warning* This podcast makes reference to material that may be disturbing for some listeners including reference to child abuse, sexual assault, rape, domestic violence, and the exploitation of minors. Please listen with awareness and always practice self-care.",
      "release": "2023-10-09T15:00:00Z",
      "duration": "00:38:15.0180000",
      "explicit": false,
      "spotifyId": "5GADltc3sMtXAunkXZKzlw",
      "appleId": 1000630712051,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GADltc3sMtXAunkXZKzlw",
        "apple": "https://podcasts.apple.com/podcast/ep-5-ruby-franke-and-jodi-hildebrandt-pt-2-connexions/id1705784552?i=1000630712051"
      }
    },
    {
      "id": "ebeb9dba-7eb9-48b2-9ecf-2625fe8c3e81",
      "title": "Ep. 4: Ruby Franke and Jodi Hildebrandt Part 1: Eight Passengers",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults from the perspective of recovery!  Join me this week for a deep dive into the controversies surrounding the recent arrest of popular youtube \u0022momfluencer\u0022 Ruby Franke on child abuse charges after her starving and injured children escaped from the basement of her therapist Jodi Hildebrandt\u0027s home. In this first half of a two part episode on the complicated situation we will discuss the possible influences of fundamentalist christian cults on the Franke\u0027s parenting and lifestyle choices as well as the affect the toxic culture surrounding the problematic \u0022family vlog\u0022 genre of social media content. Lets talk about it.   Created By Bailey Rivers  *Content Warning* This podcast makes reference to material that may be disturbing for some viewers including reference to child abuse, sexual assault, rape, domestic violence, and the exploitation of minors.",
      "release": "2023-10-02T16:00:00Z",
      "duration": "00:40:04.3950000",
      "explicit": false,
      "spotifyId": "67q2AkG5UkiszVD9A3OjkR",
      "appleId": 1000629930729,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67q2AkG5UkiszVD9A3OjkR",
        "apple": "https://podcasts.apple.com/podcast/ep-4-ruby-franke-and-jodi-hildebrandt-part-1-eight/id1705784552?i=1000629930729"
      }
    },
    {
      "id": "b9e83913-6461-4565-9df0-014136d00183",
      "title": "Ep.3: The Radical Act of Refusal",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults from the perspective of recovery!  Join me this week as we explore the profound social, political, and historical significance of the radical act of refusal. We will learn about the different methods that can be employed to refuse to participate in actions or labor that is in direct opposition to your individual higher good and how you can exercise the act of refusal in your life to become a stronger and more independent person.   Created By Bailey Rivers   *Content Warning* This podcast makes reference to material that may be disturbing for some viewers including references to physical violence.",
      "release": "2023-09-25T16:00:00Z",
      "duration": "00:26:29.0160000",
      "explicit": false,
      "spotifyId": "6HAZfSAeAqDGdgBWPRMfk8",
      "appleId": 1000629096474,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6HAZfSAeAqDGdgBWPRMfk8",
        "apple": "https://podcasts.apple.com/podcast/ep-3-the-radical-act-of-refusal/id1705784552?i=1000629096474"
      }
    },
    {
      "id": "2e922143-c212-45cd-adc7-1a03cb369a9f",
      "title": "Ep. 2: Jonestown: A Grim Lesson",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults from the perspective of avoidance and recovery!  Join me this week for a frank discussion of one of the most notorious cult-related incidents in American history widely remembered as \u0022The Jonestown Massacre\u0022. We will examine the possible psychology and motivations behind cult leader Jim Jones while reviewing the escalating series of events that culminated in the heartbreaking tragedy of the Jonestown Massacre where over nine hundred people lost their lives in a single day. By accurately remembering and acknowledging the past we can hope to learn vital lessons about how to prevent similar tragedies in the present. Listener Discretion is advised.   Created by Bailey Rivers  *Content Warning* This podcast makes reference to material that may be disturbing for some listeners including topics of physical violence, abuse, child abuse, sexual assault, rape, self-harm, and murder. Listen with caution and always practice self-care.",
      "release": "2023-09-18T16:00:00Z",
      "duration": "00:45:31.4570000",
      "explicit": false,
      "spotifyId": "17ykHAtVA4YhsbqC5YG6AS",
      "appleId": 1000628281897,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/17ykHAtVA4YhsbqC5YG6AS",
        "apple": "https://podcasts.apple.com/podcast/ep-2-jonestown-a-grim-lesson/id1705784552?i=1000628281897"
      }
    },
    {
      "id": "4f779884-b3d0-41dd-82ed-275a7e6402f4",
      "title": "Cults Anon Trailer",
      "description": "Welcome To Cults Anon! The podcast where we talk about cults. Join me as we examine the dangerous set of behavioral patterns that turn an healthy community into a toxic cult and we learn and discuss the skills and techniques to identify, avoid, and even escape from high-control groups. Remember, information is power, autonomy is sacred, and joy is the antidote to fear. New episodes available every Monday where you get your podcasts!",
      "release": "2023-09-11T16:00:00Z",
      "duration": "00:01:25.2810000",
      "explicit": false,
      "spotifyId": "5EM4GIlBVNR4CTGXTEV8Xf",
      "appleId": 1000627493820,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5EM4GIlBVNR4CTGXTEV8Xf",
        "apple": "https://podcasts.apple.com/podcast/cults-anon-trailer/id1705784552?i=1000627493820"
      }
    },
    {
      "id": "3d67a1be-4aba-4fb8-8fc1-61ad58cefbb7",
      "title": "Ep.1: What is a cult? The BITES Model",
      "description": "Welcome to Cults Anon, the new podcast about cults! We approach the topic of cults and similar high-control groups through the lens of recovery: like a support group for people who no longer want to be in a cult. If you are in a high-control group and are looking for the support and advice on how to leave, or if you want to learn more about cults in order to avoid them in the future, then this is the podcast for you! Join us every Monday for a new episode exposing the toxic traits and strategies of cult leaders, learning the history of various cult organizations, and practicing the techniques of personal autonomy and self realization that foster true individual sovereignty.   In this introductory episode we tackle the basic question: What is a cult? We explain the BITE model developed by behavioral analyst and cult survivor Steven Hassan and the slightly altered BITES model that we will utilize in this podcast going forward as well identifying other common features that make up a cult.   Created by Bailey Rivers  *Content Warning* This podcast makes reference to material that may be disturbing for some listeners including the topics of physical violence, abuse, child abuse, sexual assault, rape, self-harm, and murder. Listen with caution and always practice self-care.",
      "release": "2023-09-04T16:00:00Z",
      "duration": "00:35:13.4900000",
      "explicit": false,
      "spotifyId": "0r1dxxk2Lc3n5D6VGbvV5i",
      "appleId": 1000626735807,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0r1dxxk2Lc3n5D6VGbvV5i",
        "apple": "https://podcasts.apple.com/podcast/ep-1-what-is-a-cult-the-bites-model/id1705784552?i=1000626735807"
      }
    }
  ]
}