{
  "_ts": 0,
  "id": "bcdd202c-cb43-46fc-93fa-107182b5b454",
  "name": "Cultimatum-The Culture of Cults \u0026 Human Trafficking",
  "spotifyId": "4GlmLKnbLUFPui5f7tizAQ",
  "appleId": 1744145655,
  "youTubeChannelId": "UCHrJGNsf1PjQEe-LY7KsH-w",
  "episodes": [
    {
      "id": "c25e6853-5730-4224-add6-ce988bc2d38e",
      "title": "#43 Breaking Faith: Vina’s Journey Beyond Mormonism",
      "description": "#43 Breaking Faith: Vina’s Journey Beyond Mormonism Please consider buying us a cup of coffee or two by clicking here. Your support helps fund our out of pocket expenses In this episode of the Cultimatum podcast, hosts Anonymous Andrew and Melody talk with Vina, a former member of the Church of Jesus Christ of Latter-day Saints (LDS). Vina shares her experiences from growing up in the LDS church, the struggles of living under its strict doctrines, her eventual departure, and how she rebuilt her life after leaving. The discussion covers a range of poignant topics, such as the psychological impacts of religious control, the challenges faced by women in the church, and the path to finding personal freedom and happiness. Vina\u0027s TikTok Link: https://www.tiktok.com/@unpack_w_me?_t=8qyfEUvmWx5\u0026_r=1 Vina\u0027s Instagram Link: https://www.instagram.com/unpack_w_me?igsh=MXU1bHU4b3F6eXo0eQ%3D%3D\u0026utm_source=qr Cultimatum Podcast Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 Cultimatum Podcast is a production of the Anonymous Andrew Podcast Studios To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-12-08T11:00:13Z",
      "duration": "01:03:42.2620000",
      "explicit": true,
      "spotifyId": "1kHqvZ5EDId1wcILFIrdLb",
      "appleId": 1000679637461,
      "youTubeId": "MhrDhHa8fa0",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kHqvZ5EDId1wcILFIrdLb",
        "apple": "https://podcasts.apple.com/podcast/43-breaking-faith-vinas-journey-beyond-mormonism/id1744145655?i=1000679637461",
        "youtube": "https://www.youtube.com/watch?v=MhrDhHa8fa0"
      }
    },
    {
      "id": "f1f9df45-8136-4bfb-af67-1113be90f483",
      "title": "Ep. #42 The Cult Hunter: Syran Warner’s Mission to Expose Dangerous Cults",
      "description": "Ep. #42 The Cult Hunter: Syran Warner’s Mission to Expose Dangerous Cults\nPlease consider buying us a cup of coffee or two by clicking here. Your support helps fund our out of pocket expenses\nIn this episode of the Cultimatum podcast, host Andrew and co-host Melody welcome cult hunter Siren Warner, who shares his unique journey into the world of cult investigation. Siren discusses his background as a journalist, his experiences with various cults, and the psychological dynamics that make individuals susceptible to cults. The conversation also touches on notable cult cases, the modern phenomenon of cults, and the importance of research in understanding these groups. Siren emphasizes that vulnerability to cults is a universal human experience, and he highlights influential figures in cult research. In this conversation, the speakers delve into the complexities of cults, their rise during periods of isolation, and the challenges faced in investigating and reporting on them. They discuss the legal ramifications of cult investigations, the role of law enforcement, and the importance of raising awareness about dangerous cults. The conversation highlights personal insights gained from experiences with cults and the necessity of disrupting cycles of abuse perpetuated by cult leaders.\ntakeaways\nSiren Warner transitioned from journalism to cult investigation after encountering a destructive cult.Cults can attract intelligent individuals, debunking the stereotype that only \u0027foolish\u0027 people join them.The dynamics of power and vulnerability play a significant role in cult membership.Modern technology and social isolation contribute to the rise of cults today.Research from experts like Alexandra Stein is crucial for understanding cults.Cults often exploit loneliness and the search for belonging in individuals.Siren\u0027s TikTok presence has helped raise awareness about cults and their impact.The story of Paulette Cooper and Operation Freakout illustrates the extreme measures cults will take to protect themselves.Cults are omnipresent in society, often hidden from public view.Cultimatum Podcast Contact Info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCultimatum Pinterest account :\nhttps://pin.it/YdcAW0Oiq\nCult Escape \u0026 Recovery Support Group:\nhttps://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com\nor visit\nwww.anonymousandrewpodcast.com",
      "release": "2024-12-01T11:00:21Z",
      "duration": "01:06:07",
      "explicit": false,
      "spotifyId": "25RRZKNmFSd3kXbNn7UPPB",
      "appleId": 1000678776887,
      "youTubeId": "SrqH_0TFQeM",
      "subjects": [
        "Marc Bisset",
        "Profundity Yours",
        "Scientology",
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/25RRZKNmFSd3kXbNn7UPPB",
        "apple": "https://podcasts.apple.com/podcast/ep-42-the-cult-hunter-syran-warners-mission-to-expose/id1744145655?i=1000678776887",
        "youtube": "https://www.youtube.com/watch?v=SrqH_0TFQeM"
      }
    },
    {
      "id": "f08fb736-1245-4931-ba88-5b22afc3ef12",
      "title": "Ep. #41 Unmasking the Seventh-day Adventist Church: Melissa\u0027s Deconstruction",
      "description": "Ep. #41 Unmasking the Seventh-day Adventist Church: Melissa\u0027s Deconstruction Please consider buying us a cup of coffee or two by clicking here. Your support helps fund our out of pocket expenses In this episode Cultimatum, we dive deep into the complex and often hidden world of the Seventh-day Adventist Church with Melissa Dugie Spiers, a fourth-generation ex-member. Melissa is currently writing a revealing book about her life in the church and the historical roots that shaped its practices. From the strict observance of the Saturday Sabbath to following biblical laws, Melissa grew up in a controlled environment that isolated her from the outside world. The episode explores the influence of Ellen G. White, the church’s prophetic founder, who shaped the sect’s strict beliefs. Melissa delves into the lesser-known history of White, including her possible mercury poisoning from her father’s hat-making business and a traumatic brain injury as a child, leading to speculation about her mental and physical health. Melissa sheds light on how White may have suffered from Gastaut-Geschwind Syndrome, a neurological disorder that shaped her behaviors and prophecies, which laid the foundation for the church\u0027s controversial doctrines—such as anti-masturbation, anti-LGBTQ beliefs, and rigid lifestyle restrictions. Melissa\u0027s personal journey of escape began at 17 when she left the church’s controlled bubble and moved to New York. For years, she buried her past, until a revelation involving a known child predator being protected by the SDA leadership reopened old wounds. This discovery propelled Melissa into her deconstruction process and inspired her to start speaking out, particularly through her growing TikTok platform, where she exposes disturbing truths about the church with factual references. In this episode, Melissa advises those still in the SDA or any cult-like group to critically assess their personal boundaries, use critical thinking, and do thorough research. Whether you are considering joining or questioning your involvement, this is a must-listen episode packed with insight into the Seventh-day Adventist Church’s darker side and the journey of healing after leaving. Join us as Melissa courageously shares her story, challenges the SDA\u0027s practices, and encourages others to find their path to freedom. Link to Melissa\u0027s TikTok Account: https://www.tiktok.com/@theglorywhole Cultimatum Podcast Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/257541906940650",
      "release": "2024-11-24T11:00:28Z",
      "duration": "01:04:14.9420000",
      "explicit": true,
      "spotifyId": "2HGRpQQTW01gUOmOIMdp5o",
      "appleId": 1000678059544,
      "youTubeId": "_z6SKDB_1Hs",
      "subjects": [
        "Seventh-day Adventist Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HGRpQQTW01gUOmOIMdp5o",
        "apple": "https://podcasts.apple.com/podcast/ep-41-unmasking-the-seventh-day-adventist-church/id1744145655?i=1000678059544",
        "youtube": "https://www.youtube.com/watch?v=_z6SKDB_1Hs"
      }
    },
    {
      "id": "177fc1d2-9eed-4102-934e-8c755b437a6d",
      "title": "Ep. #40 Shattered Faith: Harry\u0027s Escape from the House of Yahweh",
      "description": "Ep. #40 Shattered Faith: Harry\u0027s Escape from the House of Yahweh Please consider buying us a cup of coffee or two by clicking here. Your support helps fund our out of pocket expenses In this compelling episode, we delve into the harrowing experiences of \u0022Harry,\u0022 an anonymous former member of the House of Yahweh. Harry joined the cult in 1995, only to witness a dramatic shift in its teachings around the year 2000. Members were increasingly subjected to oppressive controls, including needing the leader\u0027s permission to marry, paying a bride price, and undergoing so-called \u0022betrothal counseling.\u0022 By 2003, the group\u0027s practices had become even more extreme, with a literal wall erected in the sanctuary to divide men from women. The leadership\u0027s desire for total control extended to every aspect of members\u0027 lives, including who they could see, talk to, and marry. The woman Harry was interested in was taken by the leader, Yisrayl Hawkins, as one of his many wives and concubines—a devastating blow that marked a turning point for Harry and others in the group. As the group’s teachings became increasingly rigid and abusive, questions about the future leadership and the group\u0027s direction were met with swift excommunication. The cult’s indoctrination methods were further entrenched by limiting education, particularly for women, with most members being homeschooled and receiving little education beyond the 5th grade. Harry sheds light on the shocking realities of life inside the House of Yahweh, where young women are treated as property, and the cult has become a breeding ground for pedophiles under the guise of religious doctrine. Women are often forced into marriages, living in dilapidated conditions, completely dependent on the men who control their every move. Fear of eternal damnation keeps many members trapped, while the cult’s strict control over sexuality has led to disturbing practices, including bestiality. After a near-death experience, Harry broke free from the cult in 2005, realizing that staying meant a life without the possibility of a partner or wife. Today, Harry is thriving and no longer believes in the fear-based teachings that once kept him captive. He emphasizes the importance of education and self-awareness, reflecting on how absolute power corrupts absolutely. This episode is a powerful testament to the resilience of the human spirit and a sobering reminder of the dangers of unchecked religious authority. Harry’s voice is altered to protect his identity, but his story will resonate with anyone who has ever questioned the true cost of blind faith. Cultimatum Podcast Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com Executive Producer Andrew Polizzo A Production of Anonymous Andrew Podcast Studios Copyright 2024 ©",
      "release": "2024-11-17T11:00:22Z",
      "duration": "01:11:43.7510000",
      "explicit": true,
      "spotifyId": "0aDpVjiA7AfDS3NbKay4Re",
      "appleId": 1000677221184,
      "youTubeId": "fPljbpv2Pw4",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0aDpVjiA7AfDS3NbKay4Re",
        "apple": "https://podcasts.apple.com/podcast/ep-40-shattered-faith-harrys-escape-from-the-house-of-yahweh/id1744145655?i=1000677221184",
        "youtube": "https://www.youtube.com/watch?v=fPljbpv2Pw4"
      }
    },
    {
      "id": "624a6c40-0c08-49b9-86c1-deeedaafd07e",
      "title": "Ep # 39 Daughters of the Cult : Unraveling Ervil La Baron\u0027s Dark Legacy",
      "description": "Ep # 39 Daughters of the Cult : Unraveling Ervil La Baron\u0027s Dark Legacy Please consider buying us a cup of coffee or two by clicking here. Your support helps fund our out of pocket expenses In this episode, Andrew and Melody discuss the documentary \u0027Daughters of the Cult,\u0027 which explores the dark history of Ervil LeBaron and the Church of the Firstborn Lamb of God. They delve into the cult\u0027s violent practices, the impact on families, and the ongoing legacy of its actions. The conversation highlights the complexities of cult dynamics, the psychological manipulation involved, and the challenges faced by survivors. The hosts reflect on the documentary\u0027s portrayal of the cult\u0027s history and its implications for understanding religious extremism and violence. takeaways The documentary focuses on the lives of women and children in the cult. Ervil LeBaron was a violent leader who enforced extreme beliefs. The concept of blood atonement was central to the cult\u0027s ideology. Many members were brainwashed into committing violent acts. The documentary features personal accounts from survivors. The cult\u0027s legacy continues to affect families today. Law enforcement struggled to address the cult\u0027s violence for years. The documentary highlights the psychological trauma of cult members. Survivors have found ways to heal and share their stories. The conversation raises questions about the nature of cults and organized crime. Cultimatum Podcast Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com A production of the Anonymous Andrew Podcast Studios All Rights Reserved 2024 ©",
      "release": "2024-11-10T11:00:40Z",
      "duration": "00:37:46.3310000",
      "explicit": true,
      "spotifyId": "7MoSBNpcS51wLH5Z839wB9",
      "appleId": 1000676358771,
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MoSBNpcS51wLH5Z839wB9",
        "apple": "https://podcasts.apple.com/podcast/ep-39-daughters-of-the-cult-unraveling-ervil-la/id1744145655?i=1000676358771"
      }
    },
    {
      "id": "51480627-6c74-4794-8ee3-74bda786d09b",
      "title": "Ep. #38 How To Leave A Cult with Brooke Walker",
      "description": "In this thought-provoking episode, we sit down with Brooke Walker, a former member of the Church of Immortal Consciousness, a cult she was brought into at just 8 years old. Led by the trance medium Trina Camp and her husband Steven, the group created a tight-knit community where families lived together, practiced arranged marriages, and believed in a unique connection to God through non-denominational reincarnation. Brooke shares her story of growing up in this controlling environment, where children were expected to surpass their parents and be grateful for the \u0022opportunity\u0022 to learn from their mistakes. Emotional was common and physical abuse happened occasionally, by the time she was 17, Brooke was forced into an arranged marriage. The situation worsened over time, with her husband leaving the group when she was only 22, leaving her to raise two children within the cult’s oppressive structure. The Church of Immortal Consciousness operated without a physical church building, instead focusing on practices like \u0022breaking down your brackets,\u0022 a grueling process involving hours of yelling, drinking, and emotional manipulation. The group\u0027s leaders wielded their supposed spiritual powers to control members, exploiting them for financial gain while keeping them in fear of eternal damnation if they left. Brooke’s breaking point came as her family started to fall apart, with rebellious teenagers. At 35, she finally made the courageous decision to leave, despite the enormous personal cost of losing everyone she knew. Now, Brooke has transformed her painful experiences into a powerful message of healing and resilience. She hosts the podcast \u0022How to Leave a Cult,\u0022 where she delves deeper into her story and helps others navigate the difficult path of deconstruction. Brooke’s advice is clear: ask the right questions, ensure your relationships are healthy, and take baby steps toward healing without triggering yourself. Join us as Brooke Walker reveals the dark underbelly of the Church of Immortal Consciousness, her path to freedom, and the steps she’s taken to rebuild her life outside the cult. Brooke\u0027s YouTube Channel: https://www.youtube.com/@brookewalker9118 Brooke\u0027s Instagram Page: https://www.instagram.com/how_to_leave_a_cult/ Brooke\u0027s TikTok: https://www.tiktok.com/@howtoleaveacult Brooke\u0027s Facebook Page: https://www.facebook.com/howtoleaveacult Cultimatum Podcast Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Podcast is a Production of the Anonymous Andrew Podcast Studios All rights reserved ©",
      "release": "2024-11-03T13:00:29Z",
      "duration": "00:58:13.8250000",
      "explicit": true,
      "spotifyId": "4LcTxwV46JEdVoymIHJMNZ",
      "appleId": 1000675508162,
      "youTubeId": "oUtpE-U0d_s",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LcTxwV46JEdVoymIHJMNZ",
        "apple": "https://podcasts.apple.com/podcast/ep-38-how-to-leave-a-cult-with-brooke-walker/id1744145655?i=1000675508162",
        "youtube": "https://www.youtube.com/watch?v=oUtpE-U0d_s"
      }
    },
    {
      "id": "7963120e-9a6b-4d29-a139-1af216a41f56",
      "title": "Ep #37 Holy Hell Unveiled: Inside The Buddafield Cult",
      "description": "Ep #37 Holy Hell Unveiled: Inside The Buddafield Cult\nPlease consider buying us a cup of coffee or two by clicking here. Your support helps fund our out of pocket expenses \nIn this episode of the \u0027Cultimatum podcast, hosts Anonymous Andrew and Melody introduce their new segment of reviewing cult documentaries. They discuss the documentary \u0027Holy Hell,\u0027 focusing on a manipulative cult led by Jamie Gomez, a failed Hollywood actor. The hosts analyze how the cult, initially portraying peace and love, descended into manipulation, control, and non-consensual sexual activities. They debate whether the viewers should watch it, despite unanswered questions about the cult\u0027s current status. The episode ends with an invitation for audience interaction and a suggestion to explore similar shocking documentaries.\nCultimatum Podcast Contact Info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCult Escape \u0026 Recovery Support Group:\nhttps://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com\nor visit\nwww.anonymousandrewpodcast.com",
      "release": "2024-10-27T12:00:42Z",
      "duration": "00:39:54",
      "explicit": false,
      "spotifyId": "3LEr9K2CY6MlFZ9mZG6etj",
      "appleId": 1000674604956,
      "youTubeId": "QXuArXjOdI4",
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3LEr9K2CY6MlFZ9mZG6etj",
        "apple": "https://podcasts.apple.com/podcast/ep-37-holy-hell-unveiled-inside-the-buddafield-cult/id1744145655?i=1000674604956",
        "youtube": "https://www.youtube.com/watch?v=QXuArXjOdI4"
      }
    },
    {
      "id": "b785a61b-acab-4283-9dfc-73fe6ef02030",
      "title": "#36 Carol Merchasin: Advocating Justice for Cult Survivors",
      "description": "#36 Carol Merchasin: Advocating Justice for Cult Survivors In this episode of the Cultimatum podcast, host Andrew and co-host Melody engage with Carol Merchasin, an expert in cult law, discussing her journey into representing victims of cults and the complexities of legal advocacy in this field. They explore the challenges faced by survivors in recognizing their abuse, the slow legal processes involved, and the need for reform in laws surrounding coercion and consent. The conversation highlights the psychological impact of cults on individuals and the importance of community support in helping survivors navigate their experiences. In this conversation, the speakers delve into the complexities of cult leadership, the emotional and legal challenges faced by survivors, and the importance of community support and awareness in preventing cult involvement. They discuss the manipulative tactics used by cult leaders, the long journey of healing for survivors, and the legal processes involved in holding cults accountable for their actions. The conversation emphasizes the need for critical thinking and the role of support systems in the recovery process. takeaways Takeaways Carol Merchasin transitioned from a corporate lawyer to advocate for cult survivors. Many people have stereotypes about cult survivors that hinder understanding. Legal systems often struggle to address abuses within cults due to their religious cloaking. The process of bringing cases against cults is slow and complicated. Consent in cult situations is often not informed due to coercion. Human trafficking laws may provide a new avenue for addressing cult abuses. Survivors often need time to recognize their victimization due to brainwashing. The civil justice system is primarily about monetary compensation, complicating cases. There is a need for legal reform to better protect cult survivors. Community support is crucial for survivors to regain their agency. The manipulation tactics of cult leaders often change to fit their agenda. Survivors may take years to recognize the abuse they endured. Legal action against cults can be complicated and requires specific evidence. Community support is crucial for survivors seeking justice. Awareness and education can help prevent future cult involvement. Healing is a personal journey that varies for each survivor. Survivors often experience shame due to societal misconceptions about cults. Multiple survivors coming forward can strengthen a legal case. The legal system is slowly evolving to better support survivors. Raising awareness is key to holding cults accountable. Carol\u0027s Bio Page: https://mcolaw.com/team/carol-merchasin/ McAllister Olivarius Lawyer \u0026 Law Firm Instagram Link: https://www.instagram.com/mcallisterolivarius?utm_source=ig_web_button_share_sheet\u0026igsh=ZDNlZDc0MzIxNw== Carol\u0027s X Link: https://x.com/CarolMerchasin Cultimatum Podcast Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==",
      "release": "2024-10-20T13:00:27Z",
      "duration": "01:10:13.0800000",
      "explicit": true,
      "spotifyId": "5wIaqOPltdsJRmVLJonevT",
      "appleId": 1000673738610,
      "youTubeId": "bAir6PJoI8k",
      "subjects": [
        "Cult-Expert",
        "Legislation",
        "Twin Flames Universe",
        "La Luz Del Mundo",
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wIaqOPltdsJRmVLJonevT",
        "apple": "https://podcasts.apple.com/podcast/36-carol-merchasin-advocating-justice-for-cult-survivors/id1744145655?i=1000673738610",
        "youtube": "https://www.youtube.com/watch?v=bAir6PJoI8k"
      }
    },
    {
      "id": "d85f0dd8-fbe8-4ce2-8808-892ab0fb71e7",
      "title": "Ep. #35 Breaking the Chains: Heidi\u0027s Journey Out of the Seventh-day Adventist Church",
      "description": "Ep. #35 Breaking the Chains: Heidi\u0027s Journey Out of the Seventh-day Adventist Church In this eye-opening episode, we dive into the life of Heidi Odell, a fourth-generation former member of the Seventh-day Adventist Church. Heidi\u0027s lineage traces back to the very origins of the church, with her great-great-great-grandmother, Ellen White, present at the infamous \u0022Great Disappointment\u0022 on October 20, 1844. This event, marked by the failed prophecy of Christ’s return, became a pivotal moment in the church\u0027s history. Heidi shares the complexities of her family\u0027s deep-rooted connection to the church, including Ellen White’s controversial visions, which some believe were influenced by mercury poisoning due to her father\u0027s occupation as a hatter. These visions, which sought to rationalize the failed prophecy, laid the foundation for what would become a global religious movement. Despite her empathy and understanding for those still within the church, Heidi recounts her personal struggles, including enduring abuse at the hands of her father, who suffered from untreated mental illness. Kicked out of her home at 13 after speaking out about the abuse, Heidi began a long journey of self-discovery and deconstruction, ultimately leaving the church in 2012. Heidi’s story is one of resilience and healing. After divorcing in 2015 and facing backlash from the church for becoming a surrogate in 2018, she has turned to yoga, hypnotherapy, and deep research into the church\u0027s history as part of her recovery. Today, she fully disbelieves in the teachings of the Seventh-day Adventist Church and is passionate about helping others on their journey of self-discovery. In this episode, Heidi emphasizes the importance of leaving when the time is right for you and encourages listeners to trust themselves, do their own research, and build communities outside of religious institutions. Her insights into the Seventh-day Adventist Church and her own personal evolution make this a must-listen episode for anyone interested in religious deconstruction and healing. Heidi\u0027s TikTok Link: https://www.tiktok.com/@heidi.leanne_._ Cultimatum Podcast Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-10-13T17:29:03Z",
      "duration": "01:05:57.4720000",
      "explicit": true,
      "spotifyId": "1zMysB1lu3VKuDwy6VUxgB",
      "appleId": 1000672935161,
      "youTubeId": "u1_sKQNP7eU",
      "subjects": [
        "Seventh-day Adventist Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zMysB1lu3VKuDwy6VUxgB",
        "apple": "https://podcasts.apple.com/podcast/ep-35-breaking-the-chains-heidis-journey-out-of/id1744145655?i=1000672935161",
        "youtube": "https://www.youtube.com/watch?v=u1_sKQNP7eU"
      }
    },
    {
      "id": "8b6b1d7d-4733-4628-bede-fe1338c86ed8",
      "title": "Ep# 34 Cult Anatomy -Unmasking Control, Manipulation \u0026 Brainwashing",
      "description": "Ep# 34 Cult Anatomy -Unmasking Control, Manipulation \u0026 Brainwashing In this episode of Cultimatum, co-hosts Anonymous Andrew and Melody dive deep into the anatomy of cults, exploring how manipulation, control, and brainwashing tactics are used across different settings—religious groups, MLMs, and even spiritual or wellness movements. They break down the nuances of high-control groups, revealing how cult-like tactics often appear in unexpected places, from yoga classes to multi-level marketing schemes. Using real-life examples from previous episodes, such as Mandy’s experience with Potter’s House (Ep. #6) and Kim Peirano’s journey (Ep. #28), the hosts illustrate the subtle and overt methods used to manipulate followers. They also introduce Steven Hassan’s BITE Model, explaining how cults control behavior, information, thoughts, and emotions to keep members loyal and dependent. Whether it\u0027s the behavior control seen in MLMs or the emotional manipulation in religious cults, Melody and Andrew equip listeners with critical thinking tools to recognize red flags. From love-bombing to guilt and fear tactics, they highlight the dangers of groups that demand unquestioning loyalty and isolate followers from the outside world. By the end of this episode, listeners will not only have a deeper understanding of what defines a cult but will also be armed with knowledge to spot cult-like manipulation in everyday life. Key Discussion Points: Defining cults: Moving beyond stereotypes of religious zealots. The BITE Model: Understanding how high-control groups manipulate behavior, thoughts, and emotions. How MLMs mirror cult-like structures and the dangers of wellness movements. Real-life examples from former cult members featured on Cultimatum. Tune in for an eye-opening conversation about the subtle yet powerful tactics cults use and learn how to protect yourself from falling victim to their control. I personally want to that Melody for putting this episode together. She produced this episode. She has become the Producer of Cultimatum Podcast!-Anonymous Andrew Cultimatum Podcast Contact Info:Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-10-06T15:02:06Z",
      "duration": "00:33:54.4940000",
      "explicit": true,
      "spotifyId": "4Rh0f6eK93JRkbWs3eqhyY",
      "appleId": 1000671960856,
      "youTubeId": "veTnI7kZr6I",
      "subjects": [
        "Cult Psychology",
        "Foundation for Spiritual Development",
        "Potter\u0027s House Christian Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Rh0f6eK93JRkbWs3eqhyY",
        "apple": "https://podcasts.apple.com/podcast/ep-34-cult-anatomy-unmasking-control-manipulation-brainwashing/id1744145655?i=1000671960856",
        "youtube": "https://www.youtube.com/watch?v=veTnI7kZr6I"
      }
    },
    {
      "id": "5b27014e-da00-4a94-9146-37bc47a382fc",
      "title": "Ep. #33: Escaping The  Chains – Suzanne Accardo\u0027s Journey from Trafficking Survivor to Advocate",
      "description": "Ep. #33: Escaping The Chains – Suzanne Accardo\u0027s Journey from Trafficking Survivor to Advocate\nIn this powerful episode, we sit down with Suzanne Accardo, a human trafficking survivor and the founder of the Facebook group Modern Day Slavery, Creating Awareness about Human Trafficking in the USA. Suzanne begins by challenging a common misconception: that slavery was ever truly abolished. As a single mom to a 9-year-old boy, Suzanne shares her deeply personal story, which began when her mother married into a secretive \u0022brotherhood\u0022 in Montgomery County, Texas.\nSuzanne opens up about the horrifying experiences she endured, beginning at age 13 when she was molested by a man involved in organized crime, who married her mother. She shares the chilling belief that both her uncle and grandmother may have been poisoned, and how she was manipulated and slowly drugged while in a fake relationship with her trafficker. Her ordeal escalated to the point where she was chained in an RV for months, forced to live in a drug-induced haze, unsure of what she was being given.\nA moment of clarity came when she saw a video of herself, realizing the extent of her situation. She seized a rare opportunity to escape when her captor left the chains off and the door unlocked. But the nightmare was far from over. Suzanne was treated as a criminal, even being committed to a mental hospital when she should have been recognized as a victim.\nSuzanne’s fight for survival continues today, as she raises awareness of the dangers of human trafficking and the systems that fail its victims. She discusses how her home has been broken into, her pets killed, and the ongoing fear for her life. Suzanne’s advice to those targeted: never be alone and surround yourself with trusted people. Her story is one of survival, resilience, and a determined mission to expose the truth behind modern-day slavery in America.\nDon’t miss this eye-opening episode of Cultimatum as Suzanne reveals the shocking realities of human trafficking and the resilience of the human spirit.\nLink to Suzanne\u0027s Facebook Group: https://www.facebook.com/groups/1456062254920275\n\nCultimatum Podcast Contact Info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCultimatum Pinterest account :\nhttps://pin.it/YdcAW0Oiq\nCult Escape \u0026 Recovery Support Group:\nhttps://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com\nor visit\nwww.anonymousandrewpodcast.com",
      "release": "2024-09-29T15:23:29Z",
      "duration": "00:40:55",
      "explicit": false,
      "spotifyId": "52Izrrv7LmwVCwXCtlwF93",
      "appleId": 1000671186056,
      "youTubeId": "GWjjPClwLco",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/52Izrrv7LmwVCwXCtlwF93",
        "apple": "https://podcasts.apple.com/us/podcast/ep-33-escaping-the-chains-suzanne-accardos-journey/id1744145655?i=1000671186056",
        "youtube": "https://www.youtube.com/watch?v=GWjjPClwLco"
      }
    },
    {
      "id": "9d937559-df53-458d-9c9b-03294cd62ee0",
      "title": "Ep. #32 Swindled By Faith with Richard Kiers",
      "description": "Ep. #32 Swindled By Faith with Richard Kiers In this episode, we delve into the harrowing journey of Richard Kier, who grew up in a little-known but insidious cult called The Move of God, founded by Sam Fife in the 1960s. The Move, an offshoot of the Baptist church, gained traction for its charismatic leader and promise of discovering the \u0022truth.\u0022 Richard’s father, in his search for spiritual fulfillment, uprooted their family to join a communal farm in Canada when Richard was just 10 years old. Life in The Move was one of strict control and isolation. Members were required to sever ties with extended family, and every aspect of their lives was dictated by the cult’s teachings—down to the clothes they wore and how they groomed themselves. The commune prided itself on self-sufficiency, but this came with significant hardships. Living without running water, electricity, or proper sanitation, members hauled water from a nearby spring and used outhouses. The cabins they lived in were built by the community, and while some members had access to money and cars, these were communal property, used solely for the benefit of the group. As Richard grew older, he began to see the cracks in the cult’s façade, especially when his father fell ill. Despite his father’s suffering, the group refused to seek outside medical help, insisting that any failure to recover was a result of weak faith. This incident deeply shook Richard’s belief in the group. Life in the commune was harsh, with children put to work on the farm and forced to contribute to building the community. The food was scarce and of poor quality, and the environment was far from nurturing. Years later, Richard penned a book titled Swindled by Faith, chronicling his experiences. He waited until after his parents passed away to publish the book, out of respect for their memory, despite the pain they endured within the group. As his parents aged and became less useful to the cult, they were discarded—no longer of value without money or income. In closing, Richard offers a poignant piece of advice for those questioning whether a group might be a cult or dangerous: observe how they treat the children. It is a revealing indicator of the group’s true nature. Link to Richard\u0027s Facebook page: https://www.facebook.com/share/ucdvn73Rt5w2X6qn/?mibextid=qi2Omg Link to Richard\u0027s Book: https://www.amazon.com/Swindled-Faith-Reconciliation-Richard-Kiers-ebook/dp/B07RWTKQ73/ref=sr_1_1?crid=104DCBNYZCZGT\u0026dib=eyJ2IjoiMSJ9.EWwNrojphJ7nZqnPOSSQOfU36BIzaDHLWfoHDzxRcYg.FuYwEUjPKtHhD2vmcWNxZcPWJyT5iBgRUn-mRqgYuRs\u0026dib_tag=se\u0026keywords=Swindled\u0026#43;by\u0026#43;faith\u0026qid=1723493728\u0026sprefix=swindled\u0026#43;by\u0026#43;faith%2Caps%2C408\u0026sr=8-1 Link to the Documentary Richard was in : https://www.investigationdiscovery.com/crimefeed/id-shows/6-cults-featured-in-next-season-of-people-magazine-investigates-cults Cultimatum podcast Contact Info: Email: cultimatumpodcast@gmail.com",
      "release": "2024-09-22T19:40:28Z",
      "duration": "00:57:42.6080000",
      "explicit": true,
      "spotifyId": "5FsNpbCAdvN6ekNEKyE1uR",
      "appleId": 1000670323822,
      "youTubeId": "_JUMBQP6GH8",
      "subjects": [
        "The Move Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FsNpbCAdvN6ekNEKyE1uR",
        "apple": "https://podcasts.apple.com/podcast/ep-32-swindled-by-faith-with-richard-kiers/id1744145655?i=1000670323822",
        "youtube": "https://www.youtube.com/watch?v=_JUMBQP6GH8"
      }
    },
    {
      "id": "76a2731f-f371-42b8-9ca5-2b6acee82c71",
      "title": "Ep. #31 Justine For Justice - Escaping the ICOC",
      "description": "Episode #31 Justine For Justice - Escaping the ICOC\nIn this episode, we hear from Justine, a survivor of the International Church of Christ (ICOC), as she bravely shares her experience of growing up in a controlling religious group. The ICOC is known for its extreme control over members, including enforcing a strict purity culture and dictating every aspect of members\u0027 lives.\nJustine\u0027s story is one of resilience and survival. At age 16, she left the group to seek treatment for an eating disorder, which marked the beginning of her journey to recovery and freedom. Now, 20 years later, Justine is thriving—she’s married and has three children. Her journey to healing began when she started a blog, sharing her experiences and helping others come forward with their own stories.\nThe ICOC\u0027s influence extended far beyond spiritual matters, impacting every aspect of Justine\u0027s life. Members were required to make significant financial contributions and were often given recruitment quotas, effectively turning them into unpaid laborers. Justine’s family joined the ICOC when she was just three years old, seeking a supportive environment after her father’s struggles with alcoholism. However, the reality was far from what they expected. Justine endured multiple forms of abuse and struggled with isolation, believing that everyone outside the group was doomed.\nThe turning point came when Justine’s family learned about the systemic abuses within the ICOC, which eventually led them to leave the group. Today, Justine is a vocal advocate for those harmed by controlling religious groups, using her platform to raise awareness about the dangers of cults and importance of mental health. Her story is a powerful reminder of the strength it takes to break free from such environments and the importance of supporting survivors.\nThis episode is a crucial listen for anyone seeking to understand the psychological impact of cults and the path to recovery for survivors\nJustine\u0027s Contact Info:\nJustine\u0027s website for details on cases: https://open.substack.com/pub/justicejustine\nJustine\u0027s Instagram page: https://www.instagram.com/justineforjustice/\nJustine\u0027s TikTok account: https://www.tiktok.com/@justineforjustice\nFor Anyone Harmed By the ICOC contact : https://www.instagram.com/free2b_org/\nCultimatum Podcast Contact Info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1",
      "release": "2024-09-15T13:10:22Z",
      "duration": "00:55:52",
      "explicit": false,
      "spotifyId": "6KCIELv2qTLdkumGIEL0PS",
      "appleId": 1000669599245,
      "youTubeId": "5dTTS5_PSvI",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KCIELv2qTLdkumGIEL0PS",
        "apple": "https://podcasts.apple.com/us/podcast/ep-31-justine-for-justice-escaping-the-icoc/id1744145655?i=1000669599245",
        "youtube": "https://www.youtube.com/watch?v=5dTTS5_PSvI"
      }
    },
    {
      "id": "14caaeef-e6b4-4ca2-9f92-70c6e61a6e91",
      "title": "Ep. #30 Natalie Wong \u0026 The Cult With No Name",
      "description": "Ep#30: Natalie Wong \u0026 The Cult With No Name Join us on this gripping episode of Cultimatum as we delve into the extraordinary journey of Natalie Wong, a survivor of a cult with no name. Hailing from New Zealand, Natalie was born into a strict Baptist Pentecostal church. As the youngest in her family and a fervent believer, she was deeply influenced by extreme teachings about Satan. Her parents\u0027 separation at age 10 marked the beginning of significant changes in her life. At just 11, Natalie found herself leading the kids\u0027 church at a new congregation. However, her teenage years were marred by sexual abuse from a family friend, leading her to leave school at 16 to dedicate herself to the church with her mother’s support. A pivotal turn came when her mother met two women from Namibia and decided to sell their home and move to Africa, bringing Natalie along. Upon arrival, they quickly noticed unsettling red flags. The cult had Pentecostal roots, but the son of the leading family was revered as the second coming of Christ, with leaders dressing in robes and sandals to mimic biblical times. Despite the oppressive environment, Natalie’s mother managed to escape first, and Natalie followed soon after, executing a carefully planned escape under dire circumstances. Back in New Zealand, Natalie returned to a Pentecostal church and got married, only to face immense pressure to have children despite infertility struggles. This led to severe panic attacks and ultimately her departure from the church. Seeking belonging, she joined the Mormon church with her family, only to leave a few years later due to its negative impact on her children and her need to constantly unteach them doctrines she disagreed with. Now, ten years out, Natalie has dedicated herself to deconstructing and reconstructing her beliefs. Her story is a testament to resilience and critical thinking. She offers powerful advice to our audience: trust your instincts and always employ critical thinking skills. Tune in to hear Natalie’s unique and inspirational story of survival, recovery, and the quest for personal truth. Cultimatum Podcast Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-09-08T13:42:16Z",
      "duration": "00:59:34.0730000",
      "explicit": true,
      "spotifyId": "652EkNQrY2bxWWR92CyaLU",
      "appleId": 1000668778541,
      "youTubeId": "3WwgRI7trbs",
      "subjects": [
        "Evangelicalism",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/652EkNQrY2bxWWR92CyaLU",
        "apple": "https://podcasts.apple.com/podcast/ep-30-natalie-wong-the-cult-with-no-name/id1744145655?i=1000668778541",
        "youtube": "https://www.youtube.com/watch?v=3WwgRI7trbs"
      }
    },
    {
      "id": "ab85291f-3b83-44fc-8cc6-e0b43403e9d8",
      "title": "Ep. #29 The Amazing Adventures of an Amish Stripper with Naomi Swartzentruber",
      "description": "Episode #29: The Amazing Adventures of an Amish Stripper with Naomi Swartzentruber Join us on Cultimatium as we uncover the compelling journey of Naomi Swartzentruber, who was born into the strict Swartzentruber Amish community in mid-Michigan. Naomi shares her harrowing and inspiring story of growing up in a sheltered environment, one she now identifies as a cult. Despite her past, Naomi continues to wear Amish dress on her social media accounts and has authored a provocative memoir, The Amazing Adventures of an Amish Stripper: An Erotic Memoir. Naomi’s quest for freedom began when she befriended a \u0022worldly\u0022 neighbor girl, sparking her curiosity about the outside world. This curiosity led her to run away at 17, aided by an “English” man who exploited and manipulated her. This marked the start of her tumultuous journey, which saw her become a stripper at 20, struggle with severe drug addiction, and ultimately resort to prostitution. Now, 27 years removed from her Amish upbringing, Naomi is clean, in a stable relationship, and a proud mother to a 3-year-old daughter, living peacefully in Arizona. She has found the freedom she always dreamed of—not just from the Amish community, but also from a life of addiction and exploitation. Naomi’s story is a testament to resilience, offering a powerful message of hope, perseverance, and the courage to create a better life. Tune in to hear Naomi\u0027s candid account of her transformation, her reflections on the Amish lifestyle, and her journey to reclaim her autonomy and happiness. Her story is not only a vivid portrayal of escape and survival but also an inspiring call to never give up on your dreams. Naomi\u0027s Contact Info: Naomi\u0027s TikTok: https://www.tiktok.com/@amishinspiration Naomi\u0027s Book: https://www.amazon.com/Amazing-Adventures-Amish-Stripper-Erotic/dp/B0CC7PKJY9/ref=sr_1_1?crid=69KTICD0P0Q8\u0026dib=eyJ2IjoiMSJ9.ElGsqF34-Wtf8X3rfEtbuw.9dEWLGEqLI31O5BOAvsqdpo0KH00gNGnRUb2_7j2XeA\u0026dib_tag=se\u0026keywords=the\u0026#43;amazing\u0026#43;adventures\u0026#43;of\u0026#43;an\u0026#43;amish\u0026#43;stripper\u0026#43;book\u0026qid=1721839830\u0026s=books\u0026sprefix=The\u0026#43;amazing\u0026#43;adventures\u0026#43;of\u0026#43;an\u0026#43;amish%2Cstripbooks%2C104\u0026sr=1-1 Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq",
      "release": "2024-09-01T11:30:25Z",
      "duration": "01:07:07.3240000",
      "explicit": true,
      "spotifyId": "0vSJkFPe73CNHecIY98mza",
      "appleId": 1000667956599,
      "youTubeId": "8hND3o8akik",
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0vSJkFPe73CNHecIY98mza",
        "apple": "https://podcasts.apple.com/podcast/ep-29-the-amazing-adventures-of-an-amish/id1744145655?i=1000667956599",
        "youtube": "https://www.youtube.com/watch?v=8hND3o8akik"
      }
    },
    {
      "id": "e52250c7-9088-4b11-9a09-2f0488ca81cd",
      "title": "Ep. #28 Awakening: Kim Peirano\u0027s Departure from the Foundation for Spiritual Development",
      "description": "Episode #28: Awakening: Kim Peirano\u0027s Departure from the Foundation for Spiritual Development\nJoin us on Cultimatium as we delve into the intriguing world of the Foundation for Spiritual Development, a Bay Area-based group masquerading as a spiritual school. Kim Peirano, a former member with eight years of experience, reveals the inner workings of this controversial organization. Despite their disclaimer, claiming they are not a cult, Kim’s journey paints a stark picture of manipulation and control.\nKim ascended to level 9.5 in their 10-level program, with level 5 remaining top secret. Members are discouraged from discussing their progress, fostering an atmosphere of secrecy and division. With a membership of just over 100, Kim describes a culture where questioning the group’s practices is not permitted, and hypnosis techniques are commonly used.\nAs a Doctor of Acupuncture and Chinese Medicine and a certified Hypnotherapist, Kim’s story is compelling. She details how members are bombarded with love bombing, making them feel exceptionally special, while charismatic leaders Dana and Eric, the second-in-command, maintain strict control. Members are expected to donate time, volunteer for various projects, and engage in expensive classes and retreats. The group’s teachings incorporate elements of Scientology, employing mind control techniques and the notorious mirroring exercise to manipulate and silence dissent.\nKim also discusses the group’s impact on her personal life and business post-exit. She explores the notion that cults provide meaning and fill voids, a lure that kept her ensnared for years. Tune in to hear Kim’s powerful insights.\nKim\u0027s Contact Info:\nWebsite: www.couragetotransform.com\nBook a free Discovery Call: https://calendly.com/couragetotransform\nTiktok: tiktok.com/@couragetotransform\nInstagram: instagram.com/couragetotransform\nCultimatum Contact Info:\nPodcast Contact info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCultimatum Pinterest account :\nhttps://pin.it/YdcAW0Oiq\nCult Escape \u0026 Recovery Support Group:\nhttps://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com",
      "release": "2024-08-25T16:30:16Z",
      "duration": "01:06:01",
      "explicit": false,
      "spotifyId": "3DnbvJCtBjLtvPJlzbRUbX",
      "appleId": 1000666550290,
      "youTubeId": "7UpkpcQeyAM",
      "subjects": [
        "Foundation for Spiritual Development"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3DnbvJCtBjLtvPJlzbRUbX",
        "apple": "https://podcasts.apple.com/us/podcast/ep-28-awakening-kim-peiranos-departure-from-the/id1744145655?i=1000666550290",
        "youtube": "https://www.youtube.com/watch?v=7UpkpcQeyAM"
      }
    },
    {
      "id": "829572c6-849a-4d41-89dc-6335cb8008fb",
      "title": "Why EP#4 is gone! Standing Strong Against Cult Intimidation",
      "description": "Editorial: When Silence is Forced – The Story Behind a Removed Episode You will notice a gap between episode 3 and episode 5. In this special editorial episode, we address the removal of a episode #4 at the request of a guest who courageously shared her story with us. Unfortunately, after the episode aired, she was subjected to severe intimidation and threats from the very cult she sought to expose. We stand in solidarity with her decision, recognizing the manipulative tactics and bullying behaviors these groups employ to silence truth and instill fear. This episode is a reflection on the power these organizations still wield, the importance of protecting those who speak out, and a commitment to continue shining a light on the darkness of cults. While this episode no longer remains in our archive, the conversation about the dangers of these groups is far from over. Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-08-24T21:42:03Z",
      "duration": "00:19:44.4700000",
      "explicit": true,
      "spotifyId": "1CbfsQjnKfWMCvM61PCXvB",
      "appleId": 1000666486290,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1CbfsQjnKfWMCvM61PCXvB",
        "apple": "https://podcasts.apple.com/podcast/why-ep-4-is-gone-standing-strong-against-cult-intimidation/id1744145655?i=1000666486290"
      }
    },
    {
      "id": "0776c655-d350-40a4-8240-17bc2d3be283",
      "title": "Ep. #27 Breaking the Silence: Elizabeth Quiroz’s Brave Journey as Our First Human Trafficking Survivor",
      "description": "Episode #27: Breaking the Silence: Elizabeth Quiroz’s Brave Journey as Our First Human Trafficking Survivor In this powerful episode, we are honored to have Elizabeth Quiroz, our first human trafficking survivor, sharing her story to bring hope and awareness to others. Elizabeth’s journey began with multiple types of abuse starting at just four years old. Due to the trauma, she sought love, acceptance, and attention from others, she eventually ended up in the foster care system. At 15, she moved in with her alcoholic father. Elizabeth highlights the red flags of human trafficking: not coming home at night, associating with older men, and avoiding eye contact by looking down. Elizabeth’s vulnerability was exploited by a boyfriend who groomed her and introduced her to drugs, leading her to become a drug mule. She explains that traffickers can be anyone, including women who pose as friends. Her second trafficker, a woman she trusted, further manipulated her. Elizabeth’s addiction to drugs led to repeated incarcerations and being labor trafficked by a drug dealer. Her life took a turn when she became pregnant; she got sober after giving birth, earned her GED in prison, and went into rehab after her release. Now an author and a social worker with a master’s in social justice and human rights, Elizabeth has written a book titled Purified in the Flame, available on Amazon. She is also the co-founder of Redemption House Bay Area in California. In this episode, Elizabeth explains some of the terms and vocabulary used in the human trafficking world and points out ways the system could improve to prevent more victims, such as implementing background checks and educating foster parents. We are immensely grateful to Elizabeth for sharing her story with us and shedding light on this critical issue. Link to Elizabeth\u0027s Book : https://www.amazon.com/Purified-Flame-Elizabeth-Quiroz/dp/1737254859 Link to Redemption House Bay Area Instagram: https://www.instagram.com/redemptionbayarea/ Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-08-18T17:11:06Z",
      "duration": "01:02:32.4110000",
      "explicit": false,
      "spotifyId": "7dN97Tbh9ucXCTxctfADZU",
      "appleId": 1000665795515,
      "youTubeId": "T6OOnM2ZykU",
      "subjects": [
        "Human Trafficking",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7dN97Tbh9ucXCTxctfADZU",
        "apple": "https://podcasts.apple.com/podcast/ep-27-breaking-the-silence-elizabeth-quirozs-brave/id1744145655?i=1000665795515",
        "youtube": "https://www.youtube.com/watch?v=T6OOnM2ZykU"
      }
    },
    {
      "id": "a5dd5516-7d5c-4c59-920c-b77ca60632d5",
      "title": "Breaking Free: Eleanor Skelton\u0027s Journey from Independent Fundamentalist Baptist (IFB) to Liberation",
      "description": "Episode #26: Breaking Free: Eleanor Skelton\u0027s Journey from Independent Fundamentalist Baptist (IFB) to Liberation\nIn this episode, we delve into the life and experiences of Eleanor Skelton, who grew up in the Independent Fundamentalist Baptist (IFB) movement. Eleanor, the oldest in her family, was first part of the Westwood Bible Church in Bouemount, Texas. Initially, she had a relatively normal church experience there. However, her family moved frequently between Texas and Colorado throughout her childhood.\nTheir first encounter with the IFB church was when they relocated to Colorado Springs. The environment in the IFB church was marked by intense mind control and an extreme intolerance for those who did not share the same religious or political views.\nEleanor was homeschooled for many years before attending college. Concerned that she was becoming too influenced by the outside world, her parents gave her an ultimatum: transfer to Bob Jones University, an institution known for its stringent and extreme orthodox teachings and rules, or face the consequences. This ultimatum became a pivotal moment for Eleanor. She chose not to attend Bob Jones University. As a result, her parents not only stopped paying for her education but also shunned her. Her younger siblings were forbidden from having any contact with her.\nToday, Eleanor is on a journey of recovery from religious trauma and an eating disorder. She continues to receive therapy and is making significant strides in her healing process. Articulate and well-adjusted, Eleanor shared her story with us, and it was a pleasure having her on the show.\n\nEleanor\u0027s Youtube Channel: https://www.youtube.com/channel/UC53ELsLgDAEqYn8ZmisMmWA\nEleanor\u0027s Blog : https://eleanorskelton.com/2015/01/09/whyileft-fundamentalism-part-1/\nVashti Initiative (ex-cult resource): https://vashtiinitiative.org/\nCultimatum Contact Info:\nPodcast Contact info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCultimatum Pinterest account :\nhttps://pin.it/YdcAW0Oiq\nCult Escape \u0026 Recovery Support Group:\nhttps://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com\nor visit\nwww.anonymousandrewpodcast.com",
      "release": "2024-08-11T22:29:20Z",
      "duration": "01:03:08",
      "explicit": false,
      "spotifyId": "5qRqFrPTBmoj6XLgeXIqsu",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qRqFrPTBmoj6XLgeXIqsu",
        "apple": "https://podcasts.apple.com/podcast/ep-26-breaking-free-eleanor-skeltons-journey-from-independent/id1744145655?i=1000664975752"
      }
    },
    {
      "id": "3c40657e-f877-4cfa-b570-fa308ad1efd9",
      "title": "Reimagining Faith: Karl \u0026 Laura Forehand\u0027s Journey from Baptist Roots to Co-Authors",
      "description": "Episode #25: Reimagining Faith: Karl \u0026 Laura Forehand\u0027s Journey from Baptist Roots to Co-Authors\nIn this insightful episode, we sit down with Karl \u0026 Laura Forehand, co-authors and former Baptist church leaders, to discuss their experiences and transformation. Karl served as a pastor in several Baptist churches over a span of 20 years, while Laura played the role of the supportive pastor\u0027s wife, raising their children and contributing to the church community.\nAfter two decades of ministry, Karl \u0026 Laura began to reevaluate their beliefs, embarking on a journey of healing from the spiritual damage they had endured. Through therapy and other healing methods, they have worked hard to mend the wounds inflicted by their past. \nDuring their time in one small Texas town, they encountered a pre-existing hierarchy that controlled not only the church but also the town itself. This power structure tested their resolve and made it clear who was truly in charge.\nKarl \u0026 Laura have channeled their experiences into their writing, authoring several books together. Their latest work, \u0022Evolving From Religious Trauma,\u0022 delves into their journey of recovery and offers insights for others seeking to heal from similar experiences.\nJoin us for a candid conversation with Karl and Laura Forehand as they share their story of transformation, resilience, and hope.\nKarl \u0026 Laura\u0027s website: https://thedesertsanctuary.org/\nKarl \u0026 Laura\u0027s 2nd website: https://thedesertsanctuary.org/treasure-trove/\nLink to Karl \u0026 Laura\u0027s First book together: https://www.amazon.com/Out-Into-Desert-Thriving-Organized/dp/1957007230\nLink to Karl \u0026 Laura\u0027s Latest Book: https://www.amazon.com/Evolving-Religious-Trauma-Karl-Forehand-ebook/dp/B0CWMJWY48/\nKarl \u0026 Laura\u0027s Podcast : https://open.spotify.com/show/1w6r6hGlE8aSBZXaNoOw0P?si=sDKGS1hpQFmG3BuLix6A2g\nCultimatum Contact Info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:https://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCult Escape \u0026 Recovery Support Group:https://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com",
      "release": "2024-08-03T18:36:21Z",
      "duration": "01:07:08",
      "explicit": false,
      "spotifyId": "3tzXrnDfeSge0vklmxN2mH",
      "appleId": 1000664237041,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3tzXrnDfeSge0vklmxN2mH",
        "apple": "https://podcasts.apple.com/podcast/reimagining-faith-karl-laura-forehands-journey-from/id1744145655?i=1000664237041"
      }
    },
    {
      "id": "81b66925-708a-49b8-a45f-fccc415a7fb8",
      "title": "Karinne\u0027s Journey out of  Jehovah\u0027s Witnesses",
      "description": "Episode #24: Karinne\u0027s Journey out of Jehovah\u0027s Witnesses\nIn this compelling episode, we delve into the life of Karinne, who shares her profound and often painful experiences as a member of Jehovah\u0027s Witnesses. Born into the faith, Karinne was the youngest in her family and often seen as the \u0022black sheep.\u0022 From the tender age of five, she endured abuse from church members, only to be dismissed and disbelieved by her mother and the congregation when she bravely spoke out.\nKarinne\u0027s adolescence was turbulent, marked by multiple departures from and returns to the group, each time accompanied by the harsh reality of being disfellowshipped. Ultimately, her breaking point came when faced with the organization\u0027s teaching that she must choose death over allowing her child to receive a life-saving blood transfusion. This heart-wrenching directive propelled Karinne to leave the faith for good, prioritizing the safety and protection of her child.\nDespite the hardships, Karinne ends her interview on a hopeful note, offering words of encouragement to others who have left the organization and are struggling to find their place in the world. Join us for an insightful and emotional conversation that sheds light on the complexities of life within and beyond Jehovah\u0027s Witnesses.\nKarinne \u0027s Instagram Link : https://www.instagram.com/girl_inshambles?igsh=ZHJ5YmgydWFsMDlw\nCultimatum Contact Info:\nPodcast Contact info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCultimatum Pinterest account :\nhttps://pin.it/YdcAW0Oiq\nCult Escape \u0026 Recovery Support Group:\nhttps://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com\nor visit\nwww.anonymousandrewpodcast.com",
      "release": "2024-07-28T16:06:41Z",
      "duration": "00:58:18",
      "explicit": false,
      "spotifyId": "2Bpi8glyxh1cuSJDjX0qRZ",
      "appleId": 1000663594968,
      "youTubeId": "QpmT6bXc5NM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Bpi8glyxh1cuSJDjX0qRZ",
        "apple": "https://podcasts.apple.com/podcast/karinnes-journey-out-of-jehovahs-witnesses/id1744145655?i=1000663594968",
        "youtube": "https://www.youtube.com/watch?v=QpmT6bXc5NM"
      }
    },
    {
      "id": "304e7f7a-9b56-4edf-9e99-fb1a3f492370",
      "title": "Danielle Storm\u0027s Journey out of TFU( Part 2)",
      "description": "Episode #23: Danielle Storm\u0027s Journey out of TFU( Part 2)\nIn this powerful follow-up episode, Danielle Storm continues her story, revealing the harrowing consequences of her time with Twin Flames Universe (TFU). Influenced by TFU\u0027s teachings, Danielle engaged in stalking behavior and failed to respect boundaries, leading to her spending 20 days in jail. Remarkably, Danielle has only been out of the cult for three weeks.\nShe candidly discusses how her jail time helped her detox from TFU\u0027s influence. Believing she had found her twin flame, Danielle was willing to go to any lengths, even to her own detriment. Her release from jail came with the condition from a family member that she must completely sever ties with TFU.\nDanielle has since been attending church and offers forgiveness to the person who was responsible for her incarceration. She is hopeful for leniency from the courts and is hoping that her public defense, will be able to explain her connection with TFU \u0026 shed light on her extreme and unusual behaviors that led to six restraining orders.\nShe emphasizes that TFU is a religious-based cult, frequently referencing God but not using the Bible. Currently, Danielle is receiving therapy and support as she transitions out of TFU.\nDanielle\u0027s final message to anyone involved with TFU or similar groups is urgent: \u0022GET OUT as soon as you can before it causes the kind of permanent damage that I am dealing with in my own life.\u0022\nTune in to Cultimatum to hear the rest of Danielle’s compelling journey and gain deeper insights into the profound impacts cults can have on individuals.\n\nDanielle\u0027s TikTok Link: https://www.tiktok.com/@itsjustdanii003?lang=en\nCultimatum Contact Info:\nPodcast Contact info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCultimatum Pinterest account :\nhttps://pin.it/YdcAW0Oiq\nCult Escape \u0026 Recovery Support Group:\nhttps://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com\nor visit\nwww.anonymousandrewpodcast.com",
      "release": "2024-07-21T01:57:19Z",
      "duration": "00:52:11",
      "explicit": false,
      "spotifyId": "3DO9NDkz14DwBjBwUPYVkm",
      "appleId": 1000662849706,
      "youTubeId": "BdBi-tHm-DM",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3DO9NDkz14DwBjBwUPYVkm",
        "apple": "https://podcasts.apple.com/us/podcast/danielle-storms-journey-out-of-tfu-part-2/id1744145655?i=1000662849706",
        "youtube": "https://www.youtube.com/watch?v=BdBi-tHm-DM"
      }
    },
    {
      "id": "5284635c-df33-419c-8cdb-f6c15a615a06",
      "title": "Danielle Storm, Former Member of Twin Flames Universe (Part 1)",
      "description": "Episode #22: Danielle Storm, Former Member of Twin Flames Universe\nIn this riveting episode, we sit down with Danielle Storm, a former member of Twin Flames Universe (TFU). Danielle\u0027s journey with the concept of a twin flame began in elementary school. However, it wasn\u0027t until later in life that she revisited this idea, eventually discovering TFU on YouTube around 2015. It wasn\u0027t until she became an adult in 2022 that she officially joined the group.\nDanielle delves into the techniques used by TFU, including MAP (Mind Alignment Process) and the mirror exercise. She shares how these methods began to severely impact her mental health, leading to self-harm. Danielle opens up about how her involvement with the group affected her relationships, family connections, and finances.\nAt its peak, TFU had around 25,000 followers, but following the release of documentaries about the group, its popularity surged to approximately 50,000 members. Ironically, the documentaries intended to expose TFU ended up promoting it, drawing more people in.\nWe conclude this episode with Danielle recounting how she ultimately ended up in jail due to TFU\u0027s teachings. To hear the rest of Danielle\u0027s story, stay tuned for part two of our interview.\nTune in to Cultimatum for this compelling story and more insights into the world of cults and their impact on individuals.\n\nDanielle\u0027s TikTok Link: https://www.tiktok.com/@itsjustdanii003?lang=en\nCultimatum Contact Info:\nPodcast Contact info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:\nhttps://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page:\nhttps://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account :\nhttps://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCultimatum Pinterest account :\nhttps://pin.it/YdcAW0Oiq\nCult Escape \u0026 Recovery Support Group:\nhttps://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com\nor visit\nwww.anonymousandrewpodcast.com",
      "release": "2024-07-13T18:27:40Z",
      "duration": "00:50:39",
      "explicit": false,
      "spotifyId": "5zbLtUR02CNXhPH2vTCq8j",
      "appleId": 1000662124663,
      "youTubeId": "7hswG2eF7VE",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5zbLtUR02CNXhPH2vTCq8j",
        "apple": "https://podcasts.apple.com/us/podcast/danielle-storm-former-member-of-twin-flames-universe-part-1/id1744145655?i=1000662124663",
        "youtube": "https://www.youtube.com/watch?v=7hswG2eF7VE"
      }
    },
    {
      "id": "bd94e003-df46-4f22-a98d-1cdb43640003",
      "title": "Interview with Nick Johnson - Life Inside the Israelite Church of God in Jesus Christ",
      "description": "Episode #21: Interview with Nick Johnson - Life Inside the Israelite Church of God in Jesus Christ In Episode #21, we delve into the compelling and complex story of Nick Johnson, a former member of the Israelite Church of God in Jesus Christ. Nick\u0027s journey into the cult began at the young age of 20, introduced by a neighbor. The group, which aligns with the beliefs of the Black Hebrew Israelite movement, strategically targets young individuals to draw them into its fold. The leader during most of Nick\u0027s tenure was Jermaine Grant, who later faced charges for church-related financial schemes. Although Grant pleaded guilty, he passed away from COVID-19 before sentencing. Throughout his time in the church, Nick devoted countless hours to \u0022volunteering\u0022 in various capacities, often at the expense of his family life. The rigorous demands left him with barely enough time to sleep, adhering to the leader’s directive that four hours of sleep per night was optimal. The Israelite Church of God in Jesus Christ has numerous locations in major cities along the East Coast of the U.S. Nick provides a detailed account of the church\u0027s doctrines, the profound impact on his personal and family life, and the internal dynamics that shaped his experience. In this episode, Nick also shares his current beliefs and how he has rebuilt his life post-cult. His story is a powerful testament to his resilience. Tune in as Nick Johnson reveals the intricacies of life within the Israelite Church of God in Jesus Christ, offering a rare and enlightening perspective on the challenges faced by those entangled in and eventually breaking free from cultic control. Nick\u0027s Instagram Link: https://www.instagram.com/nickbuckets19?igsh=OHNpZ2xyeml3OXN2 Nick\u0027s Facebook Link: https://www.facebook.com/nicholas.johnson.311?mibextid=ZbWKwL Link to Nick\u0027s shirt line on Instagram : https://www.instagram.com/cultsaintculture?igsh=NmkwYzVlMmczc3Fs Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-07-07T16:55:22Z",
      "duration": "00:53:35.9340000",
      "explicit": false,
      "spotifyId": "1XOfMjT7AzcExjauOVMK9X",
      "appleId": 1000661450292,
      "youTubeId": "KmeX3oj7Zqo",
      "subjects": [
        "Black Hebrew Israelites"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1XOfMjT7AzcExjauOVMK9X",
        "apple": "https://podcasts.apple.com/podcast/interview-with-nick-johnson-life-inside-the/id1744145655?i=1000661450292",
        "youtube": "https://www.youtube.com/watch?v=KmeX3oj7Zqo"
      }
    },
    {
      "id": "6f6e5124-209c-4e49-a714-792fa6f25ff4",
      "title": "Life After La Luz Del Mundo, With Judith Castillo",
      "description": "Episode #20: Interview with Judith Castillo - Life After La Luz Del Mundo Judith, a former member of the controversial religious group La Luz Del Mundo. Despite her family\u0027s deep devotion and dedication, she faced many personal challenges within the organization, which has its headquarters in Guadalajara, Mexico, and branches worldwide, including many across the US. During her early teens, she encountered the grandson of the church\u0027s leader. A coercive indiscretion with him led to a forced marriage, accompanied by severe punishment from the church for their so-called sin. Her breaking point came when she discovered that her daughter had been a victim of abuse by another church member. This revelation drove Judith to leave the church and start speaking out against the abuses perpetuated by the organization. She began protesting in front of the church, demanding justice for herself, her daughter, and others who suffered similar fates. Join us as Judith Castillo shares her powerful story of endurance, courage, and advocacy. Her narrative not only exposes the dark underbelly of La Luz Del Mundo but also highlights the indomitable human spirit\u0027s capacity for healing and fighting for justice. Judith Castillo Judith\u0027s Facebook Link: https://www.facebook.com/judith.castillo Judith\u0027s Amazon Book Link: https://www.amazon.com/dp/B0D6WJ3H3P?ref=cm_sw_r_apan_dp_2F24C1R0FSAPFA4MXH4Z\u0026ref_=cm_sw_r_apan_dp_2F24C1R0FSAPFA4MXH4Z\u0026social_share=cm_sw_r_apan_dp_2F24C1R0FSAPFA4MXH4Z\u0026language=en-US Judith\u0027s TikTok Link: https://www.tiktok.com/@lachicanita29/video/7379983855660420394?_r=1\u0026_t=8nKlXjjaETS Cultimatum Contact Info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg== Cultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1 Cultimatum Pinterest account : https://pin.it/YdcAW0Oiq Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-29T21:22:03Z",
      "duration": "01:06:42.0630000",
      "explicit": false,
      "spotifyId": "1Hkm42TNChCsMsx56hA67y",
      "appleId": 1000660653117,
      "youTubeId": "ZKi-0TJgBeQ",
      "subjects": [
        "La Luz Del Mundo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Hkm42TNChCsMsx56hA67y",
        "apple": "https://podcasts.apple.com/podcast/life-after-la-luz-del-mundo-with-judith-castillo/id1744145655?i=1000660653117",
        "youtube": "https://www.youtube.com/watch?v=ZKi-0TJgBeQ"
      }
    },
    {
      "id": "5f5787c9-7806-4f92-9304-82dbf0e42f08",
      "title": "Escaping the Shadows – An Interview with Lucia Muir, Former Jehovah\u0027s Witness",
      "description": "Ep #19: Escaping the Shadows – An Interview with Lucia Muir, Former Jehovah\u0027s Witness\nIn this riveting episode, we sit down with Lucia Muir, a former member of the Jehovah\u0027s Witnesses, who was born into the organization and endured a harrowing journey of abuse, trauma, and shunning. Lucia\u0027s story is one of repeated attempts to break free, only to be pulled back into the grips of the organization throughout her life.\nLucia shares her painful experiences, including childhood abuse by a family member. Tragically, when she sought help, both her parents and the church sided with her abuser, branding her a liar. This led to tumultuous teenage years where she found herself isolated and unsupported.\nIn an attempt to escape her dire situation, Lucia married at just 17, only to find herself in another controlling and abusive relationship. Throughout these struggles, Lucia also endured years of mistreatment by her mentally ill mother before finally leaving her oppressive environment.\nJoin us as we explore Lucia\u0027s incredible story of resilience and recovery. This episode is not just a testament to her strength but also a beacon of hope for anyone struggling to find light after the darkness of cultic control.\nLucia\u0027s website : https://luciamuirbooks.wordpress.com/counsellor/\nLucia\u0027s Facebook page : https://www.facebook.com/profile.php?id=100093150242973\nLucia\u0027s book on Amazon: https://www.amazon.com/Let-Your-Light-Shine-Secrets/dp/B0C4ZXGP1Y/ref=sr_1_1?crid=1XFRAXRLFM5GP\u0026dib=eyJ2IjoiMSJ9.ird-5HtsL_FffyNarkiHABRYlaNjKmWZvUUqa4LpVOg.VU4yn5uQsHVoWWfEy8osvKw5hAUQTW4bWqnDgca4F3c\u0026dib_tag=se\u0026keywords=let\u002Byour\u002Blight\u002Bshine\u002Blucia\u002Bmuir\u0026qid=1717867829\u0026sprefix=let\u002Byou\u002Blight\u002Bshine\u002Blucia%2Caps%2C302\u0026sr=8-1\nCultimatum Contact Info:\nEmail: cultimatumpodcast@gmail.com\nCultimatum Facebook Group:https://www.facebook.com/groups/1910498486077283\nCultimatum Instagram page: https://www.instagram.com/cultimatumpodcast?igsh=MXBnNXllYjBtc2hwcg==\nCultimatum TikTok account : https://www.tiktok.com/@cultimatumpodcast?_t=8nLKfZ8ShnW\u0026_r=1\nCultimatum Pinterest account :https://pin.it/YdcAW0Oiq\nCult Escape \u0026 Recovery Support Group:https://www.facebook.com/groups/2575419069406501\nTo contact the Anonymous Andrew Podcast Studios\nanonymousandrewpodcast@gmail.com\nor visit\nwww.anonymousandrewpodcast.com",
      "release": "2024-06-23T10:00:52Z",
      "duration": "01:02:32",
      "explicit": false,
      "spotifyId": "1UHVCF3UfVMa2yEI7fafDR",
      "appleId": 1000659943163,
      "youTubeId": "acO4y4pduLQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1UHVCF3UfVMa2yEI7fafDR",
        "apple": "https://podcasts.apple.com/podcast/escaping-the-shadows-an-interview-with-lucia/id1744145655?i=1000659943163",
        "youtube": "https://www.youtube.com/watch?v=acO4y4pduLQ"
      }
    },
    {
      "id": "5589df66-2bc7-45d5-8270-e2c46376cbe8",
      "title": "Interview With Ex-Cult Member Anonymous Franklin",
      "description": "Cultimatum Ep#18 : Growing Up in Another Cult with Franklin Originally aired on the Anonymous Andrew podcast in February 2024. Original Description: Ep#39: Series #6 - Franklin\u0027s Story In Series #6 of the TFU Pod-series, Franklin (anonymous name) comes forward to share his experience growing up in a cult that his parents belonged to. This is not an ex-member of TFU but another cult. However, he was triggered by the publicity of TFU and wants to share how much it impacts him today, many years later. Franklin shares his experience growing up in a cult and his thoughts and opinions on TFU. This is one of the books Franklin referred to Extraordinary Popular Delusions and The Madness of Crowds: All Volumes - Complete and Unabridged Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-16T17:40:38Z",
      "duration": "01:08:15.6860000",
      "explicit": false,
      "spotifyId": "3uyOiDxTHyPcsEoB6SrwL9",
      "appleId": 1000659184389,
      "youTubeId": "proLty0Ub_s",
      "subjects": [
        "Saint Germain Foundation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uyOiDxTHyPcsEoB6SrwL9",
        "apple": "https://podcasts.apple.com/podcast/interview-with-ex-cult-member-anonymous-franklin/id1744145655?i=1000659184389",
        "youtube": "https://www.youtube.com/watch?v=proLty0Ub_s"
      }
    },
    {
      "id": "8b339c82-f1b0-48c4-81ba-c61aee2a1ba5",
      "title": "Paulette Buchanan\u0027s  Journey Against Cult Leaders",
      "description": "Ep#17 Summary: Paulette\u0027s Journey Against Cult Leaders In this compelling episode, we delve into the extraordinary story of Paulette, a resilient individual who has faced significant challenges due to her brother\u0027s involvement in an online cult. Her brother, struggling with mental illness, became a cult leader, leading Paulette to endure years of harassment, threats, and frivolous lawsuits. Key Discussion Points: The Need for Licensing of Leaders: Paulette advocates for the licensing of leaders in religious, self-help, and spiritual groups. She discusses how cult leaders often misuse religion to evade accountability and taxes. Understanding Cults: With a wealth of knowledge about cults and their leaders, Paulette provides insights into how these groups operate. She emphasizes the importance of educating the public on the mechanisms of cults. Failures of Law Enforcement and Government Agencies: Paulette critiques the inadequate response of law enforcement and government agencies in addressing the threats posed by cults. She calls for increased responsibility and action from these institutions to protect society. Paulette\u0027s Resilience and Advocacy: Despite her struggles, Paulette remains positive and continues her advocacy work. She shares details about her book, offering a deeper look into her experiences and the strength she has found to keep moving forward. Join us in this episode as Paulette provides a profound and educational perspective on the dangers of cults, the need for better regulatory measures, and the strength required to fight against such adversities. Paulette\u0027s Book on Amazon: https://www.amazon.com/Fighting-Justice-Religious-Illness-Collapse-ebook/dp/B09MXSKD4N Paulette\u0027s Book Website: https://fightingforjusticebook.com/ Paulette\u0027s Website against abusive lawsuits: https://stopabusivelawsuits.com/ Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-15T12:00:26Z",
      "duration": "01:10:11.5910000",
      "explicit": false,
      "spotifyId": "38YEomKKigpAshmZlP0eVt",
      "appleId": 1000659105690,
      "youTubeId": "rdB5rMVsONY",
      "subjects": [
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38YEomKKigpAshmZlP0eVt",
        "apple": "https://podcasts.apple.com/podcast/paulette-buchanans-journey-against-cult-leaders/id1744145655?i=1000659105690",
        "youtube": "https://www.youtube.com/watch?v=rdB5rMVsONY"
      }
    },
    {
      "id": "cd1be4c0-9f62-44ba-8273-3f9834fd4ccd",
      "title": "Exploring Twin Flames Universe and NXIVM with Ellen",
      "description": "Cultimatum Ep#16 : Exploring Twin Flames Universe and Nexium Originally aired on the Anonymous Andrew podcast in February 2024. Original Description: Ep#41: Taking a Break and Exploring New Avenues I have released 6 episodes (This will be number 7) on the Twin Flames Universe Cult. I am going to take a break from that as I wait for more guests and information to come in. This was an impromptu endeavor. I have some people working on getting more guests and information. If all that pans out I will do a Part 2. On today\u0027s episode, I may look into other cults; this is a work in progress. I am still working on healing myself and learning how to go back out into the dating world. I have many episodes to bring you. Stay tuned! 2024 is just getting started! Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-09T18:00:27Z",
      "duration": "00:47:54.1220000",
      "explicit": false,
      "spotifyId": "7tVTFoTp5pt9gqcCJQTqU0",
      "appleId": 1000658372721,
      "youTubeId": "X6FkNOxWeYw",
      "subjects": [
        "Twin Flames Universe",
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tVTFoTp5pt9gqcCJQTqU0",
        "apple": "https://podcasts.apple.com/podcast/exploring-twin-flames-universe-and-nxivm-with-ellen/id1744145655?i=1000658372721",
        "youtube": "https://www.youtube.com/watch?v=X6FkNOxWeYw"
      }
    },
    {
      "id": "1e00729a-caac-42d9-ac00-e5472c440447",
      "title": "The Cult Story Never Told  Part 2 with Ari Sherwood",
      "description": "Ep#15 (Part 2): Ari\u0027s Deeper Dive into Her Cult Experience In this follow-up episode, Ari returns to delve deeper into the intricacies of her experience with the shaman and doomsday cult. She provides an in-depth look at the leader, his past, and the bizarre teachings that held the group in thrall. The Leader\u0027s Manipulative Tactics Ari describes the leader\u0027s complex persona, from his claims of being a former member of a Satanic cult to his subsequent assertions of being Jesus. She reveals how he manipulated members by planting false memories, including supposed past lives and alien abductions. Control and Coercion Ari explains the coercive techniques the leader used to maintain control over her and others. His grandiose claims and persuasive tactics created an environment of fear and dependency. Ari’s detailed account sheds light on the psychological manipulation and abuse within the cult. Understanding the Cult Dynamics Through Ari\u0027s story, we gain a deeper understanding of how such a leader can exert immense control over his followers. Her narrative highlights the importance of recognizing and addressing the signs of such manipulative and coercive behavior. Join us as Ari bravely shares more about her journey, offering invaluable insights into the workings of a cult and the enduring strength it takes to break free. Podcast Link coming soon! Ari\u0027s Instagram : https://www.instagram.com/intrinsicagency/ Ari\u0027s TikTok : https://www.tiktok.com/@disallusioned8?lang=en Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-08T16:14:08Z",
      "duration": "01:06:00.4500000",
      "explicit": false,
      "spotifyId": "7vy2grGGXDTozB5efnttGP",
      "appleId": 1000658269855,
      "youTubeId": "RlEr2VXVYwA",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vy2grGGXDTozB5efnttGP",
        "apple": "https://podcasts.apple.com/podcast/the-cult-story-never-told-part-2-with-ari-sherwood/id1744145655?i=1000658269855",
        "youtube": "https://www.youtube.com/watch?v=RlEr2VXVYwA"
      }
    },
    {
      "id": "4058763b-a736-412c-b076-91b94158dcb8",
      "title": "Twin Flames Universe Discussion with Alana MaKenzie",
      "description": "Cultimatum Ep#14 : Dissecting the Twin Flames Universe Cult with Alana McKenzie Initially broadcasted on the Anonymous Andrew Podcast in February of 2024, this episode delves into the captivating realm of the Twin Flames Universe Cult with the esteemed Sovereign Dating Coach, Alana McKenzie. Renowned for her profound understanding of feminine energy dynamics, McKenzie and I embark on a thought-provoking exploration of the TFU cult. Together, we meticulously dissect the enigmatic concept of a \u0022twin flame,\u0022 interrogating its existence and relevance in contemporary discourse. Original Description: Ep#36: Exploring the Twin Flames Universe Cult with Alana McKenzie Sovereign Dating Coach Alana McKenzie joins me to discuss the Twin Flames Universe Cult. She is an expert on feminine energy. We go deep in discussion about the TFU cult. Alana and I discuss the concept of a \u0022twin flame\u0022—is there really such a thing? Alana\u0027s Information: website: https://www.sovereign-dating.com/ Facebook: https://www.facebook.com/sovereigndating IG: https://www.instagram.com/sovereigndating/ YouTube: https://www.youtube.com/channel/UCLSDMJAIRm11j8FRP4-Nrsw Linkedin: https://www.linkedin.com/in/alana-mckenzie-page-a3262073 Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-02T22:05:29Z",
      "duration": "01:02:30.9220000",
      "explicit": false,
      "spotifyId": "7HCPNAD6J0WtTelgDl3nNZ",
      "appleId": 1000657597202,
      "youTubeId": "Ihkn_e66rGo",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7HCPNAD6J0WtTelgDl3nNZ",
        "apple": "https://podcasts.apple.com/podcast/twin-flames-universe-discussion-with-alana-makenzie/id1744145655?i=1000657597202",
        "youtube": "https://www.youtube.com/watch?v=Ihkn_e66rGo"
      }
    },
    {
      "id": "d900c3bb-ac44-4d7e-baad-d69836258b70",
      "title": "The Worldwide Church of God -Interview With Ex-Member Cherie",
      "description": "Episode #13: Cherie joins us to share her experience of being raised in the Worldwide Church of God (currently called Grace Communion International). This is an organization started by Herbert W. Armstrong in 1933. She shares her thoughts on being brainwashed and disfellowshipped. Cherie also gives insight into the after effects of leaving such a controlling group, including her struggles with anxiety and feelings of being lost. You will hear how Cherie chose to raise her own children in contrast to how she was raised. It is in this episode that we learn about Cherie\u0027s healing journey and the Facebook support group she created so that other survivors can find support and guidance. Cherie\u0027s Facebook support group Cult survivors from Worldwide church of God, and their offshoots https://www.facebook.com/share/wZwPqs27KjCkc1nV/?mibextid=A7sQZp Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-31T17:19:28Z",
      "duration": "01:02:32.4110000",
      "explicit": false,
      "spotifyId": "6vpjma6zWlV8P5uAYS8MvU",
      "appleId": 1000657437481,
      "youTubeId": "idUL8aKS2V4",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6vpjma6zWlV8P5uAYS8MvU",
        "apple": "https://podcasts.apple.com/podcast/the-worldwide-church-of-god-interview-with-ex-member-cherie/id1744145655?i=1000657437481",
        "youtube": "https://www.youtube.com/watch?v=idUL8aKS2V4"
      }
    },
    {
      "id": "23290d83-3fe6-4340-9ab1-405081abd8a2",
      "title": "Author \u0026 Cult Survivor Kimalee Finelli, Cross Independent Baptist Church",
      "description": "Episode #12 In this episode Kimalee shares what it was like for her and her family growing up in the Cross Independent Baptist church in a small town. The Reverend of the church taught that he had been placed in authority directly by God. To question him was equivalent to questioning God himself. She shares how she left, her path to healing, what she believes and where she is today. Aside from that, Kimalee discusses her book, based on her own experiences. Kimalee\u0027s Info: A direct link to Kimalee\u0027s book Under Authority: https://amzn.to/3KYm3oc Her website: www.kimaleefinelli.com Facebook link : https://www.facebook.com/Kimalee.Finelli Instagram: https://www.instagram.com/kimaleefinelli/ Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-27T17:51:10Z",
      "duration": "00:47:05.0900000",
      "explicit": false,
      "spotifyId": "53B13fUBXdj128VQT7Jui1",
      "appleId": 1000656947807,
      "youTubeId": "4xBwKcZF3es",
      "urls": {
        "spotify": "https://open.spotify.com/episode/53B13fUBXdj128VQT7Jui1",
        "apple": "https://podcasts.apple.com/podcast/author-cult-survivor-kimalee-finelli-cross-independent/id1744145655?i=1000656947807",
        "youtube": "https://www.youtube.com/watch?v=4xBwKcZF3es"
      }
    },
    {
      "id": "53fb6b65-898d-4fee-af7c-7544d35333b9",
      "title": "TFU-Sarah shares her TFU experience",
      "description": "Ep#11 Like Laura, Sarah shares her knowledge about the real concept of Twin Flames and How TFU is making a mockery of the concept Please bare with us as we migrate all the shows from Anonymous Andrew to Cultimatum! Original description of this episode from Anonymous Andrew Podcast Ep#30 I invite on a member of one of the Facebook groups that have started supporting the families and ex -members and friends of people who are still in the cult. As promised I am doing an in depth investigation into TFU, supporting the people who have been effected by this disgraceful organization. Todays guest shares her story of her Twin Flame relationship and how it is nothing like what is promised by TFU. If you or anyone you know would like to be part of this journey of exposing further TFU please contact me. You can also join the Facebook groups: Escaping Twin Flames Discussion Group \u0026 Twin Flames Universe Exposed where there are thousands of members supporting those who are family members who are cutoff from their sons and daughters still in the cult and anyone who got out. I would like to thank Anonymous Sarah for sharing her story. She cannot be contacted hence the anonymity! Cultimatum Contact Info: Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-26T20:07:03Z",
      "duration": "00:52:15.6860000",
      "explicit": false,
      "spotifyId": "32AQZsi2m1qlgZPJQFnFUX",
      "appleId": 1000656824041,
      "youTubeId": "5cQBSUPJkG8",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/32AQZsi2m1qlgZPJQFnFUX",
        "apple": "https://podcasts.apple.com/podcast/tfu-sarah-shares-her-tfu-experience/id1744145655?i=1000656824041",
        "youtube": "https://www.youtube.com/watch?v=5cQBSUPJkG8"
      }
    },
    {
      "id": "7f289e90-5a0d-4004-9aa4-3d9fe2beb825",
      "title": "The Message Cult with Rebekah",
      "description": "EP#10 The Message Cult. Rebekah shares her story. This episode was difficult to record \u0026 listen to. Extra trigger warning on this one! We want to thank Rebekah very much for her courage to tell her story! Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-24T16:01:03Z",
      "duration": "01:10:22.0140000",
      "explicit": false,
      "spotifyId": "2AW4hsuIcx4lOesc4vpekW",
      "appleId": 1000656660117,
      "youTubeId": "hNlMd7_APas",
      "subjects": [
        "William M. Branham"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AW4hsuIcx4lOesc4vpekW",
        "apple": "https://podcasts.apple.com/podcast/the-message-cult-with-rebekah/id1744145655?i=1000656660117",
        "youtube": "https://www.youtube.com/watch?v=hNlMd7_APas"
      }
    },
    {
      "id": "4561a9f1-84a8-46a0-b873-7aa7c3e47651",
      "title": "Let Us Prey-Jessica-IFB",
      "description": "Ep#9 This episode previously aired on Anonymous Andrew Podcast. Jessica shares her story about IFB Here is the original description: Ep#59 In this Cultimatum episode, Jessica shares her story and experience in the IFB or Independent Fundamental Baptist (movement). \u0022Let us Prey\u0022 is a docuseries about this scandalous cult. Melody co-hosts as we talk to Jessica about her escape and her journey healing the trauma she endured as a member of this cult. There is a trigger warning as the subject of sexual abuse \u0026 rape comes up! I want to thank Jessica very much for her bravery to share this horrible experience. I am doing this pod-series as I had no idea how many of these cults are out there. How many people have been affected by them. I am thinking of dedicating a new Podcast to Cults and human trafficking survivors and deep divers into this dark world. Stay tuned for updates on that thought Cultimatum: a pod series dedicated to those survivors of cults and human trafficking is hosted by Anonymous Andrew \u0026 Melody. I want to thank Melody for her time and work behind the scenes. She runs a facebook group for cult survivors called Cult Escape \u0026 Recovery Support Group. If you would like to share your story of escaping a cult or human trafficking-please contact us below. Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-19T19:43:58Z",
      "duration": "01:08:58.7880000",
      "explicit": false,
      "spotifyId": "6H0aaP3XpA9I6EmnbazGN1",
      "appleId": 1000656074387,
      "youTubeId": "y2q-F9oTcVY",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6H0aaP3XpA9I6EmnbazGN1",
        "apple": "https://podcasts.apple.com/podcast/let-us-prey-jessica-ifb/id1744145655?i=1000656074387",
        "youtube": "https://www.youtube.com/watch?v=y2q-F9oTcVY"
      }
    },
    {
      "id": "815ca85b-26e2-4d17-88d1-4145b772958f",
      "title": "The Cult Story Never Told-Ari Sherwood",
      "description": "Ep#8 One doesn\u0027t have to belong to a large cult, or a known cult to escape or to be traumatized. Ari was pulled in to a shaman and doomsday cult. A cult with no name. Her story is quite amazing and so is Ari! This episode contains both cult and human trafficking subject matter. Ari is starting her own podcast. She is also coming back to do a part 2 to her story. I want to thank Ari for coming forward and wish her success on her new podcast! If you would like to share your story of escaping a cult or human trafficking-please contact us below. Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-18T11:00:36Z",
      "duration": "00:57:36.6790000",
      "explicit": false,
      "spotifyId": "4vXrNKe9ldHlldGQELW1ML",
      "appleId": 1000655995406,
      "youTubeId": "RO0BuUyL5vo",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vXrNKe9ldHlldGQELW1ML",
        "apple": "https://podcasts.apple.com/podcast/the-cult-story-never-told-ari-sherwood/id1744145655?i=1000655995406",
        "youtube": "https://www.youtube.com/watch?v=RO0BuUyL5vo"
      }
    },
    {
      "id": "e54e260b-8be7-4b37-a7dd-054a16b32167",
      "title": "Who is Megan Plante? High school friend share her memories!",
      "description": "Ep# 6-A high school friend shares what Megan Plante (Shaleia) was like in her HS years. This episode is available on YouTube with pictures of Megan from HS. Lest anyone think I have sympathy for Megan, I do not, this is just a peek into her background and what leads someone from going from an introvert to a cult leader. You can view it here: https://www.youtube.com/@anonymousandrewpodcast The Facebook groups that have helped and supported the project are: Twin Flames Universe Exposed https://www.facebook.com/groups/709424757504933 \u0026 Escaping the twin Flames Discussion Group https://www.facebook.com/groups/678696511031522 To contact me if you wish to be on the podcast to share anything you have about this topic is my info: Cultimatum Contact Info: Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-13T10:01:00Z",
      "duration": "00:49:06.9510000",
      "explicit": false,
      "spotifyId": "2iTWJ3QDpZFtkxB1k5OyIj",
      "appleId": 1000655400509,
      "youTubeId": "GO_4-yQ3vHs",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2iTWJ3QDpZFtkxB1k5OyIj",
        "apple": "https://podcasts.apple.com/podcast/who-is-megan-plante-high-school-friend-share-her-memories/id1744145655?i=1000655400509",
        "youtube": "https://www.youtube.com/watch?v=GO_4-yQ3vHs"
      }
    },
    {
      "id": "11f80d97-8188-453b-9ae3-b9e267989f2c",
      "title": "Potter\u0027s-House-CFM-with Mandy",
      "description": "Ep#6 On this episode, (Original Cultimatum) Melody \u0026 I talk with Mandy, an ex-cult member and survivor of \u0022The Potter\u0027s House Christian Fellowship Ministries (CFM)\u0022 also known as the Christian Fellowship Ministries, They are a religious group that exhibits cult-like behaviors and practices, We would like to thank Mandy for her strength and courage to speak out! If you would like to share your story of escaping a cult-please contact us below. Cultimatum Contact Info: Podcast Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-12T15:44:24Z",
      "duration": "00:59:25.1650000",
      "explicit": false,
      "spotifyId": "5VbgJ6NGi5pCkhY8fLKYrC",
      "appleId": 1000655323957,
      "youTubeId": "_NNGYYih424",
      "subjects": [
        "Potter\u0027s House Christian Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5VbgJ6NGi5pCkhY8fLKYrC",
        "apple": "https://podcasts.apple.com/podcast/potters-house-cfm-with-mandy/id1744145655?i=1000655323957",
        "youtube": "https://www.youtube.com/watch?v=_NNGYYih424"
      }
    },
    {
      "id": "acf07211-393b-4d07-87ba-79a181c47635",
      "title": "Oh No what have I done?  I rented a room to Jeff \u0026 Shaleia",
      "description": "EP#5 This is an original recording I did with a woman named Kat who rented a room to Jeff \u0026 Shaleia from TFU prior to when they started TFU. Below is the original description! Even the cover art is the original! EP#34 On this episode, we chat with a woman who rented a \u0022room\u0022 to Jeff \u0026 Shaleia back in 2016. At that time they were nobody. (Ok maybe still are?) At the time she had no idea who they were to become. This took place in Michigan (where they are based) but of course they hadn\u0027t started TFU yet. They were just two wandering nomads (double entendre) going from motel to house to car and in circles. You have got to hear this story. A great peak into the mindset of Jeff, possibly the most disturbed individual of our modern times. (Ok maybe some political figures and leaders of nations take that cake) But you can really get a picture of his goal to be a dominant figure in his demented world! I need more stories like this, so if you knew either of them prior to TFU please contact me. Of course you can be anonymous. After all this is the Anonymous Andrew Podcast! I want to thank Kat for stepping forward and sharing this experience with us.! Podcast Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-05T21:05:30Z",
      "duration": "00:58:06.4060000",
      "explicit": false,
      "spotifyId": "1F3qcwyUK73chtdvBvznje",
      "appleId": 1000654605619,
      "youTubeId": "gUm9I8Lk7IQ",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1F3qcwyUK73chtdvBvznje",
        "apple": "https://podcasts.apple.com/podcast/oh-no-what-have-i-done-i-rented-a-room-to-jeff-shaleia/id1744145655?i=1000654605619",
        "youtube": "https://www.youtube.com/watch?v=gUm9I8Lk7IQ"
      }
    },
    {
      "id": "d0100a06-e8ae-4a63-a8bd-571ae949a728",
      "title": "Is Jehovah Witness a cult? We Think So and so does former Elder Gary",
      "description": "Ep#3 Jehovah Witness, we all know them. They come knocking on our doors every Sunday morning. Are they considered a cult? We speak with Gary a former member of JW for 40 years and was an elder. Gary shares his story of being in JW and how his life is today and his thoughts on whether they are a cult. Cultimatum Contact info Email: cultimatumpodcast@gmail.com Facebook: https://www.facebook.com/groups/1910498486077283 Facebook Cult Escape \u0026 Recovery Support Group\u0022 If you are a survivor or escaped a cult or a Human Trafficking Situation, and would like to share your story we would love to hear from you. Cultimatum is a safe haven for you. We would love to hear from you. Join our Cultimatum cult support group on Facebook or Melody\u0027s group \u0022Cult escape \u0026 recovery Support Group\u0022",
      "release": "2024-05-03T10:52:54Z",
      "duration": "01:18:14.7780000",
      "explicit": false,
      "spotifyId": "6DzbBRZGdVRjjSnGJn9U1j",
      "appleId": 1000654424896,
      "youTubeId": "SMwH7tGhLdA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6DzbBRZGdVRjjSnGJn9U1j",
        "apple": "https://podcasts.apple.com/podcast/is-jehovah-witness-a-cult-we-think-so-and-so/id1744145655?i=1000654424896",
        "youtube": "https://www.youtube.com/watch?v=SMwH7tGhLdA"
      }
    },
    {
      "id": "54bfe330-46c6-43e2-b312-63290d73d13f",
      "title": "Melody My co-host shares her Cult Escape \u0026 Survival story.",
      "description": "Ep#2 My co-host Melody is interviewed. This was recorded before we teamed up and was aired on Anonymous Andrew Podcast. But as all the cults recording belong here now we are moving them over slowly and methodically. So Melody will kick off the podcast will her story.. Until we have all the epsiodes moved over and add some new ones, It may seem a little chaotic as Melody is my co-host in some of them but going forward she ill be in most if not all of them. I want to thank Melody as she has been amazing at helping me start this podcast. This is not just my podcast but melody\u0027s too, So sit back and listen to Melody story. And away we go! Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-02T00:44:57Z",
      "duration": "00:51:45.9590000",
      "explicit": true,
      "spotifyId": "7puOGctHv2EI8O6jLpqvup",
      "appleId": 1000654234064,
      "youTubeId": "_CxwNj92hrs",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7puOGctHv2EI8O6jLpqvup",
        "apple": "https://podcasts.apple.com/podcast/melody-my-co-host-shares-her-cult-escape-survival-story/id1744145655?i=1000654234064",
        "youtube": "https://www.youtube.com/watch?v=_CxwNj92hrs"
      }
    },
    {
      "id": "4d97a40b-4512-4a0a-8cae-ba77bc627402",
      "title": "Cultimatum-The Culture of Cults-Pilot",
      "description": "Ep#1 PILOT. From the studio of Anonymous Andrew Podcast we bring to you a podcast dedicated to exposing cults \u0026 human trafficking organizations. Investigating \u0026 reporting the egregious practices, brainwashing, recruiting techniques etc. More importantly it is a safe haven for ex-members \u0026 survivors who were able to escape, leave and/or get out to tell their story. Many, if not all are traumatized and their lives are changed forever. Once out, they face the challenge of putting their lives back together. But these challenges that lie ahead of them are unimaginable. Anonymous Andrew from the Anonymous Andrew Podcast is joined my Melody, an ex-member of a cult herself to co-host this show. We hope this show brings awareness to the fact that cults around the US and worldwide are very much alive and thriving and preying on so many vulnerable people. We hope to also bring hope to this who might still be in a cult or being trafficked that there is hope and life on the other side! Melody and I (Anonymous Andrew) begin our journey on investigating cults from around the world and right here in the USA. It is amazing how many there are and how they get away with so much debauchery. Joins us as we expose these cults with ex-members and survivors who tell their story! You are not alone! Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-04-30T10:56:35Z",
      "duration": "00:31:02.3210000",
      "explicit": true,
      "spotifyId": "2EHdaELWZXGapwjoonfw7d",
      "appleId": 1000654159753,
      "youTubeId": "83Fo-DSwag0",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2EHdaELWZXGapwjoonfw7d",
        "apple": "https://podcasts.apple.com/podcast/cultimatum-the-culture-of-cults-pilot/id1744145655?i=1000654159753",
        "youtube": "https://www.youtube.com/watch?v=83Fo-DSwag0"
      }
    },
    {
      "id": "5c8c2b25-8b1b-4cae-b459-8e54d5dd006f",
      "title": "Episode #44 Robert Smith Interview (Part 2)",
      "description": "*Part 2* In the second half of our interview with Robert Smith, he shares openly about how leaving the cult affected his relationship with his mother \u0026 where is relationship is with her today.  Robert talks about the difference in the way that young men \u0026 young women are treated with the group, especially after committing \u0022transgressions.\u0022  We talk about what he has done to work towards personal growth \u0026 healing. Robert talks about his personal feelings about the leader \u0026 his faith. Robert also shares what has been the most difficult loss from his since leaving the group, the loss or prayer \u0026 he shares how opening up \u0026 talking about his experience in the House of Yahweh has been therapeutic for him. We end with Robert offering some advice for anyone having doubts about being in a controlling or abusive group.",
      "release": "2021-05-24T11:00:12Z",
      "duration": "00:29:32",
      "explicit": false,
      "youTubeId": "dcBhIEEJHZY",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dcBhIEEJHZY"
      }
    },
    {
      "id": "82906ed6-6321-46c4-9fd4-782435a4ccc3",
      "title": "Episode #44 Robert Smith Interview  (Part 1)",
      "description": "*Part 1*  In this interview with Robert Smith, who was a member of the House of Yahweh in Abilene Texas for 8 years, from age 12 to the age of 20. Robert shares with us how he joined the group \u0026 what is first impressions were. He goes on to tell us about how he watched the organization change not only it\u0027s members but it\u0027s teachings over the time that he was there. Robert talks about \u0022classism\u0022 \u0026 how he saw that take place with the members of this controlling group. Robert was a personal assistant to the leader during part of his time in the House of Yahweh, he talks about this experience \u0026 also shares when \u0026 how he started to lose his faith in the organization \u0026 it\u0027s leader Yisrayl Hawkins.",
      "release": "2021-05-24T11:00:03Z",
      "duration": "00:37:14",
      "explicit": false,
      "youTubeId": "8i8i6_96wmI",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8i8i6_96wmI"
      }
    },
    {
      "id": "75cca398-7ec8-4cfd-9199-dbe6a3381bac",
      "title": "Episode #43 Vashti Initiative Information (Even Jones, 2nd Interview)",
      "description": "Episode #43 We do a 2nd interview with Evan Jones, this time to take a more in-depth look at the Vashti Initiative. We get all your questions answered about the cause \u0026 the services offered. Some of those services include a hotline number 1-833-4VASHTI or I-833-482-7484 \u0026 an online support group. We also talk about how you can donate to the cause or volunteer your time. We were so grateful for Evan\u0027s time \u0026 willingness to meet with us once again to answer our questions.",
      "release": "2021-05-17T11:00:01Z",
      "duration": "00:35:56",
      "explicit": false,
      "youTubeId": "1M3Dwbt5mqw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1M3Dwbt5mqw"
      }
    },
    {
      "id": "54ec6b3c-9a8f-4ccd-8f3a-203609db01c4",
      "title": "Episode #42  Interview With Kristin Postell (Legal Advice Episode)",
      "description": "Episode #42 Ariyl \u0026 Melody interview Kristin Postell a lawyer in the Abilene Texas area. We ask Kristin many questions about legal advice for those that might have legal questions whether they are in the House of Yahweh or another controlling group. We discuss custody issues, personal property that might have been signed over to your religious organization, birth certificates, Social Security Cards, deportation, planning to leave \u0026 abuse. All very important topics \u0026 questions that people in this situation might have. Kristin is open \u0026 forthcoming with legal guidance \u0026 advice.",
      "release": "2021-05-10T11:00:13Z",
      "duration": "00:36:35",
      "explicit": false,
      "youTubeId": "fwD8x0CSDyI",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fwD8x0CSDyI"
      }
    },
    {
      "id": "a713d134-ac5d-4227-a1bc-f8deffbd558b",
      "title": "Episode #41 Joseph Onesta Interview (Part 2)",
      "description": "*Part 2* In the second part of our interview with Joseph Onesta we wrap up the interview by talking about how Joseph has worked towards his own healing \u0026 recovery since leaving his cult. He also tells us about his book \u0026 where you can get a copy about recovering from religious trauma. He also offers advice for anyone that might be part of a group \u0026 having doubts. We also tell you about his website as well.",
      "release": "2021-05-03T11:00:10Z",
      "duration": "00:29:25",
      "explicit": false,
      "youTubeId": "WyhzjSv8RgQ",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WyhzjSv8RgQ"
      }
    },
    {
      "id": "2999a922-877f-424d-bee5-f691ef3cc37d",
      "title": "Episode #41 Joseph Onesta Interview (Part 1)",
      "description": "*Part 1* of our interview with Joseph Onesta. Joseph was a member of the House of Yahweh out of Indiana, Pennsylvania. Joseph was part of this group while going to school to become a minister. He shares with us how he became involved with the group \u0026 some of the abusive \u0026 manipulative behaviors displayed by the leader.  He talks about how \u0026 why he left \u0026 how the group affected his relationship with people outside the group.",
      "release": "2021-05-03T11:00:00Z",
      "duration": "00:33:47",
      "explicit": false,
      "youTubeId": "1myxaCfzNvk",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1myxaCfzNvk"
      }
    },
    {
      "id": "cfa410b5-0edd-4edd-a159-bfd07583aa3f",
      "title": "Episode #40 Lisa O\u0027Neil Interview (Part 1)",
      "description": "*Part 1* Melody interviews Lisa O’Neil about her time in a cult, called simply “The Work.” Lisa shares how she was brought into the group \u0026 indoctrinated from a very young age. She talks about her “somewhat “arranged marriage as a teenager. Lisa tells us what the leader; “Brother Julius” was like as a person \u0026 what her impression was of him starting from childhood. We also discuss the leader’s wife , Joann, \u0026 the role she played within the group. Lisa explains what the “Special Work” was \u0026 the toll it took on the members of the congregation. She shares with us about some of the more unique \u0026 unusual teachings with the group including child wedding ceremonies \u0026 child demon possession.",
      "release": "2021-04-19T11:00:07Z",
      "duration": "00:38:36",
      "explicit": false,
      "youTubeId": "GRShq4-VYpc",
      "subjects": [
        "Brother Julius"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GRShq4-VYpc"
      }
    },
    {
      "id": "71c71bc5-3866-444f-816f-00a9e13f031f",
      "title": "Episode #40 Lisa O\u0027Neil Interview (Part 2)",
      "description": "*Part 2* In part two of our interview with Lisa O’Neil, we learn about some of the traumatic things that happened to her personally while she was a member of “The Work.” Lisa opens up about how \u0026 why she left the group at the age of 26 \u0026 her struggle to create a new life for herself \u0026 her daughter. We move on the talk about some of the things that she has done to work towards her personal healing, including a book she is writing.  Lisa is so compassionate, loving \u0026 forgiving! She offers up some excellent advice for anyone that might currently being feeling trapped in an abuse religious group.",
      "release": "2021-04-19T11:00:04Z",
      "duration": "00:32:15",
      "explicit": false,
      "youTubeId": "EQo4ueqCDGM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EQo4ueqCDGM"
      }
    },
    {
      "id": "e3ac5ebc-e51d-4ea4-b518-023572dac853",
      "title": "Episode #39 Gary Alt Interview (Part 1)",
      "description": "*Part 1* Gary Alt shares his story about not just being a part of the Jehovah’s Witnesses for over 40 years, but also being part of the “body of elders” as well. He shares how he became part of the group as a teenage \u0026 went on to dedicate \u0026 build his life around the organization. Eventually Gary was asked to step down as an elder \u0026 he explains why this happened \u0026 how he was treated afterwards. He opens up about his depression \u0026 suicide attempt that followed.",
      "release": "2021-04-12T11:00:23Z",
      "duration": "00:37:57",
      "explicit": false,
      "youTubeId": "e_azrXmKaXo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e_azrXmKaXo"
      }
    },
    {
      "id": "fd18443a-70c3-4bcf-b485-145c0b7abd1a",
      "title": "Episode #39 Gary Alt Interview (Part 2)",
      "description": "*Part 2* In part 2 of our interview with Gary, who use to be an elder in the Jehovah’s Witnesses, we hear about how he was treated when he tried to step back into the role of an Elder. Gary was told why he wasn’t worthy of that position any longer \u0026 was given many different reasons why he wasn’t able to be back on the board of elders. Due to some connection issues part 2 was cut short.",
      "release": "2021-04-12T11:00:18Z",
      "duration": "00:13:17",
      "explicit": false,
      "youTubeId": "qkElb3ayfZI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qkElb3ayfZI"
      }
    },
    {
      "id": "40c53b13-f964-426a-93b5-ec40f91db8ac",
      "title": "Episode #39 Gary Alt Interview (Part 3)",
      "description": "*Part 3* In part 3 of our discussion with Gary Alt, ex-elder in the Jehovah’s Witnesses we learn the difference between being shunned \u0026 being “disfellowshipped.” Gary explains how \u0026 when he started to stop believing in the teachings \u0026 what he has done to work towards personal healing \u0026 recovery from his traumatic religious experience. We end with Gary sharing some words of wisdom for anyone watching that might suspect that they are in a controlling group \u0026 what they can start doing to work their way out.",
      "release": "2021-04-12T11:00:16Z",
      "duration": "00:34:01",
      "explicit": false,
      "youTubeId": "z_ncD2ZHiB8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z_ncD2ZHiB8"
      }
    },
    {
      "id": "6112c194-3a77-47cd-84a9-4ba28f5d6324",
      "title": "Episode #38 Evan Jones Interview (Part1)",
      "description": "*Part 1* Evan Jones was part of the Independent Fundamentalist Baptist Church from birth to age 27. Evan share with us what it was like growing up as part of the IFB. The leader of his branch of the IFB was Jack Hyles, who was basically worshipped by the congregation, like that of so many other controlling groups.  We discuss what it was like growing up in this controlled environment \u0026 what Evan’s time in the Reformers Unanimous was like. Evan grew up in a blended family \u0026 talks about his current relationships with his different family members.",
      "release": "2021-04-05T11:00:31Z",
      "duration": "00:34:03",
      "explicit": false,
      "youTubeId": "px9O9YDeoGU",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=px9O9YDeoGU"
      }
    },
    {
      "id": "ad9cb680-4ffc-47df-99eb-77b32e179006",
      "title": "Episode #38 Evan Jones Interview (Part 2)",
      "description": "*Part 2* In the second half of our interview with Even Jones who was part of the IFB (Independent Fundamentalist Baptist) Church, we talk about both the positive \u0026 negative parts of Evan’s growing up years being part of a controlling religious group. We also talk about Even’s part in a rescore website for ex-cult members called the Vashti Initiative. Even shares details about his personal recovery \u0026 healing from his traumatic religious experience. In closing Even offers words of advice for anyone that might be struggling to leave a controlling group or situation.",
      "release": "2021-04-05T11:00:15Z",
      "duration": "00:25:08",
      "explicit": false,
      "youTubeId": "M1zc2VntMb0",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=M1zc2VntMb0"
      }
    },
    {
      "id": "51770261-865d-4a32-b747-c3485594c769",
      "title": "Episode #37 Sandy Johnsman Interview (Part 2)",
      "description": "*Part 2* The second half of our interview with Sandy Johnsman, who was in the House of Yahweh for 5 years we talk about why she never moved to Abilene to be closer to the cult \u0026 most of its members. Sandy shares some of her more positive memories of her experience in the group as well as the reason she ended up leaving. We talk about what she has done to heal from her experience \u0026 how she tries to find the good in everything. She ends her interview with a message to anyone that might find themselves in a controlling religious situation.",
      "release": "2021-03-29T11:00:20Z",
      "duration": "00:28:09",
      "explicit": false,
      "youTubeId": "Zsz_3uZ65vQ",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Zsz_3uZ65vQ"
      }
    },
    {
      "id": "bbbfe6ad-8d73-44d9-88fe-d2a6aad22d32",
      "title": "Episode #37 Sandy Johnsman Interview (Part1)",
      "description": "*Part 1* Part 1 of our interview with Sandy Johnsman, Sandy is Melody\u0027s mom \u0026 was part of the House of Yahweh for 5 years. Sandy shares with us about how she got involved in the House of Yahweh \u0026 what her first impressions were. She opens up are the addiction issues her ex-husband had before, during \u0026 after  the cult. Bob \u0026 Sandy sold their house while in the organization, with a substantial portion of the proceeds being tithed to the organization. Sandy was thought to have had demons at one point while in the group, she experienced the home birth of her 1st grandchild, \u0026 talks about her response to the multiple marriage teaching.",
      "release": "2021-03-29T11:00:01Z",
      "duration": "00:32:58",
      "explicit": false,
      "youTubeId": "az3EeJQ4GSM",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=az3EeJQ4GSM"
      }
    },
    {
      "id": "4ce4407c-2f8a-4a0a-8c1f-6c06420bd2b4",
      "title": "Episode #36 Speaking Out Publicly After Leaving A Cult (Round Table with Sandra \u0026 Deb)",
      "description": "We have a round table discussion with Sandra \u0026 Deb about speaking out publicly after leaving a cult. Both Sandra \u0026 Deb are ex members of The House of Yahweh. Sandra has a blog (Unwritten) where she speaks openly about her experience in the cult \u0026 Deb has a podcast call I Got The Hell Out where she talks about the cult in weekly episodes. We talk about what inspired us, what we were afraid of \u0026 how speaking out has played a part in our healing process. We also share advice to anyone else that is thinking about speaking out.",
      "release": "2021-03-22T11:00:12Z",
      "duration": "00:30:29",
      "explicit": false,
      "youTubeId": "cNbHITq0cbY",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cNbHITq0cbY"
      }
    },
    {
      "id": "3725fc77-1e6a-41a9-89c5-06914e7e7b07",
      "title": "Episode #35 Delayah  Interview Part 2",
      "description": "Episode #35 *Part 2* We continue our interview with Delayah. She explains the absolutely stressful position she was put in by the leader of the organization after being asking to “go under his headship.” She shares how the stress of their living situation took a toll on her whole family. Delayah \u0026 her family did end up leaving the area after 3 years of living under an immense amount of stress. She ends her interview by sharing how “happy” she is since leaving \u0026 has a message to anyone still in the House of Yahweh.",
      "release": "2021-03-15T11:00:12Z",
      "duration": "00:35:23",
      "explicit": false,
      "youTubeId": "XYhRhERPHQY",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XYhRhERPHQY"
      }
    },
    {
      "id": "a83ef9a7-f62c-43b8-bc4f-456dd2022184",
      "title": "Episode #35 Delayah  Interview (Part 1)",
      "description": "Episode #35 *Part 1* Ariyl \u0026 Melody interview the young Delayah about her experience as a member of the House of Yahweh. Delayah was only 11 when her family moved to Texas in order to be closer to the cult following promises of healing for her father. She shares with us what the reality of her family’s living situation was after moving to the Abilene area in comparison to what they were promised before moving. Delayah worked for Yisrayl Hawkins in his office \u0026 also in the H.O.Y. cafeteria.",
      "release": "2021-03-15T11:00:09Z",
      "duration": "00:31:59",
      "explicit": false,
      "youTubeId": "ZPMKBcqQQ7U",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZPMKBcqQQ7U"
      }
    },
    {
      "id": "7873fd3c-3df8-41d7-9f1b-990302347241",
      "title": "Episode #34 Brandon W  Salo Book Promo (Poison Into Medicine)",
      "description": "We talk to Brandon about his book called Poison Into Medicine (My Life In A Doomsday Cult.)  Brandon shared how long it took him to write the book \u0026 what inspired him. We discuss the significance of his book cover \u0026 the symbolism behind it. Brandon shares about his healing process \u0026 we share our feelings about the book as well.",
      "release": "2021-03-08T12:00:17Z",
      "duration": "00:29:45",
      "explicit": false,
      "youTubeId": "rO70yZRkrSk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rO70yZRkrSk"
      }
    },
    {
      "id": "f9c2ef34-6637-47ee-adad-36ae4bfefdc9",
      "title": "Episode #33 Socializing Normally After Leaving A Cult (Round Table)",
      "description": "Ariyl \u0026 Melody are joined by Erin Taylor \u0026 Garry Stone  for a round table discussion about  socializing \u0022normally\u0022 after leaving a cult. They offer different perspectives on how each of them have handled this in a unique way.  We go over everything from adjusting to no longer following the teachings from the cult to how we each of us dealt with raising our children post cult days.",
      "release": "2021-03-01T12:00:12Z",
      "duration": "00:36:22",
      "explicit": false,
      "youTubeId": "fDsodLc_-nM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fDsodLc_-nM"
      }
    },
    {
      "id": "11f216e9-eb32-4203-9295-1c14da6ff68d",
      "title": "Episode #32 Ivy Iverson Interview (Part 1)",
      "description": "*Part 1* We interview Ivy Iverson who was born into the I.F.B (Independent Fundamentalist Baptist) religion. Ivy starts off explaining how her church differs from mainstream religions, including other Baptist churches. Ivy explains how the way in which women were treated within the sect affected her personally. We talk about how abuse is handled in the group \u0026 how she started to see things differently from a very young age.",
      "release": "2021-02-22T12:00:17Z",
      "duration": "00:34:08",
      "explicit": false,
      "youTubeId": "plwDaSGHAjs",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=plwDaSGHAjs"
      }
    },
    {
      "id": "ea6b9fc6-3eab-4023-b2ed-5b2c95d78c32",
      "title": "Episode #32 Ivy Iverson Interview (Part 2)",
      "description": "*Part 2* In the second half of our interview with Ivy Iverson, she tells us when \u0026 how she ended up leaving the I.F.B (Independent Fundamentalist Baptist) church. To this day her parents are still part of the organization \u0026 Ivy is open about how this \u0026 other factors play a role in her current relationship with them. Ivy shares some of the triggers that she has experienced after leaving \u0026 things that still trigger her today. Ivy is part of a group called the Vashti Initiative, an organization that offers help \u0026 support for those leaving \u0026 transitioning out of cults. In closing she offers advice for those that think they might be in a cult.",
      "release": "2021-02-22T12:00:04Z",
      "duration": "00:29:53",
      "explicit": false,
      "youTubeId": "J5tETwdh5OY",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J5tETwdh5OY"
      }
    },
    {
      "id": "f3f18ed7-62f8-47ba-8237-2a33e934d811",
      "title": "Episode #31 Brandon Jonas Interview (Part 2)",
      "description": "*Part 2* In part 2 of our interview with Brandon Jonas he shares with us, how \u0026 why he left the House of Yahweh. The struggle that Brandon had after leaving, was not unique to him, so many young men leave with a low level of education \u0026 minimal skills. It has been a long hard road, but Brandon is a true survivor \u0026 is still working towards healing from his traumatic experience. He ends with a personal message for his older sister that is still part of the sect.",
      "release": "2021-02-15T12:00:05Z",
      "duration": "00:33:22",
      "explicit": false,
      "youTubeId": "J6M_cNOBDyo",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J6M_cNOBDyo"
      }
    },
    {
      "id": "f239372e-d5d2-49de-817c-a010e976d27f",
      "title": "Episode #31 Brandon Jonas Interview (Part 1)",
      "description": "*Part 1* Brandon Jonas, was so open with us about what he suffered not only because of being part of the House of Yahweh, but also at the hands of his own father. So many controlling groups like this choose to ignore or tolerate multiple types of abuse \u0026 strongly resist getting outside authorities involved.  The push to work instead of getting an education took its toll on Brandon during his teen years. Brandon shares how the young men were ostracized to give the older elders more access to marry young women as subsequent wives without competition.",
      "release": "2021-02-15T12:00:03Z",
      "duration": "00:33:39",
      "explicit": false,
      "youTubeId": "BPcFfeldDoI",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BPcFfeldDoI"
      }
    },
    {
      "id": "1587be04-dd31-4f18-b362-c72a9901cd4e",
      "title": "Episode #30 Denise Taylor Interview (Part 1)",
      "description": "*Part1* Denise Taylor talks to use about spending over 30 years of her life in a “religion” called Laestadian. It is Laestadian Lutheran based religion. She explains some of the more extreme teachings in her organization. Denise is open \u0026 honest about the abuse she suffer while part of the church \u0026 how it was handled by the people in charge. Although, a higher education is not encouraged, especially for women in the group, Denise tells us how \u0026 why she went against these teachings. While in the group \u0026 since leaving Denise has experienced what she calls “guilt cycles.” She tells us what that is like for her \u0026 how she works through them.",
      "release": "2021-02-08T12:00:10Z",
      "duration": "00:34:22",
      "explicit": false,
      "youTubeId": "eN333tOYSXg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eN333tOYSXg"
      }
    },
    {
      "id": "351be2e6-8913-4ebf-ab9a-1f2de7079384",
      "title": "Episode #30 Denise Taylor Interview (Part 2)",
      "description": "*Part 2* In part two of our interview with Denise Taylor, she explains how large families are encouraged \u0026 how large her family is. Transitioning out of a cult can be very mentally difficult, \u0026 Denise struggled with this for years before actually leaving. Although recovery from religious trauma is a long difficult process for many, Denise has come a long way in a short time. She talks about how having an outside support system played a role in her healing. Denise also offers advice for those that suspect they might be in a cult.",
      "release": "2021-02-08T12:00:08Z",
      "duration": "00:34:09",
      "explicit": false,
      "youTubeId": "ddGqXymbCOo",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ddGqXymbCOo"
      }
    },
    {
      "id": "d6bb6d5d-d448-423f-86b7-f63b482d2bf4",
      "title": "Episode #29 Karen McMillan Interview (Part 2)",
      "description": "*Part 2* In the second half of our interview with Karen we learn when \u0026 why Karen left the House of Yahweh. She shares the struggles she went through getting her education \u0026 taking care of her children as a single mom. We talk about Karen’s path to healing \u0026 how having a sister that is still a member of the group has a profound effect on her to this day. Karen ends her interview with a personal message to her sister \u0026 anyone else that might still be in the House of Yahweh.",
      "release": "2021-02-01T12:00:05Z",
      "duration": "00:23:56",
      "explicit": false,
      "youTubeId": "9b1L7y6yQao",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9b1L7y6yQao"
      }
    },
    {
      "id": "b3b0f73c-48b1-481d-8615-6c1a03ec94df",
      "title": "Episode #29 Karen McMillian Interview (Part 1)",
      "description": "*Part 1* Karen McMillan, who was a member of the House of Yahweh from the late 1980’s to the late 1990’s. Karen shares the difficulties she faced joining the group as a teenager \u0026 how she met \u0026 married the man she married in the group. She walks us through the difficulties she faced not only in her own marriage as a result of the multiple marriage \u0026 slavery teachings, but also how it took a toll on her mother \u0026 brother as well.",
      "release": "2021-02-01T12:00:03Z",
      "duration": "00:35:22",
      "explicit": false,
      "youTubeId": "CfyUQaI1oWQ",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CfyUQaI1oWQ"
      }
    },
    {
      "id": "f86795ac-601f-4248-81a3-2356ce571fa2",
      "title": "Episode #28 Kay Hawkins Interview (Part 1)",
      "description": "*Part 1* We speak with Kay Hawkins, who was married to Yisrayl/Bill Hawkins (the leader of the House of Yahweh) from the mid-1970’s until the mid-1990’s. Kay shares the role she played in the House of Yahweh while she was there, what it was like being married to Bill \u0026 what kind of father he was. She tells us about her reaction to the multiple marriage teaching \u0026 how she was treated after the teaching officially came across the pulpit.",
      "release": "2021-01-25T12:00:15Z",
      "duration": "00:36:01",
      "explicit": false,
      "youTubeId": "somEmetLD1o",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=somEmetLD1o"
      }
    },
    {
      "id": "3886731d-395c-46b6-9a82-2e8336c4676c",
      "title": "Episode #28 Kay Hawkins Interview (Part 3)",
      "description": "*Part 3* Part three of our interview with the lovely Kay Hawkins is eye opening to some of the disagreements she had with the leader (her ex-husband) about how certain things in the Book of Yahweh (the sects version of the bible) should be translated \u0026 how it played out. She also shares how her \u0026 her family have worked towards healing since breaking ties with the group \u0026 its leader. Kay gives advice to anyone still in the group \u0026 we also share viewer questions that Kay answers without hesitation.",
      "release": "2021-01-25T12:00:11Z",
      "duration": "00:31:02",
      "explicit": false,
      "youTubeId": "qDEW_dtYmKI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qDEW_dtYmKI"
      }
    },
    {
      "id": "abe55cd4-6da6-4615-bf0f-689be13b38ee",
      "title": "Episode #28 Kay Hawkins Interview (Part 2)",
      "description": "*Part 2* In part two of our candid interview with Kay Hawkins, she tells us how Yisrayl reacted to the news that his brother Yaaqob/Jacob had died. The teaching up to this point was that Yisrayl \u0026 his brother Yaaqob/Jacob were the two witnesses prophesied in the bible. She opens up about how the multiple marriage teachings affected her family as a whole \u0026 the emotional toll it took on her personally.",
      "release": "2021-01-25T12:00:08Z",
      "duration": "00:35:34",
      "explicit": false,
      "youTubeId": "CRdulBF5pus",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CRdulBF5pus"
      }
    },
    {
      "id": "6866c8a4-6eda-4f5f-9ef5-aad8402f8e18",
      "title": "Episode #27 Jessica \u0026 Qoby Interview (Part 2)",
      "description": "*Part 2*In part two we talk about how the bride price for Jessica was handled. Jessica opens up about how she was being taught to suppress her true feelings about multiple marriages in order to “appear” righteous. Yaaqob tells us how he was essentially given permission to be overbearing \u0026 told that he didn’t need to take Jessica’s feelings into consideration.",
      "release": "2021-01-18T12:00:09Z",
      "duration": "00:36:59",
      "explicit": false,
      "youTubeId": "_6F6dWIODYw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_6F6dWIODYw"
      }
    },
    {
      "id": "dbe2f3b4-d585-469c-8b2b-dfab4e4f3e8c",
      "title": "Episode #27 Jessica \u0026 Qoby Interview (Part 3)",
      "description": "*Part 3* In the final part of this interview with the married couple Jessica \u0026 Qoby, who got married in the House of Yahweh in 1994 and are still married today. We talk about when \u0026 why they each left (at different times) \u0026 how they were able to remain together with all these transitions. We talk about the difficulties they faced individually \u0026 as a couple after leaving \u0026 where they are now .",
      "release": "2021-01-18T12:00:03Z",
      "duration": "00:49:39",
      "explicit": false,
      "youTubeId": "EaJo7I1ugKQ",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EaJo7I1ugKQ"
      }
    },
    {
      "id": "ffd13218-8c01-48b6-86cf-ab0b75cd8ac5",
      "title": "Episode #27 Jessica \u0026 Qoby Interview (Part1)",
      "description": "*Part 1 *Jessica \u0026 Qoby share with us when \u0026 how the joined the House of Yahweh. They also share personal aspects of their early relationship before they were “allowed” to get married. We discuss how the multiple marriage \u0026 slavery teachings not only played a part in the length of their betrothal, but also in the manner in which they were being counseled by the elders \u0026 their wives.",
      "release": "2021-01-18T12:00:01Z",
      "duration": "00:27:35",
      "explicit": false,
      "youTubeId": "5jVHZjQInHs",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5jVHZjQInHs"
      }
    },
    {
      "id": "b5673c35-902c-4b43-a231-0c5eb2a71a18",
      "title": "Episode #26 Interview with \u0022Norah\u0022 A Daughter of a House of Yahweh Elder (Part 3)",
      "description": "Episode #26 (Part 3) Our Interview with \u0022Norah\u0022 the daughter of a House of Yahweh elder.  She was born \u0026 raised in the cult, but always longed for a \u0022normal\u0022 life. She opens up about the effects this had on her and her family. She also shares about her personal interactions with the leader \u0026 his family. She narrowly avoided being married into the family based on her mother\u0027s keen instincts. \u0022Norah\u0022 as we will call her was a joy to speak with \u0026 her interview is captivating \u0026 entertaining!",
      "release": "2021-01-11T12:00:07Z",
      "duration": "00:37:24",
      "explicit": false,
      "youTubeId": "MIZMvTRVDm0",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MIZMvTRVDm0"
      }
    },
    {
      "id": "d91ff50f-242f-4c2b-ae7e-e77654990c1e",
      "title": "Episode #26 Interview With \u0022Norah\u0022 Daughter of a House of Yahweh Elder (Part 4)",
      "description": "Episode #26 (Part 4) Our Interview with \u0022Norah\u0022 the daughter of a House of Yahweh elder.  She was born \u0026 raised in the cult, but always longed for a \u0022normal\u0022 life. She opens up about the effects this had on her and her family. She also shares about her personal interactions with the leader \u0026 his family. She narrowly avoided being married into the family based on her mother\u0027s keen instincts. \u0022Norah\u0022 as we will call her was a joy to speak with \u0026 her interview is captivating \u0026 entertaining!",
      "release": "2021-01-11T12:00:06Z",
      "duration": "00:22:56",
      "explicit": false,
      "youTubeId": "JIrV5wODKHE",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JIrV5wODKHE"
      }
    },
    {
      "id": "ba202480-f94b-4eeb-a575-6932dd5efe9d",
      "title": "Episode #26 Interview with \u0022Norah\u0022 Daughter of a House of Yahweh Elder  (Part 2)",
      "description": "Episode #26 (Part 2) Our Interview with \u0022Norah\u0022 the daughter of a House of Yahweh elder.  She was born \u0026 raised in the cult, but always longed for a \u0022normal\u0022 life. She opens up about the effects this had on her and her family. She also shares about her personal interactions with the leader \u0026 his family. She narrowly avoided being married into the family based on her mother\u0027s keen instincts. \u0022Norah\u0022 as we will call her was a joy to speak with \u0026 her interview is captivating \u0026 entertaining!",
      "release": "2021-01-04T12:00:31Z",
      "duration": "00:33:17",
      "explicit": false,
      "youTubeId": "wNJm_DjzuEs",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wNJm_DjzuEs"
      }
    },
    {
      "id": "5f8a604b-c9be-46b4-8bb7-7a49e9905d4c",
      "title": "Episode #26 Norah, daughter of a House of Yahweh elder  Interview (Part1)",
      "description": "Episode #26 (Part1) Our Interview with \u0022Norah\u0022 the daughter of a House of Yahweh elder.  She was born \u0026 raised in the cult, but always longed for a \u0022normal\u0022 life. She opens up about the effects this had on her and her family. She also shares about her personal interactions with the leader \u0026 his family. She narrowly avoided being married into the family based on her mother\u0027s keen instincts. \u0022Norah\u0022 as we will call her was a joy to speak with \u0026 her interview is captivating \u0026 entertaining!",
      "release": "2021-01-04T12:00:01Z",
      "duration": "00:36:08",
      "explicit": false,
      "youTubeId": "5qh2N66tUXw",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5qh2N66tUXw"
      }
    },
    {
      "id": "4db75485-71a2-49a4-b74a-efb34f27258c",
      "title": "Episode #25 Year In Review 2020",
      "description": "Ariyl \u0026 Melody speak about the interviews \u0026 episodes that aired in 2020 \u0026 what is coming in 2021.",
      "release": "2020-12-28T12:00:04Z",
      "duration": "00:27:07",
      "explicit": false,
      "youTubeId": "VMoJGkbhkro",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VMoJGkbhkro"
      }
    },
    {
      "id": "3343eb93-e258-46a0-ae50-7a78a3f3f265",
      "title": "Episode #24 Melody Boyd Interview (Part3)",
      "release": "2020-12-16T12:00:03Z",
      "duration": "00:28:27",
      "explicit": false,
      "youTubeId": "JJIdahgPeWo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JJIdahgPeWo"
      }
    },
    {
      "id": "fe49b875-7224-4206-ba07-6c82ff706568",
      "title": "Episode #24 Melody Boyd Interview (Part2)",
      "release": "2020-12-15T12:00:12Z",
      "duration": "00:33:07",
      "explicit": false,
      "youTubeId": "DkNl7MByFzQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DkNl7MByFzQ"
      }
    },
    {
      "id": "9c19d0ff-fe7d-47d1-8c86-76549d62f94b",
      "title": "Episode #24 Melody Boyd Interview (Part1)",
      "release": "2020-12-14T12:00:10Z",
      "duration": "00:28:33",
      "explicit": false,
      "youTubeId": "pq_I7NM7Owc",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pq_I7NM7Owc"
      }
    },
    {
      "id": "b642925b-ca22-48b5-aa1b-77919bf857a4",
      "title": "Episode #23 Garry Stone Interview (Part 2)",
      "description": "We speaking openly with Garry Stone. Garry joined the House of Yahweh when he was only 10 years old \u0026 got baptized on his first feast. He shares the struggles of being the son of an elder, watching his father take a much younger 2nd wife \u0026 being kicked out of his home after refusing to participate in the new teaching of confessions. We also talk about his close relationships with his mom \u0026 his older sisters. How difficult is was for him to watch his mother suffer through the multiple marriage teachings \u0026 the difficulty his family still faces today with one sister that is sill a part of the organization. Garry\u0027s story is an inspiration, through all the changes he was able to stay true to his core ethical beliefs in the face of adversity. (Part 2)",
      "release": "2020-12-07T12:00:16Z",
      "duration": "00:22:19",
      "explicit": false,
      "youTubeId": "xmU3zi0Xp0I",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xmU3zi0Xp0I"
      }
    },
    {
      "id": "b8638463-07d4-40c1-aea4-8dfd22c4354d",
      "title": "Episode #23 Garry Stone Interview (Part 1)",
      "description": "We speaking openly with Garry Stone. Garry joined the House of Yahweh when he was only 10 years old \u0026 got baptized on his first feast. He shares the struggles of being the son of an elder, watching his father take a much younger 2nd wife \u0026 being kicked out of his home after refusing to participate in the new teaching of confessions. We also talk about his close relationships with his mom \u0026 his older sisters. How difficult is was for him to watch his mother suffer through the multiple marriage teachings \u0026 the difficulty his family still faces today with one sister that is sill a part of the organization. Garry\u0027s story is an inspiration, through all the changes he was able to stay true to his core ethical beliefs in the face of adversity. (Part 1)",
      "release": "2020-12-07T12:00:01Z",
      "duration": "00:33:05",
      "explicit": false,
      "youTubeId": "0YNI58LFyic",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0YNI58LFyic"
      }
    },
    {
      "id": "cacb0f06-33e4-4b16-a63c-16261420975e",
      "title": "Episode #22 Michael Cotter Interview  (Untamed Truth) Part 1",
      "description": "We talk to Michael Cotter about his experience with a small Christian based cult called the Untamed Truth. He will speak of when he was in college and recruited by the cult. How he was told to speak down to complete strangers, how he watched a fellow member be lied about, how they tried to cut him off from his family and friends. This young man took a stand and found his way to the truth. A very inspiring, insightful true story of hope and coming out on the other side.",
      "release": "2020-11-30T12:00:11Z",
      "duration": "00:36:12",
      "explicit": false,
      "youTubeId": "Nx4cvsSwyfY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Nx4cvsSwyfY"
      }
    },
    {
      "id": "612dea93-98a9-4f24-bbd1-6f556c646b51",
      "title": "Episode #22 Michael Cotter Interview (Untamed Truth) Part 2",
      "description": "We talk to Michael Cotter about his experience with a small Christian based cult called the Untamed Truth. He will speak of when he was in college and recruited by the cult. How he was told to speak down to complete strangers, how he watched a fellow member be lied about, how they tried to cut him off from his family and friends. This young man took a stand and found his way to the truth. A very inspiring, insightful true story of hope and coming out on the other side.",
      "release": "2020-11-30T12:00:03Z",
      "duration": "00:19:42",
      "explicit": false,
      "youTubeId": "3oe0OxmrkvQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3oe0OxmrkvQ"
      }
    },
    {
      "id": "a276b0ab-f7de-4aee-8365-481e2ad9ec6c",
      "title": "Episode #21 Amber Devine Interview (Part1)",
      "description": "Our interview with the lovely Amber Chaffin Devine.  Amber  shares her story of coming to the House of Yahweh as a young girl. She grew up in a cult where division \u0026 submission are the norm. She has struggled to find her voice. We feel honored \u0026 blessed to help provide a platform where she felt comfortable enough to speak her truth \u0026 share her experiences , good \u0026 bad. (Part 1)",
      "release": "2020-11-23T12:00:12Z",
      "duration": "00:32:24",
      "explicit": false,
      "youTubeId": "k1jCTBxkj5c",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k1jCTBxkj5c"
      }
    },
    {
      "id": "2f177519-8481-4787-acba-95dfb571a0ba",
      "title": "Episode #21 Amber Devine Interview (Part 2)",
      "description": "Our interview with the lovely Amber Chaffin Devine.  Amber  shares her story of coming to the House of Yahweh as a young girl. She grew up in a cult where division \u0026 submission are the norm. She has struggled to find her voice. We feel honored \u0026 blessed to help provide a platform where she felt comfortable enough to speak her truth \u0026 share her experiences , good \u0026 bad. (Part 2)",
      "release": "2020-11-23T12:00:09Z",
      "duration": "00:23:22",
      "explicit": false,
      "youTubeId": "Wa_Yl0Uw78U",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Wa_Yl0Uw78U"
      }
    },
    {
      "id": "6e6fbf3e-8a0b-4254-ac45-414e138d7e4e",
      "title": "Episode #20 Nicole Shark Interview (Part 2)",
      "description": "(Part 2) We have an open conversation with Nicole Shark, who was brought to the House of Yahweh when she was only 10 years old. Nicole opens up about her resistance to the H.O.Y. teachings, the heartache of losing her mother to cancer and how having her sister remain in the group has effected her \u0026 her family. Nicole\u0027s interview will make you laugh, make you cry and help you to relate even if you\u0027ve never been part of a cult. This is a story you don\u0027t want to miss!!",
      "release": "2020-11-16T13:00:08Z",
      "duration": "00:32:42",
      "explicit": false,
      "youTubeId": "Zd0ioGJCp-U",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Zd0ioGJCp-U"
      }
    },
    {
      "id": "9641e77f-0826-4845-9aea-a91ed3ecf97f",
      "title": "Episode #20 Nicole Shark Interview (Part1)",
      "description": "(Part 1) We have an open conversation with Nicole Shark, who was brought to the House of Yahweh when she was only 10 years old. Nicole opens up about her resistance to the H.O.Y. teachings, the heartache of losing her mother to cancer and how having her sister remain in the group has effected her \u0026 her family. Nicole\u0027s interview will make you laugh, make you cry and help you to relate even if you\u0027ve never been part of a cult. This is a story you don\u0027t want to miss!!",
      "release": "2020-11-16T13:00:05Z",
      "duration": "00:33:20",
      "explicit": false,
      "youTubeId": "ORHgyvEHXfM",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ORHgyvEHXfM"
      }
    },
    {
      "id": "735cf9ec-a8d0-4c0f-ae73-9ed54778226b",
      "title": "Episode #19 Erin Taylor Interview",
      "description": "We had the great pleasure of speaking to Erin Taylor. She tells us about her experiences in House of Yahweh, homeschooling, leaving the cult before she was ready, and finding inner peace and great joy. This is such a healing, full of joy interview! I encourage everyone to watch Monday. During these times a little bit of Erin is just what we all need!❤😊",
      "release": "2020-11-09T13:00:07Z",
      "duration": "00:37:48",
      "explicit": false,
      "youTubeId": "FCQWGjy6M8A",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FCQWGjy6M8A"
      }
    },
    {
      "id": "ecdf196f-a64a-4cd8-a5fe-e18612074e1b",
      "title": "Episode #18 David Hawkins (Moise) Interview",
      "description": "David  joined the House of Yahweh as a young teenager and stayed until his mid 20\u0027s. He opens up about the things he learned from being a member, his experience with receiving a House of Yahweh education and shares his thoughts on multiple marriage. David, also shares some of his positive memories \u0026 gives advice to those that are coming out of a cult environment.",
      "release": "2020-11-02T13:00:06Z",
      "duration": "00:33:00",
      "explicit": false,
      "youTubeId": "_HsjayMWKeM",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_HsjayMWKeM"
      }
    },
    {
      "id": "c7093b59-1ead-43b3-a0c1-757880d72d0b",
      "title": "Episode #17 Brandon Devine Interview  (Part 2)",
      "description": "A very insightful interview about a young boy who grew into a young man all while in a cult. From going to school, to his Stepfather being an Elder and his Mother being the Head Judge and Deaconess. He talks about growing up, getting married and finally finding his way out of the Cult, to having family, 30 some years later still there in the Cult (The House of Yahweh.)",
      "release": "2020-10-26T12:00:04Z",
      "duration": "00:21:00",
      "explicit": false,
      "youTubeId": "B64DddwZwU8",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=B64DddwZwU8"
      }
    },
    {
      "id": "c2171044-fd57-4aed-8ea2-d396e189409b",
      "title": "Episode #17  Brandon Devine Interview (Part 1)",
      "description": "Very insightful interview about a young boy who grew into a young man all while in a cult. From going to school, to his Stepfather being an Elder and his Mother being the Head Judge and Deaconess. He talks about growing up, getting married and finally finding his way out of the Cult, to having family, 30 some years later still there in the Cult.",
      "release": "2020-10-26T12:00:03Z",
      "duration": "00:31:41",
      "explicit": false,
      "youTubeId": "CLeHrSJLC88",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CLeHrSJLC88"
      }
    },
    {
      "id": "97261ec8-98ad-4bff-b468-cc2ce3feacdd",
      "title": "Episode #16 Heidi Stanton\u0027s Interview ( Part 1)",
      "description": "Heidi shares her unbelievable story of being in a small Christian based cult with a controlling, manipulative, narcissistic, female leader. Heidi\u0027s family was sucked in, torn apart and essential spit out. This story is complete with Heidi losing her home and husband, to demons and witchcraft. Come hear how Heidi is working on her recovery, regaining trust in herself and those around her. This is a must see episode!!  (Part 1)",
      "release": "2020-10-19T12:00:29Z",
      "duration": "00:35:18",
      "explicit": false,
      "youTubeId": "fbma9HvammM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fbma9HvammM"
      }
    },
    {
      "id": "f82534ab-36ee-4093-85e2-5b604230546f",
      "title": "Episode #16 Heidi Stanton\u0027s Interview (Part 2)",
      "description": "Heidi shares her unbelievable story of being in a small Christian based cult with a controlling, manipulative, narcissistic, female leader. Heidi\u0027s family was sucked in, torn apart and essential spit out. This story is complete with Heidi losing her home and husband, to demons and witchcraft. Come hear how Heidi is working on her recovery, regaining trust in herself and those around her. This is a must see episode!! (Part 2)",
      "release": "2020-10-19T12:00:02Z",
      "duration": "00:34:54",
      "explicit": false,
      "youTubeId": "ALvI2vX7QSI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ALvI2vX7QSI"
      }
    },
    {
      "id": "a6535505-6678-4ec3-b3ec-3119417d8f04",
      "title": "Episode #15 Interview with Britney Butler",
      "description": "Britney Butler speaks about her time in a cult from a baby to the age of 13. The abuse her Mother, her and her siblings had to endure as the Elders stood by and watched. To watching her and her siblings being ripped apart for years. Her amazing outcome and the strength it took for her to become the woman she is today.",
      "release": "2020-10-12T15:56:02Z",
      "duration": "00:31:39",
      "explicit": false,
      "youTubeId": "zUe58kpaUdI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zUe58kpaUdI"
      }
    },
    {
      "id": "b2243361-98f7-4c71-9052-f2231b505f5b",
      "title": "Episode #14  Addictions \u0026 How They Relate To Cults",
      "description": "Ariyl \u0026 Melody speak about how addictions relate to cults. They share some personal struggles \u0026 they speak about those that were lost to addiction that were in their cult.",
      "release": "2020-10-07T18:29:35Z",
      "duration": "00:25:32",
      "explicit": false,
      "youTubeId": "QJLM8VBRC6c",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QJLM8VBRC6c"
      }
    },
    {
      "id": "01add9a1-214f-4da9-b70b-5d79f83d3d5b",
      "title": "Episode #13 Interview With Nuke Brigham Hawkins (Part 2)",
      "description": "Ariyl \u0026 Melody interview Nuke Brigham Hawkins. He talks about his time in the House of Yahweh, he finds out some reveling information about Ariyl\u0027s perspective on where her ex husband is \u0026 why. To put the icing on the cake, Nuke even takes the time to rap for us (his old school HOY rap.) It is not only entertaining, but also takes some unexpected turns. This is a must watch interview!",
      "release": "2020-10-05T13:00:44Z",
      "duration": "00:27:22",
      "explicit": false,
      "youTubeId": "njKdsbXT14E",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=njKdsbXT14E"
      }
    },
    {
      "id": "9a2bfecf-cae1-4f9a-b2f6-f5901b668d63",
      "title": "Episode #13 Interview With Nuke Brigham Hawkins ( Part 1)",
      "description": "Ariyl \u0026 Melody interview Nuke Brigham Hawkins. He talks about his time in the House of Yahweh, he finds out some reveling information about Ariyl\u0027s perspective on where her ex husband is \u0026 why. To put the icing on the cake, Nuke even takes the time to rap for us (his old school HOY rap.) It is not only entertaining, but also takes some unexpected turns. This is a must watch interview!",
      "release": "2020-10-05T12:23:52Z",
      "duration": "00:33:49",
      "explicit": false,
      "youTubeId": "ZRC8u-ENoHI",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZRC8u-ENoHI"
      }
    },
    {
      "id": "041cef7f-98fa-41c3-808f-2ed545518907",
      "title": "Episode #12 The Positive Side of Being in a Cult",
      "description": "Ariyl  \u0026 Melody speak about the positive side of being in a cult. By the positive side, we mean what they use to pull you in \u0026 why it can be difficult to  leave. We all speak about the things we learned from being in a cult \u0026 some of our best memories.",
      "release": "2020-10-02T13:02:44Z",
      "duration": "00:58:41",
      "explicit": false,
      "youTubeId": "Z5GdRK-Xq9w",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z5GdRK-Xq9w"
      }
    },
    {
      "id": "205afa88-67c7-482a-aa3c-94e920b6e0fb",
      "title": "Episode #11 Interview with Sarah Schaaff (part 2)",
      "description": "Part 2 of our interview with Sarah Schaaff, Ariyl\u0027s daughter. Sarah shares her experience not only as a child member of the House of Yahweh, but the daughter of one of the top elders in the cult.",
      "release": "2020-09-28T14:47:58Z",
      "duration": "00:29:41",
      "explicit": false,
      "youTubeId": "xOCn6vC3tM4",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xOCn6vC3tM4"
      }
    },
    {
      "id": "d582f76d-afce-4dd2-89b5-02577833e5d2",
      "title": "Episode #11 Interview With Sarah Schaaff (Part 1)",
      "description": "Sarah Schaaff is Ariyl\u0027s daughter, she speaks with us about her experience as a child member of the House of Yahweh. She was also the daughter of one of the top ranking elders in the cult. This is a 2 part episode, so don\u0027t forget to watch the second half.",
      "release": "2020-09-28T14:21:32Z",
      "duration": "00:27:10",
      "explicit": false,
      "youTubeId": "YDq9056EIXQ",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YDq9056EIXQ"
      }
    },
    {
      "id": "b92a0db2-8f92-4a62-89ec-b7552fcaefc1",
      "title": "Episode #10 Melody\u0027s Interview With Philip Fuentes",
      "description": "Melody interviews Philip Fuentes about being married to Ariyl/Autumn who came out of the House of Yahweh about 20 years ago. He speaks about how he has supported her through the stress, healing \u0026 transition into living back in the \u0022world.\u0022",
      "release": "2020-09-21T11:02:05Z",
      "duration": "00:31:01",
      "explicit": false,
      "youTubeId": "XC1B_cECcGo",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XC1B_cECcGo"
      }
    },
    {
      "id": "260fbff7-c36d-4e1f-a4d5-c27a5ca0cd27",
      "title": "Episode #9 Ariyl\u0027s Interview with Mike Post",
      "description": "Ariyl interviews Mike Post about what it\u0027s like to be married to someone that was in a cult.",
      "release": "2020-09-15T00:41:35Z",
      "duration": "00:27:18",
      "explicit": false,
      "youTubeId": "vN-Ge8UHsH0",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vN-Ge8UHsH0"
      }
    },
    {
      "id": "ad672c1f-cf3b-42e4-b9da-5b3a26366da5",
      "title": "Episode #8 Interview with Leanne Edgar",
      "description": "Ariyl \u0026 Melody interview with Leanne Edgar who was in the House of Yahweh for 19 years. She shares her story \u0026 experiences.",
      "release": "2020-09-08T20:28:34Z",
      "duration": "01:00:49",
      "explicit": false,
      "youTubeId": "sG_H7uYMixw",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sG_H7uYMixw"
      }
    },
    {
      "id": "0a1a177a-7278-4cc9-a9b7-f209f71706a5",
      "title": "Episode #7 How Cults Work (Part 2)",
      "description": "This episode covers how \u0026 when people leave a cult, the after effects of leaving a cult, \u0026 recovering \u0026 healing after leaving a cult.",
      "release": "2020-08-31T21:31:25Z",
      "duration": "00:32:32",
      "explicit": false,
      "youTubeId": "oFoB55fDTsg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oFoB55fDTsg"
      }
    },
    {
      "id": "7276946c-6121-45bf-b236-996618175ae0",
      "title": "Episode #7 How Cults Work (Part 1)",
      "description": "Ariyl \u0026 Melody explain how cults work, Including the definition of a cult, who joins a cult, how they get members,how they keep members, \u0026 warning signs that you or someone you know might be in a cult.",
      "release": "2020-08-31T20:46:38Z",
      "duration": "00:36:51",
      "explicit": false,
      "youTubeId": "pRf3elimIrc",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pRf3elimIrc"
      }
    },
    {
      "id": "ea029eee-25ef-412d-8e29-1ba00c4b8abb",
      "title": "Episode #3 Ariyl\u0027s Interview with Sandra Dantin Keller",
      "description": "Sandra talks about her experience as a member \u0026 Kohanah in the House of Yahweh.",
      "release": "2020-08-27T15:38:52Z",
      "duration": "00:50:34",
      "explicit": false,
      "youTubeId": "lis-wTIbPAo",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lis-wTIbPAo"
      }
    },
    {
      "id": "08656a44-f0ae-4e88-8d50-4d301cc73a18",
      "title": "Episode #5 Melody \u0026 Ariyl talk about House of Yahweh terminology.",
      "description": "We explain House of Yahweh terminology for those who aren\u0027t familiar.",
      "release": "2020-08-26T14:19:10Z",
      "duration": "01:12:25",
      "explicit": false,
      "youTubeId": "dJD4BtpmuUA",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dJD4BtpmuUA"
      }
    },
    {
      "id": "415566be-4da9-4023-b2b6-6581125d801e",
      "title": "Episode #4 Melody\u0027s Interview with Damon Crawford",
      "description": "Melody interviews Damon Crawford about his experience as member of the House of Yahweh.",
      "release": "2020-08-26T13:58:59Z",
      "duration": "01:12:31",
      "explicit": false,
      "youTubeId": "WR4E9ZmrUSI",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WR4E9ZmrUSI"
      }
    },
    {
      "id": "d8623e72-21a2-4904-8bd0-ec78a6a5a959",
      "title": "Episode #2 Melody\u0027s Interview with Ariyl",
      "description": "Melody interviews Ariyl about her experience being a member of the House of Yahweh.",
      "release": "2020-08-26T13:42:03Z",
      "duration": "00:58:39",
      "explicit": false,
      "youTubeId": "ATWAmbFCs8A",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ATWAmbFCs8A"
      }
    },
    {
      "id": "bbef8780-1032-4d72-b3d2-3938014bb0f0",
      "title": "Episode #1 Ariyl\u0027s Interview with Melody Post",
      "description": "Ariyl interviews Melody about her experience in the House of Yahweh.",
      "release": "2020-08-26T13:22:13Z",
      "duration": "00:57:43",
      "explicit": false,
      "youTubeId": "Bf-RIP_YsHA",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Bf-RIP_YsHA"
      }
    },
    {
      "id": "2aec6648-b11b-402d-a9e4-d04d90d50fc5",
      "title": "Episode #6 Interview with Brandon Salo",
      "description": "Interview with sociologist \u0026 ex House of Yahweh member Brandon Salo. Brandon was a member of the house of Yahweh from the age of 6 to 18.   He speakings about the sociological construction of language \u0026 how it relates to cults.",
      "release": "2020-08-25T18:55:12Z",
      "duration": "01:01:27",
      "explicit": false,
      "youTubeId": "qEMWzuINgYI",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qEMWzuINgYI"
      }
    }
  ]
}