{
  "_ts": 0,
  "id": "bcdd202c-cb43-46fc-93fa-107182b5b454",
  "name": "Cultimatum-The Culture of Cults \u0026 Human Trafficking",
  "spotifyId": "4GlmLKnbLUFPui5f7tizAQ",
  "appleId": 1744145655,
  "episodes": [
    {
      "id": "acf07211-393b-4d07-87ba-79a181c47635",
      "title": "Oh No what have I done?  I rented a room to Jeff \u0026 Shaleia",
      "description": "EP#5 This is an original recording I did with a woman named Kat who rented a room to Jeff \u0026 Shaleia from TFU prior to when they started TFU. Below is the original description! Even the cover art is the original! EP#34 On this episode, we chat with a woman who rented a \u0022room\u0022 to Jeff \u0026 Shaleia back in 2016. At that time they were nobody. (Ok maybe still are?) At the time she had no idea who they were to become. This took place in Michigan (where they are based) but of course they hadn\u0027t started TFU yet. They were just two wandering nomads (double entendre) going from motel to house to car and in circles. You have got to hear this story. A great peak into the mindset of Jeff, possibly the most disturbed individual of our modern times. (Ok maybe some political figures and leaders of nations take that cake) But you can really get a picture of his goal to be a dominant figure in his demented world! I need more stories like this, so if you knew either of them prior to TFU please contact me. Of course you can be anonymous. After all this is the Anonymous Andrew Podcast! I want to thank Kat for stepping forward and sharing this experience with us.! Podcast Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-05T21:05:30Z",
      "duration": "00:58:06.4060000",
      "explicit": false,
      "spotifyId": "1F3qcwyUK73chtdvBvznje",
      "appleId": 1000654605619,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1F3qcwyUK73chtdvBvznje",
        "apple": "https://podcasts.apple.com/podcast/oh-no-what-have-i-done-i-rented-a-room-to-jeff-shaleia/id1744145655?i=1000654605619"
      }
    },
    {
      "id": "1bd5693d-1cc8-4fa6-8ebb-3b53c2128f51",
      "title": "Laura Marie Jenks-Twin Flames Universe - Discussion",
      "description": "Ep#4 This was previously aired on the Anonymous Andrew Podcast. This episode launched the concept of investigating cults. We are reduxing it it under the new podcast show Cultimatum. Laura Jenks came to me to share her story and concern with the Twin Flames Universe Cult. She felt that TFU was smearing the concept of a real Twin Flame Union. I would like to thank Laura for coming forward. Literally without her, our new podcast show Cultimatum might never have been born! Original description Ep# 28 I am disgusted by this Twin Flame Universe. I invite Laura Marie Jenks on this episode to discuss the concept of a twin flame and the Twin Flame Universe Cult. Laura is in a Twin Flame relationship by her definition. (Not one of TFU) She shares her concept and origin of the phrase \u0022Twin Flame\u0022. We hope to continue this conversation on this podcast. This organization needs to be outed further. Ultimately brought to their knees. If you are a family member or ex-member of TFU or know any knowledge, including the legal aspect of how they are getting away with this, and would like to be interviewed, please contact me. I would like to thank Laura Marie Jenks for stepping up and speaking out. To connect with Laura on Snapchat. Snapchat: lauraa-mariieee Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-03T12:39:09Z",
      "duration": "01:05:14.3960000",
      "explicit": false,
      "spotifyId": "0l92oApiUcPOeLbqUXaLI1",
      "appleId": 1000654433446,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0l92oApiUcPOeLbqUXaLI1",
        "apple": "https://podcasts.apple.com/podcast/laura-marie-jenks-twin-flames-universe-discussion/id1744145655?i=1000654433446"
      }
    },
    {
      "id": "d0100a06-e8ae-4a63-a8bd-571ae949a728",
      "title": "Is Jehovah Witness a cult? We Think So and so does former Elder Gary",
      "description": "Ep#3 Jehovah Witness, we all know them. They come knocking on our doors every Sunday morning. Are they considered a cult? We speak with Gary a former member of JW for 40 years and was an elder. Gary shares his story of being in JW and how his life is today and his thoughts on whether they are a cult. Cultimatum Contact info Email: cultimatumpodcast@gmail.com Facebook: https://www.facebook.com/groups/1910498486077283 Facebook Cult Escape \u0026 Recovery Support Group\u0022 If you are a survivor or escaped a cult or a Human Trafficking Situation, and would like to share your story we would love to hear from you. Cultimatum is a safe haven for you. We would love to hear from you. Join our Cultimatum cult support group on Facebook or Melody\u0027s group \u0022Cult escape \u0026 recovery Support Group\u0022",
      "release": "2024-05-03T10:52:54Z",
      "duration": "01:18:14.7780000",
      "explicit": false,
      "spotifyId": "6DzbBRZGdVRjjSnGJn9U1j",
      "appleId": 1000654424896,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6DzbBRZGdVRjjSnGJn9U1j",
        "apple": "https://podcasts.apple.com/podcast/is-jehovah-witness-a-cult-we-think-so-and-so/id1744145655?i=1000654424896"
      }
    },
    {
      "id": "54bfe330-46c6-43e2-b312-63290d73d13f",
      "title": "Melody My co-host shares her Cult Escape \u0026 Survival story.",
      "description": "Ep#2 My co-host Melody is interviewed. This was recorded before we teamed up and was aired on Anonymous Andrew Podcast. But as all the cults recording belong here now we are moving them over slowly and methodically. So Melody will kick off the podcast will her story.. Until we have all the epsiodes moved over and add some new ones, It may seem a little chaotic as Melody is my co-host in some of them but going forward she ill be in most if not all of them. I want to thank Melody as she has been amazing at helping me start this podcast. This is not just my podcast but melody\u0027s too, So sit back and listen to Melody story. And away we go! Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-02T00:44:57Z",
      "duration": "00:51:45.9590000",
      "explicit": true,
      "spotifyId": "7puOGctHv2EI8O6jLpqvup",
      "appleId": 1000654234064,
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7puOGctHv2EI8O6jLpqvup",
        "apple": "https://podcasts.apple.com/podcast/melody-my-co-host-shares-her-cult-escape-survival-story/id1744145655?i=1000654234064"
      }
    },
    {
      "id": "4d97a40b-4512-4a0a-8cae-ba77bc627402",
      "title": "Cultimatum-The Culture of Cults-Pilot",
      "description": "Ep#1 PILOT. From the studio of Anonymous Andrew Podcast we bring to you a podcast dedicated to exposing cults \u0026 human trafficking organizations. Investigating \u0026 reporting the egregious practices, brainwashing, recruiting techniques etc. More importantly it is a safe haven for ex-members \u0026 survivors who were able to escape, leave and/or get out to tell their story. Many, if not all are traumatized and their lives are changed forever. Once out, they face the challenge of putting their lives back together. But these challenges that lie ahead of them are unimaginable. Anonymous Andrew from the Anonymous Andrew Podcast is joined my Melody, an ex-member of a cult herself to co-host this show. We hope this show brings awareness to the fact that cults around the US and worldwide are very much alive and thriving and preying on so many vulnerable people. We hope to also bring hope to this who might still be in a cult or being trafficked that there is hope and life on the other side! Melody and I (Anonymous Andrew) begin our journey on investigating cults from around the world and right here in the USA. It is amazing how many there are and how they get away with so much debauchery. Joins us as we expose these cults with ex-members and survivors who tell their story! You are not alone! Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-04-30T10:56:35Z",
      "duration": "00:31:02.3210000",
      "explicit": true,
      "spotifyId": "2EHdaELWZXGapwjoonfw7d",
      "appleId": 1000654159753,
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2EHdaELWZXGapwjoonfw7d",
        "apple": "https://podcasts.apple.com/podcast/cultimatum-the-culture-of-cults-pilot/id1744145655?i=1000654159753"
      }
    }
  ]
}