{
  "_ts": 0,
  "id": "bcdd202c-cb43-46fc-93fa-107182b5b454",
  "name": "Cultimatum-The Culture of Cults \u0026 Human Trafficking",
  "spotifyId": "4GlmLKnbLUFPui5f7tizAQ",
  "appleId": 1744145655,
  "episodes": [
    {
      "id": "5589df66-2bc7-45d5-8270-e2c46376cbe8",
      "title": "Interview With Ex-Cult Member Anonymous Franklin",
      "description": "Cultimatum Ep#18 : Growing Up in Another Cult with Franklin Originally aired on the Anonymous Andrew podcast in February 2024. Original Description: Ep#39: Series #6 - Franklin\u0027s Story In Series #6 of the TFU Pod-series, Franklin (anonymous name) comes forward to share his experience growing up in a cult that his parents belonged to. This is not an ex-member of TFU but another cult. However, he was triggered by the publicity of TFU and wants to share how much it impacts him today, many years later. Franklin shares his experience growing up in a cult and his thoughts and opinions on TFU. This is one of the books Franklin referred to Extraordinary Popular Delusions and The Madness of Crowds: All Volumes - Complete and Unabridged Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-16T17:40:38Z",
      "duration": "01:08:15.6860000",
      "explicit": false,
      "spotifyId": "3uyOiDxTHyPcsEoB6SrwL9",
      "appleId": 1000659184389,
      "subjects": [
        "Saint Germain Foundation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uyOiDxTHyPcsEoB6SrwL9",
        "apple": "https://podcasts.apple.com/podcast/interview-with-ex-cult-member-anonymous-franklin/id1744145655?i=1000659184389"
      }
    },
    {
      "id": "8b339c82-f1b0-48c4-81ba-c61aee2a1ba5",
      "title": "Paulette Buchanan\u0027s  Journey Against Cult Leaders",
      "description": "Ep#17 Summary: Paulette\u0027s Journey Against Cult Leaders In this compelling episode, we delve into the extraordinary story of Paulette, a resilient individual who has faced significant challenges due to her brother\u0027s involvement in an online cult. Her brother, struggling with mental illness, became a cult leader, leading Paulette to endure years of harassment, threats, and frivolous lawsuits. Key Discussion Points: The Need for Licensing of Leaders: Paulette advocates for the licensing of leaders in religious, self-help, and spiritual groups. She discusses how cult leaders often misuse religion to evade accountability and taxes. Understanding Cults: With a wealth of knowledge about cults and their leaders, Paulette provides insights into how these groups operate. She emphasizes the importance of educating the public on the mechanisms of cults. Failures of Law Enforcement and Government Agencies: Paulette critiques the inadequate response of law enforcement and government agencies in addressing the threats posed by cults. She calls for increased responsibility and action from these institutions to protect society. Paulette\u0027s Resilience and Advocacy: Despite her struggles, Paulette remains positive and continues her advocacy work. She shares details about her book, offering a deeper look into her experiences and the strength she has found to keep moving forward. Join us in this episode as Paulette provides a profound and educational perspective on the dangers of cults, the need for better regulatory measures, and the strength required to fight against such adversities. Paulette\u0027s Book on Amazon: https://www.amazon.com/Fighting-Justice-Religious-Illness-Collapse-ebook/dp/B09MXSKD4N Paulette\u0027s Book Website: https://fightingforjusticebook.com/ Paulette\u0027s Website against abusive lawsuits: https://stopabusivelawsuits.com/ Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-15T12:00:26Z",
      "duration": "01:10:11.5910000",
      "explicit": false,
      "spotifyId": "38YEomKKigpAshmZlP0eVt",
      "appleId": 1000659105690,
      "subjects": [
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38YEomKKigpAshmZlP0eVt",
        "apple": "https://podcasts.apple.com/podcast/paulette-buchanans-journey-against-cult-leaders/id1744145655?i=1000659105690"
      }
    },
    {
      "id": "cd1be4c0-9f62-44ba-8273-3f9834fd4ccd",
      "title": "Exploring Twin Flames Universe and NXIVM with Ellen",
      "description": "Cultimatum Ep#16 : Exploring Twin Flames Universe and Nexium Originally aired on the Anonymous Andrew podcast in February 2024. Original Description: Ep#41: Taking a Break and Exploring New Avenues I have released 6 episodes (This will be number 7) on the Twin Flames Universe Cult. I am going to take a break from that as I wait for more guests and information to come in. This was an impromptu endeavor. I have some people working on getting more guests and information. If all that pans out I will do a Part 2. On today\u0027s episode, I may look into other cults; this is a work in progress. I am still working on healing myself and learning how to go back out into the dating world. I have many episodes to bring you. Stay tuned! 2024 is just getting started! Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-09T18:00:27Z",
      "duration": "00:47:54.1220000",
      "explicit": false,
      "spotifyId": "7tVTFoTp5pt9gqcCJQTqU0",
      "appleId": 1000658372721,
      "subjects": [
        "Twin Flames Universe",
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tVTFoTp5pt9gqcCJQTqU0",
        "apple": "https://podcasts.apple.com/podcast/exploring-twin-flames-universe-and-nxivm-with-ellen/id1744145655?i=1000658372721"
      }
    },
    {
      "id": "1e00729a-caac-42d9-ac00-e5472c440447",
      "title": "The Cult Story Never Told  Part 2 with Ari Sherwood",
      "description": "Ep#15 (Part 2): Ari\u0027s Deeper Dive into Her Cult Experience In this follow-up episode, Ari returns to delve deeper into the intricacies of her experience with the shaman and doomsday cult. She provides an in-depth look at the leader, his past, and the bizarre teachings that held the group in thrall. The Leader\u0027s Manipulative Tactics Ari describes the leader\u0027s complex persona, from his claims of being a former member of a Satanic cult to his subsequent assertions of being Jesus. She reveals how he manipulated members by planting false memories, including supposed past lives and alien abductions. Control and Coercion Ari explains the coercive techniques the leader used to maintain control over her and others. His grandiose claims and persuasive tactics created an environment of fear and dependency. Ari’s detailed account sheds light on the psychological manipulation and abuse within the cult. Understanding the Cult Dynamics Through Ari\u0027s story, we gain a deeper understanding of how such a leader can exert immense control over his followers. Her narrative highlights the importance of recognizing and addressing the signs of such manipulative and coercive behavior. Join us as Ari bravely shares more about her journey, offering invaluable insights into the workings of a cult and the enduring strength it takes to break free. Podcast Link coming soon! Ari\u0027s Instagram : https://www.instagram.com/intrinsicagency/ Ari\u0027s TikTok : https://www.tiktok.com/@disallusioned8?lang=en Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-08T16:14:08Z",
      "duration": "01:06:00.4500000",
      "explicit": false,
      "spotifyId": "7vy2grGGXDTozB5efnttGP",
      "appleId": 1000658269855,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vy2grGGXDTozB5efnttGP",
        "apple": "https://podcasts.apple.com/podcast/the-cult-story-never-told-part-2-with-ari-sherwood/id1744145655?i=1000658269855"
      }
    },
    {
      "id": "4058763b-a736-412c-b076-91b94158dcb8",
      "title": "Twin Flames Universe Discussion with Alana MaKenzie",
      "description": "Cultimatum Ep#14 : Dissecting the Twin Flames Universe Cult with Alana McKenzie Initially broadcasted on the Anonymous Andrew Podcast in February of 2024, this episode delves into the captivating realm of the Twin Flames Universe Cult with the esteemed Sovereign Dating Coach, Alana McKenzie. Renowned for her profound understanding of feminine energy dynamics, McKenzie and I embark on a thought-provoking exploration of the TFU cult. Together, we meticulously dissect the enigmatic concept of a \u0022twin flame,\u0022 interrogating its existence and relevance in contemporary discourse. Original Description: Ep#36: Exploring the Twin Flames Universe Cult with Alana McKenzie Sovereign Dating Coach Alana McKenzie joins me to discuss the Twin Flames Universe Cult. She is an expert on feminine energy. We go deep in discussion about the TFU cult. Alana and I discuss the concept of a \u0022twin flame\u0022—is there really such a thing? Alana\u0027s Information: website: https://www.sovereign-dating.com/ Facebook: https://www.facebook.com/sovereigndating IG: https://www.instagram.com/sovereigndating/ YouTube: https://www.youtube.com/channel/UCLSDMJAIRm11j8FRP4-Nrsw Linkedin: https://www.linkedin.com/in/alana-mckenzie-page-a3262073 Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-06-02T22:05:29Z",
      "duration": "01:02:30.9220000",
      "explicit": false,
      "spotifyId": "7HCPNAD6J0WtTelgDl3nNZ",
      "appleId": 1000657597202,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7HCPNAD6J0WtTelgDl3nNZ",
        "apple": "https://podcasts.apple.com/podcast/twin-flames-universe-discussion-with-alana-makenzie/id1744145655?i=1000657597202"
      }
    },
    {
      "id": "d900c3bb-ac44-4d7e-baad-d69836258b70",
      "title": "The Worldwide Church of God -Interview With Ex-Member Cherie",
      "description": "Episode #13: Cherie joins us to share her experience of being raised in the Worldwide Church of God (currently called Grace Communion International). This is an organization started by Herbert W. Armstrong in 1933. She shares her thoughts on being brainwashed and disfellowshipped. Cherie also gives insight into the after effects of leaving such a controlling group, including her struggles with anxiety and feelings of being lost. You will hear how Cherie chose to raise her own children in contrast to how she was raised. It is in this episode that we learn about Cherie\u0027s healing journey and the Facebook support group she created so that other survivors can find support and guidance. Cherie\u0027s Facebook support group Cult survivors from Worldwide church of God, and their offshoots https://www.facebook.com/share/wZwPqs27KjCkc1nV/?mibextid=A7sQZp Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-31T17:19:28Z",
      "duration": "01:02:32.4110000",
      "explicit": false,
      "spotifyId": "6vpjma6zWlV8P5uAYS8MvU",
      "appleId": 1000657437481,
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6vpjma6zWlV8P5uAYS8MvU",
        "apple": "https://podcasts.apple.com/podcast/the-worldwide-church-of-god-interview-with-ex-member-cherie/id1744145655?i=1000657437481"
      }
    },
    {
      "id": "23290d83-3fe6-4340-9ab1-405081abd8a2",
      "title": "Author \u0026 Cult Survivor Kimalee Finelli, Cross Independent Baptist Church",
      "description": "Episode #12 In this episode Kimalee shares what it was like for her and her family growing up in the Cross Independent Baptist church in a small town. The Reverend of the church taught that he had been placed in authority directly by God. To question him was equivalent to questioning God himself. She shares how she left, her path to healing, what she believes and where she is today. Aside from that, Kimalee discusses her book, based on her own experiences. Kimalee\u0027s Info: A direct link to Kimalee\u0027s book Under Authority: https://amzn.to/3KYm3oc Her website: www.kimaleefinelli.com Facebook link : https://www.facebook.com/Kimalee.Finelli Instagram: https://www.instagram.com/kimaleefinelli/ Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-27T17:51:10Z",
      "duration": "00:47:05.0900000",
      "explicit": false,
      "spotifyId": "53B13fUBXdj128VQT7Jui1",
      "appleId": 1000656947807,
      "urls": {
        "spotify": "https://open.spotify.com/episode/53B13fUBXdj128VQT7Jui1",
        "apple": "https://podcasts.apple.com/podcast/author-cult-survivor-kimalee-finelli-cross-independent/id1744145655?i=1000656947807"
      }
    },
    {
      "id": "53fb6b65-898d-4fee-af7c-7544d35333b9",
      "title": "TFU-Sarah shares her TFU experience",
      "description": "Ep#11 Like Laura, Sarah shares her knowledge about the real concept of Twin Flames and How TFU is making a mockery of the concept Please bare with us as we migrate all the shows from Anonymous Andrew to Cultimatum! Original description of this episode from Anonymous Andrew Podcast Ep#30 I invite on a member of one of the Facebook groups that have started supporting the families and ex -members and friends of people who are still in the cult. As promised I am doing an in depth investigation into TFU, supporting the people who have been effected by this disgraceful organization. Todays guest shares her story of her Twin Flame relationship and how it is nothing like what is promised by TFU. If you or anyone you know would like to be part of this journey of exposing further TFU please contact me. You can also join the Facebook groups: Escaping Twin Flames Discussion Group \u0026 Twin Flames Universe Exposed where there are thousands of members supporting those who are family members who are cutoff from their sons and daughters still in the cult and anyone who got out. I would like to thank Anonymous Sarah for sharing her story. She cannot be contacted hence the anonymity! Cultimatum Contact Info: Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-26T20:07:03Z",
      "duration": "00:52:15.6860000",
      "explicit": false,
      "spotifyId": "32AQZsi2m1qlgZPJQFnFUX",
      "appleId": 1000656824041,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/32AQZsi2m1qlgZPJQFnFUX",
        "apple": "https://podcasts.apple.com/podcast/tfu-sarah-shares-her-tfu-experience/id1744145655?i=1000656824041"
      }
    },
    {
      "id": "7f289e90-5a0d-4004-9aa4-3d9fe2beb825",
      "title": "The Message Cult with Rebekah",
      "description": "EP#10 The Message Cult. Rebekah shares her story. This episode was difficult to record \u0026 listen to. Extra trigger warning on this one! We want to thank Rebekah very much for her courage to tell her story! Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-24T16:01:03Z",
      "duration": "01:10:22.0140000",
      "explicit": false,
      "spotifyId": "2AW4hsuIcx4lOesc4vpekW",
      "appleId": 1000656660117,
      "subjects": [
        "William M. Branham"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AW4hsuIcx4lOesc4vpekW",
        "apple": "https://podcasts.apple.com/podcast/the-message-cult-with-rebekah/id1744145655?i=1000656660117"
      }
    },
    {
      "id": "4561a9f1-84a8-46a0-b873-7aa7c3e47651",
      "title": "Let Us Prey-Jessica-IFB",
      "description": "Ep#9 This episode previously aired on Anonymous Andrew Podcast. Jessica shares her story about IFB Here is the original description: Ep#59 In this Cultimatum episode, Jessica shares her story and experience in the IFB or Independent Fundamental Baptist (movement). \u0022Let us Prey\u0022 is a docuseries about this scandalous cult. Melody co-hosts as we talk to Jessica about her escape and her journey healing the trauma she endured as a member of this cult. There is a trigger warning as the subject of sexual abuse \u0026 rape comes up! I want to thank Jessica very much for her bravery to share this horrible experience. I am doing this pod-series as I had no idea how many of these cults are out there. How many people have been affected by them. I am thinking of dedicating a new Podcast to Cults and human trafficking survivors and deep divers into this dark world. Stay tuned for updates on that thought Cultimatum: a pod series dedicated to those survivors of cults and human trafficking is hosted by Anonymous Andrew \u0026 Melody. I want to thank Melody for her time and work behind the scenes. She runs a facebook group for cult survivors called Cult Escape \u0026 Recovery Support Group. If you would like to share your story of escaping a cult or human trafficking-please contact us below. Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-19T19:43:58Z",
      "duration": "01:08:58.7880000",
      "explicit": false,
      "spotifyId": "6H0aaP3XpA9I6EmnbazGN1",
      "appleId": 1000656074387,
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6H0aaP3XpA9I6EmnbazGN1",
        "apple": "https://podcasts.apple.com/podcast/let-us-prey-jessica-ifb/id1744145655?i=1000656074387"
      }
    },
    {
      "id": "815ca85b-26e2-4d17-88d1-4145b772958f",
      "title": "The Cult Story Never Told-Ari Sherwood",
      "description": "Ep#8 One doesn\u0027t have to belong to a large cult, or a known cult to escape or to be traumatized. Ari was pulled in to a shaman and doomsday cult. A cult with no name. Her story is quite amazing and so is Ari! This episode contains both cult and human trafficking subject matter. Ari is starting her own podcast. She is also coming back to do a part 2 to her story. I want to thank Ari for coming forward and wish her success on her new podcast! If you would like to share your story of escaping a cult or human trafficking-please contact us below. Cultimatum Contact Info: Podcast Contact info: Email: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-18T11:00:36Z",
      "duration": "00:57:36.6790000",
      "explicit": false,
      "spotifyId": "4vXrNKe9ldHlldGQELW1ML",
      "appleId": 1000655995406,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vXrNKe9ldHlldGQELW1ML",
        "apple": "https://podcasts.apple.com/podcast/the-cult-story-never-told-ari-sherwood/id1744145655?i=1000655995406"
      }
    },
    {
      "id": "e54e260b-8be7-4b37-a7dd-054a16b32167",
      "title": "Who is Megan Plante? High school friend share her memories!",
      "description": "Ep# 6-A high school friend shares what Megan Plante (Shaleia) was like in her HS years. This episode is available on YouTube with pictures of Megan from HS. Lest anyone think I have sympathy for Megan, I do not, this is just a peek into her background and what leads someone from going from an introvert to a cult leader. You can view it here: https://www.youtube.com/@anonymousandrewpodcast The Facebook groups that have helped and supported the project are: Twin Flames Universe Exposed https://www.facebook.com/groups/709424757504933 \u0026 Escaping the twin Flames Discussion Group https://www.facebook.com/groups/678696511031522 To contact me if you wish to be on the podcast to share anything you have about this topic is my info: Cultimatum Contact Info: Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-13T10:01:00Z",
      "duration": "00:49:06.9510000",
      "explicit": false,
      "spotifyId": "2iTWJ3QDpZFtkxB1k5OyIj",
      "appleId": 1000655400509,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2iTWJ3QDpZFtkxB1k5OyIj",
        "apple": "https://podcasts.apple.com/podcast/who-is-megan-plante-high-school-friend-share-her-memories/id1744145655?i=1000655400509"
      }
    },
    {
      "id": "11f80d97-8188-453b-9ae3-b9e267989f2c",
      "title": "Potter\u0027s-House-CFM-with Mandy",
      "description": "Ep#6 On this episode, (Original Cultimatum) Melody \u0026 I talk with Mandy, an ex-cult member and survivor of \u0022The Potter\u0027s House Christian Fellowship Ministries (CFM)\u0022 also known as the Christian Fellowship Ministries, They are a religious group that exhibits cult-like behaviors and practices, We would like to thank Mandy for her strength and courage to speak out! If you would like to share your story of escaping a cult-please contact us below. Cultimatum Contact Info: Podcast Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-12T15:44:24Z",
      "duration": "00:59:25.1650000",
      "explicit": false,
      "spotifyId": "5VbgJ6NGi5pCkhY8fLKYrC",
      "appleId": 1000655323957,
      "subjects": [
        "Potter\u0027s House Christian Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5VbgJ6NGi5pCkhY8fLKYrC",
        "apple": "https://podcasts.apple.com/podcast/potters-house-cfm-with-mandy/id1744145655?i=1000655323957"
      }
    },
    {
      "id": "acf07211-393b-4d07-87ba-79a181c47635",
      "title": "Oh No what have I done?  I rented a room to Jeff \u0026 Shaleia",
      "description": "EP#5 This is an original recording I did with a woman named Kat who rented a room to Jeff \u0026 Shaleia from TFU prior to when they started TFU. Below is the original description! Even the cover art is the original! EP#34 On this episode, we chat with a woman who rented a \u0022room\u0022 to Jeff \u0026 Shaleia back in 2016. At that time they were nobody. (Ok maybe still are?) At the time she had no idea who they were to become. This took place in Michigan (where they are based) but of course they hadn\u0027t started TFU yet. They were just two wandering nomads (double entendre) going from motel to house to car and in circles. You have got to hear this story. A great peak into the mindset of Jeff, possibly the most disturbed individual of our modern times. (Ok maybe some political figures and leaders of nations take that cake) But you can really get a picture of his goal to be a dominant figure in his demented world! I need more stories like this, so if you knew either of them prior to TFU please contact me. Of course you can be anonymous. After all this is the Anonymous Andrew Podcast! I want to thank Kat for stepping forward and sharing this experience with us.! Podcast Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-05T21:05:30Z",
      "duration": "00:58:06.4060000",
      "explicit": false,
      "spotifyId": "1F3qcwyUK73chtdvBvznje",
      "appleId": 1000654605619,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1F3qcwyUK73chtdvBvznje",
        "apple": "https://podcasts.apple.com/podcast/oh-no-what-have-i-done-i-rented-a-room-to-jeff-shaleia/id1744145655?i=1000654605619"
      }
    },
    {
      "id": "1bd5693d-1cc8-4fa6-8ebb-3b53c2128f51",
      "title": "Laura Marie Jenks-Twin Flames Universe - Discussion",
      "description": "Ep#4 This was previously aired on the Anonymous Andrew Podcast. This episode launched the concept of investigating cults. We are reduxing it it under the new podcast show Cultimatum. Laura Jenks came to me to share her story and concern with the Twin Flames Universe Cult. She felt that TFU was smearing the concept of a real Twin Flame Union. I would like to thank Laura for coming forward. Literally without her, our new podcast show Cultimatum might never have been born! Original description Ep# 28 I am disgusted by this Twin Flame Universe. I invite Laura Marie Jenks on this episode to discuss the concept of a twin flame and the Twin Flame Universe Cult. Laura is in a Twin Flame relationship by her definition. (Not one of TFU) She shares her concept and origin of the phrase \u0022Twin Flame\u0022. We hope to continue this conversation on this podcast. This organization needs to be outed further. Ultimately brought to their knees. If you are a family member or ex-member of TFU or know any knowledge, including the legal aspect of how they are getting away with this, and would like to be interviewed, please contact me. I would like to thank Laura Marie Jenks for stepping up and speaking out. To connect with Laura on Snapchat. Snapchat: lauraa-mariieee Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-03T12:39:09Z",
      "duration": "01:05:14.3960000",
      "explicit": false,
      "spotifyId": "0l92oApiUcPOeLbqUXaLI1",
      "appleId": 1000654433446,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0l92oApiUcPOeLbqUXaLI1",
        "apple": "https://podcasts.apple.com/podcast/laura-marie-jenks-twin-flames-universe-discussion/id1744145655?i=1000654433446"
      }
    },
    {
      "id": "d0100a06-e8ae-4a63-a8bd-571ae949a728",
      "title": "Is Jehovah Witness a cult? We Think So and so does former Elder Gary",
      "description": "Ep#3 Jehovah Witness, we all know them. They come knocking on our doors every Sunday morning. Are they considered a cult? We speak with Gary a former member of JW for 40 years and was an elder. Gary shares his story of being in JW and how his life is today and his thoughts on whether they are a cult. Cultimatum Contact info Email: cultimatumpodcast@gmail.com Facebook: https://www.facebook.com/groups/1910498486077283 Facebook Cult Escape \u0026 Recovery Support Group\u0022 If you are a survivor or escaped a cult or a Human Trafficking Situation, and would like to share your story we would love to hear from you. Cultimatum is a safe haven for you. We would love to hear from you. Join our Cultimatum cult support group on Facebook or Melody\u0027s group \u0022Cult escape \u0026 recovery Support Group\u0022",
      "release": "2024-05-03T10:52:54Z",
      "duration": "01:18:14.7780000",
      "explicit": false,
      "spotifyId": "6DzbBRZGdVRjjSnGJn9U1j",
      "appleId": 1000654424896,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6DzbBRZGdVRjjSnGJn9U1j",
        "apple": "https://podcasts.apple.com/podcast/is-jehovah-witness-a-cult-we-think-so-and-so/id1744145655?i=1000654424896"
      }
    },
    {
      "id": "54bfe330-46c6-43e2-b312-63290d73d13f",
      "title": "Melody My co-host shares her Cult Escape \u0026 Survival story.",
      "description": "Ep#2 My co-host Melody is interviewed. This was recorded before we teamed up and was aired on Anonymous Andrew Podcast. But as all the cults recording belong here now we are moving them over slowly and methodically. So Melody will kick off the podcast will her story.. Until we have all the epsiodes moved over and add some new ones, It may seem a little chaotic as Melody is my co-host in some of them but going forward she ill be in most if not all of them. I want to thank Melody as she has been amazing at helping me start this podcast. This is not just my podcast but melody\u0027s too, So sit back and listen to Melody story. And away we go! Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-05-02T00:44:57Z",
      "duration": "00:51:45.9590000",
      "explicit": true,
      "spotifyId": "7puOGctHv2EI8O6jLpqvup",
      "appleId": 1000654234064,
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7puOGctHv2EI8O6jLpqvup",
        "apple": "https://podcasts.apple.com/podcast/melody-my-co-host-shares-her-cult-escape-survival-story/id1744145655?i=1000654234064"
      }
    },
    {
      "id": "4d97a40b-4512-4a0a-8cae-ba77bc627402",
      "title": "Cultimatum-The Culture of Cults-Pilot",
      "description": "Ep#1 PILOT. From the studio of Anonymous Andrew Podcast we bring to you a podcast dedicated to exposing cults \u0026 human trafficking organizations. Investigating \u0026 reporting the egregious practices, brainwashing, recruiting techniques etc. More importantly it is a safe haven for ex-members \u0026 survivors who were able to escape, leave and/or get out to tell their story. Many, if not all are traumatized and their lives are changed forever. Once out, they face the challenge of putting their lives back together. But these challenges that lie ahead of them are unimaginable. Anonymous Andrew from the Anonymous Andrew Podcast is joined my Melody, an ex-member of a cult herself to co-host this show. We hope this show brings awareness to the fact that cults around the US and worldwide are very much alive and thriving and preying on so many vulnerable people. We hope to also bring hope to this who might still be in a cult or being trafficked that there is hope and life on the other side! Melody and I (Anonymous Andrew) begin our journey on investigating cults from around the world and right here in the USA. It is amazing how many there are and how they get away with so much debauchery. Joins us as we expose these cults with ex-members and survivors who tell their story! You are not alone! Contact info: cultimatumpodcast@gmail.com Cultimatum Facebook Group: https://www.facebook.com/groups/1910498486077283 Cult Escape \u0026 Recovery Support Group: https://www.facebook.com/groups/2575419069406501 To contact the Anonymous Andrew Podcast Studios anonymousandrewpodcast@gmail.com or visit www.anonymousandrewpodcast.com",
      "release": "2024-04-30T10:56:35Z",
      "duration": "00:31:02.3210000",
      "explicit": true,
      "spotifyId": "2EHdaELWZXGapwjoonfw7d",
      "appleId": 1000654159753,
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2EHdaELWZXGapwjoonfw7d",
        "apple": "https://podcasts.apple.com/podcast/cultimatum-the-culture-of-cults-pilot/id1744145655?i=1000654159753"
      }
    }
  ]
}