{
  "id": "5f75da85-4c27-4f43-90d2-aacc3dab7004",
  "name": "Cults Anon",
  "spotifyId": "3w5HJTyUZlD5a9RwQH0sNT",
  "appleId": 1705784552,
  "episodes": [
    {
      "id": "903b4773-7a65-4585-a9e0-31a2012daa22",
      "title": "Ep. 9: The Moonies- The Most Influential Cult You\u0027ve Never Heard of Part 3",
      "description": "Welcome to Cults Anon, the podcast where we talk about Cults!   Since the illusive rapture appears to be remaining ever imminent join me again this week for part three of our deep dive into the Unification Church of the United States, better known as the \u0022Moonies\u0022 after their founder and charismatic leader Sun Myung Moon. We pick up the Moonie\u0027s saga this week with Moon\u0027s rise to international wealth and power throughout the 1970\u0027s by back door-dealing, profiteering, and sex trafficking. Do the Moonies worship Jesus? Nope. Do they worship money, sex, and AK-47\u0027s? They sure do! Do they have a terrifying level of political influence in the United States government? Of course! What nefarious cult doesn\u0027t? So lets talk about it.   *Content Warning* This podcast contains reference to material that some listeners may find disturbing including descriptions of war crimes, sexual assault, rape, the sexual assault of children, and murder. Please listen with awareness and always practice self care.",
      "release": "2023-11-13T22:07:40Z",
      "duration": "00:41:54.1800000",
      "explicit": false,
      "spotifyId": "4TDN8Zec4CuAFjkaPbWHNe",
      "appleId": 1000634699307,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4TDN8Zec4CuAFjkaPbWHNe",
        "apple": "https://podcasts.apple.com/podcast/ep-9-the-moonies-the-most-influential-cult-youve/id1705784552?i=1000634699307"
      }
    },
    {
      "id": "902017cd-20c4-4186-80cc-297cdcaf1b6c",
      "title": "Ep 8: Breaking News in Cults: Announcing Rapture Watch 2023",
      "description": "Welcome to Rapture Watch 2023!  We are interrupting our regularly scheduled programing to bring you breaking news updates from the world of cults- the Rapture may really be on for 2023. The mormons are on the move with fundamentalist groups like AVOW and even the church of the first born son making the news from Utah to Idaho. The Jehova\u0027s Witnesses are changing their messaging from spreading the good news of the coming of the lord to the bad news that it\u0027s too late and your doomed. And we dig deep into the white whale of cults-the Zionist Movement- in a frank discussion of the surprising origins and motivations of the state of Israel and the sinister role christian fundamentalism is playing in the deeply tragic assault of Gaza. If you haven\u0027t been snatched up to heaven yet then join me again this week and lets talk about it.   Content Warning: This podcast contains references to material some listeners may find disturbing including descriptions of war crimes, murder, child abuse, and sexual assault. Please listen with awareness and always practice self-care.",
      "release": "2023-11-06T22:04:19Z",
      "duration": "01:21:46.5860000",
      "explicit": false,
      "spotifyId": "6qSH3CPTwyKNoAb90bu6bm",
      "appleId": 1000633906437,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6qSH3CPTwyKNoAb90bu6bm",
        "apple": "https://podcasts.apple.com/podcast/ep-8-breaking-news-in-cults-announcing-rapture-watch-2023/id1705784552?i=1000633906437"
      }
    },
    {
      "id": "ffcf94e5-ba8a-4007-b02d-fd1beae97dd4",
      "title": "Ep. 7 The Moonies: The Most Influential Cult You\u0027ve Never Heard Of Part 2",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!   Join me this week for part two of our deep dive into the Unification Church of The United States better known as the \u0022Moonies\u0022 after their founder and charismatic leader Sun Myung Moon. This week we pick up Moon\u0027s saga in the 1960\u0027s with his infiltration of post world war II Japanese, Korean, and American societies as a supposed christian religious organization. Do the Moonies worship Jesus? Nope. Do they worship money, sex, and AK-47\u0027s? They sure do! Do they have a terrifying level of political control in the United States government? Of course! What nefarious cult doesn\u0027t? So lets talk about it.   *Content Warning* This podcast contains reference to material that some may find disturbing including descriptions of war crimes, sexual assault, rape, the sexual assault of children, and murder. Please listen with awareness and always practice self care.",
      "release": "2023-10-23T20:48:55Z",
      "duration": "00:32:15.4880000",
      "explicit": false,
      "spotifyId": "0KWBVaBMzHnqd0EzxswwEb",
      "appleId": 1000632333256,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0KWBVaBMzHnqd0EzxswwEb",
        "apple": "https://podcasts.apple.com/podcast/ep-7-the-moonies-the-most-influential-cult-youve/id1705784552?i=1000632333256"
      }
    },
    {
      "id": "3bfd23ed-4811-4f25-95ab-5bc62b62384b",
      "title": "Ep.6 The Moonies: The Most Influential Cult You\u0027ve Never Heard of Part 1",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!   Join me this week as we begin to pick apart the snarled mess of international political espionage, human sex trafficking, messianic delusions, and CIA backed psychological operations that is the Unification Church of the United States, better known as \u0022The Moonies\u0022 after their posthumous charismatic leader and founder Sun Myung Moon. Do they worship Jesus? Nope. Do they worship money, sex, and AK-47\u0027s? They sure do! Do they have a terrifying level of political control over the United States Government? Of course! What nefarious cult doesn\u0027t? So lets talk about it.   *Content Warning*: This podcast contains reference to material that some may find disturbing including descriptions of war and sexual assault. Please listen with awareness and practice self-care.",
      "release": "2023-10-16T15:00:00Z",
      "duration": "00:38:26.5720000",
      "explicit": false,
      "spotifyId": "6uxIxZl5iReA6XF6pJyMPs",
      "appleId": 1000631499755,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6uxIxZl5iReA6XF6pJyMPs",
        "apple": "https://podcasts.apple.com/podcast/ep-6-the-moonies-the-most-influential-cult-youve/id1705784552?i=1000631499755"
      }
    },
    {
      "id": "8f7a4766-458c-4609-9333-4df80d934c81",
      "title": "Ep. 5: Ruby Franke and Jodi Hildebrandt Pt 2: Connexions and Moms of Truth",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults!  Join me this week for part two of our deep dive into the arrest of popular \u0022momfluencer\u0022 Ruby Franke and her business partner Jodi Hildebrandt after Franke\u0027s starving and injured children escaped from the basement of Hildebrandt\u0027s home in August. In part two we focus on Jodi Hildebrandt\u0027s side of the story, exploring her unethical for profit counseling service \u0022Connexions\u0022 and how she and Ruby Franke came together under a disturbing ideology they called \u0022Moms of Truth\u0022 to justify their horrific abuse of Franke\u0027s children. Lets talk about it.   Created by Bailey Rivers *Content Warning* This podcast makes reference to material that may be disturbing for some listeners including reference to child abuse, sexual assault, rape, domestic violence, and the exploitation of minors. Please listen with awareness and always practice self-care.",
      "release": "2023-10-09T15:00:00Z",
      "duration": "00:38:15.0180000",
      "explicit": false,
      "spotifyId": "5GADltc3sMtXAunkXZKzlw",
      "appleId": 1000630712051,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GADltc3sMtXAunkXZKzlw",
        "apple": "https://podcasts.apple.com/podcast/ep-5-ruby-franke-and-jodi-hildebrandt-pt-2-connexions/id1705784552?i=1000630712051"
      }
    },
    {
      "id": "ebeb9dba-7eb9-48b2-9ecf-2625fe8c3e81",
      "title": "Ep. 4: Ruby Franke and Jodi Hildebrandt Part 1: Eight Passengers",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults from the perspective of recovery!  Join me this week for a deep dive into the controversies surrounding the recent arrest of popular youtube \u0022momfluencer\u0022 Ruby Franke on child abuse charges after her starving and injured children escaped from the basement of her therapist Jodi Hildebrandt\u0027s home. In this first half of a two part episode on the complicated situation we will discuss the possible influences of fundamentalist christian cults on the Franke\u0027s parenting and lifestyle choices as well as the affect the toxic culture surrounding the problematic \u0022family vlog\u0022 genre of social media content. Lets talk about it.   Created By Bailey Rivers  *Content Warning* This podcast makes reference to material that may be disturbing for some viewers including reference to child abuse, sexual assault, rape, domestic violence, and the exploitation of minors.",
      "release": "2023-10-02T16:00:00Z",
      "duration": "00:40:04.3950000",
      "explicit": false,
      "spotifyId": "67q2AkG5UkiszVD9A3OjkR",
      "appleId": 1000629930729,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67q2AkG5UkiszVD9A3OjkR",
        "apple": "https://podcasts.apple.com/podcast/ep-4-ruby-franke-and-jodi-hildebrandt-part-1-eight/id1705784552?i=1000629930729"
      }
    },
    {
      "id": "b9e83913-6461-4565-9df0-014136d00183",
      "title": "Ep.3: The Radical Act of Refusal",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults from the perspective of recovery!  Join me this week as we explore the profound social, political, and historical significance of the radical act of refusal. We will learn about the different methods that can be employed to refuse to participate in actions or labor that is in direct opposition to your individual higher good and how you can exercise the act of refusal in your life to become a stronger and more independent person.   Created By Bailey Rivers   *Content Warning* This podcast makes reference to material that may be disturbing for some viewers including references to physical violence.",
      "release": "2023-09-25T16:00:00Z",
      "duration": "00:26:29.0160000",
      "explicit": false,
      "spotifyId": "6HAZfSAeAqDGdgBWPRMfk8",
      "appleId": 1000629096474,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6HAZfSAeAqDGdgBWPRMfk8",
        "apple": "https://podcasts.apple.com/podcast/ep-3-the-radical-act-of-refusal/id1705784552?i=1000629096474"
      }
    },
    {
      "id": "2e922143-c212-45cd-adc7-1a03cb369a9f",
      "title": "Ep. 2: Jonestown: A Grim Lesson",
      "description": "Welcome to Cults Anon, the podcast where we talk about cults from the perspective of avoidance and recovery!  Join me this week for a frank discussion of one of the most notorious cult-related incidents in American history widely remembered as \u0022The Jonestown Massacre\u0022. We will examine the possible psychology and motivations behind cult leader Jim Jones while reviewing the escalating series of events that culminated in the heartbreaking tragedy of the Jonestown Massacre where over nine hundred people lost their lives in a single day. By accurately remembering and acknowledging the past we can hope to learn vital lessons about how to prevent similar tragedies in the present. Listener Discretion is advised.   Created by Bailey Rivers  *Content Warning* This podcast makes reference to material that may be disturbing for some listeners including topics of physical violence, abuse, child abuse, sexual assault, rape, self-harm, and murder. Listen with caution and always practice self-care.",
      "release": "2023-09-18T16:00:00Z",
      "duration": "00:45:31.4570000",
      "explicit": false,
      "spotifyId": "17ykHAtVA4YhsbqC5YG6AS",
      "appleId": 1000628281897,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/17ykHAtVA4YhsbqC5YG6AS",
        "apple": "https://podcasts.apple.com/podcast/ep-2-jonestown-a-grim-lesson/id1705784552?i=1000628281897"
      }
    },
    {
      "id": "4f779884-b3d0-41dd-82ed-275a7e6402f4",
      "title": "Cults Anon Trailer",
      "description": "Welcome To Cults Anon! The podcast where we talk about cults. Join me as we examine the dangerous set of behavioral patterns that turn an healthy community into a toxic cult and we learn and discuss the skills and techniques to identify, avoid, and even escape from high-control groups. Remember, information is power, autonomy is sacred, and joy is the antidote to fear. New episodes available every Monday where you get your podcasts!",
      "release": "2023-09-11T16:00:00Z",
      "duration": "00:01:25.2810000",
      "explicit": false,
      "spotifyId": "5EM4GIlBVNR4CTGXTEV8Xf",
      "appleId": 1000627493820,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5EM4GIlBVNR4CTGXTEV8Xf",
        "apple": "https://podcasts.apple.com/podcast/cults-anon-trailer/id1705784552?i=1000627493820"
      }
    },
    {
      "id": "3d67a1be-4aba-4fb8-8fc1-61ad58cefbb7",
      "title": "Ep.1: What is a cult? The BITES Model",
      "description": "Welcome to Cults Anon, the new podcast about cults! We approach the topic of cults and similar high-control groups through the lens of recovery: like a support group for people who no longer want to be in a cult. If you are in a high-control group and are looking for the support and advice on how to leave, or if you want to learn more about cults in order to avoid them in the future, then this is the podcast for you! Join us every Monday for a new episode exposing the toxic traits and strategies of cult leaders, learning the history of various cult organizations, and practicing the techniques of personal autonomy and self realization that foster true individual sovereignty.   In this introductory episode we tackle the basic question: What is a cult? We explain the BITE model developed by behavioral analyst and cult survivor Steven Hassan and the slightly altered BITES model that we will utilize in this podcast going forward as well identifying other common features that make up a cult.   Created by Bailey Rivers  *Content Warning* This podcast makes reference to material that may be disturbing for some listeners including the topics of physical violence, abuse, child abuse, sexual assault, rape, self-harm, and murder. Listen with caution and always practice self-care.",
      "release": "2023-09-04T16:00:00Z",
      "duration": "00:35:13.4900000",
      "explicit": false,
      "spotifyId": "0r1dxxk2Lc3n5D6VGbvV5i",
      "appleId": 1000626735807,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0r1dxxk2Lc3n5D6VGbvV5i",
        "apple": "https://podcasts.apple.com/podcast/ep-1-what-is-a-cult-the-bites-model/id1705784552?i=1000626735807"
      }
    }
  ]
}