{
  "_ts": 0,
  "id": "923575d2-c6aa-4e34-8c54-2842367c899f",
  "name": "Cult Report Podcast",
  "youTubeChannelId": "UCf96mIxresjyaKdaXNJjoWQ",
  "episodes": [
    {
      "id": "6c52eafa-e063-4c73-a291-7db3fdcf27ad",
      "title": "Cult Report  |  Episode 2  |  Movement for the Restoration of the Ten Commandments of God (MRTCG)",
      "description": "Ever heard of the Movement for the Restoration of the Ten Commandments of God (MRTCG)? This Ugandan religious group met a tragic end in 2000.\n\nKey Takeaways:\n• The MRTCG emerged in Uganda during a time of chaos and suffering.\n• Founded by Credonia Muerande and Joseph Kibbutir, who claimed visions of the Virgin Mary.\n• Had strict beliefs, including absolute obedience to the Ten Commandments and preparation for the apocalypse.\n• Faced tension with the Catholic Church, further fueling their apocalyptic worldview.\n• Believed the world would end in 1999, but when it didn\u0027t, they clung even tighter to their beliefs.\n• In 2000, a mass murder occurred at their compound, with hundreds of bodies found in mass graves.\n• The exact circumstances of the deaths remain a mystery, with theories ranging from poisoning to suicide pacts.\n• This tragic event sheds light on the dangers of cults and the importance of critical thinking.\n\nRemember: Cults can happen anywhere. Stay informed and protect yourself.",
      "release": "2024-09-26T11:30:23Z",
      "duration": "00:11:59",
      "explicit": false,
      "youTubeId": "fOk3VFK6C-U",
      "subjects": [
        "Movement for the Restoration of the Ten Commandments of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fOk3VFK6C-U"
      }
    },
    {
      "id": "71719e42-b675-4d66-bf8d-2b39431c4c08",
      "title": "Cult Report   |   Season 1   |   Episode 1   |   Cult Manipulation Tactics",
      "description": "Ever felt a primal fear around the word \u0022cult\u0022? We explore the psychology of cults and how they manipulate people. Experts like Mark Travers and Dr. Janja Lalich provide insights. We discuss the Jonestown Massacre to illustrate the dangers.\n\nKey Takeaways:\n• Cults are groups with a charismatic leader, demanding devotion, and limiting critical thinking.\n• They exploit basic human needs like belonging and purpose.\n• Tactics include cognitive dissonance, social influence, and manipulation.\n• Red flags: excessive devotion, isolation, mind-altering practices.\n• Trust your gut, do research, and reach out for help.\n\nRemember: Cults can happen anywhere. Stay informed and protect yourself.",
      "release": "2024-09-23T19:45:00Z",
      "duration": "00:12:45",
      "explicit": false,
      "youTubeId": "J_kdT0nO0-U",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J_kdT0nO0-U"
      }
    }
  ]
}