{
  "_ts": 0,
  "id": "33c949ca-63d6-4bea-952e-4f98b5443d1e",
  "name": "Cults and the Culting of America",
  "spotifyId": "7lL8zWAk6UXZk8l7hf0Z6n",
  "appleId": 1756133150,
  "youTubeChannelId": "UCuFRBZ2w3QsYs7Km69keHsg",
  "youTubePlaylistId": "PLEM2mhO5Zn0kaJUhb-ndgpx0LwmiygAI0",
  "episodes": [
    {
      "id": "53f799e8-ec81-4a6a-9342-331e785cac47",
      "title": "What Sex Cults and War Have in Common",
      "description": "About: Welcome to \u0022Cults and the Culting of America,\u0022 where we delve into the fascinating and often disturbing world of cults, extreme groups, and toxic leadership. I’m your host, Scott Lloyd, and today I\u0027m thrilled to be joined by Daniella Mestyanek Young, a renowned scholar and author of the gripping memoir \u0022Uncultured.\u0022 Daniella\u0027s journey from being born into the notorious Children of God cult to serving in the United States Army offers a unique perspective on the parallels between these vastly different yet similarly controlling environments. Join us as we explore her extraordinary story and the insights she’s gained Connect with Scot at: https://www.tiktok.com/@thescotloyd Connect with Daniella at: My Patreon: https://www.patreon.com/GroupBehaviorGal TikTok: @daniellamestyanekyoung Instagram: @_daniellamyoung https://www.uncultureyourself.com/ Youtube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg UnAMERICAN Videobook Get the book: UNCULTURED: A Memoir \u0022A propulsive memoir delivered in the honest tones of a woman who didn\u0027t always think she\u0027d live to tell her story.\u0022 --NYT See a Sample Chapter in Rolling Stone Magazine See a Sample Chapter in The Sydney Herald Words in: Newsweek \u0026 Narratively Get a copy of UNCULTURED: Digital , Audio , or Hardcopy or preorder the paperback as a holiday gift for a friend. Get an Autographed copy here: https://uncultureyourself.com/pages/uncultured-autographed Shownotes: Welcome to \u0022Cults and the Culting of America,\u0022 the podcast where we delve into the world of cults, extreme groups, and toxic leadership. I\u0027m your host, Scott Lloyd, and I\u0027m thrilled to be here with Daniella Mestyanek Young, a scholar in this field and author of the compelling memoir, \u0022Uncultured.\u0022 Daniella, how are you today? Daniella: I\u0027m doing great, Scott! Thanks for having me. Scott: Fantastic! I\u0027m excited to kick off this podcast with you. I must say, your book \u0022Uncultured\u0022 has been an incredible resource for me. Growing up in a small Pentecostal cult, known as the United Pentecostal Church, your experiences really resonated with me. Throughout our podcast, I\u0027ll share some of my own stories, but your journey from the Children of God cult to the United States Army is extraordinary. Your book provides such a detailed account, and I highly recommend everyone read it. For those who prefer audio, it\u0027s available and even made it to the New York Times bestseller list. Daniella: Thank you so much, Scott. I\u0027m glad to hear the book has had such an impact. Scott: For our listeners who might not be familiar with your story, could you share a bit about your experiences? We’re titling this episode \u0022Patriot Pains: I Joined the Army and All I Got Was This Lousy Trauma,\u0022 and I’m particularly interested in how you compare your time in the Children of God cult with your service in the Army. Daniella: Absolutely. First, I want to clarify that while the media often labels the Children of God as a \u0022sex cult,\u0022 it\u0027s important to understand that cults, in general, share common patterns of behavior and control, regardless of their specific doctrines. That said, the Children of God did have a significant focus on sexual doctrines, which were central to their beliefs. I was born into the Children of God, three generations deep. My family was deeply embedded in its leadership—my grandmother donated the first house to the leader, David Berg, and my grandfather still manages the cult\u0027s finances. My father also played a significant role in handling the money. This is all detailed in my book, \u0022Uncultured.\u0022 The Children of God started in 1968 in California, like many cults of that era. David Berg took evangelical control of sex, mixed it with elements of Mormonism, and called it \u0022free love,\u0022 which I describe as forced polyamory. The cult rebranded itself over the years—from being labeled a \u0022harem photo sex cult\u0022 on the cover of Time Magazine in the 80s to performing at the White House in the 90s. Scott: Wow, that’s a remarkable transformation. Daniella: Yes, it is. But despite the rebranding, the core practices and control mechanisms remained the same. I was eventually kicked out at 15, and as you’ll see throughout this podcast, I was never someone who would conform to that environment. Scott: Your transition from the Children of God to the Army is fascinating. How did you end up comparing the two environments? Daniella: There are surprising similarities between extreme groups, whether it\u0027s a cult or a highly structured organization like the Army. Both environments use intense control and indoctrination techniques, which can be quite traumatic. My story is about navigating these systems and finding my own path. Scott: This is going to be an enlightening conversation. Thank you for sharing, Daniella. Let\u0027s dive into more of your experiences and insights.",
      "release": "2024-07-09T15:22:00Z",
      "duration": "01:05:41.2500000",
      "explicit": false,
      "spotifyId": "5Fk9SXrqQNJUCZ02GDRfFM",
      "appleId": 1000661675018,
      "subjects": [
        "Children Of God",
        "Evangelicalism",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Fk9SXrqQNJUCZ02GDRfFM",
        "apple": "https://podcasts.apple.com/podcast/what-sex-cults-and-war-have-in-common/id1756133150?i=1000661675018"
      }
    },
    {
      "id": "e729f870-da35-4881-9b87-159de6524623",
      "title": "Who We Are, and Why We Talk About Cults So Much",
      "description": "Welcome to the inaugural episode of \u0022Cults and the Culting of America\u0022 podcast! Join hosts Scott Lloyd and Daniella Mestyanek Young as they dive into the fascinating world of cults, extreme groups, and toxic leadership. In this episode, Daniella shares her journey from growing up in the notorious Children of God cult to joining the U.S. Army and becoming a scholar of cult dynamics. Discover the psychological tactics used by cults to control and manipulate followers, and learn how these methods appear in everyday groups and systems. Scott and Daniella discuss why cults are a hot topic today and explore the societal changes making people more vulnerable to cultic influences. Tune in for an insightful discussion on recognizing and understanding the toxic elements in groups and the importance of individual awareness. Don\u0027t miss this engaging introduction to a series that will unpack the complexities of cult behavior and its impact on society. Be sure to like, rate, and share this episode to help spread the word. Follow Daniella on social media and check out her books \u0022Uncultured\u0022 and \u0022UnAmerican\u0022 for more in-depth insights. Join us on this journey to uncover the truth about cults and their pervasive influence. Connect with Scot at: https://www.tiktok.com/@thescotloyd Connect with Daniella at: My Patreon: https://www.patreon.com/GroupBehaviorGal TikTok: @daniellamestyanekyoung Instagram: @_daniellamyoung https://www.uncultureyourself.com/ Youtube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg UnAMERICAN Videobook Get the book: UNCULTURED: A Memoir \u0022A propulsive memoir delivered in the honest tones of a woman who didn\u0027t always think she\u0027d live to tell her story.\u0022 --NYT See a Sample Chapter in Rolling Stone Magazine See a Sample Chapter in The Sydney Herald Words in: Newsweek \u0026 Narratively Get a copy of UNCULTURED: Digital , Audio , or Hardcopy or preorder the paperback as a holiday gift for a friend. Get an Autographed copy here: https://uncultureyourself.com/pages/uncultured-autographed Transcript Scot: Welcome to the \u0022Cults and the Culting of America\u0022 podcast! I\u0027m your host, Scott Lloyd, and I\u0027m here with Daniella Mestyanek Young, a scholar of cults, extreme groups, and extremely bad leadership. Daniella, how are you today? Daniella: I\u0027m doing great, Scott! How about you? Scot: I\u0027m good, thanks! I see you’ve been super busy lately. Every time I open Instagram or TikTok, you’re going live. How do you manage to talk so much from 7 a.m. to 5 p.m.? Daniella: (Laughs) It\u0027s funny you mention that. When recording the audiobook for \u0022Uncultured,\u0022 I discovered I have no trouble talking for seven to nine hours a day. While others worry about losing their voice, that wasn’t the hard part for me. Right now, I’m talking to a lot of people about cults, which are a hot topic these days. Historically, cults thrive during times of societal change because people crave clarity and leadership. Scot: That makes sense, given everything going on. Your book, \u0022Uncultured,\u0022 is fantastic and really sheds light on your experiences growing up in the Children of God cult and later joining the Army. I recently moved to Springfield, Illinois, and saw your book featured as a must-read at Barnes \u0026 Noble. Congrats on all the success! Daniella: Thank you so much! I love seeing those photos of \u0022Uncultured\u0022 in the wild. I appreciate the introduction. As you mentioned, I grew up in the Children of God cult, which is one of the worst you’ll hear about on this podcast. I later joined the U.S. Army and earned a master\u0027s degree in Industrial/Organizational Psychology from Harvard Extension School. Now, I’m a scholar of cults, extreme groups, and extremely bad leadership. I compare what I do to an intelligence officer\u0027s work, helping people understand group behavior and recognize cult tactics in everyday life. Scot: Absolutely. Your book has been a great resource in understanding my own experiences with the United Pentecostal Church, which had many cult-like behaviors, especially in policing the bodies of women. These groups often use appearance and attitude policing to control individuals, stripping away their individuality. Daniella: Exactly. Cults exist for labor and control, using predictable patterns of coercive control. Appearance and attitude policing are key tactics. We’ll discuss this more in our episode on self-sacrifice, but the goal is always to erase the individual for the group’s or leader’s benefit. Scot: That loss of individualism is a common thread in many cults and extreme groups. For example, in the Pentecostal church, the exuberant worship practices often lead to a collective loss of self, making individuals more susceptible to groupthink and control. Daniella: Yes, chanting and group activities make us highly susceptible to suggestion. It’s a common tactic in cults and other controlling environments. We’ll explore this further in the podcast, breaking down my 10-part definition of cults and comparing these tactics to behaviors in everyday groups and systems. Scot: I’m thrilled about this podcast and the opportunity to learn from you. Why do you think cults are such a hot topic right now? Daniella: America is going through significant societal changes, similar to the 70s. People are seeking clarity and community, making them more vulnerable to cults. Additionally, we’re revisiting social issues and questioning longstanding systems like patriarchy, racism, and capitalism. Cult tactics are everywhere, and it’s crucial to recognize them to navigate these systems better. Scot: Well said. This podcast aims to educate and help people understand the toxic elements in groups and systems. I invite everyone to join us on this journey. Like, rate, and share this episode to help us spread the word. Daniella, thank you for sharing your insights. Daniella: Thank you, Scott. To our listeners, get my book \u0022Uncultured\u0022 wherever books are sold, or check out my second book, \u0022UnAmerican,\u0022 on Patreon. Follow us on social media for more updates, and stay tuned for our next episode, where we’ll dive deeper into what makes a cult a cult. For Daniella, I’m Scott. See you next time on \u0022Cults and the Culting of America\u0022!",
      "release": "2024-07-04T12:48:00Z",
      "duration": "00:23:25.0740000",
      "explicit": false,
      "spotifyId": "2RItATOALXHw6LI678cGUW",
      "appleId": 1000661554957,
      "youTubeId": "XK8qNm1rXTc",
      "subjects": [
        "Children Of God",
        "Evangelicalism",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2RItATOALXHw6LI678cGUW",
        "apple": "https://podcasts.apple.com/podcast/who-we-are-and-why-we-talk-about-cults-so-much/id1756133150?i=1000661554957",
        "youtube": "https://www.youtube.com/watch?v=XK8qNm1rXTc"
      }
    }
  ]
}