{
  "id": "d5c2a1da-8785-468e-aa56-4b99b7cbd369",
  "name": "Cult Audit",
  "youTubeChannelId": "UCXKOIgaab0hnsfA3IChypRQ",
  "episodes": [
    {
      "id": "96ffb8c3-2d32-4bbb-b41d-50025f8a32c2",
      "title": "Exposing the WMSCOG Hidden Legal Documents: Resignation and Commitment Letters Revealed",
      "description": "I’m diving deep into some of the lesser-known tactics used by the World Mission Society Church of God (WMSCOG). We’ll be looking at two critical documents they have members sign: a resignation letter and a pledge of commitment. Both of these documents are filled with legal language and are part of the WMSCOG’s strategy to maintain control over its members. I’ll break down what these documents mean, how they’re used, and why it’s important to understand them if you or someone you know is involved with the group.\nDisclaimer: The information in this video is based on personal experiences and publicly available information. It is intended for educational and awareness purposes only. Any opinions expressed are my own and not intended to defame or misrepresent any individual or organization.\nIf you find this content helpful, please like, share, and subscribe. Let’s spread the word and help others stay informed.\n\n#WMSCOG #CultAwareness #ExposingCults #ReligiousControl #Documentary",
      "release": "2026-01-11T16:00:06Z",
      "duration": "00:21:34",
      "explicit": false,
      "youTubeId": "6m3SEfuFmdY",
      "subjects": [
        "World Mission Society Church of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6m3SEfuFmdY"
      }
    },
    {
      "id": "48a84292-9c9e-48b6-8112-0e773a5bdee3",
      "title": "Inside the WMSCOG: How They Use Information Control and Smear Tactics Against Ex-Members",
      "description": "In this video, we dive a little into how the World Mission Society Church of God (WMSCOG) maintains control over its members by spreading false rumors and cutting off communication with those who leave. You’ll see real examples of the kind of manipulation and brainwashing that happens, including a text exchange with a current member who turned hostile after I left the group.\nWatch as we expose how the WMSCOG shifts the narrative to isolate former members and spread lies about anyone who dares to leave. If you want to understand how these tactics work and how they keep members in the dark, you won’t want to miss this.\nIf you\u0027d like to support our work and future exposés, please consider donating to our GOFUNDME found in my Channels description.\n\nDisclaimer: This video is based on personal experiences and testimonies. The views expressed are solely those of the individuals involved and are not intended to defame or libel any organization or individual. All statements are made in good faith and for the purpose of public awareness.\n\n#CultAwareness\n#ExposingCults\n#WMSCOG\n#CultSurvivor\n#InformationControl\n#LeavingACult\n#MindControl\n#ReligiousManipulation\n#SurvivingCults\n#CultRecovery",
      "release": "2026-01-08T03:00:30Z",
      "duration": "00:25:43",
      "explicit": false,
      "youTubeId": "04Mn7f2jHjI",
      "subjects": [
        "World Mission Society Church of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=04Mn7f2jHjI"
      }
    },
    {
      "id": "25eebddb-c989-4ae0-93d6-5b723c7ed7f5",
      "title": "Eastern Lightning Cult Infiltration |TEASER|",
      "description": "Get ready for a first look at our upcoming documentary on the Eastern Lightning cult, a group quietly infiltrating communities in America. For six months, we went undercover inside this secretive organization to uncover the truth about its practices and the harm it\u0027s causing.\nIn this teaser, you\u0027ll get a glimpse of why this story needs to be told. If you believe in shining a light on these hidden issues, please consider supporting our work. \nYou can help fund this documentary through our GoFundMe: https://gofund.me/2dafa4e48\n\nThank you for being part of our journey to expose the truth.\n\nDisclaimer:\nThe content presented in this teaser reflects the personal experiences, research, and observations of the filmmakers during an undercover investigation. All claims are made in good faith and are supported by documented evidence, testimonies, or publicly available sources. This video is intended for educational, journalistic, and informational purposes.\n\n#doomsdaycult #cultawareness #cult",
      "release": "2026-01-05T02:00:06Z",
      "duration": "00:04:36",
      "explicit": false,
      "youTubeId": "iLAPx0c3cuE",
      "subjects": [
        "Eastern Lightning"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iLAPx0c3cuE"
      }
    },
    {
      "id": "f39f4fbe-9e3b-4502-b7ee-3df047d4d70c",
      "title": "Former Member Exposes Korean Doomsday Cult: The Lies of the WMSCOG",
      "description": "In this video, Adam, a former long-time member of the World Mission Society Church of God (WMSCOG), exposes the false teachings, contradictions, and deceptive practices within this Korean doomsday cult.\nAfter over a decade inside the church, Adam breaks his silence to reveal what really happens behind closed doors — including the manipulative doctrines, failed prophecies, and misinterpretations of the Bible that the WMSCOG uses to control its members.\nThis is not a story of how he joined — it’s an exposé of the church’s lies and the truth they don’t want you to hear.\nWatch until the end to hear Adam’s eye-opening insights on why the World Mission Society Church of God’s teachings do not align with Scripture and how the organization misleads sincere believers.\n\nGo follow Adams channel @FindingtheAlternative95 \n\nCopyright Disclaimer under Section 107 of the Copyright Act 1976:\nAllowance is made for “fair use” for purposes such as criticism, commentary, news reporting, teaching, and research. All media, clips, and materials used in this video are protected under fair use for educational and commentary purposes.\nViews and Opinions:\nThe views expressed in this video are Adam’s personal experiences, opinions, and interpretations based on his time in the World Mission Society Church of God.\nThey are shared for educational and informational purposes only.\nThis video does not intend to defame or harass any individual or organization, but to encourage open discussion and awareness about religious manipulation and spiritual abuse.\n\n#WMSCOG #CultExposed #KoreanCult  #DoomsdayCult #ExposingWMSCOG #CultAwareness  #FalseProphets #SpiritualDeception #ExposingCults #cults",
      "release": "2025-10-11T20:07:16Z",
      "duration": "00:11:13",
      "explicit": false,
      "youTubeId": "hCQ9zxdfp30",
      "subjects": [
        "World Mission Society Church of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hCQ9zxdfp30"
      }
    }
  ]
}