{
  "_ts": 0,
  "id": "3fa66969-5d44-4410-bc14-f97f95324855",
  "name": "Cults Exposed",
  "youTubeChannelId": "UCHLJRViYBH_xYV6BxgILqLA",
  "episodes": [
    {
      "id": "92d9f456-76df-42d7-9f1e-78bf897292e7",
      "title": "Con Artist Exposed: Shivananda Swamiji Fake Manifestaition Vibuthi Ash Trick Exposed on Italian TV",
      "description": "Uncover the truth behind Shivananda Swamiji, also known as Francesco Grassi, on Italian National TV performing a common Indian sleight of hand trick with \u0027Vibhuti\u0027 holy ash. This technique uses solid Vibhuti pellets, available to anyone online. Watch as our slow-motion analysis reveals Shivananda reaching into his robe, secretly pulling out pre-formed ash, and then pretending to magically produce it from his closed fist. By exposing this deception, we challenge his claims of being an avatar and demonstrate the mechanics of a well-known magic trick. Join us in uncovering the reality behind his supposed miraculous abilities in this detailed expose.\n\nSee Full Video Exposing Shivananda\u0027s Fraud \u0026 Manipulation:\nChannel Rete 4 on Mediaset Infinity show \u0022Fuori dal Coro,\u0022 reported on April 17, 2024. Journalist: Mario Giordano.\n\nFor further insight, we link to Vignana Darshini Ramesh\u0027s video from Vignana Darshini, an organization promoting science over superstition. Ramesh\u0027s video exposes how such tricks are executed, challenging the mystical claims of fake spiritual leaders. Discover how these alleged divine powers are nothing more than well-practiced illusions.\n\nLearn more about debunking such tricks here: Fake Baba\u0027s Magic Tricks || Vignana Darshini Ramesh:   \n\n • బాబాలు అరచేతిలో విభూతిని ఎలా సృష్టిస్...   \n\nScopri la verità su Shivananda Swamiji, noto anche come Francesco Grassi, che si esibisce in un comune trucco di prestigio indiano con la \u0027Vibhuti\u0027, la cenere sacra, durante una trasmissione della TV Nazionale Italiana. Questa tecnica utilizza pellet di Vibhuti solidi, disponibili per chiunque online. Guarda come la nostra analisi al rallentatore rivela Shivananda mentre raggiunge all\u0027interno del suo abito, estraendo segretamente cenere preformata, per poi fingere di produrla magicamente dal suo pugno chiuso. Esporre questa inganno mette in discussione le sue affermazioni di essere un avatar e dimostra la meccanica di un trucco magico ben noto. Unisciti a noi nel scoprire la realtà dietro le presunte abilità miracolose in questo dettagliato espose.\n\nGuarda il video completo che espone la frode e la manipolazione di Shivananda:\nCanale Rete 4 su Mediaset Infinity, programma \u0022Fuori dal Coro\u0022, riportato il 17 aprile 2024. Giornalista: Mario Giordano.\n\nPer ulteriori approfondimenti, colleghiamo al video di Vignana Darshini Ramesh, di Vignana Darshini, un\u0027organizzazione che promuove la scienza contro la superstizione. Il video di Ramesh mostra come vengano eseguiti tali trucchi, sfidando le affermazioni mistiche di falsi leader spirituali. Scopri come questi presunti poteri divini non siano altro che illusioni ben esercitate.\n\nPer saperne di più su come smascherare tali trucchi, clicca qui: Trucchi Magici dei Falsi Baba || Vignana Darshini Ramesh:   \n\n • బాబాలు అరచేతిలో విభూతిని ఎలా సృష్టిస్...",
      "release": "2024-04-20T11:56:19Z",
      "duration": "00:00:40",
      "explicit": false,
      "youTubeId": "u7sKXUPrFr0",
      "subjects": [
        "Shivananda Swamiji"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u7sKXUPrFr0"
      }
    }
  ]
}