{
  "id": "33c949ca-63d6-4bea-952e-4f98b5443d1e",
  "name": "Cults and the Culting of America",
  "spotifyId": "7lL8zWAk6UXZk8l7hf0Z6n",
  "appleId": 1756133150,
  "youTubeChannelId": "UCuFRBZ2w3QsYs7Km69keHsg",
  "youTubePlaylistId": "PLEM2mhO5Zn0kaJUhb-ndgpx0LwmiygAI0",
  "episodes": [
    {
      "id": "1e478ae5-c42d-43ce-8f73-43211a4bdaad",
      "title": "Cults \u0026 the Culting of America w/ Knitting Cult Lady \u0026 Dr. Scot Loyd | 63 | NA vs Opportunity",
      "description": "In this episode of Cults and the Culting of America, Daniella Mestyanek Young and Scot Loyd are joined by hip-hop artist, author, and activist Spryte the Emcee, who shares her deeply personal journey through addiction, recovery, and eventual deconstruction from Narcotics Anonymous. Spryte recounts a childhood shaped by trauma, loss, and instability, followed by immersion in NA after a near-fatal overdose. While the program initially provided safety and structure, it later became increasingly coercive and controlling, particularly when Spryte pursued higher education and personal growth. The conversation explores how high-control dynamics mirror those found in religious cults and the military: rigid hierarchies, fear-based retention, conditional community, and the prioritization of the institution over individual wellbeing. Spryte describes being discouraged from trauma-informed therapy, pressured into unpaid labor, silenced after reporting sexual assault, and threatened with relapse and death when she chose to leave. Daniella and Scot contextualize these experiences within broader patterns of cult behavior, emphasizing that lifesaving support and systemic harm can coexist. Together, the hosts and guest examine exit costs, the myth of unconditional community, and why institutions react so aggressively when former members tell their stories. The episode underscores the importance of autonomy, access to outside information, and the courage required to reclaim one\u0027s narrative after leaving a high-control group. Connect with Spryte: https://www.youtube.com/channel/UCAEKbb7_CXqw3YR0-9bIXUw https://music.apple.com/us/artist/spryte-the-emcee/1570347589 https://open.spotify.com/artist/778OSUERPBwTmqkPoQ8IQg Daniella\u0027s Links: Preorder for Culting of America: The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady Daniella Mestyanek Young\u0027s book: From Bookshop.org Uncultured Autographed: Connect with Daniella on social media TikTok Patreon Instagram Youtube Other Podcasts Daniella\u0027s other podcast: Hey White Women Scot\u0027s Socials TikTok: @thescotloyd Youtube: https://www.youtube.com/@thescotloyd Haley\u0027s Tiktok @nuancedmasculinities Key Takeaways Two things can be true at once: a group can provide real help while still being deeply harmful. 12-step programs can function as high-control groups when they rely on fear, hierarchy, and coercion. Conditional community is a major red flag—support often disappears once someone leaves. Trauma-informed therapy, not ideology, was key to Spryte\u0027s long-term healing. Institutions often react more strongly to members leaving than to harm happening within the group. Reporting abuse inside high-control groups is frequently discouraged or actively suppressed. Fear-based narratives about life \u0022outside\u0022 are used to prevent people from leaving. Hierarchies, tokens, ranks, and longevity are used to enforce conformity and obedience. Telling one\u0027s story threatens institutions more than it threatens individuals. True recovery and growth require autonomy, not lifelong submission to a system. Chapters 00:00 Introduction and Pushup Challenge 02:55 Sprite the MC: A Journey of Resilience 05:48 The Impact of Trauma and Recovery 08:35 Breaking Free from Cult Mindsets 11:22 The Struggles of Leaving a Support Group 14:12 The Cost of Leaving: Community and Isolation 17:12 The Reality of Support in Recovery 20:01 The Courage to Share Stories 22:51 Reflections on Personal Growth and Healing 25:00 The Illusion of Achievement in Recovery Programs 26:51 Hierarchies and Control in Group Dynamics 29:24 Breaking Free from Limiting Beliefs 30:57 The Disconnect Between Online and Real Life 33:03 The Impact of High Control Groups 35:51 Navigating Trauma and Personal Stories 39:33 The Healing Power of Sharing Experiences 41:41 Resilience and the Journey of Recovery Produced by Haley Phillips, Meghan Picmann, and Lizy Freudmann",
      "release": "2026-01-06T13:00:00Z",
      "duration": "00:49:46.2500000",
      "explicit": true,
      "spotifyId": "5h2ekDVaxTxfbXc2g9jTrG",
      "appleId": 1000743969165,
      "youTubeId": "XbXrX76z1Kg",
      "subjects": [
        "_America",
        "Children Of God",
        "Cult-Expert",
        "Alcoholics Anonymous"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5h2ekDVaxTxfbXc2g9jTrG",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000743969165",
        "youtube": "https://www.youtube.com/watch?v=XbXrX76z1Kg"
      }
    },
    {
      "id": "6508ebab-bc03-4d53-952a-3e483911ceed",
      "title": "Cults \u0026 The Culting of America w/ Knitting Cult Lady | 62 | Cognitive Dissonance Fact Check",
      "description": "In this episode of Cults and the Culting of America, Daniella sits down with political scientist Thomas Kelly to revisit one of the most foundational ideas in cult studies: cognitive dissonance. Their conversation centers on Leon Festinger\u0027s famous book When Prophecy Fails, which is often cited to explain why cult members double down on beliefs after predictions don\u0027t come true. Thomas walks through his research uncovering serious methodological and ethical problems with that original study, arguing that the historical record actually shows the opposite of what Festinger claimed. Rather than reinforcing belief, failed prophecy most often leads to attrition, disillusionment, and collapse. Together, Daniella and Thomas explore why this misunderstanding has shaped decades of cult research, how survivor voices were sidelined during the \u0022cult wars,\u0022 and why failed prophecies tend to wound groups far more than scholars once believed. The discussion expands into broader questions about coercive control, survivor testimony, ethical research methods, media involvement, and why people want prophecies to come true. The episode ultimately challenges listeners to rethink how we explain belief, persistence, and exit in high-control groups—and to be more skeptical of tidy psychological theories that ignore lived experience. Daniella\u0027s Links: Preorder for Culting of America: The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady Daniella Mestyanek Young\u0027s book: From Bookshop.org Uncultured Autographed: Connect with Daniella on social media TikTok Patreon Instagram Youtube Other Podcasts Daniella\u0027s other podcast: Hey White Women Scot\u0027s Socials TikTok: @thescotloyd Youtube: https://www.youtube.com/@thescotloyd Haley\u0027s Tiktok @nuancedmasculinities Key Takeaways When Prophecy Fails is deeply flawed and misrepresents what actually happened in Dorothy Martin\u0027s UFO cult. Historical evidence shows most groups do not grow stronger after failed prophecy; they fracture or dissolve. Festinger and his team interfered with the group they were studying, compromising the research. Cognitive dissonance as a concept does not stand or fall on this study, but the case should no longer be used as proof of belief \u0022doubling down.\u0022 Survivor voices were largely ignored during the development of cult scholarship, especially during the cult wars. Failed prophecy outcomes depend heavily on whether the prophecy is tied to a single charismatic authority or a broader interpretive framework (like scripture). Media attention played a significant role in shaping the cult\u0027s behavior before and after the prophecy failed. People in cults often want the prophecy to come true—it represents hope, purpose, and meaning. Coercive control is better understood through tactics and dynamics than rigid definitions of \u0022cult.\u0022 Studying real-world \u0022natural experiments\u0022 may offer better insight into belief and compliance than lab psychology studies. Chapters 00:00 Introduction to Cognitive Dissonance and Cults 01:21 Exploring \u0027When Prophecy Fails\u0027 and Its Implications 03:27 Critique of Festinger\u0027s Research and Methodology 06:28 Key Figures in the Study and Their Influence 07:56 Patterns in Cult Behavior and Promises of Space Travel 09:43 Failed Prophecies and Group Survival 10:56 Qualitative vs. Quantitative Research in Cult Studies 13:19 Ethical Considerations in Cult Research 17:55 The Complexity of Defining Cults 20:48 Cognitive Dissonance: Current Perspectives and Future Directions 27:44 The Quest for Belief: Cults and Prophecy 29:11 Media Influence on Cult Dynamics 30:31 After the Prophecy: Coping with Disappointment 32:24 The Psychology of Hope and Belief 34:06 Cognitive Dissonance: Understanding Belief Systems 36:59 Rethinking Cognitive Dissonance Studies 39:54 The Complexity of Cult Membership 43:44 Humanizing Cult Experiences 45:56 Personal Reflections on Cults and Immunity 51:14 Future Directions in Cult Research",
      "release": "2025-12-16T19:14:00Z",
      "duration": "00:53:04.3750000",
      "explicit": false,
      "spotifyId": "0B8YBQ0Nb2cAhOm7ExktUU",
      "appleId": 1000741573748,
      "youTubeId": "-XmCMo6OsbY",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0B8YBQ0Nb2cAhOm7ExktUU",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000741573748",
        "youtube": "https://www.youtube.com/watch?v=-XmCMo6OsbY"
      }
    },
    {
      "id": "a7c055b7-7cac-42e2-851b-213bccad942d",
      "title": "Cults \u0026 The Culting of America w/ Dr. Scot Loyd | 61 | Jewish Black Supremacy Cult",
      "description": "In this episode, guest Ara Jade shares her seven-year experience inside a high-control religious group adjacent to the Hebrew Israelite movement, known as the Israel of God. She recounts how she was drawn in through family influence, biblical study practices, and a strong sense of community, only to later encounter manipulation, racism-based doctrine, misogyny, surveillance, fear tactics, and emotional control. Ara describes specific red flags, including purity rules for women, the weaponization of Black identity, pressure to obey male authority, and her arranged-like marriage. She explains how her awakening unfolded through personal losses, marital betrayal, and finally being dismissed by leadership when seeking protection. Ara concludes with thoughtful advice for people questioning their involvement in high-control groups, emphasizing listening to intuition, seeking outside perspectives, asking hard questions, and being gentle with oneself during the process of leaving and grieving.\n  Daniella\u0027s Links:\n    Preorder for Culting of America:  The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady\n   Daniella Mestyanek Young\u0027s book: \n    From Bookshop.org\n    Uncultured  Autographed:\n     Connect with Daniella on social media \n    TikTok   Patreon   Instagram   Youtube    Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n Youtube: https://www.youtube.com/@thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Key Takeaways   The Israel of God mirrored Hebrew Israelite theology but distanced itself publicly while maintaining similar doctrines.\n   Black identity and biblical narratives were used to create belonging while simultaneously controlling members.\n   Fear-based teachings (hell, end times, impurity) played a key role in keeping members obedient.\n   Women were subjected to strict purity laws, gender hierarchy, and were often treated as property for marriage.\n   The community structure relied heavily on surveillance, gossip, and punitive social consequences.\n   Ara experienced pressure to marry men she did not choose, reflecting the group\u0027s patriarchal control.\n   Her father leaving the group, her grandmother passing away, and her husband\u0027s infidelity created a tipping point.\n   Church leaders minimized abuse, discouraged outside help, and expected spiritual authority over personal safety.\n   Leaving the group resulted in shunning but also clarity and relief.\n   Ara encourages listeners to trust gut feelings, seek outside information, and allow themselves compassion while exiting.\n   Missing aspects of the community after leaving is normal and part of healing.\n   Chapters\n 00:00 Introduction to Ara Jade\u0027s Journey\n 03:08 Understanding Hebrew Israelites and Their Beliefs\n 05:43 Ara\u0027s Experience with the Israel of God\n 08:33 Initial Attraction and Community Building\n 11:12 Red Flags and Cognitive Dissonance\n 13:56 The Weaponization of Fear and Control\n 16:30 Identity Stripping and Community Dynamics\n 18:54 The Role of Forgiveness in Manipulation\n 27:14 The Toxic Environment of the Cult\n 29:50 Questioning Beliefs and Doctrines\n 35:02 The Impact of Relationships and Marriage\n 39:32 Realizations and Leaving the Cult\n 46:12 Advice for Others in Similar Situations\n Produced by Haley Phillips, Meghan Picmann, and Lizy Freudmann",
      "release": "2025-12-10T14:01:00Z",
      "duration": "00:52:14",
      "explicit": false,
      "spotifyId": "45RqSfvSewbHEfkVrUI8BV",
      "appleId": 1000740674892,
      "youTubeId": "5SpjG5PP8z4",
      "subjects": [
        "Black Hebrew Israelites",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/45RqSfvSewbHEfkVrUI8BV",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-dr-scot-loyd-61/id1756133150?i=1000740674892",
        "youtube": "https://www.youtube.com/watch?v=5SpjG5PP8z4"
      }
    },
    {
      "id": "b60013d4-3ec6-4d13-b25a-f20ebf1e8462",
      "title": "Cults \u0026 The Culting of America w/ Knitting Cult Lady \u0026 Dr. Scot Loyd | 60 | Christian Science",
      "description": "This episode of Cults and the Culting of America features guest Emily Hulen, a massage therapist and trauma coach who grew up in Christian Science and later navigated additional cult-like environments. Emily describes the core beliefs of Christian Science — including the denial of physical reality, rejection of medical care, and heavy reliance on prayer as a means of erasing mortal experience. She shares harrowing examples of untreated medical issues in her family and her own childhood injuries and illnesses that went unaddressed.\n Emily traces her early cognitive dissonance, beginning around age ten, as she started comparing Christian Science ideas with Greek mythology and noticing inconsistencies. Her family\u0027s reaction to her questioning led to increased control, isolation, and punishment. She also explains overlapping dynamics of a family cult, with her mother acting as a controlling, narcissistic leader.\n Emily describes eventually leaving home, the challenges of early adulthood, and the emergence of PTSD symptoms in her romantic relationship. The episode highlights her healing journey through therapy modalities including CBT, DBT, IFS (Internal Family Systems), EMDR, and somatic work. Emily emphasizes how trauma shows up physically, how therapy helped her reclaim a sense of self, and how she now helps others through trauma-informed bodywork and coaching.\n Daniella and Scott connect Emily\u0027s experiences to broader patterns across cults and high-control systems (including the military), highlighting shared mechanisms such as intense rhetoric, personal blame, dissociation, and thought-terminating clichés. The episode closes with information about Emily\u0027s work and her perspective on reclaiming identity after trauma.\n Emily\u0027s Links:\n https://www.holisticechoes.com\n Contact: emily@holisticechoes.com\n  Daniella\u0027s Links:\n    Preorder for Culting of America:  The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady\n   Daniella Mestyanek Young\u0027s book: \n    From Bookshop.org\n    Uncultured  Autographed:\n     Connect with Daniella on social media \n    TikTok   Patreon   Instagram   Youtube    Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n KEY TAKEAWAYS   Christian Science denies physical reality, framing illness, injury, and even death as illusions created by \u0022mortal mind.\u0022\n   Medical neglect is common within the group; Emily and her family suffered severe, untreated medical conditions as a result.\n   Prayer functions as a \u0022window cleaning\u0022 practice — not communicating with God, but reaffirming perfection and denying suffering.\n   Children are taught to dissociate from physical experiences, creating lifelong structural dissociation patterns.\n   Emily began questioning the belief system around age ten, aided by secular homeschooling materials and internet access.\n   Her family reacted with increased control, isolation, and policing of thought, including banning books and restricting time outdoors.\n   Emily\u0027s home also functioned as a family cult, with her mother exerting authoritarian control and exploiting her children\u0027s labor.\n   Leaving her parents\u0027 home sparked PTSD symptoms, especially around conflict, anger, and household dynamics.\n   Trauma responses mirror old patterns, such as scanning for danger, over-responsibility, flinching, or misinterpreting neutral situations as threats.\n   Therapy — particularly IFS, EMDR, and somatic modalities — helped Emily repair trauma by meeting unmet needs and separating past from present.\n   Cult survivors often struggle with self-trust, identity, and fears of being seen as \u0022frauds.\u0022\n   Daniella and Scott note that cult dynamics and military culture share structural similarities, including high pressure, emotional suppression, and elevated rhetoric.\n   Healing involves reclaiming agency, challenging old wiring, and recognizing one\u0027s worth and capability.\n   Emily now helps others through trauma-focused bodywork and coaching, emphasizing that expertise can come from lived experience and extensive independent study.\n   Chapters\n 00:00 Introduction and Background of Emily Hulen\n 01:55 Understanding Christian Science and Its Impact\n 05:36 Personal Experiences with Medical Neglect\n 09:24 Dissociation and Cult Ideology\n 11:14 Red Flags and Awakening\n 16:02 Family Dynamics and Leaving the Cult\n 20:49 The Decline of Christian Science\n 26:40 Reflections on Healing and Moving Forward\n 28:28 The Impact of Medical Neglect in Cults\n 30:44 Healing from Cult Trauma\n 35:08 Navigating Relationships Post-Cult\n 39:44 Therapeutic Journeys and Self-Discovery\n 44:52 Integrating Past Trauma into Present Life\n 49:29 The Role of Education and Expertise in Healing\n Produced by Haley Phillips, Meghan Picmann, and Lizy Freudmann",
      "release": "2025-12-03T13:00:00Z",
      "duration": "00:55:08",
      "explicit": false,
      "spotifyId": "7io0nLZsESzmHUbTNbIkR1",
      "appleId": 1000739505488,
      "youTubeId": "oeu9UER6cAk",
      "subjects": [
        "Christian Science"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7io0nLZsESzmHUbTNbIkR1",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000739505488",
        "youtube": "https://www.youtube.com/watch?v=oeu9UER6cAk"
      }
    },
    {
      "id": "ac4a3412-44f4-4609-a67b-514339b4eae0",
      "title": "Cults \u0026 the Culting of America Podcast w/ Knitting Cult Lady | 59 | MAHA vs. Fertility Treatment",
      "description": "In this episode, Dr. Cynthia Brown discusses her journey in women\u0027s health and fertility, emphasizing the importance of understanding these topics beyond conventional medicine. The conversation explores the Maha movement and its impact on women\u0027s health, cultural perspectives on pregnancy and motherhood, and the dangers of extreme birthing practices. The discussion also touches on the romanticization of pain in motherhood, the need for community support in parenting, and the intersection of gender and medical care. Dr. Brown highlights the boy crisis and the influence of cult mentality on health choices, advocating for transparency in women\u0027s health discussions to empower women and improve outcomes.\n\nDr. Cyntia\u0027s Links\n\nhttps://www.kopelahealth.com/\n\nhttps://www.tiktok.com/@drcyntiabrownfertility\n\nhttps://www.threads.com/@dr.cyntiabrown\n\nDaniella\u0027s Links:\n\n  Go Fund Me for Culting of America: https://tr.ee/fldwYRFTJI\n\nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\n\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\n\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\n\nDaniella’s Tiktok: https://www.tiktok.com/@knittingcultlady?lang=en\n\nInstagram: https://www.instagram.com/stories/daniellamyoung_/\n\nUnamerican Videobook: https://tr.ee/ODM-qtUJaR\n\nSecret Practice Videobook: https://tr.ee/DGEY3IeQQm\n\nConnect with Scot Loyd\u0027s social media :https://www.tiktok.com/@thescotloyd\n\nTakeaways\n\nDr. Cynthia Brown emphasizes the importance of understanding women\u0027s health beyond conventional medicine.\n\nThe Maha movement often leads to misinformation about health and fertility.\n\nCultural beliefs significantly influence perceptions of pregnancy and motherhood.\n\nExtreme birthing practices can pose serious risks to mothers and babies.\n\nPain and suffering are often romanticized in discussions about motherhood.\n\nCommunity support is crucial for effective parenting and mental health.\n\nThe boy crisis highlights the need for better understanding of young men\u0027s issues.\n\nCults often promote a distrust of medical care, impacting health choices.\n\nTransparency in women\u0027s health discussions can empower better decision-making.\n\nThe conversation around parenting must include discussions about systemic issues.\n\nChapters\n\n00:00 Introduction to Women\u0027s Health and Personal Journey\n02:32 The Maha Movement and Its Impact on Women\u0027s Health\n05:29 Cultural Perspectives on Pregnancy and Motherhood\n08:20 The Dangers of Extreme Birthing Practices\n11:19 The Role of Pain and Suffering in Motherhood\n14:13 The Intersection of Personal Experience and Medical Advocacy\n16:58 The Systemic Issues in Maternal Health\n19:42 Community Support and the Modern Parenting Crisis\n22:36 The Cult of Suffering and Perfectionism\n25:14 The Search for Answers in a Complex Medical Landscape\n28:14 Conclusion: Balancing Traditional and Alternative Approaches\n34:59 The Culture of Pain and Control\n38:14 Toxic Masculinity and Medical Care\n41:46 The Skinny White Woman Concept\n46:25 Cults, Children, and Control\n50:18 The Boy Crisis and Gender Dynamics\n55:20 Raising Good Children in a Troubling World\n\nProduced by Haley Phillips, Meghan Picmann, and Lizy Freudmann",
      "release": "2025-11-25T13:00:00Z",
      "duration": "01:01:42",
      "explicit": false,
      "spotifyId": "2PI7VpTUcLgPHpUhaRl1bM",
      "appleId": 1000738347761,
      "youTubeId": "VkJ4y6IDEJ4",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2PI7VpTUcLgPHpUhaRl1bM",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-podcast-w-knitting/id1756133150?i=1000738347761",
        "youtube": "https://www.youtube.com/watch?v=VkJ4y6IDEJ4"
      }
    },
    {
      "id": "7797fb90-ab16-4884-a8bd-8cd7c6dcddda",
      "title": "Cults \u0026 the Culting of America w/ Knitting Cult Lady | 58 | America Branded Fascism",
      "description": "Content Warnings:\n   Sexual assault and child sexual abuse\n   Sex trafficking and the Epstein list\n   Cult dynamics, coercive control, and brainwashing\n   White supremacy, racism, xenophobia, and fascism\n   Historical violence, genocide, Nazism, U.S. colonial atrocities, police violence\n   Political extremism, MAGA, Trump administration actions\n   Death, including anticipated death of a political figure\n   Domestic extremism, ICE raids, and militarized responses\n   Cult-related childhood trauma and labor camp environments\n   In this episode Daniella (\u0022Knitting Cult Lady\u0022) and historian Amanda Nelson dive into the deep historical currents beneath modern American politics, arguing that the chaos of the Trump era isn\u0027t unprecedented but deeply rooted in American history. They examine how panic, white exceptionalism, and a lack of historical education shape public reactions to authoritarian behavior. The conversation highlights parallels between MAGA and cult structures, emphasizing how \u0022mission collapse\u0022 (such as the refusal to release the Epstein documents) destabilizes the movement.\n They explore how white Americans often misunderstand authoritarianism because they have been insulated from state violence, and how whiteness itself is a tool that can be used both to maintain oppressive systems and to dismantle them. They discuss protest strategy, noting that mass participation by everyday \u0022normies\u0022—especially white women—has historically been one of the few things authoritarian regimes respond to, even during Nazi Germany.\n The two discuss the limits of political institutions, the psychology of cult disengagement, and the likelihood that Trump himself will avoid legal accountability. They explore whether JD Vance would be \u0022worse,\u0022 ultimately concluding he would be more strategic but less chaotically dangerous. The episode closes with reflections on justice, narcissism, and the strange, painful reality that cult leaders often die unpunished, even as their followers suffer.\n  Amanda\u0027s Links:\n  tiktok\n  instagram\n  threads\n  youtube\n  facebook\n  Daniella\u0027s Links:\n    Preorder for Culting of America:  The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady\n   Daniella Mestyanek Young\u0027s book: \n    From Bookshop.org\n    Uncultured  Autographed:\n     Connect with Daniella on social media \n    TikTok   Patreon   Instagram   Youtube    Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n Youtube: https://www.youtube.com/@thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Key Takeaways   Panic feels productive but is politically ineffective; organized, sustained action is what matters.\n   White American panic often reflects unfamiliarity with state violence experienced by others.\n   U.S. authoritarianism has deep historical precedents, not just recent ones.\n   Americans default to Nazi comparisons due to limited education and universal patterns of authoritarianism.\n   National exceptionalism is a major red flag for cult-like thinking.\n   White women have historically not shown up in protest movements despite their cultural protection and organizing power.\n   Regimes often back down when \u0022normies,\u0022 especially white women, show up en masse to protest.\n   MAGA operates like a cult with a charismatic leader, transcendent mission, and predictable collapse pattern.\n   Trump\u0027s refusal to release the Epstein files broke the core promise of \u0022drain the swamp,\u0022 damaging the movement\u0027s internal stability.\n   People rarely leave cults with dramatic awakenings; exits are quiet and painful.\n   White women can use their social protection to shield more vulnerable groups during protests.\n   The U.S. population size and armed citizenry make totalitarian consolidation unstable and unsustainable.\n   JD Vance would be strategically dangerous but less chaotic and impulsive than Trump.\n   Cult leaders often avoid punishment; public anticipation of their downfall may be its own form of consequence.\n   The patriarchy is deeply entrenched, but mass exposure of crimes (like Epstein files) could destabilize political power.\n   Lack of historical literacy prevents people from recognizing authoritarian patterns.\n   \u0022Normie-led\u0022 protests are historically what end authoritarian pushes.\n   The MAGA movement is fracturing due to mission collapse and internal contradictions.\n   The conversation emphasizes harm reduction rather than fantasies of quick political salvation.\n   Mass organization, not despair, is the path to meaningful opposition.\n   Chapters\n 00:00 Introduction to American History and Culture\n 02:48 Understanding Panic and Historical Precedents\n 05:52 The Role of Race and Identity in American History\n 08:32 The Puritans and American Exceptionalism\n 11:28 Xenophobia and the American Identity\n 14:06 Protests and the Role of White Women\n 17:10 The Complexity of American Values\n 19:55 Cults, Authoritarianism, and American Politics\n 22:46 The Power of Collective Action\n 25:45 Conclusion and Call to Action\n 29:42 The Role of White Allies in Activism\n 34:03 The Power of Collective Action\n 36:45 The Epstein List and Its Implications\n 41:26 The Dichotomy of Child Protection in America\n 47:47 Political Perspectives on Leadership Changes\n Produced by Haley Phillips, Meghan Picmann, and Lizy Freudmann",
      "release": "2025-11-18T17:43:00Z",
      "duration": "00:55:22",
      "explicit": false,
      "spotifyId": "4wgJyf4uo6CGVK7X8NbkmH",
      "appleId": 1000737279069,
      "youTubeId": "TJuo8ngTbwY",
      "subjects": [
        "Cult Psychology",
        "Qanon",
        "Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wgJyf4uo6CGVK7X8NbkmH",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000737279069",
        "youtube": "https://www.youtube.com/watch?v=TJuo8ngTbwY"
      }
    },
    {
      "id": "d7462ee9-a277-464f-be15-109b8271cdd2",
      "title": "Cults \u0026 The Culting of America w/ Knitting Cult Lady \u0026 Dr. Scot Loyd | 57 | Born and Razed",
      "description": "Content Warning:\nThis episode contains discussions of religious and institutional abuse, child abuse, disordered eating, family estrangement, mental illness, trauma recovery, and medication withdrawal. Listener discretion is advised.\n\nIn this episode of Cults and the Culting of America, hosts Dr. Scot Loyd and Daniella Mestyanek Young speak with Beth Granger, author of Born and RAZED: Surviving the Cult Was Only Half the Battle. Beth shares her experience growing up at Grenville Christian College, a Canadian boarding school later revealed to be a religious cult connected to the Community of Jesus.\n\nShe describes the systematic control, emotional and physical abuse, and the long process of recovery and rediscovery that followed her escape. The conversation dives into the complexities of grief, family estrangement, and the enduring impact of coercive religious systems. Beth also discusses her role as a representative plaintiff in a landmark class-action lawsuit against the institution, and how advocacy, writing, and community have shaped her healing.\n\nThe episode ends with a reflective discussion about deconstruction, the search for meaning after leaving high-control groups, and what it means to “live with it” as an adult survivor.\n\nDisclaimer:\nThis conversation is for educational and storytelling purposes only. It is not medical, legal, or therapeutic advice.\nIf you or someone you know is struggling, resources are available:\n\n    National Alliance on Mental Illness (NAMI): 1-800-950-6264\n\n    Crisis Text Line: Text HOME to 741741 (US)\n\n    National Eating Disorders Association Helpline: 1-800-931-2237\n\nBeth\u0027s Book: \n\nhttps://www.amazon.com/Born-Razed-Surviving-Cult-Battle-ebook/dp/B0DQ68117H\n\nDaniella\u0027s Links:\nPreorder for Culting of America: https://knittingcultlady.com/products/the-culting-of-america\nGo Fund Me for Culting of America: https://tr.ee/fldwYRFTJI\n\nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\n\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\n\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\n\nDaniella’s Tiktok: https://www.tiktok.com/@knittingcultlady?lang=en\n\nInstagram: https://www.instagram.com/stories/daniellamyoung_/\n\nUnamerican Videobook: https://tr.ee/ODM-qtUJaR\n\nSecret Practice Videobook: https://tr.ee/DGEY3IeQQm\n\nDr. Scot\u0027s Socials\nhttps://www.tiktok.com/@thescotloyd\nhttps://www.youtube.com/@thescotloyd\n\nHaley\u0027s Tiktok\nhttp://www.tiktok.com/@nuancedmasculinities\n\nKey Takeaways\n\n    Religious abuse can hide in plain sight: Grenville Christian College operated for decades as a “prestigious” Anglican school while functioning as a coercive cult.\n\n    Systemic control dismantled family bonds: Children were separated from parents, spied upon, and punished under the guise of spiritual discipline.\n\n    Recovery is lifelong: Leaving a cult is only the beginning—true healing often unfolds over decades.\n\n    Grief is complex for survivors: Survivors grieve not only their past but also the version of themselves and families they never got to fully have.\n\n    Weaponized religion causes lasting harm: Faith can be used as a tool of control, and rebuilding a healthy spiritual or secular identity takes time.\n\n    Community resilience matters: The class-action lawsuit gave survivors both validation and voice, setting legal precedent in Canada.\n\n    Art and storytelling as healing: Beth’s memoir and Daniella’s creative work illustrate how expression can help survivors reclaim their narratives.\n\n    Ambiguity is part of recovery: Many survivors find peace not in certainty, but in learning to live with doubt.\n\n    Intergenerational healing is possible: Rebuilding family connection and emotional fluency can break the cycle of silence.\n\n    Living with it: Healing doesn’t erase trauma—it integrates it into a fuller, more authentic life.\n\nChapters\n\n00:00 Introduction to Cult Experiences\n01:39 Beth Granger\u0027s Journey as a Cult Survivor\n03:02 Life Inside the Cult: A Personal Account\n05:16 Surviving and Recovering from Cult Life\n10:17 The Importance of Recovery Narratives\n11:27 The Breaking Point: Realizations and Escape\n18:44 Grief and Loss After Leaving the Cult\n24:43 Navigating Faith and Doubt Post-Cult\n26:37 Navigating Personal Beliefs and Cult Influence\n31:30 The Role of Music in Healing and Identity\n37:36 Grief and Family Dynamics Post-Cult\n40:59 Community Resilience Against Coercive Organizations\n47:54 The Impact of Trauma and the Journey to Healing\n\nProduced by Haley Phillips, Meghan Picmann, and Lizy Freudmann",
      "release": "2025-11-11T14:09:00Z",
      "duration": "00:51:58",
      "explicit": false,
      "spotifyId": "7G5T3QD6hrByweZijYXM2I",
      "appleId": 1000736270844,
      "youTubeId": "TmXyz6S4C_k",
      "subjects": [
        "Community of Jesus",
        "Cult Recovery",
        "Church Of England",
        "Landmark"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7G5T3QD6hrByweZijYXM2I",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000736270844",
        "youtube": "https://www.youtube.com/watch?v=TmXyz6S4C_k"
      }
    },
    {
      "id": "09152f04-be9f-4247-8ccc-09cffd8fa72c",
      "title": "Cults \u0026 The Culting of America w/ Knitting Cult Lady | 56 | Brazilian Dictatorship and Resilience",
      "description": "In this special episode, Daniella Mestyanek Young (\u0022Knitting Cult Lady\u0022) speaks with Dr. Bryan Pitts, Assistant Director of UCLA\u0027s Latin American Institute, about the Brazilian military dictatorship (1964–1985) and how studying Brazil\u0027s political history can help Americans understand current threats to democracy. They compare U.S. and Brazilian political systems, the cultural myths that obscure inequality (the \u0022American Dream\u0022 vs. Brazil\u0027s \u0022racial democracy\u0022), and the interplay between religion, class, and authoritarianism. The discussion explores how political elites, class structures, and the military shaped Brazil\u0027s dictatorship and its fall, how the U.S. normalizes corruption through legality, and why Americans struggle to recognize creeping authoritarianism. The episode ends with reflections on community resilience, the dangers of individualism, and lessons from Brazil on defending democracy.\n Dr. Pitts\u0027 Book:\n  Amazon\n  Daniella\u0027s Links:\n    Preorder for Culting of America:  The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady\n   Daniella Mestyanek Young\u0027s book: \n    From Bookshop.org\n    Uncultured  Autographed:\n     Connect with Daniella on social media \n    TikTok   Patreon   Instagram   Youtube    Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n Youtube: https://www.youtube.com/@thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Key Takeaways \n   U.S. comparisons to Nazi Germany miss nuances—Latin American dictatorships, especially Brazil\u0027s, offer more relevant parallels.\n   Brazil\u0027s 1964 coup was not purely CIA-driven but enabled by U.S. encouragement and anti-communist ideology.\n   The Brazilian dictatorship\u0027s fall was driven by local politicians regaining influence and citizens mobilizing for democracy.\n   Brazil\u0027s political class and military were both hereditary systems that reinforced inequality and control.\n   Corruption in Brazil was often criminalized campaign funding—whereas in the U.S., \u0022legal corruption\u0022 (e.g., Citizens United) plays a similar role.\n   National myths—America\u0027s \u0022classless society\u0022 and Brazil\u0027s \u0022racial democracy\u0022—mask systemic inequality and prevent honest reckoning.\n   Daniella and Bryan compare cult structures to political systems: authoritarian control thrives on isolation, hierarchy, and sacred assumptions.\n   Bureaucracy and decentralization (local politics, paperwork, institutional rules) often protect democracy better than charismatic leadership.\n   The Brazilian opposition\u0027s shift from abstract \u0022save democracy\u0022 rhetoric to focusing on people\u0027s material needs (poverty, inequality) was pivotal to defeating authoritarianism.\n   Americans may not recognize creeping dictatorship because they lack collective memory of one; Brazil\u0027s experience offers a warning and a roadmap.\n   The U.S. military\u0027s apolitical stance may protect against coups but limits civic intervention when democracy erodes.\n   Building community and mutual aid networks is crucial as a counter to isolation and authoritarian individualism.\n   Both guests reflect on how growing up in cults or authoritarian systems gave them insight into manipulation, obedience, and ideological rigidity.\n   Authoritarianism can appear on the left or right; unquestioning certainty is itself cult-like.\n   Brazilians unified quickly to defend democracy after Bolsonaro\u0027s attempted coup—contrasting sharply with U.S. responses after January 6th.\n   Americans over-trust institutions and underestimate the need for civic defense of democracy.\n   Brazil\u0027s \u0022relative democracy\u0022 under dictatorship reveals how regimes justify authoritarian control in the name of \u0022protection.\u0022\n   Structural inequality, not individual failure, drives poverty—an insight both guests developed from missionary childhoods.\n   Both guests emphasize that understanding other nations\u0027 histories is vital to preventing tyranny at home.\n   Chapters\n 00:00 Introduction to the Conversation\n 02:18 Personal Backgrounds and Cultural Insights\n 11:40 Understanding Brazil\u0027s Military Dictatorship\n 18:33 The Role of the Political Elite in Brazil\n 24:25 Class and Military Dynamics in Brazil and the US\n 29:06 Sacred Assumptions and the American Dream\n 30:28 The Decline of the American Dream\n 31:41 Comparing Dictatorships: The U.S. and Latin America\n 35:07 Cultural Diversity and National Identity\n 38:37 Birthright Citizenship and Its Implications\n 42:48 Political Maneuvering During Dictatorship\n 52:04 Lessons from Brazil\u0027s Political History\n 55:03 The Role of Community in Political Change\n 56:01 Introduction to Authoritarianism and Democracy\n 58:33 The Role of Institutions in Protecting Democracy\n 01:01:36 Military\u0027s Role in American Politics\n 01:04:22 Cult Dynamics in Military and Academia\n 01:07:19 Experiences of Extremism and Authoritarianism\n 01:10:15 The Importance of Community and Resistance\n Produced by Haley Phillips, Meghan Picmann, and Lizy Freudmann",
      "release": "2025-11-04T14:59:00Z",
      "duration": "01:14:45",
      "explicit": false,
      "spotifyId": "5WVpwyJyqquWwVgDoVcbNS",
      "appleId": 1000735223566,
      "youTubeId": "Ta3ysXoja34",
      "subjects": [
        "Cult Psychology",
        "Political Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WVpwyJyqquWwVgDoVcbNS",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000735223566",
        "youtube": "https://www.youtube.com/watch?v=Ta3ysXoja34"
      }
    },
    {
      "id": "7a4b970d-e7da-4745-9e3f-b554f3d422a5",
      "title": "Cults \u0026 The Culting of America w/ Knitting Cult Lady | 55 | The Power of Story Telling",
      "description": "In this episode of Cults and the Culting of America, Daniella Mestyanek Young (aka Knitting Cult Lady) speaks with Chicago educator and social work student Jamal Bruce about his experiences teaching, navigating race and identity, and how her memoir Uncultured influenced his career pivot from education to social work. Their conversation explores how America’s educational and social systems function as cult-like institutions that condition compliance, suppress individuality, and reflect deeper cultural hierarchies. Together, they draw parallels between trauma survival, masking behaviors, racial inequity, and the ways storytelling can challenge systemic norms. They also discuss how white privilege manifests in subtle daily ways, the importance of listening across difference, and the transformative power of reading beyond one’s own identity.\n  Daniella\u0027s Links:\n    Preorder for Culting of America:  The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady\n   Daniella Mestyanek Young\u0027s book: \n    From Bookshop.org\n      Uncultured  Autograph: \n     Connect with Daniella on social media \n    TikTok,  Patreon,  Instagram    Youtube    Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n Youtube: https://www.youtube.com/@thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Key Takeaways:\n   Jamal Bruce, a Black high school teacher in Chicago, found Uncultured profoundly validating and inspiring, prompting his shift toward social work.\n   Daniella and Jamal discuss how schools often mirror cult-like systems that demand conformity and suppress individuality.\n   Both highlight how trauma survivors often overachieve as a coping mechanism—seeking safety in perfection and compliance.\n   Educators of color are more likely to “see” marginalized students and advocate for them because of shared systemic experiences.\n   The U.S. educational model has roots in Puritan indoctrination and continues to prioritize obedience over humanity.\n   White privilege shows up in small, everyday ways—like who gets questioned, believed, or celebrated for multilingualism.\n   The conversation emphasizes the need to believe marginalized voices rather than debate their experiences.\n   Daniella reflects on how publishing, like education, gatekeeps whose stories are told and deemed “marketable.”\n   Both guests stress reading broadly and engaging with diverse perspectives as a way to dismantle bias and foster empathy.\n   Uncultured demonstrates how personal trauma can illuminate collective social conditioning, inviting broader discussions of power, race, and belonging.\n   Chapters\n 00:00 Introduction to Uncultured Perspectives\n 02:41 The Role of Educators in Social Change\n 05:26 Personal Stories of Advocacy and Support\n 08:19 The Cult-like Nature of Education\n 11:20 Navigating Identity and Trauma in Education\n 14:10 The Intersection of Race and Education\n 16:44 The Impact of Trauma on Academic Performance\n 19:35 The Complexity of Privilege and Identity\n 22:33 The Need for Authenticity in Education\n 25:27 Conclusion: Shared Experiences and Collective Growth\n 29:03 Finding Your Audience in Storytelling\n 30:25 Relating Through Shared Emotions\n 32:33 Understanding Different Perspectives\n 34:53 The Importance of Believing Experiences\n 37:32 Recognizing Privilege in Society\n 40:32 Bilingualism and Perceptions of Intelligence\n 44:06 Challenging Gender and Racial Stereotypes\n 48:18 The Journey of Deconstructing Worldviews\n 51:06 The Power of Diverse Narratives\n Produced by Haley Phillips, Lizy Freudmann, and Meghan Picmann",
      "release": "2025-10-28T14:25:00Z",
      "duration": "00:56:31",
      "explicit": false,
      "spotifyId": "5n3KJxUvsZZ2wMRLnYPj1M",
      "appleId": 1000733880921,
      "youTubeId": "0LJleyS37Es",
      "subjects": [
        "Corporate Cult",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5n3KJxUvsZZ2wMRLnYPj1M",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000733880921",
        "youtube": "https://www.youtube.com/watch?v=0LJleyS37Es"
      }
    },
    {
      "id": "365a8d58-645d-484c-a5e5-6b65004b6f5b",
      "title": "Cults \u0026 The Culting of America w/ Knitting Cult Lady \u0026 Scot Loyd | 54 | Join A Club, Not A Cult",
      "description": "In this episode of Cults and the Culting of America, Daniella and Scot talk with brother-sister filmmakers Rebecca and Pete Davis, co-directors of the documentary Join or Die. The film explores the steep decline in civic engagement across America and how rebuilding community is the antidote to the loneliness, polarization, and manipulation that make people vulnerable to cults.\n Together, they discuss the connection between isolation and extremism, how everyday community life has eroded over decades, and why showing up for local action is both a civic duty and a personal safeguard against coercive control. From Bowling Alone to the “cult of media,” this conversation challenges listeners to ask one question:\n What am I doing alone that I could be doing together?\n Pete and Rebecca\u0027s Links:\n Website\n Movie\n  Daniella\u0027s Links:\n    Preorder for Culting of America:  The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady\n   Go Fund Me for Culting of America:  https://tr.ee/fldwYRFTJI\n   Daniella Mestyanek Young\u0027s book: \n    From Bookshop.org\n      Uncultured  Autograph: \n     Connect with Daniella on social media \n    TikTok,  Patreon,  Instagram    Youtube    Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n Youtube: https://www.youtube.com/@thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n 💡 Key Takeaways   The ultimate inoculation against bad community is good community.\n   43% of Americans report belonging to zero community groups — a sign of deep civic decline.\n   Cults exploit the human need for belonging that isolation leaves unmet.\n   Healthy communities build “social capital” — the foundation of both democracy and resilience.\n   Television, air conditioning, and social media each contributed to the privatization of daily life.\n   Online groups offer connection but lack the embodied care of local, face-to-face relationships.\n   “Civic reforestation” starts small — hosting a club, joining a group, showing up in person.\n   Conflict isn’t bad; learning to have it well is a democratic skill.\n   Attention is power — Americans spend about 10 hours a day consuming media instead of creating community.\n   Every movement in history began with about 1% of people showing up.\n   Cult-proof your life by diversifying your relationships and commitments.\n   Start where you are: know your neighbors, host a screening, join something local.\n   Chapters\n 00:00 – Welcome \u0026 Introductions\n 02:00 – Why We Need Good Communities\n 04:00 – Isolation as a Weapon\n 05:30 – A 75-Year Decline in Connection\n 09:00 – Democracy and Social Fabric\n 12:00 – Air Conditioning, Modernity, and Lost Stoops\n 14:00 – What Are You Doing Alone That You Could Be Doing Together?\n 17:00 – From Online to Embodied Community\n 19:00 – The Cult of Media \u0026 Attention Theft\n 22:00 – Mono-Focus and Cult Vulnerability\n 26:00 – Why We Have Fewer Friends Now\n 30:00 – Learning the Lost Art of Organizing\n 33:00 – Lessons from History\n 36:00 – Conflict Is Good in a Democracy\n 40:00 – How to Watch or Host “Join or Die”\n 42:00 – Showing Up: The Real Inoculation\n 45:00 – Closing Reflections\n Produced by Haley Phillips, Meghan Picmann, and Lizzy Freudmann",
      "release": "2025-10-21T12:46:00Z",
      "duration": "00:48:11",
      "explicit": false,
      "spotifyId": "4wRgMwM8kLTfaJbsNocLB1",
      "appleId": 1000732816464,
      "youTubeId": "Vb5ajKBd5qU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wRgMwM8kLTfaJbsNocLB1",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000732816464",
        "youtube": "https://www.youtube.com/watch?v=Vb5ajKBd5qU"
      }
    },
    {
      "id": "a97cc10a-5070-4139-9b05-8ed5f3029b98",
      "title": "Cults \u0026 the Culting of America w/ Knitting Cult Lady and Scot Loyd | ep53 | The God Scot Was Given",
      "description": "In this episode of Cults and the Culting of America, hosts Scot Loyd and Daniella Mestyanek Young unpack Secretary of War Pete Hegseth’s recent dystopian-sounding address to military leadership, examining it through the lens of cult psychology, gendered standards, and authoritarian control.\n Daniella dissects how “standards” and “professionalism” in the military are tools to maintain patriarchal and racial hierarchies, using examples like grooming policies and “gender-neutral” male standards. She argues that rhetoric like Hegseth’s is part of a broader movement toward Christian nationalism and toxic militarized masculinity, dubbing it the “Mojo Dojo Casa Military.”\n Together, they explore whether the U.S. military could ever be used against American citizens, why cult-like obedience structures are dangerous, and how individual ethics, diversity, and generational change make full-scale authoritarian control unlikely.\n The conversation then shifts toward Scot’s new book, The God That I Was Given: Looking for Faith After Losing My Religion. Daniella and Scot discuss faith deconstruction, privilege, and how to hold space for both pride in one’s past and critical honesty about harm. They reflect on storytelling, accountability, and how both military and religious institutions reward conformity and punish introspection.\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok: Knitting Cult Lady\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n Youtube: https://www.youtube.com/@thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n 🔑 Key Takeaways   “Standards” are culturally constructed — often used to uphold existing power structures under the guise of objectivity.\n   “Gender neutral” usually means “male” — erasing femininity and reinforcing patriarchal norms.\n   Hegseth’s rhetoric reflects toxic masculinity, racial dog whistles, and authoritarian nostalgia for a “Department of War.”\n   Military culture mirrors cult structures, but its guiding “cult” is loyalty to the Constitution — not to any single leader.\n   Younger service members (Millennials \u0026 Gen Z) are reshaping the culture toward diversity, empathy, and critical thinking.\n   Brainwashing tactics from abusive systems and cults were deliberately baked into modern military training.\n   Deconstruction is not destruction — you can be proud of aspects of your experience while acknowledging systemic harm.\n   Both hosts connect cult dynamics across institutions — religion, the military, and politics all rely on controlling narratives.\n   Writing memoirs like Uncultured and The God That I Was Given provides a model for honest reflection that includes both pride and pain.\n   Truth-telling invites criticism, but it’s vital for cultural healing and understanding.\n   Chapters\n 00:00 Introduction to the Podcast and Guests\n 00:53 Military Standards and Gender Equality\n 03:43 Rhetoric and Leadership in the Military\n 06:29 Concerns Over Military Use Against Citizens\n 09:21 Basic Training and Military Culture\n 12:08 The Role of Experience in Military Leadership\n 14:54 Political Rhetoric and Military Professionalism\n 17:51 Diversity in the Military and Its Implications\n 20:39 Public Perception and Military Loyalty\n 23:23 Historical Context of Military Orders\n 26:09 Conclusion and Future Implications\n 28:18 Generational Perspectives in the Military\n 32:50 The Culting of America: A Deeper Dive\n 37:16 Navigating Privilege and Perspective\n 41:48 The Complexity of Faith and Deconstruction\n 47:06 The Power of Storytelling and Truth\n 54:22 Closing Thoughts on Diversity and Listening\n Produced by Haley Phillips, Meghan Picmann, and Lizy Freudmann",
      "release": "2025-10-15T14:55:00Z",
      "duration": "00:57:05",
      "explicit": false,
      "spotifyId": "5Pa5ZMr6694knLYkoJ0VqJ",
      "appleId": 1000732001910,
      "youTubeId": "bu8NPY8zJlQ",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Pa5ZMr6694knLYkoJ0VqJ",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000732001910",
        "youtube": "https://www.youtube.com/watch?v=bu8NPY8zJlQ"
      }
    },
    {
      "id": "a3477bc1-2d26-4c09-9173-320c29013efb",
      "title": "Cults \u0026 the Culting of America w/ Knitting Cult Lady and Scot Loyd | ep52 | Veterinary Medicine",
      "description": "In this episode of Cults and the Culting of America, hosts Daniella Mestyanek Young and Scot Loyd welcome Dr. Jo, a veterinarian from New Orleans, to explore the surprising overlaps between veterinary medicine and cultic dynamics. The conversation highlights how overwork, guilt, and moral injury can act as control mechanisms in “helping professions” like veterinary care—mirroring high-demand group tactics.\nDr. Jo discusses the emotional toll of her work, including the constant oscillation between joy (new puppies) and grief (euthanasia), the high suicide rate among veterinarians, and the systemic lack of self-care built into the profession. Daniella connects these patterns to her broader analysis of institutional cultures that exploit compassion, while Scot reflects on similar burnout dynamics from his time as a pastor.\nThe trio also dives into capitalism’s role in normalizing self-sacrifice, the ethics of euthanasia, empathy toward animals and humans, and the need for structural—not just individual—change to protect caregivers from exploitation. The episode ends with a reminder: veterinarians are humans too, carrying invisible emotional burdens.\n\nDaniella\u0027s Links:\nPreorder for Culting of America: The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady\nGo Fund Me for Publishing Culting of America: https://tr.ee/FTOBLyQnYo\nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\nDaniella’s Tiktok: https://bit.ly/4muxbu6 / @knittingcultladychat\nYoutube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg\nInstagram: https://www.instagram.com/stories/daniellamyoung_/\nHey White Women Podcast: https://tr.ee/2gWVBFaYnp\\\nCults and the Culting of America Podcast: https://sites.libsyn.com/534892/site\n\nScot\u0027s Socials\nTikTok:  @thescotloyd\nYoutube: https://www.youtube.com/@thescotloyd\nHaley\u0027s Tiktok\n@nuancedmasculinities\n\n💡 Key Takeaways\nVeterinary medicine shares cult-like traits such as overwork as virtue, guilt-based control, and moral self-sacrifice.\n\nEmotional compartmentalization is required—vets may euthanize a long-time patient then pivot to a joyful new-pet visit minutes later.\n\nThe suicide rate among veterinarians is alarmingly high, often tied to compassion fatigue and systemic overextension.\n\nCapitalism reinforces burnout, framing constant labor and self-denial as moral goodness.\n\nMany vets struggle to find balance between client care and self-care, often skipping breaks or feeling guilty for resting.\n\nCOVID-19 worsened burnout by increasing pet ownership while reducing staff capacity.\n\nFinancial misconceptions persist: veterinary procedures are costly but still drastically cheaper than equivalent human care.\n\nEuthanasia ethics are complex—vets must navigate between mercy, owner intent, and lack of viable alternatives.\n\nEmpathy erosion in cults and capitalism parallels how systems dehumanize caregivers and animals alike.\n\nReal solutions require institutional change, not just resilience training for individuals.\n\nSimple kindness from clients can profoundly impact veterinary workers’ wellbeing.\n\nProfessional roles and uniforms can dehumanize caregivers—remembering their humanity matters.\n\nHelping professions often attract perfectionists and empaths, making them more vulnerable to exploitation.\n\nBoth hosts link these patterns to broader social “meta-cults”—capitalism, productivity culture, and religious ideology.\n\nChapters\n00:00 Introduction and Rapture Day\n01:09 Meet the Veterinarian: Jo\u0027s Journey\n03:09 Cults and Veterinary Medicine: Unlikely Parallels\n05:21 Expectations vs. Reality in Veterinary Medicine\n08:34 The Emotional Toll of Veterinary Practice\n11:13 Navigating Client Relationships and Misinformation\n15:14 Cults and Empathy: A Unique Perspective\n18:41 The Ethics of Pet Ownership and Care\n21:10 Coping Mechanisms in Veterinary Medicine\n25:00 Community Support and the Burden of Service\n28:09 The Burnout Epidemic in Veterinary Medicine\n30:18 Understanding the Costs of Veterinary Care\n35:28 Quality of Life Conversations with Pet Owners\n43:28 Self-Care and Avoiding Burnout in Veterinary Practice\n49:08 The Human Side of Veterinary Medicine\n\nProduced by Haley Phillips",
      "release": "2025-10-07T13:50:00Z",
      "duration": "00:54:51",
      "explicit": false,
      "spotifyId": "0LLSbQ3CIINUoKmWdC75Hw",
      "appleId": 1000730623140,
      "youTubeId": "Px6A03Bo0oo",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0LLSbQ3CIINUoKmWdC75Hw",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-w-knitting-cult-lady/id1756133150?i=1000730623140",
        "youtube": "https://www.youtube.com/watch?v=Px6A03Bo0oo"
      }
    },
    {
      "id": "722e6cce-287d-43b5-afa3-a496eaa5098e",
      "title": "Cults \u0026 The Culting of America with Knitting Cult Lady and Scot Loyd | ep51 | Candi Carpenter",
      "description": "In this episode of Cults and the Culting of America, hosts Daniela Mestyanek Young and Scot Loyd welcome musician and activist Candi Carpenter. The conversation dives into parallels between growing up in evangelical Christianity and high-control cult environments, with both Daniela and Candi sharing deeply personal stories.\n Candi discusses their upbringing as a pastor’s kid in a gospel family band, the ways purity culture and religious control shaped their identity, and their long deconstruction journey. They reflect on how music, satire, and community have helped them reclaim their voice and selfhood after years of suppression.\n The discussion touches on the loneliness of cult childhoods, the psychological effects of being taught constant fear of sin and hell, and how neurodivergence (autism, OCD) made them especially vulnerable to indoctrination. Humor and satire emerge as powerful tools of resistance—whether in music videos mocking political figures or in Daniela’s plans for a “cult baby musical.”\n The episode closes with reflections on healing, therapy, medication, and the importance of building authentic community beyond transactional, conversion-driven relationships.\n Candi\u0027s Links: \n Spotify \n Apple Music\n Youtube \n Tiktok\n Instagram\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok: Knitting Cult Lady\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n Youtube: https://www.youtube.com/@thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Key Takeaways   Parallel Journeys: Both Daniela and Candi grew up under strict religious control, with performance and purity culture shaping much of their childhood.\n   Music as Survival: Candi uses songwriting to process trauma, reclaim identity, and connect with others who share similar experiences.\n   Deconstruction \u0026 Identity: Their exit from evangelicalism was gradual, involving moments of perspective shift (like viewing church rituals through outsiders’ eyes) and self-discovery (embracing their non-binary identity).\n   Neurodivergence \u0026 Cults: Autism and OCD traits made Candi especially susceptible to religious rules, scrupulosity, and fear-based control.\n   Purity Culture \u0026 Harm: Conversations highlighted how purity teachings overlap with exploitation, creating damaging relationships with sex, self, and others.\n   Satire as Activism: Through bold political satire (like their “American God” video), Candi critiques extremism and authoritarianism with humor.\n   Community After Cults: Online spaces like Candi’s Discord “Candyland” provide connection and solidarity for those who once felt isolated.\n   Healing Tools: Therapy, finding the right medication, and embracing joy (from late-night milkshakes to creative play) are key in recovery.\n   Unmasking \u0026 Authenticity: A central theme is moving from masking and people-pleasing (ingrained by cult culture) toward living authentically without fear of rejection.\n   Shared Mission: Both Daniela and Candi see their art—books, music, satire, musicals—as ways to expose control systems, build resilience, and help others heal.\n   Chapters\n 00:00 Introduction to Candi Carpenter and Cult Themes\n 02:51 Exploring the Impact of Cults on Identity\n 05:31 Deconstructing Religious Upbringing and Its Effects\n 08:38 The Role of Music in Healing and Community\n 11:19 Navigating Personal Trauma and Artistic Expression\n 14:07 The Intersection of Humor and Activism\n 17:23 Political Satire and the Role of Artists\n 20:03 Embracing Individuality and Non-Binary Identity\n 22:54 The Future of Music and Activism\n 25:44 Conclusion and Reflections on Fear and Anger\n 30:42 The Journey of Healing and Self-Discovery\n 34:23 Navigating Relationships Beyond Cults\n 37:16 The Struggle with People-Pleasing\n 40:21 Embracing Authenticity and Self-Acceptance\n 44:45 The Role of Therapy and Medication in Healing\n 49:37 Creating Art as a Means of Expression\n Produced by Haley Phillips",
      "release": "2025-09-30T17:50:00Z",
      "duration": "00:55:32",
      "explicit": false,
      "spotifyId": "1ktMDhe50fTdgkP1LopPFf",
      "appleId": 1000729378504,
      "youTubeId": "goybsZhHi2E",
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ktMDhe50fTdgkP1LopPFf",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-with-knitting-cult/id1756133150?i=1000729378504",
        "youtube": "https://www.youtube.com/watch?v=goybsZhHi2E"
      }
    },
    {
      "id": "d4a4fe6a-a901-47ff-9d81-4259f641004b",
      "title": "Cults \u0026 The Culting of America with Knitting Cult Lady and Scot Loyd | ep50 | One Taste Sex Cult",
      "description": "In this episode of Cults and the Culting of America, hosts Scot Loyd and Daniella Mestyanek Young (“the Knitting Cult Lady”) interview Ruwan, a former member of OneTaste, a so-called “orgasm cult” centered around female sexuality and human connection. Ruwan recounts his two years in the organization, explaining how he was drawn in by its promises of intimacy and meaning, but soon became entangled in manipulation, labor exploitation, and coercive sales tactics.\n The discussion highlights parallels between OneTaste and other coercive groups, including the use of sex as recruitment, redefining language to control members’ worldview, punishing dissent, and demanding lifelong commitment. Ruwan also reflects on the psychological toll of leaving, the social shunning he endured, and how indoctrination made it difficult to criticize the leader. The episode closes with reflections on cult dynamics, the dangers of committing one’s life to a group or ideology, and Ruwan’s upcoming memoir that ties his personal journey to OneTaste’s recent criminal convictions.\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok: Knitting Cult Lady\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s Socials\n  TikTok:   @thescotloyd\n Youtube: https://www.youtube.com/@thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Key Takeaways   Sex as a recruitment tool: OneTaste initially used sexuality to attract members but retained them through promises of connection, meaning, and personal growth.\n   Labor exploitation: Members often worked for extremely low wages (e.g., $2/hour) under the belief that they were serving a higher cause.\n   Manipulation through language: Words like orgasm were redefined to mean progressively broader and more spiritual concepts, fostering a worldview unique to the group.\n   High performer recruitment: Contrary to stereotypes, cults often seek intelligent, articulate, and passionate individuals who can recruit others effectively.\n   Isolation tactics: Practices like banning “collusion” (sharing doubts) kept members from validating each other’s concerns. Dissenters were shunned or vilified.\n   Commitment pressure: Members were pushed to “commit their lives” by giving up finances, autonomy, or public loyalty, often under threat of rejection.\n   Good cop/bad cop dynamics: Leaders or lieutenants alternated between affection and criticism to manipulate compliance.\n   False empowerment: Despite its branding as a female empowerment movement, OneTaste remained patriarchal and exploitative, especially of young women.\n   Leader protection: The founder avoided blame by delegating harsh decisions, maintaining a “halo effect” that made criticism difficult.\n   Leaving costs: Exiting meant social exile, loss of community, and pressure to humiliate oneself in order to be accepted back.\n   Parallels to other systems: Comparisons were drawn to military indoctrination, religious cults, NXIVM, and Scientology, showing shared patterns of control.\n   Human vulnerability: Cults thrive by appealing to universal desires—belonging, meaning, and devotion to a higher purpose—while exploiting them for control.\n   Chapters\n 00:00 Isolation and Emotional Turmoil in Cults\n 33:10 The Legal Consequences of Cult Activities\n 36:09 The Dynamics of Power and Gender in Cults\n 39:01 Reflections on Cult Experiences and Future Directions\n Produced By Haley Phillips",
      "release": "2025-09-23T17:09:00Z",
      "duration": "00:43:32",
      "explicit": false,
      "spotifyId": "5V8RY26x4wlCyJK2ksm5cR",
      "appleId": 1000728101146,
      "youTubeId": "W2VrHi1RNjI",
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5V8RY26x4wlCyJK2ksm5cR",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-with-knitting-cult/id1756133150?i=1000728101146",
        "youtube": "https://www.youtube.com/watch?v=W2VrHi1RNjI"
      }
    },
    {
      "id": "1da91f08-1133-460a-b7c8-1705e78eaf45",
      "title": "Cults \u0026 The Culting of America with Knitting Cult Lady and Scot Loyd | ep49 | Cycle Breaking",
      "description": "In this episode of Cults and the Culting of America, hosts Daniella Mestyanek Young and Scot Loyd welcome Sydney, a member of the Cult Book Club, to share her personal story of growing up in the shadow of a multigenerational cult. Sydney recounts her family’s involvement with the commune Christ Circle in the 1970s–80s, her experience being homeschooled in a high-control, secrecy-driven environment, and the lingering effects of trauma passed down through generations. She reflects on estranging from her mother, the challenges of being the “cycle breaker” in her family, and how medical neglect, secrecy, and MAGA ideology compounded dysfunction. Sydney shares her diagnosis with POTS, her healing journey, and how reading Daniella’s book gave her the language to process her past. The conversation highlights themes of secrecy, performance versus authenticity, generational trauma, and the courage it takes to leave and heal. The episode closes with Sydney reading a moving reflection addressed to “cycle breakers,” emphasizing the exhausting but vital work of stopping harmful patterns and choosing a different path for future generations. Sydney\u0027s Podcast: Spotify Daniella\u0027s Links: You can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured For more info on me: Patreon: https://bit.ly/YTPLanding Cult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding Get an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured Get my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8 Daniella’s Tiktok: Knitting Cult Lady Instagram: https://bit.ly/4ePAOFK / daniellamyoung_ Unamerican video book (on Patreon): https://bit.ly/YTVideoBook Secret Practice video book (on Patreon): https://bit.ly/3ZswGY8 Other Podcasts Daniella\u0027s other podcast: Hey White Women Scot\u0027s Socials TikTok: @thescotloyd Youtube: https://www.youtube.com/@thescotloyd Haley\u0027s Tiktok @nuancedmasculinities Key Takeaways Secrecy as a control tactic: Families and cults often weaponize secrecy to hide abuse and dysfunction. Generational trauma: Even those who didn’t grow up directly in the cult carry the impact of their family’s involvement. Cycle breaking: Refusing to pass trauma down to children requires conscious effort, vulnerability, and immense energy. Medical neglect in cults: Distrust of healthcare often leads to undiagnosed or untreated conditions, deepening harm. Authenticity vs. performance: Survivors reclaim agency by refusing to be “shiny showpieces” and instead choosing authentic lives. Empowerment through language: Finding words to describe trauma and control systems is a crucial step in healing. Healing through community: Safe environments, supportive partners, and shared survivor stories provide tools for recovery. Chapters 00:00 Introduction to Culting and Personal Stories 01:56 Sydney\u0027s Journey: Growing Up in a High Control Environment 04:25 The Impact of Secrecy in Cults 10:21 Family Dynamics and Dysfunction 12:16 Breaking the Cycle of Trauma 18:34 Responsibility of the Cycle Breaker 20:41 Navigating Medical Denials and Personal Growth 23:18 Breaking Free from Toxic Relationships 25:56 The Impact of Cults on Parenting and Family Dynamics 30:13 Authenticity vs. Performance in Cult Environments 33:29 Finding Safety and Healing in New Relationships 35:51 The Journey of a Cycle Breaker Produced by Haley Phillips",
      "release": "2025-09-17T16:21:00Z",
      "duration": "00:40:46.8750000",
      "explicit": false,
      "spotifyId": "0WP21NuCObrt8sZ7vqmrjr",
      "appleId": 1000727229390,
      "youTubeId": "yhq2c0pJrUs",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0WP21NuCObrt8sZ7vqmrjr",
        "apple": "https://podcasts.apple.com/podcast/cults-the-culting-of-america-with-knitting-cult/id1756133150?i=1000727229390",
        "youtube": "https://www.youtube.com/watch?v=yhq2c0pJrUs"
      }
    },
    {
      "id": "ee9557bd-d8b2-48d0-a3b5-0e6793a40572",
      "title": "Cults and The Culting of America with Knitting Cult Lady and Scot Lloyd | Episode 47 | The Cultiness of Nursing",
      "description": "This episode of Cults and the Culting of America features guest Jess M. (aka White Mess Express), a former nurse, alongside hosts Daniella Mestyanek Young and Scot Loyd. The conversation explores how the U.S. healthcare system—particularly nursing—resembles a cult in its culture, practices, and systemic issues.\nJess describes the hierarchical \u0022rite of passage\u0022 culture in nursing (e.g., new nurses being called “baby nurses” and forced through hazing-like experiences). They highlight systemic contradictions: nurses are told to always be learning but punished for questioning authority, encouraged to self-sacrifice at the expense of their own health, and held individually responsible for systemic failures.\nThe discussion broadens to the U.S. healthcare system as a whole—its prioritization of profit over care, its inequities toward marginalized groups, and the emotional toll on providers and patients alike. Daniella and Scot connect these patterns to cult dynamics: degradation rituals, infantilization, blind obedience, toxic positivity, and punishment for dissent.\nJess shares personal experiences of disillusionment: discovering nursing’s promises of stability and meaning were hollow, dealing with disability from the physical demands of the work, and grieving the loss of identity and purpose after leaving the profession. They emphasize the need for gratitude toward frontline staff, patient self-advocacy, and systemic change.\nThe episode closes with encouragement: while healthcare workers may feel trapped in a “cult of medicine,” deconstructing the experience allows them to reclaim their skills and narratives. Jess also shares where listeners can follow their ongoing work on TikTok and other platforms.\nDaniella\u0027s Links:\nGo Fund Me for Publishing Culting of America: https://tr.ee/FTOBLyQnYo\nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\nDaniella’s Tiktok: https://bit.ly/4muxbu6 / @knittingcultladychat\nYoutube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg\nIG: https://www.instagram.com/stories/daniellamyoung_/\nHey White Women Podcast: https://tr.ee/2gWVBFaYnp\\\nCults and the Culting of America Podcast: https://sites.libsyn.com/534892/site\nWhite Women Get Ready: https://www.mistresssyndrome.com/book\n\nScot\u0027s Socials\nTikTok:  @thescotloyd\nYoutube: https://www.youtube.com/@thescotloyd\n\nHaley\u0027s Tiktok\n@nuancedmasculinities\n\nJess\u0027s Links: \nlinktree\n\nKey Takeaways\n● Nursing culture as a “cult”:\n○ Hierarchical structure with forced rites of passage (“baby nurse” system).\n○ Bullying, hazing, and degradation rituals normalize suffering.\n○ Emotional suppression is enforced—nurses must “put on a nurse face.”\n○ Constant demand for self-sacrifice, often leading to burnout or worse.\n● Systemic contradictions:\n○ Nurses are told to always be learning, but punished for questioning authority.\n○ Healthcare talks about being “systemic” but punishes individuals for systemic failures.\n○ Promises of good pay, benefits, and flexibility often clash with reality (mandatory overtime, long shifts, poor work-life balance).\n● Healthcare as a profit-driven business:\n○ U.S. healthcare prioritizes money over patient wellbeing.\n○ Marginalized groups bear the brunt—Black and brown people, unhoused individuals, women, the poor.\n○ Providers often have no say in pricing or systemic policies.\n● Impact on patients and providers:\n○ Patients face bankruptcy, neglect, or dismissal of their concerns.\n○ Providers internalize a culture of silence, mistrust, and emotional suppression.\n○ Many healthcare workers avoid seeking care themselves due to stigma or normalization of suffering.\n● Breaking out of the “cult”:\n○ Leaving healthcare can feel like grief or loss of identity.\n○ Gratitude from patients can be more meaningful than institutional rewards (“pizza party” culture).\n○ Patients can advocate for themselves by remembering they are the experts on their own bodies.\n○ Deconstructing cult-like systems allows survivors to reclaim and repurpose their skills and experiences.\n\nChapters\n00:00 Introduction to the Healthcare System\u0027s Cult-like Nature\n 02:53 The Hierarchical Structure in Nursing\n 05:43 Systemic Issues in Healthcare\n 08:35 The Role of Nurses vs. Doctors\n 11:23 Healthcare as a Business\n 14:29 The Impact of Privilege on Healthcare Access\n 17:29 Experiences with Vulnerable Patients\n 20:20 Expectations vs. Reality in Nursing\n 23:28 Emotional Toll of Nursing and Military Service\n 28:08 Navigating Emotions in Healthcare\n 31:02 The Patient Experience: A Nurse\u0027s Perspective\n 33:45 The Reality of Nursing: Expectations vs. Reality\n 37:47 The Cult of Healthcare: A Critical Examination\n 47:34 Self-Advocacy in Healthcare: Empowering Patients\n 50:33 The Grieving Process of Leaving Healthcare\nProduced by Haley Phillips",
      "release": "2025-08-20T15:30:00Z",
      "duration": "00:57:33",
      "explicit": false,
      "spotifyId": "3Ye8E2W0XsgAF1TcTmQEgP",
      "appleId": 1000722823113,
      "youTubeId": "IJ873lcSLFo",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Ye8E2W0XsgAF1TcTmQEgP",
        "apple": "https://podcasts.apple.com/podcast/cults-and-the-culting-of-america-with-knitting/id1756133150?i=1000722823113",
        "youtube": "https://www.youtube.com/watch?v=IJ873lcSLFo"
      }
    },
    {
      "id": "0c639a4b-e8a6-4620-8168-af241e22448c",
      "title": "Cults and The Culting of America with Knitting Cult Lady and Scot Lloyd | Episode 46 | The God I Was Given book coming out soon!",
      "description": "In this episode of Cults and the Culting of America, Scot Loyd joins Haley while Daniella is away on her book tour. The conversation centers on Scot’s forthcoming memoir The God I Was Given: Looking for Faith After Losing My Religion, which blends personal memoir with philosophical and scholarly reflections on growing up in the United Pentecostal Church (UPC). Scot discusses the creative and emotional risks of releasing such a personal work, particularly the fear of being misunderstood or dismissed by current UPC members.\n\nGet Scot\u0027s book here! https://a.co/d/4GD8Joe\n\nHe shares vivid stories from his childhood in rural Arkansas, shaped by his religious grandmother’s influence and the paradox of being raised under a strong female matriarch within a patriarchal religious system. The discussion explores masculinity, gender socialization, identity loss after leaving a high-control religion, and the role of storytelling in fostering empathy and understanding. Scot emphasizes that leaving the church cost him his core identity as a “Pentecostal preacher,” but also gave him the opportunity to discover and cultivate other talents.\nThroughout, Scot and Haley highlight the need for nuance in conversations about faith, deconstruction, and human identity, advocating for a broader cultural shift toward allowing multiple ways of being without harm.\nDaniella\u0027s Links:\nGo Fund Me for Publishing Culting of America: https://tr.ee/FTOBLyQnYo\nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\nDaniella’s Tiktok: https://bit.ly/4muxbu6 / @knittingcultladychat\nYoutube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg\nInstagram: https://www.instagram.com/stories/daniellamyoung_/\nHey White Women Podcast: https://tr.ee/2gWVBFaYnp\\\nCults and the Culting of America Podcast: https://sites.libsyn.com/534892/site\nWhite Women Get Ready: https://www.mistresssyndrome.com/book\n\nOther Podcasts\nDaniella\u0027s other podcast: Hey White Women\nScot\u0027s Socials\nTikTok:  @thescotloyd\nYoutube: https://www.youtube.com/@thescotloyd\nHaley\u0027s Tiktok\n@nuancedmasculinities\n\nKey Takeaways\nBook Launch \u0026 Themes: Scot’s book is a hybrid of memoir and analysis, examining his upbringing in the UPC and the philosophical implications of faith, identity, and place.\n\n\nFear of Misunderstanding: He worries readers—especially current UPC members—may not engage with the book’s nuance, expecting it to be more condemning than it is.\n\n\nNuance Over Binary Thinking: Scot stresses that his church experience included both positive and harmful elements, and that faith should be open to scrutiny.\n\n\nMatriarch in a Patriarchal World: His grandmother wielded significant influence despite strict religious rules limiting women’s roles, creating a confusing model of gender for Scot.\n\n\nMasculinity \u0026 Socialization: Haley and Scot discuss how men raised as “choosers” in patriarchal contexts may struggle with rejection, and how rigid gender roles harm everyone.\n\n\nLoss of Identity After Leaving: Exiting the UPC meant losing his defining role as a preacher, forcing a reevaluation of self and purpose.\n\n\nStorytelling as Healing: Scot sees storytelling as a vital tool for empathy and connection, more impactful than sermons or lectures.\n\n\nValues as Identity Anchor: Both discuss grounding identity in values rather than rigid self-concepts to avoid spirals and allow personal growth.\n\n\nChapters\n00:00 Introduction and Book Announcement\n 03:27 Fears and Expectations of a New Author\n 11:25 The Influence of Geography on Faith\n 20:04 Navigating Patriarchy and Matriarchy\n 29:25 Masculinity and the Burden of Choice\n 31:30 The Burden of Expectations\n 37:48 Navigating Identity and Masculinity\n 43:09 The Power of Storytelling in Healing\n 46:34 The Cost of Leaving a Religious Identity\n 54:35 Values Over Identity: A New Perspective\nProduced by Haley Phillips",
      "release": "2025-08-12T17:32:00Z",
      "duration": "01:02:21.9580000",
      "explicit": false,
      "spotifyId": "0oZWXtNwzvFNpVo4Xp0WhS",
      "appleId": 1000721692297,
      "youTubeId": "CGbBXhFlhQU",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0oZWXtNwzvFNpVo4Xp0WhS",
        "apple": "https://podcasts.apple.com/podcast/cults-and-the-culting-of-america-with-knitting/id1756133150?i=1000721692297",
        "youtube": "https://www.youtube.com/watch?v=CGbBXhFlhQU"
      }
    },
    {
      "id": "c85d1511-20a3-4364-86c3-d04f038f3323",
      "title": "Sunday Brunch: The Musical",
      "description": "In this episode, Scott Loyd interviews the creators and a performer from Sunday Brunch: The Musical, a new theatrical work that humorously explores cult dynamics through a family brunch gone spectacularly wrong. While cult expert and regular host Daniella Mestyanek Young is absent due to technical difficulties, she sends in praise for the team’s viral “cult song,” noting how deeply it resonated with survivor experiences.\nGuests Ernie Bird (composer/co-writer), Rachel Abramon (lyricist/co-writer), and Gabrielle Filloux (performer) delve into the creative origins, songwriting process, and comedic construction of the show. Originally written during a jobless winter break as a fun project between friends, Sunday Brunch grew into a layered musical exploring dysfunction, privilege, and the absurdities of cult logic—all grounded in levity and genuine empathy.\nTheir viral charm song features an escalating back-and-forth between two characters trying to one-up each other’s trauma—with one repeatedly revealing that every family member is, in fact, in a cult. The group discusses the delicate balance of comedy and respect, how cult themes naturally wove into the narrative, and how they may expand the story into a larger universe featuring the three-headed bear deity and warring cults.\nThe episode also explores broader insights into cult dynamics, including the “meta-cults” of capitalism, white supremacy, and toxic workplace culture. Each guest shares personal brushes with high-control environments, even if not officially in cults, reinforcing the pervasiveness of coercive systems in everyday life.\nKeep up with the Musical: \n● Instagram: https://www.instagram.com/sundaybrunchthemusical/\n\n● TikTok: https://www.tiktok.com/@erniebored\n\n● Ernie’s site: https://imerniebird.com\n\nDaniella\u0027s Links:\nYou can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured\n \nFor more info on me:\nGo Fund Me for Publishing Culting of America: https://tr.ee/FTOBLyQnYo\nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\nDaniella’s Tiktok: https://bit.ly/4muxbu6 / @knittingcultladychat\nYoutube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg\nInstagram: https://www.instagram.com/stories/daniellamyoung_/\nHey White Women Podcast: https://tr.ee/2gWVBFaYnp\\\nCults and the Culting of America Podcast: https://sites.libsyn.com/534892/site\nWhite Women Get Ready: https://www.mistresssyndrome.com/book\n\nScot\u0027s TikTok\n@thescotloyd\nHaley\u0027s Tiktok\n@nuancedmasculinities\n\nKey Takeaways\n● 🥞 Sunday Brunch is about more than brunch: What began as a casual writing experiment became a thoughtful and absurdist musical that explores cult dynamics through comedy.\n\n● 🎶 The “Cult Song” hit a nerve: The viral charm song resonated deeply with survivors—especially its honest portrayal of how absurd (and painful) cult logic can be when juxtaposed with “normal” life.\n\n● 🎭 Comedy with respect: The team imposed structural rules (e.g., every chorus must mention the cult) that challenged them to find humor without mocking trauma—highlighting the difficulty and importance of “punching up.”\n\n● 🧠 Art can offer catharsis: Humor becomes a vehicle for emotional release, empathy, and representation of marginalized experiences—including those of cult survivors.\n\n● 🐻 There’s lore now?! The writers accidentally created rich backstory (e.g., cult wars, a three-headed bear god, a waitress married to a cult leader) and are considering a spin-off musical set fully inside the cult.\n\n● 💬 Cult experiences exist on a spectrum: Even without direct cult involvement, all guests reflected on how systems—like oppressive workplaces or nationalist ideologies—can mimic cult behavior.\n\n● ❤️ Creative partnerships matter: Ernie and Rachel’s deep friendship and comedic trust allowed for bold, weird, and eventually impactful storytelling.\n\n● 📢 Support artists: Follow Sunday Brunch: The Musical on Instagram and TikTok [@sundaybrunchthemusical], and look out for their official demos coming soon to Spotify.\n\nChapters\n00:00 Introduction to Sunday Brunch Musical\n02:59 The Creative Process Behind Sunday Brunch\n05:54 Character Development and Song Composition\n08:56 Exploring Themes of Cults in the Musical\n12:05 Comedy in Musical Theater\n15:10 Personal Experiences with Cults\n17:57 The Role of Art and Comedy in Society\n21:09 Future Projects and Aspirations\n24:01 Conclusion and Call to Action\nProduced by Haley Phillips",
      "release": "2025-07-29T15:46:00Z",
      "duration": "00:43:06",
      "explicit": false,
      "spotifyId": "2asj1WjDScahVIx5zCwfKq",
      "appleId": 1000719655517,
      "youTubeId": "OLw66oozyOk",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2asj1WjDScahVIx5zCwfKq",
        "apple": "https://podcasts.apple.com/podcast/cults-and-the-culting-of-america-with-knitting/id1756133150?i=1000719655517",
        "youtube": "https://www.youtube.com/watch?v=OLw66oozyOk"
      }
    },
    {
      "id": "b075c98e-1409-49b9-b2f7-7910547bada1",
      "title": "Episode 44 | The Cult of Capitalism",
      "description": "This episode of Cults and the Culting of America features guest Kelvin, a political scientist and community organizer, in a deep dive on whether capitalism functions as a cult and how overlapping systems like patriarchy, white supremacy, and religion have historically reinforced each other. The hosts, Scot and Daniella, explore the evolution of these frameworks—from European colonialism and the doctrine of discovery to modern American politics—and discuss how these systemic beliefs sustain cult-like behaviors in society. The conversation covers the historical hijacking of Christianity, education as a control mechanism, the cult of Americanism, and the psychological and political strategies that uphold oppressive systems. The episode closes with an optimistic note about generational shifts, the decline of white supremacist capitalism, and practical advice on grassroots activism.\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok: Knitting Cult Lady\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n 🔑 Key Takeaways   Capitalism as a Social Framework (Not Just Economics)\n   Capitalism is more than markets; it’s a way of being that shapes education, infrastructure, and social values.\n   Systems like schooling and urban planning are designed to sustain capitalist efficiency, not holistic human development.\n     The “Cult of Americanism”\n   American identity was built on the fusion of capitalism, patriarchy, and white supremacy, forming a powerful social order.\n   These ideologies served as tools to consolidate and distribute power, functioning like a macro-level cult.\n     Religion as a Tool of Oppression\n   Early Christianity advocated communalism and equity, but the Roman Empire co-opted it into a hierarchical system for control.\n   Similar hijacking occurs today: religious rhetoric justifies policies that maintain systemic inequality.\n     Historical Continuity of Control\n   From feudal Europe’s restricted education to modern book bans and anti-CRT measures, elites have always used education to control narratives.\n   Missionary work historically served as an agent of colonialism, reinforcing white supremacist dominance.\n     Cult Dynamics in Modern Politics\n   Donald Trump leveraged pre-existing ideological “mini cults” into a cult of personality.\n   Fear-mongering and disinformation perpetuate obedience, especially among poor whites who vote against their own interests.\n     Intersection of Racism, Class, and Patriarchy\n   Patriarchy incentivizes Black men’s alignment with conservative politics despite racial oppression, framing it as access to power.\n   Economic myths—like the American Dream—sustain loyalty to capitalist structures even among those it exploits.\n     Signs of Systemic Decline\n   Demographic shifts and younger generations’ progressive values suggest that white supremacist capitalism is in “death throes.”\n   Cults collapse when they lose control of youth—an encouraging sign for future equity.\n     Action Step for Listeners\n   “Find something you care about and show up where it’s happening.”\n Collective action grows when individuals commit to causes aligned with their values.\n     Chapters\n 00:00 Introduction and Book Launch\n 03:02 Exploring Capitalism as a Social Framework\n 05:44 Cults and Cultural Frameworks\n 08:51 The Cult of Americanism\n 11:50 Racism and Colonialism in America\n 14:52 The Evolution of Christianity and Power\n 17:50 Missionaries and Colonialism\n 20:59 The Arrogance of White Supremacy\n 23:45 Closing Thoughts on Education and Power\n 29:12 The Role of Education in Society\n 31:21 Questioning Authority and Personal Experiences\n 35:09 The Impact of Capitalism and White Supremacy\n 39:13 The Illusion of the American Dream\n 43:52 The Death Throes of White Supremacy and Capitalism\n 48:55 Shifts in Political Support Among Black Men\n 53:25 Hope for the Future and Community Engagement\n Produced by Haley Phillips",
      "release": "2025-07-22T12:24:00Z",
      "duration": "00:56:47",
      "explicit": false,
      "spotifyId": "5ZK3RV1K5g2KRFsXuqTHmx",
      "appleId": 1000718459964,
      "youTubeId": "BohmeXcFMcM",
      "subjects": [
        "Cult Psychology",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZK3RV1K5g2KRFsXuqTHmx",
        "apple": "https://podcasts.apple.com/podcast/episode-44-the-cult-of-capitalism/id1756133150?i=1000718459964",
        "youtube": "https://www.youtube.com/watch?v=BohmeXcFMcM"
      }
    },
    {
      "id": "56aca61e-baba-4125-a87a-209aeb8d00f6",
      "title": "Episode 42 | \u0022Not My Church\u0022: Plausible Deniability in High-Control Systems",
      "description": "In this revealing and emotionally rich episode of Cults and the Culting of America, Cynthia Williams joins hosts Scot Loyd and Daniella Mestyanek Young to unpack her journey through—and out of—the United Pentecostal Church International (UPCI). Cynthia shares how, like many others, she once believed that her local church was different. The rules were strict, yes, but they felt spiritually justified—until the cracks began to show.\nAs Cynthia puts it, the realization came slowly: “I think it\u0027s probably just in the last two years… that I finally was like, wait a minute, I think I was in a cult.” That moment of clarity is a turning point in the episode, as the conversation explores how UPCI and similar groups protect themselves through plausible deniability. “Not my church,” people say—oblivious or unwilling to confront the broader systemic harm. Cynthia describes how Bible college exposed her to both a deeper version of indoctrination and—paradoxically—the seeds of her exit. Through theology classes and critical thinking challenges, she began questioning the very doctrines that once gave her purpose. The episode also dives into her experience witnessing the tragic death of a teenage girl at Bible school—a loss that the church quickly co-opted into a martyrdom narrative, silencing Cynthia’s voice and rewriting the truth. Alongside moments of grief and spiritual disillusionment, the hosts discuss cult tactics like toxic positivity, spiritual bypassing, gendered control, and the recurring pattern of falling into other high-control environments even after leaving religion. From the military to corporate America, Cynthia’s story traces how these systems echo one another—and how healing requires naming those echoes for what they are. With warmth, honesty, and shared survivor wisdom, this episode is a candid look at what it means to say, “Maybe it was my church after all.”\n \nFor more info on me:\nGo Fund Me for Publishing Culting of America: https://tr.ee/FTOBLyQnYo\nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\nDaniella’s Tiktok: https://bit.ly/4muxbu6 / @knittingcultladychat\nYoutube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg\nInstagram: https://www.instagram.com/stories/daniellamyoung_/\nHey White Women Podcast: https://tr.ee/2gWVBFaYnp\\\nCults and the Culting of America Podcast: https://sites.libsyn.com/534892/site\n\nKey Take-Aways\n●Rules varied by pastor but enforced absolute obedience, reinforcing the illusion of autonomy while maintaining tight control.\n●Women were subjected to extreme modesty standards, with the specifics often shifting—creating confusion and deep internalization of shame and obedience.\n●Plausible deniability (\u0022not my church\u0022) was used to disguise systemic problems across UPCI.\n●Women in UPCI were expected to be either angelic “saints” or demonized “Jezebels”—no in-between.\n●Women showing independence or intellect were often ostracized or tightly policed.\n●Cynthia’s racial identity and outsider status gave her marginal freedom to step outside strict gender molds—but also made her invisible in some ways.\n●Bible school inadvertently helped Cynthia develop critical thinking, ultimately aiding her exit.\n●Leaving the group meant not just losing community, but also certainty, purpose, and a framework for meaning.\n●Like many ex-cult members, Cynthia found herself repeatedly drawn to similarly high-control environments even after leaving UPCI.\n●The murder of a student Cynthia mentored was mishandled by the church, which spun the event into a martyrdom narrative—silencing Cynthia and distorting the truth.\n●Cynthia shares how old coping strategies like breaking into church songs still emerge under stress—signs of deep conditioning and dissociation.\n●Daniella highlights the concept of being an “invisible immigrant”—growing up in an insular religious world without cultural references or grounding in the outside world.\n●They celebrate the comfort and solidarity found in the “ex-cult sisterhood”—a chosen family of people who get it.\n\nChapters\n00:00 Introduction to Cult Experiences\n 03:10 Personal Journeys in the United Pentecostal Church\n 06:01 Expectations and Restrictions for Women\n 08:46 Identifying Cult-like Behaviors\n 11:54 The Role of Education in Cult Awareness\n 15:05 Navigating Gender Dynamics in Cults\n 17:45 The Impact of Nostalgia and Shared Experiences\n 20:59 Emotional Healing and Reflection\n 23:57 Coping with Life After Leaving a Cult\n 30:20 Revisiting Trauma and Dissociation\n 31:55 Toxic Positivity in High-Control Groups\n 34:14 Tragedy and Manipulation: The Church\u0027s Narrative\n 39:40 The Impact of Violence on Faith Communities\n 43:23 Identity Crisis After Leaving the Cult\n 50:07 Life After the Cult: Finding New Paths\nProduced by Haley Phillips",
      "release": "2025-07-01T15:55:00Z",
      "duration": "00:57:52",
      "explicit": false,
      "spotifyId": "1HZxEcszIneXcEXEyWuB6q",
      "appleId": 1000715312145,
      "youTubeId": "DaKrj8Yi5PA",
      "subjects": [
        "Cult Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1HZxEcszIneXcEXEyWuB6q",
        "apple": "https://podcasts.apple.com/podcast/episode-42-not-my-church-plausible-deniability-in-high/id1756133150?i=1000715312145",
        "youtube": "https://www.youtube.com/watch?v=DaKrj8Yi5PA"
      }
    },
    {
      "id": "756db4c7-79e5-4ba7-8e12-c0c09eb3aad9",
      "title": "Episode 41 | Decolonizing Yourself with Hilary Giovale",
      "description": "In this episode of Cults and the Culting of America, host Scot Loyd and Daniella Mestyanek-Young (KnittingCultLady) sit down with Hilary Giovale—a ninth-generation settler living among Indigenous communities in Northern Arizona. Hilary opens up about her journey from segregation to engaging deeply with Native communities, emphasizing how re-education and personal healing can unravel the lasting wounds of colonialism. Hilary discusses the trauma inflicted by Indigenous boarding schools and the persistent impact of white supremacy on both marginalized communities and white culture. By practicing ancestral reverence and focusing on actionable reparations—like supporting sacred landscape protection and Indigenous-led initiatives—Hilary and her guests illustrate the transformative power of honest dialogue and community-based healing. For more on Hilary’s work, listeners are encouraged to visit her website, GoodRelative.com. Hilary\u0027s Links: Her Book: Becoming a Good Relative Guide to Making a Personal Reparations Plan An Indigenous Peoples History of the United States , by Roxanne Dunbar-Ortiz My Grandmother\u0027s Hands: Racialized Trauma and the Pathway to Mending Our Hearts and Bodies , by Resmaa Menakem Reclaiming Our Indigenous European Roots , by Lyla June Johnston Listeners can donate to the Native American Boarding School Healing Coalition to support the continued research and documentation Daniella\u0027s Links: You can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured For more info on me: Patreon: https://bit.ly/YTPLanding Cult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding Get an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured Get my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8 Daniella’s Tiktok: https://bit.ly/4bwvNC0 Instagram: https://bit.ly/4ePAOFK / daniellamyoung_ Unamerican video book (on Patreon): https://bit.ly/YTVideoBook Secret Practice video book (on Patreon): https://bit.ly/3ZswGY8 Other Podcasts Daniella\u0027s other podcast: Hey White Women Scot\u0027s TikTok @thescotloyd Haley\u0027s Tiktok @nuancedmasculinities Takeaways Transformative Re-education: Hilary shares her journey from a segregated existence to building respectful relationships with Indigenous communities. Boarding School Trauma: The discussion highlights the deep and enduring pain caused by Indigenous boarding schools and their impact on cultural identity. Confronting White Supremacy: The conversation emphasizes the need to recognize and dismantle the harmful legacy of white supremacy, both for marginalized people and within white culture itself. Humility and Listening: Hilary stresses the importance of approaching new communities with genuine curiosity, humility, and a readiness to learn rather than impose. Ancestral Healing Practices: The practice of ancestral reverence—such as maintaining an ancestor altar—is offered as a powerful tool for personal and collective healing. Community-Based Action: The episode underlines the significance of supporting sacred landscape protection, Indigenous-led initiatives, and creating personal reparations plans as crucial steps toward healing. Produced by Haley Phillips",
      "release": "2025-06-10T13:29:00Z",
      "duration": "00:56:43.4160000",
      "explicit": false,
      "spotifyId": "4fL1J6HtzOHYpdFZAwlrDc",
      "appleId": 1000712276619,
      "youTubeId": "kM4DmwbGVIY",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fL1J6HtzOHYpdFZAwlrDc",
        "apple": "https://podcasts.apple.com/podcast/episode-41-decolonizing-yourself-with-hilary-giovale/id1756133150?i=1000712276619",
        "youtube": "https://www.youtube.com/watch?v=kM4DmwbGVIY"
      }
    },
    {
      "id": "74df7538-754c-4905-a001-75b569bba0b6",
      "title": "Episode 39 | Scot wrote a book!",
      "description": "This week on Cults and the Culting of America, we’re turning the mic toward someone you all know well—our beloved cohost, Scot Loyd. With no guest this episode, Daniella takes the opportunity to spotlight Scot’s powerful personal journey and upcoming book, The God That I Was Given.\n In an open and layered conversation, Scot reflects on his years inside the United Pentecostal Church, his rise to leadership, and what it meant to deconstruct the faith and ideologies that shaped him. He and Daniella discuss the gendered nature of cult experiences, the silence often expected of men, and how writing becomes both a weapon and a lifeline for survivors.\n They also dig deep into the racist roots of Pentecostalism, the enduring myth of white Christian victimhood, and how cult dynamics echo through American politics today.\n Whether you’ve been here since episode one or are just tuning in, this intimate episode offers a closer look at Scot’s story and the broader systems of power so many of us are still trying to untangle.\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok:  https://bit.ly/4bwvNC0\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Takeways\n   Even Survivors Can Be Complicit\n Scot reflects on how he not only endured harm within the United Pentecostal Church but also perpetuated it as a preacher and leader. His journey involves confronting both victimhood and complicity—a nuanced look at accountability in high-control systems.\n   Patriarchy Shields Men from Cult Harm—and From Speaking Out\n The conversation explores why fewer men write cult survivor memoirs: patriarchal systems often cushion men from the worst abuses and discourage emotional vulnerability, leaving their stories underrepresented.\n   Faith Deconstruction Is Not Bitterness—It’s Clarity\n Scot addresses the accusation that leaving high-control religion makes you “bitter.” Drawing on biblical stories (like Naomi in Ruth), he reframes bitterness as a justified and even holy reaction to harm—and a fuel for transformation.\n   Cults Mirror American Systems of Power\n The episode draws strong parallels between cult dynamics and systemic issues in the U.S., including white supremacy, evangelical nationalism, and the cult of personality around political figures like Donald Trump.\n   Telling the Truth Is a Radical Act\n Both hosts emphasize the importance of sharing honest, unvarnished stories to give future generations language and context for their own experiences—and to challenge whitewashed versions of history.\n   The Tools Used to Indoctrinate Can Be Used to Liberate\n Scot talks about reclaiming the skills he developed in church—preaching, writing, public speaking—to critique the very systems that shaped him. Daniella echoes this with her own story, highlighting the healing power of storytelling.\n   Cult Experiences Are Strikingly Universal\n While each cult has its own doctrine or dogma, the episode highlights the common traits—performance culture, black-and-white thinking, suppression of autonomy—that unite cult survivors across backgrounds.\n   Chapters\n 00:00 Introduction and Book Projects\n 03:26 Exploring Gender Perspectives in Cult Experiences\n 06:37 The Unraveling of Beliefs and Personal Reflection\n 09:27 The Role of Education in Leaving Cults\n 12:20 Writing as a Tool for Healing and Reflection\n 15:36 Navigating the Complexity of Cult Narratives\n 18:24 Confronting the Charge of Bitterness\n 21:17 The Power of Personal Stories in Cult Recovery\n 24:25 The Importance of Documenting Experiences for Future Generations\n 31:56 The Burden of Representation in Cults\n 35:18 Historical Narratives and Cultural Spin\n 39:56 The Roots of Pentecostalism and Racism\n 44:39 The Legacy of Racism in American Christianity\n 49:40 Cult of Personality vs. Cult of Ideas\n 56:11 The Current Political Climate and Its Cult-like Dynamics\n Produced by Haley Phillips",
      "release": "2025-06-03T13:24:00Z",
      "duration": "01:00:49",
      "explicit": false,
      "spotifyId": "18AKze8nyaNEGOyDAIePxS",
      "appleId": 1000711017515,
      "youTubeId": "oz7LNdahMAk",
      "subjects": [
        "Evangelicalism",
        "Cult Psychology",
        "Qanon",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18AKze8nyaNEGOyDAIePxS",
        "apple": "https://podcasts.apple.com/podcast/episode-39-scot-wrote-a-book/id1756133150?i=1000711017515",
        "youtube": "https://www.youtube.com/watch?v=oz7LNdahMAk"
      }
    },
    {
      "id": "d76a7d24-e865-4b07-aebf-eb7684a30f68",
      "title": "Episode 39 | \u0022Satanic Panic\u0022 Facts and Fiction",
      "description": "Summary\n In this episode, the hosts delve into the complex world of cults, focusing on the Satanic Panic and the influence of charismatic leaders like Franklin Jones. They explore the historical context of cults, the role of fear and control, and the lasting impact of cult experiences on individuals. Through personal stories and reflections, the conversation highlights the intricate dynamics of cults and their cultural significance. In this conversation, the participants explore the complexities of growing up in cult-like environments, the challenges of healing from trauma, and the nuances of personal identity shaped by these experiences. They discuss the importance of critical reflection on spiritual beliefs, the impact of family dynamics, and the struggle against misinformation and polarization in society. The dialogue emphasizes the need for understanding and compassion in navigating these difficult topics, while also recognizing the value of storytelling and fiction in processing and sharing their journeys.\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok:  https://bit.ly/4bwvNC0\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Takeaways\n  Cults often use fear as a tool for control. The Satanic Panic was a significant cultural phenomenon. Franklin Jones exemplified the charismatic cult leader. Historical parallels exist between past witch hunts and modern cults. Charisma plays a crucial role in attracting followers. Fear of the unknown drives many cult narratives. Cults can distort personal identities and experiences. The impact of cult upbringing can last a lifetime. Cultural context shapes the perception of cults.  Chapters\n 00:00 Introduction and Background of Guests\n 03:16 Understanding the Satanic Panic\n 10:08 Cultural Reflections and Modern Parallels\n 12:55 The Role of Fear in Religious Contexts\n 17:26 The Impact of Fiction on Beliefs\n 23:01 Historical Context of Satanic Panic\n 30:02 Education, Critical Thinking, and the Binary Mindset\n 33:37 Escaping the World: A Discussion on Beliefs\n 34:06 The Illusion of Quick Fixes: Mastery Takes Time\n 36:15 The Heartbreak of Misguided Spiritual Practices\n 39:12 The Daily Struggle: Healing from Trauma\n 40:26 Faith vs. Fear: Understanding Belief Systems\n 41:22 The Power of Fiction: Engaging with Difficult Truths\n 43:57 Exploring Family Legacies: The Weight of Expectations\n 48:57 Navigating Polarization: Engaging with Contradictory Beliefs\n 50:51 Challenging Misinformation: The Role of Insiders\n 54:07 The Complexity of Good and Evil: A Nuanced Perspective\n 58:04 Cult Dynamics: The Influence of Upbringing on Beliefs\n 01:03:48 Caring for Aging Parents and Reflecting on the Past\n Produced by Haley Phillips",
      "release": "2025-05-27T12:40:00Z",
      "duration": "01:04:41",
      "explicit": false,
      "spotifyId": "3CTpsuKW4C3mXl90vm0ZeW",
      "appleId": 1000710106682,
      "youTubeId": "5bp275i66BM",
      "subjects": [
        "Adi Da",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3CTpsuKW4C3mXl90vm0ZeW",
        "apple": "https://podcasts.apple.com/podcast/episode-39-satanic-panic-facts-and-fiction/id1756133150?i=1000710106682",
        "youtube": "https://www.youtube.com/watch?v=5bp275i66BM"
      }
    },
    {
      "id": "1a8e7d17-6120-4464-a39f-879288f0878c",
      "title": "Episode 38 | Starbucks and Corporate Cults",
      "description": "In this conversation, Daniella and Kasi explore the cult-like aspects of Starbucks, discussing Kasi\u0027s personal journey from barista to store manager and the emotional and psychological dynamics at play within the corporate structure. They delve into themes of recruitment, vulnerability, the illusion of family, leadership programs, and the impact of corporate culture on mental health. The discussion highlights the emotional manipulation and control exerted by organizations, drawing parallels to cult behavior and the sacrifices individuals make for their jobs.\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok:  https://bit.ly/4bwvNC0\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Takeaways\n  Starbucks had a significant impact on Kasi\u0027s formative years. Young adults are particularly vulnerable to corporate recruitment tactics. The fun environment at Starbucks was a major draw for Kasi. The concept of \u0027family\u0027 in corporations can be misleading. Leadership programs often serve the organization\u0027s needs more than the individual\u0027s. Emotional manipulation is prevalent in corporate events and culture. Mental health struggles can arise from high-demand work environments. Self-sabotage can occur when trying to maintain a positive image in a toxic environment. The deification of leaders can create a cult-like atmosphere in companies. Mourning the loss of belief in a caring organization is a common experience.  Chapters\n 00:00 Introduction to Starbucks Cultiness\n 02:31 Kasi\u0027s Journey with Starbucks\n 05:41 Recruitment and Vulnerability in Young Adults\n 10:56 The Illusion of Family and Loyalty\n 13:59 Leadership Programs and Organizational Control\n 19:46 The Echo Chamber of Corporate Culture\n 25:37 Influence of Recommended Reading and Ideology\n 27:54 The Cult of Education and Gratitude\n 29:46 Emotional Manipulation in High-Demand Organizations\n 32:20 Trauma and Recovery in Cult-like Environments\n 36:27 The Illusion of Trust and Loyalty\n 41:36 The Role of Emotional Evocation in Corporate Culture\n 45:26 The Cost of Self-Sacrifice in the Workplace\n 50:05 The Breaking Point: Mental Health and Organizational Pressure\n 55:35 Mourning the Loss of Belief in Organizations\n Produced by Haley Phillips",
      "release": "2025-05-13T12:00:00Z",
      "duration": "00:56:56",
      "explicit": false,
      "spotifyId": "2kMt9aIjJO3HTUqYTmVeRi",
      "appleId": 1000708316507,
      "youTubeId": "yVkAl-ZYQPc",
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2kMt9aIjJO3HTUqYTmVeRi",
        "apple": "https://podcasts.apple.com/podcast/episode-38-starbucks-and-corporate-cults/id1756133150?i=1000708316507",
        "youtube": "https://www.youtube.com/watch?v=yVkAl-ZYQPc"
      }
    },
    {
      "id": "2dff65bc-b04a-467f-adfe-4f0dad974da0",
      "title": "Episode 37 | Caring For Relatives When They Didn\u0027t Care For You",
      "description": "In this episode of Cults and the Culting of America, host Scot Loyd and guest Jonathan Hirsch delve into the complexities of growing up in a cult-like environment, specifically under the influence of Franklin Jones. They explore the allure of charismatic leaders, the sacrifices made by children in these settings, and the long-term emotional impacts on individuals raised in such communities. Jonathan shares his personal journey, including the challenges of reconciling his upbringing with his current life, and the importance of understanding the experiences of cult kids. The conversation highlights the need for open discussions about the past and the recognition of the profound effects of parental choices on children.\n Jonathan\u0027s Links: \n\n Podcast: Dear Franklin Jones\n  Author Page \n  Audiobook: The Mind is Burning \n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok:  https://bit.ly/4bwvNC0\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n Haley\u0027s Tiktok\n @nuancedmasculinities\n Takeaways\n  Growing up in a cult can shape one\u0027s identity. Charismatic leaders often create a sense of belonging. Children in cults face unique challenges and expectations. The evolution of a cult leader\u0027s ideology can be manipulative. Personal experiences in cults can lead to lifelong impacts. Understanding the past is crucial for healing. The importance of open dialogue about cult experiences. Parental choices in cults can lead to emotional sacrifices. Cult kids often inherit their parents\u0027 spiritual pursuits. There is a need for recognition and support for cult survivors.  Chapters\n 00:00 Introduction to Cults and Personal Stories\n 06:33 The Influence of Franklin Jones\n 12:33 The Evolution of a Cult Leader\n 18:20 Childhood in a Cult\n 24:22 The Impact of Cult Life on Identity\n 31:01 The Cult Baby Experience\n 33:53 Understanding Parental Sacrifice in Cults\n 40:00 The Impact of Spiritual Pursuits on Family Dynamics\n 49:58 Navigating Relationships with Cult Parents\n 52:54 Caring for Aging Parents and Reflecting on the Past\n Produced by Haley Phillips",
      "release": "2025-05-06T12:05:00Z",
      "duration": "00:51:09",
      "explicit": false,
      "spotifyId": "3J2pbj4c4qUTyCPIDc39E2",
      "appleId": 1000706517016,
      "youTubeId": "0eEltc9-f9c",
      "subjects": [
        "Adi Da"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3J2pbj4c4qUTyCPIDc39E2",
        "apple": "https://podcasts.apple.com/podcast/episode-37-caring-for-relatives-when-they-didnt-care-for-you/id1756133150?i=1000706517016",
        "youtube": "https://www.youtube.com/watch?v=0eEltc9-f9c"
      }
    },
    {
      "id": "fe663f32-b03a-42ba-a82b-973217517b72",
      "title": "Episode 36 | Yogaville",
      "description": "In this episode, Scott and Daniella engage with Brianna, who shares her profound journey through the world of yoga and her experiences at Yogaville, a yoga community that turned out to be more complex than it seemed. Brianna discusses her initial attraction to the community, the positive aspects she encountered, and the darker realities that unfolded over time, including manipulation, abuse, and the psychological toll of being involved in a cult-like environment. The conversation emphasizes the importance of trust, intuition, and the need for open discussions about both the good and bad experiences within such organizations.\n Briana\u0027s Podcast\n Surviving Satchidananda\n Haley\u0027s Tiktok\n @nuancedmasculinities\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok:  https://bit.ly/4bwvNC0\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n Takeaways\n  Brianna\u0027s journey began with a search for community and healing through yoga. Yogaville initially provided a sense of belonging and support for Brianna. Cults often exploit individuals during vulnerable times in their lives. Positive experiences in cults can make it difficult to recognize abuse. Secrecy and misinformation are common tactics used by cults to maintain control. Brianna experienced both joy and trauma during her time at Yogaville. Trusting one\u0027s intuition is crucial when something feels off. Cults can provide a sense of purpose but often at a significant cost. The psychological impact of cult involvement can be profound and long-lasting. Advocacy and sharing stories are essential for healing and awareness.  Chapters\n 00:00 Introduction to the Podcast and Guest\n 02:02 Brianna\u0027s Journey into Yoga and Yogaville\n 06:04 The Allure of Community and Spirituality\n 10:01 Unraveling the Dark Side of Yogaville\n 14:07 Experiences of Abuse and Control\n 20:02 The Struggle to Leave and Labor Exploitation\n 24:35 Control and Autonomy in Cults\n 28:44 Unraveling the Truth: Personal Experiences\n 32:44 The Role of Secrecy and Deception\n 39:29 Navigating Relationships After Leaving\n 41:04 Creating Awareness and Sharing Stories\n 42:45 Trusting Your Intuition and Finding Balance\n Produced by Haley Phillips",
      "release": "2025-04-29T12:00:00Z",
      "duration": "00:47:38",
      "explicit": false,
      "spotifyId": "2qRsqiqIcJ5Yk1wzi9Em2I",
      "appleId": 1000705400025,
      "youTubeId": "f30-3qaZWfc",
      "subjects": [
        "Yogaville",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qRsqiqIcJ5Yk1wzi9Em2I",
        "apple": "https://podcasts.apple.com/podcast/episode-36-yogaville/id1756133150?i=1000705400025",
        "youtube": "https://www.youtube.com/watch?v=f30-3qaZWfc"
      }
    },
    {
      "id": "7537906e-a59f-4cdd-913a-c6ce10006f5d",
      "title": "Episode 35 | AA From an Addiction Specialist",
      "description": "In this episode, Scott Loyd and Daniela Mestyanek-Young engage in a deep conversation with Andi Wiseman about the nature of cults, particularly focusing on the military and Alcoholics Anonymous (AA). They explore the harmful aspects of 12-step programs, the intersection of addiction and systemic issues, and the importance of listening to survivors. The discussion highlights personal experiences with cult-like behavior in nonprofits and the need for a broader understanding of recovery beyond traditional frameworks.\n Andi\u0027s Links\n Website\n  The Book: The Unsubtle Art of Unfucking Your Life\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok:  https://bit.ly/4bwvNC0\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n Takeaways\n Cults can be found in various societal structures, including the military and AA.\n The 12-step model may not work for everyone and can be harmful.\n Recovery is a personal journey that can take many forms.\n Cults often manipulate vulnerable individuals seeking connection.\n The nonprofit sector can exhibit cult-like behaviors.\n Systemic issues contribute to addiction and recovery challenges.\n Listening to survivors is crucial for understanding the impact of cults.\n Secrecy in groups often hides harmful practices.\n Challenging the status quo is necessary for meaningful change.\n Individual action alone cannot solve systemic problems.\n Chapters\n 00:00 Introduction to Cults and Group Behavior\n 03:01 Exploring the Definition of Cults\n 06:08 The Role of AA and Military in Cult Dynamics\n 08:59 The Harmful Impact of 12-Step Programs\n 11:59 Generational Trauma and Cult Influence\n 14:59 Personal Stories and Systemic Issues\n 18:04 Navigating Nonprofit Work and Cult-like Structures\n 20:52 The Intersection of Individual Action and Systemic Problems\n 29:42 Systemic Issues in Recovery\n 36:18 The Intersection of Faith and Recovery Programs\n 40:06 The Role of the State in Addiction Treatment\n 43:20 Cults and Coercive Control\n 49:04 Understanding Trauma and Recovery\n 55:02 Promoting Open Conversations about Recovery\n Produced by Haley Phillips",
      "release": "2025-04-15T19:17:00Z",
      "duration": "00:58:02",
      "explicit": false,
      "spotifyId": "2J8teDfpXBHcI3kyMfxDg0",
      "appleId": 1000703648839,
      "youTubeId": "MijvuNrwM5w",
      "subjects": [
        "Alcoholics Anonymous",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2J8teDfpXBHcI3kyMfxDg0",
        "apple": "https://podcasts.apple.com/podcast/episode-35-aa-from-an-addiction-specialist/id1756133150?i=1000703648839",
        "youtube": "https://www.youtube.com/watch?v=MijvuNrwM5w"
      }
    },
    {
      "id": "341be90e-a5f6-4a30-925d-b0d78bafd65c",
      "title": "Episode 34 | Cult of Masculinity",
      "description": "In this episode of Cults and the Culting of America, hosts Scot Loyd and Daniella Mesteneck Young engage in a profound conversation with Jack about the complexities of masculinity, the cultural constructs surrounding gender identity, and the emotional struggles faced by men in contemporary society. Jack shares his personal journey from a troubled upbringing to his work in men\u0027s circles, emphasizing the need for vulnerability, community, and a redefinition of masculinity that moves away from harmful stereotypes. The discussion explores the impact of societal expectations, the illusion of male superiority, and the importance of emotional expression and connection among men.\n Jack\u0027s Links: \n Website: https://healthecycle.com/\n TikTok: @watchfulcayote\n Youtube (His podcast is here) : @WatchfulCayote\n  Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   \n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok:  https://bit.ly/4bwvNC0\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n Takeaways\n  Masculinity is often defined by societal constructs rather than biological factors. There is a significant difference between sex (male) and gender (man). Cultural influences shape our understanding of gender from a very young age. Parenting plays a crucial role in shaping children\u0027s perceptions of gender. Communication styles differ between boys and girls, often influenced by societal norms. The cult of masculinity imposes harmful expectations on men. Anger among men often stems from unmet societal promises and expectations. The narrative of male superiority is a damaging myth. Men often sacrifice their emotional health for societal expectations. Building healthy male communities is essential for emotional well-being.  Chapters\n 00:00 Introduction to the Cult of Masculinity\n 02:11 Jack\u0027s Journey: From Trauma to Men\u0027s Work\n 04:03 Defining Masculinity: Sex vs. Gender\n 08:02 Cultural Influences on Gender Identity\n 11:34 Communication Styles: Boys vs. Girls\n 16:10 The Impact of Gendered Expectations\n 20:02 Navigating Masculinity in Modern Relationships\n 23:09 The Cult of Masculinity: Ideals and Influences\n 26:45 Angry White Male America: A Cultural Analysis\n 31:18 The Intersection of Politics and Masculinity\n 36:26 Understanding Privilege and Its Misconceptions\n 38:44 The Cult of Patriarchy and Its Promises\n 40:26 The Impact of White Supremacy on All Men\n 43:02 The Cost of Self-Sacrifice in Masculinity\n 50:11 Isolation and the Need for Male Community\n Produced by Haley Phillips",
      "release": "2025-04-08T12:00:00Z",
      "duration": "01:02:53",
      "explicit": false,
      "spotifyId": "5V8OEQpQTW1chnNuDnt5hK",
      "appleId": 1000702695960,
      "youTubeId": "d_XP95Z-pOA",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5V8OEQpQTW1chnNuDnt5hK",
        "apple": "https://podcasts.apple.com/podcast/episode-34-cult-of-masculinity/id1756133150?i=1000702695960",
        "youtube": "https://www.youtube.com/watch?v=d_XP95Z-pOA"
      }
    },
    {
      "id": "97c4ea60-653a-44f2-bb34-ce4dc41ee175",
      "title": "Episode 33 | Improvement Gurus",
      "description": "In this episode of Cults and the Culting of America, host Scott Loyd and guest Daniela Mestenec Young engage in a deep conversation with Ben John about the self-help industry, misguided mentors, and the red flags associated with cult-like organizations. Ben shares his personal journey of being involved in a self-help group that he later recognized as a cult, discussing the tactics used by leaders to manipulate followers. The conversation explores the importance of discernment in seeking guidance, the emotional costs of leaving such groups, and the need for authenticity in personal growth. Ben emphasizes that true growth comes from within and that individuals should be wary of those who exploit vulnerabilities for profit.\n   \n   Benjamin’s Links\n   \n  Youtube\n   Book\n   \n   Daniella\u0027s Links:\n   You can read all about my story in my book, Uncultured-- buy signed copies here.  https://bit.ly/SignedUncultured\n   For more info on me:\n   Patreon:  https://bit.ly/YTPLanding\n   Cult book Clubs (Advanced AND Memoirs) Annual Membership:  https://bit.ly/YTPLanding\n   Get an autographed copy of my book, Uncultured:  https://bit.ly/SignedUncultured\n   Get my book, Uncultured, from Bookshop.org:  https://bit.ly/4g1Ufw8\n   Daniella’s Tiktok:  https://bit.ly/4bwvNC0\n   Instagram:   https://bit.ly/4ePAOFK  / daniellamyoung_ \n   Unamerican video book (on Patreon):  https://bit.ly/YTVideoBook\n   Secret Practice video book (on Patreon):  https://bit.ly/3ZswGY8\n   Other Podcasts\n   Daniella\u0027s other podcast:  Hey White Women\n   Scot\u0027s TikTok\n   @thescotloyd\n   Takeaways\n    The self-help industry is largely unregulated and can be predatory.\n    Misguided mentors often use manipulation tactics to control their followers.\n    Vulnerability can be weaponized by cult leaders to create dependency.\n    Leaving a cult can result in significant emotional and relational costs.\n    Authenticity in personal growth is crucial; individuals should trust their instincts.\n    Red flags include leaders who discourage independent thinking.\n    Community and belonging are powerful human desires that cults exploit.\n    Self-help should not come at the cost of personal well-being.\n    It\u0027s important to recognize the difference between ethical and unethical sales tactics.\n    Personal transformation can attract predators, so caution is necessary.\n    \n   Chapters\n   00:00 Introduction to the Podcast and Guests\n   02:27 The Rise of Misguided Mentorship\n   06:30 The Cult of Self-Help and Masculinity\n   11:44 Red Flags in Self-Help Groups\n   17:33 The Illusion of Vulnerability\n   23:20 Identifying Ethical Mentorship\n   29:20 Conclusion and Final Thoughts\n   30:45 The Charismatic Leader Phenomenon\n   32:11 The Transformation into Villainy\n   33:06 Awareness and Advocacy Against Cults\n   34:22 Navigating the Fine Line of Influence\n   36:13 Understanding Group Behavior and Manipulation\n   38:19 Creating Ethical Sales Practices\n   39:45 The Journey of Deconstruction\n   42:31 Authenticity in Storytelling\n   44:33 The High Cost of Leaving Cults\n   49:49 Advice to My Younger Self\n   51:16 The Permission to Just Be\n  \n   Produced by Haley Phillips",
      "release": "2025-04-01T13:48:00Z",
      "duration": "00:57:22",
      "explicit": false,
      "spotifyId": "3Ga2tS4lqXDLiLmiJuw6IQ",
      "appleId": 1000701734149,
      "youTubeId": "nJzrZ79hjAI",
      "subjects": [
        "Grant Cardone",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Ga2tS4lqXDLiLmiJuw6IQ",
        "apple": "https://podcasts.apple.com/podcast/episode-33-improvement-gurus/id1756133150?i=1000701734149",
        "youtube": "https://www.youtube.com/watch?v=nJzrZ79hjAI"
      }
    },
    {
      "id": "76d88d05-40ef-4861-88ff-7b5f5a83d326",
      "title": "Episode 32 | Satanic Panic Debunked",
      "description": "In this episode of Cults and the Culting of America, hosts Scott Loyd and Daniela Mesteneck Young engage in a profound conversation with Lydia Knight, who shares her harrowing experiences growing up in a cult. Lydia discusses the complexities of her upbringing, including themes of racism, the satanic panic, and the psychological impact of fear and control within cult dynamics. The conversation delves into the process of healing and deprogramming, the importance of reconnecting with family, and the empowerment that comes from leadership and coaching. Lydia\u0027s journey of transformation serves as an inspiring testament to resilience and the power of reclaiming one\u0027s narrative.\n Lydia\u0027s Links:\n https://theshecenter.org/\n Daniella\u0027s Links:\n  You can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured  For more info on me:  Patreon: https://bit.ly/YTPLanding  Cult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding  Get an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured  Get my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8  Daniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady  Instagram:  https://bit.ly/4ePAOFK / daniellamyoung_   Unamerican video book (on Patreon): https://bit.ly/YTVideoBook  Secret Practice video book (on Patreon): https://bit.ly/3ZswGY8  Other Podcasts\n Daniella\u0027s other podcast: Hey White Women\n  Scot\u0027s TikTok\n @thescotloyd\n Takeaways\n  Lydia Knight shares her experiences growing up in a cult. The concept of \u0027apocalypticizing\u0027 reflects societal fears. Racism and identity play significant roles in cult experiences. The satanic panic of the 80s influenced many cult narratives. Fear can create a false sense of comfort and community. The importance of questioning and seeking truth in cult dynamics. Healing from trauma involves deprogramming from harmful beliefs. Reconnecting with family can be a complex journey. Empowerment through leadership is crucial for women. Transforming trauma into a source of strength is possible.  Chapters\n 00:00 Introduction to Cult Experiences\n 03:25 Lydia Knight\u0027s Journey and Background\n 06:08 Racism and Identity in a Cult\n 09:21 The Impact of the Satanic Panic\n 12:00 The Role of Secret Knowledge in Cults\n 15:11 The Complexity of Abuse and Protection\n 18:02 Deconstructing Cult Beliefs and Systems\n 20:52 The Intersection of Personal and Societal Cultures\n 23:57 Reflections on Healing and Activism\n 31:17 The Creation of Fear and Control\n 32:46 Facing Fears and Planning for the Worst\n 36:29 Breaking Free from Past Programming\n 41:33 The Journey of Discovery and Truth\n 48:17 Confronting Lies and Seeking Proof\n 49:54 Reconnecting with Family and Healing\n 53:41 Transforming Trauma into Empowerment\n Produced by Haley Phillips",
      "release": "2025-03-25T13:51:00Z",
      "duration": "01:01:35",
      "explicit": false,
      "spotifyId": "2xiZyA4WzoMvSuaFlZEvDP",
      "appleId": 1000700764949,
      "youTubeId": "9bCMW-AILfM",
      "subjects": [
        "Cult Recovery",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2xiZyA4WzoMvSuaFlZEvDP",
        "apple": "https://podcasts.apple.com/podcast/episode-32-satanic-panic-debunked/id1756133150?i=1000700764949",
        "youtube": "https://www.youtube.com/watch?v=9bCMW-AILfM"
      }
    },
    {
      "id": "da67308e-4ce1-4def-8b13-38b9ea5a694b",
      "title": "Episode 31 | Cult Situation Report",
      "description": "In this episode of Cults and the Culting of America, hosts Scot Loyd and Daniella Mesteneck Young explore the current political climate in the U.S. and its parallels to cult dynamics. They discuss the rise of cult mentality, the deification of leaders, and the implications of executive power. The conversation emphasizes the importance of community, collective action, and the role of art in resisting oppressive governance. The hosts encourage listeners to engage with their communities and resist fear-driven narratives, highlighting the need for resilience and creativity in challenging times.\n Daniella\u0027s Links:\n  You can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured  For more info on me:  Patreon: https://bit.ly/YTPLanding  Cult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding  Get an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured  Get my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8  Daniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady  Instagram:  https://bit.ly/4ePAOFK / daniellamyoung_   Unamerican video book (on Patreon): https://bit.ly/YTVideoBook  Secret Practice video book (on Patreon): https://bit.ly/3ZswGY8  Other Podcasts\n Daniella\u0027s other podcast: Hey White Women\n  Scot\u0027s TikTok\n @thescotloyd\n Takeaways\n  The current political climate reflects cult-like dynamics. Fear is a tactic used by cult leaders to control. Deification of leaders leads to dangerous governance. Cults can be led by charismatic individuals or ideas. The military operates under a different cult dynamic than political cults. Executive power is expanding in ways that threaten democracy. Community engagement is crucial for resistance. Art and hobbies are vital during oppressive times. Panic is counterproductive; planning and action are essential. History teaches us that patterns repeat, but not exactly.  Chapters\n 00:00 Introduction to Cult Dynamics\n 03:38 The Current Political Climate and Cult Behavior\n 06:40 The Deification of Leaders\n 09:33 Cult Language and Tactics\n 12:44 Military Culture and Cult Dynamics\n 15:28 The Intersection of Politics and Military\n 18:38 The Role of Women in Military Cultures\n 21:36 Concluding Thoughts on Cults and Society\n 29:09 The Acceleration of Authoritarianism\n 31:33 The Resilience of American Democracy\n 34:32 The Dangers of Pendulum Politics\n 37:36 Historical Context and Future Concerns\n 40:40 The Impact of Governance on Global Relations\n 43:37 Strategies for Resilience and Resistance\n 47:06 Community and Collective Action\n 51:25 The Role of Hobbies in Times of Oppression",
      "release": "2025-03-18T12:00:00Z",
      "duration": "00:56:29",
      "explicit": false,
      "spotifyId": "7he3k7hvTGi5Bf2GICcT7z",
      "appleId": 1000699642039,
      "youTubeId": "HKxJTJ96zCY",
      "subjects": [
        "Political Cult",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7he3k7hvTGi5Bf2GICcT7z",
        "apple": "https://podcasts.apple.com/podcast/episode-31-cult-situation-report/id1756133150?i=1000699642039",
        "youtube": "https://www.youtube.com/watch?v=HKxJTJ96zCY"
      }
    },
    {
      "id": "5d24f11e-48f2-4878-b464-e1e177255e56",
      "title": "Episode 30 | The DSM as a Weapon",
      "description": "In this conversation, Daniella and Katie Keech explore the intersections of cult dynamics, mental health, and neurodiversity. They discuss the misdiagnosis of mental health disorders in cult survivors, the authoritarian nature of the DSM, and the importance of self-definition and community support. The conversation delves into the complexities of plurality, trauma, and identity, emphasizing the need for a nuanced understanding of these issues in a world that often seeks to categorize and control individuals.\n\nDaniella\u0027s Links:\nYou can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured\nFor more info on me:\nPatreon: https://bit.ly/YTPLanding\n\nGet an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured\nGet my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8\n\nDaniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady\nInstagram:  https://bit.ly/4ePAOFK / daniellamyoung_ \nUnamerican video book (on Patreon): https://bit.ly/YTVideoBook\nSecret Practice video book (on Patreon): https://bit.ly/3ZswGY8\n\nOther Podcasts\nDaniella\u0027s other podcast: Hey White Women\n\nTakeaways\nMany cult survivors are misdiagnosed with mental health disorders.\nThe DSM can serve as a tool for control rather than understanding.\nNeurodivergent individuals often face unique challenges in cult environments.\nSelf-diagnosis can empower individuals to understand their identities.\nCults and fascist dynamics share similar control mechanisms.\nCommunity support is crucial for those navigating identity issues.\nPlurality is a valid identity that challenges traditional notions of self.\nTrauma impacts individuals differently, and not all trauma leads to DID.\nCultural perspectives on identity can vary widely and influence understanding.\nThe importance of flexibility in thought and understanding human behavior.\nChapters\n00:00 Introduction to Cults and Mental Health\n 02:21 Misdiagnosis and Understanding DID\n 05:25 Neurodiversity and Cult Dynamics\n 10:03 Therapists and Cult-like Structures\n 12:02 The Ethics of Therapy and Self-Diagnosis\n 17:23 Exploring Plurality and Neurodivergence\n 31:10 The Illusion of Rationality\n 32:34 The Complexity of Human Emotions\n 34:47 Patriarchy and Cult Dynamics\n 36:42 Power Structures and Empathy\n 38:30 Community and Connection in Modern Society\n 41:17 Navigating Identity in a Changing World\n 43:42 The Dangers of Binary Thinking\n 45:43 The Impact of Control in Cults and Military\n 47:46 The Spectrum of Human Experience\n 49:27 Redefining Labels and Definitions\n 51:36 The Tactics of Control\n 53:24 The Role of Nuance in Understanding Cults\n 55:19 Evolving Perspectives in Mental Health\nProduced by Haley Phillips",
      "release": "2025-03-04T13:54:00Z",
      "duration": "00:58:50",
      "explicit": false,
      "spotifyId": "2ziB4VghbzNTVkNBlKvaL0",
      "appleId": 1000697645687,
      "youTubeId": "WoLVlp7Iphw",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ziB4VghbzNTVkNBlKvaL0",
        "apple": "https://podcasts.apple.com/podcast/episode-30-the-dsm-as-a-weapon/id1756133150?i=1000697645687",
        "youtube": "https://www.youtube.com/watch?v=WoLVlp7Iphw"
      }
    },
    {
      "id": "5c3c4985-d660-4bf9-82b1-917214e6d014",
      "title": "Episode 29 | Asian American Apostate",
      "description": "In this episode of Cults and the Culting of America, hosts Scot Loyd and Daniella Mesteneck Young engage in a deep conversation with Scott Okamoto, who shares his journey from evangelical Christianity to questioning the very foundations of his beliefs. The discussion touches on themes of identity, race, and the struggles of belonging within high-control groups. They explore the dynamics of critical thinking versus apologetics in Christian education, the impact of the model minority myth, and the role of empathy in Christianity. Scott reflects on his experiences teaching at a Christian university and the challenges he faced while trying to foster a more inclusive environment. The conversation culminates in a discussion about the current state of Christianity and its intersection with social justice, as well as Scott\u0027s ongoing work in helping others navigate their own journeys out of high-control groups.\n Scott Okamoto\u0027s Links:\n Substack\n Podcast\n  Book\n Daniella\u0027s Links:\n  You can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured  For more info on me:  Patreon: https://bit.ly/YTPLanding  Cult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding  Get an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured  Get my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8  Daniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady  Instagram:  https://bit.ly/4ePAOFK / daniellamyoung_   Unamerican video book (on Patreon): https://bit.ly/YTVideoBook  Secret Practice video book (on Patreon): https://bit.ly/3ZswGY8  Other Podcasts\n Daniella\u0027s other podcast: Hey White Women\n  Takeaways\n  Scott Okamoto shares his experience growing up in evangelical Christianity. The conversation highlights the struggles of identity and belonging in high-control groups. Critical thinking is often stifled in Christian education, replaced by apologetics. The model minority myth complicates the experiences of Asian Americans in evangelical spaces. Empathy is lacking in contemporary Christianity, as evidenced by recent teachings. Scott\u0027s journey out of evangelicalism was gradual, marked by many small realizations. Interpersonal relationships can be a significant barrier to leaving high-control groups. Scott\u0027s current work focuses on helping others navigate their experiences in Christian schools. The conversation draws parallels between cult dynamics and the tech industry. The hosts emphasize the importance of questioning and critical engagement in all areas of life.  Chapters\n 00:00 Introduction and Acknowledgment of Social Issues\n 01:55 Scott Okamoto\u0027s Journey in Evangelical Christianity\n 06:53 Struggles with Identity and Belonging\n 10:40 The Role of Argumentation in Cults and Christianity\n 15:13 Toxic Masculinity and Church Dynamics\n 18:24 Racial Dynamics in Christianity\n 23:44 The Model Minority Myth and Its Implications\n 30:03 Recognizing Our Place in the Movement\n 31:08 The Journey of Awakening\n 32:13 The Struggle with Faith and Reality\n 35:01 The Cop-Out of Prayer\n 36:28 The Politics of Panic\n 38:57 Interpersonal Relationships and Leaving the Church\n 40:05 Finding Community Beyond the Church\n 43:30 Empathy and the State of Christianity\n 44:44 The Podcast and the Book\n 52:41 The Cult of the Tech Industry\n Produced by Haley Phillips",
      "release": "2025-02-25T15:03:00Z",
      "duration": "01:02:18",
      "explicit": false,
      "spotifyId": "6KXXU3OTAVbuctxw6WVVrL",
      "appleId": 1000695896678,
      "youTubeId": "DEL3w-vUYNU",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KXXU3OTAVbuctxw6WVVrL",
        "apple": "https://podcasts.apple.com/podcast/episode-29-asian-american-apostate/id1756133150?i=1000695896678",
        "youtube": "https://www.youtube.com/watch?v=DEL3w-vUYNU"
      }
    },
    {
      "id": "a294bfb1-240f-4683-b285-0bc458abf52c",
      "title": "Episode 28 | Online Cults",
      "description": "In this episode, Scott Loyd and Daniella Mesteneck Young engage in a deep conversation with Taylor Marie, a mental health therapist and cult survivor. Taylor shares her experiences with an online cult, discussing the similarities between online and in-person cults, the recruitment tactics used, and the psychological manipulation involved. The conversation explores the dynamics of charismatic leadership, the exploitation of belonging and purpose, and the red flags that led to Taylor\u0027s eventual departure from the cult. The discussion also touches on the importance of healthy leadership and the potential for spiritual practices to exist without devolving into cult-like behavior. In this conversation, Taylor Marie shares her harrowing experience of being involved in a cult-like astrology group, detailing the emotional turmoil and moral conflicts she faced. She discusses the manipulative tactics of the cult leader, the fear of leaving, and the subsequent backlash she received after her departure. The conversation highlights the importance of questioning authority and the role of social media in exposing harmful groups. Taylor\u0027s journey of self-discovery and the impact on her family dynamics are also explored, culminating in a powerful narrative of resilience and personal growth.\n Daniella\u0027s Links:\n  You can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured  For more info on me:  Patreon: https://bit.ly/YTPLanding  Cult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding  Get an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured  Get my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8  Daniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady  Instagram:  https://bit.ly/4ePAOFK / daniellamyoung_   Unamerican video book (on Patreon): https://bit.ly/YTVideoBook  Secret Practice video book (on Patreon): https://bit.ly/3ZswGY8  Other Podcasts\n Daniella\u0027s other podcast: Hey White Women\n Takeaways\n  Taylor Marie is a mental health therapist specializing in narcissistic abuse and cult recovery. Online cults operate similarly to in-person cults, with differences mainly in communication. Recruitment often occurs through social media platforms like TikTok, using charisma and confidence. The sense of belonging is a powerful tool used by cults to maintain control over members. Charismatic leaders often exploit followers\u0027 desires for purpose and belonging. Red flags include isolation from outside information and constant negative comparisons to others in the field. Healthy leadership promotes free thinking and allows for questioning and disagreement. Cults often take credit for the successes of their members, creating a cycle of dependency. Leaving a cult can feel like a crisis, as one\u0027s worldview is challenged and dismantled. It is possible to lead in spiritual practices without coercion or manipulation. The breaking point often comes when personal values clash with group beliefs. Questioning authority can lead to significant personal revelations. Leaving a cult can involve emotional and legal repercussions. Social media can amplify voices and expose harmful practices. The aftermath of leaving a cult can affect family relationships. Cult leaders often manipulate their followers through fear and guilt. It\u0027s important to recognize the signs of cult-like behavior in groups. Personal growth often follows the questioning of long-held beliefs. The experience of leaving a cult can be isolating and traumatic. Support from family and friends is crucial during the exit process.  Chapters\n 00:00 Introduction to Cults and Online Communities\n 01:32 Defining Online Cults\n 05:11 The Evolution of Relationships in the Digital Age\n 07:19 Recruitment Tactics in Online Cults\n 10:18 The Dynamics of Charismatic Leadership\n 12:21 The Exploitation of Belonging and Purpose\n 14:24 Red Flags and Realizations\n 21:55 Healthy Leadership vs. Cult Leadership\n 28:21 The Crisis of Leaving a Cult\n 28:46 The Breaking Point: Values and Morals in Conflict\n 31:24 Questioning Authority: The Cult Leader\u0027s Influence\n 34:04 The Cost of Leaving: Emotional and Legal Retaliation\n 43:53 Going Viral: The Power of Social Media in Exposing Cults\n 50:17 The Aftermath: Family Dynamics and Public Scrutiny\n  Produced by Haley Phillips",
      "release": "2025-02-18T13:00:00Z",
      "duration": "01:00:07",
      "explicit": false,
      "spotifyId": "4Q81iWeYlW2DO68GqrGngo",
      "appleId": 1000693501798,
      "youTubeId": "wSYqwpDQ4Cc",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Q81iWeYlW2DO68GqrGngo",
        "apple": "https://podcasts.apple.com/podcast/episode-28-online-cult/id1756133150?i=1000693501798",
        "youtube": "https://www.youtube.com/watch?v=wSYqwpDQ4Cc"
      }
    },
    {
      "id": "5bbc3abb-6987-431b-9386-feb7842200f9",
      "title": "Episode 27 | Childhood Torture vs Abuse",
      "description": "Content Warning: This episode includes descriptions of the abuse and torture of young children\n\nIn this episode of \u0027Cults and the Culting of America\u0027, hosts Scot Loyd and Daniella Mestyanek Young engage in a profound discussion with Ali Davis about the complexities of childhood torture, the distinction between abuse and torture, and the societal implications of these issues. They explore personal stories of survival, the role of the judicial system, and the cultural influences that perpetuate cycles of violence. The conversation emphasizes the importance of education, recognition of trauma, and the need for societal change to protect vulnerable populations, particularly children.\n\nConnect with Ali Davis\nWebsite: https://www.prettigraffiti.org/home\n\nHaley\u0027s Fundraiser\nClick Here to donate to Haley\u0027s Go Fund Me: https://gofund.me/2e365e87\n\nDaniella\u0027s Links:\nYou can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured\nFor more info on me:\nPatreon: https://bit.ly/YTPLanding\nCult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding\nGet an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured\nGet my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8\nDaniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady\nInstagram:  https://bit.ly/4ePAOFK / daniellamyoung_ \nUnamerican video book (on Patreon): https://bit.ly/YTVideoBook\nSecret Practice video book (on Patreon): https://bit.ly/3ZswGY8\n\n\nTakeaways\nConspiracies distract from real issues in society.\nTorture is a calculated act, unlike abuse.\nJudicial systems often fail to recognize torture.\nSurvivors of childhood torture face unique challenges.\nNaming trauma helps survivors heal.\nGenerational trauma affects parenting styles.\nCultural norms can perpetuate violence against children.\nEducation is crucial in breaking cycles of abuse.\nSurvivors of color face additional barriers.\nSociety must change its view on violence against children.\nChapters\n00:00 Introduction to the Conversation and Current Events\n 03:19 Understanding Conspiracies and Their Impact\n 06:21 Ali\u0027s Journey: From Survivor to Advocate\n 12:42 Defining Childhood Torture vs. Abuse\n 17:43 Personal Stories of Trauma and Healing\n 24:53 Steps Toward Healing and Advocacy\n 28:03 From Despair to Empowerment\n 29:23 Understanding Childhood Trauma\n 31:05 The Complexity of Abuse and Torture\n 33:59 Cultural Conditioning and Violence\n 39:57 The Military and Psychological Impact\n 40:55 The Ineffectiveness of Torture\n 45:24 The Culture of Violence in America\n 48:03 The Intersection of Race and Trauma\n 53:11 Breaking Generational Trauma\n 56:35 Creating New Paradigms for Parenting\nProduced by Haley Phillips",
      "release": "2025-02-11T13:00:00Z",
      "duration": "01:00:12",
      "explicit": false,
      "spotifyId": "48XiknA1s08CGHEtoolR5Z",
      "appleId": 1000691101804,
      "youTubeId": "rxb1RDng7v8",
      "subjects": [
        "Children Of God",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/48XiknA1s08CGHEtoolR5Z",
        "apple": "https://podcasts.apple.com/podcast/episode-27-childhood-torture-vs-abuse/id1756133150?i=1000691101804",
        "youtube": "https://www.youtube.com/watch?v=rxb1RDng7v8"
      }
    },
    {
      "id": "8fb45467-f1ea-43bc-bf2c-eb408e05a823",
      "title": "Episode 26 | Mediation and Marketing",
      "description": "In this episode of Cults and the Culting of America, host Scot Loyd and co-host Daniela Mesteneck Young engage in a deep conversation with Chloe Nwangwu, a brand scientist. They explore the concept of under recognition, the importance of branding in social influence, and the role of conflict mediation in understanding societal dynamics. Chloe shares her journey from conflict resolution to branding, emphasizing the significance of visibility and recognition in creating impactful change. The discussion also touches on the mythical norm, the dangers of echo chambers, and the necessity of diversity in combating misinformation. The episode concludes with insights into Chloe\u0027s methodology for building influence and the importance of acknowledging trauma in social movements.\n\nConnect with Chloé Nwangwu\nWebsite: https://www.nobiworks.com/\n\nDaniella\u0027s Links:\nYou can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured\nFor more info on me:\nPatreon: https://bit.ly/YTPLanding\nCult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding\nGet an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured\nGet my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8\nDaniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady\nInstagram:  https://bit.ly/4ePAOFK / daniellamyoung_ \nUnamerican video book (on Patreon): https://bit.ly/YTVideoBook\nSecret Practice video book (on Patreon): https://bit.ly/3ZswGY8\nOther Podcasts\nDaniella\u0027s other podcast: Hey White Women\nTakeaways\nChloe Nwangwu is known as the brand scientist.\nUnder recognition is a key issue in social dynamics.\nConflict mediation training informs Chloe\u0027s work.\nBrands influence how others perceive and treat individuals.\nThe science of resistance is crucial in today\u0027s society.\nMaintaining social norms is essential for safety.\nDiversity is vital in preventing echo chambers.\nUnder representation stems from under recognition.\nChloe\u0027s methodology focuses on visibility engineering.\nCreative projects can amplify important messages.\nChapters\n00:00 Introduction to Cults and Personal Journeys\n02:27 Understanding the Role of a Brand Scientist\n04:16 Conflict Mediation and Its Evolution\n10:30 The Power of Branding in Social Dynamics\n12:39 Defining Brands and Their Influence\n16:10 Resistance and the Science of Influence\n17:57 The Role of Representation in Social Change\n20:04 Maintaining Social Norms Amidst Change\n23:15 Building a Collective Resistance\n28:19 Listening to Marginalized Voices for Change\n29:35 The Need for Rest and Healing Among Black Women\n30:50 Understanding the Mythical Norm and Its Impact\n32:51 Behavior Change and Cult Dynamics\n35:08 Adoption Thresholds and Social Proof\n37:30 The Dangers of Ideal Client Avatars\n38:56 The Role of Diversity in Preventing Echo Chambers\n41:32 The Importance of Equity and Inclusion\n43:24 Under Recognition vs. Under Representation\n45:27 Visibility Engineering: Building Your Ecosystem of Influence\n51:59 Creative Expression and Cultural Commentary\nProduced by Haley Phillips",
      "release": "2025-02-04T16:02:00Z",
      "duration": "01:00:19",
      "explicit": false,
      "spotifyId": "0xPiAZ4wI92lnXja0ZIzRy",
      "appleId": 1000688957206,
      "youTubeId": "uYOWapCh1zk",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0xPiAZ4wI92lnXja0ZIzRy",
        "apple": "https://podcasts.apple.com/podcast/episode-26-mediation-and-marketing/id1756133150?i=1000688957206",
        "youtube": "https://www.youtube.com/watch?v=uYOWapCh1zk"
      }
    },
    {
      "id": "8159a647-baff-4a7b-ac39-0fe2fa54368d",
      "title": "Episode 25 | Post Traumatic Mistriss Syndrome with Amanda Gross",
      "description": "In this episode of Cults and the Culting of America, hosts Scot Loyd and Daniela Mestyanek Young engage in a profound conversation with Amanda Gross about the intersections of race, privilege, and healing. Amanda discusses her book, \u0027White Women Get Ready,\u0027 which explores the concept of Post-Traumatic Mistress Syndrome and the role of white women in anti-racist movements. The conversation delves into personal histories, the current climate of racism, the importance of community, and the challenges of navigating white privilege. They also touch on the impact of cancel culture and the role of arts in fostering healing and understanding. Throughout the discussion, the hosts emphasize the need for self-reflection, accountability, and the interconnectedness of liberation and healing.\n\nAmanda\u0027s Links: \n\nBook: White Women Get Ready \n\nRecommended paired reading: Post Traumatic Slave Syndrome by Dr. Joy Degruy\n\nIntagram: @MistressSyndrome\n\nTikTok: @MistressSyndrome \n\nPatreon: @MistressSyndromeBook\n\nDaniella\u0027s Links:\n\nYou can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured\nFor more info on me:\nPatreon: https://bit.ly/YTPLanding\nCult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding\nGet an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured\nGet my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8\nDaniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady\nInstagram:  https://bit.ly/4ePAOFK / daniellamyoung_ \nUnamerican video book (on Patreon): https://bit.ly/YTVideoBook\nSecret Practice video book (on Patreon): https://bit.ly/3ZswGY8\nOther Podcasts\n\nDaniella\u0027s other podcast: Hey White Women\n\nTakeaways\n\nWhite women have a crucial role in anti-racist work.\nHealing is essential for transformative change.\nUnderstanding personal history is key to addressing privilege.\nCommunity connection is vital for healing and support.\nCancel culture often replicates state violence and lacks relationality.\nPerfectionism can be a form of self-hatred and harm to others.\nThe arts can facilitate difficult conversations and healing.\nAccountability in relationships is necessary for growth.\nRacism and white supremacy harm everyone, including white people.\nLiberation is interconnected and requires collective effort.\nChapters\n\n00:00 Introduction to Cults and Anti-Racism\n03:26 Understanding Post-Traumatic Mistress Syndrome\n06:19 The Importance of Healing in Anti-Racist Work\n09:26 Personal Histories and Their Impact on Activism\n12:31 The Current Climate of White Supremacy\n15:21 Surprising Discoveries in Personal Ancestry\n18:27 The Role of Storytelling in Healing\n21:22 The Disconnect of Whiteness and Community\n24:37 Backlash Against Diversity and Equity Initiatives\n30:20 The Power of Perspective: Learning from Black Women\n32:17 Community and Spirituality: Resilience Among Black Women\n33:14 Navigating Conversations: White Privilege and Listening\n34:56 Courage in Relationships: Honesty and Emotional Safety\n38:36 Shame and Growth: Deconstructing Cult Mentalities\n40:36 Cancel Culture: Trauma, Accountability, and Community\n43:19 Performative Regulation: The Dangers of Policing Each Other\n45:31 Intent vs. Impact: The Importance of Acknowledgment\n47:43 Building Community: The Role of White Women\u0027s Affinity Spaces\n51:58 Art as a Medium: Conflict, Healing, and Connection\n\nProduced by Haley Phillips",
      "release": "2025-01-28T13:00:00Z",
      "duration": "00:58:44",
      "explicit": false,
      "spotifyId": "5URTp5F4eNityD3WqEFKZs",
      "appleId": 1000686240185,
      "youTubeId": "7PBgkEVHg1E",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5URTp5F4eNityD3WqEFKZs",
        "apple": "https://podcasts.apple.com/podcast/episode-25-post-traumatic-mistriss-syndrome-with/id1756133150?i=1000686240185",
        "youtube": "https://www.youtube.com/watch?v=7PBgkEVHg1E"
      }
    },
    {
      "id": "ec29f40a-fd65-4933-b5be-535a915eaf0e",
      "title": "Episode 24 | IBLP and \u0022Shiny, Happy People\u0022",
      "description": "In this episode of Cults and the Culting of America, hosts Scot Loyd and Daniella Mestyanek Young engage with Tara and Floyd, who share their experiences growing up in the Institute in Basic Life Principles (IBLP) and the Advanced Training Institute (ATI). They discuss the complexities of deconstruction from fundamentalist beliefs, the emotional toll of leaving a cult, and the impact on family relationships. The conversation also touches on the importance of emotional awareness in parenting and the healing journey after leaving high-control groups. Tara and Floyd reflect on their participation in the documentary \u0027Shiny Happy People\u0027 and the challenges they faced in sharing their story.\n\nTara and Floyd:\n\nInstagram: @advocateaverage\n\ntiktok: @advocateaverage\n\nDaniella\u0027s Links:\n\nYou can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured\nFor more info on me:\nPatreon: https://bit.ly/YTPLanding\nCult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding\nGet an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured\nGet my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8\nDaniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady\nInstagram:  https://bit.ly/4ePAOFK / daniellamyoung_ \nUnamerican video book (on Patreon): https://bit.ly/YTVideoBook\nSecret Practice video book (on Patreon): https://bit.ly/3ZswGY8\nOther Podcasts\n\nDaniella\u0027s other podcast: Hey White Women\n\nTakeaways\n\nDeconstruction is a personal journey that varies for each individual.\nCults often use contracts and strict rules to control members\u0027 lives.\nThe emotional cost of leaving a cult can be profound, affecting family relationships.\nParenting styles can be influenced by past experiences in cults.\nFinding peace and healing is possible after leaving a high-control group.\nThe process of deconstruction can lead to a deeper understanding of oneself.\nCults often exploit labor and manipulate finances for their benefit.\nSharing one\u0027s story can be a powerful tool for healing and connection.\nThe importance of emotional awareness in parenting cannot be overstated.\nCults can be seen as criminal enterprises that exploit their members. \nChapters\n\n00:00 Introduction to the Journey of Deconstruction\n01:33 Understanding IBLP and ATI\n05:45 The Cult Debate: Is IBLP a Cult?\n12:11 Navigating Different Deconstruction Timelines\n18:27 The Impact of Parenting on Deconstruction\n23:46 Sobriety and the Numbing Process\n28:31 Emotional Suppression in Cults\n31:11 The Birth of a Musical Concept\n32:14 Living with the Pain of Loss\n34:50 Navigating Family Relationships Post-Cult\n37:18 The Complexity of Conditional Love\n40:13 The Struggle of Acceptance and Identity\n43:12 The Irony of Family Dynamics\n46:22 Addiction to Certainty and Superiority\n49:15 Finding Peace in Acceptance\n53:05 The Journey of Healing and Advocacy\n\nProduced by Haley Phillips",
      "release": "2025-01-21T13:00:00Z",
      "duration": "00:57:47",
      "explicit": false,
      "spotifyId": "5VQ23ZVJn0W8fWMDpD31tJ",
      "appleId": 1000684845311,
      "youTubeId": "QHy_QHtpfCA",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5VQ23ZVJn0W8fWMDpD31tJ",
        "apple": "https://podcasts.apple.com/podcast/episode-24-iblp-and-shiny-happy-people/id1756133150?i=1000684845311",
        "youtube": "https://www.youtube.com/watch?v=QHy_QHtpfCA"
      }
    },
    {
      "id": "e2177c7d-3c55-4b91-a481-dd05a7283246",
      "title": "Episode 23 | Tia Levings Author of \u0022A Well Trained Wife\u0022",
      "description": "In this episode of Cults and the Culting of America, hosts Scot Loyd and Daniella engage with Tia Levings, a New York Times bestselling author and cult survivor. They discuss Tia\u0027s journey of writing her memoir, the impact of Christian patriarchy, and the allure of traditionalism in modern society. Tia shares her insights on the dynamics of complementarianism, the consequences of perfectionism, and the importance of storytelling in healing. The conversation emphasizes the need for awareness and empowerment among those affected by high-control groups, while also exploring the complexities of societal change and the role of women in shaping the future.\n\nTia\u0027s Links\n\nhttps://tialevings.com/\n\nhttps://tialevings.substack.com/\n\nInstagram @tialevingswriter\n\nThreads @tialevingswriter\n\nTikTok @tialevingswriter\n\nDaniella\u0027s Links:\n\nYou can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured\nFor more info on me:\nPatreon: https://bit.ly/YTPLanding\nCult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding\nGet an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured\nGet my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8\nDaniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady\nInstagram:  https://bit.ly/4ePAOFK / daniellamyoung_ \nUnamerican video book (on Patreon): https://bit.ly/YTVideoBook\nSecret Practice video book (on Patreon): https://bit.ly/3ZswGY8\nOther Podcasts\n\nDaniella\u0027s other podcast: Hey White Women\n\nTakeaways\n\nTia\u0027s book started as therapeutic journals recommended by her therapist.\nThe journey to writing a memoir can take years and evolve over time.\nChristian patriarchy influences many aspects of American culture.\nThe concept of a \u0027cult without walls\u0027 highlights the pervasive nature of these deologies.\nTraditionalism can appear attractive but often masks deeper issues.\nPerfectionism is a significant burden for survivors of cults.\nThe most vulnerable individuals often bear the brunt of abuse in high-control groups.\nHope and empowerment are crucial in the face of societal chaos.\nPeople should always come before ideas in any belief system.\nBitterness can serve as a powerful tool for healing and empowerment. \nSound Bites\n\n\u0022Welcome to 2025: A New Beginning\u0022\n\u0022It took years to tell my story\u0022\n\u0022Hope is stubborn and necessary\u0022\n\nChapters\n\n00:00 Introduction and Context of 2025\n03:39 The Journey to Writing a Memoir\n06:25 The Impact of Christian Patriarchy\n09:30 The Connection Between Personal Experience and Cultural Issues\n12:25 The Allure of Traditional Gender Roles\n15:27 Nostalgia and Misconceptions of the Past\n18:15 Facing the Truth of Domestic Discipline\n21:30 The Importance of Sharing Stories\n24:14 The Dynamics of Complementarianism\n27:14 Recognizing Abuse and Empowering Individuals\n31:20 Breaking Free from Perfectionism\n33:39 Childhood Vulnerability in Cults\n35:53 The Future of Cults and Youth Movements\n37:18 Chaos and Fundamentalism\n38:02 Narcissism and Cult Leadership\n39:29 Women’s Empowerment and Resistance\n40:27 Surviving Authoritarianism\n41:53 The Power of Storytelling\n43:16 Bitterness as Empowerment\n52:59 People Over Ideas: A Fundamental Principle\n\nProduced by Haley Phillips",
      "release": "2025-01-14T15:04:00Z",
      "duration": "00:57:05",
      "explicit": false,
      "spotifyId": "1t62dgZ8gBsWBMk3kylTxh",
      "appleId": 1000683946244,
      "youTubeId": "vlOVEaH6kHI",
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1t62dgZ8gBsWBMk3kylTxh",
        "apple": "https://podcasts.apple.com/podcast/episode-23-tia-levings-author-of-a-well-trained-wife/id1756133150?i=1000683946244",
        "youtube": "https://www.youtube.com/watch?v=vlOVEaH6kHI"
      }
    },
    {
      "id": "230e9c3d-9953-42c5-ad29-36f167e6d1ce",
      "title": "Episode 22 | Teaching and Public Education",
      "description": "In this conversation, Daniella and Jack explore the parallels between cult dynamics and the education system, particularly focusing on how teaching can exhibit cult-like characteristics. They discuss the impact of masculinity, patriarchy, and the control of children within educational settings. The conversation delves into the degradation ceremonies present in both cults and schools, the role of punishment in hierarchical systems, and the importance of unstructured outdoor time for child development. They also address the exploitation of teachers\u0027 labor, the purpose of education in society, and the need for resistance against oppressive structures. Ultimately, they emphasize the importance of community action and hope for a better future.\n\nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\nDaniella’s Tiktok: https://www.tiktok.com/@knittingcultlady?lang=enYoutube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg\nInstagram: https://www.instagram.com/stories/daniellamyoung_/\nUnamerican Videobook: https://tr.ee/ODM-qtUJaR\nSecret Practice Videobook: https://tr.ee/DGEY3IeQQm\n\nConnect with Scot Loyd\u0027s social media :https://www.tiktok.com/@thescotloyd",
      "release": "2025-01-07T13:00:00Z",
      "duration": "01:10:57.6660000",
      "explicit": false,
      "spotifyId": "1GxoR28Ho3lcR4AJd75WLZ",
      "appleId": 1000683018676,
      "youTubeId": "rx6pCDp8eRM",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1GxoR28Ho3lcR4AJd75WLZ",
        "apple": "https://podcasts.apple.com/podcast/episode-22-teaching-and-public-education/id1756133150?i=1000683018676",
        "youtube": "https://www.youtube.com/watch?v=rx6pCDp8eRM"
      }
    },
    {
      "id": "0ec4e3d0-db88-4afb-900c-39197ed85a72",
      "title": "Episode 21 | Spiritual Abuse and Single Family Cults",
      "description": "In this episode, Dr. Jamie Marich discusses her experiences with spiritual abuse and the dynamics of cults, emphasizing the importance of understanding these issues in therapy. She shares her personal journey of growing up in a high-demand religious environment, the impact of family dynamics, and her path to recovery from addiction. The conversation highlights the significance of storytelling and community support in healing, as well as the role of writing as a therapeutic tool. Dr. Marich also addresses the challenges faced by individuals leaving cult-like environments and the need for mental health professionals to recognize and address spiritual abuse. Daniella\u0027s Links: You can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured For more info on me: Patreon: https://bit.ly/YTPLanding Cult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding Get an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured Get my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8 Daniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady Instagram: https://bit.ly/4ePAOFK / daniellamyoung_ Unamerican video book (on Patreon): https://bit.ly/YTVideoBook Secret Practice video book (on Patreon): https://bit.ly/3ZswGY8 Scot\u0027s Links Connect with Scot Loyd\u0027s social media ( TikTok ) Other Podcasts Daniella\u0027s other podcast: Hey White Women Takeaways Spiritual abuse is often overlooked in therapy. Cults use religion as a tool for control. Personal experiences can inform professional practice. Storytelling is a powerful healing tool. Community support is crucial for recovery. Addiction can stem from unprocessed trauma. High-demand religions can create toxic family dynamics. Writing can be a form of spiritual practice. Understanding cult dynamics helps in healing. There is a growing movement against high-demand religions. Chapters 00:00 Introduction to Spiritual Insights 06:16 Understanding Cult Dynamics 12:30 The Impact of High-Control Groups 18:19 The Intersection of Religion and Mental Health 24:24 Finding Healing Through Connection 30:26 Concluding Thoughts on Healing and Growth 35:30 Navigating Academia and High Control Environments 44:35 Memoir as a Tool for Healing 53:06 Building Community and Resources for Healing",
      "release": "2024-12-17T13:00:00Z",
      "duration": "01:01:04.5410000",
      "explicit": true,
      "spotifyId": "64TGgKsddvRa74PIo3AOSu",
      "appleId": 1000680692536,
      "youTubeId": "R6z8u-SxtE4",
      "subjects": [
        "Family Cult",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64TGgKsddvRa74PIo3AOSu",
        "apple": "https://podcasts.apple.com/podcast/episode-21-spiritual-abuse-and-single-family-cults/id1756133150?i=1000680692536",
        "youtube": "https://www.youtube.com/watch?v=R6z8u-SxtE4"
      }
    },
    {
      "id": "471e71ae-d69c-446e-afea-e3ad4291e72d",
      "title": "Episode 20 | Recovering from Purity Culture",
      "description": "In this conversation, Maddie Jo Cowsert shares her journey from growing up in evangelical purity culture to navigating her identity and sexuality in New York City. She discusses the complexities of deconstruction, the impact of family support, and her reflections on wealth and the behavior of rich people. The dialogue highlights the shared experiences of those who have left high-control groups and the ongoing search for belonging and purpose. \n\nFor Youtube \nAutographed book: https://uncultureyourself.com/pages/uncultured-autographed\nFrom Bookshop.org: https://bookshop.org/a/104058/9781250280114\nDaniella’s Patreon: https://www.patreon.com/GroupBehaviorGal\nDaniella’s Tiktok: https://www.tiktok.com/@knittingcultlady?lang=enYoutube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg\nInstagram: https://www.instagram.com/stories/daniellamyoung_/\nUnamerican Videobook: https://tr.ee/ODM-qtUJaR\nSecret Practice Videobook: https://tr.ee/DGEY3IeQQm\nConnect with Scot Loyd\u0027s social media :https://www.tiktok.com/@thescotloyd",
      "release": "2024-12-10T13:59:00Z",
      "duration": "01:04:32",
      "explicit": false,
      "spotifyId": "4GYaHbjzIiofpiDmEbKm3G",
      "appleId": 1000679889517,
      "youTubeId": "9Z9fwGhoiDw",
      "subjects": [
        "Purity Culture",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4GYaHbjzIiofpiDmEbKm3G",
        "apple": "https://podcasts.apple.com/podcast/episode-20-recovering-from-purity-culture/id1756133150?i=1000679889517",
        "youtube": "https://www.youtube.com/watch?v=9Z9fwGhoiDw"
      }
    },
    {
      "id": "9c88aa43-0c72-443d-9dcd-a50130fb0153",
      "title": "Episode 19 | Hasidic Judaism",
      "description": "In this episode of Cults and the Culting of America, Beatrice Weber shares her profound journey growing up in the Hasidic community, detailing the strict beliefs and practices that shaped her life. She discusses the impact of historical trauma on her community, the role of women, and her experiences with arranged marriage. Beatrice reflects on her decision to leave the community after years of confusion and struggle, and she now focuses on education reform for Jewish children. Her story is one of resilience, courage, and the ongoing quest for personal freedom and identity. Daniella\u0027s Links: You can read all about my story in my book, Uncultured-- buy signed copies here. https://bit.ly/SignedUncultured For more info on me: Patreon: https://bit.ly/YTPLanding Cult book Clubs (Advanced AND Memoirs) Annual Membership: https://bit.ly/YTPLanding Get an autographed copy of my book, Uncultured: https://bit.ly/SignedUncultured Get my book, Uncultured, from Bookshop.org: https://bit.ly/4g1Ufw8 Daniella’s Tiktok: https://bit.ly/3V6GK6k / KnittingCultLady Instagram: https://bit.ly/4ePAOFK / daniellamyoung_ Unamerican video book (on Patreon): https://bit.ly/YTVideoBook Secret Practice video book (on Patreon): https://bit.ly/3ZswGY8 Scot\u0027s Links Connect with Scot Loyd\u0027s social media ( TikTok ) Other Podcasts Daniella\u0027s other podcast: Hey White Women Takeaways Beatrice grew up in a high control group within the Hasidic community. Understanding cult dynamics helped Beatrice process her experiences. The Hasidic community has strict rules around gender roles and education. Historical trauma from the Holocaust influences the community\u0027s isolationist mindset. Women in the Hasidic community often feel like property in arranged marriages. Beatrice\u0027s marriage was abusive, leading her to seek therapy and support. Leaving the community was a complex decision, influenced by her children\u0027s well-being. Beatrice is now involved in education reform for Hasidic children. She emphasizes the importance of choice and individuality in her new life. Beatrice maintains a connection to her cultural roots while rejecting fundamentalism. Chapters 00:00 Introduction to the Podcast and Guest 06:19 Understanding High Control Groups 15:59 Education and Control in the Hasidic Community 25:06 The First Night and Wedding Rituals 31:09 The Impact of Ceremonial Control 36:26 Navigating Marriage and Sexuality in Isolation 41:55 The Journey to Leaving an Abusive Marriage 47:23 Life After Leaving: Finding Purpose and Healing 55:05 Reconnecting with Faith and Spirituality Produced by Haley Phillips",
      "release": "2024-12-03T19:24:00Z",
      "duration": "00:59:53.7910000",
      "explicit": true,
      "spotifyId": "4y83wW2gB1iDmYLE65HNEH",
      "appleId": 1000679114387,
      "youTubeId": "kpHXFePFYHE",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4y83wW2gB1iDmYLE65HNEH",
        "apple": "https://podcasts.apple.com/podcast/episode-19-hasidic-judaism/id1756133150?i=1000679114387",
        "youtube": "https://www.youtube.com/watch?v=kpHXFePFYHE"
      }
    },
    {
      "id": "16b56c30-7d54-4802-b32d-b67970c5e5be",
      "title": "Episode 18 | 1 to 1 cults (Narcissistic Abuse)",
      "description": "In this conversation, Dr. Kerry McAvoy discusses her experiences with narcissistic abuse, the psychological implications of narcissism, and the societal impact of charismatic leaders. The discussion delves into the dynamics of cult-like behavior in politics, the challenges of cognitive dissonance, and the importance of personal identity and healing from toxic relationships. Dr. McAvoy shares insights on the spectrum of narcissism, the significance of vulnerability, and offers resources for those seeking to recover from abusive situations. Daniella Mestyanek Young\u0027s book: From Bookshop.org Uncultured Autograph: Connect with Daniella on social media TikTok , Patreon , Instagram Youtube Connect with Scot Loyd\u0027s social media ( TikTok ) Daniella\u0027s other podcast: Hey White Women Takeaways Narcissism can manifest in various forms, including in political leadership. Cognitive dissonance plays a significant role in justifying unhealthy relationships. Healing from toxic relationships requires self-discovery and understanding personal identity. Vulnerability is essential for authentic connections and relationships. Cults often exploit human desires for belonging and acceptance. The importance of setting boundaries in relationships cannot be overstated. Self-reflection is crucial in recognizing narcissistic traits within oneself. Healing is a process that involves learning to express emotions and needs. Understanding the dynamics of narcissism can help in recognizing abusive patterns. Resources such as podcasts and workbooks can aid in recovery from narcissistic abuse. Chapters 00:00 Introduction and Context of the Conversation 06:13 Personal Experiences with Narcissism 17:00 Cognitive Dissonance and Justification 23:06 Narcissism as a Spectrum 29:14 Transactional Relationships and Echoism 36:49 The Illusion of Uniqueness in Cults 45:31 Overcoming Emotional Numbness and Building Boundaries 51:16 Learning to Coexist: Embracing Differences 56:16 Resources for Healing and Recovery Produced by: Haley Phillips",
      "release": "2024-11-26T13:00:00Z",
      "duration": "00:28:21.6430000",
      "explicit": true,
      "spotifyId": "7pRK2AzQS8jfKInzLZmc23",
      "appleId": 1000678285226,
      "youTubeId": "qIJ5iP9nJig",
      "subjects": [
        "One-on-one",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7pRK2AzQS8jfKInzLZmc23",
        "apple": "https://podcasts.apple.com/podcast/episode-18-1-to-1-cults-narcassistic-abuse/id1756133150?i=1000678285226",
        "youtube": "https://www.youtube.com/watch?v=qIJ5iP9nJig"
      }
    },
    {
      "id": "76c05407-352b-4a7a-8cdd-56d23c396e19",
      "title": "Episode 17: Is Alcoholics Anonymous Culty?!?!",
      "description": "Summary\n In this conversation, the hosts and guest explore the dynamics of cults, particularly focusing on Alcoholics Anonymous (AA) and its 12-step program. They discuss the coercive nature of these programs, the sacred status of AA, and the psychological impacts on individuals involved. The conversation highlights the importance of recognizing the tactics used by cults, the role of shame and judgment, and the need for personal responsibility and accountability. The emotional toll of leaving such programs and the significance of language in shaping identity and recovery are also examined. In this conversation, the speakers delve into the complexities of recovery from addiction, discussing the various systems in place, including Alcoholics Anonymous and Christian recovery houses. They explore the intentions behind these systems, the potential for abuse, and the importance of understanding one\u0027s options. The discussion emphasizes the need for empowerment and autonomy in recovery, highlighting alternative methods and the significance of informed choices.\n Daniella Mestyanek Young\u0027s book: \n   From Bookshop.org\n     Uncultured Autograph: \n   Connect with Daniella on social media \n   TikTok, Patreon, Instagram \n   Youtube\n     Connect with Scot Loyd\u0027s social media  (TikTok)\n   Daniella\u0027s other podcast: Hey White Women",
      "release": "2024-11-19T18:26:00Z",
      "duration": "01:11:50",
      "explicit": false,
      "spotifyId": "0rWkv2fPqbpafx8fDvOl2F",
      "appleId": 1000677512698,
      "youTubeId": "zvcV83Yjl4s",
      "subjects": [
        "Alcoholics Anonymous"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rWkv2fPqbpafx8fDvOl2F",
        "apple": "https://podcasts.apple.com/podcast/episode-17-is-alcoholics-anonymous-culty/id1756133150?i=1000677512698",
        "youtube": "https://www.youtube.com/watch?v=zvcV83Yjl4s"
      }
    },
    {
      "id": "8671bd14-57e9-4519-afab-bf83e1c4fde9",
      "title": "Episode 16: Voices Unbound--Cults, White Supremacy, and the Silencing of Women",
      "description": "Summary\n In this episode, Scot Loyd, Daniella Mestyneck Young, and Ali Henney discuss the intersections of cult dynamics, white supremacy, and the silencing of women, particularly black women. They explore personal experiences within cults, the impact of group behavior, and the role of narcissism in community spaces. The conversation also delves into the concept of misogynoir and the unique challenges faced by black women in various contexts. The importance of using one\u0027s voice to advocate for justice and the complexities of identity and intersectionality are emphasized throughout the discussion.\n Takeaways\n Ali\u0027s book \u0027I Won\u0027t Shut Up\u0027 explores personal experiences and broader themes of racism.\n Cults often silence women and weaponize secrecy.\n White supremacy operates similarly to cult dynamics.\n Group behavior can be amplified in cult settings.\n Narcissists often infiltrate communities seeking vulnerable individuals.\n Religious groups can be breeding grounds for manipulative behavior.\n Misogynoir uniquely affects black women in various spaces.\n The \u0027skinny white woman\u0027 trope serves as a gatekeeper in many contexts.\n Understanding intersectionality is crucial for advocacy.\n Using one\u0027s voice is essential in combating injustice.\n  \n Daniella Mestyanek Young\u0027s book: \n   From Bookshop.org\n     Uncultured Autograph: \n   Connect with Daniella on social media \n   TikTok, Patreon, Instagram \n   Youtube\n     Connect with Scot Loyd\u0027s social media  (TikTok)\n   Daniella\u0027s other podcast: Hey White Women",
      "release": "2024-11-12T15:24:00Z",
      "duration": "01:01:56",
      "explicit": false,
      "spotifyId": "0T2f0kLZblYweGgyURWx26",
      "appleId": 1000676670958,
      "youTubeId": "nMy1WBChkac",
      "subjects": [
        "Psychology",
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0T2f0kLZblYweGgyURWx26",
        "apple": "https://podcasts.apple.com/podcast/episode-16-voices-unbound-cults-white-supremacy-and/id1756133150?i=1000676670958",
        "youtube": "https://www.youtube.com/watch?v=nMy1WBChkac"
      }
    },
    {
      "id": "87c6a729-cef0-4f20-96a7-d3a40d44ccb1",
      "title": "Episode 15: Leaving the Cult of MAGA",
      "description": "Summary\n In this conversation, Scott Loyd and Daniella engage with Haley Griffith, who shares her transformative journey from supporting Donald Trump to embracing liberal values. The discussion delves into the psychological aspects of political allegiance, the complexities surrounding issues like abortion, and the dynamics of cult-like behavior in political movements. Haley reflects on her experiences, the influence of friendships, and the gradual realization of the need for nuanced perspectives in political discourse. In this conversation, the speakers discuss the complexities of voting, particularly in relation to marginalized communities and the binary nature of American politics. They explore the importance of humanizing those with differing political views, reflecting on events like January 6th and the need for compassion in political discourse. The discussion also touches on the potential for change in Texas and the cult-like dynamics of the two-party system, emphasizing the need for a pluralistic society that respects diverse beliefs.\n Daniella Mestyanek Young\u0027s book: \n   From Bookshop.org\n     Uncultured Autograph: \n   Connect with Daniella on social media \n   TikTok, Patreon, Instagram \n   Youtube\n     Connect with Scot Loyd\u0027s social media  (TikTok)\n   Daniella\u0027s other podcast: Hey White Women",
      "release": "2024-10-29T16:29:00Z",
      "duration": "01:00:35",
      "explicit": false,
      "spotifyId": "5vnE1aWPMGIziQ9wsRhY8B",
      "appleId": 1000674890669,
      "youTubeId": "qIzqD5j9ORo",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5vnE1aWPMGIziQ9wsRhY8B",
        "apple": "https://podcasts.apple.com/podcast/episode-15-leaving-the-cult-of-maga/id1756133150?i=1000674890669",
        "youtube": "https://www.youtube.com/watch?v=qIzqD5j9ORo"
      }
    },
    {
      "id": "192cbe32-7133-4a46-9452-9988c5349cd5",
      "title": "Episode 14: Good Cult, Bad Cult",
      "description": "Summary\n In this conversation, Scot Loyd and Daniella (KnittingCultLady) delve into the complexities of group dynamics, particularly focusing on the duality of groups as both beneficial and potentially harmful. They explore the societal fascination with cults, the nuances of labeling groups as \u0027good\u0027 or \u0027bad\u0027, and the inherent human need for belonging. Daniella shares insights from her experiences and research, emphasizing the importance of questioning group structures and the potential for exploitation within them. The discussion culminates in a list of ten commandments for creating healthy, functional groups that prioritize individual well-being over blind allegiance.\n   From Bookshop.org\n     Uncultured Autograph: \n   Connect with Daniella on social media \n   TikTok, Patreon, Instagram \n   Youtube\n     Connect with Scot Loyd\u0027s social media  (TikTok)\n   Daniella\u0027s other podcast: Hey White Women",
      "release": "2024-10-22T18:46:00Z",
      "duration": "01:02:52",
      "explicit": false,
      "spotifyId": "6D28yjSP0luLBwGQNWOlrk",
      "appleId": 1000674045780,
      "youTubeId": "BMSf6QuSOZw",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6D28yjSP0luLBwGQNWOlrk",
        "apple": "https://podcasts.apple.com/podcast/episode-14-good-cult-bad-cult/id1756133150?i=1000674045780",
        "youtube": "https://www.youtube.com/watch?v=BMSf6QuSOZw"
      }
    },
    {
      "id": "1cb3dae7-eaac-4cf3-be83-a33e00a7d66c",
      "title": "Episode 13: The Ends Justifies the Means",
      "description": "Summary In this episode, Scott Loyd and Daniela Mestenec Young explore the complex dynamics of cult mentality, particularly focusing on the phrase \u0027the ends justify the means.\u0027 They discuss how this mentality manifests in various contexts, including military practices, religious cults, and societal norms. The conversation delves into the psychological manipulation involved in these systems, the dangers of binary thinking, and the importance of embracing uncertainty in life. Through personal anecdotes and broader cultural analysis, they highlight the need for critical thinking and the dangers of extremism.",
      "release": "2024-10-15T15:51:00Z",
      "duration": "01:05:14.5010000",
      "explicit": false,
      "spotifyId": "1fxGoSxR4b0cWSW97JKZQf",
      "appleId": 1000673190748,
      "youTubeId": "VKVtxPWyXL0",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1fxGoSxR4b0cWSW97JKZQf",
        "apple": "https://podcasts.apple.com/podcast/episode-13-the-ends-justifies-the-means/id1756133150?i=1000673190748",
        "youtube": "https://www.youtube.com/watch?v=VKVtxPWyXL0"
      }
    },
    {
      "id": "5a017801-ce09-4a86-a91b-7052369b27f9",
      "title": "Episode 12: Breaking Free: The Emotional, Financial, and Psychological Costs of Leaving a Cult",
      "description": "The conversation explores the concept of exit costs in cults, focusing on the United Pentecostal Church International and the Children of God. It discusses the high entrance costs, such as strict dress codes and behavioral expectations, and the financial costs of giving to the church. The conversation also delves into the psychological and emotional damage caused by cults, including the disengagement from skepticism and the fear of eternal damnation. The exit costs of leaving a cult are examined, including the loss of faith and the difficulty of rebuilding a new framework. The conversation concludes with a discussion on the lasting impacts of cults, such as social anxiety and the fear of judgment. In this conversation, Daniella and Scot discuss the mischaracterization of criticism and the all-or-nothing mentality within cults. They explore the concept of cognitive dissonance and how it plays into entrance and exit costs. They also examine the historical patterns of cults and the dangers of not deconstructing harmful ideologies. The conversation emphasizes the importance of deconstruction and the potential for finding joy and happiness on the other side.",
      "release": "2024-10-01T20:32:00Z",
      "duration": "01:01:17",
      "explicit": false,
      "spotifyId": "3LEAYzueT4zttTrg5hqhI7",
      "appleId": 1000671466528,
      "youTubeId": "Ba1T7SYGZ4I",
      "subjects": [
        "Cult Recovery",
        "Children Of God",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3LEAYzueT4zttTrg5hqhI7?si=Yxyu3rxaQF6LqqgylCigmw",
        "apple": "https://podcasts.apple.com/us/podcast/episode-12-breaking-free-the-emotional-financial/id1756133150?i=1000671466528",
        "youtube": "https://www.youtube.com/watch?v=Ba1T7SYGZ4I"
      }
    },
    {
      "id": "647a0792-ef05-46bd-aaf8-8a0014870855",
      "title": "Episode 11: Free Will or Control? Film Director on Cults, \u0027Holy Water,\u0027 and the Battle for Authenticity",
      "description": "Summary\n Lucas Moctezuma discusses his upcoming film \u0027Holy Water\u0027 which is inspired by cults and explores the concept of free will within a cult setting. The film is set in a jury room where the jury deliberates the guilt of a religious cult leader who incited a mass suicide. The jury debates whether the cult members had free will or if they were controlled and manipulated by the cult leader. The film also delves into the psychological perils faced by cult survivors and the concept of doctrine over person. Lucas shares that the film is influenced by his mother\u0027s experience in a religious community in the 1970s. The conversation explores the challenges of depicting cults in film and the balance between sensationalism and authenticity. They discuss the importance of finding a balance that resonates with both regular audiences and actual cult survivors. They also touch on the difficulty of helping someone leave a cult and the need for compassion and understanding. The conversation concludes with a discussion about the filmmaker\u0027s GoFundMe campaign to support the production of the movie.",
      "release": "2024-09-24T13:58:00Z",
      "duration": "00:44:51",
      "explicit": false,
      "spotifyId": "6tIu6mqy7ghWGNd6mE1HOp",
      "appleId": 1000670535028,
      "youTubeId": "JuvvLFBew8o",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6tIu6mqy7ghWGNd6mE1HOp",
        "apple": "https://podcasts.apple.com/us/podcast/episode-11-free-will-or-control-film-director-on-cults/id1756133150?i=1000670535028",
        "youtube": "https://www.youtube.com/watch?v=JuvvLFBew8o"
      }
    },
    {
      "id": "b5ac8a21-12ef-4ffd-a3b4-dcb697c1c5e9",
      "title": "Episode 10: Nobody Wants to Work Hard Anymore (Exploitation of Labor)",
      "description": "Summary The conversation explores the exploitation of labor in cults and its impact on individuals. It delves into the reasons why labor is at the center of cults, including the pursuit of power, financial gain, and the whitewashing of cult activities. The discussion also highlights the role of labor in high control religious groups and the manipulation of children to represent the group\u0027s ideals. The conversation expands to include the exploitation of labor in corporations and the systemic nature of labor exploitation in the United States. It concludes by examining the long-lasting effects of labor exploitation on individuals\u0027 mental and physical health. In this conversation, Daniella and Scot discuss the exploitation of labor and the pressure to constantly work. They explore how cults and other high-control groups use labor as a means of control and how this mindset is perpetuated in society. They also touch on the importance of self-care and the need to break free from the transactional nature of relationships. The conversation highlights the negative consequences of constant labor and the importance of setting healthy boundaries. Daniella Mestyanek Young\u0027s book: From Bookshop.org Uncultured Autograph: Connect with Daniella on social media TikTok , Patreon , Instagram Youtube Connect with Scot Loyd\u0027s social media ( TikTok ) Daniella\u0027s other podcast: Hey White Women Takeaways Cults often exploit labor as a means of gaining power and financial resources. Children are particularly vulnerable to labor exploitation in cults and high control religious groups. Labor exploitation is not limited to religious organizations and can also occur in corporations. The systemic exploitation of labor has long-lasting effects on individuals\u0027 mental and physical health. Cults and high-control groups use labor as a means of control and exploitation. Society perpetuates the idea that constant work and productivity are necessary for success. Self-care and setting healthy boundaries are essential for mental and emotional well-being. The transactional nature of relationships can lead to disappointment and dissatisfaction. The pressure to constantly work and achieve can result in burnout and negative health consequences.",
      "release": "2024-09-17T16:09:00Z",
      "duration": "01:01:30.3960000",
      "explicit": true,
      "spotifyId": "1acVVcAKrZASS9up1UFqNY",
      "appleId": 1000669840513,
      "youTubeId": "Ir_xwiTj4v8",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1acVVcAKrZASS9up1UFqNY",
        "apple": "https://podcasts.apple.com/us/podcast/episode-10-nobody-wants-to-work-hard-anymore-exploitation/id1756133150?i=1000669840513",
        "youtube": "https://www.youtube.com/watch?v=Ir_xwiTj4v8"
      }
    },
    {
      "id": "63f5e440-12f6-46c0-8a5c-d1020bf4e2ae",
      "title": "Episode 9: We Are the Best, Down with All the Rest (Us versus Them Mentality",
      "description": "Summary In this conversation, Daniella and Scot discuss various topics including Daniella\u0027s recent trip to Portugal, the us versus them mentality, and the experience of visiting a nude beach. They explore the influence of group norms and how they shape our behavior and perceptions. They also touch on the binary thinking prevalent in American culture and the need for more nuance. The conversation highlights the importance of representation and diversity in leadership roles and challenges the traditional gender roles and expectations. The conversation explores the themes of us versus them mentality, appearance control, and the use of familial language in high control groups. It delves into the experiences of women in the military and the challenges they face in fitting in and being accepted. The conversation also touches on the topic of trans identity and the misconception that it is a cult. The importance of understanding and respecting individual identities and experiences is emphasized. The conversation concludes with a discussion on the dangers of us versus them mentality and the need for open-mindedness and acceptance. Daniella Mestyanek Young\u0027s book: · From Bookshop.org Uncultured Autograph: Connect with Daniella on social media TikTok , Patreon , Instagram Youtube Connect with Scot Loyd\u0027s social media ( TikTok ) Daniella\u0027s other podcast: Hey White Women",
      "release": "2024-09-10T00:00:00",
      "duration": "01:08:54.1910000",
      "explicit": true,
      "spotifyId": "5ZzRAYgo80U1fZuo6513Q3",
      "appleId": 1000668179162,
      "youTubeId": "rSsh_CppHhA",
      "subjects": [
        "Children Of God",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZzRAYgo80U1fZuo6513Q3",
        "apple": "https://podcasts.apple.com/podcast/episode-9-we-are-the-best-down-with-all-the-rest/id1756133150?i=1000668179162",
        "youtube": "https://www.youtube.com/watch?v=rSsh_CppHhA"
      }
    },
    {
      "id": "19a8bb1f-3a44-45cf-b38b-200c69712888",
      "title": "Episode 8: Cult Speak and Clichés; Unpacking the Language of Control",
      "description": "Summary\n In this conversation, Daniella and Scot discuss the use of specialized language or vernacular in cults and high control groups. They explore how cults develop their own language to create a sense of belonging and isolation from the outside world. They also discuss the impact of language on communication and the difficulty of finding community after leaving a cult. The conversation highlights the manipulation of language by cult leaders to disguise abuse and control. They emphasize the importance of critically evaluating loaded language and cliches to uncover their true meaning. In this conversation, Daniella Mestyanek Young and Scot Loyd discuss the use of cliches and loaded language in cults and other contexts. They explore how cliches are used to shut down critical thinking and manipulate individuals. They also discuss the conflation of ideas and the use of binary thinking to control and dismiss dissenting voices. The conversation touches on the concept of conspirituality and the influence of language in advertising and politics. They provide guidance on becoming more aware of manipulative language and the importance of exposing oneself to diverse viewpoints.\n   Daniella Mestyanek Young\u0027s book:\n  ·       From Bookshop.org\n    Uncultured  Autograph:     Connect with Daniella on social media\n     TikTok,  Patreon,  Instagram    Youtube    Connect with Scot Loyd\u0027s social media  (TikTok)   Daniella\u0027s other podcast:  Hey White Women  Takeaways\n Cults develop their own language to create a sense of belonging and isolation from the outside world.\n Language is used by cult leaders to manipulate and control their followers.\n Leaving a cult can result in a loss of community due to the specialized language and shared experiences.\n It is important to critically evaluate loaded language and cliches to uncover their true meaning.\n Language can be a powerful tool for communication and understanding, but it can also be used to deceive and manipulate. Cliches are used in cults and other contexts to shut down critical thinking and manipulate individuals.\n Binary thinking and the conflation of ideas are used to control and dismiss dissenting voices.\n Conspirituality refers to the use of language in health, wellness, and spirituality communities to manipulate and control individuals.\n It is important to be critical of the language and messages directed towards us, including in advertising and politics.\n Exposing oneself to diverse viewpoints and avoiding isolation can help guard against manipulation.\n Watch out for dehumanizing language and us versus them mentality, as these are tactics used by cults to create a sense of superiority and wage wars.",
      "release": "2024-09-03T16:30:00Z",
      "duration": "01:02:11",
      "explicit": false,
      "spotifyId": "6aJtn31m49osW3FkzKGwFC",
      "appleId": 1000668192716,
      "youTubeId": "CMlHPDgaEQw",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aJtn31m49osW3FkzKGwFC",
        "apple": "https://podcasts.apple.com/us/podcast/episode-8-cult-speak-and-clich%C3%A9s-unpacking-the/id1756133150?i=1000668192716",
        "youtube": "https://www.youtube.com/watch?v=CMlHPDgaEQw"
      }
    },
    {
      "id": "fe82cca3-65c0-4ced-beac-362aaf4ca374",
      "title": "Episode 7: Isolation--The Silent Tool of Control in Cults and Beyond",
      "description": "In this episode, Scot Loyd and Daniella Mestyanek Young discuss the role of isolation in high control groups and cults. They explore how isolation is used to indoctrinate and control members, as well as the ways in which it can be subtle and pervasive in various organizations and institutions. They also touch on the dangers of echo chambers and the impact of social media algorithms on isolation and group dynamics. Autographed book: https://uncultureyourself.com/pages/uncultured-autographed From Bookshop.org: https://bookshop.org/a/104058/9781250280114 Daniella’s Tiktok: https://www.tiktok.com/@daniellamestyanekyoung Youtube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg Instagram: https://www.instagram.com/stories/daniellamyoung_/ Unamerican Videobook: https://tr.ee/ODM-qtUJaR Secret Practice Videobook: https://tr.ee/DGEY3IeQQm Connect with Scot Loyd\u0027s social media : https://www.tiktok.com/@thescotloyd takeaways Isolation is a crucial tactic used by high control groups and cults to separate members from the larger world and its influences. Isolation can be physical, but it can also be subtle and pervasive in various organizations and institutions. Isolation is often accompanied by intense activities and exhaustion, which can create feelings of euphoria and forge strong bonds within the group. Isolation can also be used to break down individual identity and make members more susceptible to indoctrination. Isolation can be reinforced through dress codes, language, and prohibitions against gossip and negative discussions. Isolation can lead to the formation of echo chambers and the reinforcement of groupthink. Social media algorithms can contribute to isolation by filtering out opposing viewpoints and creating personalized echo chambers. Isolation can have both positive and negative effects, depending on the context and the individual\u0027s needs and experiences. titles Isolation and the Formation of Echo Chambers The Influence of Social Media Algorithms on Isolation Sound Bites \u0022As soon as you deploy, it immediately becomes more culty.\u0022 \u0022Love a good conference because you\u0027re just there surrounded by other people that have the same special interest topic as you.\u0022 \u0022Doing hard things together is part of what bonds people.\u0022 Chapters 00:00Introduction to the Role of Isolation 03:02Isolation in the Military and Other Organizations 08:51The Intense Bonding of Isolation 13:21The Impact of Isolation on Identity 18:11Isolation and the Formation of Echo Chambers 23:52The Influence of Social Media Algorithms on Isolation 29:22The Dual Nature of Isolation",
      "release": "2024-08-20T15:29:00Z",
      "duration": "01:02:09.9980000",
      "explicit": false,
      "youTubeId": "WVN8L5QnGQI",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WVN8L5QnGQI"
      }
    },
    {
      "id": "3e0c30ea-104c-476f-8487-edd5d3a773d5",
      "title": "Episode 6: Take One for the Team (Self-Sacrifice of Members",
      "description": "In this episode of *Cults and the Culting of America*, hosts Scot Loyd and Daniella Mestyanek Young delve into the complex dynamics of self-sacrifice within cults and high-control groups. Drawing from their personal experiences and extensive research, they explore how cults exploit their members’ labor under the guise of a transcendent mission, enforce conformity through appearance and attitude control, and manipulate emotions to maintain control. The conversation also touches on the parallels between cult behavior and practices in organizations like the military and corporate America, offering insights into the pervasive influence of cult-like tactics in various aspects of society.\n  \n The episode explores key themes such as cults, high-control groups, and the concept of self-sacrifice, delving into how these groups exploit their members\u0027 labor under the guise of a transcendent mission. The discussion also touches on the idea of total institutions, where conformity is enforced through appearance and attitude control, and emotional manipulation is used to maintain control over members. By examining parallels between cult behavior and practices in organizations like the military and corporate culture, the hosts highlight the pervasive influence of these tactics in suppressing individual identity and enforcing group dynamics. Topics like cognitive dissonance, patriotism, social control, and the manipulation tactics used by cults are also discussed, providing a comprehensive understanding of the psychological and social mechanisms at play within these environments.\n   Daniella Mestyanek Young\u0027s book:\n  ·       From Bookshop.org\n    Uncultured  Autograph:     Connect with Daniella on social media\n     TikTok,  Patreon,  Instagram    Youtube    Connect with Scot Loyd\u0027s social media  (TikTok)   Daniella\u0027s other podcast:  Hey White Women  **Scot Loyd:** Welcome to the *Cults and the Culting of America* podcast. I\u0027m Scott Loyd along with my friend Daniella Mestyanek Young, and she\u0027s written a book called *Uncultured,* which you should pick up. Both of us are cult survivors, and we\u0027re working through a list of characteristics that Daniella developed to help all of you, along with us, process and understand our cult experiences, as well as identify cults and high-control groups. So with that introduction, Daniella, which characteristic are we talking about today?\n **Daniella Mestyanek Young:** Thanks so much for the introduction, Scott. Today, we are going to be talking about self-sacrifice. Specifically, in cults, there\u0027s the constant and continual self-sacrifice of the members. If you\u0027re just joining us, episode one has the whole list of my 10 characteristics that make up a cult, and we\u0027re going through each of those in detail.\n Self-sacrifice is number four on the list, but it connects very directly to number eight on the list, which is exploitation of labor.\n **Scot Loyd:** And you\u0027ve mentioned before that this is ultimately what cults are all about—free labor, right?\n **Daniella Mestyanek Young:** Exactly. When I heard cult scholar Dr. Janja Lalich say, \u0022Cults are about labor,\u0022 it broke my brain and gave me a whole different understanding of what I had experienced and why we were doing the things we did. Labor is your one inexhaustible resource. The cult leader is out for power, but the cult itself is about getting your labor. They tell you it’s in pursuit of a transcendent mission, which we covered in episode three.\n In the Children of God cult, our mission was saving the world for Jesus before the end times. In the US Army, it was protecting American interests overseas. These missions are so grand and unquestionably good that they allow the cult and its leaders to constantly pull sacrifice from their members.\n **Scot Loyd:** You sent me something to read today, and you mentioned a term—quoting Irving Goffman—called a \u0022total institution.\u0022 I think when we\u0027re talking about cults, they certainly qualify as tot",
      "release": "2024-08-13T15:56:00Z",
      "duration": "01:09:01",
      "explicit": false,
      "spotifyId": "0dIDIJfQmq4vIhv4q7SJ5c",
      "appleId": 1000665163752,
      "youTubeId": "6dTgEmftouU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dIDIJfQmq4vIhv4q7SJ5c",
        "apple": "https://podcasts.apple.com/us/podcast/episode-6-take-one-for-the-team-self-sacrifice-of-members/id1756133150?i=1000665163752",
        "youtube": "https://www.youtube.com/watch?v=6dTgEmftouU"
      }
    },
    {
      "id": "ecb02a2b-81b2-4343-ab86-eae9d459976e",
      "title": "Episode 5: The Transcendent Mission",
      "description": "### Summary of Cults and the Culting of America Podcast - Episode on Transcendent Mission\n In this episode of \u0022Cults and the Culting of America,\u0022 hosts Scot Loyd and Daniella Mestyanek Young delve into the concept of the transcendent mission within cults and high-control groups. They discuss how cult leaders use vague, life-and-death missions to manipulate and retain followers. These missions often promise fulfillment in an unprovable future, making followers feel unique and superior, thus willing to self-sacrifice and endure hardships.\n Daniella differentiates the transcendent mission from the sacred assumption, explaining that while the sacred assumption is an unspoken belief (e.g., the leader being the smartest or chosen one), the mission is what recruits and keeps people dedicated. The mission is rarely practical and constantly evolving, ensuring followers never feel they\u0027ve fully achieved it.\n The hosts also touch on the importance of recognizing the signs of manipulative missions, such as their vagueness, constant change, and exclusivity. Daniella advises that it’s okay for individuals to focus on their own well-being and happiness instead of falling prey to manipulative missions.\n  \n   Daniella Mestyanek Young\u0027s book: \n  ·       From Bookshop.org\n    Uncultured  Autograph:     Connect with Daniella on social media\n     TikTok,  Patreon,  Instagram    Youtube    Connect with Scot Loyd\u0027s social media  (TikTok)   Daniella\u0027s other podcast:  Hey White Women   \n  \n **Hosts:** Daniella Mestyanek Young and Scot Loyd\n **Topic:** The Transcendent Mission in Cults and High-Control Groups\n **Overview:**\n In this episode, Daniella and Scot discuss the concept of the \u0022transcendent mission\u0022 and how it is used by cult leaders and high-control groups to manipulate and control their followers. They delve into the differences between the transcendent mission and the sacred assumption, the tactics used to recruit and retain followers, and the personal experiences of both hosts in various high-control environments.\n **Key Points:**\n 1. **Introduction to the Transcendent Mission:**\n    - Cult leaders create a transcendent mission to recruit and retain followers by promising a higher purpose or goal that often cannot be proven or achieved in this lifetime.\n    - The mission is usually vague, large-scale, and tied to life and death, making it compelling and difficult to question.\n 2. **Difference Between Transcendent Mission and Sacred Assumption:**\n    - The sacred assumption is an underlying, often unspoken belief that followers must accept to remain in good standing.\n    - The transcendent mission is the outward goal or purpose that the group is supposedly working towards, often used as a recruitment tool.\n 3. **Manipulation Tactics:**\n    - Cult leaders use the transcendent mission to justify extreme actions and sacrifices from their followers.\n    - Examples include religious cults promising salvation or enlightenment, and organizations like the military or corporations using missions to motivate self-sacrifice and loyalty.\n 4. **Personal Experiences:**\n    - Daniella shares her experiences in the Children of God cult and the US Army, highlighting the similarities in how both groups used a transcendent mission to control members.\n    - Scot discusses his upbringing in the United Pentecostal Church and how the promise of witnessing the return of Jesus was used to motivate followers.\n 5. **Challenges of Deconstruction:**\n    - Leaving a high-control group often involves losing a sense of mission and purpose, which can be terrifying and disorienting.\n    - Both hosts emphasize the importance of finding a new, personal mission that prioritizes individual well-being and happiness.\n 6. **Misconceptions About Good and Bad Cults:**\n    - Daniella argues that there is no such thing as a \u0022good cult\u0022 because the core mechanism of coercive control and self-sacrifice is inherently harmful.\n    - They discuss",
      "release": "2024-08-06T14:30:00Z",
      "duration": "01:01:39",
      "explicit": false,
      "spotifyId": "5heW4h2FxUDKwzOHA3Vz66",
      "appleId": 1000664491421,
      "youTubeId": "RgISh4g7vZs",
      "subjects": [
        "Evangelicalism",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5heW4h2FxUDKwzOHA3Vz66",
        "apple": "https://podcasts.apple.com/us/podcast/episode-5-the-transcendent-mission/id1756133150?i=1000664491421",
        "youtube": "https://www.youtube.com/watch?v=RgISh4g7vZs"
      }
    },
    {
      "id": "4ffe9e98-1742-46b3-8f93-7191800a1a0e",
      "title": "Episode 4: The Sacred Assumption",
      "description": "In this episode of the Cults and the Culting of America podcast, hosts Scot Loyd and Daniella Mestyanek Young dive into the concept of the \u0022sacred assumption,\u0022 a core belief that underpins a cult\u0027s worldview. Daniella explains how cult leaders create and manipulate these worldviews to control their followers, emphasizing that these assumptions don\u0027t have to be religious but can revolve around power, status, or other ideals. The discussion touches on the similarities and differences between cults and religions, the manipulation tactics used by cult leaders, and the challenges of deconstructing these beliefs after leaving a cult. Daniella also shares personal anecdotes about her experiences with the Children of God cult and the US Army, highlighting the parallels between different high-control groups. Scot and Daniella discuss the ongoing process of deconstruction, the importance of questioning sacred assumptions, and the impact of privilege and societal constructs on our beliefs. They emphasize the need for skepticism and self-defined values, contrasting this with the often rigid and manipulative frameworks of cults. The episode concludes with a call to action for listeners to engage with Daniella\u0027s work, including her book Uncultured and her Patreon project UnAmerican. Daniella Mestyanek Young\u0027s book: · From Bookshop.org Uncultured Autograph: Connect with Daniella on social media TikTok , Patreon , Instagram Youtube Connect with Scot Loyd\u0027s social media ( TikTok ) Daniella\u0027s other podcast: Hey White Women **Cults and the Culting of America Podcast** Welcome to the Cults and the Culting of America podcast with scholar of cults, extreme groups, and extremely bad leadership, Daniella Mestyanek Young. I\u0027m your host, Scot Loyd. Welcome to another episode of Cults and the Culting of America. I\u0027m Scot Loyd, along with my friend Daniella Mestyanek Young. Not only is she my friend, but she is a scholar of cults, extreme groups, and extremely bad leadership. Daniella, how are you doing today? **Daniella Mestyanek Young:** I am doing great. I am excited for us to talk about the worldview shift into the transcendent mission and the most common question anyone gets asked about cults, which is: what is the difference between a cult and a religion? **Scot Loyd:** Very nicely said. I\u0027m looking forward to this episode. And you\u0027re wearing an interesting shirt today. Tell us about that shirt, and if folks want to buy one for themselves or their friends and family, how can they do that? **Daniella Mestyanek Young:** Yes, you can find any of the shirts you see me wearing through the links below. I sell them through my social media channels. This shirt says, \u0022The first rule of cults is you\u0027re never in a cult,\u0022 which is the epigraph of my book, *Uncultured*. It\u0027s about growing up in the Children of God and joining the US Army. It\u0027s also a play on *Fight Club*, which a lot of people don\u0027t realize is kind of the cult movie. It really gets to the idea that nobody thinks they\u0027re in a cult. Cults are manipulative cons that target people, lie, deflect, and pull you into their worldview. As soon as you realize you\u0027re in a cult, you\u0027re on your way out. But many people think cults are extreme and rare, when in fact, they\u0027re incredibly common. A lot of my life\u0027s work is pointing out these parallels and helping people understand the groups and systems we\u0027re in. **Scot Loyd:** And we\u0027re going down the list of characteristics of a cult that you have identified and authored. Today we arrive at the idea of worldview, or as you call it, the sacred assumption. What do you mean by sacred assumption, and why is it a leading characteristic of a cult? **Daniella Mestyanek Young:** Oh my gosh, this one is so dramatic. I mean, literally, I was in bed and I sat up and just yelled out, \u0022Hold nothing sacred.\u0022 It was the answer to the question I\u0027d been asked for 15 years: Why would anyone join a cult? How can people fall for such extremism? Growing up in the Children of God, which was a pedophile cult, it was perfectly understandable how it happened, but difficult to explain to outsiders. First, let me bring this back to that common question: what is the difference between a cult and a religion? This ties into worldview. People ask this all the time, and I say they\u0027re not even the same type of thing. A religion is an idea, a noun. A cult is a group. You need a group, even if it\u0027s just two people. One of the most pernicious stereotypes is that cults are religious. Every day I see people saying, \u0022Nah, not a cult, because we\u0027re not religious.\u0022 Part of why NXIVM fooled so many people is because it wasn\u0027t religious. Large group awareness training, like est or anything ending in \u0022-ony,\u0022 aren\u0027t religious but can still be cults. A cult doesn\u0027t give you a religion; it gives you a worldview. The leader spends decades forming this worldview, and to be a member, you must adopt it. It\u0027s not presented that way, but it becomes clear once you\u0027re in it. The entire worldview is upheld by the sacred assumption. In the Children of God, it was that this random white dude who failed at everything was the prophet of God. As long as you believe that, you can justify anything. The sacred assumption ties closely to the \u0022ends justify the means\u0022 mentality and sometimes even precipitates an apocalyptic mindset. **Scot Loyd:** The sacred assumption doesn\u0027t necessarily have to be theological in nature. It could be anything related to life, like pursuing wealth, status, or power. That\u0027s what a lot of these groups offer – a world change, a fulfilling life, or a flourishing existence. **Daniella Mestyanek Young:** Right. In NXIVM, the sacred assumption was that Keith Raniere was the smartest man on earth. In the US Army, the sacred assumption is that the US flag is worth dying for. You must believe that to be successful in the Army. So, it doesn\u0027t have to be religious. It\u0027s a worldview. I\u0027ve recently realized all cults and cult leaders promise \u0022space travel,\u0022 meaning ultimate enlightenment or achievement will be on another plane, another existence, another life, a different heavenly body – something that can\u0027t be proven. This keeps people from achieving enlightenment because if it were real, they\u0027d leave. It\u0027s a crucial part of the con and makes it hard to crack people\u0027s brainwashing. As long as you choose to believe the sacred assumption, you can justify anything. **Scot Loyd:** When you talk about this sacred assumption or worldview, it reminds me of Aristotle\u0027s idea that to be persuasive, you need parts of your message that are familiar and parts that are novel. If it\u0027s all novelty, people are likely to reject it. But if there\u0027s something familiar at the core, it resonates with people. Cult leaders leverage these familiar sacred assumptions that people are already familiar with to control their thoughts and behavior. **Daniella Mestyanek Young:** Yes, and I think this is exactly what Taylor Swift means when she says, \u0022You know how to ball, I know Aristotle.\u0022 She\u0027s dropping lines because she knows how to pull emotional strings. Cult leaders know how to manipulate you by leveraging these familiar concepts. I don\u0027t agree with the stereotype that cult leaders start off good and then turn bad. Cult leaders don\u0027t trip and fall into coercive control. They\u0027ve been figuring this out for a long time. For example, Jim Jones was studying how to manipulate people with preacher voice from a young age. He never cared about civil rights; it was just his way to stand out. This is why religion is often used – it\u0027s a pre-existing worldview with a giant body of literature and concepts that a cult leader can tweak and spin to fit their agenda. They use these frameworks to radicalize people. Religions have thought-stopping clichés built in, where at some point, logic ceases, and you go forward on faith. Nefarious leaders who have been honing their manipulative skills know how to use that. **Scot Loyd:** Right. And the thought-stopping cliché is, \u0022God told me to do this.\u0022 When someone plays that card, how do you come back from it? You don\u0027t. There\u0027s nothing you can say if they claim to have heard from God. Cult leaders play on these collective questions we all have about origin, destiny, meaning, morality, and purpose. They offer answers with certainty, enthusiasm, and passion. The human dynamic often makes us fall in line and not question these sacred assumptions. **Daniella Mestyanek Young:** Absolutely. And deconstruction tip, Scot, can you repeat that list? We need to make sure this is in the show notes. **Scot Loyd:** Sure. The list is origin (where did I come from?), destiny (where am I going?), meaning (what does it all mean?), morality (how do we treat one another?), and purpose (what should I do with my life?). **Daniella Mestyanek Young:** These are the huge questions you have to define for yourself when you leave a cult. You\u0027re rejecting a worldview. My three-part model of deconstruction is: first, wake up and physically and mentally leave the cult; second, spend about a decade understanding why you were in a cult and its impact on your personality and identity; and third, move forward with no models. It\u0027s overwhelming because you\u0027ve lost your framework and have to answer these giant questions. This is why we\u0027re at risk of cult-hopping afterward, looking for another system with black-and-white rules. I fell into CrossFit and paleo for a while because I was looking for another system to live by. **Scot Loyd:** I\u0027ve experienced that too. My deconstruction is still ongoing. I left the United Pentecostal Church in a slow fade. I went through stages of cult-hopping, embracing different theological perspectives, and coming to terms with the idea that I was exceptional. I had to realize that if I\u0027m special, that\u0027s something I define for myself. Likely, I\u0027m just like everyone else, trying to make it through life and determine what is good, how to treat one another, and how to get along. The sacred assumption regulates behavior, but we need autonomy over our lives. **Daniella Mestyanek Young:** Exactly, Scot. We build these stories to control behavior. Classic fairy tales were scary to keep children safe. The stories we tell ourselves are critical to how we act and operate. One thing to watch out for is groups with anti-gossip policies. Gossip helps us warn each other about bad actors. These stories and worldviews are crucial, and it\u0027s not as simple as discarding them. It takes a decade or more to build your own worldview after leaving a cult. We need to understand why we were in a cult and its impact on our identity before building our worldview. **Scot Loyd:** Yes, like you, I was born into the United Pentecostal Church and invested a large part of my life in it. Education was my way out. One of the most fascinating books I read early on was Foucault\u0027s *Discipline and Punish*, about the evolution of prisons. He opens with an assassin trying to kill King Louis XVI. The public execution made people rebel, so prisons were designed to regulate behavior. The panopticon\u0027s design, where prisoners think they\u0027re being watched 24/7, became a model for schools and hospitals. It\u0027s a beautiful analogy for high-control groups. The sacred assumption regulates behavior, dictating every aspect of life. **Daniella Mestyanek Young:** Yes, and military deployment is like a prison sentence in many ways. Initially, it\u0027s nice not to have to handle daily tasks, but eventually, you crave autonomy. People want clarity, which cults provide during social confusion. Recording my audiobook made me realize culty things about myself 20 years after leaving the cult. I had to audition for the audiobook and was convinced only I could do it. When I got the offer, I was paralyzed with fear, needing professional validation. This made me realize I had been seeking a mentor to tell me what to do with my life, which isn\u0027t a mentor; it\u0027s a leader. **Scot Loyd:** Exactly, Daniella. I still seek validation and apologize for everything, a holdover from conditioning in the United Pentecostal Church. The sacred assumption gives us something to aspire to, standing in for the leader\u0027s gaze. It\u0027s terrifying to make decisions on your own, but we\u0027re all just trying to figure out how to live our one life. Your book, *Uncultured*, was your way of making your pain meaningful, helping others with their journeys. Realizing we\u0027re not as different or special as we think is a poignant part of deconstruction. **Daniella Mestyanek Young:** Yes, and the realization that we\u0027re all in this together, without sacred assumptions keeping us apart, is crucial. Leaders proclaiming sacred assumptions discourage questions. Offering certainty in a volatile world is appealing but unrealistic. Sacred assumptions offer a selfish worldview, ignoring global perspectives. When you see an \u0022us vs. them\u0022 mentality, question it. It\u0027s built into cult language, with groups claiming moral superiority. **Scot Loyd:** Absolutely. Cult leaders use familiar values and frameworks to radicalize people. Your Ten Commandments for good groups, like holding nothing sacred, counteract this. Values can be manipulated; it\u0027s the reporting you require that shows true values. For example, if safety is a company\u0027s stated value, but they focus on loss numbers, they\u0027re not prioritizing safety. **Daniella Mestyanek Young:** Exactly. And to preempt trolls who say, \u0022not holding anything sacred\u0022 is my sacred assumption – approaching beliefs with skepticism is essential. I show this in *Uncultured* at a soldier\u0027s funeral, holding doubt that our side is 100% right. General McChrystal\u0027s book, *Leaders: Myth and Reality*, emphasizes that soldiers must admit they don\u0027t know for sure they\u0027re on the side of right. **Scot Loyd:** And this idea of binary thinking – right vs. wrong, good vs. bad – is problematic. Our lives are shaped by luck and circumstances. The arrogance of assuming we\u0027re right and others are wrong is staggering. Living humbly means recognizing the complexities and uncertainties of life. **Daniella Mestyanek Young:** Yes, deconstruction is about becoming less narcissistic and more selfish in a healthy way. Recognizing privilege and the accident of birth is crucial. There\u0027s no meritocracy; success isn\u0027t guaranteed by doing everything right. Grasping sacred assumptions is a con. **Scot Loyd:** Well said, Daniella. On that note, we\u0027ll conclude this fascinating conversation. I encourage our listeners and viewers to pick up Daniella\u0027s book, *Uncultured*, read it, and share it with friends. If you like what you hear, leave us a rating, subscribe, and share the podcast. Thank you for tuning in. **Daniella Mestyanek Young:** Thank you, Scot. For more on extremism and related topics, check out my project *UnAmerican* on Patreon, where I share the manuscript and other content. Follow both Scot and me on TikTok for more conversations about cults. **Scot Loyd:** Thank you again for tuning in. We\u0027ll see you next time on Cults and the Culting of America. Follow Daniella on social media and subscribe to her Patreon for exclusive content. Pick up her book, *Uncultured*. Until next time, I\u0027m Scot Loyd for Daniella Mestyanek Young on the next episode of Cults and the Culting of America.",
      "release": "2024-07-30T15:00:00Z",
      "duration": "00:58:51.2060000",
      "explicit": false,
      "spotifyId": "5aKRA5uYRoNKZ5p2aoEomO",
      "appleId": 1000663811444,
      "youTubeId": "AblteUzHsG0",
      "subjects": [
        "Cult Psychology",
        "NXIVM",
        "Evangelicalism",
        "Large Group Awareness Trainings",
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5aKRA5uYRoNKZ5p2aoEomO",
        "apple": "https://podcasts.apple.com/podcast/episode-4-the-sacred-assumption/id1756133150?i=1000663811444",
        "youtube": "https://www.youtube.com/watch?v=AblteUzHsG0"
      }
    },
    {
      "id": "acd4951a-7a08-48df-886b-d2b5fe6ca8db",
      "title": "Episode Three: The Skinny White Woman",
      "description": "    Daniella Mestyanek Young\u0027s book:\n  ·       From Bookshop.org\n    Uncultured  Autograph:     Connect with Daniella on social media\n     TikTok,  Patreon,  Instagram    Youtube    Connect with Scot Loyd\u0027s social media  (TikTok)   Daniella\u0027s other podcast:  Hey White Women   \n  Episode Summary: Cults and the Culting of America - Episode on The Skinny White Woman in Cults **Episode Title:** The Skinny White Woman in Cults\n **Hosts:**\n - **Daniella Mestyanek Young** (Group Behavior Gal) - Scholar of cults, extreme groups, and extremely bad leadership.\n - **Scot Loyd** - Co-host and commentator.\n **Introduction:**\n In this episode, Daniella and Scot dive into the concept of the \u0022skinny white woman\u0022 in cults and high-control groups, exploring her role in supporting and legitimizing cult leaders and their coercive control tactics.\n **Key Topics:**\n 1. **The Skinny White Woman in Cults:**\n    - Daniella introduces the concept, highlighting examples like Allison Mack in NXIVM and Ghislaine Maxwell with Jeffrey Epstein.\n    - The pattern of skinny white women supporting cult leaders and their role in upholding white supremacy.\n 2. **Historical and Cultural Context:**\n    - The history of white supremacy and its influence on the perception of purity and ideal womanhood in America.\n    - The policing of women\u0027s bodies, especially through clothing, makeup, and hairstyles, within cults and broader society.\n 3. **Daniella’s Personal Experience:**\n    - Daniella shares her observations from the Children of God cult and the US Army, noting the emphasis on appearance and control.\n    - Her realization of the role she played in upholding certain standards and her decision to rebel against these norms.\n 4. **The Role of Charismatic Authority:**\n    - Discussion on how cult leaders often place skinny white women, military officers, or celebrities around them to gain legitimacy and distract from their actions.\n    - The enforcement of patriarchal norms by these figures within the group.\n 5. **Scot’s Perspective from the United Pentecostal Church:**\n    - Scot reflects on his experiences with the church\u0027s emphasis on the ideal woman and the spiritual power attributed to women who fit this mold.\n    - The impact of purity culture on both men and women in religious settings.\n 6. **Control and Manipulation Tactics:**\n    - How cults use control of appearance and emotional manipulation to maintain power over members.\n    - The concept of emotional evocation and its role in cult dynamics.\n 7. **Breaking Free from Cult Influences:**\n    - Strategies for deconstructing cult programming, such as rejecting purity standards and embracing individuality.\n    - Daniella’s journey of using her platform to educate and advocate against these harmful norms.\n **Conclusion:**\n The episode concludes with a call to action for listeners to educate themselves, support anti-racist and feminist causes, and use their voices to challenge oppressive systems.\n **Call to Action:**\n - Follow Daniella on social media and support her on Patreon for exclusive content.\n - Purchase Daniella’s book \u0022Uncultured\u0022 to learn more about her experiences and insights into cults and high-control groups.\n - Like, subscribe, and share the podcast to help spread awareness and gain a broader audience.\n **Closing Remarks:**\n Scot thanks Daniella for her insights and contributions to the discussion, encouraging listeners to continue questioning and deconstructing harmful societal norms.\n ---\n ### Cleaned-Up Transcript\n **Daniella (Group Behavior Gal) (00:02.754):**  \n This is the Cults and the Culting of America podcast with scholar of cults, extreme groups, and extremely bad leadership, Daniella Mestyanek Young. I\u0027m your host, Scot.\n **Daniella (Group Behavior Gal) (00:26.062):**  \n And the Culting of America podcast. My name is Scot Loyd along with my friend, Daniella Mestyanek Young. Daniella, how are you today?\n **Scot Loyd:**  \n I\u0027m doing",
      "release": "2024-07-23T16:35:00Z",
      "duration": "00:58:36.9430000",
      "explicit": false,
      "spotifyId": "26oO5zLdfinrwHhpMu63nv",
      "appleId": 1000663119671,
      "youTubeId": "UvEER9UFRbQ",
      "subjects": [
        "Cult Psychology",
        "NXIVM",
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/26oO5zLdfinrwHhpMu63nv",
        "apple": "https://podcasts.apple.com/podcast/episode-three-the-skinny-white-woman/id1756133150?i=1000663119671",
        "youtube": "https://www.youtube.com/watch?v=UvEER9UFRbQ"
      }
    },
    {
      "id": "aa5a84ca-99f2-48ba-9a6d-347c778e0b91",
      "title": "Episode Two: From Charisma to Control: Understanding Cult Leaders",
      "description": "In this episode of \u0022Cults and the Culting of America,\u0022 hosts Scot Loyd and Daniella Mestyanek Young delve into the concept of charismatic leadership within cults. They begin by discussing how the idea of a charismatic leader is often associated with cults, highlighting that many of these leaders are typically perceived as white males. Daniella explains that while cults have been largely defined by white western academics, the underlying structure of patriarchy predates even white supremacy and capitalism, making it a fundamental aspect of coercive control in cults. The conversation touches on notable examples of charismatic leaders, including Keith Raniere, David Berg, and Jim Jones, as well as Elizabeth Holmes and Adam Neumann. Daniella emphasizes that charismatic authority is not just about charm but involves qualities that make people grant these leaders extraordinary influence. She discusses how these leaders often transition from being charismatic figures to being deified by their followers, creating a system where their personal mythology becomes integral to the group\u0027s identity. Scot and Daniella explore the psychological and social mechanisms that make individuals susceptible to charismatic leaders. They discuss the concept of \u0022front-of-the-room advantage,\u0022 where the mere act of being in a position of authority can make a person seem more credible and likable. They also highlight the role of rhetoric and persuasive communication in enhancing a leader\u0027s influence, noting how leaders use techniques like \u0022trance talk\u0022 to captivate and manipulate their audience. The episode concludes with a discussion on the importance of critical thinking and diverse social connections in protecting oneself from falling prey to cult-like influence. Daniella shares her \u0022guru gotcha\u0022 checklist, a tool she developed to help identify potential red flags in leaders and groups. Both hosts stress the need for self-awareness and skepticism, encouraging listeners to examine the charismatic leaders in their lives critically. They also preview upcoming episodes, including an exploration of the role of the \u0022skinny white woman\u0022 in cult dynamics and the broader impact of group psychology on individual behavior. **Keywords**: cult, cult leader, people, charismatic leader, leader, purity, call, Daniella, woman, rhetoric, groups, skinny, idea, charisma, religion, white, followers, book, white male, life Transcript: **Speaker 1**: This is Cults and the Culting of America, a podcast with scholar of cults, extreme groups, and extremely bad leadership, Daniella Mestyanek Young. **Scot Loyd**: Welcome to Cults and the Culting of America podcast. I\u0027m Scot Loyd, along with my friend Daniella Mestyanek Young. Daniella, how are you today? **Daniella**: Doing good! I\u0027m excited to talk about charismatic leadership because everybody gets confused by this one. **Scot**: Did I get \u0022Mestyanek\u0022 right this time? **Daniella**: Yes, you did. Very good. **Scot**: You were telling me during your time in the army that there were some gentlemen who were actually afraid to mispronounce it. **Daniella**: Yeah, I always joke that people thought I was so scary because, in the army, that\u0027s how you have to present yourself if you\u0027re a woman. People were so scared of me that everyone just learned how to pronounce Mestyanek. It wasn\u0027t until my very last unit that people started calling me Captain M, which would be more normal in the US military when you have a complicated name. **Scot**: Nice. My name is Scot Loyd, a little less complicated—one T and one L. I like to joke that my family couldn\u0027t afford the extra consonants. But here we are today, and I\u0027m thrilled that all of you are along for the ride. Last time we were together, Daniella, we unpacked a little bit about your 10 characteristics of a cult. The first one on that list is something that, if you asked people what they associate with a cult or a cult group, they would come up with: the charismatic leader. So, what do we need to understand about the charismatic leader\u0027s role in a cult? And am I wrong to assume that most of these charismatic leaders are white males? **Daniella**: First of all, the acknowledgment that cults have been largely defined by white academics, white western academics. When we actually start looking at what we\u0027re really talking about—when individuals come under the coercive control of a group—those leaders can look like a lot of things. But the OG cult system, even before white supremacy and capitalism, is patriarchy. Coercive control, the way we see it in our world, is tacked right along patriarchy. We\u0027ll talk about this in next week\u0027s episode on the \u0022skinny white woman\u0022 who\u0027s in parentheses next to the cult leader in white-led American cults. When women are the cult leaders, as happened in my cult, Children of God, they still have to fight patriarchy, so they have to fight harder, and society celebrates more when they go down. In my charismatic leader chapter in my forthcoming book, *The Culting of America*, we are looking at your typical white male cult leaders you think of—Keith Raniere, David Berg of Children of God, Jim Jones of Jonestown. We\u0027re also looking at Elizabeth Holmes of Theranos, David Petraeus of the military, and Adam Neumann of WeWork. Elizabeth Holmes is an example of someone who still had to fight harder to build her cult and maintain control than a man would have. She had to have a man next to her giving her validity, and society really celebrates much harder when she goes down and demands justice in ways they don\u0027t for men like Adam Neumann, who walked away with billions of dollars while she walked away with a jail sentence. **Scot**: And that\u0027s interesting when we talk about the idea of charisma, especially in the context of the United States. For a large part of my career, I served as a communications professor. One of the subjects I taught every semester was group dynamics and leadership, where we looked at how a group develops. What do we look at when we define the term leadership? In a cult or cultish-like group, these characteristics become magnified and are leveraged to manipulate others for harm. How do we define charisma? For a long time in the United States, if you were taller than everyone else, that was defined as charisma. Think of Abraham Lincoln, right? **Daniella**: The first problem is there are two things that charisma means, and we only think of one of them. We almost always think charisma equals charming, and also tall. It is true that more CEOs are tall. Taylor Swift is very tall. People always tell me I have tall energy when they realize I\u0027m only five-five. I think it\u0027s this larger-than-life thing. But the reality is, when we are saying charismatic leader, we\u0027re talking about charismatic authority. Max Weber defined this concept. He secularized something he saw from religion: we give people authority over us due to some qualities, some extra-human, extraordinary qualities they have. He defines two types of authority: power and violence authority, and charismatic authority. In any situation where you are given power because of qualities about you, that job, that degree, you are in a position of charismatic authority. It\u0027s not just charm. Cult leaders often are not charming. A lot of times, they\u0027re bumbling idiots, but they\u0027re good at traits we associate with charm and charisma in our minds. For example, something called trance talk—saying a bunch of interesting-sounding, smart-sounding things, jumping from topic to topic. In *The Vow*, you see Keith Raniere doing this. People don\u0027t catch on. By the way, ask me what my secret was when I didn\u0027t know how to answer essay questions in college. My secret was to write three more paragraphs. The professor will forget you didn\u0027t actually answer the question. That\u0027s what cult leaders do. They eventually start turning themselves from charismatic leaders into gods. That\u0027s when we see people emulating their qualities, celebrating their birthdays like a holiday. **Scot**: And it\u0027s a very predictable road to deification as well. I\u0027m laughing because that was common for me growing up in the United Pentecostal Church. The leader of the church, our pastor, who was exclusively a white male, was always venerated. His birthday was celebrated, any special days for the pastoral family. Evangelicals even have Pastor Appreciation Month in October. If you were a good parishioner, you were supposed to laud all these accolades, gifts, money, and vacations on your leader. **Daniella**: We also see the mythologizing of the leader\u0027s origin story or the group\u0027s origin story. For example, I have two college degrees, and at no point did I know who the president of the university was until I had to meet him because I was the valedictorian. Why do you need to know who the leader of Bob Jones University is? When you start seeing pictures of the leader everywhere—US military looking right at you—that\u0027s part of deification and the weapon of likability and familiarity. We are friendlier towards people we are familiar with. When you walk in every morning and see your commander\u0027s face on the wall, they become more charismatic to you, and you are more likely to feel warmly toward them when you actually see them. It\u0027s why we think it\u0027s appropriate to walk up to an actress or actor in real life and introduce ourselves. We feel like we know them and love them because of that familiarity. These patterns are not original. Dr. Janja Lalich says they all went to the same Messiah school. **Scot**: You bring up exceptionalism. Not only does the leader think they are exceptional, but cult leaders play with terms like destiny and fate. Destiny has a wonderful connotation; everyone wants to embrace their destiny and avoid their fate. Cult leaders create a negative fate like hell or some version of hell—poverty, unpopularity, loneliness. They create their version of heaven and say, \u0022Follow me, and you\u0027ll fulfill your destiny and avoid this fate.\u0022 **Daniella**: Yes, and with the destiny thing, they always blame individuals for systemic problems. If anything good happens, it\u0027s the cult or the leader. If anything bad happens, it\u0027s you. This trains you to think this way. I realized that cult leaders often promise something in another life, world, plane, body, or state. You can\u0027t reach enlightenment because it\u0027s a con. The cult leader knows it\u0027s a con. It\u0027s significant that Jim Jones didn\u0027t drink the Kool-Aid; he died from a bullet to the head. Cult leaders get caught up in their own hullabaloo, but their followers believe in the ends justifying the means. The cult leader knows the whole time. When we look back at all those cult leaders, we can see that since childhood, they are manipulating, building their worldview, and trying to build something with a following. **Scot**: Cult leaders exploit the need within all of us to think of ourselves as exceptional, to think our lives have meaning and purpose. The loudest and most bold among us are often the most insecure. Human nature makes us follow loud, bold people, especially if they promise purpose and meaning. They also have the stick of punishment—eternal damnation, poverty, loneliness. Follow them, and you\u0027ll avoid this fate. **Daniella**: Right, I call it the front-of-the-room advantage. When you\u0027re in an audience and hear someone introduced as the speaker, you think they\u0027re impressive. I teach veterans in my networking classes to put themselves in front of the mic as often as they can. People will believe someone put them there. If nobody else is questioning around you, that\u0027s social proof. Cult leaders rely on this heavily. They\u0027ll flabbergast you and keep going. If nobody else is saying anything, you think it must be okay. When we started studying cults, we believed humans were much more rational than they are. \u0022I think, therefore I am,\u0022 like René Descartes really screws us over a bit. Humans are not rational; we hardly ever make decisions based on logic. We make most of our decisions based on recency bias and social proof. What worked for us most recently or what everyone else around us is doing. These evolutionary drives keep you alive. This comes into play with the charismatic leader. Some bigger cults have been through a thing called routinization. Mormons and Jehovah’s Witnesses will say, \u0022We\u0027re not a cult; no charismatic leader.\u0022 If you have to use a loophole to get out of the definition of a cult, we have an answer now, and it\u0027s called charisma by proxy. We now know large groups of people can go down illogical paths without calling each other out on it. **Scot**: There\u0027s a good resource that unpacks that further—*The Righteous Mind: Why Good People Disagree About Religion and Politics* by Jonathan Haidt, a moral psychologist. One of the best books I’ve read on this. In public speaking, I tell my students, \u0022With great power comes great responsibility.\u0022 Public speaking is the number one fear in America. Seinfeld joked people would rather be in the box at a funeral than give the eulogy. But if you manage that apprehension, you set yourself apart. For our listeners, to make students less susceptible to cults, get them involved in debate. It’s a great activity. You can\u0027t rely solely on charismatic skills; logic is involved. It takes you out of the binary world and helps you see all possibilities. High control groups want you locked into binary thinking—\u0022my way or hell.\u0022 **Daniella**: The first thing anyone will say if you call a group they love a cult is, \u0022Not a cult, free to leave anytime.\u0022 That line is both loaded language and a thought-stopping cliché. It\u0027s not true. Cults have high entrance and exit costs—not always money. It\u0027s anything you lose if you\u0027re not in the group. In both the cult and the military I grew up in, leaders would say, \u0022This is not a democracy.\u0022 You are reminded everything you have can be gone if you disagree. People say, \u0022Oh, you\u0027re free to leave anytime.\u0022 I say, \u0022Do you love everything about your job? No? Why don\u0027t you just leave?\u0022 **Scot**: Exactly. When we talk about charisma and the charismatic leader, I thought about good questions to ask if evaluating whether a leader is a cult leader. These are good questions for any leader. One is, what platform of privilege are they speaking from that gives them this advantage? In our society, patriarchy and white supremacy give white males a place of status. The system was produced by people like me, a white male, for my benefit. It\u0027s important to acknowledge that. If your leader isn’t doing that, maybe that’s a problem. **Daniella**: Social media has been good for cult leaders. It helps people get into and out of cults. I say that in the 60s and 70s, when my grandfather joined the Children of God, if you wanted to isolate an American citizen, you had to take them away to your compound in Texas or Brazil because we all watched the same TV shows, listened to the same news. Even if you were on polar opposite sides of an issue, you shared this reality. These days, isolation can just be in your bedroom on a computer, and you can totally be in a cult. It has shifted things. I built a \u0022guru gotcha\u0022 checklist to keep myself in check. Anybody who knows a lot about cult leaders and bad guys is dangerous. People say, \u0022Should we be scared of you?\u0022 Yes, if I invite you to my compound, maybe say no. I fought the social media thing because I don\u0027t like the concept of influencers. I make sure 50% of my content comes from others. I want people to see that. Here\u0027s the \u0022guru gotcha\u0022 checklist: 1. Heavy focus on your own uniqueness. 2. Intense come-here-go-away behavior to keep you off balance. 3. Always asking you to prove your loyalty. 4. Lack of intellectual humility or willingness to learn from others. 5. Constantly blurring the edges of their expertise. 6. Trance talk. 7. Asking followers to pay for their essence, presence, or energy. 8. Handing out life advice they are not qualified to give. 9. Some form of purity from their followers. 10. Intense appearance and attitude control of followers. 11. Talking poorly about other leaders in their industry. 12. Blaming systemic failures on individual action. 13. Blurred sexual boundaries or using young women or men to entice followers. 14. Requesting followers to leave their jobs and follow them. 15. Threatens you when you leave or speak poorly of them. **Scot**: That’s a lot to talk about. Let\u0027s return to purity and power. Growing up in the United Pentecostal Church, purity and power were hallmarks. Policing behavior, dress, and hairstyles of women were emphasized. It was steeped in white supremacy. The skinny white woman was the ideal image. Purity was about maintaining the look of the 1930s and 1940s—no jewelry, no makeup, no cutting hair. This was preached as giving power and authority with angels and God. **Daniella**: Purity requirements are in every situation of coercive control. They’re not just sexual purity but any black-and-white rule. I explain it like this: I don\u0027t eat wheat because I\u0027m allergic to it, so it\u0027s a black-and-white rule but not a purity requirement. Groups that don\u0027t eat gluten for health are under purity. Purity requirements are crucial because they make people police each other and themselves. They are impossible because humans are bad at being perfect and pure. Cult leaders themselves never follow purity requirements. They are for everyone else. They turn you into your own jailer. Purity requirements are usually time-consuming and keep you busy. Skinny is a powerful purity requirement in our society. It’s a visual presentation of sacrifice. **Scot**: Speaking of purity culture, in the United Pentecostal Church, there was a big emphasis on women\u0027s behavior and bodies. There wasn’t that emphasis for men. You shared part of your story in *Uncultured*—a sex cult. How did the leaders reconcile purity culture? **Daniella**: In the Children of God, the purity requirement was you couldn’t say no. You were not trusting God if you said no. You were letting your individuality and desires interfere. There was a comic called \u0022The Girl Who Wouldn’t\u0022 training us from a young age. Outside the cult, I didn’t know how to say no. Purity requirements in the Children of God involved no underwear while sleeping, women not wearing bras. Skinny is one of the most powerful purity requirements. Cult leaders want to keep you isolated, tired, busy, skinny, pregnant, and hungry. Sometimes it’s the opposite of skinny. Scientology forced abortions. Heaven’s Gate had no sex, no children. It’s about controlling sex, not purity. Any organization telling consenting adults who they can and can’t sleep with is controlling. **Scot**: I appreciate you sharing that. Let’s return to the idea of rhetoric. Charismatic leaders harness rhetoric\u0027s power. Hitler is a classic example, although his style of speaking seems like just yelling. Symbolic Convergence Theory by Ernest Bormann from the University of Minnesota theorizes that people develop and move forward around ideas communicated effectively by leaders. These rhetorical visions organize and control civilization. How is a rhetorical vision cast in cults, and how do we insulate ourselves from falling prey? **Daniella**: I love *Sapiens* by Yuval Noah Harari. Religions, corporations, organizations—all these groups are stories we tell ourselves. Religions are stories societies craft to explain things. Cults are not religions; they are cons from day one. Elizabeth Holmes knew she wasn’t transforming blood testing. Cults are about the leader’s control. Religions aim for society to work; cults don’t. Religions are not comparable to cults. Religions are useful to cult leaders because they require faith, which can be manipulated. **Scot**: Manipulation vs. motivation is a key difference. Motivation is mutually beneficial; manipulation benefits only the leader. Consensual sales involve providing actual products that help people. Manipulations involve false promises. Understanding this helps identify manipulation. **Daniella**: Anyone who knows about cult leaders can become one. Wake up every day and choose to use your rhetorical skills for good, not to manipulate. Jim Jones could have been remembered as an early civil rights leader if he died in the 1950s. Instead, he chose to use his skills for evil. Charismatic leaders must choose daily to use their influence for good. **Scot**: Engaging in competitive debate helps build critical thinking. It challenges prevailing assumptions and teaches you to look at other positions. If you’re in a space where everyone agrees with you, you’re susceptible to harm. Ideas must be challenged to avoid trauma. **Daniella**: Social connections are crucial. Make sure your children have diverse social connections that don’t overlap. High exit costs make leaving hard. Cancel culture isn’t real; it’s consequence culture. Diversifying connections helps navigate challenges. Understanding your own biases and staying agnostic about being the good guy is crucial. Cults thrive on binary thinking. **Scot**: In our concluding episodes, we’ll talk about the importance of groups and community. Next episode, we\u0027ll explore the role of the \u0022skinny white woman\u0022 next to the charismatic leader. **Daniella**: Thanks for listening with open minds. Think about the charismatic leaders in your life. It’s not about labeling but learning to navigate groups and systems. Find us on social media. We’ll be doing this podcast every week. **Scot**: Thank you. Like, subscribe, and share the podcast to help us reach more people. For Daniella Mestyanek Young, I’m Scot Loyd. See you on the next episode of Cults and the Culting of America. **Outro**: Thank you for joining us for this episode of Cults and the Culting of America. Follow Daniella on social media and subscribe to her Patreon for exclusive content. Pick up her book *Uncultured*. Until next time, I’m Scot Loyd for Daniella Mestyanek Young.",
      "release": "2024-07-16T15:52:00Z",
      "duration": "01:02:11.0430000",
      "explicit": false,
      "spotifyId": "7Hk6YowrFQTOK45hvRlw0c",
      "appleId": 1000662427862,
      "youTubeId": "kYd5tCAVQEI",
      "subjects": [
        "Cult Psychology",
        "Children Of God",
        "NXIVM",
        "Peoples Temple",
        "Evangelicalism",
        "Jehovah\u0027s Witnesses",
        "Scientology",
        "Cult-Expert",
        "Bob Jones University",
        "Heaven\u0027s Gate",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Psychology",
        "Theranos",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Hk6YowrFQTOK45hvRlw0c",
        "apple": "https://podcasts.apple.com/podcast/episode-two-from-charisma-to-control-understanding/id1756133150?i=1000662427862",
        "youtube": "https://www.youtube.com/watch?v=kYd5tCAVQEI"
      }
    },
    {
      "id": "53f799e8-ec81-4a6a-9342-331e785cac47",
      "title": "What Sex Cults and War Have in Common",
      "description": "About: Welcome to \u0022Cults and the Culting of America,\u0022 where we delve into the fascinating and often disturbing world of cults, extreme groups, and toxic leadership. I’m your host, Scott Lloyd, and today I\u0027m thrilled to be joined by Daniella Mestyanek Young, a renowned scholar and author of the gripping memoir \u0022Uncultured.\u0022 Daniella\u0027s journey from being born into the notorious Children of God cult to serving in the United States Army offers a unique perspective on the parallels between these vastly different yet similarly controlling environments. Join us as we explore her extraordinary story and the insights she’s gained Connect with Scot at: https://www.tiktok.com/@thescotloyd Connect with Daniella at: My Patreon: https://www.patreon.com/GroupBehaviorGal TikTok: @daniellamestyanekyoung Instagram: @_daniellamyoung https://www.uncultureyourself.com/ Youtube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg UnAMERICAN Videobook Get the book: UNCULTURED: A Memoir \u0022A propulsive memoir delivered in the honest tones of a woman who didn\u0027t always think she\u0027d live to tell her story.\u0022 --NYT See a Sample Chapter in Rolling Stone Magazine See a Sample Chapter in The Sydney Herald Words in: Newsweek \u0026 Narratively Get a copy of UNCULTURED: Digital , Audio , or Hardcopy or preorder the paperback as a holiday gift for a friend. Get an Autographed copy here: https://uncultureyourself.com/pages/uncultured-autographed Shownotes: Welcome to \u0022Cults and the Culting of America,\u0022 the podcast where we delve into the world of cults, extreme groups, and toxic leadership. I\u0027m your host, Scott Lloyd, and I\u0027m thrilled to be here with Daniella Mestyanek Young, a scholar in this field and author of the compelling memoir, \u0022Uncultured.\u0022 Daniella, how are you today? Daniella: I\u0027m doing great, Scott! Thanks for having me. Scott: Fantastic! I\u0027m excited to kick off this podcast with you. I must say, your book \u0022Uncultured\u0022 has been an incredible resource for me. Growing up in a small Pentecostal cult, known as the United Pentecostal Church, your experiences really resonated with me. Throughout our podcast, I\u0027ll share some of my own stories, but your journey from the Children of God cult to the United States Army is extraordinary. Your book provides such a detailed account, and I highly recommend everyone read it. For those who prefer audio, it\u0027s available and even made it to the New York Times bestseller list. Daniella: Thank you so much, Scott. I\u0027m glad to hear the book has had such an impact. Scott: For our listeners who might not be familiar with your story, could you share a bit about your experiences? We’re titling this episode \u0022Patriot Pains: I Joined the Army and All I Got Was This Lousy Trauma,\u0022 and I’m particularly interested in how you compare your time in the Children of God cult with your service in the Army. Daniella: Absolutely. First, I want to clarify that while the media often labels the Children of God as a \u0022sex cult,\u0022 it\u0027s important to understand that cults, in general, share common patterns of behavior and control, regardless of their specific doctrines. That said, the Children of God did have a significant focus on sexual doctrines, which were central to their beliefs. I was born into the Children of God, three generations deep. My family was deeply embedded in its leadership—my grandmother donated the first house to the leader, David Berg, and my grandfather still manages the cult\u0027s finances. My father also played a significant role in handling the money. This is all detailed in my book, \u0022Uncultured.\u0022 The Children of God started in 1968 in California, like many cults of that era. David Berg took evangelical control of sex, mixed it with elements of Mormonism, and called it \u0022free love,\u0022 which I describe as forced polyamory. The cult rebranded itself over the years—from being labeled a \u0022harem photo sex cult\u0022 on the cover of Time Magazine in the 80s to performing at the White House in the 90s. Scott: Wow, that’s a remarkable transformation. Daniella: Yes, it is. But despite the rebranding, the core practices and control mechanisms remained the same. I was eventually kicked out at 15, and as you’ll see throughout this podcast, I was never someone who would conform to that environment. Scott: Your transition from the Children of God to the Army is fascinating. How did you end up comparing the two environments? Daniella: There are surprising similarities between extreme groups, whether it\u0027s a cult or a highly structured organization like the Army. Both environments use intense control and indoctrination techniques, which can be quite traumatic. My story is about navigating these systems and finding my own path. Scott: This is going to be an enlightening conversation. Thank you for sharing, Daniella. Let\u0027s dive into more of your experiences and insights.",
      "release": "2024-07-09T15:22:00Z",
      "duration": "01:05:41.2500000",
      "explicit": false,
      "spotifyId": "5Fk9SXrqQNJUCZ02GDRfFM",
      "appleId": 1000661675018,
      "subjects": [
        "Cult Psychology",
        "Children Of God",
        "Evangelicalism",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Fk9SXrqQNJUCZ02GDRfFM",
        "apple": "https://podcasts.apple.com/podcast/what-sex-cults-and-war-have-in-common/id1756133150?i=1000661675018"
      }
    },
    {
      "id": "e729f870-da35-4881-9b87-159de6524623",
      "title": "Who We Are, and Why We Talk About Cults So Much",
      "description": "Welcome to the inaugural episode of \u0022Cults and the Culting of America\u0022 podcast! Join hosts Scott Lloyd and Daniella Mestyanek Young as they dive into the fascinating world of cults, extreme groups, and toxic leadership. In this episode, Daniella shares her journey from growing up in the notorious Children of God cult to joining the U.S. Army and becoming a scholar of cult dynamics. Discover the psychological tactics used by cults to control and manipulate followers, and learn how these methods appear in everyday groups and systems. Scott and Daniella discuss why cults are a hot topic today and explore the societal changes making people more vulnerable to cultic influences. Tune in for an insightful discussion on recognizing and understanding the toxic elements in groups and the importance of individual awareness. Don\u0027t miss this engaging introduction to a series that will unpack the complexities of cult behavior and its impact on society. Be sure to like, rate, and share this episode to help spread the word. Follow Daniella on social media and check out her books \u0022Uncultured\u0022 and \u0022UnAmerican\u0022 for more in-depth insights. Join us on this journey to uncover the truth about cults and their pervasive influence. Connect with Scot at: https://www.tiktok.com/@thescotloyd Connect with Daniella at: My Patreon: https://www.patreon.com/GroupBehaviorGal TikTok: @daniellamestyanekyoung Instagram: @_daniellamyoung https://www.uncultureyourself.com/ Youtube: https://www.youtube.com/channel/UCuFRBZ2w3QsYs7Km69keHsg UnAMERICAN Videobook Get the book: UNCULTURED: A Memoir \u0022A propulsive memoir delivered in the honest tones of a woman who didn\u0027t always think she\u0027d live to tell her story.\u0022 --NYT See a Sample Chapter in Rolling Stone Magazine See a Sample Chapter in The Sydney Herald Words in: Newsweek \u0026 Narratively Get a copy of UNCULTURED: Digital , Audio , or Hardcopy or preorder the paperback as a holiday gift for a friend. Get an Autographed copy here: https://uncultureyourself.com/pages/uncultured-autographed Transcript Scot: Welcome to the \u0022Cults and the Culting of America\u0022 podcast! I\u0027m your host, Scott Lloyd, and I\u0027m here with Daniella Mestyanek Young, a scholar of cults, extreme groups, and extremely bad leadership. Daniella, how are you today? Daniella: I\u0027m doing great, Scott! How about you? Scot: I\u0027m good, thanks! I see you’ve been super busy lately. Every time I open Instagram or TikTok, you’re going live. How do you manage to talk so much from 7 a.m. to 5 p.m.? Daniella: (Laughs) It\u0027s funny you mention that. When recording the audiobook for \u0022Uncultured,\u0022 I discovered I have no trouble talking for seven to nine hours a day. While others worry about losing their voice, that wasn’t the hard part for me. Right now, I’m talking to a lot of people about cults, which are a hot topic these days. Historically, cults thrive during times of societal change because people crave clarity and leadership. Scot: That makes sense, given everything going on. Your book, \u0022Uncultured,\u0022 is fantastic and really sheds light on your experiences growing up in the Children of God cult and later joining the Army. I recently moved to Springfield, Illinois, and saw your book featured as a must-read at Barnes \u0026 Noble. Congrats on all the success! Daniella: Thank you so much! I love seeing those photos of \u0022Uncultured\u0022 in the wild. I appreciate the introduction. As you mentioned, I grew up in the Children of God cult, which is one of the worst you’ll hear about on this podcast. I later joined the U.S. Army and earned a master\u0027s degree in Industrial/Organizational Psychology from Harvard Extension School. Now, I’m a scholar of cults, extreme groups, and extremely bad leadership. I compare what I do to an intelligence officer\u0027s work, helping people understand group behavior and recognize cult tactics in everyday life. Scot: Absolutely. Your book has been a great resource in understanding my own experiences with the United Pentecostal Church, which had many cult-like behaviors, especially in policing the bodies of women. These groups often use appearance and attitude policing to control individuals, stripping away their individuality. Daniella: Exactly. Cults exist for labor and control, using predictable patterns of coercive control. Appearance and attitude policing are key tactics. We’ll discuss this more in our episode on self-sacrifice, but the goal is always to erase the individual for the group’s or leader’s benefit. Scot: That loss of individualism is a common thread in many cults and extreme groups. For example, in the Pentecostal church, the exuberant worship practices often lead to a collective loss of self, making individuals more susceptible to groupthink and control. Daniella: Yes, chanting and group activities make us highly susceptible to suggestion. It’s a common tactic in cults and other controlling environments. We’ll explore this further in the podcast, breaking down my 10-part definition of cults and comparing these tactics to behaviors in everyday groups and systems. Scot: I’m thrilled about this podcast and the opportunity to learn from you. Why do you think cults are such a hot topic right now? Daniella: America is going through significant societal changes, similar to the 70s. People are seeking clarity and community, making them more vulnerable to cults. Additionally, we’re revisiting social issues and questioning longstanding systems like patriarchy, racism, and capitalism. Cult tactics are everywhere, and it’s crucial to recognize them to navigate these systems better. Scot: Well said. This podcast aims to educate and help people understand the toxic elements in groups and systems. I invite everyone to join us on this journey. Like, rate, and share this episode to help us spread the word. Daniella, thank you for sharing your insights. Daniella: Thank you, Scott. To our listeners, get my book \u0022Uncultured\u0022 wherever books are sold, or check out my second book, \u0022UnAmerican,\u0022 on Patreon. Follow us on social media for more updates, and stay tuned for our next episode, where we’ll dive deeper into what makes a cult a cult. For Daniella, I’m Scott. See you next time on \u0022Cults and the Culting of America\u0022!",
      "release": "2024-07-04T12:48:00Z",
      "duration": "00:23:25.0740000",
      "explicit": false,
      "spotifyId": "2RItATOALXHw6LI678cGUW",
      "appleId": 1000661554957,
      "youTubeId": "XK8qNm1rXTc",
      "subjects": [
        "Cult Psychology",
        "Children Of God",
        "Evangelicalism",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2RItATOALXHw6LI678cGUW",
        "apple": "https://podcasts.apple.com/podcast/who-we-are-and-why-we-talk-about-cults-so-much/id1756133150?i=1000661554957",
        "youtube": "https://www.youtube.com/watch?v=XK8qNm1rXTc"
      }
    }
  ]
}