{
  "_ts": 0,
  "id": "e4c6e012-6343-479c-a58e-45a60d66e91d",
  "name": "Curious Worldview Podcast",
  "appleId": 1540424160,
  "youTubeChannelId": "UCJ9ETrebJG7WpXhqqGBrNgg",
  "episodes": [
    {
      "id": "53680586-56ae-435b-8361-a7a16fe5c5a1",
      "title": "Gareth Gore | Unveiling The Conspiracy Of Opus Dei",
      "description": "Subscribe To The Curious Worldview Newsletter - https://curiousworldview.beehiiv.com/subscribe\n\nGareth Gore - OPUS (Amazon) - https://www.amazon.com/Opus-Trafficking-Right-Wing-Conspiracy-Catholic/dp/1668016141\n\nOpus Dei are a predatory catholic cult that started in Spain in the early 20th century and grew and grew over the years into a global organisation that set out with the singular vision to re-christianise the entire world. \n\nGareth Gore stumbled into this story when researching and writing the collapse of one of Spains largest financial institutions, Banco Popular, which turns out was the bottomless kitty financing Opus Dei’s international ambitions. It’s a story of money laundering, fraud and financial opacity that made possible the scale of one of if not the most influential and pernicious and influential catholic organisations int he world. But it’s not just a benign organisation that creates a welcoming community for catholics the world over, it is an organisation which has been accused of 100’s if not thousands of incidents of human trafficking, sexual abuse and drug abuse and are attempting to influence their worldview through the rewriting of legal systems. A worldview that reflects the most conservative and man made fundamentalist interpretations of the bible. \n\nThis book by Gareth Gore is an immense achievement that proves an otherwise held conspiracy, of financial fraud at the scale of hundreds of millions of dollars, political corruption and a secret society exerting their influence on the halls of power that you and I are subject to. \n\n\n\n00:00 - What Is Opus Dei?\n02:30 - How Did This Story Get On Gareth\u0027s Radar?\n09:30 - What Is Opus Dei In Gareth\u0027s Words\n24:47 - Josemaria Escriva... The Founder Of Opus Dei\n33:40 - 1000\u0027s Of Victims Of Human Trafficking, Sexual Abuse \u0026 Drug Abuse.\n46:15 - The Structure Of Opus\n59:05 - Banco Popular\n1:16:10 - Secret Societies\n1:18:10 - Peter Thiel \u0026 Michael Sugrue\n1:22:35 - Counter Messaging Campaign From Opus Dei\n1:27:00 - How Co-Operative Were Opus Dei?\n1:31:10 - Physical Threats?\n1:32:30 - Have We Seen The Height Of Opus?\n1:37:25 - Changing Media Landscape Over Next 25 Years?\n1:42:12 - Serendipity In Gareth\u0027s Life\n\n🍻☕: https://www.buymeacoffee.com/ryanhogg\nFollow me on Instagram – @ryanfhogg",
      "release": "2024-10-08T07:36:47Z",
      "duration": "01:42:05",
      "explicit": false,
      "appleId": 1000672190873,
      "youTubeId": "C5DBS-vr3OU",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/gareth-gore-unveiling-the-conspiracy-of-opus-dei/id1540424160?i=1000672190873",
        "youtube": "https://www.youtube.com/watch?v=C5DBS-vr3OU"
      }
    }
  ]
}