{
  "id": "62994afc-3558-4973-8fc9-a875c0e769a3",
  "name": "Cynthia Mathieu",
  "youTubeChannelId": "UCyCD6IVdVzIur-Kqr8u74pA",
  "episodes": [
    {
      "id": "6d814ced-4ccd-45e2-8a69-98f2e0876338",
      "title": "What Type of Organizational Cultures Attract Dark Personalities",
      "description": "In this episode, I examine how organizational culture influences who becomes attracted to, hired, and promoted within a company—and why certain environments tend to attract individuals with dark personality traits like narcissism and psychopathy. \n\n\nI highlight the key organizational factors that draw these individuals and explain why “fake safe cultures”—companies that promote well-being but fail to follow through—can be even more harmful than openly toxic workplaces. I also discuss ways organizations can minimize the risk of attracting dark personalities by fostering genuine cultures of safety, empathy, and accountability, led by dedicated leadership.\n \n\nThis is a public episode. If you would like to discuss this with other subscribers or get access to bonus episodes, visit cynthiamathieu.substack.com (https://cynthiamathieu.substack.com?utm_medium=podcast\u0026utm_campaign=CTA_1)",
      "release": "2025-12-07T15:57:37Z",
      "duration": "00:18:21",
      "explicit": false,
      "youTubeId": "6iZ_5W14rTI",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6iZ_5W14rTI"
      }
    },
    {
      "id": "4268f28d-8d62-4cd2-adf8-35a0458e5542",
      "title": "Episode 2: Signs of Toxic Workplaces and How To Survive Them",
      "description": "Welcome to the second episode of my podcast on Healing Workplaces. Thank you for being here with me.\n\n\nIn this episode, I will highlight signs that you might be in a toxic workplace and offer advice on how to survive and take care of yourself. I hope this episode helps some of you. The next episode will explore dark personalities in the workplace.\n\n\nAgain, thank you for listening. Take care of yourself and the people around you\n \n\nThis is a public episode. If you would like to discuss this with other subscribers or get access to bonus episodes, visit cynthiamathieu.substack.com (https://cynthiamathieu.substack.com?utm_medium=podcast\u0026utm_campaign=CTA_1)",
      "release": "2025-11-16T21:46:23Z",
      "duration": "00:26:33",
      "explicit": false,
      "youTubeId": "3kbkwANSoWM",
      "subjects": [
        "Corporate Cult",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3kbkwANSoWM"
      }
    }
  ]
}