{
  "_ts": 0,
  "id": "464e3913-a663-41d4-895b-260037072d11",
  "name": "D Listers of History",
  "spotifyId": "6R62hIIHDIMbl5TJ57CSvH",
  "appleId": 1663696092,
  "episodes": [
    {
      "id": "632b2dfc-1aaf-469a-9762-4f7ab88ffdf7",
      "title": "Girlbossing: A Historical Perspective",
      "description": "Have you ever wondered why that girl you haven\u0027t spoken to since high school ~really~ wants to sell you essential oils/leggings/makeup/nail wraps/etc? One of the men to blame is David McConnell, the founder of the company now known as Avon. Fayge and Mazal dive into Avon\u0027s history, and how we got to that weird social media message, you don\u0027t know how to respond to. Disclaimer: These are our opinions based on publicly available information. Further Reading: (Some links below are affiliate links that earn a commission for purchases made at no additional cost to you) Ding Dong! Avon Calling!: The Women and Men of Avon Products, Incorporated by Katina Manko Savannah Marie\u0027s Youtube Channel How to get a friend out of an MLM MLMs vs. Pyramid Schemes according to the Federal Trade Commission Report Income or Health Claims to the FTC Embedded Audio Clips in Order: \u0022Piano Lesson/If You Don\u0027t Mind Me Sayin\u0027 So\u0022 - The Music Man 1962 Film \u0022Wells Fargo Wagon\u0022 - The Music Man 1962 Film \u0022Rock Island\u0022 - The Music Man 1962 Film \u0022The Sadder But Wiser Girl\u0022 - The Music Man 1962 Film Präludien und Fugen Op.16 I.Andante - Allegro vivace / G minor - Clara Schumann Symphony No. 9 in E minor, \u0022From the New World\u0022, Op. 95, B. 178 MVT 1 - Antonin Dvorak \u0022Solidarity Forever\u0022 Vintage 1950s Avon Commercial \u0022An American in Paris\u0022 - George Gershwin \u0022The Charleston\u0022 Vintage Avon Lady Commercial 1970s \u0022Money\u0022 - Pink Floyd \u0022Money Money\u0022 - Cabaret \u0022There\u0027s No Business Like Showbusiness\u0022 - Annie Get Your Gun Edward Scissorhands Movie Clip Upbeat Instrumental Work Music Keep the conversation going on our NEW Substack ! (You don\u0027t need a Substack account to subscribe) Thank you to April Keez for the use of the songs \u0022Misfit\u0022 and \u0022Grow Up\u0022 from the Album Mountainview. Find her album on Bandcamp . Audio drop from: Vintage 1950s Avon Commercial ~~~~~~~~~~~~~~~~~~~~ www.DListersofHistory.com D Listers of History on Threads D Listers of History on TikTok D Listers of History on Instagram Support us on Patreon! Hosted by Ausha. See ausha.co/privacy-policy for more information.",
      "release": "2024-04-15T04:00:00Z",
      "duration": "01:09:48.4800000",
      "explicit": false,
      "spotifyId": "1YIQeRVnVpmFGHuy5Zfwg6",
      "appleId": 1000652444751,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YIQeRVnVpmFGHuy5Zfwg6",
        "apple": "https://podcasts.apple.com/podcast/girlbossing-a-historical-perspective/id1663696092?i=1000652444751"
      }
    }
  ]
}