{
  "id": "705570df-222b-4c14-98b0-0a5451b8a70b",
  "name": "Dana Wilkey DecaDish gossip #decadishdana",
  "youTubeChannelId": "UCqIitTc4lKzO6h0ousOTEng",
  "episodes": [
    {
      "id": "636aedf6-ade0-463d-807b-217d66742c2f",
      "title": "RHOSLC Marys Cult",
      "description": "Mary Cosby\u0027s cousin just dropped a TLC project allegedly exposing her lies I share the highlights, and Whitney Rose, Mary, and Bronwyn Newport triple down on camera with serious drug and alcohol accusations against Meredith Marks - they\u0027ve said this THREE TIMES which is huge. Bronwyn drops a bombshell about Seth Marks with a mysterious woman at a New York restaurant, but Meredith\u0027s social media claps back and Watch What Happens Live shade about Bronwyn\u0027s sealed criminal background reveals the battle lines. I\u0027ve got tea from Monica Garcia about a shocking Heather Gay ambulance incident involving alcohol poisoning that was allegedly covered up, plus why Lisa Barlow calling Brittani Bateman a liar backfired when Jared Osmond confirmed the truth.\nFor Members Only Palm Beach - you can\u0027t film on Palm Beach Island where real socialites live, so none of these women are actual queens. Taja Abitbol was accused in a 2022 arson lawsuit of setting a fire to land RHONY, though Jill Zarin defended her. Hillary Mooser married an 80-year-old at age 30 for her first of FIVE marriages, and my insider has tea about her properties. I believe Rosalyn Yellen\u0027s husband represents Mar-a-Lago explaining her Trump access, while Gail Brophy was removed by Secret Service trying to approach him and kicked out of Taja\u0027s viewing party. But the REAL Palm Beach queens? Everglades Club costs $300K to join, Eleanor Aquavela sells art for $120 million, and the Peltz family owns 13 acres worth $400 million - explaining Nicola Peltz\u0027s power over Brooklyn Beckham!\n\nFull episode only available at Dishing Drama Dana Patreon: https://www.patreon.com/cw/DishingDramaWithDanaWilkey\n\nTIME CODE HIGHLIGHTS:\n🎉 0:00 - Happy New Year from Ireland - RHOSLC recap and Palm Beach deep dive\n👀 0:32 - Mary Cosby\u0027s cousin Dan TLC project exposing her lies\n😱 3:06 - Salt Lake recap begins - nine minutes of filler torture\n💊 6:53 - Whitney, Mary \u0026 Bronwyn triple down - Meredith has drug/alcohol problem\n😭 8:13 - Mary crying - outing Meredith forever on the show\n💔 9:59 - Bronwyn\u0027s bombshell - Seth Marks with mystery woman in NYC restaurant\n📱 11:06 - Meredith\u0027s social media clap back - claims it\u0027s business partner\u0027s wife\n🎭 12:19 - Meredith\u0027s Watch What Happens Live shade about Bronwyn\u0027s criminal background\n🚑 17:27 - Monica Garcia reveals Heather Gay ambulance alcohol poisoning coverup\n🎬 19:23 - Moving to Netflix Members Only Palm Beach secrets\n🔥 20:17 - Palm Beach show background - originally Bravo\u0027s Snowbirds\n🏝️ 24:43 - Can\u0027t film on Palm Beach Island - none of these women are real queens\n🔥 31:22 - Taja\u0027s arson scandal - 2022 lawsuit accused her of setting fire for RHONY\n💍 41:10 - Hillary\u0027s gold digger past - married 80-year-old at age 30\n🏛️ 45:06 - Rosalyn\u0027s husband represents Mar-a-Lago theory explained\n🚨 46:59 - Gail removed by Secret Service trying to approach Trump\n🍷 47:34 - Gail kicked out of Taja\u0027s viewing party for drinking\n💎 1:00:17 - The REAL Palm Beach queens - Everglades Club revealed\n👑 1:04:21 - Pauline Pitt, Eleanor Aquavela, Sarah Wettenhall - actual royalty\n💰 1:08:44 - Peltz family 13 acres worth $400M - Nicola\u0027s power over Brooklyn explainedClaude is AI and can make mistakes. Please double-check responses.\n\n#netflix #palmbeach #membersonly #membersonlypalmbeach #rhobh #danawilkey #rhoslc #bravotv #bravoaddict #housewivesdrama #housewivesrecaps #bravo #wwhlbravo #radioandy #iheartradio #usweekly #trending #pagesix #meredithmarks #lisabarlow #heathergay #monicagarcia #jenshah #marycosby #angiekatsanevas #bronwynnewport #brittanibateman #jaredosmond #peacocktv #hayu #saltlakecity #cult #dancosby #tlctv #tlc #podcast #beckham #secrets",
      "release": "2026-01-04T12:00:37Z",
      "duration": "00:18:26",
      "explicit": false,
      "youTubeId": "IKkAaRqgg1Y",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IKkAaRqgg1Y"
      }
    }
  ]
}