{
  "_ts": 0,
  "id": "33f659d9-5749-4e2b-b28e-efee687d3794",
  "name": "Dangerous Memories | Tortoise Investigates",
  "spotifyId": "6edrtr63RobTNRuLvU2sfj",
  "appleId": 1590561275,
  "episodes": [
    {
      "id": "76d06303-4907-4b86-93c8-eebed44ce093",
      "title": "Introducing...Dangerous Memories",
      "description": "Introducing...Dangerous Memories When Sarah watched her 23 year old daughter cycle away from her in Chelsea - a well-off corner of London - she had no idea it would be the last time they’d see each other for 6 years. What would make a loving child from a life of privilege sever ties with friends and family, and disappear? It turns out, Sarah wasn’t alone in losing a daughter. Something strange was happening to other young women, too. And they all had one thing in common: a kind of therapist figure - a woman they were all seeing and sharing their problems, their secrets, their fears with. But it took years for the truth of what was happening behind closed doors to emerge, and the extraordinary things this woman led them to believe. Dangerous Memories is the story of young women who wanted to be healed that became, for us, a story about the healer, and what we risk when we let someone else into our mind, and our memory. To find out more about Tortoise: Download the Tortoise app - for a listening experience curated by our journalists Subscribe to Tortoise\u0026#43; on Apple Podcasts for early access and ad-free content Become a member and get access to all of Tortoise\u0027s premium audio offerings and more If you want to get in touch with us directly about a story, or tell us more about the stories you want to hear about contact hello@tortoisemedia.com Reporter: Grace Hughes-Hallett Producer: Gary Marshall Additional reporting and production: Imogen Harper Sound design and original composition: Tom Kinsella Theme music: Far Gone (Don’t Leave) by Pictish Trail Podcast artwork: Lola Williams Commissioning editor: Basia Cummings Executive producer: Ceri Thomas Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-06-28T16:31:08Z",
      "duration": "00:03:26.2100000",
      "explicit": false,
      "spotifyId": "3CLtATGp5iFC3vY1Au7gax",
      "appleId": 1000660572216,
      "subjects": [
        "Anne Craig"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3CLtATGp5iFC3vY1Au7gax",
        "apple": "https://podcasts.apple.com/podcast/introducing-dangerous-memories/id1590561275?i=1000660572216"
      }
    }
  ]
}