{
  "id": "dc7694ad-dd62-4bfd-89a1-2d562a5bb15c",
  "name": "Danny Jones Clips",
  "youTubeChannelId": "UCQ_piSR8gm-TfHZcDWOJciA",
  "episodes": [
    {
      "id": "31fda82b-6405-4f26-9101-069e6963c079",
      "title": "What Happened to the #1 Most Abused Kid from the Children of God Cult | Ray Connolly",
      "description": "The Tragedy of Ricky Rodriguez: the heartbreaking story of the #1 most abused victim of the infamous Children of God cult (also known as The Family International). Born in 1975 as Davidito, Ricky was groomed from infancy to be the prophesied successor of cult leader David Berg. His childhood—documented in the cult’s own disturbing publication “The Story of Davidito”—included systematic sexual abuse, exploitation, and indoctrination, all presented as religious doctrine. This video, presented by Ray Connolly, examines previously unreleased details, survivor testimonies, and the devastating events that led to Ricky’s 2005 murder-suicide after he sought justice against his mother Karen Zerby and other former leaders.\n\nDiscover how a cult that once claimed tens of thousands of members worldwide normalized child abuse under the guise of “Flirty Fishing” and “Loving Jesus” teachings, why Ricky’s case remains one of the most shocking examples of second-generation cult trauma, and the lasting impact on survivors. Essential viewing for anyone researching religious cults, coercive control, or the dark history of The Family International/Children of God.\n\n#RickyRodriguez #ChildrenOfGod #CultSurvivors\n\n📢 Subscribe for more: https://www.youtube.com/channel/UCQ_piSR8gm-TfHZcDWOJciA?sub_confirmation=1",
      "release": "2025-12-07T21:00:41Z",
      "duration": "00:11:41",
      "explicit": false,
      "youTubeId": "WhzXBpM-eV4",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WhzXBpM-eV4"
      }
    },
    {
      "id": "ae104029-f9f6-41b7-84a6-4000e3fe2ba0",
      "title": "How the Children of God Cult Justified Child Abuse | Ray Connolly",
      "description": "Children of God cult survivor Ray Connolly shares his harrowing story of widespread child abuse. In this powerful interview, Ray reveals the shocking extent of abuse within the controversial religious group, shedding light on its secretive practices and lasting impact on survivors. Learn about the cult’s history, manipulative tactics, and the resilience of those who escaped. This video uncovers disturbing truths through Ray’s firsthand account, offering insight into the psychological and emotional toll of growing up in such an environment. Perfect for those interested in true crime, cult psychology, or survivor stories, this interview provides a raw, unfiltered look at a dark chapter in modern history. Subscribe for more compelling stories of survival and recovery.\n\n#ChildrenOfGod #CultSurvivor #TrueCrime\n\n📢 Subscribe for more: https://www.youtube.com/channel/UCQ_piSR8gm-TfHZcDWOJciA?sub_confirmation=1",
      "release": "2025-12-07T16:00:39Z",
      "duration": "00:08:12",
      "explicit": false,
      "youTubeId": "OC169t8g3oQ",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OC169t8g3oQ"
      }
    },
    {
      "id": "e3e27ce8-e4c2-4889-9d91-039af1d63098",
      "title": "How the Children of God Became a Religious Sex Cult | Ray Connolly",
      "description": "Flirty Fishing: How a Religious Cult Used Sexual Favors to Recruit Members. Dive deep into one of the most shocking and controversial recruitment tactics ever employed by a modern religious movement—the Children of God (later known as The Family International). In this video, Ray Connolly uncovers the origins, implementation, and long-term consequences of \u0022Flirty Fishing,\u0022 a practice introduced by founder David Berg in the late 1970s that encouraged female members to use romantic and sexual relationships as a form of evangelical outreach.\n\nLearn how this method dramatically boosted membership during the cult’s early years, the theological justifications Berg provided, the exploitation and trauma experienced by many women involved, and why the practice was officially abandoned in the 1980s amid growing criticism and the AIDS crisis. We’ll examine primary sources, survivor testimonies, and declassified internal documents to separate fact from sensationalism.\nThis disturbing chapter reveals the extremes some groups will go to in the name of spreading their message and serves as a cautionary tale about manipulation, consent, and the dark side of charismatic leadership in new religious movements.\n\n#FlirtyFishing #ChildrenOfGod #ReligiousCults\n\n📢 Subscribe for more: https://www.youtube.com/channel/UCQ_piSR8gm-TfHZcDWOJciA?sub_confirmation=1",
      "release": "2025-12-05T19:00:14Z",
      "duration": "00:09:34",
      "explicit": false,
      "youTubeId": "8oKUWeAqbaU",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8oKUWeAqbaU"
      }
    },
    {
      "id": "b4afb61d-1061-43ec-b9f1-bb17cf03eef4",
      "title": "What Jim Jones\u0027 Son Said About Surviving the Jonestown Massacre | Lawrence Wright",
      "description": "🕊️💔 What was it like to survive one of the deadliest cult tragedies in history? In this powerful episode, journalist and author Lawrence Wright shares the gripping testimony of Jim Jones\u0027 son, Stephan Jones, who survived the infamous Jonestown Massacre that claimed over 900 lives in 1978. From his harrowing escape to the emotional aftermath, this story offers a rare, first-person glimpse into the mind of a cult leader’s child—and the trauma of living through mass manipulation, fear, and survival.\n\n🔍 Inside this episode:\n✅ Stephan Jones’ perspective on his father’s transformation into a cult leader\n✅ How he survived the massacre while others—including his family—did not\n✅ The emotional cost of losing nearly everyone he knew overnight\n✅ Reflections on forgiveness, guilt, and life after Jonestown\n\n⚠️ This is not just history—it’s a haunting lesson on control, belief, and human resilience.\n\n📢 Subscribe for more untold stories, survivor testimony, and deep dives into cult psychology and historical truth.: https://www.youtube.com/channel/UCQ_piSR8gm-TfHZcDWOJciA?sub_confirmation=1",
      "release": "2025-05-13T18:00:11Z",
      "duration": "00:09:24",
      "explicit": false,
      "youTubeId": "768cV3PJuQ4",
      "subjects": [
        "Peoples Temple",
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=768cV3PJuQ4"
      }
    }
  ]
}