{
  "_ts": 0,
  "id": "a68566c3-e0ba-4c9d-9ef9-c26d888e1d1b",
  "name": "Dans les yeux d\u0027Olivier Delacroix",
  "spotifyId": "5G2hpQy642SJE5sH9INKWA",
  "appleId": 1561122575,
  "episodes": [
    {
      "id": "e999cfe4-871b-4a81-a628-026b29b8d239",
      "title": "SOUS INFLUENCE - Jennifer évoque les dangers de la spiritualité : “Je voulais reprendre ma vie en main”",
      "description": "Si vous aimez \u0022Dans les yeux d\u0027Olivier\u0022, le podcast qui donne la parole à ceux qui ne l’ont jamais, laissez des étoiles et des commentaires sur votre plateforme d\u0027écoute préférée ! Olivier Delacroix part à la rencontre de Jennifer. Cette jeune femme de 28 ans s’est lancée à corps perdu dans le développement personnel et l’ésotérisme pour soulager son anxiété. Elle a accepté de confier son histoire dans cet épisode du podcast “Dans les yeux d’Olivier” produit par Europe 1 Studio. En 2017, Jennifer vient tout juste de terminer ses études d’architecture. Mais petit à petit, la jeune femme souffre de grosses crises d’angoisse dont elle ne comprend pas l’origine. Pour s’en sortir, Jennifer souhaite une méthode rapide. Elle se tourne alors vers la philosophie “New Age” : un courant basé sur la spiritualité, le développement personnel ou encore la sorcellerie. Un mouvement parfois porteur de dérives sectaires et friand de grosses sommes d’argent. Jennifer multiplie alors les stages ésotériques et les massages énergétiques. Elle se convainc ainsi de la possibilité d’une auto-guérison et dépense à cette époque jusqu’à 300 euros par mois pour aller mieux. Mais en réalité, la jeune diplômée est en pleine dépression et ses idées noires ne cessent de s\u0027aggraver. Désemparée, elle décide de se rendre aux urgences pour demander de l’aide… Jennifer a accepté de confier son histoire dans cet épisode du podcast « Dans les yeux d’Olivier », produit par Europe 1 Studio. Crédits : Présentation : Olivier Delacroix Production et rédaction : Raphaëlle Mariatte Réalisation : Christophe Daviaud Promotion et distribution : Marie Corpet Graphisme : Cosa Vostra",
      "release": "2024-09-17T03:00:00Z",
      "duration": "00:20:14.5380000",
      "explicit": false,
      "spotifyId": "69Gu8NNhplpYn7tRZeQ4DX",
      "appleId": 1000669771125,
      "urls": {
        "spotify": "https://open.spotify.com/episode/69Gu8NNhplpYn7tRZeQ4DX",
        "apple": "https://podcasts.apple.com/podcast/sous-influence-jennifer-%C3%A9voque-les-dangers-de-la/id1561122575?i=1000669771125"
      }
    }
  ]
}