{
  "id": "2ed1431d-6583-4b79-a9a2-50e16c7ad24c",
  "name": "Dark Finds Podcast",
  "spotifyId": "0bYBE7bflKAb44NmuA8S6m",
  "appleId": 1738653309,
  "youTubeChannelId": "UCap737Yzv3XONh8GaARy5bw",
  "episodes": [
    {
      "id": "4e779d5e-0dfd-4176-a591-d14d1238720f",
      "title": "Daniella Mestyanek Young - Escaping a Cult… Into Another System",
      "description": "My guest today is Daniella Mistyanek Young, and her story doesn’t begin with a bad decision, a vulnerable moment, or a charismatic stranger at the door…it begins at birth, inside one of the most infamous modern cults in history: The Children of God. In this conversation, Daniella takes us inside a world built on control, self-sacrifice, and the slow erasure of identity, where loyalty is demanded, individuality is treated like a threat, and your value is measured by what you can give… and what you can be made to endure. After escaping, Daniella joined the military sometime after, and began to see parallels between that institution and the one she had escaped - the strict structure, the chain of command, and the dissolution of identity. We also delve into how cults recruit in times of social chaos, how the internet has transformed modern indoctrination, why so many “transformation” movements feel like grifts, and the red flags that can help you spot coercion before it’s too late. Links Daniella\u0027s books and website \u0026#x1f4d6; HOW IT FALLS APART | Audio Experience \u0026#x1f9e8; Patreon \u0026#x1f64c;\u0026#x1f3fc; Dark Finds IG \u0026#x1f480; Dark Finds Book \u0026#x1f4d6; Takeaways Daniela Mestyanek Young shares her journey from a cult to the military. Cults exploit individuals during times of social turmoil. The internet has changed the landscape of cult recruitment. Self-sacrifice is a key element in cult indoctrination. Cults are often about labor exploitation, not just belief. Charismatic leaders manipulate followers for power. The military can exhibit cult-like characteristics. Cults can exist in corporate environments as well. Personal identity is often lost in cults and total institutions. Awareness of cult-like behavior is crucial for personal safety. Keywords cults, identity, self-sacrifice, power, control, charismatic leaders, military, exploitation, labor, individuality Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2026-01-19T12:29:41Z",
      "duration": "01:15:38.7230000",
      "explicit": false,
      "spotifyId": "1hbKMpcMuZWbJOXvNH3ja6",
      "appleId": 1000745738433,
      "youTubeId": "XlGHnMUvAwE",
      "subjects": [
        "Children Of God",
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1hbKMpcMuZWbJOXvNH3ja6",
        "apple": "https://podcasts.apple.com/podcast/daniella-mestyanek-young-escaping-a-cult-into/id1739321803?i=1000745738433",
        "youtube": "https://www.youtube.com/watch?v=XlGHnMUvAwE"
      }
    },
    {
      "id": "17b5c31d-0ddb-4327-8d3b-62b8065795f1",
      "title": "Rick Alan Ross - Unveiling the Dark World of Cults",
      "description": "Today, we\u0027re diving into the chilling and complex world of cults with one of the most respected voices in the field: Rick Alan Ross. Rick is the founder and Executive Director of the Cult Education Institute and is widely recognized as a leading authority on destructive cults, high-control groups, and controversial movements. He’s also the author of the acclaimed book Cults Inside Out: How People Get In and Can Get Out.\n\nSince 1982, Rick has been studying and confronting the dangers posed by authoritarian and manipulative groups. His work has led him to testify as an expert witness in courts across the U.S., including in federal cases, and he has advised law enforcement and government agencies on cult-related matters.\n\nIn this episode, we explore it all — from the infamous Waco siege and the Branch Davidians, to the modern-day manipulation of NXIVM. Rick shares firsthand insights into how cults operate, the psychological tactics used by their leaders, and the difficult journey of deprogramming those who’ve been caught in their grip.\n\nWe’ll also discuss:\n\nThe most dangerous and insidious cults Rick has encountered\nWhat drives cult leaders and why people follow them\nThe process of intervention and deprogramming\nHow social media is fueling a new generation of cult-like influence\nAnd the legal roadblocks to holding cults accountable\n\n\nHow It Falls Apart Kickstarter here 🚀 https://www.kickstarter.com/projects/garycolton/how-it-falls-apart-an-immersive-dystopian-thriller\n\n\n\nCult Education Website 👉🏼 https://culteducation.com/culteducation.html\n\n\n\nRick\u0027s book 📖 https://cultsinsideout.com/\n\n\n\nDark Finds Podcast IG 👀 https://www.instagram.com/darkfindspodcast/\n\n\n\nPatreon 💯 https://www.patreon.com/darkfindspodcast/membership\n\n\n\nDark Finds IG 💀 https://www.instagram.com/dark.finds/\n\n\n\nDark Finds YouTube Channel 🎬 https://www.youtube.com/@DarkFindsChannel\n\n\n\nDark Finds Book 📖 https://amzn.eu/d/3VHPOTj\n\n\n\nDark Finds Website 👉🏼 www.darkfindsmedia.com\n\n\n#twinflame #cult #mansonfamily #dark #truecrimeaddict #horror #truecrimecommunity #crime #Cults, #CultPsychology, #CultLeaders, #MindControl, #Brainwashing, #HighControlGroups, #CoerciveControl, #ReligiousCults, #DangerousCults, #EscapeFromCults,\n\n#Jonestown, #NXIVM, #HeavensGate, #WacoSiege, #JimJones, #KeithRaniere, #CharlesManson, #DavidKoresh, #AumShinrikyo, #ChildrenOfGod,\n\n#Indoctrination, #Gaslighting, #IsolationTactics, #ThoughtReform, #Groupthink, #StockholmSyndrome, #Deprogramming, #ExitCounseling, #CultSurvivorStories, #SpiritualAbuse,\n\n#TrueCrimeCults, #CultSurvivorInterview, #ExCultMember, #CultDocumentaries, #RickAlanRossInterview, #CultExpert, #ModernCults, #OnlineCults, #DigitalManipulation, #CultRecruitmentTactics,",
      "release": "2025-07-11T04:59:40Z",
      "duration": "01:25:37",
      "explicit": false,
      "spotifyId": "3LdgR8jUCeq80XocNyYW9m",
      "appleId": 1000716657799,
      "youTubeId": "02VVsrx1Wx8",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3LdgR8jUCeq80XocNyYW9m",
        "apple": "https://podcasts.apple.com/podcast/rick-alan-ross-unveiling-the-dark-world-of-cults/id1738653309?i=1000716657799",
        "youtube": "https://www.youtube.com/watch?v=02VVsrx1Wx8"
      }
    },
    {
      "id": "ae2a701b-f2c1-422e-ab8a-29d9f2a4686b",
      "title": "Claire McAuliffe: Surviving a Cult, Reclaiming Identity \u0026 Embracing Spiritual Freedom",
      "description": "In this powerful and deeply moving interview, Claire McAuliffe shares her story of surviving life inside a cult — from the slow process of indoctrination to the psychological manipulation that kept her trapped. She speaks candidly about the fear tactics, the role of apocalyptic predictions, and how societal shifts impacted the cult\u0027s grip on its members.\n\nClaire opens up about her personal struggles with identity, faith, and family after leaving a strict religious community. She reflects on the mental health challenges caused by religious trauma and the process of rebuilding her life as a mother, a woman of faith, and a survivor.\n\nThrough heartfelt reflections on grief, education, and the healing power of nature, Claire reveals the resilience she discovered in the face of adversity. She discusses how sharing her story through her book and podcast appearances has helped others find hope—and how it continues to help her find peace.\n\nThis is more than a story about escaping a cult—it\u0027s a journey of transformation, self-discovery, and the enduring strength of the human spirit.\n\nWhat you\u0027ll learn:\nPeople often underestimate how they can end up in a cult.\nCult involvement is often a gradual process rather than a sudden decision.\nVulnerability can lead individuals to latch onto manipulative figures.\nSubmissive upbringing can condition individuals to accept abusive dynamics.\nFear of modernism was prevalent in cult environments.\nCult leaders often use predictions to maintain control over members.\nNarcissism plays a significant role in the behavior of cult leaders.\nFear mongering in media can mirror cult-like manipulation.\nPersonal experiences can shape one\u0027s understanding of societal changes.\nLeaving a cult often requires a significant psychological shift. The struggle with faith can deeply affect family life.\nLeaving a religious community often involves a complex identity journey.\nFinding comfort in spirituality can take many forms.\nRelationships can be challenging after leaving a strict community.\nResilience is often born from grief and personal challenges.\nEducation plays a crucial role in personal growth and understanding.\nReligious trauma can manifest in various ways, impacting mental health.\nIt\u0027s important to confront and understand one\u0027s past to heal.\nMaintaining connections with family can be difficult after leaving a community.\nPersonal experiences can enrich academic pursuits and understanding. Claire\u0027s relationship with her parents has been troubled, impacting her sense of support.\nResilience has been a key theme in Claire\u0027s journey, shaping her as a mother.\nThe importance of sharing personal stories to help others is emphasized.\nReflecting on life experiences can lead to personal growth and understanding.\nEmbracing uniqueness is crucial for self-acceptance and identity.\nHardship and struggle are essential for building resilience.\nConnecting with nature can provide therapeutic benefits and joy.\nSimple pleasures in life, like baking, can bring happiness and fulfillment.\nTeaching children self-sufficiency is vital for their independence.\nFinding joy in everyday moments is essential for a fulfilling life.\n\nKeywords\ncult survivor, psychological manipulation, religious movements, personal experience, fear mongering, predictions, narcissism, emotional abuse, modernism, societal changes, faith, family, identity, spirituality, resilience, education, religious trauma, personal growth, community, healing, family dynamics, resilience, personal growth, life lessons, nature, simplicity, hardship, personal stories, self-sufficiency, joy",
      "release": "2025-04-16T10:25:08Z",
      "duration": "01:50:09",
      "explicit": false,
      "spotifyId": "2gEbYePAb7cInftWQrRme1",
      "youTubeId": "L8imskN_Br0",
      "subjects": [
        "Order of St Charbel",
        "Society of Saint Pius X",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2gEbYePAb7cInftWQrRme1",
        "youtube": "https://www.youtube.com/watch?v=L8imskN_Br0"
      }
    },
    {
      "id": "92b102e3-0d23-45d1-ae92-8e3f91d55264",
      "title": "#27 - Ben Shenton - surviving Australia\u0027s most notorious cult \u0022The Family\u0022",
      "description": "On this week’s episode, I’m joined by Ben Shenton. Ben is a survivor of \u0022The Family,\u0022 a notorious New Age cult led by Anne Hamilton-Byrne. At 18 months old, Ben was handed over to Hamilton-Byrne, who falsely claimed to be his mother. Within the cult, children were subjected to severe abuse, including forced conformity through identical appearances and strict discipline. In 1987, at age 15, Shenton was among several children rescued during a police raid on the cult\u0027s property. ​Ben has since become an advocate for survivors of cults and abusive environments and works now as a pastor. He authored the book Life Behind The Wire, detailing his experiences within \u0022The Family\u0022 and his journey toward healing. Ben\u0027s website - https://www.rescuethefamily.com/ Dark Finds Podcast IG - https://www.instagram.com/darkfindspodcast/ Patreon - https://www.patreon.com/darkfindspodcast/membership Dark Finds IG - https://www.instagram.com/dark.finds/ Dark Finds YouTube Channel for more dark long-form content - https://www.youtube.com/@DarkFindsChannel Dark Finds book - https://amzn.eu/d/3VHPOTj Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-04-02T16:18:26Z",
      "duration": "01:30:44.1010000",
      "explicit": false,
      "spotifyId": "1MqCWLRydPOBtvRJT27vei",
      "appleId": 1000701925603,
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MqCWLRydPOBtvRJT27vei",
        "apple": "https://podcasts.apple.com/podcast/27-ben-shenton-surviving-australias-most-notorious/id1738653309?i=1000701925603"
      }
    }
  ]
}