{
  "id": "cee12b1d-7cb9-4d0a-ae75-710fb4cf3883",
  "name": "Dark Poutine - True Crime and Dark History",
  "spotifyId": "7FSV83QMTdqPsGqsQkFgJo",
  "appleId": 1304781389,
  "episodes": [
    {
      "id": "59d37936-12d6-4c7d-865b-d6c31c669b4e",
      "title": "Road Trip: Deadly Prophecy — The Children of Thunder",
      "description": "Episode 396: In this episode, we learn about an enigmatic narcissistic psychopath who led the Californian cult called The Children of Thunder. Glenn Taylor Helzer, and the other leadership was comprised of his brother Justin Helzer and their follower Dawn Godman. Raised in a strict Mormon home, Taylor’s life spiralled after years of mental health trouble. By 2000, the trio had formed a cult under Taylor’s delusional leadership. That summer, they murdered Ivan and Annette Stineman, Selina Bishop (daughter of guitarist Elvin Bishop), Jennifer Villarin, and James Gamble. The crime spree and investigation shocked authorities and families, exposing how Taylor twisted faith and loyalty into violence. Episode Sources: Shackles, Ski Masks and a Power Saw — Murderous Glenn Helzer and Justin Helzer called their cult The Children of Thunder — Crime Library How Not To Get Away With Murder: Glenn Helzer And The Children Of Thunder Glen Helzer | Wikipedia Body Parts Identified / Disparate Tragedies\u0027 Common Ground Is Death, Suspects Grisly clues unfolding in Delta case Blues Guitarist\u0027s Daughter Killed Murder, Madness and Mayhem by MIke Browne 20240418175434277_Cert Pet GlenTaylorHelzer People v. Helzer People v. Helzer, 317 Cal. Rptr. 3d 246 | Cal., Judgment, Law, casemine.com Justin Helzer hangs himself in prison Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-12-08T08:00:00Z",
      "duration": "01:04:41.2730000",
      "explicit": false,
      "spotifyId": "5dWsBkJYjflnAoEgFI6cAQ",
      "appleId": 1000740184965,
      "subjects": [
        "Glen Helzer"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5dWsBkJYjflnAoEgFI6cAQ",
        "apple": "https://podcasts.apple.com/podcast/road-trip-deadly-prophecy-the-children-of-thunder/id1304781389?i=1000740184965"
      }
    }
  ]
}