{
  "id": "d4e89b5e-9b4f-400b-9f2c-b2985e058357",
  "name": "Dark History",
  "spotifyId": "43q5OD7x3cPKx21DnupCks",
  "appleId": 1568505888,
  "youTubeChannelId": "UCtNdVINwfYFTQEEZgMiQ8FA",
  "episodes": [
    {
      "id": "dc87df64-5d6d-44fe-b84c-12761c90820f",
      "title": "190: The Mysterious Cult Leader Who Inspired Jonestown - Father Divine",
      "description": "Hi, friends! Happy Wednesday! What if I told you that one of the most influential... and mysterious cult leaders in American history is someone most people have never heard of? And that Jim Jones himself, yes Jonestown Jim Jones, got many of his ideas from same guy? Today, we’re diving into the wild and complicated story of Father Divine—the charismatic leader behind the Peace Mission Movement, a man who inspired millions, shaped pieces of the civil rights era, built entire communities from the ground up… and also demanded unwavering loyalty that crossed more than a few lines. This isn’t your typical cult story. It’s part spiritual revolution, part empire-building, part “wait, WHAT?!” And somehow still a chapter of American history no one talks about. And we should because it brings up an interesting question... Where’s the line between a movement that helps people… and one that controls them? And at what point does something become a cult? Let’s get into the Dark History of Father Divine. And when you\u0027re done... go check out my MMM episode about Jonestown: https://audioboom.com/posts/8164237-jonestown-massacre-apocalyptic-cult-who-was-jim-jones ________ FOLLOW ME AROUND Tik Tok: https://bit.ly/3e3jL9v Instagram: http://bit.ly/2nbO4PR Facebook: http://bit.ly/2mdZtK6 Twitter: http://bit.ly/2yT4BLV Pinterest: http://bit.ly/2mVpXnY Youtube: http://bit.ly/1HGw3Og Goodreads: http://bit.ly/3IVnO7N Snapchat: https://bit.ly/3cC0V9d Discord: https://discord.gg/BaileySarian RECOMMEND A STORY HERE: cases4bailey@gmail.com Business Related Emails: bailey@underscoretalent.com Business Related Mail: Bailey Sarian 4400 W. Riverside Dr., Ste 110-300 Burbank, CA 91505 ________ This podcast is Executive Produced by: Bailey Sarian and Joey Scavuzzo Head Writer: Allyson Philobos Senior Writer: Katie Burris Research provided by: Xander Elmore Additional research by: Dr. Thomas Messersmith Special thank you to our Historical Consultant: Poulomi Saha, Professor at UC Berkeley who writes and teaches about our cultural obsession with cults. Director: Brian Jaggers Edited by: Julien Perez Additional Editing: Maria Norris Hair: Angel Gonzalez Makeup: Nikki la Rose ________ Stop putting off those doctor\u0027s appointments and go to Zocdoc.com/DARKHISTORY to find and instantly book a top-rated doctor today. That’s Zocdoc.com/DARKHISTORY. For a limited time, visit AuraFrames.com and get $45 off Aura’s best-selling Carver Mat frames - named #1 by Wirecutter - by using promo code DARKHISTORY at checkout. Support the show by mentioning us at checkout. Terms and conditions apply. MasterClass always has great offers during the holidays, sometimes up to as much as 50% off. Head over to MASTERCLASS.com/DARKHISTORY for the current offer. Get started today at StitchFix.com/darkhistory to get $20 off your first order—and they’ll waive your styling fee. That’s StitchFix.com/darkhistory. ________",
      "release": "2025-11-26T08:15:00Z",
      "duration": "01:07:42.2640000",
      "explicit": false,
      "spotifyId": "1Nkgu6QzA5Zf4sEXISBvXU",
      "appleId": 1000738490734,
      "youTubeId": "y_iI7RVqoOQ",
      "subjects": [
        "International Peace Mission movement",
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Nkgu6QzA5Zf4sEXISBvXU",
        "apple": "https://podcasts.apple.com/podcast/the-mysterious-cult-leader-who-inspired-jonestown/id1568505888?i=1000738490734",
        "youtube": "https://www.youtube.com/watch?v=y_iI7RVqoOQ"
      }
    }
  ]
}