{
  "_ts": 0,
  "id": "d51cc110-3260-4544-b49b-48b3b3a0af1c",
  "name": "Dark Hearts with Stacy Lee",
  "spotifyId": "3dnyqptqMuY6HxbpewNiUt",
  "appleId": 1751330081,
  "youTubeChannelId": "UCu9SNFGpY_odhZT_LevkGvw",
  "episodes": [
    {
      "id": "c162459f-f6c0-42e1-b299-3fc4d0ff2ac9",
      "title": "Mysterious Deaths, Fraud and Abuse: The Angel\u0027s Landing Cult and Daniel Perez, It\u0027s Leader",
      "description": "Detective Ron Goodwyn was concerned when a mysterious man and his small group of cult followers moved into his area. Lou Castro was a man with no verifiable past. The more Ron Goodwyn looked into this group, the more he realized, something was not right. His investigation went nowhere because Lou Castro was not documented anywhere. That\u0027s because Lou Castro was not the leader\u0027s real name. It was Daniel Perez. When cult members begin dying in unusual and frequent accidents, Ron Goodwyn learns that they had had expensive life insurance policies and he begins to form an idea as to how Daniel Perez is funding his lavish lifestyle.\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com\n\nPodcast: Dark Hearts with Stacy Lee is on Apple, Spotify and Amazon",
      "release": "2025-03-13T23:00:48Z",
      "duration": "00:29:12",
      "explicit": false,
      "youTubeId": "oh60zbSQOZY",
      "subjects": [
        "Angel\u0027s Landing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oh60zbSQOZY"
      }
    },
    {
      "id": "69962fa0-9491-4bdc-857b-3566526e1f9d",
      "title": "Under the Banner of Heaven: Mormonism and Murder",
      "description": "The Lafferty brothers were raised in a very bizarre home and as they grew, their Mormon beliefs became more and more extreme. When Ron and Dan Lafferty declare themselves to be prophets of God, they are excommunicated from the Mormon church and their wives divorce them. The two men decide that their sister in law, Brenda Wright Lafferty, was to blame for their divorces and they target her and the people responsible for their shunning by the Mormon church. What follows is a brutal double murder after a story of religious extremism and strange beliefs ❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw \u0026#x1f4f8; Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr \u0026#x1f3b5; TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1 \u0026#x1f4b0; Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator \u0026#x1f4b5; CashApp: https://cash.app/$stacyleeDWD \u0026#x1f911; Venmo: https://www.venmo.com/u/DarkHeartsWithStacyLee \u0026#x1f4e7; Email: darkheartswithstacylee@gmail.com",
      "release": "2025-03-05T00:00:00",
      "duration": "00:30:39.3600000",
      "explicit": false,
      "spotifyId": "4UPmlXBlBEAHkhgthsig2Z",
      "appleId": 1000697835522,
      "youTubeId": "PJai92neO0E",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4UPmlXBlBEAHkhgthsig2Z",
        "apple": "https://podcasts.apple.com/podcast/under-the-banner-of-heaven-mormonism-and-murder/id1751330081?i=1000697835522",
        "youtube": "https://www.youtube.com/watch?v=PJai92neO0E"
      }
    },
    {
      "id": "16780cc2-d66f-4dcb-8275-43b4e4b0a95a",
      "title": "Abuse, torture and murder inside Chile\u0027s German run concentration camp, Colonia Dignidad",
      "description": "This is one of the darkest cult stories I\u0027ve ever covered. A former Nazi, Paul Schäfer cozies up to the Chilean dictator, Jorge Alessandri Rodriguez and together, they form a devious plan. Paul Schäfer is gifted a large plot of land and he begins moving his German cult followers to Chile. Soon, he has constructed a compound and people are no longer free to leave. Stories of abuse and child sexual abuse begin coming out of the cult but because of Schäfer\u0027s connections, nothing is done about it. A new dictator is put in place and things get much worse. Working with DINA in Chile, illegally held prisoners are kept at Colonia Dignidad and some are murdered. Over time, eleven hundred people go missing and are murdered at the cult compound. The families of cult members are demanding justice but it takes far too long for action.\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com\n\nPodcasts Dark Hearts with Stacy Lee, Dining With Death, and 15 Minute Mysteries are on Apple, Spotify and Amazon.",
      "release": "2025-02-14T00:00:27Z",
      "duration": "00:31:20",
      "explicit": false,
      "youTubeId": "bOoKgaxyTGw",
      "subjects": [
        "Colonia Dignidad"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bOoKgaxyTGw"
      }
    },
    {
      "id": "d9319a41-fc3e-4053-8c32-17a4e167cdd8",
      "title": "One of the worst cult stories I\u0027ve ever heard. Two sisters commit unthinkable acts of horror.",
      "description": "One night a man is setting up a new baby monitor. What he sees on the screen, he cannot believe. His monitor is picking up the feed from a different monitor from his neighborhood. He calls the police and what they find is something out of a horror film. Klara Mauerova and Katerina Mauerova have Klara\u0027s son Ondrej locked in the basement, where he has been for months. Just when this story cannot get any stranger, it does. Klara is the adoptive mother to a girl named Annika, who she claims is thirteen years old and suffering from leukemia. Annika is not who she appears to be and when she escapes, the police go on a year long manhunt to find this imposter. The two women are aided by Hana Bosova, Jan Scria and Jan Turek and you will simply not believe what these monsters are involved in.\n\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com\n\nPodcasts Dark Hearts with Stacy Lee, Dining With Death, and 15 Minute Mysteries are on Apple, Spotify and Amazon.",
      "release": "2025-01-17T00:00:15Z",
      "duration": "00:30:10",
      "explicit": false,
      "spotifyId": "4jolajWezyI6hQ9mIdG6IV",
      "appleId": 1000691345817,
      "youTubeId": "GcqluXwNCPI",
      "subjects": [
        "Kurim Case"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4jolajWezyI6hQ9mIdG6IV",
        "apple": "https://podcasts.apple.com/podcast/the-mauerova-cult-family-a-horrific-story/id1751330081?i=1000691345817",
        "youtube": "https://www.youtube.com/watch?v=GcqluXwNCPI"
      }
    },
    {
      "id": "acb28010-184e-4c01-ac40-0afabf673f56",
      "title": "Breath Of Fire Cult: The rise and downfall of Katie Griggs, Guru Jagat",
      "description": "The myth about Kundalini Yoga is that it is an ancient practice. The religion was, in fact, made up by Yogi Bhajan, Harbhajan Singh Khalsa who was once respected and even honored at the White House. Then, women began coming forward with horrific stories of psychological, physical and sexual abuse. Katie Griggs, Kundalini Katie, Guru Jagat then becomes the face of the Millennial Girl Boss yoga movement. She has tried to become famous through many means and finally, she is. She becomes radicalized by QAnon theories and right wing conspiracies. She is single handedly responsible for a lot of the new age to right wing conspiracy pipeline phenomenon we have witnessed. Guru Jagat creates a clothing line called Robotic Disaster and begins making a lot of money selling clothing and crystals and tonics. Behind closed doors, she is a tyrant who verbally abuses her employees and refuses to pay them what is owed. She breaks her ankle in Germany and suddenly, her empire comes crashing down ❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw \u0026#x1f4f8; Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr \u0026#x1f3b5; TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1 \u0026#x1f4b0; Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator \u0026#x1f4b5; CashApp: https://cash.app/$stacyleeDWD \u0026#x1f911; Venmo: https://www.venmo.com/u/DarkHeartsWithStacyLee \u0026#x1f4e7; Email: darkheartswithstacylee@gmail.com",
      "release": "2025-01-08T09:00:00Z",
      "duration": "00:33:59.5880000",
      "explicit": false,
      "spotifyId": "1MRJ0Si5GLmN2waf5IR7me",
      "appleId": 1000683145014,
      "subjects": [
        "Guru Jagat",
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MRJ0Si5GLmN2waf5IR7me",
        "apple": "https://podcasts.apple.com/podcast/breath-of-fire-cult-the-rise-and-downfall-of/id1751330081?i=1000683145014"
      }
    },
    {
      "id": "b15d1db3-f09a-40df-9d39-6291bc997a42",
      "title": "House of Yahweh Cult",
      "description": "Today we are talking about the dangerous and insidious Texas cult known as The House of Yahweh. A man named Buffalo Bill Hawkins and his brother JG change their names to Yisrayl and Yaaqob and state that they are The Two Witnesses prophesied in the Book of Revelations. They gather a small following and before long, as in all cults, everything gets dark. Children are horrifically abused. Women are treated like cattle. Fire and brimstone reign down from Yisrayll\u0027s pulpit and he begins making predictions about the end of the world. He steals money, he starves his followers, he abuses everyone involved and then the authorities get involved. Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations",
      "release": "2024-12-04T11:20:00Z",
      "duration": "00:37:49.9100000",
      "explicit": false,
      "spotifyId": "6hsQ6MJTFKcsZdOHiRBbY6",
      "appleId": 1000679198040,
      "youTubeId": "GzXZpNxfmdo",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6hsQ6MJTFKcsZdOHiRBbY6",
        "apple": "https://podcasts.apple.com/podcast/house-of-yahweh-cult/id1751330081?i=1000679198040",
        "youtube": "https://www.youtube.com/watch?v=GzXZpNxfmdo"
      }
    },
    {
      "id": "acca0810-64df-46b7-b05f-6e471c6e73ae",
      "title": "Shocking allegations from inside America\u0027s biggest spiritual movement. Was Guru Jagat a liar?",
      "description": "Today we are talking about the birth and growth of Kundalini Yoga in America, something that was first thought to be an ancient practice, now known to be totally fabricated by it\u0027s founder, Yogi Bhajan. After his death, a woman named Katie Griggs rose to take his place at the helm of this rich and powerful cult, owner of 3HO Corporation and all it\u0027s subsidiaries as well as the Ra Ma Institute. Katie claims to have had a very special relationship with Yogi Bhajan. Now it appears she never even met the man. Allegations come out in 2019 that forever changes the way the world will remember Yogi Bhajan. Guru Jagat, formerly Katie Griggs, denied the allegations and continued to build the massive corporation, spending money like there was a never ending supply. She fell down the hole of conspiracy theories, QAnon, Covid denial, and is largely responsible for the New Age to Right Wing pipeline phenomena we have witnessed. And then, suddenly, it was all over with.\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-11-15T00:00:00Z",
      "duration": "00:42:55",
      "explicit": false,
      "youTubeId": "1YB8VCIUkLc",
      "subjects": [
        "Guru Jagat",
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1YB8VCIUkLc"
      }
    },
    {
      "id": "33bdd95b-149e-48bc-94e8-834b147beaa3",
      "title": "Three Breaking Stories!",
      "description": "Today I\u0027ve got three brand new stories that I will continue to follow and update as they progress. We are talking about Timothy Murphy-Johnson and the death of his wife Molly, JP Miller and the death of his wife Mica, and then a very strange and goofy story unfolding on TikTok. A man named Michael Guzman who uses the handle Rebuilding Atlantis has offered his land in Texas for anyone to come and live on it for free. Is this the start of a new cult? Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-11-13T11:00:00Z",
      "duration": "00:40:19.7740000",
      "explicit": false,
      "spotifyId": "62crQHyxaY1bnRgKHBQhkm",
      "appleId": 1000676787608,
      "youTubeId": "oGEq0zkdiYU",
      "subjects": [
        "Solid Rock Ministries",
        "Michael Guzman"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/62crQHyxaY1bnRgKHBQhkm",
        "apple": "https://podcasts.apple.com/podcast/three-breaking-stories/id1751330081?i=1000676787608",
        "youtube": "https://www.youtube.com/watch?v=oGEq0zkdiYU"
      }
    },
    {
      "id": "c9998894-ca3b-410f-908c-3d14c825acc3",
      "title": "Speedos, muscles, plastic surgery and....spirituality? Meet the kookiest cult yet..Buddhafield",
      "description": "Today we are taking a deep dive into the insane world of Jaime Gomez who also called himself Michel, Andreas, The Teacher, The Master and Reyji. We talk about how the cult grew in Hollywood after Jaime failed to make it as an actor, and then moved to Austin where it built the One World Theater, now owned by Joe Rogan, to produce ballets. Jaime Gomez put his cult members through two years of practice for a ballet that was never seen by anyone. The members of this cult worshipped Jaime. They gave him massages all day. They cooked his meals. They bought his food. They paid his expenses. But then, when it got out that Jaime was having sex with the male members, and abusing others, it all started to fall apart. Then the documentary, Holy Hell came out and it was all downhill from there.\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-10-17T23:00:06Z",
      "duration": "00:37:55",
      "explicit": false,
      "youTubeId": "qo36ADMEaqk",
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qo36ADMEaqk"
      }
    },
    {
      "id": "4882aa9c-5105-44d0-a2a0-5227092e23bd",
      "title": "Everything You Need to Know About The Diddy Lawsuit!",
      "description": "Is the Diddy lawsuit the biggest scandal to hit Hollywood in decades? Will this be the end of Sean Combs\u0027 music empire? Uncover the shocking truth behind the Diddy scandal in this riveting episode of Dark Hearts with Stacy Lee!\n\nDive deep into the explosive allegations against Sean \u0022Diddy\u0022 Combs, from Cassie Ventura\u0027s bombshell lawsuit to the multiple victims coming forward. We\u0027ll explore the dark underbelly of celebrity crime, examining the Hollywood scandals that have rocked the entertainment industry to its core.\n\nJoin host Stacy Lee as she guides you through this gripping true crime podcast. Today she uncovers the Diddy controversy 2023 and its far-reaching implications. From the $100 million judgment to the alleged Illuminati conspiracy, no stone is left unturned in this explosive investigation.\n\nWhether you\u0027re a true crime enthusiast or just fascinated by celebrity downfalls, this episode of Dark Hearts will keep you on the edge of your seat. Don\u0027t miss out on one of the most shocking stories in recent Hollywood history!\n\nSubscribe to \u0022Dark Hearts with Stacy Lee\u0022 on Apple Podcasts and Spotify to stay updated on the latest celebrity crimes and scandals. Follow Stacy on TikTok, Instagram, and Facebook for more true crime content. Support the podcast by checking out the fundraiser video on Stacy\u0027s channel. Let\u0027s uncover the truth behind these dark Hollywood secrets together! Thank you for your continued support! 🖤\n\n🕰️ Chapters 🕰️\n00:00 - Introduction\n02:10 - Timeline of Allegations (1990-2010)\n12:09 - Cassie Ventura \u0026 Diddy - The Beginning\n20:06 - Cassie Ventura\u0027s Lawsuit and Video Evidence\n26:25 - Homeland Security Raids Diddy’s Homes\n35:50 - The \u0022Freak Off\u0022 Parties and Celebrity Involvement\n38:09 - Rumors and Latest Lawsuits\n40:15 - Closing Thoughts and What\u0027s Next\n\n❤️ Subscribe: [Dark Hearts with Stacy Lee](https://www.youtube.com/@darkheartswithstacylee)\n📸 Instagram: [darkheartswithstacylee](https://www.instagram.com/darkheartswithstacylee)\n🎵 TikTok: [darkheartswithstacylee](https://www.tiktok.com/@darkheartswithstacylee)\n💰 Patreon: [DarkHeartswithStacyLee](https://www.patreon.com/DarkHeartswithStacyLee)\n💵 CashApp: [stacyleeDWD](https://cash.app/$stacyleeDWD)\n🤑 Venmo: [DarkHeartsWithStacyLee](https://www.venmo.com/u/DarkHeartsWithStacyLee)\n📧 Email: [darkheartswithstacylee@gmail.com](mailto:darkheartswithstacylee@gmail.com)\n\nTags (ignore): Dark Hearts with Stacy Lee, Diddy Scandal, Celebrity Crime, Sean Combs Allegations, Hollywood Scandals, True Crime Podcast, Diddy Lawsuit, Cassie Ventura Allegations, Illuminati Conspiracy, Diddy Controversy 2023",
      "release": "2024-10-15T23:00:27Z",
      "duration": "00:42:42",
      "explicit": false,
      "youTubeId": "Kw3r8q_xzpU",
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kw3r8q_xzpU"
      }
    },
    {
      "id": "df03750e-ec8a-44a5-a508-1c3be8deb907",
      "title": "Cult of Falun Gon",
      "description": "You\u0027ve seen the posters advertising for Shen Yun Dance, a traveling Chinese dance troupe that comes to your town every so often. But did you know, Shen Yun is part of a very dangerous and insidious cult called Falun Gong? This cult deprives people of their freedom, their money, their personal possessions, and their individuality. It makes millions each year on the Shen Yun shows, the dancers in which are basically slaves. Falun Gong is also involved in a massive propaganda effort for the extreme right wing that includes the media outlet, The Epoch Times. Join me for this disturbing tale that reminds us, things that look beautiful from the outside are often hiding something very sinister inside. Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-10-14T10:00:00Z",
      "duration": "00:42:43.8130000",
      "explicit": false,
      "spotifyId": "3XJEOvRDIHs7S0X3MpQBPK",
      "appleId": 1000673007506,
      "youTubeId": "QI8nCZ-EcMM",
      "subjects": [
        "Falun Gong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XJEOvRDIHs7S0X3MpQBPK",
        "apple": "https://podcasts.apple.com/podcast/cult-of-falun-gon/id1751330081?i=1000673007506",
        "youtube": "https://www.youtube.com/watch?v=QI8nCZ-EcMM"
      }
    },
    {
      "id": "63b4d18b-e652-4309-a529-9d97f3a74b4a",
      "title": "Jesus wants you to have an AR-15! Bejeweled crowns, fancy robes \u0026 lots and lots of guns...for Jesus",
      "description": "This is one of the wackiest cults I\u0027ve ever covered. Sean Moon, (Hyung Jin Sean Moon) son of Sun Myung Moon, founder of the cult commonly known as The Moonies, has started his own cult and it\u0027s even crazier than The Moonies. Sean believes The Rod of Iron mentioned in the Bible is not the word of god, or a metaphor for holding fast to the rod in order to return to heaven. Sean believes The Rod of Iron mentioned in the Bible is an actual AR-15. This cult is not just obsessed with guns, it actually worships guns. The cult is dangerous and its members are unhinged. This cult is homophobic, misogynistic, transphobic and anti-Constitution. It\u0027s also ridiculous and hilarious...well at least it would be if it weren\u0027t so scary.\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-09-26T23:00:40Z",
      "duration": "00:36:24",
      "explicit": false,
      "youTubeId": "fk_MzY0M_4k",
      "subjects": [
        "Rod of Iron Ministries",
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fk_MzY0M_4k"
      }
    },
    {
      "id": "8ac319ae-f64c-4f45-a475-54272a4400d6",
      "title": "Knights of The Crystal Blade",
      "description": "Two Mormon Fundamentalist men with some very strange ideas take their children into the Southern Utah desert to wait out what they believe to be the coming apocalypse. Samuel Shaffer and John Alvin Coltharp take their children, two boys and four girls under the age of eight and hide them from the law and their mothers. When the cops finally catch up to them, they almost cannot believe the stories the children have to tell but they must because they are all true. The level of abuse is unthinkable and the level of delusion is disturbing. What leads to this kind of paranoia and mental instability? My opinion might surprise you. Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-09-18T10:00:00Z",
      "duration": "00:43:12.2930000",
      "explicit": false,
      "spotifyId": "2z1qCdBmnrodaHIGx83rNb",
      "appleId": 1000669921897,
      "subjects": [
        "Knights of The Crystal Blade"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2z1qCdBmnrodaHIGx83rNb",
        "apple": "https://podcasts.apple.com/podcast/knights-of-the-crystal-blade/id1751330081?i=1000669921897"
      }
    },
    {
      "id": "3aaaf018-77e2-42f7-923b-62197c1ad922",
      "title": "The Amish Serial Killer",
      "description": "A little boy is found frozen and wrapped in a blue blanket on the side of a rural Nebraska road on Christmas Eve. For years, his identity is unknown. And then, as men begin turning up murdered first in Colorado and then in Texas, the police connect their killer to the little boy\u0027s father. Eli Stutzman left the Amish community behind him and walked into a world of drugs, alcohol and murder. Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-09-11T10:00:00Z",
      "duration": "00:33:13.9520000",
      "explicit": false,
      "spotifyId": "4Ccx13iuE4mwZ0AJEjv0eq",
      "appleId": 1000669132781,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Ccx13iuE4mwZ0AJEjv0eq",
        "apple": "https://podcasts.apple.com/podcast/the-amish-serial-killer/id1751330081?i=1000669132781"
      }
    },
    {
      "id": "e0cfe2ea-0403-4ab5-acb8-c512c005f8ec",
      "title": "Why I left the Mormon Church? (Almost got killed)",
      "description": "Why I left the Mormon Church? \n\nWhat dark secrets lie beneath its seemingly perfect facade? How does one find freedom after years of indoctrination? Uncover the answers to these questions in today\u0027s raw and emotional episode of Dark Hearts with Stacy Lee!\n\nIn this deeply personal story, I share my Mormon Church exit story. I share my experiences growing up in Utah Mormon culture and the challenges I faced in my faith journey. From confronting controversial Mormon doctrines to healing from religious trauma, this episode explores the complexities of life after Mormonism.\n\nJoin me, Stacy Lee, as I guide you through my transformation from devout Mormon to finding freedom beyond religion. We\u0027ll examine the Mormon Church\u0027s stance on social issues, the impact of religious indoctrination, and the path to healing after leaving a high-demand faith. Whether you\u0027re questioning your beliefs or interested in understanding religious trauma, this episode of Dark Hearts will resonate deeply.\n\nSubscribe to \u0022Dark Hearts with Stacy Lee\u0022 on Apple Podcasts and Spotify to stay updated on more personal stories and investigations. Follow Stacy on TikTok, Instagram, and Facebook for additional content. Support the podcast by checking out the fundraiser video on Stacy\u0027s channel. Let\u0027s continue to shed light on these important topics together! 🖤\n\n🕰️ Chapters 🕰️\n\n00:00 - Welcome to Dark Hearts with Stacy Lee\n01:21 - Background of Stacy\n03:01 - Growing Up Mormon in Utah\n08:31 - Stacy’s Battles \u0026 Challenges\n12:57 - Early Doubts \u0026 Challenges with Mormonism\n19:09 - Marriage \u0026 Strange Church Culture\n23:13 - Divorce \u0026 Remarriage\n29:16 - Struggles with Church Culture \u0026 Doctrine\n38:01 - The Breaking Point\n42:11 - “Shelf” in Mormonism \u0026 Proposition 8\n48:01 - Leaving the Church and Its Aftermath\n55:11 - The Rabbit Hole: Researching Church History\n58:08 - Family Relationships and Personal Growth\n01:00:00 - Closing Remarks\n\n❤️ Subscribe: [Dark Hearts with Stacy Lee](https://www.youtube.com/@DarkHeartswithStacyLee)\n📸 Instagram: [darkheartswithstacylee](https://www.instagram.com/darkheartswithstacylee)\n🎵 TikTok: [darkheartswithstacylee](https://www.tiktok.com/@darkheartswithstacylee)\n💰 Patreon: [DarkHeartswithStacyLee](https://www.patreon.com/DarkHeartswithStacyLee)\n💵 CashApp: [stacyleeDWD](https://cash.app/$stacyleeDWD)\n🤑 Venmo: [DarkHeartsWithStacyLee](https://www.venmo.com/u/DarkHeartsWithStacyLee)\n📧 Email: [darkheartswithstacylee@gmail.com](mailto:darkheartswithstacylee@gmail.com)\n\ntags (ignore)\n#DarkHeartsWithStacyLee #TrueCrimePodcast #MormonChurchExitStory #Mormonism #ExMormonTestimony #MormonStory #LifeAfterMormonism #MormonChurch #UtahMormonCulture #FaithJourney #HealingFromReligion #ReligiousTrauma #MormonControversies #LifeTransformation #ReligiousIndoctrination #FindingFreedom #Doctrines",
      "release": "2024-09-05T22:00:06Z",
      "duration": "01:00:45",
      "explicit": false,
      "youTubeId": "Gym7dN_y9Ns",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Gym7dN_y9Ns"
      }
    },
    {
      "id": "d6b5a2d7-b206-4ea2-8bd8-d3763c65954c",
      "title": "The wackiest and most ugly p*do cult",
      "description": "What sinister cults lurked in the shadows of Cedar City, Utah? Learn the chilling story of the Knights of the Crystal Blade in this bone-chilling episode of Dark Hearts with Stacy Lee!\n\nUncover the dark history of Mormon cults and religious fanaticism as we explore the disturbing case of the Knights of the Crystal Blade. From the isolated deserts near Southern Utah University to the twisted interpretations of the Book of Revelations, this true crime podcast episode unravels a tale of child brides and apocalyptic beliefs that will leave you stunned.\n\nJoin host Stacy Lee as she guides you through this riveting crime story, connecting the dots between Cedar City\u0027s past, including the infamous Dog Valley Murder, and other shocking cult cases like Lori Vallow and Chad Daybell. Whether you\u0027re a true crime enthusiast or new to the genre, this episode of Dark Hearts will keep you on the edge of your seat.\n\nSubscribe to \u0022Dark Hearts with Stacy Lee\u0022 on Apple Podcasts and Spotify for more gripping true crime podcasts. Follow Stacy on social media for exclusive content and updates. Support the show by checking out the fundraiser video on Stacy\u0027s channel. Let\u0027s uncover these dark mysteries together! Thank you for your continued support! 🖤\n\n🕰️ Chapters 🕰️\n\n00:00 - Welcome to Dark Hearts with Stacy Lee\n01:42 - Background of Cedar city, Utah\n05:40 - Wawa Mountains and their Appeal\n06:44 - Eugene Richardson, Mormon fundamentalism \u0026 FLDS\n09:22 - Eugene Richardson\u0027s online connections\n12:12 - Introduction to Samuel Schaeffer and John Alvin Culltharp\n13:14 - Samuel Schaeffer\u0027s bizarre writings and visions\n16:05 - The Knights of the Crystal Blade\u0027s disturbing plans\n19:07 - The Book of Revelations\n20:58 - Recruitment of Cult Members and Land Acquisition\n24:47 - Investigation and Search for Missing Children\n27:10 - Discovery and Rescue of the Children\n28:27 - Arrests and Charges against Schaeffer and Coltharp\n29:39 - Additional Details about the Children\u0027s Living Conditions\n37:10 - Final Thoughts \u0026 Closing Remarks\n\n\n❤️ Subscribe: [Dark Hearts with Stacy Lee](https://www.youtube.com/@DarkHeartswithStacyLee)\n📸 Instagram: [darkheartswithstacylee](https://www.instagram.com/darkheartswithstacylee)\n🎵 TikTok: [darkheartswithstacylee](https://www.tiktok.com/@darkheartswithstacylee)\n💰 Patreon: [DarkHeartswithStacyLee](https://www.patreon.com/DarkHeartswithStacyLee)\n💵 CashApp: [stacyleeDWD](https://cash.app/$stacyleeDWD)\n🤑 Venmo: [DarkHeartsWithStacyLee](https://www.venmo.com/u/DarkHeartsWithStacyLee)\n📧 Email: [darkheartswithstacylee@gmail.com](mailto:darkheartswithstacylee@gmail.com)\n\ntags (ignore)\n\n#truecrimepodcasts  #cults  #cedarcity  #darkhistory  #crimestories  #KnightsOfTheCrystalBlade #bookofrevelations  #FLDS #MormonCults #ReligiousFanaticism #DogValleyMurder #lorivallowtrial   #chaddaybell  #SouthernUtahUniversity",
      "release": "2024-08-22T22:30:06Z",
      "duration": "00:39:44",
      "explicit": false,
      "youTubeId": "VnqwgL8ehKM",
      "subjects": [
        "Knights of The Crystal Blade"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VnqwgL8ehKM"
      }
    },
    {
      "id": "d2eff98c-162d-40cd-8396-0dbcb8b81a3c",
      "title": "The Trad Wife Controversy *Podcast Exclusive*",
      "description": "*Podcast Exclusive* Today we are discussing the rising phenomenon of \u0022trad wives\u0022 which is slang or traditional wife; a woman who stays home, takes a back seat to her husband, cooks for him, cleans for him, and has lots of babies. We talk about Nara Smith and other trad wife content creators and then we discuss a very recent controversy involving Hannah Neeleman who is known on social media as Ballerina Farm. What is this new \u0022trad wife\u0022 movement and how is this antifeminist sentiment affecting women not only in America but around the world? Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-08-07T10:00:00Z",
      "duration": "00:41:10.3210000",
      "explicit": false,
      "spotifyId": "0PctP8rv8D65CeEVVCvRkl",
      "appleId": 1000664582562,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PctP8rv8D65CeEVVCvRkl",
        "apple": "https://podcasts.apple.com/podcast/the-trad-wife-controversy-podcast-exclusive/id1751330081?i=1000664582562"
      }
    },
    {
      "id": "66c10fd5-ac45-4825-81a2-838dd6b6e3b0",
      "title": "Trad Wives: from Hannah Neeleman to Tom Green \u0026 FLDS - Inside Mormon and polygamist cults",
      "description": "The controversial world of Mormons and polygamy collide in this explosive episode of the best true crime podcast you can\u0027t miss! Is there a connection between billionaire David Neeleman\u0027s son and the FLDS? Is Hannah Neeleman, wife of JetBlue founder David Neeleman, secretly involved in a modern-day Mormon cult? As we peel back the layers of these religious cults, we ask: Are these true crime stories more than they appear? \n\nFrom the infamous Tom Green polygamist to the hidden compounds of polygamist groups, we journey through the dark underbelly of Mormonism and its offshoots. Famous cult leaders, secret ceremonies, and the struggle against oppressive traditions – it\u0027s all here in this gripping episode. With insider knowledge from Stacy\u0027s own Mormon upbringing, this episode delves deep into conspiracy theories surrounding these secretive communities. Join host Stacy Lee as she navigates the treacherous waters of Mormon cults and uncovers the Hannah Neeleman drama that\u0027s set the internet ablaze. Is there more to this conspiracy theory than meets the eye? Tune in to find out!\n\nSubscribe to support the podcast and stay tuned for more spine-chilling episodes! Follow Stacy on TT, IG, and FB, and check out her podcasts on Apple and Spotify - Dining With Death and Dark Hearts. Thank you for your continued support! ❤️🖤\n\n🕰️ Chapters 🕰️\n\n00:00 - Introduction by Stacey Lee\n00:56 - Mormon Influencers and Cold Cases\n01:22 - Hannah Neeleman Introduction\n01:54 - Discussion on Tradwives and Mormonism\n02:12 - Tom Green and His Criminal Activities\n03:26 - Brief Biography of Tom Green\n04:51 - Mormon Practices and Personal Experience\n05:17 - Old Mormonism and FLDS\n05:58 - Historical Context: Utah\u0027s Statehood and Polygamy\n06:40 - Tom Green\u0027s Transition to Polygamy\n08:00 - Mormonism\u0027s Influence on Daily Life\n10:00 - Leaving Mormonism\n12:26 - Why Don\u0027t Women Just Leave?\n13:39 - Current Controversy: Hannah Neeleman\n16:14 - Hannah\u0027s Marriage to Daniel Neeleman and Their Lifestyle\n19:30 - Interview with Hannah Neeleman and Its Aftermath\n21:30 - Birthday Incident\n23:45 - Mormon Martyr Syndrome\n26:00 - Role of Social Media in Perpetuating Myths\n29:00 - Tapestry Against Polygamy\n34:40 - Tom Green\u0027s Welfare Fraud\n37:18 - Trial of Tom Green\n40:20 - Final Thoughts and Closing Remarks\n\n\n❤️ Subscribe: [Dark Hearts with Stacy Lee](https://www.youtube.com/@darkheartswithstacylee)\n📸 Instagram: [darkheartswithstacylee](https://www.instagram.com/darkheartswithstacylee)\n🎵 TikTok: [darkheartswithstacylee](https://www.tiktok.com/@darkheartswithstacylee)\n💰 Patreon: [DarkHeartswithStacyLee](https://www.patreon.com/DarkHeartswithStacyLee)\n💵 CashApp: [stacyleeDWD](https://cash.app/$stacyleeDWD)\n🤑 Venmo: [DarkHeartsWithStacyLee](https://www.venmo.com/u/DarkHeartsWithStacyLee)\n📧 Email: [darkheartswithstacylee@gmail.com](mailto:darkheartswithstacylee@gmail.com)",
      "release": "2024-08-07T01:00:07Z",
      "duration": "00:43:47",
      "explicit": false,
      "youTubeId": "zZ6QUdVmIGA",
      "subjects": [
        "FLDS Church",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zZ6QUdVmIGA"
      }
    },
    {
      "id": "6d76101e-d17f-4760-8392-ef32d6e330ff",
      "title": "The Cult of Anastasia: A Dangerous New Movement",
      "description": "Today we are talking about an anti-semitic cult that has invaded Germany. The members use a series of fantasy books called Anastasia The Ringing Cedars as their guide. The books, written by Vladimir Megre are racist, misogynistic, and poorly written to boot. I have a very strange personal story about a woman who attempted to introduce me to this cult and I share that story here. This is a kooky story but also a cautionary tale. The German government is concerned about this movement...and it wants to make sure history does not repeat itself. Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-07-17T10:00:00Z",
      "duration": "00:37:31.8590000",
      "explicit": false,
      "spotifyId": "54AQbpC0P7Q1Lq20g5cWPg",
      "appleId": 1000662508065,
      "youTubeId": "dWX-XcYCjsM",
      "subjects": [
        "Anastasia"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/54AQbpC0P7Q1Lq20g5cWPg",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-anastasia-a-dangerous-new-movement/id1751330081?i=1000662508065",
        "youtube": "https://www.youtube.com/watch?v=dWX-XcYCjsM"
      }
    },
    {
      "id": "07952e7c-99e8-4a72-a614-f21ca122ffc7",
      "title": "The LeBaron Cult Murders",
      "description": "A violent polygamous sect of the FLDS, Fundamentalist Latter Day Saint cult goes to war with each other with two brothers both claiming to be The One Mighty and Strong. These self proclaimed prophets leave a trail of broken people, ruined lives and murder in their wake. Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-06-07T04:03:40Z",
      "duration": "00:34:19.0550000",
      "explicit": false,
      "spotifyId": "47uWtpvtEFowToLkyJgyy8",
      "appleId": 1000658491029,
      "subjects": [
        "Church of the First Born of the Lamb of God",
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/47uWtpvtEFowToLkyJgyy8",
        "apple": "https://podcasts.apple.com/podcast/the-lebaron-cult-murders/id1751330081?i=1000658491029"
      }
    },
    {
      "id": "872c93c3-902c-4f10-8c82-228584280501",
      "title": "The Manacled Mormon",
      "description": "Sexy Joyce McKinney falls head over heels for Kirk Anderson at BYU, Brigham Young University. Joyce seduces Kirk which is a very big problem because Kirk is supposed to be celibate before his Mormon Mission to London. When he leaves on that mission, he believes he is free of Joyce. He is very, very wrong. This is a story of true obsession that will soon be made into a film called Sinner vs. Saints. Support this podcast at — https://redcircle.com/dark-hearts-with-stacy-lee-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-06-07T03:58:45Z",
      "duration": "00:33:22.8860000",
      "explicit": false,
      "spotifyId": "1NuslfExboNVsuCME6tBdV",
      "appleId": 1000658491333,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1NuslfExboNVsuCME6tBdV",
        "apple": "https://podcasts.apple.com/podcast/the-manacled-mormon/id1751330081?i=1000658491333"
      }
    },
    {
      "id": "2af54186-57ee-4de0-af4f-9cc5099f243a",
      "title": "Hold on to ya hats! Lies, cheating and falling down for Jesus! One of the wackiest cults of late!",
      "description": "I don\u0027t even know where to begin with this one. David E. Taylor is a charlatan and conman who is bilking the faithful for millions of dollars to fund his lavish lifestyle and pay for all the gifts he gives his many girlfriends. There are accusations of slave labor inside the \u0022church\u0022 called JMMI and the \u0022church\u0022 called KOGGC. David E. Taylor makes wild claims that he can heal the sick, bring sight to the blind, give hearing to the deaf, make the disabled walk and that he can even raise the dead! He claims to be able to time travel and he says he has face to face meetings with Jesus on a regular basis. Many people have been conned and lost up to a million dollars for following this evil man and we need to get the word out about him. When I tell you these sermons are otherworldly? I mean that pretty literally.\n\nFollow me on TT, on IG, on FB and of course subscribe if you want to see more from me. I truly appreciate each and every one of you and I hope you\u0027re doing well! ❤️ Stacy\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-05-30T17:00:36Z",
      "duration": "00:36:58",
      "explicit": false,
      "youTubeId": "p7unhMCdBGM",
      "subjects": [
        "Joshua Media Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=p7unhMCdBGM"
      }
    },
    {
      "id": "48d650ec-12fa-470f-a1f8-c0a823993735",
      "title": "Lives are destroyed when a very dark and naughty secret comes out in a large friend group of Mormons",
      "description": "In this Video Lives are destroyed when a very dark and naughty secret comes out in a large friend group of Mormons, This Video was Created by Dark Hearts with Stacy Lee YouTube channel. #crimestories #truecrimecommunity #crime #TaylorPaul #missingperson #breakingnews. This Video We discuss the recent scandal known as the Mormon Utah Swingers Scandal. \n\nTaylor Frankie Paul and her then husband Tate have a large group of friends in Draper, Utah. Taylor starts posting some very strange videos on social media that make people wonder just what is going on between these friends. Then, the group admits, they are swinging but claim to be \u0022soft swingers.\u0022\nWe talk about the very bizarre current culture at BYU involving soaking and other...ahem...loopholes and how this plays into Mormons who are having a hard time finding their place and following the rules in side Mormonism. \nSo many of you have requested to hear more about Mormonism and this all plays into the larger conversation as to why we are seeing so many Mormons involved in serious and strange crimes as of late.\nThis is very far out of my usual wheelhouse, but it will all make sense as we continue to discuss Mormonism.\n\nVideo Timestamps--\n0:00 - Intro\n0:43 - This ridiculous story \n2:13 - covered in tattoos regularly tell stories\n3:02 - why I left the Mormon Church\n4:10 - Scandal I\u0027m your host Stacy Lee let\u0027s begin\n5:39 - isn\u0027t a drama channel it\u0027s a true crime and dark stories \n6:13 - Provo Utah owned and operated by the Mormon \n8:42 - the negative attention these videos \n10:32 - kids or plagues or kidnappings\n12:24 - Mormonism but about high demand\n14:21 - Tik Tok every Community ends with the word talk\n15:49 - Mormon woman \n\nFollow me on TT, on IG, on FB and of course you can join my Patreon. There is a video on my channel entitled Fundraiser that explains what we are raising money for. Thank you so much for the support. I appreciate each and every one of you. ❤️ Stacy\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-04-25T17:00:30Z",
      "duration": "00:44:19",
      "explicit": false,
      "youTubeId": "WHw243vjQwc",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WHw243vjQwc"
      }
    },
    {
      "id": "af76d67f-9a91-4fc7-9033-d28d80f7aa5a",
      "title": "Polygamy, Child Labor and The End Of The World: The House of Yahweh is one crazy cult",
      "description": "In this Videos Yahweh ben Yahweh - Polygamy, child labor and the end of the world: The House of Yahweh is one crazy cult. This Video Created by Stacy Lee True Crime and Dark Hearts with Stacy Lee YouTube Channel. #truecrimecommunity #yahweh #houseofyahweh #crimestories \n\nWe discuss Yisroel Hawkins and the cult he started called The House of Yahweh. Yisrayl was born Buffalo Bill Hawkins but soon changed his name after failing at everything he tried and then finding God. He and his brother JG, who changed his name to Yaqoob claim to the The Two Witnesses from the Book of Revelations. \n\nYisrayl began claiming he could predict future events and when the Waco standoff and the Heaven\u0027s Gate events occurred, he stated he foresaw those events. Then he begins predicting the end of the world, over and over. Soon people around the cult\u0027s compound begin to notice some very disturbing things and then the authorities get involved.\nJoin me for this very bizarre story of bigamy, illegal contact with minor females and forced child labor as we discuss why it\u0027s so important to keep an eye on these extremists.\n\nVideo Timestamps ----\n0:00 - intro\n0:30 - here we\u0027re also in the midst of a fundraiser for a very important cause \n1:42 - fundamentalist Latter-Day Saint cult \n2:29 - Israel rode around town on a pony smoking\n3:28 - JG Hawkins came back to America \n3:51 - the Jewish scriptures the name of God is a mystery the letters of God\u0027s\n6:17 - Truth does not exist on the earth\n8:18 - have a different story \n9:28 - the Bible so in today\u0027s story it\u0027s important to recognize the lore \n10:15 - sword of God we have the hser brothers remember them from the children \n11:41 - only true church the leaders of the House of Yahweh begin preaching \n12:37 - I think there are some great lessons to be learned in the books \n13:37 - Buffalo Bill Israel gets very into\n14:32 - David Kesh a self-proclaimed Prophet had Hup \n15:58 - prophet just know it he has predicted this\n17:29 - the House of Yahweh followers had legally changed their last names \n20:00 - physically thrown out of the compound by armed guards with Heron\n\nRelated Hashtags: #Yahweh #TrueCrime #CrimeStory #UnsolvedMystery #InvestigationDiscovery #MurderMystery #CrimeScene #truecrimecommunity  #ForensicFiles #crime_news #crimehistory #crimestories #crime #usanews #story #crimetime #DarkHeartswithStacyLee #yahwehyireh \n\nFollow me on TT, on IG and you can also join my Patreon. That helps keep the videos coming. You can also donate to our fundraiser, raising money to donate to police departments. All that information is at the end of this video. Love to all and thank you so much for your continued support ❤️ Stacy\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-04-18T17:00:13Z",
      "duration": "00:39:03",
      "explicit": false,
      "youTubeId": "GzXZpNxfmdo",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GzXZpNxfmdo"
      }
    },
    {
      "id": "83bf1e13-2927-428f-8fdb-e01d1201566a",
      "title": "A Delusional Self Proclaimed Prophet Claims God Told Him To Kidnap 14 Year Old Girls Elizabeth Smart",
      "description": "In This Video 14 year old girls Elizabeth smart kidnappers Brian David Mitchell Details Explain story. A delusional self proclaimed prophet claims God told him to kidnap 14 year old girls Elizabeth smart documentary. dark dave mirror Brian David Mitchell claim god\u0027s promises Elizabeth smart kidnapping. This Video Created by dark hearts with stacey lee YouTube Channel. #breakingnews #elizabeth #crime_news \n\nToday we are doing a deep dive on someone who was once in the news every single day. We are talking about Brian David Mitchell, who first changed his name to Daveed and then to Immanuel. He is, of course, the man who kidnapped Elizabeth Smart but we aren\u0027t talking about that event today, as much as we are talking about what made Brian David Mitchell do what he did, and we are talking about the uptick in men who think like he does. There is a frightening and disturbing trend happening on social media right now, the trend of \u0022Trad Wives\u0022 and the men who love them...women who believe they are subservient to men and the men who demand servitude and subservience from those women. This is a trend that should disturb anyone with two brain cells and for that reason, it is important to discuss these stories to remind people what happens when men like this do what they want to do.\n\nFollow me on TT, on IG, and please like and subscribe. It\u0027s ROUGH here lately. You can also join my Patreon. We are in the midst of a fundraiser, raising money to donate to police departments that have cold case DNA in storage. Thanks so much for your continued support and all your very kind words. You guys are the best! ❤️ Stacy\n\nRelated Hashtags: #ElizabethSmart #BrianDavidMitchell #truecrime  #survivorstories  #awareness  #strengthinadversity  #neverforget  #Perseverancey #fightforjustice  #resilience #CommunitySupport #FamilyStrength #HealingJourney #NeverGiveUp #Empowerment #Inspiration #SafetyAwareness #VictimAdvocacy #awarenesscampaign \n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-03-19T17:00:10Z",
      "duration": "00:38:17",
      "explicit": false,
      "youTubeId": "EYSZQFEwngQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EYSZQFEwngQ"
      }
    },
    {
      "id": "4b739ed1-0d21-480c-af8f-40814eebec4b",
      "title": "Sexpot Aliens, Reptile Humanoids and Conspiracy Theories! This is one crazy cult story",
      "description": "In This Video: Sexpot Aliens, reptile humanoids, and conspiracy theories! This is one crazy cult story.\nWe discuss The Universe People, more commonly called The Cosmic People of light, a cult founded by Ivo A. Benda in 1997. Ivo and others claim they can channel Ashtar Sheran, a beautiful blonde alien from the star group Pleiades. We talk about the Pleiadians, a species of humanoid alien that this cult believes in and claims to communicate with. We talk about the Saurians, a race of reptile people this cult believes to be evil and out to destroy mankind. We discuss the crazy conspiracy theories this cult believes in as well. There will be a little less maliciousness with this cult story, but a LOT more ridiculousness. Put on your crash helmets! This Videos was Created by Dark Hearts with Stacy Lee\n\nFollow me on TT, on IG and you can also join my Patreon. We are in the midst of a fundraiser raising money to donate to police departments that have cold case DNA in storage. All the information is at the end of this video.\nThank you all so much for your support and your kind words. You guys are the best ❤️ Stacy\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-03-14T17:00:07Z",
      "duration": "00:34:07",
      "explicit": false,
      "youTubeId": "BtHMChRV6GY",
      "subjects": [
        "Universe People"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BtHMChRV6GY"
      }
    },
    {
      "id": "db8b1a06-ad20-4f5f-ab35-9e4335c9fe87",
      "title": "A Mormon conman and liar rises to fame and fortune pretending he is rescuing trafficked children",
      "description": "We discuss the story of Tim Ballard, who claims he has been chosen by God, with whom he spoke one day in a Mormon temple, to save children from child trafficking. Tim quit his job at Homeland Security and gathered some paid mercenaries to go on missions in foreign countries under the guise of rescuing children. The problem is, there is no proof that any child was ever rescued, or any woman for that matter. \nNow, Tim has been denounced by the Mormon church, and is embroiled in scandal as woman after woman comes forward accusing Tim of sexually assaulting him as they worked for him. His attorney is also in hot water and the funding behind his movie, Sound of Freedom has also been arrested. \nIf you\u0027re here to discuss, great! If you\u0027re here to be rude and say abusive things to me, you will be immediately blocked. Abusive language is not tolerated on this channel so don\u0027t waste your time. Constructive criticism and discussion is always welcome. Jerks are not. \nTo my community: I love you so much and thank you for sticking with me through this rebrand. It\u0027s been ROUGH. You\u0027re the best.\nFollow me on TT, on IG and you can also join my Patreon where we are raising money to donate to police departments! All the info is in the video entitled Fundraiser. It\u0027s on my playlist. ❤️ Stacy\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-03-07T18:00:14Z",
      "duration": "00:48:41",
      "explicit": false,
      "youTubeId": "d1mzfqkmqhk",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d1mzfqkmqhk"
      }
    },
    {
      "id": "f100d3b6-7c8c-48e9-a634-337a65a3dd51",
      "title": "Did you know the Mormons are storing your personal information in a secret vault?",
      "description": "We discuss the Granite Mountain Vault, one of the most secure locations in the entire world, where the Mormons store all kinds of personal information on over 13 billion people, some of that information dating to well before the time of Christ. Why are the Mormon\u0027s keeping this information, which includes your birth records, marriage records and even death records. Why is it so important to them and what are they doing with that information? Do you believe the conspiracies that the church is also in possession of sacred religious relics that date to the time of Jesus? You\u0027ll have to decide for yourself.\n\nPlease follow me on TT, on IG and you can always join my Patreon where we have a big goal: fundraising to get cold case DNA kits tested. I appreciate you all so much ❤️ Stacy\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-02-01T18:00:30Z",
      "duration": "00:35:52",
      "explicit": false,
      "youTubeId": "eAWPnA8cxHs",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eAWPnA8cxHs"
      }
    },
    {
      "id": "e36b080a-ea69-4de6-9b86-907dfaf0412b",
      "title": "A secretive cult and the abuse of it\u0027s members exposed",
      "description": "We discuss The Brethren, a religious cult with about 87,000 members worldwide. We talk about the cult\u0027s history, its leaders, and the beliefs of the members. We also discuss what happens to those who leave the cult and the damage it does to people both in and out of the cult and why it is dangerous.\n\nPlease like and subscribe my friends! We\u0027ve got to get some massive growth for me to continue. You can also follow me on TT, on IG, and on FB. Just search for Dark Hearts with Stacy Lee. I sure appreciate you!\n\n❤️ Subscribe: https://www.youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n📸 Instagram: https://www.instagram.com/darkheartswithstacylee?igsh=Z2d3bTJtZ2NsNXIy\u0026utm_source=qr\n🎵 TikTok: https://www.tiktok.com/@darkheartswithstacylee?_t=8ns1oHffLyd\u0026_r=1\n💰 Patreon: https://www.patreon.com/DarkHeartswithStacyLee?utm_campaign=creatorshare_creator\n💵 CashApp: https://cash.app/$stacyleeDWD\n🤑 Venmo: \nhttps://www.venmo.com/u/DarkHeartsWithStacyLee\n📧 Email: darkheartswithstacylee@gmail.com",
      "release": "2024-01-11T18:00:26Z",
      "duration": "00:35:59",
      "explicit": false,
      "youTubeId": "rSGd6bBQi-4",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rSGd6bBQi-4"
      }
    },
    {
      "id": "96c2b7d2-2501-481f-9f3b-19d83ac80649",
      "title": "Racism, Bigotry and Child Abuse: The Twelve Tribes Cult and the Yellow Deli restaurant that funds it",
      "description": "We\u0027re back at it today with those crazy cultsters! Today we are talking about The Twelve Tribes, which runs a restaurant chain called The Yellow Deli. We discuss the history of the cult, which started out as The Light Brigade and then became The Vine Community Church before finally changing its name to The Twelve Tribes. We discuss it\u0027s founders, Gene and Marsha Spriggs, and the allegations against the cult: child abuse, psychological abuse, labor law violations and physical abuse. We talk about the cult migration from Chattanooga, Tennessee to Vermont and then back to Chattanooga and we talk about the Yellow Deli history and current status. These are my opinions and thoughts. This is not a news channel, friends. If you\u0027re pro-cult, I\u0027d suggest skipping this video.\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/\n💲 CashApp $stacyleeDWD\n💰 Venmo @DiningWithDeath",
      "release": "2023-12-05T18:00:16Z",
      "duration": "00:38:16",
      "explicit": false,
      "youTubeId": "SD4lafE86wQ",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SD4lafE86wQ"
      }
    },
    {
      "id": "ffad418d-1c15-44e3-b973-c2e31177bba5",
      "title": "Jesus told me to kidnap my son! A mother believes her son will usher in the apocalypse and Jesus",
      "description": "We discuss the recent disturbing story of Spring Thibaudeau, a Mormon woman who has very extreme and fringe beliefs, including a belief that her son Blaze is a Davidic Servant, tasked with ushering in the apocalypse and the second coming of Jesus Christ. I give you an overview of where these beliefs come from, from my perspective as an ex-Mormon. We talk about why this seems to be happening more and more and we discuss the events of this crime. Spring, her brother Brooke Hale, and her daughter Abigail Thibaudeau Snarr are convinced the world as we know it is ending in November 2023 and they believe that Blaze, a 16 year old boy from Arizona, is a divinely chosen player in the coming apocalypse. I give you the details of the story and bring you up to date as we wait for more details.\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/\n💲 CashApp $stacyleeDWD\n💰 Venmo @DiningWithDeath",
      "release": "2023-11-14T18:00:03Z",
      "duration": "00:41:54",
      "explicit": false,
      "youTubeId": "aqGJcfL7lcE",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aqGJcfL7lcE"
      }
    },
    {
      "id": "2967a7e9-af1f-4fc1-98ff-03d7d28a9f9d",
      "title": "Sex, Money \u0026 Spirituality: This influencer will heal your soul and steal your girl, Bentinho Massaro",
      "description": "We discuss the rise of a new Millennial guru, Bentinho Massaro. His slick social media presence, blonde locks and piercing blue eyes have stolen the hearts of millions. But has he also stolen lives? Brent Wilkins family believes so. Join me as we talk about this disturbing story of polyamory, telekinesis, wild claims of god-like powers, and the death of a kind young man. Is this guru full of love and good will towards his fellow man, or is he full of something else?\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/\n💲 CashApp $stacyleeDWD\n💰 Venmo @DiningWithDeath",
      "release": "2023-10-03T17:00:20Z",
      "duration": "00:38:14",
      "explicit": false,
      "youTubeId": "_8X5woJSSco",
      "subjects": [
        "Bentinho Massaro"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_8X5woJSSco"
      }
    },
    {
      "id": "8ebc4c34-e480-4813-9e13-4770d6d81280",
      "title": "BUCKLE UP! I\u0027m not holding back on how I feel about the cult of Teal Swan!",
      "description": "in this video BUCKLE UP! I\u0027m not holding back on how I feel about the cult of Teal Swan! related\nWe discuss the very disturbing rise of, in my opinion, a modern con artist, Teal Swan, who is using debunked psychology and new age philosophy to build her empire. Satanic Panic has been dragged into 2023 and this self proclaimed guru is leading the charge. Teal Swan, raised in Utah, claims to be the victim of horrific satanic abuse. The problem is? Everyone who knows her claims it\u0027s all a lie. We discuss her slow rise to new age fame, her outlandish stories, and why she is so dangerous. Don\u0027t watch if you don\u0027t want my opinions. Cuz you\u0027re getting them in this one 💃 This Video Created by Dark Hearts with Stacy Lee YouTube Channel\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/\n💲 CashApp $stacyleeDWD\n💰 Venmo @DiningWithDeath",
      "release": "2023-08-22T17:00:36Z",
      "duration": "00:39:26",
      "explicit": false,
      "youTubeId": "mQrE4jcvRUw",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mQrE4jcvRUw"
      }
    },
    {
      "id": "bdb989cc-2adf-4b8f-ad17-541498fc4668",
      "title": "The Ant Hill Kids: A horrific story of brainwashing and abuse inside an insidious cult",
      "description": "We discuss the disturbing case of Roch Thériault, also known as Moise, Moses and Rock, who started a small cult after being excommunicated from the Seventh Day Adventist Church. We talk about the escalating abuse that happened inside the cult, including castrations, starvation and unnecessary surgery and how a social worker, Paula Jackson, helped bring attention to what was happening. We trace the cult\u0027s path through Canada into Ontario and we talk about Roch\u0027s ever changing and increasingly disturbing beliefs regarding sex, anatomy, health and the apocalypse. The cult, which came to be known as The Ant Hill Kids, was eventually disbanded after many years of hard work and we discuss what eventually happened to it\u0027s sick and twisted leader, Roch Thériault and the film that was made about these events, Savage Messiah.\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/\n💲 CashApp $stacyleeDWD\n💰 Venmo @DiningWithDeath",
      "release": "2023-07-11T17:00:33Z",
      "duration": "00:43:05",
      "explicit": false,
      "youTubeId": "o38dD4uMcA8",
      "subjects": [
        "Ant Hill Kids"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o38dD4uMcA8"
      }
    },
    {
      "id": "28098e11-9eff-4a28-aebb-70daa9edc8b9",
      "title": "Little Known Death Cult of Immanuel: A fringe Mormon group commits a horrible act in Salt Lake City",
      "description": "We discuss the very little known case of David Immanuel, originally Bruce Longo, who, after joining the Mormon Church, decided he was God, Jesus and The Holy Ghost. We talk about how he and his small group of followers banded together in their apocalyptic beliefs and what ultimately became of them. David Immanuel took the easy way out, leaving his wife Rachel to raise their seven children. When she decided she could not do that, she forced them off of the roof of the Shilo Inn in Salt Lake City Utah. Some of the older children jumped to their deaths. This group is sometimes called The Cult of David Immanuel or The Cult of David.\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/\n💲 CashApp $stacyleeDWD\n💰 Venmo @DiningWithDeath",
      "release": "2023-06-06T17:00:26Z",
      "duration": "00:32:27",
      "explicit": false,
      "youTubeId": "uBJDn2NShNQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uBJDn2NShNQ"
      }
    },
    {
      "id": "50c22a96-0f4d-4831-a3a4-cd98f257ee6e",
      "title": "Beasts of Satan: A heavy metal cult in Italy commits multiple murders",
      "description": "We discuss the shocking and terrible crimes committed by members of the Italian cult that called themselves Beasts of Satan. Andrea Volpe, Nicola Sapone and others, along with Elisabetta Ballarin eventually lead authorities to the bodies of their victims but are they being completely truthful? Some believe there are many more victims.\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/",
      "release": "2022-09-27T17:00:20Z",
      "duration": "00:26:14",
      "explicit": false,
      "youTubeId": "_OOhSjc0B9Q",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_OOhSjc0B9Q"
      }
    },
    {
      "id": "66932354-3baa-4ff5-a072-7e86c91611d4",
      "title": "The Body Cult: This is a developing story with serious allegations of ritualistic abuse",
      "description": "This is a bit different from my regular post. I am bringing to you, information I uncovered on social media and a story I have been collaborating on with a journalist. I discuss most of what we know about this group, the arrests involved, and the ongoing and mysterious circumstances surrounding this alleged cult.\n\nHere is the link to Syran Warner\u0027s documentary about this subject:\nhttps://youtu.be/57xSVk8BOxs\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/",
      "release": "2022-07-26T17:00:09Z",
      "duration": "00:36:36",
      "explicit": false,
      "youTubeId": "KtJ-TCL0jPs",
      "subjects": [
        "Marc Bisset"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KtJ-TCL0jPs"
      }
    },
    {
      "id": "cd92a6f1-ea3e-4d14-b17e-7718e2691b9f",
      "title": "Under the Banner of Heaven: The Lafferty Brothers cult and the murder of Brenda and Erica Lafferty",
      "description": "We discuss the story of Ron and Dan Lafferty, two brothers who decided they were prophets of God and started The School of Prophets. They branched off of mainstream mormonism, using the Book of Mormon doctrine of blood atonement, and started their own cult. We review the timeline of events and the circumstances surrounding the murder of Brenda Wright Lafferty and her child as well as the plot to kill Richard Stowe and Chloe Low. We discuss the arrests, the theories, and the aftermath.\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n🎵TikTok https://vm.tiktok.com/ZM8HkTANw/",
      "release": "2022-04-26T17:00:25Z",
      "duration": "00:31:30",
      "explicit": false,
      "youTubeId": "PJai92neO0E",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PJai92neO0E"
      }
    },
    {
      "id": "9d67104b-c09a-4286-932b-d5620d84b9de",
      "title": "Lori Vallow and Chad Daybell Story: the murders, children, cult, arrest, Mormonism, and update.",
      "description": "Lori Vallow and Chad Daybell are accused and arrested for murder. We provide an update version of the events including their cult beliefs. We discuss a clear timeline of events, the disappearance of Lori Vallow\u0027s kids, and the discovery of their remains. We discuss Chad Daybell\u0027s apocalyptic style books based in Mormonism. We review the many people who have died surrounding this case and what is known to this date.\n\n❤️Subscribe: https://youtube.com/channel/UCu9SNFGpY_odhZT_LevkGvw\n🐧 Twitter: http://twitter.com/diningwithdeath\n📸 Instagram: http://instagram.com/diningwithdeath\n🙆‍♀️ Facebook: http://facebook.com/diningwithdeath\n💰 Patreon https://www.patreon.com/DiningWithDeath\n\nNate Eaton Interviews:\nhttps://youtu.be/0auLh11L9-w\n\nhttps://youtu.be/Ka1vrNVboX0",
      "release": "2021-08-10T16:01:24Z",
      "duration": "00:29:31",
      "explicit": false,
      "youTubeId": "yS0eom8aMOE",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yS0eom8aMOE"
      }
    }
  ]
}