{
  "_ts": 0,
  "id": "14959621-9a5e-41fe-875b-15a9dc785fcb",
  "name": "Dateable: Your insider\u0027s look into modern dating",
  "spotifyId": "3SoaZpsNlIQ83ePVmHOdEO",
  "appleId": 1084105171,
  "episodes": [
    {
      "id": "59b24140-a0ca-45a7-8080-61836941fa00",
      "title": "S16E7: What It\u0027s Like To Be In A Sex Cult",
      "description": "What happens when the sexual wellness community you\u0027re part of starts to feel like a cult? We\u0027re chatting with Rebecca, who is still coming to terms with her experience with orgasmic meditation and the organization OneTaste, which got profiled in the Netflix documentary Orgasm Inc. We discuss what attracted her to the practice in the first place, the tipping point of when this experience started to not feel right, and how she\u0027s recovering from the disturbing allegations vs. missing the woman she was at this time. Follow us @dateablepodcast, @juliekrafchick and @nonplatonic. Check out our website for more content. Also listen to our other podcast Exit Interview w/ iHeart Podcasts available on Apple Podcasts, Spotify, iHeartRadio, or wherever you get your podcasts. This episode is sponsored by: BetterHelp: Get 10% off your first month of online therapy at betterhelp.com/dateable with the code DATEABLE Drizly: Download the Drizly app or go to Drizly.com and use promo code FAST5 for $5 off your first order. Hers: Get access to medical providers for help with anxiety and depression. For more information visit forhers.com/spring Dateable is part of the Frolic Podcast Network. You can find more outstanding podcasts to subscribe to at frolic.media/podcasts Our Sponsors: * Get 10% off your first order sitewide with code DATEABLE at OSEAMalibu.com * Check out Armoire and use my code DATEABLE for a great deal: http://www.armoire.style * Check out Hinge: https://hinge.co/ * Check out VIIA and use my code DATEABLE for a great deal: https://viiahemp.com/ Support this podcast at — https://redcircle.com/dateable-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-03-29T04:00:00Z",
      "duration": "01:05:51.2290000",
      "explicit": true,
      "spotifyId": "47gWlCZIFPPa812A5PFZxc",
      "appleId": 1000606398194,
      "subjects": [
        "Self-Help",
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/47gWlCZIFPPa812A5PFZxc",
        "apple": "https://podcasts.apple.com/podcast/s16e7-what-its-like-to-be-in-a-sex-cult/id1084105171?i=1000606398194"
      }
    }
  ]
}