{
  "id": "63cc17b3-3194-4274-8a38-36fdb86bd8e8",
  "name": "Dateline NBC",
  "spotifyId": "3MGn724Y6BOSQzfmk3TyuY",
  "appleId": 1464919521,
  "youTubeChannelId": "UCu3sKtOW9TGaErPsAYVPplA",
  "episodes": [
    {
      "id": "867d3d94-710b-4ddd-8cf4-21e0bfa42328",
      "title": "A NXIVM story.",
      "description": "Smallville actress and former NVIVM cult member, Allison Mack, shares her story on a new podcast. Find out more about the cases covered each week here: www.datelinetruecrimeweekly.com Hosted by Simplecast, an AdsWizz company. See pcm.adswizz.com for information about our collection and use of personal data for advertising.",
      "release": "2025-11-20T12:39:30Z",
      "duration": "00:28:42.5400000",
      "explicit": false,
      "spotifyId": "4LQzIf1P2K6MOQyzGsap2M",
      "appleId": 1000737587754,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LQzIf1P2K6MOQyzGsap2M",
        "apple": "https://podcasts.apple.com/podcast/an-accused-killer-pleads-guilty-but-not-to-murder/id1464919521?i=1000737587754"
      }
    },
    {
      "id": "2b6e5685-45d1-4f47-9e78-b177f7192ffa",
      "title": "Sean Combs: The verdict.",
      "description": "After more than 13 hours of deliberation over three days, the New York jury found Combs not guilty on a RICO conspiracy charge, not guilty on a sex trafficking charge involving Cassie Ventura, and not guilty on a sex trafficking charge involving his ex-girlfriend \u0022Jane,\u0022 who testified under a pseudonym. He was convicted on two counts of transportation to engage in prostitution, then denied bond while he waits for his sentencing hearing. That hearing is scheduled for October but could move up. The prosecution is arguing he should be sentenced to around four and a half years, while the defense says the federal guidelines for his offenses put him closer to two years. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-07-03T05:13:52Z",
      "duration": "00:13:39.4080000",
      "explicit": true,
      "spotifyId": "5n0aKCJdVyCbUqynXXyZpa",
      "appleId": 1000715535699,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5n0aKCJdVyCbUqynXXyZpa",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-the-verdict/id1464919521?i=1000715535699"
      }
    },
    {
      "id": "529ac7ac-0fac-4f54-a0b6-5a77d5220d26",
      "title": "Sean Combs: The jury gets the case.",
      "description": "After two hours of instructions from Judge Subramanian -- including how to gauge the credibility of witnesses and a reminder to not google anything -- the jury began deliberating. Combs appeared less stressed than he did during closings. After the jury left, the judge closed the courtroom to give him some time with his children. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-07-01T00:52:10Z",
      "duration": "00:16:45.3740000",
      "explicit": true,
      "spotifyId": "6Juu1HpGpwVQ6KhWcqT9Oj",
      "appleId": 1000715216946,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Juu1HpGpwVQ6KhWcqT9Oj",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-the-jury-gets-the-case/id1464919521?i=1000715216946"
      }
    },
    {
      "id": "80361993-c536-4f6e-a12d-278ba871c97b",
      "title": "Sean Combs: The defense’s closing and the prosecution\u0027s rebuttal.",
      "description": "Defense attorney Marc Agnifilo argued that Cassie Ventura was the winner of her relationship with Combs. \u0022She is sitting somewhere in the world with $30 million,\u0022 he said. \u0022He\u0027s in jail.\u0022 And he tried to make the prosecution of Combs relatable. \u0022They take yellow crime scene tape, figuratively, and they wrap it around his bedroom,\u0022 he said. \u0022The crime scene is your private sex life.\u0022 In its rebuttal, the prosecution said the defense \u0022just spent a whole lot of energy trying to blame his victims and the U.S. government for his lies, his threats, and his violence.\u0022 If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-28T02:32:28Z",
      "duration": "00:10:13.4850000",
      "explicit": true,
      "spotifyId": "4LHNfAv232aA49q5RARtTB",
      "appleId": 1000714884995,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LHNfAv232aA49q5RARtTB",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-the-defenses-closing-and/id1464919521?i=1000714884995"
      }
    },
    {
      "id": "e20bd655-6cdc-42ee-bfae-82e9a73a1448",
      "title": "Sean Combs: The prosecution\u0027s closing argument.",
      "description": "\u0022He won\u0027t take no for an answer,\u0022 said prosecutor Christy Slavik. She said it over and over during a summation that lasted more than four hours. She argued that the \u0022common purpose\u0022 of Combs and his \u0022inner circle\u0022 -- his chief of staff, his bodyguards, and some of his assistants -- was to protect him from bad press and law enforcement. And she recounted the dramatic stories told in the courtroom in the past six weeks: Goodfellas-type scenes of alleged bribery, arson, and kidnapping. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-27T02:03:46Z",
      "duration": "00:15:41.1910000",
      "explicit": true,
      "spotifyId": "2Gkr2gCFp5k0g7pBM32yZ9",
      "appleId": 1000714738573,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Gkr2gCFp5k0g7pBM32yZ9",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-the-prosecutions-closing-argument/id1464919521?i=1000714738573"
      }
    },
    {
      "id": "5e69e12d-1d2a-4bd6-bdc2-db360130603b",
      "title": "Sean Combs: Prosecution and defense rest.",
      "description": "Today, after calling 34 witnesses over six weeks, federal prosecutors rested their case. After that, the defense put on their case. It took them only a half an hour. They called no witnesses. They did argue that the case should be dismissed because the prosecution didn\u0027t meet its burden of proof. But the judge reserved his decision on that, and the trial remains on track for the jury to hear summations on Thursday. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-25T01:27:44Z",
      "duration": "00:13:23.8400000",
      "explicit": true,
      "spotifyId": "65LsfT27Rw56C7H9TYPlRf",
      "appleId": 1000714428413,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65LsfT27Rw56C7H9TYPlRf",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-prosecution-and-defense-rest/id1464919521?i=1000714428413"
      }
    },
    {
      "id": "53db6aec-14ab-4939-b253-c0af1dbacdff",
      "title": "Sean Combs: The jury watches more Freak Off videos.",
      "description": "In the last days of the trial, the prosecution played more videos of the sexual encounters at the center of the case. Their summary witness also introduced texts and voice notes in which Combs\u0027s staff arranges travel for his girlfriends and Combs himself haggles over the price of escorts. In the morning, the defense announced it won\u0027t be calling any witnesses at all. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-24T01:03:47Z",
      "duration": "00:12:03.2780000",
      "explicit": true,
      "spotifyId": "0f9V3eGpDCMcb2IhmYzRNT",
      "appleId": 1000714271995,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0f9V3eGpDCMcb2IhmYzRNT",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-the-jury-watches-more-freak-off-videos/id1464919521?i=1000714271995"
      }
    },
    {
      "id": "2965b880-b836-4e89-8623-59d9718a4332",
      "title": "Sean Combs: The last personal assistant and an interview with Joe Tacopina.",
      "description": "The prosecution called one of its last witnesses -- personal assistant Brendan Paul, who testified he was arrested last spring because he covered for Combs when federal agents found something illegal in his bag. Plus an interview with Joe Tacopina, who represented Michael Jackson, Meek Mill, and ASAP Rocky, but turned down Combs\u0027s case. He rates both legal teams\u0027 performance so far and tells us what his closing argument would be. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-21T03:54:42Z",
      "duration": "00:17:16.8780000",
      "explicit": false,
      "spotifyId": "604G0PMQtsDLwhqYc6MPak",
      "appleId": 1000713907322,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/604G0PMQtsDLwhqYc6MPak",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-the-last-personal-assistant-and-an/id1464919521?i=1000713907322"
      }
    },
    {
      "id": "b4f77b82-69ac-4992-bd26-2fc3591cf053",
      "title": "Sean Combs: \u0022Someone is lying.\u0022",
      "description": "The day began with the judge interrogating both legal teams over the source of a leak. It ended with a closed-door discussion about a newly discovered juror issue. In between, the prosecution showed receipts, including some that showed Bad Boy Productions on the hook for an AMEX that paid for \u0022hotel nights.\u0022 The defense showed more text messages, including some where Cassie Ventura seemed receptive to Combs\u0027s requests for the sexual encounters they called Freak Offs. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-18T01:40:00Z",
      "duration": "00:11:02.6740000",
      "explicit": false,
      "spotifyId": "1pG7OywBQaIwTjCNMOnKUI",
      "appleId": 1000713349185,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1pG7OywBQaIwTjCNMOnKUI",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-someone-is-lying/id1464919521?i=1000713349185"
      }
    },
    {
      "id": "68c004b6-df53-432c-ad13-f74636fb1c32",
      "title": "Sean Combs: Kristina Khorram’s texts.",
      "description": "The prosecution called a paralegal and an investigator to introduce messages of all kinds between Combs\u0027s chief of staff, his other employees, his ex-girlfriends -- and him. The government alleges the messages show proof of a RICO conspiracy that involves the people who worked for him. On cross, the defense pointed out how many messages the government was ignoring and showed additional messages to contextualize the prosecution\u0027s exhibits. Combs was yawning. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-17T01:26:20Z",
      "duration": "00:11:11.2940000",
      "explicit": false,
      "spotifyId": "3AjnOFhLyWunpch5kMgr9o",
      "appleId": 1000713174299,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3AjnOFhLyWunpch5kMgr9o",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-kristina-khorrams-texts/id1464919521?i=1000713174299"
      }
    },
    {
      "id": "d443c1d3-753c-4dcb-b7b7-47fca4805b12",
      "title": "Sean Combs: Kanye makes an appearance.",
      "description": "Another former personal assistant of Combs was called by the prosecution. He testified that he set up -- and cleaned up -- \u0022hotel nights,\u0022 but on cross-examination said that he never saw \u0022Jane\u0022 hesitant to participate or appear unhappy afterward. Plus Kanye West pulled up to the federal courthouse in a Maybach. He watched the testimony in an overflow room for about ten minutes. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-14T01:11:14Z",
      "duration": "00:13:29.0380000",
      "explicit": true,
      "spotifyId": "61kW0NYklIN6XFjT3eoNRs",
      "appleId": 1000712813797,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61kW0NYklIN6XFjT3eoNRs",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-kanye-makes-an-appearance/id1464919521?i=1000712813797"
      }
    },
    {
      "id": "c8ed2ded-3b3d-4aad-ae39-28602645e187",
      "title": "Sean Combs: \u0022Jane\u0027s\u0022 last day and more Combs recordings.",
      "description": "Both sides have played voice messages Combs sent this witness, who\u0027s testifying under a pseudonym, over the course of their three-year relationship. They\u0027re trickling out to the press as exhibits are released days later. The defense says the ones made public on Thursday show \u0022Jane\u0022 taking the initiative to set up \u0022hotel nights\u0022 without Combs\u0027 requesting one. But she testified that the defense was missing the point of the messages. \u0022The undertone of that is -- I hear these things entirely differently,\u0022 said \u0022Jane.\u0022 If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-13T00:13:42Z",
      "duration": "00:08:16.7440000",
      "explicit": true,
      "spotifyId": "7tIBfMKKqHBr2zkwdFwBiW",
      "appleId": 1000712664922,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tIBfMKKqHBr2zkwdFwBiW",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-janes-last-day-and-more-combs-recordings/id1464919521?i=1000712664922"
      }
    },
    {
      "id": "3e971f65-04a9-4d4a-ba98-fad697beb435",
      "title": "Sean Combs: \u0022You were welcome to leave, right?\u0022",
      "description": "Defense attorney Teny Geragos pushed \u0022Jane,\u0022 who\u0027s testifying under a pseudonym, on her repeated choice to stay with Combs despite sexual performances that she says she was coerced to join. But \u0022Jane\u0022 said Combs didn\u0027t make it easy for her to leave him. \u0022He would offer a breakup,\u0022 she said on the stand. \u0022And then a week later he would be persistent, blow up my phone. Have other people blow up my phone. Be looking for me. Wanting to see me. And he\u0027d be right back in my face.\u0022 If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-12T02:09:32Z",
      "duration": "00:14:03.3630000",
      "explicit": true,
      "spotifyId": "64HW7syw1p3RqzhXygzUlA",
      "appleId": 1000712515017,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64HW7syw1p3RqzhXygzUlA",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-you-were-welcome-to-leave-right/id1464919521?i=1000712515017"
      }
    },
    {
      "id": "202bfa4f-da3c-4bdd-a4fb-195b89db61a1",
      "title": "Sean Combs: Defense begins its cross-examination of \u0022Jane.\u0022",
      "description": "The second witness using a pseudonym said on the stand that she \u0022currently\u0022 loves Combs, even after telling her story of a brutal beating at his hands just one year ago. She then testified that she only participated in what she calls \u0022hotel nights\u0022 because she didn\u0027t want Combs to feel judged for his sexual desires. And after her sexual performances were complete, she pampered him, including giving him foot rubs and turning on his favorite TV show. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-11T02:12:13Z",
      "duration": "00:14:06.6540000",
      "explicit": true,
      "spotifyId": "2Por8VQgsViS0eCDkXAqUU",
      "appleId": 1000712367334,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Por8VQgsViS0eCDkXAqUU",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-defense-begins-its-cross-examination-of-jane/id1464919521?i=1000712367334"
      }
    },
    {
      "id": "84bcec1a-3e4e-4553-890c-3f206541081b",
      "title": "Sean Combs: Listen to Combs’s messages to “Jane.”",
      "description": "On the Friday prosecution played three voice notes Combs sent his then-girlfriend -- testifying anonymously -- over the course of their three-year relationship. On Monday, she read out loud the texts she sent him after Cassie Ventura filed suit against him in 2023. \u0022I feel like I\u0027m reading my own sexual trauma,\u0022 \u0022Jane\u0022 wrote. \u0022It makes me sick how three pages, word for word, is exactly my experience and my anguish.\u0022 Plus, MSNBC legal correspondent Lisa Rubin joins to tell us how she thinks the prosecution\u0027s case is looking. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-10T02:18:15Z",
      "duration": "00:15:46.0760000",
      "explicit": true,
      "spotifyId": "4DTJn2aXVv7lBuNXacgLTl",
      "appleId": 1000712181508,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4DTJn2aXVv7lBuNXacgLTl",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-listen-to-combss-messages-to-jane/id1464919521?i=1000712181508"
      }
    },
    {
      "id": "001c110c-fdca-4c1d-b956-3e5b159f5baa",
      "title": "Sean Combs: \u0022Jane\u0022 sobs through her testimony.",
      "description": "A second anonymous witness testified that Combs pushed her to perform with a succession of commercial sex workers. In one text message she sent to him she wrote, \u0022I don\u0027t want to play this role in your life anymore. It\u0027s dark, sleazy, and makes me feel disgusted with myself. I feel it\u0027s the only reason you have me around and why you pay for the house. I don\u0027t want to feel obligated to perform these nights with you in fear of losing the roof over my head.\u0022 She sent that text in September of 2023 but testified that she participated in \u0022hotel nights\u0022 with Combs through the summer of 2024. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-07T02:44:03Z",
      "duration": "00:13:36.0910000",
      "explicit": true,
      "spotifyId": "2Qz7T4r3lIMihv2I0RPDIy",
      "appleId": 1000711901728,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Qz7T4r3lIMihv2I0RPDIy",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-jane-sobs-through-her-testimony/id1464919521?i=1000711901728"
      }
    },
    {
      "id": "12ff3bf0-e6f3-4ac8-8865-16916732dba1",
      "title": "Sean Combs: \u0022Jane\u0022 takes the stand.",
      "description": "The woman called Victim-2 in the government\u0027s third superseding indictment -- she\u0027s using a pseudonym to testify -- was dating him until his arrest last fall. She alleges he coerced her into a version of the sexual performances Cassie Ventura has testified about. She testified that Combs was paying her rent, and when she told him she didn\u0027t want to perform sexually anymore, he told her he\u0027d stop the payments. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-06T01:28:35Z",
      "duration": "00:14:47.4050000",
      "explicit": true,
      "spotifyId": "02Twu1tTdqSnn0iCNduSGy",
      "appleId": 1000711763819,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/02Twu1tTdqSnn0iCNduSGy",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-jane-takes-the-stand/id1464919521?i=1000711763819"
      }
    },
    {
      "id": "8bf4ee48-cd62-4524-a9fa-7d0752be819a",
      "title": "Sean Combs: Witness alleges Combs held her over a 17th-floor balcony.",
      "description": "Combs\u0027s team has said this the allegation is \u0022baseless,\u0022 but the witness -- a friend of Cassie Ventura\u0027s -- also testified that Combs once got close to her face and said, \u0022I\u0027m the devil and I could kill you.\u0022 She\u0027ll face more cross-examination tomorrow, and then the prosecution\u0027s last key witness will take the stand. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-05T01:08:52Z",
      "duration": "00:12:49.9590000",
      "explicit": false,
      "spotifyId": "5GuHJU7Wwt1zqjOidZZ5BA",
      "appleId": 1000711233352,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GuHJU7Wwt1zqjOidZZ5BA",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-witness-alleges-combs-held-her-over-a/id1464919521?i=1000711233352"
      }
    },
    {
      "id": "e834a409-18a1-450f-9f7a-d53ead4526e3",
      "title": "Sean Combs: Cash in a brown paper bag and a disruption in court.",
      "description": "Eddie Garcia, who worked security at the hotel where Sean Combs was caught on video beating Cassie Ventura in a hallway, testified that Combs paid $100,000 for what he thought was the only copy of it. He also said on the stand that Combs called him \u0022my angel.\u0022 Plus an outburst by a Diddy supporter in the courtroom, and the judge puts restrictions on exhibits after Victim-4 is named publicly. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-04T02:06:09Z",
      "duration": "00:16:08.4110000",
      "explicit": false,
      "spotifyId": "7rfTYsjsA9bX8hDYAL93p0",
      "appleId": 1000711101072,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7rfTYsjsA9bX8hDYAL93p0",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-cash-in-a-brown-paper-bag-and-a-disruption-in-court/id1464919521?i=1000711101072"
      }
    },
    {
      "id": "17868078-0698-4afc-8209-3525e0bf0f1f",
      "title": "Sean Combs: \u0022You joined the #MeToo money grab.\u0022",
      "description": "The defense continued hammering \u0022Mia,\u0022 who worked as Sean Combs\u0027s assistant and is now testifying, under a pseudonym. She testified that she told no one about her assault allegations until June of 2024 because she was \u0022terrified and brainwashed.\u0022 Defense attorney Brian Steel entered texts between Combs and \u0022Mia\u0022 into evidence, texts where she reached out to him to offer support and love, including one sent just weeks before Cassie Ventura filed her explosive lawsuit. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-06-03T00:48:36Z",
      "duration": "00:12:55.7840000",
      "explicit": true,
      "spotifyId": "0sv6AR2ZKRmQ7DdbWpWRn8",
      "appleId": 1000710947772,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0sv6AR2ZKRmQ7DdbWpWRn8",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-you-joined-the-metoo-money-grab/id1464919521?i=1000710947772"
      }
    },
    {
      "id": "3cb51ff2-2974-4b3f-8fe8-2ed1e958565b",
      "title": "Sean Combs: The defense cross-examines \u0022Mia.\u0022",
      "description": "The prosecution showed texts sent by \u0022Mia\u0022 -- a former personal assistant of Combs testifying under a pseudonym -- where she told his chief of staff that she was having \u0022night terrors\u0022 about him. But the defense left binders of printed out Instagram posts on the jurors\u0027 chairs. In most of them \u0022Mia\u0022 praised her boss and showed off a party-heavy, globe-trotting lifestyle. Combs\u0027s attorney Brian Steel also pushed back on her claims that Combs sexually assaulted her. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-05-31T01:30:00Z",
      "duration": "00:15:31.9180000",
      "explicit": true,
      "spotifyId": "05H2iVwm3YZRrOr0gAbLpr",
      "appleId": 1000710630019,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/05H2iVwm3YZRrOr0gAbLpr",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-the-defense-cross-examines-mia/id1464919521?i=1000710630019"
      }
    },
    {
      "id": "be5aca69-1e4d-4c3f-b802-7ec624d8ff5d",
      "title": "Sean Combs: Victim-4 takes the stand.",
      "description": "A woman who worked as Combs\u0027s personal assistant testified -- under the pseudonym \u0022Mia\u0022 -- that he once had her work five days straight with no sleep, threw things at her, including a laptop and an ice bucket, and that he sexually assaulted her. On the stand she said an \u0022irate\u0022 Combs once chased her and Cassie Ventura onto a Caribbean beach and that they paddled out into the ocean to get away from him, but the weather turned. \u0022I was trying to weigh if it was scarier to face mother nature or to go back to Puff,\u0022 she said. \u0022Mia\u0022 testified that she never told anyone Combs was allegedly sexually assaulting her. \u0022I was going to die with this,\u0022 she said. \u0022I didn\u0027t want anyone to know ever.\u0022 If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-05-30T00:56:01Z",
      "duration": "00:14:48.5550000",
      "explicit": true,
      "spotifyId": "1KjgkF6obfnK2DhFIx3XJq",
      "appleId": 1000710499307,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KjgkF6obfnK2DhFIx3XJq",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-victim-4-takes-the-stand/id1464919521?i=1000710499307"
      }
    },
    {
      "id": "e82d2b15-7dfc-4753-a6f5-3b9cc72a872e",
      "title": "Sean Combs: Defense motion for mistrial denied.",
      "description": "Combs\u0027s defense team objected to prosecution questions about fingerprint evidence from Kid Cudi\u0027s Hollywood Hills home that was destroyed in the custody of the LAPD. \u0022They were suggesting to this jury that someone in this courtroom had something to do with the improper and suspicious destruction of these fingerprint cards and that\u0027s outrageous,\u0022 said defense attorney Marc Agnifilo. But the judge refused to call a mistrial. If you want to read NBC\u0027s coverage of the trial, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-05-29T02:00:05Z",
      "duration": "00:15:07.1020000",
      "explicit": true,
      "spotifyId": "1umRmEXD1K8I1XqkdLjywI",
      "appleId": 1000710370218,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1umRmEXD1K8I1XqkdLjywI",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-defense-motion-for-mistrial-denied/id1464919521?i=1000710370218"
      }
    },
    {
      "id": "23c7f680-4641-4198-b7dd-b9c4acb7bfef",
      "title": "Sean Combs: Kid Cudi takes the stand.",
      "description": "The artist and onetime romantic rival of Combs testified that after Combs found out he\u0027d been dating Cassie Ventura, he broke into his house and unwrapped his Christmas presents. A few weeks later, someone dropped a Molotov cocktail through the roof of Kid Cudi\u0027s car. Combs has denied involvement in both incidents. To get caught up on the Combs trial and stay on top of news from the courtroom, listen to our daily episodes at Dateline: True Crime Weekly . And if you want to read NBC\u0027s coverage, check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-05-23T08:00:00Z",
      "duration": "00:12:01.0840000",
      "explicit": true,
      "spotifyId": "4Xomhv0fDJZ1txBSro4p5x",
      "appleId": 1000709516718,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Xomhv0fDJZ1txBSro4p5x",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-kid-cudi-takes-the-stand/id1464919521?i=1000709516718"
      }
    },
    {
      "id": "fd9a0d68-dce9-46a5-894a-7b8cf463e62e",
      "title": "Sean Combs: Cassie Ventura takes the stand.",
      "description": "On day two of testimony, the defense cross-examines a man who took part in \u0022freak offs\u0022 and the prosecution calls their star witness. Description: In emotional and sometimes graphic testimony, Cassie Ventura tells the jury about her relationship with Sean Combs, who she says was abusive, violent and controlling. Chloe Melas describes how Combs -- who has denied all the allegations against him -- reacted in court. To get future daily episodes of Sean Combs \u0022On Trial\u0022 follow Dateline True Crime Weekly: https://podcasts.apple.com/us/podcast/dateline-true-crime-weekly/id1745566056 For more NBC coverage of the trial check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-05-14T00:40:35Z",
      "duration": "00:10:35.1150000",
      "explicit": true,
      "spotifyId": "5Sxk52URirry7dCPJSi0Py",
      "appleId": 1000708391829,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Sxk52URirry7dCPJSi0Py",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-cassie-ventura-takes-the-stand/id1464919521?i=1000708391829"
      }
    },
    {
      "id": "7c59ef26-e89a-4968-b31c-13c55d01bad2",
      "title": "Sean Combs: Opening statements and the first witnesses.",
      "description": "Listen to this bonus episode of Dateline: True Crime Weekly, in which Chloe Melas describes the mood inside and outside the Manhattan courthouse on the first day of testimony. The record producer has denied the allegations against him, and in his defense\u0027s opening statement claimed the encounters described in the indictment were consensual. A security guard tells the jury what he saw after Combs was caught on tape beating Cassie Ventura in a hotel hallway. Then a man who says he took part in freak offs testifies that he too witnessed alleged violence by Combs toward Cassie. For more NBC coverage of the trial check out our newsletter, “Diddy On Trial”: NBCNews.com/Diddy",
      "release": "2025-05-13T02:54:28Z",
      "duration": "00:08:56.1630000",
      "explicit": true,
      "spotifyId": "6BRKyGpUDyCQgA25U50z9S",
      "appleId": 1000708221186,
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6BRKyGpUDyCQgA25U50z9S",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-opening-statements-and-the-first-witnesses/id1464919521?i=1000708221186"
      }
    },
    {
      "id": "30cb7c08-78fa-49a8-b252-a6de6214ccbe",
      "title": "Sean Combs on Trial",
      "description": "Ahead of the Sean Combs trial, Josh Mankiewicz reports on Combs’s life and the events that triggered a five-count federal indictment that includes racketeering and sex trafficking.",
      "release": "2025-05-12T09:00:00Z",
      "duration": "00:41:18.1840000",
      "explicit": false,
      "spotifyId": "1nCOSLY7sPWD8MVAQ1U8sM",
      "appleId": 1000707011022,
      "youTubeId": "qIqgAlBZro4",
      "subjects": [
        "Sean Combs",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1nCOSLY7sPWD8MVAQ1U8sM",
        "apple": "https://podcasts.apple.com/podcast/sean-combs-on-trial/id1464919521?i=1000707011022",
        "youtube": "https://www.youtube.com/watch?v=qIqgAlBZro4"
      }
    },
    {
      "id": "e39e6d49-14a3-4115-836a-ca1985d1f671",
      "title": "A star defense witness takes the stand. The Zizians\u0027 leader in court. And a new scam called pig butchering.",
      "description": "Listen to this week\u0027s episode of the Dateline: True Crime Weekly podcast with Andrea Canning. Robert Baker, the former lover of Monica Sementilli and admitted killer of her husband, takes the stand in her defense. An alleged vegan cult known as the Zizians will see their leader face trial in Maryland next week. And updates on Karen Read, the University of Pittsburgh student missing in the Dominican Republic, and Lori Vallow Daybell. Plus, everything you need to know about a new scam called pig butchering. Find out more about the cases covered each week here: www.datelinetruecrimeweekly.com. Listen to the full Mommy Doomsday podcast series on Apple: https://podcasts.apple.com/us/podcast/mommy-doomsday/id1540849480 Listen to the full episode of “Lori Vallow Daybell: The Jailhouse Interview” on Apple: https://apple.co/3FjWD4d Listen to the Talking Dateline episode where Keith discusses the interview on Apple: https://podcasts.apple.com/be/podcast/talking-dateline-lori-vallow-daybell-the-jailhouse/id1464919521?i=1000698801101",
      "release": "2025-03-20T11:57:02Z",
      "duration": "00:30:50.7230000",
      "explicit": false,
      "spotifyId": "5eHsHFHgmsjA3ICllISbgc",
      "appleId": 1000700106804,
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5eHsHFHgmsjA3ICllISbgc",
        "apple": "https://podcasts.apple.com/podcast/a-star-defense-witness-takes-the-stand-the/id1464919521?i=1000700106804"
      }
    },
    {
      "id": "be0daddf-65a9-48ed-8439-f8a905af974a",
      "title": "Talking Dateline: Lori Vallow Daybell - The Jailhouse Interview",
      "description": "Andrea Canning sits down with Keith Morrison to talk about his latest episode, “Lori Vallow Daybell: The Jailhouse Interview,” which featured his often combative conversation with one of the most infamous women in America, Loria Vallow Daybell. Convicted of murdering two of her children and conspiring to murder her current husband Chad Daybell’s wife Tammy, Lori is set to go on trial next month for conspiring to murder her fourth husband, Charles Vallow. She has pleaded not guilty and is representing herself at trial. Keith shares a podcast-exclusive clip from the interview in which Lori talks about her love for Chad, and the death of Tammy Daybell. He also answers your questions from social media. Have a question for Talking Dateline? Leave it for us in a DM on social media @DatelineNBC or in a voicemail at (212) 413-5252 for a chance to be featured on a future episode! Listen to the full episode of “Lori Vallow Daybell: The Jailhouse Interview” on Apple: https://apple.co/3FjWD4d Listen to the full episode on Spotify: https://open.spotify.com/episode/6Hqr2KbRPjam94oIhGHTU8",
      "release": "2025-03-12T10:00:00Z",
      "duration": "00:23:15.0950000",
      "explicit": false,
      "spotifyId": "5xAX9A5IItoFQNAmLIdzOu",
      "appleId": 1000698801101,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5xAX9A5IItoFQNAmLIdzOu",
        "apple": "https://podcasts.apple.com/podcast/talking-dateline-lori-vallow-daybell-the-jailhouse/id1464919521?i=1000698801101"
      }
    },
    {
      "id": "1f345dd6-bed4-42a4-be0c-b293d7ce50dd",
      "title": "Lori Vallow Daybell: The Jailhouse Interview",
      "description": "Lori Vallow Daybell, convicted of murdering two of her children, sits down with Keith Morrison for her first TV interview; Lead detectives speak out exclusively about the investigation. Listen to ‘Mommy Doomsday,’ Keith’s original podcast on the case: Apple: https://apple.co/3FkEJ1p Spotify: https://open.spotify.com/show/6O1U4NMmvQbvrbnBayyomu",
      "release": "2025-03-11T10:00:00Z",
      "duration": "01:23:31.2520000",
      "explicit": false,
      "spotifyId": "6Hqr2KbRPjam94oIhGHTU8",
      "appleId": 1000698595137,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Hqr2KbRPjam94oIhGHTU8",
        "apple": "https://podcasts.apple.com/podcast/lori-vallow-daybell-the-jailhouse-interview/id1464919521?i=1000698595137"
      }
    },
    {
      "id": "9e622d47-e0b6-4cd9-b58c-e94afb1fcf11",
      "title": "Lori Vallow Daybell sits down with Keith Morrison for her first television interview | Dateline NBC",
      "description": "Lori Vallow Daybell, convicted of murdering two of her children, sits down with Keith Morrison for her first TV interview. \n\nWatch full episodes: https://www.nbc.com/dateline\n\nLike us on Facebook: http://www.facebook.com/datelinenbc\nFollow us on Twitter: http://www.twitter.com/datelinenbc\nFollow us on Instagram: http://www.instagram.com/datelinenbc\nFollow us on TikTok: https://www.tiktok.com/@nbcdateline\n\nStream on Peacock: https://www.peacocktv.com/watch/asset...",
      "release": "2025-03-05T23:01:28Z",
      "duration": "00:00:51",
      "explicit": false,
      "youTubeId": "2apt_nGAnxM",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2apt_nGAnxM"
      }
    },
    {
      "id": "15c1c9a8-7d2b-4189-abe8-e440fbb71b0d",
      "title": "The Trial of Lori Vallow Daybell",
      "description": "Keith Morrison returns to Idaho for the case against Lori Vallow Daybell, who was on trial for the murders of two of her children, Tylee Ryan and JJ Vallow, and conspiracy to commit the murder of her husband Chad’s previous wife, Tammy Daybell. On July 31, 2023, Vallow Daybell was sentenced to five terms of life in prison without the possibility of parole.",
      "release": "2023-05-16T00:00:00",
      "duration": "01:26:28.0480000",
      "explicit": false,
      "spotifyId": "2TC6YfOwiCU0QrjgAFWbPp",
      "appleId": 1000679929134,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2TC6YfOwiCU0QrjgAFWbPp",
        "apple": "https://podcasts.apple.com/podcast/the-trial-of-lori-vallow-daybell/id1464919521?i=1000679929134"
      }
    },
    {
      "id": "63b578df-60c3-4fc5-a5e0-9ea6c8c56180",
      "title": "Dateline Episode Trailer: The Trial of Lori Vallow Daybell | Dateline NBC",
      "description": "Keith Morrison returns to Idaho for the latest in the Lori Vallow Daybell case, revealing details from inside the courtroom on key evidence and powerful witness testimony that led to a verdict.\n\nWatch this full episode: https://www.nbc.com/dateline/video/the-trial-of-lori-vallow-daybell/9000267476\n\nLike us on Facebook: http://www.facebook.com/datelinenbc\nFollow us on Twitter: http://www.twitter.com/datelinenbc\nFollow us on Instagram: http://www.instagram.com/datelinenbc\nFollow us on TikTok: https://www.tiktok.com/@nbcdateline\n\nStream on Peacock: https://www.peacocktv.com/watch/asset...",
      "release": "2023-05-12T20:12:06Z",
      "duration": "00:00:57",
      "explicit": false,
      "youTubeId": "qp5jAw8A3H4",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qp5jAw8A3H4"
      }
    },
    {
      "id": "9453c8bd-0a42-4fe9-b06d-84d53b8020f7",
      "title": "Dateline Episode Trailer: The Doomsday Files | Dateline NBC",
      "description": "New evidence, exclusive interviews, and an in-depth look at Lori Vallow and Chad Daybell, the Idaho couple charged in the murders of Lori’s children JJ \u0026 Tylee. Keith Morrison reports.\n\nWatch this full episode: https://www.nbc.com/dateline/video/the-doomsday-files/9000190889\n\nLike us on Facebook: http://www.facebook.com/datelinenbc\nFollow us on Twitter: http://www.twitter.com/datelinenbc\nFollow us on Instagram: http://www.instagram.com/datelinenbc\nFollow us on TikTok: https://www.tiktok.com/@nbcdateline\n\nStream on Peacock for FREE! https://www.peacocktv.com/watch/asset...",
      "release": "2021-11-11T16:12:33Z",
      "duration": "00:01:51",
      "explicit": false,
      "youTubeId": "tPA7ZLHQFbk",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tPA7ZLHQFbk"
      }
    },
    {
      "id": "e00cf853-f785-4268-a6e9-740f89becf05",
      "title": "Dateline Episode Trailer: The Ascension of Mother God | Dateline NBC",
      "description": "Keith Morrison reports Friday, October 15 at 9/8c on NBC. \n\nWatch full episodes: https://www.nbc.com/dateline\n\nLike us on Facebook: http://www.facebook.com/datelinenbc\nFollow us on Twitter: http://www.twitter.com/datelinenbc\nFollow us on Instagram: http://www.instagram.com/datelinenbc\nFollow us on TikTok: https://www.tiktok.com/@nbcdateline\n\nStream on Peacock for FREE! https://www.peacocktv.com/watch/asset...",
      "release": "2021-10-14T15:53:19Z",
      "duration": "00:01:39",
      "explicit": false,
      "youTubeId": "pTGfQ-Db4YQ",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pTGfQ-Db4YQ"
      }
    },
    {
      "id": "b9f781dc-b1c8-4483-a3b1-e6dd7b9ca485",
      "title": "Mommy Doomsday",
      "description": "Exclusive new interviews and details on the deaths surrounding Chad and Lori Vallow Daybell, a case Keith Morrison has been on since it drew national attention after Lori’s children disappeared.",
      "release": "2021-04-01T00:00:00",
      "duration": "01:22:01.2340000",
      "explicit": false,
      "spotifyId": "0ZzqnXKrxHrniyFEqBD2gJ",
      "appleId": 1000515316087,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZzqnXKrxHrniyFEqBD2gJ",
        "apple": "https://podcasts.apple.com/podcast/mommy-doomsday/id1464919521?i=1000515316087"
      }
    },
    {
      "id": "42521281-65c6-4f48-bdc8-3b3d530442f7",
      "title": "Keith Morrison and Producer Shane Bishop Talk Mommy Doomsday | Dateline NBC",
      "description": "Ahead of the 2-hour broadcast version of Mommy Doomsday, Keith Morrison sat down with producer Shane Bishop, who details the new content to expect in the television episode airing March 26th at 9/8c on NBC. \n\nLike us on Facebook: http://www.facebook.com/datelinenbc​​...​\nFollow us on Twitter: http://www.twitter.com/datelinenbc​​​...​\nFollow us on Instagram: http://www.instagram.com/datelinenbc​...​\n\nPlus! Stream recent and classic episodes of Dateline now on Peacock, the new free streaming service from NBCUniversal here: https://www.peacocktv.com/watch/home​​​",
      "release": "2021-03-24T20:00:02Z",
      "duration": "00:07:01",
      "explicit": false,
      "spotifyId": "0ZzqnXKrxHrnyFEqBD2gJ",
      "youTubeId": "KjHmDzW3NoI",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KjHmDzW3NoI"
      }
    },
    {
      "id": "3de8b7b0-4548-40b6-9c94-5f27c134f2e0",
      "title": "Collateral Damage",
      "description": "Former NXIVM members tell Kate Snow about life inside the controversial self-help group, and life since founder Keith Raniere’s conviction on charges including sex trafficking and forced labor.",
      "release": "2021-03-02T00:00:00",
      "duration": "01:21:01.4400000",
      "explicit": false,
      "spotifyId": "0w8WmS3kAqQEBLdMkwP4Mz",
      "appleId": 1000511271880,
      "subjects": [
        "NXIVM",
        "Human Trafficking",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0w8WmS3kAqQEBLdMkwP4Mz",
        "apple": "https://podcasts.apple.com/podcast/collateral-damage/id1464919521?i=1000511271880"
      }
    },
    {
      "id": "b7c094cb-c5d6-4e41-bd2e-0727836b3d97",
      "title": "Dateline Episode Trailer: Collateral Damage | Dateline NBC",
      "description": "Former NXIVM members tell Kate Snow about life inside the controversial self-help group, and life since founder Keith Raniere’s conviction on charges including sex trafficking and forced labor.\n\nWatch this full episode: https://www.nbc.com/dateline/video/collateral-damage/4316728\n\nLike us on Facebook: http://www.facebook.com/datelinenbc​​...​\nFollow us on Twitter: http://www.twitter.com/datelinenbc​​​...​\nFollow us on Instagram: http://www.instagram.com/datelinenbc​...​\n\nPlus! Stream recent and classic episodes of Dateline now on Peacock, the new free streaming service from NBCUniversal here: https://www.peacocktv.com/watch/home​​",
      "release": "2021-02-26T13:58:20Z",
      "duration": "00:00:59",
      "explicit": false,
      "youTubeId": "VoJBui1HPkI",
      "subjects": [
        "NXIVM",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VoJBui1HPkI"
      }
    },
    {
      "id": "c91565de-8559-4204-9605-42369e49a2be",
      "title": "Where Are the Manson Family Members Now? | Dateline NBC",
      "description": "Nearly 50 years ago, the Manson “family” rampaged Los Angeles with an infamous murder spree that marked the end of the Summer of Love. What became of some of the key players in this case?\n\nWatch Full Episodes of Dateline: http://www.DatelineNBC.com\n\nLike us on Facebook: http://www.facebook.com/datelinenbc\nFollow us on Twitter: http://www.twitter.com/datelinenbc\nFollow us on Instagram: http://www.instagram.com/datelinenbc",
      "release": "2017-08-09T15:42:54Z",
      "duration": "00:04:43",
      "explicit": false,
      "youTubeId": "Al08pFa_ZP4",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Al08pFa_ZP4"
      }
    }
  ]
}