{
  "id": "f8f0468a-6d06-4bb5-b4b8-b064490bea67",
  "name": "David \u0026 Vivian Aspinall",
  "youTubeChannelId": "UC8uR4S99WxbcHP1NjWxJlEQ",
  "episodes": [
    {
      "id": "904f07c1-ca40-43fd-b0d5-1f26794977c8",
      "title": "ExJW Bethelite \u0026 Zone Servant reveals what unites JWs with ALL cults -- Christ is NOT the centre",
      "description": "William J Schnell, \u0022Into the Light of Christianity\u0022 (1959); republished as \u0022Jehovah\u0027s Witnesses\u0027 Errors Exposed -- Schnell video # 84]\nTEXT: Ephesians 2:5,6\nSchnell also wrote \u0022Thirty Years a Watchtower Slave\u0022 (1956); \u0022Christians Awake: Restoring the Art of Witnessing, Evangelizing \u0026 Soul Winning\u0022 (1961)\nTOPICS: JW.org; cults; Watchtower; propaganda; mind control; Charles Taze Russell; Russellites; International Bible Students; JF Rutherford, brainwashing; Jehovah\u0027s Witnesses; pioneers; replacement theology; Brooklyn Bethel\n#jehovahswitnesses #watchtower #jworg #cultsandextremebeliefs #propaganda #mindcontrol #Russellites #charlestazerussell #CharlesTazeRussell #WilliamJSchnell #Matthew24:14 #jfrutherford #typology #jwpioneers #replacementtheology",
      "release": "2026-02-16T16:00:34Z",
      "duration": "00:06:16",
      "explicit": false,
      "youTubeId": "Kh6EeDSroNs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Kh6EeDSroNs"
      }
    },
    {
      "id": "97f47f08-67e4-4c1a-9396-78d4da7cc4ec",
      "title": "REVELATION -- 8 jolts for 2 Jehovah\u0027s Witnesses ... in 1st chapter! (NO Jehovah, NO Governing Body)",
      "description": "The Apocalypse of John, commonly called the Book of Revelation, was indeed a revelation to 2 former Jehovah\u0027s Witnesses, feeling their way cautiously toward true Christian faith after a traumatic departure from the cult which held them mentally captive for decades, the Watchtower. Most of the Revelation\u0027s most important lessons, it must be admitted, are right there on the surface of the book -- even in JW.org\u0027s own Bible, the New World Translation. But what is NOT there may have to be pointed out, so habituated are Jehovah\u0027s Witnesses to the \u0022cherry-picking\u0022 method of Bible use, which indeed is not Bible study at all, but proof-texting. That is, using Scripture not as the Word of God to an specific time, place and situation, but as a grab bag of references to \u0027prove\u0022 what you believe already.",
      "release": "2020-06-17T18:00:04Z",
      "duration": "00:14:00",
      "explicit": false,
      "youTubeId": "JXj9NNN-zlM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JXj9NNN-zlM"
      }
    },
    {
      "id": "3d7f268c-2a3a-4aa7-b036-a07fa3be1a47",
      "title": "ASK JW\u0027s:  What did Jesus call God before the Jerusalem leaders? Did He claim equality with God?",
      "description": "In John chapter 5 Jewish zealots become murderous toward Jesus of Nazareth. Not only, in their view, is he breaking the Sabbath by healing a man, but He is making a unique claim about His relationship with God. Were these critics right in their understanding of Jesus\u0027 claims? In His language about God and Himself, which follows the accusations (John 5:16-29), Jesus\u0027 unprecedented use of the terms \u0022the Father\u0022 and \u0022the Son\u0022 does not discourage His critics. Jehovah\u0027s Witnesses (JW.org/Watchtower) deny that Christ claimed to be equal with God. They also claim that He proclaimed the Tetragrammaton in public, in defiance of Jewish convention. Does Christ\u0027s consistent reference to \u0022the Father\u0022 and \u0022the Son\u0022 support either contention of Jehovah\u0027s Witnesses?",
      "release": "2020-03-19T14:03:25Z",
      "duration": "00:09:43",
      "explicit": false,
      "youTubeId": "2WL-kN2ZWdI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2WL-kN2ZWdI"
      }
    },
    {
      "id": "3ae59f64-fa56-4b44-b422-af1924f3ff5b",
      "title": "REVELATION for JWs (7)  Armageddon IS a place, BUT ...  wandering in the wilderness with JW.org",
      "description": "[thumbnail pic: Tel Megiddo ( the mound of Megiddo), and the Jezreel plain beyond it, scene of numerous Bible battles]  The Watchtower\u0027s Bible dictionary, \u0022Insight on the Scriptures\u0022, gives historical information about the geographical and Old Testament background of the place in Hebrew called \u0022Har-Mageddon\u0022 ... but then proceeds to assure the reader that the one reference to Armageddon in Revelation (16:16) has nothing to do with the place mentioned many times in the Old Testament. How the Watchtower reasons this out is a classic example of eisegesis -- reading your own beliefs and/or history into the text.",
      "release": "2019-12-21T15:00:19Z",
      "duration": "00:11:57",
      "explicit": false,
      "youTubeId": "js4ZVCoXs7Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=js4ZVCoXs7Y"
      }
    },
    {
      "id": "e6938d45-4a2e-46cb-87e5-65dc72d87e35",
      "title": "PEACE \u0026 SECURITY --  the UN destroys religion?? 1975? 1986? 1989?? How JW.org sells this to JWs",
      "description": "One of the few consistencies in the Watchtower\u0027s history of prophetic interpretation is the tying together of 1 Thessalonians 5:3 -- the \u0022peace \u0026 security\u0022 text -- with their distinctive Armageddon scenario. Whether the year be 1914, 1975 or 1986, the Watchtower/JW.org has managed to sell their loyal followers a mash-up of far-removed texts from both Testaments. Somehow \u0022they are saying peace and security\u0022 becomes an official, worldwide announcement, likely under the auspices of the United Nations; this leads immediately to the destruction of all religion (except JWs).  \u0022Jehovah\u0027s day\u0022 has arrived -- not the \u0022day of the Lord\u0022, the literal coming of Jesus Christ -- but rather Armageddon. NONE of these connections is made in 1 Thess 5:3, and the Tetragram does not appear there -- nor anywhere in the New Testament!",
      "release": "2019-12-15T15:00:01Z",
      "duration": "00:15:55",
      "explicit": false,
      "youTubeId": "4IFfBzjkuaw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4IFfBzjkuaw"
      }
    },
    {
      "id": "ac10e79e-3caa-48d0-9246-cde40fa6d2d0",
      "title": "REVELATION for JWs : Losing  your JW.org glasses -- what Jehovah\u0027s Witnesses THINK they know",
      "description": "Like many cults, Jehovah\u0027s Witnesses/JW.org find their identity and many of their distinctive doctrines in the book of Revelation.  From Charles Taze Russell\u0027s \u0022The Time is at Hand\u0022 (1889), through \u0022The Finished Mystery\u0022 (1917).  From JF Rutherford\u0027s \u0022Light\u0022 (1930) through \u0022Babylon the Great has Fallen! God \u0027s Kingdom Rules!\u0022 (1963), and its follow-up \u0022Then is Finished the Mystery of God\u0022 (1969).  But not content with 99 years of \u0022old light\u0022, in 1988 Watchtower/JW.org published \u0022Revelation -- Its Grand Climax at Hand!\u0022.  No matter how much \u0022new light\u0022 the Watchtower finds in Revelation\u0027s apocalyptic imagery, what never changes is that the book is about THEM -- \u0022God\u0027s Organization\u0022 in the \u0022last days\u0022 is the main subject of the Bible\u0027s last book.",
      "release": "2019-11-23T16:00:43Z",
      "duration": "00:12:37",
      "explicit": false,
      "youTubeId": "3X021SP6X0o",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3X021SP6X0o"
      }
    },
    {
      "id": "98a1aba1-5386-4e71-b553-4df0f9452f19",
      "title": "Ray Franz on Jehovah\u0027s Witnesses and BLOOD -- Life, Law, Love (Franz freedom 149)",
      "description": "[thumbnail pic:  2 Cor 3:6, NKJV]   Former Jehovah\u0027s Witnesses Governing Body member Ray Franz connects the Watchtower\u0027s blood transfusion prohibition with the Apostle Paul\u0027s struggle against Jewish legalism in the first century.  As Paul saw it, the law of Moses led to slavery -- at least when that law was tied to salvation.  The gospel of Jesus Christ, on the other hand, leads to liberty and to salvation.",
      "release": "2019-11-19T22:28:52Z",
      "duration": "00:10:39",
      "explicit": false,
      "youTubeId": "S5P8KxcROXw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S5P8KxcROXw"
      }
    },
    {
      "id": "719eddf9-5ba1-4d60-9cd8-d0d77f8ce6c8",
      "title": "Christ\u0027s personal QUESTION for Jehovah\u0027s Witnesses -- \u0026 ALL of us! (\u0022true religion\u0022 NOT the issue!)",
      "description": "By the time Christ and His disciples reached Caesarea Philippi (Matt 16:13), the Jewish community has divided down the middle on just who this Jesus is. The establishment has accused Jesus of getting His very great powers from Beelzebul, the prince of demons. Thousands of Jews continued to follow Him, but opposition to His unique claims was hardening, becoming more murderous. Christ was now speaking to the crowds in parables, marking a change in His method of teaching about the kingdom of God. Therefore Christ\u0027s questions to the disciples in this place, Caesarea Philippi, were full of cosmic implications -- not least because of the historical significance of the location itself.",
      "release": "2019-09-14T19:15:02Z",
      "duration": "00:15:30",
      "explicit": false,
      "youTubeId": "6Ef_gkEINxo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6Ef_gkEINxo"
      }
    },
    {
      "id": "4fa09c36-6a2f-4c87-b82e-2d370cb8b4e9",
      "title": "Ray Franz dismantles door to door dogma of Jehovah\u0027s Witnesses (Franz freedom 104)",
      "description": "Former Watchtower Governing Body member Ray Franz wrote his second book, \u0022In Search of Christian Freedom\u0022, to explore in depth issues he had raised in his semi-autobiographical, \u0022Crisis of Conscience\u0022.  Ray continued to view Jehovah\u0027s Witnesses\u0027 main problem as the authority vested in the Governing Body, which authority itself rests upon the \u0022BADGE\u0022 which all Jehovah\u0027s Witnesses MUST wear -- ALL \u0022true Christians\u0022 have to share their faith house to house, door to door.  This \u0022works righteousness\u0022 gives the lie to Jehovah\u0027s Witnesses public pronouncements that they believe in salvation by faith, not works.",
      "release": "2019-08-10T19:25:20Z",
      "duration": "00:08:37",
      "explicit": false,
      "youTubeId": "NiyDyf52MUQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NiyDyf52MUQ"
      }
    },
    {
      "id": "71699cd5-a3f8-4946-aac6-12872a32677a",
      "title": "FALLACY -- Jehovah\u0027s Witnesses, is \u0022How can you identify true religion?\u0022 the RIGHT QUESTION?",
      "description": "The Watchtower sets up dialogue with an unsuspecting public by means of carefully worded questions. \u0022How can you identify the true religion?\u0022 is a searching question -- but it is also an unbiblical one. In fact, the phrase \u0022true religion\u0022 never occurs in the Bible -- not even the New World Translation of Jehovah\u0027s WItnesses. Asking a question about religion opens up endless possibilities for misinformation, for propaganda, for slander. But it does not get to the real issue. ALL the first Christians were of Jewish background --  they already HAD \u0022the true religion\u0022. The first thousands of Christians continued to practice their Jewish faith, including Temple worship, synagogue attendance and Sabbath observance (Acts 21:20). The question Jewish Christians had to answer had nothing to do with organizations or religious structures. It had to do with their view of Messiah.",
      "release": "2019-07-05T19:25:35Z",
      "duration": "00:16:09",
      "explicit": false,
      "youTubeId": "QG12ahC6Nz8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QG12ahC6Nz8"
      }
    },
    {
      "id": "b180235f-de40-430d-890d-19d235eb55f8",
      "title": "Another Watchtower/JW.org MYTH -- \u0022anointed\u0022 feed \u0022other sheep\u0022 (Franz freedom 76)",
      "description": "Almost all Jehovah\u0027s Witnesses share a misconception -- one actively promoted by JW.org  -- that somehow the \u0022anointed remnant\u0022 of the 144,000 are responsible for the published materials of the Watchtower.  Ex-Governing Body member Ray Franz reveals that this Watchtower myth by no means corresponds to reality.",
      "release": "2019-05-22T16:28:27Z",
      "duration": "00:10:49",
      "explicit": false,
      "youTubeId": "qa20uTfz1yo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qa20uTfz1yo"
      }
    },
    {
      "id": "d20c0f32-6a6e-435b-b280-b62f3297f816",
      "title": "APOSTASY-- Baptism \u0022pledge\u0022 (submit to JW.org) breaks with ALL tradition  (Franz freedom 59)",
      "description": "In 1985, without biblical explanation or justification, the Watchtower changed its baptism questions for candidates. Now it was formerly required of the candidate that he/she acknowledge that this sacred step of obedience to Christ ALSO acknowledged that the act of baptism associated one with a \u0022spirit-directed\u0022 organization, the Watchtower Bible \u0026 Tract Society. This change effectively gave the Society a legal way of enforcing submission to the rules, policies and court decisions of  \u0022God\u0027s organization\u0022.",
      "release": "2019-03-27T16:00:01Z",
      "duration": "00:07:15",
      "explicit": false,
      "youTubeId": "7rDjh0GiHOg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7rDjh0GiHOg"
      }
    },
    {
      "id": "44380ead-f448-42a3-bf28-b3915c504165",
      "title": "GEHENNA (HELL \u0026 AFTERLIFE part 3) Fear non-existence? Or something far worse?",
      "description": "[thumbnail pic: The Valley of Hinnom, outside the wall of ancient Jerusalem]  The Watchtower (JW.org) reassures Jehovah\u0027s Witnesses -- and everyone else under their \u0022tutelage\u0022 -- that the worse that can happen to a human being is non-existence -- loss of eternal life on earth. Judgment day, with \u0022hell\u0022 beyond, according to JW logic, is a reality billions -- indeed the majority of human beings who ever lived -- will NEVER have to worry about. But according to Jesus, there is something men should fear far more than physical death and mortal enemies. \u0022Rather fear Him\u0022, warns Christ, \u0022who is able to destroy BOTH soul and body in hell [gehenna].\u0022 (Matt 10:28) What did the Jews who listened to Jesus believe about gehenna? Bible scholar William E. Vine gives us background insight which Jehovah\u0027s Witnesses should soberly consider.",
      "release": "2019-03-02T13:07:31Z",
      "duration": "00:09:28",
      "explicit": false,
      "youTubeId": "xY0BbTaCEzo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xY0BbTaCEzo"
      }
    },
    {
      "id": "7933ffc6-e99d-4309-885d-b728c1c77bfb",
      "title": "Ray Franz -- Russell said, NO \u0022organization\u0022, NO NAME but Christ (freedom 34)",
      "description": "[thumbnail pic: Ray Franz \u0026 mike]  The Watchtower, which was founded by Charles Taze Russell in 1879, has completely scrapped 2 of the core beliefs of its founder. First, Russell claimed that God had NO visible, earthly organization. Second, Russell taught that Christians should have NO name but Christ\u0027s. According to Russell, ALL those who were consecrated to Christ and adhering to Scripture were welcome in his \u0022unfenced\u0022 fellowship. In his view, only the denominations of Christendom saw the need for organization and creeds beyond the Bible; and only carnal minds required denominational names OTHER than the Name of Christ.",
      "release": "2019-02-01T22:56:24Z",
      "duration": "00:11:59",
      "explicit": false,
      "youTubeId": "8qaNa6Oxvyc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8qaNa6Oxvyc"
      }
    },
    {
      "id": "9f453c8b-03fc-4c9f-a38b-0b44baaf5f05",
      "title": "How Genesis cured 2 Jehovah\u0027s Witnesses (part 1 -- a bit of background biography)",
      "description": "In the providence of God, 5 Jehovah\u0027s Witnesses started a Bible study in 1986. They were all having problems with the Watchtower by then, but conversely their faith in the Bible was increasing as their faith in \u0022God\u0027s Organization\u0022 was decreasing -- even disappearing. Providentially, these 5 JW\u0027s chose to begin their Bible study at the beginning -- Genesis. The results were heartening, inspiring -- and surprising.",
      "release": "2018-12-05T21:35:11Z",
      "duration": "00:07:05",
      "explicit": false,
      "youTubeId": "Db4p-hUZ9sU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Db4p-hUZ9sU"
      }
    },
    {
      "id": "9e0493dc-6aa5-4ffd-ba98-cf468dab5296",
      "title": "Is JW.ORG right that \u0022the Truth\u0022 perished with the Apostles? JW\u0027s versus CK Barrett",
      "description": "Most great errors contain at least a kernel of truth. In the case of the Watchtower, one great error involves the blasphemous idea that the church of Jesus Christ was somehow overrun by false doctrine after the first century. This \u0022truth\u0022, unfortunately, is commonly believed not only by cultists, but has filtered down into the general culture by means of the mass media. What do REAL experts say about the notion that the church has changed beyond recognition, especially in its doctrinal beliefs? One of the greatest of all New Testament scholars, Charles Kingsley Barrett (1917-2011), addresses this question at the end of his little book \u0022Church, Ministry, \u0026 Sacraments in the New Testament\u0022 (1985). Barrett concludes that while the church DID change in a significant direction at the end of the apostolic age, the change was not any drastic alterations of doctrine, though there were refinements indeed in that area. The major change, rather, was in church forms, specifically in the increased emphasis on sacraments and the external ritual of Christianity. Along with that change, an increased emphasis on human authority within the churches, resulting in a neglecting of Paul\u0027s great teaching about the role of ALL members of the \u0022body\u0022 in the creation of stability, maturity and unity in the whole church of Jesus Christ.",
      "release": "2018-11-17T17:22:36Z",
      "duration": "00:15:45",
      "explicit": false,
      "youTubeId": "3pMH70svrBI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3pMH70svrBI"
      }
    },
    {
      "id": "ad390cec-bfcd-4e22-8b34-707fc7115827",
      "title": "Ray Franz -- Watchtower ruthlessness versus Paul\u0027s \u0022admonishing each one with tears\u0022",
      "description": "Hundreds leaving the Watchtower have expressed their disbelief when observing first hand the treatment of doubting, hurting Jehovah\u0027s Witnesses by JW elders. The lack of compassion, and the universal tendency of WT leadership to treat doubt and disagreement as if they are disloyalty to God. The inhumanity and emotional detachment of even former friends and family members astonishes JW\u0027s who have the experience of enduring a judicial hearing. Elders are told to look for tearful repentance in those being judged. Never do we hear reports of elders exhibiting themselves the compassion and love of the Apostle Paul, who said to his fellow elders from Ephesus, \u0022... bear in mind that for 3 years, night and day, I did not quit admonishing each one with tears.\u0022 (Acts 20:31, NWT)",
      "release": "2018-11-05T23:09:57Z",
      "duration": "00:05:15",
      "explicit": false,
      "youTubeId": "F3qWkyfUdIk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F3qWkyfUdIk"
      }
    },
    {
      "id": "53f7f1bf-f9d6-4d7c-b757-9bcfd9aa507a",
      "title": "Ray Franz -- Which is higher priority? Watchtower \u0022interests\u0022, or protecting a \u0022righteous man\u0022?",
      "description": "Even at the end of Ray Franz\u0027s chapter on his own disfellowshipping and the shunning of other faithful Jehovah\u0027s Witnesses, Ray cannot bring himself to blame the character of \u0022loyal\u0022 JW\u0027s, even the Watchtower leaders who sat in judgment of him and other casualties of the Watchtower inquisition. Ray Franz lays the responsibility for the cold, inhuman treatment of \u0022apostates\u0022 at the feet of the Watchtower\u0027s idolatrous, blasphemous concept -- that God needs an \u0022Organization\u0022 to perform His work in the world.",
      "release": "2018-11-02T20:27:55Z",
      "duration": "00:05:57",
      "explicit": false,
      "youTubeId": "inV_x1I58NA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=inV_x1I58NA"
      }
    },
    {
      "id": "79e14418-c010-43ea-97a1-f659cbcf8ece",
      "title": "Pharisee or tax collector -- which is Jehovah\u0027s Witnesses? Which are we? (Son find faith? pt 3)",
      "description": "Luke 18:9-14 -- the Pharisee \u0026 the tax collector go up to the Temple -- was a major factor in our deciding where Jehovah\u0027s Witnesses stood in the eyes of Christ. Who goes home justified -- declared righteous by God? The \u0027good religious Jew\u0027, or the apostate, the traitor to Judaism and his race? The shocking truth, from the JW standpoint, is that you cannot justify yourself before God by YOUR religious performance, nor by comparing your fidelity with others\u0027 infidelities. Only the humble penitent, who casts himself down before the throne of God\u0027s mercy, can stand finally in the presence of the Holy God. [Tim Keller\u0027s video series on the prodigal son can be found here https://www.youtube.com/watch?v=ZPC8Cv27YTk\u0026list=PLjVhbXbL4m0rkF2ZRlnx_bw-F_7yoFeZd ]",
      "release": "2018-10-18T20:05:23Z",
      "duration": "00:13:17",
      "explicit": false,
      "youTubeId": "54pCWqfCLng",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=54pCWqfCLng"
      }
    },
    {
      "id": "5d7866b5-6106-43a4-809b-b1c10a850219",
      "title": "Ray Franz -- Proud parrots, apostates \u0026 Proverbs: Who is \u0022detestable to Jehovah\u0022 -- and JW.ORG?",
      "description": "According to Proverbs 17:15 (NWT), \u0022Anyone pronouncing the wicked one righteous and anyone pronouncing the righteous one wicked -- even both of them are detestable to Jehovah.\u0022 Ray Franz found himself unable to violate his conscience when it came to his eating with and continuing to work for his now-disassociated friend Peter Gregerson. Ray knew Peter to be a good man, a faithful friend -- and a follower of God and Christ. How could the Watchtower Society now treat such a man as an apostate, an \u0022antichrist\u0022, a \u0022wicked man\u0022 -- the descriptions which are found in the Society\u0027s favourite prooftexts for their disfellowshipping policies (2 John 7-11; 1 Cor 5:9-13).",
      "release": "2018-10-13T16:31:30Z",
      "duration": "00:06:10",
      "explicit": false,
      "youTubeId": "_BH8u4fukXw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_BH8u4fukXw"
      }
    },
    {
      "id": "f26948bf-0b2f-490d-b8ab-430f9dec1345",
      "title": "Ray Franz -- Jehovah\u0027s Witnesses \u0026 thought control: Captives to a concept -- not to Christ",
      "description": "When Ray Franz looks back upon his experience leaving \u0022God\u0027s organization\u0022, he is extremely non-judgmental. He believes the inhuman, unsympathetic treatment he and others received was an inevitable result of Jehovah\u0027s Witnesses\u0027 submission to an all-controlling concept -- God MUST have an \u0022organization\u0022. This ORG finally takes on a personality of its own -- an image which is bigger than and outside of human dimension. Indeed, even God Himself becomes dependent upon this unreal human construct -- He does not exist apart from it.",
      "release": "2018-09-28T19:30:36Z",
      "duration": "00:08:10",
      "explicit": false,
      "youTubeId": "1B1Str-gwhQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1B1Str-gwhQ"
      }
    },
    {
      "id": "831c140d-33fc-4b9f-a5b2-4ba8d01dd5ca",
      "title": "Why JW.ORG will fall, yet the CHURCH will stand --  Watchtower myth: \u0022Christendom apostate\u0022",
      "description": "As we indicated in our series on spiritist Johannes Greber, it is certainly disturbing that occultism agrees with Islam and the cults on at least one thing -- the churches of \u0022Christendom\u0022 have distorted, even changed, the Bible and/or the teachings of Christ and the Apostles. But what did Christ Himself indicate about the future course of the Church which He founded? Two parables of Matthew 13 help us.",
      "release": "2018-09-15T21:47:47Z",
      "duration": "00:10:31",
      "explicit": false,
      "youTubeId": "0nD4xo4UTPs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0nD4xo4UTPs"
      }
    },
    {
      "id": "e606539a-0fe8-4b0d-8f06-ff0a604585b9",
      "title": "Ray Franz -- How do you leave \u0022God\u0027s Organization\u0022? Why quit Watchtower Governing Body-- at 57?!",
      "description": "At age 57, Governing Body member Ray Franz faced his life crisis. He had learned that the Watchtower was NOT the \u0022true religion\u0022. How do you leave the faith to which you have committed all your life? But Ray Franz could not stay -- despite the perks, privileges and prominence. His conscience had been awakened by increased attention to the Word of God.",
      "release": "2018-07-27T12:55:15Z",
      "duration": "00:09:01",
      "explicit": false,
      "youTubeId": "ei8x-UlKYRM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ei8x-UlKYRM"
      }
    }
  ]
}