{
  "id": "35f40288-5c44-4a4d-a27b-e0bd07b62160",
  "name": "David Baxter",
  "youTubeChannelId": "UCb-PXHgNTDbBUB7sIH-DV8A",
  "episodes": [
    {
      "id": "8f8eb177-0942-40ce-85ea-ae835feee5ff",
      "title": "Political Cults: Why People Abandon Logic #uselection2024",
      "description": "Why Debating Politics With Morons Is Useless \n\nDebating politics with stubborn individuals is often a waste of time, and I’ll show you why. In this video, we break down the \u0022Mock Debate Problem,\u0022 confirmation bias, the backfire effect, and social identity theory, all of which explain why political debates often go nowhere. People cling to their beliefs even when faced with undeniable facts, turning every discussion into a battle of emotions instead of logic.\n\nEver tried debating with someone who refuses to listen to reason? You’ll recognize these classic signs—especially during election season. Don’t get dragged into a pointless argument. Let’s dive into how confirmation bias, social identity, and the backfire effect impact political debates (and why they’re mostly useless). Plus, there’s a lesson we can all learn from ducks. 🦆😉\n\nDISCLAIMER \nThis video is not intended to attack left-wing or right-wing political people. There are stubborn people on both sides of the political spectrum, which bury their heads in the sand, and aim at \u0022winning\u0022 every debate regardless of the evidence put in front of them. Nor is this aimed at the USA, people like this exist in every country, I simply used elements related to the US election to help with my video get some exposure. My aim here is to explore what is behind people who abandon critical thinking and talk like politicians towing the party line. My background in Philosophy means that I hold critical thinking in high regard and think it is always important to discuss, debate, reason and modify our opinions as the world changes. However, I do sincerely believe it is a waste of time to try and reason with people who debate like a hardcore fan of their favourite sports team. These people do not wish to discuss or reason, but simply attack or deflect in order to defend their opinions. I wanted to use this video to explore how and why people act like this. Should this video spark political discussion in the comments below, then please respect each other. \n\nFOLLOW: \n\nINSTAGRAM @davidbaxterphotos \nTIKTOK @davidbaxterphotos \nTWITTER (X) @davidjbaxter86\nYOUTUBE: @DavidBaxter\n\n00:00 Intro\n00:07 Mock Debates\n00:54 Confirmation Bias\n02:05 The Backfire Effect\n02:48 Why Is This?\n03:48 Outro\n\n#politicaldebates  #confirmationbias  #2024elections  #uselection2024  #democrats  #republicans  #politicaldivide  #votereducation #trump #kamalaharris  #uspolitics #biden #obama #psychology",
      "release": "2024-10-05T11:00:26Z",
      "duration": "00:04:08",
      "explicit": false,
      "youTubeId": "HDMGCgyc6Ko",
      "subjects": [
        "Political Cult",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HDMGCgyc6Ko"
      }
    }
  ]
}