{
  "id": "fc47fd6c-2522-406e-97d7-2619e11dd2bd",
  "name": "David Watson Podcast",
  "spotifyId": "3GZHwGz36LsCGPSIy7L0xM",
  "appleId": 1589033053,
  "youTubeChannelId": "UCRTvA346sy38CSqRfHjQa8g",
  "episodes": [
    {
      "id": "ac9c369c-bf56-4c89-a241-b85b91e9a753",
      "title": " Escaping A Cult, Saving His Family, Finding Faith Again – Peter Young",
      "description": "Escaping A Cult, Saving His Family, Finding Faith Again – Peter Young | The David Watson Podcast What if you only realised you were in a cult after it had already destroyed your marriage, family life and sense of self? \n\nIn this episode I sit down with author and former sports broadcaster Peter Young (authopeteryoung.com) to talk about his 20–year journey in and out of a tiny but devastating religious cult – led by a man his family called “Uncle Robert”. \n\nWe talk about how it all began with love, faith and a “harmless” family mentor… and slowly turned into total control, brainwashing and the destruction of Peter’s marriage. \n\nPeter shares how his children were taught he was “the devil”, how isolation and secrecy kept everyone trapped, and the moment a small flicker of doubt finally broke the spell. \n\nAlong the way we get into: – How Peter was slowly drawn into his wife’s tiny religious cult – The red flags he missed, and why “it could never happen to me” is so dangerous\n\nThe role of isolation, doubt and the “gatekeeper to God” in every cult \n\nHow cult leaders twist scripture, truth and genuine problems to sell their own solutions\n\nThe impact on his kids and the painful campaign of parental alienation\n\nHow his Christian faith survived, and why he believes Jesus pulled him out\n\nMy own brush with a meditation group that turned out to be far darker than it first appeared If you’ve ever thought “I’m too smart for a cult” or wondered how ordinary, intelligent people get swept up in these groups, this conversation will challenge you. \n\nListen in for a raw, honest look at manipulation, control, faith, pain and recovery and what to watch for if you (or someone you love) is getting drawn into something that feels “just a bit off”. \n\nFind Peter Young: Website: https://authorpeteryoung.com\n\nMemoir: “Stop the Tall Man, Save the Tiger” (cult survival and faith) Fiction series: \n\n“The Blue Team” and “The Wardrobe of the Wolf” (sports as a metaphor for life)",
      "release": "2025-12-11T11:12:53Z",
      "duration": "01:05:59",
      "explicit": false,
      "spotifyId": "2E8nE3nmuMwcoayuFmcSrY",
      "appleId": 1000740834612,
      "youTubeId": "ykpmB_yDojo",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2E8nE3nmuMwcoayuFmcSrY",
        "apple": "https://podcasts.apple.com/podcast/the-david-watson-podcast-233-escaping-a-cult-saving/id1589033053?i=1000740834612",
        "youtube": "https://www.youtube.com/watch?v=ykpmB_yDojo"
      }
    }
  ]
}