{
  "id": "6d2d9392-0fb2-4f17-ba79-299feb1b6c90",
  "name": "De Tenebris Cordis",
  "spotifyId": "5dVarI06TQkNDGfIySi0lG",
  "appleId": 1497133490,
  "episodes": [
    {
      "id": "2995097d-7ed2-4099-a867-98aaa1198b95",
      "title": "Jonestown",
      "description": "ATTENTION : Cet épisode contient des propos pouvant heurter la sensibilité de certaines personnes. Il est déconseillé aux jeunes auditeurs ou aux personnes sensibles. Pour une expérience optimale, je vous recommande d’écouter ce podcast avec un casque ou des écouteurs. Merci Le 18 novembre 1978, dans une clairière isolée du Guyana, 914 personnes trouvent la mort, dont 276 enfants. Derrière ce massacre : un homme. Jim Jones. Prêcheur, militant, manipulateur. Fondateur du Temple du Peuple, il promettait une utopie, il a construit un piège. Cet épisode revient sur l’ascension et la chute de ce faux prophète, sur les espoirs de ses fidèles, sur la paranoïa, les drogues, et les dernières heures d’une communauté devenue prisonnière d’un seul homme. Sources principales : – Extrait audio de la Jonestown Death Tape – Archives du Congrès américain – “The Violence of Jim Jones: A Biopsychosocial Explanation” (Candice Lys, Cultic Studies Review) – Témoignages d’anciens membres et articles de presse d’époque – “The cult of Jim Jones” National Geographic channel Bonne écoute ! Retrouvez moi sur instagram: https://www.instagram.com/detenebriscordis/",
      "release": "2025-08-07T11:10:01Z",
      "duration": "00:22:01.3770000",
      "explicit": false,
      "spotifyId": "6iUsszV7c9GXuwjuhUp1Qa",
      "appleId": 1000721043823,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6iUsszV7c9GXuwjuhUp1Qa",
        "apple": "https://podcasts.apple.com/podcast/jonestown/id1497133490?i=1000721043823"
      }
    }
  ]
}