{
  "id": "64140179-95af-425c-b761-bcddb38d0de3",
  "name": "DeadQuiet",
  "youTubeChannelId": "UCucMpnUWJAV9PeCaRrfiuGA",
  "episodes": [
    {
      "id": "a54da23b-1adb-4d24-a5c6-591d90936b76",
      "title": "These South American Cult Leaders Orchestrated Mass Murder",
      "description": "They promised spiritual truth—what followed was fear, control, and mystery. In this haunting episode of DeadQuiet, we examine the dark legacies of three cult leaders whose influence led to terrifying outcomes across Latin America.\n\n🩸 Adolfo Constanzo (Mexico) – Known as the “Narco-sorcerer,” Constanzo led a violent cult on the Mexico–U.S. border. What authorities uncovered in Matamoros revealed a twisted mix of ritual practice and criminal enterprise.\n🌙 Valentina de Andrade (Brazil) – The founder of Lineamento Universal Superior claimed to receive messages from higher beings. But her teachings turned deeply disturbing, with accusations of manipulation and disappearances tied to her group.\n🕯️ Mauricio Hernandez Norambuena (Chile) – Though widely known for political militancy, Norambuena was linked to a chilling case involving ritualistic elements that blurred the lines between ideology and fanaticism.\n\nThese aren’t just stories about belief—they’re about control, secrecy, and what can happen when spiritual power is abused.\n\n🔔 Subscribe to DeadQuiet for weekly horror documentaries uncovering strange groups, abandoned ideologies, and eerie mysteries from forgotten parts of the world.\n\n📍 Chapters\n00:00 - Intro\n00:08 - Adolfo Constanzo (Mexico)\n06:34 - Valentina de Andrade (Brazil)\n11:44 - Mauricio Hernandez Norambuena (Chile)\n17:33 - Outro\n\n🕯️ About DeadQuiet\nWe explore real horror stories buried beneath history—mysterious movements, dark beliefs, and eerie encounters with the unknown.\n\n⚠️ Disclaimer\nThis video is a documentary-style, educational production created to inform and explore historical and mysterious topics. All imagery and footage are illustrative and are not taken from the actual scenes or individuals involved. This content is not designed for shock value or sensationalism. Every effort has been made to handle the subject matter with care, context, and respect. DeadQuiet aims to comply fully with YouTube’s content guidelines while delivering informative and compelling storytelling.",
      "release": "2025-08-01T17:00:18Z",
      "duration": "00:17:59",
      "explicit": false,
      "youTubeId": "7OKETcEOtvw",
      "subjects": [
        "Adolfo Constanzo",
        "Superior Universal Alignment"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7OKETcEOtvw"
      }
    }
  ]
}