{
  "id": "e13d02e9-794b-459f-b318-42d4499e8f00",
  "name": "Dear Chelsea",
  "spotifyId": "0rRIRaKayhNsiEXU130o3a",
  "appleId": 1563085598,
  "youTubeChannelId": "UC8GZ63MpO9j5l6EVOhB5cwQ",
  "episodes": [
    {
      "id": "efb147ee-0bc8-414b-ae68-4b25ec3259ad",
      "title": "Escaping a Cult with Bethany Joy Lenz",
      "description": "One Tree Hill star Bethany Joy Lenz joins Chelsea to discuss what it was like to fall prey to a religious cult, to be taken for every penny she had, and finally find small moments of joy after escaping their grasp. Then: A child of powerful members of a *certain religious organization* works to accept that she may have lost her parents forever. * Need some advice from Chelsea? Email us at DearChelseaPodcast@gmail.com * Executive Producer Catherine Law Edited \u0026 Engineered by Brad Dickert * * * * * The views and opinions expressed are solely those of the Podcast author, or individuals participating in the Podcast, and do not represent the opinions of iHeartMedia or its employees. This Podcast should not be used as medical advice, mental health advice, mental health counseling or therapy, or as imparting any health care recommendations at all. Individuals are advised to seek independent medical, counseling advice and/or therapy from a competent health care professional with respect to any medical condition, mental health issues, health inquiry or matter, including matters discussed on this Podcast. Guests and listeners should not rely on matters discussed in the Podcast and shall not act or shall refrain from acting based on information contained in the Podcast without first seeking independent medical advice. See omnystudio.com/listener for privacy information.",
      "release": "2024-12-12T08:05:00Z",
      "duration": "01:02:50.3450000",
      "explicit": true,
      "spotifyId": "0wNhUsrefBtPhyKlF0C5Jb",
      "appleId": 1000680113249,
      "youTubeId": "UhplvbjKzBg",
      "subjects": [
        "The Big House Family",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0wNhUsrefBtPhyKlF0C5Jb",
        "apple": "https://podcasts.apple.com/podcast/escaping-a-cult-with-bethany-joy-lenz/id1563085598?i=1000680113249",
        "youtube": "https://www.youtube.com/watch?v=UhplvbjKzBg"
      }
    },
    {
      "id": "29fbd756-cbb8-4106-9729-b82492af8f16",
      "title": "Tarot, Cults \u002B Body Counts with Christina Ricci | Dear Chelsea",
      "description": "🛎 If You\u0027re New Subscribe ► https://www.youtube.com/@DearChelseaPod\n\nTarot, Cults \u002B Body Counts with Christina Ricci | Dear Chelsea\n\nChristina Ricci joins Chelsea to talk about her new tarot deck, why even 3-year-olds should have boundaries, and having a dad with a cult of his own.  Then: A wife struggles with guilt over her judgmental family.  A 30-something worries about escalating fights between her in-laws.  And a girlfriend’s body count is a point of contention in her relationship - but should it be?\n*\nFind Christina’s Tarot deck Cat Full of Spiders here! - https://www.amazon.com/Christina-Riccis-Spiders-Tarot-Guidebook/dp/B0D1CSXC96/ref=sr_1_1?crid=17UWZLOU1CUVF\u0026dib=eyJ2IjoiMSJ9.wQogvHtzqM0SIFV_rOyMkJTMW3R9STg_NFoKD7UniRea2KSGCYUGTFit-YdLs-X-0CWxyZMgM4MxuMVl8ovR1b49Y2QDReaQb8c6w_heQxzj6nfqqldAXxF2lnMrQCXbLn8MI7xvKuMFiiaRWZHT00hsh0af7CCx2HtDWNmEBPIpQU3y-N3waLEUzDvnl4kt.xTEyssoEb3OZrQ7vMclFUY7z_Iy76he_i8Tgxzvspas\u0026dib_tag=se\u0026keywords=cat\u002Bfull\u002Bof\u002Bspiders\u002Btarot\u002Bdeck\u0026qid=1731521003\u0026sprefix=cat\u002Bfull\u002Bof\u002Bspiders%2Caps%2C197\u0026sr=8-1\n*\nNeed some advice from Chelsea? Email us at DearChelseaPodcast@gmail.com\n*\nExecutive Producer Catherine Law\nEdited \u0026 Engineered by Brad Dickert\n*\n*\n*\n*\n*\nThe views and opinions expressed are solely those of the Podcast author, or individuals participating in the Podcast, and do not represent the opinions of iHeartMedia or its employees.  This Podcast should not be used as medical advice, mental health advice, mental health counseling or therapy, or as imparting any health care recommendations at all.  Individuals are advised to seek independent medical, counseling advice and/or therapy from a competent health care professional with respect to any medical condition, mental health issues, health inquiry or matter, including matters discussed on this Podcast. Guests and listeners should not rely on matters discussed in the Podcast and shall not act or shall refrain from acting based on information contained in the Podcast without first seeking independent medical advice. \n\nOriginal Air Date: November 14, 2024\n\n❤️ iHeartRadio » https://bitly.cx/TznP\n📢 APPLE PODCASTS » https://bitly.cx/2sl2G\n🟢 SPOTIFY » https://bitly.cx/oSq9\n🎥 PREVIOUS VIDEO » https://youtu.be/HvRs9xWZ2Xs\n\n✨ KEEP IN TOUCH WITH :\nINSTAGRAM » https://www.instagram.com/chelseahandler/\nTWITTER » https://x.com/chelseahandler\nFACEBOOK » https://www.facebook.com/chelseahandler\n\nOn this weekly advice show, comedian \u0026 author Chelsea Handler answers listener questions with the hilarious edge you know her for. Joined each week by co-host Catherine Law and celebrity guests, Chelsea never shies away from giving her honest opinion on everything from love, sex and weed to family issues or losing a loved one. Every episode takes you on a ride from funny and informative to inspirational and heartbreaking – and back again. Do you need advice from Chelsea? Send us your question at: DearChelseaPodcast@gmail.com\n\nNew episodes weekly on iHeartRadio.\n\nTags #DearChelsea #DearChelseaPod #DearChelseaPodcast #ChelseaHandler #ChelseaHandlerPodcast #ChelseaHandlerPod #ChelseaHandlerYoutubePodcast  #iHeartPodcasts #iHeart #Podcast #Podcasttolisten #YoutubePodcast #NewPodcast #ChristinaRicci",
      "release": "2024-11-14T17:00:26Z",
      "duration": "00:59:35",
      "explicit": false,
      "spotifyId": "0W0cEbgMeQjwuOpoYDvDsg",
      "appleId": 1000676923140,
      "youTubeId": "X1_qSEkfTU8",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0W0cEbgMeQjwuOpoYDvDsg",
        "apple": "https://podcasts.apple.com/podcast/tarot-cults-body-counts-with-christina-ricci/id1563085598?i=1000676923140",
        "youtube": "https://www.youtube.com/watch?v=X1_qSEkfTU8"
      }
    }
  ]
}