{
  "_ts": 0,
  "id": "9d86bb66-2e44-44e3-aa58-1f67b390a3b8",
  "name": "Deceived",
  "spotifyId": "1qfXLQTQ5gOqxw70ANCKmW",
  "appleId": 1298554174,
  "episodes": [
    {
      "id": "30b83f73-b28b-4d58-9e5a-9d43ecb26ef8",
      "title": "Ep. 01 The Greatest Martial Arts Master That Ever Lived?",
      "description": "Some believe he was the greatest martial arts master that ever lived; faster and more powerful than Bruce Lee, more feared than Chuck Norris. To his followers, he had supernatural powers. Some said he could levitate and walk up the sides of buildings. To others, he appeared as a demon beast that haunted their dreams. On DECEIVED, we will peel away the mystery of a Korean immigrant who rose from being a janitor, to running a martial art school empire. This is the true story of the notorious martial art cult known as Chung Moo Quan; its powerful leader, Master John C. Kim.",
      "release": "2020-09-30T16:00:00Z",
      "duration": "00:28:52.2500000",
      "explicit": false,
      "spotifyId": "4mkpNFqlp6j7PMl2oy1pte",
      "appleId": 1000394070024,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mkpNFqlp6j7PMl2oy1pte",
        "apple": "https://podcasts.apple.com/podcast/ep-01-the-greatest-martial-arts-master-that-ever-lived/id1298554174?i=1000394070024"
      }
    },
    {
      "id": "0846ecf3-4ccf-466a-b926-c89a52021579",
      "title": "Ep. 02 The Ad Looked Innocent Enough",
      "description": "When you stop at a coffee shop or a pizza place, you don’t expect to worry about being drawn into a cult. But there it was, right next door. An ad starts a teenager on an eight year nightmare, being drawn into the Chung Moo Quan. On DECEIVED, we will peel away the mystery of a Korean immigrant who rose from being a janitor, to running a martial art school empire. This is the true story of the notorious martial art cult known as Chung Moo Quan; its powerful leader, Master John C. Kim; and of one of the few men who would dare to oppose him.",
      "release": "2020-09-29T16:00:00Z",
      "duration": "00:35:21.5400000",
      "explicit": false,
      "spotifyId": "1eNPKPnzc6jqj8eAj6R0LW",
      "appleId": 1000394318303,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1eNPKPnzc6jqj8eAj6R0LW",
        "apple": "https://podcasts.apple.com/podcast/ep-02-the-ad-looked-innocent-enough/id1298554174?i=1000394318303"
      }
    },
    {
      "id": "4b1c6fa6-f820-446b-8a4e-2aea6f92fdb8",
      "title": "Ep. 03 Bait And Switch A Choice And An Omen",
      "description": "Russell experiences a lesson in Bait \u0026 Switch and makes choices between career, love or the Moo. He is given an omen sign. Is it a warning of unforeseen events to come? If you like Deceived Podcast please share with your friends, follow us on iTunes, SoundCloud and Twitter! Please write us a positive review! A lot of hard work was done to be able to tell this story! Thanks!",
      "release": "2020-09-28T16:00:00Z",
      "duration": "00:27:20.6200000",
      "explicit": false,
      "spotifyId": "6qAwv6iSaJgoW1Mz43ZkQ5",
      "appleId": 1000394598636,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6qAwv6iSaJgoW1Mz43ZkQ5",
        "apple": "https://podcasts.apple.com/podcast/ep-03-bait-and-switch-a-choice-and-an-omen/id1298554174?i=1000394598636"
      }
    },
    {
      "id": "f5b1cb73-a954-489d-9d54-f3e6e23e2462",
      "title": "Ep. 3 \u002B 1 Fears, Phobias, Superstitions, And Unlucky Numbers",
      "description": "Now, let’s say you’re shopping around for a good martial arts school and go into your local dojo in a strip mall to inquire about lessons. Upon meeting the instructor, he tells you the school will not only teach you martial arts, but also, they will instill within you irrational fears, phobias, and superstitions. And for a little extra money, they would throw in some rituals. He tells you by the time you reached black belt in their system, your head will be full of all kinds of weird shit. Would you run the other way?",
      "release": "2020-09-26T16:00:00Z",
      "duration": "00:30:42.3810000",
      "explicit": false,
      "spotifyId": "5KibMnPbgAhQ19qa5rRQO8",
      "appleId": 1000394871201,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KibMnPbgAhQ19qa5rRQO8",
        "apple": "https://podcasts.apple.com/podcast/ep-3-1-fears-phobias-superstitions-and-unlucky-numbers/id1298554174?i=1000394871201"
      }
    },
    {
      "id": "e2bcb1a7-8918-4c78-a987-49af6cd98c68",
      "title": "Ep. 05 Russell Is Conditioned To Respond To The Cults Every Command",
      "description": "One night while in a deep sleep, Russell felt a very hard slap on his waterbed and heard someone shout, “Wake up!” Without even thinking, still half asleep, he jumped to his feet and in bowing position said, “Yes, Instructor”. It was all instinct at this point. Standing in the bedroom was Keith Brown. He told Russell his waterbed was facing the wrong direction; it was bad to sleep with his head facing north. Keith explained that there was a certain bad energy from the north that could get into the mind at night, if he slept with his head facing north. Russell took this as a reference to North Korea. He immediately began to drain his waterbed, in order to take it apart and move it. It was 3 A.M.",
      "release": "2020-09-26T16:00:00Z",
      "duration": "00:29:58.8540000",
      "explicit": false,
      "spotifyId": "0MzwooBA2HHMlEW3oUA8MH",
      "appleId": 1000395168887,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0MzwooBA2HHMlEW3oUA8MH",
        "apple": "https://podcasts.apple.com/podcast/ep-05-russell-is-conditioned-to-respond-to-the-cults/id1298554174?i=1000395168887"
      }
    },
    {
      "id": "79fd4786-9a38-4140-9e99-658a711f8861",
      "title": "Ep. 06 The Three Weaknesses Of An Instructor",
      "description": "Russell was told, that Master Kim said a Chung Moo Quan instructor had 3 weaknesses: women, alcohol, and gambling. He was told that women were faulted by design, and that they had no minds. An instructor could lose his mind over a woman; they want control over the relationship, and the man. Russell had a hard time with this thinking, because he was raised by his mother, one of the most wonderful people he’d ever known. One of the stories Keith liked to repeat was that, as part of Master Kim’s training, Grandmaster Wang Po ordered him to sleep with 3,000 women. Not only was he to sleep with them, but get a picture with each one. The purpose of the story was, to say Master Kim had a deeper understanding of women, which could be used to justify his non-feminist views taught at School. It was said that after Master Kim had slept with all these women, they either became nuns or committed suicide, because they could not be with him. This was before digital cameras; Russell’s thought was: that the Master’s film development bill each month must have been huge.",
      "release": "2020-09-25T16:00:00Z",
      "duration": "00:19:41.8400000",
      "explicit": false,
      "spotifyId": "2ke35VbodUTo5veiTLbMDh",
      "appleId": 1000395444941,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ke35VbodUTo5veiTLbMDh",
        "apple": "https://podcasts.apple.com/podcast/ep-06-the-three-weaknesses-of-an-instructor/id1298554174?i=1000395444941"
      }
    },
    {
      "id": "c6c30b57-663b-414a-a5b3-5c551c5fbd6b",
      "title": "Ep. 07 Death Inside The School Of Chung Moo Quan",
      "description": "Part of learning to handle a Chung Moo Quan Martial Arts School involved giving a private lesson. Each ‘information’ that came into the School was treated differently- Everyone’s searching for something; that’s what brought them to the School. The instructor’s job was to figure out what that was. When they came in, instructors used ‘sideways conversation’ to ask questions without revealing the agenda. The first thing was to get them to take a free private lesson. Once they agreed, have them sign a release form, which was known in the School as the DDM form, which stood for - ‘death doesn’t matter’. There was a story that an ‘information’ came into a Chicago School, signed the form, challenged the instructor, and the man was killed. The release form stated that death may occur during private lessons at the School, so they release all rights to hold the School responsible. Most of the time you wouldn’t tell the information what was on the form; other times you’d see there was a guy who wanted to cause a problem, i.e. fight. Then you made very clear the form says death may occur. If they still wanted to fight, you gave them a quarter and pointed at the gas station across the street and told them to go call 911 because after the fight one of us would be leaving in an ambulance.",
      "release": "2020-09-24T16:00:00Z",
      "duration": "00:33:40.3750000",
      "explicit": false,
      "spotifyId": "31afHM8oBmd9ZoRXEqpwLf",
      "appleId": 1000396613404,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/31afHM8oBmd9ZoRXEqpwLf",
        "apple": "https://podcasts.apple.com/podcast/ep-07-death-inside-the-school-of-chung-moo-quan/id1298554174?i=1000396613404"
      }
    },
    {
      "id": "b4597a08-e905-49c0-a560-73a2c06cab23",
      "title": "Ep. 08  Russell Johnson Is Hours Away From Death",
      "description": "From the beginning of Russell’s training in School, he heard that Master Kim had the power to heal, and that he had a medical doctor’s degree. Russell watched as Aden performed acupressure, knowledge that he believed Master Kim had passed on to Aden. Keith told of an instructor in the Chicago area, who’d been dying in the hospital with some mysterious disease, that most assumed was cancer. All the doctors were in the hospital room, surrounding the instructor, when “Master” Kim entered. When he saw Master Kim, the instructor tried to get up from his death bed to bow, but Master Kim told him to stay down. Master Kim made all the doctors leave the room, even though they disagreed wildly. A short time later, Master Kim opened the door to announce, the instructor had been cured. The doctors were amazed and bewildered.",
      "release": "2020-09-23T16:00:00Z",
      "duration": "00:43:27.1640000",
      "explicit": false,
      "spotifyId": "0X5RnmUtz1ayHtIZReFNrz",
      "appleId": 1000397291861,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0X5RnmUtz1ayHtIZReFNrz",
        "apple": "https://podcasts.apple.com/podcast/ep-08-russell-johnson-is-hours-away-from-death/id1298554174?i=1000397291861"
      }
    },
    {
      "id": "6c107de3-b376-43d9-97b6-c12bfd1a7387",
      "title": "Ep. 09 True Right And Correct",
      "description": "By passing out the flyers and signing up students for the school, I had changed people’s lives. I have heard from a few people, that listening of my podcast series has caused them to have nightmares and flashbacks. One friend said he did not know if he should hug me or hit me. PTSD is not uncommon for former cult members and it is certainly not uncommon among former Moo members. Because I had recruited a number of people into the Moo, I wanted to stop more from joining and pull more out than I ever signed up. I believe I have accomplished this goal.",
      "release": "2020-09-23T02:00:00Z",
      "duration": "00:16:25.2540000",
      "explicit": false,
      "spotifyId": "6KxlNLCYP30uFFUwMaL2kD",
      "appleId": 1000398556792,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KxlNLCYP30uFFUwMaL2kD",
        "apple": "https://podcasts.apple.com/podcast/ep-09-true-right-and-correct/id1298554174?i=1000398556792"
      }
    },
    {
      "id": "c7d5031f-ee13-465b-a069-2731545eacb9",
      "title": "Ep. 10 Opening A New Chung Moo Quan School",
      "description": "When a new School opened for the first time, the instructors and assistants would stand quietly in the waiting area. Inside the practice area the National Instructors placed a prayer, from Master, behind the Korean and American flags. This is similar to a christening ceremony, in this case the blessing of Master Kim. Believing that Master Kim had the ability to put his mind into objects, this ritual allowed Master Kim to put his mind into the School. From that day forward, when they entered the practice area for the first time each day, they would stand toward the flags in bowing position. This was a long bow, so they could clear their minds of all outside influences and direct their thoughts towards Master Kim and Chung Moo Quan training. The ritual was silent and meditative. Russell would learn years later that the prayer note, placed behind the flags, asked to make Master Kim one of the richest men in the world. Russell thought Master Kim believed that if enough instructors bowed to the flags and thought about him, it would increase the chances of the prayer being answered.",
      "release": "2020-09-22T16:00:00Z",
      "duration": "00:25:35.7730000",
      "explicit": false,
      "spotifyId": "0CEks749W6xl1h3t55KHq8",
      "appleId": 1000399070220,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CEks749W6xl1h3t55KHq8",
        "apple": "https://podcasts.apple.com/podcast/ep-10-opening-a-new-chung-moo-quan-school/id1298554174?i=1000399070220"
      }
    },
    {
      "id": "e4ae32e6-2ba9-4541-ad16-27f63156258a",
      "title": "Ep. 11  The Death Of John Brice Maddox",
      "description": "The Death of John Brice Maddox Perhaps one of the biggest mysteries of The Moo, was what happened the night that instructor John Brice Maddox died, at The Moo compound in Naperville, known as ‘The Farm‘. It would be the topic of internet chat rooms, discussion boards, and private conversations. Oddly enough, it was the one topic that the Moo would not comment on. In 1991, Russell Johnson first heard the name of John Brice Maddox, during a meeting with Assistant Illinois Attorney General Lynn Worley. Worley, who was suing the Moo Schools for consumer fraud, told Russell that Maddox drowned in the pool at the farm. She was curious about details of the death, but no one was talking. Worley searched public records, and discovered that two years after John’s death, someone got a moving violation using his driver’s license.",
      "release": "2020-09-21T16:00:00Z",
      "duration": "00:27:55.7140000",
      "explicit": false,
      "spotifyId": "4albuXsv7Pbhruzuc8KcYK",
      "appleId": 1000399611600,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4albuXsv7Pbhruzuc8KcYK",
        "apple": "https://podcasts.apple.com/podcast/ep-11-the-death-of-john-brice-maddox/id1298554174?i=1000399611600"
      }
    },
    {
      "id": "9277e215-19c6-4ba3-a92b-be4e5c24774c",
      "title": "Ep. 12 CBS Reporter Pam Zekman Exposes Chung Moo Quan As A Cult",
      "description": "Chung Moo Quan: The Cult and the Con In the mid-1980s Pam Zekman, an investigative reporter for CBS Affiliate WBBM TV in Chicago, received a tip about the Chung Moo Quan martial arts schools, and started an investigation. Zekman is known for her aggressive investigative work. She has shared two Pulitzer Prizes for investigative reporting, for the Chicago Tribune and the Chicago Sun-Times. One of the tips was about a woman who started taking her son into a local Chung Moo Quan school for lessons. While waiting for her son during his lessons, she began a friendship with the instructor and enrolled in lessons herself. The friendship was said to have possibly evolved into a relationship. The married woman’s family intervened, and hired Clinical Psychologist Dr. Edwin Morse to counsel her. According to Dr. Morse, in the spring of 1988 he began working with the woman, who was involved in Chung Moo Quan in the Chicago area. During this therapy, it became evident to him, that the woman was following behavioral and attitudinal practices contrary to her normal mode of operating, before she entered the School. Russell Johnson talked with her husband and he told him that he had hired someone to follow Master Kim, and take pictures of him. The pictures, along with a note, were sent to Master Kim, saying that he could be gotten to, and to leave the man and his family alone. The harassment stopped after that. He expressed to Russell Johnson that he would like nothing better than to see Master Kim dead. Russell took him seriously, but at the time could not comprehend why someone could hate Master Kim so much, that they would want him dead and now Russell Johnson says he is happy that Kim is dead.",
      "release": "2020-09-20T16:00:00Z",
      "duration": "00:36:24.8860000",
      "explicit": false,
      "spotifyId": "0pKaY1FhSiNAOkIMl0yph0",
      "appleId": 1000400135815,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pKaY1FhSiNAOkIMl0yph0",
        "apple": "https://podcasts.apple.com/podcast/ep-12-cbs-reporter-pam-zekman-exposes-chung-moo-quan-as-a-cult/id1298554174?i=1000400135815"
      }
    },
    {
      "id": "975fca8c-5f3d-4358-9bbd-83e5c7d30b83",
      "title": "Interview with Deceived Podcast Producer Russell Johnson",
      "description": "Charles Hubbell interviews Deceived Podcast Producer Russell Johnson. Russell survived eight years in a cult, and is dedicated to informing others about the deceptions of Chung Moo Quan and other dangerous cults. Russell learned research, became a private investigator, and today works in the security field. He has also immersed himself in film and television: as a writer, production assistant, actor, producer, location manager, and on the Development Team at Twin Cities Film Fest. In this interview, Russell explains what to expect in the 12 episodes of Deceived: The Moo Years. He hopes to help the general public, by learning critical thinking, to recognize cults, and how to evaluate a threat. He expects new information to come forward as a result of the podcasts. Russell introduces those that influenced him, helping him decide to do the podcast, and those that helped assemble the podcast series. Russell is interested in getting the truth out there, and finding out: Who was John C. Kim? \u0022Deceived: The Moo Years\u0022 is the true story of one young man\u0027s compelling, at times terrifying, former involvement with the martial arts cult Chung Moo Quan.",
      "release": "2020-09-19T16:00:00Z",
      "duration": "00:50:53.7640000",
      "explicit": false,
      "spotifyId": "6y63Tbgrbp8DfkQAHtaIzN",
      "appleId": 1000394397104,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6y63Tbgrbp8DfkQAHtaIzN",
        "apple": "https://podcasts.apple.com/podcast/interview-with-deceived-podcast-producer-russell-johnson/id1298554174?i=1000394397104"
      }
    },
    {
      "id": "3ef751f1-9da4-4e5e-ab6b-16ea16b9e69e",
      "title": "Interview with Motion Picture Story Analyst David Bruskin",
      "description": "Charles Hubbell interviews David Bruskin. David spent 25 years as a motion picture story analyst, during which he worked on films that collectively grossed over a billion dollars, including FORREST GUMP, A LEAGUE OF THEIR OWN, and WHAT HAPPENS IN VEGAS. David also worked as Director of Development for Laura Ziskin Productions and is an author. He served as a story and editorial consultant for the \u0022Deceived\u0022 Podcast Series. In this interview, David talks about his 25-year career in Hollywood as a studio story analyst and offers insight as to what makes a story great and compelling, and why he wanted to work on Russell Johnson’s \u0022Deceived\u0022 Podcast series. ",
      "release": "2020-09-18T16:00:00Z",
      "duration": "00:29:05.2760000",
      "explicit": false,
      "spotifyId": "1sOCGGhWAKKnfKDDmOoTl6",
      "appleId": 1000394910592,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1sOCGGhWAKKnfKDDmOoTl6",
        "apple": "https://podcasts.apple.com/podcast/interview-with-motion-picture-story-analyst-david-bruskin/id1298554174?i=1000394910592"
      }
    },
    {
      "id": "a3db4b23-6a15-48da-9c8b-0015207345b1",
      "title": "Interview with Martial Arts Pioneer John Graden",
      "description": " Show host Charles Hubbell interviews martial artist John Graden. A pioneer in American Martial Arts, John is a former member of many world champion U.S. kickboxing teams and an inductee into The World Martial Arts Hall of Fame. John’s martial arts management system is used by martial arts schools across the United States. In 1997, as publisher of the magazine for NAPMA (National Association of Professional Martial Artists), he did a three-month series on John C. Kim and Chung Moo Quan titled “The Cult in the Quan: the Fall of a Martial Arts Magnet,” which included interviews with podcast creator Russell Johnson. In this interview, John talks about his history in martial arts, his book WHO KILLED WALT BONE?, his opinions on the legitimacy of championships and titles in the martial arts, the cost of martial arts lessons, and cults in the martial arts. John’s off-the-cuff, no-holds-barred interview offers unique perspective and insights into the world of martial arts. \u0022Deceived: The Moo Years\u0022 is the true story of one young man\u0027s compelling, at times terrifying, former involvement with the martial arts cult Chung Moo Quan. ",
      "release": "2020-09-17T16:00:00Z",
      "duration": "00:45:59.0040000",
      "explicit": false,
      "spotifyId": "1i9x5JuiDZMMcRAHfE5WVK",
      "appleId": 1000400716230,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1i9x5JuiDZMMcRAHfE5WVK",
        "apple": "https://podcasts.apple.com/podcast/interview-with-martial-arts-pioneer-john-graden/id1298554174?i=1000400716230"
      }
    },
    {
      "id": "63ebcaf9-bfb0-4965-9b87-7cf6d8a95d40",
      "title": "Interview with Author and Cult Expert Steve Hassan",
      "description": "Deceived Podcast Series, show host Charles Hubbell interviews Steve Hassan, founder of the Freedom of Mind Resource Center. For nearly four decades, Steve has lectured and counseled about brainwashing, deprogramming, mind control, cults, and undue influence. As a 19-year-old college student, he was recruited into the Unification Church, or Moonies, and rose to the rank of Assistant Director, even personally meeting Reverend Sun Myung Moon. Within three years, however, Steve was helping people exit destructive cults and, over the years, he developed non-coercive methods to help cult members quit their groups. In 1990, after reading one of Steve’s books, podcast producer Russell Johnson sought out the author and received counseling from him. Steve put Russell in contact with a reporter working on a story about Chung Moo Quan, which led to Russell speaking out for the first time in public about the Moo. In this interview, Steve explains everything you always wanted to know about cults – or not – but were afraid to ask, including recruitment, avoidance, exit strategies, deprogramming, and how one becomes stronger for exiting and surviving a cult. Steve also discusses cult leaders: how cults “clone” the leader’s image, and their common type of narcissistic psychopathological personality disorder. \u0022Deceived: The Moo Years\u0022 is the true story of one young man\u0027s compelling, at times terrifying, former involvement with the martial arts cult Chung Moo Quan.",
      "release": "2020-09-16T16:00:00Z",
      "duration": "00:52:29.6920000",
      "explicit": false,
      "spotifyId": "5Gn1wLaz3Lp2kNjNH1ExkC",
      "appleId": 1000401223240,
      "subjects": [
        "Unification Church",
        "Cult Psychology",
        "Oom Yung Doe",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Gn1wLaz3Lp2kNjNH1ExkC",
        "apple": "https://podcasts.apple.com/podcast/interview-with-author-and-cult-expert-steve-hassan/id1298554174?i=1000401223240"
      }
    },
    {
      "id": "1a9ce1e7-14ab-4f08-993d-f2d22e51d41d",
      "title": "Interview with Martial Arts Master Kym Rock (Fight Like a Girl)",
      "description": "Charles Hubbell interviews Kym Rock. Kym is a 6th Degree Black Belt, 7 time female world karate champion, Hall of Fame Member of both the World Karate Union and the United States Martial Arts Alliance, and Instructor of the Year in four different categories. While going through a divorce In 2011 Russell Johnson moved next door to Kym Rock. The two became close friends and confidantes. At this point in his life Russell Johnson had not spoken about the Moo in many years. Kym encouraged Russell and was the catalyst for him sharing his story today. Kym recruited Russell to act in her women’s “Fight Like a Girl” self-defense videos, which ignited a passion in Russell that began his film and acting career. In this interview, Kym tells how she became involved in martial arts, how she developed a system that works for everyone including women – called ‘Fight Like A Girl’, and how learning the mental portion of the martial arts should come first, and the physical portion will follow. She explains how to find a good martial arts school. She tells how she met Russell Johnson and was drawn to his story. \u0022Deceived: The Moo Years\u0022 is the true story of one young man\u0027s compelling, at times terrifying, former involvement with the martial arts cult Chung Moo Quan.",
      "release": "2020-09-15T16:00:00Z",
      "duration": "00:31:45.3850000",
      "explicit": false,
      "spotifyId": "4Esn7lg6MkrDxqyOur6KeV",
      "appleId": 1000401934846,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Esn7lg6MkrDxqyOur6KeV",
        "apple": "https://podcasts.apple.com/podcast/interview-with-martial-arts-master-kym-rock-fight-like/id1298554174?i=1000401934846"
      }
    }
  ]
}