{
  "id": "1ad66d00-b82c-4298-b0f8-54d2e1c17dd8",
  "name": "DeClutter",
  "youTubeChannelId": "UCVOOARIld_fVnaUKjocxmlA",
  "episodes": [
    {
      "id": "3dccae4c-abbf-4d4f-8731-b2d71d39eb0d",
      "title": "Sex in OSHO’s Ashrams || Dark Reality of the Cult Guru \u0026 his Fall",
      "description": "Explore the untold truth behind the seemingly utopian world of OSHO’s ashrams as we delve into the dark and controversial practices that took place within the spiritual community. In this eye-opening video, we uncover the shocking reality of sexual exploits that transpired under the guise of spiritual liberation.\n\nJoin us as we examine the fall from grace of the charismatic cult leader, OSHO, whose teachings once captivated thousands worldwide. Unearth the unsettling details of the sexual dynamics that unfolded within the ashrams, challenging the perception of enlightenment and exposing the cult\u0027s disturbing underbelly.\n\n WARNING: This content may be distressing for some viewers due to its explicit nature. Viewer discretion is advised.\n\nOur investigation brings to light testimonies, documents, and historical accounts to provide a comprehensive understanding of the dark chapters in OSHO’s legacy. Discover how the cult leader\u0027s charisma and influence led to a web of manipulation and exploitation.\n\nPrepare to be stunned as we unravel the intricate web of deceit, scandal, and controversy surrounding OSHO\u0027s ashrams. Subscribe now for a deep dive into a hidden chapter of spiritual history that many would prefer to remain concealed.\n\n🔗 Share your thoughts in the comments below and engage in a respectful discussion about the darker aspects of spiritual communities. Remember to like, share, and subscribe to stay updated on our investigative content.\n\nTimecodes: \n0:00 Intro\n2:10 Early Childhood and Young Rajneesh\n4:44 Acharya Rajneesh To Bhagwan Rajeesh\n7:50 Rajneesh Moves To America\n10:23 Was Osho A Fraud\nhttps://youtu.be/4M0nYdFV4fg?feature=shared\n\nYour Queries: \nOsho teachings,Spiritual enlightenment,Mindfulness and meditation,Osho philosophy,Rajneesh movement,Eastern spirituality,Western philosophy,Osho discourses,Controversial gurus,Osho biography,Rajneeshpuram commune,Osho followers,Self-discovery,Osho legacy,Guru mysticism,Osho insights,Osho meditation techniques,Osho quotes,Osho documentary,osho,osho truth,osho reality,osho ashram reality,osho ashram,osho real story",
      "release": "2024-09-30T14:00:34Z",
      "duration": "00:15:14",
      "explicit": false,
      "youTubeId": "XdDI7FTaV5Y",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XdDI7FTaV5Y"
      }
    }
  ]
}