{
  "id": "5a99c1c2-a924-4543-b056-82a6d711c683",
  "name": "Deconstruction Zone",
  "youTubeChannelId": "UCXCy4XLzZmVgbNJIKGWgxrw",
  "episodes": [
    {
      "id": "e0691d09-0f7e-4c19-9b52-64be66e2b912",
      "title": "The INSANE List of Rules for the Word of Faith Fellowship Cult",
      "description": "The Word of Faith Fellowship church (WOFF) has been criticized and even prosecuted by former members. But it\u0027s unofficial list of rules might be the most jaw dropping artifact publicly available.\n\nRules can be viewed here...\n\nhttps://www.familiesagainstcultthreats.org/resources/WOFF---RULES-FOR-NEW-MEMBERS.pdf\n\nThe Word of Faith Fellowship (WOFF) church, based in Spindale, North Carolina, has faced numerous legal issues and allegations over the years. Here are some key points:\n\n1. **Allegations of Abuse**: The church has been accused of various forms of abuse, including physical, emotional, and spiritual abuse. Former members have reported being subjected to intense control, including forced confessions, physical beatings, and isolation from family and friends.\n\n2. **Legal Cases**: Several former members have filed lawsuits against the church, claiming they were subjected to abusive practices. In some cases, the church has settled out of court, while other cases have led to criminal investigations and charges.\n\n3. **Child Abuse Claims**: There have been multiple allegations of child abuse within the church. Some former members have testified that children were beaten in the name of discipline and subjected to harsh punishments.\n\n4. **Human Trafficking Allegations**: In 2017, the church was investigated for allegedly smuggling Brazilian nationals into the U.S. and forcing them to work for little or no pay. These individuals were reportedly threatened with deportation if they did not comply with the church\u0027s demands.\n\n5. **Control and Manipulation**: The church has been described as employing cult-like tactics to control its members. This includes isolation from non-church members, indoctrination, and financial exploitation.\n\n6. **Leadership and Influence**: The church is led by Jane Whaley, who has been a central figure in many of the allegations. She has been accused of exerting a high degree of control over church members and orchestrating the abusive practices.\n\n7. **Media Attention**: The WOFF has been the subject of numerous media investigations and reports, which have brought national and international attention to the allegations against the church. These reports have included detailed accounts from former members and investigative journalism pieces.\n\nThe church has consistently denied these allegations, stating that they are false and that the church is being unfairly targeted. However, the numerous testimonies and legal actions from former members have kept the spotlight on the church\u0027s practices and raised significant concerns about its operations.",
      "release": "2024-08-18T18:00:04Z",
      "duration": "00:04:59",
      "explicit": false,
      "youTubeId": "AjagRmXF8r8",
      "subjects": [
        "Word of Faith Fellowship"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AjagRmXF8r8"
      }
    }
  ]
}