{
  "_ts": 0,
  "id": "dea89ef9-b76a-475f-bb70-124ba4dff7fe",
  "name": "Deep Dive: Fascists, spies and gurus",
  "spotifyId": "2GJLMxHvC7U5KIdfMQZJmz",
  "episodes": [
    {
      "id": "fb3140aa-4856-40d5-87d8-0e0734374af5",
      "title": "The Children of God/The Family: Middle Europe 1990-2025",
      "description": "This episode focuses on how the infamous organization known as \u0022The Children of God\u0022 transformed and disguised itself as charitable entities to continue its activities and avoid public scrutiny in countries like Czech Republic, Germany, Switzerland, Serbia and Croatia.",
      "release": "2025-05-01T00:00:00",
      "duration": "00:14:22.5280000",
      "explicit": false,
      "spotifyId": "3uLD1zGPFyyizsseBOsQMh",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uLD1zGPFyyizsseBOsQMh"
      }
    },
    {
      "id": "cf05f5d0-ad10-4a33-96f9-1707be78ac28",
      "title": "Allatra/Creative Society: cult, disinformation and security threat",
      "description": "This lengthy report investigates AllatRa, an international movement originating in Ukraine, which has rebranded itself as the Creative Society to conceal its true nature. It asserts that despite presenting as a spiritual and humanitarian group, evidence suggests it functions as a cult-like organization with a hidden agenda and ties to geopolitical influence operations, specifically benefiting Russian interests. The podcast outlines AllatRa\u0027s origins, its blending of spiritual beliefs, pseudoscience, and conspiracy theories, and its shift to the Creative Society brand to gain legitimacy and broader reach. Furthermore, it highlights governmental actions taken against the group, particularly in Ukraine where it faced charges of treason, and notes attempts by figures associated with the movement, such as Egon Cholakian, to lobby in Western countries and engage with high-profile institutions using deceptive tactics and misinformation. The report concludes by comparing AllatRa\u0027s methods to established cult characteristics and recommends strategies for monitoring, public awareness, and legal action to counter its activities.",
      "release": "2025-04-30T00:00:00",
      "duration": "00:17:17.7220000",
      "explicit": false,
      "spotifyId": "2SpYctOXDfaD74pPSSc2wA",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2SpYctOXDfaD74pPSSc2wA"
      }
    },
    {
      "id": "4f115412-f147-46bf-ab8d-9a83ca630c92",
      "title": "Looking Beyond the Smokescreen: Responding to Cult Apologists",
      "description": "The podcast examines Luigi Corvaglia\u0027s refutation of the arguments used by cult apologists (the unscientific nature of brainwashing, religious freedom, difficulty of objectification, etc.) and highlights some of the logical fallacies they use. The result is a picture in which apologists appear to be an expression of the same right-wing differentialism that characterizes sovereignist movements. In fact, their defense of specific identities does not originate from respect for these, but from the need to counter the universality of rights.",
      "release": "2025-04-29T00:00:00",
      "duration": "00:19:44.6120000",
      "explicit": false,
      "spotifyId": "2A4U8KvizRNE6l0AQmKr1l",
      "subjects": [
        "Cult Apologists"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2A4U8KvizRNE6l0AQmKr1l"
      }
    },
    {
      "id": "81323797-ae47-467a-a437-fad842dce3d4",
      "title": "The spy who loved me. The Oleg Maltslev case",
      "description": "This episode examines the case of Oleg Maltsev, a controversial Ukrainian leader, and his ties to CESNUR (Centre for New Religion Studies), an organization known for defending new religious movements. The sources describe how CESNUR defended Maltsev from accusations of being an abusive cult, going so far as to publish a monographic issue about him. However, the situation escalated in 2024 when the Ukrainian authorities launched investigations into Maltsev and his organisation, culminating in the arrest of his close associate on charges of high treason and the discovery of an alleged spy structure and a paramilitary group operating on behalf of Russia. The articles underscore the irony of this situation, as CESNUR and related organizations have often accused anti-cult activists of having ties to Russia.",
      "release": "2025-04-28T00:00:00",
      "duration": "00:12:53.6880000",
      "explicit": false,
      "spotifyId": "76hMjNpienxaHwcfZj9PVW",
      "subjects": [
        "Cult Apologists"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/76hMjNpienxaHwcfZj9PVW"
      }
    },
    {
      "id": "73b102af-79e7-4bca-8edb-1ba6bbbccd41",
      "title": "Cults and hybrid war: the AllatRa case",
      "description": "The episode exposes how the cult named \u0022AllatRa\u0022, with its pseudoscientific and pro-Putin theories, infiltrates political and social institutions, also through its facade, the \u0022Creative Society,\u0022 which promotes conspiracy thesis on climate. It is highlighted that even a Chezh journalist has been investigated for opposing this movement, demonstrating its influence. The text suggests that AllatRa uses \u0022spiritual soft power\u0022 and pop culture to spread its propaganda and the concept of Slavic unification under Russia.",
      "release": "2025-04-25T00:00:00",
      "duration": "00:16:18.1630000",
      "explicit": false,
      "spotifyId": "3ssnmLAmJpoBj4EUHFvKzG",
      "subjects": [
        "AllatRa"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ssnmLAmJpoBj4EUHFvKzG"
      }
    },
    {
      "id": "9cd1682b-164a-4c2a-bbad-9f3a72e06485",
      "title": "Luigi Corvaglia\u0027s \u0022Submission as Preference Shifting (SAPS)\u0022 model of mind manipulation",
      "description": "Using classical experiments in social psychology such as those of Milgram and Asch, as well as concepts of behavioral economics such as the framing effect, the author argues that adherence to cults occurs through a progressive selection and a gradual increase in demands. Salience, or the importance attached to a situation or stimulus, is a key factor, as is procrastination in making difficult decisions. This process, similar to how companies use marketing and language to influence consumer choices, occurs indoors or in isolated environments where conformity is reinforced. The author departs from theories that see adherence to cults as a purely rational choice, proposing a model in which persuasion takes place by inserting individuals into rewarding relational contexts, as demonstrated by the analogy of \u0022Rat Park.\u0022",
      "release": "2025-04-25T00:00:00",
      "duration": "00:17:45.3770000",
      "explicit": false,
      "spotifyId": "3O8o5O5ntCO9LsJsXUBcfN",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3O8o5O5ntCO9LsJsXUBcfN"
      }
    },
    {
      "id": "8e37a413-70f2-4b58-8bce-f33232464a13",
      "title": "Beit Hallahmi\u0027s new book on \u0022 Advocacy for New Religious Movements\u0022",
      "description": "The author examines the history and dynamics of New Religious Movements (NRMs), focusing on violations committed by certain groups and their leaders, such as The Family, the Unification Church, People\u0027s Temple (Jonestown), Rajneeshpuram, the Branch Davidians (Waco), and Scientology. Particular attention is given to the complicity of some NRM scholars, accused of minimizing or denying abuses and crimes, often in exchange for funding or career opportunities. The text also discusses the debate on the academic legitimacy of defending these movements and the importance of an ethical and impartial analysis.",
      "release": "2025-04-25T00:00:00",
      "duration": "00:13:15.3760000",
      "explicit": false,
      "spotifyId": "5XU2g9ZvqMEZb2NQXcxZXY",
      "subjects": [
        "Branch Davidians",
        "Bhagwan Shree Rajneesh",
        "Peoples Temple",
        "Scientology",
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5XU2g9ZvqMEZb2NQXcxZXY"
      }
    },
    {
      "id": "3b242c3c-befb-4210-9ecf-84756de6dbac",
      "title": "The Cult apologist Mafia. Part 1: lobbing for cults",
      "description": "Luigi Corvaglia\u0027s shocking and disturbing investigation into the network linking cult apologists, Scientology, neocon foundations, Catholic traditionalists, the far right and intelligence services. In this first episode we describe the organizations lobbying for \u0022Religious Freedom\u0022. Several organizations carry out defamation and persecution against the anticult movement and actively work to put political pressure on \u0022new religious movements\u0022. Among the main ones active in Europe are the Belgian Human Rights Without Frontiers (HRWF), the French Coordination des associations et des particuliers pour la liberté de conscience (CAP LC) and the Italian European Federation for Freedom of Belief (FOB)4 .... These organizations are closely linked to groups such as Scientology and the Unification Church, and are registered as lobbies with the European Parliament and the European Commission",
      "release": "2025-04-24T00:00:00",
      "duration": "00:37:52.1650000",
      "explicit": false,
      "spotifyId": "29dxfQkftCl7kYMfHdlC0P",
      "subjects": [
        "Cult Apologists",
        "Cult-Expert",
        "Unification Church",
        "Scientology",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29dxfQkftCl7kYMfHdlC0P"
      }
    },
    {
      "id": "d873d1fb-d560-4f6b-a025-4f9e2025a49b",
      "title": "The Cult Apologist Mafia. Part 3: geopolitics of cults and double truth",
      "description": "This third episode of Luigi corvaglia\u0027s investigation on geopolitics of cults suggests that organizations such as TFP, Alleanza Cattolica, and CESNUR have adopted the doctrine of \u0022double truth\u0022 (derived from thinkers such as Leo Strauss and Plato), according to which it is permissible to use deception and public (esoteric) narratives to manipulate and control the masses, while the (esoteric) \u0022truth\u0022 is reserved for an elite. This would explain their advocacy of even \u0022unsavory\u0022 cults.",
      "release": "2025-04-24T00:00:00",
      "duration": "00:22:43.4060000",
      "explicit": false,
      "spotifyId": "2VORyJjXi09zOMXJszXOv0",
      "subjects": [
        "Cult Apologists",
        "Cult-Expert",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2VORyJjXi09zOMXJszXOv0"
      }
    },
    {
      "id": "df5f0fa5-8b4c-4c8a-b277-7be3eb173741",
      "title": "The Cult Apologist Mafia. Part 2: the black network",
      "description": "In this second installment of Luigi Corvaglia\u0027s investigation on geopolitics of cults: The role of traditionalist and neo-fascist Catholic organizations is highlighted, particularly Alleanza Cattolica and CESNUR with the figure of Massimo Introvigne, and their links to anti-communist geopolitics. Connections to right-libertarianism, Rodney Stark\u0027s Theory of Religious Economy promoting the deregulation of the \u0022religious market\u0022, and the funding of American conservative and libertarian groups for anti-secular and anti-LGBTQ\u0026#43; causes in Europe and elsewhere are also explored. Finally, the influence of this network on US foreign policy on religious freedom, particularly through bodies such as USCIRF, and the paradoxical connections between some of these groups and pro-Russian figures in recent times are discussed.",
      "release": "2025-04-24T00:00:00",
      "duration": "00:17:02.6060000",
      "explicit": false,
      "spotifyId": "5ZAbM8sje5fls0JiRK7Prt",
      "subjects": [
        "Cult Apologists",
        "Catholicism",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZAbM8sje5fls0JiRK7Prt"
      }
    }
  ]
}