{
  "id": "38037d44-68d0-407d-89e1-b37ffc0120ae",
  "name": "Defense Diaries Podcast",
  "spotifyId": "0duAplGAfvbaGmC6IVYxAh",
  "appleId": 1564661342,
  "youTubeChannelId": "UCuKo4YVEicZklmZXpaseyDQ",
  "episodes": [
    {
      "id": "e73e8254-5eed-4957-b71d-b5bf6b1e8d34",
      "title": "GARDENS OF EVIL: Inside the Zion Society Cult Podcast - Investigator Mike King Tells All",
      "description": "🔴 LIVE on Defense Diaries — Bob Motta and Ali sit down with retired law enforcement investigator and criminal profiler Mike King to discuss his new podcast \u0022Gardens of Evil: Inside the Zion Society Cult\u0022 and his book \u0022Deceived.\u0022\n\nFor over a decade, a quiet neighborhood in Ogden, Utah hid a terrifying secret. Behind the perfectly manicured lawns lived more than a hundred members of the Zion Society — a doomsday cult led by a soft-spoken landscaper who proclaimed himself a prophet of God. Weapons were stockpiled. Children were taken from their parents and groomed for abuse. And the whole operation hid in plain sight until one brave woman walked into an investigator\u0027s office and changed everything.\n\nMike King was that investigator. With over 40 years in law enforcement — including service as an investigator in the Weber County Attorney\u0027s Office and the Utah Attorney General\u0027s Office, criminal profiling training under the FBI, and work on the Emmy Award-winning documentary \u0022Who Killed King Tut?\u0022 — Mike led the 1991 takedown of the Zion Society. Now he\u0027s bringing the full story to a new audience through the Gardens of Evil podcast on the Gamut Podcast Network.\n\nIn this live conversation, we break down:\n⚖️ How the investigation unfolded from the defense and prosecution perspectives\n🔍 The challenges of investigating crimes against children inside a secretive cult\n🧠 How cult leaders use coercive control to manipulate followers\n📖 The story behind Mike\u0027s book \u0022Deceived\u0022 and why victims reconnected 30 years later\n🎙️ What to expect from the Gardens of Evil podcast series\nThis is the kind of case that exposes the failures — and the triumphs — of the criminal justice system. You don\u0027t want to miss it.\n\n🔔 Subscribe and hit the bell so you don\u0027t miss when we go LIVE!\n\n👇 LINKS 👇\n🎧 Gardens of Evil Podcast: https://podcasts.apple.com/us/podcast/gardens-of-evil-inside-the-zion-society-cult/id1748894795\n\n📕 \u0022Deceived\u0022 by Mike King available on Amazon \n\n🎥 Profiling Evil YouTube: @ProfilingEvil\n\n#DefenseDiaries #GardensOfEvil #ZionSociety #MikeKing #TrueCrime #CultInvestigation #Deceived #CriminalProfiling #TrueCrimePodcast #LiveStream",
      "release": "2026-02-03T22:29:39Z",
      "duration": "01:16:40",
      "explicit": false,
      "youTubeId": "r7vgx2R4idI",
      "subjects": [
        "Zion Community"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r7vgx2R4idI"
      }
    },
    {
      "id": "ce780cf8-a640-4149-a7dc-68de0139f6c2",
      "title": "ZIZIANS CULT EXAMINED WITH DR. SHILOH AND DR. SCOTT!",
      "description": "If you know nothing about the Zizian Cult, well then you are in for a real eye opener.  Joining us tonight are the brilliant and fabulous hosts of LA Not So Confidential Podcast, Dr. Shiloh and Dr. Scott!  I tried to get them to talk Kohberger but they said, you know what...we think we need to talk to about the Zizians.  I had heard nothing about this fiendish crew out of California but I did a little digging and I\u0027m very intrigued and I cannot think of anyone better to discuss this subject matter with than two forensic psychologists who are both so learned and fascinating to listen to that y\u0027all are going to wish this was a 5 hour live.\n\n#ZizianCult #Cults #truecrimecommunity #legalanalysis #pyschology #forensicscience #defensediaries",
      "release": "2025-03-28T02:51:34Z",
      "duration": "01:41:32",
      "explicit": false,
      "youTubeId": "FjLDWUlj3cc",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FjLDWUlj3cc"
      }
    }
  ]
}