{
  "id": "628ed611-1796-49f8-93e1-2098f576500f",
  "name": "Delusional! Big Dreams, Real Stories",
  "spotifyId": "1rEyHd4gqLyezSCGLKFOeU",
  "appleId": 1744208638,
  "youTubeChannelId": "UCaATzye_r6YhO1uJ6ouHYMw",
  "episodes": [
    {
      "id": "27c56894-306b-4796-a474-bc698007e84d",
      "title": "From Escaping a Cult to Making Millions",
      "description": "Breaking free from a controlled world is one thing. Rebuilding a life without education, resources, or a safety net is something far more extraordinary.\n\nIn this episode, Michelle Coyle meets with Ken Okazaki who shares how growing up in a cult shaped every belief he had and why questioning those beliefs became the first act of freedom. Leaving the group meant stepping into adulthood with zero preparation. His first break came from learning media inside his father’s seminar company, which opened the door to events, storytelling, and high‑stakes production at a scale he never imagined.\n\nKen also reveals the devastating event failure that nearly ruined him—and the decision to pay back every customer over two years instead of walking away. That commitment became the foundation of his reputation and the launchpad for the global content agency he runs today.\n\nReady to rethink what’s possible? Tune in to this episode of From Escaping a Cult to Making Millions.\n\nKey Points:\n00:00 Introduction  \n01:00 Ken’s childhood and upbringing\n03:45 Learning truth online\n04:45 The travel mission that started the change\n07:29 Marriage, parenting, rising doubts\n10:00 Decision to leave\n12:20 Breaking mental conditioning\n14:45 Navigating the outside world\n18:47 Business ventures that influenced Ken\n21:17 Partnership and first big event challenge\n24:25 Creative problem‑solving moments\n26:47 Debt repayment and progress\n28:58 Pivot to video content\n30:35 Launching 52 in 2 initiative\n33:24 Transforming systems into webinars\n35:30 Fear and impostor feelings\n39:10 Consistency and confidence\n40:50 Inner drive vs. outside validation\n42:18 AI, tech, and authentic creation\n43:39 Where to connect online\n\nMichelle Coyle is a business expert, investor, and transformational trainer with over 20 years of entrepreneurial experience. She believes you don’t have to choose between success and well-being because you can have both. With a mix of honesty, humor, and heart, Michelle guides leaders to step into who they really are and grow from that place. She’s the founder of BGSD Strategies and the Political Business Institute, where she supports people who want to make a real difference without losing themselves in the process. Michelle holds an MBA from Dartmouth and is trained in tools like NLP, Hypnosis, and Emotional Release to help others break free from what’s holding them back and create the life they know they’re meant for.\n\nConnect with Michelle Coyle:\nWebsite: https://michellecoyle.com/\nLinkedIn: https://www.linkedin.com/in/michelletoscale/\nInstagram: https://www.instagram.com/michelletoscale/\nFacebook: https://www.facebook.com/michellelaree \n\nKen Okazaki is the CEO of Oz Media Global and a leading expert in video marketing, helping creators and businesses turn content into profit. He and his team produce high-converting video content across YouTube, podcasts, and social media, serving clients in more than 15 countries. Ken is also the inventor, CEO of GoBox Studio, the world’s most portable content creation studio, and host of The Content Capitalists Podcast, where he interviews entrepreneurs making seven figures through content. Based in Japan, he’s built a global brand by combining strategy, storytelling, and systems that scale. \n\nConnect with Ken Okazaki:\nWebsite: https://kenokazaki.com/     \nLI: https://www.linkedin.com/in/kenokazaki/ \nhttps://www.linkedin.com/company/oz-media-global/ \nFB: https://www.facebook.com/kenokazakipage   \nIG: https://www.instagram.com/kenokazaki/?hl=en    \nYT: https://www.youtube.com/channel/UC6FWIE7_F43CJ_-ywScUoEg  \nTikTok: https://www.tiktok.com/@kenokazaki1  \n\n#CultSurvivor #ResilienceJourney #CreatorLife",
      "release": "2025-12-16T11:01:02Z",
      "duration": "00:45:22",
      "explicit": false,
      "spotifyId": "5pBKA56sQW5PDFT3nG8Wy7",
      "appleId": 1000741516698,
      "youTubeId": "XKQHwH65Rbo",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5pBKA56sQW5PDFT3nG8Wy7",
        "apple": "https://podcasts.apple.com/podcast/from-escaping-a-cult-to-making-millions/id1744208638?i=1000741516698",
        "youtube": "https://www.youtube.com/watch?v=XKQHwH65Rbo"
      }
    }
  ]
}