{
  "id": "13be7250-81ad-41e5-b1ca-15f21c9b0369",
  "name": "Democracy Now!",
  "youTubeChannelId": "UCzuqE7-t13O4NIDYJfakrhw",
  "episodes": [
    {
      "id": "01da0293-2c61-43cd-9000-8f0df4aadb5d",
      "title": "Former Prince Andrew Arrested in U.K. as Global Fallout from Epstein Files Grows",
      "description": "Support our work: https://democracynow.org/donate/sm-desc-yt\n\nU.K. police have arrested the former Prince Andrew, the brother of King Charles, on suspicion of misconduct in public office. Andrew Mountbatten-Windsor was previously sued in 2021 by Epstein survivor Virginia Giuffre, who accused him of multiple instances of sexual assault when she was underage. The lawsuit was settled out of court shortly after it was filed, but Mountbatten-Windsor was allowed to keep his royal title and privileges at the time. Those were recently stripped following revelations about the extent of his friendship with the American serial sex offender Jeffrey Epstein. Their friendship has been widely known to the public since at least 2008, when Epstein was first convicted for soliciting a minor for sex.\n\nBritish authorities are now reportedly investigating whether Mountbatten-Windsor shared confidential government information with Epstein in 2010 while serving as a U.K. trade representative. “This is a story about sex trafficking, about the abuse of numerous women, and it seems like where justice might be brought, it\u0027s on a different charge, which is sharing confidential information with a powerful person,” says Novara Media’s Michael Walker.\n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2026-02-19T16:39:04Z",
      "duration": "00:06:29",
      "explicit": false,
      "youTubeId": "22n0Dym3htQ",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=22n0Dym3htQ"
      }
    },
    {
      "id": "d49c1f87-ffcd-4cc5-9fff-02fcf299f5b7",
      "title": "Rep. Jayapal Slams AG Pam Bondi over Epstein Files \u0026 Spying on Lawmakers",
      "description": "Support our work: https://democracynow.org/donate/sm-desc-yt\n\nAttorney General Pam Bondi testified Wednesday before the House Judiciary Committee, where she repeatedly refused to answer questions about her handling of the Jeffrey Epstein case. She also refused to apologize to Epstein survivors over the botched release of files, some of which contained survivors\u0027 personal information and even uncensored nude photographs. During the hearing, Bondi was photographed consulting a binder that appeared to show the search history of lawmakers who visited the Justice Department to examine the unredacted Epstein files in person. \n\n\u0022Essentially, they were spying on us,\u0022 says Democratic Congressmember Pramila Jayapal. \u0022It\u0027s certainly not going to stop me from continuing to review the files, but it is absolutely outrageous.\u0022\n\nJayapal also condemns the Justice Department for refusing to open new investigations into Epstein\u0027s associates listed in the files. \u0022These were rich, powerful, wealthy people, mostly men, who groomed, raped, abused, manipulated young girls,\u0022 she says. \n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2026-02-12T16:06:47Z",
      "duration": "00:19:20",
      "explicit": false,
      "youTubeId": "zkF1pSzUDV4",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zkF1pSzUDV4"
      }
    },
    {
      "id": "6d28d7ca-bb89-49f3-8140-cee69ee226a1",
      "title": "Protecting Pedophile Predators: Carole Cadwalladr on Jeffrey Epstein \u0026 the Elite\u0027s Veil of Silence",
      "description": "Lawmakers on Capitol Hill are accusing the Justice Department of covering up the names of co-conspirators of the deceased sex offender Jeffrey Epstein as fallout from the Epstein files grows across the globe. Millions of pages remain unreleased. As many prominent U.S. figures evade accountability following mentions in the Epstein files, a number of European figures have resigned for their relationships with Epstein. \u0022The most extraordinary and worrying thing of what is going on in the United States is the scale of normalization that is happening, in which the press is absolutely a structural part of this,\u0022 says Carole Cadwalladr, award-winning investigative journalist. \u0022I have been shocked — deeply, deeply shocked — by the absence of headlines.\u0022\n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2026-02-10T15:31:31Z",
      "duration": "00:23:48",
      "explicit": false,
      "youTubeId": "P0P8GrAlTEk",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P0P8GrAlTEk"
      }
    },
    {
      "id": "d282d27b-f313-4434-a275-76f7da4f5359",
      "title": "Journalist Vicky Ward on New Epstein Files \u0026 Survivors\u0027 Fight for Accountability",
      "description": "As the DOJ releases the largest batch of files yet on the federal investigation into Epstein, we look at some of the most significant revelations with investigative journalist Vicky Ward, who has spent decades reporting on the deceased sexual predator, his powerful associates and the impact of his crimes. Survivors have condemned the Department of Justice for not complying with the Epstein Files Transparency Act, which required all files to be released last Friday. \u0022I mean, that was the first indication of the contemptuous, cavalier attitude that has gone on inside this Justice Department,\u0022 says Ward. \u0022It\u0027s heartbreaking, frankly, to see these files being dribbled out.\u0022\n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2025-12-24T15:36:39Z",
      "duration": "00:19:42",
      "explicit": false,
      "youTubeId": "nyOcYK6T8nE",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nyOcYK6T8nE"
      }
    },
    {
      "id": "8ccdcad4-7e44-4452-b0a5-e5a51bc5f9a5",
      "title": "How Did Epstein Make His Fortune? \u0022He Stole It,\u0022 Finds NYT Investigation",
      "description": "As the Trump administration is expected to release investigative files related to Jeffrey Epstein later this week, a recent _New York Times_ investigation delves into one of the biggest mysteries about the deceased sexual predator: how the college dropout with no financial training rose through the world of finance and amassed his wealth, which enabled his abuse and insulated him from scrutiny for decades. \n\nDavid Enrich, deputy investigations editor at _The New York Times_ and lead author of the report, headlined \u0022Scams, Schemes, Ruthless Cons: The Untold Story of How Jeffrey Epstein Got Rich,\u0022 says Epstein\u0027s early success in business was due to a series of lucky breaks, lies and scams that nevertheless convinced sophisticated investors and business titans to give him their money.\n\n\u0022What surprised me the most was just how pedestrian some of his scams were,\u0022 says Enrich. \u0022He was just grabbing people\u0027s money and running with it.\u0022\n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2025-12-17T15:36:34Z",
      "duration": "00:09:36",
      "explicit": false,
      "youTubeId": "Sc6b3UN_agY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Sc6b3UN_agY"
      }
    },
    {
      "id": "522111f9-73a7-45d3-b404-fc06ade34f6b",
      "title": "\u0022Nobody\u0027s Girl\u0022: Virginia Giuffre\u0027s Memoir Details Sex Abuse by Epstein, Maxwell, Prince Andrew",
      "description": "Virginia Roberts Giuffre\u0027s posthumous memoir has just been released, detailing how she was groomed by Jeffrey Epstein and his co-conspirator Ghislaine Maxwell, whom she met at Donald Trump\u0027s Mar-A-Lago resort. In Nobody\u0027s Girl: A Memoir of Surviving Abuse and Fighting for Justice, she writes that she was forced to have sex with Prince Andrew three times, beginning when she was 17, and was beaten and raped by a \u0022well-known prime minister.\u0022 Virginia Giuffre died by suicide earlier this year in Australia at age 41.\n\nDemocracy Now! speaks with Amy Wallace, Giuffre\u0027s ghostwriter, who says Giuffre experienced the \u0022depths of hell\u0022 with Maxwell and Epstein. \u0022It\u0027s not just a catalog of horrors. It\u0027s a woman who is terribly abused as a child, escapes from that terrible abuse … and then becomes an advocate,\u0022 says Wallace. \n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2025-10-22T15:06:47Z",
      "duration": "00:18:40",
      "explicit": false,
      "youTubeId": "WfmPPYZueTw",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WfmPPYZueTw"
      }
    },
    {
      "id": "7d3d1f2d-72c5-47b1-8be7-6a5d50ac916b",
      "title": "A Setback for the \u0022Cult of Modi\u0022? Indian Opposition Faring Surprisingly Well in Early Election Count",
      "description": "Support our work: https://democracynow.org/donate/sm-desc-yt\n\nPreliminary results from the world\u0027s largest election suggest Indian Prime Minister Narendra Modi\u0027s Hindu nationalist BJP party will have a reduced majority in Parliament, with the opposition alliance known by the acronym INDIA doing better than expected. During India\u0027s six-week election, voters and poll workers endured deadly heat waves, and vocal critic Arvind Kejriwal was sent to prison on corruption charges. This comes as Modi\u0027s opponents have accused the prime minister of using hate speech after he described Muslims in India as \u0022infiltrators.\u0022 Meanwhile, journalists who are critical of Modi have been expelled, investigated and raided by his government. The \u0022massive reduction\u0022 in power, despite holding \u0022one of the most undemocratic elections,\u0022 demonstrates \u0022the anti-Muslim rhetoric has not quite worked for Modi,\u0022 says Indian journalist Rana Ayyub in New Dehli. \u0022This election result, it might still give Modi a third term, but it has punctured the hubris around Modi.\u0022\n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2024-06-04T16:47:40Z",
      "duration": "00:15:24",
      "explicit": false,
      "youTubeId": "pBP541Z8qOM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pBP541Z8qOM"
      }
    }
  ]
}