{
  "id": "13be7250-81ad-41e5-b1ca-15f21c9b0369",
  "name": "Democracy Now!",
  "youTubeChannelId": "UCzuqE7-t13O4NIDYJfakrhw",
  "episodes": [
    {
      "id": "d282d27b-f313-4434-a275-76f7da4f5359",
      "title": "Journalist Vicky Ward on New Epstein Files \u0026 Survivors\u0027 Fight for Accountability",
      "description": "As the DOJ releases the largest batch of files yet on the federal investigation into Epstein, we look at some of the most significant revelations with investigative journalist Vicky Ward, who has spent decades reporting on the deceased sexual predator, his powerful associates and the impact of his crimes. Survivors have condemned the Department of Justice for not complying with the Epstein Files Transparency Act, which required all files to be released last Friday. \u0022I mean, that was the first indication of the contemptuous, cavalier attitude that has gone on inside this Justice Department,\u0022 says Ward. \u0022It\u0027s heartbreaking, frankly, to see these files being dribbled out.\u0022\n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2025-12-24T15:36:39Z",
      "duration": "00:19:42",
      "explicit": false,
      "youTubeId": "nyOcYK6T8nE",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nyOcYK6T8nE"
      }
    },
    {
      "id": "522111f9-73a7-45d3-b404-fc06ade34f6b",
      "title": "\u0022Nobody\u0027s Girl\u0022: Virginia Giuffre\u0027s Memoir Details Sex Abuse by Epstein, Maxwell, Prince Andrew",
      "description": "Virginia Roberts Giuffre\u0027s posthumous memoir has just been released, detailing how she was groomed by Jeffrey Epstein and his co-conspirator Ghislaine Maxwell, whom she met at Donald Trump\u0027s Mar-A-Lago resort. In Nobody\u0027s Girl: A Memoir of Surviving Abuse and Fighting for Justice, she writes that she was forced to have sex with Prince Andrew three times, beginning when she was 17, and was beaten and raped by a \u0022well-known prime minister.\u0022 Virginia Giuffre died by suicide earlier this year in Australia at age 41.\n\nDemocracy Now! speaks with Amy Wallace, Giuffre\u0027s ghostwriter, who says Giuffre experienced the \u0022depths of hell\u0022 with Maxwell and Epstein. \u0022It\u0027s not just a catalog of horrors. It\u0027s a woman who is terribly abused as a child, escapes from that terrible abuse … and then becomes an advocate,\u0022 says Wallace. \n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2025-10-22T15:06:47Z",
      "duration": "00:18:40",
      "explicit": false,
      "youTubeId": "WfmPPYZueTw",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WfmPPYZueTw"
      }
    },
    {
      "id": "7d3d1f2d-72c5-47b1-8be7-6a5d50ac916b",
      "title": "A Setback for the \u0022Cult of Modi\u0022? Indian Opposition Faring Surprisingly Well in Early Election Count",
      "description": "Support our work: https://democracynow.org/donate/sm-desc-yt\n\nPreliminary results from the world\u0027s largest election suggest Indian Prime Minister Narendra Modi\u0027s Hindu nationalist BJP party will have a reduced majority in Parliament, with the opposition alliance known by the acronym INDIA doing better than expected. During India\u0027s six-week election, voters and poll workers endured deadly heat waves, and vocal critic Arvind Kejriwal was sent to prison on corruption charges. This comes as Modi\u0027s opponents have accused the prime minister of using hate speech after he described Muslims in India as \u0022infiltrators.\u0022 Meanwhile, journalists who are critical of Modi have been expelled, investigated and raided by his government. The \u0022massive reduction\u0022 in power, despite holding \u0022one of the most undemocratic elections,\u0022 demonstrates \u0022the anti-Muslim rhetoric has not quite worked for Modi,\u0022 says Indian journalist Rana Ayyub in New Dehli. \u0022This election result, it might still give Modi a third term, but it has punctured the hubris around Modi.\u0022\n\nDemocracy Now! is an independent global news hour that airs on over 1,500 TV and radio stations Monday through Friday. Watch our livestream at democracynow.org Mondays to Fridays 8-9 a.m. ET.\n\nSubscribe to our Daily Email Digest: https://democracynow.org/subscribe",
      "release": "2024-06-04T16:47:40Z",
      "duration": "00:15:24",
      "explicit": false,
      "youTubeId": "pBP541Z8qOM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pBP541Z8qOM"
      }
    }
  ]
}