{
  "_ts": 0,
  "id": "c1811027-e107-400a-a163-b7dc83fec9ef",
  "name": "Details Are Sketchy",
  "spotifyId": "0ba8mvwbg2bX28IkdYdpRf",
  "appleId": 1713231388,
  "episodes": [
    {
      "id": "8e8d592d-b576-4c74-8200-0c39cca74127",
      "title": "One Small Step For Man, One Giant Leap of Faith for a Terrorist Doomsday Cult: The Tokyo Subway Sarin Attack",
      "description": "In this episode, Kiki covers Aum Shinrikyo and the 1995 Tokyo Subway Sarin Attack, while Rachel brings us the disappearance of Jewel Paul Wheeler. Then we have a brief chat about what we\u0027ve been reading and watching and doing. Side note: We were drinking Boba Tea while recording, so apologies for the slurping noises. Our next book is \u0022Hell\u0027s Half Acre: The Untold Story of the Benders, a Serial Killer Family on the American Frontier\u0022 by Susan Jonusas, which we will discuss in episode 16. Sources: Jewel Paul Wheeler Jewel Paul Wheeler: Missing Person. U.S Department of The Interior. Indian Affairs. Jewel Paul Wheeler, 30, Pine Ridge, 1 January 1973. March 7, 2024. Web Sleuths. If you have information call 1-833-560-2065 Aum Shinrikyo Britannica - Shoko Asahara, Tokyo Subway Attack 1995, Aleph Wikipedia - Shoko Asahara, Aum Shinrikyo, Tokyo Subway Sarin Attack NYT - A Guru\u0027s Journey - Nicholas Kristof LA Times - Japanese Guru - David Holly Spiritually Fucked - Aum Shinrikyo: Japan’s Most Notorious Anime Doomsday Yoga Cult Parts 1 and 2 Here\u0027s the timeline as promised. Socials: Instagram: Details Are Sketchy - @details.are.sketchy Facebook: Details Are Sketchy - @details.are.sketchy.2023 Instagram: Kiki - @kikileona84 Instagram: Rachel - @eeniemanimeenienailz Email: details.are",
      "release": "2024-04-24T06:00:00Z",
      "duration": "01:16:29.0610000",
      "explicit": true,
      "spotifyId": "6CZEdLpLmYdLTpbGw89w1G",
      "appleId": 1000653422558,
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6CZEdLpLmYdLTpbGw89w1G",
        "apple": "https://podcasts.apple.com/podcast/one-small-step-for-man-one-giant-leap-of-faith-for/id1713231388?i=1000653422558"
      }
    }
  ]
}