{
  "_ts": 0,
  "id": "f19eac93-ee60-4271-be96-f3b9b3ddac64",
  "name": "Devin Lytle",
  "youTubeChannelId": "UCkqU_7_CmVJ0xKViT9rnHEA",
  "episodes": [
    {
      "id": "e77c2b1e-505d-4aff-b496-4cf2859af40e",
      "title": "The Red Flags of Fitness Cults | Devin But Better",
      "description": "✨THIS WEEK✨ I am revealing major red flags that a person can bump up against when they enter a new fitness class/routine/workshop etc.\n\nIf you\u0027re new here, HI! This year we are exploring the Year of the Goddess, and with that comes a bunch unpacking the good, the bad, and the ugly experiences I\u0027ve had in my quest to feel feminine, sexy, and alive. One of those experiences includes teaching and belonging to a pole dancing cult that very much still exists today - S Factor.\n\nIn this video, we are walking through the Netflix S Factor documentary, Strip Down, Rise Up together, and identifying problematic language and ideas. \n\nAs always, I love and value respectful input - so please tell me your thoughts about this doc and video about the doc below 💃\n\nIf you liked this video, subscribe now for more: https://bit.ly/DevinButBetter",
      "release": "2022-09-09T13:00:04Z",
      "duration": "00:14:36",
      "explicit": false,
      "youTubeId": "8QBRjy8iPAk",
      "subjects": [
        "S Factor Studio"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8QBRjy8iPAk"
      }
    },
    {
      "id": "81e18bab-20cd-4528-aeea-20d02ee6e793",
      "title": "I Belonged to a Pole Dancing Cult (true story) | Devin But Better",
      "description": "Hey friends! So this video feels more like a video essay, because it is. I could talk for YEARS about S Factor, pole dancing, mind body connection, the evolution of female sexuality in the mainstream, and new age manipulation, because it\u0027s so nuanced. These spaces provide a lot of good for folks. They can be healing, enlightening, and connecting. However, in the past two years I\u0027ve been unpacking what was good about my experience, and when things went south, and I\u0027d like to share my thoughts with you.\n\nThis is a ✨collective discussion✨ so feel free to chime in if you\u0027ve experienced\n💟 disentangling yourself from a highly controlled environment\n💟 the light manipulation of a new age group\n💟 curiosity around how feminine etc you are\n💟 been apart of a fitness cult\n\nI want to hear your thoughts!\n\nIf you liked this video, subscribe now for more: https://bit.ly/DevinButBetter",
      "release": "2022-08-11T13:00:36Z",
      "duration": "00:16:26",
      "explicit": false,
      "youTubeId": "sGGd588J2jw",
      "subjects": [
        "S Factor Studio"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sGGd588J2jw"
      }
    }
  ]
}