{
  "_ts": 0,
  "id": "308306e8-46ec-457b-aac1-bc95d0d62043",
  "name": "Dharmadatta Community",
  "youTubeChannelId": "UCpHwPuf01Dpt7jZzuPOq5nQ",
  "episodes": [
    {
      "id": "c1eaaf21-4c3b-475f-9e63-8c7b7c2f37c8",
      "title": "Identifying Dysfunction in the Teacher-Student Relationship (Grace Schireson)",
      "description": "....and other unhealthy dynamics in Buddhist communities. Damcho interviews Grace Schireson, a Zen abbess, psychotherapist and teacher who studies the psychology and group dynamics of the sangha.",
      "release": "2024-07-28T15:00:06Z",
      "duration": "00:46:53",
      "explicit": false,
      "youTubeId": "YS3bZNKxxrM",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YS3bZNKxxrM"
      }
    },
    {
      "id": "f30f94b2-8274-4829-ab60-e49384dc8e1d",
      "title": "Holding Buddhist Organizations Accountable for Abuse. Exploring Legal Consequences (Carol Merchasin)",
      "description": "Carol Merchasin presents the law as a strategy for holding not just teachers but also organizations accountable for their role in enabling abuse. This far-ranging conversation explores the relative benefits to survivors and to society of criminal versus civil legal options, the ethical implications of using donor funds to pay survivors of abuse, and the power of lawsuits to prompt changes to the organizational culture of Buddhist communities. \n\nCarol Merchasin heads up the legal practice of McAllister Olivarius devoted to survivors of abuse by spiritual teachers. She served as a pro bono legal counsel to Shambhala survivors and the Buddhist Sunshine Project. Damcho and Carol first collaborated as allies to survivors of sexual abuse by Dagri Rinpoche, who was subsequently banned from teaching by the FPMT, the international organization that had hosted and promoted him for over a decade.",
      "release": "2024-03-10T15:00:06Z",
      "duration": "00:55:22",
      "explicit": false,
      "youTubeId": "RYxmFddfCwY",
      "subjects": [
        "Cult-Expert",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RYxmFddfCwY"
      }
    },
    {
      "id": "a63d03d3-a238-4f3d-8966-3334017ed29a",
      "title": "Healing from Abuse - The Voice of a Survivor, Ally and Activist",
      "description": "Rachel Montgomery is co-founder of the Heartwood Sangha survivors\u0027 program (link below). She is a public health professional, and an eloquent advocate for survivors of sexual abuse. Rachel has filed a civil case for sexual abuse by Choga \u0022Rinpoche\u0022 a decade ago when she was a student at his Dzogchen community in Oregon . She is being represented by McAllister Olivarius, which also represented Vikki Han, who alleged she was raped and impregnated by the 17th Karmapa. Watch the rest of the interviews on abuse in our playlist here:  https://youtube.com/playlist?list=PLBie3P_np8ajY8Ly1ji-nbQBEEsE9_xFA\u0026si=NLZD0qXmsxUe0M7v\nLINKS\n**Heartwood Sangha\u0027s \u0022Connecting Survivors of Guru and Teacher Abuse\u0022 program**\nhttps://www.heartwoodcenter.com/meditation/survivors-program/",
      "release": "2023-11-26T16:00:11Z",
      "duration": "01:06:31",
      "explicit": false,
      "youTubeId": "CJ8efGB_dX4",
      "subjects": [
        "Dzogchen Shri Singha Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CJ8efGB_dX4"
      }
    }
  ]
}