{
  "_ts": 0,
  "id": "308306e8-46ec-457b-aac1-bc95d0d62043",
  "name": "Dharmadatta Community",
  "youTubeChannelId": "UCpHwPuf01Dpt7jZzuPOq5nQ",
  "episodes": [
    {
      "id": "01507489-1eb8-433c-bce6-9e6193c10520",
      "title": "Two Courageous Nuns Break the Silence - on Abuse in Buddhist Nunneries in Asia",
      "description": "In this remarkable interview, two Buddhist nuns from Asia speak candidly of abuse of nuns in Buddhist nunneries in Asia, drawing on PhD research, what they witnessed as well as their own direct experience.  The two courageous nuns Venerable (Choela) Tenzin Dadon, PhD and Venerable (Choela) Karma Tashi Choedron, PhD describe their own ongoing efforts to prevent abuse of nuns as well as children in Buddhist monasteries and nunneries in Asia.\n\n** BIOGRAPHIES **\nA Bhutanese nun, Choela (or Venerable) Tenzin Dadon, PhD is an accomplished scholar and a gifted teacher. After completing a traditional 13-year program in Buddhist philosophy at Jamyang Choling Institute in Dharamsala, India, she went on to earn two Masters degrees and a PhD from the University of Malaysia, and has published extensively under her lay name, Sonam Wangmo. A global leader in the effort to improve gender equity in Buddhism, and especially the fight to obtain full ordination for Tibetan Buddhist nuns, she was recognized as one of the outstanding women in Buddhism by the International Women’s Meditation Center. Choela is currently the Director of Education for the Vajrayana Buddhist Council of Malaysia. \n\nA Buddhist nun born in Malaysia and ordained in Tibetan Buddhism, Choela (or Venerable) Karma Tashi Choedron, PhD  holds a doctorate degree in Environment and Resource Studies from Mahidol University, Thailand and completed her M.A in Buddhist Studies in 2016 from the International Buddhist College. She is Vice-President of the International Buddhist Confederation and Deputy Director of Education at the Vajrayana Buddhist Council of Malaysia. She received the Outstanding Woman in Buddhism Award in 2010 in Thailand in recognition of her contributions to Buddhism and the environment, the Lord Dearing Award for excellence in teaching in 2022 and the Team Award for Commitment to Enhancing the Research Culture and Environment 2023 from University of Nottingham, UK. Choela. Dr. Karma has authored two books on conservation and co-authored a book featuring a comparative study between Sikhism and Buddhism, titled, Two Gurus One Message.",
      "release": "2025-02-16T16:30:06Z",
      "duration": "00:47:17",
      "explicit": false,
      "youTubeId": "g5wK6p9CUgQ",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g5wK6p9CUgQ"
      }
    },
    {
      "id": "74a30c5a-7f2e-44fd-9808-941e4630251b",
      "title": "Child Abuse in Buddhist Monasteries in Sri Lanka (Dr. Chandana Namal Rathnayake)",
      "description": "Years after he was placed in a Buddhist monastery as a young boy in South Asia, psychotherapist and former Buddhist monk Dr. Chandana Namal Rathnayake describes his lived experience of abuse  as well as his doctoral research into what he describe as an \u0022institutional ecosystem\u0022 in which sexual and other forms of abuse of children take place in Buddhist monastic institutions in Sri Lanka. \n\nIf you are moved to do so, please leave a message here for Dr. Rathnayake to read, and we will ensure they reach him.  \n\nDr. Chandana Namal Rathnayake holds a PhD from the Canterbury Christ Church University with a thesis entitled \u0022Breaking the Silence About Institutionalized Child Abuse in the Buddhist Monastery in Sri Lanka\u0022. He is a practicing psychotherapist currently based in the UK.",
      "release": "2024-10-20T14:45:05Z",
      "duration": "00:59:41",
      "explicit": false,
      "youTubeId": "m0EfKMeJlCo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=m0EfKMeJlCo"
      }
    },
    {
      "id": "c1eaaf21-4c3b-475f-9e63-8c7b7c2f37c8",
      "title": "Identifying Dysfunction in the Teacher-Student Relationship (Grace Schireson)",
      "description": "....and other unhealthy dynamics in Buddhist communities. Damcho interviews Grace Schireson, a Zen abbess, psychotherapist and teacher who studies the psychology and group dynamics of the sangha.",
      "release": "2024-07-28T15:00:06Z",
      "duration": "00:46:53",
      "explicit": false,
      "youTubeId": "YS3bZNKxxrM",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YS3bZNKxxrM"
      }
    },
    {
      "id": "f30f94b2-8274-4829-ab60-e49384dc8e1d",
      "title": "Holding Buddhist Organizations Accountable for Abuse. Exploring Legal Consequences (Carol Merchasin)",
      "description": "Carol Merchasin presents the law as a strategy for holding not just teachers but also organizations accountable for their role in enabling abuse. This far-ranging conversation explores the relative benefits to survivors and to society of criminal versus civil legal options, the ethical implications of using donor funds to pay survivors of abuse, and the power of lawsuits to prompt changes to the organizational culture of Buddhist communities. \n\nCarol Merchasin heads up the legal practice of McAllister Olivarius devoted to survivors of abuse by spiritual teachers. She served as a pro bono legal counsel to Shambhala survivors and the Buddhist Sunshine Project. Damcho and Carol first collaborated as allies to survivors of sexual abuse by Dagri Rinpoche, who was subsequently banned from teaching by the FPMT, the international organization that had hosted and promoted him for over a decade.",
      "release": "2024-03-10T15:00:06Z",
      "duration": "00:55:22",
      "explicit": false,
      "youTubeId": "RYxmFddfCwY",
      "subjects": [
        "Cult-Expert",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RYxmFddfCwY"
      }
    },
    {
      "id": "a63d03d3-a238-4f3d-8966-3334017ed29a",
      "title": "Healing from Abuse - The Voice of a Survivor, Ally and Activist",
      "description": "Rachel Montgomery is co-founder of the Heartwood Sangha survivors\u0027 program (link below). She is a public health professional, and an eloquent advocate for survivors of sexual abuse. Rachel has filed a civil case for sexual abuse by Choga \u0022Rinpoche\u0022 a decade ago when she was a student at his Dzogchen community in Oregon . She is being represented by McAllister Olivarius, which also represented Vikki Han, who alleged she was raped and impregnated by the 17th Karmapa. Watch the rest of the interviews on abuse in our playlist here:  https://youtube.com/playlist?list=PLBie3P_np8ajY8Ly1ji-nbQBEEsE9_xFA\u0026si=NLZD0qXmsxUe0M7v\nLINKS\n**Heartwood Sangha\u0027s \u0022Connecting Survivors of Guru and Teacher Abuse\u0022 program**\nhttps://www.heartwoodcenter.com/meditation/survivors-program/",
      "release": "2023-11-26T16:00:11Z",
      "duration": "01:06:31",
      "explicit": false,
      "youTubeId": "CJ8efGB_dX4",
      "subjects": [
        "Dzogchen Shri Singha Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CJ8efGB_dX4"
      }
    }
  ]
}