{
  "id": "ce7d5152-92f6-4101-9da6-fd3cee3d53c2",
  "name": "Diary of a ADHD Strategist",
  "spotifyId": "5iOygbM0hfWeM44zEIRSGT",
  "appleId": 1751597362,
  "youTubeChannelId": "UCJjo97Bwp30rEjENaNYu_1A",
  "episodes": [
    {
      "id": "23b35e88-4381-4fc5-8f6b-bba1c290c266",
      "title": "Escaping a Cult with ADHD and Business Success: Shana Francesca\u0027s Journey",
      "description": "In this powerful ADHD episode, we dive deep into Shana Francesca’s incredible journey of escaping a cult and reclaiming her life. From growing up in an abusive household to finding her voice and empowering others, Shana’s survival story is nothing short of inspiring.\n\n\n\nShana shares her experience of being raised in a religious cult, the oppressive environments she endured, and the moment she realized she had to escape at the age of 26. Discover how she navigated the world outside, overcame immense challenges, and transformed her trauma into a force for positive change. \n\nHer journey reveals the importance of ethical leadership, personal growth, and the power of curiosity.\n\n\n\nThis episode is not just about survival WITH ADHD; it’s about thriving against all odds. Shana’s story is a testament to the resilience of the human spirit and the transformative power of self-awareness and intentional living. Learn how she leverages her experience to help others cultivate genuine relationships and lead with integrity with ADHD.\n\n\n\nDon’t miss out on this eye-opening conversation! Click to access Shana’s insights and get a taste of her wisdom. Like, share, and subscribe for more captivating stories and game-changing hacks that will level up your productivity game and boost your online learning journey.\n\n\n\n#EscapingACult #ShanaFrancesca #SurvivalStory #EthicalLeadership #PersonalGrowth #InspiringJourney #Resilience #Empowerment #Transformation #Podcast #ADHD\n\n\n\n---\n\n\n\n*Key Takeaways:*\n- Shana’s escape from a religious cult and her path to self-discovery.\n- The impact of abusive environments and how she overcame them.\n- The significance of ethical leadership and cultivating true relationships.\n- Practical strategies for personal growth and resilience.\n\n\n\nFor more inspiring stories and productivity hacks, stay tuned and join our supportive community! 🌟\n\n\n\n#CultSurvival #CultEscapePodcast #CultEscape #CultSurvivor #EmpowermentJourney\n\n\n\nCHAPTERS:\n00:00 - Intro\n00:30 - Shana Francesca Introduces Herself\n3:08 - Leaving The Cult And Entering The Real World\n8:47 - How did you get into this environment\n10:09 - How did you get out of this environment\n12:31 - How does your ADHD affect you\n17:43 - How did you cope with the overwhelming feeling\n17:58 - Did you find a way to regulate yourself as a child\n21:46 - How do you help individuals now\n25:02 - What are your future plans\n27:10 - You Love What You Do\n29:28 - You Can\u0027t Strengthen A Disability\n31:14 - Thank you for sharing your past\n32:04 - Have you found consolment with other people in your situation\n34:00 - What do you love to learn about\n34:54 - Personal Relationships and ADHD\n40:40 - OUTRO\n41:17 - How to Contact Shana\n42:44 - Outro\n \n\nGet full access to Diary of a ADHD Strategist | ♉ \u002B📣 =👂🏽 at elidervonte.substack.com/subscribe (https://elidervonte.substack.com/subscribe?utm_medium=podcast\u0026utm_campaign=CTA_4)",
      "release": "2025-01-18T11:14:17Z",
      "duration": "00:43:26",
      "explicit": false,
      "spotifyId": "7vI8TUUkLI2wWuPzU2vulg",
      "appleId": 1000666213047,
      "youTubeId": "zhBfdpUx3zo",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vI8TUUkLI2wWuPzU2vulg",
        "apple": "https://podcasts.apple.com/podcast/s1-ep16-escaping-a-cult-with-adhd-and-business/id1751597362?i=1000666213047",
        "youtube": "https://www.youtube.com/watch?v=zhBfdpUx3zo"
      }
    }
  ]
}