{
  "id": "62c72f5f-e8c1-4b35-a6db-dc6c2c0ae0a0",
  "name": "DIE ZEIT",
  "youTubeChannelId": "UC_YnP7DDnKzkkVl3BaHiZoQ",
  "episodes": [
    {
      "id": "cfe5a0ac-884f-4359-acc4-1b8ef439bf12",
      "title": "Aus der Bondi-Anhörung: Demokraten attackieren US-Justizministerin wegen Umgang mit Epstein-Files",
      "description": "US-Justizministerin Pam Bondi hat Kritik am Umgang mit den Ermittlungsakten zum verurteilten Sexualstraftäter Jeffrey Epstein zurückgewiesen. Ihr Ministerium habe mehr als drei Millionen Seiten Dokumente freigegeben und das \u0022Beste getan, um die Opfer zu schützen\u0022, sagte Bondi bei einer Anhörung im US-Kongress.\n\nGleichzeitig räumte die Justizministerin nach entsprechenden Vorwürfen ein, dass \u0022versehentlich\u0022 Namen von Opfern veröffentlicht worden seien. Diese seien nach Hinweisen \u0022umgehend\u0022 geschwärzt worden. \n\nDer führende Demokrat im Justizausschuss des Repräsentantenhauses, Jamie Raskin, warf Bondi eine \u0022massive Epstein-Vertuschungsaktion\u0022 vor. Von insgesamt rund sechs Millionen Dokumenten, Fotos und Videos habe das Ministerium nur gut die Hälfte veröffentlicht. Zudem seien die Namen zahlreicher \u0022Täter, Helfer, Mitläufer und Mitverschwörer\u0022 Epsteins geschwärzt worden, während die Namen der Opfer in einigen Fällen nicht wie vorgeschrieben unkenntlich gemacht worden seien. \n\nDie demokratische Abgeordnete Pramila Jayapal forderte Bondi auf, sich bei Epsteins Opfern zu entschuldigen. Bondi fragte sie daraufhin, warum sie dies nicht ihren Vorgänger unter US-Präsident Joe Biden gefragt hätte und warf ihr \u0022Theatralik\u0022 vor.\n\nEs kam bei der Anhörung wiederholt zu Auseinandersetzungen mit demokratischen Abgeordneten. Bondi brüllte sie an, machte sich über sie lustig und lobte dabei gleichzeitig die Amtsführung von US-Präsident Donald Trump. \u0022Sie sitzen hier und greifen den Präsidenten an, und das werde ich nicht zulassen\u0022, sagte Bondi.\n\nDer Kongress hatte die Regierung von US-Präsident Trump gesetzlich verpflichtet, die meisten Dokumente und Ermittlungsunterlagen im Fall Epstein offenzulegen. Mitte Dezember hatte das Justizministerium damit begonnen, Akten zu veröffentlichen. Kurz danach waren einige Dateien wieder verschwunden. Bondis Stellvertreter Todd Blanche sagte dazu, dass die plötzliche Löschung auf Bitten von Betroffenen erfolgt sei. Die entfernten Fotos zeigten potenzielle Opfer, die zuvor nicht als solche identifiziert worden seien, hieß es.\n\nBildrechte Thumbnail: Kent Nishimura/Reuters, Win McNamee/Getty Images\n\nExplainer-Videos der ZEIT zu politischen, wissenschaftlichen und gesellschaftlichen Themen finden Sie hier:\nhttps://www.youtube.com/playlist?list=PLWK1Hx_NM2f6HVoqjx3iyc2IcnB0qjT1O\n\nHintergründe, Eindrücke und persönliche Geschichten sehen Sie in den Dokus und Reportagen der ZEIT:\nhttps://www.youtube.com/playlist?list=PLWK1Hx_NM2f6qhzBJYa0h5Y3boYcaYqAN\n\n#epsteinfiles #epstein #pambondi #diezeit",
      "release": "2026-02-12T15:11:44Z",
      "duration": "00:12:38",
      "explicit": false,
      "youTubeId": "oUecq3Uqp5s",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oUecq3Uqp5s"
      }
    }
  ]
}