{
  "_ts": 0,
  "id": "125f9486-65fb-43bb-9013-2467e79bebae",
  "name": "DiffiCULT Childhood",
  "youTubeChannelId": "UCLxlBUhq8AMoqNAr48tMaNg",
  "episodes": [
    {
      "id": "67736686-3309-44e6-9496-14a4ed613c85",
      "title": "Spare the Rod? JW Teachings That Went Too Far | Jason vs. Falon",
      "description": "In this episode of DiffiCULT Childhood, Jason and Falon go head-to-head over Jehovah’s Witness teachings on “discipline.” While both agree the Watchtower promotes harmful, outdated practices, they don’t exactly agree on what should replace them.\n\nJason opens up about how control, fear, and shame were disguised as “loving guidance” in his JW upbringing. Falon pushes back with her belief that not all traditional methods are harmful when done with care.\nWe\u0027re not here to drag up pain for views — we’re here to talk healing, truth, and what real growth looks like after leaving a high-control group.\n\n✋ Did you grow up Mormon, Evangelical, or in another strict religion?\nDid your bishop, elders, or pastor teach that “discipline” was a spiritual requirement? Were you told it was part of Family Home Evening, headship, or biblical authority? We want to hear from you. This episode isn’t about blame — it’s about healing and rethinking what we were taught was “love.”\n\n🧠 Jehovah’s Witness upbringing, Watchtower discipline, authoritarian parenting, ex-Mormon traüma,, Family Home Evening gone wrong, high control religion, exvangelical recovery, focus on the family\n\nJehovah’s Witness discipline, JW upbringing, ex JW podcast, Watchtower teachings, authoritarian religion, religious trauma, high control religion, Jason and Falon, difficult childhood Jason and Falon, recovering from JW past, cult recovery podcast, exjw, ex-JW, Governing Body, best life ever, waking up from JWs, storytime \n\n05:45 Kingdom Halls Built For “Biblical Correction”?\n09:09 Falon: Story of a high controlled toddler\n11:16 Jason: My Parents Tried Their Best and Got Better!\n15:39 Falon: The Purse Warning\n17:54 The Watchtower Parenting Advice \n20:13 Judges and the Parrot Museum\n20:31 When Attachment Becomes Control\n27:01 Three Reasons JW Dads Struggle with Patience\n35:34 I Went to Disneyland with a Friend Who Knew How to Kindly Correct \n42:03 Palate Cleanser: A Lil Baby Kitten!\n\nReferences: Falon\u0027s: https://time.com/3387226/spanking-can-be-an-appropriate-form-of-child-discipline/\nNotes from Jason\u0027s reading: https://pmc.ncbi.nlm.nih.gov/articles/PMC8612122/?utm_source=chatgpt.com\n1. Positive Reinforcement\nWhat it is: Rewarding good behavior to encourage it to happen again.\nExamples: Praise, stickers, extra playtime, tokens for rewards.\nWhy it works: Builds intrinsic motivation and healthy self-esteem.\n⏸ 2. Time-Out (Used Correctly)\nWhat it is: A short, calm break from stimulating environments after misbehavior.\nGuidelines:\n1 minute per year of age (e.g., 4 mins for a 4-year-old).\nExplain the reason clearly and calmly.\nReturn to a positive interaction after it\u0027s over.\nWhy it works: Teaches kids to reflect and regulate emotions without shaming.\n🧠 3. Emotion Coaching\nWhat it is: Helping kids identify, understand, and manage their emotions.\nSteps: Name the emotion (“You’re feeling frustrated because…”).\nValidate the feeling, but set a boundary on the behavior.\nTeach coping strategies (breathing, counting, talking it out).\nWhy it works: Builds emotional intelligence and long-term resilience.\n🗣 4. Natural \u0026 Logical Consequences\nWhat it is:\nNatural: Letting real-world outcomes teach a lesson (e.g., toy breaks = no toy).\nLogical: Connecting consequences directly to the behavior (e.g., drawing on the wall = helping clean it). Why it works: Encourages responsibility and problem-solving.\n🔄 5. Modeling and Role-Playing\nWhat it is: Demonstrating the behavior you want and practicing it with your child.\nExamples: Sharing toys with a sibling, apologizing after hurting someone.\nWhy it works: Children mimic what they see more than what they’re told.\n🗓 6. Routine and Structure\nWhat it is: Establishing consistent, predictable rules and daily rhythms.\nWhy it works: Reduces anxiety, increases cooperation, and provides security.\n💬 7. Clear Rules and Expectations\nWhat it is: Setting developmentally appropriate rules with simple, consistent explanations.\nTips: Use \u0022do\u0022 language (\u0022Use gentle hands\u0022 instead of \u0022Don’t hit\u0022).\nWhy it works: Prevents confusion and reduces power struggles.\n❤️ 8. Attachment-Based Parenting\nWhat it is: Focusing on connection and trust first—discipline flows from a secure relationship.\nTools: Eye contact, gentle touch, co-regulation, repair after conflict.\nWhy it works: Secure attachment is the foundation for cooperation and empathy.\n🧘 9. Mindfulness and Calm-Down Techniques\nWhat it is: Teaching breathing, counting, or movement as tools to manage strong emotions.\nWhy it works: Helps children self-soothe rather than explode or shut down.\n🔁 10. Collaborative Problem Solving\nWhat it is: Jointly identifying the issue and brainstorming solutions together.\nGreat for: Older children and teens.\nWhy it works: Teaches negotiation, responsibility, and respect for boundaries.\n\n“Discipline means to teach—not to punish. The goal is long-term behavioral growth, not short-term compliance.”\n—Dr. Dan Siegel, psychiatrist",
      "release": "2025-06-28T17:00:06Z",
      "duration": "00:45:53",
      "explicit": false,
      "youTubeId": "456Ve6coO64",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=456Ve6coO64"
      }
    },
    {
      "id": "18b38000-bd35-499f-8ac6-675af7fcbb45",
      "title": "Repost: The True Story of Murder in a JW Congregation",
      "description": "REPOST from Last Year — We’re bringing back this important episode because our channel was much smaller when it first aired, and too many people haven’t seen it.\nIn this powerful DiffiCULT Childhood episode, Jason and Falon revisit the tragic true crime story of Whitney, a 21-year-old Jehovah’s Witness woman who was kidnapped and murdered by a fellow JW in “good standing” from her own congregation.\n\nDespite repeated claims by JW leadership that Jehovah’s Witness congregations are a “spiritual paradise” and a safe place, this heartbreaking story exposes the dangerous myth of safety inside the cult.\n\nWe show video clips of JW leaders making bold claims about congregational safety—then reveal how those words fall apart under real-world scrutiny. Even more disturbing, we share our recording from the convention Jason was attending demonstrating how the organization exploited Whitney’s grieving mother at a massive JW convention to manipulate thousands and reinforce control.\n\nWatch as we take a hard look at JW-on-JW crime, cult tactics, and the psychological abuse masked by a smiling public image. This isn’t just Whitney’s story—it’s a warning to others inside high-control groups.\n\nJehovah’s Witnesses, JW congregation, JW murder, JW crime, true crime cult, spiritual paradise myth, ex-Jehovah’s Witness, cult survivor stories, religious abuse, DiffiCULT Childhood podcast, Jason and Falon, JW leadership lies, false security, Jehovah’s Witness documentary, Watchtower cult, high control religion\n\n\nTags: #JehovahsWitnesses #JW #CultSurvivor #JWTragedy #FalseSecurity #ReligiousManipulation #TrueCrime #ExJW #DiffiCULTChildhood #JWLeadership #CultControl #truecrime \n00:00 Fresh Intro. Why this is important\n02:35 If you didn’t know what happened to her…\n04:50 It Made National News\n08:25 What \u0022spiritual paradise\u0022 is worth.\nwith Robo Ron Curzan @LloydEvans \u0026 Leonard Meyers\n13:13 Unraveling “JW’s are Safe in the Congregation”\n15:08 JW Apologetics on “Spiritual Paradise”\n19:49 Arraignment and Sentencing\n22:10 Grieving mother exploited by the cult in front of 5000\u002B people.\n30:25 Jehovah’s Witnesses Aren’t Allowed to Grieve Properly\n32:05 Falon’s story of her little brother’s funeral\n34:08 JW’s Scanning the Obituaries to Preach\n37:05 Falon shares about JW control attempts at her mother’s funeral.\n38:57 Combat Indoctrination with Education and Therapy",
      "release": "2025-06-20T23:31:37Z",
      "duration": "00:42:33",
      "explicit": false,
      "youTubeId": "v4t1bpnA7f8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=v4t1bpnA7f8"
      }
    },
    {
      "id": "7cf54aba-4de3-4a23-b988-60e0f2358b10",
      "title": "Jason Got JW Resurrection Wrong... But It’s Even Weirder Than I Thought",
      "description": "In this episode, I come clean about something I got wrong in a recent video—my explanation of what Jehovah’s Witnesses believe about the resurrection. After hearing from several viewers, I went back and double-checked, and… yeah. I was wrong. But here’s the twist: the actual JW belief is even more bizarre and depressing than what I originally said.\n\nWe break down what the Watchtower teaches about resurrection, the 1,000-year wait after Armageddon, and how even faithful Jehovah’s Witnesses don’t get instant paradise. Instead, they face a long, drawn-out “test period” under Christ’s rule before they’re even considered worthy of life. We also talk about what this belief says about the so-called love and power of the JW version of God.\n\nTurns out, remembering every detail of JW doctrine isn’t just hard—it’s confusing because of the insane origins. But once you see through it, it all starts to unravel.\nReferences: 1982 You Can Live Forever in Paradise on Earth\nhttps://openlibrary.org/books/OL24224713M/You_can_live_forever_in_paradise_on_earth.\nElaine Pagel\u0027s Book https://www.amazon.com/Revelations-Visions-Prophecy-Politics-Revelation/dp/0143121634\n\nJehovah’s Witness resurrection\nJW paradise beliefs\nWatchtower doctrine\nex Jehovah’s Witness\nresurrection explained\nJW 1000 year reign\nArmageddon timeline\nJW false teachings\nGoverning Body beliefs\nJehovah’s Witness cult\nFalon and Jason DiffuCULT Childhood JW Podcast\n\n00:00 What Had Happened Was…\n01:40Jason is terrible\n02:50 Mandela Effect \n04:52 How Do Words Work?\n09:52 Soul and JW Theology \n12:15 the resurrection isn\u0027t fair\n14:38 Revelation: The Real Reason JW Resurrection Doesn’t Make Sense\n20:20 Governing Body Can’t Back Down Now",
      "release": "2025-06-09T00:36:06Z",
      "duration": "00:26:06",
      "explicit": false,
      "youTubeId": "Jjf3rZR6Pl8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Jjf3rZR6Pl8"
      }
    },
    {
      "id": "8b8f22ae-125d-4baa-b006-2464652147dc",
      "title": "JWs Don\u0026#39;t REALLY Believe in the Resurrection",
      "description": "Jehovah’s Witnesses talk a lot about resurrection—but what do they really believe happens after someone dies? In this solo episode, Jason breaks down the bizarre contradictions in the JW version of resurrection. They deny the existence of the soul, say your body is gone, memories are altered, genes changed, and claim you\u0027ll wake up in paradise earth as a perfect version of yourself. But if your personality, memories, and physical body are all changed or erased… is that really you?\n\nWe’re told it’s like closing your eyes in death and opening them in the New System. But that’s not what their doctrine actually teaches. What it describes is the creation of a replica, a vague copy—not a true resurrection.\n\nSo who’s really waking up in paradise? And what does that say about the JW promise of life after death? \n\nLet’s take it apart.\n\nLink to Lloyd Evan\u0027s excellent rebuttal on Governing Body member Stephen Lett\u0027s bigoted and illogical solution to the problem of resurrected people not being the same person who passed away in the \u0022old system\u0022 https://www.youtube.com/watch?v=GYU3r3VQwSo\n\nJehovah\u0027s Witness resurrection beliefs, JW afterlife teachings, paradise earth doctrine, do Jehovah\u0027s Witnesses believe in the soul, what happens after death JW, JW paradise vs heaven, ex Jehovah\u0027s Witness podcast, resurrection vs replication JW, JW false hope, JW contradictions, Jehovah\u0027s Witness doctrine exposed #JehovahsWitnesses #ExJW #JWDoctrine #ReligiousTrauma #CultSurvivor #ParadiseEarth #JWResurrection #ExJWPodcast #JWBeliefs #LifeAfterDeath #difficultchildhood life after death no soul\nreligion and memory loss after death\nphilosophical resurrection debate\ncults and the illusion of immortality\ndoes consciousness survive death\nresurrection vs reincarnation\nwhen cults promise paradise\nfake hope after death\ncritical thinking about religion\nreligious trauma and false afterlife\nmind-body dualism debunked\nimmortality myth in cults\nJW beliefs under the microscope\nsoul vs personality in religion\nparadise earth flawed logic\nhigh control group doctrine exposed\nthought reform and resurrection\ndo we have a soul JW\nempty promises of religion\ncult afterlife deception\nphilosophy of the self after death\nmemory continuity and personal identity\nbrain death vs spiritual hope\nreligious manipulation and false comfort\nidentity death in resurrection beliefs",
      "release": "2025-05-24T23:20:05Z",
      "duration": "00:10:03",
      "explicit": false,
      "youTubeId": "Xr-IeYiNkZI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Xr-IeYiNkZI"
      }
    },
    {
      "id": "a0a12704-2b36-4f64-80b4-6665836bfb93",
      "title": "Not Disfellowshipped, Still Shunned: The JW Double Standard",
      "description": "Both of us — Falon and Jason — have broken nearly every major Jehovah’s Witness rule.\nWe’ve celebrated holidays. We’ve spoken out publicly. We’ve embraced the lives the organization told us to fear.\nAnd yet… we haven’t been disfellowshipped.\nJason still lives just a few miles from the Kingdom Hall where his publisher card is still on file. Falon’s family knows exactly where she stands. Neither of us has hidden who we are — and yet, on paper, we’re just “inactive.”\nSo why haven’t we been formally disfellowshipped?\nIn this episode, we explore a theory. One that says a lot about control, appearances, and the fear-based culture Jehovah’s Witnesses live in.\nBecause while the organization may have stayed silent… our families didn’t. The shunning came anyway — without an announcement, without a committee, and without a single word from the platform.\n\nJehovah’s Witnesses disfellowshipping\nWhy I left Jehovah’s Witnesses\nInactive Jehovah’s Witness\nWhat happens if you leave Jehovah’s Witnesses\nShunned by Jehovah’s Witness family\nEx JW podcast\nJehovah’s Witness truth\nLife after leaving Jehovah’s Witnesses\nJehovah’s Witnesses control\nApostate Jehovah’s Witness story\nShould I study with Jehovah’s Witnesses\nLeaving a high control religion\nExposing Jehovah’s Witnesses\nJehovah’s Witness elders and disfellowshipping\nWhat Jehovah’s Witnesses don’t tell you\nWhat it’s really like to leave the JW religion\n\n#ExJW\n#FormerJehovahsWitness\n#JehovahsWitnesses\n#Disfellowshipped\n#Shunning\n#JWPodcast\n#difficultchildhood #DifficultChildhoodpodcast\n#Apostate\n#ThinkingOfLeavingJWs\n#ShouldIStudyWithJWs\n#DoubtingJWs\n#JWTruth\n#LeavingJWs\n#ReligiousTrauma\n#HighControlGroup\n#CultRecovery\n#ToxicReligion\n#LifeAfterReligion\n#FamilyShunning\n#FreedomAfterFaith\n\n00:00 Reporting from the Local Kingdom Hall\n01:15 This Week We Talk About…\n01:53 Thanks Leo!\n02:04 “Come and get me!” - Jason\n04:38 The JW God of the Universe Has “Limitations”\n07:01 JW’s Version of God Turns People Off to Christianity \n12:20 Falon’s Dad Shuns But She’s Not DF-ed\n13:13 Exposed: The Real Reason They DF People\n18:23 Falon Face-to-face with Her Former Pioneer Partner\n20:05 The Main Reasons They Haven’t Disfellowshipped Us\n23:24 The Org Struggles to Take Back Control \n25:05 DA and DF Announcements Create Curiosity\n29:48 I want to be pop-U-lar\n30:25 Mayor Goldie Wilson",
      "release": "2025-05-20T04:46:27Z",
      "duration": "00:31:56",
      "explicit": false,
      "youTubeId": "T__ze20sk7s",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T__ze20sk7s"
      }
    },
    {
      "id": "75e4cfeb-8e2a-435e-8d04-aa7d99d81fb7",
      "title": "The Jehovah\u0026#39;s Witness Org Hurts. How Pets Helped Us Heal.",
      "description": "When you\u0027re raised as one of Jehovah’s Witnesses, you’re not taught how to grieve — you\u0027re taught to suppress.\nEmotions get shelved. Sadness gets postponed eternally since the JW promises never come true. And when someone or something truly meaningful is gone… you\u0027re left without the tools to process it.\n\nIn this episode, Jason shares the story of saying goodbye to his bulldog, Berry — the one soul who stood by him unconditionally when he left the Jehovah’s Witness religion and was shunned by family. Falon also talks about her dog, Baxter, and how our pets helped us survive the grief we were never taught to face.\n\nJehovah’s Witnesses don’t encourage emotional processing — they shut it down. Funerals become recruiting events. Grief is brushed off with “you’ll see them soon in paradise.” This episode is about what happens when you finally do feel it… and how pets can be the first ones to teach you how to grieve, and how to heal.\n\nThere are tears.\nThere’s laughter.\nThere’s Sesame Street.\nThere\u0027s wisdom from Jimmy Stewart.\nAnd yes, there’s Vincent Price.\n\n❤️‍🩹 This one’s for Berry. For Baxter. And for everyone still learning how to feel again.\n\n#JehovahsWitnesses #ExJW #ReligiousTrauma #PetLoss #Grieving #ExJWPodcast #Cults #Shunning #JWFuneral #MentalHealthAwareness #DogGrief #DogsAreFamily #CultRecovery #DifficultChildhoodPodcast #HealingJourney #EmotionalHealing #ExJWCommunity #difficultchildhood",
      "release": "2025-05-10T16:00:06Z",
      "duration": "00:25:12",
      "explicit": false,
      "youTubeId": "72Exr71OqGU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=72Exr71OqGU"
      }
    },
    {
      "id": "5bbcbea2-16f0-4de8-ae66-70497bec7862",
      "title": "As a Christian, I Cherish the Cross — Here’s Why the JWs Got It Twisted",
      "description": "In this solo episode, Falon opens up about something deeply personal and powerful to her: the cross. As a Christian who left the Jehovah’s Witness organization, Falon explains why the cross – and even the crucifix – is meaningful and sacred to her.\n\nJehovah’s Witnesses are famously anti-cross, claiming it\u0027s \u0022pagan\u0022 and avoiding it completely. But as Falon explains, this rejection isn’t about truth — it’s about separating themselves from the rest of Christianity just to seem “different.”\n\nIf you’re a Christian who left the JW religion, or if you’ve ever wondered why Jehovah’s Witnesses refuse to acknowledge the cross of Christ, this episode is for you. Falon shares from the heart about faith, freedom, and reclaiming the symbols that matter.\n\nwhy Jehovah’s Witnesses hate the cross, Christian ex-Jehovah’s Witness, meaning of the crucifix, leaving Jehovah’s Witnesses, Watchtower false teachings, reclaiming faith after cult, Christian symbols, cross in Christianity, ex-JW Christian podcast, high control religion recovery, why JWs reject the cross, JW cross history \n\n#ExJW #ChristianFaith #JehovahsWitnesses #CultRecovery #LeavingJWs #CrucifixMeaning #FaithAfterJW #WatchtowerLies #ChristianSymbols #CrossOfChrist #FalonSpeaks #SoloEpisode #ExJWPodcast #difficultchildhood",
      "release": "2025-04-22T18:00:06Z",
      "duration": "00:15:27",
      "explicit": false,
      "youTubeId": "9B-2c6n_tUc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9B-2c6n_tUc"
      }
    },
    {
      "id": "4bcd3edd-bc12-4115-9373-ed92bdd8405c",
      "title": "Live! Why this Watchtower was MORE than just a failed prediction!",
      "description": "They told millions that the generation of 1914 would never die before Armageddon came. In the 1960s and \u002770s, Jehovah’s Witnesses were led to believe that 1975 would mark the end of the system of things. When the end didn’t come, the Governing Body quietly rewrote their narrative — not with an apology, but with a shrug and a gaslight. In this episode, we expose the manipulation, the goalpost-shifting, and the psychological tactics used to blame the members for believing what they were taught. If you’ve ever been told “Jehovah’s Witnesses never said the end would come in 1975,” this one’s for you.",
      "release": "2025-04-12T18:40:00Z",
      "duration": "00:43:25",
      "explicit": false,
      "youTubeId": "1lZqy7E6Jr4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1lZqy7E6Jr4"
      }
    },
    {
      "id": "a0561cbc-a847-403b-ae4a-65f66e4b87ad",
      "title": "JW Survivor Punished After Assault — The Elders Blamed Her",
      "description": "This episode covers a disturbing and heartbreaking reality: in some cases, Jehovah’s Witness elders have punished victims of sexual assault instead of protecting them. Ericka shares her real story of being a survivor who was blamed and punished for her own assault. This episode is not graphic, but it does address serious abuse and the high-control tactics used by the Watchtower organization to maintain silence and shame.\n\n🔔 If you\u0027ve experienced this spiritual leader abuse or know someone who has, you\u0027re not alone.\n👥 Featuring personal stories, critical analysis, and compassionate commentary by ex-JWs who understand the culture of control.\n⛔ Trigger Warning: This episode contains discussion of sexual assault and victim shaming. Viewer discretion is advised.\n\nShare story at https://www.speakpipe.com/difficultchildhood\n\n💬 S.A. \u0026 Abuse Resources | Help, Support \u0026 Healing\nThese are trusted, confidential resources that offer support, therapy, and community for survivors. 💜\n\n🔹 RAINN (National Network) – 24/7 Crisis Hotline \u0026 Support\n👉 https://www.rainn.org/resources\n\n🔹 NSVRC (National Sexual Violence Resource Center) – Survivor education \u0026 healing tools\n👉 https://www.nsvrc.org/survivors\n\n🔹 Family Service League – Free virtual support groups on Zoom\n👉 https://www.familyserviceleague.org/virtual-support-groups\n\n🔹 Joyful Heart Foundation – Support for healing after trauma\n👉 https://www.joyfulheartfoundation.org/learn/sexual-assault-and-rape/resources/survivors\n\n🔹 1in6 – Resources for men who have experienced unwanted or abusive experiences\n👉 https://1in6.org\n\n🔹 Pandora’s Project – Online survivor forums and peer support\n👉 https://www.pandorasproject.org\n\n🔹 The Center for Respect – Consent education \u0026 healing workshops\n👉 https://www.centerforrespect.com\n\n00:00 JW’s have taught victim blaming all our lives. \n04:28 Ericka’s Voicemail About Assault and Healing\n09:12 Ericka\u0027s a Boss\n13:18 Bad Advice and Punishment from Elders\n15:32 Jason: I think the Bible is the Original Source\n18:57 Young People Ask, Answers that Injure\n28:18 Shepherd the Flock of God - Dangerous Stupidity and Arrogance \n33:59 My Book of Bible Horror Stories\n38:45 Falon Debunks the Story of Eve\n39:57 Worldly People\n40:58 Being Shunned for Being Assaulted",
      "release": "2025-04-06T17:00:06Z",
      "duration": "00:44:11",
      "explicit": false,
      "youTubeId": "BxjsOfMP_pk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BxjsOfMP_pk"
      }
    },
    {
      "id": "2052e343-d017-47c3-8249-dc8615ef1dd9",
      "title": "No Identity, No Confidence, No Voice: Finding Yourself After Leaving Jehovah\u0026#39;s Witnesses",
      "description": "Growing up Jehovah’s Witness meant constantly being told we were “lowly” — unworthy, sinful, and totally dependent on the cult for our value. In this raw and personal episode of DiffiCULT Childhood, we talk about what that kind of programming does to your self-esteem, your body image, your confidence, and your identity.\n\nWe reflect on how being a JW meant living without money, without a voice, and without a true sense of self. How even weight struggles and self-sabotage often come from the deep shame instilled by high-control religions. And most importantly, we talk about how we’ve rebuilt. Slowly, painfully, and beautifully.\n\nThis episode is for anyone who left the Jehovah’s Witnesses (or any controlling group) and is learning to love themselves again — maybe for the very first time.\n\n💬 Have you struggled with self-esteem since leaving? Drop a comment. You’re not alone, and you do matter.\n\nOr leave us a voicemail at https://www.speakpipe.com/difficultchildhood\n\n\n🔔 Don’t forget to like, subscribe, and share this with someone who needs it.\n\n—\nHave you noticed how your self-esteem was impacted even years after leaving the JW cult? Did you struggle with weight, money, confidence, or even knowing who you were? Let\u0027s talk about it below — this is a safe space to unpack all the stuff the Watchtower never let us feel.\n\n#ExJW #CultRecovery #JehovahsWitnesses #SelfEsteem #HealingJourney #LeavingJWs #ReligiousTrauma #ConfidenceAfterCult #DiffiCULTChildhood #ExJWPride\n\n00:00 The Struggle to Rebuild Self Worth\n04:45 How the JW System Crushes Self Worth\n12:47 Why After School Activities Are Banned for JWs\n17:00 Why I Felt Less After Leaving JW’s\n20:42 What if it ALL goes WRONG??\n22:39 Setting Boundaries is Hard.\n27:18 How Falon Got Her Groove Back\n31:02 Negative Self Talk\n36:00 How to Celebrate and Notice Accomplishments \n36:53 Paging Mr. and Mrs. Boombalatty\n39:57 What helped you? https://www.speakpipe.com/difficultchildhood",
      "release": "2025-03-23T00:00:06Z",
      "duration": "00:41:57",
      "explicit": false,
      "youTubeId": "PD4EVIph1Vk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PD4EVIph1Vk"
      }
    },
    {
      "id": "380dd0f8-0039-43f7-b73f-e8344623d5bf",
      "title": "Jehovah’s Witnesses \u0026 Scientology: Why they REALLY Shun",
      "description": "Jehovah’s Witnesses and Scientology—two religions, one high-control system. In this exclusive short, Jason dives into the hidden reason JWs and Scientologists really shun former members. And its not what we first thought.  #Scientology #JehovahsWitnesses #LeahRemini #MikeRinder #ExJW #CultEscape \nWatchtower Exposed\nJW Governing Body Lies\nWaking Up from the Truth\nJW Cult Tactics\nLeaving Jehovah’s Witnesses\nFormer Jehovah’s Witness Testimony\nIs Jehovah’s Witnesses a Cult?\nWhy I Left Jehovah’s Witnesses\nHigh-Control Religion\nWatchtower Cover-Ups\nThe Truth About “The Truth”\nShunning in Jehovah’s Witnesses\nExposing Watchtower Secrets\nJehovah’s Witness Doctrine Lies\nElders and Watchtower Control\nScientology vs. Jehovah’s Witnesses\nLeah Remini on Cults\nMike Rinder Jehovah’s Witnesses\nMind Control in Religion\nJehovah’s Witness Hypocrisy\nJW Double Standards\nJehovah’s Witness Manipulation",
      "release": "2025-03-20T21:47:08Z",
      "duration": "00:07:10",
      "explicit": false,
      "youTubeId": "h29WgkRg5Xw",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h29WgkRg5Xw"
      }
    },
    {
      "id": "7f8e13d2-e6d9-4d81-aae4-ce2fc9cf8a2f",
      "title": "Jehovah’s Witnesses \u0026 Scientology: Same Cult Playbook?",
      "description": "Jehovah’s Witnesses and Scientology—two religions, one high-control system. In this exclusive short, Falon breaks down the eerie similarities between these groups, exposing how both use shunning, fear, and manipulation to keep members in line. She also discusses the work of Scientology and the Aftermath stars Leah Remini and Mike Rinder (R.I.P.), who have publicly exposed the dark side of Scientology at great personal costs. Are Jehovah’s Witnesses using the same tactics? Watch now and decide for yourself. #Scientology #JehovahsWitnesses #LeahRemini #MikeRinder #ExJW #CultEscape \nWatchtower Exposed\nJW Governing Body Lies\nWaking Up from the Truth\nJW Cult Tactics\nLeaving Jehovah’s Witnesses\nFormer Jehovah’s Witness Testimony\nIs Jehovah’s Witnesses a Cult?\nWhy I Left Jehovah’s Witnesses\nHigh-Control Religion\nWatchtower Cover-Ups\nThe Truth About “The Truth”\nShunning in Jehovah’s Witnesses\nExposing Watchtower Secrets\nJehovah’s Witness Doctrine Lies\nElders and Watchtower Control\nScientology vs. Jehovah’s Witnesses\nLeah Remini on Cults\nMike Rinder Jehovah’s Witnesses\nMind Control in Religion\nJehovah’s Witness Hypocrisy\nJW Double Standards\nJehovah’s Witness Manipulation",
      "release": "2025-03-13T13:01:11Z",
      "duration": "00:05:44",
      "explicit": false,
      "youTubeId": "mGUGkI8VUIY",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mGUGkI8VUIY"
      }
    },
    {
      "id": "0f58f6e3-f431-46d2-a98a-c7adea22a4c9",
      "title": "Why JW Watchtower Studies Are So Repetitive (and Dangerous)",
      "description": "Every week, for 103 years, Jehovah’s Witnesses have gathered for the Watchtower Study, a 20ish-paragraph article produced by the Governing Body—a process that might seem like a Bible discussion but is actually a repetitive indoctrination routine. Each paragraph is read out loud, followed by pre-scripted audience responses reinforcing the same themes over and over again. The result? A steady diet of obedience messaging, reminding members 10-12 times per study that they must follow the organization without question.\n\nThis episode breaks down the boring but effective methods used in these studies, why they feel mind-numbing, and how the constant repetition of simple ideas cements loyalty to the cult. If you’ve ever sat through a JW Watchtower Study and thought, \u0022Why does this feel like brainwashing?\u0022—you’re not alone.\n\n🔴 Watch now and let’s talk about it!\n\nJehovah’s Witnesses, Watchtower Study, JW meeting, Watchtower indoctrination, JW cult, Jehovah’s Witnesses brainwashing, Watchtower Governing Body, ex-JW, ex Jehovah’s Witness, Jehovah’s Witness teachings, high control religion, Jehovah’s Witness obedience, Watchtower mind control, Jehovah’s Witness meeting structure, ex-JW testimony, leaving Jehovah’s Witnesses, Watchtower Bible study, JW exodus, Jehovah’s Witness repetitive teaching, Watchtower article, Watchtower audience participation, Jehovah’s Witness psychological control, JW propaganda, JW weekly study, Watchtower study breakdown, ex-JW YouTube, Jehovah’s Witness doctrine, Watchtower obedience training\n\nhttps://en.wikipedia.org/wiki/Inoculation_theory\nhttps://www.researchgate.net/publication/228318502_Repetition_is_the_First_Principle_of_All_Learning\nhttps://www.forbes.com/sites/johngreathouse/2020/01/19/the-single-most-effective-persuasion-technique-is-also-the-easiest-to-master/\nAmerican Sign Language",
      "release": "2025-03-09T04:07:23Z",
      "duration": "00:27:31",
      "explicit": false,
      "youTubeId": "W9TgesGEXC4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=W9TgesGEXC4"
      }
    },
    {
      "id": "750c977c-3f36-4ee4-b96c-06d0288209e7",
      "title": "Horror Stories of Creepy Jehovah’s Witness Men",
      "description": "Share your story at https://www.speakpipe.com/difficultchildhood\n\nFalon shares an off-putting story about a 60-year-old Jehovah’s Witness man scheming to date an 18-year-old in his congregation. Much like how Mormon women are expected to accept any dance or date offer from another LDS man, this short highlights the unsettling entitlement of JW men and their belief that women should comply with their advances—no matter the age gap or personal boundaries. A look into the disturbing dynamics within the Jehovah’s Witness world, where arrogance and control often go unchecked.\n\nJehovah’s Witness, ex-JW, cult behavior, creepy men, age gap, grooming, high-control religion, religious entitlement, JW dating culture, Jehovah’s Witness horror stories, ex-Jehovah’s Witness, JW women, Jehovah’s Witness men, toxic religion, Jehovah’s Witness arrogance, fundamentalist control, cult mindset, religious manipulation, Jehovah’s Witness elders, disturbing JW stories",
      "release": "2025-03-05T05:58:47Z",
      "duration": "00:03:17",
      "explicit": false,
      "youTubeId": "ONXlxrsFS7Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ONXlxrsFS7Y"
      }
    },
    {
      "id": "0346fa2b-48cb-4fd8-ace8-7c2eb7b4ca25",
      "title": "Should You Fade or Disassociate from Jehovah’s Witnesses? Pros, Cons \u0026amp; Hard Truths",
      "description": "If you\u0027d like to become a patron supporter of this podcast, you can do so at patreon.com/DiffiCULTChildhood  But another great way to support us is to like and subscribe and even share. Special thanks to our first patron Tiffany! \n\nIf you\u0027d like to leave a message for us that we could feature on our show, you can do so at speakpipe.com/difficultchildhood \n\nIf you\u0027re one of Jehovah’s Witnesses thinking about leaving, you have two choices: fade away quietly or write a letter of disassociation. But which is the right move? In this episode of DiffiCULT Childhood, Jason and Falon break down the pros and cons of fading vs. disassociating, exploring how each choice affects your family, mental health, and freedom from the cult\u0027s control.\n\nWriting a letter of disassociation means the Watchtower organization will officially label you as no longer one of Jehovah’s Witnesses, triggering shunning from your family and friends. But if they’re already treating you like an outsider, does it really matter? Many ex-JWs choose to disassociate to take a stand against the Jehovah’s Witness organization’s corruption, child abuse cover-ups, and strict control over members’ lives.\n\nOn the other hand, fading away—stopping meeting attendance and ministry without formally leaving—lets some ex-JWs keep ties with their Jehovah’s Witness family members. But is staying connected worth the emotional toll? Can you help your JW relatives escape the cult, or will it just keep you trapped in their world?\n\nIn this episode, Jason and Falon respond to a viewer, Robert, who asked whether he should fade or disassociate. We weigh the emotional, social, and strategic consequences of each path and share insights from former Jehovah’s Witnesses who have made this life-altering decision.\n\n🔔 Watch now and join the discussion: What did YOU choose, and why? Let us know in the comments!\n\n#ExJW #JehovahsWitnesses #Shunning #CultSurvivor #Disassociation #Fading #ReligiousTrauma #HighControlGroup #LeavingJWs #podcast",
      "release": "2025-03-01T16:00:06Z",
      "duration": "00:26:53",
      "explicit": false,
      "youTubeId": "MQfMoN8MsBQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MQfMoN8MsBQ"
      }
    },
    {
      "id": "ad9a8509-4e94-4997-9b04-98157a53d062",
      "title": "How Most JW Households Lose MILLION$ to Watchtower",
      "description": "In this episode, we break down the real cost of being in the Jehovah’s Witness cult. From gas money spent preaching, to unpaid labor at Kingdom Halls and conventions, to constant travel for “theocratic assignments,” JWs unknowingly pour hundreds of thousands of dollars into a system that gives them nothing in return.\n\nIf that money were invested, it could be worth millions at retirement—but instead, many Jehovah’s Witnesses hit 65 years old with nothing. Meanwhile, the Governing Body and Watchtower leaders live in luxury, enjoying tax-free wealth while demanding more and more from their followers.\n\n🔴 How much does it really cost to be a Jehovah’s Witness?\n🔴 How much would that money be worth if invested?\n🔴 Why does Watchtower keep JWs financially struggling?\n🔴 Why does the Governing Body get richer while members suffer?\n\nWe expose the financial greed of the Governing Body and the stress, anxiety, and misery they heap on their members—all while discouraging them from financial security, retirement savings, and even higher education.\n\nIf you’ve ever wondered how much money Watchtower swindles from Jehovah’s Witnesses, this episode is for you.\n\n💰 LIKE, COMMENT, \u0026 SHARE to expose the truth.\n🔔 SUBSCRIBE for more eye-opening episodes.\n#ExJW #JehovahsWitnesses #CultExposed #ReligiousAbuse #HighControlGroup\nJehovah’s Witnesses money\nHow much does it cost to be a Jehovah’s Witness\nJW\u0027s and finances\nWatchtower greed\nGoverning Body luxury\nJehovah’s Witnesses and poverty\nJehovah’s Witnesses retirement\nWhy are Jehovah’s Witnesses broke\nExJW stories\nHigh control religion",
      "release": "2025-02-22T01:00:06Z",
      "duration": "00:24:15",
      "explicit": false,
      "youTubeId": "gY3Dp3zSS34",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gY3Dp3zSS34"
      }
    },
    {
      "id": "63976711-5316-4328-bd04-6320e082a631",
      "title": "Viewer Voicemail with @JustDeannaJune  I never expected this!",
      "description": "In this DiffiCULT Childhood Podcast short, we share a voicemail from @JustDeannaJune. Deanna reveals a surprise change in a loved one\u0027s attitude toward the ORG and sees signs that the indoctrination is starting to crack. This episode is about not giving up hope on our loved ones. We never know what will help someone wake up, but also it\u0027s about the importance of managing our expectations. \n\nFor new content coming from Deanna, go subscribe to her channel @JustDeannaJune \n\nIf you\u0027d like to leave a voicemail, please go to https://www.speakpipe.com/difficultchildhood and don\u0027t forget to indicate if you do not want your voicemail used on this channel. \n\nExJW\nJehovah’s Witnesses\nWaking up from the cult\nMature Jehovah’s Witnesses\nLeaving Jehovah’s Witnesses later in life\nHigh-control religion\nJW indoctrination\nJW shunning\nFamily reunification\nPIMI to POMO\nJW doubts\nCult recovery\nEx-JW activism\nJW mind control\nGoverning Body lies\nJW cognitive dissonance\nJW truth crisis\nBreaking free from Jehovah’s Witnesses\nReligious trauma recovery\nExJW support",
      "release": "2025-02-19T19:57:11Z",
      "duration": "00:05:07",
      "explicit": false,
      "youTubeId": "sFTWQDC4ttc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sFTWQDC4ttc"
      }
    },
    {
      "id": "d113ab6a-9bb3-4749-910c-9ba1a1ab01a4",
      "title": "The Bible Verses No One Talks About",
      "description": "The Old Testament is full of strange and unsettling stories, but one particular passage stands out as especially bizarre. In this episode, I explore an ancient ritual that put women through a shocking ordeal—one that raises serious questions about justice, morality, and how women were treated in biblical times. What was this mysterious test, and what does it reveal about the culture and beliefs of the time? Let’s break it down. This is Driving Thoughts with Jason. \n\nWomen in the Bible\nDark Bible stories\nUnbelievable Bible verses\nBible history explained\nAncient religious laws\nToxic religion\nShocking religious beliefs\nChristianity and morality\nBible myths debunked\nReligious double standards\nBible controversies\nShocking Bible stories\nOld Testament laws\nNumbers 5 explained\nBible and women\nBiblical justice\nStrange Bible verses\nInfidelity in the Bible\nOld Testament punishment\nBible morality\nJehovah’s Witnesses and the Bible\nShocking Bible teachings Jehovah’s Witnesses ignore\nOld Testament laws Jehovah’s Witnesses don’t talk about\nJW doctrine vs. the Bible\nEx-JW Bible analysis\nJehovah’s Witnesses and women\nJW double standards\nThe Bible’s dark side Jehovah’s Witnesses won’t discuss\nJehovah’s Witnesses and biblical justice\nJW beliefs exposed",
      "release": "2025-02-15T04:42:22Z",
      "duration": "00:13:28",
      "explicit": false,
      "youTubeId": "vhn5mbCcaYk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vhn5mbCcaYk"
      }
    },
    {
      "id": "475cd061-3344-4225-9b16-08c05b9c0855",
      "title": "Jehovah\u0026#39;s Witness Fathers: Caring or Controlling?",
      "description": "What happens when Jehovah’s Witness fathers prioritize the cult over their own children? In this episode, Falon shares how her dad, Mark, recently found out about our YouTube channel—and instead of having a conversation, he chose to shun her. Jason reflects on his own experience, comparing his grandfather’s genuine interest in him with his father’s distant, rule-enforcing approach. We explore how Jehovah’s Witness dads often dismiss their children’s independent thoughts, reinforcing an environment of shame and control rather than love and understanding. Do Jehovah’s Witness fathers truly care, or are they just enforcers of the cult’s rules?\n\n#ExJW\n#JehovahsWitness\n#CultSurvivor\n#ReligiousTrauma\n#FamilyEstrangement\n#ExJWStories\n#LeavingTheCult\n#ExJWApostate\nJehovah’s Witness disfellowshipping\nJehovah’s Witness rules\nJehovah’s Witness control\nJehovah’s Witness mental health\nHigh control religion\nReligious trauma\nCult survival stories\nFamily estrangement\nCult deconstruction\nJehovah’s Witness dads\nJehovah’s Witness shunning\nJW cult\nEx-Jehovah’s Witness\nJehovah’s Witness family\nJehovah’s Witness parenting\nJehovah’s Witness leaving\nExJW stories\nThought Control",
      "release": "2025-02-08T17:00:06Z",
      "duration": "00:41:12",
      "explicit": false,
      "youTubeId": "C9zBMfVmWf8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=C9zBMfVmWf8"
      }
    },
    {
      "id": "f792d9ca-6a45-47c7-b6bd-e20bf3cff81f",
      "title": "Virtue Signaling Gone Wild: Skinny-Dipping Confessions \u0026amp; JW Double Standards",
      "description": "In this episode, we’re diving into the bizarre culture of virtue signaling within the Jehovah’s Witness organization. From members tattling on each other over harmless activities to the jaw-dropping double standards for higher-ups like Governing Body members, Circuit Overseers, and local elders—this is the tea you won’t want to miss.\n\nWe’re also exposing the gender bias that forces women to have their husbands present in elder meetings while men get to choose. And of course, we couldn’t talk about all this without spilling some tea on ourselves. Hear the hilarious and absurd story of how a group of us went skinny-dipping, only to have a fellow JW turn us in to the elders like a self-righteous narc. It’s juicy, it’s raw, and it’s a perfect example of how the JW culture loves to poke its nose where it doesn’t belong.\n\nJoin us as we call out the hypocrisy, share our stories, and give you an unfiltered look at life inside the high-control cult. Earl Grey EVERYWHERE. \n 🍵👀\n\n00:00 Such a Big Deal\n02:09 Old School Un-cool Move by Jason\n05:40 “Loose Conduct” Story\n13:04 Our Elder Judicial Meetings\n19:19 Husbands Have More Power than Wives\n22:38 The Art of Minding One’s Own Business \n28:50 With Apologies to E.\n30:44 The Rules Don’t Apply the same to JW Men in Power \n31:18 Tony Morris 3-Year Delayed Punishment\n\nAnthony Morris III Buying Over $800 Liquor Likely with Donated JW Money loading into his luxury Cadillac also paid for by money from JW\u0027s https://youtu.be/n1-1IeB3xJg?si=MomcHkBvRWn6Ub_O\n\nJW judicial committee\nWitness reporting culture\nJehovah’s Witness gossip\nLife inside Jehovah’s Witnesses\nJW elder privileges\nJW congregation politics\nJehovah’s Witness morality rules\nJW modesty expectations\nJehovah’s Witness elder bias\nJW women in the congregation\nJehovah’s Witness secret meetings\nWitness rules for husbands and wives\nJehovah’s Witness lifestyle control\nHigh-control religion rules\nJW personal conduct\nJehovah’s Witness spying\nStories about Jehovah’s Witness elders\nJW organization whistleblowers\nExposing Jehovah’s Witness hypocrisy\nMicro managing elders",
      "release": "2025-01-25T23:00:06Z",
      "duration": "00:35:24",
      "explicit": false,
      "youTubeId": "g1qWPMXaaC8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g1qWPMXaaC8"
      }
    },
    {
      "id": "e5bd6cdc-75ee-4cfa-a868-f04880bb5cfd",
      "title": "Voicemails from the Edge: Life Inside and Beyond Jehovah’s Witnesses",
      "description": "Are you still feeling the pull of the Jehovah’s Witness organization, or maybe you’ve already broken free but can’t shake the lingering effects? In this episode, we’re listening to YOUR stories. \n\nOur viewers called in and shared their heartfelt experiences—some are still trapped in the ORG, while others have been out for decades but continue to heal from the psychological damage caused by the high-control religion of Jehovah’s Witnesses. From stories of gaslighting and shunning by Jehovah’s Witness family members, to uplifting messages of hope and freedom, this episode is a rollercoaster of emotions.\n\nWhether you’re thinking about leaving, newly out, or looking for solidarity in your journey, these voices prove you’re not alone. Click to hear these unfiltered, raw, and inspiring messages from people just like you.\n\nWant to leave us a message? Go to www.speakpipe.com/difficultchildhood\n\n0:00 Years of JW Org Nonsense.\n05:50 Caller 1: “Are they serious?” JW PIMO Wife \u0026 Mother\n15:30 Caller 2: My JW mom kicked me out when I was 17 and the elders asked gross questions\n26:24 Caller 3: How my JW family treats me. “I’m out but I feel like I’m in a mental prison.”\n40:17 Caller 4: I “returned to Jehovah” and the elders started interrogating me\n49:14 Caller 5: Jason’s friend Gene broke free at 17. Plus he works at the happiest place on earth. 🐷 https://www.ironwoodpigs.org \n58:59 40,000\u002B Hours Un-Witnessing 🤩 And we are just one voice in a chorus of apostates. \n\n- Jehovah\u0027s Witnesses  \n- Leaving Jehovah\u0027s Witnesses  \n- Ex-Jehovah’s Witness stories  \n- Escaping high-control religion  \n- Shunning in Jehovah’s Witnesses  \n- Gaslighting by Jehovah’s Witness family  \n- Psychological effects of Jehovah’s Witnesses  \n- Breaking free from Jehovah’s Witnesses  \n- Listener voicemails  \n- Cult recovery  \n- Healing from religious trauma  \n- Jehovah’s Witness mental health  \n- Ex-JW experiences  \n- Life after Jehovah’s Witnesses  \n- Overcoming shunning  \n- High-control religion abuse  \n- Ex-Jehovah’s Witness support  \n- Leaving the Watchtower  \n- Freedom from cults  \n- Recovering from religious control",
      "release": "2025-01-19T16:00:06Z",
      "duration": "01:01:17",
      "explicit": false,
      "youTubeId": "qwc5jutimIo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qwc5jutimIo"
      }
    },
    {
      "id": "54a67afd-40ad-425a-bf6c-fe38dfc4bc92",
      "title": "Coming in January, We React to this Film About Jehovah\u0027s Witnesses",
      "description": "Next month we\u0027re reacting to the 2017 movie The Children Act. This powerful film explores the heartbreaking realities of English law and Jehovah’s Witness children who face life-threatening situations due to the religion\u0027s prohibition on blood transfusions. We encourage you to watch the movie in advance and join us for a discussion about how these real-life authoritarian policies impact families and children in devastating ways. \n\n#JehovahsWitnesses\n#ExJW\n#HighControlReligion\n#BloodTransfusion\n#TheChildrenAct\n#CultSurvivor\n#ExJWActivism\n#NoBloodDoctrine\n#ReligiousAbuse\n#FaithOverLife\n#Shunning\n#ChildrensRights\n#DiffiCULTChildhood\n#LeavingTheCult\n#PodcastEpisode",
      "release": "2024-12-19T05:13:52Z",
      "duration": "00:01:14",
      "explicit": false,
      "youTubeId": "ke_OieHndCQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ke_OieHndCQ"
      }
    },
    {
      "id": "576f35be-0b36-4cf9-b16d-eb6c6c1b61aa",
      "title": "Choosing Peace: Going No Contact with Toxic JW Family",
      "description": "Falon and Jason  will be back with season 2 in January.\n\nIn the meanwhile, in this holiday short I  look at a video from the brilliant comedian Christina Pazsitzky, where she opens up about her decision to go no contact with her abusive family. Drawing from her experiences and my own, I dive into the unhealthy behaviors of families that shun us and share why I’ve chosen to no longer respond to any phone calls or texts from my own family. This episode is about taking control of your mental health, embracing peace, and realizing that life can truly improve after setting boundaries. Watch to see how breaking free from toxic family dynamics is one of the healthiest decisions you can make.\n\nJehovah\u0027s Witness shunning\nGoing no contact\nChristina Pazsitzky toxic family TikTok\nFamily abuse and boundaries\nDiffiCULT Childhood podcast\nHealing after shunning\nBreaking free from toxic relationships\nHigh control religion recovery\nComedian Christina P\nSetting family boundaries\nexJW Watchtower Bible and Tract What Do Jehovah\u0027s Witnesses Believe Cult Survivor\nChosen Family\nGay exJW\nRebuilding after JW",
      "release": "2024-12-10T04:06:52Z",
      "duration": "00:20:19",
      "explicit": false,
      "youTubeId": "RVQTI83ZTEE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RVQTI83ZTEE"
      }
    },
    {
      "id": "6c4b4fbf-be46-401a-87de-7afa3e2f8b40",
      "title": "It\u0027s Not As Late As You Think",
      "description": "The Governing Body of Jehovah\u0027s Witnesses has been tricking us into staying in the cult for over a century, and this tactic is STILL WORKING. And it\u0027s not what you think. At least i think it isn\u0027t. This is Jason from the channel and I am here sharing my driving thoughts. \n\nToday I break down the two major realizations that I\u0027ve had since leaving Jehovah\u0027s Witnesses.\n\nWe are on a break right now, but we will be returning with season two of Difficult Childhood in January. Meanwhile, we will have new content shorts like this to share. Please like and subscribe! Hit the notification bell so you know when new episodes drop next year!\n\nKeywords: Leaving Jehovah’s Witnesses, life after leaving a cult, Jehovah’s Witness high-control group, rebuilding life after JW, Jehovah’s Witness ex-member stories, overcoming cult indoctrination, escaping high-control religions, DiffiCULT Childhood Podcast Jehovah’s Witnesses exJW pioneer elder ministerial servant Kingdom Hall",
      "release": "2024-10-29T21:48:04Z",
      "duration": "00:17:10",
      "explicit": false,
      "youTubeId": "1eDPB1hymis",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1eDPB1hymis"
      }
    },
    {
      "id": "ceef2fe3-b276-48e8-870e-97dafe98bad2",
      "title": "Exposed: The Hidden Reasons JW\u0026#39;s Aren\u0026#39;t Allowed to Vote",
      "description": "In this episode, we talk about growing up, knowing nothing about politics, and how we developed our political views. Plus we tell you who to vote for! JK, we do not. \n\nWith the US presidential election coming up we break down our process, the hypocrisy of the governing body, what things Jehovah\u0027s Witnesses do actually vote for, and how JW leadership actually lobbies to take your tax dollars. Why are we paying for this abusive CULT? \n\n00:00 Introduction to Jehovah\u0027s Witnesses and Politics\n03:08 The Dilemma of Political Neutrality\n06:04 Government Assistance and Jehovah\u0027s Witnesses\n09:02 The UN Partnership Controversy\n11:52 Internal Voting Practices of the Governing Body\n15:02 Theocratic Warfare and Deception\n17:59 The Role of Scapegoats in JW Beliefs\n21:03 Contradictions in Political Engagement\n21:45 The Malawi and Mexico Case Study\n26:59 The Impact of Government Funding on JW Practices\n30:00 Encouragement to Engage in Politics\n32:53 Right or Left?",
      "release": "2024-10-06T16:00:06Z",
      "duration": "00:38:18",
      "explicit": false,
      "youTubeId": "bxHHktJXYP8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bxHHktJXYP8"
      }
    },
    {
      "id": "165a62ea-7d00-47a8-a291-a865850c7547",
      "title": "Murders in the Kingdom Hall: A True Crime Story of Neglected Mental Health",
      "description": "In this episode, Falon and Jason discuss the tragic shooting incident that occurred in Hamburg, Germany, in March 2023, involving a former member of the Jehovah\u0027s Witnesses. They explore the details of the shooting, the mental health issues surrounding the perpetrator, and the inadequate response from the governing body and local elders. The conversation highlights the failures in addressing mental health crises within the organization and the broader implications for community safety and support. The episode concludes with reflections on faith, mental health, and the need for better support systems.\n\nTakeaways\n* The Hamburg shooting revealed significant failures in the Jehovah\u0027s Witnesses\u0027 response to mental health crises.\n* The governing body provides inadequate guidance for elders dealing with members in distress.\n* Mental health issues are often overlooked within high-control religious organizations.\n* Community reactions to the shooting included a large memorial service attended by thousands.\n* The lack of support for individuals facing mental health challenges can lead to tragic outcomes.\n* Elders may feel unprepared to handle serious mental health issues due to their training and guidelines.\n* The organization prioritizes its reputation over the well-being of its members.\n* There is a need for better mental health resources and referrals within religious communities.\n* The shooting raised questions about the safety of congregations and the effectiveness of current policies.\n* Reflections on faith highlight the importance of seeking help and not relying solely on religious leaders.\n\n\n\nKeywords\nHamburg shooting, Jehovah\u0027s Witnesses, mental health, governing body, community reactions, faith, gun violence, support systems, trauma, church policies, researched documentary instructional expose",
      "release": "2024-09-28T17:00:31Z",
      "duration": "00:39:19",
      "explicit": false,
      "youTubeId": "UaDY1Q6ehRI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UaDY1Q6ehRI"
      }
    },
    {
      "id": "9b462897-0602-4f93-a5b4-7be58c43dab8",
      "title": "We Were Anxious Celebrating Christmas, Halloween \u0026amp; Thanksgiving After Leaving JW",
      "description": "In this episode of DiffiCULT Childhood, we dive into the joy of celebrating Christmas, Halloween, and Thanksgiving after leaving the high-control Jehovah\u0027s Witness religion. Many ex-JWs struggle with anxiety and guilt when it comes to participating in holiday traditions, as the organization strictly forbids these celebrations. Join us as we share personal stories, tips on overcoming fear, and how to embrace the fun, connection, and joy of holiday traditions again. Whether you\u0027re nervous about attending your first Halloween party or wondering how to start new family traditions for Christmas and Thanksgiving, this episode will help you rediscover the magic of holidays!\n\nThis episode is perfect for anyone seeking advice, encouragement, and real-life stories about life after Jehovah’s Witnesses. #ExJW #JehovahsWitnesses #Holidays #Christmas #Halloween #Thanksgiving #HighControlGroup #LeavingCults #ReclaimingTraditions\n\n00:28 Falon\u0027s Favorite Festivus\n04:33 First Holiday Nerves\n09:34 Going HAAM on Halloween\n12:22 Halloween: Falon\u0027s Perspective \n18:00 Patriotic?\n30:15 Birthdays \n32:07 Holidays Got You Down?\n35:14 We Give the Holidays 3.5 Thumbs Up!\n37:38 Easter Bunny. Because Reasons.\n\nLeave us a message at https://www.speakpipe.com/difficultchildhood",
      "release": "2024-09-21T18:00:06Z",
      "duration": "00:41:51",
      "explicit": false,
      "youTubeId": "XrwVEIVr3ek",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XrwVEIVr3ek"
      }
    },
    {
      "id": "87aeb078-15ca-432f-8ef3-2d17b62439c8",
      "title": "Atheist vs. Christian: Two Paths Escaping Jehovah’s Witnesses",
      "description": "And now for something completely different: we interview each other with five pre-planned questions. But there\u0027s a twist—each will ask one wildcard question the other isn\u0027t prepared for!\n\nFalon opens up about how another cult, Scientology, helped her see the Jehovah’s Witnesses for what they are and explains why Christianity resonated with her. She even tackles the controversial question: should women \u0022be quiet\u0022 like the Bible\u0027s Paul says?\n\nJason shares his aha moments about the ORG, how he played “Candyman” to test the devil, why he ultimately landed on disbelief, what being an atheist of Jehovah means, and the mistakes he made on his way to personal freedom.\n\nIn this special interview episode, lifelong friends Falon and Jason dive deep into their unique journeys after leaving the Jehovah’s Witness organization. They explore how they both broke free from the high-control religion, but their paths couldn’t be more different. Jason, now an atheist, and Falon, a Christian, share five core questions that reveal their “aha” moments and the challenges they faced in finding their true selves.\n\nThis candid conversation will give perspective on two very different journeys out of the same cult. \n\n\n00:00 Five Questions Plus a Wildcard! \n01:27 Jason the Atheist Interviews Falon the Christian\n01:28 Q1. When did you first have doubts?\n04:58 Q2. When did you completely “wake up”?\n11:20 Q3. So you know it’s not \u0022The Truth.” What did you do next?\n15:45 Q4. What led you to be a Christian?\n19:51 Q5. What were the challenges and happy surprises after you left? \n24:06 The Question Falon Didn’t Expect.\n\n30:21 Falon the Christian Interviews Jason the Atheist \n30:25 Q1. When did you first have doubts?\n34:35 Q2. When did you completely “wake up”?\n41:25 Q3. So you know it’s not ‘The Truth.” What did you do next?\n43:37 Q4. What led you to Atheism? \n49:35 Q5. What were the challenges and happy surprises after you left? \n54:12 The Question Jason Didn’t Expect.\n\nReferences: \nNew International Version Bible\nDeuteronomy Chap 22 v8\nProverbs Chap 31 v10-31\n1 Corinthians Chap 14 v 34\n1 Tim. Chap2 v11-12\nLeviticus Chap 12 1, 2 \n\nIf you buy any books with the links below, it supports the channel with a small commission for each purchase and costs you nothing extra. Thank you! \n\nA Universe from Nothing: Why There Is Something Rather than Nothing by Lawrence M. Krauss https://amzn.to/3B5dJ3V\nThe God Delusion by Richard Dawkins https://amzn.to/47uXOYS\nWhy Evolution is True by Jerry A. Coyne https://amzn.to/3Zu9clP\n\n\nJehovah\u0027s Witnesses, high control religion, leaving Jehovah’s Witnesses, ex-JW stories, atheist vs Christian, faith transitions, religious deconstruction, cult recovery, escaping cults, ex-Jehovah’s Witness, shunning practices, JW organization, Scientology vs Jehovah’s Witnesses, personal freedom after cult, atheist journey, Christian faith, religious trauma, faith recovery, breaking free from religion, Watchtower Society, women in religion, spiritual freedom, ex-cult members, JW elder control, governing body, religious manipulation, finding faith, JW apostate, religious debate, leaving a cult, religious truth, former Jehovah’s Witness stories",
      "release": "2024-09-14T17:00:06Z",
      "duration": "00:59:12",
      "explicit": false,
      "youTubeId": "1-ccRgLXEVA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1-ccRgLXEVA"
      }
    },
    {
      "id": "8125d8e9-c56f-4115-8a8c-208bf0bac7e6",
      "title": "Jehovah’s Witnesses Shunned Us: Our Mothers Blocked Us for Leaving the Cult | with Mike Gonzalez",
      "description": "Have Jehovah\u0027s Witnesses knocked on your door? Before you let them in, watch this episode to learn how they tear families apart with their harsh shunning practices.\n\nAre you an ex-JW being shunned by your own parents? This week, Jason sits down with Mike Gonzalez, both sons of devout Jehovah’s Witnesses, to share their heartbreaking stories of being shunned by their mothers. Together, they break down how close mother-child bonds can be severed in the name of religious obedience.\n\nThis episode dives deep into the emotional manipulation, control, and estrangement tactics used by Jehovah’s Witnesses and other high-control groups. Whether you\u0027re recovering from religious trauma or seeking to understand the brutal realities of shunning, this conversation offers insight, validation, and hope for healing.\n\nShare your story: www.speakpipe.com/difficultchildhood\n\nHigh-Control Religious Groups Known for Shunning:\n\nJehovah’s Witnesses\nMormons (LDS)\nScientology\nAmish\nMennonites\nExclusive Brethren (Plymouth Brethren)\nSeventh-day Adventists\nHutterites\n\nTimestamps:\n00:00 - “I did it too.” - Jason\n05:09 - Teaching shame to children\n14:32 - The Governing Body’s control\n18:22 - Mother vs. daughter-in-law\n21:36 - Hoping we fail like the prodigal son\n25:32 - “When I left, the game she played.” - Mike\n28:33 - The question JW’s never ask ex-members\n37:04 - My biggest regret - Jason\n40:03 - Lost time\n44:56 - Who\u0027s really at fault?\n47:18 - Talk Therapy Solutions\n\nResources:\nFind a therapist: https://www.psychologytoday.com/us?tr=Hdr_Brand\n\nWatch Mike\u0027s other episode about growing up gay in the cult: https://youtu.be/e2dq1Ep--8I?si=H42WVkT6GRTjSNTd\n\nTags for better reach:\nGay ex-JW, Jehovah’s Witness shunning, religious trauma, disfellowshipping, high-control religion, cult recovery, Bethel, disfellowship, disassociate, POMO, podcast, shunned by family.",
      "release": "2024-09-06T18:00:07Z",
      "duration": "00:53:43",
      "explicit": false,
      "youTubeId": "bo__dtTvevA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bo__dtTvevA"
      }
    },
    {
      "id": "7eaeff28-5f2c-43c7-b846-d27020a23e24",
      "title": "Part 2: How Jehovah’s Witnesses Make Addiction WORSE | @JustDeannaJune Story",
      "description": "This is part TWO of an life changing story with Deanna from the @JustDeannaJune channel to discuss addiction, recovery, and the harmful ways the Jehovah’s Witness Governing Body orders local “elders” to deal with members struggling with addiction. \n\nDeanna shares her deeply personal story as a recovering alcoholic, highlighting how the organization shames and neglects addicts, viewing addiction as a \u0022sin\u0022 or spiritual weakness, rather than a medical condition. \n\nDon\u0027t miss this eye-opening discussion that challenges the harmful doctrines of Jehovah’s Witnesses and offers hope and practical steps for anyone dealing with addiction. Make sure to like, comment, and subscribe for more content that exposes the truth behind high-control religions and supports those on the path to recovery.\n\n#AddictionRecovery #JehovahsWitnesses #CultSurvivor #ExJW #SubstanceAbuse #AddictionHelp #ReligiousTrauma #MentalHealth #AlcoholRecovery #CultAwareness #ExJWActivism #JustDeannaJune #RecoveryJourney #Elders #Watchtower #governingbody \n\n00:00 This isn’t a “religion”. It’s a cult...You can lose your life.\n00:39 What Woke Me Up\n05:08How Family Helped\n12:04 “Why” I Couldn’t Get Sober On My Own\n16:52 DUI Turning Point\n20:10 How JW Thinking Gives Addiction the Power\n26:45 Confidence in My Competence \n28:55 What can be done if you don’t have access to rehab.\n35:12 POMO? Here\u0027s the thing...\n\nAA meetings have helped millions. https://www.aa.org\nAA not for you? Try a secular non-religious experience at  https://smartrecovery.org\n\nHelping a family member who is starting to wake up? Click here for Deanna\u0027s experience and Jared\u0027s Advice at:  https://www.youtube.com/watch?v=lYgIexdorl8 \n\nEmail Deanna at justjune1973@gmail.com.\n\nThis video is for educational purposes. The goal is to expose the practices of the Jehovah’s Witnesses leadership. Christian. Atheist. Agnostic. PIMO PIMI POMO Elder ministerial servant pioneer Kingdom Hall ￼\n\nLeave us a message at speakpipe.com/difficultchildhood",
      "release": "2024-08-30T17:00:06Z",
      "duration": "00:42:00",
      "explicit": false,
      "youTubeId": "1A1IKWEWyrQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1A1IKWEWyrQ"
      }
    },
    {
      "id": "ea68650f-3902-4ec1-bed0-6c4ef70c7f96",
      "title": "Part 1: How Jehovah’s Witnesses Make Addiction WORSE | @JustDeannaJune Story",
      "description": "This is part one of an emotional episode of DiffiCULT Childhood. Jason and Falon sit down with Deanna from the @JustDeannaJune channel to discuss addiction, recovery, and the harmful ways the Jehovah’s Witness Governing Body orders local “elders” to deal with members struggling with addiction. \n\nDeanna shares her deeply personal story as a recovering alcoholic, highlighting how the organization shames and neglects addicts, viewing addiction as a \u0022sin\u0022 or spiritual weakness, rather than a medical condition. \n\nDeanna also opens up about her journey of waking up from the cult, how her family bravely left the organization ahead of her, and the intense challenges she faced from the cult, which further aggravated her addiction struggles. Through her experiences, this episode sheds light on how much better things could be within the organization if they truly understood and supported those dealing with addiction. But the Governing Body\u0027s lack of understanding is further evidence that there is no God directing this organization. \n\nTune in to hear Deanna’s inspiring story and the crucial conversation about the intersection of faith, addiction, and recovery in the high-control environment of Jehovah’s Witnesses.\n\n00:00 A conversation with @JustDeannaJune \n12:12 “Nothing About Being one of Jehovah’s Witnesses Made Me Happy”\n14:50 Activating the Addiction at 37 “Where has this been my whole life?🍸”\n18:44 A “Judicial Meeting” Proves No Holy Spirit In JW Congregations\n30:51 ‘Something I saw at rehab…’\n32:00 Worldly People are the BEST\n33:34 A Good Elder Actually Broke the Rules to Help\n37:50 JW Stigma About Addiction \u0026 Recovery Kills People\n41:46 Breaking the Rules on Shunning \n49:34 Studying the Watchtower Furthers My Wake Up Process\n  \nExplanation of terms: \nA “judicial meeting” or a “judicial committee” is formed to judge a member. Typically three “elders” or JW congregation leaders will require a member accused of some “sin” to meet with them to answer questions. The elders will decide if punishment is needed. There are more steps involved but those are the key points. \n“Private Reproof” is an expression Jehovah\u0027s Witnesses use when a member is punished in the congregation, but it is not announced from the platform. Punishment may entail not being able to have \u0022privileges\u0022 in the congregation, like raising your hand to comment, giving speeches or demonstrations from the platform, giving public prayers, or taking the lead in the ministry. \n“Public Reproof” has the same features as “private reproof” except additionally it is announced from the platform to all members at a meeting. For example, “Jason Hanson has been reproved.” This is a way to shame the “sinner”, and also make certain that any members who have witnessed or heard gossip about the \u0022wrongdoing\u0022 by the “sinner,” are aware that the elders took it seriously and dolled out punishment. \n\nFor more information on how “elders” judge JW members, have a look at the secret elder manual “Shepherd the Flock of God,” courtesy of https://avoidjw.org/manuals/elders-textbooks/\n\nFor information on “The Truth that Leads to Eternal Life” Published by Watchtower in 1968 click here:\nhttps://avoidjw.org/opinion/truth-that-leads-to-eternal-life/#:~:text=The%20publication%20The%20Truth%20that,All%20Those%20Who%20Seek\n\nFor JustJune’s video Can You \u0022Wake Up\u0022 Your Loved One From Watchtower Indoctrination? Click here: https://youtu.be/lYgIexdorl8\n\nStay tuned next week for part two, when Deanna of the JustJune channel talks about relapse and what changed for her the second time she went to rehab.",
      "release": "2024-08-24T15:00:07Z",
      "duration": "00:56:24",
      "explicit": false,
      "youTubeId": "oQvBB6KqG5I",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oQvBB6KqG5I"
      }
    },
    {
      "id": "c30a0285-553a-4ca8-b4fc-bc3652ed8780",
      "title": "Former Elder Talks Secret JW Shaming Training Video Part 2 with @AnthonyMorrisReturns",
      "description": "Chaka Yumba from @AnthonyMorrisReturns returns to share his insider information as a former Elder, as this time we analyze a secret Elder training video from https://www.reddit.com/user/Dav-King/ Made by the Jehovah’s Witness organization, it  sheds light on how congregation elders are trained, shamed, controlled, and kept in line. \n\nWith guidance from a manual called Shepherd the Flock of God, elders are taught how to manage the congregation often against their own will, and even against their fellow elders. However, they themselves are also under strict control by higher authorities within the org. The video highlights the intense pressure and scrutiny placed on members\u0027 private lives, using tactics of shame and guilt to maintain control. \n\nOne Elder\u0027s confession of viewing content deemed inappropriate by the organization reveals the extent of their reach into personal matters. \n\nJoin us as we discuss the disturbing methods used by the organization to dominate every aspect of its members\u0027 lives.\n\nRead the full Shepherd the Flock of God Secret Elder manual for yourself courtesy the good people at https://avoidjw.org/manuals/elders-textbooks/\n\n Leave us a VM at https://www.speakpipe.com/difficultchildhood\n\n00:00 High-control, Elders and All\n01:33 Leaked Secret Elder Training Video Clip 1: A Tattle-tale\n03:24 Chaka Explains the Circuit Overseer Visit Procedure\n07:45 Zach Morris Cutaway  \n09:11 Clip 2: Shaming a Grown Man\n14:16 It’s Funny. And then it’s NOT.\n16:36 Clip 3. Must Go Thru Elders to Get to God\n20:54 The Objective Christian Perspective  \n23:00 Weird JW Levels of “Sin”\n30:20 Clip 4: The Thin Grey Line\n35:32 The Scriptures Mean Anything We Want!\n38:00 Clip 5: The Scriptures STILL Mean Anything We Want!\n44:34 Clip 6: The Elder Book Makes the Decisions\n47:22 Guilt Trip: You Can Kill the Whole Congregation\n51:36 What “Help” Do Elder’s Actually Give?\n\nJehovah\u0027s Witnesses, Leaked Elder Training Video, Shepherd the Flock of God, High Control Religion, Cult Secrets Revealed, Religious Shame Tactics, Exposing JW Leadership, Elder Control Tactics, Circuit Overseer Training, JW Congregation Secrets, Religious Mind Control, Jehovah\u0027s Witnesses Exposed, Inside Jehovah\u0027s Witnesses, Elder Surveillance, Cult Dynamics, exJW, Atheist, Christian, religion, stories",
      "release": "2024-08-18T05:25:34Z",
      "duration": "01:01:16",
      "explicit": false,
      "youTubeId": "GQNlxZqxyrQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GQNlxZqxyrQ"
      }
    },
    {
      "id": "800c59d6-ec3c-41ff-82ea-69829b521955",
      "title": "Governing Body Rules for JW Students are AWFUL",
      "description": "There’s some 80’s and 90’s nostalgia and cringe in this episode, as Falon and Jason dissect the abusive and self-defeating policies the Governing Body imposes on JW Students. The organization’s stringent rules forbid JW\u0027s from participating in any extracurricular activities – no cheerleading, band, orchestra, sports, clubs, or drama. They also prohibit celebrating classmates\u0027 birthdays or any holidays, from elementary school through high school. This strict isolation creates a lonely and depressing experience, making Jehovah\u0027s Witness students feel like outcasts and \u0022weirdos.\u0022\n\nWe\u0027ll discuss how these restrictive practices lead to feelings of depression, anxiety, and shame, and how the governing body’s policies ultimately backfire. By alienating JW kids and preventing them from forming meaningful connections, they hinder their ability to recruit new members, contradicting their own objectives.\n\nGrab your trapper-keeper and join us as we share personal stories and insights into the emotional toll of growing up as a Jehovah’s Witness in the school system, and explore the long-term impacts on mental health and social development. \n\n\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC7736521/\nhttps://www.speakpipe.com/difficultchildhood",
      "release": "2024-08-09T15:00:06Z",
      "duration": "00:38:25",
      "explicit": false,
      "youTubeId": "T2NWNGcjrk8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T2NWNGcjrk8"
      }
    },
    {
      "id": "f352668a-4299-48bd-b822-dde46d3078fa",
      "title": "Former Elder Talks Secret JW Training Video \u0026 Shocking Control Tactics with @AnthonyMorrisReturns",
      "description": "In this crossover episode of DiffiCULT Childhood and https://www.youtube.com/@AnthonyMorrisReturns, we tackle a deeply unsettling issue within the Jehovah’s Witness organization: the deletion of elders who dare to send their kids to college. We’re diving headfirst into a Watchtower training video that instructs Circuit Overseers on how to maintain a tight grip on elders, ensuring they toe the line when it comes to higher education and their everyday life.\n\nThe circuit overseer in the video uses psychologically damaging control tactics and created a toxic  environment, showing that even elders can be victimized by the Governing Body as they control every JW in this authoritarian high control cult. \n\nWe’ll break down the manipulative tactics and language used in the video, exposing how fear and punishment are wielded to control and suppress independent thinking. By sharing real-life stories and exploring hypothetical scenarios, we’ll highlight the personal and familial turmoil caused by these draconian policies.\n\nJoin us for a critical analysis of the Watchtower\u0027s anti-education stance, comparing it to other high-control groups, and discussing the broader implications for those entangled in this web of control. Whether you’re an ex-JW, a current member, or someone curious about the inner workings of high-control religious groups, this episode sheds light on the hidden struggles and harsh realities faced by Jehovah’s Witnesses.\n\nhttps://www.psychologytoday.com/intl/blog/the-mental-health-revolution/202203/i-m-sorry-you-feel-way-and-other-gaslighting-tactics\nhttps://www.speakpipe.com/difficultchildhood",
      "release": "2024-08-03T18:00:06Z",
      "duration": "00:51:12",
      "explicit": false,
      "youTubeId": "uzyJohBxS0Q",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uzyJohBxS0Q"
      }
    },
    {
      "id": "808f952c-777b-4e4a-866a-238c351729d2",
      "title": "Peaked Publishers: Jehovah\u0027s Witnesses are Lying About Their Growth",
      "description": "https://www.speakpipe.com/difficultchildhood\n\nIn this revealing episode of DiffiCULT Childhood, the team scrutinizes the questionable membership statistics reported by the Jehovah\u0027s Witness Governing Body. Despite their claim of 8.8 million members or \u0022publishers,\u0022 the drastic reduction in the number of Kingdom Halls—from 110,000 to 64,000 over the past 13 years—paints a different picture. Could they be inflating their figures by counting individuals who have faded or become inactive?\n\nJason, Falon, and their special guest Rebecca, who is Jason\u0027s ex-wife and now a close friend, deep dive into the truth behind these numbers. They discuss how the Governing Body\u0027s real estate transactions reveal their deception, shedding light on the true state of Jehovah\u0027s Witness membership. Through personal stories and critical analysis, they expose the tactics used to maintain an illusion of growth.\n\nThis episode promises candid discussions and insider perspectives, offering a critical look at the organization\u0027s misleading claims. Don’t miss this enlightening conversation—tune in, subscribe, and join the dialogue as they uncover the realities of life within and beyond the Jehovah\u0027s Witnesses.\n\nHere are the links to the articles about the Brooklyn properties being purchased for those GIANT prices...\nhttps://www.bizjournals.com/newyork/news/2013/07/08/jehovahs-witnesses-cash-out-of-dumbo.html\nhttps://www.newsweek.com/jared-kushner-takes-down-famous-jehovahs-witness-brooklyn-waterfront-breaking-741861\n\n0:00 A False Start\n04:27  A Solid Case for the number of JW’s Being Falsified\n06:26 Reason One: Cart Witnessing \n10:05 Link to Video with Chaka Yumba https://youtu.be/nTrNtESUX54?si=1-kLnMiDfqfol8Pi\n11:23 Reason Two: Online Forum Growth\n13:04 Reason Three: A Profound Lack of Babies\n18:31 Reason Four: Building Count\n27:39 What Happened to the JW Org in the Last 13 Years?\n33:46 What the Next 25 Years Will Bring for the JW Org\n40:38 Falon Saves a Soul on the Cutting Room Floor\n\nJehovah\u0027s Witnesses, Ex-Jehovah\u0027s Witness, JW cult, Inflated membership numbers, Governing Body deception, JW membership statistics, High control religion, JW numbers fraud, Religious manipulation, JW community exposure, Cult survivor stories, JW membership inflation, Exposing JW practices, Life after leaving JW, Cult recovery, Former Jehovah\u0027s Witness experiences, JW governing body lies, Breaking free from JW, Inflated statistics in religion, JW deception",
      "release": "2024-07-26T16:00:06Z",
      "duration": "00:41:47",
      "explicit": false,
      "youTubeId": "98Bfprc3Qnk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=98Bfprc3Qnk"
      }
    },
    {
      "id": "1e3a4648-0ba1-479e-adce-33d3ba4dea7c",
      "title": "Calling Elder Wives: Share Your Story on Our Channel #exjwsthink #exJW #jw",
      "description": "If you were or are the wife of a Jehovah\u0027s Witness elder, share your experience with us! Go to www.speakpipe.com/difficultchildhood \nHere are some keywords to optimize exposure for your new video:\n\nJehovah\u0027s Witnesses, JW Elders, JW Secrets, Ex-JW Stories, JW Elder Wives, Confidential JW Stories, JW Experiences, Leaving Jehovah\u0027s Witnesses, High Control Religion, Cult Secrets, JW Insider Stories, Religious Confessions, JW Elder Confessions, JW Wives Speak Out, Jehovah\u0027s Witness Elders\u0027 Wives, Ex-JW Community, JW Testimonies, Cult Survivor Stories, JW Congregation Secrets, High Control Group Experiences JW Women",
      "release": "2024-07-22T04:30:08Z",
      "duration": "00:00:58",
      "explicit": false,
      "youTubeId": "cHbouuwtLUg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cHbouuwtLUg"
      }
    },
    {
      "id": "fd18d5a2-d4be-468b-84ad-3ec328fcb5d5",
      "title": "The REAL Reasons Jehovah\u0027s Witnesses Don\u0027t Practice Meditation",
      "description": "The Governing Body claim that meditation can let the demons into your mind. But what\u0027s the real reason behind this claim? We find this high-control group has a much more sinister reason for discouraging meditation. \n\n Join us as we explore the profound benefits of mindful meditation, especially for those recovering from high control cults like Jehovah\u0027s Witnesses, Mormons, Scientologists, and Evangelicals.\n@JustDeannaJune shares her valuable insights and personal experiences with meditation. Together with Falon, the Christian, and Jason, the atheist, we discover common ground and discuss how meditation can be a powerful tool for healing and self-discovery.\n\nDiscover how mindful meditation can help you regain control of your life, find inner peace, and build a brighter future after leaving a high control religious group.\n\nTune in and let us know your thoughts in the comments. Don\u0027t forget to like, share, and subscribe for more episodes on building a better life after leaving high control religions.\n\nAn objective view of JW meetings: https://www.youtube.com/watch?v=vUpsdR-Zf94\nSubscribe to https://www.youtube.com/@JustDeannaJune for brilliant insights.\n\n#MindfulMeditation #JehovahsWitnesses #HighControlCults #CultRecovery #ExJW #LeavingReligion #DeannaJune #MeditationBenefits #CultSurvivor #ExMormon #ExScientologist #EvangelicalExit #Podcast #HealingJourney #MentalHealth #ReligiousTrauma #SpiritualAwakening #AtheistChristianDialogue #SelfDiscovery #mentalwellbeing \n\n00:00 Intro\n00:49 JW Org Warning About Meditation\n04:43 Real Meditation Defined\n08:37 Real Reasons the Governing Body Doesn’t Want JW’s Meditating \n15:34 @justdeannajune Share’s Her Path to Being in the Present with Sobriety \n23:49 How the JW Org Destroys Self Esteem\n25:27 Mindfulness Meditation \n29:57 Movement Meditation \n30:23 Guided Meditation \n31:38 Breaking Unhealthy Cycles\n33:15 www.speakpipe.com/difficultchildhood",
      "release": "2024-07-19T15:00:06Z",
      "duration": "00:34:18",
      "explicit": false,
      "youTubeId": "mzcOdPnLA10",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mzcOdPnLA10"
      }
    },
    {
      "id": "2cb9a48f-461f-42c1-82a7-3508dc49addc",
      "title": "Fatal Trust: The True Story of Murder in a JW Congregation",
      "description": "In this gripping episode of DiffiCULT Childhood, we expose the false sense of security within the Jehovah\u0027s Witnesses organization. Despite the JW leadership\u0027s repeated claims of congregational safety, the tragic story of 21-year-old Whitney reveals a much darker reality. Whitney, a young Jehovah\u0027s Witness woman, was kidnapped and murdered by a \u0022brother\u0022 in \u0022good standing\u0022 from her own congregation. This harrowing event highlights the frequent occurrence of JW on JW crime, and shatters the illusion of a safe haven.\n\nWe delve into videos of the JW leadership asserting the safety of the congregation, contrasting their words with the grim truth. The tragedy doesn\u0027t end with Whitney\u0027s death; the organization manipulates her grieving mother to tighten its grip on current members, showcasing the cult\u0027s pervasive control.\n\nJoin us as we uncover the disturbing truths behind the facade of safety, using Whitney\u0027s heartbreaking story to shed light on the real dangers within the Jehovah\u0027s Witnesses community.\n\nKeywords: Jehovah\u0027s Witnesses, JW congregation, JW crime, JW leadership, cult control, Whitney\u0027s story, JW tragedy, safety myths, JW on JW crime, false security, JW murder, religious manipulation, DiffiCULT Childhood, ex-JW, Jehovah\u0027s Witnesses documentary, cult survivor stories, true crime\n\nTags: #JehovahsWitnesses #JW #CultSurvivor #JWTragedy #FalseSecurity #ReligiousManipulation #TrueCrime #ExJW #DiffiCULTChildhood #JWLeadership #CultControl #truecrime \n\n00:00 If you didn’t know what happened to her…\n02:15 It Made National News \n05:50 What \u0022spiritual paradise\u0022 is worth.\nwith Robo Ron Curzan @LloydEvans   \u0026 Leonard Meyers\n10:38 Unraveling “JW’s are Safe in the Congregation”\n12:33 JW Apologetics on “Spiritual Paradise”\n17:14 Arraignment and Sentencing\n19:35 Grieving mother exploited by the cult in front of 5000\u002B people.\n27:50 Jehovah’s Witnesses Aren’t Allowed to Grieve Properly\n29:30 Falon’s story of her little brother’s funeral\n31:33 JW’s Scanning the Obituaries to Preach\n34:30 Falon shares about JW control attempts at her mother’s funeral.\n36:22 Combat Indoctrination with Education and Therapy",
      "release": "2024-07-12T14:00:06Z",
      "duration": "00:40:40",
      "explicit": false,
      "youTubeId": "cGCgsaiYkM4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cGCgsaiYkM4"
      }
    },
    {
      "id": "161056f7-da6e-4440-b888-24f56717ad16",
      "title": "Introverted in a High-Control World: The Struggles of a Jehovah\u0027s Witness",
      "description": "Inspirational Quote of the episode: \n\u0022Screw you guys, I\u0027m going home.\u0022 - Eric Cartman\n\nIn this episode of DiffiCULT Childhood, we dive into the unique challenges faced by introverted Jehovah\u0027s Witnesses. \n\nFrom the overwhelming demands of attending large conventions to the exhausting door-to-door preaching, we explore how the high-control environment makes it difficult for introverts to navigate their faith. \n\nAs a side note: if it\u0027s God\u0027s organization why are they oblivious to the needs of neurodivergent people? Or do they just not care? \n\nPlus, we discuss the pressure to socialize exclusively and excessively within the congregation, form friendships with people who don\u0027t naturally align with our personalities, and the all-encompassing control the cult exerts over every aspect of their lives. \n\nJoin us as we uncover the emotional toll and personal struggles introverted JWs face, shedding light on a rarely discussed aspect of life within the Jehovah\u0027s Witness community.\n\n00:00 Our Favorite Jehovah’s Witness \n01:53 The Future is Bright\n03:13 Unique to ex-JW and ex-Mormon Podcasts. \n06:22 Five things that make being an introvert JW awful.\n06:55 #5 — JW’s Must ALWAYS be doing SOMETHING\n11:10 #4 — Finding the Secret Quiet Place at the Conventions. Casino Count Room!\n17:38 #3 — Deep Friendship in JW Discouraged. Here’s Why. \n26:27 #2 — Always Participate. \n33:00 Falon Makes Fun of Jason 1987\n33:40 #1 — Preaching as kids\n37:25 How is being JW different from being in an abusive relationship?\n41:35 “Going in the Ministry Brings Me Joy”\n46:07 Recharge in the way that works for you.\n\nJehovah\u0027s Witness, Introverted JW, High-control religion conventions, Door-to-door preaching, Introversion in religion JW social pressure, Cult control, Congregation socializing, Emotional toll of high-control religion, Struggles of introverted JWs, Ex-Jehovah\u0027s Witness experiences, Cult life challenges, Religion and introverts, High-control cults What did Jehovah Witness refuting Jehovah\u0027s Witnesses growing up Jehovah\u0027s Witnesses where did Jehovah\u0027s Witnesses originate exjw pioneer ministerial servant",
      "release": "2024-07-05T13:00:06Z",
      "duration": "00:46:09",
      "explicit": false,
      "youTubeId": "g9zu3LfO3NM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g9zu3LfO3NM"
      }
    },
    {
      "id": "2207360d-f99f-4fbb-93f3-9158ff20f597",
      "title": "The Introverted Jehovah\u0027s Witness #exjwsthink #podcast #exjw",
      "description": "Jehovah\u0027s Witness, Introverted Jehovah\u0027s Witness, High-control religion, Jehovah\u0027s Witness conventions, Door-to-door preaching, Introversion in religion, Jehovah\u0027s Witness social pressure, Cult control, Congregation socializing, Emotional toll of high-control religion, Struggles of introverted JWs, Ex-Jehovah\u0027s Witness experiences, Cult life challenges, Religion and introverts, High-control cults What did Jehovah Witness refuting Jehovah\u0027s Witnesses growing up Jehovah\u0027s Witnesses where did Jehovah\u0027s Witnesses originate exjw pioneer ministerial servant",
      "release": "2024-07-04T19:05:49Z",
      "duration": "00:00:59",
      "explicit": false,
      "youTubeId": "b0QO17U1RMk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=b0QO17U1RMk"
      }
    },
    {
      "id": "b22f7055-4a78-4a4b-b2d1-aa73df76402f",
      "title": "JW Propaganda Unraveled: Why the Latest Tactics are Failing",
      "description": "In this special episode of DiffiCULT Childhood, we collaborate with Chaka Yumba from https://www.youtube.com/@UCzkaKhX2iqjw8se37_KLBhw  to dissect and analyze the latest convention propaganda videos from the Jehovah\u0027s Witness organization. Despite their efforts, these videos are failing to keep JWs in the fold, and we’re here to explain why.\nJoin Falon, Jason, and Chaka as we play these propaganda clips and then take them apart from three unique perspectives:\n* Falon provides a Christian point of view.\n* Jason offers an atheist point of view.\n* Chaka, a licensed mental health therapist, shares a nonbeliever mental health professional\u0027s insight.\n\nTogether, we reveal the transparency and flaws in these propaganda tactics, discussing why they are not only ineffective but also blatantly obvious in their attempts to control and manipulate. \n\nPlus do JW’s have guardian angels? They didn\u0027t used to teach that, but now they kind of do. \n\nTune in for an eye-opening discussion that sheds light on the failing strategies of the JW cult and provides support for those seeking to break free.\nDon\u0027t forget to like, comment, share, and subscribe to help us reach more people and support those leaving high-control religions.\n\n00:00 Something New!\n02:55 The END is NOT Coming Any Time Soon\n07:44 The Governing Body Condescend to Scholars \n16:40 Is this a “NO” to Christmas?\n26:21 GB Sexism Update: Misogyny to Continue\n32:05 JW’s Have Guardian Angels? \n37:30 The GB Add to the Things Written for Jesus Video. \n43:45 No Blood Directive Continues Despite Deaths\n45:15 Story Time: First Hand Experience of Death from No Blood\n46:52 No More Door-to-Door? Or Hipsters in Paradise\n53:05 JW’s Seek Out Criminals to Join\n56:20 GB: No University! \n01:01:16 Mental Health Issues are NOT Taken Seriously by JW’s\n01:07:28 “White Christ Ruled from 1914. FACT!” - GB\n01:11:58 The one thing they conspicuously DIDN’T talk about. \n\nJehovah\u0027s Witnesses, Ex-JW, Cult propaganda, JW videos, High control religion, Religious manipulation, Mental health and religion, Christian perspective, Atheist perspective, Nonbeliever insights, Breaking free from cults, JW governing body, Religious control tactics, JW apostate, Propaganda analysis, Jehovah\u0027s Witness doctrines, JW beliefs, Leaving Witnessing to Jehovah\u0027s Witnesses, Religious freedom, Cult recovery What did Jehovah witness JW Update",
      "release": "2024-06-29T22:00:07Z",
      "duration": "01:13:51",
      "explicit": false,
      "youTubeId": "nTrNtESUX54",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nTrNtESUX54"
      }
    },
    {
      "id": "8505e812-6e9b-4b69-a881-6d2051c69e54",
      "title": "DiffiCULT Childhood Live Stream",
      "release": "2024-06-25T17:57:15Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "xZ4tQjiuPqY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xZ4tQjiuPqY"
      }
    },
    {
      "id": "d217261e-3e85-4617-930d-8fa273177f1e",
      "title": "Why the Governing Body Wants to Keep Jehovah\u0027s Witnesses POOR",
      "description": "It is expensive to be poor.\u0022\n— James Baldwin\n\nIn this eye-opening episode of DiffiCULT Childhood, we expose the harsh reality of how the Governing Body of Jehovah\u0027s Witnesses keeps its followers in a cycle of poverty. Discover the insidious tactics they use to ensure members remain financially dependent and easier to control, exploiting their dedication for personal gain.\n\nWe\u0027ll dive deep into:\n* The Strategy: How the Governing Body discourages higher education and career advancement to keep members financially insecure.\n* The Exploitation: The dark truth behind Jehovah\u0027s Witnesses working for free to build the organization\u0027s real estate empire.\n* The Profit: How the Governing Body profits massively from selling properties built and funded by the labor and donations of local Jehovah\u0027s Witnesses.\n\nDon\u0027t miss this episode that uncovers the hidden agenda behind the Governing Body\u0027s control tactics. Join us as we shed light on the manipulation and offer hope to those seeking a way out.\n\n00:00 Why are JW’s Often Broke?\n02:00 Mormons go to college. Why not JW’s?.\n07:20 The ORG’s main source of money isn’t local JW donations\n12:34 Falon’s Story Time\n16:17 Some JW’s make good money. But the ORG condemns it. \n18:01 Falon\u0027s Faith: “Ask for it all.” \n23:12 The tax free LUXURY real estate company www.ibsaproperty.com \n28:10 GB: “We will take billions, you stay simple” \n29:24 The third thing. Low income can be controlled. \n31:42 Jason’s Story Time: The Org Steals Retirement \n33:40 “My Mother Told Me” \n34:39 “One more thing…” - Columbo\n\nhttps://ibsaproperty.com\nhttps://www.brownstoner.com/history/jehovahs-witnesses-history-brooklyn-properties-selling/\nhttps://www.dailymail.co.uk/news/article-3358416/Jehovah-s-Witnesses-set-make-1billion-selling-iconic-New-York-City-Watchtower-headquarters.html\nhttps://www.recordonline.com/story/news/2015/03/07/watchtower-s-growth-strains-town/35039425007/\n\nJehovah\u0027s Witnesses poverty, Governing Body control, JW financial exploitation, Real estate empire JW, JW free labor, High control religious group, Jehovah\u0027s Witnesses education discouragement, Financial dependence in cults, Ex-Jehovah\u0027s Witness stories, Breaking free from JW, JW personal accounts, Cult manipulation tactics, JW labor exploitation, Financial independence ex-JW, Jehovah\u0027s Witnesses real estate profits.",
      "release": "2024-06-21T14:00:06Z",
      "duration": "00:37:51",
      "explicit": false,
      "youTubeId": "tR-ANJt5Onw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tR-ANJt5Onw"
      }
    },
    {
      "id": "dc1f217e-b8a5-4ec1-bf0a-52d5668b1ddf",
      "title": "Dangerous Preaching: The Hidden Risks of JW Door-to-Door",
      "description": "In this episode of DiffiCULT Childhood, we uncover the shocking dangers Jehovah\u0027s Witnesses face while preaching door-to-door. From threats and assaults to even worse scenarios, the risks are real and often ignored by the Governing Body. \n\nDespite their outward concern, the leadership fails to protect or inform JW\u0027s of the dangers they face. Join us as we explore these harsh realities by discussing our personal experiences share news stories. Don\u0027t miss this eye-opening discussion that sheds light on the hidden perils of JW preaching.\n\n00:00 Intro\n06:00 Falon’s story of an elderly JW couple assaulted while preaching \n07:45 Jason’s story of a young pioneer woman’s demise from preaching\n11:45 Falon and Jason going to doors as kids\n13:21 The News: Dangers While Preaching\n22:42 Trauma While Preaching Used to Governing Body’s Advantage\n25:01 Falon’s Pioneering Experiences: Guns ’n Rottweilers \n30:11 Jason’s Deliverance Story\n31:50 Door-to-door may discontinue. We hope so.\n\nhttps://www.wrex.com/news/teenager-charged-with-murder-after-shooting-rockford-man-volunteering-for-jehovahs-witnesses/article_d7d17024-abc2-11ed-9ccd-43a49100aada.html\nhttps://www.bbc.com/news/world-africa-68413185\nhttps://www.theguardian.com/world/2002/aug/22/alqaida.terrorism\nhttps://newscentral.africa/nigeria-nine-jehovah-witness-members-kidnapped-in-kogi/\n\n#jw #exjw #JehovahsWitnesses #JWExposed #CultSurvivor #DoorToDoorPreaching #HighControlGroup #JWPreaching #CultAwareness #ReligiousTrauma #ExposingTheTruth #GoverningBody #JWActivism #DiffiCULTChildhood",
      "release": "2024-06-16T03:30:06Z",
      "duration": "00:32:18",
      "explicit": false,
      "youTubeId": "uPRzM3Lmo2w",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uPRzM3Lmo2w"
      }
    },
    {
      "id": "33220c96-a1d1-494a-8304-d0e58f4191af",
      "title": "How Many Predators are Hiding in the JW Organization?",
      "description": "In this unsettling episode of DiffiCULT Childhood, Jason and Falon tackle a deeply troubling issue within the Jehovah\u0027s Witness organization: the systemic problem of child abuse. With a careful analysis of expert research and shocking statistics, they break down the numbers to reveal just how many child predators may be lurking within the JW community.\n\nDrawing from personal experiences and stories shared by brave survivors, we expose the organizational failings that enable such abuse to persist. They also delve into the mechanisms of silence and cover-up that have long shielded perpetrators from accountability.\n\nJoin us for a compelling and eye-opening discussion that sheds light on the dark realities faced by countless children and calls for urgent action and change. This episode is a must-listen for anyone seeking to understand the depth of this crisis and advocate for the protection of vulnerable individuals within high-control groups.\n\n\n00:00 It’s so much worse than we thought\n03:44 Mormons\n08:21 Pretending it’s not a problem\n09:22 Expert Research (full articles in the description)\n12:30 Predator Numbers\n16:40 Story time: Elder negligence in 2011\n21:09 It’s easy to gain trust in the JW ORG\n25:00 JW’s give SO MANY opportunities to offend\n27:50 Story time: Falon alone with and Elder \n31:25 Jason’s dad on a CSA Judicial Committee \n34:00 All the tools\n35:08 JW leaders don’t care about children (proof) ARC\n38:00 Why JW’s actually cover up CSA\n39:55 The ORG hides info from it’s own Elders\n44:50 Good men are elders. That doesn’t mean it’s NOT being covered up.\n47:56 No support for CSA Survivors \n50:15 Protect your children. Please leave now. \n\nhttps://www.bbc.com/news/magazine-28526106\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC8848059/\nhttps://jws-library.one/?list=publications\u0026category=manual\u0026title=Shepherd\u002Bthe\u002BFlock\u002Bof\u002BGod\nhttps://www.childabuseroyalcommission.gov.au\nhttps://religionnews.com/2023/05/26/catholic-church-in-california-grapples-with-more-than-3000-lawsuits-alleging-child-sex-abuse/\nhttps://www.usccb.org/sites/default/files/issues-and-action/child-and-youth-protection/upload/The-Nature-and-Scope-of-Sexual-Abuse-of-Minors-by-Catholic-Priests-and-Deacons-in-the-United-States-1950-2002.pdf\nhttps://www.jw.org/en/gov-resources/global-information-brochures/packet-jw-scripturally-based-position-child-protection/",
      "release": "2024-06-09T15:00:06Z",
      "duration": "00:54:16",
      "explicit": false,
      "youTubeId": "nZ96KkE9E0g",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nZ96KkE9E0g"
      }
    },
    {
      "id": "658636be-2fef-459c-af02-f3d3f71881a7",
      "title": "Are Jehovah\u0027s Witnesses a High-Control Cult? AI Reveals the Shocking Truth | JW Leadership Exposed",
      "description": "🛑 🛑 [Subscribe to our channel](https://www.youtube.com/channel/DIffiCULTchildhood) for more episodes!\nIn this eye-opening episode, Falon and Jason put AI to the test and ask a burning question: Are Jehovah\u0027s Witnesses a high-control cult? The result was more surprising than we expected! Join us as we delve into the intricacies of JW leadership, focusing on the Governing Body\u0027s claims of not being inspired by Jehovah God, contrasted with secret JW Elder Manual \u0022Shepherd the Flock of God\u0022 that tells local congregation leaders (Elders) that they ARE directly inspired. What gives?\n\nWe also share our favorite JW apostate activism channels that are making a difference. Don\u0027t miss this thought-provoking discussion that sheds light on the hidden dynamics within the Jehovah\u0027s Witness community.\n\n🛑 🛑 [Subscribe to our channel](https://www.youtube.com/channel/DIffiCULTchildhood) \n🔔 **Hit the bell icon** to get notified every time we upload a new video.\n👍 **Like** this video if you find it informative and share it with others who might benefit from discussion about this harmful organization\n\n00:00 Artificial Intelligence Tells Us About JW’s\n07:05 B.I.T.E Model Steven Hassan\n08:20 Will the Governing Body Use AI to Churn Out Writing?\n09:13 The Governing Body: ‘Elder’s Have a Power We Don’t’\n16:00 PIMO Elders: We Have a Favor To Ask. A Big One. exjwchildhood@gmail.com\n19:18 Storytime: Falon (a girl) Got Caught Touching the Elder Book \n24:20 Anthony Morris Returns Channel https://www.youtube.com/@AnthonyMorrisReturns/featured\n24:46 How Watchtower Takes from Africans https://www.youtube.com/@ExjwEmancipation/featured\n 28:08 And the Survey Says, How Many JW Men are “Inclined” Toward “Young Ones” \n \nhttps://www.instagram.com/difficult_childhood?igsh=MXFkYWJ0N3NvYXpndA%3D%3D\u0026utm_source=qr\n\nhttps://www.tiktok.com/@difficultchildhood?_t=8mp6wjJYsgd\u0026_r=1\n\n#CultAwareness #JehovahsWitnesses #CultSurvivor #JWExposed #HighControlGroup #ExJWCommunity #JWTruth #ReligiousFreedom #AIAnalysis #GoverningBody #JWLeadership #Elders #ExCultMember #CriticalThinking #JWConfessions #BreakingFree #Cults #ReligiousTrauma #JWStories #CultRecovery #JehovahsWitnesses #HighControlCult #ExJW #ApostateActivism #CultAwareness #GoverningBody #JWElders #JWLeadership #AIReveals\u0022",
      "release": "2024-06-01T13:00:06Z",
      "duration": "00:30:42",
      "explicit": false,
      "youTubeId": "QwiCZua6ORg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QwiCZua6ORg"
      }
    },
    {
      "id": "23e80b53-82fc-436b-bfe4-0dddfa1df7a6",
      "title": "Clip: Pursue Your Dreams Outside the JW Cult",
      "description": "Leaving the Jehovah\u0027s Witness organization was the first step to reclaiming her life and dreams. Discover how stepping away from the high-control JW environment opened up a world of possibilities and brought true happiness. Ready to break free and pursue your dreams? Watch now see how life can be brighter on the other side! Here is a clip from our latest episode:\n\n#ExJW #JehovahsWitnesses #CultSurvivor #LifeAfterCults #BreakingFree #PursueYourDreams #FindYourHappiness #FreedomJourney #LifeAfterReligion #HappyLife",
      "release": "2024-05-30T20:36:14Z",
      "duration": "00:02:37",
      "explicit": false,
      "youTubeId": "H29SHK83eZE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=H29SHK83eZE"
      }
    },
    {
      "id": "d88ec03e-f2e9-4976-83fa-99ed176f8dd0",
      "title": "Exposed: The Deceptive \u0027Return to Jehovah\u0027 Brochure by the Governing Body",
      "description": "This week we break down the JW leader\u0027s perhaps MOST deceptive product. It\u0027s just so sneaky and disgusting. Falon shares stories about her experience with judicial meetings. And Jason shares some actual good news. \n\nThe Jehovah\u0027s Witnesses aren\u0027t special. It\u0027s just another high control cult with leaders getting off on controlling people and ruining lives. And here is the proof, written and signed by the Governing Body themselves. \n\n00:00 Stay Out of Shawshank \n00:24 TikTok Comments are a Cry for Help\n02:30 Turn Back Now! Apostates! \n04:45 The Governing Body Wrote You a Letter!\n07:39 Return to the Six Fingered Man\n09:52 The ONLY Three Reasons To Return\n13:57 June Left Because There Was No Support\n24:44 I’ve got hurt feelings.\n29:30 Parent of a CSA Victim? Must Forgive if There Aren’t Two Witnesses. \n32:15 GUILT. \n36:27 Falon’s Story with the Elders\n44:53 Governing Body Lies About What Returning is Like\n54:47 One last thing…the best thing. Really.\nhttps://www.youtube.com/watch?v=F_ungB2Vqq4\nhttps://www.instagram.com/difficult_childhood\nhttps://www.tiktok.com/@difficultchildhood?_t=8meJFyF4n3W\u0026_r=1\n\n\n#jw #jworg #jwfriends #jwfamily #exjw #exjwsthink #exjwsupport #jehovahswitnesses #religion #religioustrauma #activism #podcast #JWborg #criticalthinking #atheist #apostate #bestlifeever #returntojehovah #Christian #atheist",
      "release": "2024-05-25T12:00:07Z",
      "duration": "00:57:24",
      "explicit": false,
      "youTubeId": "WUgszhfsvN8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WUgszhfsvN8"
      }
    },
    {
      "id": "3b3ad82e-ee0e-4678-b1df-5de63e963199",
      "title": "The EXTRA Arrogance of the Governing Body",
      "description": "OK maybe you all already knew about this, but looking at my JW Watchtower collection of books today made me realize the GB are even MORE pompous, presumptuous, and arrogant than I previously thought. \n\nPlus a preview of our next full episode: The brochure full of lies and BS that the Governing Body wrote to try to pull people back under their control.\n\nAlso I\u0027m unclear on why I look like a drawing. To multitask I tried to edit this on my iPhone\u0027s CapCut app while on a treadmill. lol. Is it a filter? Am I in the Take On Me video from the 80\u0027s? Ah-ha. I might be. \n\nJehovah\u0027s Witnesses Christian religious trauma high control cult atheist exJW apostate Best life ever",
      "release": "2024-05-21T04:43:35Z",
      "duration": "00:03:00",
      "explicit": false,
      "youTubeId": "nj0lYH4wzJk",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nj0lYH4wzJk"
      }
    },
    {
      "id": "3e88ddbe-d54e-4134-89e8-23bad94144fd",
      "title": "Remembering Awful JW \u0022Sing Kingdom Songs\u0022 from the 90\u0027s",
      "description": "Story time as we recall the partially a cappella \u0022Kingdom Songs\u0022 CD the Governing Body released AND PERFORMED on from the 90\u0027s. Yikes! See the full video on our channel. Jehovah\u0027s Witnesses Brooklyn Bethel LGBTQ\u002B Regular Pioneer Best Life Ever High Control Group Morning Worship Daily Text",
      "release": "2024-05-19T01:41:38Z",
      "duration": "00:00:42",
      "explicit": false,
      "youTubeId": "j3twjI0k45w",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j3twjI0k45w"
      }
    },
    {
      "id": "a29808b4-2694-47a8-b8fe-cae2143b323e",
      "title": "From Bethel to Freedom: A Gay Ex-JW Journey",
      "description": "Join us in this eye-opening episode as we hear the untold story of a gay man breaking free from the judgmental shackles of the Jehovah\u0027s Witness cult. Discover the struggles, triumphs, and raw emotions as ex-JW Mike shares how he navigated the Witness world that condemned his very nature. From pioneering to working at the JW world headquarters, he revisits his biggest realizations that transformed forbidden desires to newfound freedom, love, and happiness. \n\nTune in for a candid discussion on love, acceptance, and the power of self-discovery.\n\n00:00 Intro\n00:30 My Book of Bible Stories Carnage\n02:00 A Cappella Sing Kingdom Songs from 1996\n03:22 Going to Bethel in 2000\n05:26 JW Headquarters: Expectation vs Reality\n16:37 Lösch (Governing Body) Doesn’t Let You Eat\n19:35 Leaving Bethel\n21:49 JW’s Treat Single People Like Children\n 23:12 Living With Guilt \n27:39 Watchtower’s Stance on Gay People \n29:13 Leaving the Cult of Jehovah’s Witnesses \n33:00 Dad’s Response to Coming Out\n39:55 V for Vendetta\n40:40 Would I Still Be Me  in the New System?\n43:09 Pain of Those Who Remain in the Org\n44:17 Advice for Anyone Wanting and Waiting to Leave\nhttps://www.jwfacts.com/watchtower/homosexuality-gay-jehovahs-witnesses.php\n\nJehovah\u0027s Witnesses Brooklyn Bethel LGBTQ\u002B Regular Pioneer Best Life Ever High Control Group Morning Worship Daily Text",
      "release": "2024-05-14T12:00:06Z",
      "duration": "00:46:25",
      "explicit": false,
      "youTubeId": "e2dq1Ep--8I",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e2dq1Ep--8I"
      }
    },
    {
      "id": "8586aac9-d4b9-46b2-934c-db1d6dcdda6c",
      "title": "Clip: JW Mother\u0027s Wedding Day Lifeline",
      "description": "This is a short from our latest show. Click here for the full episode.\nhttps://www.youtube.com/watch?v=q9JofTQzAdo\u0026t=254s\n\n#jw #jworg #jwfriends #jwfamily #exjw #exjwsthink #exjwsupport #jehovahswitnesses #religion #religioustrauma #activism #podcast #JWborg #criticalthinking #atheist #apostate #bestlifeever #religion #JWdating #storytime  #JWwedding",
      "release": "2024-05-13T02:16:24Z",
      "duration": "00:02:37",
      "explicit": false,
      "youTubeId": "a8orltCN5ho",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=a8orltCN5ho"
      }
    },
    {
      "id": "a9cbf88e-d8e1-4dc8-b5b9-ca6448e021ac",
      "title": "JW Dating Stories Part 2. Sex, Control, and Judicial Meetings",
      "description": "Get ready to uncover the shocking truth about dating and sex in the Jehovah\u0027s Witness community! From Governing Body control tactics to scandalous (church) elder involvement, we spill all the tea on JW dating. Find out how JW dating rules breed sexism and learn our top tips for breaking free from the Governing Body\u0027s grip!\n\nJoin us for juicy personal stories and sometimes embarrassing revelations about dating inside and outside the JW organization. Whether you\u0027re a curious outsider or a seasoned JW, this episode has some surprises.  🎧🔥\n\n----Contents of this video----------\n0:00 Dating Part 2\n00:16 Falon’s Wedding Day Story\n02:52 Past the Point of No Return \n03:18 Jason is Sexist \n05:21 Falon Loves Important “Ships”\n06:55 Chaperone Stories\n15:01 Governing Body Dating Rules are Hypocritical \n18:12 Why Governing Body NEEDS to Control Dating Couples\n23:25 Dating Story: Jason \u0026 Rebecca Get into “Trouble”\n26:40 Dating Story: Falon Dates a “Worldly” Man\n31:06 Talk Therapy and Dating \n31:36 Emily is Awesome. Fact!\n\n\n#jw #jworg #jwfriends #jwfamily #exjw #exjwsthink #exjwsupport #jehovahswitnesses #religion #religioustrauma #activism #podcast #JWborg #criticalthinking #atheist #apostate #bestlifeever #religion #JWdating #storytime  #exjwgay",
      "release": "2024-05-11T02:28:05Z",
      "duration": "00:32:28",
      "explicit": false,
      "youTubeId": "q9JofTQzAdo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=q9JofTQzAdo"
      }
    },
    {
      "id": "e009ad2e-e68f-4db9-8d88-094aa4033e81",
      "title": "Inside JW Dating: Mistakes We Made Plus Weird Rules and Red Flags",
      "description": "In this episode of our YouTube podcast, we delve into the intricate rules and regulations surrounding dating and sex within Jehovah\u0027s Witness culture. Join us as we explore how these strict guidelines not only make dating a daunting task but also contribute to the development of socially stunted individuals and the formation of potentially abusive relationships.\n\nWe discuss the unique challenges faced by Jehovah\u0027s Witnesses in the dating world, from the pressure to conform to strict standards to the difficulty of identifying and addressing red flags in potential partners. Our conversation sheds light on how these rules can lead to individuals overlooking warning signs and entering into unhealthy relationships.\n\nThrough insightful discussions and real-life examples, we uncover the impact of these dating rules on personal growth, emotional well-being, and relationship dynamics. Whether you\u0027re a current or former Jehovah\u0027s Witness or simply curious about the complexities of dating within this community, this episode offers valuable insights and thought-provoking perspectives. Join us as we navigate the nuances of dating rules in Jehovah\u0027s Witness culture and their broader societal implications.\n\n----Contents of this video----------\n00:00 JW’s Don’t Know How to Date\n03:00 Rush to Get Married \n05:01 Red Flags Ignored\n09:18 Why Some JW Marriages Work\n11:31 JW Disadvantages in Relationships\n13:32 Sex and the Single JW\n15:30 JW Parents Block Kids from Learning Social Skills\n18:50 Story time: What Sex Ed Was for a JW Kid\n21:47 Nothing In Common? Thats OK. You’re Both JW’s!\n23:36 If You Break Up, You Could Get in Trouble with the Elders\n25:41 Next Time on DC Special Guest \u0026 Bethelite Mike Gonzales\n\n\n#jw #jworg #jwfriends #jwfamily #exjw #exjwsthink #exjwsupport #jehovahswitnesses #religion #religioustrauma #activism #podcast #JWborg #criticalthinking #atheist #apostate #bestlifeever #religion #JWdating #storytime",
      "release": "2024-05-05T23:10:43Z",
      "duration": "00:26:44",
      "explicit": false,
      "youTubeId": "1eiz-sGd9lI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1eiz-sGd9lI"
      }
    },
    {
      "id": "1a75370e-a758-4ab9-9eed-6c0ee768cd16",
      "title": "Viewer Mail! #storytime  #exjw #jworg #jehovahswitnesses #podcast #atheist #christian",
      "description": "#jw #jworg #jwfriends #jwfamily #exjw #exjwsthink #exjwsupport #jehovahswitnesses #religion #religioustrauma #activism #podcast #JWborg #criticalthinking #atheist #apostate #bestlifeever #exjwpodcast #podcast #exjwfriends #worldly",
      "release": "2024-04-23T17:57:19Z",
      "duration": "00:00:19",
      "explicit": false,
      "youTubeId": "bGHB6b129ok",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bGHB6b129ok"
      }
    },
    {
      "id": "bbe25eb3-1d2d-4800-9693-da107207a514",
      "title": "Outside Watchtower—Finding Self and Building Friendships",
      "description": "In this episode, we take apart the challenging yet empowering journey of making friends after leaving the Jehovah’s Witness cult. \n\nJoin us as we candidly discuss our experiences, sharing insights into what strategies helped us make new friends and what pitfalls to avoid for better mental health. From navigating social circles to overcoming cult-induced social anxieties, this episode is a guide to forging genuine connections and embracing life outside the Watchtower walls. And it\u0027s so much better here. \n\nHere\u0027s the article we talked about. http://exjehovahswitnessportland.blogspot.com/2014/01/making-friends-in-post-witness-life.html\n\nOh yeah and Taylor Swift lyrics in her new album \u0022The Tortured Poets Department,\u0022 say she saw a man in a Jehovah\u0027s Witness suit. But we don\u0027t talk about that because who cares? \n\n#jw #jworg #jwfriends #jwfamily #exjw #exjwsthink #exjwsupport #jehovahswitnesses #religion #religioustrauma #activism #podcast #JWborg #criticalthinking #atheist #apostate #bestlifeever #exjwpodcast #podcast #exjwfriends #worldly #jehovahswitnesssuit #governingbody #watchtower #CultRecovery\n#FreedomAfterJW #SelfDiscovery\n#FriendshipJourney #BreakingFree\n#NewBeginnings\n#CultSurvivor  #AuthenticConnections",
      "release": "2024-04-22T22:40:46Z",
      "duration": "00:33:50",
      "explicit": false,
      "youTubeId": "ppJ5aJFiNYI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ppJ5aJFiNYI"
      }
    },
    {
      "id": "885f7dd2-4f94-40fd-ad2f-c94c64f5b9ba",
      "title": "Clip: \u0022What Woke Me Up\u0022",
      "description": "In this short Rebecca talks about how research in Watchtower\u0027s own publications helped wake her up from the high control control cult of Jehovah\u0027s Witnesses. \n\n#jw #jworg #jwfriends #jwfamily #exjw #exjwsthink #exjwsupport #jehovahswitnesses #religion #religioustrauma #activism #podcast #JWborg #criticalthinking #atheist #apostate #bestlifeever",
      "release": "2024-04-11T16:54:46Z",
      "duration": "00:01:59",
      "explicit": false,
      "youTubeId": "slqzUPKsPAY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=slqzUPKsPAY"
      }
    },
    {
      "id": "43284cfb-9edf-4d65-8dab-37a1d2d3135b",
      "title": "Inside the Tactics: Ex-Wife \u0026 I Discuss Jehovah\u0027s Witness Strategies",
      "description": "Join us this week as my guest co-host Rebecca and I dive into the  arguments used by Jehovah\u0027s Witnesses to bring back former members. We\u0027ll deconstruct a letter I received from my uncle, an elder of 30 years, who genuinely believes he\u0027s acting in my best interests. However, after politely addressing the flaws in his reasoning, he chose to shut down and shun me once more. Together, we\u0027ll unravel the key points of his letter and explore the dynamics of these and other PIMI JW family interactions.\n\n#jw #jworg #jwfriends #jwfamily #exjw #exjwsthink #exjwsupport #jehovahswitnesses #religion #religioustrauma #activism #podcast #JWborg #criticalthinking #atheist #apostate #bestlifeever",
      "release": "2024-04-08T18:32:07Z",
      "duration": "00:24:34",
      "explicit": false,
      "youTubeId": "HBJULk1qXW4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HBJULk1qXW4"
      }
    },
    {
      "id": "682b268c-5023-4757-93de-3b46d45da9b5",
      "title": "Discovering Positives Growing Up as Jehovah\u0027s Witnesses?",
      "description": "This week, we delve into the question: Was there anything positive about our upbringing as Jehovah\u0027s Witnesses? Additionally, tune in as Jason\u0027s parents discover our apostate activism. \n\nLeaving a high-control group can be incredibly challenging. If you\u0027re struggling with suicidal thoughts or extreme distress, please reach out for help. In the United States, call 988 or check local listings for support services. Remember, you are not alone, and help is available.\n\n#jw #jworg #jwfriends #jwfamily #jwbrasil #jwlove #jwusa #jehovahswitnesses #jwbrazil #jwmexico #jwlife #jwbrotherhood #jwworld #jwonly #jwgirl #inspirational #jwbrothers #jwsisters #witnesses #jwconvention #jwspain #jwhappy #jworganization #jwargentina #jehovah #testigosdejehova #bestlifeever #jwgermany #jwpreaching #jwboy #exjw #podcast #religion",
      "release": "2024-04-01T17:45:02Z",
      "duration": "00:46:07",
      "explicit": false,
      "youTubeId": "uhH85_gsJrI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uhH85_gsJrI"
      }
    },
    {
      "id": "82ebac6a-cfc9-494b-873a-dc632b44e2ce",
      "title": "JW Governing Body Update Response Part 2",
      "description": "This time I (Falon) separately respond to the governing body update # 2 2024 AND talk about the Governing Body of Jehovah\u0027s Witnesses don\u0027t represent Jesus Christ\u0027s model of forgiveness. We did separate videos because Jason and I have VERY different views when it comes to faith. Thanks for watching, friends! \n\n\nThis time the unapologetic Mark Sanderson acts as though he\u0027s being benevolent by changing the JW policy. But the real reasons for changing the unbiblical rules are clear-- they\u0027re hemorrhaging members. I talk about how the arrogance of the govering body has harmed my family who are still in the organization. #televanjelism #exjw #jehovahswitnesses #religion #podcast #apostate #highcontrol #cult #activism #religioustrauma #watchtower #jworg #jw #christian",
      "release": "2024-03-21T01:08:11Z",
      "duration": "00:07:18",
      "explicit": false,
      "youTubeId": "Cqr8FZ5uATg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Cqr8FZ5uATg"
      }
    },
    {
      "id": "3bc4218a-2d5f-4683-b262-973a81cf5238",
      "title": "JW Governing Body Update Response Part 1",
      "description": "This time I separately respond to the governing body update # 2 2024 AND talk about why my brother would NOT have been disfellowshipped under the \u0022new rules.\u0022 Falon\u0027s response is coming up next!\n\n\nThis time the unapologetic Mark Sanderson acts as though he\u0027s being benevolent by changing the JW policy. But the real reasons for changing the unbiblical rules are clear-- they\u0027re hemorrhaging members. I talk about how the arrogance of the govering body has harmed my family who are still in the organization. #televanjelism #exjw #jehovahswitnesses #religion #podcast #apostate #highcontrol #cult #activism #religioustrauma #watchtower #jworg #jw #criticalthinking",
      "release": "2024-03-19T22:32:03Z",
      "duration": "00:11:58",
      "explicit": false,
      "youTubeId": "KcJdZWC47ak",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KcJdZWC47ak"
      }
    },
    {
      "id": "f5b19e4a-9e27-47cb-a039-ac2e9ba6b185",
      "title": "Interview: \u0022I\u0027m so lucky...I got out with my family.\u0022",
      "description": "First interview. Dave joins us and talks about getting out of the JW cult with his brilliant wife and young child. He also talks about loss and dealing with extended JW family. Life can be hard but it\u0027s so much better outside. \n\nARC Australian Royal commission Jehovah\u0027s Witnesses high control cult apostate religious trauma therapy podcast",
      "release": "2024-03-14T23:37:55Z",
      "duration": "01:09:25",
      "explicit": false,
      "youTubeId": "vcq3qiAGUjw",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vcq3qiAGUjw"
      }
    },
    {
      "id": "41338ef5-0aab-4fed-8f07-f01cfb64650a",
      "title": "Forgotten JW Changes #podcast #jehovahswitnesses #exjw #religion",
      "description": "@DiffiCULTChildhood",
      "release": "2024-03-05T02:22:36Z",
      "duration": "00:00:56",
      "explicit": false,
      "youTubeId": "PuPvrl5E870",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PuPvrl5E870"
      }
    },
    {
      "id": "a2fa3c37-37be-439c-a910-eb5805daf2fe",
      "title": "\u0022Accepting organ transplants = Cannibalism\u0022 and other Old Jehovah\u0027s Witness Dogma",
      "description": "Note: It comes to our attention that we got something WRONG: They used to have convention attendees buy tickets for use at the food service counters. But after March 1990 the food was made available without buying tickets. For the next two conventions the food was \u0022free\u0022 with a suggested donation. Good job guys for keeping us honest! Thanks for all the comments!\n\nThis week, we talk about seven changes that have made the religion of JW\u0027s unrecognizable from a generation ago. From punishing members as cannibals if they got an organ transplant, to the other deity they used to worship aside from God. We\u0027re sure at least ONE of these seven changes will surprise you. \n\nSearch Words; exJW Former JW Apostate Steven Hassan The B.I.T.E. model  Pioneer Former Ministerial Servant Tony Morris Stephen Lett Watchtower Atheist Christian Kingdom Halls mental health New Light Conventions Athiest Christian Gage Fleegle Blood Transfusions Fractions Baptism JW.borg",
      "release": "2024-03-02T14:00:23Z",
      "duration": "00:42:44",
      "explicit": false,
      "youTubeId": "dSirfZYr42E",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dSirfZYr42E"
      }
    },
    {
      "id": "a8fa1aad-0dc1-4c1e-ad7d-12883b007dbd",
      "title": "Next Time on Difficult Childhood  #exjw #jehovahswitnesses",
      "release": "2024-02-06T23:58:51Z",
      "duration": "00:00:59",
      "explicit": false,
      "youTubeId": "22oi1sdKID4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=22oi1sdKID4"
      }
    },
    {
      "id": "90ea2dcb-1dc4-4aae-a26c-11af6edd94c8",
      "title": "JW Forbidden Movies",
      "description": "DC Shorts Movies We Couldn\u0027t Watch #indianajones  #exjwsthink #exJW  #duet",
      "release": "2024-01-05T21:08:26Z",
      "duration": "00:00:45",
      "explicit": false,
      "youTubeId": "mZCuduNbsXE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mZCuduNbsXE"
      }
    },
    {
      "id": "f0265207-d304-48bf-b60d-b7cf9d987db9",
      "title": "JW\u0027s \u0026 the Forbidden Movies of Childhood",
      "description": "This time we talk about the random TV rules of JW childhood. Which movies and shows we couldn\u0027t watch. Star Wars was violent and religious but it was cool for some reason. Why the Smurfs were bad but the Disney witches were fine. \n\nPlus we open with the absolute arrogance of the Governing Body and the JW beard rules. \n\nSearch Words; exJW\u0027s Former JW Apostate Pioneer Former Ministerial Servant Tony Morris Stephen Lett Watchtower Atheist Christian Kingdom Halls mental health Australian Royal Commission CAS Borg organization don\u0027t celebrate holidays Christmas birthdays women\u0027s rights \u0022sexism in Jehovah\u0027s Witnesses\u0022 Governing Body Harmful religion preaching work Lloyd Evans JW.org fading JWfacts Live Forever Book New World Translation Young People Ask Field Service AltWorldly JW Thoughts exjw CSA Blood transfusions 80\u0027s",
      "release": "2024-01-05T06:39:32Z",
      "duration": "00:45:29",
      "explicit": false,
      "youTubeId": "GHs79-8bKMk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GHs79-8bKMk"
      }
    },
    {
      "id": "25b57d8d-e170-4186-b468-0d72f20a36fd",
      "title": "Mistakes We Made While Leaving Jehovah\u0027s Witnesses",
      "description": "We spill the tea all over ourselves. Some of the things we wish we\u0027d done differently when leaving the cult. This is an emotional one, bruh. \n\nhttps://www.instagram.com/jasonh_nw/\n\nA leaving checklist:\nhttps://www.reddit.com/r/exjw/comments/16zwhp2/the_jehovahs_witness_waking_up_checklist_october/?share_id=NOa_xtA4M4aNGVLBjLDxE\u0026utm_medium=ios_app\u0026utm_name=iossmf\u0026utm_source=share\u0026utm_term=4\n\nSearch Words; exJW\u0027s Former JW Apostate Pioneer Former Ministerial Servant Tony Morris Stephen Lett Watchtower Atheist Christian Kingdom Halls mental health Australian Royal Commission CAS Borg organization don\u0027t celebrate holidays Christmas birthdays women\u0027s rights \u0022sexism in Jehovah\u0027s Witnesses\u0022 Governing Body Harmful religion preaching work Lloyd Evans JW.org fading JWfacts Live Forever Book New World Translation Young People Ask Field Service AltWorldly JW Thoughts exjw CSA Blood transfusions",
      "release": "2023-12-15T06:53:52Z",
      "duration": "00:45:18",
      "explicit": false,
      "youTubeId": "Dd_XNLR6Hoc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Dd_XNLR6Hoc"
      }
    },
    {
      "id": "e0014acc-defd-444d-9754-59e5a73d5cc1",
      "title": "Clip: Our \u0022Fave\u0022 My Book Of Bible Stories Victim Blaming",
      "description": "Look at what you just made me do, Dinah. \n\nIn this short, we talk about what Jehovah\u0027s Witnesses teach children about consent, and how girls are responsible for boy\u0027s behavior. \n\nSearch Words; exJW\u0027s Former JW Apostate Steven Hassan The B.I.T.E. model  Pioneer Former Ministerial Servant Tony Morris Stephen Lett Watchtower Atheist Christian Kingdom Halls mental health Australian Royal Commission CAS Borg organization don\u0027t celebrate holidays Christmas birthdays women\u0027s rights \u0022sexism in Jehovah\u0027s Witnesses\u0022 Governing Body Harmful religion preaching work.",
      "release": "2023-12-03T23:50:19Z",
      "duration": "00:01:09",
      "explicit": false,
      "youTubeId": "u9JhtwKantU",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u9JhtwKantU"
      }
    },
    {
      "id": "f7b85071-7751-4e7c-8c7c-47991026135c",
      "title": "Vintage Violence that Jehovah\u0027s Witnesses Made for Kids!",
      "description": "This Friday at DC, it\u0027s Story Time. My Book of Bible Stories! Falon picks two of her \u0022favorite\u0022 tales of violence that her parents and JW\u0027s everywhere used to read to kids nightly! This time we take apart \u0022Dinah Get\u0027s Into Trouble\u0022 and \u0022Two Brave Women\u0022. Each of these are stories of murder, sexual assault, sexism, bigotry, and victim blaming. They even pressured JW kids to distribute this book of horrors to other children at school. \n\nAbout DiffiCULT Childhood:\nTwo friends discuss the unique experience of growing up inside the JW org and the challenging but ultimately REWARDING process of adjusting to life outside the org. \n\n\nSearch Words; exJW\u0027s Former JW Apostate Steven Hassan The B.I.T.E. model  Pioneer Former Ministerial Servant Tony Morris Stephen Lett Watchtower Atheist Christian Kingdom Halls mental health Australian Royal Commission CAS Borg organization don\u0027t celebrate holidays Christmas birthdays women\u0027s rights \u0022sexism in Jehovah\u0027s Witnesses\u0022 Governing Body Harmful religion preaching work.",
      "release": "2023-12-01T21:21:56Z",
      "duration": "00:29:08",
      "explicit": false,
      "youTubeId": "vb5IPaviH-I",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vb5IPaviH-I"
      }
    },
    {
      "id": "f0ba021b-2b5d-4aab-b1d9-e82b6743d200",
      "title": "Clip: Returning to the Kingdom Hall felt...",
      "description": "In this clip from episode three, we share pics and talk about how it felt to go back to the Kingdom Hall months after we knew it wasn\u0027t the \u0022truth.\u0022 \n\nJehovah\u0027s Witnesses exjw waking up meetings watchtower public talk",
      "release": "2023-11-19T02:30:16Z",
      "duration": "00:01:34",
      "explicit": false,
      "youTubeId": "GjWCUyLcAzI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GjWCUyLcAzI"
      }
    },
    {
      "id": "57196625-68ed-4801-b647-a77248eea587",
      "title": "Is CULT the right word for Jehovah\u0027s Witnesses?",
      "description": "Two friends discuss the unique experience of growing up inside the JW org and the challenging but ultimately REWARDING process of adjusting to life outside the org. \n\nThis time, is CULT the right word? Let\u0027s be fair-- the word cult means different things to different people. Where do Jehovah\u0027s Witnesses land when it comes to high control groups? \n\nLinks from the video: \n\nOur video is friends talking about our experience. If you\u0027re looking for an excellent video breaking down the marks of a cult in the JW context, this channel does just that. https://www.youtube.com/watch?v=4pSBLcFjr0s\n\nSteven Hassan’s video on determining if you’re in a high-control group.\nhttps://youtu.be/JzSwZpHDAaU?si=S0c_p3tkKG2z0tal\n\nJust a FEW examples of the New World Translation being altered to support JW teachings. \nhttps://www.youtube.com/watch?v=hlhaf5k1MWA\n\nSearch Words; exJW\u0027s Former JW Apostate Steven Hassan The B.I.T.E. model  Pioneer Former Ministerial Servant Tony Morris Stephen Lett Watchtower Atheist Christian Kingdom Halls mental health",
      "release": "2023-11-18T05:13:42Z",
      "duration": "00:57:08",
      "explicit": false,
      "youTubeId": "LuSFx5jm-N8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LuSFx5jm-N8"
      }
    },
    {
      "id": "12d1aa75-8599-4fe1-8501-1a5e4937d07c",
      "title": "New Light, Public School \u0026 REO Speedwagon",
      "description": "We talk about our childhood being JW\u0027s in the 80\u0027s onward, and why people still in the religion are willing to put up with so many failed predictions of the Governing Body of Jehovah\u0027s Witnesses. \n\n#exjw #apostate #jehovahswitnesses \n\nAlso as a high control religion here are some of the things the cult controls in a member\u0027s daily life. \n\nWhat kind of education you get\n\nThe sort of home you should buy\n\nActively directing members to NOT buy a home while the ORG invests heavily in real estate\n\nEvery aspect of your life should be “SIMPLIFIED”\n\nThe sort of car you should drive\n\nHow many doors that car should have\n\nYour occupation/career\n\nThe type of person you can love\n\nWhat type of physical relationship you can have with your partner\n\nThe type of physical relationship you can have with \u0027yourself\u0027\n\nHow you dress (and no, we don\u0027t mean just basic modesty)\n\nWhat piercings you can get\n\nHow you style your hair\n\nWhat facial hair you grow\n\nWhat tattoos you can get (NONE)\n\nWhat occasions you may celebrate \n\nThe kind of vacations you take\n\nWhat you do on your weekends\n\nWhat you read\n\nWhat movies and TV shows you can watch \n\nWhat kind of music you can listen to\n\nWhat games you play\n\nYour social media choices\n\nHow you discipline your children\n\nWhich congregation you’re “assigned” to\n\nWho your friends are\n\nTaking EVERY opportunity to preach even at school or work\n….or on a plane\n…or a bus\n…or in a doctor’s office\n…or in a coffee shop\n…or on a hike\n…or at the beach\n…or when camping\n\nWhat words you use\n\nHow much free labor you provide maintaining the ORG’s real estate investments\n\nIf you’re too invested in physical fitness\n\nHow much alcohol you drink\n\nWhat kind of toys your kids have\n\nWhat you allow your kids to learn\n\nWhat you art you hang on your walls\n\nHow you decorate your home\n\nWhat kind of jokes you tell\n\nWhat sort of after school activities you participate in\n\nWhat sort of after work activities you participate in\n\nWhat sort of activities you participate in\n\nWhat sort of conversations you have\n\nHow often you comment at the Kingdom Hall meetings\n\nHow often you read the Bible\n\nHow often you pray\n\nThe words you use in prayer\n\nWhat things you say about the ORG \n\nWhat websites you look at\n\n(Inhales cuz this is a long one) If another JW who wronged you and after they have \nbeen “disciplined” for their “sin” by disfellowshipping or reproof, and then forgiven/\nreinstated, even if they sexually assaulted you, you have to forgive them and treat \nthem as any other JW.\n\nHow much of your money you give to the ORG\n\nWhat hobbies you choose (right—like you have time for hobbies)\n\nWho you invite to your home\n\nYour housekeeping practices \n\nWhat makes you angry\n\nWhat things you like\n\nWhat things you dislike\n\nWhat thoughts you have\n\nWhat medical choices you make for yourself or your family (Elders will show up at the hospital to “help” you make the right choices even if it means your death)",
      "release": "2023-10-25T11:00:08Z",
      "duration": "00:48:06",
      "explicit": false,
      "youTubeId": "JhGXFWCS9fo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JhGXFWCS9fo"
      }
    },
    {
      "id": "119ce630-a593-4565-9e73-727caa4e3c99",
      "title": "Mental Health and ex-JW\u0027s",
      "description": "We talk about how we found a fulfilling life after leaving the high control religion, Jehovah\u0027\u0027s Witnesses. \n For reference article google (sorry we need to wait for YouTube to post links) The mental health of Jehovah\u0027s Witnesses J Spencer",
      "release": "2023-10-13T05:11:37Z",
      "duration": "00:21:40",
      "explicit": false,
      "youTubeId": "4tMh8XXchgc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4tMh8XXchgc"
      }
    }
  ]
}