{
  "_ts": 0,
  "id": "a5414f77-0735-43b1-b67e-799496ab06cf",
  "name": "Different Spectrums Podcast",
  "spotifyId": "2WBfaw4R0GMZLWBT3u9t9a",
  "appleId": 1620802353,
  "youTubeChannelId": "UCIthgmuXV2bxcEPfXEYxqIw",
  "episodes": [
    {
      "id": "c1746c9f-e787-41a2-9679-b4b9df372e55",
      "title": "Tangled, Cult Recovery \u0026 Rebuilding Identity After Control",
      "description": "In this episode, we sit down with therapist @thespookytherapist  to unpack Disney’s Tangled—but this is more than a fairy tale. It’s a mirror for those healing from religious trauma, cult-like environments, and toxic family systems.\n\nWe explore what it means to break free from high-control groups, question everything you’ve been taught, and navigate the terrifying but liberating path of self-discovery. From “shelf-breaking” moments in college to metaphors like messy closets and broken jars, Easin shares her story and tools for recovery.\n\n🔹 Topics Covered in This Episode:\n\n• How Tangled mirrors the emotional abuse of cults and toxic families\n• “The Broken Shelf” concept — when your belief system starts to shatter\n• Leaving religion, purity culture, and reclaiming autonomy\n• How masking and people-pleasing show up in recovery\n• Why therapists use metaphors (and how they help neurodivergent folks heal)\n• The impact of parenting, birthwork, and therapy on personal identity\n\n💡 Key Takeaway: Healing from a cult or controlling environment isn’t just about leaving—it’s about rebuilding. You’ll likely question everything, lose people, and feel lost. But on the other side is freedom, joy, and a version of yourself that finally gets to exist.\n\n📌 Follow Us:\n📸 Instagram: @differentspectrumspodcast\n🎵 TikTok: @differentspectrumspod\n🐦 X (Twitter): @DiffSpectrums\n🎧 Spotify: Different Spectrums Podcast\n\n🔔 Like, Comment \u0026 Subscribe for more content on mental health, neurodiversity, and breaking generational cycles.\n\n#Tangled #CultRecovery #ReligiousTrauma #TherapistPodcast #NeurodivergentHealing #PurityCulture #MentalHealthAwareness #DifferentSpectrums #DisneyAnalysis",
      "release": "2025-04-07T13:01:05Z",
      "duration": "00:11:26",
      "explicit": false,
      "youTubeId": "i3NjJt_3rqM",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=i3NjJt_3rqM"
      }
    },
    {
      "id": "b9754841-3e68-4f6f-b76c-533cd1e47f1f",
      "title": "Tangled in Trauma: Escaping High-Control Relationships [ Ft. Easin Beck]",
      "description": "Today, we\u0027re joined by a spooky (but amazing) therapist—the one and only Easin Beck, MFT! \u0026#x1f47b;\u0026#x1f9e0; Currently rocking redhead status, they’re a trauma-focused therapist specializing in high-control religious environments and religious trauma. And trust us—this conversation is one of our favorites this year! \u0026#x1f49c; We’re diving into the Disney classic Tangled (streaming now on Disney\u0026#43;) to break down the toxic mother-daughter dynamic between Rapunzel and Mother Gothel. But this isn\u0027t just about a fairytale—it’s a real-life look into the experiences of people trapped in high-control environments with a parent, caregiver, or even a romantic partner. What We Cover in This Episode: - \u0026#x1f50d; Signs of High-Control Relationships – manipulation, isolation, gaslighting, and conditional love. - \u0026#x1f3ad; How Tangled Mirrors Real-Life Trauma – breaking down key scenes that show coercion, fear, and emotional abuse. - \u0026#x1f494; Why Abusers Control – the psychology behind power, dependency, and keeping you “small.” - \u0026#x1f6d1; How to Identify \u0026 Escape – understanding when you\u0027re being manipulated and how to take back control of your life. ⚠️ Trigger Warning: This episode includes discussions on emotional, mental, and physical abuse. If you\u0027ve recently left an abusive relationship, please take care when listening. Easin\u0027s Personal Journey Easin shares their firsthand experience growing up in a deeply isolated, high-control family—where they were homeschooled, restricted from community involvement, and constantly monitored. Everything from what they watched, read, or believed to how they moved through the world was controlled. They weren’t even allowed to leave the house without being tracked—mileage, gas levels, everything was measured. \u0026#x1f6b7; It wasn’t until college that they realized just how different their upbringing was—and how much it had shaped their self-perception, autonomy, and relationships. Takeaways: - Manipulative people will try to define you. They’ll call you naïve, dumb, unworthy, or body-shame you to make you feel like no one else will love you. - Abusers will isolate you. They make the outside world seem terrifying so you stay dependent on them. - Leaving is hard, but possible. When victims set boundaries, abusers often guilt-trip, manipulate, or even \u0022discard\u0022 them—but that’s a sign of their own fear of losing control. - Healing comes from community. Finding mentorship, therapy, and support can help you regain your sense of self and break free for good. ✨ Final Message: If you’ve ever felt trapped in a controlling environment, you are NOT alone. There is a way out, and healing is possible. We hope this episode resonates, educates, and empowers those navigating similar experiences. \u0026#x1f4f2; Follow Easin for More Support! They’re currently taking clients, so if their message resonates with you, check out their info in the links below. You deserve to live an authentic, free, and joyful life. \u0026#x1f49c;✨ To find our new guest: Easin Beck https://www.instagram.com/thespookytherapist/ https://linktr.ee/thespookytherapist Thanks for checking out Different Spectrums! \u0026#x1f399;️ We\u0027re a podcast led by licensed therapists and neurodivergent individuals who explore emotions in movies and shows. Our mission is to normalize mental health challenges and promote understanding. Join your founders and hosts, Dr. Nazeer Zerka and Spencer Srnec, as we process some key scenes to help you better understand your emotions and maybe even find some validation in them. Episode Breakdown: 0:00 Attention 0:59 Intro 6:25 Scenes 21:07 Discussion We’d love to hear your ideas for future episodes and connect with you on social media. You can find all our links here: https://linktr.ee/different_spectrums ⚠️ Reminder: Our podcast isn’t a substitute for therapy. If you need help, please seek professional assistance or call 988 for the National Suicide and Crisis Lifeline or 911 in case of an emergency.",
      "release": "2025-04-03T17:00:00Z",
      "duration": "01:57:24.2450000",
      "explicit": true,
      "spotifyId": "1agaowRpHli1rfpeObCCSk",
      "appleId": 1000702081602,
      "youTubeId": "IFpFNLRvnQY",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1agaowRpHli1rfpeObCCSk",
        "apple": "https://podcasts.apple.com/podcast/tangled-in-trauma-escaping-high-control-relationships/id1620802353?i=1000702081602",
        "youtube": "https://www.youtube.com/watch?v=IFpFNLRvnQY"
      }
    }
  ]
}