{
  "id": "e12d7a1c-c9c4-435f-9f83-a6ae962f3aba",
  "name": "Digital Social Hour Podcast by Sean Kelly",
  "spotifyId": "5Jn7LXarRlI8Hc0GtTn759",
  "appleId": 1676846015,
  "youTubeChannelId": "UCe9PesyMmm3KWmIzsE4zkxA",
  "episodes": [
    {
      "id": "25efac50-2307-4404-8e74-99f24b9857ed",
      "title": "Naima \u0026 Zina - Inside America’s New Hate Groups: Cult Psychology, Nick Fuentes \u0026 Radicalization",
      "description": "Debates, hate groups, cult psychology, the political creator ecosystem, AI paranoia, Nick Fuentes, Candace Owens, Trump’s declining base, wealth inequality, DEI collapse, censorship, TikTok bans, ICE raids, protests, Jubilee culture — this episode covers EVERYTHING happening in America right now.\n\nToday we’re joined by Zina and Naima, two of the biggest rising voices in political commentary.\nFrom calling out extremists… to breaking down the psychology of hate groups… to exposing how debate culture actually reinforces radicalization — this conversation gets raw, real, and shockingly insightful.\n\n✅ WHAT YOU’LL LEARN\n🧠 How extremist movements mirror cult psychology\n🎭 Why debate culture often reinforces radical beliefs instead of challenging them\n🔥 How online creators act on-camera vs off-camera\n📉 Why the right-wing ecosystem is fracturing after Trump \u0026 Charlie Kirk\n☠️ Why Nick Fuentes resonates with young men \u0026 why it’s dangerous\n📚 The truth about DEI collapses, wealth inequality \u0026 economic instability\n🤖 How AI will reshape jobs, labor, and opportunity in America\n🚔 What actually happens at real protests — tear gas, police escalation \u0026 firsthand stories\n🌐 How algorithms polarize people and create fake “in-groups” online\n🎙️ Why many creators are leaving debates for long-form podcasts\n\nCHAPTERS \n\n00:00 – Are debates empowering extremists?\n05:16 – The psychology of hate groups vs. cults\n12:40 – Jubilee debates, viral clips \u0026 creator fatigue\n20:31 – Andrew Wilson drama \u0026 off-camera behavior\n27:52 – Meeting conservatives vs. online toxicity\n34:58 – Trump, Epstein files \u0026 the right-wing fracture\n41:20 – Nick Fuentes, youth radicalization \u0026 danger zones\n47:33 – Candace Owens, her investigation series \u0026 contradictions\n55:04 – AI takeover, DEI collapse \u0026 economic anxiety\n1:05:12 – ICE raids, protests, police escalation \u0026 real experiences\n1:14:26 – Balance, burnout \u0026 the future of political creators\n1:21:40 – Announcing the Symposia Pod\n\n🎙️ APPLY OR CONNECT\n👉 Apply to be on the podcast: https://www.digitalsocialhour.com/application\n\n📩 Business inquiries / sponsors: jenna@digitalsocialhour.com\n\n👤 GUEST:\n♟️Naima Troutt  - https://www.instagram.com/hair.soupp/\nhttps://www.tiktok.com/@hair.soup\n\nZina Ikeme - https://www.instagram.com/zinaaweenaa/\nhttps://www.tiktok.com/@UCBm2St8-hC3soQ_C3RYgzMg \nhttps://www.youtube.com/@zinaaweenaa\n\n💼 SPONSORS\nQUINCE: https://quince.com/dsh\n\n🥗 Fuel your health with Viome: https://buy.viome.com/SEAN\nUse code “Sean” at checkout for a discount!\n\n🎧 LISTEN ON\n🍏 Apple Podcasts: https://podcasts.apple.com/us/podcast/digital-social-hour/id1676846015\n🎵 Spotify: https://open.spotify.com/show/5Jn7LXarRlI8Hc0GtTn759\n📸 Sean Kelly Instagram: @seanmikekelly\n\n⚠️ DISCLAIMER\nThe views and opinions expressed by guests on Digital Social Hour are solely those of the individuals appearing on the podcast and do not necessarily reflect the views or opinions of the host, Sean Kelly, or the Digital Social Hour team.\n\nWhile we encourage open and honest discussions, Sean Kelly is not legally responsible for any statements, claims, or opinions made by guests during the show.\n\nListeners are encouraged to form their own opinions and seek professional advice where appropriate. The content shared is for entertainment and informational purposes only — it should not be taken as legal, medical, financial, or professional advice.\n\nWe strive to present accurate and reliable information; however, we make no guarantees regarding its completeness or accuracy. The views expressed are solely those of the speakers and do not necessarily represent those of the producers or affiliates of this program.\n\n🔥 Stay tuned for more episodes featuring top creators, founders, and innovators shaping the digital world!\n\n✅ SEO KEYWORDS \n\ndebate culture, hate group psychology, online cults, Nick Fuentes, Candace Owens investigation, Charlie Kirk death, conservative infighting, Trump supporters 2025, Jubilee debate creators, Andrew Wilson debate,",
      "release": "2025-12-05T18:00:25Z",
      "duration": "00:56:47",
      "explicit": false,
      "youTubeId": "O_x4zCsaaC0",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=O_x4zCsaaC0"
      }
    },
    {
      "id": "00cf791b-3ee2-4e73-907a-2fc5222991c2",
      "title": "Madison Morgan: The Former Cult Member Taking Over OnlyFans | DSH #1587",
      "description": "Madison Morgan joins the Digital Social Hour podcast to share her fascinating journey, from growing up in a strict religious environment to becoming a leading figure in the adult entertainment industry. In this candid episode, Madison opens up about her family dynamics, her rebellious teenage years, and how she discovered her true path. She also reveals her most shocking scene yet, dives into memorable career highlights, and discusses the challenges of balancing personal relationships in her line of work. Madison gives unique insights into the world of webcamming, studio productions, and the evolving adult entertainment landscape. \u0026#x1f4a5; What You’ll Learn \u0026#x1f449; How she escaped a cult-like church and rebuilt her life \u0026#x1f449; The story behind her accidental start in adult work \u0026#x1f449; The wildest fetish requests she’s ever received \u0026#x1f449; Her thoughts on love, boundaries, and acceptance CHAPTERS: 00:00 - Intro 00:49 - Growing Up in a Religious Environment 03:50 - Madison\u0027s Journey into the Adult Industry 10:23 - Most Memorable Scene in Adult Film 14:35 - Exploring Wild Fetishes 18:04 - Dating Dynamics in the Adult Industry 19:10 - Interview Insights with Adam22 22:13 - Managing Your DMs 23:57 - Experiences at Swinger Parties 27:43 - Encounter with Law Enforcement 28:31 - What Excites Madison Morgan 30:40 - Reflecting on Regrets 31:44 - Living in the Past: A Discussion 34:57 - Can Guys and Girls Truly Be Friends? 36:09 - Interactions with Weird Fans 36:44 - What\u0027s Next for Madison Morgan? 38:41 - Like \u0026 Subscribe APPLY OR CONNECT Apply to be on the podcast: https://www.digitalsocialhour.com/application Business inquiries / sponsors:jenna@digitalsocialhour.com GUEST Madison Morgan: https://www.instagram.com/madisonmorganxo/ LISTEN ON Apple Podcasts: https://podcasts.apple.com/us/podcast/digital-social-hour/id1676846015 Spotify: https://open.spotify.com/show/5Jn7LXarRlI8Hc0GtTn759 Sean Kelly Instagram: https://www.instagram.com/seanmikekelly/ SPONSORS: THERASAGE: https://therasage.com/ QUINCE: https://quince.com/dsh Fuel your health with Viome → https://buy.viome.com/SEAN Use Code: \u0022Sean\u0022 at checkout for a discount. DISCLAIMER The views and opinions expressed by guests on *Digital Social Hour* are solely those of the individuals appearing on the podcast and do not necessarily reflect the views or opinions of the host, **Sean Kelly**, or the *Digital Social Hour* team. While we encourage open and honest discussions, Sean Kelly is **not legally responsible** for any statements, claims, or opinions made by guests during the show. Listeners are encouraged to form their own opinions and to seek professional advice where appropriate. Content on this podcast is **for entertainment and informational purposes only** and should not be considered legal, medical, financial, or professional advice. We strive to present accurate and reliable information; however, we make **no guarantees** regarding its completeness or accuracy. The views expressed are solely those of the speakers and do not necessarily represent those of the producers or affiliates of this program. \u0026#x1f9e0; Keywords Madison Morgan, OnlyFans, adult film industry, cult upbringing, religious trauma, adult star interview, Diddy scandal, Sharp No Jumper, Plug Talk, fetishes, sex work stories, adult industry behind the scenes, Digital Social Hour #bdsmbarbie #madisonmorgan #madisonmorgan #bdsmbarbie #cultupbringing Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-10-25T16:00:00Z",
      "duration": "00:38:54.8050000",
      "explicit": false,
      "spotifyId": "6MC4VIbd7KwNHHySuJaGjR",
      "appleId": 1000733463652,
      "youTubeId": "M1DhvhsvBgU",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6MC4VIbd7KwNHHySuJaGjR",
        "apple": "https://podcasts.apple.com/podcast/madison-morgan-the-former-cult-member-taking-over/id1676846015?i=1000733463652",
        "youtube": "https://www.youtube.com/watch?v=M1DhvhsvBgU"
      }
    },
    {
      "id": "786d0080-1a10-4084-bb3f-5ec319ca93e9",
      "title": "Tim Miller: The Cult-Like Grip of Trump on the GOP Exposed",
      "description": "Explore the cult-like grip Trump has on the GOP in this hard-hitting episode. The podcast dives deep into how Trump’s influence shapes the Republican Party, silences dissent, and discourages independent voices from emerging within the ranks. From the struggles of principled conservatives to the environment of unwavering loyalty created within MAGA circles, the discussion highlights the challenges Republican candidates face if they dare to disagree with Trump. \n\nThe episode also touches on broader political dynamics, including comparisons with Democratic leadership, the impact of party loyalty on healthy debate, and the barriers preventing fresh talent from stepping into the spotlight. Whether it\u0027s the fallout of past administrations, the fear of speaking out, or the growing polarization within U.S. politics, this conversation sheds light on the inner workings of modern political ecosystems.\n\n💥 What You’ll Learn\n👉 Why Republicans fear speaking out against Trump\n👉 How loyalty culture replaced real leadership\n👉 The truth about media bias \u0026 political access\n👉 What happens behind the scenes at conservative conferences\n👉 How America’s political system rewards obedience, not honesty\n\nCHAPTERS:\n00:00 - Republican Party Evolution\n02:40 - Sustainable Growth Strategies\n06:38 - Charlie Kirk\u0027s Cult Following\n08:14 - Follow \u0026 Subscribe Reminder\n08:25 - Video Introduction\n\nAPPLY TO BE ON THE PODCAST: https://www.digitalsocialhour.com/application\nBUSINESS INQUIRIES/SPONSORS: jenna@digitalsocialhour.com\n\nGUESTS : Tim Miller\nhttps://www.instagram.com/timmillergram/\n\nSPONSORS: \nTHERASAGE: https://therasage.com/\nQUINCE: https://quince.com/dsh\n\nLISTEN ON:\nApple Podcasts: https://podcasts.apple.com/us/podcast/digital-social-hour/id1676846015\nSpotify: https://open.spotify.com/show/5Jn7LXarRlI8Hc0GtTn759\nSean Kelly Instagram: https://www.instagram.com/seanmikekelly/\n\nThe views and opinions expressed by guests on Digital Social Hour are solely those of the individuals appearing on the podcast and do not necessarily reflect the views or opinions of the host, Sean Kelly, or the Digital Social Hour team.\n\nWhile we encourage open and honest conversations, Sean Kelly is not legally responsible for any statements, claims, or opinions made by guests during the show. Listeners are encouraged to form their own opinions and consult professionals for advice where appropriate.\n\nContent on this podcast is for entertainment and informational purposes only and should not be considered legal, medical, financial, or professional advice.\n\nWe have done our best to present the facts as we see them, however, we make no guarantees or promises regarding the accuracy, completeness, or reliability of the information provided.  In addition, the views and opinions expressed in this program are those of the speakers and do not necessarily reflect the views or positions of the producers of this program.\n\n\n#trumpsupporters #politicalcults #trumpgop #politicalcults #magainfluence",
      "release": "2025-10-19T16:00:57Z",
      "duration": "00:08:29",
      "explicit": false,
      "youTubeId": "Ypw8sElIgpQ",
      "subjects": [
        "Qanon",
        "Political Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ypw8sElIgpQ"
      }
    }
  ]
}