{
  "id": "c9587e94-b38e-4ffa-9080-b64f14cf6eaf",
  "name": "Dine in Psychology",
  "youTubeChannelId": "UCkGnsXfbZm8EkMbRRj2G1ew",
  "episodes": [
    {
      "id": "304494b5-7f56-43ef-8c34-ebb74ad2d6b5",
      "title": "Cult Expert Jon Atack\u0027s Personal Story of Leaving Scientology \u0026 Signs of Authoritarian Groups #cult",
      "description": "Today I welcome cult expert and former member of Scientology,  Jon Atack, to discuss his own story and provide invaluable information on spotting human predators and authoritarian groups. Jon has years of extensive knowledge and expertise on high control, cultic groups and is passionate about prevention and awareness. We discuss an array of topics from how he was able to recognize the lies and leave Scientology, his own research and findings on how human predators behaviors manifest themselves in every day life, and safe guards you can put in place for your own protection. This is truly an amazing interview I cannot wait to share with you!\n\n🌻Mental Health Merch: https://dine-in-psychology.creator-spring.com/\nPatreon: https://www.patreon.com/dineinpsychology \nBook: https://www.amazon.com/Live-Learn-Love-Real-talk-woman-ebook/dp/B07NJBLLSB \n\nCHAPTERS:\n00:00 Introduction\n01:55 Jon Atack\u0027s Experience with Scientology and Cultic Groups\n05:05 How do predators get into positions of power?\n07:20 Cult of One (DV Relationships) are Similar to Large Coercive Groups: What are the manipulative tactics used?\n11:15 Lovebombing as a Necessary Cult Recruitment Tactic, High Control Group Tactics, and Recent Story of a College Cult\n15:19 How did you get out of Scientology?\n20:00 Recognizing the MAJOR Incongruencies in Scientology after 9 Years of Being in\n22:48 Is it the love bombing or occasional good pieces that keep people in a high control group? Honeymoon Period and a Cult as a Romantic Relaitonship\n28:05 Ask Questions: Any Power can Be Abused\n29:55 MAJOR Reason why a person becomes involved in a high control cultic group\n31:41 Secrecy Must be Maintained at All Costs\n35:08 What can happen when members leave and how the threat of this keeps a person in\n38:16 QUESTION THE SOURCE!!!\n41:02 Final Words of Wisdom and Where you can Find Jon Atack\u0027s Books!\n\n#psychologicalcommentary #scientology #spiritualabuse #psychological #bitemodel #manipulation #cultsandextremebeliefs #cults #therapist #analysis #indoctrination #personality #fundamentalistanalysis #religioustraumasyndrome #religiousabuse\n\nCONNECT WITH JON ATACK:\nfacebook - https://www.facebook.com/AuthorJonAtack/\nyoutube - https://www.youtube.com/channel/UCI4tcSMV2kEh3BooY_XFSYQ\nblogsite - https://jonatacksopeningourminds.wordpress.com\namazon author page - https://www.amazon.com/Jon-Atack/e/B000AQ53YC\nTwitter: https://twitter.com/minds_opening\nInstagram: https://www.instagram.com/openmindstoday/\n\nFIRST DISCLAIMER: This video is NOT meant to demonize all spiritual beliefs and practices as research continually shows that having faith, or believing in a Higher Power can be a big source of comfort. Spiritual groups become problematic,  when members are held to impossible standards, rigid rules are enacted, and individuals are discouraged from having their own thoughts and or opinions.  \n\nRESOURCES:\nFor finding a therapist: \nwww.goodtherapy.org \nwww.psychologytoday.com\nhttps://openpathcollective.org/\nhttps://www.spiritualabuseresources.com/\nhttps://freedomofmind.com/\n\nIf you are curious what IBLP is, or learning more about aspects of high control/cultic groups, please see the videos linked below.\n\nPART 1, 2, and 3 IBLP Deep Dives: \nhttps://youtu.be/vk0i1cNK65E\nhttps://youtu.be/M-TP01Ei2i4\nhttps://youtu.be/nnu6xS-Lr-8\n\nWhat Happens in Religious Cults:\nhttps://youtu.be/epZqgPhxqo0\n\nOther video you may find helpful if you want more information on Josh Duggar:\nhttps://youtu.be/6c91PAFNgZc\nhttps://youtu.be/gQ5UBPumz1A\n\nIf you\u0027re interested in true crime, psychological commentary and analysis of current events, and/or learning about deceptive behavior, I also recommend the series on Elizabeth Holmes\u0027 Theranos Trial:\nhttps://youtube.com/playlist?list=PLNXxatoFNESU9fJw4dXSYHxMNNz1CQFTG\n\n✨Love delicious coffee with added nutrients like I do? Or are you a fan of adaptogen rich protein powder?\n\nShop the link below for Four Sigmatic Lion\u0027s Mane Mushroom Coffee and get 10% off with my code BEWELL (no mushroom taste, just vital nutrients derived from Lion\u0027s Mane mushroom that have been shown to aid in boosting mental clarity, strengthen immune functioning, and support steady energy levels. It\u0027s my personal favorite!):\n\n✨✨https://foursigmatic.com/?rfsn=4600992.5f6809\u0026discount=BEWELL\n\nDisclaimer: The information provided is for educational purposes only and not designed to diagnose or treat. Rachel Ann Dine is a licensed professional counselor at time of EVENT and distribution but is in no way by engagement of interaction with you attempting to diagnose or treat you. Please consult your own medical provider for treatment or therapy (resource: www.psychologytoday.com for therapy!).",
      "release": "2022-04-11T16:01:21Z",
      "duration": "00:42:57",
      "explicit": false,
      "youTubeId": "-hItzZAgwEE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-hItzZAgwEE"
      }
    }
  ]
}