{
  "_ts": 0,
  "id": "9a765340-2031-4fc1-97f4-36276bf270e0",
  "name": "Dinky",
  "spotifyId": "01kt0xnL1vwV7bO7c0bRAD",
  "appleId": 1632497533,
  "episodes": [
    {
      "id": "3958cb34-f48f-430e-b6a3-3fe0690c3ffa",
      "title": "Surviving A Cult \u0026 Childhood Torture (With Nonprofit Founder Ali Davis)",
      "description": "Today we are honored to be joined by Ali Davis, a cult and childhood torture survivor. Ali grew up under Bill Gothard\u0027s teachings (otherwise known as the fundamentalist Christian cult portrayed in ‘Shiny Happy People’). Due in large part to Ali’s childhood experiences, she is now in her early 30s and childfree by choice. Ali is passionate about raising awareness of non-war related childhood torture and is the founder and Executive Director of the pretti graffiti foundation — the first and only nonprofit in the US dedicated to securing humanitarian aid for other survivors. Follow pretti graffiti foundation on Instagram. Visit the pretti graffiti foundation website to learn more or donate . To shop Erika’s mentioned lip stain, visit Wonderskin . (Not an ad.) Wanna go to Switzerland with us ? As of publishing, there are only 6 spots left so don’t waste time! Book now. Today\u0027s podcast is brought to you by Childfree Wealth , a life and financial planning firm dedicated to helping childfree and permanently childless people live their best life without kids. Visit their website to get started — and tell them we sent you! Support this show. Wanna connect with us on social media? You can find us on Instagram and TikTok at @dinkypod. If you have a question or comment, email us at dinky@dinkypod.com",
      "release": "2024-03-19T07:00:02Z",
      "duration": "01:30:44.7280000",
      "explicit": true,
      "spotifyId": "3cERrpQwEvgt4UEd2j1FB4",
      "appleId": 1000649672402,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3cERrpQwEvgt4UEd2j1FB4",
        "apple": "https://podcasts.apple.com/podcast/surviving-a-cult-childhood-torture-with/id1632497533?i=1000649672402"
      }
    }
  ]
}