{
  "id": "2db6cc36-03d4-462c-97f2-8f540b39db6b",
  "name": "DisAllusioned",
  "spotifyId": "23003VjLo8FMUeMCzZ4cNE",
  "appleId": 1775268858,
  "youTubeChannelId": "UCW52Qu18NF4yCg0Bm-4ksdQ",
  "episodes": [
    {
      "id": "372c605d-2d6f-4ef6-9f30-6eed939c139e",
      "title": "Unraveling: The Andrea Yates Case and the Cult Behind the Killer",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood delves into the harrowing case of Andrea Yates, who infamously drowned her five children in 2001. The discussion centers around the influence of cult leader Mike Woroniecki on Yates and the broader implications of cult dynamics on mental health and family structures. Sherwood shares personal insights from her own experiences with her parents being ex-members of this cult, emphasizing the need for awareness and discussion about the dangers posed by such groups. The episode also highlights the recent HBO Max documentary that sheds light on these issues, aiming to bring justice and closure to the victims and their families. Thank you for watching DisAllusioned Podcast! Please subscribe for more cult survivor content. Follow DisAllusioned Podcast: TikTok: https://www.tiktok.com/@intrinsicagency Instagram: https://www.instagram.com/disallusioned_podcast/ Follow Intrinsic Agency: Instagram: https://www.instagram.com/intrinsicagency/ #andreayates #coercivecontrol #cultleader #fundamentalism #cults #podcast #survivorstories",
      "release": "2026-01-12T00:22:34Z",
      "duration": "00:19:15.0990000",
      "explicit": true,
      "spotifyId": "1NLgXupXUTqlFUus8DM5vi",
      "appleId": 1000744736979,
      "youTubeId": "92D_d8M8vnw",
      "subjects": [
        "Cornerstone Christian Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1NLgXupXUTqlFUus8DM5vi",
        "apple": "https://podcasts.apple.com/podcast/unraveling-the-andrea-yates-case-and-the/id1775268858?i=1000744736979",
        "youtube": "https://www.youtube.com/watch?v=92D_d8M8vnw"
      }
    },
    {
      "id": "ab759882-c55b-46b0-b4e7-91479431f931",
      "title": "I Married a Guru: Surviving a Yoga Cult",
      "description": "In this episode of DisAllusioned Podcast, join host Ari Sherwood as she sits down with Joelle Tamraz, author of the book \u0022The Secret Practice: Eighteen Years on the Dark Side of Yoga\u0022. Joelle  shares her experience joining a yoga cult, and marrying the guru. She details the manipulative tactics employed by her guru, and the complex dynamics of relationships within the cult. She discusses the unique practices of Agni Yoga, the indoctrination through meditation, and the financial exploitation that often accompanies such groups. Joelle reflects on her journey of self-discovery and the challenges of reclaiming her identity after leaving the cult, emphasizing the importance of critical thinking and awareness in spiritual practices. \nThank you for watching DisAllusioned Podcast! Subscribe for more stories of survival and recovering from coercive control.\n\n\nFollow Joelle Tamraz:\n\nJoelle\u0027s Website:\nhttps://joelletamraz.com/\n\nSubstack:\nhttps://joelletamraz.substack.com/\n\nTikTok:\nhttps://tiktok.com/@joelletamraz\n\n\nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsicagency \n\nInstagram:\nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram:\nhttps://www.instagram.com/intrinsicagency/\n\n\n#cultsurvivor #guru #yoga #cult #coercivecontrol #cultrecovery",
      "release": "2025-12-29T02:47:25Z",
      "duration": "01:30:01.3560000",
      "explicit": true,
      "spotifyId": "3Kil8cEVS7couvrj2iFvWV",
      "appleId": 1000743001627,
      "youTubeId": "XaKVsmHrkz8",
      "subjects": [
        "Swami Anand Arun",
        "Yoga Cult",
        "Agni Yoga",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Kil8cEVS7couvrj2iFvWV",
        "apple": "https://podcasts.apple.com/podcast/i-married-a-guru-surviving-a-yoga-cult/id1775268858?i=1000743001627",
        "youtube": "https://www.youtube.com/watch?v=XaKVsmHrkz8"
      }
    },
    {
      "id": "b1b38f9d-2816-43e8-9220-a2e88ef7a35b",
      "title": "Elise Journey from Assemblies of God: Institutional Corruption and Her Fight for Change",
      "description": "Join Ari Sherwood on the DisAllusioned Podcast as she interviews Elise Delamare, a former minister and survivor of the Assemblies of God Church. Elise shares her compelling journey from feeling called to ministry at a young age, facing challenges within the church, such as negative perceptions of women in ministry, leading to her involvement in the Assemblies of God church. Elise discusses the intensive ministry boot camp, demanding hours, and tactics of coercive control utilized within the church. Discover her path to healing and advocacy as she exposes the hidden truths and seeks change within religious institutions. This episode is a powerful testament to resilience and the pursuit of truth.\n\nThank you for watching DisAllusioned Podcast! Don\u0027t forget to like and subscribe for more discussions with survivors of coercive control.\n\nFollow Elise Delamare:\n\nTikTok:\nhttps://www.tiktok.com/@truth.in.the.sanctuary\n\nAG Anonymous:\nAGAnonymous.com\n\nIf you have been a victim of affiliates of Assemblies of God church and would like to submit your story, please contact Elise at AGanonymousstories@gmail.com \nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsicagency \n\nInstagram:\nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram:\nhttps://www.instagram.com/intrinsicagency/\n\n\n#religiousabuse #religioustrauma #coercivecontrol #healing #resilience #womeninministry #religiouscult #survivorstories #podcast",
      "release": "2025-12-14T23:19:47Z",
      "duration": "01:13:42",
      "explicit": false,
      "spotifyId": "084JTHYVooUfmV1CFA1sXD",
      "appleId": 1000741273740,
      "youTubeId": "ryiNSyjL3GM",
      "subjects": [
        "World Assemblies of God Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/084JTHYVooUfmV1CFA1sXD",
        "apple": "https://podcasts.apple.com/podcast/elise-journey-from-assemblies-of-god-institutional/id1775268858?i=1000741273740",
        "youtube": "https://www.youtube.com/watch?v=ryiNSyjL3GM"
      }
    },
    {
      "id": "44545ac2-7dec-4a82-bc49-163657f1248b",
      "title": "Cult Survivors and Storytelling: Pressures, Ethics, and Perfectionism",
      "description": "In the season 3 premiere of DisAllusioned Podcast, host Ari Sherwood dives into the profound responsibility of sharing cult survivor stories. As podcasters and producers, it\u0027s crucial to prioritize the mental health and well-being of our guests, ensuring a safe and supportive environment for them to share their experiences. This episode explores the ethical considerations of interviewing survivors, emphasizing the importance of providing resources, respecting each individual\u0027s readiness to tell their story, and the importance for survivors to take care of their well being first. Join us as she discusses the delicate balance of advocacy, storytelling, and putting the survivor\u0027s needs first.\n\n\n#cultsurvivor #cults #podcast #coercivecontrol #cultrecovery #mentalhealth #survivorstories #survivor #ethics",
      "release": "2025-12-07T23:00:00Z",
      "duration": "00:17:53",
      "explicit": false,
      "spotifyId": "7vmri8kKQKaPtaSh40N9g8",
      "appleId": 1000740128320,
      "youTubeId": "NAtQ2bnekis",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vmri8kKQKaPtaSh40N9g8",
        "apple": "https://podcasts.apple.com/podcast/cult-survivors-and-storytelling-pressures-ethics/id1775268858?i=1000740128320",
        "youtube": "https://www.youtube.com/watch?v=NAtQ2bnekis"
      }
    },
    {
      "id": "912a0362-8873-4c32-b27b-3f43bb4c3286",
      "title": "The Indoctrination of America: Facing the Normalization of Violence and Extremism",
      "description": "In this pop-up episode of the DisAllusioned Podcast, host Ari Sherwood discusses the recent wave of violence in the United States, particularly focusing on school shootings and the radicalization of youth. She reflects on the emotional toll of these events, the normalization of violence in schools, and the role of educators in crisis situations. Ari further emphasizes the need to address extremism and the importance of maintaining humanity in the face of political division. She calls for a collective effort to protect children\u0027s rights and to rise above hate and division in society. #cultsurvivor #radicalization #change #extremism",
      "release": "2025-09-13T19:17:25Z",
      "duration": "00:32:23.4170000",
      "explicit": true,
      "spotifyId": "5inJCoh7kAbArwP7fD94wA",
      "appleId": 1000726677819,
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5inJCoh7kAbArwP7fD94wA",
        "apple": "https://podcasts.apple.com/podcast/the-indoctrination-of-america-facing/id1775268858?i=1000726677819"
      }
    },
    {
      "id": "6dd9083a-d326-4c02-9e92-86ca31fabbc9",
      "title": "Who am I? Figuring out your Identity after a Cult Experience",
      "description": "In the season 2 finale of DisAllusioned Podcast, host Ari Sherwood dives into the profound challenges cult survivors encounter as they strive to reclaim their identities. Through personal reflections and insightful interviews, Ari explores the journey from indoctrination to self-discovery, highlighting the courage it takes to question long-held beliefs and embrace one\u0027s true self. She explores the deep impact of coercive control on personal identity, and the struggle to reclaim decision-making abilities. Ari emphasizes the importance of individual stories while reminding listeners that they are so much more than their past experiences. \n\n\n\n\n\n\nThank you for watching season 2 of DisAllusioned Podcast! If you are a survivor of coercive control and ready to share you story, please feel free to contact Ari Sherwood at: DisAllusionedPodcast@gmail.com.\n\n\n\n\n\n\nFollow DisAllusioned Podcast:\n\n\n\n\n\n\nTikTok:\n\n\nhttps://www.tiktok.com/@intrinsicagency \n\n\n\n\n\n\nInstagram:\n\n\nhttps://www.instagram.com/disallusioned_podcast/\n\n\n\n\n\n\nFollow Intrinsic Agency:\n\n\n\n\n\n\nInstagram:\n\n\nhttps://www.instagram.com/intrinsicagency/",
      "release": "2025-08-24T23:52:56Z",
      "duration": "00:28:54.9250000",
      "explicit": true,
      "spotifyId": "0gQ1aqdDaFaeGMUgU1o7oR",
      "appleId": 1000723361637,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0gQ1aqdDaFaeGMUgU1o7oR",
        "apple": "https://podcasts.apple.com/podcast/who-am-i-figuring-out-your-identity-after-a-cult-experience/id1775268858?i=1000723361637"
      }
    },
    {
      "id": "1218617d-98a7-4b5f-b9e2-e1d8d51617e6",
      "title": "Unveiling the Cult of North Korea",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood and guest-host Jay dive into the complex and often disturbing realities of North Korea, exploring its history, the rise of Kim Il-sung, the impact of the Korean War, and the ongoing cult of personality surrounding its leaders. They discuss the Songbun system that categorizes citizens based on loyalty and the role of propaganda in maintaining isolation. The conversation also touches on the future of the regime, particularly in light of Kim Jong-un\u0027s lack of heirs, and the chilling parallels between North Korea\u0027s control mechanisms and those of cults. Ari and Jay discuss various themes including the historical context of racism and child marriage, the role of lawmakers in perpetuating these issues, and the authoritarian control seen in different societies. They explore the manipulation of food as a control tactic, the impact of propaganda on public perception, and the importance of freedom of religion and the separation of church and state.\n\nThank you for watching DisAllusioned Podcast! Don\u0027t forget to subscribe to watch compelling interviews with survivors of cults and coercive control.\n\nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsicagency \n\nInstagram:\nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram:\nhttps://www.instagram.com/intrinsicagency/\n\n\n#cults #northkorea #coercivecontrol #humanrights #dictatorship #cultofpersonality #cultawareness #autonomy",
      "release": "2025-08-17T22:27:37Z",
      "duration": "01:54:51",
      "explicit": false,
      "spotifyId": "6G3tMegwmrXRWAaddx2NR3",
      "appleId": 1000722331548,
      "youTubeId": "noRZGAFccHI",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6G3tMegwmrXRWAaddx2NR3",
        "apple": "https://podcasts.apple.com/podcast/unveiling-the-cult-of-north-korea/id1775268858?i=1000722331548",
        "youtube": "https://www.youtube.com/watch?v=noRZGAFccHI"
      }
    },
    {
      "id": "d80949a1-e8d7-4be4-8e9b-ad37573fb21a",
      "title": "Exposing the City Builders Cult: The Road to Advocacy",
      "description": "Join host Ari Sherwood in a compelling conversation with Clare Heath-McIvor, a survivor of the City Builders Church and a passionate advocate for cult survivors. Clare shares her journey growing up in a high-control religious group as the daughter of leader Brian Hearth. Her story is incredible as she details her deconstruction from evangelical fundamentalism, to becoming a whistleblower and advocate for legislative reform.  Clare, along with other cult survivors, have been leading advocates on the parliamentary inquiry into cults and fringe groups in Victoria, Australia, which aims to address coercive control in cults and high-control groups, marking a pivotal step in recognizing and legislating against such behaviors. Clare emphasizes the psychological impact of cults and the ongoing struggle for LGBTQ\u002B rights within religious contexts, highlighting the need for awareness and legislative action, and the importance of survivor-centered advocacy. \n\nThank you for watching DisAllusioned Podcast! Don\u0027t forget to subscribe to hear more incredible stories of coercive control, survival, and advocacy!\n\n\nFollow Clare:\n\nTikTok:\nhttps://www.tiktok.com/@clareheathmcivor\n\nUnchurchable Podcast:\nhttps://open.spotify.com/show/0l3gXv1VUjU4AkGoxXv8Ov\n\nInstagram:\nhttps://www.instagram.com/unchurchablepod/\n\nVictoria Cult Survivor\u0027s Network Facebook Group:\nhttps://www.facebook.com/groups/1207865294020176/\n\nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsicagency \n\nInstagram:\nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram:\nhttps://www.instagram.com/intrinsicagency/\n\nParliamentary Inquiry into Cults and Fringe Groups Victoria:\nhttps://www.parliament.vic.gov.au/cofg\n\n\n#cultsurvivor #citybuilder #cult #podcast #cultawareness #advocacy #fringe #christiannationalism #dominionism #exevangelical",
      "release": "2025-08-10T22:00:00Z",
      "duration": "01:40:22.9310000",
      "explicit": true,
      "spotifyId": "3wABoKKrZn3pre7xkA8pyS",
      "appleId": 1000721423367,
      "youTubeId": "ZWZ4yhiRXNs",
      "subjects": [
        "Cult Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3wABoKKrZn3pre7xkA8pyS",
        "apple": "https://podcasts.apple.com/podcast/exposing-the-city-builders-cult-the-road-to-advocacy/id1775268858?i=1000721423367",
        "youtube": "https://www.youtube.com/watch?v=ZWZ4yhiRXNs"
      }
    },
    {
      "id": "a1fd7f2e-d43b-4b64-a5c4-5f423cfda736",
      "title": "The Cult of Eugenics: Historical Roots and Modern Implications",
      "description": "On this episode of DisAllusioned Podcast, host Ari Sherwood and guest Jay dive into the complex and troubling history of eugenics, exploring its roots in ancient philosophy, the uprise of the eugenics movement in America, and its resurgence in modern advertising. They discuss the ethical implications of eugenics, the nature vs. nurture debate, and the cultural biases that have shaped perceptions of intelligence and worth. They also examine the impact of eugenics on immigration policies and economic inequality, highlighting the ongoing relevance of these issues in contemporary society. Ari and Jay talk about the intersections of religion, history, and politics, exploring how belief systems can shape societal narratives and influence actions. The conversation emphasizes the importance of awareness and responsibility in understanding the patterns of history and their relevance in contemporary society. Thank you for watching DisAllusioned Podcast! Don\u0027t forget to subscribe to hear incredible stories from survivor\u0027s of cults and coercive control. Follow DisAllusioned Podcast: TikTok: https://www.tiktok.com/@intrinsicagency Instagram: https://www.instagram.com/disallusioned_podcast/ Follow Intrinsic Agency: Instagram: https://www.instagram.com/intrinsicagency/ Eugenics Crusade PBS documentary: https://www.youtube.com/watch?v=vmRb-0v5xfI",
      "release": "2025-08-03T22:00:00Z",
      "duration": "01:27:51.7650000",
      "explicit": true,
      "spotifyId": "0YZQZ66ueCt9mxGfGu694k",
      "appleId": 1000720521548,
      "youTubeId": "_WgBa-swGh8",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YZQZ66ueCt9mxGfGu694k",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-eugenics-historical-roots/id1775268858?i=1000720521548",
        "youtube": "https://www.youtube.com/watch?v=_WgBa-swGh8"
      }
    },
    {
      "id": "cc5016e9-1012-41c3-92fd-781a7c214766",
      "title": "Church Abuse Survivor\u0027s Day: A Call to Solidarity",
      "description": "In this episode of DisAllusioned Podcast, host Ari Sherwood speaks with Geoff Etherton, a former youth pastor in the Church of England, about his experiences in the church and the creation of Church Abuse Survivor\u0027s Day. Geoff was a pioneer in the church, and with creative freedom, he was able to establish a coffee shop in the church as a means for meaningful engagement with the public, regardless of religious beliefs. With a sudden change in leadership, he was quickly thrown into coercive dynamics. He discusses the challenges faced within church leadership, the failure to address abuse cases, and the church\u0027s perspectives and criticisms of mental health, detailing his experiences being pushed out of ministry for having depression. Geoff shares his personal journey of deconstruction and the significance of community support for those who have experienced church abuse. This led Geoff to start Church Abuse Survivor\u0027s Day, in order to give recognition, validation, and solidarity to those who have survived religious abuse. Show your own solidarity and support for fellow survivors by lighting a candle on March 20th at 7:00 pm. \n\nThank you for watching DisAllusioned Podcast! Subscribe for more stories by survivors of coercive control, high control religions, and cult dynamics. \n\nFollow Geoff Etherton:\n\nInstagram:\nhttps://www.instagram.com/churchabusesurvivorsday/\n\nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsicagency \n\nInstagram:\nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram:\nhttps://www.instagram.com/intrinsicagency/\n\n\n#religioustrauma #churchcorruption #religiousabuse #coercivecontrol #awareness #podcast #cultsurvivor",
      "release": "2025-07-27T22:00:01Z",
      "duration": "00:48:27.9740000",
      "explicit": true,
      "spotifyId": "4xmGFv6pOajALJKQZDfA9l",
      "appleId": 1000719415779,
      "youTubeId": "-bmFC93e53I",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xmGFv6pOajALJKQZDfA9l",
        "apple": "https://podcasts.apple.com/podcast/church-abuse-survivors-day-a-call-to-solidarity/id1775268858?i=1000719415779",
        "youtube": "https://www.youtube.com/watch?v=-bmFC93e53I"
      }
    },
    {
      "id": "0dfabdca-7d5a-4b8b-8c35-d7323bc73426",
      "title": "The Child Who Survived: Jeremy\u0027s Cult Experience",
      "description": "TW: This episode of DisAllusioned Podcast covers extreme and distressing themes, such as CSA, Child abuse, neglect, and torturous conditions. Viewer Discretion is strongly advised. \n\nIn this episode of the DisAllusioned Podcast, host Ari Sherwood interviews Jeremy Paskell, a survivor of the cult led by Ariel Ben Sherman. Jeremy gives an open and honest account of growing up in the cult, detailing the leader\u0027s long history of cons and manipulative tactics, and the severe punishments inflicted on children. Being raised within the confines of a compound, he reflects on the isolation from the outside world, the limited education provided, and the emotional trauma that resulted from his upbringing. As the conversation unfolds, Jeremy discusses the eventual collapse of the cult and his journey towards healing and recovery. He discusses the aftermath of the cult, including life in foster care, the challenges of reintegration into society, and the journey of healing through writing a book about his experiences. \n\nJeremy\u0027s story gives incredible insight into the dangers and destruction of growing up in a cult. He tells his story with courage and strength, recounting his painful experiences, while offering valuable advice for anyone who has been through such experiences. Show Jeremy support on his journey by supporting his art, https://paskellcreativepainting.com/\n\nThank you for watching DisAllusioned Podcast! Don\u0027t forget to subscribe for more interviews with cult survivors and their incredible stories of survival and corruption.\n\nFollow Jeremy Paskell:\n\nTikTok: \nhttps://www.tiktok.com/@i_am_art_jeremypaskell\n\nInstagram:\n\nSupport Jeremy\u0027s Art:\n\nShop: \nhttps://www.redbubble.com/people/jeremypaskell/\n\nInstagram:\nhttps://www.instagram.com/greenfinhawk/\n\nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsicagency \n\nInstagram:\nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram:\nhttps://www.instagram.com/intrinsicagency/\n\n\n\n#cult #cultsurvivor #survivorstories #arielbensherman #podcast #cultawareness #fostercare #compound #coercivecontrol",
      "release": "2025-07-20T22:01:01Z",
      "duration": "02:17:23.8960000",
      "explicit": true,
      "spotifyId": "0Ye5D3GAv5Of36AD0MOou1",
      "appleId": 1000718192402,
      "youTubeId": "tL1F6F7u9P0",
      "subjects": [
        "New Life Tabernacle"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Ye5D3GAv5Of36AD0MOou1",
        "apple": "https://podcasts.apple.com/podcast/the-child-who-survived-jeremys-cult-experience/id1775268858?i=1000718192402",
        "youtube": "https://www.youtube.com/watch?v=tL1F6F7u9P0"
      }
    },
    {
      "id": "fd3f2947-8c52-47a8-ba8a-36a2255205df",
      "title": "Kingdom Kids: Inside the ICOC Cult",
      "description": "Join host, Ari Sherwood, for a compelling episode diving into the multifaceted experiences of growing up in the International Churches of Christ (ICOC). Podcaster and cult survivor, Roy Clemens, opens up about the struggles of life as a \u0022Kingdom Kid,\u0022 grappling with the realization that the ICOC is more than just a church—it’s a cult. We explore the lasting impact of purity culture on adulthood, from internalized shame to relationship challenges. Discover how storytelling becomes a powerful tool for healing, as Roy shares his journey of reclaiming his narrative and finding empowerment through sharing his experiences on his podcast, Clemenz with a Z. This episode offers a profound look at resilience, self-discovery, and the transformative power of giving voice to one\u0027s story. Thank you for watching DisAllusioned Podcast! Like and subscribe for more compelling interviews with survivors of coercive control who are using their voices and reclaiming their power. Follow Roy Clemenz: Clemenz with a Z website: https://www.clemenzwithaz.com/ Instagram: https://www.instagram.com/clemenzwithazpodcast/ Substack: https://substack.com/@clemenzwithaz Follow DisAllusioned Podcast: TikTok: https://www.tiktok.com/@intrinsic_agency Instagram: https://www.instagram.com/disallusioned_podcast/ Follow Intrinsic Agency: Instagram: https://www.instagram.com/intrinsicagency/",
      "release": "2025-07-13T22:00:00Z",
      "duration": "01:12:47.5570000",
      "explicit": true,
      "spotifyId": "2DGSBJJzSlgppZCSD6gURs",
      "appleId": 1000717088739,
      "youTubeId": "3V2aZHNebUE",
      "subjects": [
        "International Churches Of Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2DGSBJJzSlgppZCSD6gURs",
        "apple": "https://podcasts.apple.com/podcast/kingdom-kids-inside-the-icoc-cult/id1775268858?i=1000717088739",
        "youtube": "https://www.youtube.com/watch?v=3V2aZHNebUE"
      }
    },
    {
      "id": "83e44af2-f905-4422-b906-2939d5f48f87",
      "title": "Rhetoric and Persuasion in Cult Dynamics",
      "description": "In this episode of the DisAllusioned podcast, host Ari Sherwood and guest Jay continue the Philosophy Behind Cults series, focusing on the role of authority, persuasion, and manipulation of language. They explore the rhetorical strategies of ethos, pathos, and logos, and how these elements are used to establish credibility and manipulate emotions. The conversation also touches on the complexities of validating authority in claims of divinity, and the challenges of discerning legitimate authority in a world filled with misinformation. In this conversation, Jay and Ari delve into the complexities of authority, belief, and knowledge. Throughout, they emphasize the need for critical thinking and discernment in navigating claims of authority. \n\nThank you for watching DisAllusioned Podcast! Don\u0027t forget to subscribe for compelling interviews and discussions with cult survivors about their experiences and reclaiming their lives after the cult experience. \n\nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsic_agency\n\nInstagram:\nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram:\nhttps://www.instagram.com/intrinsicagency/\n\nAristotle\u0027s Rhetoric:\nhttps://www.amazon.com/Aristotles-Art-Rhetoric-Aristotle/\n\nStanford Encyclopedia of Philosophy:\nhttps://plato.stanford.edu/\n\n\n#cultsurvivor #podcast #coercivecontrol #philosophy #authority #persuasion #rhetoric #aristotle #cults #cultrecovery #cultawareness #criticalthinking",
      "release": "2025-06-16T03:49:14Z",
      "duration": "00:56:56.4210000",
      "explicit": true,
      "spotifyId": "4FtVFHeTK3pkB4a5zNZd0Q",
      "appleId": 1000713033076,
      "youTubeId": "KT46VZRAdzE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4FtVFHeTK3pkB4a5zNZd0Q",
        "apple": "https://podcasts.apple.com/podcast/rhetoric-and-persuasion-in-cult-dynamics/id1775268858?i=1000713033076",
        "youtube": "https://www.youtube.com/watch?v=KT46VZRAdzE"
      }
    },
    {
      "id": "971b711c-0bd0-49c2-8057-25b2a8164418",
      "title": "Inside the Jehovah\u0027s Witness Organization: David\u0027s Journey from Believer to Musician",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with David Quesada, a former Jehovah\u0027s Witness and musician. David shares his journey growing up in a strict, multi-generational Jehovah\u0027s Witness family, detailing the intense control and hierarchy within the organization. He discusses the changes in teachings over the years, the financial struggles linked to lawsuits, and his personal experiences with shunning and questioning his beliefs. David reflects on the cognitive dissonance he faced and the process of deconstructing his faith, ultimately leading to a powerful realization about the nature of the cult. The conversation highlights the challenges of leaving a deeply ingrained belief system and the impact on family dynamics. He shares their journey of leaving a controlling religious environment, the struggles faced during the transition, and the role of music as a therapeutic outlet. They discuss the importance of autonomy, identity, and the hope that exists for those who have left similar situations. This conversation emphasizes resilience and the power of creativity in overcoming adversity. Thank you for watching DisAllusioned Podcast! Don\u0027t forget to like and subscribe for more discussions and interviews focusing on coercive control and the cult dynamic. Support The Bloody Tuesdays: https://thebloodytuesdays.bandcamp.com/ Follow David: Instagram: https://www.instagram.com/the_bloody_tuesdays/ Follow DisAllusioned Podcast:TikTok:https://www.tiktok.com/@intrinsic_agency Instagram: https://www.instagram.com/disallusioned_podcast/ Follow Intrinsic Agency:Instagram: https://www.instagram.com/intrinsicagency/",
      "release": "2025-06-01T22:00:00Z",
      "duration": "01:19:58.1710000",
      "explicit": true,
      "spotifyId": "2TWj4In9OLYOmJdff91zEv",
      "appleId": 1000710784082,
      "youTubeId": "OHw4Q_u5lt0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2TWj4In9OLYOmJdff91zEv",
        "apple": "https://podcasts.apple.com/podcast/inside-the-jehovahs-witness-organization-davids/id1775268858?i=1000710784082",
        "youtube": "https://www.youtube.com/watch?v=OHw4Q_u5lt0"
      }
    },
    {
      "id": "378bb26d-855b-4edf-bafb-8711cbe986ca",
      "title": "Breaking Free from a Generational Cult: The Hidden Truths of the Jehovah\u0027s Witness Organization",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with Amber, a fifth-generation ex-Jehovah\u0027s Witness. Amber shares her unique journey growing up in the organization, the complexities of baptism, disfellowshipping, and the impact of COVID-19 on the community. She discusses the contradictions within the beliefs and practices of Jehovah\u0027s Witnesses, the emotional toll of leaving the organization, and the struggles of navigating family relationships post-exit. Amber also highlights the serious issues of child abuse within the organization and the role of whistleblowers in seeking truth. This conversation provides a deep insight into the challenges faced by those who leave high-control religions and the journey towards personal faith and freedom. Amber emphasizes the significance of community support for ex-cult members and the power of questioning beliefs, ultimately encouraging listeners to embrace their own journeys of healing and self-discovery. Thank you for watching DisAllusioned Podcast! Don\u0027t forget to like and subscribe for more discussions and interviews focusing on coercive control and the cult dynamic. Follow Amber: TikTok: https://www.tiktok.com/@cult.life.escaped Instagram: https://www.instagram.com/cult.life.escaped/ YouTube: ⁨@CultLifeEscaped⁩ Follow DisAllusioned Podcast: TikTok: https://www.tiktok.com/@intrinsic_agency Instagram: https://www.instagram.com/disallusioned_podcast/ Follow Intrinsic Agency: Instagram: https://www.instagram.com/intrinsicagency/",
      "release": "2025-05-25T22:01:00Z",
      "duration": "01:49:05.4730000",
      "explicit": true,
      "spotifyId": "0hXzSLxUsUFo2SSMBjyWLW",
      "appleId": 1000709823492,
      "youTubeId": "kgKhEpKPoOM",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hXzSLxUsUFo2SSMBjyWLW",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-from-a-generational-cult-the/id1775268858?i=1000709823492",
        "youtube": "https://www.youtube.com/watch?v=kgKhEpKPoOM"
      }
    },
    {
      "id": "05ab4683-e092-40ed-bced-95100b6629fc",
      "title": "The Philosophy Behind Cults: Are Cult Leaders a Legitimate Authority?",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood continues her series into the philosophy behind cults, focusing on the concepts of authority and autonomy, tackling some foundational questions: What makes authority legitimate? Why should we obey authority? And can a cult be a legitimate authority? Ari gives an introduction into the philosophy of authority and the various philosophical perspectives, including those of Thomas Hobbes, Immanuel Kant, Plato, and John Stuart Mill, examining what makes authority legitimate and the moral obligations individuals have towards it. Ari emphasizes the importance of personal agency and the challenges faced by cult survivors in reclaiming their autonomy. Understanding what authority is, the relevance of autonomy and consent in legitimating authority, and the variations in philosophical approaches can help you in your own deconstruction and recovery process. \n\nThank you for watching DisAllusioned Podcast! Don\u0027t forget to like and subscribe for more discussions and interviews focusing on coercive control and the cult dynamic. \n\nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsic_agency\n\nInstagram:\nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram:\nhttps://www.instagram.com/intrinsicagency/\n\nRecommended Philosophy Books:\n\nThomas Hobbes Leviathan:\nhttps://a.co/d/82TJV39\n\nImmanuel Kant Critique of Pure Reason:\nhttps://a.co/d/isxqed9\n\nPlato\u0027s The Republic:\nhttps://a.co/d/iZAwWtg\n\nJohn Stuart Mill\u0027s On Liberty:\nhttps://a.co/d/gRpTvr2\n\nRobert Paul Wolff In Defense of Anarchism:\nhttps://a.co/d/08xM3OM\n\nLeslie Green\u0027s Authority of the State:\nhttps://a.co/d/dRX0RCy\n\nPhilosophical Resources:\n\nStanford Encyclopedia of Philosophy:\nhttps://plato.stanford.edu/\n\nPhilPapers:\nhttps://philpapers.org/\n\nAmerican Philosophical Association:\nhttps://www.apaonline.org/\n\nThe Philosopher\u0027s Magazine:\nhttps://philosophersmag.com/\n\n#cultsurvivor #cults #philosophy #authority #autonomy #plato #immanuelkant #hobbes #johnstuartmill #podcast #cultawareness",
      "release": "2025-05-18T22:00:00Z",
      "duration": "00:34:56.3890000",
      "explicit": false,
      "spotifyId": "1hMyJf6DX2h7wdPJOtZuWm",
      "appleId": 1000708923426,
      "youTubeId": "mxIVLZ7ZadE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1hMyJf6DX2h7wdPJOtZuWm",
        "apple": "https://podcasts.apple.com/podcast/the-philosophy-behind-cults-are-cult-leaders/id1775268858?i=1000708923426",
        "youtube": "https://www.youtube.com/watch?v=mxIVLZ7ZadE"
      }
    },
    {
      "id": "6dbd64da-7234-4ed3-a6eb-c7febb2a3fa1",
      "title": "Raised in the Children of God Cult: Medical Neglect, Ethics, and Cult Dynamics",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with Maria Esguerra, psychologist, advocate, and a cult survivor born and raised in the Children of God cult. Maria shares her experiences growing up in a highly controlled environment that limited her critical thinking and access to medical care. She discusses the psychological impact of her upbringing, the challenges of transitioning to the medical system after leaving the cult, and the importance of informed consent in medical ethics. Maria dives into the importance of motivational interviewing techniques in addressing cult dynamics, as well as the complexities of these types of relationship dynamics. Maria shares her advocacy work aimed at educating survivors and changing the narrative around their experiences, highlighting the need for empathy and understanding in discussions about cults and coercive groups. Maria\u0027s knowledge and awareness surrounding the complexity of the dynamics of coercive control brings an in-depth and critical look at the cult experience.\n\n\nTo follow and learn more about Maria Esguerra:\n\nhttps://linktr.ee/Mariaesguerra\n\nFollow DisAllusioned Podcast:\n\nTikTok:\nhttps://www.tiktok.com/@intrinsic_agency/       \n\nInstagram: \nhttps://www.instagram.com/disallusioned_podcast/\n\nFollow Intrinsic Agency:\n\nInstagram: \nhttps://www.instagram.com/intrinsicagency  \n\n\n#cultsurvivor #childrenofgod #cult #cultrecovery #cultawareness #psychology #coercivecontrol",
      "release": "2025-05-11T22:00:52Z",
      "duration": "01:37:19.8410000",
      "explicit": true,
      "spotifyId": "4mhLTzL4cELHj0j6BPCGTA",
      "appleId": 1000708035602,
      "youTubeId": "tRnV8yK5PiM",
      "subjects": [
        "Children Of God",
        "Cult Psychology",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mhLTzL4cELHj0j6BPCGTA",
        "apple": "https://podcasts.apple.com/podcast/raised-in-the-children-of-god-cult-medical/id1775268858?i=1000708035602",
        "youtube": "https://www.youtube.com/watch?v=tRnV8yK5PiM"
      }
    },
    {
      "id": "fd3917d8-54e2-4d38-a078-b617587c2381",
      "title": "The Philosophy Behind Cults: Exploring Authority and Autonomy in Relation to the Cult Experience",
      "description": "In the first episode of DisAllusioned Podcast season 2, host Ari Sherwood introduces a new series, The Philosophy Behind Cults. The conversation dives into the philosophy of authority and autonomy, examining what constitutes legitimate authority and how it relates to personal freedom. Ari shares insights from her academic background and personal journey as a cult survivor, discussing the complexities of autonomy, coercion, and emotional influence in decision-making. This episode emphasizes the importance of understanding these dynamics for personal recovery and empowerment. \n\nAs season 2 continues, Ari will focus on addressing fundamental philosophical questions; Can a person autonomously join a cult? What makes authority legitimate? How do we define authority and autonomy, and why does this matter? She will further highlight the various philosophical perspectives of authority, autonomy, and moral reasoning. \n\nSubscribe to DisAllusioned Podcast for some compelling and thought provoking interviews with cult survivors who are currently using their voices and autonomy to speak out about the truth of cult dynamics. \n\nFollow DisAllusioned Podcast: \n\nTikTok:\n https://www.tiktok.com/@intrinsic_agency     \n\nInstagram: \nhttps://www.instagram.com/disallusioned_podcast \n\nFollow Intrinsic Agency:\n\nInstagram: \nhttps://www.instagram.com/intrinsicagency\n\nJeremy Waldron\u0027s Law and Disagreement Book:\n\nhttps://www.amazon.com/Law-Disagreement-Jeremy-Waldron/dp/0199243034\n\nAntonio Damasio\u0027s Descartes\u0027 Error Book:\n\nhttps://www.amazon.com/Descartes-Error-Emotion-Reason-Human/dp/014303622X\n\nCult Survivor Resources:\n\nISCA:\nhttps://www.icsahome.com/\n\nPeople Leave Cults:\nhttps://www.peopleleavecults.com/\n\nCult Recovery 101:\nhttps://cultrecovery101.com/\n\nLalich Center:\nhttps://www.lalichcenter.org/\n\nDecult:\nhttps://decult.net/\n\nFreedom Train Project:\nhttps://thefreedomtrainproject.org/\n\n\n\n#podcast #cultsurvivor #philosophy #authority #autonomy #criticalthinking #coercivecontrol #manipulation #sophist #freewill #cults #selfsovereignty",
      "release": "2025-05-04T22:00:36Z",
      "duration": "00:18:06.9260000",
      "explicit": true,
      "spotifyId": "5L9AVydAaEgCpjNVTOAjm1",
      "appleId": 1000706266605,
      "youTubeId": "Vj2r36CQJbU",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5L9AVydAaEgCpjNVTOAjm1",
        "apple": "https://podcasts.apple.com/podcast/the-philosophy-behind-cults-exploring-authority/id1775268858?i=1000706266605",
        "youtube": "https://www.youtube.com/watch?v=Vj2r36CQJbU"
      }
    },
    {
      "id": "a5cecba1-d09f-4717-b17e-96f6b3a1baf4",
      "title": "Exploitation and Coercion: Knights of the Crystal Blade, Dan Schneider, and P. Diddy",
      "description": "In this episode of DisAllusioned Podcast, host Ari Sherwood and guest Jay delve into the disturbing world of cults, focusing on the Knights of the Crystal Blade, a family cult involved in child grooming and abuse. They discuss the implications of child marriage laws, the cycle of abuse that perpetuates through generations, and the coercive control tactics used by cult leaders. The conversation also touches on the influence of celebrity culture on abuse, particularly in the context of high-profile figures like P Diddy and Nickelodeon producer Dan Schneider. Ari Sherwood and Jay explore the themes of autonomy and coercive control. They discuss the healing process after leaving controlling environments and the societal narratives that contribute to grooming and victim blaming. Ultimately, they emphasize the need for awareness, the importance of education in preventing abuse, and the power of community in creating positive change and collective action.",
      "release": "2025-02-02T23:00:00Z",
      "duration": "01:23:19.4650000",
      "explicit": true,
      "spotifyId": "3ZduqWijrYAes2SuWB5EOm",
      "appleId": 1000688341890,
      "youTubeId": "tWD2D9v-0CM",
      "subjects": [
        "Knights of The Crystal Blade",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ZduqWijrYAes2SuWB5EOm",
        "apple": "https://podcasts.apple.com/podcast/exploitation-and-coercion-knights-of-the-crystal/id1775268858?i=1000688341890",
        "youtube": "https://www.youtube.com/watch?v=tWD2D9v-0CM"
      }
    },
    {
      "id": "03a3a32e-d9fd-43e2-9056-2b67a4ddac11",
      "title": "Manipulation in Research: Unmasking Twin Flame Universe MAP Therapy",
      "description": "Ari Sherwood critically examines the claims made by the Mind Alignment Process (MAP) therapy associated with the Twin Flame Universe. She highlights the importance of identifying red flags in therapy claims, evaluating the validity of research, and understanding the implications of legal disclaimers. The discussion emphasizes the need for skepticism in mental health practices and the dangers of manipulative healing methods. She discusses the need for transparency in research and the significance of ethical standards in mental health treatments. Through a detailed analysis of MAP\u0027s claims, Ari emphasizes the necessity of skepticism and informed decision-making when it comes to mental health therapies.",
      "release": "2025-01-26T23:06:05Z",
      "duration": "00:34:01.1260000",
      "explicit": true,
      "spotifyId": "1KMu72vDsDjsKBUXvOh2WJ",
      "appleId": 1000685552312,
      "youTubeId": "zgbbBTBqPF4",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KMu72vDsDjsKBUXvOh2WJ",
        "apple": "https://podcasts.apple.com/podcast/manipulation-in-research-unmasking-twin-flame-universe/id1775268858?i=1000685552312",
        "youtube": "https://www.youtube.com/watch?v=zgbbBTBqPF4"
      }
    },
    {
      "id": "60a0d604-5267-4684-bcd2-0f4d6c442140",
      "title": "From Jehovah\u0027s Witness to Filmmaker: A Discussion on Post Cult Societal Perspectives",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with filmmaker Scott Homan about his experiences growing up in the Jehovah\u0027s Witnesses and the impact of shunning and emotional abuse. They discuss the importance of critical thinking, the dynamics of cults, and the role of public speaking in these environments. The conversation also touches on the rise of cults in the digital age, personal experiences with relationships, and the systemic issues in maintaining an ethical society. They explore the deconstruction of beliefs, the nature of morality beyond religion, and the fear and control present in religious narratives. This conversation delves into the complex themes surrounding religion, cult dynamics, and the role of psychedelics and shamanism in personal and societal contexts.",
      "release": "2025-01-19T23:57:17Z",
      "duration": "02:52:55.7200000",
      "explicit": true,
      "spotifyId": "5JDcY1ggh4B04zRV2WjOVI",
      "appleId": 1000684620505,
      "youTubeId": "PDmQmL31eO4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JDcY1ggh4B04zRV2WjOVI",
        "apple": "https://podcasts.apple.com/podcast/from-jehovahs-witness-to-filmmaker-a-discussion-on/id1775268858?i=1000684620505",
        "youtube": "https://www.youtube.com/watch?v=PDmQmL31eO4"
      }
    },
    {
      "id": "fa4ab76d-9fcb-40da-8443-42ca711d753a",
      "title": "Swindled by Faith: Surviving the Move",
      "description": "In this episode of DisAllusioned Podcast, host Ari Sherwood speaks with Richard Kiers, author of Swindled by Faith, cult survivor, and advocate, about his experiences in The Move, a cult he was raised in. Richard shares insights into the origins of the cult, the recruitment process, and the harsh realities of life inside the group, including child labor and the impact of authoritarian control. He discusses the struggles faced after leaving the cult, the importance of community support, and the need for awareness and advocacy against cults. He touches on the exploitation and trafficking of individuals within cults, particularly women and children, and the role of social media in fostering connections and raising awareness. This conversation delves into the complex issues surrounding cults, including their impact on personal identity, the lack of legislation addressing cult behaviors, and the importance of education in preventing exploitation. Richard shares his journey of writing a book about his experiences in a cult and the advocacy work he has undertaken to support others who have faced similar challenges. He emphasizes the importance of community support, the impact of family dynamics on healing, and the need for education and awareness regarding the vulnerabilities of children and individuals in abusive situations.\n\nBuy Richard\u0027s book:\nhttps://www.amazon.ca/dp/0228815088/ref=tsm_1_fb_lk\n\nRichard\u0027s cult survivor Facebook support group:\nhttps://www.facebook.com/share/g/19av49cteB/",
      "release": "2025-01-05T23:00:14Z",
      "duration": "01:19:29.6800000",
      "explicit": true,
      "spotifyId": "5s1SLiVyWFuqEMZMwKJBrK",
      "appleId": 1000682790909,
      "youTubeId": "P5cuLTy3SBc",
      "subjects": [
        "The Move Of God",
        "Human Trafficking",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5s1SLiVyWFuqEMZMwKJBrK",
        "apple": "https://podcasts.apple.com/podcast/swindled-by-faith-surviving-the-move/id1775268858?i=1000682790909",
        "youtube": "https://www.youtube.com/watch?v=P5cuLTy3SBc"
      }
    },
    {
      "id": "c919e438-489b-4e3e-af68-e67c2a302f9a",
      "title": "The Truth That Heals: From Cult to Creativity",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with Ryan Anthony Hernandez, a survivor of a Catholic cult ran by Edgardo Arellano, and the host of The Truth That Heals Podcast and Creativity Worth Expressing. Ryan shares his harrowing journey of being drawn into the cult at the age of 17, the manipulative tactics used to control members, and the psychological and emotional toll it took on him. He discusses the emotional and psychological toll of cult life, the challenges of leaving, and the importance of reconnecting with family. also highlights his current projects, including his podcast, which aims to provide a platform for healing and sharing personal truths, as well as a new initiative focused on creativity and self-expression. The conversation emphasizes the significance of hope, healing, and the journey of rediscovering oneself after leaving a cult . https://linktr.ee/truththathealspod",
      "release": "2024-12-29T23:00:00Z",
      "duration": "00:58:19.7110000",
      "explicit": true,
      "spotifyId": "2lU5ezOmzdkWTJcPimyiN2",
      "appleId": 1000682063531,
      "youTubeId": "VH2CGOK_8LA",
      "subjects": [
        "Alliance of the Holy Family International",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2lU5ezOmzdkWTJcPimyiN2",
        "apple": "https://podcasts.apple.com/podcast/the-truth-that-heals-from-cult-to-creativity/id1775268858?i=1000682063531",
        "youtube": "https://www.youtube.com/watch?v=VH2CGOK_8LA"
      }
    },
    {
      "id": "0ec2ac9f-cdeb-47eb-a4e5-419a1f872893",
      "title": "Cults, High Control Religions, and Implications on People with Disabilities and Medical Conditions",
      "description": "In this episode of the Disillusioned Podcast, host Ari Sherwood shares her personal journey with a rare genetic condition, hereditary neuralgic amyotrophy, and reflects on the implications of growing up in an evangelical environment and later being involved in a cult. She discusses the challenges of accessing medical care, the impact of cult beliefs on health, and the rights of children to receive necessary medical treatment. Ari emphasizes the importance of understanding the struggles faced by disabled individuals and advocates for their rights to proper healthcare. She delves into the implications of cults on individuals with disabilities, exploring themes of medical ethics and the tragic consequences of religious beliefs on health. The conversation highlights the lack of accessibility in cult recovery, the ethical dilemmas faced by medical professionals when religious beliefs conflict with patient care, and the alarming statistics surrounding child fatalities due to religious medical neglect. Ari emphasizes the need for greater awareness and education on these issues, particularly regarding the impact of high control religions on health and well-being.",
      "release": "2024-12-22T23:00:00Z",
      "duration": "00:25:27.1290000",
      "explicit": true,
      "spotifyId": "6ZHsWF2deBrgQnZP9oq4gm",
      "appleId": 1000681345241,
      "youTubeId": "TIZOnXzTJ_c",
      "subjects": [
        "Jeffrey Pierce",
        "Evangelicalism",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ZHsWF2deBrgQnZP9oq4gm",
        "apple": "https://podcasts.apple.com/podcast/cults-high-control-religions-and-implications-on/id1775268858?i=1000681345241",
        "youtube": "https://www.youtube.com/watch?v=TIZOnXzTJ_c"
      }
    },
    {
      "id": "40c9897a-bd0d-4839-b4b8-c3bd245637ba",
      "title": "Breaking Free from the House of Yahweh: From Cult to Recovery",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with Melody, Cohost of Cultimatum Podcast, cult survivor advocate, and a former member of the House of Yahweh cult. Melody shares her personal journey into the cult, her experiences with multiple marriages, and the challenges she faced while leaving and recovering from the cult\u0027s influence. The conversation delves into the dynamics of cults, the importance of community support, and the ongoing process of healing and finding one\u0027s identity after such experiences. Melody emphasizes the the power of sharing stories in your own healing journey and to help others navigate similar situations.",
      "release": "2024-12-08T23:00:00Z",
      "duration": "01:06:40.9370000",
      "explicit": false,
      "spotifyId": "64Yn5Vz0oNY8KubeB43buh",
      "appleId": 1000679683321,
      "youTubeId": "eP9Ls8TEQ2A",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64Yn5Vz0oNY8KubeB43buh",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-from-the-house-of-yahweh-from-cult-to-recovery/id1775268858?i=1000679683321",
        "youtube": "https://www.youtube.com/watch?v=eP9Ls8TEQ2A"
      }
    },
    {
      "id": "7b6bbbc7-7dab-4364-b246-0fbcbfacd206",
      "title": "Evolutionary Perspectives of Religiosity: Prosocial Cooperation, Environment, and Fascism",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood and guest Jay delve into the complex interplay between evolution, cult dynamics, and religiosity. They explore how critical thinking and education can help individuals recognize and escape cult-like environments, the role of schizotypal personalities in communities, and the evolutionary advantages of pro-social behavior. The conversation also touches on the impact of environment on genetic expression, the dangers of misinformation, and the importance of questioning belief systems. Ultimately, they emphasize the need for open dialogue and diverse perspectives in understanding human behavior and societal structures.",
      "release": "2024-12-01T23:00:00Z",
      "duration": "01:15:30.5150000",
      "explicit": true,
      "spotifyId": "2pabeHd2DNjpDzuIK6AFlL",
      "appleId": 1000678827179,
      "youTubeId": "rGVtJyl8ENE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2pabeHd2DNjpDzuIK6AFlL",
        "apple": "https://podcasts.apple.com/podcast/evolutionary-perspectives-of-religiosity-prosocial/id1775268858?i=1000678827179",
        "youtube": "https://www.youtube.com/watch?v=rGVtJyl8ENE"
      }
    },
    {
      "id": "21ced844-2f40-4edc-b71e-b7e3383521e4",
      "title": "Episode 5- Religious Trauma to Activism: Evangelicalism and Justice for Survivors of DV and SA",
      "description": "Joy and Philip Hoover, co-founders of Esoes Cosmetics, share their journey of creating innovative safety solutions for women and discuss the impact of evangelical ideology on their beliefs and actions. They discuss their journey through the deconstruction of their fundamental evangelical beliefs after a life altering tragedy had struck their family. On April 10, 2013, Phil’s mother and brother, Marcia and Charles Hoover, were murdered by Phil’s dad, Charles Mark Hoover, who proceeded to commit suicide immediately after.\nJoy and Phil’s experiences with violence against women were life changing, and motivated them to search for a solution to end the violence that women face at large. Joy was inspired to create an innovative solution, a tech enabled lipstick with a built in roofie test strip and panic button that automatically notifies and sends police to your location.  They delve into their experiences working with survivors of violence, sex workers, and the challenges of autonomy and agency within evangelical systems. The conversation covers a wide range of topics related to domestic violence, religious oppression, mental health, and feminism.\n\nhttps://www.ifundwomen.com/projects/esoes-sos-cosmetics-personal-safety-cosmetics",
      "release": "2024-11-24T23:00:42Z",
      "duration": "01:16:46",
      "explicit": true,
      "spotifyId": "20kfjVFBzuD3gDLq62g6fS",
      "appleId": 1000678097100,
      "youTubeId": "uJ92zlMasac",
      "subjects": [
        "Evangelicalism",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20kfjVFBzuD3gDLq62g6fS",
        "apple": "https://podcasts.apple.com/podcast/from-religious-trauma-to-activism-evangelicalism-and/id1775268858?i=1000678097100",
        "youtube": "https://www.youtube.com/watch?v=uJ92zlMasac"
      }
    },
    {
      "id": "162439ed-d0e0-4b14-bf18-b852257cdf90",
      "title": "Doomsday Cult Survivors Reunite and Discuss",
      "description": "In this episode of the Dissolution Podcast, host Ari Sherwood is joined by Kelsey and Abby to discuss their experiences in a shamanic doomsday cult led by Jeffrey Pierce. The conversation explores the blurred lines between belief and manipulation within the cult, as well as the impact of these experiences on their lives.  \n\nIn this segment of the conversation, the speakers dive into the credibility of testimonies surrounding him, and the impact of hypnotherapy. They explore themes of fear, control, and manipulation within relationships, particularly in the context of cult dynamics. The speakers reflect on their shared experiences and the importance of bringing these issues to light, especially concerning the influence of cult-like structures on new generations.  They share personal experiences of how relationships were manipulated under the guise of spiritual connections, the fear instilled in members, and the struggle to reclaim their independence after leaving the cult. The discussion also touches on the impact of cult involvement on family dynamics and the similarities between cult leaders and con artists. They discuss the therapeutic nature of their conversations, highlighting the importance of shared experiences in processing their past.",
      "release": "2024-11-10T23:00:01Z",
      "duration": "01:48:47",
      "explicit": true,
      "spotifyId": "1BGdp6Y7QsjLB81qbo2mZh",
      "appleId": 1000676409596,
      "youTubeId": "-5-S-qRir2E",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1BGdp6Y7QsjLB81qbo2mZh",
        "apple": "https://podcasts.apple.com/podcast/doomsday-cult-survivors-reunite-and-discuss/id1775268858?i=1000676409596",
        "youtube": "https://www.youtube.com/watch?v=-5-S-qRir2E"
      }
    },
    {
      "id": "1c261e2a-cffc-43eb-9555-0bcf8be5b3ce",
      "title": "Episode 3- The Doomsday Trap: Recruitment and Escape from Fear Based Ideologies",
      "description": "Abby shares her experience of being recruited into a cult led by Jeff Pierce, a shamanic cult leader. This resulted in her moving to the mountains of Tennessee in fear of dooms day, December 21st, 2012. She discusses her belief in a coming shift in the world and how she was drawn to Jeff\u0027s teachings and predictions. Abby gives her account of the manipulation and front-loading tactics used by Jeff to gain followers, reflecting on her journey of questioning and leaving the cult. Subsequently this leads to her involvement in other groups and conspiracies later on, highlighting the influence cult dynamics can have years later. Abby emphasizes the importance of learning to trust herself and her journey to understanding her autonomy and agency.\n\n\nemail: disallusionedpodcast@gmail.com",
      "release": "2024-11-03T23:00:24Z",
      "duration": "01:05:33",
      "explicit": true,
      "spotifyId": "6VVNyoHwZOSewXomEQmVvo",
      "appleId": 1000675542731,
      "youTubeId": "d8ZnJWRHp-o",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6VVNyoHwZOSewXomEQmVvo",
        "apple": "https://podcasts.apple.com/podcast/the-doomsday-trap-recruitment-and-escape-from-fear/id1775268858?i=1000675542731",
        "youtube": "https://www.youtube.com/watch?v=d8ZnJWRHp-o"
      }
    },
    {
      "id": "4f13525e-d603-4709-9837-572317b13444",
      "title": "Episode 2: Fleeing to the Mountains and Arranged Soulmates",
      "description": "In this episode of the Disallusioned Podcast, host Ari Sherwood and guest Kelsey Kay delve into Kelsey\u0027s harrowing experience as a survivor of a shamanic doomsday cult. They discuss Kelsey\u0027s recruitment, the indoctrination process, the cult\u0027s doomsday beliefs, and the manipulation tactics employed by the cult leader. Kelsey shares her journey of moving to Tennessee, her uncomfortable marriage, and the psychological and emotional turmoil she faced. The conversation highlights the complexities of relationships within the cult, the use of sex as a tool for control, and the eventual fallout that led to Kelsey\u0027s escape and reconnection with Ari after years of separation. In this conversation, Ari Sherwood and Kelsey dive into their experiences within a cult, exploring the long-lasting effects of manipulation, abuse, and the struggle to reclaim their identities. They discuss the complexities of spiritual teachings, the impact of trauma, and the importance of trusting one\u0027s intuition. This episode emphasizes the need for awareness and understanding of cult dynamics, as well as the journey towards healing and personal growth.",
      "release": "2024-10-27T22:00:13Z",
      "duration": "01:13:39",
      "explicit": true,
      "spotifyId": "7mKK4Vg8A3MobXrgAhTfzW",
      "appleId": 1000674638917,
      "youTubeId": "UidzqFUstlU",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7mKK4Vg8A3MobXrgAhTfzW",
        "apple": "https://podcasts.apple.com/podcast/fleeing-to-the-mountains-and-arranged-soulmates/id1775268858?i=1000674638917",
        "youtube": "https://www.youtube.com/watch?v=UidzqFUstlU"
      }
    },
    {
      "id": "6a2d1997-dd79-4201-a5b2-043f019d32f5",
      "title": "I Married a Cult Leader",
      "description": "In this episode of Disallusioned Podcast, host Ari Sherwood shares a deeply personal account of her experience in a cult led by Jeffrey Pierce. Starting from her search for spiritual fulfillment after leaving Christianity, Ari recounts how she was drawn into the cult\u0027s teachings, the manipulative tactics used by Pierce, and the eventual realization of the control she was under. The conversation explores themes of brainwashing, doomsday prophecies, and the struggle for personal autonomy. Ari reflects on her journey of recovery and the importance of sharing her story to help others who may be in similar situations.",
      "release": "2024-10-20T22:00:09Z",
      "duration": "00:41:19.3330000",
      "explicit": true,
      "spotifyId": "3S95Olg49gVi9Wp0SkHltg",
      "appleId": 1000673905627,
      "youTubeId": "GDN7bsJzLQI",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3S95Olg49gVi9Wp0SkHltg",
        "apple": "https://podcasts.apple.com/podcast/i-married-a-cult-leader/id1775268858?i=1000673905627",
        "youtube": "https://www.youtube.com/watch?v=GDN7bsJzLQI"
      }
    }
  ]
}