{
  "_ts": 0,
  "id": "2db6cc36-03d4-462c-97f2-8f540b39db6b",
  "name": "DisAllusioned",
  "spotifyId": "23003VjLo8FMUeMCzZ4cNE",
  "appleId": 1775268858,
  "youTubeChannelId": "UCW52Qu18NF4yCg0Bm-4ksdQ",
  "episodes": [
    {
      "id": "a5cecba1-d09f-4717-b17e-96f6b3a1baf4",
      "title": "Exploitation and Coercion: Knights of the Crystal Blade, Dan Schneider, and P. Diddy",
      "description": "In this episode of DisAllusioned Podcast, host Ari Sherwood and guest Jay delve into the disturbing world of cults, focusing on the Knights of the Crystal Blade, a family cult involved in child grooming and abuse. They discuss the implications of child marriage laws, the cycle of abuse that perpetuates through generations, and the coercive control tactics used by cult leaders. The conversation also touches on the influence of celebrity culture on abuse, particularly in the context of high-profile figures like P Diddy and Nickelodeon producer Dan Schneider. Ari Sherwood and Jay explore the themes of autonomy and coercive control. They discuss the healing process after leaving controlling environments and the societal narratives that contribute to grooming and victim blaming. Ultimately, they emphasize the need for awareness, the importance of education in preventing abuse, and the power of community in creating positive change and collective action.",
      "release": "2025-02-02T23:00:00Z",
      "duration": "01:23:19.4650000",
      "explicit": true,
      "spotifyId": "3ZduqWijrYAes2SuWB5EOm",
      "appleId": 1000688341890,
      "youTubeId": "tWD2D9v-0CM",
      "subjects": [
        "Knights of The Crystal Blade",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ZduqWijrYAes2SuWB5EOm",
        "apple": "https://podcasts.apple.com/podcast/exploitation-and-coercion-knights-of-the-crystal/id1775268858?i=1000688341890",
        "youtube": "https://www.youtube.com/watch?v=tWD2D9v-0CM"
      }
    },
    {
      "id": "03a3a32e-d9fd-43e2-9056-2b67a4ddac11",
      "title": "Manipulation in Research: Unmasking Twin Flame Universe MAP Therapy",
      "description": "Ari Sherwood critically examines the claims made by the Mind Alignment Process (MAP) therapy associated with the Twin Flame Universe. She highlights the importance of identifying red flags in therapy claims, evaluating the validity of research, and understanding the implications of legal disclaimers. The discussion emphasizes the need for skepticism in mental health practices and the dangers of manipulative healing methods. She discusses the need for transparency in research and the significance of ethical standards in mental health treatments. Through a detailed analysis of MAP\u0027s claims, Ari emphasizes the necessity of skepticism and informed decision-making when it comes to mental health therapies.",
      "release": "2025-01-26T23:06:05Z",
      "duration": "00:34:01.1260000",
      "explicit": true,
      "spotifyId": "1KMu72vDsDjsKBUXvOh2WJ",
      "appleId": 1000685552312,
      "youTubeId": "zgbbBTBqPF4",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KMu72vDsDjsKBUXvOh2WJ",
        "apple": "https://podcasts.apple.com/podcast/manipulation-in-research-unmasking-twin-flame-universe/id1775268858?i=1000685552312",
        "youtube": "https://www.youtube.com/watch?v=zgbbBTBqPF4"
      }
    },
    {
      "id": "60a0d604-5267-4684-bcd2-0f4d6c442140",
      "title": "From Jehovah\u0027s Witness to Filmmaker: A Discussion on Post Cult Societal Perspectives",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with filmmaker Scott Homan about his experiences growing up in the Jehovah\u0027s Witnesses and the impact of shunning and emotional abuse. They discuss the importance of critical thinking, the dynamics of cults, and the role of public speaking in these environments. The conversation also touches on the rise of cults in the digital age, personal experiences with relationships, and the systemic issues in maintaining an ethical society. They explore the deconstruction of beliefs, the nature of morality beyond religion, and the fear and control present in religious narratives. This conversation delves into the complex themes surrounding religion, cult dynamics, and the role of psychedelics and shamanism in personal and societal contexts.",
      "release": "2025-01-19T23:57:17Z",
      "duration": "02:52:55.7200000",
      "explicit": true,
      "spotifyId": "5JDcY1ggh4B04zRV2WjOVI",
      "appleId": 1000684620505,
      "youTubeId": "PDmQmL31eO4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JDcY1ggh4B04zRV2WjOVI",
        "apple": "https://podcasts.apple.com/podcast/from-jehovahs-witness-to-filmmaker-a-discussion-on/id1775268858?i=1000684620505",
        "youtube": "https://www.youtube.com/watch?v=PDmQmL31eO4"
      }
    },
    {
      "id": "fa4ab76d-9fcb-40da-8443-42ca711d753a",
      "title": "Swindled by Faith: Surviving the Move",
      "description": "In this episode of DisAllusioned Podcast, host Ari Sherwood speaks with Richard Kiers, author of Swindled by Faith, cult survivor, and advocate, about his experiences in The Move, a cult he was raised in. Richard shares insights into the origins of the cult, the recruitment process, and the harsh realities of life inside the group, including child labor and the impact of authoritarian control. He discusses the struggles faced after leaving the cult, the importance of community support, and the need for awareness and advocacy against cults. He touches on the exploitation and trafficking of individuals within cults, particularly women and children, and the role of social media in fostering connections and raising awareness. This conversation delves into the complex issues surrounding cults, including their impact on personal identity, the lack of legislation addressing cult behaviors, and the importance of education in preventing exploitation. Richard shares his journey of writing a book about his experiences in a cult and the advocacy work he has undertaken to support others who have faced similar challenges. He emphasizes the importance of community support, the impact of family dynamics on healing, and the need for education and awareness regarding the vulnerabilities of children and individuals in abusive situations.\n\nBuy Richard\u0027s book:\nhttps://www.amazon.ca/dp/0228815088/ref=tsm_1_fb_lk\n\nRichard\u0027s cult survivor Facebook support group:\nhttps://www.facebook.com/share/g/19av49cteB/",
      "release": "2025-01-05T23:00:14Z",
      "duration": "01:19:29.6800000",
      "explicit": true,
      "spotifyId": "5s1SLiVyWFuqEMZMwKJBrK",
      "appleId": 1000682790909,
      "youTubeId": "P5cuLTy3SBc",
      "subjects": [
        "The Move Of God",
        "Human Trafficking",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5s1SLiVyWFuqEMZMwKJBrK",
        "apple": "https://podcasts.apple.com/podcast/swindled-by-faith-surviving-the-move/id1775268858?i=1000682790909",
        "youtube": "https://www.youtube.com/watch?v=P5cuLTy3SBc"
      }
    },
    {
      "id": "c919e438-489b-4e3e-af68-e67c2a302f9a",
      "title": "The Truth That Heals: From Cult to Creativity",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with Ryan Anthony Hernandez, a survivor of a Catholic cult ran by Edgardo Arellano, and the host of The Truth That Heals Podcast and Creativity Worth Expressing. Ryan shares his harrowing journey of being drawn into the cult at the age of 17, the manipulative tactics used to control members, and the psychological and emotional toll it took on him. He discusses the emotional and psychological toll of cult life, the challenges of leaving, and the importance of reconnecting with family. also highlights his current projects, including his podcast, which aims to provide a platform for healing and sharing personal truths, as well as a new initiative focused on creativity and self-expression. The conversation emphasizes the significance of hope, healing, and the journey of rediscovering oneself after leaving a cult . https://linktr.ee/truththathealspod",
      "release": "2024-12-29T23:00:00Z",
      "duration": "00:58:19.7110000",
      "explicit": true,
      "spotifyId": "2lU5ezOmzdkWTJcPimyiN2",
      "appleId": 1000682063531,
      "youTubeId": "VH2CGOK_8LA",
      "subjects": [
        "Alliance of the Holy Family International",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2lU5ezOmzdkWTJcPimyiN2",
        "apple": "https://podcasts.apple.com/podcast/the-truth-that-heals-from-cult-to-creativity/id1775268858?i=1000682063531",
        "youtube": "https://www.youtube.com/watch?v=VH2CGOK_8LA"
      }
    },
    {
      "id": "0ec2ac9f-cdeb-47eb-a4e5-419a1f872893",
      "title": "Cults, High Control Religions, and Implications on People with Disabilities and Medical Conditions",
      "description": "In this episode of the Disillusioned Podcast, host Ari Sherwood shares her personal journey with a rare genetic condition, hereditary neuralgic amyotrophy, and reflects on the implications of growing up in an evangelical environment and later being involved in a cult. She discusses the challenges of accessing medical care, the impact of cult beliefs on health, and the rights of children to receive necessary medical treatment. Ari emphasizes the importance of understanding the struggles faced by disabled individuals and advocates for their rights to proper healthcare. She delves into the implications of cults on individuals with disabilities, exploring themes of medical ethics and the tragic consequences of religious beliefs on health. The conversation highlights the lack of accessibility in cult recovery, the ethical dilemmas faced by medical professionals when religious beliefs conflict with patient care, and the alarming statistics surrounding child fatalities due to religious medical neglect. Ari emphasizes the need for greater awareness and education on these issues, particularly regarding the impact of high control religions on health and well-being.",
      "release": "2024-12-22T23:00:00Z",
      "duration": "00:25:27.1290000",
      "explicit": true,
      "spotifyId": "6ZHsWF2deBrgQnZP9oq4gm",
      "appleId": 1000681345241,
      "youTubeId": "TIZOnXzTJ_c",
      "subjects": [
        "Jeffrey Pierce",
        "Evangelicalism",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ZHsWF2deBrgQnZP9oq4gm",
        "apple": "https://podcasts.apple.com/podcast/cults-high-control-religions-and-implications-on/id1775268858?i=1000681345241",
        "youtube": "https://www.youtube.com/watch?v=TIZOnXzTJ_c"
      }
    },
    {
      "id": "40c9897a-bd0d-4839-b4b8-c3bd245637ba",
      "title": "Breaking Free from the House of Yahweh: From Cult to Recovery",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood speaks with Melody, Cohost of Cultimatum Podcast, cult survivor advocate, and a former member of the House of Yahweh cult. Melody shares her personal journey into the cult, her experiences with multiple marriages, and the challenges she faced while leaving and recovering from the cult\u0027s influence. The conversation delves into the dynamics of cults, the importance of community support, and the ongoing process of healing and finding one\u0027s identity after such experiences. Melody emphasizes the the power of sharing stories in your own healing journey and to help others navigate similar situations.",
      "release": "2024-12-08T23:00:00Z",
      "duration": "01:06:40.9370000",
      "explicit": false,
      "spotifyId": "64Yn5Vz0oNY8KubeB43buh",
      "appleId": 1000679683321,
      "youTubeId": "eP9Ls8TEQ2A",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64Yn5Vz0oNY8KubeB43buh",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-from-the-house-of-yahweh-from-cult-to-recovery/id1775268858?i=1000679683321",
        "youtube": "https://www.youtube.com/watch?v=eP9Ls8TEQ2A"
      }
    },
    {
      "id": "7b6bbbc7-7dab-4364-b246-0fbcbfacd206",
      "title": "Evolutionary Perspectives of Religiosity: Prosocial Cooperation, Environment, and Fascism",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood and guest Jay delve into the complex interplay between evolution, cult dynamics, and religiosity. They explore how critical thinking and education can help individuals recognize and escape cult-like environments, the role of schizotypal personalities in communities, and the evolutionary advantages of pro-social behavior. The conversation also touches on the impact of environment on genetic expression, the dangers of misinformation, and the importance of questioning belief systems. Ultimately, they emphasize the need for open dialogue and diverse perspectives in understanding human behavior and societal structures.",
      "release": "2024-12-01T23:00:00Z",
      "duration": "01:15:30.5150000",
      "explicit": true,
      "spotifyId": "2pabeHd2DNjpDzuIK6AFlL",
      "appleId": 1000678827179,
      "youTubeId": "rGVtJyl8ENE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2pabeHd2DNjpDzuIK6AFlL",
        "apple": "https://podcasts.apple.com/podcast/evolutionary-perspectives-of-religiosity-prosocial/id1775268858?i=1000678827179",
        "youtube": "https://www.youtube.com/watch?v=rGVtJyl8ENE"
      }
    },
    {
      "id": "21ced844-2f40-4edc-b71e-b7e3383521e4",
      "title": "Episode 5- Religious Trauma to Activism: Evangelicalism and Justice for Survivors of DV and SA",
      "description": "Joy and Philip Hoover, co-founders of Esoes Cosmetics, share their journey of creating innovative safety solutions for women and discuss the impact of evangelical ideology on their beliefs and actions. They discuss their journey through the deconstruction of their fundamental evangelical beliefs after a life altering tragedy had struck their family. On April 10, 2013, Phil’s mother and brother, Marcia and Charles Hoover, were murdered by Phil’s dad, Charles Mark Hoover, who proceeded to commit suicide immediately after.\nJoy and Phil’s experiences with violence against women were life changing, and motivated them to search for a solution to end the violence that women face at large. Joy was inspired to create an innovative solution, a tech enabled lipstick with a built in roofie test strip and panic button that automatically notifies and sends police to your location.  They delve into their experiences working with survivors of violence, sex workers, and the challenges of autonomy and agency within evangelical systems. The conversation covers a wide range of topics related to domestic violence, religious oppression, mental health, and feminism.\n\nhttps://www.ifundwomen.com/projects/esoes-sos-cosmetics-personal-safety-cosmetics",
      "release": "2024-11-24T23:00:42Z",
      "duration": "01:16:46",
      "explicit": true,
      "spotifyId": "20kfjVFBzuD3gDLq62g6fS",
      "appleId": 1000678097100,
      "youTubeId": "uJ92zlMasac",
      "subjects": [
        "Evangelicalism",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20kfjVFBzuD3gDLq62g6fS",
        "apple": "https://podcasts.apple.com/podcast/from-religious-trauma-to-activism-evangelicalism-and/id1775268858?i=1000678097100",
        "youtube": "https://www.youtube.com/watch?v=uJ92zlMasac"
      }
    },
    {
      "id": "162439ed-d0e0-4b14-bf18-b852257cdf90",
      "title": "Doomsday Cult Survivors Reunite and Discuss",
      "description": "In this episode of the Dissolution Podcast, host Ari Sherwood is joined by Kelsey and Abby to discuss their experiences in a shamanic doomsday cult led by Jeffrey Pierce. The conversation explores the blurred lines between belief and manipulation within the cult, as well as the impact of these experiences on their lives.  \n\nIn this segment of the conversation, the speakers dive into the credibility of testimonies surrounding him, and the impact of hypnotherapy. They explore themes of fear, control, and manipulation within relationships, particularly in the context of cult dynamics. The speakers reflect on their shared experiences and the importance of bringing these issues to light, especially concerning the influence of cult-like structures on new generations.  They share personal experiences of how relationships were manipulated under the guise of spiritual connections, the fear instilled in members, and the struggle to reclaim their independence after leaving the cult. The discussion also touches on the impact of cult involvement on family dynamics and the similarities between cult leaders and con artists. They discuss the therapeutic nature of their conversations, highlighting the importance of shared experiences in processing their past.",
      "release": "2024-11-10T23:00:01Z",
      "duration": "01:48:47",
      "explicit": true,
      "spotifyId": "1BGdp6Y7QsjLB81qbo2mZh",
      "appleId": 1000676409596,
      "youTubeId": "-5-S-qRir2E",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1BGdp6Y7QsjLB81qbo2mZh",
        "apple": "https://podcasts.apple.com/podcast/doomsday-cult-survivors-reunite-and-discuss/id1775268858?i=1000676409596",
        "youtube": "https://www.youtube.com/watch?v=-5-S-qRir2E"
      }
    },
    {
      "id": "1c261e2a-cffc-43eb-9555-0bcf8be5b3ce",
      "title": "Episode 3- The Doomsday Trap: Recruitment and Escape from Fear Based Ideologies",
      "description": "Abby shares her experience of being recruited into a cult led by Jeff Pierce, a shamanic cult leader. This resulted in her moving to the mountains of Tennessee in fear of dooms day, December 21st, 2012. She discusses her belief in a coming shift in the world and how she was drawn to Jeff\u0027s teachings and predictions. Abby gives her account of the manipulation and front-loading tactics used by Jeff to gain followers, reflecting on her journey of questioning and leaving the cult. Subsequently this leads to her involvement in other groups and conspiracies later on, highlighting the influence cult dynamics can have years later. Abby emphasizes the importance of learning to trust herself and her journey to understanding her autonomy and agency.\n\n\nemail: disallusionedpodcast@gmail.com",
      "release": "2024-11-03T23:00:24Z",
      "duration": "01:05:33",
      "explicit": true,
      "spotifyId": "6VVNyoHwZOSewXomEQmVvo",
      "appleId": 1000675542731,
      "youTubeId": "d8ZnJWRHp-o",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6VVNyoHwZOSewXomEQmVvo",
        "apple": "https://podcasts.apple.com/podcast/the-doomsday-trap-recruitment-and-escape-from-fear/id1775268858?i=1000675542731",
        "youtube": "https://www.youtube.com/watch?v=d8ZnJWRHp-o"
      }
    },
    {
      "id": "4f13525e-d603-4709-9837-572317b13444",
      "title": "Episode 2: Fleeing to the Mountains and Arranged Soulmates",
      "description": "In this episode of the Disallusioned Podcast, host Ari Sherwood and guest Kelsey Kay delve into Kelsey\u0027s harrowing experience as a survivor of a shamanic doomsday cult. They discuss Kelsey\u0027s recruitment, the indoctrination process, the cult\u0027s doomsday beliefs, and the manipulation tactics employed by the cult leader. Kelsey shares her journey of moving to Tennessee, her uncomfortable marriage, and the psychological and emotional turmoil she faced. The conversation highlights the complexities of relationships within the cult, the use of sex as a tool for control, and the eventual fallout that led to Kelsey\u0027s escape and reconnection with Ari after years of separation. In this conversation, Ari Sherwood and Kelsey dive into their experiences within a cult, exploring the long-lasting effects of manipulation, abuse, and the struggle to reclaim their identities. They discuss the complexities of spiritual teachings, the impact of trauma, and the importance of trusting one\u0027s intuition. This episode emphasizes the need for awareness and understanding of cult dynamics, as well as the journey towards healing and personal growth.",
      "release": "2024-10-27T22:00:13Z",
      "duration": "01:13:39",
      "explicit": true,
      "spotifyId": "7mKK4Vg8A3MobXrgAhTfzW",
      "appleId": 1000674638917,
      "youTubeId": "UidzqFUstlU",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7mKK4Vg8A3MobXrgAhTfzW",
        "apple": "https://podcasts.apple.com/podcast/fleeing-to-the-mountains-and-arranged-soulmates/id1775268858?i=1000674638917",
        "youtube": "https://www.youtube.com/watch?v=UidzqFUstlU"
      }
    },
    {
      "id": "6a2d1997-dd79-4201-a5b2-043f019d32f5",
      "title": "I Married a Cult Leader",
      "description": "In this episode of Disallusioned Podcast, host Ari Sherwood shares a deeply personal account of her experience in a cult led by Jeffrey Pierce. Starting from her search for spiritual fulfillment after leaving Christianity, Ari recounts how she was drawn into the cult\u0027s teachings, the manipulative tactics used by Pierce, and the eventual realization of the control she was under. The conversation explores themes of brainwashing, doomsday prophecies, and the struggle for personal autonomy. Ari reflects on her journey of recovery and the importance of sharing her story to help others who may be in similar situations.",
      "release": "2024-10-20T22:00:09Z",
      "duration": "00:41:19.3330000",
      "explicit": true,
      "spotifyId": "3S95Olg49gVi9Wp0SkHltg",
      "appleId": 1000673905627,
      "youTubeId": "GDN7bsJzLQI",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3S95Olg49gVi9Wp0SkHltg",
        "apple": "https://podcasts.apple.com/podcast/i-married-a-cult-leader/id1775268858?i=1000673905627",
        "youtube": "https://www.youtube.com/watch?v=GDN7bsJzLQI"
      }
    }
  ]
}