{
  "_ts": 0,
  "id": "2db6cc36-03d4-462c-97f2-8f540b39db6b",
  "name": "DisAllusioned",
  "spotifyId": "23003VjLo8FMUeMCzZ4cNE",
  "appleId": 1775268858,
  "youTubeChannelId": "UCW52Qu18NF4yCg0Bm-4ksdQ",
  "episodes": [
    {
      "id": "7b6bbbc7-7dab-4364-b246-0fbcbfacd206",
      "title": "Evolutionary Perspectives of Religiosity: Prosocial Cooperation, Environment, and Fascism",
      "description": "In this episode of the DisAllusioned Podcast, host Ari Sherwood and guest Jay delve into the complex interplay between evolution, cult dynamics, and religiosity. They explore how critical thinking and education can help individuals recognize and escape cult-like environments, the role of schizotypal personalities in communities, and the evolutionary advantages of pro-social behavior. The conversation also touches on the impact of environment on genetic expression, the dangers of misinformation, and the importance of questioning belief systems. Ultimately, they emphasize the need for open dialogue and diverse perspectives in understanding human behavior and societal structures.",
      "release": "2024-12-01T23:00:00Z",
      "duration": "01:15:30.5150000",
      "explicit": true,
      "spotifyId": "2pabeHd2DNjpDzuIK6AFlL",
      "appleId": 1000678827179,
      "youTubeId": "rGVtJyl8ENE",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2pabeHd2DNjpDzuIK6AFlL",
        "apple": "https://podcasts.apple.com/podcast/evolutionary-perspectives-of-religiosity-prosocial/id1775268858?i=1000678827179",
        "youtube": "https://www.youtube.com/watch?v=rGVtJyl8ENE"
      }
    },
    {
      "id": "21ced844-2f40-4edc-b71e-b7e3383521e4",
      "title": "Episode 5- Religious Trauma to Activism: Evangelicalism and Justice for Survivors of DV and SA",
      "description": "Joy and Philip Hoover, co-founders of Esoes Cosmetics, share their journey of creating innovative safety solutions for women and discuss the impact of evangelical ideology on their beliefs and actions. They discuss their journey through the deconstruction of their fundamental evangelical beliefs after a life altering tragedy had struck their family. On April 10, 2013, Phil’s mother and brother, Marcia and Charles Hoover, were murdered by Phil’s dad, Charles Mark Hoover, who proceeded to commit suicide immediately after.\nJoy and Phil’s experiences with violence against women were life changing, and motivated them to search for a solution to end the violence that women face at large. Joy was inspired to create an innovative solution, a tech enabled lipstick with a built in roofie test strip and panic button that automatically notifies and sends police to your location.  They delve into their experiences working with survivors of violence, sex workers, and the challenges of autonomy and agency within evangelical systems. The conversation covers a wide range of topics related to domestic violence, religious oppression, mental health, and feminism.\n\nhttps://www.ifundwomen.com/projects/esoes-sos-cosmetics-personal-safety-cosmetics",
      "release": "2024-11-24T23:00:42Z",
      "duration": "01:16:46",
      "explicit": true,
      "spotifyId": "20kfjVFBzuD3gDLq62g6fS",
      "appleId": 1000678097100,
      "youTubeId": "uJ92zlMasac",
      "subjects": [
        "Evangelicalism",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20kfjVFBzuD3gDLq62g6fS",
        "apple": "https://podcasts.apple.com/podcast/from-religious-trauma-to-activism-evangelicalism-and/id1775268858?i=1000678097100",
        "youtube": "https://www.youtube.com/watch?v=uJ92zlMasac"
      }
    },
    {
      "id": "162439ed-d0e0-4b14-bf18-b852257cdf90",
      "title": "Doomsday Cult Survivors Reunite and Discuss",
      "description": "In this episode of the Dissolution Podcast, host Ari Sherwood is joined by Kelsey and Abby to discuss their experiences in a shamanic doomsday cult led by Jeffrey Pierce. The conversation explores the blurred lines between belief and manipulation within the cult, as well as the impact of these experiences on their lives.  \n\nIn this segment of the conversation, the speakers dive into the credibility of testimonies surrounding him, and the impact of hypnotherapy. They explore themes of fear, control, and manipulation within relationships, particularly in the context of cult dynamics. The speakers reflect on their shared experiences and the importance of bringing these issues to light, especially concerning the influence of cult-like structures on new generations.  They share personal experiences of how relationships were manipulated under the guise of spiritual connections, the fear instilled in members, and the struggle to reclaim their independence after leaving the cult. The discussion also touches on the impact of cult involvement on family dynamics and the similarities between cult leaders and con artists. They discuss the therapeutic nature of their conversations, highlighting the importance of shared experiences in processing their past.",
      "release": "2024-11-10T23:00:01Z",
      "duration": "01:48:47",
      "explicit": true,
      "spotifyId": "1BGdp6Y7QsjLB81qbo2mZh",
      "appleId": 1000676409596,
      "youTubeId": "-5-S-qRir2E",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1BGdp6Y7QsjLB81qbo2mZh",
        "apple": "https://podcasts.apple.com/podcast/doomsday-cult-survivors-reunite-and-discuss/id1775268858?i=1000676409596",
        "youtube": "https://www.youtube.com/watch?v=-5-S-qRir2E"
      }
    },
    {
      "id": "1c261e2a-cffc-43eb-9555-0bcf8be5b3ce",
      "title": "Episode 3- The Doomsday Trap: Recruitment and Escape from Fear Based Ideologies",
      "description": "Abby shares her experience of being recruited into a cult led by Jeff Pierce, a shamanic cult leader. This resulted in her moving to the mountains of Tennessee in fear of dooms day, December 21st, 2012. She discusses her belief in a coming shift in the world and how she was drawn to Jeff\u0027s teachings and predictions. Abby gives her account of the manipulation and front-loading tactics used by Jeff to gain followers, reflecting on her journey of questioning and leaving the cult. Subsequently this leads to her involvement in other groups and conspiracies later on, highlighting the influence cult dynamics can have years later. Abby emphasizes the importance of learning to trust herself and her journey to understanding her autonomy and agency.\n\n\nemail: disallusionedpodcast@gmail.com",
      "release": "2024-11-03T23:00:24Z",
      "duration": "01:05:33",
      "explicit": true,
      "spotifyId": "6VVNyoHwZOSewXomEQmVvo",
      "appleId": 1000675542731,
      "youTubeId": "d8ZnJWRHp-o",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6VVNyoHwZOSewXomEQmVvo",
        "apple": "https://podcasts.apple.com/podcast/the-doomsday-trap-recruitment-and-escape-from-fear/id1775268858?i=1000675542731",
        "youtube": "https://www.youtube.com/watch?v=d8ZnJWRHp-o"
      }
    },
    {
      "id": "4f13525e-d603-4709-9837-572317b13444",
      "title": "Episode 2: Fleeing to the Mountains and Arranged Soulmates",
      "description": "In this episode of the Disallusioned Podcast, host Ari Sherwood and guest Kelsey Kay delve into Kelsey\u0027s harrowing experience as a survivor of a shamanic doomsday cult. They discuss Kelsey\u0027s recruitment, the indoctrination process, the cult\u0027s doomsday beliefs, and the manipulation tactics employed by the cult leader. Kelsey shares her journey of moving to Tennessee, her uncomfortable marriage, and the psychological and emotional turmoil she faced. The conversation highlights the complexities of relationships within the cult, the use of sex as a tool for control, and the eventual fallout that led to Kelsey\u0027s escape and reconnection with Ari after years of separation. In this conversation, Ari Sherwood and Kelsey dive into their experiences within a cult, exploring the long-lasting effects of manipulation, abuse, and the struggle to reclaim their identities. They discuss the complexities of spiritual teachings, the impact of trauma, and the importance of trusting one\u0027s intuition. This episode emphasizes the need for awareness and understanding of cult dynamics, as well as the journey towards healing and personal growth.",
      "release": "2024-10-27T22:00:13Z",
      "duration": "01:13:39",
      "explicit": true,
      "spotifyId": "7mKK4Vg8A3MobXrgAhTfzW",
      "appleId": 1000674638917,
      "youTubeId": "UidzqFUstlU",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7mKK4Vg8A3MobXrgAhTfzW",
        "apple": "https://podcasts.apple.com/podcast/fleeing-to-the-mountains-and-arranged-soulmates/id1775268858?i=1000674638917",
        "youtube": "https://www.youtube.com/watch?v=UidzqFUstlU"
      }
    },
    {
      "id": "6a2d1997-dd79-4201-a5b2-043f019d32f5",
      "title": "I Married a Cult Leader",
      "description": "In this episode of Disallusioned Podcast, host Ari Sherwood shares a deeply personal account of her experience in a cult led by Jeffrey Pierce. Starting from her search for spiritual fulfillment after leaving Christianity, Ari recounts how she was drawn into the cult\u0027s teachings, the manipulative tactics used by Pierce, and the eventual realization of the control she was under. The conversation explores themes of brainwashing, doomsday prophecies, and the struggle for personal autonomy. Ari reflects on her journey of recovery and the importance of sharing her story to help others who may be in similar situations.",
      "release": "2024-10-20T22:00:09Z",
      "duration": "00:41:19.3330000",
      "explicit": true,
      "spotifyId": "3S95Olg49gVi9Wp0SkHltg",
      "appleId": 1000673905627,
      "youTubeId": "GDN7bsJzLQI",
      "subjects": [
        "Jeffrey Pierce"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3S95Olg49gVi9Wp0SkHltg",
        "apple": "https://podcasts.apple.com/podcast/i-married-a-cult-leader/id1775268858?i=1000673905627",
        "youtube": "https://www.youtube.com/watch?v=GDN7bsJzLQI"
      }
    }
  ]
}