{
  "_ts": 0,
  "id": "48ff73c5-ec04-4563-8c09-b7d0320cb3d3",
  "name": "Disabuse Podcast",
  "youTubeChannelId": "UCugSH15fd-6J8Qs__Ze_5mw",
  "episodes": [
    {
      "id": "83197d6e-dfb6-428d-b675-c1debf8ca7a8",
      "title": "Ravi Zacharias, Abuse, \u0026amp; Institutional Betrayal | Disabuse Podcast EP #6",
      "description": "How do faith communities become safe spaces rather than breeding grounds for abuse and deception?\n \nIn this episode of the Disabuse Podcast, Randal Rauser sits down with lawyer and investigative author Steve Baughman, one of the first voices to expose the troubling truth about Ravi Zacharias. For years, Steve faced skepticism and pushback, but his work in uncovering fraudulent credentials, manipulation, and institutional cover-ups proved essential in forcing the conversation about abuse in religious institutions.\n \n🔎 Key Topics Discussed:\n- The red flags that exposed Ravi Zacharias\u0027 deception\n- Institutional naivety vs. willful ignorance in church leadership\n- How predators manipulate credentials and exploit trust\n- The role of investigative scrutiny in preventing future abuse\n\nThis is a conversation about accountability, justice, and what it means to be a good Berean—to critically examine those in power rather than blindly trust authority.\n \n📖 Disabuse: A Guide to Confronting Abuse in the Church is out now!\n🔗 Get your copy: https://www.amazon.com/Disabuse-Investigate-Eliminate-Faith-Based-Organizations/dp/1738771857?source=ps-sl-shoppingads-lpcontext\u0026ref_=fplfs\u0026psc=1\u0026smid=ATVPDKIKX0DER\n \n🔔 Subscribe \u0026 Share: Help us spread awareness by liking this video and sharing it with those committed to safer faith communities.",
      "release": "2025-02-26T18:24:27Z",
      "duration": "00:34:26",
      "explicit": false,
      "youTubeId": "OYMWYrneRDE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OYMWYrneRDE"
      }
    },
    {
      "id": "5abbe43c-f25d-4ff6-bfff-a1bf71b6d018",
      "title": "DARVO: Deny, Attack, Reverse Victim \u0026 Offender | Disabuse Podcast EP #5 With Dr. Jennifer Freyd",
      "description": "Join Bob Stenhouse, CEO \u0026 Founder of Veritas Solutions, in this enlightening episode of the Disabuse podcast as he interviews Dr. Jennifer Freyd, globally recognized psychologist, author, and founder of the Center for Institutional Courage. \n\nDr. Freyd unpacks critical concepts like DARVO (Deny, Attack, Reverse Victim and Offender), betrayal trauma, and institutional betrayal. They dive into how these dynamics appear across churches, workplaces, universities, and sports organizations, offering invaluable insights for investigators and organizations striving to eliminate abuse.\n\nKey topics include:\n\n- The psychology of DARVO and its societal impact\n- The correlation between DARVO and narcissism, psychopathy, and manipulation\n- Real-world examples of institutional betrayal in organizations like the military and faith-based groups\n- Practical advice for investigators to detect and address abuse effectively\n\nDon\u0027t miss this vital conversation about creating safer institutions and empowering victims.\n\n📖 Disabuse is out now! https://www.amazon.ca/Disabuse-Investigate-Eliminate-Faith-Based-Organizations/dp/1738771857\n\n🌐 Investigations for Churches \u0026 Faith-Based Organizations: veritassolutions.net/church-and-faith-based-organizations",
      "release": "2025-02-10T17:56:56Z",
      "duration": "00:45:11",
      "explicit": false,
      "youTubeId": "VApx5OKw11Q",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VApx5OKw11Q"
      }
    },
    {
      "id": "57652c1c-3684-4526-bf82-f7e77dfb821e",
      "title": "Investigating a Canadian Megachurch Scandal |  Disabuse Podcast EP #4 With Guest Rachel Browne",
      "description": "Award-winning investigative journalist Rachel Browne joins us to dive into the rise and fall of The Meeting House, once one of Canada’s largest megachurches. \n\nFrom its early days in Oakville to its peak with over 5,000 members, The Meeting House was a cultural force—until a series of scandals shook its foundation.\n\nRachel, who grew up in Oakville and attended the church as a teen, shares her investigative journey uncovering allegations of sexual misconduct, abuse, and a culture of unchecked power tied to charismatic leader Bruxy Cavey. Discover what led to the church\u0027s downfall, the legal battles that ensued, and the lessons institutions can learn from this cautionary tale.\n\n📖 Be The First to Read Disabuse! mailchi.mp/veritassolutions/disabuse-podcast \n\n🌐 Investigations for Churches \u0026 Faith-Based Organizations: veritassolutions.net/church-and-faith-based-organizations",
      "release": "2025-01-27T16:07:11Z",
      "duration": "00:30:37",
      "explicit": false,
      "youTubeId": "i1XK8kMVUa4",
      "subjects": [
        "The Meeting House"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=i1XK8kMVUa4"
      }
    },
    {
      "id": "99546f3d-948e-4ed7-a312-d8f7123a043e",
      "title": "Coercive Control in Evangelical Communities with Bethany Jantzi  | Disabuse Podcast EP #3",
      "description": "Join Randal Rauser, Director of Faith-Based Organization Investigations at Veritas Solutions, as he tackles the critical issue of coercive control with Bethany Jantzi, MSc, DPC, a renowned specialist in cult dynamics and coercive practices. \n\nBethany, who holds a master’s degree in the psychology of coercive control, unpacks the complexities of coercion, particularly within evangelical Christian communities. Together, they discuss high-control groups, their intersection with complementarianism, and the vital need to cultivate a healthy, non-coercive church environment.\n\n Bethany also offers practical strategies for churches to better support their congregants, including integrating external counseling services.\n\n📌 Learn more at www.freefromcontrol.ca\n\nTimestamps: \n\n00:00 Introduction to Bethany Yancey and Coercive Control\n\n00:31 Defining Coercive Control \n\n02:38 High Control Groups in Evangelicalism \n\n06:06 Fear and Doctrine in Evangelical Christianity \n\n15:33 Complementarianism and Coercive Control\n\n 23:51 Final Thoughts and Recommendations",
      "release": "2025-01-07T04:39:50Z",
      "duration": "00:27:43",
      "explicit": false,
      "youTubeId": "hMZ8EYLfPlE",
      "subjects": [
        "Cult Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hMZ8EYLfPlE"
      }
    },
    {
      "id": "f11550cf-be7c-40a5-9277-94fad89759b7",
      "title": "What Is Spiritual Abuse? | Disabuse Podcast EP #2 With Guest Dan Koch",
      "description": "What distinguishes spiritual abuse from emotional harm? How do fear and control play into religious trauma?\n\nIn this episode, Randal Rauser, Director of Faith-Based Organization Investigations at Veritas Solutions, sits down with Dan Koch, a licensed therapist and creator of the Spiritual Harm and Abuse Scale. Together, they explore the concept of spiritual abuse, its distinction from psychological harm, and how it manifests in various faith-based settings.\n \nLearn more about Dan’s work at www.dankochwords.com\n\n📖 Be The First to Read Disabuse! mailchi.mp/veritassolutions/disabuse-podcast \n\n🌐 Investigations for Churches \u0026 Faith-Based Organizations: veritassolutions.net/church-and-faith-based-organizations",
      "release": "2024-12-03T21:17:20Z",
      "duration": "00:33:05",
      "explicit": false,
      "youTubeId": "hukc2-ujVTI",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hukc2-ujVTI"
      }
    },
    {
      "id": "fe92378e-596e-47cd-9335-f7de4dcc7b22",
      "title": "Investigating Abuse in Churches \u0026 Faith-Based Organizations | Disabuse Podcast EP #1",
      "description": "How should churches respond to abuse allegations? \n\nRandal Rauser and Bob Stenhouse tackle this difficult question, outlining an effective investigative approach and how Veritas Solutions helps faith-based organizations maintain transparency and trust. \n\n📖 Be The First to Read Disabuse!\nmailchi.mp/veritassolutions/disabuse-podcast\n\n🌐 Investigations for Churches \u0026 Faith-Based Organizations: \nveritassolutions.net/church-and-faith-based-organizations",
      "release": "2024-11-08T23:44:46Z",
      "duration": "00:36:29",
      "explicit": false,
      "youTubeId": "2vjO8Stc9Q4",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2vjO8Stc9Q4"
      }
    }
  ]
}