{
  "_ts": 0,
  "id": "bd5de84e-4fe3-4f62-9e64-2354cd09d234",
  "name": "Discussing Maharishi \u0026 the TM Movement, etc.",
  "youTubeChannelId": "UCKBs6D549xGsJVRKl1rslZw",
  "episodes": [
    {
      "id": "c3653cce-3541-4339-b00e-54cdd47d1a68",
      "title": "The Subtler Forms of Coercive Control, Part I",
      "description": "Is the Transcendental Meditation movement founded by “His Holiness” Maharishi Mahesh Yogi a cult? There\u0027s been some debate about the use of the word cult. Some say it is overused and imprecise. An expression favoured these days is \u0027\u0027high control organization\u0027\u0027 or \u0027\u0027high demand group\u0027\u0027. A case can be made that many who have gone on further in the TM organisation, becoming teachers and leaders, have been subject to high control, albeit in a subtle form.\n\nSome of the subtler elements of coercive control can be:\n\nan atmosphere where people are trained to gaslight themselves. For example, a situation may have been brought about where if the leadership behaves in puzzling ways, people will nonetheless speculate in their favour. “Oh, they must have done it for (this) reason.” The concept of “higher” states of consciousness and the assumption that some leaders have attained them, favours such an atmosphere.\nan atmosphere where once the neophyte has become absorbed into the “priesthood” it is gently implied that there is something wrong with them if they engage in critical thinking — discussion and debate on points of doctrine.\nan atmosphere where those raising even very standard questions about, for example, financial accountability, are disadvantaged. This will be the case, for example, if such questions are characterised as “drops of poison.\u0022\nFew would argue that people learning the basic entry level of Transcendental Meditation are subjected to coercive control. However, they have put a foot on the first rung of the ladder, and moving them up the ladder is baked into the “TM” teaching process.\n\nFeatures:\nRachel Bernstein LMFT, MSEd, ​Host of IndoctriNation: A weekly podcast covering cults, manipulators, and how to protect yourself from systems of control. Cult Intervention and Re-acclimation Specialist Licensed Marriage and Family Therapist. ​Author of: Now I Know — Kids Talking to Kids About Divorce.\n\nEileen Barker, PhDhc (Copenhagen), FAcSS, FBA, OBE LSE Professor Emeritus of Sociology with Special Reference to the Study of Religion. Consultant to the LSE Centre for the Study of Human Rights Author of: The Making of a Moonie, New Religious Movements and Political Orders, Cults, Sects and New Religions, On Freedom.\n\nPatrick Ryan ​40 years experience as a Cult Mediation Specialist. ​Established the online resource of the International Cultic Studies Association. ​Formerly editor of AFF News, a news publication for former cult members. ​Founder and former head of TM-EX. ​Books: ​Ethical Standards for Thought Reform Consultants (Co-author), ​Recovery From Cults (Contributor).",
      "release": "2024-08-09T09:26:57Z",
      "duration": "00:26:58",
      "explicit": false,
      "youTubeId": "b5_TWhgODe4",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=b5_TWhgODe4"
      }
    },
    {
      "id": "16e27a1c-b6e4-4669-927a-a2009f51b331",
      "title": "Maharishi After Dark - The Many Loves of the Yogi : The HIVE Part 6",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART SIX: Susan Shumsky  is a former staff member at the TM headquarters in Seelisberg, Switzerland, and is a best selling author of 20 books. She also features in the movie The Beatles in India.\n\nIn this video Susan documents the sexual relationships Maharishi had with many women. She also discusses the complicated nature of these relationships, and the assignations that happened \u0022after dark\u0022 - after 3am in most cases.\n\nSusan is joined by a number of other speakers, in particular Conny Larsson, who was employed as Maharishi\u0027s masseur and personal secretary. He was unwittingly responsible for bringing many of the young women to Maharishi in the dead of night.",
      "release": "2024-03-07T08:29:44Z",
      "duration": "02:23:30",
      "explicit": false,
      "youTubeId": "9ksdcukqbfA",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9ksdcukqbfA"
      }
    }
  ]
}