{
  "_ts": 0,
  "id": "bd5de84e-4fe3-4f62-9e64-2354cd09d234",
  "name": "Discussing Maharishi \u0026 the TM Movement, etc.",
  "youTubeChannelId": "UCKBs6D549xGsJVRKl1rslZw",
  "episodes": [
    {
      "id": "2f7166c6-f4a9-42d6-b5b9-cb8283c08c46",
      "title": "hive shorty1YT2",
      "release": "2024-05-05T02:16:37Z",
      "duration": "00:01:01",
      "explicit": false,
      "youTubeId": "wtaqNG89Mv8",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wtaqNG89Mv8"
      }
    },
    {
      "id": "e84e8e17-8a31-4107-9e3f-3f8d23bc09a6",
      "title": "Dr. Robert Gordon-McCutchan on Maharishi\u0026#39;s nocturnal activities : The HIVE Part 2",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART TWO: Dr. Robert Gordon-McCutchan begins his story of Maharishi\u0027s nocturnal activities, and discusses the ethics of that behaviour. \n\nHe was a former personal secretary and the first western person designated as a brahmachari and \u0022deerskin carrier\u0022 for Maharishi.\n\nRobert has a PhD from Princeton University. He has held posts at the Universities of California, New Mexico, and Oregon, with a specialty in American transcendentalism.",
      "release": "2024-03-30T01:47:33Z",
      "duration": "01:15:54",
      "explicit": false,
      "youTubeId": "kU1wRqmd_P8",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kU1wRqmd_P8"
      }
    },
    {
      "id": "cca52191-674f-4d87-8ab8-79bccef2b94c",
      "title": "Judith Bourque \u0026amp; Theresa Olson on their relationships with Maharishi Mahesh Yogi: The HIVE Part 1.",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART ONE: A frank discussion with excerpts from an online Zoom session that was recorded on 20th April 2023 and includes contributions from many participants regarding their relationships with Maharishi Mahesh Yogi.\n\nFeatured speakers are:\n\nTheresa Olson, daughter of Helena Olson PhD, one of the earliest, longtime leaders of the Transcendental Meditation (TM) Movement and the author of the book Hermit in the House, which describes the Olson family\u0027s experiences hosting Maharishi Mahesh Yogi as a guest in their home. \n\nJudith Bourque, Filmmaker, film editor, Holistic Therapist, and author of the book Robes of Silk Feet of Clay: The True Story of a Love Affair with Maharishi Mahesh Yogi, the TM guru followed by the Beatles, Deepak Chopra, David Lynch, and millions more.\n\nSupporting these two were Phillip Goldberg, author of 12 books including American Veda and a biography of Yogananda; Rick Archer founder and host of the Buddha at the Gas Pump online interview series; and Mark Landau, a former personal secretary and deerskin carrier for Maharishi and author of eight books.",
      "release": "2024-03-29T23:29:40Z",
      "duration": "01:35:44",
      "explicit": false,
      "youTubeId": "mCogAtlifMY",
      "subjects": [
        "Transcendental Meditation",
        "Self-Realization Fellowship"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mCogAtlifMY"
      }
    },
    {
      "id": "3c4b608b-04b3-440b-b791-b8e86beaf7bf",
      "title": "Paul Mason - From London to Rishikesh : The HIVE Part 10",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART TEN: \u0022In 1970, at 18, Paul hitchhiked from England to India and learned TM in Maharishi Mahesh Yogi\u0027s ashram in Rishikesh.\n\nA year later, going back to India, he traveled to Uttarkashi, the Valley of the Saints. In Joshimath, where the revered Swami Brahmananda Saraswati (\u0027Guru Dev\u0027) had re-established a monastery, Paul discovered rare books about him. To translate them, he studied Hindi and Sanskrit. From Guru Dev\u0027s disciples and other sources, he obtained more biographical material and photographs of Guru Dev. The translations, published in a three-volume set, include the original Devanagari text. Paul\u0027s biography of Maharishi was published in 1996. New editions feature more information about Maharishi\u0027s life, his association with Guru Dev, his passing in 2008, and many more photographs. Paul is writing a fourth book about Guru Dev, an in-depth re-examination of his life and teachings.\n\nPaul has written other books about his travels and research. He has created ebooks on various topics including the LA blues group, Canned Heat. \n\nMany know of Paul through his FB groups \u0027Roots of TM\u0027 and \u0027Guru Dev - Swami Brahmananda Saraswati’.”",
      "release": "2024-03-08T00:49:07Z",
      "duration": "03:05:48",
      "explicit": false,
      "youTubeId": "KRSzPZU0prc",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KRSzPZU0prc"
      }
    },
    {
      "id": "16e27a1c-b6e4-4669-927a-a2009f51b331",
      "title": "Maharishi After Dark - The Many Loves of the Yogi : The HIVE Part 6",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART SIX: Susan Shumsky  is a former staff member at the TM headquarters in Seelisberg, Switzerland, and is a best selling author of 20 books. She also features in the movie The Beatles in India.\n\nIn this video Susan documents the sexual relationships Maharishi had with many women. She also discusses the complicated nature of these relationships, and the assignations that happened \u0022after dark\u0022 - after 3am in most cases.\n\nSusan is joined by a number of other speakers, in particular Conny Larsson, who was employed as Maharishi\u0027s masseur and personal secretary. He was unwittingly responsible for bringing many of the young women to Maharishi in the dead of night.",
      "release": "2024-03-07T08:29:44Z",
      "duration": "02:23:30",
      "explicit": false,
      "youTubeId": "9ksdcukqbfA",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9ksdcukqbfA"
      }
    },
    {
      "id": "6372d47b-87fc-4638-a71b-cfaaf338b4a6",
      "title": "Conny Larsson from Sweden, former personal secretary for Maharishi : The HIVE Part 4",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART FOUR: Conny Larsson  from Sweden, former personal secretary and deerskin carrier for Maharishi. Conny relates his experiences, with a focus in this interview on his observations of how Maharishi interacted with the young women surrounding him.\n\nConny is joined by Judith Bourque, author of Robes of Silk and Feet of Clay, who we featured in Part One, and Robert Gordon-McCutchan, who also worked with Conny as a secretary and deerskin carrier for Maharishi, and was interviewed in Part Two and Three of this series.",
      "release": "2024-03-07T05:07:26Z",
      "duration": "00:55:58",
      "explicit": false,
      "youTubeId": "YUwwsMEWziY",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YUwwsMEWziY"
      }
    },
    {
      "id": "84120c84-bac8-4325-bd5e-094f9987dcfd",
      "title": "Dr. Robert Gordon-McCutchan on Maharishi\u0027s nocturnal activities : The HIVE Part 2",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART TWO: Dr. Robert Gordon-McCutchan begins his story of Maharishi\u0027s nocturnal activities, and discusses the ethics of that behaviour. \n\nHe was a former personal secretary and the first western person designated as a brahmachari and \u0022deerskin carrier\u0022 for Maharishi.\n\nRobert has a PhD from Princeton University. He has held posts at the Universities of California, New Mexico, and Oregon, with a specialty in American transcendentalism.",
      "release": "2024-02-18T05:37:32Z",
      "duration": "01:18:32",
      "explicit": false,
      "youTubeId": "mckMqAjqDIE",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mckMqAjqDIE"
      }
    },
    {
      "id": "c1ca6d6c-3654-479c-bf14-77ff9d3a275e",
      "title": "Aryeh Siegel in depth on TM scientific research integrity: The HIVE Part 9",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART NINE: In this video we interview Aryeh Siegel MSSA(MSW), a former teacher of Transcendental Meditation (TM) who left the cult and is revealing its hidden Hindu truths.\n\nIn this talk he reviews the integrity of the scientific research on TM.\n\nSiegel was introduced to TM in 1971 when he was a graduate student at Berkeley, and became a TM teacher 1975.  He completed TM teacher training programmes in Livigno, Italy, and in Arosa, Switzerland.",
      "release": "2024-02-16T07:14:03Z",
      "duration": "02:06:34",
      "explicit": false,
      "youTubeId": "eyfZfIhW-i4",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eyfZfIhW-i4"
      }
    },
    {
      "id": "061f7d71-9130-47f0-a472-c15fd30e29e3",
      "title": "Professor Dana Sawyer on the origins of Transcendental Meditation (TM) in India: The HIVE Part 8.",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART EIGHT: In this video we interview Dana Sawyer, Professor Emeritus of religious studies \u0026 world religions at the Maine College of Art \u0026 Design, and an adjunct professor in Asian Religions at the Chaplaincy Institute of Maine.\n\nHe and colleague Cynthia Humes were recently commissioned to write a history of the Transcendental Meditation movement for Cambridge University Press.\n\nProfessor Sawyer speaks fluent Hindi and has travelled extensively in India over many years. He is friends with literally hundreds of Dandi Swamis of the same ordained order of monks as Guru Dev, Swami Brahmananda Saraswati, the former Shankaracharya of Jyotir Math and guru of Maharishi Mahesh Yogi.\n\nHe is an author of numerous books, including \u0022Aldous Huxley: A Biography\u0022, which Laura Huxley described as, \u0022Out of all the biographies written about Aldous, this is the only one he would have actually liked.\u0022\n\nDana has lectured at the Kyoto University of Foreign Studies, Benares Hindu University, the University of Riga, Latvia, the Huntingdon Library, and at colleges and conferences throughout the United States.",
      "release": "2024-02-16T07:02:15Z",
      "duration": "01:49:31",
      "explicit": false,
      "youTubeId": "Xdx8Y7nc8AU",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Xdx8Y7nc8AU"
      }
    },
    {
      "id": "8b258305-0dc8-4644-8fc9-cbdc7b70ce7a",
      "title": "David Laird in depth on the TM movement\u0026#39;s finances: The HIVE Part 5",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART FIVE: This video is a presentation by David Laird on the publicly available finances of the Transcendental Meditation (TM) movement in various countries around the world. David presents the facts he has been able to investigate, and leaves you to decide for yourself what conclusions may be drawn.\n\nDavid learned to meditate in 1971, worked on staff at TM world headquarters in Seelisberg, Switzerland for four months, then received TM teacher training in 1974. He was briefly one of four regional coordinators for the UK TM organisation.\n\nIn 1978 he joined The Economist  media group, and eventually became Commercial Director of The Economist Group, a £300m global media company. During a 30-year career he held various positions in sales, marketing and senior management in the UK, Europe and the USA. Under his leadership CFO Publishing, a Boston-based media company, saw revenues increase from $6m to $43m in 10 years.\n\nMore recently he served on the Peace Palace Advisory Board and has designed and written a number of publications for new Meditators, including the Perspectives newsletter which was recently reprinted.",
      "release": "2024-02-16T06:21:26Z",
      "duration": "01:34:11",
      "explicit": false,
      "youTubeId": "UPbz08t4H3w",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UPbz08t4H3w"
      }
    },
    {
      "id": "59f06e29-9261-48e7-b445-87e337bb9744",
      "title": "Maharishi Mahesh Yogi’s personal secretary \u0026amp; deerskin carrier Conny Larsson: The HIVE Part 4",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART FOUR: In this video we interview Conny Larsson from Sweden, former personal secretary and deerskin carrier for Maharishi. Conny relates his experiences, with a focus in this interview on his observations of how Maharishi interacted with the young women surrounding him. \n\nConny is joined by Judith Bourque, author of Robes of Silk Feet of Clay: The True Story of a Love Affair with Maharishi Mahesh Yogi, the TM guru followed by the Beatles, Deepak Chopra, David Lynch, and millions more, whom we featured in Part One, and Robert Gordon-McCutchan, who also worked with Conny as a secretary and deerskin carrier for Maharishi, and was interviewed in Parts Two and Three of this series.",
      "release": "2024-02-16T00:24:35Z",
      "duration": "00:13:57",
      "explicit": false,
      "youTubeId": "bLrWsKsoMDE",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bLrWsKsoMDE"
      }
    },
    {
      "id": "e77d8abd-49e8-4542-a63c-8553163cda1e",
      "title": "Dr. Robert Gordon-McCutchan on Maharishi\u0026#39;s nocturnal activities (continued): The HIVE Part 3",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART THREE: Dr. Robert Gordon-McCutchan continues his in-depth recounting of Maharishi\u0027s nocturnal activities and discusses the ethics of that behaviour. He tells the story of a friend of his, the first Western (female) Brahmacharini (sworn celibate).",
      "release": "2024-02-16T00:17:28Z",
      "duration": "00:42:43",
      "explicit": false,
      "youTubeId": "Fzf686ARud8",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Fzf686ARud8"
      }
    },
    {
      "id": "47e00a9b-9525-4bc0-9aa7-02e5d29f5329",
      "title": "Judith Bourque \u0026amp; Theresa Olson on their relationships with Maharishi Mahesh Yogi: The HIVE Part 1.",
      "description": "TO VIEW ALL of the HIVE interviews, click here: https://www.youtube.com/channel/UCKBs6D549xGsJVRKl1rslZw \n\nCONVERSATIONS IN THE HIVE PART ONE: A frank discussion with excerpts from an online Zoom session that was recorded on 20th April 2023 and includes contributions from many participants regarding their relationships with Maharishi Mahesh Yogi.\n\nFeatured speakers are:\n\nTheresa Olson, daughter of Helena Olson PhD, one of the earliest, longtime leaders of the Transcendental Meditation (TM) Movement and the author of the book Hermit in the House, which describes the Olson family\u0027s experiences hosting Maharishi Mahesh Yogi as a guest in their home. \n\nJudith Bourque, Filmmaker, film editor, Holistic Therapist, and author of the book Robes of Silk Feet of Clay: The True Story of a Love Affair with Maharishi Mahesh Yogi, the TM guru followed by the Beatles, Deepak Chopra, David Lynch, and millions more.\n\nSupporting these two were Phillip Goldberg, author of 12 books including American Veda and a biography of Yogananda; Rick Archer founder and host of the Buddha at the Gas Pump online interview series; and Mark Landau, a former personal secretary and deerskin carrier for Maharishi and author of eight books.",
      "release": "2024-02-15T23:42:46Z",
      "duration": "01:44:17",
      "explicit": false,
      "youTubeId": "qimmC4Rvg3U",
      "subjects": [
        "Transcendental Meditation",
        "Self-Realization Fellowship"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qimmC4Rvg3U"
      }
    }
  ]
}