{
  "_ts": 0,
  "id": "a2a26f90-27f0-47a6-9a32-6779ce48a318",
  "name": "Freed from Cult Life",
  "youTubeChannelId": "UC8Z1IfbkpJhAtf40oDk3d6w",
  "episodes": [
    {
      "id": "720204bc-d9f4-415a-9a74-5f8e28d84f7e",
      "title": "4 Big Reasons Jehovah’s Witnesses Are Leaving in Droves #jehovahswitnesses #exjw",
      "description": "In this video, I share four major reasons why so many Jehovah’s Witnesses are leaving the organization—and why the exodus is growing. From the high-control structure and shunning practices to doctrinal contradictions and mishandling of abuse, these issues are opening the eyes of thousands around the world.\n\nWhether you’re questioning your beliefs, on a healing journey, or just seeking to understand, this video is for you. Thanks for watching🙏🏽  If this resonates with you please comment and share. Turn on notifications if you would like to be notified when a new video is posted.\n\nLinks:\nAustralia Royal Commission case study #29\nhttps://www.childabuseroyalcommission.gov.au/case-studies\n\nDoctrinal Changes\nhttps://en.m.wikipedia.org/wiki/Development_of_Jehovah%27s_Witnesses_doctrine\n\nCSA and Jehovah’s Witnesses\nhttps://en.m.wikipedia.org/wiki/Jehovah%27s_Witnesses%27_handling_of_child_sexual_abuse\n\n#exjw #jehovahswitnesses #disfellowshipped #religioustrauma #csa #shunned #highcontrol #royalcommission #doctrines #religiousabuse\n#cult #jehovah",
      "release": "2025-05-08T20:30:02Z",
      "duration": "00:16:04",
      "explicit": false,
      "youTubeId": "BLC14hBWK1g",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BLC14hBWK1g"
      }
    },
    {
      "id": "fa6fc547-fd5d-48c8-ab81-1ac7448195a6",
      "title": "Jeron’s Shocking Story: Reinstated Just to Expose Jehovah’s Witnesses! #jw #exjw #shunning",
      "description": "In this powerful conversation, Jeron opens up about his life-long journey with the Jehovah’s Witnesses—from growing up in the religion to leaving, returning, and ultimately exposing what he saw as corruption from within. We’re going to share raw, honest reflections on our personal experiences with elders, the appointment process, and what it means to truly be led by the Holy Spirit.\n \n\nIn this discussion:\n • Child abuse cover-ups and the Australian Royal Commission’s findings\n • Contradictions in JW teachings, including “new light” and doctrinal changes\n • The decline in JW membership and controversial policies like the blood transfusion ban\n • Challenges in retaining young members in the internet age\n • The shift in governing body policies (like allowing beards) and what it means\n • The emotional toll of being shunned by family and the power of authenticity over religious conformity\n • The commitment to helping others question, research, and heal from high-control religious environments\n\nWhether you’re a current or former Witness—or just curious—this video invites thoughtful dialogue about truth, self-discovery, and the courage to walk away from control in pursuit of freedom and authenticity. I truly hope this helps someone to eventually be “Freed From Cult Life”.\n\nSubscribe to Jeron’s channel here: https://youtube.com/@jeron_benton?si=If6fS_lDPx_DSY_Q\n\nFeel free to comment, like and share with someone who may need it. As always, thank you.\n\n#exjw #religiousfreedom #watchtowerexposed",
      "release": "2025-04-30T19:30:10Z",
      "duration": "01:05:01",
      "explicit": false,
      "youTubeId": "zFYZzR2zbao",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zFYZzR2zbao"
      }
    },
    {
      "id": "be75a84f-cca8-4b57-a60d-e06c260b0a02",
      "title": "A Story of Leaving Jehovah’s Witnesses: Interview with a Former Member   #exjw #jehovahswitnesses",
      "description": "In this honest and inspiring interview, I speak with a woman who quietly faded from the Jehovah’s Witness religion after uncovering its hypocrisy, false teachings, and the emotional toll it took on her life.\n\nShe opens up about the painful process of waking up to the truth, and how leaving helped her build a life full of clarity, meaning, and freedom.\n\nThis story is for anyone who has questioned the Watchtower teachings, felt the weight of religious pressure, or is searching for a way out. Her strength and insight offer hope for any of you on a similar path.\n\nPlease checkout KC’s YouTube channel here:\nhttps://youtube.com/@factsonjw3842?si=PYdE_24_cq4nz71v\n\nBooks referenced:\n“30 Years a Watchtower Slave”\nhttps://a.co/d/2FI3sYA\n\n“Crisis of Conscience”\nhttps://a.co/d/jg3gd0P\n\nJwfacts.com for more on JW history.\n\nIf you would like to share your story please reach out via email here - tresaki76@gmail.com\n\n#exjw #jehovahswitnesses #healing #religioustrauma #faith #lies #shunned #faded #watchtower",
      "release": "2025-04-23T19:30:06Z",
      "duration": "00:48:58",
      "explicit": false,
      "youTubeId": "kUpI2PJ_IZk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kUpI2PJ_IZk"
      }
    },
    {
      "id": "f63f83e6-2534-4e6d-983b-b044be5d37c9",
      "title": "Jehovah’s Witnesses and Marriage: When Only One Sees the Truth #exjwsupport #marriage",
      "description": "Waking up from Jehovah’s Witnesses is hard enough—but when your spouse is still deep in, it can feel like you’re living in two different worlds. In this video, I open up about the emotional weight of a spiritually divided marriage, why it’s so hard to help a spouse see the truth, and what you can do to stay grounded and sane through it all.\n\nWe’ll break down the indoctrination, the fear, the emotional disconnect, and the heartbreak of being labeled “spiritually dangerous” by the person you love most. One tip: Everything is Won on the Approach.\n\nAre you in a mixed-belief marriage? How have you handled it? What helped—or didn’t?\n\n #exjw #jehovahswitnesses #healing #marriage #relationship #religioustrauma #governingbody",
      "release": "2025-04-18T19:30:05Z",
      "duration": "00:31:08",
      "explicit": false,
      "youTubeId": "kndKRvfFZEs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kndKRvfFZEs"
      }
    },
    {
      "id": "33f5b020-3125-41f3-8776-737b49a82d02",
      "title": "Why Were Jehovah’s Witnesses Secretly Associated with the UN? 1992-2001",
      "description": "For nearly a decade, from 1992 to 2001, the Watchtower Bible and Tract Society—the governing organization behind Jehovah’s Witnesses—was secretly registered as a Non-Governmental Organization (NGO) with the United Nations. This video dives into this controversial partnership, why it’s such a big deal, and what it means in light of the organization’s long-standing position that the UN is part of Satan’s system.\n\nWe’ll break down:\n • What the UN NGO registry really means\n • How the Watchtower applied for and maintained its status\n • The fallout when this relationship was exposed\n • Official responses and letters \n • Why this matters to JWs and ex-JWs today\n\nIf you’ve ever questioned the transparency or consistency of the organization’s teachings, this video is for you.\n\nThanks for watching and if this video helps please feel free to like, comment and share.\n\n#jehovahswitnesses #watchtower #religioustruth #exjw #unitednations",
      "release": "2025-04-09T19:30:06Z",
      "duration": "00:20:56",
      "explicit": false,
      "youTubeId": "h3Os83aQEFE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h3Os83aQEFE"
      }
    },
    {
      "id": "2dcb34bc-0d82-4fe3-8920-6c9e47108a61",
      "title": "Healing after leaving Jehovahs Witnesses #exjw #healing #nature",
      "release": "2025-04-08T18:00:34Z",
      "duration": "00:01:08",
      "explicit": false,
      "youTubeId": "fnO9yaBd3Og",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fnO9yaBd3Og"
      }
    },
    {
      "id": "0fbb57c3-3a23-4682-bbe5-767928e20052",
      "title": "Pt. 3 Life after Prison as a Jehovah’s Witness #jehovahswitnesses #marriage #exjw",
      "description": "Welcome back! In this video we go back to how things went after prison. Marriage, appointment as Ministerial Servant, Disfellowshipped and having children. A roller coaster indeed. \n\nThank you for taking time to listen and if anything resonates with you feel free to comment. \n\nFor my video on my biggest reason for leaving check this link out: https://youtu.be/6igczFuMAt4?si=0TqCHU219q1SM02Y\n \nTo checkout part 2: https://youtu.be/AIzpFrKy30c?si=WiPqXLCZSjNu4Blc\n\nTo watch part 1: https://youtu.be/FjlxFko8ADI?si=jlAxQ0E7PhLo5mTo\n\nFor more information and history about Jehovah Witnesses check this site: jwfacts.com\n\n#faith #exjw #jehovahswitnesses",
      "release": "2025-04-02T23:19:25Z",
      "duration": "00:24:52",
      "explicit": false,
      "youTubeId": "ZeFICkgGcMM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZeFICkgGcMM"
      }
    },
    {
      "id": "9f6dd3dc-8096-40e3-aa98-21870133d8ca",
      "title": "Pt. 2 - Locked Up \u0026amp; Preaching: My Life as a Jehovahs Witness in Prison #exjw #jehovahswitnesses",
      "description": "For almost ten years, I lived behind bars—but that didn’t stop me from preaching. As a devoted Jehovah’s Witness, I continued to share the religion’s teachings with fellow inmates, convinced I had the truth. Prison didn’t wake me up. I studied the information from Watchtower religiously! The indoctrination was so strong that even in one of the harshest environments, I remained loyal to the organization. After my release, I got married and continued as a Jehovah’s Witness—until I was disfellowshipped. And that was the moment everything started to change.\n\nIf you’re interested in Part 1: “Growing up as one of Jehovahs Witnesses” here’s the link: https://youtu.be/FjlxFko8ADI?si=vQb5T7R3JbgWyybU\n\n\nThanks for taking time to listen to my story and I hope it helps you in some way. See you on the next video.\n\n#exjw #jehovahswitnesses #prison #indoctrination",
      "release": "2025-03-25T22:00:08Z",
      "duration": "00:25:53",
      "explicit": false,
      "youTubeId": "AIzpFrKy30c",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AIzpFrKy30c"
      }
    },
    {
      "id": "dce982ee-973f-4955-b68c-fe10bbd9742f",
      "title": "Healing isn’t about erasing your past-it’s about taking back your power. #healing #exjw #trauma",
      "release": "2025-03-19T17:34:09Z",
      "duration": "00:01:09",
      "explicit": false,
      "youTubeId": "WkOrMOMJCvU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WkOrMOMJCvU"
      }
    },
    {
      "id": "7ac22258-d878-4b2c-a7f4-66db861da323",
      "title": "Growing up as one of Jehovah’s Witnesses 🤪 #fieldservice #jehovahswitnesses #growingup",
      "description": "In this video, I share my personal journey of growing up as one of Jehovah’s Witnesses—what it was like being raised in the religion, the teachings that shaped my life, and the challenges I faced along the way. From strict rules and expectations to the unique culture within the organization, I’ll give an honest perspective on the experiences that defined my childhood and early adulthood.\n\nWhether you’re a former Jehovah’s Witness, someone curious about the religion, or just interested in personal stories of faith and transformation, this video offers an inside look at a world that many don’t fully understand.\n\nLet me know your thoughts in the comments, and don’t forget to like, share, and subscribe for more content about my journey and insights into Jehovah’s Witnesses.",
      "release": "2025-03-16T04:05:58Z",
      "duration": "00:17:33",
      "explicit": false,
      "youTubeId": "FjlxFko8ADI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FjlxFko8ADI"
      }
    },
    {
      "id": "99850cd0-8a02-44d3-a3d2-bb89f10f8141",
      "title": "Are you believing Lies?!!",
      "description": "Hey welcome back! \nIn this video, I just want those who affiliated with Jehovahs witnesses to just ponder for a moment on WHY they believe the continuous lie that Armageddon is on the horizon. Or why so many changes to doctrines and beliefs that don’t make any sense. \nAsk yourself: Could this be a business being ran? \nAm I in this because of the people I’m close too? \nDo I really believe this so called paradise is really gonna come in my lifetime? \nWhy so many changes? Are they just trying to keep members active?\n\nBe objective. Use critical thinking skills. Be honest.\n\nLike, comment and share please. \n\nWake up!!!",
      "release": "2025-03-08T05:30:46Z",
      "duration": "00:10:38",
      "explicit": false,
      "youTubeId": "VI5TQuUsyFQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VI5TQuUsyFQ"
      }
    },
    {
      "id": "c14684cc-3faa-4005-b315-25808f3a2c65",
      "title": "Stop Lying!🤥 #jehovahswitnesses #lies",
      "release": "2025-03-03T12:19:00Z",
      "duration": "00:01:02",
      "explicit": false,
      "youTubeId": "BAEAdK7DjdM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BAEAdK7DjdM"
      }
    },
    {
      "id": "fc7bae98-d6e8-43d6-b23d-ff408d238a58",
      "title": "My Biggest reasons for Leaving the cult of Jehovah witnesses #exjw #jehovahswitnesses #kingdomhall",
      "description": "Take a journey with me as I start to share my experiences growing up as one of JW’s. In this brief video, I discuss a couple of the main reasons I decided that this organization is corrupt and dangerous to children. \n\nForgive me for the abrupt ending. I am learning how to make videos, so please bear with me on the editing lol.\n\nIn future videos I’ll dive into my experiences and how JW’s has affected my life. \n\nPlease comment below on your reasons for leaving and thank you for watching.",
      "release": "2025-02-28T14:03:17Z",
      "duration": "00:05:11",
      "explicit": false,
      "youTubeId": "6igczFuMAt4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6igczFuMAt4"
      }
    }
  ]
}