{
  "_ts": 0,
  "id": "f0e002db-a479-4f62-9a4c-6258ebf4b7a2",
  "name": "Divine Truth and The Return of Jesus",
  "spotifyId": "7Hi6VUtz6nQKLqzOHVSiBz",
  "episodes": [
    {
      "id": "0a364124-e812-4106-8d80-475064d8d01b",
      "title": "6. \u0022I am not in a cult or being mind controlled\u0022 says Mary Magdeline",
      "description": "In the Q\u0026A about Mary\u0027s identity, she claims that she is firstly not being possessed or influence by a spirit, AJ Miller, she is not being mind-controlled, and that she is NOT in a cult. however, we look at these claims, and insist that she is being either possessed by a dark and deceiving spirit, a demon, or being controlled by AJ in some sort of conditioning from a Christian perspective.",
      "release": "2024-08-19T00:00:00",
      "duration": "00:51:12.0230000",
      "explicit": false,
      "spotifyId": "0YIykSSgpIHlYX0Ej0qtsS",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YIykSSgpIHlYX0Ej0qtsS"
      }
    },
    {
      "id": "1281d815-2573-4cc8-ad33-d142b4f64ea5",
      "title": "5. Mary Magdeline, the Medium of the bible!",
      "description": "Who is Mary S. Luck besides being the partner and teacher along side of The Australian Jesus, AJ Miller? We don\u0027t know to much about her, but here is a quick introduction to her as found on her about me page on their website!",
      "release": "2024-08-12T00:00:00",
      "duration": "00:29:03.5020000",
      "explicit": false,
      "spotifyId": "5GKnhfDTZSNhsqdFYDBEaJ",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GKnhfDTZSNhsqdFYDBEaJ"
      }
    },
    {
      "id": "9b229740-beaa-4a4d-ba12-c4eafe31fd97",
      "title": "4. \u0022I am Jesus, and i am in sin and error\u0022 - The most basic introduction to the Australian Jesus",
      "description": "According to AJ, he is indeed Jesus of the bible, however, he currently is in sin and error. This i can agree with, he is in sin, by claiming to be a false Jesus, but also, in error, by teaching all these falsehoods. I wish for AJ, Mary, or any one who believes what he teaches, and believes that he is Jesus, to go and investigate the evidences for The Bible, for the historical Jesus, and the doctrinal stances of Christian thought by the likes of Cultish/Apologia Studios, Mike Winger, Inspiring Philosophy on YouTube, and even here on Spotify. Also check out the Podcasts, Cults to Conciseness, Cult Vault, Cultish, cults (by parcast) And check out these following books: \u0022Evidence that demands a verdict\u0022 by Josh and Sean Mcdongol, and \u0022Cults Uncovered\u0022 by Emily G. Thompson",
      "release": "2024-08-05T00:00:00",
      "duration": "00:30:25.4130000",
      "explicit": false,
      "spotifyId": "7gdatzL7OKLOdFGB6eGOgk",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7gdatzL7OKLOdFGB6eGOgk"
      }
    },
    {
      "id": "8e6e827d-6b38-409b-96ce-0774494ef1dd",
      "title": "3. \u0022No I cannot prove I\u0027m Jesus, because I\u0027m not God\u0022 - Getting to know AJ [Part 3]",
      "description": "We continue to look at the reasons he gives to why he hasn\u0027t proven that he is Jesus, and why He won\u0027t in the future. This is the most intense I would probably get in terms of confronting the lies of AJ Miller. Follow us on instagram: ⁠Divine Truth and the Return of Jesus Podcast (@divinetruthpodcast)⁠ Contact Dean Liddell via email: deancliddell96@hotmail.com",
      "release": "2024-07-29T00:00:00",
      "duration": "01:09:42.0530000",
      "explicit": false,
      "spotifyId": "0PiNln9tPHf2TfmMWuMTQy",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PiNln9tPHf2TfmMWuMTQy"
      }
    },
    {
      "id": "d1a04d99-ae36-4ed4-9620-238c9027ec3c",
      "title": "2. The gospel of Jesus (according to an white guy in Queensland)",
      "description": "Welcome back to the show, this is the episode where we look and comment on what AJ had to say about his, so called, First Century life as \u0022Jesus\u0022. Written back in the 2nd month of 2006, This is the most important, and most controversial claim that AJ makes about himself. We look at the claims he makes and look at what the bible has to say on this topic. We must always do this as Christians, and so should non-christians, even if you don\u0027t believe Jesus as lord, let the record of history speak loudly. Follow us on instagram: Divine Truth and the Return of Jesus Podcast (@divinetruthpodcast) Contact Dean Liddell via email: deancliddell96@hotmail.com",
      "release": "2024-07-22T00:00:00",
      "duration": "01:11:20.0180000",
      "explicit": false,
      "spotifyId": "0bRm5006mMmUNMXlFwa4cG",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0bRm5006mMmUNMXlFwa4cG"
      }
    },
    {
      "id": "34cb03e2-a6c8-4546-8a4f-1d54e6efcf06",
      "title": "1 - Getting to know AJ Miller [Part one]",
      "description": "Dean C. Liddell, a former follower of Divine Truth introduces you to AJ Miller, by commenting and sharing what AJ Teaches about himself from a Q\u0026A session. The Sources for this episode can be found here, provided by their website. This isn\u0027t a promotion of them, rather, this is to show where they\u0027re coming from Https//www.msha.ke/divinetruthpodcast Email Dean your story, for it to be heard in the future if you are currently or a former follower of Divine Truth and the Teachings of AJ and Mary at: deancliddell96@hotmail.com",
      "release": "2024-07-15T00:00:00",
      "duration": "00:53:55.6200000",
      "explicit": false,
      "spotifyId": "2A2pbW9Uhn1xbpeOV3A5gr",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2A2pbW9Uhn1xbpeOV3A5gr"
      }
    },
    {
      "id": "f641b353-10a5-4abf-bc75-b3d6bfc1e2cf",
      "title": "000 - Introduction to the podcast",
      "description": "Hello everyone; I\u0027m Dean Liddell, your host for this new Show, \u0022Divine Truth and The Return of Jesus\u0022, which is a show about a new age christian cult, called, as the title suggests, Divine Truth. Please follow along and support this as much as you can. Follow the show on instagram and facebook: Instagram: https://www.instagram.com/divinetruthpodcast Facebook: \u0022Divine Truth and The Return of Jesus\u0022",
      "release": "2024-07-08T00:00:00",
      "duration": "00:11:47",
      "explicit": false,
      "spotifyId": "5YqmTYWxQfdIGOweXjVrco",
      "subjects": [
        "Divine Truth"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5YqmTYWxQfdIGOweXjVrco"
      }
    }
  ]
}