{
  "_ts": 0,
  "id": "e22ff867-5665-4759-819b-d96a9e6313c9",
  "name": "Doctor Psycho",
  "spotifyId": "0G6ydY0fR7aGBvPiNMyDyq",
  "appleId": 1161583100,
  "episodes": [
    {
      "id": "2305a033-d0d4-4619-ad23-7ec77ad74a2e",
      "title": "Escaping the House of Yahweh",
      "description": "\u0022I went to see the freaks \u0026 Kenny went to find religion. That\u0027s how it all started.\u0022\n In this week\u0027s episode, Professor Michael Drane meets with Debryah Hawkins, a survivor of the House of Yahweh Cult. At 22, Debryah\u0027s life changed when a box of pamphlets arrived at her house. What started out as an innocent adventure and a 3-day feast quickly spiraled into a 10-year trap.\n Listen in as they discuss how she was recruited, the lengths required for loyalty and submission, and how she Got The Hell Out!\n Stay safe out there friends, and we hope you enjoy the show.\n                                              * * *\n Check out her Podcast \u0027I Got The Hell Out\u0027, available on iTunes\n Website: https://igotthehellout.com/\n Twitter: @wasinacult\n Instagram: @i_got_the_hell_out\n                                              * * *\n Follow us on all platforms at @upcpodcast\n Unpopular Culture Podcast is a Forensic Psychology podcast created and hosted by Professor \u0026 Psychotherapist Michael Drane. Working with a team of professionals, he seeks to shine a light into the broken underbelly of society.\n Listen as he explores subjects like:\n True Crime: Serial Killers, Murders, Stalkers, Cults, Forensic Analysis\n Psychology: Mental Illness, Personality Disorders, Social Phenomenon, Mob Mentality, Psychosis\n Culture: Sexuality, Satanic Panic, Relationships, TV Analysis, Movie Analysis, Character Analysis\n We are an independent psychology podcast. Help us keep UPC free of ads and on the air by supporting the show. Additionally, gain access to our \u0022Stalkers Only\u0022 archive, and help be a part of the creative process.\n Support the Show! —\u003E patreon.com/upcpodcast ",
      "release": "2021-02-02T19:33:00Z",
      "duration": "00:47:09",
      "explicit": false,
      "spotifyId": "3OCLO7oIcKu8n3TxSjvuqI",
      "appleId": 1000507480856,
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3OCLO7oIcKu8n3TxSjvuqI",
        "apple": "https://podcasts.apple.com/podcast/escaping-the-house-of-yahweh/id1161583100?i=1000507480856"
      }
    }
  ]
}