{
  "id": "685ae3c0-217f-4eec-9e10-5e88ef64c90d",
  "name": "Documentary Central",
  "youTubeChannelId": "UCp4wHZCrDhITkiUILOd4gRw",
  "episodes": [
    {
      "id": "318e4e2a-383b-4a37-9adf-096d077f653c",
      "title": "Inside the World of Cults | Cults, Taboos And Twisted Faith | @DocoCentral",
      "description": "Step inside the dark, sinister and complex world of cults and sects, where the power of one can lead to the ultimate control of many. Through survivor stories and first-hand testimony, this documentary reveals how the ‘desire to belong’ can collide with the abuse of power, leading to dangerous and life-changing situations. Most ‘victims’ are seemingly ordinary people who become trapped in an organisation intent on destroying their belief system. But how do cults and sects start? What makes people join? And when do people realise they need to get out? Featuring survivors of The Children of God, The O and The Exclusive Brethren.\n\nDocumentary Central is the home for compelling documentaries tackling subjects like history,  climate change, wildlife, conspiracy and more. Subscribe so you don\u0027t miss out\n\nSubscribe for more Documentary Central 👉 https://bit.ly/3yslxbL\n\nYour support fuels our exploration!  Help us uncover new stories and share diverse voices by donating to our channel through Super Thanks!\n\nMore amazing playlists Below!\nExtraordinary Documentaries 👉 http://bit.ly/3ycvSI6\nConspiracy Theories 👉 http://bit.ly/3SNtbq9\nHistory Documentaries 👉 http://bit.ly/3moYtaG\nDocumentaries on War 👉 http://bit.ly/3IRvrbk\nNature Documentaries 👉 http://bit.ly/3SP5ZYo\n\n**This title is under license from Silverlining. All rights reserved**\n\n#Documentary #socialimpact #cults",
      "release": "2024-07-27T19:00:07Z",
      "duration": "00:41:56",
      "explicit": false,
      "youTubeId": "GLqMkXZdnHY",
      "subjects": [
        "Cult Psychology",
        "Children Of God",
        "Plymouth Brethren Christian Church",
        "The O (political group)"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GLqMkXZdnHY"
      }
    }
  ]
}