{
  "id": "4a67b381-bc86-4831-a0be-3624ca30c6b5",
  "name": "Documentary Vault",
  "youTubeChannelId": "UCjD2hhUF5R8G9oAjOzQo26w",
  "episodes": [
    {
      "id": "46e509b2-9ec3-4f0e-aa06-a68c745d6102",
      "title": "Mayan Murder Cults? The Brutal Rise of the Warrior Guilds",
      "description": "The jungle of the Yucatan hides a history written in blood and stone. Long before the modern world took shape, Chichén Itzá stood as a massive metropolis that functioned through a complex system of military might and ritual execution. This documentary explores the transition of a peaceful civilization into a predatory state ruled by elite warrior unions who decorated their plazas with thousands of human remains. You will see how the magnificent El Castillo pyramid served as a massive stage for public executions, designed to terrify enemies and satisfy a feathered serpent god.\n\nWelcome to Documentary Vault, your go-to source for fascinating documentaries on topics ranging from baffling true crime and paranormal mysteries to incredible stories of survival and history\u0027s biggest moments. If you\u0027re curious about the world and love to learn, you\u0027ve found your new obsession. \nSubscribe now and unlock a world of real-life stories!\nClick here: https://bit.ly/3ivnDhE\n\n#truestories",
      "release": "2026-01-14T12:00:04Z",
      "duration": "00:50:20",
      "explicit": false,
      "youTubeId": "1oeZyOeczhU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1oeZyOeczhU"
      }
    },
    {
      "id": "8496df92-bd60-4720-92a8-0247d83871d5",
      "title": "The Moonies: Escaping the World\u0027s Strangest Cult",
      "description": "Reverend Sun Myung Moon, founder of the Unification Church, claimed to be the Messiah and built a global empire through thought reform, mass weddings, and strict control over followers. Born in North Korea in 1920, he used manipulative recruitment tactics, amassing wealth through businesses and politics. Despite legal troubles, his followers saw him as a persecuted prophet. Many ex-members describe the church as a controlling cult, leaving lasting psychological scars.\n\nWelcome to Documentary Vault, your go-to source for fascinating documentaries on topics ranging from baffling true crime and paranormal mysteries to incredible stories of survival and history\u0027s biggest moments. If you\u0027re curious about the world and love to learn, you\u0027ve found your new obsession. \nSubscribe now and unlock a world of real-life stories!\nClick here: https://bit.ly/3ivnDhE\n\n#truestories #moonies",
      "release": "2025-11-04T20:00:02Z",
      "duration": "00:44:31",
      "explicit": false,
      "youTubeId": "2J1ZtfKHKMc",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2J1ZtfKHKMc"
      }
    },
    {
      "id": "3615cc39-13a1-4047-b48d-9ba0430712ed",
      "title": "Inside the Satanic Cult of the Monster of Florence",
      "description": "Unlock the chilling secrets of Italy\u0027s most notorious cold case, the Monster of Florence, a fifty-year-old saga of serial murder and institutional corruption that still haunts the nation today. This documentary takes you inside the terrifying ritualistic killings of eight young couples, revealing how cover-ups and deception by powerful figures—from high-ranking officials and police to secret societies like the Freemasonry—have obstructed justice and shielded the masterminds. Follow the twisty investigation through failed leads, including the conviction of the \u0022picnicking friends,\u0022 the mysterious death and body-swap of a doctor, and the ignored trail of a violent ex-Foreign Legionnaire, all while exploring the sinister theory of an elite satanic sect commissioning these gruesome acts. This is the shocking true story of a miscarriage of justice, countless silenced witnesses, and a decades-long search for truth against an untouchable \u0022upper level\u0022 conspiracy, forcing us to ask who the real Monster of Florence truly was.\n\nWelcome to Documentary Vault, your go-to source for fascinating documentaries on topics ranging from baffling true crime and paranormal mysteries to incredible stories of survival and history\u0027s biggest moments. If you\u0027re curious about the world and love to learn, you\u0027ve found your new obsession. \nSubscribe now and unlock a world of real-life stories!\nClick here: https://bit.ly/3ivnDhE\n\n#truestories #retold",
      "release": "2025-10-22T16:00:50Z",
      "duration": "01:35:23",
      "explicit": false,
      "youTubeId": "P42F-nymyxk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P42F-nymyxk"
      }
    },
    {
      "id": "8b3b110c-d709-4881-b9c0-98e2aff65258",
      "title": "Religious Cult Headed By Murderous Man: Temple of Fear | The FBI Files",
      "description": "The decapitation of a young male leads police and FBI agents to a notorious cult, where agents convince a member to betray the charismatic leader.\n\nReal FBI cases are recounted through reenactments and interviews with law enforcement and forensic scientists.\n\nRetold - Documentaries \u0026 Reconstructions.\n\nContent licensed by New Dominion Pictures. Any queries, please contact us at owned-enquiries@littledotstudios.com\n\nWant to watch more docudramas? \nClick here: https://bit.ly/3ivnDhE",
      "release": "2022-12-08T20:00:11Z",
      "duration": "00:50:16",
      "explicit": false,
      "youTubeId": "ctmzpJdPheA",
      "subjects": [
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ctmzpJdPheA"
      }
    },
    {
      "id": "bbf72fa9-e6e3-46d0-b4bd-af3c755ee8a6",
      "title": "The Manson Family (1997) | Full Crime Documentary/ Film | Retold",
      "description": "A cross between documentary and retelling, covering the lives of Charles Manson and his followers from their early days on Spahn Ranch recording music to the horrific murders of the Family in later months.\n\nContent licensed by MVD. Any queries, please contact us at owned-enquiries@littledotstudios.com\n\nWant to watch more docudramas? \nClick here: https://bit.ly/3ivnDhE",
      "release": "2022-10-22T19:00:10Z",
      "duration": "01:35:09",
      "explicit": false,
      "youTubeId": "EdhsSOtlpWc",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EdhsSOtlpWc"
      }
    },
    {
      "id": "9264e2af-45aa-4808-ae0a-f53fbadc24bf",
      "title": "Jonestown Massacre: Survivors Tell Their Stories",
      "description": "This dramatic documentary drama tracks the final build-up to a horrific doomsday: the infamous mass murder and suicides of Jim Jones\u0027 cult followers in the jungles of Guyana, where over 900 men, women, and children died on November 18, 1978.\n\nContent licensed from Cineflix. Any queries, please contact us at: owned-enquiries@littledotstudios.com\n\nWant to watch more docudramas? \nClick here: https://bit.ly/3ivnDhE\n\n#Jonestown #Docudrama #Documentary",
      "release": "2021-01-30T18:00:08Z",
      "duration": "01:39:16",
      "explicit": true,
      "youTubeId": "YW8MbTA2WpM",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YW8MbTA2WpM"
      }
    }
  ]
}