{
  "id": "57b553db-ec77-4ce3-9f87-98ee6a12c1d2",
  "name": "Doing Business with a Servants Heart",
  "youTubeChannelId": "UCkgN4ZO83lPjCJtuv0LeOJw",
  "episodes": [
    {
      "id": "34364762-f8b4-4de1-9cc5-0b8323e655d3",
      "title": "Dr Robyn Lynette: From Cult Survivor to Mental MacGyver",
      "description": "\u0022I wrote 110,000 words in 40 days because my healing demanded to be heard.\u0022\nWhat if your entire identity was built on someone else’s story?\n\nIn this powerful, deeply personal episode, Steve Ramona welcomes back Dr. Robyn Lynette for a part two conversation that strips away pretense and dives straight into transformation. Dr. Robyn doesn\u0027t just tell a story. She embodies resilience. Born into a cult, forced into marriage with her cousin at 18, and later entangled with the cartel, her life reads like a novel—but it’s all heartbreakingly true. Through vivid moments of chaos and clarity, Dr. Robyn shares how she reclaimed her agency, rewrote her identity, and emerged as a rock of stability for high-level clients navigating their own personal hurricanes.\n\nWith fierce clarity and disarming warmth, she reveals the journey behind her viral memoir, I\u0027d Like to Thank the Cartel for Getting Me Out of the Cult, and what it means to become the Mental MacGyver—someone who can guide others out of chaos but will never swim out to save someone unwilling to save themselves.\n\nWhether you\u0027re facing your own storm or helping others weather theirs, this episode offers tangible insight into healing, identity, and the quiet strength of doing the next right thing. Steve\u0027s signature servant-hearted presence meets Dr. Robyn\u0027s emotional intelligence in an unforgettable exchange of purpose, power, and perspective.\n\nP.S. The first three listeners to reach out to Dr. Robyn will receive a free copy of her book, personally gifted by Steve. It might just change your life.\n\nGuest Bio\n\nDr. Robyn Lynette is a former cult member turned executive clarity coach, known affectionately by her clients as the \u0022Mental MacGyver.\u0022 After surviving extreme emotional, physical, and psychological trauma, she reclaimed her life and identity, earning three degrees in six years, including a doctorate. Today, she guides celebrities, founders, and executives through chaos with deep wisdom and clarity, helping them anchor back into themselves. Her memoir, I\u0027d Like to Thank the Cartel for Getting Me Out of the Cult, is a testament to the power of self-agency and emotional healing.\nhttps://thankthecartel.com/\nhttps://mentalmacgyver.com/\n\n\nShout out to my Sponsor A mind for All Seasons\nYour brain is your greatest competitive edge—and it deserves to perform like one.\nWant to think faster, remember more, and stay focused longer?\nJust text the word \u0022optimize\u0022 to 72000 and get instant access to 6 short, powerful videos—each just 3 to 5 minutes—that reveal simple strategies to unlock peak mental performance.\n\nBecause when your brain is clear, your business grows.\n\n\nDoing Business with a Servant\u0027s Heart Named Top 20 Small Business Marketing Podcast\nhttps://podcast.feedspot.com/small_business_marketing_podcasts/\n\nSubscribe to our NEWSLETTER: https://doing-business-with-a-servants-heart.kit.com/628f9d5962\n\nOrder our SERVING JOURNAL: https://www.amazon.com/dp/B0CSNSY1M1",
      "release": "2026-02-02T18:12:31Z",
      "duration": "00:28:04",
      "explicit": false,
      "youTubeId": "aOvCfF6dD18",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aOvCfF6dD18"
      }
    }
  ]
}