{
  "_ts": 0,
  "id": "3d3631b1-4d59-4c7c-86ee-89c986163b4b",
  "name": "Dom Harvey",
  "spotifyId": "3A9ahwqQO5Uxd4SUqlsIRL",
  "appleId": 1590931602,
  "youTubeChannelId": "UCmisXR3N9fP_K6J255VLtaw",
  "episodes": [
    {
      "id": "c76d8db0-5ce0-49e9-875e-0cee8efa004e",
      "title": "Gloriavale Survivor - Exposing Abuse \u0026 Cult in India, Consequences of Leaving",
      "description": "At just 18 years old, Theo Pratt made the terrifying decision to leave the Gloriavale cult and everything she’d ever known—her family, her home, her entire way of life- absolutely everything she had known since birth.\n\nShe was dropped at a bus stop with just a suitcase, $200 cash, and no idea what came next.  Then after some heartbreaking final words from her mum and brother, she took her first ever bus into the unknown.\n\nWhat she has done in the 8 years since then is impressive.  She has built a cool life for herself including learning all the life skills we all take for granted- like opening a bank account, getting her first phone and grocery shopping.\n\nShe has also got a degree, become an occupational therapist, fallen in love and bought a house. Oh, and now writing a book: “Unveiled.”\n\nHere’s a link for the book:  https://www.mightyape.co.nz/mn/buy/mighty-ape-unveiled-39218988/\n\nAnd she has become a fierce advocate for those still trapped in Gloriavale, like her sister Precious, and those trying to rebuild after leaving.\n\nThis is a small part of the Theo Pratt story.  A revealing look into day-to-day life as a child in Gloriavale, the process of leaving then the unseen struggle of rebuilding.\n\n***\n\nThanks to the sponsors of this episode, the team at Generate.\n\nGenerate have a track record of delivering strong long-term performance for their members – which will really pay off by the time you reach retirement.\n\nAnd, they have advisers across the country to help make sure your investment is set up best for you.\n\nHead to generatekiwisaver.co.nz/dom\n\nThe issuer of the scheme is Generate Management Limited. To see their Product disclosure statement, go to their website.  Past performance does not guarantee future returns.\n\n**The views, thoughts and opinions expressed in this podcast belong solely to the host and guests and may not reflect the views of the show sponsors**\n\n00:00 Who is Theo Pratt\n11:53 The Impact of Leaving Gloriavale\n23:56 Cultural Shock and New Discoveries\n41:07 The Departure: Leaving Gloriavale\n56:30 Navigating Newfound Freedom\n01:06:13 Sisterly Bonds and Ongoing Struggles\n01:19:29 Looking Ahead: Future Aspirations",
      "release": "2025-03-02T05:30:15Z",
      "duration": "01:20:13",
      "explicit": false,
      "spotifyId": "7A0UtkEjIQPsyMFsVIRrG2",
      "appleId": 1000697151779,
      "youTubeId": "YipRE4VxO3U",
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7A0UtkEjIQPsyMFsVIRrG2",
        "apple": "https://podcasts.apple.com/podcast/gloriavale-survivor-exposing-abuse-cult-in-india-consequences/id1590931602?i=1000697151779",
        "youtube": "https://www.youtube.com/watch?v=YipRE4VxO3U"
      }
    }
  ]
}