{
  "id": "c96786ef-c66b-4c00-aa1c-943e69f1b6ee",
  "name": "Don\u0027t Wait for Everybody",
  "appleId": 1703851437,
  "episodes": [
    {
      "id": "7f3d8866-4e72-489a-9223-09b2c0b40a99",
      "title": "Don’t wait for the influencers.",
      "description": "Notes \u0026 Transcript: https://chloehumbert.substack.com/p/dont-wait-for-the-influencers\n(Transcript is below)\nReferences:\nThe FTC under Lina Khan’s leadership is good for public safety and freedom from corporate authoritarianism. wat3rm370n / tumblr Sep 18th, 2024 \nAll politics is local. wat3rm370n / tumblr Sep 10th, 2024 \nPodcasters can “get political” - wat3rm370n / tumblr Aug 28th, 2024 \nFraudulent Appeal to Authority. The tactic of citing sources that don’t actually back up a claim. This ploy utilizes the halo effect, anchoring bias, the mere exposure effect, autopilot thinking, and informational learned helplessness. And it’s fraud. Chloe Humbert Feb 09, 2024 \nThe International Retail Academy – Kayleigh Fazan – Sep 11, 2022 – How to Make More Sales in Retail Through the Power of YES \nPsyblog — Grifters: The 7 Psychological Principles That Con Artists Use *- Dr Jeremy Dean — Posted on July 16, 2022 \nPsychology Today - Parasocial Relationships\nAlly, role model, or celebrity influencer? For Thee But Not For Me is not public health. A few things to consider regarding the social media public health cult of personalities and the appearance of impropriety. Chloe Humbert Jun 02, 2023\nCenter for Humane Technology – How Social Media Features Parallel Cult Techniques – Published on June 2, 2022 \nHigh Pressure Sales Techniques and How to Deal with Them\nDavid Pakman Show – Getting Cult Members Out of Cults (Rachel Bernstein Interview)\nRisky Shift, a groupthink exploitable vulnerability The group trolley cart wheels really do sometimes have a pull toward risk. Chloe Humbert Mar 19, 2023\nWhat is a Betrayal Trauma? What is Betrayal Trauma Theory? By Jennifer J. Freyd, PhD\nTribalGrowth – 7 Best Marketplaces To Buy \u0026 Sell Social Media Accounts (Ranked). by John Gordon \nSammy4723, anonymous pandemic influencer sock puppet account. Chloe Humbert · Apr 4, 2024\nFlorida Realtors - August 30, 2024 Your Guide to Becoming an Influencer\nMIT Initiative on the Digital Economy – Thinker-Fest: Session 1 – Fireside Chat – How to Fix the “Splinternet” Mar 3, 2023\nThe Internet of Fakes — PR Tactics, Troll Farms, Sock Puppets, Botnets, Influencers, Operatives, \u0026 Chaos Agents. A collection of evidence of persuasion, advertising, sales, target marketing, propaganda, agent provocateurs, and cognitive warfare - the true reality of the media landscape. Chloe Humbert Sep 14, 2023\nSupliful How to Make Money From Subreddits: A Step-by-Step Guide July 17, 2024\nTech Talk Down Under - 6 effective indirect marketing activities you can implement in your business - Zoho Thilak Last Updated : June 12, 2023\nMIT Initiative on the Digital Economy April 19 – Filippo Menczer, Indiana University published Dec 21, 2022 \nBBC Trending (podcast) – Brazil’s real life trolls – Sun 23 Apr 2023 \nUS conservative influencers say they are ‘victims’ of Russian disinformation campaign - Tim Pool, Dave Rubin and Benny Johnson addressed allegations that a company they were associated with had been paid to publish videos with messages in favour of Russia - Guardian staff and agencies Wed 4 Sep 2024 23.17 EDT \nThe information gig economy. wat3rm370n / tumblr Sep 18th, 2024\nTEMPEST -  Posted April 28, 2023  Get off Twitter and get into the (online) streets How “Public Health Twitter” prevents us from reclaiming public space by Mary Jirmanus Saba and Zoey Thill\nSeek protection from noise and spiraling gloom Chloe Humbert Feb 16, 2023\nPsychology Today – Giving Up: Informational Learned Helplessness. It’s exhausting when it’s hard to figure out what is true and what is false. December 23, 2021 |  Susan A. Nolan, Ph.D., and Michael Kimball, Reviewed by Jessica Schrader \nWilliamson, P. Take the time and effort to correct misinformation. Nature 540, 171 (2016). https://doi.org/10.1038/540171a \nTIME: How Addictive Social Media Algorithms Could Finally Face a Reckoning in 2022 By Megan McCluskey JANUARY 4, 2022 \nWriting Le",
      "release": "2024-09-21T11:07:00Z",
      "duration": "00:42:29",
      "explicit": false,
      "appleId": 1000670243194,
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/dont-wait-for-the-influencers/id1703851437?i=1000670243194"
      }
    }
  ]
}