{
  "id": "20cd7efa-a424-43c4-9507-2f687b8832b8",
  "name": "Don’t be afraid to Talk -  Podcast with James Lumumba",
  "spotifyId": "3YoPFGxhWwbKDwDiIuXclP",
  "appleId": 1583988945,
  "youTubeChannelId": "UCcYymiPYHAdMrErMPgU6rCA",
  "episodes": [
    {
      "id": "2b8df94f-e5dd-48ab-9d82-7a4f6bc41e66",
      "title": "Religious Trauma, Cults \u0026 Spiritual Abuse with Nikki G",
      "description": "In this episode of \u0022Ask the Therapist,\u0022 host James is joined by Nikki G, a recovery coach and educator specializing in religious trauma and spiritual abuse. Nikki shares her personal journey as a survivor of a narcissistic family system and her experiences in five different cults. She discusses the concept of \u0022cult hopping,\u0022 where individuals seek new communities after leaving toxic environments, often without processing their past experiences. The conversation delves into the definitions of religious trauma, spiritual abuse, and religious trauma syndrome, highlighting the psychological and emotional impacts of these experiences. Nikki emphasizes the importance of education and critical thinking in recovery, particularly for those raised in strict religious environments where questioning authority is discouraged. Listeners will gain insights into the dynamics of power and control within religious communities, the challenges of navigating mental health issues in a faith context, and the need for resources tailored to marginalized communities. This episode aims to raise awareness about the prevalence of religious trauma and the importance of healing and support for survivors. Join us for an enlightening discussion that encourages open-mindedness and understanding. Timestamps 00:01:15 - Nikki\u0027s Background and Personal Journey 00:13:08 - The Process of Spiritual Manipulation 00:25:06 - Indoctrination and Fear in Families 00:32:25 - The Misuse of Scriptures 00:46:43 - Narcissism in Religious Leaders Follow: Nikki G INSTAGRAM: ⁠ https://www.instagram.com/nikki_g_speaks/ WEBSITE: https://www.nikkigspeaks.com/ FACEBOOK: https://www.facebook.com/nikkig.speaks/ linktr: https://linktr.ee/nikkigspeaks If you would like to share your story and help inspire others or have a perspective on Mental Health, please contact me for our conversation. Follow The Show: INSTAGRAM: https://www.instagram.com/dontbeafraidtotalk/ FACEBOOK: https://www.facebook.com/Dontbeafraidtotalk/ Your Mental Health information line - Ireland Mental Health Ireland: 01 284 1166 Pieta House: 1800 247 247 Suicide or Survive (SOS): 01 272 2158 Aware: 1800 80 48 48 Samaritans: 116 123 LGBT Ireland: 1800 929 539",
      "release": "2024-09-08T08:51:40Z",
      "duration": "01:17:12.5820000",
      "explicit": false,
      "spotifyId": "6tLmHFFuA9WmpySnpNwPNi",
      "appleId": 1000668766316,
      "youTubeId": "AzFXs7aLt2A",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6tLmHFFuA9WmpySnpNwPNi",
        "apple": "https://podcasts.apple.com/podcast/religious-trauma-cults-spiritual-abuse-with-nikki-g/id1583988945?i=1000668766316",
        "youtube": "https://www.youtube.com/watch?v=AzFXs7aLt2A"
      }
    }
  ]
}