{
  "id": "15ef8c0a-b890-41c1-b232-9d635c9365a4",
  "name": "Dos and D",
  "spotifyId": "6xhFg4CkHLpHwvumt8lRwA",
  "appleId": 1521120399,
  "youTubeChannelId": "UCIRzwNFkau-fUwg4jUweL_g",
  "episodes": [
    {
      "id": "f4899fa9-a93c-4650-b3ce-9b551ea1a487",
      "title": "Othniel Chisi - Inside one of the World\u0027s Largest Cults",
      "description": "Othniel Chisi spent 3 years inside one of the world\u0027s largest cults! This might just be the wildest and craziest story we\u0027ve ever heard in the history of the Dos \u0026 D Show. Ote joined us on the show to tell us exactly what goes on inside cults. From the day he was approached by one of the members, to being completely brainwashed and spending 3 years inside the organisation. He shares the tactics they use to manipulate, how they recruit, the crazy rules inside and even the movies they make you watch to help with the brainwashing! Ote opens up about how his life changed and the 21 hour work days he completed all in the name of the cult. Plus, what the leader was REALLY doing and how they make money. Othniel takes us to the moment he realised he was part of a cult and how he got out of it. And why he was so shattered when he realised what had happened. Show notes doesn\u0027t do this episode justice as there is just so much to unpack in this unbelievable story but one things for sure...how cults work will shock you and maybe even scare you! We are incredibly grateful to Ote for sharing his story with us, we know you will find it fascinating. Enjoy Othniel\u0027s story! Follow Othniel on Instagram @otechisi This episode is brought to you by Fleet Plant Hire Solutions. Head to www.fph.com.au for all your earth moving needs! Check out Victoria\u0027s greatest Ford Dealership at www.bayfordford.com.au Check out the new 725 Series at Tour Edge Golf Official Site | Golf Clubs, Golf Bags Look good, smell good, feel good through Milkman\u0027s grooming products! www.milkmanaustralia.com Follow us on Instagram @dosandd_ Follow us on TikTok @dosandd Watch \u0026 Subscribe to our YouTube Channel here - Dos and D - YouTube Follow us on Facebook here - The Dos \u0026 D Show | Facebook Questions \u0026 Enquiries - thedosanddshow@gmail.com",
      "release": "2025-01-12T13:00:19Z",
      "duration": "01:20:29.2950000",
      "explicit": false,
      "spotifyId": "0fmKWwtJ7eaqUO3aHk98ho",
      "appleId": 1000683658619,
      "youTubeId": "s3ZKRPbc2Lk",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0fmKWwtJ7eaqUO3aHk98ho",
        "apple": "https://podcasts.apple.com/podcast/232-othniel-chisi-inside-one-of-the-worlds-largest-cults/id1521120399?i=1000683658619",
        "youtube": "https://www.youtube.com/watch?v=s3ZKRPbc2Lk"
      }
    }
  ]
}