{
  "id": "aa091a82-5b95-4f4f-bb36-6b9cb419762c",
  "name": "Dr. Becky Spelman",
  "spotifyId": "1qg1cr7I1c41jdSddSVaBL",
  "appleId": 1483472295,
  "youTubeChannelId": "UCMnGGc9JkhR6v5g8z4kDVdQ",
  "episodes": [
    {
      "id": "1e5201b6-dd42-4f99-ba49-1f6361a7f756",
      "title": "The Truth About Multi-Level Marketing (MLM) Pyramid Schemes | Psychology Behind Network Marketing - Episode 29",
      "description": "In Today’s podcast Dr. Becky speaks with Josie Naikoi known on YouTube as ‘Not the Good Girl’. Josie talks about her experience working for three different multi-level marketing companies, Josie reached the top 1% during her time working for these companies, which meant she was one of the few people who were making a profit. At Josie’s highest point of success, she made $106,000 a year, however, she had not been advised correctly on how to pay the correct taxes which lead her into a battle with the IRS. Josie also explains that as well as this stressful situation involving the taxes she also realised she was working all the time and was not allowed to take any time off, this lead Josie to realise she would never have a healthy working life whilst continuing to work for multi-level marketing companies. When Josie left Multi-Level Marketing, she realised that the business of multi-level marketing is a ‘commercial cult’ where there is an unhealthy level of negativity within these organisations. Josie also discusses that she was never allowed to voice her opinions as these would go against the beliefs of the companies. Josie highlights the similarities between Multi-Level Marketing and cults and also discusses how these companies brainwash individuals and how it is actually very hard for these people to actually earn a living through Multi-Level Marketing. It was a difficult decision for Josie to leave this industry due to the high level of income she was earning, however, she was able to recognise that she was unhappy in this business. When Josie finally managed to break away from multi-level marketing she was then blocked and unfriended by many of her previous colleagues within multi-level marketing. Josie now speaks out against Multi- level marketing to help raise awareness of the realities of this industry and to help others also break free from network marketing. Support the Show.",
      "release": "2024-05-30T13:00:00Z",
      "duration": "01:01:08.7670000",
      "explicit": false,
      "spotifyId": "4i9W4mokbJONbKgO5EoYYL",
      "appleId": 1000657345921,
      "youTubeId": "cubJP_OP8ng",
      "subjects": [
        "Multi-Level Marketing",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4i9W4mokbJONbKgO5EoYYL",
        "apple": "https://podcasts.apple.com/podcast/the-truth-about-multi-level-marketing-mlm-pyramid/id1483472295?i=1000657345921",
        "youtube": "https://www.youtube.com/watch?v=cubJP_OP8ng"
      }
    },
    {
      "id": "ed595382-53db-4862-a888-537da07ce484",
      "title": "I am a narcissist with BPD | Psychologist interviews a Narcissist with Borderline Personality - Episode 28",
      "description": "Psychologist Dr. Becky Spelman interviews Kylee Rackham who is a diagnosed Narcissist who also has Borderline Personality Disorder, Kylee unveils their personal healing journey from the effects of medical trauma during their childhood years, which led to profound trust issues and the development of their personality disorders. With openness and insight, Kylee discusses the overlapping symptoms of BPD and NPD, along with her transformative experience with therapy. In this compelling episode, we challenge the prejudices and misconceptions about personality disorders, especially in the context of romantic relationships. Kylee offers a unique perspective on the obstacles and triumphs of dating with a personality disorder, debunking the myth that people with these conditions cannot change or establish stable relationships, Reflecting on their personal growth, the importance of self-awareness, and the delicate decision of disclosing one\u0027s diagnosis, Kylee provides invaluable insights for anyone aiming to understand the complexities of mental health. Immerse yourself in an episode that not only elevates the experiences of those living with personality disorders but also serves as an inspiring testament to the power of empathy and the human capacity for change. Support the Show.",
      "release": "2024-05-29T19:00:00Z",
      "duration": "00:46:36.0680000",
      "explicit": false,
      "spotifyId": "3NRIui62efqLGn1ByNrhYg",
      "appleId": 1000657210889,
      "youTubeId": "lBtKmnUIk4I",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3NRIui62efqLGn1ByNrhYg",
        "apple": "https://podcasts.apple.com/podcast/i-am-a-narcissist-with-bpd-psychologist/id1483472295?i=1000657210889",
        "youtube": "https://www.youtube.com/watch?v=lBtKmnUIk4I"
      }
    },
    {
      "id": "4000aa0d-710a-4b30-912f-b262de285216",
      "title": "An interview with a Sociopath - Antisocial Personality Disorder (ASPD) with Autism Spectrum Disorder. Episode 21.",
      "description": "#sociopath #psychotherapy #aspd In today\u0027s episode Dr. Becky Spelman talks with Greg Kimble who has been diagnosed with Antisocial Personality Disorder (ASPD) as well as Autism Spectrum Disorder (ASD). Antisocial Personality Disorder can be defined as a personality disorder characterised by persistent antisocial, irresponsible, or criminal behaviour, often impulsive or aggressive, with disregard for any harm or distress caused to other people, and an inability to maintain long-term social and personal relationships. Greg discusses his childhood experiences, feelings and behaviours that he can recall. Greg discusses his ASPD diagnosis openly and explains his compulsive behaviours and lack of regard for others. Greg also discusses his drug addiction and how that started, Greg says he struggled seeing risks or consequences for some of his behaviours. Greg also explains the reason why he went to prison and his experience during his time in prison. Greg explains prison as \u0022a good experience\u0022 for him as this was where he was able to get clean from drugs and start therapy. Greg discusses his relationship now with his girlfriend Megan, they also film YouTube videos together and discuss their relationship and Greg\u0027s diagnosis. Megan\u0027s YouTube Channel (Greg\u0027s Girlfriend): https://www.youtube.com/meganeff Greg \u0026 Megan\u0027s Q\u0026A Video: https://www.youtube.com/watch?v=8Dy0P... Dr. Becky Spelman is a top Psychologist in London, Becky is the Clinic Director for Private Therapy Clinic which has clinic\u0027s based all around central London including; Harley Street, Wigmore Street, Bank, Earls Court \u0026 Canary Wharf. Becky uses Psychodynamic Therapy, Cognitive Behavioural Therapy (CBT), Eye Movement Desensitisation Reprocessing, Dialectical Behaviour Therapy (DBT) and Mindfulness to treat a range of difficulties with a particular interest in Borderline Personality Disorder and the difficulties that go with this condition such as relationship difficulties, anxiety, depression, low-self esteem, social anxiety, fear of public speaking, fear of intimacy, interpersonal difficulties, anger, body image issues, eating disorders and addictions. Support the Show.",
      "release": "2020-10-22T16:00:00Z",
      "duration": "00:54:08.3780000",
      "explicit": false,
      "spotifyId": "0ri5WMod0SeMgifgToZ3RK",
      "appleId": 1000495714611,
      "youTubeId": "LvZtiM3YO1w",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ri5WMod0SeMgifgToZ3RK",
        "apple": "https://podcasts.apple.com/podcast/an-interview-with-a-sociopath/id1483472295?i=1000495714611",
        "youtube": "https://www.youtube.com/watch?v=LvZtiM3YO1w"
      }
    },
    {
      "id": "68ed99ea-9a6a-432d-9396-349ba69d04d0",
      "title": "Living with Dissociative Identity Disorder (DID) Autumn Asphodel interview with Dr. Becky Spelman. Episode 14.",
      "description": "#DID #DissociativeIdentityDisorder #mentalhealth In this episode Elle Stone, known on social media as Autumn Asphodel discusses her experience with Dissociative Identity Disorder (DID), DID is a mental disorder where a person has at least two distinct personalities that alter their behaviour. DID is a highly complex condition that can have significant impact on the lives of individuals affected and those close to them. In this episode Elle explains her childhood and upbringing and goes on to discuss her different alters and where she thinks they began in her life, as well as her experience with therapy and the integration process. Elle touches on one of the alters \u0027The Controller\u0027 that developed through the negativity and trolling she received online, this alter was very abusive and destructive towards Elle. Elle explains her full process of integration which took 3- 4 years, which included addressing her previous traumas during therapy. Today, Elle has built her successful platform on YouTube and describes herself as a very dedicated and determined individual. Elle explains part of the reason she started her YouTube channel was to connect further with her therapist, and has grown over the past 7 years. Dr. Becky Spelman is a top Psychologist in London, Becky is the Clinic Director for Private Therapy Clinic which has clinic\u0027s based all around central London including; Harley Street, Wigmore Street, Bank, Earls Court \u0026 Canary Wharf. Becky uses Psychodynamic Therapy, Cognitive Behavioural Therapy (CBT), Eye Movement Desensitisation Reprocessing, Dialectical Behaviour Therapy (DBT) and Mindfulness to treat a range of difficulties with a particular interest in Borderline Personality Disorder and the difficulties that go with this condition such as relationship difficulties, anxiety, depression, low-self esteem, social anxiety, fear of public speaking, fear of intimacy, interpersonal difficulties, anger, body image issues, eating disorders and addictions. Subscribe to our YouTube channel: https://bit.ly/2N7kVT8 Autumn Asphodel YouTube Channel: https://www.youtube.com/user/AutumnAs... Elle Stone YouTube Channel: https://www.youtube.com/channel/UC95q... Autumn Asphodel Instagram: https://www.instagram.com/autumnaspho... For further help with this topic you can contact us here: info@theprivatetherapyclinic.co.uk/ BUSINESS INQUIRIES becky@privatetherapyclinic.com Support the Show.",
      "release": "2020-10-01T15:00:00Z",
      "duration": "00:54:10.4160000",
      "explicit": false,
      "spotifyId": "79TMGt2DwOczR19BhPOcNb",
      "appleId": 1000493310657,
      "youTubeId": "F2R8IOoBqhc",
      "subjects": [
        "Self-Help",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79TMGt2DwOczR19BhPOcNb",
        "apple": "https://podcasts.apple.com/podcast/living-with-dissociative-identity-disorder-did-autumn/id1483472295?i=1000493310657",
        "youtube": "https://www.youtube.com/watch?v=F2R8IOoBqhc"
      }
    },
    {
      "id": "8edb8ce2-4b9d-42f5-967f-8e457687ed09",
      "title": "Escaping from a Doomsday Cult - Claire Ashman\u0027s interview with Psychologist Dr. Becky Spelman. Episode 10.",
      "description": "#Cult #psychology #DoomsdayCult In today’s episode Dr. Becky speaks with Claire Ashman, a Doomsday cult survivor, who was forced to join the cult in New South Wales, Australia by her ex-husband. Claire spent 8 years as part of the cult with her 8 children and husband and left the cult to begin her the new chapter of her life 13 years ago. Claire took her first steps to leave the cult by attending church outside of the Doomsday community with her children, she then wrote letters to the cult leader challenging his authority, due to these steps Claire then received an eviction notice from the cult giving Claire and her family 12 days to leave. Claire was relieved she was able to escape the community however her husband wanted to stay but they were forced to leave as a family. This is Claire’s story where she discusses what she experienced and what her life looks like now. It is not a therapy session; however, it does cover the Psychological impact of what Claire experienced. Some people may find the content of this interview distressing. Dr. Becky Spelman is a top Psychologist in London, Becky is the Clinic Director for Private Therapy Clinic which has clinic\u0027s based all around central London including; Harley Street, Wigmore Street, Bank, Earls Court \u0026 Canary Wharf. Becky uses Psychodynamic Therapy, Cognitive Behavioural Therapy (CBT), Eye Movement Desensitisation Reprocessing, Dialectical Behaviour Therapy (DBT) and Mindfulness to treat a range of difficulties with a particular interest in Borderline Personality Disorder and the difficulties that go with this condition such as relationship difficulties, anxiety, depression, low-self esteem, social anxiety, fear of public speaking, fear of intimacy, interpersonal difficulties, anger, body image issues, eating disorders and addictions. Support the Show.",
      "release": "2020-09-24T18:00:00Z",
      "duration": "01:00:01.4750000",
      "explicit": false,
      "spotifyId": "2aGaquwY2BKnPUG25FSNL4",
      "appleId": 1000492475882,
      "youTubeId": "79mRDA9O_1I",
      "subjects": [
        "Order of St Charbel",
        "Catholicism",
        "Psychology",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2aGaquwY2BKnPUG25FSNL4",
        "apple": "https://podcasts.apple.com/podcast/escaping-from-a-doomsday-cult-claire-ashmans/id1483472295?i=1000492475882",
        "youtube": "https://www.youtube.com/watch?v=79mRDA9O_1I"
      }
    },
    {
      "id": "996d7286-3a13-4d16-9b69-a491995bf904",
      "title": "Breaking Free from Human Trafficking - Markie Dell\u0027s Interview with Dr. Becky Spelman. Episode 8.",
      "description": "In today’s episode Dr. Becky speaks with Markie Dell a former victim of Human Trafficking, who was trafficked after a \u0027new friend\u0027 invited Markie to join a lavish night out, the next morning was when Markie\u0027s world dramatically took a turn. At the time Markie was only 19 years old and described herself as \u0022very shy\u0022 she was forced to dance in a strip club in order to earn money to give to her friend who quickly became her \u0027pimp\u0027. Markie went from being a shy, young girl with a very small social circle to a forced lifestyle of alcohol, drugs, abuse and sex. Markie explains in this interview how she tried to break free from this lifestyle multiple times. Markie is now married and speaks very opening about human trafficking in order to raise awareness. This is Markie\u0027s story where she discusses what she experienced and what her life looks like now. It is not a therapy session, however, it does cover the Psychological impact of what Markie experienced. Some people may find the content of this interview distressing. Dr. Becky Spelman is a top Psychologist in London, Becky is the Clinic Director for Private Therapy Clinic which has clinic\u0027s based all around central London including; Harley Street, Wigmore Street, Bank, Earls Court \u0026 Canary Wharf. Becky uses Psychodynamic Therapy, Cognitive Behavioural Therapy (CBT), Eye Movement Desensitisation Reprocessing, Dialectical Behaviour Therapy (DBT) and Mindfulness to treat a range of difficulties with a particular interest in Borderline Personality Disorder and the difficulties that go with this condition such as relationship difficulties, anxiety, depression, low-self esteem, social anxiety, fear of public speaking, fear of intimacy, interpersonal difficulties, anger, body image issues, eating disorders and addictions. Support the Show.",
      "release": "2020-09-17T12:00:00Z",
      "duration": "01:00:17.0440000",
      "explicit": true,
      "spotifyId": "2avKp1qdgocnU1oDLypTLR",
      "appleId": 1000491639071,
      "youTubeId": "86WwqeA_w1Q",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2avKp1qdgocnU1oDLypTLR",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-from-human-trafficking-markie-dells-interview/id1483472295?i=1000491639071",
        "youtube": "https://www.youtube.com/watch?v=86WwqeA_w1Q"
      }
    },
    {
      "id": "449ae75f-0758-45ce-aec3-7c9ff8338186",
      "title": "Surviving R. Kelly - Asante McGee tells her story about her relationship with the singer. Episode 3.",
      "description": "This is another episode from a series Psychologist Dr. Becky Spelman regularly interviews individuals about their life stories. One of R. Kelly’s live-in girlfriends Asante McGee discusses the relationship she had with him in an interview with Psychologist Dr. Becky Spelman. Asante who is victim-turned-survivor describes how the singer controlling and abusive behaviour. In an emotional interview Asante also talks about the difficulties she has experienced since going public regarding what she experienced and how she has been trolled and targeted as a result of this. Support the Show.",
      "release": "2019-12-16T14:00:00Z",
      "duration": "00:34:03.7150000",
      "explicit": false,
      "spotifyId": "7qhQclfWOafKKx0l1GwWza",
      "appleId": 1000459849748,
      "youTubeId": "8_h2rozIbwg",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qhQclfWOafKKx0l1GwWza",
        "apple": "https://podcasts.apple.com/podcast/surviving-r-kelly-asante-mcgee-tells-her-story-about/id1483472295?i=1000459849748",
        "youtube": "https://www.youtube.com/watch?v=8_h2rozIbwg"
      }
    }
  ]
}