{
  "id": "988cd62c-ff4f-42c0-9d1b-a04b18af524e",
  "name": "Perfect Prey: A Coercive Control Podcast",
  "spotifyId": "4GybPLyjdiTAoJSbIIcRYK",
  "appleId": 1704962170,
  "youTubeChannelId": "UCF4ZdsbuXhzXqlnI5w54BFA",
  "episodes": [
    {
      "id": "3965ada9-1216-4b2d-a3f2-5b7644043538",
      "title": "The Weaponization of Children in Coercive Control",
      "description": "In this solo episode of Perfect Prey, I explore one of the most heartbreaking dynamics of coercive control: the weaponization of children.\n\nChildren rely on their parents for safety, stability, and unconditional love. But when a predatory parent is operating within the family system, attachment can become fractured. Instead of growing up with secure connection, children are often indoctrinated into false narratives, exposed to subtle undermining, and pulled into loyalty binds they cannot cognitively or emotionally process.\n\nI explain how coercive control is the underpinning of all forms of abuse — psychological, legal, financial, physical, and emotional — and how, when an abuser can no longer control their partner, they often shift to controlling through the child.\n\nWe’ll talk about:\n\nHow attachment is formed — and how it can be fractured\n\nWhy children may come home dysregulated, angry, or oppositional\n\nHow subtle undermining and false narratives are planted\n\nThe difference between alienation rhetoric and attachment fracture\n\nWhy predatory parents rely on retaliation and loyalty conflicts\n\nHow protective parents can create “roadblocks” to manipulation\n\nWhat it means to respond instead of react — even when you are traumatized\n\nThis episode is especially for protective parents navigating post-separation abuse and family court dynamics. The reality is painful: children are often placed in impossible positions, forced into emotional roles they should never have to carry.\n\nBut there are ways to respond differently.\n\nIf you are watching your child struggle, unravel, or lash out after time with the other parent, this episode will help you understand what may be happening beneath the surface — and how to stay grounded in your role as the secure base.\n\nProtective parents are doing some of the hardest work there is. You are not alone.\n\nConnect with Dr. Christine\n\nProtective Parenting Program:\nhttps://www.coercivecontrolconsulting.com/services/for-parents/\n\nOfficial site:\nhttps://www.coercivecontrolconsulting.com/\n\nYouTube:\nhttps://www.youtube.com/@DrCocchiola-coercivecontrol/videos\n\nTikTok:\nhttps://www.tiktok.com/@dr.c_coercivecontrol\n\nInstagram:\nhttps://www.instagram.com/dr.cocchiola_coercivecontrol/\n\nBooks:\nhttps://url-shortener.me/c/FramedBook\n\nhttps://url-shortener.me/c/EveryMomentOfEveryDay\n\nIf this episode resonated, please share it with someone who needs this information, subscribe to Perfect Prey, and consider leaving a review. It helps other survivors and protective parents find validation and clarity.\n\n— Dr. Christine Cocchiola\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-02-20T17:01:32Z",
      "duration": "00:26:10",
      "explicit": false,
      "spotifyId": "2CFTFEgSk0fgcx442WJujd",
      "appleId": 1000750687542,
      "youTubeId": "r_qmKA8y2p8",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2CFTFEgSk0fgcx442WJujd",
        "apple": "https://podcasts.apple.com/podcast/the-weaponization-of-children-in-coercive-control/id1704962170?i=1000750687542",
        "youtube": "https://www.youtube.com/watch?v=r_qmKA8y2p8"
      }
    },
    {
      "id": "df755784-dcef-4430-b8cd-aab6193c751f",
      "title": "When Therapy Tells You to Change Instead of Naming the Abuse",
      "description": "In this episode, Dr. Christine Cocchiola discusses something many survivors quietly experience:\n\nBeing told — sometimes even in therapy — that if they just changed a little more, tried a little harder, or accommodated a little better… the relationship might improve.\n\nWhen coercive control is present, that advice can be deeply harmful.\n\n✨ In this video, Dr. Christine explores:\n\nTrauma bonding and intermittent reinforcement\n\n“Shapeshifting” to accommodate an abusive partner\n\nHow therapy can inadvertently reinforce subjugation\n\nWhy recognizing patterns creates empowerment\n\nThe power of boundaries — even when escape is complex\n\nHow protective parents become the light guiding their children toward clarity\n\nWhen you begin to see the pattern, there is power in that awareness.\nWhether you choose to stay, set boundaries, or prepare to leave — clarity is different than confusion.\n\nAnd for protective parents: your children are watching.\nWhen you reclaim your agency, they see what freedom looks like.\n\n💙 There is no judgment here. Only education, validation, and empowerment.\n\n🌿 Join Dr. C’s Community for support and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n🎓 Interested in professional training?\nDr. C’s Coercive Control Professionals Training and Protective Parenting Program are enrolling again soon.\n\n#CoerciveControl\n#TraumaBond\n#ProtectiveParents\n#EmotionalAbuse\n#DomesticAbuseAwareness\n#PersonalPower\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-02-13T17:00:59Z",
      "duration": "00:03:44",
      "explicit": false,
      "youTubeId": "XfVh9t0ufHY",
      "subjects": [
        "Cult Psychology",
        "One-on-one"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XfVh9t0ufHY"
      }
    },
    {
      "id": "dcab148b-d5b3-4530-96cf-cd58bf801a35",
      "title": "The Danger of Couples Therapy in Coercive Control",
      "description": "In this episode, Dr. Christine Cocchiola speaks directly to both therapists and survivors about a difficult but critical truth:\n\nCouples therapy can be dangerous when coercive control is present.\n\nWhen there is a pattern of power over, inequity, and manipulation, attempting to “bring the couple together” can unintentionally:\n\nEmpower and embolden the abuser\n\nGive false hope to the victim\n\nKeep someone trapped in a harmful dynamic\n\nReinforce manipulation inside the therapy room\n\nDr. Christine shares her own experience of having a therapist name the abuse — and how that truth became a thread she returned to over and over again.\n\n✨ If you are a therapist, this is a call to discern patterns of coercive control and recognize when reconciliation is not the goal — safety is.\n✨ If you are a survivor, this is your reminder to listen to your body. Patterns matter. Your intuition matters.\n\nIf you are a professional and want to deepen your understanding, Dr. C offers a comprehensive Coercive Control Professionals Training (12 CEs) designed to equip clinicians with the tools needed to navigate these complex dynamics.\n\n💙 You are not alone. Clarity is power.\n\n🌿 Join Dr. C’s Community for validation, education, and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#CoerciveControl\n#CouplesTherapy\n#DomesticAbuseAwareness\n#ProtectiveParents\n#TraumaInformedCare\n#MentalHealthProfessionals\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-02-11T17:02:27Z",
      "duration": "00:03:27",
      "explicit": false,
      "youTubeId": "L6flYoRm-o8",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L6flYoRm-o8"
      }
    },
    {
      "id": "aa7d2b61-1a14-4079-aaa5-f2429505f811",
      "title": "When Apologies Aren’t Change: Listening to Your Body",
      "description": "In this episode, Dr. Christine Cocchiola explores why so many survivors feel compelled to give abusers another chance—and why patterns of behavior matter far more than apologies or promises to change.\n\nMany abusive partners beg, apologize, promise therapy, and momentarily improve. But when harmful behaviors repeat—verbal degradation, infidelity, intimidation, or DARVO—those patterns tell a deeper truth.\n\n✨ In this video, Dr. Christine discusses:\n\nWhy survivors disconnect from their body’s signals\n\nHow disassociation becomes a survival strategy\n\nThe impact of repeated “second chances” on children\n\nHow children mirror the regulation and suppression they observe\n\nWhy children often become weaponized as proxies in abuse\n\nNavigating impossible choices without judgment\n\nThis conversation is not about shaming survivors for staying or leaving.\nIt is about listening to the body, recognizing patterns, and understanding how children absorb and adapt to unsafe relational dynamics.\n\n💙 There is no judgment here—only clarity, compassion, and support.\n\n🌿 Join Dr. C’s Community for education, validation, and connection:\n👉 https://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#CoerciveControl\n#ProtectiveParents\n#DARVO\n#TraumaInChildren\n#DomesticAbuseAwareness\n#HealingFamilies\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-02-09T17:00:23Z",
      "duration": "00:03:44",
      "explicit": false,
      "youTubeId": "HC9ePt8fgvY",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HC9ePt8fgvY"
      }
    },
    {
      "id": "f515d71a-9084-4480-a0b6-e23d46d1e967",
      "title": "Coercive Control Is a War of Attrition with Laura Richards",
      "description": "In this episode of Perfect Prey, I’m joined by Laura Richards, a criminal behavioral analyst, former New Scotland Yard specialist, and one of the leading global voices on coercive control. Laura has been instrumental in changing laws on stalking and coercive control in the UK and internationally, and her work has helped shape policy, legislation, and professional practice worldwide.\n\nWe explore why coercive control is not about isolated incidents, but a patterned strategy of domination, entrapment, and power imbalance. Laura explains why coercive control is best understood as a war of attrition, how patriarchy and misogyny shape institutional responses, and why women and children are so often disbelieved—even when the evidence is present.\n\nThis conversation examines how legal systems, family courts, and law enforcement frequently fail victims and survivors, particularly at the point of separation, when risk escalates most dramatically. We also discuss why coercive control must be criminalized, why gender matters in risk assessment, and how language itself can either obscure or reveal abuse.\n\nWhat we cover\nWhat coercive control really is and why it’s a patterned form of abuse\nWhy victims and survivors are often disbelieved by systems meant to protect them\nCoercive control as “murders and suicides in slow motion”\nThe role of patriarchy, entitlement, and power imbalance in abuse\nWhy separation is the most dangerous time for women and children\nHow family courts can become a tool of post-separation abuse\nWhy protecting children requires protecting the non-abusive parent\nThe urgent need to criminalize coercive control globally\n\nWhy listen\nIf you are a survivor, protective parent, clinician, attorney, advocate, or policymaker, this episode offers critical insight into how coercive control operates beneath the surface of relationships and systems. Laura Richards brings clarity to why abuse is so often minimized, misunderstood, or reframed—and what must change to prevent further harm.\n\nGuest bio (short)\nLaura Richards is a criminal behavioral analyst, former New Scotland Yard specialist, and a leading international expert on coercive control, stalking, and violence against women. She helped create the DASH risk assessment model, founded the National Stalking Advocacy Service (Paladin), and played a central role in criminalizing coercive control in England and Wales. Laura is the author of Policing Domestic Violence and host of the Crime Analyst and Real Crime Profile podcasts.\n\nConnect with Dr. Christine\nOfficial site: https://www.thelaurarichards.com/\nInstagram: https://www.instagram.com/crimeanalyst?utm_source=ig_web_button_share_sheet\u0026igsh=ZDNlZDc0MzIxNw==\nX (twitter): https://x.com/thecrimeanalyst\nTiktok: https://www.tiktok.com/@crimeanalystpod\nYoutube: https://www.youtube.com/channel/UCksfRSwfwFqUCjcxKYju6_Q\nBooks: https://www.thelaurarichards.com/resources/books\n\nConnect with Dr. Christine\nProtective Parenting Program: https://www.coercivecontrolconsulting.com/services/for-parents/\nOfficial site: https://www.coercivecontrolconsulting.com/\nYouTube: https://www.youtube.com/@DrCocchiola-coercivecontrol/videos\nTikTok: https://www.tiktok.com/@dr.c_coercivecontrol\nInstagram: https://www.instagram.com/dr.cocchiola_coercivecontrol/\nTEDx Talk: https://www.youtube.com/watch?v=gp2qByKOue4\u0026t=24s\nBooks:https://url-shortener.me/c/FramedBook\nhttps://url-shortener.me/c/EveryMomentOfEveryDay\n\nIf this episode resonated, please share it with someone who needs this information, subscribe to Perfect Prey, and consider leaving a review to help other survivors find validation and clarity.\n— Dr. Christine Cocchiola \u0026 guest Laura Richards\n\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-02-06T16:30:21Z",
      "duration": "00:34:49",
      "explicit": false,
      "spotifyId": "3repp4qxqbTXoxKy4x8aNX",
      "appleId": 1000748559611,
      "youTubeId": "wqcCsyf8biE",
      "subjects": [
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3repp4qxqbTXoxKy4x8aNX",
        "apple": "https://podcasts.apple.com/podcast/coercive-control-is-a-war-of-attrition-with-laura-richards/id1704962170?i=1000748559611",
        "youtube": "https://www.youtube.com/watch?v=wqcCsyf8biE"
      }
    },
    {
      "id": "b99353cf-1f2e-44f9-9d84-e9650390e9ee",
      "title": "The Divorce Industrial Complex: Power, Control, and Family Court",
      "description": "In this episode, Dr. Christine Cocchiola, licensed clinical social worker and long-time advocate for protective parents, continues the conversation about collusion within the family court system.\n\nWhile not every professional lacks integrity, the reality is that too many systems benefit from prolonged conflict. As Dr. Christine explains, enormous amounts of money are generated through divorce, custody, and post-separation litigation—creating what many now call the divorce industrial complex.\n\nThese are not “high conflict” cases.\nThey are power-and-control cases.\n\n✨ In this video, Dr. Christine discusses:\n\nWhy family court is not immune to systemic harm\n\nHow money often equals power in custody disputes\n\nThe use of vexatious litigation as retaliation\n\nWhy coercive control continues post-separation\n\nWhy these dynamics are happening everywhere—not just in one state or country\n\nWhy these stories must be told for young people and future families\n\nThis is why Dr. Christine helped bring forward Framed: Women in the Family Court Underworld, a collection of 22 real stories from protective mothers around the world who experienced coercive control and systemic harm.\n\nDr. Christine also acknowledges protective fathers and shares that support spaces for protective dads exist, because this harm is not limited to one gender.\n\n💙 You have more influence than you realize.\nYou can help your children heal.\n\n🌿 Join Dr. C’s Community for education, validation, and support:\n👉 https://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#FamilyCourtAbuse\n#DivorceIndustrialComplex\n#CoerciveControl\n#ProtectiveParents\n#VexatiousLitigation\n#SystemicAbuse\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-02-04T17:00:37Z",
      "duration": "00:02:53",
      "explicit": false,
      "youTubeId": "Ksn1khSutu8",
      "subjects": [
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ksn1khSutu8"
      }
    },
    {
      "id": "d1bf8514-2294-4cf6-a5f8-8d625c4d58dd",
      "title": "There Is No “High Conflict Divorce” : There Is Power \u0026 Control",
      "description": "In this video, Dr. Christine Cocchiola, licensed clinical social worker and long-time advocate for protective parents, addresses one of the most misunderstood and damaging narratives in the family court system: the myth of “high conflict divorce.”\n\nWhat is often labeled as “high conflict” is, in reality, a power-over dynamic—where one parent systematically coerces, controls, and retaliates against the other. Over time, survivors may appear reactive, dysregulated, or adversarial, not because this reflects who they are, but because anyone trapped long enough will eventually push back.\n\nDr. Christine explains why protective parents—particularly protective mothers—are so often framed, disbelieved, and pathologized in family court, while perpetrators with a pattern of coercive control are overlooked or even rewarded.\n\n✨ In this episode, Dr. Christine discusses:\n\nWhy “high conflict” is a misleading label\n\nHow power and control show up in family court\n\nWhy survivors are often not believed\n\nHow victims behave outside abusive dynamics\n\nThe role of retaliation and vexatious litigation\n\nThe divorce industrial complex and systemic harm\n\nWhy character patterns—not reactions—matter\n\nThis work is deeply personal and deeply professional. It is why Dr. Christine co-authored Framed: Women in the Family Court Underworld, sharing 22 real stories of protective mothers from around the world who were harmed not only by abusers—but by systems meant to protect.\n\n💙 If this resonates, please subscribe and share.\nEducation changes outcomes.\n\n🌿 Join Dr. C’s Community for support, validation, and education:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#FamilyCourtAbuse\n#CoerciveControl\n#ProtectiveParents\n#DivorceIndustrialComplex\n#NotHighConflict\n#PowerAndControl\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-02-02T17:00:05Z",
      "duration": "00:03:07",
      "explicit": false,
      "youTubeId": "3GsukhXuUnk",
      "subjects": [
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3GsukhXuUnk"
      }
    },
    {
      "id": "4d03787a-3015-4f01-8180-fb5bef6f5b83",
      "title": "Predict. Prepare. Protect. Surviving an Abuser’s Retaliation",
      "description": "In today’s video, Dr. Christine Cocchiola explains why children — and even adults — can seem to “flip on a dime” back toward an abusive parent after gaining clarity.\n\nThis shift is not confusion or weakness. It is the result of intermittent reinforcement, the same tactic that once kept you stuck. A small moment of kindness, charm, or calm can cause the nervous system to lower its guard — and abusers know exactly when and how to do this.\n\nDr. Christine also discusses why family court becomes a stage for retaliation. These individuals are not simply “high conflict” — they are drawn to conflict. They are adversarial, inflexible, and energized by power struggles. Their goal is not resolution. Their goal is punishment.\n\n✨ In this episode, Dr. Christine discusses:\n\nWhy children can revert after gaining clarity\n\nHow intermittent reinforcement works in abusive dynamics\n\nWhy abusers retaliate when exposed\n\nHow systems are often manipulated to continue abuse\n\nWhy family court is especially dangerous\n\nThe difference between conflict and antagonism\n\nThe 3 Ps for survival: Predict, Prepare, Protect\n\nDr. Christine emphasizes the importance of seeing the freight train coming. Until you recognize the pattern and get off the tracks, the damage can be devastating. Strategy is not manipulation — it is protection.\n\n💙 If this resonates, please subscribe and share.\nClarity saves lives. Preparation reduces harm.\n\n🌿 Join Dr. C’s Community for education, validation, and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#CoerciveControl\n#IntermittentReinforcement\n#ProtectiveParenting\n#FamilyCourtAbuse\n#PostSeparationAbuse\n#Retaliation\n#TraumaInformedParenting\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-30T17:00:05Z",
      "duration": "00:03:58",
      "explicit": false,
      "youTubeId": "awsmhgUH7FE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=awsmhgUH7FE"
      }
    },
    {
      "id": "3d28621a-9d96-468d-b4d5-0923ad926b88",
      "title": "That’s Not Your Child: It’s Coercive Control",
      "description": "In today’s video, Dr. Christine Cocchiola speaks directly to protective parents who are struggling to recognize their child beneath aggressive, dismissive, or heartbreaking behavior.\n\nChildren raised in coercively controlling family systems become entangled in the abuser’s web. The behaviors protective parents see — aggression, withdrawal, hostility — are often not expressions of who the child truly is, but survival responses shaped by coercion, fear, and control.\n\nDr. Christine clarifies an important distinction:\nMost children are not fully indoctrinated against their protective parent. Many are acquiescing, some are aligning, and some temporarily identify with the aggressor. True estrangement is far rarer than most people believe.\n\nShe shares a powerful story of a protective mother who was forced to let go after systems failed — and how years later, her child returned, ready to reconnect once the control loosened.\n\n✨ In this episode, Dr. Christine discusses:\n\nWhy behavior under coercive control is not the child’s true self\n\nThe difference between estrangement, acquiescence, and alignment\n\nHow identifying with the aggressor is a survival response\n\nWhy shame only deepens harm\n\nThe power of saying: “That wasn’t your fault. That wasn’t my fault.”\n\nHow steadiness, understanding, and patience create space for reconnection\n\nDr. Christine reminds protective parents: your child is still there. They are submerged, entangled, and trying to breathe — but love and attachment do not disappear.\n\n💙 If this resonates, please subscribe and share.\nYour understanding matters more than you know.\n\n🌿 Join Dr. C’s Community for education, validation, and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#ProtectiveParenting\n#CoerciveControl\n#ChildhoodTrauma\n#ParentalAlienation\n#TraumaResponses\n#AttachmentHealing\n#PostSeparationAbuse\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-28T17:01:37Z",
      "duration": "00:03:12",
      "explicit": false,
      "youTubeId": "w-7KoCekT8Y",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=w-7KoCekT8Y"
      }
    },
    {
      "id": "4f0ef6ff-d017-46f1-ab84-631b6be773b6",
      "title": "Coercive Control is the Foundation of Most Domestic Abuse",
      "description": "In today’s video, Dr. Christine Cocchiola breaks down what coercive control actually is — and why so many victims don’t recognize it while they’re living inside it.\n\nHistorically, abuse has been understood through a violent incident model, focusing on physical harm. But coercive control is a non-physical violence model, rooted in power and control. It slowly and insidiously erodes autonomy, voice, and a person’s ability to be themselves.\n\nDr. Christine explains how coercive controllers often seek out people who are:\n\nAccommodating\n\nOptimistic\n\nRelationship-oriented\n\nWilling to work hard to make things “better”\n\nBecause coercive control is nuanced, many survivors look back only later and recognize the signs — gaslighting, mockery, intimidation, isolation, threats, and consequences for simply expressing feelings or disagreement.\n\n✨ In this episode, Dr. Christine discusses:\n\nWhy abuse is about power and control, not just violence\n\nHow coercive control can exist without physical harm\n\nCommon tactics like mockery, minimization, and revenge\n\nWhy family court often becomes a stage for coercive controllers\n\nHow victims lose personal power over time\n\nWhy children are not just witnesses — but victims\n\nHow children learn to regulate themselves through fear and appeasement\n\nDr. Christine emphasizes that coercive control within the family system is child abuse, even when no physical violence is present. Children learn to walk on eggshells just as the adult victim does — and that harm is often unacknowledged by systems.\n\n💙 If this resonates, please subscribe and share.\nNaming coercive control is a critical step toward clarity and healing.\n\n🌿 Join Dr. C’s Community for education, validation, and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#CoerciveControl\n#PsychologicalAbuse\n#NonPhysicalAbuse\n#ProtectiveParenting\n#UnacknowledgedChildAbuse\n#PowerAndControl\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-26T17:00:03Z",
      "duration": "00:05:57",
      "explicit": false,
      "youTubeId": "1nhvN7XrYtQ",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1nhvN7XrYtQ"
      }
    },
    {
      "id": "ce6f7e17-64bc-48a4-82c2-9faf8a55bb28",
      "title": "Child Sexual Abuse, Grooming, and the Systems That Fail Children — with Andrew Carpenter",
      "description": "In this episode of Perfect Prey, I’m joined by Andrew Carpenter, a solicitor and partner at Webster Lawyers in Australia, widely known for his work holding child sexual abuse perpetrators accountable and advocating for systemic reform.\n\nAndrew and I have a frank, uncomfortable, and deeply necessary conversation about child sexual abuse, grooming, coercive control, and the institutional failures that continue to endanger children. We explore how child predators use the same grooming tactics as coercive controllers, how technology and AI have dramatically increased access to abuse material, and why legal systems—including family courts—so often fail to protect children and the parents trying to keep them safe.\n\nThis episode centers the reality that child sexual abuse is not rare, not accidental, and not a crime of opportunity—it is intentional, patterned, and enabled by silence, disbelief, and systemic blind spots.\n\nWhat we cover\nHow child sexual abuse perpetrators groom children, families, and institutions\nWhy all child predators use coercive control and relational grooming tactics\nThe disturbing accessibility of child abuse material online\nHow technology, AI, and social media are being weaponized against children\nWhy most abuse occurs within trusted relationships and family systems\nThe failures of criminal courts and family courts to protect child victims\nWhy lack of physical evidence does not mean abuse did not occur\nWarning signs, behavioral red flags, and changes parents should not ignore\nHow shame, fear, and silence protect perpetrators—not children\nWhat meaningful prevention, accountability, and reform must address\n\nWhy listen\nIf you are a survivor, protective parent, clinician, attorney, educator, or advocate, this episode provides critical insight into how child sexual abuse actually operates—and why so many children are disbelieved, retraumatized, or returned to unsafe environments. Andrew’s work exposes how deeply embedded these harms are within systems that claim to protect children, and why uncomfortable conversations are essential to change.\n\nGuest bio (short)\nAndrew Carpenter is a solicitor and partner at Webster Lawyers in Australia, specializing in child sexual abuse litigation and survivor advocacy. He is widely recognized for challenging institutional failures, advocating for legal reform, and amplifying survivor voices in cases where children have been silenced or ignored. His work focuses on accountability, deterrence, and systemic change to better protect children.\n\nConnect with Andrew Carpenter\nFacebook:\nhttps://www.facebook.com/andrewcarpentersolicitor\nWebsters Lawyers:\nhttps://websterslawyers.com.au/lawyers/andrew-carpenter\nInstagram:\nhttps://www.instagram.com/andrewcarpentersolicitor?utm_source=ig_web_button_share_sheet\u0026igsh=ZDNlZDc0MzIxNw==\nLinkedIn:\nhttps://www.linkedin.com/in/andrew-carpenter-041456123/\n\nConnect with Dr. Christine\nProtective Parenting Program:\nhttps://www.coercivecontrolconsulting.com/services/for-parents/\nOfficial site:\nhttps://www.coercivecontrolconsulting.com/\nYouTube:\nhttps://www.youtube.com/@DrCocchiola-coercivecontrol/videos\nTikTok:\nhttps://www.tiktok.com/@dr.c_coercivecontrol\nInstagram:\nhttps://www.instagram.com/dr.cocchiola_coercivecontrol/\nTEDxTalks:\nhttps://www.youtube.com/watch?v=gp2qByKOue4\u0026t=24s\nBooks:\nhttps://url-shortener.me/c/FramedBook\nhttps://url-shortener.me/c/EveryMomentOfEveryDay\n\nIf this episode landed for you, please share it with someone who needs to hear it, subscribe for more trauma-informed conversations, and consider leaving a review—it helps other survivors and protective parents find validation and safety.\n— Dr. Christine Cocchiola \u0026 guest Andrew Carpenter\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-23T17:01:19Z",
      "duration": "00:42:00",
      "explicit": false,
      "spotifyId": "2QOwsVERMHdayCI1dkPUaS",
      "appleId": 1000746363435,
      "youTubeId": "j7SKBS_iap8",
      "subjects": [
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QOwsVERMHdayCI1dkPUaS",
        "apple": "https://podcasts.apple.com/podcast/child-sexual-abuse-grooming-and-the-systems-that/id1704962170?i=1000746363435",
        "youtube": "https://www.youtube.com/watch?v=j7SKBS_iap8"
      }
    },
    {
      "id": "cd7ba0e6-2a73-4289-9f94-6cc71ad53bcc",
      "title": "Why Children Dissociate From Abuse: Trauma Bonding Explained",
      "description": "In today’s video, Dr. Christine Cocchiola continues the conversation on trauma bonding in children by focusing on dissociation and cognitive dissonance — two powerful survival responses that help children cope with being forced into unsafe relationships.\n\nChildren living under coercive control are often required by systems to continue contact with an abusive parent. Faced with the unbearable reality that a caregiver is harmful — while still needing to survive visits — the brain adapts. Dissociation becomes a way to reduce pain, and over time, permissive and neglectful parenting can reinforce this process.\n\nDr. Christine explains how:\n\nDissociation helps children survive overwhelming pain\n\nCognitive dissonance makes harm feel “normal”\n\nPermissiveness and neglect deepen trauma bonds\n\nGaslighting can turn inward, leading children to doubt their own reality\n\nTrauma bonds are neurologically reinforced over time\n\nShe also speaks to the grief and loss protective parents carry — the grief of recognizing how deeply children have been harmed and how profoundly unfair this reality is. As Dr. Christine notes, grief doesn’t disappear; we grow around it.\n\n💙 If this resonates, please subscribe and share.\nYour clarity matters. Your grief is real. And your steadiness helps more than you know.\n\n🌿 Join Dr. C’s Community for education, validation, and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#TraumaBond\n#Dissociation\n#CognitiveDissonance\n#CoerciveControl\n#ProtectiveParenting\n#ChildhoodTrauma\n#GriefAndLoss\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-21T17:01:07Z",
      "duration": "00:03:42",
      "explicit": false,
      "youTubeId": "dbcNySw2xvM",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dbcNySw2xvM"
      }
    },
    {
      "id": "df01fdf1-5f31-40d6-ab3a-cd46fb930f42",
      "title": "Why Children Trauma Bond to an Abusive Parent",
      "description": "In today’s video, Dr. Christine Cocchiola talks about one of the most painful and confusing realities for protective parents: children becoming trauma bonded to an abusive parent.\n\nTrauma bonding in children looks different than it does in adult relationships. The abusive person is not a partner — it is their caretaker. Attachment to a parent is biologically driven and designed for survival, which makes trauma bonds with caregivers especially powerful and difficult to break.\n\nDr. Christine explains how children often live in a dissociated state, forgetting or minimizing the harm they experienced — even when they heard violence, felt fear in their bodies, or lived in constant instability. This forgetting is not denial; it is the brain’s survival strategy.\n\n✨ In this episode, Dr. Christine discusses:\n\nWhy attachment to a caregiver is biologically reinforced\n\nHow trauma bonding helps children survive unsafe environments\n\nWhy children dissociate from painful memories\n\nHow coercive control shapes a child’s beliefs about the safe parent\n\nWhy power — not love — keeps children tied to the abuser\n\nWhy children forgive at high rates even after recognizing abuse\n\nDr. Christine reminds protective parents that this process mirrors what many adult victims experience — only stronger — and that patience, understanding, and a coercive-control lens are essential when supporting children through this.\n\nShe also shares that future videos will continue exploring trauma bonding, cognitive dissonance, and why recognition of abuse does not automatically break attachment.\n\n💙 If this resonates, please subscribe and share.\nYour child’s attachment responses make sense — and so does your grief.\n\n🌿 Join Dr. C’s Community for education, validation, and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#TraumaBond\n#CoerciveControl\n#ProtectiveParenting\n#ChildhoodTrauma\n#AttachmentTrauma\n#PostSeparationAbuse\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-19T17:01:34Z",
      "duration": "00:03:34",
      "explicit": false,
      "youTubeId": "6q4GDoCtfqc",
      "subjects": [
        "One-on-one",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6q4GDoCtfqc"
      }
    },
    {
      "id": "e3be6e21-90f3-4c6d-a010-ec468a795bf7",
      "title": "Protecting Children From Grooming What Every Parent Needs to Know",
      "description": "In today’s video, Dr. Christine Cocchiola addresses one of the most difficult — and most necessary — conversations parents must have: grooming, child sexual abuse, and coercive control.\n\nDr. Christine explains that while not all coercive controllers are pedophiles, all pedophiles use the same grooming tactics as coercive controllers. Grooming is not sudden or obvious. It is calculated, relational, and often carried out by adults children know, trust, or even love.\n\nShe also addresses an important truth: children are never responsible for protecting themselves. Adults must be held accountable. And yet, we live in a world where systems often fail, predators are not always stopped, and parents are left navigating real risk without support.\n\nThis is why Dr. Christine discusses how to give children a developmentally appropriate safety toolbox — not to place responsibility on them, but to help them retain voice, body awareness, and agency when something feels off.\n\n✨ In this episode, Dr. Christine discusses:\n\nWhy grooming is a form of coercive control\n\nHow predators select and groom children\n\nWhy abuse often doesn’t “feel scary” to a child\n\nThe importance of teaching children there are no secrets\n\nWhy children must know they will always be believed\n\nHow to talk about body safety using clear, correct language\n\nWhy intuition and body signals matter\n\nThe reality that even informed children can still be harmed — and why that is never their fault\n\nDr. Christine also invites viewers to explore her podcast, Perfect Prey, where adult and child victims share their lived experiences of coercive control, grooming, and survival.\n\n💙 If this video is helpful, please subscribe and share.\nKnowledge is power — and silence protects no one.\n\n🌿 Join Dr. C’s Community for education and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#ChildSafety\n#Grooming\n#CoerciveControl\n#ProtectiveParenting\n#ChildSexualAbusePrevention\n#TraumaInformedParenting\n#BodySafety\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-16T17:00:30Z",
      "duration": "00:05:49",
      "explicit": false,
      "youTubeId": "Air7A3e6YLU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Air7A3e6YLU"
      }
    },
    {
      "id": "6fc83e80-7125-48d2-bca3-b643395e38a3",
      "title": "When Abusers Use Children as Weapons: What Parents Need to Know",
      "description": "In today’s video, Dr. Christine Cocchiola speaks directly to protective parents navigating one of the hardest realities imaginable: parenting children who have been coercively controlled and weaponized by an abusive parent.\n\nDr. Christine explains why co-parenting is not possible in these dynamics and why so many protective parents feel confused, overwhelmed, and unsupported. From permissive and neglectful parenting to the misuse of technology and lack of structure, abusers often compromise a child’s developing brain — not for the child’s benefit, but to harm the adult victim.\n\nChildren may appear to prefer the abusive parent because that environment offers unlimited freedom without responsibility. When the protective parent provides structure, safety, and boundaries, they are often met with resistance — not because they are doing something wrong, but because the child has been harmed.\n\n✨ In this episode, Dr. Christine discusses:\n\nWhy abusers weaponize children from day one\n\nHow permissive and neglectful parenting is used as a control tactic\n\nWhy children lose agency and autonomy under coercive control\n\nWhy your expectations must change when parenting abused children\n\nThe importance of connecting instead of correcting\n\nWhy radical acceptance is essential for survival and healing\n\nWhy this is unacknowledged child abuse\n\nDr. Christine also shares why she created the Protective Parenting Program — to bring clinical expertise directly into the homes of parents who are not being supported by systems — and why building a sea of allies through professional training is critical to protecting children.\n\n💙 If this resonates, please subscribe and share.\nYou are doing the hardest work there is — and you are not alone.\n\n🌿 Join Dr. C’s Community for support and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#ProtectiveParenting\n#CoerciveControl\n#WeaponizedChildren\n#PostSeparationAbuse\n#NarcissisticAbuse\n#UnacknowledgedChildAbuse\n#TraumaInformedParenting\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-14T17:01:42Z",
      "duration": "00:04:04",
      "explicit": false,
      "youTubeId": "vUjVr6v91U4",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vUjVr6v91U4"
      }
    },
    {
      "id": "2633b424-6c38-4f9a-9f70-3ed9c6f34206",
      "title": "Love Bombing Is Coercive Control: Why Abusers Groom So Well",
      "description": "In today’s video, Dr. Christine Cocchiola explains why love bombing and grooming are central features of coercive control—and why abuse is so often invisible to the outside world.\n\nIn the UK, love bombing is formally recognized as part of coercive control. Abusers groom their victims, their children, and entire communities over time. They do not announce themselves as dangerous. Many are charismatic, admired, and seen as “great parents” or “great partners,” which makes the abuse nearly impossible for others to believe.\n\nDr. Christine shares how coercive control often intensifies after separation, why leaving does not automatically make victims safer, and how abusers escalate once they feel they are losing control. This dynamic plays out repeatedly in family court, where false narratives are reinforced and protective parents are often dismissed.\n\n✨ In this episode, Dr. Christine discusses:\n\nWhy love bombing is a grooming tactic\n\nHow abusers hide rage beneath charm\n\nWhy abuse escalates after separation\n\nWhy victims are often not believed\n\nHow grooming impacts children and extended family\n\nThe difference between personal power and power over\n\nWhy community is essential for survival and healing\n\nDr. Christine reminds viewers: you are not crazy, and you are not alone. What you’re experiencing is real, and it is far more common than most people realize.\n\n💙 If this resonates, please subscribe and share.\nBreaking the silence is how change begins.\n\n🌿 Join Dr. C’s Community for support and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#CoerciveControl\n#LoveBombing\n#Grooming\n#ProtectiveParenting\n#PostSeparationAbuse\n#FamilyCourtAbuse\n#NarcissisticAbuse\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-12T17:01:16Z",
      "duration": "00:03:58",
      "explicit": false,
      "youTubeId": "erEm_nvr-0k",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=erEm_nvr-0k"
      }
    },
    {
      "id": "e7954de1-51f4-4839-97f7-511824a5c695",
      "title": "When You See It: The Untold First Wife Story of Dirty John with Tonia Bales",
      "description": "In this episode of Perfect Prey, I’m joined by Tonia Bales, author of When You See It: How I Outsmarted and Outlasted Dirty John. Tonia shares her story as the first wife of the man later known to the world as “Dirty John”—long before the podcast, Netflix series, or public recognition of who he really was.\nTonia describes how coercive control, deception, and manipulation unfolded inside her marriage, how she began uncovering her husband’s double life, and how the legal and family court systems failed to protect her and her children. This conversation offers a powerful look at how predators hide in plain sight, how survivors are often DARVO’d when they speak up, and how children become collateral damage in abusive systems.\nWhat we cover\nLife with Dirty John before the world knew his name\n\n\nHow predators identify and target “perfect prey”\n\n\nEarly warning signs, red flags, and deception hidden in plain sight\n\n\nDARVO tactics and false accusations used to silence victims\n\n\nSubstance abuse, professional abuse of power, and systemic failure\n\n\nFamily court, coercive control, and the weaponization of children\n\n\nProtective parenting, resilience, and healing after profound trauma\n\n\nWhy listen\n If you are a survivor, protective parent, clinician, attorney, or advocate, this episode offers critical insight into how coercive control operates long before abuse is publicly recognized. Tonia’s story underscores why survivors are not naïve or weak—and why systems must do better to protect those who speak up.\nGuest bio (short)\n Tonia Bales is a survivor of coercive control and the author of When You See It: How I Outsmarted and Outlasted Dirty John. Her story sheds light on the early patterns of abuse used by predators and the long-term impact of coercive control on victims and children. Through her writing and advocacy, Tonia works to educate the public and professionals about how abuse hides in plain sight—and why survivors must be believed.\nBook information\n When You See It: How I Outsmarted and Outlasted Dirty John\n Available for presale on Amazon and Barnes \u0026 Noble\n Release date: January 13\n\n\n\nConnect Tonia Bales:\nInstagram: https://www.instagram.com/toniabales?utm_source=ig_web_button_share_sheet\u0026igsh=ZDNlZDc0MzIxNw==\nFacebook: https://www.facebook.com/tonia.bales/\nBook Pre-order Amazon: https://www.amazon.com/dp/B0FCDDC6FL?utm_source=ig\u0026utm_medium=social\u0026utm_content=link_in_bio\u0026fbclid=PAZXh0bgNhZW0CMTEAc3J0YwZhcHBfaWQMMjU2MjgxMDQwNTU4AAGnHUKUJZ66YW-ed61SGw-lrKgFG6dnBGrVNG3HKq8--EQOpUpk0p_RHBPIooU_aem_yzp5bcFQZ3qA-0ZB2cUsZQ\nBook Pre-order Barnes \u0026 Noble: https://www.barnesandnoble.com/w/when-you-see-it-tonia-bales/1147557107?utm_source=ig\u0026utm_medium=social\u0026utm_content=link_in_bio\u0026fbclid=PAZXh0bgNhZW0CMTEAc3J0YwZhcHBfaWQMMjU2MjgxMDQwNTU4AAGnsCgCEudPLDgxvCiAhmFYxcmlITQgdX8Kg9N5ItIrcW5Doxah2aRfQpDKwmU_aem_nHP_j-GiGb8xTQFMQqQo4g\n\n\n\nConnect with Dr. Christine:\nProtective Parenting Program: https://www.coercivecontrolconsulting.com/services/for-parents/\nOfficial site: https://www.coercivecontrolconsulting.com/\nYoutube: https://www.youtube.com/@DrCocchiola-coercivecontrol/videos\nTiktok: https://www.tiktok.com/@dr.c_coercivecontrol\nIG: https://www.instagram.com/dr.cocchiola_coercivecontrol/\nTEDxTalks: https://www.youtube.com/watch?v=gp2qByKOue4\u0026t=24s\nBooks: https://url-shortener.me/c/FramedBook\nhttps://url-shortener.me/c/EveryMomentOfEveryDay\n\nIf this episode landed for you, please share it with someone who needs to hear it, subscribe for more trauma-informed conversations, and consider leaving a review — it helps other survivors find validation and safety.\n— Dr. Christine Cocchiola \u0026 guest Tonia Bales\n\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-09T18:11:41Z",
      "duration": "00:37:27",
      "explicit": false,
      "spotifyId": "7qPu28Ll4XUPaILDoJSI9W",
      "appleId": 1000744481385,
      "youTubeId": "JKXBaVM6HDY",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qPu28Ll4XUPaILDoJSI9W",
        "apple": "https://podcasts.apple.com/podcast/when-you-see-it-the-untold-first-wife-story-of/id1704962170?i=1000744481385",
        "youtube": "https://www.youtube.com/watch?v=JKXBaVM6HDY"
      }
    },
    {
      "id": "63817448-66c8-4be6-9759-920f60c443c1",
      "title": "The Tale of Two Children: When Abuse Changes Who Your Child Becomes",
      "description": "In today’s video, Dr. Christine Cocchiola speaks to one of the most painful realities for protective parents — the experience of feeling like you’re raising two different children.\n\nThe child you knew — the tender, playful, trusting little one — and the child who now feels angry, withdrawn, dysregulated, or aggressive toward the very parent they are safest with. Dr. Christine explains why this shift is not a personality change or a parenting failure, but a trauma response to coercive control and unacknowledged child abuse.\n\nChildren living in abusive family systems are often operating from the survival part of the brain. They don’t feel safe. They can’t be fully themselves. And because it is unsafe to direct anger or fear toward the abusive parent, those feelings are often displaced onto the protective parent.\n\nIn this episode, Dr. Christine explores:\n\nWhy children can feel like “different kids” after abuse\n\nHow trauma fractures a child’s sense of safety and identity\n\nWhy anger, withdrawal, or aggression are forms of self-defense\n\nThe grief parents feel when the child they imagined changes\n\nHow personal power helps parents “level up” instead of collapsing\n\nWhy healing is about helping children become the healthiest version of themselves — even under horrific circumstances\n\nShe also highlights her “Connect the Dots” video series, created for children who are beginning to recognize and name their experiences of abuse in a way that feels safe and validating.\n\n💙 If this resonates, please subscribe and share.\nYou are not imagining what you’re seeing — and you are not alone in this.\n\n🌿 Join Dr. C’s Community for support and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#CoerciveControl\n#ProtectiveParenting\n#ChildhoodTrauma\n#TraumaResponses\n#PostSeparationAbuse\n#AttachmentHealing\n#FamilyCourtIssues\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-07T17:20:05Z",
      "duration": "00:04:00",
      "explicit": false,
      "youTubeId": "hmjpR580R98",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hmjpR580R98"
      }
    },
    {
      "id": "3fbba74f-1770-420e-8bc6-783892a0eb1d",
      "title": "Personal Power vs. Power Over: What Abusers Don’t Want You to Understand",
      "description": "In today’s video, Dr. Christine Cocchiola explores an essential distinction that is often distorted in coercively controlling family systems: the difference between personal power and power over.\n\nPersonal power is about agency, voice, and healthy boundaries. It is the ability to assert yourself, care for your children, and create structure that supports growth and independence. Power over, on the other hand, is what abusers use — control, domination, and coercion.\n\nDr. Christine explains why, when protective parents begin asserting healthy boundaries, abusers often accuse them of being “controlling.” This tactic is frequently used not only against partners, but also against children — where structure, support, and expectations are reframed as harm.\n\nShe discusses:\n\nWhy asserting personal power can trigger backlash\n\nHow abusers co-opt the language of control\n\nThe impact this has on children’s perception of the safe parent\n\nWhy children need agency and structure\n\nHow teaching children personal power protects them long-term\n\nDr. Christine also invites listeners to explore her podcast, Perfect Prey, where she interviews survivors, professionals, and advocates — including David Challen and Anne Burgess — to deepen understanding of coercive control and its impact across the lifespan.\n\n💙 If this resonates, please subscribe and share.\nPersonal power is not something to apologize for — it is something to reclaim.\n\n🌿 Join Dr. C’s Community for education, support, and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#PersonalPower\n#CoerciveControl\n#ProtectiveParenting\n#Boundaries\n#NarcissisticAbuse\n#PostSeparationAbuse\n#AttachmentHealing\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-05T17:00:08Z",
      "duration": "00:03:37",
      "explicit": false,
      "youTubeId": "5_30pcxd5fw",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5_30pcxd5fw"
      }
    },
    {
      "id": "d99ce64a-2de2-41b0-9bf7-9e1f1f4628fe",
      "title": "The Unthinkable: A Child’s View of Coercive Control with David Challen",
      "description": "n this episode of Perfect Prey, I’m joined by David Challen, author of The Unthinkable, who shares his experience growing up as a child inside a coercively controlling family system. David offers a rare and powerful perspective on coercive control through the eyes of a child—long before there was language to describe abuse, and long before systems were willing to see it.\n\nThis conversation explores how coercive control creates an atmosphere of fear, vigilance, humiliation, and emotional captivity within families, even when there is no visible violence. David reflects on the early intuition that something was wrong, the “rot in the house” that others could not see, and how children normalize danger in order to survive. Together, we examine the intergenerational harm caused by coercive control and why children are not passive witnesses, but co-victims.\n\nWhat we cover\nWhat coercive control looks and feels like through the eyes of a child\nHow children sense danger, imbalance, and domination long before abuse is named\nThe normalization of mockery, humiliation, fear, and emotional subservience within families\nWhy coercive control is not “hidden abuse,” but a trajectory of escalating harm\nHow long-term psychological domination strips autonomy, identity, and safety over time\nThe concept of “systemic degradation” and how victims are worn down across years or decades\nWhy victim retaliation is often misunderstood, mislabeled, and criminalized\nThe long-term impact on adult child survivors and protective parents\n\n\nWhy listen\n If you are a survivor, protective parent, adult child survivor, clinician, or legal professional, this episode offers critical insight into how coercive control operates inside families and why children are deeply affected—even when abuse is not outwardly visible. This conversation brings clarity to experiences that are often minimized, misunderstood, or dismissed, and highlights why coercive control must be recognized as the foundation of all abuse.\n\nGuest bio (short)\n David Challen is an author, speaker, and campaigner on domestic abuse and coercive control. He is the author of The Unthinkable, which tells the story of growing up in a coercively controlled household and the devastating impact of long-term psychological abuse on children and families. David is a prominent advocate for greater recognition of coercive control and has spoken widely about intergenerational harm, survivor justice, and systemic failure.\n\n\nConnect David Challen:\nInstagram: https://l1nq.com/davidinstagram\nTiktok: https://www.tiktok.com/@davidchallen?is_from_webapp=1\u0026sender_device=pc\nLearn more about David: https://www.eida.org.uk/davids-story\nWebsite: https://l1nq.com/davidchallenwebsite\nThe Unthinkable: https://www.hachette.co.uk/titles/david-challen/the-unthinkable/9781914240263/\n\n\n\nConnect with Dr. Christine:\nProtective Parenting Program: https://www.coercivecontrolconsulting.com/services/for-parents/\nOfficial site: https://www.coercivecontrolconsulting.com/\nYoutube: https://www.youtube.com/@DrCocchiola-coercivecontrol/videos\nTiktok: https://www.tiktok.com/@dr.c_coercivecontrol\nIG: https://www.instagram.com/dr.cocchiola_coercivecontrol/\nTEDxTalks: https://www.youtube.com/watch?v=gp2qByKOue4\u0026t=24s\nBooks: https://url-shortener.me/c/FramedBook\nhttps://url-shortener.me/c/EveryMomentOfEveryDay\n\nIf this episode landed for you, please share it with someone who needs to hear it, subscribe for more trauma-informed conversations, and consider leaving a review — it helps other survivors find validation and safety.\n— Dr. Christine Cocchiola \u0026 guest David Challen\n\n\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2026-01-02T18:45:22Z",
      "duration": "00:39:21",
      "explicit": false,
      "spotifyId": "1KFXlEtIugx9Dfd122PC0R",
      "appleId": 1000743544048,
      "youTubeId": "qo93WZMdxEE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KFXlEtIugx9Dfd122PC0R",
        "apple": "https://podcasts.apple.com/podcast/the-unthinkable-a-childs-view-of-coercive/id1704962170?i=1000743544048",
        "youtube": "https://www.youtube.com/watch?v=qo93WZMdxEE"
      }
    },
    {
      "id": "2f11adc7-036e-490d-93bd-7413d15a699e",
      "title": "3 Manifestations of Trauma in Children of Coercive Control",
      "description": "In this video, Dr. Christine Cocchiola—licensed clinical social worker and coauthor of Framed: A Woman in the Family Court Underworld—explores three common manifestations of trauma in children raised within coercively controlling, narcissistic, and abusive family systems.\n\nDrawing from decades of clinical work and the lived experiences of protective parents, Dr. Christine explains how children adapt to unsafe environments—and how these adaptations can follow them into adolescence and adulthood.\n\n✨ The three trauma responses discussed:\n\nSignificant anxiety — difficulty regulating, freezing during everyday tasks, and feeling unsafe in the body\n\nDissociation — a “forgetting” of harm as a protective survival response\n\nTrauma bonding — emotional attachment to the abusive parent, including forgetting the secure attachment once shared with the protective parent\n\nDr. Christine also shares an upcoming healing opportunity with Nadine Macaluso, where adult and childhood trauma bonding will be addressed in a supportive setting at Kripalu Center for Yoga \u0026 Health.\n\nThis conversation is meant to validate what protective parents are seeing, reduce self-blame, and bring clarity to behaviors that are often misunderstood.\n\n💙 If this resonates, please subscribe and share.\nEducation helps us name what happened—and naming it is part of healing.\n\n🌿 Join Dr. C’s Community for support and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#CoerciveControl\n#ChildhoodTrauma\n#TraumaBond\n#ProtectiveParenting\n#NarcissisticAbuse\n#AttachmentHealing\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-29T17:00:08Z",
      "duration": "00:03:03",
      "explicit": false,
      "youTubeId": "1SSrOxGLccU",
      "subjects": [
        "One-on-one",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1SSrOxGLccU"
      }
    },
    {
      "id": "059edea6-6e3d-4617-a360-c3cb68a3a9e7",
      "title": "When Your Child Is Distant During the Holidays: Stay the Safe Parent",
      "description": "In today’s video, Dr. Christine Cocchiola speaks directly to protective parents navigating one of the most painful experiences of all — holidays without your child, or holidays where your love feels unreciprocated or rejected.\n\nDr. Christine acknowledges how deeply difficult Christmas, Hanukkah, and other holidays can be after coercive control, post-separation abuse, or estrangement. She offers gentle guidance on why remaining steady matters more than protecting yourself from rejection.\n\nShe encourages parents to continue sending:\n\nA simple card\n\nA small, thoughtful gift\n\nA brief message of unconditional love\n\n—not to get a response, not to provoke guilt, and not to manipulate, but to anchor safety and consistency.\n\nChildren impacted by coercive control are highly sensitive to tone and intention. Even well-meant statements can be perceived as manipulative if they hint at jealousy, resentment, or expectation. Dr. Christine explains why less is more, and why unconditional love — without explanation or pressure — is the most powerful message you can send.\n\n✨ In this video, Dr. Christine discusses:\n\nWhy holidays are especially painful for protective parents\n\nWhen to send a card or gift even if it may be rejected\n\nHow certain phrases can be misinterpreted\n\nWhy steadiness builds long-term safety\n\nHow unconditional love supports eventual reconnection\n\n💙 If this resonates, please subscribe and share.\nYou are not alone, and your steadiness matters more than you know.\n\n🌿 Join Dr. C’s Community for support and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#HolidayGrief\n#ProtectiveParenting\n#CoerciveControl\n#PostSeparationAbuse\n#EstrangedChildren\n#UnconditionalLove\n#AttachmentHealing\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-22T17:11:49Z",
      "duration": "00:02:35",
      "explicit": false,
      "youTubeId": "eG7lsPEaRT0",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eG7lsPEaRT0"
      }
    },
    {
      "id": "7bad7658-865f-4943-b8d8-5fb3308e0bfc",
      "title": "Coercive Control, Validation, and Power: How Aimee Says Supports Survivors with Anne Wintemute",
      "description": "In this episode of Perfect Prey, I’m joined by Anne Wintemute, co-creator of Aimee Says, an innovative AI platform designed specifically to support victims and survivors of coercive control. Aimee Says helps survivors understand abusive communication patterns, validate their lived experiences, and assist with documentation—particularly in high-stakes situations such as custody and family court.\n\nWe explore why victims and survivors are not harmed because of character flaws, but because abusers intentionally target people who are kind, empathic, agreeable, and giving. Anne explains how Aimee Says was built around expertise in coercive control, narcissistic abuse, domestic violence, and power-and-control dynamics—and why that specialization matters.\n\nWhat we cover\nWhat Aimee Says is and how it supports survivors of coercive control\nWhy validation and being truly heard are foundational to healing and decision-making\nHow Aimee helps identify gaslighting, financial abuse, intimidation, and coercive patterns\nUsing Aimee Says to support documentation, journaling, and preparation for legal processes\nKey differences between Aimee Says and general AI tools, including safety, trauma-informed guardrails, and survivor-centered design\nPrivacy, confidentiality, and safety considerations for survivors navigating digital tools\nHow tools like Aimee Says can reduce isolation and help restore agency and clarity\n\nWhy listen\nIf you are a survivor, protective parent, clinician, attorney, or advocate, this episode offers a grounded, accessible explanation of how coercive control operates and why survivors so often feel confused, minimized, or silenced. You’ll also learn how thoughtfully designed tools can help survivors feel validated, supported, and better equipped to navigate complex systems.\n\nGuest bio (short)\nAnne Wintemute is the co-creator of Aimee Says, an AI-powered platform developed to support victims and survivors of coercive control through validation, pattern recognition, and trauma-informed guidance. Her work focuses on increasing access to expert-level support while prioritizing survivor safety, autonomy, and confidentiality.\n\nLearn more about Anne Wintemute and Aimee Says:\nAnne Wintemute on LinkedIn: https://www.linkedin.com/in/anne-wintemute-897077106\nCanvas Rebel interview: https://canvasrebel.com/meet-anne-wintemute/\nAimee Says – Our Story: https://www.aimeesays.com/story\n\nConnect with Dr. Christine:\nProtective Parenting Program: https://www.coercivecontrolconsulting.com/services/for-parents/\nOfficial site: https://www.coercivecontrolconsulting.com/\nYoutube: https://www.youtube.com/@DrCocchiola-coercivecontrol/videos\nTiktok: https://www.tiktok.com/@dr.c_coercivecontrol\nIG: https://www.instagram.com/dr.cocchiola_coercivecontrol/\nTEDxTalks: https://www.youtube.com/watch?v=gp2qByKOue4\u0026t=24s\nBooks: https://url-shortener.me/c/FramedBook\nhttps://url-shortener.me/c/EveryMomentOfEveryDay\n\nIf this episode landed for you, please share it with someone who needs to hear it, subscribe for more trauma-informed conversations, and consider leaving a review — it helps other survivors find validation and safety.\n\n— Dr. Christine Cocchiola \u0026 guest Anne Wintemute\n\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-19T21:07:14Z",
      "duration": "00:34:37.8450000",
      "explicit": false,
      "spotifyId": "7Li5qTrPuZExkgx6U4Q9zD",
      "appleId": 1000742049602,
      "youTubeId": "xF1RUVl7xk0",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Li5qTrPuZExkgx6U4Q9zD",
        "apple": "https://podcasts.apple.com/podcast/coercive-control-validation-and-power-how-aimee-says/id1704962170?i=1000742049602",
        "youtube": "https://www.youtube.com/watch?v=xF1RUVl7xk0"
      }
    },
    {
      "id": "16daea17-0a64-4e06-bbe3-974b2d5ce34e",
      "title": "“It Wasn’t You”: Why Abuse Happens to Good, Agreeable People",
      "description": "In today’s video, Dr. Christine Cocchiola speaks directly to protective parents asking one of the most painful questions:\n“Why did this happen to me?”\n\nDr. Christine explains a critical truth — if you had met someone with your values, empathy, and relational style, this would not have happened. Abuse does not occur because of who you are. It happens because of who the abuser is.\n\nAbusers are often antagonistic, highly conflict-oriented, disagreeable, and intolerant of autonomy. Over time, through gaslighting, intimidation, isolation, and manipulation, they force their partner to become smaller and smaller — not because the partner is weak, but because survival required constant regulation.\n\nDr. Christine also discusses:\n\nWhy abusers escalate post-separation\n\nHow trauma bonds keep people hoping the “good version” will return\n\nWhy clarity often comes only after the abuse intensifies\n\nThe role of neuroticism and obsession in post-separation punishment\n\nWhy radical acceptance is necessary for healing\n\nWhy this experience has nothing to do with your worth, intelligence, or strength\n\nAs Dr. Christine reminds viewers: “It’s not you. It’s them.”\nAnd once the trauma bond breaks, clarity begins to return — even though the grief remains.\n\n💙 If this resonates, please subscribe and share.\nYour experience is real. Your clarity is earned. And healing is possible.\n\n🌿 Join Dr. C’s Community for education, validation, and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#CoerciveControl\n#ProtectiveParenting\n#PostSeparationAbuse\n#TraumaBond\n#NarcissisticAbuse\n#ItsNotYou\n#RadicalAcceptance\n#PsychologicalAbuse\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-17T17:01:25Z",
      "duration": "00:03:50",
      "explicit": false,
      "youTubeId": "pPDU6rAQS3g",
      "subjects": [
        "Cult Psychology",
        "One-on-one"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pPDU6rAQS3g"
      }
    },
    {
      "id": "39b79857-5f15-40cd-98e8-fdd1cb9d37e4",
      "title": "How to Rebuild Empathy in Children Impacted by Coercive Control",
      "description": "In today’s video, Dr. Christine Cocchiola discusses how to rebuild empathy in children who have been harmed by coercive control and predatory parenting.\n\nMany protective parents wonder why their child seems unkind, distant, or uninterested when the parent is hurt, tired, or struggling. Dr. Christine explains that this is often not a lack of care — it is the result of oppression, entitlement, and emotional conditioning by the abusive parent, who teaches the child not to extend themselves toward the safe parent.\n\nEmpathy doesn’t return through confrontation or guilt. It is rebuilt through small, intentional, attuned opportunities that allow the child to succeed rather than fail.\n\nIn this video, Dr. Christine explains:\n\nWhy children of coercive control lose empathy skills\n\nHow oppression and permissive parenting disrupt development\n\nWhy timing matters more than rules\n\nThe difference between regulating yourself vs. walking on eggshells\n\nHow to create success-based opportunities for empathy\n\nWhy these children are often not at their chronological age\n\nHow to rebuild competence without power struggles\n\nThese children have lost skills — not values. With patience, creativity, and attunement, empathy can be gently restored.\n\n💙 If this supports you, please subscribe and share.\nYour steadiness, intention, and compassion matter more than you know.\n\n🌿 Join Dr. C’s Community for education and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola\n#CoerciveControl\n#ProtectiveParenting\n#EmpathyBuilding\n#TraumaInformedParenting\n#PostSeparationAbuse\n#NarcissisticAbuse\n#AttachmentHealing\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-15T17:01:35Z",
      "duration": "00:05:05",
      "explicit": false,
      "youTubeId": "rUjBEuQUl4E",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rUjBEuQUl4E"
      }
    },
    {
      "id": "7ab85608-d83e-4427-ac6a-a6aefeaa02bb",
      "title": "Coercive Control Starts Day One: Even Experts Can Miss It",
      "description": "In this deeply personal episode, Dr. Christine Cocchiola shares her own story — how she spent decades studying, teaching, and treating coercive control, yet did not recognize that she and her two children were living in it themselves.\n\nLike so many protective parents, she worked endlessly to “fix” the marriage, unaware that her children were being indoctrinated with false narratives about her from day one. It was only years after the final separation that she learned just how long the coercive control had been shaping their beliefs, behaviors, and sense of identity.\n\nDr. Christine explains why coercive control is the underpinning of all abuse, why even the most trained professionals can miss it, and why children living in these systems develop chronic self-doubt, social anxiety, and difficulty being authentically themselves.\n\nShe also discusses:\n\n✨ Why children regulate their behavior to survive\n✨ How shame forms when children are forced to repeat false narratives\n✨ Why some therapy models unintentionally support the abuser\n✨ How attachment and authenticity must coexist for healing\n✨ Why parenting must change when a child has been harmed\n✨ The lifelong grief parents carry — even when children eventually reconnect\n\nDr. Christine created her Protective Parenting Program because she believes protective parents are often the most effective healers for their children. And beginning in January, she will be launching a Grief Program to support parents through the profound, unrecognized loss that comes with coercive control.\n\n💙 If this resonates, please subscribe and share.\nYou are not alone. Your experiences are real. And healing is possible for both you and your children.\n\n🎧 Listen to Dr. C’s podcast, Perfect Prey\n🎤 Watch her TEDx on coercive control\n🌿 Join Dr. C’s Community for support and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola #CoerciveControl #ProtectiveParenting #Indoctrination #IntergenerationalTrauma #ParentalAlienationTruth #PostSeparationAbuse #ShadowPandemic #TraumaHealing #NarcissisticAbuse\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-12T17:15:50Z",
      "duration": "00:04:48",
      "explicit": false,
      "youTubeId": "jplkaGIMjnw",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jplkaGIMjnw"
      }
    },
    {
      "id": "23d4fb53-8bdb-4308-ae02-4cfd370448f5",
      "title": "Coercion, Cult dynamics \u0026 Survival with Sarma Melngailis",
      "description": "In this episode of Perfect Prey, I speak with Sarma Melngailis, author of The Girl with the Duck Tattoo and the central figure in the documentary Bad Vegan. Sarma shares her lived experience of sustained psychological coercion, how it felt to be worn down and re-anchored in someone else’s reality, and what the recovery process looks like after a relationship that functioned much like a one-on-one cult.\nWhat we cover\nHow coercive control can operate like psychological warfare and the tactics that make it feel impossible to leave.\n\n\nWhy intelligent, accomplished people can become victims: the slow wearing down, mirroring, and exploitation of hopes and vulnerabilities.\n\n\nThe parallels between cult dynamics and one-on-one coercive relationships—why isolation and repeated micro-assaults change perception and decision-making.\n\n\nThe aftermath: public shame, misrepresentation in media, and the ongoing work of reclaiming agency, safety, and reputation.\n\n\nPractical reflections for survivors and protective parents: how to notice red flags early, the power of sitting with your intuition, and how healing helps rebuild boundaries and clarity.\n\n\nWhy listen\n Sarma’s story illustrates that coercive control is not about intelligence or credentials — it’s about a strategic, multifaceted assault on agency and reality. Whether you are a survivor, a caregiver, a clinician, or someone trying to understand how otherwise kind and competent people get trapped, this episode names the mechanisms, normalizes survivors’ reactions, and offers concrete ideas for protection and recovery.\nGuest bio (short)\n Sarma Melngailis is the author of The Girl with the Duck Tattoo and the subject of the documentary Bad Vegan. She writes and speaks about her experience of coercive control and its aftermath, helping others recognize the subtle, insidious tactics used by predatory partners.\n\n\n\nConnect with Sarma Melngailis:\nTiktok: https://www.tiktok.com/@sarmamelngailis\nIG: https://www.instagram.com/sarmamelngailis\nLinktree: https://linktr.ee/sarmamelngailis?utm_source=linktree_profile_share\u0026ltsid=5c0c0b7d-0fd4-4700-b1ff-86848db49061\nBooks: https://l1nk.dev/Sarma-Melngailis-Books\nConnect with Dr. Christine:\nProtective Parenting Program: https://www.coercivecontrolconsulting.com/services/for-parents/\nOfficial site: https://www.coercivecontrolconsulting.com/\nYoutube: https://www.youtube.com/@DrCocchiola-coercivecontrol/videos\nTiktok: https://www.tiktok.com/@dr.c_coercivecontrol\nIG: https://www.instagram.com/dr.cocchiola_coercivecontrol/\nTEDxTalks: https://www.youtube.com/watch?v=gp2qByKOue4\u0026t=24s\nBooks: https://url-shortener.me/c/FramedBook\nhttps://url-shortener.me/c/EveryMomentOfEveryDay\n\nIf this episode landed for you, please share it with someone who needs to hear it, subscribe for more trauma-informed conversations, and consider leaving a review — it helps other survivors find validation and safety.\n\n— Dr. Christine Cocchiola \u0026 guest Sarma Melngailis\n\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-10T19:37:18Z",
      "duration": "00:48:41",
      "explicit": false,
      "spotifyId": "1kXJOKgDHpjPLvM67wHYuW",
      "appleId": 1000740735187,
      "youTubeId": "POrFEPcUeO8",
      "subjects": [
        "Cult Psychology",
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kXJOKgDHpjPLvM67wHYuW",
        "apple": "https://podcasts.apple.com/podcast/coercion-cult-dynamics-survival-with-sarma-melngailis/id1704962170?i=1000740735187",
        "youtube": "https://www.youtube.com/watch?v=POrFEPcUeO8"
      }
    },
    {
      "id": "84c97d28-638f-4736-bd7a-031061a00da1",
      "title": "Reigniting Attachment: Small Shifts That Help Your Child’s Brain Heal",
      "description": "In today’s video, Dr. Christine Cocchiola shares practical, healing-focused ways protective parents can reignite attachment with children who have been harmed, manipulated, or distanced by an abusive parent.\n\nShe explains why small environmental changes—like moving a photo, placing an old picture on the counter during breakfast, or sending a benign childhood memory by text—can awaken parts of the brain connected to safety, joy, and belonging. These moments help children reconnect to the truth of their relationship with the protective parent.\n\nDr. Christine also discusses why children may pull away, become non-responsive, or reject contact, and how this is often a direct result of years of coercive control—not a reflection of who you are as a parent.\n\nTo rebuild connection, she emphasizes:\n\n✨ Using photos and shared memories to gently spark attachment\n✨ Sending benign, expectation-free messages\n✨ Avoiding triggers that push children into the “unsafe” brain state\n✨ Understanding the difference between “walking on eggshells” with an abuser vs. regulating yourself for your child’s healing\n✨ Why trying to “correct” or direct an estranged child often backfires\n\nChildren impacted by coercive control are not the same children they once were. But with compassion, regulation, and strategic connection, healing remains possible.\n\n💙 If this supports you, please subscribe and share.\nYour presence matters. Your attachment with your child is real. And you are not alone.\n\n🌿 Join Dr. C’s Community for support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola #CoerciveControl #ProtectiveParenting #RebuildingAttachment #EstrangedChildren #TraumaInformedParenting #PostSeparationAbuse #NarcissisticAbuse #AttachmentHealing\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-05T17:00:47Z",
      "duration": "00:05:03",
      "explicit": false,
      "youTubeId": "QdRt443RVyg",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QdRt443RVyg"
      }
    },
    {
      "id": "82855c36-76e7-4e03-8b06-a51b76b11a62",
      "title": "Show Your Child You’re Not Broken — Even After Coercive Control",
      "description": "When a coercive controller creates stormy seas, your role becomes the lifeboat your child searches for — even if they appear distant or aligned with the abuser.\n\nIn this clip, Dr. Christine Cocchiola shares the one powerful thing protective parents can do right now:\n\nLive your life in a way that shows your child the abuser did not break you.\n\nChildren are watching — silently, consistently.\nThey see how you move through the world, who you follow, how you heal, and whether you’re still standing.\nYour strength becomes their anchor.\n\n💙 Your healing supports their healing.\n\n📺 Watch the full video on Dr. C’s channel.\n\n#DrChristineCocchiola #ProtectiveParents #CoerciveControl #NarcissisticAbuse #PostSeparationAbuse #TraumaInformedParenting\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-12-01T17:00:02Z",
      "duration": "00:01:08",
      "explicit": false,
      "youTubeId": "aNNqVacuq9E",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aNNqVacuq9E"
      }
    },
    {
      "id": "5d5148f6-1583-4cde-9ba8-0dc4b2813bfa",
      "title": "Coercive Control, Courts \u0026 “Perfect Prey” — with Dr. Ramani Durvasula",
      "description": "In this episode of Perfect Prey I’m joined by my friend and colleague Dr. Ramani Durvasula, a clinical psychologist, author, professor, and internationally recognized expert on narcissistic abuse. We dig into why coercive control feels like imprisonment without bars, how systems (including family court) retraumatize survivors, and what survivors can do to protect themselves and their children. \nWhat we cover\nWhy coercive control is often invisible — and why the myth of “free will” makes it so hard for institutions to understand emotional abuse.\n\nHow victim-blaming and the DARVO pattern (Deny, Attack, Reverse Victim \u0026 Offender) let abusers manipulate sympathy in court.\n\nThe difference between milder narcissistic traits and the kind of malignant, coercive abuse that creates real danger and CPTSD-like responses.\n\nPractical, trauma-informed strategies for surviving family court: what to document, when to prioritize safety over “justice,” and how to protect your children while minimizing retraumatization.\n\n\nThe “industrial divorce complex” — how systems and money can deepen harm, and what survivors can do strategically to preserve their safety and sense of self.\n\nWhy listen\n If you’re a survivor, a clinician, a legal professional, or someone trying to understand a loved one’s experience, this conversation names the harms you may not see on the surface and gives clear, compassionate guidance for staying safe and getting validated. You’ll hear clinical insight paired with real-world, tactical advice about custody, court behavior, and how to build a safety-first plan.\n\nGuest bio (short)\n Dr. Ramani Durvasula, Ph.D., is a licensed clinical psychologist, author, and media expert who writes and speaks widely about narcissism, personality disorders, and relationship dynamics. She maintains a clinical practice and educational network focused on helping people heal from narcissistic relationships. \n\n\nConnect with Dr. Ramani:\nOfficial site: https://doctor-ramani.com/drn/\nYoutube: https://www.youtube.com/@DoctorRamani\nTiktok: https://www.tiktok.com/@doctorramani\nIG: https://www.instagram.com/doctorramani/\nPodcast: Navigating Narcissism with Dr. Ramani\nBooks: https://www.amazon.co.uk/stores/Ramani-Durvasula/author/B00C2C5U0O?ref=ap_rdr\u0026isDramIntegrated=true\u0026shoppingPortalEnabled=true\n\nConnect with Dr. Christine:\nProtective Parenting Program: https://www.coercivecontrolconsulting.com/services/for-parents/\nOfficial site: https://www.coercivecontrolconsulting.com/\nYoutube: https://www.youtube.com/@DrCocchiola-coercivecontrol/videos\nTiktok: https://www.tiktok.com/@dr.c_coercivecontrol\nIG: https://www.instagram.com/dr.cocchiola_coercivecontrol/\nTEDxTalks: https://www.youtube.com/watch?v=gp2qByKOue4\u0026t=24s\nBooks: https://url-shortener.me/c/FramedBook\nhttps://url-shortener.me/c/EveryMomentOfEveryDay\n\nIf this episode landed for you: share it with someone who needs to hear it, subscribe for more trauma-informed conversations, and leave a rating — it helps more survivors find validation and safety.\n— Dr. Christine Cocchiola \u0026 guest Dr. Ramani Durvasula\n\n\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-11-28T16:38:05Z",
      "duration": "00:40:20.0100000",
      "explicit": false,
      "spotifyId": "0qep204iUvbHbnjGfCkBlE",
      "appleId": 1000738815831,
      "youTubeId": "-07qf70sO50",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qep204iUvbHbnjGfCkBlE",
        "apple": "https://podcasts.apple.com/podcast/coercive-control-courts-perfect-prey-with-dr-ramani/id1704962170?i=1000738815831",
        "youtube": "https://www.youtube.com/watch?v=-07qf70sO50"
      }
    },
    {
      "id": "a860c26b-5c13-4d97-b948-52bfc2e602c3",
      "title": "Why Therapy for Children of Coercive Control is NOT always the answer Part 2",
      "description": "In this episode, Dr. Christine Cocchiola continues the conversation on why therapy can sometimes become a trap for children living under coercive control.\n\nWhen children are forced into therapy while carrying a false narrative created by the abusive parent, they may feel pressured to repeat harmful statements about their safe, protective parent. Many therapists—without training in coercive control—may unintentionally affirm this narrative, not realizing the child is speaking from fear, confusion, or manipulation.\n\nDr. Christine explains how this dynamic can create shame, emotional discomfort, and deep internal conflict for the child. Instead of healing, they may feel trapped in a cycle of saying things they don’t believe, simply to survive the abusive environment.\n\nShe also highlights why it’s essential to teach children critical thinking, helping them gently explore:\n\nWhere did this idea come from?\n\nDid I experience this, or was I told this?\n\nWho benefits from me believing this?\n\nTherapy can be helpful, but only with professionals who truly understand coercive control. Otherwise, it can increase shame, reinforce false narratives, and put the child in emotionally damaging positions.\n\nDr. Christine also previews her next video, where she’ll discuss how certain well-intended protective-parent behaviors can unintentionally lead a child to identify with the aggressor — and how to shift those dynamics with compassion and awareness.\n\n💛 If this resonates, please subscribe, share, and help support families navigating these painful dynamics.\nYou are not alone.\n\n🌿 Join Dr. C’s Community for support, education, and connection:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola #CoerciveControl #ChildTherapy #ProtectiveParenting #FalseNarratives #TraumaInformedCare #PostSeparationAbuse #ParentalManipulation #NarcissisticAbuse #FamilyCourtIssues\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-11-24T17:01:29Z",
      "duration": "00:02:53",
      "explicit": false,
      "youTubeId": "nrtFWCY0z0Y",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nrtFWCY0z0Y"
      }
    },
    {
      "id": "b34c27ca-2e8c-4dc9-b7ab-4c8eca28ceca",
      "title": "Why Therapy for Children of Coercive Control is NOT always best",
      "description": "In today’s video, Dr. Christine Cocchiola speaks to protective parents whose children return from the other parent’s home sad, angry, confused, or deeply dysregulated.\nThis is one of the most painful and common experiences in coercive control dynamics — when a child’s body tells the truth before they have the words to describe it.\n\nDr. Christine explains how children experience somatic cues:\n“My belly hurts… my head feels bad… something inside me doesn’t feel right,”\nand how these sensations often reveal their discomfort or fear, even when they’re unable to articulate what’s happening in unsafe environments.\n\nShe also discusses the heartbreaking reality of being forced by systems to send your child to the predatory parent, even when the child is showing clear signs of distress. This is a form of systemic coercive control, and it leaves protective parents feeling dismissed, blamed, or entirely unheard.\n\nDr. Christine shares how her new children’s book, Every Moment of Every Day, helps parents support their child through these dysregulated transitions, offering validation, connection, and somatic awareness for little ones living with these complex experiences.\n\n✨ In this video, Dr. Christine covers:\n\nWhy children become dysregulated before or after unsafe parenting time\n\nSomatic warning signs children feel in their bodies\n\nWhy systems often dismiss protective parents\n\nHow to validate your child’s emotions and boundaries\n\nWhy protective parents have more influence than they realize\n\nHow Every Moment of Every Day supports these conversations\n\n💛 If this resonates, please subscribe and share.\nYou are not alone. Protective parents are doing the hardest work there is — and your voice, your presence, and your connection matter more than you know.\n\n🎙️ Listen to Dr. C’s podcast, Perfect Prey for deeper validation and education.\n🌿 Join Dr. C’s Community for support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola #CoerciveControl #ProtectiveParent #DysregulatedChild #SomaticExperiences #PostSeparationAbuse #EveryMomentOfEveryDay #TraumaInformedParenting\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-11-21T17:01:17Z",
      "duration": "00:02:23",
      "explicit": false,
      "youTubeId": "cTop_VC057c",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cTop_VC057c"
      }
    },
    {
      "id": "41f5175e-2235-4915-be07-2f782c4236ae",
      "title": "The Predatory Parent: Traits, Tactics \u0026 Why It Gets Worse Over Time",
      "description": "In today’s video, Dr. Christine Cocchiola breaks down the reality of the predatory parent — individuals who use coercive control, narcissistic tactics, manipulation, and system exploitation to harm their partners and children.\n\nShe explains why coercive control is the underpinning of all abuse and why these dynamics don’t start with physical violence. Instead, they begin with power, control, psychological domination, and escalate over time — especially after separation, when the abuser feels their power slipping.\n\nDr. Christine dives into the traits often seen in predatory parents:\n\nNarcissism (grandiosity, victimhood, no genuine empathy)\n\nMachiavellianism (manipulation, flying monkeys, DARVO)\n\nPsychopathy (willingness to break the law, stalking, tracking devices, harassment)\n\nSadism (deriving satisfaction from causing emotional harm)\n\nShe emphasizes an essential truth: abusers weaponize children because they know children are what matter most to the protective parent.\n\nUnderstanding these patterns is the first step toward clarity, safety planning, and protecting both yourself and your children.\n\n💛 If this resonates with you, please subscribe and share.\nYou are not alone, and your clarity is powerful.\n\n🌿 Join Dr. C’s Community for deeper education and support:\nhttps://go.drcocchiola.com/innercirclecommunity\n\n#DrChristineCocchiola #PredatoryParent #CoerciveControl #NarcissisticAbuse #PsychologicalAbuse #PostSeparationAbuse #DARVO #Narcissism #ProtectiveParenting #TraumaRecovery\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-11-14T17:00:11Z",
      "duration": "00:04:41",
      "explicit": false,
      "youTubeId": "3AjJgvHBgt8",
      "subjects": [
        "Cult Psychology",
        "One-on-one"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3AjJgvHBgt8"
      }
    },
    {
      "id": "e26519ac-08f2-474b-a998-930e51bfe447",
      "title": "Coercive Control, Narcissistic Abuse, and the Power of Community",
      "description": "Coercive control isn’t always visible — but it is always about power.\n\nIn this video, Dr. Christine Cocchiola, a coercive control advocate, researcher, and protective parent herself, shares how narcissistic abuse and coercive control intersect — and why understanding this dynamic is essential for survivors and their children.\n\nProtective mothers often face impossible situations: navigating family court, parenting children harmed by abuse, and trying to make sense of behaviors that are deeply manipulative yet often dismissed by others. You are not alone in this.\n\n💜 Join our free community for protective mothers:\nA space for connection, learning, and support — where we share resources, discuss current advocacy, and remind each other that healing and justice are possible.\n\n👉 Join here: https://go.drcocchiola.com/innercirclecommunity\n\nTogether, we’re changing the narrative — one conversation, one mother, one community at a time.\n\n#CoerciveControl #ProtectiveMothers #NarcissisticAbuse #DrChristineCocchiola #FamilyCourtAwareness\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-11-10T17:00:58Z",
      "duration": "00:03:01",
      "explicit": false,
      "youTubeId": "_69nSI3jKH0",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_69nSI3jKH0"
      }
    },
    {
      "id": "645b957d-2666-477c-9561-6470917b6302",
      "title": "Children of Coercive Control | Hidden ACEs We’re Not Talking About",
      "description": "In this episode, Dr. Christine Cocchiola discusses the Adverse Childhood Experiences (ACE) Study and its deep connection to children living under coercive control.\n\nDrawing on her recent interview with Dr. Judith Herman, one of the foremost experts on trauma, Dr. Christine explores how the ACE Study revealed the lifelong impact of childhood abuse, neglect, and exposure to violence—and why children of coercive controllers are also suffering adverse experiences that often go unseen.\n\nShe highlights how coercive control in the family system destroys healthy attachment, shapes a child’s emotional development, and increases the risk of anxiety, depression, and other long-term health problems. Most importantly, Dr. Christine reminds protective parents that their connection and safety remain their child’s greatest source of healing.\n\n✨ Key topics covered:\n\nWhat the ACE Study teaches us about trauma\n\nThe connection between coercive control and adverse experiences\n\nWhy coercive control isn’t fully reflected in the ACE framework\n\nHow safe parents can still protect and fortify attachment\n\nInsights from Dr. Judith Herman and Bessel van der Kolk\n\n💛 If this resonates with you, please subscribe, share this video, and explore more conversations on trauma, recovery, and advocacy.\n➡️ Listen to Dr. Christine’s podcast, Perfect Prey, for more in-depth discussions.\n\n#DrChristineCocchiola #AdverseChildhoodExperiences #CoerciveControl #TraumaRecovery #Attachment #ParentingAfterAbuse #JudithHerman #BesselVanderKolk #ACEStudy\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-11-06T17:00:15Z",
      "duration": "00:07:04",
      "explicit": false,
      "youTubeId": "3onlsgPBTvk",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3onlsgPBTvk"
      }
    },
    {
      "id": "331e8d59-31e3-48a0-b5f5-9e0e38ac6fb5",
      "title": "The Hidden Pain of Children Caught in Coercive Control",
      "description": "In this video, Dr. Christine Cocchiola discusses one of the most misunderstood dynamics in family systems impacted by abuse — parental alienation — and why she reframes it as “malicious fracturing of attachment.”\n\nDr. C explains how abusers intentionally and covertly disrupt a child’s secure bond with the safe, protective parent — not always through physical violence, but often through subtle manipulation, gaslighting, and conditional love. Over time, these tactics distort a child’s sense of safety and connection, leaving protective parents feeling alienated and powerless.\n\nThis episode helps you understand:\n\nWhy “parental alienation” is often misused in family court\n\nHow abusers weaponize attachment to harm both parent and child\n\nWhat protective parents can do to rebuild and fortify their child’s secure bond\n\nWhy awareness and intentional reconnection are key to healing fractured attachment\n\nIf this resonates with you, remember — you’re not alone. Join Dr. Cocchiola’s Inner Circle Community to access expert discussions, guest speakers, and continued support for survivors and advocates.\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-10-30T16:58:44Z",
      "duration": "00:05:58",
      "explicit": false,
      "youTubeId": "YwOwO799jnc",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YwOwO799jnc"
      }
    },
    {
      "id": "4d9e3779-5db5-4b63-b0a8-90a8a46570b2",
      "title": "What are the Costs \u0026 Benefits | The Hidden Costs of Going Back to Court with Dr. Cocchiola",
      "description": "In this episode, Dr. Christine Cocchiola unpacks one of the toughest questions protective parents face: should you take the abuser back to court when your child resists visitation or therapy? A mom with a 16-year-old who no longer wants to visit and a 19-year-old off at college wonders if mandating therapy and enforcing shared custody through the court is the right step.\n\nDr. Cocchiola explores the costs and benefits of returning to court. While the desire to prove to your child that you fought for them is powerful, the hidden costs can be devastating. Abusers often retaliate by intensifying control and punishment, targeting the child as a weapon. This leaves the developing brain depleted, unable to regulate, connect, or process. The child may then appear aligned with the abuser not out of preference, but out of sheer survival.\n\nParents must ask: is the fight in court truly in the best interest of the child, or does it risk greater harm? Dr. Cocchiola stresses the importance of weighing these choices carefully. Sometimes letting go of the rope is not giving up, but protecting your child from further suffering. It sends the message that your love and safety are constant, your door is always open, and you understand why they made the choices they did under coercion.\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-10-23T15:27:44Z",
      "duration": "00:04:25",
      "explicit": false,
      "youTubeId": "bbrUV8UVaw8",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bbrUV8UVaw8"
      }
    },
    {
      "id": "89f586fb-ff51-4082-9881-8e826230a890",
      "title": "Coercive Control and Narcissistic Abuse: How to Recognize Patterns and Reclaim Your Power with Dr. Jamie Zuckerman",
      "description": "In this episode of Perfect Prey, I sit down with Dr. Jaime Zuckerman, a licensed clinical psychologist and national expert in narcissistic abuse, to uncover the hidden dynamics of coercive control and narcissistic relationships. Dr. Zuckerman shares her deep expertise from years of working with survivors, offering insight into the traits that make individuals vulnerable, the subtle and overt patterns of abuse, and the critical need for better clinician training to identify these behaviors. As the founder of The Z Group, host of the Next Up: Narcissism podcast, and author of two interactive workbooks—Find Your Calm and Find Good Habits—Dr. Zuckerman brings practical tools and real-world strategies for reclaiming your power, setting boundaries, and rebuilding your life. She also shares a sneak peek at her upcoming guided workbook designed to help survivors navigate narcissistic abuse in any type of relationship. Whether you’re a survivor, a clinician, or someone seeking to understand the insidious nature of coercive control, this episode provides clarity, guidance, and the support you need to recognize patterns and take back your power. Connect with Dr. Zuckerman: Workshops: https://www.drjaimezuckerman.com/workshops IG: https://www.instagram.com/dr.z_psychologist/ YouTube: https://www.youtube.com/@DrJaimeZuckerman TikTok: https://www.tiktok.com/@dr.z_psychologist Narcissistic Abuse Coaching: https://www.drjaimezuckerman.com/ Therapy with The Z Group: https://www.zgrouptherapy.com/ Podcast: Next Up: Narcissism https://www.drjaimezuckerman.com/podcast Books: https://www.drjaimezuckerman.com/books",
      "release": "2025-10-21T01:43:14Z",
      "duration": "00:45:42.1510000",
      "explicit": false,
      "spotifyId": "4SesX9IiL1oJVgDFkHFQFA",
      "appleId": 1000732740129,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SesX9IiL1oJVgDFkHFQFA",
        "apple": "https://podcasts.apple.com/podcast/coercive-control-and-narcissistic-abuse-how-to/id1704962170?i=1000732740129"
      }
    },
    {
      "id": "02842a91-20d2-4bd7-babf-bc1a0ee8a70e",
      "title": "Understanding and Recognizing Patterns of Abuse | Signs of Coercive and Narcissistic Behavior",
      "description": "In this episode, we explore patterns of abuse in relationships and their impact on children. I discuss how to recognize both subtle and overt signs of abuse, understand the effects of retraumatization, and take practical steps to assess your relationship, including keeping detailed records of harmful incidents. \n\nWe also cover the challenges survivors face when leaving abusive situations and the importance of support systems. \n\nTune in to gain clarity, validation, and strategies to protect yourself and your children from abusive and coercively controlling behaviors.\n\n👉 Subscribe for more insights and guidance on coercive control, family dynamics, and protective parenting.\n\n👉 To go deeper, explore the Protective Parenting Program—designed to give you the tools and strategies you need to protect yourself and your children.\n\n🔸Listen to The Perfect Prey Podcast: https://podcasts.apple.com/us/podcast/perfect-prey-podcast/id1704962170\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n🔸Services for Parents: https://www.coercivecontrolconsulting.com/services/for-parents/\n🔸Services for Professionals: https://www.coercivecontrolconsulting.com/services/for-professionals/\n🔸Services for Victims of Abuse: https://www.coercivecontrolconsulting.com/services/for-individuals/\n🔸Private Coaching: https://www.coercivecontrolconsulting.com/private-coaching/\n🔸Free Guide: Clinical Implications for Children\nWho Are Coercively Controlled: https://drchristinemarie.kartra.com/page/childvictimofccgrowthguide\n\n00:00 Introduction and Topic Overview\n00:04 Recognizing Harmful Behavior\n00:27 Patterns of Abuse\n01:07 Retraumatization and Self-Reflection\n01:58 Creating an \u0027Icky List\u0027\n02:33 Evaluating the Relationship\n03:45 Seeking Support and Community\n04:12 Conclusion and Final Thoughts\n\n#PatternsOfAbuse #AbuseInRelationships #CoerciveControl #NarcissisticAbuse #ChildProtection #TraumaAwareness #FamilySafety #HealingFromAbuse #DomesticAbuse #EmotionalAbuse #AbuseRecovery #SurvivorSupport #ProtectChildren #HealthyRelationships #AbuseAwareness",
      "release": "2025-10-16T12:01:20Z",
      "duration": "00:04:40",
      "explicit": false,
      "youTubeId": "fd0hjZFY1Ks",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fd0hjZFY1Ks"
      }
    },
    {
      "id": "e693f63b-44a8-4647-89f4-6be831a55f4d",
      "title": "Helping Children Heal After Narcissistic Abuse \u0026 Coercive Control | Parenting Strategies",
      "description": "In this episode, I explore how parents can help children regulate and heal after experiencing narcissistic abuse and coercive control. Drawing on insights from the Omega Institute and experts like Bruce Perry, Gabor Maté, and Bessel van der Kolk, I share practical strategies for protective parenting, creating trust, and fostering emotional safety. \n\nLearn how rhythmic routines, nurturing environments, and consistent connection can support children in navigating trauma and building resilience.\n\n👉 Subscribe for more insights and guidance on coercive control, family dynamics, and protective parenting.\n\n👉 To go deeper, explore the Protective Parenting Program—designed to give you the tools and strategies you need to protect yourself and your children.\n\n🔸Listen to The Perfect Prey Podcast: https://podcasts.apple.com/us/podcast/perfect-prey-podcast/id1704962170\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n🔸Services for Parents: https://www.coercivecontrolconsulting.com/services/for-parents/\n🔸Services for Professionals: https://www.coercivecontrolconsulting.com/services/for-professionals/\n🔸Services for Victims of Abuse: https://www.coercivecontrolconsulting.com/services/for-individuals/\n🔸Private Coaching: https://www.coercivecontrolconsulting.com/private-coaching/\n🔸Free Guide: Clinical Implications for Children\nWho Are Coercively Controlled: https://drchristinemarie.kartra.com/page/childvictimofccgrowthguide\n\n0:00 Introduction and Recent Experience\n00:22 Understanding Child Dysregulation\n00:53 Building Trust and Safety\n01:15 Importance of Regulation and Reasoning\n02:21 Creating Quality Time and Connection\n03:31 Respect and Handling Mistakes\n04:59 Final Thoughts and Encouragement\n\n#NarcissisticAbuse #CoerciveControl #ChildHealing #ProtectiveParenting #TraumaRecovery #ChildRegulation #ParentingTips #HealingAfterAbuse #BrucePerry #GaborMaté #BesselVanDerKolk #TraumaInformedParenting #ChildDevelopment #FamilyHealing #ParentingAfterAbuse",
      "release": "2025-10-13T19:20:45Z",
      "duration": "00:05:52",
      "explicit": false,
      "youTubeId": "XwAVzKIJO1k",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XwAVzKIJO1k"
      }
    },
    {
      "id": "55c36243-1822-4837-829f-3ec9c081bcae",
      "title": "Coercive Control and Abuse Explained by Dr. Cocchiola",
      "description": "Coercive control is the root of nearly every form of abuse, from domestic violence and child abuse to sex trafficking, racism, and even terrorism. In this episode, Dr. Cocchiola explains why recognizing patterns of power and control is critical for therapists, parents, and anyone navigating high-conflict relationships. Drawing on research showing that 68% of mass shooters had a history of domestic abuse, she warns how these behaviors reveal character traits that escalate over time. Dr. Cocchiola outlines the differences between abusers and victims: abusers think in rigid black-and-white terms, while victims often show empathy, optimism, and a tendency to forgive even at their own expense. Through the dominance lens, you will learn how to identify covert and overt forms of control, such as one partner managing all the finances, constant mockery, or using a loved one’s vulnerabilities against them. She stresses that true accountability requires mutuality, reciprocity, and immediate behavioral change, not excuses, minimization, or forcing the victim to accommodate abuse. This talk also challenges cultural biases, especially the higher standards often placed on women in therapy, and emphasizes why children, like adults, should never be made to live with or excuse abusive behavior.\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-10-10T17:07:30Z",
      "duration": "00:05:37",
      "explicit": false,
      "youTubeId": "MNHgcAAr-jA",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MNHgcAAr-jA"
      }
    },
    {
      "id": "91fdb78b-89a7-4132-b21b-91859756e366",
      "title": "Escaping the Narcissist: How to Identify, Survive, and Heal from Manipulative Abuse with Vanessa M. Reiser, LCSW, Therapist, Author, Narcissistic/Cult Abuse Expert",
      "description": "In this episode of Perfect Prey, I sit down with Vanessa Reiser, LCSW, a renowned psychotherapist, speaker, and advocate who has dedicated her career to helping survivors of narcissistic abuse and coercive control reclaim their lives. Vanessa is the founder of Tell a Therapist, a nationwide telehealth platform, and the author of Narcissistic Abuse: A Therapist’s Guide, a groundbreaking resource that not only unpacks the devastating impact of narcissistic and cult abuse but also offers clinicians the training and tools they need to support survivors in the healing process. Together, we explore what coercive control looks like in real life. We talk about why certain people are more vulnerable to narcissistic abuse, the toll it takes on mental health, and how survivors can begin to recognize the patterns and break free. We also shine a light on the unique challenges survivors face in family court when narcissistic abuse is involved, and why therapist training in this area is so urgently needed. Vanessa’s book is an essential guide for professionals and survivors alike, offering not just insight but hope—that recovery is possible, and that healing from narcissistic abuse is about reclaiming your voice, your power, and your life. Connect with Vanessa: Narcissistic Abuse: A Therapist’s Guide: https://www.amazon.com/Narcissistic-Abuse-Therapists-Identifying-Manipulative/dp/0306833174 Tell a Therapist: https://tellatherapist.net/ Follow Vanessa on Instagram: https://www.instagram.com/vanessareiserlcsw/ Resources Mentioned in this Podcast: \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Services for Professionals: https://www.coercivecontrolconsulting.com/services/for-professionals/ \u0026#x1f538;Private Coaching: https://www.coercivecontrolconsulting.com/private-coaching/ \u0026#x1f538;Free Guide: Clinical Implications for Children Who Are Coercively Controlled: https://drchristinemarie.kartra.com/page/childvictimofccgrowthguide",
      "release": "2025-10-04T01:12:48Z",
      "duration": "00:34:59.7470000",
      "explicit": false,
      "spotifyId": "1CYhfOdM001tPhTg098NI7",
      "appleId": 1000730029915,
      "youTubeId": "8iw-p9gpQDI",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1CYhfOdM001tPhTg098NI7",
        "apple": "https://podcasts.apple.com/podcast/escaping-the-narcissist-how-to-identify-survive-and/id1704962170?i=1000730029915",
        "youtube": "https://www.youtube.com/watch?v=8iw-p9gpQDI"
      }
    },
    {
      "id": "4c8d863f-7959-46a2-a3a2-e8c70c8199d4",
      "title": "Understanding Coercive Control in Family Relationships | Protecting Yourself \u0026 Your Children",
      "description": "In this video, I speak directly to you about the realities of coercive control—a pattern of abuse that is often invisible, yet deeply damaging. Coercive control isn’t just about power; it’s about stripping away freedom, safety, and identity. And when children are caught in the middle, the consequences can last a lifetime.\n\nIn this talk, you’ll learn:\n\nWhat coercive control looks like in everyday family life\n\nThe psychological and emotional impact on both adults and children\n\nHow to recognize the subtle signs of manipulation and domination\n\nWhy children in these environments often struggle in relationships later in life\n\nWhat you can do to strengthen your attachment and protect your children\n\nPractical strategies to begin breaking free from the abuser’s grip\n\nMy goal is to help you understand the dynamics of coercive control so you can move toward greater safety, empowerment, and healing.\n\n👉 Subscribe for more insights and guidance on coercive control, family dynamics, and protective parenting.\n\n👉 To go deeper, explore the Protective Parenting Program—designed to give you the tools and strategies you need to protect yourself and your children.\n\n🔸Listen to The Perfect Prey Podcast: https://podcasts.apple.com/us/podcast/perfect-prey-podcast/id1704962170\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n🔸Services for Parents: https://www.coercivecontrolconsulting.com/services/for-parents/\n🔸Services for Professionals: https://www.coercivecontrolconsulting.com/services/for-professionals/\n🔸Services for Victims of Abuse: https://www.coercivecontrolconsulting.com/services/for-individuals/\n🔸Private Coaching: https://www.coercivecontrolconsulting.com/private-coaching/\n🔸Free Guide: Clinical Implications for Children\nWho Are Coercively Controlled: https://drchristinemarie.kartra.com/page/childvictimofccgrowthguide\n\n00:00 Introduction and Channel Overview\n00:05 Understanding Coercive Control\n00:42 Impact on Family Dynamics\n01:14 Abuser Tactics and Victim Response\n02:26 Protecting Children in Abusive Systems\n06:21 Challenges in Therapy and Support Systems\n16:17 Building Resilience and Positive Memories\n20:36 Conclusion and Resources\n\n#CoerciveControl #ProtectiveParenting #ChildSafety #AbuseAwareness #DomesticAbuse #FamilyDynamics #EmotionalAbuse #ParentalGuidance #TraumaRecovery #ParentingTips #CoerciveControlAwareness #ProtectYourChildren #PsychologicalAbuse #ToxicRelationships #FamilyCourtIssues",
      "release": "2025-09-26T07:00:27Z",
      "duration": "00:21:19",
      "explicit": false,
      "youTubeId": "T3p-tIibgRQ",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T3p-tIibgRQ"
      }
    },
    {
      "id": "50ceeb87-3aa0-48bf-98a3-c8448e54018a",
      "title": "Exposing the Reality of Family Courts with Dr. Bandy X Lee",
      "description": "In this episode of Perfect Prey: A Podcast on Coercive Control, I am joined by Dr. Bandy X. Lee, a forensic psychiatrist and internationally recognized expert on violence. Together, we examine the alarming injustices occurring within family courts, where coercive control, child abuse, and even child trafficking are too often overlooked or minimized. Dr. Lee brings her extensive experience to highlight how judicial culture and systemic failures repeatedly fail to protect victims, leaving children and protective parents at risk. We also discuss the urgent need for reform and the strategies that could begin to shift these deeply entrenched systems. This is an important conversation for anyone concerned about child safety, coercive control, and the changes necessary to ensure our family courts serve the best interests of children. Tune in for insight, advocacy, and a call to action for systemic change. Connect with Dr. Bandy: Website: https://bandylee.com/ Instagram: https://www.instagram.com/bandyxlee/?hl=enJoin Dr. Bandy on Substack: https://bandyxlee.substack.com/ Resources Mentioned in this Podcast: \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Services for Parents: https://www.coercivecontrolconsulting.com/services/for-parents/ \u0026#x1f538;Services for Professionals: https://www.coercivecontrolconsulting.com/services/for-professionals/ \u0026#x1f538;Services for Victims of Abuse: https://www.coercivecontrolconsulting.com/services/for-individuals/ \u0026#x1f538;Private Coaching: https://www.coercivecontrolconsulting.com/private-coaching/ \u0026#x1f538;Free Guide: Clinical Implications for Children Who Are Coercively Controlled: https://drchristinemarie.kartra.com/page/childvictimofccgrowthguide",
      "release": "2025-09-20T20:56:54Z",
      "duration": "00:36:41.8240000",
      "explicit": false,
      "spotifyId": "67VREa601ZSimwTOylP6Li",
      "appleId": 1000727667122,
      "youTubeId": "nPA2LpqZf5A",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67VREa601ZSimwTOylP6Li",
        "apple": "https://podcasts.apple.com/podcast/exposing-the-reality-of-family-courts-with-dr-bandy-x-lee/id1704962170?i=1000727667122",
        "youtube": "https://www.youtube.com/watch?v=nPA2LpqZf5A"
      }
    },
    {
      "id": "2d121e6e-4d51-40f5-9078-f3206462bf07",
      "title": "The Psychology of Coercive Control: Cognitive Dissonance and Trauma Bonds Explained",
      "description": "In this episode of Perfect Prey: A Coercive Control Podcast, Dr. Christine Cocchiola sits down with Dr. Peter Salerno to take a deeper look at the hidden dynamics of coercive control and the psychological abuse that entraps partners and children in cycles of fear, confusion, and dependency. We explore the defining traits of coercive controllers, how they manipulate both adult and child victims, and why survivors often struggle with cognitive dissonance, a mental conflict that can keep them tethered to abusive relationships long after the harm is clear. Together, we discuss the traumatic impact of cognitive dissonance, how abusers condition children to adopt distorted beliefs, and what protective strategies parents can use to safeguard their children’s well-being. You’ll also hear about the crucial role of trauma-informed therapy, ways to respond intentionally to children’s conditioned behaviors, and how survivors can begin to break free from the psychological grip of coercive control. This conversation sheds light on the complex psychological dynamics of abuse and offers practical steps for supporting both adults and children who have been targeted by coercive controllers. If you’ve ever felt trapped in a relationship that left you doubting your own reality, or if you’re working to protect children from ongoing manipulation, this episode will give you clarity, tools, and hope for the path forward. Connect with Dr. Peter Salerno: Website: https://www.drpetersalerno.com/ Instagram: https://www.instagram.com/drpetersalerno/ Book a Consultation: https://www.drpetersalerno.com/new-page-1 Book: https://www.drpetersalerno.com/new-page Resources Mentioned in this Podcast: \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Services for Parents: https://www.coercivecontrolconsulting.com/services/for-parents/ \u0026#x1f538;Services for Professionals: https://www.coercivecontrolconsulting.com/services/for-professionals/ \u0026#x1f538;Services for Victims of Abuse: https://www.coercivecontrolconsulting.com/services/for-individuals/ \u0026#x1f538;Private Coaching: https://www.coercivecontrolconsulting.com/private-coaching/ \u0026#x1f538;Free Guide: Clinical Implications for Children Who Are Coercively Controlled: https://drchristinemarie.kartra.com/page/childvictimofccgrowthguide",
      "release": "2025-09-05T12:00:00Z",
      "duration": "00:32:40.7260000",
      "explicit": false,
      "spotifyId": "73ZBhlOrhKhRJLHifsvTiL",
      "appleId": 1000725144785,
      "youTubeId": "TAfq4BPzNes",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/73ZBhlOrhKhRJLHifsvTiL",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-coercive-control-cognitive/id1704962170?i=1000725144785",
        "youtube": "https://www.youtube.com/watch?v=TAfq4BPzNes"
      }
    },
    {
      "id": "fbff973b-2e56-4884-a0df-5af6ee4d98d3",
      "title": "Unveiling Jennifer Dulos\u0027 Tragic Tale: Insights from Rich Cohen on Coercive Control",
      "description": "In this episode of Perfect Prey Podcast, I sit down with journalist and author Rich Cohen to discuss his book, Murder in the Dollhouse, which explores the tragic case of Jennifer Dulos, a mother from New Canaan, Connecticut, murdered by her husband, Fotis Dulos. Together, we examine the role of coercive control in intimate partner violence, the systemic failures that too often leave victims unprotected, and the broader implications for Jennifers\u0027 Law in Connecticut. Rich Cohen is a bestselling author and award-winning journalist whose work has appeared in The New York Times, Vanity Fair, The Atlantic, and Rolling Stone. His keen ability to uncover the human story behind complex events has shaped his career as both a storyteller and social commentator, bringing clarity and depth to difficult conversations. Rich shares powerful insights into the patterns of abuse, the hidden nature of coercion, and why it is essential for all of us to recognize the warning signs. Connect with Rich: Buy the book: https://www.amazon.com/Murder-Dollhouse-Jennifer-Dulos-Story/dp/0374608067 Follow Rich on Social Media: https://www.instagram.com/author.richcohen/?hl=en https://www.facebook.com/rich.cohen1 https://www.linkedin.com/in/rich-cohen-4736816/ https://x.com/richcohen2003?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor Resources To Support this Podcast: \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Services for Parents: https://www.coercivecontrolconsulting.com/services/for-parents/ \u0026#x1f538;Services for Professionals: https://www.coercivecontrolconsulting.com/services/for-professionals/ \u0026#x1f538;Services for Victims of Abuse: https://www.coercivecontrolconsulting.com/services/for-individuals/ \u0026#x1f538;Private Coaching: https://www.coercivecontrolconsulting.com/private-coaching/ \u0026#x1f538;Free Guide: Clinical Implications for Children Who Are Coercively Controlled: https://drchristinemarie.kartra.com/page/childvictimofccgrowthguide",
      "release": "2025-08-23T06:59:00Z",
      "duration": "00:56:04.4870000",
      "explicit": false,
      "spotifyId": "1ahWdGsLQUQan32hQYkkTH",
      "appleId": 1000723191743,
      "youTubeId": "wnNPdC-s16U",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ahWdGsLQUQan32hQYkkTH",
        "apple": "https://podcasts.apple.com/podcast/unveiling-jennifer-dulos-tragic-tale-insights-from/id1704962170?i=1000723191743",
        "youtube": "https://www.youtube.com/watch?v=wnNPdC-s16U"
      }
    },
    {
      "id": "53ede2c7-55de-4618-8ceb-7a91e1130ceb",
      "title": "Understanding Narcissism and Coercive Control with Mark Vicente",
      "description": "In this episode of Perfect Prey, I sit down with filmmaker and NXIVM Whistleblower, Mark Vicente, to explore the insidious nature of narcissism and coercive control. Known for his role in exposing the NXIVM cult and for his upcoming documentary Narcissist Playbook, Mark brings a rare blend of lived experience and narrative insight to a conversation that is both deeply personal and profoundly educational. Together, we examine how narcissistic abuse thrives on confusion, manipulation, and silence. Coercive control isn\u0027t always visible—often it hides in plain sight, eroding a survivor’s sense of self through emotional, psychological, and sometimes spiritual abuse. Mark shares how he came to recognize the patterns of power and control he endured, and why storytelling and awareness are key to dismantling these dynamics. As a licensed clinical social worker and survivor of coercive control myself, this conversation is one I know will resonate. We talk about the trauma of emotional abuse, the grooming tactics abusers use to gain and maintain control, and the long road to healing after escaping these toxic dynamics. Mark’s courage and clarity offer validation to those still trying to make sense of what happened to them, and hope to those who are just beginning to find their voice. This is more than a podcast episode… it’s a call to awareness, to healing, and to action. Tune in to better understand the trauma of coercive control and narcissistic relationships, and to remember that your truth is the first step toward freedom. Connect with Mark: Mark\u0027s Instagram: https://www.instagram.com/markvicente/?hl=en Narcissist Playbook Instagram: https://www.instagram.com/thenarcissistsplaybook/?hl=en Website: https://www.empathynotincluded.com/ Facebook: https://www.facebook.com/markvicente/ Listen to Mark\u0027s Podcast: https://podcasts.apple.com/us/podcast/wtf-is-on-my-mind/id1646783869 Watch on YouTube: https://www.youtube.com/channel/UCX1OsELrINqvPVImbyM6qdQ Resources Mentioned in this Podcast: \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Services for Parents: https://www.coercivecontrolconsulting.com/services/for-parents/ \u0026#x1f538;Services for Professionals: https://www.coercivecontrolconsulting.com/services/for-professionals/ \u0026#x1f538;Services for Victims of Abuse: https://www.coercivecontrolconsulting.com/services/for-individuals/ \u0026#x1f538;Private Coaching: https://www.coercivecontrolconsulting.com/private-coaching/ \u0026#x1f538;Free Guide: Clinical Implications for Children Who Are Coercively Controlled: https://drchristinemarie.kartra.com/page/childvictimofccgrowthguide",
      "release": "2025-08-08T12:04:00Z",
      "duration": "00:44:43.1000000",
      "explicit": false,
      "spotifyId": "41rMGNKRotGL19bHnHLrnG",
      "appleId": 1000721188312,
      "youTubeId": "8MArwecta34",
      "subjects": [
        "Cult Psychology",
        "NXIVM",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/41rMGNKRotGL19bHnHLrnG",
        "apple": "https://podcasts.apple.com/podcast/understanding-narcissism-and-coercive-control-with/id1704962170?i=1000721188312",
        "youtube": "https://www.youtube.com/watch?v=8MArwecta34"
      }
    },
    {
      "id": "41493b5c-b379-491b-a713-0ba1bd5323fa",
      "title": "Coercive Control in Family Law with Meg Groff",
      "description": "For over 40 years, Attorney Meg Groff has been a fierce advocate for victims of domestic abuse. In her powerful memoir, Not If I Can Help It, Meg shares some of the most harrowing and eye-opening cases she’s encountered, offering a rare glimpse into the justice system through the eyes of someone who fought tirelessly within it. Alongside Dr. C, co-author of FRAMED: Women in the Family Court Underworld, Meg is committed to raising awareness about the often-overlooked realities women and children face in the family court system. --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-07-25T12:00:00Z",
      "duration": "00:31:37.8800000",
      "explicit": false,
      "spotifyId": "3P29r4Gy9h7juC9eBZ50Bl",
      "appleId": 1000718979048,
      "youTubeId": "42DJlRLgRLo",
      "subjects": [
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3P29r4Gy9h7juC9eBZ50Bl",
        "apple": "https://podcasts.apple.com/podcast/coercive-control-in-family-law-with-meg-groff/id1704962170?i=1000718979048",
        "youtube": "https://www.youtube.com/watch?v=42DJlRLgRLo"
      }
    },
    {
      "id": "257d8f16-554c-4271-abfd-4c4333524439",
      "title": "Podcast: Children of Coercive Control - Jessi Hersey",
      "description": "In this episode, Jessi Hersey bravely shares her story of surviving two forms of coercive control: childhood grooming by her drum teacher and emotional manipulation within the Twin Flames Universe online cult. \n\nAs a neurodivergent survivor, Jessi reflects on how her autism both made her more vulnerable and more attuned to subtle forms of abuse. She discusses the long-term impact of grooming, the cult’s use of “mirror exercises” to control beliefs, and her journey to reclaim safety and identity. \n\nJessi’s story highlights the urgent need for awareness around neurodivergence, grooming, and online spiritual coercion.\n\n---\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-07-11T12:30:45Z",
      "duration": "00:27:55",
      "explicit": false,
      "spotifyId": "39D1tzULdGrOVZjqv1hV1R",
      "appleId": 1000716827542,
      "youTubeId": "WzAu1aC2d7k",
      "subjects": [
        "Cult Psychology",
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39D1tzULdGrOVZjqv1hV1R",
        "apple": "https://podcasts.apple.com/podcast/children-of-coercive-control-jessi-hersey/id1704962170?i=1000716827542",
        "youtube": "https://www.youtube.com/watch?v=WzAu1aC2d7k"
      }
    },
    {
      "id": "15228bb6-c2d7-4a39-a061-8db222ec3080",
      "title": "The System Failed Om: Why Leah Moses Fought to Change Family Court",
      "description": "In this powerful and emotional episode, Dr. Cocchiola speaks with Leah Moses, mother of Om Moses Gandhi, who was tragically killed by his abusive father after over a decade of family court battles. Leah shares her lived experience of reproductive coercion, intimate partner violence, and systemic failure, and how she turned unimaginable loss into advocacy through Om’s Law. This conversation exposes the urgent need for court reform, judicial accountability, and trauma-informed parenting protections. --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-06-27T12:00:00Z",
      "duration": "00:30:46.7930000",
      "explicit": false,
      "spotifyId": "6TSAwWPnvjx51A9GeuBRGe",
      "appleId": 1000714808342,
      "youTubeId": "t9BEhnp6kMA",
      "urls": {
        "spotify": "https://open.spotify.com/episode/6TSAwWPnvjx51A9GeuBRGe",
        "apple": "https://podcasts.apple.com/podcast/the-system-failed-om-why-leah-moses-fought-to-change/id1704962170?i=1000714808342",
        "youtube": "https://www.youtube.com/watch?v=t9BEhnp6kMA"
      }
    },
    {
      "id": "1db5c724-38df-45ef-aec6-f128a139cc18",
      "title": "Podcast: Children of Coercive Control - Maya Laing",
      "description": "Maya Laing joins Dr. C on Perfect Prey to share her and her brother Sebastian\u0027s experiences growing up in a home where they felt unsafe with one parent. When they expressed their desire to live with their father, their mother turned to the family court system, resulting in mandated reunification therapy and a reunification camp a devastating consequence for children who feel unsafe with one parent.\n\n🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-06-17T01:37:08Z",
      "duration": "00:32:35",
      "explicit": false,
      "spotifyId": "3eOljeNO4VHspLiFtJHUXX",
      "appleId": 1000712767053,
      "youTubeId": "-dc4gkHk2-Y",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3eOljeNO4VHspLiFtJHUXX",
        "apple": "https://podcasts.apple.com/podcast/children-of-coercive-control-maya-laing/id1704962170?i=1000712767053",
        "youtube": "https://www.youtube.com/watch?v=-dc4gkHk2-Y"
      }
    },
    {
      "id": "243f7090-2a23-46ae-8e4d-ad09738b31ac",
      "title": "How Aimee Says Supports Victims of Coercive Control with Anne Wintemute",
      "description": "Dr. C interviews Anne Wintemute, the co-creator of Aimee Says, an AI tool that understands coercive control and supports victims and survivors of abuse. Anne Wintemute is the Co-Founder and CEO of Aimee Says, the AI companion for victims and survivors of relationship abuse. She is a fierce champion for the rights of survivors and children and systems that hold perpetrators accountable. ---\u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-05-30T11:45:00Z",
      "duration": "00:30:20.5590000",
      "explicit": false,
      "spotifyId": "4fTMOLaAUBQs4GuWHRRxuU",
      "appleId": 1000710556307,
      "youTubeId": "qkvdJ9yF6As",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fTMOLaAUBQs4GuWHRRxuU",
        "apple": "https://podcasts.apple.com/podcast/how-aimee-says-supports-victims-of-coercive-control/id1704962170?i=1000710556307",
        "youtube": "https://www.youtube.com/watch?v=qkvdJ9yF6As"
      }
    },
    {
      "id": "86e6b3ee-4e7c-47e2-b2d9-07835d339e0a",
      "title": "Like a Cult: Why Children Align with Abusers | Trauma Bonding",
      "description": "🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-05-23T01:00:59Z",
      "duration": "00:04:30",
      "explicit": false,
      "youTubeId": "z7iRg_ggZC0",
      "subjects": [
        "One-on-one",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z7iRg_ggZC0"
      }
    },
    {
      "id": "a9ae88fb-420d-4408-8d5e-90d1ff84963d",
      "title": "Like a Cult: Why Children Align with Abusers | It May Feel Safe",
      "description": "🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-05-23T00:01:03Z",
      "duration": "00:03:32",
      "explicit": false,
      "youTubeId": "vr3e1FfJJvk",
      "subjects": [
        "One-on-one",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vr3e1FfJJvk"
      }
    },
    {
      "id": "f480ece0-8bf0-433d-916e-1d37bdf4fca4",
      "title": "Like a Cult: Why Children Align with Abusers | Intuition Disintegration",
      "description": "🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-05-22T16:42:01Z",
      "duration": "00:02:42",
      "explicit": false,
      "youTubeId": "aE8gUA0c27A",
      "subjects": [
        "One-on-one",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aE8gUA0c27A"
      }
    },
    {
      "id": "ce737bf6-d149-4709-8043-be36ec657400",
      "title": "Like a Cult: Why Children Align with Abusers | Gaslighting",
      "description": "🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-05-22T16:37:25Z",
      "duration": "00:02:36",
      "explicit": false,
      "youTubeId": "7PaX_2BUhiM",
      "subjects": [
        "Cult Psychology",
        "One-on-one"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7PaX_2BUhiM"
      }
    },
    {
      "id": "951c5c73-017e-4998-9ad6-d6151e01a33c",
      "title": "The Truth About Child Therapy in High-Conflict Homes with Sybil Cummin",
      "description": "Dr. Cocchiola sits down with Sybil Cummin, licensed therapist, play therapy expert, and founder of Rising Beyond, to discuss the hidden world of child therapy and coercive control. Sybil shares her front-line experience working with children who have been weaponized, silenced, and fractured by narcissistic or coercively controlling parents—especially in the context of family court and custody battles. She reveals how kids show their trauma in play, how therapists can (and often don’t) catch the signs, and why protective parents are often the best therapists their kids have. \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/pppwselfstudy Download VEST2.1K and Repeatables FREE Guide: https://go.drcocchiola.com/vest-free-guide",
      "release": "2025-05-16T15:44:15Z",
      "duration": "00:39:40.9920000",
      "explicit": false,
      "spotifyId": "2hGqTzXfXsfMsWM1DyAfcd",
      "appleId": 1000708747264,
      "youTubeId": "n5jdxuptV4E",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2hGqTzXfXsfMsWM1DyAfcd",
        "apple": "https://podcasts.apple.com/podcast/the-truth-about-child-therapy-in-high-conflict-homes/id1704962170?i=1000708747264",
        "youtube": "https://www.youtube.com/watch?v=n5jdxuptV4E"
      }
    },
    {
      "id": "2a76bc07-7d10-4c1a-9906-bb75781dbc08",
      "title": "Children of Coercive Control - Gwen \u0026 Grace Girard",
      "description": "These brave young women share their powerful story of growing up with an abusive parent and navigating the ongoing trauma of the family court system. Their courage is undeniable—and their message is clear: Speak up if you can. Someone is listening. DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2025-05-02T12:00:00Z",
      "duration": "00:28:11.9510000",
      "explicit": false,
      "spotifyId": "5dNvsJL7mGVBSsnoId5jos",
      "appleId": 1000705839235,
      "youTubeId": "KsItRve3wGo",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5dNvsJL7mGVBSsnoId5jos",
        "apple": "https://podcasts.apple.com/podcast/children-of-coercive-control-gwen-grace-girard/id1704962170?i=1000705839235",
        "youtube": "https://www.youtube.com/watch?v=KsItRve3wGo"
      }
    },
    {
      "id": "9ad049ab-4dd9-4764-a1e3-c992c8c7fc78",
      "title": "Children Estranged: Why Children Turn Against Protective Parents",
      "description": "Dr. Christine Cocchiola explores the heartbreaking and complex issue of family estrangement and coercive control. Why are so many adult children turning against the parent who protected them? Could it be the result of slow, covert indoctrination by an abuser?Dr. Cocchiola dives deep into the psychology behind estrangement, the power dynamics within abusive family systems, and how protective parents can begin to make sense of this painful reversal. She also speaks directly to estranged young adults, asking important, reflective questions to help them see the bigger picture.\u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-04-18T12:00:00Z",
      "duration": "00:11:53.8120000",
      "explicit": false,
      "spotifyId": "5wVwcYrZQClHXp8c85Ko38",
      "appleId": 1000703993350,
      "youTubeId": "WzgFaJ9QnPM",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wVwcYrZQClHXp8c85Ko38",
        "apple": "https://podcasts.apple.com/podcast/children-estranged-why-children-turn-against-protective/id1704962170?i=1000703993350",
        "youtube": "https://www.youtube.com/watch?v=WzgFaJ9QnPM"
      }
    },
    {
      "id": "1b1824b7-fd58-45bf-8e60-b67313fb33e5",
      "title": "Children of Coercive Control - Caitlin",
      "description": "Caitlin was a protective mother, navigating the chaos of coercive control and the family court system. For years, she believed her father was her rock—until he started giving her advice on how to beat the system. That’s when it hit her. The very tactics she was protecting her children from… were the same ones her father used on her mother. She hadn’t seen her mom in years. But in that moment, everything clicked. The truth rose to the surface—and with it, a deeper clarity about her past and her purpose. --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up for April: go.drcocchiola.com/acceleratedself-study \u0026#x1f538;Sign up for September: go.drcocchiola.com/pppaccelerated-selfstudy2",
      "release": "2025-04-04T16:12:39Z",
      "duration": "00:26:56.8860000",
      "explicit": false,
      "spotifyId": "5rns5NDDaeUnRkBZT8ZgXN",
      "appleId": 1000702228873,
      "youTubeId": "MgZLIxXM59A",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rns5NDDaeUnRkBZT8ZgXN",
        "apple": "https://podcasts.apple.com/podcast/children-of-coercive-control-caitlin/id1704962170?i=1000702228873",
        "youtube": "https://www.youtube.com/watch?v=MgZLIxXM59A"
      }
    },
    {
      "id": "a7f55740-a38e-4918-a313-b110163d3b72",
      "title": "Coercive Control \u0026 The Hidden Trauma of Boys with David Weeks",
      "description": "David Weeks is a survivor of coercive control and human trafficking, bravely speaking out about his experiences. His growing social media following is a testament to the impact of his message. David refuses to stay silent—because abuse thrives in silence.About David:David survived two decades of horrific abuse: familial, medical, and predatory. This included neglect, isolation, coercive control, and attempted murder. Sex trafficked at 13, with known abuse ignored, he was diagnosed with autism and suffered life-altering trauma. He now educates on trauma to support survivors and protect the vulnerable.\u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up for April: go.drcocchiola.com/acceleratedself-study\u0026#x1f538;Sign up for September: go.drcocchiola.com/pppaccelerated-selfstudy2",
      "release": "2025-03-21T12:29:00Z",
      "duration": "00:30:36.1990000",
      "explicit": true,
      "spotifyId": "3fPpCEp3epDjxtKdMGhK1v",
      "appleId": 1000700267099,
      "youTubeId": "UImiW2PXWJE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3fPpCEp3epDjxtKdMGhK1v",
        "apple": "https://podcasts.apple.com/podcast/coercive-control-the-hidden-trauma-of-boys-with-david-weeks/id1704962170?i=1000700267099",
        "youtube": "https://www.youtube.com/watch?v=UImiW2PXWJE"
      }
    },
    {
      "id": "de5a16fc-7aab-4467-af3f-9dad49500ac9",
      "title": "When the Coercive Controller No Longer Has Access to You, They Will Escalate",
      "description": "🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-03-04T13:00:49Z",
      "duration": "00:02:59",
      "explicit": false,
      "youTubeId": "Wu3RTWUSxts",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Wu3RTWUSxts"
      }
    },
    {
      "id": "7417db32-6678-4a5c-b685-1e15e861c993",
      "title": "Children of Coercive Control - Grace",
      "description": "Grace, a survivor of coercive control, grew up with an abusive father and a mother who couldn’t protect her. Now, she shares her story to give a voice to those who can\u0027t speak out. --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-02-21T13:00:00Z",
      "duration": "00:17:28.9040000",
      "explicit": true,
      "spotifyId": "6BRjMKd0rEvTbZ79dBjfSF",
      "appleId": 1000694738261,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6BRjMKd0rEvTbZ79dBjfSF",
        "apple": "https://podcasts.apple.com/podcast/children-of-coercive-control-grace/id1704962170?i=1000694738261"
      }
    },
    {
      "id": "0e69b2c0-17e7-4cdb-aa3c-9818ae33cedb",
      "title": "Dr. Lisa Fontes on Invisible Chains \u0026 Coercive Control",
      "description": "Dr. Christine Cocchiola is joined by Dr. Lisa Fontes, a leading expert on coercive control. Dr. Fontes serves as an expert witness in legal cases involving coercive control and is the author of Invisible Chains, the second book ever written on the topic. In this powerful conversation, she sheds light on the insidious tactics abusers use to manipulate and dominate their victims—often without ever resorting to physical violence. Learn More from Dr. Lisa Fontes: Lisa A. Fontes, PhD is an expert on coercive control, child abuse, and intimate partner violence. A researcher, professor, and expert witness, she has authored Invisible Chains, Interviewing Clients Across Cultures, and Child Abuse and Culture. A Senior Lecturer at UMass Amherst, she has over 30 years of experience in research, psychotherapy, and education. Her work is widely published, with millions of readers on Psychology Today and Domesticshelters.org. She has served as an expert witness in 17 states on trauma, abuse, and child development. \u0026#x1f517; Get Invisible Chains: https://a.co/d/8257LNs \u0026#x1f310; Visit Lisa’s website: https://lisafontes.com --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-02-07T13:00:00Z",
      "duration": "00:24:05.2020000",
      "explicit": true,
      "spotifyId": "1m03FJo9Uk8QL8y0qbVlry",
      "appleId": 1000691215347,
      "youTubeId": "Gu4vQIdMYR8",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1m03FJo9Uk8QL8y0qbVlry",
        "apple": "https://podcasts.apple.com/podcast/dr-lisa-fontes-on-invisible-chains-coercive-control/id1704962170?i=1000691215347",
        "youtube": "https://www.youtube.com/watch?v=Gu4vQIdMYR8"
      }
    },
    {
      "id": "b7072a2f-ad55-4df2-b58d-40a741570b2a",
      "title": "Children of Coercive Control - Ashton Goff",
      "description": "Ashton Goff joins me in this heartbreaking episode to share his experiences as a child growing up in a home with a coercive controller and narcissistic abuser. He recounts being sent to a reunification camp with his abusive father and being separated from his mother for 3.5 years. Tragically, his brother remains in the custody of their abusive father. These stories are not isolated—they reflect the devastating reality faced by children worldwide who are being trafficked by family courts. --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/accelerated2-selfstudy",
      "release": "2025-01-26T05:01:15Z",
      "duration": "00:27:42.8690000",
      "explicit": false,
      "spotifyId": "14TN1nqfZr3CGQhZS5PuuY",
      "appleId": 1000685477820,
      "youTubeId": "e7GRtKxJIVU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/14TN1nqfZr3CGQhZS5PuuY",
        "apple": "https://podcasts.apple.com/podcast/children-of-coercive-control-ashton-goff/id1704962170?i=1000685477820",
        "youtube": "https://www.youtube.com/watch?v=e7GRtKxJIVU"
      }
    },
    {
      "id": "6fe8a268-a6fa-4893-989a-cb0574bc0f2b",
      "title": "Abusers Intensify When Our Children Become Closer to Us",
      "description": "Dr. Cocchiola sheds light on the intense struggles faced by protective parents when their children are manipulated by abusers. She shares a heart-wrenching story of a mother whose child, after a period of reconnected attachment, is now making false accusations under the influence of an abuser. Through this case study, Dr. Cocchiola explores the harmful tactics of abusers, such as intimidation, isolation, and brainwashing, and how they impact a child\u0027s emotional and psychological development. \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/ppp-accelerated",
      "release": "2025-01-10T16:14:00Z",
      "duration": "00:12:05.9950000",
      "explicit": false,
      "spotifyId": "7y9RjMxEbjHx4ubBZxiaZH",
      "appleId": 1000683492894,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7y9RjMxEbjHx4ubBZxiaZH",
        "apple": "https://podcasts.apple.com/podcast/abusers-intensify-when-our-children-become-closer-to-us/id1704962170?i=1000683492894"
      }
    },
    {
      "id": "4a750085-bf30-483a-96b7-68c9ed9f0fc5",
      "title": "How to Navigate Family Court to Protect Your Children with Tina Swithin of One Mom\u0027s Battle",
      "description": "Tina Swithin of One Mom’s Battle joins Dr. C to share insights on engaging family courts to better protect our children. Don\u0027t miss this important discussion! About Tina: Tina Swithin, author of \u0022Divorcing a Narcissist,” creator of Family Court Awareness Month and \u0022One Mom’s Battle,\u0022 is a survivor of a tumultuous custody battle, where she acted as her own attorney and prevailed. Transforming her personal experiences into advocacy, Tina has become one of the leading activists for family court reform. Through her social media platform, Tina brings survivors together for support, legislative change, and other advocacy-related calls-to-action. Website: www.onemomsbattle.com Facebook: www.facebook.com/onemomsbattle Instagram: www.instagram.com/onemomsbattle --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/ppp-accelerated",
      "release": "2024-12-27T18:50:02Z",
      "duration": "00:29:21.7160000",
      "explicit": false,
      "spotifyId": "5kHJE7I6P3aaGBfqVOzi32",
      "appleId": 1000681882115,
      "youTubeId": "5cIm_shy2L4",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kHJE7I6P3aaGBfqVOzi32",
        "apple": "https://podcasts.apple.com/podcast/how-to-navigate-family-court-to-protect-your-children/id1704962170?i=1000681882115",
        "youtube": "https://www.youtube.com/watch?v=5cIm_shy2L4"
      }
    },
    {
      "id": "7825798b-6521-4bdf-a3e0-1057fca6da12",
      "title": "The Abusers Magic A.K.A. \u0022Poison\u0022",
      "description": "When an older or more independent child no longer fulfills the abuser\u0027s needs, they will often shift their focus to another child. This pattern is predictable, and it’s crucial to anticipate it. PREDICT what’s coming, PREPARE for it, and PROTECT yourself and your children effectively. \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/ppp-accelerated",
      "release": "2024-12-13T13:30:00Z",
      "duration": "00:10:24.9600000",
      "explicit": false,
      "spotifyId": "5TqsM8jNCbxZh5AX25bw1J",
      "appleId": 1000680268744,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TqsM8jNCbxZh5AX25bw1J",
        "apple": "https://podcasts.apple.com/podcast/the-abusers-magic-a-k-a-poison/id1704962170?i=1000680268744"
      }
    },
    {
      "id": "51383dd4-12e8-4b5c-825f-11f41b3c9776",
      "title": "Nature and Nurture of Narcissism with Dr. Peter Salerno",
      "description": "Dr. C and Dr. Salerno delve into the nature and nurture of narcissism, exploring strategies to support children growing up in these family systems and help prevent them from adopting these traits. About Dr. Peter: Dr. Peter Salerno, PsyD, LMFT, is a licensed psychotherapist, trauma specialist, and award-winning author. With advanced certifications in Family and Complex Trauma, Psychoanalytic Psychotherapy, and Personality Disorder Treatment, he brings a science-based approach to clinical practice. Dr. Salerno is trained in EMDR and qualified to administer the Hare Psychopathy Checklist-Revised (PCL-R). He has treated mental health conditions across diverse settings, including domestic violence shelters, juvenile detention centers, and private practice. As a consultant to law enforcement, he has guided agencies in identifying and addressing personality disorders. His book, Fit for Off Duty, is required reading at the FBI Academy. Currently, Dr. Salerno works in private practice and has authored six books. Check out: The Nature and Nurture of Narcissism: Understanding Narcissistic Personality Disorder from the Perspective of Gene - Environment Interaction https://www.amazon.com/Nature-Nurture-Narcissism-Understanding-Narcissistic/dp/B0DC565T78 --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/ppp-accelerated",
      "release": "2024-11-29T13:00:00Z",
      "duration": "00:25:39.9340000",
      "explicit": false,
      "spotifyId": "2N6U1AnvURXrykg7E7Y8AF",
      "appleId": 1000678637409,
      "youTubeId": "P2_VzJ_OXgM",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2N6U1AnvURXrykg7E7Y8AF",
        "apple": "https://podcasts.apple.com/podcast/nature-and-nurture-of-narcissism-with-dr-peter-salerno/id1704962170?i=1000678637409",
        "youtube": "https://www.youtube.com/watch?v=P2_VzJ_OXgM"
      }
    },
    {
      "id": "ed0959ce-6863-441c-8145-7b11a6b9e04b",
      "title": "The Lure of our Tweens \u0026 Teens",
      "description": "In this episode of Perfect Prey, we delve into the subtle yet devastating tactics abusers use to lure tweens and teens into alignment, often at the expense of protective parents. We explore how authoritarian styles of parenting evolve into permissive manipulation and discuss strategies for safeguarding children without compromising their trust. \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/ppp-accelerated",
      "release": "2024-11-15T16:45:13Z",
      "duration": "00:13:43.3170000",
      "explicit": false,
      "spotifyId": "1u2vYvjLIaHcD7GPaoH5Qg",
      "appleId": 1000677104868,
      "youTubeId": "7PeUUm4X6jA",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1u2vYvjLIaHcD7GPaoH5Qg",
        "apple": "https://podcasts.apple.com/podcast/the-lure-of-our-tweens-teens/id1704962170?i=1000677104868",
        "youtube": "https://www.youtube.com/watch?v=7PeUUm4X6jA"
      }
    },
    {
      "id": "2b5bcdc2-3374-4ee9-bc8c-86d28e5ae8af",
      "title": "A Conversation on Coercive Control with the Two Dr. C’s",
      "description": "Dr. Andrew Cicchetti a psychotherapist and coercive control advocate and expert comes on the podcast to share his perspective on how predators prey upon their victims - both adults and children. You won\u0027t want to miss this episode full of nuggets! Follow Dr. Andrew Cicchetti: X: https://x.com/andrewcicchett1 Instagram: www.instagram.com/drandrewcicchett Psychology Today: https://www.psychologytoday.com/us/therapists/andrew-thomas-cicchetti-coercive-control-narcissistic-abuse-bronx-ny/317593 --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. Sign up here:https://go.drcocchiola.com/ppp-accelerated \u0026#x1f538;Download VEST2.1K and Repeatables FREE Guide: https://go.drcocchiola.com/vest-free-guide",
      "release": "2024-11-01T12:30:00Z",
      "duration": "00:32:51.0280000",
      "explicit": true,
      "spotifyId": "3PK2FY7CQ5wZWsKvuRrHSy",
      "appleId": 1000675339361,
      "youTubeId": "5TKb_8HbaO8",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PK2FY7CQ5wZWsKvuRrHSy",
        "apple": "https://podcasts.apple.com/podcast/a-conversation-on-coercive-control-with-the-two-dr-cs/id1704962170?i=1000675339361",
        "youtube": "https://www.youtube.com/watch?v=5TKb_8HbaO8"
      }
    },
    {
      "id": "18ecbd08-6442-40fe-beab-f05e1cd27273",
      "title": "The Love You Have for Your Child Fuels the Coercive Controller/Narcissistic Abuser’s Shame",
      "description": "Follow Dr. Christine on social media: \u0026#x1f538;Instagram: ⁠⁠⁠@dr.cocchiola_coercivecontrol⁠⁠⁠ \u0026#x1f538;Facebook: ⁠⁠⁠@dr.cocchiola.coercivecontrol⁠⁠⁠ \u0026#x1f538;Twitter: ⁠⁠⁠@coercivecontrol⁠⁠⁠ \u0026#x1f538;YouTube: ⁠⁠⁠@DrCocchiola⁠⁠⁠ \u0026#x1f538;Website: ⁠⁠⁠https://coercivecontrolconsulting.com⁠⁠⁠ \u0026#x1f538;Book a 15-minute FREE consultation with Dr. Cocchiola: https://l.bttr.to/ekxjM Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/pppacceleratednov24 DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2024-10-21T15:43:00Z",
      "duration": "00:10:54.7380000",
      "explicit": false,
      "spotifyId": "6KS1RZZI0ASNSzShahGPgE",
      "appleId": 1000674348710,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KS1RZZI0ASNSzShahGPgE",
        "apple": "https://podcasts.apple.com/podcast/the-love-you-have-for-your-child-fuels-the/id1704962170?i=1000674348710"
      }
    },
    {
      "id": "9fe381a7-0dca-4dff-9c05-13c0884a0244",
      "title": "Children of Coercive Control - Alexa",
      "description": "\u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/pppwselfstudy",
      "release": "2024-10-04T12:00:00Z",
      "duration": "00:25:39.0050000",
      "explicit": true,
      "spotifyId": "6ctpDk6OtFONkTiqv6miw4",
      "appleId": 1000671776680,
      "youTubeId": "-aDS50f0BcU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ctpDk6OtFONkTiqv6miw4",
        "apple": "https://podcasts.apple.com/podcast/children-of-coercive-control-alexa/id1704962170?i=1000671776680",
        "youtube": "https://www.youtube.com/watch?v=-aDS50f0BcU"
      }
    },
    {
      "id": "91f796a1-88d7-45ce-aee5-7ec1a8b39468",
      "title": "Trauma Bonding with Dr. Nadine Macaluso",
      "description": "Trauma bonding can keep us locked in an abusive relationship. It’s a neurological response to the abuse that creates significant vulnerability. It happens to our children too—they may become bonded to their abuser (your abuser). About Dr. Nadine: Dr. Nadine Macaluso, known to her patients as Dr. Nae, is the real-life inspiration behind Naomi Belfort\u0027s character in \u0022The Wolf of Wall Street.\u0022 She survived a turbulent eight-year marriage to Jordan Belfort, marked by abuse, greed, and trauma. Following her experiences, Dr. Macaluso relocated to California. Her journey of trauma and healing inspired her to return to school at age 39, where she earned her Master\u0027s in counseling and a Ph.D. in somatic psychotherapy. She further specialized with a two-year postdoctoral training in the Neuro-affective Relational Model (NARM). As a therapist, Dr. Macaluso combines her education and personal experiences to help others heal from trauma. Her practice focuses on assisting patients in connecting with their authentic selves, fostering confidence, resilience, and agency. Dr. Macaluso firmly believes in the potential for post-traumatic growth, instilling hope in her patients and guiding them to reach their potential in life and love. --- \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/pppwselfstudy",
      "release": "2024-09-20T13:12:15Z",
      "duration": "00:24:06.8350000",
      "explicit": true,
      "spotifyId": "1pwiBaoCuEdzxzd2lmH7eA",
      "appleId": 1000670175785,
      "youTubeId": "xfR-Tc70vKc",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1pwiBaoCuEdzxzd2lmH7eA",
        "apple": "https://podcasts.apple.com/podcast/trauma-bonding-with-dr-nadine-macaluso/id1704962170?i=1000670175785",
        "youtube": "https://www.youtube.com/watch?v=xfR-Tc70vKc"
      }
    },
    {
      "id": "85f91eb0-a07f-46ed-a01d-81890b367939",
      "title": "Children of Coercive Control - Caitlyn",
      "description": "Caitlyn is my first adult child guest, and she’s here to share her powerful story of growing up in a home with a coercive controller. Her brave escape from the abuser paved the way for her mom to find freedom as well. The strength and resilience of children like Caitlyn inspire hope for us all. \u0026#x1f538;Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol \u0026#x1f538;Visit her website: https://coercivecontrolconsulting.com \u0026#x1f538;Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. Sign up here: https://go.drcocchiola.com/pppwselfstudy",
      "release": "2024-09-04T17:25:02Z",
      "duration": "00:22:18.2070000",
      "explicit": true,
      "spotifyId": "5zKrN2iyp79Yk2GuWY5Lyq",
      "appleId": 1000668375276,
      "youTubeId": "53rfrEVhlsE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5zKrN2iyp79Yk2GuWY5Lyq",
        "apple": "https://podcasts.apple.com/podcast/children-of-coercive-control-caitlyn/id1704962170?i=1000668375276",
        "youtube": "https://www.youtube.com/watch?v=53rfrEVhlsE"
      }
    },
    {
      "id": "9a8d8eef-45ea-4f36-8d93-907d48a16aed",
      "title": "Dr. C Expert in Coercive Control Interviews Amy Polacko Divorce Coach \u0026 Co-Author of the Book FRAMED",
      "description": "Dr. Christine and Amy Polacko expose the disturbing realities within the family court system. In this episode, they discuss their new book FRAMED: Women in the Family Court Underworld which highlights the struggles of mothers facing coercive control and narcissistic abuse. Learn how abusers manipulate the system and why family court often fails to protect victims. Tune in for an eye-opening conversation that aims to inspire change and support those impacted by these injustices. Don’t miss out—SUBSCRIBE to our list to be among the first to receive updates! \u0026#x1f538; Visit: https://narcfreepress.com",
      "release": "2024-07-22T16:00:40Z",
      "duration": "00:27:51.4650000",
      "explicit": false,
      "spotifyId": "6Z2eADzjp2M58X3yNBIDqJ",
      "appleId": 1000663007199,
      "youTubeId": "Ci_J5FIsTpA",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Z2eADzjp2M58X3yNBIDqJ",
        "apple": "https://podcasts.apple.com/podcast/dr-c-expert-in-coercive-control-interviews-amy-polacko/id1704962170?i=1000663007199",
        "youtube": "https://www.youtube.com/watch?v=Ci_J5FIsTpA"
      }
    },
    {
      "id": "af975400-3292-4a8b-b019-b38b62e55897",
      "title": "The Immeasurable Loss: Grieving for Our Abused Children",
      "description": "In this episode, we talk about loss and grief and unpack the magnitude of loss that occurs via a coercive controller/narcissistic abuser and the institutions complicit in the abuser\u0027s game. --- Follow Dr. Christine on social media: \u0026#x1f538;Instagram: ⁠⁠⁠@dr.cocchiola_coercivecontrol⁠⁠⁠ \u0026#x1f538;Facebook: ⁠⁠⁠@dr.cocchiola.coercivecontrol⁠⁠⁠ \u0026#x1f538;Twitter: ⁠⁠⁠@coercivecontrol⁠⁠⁠ \u0026#x1f538;YouTube: ⁠⁠⁠@DrCocchiola⁠⁠⁠ \u0026#x1f538;Website: ⁠⁠⁠https://coercivecontrolconsulting.com⁠⁠⁠ \u0026#x1f538;Book a 15-minute FREE consultation with Dr. Cocchiola: https://coercivecontrolconsultingllc.practicebetter.io/#/652da62e4e6384072a650689/bookings?s=65c7d2817d2b5f5dcd34c6ea\u0026step=date Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/pppwselfstudy DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2024-06-05T03:25:09Z",
      "duration": "00:13:59.6930000",
      "explicit": false,
      "spotifyId": "0u1OZmTSeYMsEny09MJJX4",
      "appleId": 1000657877562,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0u1OZmTSeYMsEny09MJJX4",
        "apple": "https://podcasts.apple.com/podcast/the-immeasurable-loss-grieving-for-our-abused-children/id1704962170?i=1000657877562"
      }
    },
    {
      "id": "78da7904-7667-42ac-b017-a7cb7bcf7acc",
      "title": "Children of Coercive Control by Evan Stark",
      "description": "🔸Follow Dr. Christine on IG: www.instagram.com/dr.cocchiola_coercivecontrol\n\n🔸Visit her website: https://coercivecontrolconsulting.com \n\n🔸Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \n\n🔸Sign up here: https://go.drcocchiola.com/pppwselfstudy",
      "release": "2024-04-05T02:16:58Z",
      "duration": "01:01:11",
      "explicit": false,
      "youTubeId": "Vq-HrUYOW6c",
      "subjects": [
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Vq-HrUYOW6c"
      }
    },
    {
      "id": "c56774b1-0859-4dc4-a470-b474cb14b004",
      "title": "The Grief and Loss are Unacknowledged and Insurmountable",
      "description": "Follow Dr. Christine on social media: \u0026#x1f538;Instagram: ⁠⁠⁠@dr.cocchiola_coercivecontrol⁠⁠⁠ \u0026#x1f538;Facebook: ⁠⁠⁠@dr.cocchiola.coercivecontrol⁠⁠⁠ \u0026#x1f538;Twitter: ⁠⁠⁠@coercivecontrol⁠⁠⁠ \u0026#x1f538;YouTube: ⁠⁠⁠@DrCocchiola⁠⁠⁠ \u0026#x1f538;Website: ⁠⁠⁠https://coercivecontrolconsulting.com⁠⁠⁠ \u0026#x1f538;Book a 15-minute FREE consultation with Dr. Cocchiola: https://coercivecontrolconsultingllc.practicebetter.io/#/652da62e4e6384072a650689/bookings?s=65c7d2817d2b5f5dcd34c6ea\u0026step=date Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. \u0026#x1f538;Sign up here: https://go.drcocchiola.com/pppwselfstudy DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2024-03-13T14:33:21Z",
      "duration": "00:20:36.0740000",
      "explicit": false,
      "spotifyId": "0Okt3qpKFwXCYeUIQHH5pX",
      "appleId": 1000649066788,
      "youTubeId": "5xq2H72CRxo",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Okt3qpKFwXCYeUIQHH5pX",
        "apple": "https://podcasts.apple.com/podcast/the-grief-and-loss-are-unacknowledged-and-insurmountable/id1704962170?i=1000649066788",
        "youtube": "https://www.youtube.com/watch?v=5xq2H72CRxo"
      }
    },
    {
      "id": "d47763f4-2d96-4597-96be-1a579d815af2",
      "title": "The Experiences of Children of Coercive Control: My Testimony for Legislators",
      "description": "Dr. Cocchiola highlights how coercive control in the home can significantly impact a child\u0027s developing brain and emotional wellbeing. Drawing from her experiences in child welfare and as a survivor herself, she emphasizes the importance of providing a safe space for children by preventing them from being forced into interactions with their abusers. --- Follow Dr. Christine on social media: Instagram: ⁠⁠⁠@dr.cocchiola_coercivecontrol⁠⁠⁠ Facebook: ⁠⁠⁠@dr.cocchiola.coercivecontrol⁠⁠⁠ Twitter: ⁠⁠⁠@coercivecontrol⁠⁠⁠ YouTube: ⁠⁠⁠@DrCocchiola⁠⁠⁠ Website: ⁠⁠⁠https://coercivecontrolconsulting.com⁠⁠⁠ Book a 15-minute FREE consultation with Dr. Cocchiola: ⁠https://calendly.com/drcocchiola/15min?month=2023-12⁠ Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. Learn more about The Protective Parenting Program: A Coercive Control Trauma-Informed Parenting Program: https://go.drcocchiola.com/ppp24q2wselfstudy DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2024-03-05T07:58:35Z",
      "duration": "00:16:21.2240000",
      "explicit": false,
      "spotifyId": "0nw9EWdtoPmQAZLEFSWy6d",
      "appleId": 1000648047186,
      "youTubeId": "fPkH4OAm1r4",
      "subjects": [
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nw9EWdtoPmQAZLEFSWy6d",
        "apple": "https://podcasts.apple.com/podcast/the-experiences-of-children-of-coercive/id1704962170?i=1000648047186",
        "youtube": "https://www.youtube.com/watch?v=fPkH4OAm1r4"
      }
    },
    {
      "id": "7a7fb92d-874a-4564-ac37-38aa67dc4157",
      "title": "Fight, Fawn, Flight, and Freeze: Our Children Are Experiencing All of These Trauma Responses",
      "description": "Do you see it? Watch for it and then the patterns will become evident. When the patterns are visible, then we can give them the support they need. --- Follow Dr. Christine on social media: Instagram: ⁠⁠⁠@dr.cocchiola_coercivecontrol⁠⁠⁠ Facebook: ⁠⁠⁠@dr.cocchiola.coercivecontrol⁠⁠⁠ Twitter: ⁠⁠⁠@coercivecontrol⁠⁠⁠ YouTube: ⁠⁠⁠@DrCocchiola⁠⁠⁠ Website: ⁠⁠⁠https://coercivecontrolconsulting.com⁠⁠⁠ Book a 15-minute FREE consultation with Dr. Cocchiola: ⁠https://calendly.com/drcocchiola/15min?month=2023-12⁠ Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. Learn more about The Protective Parenting Program: A Coercive Control Trauma-Informed Parenting Program: https://go.drcocchiola.com/ppp24q2wselfstudy DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2024-02-12T13:00:00Z",
      "duration": "00:18:22.4130000",
      "explicit": false,
      "spotifyId": "1StIdZUJGqkeLPcGRiI9hp",
      "appleId": 1000645040153,
      "youTubeId": "IgYYWsOMHbg",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1StIdZUJGqkeLPcGRiI9hp",
        "apple": "https://podcasts.apple.com/podcast/fight-fawn-flight-and-freeze-our-children-are/id1704962170?i=1000645040153",
        "youtube": "https://www.youtube.com/watch?v=IgYYWsOMHbg"
      }
    },
    {
      "id": "26071daf-68b0-42dd-8be7-76bbc8104f3e",
      "title": "Extinguishing the Fire",
      "description": "The Coercive Controller exerts power over everyone - including our children. His primary focus is to ensure our children feel shame and he kindles that overtly and covertly with them. We need to do whatever we can to extinguish this - shame-reducing responses are so important, yet so challenging when our children trigger our trauma. --- Follow Dr. Christine on social media: Instagram: ⁠⁠⁠@dr.cocchiola_coercivecontrol⁠⁠⁠ Facebook: ⁠⁠⁠@dr.cocchiola.coercivecontrol⁠⁠⁠ Twitter: ⁠⁠⁠@coercivecontrol⁠⁠⁠ YouTube: ⁠⁠⁠@DrCocchiola⁠⁠⁠ Website: ⁠⁠⁠https://coercivecontrolconsulting.com⁠⁠⁠ Book a 15-minute FREE consultation with Dr. Cocchiola: ⁠https://calendly.com/drcocchiola/15min?month=2023-12⁠ Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. Learn more about The Protective Parenting Program: A Coercive Control Trauma-Informed Parenting Program: https://go.drcocchiola.com/ppp24q2wselfstudy DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2024-01-15T12:39:27Z",
      "duration": "00:22:31.2320000",
      "explicit": false,
      "spotifyId": "7A5J4Ltt0njHwYvSY7nstw",
      "appleId": 1000641709955,
      "youTubeId": "OChv3ryIBp0",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7A5J4Ltt0njHwYvSY7nstw",
        "apple": "https://podcasts.apple.com/podcast/extinguishing-the-fire/id1704962170?i=1000641709955",
        "youtube": "https://www.youtube.com/watch?v=OChv3ryIBp0"
      }
    },
    {
      "id": "3b3f1ddd-1e52-4f17-b708-c0c3ca452acb",
      "title": "THE 10,000-Foot View, THE LIST, \u0026 Changing The STORY",
      "description": "What if you could look down on the relationship dynamics with the coercive controller [Narcissistic Abuser]?\n\nWhat has the coercive controller been saying about you you since DAY ONE?\n\nWe need THE LIST so that we can counteract the abusers intentional diminishing of the protective parent and we need to begin to change THE STORY our children believe to be true. \n\n\n\n---\n\n\n\n\n Follow Dr. Christine on social media:\n\n\n\n\n Instagram: ⁠⁠@dr.cocchiola_coercivecontrol⁠⁠\n\n\n\n\n Facebook: ⁠⁠@dr.cocchiola.coercivecontrol⁠⁠\n\n\n\n\n Twitter: ⁠⁠@coercivecontrol⁠⁠\n\n\n\n\n  YouTube: ⁠⁠@DrCocchiola⁠⁠\n\n\n\n\n  Website: ⁠⁠https://coercivecontrolconsulting.com⁠⁠\n\n\n\n\n  Book a 15-minute FREE consultation with Dr. Cocchiola: https://calendly.com/drcocchiola/15min?month=2023-12\n\n\n\n\n  Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. Learn more about The Protective Parenting Program: A Coercive Control Trauma-Informed Parenting Program: https://go.drcocchiola.com/ppp24q1wselfstudy\n\n\n\nDISCLAIMER:\n\nThe podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2023-12-22T15:42:35Z",
      "duration": "00:19:25",
      "explicit": false,
      "spotifyId": "0JVzMz6BQW3xqBKyc7vVhJ",
      "appleId": 1000639460587,
      "youTubeId": "VdfB9h6Fx7M",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0JVzMz6BQW3xqBKyc7vVhJ",
        "apple": "https://podcasts.apple.com/podcast/the-10-000-foot-view-the-list-changing-the-story/id1704962170?i=1000639460587",
        "youtube": "https://www.youtube.com/watch?v=VdfB9h6Fx7M"
      }
    },
    {
      "id": "4962bccf-dc1d-4044-b62a-73e44b490c77",
      "title": "The Threats Are Not Idle",
      "description": "The threats of revenge are all too real: The financial ruin that is often further inflicted through the legal process is overwhelming. It\u0027s all intentional. It\u0027s all planned. --- Follow Dr. Christine on social media: Instagram: ⁠@dr.cocchiola_coercivecontrol⁠ Facebook: ⁠@dr.cocchiola.coercivecontrol⁠ Twitter: ⁠@coercivecontrol⁠ YouTube: ⁠@DrCocchiola⁠ Website: ⁠https://coercivecontrolconsulting.com⁠ The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2023-12-22T05:04:29Z",
      "duration": "00:20:58.3960000",
      "explicit": false,
      "spotifyId": "2KlradXBIjFSG0MkmWOyqw",
      "appleId": 1000633298122,
      "youTubeId": "qMUn9QxbgUc",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2KlradXBIjFSG0MkmWOyqw",
        "apple": "https://podcasts.apple.com/podcast/the-threats-are-not-idle/id1704962170?i=1000633298122",
        "youtube": "https://www.youtube.com/watch?v=qMUn9QxbgUc"
      }
    },
    {
      "id": "b5101304-8935-4f2c-9e35-f64b653255cd",
      "title": "The Emancipation",
      "description": "In this episode Dr. Cocchiola begins to unpack the various ways that coercive controllers inflict their harm. It\u0027s ALL intentional. It\u0027s a course of conduct. A pattern that is often insidious yet cumulative. It\u0027s intimate terrorism. It limits the freedoms of an individual - as Dr. Evan Stark states: \u0022Coercive Control is a liberty crime and we MUST be in the business of EMANCIPATION\u0022. --- Follow Dr. Christine on social media: Instagram: @dr.cocchiola_coercivecontrol Facebook: @dr.cocchiola.coercivecontrol Twitter: @coercivecontrol YouTube: @DrCocchiola Website: https://coercivecontrolconsulting.com The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2023-12-22T05:04:17Z",
      "duration": "00:25:21.1220000",
      "explicit": false,
      "spotifyId": "3bTTJDZ4sAXCBw4xIA2aDx",
      "appleId": 1000630305877,
      "youTubeId": "uDHiWMeamBE",
      "subjects": [
        "Cult Psychology",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3bTTJDZ4sAXCBw4xIA2aDx",
        "apple": "https://podcasts.apple.com/podcast/the-emancipation/id1704962170?i=1000630305877",
        "youtube": "https://www.youtube.com/watch?v=uDHiWMeamBE"
      }
    },
    {
      "id": "caea8817-938f-47ec-b691-60517459bf01",
      "title": "The Who, What, Why, \u0026 How of Coercive Controllers",
      "description": "Their egos so compromised and their goal to compromise the adult victims\u0027 ego and their children’s ego - all to maintain control. Our children particularly vulnerable. Who are these individuals? What is it that they are doing? How do they become individuals so readily willing to intentionally harm? Why do they abuse? --- Follow Dr. Christine on social media: Instagram: @dr.cocchiola_coercivecontrol Facebook: @dr.cocchiola.coercivecontrol Twitter: @coercivecontrol YouTube: @DrCocchiola Website: https://coercivecontrolconsulting.com The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2023-12-22T05:04:02Z",
      "duration": "00:36:40.4500000",
      "explicit": false,
      "spotifyId": "2eKV4hAt0UJ3UOesPgOe2W",
      "appleId": 1000627473619,
      "youTubeId": "4GM6_6ZznUs",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2eKV4hAt0UJ3UOesPgOe2W",
        "apple": "https://podcasts.apple.com/podcast/the-who-what-why-how-of-coercive-controllers/id1704962170?i=1000627473619",
        "youtube": "https://www.youtube.com/watch?v=4GM6_6ZznUs"
      }
    },
    {
      "id": "6b0f8a6d-5fc7-4c04-944c-7e730d2733d5",
      "title": "Understanding Coercive Control and Its Impact on Children",
      "description": "Dr. Cocchiola defines coercive control, highlighting its impact on children beyond physical abuse. She emphasizes its role in domestic and child abuse, often concealed from authorities. Addressing children\u0027s vulnerability as \u0022Perfect Prey,\u0022 she stresses the vital support protective parents offer to those exposed to coercive control. Follow Dr. Christine on social media: Instagram: @dr.cocchiola_coercivecontrol Facebook: @dr.cocchiola.coercivecontrol Twitter: @coercivecontrol YouTube: @DrCocchiola Website: https://coercivecontrolconsulting.com The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast.",
      "release": "2023-12-22T05:03:43Z",
      "duration": "00:19:47.8750000",
      "explicit": false,
      "spotifyId": "7ouDvQetNA6jPHpzANch5U",
      "appleId": 1000626165612,
      "youTubeId": "IgMFhwg7els",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7ouDvQetNA6jPHpzANch5U",
        "apple": "https://podcasts.apple.com/podcast/understanding-coercive-control-and-its-impact-on-children/id1704962170?i=1000626165612",
        "youtube": "https://www.youtube.com/watch?v=IgMFhwg7els"
      }
    },
    {
      "id": "feb48b0f-7f60-478b-9123-2a4e79b93280",
      "title": "Compliance Is An Act of Survival",
      "description": "This episode begins to outline the steps of derailing the coercive controller\u0027s plan and gives us the perspective of this abusive parent. For our children, Compliance is an Act of Survival. DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast. Follow Dr. Christine on social media: FACEBOOK: https://www.facebook.com/dr.cocchiola.coercivecontrol INSTAGRAM: https://www.instagram.com/dr.cocchiola_coercivecontrol THREADS: https://www.threads.net/@dr.cocchiola_coercivecontrol TWITTER (X): https://twitter.com/coercivecontrol WEBSITE: https://coercivecontrolconsulting.com Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. The Protective Parenting Program: A Coercive Control Trauma-Informed Parenting Program: https://go.drcocchiola.com/ppp24q1wselfstudy",
      "release": "2023-12-04T15:52:00Z",
      "duration": "00:23:50.6260000",
      "explicit": false,
      "spotifyId": "6ZqAIA48kcbgryuOY8bozk",
      "appleId": 1000637449745,
      "youTubeId": "vvhjJV7tfHs",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ZqAIA48kcbgryuOY8bozk",
        "apple": "https://podcasts.apple.com/podcast/compliance-is-an-act-of-survival/id1704962170?i=1000637449745",
        "youtube": "https://www.youtube.com/watch?v=vvhjJV7tfHs"
      }
    },
    {
      "id": "251e311e-16b2-449d-9602-60273c10b749",
      "title": "The Antithesis of the Light Triad",
      "description": "Kantianism comes from the philosopher Immanuel Kant: \u0022the idea that we have a moral duty to act in a good way - whether it benefits us or not. People are ends unto themselves and not pawns in someone else’s games\u0022 - unless of course, we are dealing with a coercive controller [narcissistic abuser]. Then everyone is fair game - especially our children. In this in-depth episode, Dr. Cocchiola explores how individuals, often narcissistic abusers or coercive controllers, prey on empathetic and loyal individuals. She then expands this concept to children who may be more susceptible to this form of manipulation due to the power dynamics with parents or guardians. She emphasizes the importance of understanding these manipulations and the dangers they pose within families. Dr. Cocchiola examines the coercive controller\u0027s tactics, from manipulating children and weaponizing them against the protective parent to using children to fill their ego tanks. She also discusses the damage this form of abuse causes, defining it as betrayal trauma and complex trauma, and echoes a strong need for recognition and intervention. DISCLAIMER: The podcast must not replace medical or mental health guidance. It\u0027s recommended that individuals consult a healthcare professional for independent medical advice, counseling, or therapy regarding any medical or mental health concerns, including topics covered in the podcast. Follow Dr. Christine on social media: FACEBOOK: https://www.facebook.com/dr.cocchiola.coercivecontrol INSTAGRAM: https://www.instagram.com/dr.cocchiola_coercivecontrol THREADS: https://www.threads.net/@dr.cocchiola_coercivecontrol TWITTER (X): https://twitter.com/coercivecontrol WEBSITE: https://coercivecontrolconsulting.com Become a Certified Trauma-Informed Protective Parent in this intensive educational program with an option for LIVE coaching/support to guide protective parents as they navigate the stormy seas of parenting a child who has been coercively controlled. The Protective Parenting Program: A Coercive Control Trauma-Informed Parenting Program: https://go.drcocchiola.com/ppp24q1wselfstudy",
      "release": "2023-11-16T15:48:02Z",
      "duration": "00:20:59.2370000",
      "explicit": false,
      "spotifyId": "7qaHS69Ck6gpSZlBsPhGlD",
      "appleId": 1000635065630,
      "youTubeId": "ISi_Gg92PzU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qaHS69Ck6gpSZlBsPhGlD",
        "apple": "https://podcasts.apple.com/podcast/the-antithesis-of-the-light-triad/id1704962170?i=1000635065630",
        "youtube": "https://www.youtube.com/watch?v=ISi_Gg92PzU"
      }
    }
  ]
}