{
  "id": "66129e4b-9cd8-43ab-9ebc-d7c0596277c1",
  "name": "Dr. Greg",
  "youTubeChannelId": "UCfiO5z8oM4BBXQ6dVsMu8vQ",
  "episodes": [
    {
      "id": "e093a494-fc54-4f03-a2d8-30cbc8bd9484",
      "title": "Is MAGA a cult?",
      "description": "Is MAGA a movement — or a mindset? \nIn this episode of Off the Couch with Dr. Greg, psychologist Dr. Greg Cason takes a deep dive into the psychology of political devotion. We’re not talking about politics — we’re talking about how belief becomes identity. \nFrom blind loyalty to charismatic leadership, we’ll explore what happens when political passion crosses the line into psychological captivity. \nWhat makes some movements mirror cult dynamics? Why do intelligent, well-meaning people surrender critical thinking for belonging and certainty? And most importantly — could any of us be doing the same thing without realizing it? \nYou’ll learn: \nThe 6 classic traits that define cult-like dynamics \nWhy belonging feels safer than questioning \nHow cognitive dissonance keeps followers loyal \nWhy outrage feels addictive — and how to break free \n\nThis episode isn’t about sides — it’s about psychology, power, and the human need to believe. \nWhether it’s MAGA, QAnon, or any cause that replaces thought with faith, the danger isn’t the cause — it’s the captivity of the mind. \nFreedom starts when you can ask your own questions again. \nShape \n💬 Join the Conversation \nWhat do you think — is MAGA a cult, a movement, or something in between? \nComment below — your insights might appear in a future episode.\n\n#OffTheCouchWithDrGreg #PoliticalPsychology #MAGA #CultPsychology #Groupthink #MindOfAmerica #CultsAndBelief #PsychologyPodcast #IdentityPolitics #QAnon #CognitiveDissonance #SocialPsychology #PoliticalTribes #CriticalThinking #PsychologyOfBelief \n \nHandout: https://adobe.ly/4a3oNh8 \n \nFilm: Kumare: A True Film About a False Prophet https://bit.ly/FilmaboutFalseProphet \n  \nBook: The Cult of Trump: A Leading Cult Expert Explains How the President Uses Mind Control by Steven Hassan https://bit.ly/CultofTrumpBook \n  \nArticles: \nThe Personality of Trump’s ‘Personality Cult’ https://bit.ly/DonaldTrumpspersonalitycult \n  \n--Related academic paper in Political Psychology journal https://bit.ly/PoliticalPsychologyJournal \n \nSeeking Evidence of the MAGA Cult and Trump Derangement Syndrome: An Examination of (A)symmetric Political Bias https://bit.ly/EvidenceofTheMAGACult \n \nTrump’s Personality Cult Plays a Part in His Political Appeal https://bit.ly/CultPlaysaPartinHisPoliticalAppeal \n \nExplaining the Trump Loyalty Phenomenon https://bit.ly/TrumpLoyaltyPhenomenon \n \nThe Beginning of the End of MAGA https://bit.ly/48ikDAS \n  \nWhat Makes a Cult Leader https://bit.ly/WhatMakesaCultLeader \n \nSigns You Are in a Cult https://bit.ly/SignsYouAreInaCult \n \nThink Twice Before Saying ‘Cult’ https://bit.ly/Thinktwicebeforesayingcult \n \nPolitical Cults as a New Phenomenon of Religious Studies https://bit.ly/PoliticalCults \n \nThe Intersection of Religion, Politics, and Cult-like Behavior https://bit.ly/IntersectionofReligion \n \nCharismatic Research and Vulnerability: A Comprehensive Study of Cult Dynamics https://bit.ly/CultDynamics \n \nIf you or someone you know is struggling or in crisis, help is available. Call or text 988 or chat 988lifeline.org.",
      "release": "2025-11-17T15:28:20Z",
      "duration": "00:58:02",
      "explicit": false,
      "youTubeId": "F1YcBB6Z3Lk",
      "subjects": [
        "Qanon",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F1YcBB6Z3Lk"
      }
    }
  ]
}