{
  "id": "8d2b8f96-3b5b-4649-a301-695dd29c4cac",
  "name": "Drama, Darling: A Real Housewives Comedy Podcast",
  "spotifyId": "6s0JSecrW1Yd2Q4bkFnqfs",
  "appleId": 1684156555,
  "episodes": [
    {
      "id": "a034ec63-5bf0-4c56-9e6c-729091086a36",
      "title": "Darling, Bish Hour: The Cult of the Real Housewife",
      "description": "Happy New Year! In the first Darling, Bish Hour of 2026 Melissa and Amy delve into the documentary about Mary Cosby, exploring the manipulative tactics used by cults, within Mary’s church, the generational trauma that influences her behavior, and the psychological profile of a would-be cult leader. Newly revealed audio is released, revealing new dimensions to Mary \u0026 Robert Cosby and Faith Temple Pentecostal Church. Melissa and Amy discuss the impact of the Enoch family and Cameron Williams’ story, the financial exploitation within cults, and the isolation tactics used by leaders to maintain control. The conversation raises important questions about accountability and the future of Mary Cosby on reality TV, emphasizing the need for individuals to listen to themselves and seek freedom from manipulative environments.We hope you enjoy the episode. THANK YOU FOR LISTENING and for all the support!\n\nDisclaimer: Posts are not intended to diagnose, treat or provide medical advice. Your Bish Therapist (YBT) is for entertainment and informational purposes only. The podcast, my opinions, and posts, are my own and are not associated with past or present employers, any organizations, Bravo TV, Grey Heart productions or any other television network. The information in YBT podcast and on its social media is provided for general informational purposes only and is not intended to diagnose or treat. Please do not act or refrain from acting based on anything you read, see, or hear on YBT, podcast or associated social media. Communicating with YBT via email, and/or social media does not form a therapeutic alliance. Melissa, operator of YBT, is unable to provide any therapeutic advice, treatment or feedback.\n\nFor more Drama, Darling, and exclusive content, subscribe to: http://Patreon.com/dramadarling \nFollow Drama, Darling on Instagram: https://www.instagram.com/dramadarlingshow/   Email Drama, Darling with YOUR comments, questions and drama:  DramaDarlingz@gmail.com \nFollow Amy Phillips on Instagram: https://www.instagram.com/dramadarlingshow/   \nMERCH Drama Darling Shop https://drama-darling-shop.printify.me/",
      "release": "2026-01-07T19:00:08Z",
      "duration": "01:12:49",
      "explicit": false,
      "spotifyId": "6wnanfhpu9X8BYdsA3A6MR",
      "appleId": 1000744170753,
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6wnanfhpu9X8BYdsA3A6MR",
        "apple": "https://podcasts.apple.com/podcast/darling-bish-hour-the-cult-of-the-real-housewife/id1684156555?i=1000744170753"
      }
    }
  ]
}