{
  "id": "67ab308b-0147-40e6-9018-c80918848fc1",
  "name": "Drew Deraney",
  "youTubeChannelId": "UCtwMTiiZvnhTpsaCYMK6oqg",
  "episodes": [
    {
      "id": "28b599e1-a7ae-4bc9-8cbf-2f2710ffc515",
      "title": "Episode 59 - Dr Robyn Odegaard - I Grew Up in a Cult and Three Weeks After I Graduated...",
      "description": "This episode: I grew up in a cult and three weeks after I graduated from high school, I was married off to my first cousin. \n\nHere’s what you’ll learn about:\nOvercoming adversity and finding resilience. (0:33)\nNarcissistic abuse and personal growth. (3:45)\nStarting a business and finding clients after a divorce. (5:57)\nRebuilding a business after loss and finding new opportunities. (7:53)\nResilience, mindset, and personal growth. (9:23)\nBusiness and personal connections. (12:46)\nBusiness, leadership, and personal growth with Dr. Robyn. (16:46)\nEntrepreneurship, imposter syndrome, and personal growth. (20:10)\n\nDr. Robyn Odegard shares her advice for young entrepreneurs, including the importance of being brave and not worrying about not knowing everything.\n \nTo learn more about Dr. Robyn, go to LinkedIn at https://www.linkedin.com/in/robynodegaard/\n\nor you can go to Dr. Robyn’s website at https://drrobynodegaard.com/\n\nDr. Robyn Odegaard Bio: I’m Dr Robyn. I am a former competitive beach volleyball player with a doctorate in high-performance business psychology. If I worked for the mob, I would be the consigliere. Think Dr Jennifer Melfi on The Sopranos.  \n\nMy clients are mostly men around 40. That is about the time they realize they are not invincible. They are the face of their brand. Successful. High energy. Fast paced. Intensely private. They have quick minds and can think through and accept or reject solutions rapidly. \n\nMy clients know that having someone to talk to makes them smarter and lets them make better decisions faster. \n\nSome of them have tried therapy and realized, for them, being asked, “How does that make you feel?” is not particularly helpful.\n\nI am affectionately known as Mental MacGyver because my expertise is in real-life complexities. I know how to ask the tough questions to drive creative and resourceful solutions using whatever knowledge, tools, ingenuity and abilities are available. \n\nI am able to keep up, understand and keep track of all the moving parts in my clients’ lives, both personal and professional. \n\nWe can pivot quickly to develop innovative and if necessary, improvised ways to bridge gaps so you can keep moving forward while we work towards permanent solutions.  \n\nEach of my clients gets an individual ringtone in my phone and when you work with me no topic is off limits. There is no such thing as TMI.\n\nI have real-world, peak-performance experience; a top-notch formal education and I have been changing the lives and businesses of high-profile leaders for over 15 years.",
      "release": "2024-12-16T05:19:43Z",
      "duration": "00:32:47",
      "explicit": false,
      "youTubeId": "5W_b83XvIO4",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5W_b83XvIO4"
      }
    }
  ]
}