{
  "_ts": 0,
  "id": "43da4285-42fc-4b91-897a-499764dcd2d3",
  "name": "Drinking With Gin",
  "spotifyId": "0UVRo0EOi8bk4Omtb6qWHJ",
  "appleId": 1642612019,
  "youTubeChannelId": "UCGyzQcBdoL1GoLaBCkE9Bag",
  "episodes": [
    {
      "id": "bcdb7b63-f16a-4ead-b507-c508aa0e7837",
      "title": "Therapist Vanessa Reiser Educates On Narcissists \u0026 Cult Leaders ",
      "description": "As a psychotherapist, Vanessa has extensive experience with narcissism based on her own encounter with a narcissist in her personal life and so she offers not just the clinical perspective, but an extreme and very exclusive story of abuse. She has developed a coaching program based on her own experience and what helped her to recover from her psychological trauma after fleeing from her narcissist in the middle of the night. Her practice works to educate you on narcissism and what/who you are actually dealing with; Narcissism is categorized as a personality disorder by the mental health profession and is referred to as NPD or Narcissistic Personality Disorder, but it is FAR bigger than what is stated clinically in the DSM-V and few people are diagnosed because few people go to therapy. Vanessa ran across the state of New York in a wedding dress to raise awareness about narcissistic abuse. In this episode, she shares her unique perspective on narcissism and cults, the brain damage caused by narcissistic abuse \u0026 trauma and actionable tips for survivors. Connect with Vanessa: Visit her WEBSITE Follow her on INSTAGRAM Order her BOOK Find a THERAPIST We LOVE collecting 5 stars -- Don\u0027t forget to follow, leave a review or rating and share Drinking With Gin. \u0026#x1f31f;\u0026#x1f31f;\u0026#x1f31f;\u0026#x1f31f;\u0026#x1f31f; And share your favorite episode with a friend! Special thanks to our sponsors: ine\u0026#43; nutrition: Head to ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠www.inenutrition.com⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ and use discount code GIN10 at checkout to receive 10% off your order today! *Discount code does not apply to sample packs or stacking to a subscription purchase. Xtressé: Head to ⁠www.Xtresse.com⁠ to learn more. Ready to get started today? Visit ⁠www.germaindermatology.com⁠ and use code GIN20 at checkout to receive 20% off your order! Sajic Skin Science: Use code GIN20 at ⁠www.sajicskin.com⁠ to receive 20% off Rejuvenat today! *Offer valid for US and Canada residents. Connect with Ginny: ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠Follow Ginny on INSTAGRAM⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠BOOK⁠⁠⁠⁠⁠⁠⁠⁠ Ginny for Speaking⁠ ⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠⁠SUBSCRIBE⁠⁠⁠⁠⁠⁠⁠⁠⁠ to Ginny\u0027s free newsletter⁠ ⁠⁠⁠Watch the episodes on YOUTUBE",
      "release": "2025-01-08T06:00:00Z",
      "duration": "00:53:02.1580000",
      "explicit": true,
      "spotifyId": "3ZmvFOO2exlMFMX4jVrBtE",
      "appleId": 1000683129100,
      "youTubeId": "Lb3FYT9J0G0",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ZmvFOO2exlMFMX4jVrBtE",
        "apple": "https://podcasts.apple.com/podcast/therapist-vanessa-reiser-educates-on-narcissists-cult/id1642612019?i=1000683129100",
        "youtube": "https://www.youtube.com/watch?v=Lb3FYT9J0G0"
      }
    }
  ]
}