{
  "_ts": 0,
  "id": "70c6aa60-6c2c-49c1-8b59-659ec990ce82",
  "name": "Duped: The Dark Side of Online Business",
  "spotifyId": "0j6Neks4a3lD8lsnUO7gqR",
  "appleId": 1562877811,
  "episodes": [
    {
      "id": "4eeca9fd-7852-4f71-a384-d9b715af201d",
      "title": "Hoodwinked: How Cult Marketing Took Over Your Feed with Dr. Mara Einstein",
      "description": "What do MLMs, cults, and online coaches have in common? A whole lot of manipulation. In this episode of Duped, we sit down with author and marketing critic Dr. Mara Einstein to unpack how cult tactics are being repackaged as “business strategy” in the online world. From collapsed marketing funnels to parasocial influencers and toxic coaching circles, we dig into the psychology behind it all. If you’ve ever felt duped by an online guru or pressured by hustle culture, this one’s for you. Topics discussed in this episode: Why Mara wrote Hoodwinked and how cult tactics show up in modern marketing The rise of “cult-lite” influencers and parasocial trust. What the “anxiety economy” is—and how it keeps us scrolling (and spending). How collapsing the marketing funnel impacts critical thinking and buyer behavior. Are algorithms today’s cult leaders?. Spotting psychological traps like truth bias and the illusory truth effect. Why the coaching industry—especially for women—can be uniquely harmful. What the future of ethical business might look like in toxic online spaces. Mara’s advice for anyone caught in a digital cult or shady coaching ecosystem. For detailed show notes and links to everything mentioned in this episode, please visit duped.online. For more Duped, including monthly bonus episodes, join the Patreon.",
      "release": "2025-05-19T05:00:00Z",
      "duration": "00:54:41.1100000",
      "explicit": true,
      "spotifyId": "3TGAlKIs9qTTv29CE3iejY",
      "appleId": 1000708950987,
      "subjects": [
        "Multi-Level Marketing",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3TGAlKIs9qTTv29CE3iejY",
        "apple": "https://podcasts.apple.com/podcast/hoodwinked-how-cult-marketing-took-over-your-feed-with/id1562877811?i=1000708950987"
      }
    },
    {
      "id": "0617a316-eea8-4c01-81fe-59667ba20241",
      "title": "Manipulating Minds: The Need to Know About NLP",
      "description": "Have you heard of something called neurolinguistic programming or NLP? It’s everywhere in online business, but no one seems to be able to explain what it is or why we use it.  In this episode, we tackle everything from its controversial history to its widespread online influence to answer the question: are you being manipulated by NLP? And would you even know if you were? For detailed show notes and links to everything mentioned in this episode, please visit duped.online. For more Duped, including monthly bonus episodes, join the Patreon. ",
      "release": "2024-01-08T06:00:00Z",
      "duration": "00:46:31.7840000",
      "explicit": false,
      "spotifyId": "10aRSp4k5Tcs9LY7WCYsJG",
      "appleId": 1000640867711,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/10aRSp4k5Tcs9LY7WCYsJG",
        "apple": "https://podcasts.apple.com/podcast/manipulating-minds-the-need-to-know-about-nlp/id1562877811?i=1000640867711"
      }
    }
  ]
}