{
  "_ts": 0,
  "id": "78d69066-644a-41f3-bafd-1fca1b2ee9d9",
  "name": "DW Documentary",
  "youTubeChannelId": "UCW39zufHfsuGgpLviKh297Q",
  "episodes": [
    {
      "id": "0a27b356-cf1e-4da4-a008-6bcd5e5d16a9",
      "title": "Leaving a cult behind - Can brainwashing be reversed? | DW Documentary",
      "description": "Breaking free from the clutches of a cult or a cultish religious movement is a long and painful process. So far, it’s one that has largely gone undocumented. Few people talk about the years of struggle -- and relapses - breaking free entails. Five people who have gone through the process talk about their experiences.\n\nThis documentary about leaving cultish religious movements behind illustrates how powerful the conditioning is -- and how deeply dependent it makes its victims. How is it possible to renounce one\u0027s own identity and \u0022reprogram” the brain?\n\nNicolas has been exposed to this influence since birth: his parents are Jehovah\u0027s Witnesses. At the age of 22, he managed to break away from the Jehovah\u0027s Witnesses - but he had to cut off contact with his family. \n\nJulie was 31 and Yohann 20 when they both fell into the clutches of the French \u0022Université de la relation” movement during what purported to be an ‘internship in the field of personal development’.\n\nDavid and François became \u0022warriors of light” after they trained in kung fu at the Parc de la Villette in Paris -- and stuck with it for 10 years. They describe insidious manipulation and talk about how they were completely sucked into a parallel world.\n\nThe film’s moving accounts of cult dropouts and their long journeys back to a normal life are supplemented by insights into the work of a French police unit specializing in new religious movements.\n\n#documentary #dwdocumentary \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
      "release": "2024-08-29T16:00:44Z",
      "duration": "00:42:31",
      "explicit": false,
      "youTubeId": "hb5Yq5jJClo",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery",
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hb5Yq5jJClo"
      }
    },
    {
      "id": "433b19d6-2c4a-4285-90d1-01af236ed87c",
      "title": "Faith, power, manipulation - The secrets of the Opus Dei sect | DW Documentary",
      "description": "For many critics, the arch-conservative Catholic community Opus Dei is a diabolical sect. However, Opus Dei (which translates to \u0022Work of God”) sees itself in a very positive light. Even today, it’s very difficult to look into the inner world of the sect.\n\nThat\u0027s because its 90,000 members worldwide have taken a vow of secrecy - and those who have left report persecution if they break that vow. Meanwhile, Opus Dei is working to become the most influential player in the Catholic Church. To this end, it maintains a secret network - including branches in Germany. \n\nIt is no coincidence that the German headquarters are located in Cologne - Germany‘s most powerful Catholic archdiocese. In Germany, Opus Dei is focused on trying to gain a foothold in the field of education, by running daycare centers and schools.\n\nThe examination of a daycare center in Munich shows that Opus Dei deliberately conceals its involvement in these institutions. Another component of the network is IESE, the business school of Opus Dei, which also has an offshoot in Germany. It is considered one of the best schools of its kind in the world.\n\nIn Spain, where Opus Dei originated, sect members are active in parts of the judicial and educational sectors. The documentary tries to uncover these connections in both Spain and Germany, and lets both victims and experts have their say. It also includes an interview with the head of Opus Dei, Christoph Bockamp.\n\nFor the first time, a former member from Germany reports on her ordeal in Opus Dei and the harassment she experienced after she broke away from the sect. Spaniard Carmen Charo developed mental health problems during her time in Opus Dei, due to brainwashing and psychological pressure. Today, she helps others in their journey out of Opus Dei.\n\nDietmar Scharmitzer is trying to do the same thing with German-speaking people who want to leave, and runs an Internet platform to help inform them. Finally, Marco Politi, an author and Vatican expert from Rome, takes stock of the influence Opus Dei has exerted since the time of Pope John Paul II.\n\n#documentary #dwdocumentary \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
      "release": "2022-06-30T16:00:08Z",
      "duration": "00:42:26",
      "explicit": false,
      "youTubeId": "6Zi4hp8hJRM",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6Zi4hp8hJRM"
      }
    }
  ]
}