{
  "id": "3a8b71b0-b142-406c-87ac-98488da60933",
  "name": "DW News",
  "youTubeChannelId": "UCknLrEdhRCp1aegoMqRaCZg",
  "episodes": [
    {
      "id": "e5190ad1-2f64-4769-81d5-5a27ab73033c",
      "title": "Will the public ever see the unredacted Epstein files and names of potential pepertrators? | DW News",
      "description": "US Attorney General Pam Bondi passionately defended US President Donald Trump and the US Justice Department\u0027s handling of the Epstein files during a heated four-hour long congressional hearing. Bondi deflected lawmakers questions about the DOJ\u0027s investigation into the crimes committed by the late sex offender and his long list of alleged high profile friends and accomplices, many of whom are redacted in the documents. Sensitive private information about several of Epstein\u0027s victims  was NOT blacked out. Some of the victims were present at the hearing, and at one point were asked if their evidence had been included in the ongoing investigation.\n\nDr Mark Shanahan, an Associate Professor of Political Engagement at the University of Surrey in the UK, talks to DW. \n\n#epsteinfiles #trump #pambondi \nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1",
      "release": "2026-02-12T20:30:08Z",
      "duration": "00:07:45",
      "explicit": false,
      "youTubeId": "XLldDgfU7Iw",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XLldDgfU7Iw"
      }
    },
    {
      "id": "2ffadae3-a40b-4d61-844b-0e3318aca2b7",
      "title": "Democracts accuse Bondi of Epstein file \u0027cover-up\u0027 | DW News",
      "description": "U.S. Attorney General Pam Bondi clashed with lawmakers while testifying about the Epstein files in Congress. \nThere were heated scenes as Democrats questioned Bondi about how the Justice Department handled the files. Some accused her of engaging in a \u0022cover-up\u0022 and of ignoring victims of the deceased sex offender, Jeffrey Epstein. Bondi defended the department, accusing Democrats of using the Epstein files to distract from Trump\u0027s successes.\n\nChapters:\n0:00 Fiery hearing in US Congress over Epstein files\n0:29 Sandra Navidi, Lawyer\n\nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1",
      "release": "2026-02-12T01:15:04Z",
      "duration": "00:03:45",
      "explicit": false,
      "youTubeId": "LcUN4Trv7qw",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LcUN4Trv7qw"
      }
    },
    {
      "id": "a910d35a-07c6-4fe6-9dcc-4913c4d1d016",
      "title": "Was Jeffrey Epstein trying to blackmail people for Russia using compromising material? | DW News",
      "description": "Last Friday, US authorities released another batch of files related to Jeffrey Epstein. Epstein, if you need reminding, was a convicted sex offender. He died in a New York prison in 2019 while awaiting another trial for running a sex trafficking operation involving underage girls. The latest release – made up of more than 3 million documents, images, and videos – gives new insights into Epstein\u0027s ties to the rich and powerful. \n\nIt is also fueling speculation that Epstein could have been working for Russia. The suspicion is that Epstein would lure his powerful connections into sexual encounters, which were then used for the purposes of blackmail.\n\nThis tactic is synonymous with Russian intelligence, who have their very own name for this compromising material: \u0027kompromat\u0027. At least one European leader appears to be taking the potential Russian connection very seriously – Polish prime minister Donald Tusk. He has ordered a probe into whether Epstein\u0027s activities were directed by the Kremlin. \n\n00:00 Jeffrey Epstein linked to Russia?\n02:00 Bartosz Wielinski, Deputy Editor-in-Chief, Gazeta Wyborcza\n\nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1\n\n#russia #jeffreyepstein #epsteinfiles",
      "release": "2026-02-05T02:00:03Z",
      "duration": "00:10:29",
      "explicit": false,
      "youTubeId": "4FfDCukxfxM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4FfDCukxfxM"
      }
    },
    {
      "id": "86cedef0-f2f6-4f9e-820d-50a246cbefe1",
      "title": "What\u0027s behind Donald Trump\u0027s latest comments on the Epstein Scandal? | DW News",
      "description": "US President Donald Trump has made a plea for Americans to move on from the Jeffrey Epstein scandal. Trump had spent months trying to block the disclosure of millions of files linked to the late sex offender Epstein, before relenting late last year. He now says the latest release of documents and photos has cleared him of any wrongdoing.\n\nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1",
      "release": "2026-02-04T08:45:58Z",
      "duration": "00:07:01",
      "explicit": false,
      "youTubeId": "8t21WScegrs",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8t21WScegrs"
      }
    },
    {
      "id": "91d717b4-a211-47d1-aec6-562f55aff7e1",
      "title": "Epstein files: What\u0027s behind the investigations into disgraced UK envoy Mandelson? | DW News",
      "description": "Peter Mandelson, a former heavyweight of the UK political scene, is stepping down from his position in the House of Lords in light of new revelations in the Epstein files, the speaker of the house announced on Tuesday. Mandelson\u0027s connection to disgraced financier Jeffrey Epstein was already known about, but newly released files showed that the Labour Party politician had sent emails to the deceased sex offender offering nuggets of information, and in doing so may have broken the law. A spokesperson for Labour Prime Minister Keir Starmer said the emails sent to Epstein contained \u0022likely market-sensitive information.\u0022\n\nUK police are looking into whether Mandelson could face a criminal investigation. That investigation was announced on Monday, a day after Mandelson also quit the Labour Party. Starmer\u0027s spokesperson on Tuesday said the prime minister told his Cabinet that his government would cooperate with the police in any inquiries, and also said he was not reassured that all pertinent information had yet emerged.\n\nWhat are the new revelations about Peter Mandelson?\nThe new Epstein file release — more than 3 million pages of documents related to the US Justice Department\u0027s case — shows how Mandelson passed on sensitive information around the time of the 2008 financial crisis. In one case, the then business secretary in the UK government sent Epstein an internal government report that was looking at how the country could raise money following the crash, including suggesting the sell-off of government assets. In May 2010, he sent another message that \u0022sources tell me 500 b euro bailout\u0022 is almost complete. It came just hours before European governments announced a €500 billion deal in an attempt to protect the euro.\n\nWho is Peter Mandelson? \nMandelson, 72, has been a fairly prominent figure in British politics since the early 1990s, when he first took a seat in the House of Commons. He was particularly known for his skills as a strategist and fixer, working as the Labour Party\u0027s director of communications even before he took elected office. Mandelson served in various ministerial roles in the governments of Labour Prime Ministers Tony Blair and Gordon Brown, including Business Secretary and the organizational role of First Secretary of State that is often compared to the role of deputy prime minister, with neither of those positions permanently filled. He\u0027s been no stranger to scandal or to resignation in the past, resigning from Tony Blair\u0027s Cabinet in 1998 over an undisclosed loan for a home from a party ally with links to a media mogul. In 2001, he had to resign once more, this time over allegations of seeking to improperly influence a passport application. Mandelson had a stint in Brussels as European Commissioner for Trade from 2004 to 2008, in between roles in British governments. Most recently, he returned as Ambassador to the United States under the latest Labour prime minister, Keir Starmer. He was dismissed from this role late last year as his ties to Epstein began to come to light. Kemi Badenoch, the leader of the opposition Conservative Party, wrote on social media that the speed of Mandelson\u0027s latest downfall raised questions about Starmer\u0027s decision to bring him back into a prominent position as US ambassador last year.\n\n#Epstein #EpsteinFiles #PeterMandelson\nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1",
      "release": "2026-02-04T07:57:29Z",
      "duration": "00:04:22",
      "explicit": false,
      "youTubeId": "FlGQ59Gvrbo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FlGQ59Gvrbo"
      }
    },
    {
      "id": "3ff53053-64c7-4585-97a0-c79258754c53",
      "title": "Lawyer: Partial Epstein files disclosure fuels speculation that DOJ \u0027is trying to protect somebody\u0027",
      "description": "The US Justice Department has released a trove of documents related to the prosecution of convicted sex offender Jeffrey Epstein. US Representatives Ro Khanna (Democrat) and Thomas Massie (Republican) have been pressing for the release of the documents in accordance with the \u0022Epstein Files Transparency Act,\u0022 and say the recent release does not comply with the law. The release leaves out many documents in the DOJ\u0027s possession and is criticized by both Democratic and Republican lawmakers for redacting potentially valuable information. \n\nChapter Breakdown\n00:00 Lawmakers criticize DOJ\u0027s redacted release of Epstein files\n0:28 Ethan Bearman, Attorney and Adjunct Professor at Loyola Law School, LA, as to why the DOJ release is not in compliance with the law\n4:34 What\u0027s been redacted in the Epstein files?\n\n#epsteinfiles #trump #sexoffenderepstein\n\n\nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1",
      "release": "2025-12-21T21:00:49Z",
      "duration": "00:06:29",
      "explicit": false,
      "youTubeId": "2JLHsoJ47bc",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2JLHsoJ47bc"
      }
    },
    {
      "id": "b84e733e-8d79-493f-b036-8124cbf6c1dd",
      "title": "Can the Epstein files release calm Trump\u0027s MAGA backlash? | DW News | DW News",
      "description": "The documents released on Friday are roughly 4,000 images in five data sets. That is a thin slice of the hundreds of thousands of files the Department of Justice has. In a letter to Congress obtained by Associated Press, the Department of Justice acknowledged that the complete set of files was not released and that the government expects more disclosures by the end of the year. Of the documents that were released, many were heavily redacted without explanation. For instance, over 100 images were entirely blacked out, without explanations. Dozens of other images showed staircases. It is unclear how substantive the data sets are given the lack of context from the Department of Justice.\n\nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1\n\n#epsteinfiles #trump",
      "release": "2025-12-20T11:01:38Z",
      "duration": "00:09:47",
      "explicit": false,
      "youTubeId": "n5m12ln0VNI",
      "subjects": [
        "Human Trafficking",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n5m12ln0VNI"
      }
    },
    {
      "id": "9db51c7a-47d4-4137-9857-3d0303088a28",
      "title": "(Former) Prince Andrew\u0027s fall from grace: Could royal now face police enquiries? | DW News",
      "description": "The name Andrew Albert Christian Edward Mountbatten Windsor might sound regal, but it\u0027s missing one word - \u0022Prince\u0022. Britain\u0027s King Charles has begun the process of removing his brother Andrew\u0027s royal titles. The former prince has also been told to vacate his royal residence. For months, pressure to act has been mounting on the King over Andrew\u0027s links to the late convicted sex offender Jeffrey Epstein. \n\nThe family of the late Virginia Giuffre, who accused Andrew of sexual abuse, welcomed the decision. They are now calling for an investigation into the former prince, though Andrew has always denied any wrongdoing. \n\nCorrections:\n0:38 We meant Prince Charles Edward, Duke of Saxe-Coburg and Gotha, not Prince Maurice Battenberg!\n\nChapters:\n0:00 Andrew loses title of Prince\n3:42 Andrew Lownie, Royal historian \n\nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1\n#princeandrew #epstein #royals",
      "release": "2025-10-31T21:30:23Z",
      "duration": "00:13:08",
      "explicit": false,
      "youTubeId": "x2MpPNbf9Bo",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x2MpPNbf9Bo"
      }
    },
    {
      "id": "d27ae8ce-73b5-4697-b259-571d786e98a2",
      "title": "Andrew loses royal titles and must leave mansion | DW News",
      "description": "Buckingham Palace says Britain\u0027s King Charles III has begun the \u0022formal\u0022 process to strip Prince Andrew of remaining titles and evict him from the royal residence, the Royal Lodge.\n\n00:00 Andrew loses royal titles and must leave mansion\n03:04 Birgit Maas, DW Correspondent\n\nFor more news go to: http://www.dw.com/en/\n\nFollow DW on social media:\n►Instagram: https://www.instagram.com/dwnews\n►TikTok: https://www.tiktok.com/@dwnews\n►Facebook: https://www.facebook.com/deutschewellenews/\n►Twitter: https://twitter.com/dwnews\n\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/dwdeutsch\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1\n\n#England #Andrew #RoyalFamily #epsteinfiles",
      "release": "2025-10-31T10:01:32Z",
      "duration": "00:07:31",
      "explicit": false,
      "youTubeId": "DtfxIi1oCkU",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DtfxIi1oCkU"
      }
    },
    {
      "id": "09de3fac-35ce-48ad-b13d-7c43f44e3926",
      "title": "Coronavirus conspiracy theories: Why do people fall for them? | COVID-19 Special",
      "description": "Despite mounting evidence about the coronavirus, conspiracy theories are still on the rise. Well, the COVID-19 pandemic is scary, and people are hungry for answers. Social media is rife with speculation, ranging from the plausible to the ridiculous. Bio-engineered weapon, Bill Gates, 5G: These are just a few of the COVID-19 conspiracy theories that abound. So how should we deal with all these theories about the origins of the coronavirus? DW\u0027s Julia Vergin talked to Social Psychologist Roland Imhoff.\n\nSubscribe: https://www.youtube.com/user/deutschewelleenglish?sub_confirmation=1\r\n\r\nFor more news go to: http://www.dw.com/en/\r\nFollow DW on social media:\r\n►Facebook: https://www.facebook.com/deutschewellenews/\r\n►Twitter: https://twitter.com/dwnews\r\n►Instagram: https://www.instagram.com/dw_stories/\r\nFür Videos in deutscher Sprache besuchen Sie: https://www.youtube.com/channel/deutschewelle\n#Coronavirus #Covid19 #CoronavirusTheories",
      "release": "2020-07-17T15:19:37Z",
      "duration": "00:12:03",
      "explicit": false,
      "youTubeId": "dbrg4-ZQIEg",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dbrg4-ZQIEg"
      }
    }
  ]
}