{
  "id": "910e99b0-c8fc-44c1-a3d0-1f663534a8d0",
  "name": "Dysfunctional",
  "spotifyId": "1ynhjlOQSCohLbClpCZyAy",
  "appleId": 1779051635,
  "youTubeChannelId": "UC-litdbzLfMNTz7MDyP6-Zg",
  "episodes": [
    {
      "id": "1ce21d3c-c8d5-4c00-bcf1-5404424fcae7",
      "title": "Raised in a Cult to Finding Healing, with Karinne",
      "description": "Trigger Warning: This episode contains discussions of childhood sexual abuse, religious trauma, suicide attempts, and domestic violence. Please listen with care.\n\nIn this powerful episode of Dysfunctional, Karinne shares her story of surviving a childhood shaped by the Jehovah’s Witnesses — a group she now calls a cult — and parents who were both abusive and narcissistic.\n\nKicked out at 16 after being groomed and blamed for it, Karinne found herself completely alone in the world, trauma-bonded to the very people who harmed her, and struggling to make sense of a reality she was never prepared for.\n\nWhat follows is a conversation about real healing — not the Instagram version with matcha and mantras, but the messy, angry, beautiful kind that happens when you start telling the truth.\n\nTogether we explore:\n\nWhat it’s like growing up in a high-control religious cult\nThe impact of narcissistic parenting and spiritual abuse\nPurity culture, fear-based control, and enforced submission\nThe trauma bond and why it’s so hard to break\nWhat healing actually looks like — day-to-day, years on\nKarinne is funny, fierce, and real. She’s not here to sugarcoat anything. This is what healing sounds like in real life.\n\n📲 Connect with Karinne on insta - @girl_inshambles",
      "release": "2025-07-07T05:03:15Z",
      "duration": "01:03:36",
      "explicit": false,
      "spotifyId": "03m9g3MbWLyFUShkcY4xeI",
      "appleId": 1000716269436,
      "youTubeId": "2iPeyhn-ezU",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Purity Culture",
        "Cult Recovery",
        "Psychology",
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/03m9g3MbWLyFUShkcY4xeI",
        "apple": "https://podcasts.apple.com/podcast/raised-in-a-cult-to-finding-healing-with-karinne/id1779051635?i=1000716269436",
        "youtube": "https://www.youtube.com/watch?v=2iPeyhn-ezU"
      }
    }
  ]
}