{
  "_ts": 0,
  "id": "a609fb61-524c-4512-97c7-19e9655fe672",
  "name": "East Idaho News",
  "youTubeChannelId": "UCd7U6pdRYzU-K_vFqwzLBqQ",
  "episodes": [
    {
      "id": "ad6c86f5-5647-403b-a67c-74f142efdae0",
      "title": "Julie Rowe, a former confidant of Chad and Tammy Daybell, talks about their relationship (from 2020)",
      "description": "#eastidahonews #daybell #julierowe \n\nJulie Rowe, a former confidant of Chad and Tammy Daybell, spoke with EastIdahoNews.com on June 5, 2020.  Three days later, the bodies of JJ Vallow and Tylee Ryan were found buried on Daybell\u0027s property.\n\nWe never posted this interview but are now sharing it, unedited, for the public to see. You can watch the entire conversation in the video player above.\n\n► Subscribe to East Idaho News:  https://www.youtube.com/c/Eastidahonews?sub_confirmation=1\n► Support East Idaho News: https://www.eastidahonews.com/donate/\n► Download our free app: http://marketplace-redirect.doapps.com/3236\n► Like us on Facebook:  https://www.facebook.com/EastIdahoNews\n► Follow us on X: https://twitter.com/EastIDNews\n► Follow us on Instagram:  https://www.instagram.com/eastidahonews/\n► Get East Idaho News merch:  https://www.eastidahonews.com/shop/\n► Subscribe to our free newsletter: https://www.eastidahonews.com/newsletter/",
      "release": "2024-07-22T19:40:07Z",
      "duration": "01:08:41",
      "explicit": false,
      "youTubeId": "XmahJjXXYjw",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XmahJjXXYjw"
      }
    },
    {
      "id": "8384ef5d-fda8-4eee-8e77-912eebaef6ef",
      "title": "\u0027If there was a face to evil, it was hers.\u0027 Juror describes serving in Daybell trial",
      "description": "#eastidahonews #daybell #trial \n\nBOISE -- A man who served on the jury in Lori Vallow Daybell\u0027s murder trial says he saw evil for the first time in his life while sitting in the courtroom with Daybell for five weeks.\n\nSaul Hernandez was juror number 8 and was assigned the seat closest to the witness stand from when the trial began on April 10 until a verdict was announced Friday afternoon. He and the 17 other jurors, including six alternates, sat directly across from Daybell.\n\n\u0022If there is a face to evil, it was hers,\u0022 Hernandez tells EastIdahoNews.com.\n\nDaybell was found guilty of killing Joshua \u0022JJ\u0022 Vallow and Tylee Ryan. Hernandez and his fellow jurors also found her guilty of conspiracy of murder in connection to the death of Tammy Daybell, her husband\u0027s former wife.\n\nHernandez sat down with EastIdahoNews.com reporter Nate Eaton for nearly an hour Wednesday morning at his Boise home to talk about his jury service, the evidence, witnesses, prosecution, defense and why he wasn\u0027t originally convinced that Daybell killed Tylee Ryan.\n\nListen to our entire interview in the video player above.\n\nIf you served on the Daybell jury and wish to share your story (on or off the record), email neaton@eastidahonews.com.",
      "release": "2023-05-17T20:44:19Z",
      "duration": "00:37:51",
      "explicit": false,
      "youTubeId": "4Jhi9fjj8KY",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4Jhi9fjj8KY"
      }
    }
  ]
}