{
  "_ts": 0,
  "id": "0cb1e2a8-909e-4fd7-9eb5-dcf5cdd2130c",
  "name": "Eavesdroppin\u0027",
  "spotifyId": "3BKt2Oy4zfPCxI7LDOQLN4",
  "appleId": 1539144364,
  "episodes": [
    {
      "id": "0a75d210-22c8-4eef-8772-e61fdecd66ec",
      "title": "SCAMMED!: The Lighthouse cult plus the shocking truth behind the McDonald’s scam",
      "description": "On Eavesdroppin’ comedy podcast this week, hosts Geordie \u0026 Michelle talk about a cult that masquerades as self-help mentoring, plus how an unknown caller got dozens of people to strip-search their employees… What if someone told you they could help you fulfil your dreams, achieve your career goals AND make you a better person? This week, Michelle looks at Lighthouse, a self-help group that offered mentoring to people that was meant to help you realise your true potential and become a success in life and business – except it was actually a cult. Listen now to find out what reeled people in – and what happened when they tried to get out… Geordie looks at a one of the most hard-to-believe scams that happened in the late 90s and early 2000s… Imagine you’re a manager at a fast-food chain and the police call telling you that one of your members of staff has stolen money from a customer and needs to be strip searched immediately. Yep – that’s the gist of it, and saddest of all, people fell for the scam and countless women were traumatised by strip searches and more. Listen to hear more! So pop on your headphones, grab a brown lemonade and join Geordie \u0026 Michelle for this week’s episode, plus chat about MAFS Australia, avalanche deaths, a startling voice note from one of our Eavesdroppers and more, only on Eavesdroppin’ podcast. And remember, wherever you are, whatever you do, just keep Eavesdroppin’! *Disclaimer: We don’t claim to have any factual info about anything ever and our opinions are just opinions not fact, sooorrrryyy! Don’t sue us! Please rate, review, share and subscribe in all the usual places – we love it when you do! Support us on Patreon : https://www.patreon.com/eavesdroppin Do write in with your stories at hello@eavesdroppinpodcast.com or send us a Voice Note! Listen: www.eavesdroppinpodcast.com or https://podfollow.com/eavesdroppin YouTube: https://www.youtube.com/channel/UCqcuzv-EXizUo4emmt9Pgfw Facebook: https://www.facebook.com/eavesdroppinpodcast #lighthousecult #cults #scam #mcdonaldsscam #stripsearchscam #PaulWaugh #jeffleighjones #reallife #podcast #comedy #comedypodcast #truestories #storytellingpodcast #eavesdroppin #eavesdroppinpodcast Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-17T02:00:52Z",
      "duration": "01:00:34.8080000",
      "explicit": true,
      "spotifyId": "2p2gCUhXsJyl3kZHIFQhYJ",
      "appleId": 1000652678705,
      "subjects": [
        "Lighthouse International Group",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2p2gCUhXsJyl3kZHIFQhYJ",
        "apple": "https://podcasts.apple.com/podcast/scammed-the-lighthouse-cult-plus-the-shocking/id1539144364?i=1000652678705"
      }
    },
    {
      "id": "4252d2a9-a67c-4348-a4a0-dea3b2b5ea47",
      "title": "LADY CULTS: The Brahma Kumaris plus Gwen Shambin Lara’s weight-loss cult",
      "description": "This week on Eavesdroppin’ comedy podcast, hosts Geordie \u0026 Michelle look at two cults started by women… When Eavesdropper Linda wrote in telling us about how her father had changed his will to leave the lion’s share of his money and property to the Brahma Kumaris in the last days of his life, Geordie got to work to investigate the organisation. Spiritual fellowship to help people find a better way of living – or a doomsday cult that preys on the vulnerable and encourages them to leave their money and property to the group, you decide… Listen to find out more!Michelle follows with the story of Gwen Shamblin Lara and her weight-loss cult, The Weigh Down Workshop. Believing that fat on your body is a manifestation of sin, Gwen combined weight loss with religion and built up a following that eventually led to starting her own church. But it didn’t stop there… Listen now to find out what happened to Gwen and the Remnant Fellowship and how her teachings led to the tragic death of an innocent child.So pop on your headphones, grab a brown lemonade and join Geordie \u0026 Michelle for this week’s episode, plus telly recs, a chat about Roxette and more, only on Eavesdroppin’ podcast. And remember, wherever you are, whatever you do, just keep Eavesdroppin’!*Disclaimer: We don’t claim to have any factual info about anything ever and our opinions are just opinions not fact, sooorrrryyy! Don’t sue us!Please rate, review, share and subscribe in all the usual places – we love it when you do!Support us on Patreon💰: https://www.patreon.com/eavesdroppinDo write in with your stories at hello@eavesdroppinpodcast.com or send us a Voice Note!Listen: www.eavesdroppinpodcast.com or https://podfollow.com/eavesdroppinYouTube: https://www.youtube.com/channel/UCqcuzv-EXizUo4emmt9PgfwFacebook: https://www.facebook.com/eavesdroppinpodcast#brahmakumaris #cult #gwenshamblin #gwenshamblinlara #weighdown #weighdownworkshop #cults #BK #reallife #podcast #comedy #comedypodcast #truestories #storytellingpodcast #eavesdroppin #truecrime #eavesdroppinpodcastSPECIAL LINK: MUSIC STORIESAnd a fantastic link to Geordie talking about the time she met Adam Ant! Watch it now – along with all the other great music stories – on Benjamin Cartel’s YouTube channel: https://www.youtube.com/watch?v=Id5geTwlxOo Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-07T03:00:22Z",
      "duration": "00:58:39.4510000",
      "explicit": true,
      "spotifyId": "1AgQFMyV7N58KG7yXOHy1C",
      "appleId": 1000644429839,
      "subjects": [
        "Brahma Kumaris",
        "Remnant Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1AgQFMyV7N58KG7yXOHy1C",
        "apple": "https://podcasts.apple.com/podcast/lady-cults-the-brahma-kumaris-plus-gwen-shambin-laras/id1539144364?i=1000644429839"
      }
    }
  ]
}