{
  "id": "29676860-5e2a-46d7-8d83-cf3d118be586",
  "name": "Edgar Obare",
  "youTubeChannelId": "UCZ72q53EdgBKTVegliUB3Eg",
  "episodes": [
    {
      "id": "5d8ac0ec-e524-430d-8fe0-8ba878f3e7ae",
      "title": "Kenya’s Most Controversial Pastors – Scandals, Fake Miracles \u0026 Cults Exposed! - BNN",
      "description": "Kenya has seen its fair share of controversial pastors, and this video takes a deep dive into some of the most infamous names in the country’s religious scene. From shocking scandals to legal battles, these pastors have made headlines for all the wrong reasons.\n\nPastor Peter K has been at the center of disturbing allegations, with claims that he has been exploiting young men in his church. The accusations started when Pastor Ben Gitau exposed Pastor Peter K’s actions, leading to public outrage. The situation escalated when angry residents stormed Pastor Peter K’s church, demanding justice.\n\nPastor Paul Mackenzie shook the nation with the horrifying Shakahola Forest massacre, where hundreds of his followers allegedly starved to death under his orders. Pastor Paul Mackenzie’s radical teachings condemned education, healthcare, and modern institutions, convincing his congregation to isolate themselves from society.\n\nAs Pastor Paul Mackenzie faces trial for manslaughter and terrorism charges, Kenyans are left questioning how such a tragedy could happen.\n\nPastor Victor Kanyari has been a household name in Kenyan religious scandals for years. Pastor Kanyari first gained notoriety for his fake miracles, where he allegedly deceived desperate believers into paying for blessings. Over the years, Pastor Kanyari has remained relevant through his controversial behavior, from using inappropriate language to questionable associations. Despite his past, Pastor Kanyari continues to thrive in the religious space, proving that controversy only fuels his brand.\n\nPastor James Ng’ang’a of Neno Evangelism Centre has built a reputation for his outspoken and often bizarre sermons. From verbally attacking his congregation to making inappropriate remarks that sparked national outrage, Pastor Ng’ang’a has remained one of Kenya’s most unpredictable As Pastor Paul Mackenzie faces trial for manslaughter and terrorism charges, Kenyans are left questioning how such a tragedy could happen.\n\nBishop Gilbert Deya is perhaps one of Kenya’s most internationally infamous religious figures. Pastor Gilbert Deya became known for his so-called ‘miracle babies,’ claiming to help barren women conceive through prayer. However, investigations revealed a dark truth—Pastor Gilbert Deya was allegedly involved in child trafficking, with reports suggesting stolen babies were passed off as miraculous births. After years of fighting extradition from the UK, Pastor Gilbert Deya was sent back to Kenya to face charges, though he was later acquitted. Despite his tainted past, Pastor Gilbert Deya still commands a following, leaving\nmany questioning how Pastor Gilbert Deya has managed to maintain his influence.\n\nFrom Pastor Peter K’s disturbing accusations to Pastor Paul Mackenzie’s deadly cult, from Pastor Kanyari’s scams to Pastor Ng’ang’a’s outrageous sermons, and finally, Pastor Gilbert Deya’s international scandal—these religious leaders have built legacies filled with controversy. What makes them so powerful, and why do their followers remain loyal?\n\nJoin us as we expose the shocking stories behind Kenya’s most controversial pastors.\n\n👉Don’t miss out – join our Telegram for exclusive content and updates: https://t.me/bnnkenya and follow us on Instagram @BNNBasic: https://www.instagram.com/bnnbasic?igsh=MWh3eGZhdm9qdGM4ag==",
      "release": "2025-03-03T18:20:00Z",
      "duration": "00:09:09",
      "explicit": false,
      "youTubeId": "Hyj0tXC82oE",
      "subjects": [
        "Good News International Ministries",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Hyj0tXC82oE"
      }
    },
    {
      "id": "9d002959-f12a-43d0-91c9-a6dc7fdc0e29",
      "title": "The Shady Allegations Around Rev Lucy Natasha; Cult Drama, \u0027Wash Wash\u0027 Links, and More Tea – BNN",
      "description": "Rev. Lucy Natasha is no stranger to headlines, from accusations of cultism, alleged staged miracles, and shocking interactions with a social media user, to questions about money laundering and connections with socialite Phoina, this story has it all. Is the flamboyant preacher being unfairly targeted, or is there more beneath the surface?\n\nWe break it all down in today’s video. You don’t want to miss this!\n\n🔗 Join our Telegram for exclusive updates: https://t.me/bnnkenya\n📸 Follow us on Instagram: @BNNBasic",
      "release": "2025-01-17T08:37:30Z",
      "duration": "00:07:54",
      "explicit": false,
      "youTubeId": "JhWnoTuGL4g",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JhWnoTuGL4g"
      }
    }
  ]
}