{
  "id": "8bbd93b2-d33d-4a97-b0ab-e4727664ca61",
  "name": "Edufuturists",
  "spotifyId": "1QyiIk2EgZFkYdxLvk9UwW",
  "appleId": 1347592880,
  "youTubeChannelId": "UCK6CUkjAvIFWC8DlsGgfC4A",
  "episodes": [
    {
      "id": "073150a1-d8f3-4117-8102-448df72442e2",
      "title": "Edufuturists #238 Building A Healthy Culture with Petra Velzeboer",
      "description": "In this episode, we were delighted to be joined by Petra Velzeboer, after a recommendation from good friend of the podcast, Ed Kirwan. Petra is a renowned mental health expert, TedX speaker, author, and CEO of mental health consultancy PVL. Her passion for creating psychologically safe spaces can be traced back to her unique background, having been raised in a notorious cult and struggling to find her place in the world. A series of life altering events led her to pursue a career as a psychotherapist so that she could help others. After working in various companies with toxic work environments, she has made it her life’s mission to reinvent the world of work and completely shift the current system, ushering in the future of work. Check out Petra\u0027s work Watch her viral TEDx talk that has been viewed over 142k times Buy her bestselling book, Begin with You Thanks so much for joining us again for another episode - we appreciate you. Ben \u0026 Steve x Championing those who are making the future of education a reality. Follow us on X Grab your tickets for the Uprising 2024 Want to sponsor future episodes or get involved with the Edufuturists work? Get in touch: info@edufuturists.com --- Send in a voice message: https://podcasters.spotify.com/pod/show/edufuturistspodcast/message",
      "release": "2024-04-15T15:01:25Z",
      "duration": "00:59:29.7190000",
      "explicit": true,
      "spotifyId": "0TYNbl37ETelS0eMZ7Ch5h",
      "appleId": 1000652507330,
      "youTubeId": "P4_rjGOJlxw",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0TYNbl37ETelS0eMZ7Ch5h",
        "apple": "https://podcasts.apple.com/podcast/edufuturists-238-building-a-healthy-culture-with/id1347592880?i=1000652507330",
        "youtube": "https://www.youtube.com/watch?v=P4_rjGOJlxw"
      }
    }
  ]
}