{
  "id": "27a08380-cfc3-4d0c-8e59-ed415e31620a",
  "name": "El Heraldo de México",
  "youTubeChannelId": "UC7E9Dj_lmrJdDrH2Bg7rNqQ",
  "episodes": [
    {
      "id": "bd1bc32d-5630-41f2-866a-0383c48bb172",
      "title": "¿Quiénes son los miembros de Lev Tahor y cómo operaban? Rescatan a 17 menores de secta en Colombia",
      "description": "Autoridades colombianas lograron un avance significativo en el caso de la secta judía ultraortodoxa Lev Tahor al rescatar a 17 menores de edad en Yarumal, Antioquia. El operativo, coordinado por la Policía, Migración Colombia y el Instituto Colombiano de Bienestar Familiar (ICBF), incluyó la verificación migratoria de 26 personas, cinco de ellas con alerta de Interpol por posibles riesgos relacionados con desaparición o trata de personas. \n\nLos menores, provenientes de Guatemala, Estados Unidos y Canadá, fueron trasladados a un centro de protección donde reciben acompañamiento profesional. Lev Tahor, fundada en 1988 en Jerusalén por el rabino Shlomo Helbrans, ha cambiado de ubicación en múltiples países y es conocida por su estilo de vida ultraortodoxo, estrictas reglas de vestimenta, educación en casa, control sobre los miembros y denuncias previas de matrimonio de menores y traslados irregulares. \n\nEste operativo se suma a intervenciones recientes en Guatemala y El Salvador, y marca un paso clave para garantizar la seguridad de los menores en Colombia.\n\nMás información en: https://heraldodemexico.com.mx/\n\n¡Síguenos en nuestras redes sociales para estar enterado de todo!\n\nFB: https://www.facebook.com/elheraldodemexico\nTW: https://twitter.com/heraldodemexico\nIG: https://www.instagram.com/elheraldodemexico/",
      "release": "2025-11-25T15:00:06Z",
      "duration": "00:03:40",
      "explicit": false,
      "youTubeId": "SX9LooqBzJE",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SX9LooqBzJE"
      }
    }
  ]
}