{
  "id": "27a08380-cfc3-4d0c-8e59-ed415e31620a",
  "name": "El Heraldo de México",
  "youTubeChannelId": "UC7E9Dj_lmrJdDrH2Bg7rNqQ",
  "episodes": [
    {
      "id": "ef7ae09f-fb63-4518-b2d9-b2690253e6b8",
      "title": "¡No solo era una isla! Lujoso rancho de Jeffrey Epstein podría ocultar cuerpos de sus víctimas",
      "description": "Durante años, la atención pública se centró en la isla privada de Jeffrey Epstein en el Caribe, convertida en símbolo del escándalo internacional. Sin embargo, nuevos documentos desclasificados por el Departamento de Justicia de Estados Unidos han puesto el foco en otra propiedad: Zorro Ranch, un extenso terreno en Nuevo México adquirido en 1993. Correos electrónicos y denuncias enviadas al FBI mencionan el rancho como posible escenario de hechos aún no esclarecidos, incluyendo acusaciones graves que hasta ahora no han sido confirmadas judicialmente.\n\nAunque no existe evidencia oficial que respalde las versiones más alarmantes, sobrevivientes y activistas exigen que se investigue a fondo cada una de las propiedades vinculadas al magnate. Los archivos revelados incluyen reportes administrativos y denuncias que forman parte de líneas abiertas de investigación, pero no conclusiones definitivas. Entre la falta de confirmación pública y la presión por transparencia, Zorro Ranch emerge como una pieza que podría ampliar o desmentir parte del rompecabezas que aún rodea el caso Epstein.\n\nMás información en: https://heraldodemexico.com.mx/\n\n¡Síguenos en nuestras redes sociales para estar enterado de todo!\n\nFB: https://www.facebook.com/elheraldodemexico\nTW: https://twitter.com/heraldodemexico\nIG: https://www.instagram.com/elheraldodemexico/",
      "release": "2026-02-14T05:54:04Z",
      "duration": "00:03:26",
      "explicit": false,
      "youTubeId": "HtoIK2jLG2U",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HtoIK2jLG2U"
      }
    },
    {
      "id": "b85f38b5-4ddc-4596-bac0-35a2590b447a",
      "title": "Guatemala captura a integrante de secta Lev Tahor por trata de menores, México pide su extradición",
      "description": "Las autoridades de Guatemala detuvieron a Yoel Malka, ciudadano israelí de 37 años e integrante de la secta judía ortodoxa Lev Tahor, como resultado de un operativo realizado en el centro de la Ciudad de Guatemala con apoyo de Interpol. La captura se llevó a cabo a solicitud del gobierno de México, que lo reclama en extradición por su presunta responsabilidad en delitos de delincuencia organizada, trata de personas y matrimonio forzoso, informaron fuentes oficiales de la Policía Nacional Civil y la Fiscalía guatemalteca.\n\nLev Tahor ha sido objeto de investigaciones en varios países de América Latina por presuntos abusos contra menores, maltrato, matrimonios arreglados y explotación. En diciembre de 2024, autoridades guatemaltecas rescataron a 160 menores de una finca vinculada al grupo, mientras que en años recientes se han detenido a otros líderes por delitos similares. El grupo, fundado en la década de 1980, se estableció en Guatemala en 2013 y también ha tenido conflictos legales con autoridades de Canadá y Colombia, donde en 2025 fueron expulsados varios de sus miembros tras el rescate de menores.\n\nMás información en: https://heraldodemexico.com.mx/\n\n¡Síguenos en nuestras redes sociales para estar enterado de todo!\n\nFB: https://www.facebook.com/elheraldodemexico\nTW: https://twitter.com/heraldodemexico\nIG: https://www.instagram.com/elheraldodemexico/",
      "release": "2026-02-07T04:06:26Z",
      "duration": "00:03:06",
      "explicit": false,
      "youTubeId": "WQMI6MFcxjQ",
      "subjects": [
        "Lev Tahor",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WQMI6MFcxjQ"
      }
    },
    {
      "id": "bd1bc32d-5630-41f2-866a-0383c48bb172",
      "title": "¿Quiénes son los miembros de Lev Tahor y cómo operaban? Rescatan a 17 menores de secta en Colombia",
      "description": "Autoridades colombianas lograron un avance significativo en el caso de la secta judía ultraortodoxa Lev Tahor al rescatar a 17 menores de edad en Yarumal, Antioquia. El operativo, coordinado por la Policía, Migración Colombia y el Instituto Colombiano de Bienestar Familiar (ICBF), incluyó la verificación migratoria de 26 personas, cinco de ellas con alerta de Interpol por posibles riesgos relacionados con desaparición o trata de personas. \n\nLos menores, provenientes de Guatemala, Estados Unidos y Canadá, fueron trasladados a un centro de protección donde reciben acompañamiento profesional. Lev Tahor, fundada en 1988 en Jerusalén por el rabino Shlomo Helbrans, ha cambiado de ubicación en múltiples países y es conocida por su estilo de vida ultraortodoxo, estrictas reglas de vestimenta, educación en casa, control sobre los miembros y denuncias previas de matrimonio de menores y traslados irregulares. \n\nEste operativo se suma a intervenciones recientes en Guatemala y El Salvador, y marca un paso clave para garantizar la seguridad de los menores en Colombia.\n\nMás información en: https://heraldodemexico.com.mx/\n\n¡Síguenos en nuestras redes sociales para estar enterado de todo!\n\nFB: https://www.facebook.com/elheraldodemexico\nTW: https://twitter.com/heraldodemexico\nIG: https://www.instagram.com/elheraldodemexico/",
      "release": "2025-11-25T15:00:06Z",
      "duration": "00:03:40",
      "explicit": false,
      "youTubeId": "SX9LooqBzJE",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SX9LooqBzJE"
      }
    }
  ]
}