{
  "id": "59a62519-454a-48b1-93b5-22d4e0f47448",
  "name": "EL PAÍS",
  "youTubeChannelId": "UCnsvJeZO4RigQ898WdDNoBw",
  "episodes": [
    {
      "id": "76329611-2996-43ab-9151-0be031122c53",
      "title": "PAM BONDI y CONGRESISTAS intercambian INSULTOS en audiencia sobre los ARCHIVOS EPSTEIN | EL PAÍS",
      "description": "La gestión del Departamento de Justicia de Estados Unidos sobre el archivo de Jeffrey Epstein, el depredador sexual y pederasta, que murió en la cárcel en 2019 mientras esperaba juicio, ha deparado este miércoles un tenso y acalorado debate entre la fiscal general, Pam Bondi, y los representantes demócratas en el Congreso de Estados Unidos, con improperios y acusaciones cruzadas.\n\nBondi ha proferido insultos, amenazas y ha interrumpido con frecuencia las graves acusaciones lanzadas por los congresistas sobre el papel de su departamento en el análisis del caso de abusos sexuales y la relación de Donald Trump con Epstein. \n\n“No me dices nada, abogado fracasado y perdedor”, le espetó Bondi a Jamie Raskin, el congresista demócrata de mayor rango en la comisión de Justicia, cuando le pedía más tiempo para presentar las preguntas tras sugerir que el Departamento de Justicia había manipulado el archivo. Bondi ha lanzado una defensa cerrada de Trump, calificándolo como “el presidente más transparente de la historia” a pesar de los esfuerzos por no publicar los archivos.\n\nOtro legislador demócrata, Jerry Nadler, inquirió a la fiscal general sobre los supuestos cómplices de Epstein. Bondi lo interrumpió y, elevando la voz, calificó la pregunta de “puro teatro” y aseguró que no se iba a “meter en la cuneta” o no iba a entrar al barro. Todo con tono duro y desabrido.\n\nMientras se producía el intercambio de acusaciones entre la fiscal general y los demócratas, una docena de supervivientes de Epstein y familiares estaban sentados detrás de ella. “Para promover la justicia para el pueblo, es necesario escuchar a las víctimas, como las mujeres sentadas detrás de ustedes hoy”, comenzó Jamie Raskin, el congresista demócrata, con quien Bondi ha mantenido un desagradable intercambio. “Estas son solo algunas de las cientos de sobrevivientes de la red global de tráfico sexual de Jeffrey Epstein que exigen que se diga la verdad y que los abusadores que las traficaron y violaron rindan cuentas”.\n\n#epsteinfiles #pambondi \n\nSuscríbete a nuestro canal: youtube.com/@elpais\nVisita http://elpais.com\nMás vídeos de EL PAÍS: youtube.com/@elpais/videos\nSíguenos en Facebook: https://www.facebook.com/elpais\nTwitter: https://twitter.com/el_pais\nInstagram: https://www.instagram.com/el_pais",
      "release": "2026-02-11T21:25:17Z",
      "duration": "00:06:03",
      "explicit": false,
      "youTubeId": "xxekgQ0OQ88",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xxekgQ0OQ88"
      }
    },
    {
      "id": "0d0d49fe-cadb-4f7f-9252-6851673f4357",
      "title": "CASO EPSTEIN: Nuevos vídeos de la declaración de Jeffrey Epstein y Ghislaine Maxwell | EL PAÍS",
      "description": "Los vídeos incluidos en una publicación masiva de archivos relacionados con los casos de abuso sexual de Jeffrey Epstein muestran a su cómplice condenada, Ghislaine Maxwell, comiendo, leyendo y hablando por teléfono mientras estaba recluida en una cárcel de Brooklyn, Nueva York, en 2020.\n\nLos archivos también incluyen vídeos de las declaraciones prestadas por Maxwell y Epstein, en las que este se acoge repetidamente a la Quinta Enmienda cuando se le pregunta si abusó sexualmente de niñas menores de edad.\n\nAunque Epstein falleció en 2019, la transparencia y la rendición de cuentas para las víctimas de sus abusos han dado lugar a investigaciones de supervisión y a la aprobación de la ley sobre los archivos de Epstein.\n\nEl Departamento de Justicia de Estados Unidos ha declarado que ha publicado casi 3,5 millones de páginas de documentos, aunque algunos archivos están muy censurados. Los miembros del Congreso comenzaron a revisar los archivos sin censurar el lunes.\n\nSuscríbete a nuestro canal: youtube.com/@elpais\nVisita http://elpais.com\nMás vídeos de EL PAÍS: youtube.com/@elpais/videos\nSíguenos en Facebook: https://www.facebook.com/elpais\nTwitter: https://twitter.com/el_pais\nInstagram: https://www.instagram.com/el_pais\nTiktok: https://www.tiktok.com/@elpais\n\n#epsteinfiles #casoepstein #jeffrey_epstein #ghislainemaxwell",
      "release": "2026-02-11T11:24:28Z",
      "duration": "00:02:38",
      "explicit": false,
      "youTubeId": "-O7nvi2rnBw",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-O7nvi2rnBw"
      }
    },
    {
      "id": "420313a2-4117-4d01-8919-f5184c4f59de",
      "title": "CASO EPSTEIN | GHISLAINE MAXWELL se niega a responder en su declaración ante el Congreso | EL PAÍS",
      "description": "Mientras las últimas revelaciones del caso Jeffrey Epstein golpean los círculos de poder de medio mundo, Ghislaine Maxwell, la principal colaboradora y cómplice del financiero pedófilo que murió en la cárcel en 2019, ha comparecido este lunes por videoconferencia ante el comité de cumplimiento del Congreso de Estados Unidos. Maxwell había sido citada para tratar de arrojar luz sobre las actividades del millonario que tejió una red de tráfico sexual y abusó de menores, y sobre la gestión que el Departamento de Justicia ha hecho sobre el voluminoso archivo del caso, con miles de fotos y videos.\n\nPero la amiga y cómplice de Epstein, que está en una cárcel en Bryan (Texas) donde cumple una pena de 20 años de prisión, se ha acogido a la Quinta Enmienda de la Constitución estadounidense para evitar declarar y responder a las preguntas de los miembros del comité, celebrado a puerta cerrada.\n\nSuscríbete a nuestro canal: youtube.com/@elpais\nVisita http://elpais.com\nMás vídeos de EL PAÍS: youtube.com/@elpais/videos\nSíguenos en Facebook: https://www.facebook.com/elpais\nTwitter: https://twitter.com/el_pais\nInstagram: https://www.instagram.com/el_pais\nTiktok: https://www.tiktok.com/@elpais\n\n#ghislainemaxwell #epstein #eeuu #trump",
      "release": "2026-02-10T09:48:33Z",
      "duration": "00:02:05",
      "explicit": false,
      "youTubeId": "NkgZB2DMqts",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NkgZB2DMqts"
      }
    },
    {
      "id": "f1df3f78-eb06-416c-a48d-7fc778e45b62",
      "title": "MELINDA GATES sobre BILL GATES y JEFFREY EPSTEIN: \u0022Estoy feliz de estar lejos de la porquería\u0022",
      "description": "La filántropa Melinda French Gates afirma haber sentido una profunda tristeza cuando la semana pasada se publicaron nuevos documentos que detallan los vínculos de su exmarido y cofundador de Microsoft, Bill Gates, con el fallecido delincuente sexual convicto Jeffrey Epstein.\n\nBill Gates es una de las muchas personas influyentes mencionadas por su nombre en los 3 millones de páginas recién publicadas de las comunicaciones personales de Epstein.\n\nMelinda Gates, quien habló sobre su reacción a la controversia, dijo estar \u0022feliz de estar lejos de todo el lío\u0022 en una aparición en video en el podcast \u0022Wild Card\u0022 de NPR.\n\nMelinda y Bill se divorciaron en 2021. Bill Gates no ha sido acusado de ningún delito relacionado con Epstein.\n\n#epsteinfiles \n\nSuscríbete a nuestro canal: youtube.com/@elpais\nVisita http://elpais.com\nMás vídeos de EL PAÍS: youtube.com/@elpais/videos\nLas noticias de esta semana: https://acortar.link/FLHsHe\nSíguenos en Facebook: https://www.facebook.com/\nelpaismexico\nTwitter: https://twitter.com/elpaismexico\nInstagram: https://www.instagram.com/elpaismexico/",
      "release": "2026-02-04T19:57:38Z",
      "duration": "00:01:25",
      "explicit": false,
      "youTubeId": "6RFfhcOMTHM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6RFfhcOMTHM"
      }
    }
  ]
}