{
  "id": "adbfec8f-ec8b-45be-88ea-3224f777b8cf",
  "name": "Elevated Life: Real Wellness and Transformation",
  "spotifyId": "4Lrvjt4itMq0DMf3bYZCi6",
  "appleId": 1843176510,
  "episodes": [
    {
      "id": "fff4a219-90b1-4037-b2ba-39305b8b7142",
      "title": "Trust Yourself First - Taking Your Power Back from Wellness Gurus",
      "description": "Why do we keep looking for saviors instead of trusting ourselves? From fitness influencers to manifestation coaches to wellness practitioners, we\u0027ve been conditioned from childhood to believe someone else knows better than we do. But what if the answer was never outside of you? What if you already have what you need—you just haven\u0027t built the muscle of self-trust yet? What we get into: How we\u0027re taught from a young age not to trust ourselves—parents, teachers, pastors all saying \u0022I know better, I\u0027m older than you\u0022—and then suddenly at 18 we\u0027re supposed to magically trust ourselves with everything The red flags that someone\u0027s crossing from guidance into guru territory—when \u0022it didn\u0027t work, let\u0027s try something else\u0022 becomes \u0022it didn\u0027t work, it\u0027s your fault\u0022 Why absolutes are a warning sign—\u0022the only way to lose weight is carnivore,\u0022 \u0022if you\u0027ve been squatting like this you\u0027re wrong,\u0022 \u0022you didn\u0027t manifest correctly\u0022 How real guidance looks—walking alongside you, holding up a mirror (not a window for you to look at them), teaching you so you don\u0027t need them forever The questions to ask yourself: Am I really doing the work? Does this make sense for my body? Is this person empowering me or keeping me dependent? Why our goal as trainers is NOT client retention—we want you to learn, take your power back, and become confident doing this on your own We\u0027re walking through the difference between helpful guidance and cult-like dependency, why you\u0027re not broken (you\u0027re just where you\u0027re at right now), and how to stop running from Reiki to therapy to tarot to the next guru promising they have your answer. You don\u0027t need another seminar. You need yourself, some discipline, and a mirror. Self-trust is a muscle that has to be developed. Start building it. Want more tools for your transformation? Sign up for our free weekly newsletter at cjelevatedlife.com—every Monday you\u0027ll get motivation, mindset shifts, and actionable micro-skills to keep you moving forward.",
      "release": "2026-02-04T13:00:00Z",
      "duration": "00:33:36.6290000",
      "explicit": true,
      "spotifyId": "34pzoPQuDccR35ISeZfl5n",
      "appleId": 1000748171434,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34pzoPQuDccR35ISeZfl5n",
        "apple": "https://podcasts.apple.com/podcast/trust-yourself-first-taking-your-power-back-from-wellness/id1843176510?i=1000748171434"
      }
    }
  ]
}