{
  "id": "f3b0c63d-1a88-4091-9f89-a63088f24f88",
  "name": "Emancipation Nation",
  "spotifyId": "3XgXpKYoOfn8LMc9krRgvO",
  "appleId": 1471116928,
  "episodes": [
    {
      "id": "61853b9b-6cb9-4379-9559-767bd4c01891",
      "title": "Episode 201: Understanding Obstacles in Human Trafficking Victim Recovery: Housing and Transportation",
      "description": "Ever wonder why some victims of human trafficking struggle to escape their situation, even when help is available? Tune into our Emancipation Nation episode 201 and allow us to shed light on two fundamental barriers that often impede victims from receiving the assistance they desperately need: transportation and housing. In this episode we unravel the significance of these basic needs and how their inadequacy can hinder victims\u0027 journey towards healing and freedom.In this enlightening discussion, we navigate the different types of housing solutions for victims, ranging from temporary shelters to transitional housing, and how each serves a unique purpose in the survivor\u0027s journey. Dr. Williamson, drawing from Maslow\u0027s hierarchy of needs, underscores the impossibility of focusing on higher-level needs without first catering to the basic physiological ones. Join us as we delve into these pressing issues, and gain invaluable insights into how we, as advocates, can more effectively address these barriers and equip survivors with the resources they need to begin their journey towards healing and independence.",
      "release": "2023-11-28T00:00:00",
      "duration": "00:18:18.2090000",
      "explicit": false,
      "spotifyId": "3tuVjR5n4WRwNnnlaJIeu7",
      "appleId": 1000636840616,
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3tuVjR5n4WRwNnnlaJIeu7",
        "apple": "https://podcasts.apple.com/podcast/episode-201-understanding-obstacles-in-human-trafficking/id1471116928?i=1000636840616"
      }
    },
    {
      "id": "c6e01020-a4e8-43f0-83ba-8138a7f5206b",
      "title": "Episode 200: Screening and Assessing the Needs of Victims of Human Trafficking: 10 Common Areas of Need",
      "description": "In this episode, we equip you with vital knowledge about what to screen and assess for when assisting victims of human trafficking.  Our trusted guide is none other than Dr. Celia Williamson, director of the Human Trafficking and Social Justice Institute at the University of Toledo. She shines a light on a recently revised screening tool designed to identify at-risk and currently trafficked youth. This episode will help you recognize the 10 vital areas where trafficking victims may require assistance, such as basic needs, safety, orientation, education, and legal aid.Ever puzzled over how to shield at-risk girls from the clutches of human trafficking? We will provide a brief explanation of the transformative \u0027best life\u0027 curriculum, a powerful resource to empower girls to spot perilous situations and individuals. It also assists them in finding secure solutions and evaluating their choices wisely. March on with us as we navigate the complex needs of survivors, from legal and mental health needs to basic needs and sometimes substance abuse needs. We emphasize the necessity of connecting survivors with the right services and supports, empowering them to regain their own individual power. As we wrap up, we delve into the importance of healthcare and preventive care for survivors, giving you crucial insights into their specific needs and the importance of a holistic approach. Don\u0027t miss out!If you are interested in receiving the latest, free, valid screening tool to be used with youth ages 12-17, please email me at celia.williamson@utoledo.edu ",
      "release": "2023-11-21T00:00:00",
      "duration": "00:21:16.9100000",
      "explicit": false,
      "spotifyId": "3gMmJDejPkXTkaYYgQhfPk",
      "appleId": 1000635553223,
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3gMmJDejPkXTkaYYgQhfPk",
        "apple": "https://podcasts.apple.com/podcast/episode-200-screening-and-assessing-the-needs/id1471116928?i=1000635553223"
      }
    },
    {
      "id": "830fb828-bab7-4b93-9174-1560d286ce8c",
      "title": "Episode 178: Trafficked by the Church of God and Christ",
      "description": "Sexually abused by his parents, Bill went on to be abused by both extended family and church members.  Instead of keeping and continuing the secret, Bill is courageously exposing the people and churches that abuse others, while teaching and mentoring positive love and caring to those who love God.",
      "release": "2023-06-13T00:00:00",
      "duration": "00:42:45.1760000",
      "explicit": false,
      "spotifyId": "3RPWj6uxuZQZV8fcv62hJ6",
      "appleId": 1000616765356,
      "subjects": [
        "Church Of God And Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3RPWj6uxuZQZV8fcv62hJ6",
        "apple": "https://podcasts.apple.com/podcast/episode-178-trafficked-by-the-church-of-god-and-christ/id1471116928?i=1000616765356"
      }
    }
  ]
}