{
  "id": "34a8b7e0-7d9d-48b7-96b2-f24214b32a93",
  "name": "Empower Her Wellness",
  "spotifyId": "0LyxtbBwL3hUkmj6YhzTcy",
  "appleId": 1744613549,
  "youTubeChannelId": "UCCImUGw_NPHwn9o2vM0w6nA",
  "episodes": [
    {
      "id": "b3264e03-ce39-4fbe-9c56-1e53204eaa34",
      "title": "The Road to Recovery: Navigating Life After Leaving a Cult",
      "description": "Melody\u0027s journey from cult life to healing unfolds in an engaging narrative that examines the psychological impact of her experiences. Entering the House of Yahweh at just 15 years old and remaining for five years, she shares her story of isolation and indoctrination, detailing the complexities of marrying into the cult\u0027s leadership. As she recounts her struggles with the group\u0027s teachings, particularly the shift towards polygamy, Melody reflects on the emotional turmoil of reconciling her ingrained beliefs with her growing realization that she was trapped in a toxic environment. The transition from belief to disbelief was fraught with anxiety, leading her to a pivotal moment of excommunication that provided an unexpected exit. Her insights into the nuances of leaving a cult resonate deeply, illustrating the long road to recovery and the importance of self-acceptance during this process.\nMelody\u0027s current endeavors, including her Facebook group Cult Escape and Recovery, and the podcast Cultimatum, reflect her desire to support others on similar journeys. By offering a platform for survivors to share their stories, she fosters a sense of community and empowerment. The episode ultimately serves as a testament to resilience and the ongoing journey of healing, reminding listeners that recovery is not linear and that it\u0027s okay to take one’s time finding their way back to themselves.",
      "release": "2024-12-19T06:00:00Z",
      "duration": "00:56:48",
      "explicit": false,
      "spotifyId": "6Z29FayRS2F8kdv7aLRYLp",
      "appleId": 1000680929869,
      "youTubeId": "yL2rZmB3f8Y",
      "subjects": [
        "House of Yahweh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Z29FayRS2F8kdv7aLRYLp",
        "apple": "https://podcasts.apple.com/podcast/the-road-to-recovery-navigating-life-after-leaving-a-cult/id1744613549?i=1000680929869",
        "youtube": "https://www.youtube.com/watch?v=yL2rZmB3f8Y"
      }
    }
  ]
}