{
  "id": "f0ad1e7c-3b71-4e32-8ab5-8b2d9a76a670",
  "name": "En Société - France Télévisions",
  "youTubeChannelId": "UCZh4i5HT_r-9RcCOXMxuGiQ",
  "episodes": [
    {
      "id": "8f54b82e-2515-4035-bbda-fb306ca200c3",
      "title": "Epstein : L’affaire qui fait trembler les élites ? - En Société du 1er Février 2026",
      "description": "Une affaire tentaculaire, faite de sexe, d’argent et de pouvoir. Au centre, un homme qui, toute sa vie, n’a cessé de tisser des réseaux — des réseaux longtemps invisibles, aujourd’hui exposés au grand jour. Ces révélations éclaboussent les puissants. Des politiques, des milliardaires, des intellectuels, des artistes… Des femmes, des hommes qui à des degrés divers ont croisé la route de Jeffrey Epstein. Et tous paient aujourd’hui un prix. Celui de la suspicion. Celui de la réputation. Mais aussi celui d’une mise en accusation plus large : celle d’élites perçues comme dépravées, hors-sol, au-dessus des lois et de la morale. Car l’affaire Epstein dépasse largement le cas d’un prédateur sexuel. Elle devient le carburant d’un récit politique : celui de la faillite morale des élites, de leur entre-soi, et de leur impunité supposée. Alors l’affaire Epstein est-elle l’affaire idéale pour nourrir la haine des élites et le complotisme contemporain ?\n\n- Gloria ORIGGI Philosophe, chercheuse au CNRS, autrice de \u0022La vérité est une question politique\u0022 aux éditions Albin Michel (01.03.24)\n\n- Olivier TESQUET Journaliste à la cellule enquêtes de Télérama, spécialisé dans l’impact de la technologie sur la société, co-auteur de « Apocalypse Nerds » aux éditions Divergences (19.09.25)\n\n- Michaël LAINÉ Maître de conférences en économie à l\u0027université Paris-8, auteur de « L\u0027ère de la post-vérité. Comment les algorithmes changent notre rapport à la réalité » aux éditions de la Découverte (07.05.25)\n\n- Gisèle SAPIRO Sociologue, directrice de recherche au CNRS et directrice d\u0027études à l\u0027EHESS, directrice de l’ouvrage « Dictionnaire international Bourdieu» aux éditions CNRS (05.11.20)\n\n- Arthur POULIQUEN Docteur en sciences politiques, spécialiste de l’histoire des idées politiques et des radicalités, auteur de \u0022Le Monde ou rien\u0022 aux éditions du Cerf (15.05.25)",
      "release": "2026-02-08T21:59:57Z",
      "duration": "01:01:59",
      "explicit": false,
      "youTubeId": "lEtXPXGIzpM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lEtXPXGIzpM"
      }
    }
  ]
}