{
  "id": "548a3386-3a81-451e-b7f0-786a6fc5eacc",
  "name": "Encyclopaedia Britannica",
  "youTubeChannelId": "UCBA9cAuPy9L5IYYXqOduIvw",
  "episodes": [
    {
      "id": "a02db789-ae53-4231-bebd-c2f78ca7d73a",
      "title": "What\u0027s Really In The Epstein Files?",
      "description": "In December 2025 and January 2026, the Justice Department released millions of pages from the \u0022Epstein files.\u0022 But what are the Epstein files? What\u0027s in them? And what do we really know for sure? \n\nLearn more from Britannica:\nWhat Are the Epstein Files? A Timeline: https://britannica.com/topic/The-Epstein-Files-A-Timeline\nWhere Did Jeffrey Epstein Get His Money? https://britannica.com/topic/Where-Did-Jeffrey-Epstein-Get-His-Money\nWhere is Jeffrey Epstein\u0027s Island? https://britannica.com/question/Where-is-Jeffrey-Epsteins-island\nWhy Are Documents Classified? https://britannica.com/topic/Why-Are-Documents-Classified\nWho Was Jeffrey Epstein? https://britannica.com/question/Who-was-Jeffrey-Epstein\n\n~~~\r\n#EncyclopaediaBritannica\r\nInspiring curiosity and the joy of learning since 1768. \r\n\r\nWeb: https://britannica.com\r\nFacebook: https://facebook.com/Britannica\r\nTwitter: https://twitter.com/Britannica\r\nInstagram: https://instagram.com/Britannica\nBluesky: https://bsky.app/profile/britannica.com\n\n~~\nTranscript:\nBy now, you’ve heard the phrase “Epstein files.” But what are these files—and more importantly, what’s in them? The Epstein files include documents related to two criminal investigations into Jeffrey Epstein, an American financier who surrounded himself with the rich and powerful and a convicted sex offender. The files were initially sealed as part of an ongoing investigation. But in 2025 President Donald Trump—responding to public outcry and congressional pressure—finally agreed to release them. So what’s actually in the Epstein files? The evidence from both cases includes travel logs, employee lists, phone recordings, witness statements, emails, and photo and video evidence. In December 2025 and January 2026, the Justice Department released millions of pages. But many were heavily redacted, sparking more controversy. The Epstein files do not include a client list, according to the Department of Justice, despite speculation to the contrary. The Epstein files do contain names of Epstein’s friends and contacts—including those of famous figures from every walk of life—but their presence doesn’t prove criminal wrongdoing. Some of Epstein’s associates have already faced consequences because of the testimony of the estimated 1,000 women and girls abused by Epstein. Coconspirator Ghislaine Maxwell was sentenced to 20 years in prison for her part in Epstein’s sex trafficking operation. And the allegations made by Virginia Giuffre led to the British Prince Andrew being stripped of his royal title. Giuffre died by suicide in 2025. Despite the photos and documents that have been made public, the full picture of Epstein\u0027s operation remains murky. For now, questions remain.",
      "release": "2026-02-20T15:01:40Z",
      "duration": "00:01:59",
      "explicit": false,
      "youTubeId": "wNiNs30bkik",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wNiNs30bkik"
      }
    }
  ]
}