{
  "id": "3d1cbc05-ba2f-44bd-965a-6bc617d5b2cc",
  "name": "ENDEVR",
  "appleId": 1763227912,
  "youTubeChannelId": "UCuw0GgMlZlAsWvpI8PgCN8g",
  "episodes": [
    {
      "id": "aec6f2fe-9955-4166-985d-37f0bb0efea2",
      "title": "The Dark Side of the Scientology Cult | ENDEVR Documentary",
      "description": "It is one of the world’s most secretive and controversial cults… brought to light by one of Hollywood\u0027s biggest stars, Tom Cruise. Since its creation in 1953, Scientology has won millions of disciples, up to 40,000 in France alone, according to its leaders.\n\nScientologists follow the teachings of a former bestselling Science Fiction author, L. Ron Hubbard. They believe in reincarnation and undergo extraordinary practices to gain enlightenment. Scientology is also an institution plagued by headline-grabbing scandals when former members go public about their experiences with the sect. While it is recognized as a religion in some countries, others consider it a dangerous cult.\n\nHow does this organization, often convicted of fraud, manage to recruit and retain followers? What are its beliefs? Who was L. Ron Hubbard, its charismatic proto-messiah? How did Scientology become a recognized religion in the United States? And what influence does it have in France? Join experts and former high-ranking scientology members as they unmask one of the most powerful self-proclaimed religious organizations on the planet… the church of scientology. \n\n▬▬▬▬▬▬▬▬▬\nSubscribe ENDEVR for free: https://bit.ly/3e9YRRG\nFacebook: https://bit.ly/2QfRxbG\nInstagram: https://www.instagram.com/endevrdocs/\n▬▬▬▬▬▬▬▬▬\n#FreeDocumentary #ENDEVR #scientologist #scientologycult #tomcruise \n▬▬▬▬▬▬▬▬▬\nENDEVR explains the world we live in through high-class documentaries, special investigations, explainers videos and animations. We cover topics related to business, economics, geopolitics, social issues and everything in between that we think are interesting.",
      "release": "2024-11-27T14:00:55Z",
      "duration": "00:51:14",
      "explicit": false,
      "youTubeId": "wpCU-Y5i39U",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wpCU-Y5i39U"
      }
    },
    {
      "id": "5a560f3d-a4a0-4d78-9bb2-9081aed16b86",
      "title": "Cult Witness: The Harrowing Tales of People Who Escaped | ENDEVR",
      "description": "Cult Witness: The Harrowing Tales of People Who Escaped | ENDEVR\n\nDeadly Doomsday Cult - How a False Messiah Changed Japan Forever: https://youtu.be/ig4yr1YqA9U\n\nAt the age of 19 Samuel Stefan, consumed by crisis, was drawn into a cult. It would be 10 years before he was able to escape.\n\nUsing a technique called ‘love-bombing’ cults prey on the vulnerable, recruiting new members with love and warmth. After a period of brain-washing, members are forbidden to leave, enslaved through psychological control, and in Samuel’s case, even violence. He was finally able to escape in the dead of night, persued by other members and seek help.\n\nCult Witness is an intelligent exploration of how cults attract and manipulate their followers, sharing the disturbing firsthand experiences of Cult Witness director Samuel Stefan and six others who have freed themselves from cults: Jill Mytton (The Exclusive Brethren), Jim Bergin and Judy Garvey (The Gentle Wind Project), Lea Saskia Laasner (The Janus Project), and Celeste Jones and Amoreena Winkler (The Children of God).\n\nAnalytical insights into the cult experience are provided by leadership expert Betty Sue Flowers; Benjamin Zablocki, chair of the Department of Sociology at Rutgers University; UCLA Professor Emeritus Bertram Raven, an expert on interpersonal influence and social power relationships; psychotherapist Miguel Perlado, who specializes in cult-related problems; and Urs Eschmann, a specialist in legal issues involving cults.\n\nCult Witness unravels the hidden world of cults; the hold they have on their victims, the reasons people form and fall prey to them and what takes place within..\n▬▬▬▬▬▬▬▬▬\nSubscribe ENDEVR for free: https://bit.ly/3e9YRRG\nFacebook: https://bit.ly/2QfRxbG\nInstagram: https://www.instagram.com/endevrdocs/\n▬▬▬▬▬▬▬▬▬\n#FreeDocumentary #ENDEVR #cults\n▬▬▬▬▬▬▬▬▬\nENDEVR explains the world we live in through high-class documentaries, special investigations, explainers videos and animations. We cover topics related to business, economics, geopolitics, social issues and everything in between that we think are interesting.",
      "release": "2024-01-05T14:00:48Z",
      "duration": "00:56:10",
      "explicit": false,
      "youTubeId": "qNf4386T3xM",
      "subjects": [
        "Children Of God",
        "Cult Psychology",
        "Gentle Wind Project",
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qNf4386T3xM"
      }
    },
    {
      "id": "6dc35ee9-aa65-4e74-94c5-af4c1f791701",
      "title": "Deadly Doomsday Cult: How a False Messiah Changed Japan Forever | ENDEVR Documentary",
      "description": "One Day That Changed Asia: Tokyo Subway Sarin Gas Attack | Aum Shinrikyo Doomsday Cult | ENDEVR Documentary\n\nWatch \u0027One Day That Changed Asia: North Korean Air Attack\u0027 here: https://youtu.be/Jpg1uxltKpk\n\nTokyo, March 20, 1995. Subway commuters begin to choke and collapse. They\u0027ve been poisoned with sarin gas. Disciples of an obscure New Religion have decided they need to kill all of humanity to save mankind. How did this happen and why?\n\nIn just one day, whole worlds can change. Lives can be lost or saved, futures ruined or restored. This series features stories of mortal danger, terror and loss, redemption and hope, that happened over One Day That Changed Asia.\n▬▬▬▬▬▬▬▬▬\nSubscribe ENDEVR for free: https://bit.ly/3e9YRRG\nFacebook: https://bit.ly/2QfRxbG\nInstagram: https://www.instagram.com/endevrdocs/\n▬▬▬▬▬▬▬▬▬\n#FreeDocumentary #ENDEVR #cult\n▬▬▬▬▬▬▬▬▬\nENDEVR explains the world we live in through high-class documentaries, special investigations, explainers videos and animations. We cover topics related to business, economics, geopolitics, social issues and everything in between that we think are interesting.",
      "release": "2022-10-26T13:00:46Z",
      "duration": "00:46:29",
      "explicit": false,
      "youTubeId": "ig4yr1YqA9U",
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ig4yr1YqA9U"
      }
    },
    {
      "id": "62fc1a05-ef0e-44b0-a444-7a10b43be84e",
      "title": "Jewish Scandal: Ultra-Orthodox Family Breaks Code of Silence | ENDEVR Documentary",
      "description": "Jewish Scandal: Ultra-Orthodox Family Breaks Code of Silence | ENDEVR Documentary \n\nWatch the follow-up Documentary \u0027Breaking the Silence\u0027 here: https://youtu.be/wfmjde_qMl0\n\nWatch \u0027Sins of the Church: The Disturbing Transfer of Fallen Priests\u0027 here: https://youtu.be/VCyWx73ThWA\n\nCode of Silence follows the parallel journeys of a fervently Orthodox Jewish father and his now-secular son, after the son Manny breaks the code of silence in Melbourne’s Orthodox community and goes public with his story about being abused as a student. Manny Waks demands the perpetrators be brought to justice, as well as the rabbis, whom he claims covered it up.\n\nHis father Zephaniah joins forces with his son, but soon finds he has been virtually excommunicated for breaking an ancient Jewish law forbidding Jews from informing secular authorities about other Jews.\n\nWe see how father and son split this tightly-knit, powerful Jewish community as we open the door into their insular world of study and duty, charity and faith, power and piety.\n\nWill Manny get justice in court? Will the rabbis be held to account? And, what price will the father and son pay for blowing the whistle?\n▬▬▬▬▬▬▬▬▬\nSubscribe ENDEVR for free: https://bit.ly/3e9YRRG\nFacebook: https://bit.ly/2QfRxbG\nInstagram: https://www.instagram.com/endevrdocs/\n▬▬▬▬▬▬▬▬▬\n#FreeDocumentary #ENDEVR #CodeOfSilence\n▬▬▬▬▬▬▬▬▬\nENDEVR explains the world we live in through high-class documentaries, special investigations, explainers videos and animations. We cover topics related to business, economics, geopolitics, social issues and everything in between that we think are interesting.",
      "release": "2022-06-26T13:00:54Z",
      "duration": "00:56:00",
      "explicit": false,
      "youTubeId": "eJ7Gixv33ns",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eJ7Gixv33ns"
      }
    },
    {
      "id": "ceec7614-d205-4836-9166-48f8192e784f",
      "title": "Meet the Mennonites: Inside the Ultra-Conservative Community | ENDEVR Documentary",
      "description": "Meet the Mennonites: Inside the Ultra-Conservative Community | Investigative Documentary \n\nWatch \u0027The Last Free Place in America: Slab City\u0027 here: https://youtu.be/IFRBdZ9jdyQ\n\nLike the Amish, the ultra-conservative Christian community of the Mennonites rejects modern society and lives a life frozen in the 19th century. Nearly all Mennonites live in self-sufficient colonies, embracing isolation, which helps protect them from the temptations of the modern world. Now, for the first time, one of these communities has agreed to open their doors to our cameras.\nAt first sight, time seems to have stopped in the colony of Little Belize, in South America. People travel around on horse-drawn carriages and still speak Plattdeutsch, an old German dialect. But even here, signs of the outside world are creeping in. Wilhelm, the community’s former doctor, was recently expelled for owning a mobile phone. Fearing their community is being tainted, some traditional members, like Abram and his family, have decided to create a new colony, even more isolated, in the jungle of Peru, where they can remain true to their original doctrine.\nWe follow them on their exodus and take an unprecedented look at the world of the Mennonites.\n\n▬▬▬▬▬▬▬▬▬\n\nSubscribe ENDEVR for free: https://bit.ly/3e9YRRG\nJoin the club and become a Patron: https://www.patreon.com/freedocumentary\nFacebook: https://bit.ly/2QfRxbG\nInstagram: https://www.instagram.com/endevrdocs/\n\n▬▬▬▬▬▬▬▬▬\n#FreeDocumentary #ENDEVR #Mennonites\n▬▬▬▬▬▬▬▬▬\n\nENDEVR explains the world we live in through high-class documentaries, special investigations, explainers videos and animations. We cover topics related to business, economics, geopolitics, social issues and everything in between that we think are interesting.",
      "release": "2021-10-27T13:00:28Z",
      "duration": "00:51:42",
      "explicit": false,
      "youTubeId": "yWfGXOjBF2E",
      "subjects": [
        "Mennonite"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yWfGXOjBF2E"
      }
    }
  ]
}