{
  "id": "cc4fa6b8-c074-43d4-9370-371a3d43f4d1",
  "name": "Enlightened Empowered Evolved Podcast",
  "spotifyId": "6SzKAvHbtZWiGHdLyg6a0z",
  "appleId": 1680828987,
  "episodes": [
    {
      "id": "f1039232-8ebb-47a3-90c1-9274d0b5af6b",
      "title": "The Source Family - Wendy Baker  - My Name Was Mushroom",
      "description": "Wendy Baker is a former member of Los Angeles based cult The Source Family that began on Sunset Blvd by Jim Baker, an award-winning author of her memoir My Name Was Mushroom: My Life as a Teenage Runaway in The Source Family Commune, and successful entrepreneur running an insurance agency, in Malibu with her husband, Bart Baker and their wonderful employees. In her spare time, she loves to spend time with her 3 children and 4 grandchildren as well as volunteer at the Women\u0026#39;s and Children\u0026#39;s Shelter in Oxnard, California. She\u0026#39;s passionate about helping women tell their stories and especially excited to help teenage mothers succeed in life and become inspired to begin their own journeys to success as she knows how hard it can be! My Name Was Mushroom Overview\r\n \r\nWendy Baker has written a wonderful memoir about her time in The Source Family Commune. She takes us on a journey through the 1960s and 70s filled with love-ins in Hollywood and Sunset Blvd., hippie communal living, and survival in wilderness environments. She begins at just 12 years old in a time where drugs, sex, and rock \u0026amp; roll were taking over the world and\r\n \r\nfreedom filled the air. She sets the scene of her family life and the freedom she had to hitchhike with friends across California while meeting celebrities like they were meeting new friends at the park. She even reveals the boy that started her on her quest, the blonde-haired son of Jim Baker.\r\n \r\nJim Baker, otherwise known as Father Yod, Yahowah, etc. opened The Source in 1969 as the first vegan health food restaurant in LA and it quickly became one of the most influential restaurants of its time. It was visited by The Beatles, Cher, and Woody Allen even parodied it in the 1977 movie, Annie Hall! The Source Restaurant quickly became the beginning of The\r\n \r\nSource Family Commune led by none other than Jim Baker, becoming a magnet for lost souls searching for something more. As it grew, the spiritual group even started a band starring Jim Baker, called YaHoWa-13. They used marajuana for morning meditation, made their own clothes out of flowing white cloth, ate a vegan diet, lived in the same home, and followed the word and commandments of their leader. In order to become a member of The Source Family, the member had to undergo a physical and\r\n \r\nmental cleanse to become “pure” and be given a new name by Father Yod. When Wendy ran away from home at 14 and joined The Family, she was renamed 4 times by Yahowa, but the name that lasted the longest was Mushroom. Her cleanse also became a near death experience that empowered her beliefs in Father Yod. Although her mother was negligent, she did not approve of Wendy becoming a part of The Source Family and battled her in court. It was due to this that Wendy became a fugitive of justice from the state of California, assisted in hiding from the state officials by Father Yod and The Family. While enthralled with the spirituality and belief system of the cult group, she fell in love and had a baby at the age of 16. Her journey then turned to survival and motherhood. The Family traveled back and forth between California and Hawaii on what they were told was a search for spiritual peace, but they often found themselves\r\n \r\nhomeless and starving. Wendy had many questions regarding her pregnancy, relationships, and her place in the universe. She began to question the path they were being led down. Father Yod had changed, something had shifted, and things with The Family were not what they once were. After his demise, the group was not the same. Due to her own growth in her spirituality, personal truth, and will-power, Wendy escaped at 19. She reintegrated herself into society as a single mother, reconnected with her one true love, and became a successful businesswoman, wife,\r\n \r\nmother, and grandmother now living in Malibu, California. Although it took a long time, Wendy has overcome this part of her life and is finally ready to\r\n \r\nshare her story in hopes of inspiring others who have been through similar situations. Wendy lives in Malibu with her husband and enjoys her time with her kids and grand kids. Her story is an amazing coming of age journey with a unique perspective on cult groups and commune living. But most of all, it\u0026#39;s a story of overcoming both physical and spiritual obstacles, emotional and physical trauma, and being strong enough to follow her own path to become the best version of herself that she can be and inspiring others to do the same!\r\n \r\nWendy Baker\u0026#39;s book -. https://www.amazon.com/My-Name-Was-Mushroom-Teenage/dp/0996055266?ref\u0026#61;d6k_applink_bb_dls\u0026amp;dplnkId\u0026#61;5cdc6de9-6bfe-49d9-a9b1-8fa1d2f93c1b\r\n \r\nWebsite: wendybakerauthor.com\r\n \r\nEmail: mushroomaquarian\u0026#64;gmail.com\r\n \r\nFacebook: Wendy Baker Author\r\n \r\nInstagram: \u0026#64;wendybakerauthor\r\n \r\nTikTok: \u0026#64;wendybakerauthor\r\n \r\nEnlightened Empowered Evolved Podcast Also On -\r\n \r\nPandora\r\n \r\nStitcher\r\n \r\nSpotify\r\n \r\nAmazon\r\n \r\nApple Podcasts\r\n \r\nhttps://podcasts.apple.com/us/podcast/enlightened-empowered-evolved-podcast/id1680828987",
      "release": "2024-02-10T22:33:40Z",
      "duration": "00:32:49.2790000",
      "explicit": false,
      "spotifyId": "3XVTTAxOlnj6al7yEyY9Nj",
      "appleId": 1000644895594,
      "subjects": [
        "The Source Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XVTTAxOlnj6al7yEyY9Nj",
        "apple": "https://podcasts.apple.com/podcast/the-source-family-wendy-baker-my-name-was-mushroom/id1680828987?i=1000644895594"
      }
    }
  ]
}