{
  "id": "fed9b33e-d692-4c28-a0eb-3862d30d27c1",
  "name": "enough.",
  "spotifyId": "7Etrhryz66HdVQ7YeEeCrj",
  "appleId": 1576357376,
  "episodes": [
    {
      "id": "ed320c46-e075-4436-918d-9e999ca6dc18",
      "title": "80. Subtext: Jared Leto: Method to Madness",
      "description": "In this episode, Kendra and Rich dive deep into the disturbing allegations against actor and musician Jared Leto. From his rise in My So-Called Life to fronting 30 Seconds to Mars with its cult-like fanbase, Leto’s decades-long pattern of predatory behavior is finally under the microscope after recent accusations from nine women, many of whom were underage when the abuse occurred. In 2025, we are interested in talking to teachers, authors, artists, activists, counselors, community organizers, and anyone else who is dedicated to making a positive impact in their music community and our society as a whole. If that sounds like you, please reach out to us at ⁠⁠thisisenoughpodcast@gmail.com⁠⁠ . Visit our website: ⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.thisisenoughpodcast.com⁠⁠⁠⁠⁠⁠⁠⁠⁠ Follow us on Instagram: ⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.instagram.com/enough.podcast⁠⁠⁠⁠⁠⁠⁠⁠⁠ Watch this episode on YouTube: ⁠⁠⁠⁠⁠⁠⁠⁠⁠https://www.youtube.com/@enoughpodcast⁠⁠⁠⁠ REFERENCES Nine women accuse Jared Leto of sexual impropriety in new report ( The Guardian ) Jared Leto Accused of Sexual Misconduct by Multiple Women, Including Some Who Say They Were Underage, as Actor Denies Allegations ( People ) Jared Leto’s ‘Oscar-worthy’ movie on hold due to allegations: Source ( News Nation ) The Twisted Cult of Jared Leto ( YouTube ) Escaping the \u0022Cult\u0022 of Mars ( Vocal ) Jared Leto Is Running a Cult Straight Out of a True Crime Docuseries ( MovieWeb )",
      "release": "2025-07-23T11:00:00Z",
      "duration": "00:36:08.8850000",
      "explicit": true,
      "spotifyId": "59S3jCRuDi5wM8txLDJQpQ",
      "appleId": 1000718668435,
      "subjects": [
        "Jared Leto"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/59S3jCRuDi5wM8txLDJQpQ",
        "apple": "https://podcasts.apple.com/podcast/80-subtext-jared-leto-method-to-madness/id1576357376?i=1000718668435"
      }
    }
  ]
}