{
  "_ts": 0,
  "id": "25f88a76-cf14-40e1-934f-9cb577bbbf40",
  "name": "Erin Bies",
  "youTubeChannelId": "UCYVGhyc-V7c7bu2pgwqrBeQ",
  "episodes": [
    {
      "id": "0f4a5787-66d5-40ba-9b20-0605d9f44c44",
      "title": "Revealing the Truth: A Former Monat Rep Uncovers the MLM Cult Behind the Scenes #antimlm",
      "description": "In this revealing video, a former Monat rep steps forward to uncover the hidden realities of the MLM cult tactics used by the company. From manipulative recruitment strategies to misleading income promises, discover how Monat operates in the shadows. Whether you’re curious about the predatory MLM world or seeking the truth behind Monat, this video has the answers. Protect yourself from deceptive multi-level marketing schemes.\n\n🔔 Be sure to like, comment, and subscribe for more hard-hitting anti-MLM content!\n\nVideo Credit: @Kelsiielizabeth https://www.youtube.com/watch?v=yGIYNkFhrDw\n\n#MonatUncovered #MLMCult #AntiMLM #MonatScam #PyramidScheme #MLMTruth #StopMLM #MonatExposed #CommercialCult #MLMFail #MLMSurvivor\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCYVGhyc-V7c7bu2pgwqrBeQ/join\n\nFTC Information about MLM: https://consumer.ftc.gov/articles/multi-level-marketing-businesses-pyramid-schemes\n\nReport Fraud, Medical Claims and Health Claims to the FTC: https://reportfraud.ftc.gov/#/\n\nContact me at www.ErinBies.com\n\n** This video was created and published for educational purposes. All opinions are mine and based on my own experiences. Please do not send any hate or negativity to anyone involved in an MLM. The best thing you can do to support them is to listen, be kind and connect them to resources so they can make their own decisions. Not everyone involved with an MLM is a bad person. They are very much a victim of their upline and company that have manipulated them to make money, in my opinion. Everything shared in this video and on this account are protected under the Fair Use Act. **",
      "release": "2024-09-23T19:00:13Z",
      "duration": "00:36:23",
      "explicit": false,
      "youTubeId": "N2AN6hVaR0M",
      "subjects": [
        "Multi-Level Marketing",
        "Monat"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=N2AN6hVaR0M"
      }
    }
  ]
}