{
  "_ts": 0,
  "id": "c28d7956-3422-47e9-84a5-2e54a77f3db4",
  "name": "Escaping Paradise",
  "youTubeChannelId": "UCpYxpyWSXmMlQAEOH9zbpFQ",
  "episodes": [
    {
      "id": "9021e5e3-c8e2-41d0-a0a0-3c8a8377fc81",
      "title": "Episode 2: Leaving the Cult",
      "description": "In this powerful second episode, we explore the deeply personal experiences of those who have left the Jehovah’s Witnesses. Join Kyle, Shelley, and guests as they discuss:\n\nThe emotional and psychological toll of leaving a high-control group.\nStrategies for exiting, including navigating family relationships and community loss.\nHeartfelt stories of resilience, healing, and rebuilding a life outside the organization.\nTrigger Warning: This episode includes discussions of trauma, suicidal thoughts, sexual assault, family estrangement, and mental health struggles. Viewer discretion is strongly advised.\n\nIf you or someone you know is considering leaving a high-control group, or if you are dealing with the aftermath of such an experience, please reach out for support. Resources and support networks are linked below to help you on your journey.\n\nResources for those escaping:\nr/exjw: A reddit supportive community for former Jehovah’s Witnesses.\nLearn more: https://www.jwfacts.com\nFaith to Faithless: https://www.faithtofaithless.com/",
      "release": "2025-02-13T18:03:36Z",
      "duration": "00:47:20",
      "explicit": false,
      "youTubeId": "Jc5JCQDpgTA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Jc5JCQDpgTA"
      }
    },
    {
      "id": "3d3b6831-3c0f-494b-81f5-8df94795bab0",
      "title": "Episode 1: Understanding the Jehovah\u0027s Witnesses Cult",
      "description": "In this debut episode, we dive deep into the origins of the Jehovah’s Witnesses, uncovering the historical roots of this high-control group and exploring its evolution into the organization it is today. Join Kyle and guest Ray as they discuss:\n\nThe founding of the Jehovah\u0027s Witnesses by Charles Taze Russell and its early influences.\nSignificant transformations under leaders like Joseph Rutherford.\nThe organization\u0027s unique doctrines, policies, and their lasting impact on members.\nWe also touch on the controversial practices of shunning, gender inequality, and their stance on blood transfusions. Whether you’re a current or former member, or simply curious about high-control groups, this episode offers valuable insights.\n\nResources for those escaping:\nr/exjw: A reddit supportive community for former Jehovah’s Witnesses.\nLearn more: https://www.jwfacts.com\nFaith to Faithless: https://www.faithtofaithless.com/",
      "release": "2025-01-31T20:29:24Z",
      "duration": "00:42:45",
      "explicit": false,
      "youTubeId": "HgkX9o7eTLM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HgkX9o7eTLM"
      }
    }
  ]
}