{
  "_ts": 0,
  "id": "cfd50c77-5ef5-43e7-905d-416f2d09f72b",
  "name": "Escaping The Rabbit Hole",
  "spotifyId": "6ACb7LO9dpuO04c6kQTIEK",
  "appleId": 1694998960,
  "episodes": [
    {
      "id": "0f9f59ca-be6f-497c-a0be-2eae13080f3a",
      "title": "How a religious extremist left her cult and reprogrammed her beliefs",
      "description": "Episode Summary In this epsiode, my guest and I talk about her life in a religious cult. As well how she managed to escape. Quotes We Loved The Power of Self-Belief: “The thing or the, what’s wrong in society is that are believing the lie that they’re not enough.”— Chantelle Neufeld [00:04:29 → 00:04:36] Reprogramming Beliefs and Shifting Mindset: “I just did it a little bit at a time…When I started on that path to recognize it, and then shift to the path of what I wanted to see, what I wanted to feel, what I wanted to experience, what I wanted to create.”— Chantelle Neufeld [00:21:43 → 00:21:52] The Power of Personal Choice: “We’re no better than the brainwashing people in cults if we’re just trying to brainwash everybody into thinking our opinion is right and theirs is wrong.”— Chantelle Neufeld [00:26:45 → 00:27:51] Perfectionism and Social Anxiety: “The number one thing that’s the problem with most cult survivors is actually social anxiety. The root of that is also feeling not enough.”— Chantelle Neufeld [00:31:18 → 00:31:25] The Power of Deep Breaths: “The deep breaths, I think, is across board, everybody can agree that that’s a good thing because it’s so easy to do, and it’s easy to remember, and once you’ve taken those deep breaths, you’re settling into your own kinda trance where you can recognize when there’s a thought or feeling that isn’t being helpful to you and you can pivot towards your preferences and be like, I prefer this instead. Right?”— Chantelle Neufeld [00:39:46 → 00:40:10] The Power of Attention: “we really need to realize that attention is, like, our highest currency, but that we have always a choice to direct our focus to what we want.”— Chantelle Neufeld [00:46:02 → 00:46:09] Guest Bio \u0026 Links https://www.chantellen.com/ Chantelle’s Facebook Page Chantelle’s Instagram page",
      "release": "2023-10-11T18:41:44Z",
      "duration": "00:55:10.3060000",
      "explicit": false,
      "spotifyId": "3aeNzTMBQHVKeAeSyvXVa9",
      "appleId": 1000631055909,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3aeNzTMBQHVKeAeSyvXVa9",
        "apple": "https://podcasts.apple.com/podcast/how-a-religious-extremist-left-her-cult/id1694998960?i=1000631055909"
      }
    }
  ]
}