{
  "id": "c28d7956-3422-47e9-84a5-2e54a77f3db4",
  "name": "Escaping Paradise",
  "youTubeChannelId": "UCpYxpyWSXmMlQAEOH9zbpFQ",
  "episodes": [
    {
      "id": "62efd7bd-696d-43b2-bea9-392b195d4f13",
      "title": "Episode 4: Building a Support System",
      "description": "In this episode, Kyle, Shelley, and Ben dive into the importance of building a support network after leaving high-control groups like the Jehovah’s Witnesses. Topics include:\n\nHow to start creating a network from scratch after losing your previous community\nThe power of vulnerability and shared experiences in fostering genuine friendships\nPractical tools like apps, meetups, and online communities for finding support\nResources for specialized support, including LGBTQ\u002B and youth-specific assistance\nInsights into balancing quality over quantity when rebuilding your social circle\nSpecial Mention: This episode highlights resources like Stonewall, Faith to Faithless, Mind, and Reddit\u0027s ex-Jehovah\u0027s Witnesses community as valuable starting points for those looking to connect and heal.\n\nTrigger Warning: This episode contains discussions about trauma, shunning, and the challenges of rebuilding after leaving a high-control group. Listener discretion is advised.",
      "release": "2025-03-17T17:35:30Z",
      "duration": "00:21:51",
      "explicit": false,
      "youTubeId": "BMIZ1u0X5w0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BMIZ1u0X5w0"
      }
    },
    {
      "id": "fb93dc60-210c-4959-bddc-0c7810fc522f",
      "title": "Episode 3: Dealing with Trauma",
      "description": "In this heartfelt two-part episode, Kyle, Shelley, and guest therapist Claire Alison Hams discuss the impact of trauma and its long-lasting effects on individuals who leave high-control groups like the Jehovah’s Witnesses. Topics include:\n\nUnderstanding trauma and its manifestations (PTSD vs. CPTSD)\nHow trauma can affect physical and mental health\nThe role of therapy in recovery, including EMDR and other methods\nPractical strategies for managing triggers and setting boundaries\nInsights into recovery, healing, and building a healthier future\nTrigger Warning: This episode contains discussions of trauma, mental health struggles, and emotional challenges. Listener discretion is advised.\n\nA Note to Our Listeners: We apologize for the audio quality on Kyle\u0027s microphone in this episode due to unexpected technical difficulties. These issues have been resolved for future recordings, and we appreciate your understanding.\n\nAdditional Resources for Recovery:\n\nFaith to Faithless: https://www.faithtofaithless.com\nFreedom of Mind Resource Center: https://freedomofmind.com\nRecovering from Religion: https://www.recoveringfromreligion.org\nThe Book: https://www.routledge.com/Walking-Free-from-the-Trauma-of-Coercive-Cultic-and-Spiritual-Abuse-A-Workbook-for-Recovery-and-Growth/Jenkinson/p/book/9781032305875?source=shoppingads\u0026locale=en-USD\u0026gad_source=4\u0026gclid=Cj0KCQiAqL28BhCrARIsACYJvkcn8c7k-8aluhYK2g4DkIORJo6EjrZL66P3AongfB42NxMiM45j2FcaAnE9EALw_wcB",
      "release": "2025-02-27T15:50:53Z",
      "duration": "00:31:07",
      "explicit": false,
      "youTubeId": "aC7JcIdJ4es",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aC7JcIdJ4es"
      }
    },
    {
      "id": "9021e5e3-c8e2-41d0-a0a0-3c8a8377fc81",
      "title": "Episode 2: Leaving the Cult",
      "description": "In this powerful second episode, we explore the deeply personal experiences of those who have left the Jehovah’s Witnesses. Join Kyle, Shelley, and guests as they discuss:\n\nThe emotional and psychological toll of leaving a high-control group.\nStrategies for exiting, including navigating family relationships and community loss.\nHeartfelt stories of resilience, healing, and rebuilding a life outside the organization.\nTrigger Warning: This episode includes discussions of trauma, suicidal thoughts, sexual assault, family estrangement, and mental health struggles. Viewer discretion is strongly advised.\n\nIf you or someone you know is considering leaving a high-control group, or if you are dealing with the aftermath of such an experience, please reach out for support. Resources and support networks are linked below to help you on your journey.\n\nResources for those escaping:\nr/exjw: A reddit supportive community for former Jehovah’s Witnesses.\nLearn more: https://www.jwfacts.com\nFaith to Faithless: https://www.faithtofaithless.com/",
      "release": "2025-02-13T18:03:36Z",
      "duration": "00:47:20",
      "explicit": false,
      "youTubeId": "Jc5JCQDpgTA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Jc5JCQDpgTA"
      }
    },
    {
      "id": "3d3b6831-3c0f-494b-81f5-8df94795bab0",
      "title": "Episode 1: Understanding the Jehovah\u0027s Witnesses Cult",
      "description": "In this debut episode, we dive deep into the origins of the Jehovah’s Witnesses, uncovering the historical roots of this high-control group and exploring its evolution into the organization it is today. Join Kyle and guest Ray as they discuss:\n\nThe founding of the Jehovah\u0027s Witnesses by Charles Taze Russell and its early influences.\nSignificant transformations under leaders like Joseph Rutherford.\nThe organization\u0027s unique doctrines, policies, and their lasting impact on members.\nWe also touch on the controversial practices of shunning, gender inequality, and their stance on blood transfusions. Whether you’re a current or former member, or simply curious about high-control groups, this episode offers valuable insights.\n\nResources for those escaping:\nr/exjw: A reddit supportive community for former Jehovah’s Witnesses.\nLearn more: https://www.jwfacts.com\nFaith to Faithless: https://www.faithtofaithless.com/",
      "release": "2025-01-31T20:29:24Z",
      "duration": "00:42:45",
      "explicit": false,
      "youTubeId": "HgkX9o7eTLM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HgkX9o7eTLM"
      }
    }
  ]
}