{
  "id": "7184bcd3-0b4d-4c11-bc24-654f98f2c800",
  "name": "Esther Rockett",
  "youTubeChannelId": "UCAEgSnThJAZJSd2YFWnHvFQ",
  "episodes": [
    {
      "id": "84ba4e91-75b2-40fc-b5fd-bb1121a5c04d",
      "title": "Universal Predator - Esther Rockett reads the first 2 chapters of her memoir",
      "description": "Esther Rockett reads the first two chapters of her memoir \u0027Universal Predator: A Lone Woman\u0027s Fight To Expose Serge Benhayon and his Universal Medicine Cult - The Inside Story\u0027.\n\nAvailable now in paperback and eBook worldwide from Amazon, Kobo, Apple Books and more. Visit https://books2read.com/universal-predator to find your preferred retailer or ask for it at your local bookstore. \n\n\u0027Universal Predator\u0027 is the incredible true story of Esther\u0027s campaign to expose Serge Benhayon, the multimillionaire leader of Universal Medicine — a female-focused \u0027esoteric healing\u0027 enterprise marketing dubious services like Esoteric Breast Massage.\n \nEsther recounts her creepy first encounters with the former tennis coach and self-styled guru that lead her to investigate and blog about his operations. Her efforts to uncover his lucrative industry of exploitation bring fierce retaliation from his fanatical followers — devotee doctors and lawyers among them — who go all out to shut her down. \n\nWhen Benhayon sues her for defamation, she struggles with scarce resources to get her defence to trial.\n\nTold in Esther\u0027s inimitably incisive style, Universal Predator is a David and Goliath tale for the internet age: a true account of one woman\u0027s battle against a patriarchal money-raking cult. A post-New Age MeToo story, it\u0027s also a riveting courtroom drama. \n\nNo one can predict what will happen when the slippery manipulator enters the witness box in the Supreme Court of New South Wales and faces questions from Esther’s veteran criminal and defamation lawyer Tom Molomby SC.",
      "release": "2024-06-19T09:27:45Z",
      "duration": "00:14:24",
      "explicit": false,
      "youTubeId": "mcqETL6UlA0",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mcqETL6UlA0"
      }
    },
    {
      "id": "26cbccdd-df9f-40f1-8345-a191d17815ce",
      "title": "Defamation in Australia with Esther Rockett - Part 1 - the law",
      "description": "Don\u0027t get sued for defamation!\n\nEsther Rockett is not a lawyer. She is the successful defendant of defamation cases brought against her by cult leader Serge Benhayon and associates. It was a three year legal battle and for over a year of that Esther was not represented by a solicitor.\n\nPublishing controversial material in Australia carries a high risk of litigation, which can come with huge financial consequences. Esther was bankrupted by the proceedings and although she won, she won\u0027t be compensated for all of the costs of defending her publications.\n\nThese talks are not a substitute for advice from a qualified legal professional. Esther recommends Peter O\u0027Brien, Stewart O\u0027Connell and associates at O\u0027Brien Criminal and Civil Solicitors https://obriensolicitors.com.au/\n\nIn part one, Esther talks through some of the technical points of Australia\u0027s complicated defamation laws. The talk is aimed mostly at publishers and helping them understand the legal process, the things they need to consider before publishing, and how to protect themselves in case they are sued. But it might also be useful to people who believe they\u0027ve been defamed, and want to understand more about the legal avenues available to them, and the defences available to publishers. \n\nCHAPTERS \n01:50 Crash course - how to avoid being sued\n04:18 Benhayon v Rockett intro \n06:16 Planning for publishing\n07:03 Defamation as censorship SLAPP \n08:16 Civil and criminal actions for defamation\n10:41 What is defamation? Objectives of defamation law\n11:50 What is publication?\n13:16 The plaintiff has to be identifiable within the publication\n13:56 Most corporations can\u0027t sue for defamation. Companies can sue for injurious falsehood\n15:36 Defamatory imputations as understood by the ordinary reasonable person\n22:16 Damages \n23:17 The risk of making MeToo allegations\n24:27 Mitigation of damages \u0026 out of court settlements\n26:09 Defence of truth  28:00 Civil burden of proof\n30:02 Defence of triviality\n30:38 Defences of absolute privilege, publication of public documents, fair report of proceedings etc.\n32:28 Defence of qualified privilege for provision of certain information (reasonableness)\n35:23 Defence of qualified privilege defeated by malice (includes \u0027wilful blindness\u0027)\n37:12 Defence of qualified privilege at common law (repy to attack)\n37:50 Defence of honest opinion (based on proper material)  41:36 Questions to jury to test honest opinion defence \n44:05 When not to publish - eg. Alan Jones \u0026 2GB ordered to pay aggravated damages for malicious defamation\n\nIn PART TWO, Esther talks through six disputes that show how the legal process works and the consequences for failed claims and defences. It illustrates technical points of Australian defamation law discussed in part one.  \nWatch part two https://youtu.be/zfUCgg_-BL8\n\nLINKS\n\nEsther\u0027s Benhayon v Rockett victory blog\nhttps://factsaboutuniversalmedicine.wordpress.com/2018/11/18/benhayon-v-rockett-victory-at-last-the-way-forward/ \n\nDefamation Act 2005 \nhttp://www8.austlii.edu.au/cgi-bin/viewdb/au/legis/nsw/consol_act/da200599/ \n\nThe Arts Law Centre of Australia has a very good information sheet on defamation law \nhttps://www.artslaw.com.au/information-sheet/defamation-law/\n\nBlogging \u0026 Tweeting Without Getting Sued by Prof. Mark Pearson \nhttps://journlaw.com/books-by-mark-pearson/blogging-and-tweeting-without-getting-sued/\n\nDo you need a lawyer? Esther recommends Peter O\u0027Brien, Stewart O\u0027Connell and associates at O\u0027Brien Criminal and Civil Solicitors https://obriensolicitors.com.au/\n\nTheme Music - Orchestral Suite #1 in C, BWV1066  Bourée 1 \u0026 2, JS Bach",
      "release": "2019-10-20T15:16:57Z",
      "duration": "00:47:58",
      "explicit": false,
      "youTubeId": "LHfOXGdOohU",
      "subjects": [
        "Universal Medicine",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LHfOXGdOohU"
      }
    },
    {
      "id": "02b83717-66f7-4df8-8564-a6d569885015",
      "title": "Defamation in Australia with Esther Rockett - Part 2 - cases",
      "description": "Don\u0027t get sued for defamation!\n\nEsther Rockett is not a lawyer. She is the successful defendant of defamation cases brought against her by cult leader Serge Benhayon and associates. It was a three year legal battle and for over a year of that Esther was not represented by a solicitor and had to fend for herself.\n\nPublishing controversial material in Australia carries a high risk of litigation - which can come with huge financial consequences. \n\nIn part two, Esther talks through six cases or disputes that show how the legal process works and the consequences for failed claims and defences. It illustrates technical points of Australian defamation law discussed in part one. \n\nCHAPTERS \n02:35 Twitter defamation of teacher - $105k award of damages\n06:10 Milne v Ell - Shire Councillor v Property Developer - failed defence of honest opinion\n12:54 Email about mailbox dispute - $120k award of damages including aggravated damages [SEE BELOW FOR APPEAL UPDATE]\n22:49 Malicious defamation of respected surgeon, contempt of court conviction\n29:32 Don Burke - defamatory imputation not conveyed\n35:24 Sports scientist Stephen Dank - no award of damages \n\nIn PART ONE Esther talked about some of the critical points of defamation law. \nWatch Part one: https://youtu.be/LHfOXGdOohU\n\nLINKS\nEsther\u0027s Benhayon v Rockett victory blog\nhttps://factsaboutuniversalmedicine.wordpress.com/2018/11/18/benhayon-v-rockett-victory-at-last-the-way-forward/ \n\nDefamation Act 2005 \nhttp://www8.austlii.edu.au/cgi-bin/viewdb/au/legis/nsw/consol_act/da200599/ \n\nThe Arts Law Centre of Australia has a very good information sheet on defamation law \nhttps://www.artslaw.com.au/information-sheet/defamation-law/\n\nDo you need a lawyer? Esther recommends Peter O\u0027Brien and associates at O\u0027Brien Criminal and Civil Solicitors https://obriensolicitors.com.au/\n\nDefamation of teacher - $105k award of damages\nhttps://www.caselaw.nsw.gov.au/decision/54a63cd93004de94513db98f\n\nMilne v Ell - Shire Councillor v Property Developer\nhttps://www.caselaw.nsw.gov.au/decision/590c359de4b0e71e17f59593\n\nEmail about mailbox dispute - $120k award of damages\nhttps://www.caselaw.nsw.gov.au/decision/5cde5a5ce4b02a5a800c0e97\nOverturned on appeal https://www.caselaw.nsw.gov.au/decision/5dc504afe4b0ab0bf6073bfb\n\nDefamation of surgeon, contempt of court convictions\nhttps://www.caselaw.nsw.gov.au/decision/5cc267f8e4b0196eea406764\n\nDon Burke - not credible\nhttps://courts.act.gov.au/__data/assets/pdf_file/0005/1381343/Dent.pdf \n\nSports scientist Stephen Dank - no damages\nhttps://www.caselaw.nsw.gov.au/decision/56eb6b82e4b0e71e17f5065c\n\nTheme Music - Brandenburg Concerto #6 Allegro J.S. Bach",
      "release": "2019-10-20T15:16:48Z",
      "duration": "00:42:29",
      "explicit": false,
      "youTubeId": "zfUCgg_-BL8",
      "subjects": [
        "Universal Medicine",
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zfUCgg_-BL8"
      }
    },
    {
      "id": "5e3780c5-8f08-444c-8c87-b4259a016563",
      "title": "Universal Medicine in the NSW Northern Rivers - talk by Esther Rockett",
      "description": "Esther Rockett\u0027s talk in Lismore NSW, Australia, March 2019, on the Universal Medicine cult\u0027s impact on the Northern Rivers community. \n\nEsther gives some background on Universal Medicine. She discusses the way that the cult underhandedly infiltrated the health sector, community organizations, workplaces, and educational establishments, and caused tension and distrust among local residents. She gives some guidelines on the way forward, a management plan for locals that minimizes harm to all involved, and options for legal remedies.\n\n*** Suggested plan for local committees dealing with Universal Medicine ***\n* Understand UM in general\n* Gather information on local UM identities\n* Monitor UM activities in the area\n     - events related to UM and its promoters,\n     - UM identities participating in community organisations, schools etc.\n* Use notification template to notify stakeholders and request that\n     - nothing UM related is to be promoted within the organisation in question\n     - UM identities make full disclosure of their links to UM and whenever they promote,             endorse or introduce anything or anyone UM related to the organisation.\n* Liaise with media to keep UM under scrutiny\n* Liaise with public representatives. Ask them what action they propose to take to protect  the community from UM\u0027s anti-social behaviours\n\nFor more info or to ask questions go to Esther\u0027s blog (copy and paste into your browser): https://universalmedicineaccountability.wordpress.com/2019/03/27/universal-medicine-cult-in-the-nsw-northern-rivers/",
      "release": "2019-03-26T23:24:42Z",
      "duration": "02:07:19",
      "explicit": false,
      "youTubeId": "AJz-WyvTgZ0",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AJz-WyvTgZ0"
      }
    },
    {
      "id": "6c243a33-0dd2-4f0f-8942-173b62e32f2a",
      "title": "Unpacking Universal Medicine Episode 5 - Influence \u0026 commitment",
      "description": "Esther Rockett examines Universal Medicine cult followers\u0027 fervent commitment to cult leader Serge Benhayon and his Way of the Livingness \u0027religion\u0027 scam. It\u0027s partly down to their religious faith but strong group pressures also keep them spending on its services and working unpaid to expand Serge Benhayon\u0027s commercial empire.\n\nThe excerpt of the news report on UM publishing a former UM student\u0027s schizophrenia diagnosis online came from an ABC News Australia report on 2 May 2018 http://www.abc.net.au/news/2018-05-02/doctor-gave-patient-medical-history-to-universal-medicine/9710412\n\nThe Universal Medicine cult\u0027s Way of the Livingness events give insight into the manipulations of cult leader Serge Benhayon and the workings of his Goonellabah based commercial conglomerate, and his purported occult \u0027religion\u0027. \nFilm series by Esther Rockett\n\nVisit Esther\u0027s blogs:\nhttps://factsaboutuniversalmedicine.wordpress.com/\nhttps://universalmedicineaccountability.wordpress.com/\nFacebook: https://www.facebook.com/Esther-Rockett-legal-defence-1697198000499194/\nTwitter @EstherRockett",
      "release": "2018-05-29T22:28:41Z",
      "duration": "00:31:45",
      "explicit": false,
      "youTubeId": "eQfM5S14S0s",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eQfM5S14S0s"
      }
    },
    {
      "id": "61657ea0-be95-42b7-ad3f-f946410fc249",
      "title": "Unpacking Universal Medicine Episode 4 - Relationships versus spirits",
      "description": "Esther Rockett\u0027s critical analysis of cult leader Serge Benhayon\u0027s supernatural beliefs about detractors and the conflict and shunning he encourages. Detractors are often the concerned friends, family and partners of those who become devoted to his Universal Medicine cult. \n\nThe Universal Medicine cult\u0027s Way of the Livingness events give insight into the manipulations of cult leader Serge Benhayon and the workings of his Goonellabah based commercial conglomerate, and his purported occult \u0027religion\u0027. \nFilm series by Esther Rockett\n\nVisit Esther\u0027s blogs:\nhttps://factsaboutuniversalmedicine.wordpress.com/\nhttps://universalmedicineaccountability.wordpress.com/\nFacebook: https://www.facebook.com/Esther-Rockett-legal-defence-1697198000499194/\nTwitter @EstherRockett",
      "release": "2018-02-24T21:33:37Z",
      "duration": "00:25:58",
      "explicit": false,
      "youTubeId": "LVHxNDYAi-k",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LVHxNDYAi-k"
      }
    },
    {
      "id": "ee0599bf-55ec-46b4-bb54-a0158e2c2e3d",
      "title": "Unpacking Universal Medicine Episode 3 \u0027True Sexy\u0027 \u0026 Esoteric Women\u0027s Health",
      "description": "The \u0027True Sexy\u0027 gimmick is used to market the Universal Medicine cult\u0027s women\u0027s health beliefs and practices, including sleazy Esoteric Breast Massage. The questionable practices are based on confusing and primitive ideas about sex. \n\nThe Universal Medicine cult\u0027s Way of the Livingness events give insight into the manipulations of cult leader Serge Benhayon and the workings of his Australian based commercial conglomerate, and his purported occult \u0027religion\u0027. \nFilm series by Esther Rockett\n\nVisit Esther\u0027s blogs:\nhttps://factsaboutuniversalmedicine.wordpress.com/\nhttps://universalmedicineaccountability.wordpress.com/\nFacebook: https://www.facebook.com/Esther-Rockett-legal-defence-1697198000499194/\nTwitter @EstherRockett",
      "release": "2018-02-18T07:05:20Z",
      "duration": "00:19:53",
      "explicit": false,
      "youTubeId": "_6egCZYgXKA",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_6egCZYgXKA"
      }
    },
    {
      "id": "1da63a05-0660-4720-8525-64174422dfd1",
      "title": "Unpacking Universal Medicine Episode 2 Esoteric Healing Esoteric Health",
      "description": "The Universal Medicine cult is marketed as a health service, but its beliefs and practices have little to do with improving health. \n\nUnimed\u0027s Way of the Livingness events give insight into the manipulations of cult leader Serge Benhayon and the workings of his Goonellabah based commercial conglomerate, and his purported occult \u0027religion\u0027. \nFilm series by Esther Rockett\n\nVisit Esther\u0027s blogs:\nhttps://factsaboutuniversalmedicine.wordpress.com/\nhttps://universalmedicineaccountability.wordpress.com/\nFacebook: https://www.facebook.com/Esther-Rockett-legal-defence-1697198000499194/\nTwitter @EstherRockett",
      "release": "2018-02-14T11:11:52Z",
      "duration": "00:27:51",
      "explicit": false,
      "youTubeId": "zemS5AQiix0",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zemS5AQiix0"
      }
    },
    {
      "id": "bec33432-aa24-455c-bbc4-9f1045bd887a",
      "title": "Unpacking Universal Medicine Episode 1 - Mystifying Sex",
      "description": "The Universal Medicine cult propagates confusing occult teachings about sex - mostly hatched by its leader Serge Benhayon. It has also launched sexual health and education initiatives for juveniles without disclosing the projects are backed by a commercial occult spirituality cult.\n\nUnimed\u0027s Way of the Livingness events give insight into the manipulations of cult leader Serge Benhayon and the workings of his Goonellabah based commercial conglomerate.\nFilm series by Esther Rockett\n\nVisit Esther\u0027s blogs:\nhttps://factsaboutuniversalmedicine.wordpress.com/\nhttps://universalmedicineaccountability.wordpress.com/\nFacebook: https://www.facebook.com/Esther-Rockett-legal-defence-1697198000499194/\nTwitter @EstherRockett",
      "release": "2018-01-11T02:18:44Z",
      "duration": "00:17:48",
      "explicit": true,
      "youTubeId": "Xm1N4XIN2P4",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Xm1N4XIN2P4"
      }
    },
    {
      "id": "f5fb124f-8a5e-4698-8815-e5a64ca11538",
      "title": "Unpacking Universal Medicine - Introduction",
      "description": "The Universal Medicine cult\u0027s Way of the Livingness events give insight into the manipulations of cult leader Serge Benhayon and the workings of his Goonellabah based commercial conglomerate, and his purported occult \u0027religion\u0027. \nFilm series by Esther Rockett\n\nVisit Esther\u0027s blogs:\nhttps://factsaboutuniversalmedicine.wordpress.com/\nhttps://universalmedicineaccountability.wordpress.com/\nFacebook: https://www.facebook.com/Esther-Rockett-legal-defence-1697198000499194/\nTwitter @EstherRockett",
      "release": "2018-01-10T08:28:34Z",
      "duration": "00:08:45",
      "explicit": false,
      "youTubeId": "NcOcAZFB_P8",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NcOcAZFB_P8"
      }
    },
    {
      "id": "62ae9956-b669-4ac9-8fb8-6a31c1d7b789",
      "title": "Unpacking Serge Benhayon\u0027s Esoteric Breast Massage",
      "description": "In May 2016, Universal Medicine leader, Serge Benhayon defended his Esoteric Breast Massage modality in an online video. Within 36 hours of receiving criticism, the video was removed from the internet, along with several others promoting EBM. \nIn 2016 or 2017 the Supreme Court of NSW will examine claims that Benhayon engaged in misleading conduct in the advertising of Esoteric Breast Massage and other Universal Medicine services, as well as made false and harmful healing claims, and engages in predatory and exploitative behaviour. His video footage, along with past advertising and audio recordings of his Esoteric Medicine lectures, will form part of the evidence.\nFor more info and links: https://factsaboutuniversalmedicine.wordpress.com/2016/06/07/serge-benhayon-defends-his-scam-esoteric-breast-massage/",
      "release": "2016-06-07T12:05:06Z",
      "duration": "00:44:50",
      "explicit": false,
      "youTubeId": "Xe2erlR9be8",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Xe2erlR9be8"
      }
    },
    {
      "id": "d0a88d1f-1ce5-4379-95df-bfa73438eafe",
      "title": "Serge Benhayon on supernatural entities that violate women \u0026 children",
      "description": "Universal Medicine publicity boasts its clients have successfully quit drugs and alcohol. The publicity doesn\u0027t state that its leader, Serge Benhayon, the source of \u0027One Unified Truth\u0027 that is beyond question, teaches that supernatural entities sexually violate women and children of people who use marijuana and liquor. \n\nFor more on the topic: \nhttps://estherrockett.com/2016/09/14/universal-medicines-entity-exorcism-swindle/\n\nAnd see Esther Rockett\u0027s YouTube talk on the Universal Medicine occult business model.",
      "release": "2016-02-08T10:02:41Z",
      "duration": "00:06:04",
      "explicit": false,
      "youTubeId": "zb1jz1HHN4I",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zb1jz1HHN4I"
      }
    },
    {
      "id": "8fc6c219-f8bf-4437-8722-1e8347a841b7",
      "title": "Serge Benhayon on the karma of sexual abuse",
      "description": "Audio recording of leader of Universal Medicine, Serge Benhayon\u0027s interpretation of the doctrine of \u0027karma\u0027. He states that children who are sexually abused deserve it for not being aware of crimes they committed in past lives. It\u0027s a view that might be described as idiosyncratic as well as fundamentalist. \n\nBenhayon offers hands on healings to \u0027clear the energy\u0027 of sexual abuse from the \u0027chakras\u0027. \n\nUniversal Medicine is a multi-million dollar alternative healing enterprise that does not disclose its occult teachings in publicity. Benhayon founded the company after claiming he heard voices while sitting on the toilet. \n\nhttps://universalmedicineaccountability.wordpress.com/\nhttps://factsaboutuniversalmedicine.wordpress.com/",
      "release": "2016-02-08T09:58:12Z",
      "duration": "00:05:13",
      "explicit": false,
      "youTubeId": "EWYvlZ9x9WQ",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EWYvlZ9x9WQ"
      }
    },
    {
      "id": "d4687c10-07be-4a1f-970d-1b28ec608a03",
      "title": "Unpacking Serge Benhayon - Benhayon\u0027s audio lectures analysed",
      "description": "Excerpts of audio recordings of Serge Benhayon, leader of occult healing enterprise, Universal Medicine,  lecturing on his toilet revelation and his beliefs on healing. According to Benhayon, science and other forms of authoritative knowledge are a conspiracy controlled by his supernatural enemies, Spirit and the Four Lords of Form.\n\nEsther Rockett unpacks the techniques of influence and the teachings that form the basis of Benhayon\u0027s multimillion dollar business and his international following of loyal devotees.\n\nFor more info on Universal Medicine: https://universalmedicineaccountability.wordpress.com/\nhttps://factsaboutuniversalmedicine.wordpress.com/\n\nhttps://twitter.com/EstherRockett\n\n(Pardon the terrible editing on this video and the typos. Still on training wheels in video production, but those wheels fell off for this vid. After finishing the thing I realized the titles weren\u0027t the proofread version. But the English is still better than Serge\u0027s...)",
      "release": "2016-01-13T07:27:04Z",
      "duration": "01:17:19",
      "explicit": false,
      "youTubeId": "3oetojwjHpY",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3oetojwjHpY"
      }
    },
    {
      "id": "e0c55175-d061-42e0-9e98-43b3ae8c7076",
      "title": "Serge Benhayon speaks about his mother \u0026 death",
      "description": "Serge Benhayon on audio from an Esoteric Medicine lecture on his disapproval of life saving medicine for his elderly mother. \n\nBenhayon is the head of Esoteric Healing business, Universal Medicine, based in Goonellabah, NSW, Australia. He is a former tennis coach who did not finish high school. He claims he founded his multimillion dollar organization after hearing voices while sitting on the toilet. \n\nBenhayon claims disability , disease and misfortune are consequences of failing to live according to his Esoteric Way of the Livingness spiritual path. He also claims improving physical health is a waste of resource , disease is \u0027cleansing\u0027 and death is a healing. He recently received over $1.3M from a cancer patient before her death and in her will. http://www.smh.com.au/nsw/universal-medicines-serge-benhayon-to-inherit-bulk-of-devotees-milliondollar-estate-20151227-glvl7u.html\n\nFor more information on Universal Medicine and Serge Benhayon: \nhttps://universalmedicineaccountability.wordpress.com/\nhttps://factsaboutuniversalmedicine.wordpress.com/",
      "release": "2016-01-13T07:27:04Z",
      "duration": "00:07:55",
      "explicit": false,
      "youTubeId": "JNSDMqnu7o8",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JNSDMqnu7o8"
      }
    },
    {
      "id": "df3f3e08-6a5f-460e-a873-945ac2072161",
      "title": "Serge Benhayon on disability",
      "description": "Audio recording of Universal Medicine leader, Serge Benhayon teaching his beliefs on disability. \n\nUniversal Medicine is a multimillion-dollar occult healing enterprise based on magical thinking. Benhayon teaches that illness and misfortune are karmic consequences for being ignorant of his \u0027energetic truth\u0027, and failing to adhere to his Way of the Livingness in this and past lives. \n\nBenhayon claims to have gained his knowledge of the Esoteric \u0027truth\u0027 via voices he first heard while sitting on the toilet. His occult teachings are not disclosed in his organization\u0027s extensive publicity. \n\nFor more information: Universal Medicine Accountability https://universalmedicineaccountability.wordpress.com/\nUniversal Medicine Exposed https://factsaboutuniversalmedicine.wordpress.com/",
      "release": "2016-01-13T07:27:04Z",
      "duration": "00:06:15",
      "explicit": false,
      "youTubeId": "UdgBw_0qGBk",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UdgBw_0qGBk"
      }
    },
    {
      "id": "d1066131-63bd-452a-8113-ec51cd6fca3d",
      "title": "On Universal Medicine: Part One - an occult business model",
      "description": "Esther Rockett introduces Universal Medicine - an Esoteric healing organization and New Religion led by Serge Benhayon found by the Supreme Court of New South Wales to be a socially harmful cult.\n\nPART TWO - On Investment in Universal Medicine https://www.youtube.com/watch?v=bd5i7nwQSvA\n\nhttps://universalmedicineaccountability.wordpress.com/\n\nhttps://factsaboutuniversalmedicine.wordpress.com/\n\nFollow me on Twitter @EstherRockett",
      "release": "2015-11-18T08:56:28Z",
      "duration": "00:30:11",
      "explicit": false,
      "youTubeId": "9APx4iSaVYI",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9APx4iSaVYI"
      }
    },
    {
      "id": "903ef8cd-93d6-45b1-84f8-37dcc8bf9da5",
      "title": "On Universal Medicine: Part Two - Investment",
      "description": "Esther Rockett introduces Universal Medicine - an Esoteric healing organization led by Serge Benhayon that was found by the Supreme Court of New South Wales to be a socially harmful cult\n\nAlso watch PART ONE - On the Universal Medicine business model - https://youtu.be/9APx4iSaVYI\n\nhttps://universalmedicineaccountabili...\n\nhttps://factsaboutuniversalmedicine.w...\n\nFollow me on Twitter @EstherRockett",
      "release": "2015-11-17T23:11:25Z",
      "duration": "00:35:14",
      "explicit": false,
      "youTubeId": "bd5i7nwQSvA",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bd5i7nwQSvA"
      }
    }
  ]
}