{
  "id": "705e4d91-f77f-426e-b93a-af4739013658",
  "name": "EUROPOL",
  "youTubeChannelId": "UCdlTT3Brc1TSkXa9dPvGhpg",
  "episodes": [
    {
      "id": "0bb485c1-d5f2-4dd0-a184-6fdddd9e6582",
      "title": "34 arrests in Spain during action against the ‘Black Axe’ criminal organisation",
      "description": "The Spanish National Police (Policía Nacional), in close cooperation with the Bavarian State Criminal Police Office (Bayerisches Landeskriminalamt) and with the support of Europol, conducted an operation against the international criminal organisation ‘Black Axe’. The action resulted in 34 arrests and significant disruptions to the group\u0027s activities. \n\nRead more in our press release: https://www.europol.europa.eu/cms/media-press/newsroom/34-arrests-in-spain-during-action-against-%E2%80%98black-axe%E2%80%99-criminal-organisation\n\nFollow us on:\nhttp://www.europol.europa.eu\nhttp://www.facebook.com/europol/\nhttp://www.instagram.com/europol.eu/\nhttp://x.com/europol\nhttp://www.linkedin.com/company/europol\nhttps://bsky.app/profile/europol-eu.bsky.social\n\nIntellectual property rights, including copyright, to the material are owned by Europol.  Europol’s advance permission is also required for any further use of this material.  Further details can be viewed on https://www.europol.europa.eu/legal-notice. Where permission is given in writing this will require the source to be identified and intellectual property rights to be acknowledged. Any entity reusing the material is responsible for its own publication and for obtaining any additional permissions required (e.g. from individuals appearing, from rights owners of any images or figures embedded in the material). No material or image may be used to endorse or imply endorsement of an organisation or project by Europol. The Europol name and logo are the exclusive property of Europol. They are protected under European and International law and cannot be reproduced without Europol’s prior written permission.",
      "release": "2026-01-09T08:35:48Z",
      "duration": "00:01:31",
      "explicit": false,
      "youTubeId": "9IVJkjOv5UE",
      "subjects": [
        "Black Axe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9IVJkjOv5UE"
      }
    }
  ]
}