{
  "id": "0fd09316-2e7f-489e-a10a-8e7f498c3077",
  "name": "Eva",
  "youTubeChannelId": "UCTCmxkAwVOefIFAOs5W0Lvw",
  "episodes": [
    {
      "id": "1f7a138a-8a32-40d3-b220-4fe8afabc857",
      "title": "How I Was Recruited at 14: My First Steps Into the Watchtower Cult - Introduction.",
      "description": "Welcome to Witchy Goddess Reborn.\n\nThis is the first introductory episode in my new series: Escaping the Watchtower – My Life Inside and Outside Jehovah’s Witnesses.\n\nIn this video, I take you back to the beginning—when I was just 14 years old and first recruited into the Jehovah’s Witnesses in 1996. What started as a search for belonging and spiritual truth quickly became a slow descent into a high-control system that would shape—and nearly break—my entire life.\n\nI share how I was approached, what drew me in, and how I came to be baptized as a teenager, not realizing the long-term emotional, psychological, and spiritual toll it would take. This series is about truth, healing, and reclaiming your voice after religious trauma.\n\nWhether you’re currently questioning, newly awakened, or healing from a high-control religion or cult, you’re not alone. I see you. And I made this for you.\n\nThis series will explore:\n • Life inside the Jehovah’s Witness world\n • Emotional and spiritual manipulation\n • The BITE model (how cults work)\n • My disassociation at age 37 in 2018\n • How I reclaimed my spiritual power and rebuilt my life\n\nIf this resonates, please like, comment, and subscribe. Your story matters, and together we can break the silence.\n\nFollow me on TikTok for shorter stories \u0026 updates:\n@witchygoddessreborn\n\n#JehovahsWitness #ExJW #ReligiousTrauma #SpiritualAbuse #CultAwareness #WitchyGoddessReborn #BITEModel #HighControlGroup #Deconstruction #HealingJourney #FormerJW #EscapingTheWatchtower",
      "release": "2025-05-15T10:11:18Z",
      "duration": "00:07:08",
      "explicit": false,
      "youTubeId": "nK7dsqtCRm8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nK7dsqtCRm8"
      }
    }
  ]
}