{
  "id": "73a058b8-96c7-4101-b979-e2dd5fe6fc76",
  "name": "Everything and Anything...and a bit gay Podcast",
  "spotifyId": "3AIL2AfuF9WrE9ozLYHnPW",
  "appleId": 1725668960,
  "youTubeChannelId": "UCg8EOFAEJnr7zeck3gygViw",
  "episodes": [
    {
      "id": "a650a619-2e0f-4376-acce-d879d0742eb3",
      "title": "Episode 127: Inside the Twelve Tribes Cult: How Tamara Mathieu Survived 14 Years",
      "description": "Zach Randles-Friedman speaks with author and TikTok creator Tamara Mathieu, who spent 14 years inside the Twelve Tribes, a high-control religious cult with communities across the U.S. and around the world. Tamara shares how she was drawn in as a young mother seeking community and safety, what daily life inside the cult really looked like, and how strict rules, isolation, and control shaped her marriage and her children’s lives. She opens up about motherhood under surveillance, the loss of personal freedom, the impact on teenagers, and the slow realization that something was deeply wrong. In a gripping and emotional conversation, Tamara recounts the moment she and her family finally escaped, the challenges of rebuilding life afterward, and how her children have gone on to thrive outside the cult. She also discusses her memoir, All Who Believe: A Memoir in the Life of the Twelve Tribes, and why sharing her story now helps others feel less alone. This episode is an honest, courageous look at survival, deconstruction, and reclaiming your life after spiritual abuse. Buy Tamara\u0027s Book: https://www.amazon.com/All-Who-Believed-Memoir-Twelve/dp/1578691176 Follow Tamara on TikTok: https://www.tiktok.com/@author.tamaramathieu Podcast song by SIXFOOT 5: https://www.sixfoot5prod.com Apple: https://music.apple.com/us/artist/sixfoot-5/1551774977 Spotify: https://open.spotify.com/artist/5rHMzoU0G0fLhaBsrQiOOY?si=laSZ5hiKTYubJJyhrzf2JQ Podcast song by SIXFOOT 5: https://www.sixfoot5prod.com Apple: https://music.apple.com/us/artist/sixfoot-5/1551774977 Spotify: https://open.spotify.com/artist/5rHMzoU0G0fLhaBsrQiOOY?si=laSZ5hiKTYubJJyhrzf2JQ Hosted by Simplecast, an AdsWizz company. See pcm.adswizz.com for information about our collection and use of personal data for advertising.",
      "release": "2025-12-24T14:00:00Z",
      "duration": "01:06:02.9060000",
      "explicit": false,
      "spotifyId": "3TumeYn1YH94CWElyqwRrH",
      "appleId": 1000742597553,
      "youTubeId": "pk6FohRVgU0",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3TumeYn1YH94CWElyqwRrH",
        "apple": "https://podcasts.apple.com/podcast/episode-127-inside-the-twelve-tribes-cult-how-tamara/id1725668960?i=1000742597553",
        "youtube": "https://www.youtube.com/watch?v=pk6FohRVgU0"
      }
    },
    {
      "id": "4c72f40c-76a9-4b3b-bb48-5ffc9c0a10fd",
      "title": "Episode 46: The Story of a Survivor of a Cult",
      "description": "Heather joins my podcast to share her powerful story of surviving and escaping a cult, revealing the unimaginable hardships she endured. With unflinching honesty, she opens up about the mental, physical, and sexual abuse she suffered from childhood through early adulthood—experiences few could endure, even briefly. Join us as Heather takes us through her courageous journey to freedom, recounting how she reclaimed her life, found resilience, and rebuilt her strength after leaving the cult. Quince - Love their clothes!! Upgrade your wardrobe with pieces made to last with Quince. Go to Quince.com/abitgay for free shipping on your order and 365-day returns. Canopy’s Filtered Showheads Go to getcanopy.co to save $25 on your Canopy Filtered Showerhead purchase today with Canopy’s hassle-free filter subscription. Even better, my listeners can use code everythingand at checkout to save an additional 10% off your Canopy purchase. Hurry! Your hair and skin will thank you. Cozey Modern living made simple for you. www.cozey.com One thing that makes this show possible is by selling sponsorships to advertisers. One way you can support us in getting more sponsors is telling us a little bit about yourself. You can do that by filling out a quick survey at the link in the show description. Plus, your answers will help us learn what you love most about the show, and how to make it even better. The questions will ask about you and things that help advertisers understand our audience. It will only take a few minutes and is an easy way to help the show. http://bit.ly/everythingandanythingandabitgaypodcast-survey Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-11-23T05:00:34Z",
      "duration": "01:07:34.5430000",
      "explicit": false,
      "spotifyId": "6IHDh1avrXsx8HGxMWV1FX",
      "appleId": 1000677978561,
      "youTubeId": "7Zn2bg-25Gc",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6IHDh1avrXsx8HGxMWV1FX",
        "apple": "https://podcasts.apple.com/podcast/episode-46-the-story-of-a-survivor-of-a-cult/id1725668960?i=1000677978561",
        "youtube": "https://www.youtube.com/watch?v=7Zn2bg-25Gc"
      }
    }
  ]
}