{
  "_ts": 0,
  "id": "8a10cdd2-6d47-4076-96ea-6960fb97bc36",
  "name": "Everybody Wants To Be Us",
  "spotifyId": "7i1uB54Qrlci2Xzyu1E0xZ",
  "appleId": 1762274864,
  "youTubeChannelId": "UCHOw_A90WMklvU3MQSSl6WQ",
  "episodes": [
    {
      "id": "981556b7-7020-4363-9fb7-125082c7dfc7",
      "title": "The Fastest Man in The World: ‘I Grew Up in a religious cult’",
      "description": "Noah Lyles, grew up in a religious cult.\n\nHe was physically and emotionally bullied in school by girls and suffers with asthma.\n\nBut he’s just won the gold medal in the 100m sprint at the Paris olympics. \nI first met Noah last year when he walked for Hugo Boss in their TechTopia Show with Gigi Hadid \u0026 Anthony Joshua. Since then I’ve seen him chill with Snoop Dogg, appear on Jimmy Fallon \u0026 be the main character in the new Netflix Series Sprint.\n\nPeople call him, arrogant, obnoxious \u0026 overconfident - but I sat down with a man who’s guilty of only one thing. Having an unwavering belief in himself incomparable to anyone else I’ve ever met.\n\nNoah has ADD, anxiety, depression, allergies, asthma yet allows none of this to stop him. What inspired me the most was none of his accomplishments but his ability, in a world of such judgment and comparison, to expressively and unapologetically be himself. He’s dismissive of his downfalls and refuses to see them as barriers. He’s unashamed of his emotions, therapy and dependance on his mum which only seems to make him stronger and more secure.\n\nI’ve never met a super hero but Noah is the closest thing to what I imagine one to be like.\n\nWe talk about his love for fashion, his runway experience in Milan, his highest grossing Netflix documentary \u0026 so much more.\n\nIf belief in yourself is what you need, listen to Noah. His advice and energy is infectious.",
      "release": "2024-08-12T07:00:20Z",
      "duration": "01:10:54",
      "explicit": false,
      "spotifyId": "27REW7BQgeZ8pFu5Ed4R89",
      "appleId": 1000665008402,
      "youTubeId": "elnQrwhg9_E",
      "urls": {
        "spotify": "https://open.spotify.com/episode/27REW7BQgeZ8pFu5Ed4R89",
        "apple": "https://podcasts.apple.com/podcast/how-to-believe-in-yourself-noah-lyles-fastest-man-in/id1762274864?i=1000665008402",
        "youtube": "https://www.youtube.com/watch?v=elnQrwhg9_E"
      }
    }
  ]
}