{
  "id": "6e5a3d6f-519d-4e22-9da7-c70c2e869365",
  "name": "Evidence Locker True Crime",
  "spotifyId": "3yPhQ3N0XWfrA7BK5dzmOj",
  "appleId": 1401698612,
  "episodes": [
    {
      "id": "0c6ae055-937b-4929-8a99-e9de8c2b6517",
      "title": "The Black Magic Murders (Adolfo Constanzo) | Mexico - Revisited",
      "description": "In celebration of Halloween, this week’s episode is a re-release of one of our first episodes - still chilling... Adolfo Constanzo, also known as El Padrino (or the Godfather), was the leader of a cult that believed that Black Magic would shield their drug cartel from being busted. Adolfo encouraged human sacrifice, and countless people fell victim to the cult, later dubbed the Narcosatanists. When American medical student Mark Kilroy disappeared after a night out in Matamoros, the cult’s sadistic activities finally came to light. Books: Read collections of The Evidence Locker Files , available in print and digital editions. Follow us on: YouTube , Facebook , Instagram , X , TikTok For more information, visit: Evidence Locker Website Listen ad-free: Visit our page at Patreon 25% of Evidence Locker Patreon proceeds are donated to support the Doe Network , solving international cold cases. To learn more, visit: https://www.doenetwork.org/ Resources Mark Kilroy Foundation http://www.markkilroyfoundation.org/ YouTube Serial Killers and Cult Leaders: Adolfo Constanzo “El Padrino” - The Black Magic Torturer and Murderer Web Wikipedia Biography.com Murderpedia Articles Lost to the Darkness Created \u0026 Produced by Sonya Lowe Narrated by Noel Vinson Music: \u0022Nordic Medieval\u0022 by Marcus Bressler Background track: Doblado Studios: https://www.youtube.com/c/DobladoStudios This True Crime Podcast was researched using open-source or archival materials.",
      "release": "2025-10-29T05:44:00Z",
      "duration": "00:45:13.1520000",
      "explicit": true,
      "spotifyId": "64Z2OuMPCcdBvBi3uKn7zj",
      "appleId": 1000733999344,
      "subjects": [
        "Adolfo Constanzo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64Z2OuMPCcdBvBi3uKn7zj",
        "apple": "https://podcasts.apple.com/podcast/the-black-magic-murders-adolfo-constanzo-mexico-revisited/id1401698612?i=1000733999344"
      }
    }
  ]
}