{
  "_ts": 0,
  "id": "58e77f63-2757-4947-9b42-4643fc01e934",
  "name": "Exclusive Brethren Watch",
  "youTubeChannelId": "UCeIahsiLjkanGRp5dOnMx_Q",
  "episodes": [
    {
      "id": "513f9df2-da34-4afa-be34-f893f20819ec",
      "title": "Inside the Brethren  Life Without Technology #cult #religiouscommunity #plymouthbrethren",
      "description": "Step inside the secretive world of the Plymouth Brethren, a controversial religious group that shuns modern technology. Is life without tech a path to purity, or a tool for control? Watch to uncover the truth. #cult #religiouscommunity #plymouthbrethren",
      "release": "2024-08-22T22:30:03Z",
      "duration": "00:00:39",
      "explicit": false,
      "youTubeId": "SuCLLYqowfM",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SuCLLYqowfM"
      }
    },
    {
      "id": "beb65f60-d9c3-463e-8a10-1f5e5a0347ac",
      "title": "🔍 Inside the Dark Secrets of This Controversial Group 😱   #religiousgroup #plymouthbrethren",
      "description": "Inside the Dark Secrets of This Controversial Group\nPrepare to be shocked! 😱 We’re revealing the hidden truths and dark practices of a group that’s shrouded in mystery. 👁️ What they don’t want you to know in just 60 seconds! #Shorts #DarkSecrets #Exposed #mysteryrevealed #cult #cultwatch",
      "release": "2024-08-20T23:30:07Z",
      "duration": "00:00:38",
      "explicit": false,
      "youTubeId": "Q5YwWrIcVTc",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q5YwWrIcVTc"
      }
    },
    {
      "id": "a9a79d8b-8574-41c3-8851-6b7e57277771",
      "title": "Top 10 Exclusive Brethren Cult Secrets You Should Know",
      "description": "Top 10 Exclusive Brethren Cult Secrets You Should Know | Exclusive Brethren Watch\n\nWelcome to Exclusive Brethren Watch, where we dive deep into the mysterious and secretive world of the Exclusive Brethren. In this video, we\u0027re unveiling the Top 10 shocking secrets that the Exclusive Brethren don\u0027t want you to know. From their secretive practices to their strict rules and controversial beliefs, we\u0027re exposing it all.\n\nDiscover the hidden truths about this religious group, its influence on members\u0027 lives, and the impact on those who dare to leave. Whether you\u0027re curious about the Exclusive Brethren or simply want to learn more about cult-like organizations, this video is a must-watch.\n\n🔍 Topics Covered:\n\nHidden rituals and ceremonies\nFinancial exploitation of members\nStrict control over personal relationships\nThe role of women in the Brethren\nHow they handle dissent and defection\n...and more!\n\nDon\u0027t forget to LIKE, SHARE, and SUBSCRIBE to our channel for more in-depth content on secretive organizations like the Exclusive Brethren. Hit the notification bell so you never miss an update!\n\nIf you are a Exclusive Brethren member that is desperately looking to leave the cult behind, please see the following charity support networks below:\n\nUnited Kingdom: The Family Survival Trust - https://www.thefamilysurvivaltrust.org/ \n\nAustralia: CIFS Australia -\nhttps://www.cifs.org.au/\n\nUnited States - Safe Passage Foundation\nhttps://www.safepassagefoundation.org/",
      "release": "2024-08-20T12:12:03Z",
      "duration": "00:23:29",
      "explicit": false,
      "youTubeId": "LVXd6urm5bY",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LVXd6urm5bY"
      }
    },
    {
      "id": "672cd3ab-e5c2-4e6e-92e6-f5e75f85b5a1",
      "title": "UK Government Potentially Faces £100M Loss to Secretive Exclusive Brethren Sect: Bruce Hales Exposed",
      "description": "Welcome to Exclusive Brethren Watch, where we uncover the hidden truths behind secretive religious sects. In this video, we delve into a shocking revelation involving the UK government and the Exclusive Brethren, also known as the Plymouth Brethren Christian Church. With potential losses amounting to £100 million, we expose the intricate connections and financial implications orchestrated by the Hales family, the influential leaders of this enigmatic sect.\n\nIn This Video, You Will Learn:\n\nFinancial Implications: Understand the potential £100 million loss faced by the UK government due to dealings with the Exclusive Brethren.\n\nThe Hales Family: Explore the role of the Hales family in the leadership of the Plymouth Brethren Christian Church and their influence over its financial operations.\n\nSecretive Practices: Gain insight into the secretive practices of the Exclusive Brethren and how they maintain their closed community.\n\nGovernment and Sect Interactions: Analyze the interactions between the UK government and the Exclusive Brethren, highlighting potential vulnerabilities and oversight failures.\n\nWhy This Matters:\nThe potential financial loss highlights significant issues in the oversight of dealings with secretive religious groups. This video aims to shed light on these matters, promoting transparency and accountability.\n\nJoin the Conversation:\nWe encourage viewers to share their thoughts and insights in the comments section. Have you had any experiences with the Exclusive Brethren or similar groups? Let us know your perspective!\n\nSubscribe to Our Channel:\nStay informed with our latest videos that explore religious groups and their societal impacts. Subscribe to Exclusive Brethren Watch and hit the notification bell to never miss an update!\n\nKeywords: Exclusive Brethren, Plymouth Brethren Christian Church, UK government loss, Hales family exposed, secretive sect, religious financial scandal, government and church interactions, financial oversight, religious sects UK",
      "release": "2024-08-05T07:39:17Z",
      "duration": "00:05:51",
      "explicit": false,
      "youTubeId": "PZxwpJezQMw",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PZxwpJezQMw"
      }
    },
    {
      "id": "b1a123a9-f51b-4d58-b7a7-82356afc40cc",
      "title": "The Secretive World of the Exclusive Brethren: Unveiling the Plymouth Brethren Christian Church",
      "description": "Delve into the enigma of the Exclusive Brethren, also known as the Plymouth Brethren Christian Church, in this riveting exploration of faith, isolation, and power. Discover their radical separation from society and the resulting suspicion and mistrust. From their secretive communities with unique rules to their avoidance of media scrutiny, we uncover the stories whispered behind closed doors. Hear former members’ unsettling accounts of manipulation and exploitation, juxtaposed with the Brethren\u0027s steadfast defense of their way of life. Trace their roots to early 19th-century Plymouth and witness the historical splits that shaped their path. \n\n🌟 Like and share if you find this deep dive into religious sects as fascinating as we do! 🌟\n\n#ExclusiveBrethren #PlymouthBrethren #ReligiousIsolation #FaithAndPower #SecretSocieties #ReligiousHistory #JohnNelsonDarby #AberdeenIncident\n\nWelcome to Exclusive Brethren Watch, where we explore the hidden facets of the Exclusive Brethren, also known as the Plymouth Brethren Christian Church. In this video, we delve into the secretive world of this religious group, uncovering their practices, beliefs, and the impact on their members\u0027 lives.\n\nWhat You’ll Learn:\n\nHistory and Origins: Discover the origins of the Plymouth Brethren and how the Exclusive Brethren sect emerged.\n\nBeliefs and Practices: Learn about the unique doctrines and practices that define this church.\n\nCommunity Impact: Understand how the church\u0027s secretive nature affects its members and their relationships with the outside world.\n\nWhy It Matters:\nThe Exclusive Brethren have garnered significant attention due to their closed-off nature and strict rules. This video aims to shed light on their world, promoting understanding and awareness of this enigmatic group.\n\nJoin the Conversation:\nWe encourage respectful discussion and questions in the comments section. Have you had any experiences with the Exclusive Brethren or similar groups? Share your thoughts below!\n\nSubscribe to Our Channel:\nStay updated with our latest videos exploring religious groups and their societal impact. Subscribe to Exclusive Brethren Watch and hit the notification bell to never miss an update!",
      "release": "2024-08-05T03:13:48Z",
      "duration": "00:10:46",
      "explicit": false,
      "youTubeId": "fL8T1j9sYPs",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fL8T1j9sYPs"
      }
    }
  ]
}