{
  "id": "6882bcb8-d4f6-452c-8af5-29a18c698c03",
  "name": "Exiles \u0026 Pilgrims",
  "youTubeChannelId": "UCA8wUSGByVx8lsYvakJ2sQw",
  "episodes": [
    {
      "id": "d5ef1b3d-f310-4b7c-9497-7a7962bd3435",
      "title": "Damon Wayans Defends Dangerous Jehovah’s Witness Beliefs — But the Bible Doesn’t",
      "description": "Damon Wayans recently went on Club Shay Shay with Shannon Sharpe and publicly defended several core Jehovah’s Witness beliefs. Some of those beliefs aren’t just unbiblical... they’re dangerous.\n\nIn this video, I respond directly to Damon Wayans’ claims about Jehovah’s Witness doctrine — including teachings on paganism, holidays, and blood transfusions that have real-world consequences and cost lives.\n\nWhether you’re a current Jehovah’s Witness, PIMO, ex-JW, or someone encountering Watchtower doctrine for the first time, this video walks through the claims step by step and follows them all the way to their conclusions.\n\n🔔 Subscribe to @exilesandpilgrims for clear, thoughtful analysis of Jehovah’s Witness beliefs vs historical Christianity.\n\n▶️ Watch next: Jehovah’s Witnesses Claim Christianity Apostatized — But Did It?\n👉 https://youtu.be/r4dt2O52iDo\n\n🔍 Topics covered:\nDamon Wayans, Jehovah’s Witnesses, Watchtower, the Governing Body, blood transfusions, JW blood doctrine, biblical authority, Christian history, JW beliefs, ex-Jehovah’s Witness, PIMO, high-control religion, cult dynamics, and Scripture.",
      "release": "2026-02-08T14:00:23Z",
      "duration": "00:17:31",
      "explicit": false,
      "youTubeId": "IwNf8htA41Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IwNf8htA41Y"
      }
    },
    {
      "id": "57e90e92-0fa8-44d5-aba9-68542e18b8e3",
      "title": "Jehovah’s Witnesses Claim Christianity Apostatized — But Did It?",
      "description": "Jehovah’s Witnesses claim that Christianity fell into a \u0022Great Apostasy\u0022 almost immediately after the apostles died.\n\nAccording to the Watchtower, the early Church collapsed in the second century, true doctrine was lost, and Christianity remained corrupt until the organization was “restored” centuries later by Charles Russell, Joseph Rutherford, and the Governing Body.\n\nBut did that actually happen?\n\nAnd more importantly — does history support the Governing Body’s claim of a “Great Apostasy”?\n\nIn this video, I examine the core Jehovah’s Witness teaching about early Christianity apostatizing, including how figures like David Splane of the Governing Body frame Church history, Constantine, and post-apostolic Christianity.\n\nThis isn’t about Catholic vs Protestant debates or defending any one tradition. It’s about whether the historical record matches the Watchtower’s narrative.\n\nIn this episode, we look closely at:\n\n→ What Jehovah’s Witnesses mean by the “Great Apostasy”\n→ How the Governing Body claims early Christianity became corrupted\n→ Whether early Christian writings actually support that claim\n→ The role Constantine is often blamed for — and what really changed\n→ Why the apostasy narrative is essential to Watchtower authority\n\nWhen an organization claims exclusive truth by asserting that all other Christians were wrong for 1,800 years, the burden of proof matters.\n\nAnd when questioning that narrative is discouraged, it raises a deeper question: Is the Great Apostasy a historical conclusion — or a theological necessity?\n\nWhether you’re a current Jehovah’s Witness, PIMO, ex-JW, or simply researching early Christianity and Watchtower doctrine, this video will help you examine a claim that almost everything else depends on.\n\n🔔 Subscribe to @exilesandpilgrims for thoughtful, historical analysis of Jehovah’s Witness beliefs, Watchtower history, and high-control groups — without fear-mongering or hype.\n\n▶️ Watch next: Joe Rogan Called Jehovah’s Witnesses a Cult — Here’s Why That Matters\n👉 https://youtu.be/4VBSj6zd1Fw\n\n🔍 Topics covered\nGreat Apostasy, Jehovah’s Witnesses, Watchtower, Governing Body, David Splane, early Christianity, Church history, Constantine, Ignatius, Irenaeus, JW doctrine, apostasy, Watchtower teachings, Christian history, ex-Jehovah’s Witness, PIMO, high-control religion, and Watchtower theology",
      "release": "2026-01-25T14:01:16Z",
      "duration": "00:10:31",
      "explicit": false,
      "youTubeId": "r4dt2O52iDo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r4dt2O52iDo"
      }
    },
    {
      "id": "0e49aa1f-61e4-4eae-aa4c-3b5f41ddb33b",
      "title": "Joe Rogan Called Jehovah’s Witnesses a Cult — Here’s Why That Matters",
      "description": "Joe Rogan called out what many Jehovah’s Witnesses are afraid to confront — the question of whether the religion operates like a cult.\n\nAnd he didn’t say it once… he said it twice.\n\nThe second time, Joe Rogan sat down with former Jehovah’s Witness Kurt Metzger, who described what it was like growing up inside the organization and leaving it behind.\n\nThis isn’t about sparking outrage or clickbait. It’s why the word “cult” hits such a nerve for Jehovah’s Witnesses, and why hearing it from voices like Joe Rogan matters now more than ever.\n\nIn this video, I break down what Joe Rogan actually said, why Jehovah’s Witnesses are conditioned to distrust outside criticism, and how the Watchtower’s authority depends on discouraging honest examination.\n\nWhen an organization claims divine guidance but punishes questioning, isolates dissenters, and frames outside voices as dangerous, you have to ask: Is the real problem criticism — or control?\n\nWatch the full video to learn...\n→ Why Joe Rogan’s comments resonate so strongly with current and former JWs\n→ How the Watchtower conditions members to avoid outside perspectives\n→ Why the word “cult” triggers fear instead of discussion\n→ And what each of us can do to help more JWs wake up\n\nWhether you’re a current Jehovah’s Witness, PIMO, ex-JW, or simply researching Watchtower beliefs, this video will help connect dots that are rarely examined openly in the JW community.\n\n🔔 Subscribe to @exilesandpilgrims for clear, thoughtful analysis of Jehovah’s Witness doctrine, Watchtower history, and high-control religion — without fear-mongering or hype.\n\n▶️ Watch next: The Founder of Jehovah’s Witnesses Believed WHAT?! (Charles Taze Russell Exposed)\n👉 https://youtu.be/9mjjWX4OFh4\n\n🔍 Topics covered\nJoe Rogan, Jehovah’s Witnesses, Watchtower, Governing Body, JW beliefs, cult psychology, Kurt Metzger, high-control religion, Jehovah’s Witness doctrine, JW policy changes, shunning, disfellowshipping, ex-Jehovah’s Witness, PIMO, and Watchtower history",
      "release": "2026-01-18T14:00:05Z",
      "duration": "00:09:07",
      "explicit": false,
      "youTubeId": "4VBSj6zd1Fw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4VBSj6zd1Fw"
      }
    },
    {
      "id": "b1ef61e8-834f-4912-a236-d0eac1d1bd85",
      "title": "The Founder of Jehovah’s Witnesses Believed WHAT?! (Charles Taze Russell Exposed)",
      "description": "Charles Taze Russell didn’t just found what would become Jehovah’s Witnesses... he held beliefs that most modern JWs have NEVER been told about.\n\nOne of the most surprising? Russell believed the Great Pyramid of Giza in Egypt was built under God\u0027s direction — as a prophetic “stone witness” meant to confirm Bible chronology and divine truth.\n\nIn this video, I walk through Charles Taze Russell’s pyramid theology, where it came from, how seriously it was treated in early Watchtower teachings, and why it was eventually abandoned.\n\nThis isn’t speculation or rumor. It’s documented Watchtower history.\n\nWe’ll look at:\n\n→ What Charles Taze Russell actually believed about the Great Pyramid\n→ How pyramid measurements were used to predict biblical timelines\n→ Why early Watchtower publications promoted pyramid prophecy\n→ When and why the organization quietly distanced itself from these ideas\n→ And what this reveals about claims of divine guidance and “new light”\n\nIf God chose Charles Taze Russell as his mouthpiece, as he claimed, then it\u0027s fair to ask: What did this man believe? Because whether Jehovah\u0027s Witnesses like it or not, he sits at the foundation of their belief system. \n\nWhether you’re a current Jehovah’s Witness, PIMO, ex-JW, or simply interested in Watchtower history, this video sheds light on a chapter that’s rarely discussed — but deeply revealing.\n\n🔔 Subscribe to @exilesandpilgrims for thoughtful, honest analysis of Jehovah’s Witness beliefs, Watchtower history, and religious authority.\n\n▶️ Watch next: Jehovah’s Witnesses Are Unrecognizable (Here’s What Will Change Next)\n👉 https://youtu.be/Ha0Q8C_GGek\n\n🔍 Topics covered:\nCharles Taze Russell, Jehovah’s Witnesses, Watchtower history, Great Pyramid of Giza, pyramid prophecy, Russell pyramid beliefs, early Watchtower teachings, Jehovah’s Witness doctrine, JW history, Governing Body, new light, Watchtower theology, ex Jehovah’s Witness, PIMO, Bible chronology, religious authority",
      "release": "2026-01-11T14:00:22Z",
      "duration": "00:09:26",
      "explicit": false,
      "youTubeId": "9mjjWX4OFh4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9mjjWX4OFh4"
      }
    },
    {
      "id": "8dda57c0-27e5-4f3d-8d1d-2ade206e44eb",
      "title": "Jehovah’s Witnesses Are Unrecognizable (Here’s What Will Change Next)",
      "description": "Jehovah’s Witnesses are changing — fast. Rules that were once treated as matters of loyalty are suddenly being rewritten, softened, or quietly abandoned. And if you’ve been paying attention, the pattern is impossible to ignore.\n\nIn this video, I break down the most likely Jehovah’s Witness beliefs and policies to change next, based on what’s already changed — including beards, dress standards, toasting, reporting hours, and higher education.\n\nThis isn’t wild speculation. It’s about recognizing a clear trajectory.\n\nWe’ll look at:\n\n→ Why Jehovah’s Witnesses look nothing like they did just a decade ago\n→ How hard rules are rapidly being replaced by \u0022conscience matters”\n→ Which teachings are under the most pressure right now\n→ And why beliefs like birthdays, shunning, and certain holidays may be next\n\nSince the Governing Body claims divine guidance, you have to ask: Does the truth really need constant revisions?\n\nWhether you’re a current Jehovah’s Witness, PIMO, ex-JW, or just curious about Watchtower doctrine, this video will help connect the dots.\n\n🔔 Subscribe to @exilesandpilgrims for more thoughtful, honest analysis of Jehovah’s Witness beliefs and Watchtower teachings.\n\n▶️  Watch next: 10 Questions Jehovah’s Witnesses Can’t Answer\n👉 https://youtu.be/Gvm5AN_1WEY\n\n---\n🔍 Topics covered:\nJehovah’s Witnesses, Governing Body, Watchtower, JW beliefs, Jehovah’s Witness doctrine changes, JW 2026, JW policy changes, shunning, disfellowshipping, birthdays, holidays, JW broadcasting, ex Jehovah’s Witness, PIMO, Watchtower history, ex-JW",
      "release": "2026-01-04T14:00:26Z",
      "duration": "00:11:59",
      "explicit": false,
      "youTubeId": "Ha0Q8C_GGek",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ha0Q8C_GGek"
      }
    },
    {
      "id": "df8e7c50-0ff9-46c3-866c-525f6f041560",
      "title": "Jehovah Is NOT God’s Name (And Even the Watchtower Admits It)",
      "description": "Jehovah’s Witnesses are taught that using the name “Jehovah” is essential for true worship. But here’s the problem...\n\n“Jehovah” is not the original name of God, and even the Watchtower organization admits it.\n\nIn this video, I walk through:\n\n→ Where the name Jehovah actually came from\n→ Why Hebrew scholars overwhelmingly favor Yahweh instead\n→ What the Watchtower itself says in Insight on the Scriptures\n→ Why the divine name does not appear in any ancient New Testament manuscripts\n→ And why there is no record of Jesus ever using the divine name\n\nJehovah’s Witnesses are told that God’s name was removed from the Bible, but the Watchtower also claims the Scriptures were preserved with “minute attention to detail.” Both claims cannot be true.\n\nThis video isn’t about attacking people. It’s about examining history, manuscripts, and the Watchtower’s own admissions — calmly, clearly, and honestly.\n\nIf you’re a Jehovah’s Witness, a former JW, or someone questioning Watchtower teachings, this is a conversation worth having.\n\n🔔 Subscribe @exilesandpilgrims  for more videos exposing contradictions in Watchtower doctrine using Scripture, history, and the organization’s own publications.\n\n▶️ Watch next: 10 Questions Jehovah’s Witnesses Must Answer (But Can’t)\n👉 https://youtu.be/Gvm5AN_1WEY\n\nHere\u0027s a link to the June 2015 broadcast referenced in the video: https://www.jw.org/en/library/videos/#en/mediaitems/StudioMonthlyPrograms/pub-jwb_201506_1_VIDEO\n\n---\nJehovah’s Witnesses, Watchtower, Jehovah name, Yahweh vs Jehovah, Tetragrammaton, New World Translation, Governing Body, JW doctrine, ex Jehovah’s Witness, exJW",
      "release": "2025-12-28T14:00:39Z",
      "duration": "00:08:14",
      "explicit": false,
      "youTubeId": "NOIV_duva0A",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NOIV_duva0A"
      }
    },
    {
      "id": "5b632de8-3197-4f1b-a9c4-37cd8dc28dc3",
      "title": "10 Questions Jehovah’s Witnesses Must Answer (But Can’t)",
      "description": "Jehovah’s Witnesses are taught they have “the truth,” but these 10 questions expose serious contradictions in core Watchtower teachings.\n\nIn this video, I walk through 10 powerful questions every Jehovah’s Witness must answer (but can’t). These aren’t “gotcha” questions or emotional arguments. They’re simple, biblical, and logical questions that challenge foundational JW beliefs.\n\n01:03 – Why obey the Governing Body if they admit they are often wrong?\n01:56 – What belief are you certain will never change?\n02:17 – If Thomas called Jesus \u0022my Lord and my God,\u0022 why don\u0027t you? \n02:44 – If only God is good... then is Jesus good?\n03:03 – If Jesus isn\u0027t your mediator, then who is?\n04:00 – Why did Jesus choose JWs in 1919 while they taught false doctrines?\n04:44 – If Jesus never used the name Jehovah, why is it required today?\n05:12 – If God\u0027s name was removed from Scripture, can we trust the Bible?\n05:40 – If shunning is loving, why didn\u0027t Jesus practice it?\n06:03 – Could anything convince you that JWs aren\u0027t the true religion?\n\nIf you found this video helpful, you may also want to watch: \n👉 The LIE the Entire Jehovah’s Witness Religion Is Built On (1919 Exposed) | https://youtu.be/Vyt5JrhJpts\n\nIf you want more videos like this, subscribe @exilesandpilgrims for future discussions on Jehovah’s Witness theology and biblical, historical Christianity.",
      "release": "2025-12-21T14:00:27Z",
      "duration": "00:07:19",
      "explicit": false,
      "youTubeId": "Gvm5AN_1WEY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Gvm5AN_1WEY"
      }
    },
    {
      "id": "c164f374-24fa-4755-8880-b1ad19368a8b",
      "title": "This Jehovah’s Witness Called Me Judas Iscariot… So I Responded",
      "description": "A Jehovah’s Witness publicly called me a liar, a slanderer, and even “Judas Iscariot.”\n\nInstead of firing back with insults, I\u0027m responding calmly, directly, and with reason.\n\nIn this video, I address the accusations head-on and explain why disagreement doesn’t require character assassination, why labeling sincere Christians as “Judas” is spiritually reckless, and how this kind of rhetoric exposes deeper problems within Jehovah’s Witness theology and culture.\n\nThis response examines:\n\n→ Why dissent inside the Watchtower is treated as betrayal\n\n→ How labels like “Judas” and “apostate” shut down conscience and discussion\n\n→ Why truth claims that can’t be questioned rely on intimidation instead\n\nIf you’re a Jehovah’s Witness, former JW, or someone exploring Christianity outside the Watchtower, this video will help you recognize these tactics and respond to them clearly.\n\nBecause this isn’t about attacking people or winning arguments.\nIt’s about truth, conscience, and following Christ — even when they call you every name in the book.\n\nSubscribe for more:\n👉  @exilesandpilgrims  \n\nThis is the video that started it all:\n👉 The LIE the Entire Jehovah’s Witness Religion Is Built On (1919 Exposed): https://youtu.be/Vyt5JrhJpts\n\nAnd this is the response from \u0022Defending Jehovah’s Witnesses\u0022 titled “This ex-jw Elder claims Christ chose Watchtower in 1919, is a deliberate LIE ?\u0022 which you can watch here: https://www.youtube.com/watch?v=dg1v2vM_bhw",
      "release": "2025-12-14T14:00:34Z",
      "duration": "00:12:39",
      "explicit": false,
      "youTubeId": "Hedlb07-Vc0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Hedlb07-Vc0"
      }
    },
    {
      "id": "99f53214-2f60-4a73-9fd0-53516ccf002c",
      "title": "1919: The Most Important JW Belief — Built on Circular Reasoning",
      "description": "The 1919 doctrine is one of the most important beliefs in Jehovah’s Witness theology, yet it’s built entirely on circular reasoning. \n\nThis quick breakdown shows why the Watchtower’s claim doesn’t hold up when you actually follow the logic.\n\nFull video on @exilesandpilgrims: https://youtu.be/Vyt5JrhJpts\n\n#JehovahsWitnesses #ExJW #1919",
      "release": "2025-12-11T18:00:44Z",
      "duration": "00:00:54",
      "explicit": false,
      "youTubeId": "ZesU5Afv9ZE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZesU5Afv9ZE"
      }
    },
    {
      "id": "a78cae20-9b58-4153-bf42-ee835140a82d",
      "title": "Why Jehovah’s Witnesses Don\u0027t Celebrate Christmas (But SHOULD!)",
      "description": "Jehovah’s Witnesses reject Christmas because they believe it’s pagan, unbiblical, and dishonoring to God. But when you actually look at history, Scripture, and the early Christian writings, the Watchtower’s arguments fall apart — fast.\n\nIn this video, we take a clear, honest look at the real evidence:\n\n• What early Christians actually believed about the birth of Jesus\n• Why December 25 wasn’t borrowed from pagan Rome\n• What Hippolytus wrote about the Nativity in the early 200s\n• The truth about Sol Invictus — and why the dates don’t line up\n• Why the “pagan origins” argument collapses logically and biblically\n• Why the New Testament doesn’t forbid celebrating Christ’s birth\n• How the Watchtower oversimplifies history to justify its stance\n\nIt\u0027s true — the early Bible Students (and even Bethel) celebrated Christmas… but that’s not the biggest issue. The real problem is that the organization’s reasoning today isn’t historically accurate, and it doesn’t reflect how Christians — including the earliest ones — understood the Incarnation.\n\nIf you’re a Jehovah’s Witness, someone studying with JWs, or someone who left the organization and wants clarity, you’ll see the biblical and historical case laid out plainly.\n\nChristmas isn’t about paganism. It’s about Christ coming into the world — and that’s worth celebrating.\n\nSubscribe for more:\n👉  @exilesandpilgrims  \n\nWatch next:\n👉 The LIE the Entire Jehovah’s Witness Religion Is Built On (1919 Exposed): https://youtu.be/Vyt5JrhJpts\n\nThanks for watching, and Merry Christmas. 🎄✨",
      "release": "2025-12-07T14:00:03Z",
      "duration": "00:10:49",
      "explicit": false,
      "youTubeId": "216yDdEnjeE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=216yDdEnjeE"
      }
    },
    {
      "id": "f28df519-50af-42d9-9e74-4ed03629fdf1",
      "title": "If Your “Truth” Can’t Be Questioned… It Isn’t Truth (From a Former Jehovah’s Witness)",
      "description": "If your “truth” can’t be questioned… it isn’t truth at all. Real truth doesn’t fear examination — only fragile belief systems do. \n\nIn this video, I explain why genuine faith welcomes honest questions, and why spiritual authority should never depend on shutting down critical thinking.\n\nAs a former Jehovah’s Witness, I know what it’s like to be told that questioning “The Truth” is dangerous. But Jesus never taught a faith built on fear or insulation. Real Christianity invites examination because truth actually stands up to it.\n\nWhether you’re a current or former JW, a Christian wrestling with doubts, or someone asking what truth really is, hopefully this video will help you make sense of the difference between truth, ideology, and control.\n\nSubscribe for more:\n👉  @exilesandpilgrims  \n\nWatch next:\n👉 The LIE the Entire Jehovah’s Witness Religion Is Built On (1919 Exposed): https://youtu.be/Vyt5JrhJpts",
      "release": "2025-12-05T21:30:04Z",
      "duration": "00:03:02",
      "explicit": false,
      "youTubeId": "Lak6X7MoWt0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Lak6X7MoWt0"
      }
    },
    {
      "id": "ee279bb7-40fd-4eb3-af73-9436a8f8f05f",
      "title": "JWs: Early Christians Believed Jesus Was God (Here’s Proof) #jw #exjw #jehovahswitnesses",
      "description": "Jehovah\u0027s Witnesses say Jesus isn\u0027t God, and that the idea of Jesus being divine was an invention that came from Emperor Constantine and the Council of Nicaea. \n\nIn this video, I respond to that claim with direct evidence of what early Christians like Ignatius, Justin Martyr, and Irenaeus ACTUALLY believed.\n\nIf you’re a JW, an ex-JW, or simply exploring what the earliest Christians believed about Jesus, this will give you the evidence you’ve never been shown.",
      "release": "2025-12-02T22:00:10Z",
      "duration": "00:00:41",
      "explicit": false,
      "youTubeId": "2WlRiqENsq4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2WlRiqENsq4"
      }
    },
    {
      "id": "177423b4-13db-4784-b2f1-4760b745a3b8",
      "title": "The LIE the Entire Jehovah’s Witness Religion Is Built On (1919 Exposed)",
      "description": "Most Jehovah’s Witnesses don\u0027t know the full story about 1919 — or why the entire Jehovah’s Witness organization, the Governing Body’s authority, and the faithful and discreet slave doctrine depend on it.\n\nIn this video, I break down the Watch Tower claim that Jesus conducted a spiritual inspection from 1914–1919, chose the Watch Tower Society as his “faithful and discreet slave,” and granted the Governing Body exclusive authority over all spiritual truth.\n\nThe problem? None of it lines up with Scripture, history, or even the organization’s own teachings.\n\nI walk through the timeline, the circular logic, the failed prophecies leading up to 1919, and why this doctrine is the weak point of the entire Jehovah’s Witness belief system. \n\nWhether you’re a current JW, an ex-JW, or someone researching the religion, this is the doctrine you have to understand.\n\nSubscribe for more:\n👉 @exilesandpilgrims \n\nWatch next:\n👉 The Hardest Part of Leaving Jehovah’s Witnesses (Wasn’t What I Expected): https://youtu.be/W2KbsJIUJ28",
      "release": "2025-11-30T14:00:53Z",
      "duration": "00:08:38",
      "explicit": false,
      "youTubeId": "Vyt5JrhJpts",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Vyt5JrhJpts"
      }
    },
    {
      "id": "4569a10b-8291-40cb-85e1-1e7a4ce17ccd",
      "title": "The JW Doctrine That Gives Their Leaders Power (And It Isn’t in the Bible!)",
      "description": "Jehovah’s Witnesses rarely talk about this doctrine publicly… but the entire authority of the Governing Body depends on it.\n\nThe teaching that Jesus “inspected all churches” from 1914–1919 and chose the Watch Tower Society as God’s only channel isn’t found anywhere in Scripture — not one verse.\n\nIf this doctrine collapses, everything else collapses with it.\n\nIf you want a full breakdown of the 1919 teaching and why it falls apart under scrutiny, watch out for my next full-length video coming shortly!",
      "release": "2025-11-29T12:30:39Z",
      "duration": "00:00:41",
      "explicit": false,
      "youTubeId": "R9BYli02CkM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R9BYli02CkM"
      }
    },
    {
      "id": "67cba2f5-ae56-43cd-aacb-4bfcd95aa0a8",
      "title": "The Hardest Part of Leaving Jehovah’s Witnesses (Wasn’t What I Expected)",
      "description": "Leaving Jehovah’s Witnesses changes your entire life, but the hardest part wasn\u0027t what I expected. \n\nIt’s not the doctrinal debates or meetings with elders. It’s the people you lose along the way. \n\nIn this video, I share the emotional reality of leaving the Jehovah’s Witness organization, what surprised me most, and why the consequences are deeply personal... not just theological.\n\nIf you’re fading, disfellowshipped, disassociated, or just questioning the Watchtower, you’re not alone. There\u0027s life — and even real faith — on the other side of shunning.\n\n➤ If this helped you, consider subscribing@exilesandpilgrims -- more videos on leaving a high-control religion, rebuilding faith, and navigating life after Jehovah’s Witnesses are on the way!\n\n➤ Watch next: https://www.youtube.com/watch?v=LTBA6kzHtAU\u0026t\n\n#JehovahsWitnesses #ExJW #JW #JehovahsWitness #christianity #shunning",
      "release": "2025-11-22T00:00:42Z",
      "duration": "00:09:39",
      "explicit": false,
      "youTubeId": "W2KbsJIUJ28",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=W2KbsJIUJ28"
      }
    },
    {
      "id": "98a76646-3201-4284-bbe9-94d1cf3471f3",
      "title": "The 5 Words JWs Are Afraid to Say…",
      "description": "There are 5 words in John 20:28 that Jehovah’s Witnesses will never say… and it raises a huge question for their doctrine.\n\n#exjw #jw #jehovahswitness #christianity #jesus",
      "release": "2025-11-14T20:00:54Z",
      "duration": "00:00:54",
      "explicit": false,
      "youTubeId": "wQr7rQFTlZU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wQr7rQFTlZU"
      }
    },
    {
      "id": "c421ca0c-26a7-466f-ac5c-e329b81f65dd",
      "title": "Jehovah’s Witnesses Used to Worship Jesus... Now They Call It Idolatry",
      "description": "Jehovah’s Witnesses will tell you that worshipping Jesus is idolatry.\nBut what most JWs don’t realize is that their own publications once commanded it.\n\nFor decades, the Watchtower taught that Jehovah required everyone to worship Christ Jesus. Then, without apology, they reversed course and called that same act “false worship.”\n\nIn this episode, I show the original Watchtower sources, explain when and why the change happened, and explore what it means for anyone who still believes the organization speaks for God.\n\nIf “the truth” can change on something as fundamental as who deserves worship... what does that say about the source?\n\nWatch till the end — this one’s eye-opening.\n\nYou may also want to...\n\n•  Watch \u0022The Truth About Jehovah’s Witness Baptism in 5 Minutes (Most JWs Don’t Know This)\u0022 → https://youtu.be/wI5BaF81QAQ\n• Subscribe for new episodes every week → https://www.youtube.com/@exilesandpilgrims\n\n#JehovahsWitnesses #ExJW #JW #JehovahsWitness #christianity \n\nWatchtower sources referenced:\n•  2023 Annual Meeting \n•  w93 1/15 pp. 20-25\n•  w63 1/15 pp. 53-56\n•  Page 339 of the 1939 Watchtower\n•  Page 32 of the 1945 Yearbook\n•  Awake!  |  April 8, 2000\n•  w57 6/15 pp. 369-375",
      "release": "2025-11-07T20:00:33Z",
      "duration": "00:04:59",
      "explicit": false,
      "youTubeId": "LTBA6kzHtAU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LTBA6kzHtAU"
      }
    },
    {
      "id": "dabf4aa2-0c1c-4b1b-8ae1-30c8c77f2021",
      "title": "What My Circuit Overseer Said Changed How I See Jehovah’s Witnesses Forever",
      "description": "I’ll never forget what my Circuit Overseer said during this conversation.\n\nIt completely changed how I see Jehovah’s Witnesses, and honestly, it was one of the first moments that made me start questioning everything I believed.\n\nWatch the full video here: https://youtu.be/Z0sRDfSQscU\n\n#JehovahsWitnesses #ExJW #JWStory #JW #Faith",
      "release": "2025-11-04T16:30:15Z",
      "duration": "00:01:46",
      "explicit": false,
      "youTubeId": "IQtpim0lsl0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IQtpim0lsl0"
      }
    },
    {
      "id": "7de70a63-d9df-43a0-bafc-448fbff8f251",
      "title": "Leaving Jehovah’s Witnesses After 27 Years Was Worth It (Here\u0027s Why)",
      "description": "I spent 27 years as one of Jehovah’s Witnesses and even served as a regular pioneer, convinced I had the truth. But walking away changed everything.\n\nIn this clip, I share why leaving was painful, freeing, and ultimately worth it.\n\nWatch the full story here: https://youtu.be/aKkfjH3uv9Y\n\n#ExJW #JehovahsWitnesses #FaithJourney #ExilesAndPilgrims #shorts",
      "release": "2025-10-29T21:30:22Z",
      "duration": "00:00:51",
      "explicit": false,
      "youTubeId": "tlefBz55vqI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tlefBz55vqI"
      }
    },
    {
      "id": "638c20d4-4866-42f9-a92e-45c947828ba7",
      "title": "The Truth About Jehovah’s Witness Baptism in 5 Minutes (Most JWs Don’t Know This)",
      "description": "Most Jehovah’s Witnesses don\u0027t know the TRUTH about their baptism.\n\nIn this 5-minute breakdown, find out how the JW organization quietly redefined baptism from Jesus’ command in Matthew 28:19 (“in the name of the Father, the Son, and the Holy Spirit”) to something entirely different: baptism “in the name of Jehovah, Jesus, and the organization.”\n\nThis isn’t about attacking anyone’s faith. It’s about examining what Jehovah’s Witness baptism became, when it changed, and why it matters.\n\nSubscribe to @exilesandpilgrims for more content exploring faith, truth, and freedom beyond the Watchtower.\n\n#jehovahswitness #jw #baptism #watchtower #exjw #christianity #religion #faith #exjwcommunity #exjwtestimony #jwtruth #exjwawakening #watchtowerhistory #exilesandpilgrims",
      "release": "2025-10-25T14:01:42Z",
      "duration": "00:04:38",
      "explicit": false,
      "youTubeId": "wI5BaF81QAQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wI5BaF81QAQ"
      }
    },
    {
      "id": "c121c5df-22f8-4f68-b425-f01be35bc5ea",
      "title": "Jehovah’s Witnesses Believe Jesus Is WHO?? (Not Just Michael the Archangel)",
      "description": "Most Jehovah’s Witnesses have no idea this teaching even exists… but according to Watchtower theology, Jesus isn’t just Michael the Archangel. He’s also “the angel of the abyss,\u0022 who goes by a name you\u0027ve probably never heard before.\n\nIn this episode, I dig into the scriptures Jehovah’s Witnesses use to make that claim, how it\u0027s quietly buried in Watchtower doctrine, and what the Bible actually says about Jesus\u0027 identity.\n\nIf you’ve ever wondered how deep the layers of Watchtower theology go — this one’s going to surprise you.\n\nWant my personal study guide on Jesus\u0027 identity? It covers what Scripture really teaches, what the early Christians believed, and why it matters.\n\n👉 Email exilesandpilgrims@gmail.com for your free copy!\n\n📬 Subscribe for more deep dives into Watchtower teachings and biblical truth: @exilesandpilgrims \n\n#JehovahsWitnesses #ExJW #jesus #michaelthearchangel  #BibleStudy #ChristianApologetics #jw",
      "release": "2025-10-07T22:00:15Z",
      "duration": "00:06:09",
      "explicit": false,
      "youTubeId": "96ZG8pzdFfo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=96ZG8pzdFfo"
      }
    },
    {
      "id": "0f109ffd-61eb-4673-828b-441e6414bbb7",
      "title": "The ONE Question Jehovah’s Witnesses Can’t Answer (CO Told Me This)",
      "description": "This might be the BEST question you can ask Jehovah’s Witnesses to help them wake up.\n\nIn this video, I share a shocking conversation I had with my Circuit Overseer about 1914 — and how it helped me realize that even the most foundational truths in the Watchtower organization… can change.\n\nI’ll walk you through:\n\n🚩 The moment my CO admitted, “Who knows, it could change.”\n\n🚩 Why doctrinal shifts reveal the Achilles heel of this religion.\n\n🚩 The ONE question every Jehovah’s Witness should ask themselves (and that you can ask your JW family and friends to help them wake up)\n\nIf you’re waking up, questioning, or just curious about JW teachings — this video is for you.\n\n📌 Watch my story of leaving JWs here: https://www.youtube.com/watch?v=aKkfjH3uv9Y\n📌 Subscribe for more: https://www.youtube.com/@exilesandpilgrims\n\n#exjw #jehovahswitnesses #jw #watchtower #religion #christian",
      "release": "2025-09-29T23:00:41Z",
      "duration": "00:07:26",
      "explicit": false,
      "youTubeId": "Z0sRDfSQscU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z0sRDfSQscU"
      }
    },
    {
      "id": "f25c706a-3610-458b-8140-96f435a604e4",
      "title": "Why I Left Jehovah’s Witnesses After 27 Years (Former Regular Pioneer)",
      "description": "For 27 years, I believed Jehovah’s Witnesses had “the truth.” Leaving cost me nearly everything — family, friends, and the only community I had ever known. But it was worth it.\n\nIn this first episode of Exiles \u0026 Pilgrims, I share my Ex-JW testimony: growing up as a Jehovah’s Witness, the questions that shook my faith, and why I ultimately walked away.\n\nIf you’re questioning the religion you were raised in, or just curious about life after leaving the Watchtower, I hope this story shows you that you’re not alone.\n\n🔔 Subscribe for future episodes where I’ll go deeper into Jehovah’s Witness doctrine, faith, and the search for truth: @exilesandpilgrims \n\nWatch \u0022The One Question Jehovah\u0027s Witnesses Can\u0027t Answer (CO Told Me This)\u0022 here: https://youtu.be/Z0sRDfSQscU\n\n#ExJW #JehovahsWitnesses #ExJwTestimony #FaithJourney",
      "release": "2025-09-18T18:46:02Z",
      "duration": "00:07:56",
      "explicit": false,
      "youTubeId": "aKkfjH3uv9Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aKkfjH3uv9Y"
      }
    }
  ]
}