{
  "_ts": 0,
  "id": "d58b4a1b-ae78-4d06-b054-ec37eb032049",
  "name": "Ex-Jehovah\u0027s Witnesses-Critical Thinkers » Critical Thought Podcast",
  "spotifyId": "4VDOhlNzj7GUuyhiof8xfT",
  "appleId": 967813520,
  "youTubeChannelId": "UCpHhWSPtMDTSa8dzapmzo5A",
  "episodes": [
    {
      "id": "ad377fb4-5b1c-4fbd-96d1-d9a2dfcea676",
      "title": "Monica Velin Rodriguez - Mother Abducted by her Jehovah\u0027s Witness Family",
      "description": "Send us a text In this powerful episode, we sit down with a 4th-generation former Jehovah\u0027s Witness who shares her deeply personal journey of faith, family, and awakening. From pioneering with her husband across multiple language congregations and dreaming of Gilead, to witnessing the heartbreaking realities of shunning and child abuse within the organization, she opens up about the emotional toll of living a life dedicated to the faith. She recounts the harrowing experience of her grandfather\u0027s near-death due to the \u0027No-blood\u0027 policy, the tragic shunning and suicide attempts of her aunt, and the recent abduction of her mother by zealous JW relatives. Her story is a testament to resilience and the painful but liberating process of waking up to the truth. Now, as an active member of the Stop Mandated Shunning team and a participant in significant research and legal efforts, she’s fighting to expose the harmful practices of the Jehovah\u0027s Witnesses and support others on their journey out. Tune in to hear her discuss her participation in the ICSA Conference, the groundbreaking Roehampton University Research project, and how the power of storytelling is driving legal and academic progress worldwide. Don\u0027t miss this candid conversation that shines a light on the unseen struggles and victories of those who have left high-control religions. LINKS: My Shunning Story: https://stopmandatedshunning.org/monica-velin-rodriguez-can-you-help-me-stop-mandated-shunning/ SMS Website (Survey \u0026 Invitation to tell story): https://stopmandatedshunning.org/ Roehampton Research Project: https://stopmandatedshunning.org/new-research-project-on-the-harmful-effects-of-mandated-shunning/ ICSA Conference (general): https://stopmandatedshunning.org/stop-mandated-shunning-at-icsa-annual-conference/ *My Review of ICSA Conference: https://stopmandatedshunning.org/review-of-the-icsa-conference-from-the-perspective-of-a-recent-defector-of-a-high-control-group/ Join us behind the scenes on Patreon Check out our videos on why we left the Why We Left the Jehovah\u0027s Witnesses https://youtu.be/rqYUCV4FHI4 https://youtu.be/bLaSB9P2MEE Visit us on the Web SUBSCRIBE to us on YouTube Subscribe to Our Podcast: https://podcasts.apple.com/us/podcast/ex-jehovahs-witnesses-critical-thinkers-critical-thought/id967813520 Follow us on: Twitter Instagram Facebook Check out our t-shirt designs: How to Contact Us We appreciate hearing from our viewers; however, we do not have enough staff or resources to communicate with everyone. We rarely check messages in our social media platforms (i.e., Facebook, Twitter, Instagram, etc.), therefore, if you want to reach us, email us directly at the email address listed below: ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2024-09-05T16:00:00Z",
      "duration": "00:51:38.6970000",
      "explicit": false,
      "spotifyId": "6n5BXiYitvKo4SUfKlH0iN",
      "appleId": 1000668506522,
      "youTubeId": "VHhW7UUi2pw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6n5BXiYitvKo4SUfKlH0iN",
        "apple": "https://podcasts.apple.com/podcast/monica-velin-rodriguez-mother-abducted-by-her-jehovahs/id967813520?i=1000668506522",
        "youtube": "https://www.youtube.com/watch?v=VHhW7UUi2pw"
      }
    },
    {
      "id": "4aa24c13-6748-4114-8d69-bf26289a9d0a",
      "title": "Freedom of Speech: Voices Rise Against the Governing Body of Jehovah\u0027s Witnesses",
      "description": "Welcome to a powerful session of truth-telling and empowerment. In this video, we dive deep into the experiences of those who have dared to challenge the authority of the Governing Body. Through candid discussions, we uncover the personal and collective journeys of bravery that inspire and ignite change. Why Listen to this Podcast? Discover Untold Stories: Hear firsthand the compelling narratives of individuals who have stepped away from the shadows of control. Experience Group Therapy: Witness the therapeutic power of open dialogue in a supportive community setting. Get Inspired: Learn how breaking the silence can lead to healing and personal growth. Whether you\u0027re someone who has experienced similar challenges or you\u0027re simply interested in learning about the resilience of the human spirit, this video is for you. Join us as we celebrate the voices that refuse to be silenced, offering insights that challenge the norm and pave the way for a future of freedom and understanding. Support the show",
      "release": "2024-04-20T19:00:00Z",
      "duration": "01:29:57.7330000",
      "explicit": false,
      "spotifyId": "6w1WDWe6jOw6dOCsmuVHwS",
      "appleId": 1000653073806,
      "youTubeId": "0jE0fEwF41o",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6w1WDWe6jOw6dOCsmuVHwS",
        "apple": "https://podcasts.apple.com/podcast/freedom-of-speech-voices-rise-against-the-governing/id967813520?i=1000653073806",
        "youtube": "https://www.youtube.com/watch?v=0jE0fEwF41o"
      }
    },
    {
      "id": "c9e2d43c-b21d-4e41-a762-4ee2647a2fae",
      "title": "Awaken Truths - Jeven \u0026 Lexie Jehovah\u0027s Witness Exit Story",
      "description": "Our guests: Awaken Truths - https://www.youtube.com/@UCPWA3KaDx-MFFNwsOhjXAqg Healing Journal PIMO Edition https://www.lulu.com/shop/alexis-smith-and-jeven-sly/healing-journal-pimo-edition/paperback/product-gjv9m4q.html?q=Healing\u0026#43;journal\u0026#43;pimo\u0026page=1\u0026pageSize=4 Rebuilding After A Cult: A Journal To Healing https://www.lulu.com/shop/jeven-sly-and-alexis-smith/rebuilding-after-a-cult-a-journey-to-healing/paperback/product-yvz8dzr.html?q=Rebuilding\u0026#43;after\u0026#43;a\u0026#43;cult\u0026page=1\u0026pageSize=4 In this heart-to-heart episode, Lady Cee and JT sit down with the dynamic duo behind the \u0022Awaken Truths\u0022 YouTube channel. This young couple shares their courageous journey of leaving the Watchtower, unveiling the challenges and revelations that led them to seek a life beyond its confines. \u0026#x1f50d; Why Watch? Relatable Experiences: Hear firsthand the struggles and triumphs of breaking free from a high-cost religion. Insights \u0026 Reflections: Discover the pivotal moments that awakened them to new truths, reshaping their path forward. Community \u0026 Support: Learn about the importance of finding a community that understands and supports your journey towards freedom and authenticity. \u0026#x1f308; What\u0027s Inside? From the initial doubts to the liberating steps of leaving and the aftermath of such a significant life change, our guests open up about the emotional rollercoaster that comes with such a profound transformation. They also share valuable advice for others who might be on the fence or in the process of leaving high-control groups. \u0026#x1f4e3; Join Us Tune in to this powerful episode on the \u0022EXJW Critical Thinker\u0022 channel. Whether you\u0027re navigating your own journey away from the Watchtower or you\u0027re here to support and learn, this conversation is a beacon of hope, strength, and solidarity. \u0026#x1f4ac; We Want to Hear from You! After watching, drop us a comment! Share your thoughts, experiences, or any questions you have for us or our incredible guests. Your voice is a vital part of this community, and together, we can continue to support and uplift each other. \u0026#x1f517; Subscribe \u0026 Share If you found value in this episode, please consider subscribing to our channel and sharing this video. By spreading awareness, we can help more individuals find the courage to seek their own truths and lead a life of freedom and authenticity. Join us behind the scenes on Patreon - https://www.patreon.com/exjwcriticalthinker Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Subscribe to Our Podcast: https://podcasts.apple.com/us/podcast/ex-jehovahs-witnesses-critical-thinkers-critical-thought/id967813520 Support the show",
      "release": "2024-04-12T01:00:00Z",
      "duration": "01:07:55.4410000",
      "explicit": false,
      "spotifyId": "2iSQqVTg0UQnGBKEikWE5A",
      "appleId": 1000652207072,
      "youTubeId": "Jtx5o8sXC80",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2iSQqVTg0UQnGBKEikWE5A",
        "apple": "https://podcasts.apple.com/podcast/awaken-truths-jeven-lexie-jehovahs-witness-exit-story/id967813520?i=1000652207072",
        "youtube": "https://www.youtube.com/watch?v=Jtx5o8sXC80"
      }
    },
    {
      "id": "533d923f-4e4d-453d-985e-5227edc7760f",
      "title": "Governing Body\u0027s Policy Changes: Unpacking the Aftermath",
      "description": "Dive into an engaging exploration with Lady Cee and JT as we dissect the recent, surprising shifts in Jehovah\u0027s Witnesses\u0027 policies on dress and grooming. This episode takes a closer look at the impact and reactions to the acceptance of beards and changes in dress code, blending humor with heartfelt stories from the community. Highlights: A light-hearted look at the evolution of JW dress and grooming standards. Insightful commentary on Mark Sanderson\u0027s groundbreaking announcement and its ripple effects. Real-life stories capturing the personal side of adapting to new norms. A humorous prediction of future \u0027beard committees\u0027 and fashion policing. Reflections on the broader implications of these changes for the JW community and beyond. Join us as we navigate through laughter and learning, uncovering what these developments mean for individual expression and community dynamics. Stay tuned for a blend of entertainment, insights, and the kind of stories that bring us all closer together. Support the show",
      "release": "2024-03-24T01:00:00Z",
      "duration": "00:15:11.3070000",
      "explicit": false,
      "spotifyId": "1Qy3PSamDnluAtbKe7WebC",
      "appleId": 1000650234702,
      "youTubeId": "TFdYJfpy5Zs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Qy3PSamDnluAtbKe7WebC",
        "apple": "https://podcasts.apple.com/podcast/governing-bodys-policy-changes-unpacking-the-aftermath/id967813520?i=1000650234702",
        "youtube": "https://www.youtube.com/watch?v=TFdYJfpy5Zs"
      }
    },
    {
      "id": "caa0e86a-768d-4cc2-b18a-4d8606250ba7",
      "title": "Recovery From Our Accident - Navigating Healthcare as Ex-JWs",
      "description": "In this heartfelt episode of \u0022A Critical Thought,\u0022 Lady Cee and JT open up about their recent journey of recovery following a car accident. They extend their deepest gratitude for the overwhelming support from the community, including well-wishes, emails, and care packages that have been a source of strength during this challenging time. As they navigate the path to healing, Lady Cee and JT share insightful reflections on their experiences within the healthcare system, touching on the complexities of being former Jehovah\u0027s Witnesses and the unexpected conversations that arose with medical professionals. From discussions about the Hospital Liaison Committee to the personal revelations in hospital records, this episode delves into the importance of critical thinking and the power of personal advocacy in medical settings. Moreover, they explore the broader implications of identity and belief systems on healthcare interactions and the significance of ensuring personal records accurately reflect one\u0027s current beliefs. This episode is not just a story of physical recovery but a testament to the resilience of the human spirit and the continuous journey of self-discovery and advocacy. Join Lady Cee and JT as they share their thoughts, experiences, and the lessons learned along the way. Whether you\u0027re navigating your own challenges or seeking to understand the intricate dance between personal beliefs and professional healthcare, this episode offers a compelling blend of personal stories, critical insights, and heartfelt advice. Support the show",
      "release": "2024-02-13T02:00:00Z",
      "duration": "00:18:13.8510000",
      "explicit": false,
      "spotifyId": "4EbS93MWkaGXDatGBGO4dw",
      "appleId": 1000645127364,
      "youTubeId": "Ok-p8TsvsOk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EbS93MWkaGXDatGBGO4dw",
        "apple": "https://podcasts.apple.com/podcast/recovery-from-our-accident-navigating-healthcare-as-ex-jws/id967813520?i=1000645127364",
        "youtube": "https://www.youtube.com/watch?v=Ok-p8TsvsOk"
      }
    },
    {
      "id": "51a5a80a-0ca8-49c3-867c-b2693d29efc9",
      "title": "Interview with Efrain: Why I Left the Jehovah\u0027s Witness Faith",
      "description": "La Verdad al Descubierto: Efrain Revela Por Qué Dejó los Testigos de Jehová - Charla Íntima con JT y Lady Cee English Only Version - However be sure to visit Efrain\u0027s show on six screens of Watchtower - see details below: \u0026#x1f539; Video Description: In this eye-opening episode of EXJW Critical Thinker, join your host, Lady Cee, as she delves into the captivating and courageous story of Efrain. Once a devout Jehovah\u0027s Witness, Efrain embarked on a daring quest for personal freedom, challenging the beliefs he was raised with and facing the daunting task of starting anew. \u0026#x1f539; About This Episode: Efrain shares his deeply personal experiences - from his initial faith in the Jehovah\u0027s Witnesses to the pivotal moments that led him to seek a life beyond the religion. His story is not just about leaving a faith; it\u0027s about the resilience and strength it takes to redefine one\u0027s identity and purpose. \u0026#x1f539; Efrain\u0027s Activism: Beyond his personal journey, Efrain is a beacon of hope and support for others navigating similar paths. His activism work is a source of inspiration and guidance for many who find themselves in the crossroads of faith and personal freedom. \u0026#x1f539; Connect with Efrain: Discover more about Efrain\u0027s inspiring journey and his impactful activism by visiting his YouTube channel, OASIS Ex Testigos, at [https://www.youtube.com/@araretreat](https://www.youtube.com/@araretreat). On his channel, Efrain not only shares his personal insights and stories but also features interviews with members of the Spanish-speaking community. These interviews shed light on the diverse experiences of those who have been part of or have left the Jehovah\u0027s Witness community. Efrain\u0027s channel is a rich resource for understanding, support, and solidarity, especially for Spanish-speaking individuals navigating similar paths. Streaming Live 2 Saturday\u0027s/Month @ 4:00 P.M. Central Daylight Time \u0026#x1f539; Stay Engaged: If Efrain\u0027s story resonates with you, or if you\u0027re seeking support and community, don\u0027t hesitate to reach out and connect with him. Remember, you\u0027re not alone in this journey. \u0026#x1f539; Support Our Channel: If you found this episode enlightening and empowering, please like, share, and subscribe to EXJW Critical Thinker. Your support helps us continue to bring these important stories and voices to the forefront. Thank you for watching, and remember, keep thinking critically and stay strong. Join us behind the scenes on Patreon - https://www.patreon.com/exjwcriticalthinker Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Subscribe to Our Podcast: https://podcasts.apple.com/us/podcast/ex-jehovahs-witnesses-critical-thinkers-critical-thought/id967813520 Follow us on: Twitter https://twitter.com/ExJWsThink Instagram https://www.instagram.com/exjwcriticalthinker/ Facebook https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ Check out our t-shirt designs: https://exjwcriticalthinker.myspreadshop.com/all How to Contact Us We appreciate hearing from our viewers; however, we do not have enough staff or resources to communicate with everyone. We rarely check messages in our social media platforms (i.e., Facebook, Twitter, Instagram, etc.), therefore, if you want to reach us, email us directly at the email address listed below: ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2023-11-13T14:00:00Z",
      "duration": "01:11:26.1970000",
      "explicit": false,
      "spotifyId": "0Y1bLRVMWHStuGV1QrSeIl",
      "appleId": 1000634646654,
      "youTubeId": "owJ4BPTE674",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Y1bLRVMWHStuGV1QrSeIl",
        "apple": "https://podcasts.apple.com/podcast/interview-with-efrain-why-i-left-the-jehovahs-witness-faith/id967813520?i=1000634646654",
        "youtube": "https://www.youtube.com/watch?v=owJ4BPTE674"
      }
    },
    {
      "id": "51ed3480-d728-4f5b-bd0c-f929fd84b6ae",
      "title": "Jehovah\u0027s Witnesses: No More Counting Field Service Hours \u0026 Placements",
      "description": "Lady Cee and JT are back to unpack a major announcement from the Jehovah\u0027s Witness Headquarters! \u0026#x1f6a8; \u0022Are Jehovah\u0027s Witnesses Cancelling their Door-to-Door Proselytizing for the Rank \u0026 File?\u0022 \u0026#x1f6aa;\u0026#x1f6d1; For countless years, knocking on doors and sharing the message has been at the heart of the Jehovah\u0027s Witnesses\u0027 outreach. But now, a significant change in reporting practices suggests a potential shift in how the rank \u0026 file engage in proselytizing. Could this be a hint at a more substantial transformation within the organization? Or is it just a modern adaptation to the changing times? Join us as we dive deep into the implications and motivations behind this move, explore how it may impact the perception of Jehovah\u0027s Witnesses, and discuss the broader landscape of faith outreach in today\u0027s world. \u0026#x1f30d;\u0026#x1f4ac; Your insights and perspectives are valued! Be part of this enlightening conversation, and together, let\u0027s uncover the layers behind this development. \u0026#x1f9d0;\u0026#x1f50d; Want to create live streams like this? Check out StreamYard : Previous videos produced by EXJW Critical Thinker on the topic of counting time: Part 1 - Counting Time - Why Are Jehovah\u0027s Witnesses Always on the Clock? Part 2 - Counting Time - Why Are Jehovah\u0027s Witnesses Required to Turn in Timesheets? Part 3 - Counting Time - Required to Turn in Timesheets Part 4 – Counting Time - Jehovah\u0027s Witnesses and the Publisher Record Card Support the show",
      "release": "2023-10-09T01:00:00Z",
      "duration": "01:26:14.7780000",
      "explicit": false,
      "spotifyId": "5WvVGmNoOepgUfzhFFn6f4",
      "appleId": 1000630638104,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WvVGmNoOepgUfzhFFn6f4",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-no-more-counting-field-service-hours/id967813520?i=1000630638104"
      }
    },
    {
      "id": "e0fc056e-b30e-4d2b-809e-0c3d76403f34",
      "title": "Jehovah\u0027s Witnesses, We Have a Deficit - Where\u0027s My Money?",
      "description": "In this video JT focuses on his personal experience with the the financial aspects of Jehovah\u0027s Witnesses\u0027 circuit assemblies and regional conventions. JT also discusses the lack of transparency in the organization\u0027s financial dealings, particularly at higher levels. Key Points: 1. **Always in the Red**: JT mentions that circuit assemblies always seem to be running a deficit, something he questioned even as a child. He didn\u0027t understand why until he became an elder and was responsible for circuit assembly accounts. 2. **Per Publisher Rate**: The organization charges a \u0022per publisher rate\u0022 for every circuit assembly, guaranteeing a certain amount of money will be generated. For example, if the rate is $10 per publisher and there are 1,000 publishers, the assembly starts $10,000 in the red. 3. **Lack of Transparency**: While local Kingdom Halls and circuit assemblies provide detailed accounts of their finances, this transparency is not extended to district or regional conventions. The organization has never disclosed how much money is collected at these larger events. 4. **Accounting Practices**: At the local level, two people are required to count and sign off on the money collected, adhering to good accounting practices. However, this level of scrutiny is not applied at higher organizational levels. 5. **Money Makers**: JT points out that these assemblies and conventions are significant moneymakers for the organization. Despite this, there\u0027s no clear accounting provided to the general membership about where this money goes or how it\u0027s used. 6. **Personal Experience**: JT shares anecdotes from his time as an elder, including the pressure to meet financial targets and the lack of questioning among the elders about keeping some money in the account for future needs. 7. **Change in Policy**: Due to instances of \u0022borrowing\u0022 (essentially stealing), the organization changed its policy to require two people to count and sign off on any money collected, even at the smaller book study level. The video aims to encourage critical thinking about the financial aspects of being a Jehovah\u0027s Witness, questioning the lack of transparency and accountability in the organization\u0027s handling of funds. Join us behind the scenes on Patreon Support the show",
      "release": "2023-10-04T23:00:00Z",
      "duration": "00:15:27.4510000",
      "explicit": false,
      "spotifyId": "0ft9DvlffXLL5OgXs736w4",
      "appleId": 1000630244690,
      "youTubeId": "HLcV7YA-Aso",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ft9DvlffXLL5OgXs736w4",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-we-have-a-deficit-wheres-my-money/id967813520?i=1000630244690",
        "youtube": "https://www.youtube.com/watch?v=HLcV7YA-Aso"
      }
    },
    {
      "id": "cc0ade6c-198c-4048-b3e1-fc163fed6105",
      "title": "Why Former Bethelite Elder Leaves the Jehovah\u0027s Witness Faith",
      "description": "00:00 Introduction 06:28 1914 Generation Changes 12:17 Separating the Sheep \u0026 the Goats (changed) 13:04 Alternative Military Service EXJW Critical Thinker Classics August 15, 1998 Watchtower Article: Strengthening Our Confidence in God’s Righteousness https://wol.jw.org/en/wol/d/r1/lp-e/1998604 Located under the subheading - Feelings of Having Suffered Needlessly Join us behind the scenes on Patreon Visit us on the Web SUBSCRIBE to us on YouTube Subscribe to Our Podcast : Support the show",
      "release": "2023-10-04T17:00:00Z",
      "duration": "00:24:45.1650000",
      "explicit": false,
      "spotifyId": "6yRBtxOTei3HY4QP3CH8Gc",
      "appleId": 1000630213114,
      "youTubeId": "yBoqBduGnEg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6yRBtxOTei3HY4QP3CH8Gc",
        "apple": "https://podcasts.apple.com/podcast/why-former-bethelite-elder-leaves-the-jehovahs/id967813520?i=1000630213114",
        "youtube": "https://www.youtube.com/watch?v=yBoqBduGnEg"
      }
    },
    {
      "id": "101d6bde-14ff-4eb4-8430-e42e6ea84e10",
      "title": "EXJW Support Group: Empowering Lives After Leaving the Jehovah\u0027s Witnesses",
      "description": "https://theliberati.org/ EXJW Support Group Support the show",
      "release": "2023-09-21T03:00:00Z",
      "duration": "00:34:35.7680000",
      "explicit": false,
      "spotifyId": "6MYHjJqlo3gEswvoG2TPT8",
      "appleId": 1000628651232,
      "youTubeId": "6UZkypaTmVI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6MYHjJqlo3gEswvoG2TPT8",
        "apple": "https://podcasts.apple.com/podcast/exjw-support-group-empowering-lives-after-leaving-the/id967813520?i=1000628651232",
        "youtube": "https://www.youtube.com/watch?v=6UZkypaTmVI"
      }
    },
    {
      "id": "dedab44f-360b-48f7-96a7-8d2b959861c1",
      "title": "From Faith to Freedom: Meet Phylice, She\u0027s Totally Awake",
      "description": "Join us in this heartfelt and eye-opening episode of the Critical Thought Podcast, as we sit down with Phylice (https://www.youtube.com/@totallyawakeexjw), who courageously shares her journey \u0027From Faith to Freedom.\u0027 Phylice takes us through her awakening from the Jehovah\u0027s Witnesses, a journey fraught with personal challenges, probing questions, and intimate revelations. She recounts the painful experience of being disfellowshipped, privately reproved, and subjected to judicial meetings, where elders demanded personal details about the sins she confessed. But Phylice\u0027s story is not just one of struggle; it\u0027s one of triumph and love as well. During a life-changing visit to her cousin in Colorado, Phylice met her future husband, a dedicated Military man who became the catalyst for her ultimate liberation from the faith. Together, they navigated the complex and painful process of cutting ties with the Jehovah\u0027s Witness community. But Phylice\u0027s journey didn\u0027t end there. She opens up about the struggles of being shunned by her family, the painful decision to write a letter of disassociation, and the emotional toll it took on her. Yet, through it all, she found strength, resilience, and a new life of authenticity and joy. Tune in to hear Phylice\u0027s inspiring story, filled with lessons of courage, self-discovery, and the pursuit of true freedom. Whether you\u0027re familiar with the Jehovah\u0027s Witness faith or just intrigued by tales of personal transformation, Phylice\u0027s story will touch your heart and inspire your spirit. Support the show",
      "release": "2023-09-13T23:00:00Z",
      "duration": "00:50:01.3640000",
      "explicit": false,
      "spotifyId": "0PaZjca2murx971BXXg8uI",
      "appleId": 1000627906338,
      "youTubeId": "mRj_CAUpGyk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PaZjca2murx971BXXg8uI",
        "apple": "https://podcasts.apple.com/podcast/from-faith-to-freedom-meet-phylice-shes-totally-awake/id967813520?i=1000627906338",
        "youtube": "https://www.youtube.com/watch?v=mRj_CAUpGyk"
      }
    },
    {
      "id": "4dc55da7-7190-48ac-a585-93b2aa94ed12",
      "title": "Meet Daria! Your Best Free Therapy Session After Leaving the Jehovah\u0027s Witnesses",
      "description": "\u0026#x1f44b; Welcome to another eye-opening episode that you simply can\u0027t afford to miss. Today, we have a special guest who embodies the spirit of resilience and healing—meet Daria. \u0026#x1f6d1; Stop whatever you\u0027re doing and listen up. Daria\u0027s not just any guest; she\u0027s your best *free therapy session* after leaving Jehovah\u0027s Witnesses. \u0026#x1f331; **About Daria:** She\u0027s brave and candid, opening up about the tough choices she had to make—leaving, fading, and doing whatever it took to reclaim her life. Despite walking away from the organization, she hasn\u0027t lost her faith. \u0026#x1f914; **Know Thyself:** Daria emphasizes the importance of self-discovery after leaving. According to her, healing is a journey, not a destination. Take your time to get to know the *real you* outside the confines of your past life. \u0026#x1f494; **Life Happens:** It wasn\u0027t all smooth sailing. Daria overcame toxic relationships and even battled cancer. Her experiences have given her the kind of therapeutic wisdom that\u0027s far more valuable than any textbook can offer. \u0026#x1f64c; **Why You Must Watch:** Whether you\u0027re just thinking about leaving, in the process, or years into your new life, Daria\u0027s insights will resonate. Get ready for a transformative talk that might just be the therapy session you didn\u0027t know you needed. \u0026#x1f447; Hit that \u0027Subscribe\u0027 button to stay updated on more therapeutic conversations and healing stories. Your new life starts here! Support the show",
      "release": "2023-08-26T00:00:00Z",
      "duration": "01:28:51.9830000",
      "explicit": false,
      "spotifyId": "5k73ZLXtmqJSrEdVc5p8AD",
      "appleId": 1000625729132,
      "youTubeId": "0KcLuo_7gUc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5k73ZLXtmqJSrEdVc5p8AD",
        "apple": "https://podcasts.apple.com/podcast/meet-daria-your-best-free-therapy-session-after-leaving/id967813520?i=1000625729132",
        "youtube": "https://www.youtube.com/watch?v=0KcLuo_7gUc"
      }
    },
    {
      "id": "3888cbfa-5ce1-4b8b-84d6-a816a9c7f20c",
      "title": "Jehovah\u0027s Witness Elder Facing Mortality: Regrets After 40 Years of Shunning His Daughter",
      "description": "In this deeply moving and revealing episode, Gail shares her heart-wrenching story of being shunned by her father, an Elder in the Jehovah\u0027s Witness congregation, for 40 long years. Facing his mortality, her father calls her to his side, where he opens up about his regrets and the choices that kept them apart for so long. Through Gail\u0027s powerful narration and a candid exploration of belief, family, and forgiveness, viewers will journey with her as she uncovers the painful truths hidden beneath years of silence. But just when you think you\u0027ve heard it all, a shocking twist awaits. You\u0027ll want to watch until the very end to discover the full impact of this emotional tale. This episode is not just about a father and daughter\u0027s reunion; it\u0027s a universal story about the complexity of faith, the consequences of our choices, and the healing power of reconciliation. Join us as we delve into Gail\u0027s story, offering a unique glimpse into the often-misunderstood world of the Jehovah\u0027s Witnesses, and learn about the profound impact that shunning can have on individuals and families. This is a story of loss, love, regret, and redemption that you won\u0027t want to miss. Make sure to watch until the end for a revelation that will leave you speechless. Support the show",
      "release": "2023-08-07T12:00:00Z",
      "duration": "00:42:33.2080000",
      "explicit": false,
      "spotifyId": "55ERqHAQ09mne3xt5EwgLy",
      "appleId": 1000623685376,
      "youTubeId": "zGjjwRNjz1s",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/55ERqHAQ09mne3xt5EwgLy",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witness-elder-facing-mortality-regrets-after/id967813520?i=1000623685376",
        "youtube": "https://www.youtube.com/watch?v=zGjjwRNjz1s"
      }
    },
    {
      "id": "185d555b-a71b-4cff-a9cb-68e90bd90357",
      "title": "Jehovah\u0027s Witnesses: The Special Treatment of Anthony Morris!",
      "description": "In this episode, we uncover a significant revelation surrounding the Watchtower Bible and Tract Society\u0027s recent housing acquisition for former Governing Body member, Anthony Morris, and his wife. Public records have brought to light the organization\u0027s purchase of a brand new home for the couple, with a unique arrangement allowing them to reside there for their lifetime before ownership reverts back to the Watchtower. We delve into the concerning disparities between this treatment and the experiences of rank and file Bethelites. While Anthony Morris received this apparent generosity, many others were asked to leave without any monetary support, raising questions about fairness within the organization. Join us as we discuss this sensitive topic and examine the implications of such actions. The episode offers an insightful exploration of the perceived double standard within the Watchtower, providing a platform for viewers to reflect on the situation and share their perspectives. Remember to like and subscribe to stay informed about the Jehovah\u0027s Witnesses community and other thought-provoking content. Your engagement helps foster open discussions and awareness. Let\u0027s explore these complex issues together, shedding light on the matters that deserve our attention. Reference Originating Video - Blue Envelope https://www.youtube.com/watch?v=GW4IDrB0xG4\u0026t=285s Support the show",
      "release": "2023-08-01T01:00:00Z",
      "duration": "00:10:45.7990000",
      "explicit": false,
      "spotifyId": "75WTSqwOjjVbaaal90xJdm",
      "appleId": 1000623000718,
      "youTubeId": "2XlIeu_Z4hA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/75WTSqwOjjVbaaal90xJdm",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-the-special-treatment-of/id967813520?i=1000623000718",
        "youtube": "https://www.youtube.com/watch?v=2XlIeu_Z4hA"
      }
    },
    {
      "id": "8632c382-9df4-4431-9564-5fb3a54497f8",
      "title": "Jehovah\u0027s Witnesses - How Much Do You Care About Children? Hear Lucille\u0027s Account of Reporting Child CSA",
      "description": "In this powerful video, we share the compelling story of Lucille, a brave individual who took decisive steps to report a case of Child CSA (Child Sexual Abuse). As a former Jehovah\u0027s Witness, Lucille faced an incredibly challenging situation but demonstrated unwavering determination to protect the innocent and advocate for justice. With immense courage, Lucille first contacted Child Protective Services, knowing the gravity of her responsibility in safeguarding the vulnerable child involved. Recognizing the urgency of the situation, she sought professional intervention to ensure the safety and well-being of the young victim. Additionally, Lucille also felt compelled to address the matter and decided to approach the Elders at the local Kingdom Hall to raise awareness and demand appropriate action. This decision was a significant step in holding those responsible accountable and reinforcing the importance of protecting children within the congregation. Furthermore, Lucille\u0027s journey did not end there. She realized the necessity of reporting the incident to the higher authorities within the Jehovah\u0027s Witnesses organization. Understanding the significance of collective efforts in combating such issues, she reached out to The Watchtower Bible \u0026 Tract Society, seeking transparency, accountability, and changes to prevent future occurrences. Lucille\u0027s experience serves as an inspiring example of how individuals can take proactive measures to protect children from the horrors of abuse, even within complex institutional structures. Her unwavering commitment to justice and child protection resonates as a beacon of hope and encouragement for others who may find themselves in similar circumstances. Join us in watching this empowering video as Lucille recounts her journey of courage, resilience, and advocacy, inspiring viewers to be part of the solution and work towards a safer environment for all children. Let us stand united in the fight against Child CSA and create a world where every child\u0027s innocence is safeguarded. Support the show",
      "release": "2023-08-01T01:00:00Z",
      "duration": "00:22:19.4020000",
      "explicit": false,
      "spotifyId": "3hzF2bsI6maz78ehCistlB",
      "appleId": 1000623000665,
      "youTubeId": "RqWS1gFPgyI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hzF2bsI6maz78ehCistlB",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-how-much-do-you-care-about-children/id967813520?i=1000623000665",
        "youtube": "https://www.youtube.com/watch?v=RqWS1gFPgyI"
      }
    },
    {
      "id": "6505d1da-2b42-4b34-95ec-a00494d90193",
      "title": "New Charges Unveiled: Five Additional Jehovah\u0027s Witnesses Indicted for CSA in Pennsylvania",
      "description": "In this episode, we discuss the recent indictments within the Jehovah\u0027s Witnesses organization involving child sexual abuse. We provide a summary of the charges and the individuals involved, emphasizing the disturbing nature of the cases. We highlight the role of an investigative grand jury in reviewing the evidence and recommending the charges. Additionally, we address the challenges survivors face within the organization due to its policies and secrecy surrounding judicial matters. The episode covers the announcement and the hosts\u0027 commentary on the recent indictments within the Jehovah\u0027s Witnesses organization. It aims to shed light on the gravity of the situation and the difficulties survivors may encounter within the organization. Resources: MSN: \u0022Five Men from Jehovah\u0027s Witnesses Charged with Child Sexual Abuse: Attorney General\u0022 - In this video report, learn about the indictments and charges brought against five individuals associated with Jehovah\u0027s Witnesses in Pennsylvania. Link: Watch the video NBC Philadelphia: \u0022Charges Probe Child Sexual Abuse Among Jehovah\u0027s Witnesses in Pennsylvania\u0022 - Read this article for a comprehensive overview of the ongoing investigation and charges related to child sexual abuse within the Jehovah\u0027s Witnesses organization. Link: Read the article Support the show",
      "release": "2023-07-15T01:00:00Z",
      "duration": "00:11:46.3510000",
      "explicit": false,
      "spotifyId": "3AbDAmAWGvzV7KblLnaJ0B",
      "appleId": 1000621212042,
      "youTubeId": "AHTz2bFge08",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3AbDAmAWGvzV7KblLnaJ0B",
        "apple": "https://podcasts.apple.com/podcast/new-charges-unveiled-five-additional-jehovahs-witnesses/id967813520?i=1000621212042",
        "youtube": "https://www.youtube.com/watch?v=AHTz2bFge08"
      }
    },
    {
      "id": "986ff131-f03a-411f-a54b-5ef019a1e209",
      "title": "Why Jehovah\u0027s Witnesses Don\u0027t Celebrate Mother\u0027s Day",
      "description": "Links to References Gregorian Calendar https://www.thecenterforruleoflaw.org/rule-of-law-blog/october-4-1582-the-gregorian-calendar-is-introduced-by-pope-gregory-xiii Golden Age (aka Awake! Magazine) March 13, 1935 March 27, 1935 April 10, 1935 calendar [photo] 1935 yearbook page 168 Calendar - Tool of Satan March 1st 1935 page 80 https://www.jw.org/en/library/magazines/g20030922/The-Pi%C3%B1ata-An-Ancient-Tradition/ Support the show",
      "release": "2023-05-15T01:00:00Z",
      "duration": "00:06:50.0960000",
      "explicit": false,
      "spotifyId": "2kOU8tEq0GvH5gyiqVlwUT",
      "appleId": 1000613005680,
      "youTubeId": "1kb930FTpPc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2kOU8tEq0GvH5gyiqVlwUT",
        "apple": "https://podcasts.apple.com/podcast/why-jehovahs-witnesses-dont-celebrate-mothers-day/id967813520?i=1000613005680",
        "youtube": "https://www.youtube.com/watch?v=1kb930FTpPc"
      }
    },
    {
      "id": "3e2cdba9-43ad-4a94-8592-ef34109908ee",
      "title": "Struggles of Jehovah\u0027s Witness Youths - Should I Regular Pioneer After High School",
      "description": "In this podcast, Ryan shares his experience on what it was like making choices as a young person graduating from high school. Unfortunately, the advice given by the elders in the congregation left him feeling helpless and hopeless when they begin encouraging him to regular pioneer. After taking the advice of the elders, Ryan chose to regular pioneer but quickly realized that he was unable to pay his bills. He was just struggling to survive. Fortunately, Ryan woke up and began to reexamine his situation. Perhaps you have had a similar experience where you gave up dreams, goals and aspirations to please the brothers in your local congregation. This happens all too many times where young people make decisions that drastically affect their ability to take care of their material needs much later in life. And, as Ryan discusses in this video, he was struggling to make ends meet every day. We hope this presentation will help you to think about your own career choices as you begin to navigate the waters in the \u0022real world\u0022. Support the show",
      "release": "2023-05-07T23:00:00Z",
      "duration": "00:16:57.9390000",
      "explicit": false,
      "spotifyId": "5aG2bYG7A1phRGDnmwsHBb",
      "appleId": 1000612104648,
      "youTubeId": "koYMjMmV94s",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5aG2bYG7A1phRGDnmwsHBb",
        "apple": "https://podcasts.apple.com/podcast/struggles-of-jehovahs-witness-youths-should-i/id967813520?i=1000612104648",
        "youtube": "https://www.youtube.com/watch?v=koYMjMmV94s"
      }
    },
    {
      "id": "a58775a5-5546-4580-8817-6671793f6532",
      "title": "Navigating the Watchtower Judicial Process: Six Reporting Guidelines for Elders",
      "description": "In this episode, we explore six important instructions given to elders during the Kingdom Ministry Schools regarding the Watchtower judicial process. These guidelines aim to maintain confidentiality and uphold the authority of the organization. We delve into each instruction, discussing its significance and potential impact on the judicial proceedings. Join us as we examine the reasons behind these reporting restrictions and their implications for the decision-making process within the congregation. Whether you\u0027re a current or former Jehovah\u0027s Witness or simply interested in understanding the inner workings of religious organizations, this episode offers valuable insights into the Watchtower judicial system. Join us behind the scenes on Patreon - https://www.patreon.com/exjwcriticalthinker Support the show",
      "release": "2023-04-30T00:00:00Z",
      "duration": "00:17:54.8340000",
      "explicit": false,
      "spotifyId": "7i41tSLsu9XIo8VUKfdXAf",
      "appleId": 1000611156022,
      "youTubeId": "ZpTSrm6Ggks",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7i41tSLsu9XIo8VUKfdXAf",
        "apple": "https://podcasts.apple.com/podcast/navigating-the-watchtower-judicial-process-six/id967813520?i=1000611156022",
        "youtube": "https://www.youtube.com/watch?v=ZpTSrm6Ggks"
      }
    },
    {
      "id": "fe9ace1b-546f-41ac-9347-45ce23aa8bad",
      "title": "The Memorial: Governing Body vs. Faithful \u0026 Discreet Slave",
      "description": "The Jehovah\u0027s Witnesses \u0026 the Memorial What happens after the festivities of passing the bread and the wine? How many people will partake this year? Support the show",
      "release": "2023-04-13T03:00:00Z",
      "duration": "00:15:22.8530000",
      "explicit": false,
      "spotifyId": "04dgrsnOfn433liHLLW610",
      "appleId": 1000608734963,
      "youTubeId": "JGpMmYd0xmc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/04dgrsnOfn433liHLLW610",
        "apple": "https://podcasts.apple.com/podcast/the-memorial-governing-body-vs-faithful-discreet-slave/id967813520?i=1000608734963",
        "youtube": "https://www.youtube.com/watch?v=JGpMmYd0xmc"
      }
    },
    {
      "id": "43105063-f9c2-494d-9bc4-763de0923500",
      "title": "Life at Bethel - Jehovah\u0027s Witness Voting Members",
      "description": "Support the show",
      "release": "2023-04-05T22:00:00Z",
      "duration": "00:31:53.8080000",
      "explicit": false,
      "spotifyId": "0Noh6irr9PRG4X3RkSsK8i",
      "appleId": 1000607618644,
      "youTubeId": "7AUJcWnyEP8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Noh6irr9PRG4X3RkSsK8i",
        "apple": "https://podcasts.apple.com/podcast/life-at-bethel-jehovahs-witness-voting-members/id967813520?i=1000607618644",
        "youtube": "https://www.youtube.com/watch?v=7AUJcWnyEP8"
      }
    },
    {
      "id": "7f89951b-ec02-4dbb-8841-1b03d5301b3b",
      "title": "Eva\u0027s Story - My Family Survived the Holocaust",
      "description": "Eva is from upstate New York and one of eight siblings. She was a fifth generation Jehovah\u0027s Witness and her parents and grand parents her Holocaust survivors. All her siblings are still active in the organization. Eva has over twenty years’ experience in accounting and has decades of experience in investigating retail financial fraud and management. Eva is an advocate for individuals struggling with leaving high control religions and supporting their efforts to rejoin society. Eva has a commitment in life to be a compassionate Christian and have love for all individuals. WITNESSING FREEDOM https://witnessingfreedom.org/ https://en.wikipedia.org/wiki/Kindertransport_%E2%80%93_The_Arrival https://kindertransport-memorial.org/ https://www.hmd.org.uk/learn-about-the-holocaust-and-genocides/the-holocaust/kindertransport-refugees/ RECOVERING FROM SPIRITUAL ABUSE David Henke https://www.amazon.com/Spiritual-Abuse-Recovery-Workbook-educational-ebook/dp/B09CF1FK4R Nicky \u0026 Vera: A Quiet Hero of the Holocaust and the Children He Rescued https://www.amazon.com/Nicky-Vera-Holocaust-Children-Rescued/dp/1324015748 Join us behind the scenes on Patreon - https://www.patreon.com/exjwcriticalthinker Check out our videos on why we left the Why We Left the Jehovah\u0027s Witnesses https://youtu.be/rqYUCV4FHI4 https://youtu.be/bLaSB9P2MEE Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Subscribe to Our Podcast: https://podcasts.apple.com/us/podcast/ex-jehovahs-witnesses-critical-thinkers-critical-thought/id967813520 Follow us on: Twitter https://twitter.com/ExJWsThink Instagram https://www.instagram.com/exjwcriticalthinker/ Facebook https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ Check out our t-shirt designs: https://exjwcriticalthinker.myspreadshop.com/all How to Contact Us We appreciate hearing from our viewers; however, we do not have enough staff or resources to communicate with everyone. We rarely check messages in our social media platforms (i.e., Facebook, Twitter, Instagram, etc.), therefore, if you want to reach us, email us directly at the email address listed below: ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2023-04-04T02:00:00Z",
      "duration": "00:40:16.3520000",
      "explicit": false,
      "spotifyId": "2Q5qIThDrmhOVVXLuif8Gr",
      "appleId": 1000607263159,
      "youTubeId": "2zQLOCL_ZpY",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Q5qIThDrmhOVVXLuif8Gr",
        "apple": "https://podcasts.apple.com/podcast/evas-story-my-family-survived-the-holocaust/id967813520?i=1000607263159",
        "youtube": "https://www.youtube.com/watch?v=2zQLOCL_ZpY"
      }
    },
    {
      "id": "3afd97ad-8569-4234-8f20-b2416cd2a06f",
      "title": "Meet June \u0026 Jared and Learn how their family faded from the Jehovah\u0027s Witness Faith",
      "description": "#exjw #JehovahWitness #exjwcriticalthinker In this episode, you will meet June and Jared from the YouTube channel JUST JUNE: https://www.youtube.com/@justjune9517 Learn how Jared and his children allow themselves to speak freely about how they feel about being one of Jehovah\u0027s Witnesses. They make changes to their dress \u0026 grooming and something even more profound, their attitude about the religion as a whole. All of this is taking place and unfolding during the time June is in a rehab for 30 days. In fact, June begins to take notice of the subtle changes during their weekly visits with her at her facility. Find out what happens and how they are able to finally get June, to wake up and see the fallacies of the Watchtower, Bible \u0026 Tract Society. Support the show",
      "release": "2023-03-10T23:00:00Z",
      "duration": "00:43:17.5110000",
      "explicit": false,
      "spotifyId": "4wPqmze3K3ymL9NZyKYWsZ",
      "appleId": 1000603664285,
      "youTubeId": "Oxr30JGZcXA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wPqmze3K3ymL9NZyKYWsZ",
        "apple": "https://podcasts.apple.com/podcast/meet-june-jared-and-learn-how-their-family-faded-from/id967813520?i=1000603664285",
        "youtube": "https://www.youtube.com/watch?v=Oxr30JGZcXA"
      }
    },
    {
      "id": "78df5c75-04cf-4ede-a1c9-705e5313a088",
      "title": "Livestream: Governing Body Member of Jehovah\u0027s Witnesses, Anthony Morris, Removed from Position",
      "description": "Special livestream where we will have a live group chat about the latest changes in Watchtower leadership. Panelists Jack Grey - FEAR TO FREEDOM https://www.youtube.com/@UC7klhJjpzXeADwXHu1wdxsA David H Efrain Tim Sanfino Wendell Smith Collin - https://www.youtube.com/@covisit2023 Support the show",
      "release": "2023-03-03T01:00:00Z",
      "duration": "01:11:12.2740000",
      "explicit": false,
      "spotifyId": "6BIbrZAAtdjUxYtjX9cdtg",
      "appleId": 1000602570038,
      "youTubeId": "FRO7DGJxXUE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6BIbrZAAtdjUxYtjX9cdtg",
        "apple": "https://podcasts.apple.com/podcast/livestream-governing-body-member-of-jehovahs/id967813520?i=1000602570038",
        "youtube": "https://www.youtube.com/watch?v=FRO7DGJxXUE"
      }
    },
    {
      "id": "053d14e1-fc54-45f5-bdb2-fe5d09f07378",
      "title": "Zoom Meetings Cancelled - If You Love Jehovah, You Will Go Back to In Person Meetings",
      "description": "Guilt tripping again? Make up your mind Watchtower. First you had Mr. Hendricks participating in interviews stating that your physical location for worship does not matter. Now, you are doing commentary about those with good health and how they should be returning back to in person meetings at the Kingdom Hall. Support the show",
      "release": "2023-01-30T00:00:00Z",
      "duration": "00:11:30.7820000",
      "explicit": false,
      "spotifyId": "7M79kVygcIq3CWZJIBcSde",
      "appleId": 1000597171090,
      "youTubeId": "tvMulZbcZVM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7M79kVygcIq3CWZJIBcSde",
        "apple": "https://podcasts.apple.com/podcast/zoom-meetings-cancelled-if-you-love-jehovah-you-will/id967813520?i=1000597171090",
        "youtube": "https://www.youtube.com/watch?v=tvMulZbcZVM"
      }
    },
    {
      "id": "112c3615-a930-431b-b508-8004725401aa",
      "title": "Serena Williams: Gets Baptized as one of Jehovah\u0027s Witnesses",
      "description": "This podcast starts out reading a list of individuals and the podcaster then asks the pointed question: so now what do all of these people have in common? That\u0027s right they are celebrity Jehovah\u0027s Witnesses. And now we have Serena Williams! For many years people ask the question is Serena Williams one of Jehovah\u0027s Witnesses because at the end of each game she would often make the statement \u0022I have to thank Jehovah God\u0022, so people would ask the question, is she one of Jehovah\u0027s Witnesses? And today, we have the answer. She\u0027s a dedicated baptized Jehovah\u0027s Witness. You know there are people who will often look and say I can\u0027t believe that she became a Jehovah\u0027s Witness. Well, it\u0027s important to keep in mind what it\u0027s like to be raised as one of Jehovah\u0027s Witnesses. All your life you\u0027re told whenever you have a problem, whenever things are going bad in your life, whenever you get yourself together, return to Jehovah. And today, Serena Williams has retired from her career. She\u0027s married she has a child, and it often causes people to reflect differently on their lives. One of the things that we know that she probably didn\u0027t do, is take the time to do the research that we encourage everybody to do. We have found that many people leave the Jehovah’s Witness organization and will be gone for years and sometimes decades. They fail to take the time to ask critical thinking questions about what they learned about this religion. Instead, they simply come right back to the religion without asking questions without doing their own personal research. As a result, there are so many things that they fail to understand about the religion that impacted their life in every aspect of it. You know there’s something interesting that happens for people who are celebrity Jehovah’s Witnesses things that a regular Jehovah\u0027s Witness if they were to do would get them in a lot of trouble well as a celebrity witness is often overlooked. Support the show",
      "release": "2023-01-12T22:00:00Z",
      "duration": "00:11:39.1670000",
      "explicit": false,
      "spotifyId": "7pk4qgJ25VpyQwg99zinXC",
      "appleId": 1000594127467,
      "youTubeId": "SBFZIp3vkok",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7pk4qgJ25VpyQwg99zinXC",
        "apple": "https://podcasts.apple.com/podcast/serena-williams-gets-baptized-as-one-of-jehovahs-witnesses/id967813520?i=1000594127467",
        "youtube": "https://www.youtube.com/watch?v=SBFZIp3vkok"
      }
    },
    {
      "id": "5f89ff0b-63ae-44f7-ac2b-0b31c649554d",
      "title": "Murder Suicide in Thornton, CO - Jehovah\u0027s Witnesses \u0026 the Tragic Outcome of Shunning",
      "description": "https://www.cpr.org/2022/12/28/thornton-jehovahs-witness-murder-suicide-update/ Both Apodaca and Martinez had been members of the Jehovah\u0027s Witnesses congregation but were \u0022no longer welcome,\u0022 according to police. Officials say Apodaca had expressed interest to a member of the congregation to return to the congregation the night before the attack. https://www.psychiatry.org/patients-families/suicide-prevention Warning Signs of Suicide Often talking or writing about death, dying or suicide Making comments about being hopeless, helpless or worthless Expressions of having no reason for living; no sense of purpose in life; saying things like \u0022It would be better if I wasn\u0027t here\u0022 or \u0022I want out.\u0022 Increased alcohol and/or drug misuse Withdrawal from friends, family and community Reckless behavior or more risky activities, seemingly without thinking Dramatic mood changes Talking about feeling trapped or being a burden to others Please consider supporting our work on Patreon https://www.patreon.com/exjwcriticalthinker Check out our videos on why we left the Why We Left the Jehovah\u0027s Witnesses https://youtu.be/rqYUCV4FHI4 https://youtu.be/bLaSB9P2MEE Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Subscribe to Our Podcast: https://podcasts.apple.com/us/podcast/ex-jehovahs-witnesses-critical-thinkers-critical-thought/id967813520 Follow us on: Twitter https://twitter.com/ExJWsThink Instagram https://www.instagram.com/exjwcriticalthinker/ Facebook https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ Check out our t-shirt designs: https://exjwcriticalthinker.myspreadshop.com/all How to Contact Us We appreciate hearing from our viewers; however, we do not have enough staff or resources to communicate with everyone. We rarely check messages in our social media platforms (i.e., Facebook, Twitter, Instagram, etc.), therefore, if you want to reach us, email us directly at the email address listed below: ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2023-01-03T00:00:00Z",
      "duration": "00:18:06.1190000",
      "explicit": false,
      "spotifyId": "2EwYLAR2OOKKB4ApuSP5sG",
      "appleId": 1000591964645,
      "youTubeId": "Ok-p8TsvsOk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2EwYLAR2OOKKB4ApuSP5sG",
        "apple": "https://podcasts.apple.com/podcast/murder-suicide-in-thornton-co-jehovahs-witnesses-the/id967813520?i=1000591964645",
        "youtube": "https://www.youtube.com/watch?v=Ok-p8TsvsOk"
      }
    },
    {
      "id": "84887eec-f84c-48aa-8601-50971f7a09d0",
      "title": "Jehovah\u0027s Witnesses \u0026 Career Choices",
      "description": "n this video, we will discuss Jehovah’s Witnesses and cart witnessing and how they believe that this is one of the best career choices you can make. Because the Witnesses believe that the world is soon to end, there is no need to spend any time pursuing a career in endless pursuits. Instead, they believe that trying to convert others to learn the truth as outlined by their religion is what God wants them to do. You will learn how the Watchtower leadership misappropriates the term career by insinuating that if their members take up the task of cart witnessing, it somehow equates into a meaningful career choice. https://www.npr.org/2017/02/19/510585965/poor-education-leads-to-lost-dreams-and-low-income-for-many-jehovahs-witnesses Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Check out our videos on why we left the Why We Left the Jehovah\u0027s Witnesses https://youtu.be/rqYUCV4FHI4 https://youtu.be/bLaSB9P2MEE Visit us on the Web at http://www.exjwcriticalthinker.com Support the show",
      "release": "2022-11-22T22:00:00Z",
      "duration": "00:09:19.7250000",
      "explicit": false,
      "spotifyId": "2mksAgquGfMUAlnWZb5J6C",
      "appleId": 1000587189912,
      "youTubeId": "FdEMyb9yqB8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mksAgquGfMUAlnWZb5J6C",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-career-choices/id967813520?i=1000587189912",
        "youtube": "https://www.youtube.com/watch?v=FdEMyb9yqB8"
      }
    },
    {
      "id": "eb22a57f-ee9c-4fd2-8386-66eff240a4a5",
      "title": "Why I Left Jehovah\u0027s Witnesses 43 Years Ago, but Went Back During COVID",
      "description": "Interviewing individuals has been one of the main staples of our YouTube channel. It is interesting meeting so many devoted persons, seeking to find the truth and live genuine lives. Harriet is one such individual. You will enjoy learning about her experience as she states how she got caught up with the Jehovah\u0027s Witnesses and their love bombing, thinking she was joining a group that had good integrity, love and concern all to find out it was superficial. She leaves the organization without reservation and 43 years later returns to the group thinking they have made major changes. All to discover that it\u0027s a different time period but the same ole tactics packaged in a different box. You\u0027ve got to hear her story as she relates information about losing her child, and writing about her personal experiences to assist and comfort others. Be sure to get a copy of her book online at the following link: Being Smart About Your Health: A Black Person\u0027s Guide to Better Health and Longer Life In America Patreon - https://www.patreon.com/exjwcriticalthinker Check out our videos on why we left the Why We Left the Jehovah\u0027s Witnesses https://youtu.be/rqYUCV4FHI4 https://youtu.be/bLaSB9P2MEE Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Support the show",
      "release": "2022-11-14T18:00:00Z",
      "duration": "01:06:27.2000000",
      "explicit": false,
      "spotifyId": "5A3kGW5QWA5MUYD98zZz9j",
      "appleId": 1000586174956,
      "youTubeId": "BC9NMyRcjFE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5A3kGW5QWA5MUYD98zZz9j",
        "apple": "https://podcasts.apple.com/podcast/why-i-left-jehovahs-witnesses-43-years-ago-but-went/id967813520?i=1000586174956",
        "youtube": "https://www.youtube.com/watch?v=BC9NMyRcjFE"
      }
    },
    {
      "id": "22278c47-2688-4a01-8f78-cd780e8def1d",
      "title": "How Does the Jehovah\u0027s Witness Culture Impact Your Mental Health?",
      "description": "MENTAL HEALTH RESOURCES https://www.betterup.com/blog/mental-health-awareness https://www.mentalhealth.gov/get-help https://www.mhanational.org/finding-therapy https://www.samhsa.gov/find-help/988 https://www.cdc.gov/mentalhealth/learn/index.htm https://www.nimh.nih.gov/ You can also Google your Local Mental Health providers for those that live in different countries other than North America. Support the show",
      "release": "2022-10-11T01:00:00Z",
      "duration": "00:47:24.1860000",
      "explicit": false,
      "spotifyId": "10vkWSYeRLeuOcsTnUK8jF",
      "appleId": 1000582219646,
      "youTubeId": "zGjjwRNjz1s",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/10vkWSYeRLeuOcsTnUK8jF",
        "apple": "https://podcasts.apple.com/podcast/how-does-the-jehovahs-witness-culture-impact-your/id967813520?i=1000582219646",
        "youtube": "https://www.youtube.com/watch?v=zGjjwRNjz1s"
      }
    },
    {
      "id": "e78e1c4d-b45e-47df-a299-8ed8d433ff1f",
      "title": "Mental Health Challenges of Jehovah\u0027s Witnesses",
      "description": "00;00;20;07 - 00;01;00;13 Speaker 1 The patient was diagnosed by a psychiatrist as a paranoid schizophrenic after ten years, he was pronounced incurable and was able to stay out of the mental institution only by taking three pills every day. And then one of Jehovah\u0027s Witnesses calling from house to house managed to start a Bible study with him. After eight months, the man needed no more pills, and four months later he was pronounced fully cured. 00;01;00;18 - 00;01;39;00 Then there was the woman in Michigan who for many years had received regular psychotherapy shock treatments and had spent $5,000 on drug treatment. Yet she still kept threatening suicide. After studying the Bible with Jehovah\u0027s Witnesses, she was able to discontinue taking drugs as well as quit smoking. She found her psychiatrist to tell him that now she felt better than she had ever felt before, and what accounted for it? He replied that he wished all of his patients could find a cure like that. 00;01;46;04 - 00;02;23;16 The two experiences that you just heard, they came from the April 22nd, 1975, a week magazine. These types of articles form the foundation and the basis for the type of culture that exists among Jehovah\u0027s Witnesses. For decades, and that is people who are struggling with mental health issues. It is because you are spiritually weak. And so by citing examples of someone who had an incurable situation in their life with schizophrenia, that by reading our magazines they were cured. These types of articles were used by elders, circuit overseers and speakers all around the world to tell the Jehovah\u0027s Witnesses just read our magazines and your problems will be fixed. 00;02;38;28 - 00;03;07;19 Hi, this is Lady Cee. Welcome to the critical thought. In the upcoming episode, we\u0027re going to be talking about Jehovah\u0027s Witnesses and mental health awareness. In fact, we have a series of videos that we\u0027re going to be covering under this umbrella, talking about mental health awareness, because a lot of people, they may be experiencing these issues in their lives, but they don\u0027t realize it. And we also teamed up with a mental health professional who is going to weigh in on this matter. 00;03;17;03 - 00;03;40;25 There is still a stigma when it comes to mental health. Individuals perceive mental health as, you know, that something is wrong with me. You know, I\u0027m flawed. Know there\u0027s a deficit. I think we are addressing that stigma by taking more of a strength based approach to addressing mental health. Not what\u0027s wrong with you, but what\u0027s right about you. Maybe. Maybe we\u0027ve forgotten what was right about me. Through whatever circumstances. Of situations that. I\u0027ve I\u0027ve gone into in my life. In the mind is interesting. We can get so focused on that algorithm of negativity, too, where we only see what we believe and then. 00;04;11;07 - 00;04;23;06 Hi, I\u0027m Daniel. I am JT and the purpose of this video is to speak to you about how the Watchtower creates mental health issues for its members. Okay, JT, let\u0027s start. 00;04;23;09 - 00;04;32;11 Speaker 2 Yeah, that is something that you will find in this religion is the mental health concerns that people will end up finding themselves dealing with. 00;04;33;00 - 00;04;52;06 Speaker 3 Mm hmm. Well, a few weeks ago, we released a video, and we made the point that the Watchtower, the governing body, the witnesses and the society as a whole basically were the modern day Pharisees, but they were the modern day Pharisees because they were creating manmade mandates. Do you remember. Support the show",
      "release": "2022-09-12T17:00:00Z",
      "duration": "00:23:11.8820000",
      "explicit": false,
      "spotifyId": "7vPPZCaecdcbjluUUC0nJy",
      "appleId": 1000579234331,
      "youTubeId": "GpD453RzdzU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vPPZCaecdcbjluUUC0nJy",
        "apple": "https://podcasts.apple.com/podcast/mental-health-challenges-of-jehovahs-witnesses/id967813520?i=1000579234331",
        "youtube": "https://www.youtube.com/watch?v=GpD453RzdzU"
      }
    },
    {
      "id": "b7491128-fb9d-4faf-9709-066cdddea980",
      "title": "What Else Did They Lie About? Interview with Shayla Hudson Riggle",
      "description": "In this episode, Shayla Hudson Riggle discusses her experience growing up as one of Jehovah\u0027s Witnesses and how after a family secret finally came to life, she wanted to know what else they were lying about. The decision to do further investigation about Jehovah\u0027s Witnesses lead her directly to exjw critical thinkers youtube channel. She is excited to wake up to the truth about the religion and is sharing her personal story about how she woke up and began walking in her own path. Shayla has her own production company, successfully making strides in her life. You can learn more about her company at: https://shoutoutla.com/meet-shayla-hudson-riggle-ceo-partner-executive-producer/ https://www.rigglemethat.org/meet-the-team Support the show",
      "release": "2022-09-01T01:00:00Z",
      "duration": "01:09:47.4540000",
      "explicit": false,
      "spotifyId": "2BWNfsdiO4uTWljnTDf4jM",
      "appleId": 1000577984227,
      "youTubeId": "QiiTZK36rLI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2BWNfsdiO4uTWljnTDf4jM",
        "apple": "https://podcasts.apple.com/podcast/what-else-did-they-lie-about-interview-with-shayla/id967813520?i=1000577984227",
        "youtube": "https://www.youtube.com/watch?v=QiiTZK36rLI"
      }
    },
    {
      "id": "271bf355-1eb1-4859-be70-3c5779172b62",
      "title": "The Top Six Questions You Should Ask a Jehovah\u0027s Witness",
      "description": "In the month of September, the Jehovah\u0027s Witnesses are planning to offer free home Bible studies. If you happen to find yourself in their audience, this podcast will help you to prepare to ask questions that can help you keep from getting caught in their hamster wheel. Most people are unaware of the Jehovah\u0027s Witness culture and how they do their recruiting. It means that you could find yourself in a situation not realizing how you got there. Support the show",
      "release": "2022-09-01T01:00:00Z",
      "duration": "00:16:25.4170000",
      "explicit": false,
      "spotifyId": "0AQWXLUQdYV0mVLs927Sbd",
      "appleId": 1000577984228,
      "youTubeId": "7RpExnYMo00",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0AQWXLUQdYV0mVLs927Sbd",
        "apple": "https://podcasts.apple.com/podcast/the-top-six-questions-you-should-ask-a-jehovahs-witness/id967813520?i=1000577984228",
        "youtube": "https://www.youtube.com/watch?v=7RpExnYMo00"
      }
    },
    {
      "id": "bdeb38f2-dbe2-4b2e-97d3-f7c6824b0fa7",
      "title": "Jehovah\u0027s Witnesses: Don\u0027t Accept that Scholarship!",
      "description": "Letter to the Body of Elders Seeking Lawyers - https://imgur.com/HivxGbX In this podcast, JT delivers a powerful discourse about Jehovah\u0027s Witnesses and Education. Support the show",
      "release": "2022-07-30T01:00:00Z",
      "duration": "00:16:38.2430000",
      "explicit": false,
      "spotifyId": "04s5V81gMgnwlx4c5Mmsuo",
      "appleId": 1000571626325,
      "youTubeId": "cXKSgiPGO0o",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/04s5V81gMgnwlx4c5Mmsuo",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-dont-accept-that-scholarship/id967813520?i=1000571626325",
        "youtube": "https://www.youtube.com/watch?v=cXKSgiPGO0o"
      }
    },
    {
      "id": "b17da3bb-6d8c-4adb-b760-febcac921d11",
      "title": "The Power of the Platform...How What We Say Can Affect People in Our Audience.",
      "description": "In this episode, the Governing Body of Jehovah\u0027s Witnesses shared an analogy on the world wide platform asking a very pointed question about little babies comparing them to little angels or enemies of God. We discuss the ramifications of what this means in the Jehovah\u0027s Witness community and how it will no doubt play out in the lives of the members of this group. Support the show",
      "release": "2022-07-17T02:00:00Z",
      "duration": "00:12:06.8570000",
      "explicit": false,
      "spotifyId": "0rAFZddyo3VxAtGiUT0O2X",
      "appleId": 1000570162506,
      "youTubeId": "Wqi5pBIElNk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rAFZddyo3VxAtGiUT0O2X",
        "apple": "https://podcasts.apple.com/podcast/the-power-of-the-platform-how-what-we-say-can/id967813520?i=1000570162506",
        "youtube": "https://www.youtube.com/watch?v=Wqi5pBIElNk"
      }
    },
    {
      "id": "ac68da4d-d4e0-4f08-a234-7140363e55db",
      "title": "Jehovah\u0027s Witnesses, Secretly Accepting Blood Transfusions",
      "description": "Recently, we received an email from an anesthesiologist discussing his experience with Jehovah\u0027s Witnesses secretly taking blood. In this podcast, we discuss the situation with Jehovah\u0027s Witnesses and how our guest, Shauna, was faced with this dilemma. Find out how she and her family handled their situation in this podcast. ********************* Begin Email message from anesthesiologist: Hello. I found you guys on the Internet. I’m a[n] anesthesiologist. I have a question for you. What percentage of those witnesses would take a blood transfusion if it could be absolutely guaranteed where no one will ever find out? I have had several patients that in the operating room, I asked them before going to sleep if they would receive blood. They have said ‘no blood’ in the presence of family in the preoperative area. However when alone in the operating room with no family members around, they have said that they will, in fact, accept blood in the operating room as long as nobody finds out. This has happened a number of times. A recent case where a woman that I had as a patient almost died until we got her to the operating room and were able to give her blood anonymously. We’re trying to develop a policy in the hospital somehow to be able to give JWs the option of a truly free decision on whether or not they want to receive blood without the pressure of being in the presence of family and church vampires about. Any of your thoughts are greatly appreciated. End Email *********************** To learn more about our Guest Shauna, be sure to check out the interview we did where she and her husband shared their experience on our YouTube channel https://www.youtube.com/watch?v=on42UtqJZEs\u0026t=619s Support the show",
      "release": "2022-07-05T22:00:00Z",
      "duration": "00:31:35.9150000",
      "explicit": false,
      "spotifyId": "4oM8TSNbEACTqlAgutaRSX",
      "appleId": 1000568940253,
      "youTubeId": "deIwpc8Geko",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4oM8TSNbEACTqlAgutaRSX",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-secretly-accepting-blood-transfusions/id967813520?i=1000568940253",
        "youtube": "https://www.youtube.com/watch?v=deIwpc8Geko"
      }
    },
    {
      "id": "9b17f932-1944-4558-8cdd-68b701159ef5",
      "title": "Does the Governing Body of Jehovah\u0027s Witnesses Represent the Modern Day Pharisees?",
      "description": "The Governing Body of Jehovah\u0027s Witnesses stakes claims that they are Gods Spokesmen. Check out this quote from their 2013 Watchtower: \u0022At that time, the lifesaving direction that we receive from Jehovah’s organization may not appear practical from a human standpoint. All of us must be ready to obey any instructions we may receive, whether these appear sound from a strategic or human standpoint or not.\u0022 November 15, 2013 Watchtower, p.20 Support the show",
      "release": "2022-06-28T18:00:00Z",
      "duration": "00:24:06.0600000",
      "explicit": false,
      "spotifyId": "1HpqTiA0irN6APo8S5PRbT",
      "appleId": 1000568026484,
      "youTubeId": "rqYUCV4FHI4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1HpqTiA0irN6APo8S5PRbT",
        "apple": "https://podcasts.apple.com/podcast/does-the-governing-body-of-jehovahs-witnesses/id967813520?i=1000568026484",
        "youtube": "https://www.youtube.com/watch?v=rqYUCV4FHI4"
      }
    },
    {
      "id": "bd7cd4b8-6289-47d5-b68c-0f6c34b0b7f1",
      "title": "Bethel Leak - Unhappy Members (Physically In, Mentally Out) - Headquarters of Jehovah\u0027s Witnesses",
      "description": "If you know the history behind the Jehovah\u0027s Witness religion, you are well aware of how it feels being at odds with the beliefs once you realize it is not the truth. Many JW\u0027s are in a quandary where they have to fake it just to survive. That is what being a PIMO is all about. It is an acronym for Physically In, Mentally Out. To further explain, it\u0027s all about pretending to believe so that you don\u0027t lose your family and social structure. The term PIMO was coined several years ago to identify the growing number of individuals that are trapped in the religion for one reason or another. Because of the strict shunning policy, Jehovah\u0027s Witnesses realize they can lose everything if they allow others to know how they truly feel about the organization. They stand to lose their marriage, job, friends, home, and anything else that connects them to a person that holds the cards to any situation as it relates to their livelihood. This podcast delves into the lives of members at the world headquarters of Jehovah\u0027s Witnesses aka Bethel. During the COVID-19 lockdown, members at Bethel experienced a very turbulent time as they were not permitted to leave the premises. They report alcohol abuse, domestic violence, depression and even suicidal thoughts. Source of this video: exjwbethelelder (Reddit) https://www.reddit.com/r/exjw/comments/v9mgao/a_special_message_from_a_pimo_bethel_elder_see/ Support the show",
      "release": "2022-06-13T16:00:00Z",
      "duration": "00:13:49.4400000",
      "explicit": false,
      "spotifyId": "7qnyuQ8cB7UefUDyJbx69D",
      "appleId": 1000566267333,
      "youTubeId": "lOPw2zgTHUs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qnyuQ8cB7UefUDyJbx69D",
        "apple": "https://podcasts.apple.com/podcast/bethel-leak-unhappy-members-physically-in-mentally/id967813520?i=1000566267333",
        "youtube": "https://www.youtube.com/watch?v=lOPw2zgTHUs"
      }
    },
    {
      "id": "8d50fcee-5e8c-4b18-bd8a-1d63510f28a1",
      "title": "Jehovah\u0027s Witnesses - Different Countries, Same Ole Lies",
      "description": "Meet Jonathan, a former Jehovah\u0027s Witness that realized something was wrong with the teachings long before he learned the truth behind the organization. As he states in this interview, things just did not sit right. He knew something was amiss, but could not pinpoint the issues. If you have questions about his experience or may be able to relate to him and want to reach out, Jonathan can be reached at SpookMaster35@outlook.com. Please consider supporting our work on Patreon Support the show",
      "release": "2022-06-11T21:00:00Z",
      "duration": "01:07:25.6090000",
      "explicit": false,
      "spotifyId": "4JCcJPAnZhP7haSvRKLI4k",
      "appleId": 1000566097135,
      "youTubeId": "Py-dsDyc6Wo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JCcJPAnZhP7haSvRKLI4k",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-different-countries-same-ole-lies/id967813520?i=1000566097135",
        "youtube": "https://www.youtube.com/watch?v=Py-dsDyc6Wo"
      }
    },
    {
      "id": "1ee34092-5175-4d99-bcc0-8fccddd604c2",
      "title": "Living in Fear of Getting Caught Pretending to be a Jehovah\u0027s Witness",
      "description": "#exjw #JehovahWitness #exjwcriticalthinker You\u0027ve no doubt heard of the term PIMO which means Physically In, Mentally Out. This is how Jehovah\u0027s Witnesses that are trapped in the religion but no longer believe it is the truth but they remain in the congregation because they do not want to lose their family. Justin\u0027s PIMO story is much more than that because he was literally in survival mode while pretending to be a Jehovah\u0027s Witness. His entire livelihood was in danger if the brothers at the Kingdom Hall really knew how he felt about the Watchtower, Bible \u0026 Tract Society. In fact, he was facing the possibility of losing his job because not only the owner of the company, but approximately 80% of the staff were all Jehovah\u0027s Witnesses. Therefore, if Justin were to leave the religion, he may as well be quitting his job too. It is interesting how Jehovah\u0027s Witnesses may seem to feel slighted because people do not want to deal with them and their religious beliefs. Yet, when it is convenient for them, they turn around and treat people the exact same way for choosing to leave their group. Be sure to check out Justin\u0027s channel at EXJW Diaries https://www.youtube.com/channel/UCsYLpWKwDlJUrp_SipTHAQQ Please consider supporting our work on Patreon https://www.patreon.com/exjwcriticalthinker Support the show",
      "release": "2022-05-24T20:00:00Z",
      "duration": "01:21:33.8840000",
      "explicit": false,
      "spotifyId": "2of3p0G3M3ocTOYrljKjYx",
      "appleId": 1000563588267,
      "youTubeId": "sE_j70JTKfM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2of3p0G3M3ocTOYrljKjYx",
        "apple": "https://podcasts.apple.com/podcast/living-in-fear-of-getting-caught-pretending-to-be/id967813520?i=1000563588267",
        "youtube": "https://www.youtube.com/watch?v=sE_j70JTKfM"
      }
    },
    {
      "id": "f4664341-49e1-41e7-9ca7-587a3eaa43c3",
      "title": "Jehovah\u0027s Witnesses - Hiding their Identity to Maintain Family Relationships",
      "description": "What does it mean to be a PIMO? The acronym stands for Physically In, Mentally Out. It is a term that is used for individuals that no longer believe in the teachings of Jehovah\u0027s Witnesses but they are unable to leave for fear of shunning. THE GROWING NUMBER OF PIMO\u0027S IS ASTOUNDING. We receive countless emails from individuals waking up all over the world. It is amazing how the Internet has been a game changer for many people and they are receiving a confirmation by going online and meeting up with likeminded individuals learning the real truth about the Watchtower. Do not allow fear to keep you from knowledge. You should always continue searching for information and knowledge. Never allow an organization to hi-jack your mind and keep you from living your life to the fullest. Never does the scriptures tell people to stop living for a future date. Support the show",
      "release": "2022-05-13T22:00:00Z",
      "duration": "00:24:30.3020000",
      "explicit": false,
      "spotifyId": "6olXUjh0RW4EARIIQgWF5I",
      "appleId": 1000561201883,
      "youTubeId": "olch0jCBzMg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6olXUjh0RW4EARIIQgWF5I",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-hiding-their-identity-to-maintain/id967813520?i=1000561201883",
        "youtube": "https://www.youtube.com/watch?v=olch0jCBzMg"
      }
    },
    {
      "id": "6911f046-3a5f-4b9a-a0ce-f24d4b05ef79",
      "title": "Former Jehovah\u0027s Witness: Disfellowshipped \u0026 Thriving",
      "description": "How to Reach VEVIAN VOZMEDIANO Facebook Instagram YouTube Website ABOUT VEVIAN Learning how to live after leaving or getting disfellowshipped from the Jehovah\u0027s Witnesses is a challenging journey. It destroys your whole approach to life. It\u0027s like the rug gets pulled out from under you in every way because the organization defined everything about your life. It defined who you were, what you believed in, your relationships, your purpose in life, your view of the world, your view of the future, and your view on what happened to us after we die. Being part of it is how you made sense of the world. As a Jehovah\u0027s Witness, you were taught to be \u0022no part of this world.\u0022 The religion made you believe that it was only \u0022Jehovah\u0027s people\u0022 who had \u0022the truth\u0022. I\u0027m here to tell you otherwise. When Jesus said, \u0022the truth will set you free,\u0022 he was speaking of your OWN truth. Living your truth means that you unapologetically embrace who you are and present that true self to the world. Your authentic self is the self that will most benefit you and the lives of those you encounter. Leaving or getting shunned from the organization and not having your voice as a woman can leave you feeling psychologically and mentally stunted and incapable of making life decisions. You could be feeling helpless, suicidal, numb, riddled with guilt and shame, angry, suffer from sleep deprivation, eating disorders, substance abuse, anxiety, depression, and interpersonal dysfunction. It is heroic of you to say NO to the organization and no longer want to be part of it. Possibly for the first time in your life, you are starting to ask yourself, what do I want and believe? Welcome to your healing journey and finding your truth. In a very real way, you have to re-create your identity from scratch. I know what what this feels like. I was disfellowshipped in December 2011. I wrote four letters to get back into the organization in 2 years. I missed everyone, including my mom, who has been a regular pioneer for 30\u0026#43; years. After these two years of getting rejected re-entry, I decided I wanted to see what life was like in the real world. It turns out it\u0027s pretty INCREDIBLE! I\u0027ve dedicated the last ten years of my life to my healing journey of finding my own truth. This journey of self-awareness, self-inquiry, self-acceptance and self-compassion led me to the path of self-love. It turns out, the only person you need approval from is yourself! Along my healing path, I\u0027ve picked up tools, habits, and tactics that I\u0027m sharing in this program. This program is intended to help support you and help you discover who you are outside of the Jehovah\u0027s Witnesses. The group format and setting will provide a safe space to connect with like-minded individuals who will intern empower you on your journey. During these eight weeks, you will take a deep dive into your inner world to unlock what you believe, who you are, and help you connect with your full potential! Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Check out our t-shirt designs: https://exjwcriticalthinker.myspreadshop.com/all How to Contact Us We appreciate hearing from our viewers; however, we do not have enough staff or resources to communicate with everyone. We rarely check messages in our social media platforms (i.e., Facebook, Twitter, Support the show",
      "release": "2022-05-13T22:00:00Z",
      "duration": "00:56:45.7920000",
      "explicit": false,
      "spotifyId": "6fDXwvabNnAC8GD9wR81OZ",
      "appleId": 1000561201981,
      "youTubeId": "vvalZC1hshk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6fDXwvabNnAC8GD9wR81OZ",
        "apple": "https://podcasts.apple.com/podcast/former-jehovahs-witness-disfellowshipped-thriving/id967813520?i=1000561201981",
        "youtube": "https://www.youtube.com/watch?v=vvalZC1hshk"
      }
    },
    {
      "id": "a488c760-e26d-418c-8670-e358b8f8861d",
      "title": "Jehovah\u0027s Witnesses: Bad Advice Poor Choices Education \u0026 Debt",
      "description": "You can visit Amira aka Tuffryda at the link below: https://www.youtube.com/channel/UCROI7_fBzYBC4wmJZS3Cs6Q In this episode, Amira discusses what it was like growing up as one of Jehovah\u0027s Witnesses and the difficulties she faced in school. Neither one of her parents were baptized as Jehovah\u0027s Witnesses, but Amira\u0027s mother was born and raised in the religion. Her mother, a person that didn\u0027t accept the religion as her own, allowed her mother to instill the beliefs in her daughter. Amira tells her story about what it was like navigating her educational pursuits and the difficulties she faced trying to decide whether or not she should attend college. Mainly, because her Jehovah\u0027s Witness family didn\u0027t encourage higher education, but her academic advisors were telling her to move forward with her interests in learning. Of course, no one talks about how much it costs to go to a four year university. So, in this episode, Amira helps other young people her age to understand the difficulties she faced and hopes to steer you in a better direction. Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Support the show",
      "release": "2022-05-06T16:00:00Z",
      "duration": "00:44:09.7560000",
      "explicit": false,
      "spotifyId": "6HmcokZ5xhwcFRWRW1rvas",
      "appleId": 1000559854836,
      "youTubeId": "3jhU3kM20ws",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6HmcokZ5xhwcFRWRW1rvas",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-bad-advice-poor-choices-education-debt/id967813520?i=1000559854836",
        "youtube": "https://www.youtube.com/watch?v=3jhU3kM20ws"
      }
    },
    {
      "id": "6320c7e3-c4ae-446f-8d59-8cb093234a55",
      "title": "Interview/Discussion: Jehovah\u0027s Witnesses - Dating, Courtship \u0026 Marriage - Part 2",
      "description": "Support the show",
      "release": "2022-04-29T21:00:00Z",
      "duration": "01:13:21.2660000",
      "explicit": false,
      "spotifyId": "3dqQUXFCvEASPtrpTaNrIm",
      "appleId": 1000559149363,
      "youTubeId": "Y3yBJW48-dY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3dqQUXFCvEASPtrpTaNrIm",
        "apple": "https://podcasts.apple.com/podcast/interview-discussion-jehovahs-witnesses-dating-courtship/id967813520?i=1000559149363",
        "youtube": "https://www.youtube.com/watch?v=Y3yBJW48-dY"
      }
    },
    {
      "id": "bad4eb2b-e28e-48db-b057-3c89235fdead",
      "title": "Jehovah\u0027s Witnesses - Dating, Courtship \u0026 Marriage Part 1",
      "description": "#exjw #JehovahWitness #exjwcriticalthinker #Jehovah\u0027sWitnessRelationships This episode will be one of many in a series educating the public about Jehovah\u0027s Witnesses and relationships. The information contained herein is from our perspective and what we have seen. Trust and believe, there are many more sides to this coin. It is just one of many that we will be presenting to the audience to see how Jehovah\u0027s Witnesses think and view relationships. The religion simply makes relationships more difficult because it sets up false titles and positions that people want to attain and when they do not materialize, it can wreak havoc in the lives of its members. We regularly receive email\u0027s from individuals asking us for our advice about pursuing relationships with Jehovah\u0027s Witnesses. There are many different combinations of issues pertaining to these relationships. Some are married to disfellowshipped Jehovah\u0027s Witnesses and didn\u0027t realize it until their significant other decided to return to the Kingdom Hall. Others met the Witness on the job and began seriously dating all to find out that the person wanted them to join the group or else they would have to terminate their relationship. We realize that in order to help educate individuals about being married to a Jehovah\u0027s Witness, it would be best for them to see what it is like when both parties are baptized in the faith. Once you see how stressful it can be for two people that are both willing participants in the religion and the issues they face, it makes it easier to help unbelievers to see the possible difficulties they will face. In this video, we discuss the basics about how Jehovah\u0027s Witness women are pressured to marry individuals that are ministerial servants. We also provide experiences of several individuals that realize their past mistakes about getting married too young. Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Support the show",
      "release": "2022-04-28T12:00:00Z",
      "duration": "00:16:02.1150000",
      "explicit": false,
      "spotifyId": "05Jq955YN2OvJmN3Ktjdy1",
      "appleId": 1000558976767,
      "youTubeId": "TZjA_95TgbU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/05Jq955YN2OvJmN3Ktjdy1",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-dating-courtship-marriage-part-1/id967813520?i=1000558976767",
        "youtube": "https://www.youtube.com/watch?v=TZjA_95TgbU"
      }
    },
    {
      "id": "bb2d1b9d-eeb6-4606-8e57-e43f94ad0f0a",
      "title": "Living with Autism as a Jehovah\u0027s Witness: Social Outcast",
      "description": "Autism Awareness Our guest, reached out to us to tell her story about what it was like living with Autism and trying to fit into with the Jehovah\u0027s Witness culture. Autism in Adults https://www.helpguide.org/articles/autism-learning-disabilities/autism-in-adults.htm https://www.autism.org/autism-symptoms-and-diagnosis-in-adults/ Autism - Mayo Clinic https://www.mayoclinichealthsystem.org/topics/autism Early Identification of Autism https://neurosciences.ucsd.edu/centers-programs/autism/early/signs.html Autism Society https://www.autism-society.org/what-is/symptoms/ Support the show",
      "release": "2022-04-28T11:00:00Z",
      "duration": "01:10:59.6570000",
      "explicit": false,
      "spotifyId": "3OMuetAg3lCGFNjVuxsgpf",
      "appleId": 1000558967560,
      "youTubeId": "FRO7DGJxXUE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3OMuetAg3lCGFNjVuxsgpf",
        "apple": "https://podcasts.apple.com/podcast/living-with-autism-as-a-jehovahs-witness-social-outcast/id967813520?i=1000558967560",
        "youtube": "https://www.youtube.com/watch?v=FRO7DGJxXUE"
      }
    },
    {
      "id": "6c46658f-335c-4773-a56a-4eaef6dc38d4",
      "title": "Jehovah\u0027s Witness - From In Crowd to Outcast",
      "description": "Sean has a YouTube channel called \u0022Ask An Apostate (almost) Anything\u0022 https://www.youtube.com/user/cordialneondiva/featured Like most born-in Jehovah’s Witnesses, Sean got baptized young at age 16. Over the course of time he served as a ministerial servant, engaged in regular and auxiliary pioneer service. According to Sean, the waking up process was rough and so is the subsequent fallout. However, he confidently states that “It\u0027s totally worth it, but man, it\u0027s brutal. Sean was raised in a progressive Jehovah’s Witness household where he remembers his father climbing the Jehovah’s Witness corporate ladder. Both parents were regular pioneers (and his mom remains one today). Throughout the years, his parents have sacrificed a lot for the organization. Sean’s dad was the regional convention and circuit assembly overseer and has now been moved into a position where he is being used to train other brothers to do the same thing. He also did a lot of work on Kingdom Hall quick builds and Assembly Hall builds, and has done work with the LDC, RBC, and HLC. He recalls meeting a lot of \u0022heavy hitters\u0022 in the organization. He grew up constantly going to dinners and family vacations with district overseers, circuit overseers, branch representatives, bethel speakers, missionaries, and even went to dinner with a Governing Body member. (Or at least he thinks he was, but at such a young age he was not impressed. Sean’s family hobnobbed with the elite Jehovah’s Witnesses, and he got to see a LOT of the behind-the-scenes stuff that goes on at regional conventions and on local congregation levels. Looking back, he believes this was the start of his waking up process although he didn’t realize it at the time. Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Support the show",
      "release": "2022-04-16T14:00:00Z",
      "duration": "01:14:35.8200000",
      "explicit": false,
      "spotifyId": "3o9uDG94AT1fUSmzfsSCIa",
      "appleId": 1000557785316,
      "youTubeId": "g3NUvWlPOts",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3o9uDG94AT1fUSmzfsSCIa",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witness-from-in-crowd-to-outcast/id967813520?i=1000557785316",
        "youtube": "https://www.youtube.com/watch?v=g3NUvWlPOts"
      }
    },
    {
      "id": "42d85c8f-9c2b-40b8-8fe0-fd85a3101cef",
      "title": "Are Jehovah\u0027s Witnesses the only ones going to Heaven?",
      "description": "In this episode, JT \u0026 Lady Cee discuss how the Jehovah\u0027s Witnesses view Heaven, the only ones that will be accepted and how they view those that do not agree. Support the show",
      "release": "2022-04-16T14:00:00Z",
      "duration": "00:15:26.9550000",
      "explicit": false,
      "spotifyId": "1vq10TrBOlMZLCEeH1x0H4",
      "appleId": 1000557785317,
      "youTubeId": "HLcV7YA-Aso",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1vq10TrBOlMZLCEeH1x0H4",
        "apple": "https://podcasts.apple.com/podcast/are-jehovahs-witnesses-the-only-ones-going-to-heaven/id967813520?i=1000557785317",
        "youtube": "https://www.youtube.com/watch?v=HLcV7YA-Aso"
      }
    },
    {
      "id": "a940cdce-97dd-461d-b170-bbf268091a3e",
      "title": "Jehovah\u0027s Witnesses - We are living in the last days! Get Back to the Kingdom Hall",
      "description": "We are living in the last days, yes, we are down to the toenails. So, it’s time to get back to the Kingdom Hall and be part of Jehovah’s safety net. This is what elders and circuit overseers are no doubt parroting from the platform all over the world. They have been using bad news about world event to continually scare their members into staying or returning back to the fold. We recommend that you do your research to learn more about the organization known as Jehovah\u0027s Witnesses. References May 1974 Kingdom Ministry Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Check out our videos on why we left the Why We Left the Jehovah\u0027s Witnesses https://youtu.be/rqYUCV4FHI4 https://youtu.be/bLaSB9P2MEE Support the show",
      "release": "2022-04-10T01:00:00Z",
      "duration": "00:10:06.2750000",
      "explicit": false,
      "spotifyId": "1p3pLfgXaKj2NgVLodowIk",
      "appleId": 1000556845692,
      "youTubeId": "wFQqV4lTU40",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1p3pLfgXaKj2NgVLodowIk",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-we-are-living-in-the-last-days-get/id967813520?i=1000556845692",
        "youtube": "https://www.youtube.com/watch?v=wFQqV4lTU40"
      }
    },
    {
      "id": "e2659139-dbb8-428b-a876-39909486b655",
      "title": "Jehovah’s  Witnesses: the Brotherhood is a Sham!",
      "description": "Support the show",
      "release": "2022-04-02T12:00:00Z",
      "duration": "00:57:18.8110000",
      "explicit": false,
      "spotifyId": "1TIsvYsCH8bN38hQW6xgD3",
      "appleId": 1000556026842,
      "youTubeId": "vvalZC1hshk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1TIsvYsCH8bN38hQW6xgD3",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-the-brotherhood-is-a-sham/id967813520?i=1000556026842",
        "youtube": "https://www.youtube.com/watch?v=vvalZC1hshk"
      }
    },
    {
      "id": "84bc8f4d-9f36-48e7-8159-5f299b82ed4b",
      "title": "The Dutch Fight Back Against Jehovah\u0027s Witnesses and Shunning in the Netherlands",
      "description": "In this podcast, we are speaking with Youri Jourdain, a former Jehovah\u0027s Witness from the Netherlands where he discusses the Dutch Committee Against shunning. Youri also has a YouTube channel where he is sharing information about his cause in working with local politicians in his area to raise awareness about the Jehovah\u0027s Witnesses. Article about Henri Dahlem (50) from Aalten. He is a fighter. Jehovah’s Witnesses’ “discriminatory exclusion policy” must come to an end, and he is trying to achieve this in all possible ways. https://cne.news/artikel/672-former-jehovahs-witness-was-not-greeted-at-grandmothers-funeral https://cne.news/artikel/672-former-jehovahs-witness-was-not-greeted-at-grandmothers-funeral https://www.bd.nl/tilburg-e-o/na-beschuldiging-van-hoererij-wordt-jim-winter-uitgesloten-als-jehova-en-ziet-hij-geen-familie-meer~a1cbafa5/?referrer=https%3A%2F%2Fwww.google.com%2F https://www.reddit.com/r/exjw/comments/c06lyr/netherlands_at_the_age_of_four_henri_dahlem_48/ Activism in the Netherlands Interview with Henri Dahlem in Dutch https://www.youtube.com/watch?v=7hM1YF0WBjw Support the show",
      "release": "2022-03-22T11:00:00Z",
      "duration": "00:38:12.1920000",
      "explicit": false,
      "spotifyId": "5ihHjZr6VcHrud7FOumC2e",
      "appleId": 1000555046382,
      "youTubeId": "9XGn1-iddpI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ihHjZr6VcHrud7FOumC2e",
        "apple": "https://podcasts.apple.com/podcast/the-dutch-fight-back-against-jehovahs-witnesses/id967813520?i=1000555046382",
        "youtube": "https://www.youtube.com/watch?v=9XGn1-iddpI"
      }
    },
    {
      "id": "5ca84ad9-5a66-4eb1-b006-d95983db8263",
      "title": "EXJW Millennial Discovers the Watchtower\u0027s Deceptions",
      "description": "Alt\u0026#43;Worldly meets exjw Critical Thinker As a 4th Generation Jehovah\u0027s Witness, Jake likens his discoveries about their deceit to a small crack in your windshield. You don\u0027t notice how bad it is until you seek the crack going all the way across your window. He finally, put 2 \u0026#43; 2 together and cracked the code to the deceptions of the organization. You can find more videos from Jake aka Alt Worldly at https://www.youtube.com/channel/UCfHydnkPDgYNCZiviuVVrkw You can now listen to our podcasts on most major podcast outlets https://www.buzzsprout.com/1905181 Support the show",
      "release": "2022-03-16T20:00:00Z",
      "duration": "01:03:59.7640000",
      "explicit": false,
      "spotifyId": "2Af9hA24wgB0yIhaLDRK3d",
      "appleId": 1000554261726,
      "youTubeId": "r0fXauj9yJI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Af9hA24wgB0yIhaLDRK3d",
        "apple": "https://podcasts.apple.com/podcast/exjw-millennial-discovers-the-watchtowers-deceptions/id967813520?i=1000554261726",
        "youtube": "https://www.youtube.com/watch?v=r0fXauj9yJI"
      }
    },
    {
      "id": "30f494c0-b8a8-4dd6-8170-bcbb244fdd96",
      "title": "The Top 5 Reasons Why the Governing Body of Jehovah\u0027s Witnesses Enjoys Speculating Beyond the Bible",
      "description": "Support the show",
      "release": "2022-03-03T05:00:00Z",
      "duration": "00:19:03.8490000",
      "explicit": false,
      "spotifyId": "3VWUTKNenZ7BjgVPN3nYDR",
      "appleId": 1000552780028,
      "youTubeId": "LWTse8KXLNI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3VWUTKNenZ7BjgVPN3nYDR",
        "apple": "https://podcasts.apple.com/podcast/the-top-5-reasons-why-the-governing-body/id967813520?i=1000552780028",
        "youtube": "https://www.youtube.com/watch?v=LWTse8KXLNI"
      }
    },
    {
      "id": "ade64896-6ed6-4db8-b32d-b207375d63bb",
      "title": "Interview with Celebrity Chef: We Were Jehovah\u0027s Witnesses in Name Only - Fake Elder Alert",
      "description": "In this episode, we interview celebrity Chef Darrin Kenneth where he tells all of the family secrets on what it was like growing up as a Jehovah\u0027s Witness and having the appearance of the model family. However, he speaks about the bad behaviors from many individuals, namely elders and their families doing everything that goes against Watchtower teachings. He demonstrates that what you see is not always what you get. Support the show",
      "release": "2022-03-01T13:00:00Z",
      "duration": "01:35:46.9120000",
      "explicit": false,
      "spotifyId": "4kb34yYClVvtD4EoTOHdHd",
      "appleId": 1000552580152,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4kb34yYClVvtD4EoTOHdHd",
        "apple": "https://podcasts.apple.com/podcast/interview-with-celebrity-chef-we-were-jehovahs/id967813520?i=1000552580152"
      }
    },
    {
      "id": "939f00dc-93ce-47fa-90aa-dbe27eaa0995",
      "title": "Interview: Keil Lamont WJZD Radio Detroit - Why I Left the Jehovah\u0027s Witnesses",
      "description": "Radio Personality Keil Lamont is no stranger to Detroit’s airwaves. He enjoys an extensively rich and varied radio broadcasting career, working on air in nearly every conceivable radio format, including Classic Hits, News, News/Talk, CHR, Urban, Urban Adult, Jazz and more. Keil started his radio career while yet a sophomore in high school, landing a job at WCAR News Radio 1130 AM and CAR-92, WCAR-FM. As a high school senior, he joined urban outlet WGPR-FM and later moved to WLBS-FM. Through the years, Keil’s radio path has taken him to WDRQ, WKSG, WJZZ, WJLB, and WMXD. Keil hosted the “Quiet Storm” on three separate Detroit radio stations through the 80’s and 90’s, taking each station to #1 in the key Adult 25-54 demographic. “I am extremely excited to be part of the WJZDRadio team,” says Keil. “We have the opportunity to showcase Detroit radio’s unique style to a worldwide audience.” You can hear Keil Lamont on WJZDRadio weekdays from 2PM – 6PM Eastern Time.Keil Lamont was raised as one of Jehovah\u0027s Witnesses. As you will see from his personal interview, he had many challenges prior to being on the airwaves which had a lot to do with his upbringing as one of Jehovah\u0027s Witnesses. He recalls having an interest in radio as early as 12 years old. However, he was told by the Elders that this was not a worthwhile pursuit and went on to state this his was mostly associated with worldly behavior. Fortunately, Keil had other plans for his future other than service the Watchtower, Bible \u0026 Tract Society full time. He continued pursuing his goals as you can see from his accomplishments in life. WJZD Radio Detroit WJZZ The Quiet Storm WGPR 107.5 Detroit’s Historic Black Owned Radio Station Support the show",
      "release": "2022-02-24T13:00:00Z",
      "duration": "01:06:16.4630000",
      "explicit": false,
      "spotifyId": "1V4dWK63FELXM5tkWQEux3",
      "appleId": 1000552277145,
      "youTubeId": "BC9NMyRcjFE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1V4dWK63FELXM5tkWQEux3",
        "apple": "https://podcasts.apple.com/podcast/interview-keil-lamont-wjzd-radio-detroit-why-i-left/id967813520?i=1000552277145",
        "youtube": "https://www.youtube.com/watch?v=BC9NMyRcjFE"
      }
    },
    {
      "id": "b4a530d7-1ce2-4ad5-94a5-d8d4561fc140",
      "title": "Interview: Jack Grey - Jehovah\u0027s Witnesses From Fear to Freedom",
      "description": "Jack Grey, former Jehovah\u0027s Witness elder expounds on the issues of how individuals are trapped by fear based on the teachings of the governing body. He discusses how he woke due to the Watchtower\u0027s teaching about the overlapping generation. Jack is good at empowering individuals to use critical thinking when examining the teachings of Jehovah\u0027s Witnesses. Jack has been working with the EXJW Empowerment group since its inception. This group is doing a tremendous job in assisting individuals that no longer belong to the organization. cThey have been instrumental in assisting young people to find a place to stay after being put out of their homes because they no longer choose to following the teachings of the Watchtower, Bible \u0026 Tract Society. The EXJW Empowerment group is an excellent resource for former Jehovah\u0027s Witnesses who want to move past challenges, disappointments and hurts, and move towards a brand new fulfilling, happy and empowered life. Website https://feartofreedom.ca/?fbclid=IwAR1e0-F9GsECf4wlWBI8PdQRze6b3nIgKYwZ1eVG59Q9n2eqnZmIOYb4TPw Link to the EXJW Empowerment Group on Facebook: https://www.facebook.com/groups/1412960118760984 Link to Jack Grey\u0027s Book FEAR TO FREEDOM: Support the show",
      "release": "2022-02-22T13:00:00Z",
      "duration": "01:11:42.3670000",
      "explicit": false,
      "spotifyId": "4KTeEgCoJUK82WjcCMHrU0",
      "appleId": 1000552276295,
      "youTubeId": "C_L5OR2enbg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4KTeEgCoJUK82WjcCMHrU0",
        "apple": "https://podcasts.apple.com/podcast/interview-jack-grey-jehovahs-witnesses-from-fear-to/id967813520?i=1000552276295",
        "youtube": "https://www.youtube.com/watch?v=C_L5OR2enbg"
      }
    },
    {
      "id": "7d3bb90f-6a98-4275-91cc-1289413796d3",
      "title": "Interview: Stop Giving Jehovah\u0027s Witness Elders Power Over Your Life",
      "description": "Everett \u0026 Shardinea Carter are former Jehovah’s Witnesses, one, a fourth generation and the other born in. For the past several years they have been working as online activists to help bring awareness to the group. Waking up to the true realizations about the religion was a turbulent time for both individuals. They are most grateful to wake up to learn the truth and since 2018, they are spending their efforts to educate others about the dangers of the group. Despite the efforts of members in the organization who tried to drive a wedge in their relationship, they managed to remain strong. You can find more information about their online activism at the following links: https://distrokid.com/hyperfollow/everettcarter/let-me-speak-now-4?fbclid=IwAR3fhOYbyvgJfy5Vj5Is4QMZzff4fzsCwBflTbVM1x6PcNe4_bnZZhRuEUs https://theydontwannalisten.com/?fbclid=IwAR3-YQhpEzGlcpRZA-87HM4I49bz3fr13I-8Uz8WA-5g3ZvJQXvjXe4V19Q ★ VISIT OUR WEBSITE http://www.exjwcriticalthinker.com ★SUBSCRIBE TO OUR YOUTUBE CHANNEL http://bit.ly/2p9RTSC ★ TWEET US! #ExJWsThink https://twitter.com/ExJWsThink ★ FOLLOW US ON INSTAGRAM https://www.instagram.com/exjwcriticalthinker/ ★LIKE US ON FACEBOOK https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2022-02-17T13:00:00Z",
      "duration": "00:53:56.3620000",
      "explicit": false,
      "spotifyId": "5VmPUh0dZ2Vi1QfouB7KrU",
      "appleId": 1000552276294,
      "youTubeId": "LVVXp9gfJZk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5VmPUh0dZ2Vi1QfouB7KrU",
        "apple": "https://podcasts.apple.com/podcast/interview-stop-giving-jehovahs-witness-elders-power/id967813520?i=1000552276294",
        "youtube": "https://www.youtube.com/watch?v=LVVXp9gfJZk"
      }
    },
    {
      "id": "aa214828-a99c-4dfc-a00a-55737c93610b",
      "title": "Interview: Lori \u0026 Dan Cline - Leaving the Jehovah\u0027s Witnesses After 50\u002B Years",
      "description": "Lori \u0026 Dan Cline talk about their Jehovah\u0027s Witness experience. In fact, Lori is a 4th generation Jehovah\u0027s Witness as a result of her great-grandparents taking root with the religion in the 1920\u0027s. Lori talks about her frustrations with the Watchtower judicial process, seeking reinstatement, dealing with the two-witness rule, and the issues involving spiritual divorce. After leaving the religion, Lori is working with former Jehovah\u0027s Witnesses to help them deal with life after leaving. You can find her contact information below: Lori Cline Life Coaching Www.loriclinelifecoaching.com My YouTube channel is Maritsa Chairo: https://www.youtube.com/channel/UCKe4OlllzKz-5f3geIIcMgQ Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Support the show",
      "release": "2022-02-15T19:00:00Z",
      "duration": "01:11:10.8630000",
      "explicit": false,
      "spotifyId": "3zuQzvEyWd49H6GllTvEPQ",
      "appleId": 1000551208036,
      "youTubeId": "FRO7DGJxXUE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zuQzvEyWd49H6GllTvEPQ",
        "apple": "https://podcasts.apple.com/podcast/interview-lori-dan-cline-leaving-the-jehovahs/id967813520?i=1000551208036",
        "youtube": "https://www.youtube.com/watch?v=FRO7DGJxXUE"
      }
    },
    {
      "id": "042753ca-d063-4692-a7fd-df02b9619192",
      "title": "Discussion: Jehovah\u0027s Witnesses Desperate for Leadership",
      "description": "#exjw #jehovahswitnesselders Announcements and Reminders January 2022 FOR ELDERS Assisting Young Brothers to Make Spiritual Progress: For several years, the Governing Body has emphasized the importance of assisting young brothers to qualify for congregation responsibilities. This continues to be an urgent need. It has been observed that in some congregations, few baptized brothers in their late teens and early 20s are reaching out to serve as pioneers or ministerial servants. In some lands, relatively few young brothers are applying to attend the School for Kingdom Evangelizers, to serve at Bethel or to assist in Kingdom Hall construction and maintenance. On the other hand, qualified younger brothers in some congregations have been held back simply because of their age. (w18.08 pp. 11-12 pars. 15-17) Therefore, the Governing Body requests that all bodies of elders worldwide give priority to helping younger brothers grow in their relationship with Jehovah and qualify for congregation responsibilities. (Phil. 2:20 -22; 1 Tim. 4:12 -15; w75 4/15 pp. 3-13) Elders should regularly discuss spiritual goals with younger brothers. (Ps. 110:3; w21.08 pp. 26-31; sfl chap. 1 par. 6 pt. 4; chap. 8 par. 5) Although relatively young in years, exceptional ministerial servants may already be viewed as spiritually older men and qualify as elders in their mid-, or even early, 20’s. In due course, the Shepherd book will be updated to reflect this direction. ************************************************** Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Check out our videos on why we left the Why We Left the Jehovah\u0027s Witnesses https://youtu.be/rqYUCV4FHI4 https://youtu.be/bLaSB9P2MEE Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Subscribe to Our Podcast: https://podcasts.apple.com/us/podcast/ex-jehovahs-witnesses-critical-thinkers-critical-thought/id967813520 Follow us on: Twitter https://twitter.com/ExJWsThink Instagram https://www.instagram.com/exjwcriticalthinker/ Facebook https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ Check out our t-shirt designs: https://exjwcriticalthinker.myspreadshop.com/all How to Contact Us We appreciate hearing from our viewers; however, we do not have enough staff or resources to communicate with everyone. We rarely check messages in our social media platforms (i.e., Facebook, Twitter, Instagram, etc.), therefore, if you want to reach us, email us directly at the email address listed below: ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2022-01-16T18:00:00Z",
      "duration": "00:31:40.8520000",
      "explicit": false,
      "spotifyId": "5hfNXqXuMfkXqyjCWzfhn6",
      "appleId": 1000548042316,
      "youTubeId": "g2CHKR7kcUk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hfNXqXuMfkXqyjCWzfhn6",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-desperate-for-leadership/id967813520?i=1000548042316",
        "youtube": "https://www.youtube.com/watch?v=g2CHKR7kcUk"
      }
    },
    {
      "id": "f8e3967a-3f0c-4a61-b62b-843e2dcfc810",
      "title": "Interview: Stephen \u0026 Celine Mather Faded from Jehovah’s Witness Faith",
      "description": "Interview with father/daughter podcast duo of What Should I Think About..? podcast. Listen to their podcast at: Podcast – https://whatshouldithinkabout.podbean.com Website – https://www.evilsheep.co.uk/whatshouldithinkabout Stephen Mather was a born-in Jehovah\u0027s Witness that never truly believed all of their teachings. His childhood was spent thinking about Watchtower attainments: Ministerial Servant, Elder, Pioneer, Circuit Overseer, Missionary and Bethelite. However, once he and his wife had their daughter, Stephen realized that he cannot teach someone something that he does not fully believe himself. That was the start of his journey out of Watchtower. BIOS: Celine Rachel Mather is a media graduate of Goldsmiths College, University of London who has been making short films for three years, initially as a writer and now finding a love in directing and producing. She is focused on breaking into the film industry as an independent young female creator. Celine is a partner at Evil Sheep Productions and the Producer and co-creator of Dissonance. Stephen Mather is a Psychology graduate through the Open University with a Masters in Organizational Psychology through Birkbeck University of London. He works as a Learning \u0026 Development professional and improvement coach within business settings. Having left the high control group of his birth he has a particular interest in the psychological processes involved in high control, cultic groups and how leavers construct their identity upon exiting. Please consider supporting our work on Patreon - https://www.patreon.com/exjwcriticalthinker Check out our videos on why we left the Why We Left the Jehovah\u0027s Witnesses https://youtu.be/rqYUCV4FHI4 https://youtu.be/bLaSB9P2MEE Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Follow us on: Twitter https://twitter.com/ExJWsThink Instagram https://www.instagram.com/exjwcriticalthinker/ Facebook https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ Check out our t-shirt designs: https://exjwcriticalthinker.myspreadshop.com/all How to Contact Us We appreciate hearing from our viewers; however, we do not have enough staff or resources to communicate with everyone. We rarely check messages in our social media platforms (i.e., Facebook, Twitter, Instagram, etc.), therefore, if you want to reach us, email us directly at the email address listed below: ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2021-12-17T20:00:00Z",
      "duration": "01:10:02.8930000",
      "explicit": false,
      "spotifyId": "3PJPm5jzVzQ6WeTw6637e9",
      "appleId": 1000545282058,
      "youTubeId": "mo-7VmIJbSU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PJPm5jzVzQ6WeTw6637e9",
        "apple": "https://podcasts.apple.com/podcast/interview-stephen-celine-mather-faded-from-jehovahs/id967813520?i=1000545282058",
        "youtube": "https://www.youtube.com/watch?v=mo-7VmIJbSU"
      }
    },
    {
      "id": "e8d8fea3-bf98-4134-a1a7-d5c0e6575715",
      "title": "Interview: Koko - Why I Never Joined the Jehovah’s Witness Religion",
      "description": "Check out more videos from Koco on her YouTube channel https://www.youtube.com/channel/UCd9mX_w8jrEl8wBOP51pEpg Support the show",
      "release": "2021-12-17T14:36:00Z",
      "duration": "00:54:43.6960000",
      "explicit": false,
      "spotifyId": "1dByEu5CRBOG5YjAusoE5F",
      "appleId": 1000545286448,
      "youTubeId": "ecAmZlZwJr0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dByEu5CRBOG5YjAusoE5F",
        "apple": "https://podcasts.apple.com/podcast/interview-koko-why-i-never-joined-the-jehovahs/id967813520?i=1000545286448",
        "youtube": "https://www.youtube.com/watch?v=ecAmZlZwJr0"
      }
    },
    {
      "id": "c57ee492-7ed5-4f32-a6b9-c218f4242b83",
      "title": "Interview - Sean Myles - Jehovah’s Witnesses - You Heard It Here First",
      "description": "Sean Breed Speaks on topics that’s on the mind of anyone who has a mind. Be sure to check out his YouTube channel where he’s talking about his Jehovah’s Witness experiences. Sean\u0027s YouTube Channel Support the show",
      "release": "2021-12-17T14:32:40Z",
      "duration": "01:30:14.5820000",
      "explicit": false,
      "spotifyId": "7wazZtu5ZDu6rS58I0FjE6",
      "appleId": 1000545286449,
      "youTubeId": "noWCmngMZpA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7wazZtu5ZDu6rS58I0FjE6",
        "apple": "https://podcasts.apple.com/podcast/interview-sean-myles-jehovahs-witnesses-you-heard-it/id967813520?i=1000545286449",
        "youtube": "https://www.youtube.com/watch?v=noWCmngMZpA"
      }
    },
    {
      "id": "d039994d-742d-4cb8-9d94-321dd9d6ba87",
      "title": "Interview: Paul Brumfield - I Was Forced to Live a Double-Life to Survive my Jehovah’s Witness Childhood",
      "description": "In this podcast, Paul discusses how he had to live a double-life to survive his Jehovah’s Witness childhood. To learn more about his story, check out his YouTube channel at exjw in Louisiana – https://www.youtube.com/channel/UCNG97S9rUBNmXaBm_ozarpA Support the show",
      "release": "2021-12-17T14:00:00Z",
      "duration": "01:13:44.3850000",
      "explicit": false,
      "spotifyId": "71tCAMRC0pT0MCvuQMu6mB",
      "appleId": 1000545282057,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/71tCAMRC0pT0MCvuQMu6mB",
        "apple": "https://podcasts.apple.com/podcast/interview-paul-brumfield-i-was-forced-to-live-a/id967813520?i=1000545282057"
      }
    },
    {
      "id": "40556a1c-50e1-4b8a-985b-7bdb1d516c17",
      "title": "Interview: Tracy EXJW Commuter Bethelite Wakes up to the truth about Jehovah\u0027s Witnesses",
      "description": "Help support our work on Patreon – https://www.patreon.com/exjwcriticalthinker Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Follow us on: Twitter Instagram Facebook Check out our t-shirt designs: https://exjwcriticalthinker.myspreadshop.com/all Support the show",
      "release": "2021-11-11T22:50:06Z",
      "duration": "01:20:39.2090000",
      "explicit": false,
      "spotifyId": "1Ww3TC8reLmwcaTspZKxVM",
      "appleId": 1000541545454,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Ww3TC8reLmwcaTspZKxVM",
        "apple": "https://podcasts.apple.com/podcast/interview-tracy-exjw-commuter-bethelite-wakes-up-to/id967813520?i=1000541545454"
      }
    },
    {
      "id": "e31d8748-b4b2-4712-b724-2e1c2c7ccbd5",
      "title": "Interview: Kenan J. Floyd Goes from Watchtower to Hollywood",
      "description": "How to reach Kenan Fill out the contact form at https://dangerouslyawkward.com/ Become an investor https://wefunder.com/dap Kenan J. Floyd takes the opportunity to come back on our channel to talk about his latest accomplishments. He is finally fulfilling many of his life long dreams that were, of course, put on hold during his time living up to the expectations of the Watchtower, Bible \u0026 Tract Society. He has established five companies and has several opportunities to offer those with skills in film, animation, audio/video, cartooning, etc. Kenan understands what its like growing up as one of Jehovah\u0027s Witnesses and how many others have been held back from pursuing their dreams and goals and turning them into a reality. Help support our work on Patreon - https://www.patreon.com/exjwcriticalthinker Visit us on the Web at http://www.exjwcriticalthinker.com SUBSCRIBE to us on YouTube http://bit.ly/2p9RTSC Follow us on: Twitter Instagram Facebook Check out our t-shirt designs: https://exjwcriticalthinker.myspreadshop.com/all Support the show",
      "release": "2021-11-11T14:00:00Z",
      "duration": "00:41:57.0800000",
      "explicit": false,
      "spotifyId": "41T0Ktv9TCRrBa9Fj0pZnY",
      "appleId": 1000545282056,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/41T0Ktv9TCRrBa9Fj0pZnY",
        "apple": "https://podcasts.apple.com/podcast/interview-kenan-j-floyd-goes-from-watchtower-to-hollywood/id967813520?i=1000545282056"
      }
    },
    {
      "id": "47982a18-d688-4edd-93d9-405ae7fbdc34",
      "title": "Interview: Keana Mitchell - Are Seventh Day Adventists Similar to Jehovah’s Witnesses?",
      "description": "In this episode, Lady Cee speaks with Keana, an ex-7th Day Adventist. Keana talks about what it was like growing up in her faith, how she felt about most of their teachings, and why she finally decided to walk away from everything. She founded the Finding God Podcast where she features new guests each week about their journey out of organized religion. https://open.spotify.com/show/022Zht5DjU1i3k7BAeHaTW?si=0f7cca23321e499b Keana is the host of a podcast called Finding God. Help support our work on Patreon - https://www.patreon.com/exjwcriticalthinker Support the show",
      "release": "2021-10-29T21:00:00Z",
      "duration": "00:38:11.4350000",
      "explicit": false,
      "spotifyId": "7sKoGmSplYBFdV8XbRV15B",
      "appleId": 1000540177973,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sKoGmSplYBFdV8XbRV15B",
        "apple": "https://podcasts.apple.com/podcast/interview-keana-mitchell-are-seventh-day-adventists/id967813520?i=1000540177973"
      }
    },
    {
      "id": "fdd88a6b-a2d3-4f9f-a7c5-5208790365e9",
      "title": "Interview: Dave Wicklin Love Bombed by Jehovah’s Witnesses",
      "description": "There are many people that come into contact with Jehovah\u0027s Witnesses at the lowest point in their lives. David is no different. During the time he lost his mother, they were right there selling paradise. He learned all about the resurrection hope, welcoming dead loved ones, living on paradise earth, and all the fun he\u0027d have playing with the tigers, lions, and bears and enjoying the prospects of living forever. The only catch? He had to join their religion. He was quickly love-bombed by the Witnesses at his mother\u0027s funeral and David fell for their fake love - hook-line-and-sinker like so many unsuspecting individuals. At the time David came into contact with the Witnesses, he was still young and impressionable. He was still trying to figure things out, not really sure about what he wanted to do with his life. He was taking classes at the community college and working at the local convenient store. However, after getting further involved with the group, he was discouraged from pursuing higher education. He quickly got with their program and began following their rules. He had no idea that this religion was not just same mainstream organization that attended meetings on Sunday. Nope, it was much more than that. for the next 20\u0026#43; years, David found himself on a mental marry-go-ground jumping through all of the Watchtower\u0027s hoops. Support the show",
      "release": "2021-10-24T01:00:00Z",
      "duration": "01:20:57.8870000",
      "explicit": false,
      "spotifyId": "2M6A9MP0DNBeLwzHW2QSXT",
      "appleId": 1000539509694,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2M6A9MP0DNBeLwzHW2QSXT",
        "apple": "https://podcasts.apple.com/podcast/interview-dave-wicklin-love-bombed-by-jehovahs-witnesses/id967813520?i=1000539509694"
      }
    },
    {
      "id": "d5ef951a-04a7-4e88-bdf6-1b3734094b39",
      "title": "Discussion: The Top 3 Ways Jehovah’s Witnesses Become the Governing Body’s Science Project",
      "description": "Pavlov’s Dogs – Classical Conditioning https://www.youtube.com/watch?v=jd7Jd… Pavlov started out studying dog digestion and discovered classical conditioning. He didn’t initially set out to condition the dog to respond to the bell ringing to believe he will be fed. Classical conditioning is a mental manipulation to reprogram natural body functions. It is a way of learning where […] Support the show",
      "release": "2021-10-20T00:09:33Z",
      "duration": "00:25:42.6350000",
      "explicit": false,
      "spotifyId": "3zanbrZRI2WuM3nLnT9of6",
      "appleId": 1000539115512,
      "youTubeId": "sL8KTQ07wdw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zanbrZRI2WuM3nLnT9of6",
        "apple": "https://podcasts.apple.com/podcast/discussion-the-top-3-ways-jehovahs-witnesses-become/id967813520?i=1000539115512",
        "youtube": "https://www.youtube.com/watch?v=sL8KTQ07wdw"
      }
    },
    {
      "id": "5a7bc6dd-b10b-4d2a-8de8-615e10edd233",
      "title": "Carrie Bee, My Jehovah’s Witness Shunning Experience",
      "description": "In this episode, our guest Carrie Bee, the author of Paradise Bound https://www.amazon.com/Paradise-Bound-Carrie-Bee/dp/1628387254), shares her experience on the effects of shunning for the better part of her life by her parents. Despite being their only child, they are more devoted enforcing Watchtower policies than having a relationship with their daughter. They have also chosen not […] Support the show",
      "release": "2021-10-05T14:52:13Z",
      "duration": "01:07:36.3200000",
      "explicit": false,
      "spotifyId": "3GZbiQGWGLTjv1PbUMDz4G",
      "appleId": 1000537625418,
      "youTubeId": "cDcD15V8h24",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3GZbiQGWGLTjv1PbUMDz4G",
        "apple": "https://podcasts.apple.com/podcast/carrie-bee-my-jehovahs-witness-shunning-experience/id967813520?i=1000537625418",
        "youtube": "https://www.youtube.com/watch?v=cDcD15V8h24"
      }
    },
    {
      "id": "25df8da1-f53a-4d6e-a5ec-52efd10b5f2b",
      "title": "The Governing Body of Jehovah’s Witnesses Plays Mind Games with Children",
      "description": "In this episode, we will discuss the issues with how Jehovah’s Witnesses indoctrinate their children to believe that the Watchtower teachings are from Jehovah and they are the only true religion. Despite many children choosing not to get baptized, their lives are extremely impacted by their upbringing. Unfortunately, we never get to hear the experiences […] Support the show",
      "release": "2021-10-01T21:05:35Z",
      "duration": "01:08:55.0530000",
      "explicit": false,
      "spotifyId": "6sqIiSF9QYUlcFPLLkfGOS",
      "appleId": 1000537279354,
      "youTubeId": "3Q7IZHwBTZA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6sqIiSF9QYUlcFPLLkfGOS",
        "apple": "https://podcasts.apple.com/podcast/the-governing-body-of-jehovahs-witnesses-plays/id967813520?i=1000537279354",
        "youtube": "https://www.youtube.com/watch?v=3Q7IZHwBTZA"
      }
    },
    {
      "id": "8feaee11-68a6-48ba-8e25-b06c82049dec",
      "title": "Discussion: Jehovah’s Witness Elders are Cautioned to Keep Their Mouth Shut!",
      "description": "AnnouncementSeptember 27, 2021 FOR ELDERS COVID-19 Vaccinations and Respect for Superior Authorities: Out of concern andlove, we are sharing the following important information. (1 Cor. 12:25) As a result of theongoing pandemic, secular authorities in an increasing number of lands are mandating orstrongly encouraging that their citizens be vaccinated for COVID-19. The recent GoverningBody updates […] Support the show",
      "release": "2021-09-30T00:24:20Z",
      "duration": "00:12:57.2990000",
      "explicit": false,
      "spotifyId": "2k3YcF9XHWwW14kPPR8m3U",
      "appleId": 1000537048389,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2k3YcF9XHWwW14kPPR8m3U",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witness-elders-are-cautioned-to/id967813520?i=1000537048389"
      }
    },
    {
      "id": "016a6251-e84b-464d-bb42-4b42b3ac0e31",
      "title": "Jehovah’s Witnesses: Bethel Experiences, a Peek Behind the Curtain",
      "description": "In this podcast, JT and Goatlike Personality discuss their experiences at Bethel. ★ VISIT OUR WEBSITE http://www.exjwcriticalthinker.com ★SUBSCRIBE TO OUR YOUTUBE CHANNEL http://bit.ly/2p9RTSC ★ TWEET US! #ExJWsThink ★ VISIT OUR WORDPRESS BLOG https://exjehovahswitnessct.wordpress.com ★ FOLLOW US ON INSTAGRAM https://www.instagram.com/exjwcriticalthinker/ ★LIKE US ON FACEBOOK https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2021-09-25T02:13:15Z",
      "duration": "00:48:47.8820000",
      "explicit": false,
      "spotifyId": "5HTpZRRp4dm9xj8Yf1O5Kf",
      "appleId": 1000536557734,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5HTpZRRp4dm9xj8Yf1O5Kf",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-bethel-experiences-a-peek-behind/id967813520?i=1000536557734"
      }
    },
    {
      "id": "7cddbf4d-9878-4b22-a79a-cd4377000b7e",
      "title": "Live Stream: Jehovah’s Witnesses \u0026 Shunning: A Loving Arrangement?",
      "description": "In this podcast, we discuss shunning and the effects it has on Jehovah’s Witness families. This podcast was streamed live. Our friend Jay took time to join us in this discussion and shares his experience being shunned by his four children. Support the show",
      "release": "2021-09-20T20:00:00Z",
      "duration": "01:05:37.3840000",
      "explicit": false,
      "spotifyId": "6G4z74IrW7FlhPvnwdMrzr",
      "appleId": 1000536068576,
      "youTubeId": "TQJQLC0tDCQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6G4z74IrW7FlhPvnwdMrzr",
        "apple": "https://podcasts.apple.com/podcast/live-stream-jehovahs-witnesses-shunning-a-loving/id967813520?i=1000536068576",
        "youtube": "https://www.youtube.com/watch?v=TQJQLC0tDCQ"
      }
    },
    {
      "id": "4ec48e14-3d61-470d-9361-2d33b1ef0d6f",
      "title": "Interview: John Dehlin – Mormon Stories Podcast",
      "description": "Guest John Dehlin, Jehovah’s Witnesses and the Mormon Church? What is the difference? When you think about their history, both religions came into existence during the same era. Each religious leader predicted the end of the world. They misled individuals to believe in their fairy tales of an afterlife. They even convinced them that they […] Support the show",
      "release": "2021-09-18T12:36:43Z",
      "duration": "02:05:42.2560000",
      "explicit": false,
      "spotifyId": "1thKHnbrOdQJ3NsYsrPBPu",
      "appleId": 1000535849546,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1thKHnbrOdQJ3NsYsrPBPu",
        "apple": "https://podcasts.apple.com/podcast/interview-john-dehlin-mormon-stories-podcast/id967813520?i=1000535849546"
      }
    },
    {
      "id": "1e3ecf57-34e9-442e-bd9d-dddebae7d728",
      "title": "Discussion: 9/11 and the Watchtower Twenty Years Later",
      "description": "#exjw #exjwcriticalthinker #jehovahswitness #endofworld Remembering Watchtower Twenty Years Later. It was 20 short (or long) years ago, that the United States experienced a tragedy. Everyone we knew was telling us to get back to the Kingdom Hall because “it done started” Yes, they said, the end of the world is near and anyone that wants […] Support the show",
      "release": "2021-09-18T11:49:15Z",
      "duration": "00:44:38.1250000",
      "explicit": false,
      "spotifyId": "21PriAyFy3DnP8oyAcA10Q",
      "appleId": 1000535848195,
      "youTubeId": "EWOUYrp1nC0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21PriAyFy3DnP8oyAcA10Q",
        "apple": "https://podcasts.apple.com/podcast/discussion-9-11-and-the-watchtower-twenty-years-later/id967813520?i=1000535848195",
        "youtube": "https://www.youtube.com/watch?v=EWOUYrp1nC0"
      }
    },
    {
      "id": "7b16ea08-2ebf-420f-a0c6-423ff4fbad39",
      "title": "Discussion: Is the Governing Body of Jehovah’s Witnesses Losing Their Grip on its Members?",
      "description": "This podcast critiques the talk presented by Governing Body member David Splane from the 2021 Regional Convention of Jehovah’s Witnesses. It helps individuals to use critical thinking when listening to the comments on how the Jehovah’s Witness leadership tries to convince its members to treat information they receive from former members or the media. Throughout […] Support the show",
      "release": "2021-08-30T20:04:27Z",
      "duration": "00:32:23.7450000",
      "explicit": false,
      "spotifyId": "49WphWpHkzQ9qmshuoGOdW",
      "appleId": 1000533713216,
      "youTubeId": "8sRdPh1mvw0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/49WphWpHkzQ9qmshuoGOdW",
        "apple": "https://podcasts.apple.com/podcast/discussion-is-the-governing-body-of-jehovahs/id967813520?i=1000533713216",
        "youtube": "https://www.youtube.com/watch?v=8sRdPh1mvw0"
      }
    },
    {
      "id": "b5ebd783-01b4-44e3-9b4e-aefcd0b5cf62",
      "title": "Interview: Keith I Learned the Truth About Jehovah’s Witnesses Surfing Facebook",
      "description": "In this video podcast, Keith tells his story about how he stumbled on the truth about Jehovah’s Witnesses on Facebook. Doing a simple Google search about a Jehovah’s Witness Kingdom Melody lead him to the EX-Jehovah’s Witness Critical Thinker Facebook Page. He reached out to express his gratitude and the rest is history. The following […] Support the show",
      "release": "2021-08-23T21:37:29Z",
      "duration": "00:52:18.7950000",
      "explicit": false,
      "spotifyId": "5v0JOZGUKyb0eOQv4useM6",
      "appleId": 1000532886047,
      "youTubeId": "s-YRRrKwHWc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5v0JOZGUKyb0eOQv4useM6",
        "apple": "https://podcasts.apple.com/podcast/interview-keith-i-learned-the-truth-about-jehovahs/id967813520?i=1000532886047",
        "youtube": "https://www.youtube.com/watch?v=s-YRRrKwHWc"
      }
    },
    {
      "id": "587761e8-97a1-4829-8721-44c587a08e4b",
      "title": "Interview: Waking Up To Watchtower Lies: Story of a Dedicated Pioneer",
      "description": "In this interview with Goatlike Personality, JT learns a different perspective on racism in European countries and it has nothing to do with the color of your skin. During the discussion, Goatlike talks about why he could have been a PIMO for life, if the brothers would have only helped his wife to appreciate that […] Support the show",
      "release": "2021-08-14T01:41:23Z",
      "duration": "00:43:57.1650000",
      "explicit": false,
      "spotifyId": "4VmOe6kB39NARI2kR4JA4h",
      "appleId": 1000531976314,
      "youTubeId": "3jhU3kM20ws",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VmOe6kB39NARI2kR4JA4h",
        "apple": "https://podcasts.apple.com/podcast/interview-waking-up-to-watchtower-lies-story-of/id967813520?i=1000531976314",
        "youtube": "https://www.youtube.com/watch?v=3jhU3kM20ws"
      }
    },
    {
      "id": "cead909c-de1c-44bd-a7df-6c585f5e7051",
      "title": "Interview: Misty \u0026 Craig - Why My Husband Turned Me In To The Elders",
      "description": "In this video podcast, JT \u0026 Lady Cee talk with Craig \u0026 Misty about how the Watchtower, Bible \u0026 Tract Society divides families. They discuss the fall out on what happens when Misty chooses to join the group and the affect it has on her relationship with her husband. They also discuss how it affects […] Support the show",
      "release": "2021-08-08T01:33:35Z",
      "duration": "00:55:51.7190000",
      "explicit": false,
      "spotifyId": "3KfGBvZd9gdo1ufHuQFkt6",
      "appleId": 1000531352302,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3KfGBvZd9gdo1ufHuQFkt6",
        "apple": "https://podcasts.apple.com/podcast/interview-misty-craig-why-my-husband-turned-me-in-to/id967813520?i=1000531352302"
      }
    },
    {
      "id": "8b1abfe9-05db-4dc5-8449-93622ab5f87a",
      "title": "Interview: Chef Nellie - Why I Never Fit in at the Kingdom Hall",
      "description": "In this podcast, Chef Nelly speaks about her life growing up as one of Jehovah’s Witnesses and the difficulty she had fitting in to the congregation. Being home schooled, beginning with the fourth grade meant being isolated from her peers in a public school setting. Also, being that there were not many kids her age […] Support the show",
      "release": "2021-07-25T23:27:53Z",
      "duration": "01:05:03.3460000",
      "explicit": false,
      "spotifyId": "0SUMe3fZr2pYM6MMDDOuDi",
      "appleId": 1000529986830,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0SUMe3fZr2pYM6MMDDOuDi",
        "apple": "https://podcasts.apple.com/podcast/interview-chef-nellie-why-i-never-fit-in-at-the-kingdom-hall/id967813520?i=1000529986830"
      }
    },
    {
      "id": "6e4348e9-16af-4b9c-955d-c11b7589ac60",
      "title": "Interview: Eric Wilson How I Woke Up from the Jehovah\u0027s Witness Faith after serving for 40 Years as an Elder",
      "description": "To learn more about Eric Wilson, visit his channel using the link below: https://www.youtube.com/channel/UC1l1Ac6tb16thxKa96Gm7XA All of the links associated with the Spanish Victims of Jehovah’s Witnesses can be found in the links of the following video by Eric Wilson. Is the Organization of Jehovah\u0027s Witnesses actually suing people for feeling victimized? https://www.youtube.com/watch?v=JT5pdtV9A14 Support the show",
      "release": "2021-07-16T16:00:00Z",
      "duration": "00:47:37.7430000",
      "explicit": false,
      "spotifyId": "1TQbIt8Wf8K0bEiwGIxl9K",
      "appleId": 1000529104311,
      "youTubeId": "zGjjwRNjz1s",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1TQbIt8Wf8K0bEiwGIxl9K",
        "apple": "https://podcasts.apple.com/podcast/interview-eric-wilson-how-i-woke-up-from-the-jehovahs/id967813520?i=1000529104311",
        "youtube": "https://www.youtube.com/watch?v=zGjjwRNjz1s"
      }
    },
    {
      "id": "c1393c2f-bd34-4445-a90e-8b4ca1c4d87a",
      "title": "Interview: Nash \u0026 Lisa: How the Jehovah’s Witnesses Destroyed My Family",
      "description": "In this podcast, Nash relates his personal story about growing up as one of Jehovah’s Witnesses. The tragic loss of losing a brother to a traffic accident and his father’s near-fatal accident is what brought him to the decision to dedicate his life in baptism to the Watchtower organization. Nash’s world came crumbling down after […] Support the show",
      "release": "2021-07-06T16:37:10Z",
      "duration": "01:23:57.6620000",
      "explicit": false,
      "spotifyId": "4zyCtJOV3yAs3rYquzKMFI",
      "appleId": 1000528021268,
      "youTubeId": "ndf7xpQaE-Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4zyCtJOV3yAs3rYquzKMFI",
        "apple": "https://podcasts.apple.com/podcast/interview-nash-lisa-how-the-jehovahs-witnesses/id967813520?i=1000528021268",
        "youtube": "https://www.youtube.com/watch?v=ndf7xpQaE-Y"
      }
    },
    {
      "id": "824c1e4a-feb5-4930-b409-40a217918b11",
      "title": "Discussion: Jehovah’s Witnesses - Why No One is Getting Baptized",
      "description": "During the 2020 annual meeting of the Watchtower, Bible \u0026 Tract Society, David Splane, Governing Body member, clearly explained that the low baptism amongst the Jehovah’s Witness ranks are quite concerning. It is something that has been trending for many years. To increase the baptism numbers the release of a new publication titled “Enjoy Living […] Support the show",
      "release": "2021-06-09T02:11:47Z",
      "duration": "00:16:52.8450000",
      "explicit": false,
      "spotifyId": "5NZdtfmXKBSy16QxGU0wtW",
      "appleId": 1000524726162,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5NZdtfmXKBSy16QxGU0wtW",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-why-no-one-is-getting/id967813520?i=1000524726162"
      }
    },
    {
      "id": "09873377-9590-4ee4-990d-d37c0f4bf231",
      "title": "Interview with EXJW Fifth",
      "release": "2021-06-09T02:03:48Z",
      "duration": "01:03:25.3870000",
      "explicit": false,
      "spotifyId": "0WVtRvGjY12XVxB3MZxPsA",
      "appleId": 1000524722552,
      "youTubeId": "AaoKsRmGJj8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0WVtRvGjY12XVxB3MZxPsA",
        "apple": "https://podcasts.apple.com/podcast/interview-with-exjw-fifth/id967813520?i=1000524722552",
        "youtube": "https://www.youtube.com/watch?v=AaoKsRmGJj8"
      }
    },
    {
      "id": "f111b22d-6854-48b2-80e3-28e7826cf9f9",
      "title": "Interview with couple that never grieved their children because of Watchtower",
      "release": "2021-06-09T01:57:34Z",
      "duration": "00:54:26.8730000",
      "explicit": false,
      "spotifyId": "5ILedTwLtWYmhmE5YymxDv",
      "appleId": 1000524722551,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ILedTwLtWYmhmE5YymxDv",
        "apple": "https://podcasts.apple.com/podcast/interview-with-couple-that-never-grieved-their/id967813520?i=1000524722551"
      }
    },
    {
      "id": "c4b8b620-d375-4e24-a5b3-9dba399a75e1",
      "title": "Interview: Rashauna - Discovering My Identity After Leaving the Jehovah\u0027s Witnesses",
      "description": "#exjw #JehovahWitness #exjwcriticalthinker #exjwinterviews In this podcast, Rashauna discusses her life in the Jehovah\u0027s Witness religion about regaining her identity after leaving the group. Rashauna discusses how she was able to regain her identity after leaving the Watchtower. She no longer has to agree with everything someone says or be on the same page with them in terms of acting out to remain part of a group. She discusses how therapy has helped her to regain her identity after finding out what she wants to do and discover who she is and what she wants out of life. To learn more about how Rashuna woke up and left the Jehovah\u0027s Witness religion, here\u0027s a link to the interview with her husband: https://youtu.be/on42UtqJZEs . Support the show",
      "release": "2021-05-07T12:00:00Z",
      "duration": "00:46:15.3270000",
      "explicit": false,
      "spotifyId": "0yhhda7CfUkaIPhvbs04xn",
      "appleId": 1000520645448,
      "youTubeId": "4v1oJpRg3Wg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0yhhda7CfUkaIPhvbs04xn",
        "apple": "https://podcasts.apple.com/podcast/interview-rashauna-discovering-my-identity-after-leaving/id967813520?i=1000520645448",
        "youtube": "https://www.youtube.com/watch?v=4v1oJpRg3Wg"
      }
    },
    {
      "id": "588873f3-d719-4774-99b7-346a984e9664",
      "title": "Interview: Life After Watchtower Three Years Later",
      "description": "Lonnie.G a Vegan Chef, Content Creator, Investor, Business Owner, Poet here’s my socials. Lonnie\u0027s previous interview from 2018 - https://youtu.be/deIwpc8Geko Lonnie Gillard appeared on our show three years ago telling his story about waking up and leaving the Jehovah’s Witness religion. He was still living at home with his parents. As a result, his parents no longer allowed him to remain living in their home. He survived by finding online resources and was able to land a place to live at an Airbnb. Fortunately, Lonnie was able to find support from his non-Jehovah’s Witness family. While most do not live locally, they still took time to provide him with mental and moral support. He expresses how he is most grateful for them calling him to do telephone check ins, something is not receiving from his parents. Fortunately, Lonnie did not have any extreme circumstances, nor did he ever find himself on the street. He always had a place to lay his head at night. He credits his father for his ability to survive because as he states, “my father said my job is to make sure that you and your siblings are able to stand on your own two feet”. Now that he’s out in the world, he appreciates his home training. Looking back, he said, he thought he was the crazy one because he is the only one saying this religion is a cult. But, after learning the truth about the religion, he realizes that he is not alone especially after meeting other former Jehovah’s Witnesses. According to Lonnie, life goes on and he’s okay with the notion that the people in his past, including his family no longer want to have anything to do with him. Because he believes that he needs to move on to the next chapter in his life. As he loses all the weight that has been on his shoulders, he can sleep good at night because he knows he’s doing the best that he can do. Support the show",
      "release": "2021-04-30T12:00:00Z",
      "duration": "00:45:28.6460000",
      "explicit": false,
      "spotifyId": "1adQw5llrzXi914rLkRoHD",
      "appleId": 1000519447437,
      "youTubeId": "EWOUYrp1nC0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1adQw5llrzXi914rLkRoHD",
        "apple": "https://podcasts.apple.com/podcast/interview-life-after-watchtower-three-years-later/id967813520?i=1000519447437",
        "youtube": "https://www.youtube.com/watch?v=EWOUYrp1nC0"
      }
    },
    {
      "id": "1385b55b-bfee-419b-afdf-2bb98c887121",
      "title": "Interview: Ashli Campbell - Struggles of Jehovah’s Witness Women – in Relationships",
      "description": "Link to Ashli\u0027s YouTube Channel https://www.youtube.com/channel/UCBlM3DJOyNt3FLT4rN1VHkQ In this podcast, Lady Cee chats with Ashli Campbell about her experience growing up as one of Jehovah\u0027s Witnesses. Ashil talks about what life was like having a father that was not interested in participating in Watchtower activities, but made sure she got involved. It\u0027s amazing how he is not willing to make these major sacrifices but has no problems pushing this heavy responsibility on his minor child. The sheer frustration of getting baptized at the age of 12 has Ashli up in arms about being a good Jehovah\u0027s Witness. She has to live up to the responsibility and living the non-stop lifestyle of a JW begins taking its toll on her. She\u0027s looking for a means to escape and in the process makes some weighty decisions that are even more detrimental than remaining home and riding it out until she\u0027s old enough to move out and get her own place. Ashli drops out of high school in the 10th grade and begins working full time. She looks at this approach as a means to accelerating the process of moving out because it will allow her to save enough money to be on her own. Not long afterwards, Ashli meets a brother through mutual friends and after dating for six months, they get married. At age 18, she\u0027s not sure whether or not her situation is better or worse because the only thing she\u0027s done is swapped being home with parents that are ensuring she attends weekly meetings at the Kingdom Hall, to a husband that is virtually doing the same thing. As the interview progresses, Lady Cee and Ashli speak in-depth about Jehovah\u0027s Witness women and their struggles as second class citizens and the difficulty of being free to express oneself in the religion. It\u0027s a topic that is not explored enough in this culture because as they both express the importance of having a voice in relationships where both partners should equally strive to please one another instead of one serving the other\u0027s needs. Support the show",
      "release": "2021-04-23T18:00:00Z",
      "duration": "01:10:42.5460000",
      "explicit": false,
      "spotifyId": "0FnliK0shSLKRwt8AWFgF0",
      "appleId": 1000518370072,
      "youTubeId": "OfqgtNxh01k",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0FnliK0shSLKRwt8AWFgF0",
        "apple": "https://podcasts.apple.com/podcast/interview-ashli-campbell-struggles-of-jehovahs/id967813520?i=1000518370072",
        "youtube": "https://www.youtube.com/watch?v=OfqgtNxh01k"
      }
    },
    {
      "id": "f9db733a-6bb8-4ad5-8d93-2350aff18fb0",
      "title": "Discussion: Jehovah\u0027s Witnesses: Should I Tell My Family The Truth About JW.ORG",
      "description": "We receive emails from people worldwide asking us if they should tell their family and friends the truth about the Jehovah\u0027s Witness religion. After waking up to startling facts about the organization, they, like many Jehovah\u0027s Witnesses, are shocked about their findings. Many times, people forget about what it was like being one of Jehovah\u0027s Witnesses and how they will respond to anything we say negative about the Watchtower Society. Some have gone out on a limb and shared the information they learned online and have experienced a complete shutdown, and were swiftly cut off from their family and friends. They have not counted the cost of their relationship before speaking up and speaking out. As minor children still living at home, you must realize that you need financial support from your parents and guardians. Others may be working for a brother or sister in the congregation and need your job to pay your bills. What if you rent a room or an apartment and now have to think about other living accommodations? Your security and well-being are more important than imparting knowledge. Be sure to take care of your well-being before speaking out against the religion. Think about the consequences of your actions before divulging too much information about this religion to family and friends. Put the oxygen mask on your face before attempting to help others. You need to ensure you have reached a safe place, and then you can reach back to extend yourself to others. Support the show",
      "release": "2021-04-18T20:00:00Z",
      "duration": "00:28:10.1480000",
      "explicit": false,
      "spotifyId": "4DD7i1q6JphmNbVfYMaPz0",
      "appleId": 1000517660002,
      "youTubeId": "tyYh-WAwmmA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4DD7i1q6JphmNbVfYMaPz0",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-should-i-tell-my-family/id967813520?i=1000517660002",
        "youtube": "https://www.youtube.com/watch?v=tyYh-WAwmmA"
      }
    },
    {
      "id": "8754d131-3305-42fc-89d6-49be67c8b7d2",
      "title": "Jehovah’s Witnesses Break Up Families",
      "description": "★ VISIT OUR WEBSITE http://www.exjwcriticalthinker.com ★SUBSCRIBE TO OUR YOUTUBE CHANNEL http://bit.ly/2p9RTSC ★ TWEET US! #ExJWsThink https://twitter.com/ExJWsThink ★ VISIT OUR WORDPRESS BLOG https://exjehovahswitnessct.wordpress.com ★ FOLLOW US ON INSTAGRAM https://www.instagram.com/exjwcriticalthinker/ ★LIKE US ON FACEBOOK https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ ✰✰ EMAIL: jtladycee@gmail.com Support the show",
      "release": "2021-04-05T00:26:21Z",
      "duration": "00:40:45.3740000",
      "explicit": false,
      "spotifyId": "3T1cfbSiyufzMTCS7aBZ3R",
      "appleId": 1000515752022,
      "youTubeId": "ojnKZVO7TCY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3T1cfbSiyufzMTCS7aBZ3R",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-break-up-families/id967813520?i=1000515752022",
        "youtube": "https://www.youtube.com/watch?v=ojnKZVO7TCY"
      }
    },
    {
      "id": "4f6d0dec-7a71-49ce-8ec5-876928407822",
      "title": "Jehovah\u0027s Witnesses: Stop Playing Games! Why Can’t I Get Reinstated?",
      "description": "Jehovah\u0027s Witnesses stake the claim that they carry out the same practices in their worship all over the world. But, one of the most inconsistent practices in their faith is the one that pertains to the judicial process and disfellowshipping. If you are disfellowshipped and cannot understand why it is taking so long to get reinstated after making multiple requests, chances are there is someone on your judicial case that has a personal agenda against your best interests. There is no consistency on how reinstatement is carried out. It is up to the three individuals that are serving on your committee that determines your fate. It leaves people to ask the question, what am I doing wrong or what am I failing to do? When in fact, the elders may believe that you are not repentant enough. In fact, if you had a different set of elders handling your case, your outcome may have turned out in your favor. This podcast explores some of the unspoken and untold reasons why some people actually languish in a disfellowshipped state not realizing why they are unable to get reinstated. It also discusses how people are treated after they are reinstated. Instead of being immersed in love for returning back to God, they are treated with suspicion that results in unnecessary challenges. Support the show",
      "release": "2021-03-30T12:00:00Z",
      "duration": "00:20:29.5310000",
      "explicit": false,
      "spotifyId": "7zbx3L93PvPKyxmjdcPdol",
      "appleId": 1000515023704,
      "youTubeId": "jgkfQJD0GQY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7zbx3L93PvPKyxmjdcPdol",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-stop-playing-games-why-cant-i-get/id967813520?i=1000515023704",
        "youtube": "https://www.youtube.com/watch?v=jgkfQJD0GQY"
      }
    },
    {
      "id": "bfa86a1b-79d8-440d-b28c-da7e55ba1c83",
      "title": "Belgian Court Fines Jehovah’s Witnesses for Shunning Former Members",
      "description": "Do Jehovah\u0027s Witnesses have a policy for shunning former members? The Watchtower lawyers present arguments to the Belgian court system that it is an individual choice whether to shun family. However, this podcast provides excellent proof from their own written publications that they have a system of teaching their adherents to shun former members. In fact, the Watchtower, Bible \u0026 Tract Society has a long history of influencing its members to comply with their teachings even at the cost of dividing families and long-time friendships. https://foref-europe.org/blog/2021/03/19/belgium-the-decision-of-the-court-of-ghent-against-jehovahs-witnesses/ The following links pertain to written comments by Dr. Introvigne, a defender of JW\u0027s who disagrees with the Belgium court: PART ONE https://bitterwinter.org/jehovahs-witnesses-fined-in-ghent-for-their-ostracism-a-wrong-decision/ PART TWO https://bitterwinter.org/the-ghent-jehovahs-witnesses-decision-dangers-for-religious-liberty/ PART THREE https://bitterwinter.org/the-ghent-jehovahs-witness-decision-dangerous-for-all-religions/ The Jehovah’s Witnesses’ Case On 16 February, a trial started against the Christian Congregation of Jehovah’s Witnesses (CCJW) at the criminal court of Ghent (East Flanders) on the alleged grounds of discrimination and incitement to hatred with a particular focus on their shunning (ostracization) practice in cases of disfellowshipping (exclusion) and disassociation (voluntary resignation). A former Jehovah’s Witness who had voluntarily left the movement in 2011, filed a criminal complaint against the CCJW in 2015, and managed to have it supported by over a dozen more former Jehovah’s Witnesses. According to the internal religious practice of Jehovah’s Witnesses, when the elders of a local congregation exclude a member or are notified about a voluntary resignation, they make a short neutral public announcement which states: “[Name of person] is no longer one of Jehovah’s Witnesses”. The CCJW is not involved in the making of that neutral announcement but is notified about the decision. In their conclusions provided to the Court before the trial, they said that they do not segregate excluded or resigning members as these can always attend their religious services. They also point out that baptized Jehovah’s Witnesses who no longer actively associate with fellow believers, are not shunned. Clarifying the relations between Jehovah’s Witnesses and disfellowshipped or disassociated family members, they say: “In the immediate household, although the ‘religious ties’ the expelled or disassociated person had with his family change, … blood ties remain. The marriage relationship and normal family affections and dealings continue.” In other words, normal family affection and association continues. In addition, the CCJW had provided the Court with nine statements of individuals who had been excluded and who had since been reinstated as Jehovah’s Witnesses. In their testimonies, they explained how they had been fairly treated by congregation elders, family, and others in the congregation when they were excluded. The social distancing doctrine stated and practiced by Jehovah’s Witnesses in Belgium and all other countries was fixed by their Central College in the United States on the basis of their interpretation of the Bible Support the show",
      "release": "2021-03-22T12:00:00Z",
      "duration": "00:15:16.9760000",
      "explicit": false,
      "spotifyId": "4RJYRcMo2jIJqppJc5o0OO",
      "appleId": 1000513938683,
      "youTubeId": "gIXdxuxzZ3s",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4RJYRcMo2jIJqppJc5o0OO",
        "apple": "https://podcasts.apple.com/podcast/belgian-court-fines-jehovahs-witnesses-for-shunning/id967813520?i=1000513938683",
        "youtube": "https://www.youtube.com/watch?v=gIXdxuxzZ3s"
      }
    },
    {
      "id": "aaa355f7-c1f9-4953-9605-00cc65129e83",
      "title": "Discussion: Jehovah’s Witness Publications from Truth to Trash?",
      "description": "How can you claim that your publications represent the truth and are divinely provided aids from God one day and then discard them as refuse and unworthy of being referenced tomorrow? Jehovah’s Witnesses have made life altering decisions based on the information contained in these publications resulting in dire consequences. Some have been disfellowshipped and lost their families and good reputation. Sadly, others have actually lost their lives. Imagine how much hurt this causes after discovering years later that these teachings no longer exist and the publications used to support Watchtower beliefs are being tossed out like yesterday’s trash! Instead of presenting their information as nothing more than their own opinion, they are signing God’s name as if he’s speaking directly to them. Link to Letter https://exjehovahswitnessct.files.wordpress.com/2021/03/2012-2020-publications-approved-for-discard.pdf Support the show",
      "release": "2021-03-16T16:00:00Z",
      "duration": "00:11:46.2980000",
      "explicit": false,
      "spotifyId": "28fr344SdTAypw0CEi27BU",
      "appleId": 1000513283017,
      "youTubeId": "AHTz2bFge08",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28fr344SdTAypw0CEi27BU",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witness-publications-from-truth/id967813520?i=1000513283017",
        "youtube": "https://www.youtube.com/watch?v=AHTz2bFge08"
      }
    },
    {
      "id": "f68f7d4f-158e-41e2-8874-1504bbaf77ec",
      "title": "Jehovah’s Witnesses Join the Australian Royal Commission Redress Scheme",
      "description": "Watchtower, Bible \u0026 Tract Society required to appear before the Australian Commission to explain their policies and procedures for addressing cases of victims within their institution. At the end of the hearing, the Australian government determined that the best way to address this issue, was to set up a redress scheme. The redress scheme provides the individual with the ability to seek emotional counseling and to collect financial damages for their pain and suffering. Also, another key component is that the institutions are required to acknowledge their lack of responsibility to protect individuals by mishandling their cases. Despite having more than one thousand cases on record, the Watchtower agreed that they never reported any of these cases to the legal authorities. However, they stated that according to their policy it is the responsibility of the individual to report such incidents to the authorities. As a result, members in the community were at risk based on the Watchtower not taking a stand or exhibiting a key role to keep others safe. https://thenewdaily.com.au/news/2021/03/03/jehovahs-witnesses-redress-scheme/ Support the show",
      "release": "2021-03-08T11:00:00Z",
      "duration": "00:18:40.4170000",
      "explicit": false,
      "spotifyId": "0I0oYH2fvhqUHbUD3d1kR2",
      "appleId": 1000512074153,
      "youTubeId": "_x_upFSBYKA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0I0oYH2fvhqUHbUD3d1kR2",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-join-the-australian-royal/id967813520?i=1000512074153",
        "youtube": "https://www.youtube.com/watch?v=_x_upFSBYKA"
      }
    },
    {
      "id": "0f676b42-5789-48cd-b226-f82fccbe20d1",
      "title": "Jehovah’s Witnesses \u0026 Disfellowshipping – A Weapon for Control?",
      "description": "In this video, we discuss how the Watchtower responded to a question from readers back in 1958 about one of the anointed voluntarily accepting a blood transfusion and whether or not they would be able to partake of the emblems during the Memorial. However, it’s the response to the question that is eye opening for […] Support the show",
      "release": "2021-02-21T00:09:01Z",
      "duration": "00:16:08.2020000",
      "explicit": false,
      "spotifyId": "0X5bh55w4ib69MRlgUhDFy",
      "appleId": 1000509987307,
      "youTubeId": "ZM1ndmzyP3k",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0X5bh55w4ib69MRlgUhDFy",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-disfellowshipping-a-weapon-for/id967813520?i=1000509987307",
        "youtube": "https://www.youtube.com/watch?v=ZM1ndmzyP3k"
      }
    },
    {
      "id": "7cc7f7f4-cff1-4127-8deb-0f4bf0bc9400",
      "title": "Unbaptized Publisher Leaves Jehovah’s Witness Faith to Pursue his PhD",
      "description": "In this podcast, JT \u0026 Lady Cee interviews an Unbaptized Publisher that realized at an early age that being one of Jehovah’s Witnesses was not in his DNA. He speaks about having to tow the Watchtower line having a father that was an elder. But, how things took a turn for the better once his […] Support the show",
      "release": "2021-02-10T16:02:20Z",
      "duration": "00:52:16.4170000",
      "explicit": false,
      "spotifyId": "23lDFrinOWVS7L9QR9qNb7",
      "appleId": 1000508487221,
      "youTubeId": "x-i5Iqx6MP4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23lDFrinOWVS7L9QR9qNb7",
        "apple": "https://podcasts.apple.com/podcast/unbaptized-publisher-leaves-jehovahs-witness-faith/id967813520?i=1000508487221",
        "youtube": "https://www.youtube.com/watch?v=x-i5Iqx6MP4"
      }
    },
    {
      "id": "3b216bb2-a6d6-4ebb-b9b5-dd382d1e4952",
      "title": "Interview with Comedian Kenan J. Floyd – Ex-Jehovah’s Witness",
      "description": "In this podcast, JT \u0026 Lady Cee speak with Kenan J. Floyd about his experience as one of Jehovah’s Witnesses. Kenan Jerome Floyd is a writer/producer/comedian based in Los Angeles, CA. He hosts a podcast called “Dangerously Awkward”, where he talks about trying to make it in the entertainment industry while dealing with his hang […] Support the show",
      "release": "2021-01-21T22:10:15Z",
      "duration": "00:54:39.5160000",
      "explicit": false,
      "spotifyId": "3HC2mcM2m6ytDLVOSmYEEn",
      "appleId": 1000506113774,
      "youTubeId": "sE_j70JTKfM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3HC2mcM2m6ytDLVOSmYEEn",
        "apple": "https://podcasts.apple.com/podcast/interview-with-comedian-kenan-j-floyd-ex-jehovahs-witness/id967813520?i=1000506113774",
        "youtube": "https://www.youtube.com/watch?v=sE_j70JTKfM"
      }
    },
    {
      "id": "044e98b9-d8d6-4609-b904-e7502e82f50e",
      "title": "Discussion: Feedback from Viewers – Ten Hour Requirement – You Lied!",
      "description": "In this video presentation, we discuss feedback from one of our viewers from a previous video, Jehovah’s Witnesses, Riding the Waves on a Sinking Ship. It addresses the issue about counting time and the ten-hour quota. Most individuals may not realize that several decades ago, Jehovah’s Witnesses were required to turn in ten hours each […] Support the show",
      "release": "2021-01-10T04:19:04Z",
      "duration": "00:12:11.5060000",
      "explicit": false,
      "spotifyId": "4uNQTMpOf2HMitcvY8aNnk",
      "appleId": 1000504844087,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4uNQTMpOf2HMitcvY8aNnk",
        "apple": "https://podcasts.apple.com/podcast/discussion-feedback-from-viewers-ten-hour-requirement/id967813520?i=1000504844087"
      }
    },
    {
      "id": "8c041f9f-dc16-4fdb-ab61-0c71345b6b7f",
      "title": "Discussion: New Light, Burning Out of Control, or Flickering to Survive",
      "description": "New Light, Burning out of control, or flickering to survive? The Watchtower, Bible \u0026 Tract Society has used the “New Light” theory to explain all of their failed teachings. They use this ideology as a means to change their teachings. By doing so, they expect Jehovah’s Witnesses to sit back and accept their mistakes. Since […] Support the show",
      "release": "2021-01-03T13:30:30Z",
      "duration": "00:10:12.1790000",
      "explicit": false,
      "spotifyId": "57B2M1AA9SXM8NFHVPFv3r",
      "appleId": 1000504196597,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/57B2M1AA9SXM8NFHVPFv3r",
        "apple": "https://podcasts.apple.com/podcast/discussion-new-light-burning-out-of-control-or/id967813520?i=1000504196597"
      }
    },
    {
      "id": "e67b5c9a-1218-4d4e-833b-f3216d5b2db8",
      "title": "Discussion: Jehovah\u0027s Witnesses Riding the Waves on a Sinking Ship",
      "description": "Numbers don’t lie, but you can lie with numbers, and the Watchtower Bible \u0026 Tract Society has done their share of number crunching over the years. With their “do-more, do-more campaigns,” they kept Jehovah’s Witnesses busy. They heaped a lot of responsibility on their members, and they jumped through a lot of hoops to satisfy […] Support the show",
      "release": "2020-12-13T01:48:35Z",
      "duration": "00:14:07.6470000",
      "explicit": false,
      "spotifyId": "6roYrIZamV5PBXXgSGg47d",
      "appleId": 1000502201400,
      "youTubeId": "dcZ0ucsA80Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6roYrIZamV5PBXXgSGg47d",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-riding-the-waves-on/id967813520?i=1000502201400",
        "youtube": "https://www.youtube.com/watch?v=dcZ0ucsA80Y"
      }
    },
    {
      "id": "fd2f8318-5420-480f-8879-40574e017c3a",
      "title": "Watchtower Can Run…But, Can they Hide from Legal Liability?",
      "description": "In the early 2000’s, the Watchtower formed seven new corporations. This included removing the Governing Body from serving as corporate officers or directors in any of these new corporations. In fact, all Governing Body members are stepping aside from their positions and distancing themselves from all the Watchtower corporate entities such as President, Vice President, […] Support the show",
      "release": "2020-12-02T00:48:30Z",
      "duration": "00:12:20.6490000",
      "explicit": false,
      "spotifyId": "4D1fyPJlHXZJHOdXl7rXop",
      "appleId": 1000501036436,
      "youTubeId": "Nwd1dl5qNJM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4D1fyPJlHXZJHOdXl7rXop",
        "apple": "https://podcasts.apple.com/podcast/watchtower-can-run-but-can-they-hide-from-legal-liability/id967813520?i=1000501036436",
        "youtube": "https://www.youtube.com/watch?v=Nwd1dl5qNJM"
      }
    },
    {
      "id": "362046a8-6296-4396-9c31-6cce75d2952f",
      "title": "Jehovah’s Witness Letter Writing Campaign – Security Risk?",
      "description": "The global letter-writing campaign organized by the Watchtower, Bible \u0026 Tract Society, Inc., is risky. Because asking Jehovah\u0027s Witnesses to share personally identifiable information with strangers is quite dangerous. In the world of technology, a quick Google search can have an individual at your doorstep in no time. Therefore, Jehovah\u0027s Witnesses should be mindful of using their personal information when sending out letters or other Watchtower correspondence. The Watchtower gives explicit instructions to their members on how to disseminate information. They do not want the general public to insinuate that the material is coming directly from Watchtower headquarters. As a result, the individual Jehovah\u0027s Witness assumes all of the blame. Thus, putting their families in danger if individuals are not receptive to their message. All the while, the leadership sits behind a gated compound with full protection from all outsiders. Support the show",
      "release": "2020-11-24T01:00:00Z",
      "duration": "00:10:47.3400000",
      "explicit": false,
      "spotifyId": "0NJPeajzveDrOQjObi91Fe",
      "appleId": 1000500009417,
      "youTubeId": "2XlIeu_Z4hA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NJPeajzveDrOQjObi91Fe",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witness-letter-writing-campaign-security-risk/id967813520?i=1000500009417",
        "youtube": "https://www.youtube.com/watch?v=2XlIeu_Z4hA"
      }
    },
    {
      "id": "0b8a23d5-e739-4e30-acdc-8548262d61d5",
      "title": "The Top 3 Ways the Governing Body Misleads Jehovah’s Witnesses",
      "description": "In this video, we encourage you to meditate and think critically about what you have been convinced to believe as Jehovah’s Witnesses. When you think about it, did God really choose Anthony Morris, Stephen Lett and their colleagues as his earthly channel? Should they be responsible for making decisions on your behalf as to whether […] Support the show",
      "release": "2020-10-26T17:34:26Z",
      "duration": "00:15:55.9510000",
      "explicit": false,
      "spotifyId": "5wprxBVJTd4g3YKBiYRcuK",
      "appleId": 1000496133733,
      "youTubeId": "sL8KTQ07wdw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wprxBVJTd4g3YKBiYRcuK",
        "apple": "https://podcasts.apple.com/podcast/the-top-3-ways-the-governing-body-misleads/id967813520?i=1000496133733",
        "youtube": "https://www.youtube.com/watch?v=sL8KTQ07wdw"
      }
    },
    {
      "id": "82fe224e-6b8b-4580-b191-b933a49951a6",
      "title": "Viewer Feedback – 45 Years of Watchtower Obedience: Topic – Jesus is Not Your Mediator",
      "description": "References Support the show",
      "release": "2020-10-17T23:08:06Z",
      "duration": "00:13:00.5640000",
      "explicit": false,
      "spotifyId": "75SAxilcEKO0S6KwUVMeSl",
      "appleId": 1000495119859,
      "youTubeId": "GZ3KO9nIlUI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/75SAxilcEKO0S6KwUVMeSl",
        "apple": "https://podcasts.apple.com/podcast/viewer-feedback-45-years-of-watchtower-obedience/id967813520?i=1000495119859",
        "youtube": "https://www.youtube.com/watch?v=GZ3KO9nIlUI"
      }
    },
    {
      "id": "a02fa223-5185-442b-8439-4492aeef4977",
      "title": "The Awakening of a Jehovah’s Witness",
      "release": "2020-10-09T02:01:05Z",
      "duration": "00:03:12.2870000",
      "explicit": false,
      "spotifyId": "20AhlV7mUDJmDvIxmHTlID",
      "appleId": 1000494107017,
      "youTubeId": "J6fR4LQsML0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20AhlV7mUDJmDvIxmHTlID",
        "apple": "https://podcasts.apple.com/podcast/the-awakening-of-a-jehovahs-witness/id967813520?i=1000494107017",
        "youtube": "https://www.youtube.com/watch?v=J6fR4LQsML0"
      }
    },
    {
      "id": "4b25e9cc-4737-4ce0-aeef-8be391329ffa",
      "title": "Discussion: The Faithful \u0026 Discreet Frauds",
      "description": "This podcast takes a look at perhaps two of the most crucial teachings that we found during our journey out of the Jehovah’s Witness religion. It pertains to the validity of the faithful and discreet slave and the concept of new light. Support the show",
      "release": "2020-09-23T00:46:49Z",
      "duration": "00:27:35.6930000",
      "explicit": false,
      "spotifyId": "1DziQcsvA4RvbN9BkpsR10",
      "appleId": 1000492180590,
      "youTubeId": "E2JaBADzveY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DziQcsvA4RvbN9BkpsR10",
        "apple": "https://podcasts.apple.com/podcast/discussion-the-faithful-discreet-frauds/id967813520?i=1000492180590",
        "youtube": "https://www.youtube.com/watch?v=E2JaBADzveY"
      }
    },
    {
      "id": "b20a6a21-f394-4df2-8ef0-9ca082ab87c4",
      "title": "Discussion: Jehovah’s Witnesses and The Consequences of Membership",
      "description": "Support the show",
      "release": "2020-09-18T22:16:24Z",
      "duration": "00:21:47.6370000",
      "explicit": false,
      "spotifyId": "6RcFUZSxh4ZxmNNVm7pPA9",
      "appleId": 1000491746261,
      "youTubeId": "02tkgzAEDoc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RcFUZSxh4ZxmNNVm7pPA9",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-and-the/id967813520?i=1000491746261",
        "youtube": "https://www.youtube.com/watch?v=02tkgzAEDoc"
      }
    },
    {
      "id": "6408cf61-e7a9-4808-a1a9-f9342aadae8c",
      "title": "Jehovah’s Witness Leadership: Arrogant or Ignorant?",
      "description": "For 140 years, the Watchtower, Bible \u0026 Tract Society has been publishing tons of literature shedding life on world events based on their own interpretation of scripture. When things don’t turn out as they have predicted, they quickly holler “new light” and move on without thinking about the consequences of their actions and how their […] Support the show",
      "release": "2020-09-10T01:31:39Z",
      "duration": "00:16:31.0590000",
      "explicit": false,
      "spotifyId": "27PZPg1mA8ngPnP80prUNv",
      "appleId": 1000490736324,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/27PZPg1mA8ngPnP80prUNv",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witness-leadership-arrogant-or-ignorant/id967813520?i=1000490736324"
      }
    },
    {
      "id": "b7e83536-f745-4238-be99-bb7269db16fd",
      "title": "Discussion: JW.ORG – Freedom to vote?",
      "description": "Every Jehovah’s Witness does not have to ask if voting is an option because they have been trained about their role in paying homage to world governments and politics. Even children are discouraged from getting involved in student council elections during school. However, when you do your research on JW.org, most individuals will discover that […] Support the show",
      "release": "2020-08-31T22:58:51Z",
      "duration": "00:23:04.9600000",
      "explicit": false,
      "spotifyId": "7H5gvsiUnwP4jx0v9cUrLQ",
      "appleId": 1000489678919,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7H5gvsiUnwP4jx0v9cUrLQ",
        "apple": "https://podcasts.apple.com/podcast/discussion-jw-org-freedom-to-vote/id967813520?i=1000489678919"
      }
    },
    {
      "id": "f7d84904-5a1b-4eb4-9fc7-e147edf9c421",
      "title": "Discussion: Lawsuits, Lies \u0026 You!",
      "description": "In this podcast, JT and Daniel team up to explain the concept of Theocratic Warfare. It is a technique that Jehovah’s Witnesses use when dealing with world leaders and governments around the world. Jehovah’s Witnesses are indoctrinated to believe that they are in theocratic warfare against the world. That Watchtower encourages them to adopt strategies […] Support the show",
      "release": "2020-08-23T02:49:12Z",
      "duration": "00:12:03.8790000",
      "explicit": false,
      "spotifyId": "1FQrwDcNmyMI6WxkO73ARN",
      "appleId": 1000488890167,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1FQrwDcNmyMI6WxkO73ARN",
        "apple": "https://podcasts.apple.com/podcast/discussion-lawsuits-lies-you/id967813520?i=1000488890167"
      }
    },
    {
      "id": "4c4b973b-1eee-4cd0-b4bc-a9e907ffb097",
      "title": "Jehovah’s Witnesses \u0026 Convention Truths",
      "description": "If Jehovah’s Witnesses were allowed to have group discussions about how they really feel about conventions, what would they talk about? If they could express their true feelings about what they are not receiving or someone is able to bring up points of interest that make others think about the information they are receiving from […] Support the show",
      "release": "2020-08-08T03:13:40Z",
      "duration": "00:25:47.5200000",
      "explicit": false,
      "spotifyId": "1o6rRsu5y4hEzFuYHFDMdp",
      "appleId": 1000487489222,
      "youTubeId": "qu7wuRU1BAU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1o6rRsu5y4hEzFuYHFDMdp",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-convention-truths/id967813520?i=1000487489222",
        "youtube": "https://www.youtube.com/watch?v=qu7wuRU1BAU"
      }
    },
    {
      "id": "7b38e98d-1f31-49f6-a8fa-c5bb0e3dbd8d",
      "title": "Our Experience at Jehovah’s Witness Conventions",
      "description": "In this video, JT \u0026 Lady Cee discuss their past history attending Jehovah’s Witness conventions. They discuss their experience working in the chairmans office and how different it is from sitting with the general population at the convention. Lady Cee calls JT out on certain elder practices during the time they went to different congregations […] Support the show",
      "release": "2020-07-27T02:54:31Z",
      "duration": "00:42:38.6930000",
      "explicit": false,
      "spotifyId": "4aiwqPcLkwFtIDbyRQUTAt",
      "appleId": 1000486265545,
      "youTubeId": "QLwHqJVhZ7w",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4aiwqPcLkwFtIDbyRQUTAt",
        "apple": "https://podcasts.apple.com/podcast/our-experience-at-jehovahs-witness-conventions/id967813520?i=1000486265545",
        "youtube": "https://www.youtube.com/watch?v=QLwHqJVhZ7w"
      }
    },
    {
      "id": "28bdd316-44b2-4e21-baf9-eff4f27dac03",
      "title": "Interview with Linda \u002B 5 Tips to Keep Kids Safe from Predators",
      "release": "2020-06-24T22:30:02Z",
      "duration": "00:27:39.2450000",
      "explicit": false,
      "spotifyId": "5K3R9fJLpkp1uGombH5gdW",
      "appleId": 1000479491732,
      "youTubeId": "LWTse8KXLNI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5K3R9fJLpkp1uGombH5gdW",
        "apple": "https://podcasts.apple.com/podcast/interview-with-linda-5-tips-to-keep-kids-safe-from-predators/id967813520?i=1000479491732",
        "youtube": "https://www.youtube.com/watch?v=LWTse8KXLNI"
      }
    },
    {
      "id": "611f702e-024d-47e6-9b39-38aca0bc1998",
      "title": "Millennials Making Wise Choices",
      "description": "Thomas grew up as one of Jehovah’s Witnesses – walking the walk, talking the talk, and making all of his decisions based on the Watchtower script. He comes from a prominent Jehovah’s Witness family spanning three generations. Prior to his birth, his mom began charting her own course of independence choosing to enroll in college […] Support the show",
      "release": "2020-06-16T20:56:23Z",
      "duration": "00:45:09.1850000",
      "explicit": false,
      "spotifyId": "489N1Jl2VBRow8Ybit8Buj",
      "appleId": 1000478261145,
      "youTubeId": "UZdlsA8HIlc",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "The Living Word Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/489N1Jl2VBRow8Ybit8Buj",
        "apple": "https://podcasts.apple.com/podcast/millennials-making-wise-choices/id967813520?i=1000478261145",
        "youtube": "https://www.youtube.com/watch?v=UZdlsA8HIlc"
      }
    },
    {
      "id": "19f3cd84-a7bb-4172-a1d2-5ee1962e6efa",
      "title": "Jehovah’s Witnesses, Social Distancing \u0026 Zoom",
      "description": "Throughout the years, the Watchtower, Bible \u0026 Tract Society has never disappointed Jehovah’s Witnesses in applying pressure to perform in the door-to-door preaching. Do more is their admonition if you want to gain everlasting life. Do more, without letup, making known God’s name and preaching the good news of the kingdom under any type […] Support the show",
      "release": "2020-05-28T01:57:13Z",
      "duration": "00:14:34.6570000",
      "explicit": false,
      "spotifyId": "6Igi7EeVye4o0oeACGa4G7",
      "appleId": 1000476016606,
      "youTubeId": "__RAqFEgXLc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Igi7EeVye4o0oeACGa4G7",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-social-distancing-zoom/id967813520?i=1000476016606",
        "youtube": "https://www.youtube.com/watch?v=__RAqFEgXLc"
      }
    },
    {
      "id": "6f7362e7-4414-41f5-b9b0-a0e92b3a857b",
      "title": "I Faded, Waiting on Jehovah!",
      "description": "In this podcast, Linda discusses her awakening to the realization that she spent her entire life waiting on false expectations as promised by the Watchtower, Bible \u0026 Tract Society. She explains how she knew that something was wrong for many years. However, when bad things were taking place at her congregation, the local Kingdom Hall […] Support the show",
      "release": "2020-05-22T19:48:51Z",
      "duration": "00:45:58.4520000",
      "explicit": false,
      "spotifyId": "6W8BD6JnUnCBRO3SeP7Fuw",
      "appleId": 1000475452145,
      "youTubeId": "aLgqsmG9vUM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6W8BD6JnUnCBRO3SeP7Fuw",
        "apple": "https://podcasts.apple.com/podcast/i-faded-waiting-on-jehovah/id967813520?i=1000475452145",
        "youtube": "https://www.youtube.com/watch?v=aLgqsmG9vUM"
      }
    },
    {
      "id": "60a8a700-7b80-4686-9383-b4876bb77d9f",
      "title": "Should I go back to the Kingdom Hall?",
      "description": "If you are a former Jehovah’s Witness trying to make sense of what is happening in the world, you may have that nagging question in the back of your mind, “Should I go back to the Kingdom Hall?” Namely, because you were taught that this is the only place you can gain salvation. The Watchtower […] Support the show",
      "release": "2020-05-19T02:44:42Z",
      "duration": "00:11:55.2580000",
      "explicit": false,
      "spotifyId": "5GWNqkwH6GJfxXfksoQBZS",
      "appleId": 1000475042516,
      "youTubeId": "cHZ9_RNVWc0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GWNqkwH6GJfxXfksoQBZS",
        "apple": "https://podcasts.apple.com/podcast/should-i-go-back-to-the-kingdom-hall/id967813520?i=1000475042516",
        "youtube": "https://www.youtube.com/watch?v=cHZ9_RNVWc0"
      }
    },
    {
      "id": "9356f794-499d-4711-a068-718e0879ef8d",
      "title": "Everything You Need to Know about Jehovah’s Witnesses \u0026 Relationships",
      "description": "Stephen’s Story: In this podcast, Stephen provides an insiders view on what it’s like being married to a Jehovah’s Witness. He not only became well versed in the religion, but can provide an in-depth review on what you can expect. While every relationship may not be the same, there are a lot of similarities […] Support the show",
      "release": "2020-05-08T22:41:23Z",
      "duration": "01:15:58.7850000",
      "explicit": false,
      "spotifyId": "2XxA96LadecWtgiikXDFXP",
      "appleId": 1000474029761,
      "youTubeId": "DijsSSzq_hs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2XxA96LadecWtgiikXDFXP",
        "apple": "https://podcasts.apple.com/podcast/everything-you-need-to-know-about-jehovahs-witnesses/id967813520?i=1000474029761",
        "youtube": "https://www.youtube.com/watch?v=DijsSSzq_hs"
      }
    },
    {
      "id": "e3b30701-a28f-4c94-aff7-db719fe0a248",
      "title": "Life at Bethel – Where did that Article Come From?",
      "description": "As we continue in our series of Life at Bethel with JT, in this video, he discusses why certain Watchtower and Awake articles were written into the Jehovah’s Witness narratives. 1) Debased Music 2) Practical Jokes 3) The Snake Did Not Talk to Eve in the Garden Support the show",
      "release": "2020-04-26T22:25:14Z",
      "duration": "00:16:44.5120000",
      "explicit": false,
      "spotifyId": "4fAvORHV7AcTdSIYlzhKqW",
      "appleId": 1000472735372,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fAvORHV7AcTdSIYlzhKqW",
        "apple": "https://podcasts.apple.com/podcast/life-at-bethel-where-did-that-article-come-from/id967813520?i=1000472735372"
      }
    },
    {
      "id": "dc3cfba4-dccd-4ddb-8761-4c328b91836c",
      "title": "Millennials Speak Truth: Why Are so Many Leaving the Jehovah’s Witness Faith?",
      "description": "If you’ve ever left the Watchtower organization and thought you were all alone. You’ll discover these three guys story one of triumph. Not only did they reunite and rekindle their friendships, but they have a lot of good advice to share that can help anyone leaving, to pick up the pieces and have a different […] Support the show",
      "release": "2020-04-14T01:59:44Z",
      "duration": "01:18:20.9430000",
      "explicit": false,
      "spotifyId": "7e7EdaUNdAoWqlaczHO0HK",
      "appleId": 1000471402322,
      "youTubeId": "0Oau7mN-wpg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7e7EdaUNdAoWqlaczHO0HK",
        "apple": "https://podcasts.apple.com/podcast/millennials-speak-truth-why-are-so-many-leaving-the/id967813520?i=1000471402322",
        "youtube": "https://www.youtube.com/watch?v=0Oau7mN-wpg"
      }
    },
    {
      "id": "96e0ee13-5a3e-476e-b79b-7ce60a66df1b",
      "title": "Discussion: Jehovah’s Witnesses - Why My Family Won’t Leave?",
      "description": "In this podcast, the comparison is made to how difficult it may be for an elderly couple to move out of a bad neighborhood much like a Jehovah’s Witness that invests many years in the Watchtower organization. They, too, may experience similar issues. A lot of Jehovah’s Witnesses realize that there is something wrong with […] Support the show",
      "release": "2020-03-17T15:15:07Z",
      "duration": "00:04:19.1340000",
      "explicit": false,
      "spotifyId": "0nv0OsyZQNrm2jRlRJjeMf",
      "appleId": 1000468680203,
      "youTubeId": "66PyRsVzIcQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nv0OsyZQNrm2jRlRJjeMf",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-why-my-family-wont-leave/id967813520?i=1000468680203",
        "youtube": "https://www.youtube.com/watch?v=66PyRsVzIcQ"
      }
    },
    {
      "id": "5f843b01-77e9-41aa-875b-defa73da0f63",
      "title": "Jehovah’s Witnesses: Corona Virus, Sign of the Times?",
      "description": "The Corona Virus is in its infancy and at this point, no one knows its boundaries or how high the death toll will rise. However, we do know that it is a major global health concern. Like with prior diseases, a vaccine is sure to come by means of medical science. Unfortunately, certain groups use […] Support the show",
      "release": "2020-03-17T12:40:21Z",
      "duration": "00:06:56.5220000",
      "explicit": false,
      "spotifyId": "7CEvadzDr5Sx6HfZCycDLN",
      "appleId": 1000468668258,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7CEvadzDr5Sx6HfZCycDLN",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-corona-virus-sign-of-the-times/id967813520?i=1000468668258"
      }
    },
    {
      "id": "c8897e81-ef7c-4b96-b6eb-fcc87c9b4a8a",
      "title": "Jehovah’s Witnesses, Dating, Marriage \u0026 Unbelievers",
      "description": "We receive a lot of correspondence asking us for assistance on how to handle situations where someone’s loved one is dating a Jehovah’s Witness, an individual is married to a JW and wants to return to the religion, the scenarios are endless. This podcast is one of many where we will be talking about Jehovah’s […] Support the show",
      "release": "2020-02-23T23:12:44Z",
      "duration": "00:10:49.0640000",
      "explicit": false,
      "spotifyId": "2sOtYT5zpwlhnJNOKlINFR",
      "appleId": 1000466460219,
      "youTubeId": "DijsSSzq_hs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2sOtYT5zpwlhnJNOKlINFR",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-dating-marriage-unbelievers/id967813520?i=1000466460219",
        "youtube": "https://www.youtube.com/watch?v=DijsSSzq_hs"
      }
    },
    {
      "id": "7a92d301-17b4-41ac-beb9-e9e8a478b3b9",
      "title": "Feedback From Viewers – Jehovah’s Witnesses and the Free Home Bible Study. How much did it really cost?",
      "description": "We have been reading your comments and we appreciate your thoughts. This is the first segment of many where we will begin sharing your collective feedback about the topics we share online. Everyone comes from a variety of backgrounds, countries, ethnicities, etc. but we all share one common denominator and that is, we all received […] Support the show",
      "release": "2020-02-16T03:31:18Z",
      "duration": "00:09:30.5920000",
      "explicit": false,
      "spotifyId": "7M6QfjE8T4PZo9gfOiQOIc",
      "appleId": 1000465715856,
      "youTubeId": "b75-hgubNY0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7M6QfjE8T4PZo9gfOiQOIc",
        "apple": "https://podcasts.apple.com/podcast/feedback-from-viewers-jehovahs-witnesses-and-the/id967813520?i=1000465715856",
        "youtube": "https://www.youtube.com/watch?v=b75-hgubNY0"
      }
    },
    {
      "id": "c0dcbe74-4ab9-4bb2-9085-a13319da7a21",
      "title": "Discussion: Jehovah’s Witnesses and Loaded Language",
      "description": "If you are not one of Jehovah’s Witnesses, you may not realize that if you don’t know the right type of questions to ask when seeking knowledge, they may trick you into believing something far different from what they actually believe. In this video, JT, Lady Cee and Daniel, break it down, helping you to […] Support the show",
      "release": "2020-02-11T01:04:26Z",
      "duration": "00:26:14.7650000",
      "explicit": false,
      "spotifyId": "3MGjIvnJmxtoiv41wnkNrN",
      "appleId": 1000465220999,
      "youTubeId": "4wS-2gv4SHQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3MGjIvnJmxtoiv41wnkNrN",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-and-loaded-language/id967813520?i=1000465220999",
        "youtube": "https://www.youtube.com/watch?v=4wS-2gv4SHQ"
      }
    },
    {
      "id": "48a59e34-cc23-43dd-9811-fb545957da29",
      "title": "Discussion: Oxygen Documentary: The Witnesses",
      "description": "Support the show",
      "release": "2020-02-10T04:02:02Z",
      "duration": "00:15:45.1880000",
      "explicit": false,
      "spotifyId": "6ORXGWe8AqP6MNbiRjsCUb",
      "appleId": 1000465118336,
      "youTubeId": "mYjqMM8s4Dg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ORXGWe8AqP6MNbiRjsCUb",
        "apple": "https://podcasts.apple.com/podcast/discussion-oxygen-documentary-the-witnesses/id967813520?i=1000465118336",
        "youtube": "https://www.youtube.com/watch?v=mYjqMM8s4Dg"
      }
    },
    {
      "id": "e946ccbc-0baf-41d1-a621-bff8ef792557",
      "title": "Jehovah\u0027s Witnesses: Life at Bethel – Privacy Rights",
      "description": "JT shares experiences about his life at Bethel and how the Watchtower\u0027s legal department opened their mail. Mainly, they looked for certain type of mail that bethelites received from the county pertaining to jury duty. As a faithful member of the organization, I never stopped to think that they were actually violating my rights as a citizen. In fact, in certain countries and the United States where I reside, it is illegal to open another person\u0027s mail. It\u0027s amazing how we placed a lot of trust in the organization, not realizing that many times they violate our rights. Support the show",
      "release": "2020-01-25T23:00:00Z",
      "duration": "00:09:00.2120000",
      "explicit": false,
      "spotifyId": "4sR918m7QDT8rrA7o8J11Z",
      "appleId": 1000463669553,
      "youTubeId": "0UvMevY3ZmA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4sR918m7QDT8rrA7o8J11Z",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-life-at-bethel-privacy-rights/id967813520?i=1000463669553",
        "youtube": "https://www.youtube.com/watch?v=0UvMevY3ZmA"
      }
    },
    {
      "id": "9d26fb5a-d87b-447e-a72a-8f176cef7c29",
      "title": "Jehovah’s Witnesses: How I Woke Up…I listened to my inner voice",
      "description": "It doesn’t take a Rocket Scientist to tell you that trusting your gut instinct is what keeps many people alive with the ability to steer free from harm. Despite what people tell you, there is nothing like listening to your inner voice. You know, the voice that tells you that something doesn’t feel right or […] Support the show",
      "release": "2020-01-22T18:35:58Z",
      "duration": "00:26:56.7700000",
      "explicit": false,
      "spotifyId": "70rz2QdCKxxWcHAjUie5m3",
      "appleId": 1000463399101,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/70rz2QdCKxxWcHAjUie5m3",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-how-i-woke-up-i-listened-to-my-inner-voice/id967813520?i=1000463399101"
      }
    },
    {
      "id": "8d884188-1cd3-4c5c-b63a-1308e755a8c2",
      "title": "After Leaving Jehovah’s Witnesses: Continue in your Healing Process",
      "description": "★ VISIT OUR WEBSITE http://www.exjwcriticalthinker.com ★SUBSCRIBE TO OUR YOUTUBE CHANNEL http://bit.ly/2p9RTSC ★ TWEET US! #ExJWsThink https://twitter.com/ExJWsThink ★ VISIT OUR BLOG https://exjehovahswitnessct.wordpress.com ★ FOLLOW US ON INSTAGRAM https://www.instagram.com/exjwcriticalthinker/ ★LIKE US ON FACEBOOK https://www.facebook.com/Ex-Jehovahs-Witnesses-Critical-Thinkers-529293183758131/ ✰✰ EMAIL: exjwct@gmail.com Support the show",
      "release": "2020-01-01T05:32:11Z",
      "duration": "00:14:20.1860000",
      "explicit": false,
      "spotifyId": "6TEHnUrIUbBpzvhfoSa4E4",
      "appleId": 1000461286495,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6TEHnUrIUbBpzvhfoSa4E4",
        "apple": "https://podcasts.apple.com/podcast/after-leaving-jehovahs-witnesses-continue-in-your-healing/id967813520?i=1000461286495"
      }
    },
    {
      "id": "8361dc45-7a32-41b6-b31b-b71b4a937537",
      "title": "Jehovah’s Witnesses: Risking Life for God or Watchtower?",
      "description": "Sadly, for the past 140 years, Jehovah’s Witnesses have been walking the earth preaching that the end of the world is near. In fact, throughout the lifespan of past presidents of the Watchtower, Bible \u0026 Tract Society, they have published countless books, magazines, and leaflets and instilling in the minds of their members that this […] Support the show",
      "release": "2019-11-09T01:29:03Z",
      "duration": "00:21:55.8130000",
      "explicit": false,
      "spotifyId": "1ZqVYGEFdoo1DYzW1M69mU",
      "appleId": 1000456298345,
      "youTubeId": "RqWS1gFPgyI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ZqVYGEFdoo1DYzW1M69mU",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-risking-life-for-god-or-watchtower/id967813520?i=1000456298345",
        "youtube": "https://www.youtube.com/watch?v=RqWS1gFPgyI"
      }
    },
    {
      "id": "a72c4125-30ed-4ade-84ce-150b947e86a0",
      "title": "Jehovah’s Witnesses: Couples School",
      "description": "Did you know that the Watchtower, Bible \u0026 Tract Society holds special schools for couples? In this video, we warmly welcome Paul to share his story about what it was like to attend the Watchtower Couples School. Paul is a former elder and Bethelite and has served at several Watchtower branches. Support the show",
      "release": "2019-11-03T16:00:00Z",
      "duration": "00:45:57.7730000",
      "explicit": false,
      "spotifyId": "0DyvwTzkFuaXa2mNx6Bf9q",
      "appleId": 1000455820470,
      "youTubeId": "7B0II4PdRNI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0DyvwTzkFuaXa2mNx6Bf9q",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-couples-school/id967813520?i=1000455820470",
        "youtube": "https://www.youtube.com/watch?v=7B0II4PdRNI"
      }
    },
    {
      "id": "11b68c16-773c-496b-aca5-f70a39af2e85",
      "title": "Bethelites – Cream of the Crop?",
      "description": "In this podcast, JT \u0026 Paul reminisce about what it was like being at Bethel and their Jehovah’s Witness wakeup call about Bethel not being anything special. In fact, being at Bethel allowed them to a lot of things about the organization that the average Jehovah’s Witness will never see. During their Bethel entrance school, […] Support the show",
      "release": "2019-10-26T13:17:31Z",
      "duration": "00:23:36.1760000",
      "explicit": false,
      "spotifyId": "7dcSVFOVZiVjoJul43PE91",
      "appleId": 1000455020392,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7dcSVFOVZiVjoJul43PE91",
        "apple": "https://podcasts.apple.com/podcast/bethelites-cream-of-the-crop/id967813520?i=1000455020392"
      }
    },
    {
      "id": "8c94c281-31df-44da-805a-eb9637828839",
      "title": "Jehovah’s Witnesses: Regular Pioneering and Pioneer School",
      "description": "Did you know that Jehovah’s Witnesses have an exclusive group within their membership known as regular pioneers? This man-made title is not found in the scriptures, yet they are elevated within the group as being more spiritually minded than those members that choose not to serve in this capacity. In this podcast, JT, Lady Cee […] Support the show",
      "release": "2019-10-24T02:13:54Z",
      "duration": "00:41:37.8020000",
      "explicit": false,
      "spotifyId": "5RzXJ4IxXeTiNLF6EHmY5I",
      "appleId": 1000454696897,
      "youTubeId": "CaQqw41Eypw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5RzXJ4IxXeTiNLF6EHmY5I",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-regular-pioneering-and-pioneer-school/id967813520?i=1000454696897",
        "youtube": "https://www.youtube.com/watch?v=CaQqw41Eypw"
      }
    },
    {
      "id": "bdf3f21f-f0d1-4719-ab0d-55f0369836d1",
      "title": "Life at Bethel – Family Night – Episode 7",
      "description": "Family Night When I was at Bethel, each year the Bethel Family featured a program called “Family Night”. Family Night was a variety entertainment show where the Bethelites had the opportunity to showcase their talent. It ranged anywhere from interviews with individuals discussing their Bethel career, regular pioneer service and those in the traveling work […] Support the show",
      "release": "2019-10-14T23:11:18Z",
      "duration": "00:11:43.6080000",
      "explicit": false,
      "spotifyId": "1XreCS0gXQP0KVDoOeeQR0",
      "appleId": 1000453528551,
      "youTubeId": "fgKZj4-7Tgk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1XreCS0gXQP0KVDoOeeQR0",
        "apple": "https://podcasts.apple.com/podcast/life-at-bethel-family-night-episode-7/id967813520?i=1000453528551",
        "youtube": "https://www.youtube.com/watch?v=fgKZj4-7Tgk"
      }
    },
    {
      "id": "b4923d9d-8513-41bf-a53a-f4730caae4c6",
      "title": "The Origin of the Super Friends",
      "description": "This video helps you to appreciate that time flies by fast when you’re having fun. Help us celebrate two years of friendship with Daniel. Also, take a look at a few unpublished clips we thought you’d find enjoyable. Yes, Critical Thinkers have fun too!!! ★ VISIT OUR WEBSITE http://www.exjwcriticalthinker.com ★SUBSCRIBE TO OUR YOUTUBE CHANNEL http://bit.ly/2p9RTSC […] Support the show",
      "release": "2019-10-04T22:47:34Z",
      "duration": "00:10:24.5610000",
      "explicit": false,
      "spotifyId": "6muwrEmYZ5Rbl2DxPckxbs",
      "appleId": 1000452358420,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6muwrEmYZ5Rbl2DxPckxbs",
        "apple": "https://podcasts.apple.com/podcast/the-origin-of-the-super-friends/id967813520?i=1000452358420"
      }
    },
    {
      "id": "e99a6fef-beea-4b69-9e34-9826bd034f03",
      "title": "Interview: Jonathan’s Story: Married to a Jehovah’s Witness",
      "description": "This is the personal experience of Jonathan, an unbeliever that meets the love of his life…that turns out to be one of Jehovah’s Witnesses. He talks about how he balances his family life and helps his children to use critical thinking when it comes to making decisions about competitive sports and getting an education to […] Support the show",
      "release": "2019-09-14T03:30:04Z",
      "duration": "00:54:11.8530000",
      "explicit": false,
      "spotifyId": "3XGiHYbUHtMCdSKLK2HlqR",
      "appleId": 1000449722843,
      "youTubeId": "1GfbOZ8jzDQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XGiHYbUHtMCdSKLK2HlqR",
        "apple": "https://podcasts.apple.com/podcast/interview-jonathans-story-married-to-a-jehovahs-witness/id967813520?i=1000449722843",
        "youtube": "https://www.youtube.com/watch?v=1GfbOZ8jzDQ"
      }
    },
    {
      "id": "096b7b35-5274-44ad-b152-a2f580a6aeed",
      "title": "Jehovah’s Witnesses – Misleading the Courts",
      "description": "In this podcast, JT \u0026 Paul (two former elders \u0026 Bethelites) unite in their discussion about the Jehovah’s Witness leadership, the Governing Body and how they will do anything to maintain their reputation. They bend the law every which way they can even using semantics (word games) and evading questions by making false statements to […] Support the show",
      "release": "2019-09-09T01:32:44Z",
      "duration": "00:20:00.2740000",
      "explicit": false,
      "spotifyId": "3E9OZuk2PS9FrOUMWeeHq2",
      "appleId": 1000449055391,
      "youTubeId": "sL8KTQ07wdw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3E9OZuk2PS9FrOUMWeeHq2",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-misleading-the-courts/id967813520?i=1000449055391",
        "youtube": "https://www.youtube.com/watch?v=sL8KTQ07wdw"
      }
    },
    {
      "id": "e82a1735-0114-46dc-b614-e7118268a2fa",
      "title": "Shocking Stories! As told by a Former Bethelite Elder",
      "description": "In this podcast, Paul, a former elder \u0026 Bethelite from Toronto, Canada shares his experiences about what it was like serving at three Watchtower branches (Toronto, Haiti \u0026 the Dominican Republic). He recounts several heartbreaking stories geared to help you to use critical thinking after making simple comparisons about the love and concern Jesus Christ […] Support the show",
      "release": "2019-09-04T23:24:47Z",
      "duration": "01:16:24.6460000",
      "explicit": false,
      "spotifyId": "324YWxsEXdYeDoLdgaYiIW",
      "appleId": 1000448621609,
      "youTubeId": "U3OnvsOmbXY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/324YWxsEXdYeDoLdgaYiIW",
        "apple": "https://podcasts.apple.com/podcast/shocking-stories-as-told-by-a-former-bethelite-elder/id967813520?i=1000448621609",
        "youtube": "https://www.youtube.com/watch?v=U3OnvsOmbXY"
      }
    },
    {
      "id": "febd778f-203f-4fdb-90e5-777e977c403f",
      "title": "Jehovah’s Witness Lawsuits – You Can Run, But You Can’t Hide",
      "description": "In this podcast, JT discusses the Jehovah’s Witnesses and the latest lawsuits – yes, their day of reckoning has come – the lawsuits are flooding in. They can create all the corporations they want, but the Governing body will be held accountable for their actions and the law cometh for them. They are no better […] Support the show",
      "release": "2019-08-31T02:29:35Z",
      "duration": "00:23:06.4220000",
      "explicit": false,
      "spotifyId": "3k5OsaTxd5eZ9r0J2vmWrS",
      "appleId": 1000448224107,
      "youTubeId": "U7yMau5uc2c",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3k5OsaTxd5eZ9r0J2vmWrS",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witness-lawsuits-you-can-run-but-you-cant-hide/id967813520?i=1000448224107",
        "youtube": "https://www.youtube.com/watch?v=U7yMau5uc2c"
      }
    },
    {
      "id": "33792da9-c5c3-4c65-a22d-9e1f6ccc140f",
      "title": "Jehovah\u0027s Witnesses and The Two Witness Rule – Lynn’s Story",
      "description": "In this episode, Lynn Ragusa shares her personal experience about how she was affected by the two witness rule. International Rape Crisis Hotlines - http://www.ibiblio.org/rcip/internl.html Barbara Anderson - Watchtower Documents, discusses the Two Witness Rule https://youtu.be/Q9dCHqEMObo Former Jehovah’s Witnesses recount years of sex abuse ahead of landmark case (article from NY Post – August 12, 2019)) https://nypost.com/2019/08/12/former-jehovahs-witnesses-recount-years-of-sex-abuse-ahead-of-landmark-case/ The child victim’s act (article from NY Post – February 14, 2019) https://nypost.com/2019/02/14/cuomo-signs-law-allowing-child-sex-abuse-victims-to-sue-as-adults/ Mark Albert, Chief National Investigative Correspondent Silent No More: The Survivors (video – part one) https://www.kcra.com/article/silent-no-more-part-1-the-survivors/28659357 Silent No More: The Survivors (video – part two) TV: https://www.kcra.com/article/silent-no-more-part-2-the-verdicts/28660625 Legal floodgates to open Wednesday as child sexual abuse victims, many after decades, get long-awaited day in court (article from the NY Daily News dated August 11, 2019) http://www.nydailynews.com/new-york/ny-child-victims-act-lawsuits-20190811-gvqqq4wfqzdyhbkowenk6gao7q-story.html Zalkin\u0027s press conference (Facebook video) https://www.facebook.com/FOX5Vegas/videos/2401724586765655/ Support the show",
      "release": "2019-08-18T20:00:00Z",
      "duration": "00:17:56.6360000",
      "explicit": false,
      "spotifyId": "7095xlky9LrbhxmdREJkZr",
      "appleId": 1000447185958,
      "youTubeId": "vDULV7pp3Cg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7095xlky9LrbhxmdREJkZr",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-and-the-two-witness-rule-lynns-story/id967813520?i=1000447185958",
        "youtube": "https://www.youtube.com/watch?v=vDULV7pp3Cg"
      }
    },
    {
      "id": "f96d072d-a919-4491-a6ec-6ffdf1a9e438",
      "title": "Jehovah’s Witnesses: Vow of Poverty (Former Bethelite Tells His Story)",
      "description": "Former Jehovah\u0027s Witness elder/bethelite is discussing his own personal experience about what he knows about the practices and policies of the Watchtower, Bible \u0026 Tract Society. This video discusses the vow of poverty and how it affects those in full-time service and the impact it has for many individuals that live in areas and what happens when they do not pay into social security. Is there anything wrong with taking a vow of poverty? No! However, the Watchtower, Bible \u0026 Tract Society is guilty of hypocrisy for condemning other religious denominations for instituting such an arrangement. Why? Because when they discovered they could take certain tax breaks for doing the same thing, they decided to set up their own vow of poverty system - Worldwide Order of Special Full-Time Servants of Jehovah\u0027s Witnesses Unfortunately, such vows did not benefit the Bethelites and other individuals in full-time service. In fact, when it was convenient, the Watchtower dismissed thousands of Bethelites from their assignments. Many of them were released after serving upwards of 30\u0026#43; years at Bethel. One couple was so excited about being accepted to Bethel and after selling their home, donated the money from the sale of their home to the Watchtower Society. Sadly, they were part of the massive layoff of 1,000\u0026#43; Bethelites. References October 1, 1973 Watchtower Support the show",
      "release": "2019-08-04T18:00:00Z",
      "duration": "00:24:38.3470000",
      "explicit": false,
      "spotifyId": "7fVx6AR5pcXGFNXZSMUcdF",
      "appleId": 1000446117282,
      "youTubeId": "rqYUCV4FHI4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7fVx6AR5pcXGFNXZSMUcdF",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-vow-of-poverty-former-bethelite/id967813520?i=1000446117282",
        "youtube": "https://www.youtube.com/watch?v=rqYUCV4FHI4"
      }
    },
    {
      "id": "eb7ed671-67d7-4509-9bf6-f5f8012cdd37",
      "title": "Jehovah’s Witnesses: Stop Begging for my Assets!",
      "description": "Former Jehovah\u0027s Witness elder/bethelite is discussing his own personal experience about what he knows about the practices and policies of the Watchtower, Bible \u0026 Tract Society. It\u0027s all about the money. The Watchtower, Bible \u0026 Tract Society is at it again. This time they are interested in your travel reward points. While there is nothing wrong with donating your points, the Watchtower Society is being hypocritical because they have long condemned other organizations for doing the same thing. First, they were coming at the children trying to get them to give up their ice cream money and now they are begging for your travel reward points. In this podcast, JT \u0026 Lady Cee presents a skit on what could happen in many Jehovah\u0027s Witness households once the idea of donating travel rewards becomes popular within the community. JW Video: https://tv.jw.org/#en/mediaitems/LatestVideos/pub-mwbv_201907_4_VIDEO Support the show",
      "release": "2019-07-08T15:00:00Z",
      "duration": "00:10:17.3250000",
      "explicit": false,
      "spotifyId": "0n2Plz2DAoPXHD7JxyK3BW",
      "appleId": 1000443950307,
      "youTubeId": "3UjYK3eneWE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0n2Plz2DAoPXHD7JxyK3BW",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-stop-begging-for-my-assets/id967813520?i=1000443950307",
        "youtube": "https://www.youtube.com/watch?v=3UjYK3eneWE"
      }
    },
    {
      "id": "4a21ce98-88a6-4a20-a167-6cf08bf450ff",
      "title": "Jehovah’s Witnesses: Three Signs that Exhibit they are Collective Narcissists",
      "description": "Former Jehovah\u0027s Witness elder/bethelite is discussing his own personal experience about what he knows about the practices and policies of the Watchtower, Bible \u0026 Tract Society. In this video, JT \u0026 Lady Cee join their voices with Arc Ripley of Arglue to Collaborate on the topic of Jehovah\u0027s Witnesses and Collective Narcissism. We discuss the top three things that identify the Jehovah\u0027s Witnesses as collective narcissists: 1) Persecution Complex 2) Belief that they are the only true religion 3) They believe they are the center of attention Arc is a fellow YouTuber from a different community that focuses a lot of videos on the topic of Narcissism. He is not affiliated with Jehovah\u0027s Witnesses thus offers an outsiders perspective on the traits of Narcissistic traits. Narcissism is the pursuit of gratification from vanity or egotistic admiration of one\u0027s idealised self image and attributes. The term originated from Greek mythology, where the young Narcissus fell in love with his own image reflected in a pool of water. Collective narcissism (or group narcissism) extends the concept of individual narcissism onto the social level of self. It is a tendency to exaggerate the positive image and importance of a group the individual belongs to – i.e. the ingroup. Support the show",
      "release": "2019-06-25T02:00:00Z",
      "duration": "00:28:43.8200000",
      "explicit": false,
      "spotifyId": "4zpkuj5WJafDmRIscZW1OK",
      "appleId": 1000442636442,
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4zpkuj5WJafDmRIscZW1OK",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-three-signs-that-exhibit-they-are/id967813520?i=1000442636442"
      }
    },
    {
      "id": "0f0a5fc6-273e-4df3-be0f-7d456581cea8",
      "title": "JT Life at Bethel Part 5 - G-Jobbing at Bethel",
      "description": "Former Jehovah\u0027s Witness elder/bethelite is discussing his own personal experience about what he knows about the practices and policies of the Watchtower, Bible \u0026 Tract Society. In the fifth installment of life at Bethel with JT, he talks about G-Jobbing and how everyone at Bethel was not broke. A lot of the brothers that work in the trades had the opportunity to make money on the side by doing construction jobs at Kingdom Hall\u0027s and the homes of the local friends in the congregation (roofing, laying tile, dry wall, installing carpet, etc.). Others had the opportunity to work as wedding photographers and waiter\u0027s at weddings. And for those individuals that had a skill in cutting hair, they were able to earn a few extra bucks working as a barber to those brothers needing a haircut much sooner than the three weeks allowed at Bethel. For those brothers that had a skill in computer programming, they took their talent to Wall Street and held jobs over there after hours. The opportunities were endless. Of course, all good things must come to an end! And so it did when the issue of tax reporting became a serious issue when Bethelites started receiving 1099\u0027s and were reportedly not filing the extra cash earned on their taxes. Yikes! Support the show",
      "release": "2019-06-21T23:00:00Z",
      "duration": "00:16:34.5600000",
      "explicit": false,
      "spotifyId": "0tB8d9tpS2Kpdt6YBNsyXU",
      "appleId": 1000551386249,
      "youTubeId": "LWTse8KXLNI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0tB8d9tpS2Kpdt6YBNsyXU",
        "apple": "https://podcasts.apple.com/podcast/jt-life-at-bethel-part-5-g-jobbing-at-bethel/id967813520?i=1000551386249",
        "youtube": "https://www.youtube.com/watch?v=LWTse8KXLNI"
      }
    },
    {
      "id": "02b06d5d-5fd2-47b3-8fcb-bafc87efd38a",
      "title": "JT and Public Talks – Life at Bethel Part 4 (Jehovah’s Witnesses)",
      "description": "This video is a continuation of JT’s life at Bethel. He discusses Public Talks and his role as the speaker coordinator in his congregation. The presiding overseer in his congregation specifically asked him not to coordinate speakers from other Kingdom Hall’s using what he termed a whole sale bargain where if they had 11 speakers, […] Support the show",
      "release": "2019-06-12T01:44:49Z",
      "duration": "00:23:37.8220000",
      "explicit": false,
      "spotifyId": "20CqT3r0Fhq5xPWDBca26O",
      "appleId": 1000441216606,
      "youTubeId": "0Dz-X-hTH-Q",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20CqT3r0Fhq5xPWDBca26O",
        "apple": "https://podcasts.apple.com/podcast/jt-and-public-talks-life-at-bethel-part-4-jehovahs-witnesses/id967813520?i=1000441216606",
        "youtube": "https://www.youtube.com/watch?v=0Dz-X-hTH-Q"
      }
    },
    {
      "id": "404ee5c0-01d6-4d7e-93fc-368226cc8b09",
      "title": "JT and the Congregation – Life at Bethel",
      "description": "This podcast goes into more details about my Bethel experience by discussing what it was like meeting the friends in my congregation. I discuss: Congregation assignments Meeting the friends Surviving Bethel and receiving assistance from the older friends Learning and understanding the culture at Bethel for compensating those providing transportation Determining whether to bring car […] Support the show",
      "release": "2019-06-12T01:40:54Z",
      "duration": "00:17:56.9760000",
      "explicit": false,
      "spotifyId": "5twxWFZb1yD799rme55Jqf",
      "appleId": 1000441216607,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5twxWFZb1yD799rme55Jqf",
        "apple": "https://podcasts.apple.com/podcast/jt-and-the-congregation-life-at-bethel/id967813520?i=1000441216607"
      }
    },
    {
      "id": "5d672852-af8e-4552-a3ea-5e1eab1d8946",
      "title": "JT’s First Day at Bethel – the Watchtower, Bible \u0026 Tract Society Headquarters",
      "description": "This podcast goes into more details about my Bethel experience by discussing what it was like on my first day. I discuss: Advice from the elders prior to leaving Reporting to the Bethel Office Hanging out with fellow Bethelites The importance of having a mentor The impact of having the right social circles can […] Support the show",
      "release": "2019-05-28T23:40:59Z",
      "duration": "00:19:00.2180000",
      "explicit": false,
      "spotifyId": "1cvdMW73zzOMEhLX6NPpzb",
      "appleId": 1000439999230,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cvdMW73zzOMEhLX6NPpzb",
        "apple": "https://podcasts.apple.com/podcast/jts-first-day-at-bethel-the-watchtower-bible-tract/id967813520?i=1000439999230"
      }
    },
    {
      "id": "bcf22fd9-4f19-4b74-9059-88a6a8bc544f",
      "title": "JT Goes to Bethel – Watchtower, Bible \u0026 Tract Society Headquarters",
      "description": "This podcast is the beginning of a series where JT chronicles his life at Bethel. He provides an in-depth account about the good, bad and ugly pertaining to Bethel’s culture, rules, institutional living, and the impact it has on the lives of Jehovah’s Witnesses around the world. In this podcast, he discusses those that influenced […] Support the show",
      "release": "2019-05-28T03:06:28Z",
      "duration": "00:10:06.3280000",
      "explicit": false,
      "spotifyId": "2INVTBBOyo2zuqcChdNQEh",
      "appleId": 1000439910748,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2INVTBBOyo2zuqcChdNQEh",
        "apple": "https://podcasts.apple.com/podcast/jt-goes-to-bethel-watchtower-bible-tract-society-headquarters/id967813520?i=1000439910748"
      }
    },
    {
      "id": "51e5c2f0-24cc-44ab-ad9b-a6ee86dcb3be",
      "title": "Jehovah’s Witnesses: No More Seats in Heaven? Was 144,000 Literal or was Charles Taze Russell a Fraud?",
      "description": "In this video, we will critically examine the teaching of Jehovah’s Witnesses that only 144,000 people will go to heaven. According to the Watchtower, there has only been the Heavenly Calling for anyone who became a Christian from the 1st century up till the 19thcentury. This would mean that Jesus Christ had less than 144,000 […] Support the show",
      "release": "2019-04-29T01:02:31Z",
      "duration": "00:26:32.0320000",
      "explicit": false,
      "spotifyId": "5xIpvZPjFKPP2YnnHyJ6kQ",
      "appleId": 1000436759154,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5xIpvZPjFKPP2YnnHyJ6kQ",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-no-more-seats-in-heaven-was-144/id967813520?i=1000436759154"
      }
    },
    {
      "id": "473801d8-5803-4088-9eb8-27104fb451eb",
      "title": "Woe to the Pregnant Woman – Jehovah’s Witnesses and Children",
      "description": "The Jehovah’s Witness faith has a long history in discouraging its members from having children. Why? Because they believe the end of the world is near and their time can be better spent in what they term “full-time ministry” which entails preaching and converting people to the Jehovah’s Witness religion. There are countless Watchtower publications […] Support the show",
      "release": "2019-04-15T00:40:07Z",
      "duration": "00:16:16.9270000",
      "explicit": false,
      "spotifyId": "4Mfl59ITAtHPAwSDglt4i8",
      "appleId": 1000434922799,
      "youTubeId": "YDVxpaZeSMI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Mfl59ITAtHPAwSDglt4i8",
        "apple": "https://podcasts.apple.com/podcast/woe-to-the-pregnant-woman-jehovahs-witnesses-and-children/id967813520?i=1000434922799",
        "youtube": "https://www.youtube.com/watch?v=YDVxpaZeSMI"
      }
    },
    {
      "id": "777f2a56-95b2-43cb-b685-085b595381f6",
      "title": "Anthony Morris – Sipping on the Sly – Jehovah’s Witnesses",
      "description": "When one of the Governing Body of Jehovah’s Witnesses is spotted at a liquor store located some 23 miles from Bethel, an unknown person captures it all on footage. It’s amazing when you think about the amount of liquor he’s purchasing. Imagine if a local brother in the congregation was caught purchasing the same amount […] Support the show",
      "release": "2019-04-08T02:32:17Z",
      "duration": "00:09:34.8240000",
      "explicit": false,
      "spotifyId": "6NVduq2FOneNErYNQvh8nQ",
      "appleId": 1000434387571,
      "youTubeId": "_YkZwQVa_HY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6NVduq2FOneNErYNQvh8nQ",
        "apple": "https://podcasts.apple.com/podcast/anthony-morris-sipping-on-the-sly-jehovahs-witnesses/id967813520?i=1000434387571",
        "youtube": "https://www.youtube.com/watch?v=_YkZwQVa_HY"
      }
    },
    {
      "id": "a97db13e-d8fb-4807-8cbd-4ea2369aa125",
      "title": "Discussion: Jehovah’s Witnesses and the High Cost of Low Education",
      "description": "Higher Education has been discouraged by Jehovah’s Witnesses from its very beginning in the 19th century. Even before this group came to be officially known as JW in 1931, their founder Charles Taze Russell was advocating that even finishing High School had little value and a waste of time. Despite living in the technological 21st […] Support the show",
      "release": "2019-04-02T03:15:04Z",
      "duration": "00:42:53.2960000",
      "explicit": false,
      "spotifyId": "2fWKPvRlcaW71LcIYqcwMj",
      "appleId": 1000433923417,
      "youTubeId": "c-B1roGSETU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2fWKPvRlcaW71LcIYqcwMj",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-and-the-high-cost/id967813520?i=1000433923417",
        "youtube": "https://www.youtube.com/watch?v=c-B1roGSETU"
      }
    },
    {
      "id": "3c0eaba5-416d-4b29-a0da-f2b46a4ff6e9",
      "title": "Discussion: Jehovah’s Witnesses - Free Bible Study? How Much Does It Really Cost?",
      "description": "How many times has a Jehovah’s Witness gone door-to-door offering the Watchtower and Awake! Magazines and boldly proclaiming that they offer free home Bible studies. It’s way too many times to count. They often brag about not paying tithes to the organization and are quick to point the finger and judge parishioners belonging to other […] Support the show",
      "release": "2019-03-25T02:21:48Z",
      "duration": "00:17:00.1860000",
      "explicit": false,
      "spotifyId": "1qVjpRJmrA2JhP4t4WJAEh",
      "appleId": 1000433251616,
      "youTubeId": "b75-hgubNY0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1qVjpRJmrA2JhP4t4WJAEh",
        "apple": "https://podcasts.apple.com/podcast/discussion-jehovahs-witnesses-free-bible-study-how/id967813520?i=1000433251616",
        "youtube": "https://www.youtube.com/watch?v=b75-hgubNY0"
      }
    },
    {
      "id": "ef5ad3cb-2c81-403c-a7be-b66df661e755",
      "title": "Are Jehovah’s Witnesses – Blood Guilty? Part Two",
      "description": "In this podcast, special correspondent, Mark Martin continues with JT and Daniel in their discussion on Blood Fractions and Blood Transfusions. Blood is living tissue. Its not digested and consumed by the body such as food and alcohol. You are transplanting living tissue. The Watchtower, as usual, uses a false analogy that is totally debunked […] Support the show",
      "release": "2019-03-19T14:08:11Z",
      "duration": "00:10:48.7770000",
      "explicit": false,
      "spotifyId": "6n6ee4VIz4fbP8feO5mgOc",
      "appleId": 1000432356261,
      "youTubeId": "3m6l10a3Ht4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6n6ee4VIz4fbP8feO5mgOc",
        "apple": "https://podcasts.apple.com/podcast/are-jehovahs-witnesses-blood-guilty-part-two/id967813520?i=1000432356261",
        "youtube": "https://www.youtube.com/watch?v=3m6l10a3Ht4"
      }
    },
    {
      "id": "940c0443-3b78-416b-8524-a70f079c6820",
      "title": "Jehovah’s Witness Women, Second Class Citizens?",
      "description": "March is Women\u0027s History Month and this video is dedicated to all of the ladies in the JW and EXJW communities. Women: Brilliant Minds, but why Second? This podcast features a variety of women from around the world providing their own perspective on what it was like being a female in the Jehovah\u0027s Witness community. They share their thoughts on what it means to feel like a second-class citizen. They discuss everything from being asked to clean the men’s bathroom and being dismissed by the circuit overseer to being humiliated by the head covering requirement. Some of the ladies stated that they didn’t even realize they were being treated like a second-class citizen until after they left and began realizing the lunacy of the teachings. JT \u0026 Lady Cee engage in real talk by discussing their own personal issues with how women were treated in the organization. Looking back, JT agrees that the teachings were definitely insane. Most women in the organization fall in line with the Watchtower’s teachings because they believe it is a commandment from God. They become immune to the mistreatment and their mind adjusts thus allowing them to believe it\u0027s normal. Featured guests include: Constance Strickland – The Strickland Chronicles Family https://www.youtube.com/channel/UCCzEElyVvRq-LDO3v84WzTQ Susan Gaskin - https://www.youtube.com/user/sudsybubble Melissa – Apt 215 https://www.youtube.com/channel/UC-mCmzmyfd8EiNhb8USMN5g Carrie Bee, Author – Paradise Bound https://www.youtube.com/user/um4real Monique – Free Monique https://www.youtube.com/channel/UC0LdEPaCS15JnXEcHDa3BXg Sylviane Nuccio Living Now https://www.youtube.com/channel/UCiR1ENB-iT-nKUAppzkaMSw Katja – Living the Second Chance https://www.youtube.com/channel/UCSAcXq1WNzRbxdjfY2AYQSA Support the show",
      "release": "2019-03-18T15:00:00Z",
      "duration": "00:44:41.3380000",
      "explicit": false,
      "spotifyId": "7wBYe9rNuH6wRAUfD9Q9vT",
      "appleId": 1000432229172,
      "youTubeId": "PVcwSnnKBKM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7wBYe9rNuH6wRAUfD9Q9vT",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witness-women-second-class-citizens/id967813520?i=1000432229172",
        "youtube": "https://www.youtube.com/watch?v=PVcwSnnKBKM"
      }
    },
    {
      "id": "41c36b92-80e1-443f-8a6d-b799dd945d47",
      "title": "Jehovah’s Witnesses \u0026 International Inconsistencies – Double Standards",
      "description": "Malawi Vs. Mexico Jehovah’s Witnesses are proud to tell others that they live by the same teachings all over the world. Yet, after leaving the religion and doing our research, we discovered that this is certainly not the case. We can recall hearing about the brothers and sisters in Malawi when the Watchtower, Bible \u0026 […] Support the show",
      "release": "2019-03-10T00:44:33Z",
      "duration": "00:14:35.9370000",
      "explicit": false,
      "spotifyId": "598hvfbuReFaMqgDJLuq52",
      "appleId": 1000431442874,
      "youTubeId": "7B0II4PdRNI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/598hvfbuReFaMqgDJLuq52",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-international-inconsistencies-double/id967813520?i=1000431442874",
        "youtube": "https://www.youtube.com/watch?v=7B0II4PdRNI"
      }
    },
    {
      "id": "f410b2bd-ad5f-4c9d-a6c1-76180d182deb",
      "title": "The Role of the Circuit Overseer – Jehovah’s Witnesses",
      "description": "According to JW.org, the circuit overseers were formerly known as Circuit Servants; Servants to the Brethren; Zone Servants; Regional Servants; Regional Service Directors; Pilgrims; Tower Tract Society Representatives. Yet, they used to have men in place known as district overseers, but they no longer exist within the organization. This title was done away with some […] Support the show",
      "release": "2019-03-05T23:07:46Z",
      "duration": "00:11:28.6130000",
      "explicit": false,
      "spotifyId": "5EPVva2I0SfKgO0AOBzaZg",
      "appleId": 1000431169509,
      "youTubeId": "RSbtbahK05Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5EPVva2I0SfKgO0AOBzaZg",
        "apple": "https://podcasts.apple.com/podcast/the-role-of-the-circuit-overseer-jehovahs-witnesses/id967813520?i=1000431169509",
        "youtube": "https://www.youtube.com/watch?v=RSbtbahK05Y"
      }
    },
    {
      "id": "9b3340a1-982a-4286-be8c-60313d563f1a",
      "title": "Jehovah’s Witnesses: Surviving The Three Stages of Transition When Leaving",
      "release": "2019-02-24T02:39:55Z",
      "duration": "00:32:53.9420000",
      "explicit": false,
      "spotifyId": "3F2pEU8QIv2MYcsS6bFjz0",
      "appleId": 1000430493708,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3F2pEU8QIv2MYcsS6bFjz0",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-surviving-the-three-stages/id967813520?i=1000430493708"
      }
    },
    {
      "id": "80cc4632-4d9b-4945-9073-b82b9f2cf706",
      "title": "Jehovah’s Witnesses: Double Agents",
      "description": "Former Jehovah\u0027s Witness elder/bethelite is discussing his own personal experience about what he knows about the practices and policies of the Watchtower, Bible \u0026 Tract Society. In this podcast, JT and Daniel discuss the Jehovah\u0027s Witnesses and double agents. They talk about how the JW goes to the Kingdom Hall and acts like the perfect Witness and then they will come on YouTube channels at night to discuss JW topics with former Jehovah\u0027s Witnesses. Some will try to defend the Watchtower and others will agree with what we say. Needless to say, neither are supposed to interacting with former Jehovah\u0027s Witnesses. They also discuss the need for individuals to remain silent when they learn information about this not being the truth because their JW family and friends are on full alert whenever someone begins to speak against JW.org. Support the show",
      "release": "2019-01-05T04:00:00Z",
      "duration": "00:10:02.2000000",
      "explicit": false,
      "spotifyId": "7mE5bEQBBDF2r6FkXVAj08",
      "appleId": 1000440278961,
      "youTubeId": "7B0II4PdRNI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7mE5bEQBBDF2r6FkXVAj08",
        "apple": "https://podcasts.apple.com/podcast/jehovahs-witnesses-double-agents/id967813520?i=1000440278961",
        "youtube": "https://www.youtube.com/watch?v=7B0II4PdRNI"
      }
    }
  ]
}