{
  "id": "fdfb7763-6df6-4d33-882a-400a259d717e",
  "name": "EX-Jehovah\u0027s Witnesses Testimonies",
  "youTubeChannelId": "UCDBrln_PSljAl7f68k9NIug",
  "episodes": [
    {
      "id": "7366c2bd-5395-45f7-93fc-0781d0d00798",
      "title": "Cults Brainwashing Interview with Alexandra Stein PhD Cult Expert",
      "description": "Sociologist James A. Beckford, in his 1975 study of Jehovah\u0027s Witnesses, classified the group\u0027s organizational structure as Totalizing, characterized by an assertive leadership, specific and narrow objectives, control over competing demands on members\u0027 time and energy, and control over the quality of new members. \n\nOther characteristics of the classification include likelihood of friction with secular authorities, reluctance to co-operate with other religious organizations, a high rate of membership turnover, a low rate of doctrinal change, and strict uniformity of beliefs among members. Beckford identified the group\u0027s chief characteristics as historicism (identifying historical events as relating to the outworking of God\u0027s purpose), absolutism (conviction that Jehovah\u0027s Witness leaders dispense absolute truth), activism (capacity to motivate members to perform missionary tasks), rationalism (conviction that Witness doctrines have a rational basis devoid of mystery), authoritarianism (rigid presentation of regulations without the opportunity for criticism) and world indifference (rejection of certain secular requirements and medical treatments).\n\nSociologist Bryan R. Wilson, in his consideration of five religious groups including Jehovah\u0027s Witnesses, noted that each of the denominations:\n\n\u0022exists in a state of tension with the wider society;\u0022\n\u0022imposes tests of merit on would-be members;\u0022\n\u0022exercises stern discipline, regulating the declared beliefs and the life habits of members and prescribing and operating sanctions for those who deviate, including the possibility of expulsion;\u0022\n\u0022demands sustained and total commitment from its members, and the subordination, and perhaps even the exclusion of all other interests.\u0022\n\nA sociological comparative study by the Pew Research Center found that Jehovah\u0027s Witnesses in the United States ranked highest in statistics for getting no further than high school graduation, belief in God, importance of religion in one\u0027s life, frequency of religious attendance, frequency of prayers, frequency of Bible reading outside of religious services, belief their prayers are answered, belief that their religion can only be interpreted one way, belief that theirs is the only one true faith leading to eternal life, opposition to abortion, and opposition to homosexuality. In the study, Jehovah\u0027s Witnesses ranked lowest in statistics for having an interest in politics. It was also among the most racially and ethnically diverse religious groups in the US.",
      "release": "2019-02-28T01:57:54Z",
      "duration": "00:47:58",
      "explicit": false,
      "youTubeId": "nU6-wo2MI3A",
      "subjects": [],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nU6-wo2MI3A"
      }
    }
  ]
}