{
  "_ts": 0,
  "id": "d35e1bd7-7e1c-46cf-be10-95f97612014c",
  "name": "ExJW SterSir",
  "youTubeChannelId": "UCqkhjgpirYjKklFdlNLTK3w",
  "episodes": [
    {
      "id": "562cffbb-8cd3-45e2-bb6d-ee84d2f475e3",
      "title": "Jehovah\u0027s Witness Judicial Meeting - Secret Recording",
      "description": "The recording starts at 27:25 if you don\u0027t want to hear what led up to the meeting.\nBE SURE TO TURN ON SUBTITLES DURING THE RECORDING! \n\nIn this secret recording of my \u0027judicial meeting,\u0027 you\u0027ll get to see how questions are not allowed in the Jehovah\u0027s Witnesses. \n\nhttps://www.jwfacts.com/watchtower/disfellowship-shunning.php\n\nCults and high control groups use the threat of shunning to enforce absolute control. \n\nhttp://www.csj.org/infoserv_cult101/checklis.htm\n\n#JehovahsWitnesses #Watchtower #JWORG",
      "release": "2020-03-24T15:34:55Z",
      "duration": "00:48:21",
      "explicit": false,
      "youTubeId": "0VfHSSXGfH4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0VfHSSXGfH4"
      }
    },
    {
      "id": "41aa0897-32c0-4991-bdf9-1927cfcf9ec0",
      "title": "Why I left the Jehovah\u0027s Witnesses after 32 years - 607/1914 Failed Prophecy",
      "description": "As a \u0027born in\u0027 Jehovah\u0027s Witness for the last 32 years, this is my story of leaving. I was a 4th generation witness and former Ministerial Servant (MS). I began to wake up in 2018 and officially disassociated myself from the congregation on January 17th, 2020.\n\nI have plans to release the meetings (I recorded them) leading up to the Judicial meeting I was forced into. I had simply walked away from the congregation and had no intention of speaking up/out. After being forced to dissociation myself, I\u0027ve realized I have an obligation. I would like the thank Watchtower for showing me that.\n\nThe first video I\u0027m putting out will cover the most central doctrine of the Jehovah\u0027s Witnesses, that is, the 607/1914 teaching. I take a very in-depth look at this prophecy and detail why it cannot be accurate. Obviously, the \u0027generation that saw the events of 1914\u0027 HAS passed away. While that does illustrate how the prophecy has failed, immense archeological data has been exhumed since the 1950s. It proves without a doubt, that Jerusalem was not destroyed in 607 BCE as the WT teaches, rather, it was destroyed in 587/586. As this is false, the 1914 teaching is also proven false.\n\nI\u0027m a very analytical person and break each point down thoroughly. If you prefer more of an overview of all the point I would encourage you to check out Lloyd Evans video linked to below.\n\nhttps://www.youtube.com/watch?v=Cl7q8J6cpVQ\u0026t=\n\nI would also encourage you to watch the Pillowgate video as it shows you how creepy the org is lol. Get your popcorn :)\n\nhttps://www.youtube.com/watch?v=Xh6JdkXn5VY\u0026t=\n\nI would also like to thank the large army of ex-JWs that have come before and told their story. Lloyd Evans/John Cedars, EXJW Analyzer, Kim Mikey, Ali\u0027s Big TOE, Goatlike Personality, Jay the Comedian, Paul Grundy JWFACTS.com, ExJW Fifth, Kevin Mcfree, and the original OG, Ray Franz and his classic \u0027Crisis of Conscience.\u0027 \n\nSome links:\nThe most complete resource for waking up IMO - https://www.jwfacts.com\n\nJeffery Jackson Testifying Before the Austrailia Royal Commission 2015 - https://www.youtube.com/watch?v=erWV8YnTFto\n\nWhen Was Ancient Jerusalem Destroyed? - Part 1 https://wol.jw.org/en/wol/d/r1/lp-e/2011736\n\nWhen Was Ancient Jerusalem Destroyed? - Part 2\nhttps://wol.jw.org/en/wol/d/r1/lp-e/2011810\n\nCarl Olof Jonsson\u0027s Rebuttal to Watchtower\u0027s 2011 2 Part Series (Oct/Nov) on Jerusalem - https://www.jwfacts.com/pdf/carl-olof-jonsson-when-jerusalem-destroyed.pdf\n\n#JehovahsWitnesses #Watchtower #JWORG",
      "release": "2020-03-13T20:34:11Z",
      "duration": "00:39:39",
      "explicit": false,
      "youTubeId": "jkkU37lfKIQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jkkU37lfKIQ"
      }
    }
  ]
}