{
  "id": "b521d4c9-13b4-4e49-9c7e-85a2f2225899",
  "name": "ExJW Watching the Watchtower",
  "youTubeChannelId": "UCTx8NeZEStMhMOMPkF-qBLg",
  "episodes": [
    {
      "id": "a7037a73-f178-433f-8914-a7f15a1e3bf1",
      "title": "Jehovah Witnesses KNOCKED MY DOOR!",
      "description": "Today, the JW\u0027s knocked on my door! My son opened the door and when he expressed he wasn\u0027t interested, was bombarded with a set of \u0022objection questions\u0022 and then closed the door on them. I then decided to take the opportunity to talk to them and ask some questions - this is what transpired.\n\nPlease Subscribe.\n\nCheck out my other videos including:\nThe Abuse I suffered as a child: https://youtu.be/IcWf1Xvqyfc\nMy recovery story: https://youtu.be/l38d5ZaMjI4\nMy experience when Jehovah Witnesses called on me uninvited in February 2019 : https://youtu.be/8c3RT567sqc\nMy recent \u0022Return Visit\u0022 to the Kingdom Hall: https://youtu.be/LTSxMUmKfsQ\nPressured to find a Cult Husband: https://youtu.be/Vgh5yG6RSvY\nMy recent study of the Watchtower Magazine: https://youtu.be/rK1I-02RuNo\nJehovah Witnesses Songs Vs Gospel: https://youtu.be/ZniKyF684_Q\nLUPUS: https://youtu.be/o3cAuFT-Jwg\n\n➥➥➥ SUPPORT ME ➥➥➥\nPlease subscribe to my channel by hitting the RED SUBSCRIBE button and the bell. Thank you.\n\nMake a donation to support my work via: \nBuy Me A Coffee: https://paypal.me/angelaedwards101?lo...\nPatreon: https://www.patreon.com/LiveLifeHappy101\n\n➥➥➥ BOOKS ➥➥➥\nCheck out and purchase my books on Amazon.  I created and published a number of books to help people fill their minds with positive, uplifting and encouraging thoughts. They can be used to overcome the ordeal of being mind controlled and aid creativity.   \n\nThe books are:\nCalming Kaleidoscopes: https://amzn.to/2SKIcML\nColour a Beautiful Life: https:https://amzn.to/2HjV5Hw\nSpread Your Wings and Fly High https://www.amazon.co.uk/dp/199963781X\n\n➥➥➥ COACHING ➥➥➥\nI am an experienced and qualified coach. If you would like more information on coaching session conducted via Skype or telephone, please email me at livelifehappy01@aol.com.  Please note: Coaching is not counselling or therapy. It is not a replacement for these services. If you require counselling or therapy, please seek qualified and professional services.\n\n➥➥➥ PUBLIC SPEAKING ENGAGEMENTS ➥➥➥\nI have an extensive background in public speaking and motivational training which includes TV Presenting, Conference Keynote Speaker, Conference Opening Speaker, Core Skills and Personal Development Trainer and Workshop Facilitator. For enquiries about speaking engagements, please email me at livelifehappy101@aol.com\n\n➥➥➥ SOCIAL MEDIA ➥➥➥\nInstagram: https://www.instagram.com/xjwlivelife...\nTwitter: https://twitter.com/LiveLif90008412\n\n➥➥➥ SUBSCRIBE FOR MORE VIDEOS ➥➥➥\nNever miss a video.  Click the RED SUBSCRIBE BUTTON above and hit the bell. Thank you.",
      "release": "2019-02-18T23:18:49Z",
      "duration": "00:32:28",
      "explicit": false,
      "youTubeId": "8c3RT567sqc",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8c3RT567sqc"
      }
    }
  ]
}