{
  "id": "0c48a8d6-8273-405e-bb94-b07699c6a293",
  "name": "EXJW Coffee Break",
  "youTubeChannelId": "UCYvTU67dZgZVYhLp1z9jQmA",
  "episodes": [
    {
      "id": "df872dd6-cc74-4e61-a862-a912b2f99b27",
      "title": "Cult of Mother God and Jehovah\u0027s Witnesses Similarities",
      "description": "A former Jehovah\u0027s Witness explains the similarities in history and beliefs of the Jehovah\u0027s Witnesses and Amy Carlson\u0027s Cult of Mother God, Love has Won.\n\n#exjw #exjwcomedy #jehovahwitness #jehovahswitness #jehovahswitnesses #hbodoc #mothergod #lovehaswon #cult #cults #cultmember #cultexpert #summary #excultmember #colloidalsilver #culthistory #cultbeliefs",
      "release": "2026-01-05T14:15:14Z",
      "duration": "00:25:49",
      "explicit": false,
      "youTubeId": "gu1ROT9DX0o",
      "subjects": [
        "Love Has Won",
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gu1ROT9DX0o"
      }
    },
    {
      "id": "0047dcc1-afc2-46a7-bff6-8696178fe2a1",
      "title": "Jehovah\u0027s Witness Religion Began as a Pyramid Scheme",
      "description": "The Jehovah\u0027s Witness Religion was initially a publishing company that resembled a pyramid scheme. Members purchased literature and sold it at a profit. They were encouraged to recruit new members and each new member also had to sell literature and subscriptions to literature. If each member did not spend time each month selling literature they were disciplined and labelled \u0027inactive.\u0027 A circuit overseer, or middle-manager, visited each congregation every three months and reviewed how much time the congregation was spending in the publishing work. In the late 90\u0027s Watchtower stopped charging money for literature because they were in danger of losing their tax-free-status as a non-profit religion.",
      "release": "2025-12-21T22:21:51Z",
      "duration": "00:09:22",
      "explicit": false,
      "youTubeId": "tO_EumX0X0A",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tO_EumX0X0A"
      }
    },
    {
      "id": "789628ff-1791-4cf0-87fa-1f6f9e5b4bdf",
      "title": "How It Feels to be Brainwashed - An EX Jehovah\u0027s Witness Explains",
      "description": "I was a mind controlled Jehovah\u0027s Witness for almost 40 years. Using Steven Hassan\u0027s Book Combating Cult Mind Control, I examine how it feels to be mind controlled through the eyes of an average Jehovah\u0027s Witness. How can you be in a cult and not realize it? I walk you through how it looks and feels.\n\nexjw, Jehovah witness, ex Jehovah\u0027s Witness, ex cult member, brain washing, brain washed, mind controlled, Steven Hassan, brain wash, mind control, why I left Jehovah\u0027s Witnesses,",
      "release": "2025-11-12T01:28:30Z",
      "duration": "00:32:36",
      "explicit": false,
      "youTubeId": "6bR9L1YQQBw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6bR9L1YQQBw"
      }
    },
    {
      "id": "d9eae244-286f-4c51-8637-0116bfd56325",
      "title": "Why I Left Jehovah\u0027s Witnesses - Former Pioneer",
      "description": "My experience being a fourth generation Jehovah\u0027s Witness and how researching a Watchtower article that didn\u0027t sit right with me eventually woke me up. My husband was an elder and I was a pioneer. There was only one thing I knew for sure and that was the truth was the truth so finding out that it wasn\u0027t was initially devastating. I\u0027m making this video because I\u0027d like to help people who are having a similar experience as I know how much watching these videos helped me when I was waking up.\n\nexjw ex Jehovah\u0027s Witness former pioneer cult two witness rule governing body new light new understanding",
      "release": "2025-09-13T19:30:17Z",
      "duration": "00:56:08",
      "explicit": false,
      "youTubeId": "Ide5KmjEjlM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ide5KmjEjlM"
      }
    }
  ]
}