{
  "_ts": 0,
  "id": "3b0a9d5b-e318-4e6b-8d66-a744143d463f",
  "name": "Exmormonology",
  "spotifyId": "6I4eadpatQ1KOpOdwrKhYZ",
  "appleId": 1489879938,
  "episodes": [
    {
      "id": "b596cbfd-9211-4565-9378-74a5db916752",
      "title": "The Exmormonology",
      "description": "Exmormonology lives on. Let\u0027s talk about it. Also, Wildflower Weekend is 6 weeks away and I want you to join us. Sharing words from previous Wildflowers who attended last years Wildflower Weekend and the exact reason why you should carve out time in your life so you can experience what this healing retreat is all about.",
      "release": "2023-09-13T17:38:00Z",
      "duration": "00:23:03.6010000",
      "explicit": false,
      "spotifyId": "6PzN7eTYLdCa3dFxXf8l53",
      "appleId": 1000627767358,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6PzN7eTYLdCa3dFxXf8l53",
        "apple": "https://podcasts.apple.com/podcast/the-exmormonology/id1489879938?i=1000627767358"
      }
    },
    {
      "id": "b8151943-1510-4b9d-9a23-8e4f5f080f16",
      "title": "The Exmormon Bubble, LGBTQIA\u002B, a convo with James Rhodimer",
      "description": "Have you ever had a conversation with a stranger that ignited a sparked your brain? This happened this morning as Jim and I were having breakfast at a cafe in Provo Utah, we happened to have an amazing conversation with someone else who was doing what we were doing, eating. I share that conversation with you today. I invited James to join me today on the podcast because, well, he was there and we ended up having our own several hour conversation that was started by this happenstance meeting today with a stranger. We also discuss what we think is the exmormon echo chamber and the Barbie movie. I would love to hear your thoughts too. amyloganlife.com",
      "release": "2023-07-24T00:24:00Z",
      "duration": "00:56:38.5560000",
      "explicit": false,
      "spotifyId": "70VZbP8m289bo1IrC0ANa0",
      "appleId": 1000622083940,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/70VZbP8m289bo1IrC0ANa0",
        "apple": "https://podcasts.apple.com/podcast/the-exmormon-bubble-lgbtqia-a-convo-with-james-rhodimer/id1489879938?i=1000622083940"
      }
    },
    {
      "id": "ef0d85fe-85cd-4bed-9276-ab1ce5ea96e3",
      "title": "Triggered Scrupulosity",
      "description": "Let\u0027s dive into religious scrupulosity and the Doug Fabrizio\u0027s Radio West Episode last week. Radio West is a Salt Lake City radio/podcast show. I was a bit triggered by a few things said by a guest on last weeks show and I want to talk about it, what it means and what it may mean to you. Working your way out of religious scrupulosity is possible. For many it stops the minute your religious beliefs dissipate, for others it may take years to unravel. Either way, I want to talk about what is happening for those of us who tend towards the scrupulous ways of religiously believing, even when we did not know it was a thing that was happening to and within us.",
      "release": "2023-07-17T16:47:00Z",
      "duration": "00:27:34.5690000",
      "explicit": false,
      "spotifyId": "3cybRWoB4aVqSLFLTnoaBQ",
      "appleId": 1000621439063,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3cybRWoB4aVqSLFLTnoaBQ",
        "apple": "https://podcasts.apple.com/podcast/triggered-scrupulosity/id1489879938?i=1000621439063"
      }
    },
    {
      "id": "8539daf4-07d4-478e-8cd0-65367444f4cc",
      "title": "Affirmations Are BS",
      "description": "Wildflower, you have a life to live and a brain to guide you to whatever it is you desire. On The Unorthodox Woman Podcast, I show you how to do just that, be your own brain guide. While I know that the title of this episode may sound like I want to take on the whole affirmation community (if that is a thing), that is not the case. I do believe there is a missing step in the process of how we have been taught to do affirmations. So, this week, I want to teach you the missing piece and speed up the process of getting you to what you want to believe about yourself. This way you get to where you want to go with your life a whole lot quicker! If nothing else, you get to the beliefs you want to believe in a more holistic, moving way, sustainable way.",
      "release": "2023-07-09T19:19:00Z",
      "duration": "00:20:10.3830000",
      "explicit": false,
      "spotifyId": "33PrO916P8TN7b5pDYB9p5",
      "appleId": 1000620403772,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33PrO916P8TN7b5pDYB9p5",
        "apple": "https://podcasts.apple.com/podcast/affirmations-are-bs/id1489879938?i=1000620403772"
      }
    },
    {
      "id": "cbaa6dcf-b5c0-4113-9b02-d8ebdde19a90",
      "title": "Obsessed with Televangelist \u0026 Shiny Happy People? Let\u0027s talk about why.",
      "description": "You may be developing an obsession, or at minimum a fascination, with things like televangelists or Shiny Happy People. Me too! This week I dive into why that happens, what is happening in your brain when you watch and how this is an important part of your healing. I also address the \u0022script\u0022 used by most of the religious people in your life when you share the news that you are leaving your religion. It is the script that show that the indoctrination is working. Let\u0027s talk! I have so much to share with you this week. Become my client. amyloganlife.com",
      "release": "2023-07-02T17:10:00Z",
      "duration": "00:35:02.5690000",
      "explicit": false,
      "spotifyId": "42eY4xoIU9DMzuGePKaiVB",
      "appleId": 1000619048327,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/42eY4xoIU9DMzuGePKaiVB",
        "apple": "https://podcasts.apple.com/podcast/obsessed-with-televangelist-shiny-happy-people-lets/id1489879938?i=1000619048327"
      }
    },
    {
      "id": "a6a802d8-a2f4-4cef-bb9f-eef47424b7a1",
      "title": "Focus: The Struggle Is Real",
      "description": "It was the summer of 1990, shortly after I was married, when my husband and I embarked on a journey to Flaming Gorge Lodge (in Utah) where we would work for the summer saving for college tuition. I worked as a waitress at the diner. In this week\u0027s episode of The Unorthodox Woman, I recount a remarkable encounter with a charming lady who happened to be working alongside me. While I can\u0027t recall her exact age or even remember her name, she appeared to be in her late 60s or maybe even 70s. (as a 20-year-old, she seemed \u0022old\u0022 to me at the time.) Little did I know that she would impart a lesson that has stayed with me for over 30 years. It involves coffee, a beverage I was not allowed to drink as an active believing member of my church. I have a feeling this story will help you with whatever you are struggling with, as it has helped me with my own struggles throughout my life.",
      "release": "2023-06-25T18:35:00Z",
      "duration": "00:20:34.4160000",
      "explicit": false,
      "spotifyId": "1xyhiMFZuLSjJ5Q4ru99Fn",
      "appleId": 1000618265551,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1xyhiMFZuLSjJ5Q4ru99Fn",
        "apple": "https://podcasts.apple.com/podcast/focus-the-struggle-is-real/id1489879938?i=1000618265551"
      }
    },
    {
      "id": "fffebcac-ab24-432d-b125-cfd63c297bb8",
      "title": "Is It Bad That I?",
      "description": "Raise your hand if you have ever asked a friend a question that starts with \u0022Is it bad that I...?\u0022 Yeah, me too. Yep, I see you! Hello, we have a lot in common. This question is rich for the corners of your conditioning to explore. This week, let\u0027s dive into all things guilt and the psychology behind why it may be hard for you to make decisions. Your social, religious, spiritual and familial conditioning comes in hard and fast when the possibility of potential guilt or regret come into play. I want to zoom out and get a big picture of what is going on in your brain when you ask a question like this. So, grab your earbuds and get your brain ready for some critical thinking! amyloganlife.com",
      "release": "2023-06-18T16:38:00Z",
      "duration": "00:25:20.8220000",
      "explicit": false,
      "spotifyId": "7xGa0GOpbbff7h7E1vjCf0",
      "appleId": 1000617461421,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7xGa0GOpbbff7h7E1vjCf0",
        "apple": "https://podcasts.apple.com/podcast/is-it-bad-that-i/id1489879938?i=1000617461421"
      }
    },
    {
      "id": "c3a839f4-a940-4d32-81da-a9db899b2a39",
      "title": "Trust Yourself",
      "description": "Welcome to this week’s episode of The Unorthodox Woman Podcast, where we dive into the fascinating topic of self trust. Get ready for a refreshing perspective on how to navigate decision making and embrace your instincts. We have all heard the phrase “trust issues” tossed around, but let’s challenge that narrative and explore why it is time to leave it behind. Join me as we embark on a journey to boost your self trust, empowering you to take the helm of your own life’s ship, no matter what others may think, do or say about you. It is time to discover the limitless possibilities that await when you trust yourself. (*plus a snippet on Mary Tyler Moore as an Unorthodox Woman.)",
      "release": "2023-06-11T17:26:00Z",
      "duration": "00:38:31.9410000",
      "explicit": false,
      "spotifyId": "6aIVN0gwXNqzhXVSDq1xFN",
      "appleId": 1000616544190,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aIVN0gwXNqzhXVSDq1xFN",
        "apple": "https://podcasts.apple.com/podcast/trust-yourself/id1489879938?i=1000616544190"
      }
    },
    {
      "id": "d2f6d9c8-55ae-49da-8d1e-49a150372e52",
      "title": "Happy Pride \u0026 A Quick History",
      "description": "Happy Pride, Wildflowers! June is a special month, filled with vibrant rainbows that illuminate our communities. It\u0027s a time when we come together to celebrate and show our unwavering support for our queer friends. However, it\u0027s important to acknowledge that not everyone shares the same level of acceptance and love. This reality reinforces the significance of celebrating and uplifting the voices of our queer loved ones. As allies, we have a responsibility to stand beside them, amplifying their experiences and advocating for their rights. It is crucial that we make conscious choices with our resources, ensuring we don\u0027t support organizations that oppose equality. One powerful way to become a better ally and understand the struggles faced by the LGBTQIA\u0026#43; community is through education. By learning about the rich history of the LGBTQ movement in the United States, we gain invaluable insights into the progress that has been made and the challenges that remain. This history is a tapestry woven with the resilience, courage, and determination of countless individuals who fought for their rights and the rights of future generations. In this week\u0027s episode, we embark on a journey through time to explore key players and events that have shaped and propelled the fight for equality in the LGBTQIA\u0026#43; movement in our country. By delving into these stories, we can deepen our understanding of the struggles faced by the community, the milestones achieved, and the ongoing work that lies ahead. Each chapter in this history reveals the strength and spirit of a community that refused to be silenced, pushing boundaries and demanding recognition. From the Stonewall Riots in 1969, where transgender women of color led the charge against police brutality and ignited a global movement, to the activism of Harvey Milk, the first openly gay elected official in California, who championed LGBTQ rights until his tragic assassination - these stories serve as reminders of the power of collective action and the transformative impact it can have. Learning about the LGBTQ movement\u0027s history fosters empathy, compassion, and a deeper appreciation for the progress we\u0027ve made while acknowledging the work that remains. It allows us to challenge prejudice and discrimination, inspiring us to create inclusive spaces where all individuals can live authentically and without fear. By embracing the past, we pave the way for a more equitable future. So let us honor the struggles and celebrate the triumphs of the LGBTQIA\u0026#43; movement by educating ourselves, elevating diverse voices, and standing alongside our queer friends with unwavering support and love. Happy Pride, Wildflowers!",
      "release": "2023-06-04T17:32:00Z",
      "duration": "00:36:48.6260000",
      "explicit": false,
      "spotifyId": "2zWeiKFb6kqidSeMWuPEPC",
      "appleId": 1000615630677,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zWeiKFb6kqidSeMWuPEPC",
        "apple": "https://podcasts.apple.com/podcast/happy-pride-a-quick-history/id1489879938?i=1000615630677"
      }
    },
    {
      "id": "3df2f335-6e40-4d5c-8cb1-3bc10af6de2b",
      "title": "The Patriarchal Name \u002B A Tool",
      "description": "Are you ready to take back control of your emotions and the thoughts that keep you up all night, feeling stuck in anxiety or worry or fear or shame? ( just to name a few uncomfortable emotions) Let\u0027s talk about they psychology behind your brain and why you think and feel the way you do. I often refer to my coaching as thought work, but it is so much more than that. It is feeling work too. It is \u0022work\u0022 because it takes time to rewire your brain and the habitual way you think and feel. No matter if you have left your religion, a relationship or you are working on body image and/or everything in between, the tool I teach in this episode will help you as you continue your healing. Thought work is the beginning of getting curious about all of your swirling thoughts. I will couple this with feeling our feelings in another episode, but this week, let\u0027s talk more about your brain and how you can add thought work to your healing journey. amyloganlife.com",
      "release": "2023-05-28T00:00:00",
      "duration": "00:35:12.4700000",
      "explicit": false,
      "spotifyId": "1lpjUkGOrUCQDmzPU3dFbI",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lpjUkGOrUCQDmzPU3dFbI"
      }
    },
    {
      "id": "7bbd691c-d9f7-4fee-bb78-8ae6372f99f2",
      "title": "The Little You",
      "description": "It is time to connect with the younger you. Your healing is important. When you slow down and take the time to heal the parts of you that need you, you will be better for it. You will not be as triggered as you may currently be in the corners of your life. Let\u0027s dive into why this is so important. The younger you is waiting to hear from you.",
      "release": "2023-05-22T00:18:00Z",
      "duration": "00:22:13.8120000",
      "explicit": false,
      "spotifyId": "3ElvW97mw7AvSFaZWU9jUv",
      "appleId": 1000613919493,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ElvW97mw7AvSFaZWU9jUv",
        "apple": "https://podcasts.apple.com/podcast/the-little-you/id1489879938?i=1000613919493"
      }
    },
    {
      "id": "942bb806-d5ff-4b66-8d51-8ff515a6e721",
      "title": "Pay Attention ~ Awareness",
      "description": "Would you like to be in the trailer for The Unorthodox Woman Podcast? Tune in to hear all the details. Time Sensitive ~ You have until June 1st 2023. If you are serious about improving your mental health, you must start with awareness. If you do not see the literal soundtrack your brain plays for you everyday, how will you know what to change or even how to improve? We are not looking for perfection, that is not a thing, but we can make huge changes in our life if we start paying attention to the ticker tape of thoughts you have swirling around in your head. Those thoughts are 100% affecting your day to day life. The thoughts in your head are laying the ground work to your emotional health. amyloganlife.com",
      "release": "2023-05-14T18:56:00Z",
      "duration": "00:29:38.7820000",
      "explicit": false,
      "spotifyId": "5XQFE6AVaRPsIEVUPmy6W9",
      "appleId": 1000612987019,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5XQFE6AVaRPsIEVUPmy6W9",
        "apple": "https://podcasts.apple.com/podcast/pay-attention-awareness/id1489879938?i=1000612987019"
      }
    },
    {
      "id": "c3b223cc-4423-4304-a83d-8b7b64f66220",
      "title": "Transitioning",
      "description": "Welcome to the 1st episode of The Unorthodox Woman! We are a group of heretics, liberals, post religious peeps, smart feminists and passionate about life humans. In this inaugural podcast episode I share with you why the change from Exmormonology to The Unorthodox Woman and the direction and plan I have for the vision of this new chapter. Our collective religious, social and familial conditioning has most likely effected you in ways you may not see yet. I coach you through busing out of the boxes we were metaphorically placed in from the minute we were born. We will be unlearning a lot of what has contributed to a constricted way of thinking and living. You get to create your own personal renaissance and it all starts now! What do you want that to look like? How many iterations of yourself do you want to have fun exploring? What areas of life do you find yourself stuck in even tho you have left a lot of your past ways of thinking and feeling behind? These are all issues we will be discussion on the podcast. If you struggle in any area of your life, as most of us humans do, you are in the right place!",
      "release": "2023-05-07T19:59:00Z",
      "duration": "00:40:16.7440000",
      "explicit": false,
      "spotifyId": "5uJD5FiXWUuN4ogfm3KlUX",
      "appleId": 1000612088672,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5uJD5FiXWUuN4ogfm3KlUX",
        "apple": "https://podcasts.apple.com/podcast/transitioning/id1489879938?i=1000612088672"
      }
    },
    {
      "id": "aa66193b-c0a6-49fe-b8d7-960c6a3a7e1b",
      "title": "Exmormonology ~ The Second Shelf",
      "description": "Experiencing your high demand religion initial shelf break and subsequent faith crisis is so hard! It is emotional, earth shattering and very overwhelming. Just when you think you are starting to get your footing and everything will be okay, you get hit with another shelf break. Deconstructiong mormonism is the first step, quickly you learn that there is another shelf that comes tumbling down. Are you ready for it? Let\u0027s dive into this topic this week and talk about how this happens, why this happens and how it is a good thing.",
      "release": "2023-02-11T02:32:00Z",
      "duration": "00:23:46.4420000",
      "explicit": false,
      "spotifyId": "6qJJ2VH6rc5yisJ30WzrSV",
      "appleId": 1000599109854,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6qJJ2VH6rc5yisJ30WzrSV",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-second-shelf/id1489879938?i=1000599109854"
      }
    },
    {
      "id": "6ec6d212-14e0-428d-8268-2eb4bf5dae4f",
      "title": "Exmormonology ~ Is Healing An Illusion?",
      "description": "About a month or so ago, a friend, a former Jehovah Witness friend, asked me a really great question, Is Healing An Illusion? I loved this questiong so much that I created a podcast around it. Let\u0027s dive into when healing does feel like an illusion and why and what you can do about it so you do not get stuck in the pain of reliving your pain/trauma again and again and again. There is healing in telling/sharing your story, it can be freeing in just doing that, sharing, telling your story to a therapist or friend. Does your story come out the same way again and again? Do you judge yourself for not having \u0022healed\u0022 faster? Is there a time limit on when you are supposed to be healed? In this episode I deep dive into the concept of healing and what we think it should look like and what healing actually looks like AND how you can be an active participant to your own healing, possibly speeding up the process. If you feel like you are on an emotional roller coaster of emotions all the time or that your healing is taking way too long, then this episode of Exmormonology is a very important one for you to listen to Wildflower.",
      "release": "2023-02-02T21:28:00Z",
      "duration": "00:32:33.8280000",
      "explicit": false,
      "spotifyId": "2ZZyKGdkJDnT2gGXD9fVpS",
      "appleId": 1000597782781,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZZyKGdkJDnT2gGXD9fVpS",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-is-healing-an-illusion/id1489879938?i=1000597782781"
      }
    },
    {
      "id": "9610d95e-134c-40c2-b4fa-7250f0bab1af",
      "title": "Exmormonology ~ PT 2 Healing After Faith Crisis w/ Emily Robinette",
      "description": "This is part 2 of my conversation wtih Emily Robinette! Enjoy the rest of our convo as we talk about all things post mormon related and how life coaching has helped speed up some of Emily\u0027s healing, not just with mormon related topics but also all of LIFE. Tune in as we talk about how unraveling your mormon brain takes time, years actually. What is the strangest place your mormon brain has shown up on this side of life? Seriously post mormon humor is one of my most favorite things. Laughter is really the key piece to your healing. When you get to the place of laughter, you know you are on the right track. You got this wildflower!",
      "release": "2023-01-20T17:03:00Z",
      "duration": "00:47:59.6860000",
      "explicit": false,
      "spotifyId": "61rrOpmB4codeKBxhwEKDU",
      "appleId": 1000595778442,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/61rrOpmB4codeKBxhwEKDU",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-pt-2-healing-after-faith-crisis-w-emily/id1489879938?i=1000595778442"
      }
    },
    {
      "id": "700c8dab-24ed-4651-bf4a-5c9f46b3b97f",
      "title": "Exmormonology ~ Healing After Faith Crisis w/ Emily Robinette",
      "description": "This week in Exmormonology Land I have invited Emily Robinette over for a conversation. We talk about all things faith crisis; the freedom we feel post faith crisis and also the rocky road we navigate after we leave the church, ie. high demand religion. You know that Exmormonology is all about helping you heal and work through religious trauma. Healing is not linear. It has ups and downs and joy and pain. Come be a fly on the wall while we discuss it all. Emily had her initial faith crisis in 2019 and has spent the last several years working through the tough issues that we all have to work through in finding our way back to ourselves, after the world as we knew it comes crashing down around us. You, wildflower, are not alone on this journey. Keep going. Keep healing. Keep showing up for yourself.",
      "release": "2023-01-16T19:48:00Z",
      "duration": "00:44:21.8770000",
      "explicit": false,
      "spotifyId": "2S9kkWintMPxsYfB1h339W",
      "appleId": 1000594773619,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2S9kkWintMPxsYfB1h339W",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-healing-after-faith-crisis-w-emily-robinette/id1489879938?i=1000594773619"
      }
    },
    {
      "id": "d12ebf25-ebe4-4847-90ad-2a456460f403",
      "title": "Exmormonology ~ Post Mormon Christmas",
      "description": "Last December I created a podcast 12 days in a row and called it The 12 Days of Post Mormon Christmas. The goal? To help you this time of year. This year, I pulled out the best snippets and put them all in one podcast episode. So, if you are working through a lot of thoughts and feelings about Christmas and Family right now along your own personal post mormonism journey, tune in. I give you specific tools and helps for you so you do not feel consumed with guilt or frustration or anger as you celebrate a holiday that may leave you with a bunch of confusion. You may be in the \u0022The holidays ain\u0027t what they used to be\u0022 frame of mind, I hear you 100%. Nothing like seeing baby Jesus to bring up your religious trauma. Let\u0027s dive in and reclaim a holiday in a way that feels better now that you are on this side of the fence.",
      "release": "2022-12-21T16:45:00Z",
      "duration": "00:52:39.1440000",
      "explicit": false,
      "spotifyId": "79QLqtIXkPC0Kbe7U1c99l",
      "appleId": 1000590895336,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79QLqtIXkPC0Kbe7U1c99l",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-post-mormon-christmas/id1489879938?i=1000590895336"
      }
    },
    {
      "id": "3441e9f2-03b2-455f-8c19-aac62590440f",
      "title": "Exmormonology ~ A Conversation w/ Allison Crow",
      "description": "I am excited to share with all y\u0027all wildflowers a conversation I have with my friend and fellow coach Allison Crow. Allison just released her new book Unarmored: Finding Home in the Wild Edges of Being Human. Allison was raised a devout Christian in the south, Texas. Although not raised mormon, Allison has experienced her own faith crisis. I know you will love our discussion and we ebb and flow about life and heartbreak and healing and busting out of the \u0022being a made up woman my religion taught me to be,\u0022 type of thinking. Allison Crow, M.Ed, is a Life and Self-Leadership coach for small business owners and executives. She has been leading, teaching, speaking, writing, creating, and coaching in one form or another since the mid-1990s. For years, she was a hard-lined performance and sales coach motivated by outside forces and an excruciating need for approval. Now, instead of being driven by hard financial goals and lifeless quotas, Allison has an unconventional and connected practice where delicious and thought provoking conversations are centered around meeting yourself deeply. She helps her clients compassionately work with emotions, thoughts, and behaviors that are natural but often bypassed parts of our human selves. Allison specializes in IFS-informed coaching, deep inner work, creative expression, and building the skills of courageous emotional presence and self-trust. Allison lives in the hill country outside of Austin, Texas, with her husband of fifteen years and her rescued dogs, Leroy Brown and Clementine. She is often seen with a stack of journals, a paintbrush and watercolors, with her phone in her hand, creating and connecting on social media, or floating in the backyard pool she calls her “church.” WWW.ALLISONCROW.COM https://allisoncrow.com/unarmoredthebook/",
      "release": "2022-12-09T00:16:00Z",
      "duration": "01:28:31.3990000",
      "explicit": false,
      "spotifyId": "0irC8GaJNI1xTXypfodL6v",
      "appleId": 1000589506621,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0irC8GaJNI1xTXypfodL6v",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-a-conversation-w-allison-crow/id1489879938?i=1000589506621"
      }
    },
    {
      "id": "8dd7a970-0f69-441b-ada8-f09025972004",
      "title": "Exmormon Thoughts \u0026 Things \u0026 Stuff",
      "description": "The title of this Exmormonology Episode sums up this week\u0027s episode, it is a little bit all over the place, but as you listen I have a feeling you will understand. I tap into some pretty tender emotions and I want to share them with you in hopes that you can relate and see and hear what healing sounds like. Healing does not mean you have landed at the top of healing mountain where rainbows and butterflies live forever and ever and you dance around in gleeful joy and you no longer feel grief, pain or heartache. It means that you learn to hold the space for the tender side of healing and you do not make it mean that anything has gone wrong or that you are not healing. Healing ebbs and flows. Healing takes time. Remember wildflower, there is no rush and no race to this process. Just you and all the time you need. Thank you for letting me walk this path with you. Grab a cup a something and a blanket and maybe even a tissue and let\u0027s talk, you and me.",
      "release": "2022-12-04T20:56:00Z",
      "duration": "00:33:15.3630000",
      "explicit": false,
      "spotifyId": "6beTgtJ2BOtSkS21RHI2Xw",
      "appleId": 1000588711223,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6beTgtJ2BOtSkS21RHI2Xw",
        "apple": "https://podcasts.apple.com/podcast/exmormon-thoughts-things-stuff/id1489879938?i=1000588711223"
      }
    },
    {
      "id": "04e32a65-6909-4beb-8af4-49db1ef4e4f5",
      "title": "Exmormonology ~ You have been through something extraordinary",
      "description": "Do you ever take the time to celebrate yourself and your amazingness? I am going to guess that you do not do this enough. This week I want to talk about why this is important and how easy it is to overlook it. You have been through something extraordinary. You have experienced a faith crisis, paradigm shift and you are rethinking most everything in your life. No wonder you are overwhelmed, stressed and feeling stuck. Let\u0027s work on shaking it up a bit. Life is good. You are amazing. I offer a homework assignment that may help you in celebrating yourself. Do it, it is good for your mental health.",
      "release": "2022-11-24T21:58:00Z",
      "duration": "00:28:55.6010000",
      "explicit": false,
      "spotifyId": "546qIrUIYsGLgRmVmijotZ",
      "appleId": 1000587425946,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/546qIrUIYsGLgRmVmijotZ",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-you-have-been-through-something-extraordinary/id1489879938?i=1000587425946"
      }
    },
    {
      "id": "c8fa508b-6114-4f26-80ba-0c89aaadba58",
      "title": "Exmormonology ~ T is for Trigger",
      "description": "Another week of healing wildflower. This week\u0027s episode is a twofer, maybe a threefer! (is that a word?) A few topics blended together as we head into the holidays. Family. The void. Faith crisis v. awakening. Thoughts and feelings oh my! You have some decisions to make this time of year. Is your brain going off the rails as you brace yourself for family? Should you go? Should you not? Are you ready for a gathering with your mormon family or would some time off be best for you? This week I want to talk about what may be going on in your brain and in your heart as you head into potential family time.",
      "release": "2022-11-18T00:27:00Z",
      "duration": "00:25:34.0400000",
      "explicit": false,
      "spotifyId": "5jfQcZJXEBuLxKnVv1ew8U",
      "appleId": 1000586650665,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jfQcZJXEBuLxKnVv1ew8U",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-t-is-for-trigger/id1489879938?i=1000586650665"
      }
    },
    {
      "id": "e0351182-632c-493b-8857-443b36586dc2",
      "title": "Exmormonology ~ Breakdown",
      "description": "Hey all of you faith transition/faith crisis wildflower...has this happened to you? You have been through, what you thought was the worst of your faith crisis and then one day something happens and it brings it all back. You breakdown. All the work you thought you had done feels like it is erased and you find yourself in a heap of tears, yet again. Faith crisis, faith transition, and moving on is a life long process. Learning how to let those days of breakdown be a part of life and not take over is a key to healing. Nothing has gone wrong if you have a breakdown. Tune in this week as I take you through one of my many breakdowns post faith crisis. amyloganlife.com",
      "release": "2022-11-11T01:03:00Z",
      "duration": "00:21:08.0620000",
      "explicit": false,
      "spotifyId": "10PRhvz9gXTscD14cgSOh5",
      "appleId": 1000585823263,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/10PRhvz9gXTscD14cgSOh5",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-breakdown/id1489879938?i=1000585823263"
      }
    },
    {
      "id": "e7c2eb6c-a58a-45b4-8869-b1d5cbe7a78d",
      "title": "Exmormonology ~ Money, My Interview With Natasha Tekeste",
      "description": "Continuing our conversation about money with Money Mindset Coach Natasha Tekeste. Natasha Tekeste is a money mindset coach for women and people socialized as women who want to earn more money. She works with women who want to shift their beliefs around money and wealth so they can leave the drama behind and focus on actually doing the work that they love to do. She teaches people how to love the money they have, while also loving the process of earning and creating more – because it is possible for money to be easy \u0026 fun! Natasha is an Advanced Certified Life Coach. She has a buiness degree from the University of Alberta, a master\u0027s degree in Adult Education from the University of Calgary, and a certificate in mediation \u0026 negotiation from York University. She is a Chartered Professional in Human Resources with over 10 years of HR work experience. Instagram @natashatekeste natashatekeste.com",
      "release": "2022-11-01T21:55:00Z",
      "duration": "00:46:32.9070000",
      "explicit": false,
      "spotifyId": "7ea38NF4OVGI1tyXf43IYb",
      "appleId": 1000584709309,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7ea38NF4OVGI1tyXf43IYb",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-money-my-interview-with-natasha-tekeste/id1489879938?i=1000584709309"
      }
    },
    {
      "id": "1735ac83-6347-4dcf-ad14-8270a62df1aa",
      "title": "Exmormonology ~ Money",
      "description": "What is your money story? Do you even know that you have one? Have you spent anytime exploring why you think the way you do about money? Or do you just accept the fact (not fact) that you are doomed and it is what it is? One area of your life you may not have connected the dots with, post faith transition, is how your brain thinks about money because of your religious and social conditioning. Today I want to open the door to exploring this topic with you and get to the bottom of why you think the way you to about money. The truth is that you get to think about money any way you want to, so how do YOU think about money?",
      "release": "2022-10-22T00:00:00",
      "duration": "00:35:49.7990000",
      "explicit": false,
      "spotifyId": "42lOGsfJsFrD9thsyPSUV1",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/42lOGsfJsFrD9thsyPSUV1"
      }
    },
    {
      "id": "5d818111-2248-4da7-982a-8290aea57d00",
      "title": "Exmormonology ~ I Am Back (grounding tool)",
      "description": "When your thoughts get on the loose, what do you do? Do you believe those thoughts and go down the self loathing rabbit hole? Grounding tools help you get present and not stuck in the past or future. Here is a little tool to help pull you out of that stuck frame of mind. Also, Wildflower Weekend! We had amazing weekend and I want you there next year. When you plan your life out, do you schedule time for your healing and growth? If not, why? Change that up wildflower. Let\u0027s go!",
      "release": "2022-10-13T20:36:00Z",
      "duration": "00:28:15.4770000",
      "explicit": false,
      "spotifyId": "1qQOCy1Onmw9yRf57W8o5C",
      "appleId": 1000582581987,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1qQOCy1Onmw9yRf57W8o5C",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-i-am-back-grounding-tool/id1489879938?i=1000582581987"
      }
    },
    {
      "id": "932778cd-93aa-44a2-ba69-06e26aa5d768",
      "title": "Exmormonology ~ The Bully",
      "description": "Do not underestimate the power of your brain. All healing starts with you, your brain and your emotions. One of meanest things we can do to ourselves is be our own bully. This week I want to talk to you about actual bullying and self bullying. The thoughts going through your brain are optional. What thoughts take center stage of your own brain? Do you speak kind words to yourself or words you would never say to a friend? Do you even notice? I want you to start paying attention. We cannot change anything in our lives if we are completely unaware. Pay attention to your thought soundtrack wildflower.",
      "release": "2022-09-02T20:42:26Z",
      "duration": "00:26:26.7820000",
      "explicit": false,
      "spotifyId": "5Kyb0vKPAXswulXT7JDMQd",
      "appleId": 1000578207055,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Kyb0vKPAXswulXT7JDMQd",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-bully/id1489879938?i=1000578207055"
      }
    },
    {
      "id": "0cc0f4eb-cfda-4267-87da-1120bf9ca201",
      "title": "Wildflower Weekend 2022 ~ Are YOU Coming?",
      "description": "Do you trust yourself? I know that can be a loaded question, but when one grows up in a high demand religion and has been taught to put their trust in a curated higher/church authority, it can be a tricky question to answer. This year at Wildflower Weekend we will be slowing down time and focusing on you and a few of your biggest struggles. I imagine, if you feel stuck in any area of your life, it is becuase you are not trusting your ability to have your own back, no matter what. You are letting the fear of a projected future feeling keep you frozen. After this weekend you will feel more confident to make needed changes in your life and take the steps required to get unstuck with any struggle you find yourself in. Set aside September 30th-Oct. 2nd in SLC, Utah. Wildflowers are flying in from around the states and even Canada. Come join us! Let\u0027s have a groovy healing and productive time together. amyloganlife.com",
      "release": "2022-08-18T16:43:28Z",
      "duration": "00:07:34.0600000",
      "explicit": false,
      "spotifyId": "0h7FNAVbNMpRvQCSTswGKt",
      "appleId": 1000576511240,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0h7FNAVbNMpRvQCSTswGKt",
        "apple": "https://podcasts.apple.com/podcast/wildflower-weekend-2022-are-you-coming/id1489879938?i=1000576511240"
      }
    },
    {
      "id": "ad0e7712-4ee9-4669-aea2-24ec1d0d758e",
      "title": "Exmormonology ~ What Is The Proper Response? An Essay by Amy Logan",
      "description": "Drum roll please......It is my 100th Exmormonology Episode! I am excited to share this particular episode with you. I decided to write an essay and read it to you this time around. As exmembers of the church we often hear the same responses to our faith crisis and leaving the church, over and over again. I have seen patterns in the way members of the church respond to us. I will be addressing these repeated responses in this essay. I poised it as a an essay to members of the church, but it is really for you and all the things we want to say when we hear the same rhetoric over and over. I hope it resonates with you wildflower. www.amyloganlife.com",
      "release": "2022-08-17T18:05:25Z",
      "duration": "00:34:46.0600000",
      "explicit": false,
      "spotifyId": "2aL9dryBNmM2PgakO5ge5l",
      "appleId": 1000576398286,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2aL9dryBNmM2PgakO5ge5l",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-what-is-the-proper-response-an-essay/id1489879938?i=1000576398286"
      }
    },
    {
      "id": "c99ce8dd-099f-4eb4-9bf8-fcda80fee9ac",
      "title": "Exmormonology ~ When Your Brain Is Ready",
      "description": "When is your brain ready to go down the rabbit hole? We each have our own experience and come to our awakening in our own time. I had signs along the way, relating to the church, but my brain was not ready to see it. Much like marketing and needing to see/hear something 7 times or more before we start making connections about certain issues or products or ? I want you to start looking for other areas of your life where you can maybe short cut this process. What are you not believing about yourself that you need a few nudges to see yourself in a different light, just like seeing the church in a different light? What areas of your life can you make similar paradigm shifts? Let’s talk about it this week on Exmormonology.",
      "release": "2022-08-03T17:02:02Z",
      "duration": "00:29:34.9680000",
      "explicit": false,
      "spotifyId": "6yyI24p6OvLQg7GKdp9Qkp",
      "appleId": 1000574916126,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6yyI24p6OvLQg7GKdp9Qkp",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-when-your-brain-is-ready/id1489879938?i=1000574916126"
      }
    },
    {
      "id": "ec53b9bf-2889-47b1-bd1b-a29d0e11478e",
      "title": "Exmormonology ~ Keep Showing Up",
      "description": "Pick your favorite musician and think about how many times they have performed the same songs over and over and over. Do you think they want to show up and sing each and every night, EVEN THO they love being in a band? My guess is no, not every time. However, they do it, night after night. What areas in your life are you not showing up, even tho you signed up for it? Let\u0027s dig into this topic. How do you want to show up? What matters here, your thoughts and the way you talk to yourself about the areas in your life where you \u0022struggle.\u0022 Also discussed in this episode...2nd Annual Wildflower Weekend, Airborne Toxic Event, Stake Dances, P!nk, and all things Exmormonology.",
      "release": "2022-07-15T20:24:14Z",
      "duration": "00:33:08.3360000",
      "explicit": false,
      "spotifyId": "6L2EqoEYx5xCWbrcYnfC5o",
      "appleId": 1000570055164,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6L2EqoEYx5xCWbrcYnfC5o",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-keep-showing-up/id1489879938?i=1000570055164"
      }
    },
    {
      "id": "a974cef7-9647-495d-b2ef-e4108b4faa57",
      "title": "Exmormonology ~ Reproductive Health, Roe v. Wade \u0026 Thought Work",
      "description": "What a week, lots of feelings, all the feelings. It has been a tough one for most of us. This week on Exmormonology I dive into the overturning of Roe v. Wade and how we desperately need thought work to help us through what will be quite the fight. You will need time to process your emotions and then you will need to figure out how to create new thoughts that help you out of hopelessness. New thoughts that keep you out of stuckville. You are capable of doing this, it is possible. It is okay if right now you are in shock and feel overwhelming depressed and angry. I understand these emotions, we dance together often. I am doing this work too wildflower. I hope you will tune in. This is one of my favorite episodes of Exmormonology. I hope it is helpful for you as you work through all the feelings coming up for you. I love you, you are not alone.",
      "release": "2022-06-30T19:24:51Z",
      "duration": "00:35:50.7910000",
      "explicit": false,
      "spotifyId": "58EuFf7pQAfggsDg0IfSdM",
      "appleId": 1000568346492,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/58EuFf7pQAfggsDg0IfSdM",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-reproductive-health-roe-v-wade-thought-work/id1489879938?i=1000568346492"
      }
    },
    {
      "id": "edffa4c6-3a22-4b2b-bec1-09746d963079",
      "title": "Exmormonology ~ Time",
      "description": "Do you find yourself saying....I need to hurry. I gotta get it done. I am so busy. I never have enough time. I wish there was more time in the day. Wildflower, if you find yourself saying these words, this episode is for you. Our experience growing up in a culture focused on forever and the next life may be playing a bigger part in your life than you know. Let\u0027s explore the construct of time and you can slow down and enjoy more moments in THIS life.",
      "release": "2022-06-15T19:13:06Z",
      "duration": "00:44:50.0890000",
      "explicit": false,
      "spotifyId": "5qVVotSKMkXsGkGvmBBbx4",
      "appleId": 1000566551306,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qVVotSKMkXsGkGvmBBbx4",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-time/id1489879938?i=1000566551306"
      }
    },
    {
      "id": "3e77146b-18ef-4410-9fc8-9f2604391af7",
      "title": "Exmormonology ~ Abortion, A Conversation w/ Amanda Kingsley",
      "description": "We do not back away from hard conversations here on Exmormonology and with the pending reversal of Roe V. Wade, I wanted to talk about Abortion. I have invited Amanda Kingsley to be a guest today. Amanda Kingsley is a Certified Feminist Life Coach and Doula. She is the host of the Speaking Light Into Abortion podcast. And the Author of ‘What I Wish: 100 love notes to help you survive, come alive, and thrive after abortion.’ After her own unanticipated abortion as a mother of three, she recognized the need for a wider conversation around the complex emotional landscape of life after abortion. She reminds her audience that it’s okay to feel all the feelings after abortion, and that we can honor our decisions by living the life we made our choice for. You can learn more and connect with her at www.amandastarkingsley.com IG @amandastarkingsley",
      "release": "2022-06-10T14:53:33Z",
      "duration": "01:00:41.3120000",
      "explicit": false,
      "spotifyId": "7o1vTXctVv1lcGLiWNTvHD",
      "appleId": 1000565976338,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7o1vTXctVv1lcGLiWNTvHD",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-abortion-a-conversation-w-amanda-kingsley/id1489879938?i=1000565976338"
      }
    },
    {
      "id": "0eb800ca-a895-4b0d-80cf-0d91c49e1bb1",
      "title": "Exmormonology ~ Happy Pride! \u0026 I Don\u0027t Know Who I\u0027d Be",
      "description": "Happy Pride Month! I celebrate you and love you so much! This week let\u0027s talk about showing up authentically and why it is so hard to do so. Remember the phrase we have heard over and over at church...\u0022I don\u0027t know who I would be without the church in my life?\u0022 What??? Let\u0027s change that verbiage. That thought is not helpful as you navigate this new road. New roads require new thoughts. Let\u0027s go!",
      "release": "2022-06-03T22:47:59Z",
      "duration": "00:20:24.2800000",
      "explicit": false,
      "spotifyId": "2YfQun6hJgJEwzKcDCdCHo",
      "appleId": 1000565170234,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2YfQun6hJgJEwzKcDCdCHo",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-happy-pride-i-dont-know-who-id-be/id1489879938?i=1000565170234"
      }
    },
    {
      "id": "4dd5ab28-2552-4256-bfa2-fb618c3b9d0f",
      "title": "Exmormonology ~ Forever and Ever",
      "description": "Have you stopped to think about how the concept of \u0022forever\u0022 may be tripping you up? If you have been raised in a religious faith tradition, you know the theology around forever is a regular topic of conversation. Making it back to heaven, to live with God, is the whole point of this life. We are being tested, right? You may have left your religion, but have you examined whether those thoughts you have tied to \u0022forever\u0022 may be affecting your thoughts and feelings in subconscious ways, in THIS life? I want to talk all about how the concept of forever may be playing tricks on your brain.",
      "release": "2022-04-20T22:31:04Z",
      "duration": "00:28:32.7180000",
      "explicit": false,
      "spotifyId": "2DdF2eSINV2SYJvrlK9v3q",
      "appleId": 1000558201680,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2DdF2eSINV2SYJvrlK9v3q",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-forever-and-ever/id1489879938?i=1000558201680"
      }
    },
    {
      "id": "6820226c-ab4c-46ef-9fe8-804a296a7b0e",
      "title": "Exmormonology ~ Trust Issues",
      "description": "If you have experienced any kind of betrayal, abandonment, manipulation, etc. you may have uttered the words \u0022I have trust issues.\u0022 I know there is a lot to this topic and your life is very multilayered, but today I want to talk to you about why it may be time to change up that phrase. Every time your brain thinks, I have trust issues and you believe it, you have trust issues. By doing this you most likely build up a huge wall around your heart and you don\u0027t let anyone in and therefore you keep stuck in the round and round of having trust issues. Let\u0027s do some thought work around this issue and how you can turn it around and start trusting yourself.",
      "release": "2022-04-02T21:48:47Z",
      "duration": "00:17:53.2400000",
      "explicit": false,
      "spotifyId": "5z2SuXOpsolbLBdEMZBsfE",
      "appleId": 1000556049751,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5z2SuXOpsolbLBdEMZBsfE",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-trust-issues/id1489879938?i=1000556049751"
      }
    },
    {
      "id": "fe655638-2e32-46c9-ad62-091f3e978c6e",
      "title": "Exmormonology ~ Dreaming",
      "description": "A little bit of tough love coming your way this week via Exmormonology. You hold all the power inside of you to create the life you want, yet your brain is stuck on the hamster wheel of thoughts that tell you you can\u0027t. Stop it! Stop believing those thoughts. I am going to tell you exactly how to do that this week. Buckle up!",
      "release": "2022-03-25T18:06:30Z",
      "duration": "00:24:25.0250000",
      "explicit": false,
      "spotifyId": "1kWZ0WVElU2nBBg6agAWoo",
      "appleId": 1000555246263,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kWZ0WVElU2nBBg6agAWoo",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-dreaming/id1489879938?i=1000555246263"
      }
    },
    {
      "id": "b2f4bbdf-bb0b-47e1-ab83-68cc379ff302",
      "title": "Exmormonology Bonus ~ The Irreverent Sessions",
      "description": "Grab a beverage of your choice and schooch in really close. Let\u0027s get a little bit irreverent today as Jim and I talk about \u0022choosing\u0022 the path of the straight and narrow. Was it really a choice? That is the Q, isn\u0027t it?! We actually recorded this episode right before Christmas, so when we reference cheersing \u0022balls,\u0022 we are talking about the balls on the Christmas tree, so you know it is going to be good! HA!",
      "release": "2022-03-17T00:00:00",
      "duration": "01:17:15.8200000",
      "explicit": false,
      "spotifyId": "0JEcMdTEgWBYSwx30voNRd",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0JEcMdTEgWBYSwx30voNRd"
      }
    },
    {
      "id": "9b6d7850-e584-4e5a-b2c3-2e42d4e98d8f",
      "title": "Feminism After Religion Group Coaching Program",
      "description": "Feminism After Religion Group Coaching Course is now open for registration! Join me and 8 other amazing humans as we dive into what Feminism is and how your post religious brain is most likely still steeped in all things patriarchy. When we can see your brain on patriarchy we can deconstruct so many areas in your life where you feel stuck. I have 4 spots left and I hope you in one of them! We start class April 11, 2022.",
      "release": "2022-03-16T00:20:45Z",
      "duration": "00:07:19.3270000",
      "explicit": false,
      "spotifyId": "11vKYoVJxZ7sR92DJScDMq",
      "appleId": 1000554150395,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/11vKYoVJxZ7sR92DJScDMq",
        "apple": "https://podcasts.apple.com/podcast/feminism-after-religion-group-coaching-program/id1489879938?i=1000554150395"
      }
    },
    {
      "id": "0284f440-fa25-4b9c-9b2e-e4b94513b508",
      "title": "Exmormonology ~ The Blame Game",
      "description": "How much power have you given away by blaming someone else for how you feel? Most of us do this all the time. It is so much easier to stay in a constant state of blame, meaning it is everyone else\u0027s fault for how we feel. Today I want to talk to you about setting down the blame and leaning into deciding how to take full responsibility for all your emotions. No other person gets to determine how you think and feel about yourself. Once you learn how to take full responsibility for your thoughts and emotions, you become unstoppable. Before you tell yourself this is too hard, just be open to believing this is possible for you. That is where you start, with the belief that it is possible. This is why what you think about yourself matters way more than what anyone else thinks of you.",
      "release": "2022-03-06T16:51:34Z",
      "duration": "00:30:48.3980000",
      "explicit": false,
      "spotifyId": "3sy0YqGKhLifrx3KGWr9HK",
      "appleId": 1000553082046,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sy0YqGKhLifrx3KGWr9HK",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-blame-game/id1489879938?i=1000553082046"
      }
    },
    {
      "id": "c5414dd6-c8d9-4153-97a6-59a4b8c98134",
      "title": "Exmormonology ~ The Wild Wild West ExMormon Edition",
      "description": "Navigating the the world of post mormonville takes a minute (or years). Imma gunna give you a little bit of tough love. I am a bit on fire in the episode, but I ease you into it. I start with a few minutes telling you all about Truman, our new pup! Truth of the matter is it is the Wild Wild West in the world of exmormondom. Proceed with caution. Let\u0027s go.",
      "release": "2022-02-22T19:00:29Z",
      "duration": "00:31:43.9080000",
      "explicit": false,
      "spotifyId": "2QkWJMUIJWEDVU62SPQZZB",
      "appleId": 1000551916622,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QkWJMUIJWEDVU62SPQZZB",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-wild-wild-west-exmormon-edition/id1489879938?i=1000551916622"
      }
    },
    {
      "id": "12a773fb-e823-491e-8329-f65489a0d36f",
      "title": "Exmormonology ~ Shedding",
      "description": "No rush, no race, to your healing journey. I know we do not like the feelings that our religious, spiritual life crisis created, but it is part of the ride. I want to talk to you today about what it really means to shed and release the more difficult parts of this process and why being gentle with yourself is going to help soothe your soul.",
      "release": "2022-01-28T05:39:18Z",
      "duration": "00:20:25.0640000",
      "explicit": false,
      "spotifyId": "0hpeEzBGApNufLhnuNKkYF",
      "appleId": 1000549246108,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hpeEzBGApNufLhnuNKkYF",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-shedding/id1489879938?i=1000549246108"
      }
    },
    {
      "id": "8d9b1f25-dab4-4bcf-89dc-974eeb728197",
      "title": "Exmormonology ~ Future Focus",
      "description": "A new year brings new ideas and the intention to perfect your life. You make a list and then think that in order to create happiness for yourself you need to accomplish all the things on your list. Then when the 3rd week of January rolls around and you have fallen off the wagon and you start feeling like you are never going to be good enough and you give up. This week I want to teach you how you can look at goal setting with new eyes, new thoughts and better feelings. Ready? Let\u0027s go! Exmormonology Ep. 87 Future Focus.",
      "release": "2022-01-22T21:09:16Z",
      "duration": "00:20:50.3510000",
      "explicit": false,
      "spotifyId": "48yxdXmVpwNM7e5DZllXH5",
      "appleId": 1000548688248,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/48yxdXmVpwNM7e5DZllXH5",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-future-focus/id1489879938?i=1000548688248"
      }
    },
    {
      "id": "973a13fb-c2cc-4b2b-a126-d215a92774f0",
      "title": "Exmormonology 2022 \u002B The Plan",
      "description": "Year 3 of Exmormonology has begun! Today I want to talk about how I plan to move forward and through 2022 and the direction of the content you will continue to receive via my podcast. I have several fun events planned for this year and I can\u0027t wait to share them with you. Which one(s) will you be joining me? You do get to feel better in this life. Do not believe the thoughts that trick you into thinking that you are not enough, not worthy and not worth it. \u0022It\u0022 being the thought work that will help you feel like you are the boss of your brain and not all the \u0022toxic\u0022 and \u0022drama filled\u0022 people in your life. I am here to help you through it all! Ready Wildflower? Let\u0027s start this year off with commitment to improving your mental health.",
      "release": "2022-01-13T19:37:52Z",
      "duration": "00:16:33.8280000",
      "explicit": false,
      "spotifyId": "0a6jhvskpGeM8iprP6nMOG",
      "appleId": 1000547816518,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0a6jhvskpGeM8iprP6nMOG",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-2022-the-plan/id1489879938?i=1000547816518"
      }
    },
    {
      "id": "38cec861-7fcc-4b62-83eb-1c782f48d274",
      "title": "Exmormonology ~ A Love Note",
      "description": "Day 12 of our Exmormonology Mini Series, 12 Days of Post Mormon Christmas ~ Day 12. Keeping it really simple today, a love note from me to you. I hope your day is beautiful.",
      "release": "2021-12-25T19:54:45Z",
      "duration": "00:05:00.0680000",
      "explicit": false,
      "spotifyId": "1nYlha1ttl1yyY0QPYv1WM",
      "appleId": 1000546107884,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1nYlha1ttl1yyY0QPYv1WM",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-a-love-note/id1489879938?i=1000546107884"
      }
    },
    {
      "id": "1ec49ef5-dcf3-426f-b30c-9747897d770c",
      "title": "Exmormonology ~ Family",
      "description": "Okay, you are most likely heading into big time family time today and tomorrow. If you want more connection with your family this holiday season, I want to guide you through a method that I use to help me find more genuine connection with my family. I know it does not seem fair to put in work to make this happen when you are already doing so much healing work in relation to your faith/identity shift. I get it. But, here we are. Let\u0027s figure it out together. Exmormonology 12 Days of Post Mormon Christmas Day 11, Family.",
      "release": "2021-12-24T18:46:34Z",
      "duration": "00:09:19.4640000",
      "explicit": false,
      "spotifyId": "7uta76AaMoZLEDl4x7fjuG",
      "appleId": 1000546056497,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7uta76AaMoZLEDl4x7fjuG",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-family/id1489879938?i=1000546056497"
      }
    },
    {
      "id": "70fe2cf3-ded3-45f5-80ea-480371e79b63",
      "title": "Exmormonology ~ Holiday Anxiety",
      "description": "Today we are talking about anxiety during the holidays and how it may be intensified post faith/identity crisis. I want to give you some concrete things you can do to help you lessen the anxiety you may be feeling as you head into holiday gatherings. Pay attention to your brain as you listen to my suggestions. You may find some resistance. That is okay, just notice it as it comes up and stay with me. It makes sense that your brain wants to protect you. That is your brains job. Okay, let\u0027s go.",
      "release": "2021-12-23T17:51:57Z",
      "duration": "00:07:40.7730000",
      "explicit": false,
      "spotifyId": "3b14pNZlMlamUAWHpbk7a6",
      "appleId": 1000545941224,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3b14pNZlMlamUAWHpbk7a6",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-holiday-anxiety/id1489879938?i=1000545941224"
      }
    },
    {
      "id": "2474b275-6780-4c6e-85c3-101cbb873ad5",
      "title": "Exmormonology ~ A Down \u0026 Dirty",
      "description": "Day 9 of our mini Exmormonology 12 Days of Post Mormon Christmas series is a very quick, down and dirty, reminder for you this holiday season. It is simple but HUGELY important. I do not want to give it away, but please take the 4:16 mins to listen to this episode. I hope it is helpful!",
      "release": "2021-12-21T20:07:18Z",
      "duration": "00:04:16.8620000",
      "explicit": false,
      "spotifyId": "6ysvyyktJi9nnuhyRd4Zw5",
      "appleId": 1000545681967,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ysvyyktJi9nnuhyRd4Zw5",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-a-down-dirty/id1489879938?i=1000545681967"
      }
    },
    {
      "id": "99f634a4-c59f-47a7-8ae5-b060a3187647",
      "title": "Exmormonology ~ Music",
      "description": "Day 8 of 12 Days of Post Mormon Christmas. If you have been listening to Exmormonology for any amount of time, you know that I believe...music is life! So, what do we do about Christmas music??? Are you loving it still? Hate it? Avoiding it? Let\u0027s talk about a few ideas of what you can do in and on Day 8 of our mini Exmormonology series.",
      "release": "2021-12-19T01:06:51Z",
      "duration": "00:10:31.5880000",
      "explicit": false,
      "spotifyId": "7KTdJCmiv0DKCAPpgaDzZP",
      "appleId": 1000545388800,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KTdJCmiv0DKCAPpgaDzZP",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-music/id1489879938?i=1000545388800"
      }
    },
    {
      "id": "b45e1ca3-2b33-407b-83d8-0c33c7eb7a6d",
      "title": "Exmormonology ~ Jesus",
      "description": "Twelve Days of Post Mormon Christmas, Day 7. Let\u0027s talk about Jesus, shall we? If you are struggling to reconcile Jesus and Christmas and what you believe, tune in. I mean, Jesus is the reason for the season right? Maybe, but that is up to you. I want to walk you through the thought process that helped me navigate this uncomfortable space during the holidays, especially early in my deconstruction years. Please listen to the very very end of this Exmormonology episode.",
      "release": "2021-12-16T20:49:27Z",
      "duration": "00:07:14.0760000",
      "explicit": false,
      "spotifyId": "7mysRSjoatjLhaN35s02rR",
      "appleId": 1000545210879,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7mysRSjoatjLhaN35s02rR",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-jesus/id1489879938?i=1000545210879"
      }
    },
    {
      "id": "22961e87-0a79-49ad-b404-a07f2f9c87f3",
      "title": "Exmormonology ~ Holiday People Pleasing",
      "description": "Is the people pleasing in you showing up big time right now? If so, this Exmormonology Ep. is for you. If you grew up with any kind of religious conditioning, you will relate. So, stop what you are doing and tune it.",
      "release": "2021-12-14T21:11:49Z",
      "duration": "00:05:50.7200000",
      "explicit": false,
      "spotifyId": "3WiyPrARa4eyss3gpXmxCC",
      "appleId": 1000544979597,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WiyPrARa4eyss3gpXmxCC",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-holiday-people-pleasing/id1489879938?i=1000544979597"
      }
    },
    {
      "id": "1d7b3cea-a313-45ab-8bfd-0283a31d65dc",
      "title": "Exmormonology ~ Christmas and Tradition",
      "description": "Day 5 ~ Isn\u0027t the post religious deconstruction process interesting? The ripple effect of your proverbial shelf crashing down can be overwhelming. So, if you are finding the holiday season feeling a bit too much, you are not alone. In our Day 5 of The 12 Days of Post Mormon Christmas, I want to dive into the meaning and reasons for tradition. Let\u0027s not let traditions of yesteryear keep you tied down. We are busting through all the things this year!",
      "release": "2021-12-12T22:19:07Z",
      "duration": "00:10:48.3330000",
      "explicit": false,
      "spotifyId": "3J1Yn9jvOTeEpQw4wRLVvd",
      "appleId": 1000544743979,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3J1Yn9jvOTeEpQw4wRLVvd",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-christmas-and-tradition/id1489879938?i=1000544743979"
      }
    },
    {
      "id": "ab7e4f6b-337c-48ac-a10c-f8292f554ba3",
      "title": "Exmormonology ~ A Las Vegas Christmas",
      "description": "Exmormonology\u0027s 12 Days of Post Mormon Christmas ~ Day Four ~ A Las Vegas Christmas. Let\u0027s continue on with outside the \u0022traditional\u0022 Christmas lines. As you may deduct from this title, Jim and I spend a Christmas in Las Vegas and it was nothing like I thought it was going to be.",
      "release": "2021-12-10T15:27:17Z",
      "duration": "00:06:02.4750000",
      "explicit": false,
      "spotifyId": "2veieEhQ4IIvTjCmnpq0wp",
      "appleId": 1000544577736,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2veieEhQ4IIvTjCmnpq0wp",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-a-las-vegas-christmas/id1489879938?i=1000544577736"
      }
    },
    {
      "id": "35e009de-b14d-4337-a5a7-5b978bc01737",
      "title": "Exmormonology ~ Outside The Christmas Lines",
      "description": "Give yourself the permission to do Christmas differently.",
      "release": "2021-12-08T23:40:45Z",
      "duration": "00:10:57.6580000",
      "explicit": false,
      "spotifyId": "4EvFFetPDvCaXN8o5AMMrO",
      "appleId": 1000544369912,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EvFFetPDvCaXN8o5AMMrO",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-outside-the-christmas-lines/id1489879938?i=1000544369912"
      }
    },
    {
      "id": "0d226cc0-614f-48fc-bf13-3137bcffe254",
      "title": "Exmormonology ~ Day Two ~ 12 Days of Post Mormon Christmas: Sadness \u0026 Grief",
      "description": "If you are a wildflower that struggles through the Christmas season, this mini Exmormonology episode is for you, especially if you are not sure what to do with Christmas now that you are no longer a believer or not sure what you believe anymore. Don\u0027t run away from these tender feelings. Let\u0027s talk about how to honor them.",
      "release": "2021-12-06T18:47:52Z",
      "duration": "00:06:46.7780000",
      "explicit": false,
      "spotifyId": "1D97jXO9GyA48JS1lNZrIQ",
      "appleId": 1000544127712,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1D97jXO9GyA48JS1lNZrIQ",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-day-two-12-days-of-post-mormon/id1489879938?i=1000544127712"
      }
    },
    {
      "id": "9ebebb1f-fdd8-4335-8ca6-d0154ce85fdc",
      "title": "Exmormonology ~ 12 Days of Post Mormon Christmas, Day One",
      "description": "Are you finding “The Holidays” have a completely different feel to it now, post mormon? Navigating the holidays can be a hard time without adding the layer of your faith transition. So, over the course of the next two weeks, I want to give you mini Exmormonology Episodes that can help you as you decide what you want this time of year to mean for you. Contrary to what your brain is presenting you, you have more options than you think. I want you to start with the current manual you have for what the holidays are supposed to be about. When you can see the difference between your current manual and what you want, you will feel free to change it up if you want to. Let’s flush this out and change it up. It is up to you Wildflower.",
      "release": "2021-12-04T20:21:25Z",
      "duration": "00:12:05.5770000",
      "explicit": false,
      "spotifyId": "7tugySGqLJKKOxdnAPCAw2",
      "appleId": 1000543957931,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tugySGqLJKKOxdnAPCAw2",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-12-days-of-post-mormon-christmas-day-one/id1489879938?i=1000543957931"
      }
    },
    {
      "id": "229d2fd2-d80a-4a87-86ed-3c0bdce267cd",
      "title": "Exmormonology ~ Dwelling In Possibility",
      "description": "Wildflower, get your pen and paper ready for this Exmormonology Episode. My intention for you is to get your brain working for you instead of against you and to make this happen you will need to be an active participant in your life and in your healing. It is easy to be a consumer of information, but to make small AND big changes in your life you need to prime your brain. So, let\u0027s walk towards dream land and start creating what you want your life to be like. Okay?! yay! Let\u0027s go!",
      "release": "2021-11-20T20:57:59Z",
      "duration": "00:27:35.5620000",
      "explicit": false,
      "spotifyId": "22LpjyIMcyiISuRwh9SnZ7",
      "appleId": 1000542571065,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22LpjyIMcyiISuRwh9SnZ7",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-dwelling-in-possibility/id1489879938?i=1000542571065"
      }
    },
    {
      "id": "838dc87d-80ca-4522-b65b-e814d3ea3f7f",
      "title": "Exmormonology ~ Finding Yourself (Recorded in New York)",
      "description": "It is normal for you to feel a bit lost after your mormon faith crisis. I mean, when your life narrative has been removed and you feel left grappling in the dark, it can feel very lonely and confusing. Today, I want to talk about what to do about it and how you can start rephrasing this chapter of your life. Many of us feel like we have to \u0022find ourselves\u0022 and that thought alone can be overwhelming. Where does one look to find themselves? In the back of the spare bedroom closet? Under the throw blanket on the couch? Nah, that is not how this works. The answer is quite simple and not as daunting as you may be thinking. Let\u0027s have some fun with finding yourself!",
      "release": "2021-11-13T23:01:38Z",
      "duration": "00:20:26.8930000",
      "explicit": false,
      "spotifyId": "42j01QzVbIfx1LMf3p7Hkm",
      "appleId": 1000541709207,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/42j01QzVbIfx1LMf3p7Hkm",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-finding-yourself-recorded-in-new-york/id1489879938?i=1000541709207"
      }
    },
    {
      "id": "7b7ca5c0-77a8-4f36-b6e8-24b6a3672501",
      "title": "Exmormonology ~ Finding The Proof",
      "description": "Researching and staying abreast of all things mormon is a common part of mormon deconstruction. We want to find the perfect proof to show our loved ones how we came to our decision to leave the church. Or at least make sure we have crossed our Ts and dotted our Is, because, you know...our eternal salvation and all. Makes sense, right? Let\u0027s talk about why we do this and when it may be time to stop, or at least reduce the time spent looking.",
      "release": "2021-11-08T20:48:04Z",
      "duration": "00:21:18.3280000",
      "explicit": false,
      "spotifyId": "4wZSMVem1eClsBxRB3XaLY",
      "appleId": 1000541160588,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wZSMVem1eClsBxRB3XaLY",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-finding-the-proof/id1489879938?i=1000541160588"
      }
    },
    {
      "id": "b46b3406-9edf-4849-b522-8739d9474b92",
      "title": "Exmormonology ~ My Affair and My Shame",
      "description": "The title says it all really. If you have ever felt the difficult feeling of shame, I hope this episode gives you permission to start letting go. It is possible.",
      "release": "2021-10-28T14:55:55Z",
      "duration": "00:19:16.4140000",
      "explicit": false,
      "spotifyId": "5mEzQstPeCNd2UhW2BZSzz",
      "appleId": 1000540026467,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5mEzQstPeCNd2UhW2BZSzz",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-my-affair-and-my-shame/id1489879938?i=1000540026467"
      }
    },
    {
      "id": "c16a7702-a1c3-42a4-bf55-fbf2baf5d4b5",
      "title": "Exmormonology ~ Sexuality and You",
      "description": "So many layers to unravel after you deconstruct mormonism. Sex, sexuality, and sexual Identity and orientation are all part of the process. This week I want to share some of the personal pieces of my post mormon story as it relates to self pleasure, free falling in Hollywood, and figuring out some things about my sexual stereotypes and how sometimes we have to stumble around in the dark to figure it all out. We have talked about how we, as exmormons, initially feel very infantile as we remove the rose colored glasses from our existence, here on Exmormonology. Giving yourself permission to explore and figure things our for yourself is a huge piece of your healing. It can be hard with the thought that contribute to guilt and shame. Let\u0027s bust through that together.",
      "release": "2021-10-23T20:16:59Z",
      "duration": "00:33:22.2070000",
      "explicit": false,
      "spotifyId": "0M1qeSRLqOcnwXzi2Ydt9T",
      "appleId": 1000539497636,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0M1qeSRLqOcnwXzi2Ydt9T",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-sexuality-and-you/id1489879938?i=1000539497636"
      }
    },
    {
      "id": "f1f04d81-ec17-4ac3-bb09-a971dff091bf",
      "title": "Exmormonology ~ CTR vs. CTW",
      "description": "Choose The Right vs. Choose The Wrong ~ The psychological implications from the \u0022innocent\u0022 mormon acronym CTR are pretty big and may be playing a bigger role in your post mormon healing than you think. This week on Exmormonology I break it down for you so you can see what you are up against with your religious deconstruction.",
      "release": "2021-10-15T16:45:00Z",
      "duration": "00:18:34.0170000",
      "explicit": false,
      "spotifyId": "4MX6dPSPfvZzlwH6J8GrTt",
      "appleId": 1000538712524,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4MX6dPSPfvZzlwH6J8GrTt",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-ctr-vs-ctw/id1489879938?i=1000538712524"
      }
    },
    {
      "id": "eb386173-1c43-4213-8f06-e536174de652",
      "title": "Exmormonology ~ The Emotional Time Capsule",
      "description": "Let\u0027s talk about our feelings, shall we? In this episode of Exmormonology I want to talk about what happens if you are in the habit of putting your emotions in The Emotional Time Capsule. The ETC is the collection of all the feelings you would rather not feel and so you tuck them away and hope that you never need to unearth/feel those emotions. If it only worked that way, right? Your overall generalized anxiety is most likely caused from all of the emotions you are not wanting to sit with and feel all the way through. Grab your ear buds and lean in wildflower, I have a feeling this episode is going to help you understand what is going on in your brain and in your heart.",
      "release": "2021-10-07T22:14:48Z",
      "duration": "00:29:49.9100000",
      "explicit": false,
      "spotifyId": "3KB5X8Oy2Wz8uBJkvblfoO",
      "appleId": 1000537908694,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3KB5X8Oy2Wz8uBJkvblfoO",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-emotional-time-capsule/id1489879938?i=1000537908694"
      }
    },
    {
      "id": "1b4ab8a6-e54e-4d6e-9e9c-71f1ec799977",
      "title": "Exmormonology ~ A Conversation w/ A\u0027Lea Harris, Our Bodies pt. 2",
      "description": "If you missed the first part of our convo, go listen to Ep. 65 first! In part two of our discussion we continue with A\u0027Lea\u0027s thoughts and feelings as she steps into navigating polyamory with her husband, mindfulness, Peter and getting \u0022out of the boat\u0022, modesty standards and family, body positivity and how it has changed, racism and body image, confessing your sexual past with your future spouse (TBM style) and so much more! If you missed the first part of our convo, go listen!!!",
      "release": "2021-09-21T15:32:14Z",
      "duration": "00:52:51.5260000",
      "explicit": false,
      "spotifyId": "5uPx0kYB7waHVayiEyrzxy",
      "appleId": 1000536165683,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5uPx0kYB7waHVayiEyrzxy",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-a-conversation-w-alea-harris-our-bodies-pt-2/id1489879938?i=1000536165683"
      }
    },
    {
      "id": "c5d25379-bf2d-4755-b649-8d5278b9cd7c",
      "title": "Exmormonology ~ A Conversation with A\u0027Lea Harris, Our Bodies",
      "description": "This is a first for Exmormonology! A\u0027Lea Harris and I sit down for a conversation around all things body. So many of us have a love hate relationship with our bodies and it often consumes so much of our brain space, even when we think we are not thinking about it. We spend a lifetime trying to love ourselves and love the body we are in. The struggle is real. This conversation is rich. We peel back so many layers and discuss the multifaceted influences that contribute the thoughts and feelings we have with our body. I hope you love this conversation. You can find A\u0027Lea at all your favorite social media places. @badd_woolf Enjoy!",
      "release": "2021-09-20T21:27:51Z",
      "duration": "00:56:10.4220000",
      "explicit": false,
      "spotifyId": "3a1flTYxuD645kxzFZCZBx",
      "appleId": 1000536072284,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3a1flTYxuD645kxzFZCZBx",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-a-conversation-with-alea-harris-our-bodies/id1489879938?i=1000536072284"
      }
    },
    {
      "id": "68574e8e-e78b-4503-9e15-9390268cc78c",
      "title": "Exmormonology ~ The Recovering Good Girl",
      "description": "I am calling this Exmormonology episode \u0022The Recovering Good Girl.\u0022 So many layers to shed when deconstructing from a high demand religion, so many if fact that it can feel very overwhelming. This week let\u0027s talk about how many of us have been shaped into good girls and what we can do about it. If even the thought of being a good girl grates at you, tune in, this is going to be a good one.",
      "release": "2021-09-13T20:49:09Z",
      "duration": "00:25:25.4460000",
      "explicit": false,
      "spotifyId": "0cmtEbDwWc21nKXlxXUxgw",
      "appleId": 1000535221557,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0cmtEbDwWc21nKXlxXUxgw",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-recovering-good-girl/id1489879938?i=1000535221557"
      }
    },
    {
      "id": "0b0ab56f-bfa9-4eb6-90d5-9f1380a5302c",
      "title": "Exmormonology ~ Words",
      "description": "It was a big week in mormon / exmormon dom. Jeffery R. Holland said words and we are going to talk about it. Yep, we are going THERE. I want to offer love, compassion and some coaching on Holland\u0027s speech given at BYU\u0027s welcome to the 2021/22 academic school year program. Learning to manage your mind does not mean you do not get fired up or angry about things. It is about learning to process those feelings and then channel your emotions in the direction you want to go. Let\u0027s dive into this very emotionally charged speech.",
      "release": "2021-08-27T19:18:42Z",
      "duration": "00:30:19.1150000",
      "explicit": false,
      "spotifyId": "7taspRKaAhplQgRLbn4reZ",
      "appleId": 1000533338096,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7taspRKaAhplQgRLbn4reZ",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-words/id1489879938?i=1000533338096"
      }
    },
    {
      "id": "6180027f-2fb9-4a2c-a624-ce5a757d1251",
      "title": "Exmormonology ~ Underneath The Anger",
      "description": "This week\u0027s Exmormonology episode is a follow up to last week episode on Anger. Anger is a secondary emotion, but I wanted to start with anger because it seems to be a very loud uncomfortable one. This week we are going to find the other emotion(s) and I am going to teach you how to and what to do with it once you find it. Life is a full spectrum of emotions and being able to sit with and process the more difficult ones well help you with all that comes with being human.",
      "release": "2021-08-20T16:35:30Z",
      "duration": "00:21:47.3760000",
      "explicit": false,
      "spotifyId": "78qx8mQr60GfprZSGZw4C5",
      "appleId": 1000532611294,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/78qx8mQr60GfprZSGZw4C5",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-underneath-the-anger/id1489879938?i=1000532611294"
      }
    },
    {
      "id": "82b89029-5156-4794-b732-ab47c28061df",
      "title": "Exmormonology ~ Anger",
      "description": "If you are experiencing a faith/truth/identity crisis in any form, but especially from religious trauma, you have felt anger. This week in Exmormonology I break anger down for you and explain what is going on and why. Next week I will follow up with what is under the anger. To sum it up.....everything. Anger is okay. Anger is telling you there is something wrong. Listen to it, let it be there and know when it is time to do something about it.",
      "release": "2021-08-04T16:06:10Z",
      "duration": "00:28:33.2400000",
      "explicit": false,
      "spotifyId": "6IPE04dWP96j01Ojfhzkht",
      "appleId": 1000530998812,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6IPE04dWP96j01Ojfhzkht",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-anger/id1489879938?i=1000530998812"
      }
    },
    {
      "id": "f3234dd6-3dce-40d2-b58a-ad5b92b3c640",
      "title": "Exmormonology ~ You Can\u0027t Convince Anyone Of Anything",
      "description": "The desire to try and show your mormon family how the church is not \u0022true,\u0022 after you go through your own awakening from mormonism is strong. We feel that if they thought the same way, we would get to feel (_____________). Let\u0027s talk about how you can\u0027t really do this and how you can feel the feeling you are wanting to feel anyway. You really can\u0027t convenience anyone of anything.",
      "release": "2021-06-26T19:06:39Z",
      "duration": "00:20:33.5280000",
      "explicit": false,
      "spotifyId": "7manZ4HMLONj5bUCyFblw2",
      "appleId": 1000526965734,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7manZ4HMLONj5bUCyFblw2",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-you-cant-convince-anyone-of-anything/id1489879938?i=1000526965734"
      }
    },
    {
      "id": "f7188827-2909-48b4-9563-c95bebe82ed4",
      "title": "Exmormonology ~ An Intimate Interview with Amy Logan, Pt. 2",
      "description": "Part 2 of my interview with Jim. He certainly knows how to push me to places I didn’t know we were going. This interview, for me was very reflective of my life as a mormon and the endless layers of unraveling as I went through my faith crisis. We discuss... the precipice feeling alone the mormon agenda the strength a mormon faith crisis takes what can the church do now? my early youtube channel \u0026 soul searching girl post mormon confidence modesty the culture of the church and gaslighting perfection when it is time to start moving on worthiness interviews dealing with trolls being your own guru betrayal my post mormon brain the messy process of life looking behind the facade Thank you so much for listening to my podcast. I hope you are finding healing along your path of discovery. I am here and would love to coach you through it all. I know this journey well and I know you are going to be okay. Please leave an iTunes review if you have found Exmormonology to be helpful along your journey Amy xo",
      "release": "2021-06-18T01:43:29Z",
      "duration": "00:55:38.1610000",
      "explicit": false,
      "spotifyId": "2wHcMfIrdCwYAEMrUk4NAm",
      "appleId": 1000525949880,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2wHcMfIrdCwYAEMrUk4NAm",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-an-intimate-interview-with-amy-logan-pt-2/id1489879938?i=1000525949880"
      }
    },
    {
      "id": "ecb5f67d-6982-468c-b0be-139475abc1a6",
      "title": "Exmormonology ~ An Intimate Interview with Amy Logan, Pt.1",
      "description": "Jim turns the mic around and ask me some questions that I have never been asked before in regards to my mormon faith crisis. What a person goes through as they are deconstructing their religious brain is very intense. The thoughts and feelings seem to come at you so fast, you often cannot make sense of it all. You feel overwhelmed, betrayed and lonely. I did too. Take a walk with me, down memory lane as I share with you stories I have never spoken about publicly as my brain deconstructed all of it and how I came back to myself. Part One.",
      "release": "2021-06-10T18:44:36Z",
      "duration": "00:51:18.0600000",
      "explicit": false,
      "spotifyId": "1qQYnqU8YZcCGQre1oaVyD",
      "appleId": 1000524982374,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1qQYnqU8YZcCGQre1oaVyD",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-an-intimate-interview-with-amy-logan-pt-1/id1489879938?i=1000524982374"
      }
    },
    {
      "id": "53a2e9a1-0dc7-4d91-b640-b756fa682afd",
      "title": "Exmormonology ~ Breaking The Chain",
      "description": "It is easy to let panic set in when we see the damage and harm being done in the mormon church. We often feel like we need to get everyone out of the burning house, so to speak. I get it, I really do, but I want you to step back and see the importance of breaking the chain. YOU have done this and because you have done this, the ripple effect will go on for generations. Learning how to manage your mind around all aspects of leaving the church will pay huge dividends in your future, let\u0027s talk more about it in this week\u0027s Exmormonology.",
      "release": "2021-05-31T20:34:25Z",
      "duration": "00:29:17.9100000",
      "explicit": false,
      "spotifyId": "3y78YnPD8ct5BqCY88d5kJ",
      "appleId": 1000523702892,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3y78YnPD8ct5BqCY88d5kJ",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-breaking-the-chain/id1489879938?i=1000523702892"
      }
    },
    {
      "id": "571eaba0-07f0-4076-a6ef-fb7dd62e05c1",
      "title": "Exmormonology ~ You Are Speaking A Foreign Language",
      "description": "One of the most difficult parts of your mormon faith deconstruction is explaining what you are experiencing to your still believing family and friends. We want so desperately to be understood. We want our loved ones to know how hard this time in our life is, yet we just keep banging our head against the wall in frustration at the lack of understanding. It almost feels like insult to injury that we have to do the work and manage our mental health in this department. But we do. It is up to you to do the work to make sure you are okay. It is like we are speaking a completely different language now and thus communication with our loved ones feels foreign. Join me for Exmoromonology Ep. 56, as I explain this all in detail. I would love to be your life coach. You can sign up for a free mini session with me and I can coach you through something that you are struggling with. Sign up at https://amylogansschedulecalander.as.me/schedule.php",
      "release": "2021-05-23T22:51:03Z",
      "duration": "00:27:00.8710000",
      "explicit": false,
      "spotifyId": "28R1WtxdO8NpyabUk4JJfZ",
      "appleId": 1000522848092,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28R1WtxdO8NpyabUk4JJfZ",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-you-are-speaking-a-foreign-language/id1489879938?i=1000522848092"
      }
    },
    {
      "id": "43ad509b-8a60-40ee-8ed2-e8147d5bc64a",
      "title": "Exmormonology ~ Performance Points and Enoughness",
      "description": "This week I want to talk to you about how one measures being enough. Growing up in the mormon church there are a lot of requirements given to us over the course of our lives about how we need to be living. We have to \u0022do\u0022 a lot in the church and then we are required to go to worthiness interviews to judge our enoughness. The religious conditioning is playing a hard game my friends, when it comes to your internal belief on feeling like you are enough. Let\u0027s dive in and discuss how this effects your belief about yourself in ways you most likely have never thought about. Exmormonology Ep. 55",
      "release": "2021-05-17T02:32:18Z",
      "duration": "00:32:24.5550000",
      "explicit": false,
      "spotifyId": "7jVE7RxbCrJ5Sebd02SSwD",
      "appleId": 1000521956790,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jVE7RxbCrJ5Sebd02SSwD",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-performance-points-and-enoughness/id1489879938?i=1000521956790"
      }
    },
    {
      "id": "a60c9650-9613-431e-aba5-9063ce714df9",
      "title": "Exmormonology ~ Bonus ~ The Irreverent Sessions",
      "description": "Finally, Irreverent Episode 13 is ready! So grab a drink or whatever you prefer and hang with us. Jim and I talk about Praying at Zupas and well just praying anywhere, anytime, temple tchotchke, Mormon women and careers, your \u0022exmo personality,\u0022 the changes to the For The Strength of The Youth, and so much more. We start out fairly serious and by the end we are straight up giggles, so much so that we just quite literally fade out. A good time was had.",
      "release": "2021-05-11T23:55:08Z",
      "duration": "01:13:33.6480000",
      "explicit": false,
      "spotifyId": "5W4mI3kLFwsu7uf0Ww1DSb",
      "appleId": 1000521383893,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5W4mI3kLFwsu7uf0Ww1DSb",
        "apple": "https://podcasts.apple.com/podcast/the-irreverent-sessions/id1489879938?i=1000521383893"
      }
    },
    {
      "id": "d2d084b9-0917-48f8-a9f7-f5a186938d7d",
      "title": "The Irreverent Sessions",
      "description": "Something was in the air the night we recorded this Irreverent Episode. At a certain point in the podcast we, well, fell into a complete an totally laughing fit that still tickles me listening to it again. We hope you will join us as we discuss... Jim\u0027s Legal Pad of Ideas Mormon Temples Missed Opportunity Mormon Product Ideas The Mormon Rocky Horror Picture Show Equivalent Moroni at the Insurrection Exmormons have points! GD. And more. You may just fire us after this episode! lol",
      "release": "2021-05-11T00:00:00",
      "duration": "01:06:05.4400000",
      "explicit": false,
      "spotifyId": "1xRZLCH64gM90RD2HuVR49",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1xRZLCH64gM90RD2HuVR49"
      }
    },
    {
      "id": "ea1e55e9-71df-493a-9ad3-7cf6284cecbb",
      "title": "Exmormonology ~ Newbie Post Mormon",
      "description": "If you are in the beginning stages of your faith crisis, this episode is for you. Let\u0027s have a heart to heart. What you are going through is huge. Don\u0027t let the noise drown out the importance of this stage of your journey. This is the messy part. Sit with me today, newbie wildflower.",
      "release": "2021-04-24T15:07:16Z",
      "duration": "00:22:03.4410000",
      "explicit": false,
      "spotifyId": "4VlMog9XdEPeN7OjIsrbvA",
      "appleId": 1000518458774,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VlMog9XdEPeN7OjIsrbvA",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-newbie-post-mormon/id1489879938?i=1000518458774"
      }
    },
    {
      "id": "b7617d14-69f3-42ee-9350-3212cff58169",
      "title": "Exmormonology ~ When Religion and Science Collide",
      "description": "What happens when one\u0027s profession does not align with one\u0027s religion? Let\u0027s talk about it. Natasha Helfer\u0027s \u0022church court of love\u0022scheduled for April 18th. Also, do you know you are your own authority? Do you believe that? I am working on a module for my coaching program that will help you see how our conditioning in \u0022The Church\u0022 has contributed to our second guessing what is best for us. Exmormonology Ep. 53.",
      "release": "2021-04-19T15:39:25Z",
      "duration": "00:23:57.5700000",
      "explicit": false,
      "spotifyId": "7jyO1oZK1F4nUo3GgHxRBC",
      "appleId": 1000517778592,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jyO1oZK1F4nUo3GgHxRBC",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-when-religion-and-science-collide/id1489879938?i=1000517778592"
      }
    },
    {
      "id": "bc602cfa-04a4-4518-bec1-0995a96b1f85",
      "title": "The Irreverent Sessions",
      "description": "It is a Whiskey and Wine night on this episode of The Irreverent Sessions. (recorded on March 14th) Tonight Jim is drinking Jack and Coke and I am drinking a fabulous Chardonnay, Sonoma-Cutrer. (so freaking good!) In this session of Irreverent, a few of our topics include... Murder Among The Mormons. Mormon Temple Remodels and The Temple Murals. Respecting the Mormon Elders. God and The Holy of Holies, a spot for God and Jesus. Kolob, near Kolob. Amy reeealllly loves this wine. GenExers putting the X in Exmo. A different mormonism now??? The church morphing into mainstream christianity. Finding ourselves defending mormonism to outsiders who do not know what they are talking about. Weird in so many ways. Why my podcast name was very intentional. The set up of being labeled an apostate. And more! You really have to listen to the whole episode! We meander. :)",
      "release": "2021-03-31T00:00:00",
      "duration": "01:16:07.9800000",
      "explicit": false,
      "spotifyId": "5RUjMrDw47jbPXvVK1Cz1Z",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5RUjMrDw47jbPXvVK1Cz1Z"
      }
    },
    {
      "id": "74b94733-7636-4589-9775-b760181d231a",
      "title": "Exmormonology ~ What Is Your Story?",
      "description": "Rewriting your own personal narrative is a completely different process now that you have left the mormon church. What do you believe now? What is true for you? What are the words you use to talk about yourself? I want to talk a bit more about the framework we build from, once we have had a religious faith crisis. You and I both know that this is about way more than just the mormon church and the narrative \u0022they\u0022 had for you. So, I am moving the focus to YOU today wildflower. What is your story now that you have a blank slate in front of you. Let\u0027s play in this thought playground for a little while, shall we?!",
      "release": "2021-03-25T18:30:10Z",
      "duration": "00:25:07.6040000",
      "explicit": false,
      "spotifyId": "4kTpYdUVH2JpyRyCsi5RZV",
      "appleId": 1000514407022,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4kTpYdUVH2JpyRyCsi5RZV",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-what-is-your-story/id1489879938?i=1000514407022"
      }
    },
    {
      "id": "3d7dbc62-755a-407e-8f4b-617047380c8c",
      "title": "Exmormonology ~ How To Be An Exmormon",
      "description": "As mormons, we were raised that there was one right church and one right way to live your life. Just stay on the mormon plan and you will be good. Then, boom, you stumble along and run smack dab into your own personal faith crisis. The deep conditioning you have experienced bleeds over into this new paradigm you find yourself in as you navigate life post mormon. Is there one right and true way to get through your faith crisis and your new post mormon life? Let\u0027s talk about this interesting dichotomy you are experiencing in this week Exmormonology Episode.",
      "release": "2021-03-14T22:42:31Z",
      "duration": "00:20:41.4430000",
      "explicit": false,
      "spotifyId": "0X9yYMbqVMCVGUFqmsa2Gy",
      "appleId": 1000512972467,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0X9yYMbqVMCVGUFqmsa2Gy",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-how-to-be-an-exmormon/id1489879938?i=1000512972467"
      }
    },
    {
      "id": "d93b5b8f-8e3f-4acb-bbd4-31cac16f470e",
      "title": "Exmormonology ~ Where I am Now ~ 15 Years Post Mormon Faith Crisis",
      "description": "In this weeks episode of Exmormonology, I want to share with you a time table of my life since my mormon faith crisis. I have had different milestones along my path that have helped shaped my life and I have a feeling you will relate to many of them. I discuss my faith crisis, a wee bit of my marriage, my youtube channel Soul Searching Girl that changed to Amy Logan Post Mormon Life. I discuss my emerging awareness of patriarchy, intersectional feminism, life coaching and more. Grab cup \u0027o something and talk a journey with me. Exmormonology Ep. 50 Where I am now, 15 years post my mormon faith crisis.",
      "release": "2021-03-01T02:24:38Z",
      "duration": "00:40:17.2930000",
      "explicit": false,
      "spotifyId": "4cCqsmUz1nwWxYdLgIpkGf",
      "appleId": 1000511053714,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cCqsmUz1nwWxYdLgIpkGf",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-15-years-post-mormon-faith-crisis/id1489879938?i=1000511053714"
      }
    },
    {
      "id": "d33ebfb9-f0dc-40f2-9c20-6b3c0ffd5f7d",
      "title": "The Irreverent Sessions",
      "description": "Jim and I sat down, had a few drinks and pontificated about mormonism. Some of the topics up for discussion... Seeing things with your spiritual eyes. TikTok @exmormonology and @brashreligion Whiskey Sour Polygamy Amy is old Ordering drinks Why people drink Church distractions Second Anointing Initiatories Brochure upon name removal from church records Doubts are of the devil Cozy up and laugh loudly with us.",
      "release": "2021-02-25T00:00:00",
      "duration": "01:17:34.4710000",
      "explicit": false,
      "spotifyId": "4jV4tHkmF2jtmSKGSdLRGQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4jV4tHkmF2jtmSKGSdLRGQ"
      }
    },
    {
      "id": "2715600f-8bee-4e15-9837-cac7a0049fb9",
      "title": "Exmormonology ~ The Second Wave of Leaving The Mormon Church",
      "description": "Exmormonology Ep. 49 ~ So many stages to this leaving the mormon church experience. You rode the first wave of complete shock and you are feeling a bit stunned, then, the second wave hits you. I know it feels overwhelming, because you don\u0027t want to be feeling these emotions. You want to resist these feelings and it festers. What if this is exactly how it should feel? In this episode I want to talk about the \u0022second wave\u0022 for a bit. A second wave is coming, so to speak, but you learned something from the first wave and you are already stronger, you will be able to handle this too. Let\u0027s dive in.",
      "release": "2021-02-15T00:00:14Z",
      "duration": "00:37:37.0050000",
      "explicit": false,
      "spotifyId": "4FEDzVa0scKoQbhvUPy8RW",
      "appleId": 1000509040952,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4FEDzVa0scKoQbhvUPy8RW",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-second-wave-of-leaving-the-mormon-church/id1489879938?i=1000509040952"
      }
    },
    {
      "id": "5dd8a8cf-9f8c-425e-ad86-24a13aad8bda",
      "title": "Exmormonology 2.0 Reflection and Going Forward",
      "description": "I love Exmormonology. I love spending time with you as you are working through a very very very huge life change. Leaving the mormon church is not for wimps. It will challenge you and stretch you and offer all sorts of opportunity for growth. It has always been my goal to help you not feel so alone on your journey. When I began my journey, many moons ago, the loneliness was so very painful. In this episode, I reflect on the past year (again) and I also discuss some of my intentions with moving forward. I know it can feel like you are stagnant tho, as you process all that you are going through. The truth is you have an amazing big beautiful life ahead of you and you will be a better person for this transition in your life. Keep doing the work. Keep expanding your mind. Keep on keeping on. Plus...Happy Birthday to me! January 31st!",
      "release": "2021-01-31T15:59:49Z",
      "duration": "00:18:21.8970000",
      "explicit": false,
      "spotifyId": "3GWISSmjXvhGxCMn1o9z19",
      "appleId": 1000507192939,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3GWISSmjXvhGxCMn1o9z19",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-2-0-reflection-and-going-forward/id1489879938?i=1000507192939"
      }
    },
    {
      "id": "14ea6594-a4d9-46b5-91c7-dd5cb0a15661",
      "title": "Exmormonology ~ Part 2, My Son\u0027s Mormon Temple Wedding Day",
      "description": "So many stages of life after mormonism. The truth is, it is and always will be an on going journey. Being mormon was a part of you through and through, and because of that you have a lifetime of experiences to always remind you of the life you created as a latter day saint. And, part of your life journey post mormon, will be the pieces of the choices you made as a member. For me, it was standing out side of an LDS temple, while my son was getting married for time and all eternity. Here is part two of my son\u0027s temple wedding day.",
      "release": "2021-01-11T01:40:24Z",
      "duration": "00:24:47.5950000",
      "explicit": false,
      "spotifyId": "24V9RhMqEQtx8UtsAWC6BV",
      "appleId": 1000504924060,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/24V9RhMqEQtx8UtsAWC6BV",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-part-2-my-sons-mormon-temple-wedding-day/id1489879938?i=1000504924060"
      }
    },
    {
      "id": "8c549a01-af5e-48cd-8ba5-9d61c2fa075c",
      "title": "Exmormonology ~ When Your Child Gets Married In The Mormon Temple and You Can\u0027t Be There",
      "description": "Is your active mormon son or daughter getting married in the Mormon Temple and you can\u0027t be there because you left the church? Yeah, me too. Let\u0027s talk about how to manage your mind around this potentially emotional experience. When I left the church back in 2006, I knew that one day I may have to deal with this and now I am, tomorrow. I recorded this podcast last week discussing some of my thoughts and self coaching around this very happening. Exmormonology Ep. 46 is the story of my temple wedding back in 1990 and now my son\u0027s temple wedding in 2020.",
      "release": "2020-12-28T22:15:03Z",
      "duration": "00:35:06.5520000",
      "explicit": false,
      "spotifyId": "3gcaA12cQ11R1jtvNxYSOt",
      "appleId": 1000503732069,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3gcaA12cQ11R1jtvNxYSOt",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-when-your-child-gets-married-in-the/id1489879938?i=1000503732069"
      }
    },
    {
      "id": "030c9c7a-fdf9-49dc-889a-2b13e1ada911",
      "title": "The Irreverent Session",
      "description": "Time to let our hair down around here! Let the Irreverence begin in Exmormonology land. This week James and I dive into... Chartreuse Wine and Whiskey Thinking for Yourself Paul H. Dunn Believing Verses Knowing The New Apologists I, Amy, am always right (obviously) Cherry picking the Bible Tithing is the fee.... James quotes the New Testament Exmormonology Podcast Facebook Page and more!",
      "release": "2020-12-20T00:00:00",
      "duration": "01:15:18.3730000",
      "explicit": false,
      "spotifyId": "70fOlTYLWVfzmZmlF4mzp1",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/70fOlTYLWVfzmZmlF4mzp1"
      }
    },
    {
      "id": "05031d6e-7227-4e60-8fce-f9bd968e7091",
      "title": "Exmormonology ~ Feeding The Fear",
      "description": "Fear is a powerful feeling. It can consume us and keep us stuck in so many areas in our life. Religions, including Mormonism, use fear to keep people in line, in the boat, and doubting your doubts. You don\u0027t see this, until you see it. Let\u0027s talk about how we \u0022feed the fear\u0022 with our looping thought patterns created from our ancestor\u0027s need to survive and our religious and social conditioning we are living, right now, in our lifetime. Let\u0027s dive into Exmormonology Ep. 45.",
      "release": "2020-12-19T14:50:11Z",
      "duration": "00:16:05.5110000",
      "explicit": false,
      "spotifyId": "2bB2XOQesfX4cRr2Q8A0yd",
      "appleId": 1000502923183,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bB2XOQesfX4cRr2Q8A0yd",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-feeding-the-fear/id1489879938?i=1000502923183"
      }
    },
    {
      "id": "722a40f6-750c-416d-8364-087167403a7d",
      "title": "Exmormonology ~ Mormon Relics",
      "description": "Someone asked me the other day, \u0022Amy, what have you done with all of your mormon \u0022things?\u0022 Garments, Temple Clothing, Scriptures, etc. etc. etc. Great question! I love this Q so much. I want to share with you what I did/do, and I also want to know what you have done with your mormon paraphernalia? In this episode of Exmormonology, let\u0027s talk about all of your options. We really do collect a lot of things over our lifetime of being mormon, don\u0027t we? It was our life AND our lifestyle, so it makes sense that we have some decisions to make with all the THINGS!",
      "release": "2020-12-10T21:40:02Z",
      "duration": "00:10:20.6430000",
      "explicit": false,
      "spotifyId": "0cyzNMPFJyJdREBLBhEePI",
      "appleId": 1000501998594,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0cyzNMPFJyJdREBLBhEePI",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-mormon-relics/id1489879938?i=1000501998594"
      }
    },
    {
      "id": "cab086f5-a452-4c1c-ba30-5ea12b89f668",
      "title": "Exmormonology ~ Celebrating A Year Of Exmormonolgy, A Year In Review!",
      "description": "We have wrapped up the first year of The Exmormonology Podcast!!! Today is all about celebrating and reviewing all we have accomplished together over the course of the past year. If you are a post mormon, progressive mormon, active mormon but wanting to understand your exmormon friends and family, or full on exmormon, this podcast is for you. Learning how to life live after mormonism or while you are questioning mormonism, can be challenging. It has always been my goal to help you navigate this path in healthy ways, paying particular attention to your mental health. Thank you for listening and sharing and being a WILDFLOWER! I celebrate you! Thank you for listening to Exmormonology. Listen all the way to the end of this episode for a special Wildflower Bonus, just for you.",
      "release": "2020-12-02T14:44:12Z",
      "duration": "00:20:27.1280000",
      "explicit": false,
      "spotifyId": "3GSGNdNAMxe6CEj23lIori",
      "appleId": 1000501095495,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3GSGNdNAMxe6CEj23lIori",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-celebrating-a-year-of-exmormonolgy/id1489879938?i=1000501095495"
      }
    },
    {
      "id": "c57391e0-b577-49d8-a814-05654c8c7e7b",
      "title": "Exmormonology ~ #givethanks and triggers",
      "description": "Were you triggered by your social media feed being inundated with #givethanks posts? It was a lot, wasn\u0027t it. Let\u0027s talk all about it in this week\u0027s Exmormonology Episode. I address a lot of the reasons why you were triggered, but also I am going to give you a little tough love. If you are a regular listener to Exmormonology it is because you are looking for ways to heal and not be so triggered, so this means you can handle a little tough love from me, your life coach. Let\u0027s dive in.",
      "release": "2020-11-28T00:26:39Z",
      "duration": "00:23:03.7060000",
      "explicit": false,
      "spotifyId": "2chffcWYvYnSFDBDQEqh12",
      "appleId": 1000500538272,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2chffcWYvYnSFDBDQEqh12",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-givethanks-and-triggers/id1489879938?i=1000500538272"
      }
    },
    {
      "id": "31b7097f-62b8-4c8f-99b2-d6bebcaec957",
      "title": "Exmormonology ~ How To Take Your Emotional Power Back After Your Mormon Faith Crisis",
      "description": "Time and time again we give our emotional power away every time someone says something that sends us over the edge, especially when going through a mormon faith crisis. In this episode of Exmormonology, I am going to tell you what is happening, what to do, and how to feel more empowered during and after your faith crisis. You are fully capable of growing stronger through this process. I believe in you. So, grab a pen and paper. You will need to take notes during this episode.",
      "release": "2020-11-16T02:01:49Z",
      "duration": "00:17:44.0190000",
      "explicit": false,
      "spotifyId": "5pDBiS81RZzSPy0eowGwDB",
      "appleId": 1000498735761,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5pDBiS81RZzSPy0eowGwDB",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-how-to-take-your-emotional-power-back/id1489879938?i=1000498735761"
      }
    },
    {
      "id": "4ba3e132-6759-454b-8333-e7622897bd72",
      "title": "Exmormonology ~ Eternal Sunshine of the Post Mormon Mind",
      "description": "I was in a major car accident a few weeks ago. I have been recovering from a concussion. While I have had a lot of down time and very limited screen time, I have had a few thoughts (okay, a lot of thoughts) about my post mormon journey , my life and how life can change in an instant. I hope you tune in as this episode of Exmormonology is me being very human and vulnerable.",
      "release": "2020-11-09T02:24:17Z",
      "duration": "00:26:20.6690000",
      "explicit": false,
      "spotifyId": "11tH9wmPg0sVW4SwmiTHUo",
      "appleId": 1000497730924,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/11tH9wmPg0sVW4SwmiTHUo",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-eternal-sunshine-of-the-post-mormon-mind/id1489879938?i=1000497730924"
      }
    },
    {
      "id": "f1002478-3f13-48cf-b0c4-29caaa487d36",
      "title": "Exmormonology ~ The Yellow Brick Road and Uncertainty of Life After Mormonism",
      "description": "When you start down the yellow brick road of your inquiries into mormonism, you could never have imagined what was coming. AmIright?! As humans, we fear the unknown. We want and crave certainty. We probably do not even think about it much because we just assume we have a certain level of control over our lives. Nothing like a religious faith crisis to show you how much you want certainty in your life. Our brains hate uncertainty. We try to avoid it at all costs and we panic when we do not have it. Diving into all things uncertain in this weeks episode of Exmormonology.",
      "release": "2020-10-06T00:50:50Z",
      "duration": "00:36:06.0470000",
      "explicit": false,
      "spotifyId": "1t7okhPipREijmdOED711D",
      "appleId": 1000493712559,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1t7okhPipREijmdOED711D",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-yellow-brick-road-and-uncertainty/id1489879938?i=1000493712559"
      }
    },
    {
      "id": "e0eea866-ef82-4622-a816-ed017114f4a1",
      "title": "The Irreverent Sessions ~ Sex, Lies \u0026 Video Tapes",
      "description": "Let\u0027s talk about sex, baby! On this bonus edition of Exmormonology, The Irreverent Sessions, we talk about sex and the mormon church\u0027s influences on how we have been conditioned, accepted or not accepted, within the roles presented to us. We laugh, (I) get teary, and of course all things irreverent. Everything from how to make a Michelada (a Mexican beer), hope chests, being a virgin, purity culture, hypocrisy, Mitch Shira and apostle\u0027s impersonations, @talkpuritytome and so much more!",
      "release": "2020-09-30T23:19:56Z",
      "duration": "01:24:56.6200000",
      "explicit": false,
      "spotifyId": "7yzq9cpHw0lR2Xgx3FUJXy",
      "appleId": 1000493147842,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7yzq9cpHw0lR2Xgx3FUJXy",
        "apple": "https://podcasts.apple.com/podcast/the-irreverent-sessions-sex-lies-video-tapes/id1489879938?i=1000493147842"
      }
    },
    {
      "id": "8018fb3a-cb6b-40f4-a7fc-b7d49a3d44f1",
      "title": "Exmormonology ~ Ruth Bader Ginsburg, Ignorance and Regret",
      "description": "This week is a quickie Exmormonology. This week I share a few tender feelings that RBG\u0027s death brought up for me. I am curious if since you have left the church, do you have moments of feeling ignorant on topics you paid no attention to when you were BUSY being mormon? Yeah? Me too. Let\u0027s take a moment and honor Ruth Bader Ginsberg and talk about her legacy and how we can use her life as fuel to light a fire under us to learn all we can about women who have paved the way for you and me.",
      "release": "2020-09-24T20:36:25Z",
      "duration": "00:09:01.4130000",
      "explicit": false,
      "spotifyId": "7KGHrVfZqtSad6hi8xmDNf",
      "appleId": 1000492425497,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KGHrVfZqtSad6hi8xmDNf",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-ruth-bader-ginsburg-ignorance-and-regret/id1489879938?i=1000492425497"
      }
    },
    {
      "id": "b2122dfa-cd70-43cb-88f5-8a3389d7d6cb",
      "title": "Exmormonology ~ Coffee Talk",
      "description": "Do you love coffee as much as me? Did you start to drink coffee in the closet, so to speak, when you felt too guilty to drink it openly around your mormon family? Yeah? ME TOO! Guilt and shame often run the show when you are in deconstruction mode out of the church. Let\u0027s talk about the psychology and mind control the church had over you, all under the guise of obedience. This week, I am coming at you from a coffee shop in Texas. Can\u0027t wait to dive in with y\u0027all!",
      "release": "2020-09-20T00:16:17Z",
      "duration": "00:19:49.9290000",
      "explicit": false,
      "spotifyId": "6RdD5cagX0Nn5c4OFgFIiF",
      "appleId": 1000491832458,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RdD5cagX0Nn5c4OFgFIiF",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-coffee-talk/id1489879938?i=1000491832458"
      }
    },
    {
      "id": "6f1e5faf-9050-4370-a2dd-8af713dfa271",
      "title": "Exmormonology ~ Exmormon Faith Crisis Playlist",
      "description": "Music is life! So many songs have helped me get through some dark days of my faith crisis. In this week\u0027s episode of Exmormonology, I want to share several of the songs I love. I have many many more, but here is a great sampling of some songs that mean a lot to me. I hope you love them too! I would love to hear what songs have helped you through the tougher days of your paradigm shift.",
      "release": "2020-09-05T00:04:04Z",
      "duration": "00:24:31.4510000",
      "explicit": false,
      "spotifyId": "3JXPxL8wUsW5nxtfpFQvt8",
      "appleId": 1000490129247,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JXPxL8wUsW5nxtfpFQvt8",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-exmormon-faith-crisis-playlist/id1489879938?i=1000490129247"
      }
    },
    {
      "id": "fc355fe7-a0ec-4911-bed0-697e49a888af",
      "title": "Exmormonology ~ Post Mormon Parenting",
      "description": "What do you do when your mormon parenting handbook is tossed out the window? If you are a parent, and you have experienced a faith crisis, at some point you will have thoughts about how to parent your kids. Doesn\u0027t matter if they are little bitty or full grown with children of their own, you will have questions. First, it is totally understandable if you are having a hard time with this. You have been living in a black and white type of thinking world. It can feel very overwhelming to have that structure removed. There was not a lot of wiggle room before. Now what? Let\u0027s dive in to your mormon parenting brain and your post mormon parenting brain in this weeks episode of Exmormonology.",
      "release": "2020-08-29T01:00:38Z",
      "duration": "00:37:54.5070000",
      "explicit": false,
      "spotifyId": "4H9vABi0BqWlnnfwonmrm2",
      "appleId": 1000489470628,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4H9vABi0BqWlnnfwonmrm2",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-post-mormon-parenting/id1489879938?i=1000489470628"
      }
    },
    {
      "id": "ea37c571-cdaa-4f7a-9619-ab7c22cf70b7",
      "title": "Exmormonology ~ How To Process Difficult Post Mormon Emotions",
      "description": "This week in Exmormonology we are going to walk towards our painful feelings. We have to be able to FEEL our feelings. Doing this lets the pressure, stress, and discomfort lessen. Once we are able to feel them properly, we can see that that emotion is just a physical vibration in the body and nothing to be scared of. Most of us spend so much time trying to avoid our negative feelings, at all costs, that we miss out on the growth that comes from processing our emotions. So, let’s show ourselves compassion and love and healing, by going there.",
      "release": "2020-08-20T22:44:33Z",
      "duration": "00:25:57.7600000",
      "explicit": false,
      "spotifyId": "34TqRp2GDMRo8MmbqaYMxd",
      "appleId": 1000488727196,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34TqRp2GDMRo8MmbqaYMxd",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-how-to-process-difficult-post-mormon/id1489879938?i=1000488727196"
      }
    },
    {
      "id": "017b4fe9-5572-4791-939c-12b06f6c6377",
      "title": "BONUS Ep. 05 The Irreverent Sessions",
      "description": "Opps, we did it again! Another Irreverent Bonus Ep. of Exmormonology. Whiskey is involved and there is a lot of loud laughter. In this session James and I talk about.. The Regular Testimony Bearers Las Vegas Church Approved Music Black and White Thinking Jesus, The Bible and The Book of Mormon Things Lost In Translation Tithing Dollars White Lines and Stake Dances Thought Bubbles Happiness is Family Home Evening Champaign at a Family Dinner and more! Grab a drink, or not, and join us.",
      "release": "2020-08-15T00:00:00",
      "duration": "01:06:17.2730000",
      "explicit": false,
      "spotifyId": "5muPKNizujWWDF5xRXc1he",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5muPKNizujWWDF5xRXc1he"
      }
    },
    {
      "id": "c30084db-313d-4014-98f6-fed4fd759c8b",
      "title": "Exmormonology ~ Post Mormon Decision Making",
      "description": "Growing up in the Mormon church, we have been so conditioned to black and white type of thinking. Black and white thinking effects our decision making. You may think you are \u0022just bad at making decisions\u0022 but it is tied to your religious conditioning. You can do something about that. If you are a person who worries a lot about “doing it wrong” or “not good enough” or \u0022afraid to mess up,\u0022 this episode is for you. I have good news for you, there are no bad decisions, just decisions. Let\u0027s talk about it.",
      "release": "2020-08-06T23:03:17Z",
      "duration": "00:26:46.5830000",
      "explicit": false,
      "spotifyId": "0YFXxoOonCU7dbyYJRvQyM",
      "appleId": 1000487355104,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YFXxoOonCU7dbyYJRvQyM",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-post-mormon-decision-making/id1489879938?i=1000487355104"
      }
    },
    {
      "id": "a51cc24a-15cf-4532-9a9d-055f11b2cc87",
      "title": "Exmormonology ~ Mormons and Modesty and Garments",
      "description": "Exmormonology Ep. 32 is all about Modesty. Growing up, in and through mormonism, you have been influenced by all the lessens, scriptures, conference talks, parent messages and mormon culture, that comes with all the conditioning we experienced, even when we do not even see it as conditioning, while we are in it. We see it as normal. This is true for the conditioning we have experienced around modesty. We were taught that we, girls and women, are responsible for the thoughts boys/men may have about our bodies and how we dress. Mix religious conditioning and society messages and we have the perfect cocktail for messed up body image, shame and mental torture we put on ourselves, to hide ourselves. We spend so much time trying to make sure we are covered up, that we end up covering up our authentic self.",
      "release": "2020-08-01T03:48:12Z",
      "duration": "00:53:26.4260000",
      "explicit": false,
      "spotifyId": "4fVVsVvgmbYa3AtcCXp40i",
      "appleId": 1000486771354,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fVVsVvgmbYa3AtcCXp40i",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-mormons-and-modesty-and-garments/id1489879938?i=1000486771354"
      }
    },
    {
      "id": "132b07bf-9b99-4d46-bea2-8df7744d02ce",
      "title": "Exmormonology ~ Hiking Half Dome and a Mormon Faith Crisis",
      "description": "Have you ever done something that scares the living day lights out of you? I know the answer is yes because I know you have experienced a faith crisis. Experiencing a faith crisis means you had to face fear and damnation and hell, face to face. Leaving the only belief you have ever know, is terrifying. Get yourself a new pair of gloves, hold on to the cables with all your might. You will come out the other side stronger than you ever thought possible. Listen to a tale of me facing my second, biggest fear, second only to my faith crisis. Half Dome and a tale about one of the 3 nephites, garments and porn shoulders.",
      "release": "2020-07-24T03:48:44Z",
      "duration": "00:25:49.5050000",
      "explicit": false,
      "spotifyId": "4b58S2OGsXpKZW8qi4QT7K",
      "appleId": 1000485909171,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4b58S2OGsXpKZW8qi4QT7K",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-hiking-half-dome-and-a-mormon-faith-crisis/id1489879938?i=1000485909171"
      }
    },
    {
      "id": "a88e877e-9aea-47a1-b1ad-2b6bc2498b17",
      "title": "Exmormonology ~ Mormon Perfectionist Syndrome",
      "description": "Perfectionism! Ewwww. You may not even think you are a perfectionist and I am going to show you how perfectionism masks itself as doubt and how it may be stopping you from achieving what you want in life. We have lots and lots of layers to work through leaving the faith. This week we dive into the perfectionism we were constantly striving for and never attaining. I tell you why this happens and exactly how you can become a recovering perfectionist, like me. Let\u0027s dive in.",
      "release": "2020-07-17T00:54:02Z",
      "duration": "00:23:42.7070000",
      "explicit": false,
      "spotifyId": "3Gq5UHvsx6OCyp06qggofc",
      "appleId": 1000485233561,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Gq5UHvsx6OCyp06qggofc",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-mormon-perfectionist-syndrome/id1489879938?i=1000485233561"
      }
    },
    {
      "id": "b15e5426-b882-4ebf-87c6-c5da1eb90a11",
      "title": "Irreverent Sessions",
      "description": "Join us for another bonus episode of Irreverent Sessions. Jim and I clink glasses and then talk about... How to pick wine. Long Island Ice Tea. How Molly Mormon Amy was. Our Story. Exploring life outside of the mormon lens (and rules). Jim\u0027s life in Hollywood. Jim asking me to marry him while in Italy and why I said no. Sex and exploring your sexuality after mormonism. New York City. Life Coaching Jim. Conflicting Commandments. Jim is a writer. Working for free. And so much more!",
      "release": "2020-07-10T03:48:37Z",
      "duration": "01:41:12.3200000",
      "explicit": false,
      "spotifyId": "5lMIOBIwOLUbrmU8k5w6SC",
      "appleId": 1000483962510,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5lMIOBIwOLUbrmU8k5w6SC",
        "apple": "https://podcasts.apple.com/podcast/the-irreverent-sessions-big-foot-and-mormon-folklore/id1489879938?i=1000483962510"
      }
    },
    {
      "id": "1bd013f3-ac62-4286-831e-0766499e9822",
      "title": "The Irreverent Sessions Big Foot  and Mormon Folklore",
      "description": "This week let\u0027s get a little cheeky for our Irreverent Bonus Ep. of Exmormonology. Jim and I talk about all things, well at least a few things, Mormon Folklore. But in all actuality, it kind of all is, isn\u0027t it? We discuss, The Three Nephites, Cain being Big Foot, How to test a spirit, and the 1st Vision. Plus a few other tipsy wanderings that you don\u0027t want to miss.",
      "release": "2020-07-10T00:00:00",
      "duration": "00:55:57.7800000",
      "explicit": false,
      "spotifyId": "4rukOevv6ZNQ8qD0qiIJmL",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4rukOevv6ZNQ8qD0qiIJmL"
      }
    },
    {
      "id": "adedd8e8-dae0-4ba1-9866-d33f7cc0e1a1",
      "title": "Exmormonology ~ Your Brain on Mormonism",
      "description": "Exmormonology Ep. 029 Your brain is the most powerful tool you have. Are you using it to your advantage or are you letting it run the show with no supervision? If you are serious about improving your exmormon mental health, have a listen. You are the boss of your brain, only you. No one else is responsible for what is going on up in the there, except for you. Spend some time mining around in there and see what is going on. You are worth the time. I give you concrete examples of what this looks like. This is your brain, this is your brain on exmormonism.",
      "release": "2020-07-03T03:51:57Z",
      "duration": "00:18:06.9810000",
      "explicit": false,
      "spotifyId": "79DWAFaTic050P6z4pfejW",
      "appleId": 1000482272357,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79DWAFaTic050P6z4pfejW",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-your-brain-on-mormonism/id1489879938?i=1000482272357"
      }
    },
    {
      "id": "5779202f-59cc-4cf3-a8a7-0a37b15ca00d",
      "title": "Exmormonology ~ Other People\u0027s Feelings",
      "description": "Exmormonology Ep. 28 We have been taught from a young age that we are responsible for other people\u0027s feelings, when in connection to something we have done or said. It can feel strange to learn that this is not true. People have thoughts and feelings based on their own life story and experiences. This week in Exmormonology let\u0027s talk about what I mean. Great nuggets are toward the end. Also, my new website is up! amyloganlife dot com.",
      "release": "2020-06-26T04:24:20Z",
      "duration": "00:23:24.5250000",
      "explicit": false,
      "spotifyId": "08FQoeTVmJTXndRu7siwhf",
      "appleId": 1000479680178,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/08FQoeTVmJTXndRu7siwhf",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-other-peoples-feelings/id1489879938?i=1000479680178"
      }
    },
    {
      "id": "37508010-74cf-4675-927b-a3126ef8c91c",
      "title": "Exmormonology ~ Post Mormon Exhaustion",
      "description": "Are you feeling exhausted from all things Post Mormon? Let\u0027s talk about why and how you can help reduce the tiredness you feel as you unravel your life. Your brain is working overtime trying to solve the puzzle of \u0022WTF just happened.\u0022 Join me for Ep. 27 of Exmormonology.",
      "release": "2020-06-19T01:06:54Z",
      "duration": "00:19:18.5760000",
      "explicit": false,
      "spotifyId": "2HenxowjsCTYeITxBuvjve",
      "appleId": 1000478552221,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HenxowjsCTYeITxBuvjve",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-post-mormon-exhaustion/id1489879938?i=1000478552221"
      }
    },
    {
      "id": "8d6fce3e-3bab-4c5e-8bea-2c22b19af20a",
      "title": "Exmormonology ~ The Emotional Work of Racism",
      "description": "Your brain broke wide open during your faith crisis. You know how that felt, right? Let it break open again if you are new to racism. You know how to feel uncomfortable. You have done it, did it, as you process life after mormonism. Do it again with racism. If you are new to this work, pull the curtain back. Look. Be willing to see it all. This is one of the things I love so much about exmormons, we have felt betrayed by our religious past, this means you most likely want to see what other areas in your life you have not quite seen the full picture. Racism, for me, is one of those areas. How about you? Exmormonology Ep. 26.",
      "release": "2020-06-11T20:17:44Z",
      "duration": "00:13:38.1360000",
      "explicit": false,
      "spotifyId": "1czB8AA2B2jf2jZkCskZnZ",
      "appleId": 1000477612095,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1czB8AA2B2jf2jZkCskZnZ",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-emotional-work-of-racism/id1489879938?i=1000477612095"
      }
    },
    {
      "id": "8c5d30c6-d719-4d5a-b92f-db03611a5b23",
      "title": "Exmormonology ~ Race and Mormonism and You",
      "description": "Let\u0027s look at the foundational teachings from the Book of Mormon that includes racism. Yes, the mormon church has tried to lessen the teachings around \u0022white and delightsome\u0022 and dark skin being a curse, but the truth of the matter is that this language is in the Book of Mormon. Let\u0027s talk about the how these teachings get into our psyche and influence our thoughts, feelings and actions around racism. Exmormonology Ep. 25.",
      "release": "2020-06-05T01:58:04Z",
      "duration": "00:32:05.5910000",
      "explicit": false,
      "spotifyId": "5oJGhec19BNBahVS1ARBOi",
      "appleId": 1000476860399,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5oJGhec19BNBahVS1ARBOi",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-race-and-mormonism-and-you/id1489879938?i=1000476860399"
      }
    },
    {
      "id": "490576fa-b19f-4b1b-8ffe-2a018a43a128",
      "title": "The Irreverent Sessions",
      "description": "Amy is drinking a Rosé and James is drinking Bourbon Whiskey and our conversation took us around the block a few times... Mormon Dating Pretty In Pink Sex Before Marriage Purity Culture Young Women\u0027s Motto Modesty Boys and their bad thoughts. Uchtdorf 3 year olds bearing testimonies Anti-mormons at General Conference to name a few. You will have to listen to the whole show to hear it all. Enjoy! A \u0026 J",
      "release": "2020-05-31T00:00:00",
      "duration": "00:52:09.3830000",
      "explicit": false,
      "spotifyId": "01jc5OllgkbmSqTHKKttie",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/01jc5OllgkbmSqTHKKttie"
      }
    },
    {
      "id": "55c23751-f48b-44db-99fd-7ba5cdd13c84",
      "title": "Exmormonology ~ Anatomy of a Mormon Faith Crisis",
      "description": "Have you ever wondered what stage of your faith crisis you are in? How many stages are there? How did you get to this point in life that everything seems so different now? Let\u0027s dive in. Last year we made a docu style video about an Anatomy of a Faith Crisis. This week, I walk you though the video and explain what it feels like in each stage. You can watch the 5 minute video referenced in this podcast by clicking the link below. Exmormonology Ep. 24. https://www.youtube.com/channel/UCWLNS7aHLgQ6UaiJVX8yrDw?view_as=subscriber",
      "release": "2020-05-29T03:46:14Z",
      "duration": "00:36:44.5680000",
      "explicit": false,
      "spotifyId": "5ndqpm1JhLI00Nr9PvOoPi",
      "appleId": 1000476126072,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ndqpm1JhLI00Nr9PvOoPi",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-anatomy-of-a-mormon-faith-crisis/id1489879938?i=1000476126072"
      }
    },
    {
      "id": "dd79c38a-d1cc-47f6-8d45-97cc6ac41b45",
      "title": "Exmormonology ~ Post Mormon Self Confidence",
      "description": "Post mormon brain often needs a little TLC in the self confidence department. You have busted through a huge paradigm and some of the side effects of this new world view may involve a bit of gun shyness. Let\u0027s continue to use that paradigm busting muscle in other areas of your life. You have evidence of your own self confidence, yet when you set out to do something new, all your old stories come to the forefront and try to shut you down. Exmormonology Ep. 23. Let me walk you though why this happens and teach you how to rebuild and boost your self confidence going forward. Take notes!",
      "release": "2020-05-22T01:42:49Z",
      "duration": "00:32:48",
      "explicit": false,
      "spotifyId": "34ZbO4zskDLDlug2tPxask",
      "appleId": 1000475368932,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34ZbO4zskDLDlug2tPxask",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-post-mormon-self-confidence/id1489879938?i=1000475368932"
      }
    },
    {
      "id": "358cddc7-8601-464e-b4a3-b673c93d57cc",
      "title": "The Irreverent Sessions",
      "description": "Welcome to Exmormonology, The Irreverent Sessions. James Rhodimer joins me for a wine reviews, mormon memory lane, and a glimpse into our exmormon life. These \u0022bonus\u0022 episodes will be released a couple times a month. And, bonus points If you make it all the way to the end of this episode where the wine has kicked in full tilt and I pretty much slip into giggle mode. Enjoy!",
      "release": "2020-05-19T00:00:00",
      "duration": "00:57:46.4160000",
      "explicit": false,
      "spotifyId": "0k0rkB5sZDVfE0PDETnK7A",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0k0rkB5sZDVfE0PDETnK7A"
      }
    },
    {
      "id": "830d2089-ade8-4500-9fbf-1f96e9571683",
      "title": "Exmormonology ~ Post Mormon Pep Talk and Red Boots",
      "description": "There will come a time when you can look back at your initial faith crisis stage of life and laugh at yourself a wee little bit. So, no matter if you are 1 hour into your faith crisis, deer in the head lights stage of things or more of a been at this a while stage of post mormon life, this episode is for you. It is time for a Exmormonology Pep talk and a story of a crazy nervous Amy, first time exmormon meet up and a woman in red boots. Episode 22 of Exmormonology. Let\u0027s go!",
      "release": "2020-05-15T03:15:42Z",
      "duration": "00:22:20.1600000",
      "explicit": false,
      "spotifyId": "5xk5Bz8vorIVb898CFuRsP",
      "appleId": 1000474674669,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5xk5Bz8vorIVb898CFuRsP",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-post-mormon-pep-talk-and-red-boots/id1489879938?i=1000474674669"
      }
    },
    {
      "id": "5c029044-aabf-40ff-a22d-429c5fd62204",
      "title": "Exmormonology ~ Are You Worthy Enough?",
      "description": "Let\u0027s talk about the psychology and long lasting effects of mormon worthiness interviews. After decades of needing to measure up, to be worthy enough, to go the LDS temple and progress through all the proper ranks of mormonism, it is no wonder so many mormons and exmormons a like, never feel worthy enough. I also share a personal story that showed me exactly what I thought about my own personal worthiness.",
      "release": "2020-05-07T21:04:45Z",
      "duration": "00:29:18.9600000",
      "explicit": false,
      "spotifyId": "0lR9NjSbQGaxfqvHHznbmt",
      "appleId": 1000473912765,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0lR9NjSbQGaxfqvHHznbmt",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-are-you-worthy-enough/id1489879938?i=1000473912765"
      }
    },
    {
      "id": "70840c4f-c365-4133-bf49-988428dee7d0",
      "title": "Exmormonology ~ The \u0022S\u0022 Word",
      "description": "There are some words that you need to stop staying. I am asking you to never say this one, again. Like forever!",
      "release": "2020-05-01T04:20:01Z",
      "duration": "00:16:42.4560000",
      "explicit": false,
      "spotifyId": "7IyIYBVpea7GtWcQmXMHaU",
      "appleId": 1000473223659,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7IyIYBVpea7GtWcQmXMHaU",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-s-word/id1489879938?i=1000473223659"
      }
    },
    {
      "id": "62495999-dc46-4555-8df8-1a9fe62fd149",
      "title": "Exmormonology ~ Mormon Social Distancing and Love Bombs",
      "description": "It is very common to pull back from mormon friends and family, when you are going through a faith crisis, or shortly there after. This is because you start to feel a huge disconnect. You may find yourself going through the motions, until you no longer can. You will know when that happens. Let\u0027s talk about it AND mormon love bombs. Have you been a recipient of one?",
      "release": "2020-04-24T04:26:51Z",
      "duration": "00:17:39.7440000",
      "explicit": false,
      "spotifyId": "2kFxnL9x99RgiskHnDKSXQ",
      "appleId": 1000472485615,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2kFxnL9x99RgiskHnDKSXQ",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-mormon-social-distancing-and-love-bombs/id1489879938?i=1000472485615"
      }
    },
    {
      "id": "668541ea-0048-42ff-8ff4-7e817e7c5cf7",
      "title": "Exmormonology ~ Mormons, Funeral Potatoes and Memories",
      "description": "Easter Sunday Thoughts. All the feels. Exmormon ramblings. I am blaming this one on Funeral Potatoes, Andrea Bocelli, and Christian Music.",
      "release": "2020-04-16T20:28:15Z",
      "duration": "00:14:38.0630000",
      "explicit": false,
      "spotifyId": "3XGjoG9Y36uPHOtZ62O1ms",
      "appleId": 1000471703526,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3XGjoG9Y36uPHOtZ62O1ms",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-mormons-funeral-potatoes-and-memories/id1489879938?i=1000471703526"
      }
    },
    {
      "id": "fad4f441-5e6d-4577-b876-6e2df3fe07c8",
      "title": "Exmormonology ~ What Uchtdorf Said, Unruly Wild Child",
      "description": "Is there a good side when a mormon apostle casts us apostates in a negative light? I think yes. Have a listen and let me know what you think.",
      "release": "2020-04-10T00:36:52Z",
      "duration": "00:25:28.6080000",
      "explicit": false,
      "spotifyId": "1bnNmkAbT3GOWRXNp0WJtE",
      "appleId": 1000471039603,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1bnNmkAbT3GOWRXNp0WJtE",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-what-uchtdorf-said-unruly-wild-child/id1489879938?i=1000471039603"
      }
    },
    {
      "id": "c11b578e-2a0d-45d2-b755-439f3c6e9711",
      "title": "Exmormonology ~ Unorthodox, Mormon General Conference and Fear",
      "description": "On this week\u0027s episode of Exmormonology, we talk about... Unorthodox General Conference Mental Health Viktor Frankl Enjoy!",
      "release": "2020-04-03T01:03:58Z",
      "duration": "00:25:02.2560000",
      "explicit": false,
      "spotifyId": "2PlXBn02CbEHwzbHqscYUE",
      "appleId": 1000470352252,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2PlXBn02CbEHwzbHqscYUE",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-unorthodox-mormon-general-conference/id1489879938?i=1000470352252"
      }
    },
    {
      "id": "04b34f56-7b95-4399-bfc2-0818292b7fca",
      "title": "Exmormonology ~ Calming Your Mind",
      "description": "This week, let\u0027s get specific on ways to start managing your mind during this pandemic. Showing up for yourself and learning how to do this work will have lasting ripple effects in your life. Also, are you finding your mormon beliefs around life and death and after life creeping into your brain lately? I want to talk about that too. Learning to manage your mind through crisis, is one of the best gifts you can give yourself.",
      "release": "2020-03-27T02:55:45Z",
      "duration": "00:18:53.5200000",
      "explicit": false,
      "spotifyId": "6TADVR9TyqfLg2gIRuSZzb",
      "appleId": 1000469674266,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6TADVR9TyqfLg2gIRuSZzb",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-calming-your-mind/id1489879938?i=1000469674266"
      }
    },
    {
      "id": "075fa353-86f4-4d39-9974-566abe1f7250",
      "title": "Exmormonology ~ Corona Virus Panic",
      "description": "The Human Race has been reminded that life is more uncertain than we wanted to believe. This week, we are taking a break from all things Exmormon and we are talking about healthy ways for you to process the reality of what we are dealing with on a global scale. I know you are experiencing stress and anxiety at levels that feel off the charts. I want to help you reframe and lessen the intense real feelings that we are collectively feeling. Thought work applies to all things, even the confusion and fear of a pandemic.",
      "release": "2020-03-20T02:20:15Z",
      "duration": "00:29:38.8320000",
      "explicit": false,
      "spotifyId": "3xPCnGac8P49exSI6e768C",
      "appleId": 1000468937047,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xPCnGac8P49exSI6e768C",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-corona-virus-panic/id1489879938?i=1000468937047"
      }
    },
    {
      "id": "178a7580-728f-400e-bf0d-a9d4f84f2b23",
      "title": "Exmormonology ~ Why You Can\u0027t Leave The Mormon Church Alone",
      "description": "You hear it all the time exmormon peeps, \u0022You can leave the church, but you can\u0027t leave it alone.\u0022 Right?! I am pretty sure that these words have fallen upon our ears many times over. I am going to tell you exactly why this happens and exactly why it is 100% okay. Let\u0027s jump into it in the episode of Exmormonology.",
      "release": "2020-03-12T21:19:27Z",
      "duration": "00:28:55.0560000",
      "explicit": false,
      "spotifyId": "5rmW4WjqIcRZWWJPPdf6Fq",
      "appleId": 1000468258845,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rmW4WjqIcRZWWJPPdf6Fq",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-why-you-cant-leave-the-mormon-church-alone/id1489879938?i=1000468258845"
      }
    },
    {
      "id": "199eeb20-46dd-4c2b-b504-42e876dab8a2",
      "title": "Exmormonology ~ Trusting Your Post Religious Self",
      "description": "A mormon faith crisis will most likely leave you feeling duped, bamboozled, stunned. How in the world do you trust yourself again after all of this? You did trust yourself. Now what? I am going to tell you exactly what you need to do to rebuild your trusting yourself muscle. It is easier than you think.",
      "release": "2020-03-05T18:49:51Z",
      "duration": "00:23:57.4560000",
      "explicit": false,
      "spotifyId": "4eRoqw3frZgFyzpZZJgcoz",
      "appleId": 1000467567507,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4eRoqw3frZgFyzpZZJgcoz",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-trusting-your-post-religious-self/id1489879938?i=1000467567507"
      }
    },
    {
      "id": "0ad1e06a-bc1e-4db3-85d7-9305fc851971",
      "title": "Exmormonology ~ Mormon Expectations \u0026 The Manual",
      "description": "Life after mormonism. So many amazing things right? But, there is also a large learning curve to dealing with the fallout regarding friends and family. How do you want people to behave in life, so you feel better? Let\u0027s talk all about it. I drop several realistic truth bombs here in this episode of Exmormonology. Let\u0027s go there!",
      "release": "2020-02-28T01:33:28Z",
      "duration": "00:23:57.4560000",
      "explicit": false,
      "spotifyId": "3aipJqluCDAeaAxDCemkJq",
      "appleId": 1000466915517,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3aipJqluCDAeaAxDCemkJq",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-mormon-expectations-the-manual/id1489879938?i=1000466915517"
      }
    },
    {
      "id": "ac4b9a96-1955-4533-8877-8cb33fafd88a",
      "title": "Exmormonology ~ The Residual Effect",
      "description": "Growing up in a high demand, very indoctrinating religion, leaves some residue. In this episode of Ex•mormon•ology we are going to talk about \u0022The Residual Effect\u0022 and how many old beliefs sneak up on us when we least expect them. The good news is, you are capable of changing those deep rooted beliefs, one thought at a time.",
      "release": "2020-02-20T23:11:39Z",
      "duration": "00:29:31.9200000",
      "explicit": false,
      "spotifyId": "0IIhBSDGSs1ww63OcLnMD0",
      "appleId": 1000466226088,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0IIhBSDGSs1ww63OcLnMD0",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-residual-effect/id1489879938?i=1000466226088"
      }
    },
    {
      "id": "06440f95-6181-4384-a41a-c661bb6f49b8",
      "title": "Exmormonology ~ Going to Mormon Family Events",
      "description": "This week on Ex•mormon•ology I want to talk to you about something that so many of us find our post mormon selves dealing with....FAMILY and THEIR mormon life. A few weeks ago, I attended my nephew\u0027s missionary farewell and setting apart. This meant I had some decisions to make about how I wanted to show up, or even if I wanted to show up at all, for this mormon ritual. I did and here are my thoughts....",
      "release": "2020-02-13T22:32:46Z",
      "duration": "00:18:52.2000000",
      "explicit": false,
      "spotifyId": "3wtPSHrOS3AoO0l1rXIWAK",
      "appleId": 1000465534942,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3wtPSHrOS3AoO0l1rXIWAK",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-going-to-mormon-family-events/id1489879938?i=1000465534942"
      }
    },
    {
      "id": "acddc92c-4d1c-4492-a47e-f262578f6165",
      "title": "Exmormonology ~ Telling Family and Friends You Have Left The Mormon Church",
      "description": "Deciding to tell your mom (or anyone) about leaving the mormon church can really feel uncomfortable. In this week\u0027s Ex•mormon•ology episode, let\u0027s talk about how to manage your mind around this stressful situation.",
      "release": "2020-02-07T02:00:36Z",
      "duration": "00:21:48.3120000",
      "explicit": false,
      "spotifyId": "39obSwFkdHoUOs60iuhq6V",
      "appleId": 1000464864301,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39obSwFkdHoUOs60iuhq6V",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-telling-family-and-friends-you-have/id1489879938?i=1000464864301"
      }
    },
    {
      "id": "1062a5cd-0cb6-4455-9388-75b0a851c0b9",
      "title": "Exmormonology ~ What Will People Think Now That I Have Left THE Church",
      "description": "Do you feel like you have to keep your mormon faith crisis a secret? \u0022Hiding\u0022 what you are going through is a completely normal stage of this process. It is okay to stay put for a bit while you figure out what to do. Let\u0027s talk about the process and what you may be thinking and feeling right now.",
      "release": "2020-01-30T05:38:41Z",
      "duration": "00:29:31.9200000",
      "explicit": false,
      "spotifyId": "4cSLfaAEVBQqlGEldhneVd",
      "appleId": 1000464092006,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cSLfaAEVBQqlGEldhneVd",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-what-will-people-think-now-that-i-have/id1489879938?i=1000464092006"
      }
    },
    {
      "id": "18e25e0e-6275-4525-bdcb-c2af5941b59e",
      "title": "Exmormonology ~ The Tornado",
      "description": "For most of us, our mormon faith crisis feels like a tornado just came blowing through our life. Let\u0027s talk about slowing down, picking up the pieces and tending to our wounds.",
      "release": "2020-01-23T18:58:15Z",
      "duration": "00:13:33.3600000",
      "explicit": false,
      "spotifyId": "68sg361uZz5YpvkSHPou26",
      "appleId": 1000463486447,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/68sg361uZz5YpvkSHPou26",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-tornado/id1489879938?i=1000463486447"
      }
    },
    {
      "id": "7d6f2ab8-0afb-4d9b-b724-f1f83a6bcfcf",
      "title": "Exmormonology ~ Are Your Exmormon Thoughts on the Loose?",
      "description": "When you are ready to begin your healing from your mormon faith crisis, taking your power back is the most liberating thing you can do for yourself. It all starts with your thoughts and for most of us, our thoughts are on the loose. Your brain is like an unsupervised child most of the time. Let\u0027s dive into your brain and see what is going on in there. I will be teaching you The Model today. This is a tool I used with my clients. It takes practice. You begin to take your power back when you start to manage your mind. This is how it is done.",
      "release": "2020-01-17T16:28:57Z",
      "duration": "00:30:00.9120000",
      "explicit": false,
      "spotifyId": "5e80EM3TIHJLaubyqxgSds",
      "appleId": 1000462948338,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5e80EM3TIHJLaubyqxgSds",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-are-your-exmormon-thoughts-on-the-loose/id1489879938?i=1000462948338"
      }
    },
    {
      "id": "a9155eb8-9100-4aa6-9dfc-e1a40ed32e08",
      "title": "Exmormonology ~ Unstuck",
      "description": "It can be a frustrating feeling to spin in limbo land after your mormon faith crisis. It is normal to need time to figure out what steps you want to take next, but it is easy to get stuck in that space. In this episode of Ex•mormon•ology we are going to talk about how to get unstuck and exactly how to start moving forward.",
      "release": "2020-01-09T21:17:45Z",
      "duration": "00:23:18.4560000",
      "explicit": false,
      "spotifyId": "4qoR63kjzeChEVVbzQoHf0",
      "appleId": 1000462056787,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qoR63kjzeChEVVbzQoHf0",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-unstuck/id1489879938?i=1000462056787"
      }
    },
    {
      "id": "e592611b-7a83-4a84-a126-89e36be6092e",
      "title": "Exmormonology ~ Grief \u0026 Pain After Your Mormon Faith Crisis",
      "description": "Walking through a faith crisis paradigm shift is hard to describe. In its wake can be intense pain and grief. Today we are going to explore ways to process our pain that comes from our mormon faith crisis.",
      "release": "2020-01-03T04:02:54Z",
      "duration": "00:37:58.2960000",
      "explicit": false,
      "spotifyId": "0hQL6HNwqEaHg3ZCBWC8ww",
      "appleId": 1000461429836,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hQL6HNwqEaHg3ZCBWC8ww",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-grief-pain-after-your-mormon-faith-crisis/id1489879938?i=1000461429836"
      }
    },
    {
      "id": "900ad5e4-92bd-4290-a2ba-39073437676d",
      "title": "Exmormonology ~ Giving Yourself Permission",
      "description": "Giving yourself permission to begin a journey that you have no idea where you are going or where you will end up can feel very daunting. Many of us spin in the space right before the beginning, for awhile. Let\u0027s talk about a few things you can do to change your thinking that will help you make the decision to begin. It all begins in your brain, with a thought. ~Amy",
      "release": "2019-12-19T20:42:50Z",
      "duration": "00:18:29.5200000",
      "explicit": false,
      "spotifyId": "72a7qBydQfkk6acnqQa3cT",
      "appleId": 1000460220475,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/72a7qBydQfkk6acnqQa3cT",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-giving-yourself-permission/id1489879938?i=1000460220475"
      }
    },
    {
      "id": "eb572859-9ab2-439e-8a79-71fa22a056e2",
      "title": "Exmormonology ~ The Moment, my Mormon Faith Crisis",
      "description": "Exmormonology Ep. 01 My Mormon Faith Crisis Story. What you are about to or have just recently gone through is HUGE. Experiencing a mormon faith crisis is one of the most painful things you can go through. Your whole spiritual/life paradigm just took a huge tumble, you most likely feel like the rug was pulled out from under your life. Leaving your religion is not for whimps. Let\u0027s talk about it.",
      "release": "2019-12-01T21:14:57Z",
      "duration": "00:19:30.2400000",
      "explicit": false,
      "spotifyId": "2L5G8Lbns8pSANuvFGqgOI",
      "appleId": 1000458366141,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2L5G8Lbns8pSANuvFGqgOI",
        "apple": "https://podcasts.apple.com/podcast/exmormonology-the-moment-my-mormon-faith-crisis/id1489879938?i=1000458366141"
      }
    }
  ]
}