{
  "_ts": 0,
  "id": "f1e6cfac-2cec-4205-84aa-82480c8e024f",
  "name": "Expanding Frontiers Research",
  "youTubeChannelId": "UCiKcpUmBI8xAwCPI9mTkUcg",
  "episodes": [
    {
      "id": "73583bf9-382c-46aa-999d-5520eb6b8091",
      "title": "Dr. Stephen Kent",
      "description": "Professor Stephen A. Kent researches new and alternative religions, combining perspectives from sociology with religious studies. He has published research on Scientology, the Children of God/The Family, fundamentalist Mormon polygamy, and other new and alternative religions operating in Canada, the United States, and around the world.\r\n\r\nProfessor Kent teaches undergraduate and graduate courses that explore religion and deviance. He also conducts numerous reading courses with both undergraduates and graduate students, including students from other disciplines.\r\n\r\nHe is the author of From Slogans to Mantras: Social Protest and Religious Conversion in the Late Vietnam War Era (Religion and Politics).\r\n\r\nhttps://www.amazon.com/Slogans-Mantras-Religious-Conversion-Religion/dp/0815629486",
      "release": "2024-09-11T19:00:00Z",
      "duration": "02:01:06",
      "explicit": false,
      "youTubeId": "2EApXU8piHk",
      "subjects": [
        "Cult-Expert",
        "Children Of God",
        "Scientology",
        "Heaven\u0027s Gate",
        "Church Universal and Triumphant",
        "Peoples Temple",
        "Ant Hill Kids",
        "Unification Church",
        "Bhagwan Shree Rajneesh",
        "Aumism",
        "Dera Sacha Sauda",
        "Divine Light Mission",
        "Cult Apologists"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2EApXU8piHk"
      }
    },
    {
      "id": "c751e5e5-d081-424f-a922-07a4288cd988",
      "title": "Rick Alan Ross",
      "description": "Rick Alan Ross is the founder and Executive Director of The Cult Education Institute. He is an internationally known expert regarding destructive cults, controversial groups and movements and author of the book \u0022Cults Inside Out: How People Get In and Can Get Out.\u0022 Since 1982 he has been studying, researching and responding to the problems often posed by controversial authoritarian groups and movements.\r\n\r\nMr. Ross\u0027s commentary has been quoted within publications that include Time Magazine, The New York Times and The Washington Post. His appearances on national television have included a wide range of venues from news programs such as the \u0022Today Show\u0022 and \u0022Dateline\u0022 to popular interview shows such as \u0022Oprah\u0022 and \u0022Inside Edition.\u0022 Mr. Ross has lectured at such prestigious institutions as the University of Chicago, Carnegie Mellon University, Baylor University, Wuhan University, China, and Assumption University, Thailand, among others.\r\n\r\nLearn more about Rick Alan Ross and The Cult Education Institute:\r\n\r\nwww.culteducation.com/culteducation.html",
      "release": "2024-09-06T09:12:27Z",
      "duration": "01:59:20",
      "explicit": false,
      "youTubeId": "4TRqxxaD1Ko",
      "subjects": [
        "Cult-Expert",
        "NXIVM",
        "Scientology",
        "Branch Davidians",
        "Samanta Roy Institute of Science and Technology",
        "Ramtha\u0027s School of Enlightenment",
        "International Churches Of Christ",
        "Hare Krishnas",
        "Unification Church",
        "Cult Psychology",
        "The Saints",
        "Kenneth Copeland",
        "Carbon Nation",
        "Jeffrey Lundgren",
        "Falun Gong",
        "Qanon",
        "Romana Didulo",
        "Israel United in Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4TRqxxaD1Ko"
      }
    }
  ]
}