{
  "_ts": 0,
  "id": "6ff36719-bbc8-4e23-88d7-4863057f8d5a",
  "name": "Experiential Dreamwork",
  "youTubeChannelId": "UCF4rO26WhnMVn945ygKXJ6w",
  "episodes": [
    {
      "id": "1687f685-557e-465b-bd95-8753a62fab4c",
      "title": "An Everyday Cult with Gerette Buglion",
      "description": "We explore the dynamic of unethical persuasion especially in the context of dreams. Sharing a dream is a vulnerable act. How do we support each other in owning our own dream experiences without unduly influencing each other? Today we talk with Gerette Buglion about her new book, An Everyday Cult. Gerette is passionate about promoting ethical forms of self-discovery.\n\n\n\nWe talk about gentle ways of exploring dreams together and about what red flags to look out for around choosing a practitioner. Gerette shares some of her experiences about how her life was upended through a cult whose spiritual center involved manipulative dream analysis.\n\n\n\nWe talk about Gerette’s current work in the cult survivor movement and her part in the creation of the #Igotout movement in which people who have escaped from cults are encouraged to share their stories. We finish by talking about NXIVM and QAnon and the Unification Church (aka the Moonies).\n\n\n\nGerette hosts a podcast called Everyday Cults, Everyday People. You can also learn more about cults and get help through organizations including the International Cultic Studies Association (https://www.icsahome.com/) . She also hosts a writing class called “Writing to Reckon” (https://www.gerettebuglion.com/writingtoreckon) .\n\n\n\nBio: Gerette Buglion B.A. Elementary Education and Special Education, was born on Long Island NY and migrated north, eventually landing in Vermont. Her work and passions merged in caring for others as an elementary school teacher, special educator, house parent for people with special needs, a hiking guide and business owner. Her greatest accomplishments include parenting two exceptional young adults, marrying an extraordinarily understanding man and escaping from what she calls ‘an everyday cult’.\n\n\n\nAlso the title of her memoir, An Everyday Cult shows how an innocent quest for meaning was hijacked by a teacher who recognized Gerette’s thirst for spiritual knowledge, awakening insight – while simultaneously eroding her capacity for critical thinking. In her book, she shows readers how a mind and psyche can be compromised by a controlling leader—using techniques that fly under the radar of human awareness—and implores readers to wake up to these ever-present abuses of power.\n\n\n\nHer current work in Cult Recovery and Education arises from her dedication to helping others navigate and avoid complex power systems found in controlling groups the world over. Gerette has been a regular presenter at the annual conference for ICSA, the International Cultic Studies Association since 2015. Her signature writing course called, ‘Writing to Reckon’ offers a safe space for cult survivors to share their story through written word. She works as a consultant and educator in cult dynamics for individuals, families and organizations of all kinds and is a founding collaborator of the #iGotOut movement, whose sole mission is to encourage people who have experienced cultic abuse to tell their stories to help steer society towards a new day where abuse of power is not tolerated.\n\n\n\nShe is especially excited to be a guest on The Dream Journal since the cult she was involved with for 18 years used dream analysis as a controlling technique. Her cult recovery process over the last seven years has included creating new and gentler ways of exploring dreams which continue to inform, support and inspire her. Gerette is passionate about promoting ethical forms of self-discovery.\n\n\n\nYou can contact her at her webpages:\n\n\n\nGeretteBuglion.com (http://GeretteBuglion.com) \n\n\n\nIgotout.org (http://Igotout.org) \n\n\n\nAnd you can",
      "release": "2024-11-07T00:37:14Z",
      "duration": "00:58:22",
      "explicit": false,
      "youTubeId": "hZ-Vt63CauU",
      "subjects": [
        "Cult Recovery",
        "Center For Transformational Learning"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hZ-Vt63CauU"
      }
    },
    {
      "id": "4306e760-39dd-434c-a4b3-4c49e87ee079",
      "title": "Losing a Loved One to a Cult with Gerette Buglion",
      "description": "Have you ever lost a loved one to a controlling group? Whether around religion, self-improvement or politics, such losses can be devastating. Today we have a conversation with author and cult-recovery educator Gerette Buglion about why it is so important to keep open communication with the loved one and to offer our support for them even if we don’t understand what they are getting from that group.  Gerette speaks about indoctrination and provides a check list we can use when questioning whether that group (or person) we have been so excited about might be a cult. We take a call from Veronica from Santa Cruz who asks how we can help loved ones get out of cults. She shares her story of taking the drastic step of leaving the US for a year to disentangle herself from a cult.\n\n\n\nGerette offers a three week class starting October 18 called Writing to Reckon for Loved Ones in addition to her ongoing Writing to Reckon classes for people who are looking to process time spent in a high control group or relationship (check the image below or Gerette’s IG feed). Gerette closes with a dream about reconciliation and forgiveness around her own cult experience.\n\n\n\nBIO: Gerette Buglion is author of An Everyday Cult, a memoir which shows how her innocent quest for meaning left her open to manipulation by a controlling dream teacher. Gerette’s current work is in Cult Recovery and Education. Her signature writing course called, ‘Writing to Reckon’ offers a safe space for cult survivors to share their stories. She is a founding collaborator of the #iGotOut movement, whose mission is to encourage people who have experienced cultic abuse to tell their stories. She also has a podcast called Everyday Cults, Everyday People.\n\n\n\nIG: @Gerette.Buglion\nWebsites: GeretteBuglion.com (https://www.gerettebuglion.com/) , iGotOut.org (https://www.igotout.org/) \nPodcast: Everyday Cults, Everyday People\n\n\n\n\nIntro music is Water over Stones and outro music is Everything both by Mood Science. Today’s ambient music is created by Rick Kleffel. The audio can be found at Pandemiad.com (http://Pandemiad.com) . Many thanks to Rick Kleffel for also engineering the show, to Tony Russomano for answering the phones and to Ewa Malady for audio editing.\n\n\n\nShow aired on October 15, 2022.\n\n\n\n \n\n\n\nThe Dream Journal is produced at and airs on KSQD Santa Cruz, 90.7 FM, streaming live at KSQD.org (https://ksqd.org)  10-11am Saturday mornings Pacific time.  Catch it live and call in with your dreams or questions at 831-900-5773 or at onair@ksqd.org (mailto:onair@ksqd.org) .\n\n\n\nIf you want to contact Katherine Bell with feedback, suggestions for future shows or to inquire about exploring your own dreams with her, contact katherine@ksqd.org (mailto:katherine@ksqd.org) , or find out more about her at ExperientialDreamwork.com. (https://ExperientialDreamwork.com) \n\n\n\nThe complete KSQD Dream Journal podcast page can be found at ksqd.org/the-dream-journal (https://ksqd.org/the-dream-journal/) .\n\n\n\nYou can also check out The Dream Journal on the following podcast platforms:  Rate it, review it, subscribe and tell your friends.\n\n\n\nApple Podcasts  (https://podcasts.apple.com/us/podcast/the-dream-journal/id1477932534) \n\n\n\nGoogle Play  (https://podcasts.google.com/search/the%20dream%20journal) \n\n\n\nStitcher   (https://www.stitcher.com/s?fid=468241\u0026refid=stpr)",
      "release": "2024-11-07T00:37:00Z",
      "duration": "00:54:25",
      "explicit": false,
      "youTubeId": "_ajKbMVy-eU",
      "subjects": [
        "Cult Recovery",
        "Center For Transformational Learning"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_ajKbMVy-eU"
      }
    }
  ]
}