{
  "_ts": 0,
  "id": "d6520995-1bad-4d1d-9788-9b363bfc53c5",
  "name": "Ex-Worldwide Truth Seekers - WWCG",
  "youTubeChannelId": "UCmjsbD648TefTcoxel0mCgg",
  "episodes": [
    {
      "id": "adf39e01-7c45-43b7-aa7d-fdd60bb43953",
      "title": "Worldwide Church of God - Part II - Interview with Scott Williams - Rising Up Again and His Recovery",
      "description": "Scott Shares How Elder Father Was Ex-Communicated by United Church of God - Affecting His Health - Eventually Killing Him.  Scott shares how he believes today,   More on his 10 years of breakdown and dealing with this.  How did he get out and why.  What he still struggles with today - \u0022the wall\u0022 he put up (and likewise his father) in order to protect ourselves.  The moment we stop playing god in our lives and in the lives of other and the process of \u0022Surrender\u0022.  The splintering of the church and still splintering to the point of so much splitting, division and splintering that we begin to go straight to God.\n\n#Ex-Worldwide Church of God  #Armstrongism #struggle , #darknightofthesoul  #cultrecovery \n\nAngela is an Ex-Worldwide Truth Seeker who seeks to encourage and uplift through words and song (music).\nTo Learn More (and find other uplifting messages or music and videos):\nGo To:\nhttps://www.AngelasInspirations.com\nFacebook:  Ex-Worldwide Truth Seekers\nFacebook:  Angela\u0027s Inspirations\nDan \u0026 Angela Clark - Youtube Chanel:  Life After Religion\n\nAngela is also an Empower Her Life Coach (to learn more, go to https://www.AngelasInspirations.com and sign up.",
      "release": "2024-10-15T22:18:22Z",
      "duration": "00:38:32",
      "explicit": false,
      "youTubeId": "IA_lLg2gUQs",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IA_lLg2gUQs"
      }
    },
    {
      "id": "a34ce3f3-ca3b-448c-9593-99381f17641a",
      "title": "Ex -Worldwide Church of God - Guest: Scott Williams - His Life In, then 10 Critical Dark Night Years",
      "description": "Born in to the church in Cincinnati, OH, Scott shares the painful 10 years after leaving - losing himself and struggling to survive. - experiencing a \u0022dark night of the soul\u0022.  He shares what it was like growing up as an  Elder\u0027s son, his father giving his life to counsel the people who called on him to fix them since he was an Elder and there were no mental health services available in the church. Scott was expected to be  perfect  and the \u0022example\u0022 and feeling in his school years that \u0022they\u0022 were \u0022of the world\u0022 and he was a special, called out one and just didn\u0027t ft in especially since the world was going to end in 6 months so why try.  News of mom\u0027s critical life threatening illness with no treatment after he\u0027d been gone 10 years.  Experience with Mom and Sister at a Powerful Week Long Retreat and how everything changed - lights came on!  He\u0027s very glad to be free now and with his mind back.\n\n#Ex-Worldwide Church of God  #Armstrongism #struggle , #darknightofthesoul  #cultrecovery \n\nAngela is an Ex-Worldwide Truth Seeker who seeks to encourage and uplift through words and song (music).\nTo Learn More (and find other uplifting messages or music and videos):\nGo To:\nhttps://www.AngelasInspirations.com\nFacebook:  Ex-Worldwide Truth Seekers\nFacebook:  Angela\u0027s Inspirations\nDan \u0026 Angela Clark - Youtube Chanel:  Life After Religion\n\nAngela is also an Empower Her Life Coach (to learn more, go to https://www.AngelasInspirations.com and sign up.",
      "release": "2024-10-12T18:15:05Z",
      "duration": "00:33:58",
      "explicit": false,
      "youTubeId": "A3mShHB20Yo",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A3mShHB20Yo"
      }
    },
    {
      "id": "648bfa85-fd52-48ed-a97c-2edcbbc8107b",
      "title": "2024  FALLING INTO FALL - And Being Able to Enjoy the Pumpkin Patches, Fall Decorations, Apple Cider",
      "description": "WWCOG Made us Feel So Fearful of Anything to do With the Fall Season, But It\u0027s Not ALL Bad \u0026 Evil.  Here\u0027s another view of the Fall Season and the good that is in it aside from the Halloween part of it (which I still don\u0027t like). But as a Worldwider, again, it seems like the fall was a dreaded time because people starting putting out bales of hay, scarecrows, having apple spiced apple cider, decorating with leaves and corn \u0026 corn husks and of course all the halloween stuff too.  But we feared it all.  We couldn\u0027t even see any of the good in any of it.  But God made fall and we should enjoy it.  There\u0027s a lot of good to be found in it.  Let me show you how rather than just pure avoidance.\n\nAngela is an Ex-Worldwide Truth Seeker who seeks to encourage and uplift through words and song (music).\nTo Learn More (and find other uplifting messages or music and videos):\nGo To:\nWebsite: https://www.AngelasInspirations.com\nFacebook:  Ex-Worldwide Truth Seekers\nFacebook:  Angela\u0027s Inspirations\n\nAngela is also an Empower Her Life Coach (to learn more, go to https://www.AngelasInspirations.com and sign up.",
      "release": "2024-09-11T23:20:23Z",
      "duration": "00:14:11",
      "explicit": false,
      "youTubeId": "iO9mpazxbms",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iO9mpazxbms"
      }
    },
    {
      "id": "562aacf0-89c1-4581-b75b-0f17ba3092f2",
      "title": "Part II -Clean \u0026amp; Unclean Foods - Giving You the Proof You Need; Finally Be Rid of the Guilt for Good",
      "description": "I really lay it out here for you coming straight from the bible to show that we don\u0027t need or want to concern ourselves with this old covenant law any longer nor guilt our family or friends who see it differently as that is also wrong.  But after you listen to this - I bet you\u0027ll clearly see the \u0022other side\u0022 of this teaching as even Jesus spells it out.  Why were we so blind to this?  How could our parents not have seen it.  I guess the only answer is that they want to feel safe  as their is safety in keep a set of laws that will get you into the God\u0027s good graces and the kingdom.  Abraham\u0027s kind of faith?  Forget that.  Too much work - too much unknown.  So, our minds can become blind and cannot see until we turn to God finally - who removes our blinders.  Amazing.  but I\u0027ve laid it all out here.  Hope you\u0027ll listen all the way through\n\nAngela is an Ex-Worldwide Truth Seeker who seeks to encourage and uplift through words and song (music).\nTo Learn More (and find other uplifting messages or music and videos):\nGo To:\nhttps://www.AngelasInspirations.com\nFacebook:  Ex-Worldwide Truth Seekers\nFacebook:  Angela\u0027s Inspirations\n\nAngela is also an Empower Her Life Coach (to learn more, go to https://www.AngelasInspirations.com and sign up.",
      "release": "2024-09-08T01:54:51Z",
      "duration": "00:33:25",
      "explicit": false,
      "youTubeId": "i7mCkLFN8hs",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=i7mCkLFN8hs"
      }
    },
    {
      "id": "4c8a73d9-aef3-4653-b4b3-3a654cc4a0cc",
      "title": "Why Do I Still Fear After Leaving My Faith or Relationship?",
      "description": "Dan \u0026 Angela Clark share their perspective on Program \u0022Spiritual Discoveries\u0022\n\nhttps://www.AngelasInspirations.com\nFacebook:  Angela\u0027s Inspirations\n\nAngela is also an Empower Her Life Coach (to learn more, go to https://www.AngelasInspirations.com and sign up.",
      "release": "2024-08-29T00:04:18Z",
      "duration": "00:45:51",
      "explicit": false,
      "youTubeId": "SX2w3DQA1SM",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SX2w3DQA1SM"
      }
    },
    {
      "id": "34199b31-10c1-4ad1-aae6-4b646e3c0a97",
      "title": "Series - Part Two - Unclean Foods  -  Do You Still Question Whether You Should Be Feeling Guilty...?",
      "description": "What if Scripture is \u0022real clear\u0022 about this subject here, but our minds have been programmed to believe a different way; that we\u0027re the \u0022special \u0026 chosen ones\u0022 because we do this and we do that - different than \u0022the world\u0022 and \u0022those rebellious people out there\u0022?  Let\u0027s just get it straight from the bible and then I\u0027ll share my perspective a little here and there.  But you decide - no need to listen to me!  I\u0027m just going to present the straight bible that seems to say something completely different than the way we were taught from the way I see it after reading these \u0022other\u0022 scriptures and putting them all together.  I\u0027m not persuaded by any other religion either - this is my own research.  So, don\u0027t trust me, but maybe just listen to what I read here and you decide for yourself.\n\nAngela seeks to encourage and uplift through words and song (music).\nTo Learn More (and find other uplifting messages or music and videos):\nGo To:\nhttps://www.AngelasInspirations.com\nFacebook:  Angela\u0027s Inspirations\n\nAngela is also an Empower Her Life Coach (to learn more, go to https://www.AngelasInspirations.com and sign up.",
      "release": "2024-08-28T22:31:00Z",
      "duration": "00:33:55",
      "explicit": false,
      "youTubeId": "VM-u177rs1M",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VM-u177rs1M"
      }
    },
    {
      "id": "fe98ca67-2351-44a5-bdb2-2be903e1d191",
      "title": "\u0026quot;Getting Free\u0026quot; of the WWCOG Hooks  (That Keep Us Stuck/Bound)  Part 1 of 7 (series)  UNCLEAN Meats!",
      "description": "This  is Video 1 of a New Series With the Goal of Getting Unhooked for the WWCOG Programming That Still Keeps us Bound in Chains with Doubt, Fear Guilt and Uneasiness After Leaving Even Years and Years Later. Time to get to the bottom and GET FREE!  In this video - we talk about the keep us bound concerning eating \u0022unclearn foods\u0022\n\nVideo Provided by:  Dan and Angela Clark\nWebsite: www.angelasinspirations.com (For Ex-WWCOG)\nWebsite: www.prodigaljourneys.com - Dan\u0027s. (For Ex-JW\u0027s)\nFacebook: Ex-Worldwide Truth Seekers\nFacebook:  Life After Religion\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-08-10T00:57:47Z",
      "duration": "00:33:39",
      "explicit": false,
      "youTubeId": "5rIuKMRxKBM",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5rIuKMRxKBM"
      }
    },
    {
      "id": "72a35091-a521-4267-a144-fa500971329c",
      "title": "Who Am I?  Could I Be Suffering from \u0026quot;Limiting Beliefs\u0026quot;?   For Former WWCOG and Former JW\u0026#39;s",
      "description": "Dan and Angela Clark Are Discussing: What is holding us back from experiencing an authentic and happy life?  Could it be the Matrix of False Beliefs that we\u0027re stuck in? And how can we discover these hidden false beliefs?  How do we overcome?  Our Guest is Grace from Sweden\n\nVideo Provided by:  Dan and Angela Clark\nWebsite: www.angelasinspirations.com (For Ex-WWCOG)\nWebsite: www.prodigaljourneys.com - Dan\u0027s. (For Ex-JW\u0027s)\nFacebook: Ex-Worldwide Truth Seekers\nFacebook:  Life After Religion\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-08-07T22:41:08Z",
      "duration": "01:18:08",
      "explicit": false,
      "youTubeId": "1W0EbzUl6nE",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1W0EbzUl6nE"
      }
    },
    {
      "id": "8eab8587-bbaa-41cc-81e2-34e114c4d668",
      "title": "Were You Raised to Have Fear Around Money?  Feeling Guilt for Accepting Good for Yourself.  WWCOG?",
      "description": "Are you  seeking for change and doing all you can to make the change - but it\u0027s just not happening.  Well Dan and Angela show the mechanics of how to make your faith work for you using real examples from their own lives.  They share how we have to first change our belief system programmed into us, how they managed to do that themselves and how it will work for you too  - if the same steps are followed (changing your mind).  This is well mapped out with scriptures that you may have never seen before.  We were taught to not want for anything more than \u0022sustenance and covering\u0022 and to feel guilty if we do (want more for ourselves).  Well, the scriptures prove that God clearly does want more for us and that all of these promises (and God\u0027s wishes for us) are clearly spelled out.   Great change for you can be just around the corner.  Do you want change?  Check it out.\n\nVideo Provided by:  Dan and Angela Clark\nWebsite: www.prodigaljourneys.com - Dan\u0027s\nWebsite: www.angelasinspirations@gmail.com\nFacebook: Ex-Worldwide Truth Seekers\nFacebook:  Life After Religion\nFacebook: Truth Beyond the Veil\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-07-29T04:25:29Z",
      "duration": "01:18:21",
      "explicit": false,
      "youTubeId": "65KWu9aF6BA",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=65KWu9aF6BA"
      }
    },
    {
      "id": "ef61bdb0-e9f8-48fa-ac77-6b93cd5c6f00",
      "title": "Ex-Worldwide Church of God  - Sheila Hinzman Speaks Out For the First Time - Shares Success Story",
      "description": "Sheila is amazing!  She managed to rise above her circumstances and even go to college - graduating with associate\u0027s degree in Nursing with high honors!  She has been through a lot, but managed to get free!  I\u0027m so touched by her strength and character.  She a husband and 4 beautiful sons that love and respect her!  Great interview!",
      "release": "2024-07-15T03:48:07Z",
      "duration": "01:04:57",
      "explicit": false,
      "youTubeId": "rQeMUGGyXss",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rQeMUGGyXss"
      }
    },
    {
      "id": "b703db9e-6617-4c8d-ab47-c9db0f126208",
      "title": "Did You Live in a Toxic Household? Find Out Now! The Life of Your Dreams Can Be Realized When You...",
      "description": "Accept that YOU Matter - Yes You Matter!  As children - we all should have been cared for, nurtured, loved unconditionally and been treated with respect,  feeling validated, listened to and heard. Not living in this healthy household will cause havoc on our personal opinion of ourselves - affecting our life now!  \nWhen you come to believe and face the truth about who you \u0022really\u0022 are and not the piece of sh...t that you have always believed you are; forever wondering why you were made to be that way - less than perfect - things will begin to change rapidly in your life.  First comes the awareness of the dysfunctional tactics used in your family of origin and/or church, etc., like parents not respecting your boundaries, your feelings, being gaslighted, siblings being pitted against each other and one being favored more than another causing hatred, jealousy, competition; being loved conditionally and only when you obey and perform and NOT if you don\u0027t, etc. If this is not looked at and faced, then it becomes the definition of insanity:  doing the same thing the same way over and over and expecting to get a different result.  \nI (Angela) got out of my second cult when I was nearly dead.  I asked for help from a God a thought hated me, and quickly found help.  That help lead me to the information we are sharing with you today.  It wasn\u0027t easy to face, but with support of a few new people that were brought into my life at that time and a few classes and two powerful books - my life began to change quickly.  I was married within a year and I have never looked back and continue to change to this day as we all should really, until we pass on.\n\nVideo Provided by:  Dan and Angela Clark\nWebsite: www.prodigaljourneys.com - Dan\u0027s\nWebsite: www.angelasinspirations@gmail.com\nGroup: The Matrix of Abundance\nFacebook:  Life After Religion\nFacebook: Truth Beyond the Veil\nFacebook: Ex-Worldwide Truth Seekers\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-06-28T21:52:13Z",
      "duration": "01:18:55",
      "explicit": false,
      "youTubeId": "APymK2s66cM",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=APymK2s66cM"
      }
    },
    {
      "id": "75d717c9-39d1-4a16-bb15-900120286a79",
      "title": "Men \u0026amp; Women Getting Along - The Best Kept Secret",
      "description": "The more he read scripture, the madder I got.  Is that you?  There is much controversy and pain around this topic from a bible perspective.  What is the right/correct perspective?  Dan and Angela discuss the various aspects of marriage sharing their understanding and perspectives regarding how marriage best works. We share how marriage, seen from the proper perspective, can lead to a very rewarding marriage and life.  A very unique perspective indeed.\n\n\n\n\nVideo Provided by:  Dan and Angela Clark\nWebsite: www.prodigaljourneys.com - Dan\u0027s\nWebsite: www.angelasinspirations@gmail.com\n\nFacebook:  Life After Religion\nFacebook: Truth Beyond the Veil\nFacebook: Ex-Worldwide Truth Seekers",
      "release": "2024-06-28T05:30:55Z",
      "duration": "01:24:03",
      "explicit": false,
      "youTubeId": "HQRWrQkeuUU",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HQRWrQkeuUU"
      }
    },
    {
      "id": "9f90ddd9-eba5-4c76-adba-59d742620c0f",
      "title": "Did HWA \u0026amp; WWCG Destroy Your Family by their Painful Marriage \u0026amp; Divorce Beliefs \u0026amp; Demands?",
      "description": "Boy did this church mess up a lot of families!  Was your family ripped apart by their way of looking at marriage and divorce? It was all so wrong in so many ways and we\u0027re going to break this down.  Why and what was wrong about it.  \n#worldwide church of God #cults #HWA, #GTA, #marriage, #divorce beliefs\n\nAngela Clark is NOW OFFERING:  Empower Her Life Coach - helping woman find their authentic expression and freedom by getting their voices; To Do More, Be More and Have More - Hope, Friends...\nTO SCHEDULE A SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\nDan Clark is an Intuitive Breakthrough Coach\nTO SCHEDULE A SESSION:  Email Dan at myprodigaljourney@gmail.com\nhttps://www.ProdigalJourneys.com\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-06-08T02:55:34Z",
      "duration": "00:35:19",
      "explicit": false,
      "youTubeId": "yaUbx9nIy9I",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yaUbx9nIy9I"
      }
    },
    {
      "id": "a84e4737-f8c5-4b4b-b65f-9cba1ee6f8c0",
      "title": "Ex-WWCOG Truth Seekers! Not Allowed to Enjoy Success?  Fear of Being Worldly? Has This Crippled You?",
      "description": "Since Leaving WWCOG - Melina Oine made a hard decision, when it was almost too late to do it that she would GO BACK TO SCHOOL (College) and BECOME A HEALTH ADVOCATE!  None of it made any sense at the time considering her circumstances, her upbringing and especially WWCOG ability to keep woman from becoming much of anything but a homemaker.  She put one foot in front of the other doubting herself much of the time - but with much love and support - she GRADUATED with a MASTERS Degree in Health Advocacy a week ago!\nCongratulations Melina and congratulations for overcoming the programming about how woman are not meant to succeed - let alone men for fear that this is worldly!  What do you think about this?  Do we need to experience success and a sense of accomplishment and the building of a certain sense of self with a bit of self-esteem to keep you confident and strong?  We say YES!  Armstrong used this tool to keep us all under his thumb of control along with his Leaders and Ministers.\n\nAbout Melina Oine. Melina was born and raised in the WWCOG. Her family officially got out in the mid 90;s shortly after Tkach Jr. took on the mantle when Melina  was 17.  Melina actually almost completely stopped attending around the age of 15-16.  In her earlier years, Melina attended services in Anchorage Alaska until about 1985. At that point, her family moved to Honolulu, Hawaii where Melina lived until she was married at age 18 to a Navy  Marine.  They had 3 children together  About 12 years later, her  daughter was diagnosed with a life threatening disease which landed her in and out of emergency rooms and hospitals and soon after, Melina herself was diagnosed with an auto-immune condition that she was now also dealing with at the same time and started therapy.   That pushed her to look at her past and current traumas.  She discovered that the conditioning from childhood had predisposed her to being involved in a dysfunctional and traumatic  marriage and learning this, she was eventually at a point where she was able to leave the marriage.  \n\nMelina recently moved to South-East Washington state where she now lives with her daughter and where she also has recently become board certified (BCPA) as an Independent Patient Advocate and now has just received her Masters in Health Advocacy!\n\nAngela Clark is NOW OFFERING:  Empower Her Life Coach - helping woman find their authentic expression and freedom by getting their voices; To Do More, Be More and Have More - Hope, Friends...\nTO SCHEDULE A SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\nDan Clark is an Intuitive Breakthrough Coach\nTO SCHEDULE A SESSION:  Email Dan at myprodigaljourney@gmail.com\nhttps://www.ProdigalJourneys.com\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK:\nhttps://us06web.zoom.us/j/84007457250?pwd=bDanz7RsA2fAoUJ4qvpCyXbwz52Z9V.1\n\nMeeting ID: 840 0745 7250\nPasscode: 288119\n\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-05-31T06:00:26Z",
      "duration": "01:18:22",
      "explicit": false,
      "youTubeId": "ykJppw4B5Xk",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ykJppw4B5Xk"
      }
    },
    {
      "id": "79494c5a-f7c5-45b7-ae8b-aaa934967b64",
      "title": "Wow! I Was In a Frickin Cult!  Here\u0026#39;s How I Know.  Ex-Member of WWCG and JW - This is for Us!",
      "description": "We often wonder when we get out of an organization if we really truly were in a cult.  We think of Jim Jones, David Koresh,  James Manson, etc. where people got killed for thinking they were following God through this man.  Well, there are signs of a cult which we\u0027ve gathered in here as well as the definition of a cult.  It\u0027s all very interesting.  After reading through these, we take the time to examine our cult next to the \u0022the list\u0022.  We\u0027re able to give a definitive answer after reading back through the list at the end.  OMG!\n\nAngela Clark is NOW OFFERING:  Empower Her Life Coach - helping woman find their authentic expression and freedom by getting their voices; To Do More, Be More and Have More - Hope, Friends...\nTO SCHEDULE A SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\nDan Clark is an Intuitive Breakthrough Coach\nTO SCHEDULE A SESSION:  Email Dan at myprodigaljourney@gmail.com\nhttps://www.ProdigalJourneys.com\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-05-03T20:04:44Z",
      "duration": "00:48:22",
      "explicit": false,
      "youTubeId": "Rb6nrnJOwcI",
      "subjects": [
        "Worldwide Church Of God",
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Rb6nrnJOwcI"
      }
    },
    {
      "id": "914af151-e602-4c3d-a855-531e2a31db40",
      "title": "Was I REALLY in a \u0026quot;Freakin\u0026quot; Cult?  Meet Melina Oien Who Has Figured Some Stuff Out!  Powerful! Wow!",
      "description": "After her Sisters\u0027 Suicide - everything began to change for Melina and her family which lead to massive struggle and painful family changes at around age 14.  Eventually, with serious health challenges for her daughter and herself, Melina reached rock bottom and had no choice but to draw a line in the sand and reach out for help from \u0022the world\u0022 who saved her life from our perspective!  She did the deep dives and after 3 years was willing to talk about \u0022the cult\u0022 and face the deeper \u0022scary stuff\u0022 that brought so much trauma and pain, PTSD and an Auto Immune Condition which was at was at the root of everything.  Amazing Woman, Amazing Story!\n\nMentioned in Show:  The Body Keeps Score\nSaying:  Shame Lives in Silence (and is the silent killer Dan says)\n\nAngela Clark is NOW OFFERING:  Empower Her Life Coach - helping woman find their authentic expression and freedom by getting their voices; To Do More, Be More and Have More - Hope, Friends...\nTO SCHEDULE A SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\nDan Clark is an Intuitive Breakthrough Coach\nTO SCHEDULE A SESSION:  Email Dan at myprodigaljourney@gmail.com\nhttps://www.ProdigalJourneys.com\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-04-06T23:28:24Z",
      "duration": "01:32:07",
      "explicit": false,
      "youTubeId": "fmF1Dtgl6iA",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fmF1Dtgl6iA"
      }
    },
    {
      "id": "953e76f5-73b0-4834-b8cb-cadba23465b7",
      "title": "Part 2/Medical Neglect Gone Mad! Letting People Die Unnecessarily? No Medication? w/Sara Ahrenholtz",
      "description": "People dying unnecessarily due to fear of obtaining medical help even if it was serious - fear of not making it into the Kingdom for lack of faith or disobedience to the law as interpreted by men (pedophiles even).  Oh My Goodness!  The stories you will hear in here!  Did you experience similar?  People not getting help with Cancer to their dying day.  Sara losing her friend Kelly to cancer at age 9!!! but standing firm by her faith to her dying day, perhaps wanting to please her parents.  Poor thing!  Were these pastors who guilted them when they mentioned the possibility of getting help also responsible for murder? Keeping them from getting medical help - like the Jehovah\u0027s Witnesses who couldn\u0027t take blood (with a person assigned to make sure they didn\u0027t at the hospital)?\n\nMentioned in Video:  Insighttimer (meditations)\n                                     hwalibary.com\n                                     hwarmstrong.com\n                                     thepainfultruth.org\n\nAngela Clark is NOW OFFERING:  Empower Her Life Coach - helping woman find their authentic expression and freedom by getting their voices; To Do More, Be More and Have More - Hope, Friends...\nTO SCHEDULE A SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\nDan Clark is an Intuitive Breakthrough Coach\nTO SCHEDULE A SESSION:  Email Dan at myprodigaljourney@gmail.com\nhttps://www.ProdigalJourneys.com\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-04-06T07:13:18Z",
      "duration": "00:53:37",
      "explicit": false,
      "youTubeId": "gU8M8ptpi-E",
      "subjects": [
        "Worldwide Church Of God",
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gU8M8ptpi-E"
      }
    },
    {
      "id": "1350bc42-2c15-4025-bd3e-0d9b7ea0f146",
      "title": "Part 1 -Shocking Stories of Medical Neglect in the Worldwide Church of God w/Guest - Sara Ahrenholtz",
      "description": "People dying unnecessarily due to fear of obtaining medical help even if it was serious - fear of not making it into the Kingdom for lack of faith or disobedience to the law as interpreted by men (pedophiles even).  Oh My Goodness!  The stories you will hear in here!  Did you experience similar?  People not getting help with Cancer to their dying day.  Sara losing her friend Kelly to cancer at age 9!!! but standing firm by her faith to her dying day, perhaps wanting to please her parents.  Poor thing!  Were these pastors who guilted them when they mentioned the possibility of getting help also responsible for murder? Keeping them from getting medical help - like the Jehovah\u0027s Witnesses who couldn\u0027t take blood (with a person assigned to make sure they didn\u0027t at the hospital)?\n\nMentioned in Video:  Insighttimer (meditations)\n                                     hwalibary.com\n                                     hwarmstrong.com\n                                     thepainfultruth.org\n\nAngela Clark is NOW OFFERING:  Empower Her Life Coach - helping woman find their authentic expression and freedom by getting their voices; To Do More, Be More and Have More - Hope, Friends...\nTO SCHEDULE A SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\nDan Clark is an Intuitive Breakthrough Coach\nTO SCHEDULE A SESSION:  Email Dan at myprodigaljourney@gmail.com\nhttps://www.ProdigalJourneys.com\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-04-04T06:29:49Z",
      "duration": "00:46:40",
      "explicit": false,
      "youTubeId": "DzmpuHCA22Q",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DzmpuHCA22Q"
      }
    },
    {
      "id": "532649f9-079f-46d9-97d3-f0b48222c6b8",
      "title": "Interview with Gayle Markley - Former Member - WWCG  - Still Has Good Memories but Struggling",
      "description": "Gayle shares her struggle with balancing the fact that she grew in a cult and the fact that her parents were good people who were just doing the best they could and not wanting to give them a bad name in any way.  A real struggle inside to not be in denial and give credit where credit is due.\n\nWebsite:  https://www.AngelasInspirations.com\nFacebook Page:  Ex-Worldwide Truth Seekers (WWCG)\nGroup:  Ex-Worldwide Truth Seekers and Off-Shoots\nEmail:  exworldwidetruthseekers@gmail.com\nDan\u0027s Website: https://www.ProdigalJourneys.com\nFacebook:  Life After Religion \n\nNEW:  Angela is an EMPOWER HER LIFE COACH\nTO SCHEDULE A COACHING SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.",
      "release": "2024-04-01T16:56:32Z",
      "duration": "01:31:20",
      "explicit": false,
      "youTubeId": "tY0pcuRtpJM",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tY0pcuRtpJM"
      }
    },
    {
      "id": "4c0b1288-c9a4-4878-93d3-31a85cd117c9",
      "title": "Sara Ahrenholtz - SPEAKS OUT After Coming Out of a CULT - Worldwide Church of God - For First Time!",
      "description": "EPISODE 1 - Coming Out of Denial After Coming Out of a Cult is Step 1.  Being Honest About What Was Experienced is probably Step 2. Then being validated, often through counseling of some sort is very key and probably Step 3.  From there, healing can ensue as we continue to let go of the fear, the guilt, the lies, etc.  Sara tells about what it was like living under the heavy duty control in this mind bending, law driven, fear intense abusive cult. Dan and Angela (who was once in this cult) host the show and this is just the beginning, this being Episode 1 with Sara Ahrenholtz.  More to Come! \n\nAngela Clark is an Empower Her Life Coach.  If you need to be uplifted or encouraged, schedule an appointment today!  Go to:  https://www.AngelasInspirations.com and then to Coach Tab or email her at exworldwidetruthseekers@gmail.com\n\n\nFacebook: Ex-Worldwide Truth Seekers\nFacebook: Life After Religion\nWebsite link: https://www.AngelasInspirations.com\nWebsite Link: https://www.prodigaljourneys.com",
      "release": "2024-03-30T21:31:36Z",
      "duration": "01:08:10",
      "explicit": false,
      "youTubeId": "1iI1QHa75DE",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1iI1QHa75DE"
      }
    },
    {
      "id": "215e1026-c350-4b85-9cc0-4d3befe0ee57",
      "title": "Perfectionism Sufferers - There is Hope for Us!  Listen: \u0022I Love You Just the Way You Are\u0022",
      "description": "In this video, I will give you an arsenal of tools to overcome and how to see this differently. What we were taught growing up (usually from religion) that we\u0027re never good enough and will never measure up either.  That God will never be happy with us.  When we think we\u0027ve got a handle on a weakness and manage to pat ourselves on the back, the next day - a solid setback.  Another failure - I failed myself, I failed God.\n\nWebsite:  https://www.AngelasInspirations.com\nEmail:  exworldwidetruthseekers@gmail.com\n\nTO SCHEDULE A COACHING SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\n\nCheck This Out:  ZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956...\nMeeting ID: 871 7520 5956\nPasscode: 777992\n\nDONATIONS Welcome:  Link:  https://paypal.me/CoachMe777?country....",
      "release": "2024-03-03T05:40:12Z",
      "duration": "00:22:55",
      "explicit": false,
      "youTubeId": "U1iXh-OwgDE",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=U1iXh-OwgDE"
      }
    },
    {
      "id": "de328bbc-aaf3-407e-8d27-d3bb4eeb82ae",
      "title": "Am I Killing Myself with My Hate Thoughts Towards the World?",
      "description": "We can get sour and resentful within ourselves when life and the world doesn\u0027t give us what we think we deserve.  Many of us were taught in our religions that the world is an unsafe place and is bad and a depressing place to be in.  We need to change our mind about this so we can function in this world in a way that supports what we are here on earth to do - not just waiting for it to end.  We see everyone as separate from us.  We have to learn to love our neighbor as we love ourselves which IS loving ourselves.  Dr. David R. Hawkins teaches about what happens when our thoughts and vibrations (negative or positive) affects our body, our health and our feeling that life is good or not good.  So we want to strive to be in the flow with God type thoughts - Joy, hopeful, optimistic, peace, harmony, etc.  \n\nWebsite:  https://www.AngelasInspirations.com\nEmail:  exworldwidetruthseekers@gmail.com\n\nTO SCHEDULE A COACHING SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\n\nCheck This Out:  ZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956...\nMeeting ID: 871 7520 5956\nPasscode: 777992\n\nDONATIONS Welcome:  Link:  https://paypal.me/CoachMe777?country....",
      "release": "2024-02-21T04:15:35Z",
      "duration": "00:27:03",
      "explicit": false,
      "youTubeId": "G4wxdFoqGMg",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G4wxdFoqGMg"
      }
    },
    {
      "id": "8463a30e-f9fd-4710-8ea1-d32906cc4ed4",
      "title": "Men Have an Ancestral Heart Wounding (Don\u0027t Cry) Woman to the Sacral Area (abdomen).How to Fix This?",
      "description": "Angela and Dan Clark discuss how men have not been in their hearts due to long time ancestral programming being told that they are never to show emotion, never to cryand woman have received the same wounding but to the sacral area (abdomen) which we need to acknowledge so that healing can begin.  Men need to be able to open their hearts again and not be afraid to be emotional, cry, be sensitive. Women have been told to not be strong, courageous or bold - but encouraged to be weak with no voice but check out the Proverbs 31 woman. She wasn\u0027t at all weak or quiet!.  Both need to come to the middle so that we are balanced.  A Balanced Man, a Whole Woman\n\nWebsite:  https://www.AngelasInspirations.com\nEmail:  exworldwidetruthseekers@gmail.com\nFacebook: Ex-Worldwide Truth Seekers\n\n\nTO SCHEDULE A COACHING SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\n\nCheck This Out:  ZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956...\nMeeting ID: 871 7520 5956\nPasscode: 777992\n\nDONATIONS Welcome:  Link:  https://paypal.me/CoachMe777?country....",
      "release": "2024-02-21T04:12:45Z",
      "duration": "00:30:48",
      "explicit": false,
      "youTubeId": "hmRjdbp4crI",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hmRjdbp4crI"
      }
    },
    {
      "id": "86556f17-2f27-4587-85ff-52d3d0b9df8a",
      "title": "How to Overcome the Feeling that This World is a Scary \u0026 Evil Place",
      "description": "This thought if overcome can change your life.  Angela shares compelling thoughts about this.\n\nWebsite:  https://www.AngelasInspirations.com\nEmail:  exworldwidetruthseekers@gmail.com\n\nTO SCHEDULE A COACHING SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\n\nCheck This Out:  ZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956...\nMeeting ID: 871 7520 5956\nPasscode: 777992\n\nDONATIONS Welcome:  Link:  https://paypal.me/CoachMe777?country....",
      "release": "2024-02-21T03:59:01Z",
      "duration": "00:19:26",
      "explicit": false,
      "youTubeId": "DI85gKf9UeE",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DI85gKf9UeE"
      }
    },
    {
      "id": "5ccebd9f-f052-4259-bb84-6a18af4984a7",
      "title": "Time to Use Our Voices.  It\u0027s What We\u0027re All Here to Learn",
      "description": "We\u0027ve all experienced abuse of all kinds and much suffering all for a reason.  We are meant to eventually be fed up with injustice and corruption and stand up - all of us.  Or not.  We can continue to suffer.  But I\u0027m Telling You - We are meant to use it (our past suffering) for good.  Now is that time.  I hope we all begin to speak out for not just ourselves, but for our neighbor, the poor, the widow, the depressed, the mentally ill, the sick and \u0022do unto others as we would have them do to us\u0022. And Jesus said, \u0022as you\u0027ve done it unto the least of these, you\u0027ve done it unto me\u0022.  That\u0027s pretty amazing!  we\u0027ve been through all that we have for \u0022such a time as this\u0022.  I know we can do it!\n\nwww.angelasinspirations.com\nFacebook:  Ex-Worldwide Truth Seekers\nFacebook:  Life After Religion",
      "release": "2023-08-28T04:55:05Z",
      "duration": "00:21:53",
      "explicit": false,
      "youTubeId": "ZxjSa1tZi8M",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZxjSa1tZi8M"
      }
    },
    {
      "id": "d550675b-9f2a-4da8-a773-1ecf38c77c06",
      "title": "Angela Visits a UCG (Former WWCG) Meeting - First Time in 15 Years   No Thanks!",
      "description": "I wanted to see what it feels like now after not having been for 15 years and that last visit was my first time in longer than that.  I am so glad to be out!  I share the attitudes, same old fear tactics, patriarchal control over women and members, depression, severe judgement and distain, hypocrisy, lying and more!  I\u0027ll also give a sneak peak about what is going on in the Old Big Sandy Campus in Texas and the Church of God Church and UCG church on the edge of it on either side.  Interesting!  Shocking!  What is going on!!!",
      "release": "2023-07-31T21:46:21Z",
      "duration": "00:32:47",
      "explicit": false,
      "youTubeId": "G55L163tzHk",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G55L163tzHk"
      }
    },
    {
      "id": "07712182-cefc-482f-b382-0e5b7806938d",
      "title": "A Different Way of Seeing Christmas \u0026 Overcoming Some of the Guilt \u0026 Fear of the Season for Ex-WWCG",
      "description": "Sorting Out How We Feel About This Season is Not Easy With Soooo Much Programming About This Holiday.  Let\u0027s Really Look at It Though with a Fresh Perspective.  We\u0027ll Share How We\u0027ve Been Able to Process it to This Point and Maybe Help You Sort Out Just How to Deal with This Holiday Season and Relatives and Co-Workers too.  Here\u0027s WIshing You a Peaceful Holiday Season!  Dan and Angela Clark",
      "release": "2022-12-04T04:25:40Z",
      "duration": "00:25:58",
      "explicit": false,
      "youTubeId": "Ho0lnmEp3Kw",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ho0lnmEp3Kw"
      }
    },
    {
      "id": "072f0c5c-f6e1-4a81-8b15-a586bcd683bc",
      "title": "How to Overcome the \u0022Stuffing  It Down\u0022  of Years and  How to Deal with the Silent Treatment",
      "description": "Growing up in Worldwide left us without some of the basic tools of communicating properly in our relationships and due to how we were raised - we learned to stuff everything since were weren\u0027t allowed to say what hurt.  In fact - children were to be seen and not heard and were valueless as well as women.  But we can overcome this and take back the control of not only our emotions but our very lives and find some real freedom, learning how to be authentic and easily deal with the dysfunction.  But first, we have to see the dysfunctional in our families for what it is.  We have to overcome the abuse and call it what it was.",
      "release": "2021-06-06T16:32:04Z",
      "duration": "00:22:20",
      "explicit": false,
      "youTubeId": "tZoO6438EvQ",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tZoO6438EvQ"
      }
    },
    {
      "id": "b05ac885-605f-4df1-8a34-cd7da8a6b911",
      "title": "Do You Want Relationships That Are Lasting \u0026 Satisfying? We\u0027ll Share With You Some Powerful Secrets!",
      "description": "Dan and Angela discuss what it takes to have relationships that are satisfying and successful - so that everyone wins and life feels good.  When we were in Worldwide Church of God we didn\u0027t learn these important tools.  We were living in toxic and unhealthy relationships everywhere we went.  We left not feeling like we fit in in this world and not knowing how to function.  We knew we lacked something - but what?  We use real examples to make our point.  We\u0027re honest and real.",
      "release": "2021-03-02T05:55:00Z",
      "duration": "00:34:54",
      "explicit": false,
      "youTubeId": "Rwzbod0_0i4",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Rwzbod0_0i4"
      }
    },
    {
      "id": "7330e05a-e0b4-4b95-bea1-04f8ebe59d76",
      "title": "Here\u0027s How I Got Out!  Betrayal Hurts! Loving My New Life Now!",
      "description": "Angela Clark shares her Moment of Betrayal By the Church and How She Decided to Move On.  Tells Her Story of Facing that She Was in A Cult by a Small Town Pastor. Sharing the Tools that Helped Her and Shares Her Story of Overcoming the Cult.  Check our her website too:  Ex-WorldwideTruth Seekers.com",
      "release": "2021-02-25T05:21:02Z",
      "duration": "00:36:23",
      "explicit": false,
      "youTubeId": "E1uXTvvRYU4",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E1uXTvvRYU4"
      }
    },
    {
      "id": "fb57a96f-0812-4011-a7da-03284f3d57f8",
      "title": "WELCOME to Ex-Worldwide Truth Seekers - Cult Recovery",
      "description": "Feeling Overwhelmed, Lost, Angry - Not Even Sure What\u0027s Wrong?  \nI Started This Site Because I Couldn\u0027t Find Any Help Out There That Worked for Me.  I\u0027m DEFINITELY OUT of the Box and Always Searching.  We\u0027re going to explore our thoughts \u0026 feelings looking outside the box and with Our Eyes Wide Open - Being Raw and Honest About our True Feelings - Facing Them and Looking at Things from Various Angles. We Heal as We Share and Get it Out.  But I Don\u0027t Want to Act Like We\u0027re Still in There Re-hashing and Re-Shaping Old Beliefs So As to Keep Them in a Revised Fashion.  We\u0027re Out!  Please Help This Community to Heal by Sharing Good Videos that Have Helped You and Let\u0027s Continue to Become our Best Selves - Shedding the Old Beliefs and Accepting Some New Ones!  Welcome!   \n\nCheck Out my Husbands Facebook and You Tube Page for Ex-JW\u0027s:  Life After Religion\nCheck Out My Facebook Page:  The Art of Healthy Relationships\nMy Website:  AngelasInspirations.com \nDan\u0027s Site:  MyProdigalJourney.com",
      "release": "2021-02-17T00:29:51Z",
      "duration": "00:04:19",
      "explicit": false,
      "youTubeId": "cNiyL8Xz1Gk",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cNiyL8Xz1Gk"
      }
    }
  ]
}