{
  "id": "89f414b2-12cd-4242-b986-4a98df42b6d8",
  "name": "Eyes Wide Open with Nick Thompson",
  "spotifyId": "3IQaU7ZtcM3Gv3yk9iHy23",
  "appleId": 1640110814,
  "episodes": [
    {
      "id": "0b3a3c9a-ecd7-4671-be85-0ae538f8accb",
      "title": "Coercive Control in Cults, Alcoholics Anonymous, and Reality TV with Ashley Love Richards",
      "description": "Ashley Love Richards, host of the cult-obsessed podcast \u0022That\u0027s So F**ked Up,\u0022 dives deep into the darkness with Nick Thompson in this unfiltered conversation about coercive control in cults, alcoholic anonymous, and reality TV. Buckle up as they dissect Ashley\u0027s passion for true crime, her journey from alcoholism to podcasting glory, and the surprising (and disturbing) connections between cults and everyday life.   Get ready to explore:   Coercive Control: Ashley and Nick discuss coercive control in cults, alcoholic anonymous, reality TV, and many other ways the manipulation tactic reveals itself in everyday life.   Survivor Stories: Ashley shares her experiences advocating for victims of spiritual abuse and the troubled teen industry, challenging the culture of victim blaming and trauma dumping online.  From Child Star Dreams to Podcasting Queen: Uncover Ashley\u0027s fascinating path from Hollywood hopeful to true crime maven and why she traded scripts for microphones.  Cults 101: Delve into the chilling world of serial killers and cults, uncovering their shared traits and the spectrum of manipulative groups lurking in plain sight.   Unveiling the Darkness: Unpack the twisted psychology of cult leaders, their warped desire for control, and the insidious power of coercive control that traps victims.   Breaking Free: Dive into the surprising cult-like aspects of Alcoholics Anonymous and societal pressures around alcohol, prompting a discussion on vulnerability, mental health, and Catholic guilt.   Finding Light in the Dark: Discover healthy self-care strategies like bubble baths, ice cream, and walks in nature as Ashley and Nick debunk the Windy City myth and share tips for battling seasonal affective disorder.   The Future is Bright: Join the duo as they brainstorm future collaborations and celebrate the power of self-improvement and building supportive communities.     This episode is a raw, insightful, and often hilarious journey into the darkest corners of human behavior and the light that shines even there.  I hope you enjoy this episode with Ahley Love Richards and you learn something new to help you go through life with your eyes wide open!   Find Ashley Love Richards here: Website: https://tsfuthepodcast.com/  Instagram: https://www.instagram.com/tsfuthepodcast/  Patreon: https://www.patreon.com/TSFU  YouTube: https://www.youtube.com/@harlotsjezebels Additional Links: https://www.tearsofeden.org/   Find Nick Thompson here: Instagram: https://www.instagram.com/nthompson513/  YouTube: https://www.youtube.com/@EyesWideOpenContent LinkedIn: https://www.linkedin.com/in/nickthompson13/  UCAN Foundation: https://www.ucanfoundation.org/ Website: https://www.engagewithnick.com/",
      "release": "2024-01-23T06:00:00Z",
      "duration": "01:18:33.4560000",
      "explicit": false,
      "spotifyId": "6Omo3cdZxiGYECrB0jhPyT",
      "appleId": 1000642593691,
      "subjects": [
        "Alcoholics Anonymous"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Omo3cdZxiGYECrB0jhPyT",
        "apple": "https://podcasts.apple.com/podcast/coercive-control-in-cults-alcoholics-anonymous-and/id1640110814?i=1000642593691"
      }
    }
  ]
}