{
  "id": "7e9fab77-babc-42cb-a308-2342dd92cae0",
  "name": "Fabled Events",
  "youTubeChannelId": "UCqwJr_XmMpBTYWKoD8FaRxw",
  "episodes": [
    {
      "id": "c8caad36-5790-4946-85cc-dcec24498eef",
      "title": "Cult Whistleblower, Miranda Grace, on the Yoga Retreat That Changed Her Life",
      "description": "What does it feel like to lose your voice and what does it take to reclaim it?\n\nFabled’s first guest is a key contributor to the BBC World of Secrets podcast ‘The Bad Guru’, and the subject of an upcoming documentary series exposing the truth behind a yoga retreat that promised healing but delivered something far more sinister.\n\nJoin us for an intimate and powerful conversation with Miranda Grace - cult whistleblower, somatic practitioner and founder of Gracefull Awakenings - as she shares her story of survival, awakening, and healing after escaping the Tara Yoga Cult.\n\nIn conversation with Fabled’s Founder, Miranda will share the subtle ways coercive control can show up - especially under the banner of wellness, spirituality and self-betterment -how cult dynamics operate in the body as much as the mind, and the journey of rebuilding self-trust and reclaiming inner authority.\n\nMiranda is a trafficking survivor, whistleblower and advocate for coercive control education and legal change. She’s an activist for reclaiming our body, our voice and our joy as a survivor. Currently, she’s fighting legal battles against the Atman Federation and Misa cult in multiple countries as part of her quest for healing, justice and positive change.\n\nThis isn’t just a conversation about survival: it’s about sovereignty, voice, and what it means to come home to yourself on the other side.",
      "release": "2025-06-23T23:01:05Z",
      "duration": "01:21:24",
      "explicit": false,
      "youTubeId": "yPRJ7ueGte0",
      "subjects": [
        "Gregorian Bivolaru",
        "Human Trafficking",
        "Yoga Cult",
        "Cult Psychology",
        "Cult Recovery",
        "Agama Yoga"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yPRJ7ueGte0"
      }
    }
  ]
}