{
  "_ts": 0,
  "id": "44226fd4-6c70-4b41-beee-e629488186e9",
  "name": "Factual America",
  "spotifyId": "2IiC0JVB7YrNOcvrKQJCVj",
  "appleId": 1494485257,
  "youTubeChannelId": "UCtw2v3PX8bx0uXh2kSoVytA",
  "episodes": [
    {
      "id": "5616921e-003e-4749-a490-334c4a6ed428",
      "title": "The 7M TikTok Dance Cult: Dancing for the Devil",
      "description": "Dancing For The Devil: The 7M TikTok Cult explores the experiences of a group of prominent TikTok dancers who are trapped in a cult masquerading as a management company. In the process the film uncovers disturbing truths about the agenda of Robert Shinn, the cult’s founder and pastor of the Shekinah Church. Joining Matthew Sherwood on Factual America are executive producers Jessica Acevedo and director Derek Doneen, who discuss the making of the film and the challenges of interviewing people who are still in the depths of an abusive and traumatic environment. The filmmakers explain how it takes a long time to recover from leaving a cult, how to build trust with the people you are documenting, and how the cult responded to the wave of criticism and bad publicity. In the end their film reveals so much about the lure of fame, the importance of faith and the bond of family. Watch the episode at https://factualamerica.com “Nobody sets out to join a cult. Cult leaders don\u0027t come at you full blast with their manipulations on display, it’s little by little slowly inching you in over time so you’re not realising what’s happening.” – Derek Doneen “Financial abuse and control happened there. It wasn’t until they started sharing some of those experiences that they realised that it was happening to them too and unravelled what they thought was a faith-based positive environment and showed it was really quite sinister.” – Jessica Acevedo “The assumption is that people are fine and okay, but continue to dig deeper, ask the questions, have patience and meet people where they’re at because you never really know what someone’s going through. What you see on social media can be one thing but it’s worth asking how they’re doing.” – Jessica Acevedo",
      "release": "2024-06-20T11:29:00Z",
      "duration": "00:48:14.0800000",
      "explicit": false,
      "spotifyId": "3jtjKMobv93I3qYEXOFMY2",
      "appleId": 1000659630251,
      "youTubeId": "HmNaMP2PpO8",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3jtjKMobv93I3qYEXOFMY2",
        "apple": "https://podcasts.apple.com/podcast/the-7m-tiktok-dance-cult-dancing-for-the-devil/id1494485257?i=1000659630251",
        "youtube": "https://www.youtube.com/watch?v=HmNaMP2PpO8"
      }
    }
  ]
}