{
  "_ts": 0,
  "id": "92f7290b-f4db-4ffc-9f5c-c5099761fd7d",
  "name": "FactsStillMatter",
  "youTubeChannelId": "UCW5p0gO_26T0TgyJXf3QTrw",
  "episodes": [
    {
      "id": "09b07e7f-f626-49e9-8e36-0fec70ba1dd2",
      "title": "Discussion with Daniella Mestyanek Young-Author, Speaker, Sex Cult Survivor, US Army Veteran \u0026 More",
      "description": "Daniella Young, author of UnCULTured will join us as we discuss her surviving the cult she was born into, and her choice to join the US Army. Her cult experience gives her a unique perspective on MAGA.\n\nLinks\nLinkTree:\nhttps://linktr.ee/factsstillmatter\nhttps://linktr.ee/Daniellamyoung\n\nTikTok: \n \n\n / factsstillmatter  \n \n\n / antneela6  \n \n\n / daniellamestyanekyoung  \n\nYou May purchase an autographed copy from Danielle\u0027s TikTok Shop (@Group Behavior Gals).\nhttps://www.tiktok.com/t/ZPRwP7yXL/\n\nDescription:\nDaniella Young, author of UnCULTured will join us as we discuss her surviving the cult she was born into, and her choice to join the US Army. Her cult experience gives her a unique perspective on MAGA.\n\nEscape, by definition, is rarely easy, and in Uncultured, Daniella Mestyanek Young illustrates just how difficult it can be. Leaving the Children of God, the cult she was born into, and surviving the U.S. Army, a group she chose to enlist in as a young adult, have both left many scars. Lucky for readers, she found her way through both experiences and then wrote it all down.\n\nReview\nFrom one cult survivor to another - this is the best memoir of surviving a childhood trapped by the insanity of a cult that I have ever read. And I have read them all. Daniella\u0027s writing style is simple, direct, and searingly honest. If you have been through anything similar -- physical or sexual abuse, psychological manipulation, and brainwashing, feeling trapped and that you have few options for safety \u0026 freedom, or the ongoing ache of developmental trauma like the throb of a poorly healed shin bone -- then you will find yourself tearing up throughout this book many times.\n\nAvailable on Amazon, Audible, Google Play, wherever books are sold.",
      "release": "2024-05-03T11:37:40Z",
      "duration": "03:06:23",
      "explicit": false,
      "youTubeId": "99AIhBxzfcY",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=99AIhBxzfcY"
      }
    }
  ]
}