{
  "id": "097b3947-e029-4a2e-9564-a09f3ea684ca",
  "name": "Facts Verse",
  "youTubeChannelId": "UCXZpQgX1897wYDLtvzmgyIA",
  "episodes": [
    {
      "id": "b868fda2-aef6-4483-8a9b-81417406318d",
      "title": "Celebrities Who Were Once in Dangerous Cults",
      "description": "Several notable celebrities have been associated with cults, drawing attention and controversy due to their affiliations. Shirley MacLaine, known for her exploration of New Age spirituality and beliefs in reincarnation, has been open about her experiences with alternative philosophies. Peaches Geldof, a media personality, was linked to the Ordo Templi Orientis (OTO), a group practicing Thelema, which emphasizes individualism and mystical practices. \n\n▬Contents of this video▬\n00:00 - Intro\n00:57 - Joaquin and River Phoenix\n03:25 - Allison Mack\n05:49 - Rose McGowan\n07:44 - Michelle Pfeiffer\n09:26 - Glenn Close\n11:05 - Bethany Joy Lenz\n12:21 - David Arquette\n13:21 - Winona Ryder\n15:21 - Patricia Arquette\n17:44 - Lisa Marie Presley\n20:32 - Peaches Geldof\n22:32 - Shirley MacLaine\n25:07 - Neil Young\n26:00 - Juliette Lewis\n28:49 - Demi Moore\n29:45 - Outro\n\nLike this content? Subscribe here: https://www.youtube.com/factsverse?sub_confirmation=1 \n\nOr, watch more videos here: https://www.youtube.com/playlist?list=PLkXAntdjbcSJlJnpP4FgdU0swKbnkNgJj\n\nBecome a Facts Verse member and get access to all videos that contain mature content. Use the link below to get access to even more videos, ad-free.\nhttps://www.youtube.com/channel/UCXZpQgX1897wYDLtvzmgyIA/join\\\n\nLisa Marie Presley, daughter of Elvis Presley, has been connected to Scientology, a highly scrutinized movement that has attracted many public figures seeking spiritual guidance. David Arquette, an actor known for his roles in films and wrestling, has spoken about his time in various spiritual groups, including his interest in the Subud community. Alison Mack, once celebrated for her role on \u0022Smallville,\u0022 became involved with NXIVM, a self-help organization later exposed as a cult involved in criminal activities. River Phoenix, an acclaimed actor and environmental activist, tragically died outside a Hollywood nightclub associated with the Children of God cult. Rose McGowan, known for her activism and roles in films, including \u0022Charmed,\u0022 has discussed her upbringing in the Children of God cult. \n\nMichelle Pfeiffer and Glenn Close both shared their brief encounters with the Breatharianism movement, which promotes living without food or water, reflecting the diverse spectrum of beliefs and movements that celebrities have engaged with over the years. These instances underscore the complexities celebrities face navigating personal beliefs, fame, and the public eye, illuminating the allure and risks associated with seeking deeper meaning outside of mainstream norms. In this video, we’re taking a look at these celebs, and many others, as we examine their experiences in groups that were shady, to say the least. Join Facts Verse, as we take a look at some celebs who were once in dangerous cults!\n\nCelebrities Who Were Once in Dangerous Cults",
      "release": "2024-07-05T16:00:16Z",
      "duration": "00:29:48",
      "explicit": false,
      "youTubeId": "JzCkKwJW0jg",
      "subjects": [
        "Children Of God",
        "NXIVM",
        "Scientology",
        "Self-Help",
        "Inedia",
        "Ordo Templi Orientis",
        "The Big House Family",
        "Moral Re-Armament"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JzCkKwJW0jg"
      }
    }
  ]
}