{
  "_ts": 0,
  "id": "1e03b314-3706-489c-94f2-d548d70bf4e6",
  "name": "Faithful Politics",
  "spotifyId": "3pf9mr5nWc5PMpxYhopph2",
  "appleId": 1507685680,
  "youTubeChannelId": "UCR-Y3G5t6LSlaSyAZhKxFXQ",
  "episodes": [
    {
      "id": "d01a9e5b-b22f-47e0-bb6a-ab2d64c4cea3",
      "title": "\u0022The Psychology of Manipulation: Unpacking Trump\u0027s Hold Over His Followers\u0022 w/Dr. Steven Hassan",
      "description": "In this captivating episode of Faithful Politics, hosts Will Wright and Pastor Josh Burtram  we sit down with Steven Hassan, an expert in the psychology of mind control and cults. The conversation is a deep dive into the mechanics of manipulation, exploring how individuals and entire societies can be influenced, transformed, and then manipulated again.Steven Hassan introduces key terms like \u0022unfreezing,\u0022 \u0022changing,\u0022 and \u0022refreezing,\u0022 which are part of a model that describes the process of disorienting a person\u0027s sense of self, indoctrinating them with new beliefs, and then solidifying those beliefs. He explains how these tactics have been used in various contexts, including politics, and specifically mentions their application during the Trump era.The episode also delves into the role of social media platforms in facilitating this kind of manipulation. Hassan warns about the dangers of becoming too reliant on these platforms for information, as they can serve as echo chambers that reinforce existing beliefs and make individuals more susceptible to manipulation.The conversation takes a fascinating turn when it intersects with faith and politics. Hassan, Pastor Josh, and Will discuss the ethical implications of using religion as a tool for political gain. They caution the audience about the risks involved in intertwining faith with political ideologies, emphasizing the need for critical thinking and self-awareness in today\u0027s polarized environment.Hassan ends the episode by offering practical advice for breaking free from these manipulative tactics. He encourages listeners to take a step back, disconnect from media, and spend time in self-reflection to understand their true values and beliefs. He also stresses the importance of learning from our mistakes and being open to changing our minds, as this is the only way to grow and protect ourselves from future manipulation.\u0022The Cult of Trump\u0022 BookBITE Model of Authoritarian ControlThe Influence ContinuumGuest Bio:Dr. Hassan is a licensed mental health professional, a recognized expert on cults and undue influence, and possesses professional experience both in the US and abroad. His work encompasses various areas, including consultation, coaching, public speaking, media appearances, activism, writing, research, teaching, intervention, and recovery services, as well as expert consulting and testimony to aid individuals and families dealing with issues related to undue influence.Dr. Hassan’s expertise extends to the realm of undue influence in a wide array of contexts, including destructive one-on-one relationships, family dynamics, parental alienation, small cult-like groups, religious cults, therapy and self-improvement groups, professional abuse, institutional abuse, corporate settings, multi-level marketing, political groups, human trafficking, hate and violent extremism, and other challenging situations. He actively advocates for the recognition of terrorist groups as destructive cults and addresses their importanceSupport the showTo learn more about the show, contact our hosts, or recommend future guests, click on the links below:  Website: https://www.faithfulpoliticspodcast.com/  Faithful Host: Josh@faithfulpoliticspodcast.com Political Host: Will@faithfulpoliticspodcast.com Twitter: @FaithfulPolitik Instagram: faithful_politics Facebook: FaithfulPoliticsPodcast LinkedIn: faithfulpolitics ",
      "release": "2023-11-04T00:00:00",
      "duration": "01:07:04.4760000",
      "explicit": false,
      "spotifyId": "0NDkPF5izZzD8MGAHrR9PF",
      "appleId": 1000633657728,
      "youTubeId": "5POAbko5r6w",
      "subjects": [
        "Cult-Expert",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NDkPF5izZzD8MGAHrR9PF",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-manipulation-unpacking-trumps/id1507685680?i=1000633657728",
        "youtube": "https://www.youtube.com/watch?v=5POAbko5r6w"
      }
    }
  ]
}