{
  "_ts": 0,
  "id": "6e4ff6f5-867a-4c7a-b9a0-e2d21d7648d5",
  "name": "Fake Love and Flying Monkeys",
  "spotifyId": "7wu5zn2HbzZwQzdSY8NuBb",
  "appleId": 1748520586,
  "youTubeChannelId": "UCgUVEsf6RXCfrHeHmfZmxUA",
  "episodes": [
    {
      "id": "bd82546e-1781-4cb7-903e-442970316a0a",
      "title": "The Narcissist is like a Cult Leader",
      "description": "The Narcissist is like a Cult Leader In this episode we take a deep dive into the striking parallels between narcissists and cult leaders. Narcissists, much like cult leaders, create an environment where they exert extreme control, manipulating their victims into loyalty and compliance. We’ll explore how narcissists use charm, fear, and manipulation to isolate their targets, breaking down their sense of self-worth to gain complete control. We also discuss how narcissists slowly build a “following,” surrounding themselves with enablers and flying monkeys to maintain their power. By examining these similarities, we’ll uncover why narcissists thrive in these power dynamics, using psychological manipulation to draw people in and keep them under their influence. To book a zoom counselling session with me please visit my website below for contact details. Nova \u0026#x1f64f; And don\u0027t forget to grab your copy of my best-selling book Fake Love - Understanding and Healing from Narcissistic Abuse. You can order here \u0026#x1f447; https://linktr.ee/novagibson Send us a text Thankyou so much for listening! Please remember the information you hear in this episode is not intended to substitute for therapy, is general information, and strictly the opinions of the host based on her years of experience working with thousands of victims of narcissistic abuse. If you would like to make an appointment for individual counselling with me , please visit my website at , Brighter Outlook Narcissistic Abuse Counselling Service , or email me at nova.pollard123gmail.com To order a copy of my book - Fake love please click Here or simply go directly to Amazon I looove creating these episodes, but they do take time. If you\u0027d like to support me to continue creating more podcast episodes, then please click here to . Buy me a coffee",
      "release": "2024-10-13T13:00:00Z",
      "duration": "00:33:37.9060000",
      "explicit": false,
      "spotifyId": "2Go0ygX8N9OlJ102T2JXkY",
      "appleId": 1000672917604,
      "youTubeId": "VX3Uq-SUvCU",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Go0ygX8N9OlJ102T2JXkY",
        "apple": "https://podcasts.apple.com/podcast/the-narcissist-is-like-a-cult-leader/id1748520586?i=1000672917604",
        "youtube": "https://www.youtube.com/watch?v=VX3Uq-SUvCU"
      }
    }
  ]
}