{
  "id": "77a32abe-7a0b-4f52-b49f-abd08dfb8969",
  "name": "False Profits: Hillsong",
  "spotifyId": "179hLPVHBub8jNEVlNpEiG",
  "appleId": 1668018669,
  "episodes": [
    {
      "id": "b7289f84-9be7-4d39-9a16-f576c7f64561",
      "title": "A Reckoning",
      "description": "In the final episode of False Profits, Noemi asks “has Hillsong changed?” And is it ready to talk to people like Noemi and listen to their stories? We put our questions to the church. And Noemi enlists the advice of a leading lawyer specialising in abuse. Campaigner Ashley Easter gives advice on how to advocate for victims. And cult survivor Dr Steven Hassan explains how all of us can become better critics of religious groups. Noemi and Elle meet up again and Elle shares the inside track on Hillsong. There are some big changes and the church is keen to move on from the Brian Houston era. But will it address the issues raised in the series? And Noemi heads to Pride New York to take back control and explains why she is not quite done with Hillsong yet. False Profits: Hillsong is produced by Storyglass for iHeartRadioSee omnystudio.com/listener for privacy information.",
      "release": "2023-03-23T08:00:00Z",
      "duration": "00:44:26.2920000",
      "explicit": false,
      "spotifyId": "7ECOqvp6z9j3na4E93oWY5",
      "appleId": 1000605516256,
      "subjects": [
        "Hillsong",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7ECOqvp6z9j3na4E93oWY5",
        "apple": "https://podcasts.apple.com/podcast/a-reckoning/id1668018669?i=1000605516256"
      }
    },
    {
      "id": "e763c7ce-da56-49f7-88fb-f7621cf43c06",
      "title": "The Reunion",
      "description": "Meet the rebels: Noemi organises a renuion for ex Hillsongers. Janice Lagata, Tiffany Perez and Noemi meet up in New York - where a culture of exploitation and abuse went unchecked. Noemi, Janice and Tiffany explore the bond that has formed among people who’ve left the church and they jump into the issue of race. They say it’s women of colour who are some of the loudest critical voices because “Hillsong never thought we would speak out, because they never saw us”. The trio used podcasts and social media to ask awkward questions and call out those in power. They explore what justice looks like and wonder whether the best form of revenge could simply be finding happiness outside Hillsong? False Profits: Hillsong is produced by Storyglass for iHeartRadioSee omnystudio.com/listener for privacy information.",
      "release": "2023-03-16T08:00:00Z",
      "duration": "00:35:55.1800000",
      "explicit": false,
      "spotifyId": "1npyr8x4qM8MuURFz57FOf",
      "appleId": 1000604454553,
      "subjects": [
        "Hillsong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1npyr8x4qM8MuURFz57FOf",
        "apple": "https://podcasts.apple.com/podcast/the-reunion/id1668018669?i=1000604454553"
      }
    },
    {
      "id": "cea5bce3-ba2d-40f2-baac-b21c3d158e30",
      "title": "The Darkest Night",
      "description": "Warning: This episode contains accounts of mental distress and suicide ideation. This episode takes us into the darkest time in Noemi’s Hillsong story. Increasingly isolated from the church, Noemi’s mental health reaches crisis point. One night, suicidal thoughts and torment become too much. Noemi turns to a Hillsong leader for help and exposes some potentially catastrophic ignorance about mental health. The intervention of a friend saves her life. Noemi starts on a process of recovery and the realisation that it’s time to leave Hillsong. But letting go turns out to be hard to do… False Profits: Hillsong is produced by Storyglass for iHeartRadioSee omnystudio.com/listener for privacy information.",
      "release": "2023-03-09T08:00:00Z",
      "duration": "00:42:14.9740000",
      "explicit": false,
      "spotifyId": "4T5Bz5kM5XafTihzETpDg1",
      "appleId": 1000603410689,
      "subjects": [
        "Hillsong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4T5Bz5kM5XafTihzETpDg1",
        "apple": "https://podcasts.apple.com/podcast/the-darkest-night/id1668018669?i=1000603410689"
      }
    },
    {
      "id": "1bae6d75-ab2f-4d04-a492-595cd88e2a1a",
      "title": "Terms and Conditions Apply",
      "description": "Warning: This episode contains descriptions of homophobia and mental distress. Noemi’s personal story unfolds. Remember Hillsong’s ‘Welcome Home - You Belong’ message? Noemi thought that meant everyone. But it turned out “terms and conditions applied”. Hillsong Boston where Noemi was worshipping felt cool, it felt liberal and it seemed to be inclusive. Noemi was finding their/her sexual identity. And finally it was time to share that queer identity with family and church. But Noemi doesn’t get affirmation and struggles to get answers from Hillsong. Does the church welcome gay people? The answers emerge slowly and painfully. And Noemi looks back through Hillsong’s history and discovers pain from the past is still causing trauma today. False Profits: Hillsong is produced by Storyglass for iHeartRadioSee omnystudio.com/listener for privacy information.",
      "release": "2023-03-02T08:00:00Z",
      "duration": "00:42:32.1110000",
      "explicit": false,
      "spotifyId": "3yvn9XOgo50yTlKKfRevVT",
      "appleId": 1000602434004,
      "subjects": [
        "Hillsong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3yvn9XOgo50yTlKKfRevVT",
        "apple": "https://podcasts.apple.com/podcast/terms-and-conditions-apply/id1668018669?i=1000602434004"
      }
    },
    {
      "id": "98342714-4842-42e6-b73f-e2fabfdbf664",
      "title": "The House of Houston",
      "description": "Meet the man behind this global megachurch. Hillsong started small in a school hall in Australia nearly 40 years ago. In this episode we go back to Hillsong’s roots and the man who built a mega church - Brian Houston - aka ‘The Big Eagle’. For many years Brian Houston, his wife Bobbie and their kids were the Hillsong powerbase. But in March 2022 Brian steps down as leader. As the power structure crumbles, Elle Hardy heads to Sydney to explore the rise and fall of ‘House of Houston’. During the episode a bombshell drops: a whistleblower makes a series of claims about the church finances. Hillsong denies any wrong doing. But Elle finds Hillsong and its followers dealing with wave after wave of scandal. Thanks to Australian Broadcasting Corporation Library Sales for use of ABC news archive. False Profits: Hillsong is produced by Storyglass for iHeartRadioSee omnystudio.com/listener for privacy information.",
      "release": "2023-02-23T08:00:00Z",
      "duration": "00:49:03.7120000",
      "explicit": false,
      "spotifyId": "59A1x5VVhkPR7B0GO20x6Y",
      "appleId": 1000601227771,
      "subjects": [
        "Hillsong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/59A1x5VVhkPR7B0GO20x6Y",
        "apple": "https://podcasts.apple.com/podcast/the-house-of-houston/id1668018669?i=1000601227771"
      }
    },
    {
      "id": "36e2513b-e3dd-4317-a8dc-393a8bd1eda1",
      "title": "Follow the Money",
      "description": "You can’t talk about Hillsong without talking about money. The church is a multimillion dollar enterprise. Its followers give a lot of their time and their money. What do they get in return? Noemi shares her experience as a volunteer at Hillsong Boston. It’s a place where the elite was enjoying lavish hospitality in green rooms while volunteers worked exhausting hours. Elle Hardy analyses how volunteer labour became central to the Hillsong model. Noemi and Elle dig into allegations that nannies employed by Hillsong pastors were paid a pittance. Two members of the Hillsong “nannies club” share their stories. And Elle and Noemi call in a financial investigator to find out about Hillsong’s wealth and accountability. False Profits: Hillsong is produced by Storyglass for iHeartRadioSee omnystudio.com/listener for privacy information.",
      "release": "2023-02-16T08:00:00Z",
      "duration": "00:42:21.7400000",
      "explicit": false,
      "spotifyId": "21oTLzou6nlbGDgPFknJdp",
      "appleId": 1000599898083,
      "subjects": [
        "Hillsong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/21oTLzou6nlbGDgPFknJdp",
        "apple": "https://podcasts.apple.com/podcast/follow-the-money/id1668018669?i=1000599898083"
      }
    },
    {
      "id": "f5d057b0-497b-4bfe-89c4-14423e555995",
      "title": "A Culture of Submission",
      "description": "Warning: This episode contains references to rape, sexual and psychological abuse. Someone wants the truth to come out - to shine a spotlight on dark corners Hillsong never wanted the public to see. One day, two reports drop into Elle Hardy’s inbox - anonymously. These reports were commissioned by Hillsong into allegations of abuse at the New York church and they are devastating. The New York campus was Hillsong at its most starry. Celebrity preacher Carl Lentz was hanging out with Justin Bieber. But this was a church out of control. Behind the showbiz image, Elle and Noemi uncover “a culture of submission” and multiple allegations of abuse. How did Hillsong let this happen? Noemi and Elle hear from people who were there. False Profits: Hillsong is produced by Storyglass for iHeartRadioSee omnystudio.com/listener for privacy information.",
      "release": "2023-02-09T09:00:00Z",
      "duration": "00:48:57.7300000",
      "explicit": false,
      "spotifyId": "1wC0qpeZamIjDhrbBJnu7f",
      "appleId": 1000598817488,
      "subjects": [
        "Hillsong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1wC0qpeZamIjDhrbBJnu7f",
        "apple": "https://podcasts.apple.com/podcast/a-culture-of-submission/id1668018669?i=1000598817488"
      }
    },
    {
      "id": "abfc681a-29d8-49de-84ef-5f29b389ee0b",
      "title": "Welcome Home",
      "description": "“How could you fall for that?” Noemi Uribe explains why the Hillsong brand was so seductive. It’s church - but not typical church. Noemi takes us into the world of Hillsong in a Boston night club.  Services have a concert vibe, the sermons are upbeat, it’s not boring or judgmental. Millions loved the Hillsong way of doing God and turned it into a mega church. Journalist and writer Elle Hardy has been studying the rise of Pentecostalism and the Hillsong phenomenon for several years. She breaks down the winning formula that is now replicated across the globe. And Elle and Noemi start to trace where things went wrong at Hillsong, as star preachers and mega egos create a toxic mess. False Profits: Hillsong is produced by Storyglass for iHeartRadioSee omnystudio.com/listener for privacy information.",
      "release": "2023-02-02T14:00:00Z",
      "duration": "00:42:08.5740000",
      "explicit": false,
      "spotifyId": "5FHh7fvt84pF2sYLywe3dH",
      "appleId": 1000597725052,
      "subjects": [
        "Hillsong",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FHh7fvt84pF2sYLywe3dH",
        "apple": "https://podcasts.apple.com/podcast/welcome-home/id1668018669?i=1000597725052"
      }
    },
    {
      "id": "e944de3e-3dca-482c-9c4d-07a0d7ebf604",
      "title": "Introducing: False Profits: Hillsong",
      "description": "False Profits is the inside story of the church that made Christianity cool. And it’s one person’s   search for answers. Hillsong created a sound, a look and a global empire. Its message is simple ”Welcome Home - You Belong”.  Noemi Uribe was part of Hillsong and discovered a different and darker reality beneath the shiny, happy surface. Alongside journalist Elle Hardy, Noemi reveals stories Hillsong never wanted the public to see about money, sex and power. This series traces the rise and fall of Hillsong’s founder, hears from sources inside the church, and asks if Hillsong is part of a wider problem within evangelical churches.See omnystudio.com/listener for privacy information.",
      "release": "2023-01-26T06:00:00Z",
      "duration": "00:02:41.3060000",
      "explicit": false,
      "spotifyId": "71G3j6oMnXuEjUt1izOfiH",
      "appleId": 1000596662780,
      "subjects": [
        "Hillsong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/71G3j6oMnXuEjUt1izOfiH",
        "apple": "https://podcasts.apple.com/podcast/introducing-false-profits-hillsong/id1668018669?i=1000596662780"
      }
    }
  ]
}