{
  "id": "1142186f-4b20-4813-9d30-6c7339d34601",
  "name": "Family First Life Lawsuit Witnesses",
  "youTubeChannelId": "UCsj_eJalRjpAKjs2j39Tukg",
  "episodes": [
    {
      "id": "dd8ea869-cb59-4c98-9138-fa0aad80f49d",
      "title": "Infiltrating a Pyramid Scam: Primerica by AlwaysMarco",
      "description": "AlwaysMarco, a YouTuber with 86K subscribers, created 42 minutes of well-researched information that describes how hundreds of thousands of North Americans are being scammed by the Primerica Life Insurance Company Pyramid Scheme / MLM.\n\nIf you sell or are interested in selling insurance, please register and create your free-forever website designed for agents at https://www.aaronlevy.tech. The website builder includes embedded quote engines. As well, we offer expert mentoring on helping life insurance succeed in this business.\n\nThis video gathered 900,000 views in nine days and subsequently, Marco deleted the video on his channel after being law suited by Primerica. \n\n#primerica #antimlm #insurancesales #insuranceagent\n\nI implore you to visit Marco\u0027s YouTube channel: https://www.youtube.com/@AlwaysMarco and subscribe to his channel and like as many of his videos as you can.\n\nConsider donating to Marco\u0027s legal defense fund at https://www.patreon.com/alwaysmarco\nand reaching out to Marco on\nINSTAGRAM: https://www.instagram.com/alwaysmarco/\nMERCH: https://alwaysmarcomerch.com/\nDISCORD: https://discord.gg/mFa37aVG7g\n\nBooks by Marco\n\u0027Ponzinomics\u0027 Paperback Canada: https://amzn.to/3Au3hzf\n\u0027Ponzinomics\u0027 Audiobook Canada: https://amzn.to/3LceWHU\n\u0027Ponzinomics\u0027 Paperback USA: https://amzn.to/41LklNq\n\u0027Ponzinomics Audiobook USA: https://amzn.to/3oI20Sy\nAs an Amazon Associate, Marco earns from qualifying purchases\n\nFTC Report Fraud:\nhttps://reportfraud.ftc.gov/#/\n\nMarco is hopeful that the MLM insurance agent recruiting scams such as Primerica will soon end by victims filing complaints to the FTC/ Federal Trade Commission.\n\nI disagree with Marco on that point. Marco tells us the details of how MLMs, suck as Primerica, donate huge moneys to politicians by way of their Political Action Committee (PAC). And how MLM\u0027s routinely ignore FTC cease \u0026 desist orders. \n\nI know of four Integrity Marketing Group subsidiaries, (FFL, PHP Agency, Equis and NAA) that have received the FTC cease \u0026 desist warning letter of a $43,792 per violation if they lie about expected incomes one more time, but they continue their ridiculous claims.\n\nThe most effective way for the public to be made whole by scammers, such as Primerica, is for victims to to their story on YouTube/TikTok.  There is a decent chance you will receive a lawsuit threat from the scammer.\n\nAfterward, write a well-written letter to the various government agencies, including the FTC and your State Attorney General.\n\nThere is a decent chance your Attorney General will refer you to lawsuit the scammer, i.e.Primerica, with a list of attorneys.\n\nRegardless, your information and video is helping the AG and FTC build  a case against Primerica. And finding an attorney to accept your case on a contingency becomes much more likely since your experience is well written and your authenticity is on video display.\n\nScammers don\u0027t want to be law suited since your claim would be public information.\n\nPrimerica  would prefer to pay you off before you file the lawsuit, especially if your video explaining how you got scammed is getting numerous views.\n\nPlease subscribe to this channel. Special thanks to free websites and quote engines to insurance agents. As well, a free lead system that is based on the concept of incentive-based marketing.  Special thanks to the interviewer, David. Any inquiries should contact 561.440.9245 or https://www.gusfox.com.",
      "release": "2023-07-28T22:50:09Z",
      "duration": "00:42:35",
      "explicit": false,
      "youTubeId": "AmzeketmpLM",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AmzeketmpLM"
      }
    }
  ]
}