{
  "_ts": 0,
  "id": "f0febf70-4f8c-4579-be5b-4a67d9c00980",
  "name": "Families Against Cult Teachings and Abuses",
  "youTubeChannelId": "UCCu_GGqhvJmMh1LIUz6E5gw",
  "episodes": [
    {
      "id": "91f133fa-4431-419a-b456-290977955617",
      "title": "Ticket to Heaven - Movie About Religious Brainwashing",
      "description": "http://www.familiesagainstcultteachings.org  In turmoil following the break-up of a longtime relationship, David (Nick Mancuso) seeks something to give him a new direction and falls in with a religious cult. Before long, David has been completely brainwashed by the group and has receded from his old life. When his dedicated buddy, Larry (Saul Rubinek), tracks him down and discovers the reality of his situation, he proceeds to rally David\u0027s family and other friends to remove him from the cult and shake its influence.\n\nFrom the NY Times: \u0027\u0027TICKET TO HEAVEN\u0027\u0027 is an absorbing, frightening, entirely believable movie, which is particularly amazing in view of its subject matter. This is the story of a young man who is seduced into joining a religious cult, and it presents the group\u0027s indoctrination process in terms that are graphic, terrifyingly plausible and all too easy to understand. It is also the story of his friends and relatives\u0027 efforts to get him back, after he has become a near-zombie with close-cropped hair and a fierce but automatic dedication to the cult\u0027s leader. A credit at the end of the movie says this is fiction. That credit is the one thing about \u0027\u0027Ticket to Heaven\u0027\u0027 that is genuinely funny.\n\nFor information about currently active destructive groups or to get help for yourself or a loved one, please visit our website: http://www.familiesagainstcultteachings.org",
      "release": "2016-09-16T15:09:31Z",
      "duration": "01:42:51",
      "explicit": false,
      "youTubeId": "94tUYWQPgGU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=94tUYWQPgGU"
      }
    }
  ]
}