{
  "id": "b06aa50b-7c41-46d9-8673-fd46b806c132",
  "name": "Family Disappeared",
  "spotifyId": "1CrUOwEhWbHyKAfUdKcNW1",
  "appleId": 1694971410,
  "episodes": [
    {
      "id": "82638cdb-5571-457a-85dc-12b8d2d4fa8e",
      "title": "Trauma Bonding: The Hidden Heart of Parental Alienation Part 1 - Episode 77",
      "description": "In this episode of the Family Disappeared podcast, Lawrence Joss engages with Randi Fine, a narcissistic abuse expert, to delve into the complexities of trauma bonding and narcissistic relationships. They explore the nuances of narcissism, the signs of narcissistic behavior, and the psychological impact of trauma bonds. Randi explains how these unhealthy attachments form and the challenges they present, especially in the context of parental alienation. The conversation emphasizes the importance of recognizing manipulative behaviors and the need for support in breaking free from these toxic cycles. Key Takeaways Trauma bonding is an unhealthy attachment formed in toxic relationships. Narcissistic personality disorder is a serious condition, not just narcissistic tendencies. Intermittent reinforcement keeps victims trapped in a cycle of hope and despair. Children can exhibit narcissistic behaviors due to parental alienation, but it doesn\u0027t mean they have NPD. The healing process from narcissistic abuse can take time and requires support. Narcissists manipulate their victims through charm and neglect. It\u0027s crucial to recognize red flags early in relationships with narcissists. The cycle of abuse often includes love bombing followed by devaluation. Breaking free from a trauma bond requires understanding and support. Being nice to a narcissist often leads to more abuse, not less. Randi Fine : https://www.randifine.com/ Don\u0027t forget to Subscribe to our YouTube Channel: https://www.youtube.com/@parentalalienationadvocates If you wish to connect with Lawrence Joss or any of the PA-A community members who have appeared as guests on the podcast: Email- familydisappeared@gmail.com Linktree: https://linktr.ee/lawrencejoss (All links mentioned in the podcast are available in Linktree) Please donate to support PAA programs: https://www.paypal.com/donate?hosted_button_id=SDLTX8TBSZNXS This podcast is made possible by the Family Disappeared Team: Anna Johnson- Editor/Contributor/Activist/Co-host Glaze Gonzales- Podcast Manager Connect with Lawrence Joss: Website: https://parentalalienationanonymous.com/ Email- familydisappeared@gmail.com",
      "release": "2025-01-20T11:00:00Z",
      "duration": "00:41:14.2130000",
      "explicit": false,
      "spotifyId": "4kFCJKBHvYcTKIYKt6XT8I",
      "appleId": 1000684688161,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4kFCJKBHvYcTKIYKt6XT8I",
        "apple": "https://podcasts.apple.com/podcast/trauma-bonding-the-hidden-heart-of-parental/id1694971410?i=1000684688161"
      }
    }
  ]
}