{
  "_ts": 0,
  "id": "55249f23-04ce-4239-95ad-49f60beb9ddf",
  "name": "Fargo Talks",
  "spotifyId": "2XNPy9lHShiTqLyYTVQf4w",
  "appleId": 1692311068,
  "youTubeChannelId": "UCMAC23nAAePWljsxC45_Mqw",
  "episodes": [
    {
      "id": "0b1a32b3-b26c-472f-9e10-93bdd4949b96",
      "title": "Leaving Cults and Surviving the Trauma",
      "description": "🎥 Fargo Talks Ep. 61 ft.Amanda Arnier, a True Crime Podcaster: Escaping The Cult of Mormonism and Surviving the Trauma.\n\n🔔 Subscribe for more powerful conversations: @TheDichotomyDiaries@FargoTalks \n\nAbout This Episode:\nIn today\u0027s episode, we sit down with Amanda Arnier, the voice behind the Dichotomy Diaries podcast, to explore her journey of overcoming a toxic relationship, navigating the complexities of the Mormon church, and using her platform to help others heal. Amanda shares her story with raw honesty, offering insights into the realities of emotional manipulation, the challenges of personal growth, and the unexpected support she’s received from a diverse audience.\n\nDive deep with us as we explore:\n\n- Amanda’s experience in creating her successful true crime podcast, and the struggles of managing it all solo.\n\n- The emotional and psychological journey of escaping a toxic relationship and the role of storytelling in her healing process.\n\n- Her unique perspective on the Mormon church, from the inside out, and how it influenced her life choices.\n\n- Candid discussions on the impact of her podcast, particularly among male listeners who have resonated with her stories in unexpected ways.\n\n- The challenges and triumphs of speaking out, sharing vulnerable truths, and the power of giving a voice to the voiceless.\n\nAmanda’s story is one of resilience and bravery, offering a powerful message to anyone who’s faced similar challenges. Whether you\u0027re interested in the behind-the-scenes of podcasting, the intricacies of relationships, or the nuances of religious experiences, this episode is packed with valuable insights and real-life stories.\n\n👍 Like this video if you found Amanda’s story inspiring, subscribe for more powerful conversations, and share your thoughts or similar experiences in the comments below — let\u0027s start a conversation!\n\n🔗 Connect with Amanda Arnier:\n\nPodcast: @TheDichotomyDiaries \nInstagram: https://www.instagram.com/manda.miura/\n\n🔗 Where to Connect with Jeff Fargo:\n\nYouTube: Fargo Talks\nLinkedIn: Jeff Fargo\nFacebook: Jeffrey Fargo\nInstagram: @Jeff.Fargo\nTikTok: @Jeff.Fargo\nWebsite: Fargo Talks\nSpotify: Fargo Talks Podcast\nApple Podcasts: Fargo Talks",
      "release": "2024-08-25T14:31:02Z",
      "duration": "01:16:36",
      "explicit": false,
      "spotifyId": "2qiX2att8QZQSwdMTkPB7v",
      "appleId": 1000666542900,
      "youTubeId": "UpceB--Oku0",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qiX2att8QZQSwdMTkPB7v",
        "apple": "https://podcasts.apple.com/podcast/ep-61-escaping-the-cult-of-mormonism-and-surviving/id1692311068?i=1000666542900",
        "youtube": "https://www.youtube.com/watch?v=UpceB--Oku0"
      }
    }
  ]
}