{
  "id": "03db362c-0563-4556-b6e3-2bd0ae995ed1",
  "name": "FBI Case File Review Podcast",
  "spotifyId": "5gtvYJG343U7NBxcOfI2P4",
  "appleId": 1082012464,
  "youTubeChannelId": "UC7JrkSFxJAUXJSTXQoOBfpg",
  "episodes": [
    {
      "id": "c67f74d4-7c48-4d02-9e5e-48cba71b9370",
      "title": "268: Nuwaubian Nation Cult Leader Dwight York - Jalaine Ward and Joan Cronier",
      "description": "Retired agents Jalaine Ward and Joan Cronier review their investigation of cult leader Dwight D. York, of the United Nation of Nuwaubian Moors. York used his charisma to recruit thousands of followers. Several hundred cult members lived with their children on his 475-acre compound in Putnam County, Georgia where, for years, he sexually molested boys and girls, 3-18 years old. In 2004, York was convicted and sentenced to 135 years without parole. Jalaine Ward served in the FBI for nearly 27 years. Joan Cronier served in the FBI for 20 years. \r\n\r\n Check out episode show notes, photos, and related articles. https://jerriwilliams.com/268-jalaine-ward-and-joan-cronier-nuwaubian-nation-cult-leader-dwight-york/   Buy me a coffee - https://www.buymeacoffee.com/JerriWilliams\r\n\r\n   Join FBI the Retired Reader Team to get the FBI Reading Resource - Books about the FBI, written by FBI agents, the 20 clichés about the FBI Reality Checklist, and keep up to date on the FBI in books, TV, and movies via my monthly email.  Join here. http://eepurl.com/dzCCmL \r\n\r\n  Visit Jerri\u0027s website to check out her books, available as audiobooks, ebooks and paperbacks wherever books are sold. https://jerriwilliams.com/books/",
      "release": "2022-08-11T00:26:52Z",
      "duration": "01:01:53",
      "explicit": false,
      "spotifyId": "0RoQXYMHUDSoPu8CDAt6J8",
      "appleId": 1000575716188,
      "youTubeId": "LyjquVk8Yck",
      "subjects": [
        "Nuwaubian Nation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0RoQXYMHUDSoPu8CDAt6J8",
        "apple": "https://podcasts.apple.com/podcast/268-ward-and-joan-cronier-nuwaubian-nation-cult/id1082012464?i=1000575716188",
        "youtube": "https://www.youtube.com/watch?v=LyjquVk8Yck"
      }
    },
    {
      "id": "d491126b-a2dd-449e-b815-7f2c5366fea5",
      "title": "172: Posse Comitatus, Nebraska Cult Murders - Weysan Dun",
      "description": "Retired agent Weysan Dun served in the FBI for 30 years. During his time in the field, he worked counter-intelligence, high-technology theft, domestic terrorism, and violent crime matters. In this episode of FBI Retired Case File Review, Weysan reviews a case targeting an extremist group espousing Posse Comitatus rhetoric and white supremacist views. Initially, under investigation for weapons and interstate theft violations, the leader, Michael Ryan, his fifteen-year-old son Dennis, and others were charged and convicted of the violent and horrific deaths of two group members.\r\n\r\nCheck out episode show notes, photos, and related articles here:   https://jerriwilliams.com/episode-172-weysan-dun-posse-comitatus-nebraska-cult-murders/\n\n\nJoin my Reader Team to get the FBI Reading Resource - Books about the FBI, written by FBI agents, the 20 clichés about the FBI Reality Checklist, and keep up to date on the FBI in books, TV, and movies via my monthly email. Join here: http://eepurl.com/dzCCmL \n\nJerri Williams, a retired FBI agent, author and podcaster, attempts to relive her glory days by writing and blogging about the FBI and hosting FBI Retired Case File Review, a true crime/history podcast. Visit her website to check out episode show notes, photos, and related articles and her books, available as audiobooks, ebooks and paperbacks wherever books are sold. https://jerriwilliams.com/books/",
      "release": "2019-06-27T00:22:22Z",
      "duration": "01:23:21",
      "explicit": false,
      "spotifyId": "0PKel4cr56ChXfkSGxIO0b",
      "appleId": 1000442885016,
      "youTubeId": "_q_CZIKcfZY",
      "subjects": [
        "Michael W. Ryan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PKel4cr56ChXfkSGxIO0b",
        "apple": "https://podcasts.apple.com/podcast/172-weysan-dun-posse-comitatus-nebraska-cult-murders/id1082012464?i=1000442885016",
        "youtube": "https://www.youtube.com/watch?v=_q_CZIKcfZY"
      }
    },
    {
      "id": "50b76990-210b-47e8-a25e-c46d19976f13",
      "title": "113: Yahweh Ben Yahweh, Temple of Fear - Herbert Cousins",
      "description": "Retired agent Herbert Cousins, Jr. served in the FBI for nearly 22 years. He retired as the Special Agent in Charge of the Springfield Division in Illinois. In this episode of FBI Retired Case File Review, he reviews his investigation of self-proclaimed black messiah and cult leader Hulon Mitchell Jr., also known as Yahweh Ben Yahweh, who led the Florida-based Nation of Yahweh Temple. The Nation of Yahweh was a religious cult founded on the teachings of black separatism and supremacy. On the instructions of Yahweh Ben Yahweh, members of the cult’s violent inner circle committed numerous murders of cult defectors and random racial killings of whites. Yahweh and several of his followers were charged and convicted under the Racketeer Influenced and Corrupt Organizations Act (RICO), with predicated violations of murder, attempted murder, arson, and extortion. During his Bureau career, Herbert Cousins specialized in counterterrorism, counterintelligence, and criminal and security matters. After retiring from the FBI, he served for a period as the Inspector General for the Miami-Dade County Public Schools, the fourth largest school district in the United States. Currently, Herbert Cousins is the owner of Cousins \u0026 Associate, an agency that provides private corporate security consulting, investigation, and litigation support on a national and international level.",
      "release": "2019-05-27T15:25:12Z",
      "duration": "00:52:23",
      "explicit": false,
      "spotifyId": "1YebrKIMDPtPW1tEjRO5lB",
      "appleId": 1000409877027,
      "youTubeId": "hJab1ZeREM4",
      "subjects": [
        "Nation of Yahweh",
        "Black Hebrew Israelites"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YebrKIMDPtPW1tEjRO5lB",
        "apple": "https://podcasts.apple.com/podcast/113-herbert-cousins-yahweh-ben-yahweh-temple-of-fear/id1082012464?i=1000409877027",
        "youtube": "https://www.youtube.com/watch?v=hJab1ZeREM4"
      }
    },
    {
      "id": "9e3dea7e-5e01-43ce-ac2a-76e27d268955",
      "title": "165: Satanic Ritual Child Abuse, Confirmation Bias - Ken Lanning",
      "description": "Retired agent Ken Lanning served in the FBI for more than 30 years. For twenty years of his Bureau career, he was assigned to the Behavioral Science Unit (BSU) as a profiler specializing in the study of the sexual victimization of children. In this episode of FBI Retired Case File Review, Ken reviews the controversial topics of satanic ritual child abuse, recovered repressed memory, and the suggestibility of children. His work in this area and the ramifications of confirmation bias has divided and polarized many child advocates, the media, and the American public.\r\n\r\n His professional study of the criminal aspects of deviant sexual behavior included assignments to the Missing and Exploited Children’s Task Force from 1996 to 1998 and the National Center for the Analysis of Violent Crime from 1998 to 2000. He is a founding member of the Board of Directors of the American Professional Society on the Abuse of Children (APSAC) and a former member of the APSAC Advisory Board and the Advisory Board of the Association for the Treatment of Sexual Abusers (ATSA).\r\n\r\n He has testified before the U.S. Attorney General’s Task Force on Family Violence, the President’s Task Force on Victims of Crime, and the U.S. Attorney General’s Commission on Pornography. He has also testified on seven occasions before the U.S. Senate and House of Representatives and many times as an expert witness in state and Federal court. Ken Lanning has consulted on thousands of cases involving deviant sexual behavior, the sexual victimization of children, missing and exploited children, and the use of computers and the Internet to facilitate the sexual exploitation of children. He has also been retained as an expert in numerous civil cases concerning alleged negligence by youth-serving organizations.\r\n\r\n Ken Lanning has published articles in the FBI Law Enforcement Bulletin and other professional journals. He has authored two monographs on child abuse that have been widely distributed by the National Center for Missing and Exploited Children (NCMEC). Ken Lanning is the 2009 recipient of the Outstanding Service Award for Lifetime Achievements from the National Children\u0027s Advocacy Center. He has lectured before and trained tens of thousands of law enforcement officers, prosecutors, social workers, mental health and medical personnel, judges, and other professionals on the sexual victimization of children, child abuse and neglect, satanic ritual child abuse, and missing and exploited children. Mr. Lanning is currently a consultant in the area of crimes against children and the author of Love, Bombs, and Molesters: An FBI Agent\u0027s Journey, the story of his life leading up to his assignment to the BSU and his research involving the sexual victimization of children, satanic ritual child abuse, and confirmation bias.\n\r\nCheck out episode show notes, photos, and related articles here:  \nhttps://jerriwilliams.com/ken-lanning-satanic-ritual-child-abuse-confirmation-bias/\n\n  \nJoin my Reader Team to get the FBI Reading Resource - Books about the FBI, written by FBI agents, the 20 clichés about the FBI Reality Checklist, and keep up to date on the FBI in books, TV, and movies via my monthly email. Join here:   http://eepurl.com/dzCCmL \n\nJerri Williams, a retired FBI agent, author and podcaster, attempts to relive her glory days by writing and blogging about the FBI and hosting FBI Retired Case File Review, a true crime/history podcast. Visit her website to check out her books, available as audiobooks, ebooks and paperbacks wherever books are sold. https://jerriwilliams.com/books/",
      "release": "2019-05-20T01:28:58Z",
      "duration": "01:40:57",
      "explicit": false,
      "spotifyId": "2zdsmBHUprwhoUGRnMlP0Z",
      "appleId": 1000437565026,
      "youTubeId": "xrqTDTAz3kg",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zdsmBHUprwhoUGRnMlP0Z",
        "apple": "https://podcasts.apple.com/podcast/165-ken-lanning-satanic-ritual-child-abuse-confirmation/id1082012464?i=1000437565026",
        "youtube": "https://www.youtube.com/watch?v=xrqTDTAz3kg"
      }
    }
  ]
}