{
  "_ts": 0,
  "id": "e18a3246-1565-4f0d-b526-301031784f3d",
  "name": "Fearless Happyness Podcast",
  "spotifyId": "0Vt95Hmilnj4hQYeDcoyk0",
  "appleId": 1540998596,
  "youTubeChannelId": "UCrHiI9QZ40LMuCPUq6uoLDg",
  "episodes": [
    {
      "id": "6928c4c2-69a3-47b0-97de-209c78cc19de",
      "title": "Surviving Family Abuse, Cults \u0026 Crime: Sabrina Kapper’s Fight for Truth and Healing | E200",
      "description": "What does it take to stand up to the very people who were supposed to protect you, but instead caused your deepest wounds? In this gripping episode, Max sits down with Sabrina Capper, author of Licking the Knife, a raw true crime memoir that recounts surviving extreme abuse within her own family. Sabrina opens up about growing up in a toxic home entangled with cult-like religion and organized crime, and the courage it took to confront her dying abuser face to face. From breaking the silence to finding her voice, Sabrina’s story is heartbreaking, brave, and inspiring. This episode is a powerful reminder that healing begins the moment you speak your truth. Sabrina Capper is a successful PR and Communications professional representing Fortune 500 companies and incredible leaders worldwide. In 2023, she left the corporate world to pursue creative endeavors including writing and art. Her goal is to spark a conversation with generations of women raised in silence. Where to find Sabrina: \u0026#x1f310; Website: https://www.sabrinacapper.com/ \u0026#x1f933; Follow Sabrina on TikTok – @SabrinaCapper \u0026#x1f4f8; Connect on Instagram – @SabrinaCapper \u0026#x1f4d8; Grab a copy of her book, Licking the Knife: https://a.co/d/4XxWzsS Episode highlights: (0:00) Intro (1:21) Sabrina introduces her memoir Licking the Knife (3:00) Meaning behind the book’s title and childhood trauma (4:12) Family history with addiction and silence (9:40) The shocking event that pushed Sabrina to write her story (11:01) Confronting her grandfather on his deathbed (14:40) Insights into abuse, cult control, and organized crime (28:49) The moment Sabrina broke free emotionally (36:06) How her family tried to intimidate her into silence (53:55) Sabrina’s definition of “fearless” and “happiness” (58:18) Her advice: aim for just 1% better every day",
      "release": "2025-07-01T00:50:00Z",
      "duration": "01:00:49.7030000",
      "explicit": true,
      "spotifyId": "4142aXpzzzDHiuNXLJhEpX",
      "appleId": 1000715217118,
      "youTubeId": "ROFZIvylqmw",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4142aXpzzzDHiuNXLJhEpX",
        "apple": "https://podcasts.apple.com/podcast/surviving-family-abuse-cults-crime-sabrina-kappers/id1540998596?i=1000715217118",
        "youtube": "https://www.youtube.com/watch?v=ROFZIvylqmw"
      }
    }
  ]
}