{
  "id": "ec53395f-d8ae-4c7e-b1a3-835a4204245e",
  "name": "Fierce Rich Money",
  "youTubeChannelId": "UCvlKDDB7j27FBuH9LrO7zCw",
  "episodes": [
    {
      "id": "b12b9799-4483-49ca-ba3a-85f042fcbd79",
      "title": "Run from the MLM Side Hustle. Lose Money \u0026 Join a Cult",
      "description": "“Money isn’t just for paying bills. It’s a tool to build a life you love!” - Eva \n\nMost finance gurus give advice from a distance and promote extreme advice —like they’ve never actually struggled with money. But I’m not just talking theory—I’m living it. I’ve been through debt before, got out of it, and then life happened again. After being unemployed for two years, I found myself starting over again. \n\nIf you’re tired of being shamed for your financial struggles, you’re in the right place. I know what it’s like to juggle bills, deal with financial stress, and try to fix your money without the luxury of a six-figure income. My advice isn’t about perfection—it’s about real, doable steps that actually work for normal people. \n\n📌 Subscribe for real-world finance advice without the judgment😊 \n\nWe focus on practical, everyday strategies for getting out of debt and achieving financial stability. Here you will find down-to-earth advice that you can actually implement in your daily life. Whether you’re looking for budgeting tips, debt management strategies, or ways to improve your financial health without going to extremes, you’re in the right place! \n\nSubscribe to the channel for real-world tips and support as you work towards financial freedom. 💡💰 \n\nMy other channel; https://www.youtube.com/@EvasLifeEditProject \n\n12 Week Year: https://amzn.to/3Y33hST \nFree Printable:  https://www.fiercerichmoney.org/courses-printables \n💻  Fierce Rich Money Website https://www.fiercerichmoney.org \n📧 Join our mailing list  https://www.fiercerichmoney.org/newsletter \n🥂 Free Champagne Savings Printable https://www.fiercerichmoney.org/courses-printables \nhttps://www.fiercerichmoney.org/courses-printables \n******************************************************************************************************  \n\nMoney Saving Tools:  \n\nUse my affiliate links \n💵 Fetch   Use my code to get points 7MQVJA \n💵 Rakuten    You can earn $$$ for just shopping with my referral link  https://www.rakuten.com/r/FIERCE665?eeid=28187  \n🍽 Home Chef  You can get up to $35 off your order  https://www.homechef.com/invite/evelyns808 \n💵 Ally Bank   Open an account and earn money  https://www.ally.com/referral?code=2J9Z9N7K9N \n✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹  \n\n📱 Social Media  \nhttps://www.instagram.com/fiercerichmoney/ \nhttps://www.facebook.com/FierceRichMoney \nhttps://www.tiktok.com/@fierce.rich.money \n\n👉🏼 Media Inquiries 👈🏼 \n👩🏻 eva@fiercerichmoney.org \n\n✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹✹ \n\nDisclaimers: Some of the links provided are affiliate links. I receive a small commission if you purchase using the link. The best part is it doesn’t cost you extra when you make a purchase. It helps support Fierce Rich Money and helps get the message out to others. I truly appreciate you. \n\nI\u0027m not a Certified Financial Planner, CPA, Fake Guru, Attorney, Ivy League Grad, Chef, Fashion Designer, Drummer of an 80’s alternative band, or a Former Supermodel. This is not financial advice. The information shared are my opinions based on my (too many) years of experience. Those opinions are for entertainment purposes only. However not everyone will find it entertaining. It\u0027s their loss. \n\n#debtfree #budget #lowincome #financialfreedom #wealth #save #frugal #frugalliving #debtfreejourney #savemoney #personalfinance #moneytips #debt #moneygoals #bills #debtconfession #howtobudget #financiallystable #moneysavingtips #budgettips #FinancialWellness #DebtRepayment #Sidehustle #moneyhabits #FIRE #money #savemoney",
      "release": "2025-06-25T09:23:46Z",
      "duration": "00:11:43",
      "explicit": false,
      "youTubeId": "_20ygCUPBm8",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_20ygCUPBm8"
      }
    }
  ]
}