{
  "_ts": 0,
  "id": "a290a137-a0c6-4815-8c9e-bfaa0159a9fe",
  "name": "Fierce Freedom",
  "youTubeChannelId": "UCejRiW-PBOtJbGmc5EMeJSw",
  "episodes": [
    {
      "id": "94c2ae0d-d472-47c5-a494-f6d4e11406d6",
      "title": "How Can We Identify \u0026 Respond to Cult Abuse?",
      "description": "How prevalent are cults? And how is cult abuse similar to the coercion found in human trafficking cases? To learn more, we invited Dr. Lalich, the Founder and CEO of The Lalich Center on Cults and Coercion, which provides a collaborative approach and safe spaces for survivors through courses, workshops, and discussion groups. She shares about her own experience breaking free of a cult, and how she began her journey towards recovery to help create safe spaces and resources for others who had gone through a similar experience. To learn more about the work Janja is doing, you can visit: https://janjalalich.com/ To view the unedited video podcast, go here: youtu.be/9XZ3BhMmw90",
      "release": "2024-09-24T10:00:00Z",
      "duration": "00:40:14.2710000",
      "explicit": false,
      "spotifyId": "79VJW7JJxb5Z5s0fwdPju9",
      "appleId": 1000670514503,
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery",
        "Democratic Workers Party",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79VJW7JJxb5Z5s0fwdPju9",
        "apple": "https://podcasts.apple.com/podcast/how-can-we-identify-respond-to-cult-abuse/id1487662576?i=1000670514503"
      }
    },
    {
      "id": "6948b876-ecd5-4d7f-b701-4346fd4af222",
      "title": "How Can We Identify \u0026 Respond to Cult Abuse? Featuring Cult Expert Dr. Janja Lalich (Unedited)",
      "description": "How prevalent are cults? And how is cult abuse similar to the coercion found in human trafficking cases?\n\nTo learn more, we invited Dr. Lalich, the Founder and CEO of The Lalich Center on Cults and Coercion, which provides a collaborative approach and safe spaces for survivors through courses, workshops, and discussion groups.\n\nShe shares about her own experience breaking free of a cult, and how she began her journey towards recovery to help create safe spaces and resources for others who had gone through a similar experience. \n\nTo learn more about the work Janja is doing, you can visit: https://janjalalich.com/",
      "release": "2024-09-12T21:38:39Z",
      "duration": "00:53:52",
      "explicit": false,
      "youTubeId": "9XZ3BhMmw90",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery",
        "Democratic Workers Party",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9XZ3BhMmw90"
      }
    }
  ]
}