{
  "_ts": 0,
  "id": "7428fdb7-4568-40ab-9458-1c6a8acc9a1a",
  "name": "File on 4",
  "spotifyId": "6yeTUKtDg2QzLKrMeJGuQh",
  "appleId": 76934515,
  "episodes": [
    {
      "id": "1c52bfe6-eb12-4659-a5c4-6ccf5404326a",
      "title": "The abuse survivors calling on archbishop of York to resign",
      "description": "The BBC\u0027s religion editor Aleem Maqbool hears from sexual abuse victims who say they were let down by senior church leaders for decades. Priest David Tudor was allowed to continue working within the Church of England - despite widespread concerns about his behaviour. Now there are calls for the Archbishop of York, Stephen Cottrell to resign over his handling of the case. He is due to take temporary charge of the church in the New Year following the resignation of the Archbishop of Canterbury, Justin Welby. The Church of England says File on 4\u0027s investigation into the case of David Tudor has \u0027revealed a catalogue of past safeguarding decisions, that allowed someone who was considered a risk in the 1980s to return to ministry in the 1990s.\u0027 This, they say, should never have happened. Reporter: Aleem Maqbool Producers: Steve Swann and Hayley Mortimer Technical producer: Craig Boardman Production coordinator: Tim Fernley Editor: Carl Johnston",
      "release": "2024-12-16T06:00:00Z",
      "duration": "00:42:16.0680000",
      "explicit": true,
      "spotifyId": "1r6JwF3QVD8DFsJMpPJkJi",
      "appleId": 1000680517147,
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1r6JwF3QVD8DFsJMpPJkJi",
        "apple": "https://podcasts.apple.com/podcast/the-abuse-survivors-calling-on-archbishop-of-york-to-resign/id76934515?i=1000680517147"
      }
    },
    {
      "id": "061a1347-9f6a-4a38-9593-c95c8fd6f5e6",
      "title": "Long Covid: Mind Over Matter?",
      "description": "There are some two million people with long Covid in the UK - and most of them - around one and a half million - have symptoms that interfere with day to day activities. Fatigue, breathlessness, heart palpitations and severe dizziness are just some of the conditions people experience. Currently there’s no test for long covid and it could be years before we know for sure how best to treat the condition. This struggle to get help is leaving some very unwell people desperate - and willing to try anything to get better. There are treatments to wash your blood, high pressure oxygen chambers normally used by deep sea divers. A rainbow of supplements. All with varying degrees of evidence. And perhaps most strongly dividing opinion - programmes that claim to retrain long Covid patients\u0027 brains to stop their symptoms. They say they can help people recover from illness by rewiring the brain using techniques to influence physical changes in the body. Rachel Schraer - the BBC\u0027s health and disinformation correspondent - hears from people with long Covid who say the programmes didn\u0027t work and in some cases made them feel worse. Others say they fully recovered. Reporter: Rachel Schraer Producer: Paul Grant Technical producers: Cameron Ward and Nicky Edwards Production co-ordinator: Tim Fernley Editor: Carl Johnston",
      "release": "2024-05-21T05:00:00Z",
      "duration": "00:38:15.5090000",
      "explicit": false,
      "spotifyId": "6sybsgUzpE9p7CcsaZ5QMW",
      "appleId": 1000656229942,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6sybsgUzpE9p7CcsaZ5QMW",
        "apple": "https://podcasts.apple.com/podcast/long-covid-mind-over-matter/id76934515?i=1000656229942"
      }
    },
    {
      "id": "32395bdc-45a4-40aa-bd9c-e67bdee4608a",
      "title": "Am I in a Cult?",
      "description": "How do you know if you’ve been recruited by a cult? Rachel Stonehouse investigates claims there are up to 2,000 cults currently operating in the UK. We talk to young people who say they were recruited on campus and a father who went to court to free his daughter from the influence of a harmful cult.  Reporter: Rachel Stonehouse Producer: Michael Cowan Editor: Maggie Latham Researcher: Natasha Fernandes",
      "release": "2021-11-23T00:00:00",
      "duration": "00:37:09.9180000",
      "explicit": false,
      "spotifyId": "6AvfzlidjaSpKlbQZJfem8",
      "appleId": 1000542876460,
      "subjects": [
        "Universal Medicine",
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6AvfzlidjaSpKlbQZJfem8",
        "apple": "https://podcasts.apple.com/podcast/am-i-in-a-cult/id76934515?i=1000542876460",
        "bbc": "https://www.bbc.co.uk/sounds/play/m0011sg7"
      }
    }
  ]
}