{
  "_ts": 0,
  "id": "b8baaf7a-1894-48b6-9cfc-b478b98cffd4",
  "name": "Filthy Ritual",
  "spotifyId": "3g89DYSv46rN1AnYmBjDgc",
  "appleId": 1681824993,
  "episodes": [
    {
      "id": "7cd89871-f473-4caf-a757-5b7b4502a655",
      "title": "6. An Epiphany at the Hampstead Toy Boat Pond",
      "description": "The trial is over, this should be the end of it. But as they gather on the steps of Blackfriars Court, Keith, Maria and Sylvia hear rumours of a new scam that’s been unfolding right under their noses. Filthy Ritual is a Global Original podcast, produced by Global and Novel. In partnership with Dentsu Entertainment. If you’ve been affected by anything you’ve heard in this podcast or think you, or someone you know, may have been scammed, you\u0027re not alone and there\u0027s support available. Age UK has helpful advice and information for anyone who thinks they’ve been scammed. Action Fraud can be contacted any time day or night, or you can call the Action Fraud team on 0300 123 2040. Victim Support or Think Jessica provide emotional and practical help to victims of crimes and scams Contact the 24-hour Samaritans helpline on 116 123 if you feel low or anxious and need someone to talk to.",
      "release": "2023-05-24T04:00:00Z",
      "duration": "00:46:32.9450000",
      "explicit": false,
      "spotifyId": "37yN2rdKw4HV9jgiob76cK",
      "appleId": 1000614248907,
      "subjects": [
        "Juliette D\u0027Souza"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/37yN2rdKw4HV9jgiob76cK",
        "apple": "https://podcasts.apple.com/podcast/6-an-epiphany-at-the-hampstead-toy-boat-pond/id1681824993?i=1000614248907"
      }
    },
    {
      "id": "6623b29b-deed-4b66-9816-476219beae7e",
      "title": "5. The Paper Trail Trial",
      "description": "At Blackfriars Crown Court, a long-awaited trial is about to commence. It could finally bring justice to this group of Hampstead victims. But Juliette D’Souza’s defence team are about to develop a new theory about who is really responsible for the last two decades of ‘magic’ and manipulation. Filthy Ritual is a Global Original podcast, produced by Global and Novel. In partnership with Dentsu Entertainment. If you’ve been affected by anything you’ve heard in this podcast or think you, or someone you know, may have been scammed, you\u0027re not alone and there\u0027s support available. Age UK has helpful advice and information for anyone who thinks they’ve been scammed. Action Fraud can be contacted any time day or night, or you can call the Action Fraud team on 0300 123 2040. Victim Support or Think Jessica provide emotional and practical help to victims of crimes and scams.",
      "release": "2023-05-17T04:00:00Z",
      "duration": "00:44:34.0330000",
      "explicit": false,
      "spotifyId": "63KZ6uJBEHAuwYLqLnowNy",
      "appleId": 1000613318310,
      "subjects": [
        "Juliette D\u0027Souza"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/63KZ6uJBEHAuwYLqLnowNy",
        "apple": "https://podcasts.apple.com/podcast/5-the-paper-trail-trial/id1681824993?i=1000613318310"
      }
    },
    {
      "id": "0b468498-152b-4ecd-a07c-e6cefc2deb20",
      "title": "4. How Do You Solve a Problem Like Maria?",
      "description": "Sylvia Eaves, a retired Opera singer with a knack for making friends, who lost thousands of pounds to Juliette D’Souza finds herself back in the thrall of the healer of Hampstead. But this time, Juliette hasn’t counted on one DIY detective who will stand in her way: An intrepid nurse and amateur detective named Maria Feeney. Filthy Ritual is a Global Original podcast, produced by Global and Novel. In partnership with Dentsu Entertainment. If you’ve been affected by anything you’ve heard in this podcast or think you, or someone you know, may have been scammed, you\u0027re not alone and there\u0027s support available. Age UK has helpful advice and information for anyone who thinks they’ve been scammed. Action Fraud can be contacted any time day or night, or you can call the Action Fraud team on 0300 123 2040. Victim Support or Think Jessica provide emotional and practical help to victims of crimes and scams.",
      "release": "2023-05-10T04:00:00Z",
      "duration": "00:48:12.0350000",
      "explicit": false,
      "spotifyId": "4XsYtw973DtAQ1lmZceRIY",
      "appleId": 1000612426464,
      "subjects": [
        "Juliette D\u0027Souza"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4XsYtw973DtAQ1lmZceRIY",
        "apple": "https://podcasts.apple.com/podcast/4-how-do-you-solve-a-problem-like-maria/id1681824993?i=1000612426464"
      }
    },
    {
      "id": "2a844f3b-b7ba-4dfa-8f15-d32cfa815680",
      "title": "3. Wherefore Art Thou Juliette?",
      "description": "In the face of apathy and ridicule from the police, Keith Bender takes his allegations about Juliette D’Souza to the only avenue that’s left to him: the media. A few months later, a newly formed investigative team of plucky journalists touch down in Suriname for the reporting adventure of a lifetime. Filthy Ritual is a Global Original podcast, produced by Global and Novel. In partnership with Dentsu Entertainment. If you’ve been affected by anything you’ve heard in this podcast or think you, or someone you know, may have been scammed, you\u0027re not alone and there\u0027s support available. Age UK has helpful advice and information for anyone who thinks they’ve been scammed. Action Fraud can be contacted any time day or night, or you can call the Action Fraud team on 0300 123 2040. Victim Support or Think Jessica provide emotional and practical help to victims of crimes and scams.",
      "release": "2023-05-03T04:00:00Z",
      "duration": "00:45:24.6820000",
      "explicit": false,
      "spotifyId": "7k5WqO9mgaRrLa2dTr2gvz",
      "appleId": 1000611528620,
      "subjects": [
        "Juliette D\u0027Souza"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7k5WqO9mgaRrLa2dTr2gvz",
        "apple": "https://podcasts.apple.com/podcast/3-wherefore-art-thou-juliette/id1681824993?i=1000611528620"
      }
    },
    {
      "id": "01d86e64-46aa-46ae-8ae8-c1d48cea5ce6",
      "title": "2. The Spirits Are Always Watching",
      "description": "Keith starts spreading the word about Juliette D’Souza’s ‘powers’. Little by little, Juliette’s client base expands across Hampstead, as her promises of miracle cures captivate more and more of its residents. All is not well. Under Juliette’s influence, Keith has lost control of his own life. After she goes missing, Keith is left to reckon with her real identity. Filthy Ritual is a Global Original podcast, produced by Global and Novel. In partnership with Dentsu Entertainment. If you’ve been affected by anything you’ve heard in this podcast or think you, or someone you know, may have been scammed, you\u0027re not alone and there\u0027s support available. \u0026#xfeff;Age UK has helpful advice and information for anyone who thinks they’ve been scammed. Action Fraud can be contacted any time day or night, or you can call the Action Fraud team on 0300 123 2040. Victim Support or Think Jessica provide emotional and practical help to victims of crimes and scams.",
      "release": "2023-04-26T04:00:00Z",
      "duration": "00:42:44.7320000",
      "explicit": false,
      "spotifyId": "04foaHOP4uE4zlw5XROCRD",
      "appleId": 1000610650317,
      "subjects": [
        "Juliette D\u0027Souza"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/04foaHOP4uE4zlw5XROCRD",
        "apple": "https://podcasts.apple.com/podcast/2-the-spirits-are-always-watching/id1681824993?i=1000610650317"
      }
    },
    {
      "id": "ba847ca2-c7b3-4071-813c-babcf078eefd",
      "title": "1. The Healer of Hampstead",
      "description": "An eccentric osteopath, Keith Bender, meets a charming, mysterious woman named Juliette D’Souza. Keith’s life is falling apart, and Juliette seems to know just how to fix it. She wins his trust and whisks him off on a journey to meet a shamanic healer in Suriname, changing his life forever. Soon, she’s bringing her supernatural influence into the heart of the bohemian London suburb where Keith worked: Hampstead. Filthy Ritual is a Global Original podcast, produced by Global and Novel. In partnership with Dentsu Entertainment. If you’ve been affected by anything you’ve heard in this podcast or think you, or someone you know, may have been scammed, you\u0027re not alone and there\u0027s support available. Age UK has helpful advice and information for anyone who thinks they’ve been scammed. Action Fraud can be contacted any time day or night, or you can call the Action Fraud team on 0300 123 2040. Victim Support or Think Jessica provide emotional and practical help to victims of crimes and scams.",
      "release": "2023-04-19T01:00:00Z",
      "duration": "00:46:17.3940000",
      "explicit": false,
      "spotifyId": "5t17ikPIdtPjTT1H1gkHBH",
      "appleId": 1000609554187,
      "subjects": [
        "Juliette D\u0027Souza"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5t17ikPIdtPjTT1H1gkHBH",
        "apple": "https://podcasts.apple.com/podcast/1-the-healer-of-hampstead/id1681824993?i=1000609554187"
      }
    }
  ]
}