{
  "_ts": 0,
  "id": "027be2b3-0c58-4f4a-9814-61acd698a81a",
  "name": "Finally Seen",
  "spotifyId": "64NBDmD9OZxTM9FVrYZYac",
  "appleId": 1823745851,
  "youTubeChannelId": "UCVoQRZuBlhJ58e5SK7B2cnA",
  "episodes": [
    {
      "id": "1c8bb0a9-e296-4f98-8999-5b577a113cce",
      "title": "Amber Powers: Finding Her Voice After Leaving the Cult-like Religion She Was Born Into",
      "description": "Ready to find your voice? In this week’s episode of the Finally Seen podcast, our guest is Amber Powers, marketing strategist, brand messaging expert, professional copywriter, and the best-selling author of Untethered: Tales of a Modern-Day Alice. Amber shares her extraordinary journey from escaping a cult-like religious upbringing to reclaiming her voice and rewriting her narrative. Explore the ethical side of influence, aligning personal values with professional pursuits, and the joy that comes when you finally show up as your truest self. Tune in now! In this episode: Amber’s story of leaving behind an oppressive environment The symbolism of Alice in Wonderland as a guide for Amber’s freedom How writing her memoir became an act of liberation The tension between family loyalty and personal truth Actionable ways to align your brand with your values This episode is sponsored by: Bobelo(Use code ChrissyBernal15% at checkout to get 15% off!) Bio: Amber Powers is a best-selling author, ethical influencer strategist, and the founder of Powers Digital Marketing. Once a member of a cult-like religious community where her voice was silenced, Amber has transformed her story into a mission: to guide aspiring thought leaders and world-changers to find their voice, own it unapologetically, and step into visible, values-driven influence. With a track record spanning over a decade, Amber has helped brands and leaders amplify their impact, growing followings by over 7,000%, increasing podcast downloads by 1,100%, and securing clients on major platforms, including CBS National Morning News, CNN, People, and Condé Nast. Her work includes helping a marketing team fill a charter school to capacity for the first time in Indiana history, driving YouTube growth by 1,900%, organically adding 100,000 new Instagram followers in under six months, and boosting profits by more than 300%. Today, Amber is committed to walking hand-in-hand with purpose-driven entrepreneurs as they overcome imposter syndrome, claim their narrative, and rise as thought leaders and ethical influencers in their fields. Website: https://powersdigitalmarketing.com/ LinkedIn: https://www.linkedin.com/in/amberkaypowers/ Instagram: https://www.instagram.com/amberkaypowers/ Amber’s Book: https://www.amazon.com/Untethered-Story-Lost-Religion-Voice/dp/1998754669 beabetterbrand.com/",
      "release": "2025-07-08T09:00:00Z",
      "duration": "00:50:05.2040000",
      "explicit": false,
      "spotifyId": "5X24VB3a46HoZxssbwHcYJ",
      "appleId": 1000716301616,
      "youTubeId": "soUwbtwXRt0",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5X24VB3a46HoZxssbwHcYJ",
        "apple": "https://podcasts.apple.com/podcast/amber-powers-finding-her-voice-after-leaving-the-cult/id1823745851?i=1000716301616",
        "youtube": "https://www.youtube.com/watch?v=soUwbtwXRt0"
      }
    }
  ]
}