{
  "_ts": 0,
  "id": "df9b7f50-1e99-497d-a307-2c8495b5a7d2",
  "name": "Financial Feminist",
  "spotifyId": "0b5qzMiw22wHBfe1x9LfaQ",
  "appleId": 1566054936,
  "episodes": [
    {
      "id": "5592adac-6d1f-4dc8-b3a8-ce58c49eccfe",
      "title": "189. Escaping Tradwife Cults and Christian Patriarchy with Tia Levings",
      "description": "CW: SA, abuse, loss, trauma What happens when the doctrines of faith and control intersect with a woman\u0027s autonomy? In this episode, I sat down with Tia Levings, author of the powerful memoir “A Well-Trained Wife,” and her story will leave you speechless. Tia dives deep into her experience growing up in and escaping from Christian fundamentalism and the trad wife movement— before it was even called that. We talk about how patriarchal control impacts women financially, emotionally, and physically, and how that same mindset influences the political movements we\u0027re seeing today. If you\u0027ve ever wondered how personal freedom intersects with religion, politics, and financial independence, this is the episode for you. Read transcripts, learn more about our guests and sponsors, and get more resources at https://herfirst100k.com/financial-feminist-show-notes/189-escaping-tradwife-cults-and-christian-patriarchy-with-tia-levings/ Tia’s Links: Website: www.tialevings.com Get Tia’s book “ A Well-Trained Wife ” Not sure where to start on your financial journey? Take our FREE money personality quiz! https:// herfirst100k.com/quiz Are you registered to vote? https://vote.org/ Special thanks to our sponsors: Thrive Causemetics Get an exclusive 20% off your first order at thrivecausemetics.com/FFPOD Squarespace Go to www.squarespace.com/FFPOD to save 10% off your first website or domain purchase. Masterclass Get an additional 15% off any annual membership at masterclass.com/FFPOD. Rocket Money Stop wasting money on things you don’t use. Cancel your unwanted subscriptions by going to RocketMoney.com/FFPOD. This is Small Business Check out This Is Small Business, an original podcast from Amazon, on your favorite podcast app.",
      "release": "2024-09-30T09:00:00Z",
      "duration": "01:10:29.0410000",
      "explicit": false,
      "spotifyId": "0zHB5ZZ66FQJ2TeZGOvoUR",
      "appleId": 1000671269513,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0zHB5ZZ66FQJ2TeZGOvoUR",
        "apple": "https://podcasts.apple.com/podcast/escaping-tradwife-cults-and-christian-patriarchy-with/id1566054936?i=1000671269513"
      }
    }
  ]
}