{
  "id": "62217711-186d-4ee6-8af4-4243fb656a13",
  "name": "Finance Made Simple",
  "youTubeChannelId": "UCWbiSzoFEBixqryDnuTcUsQ",
  "episodes": [
    {
      "id": "0f92f9b0-e894-4385-b9b1-bbdede5f748f",
      "title": "The INSANE Birth of a Stock Market Cult",
      "description": "In this GameStop short squeeze documentary, learn how Reddit and Wallstreetbets beat Wall Street at its own game.\n\nThe GameStop short squeeze was an event that rocked the world of finance and made headlines around the globe. In January of 2021, the struggling retailer GameStop saw its stock rise over 2000% as an epic short squeeze caused the stock to explode upwards and created nearly $20 billion in losses for Wall Street hedge funds. \n\nAs if that wasn’t crazy enough to begin with, the reason the short squeeze happened was due to massive interest from retail investors on reddit as regular people began to flock from social media platforms to the stock market in droves to buy GameStop stock in a David Vs. Goliath story between Wall Street and Main Street. GameStop would become so popular on social media that the term “meme stock” was invented to describe the phenomenon.\n\nAnd this event was unlike any other in stock market history. For years, hedge funds had shorted GameStop, a company that was seen as a dying brick and mortar chain that would eventually fail due to the rise of digital games and e-commerce. But as people began to notice the high short interest in GameStop’s stock, there was a surge of interest in Gamestop’s stock from retail investors on Reddit\u0027s r/WallStreetBets and other social media platforms that helped create a short squeeze so big that it quite literally almost broke the stock market.\n\nIn this video, we will explore the insane history of the GameStop short squeeze and how this phenomenon forever changed the stock market. This is the story of the GameStop short squeeze and how stocks became memes.\n\nWith the increased attention surrounding GameStop because of Michael Burry and Ryan Cohen, a small number of individual investors on the r/WallStreetBets subreddit began to look at the stock much more closely. \n\nOne retail investor in particular named Keith Gill noticed the potential in Gamestop’s stock and began to acquire a position in GameStop buying 50,000 shares and 500 call options for roughly $53,000. Keith went by the moniker Roaring Kitty online and began to post about GameStop on YouTube and Reddit’s WallStreetBets subreddit. Keith considered himself a value investor and on his YouTube channel, we would post videos explaining why he believed that Gamestop’s stock was considerably undervalued and overshorted.\n\nHe began to gain a following online for his bullish outlook on GameStop and for sharing frequent updates on Reddit on the current value in his GameStop position. As GameStop’s price began to go up, Keith’s updates showed him making significant gains which helped generate interest from other retail investors. Keith essentially became a bit of a face for retail investors who were interest in GameStop and the publicity he brought to the stock helped generate excitement with other people.\n\nBut what made people particularly interested in Keith’s position was his theory that there could eventually be a massive short squeeze in the stock. Keith noted that GameStop was the most heavily shorted stock in the entire stock market. In fact, GameStop’s stock had over 100% of its available shares shorted at one point as short sellers were borrowing the shares and selling them back into the market repeatedly to other buyers. When those new share owners lent those same shares out to other short sellers, shares in GameStop were being shorted multiple times leading to over 140% of the shares being short at its peak. This was due to hedge funds like Melvin Capital which were heavily shorting GameStop in large quantities.\n\nHaving over 100% short interest was a big deal because people on WallStreetBets and other social media platforms began to speculate about the potential for a massive short squeeze in GameStop. \n\nOwning shares in a stock that short squeezes can be incredibly lucrative, but it is also very risky and unpredictable because the stock’s price is rising due to shorts being forced to buy and not necessarily because of improvements in the actual company’s business. But since GameStop had over 100% of its available shares shorted, people on WallStreetBets and other social media platforms began to theorize about the possibility of a massive short squeeze.\n\n#wallstreetbets #gamestop #gme \n\nDisclaimer: Opinions expressed in this video are my personal opinion and are for information and entertainment purposes only. It is not intended to be financial advice and you are responsible for doing research and making your own financial decisions. Seek a licensed professional for financial advice.",
      "release": "2025-08-15T04:31:31Z",
      "duration": "00:34:37",
      "explicit": false,
      "youTubeId": "sAwDMOwPgZY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sAwDMOwPgZY"
      }
    }
  ]
}