{
  "_ts": 0,
  "id": "df9b7f50-1e99-497d-a307-2c8495b5a7d2",
  "name": "Financial Feminist",
  "spotifyId": "0b5qzMiw22wHBfe1x9LfaQ",
  "appleId": 1566054936,
  "youTubeChannelId": "UCfYq6pFD2f9_MV6Ir3DsSyQ",
  "episodes": [
    {
      "id": "59929b5d-6154-4ee3-92e8-994ebbd8ffe2",
      "title": "She was in a SPANKING cult?! | Financial Feminist Interview with Tia Levings",
      "description": "What really happens behind closed doors in a spanking cult? Tia Levings pulls back the curtain on a dark, twisted world of control and abuse. This clip reveals the disturbing practices she endured and how she fought her way to freedom.\n\n🔥 Click to hear her unbelievable story! Full episode here: https://herfirst100k.com/financial-feminist-show-notes/189-escaping-tradwife-cults-and-christian-patriarchy-with-tia-levings/\n\n#SpankingCultExposed #CultSecrets #TiaLevings #FinancialFeminist",
      "release": "2024-10-16T18:01:15Z",
      "duration": "00:10:15",
      "explicit": false,
      "youTubeId": "KdEe5qGz2r4",
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KdEe5qGz2r4"
      }
    },
    {
      "id": "8a9e1fec-5225-456c-944d-79adff47509d",
      "title": "189. Secrets of Tradwife Cults and Christian Patriarchy with Tia Levings",
      "description": "CW: SA, abuse, loss, trauma What happens when the doctrines of faith and control intersect with a woman\u0027s autonomy? In this episode, I sat down with Tia Levings, author of the powerful memoir “A Well-Trained Wife,” and her story will leave you speechless. Tia dives deep into her experience growing up in and escaping from Christian fundamentalism and the trad wife movement— before it was even called that. We talk about how patriarchal control impacts women financially, emotionally, and physically, and how that same mindset influences the political movements we\u0027re seeing today. If you\u0027ve ever wondered how personal freedom intersects with religion, politics, and financial independence, this is the episode for you. Read transcripts, learn more about our guests and sponsors, and get more resources at https://herfirst100k.com/financial-feminist-show-notes/189-escaping-tradwife-cults-and-christian-patriarchy-with-tia-levings/ Tia’s Links: Website: www.tialevings.com Get Tia’s book “ A Well-Trained Wife ” Not sure where to start on your financial journey? Take our FREE money personality quiz! https:// herfirst100k.com/quiz Are you registered to vote? https://vote.org/ Special thanks to our sponsors: Thrive Causemetics Get an exclusive 20% off your first order at thrivecausemetics.com/FFPOD Squarespace Go to www.squarespace.com/FFPOD to save 10% off your first website or domain purchase. Masterclass Get an additional 15% off any annual membership at masterclass.com/FFPOD. Rocket Money Stop wasting money on things you don’t use. Cancel your unwanted subscriptions by going to RocketMoney.com/FFPOD. This is Small Business Check out This Is Small Business, an original podcast from Amazon, on your favorite podcast app.",
      "release": "2024-09-30T09:00:00Z",
      "duration": "01:10:06.2620000",
      "explicit": false,
      "spotifyId": "0zHB5ZZ66FQJ2TeZGOvoUR",
      "appleId": 1000671269513,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0zHB5ZZ66FQJ2TeZGOvoUR",
        "apple": "https://podcasts.apple.com/podcast/secrets-of-tradwife-cults-and-christian-patriarchy/id1566054936?i=1000671269513"
      }
    },
    {
      "id": "96651a99-b840-4c67-b3e2-b0c2ac79c584",
      "title": "67. How Cults Prey on Women and Their Finances with Dr. Janja Lalich",
      "description": "The world is obsessed with cults –– and there are more documentaries and true crime podcasts than ever on some of the most controversial organizations. But not every cult is so apparent, and there are smaller, less insidious-seeming figures that are doing harm daily, especially to women and other already marginalized communities. To better understand how these organizations operate, we sat down with Dr. Janja Lalich, who has dedicated her life to the study of cults and helping members and their families get out and recover. She vulnerably shares about her time in a cult and the ways in which cults use emotional manipulation and abuse against women. To learn more about our guests, read transcripts, and get additional resources, check out our show notes at www.financialfeministpodcast.com.",
      "release": "2023-01-24T10:00:00Z",
      "duration": "00:50:22.4450000",
      "explicit": false,
      "spotifyId": "6VRslEZwJWQirIRxpNNkFs",
      "appleId": 1000596242727,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6VRslEZwJWQirIRxpNNkFs",
        "apple": "https://podcasts.apple.com/podcast/how-cults-prey-on-women-and-their-finances-with-dr/id1566054936?i=1000596242727"
      }
    },
    {
      "id": "67f726a4-6a89-43d8-8edd-0cb0156d5e88",
      "title": "2. The Scandalous and Sketchy Truth Behind MLMs, with Jane Marie",
      "description": "“Hey boss babe!” In this episode, we break down every shady practice that draws so many women into the MLM world and what it’s like to be a woman in male-dominated spaces. Our guest, Jane Marie, is a Peabody and Emmy award-winning journalist and owner of the LA-based podcast production company, Little Everywhere. Jane also hosts The Dream podcast, where she interviews men and women in the multi-level marketing and wellness industries. Follow Jane on Instagram: www.instagram.com/seejanemarie/ Official Financial Feminist Merch: herfirst100k.com/hfk-merch INSTAGRAM: www.instagram.com/herfirst100k/ TIKTOK: www.tiktok.com/@herfirst100k FACEBOOK GROUP: www.facebook.com/groups/362601367623070/ Not sure where to start with your finances? Take the free Money Personality Quiz to get tailored resources for your financial journey: https://treasury.app/herfirst100k/money-journey-quiz Pre-Order “Financial Feminist: Overcome the Patriarchy’s Bullsh*t to Master Your Money and Build a Life You Love”: https://bit.ly/3PpHvlC",
      "release": "2021-05-21T00:00:00",
      "duration": "01:05:23.6960000",
      "explicit": true,
      "spotifyId": "5gpt7vtWJbrFUAiDVfj4FU",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5gpt7vtWJbrFUAiDVfj4FU"
      }
    }
  ]
}