{
  "id": "0137a613-f955-4bde-ac97-2b2a25b254f4",
  "name": "Finding Better Podcast",
  "youTubeChannelId": "UCn03CucCaO2FfNFbrNOnhng",
  "episodes": [
    {
      "id": "d7f655aa-ff26-430e-a0ef-9f56c75ad7a5",
      "title": "EP 185 - From a Cult to the Cockpit to the Control Room: How Radical Responsibility Saved His Life",
      "description": "🎙️ From a controlling childhood in a religious cult, to two combat tours in Iraq, to calling the shots as a live TV director — Logan’s story is one of survival, radical responsibility, and reinvention. In this episode, John Suzuki sits down with Logan to unpack the choices, the low points, and the moment that changed everything — the decision to fight not only for himself but to model resilience for his daughter.\n\nInside this conversation, you’ll learn:\n\n 1.How a strict cult upbringing shaped identity and led to suicidal thinking — and how Logan escaped.\n2. Why joining the Air Force became both a refuge and a source of further trauma (two tours in Iraq).\n3. The ways PTSD and hypervigilance followed him home, and how those effects show up in daily life.\n4. The turning point: the thought that saved him and led to sobriety and radical action.\n5. How Logan cold-called his way into TV directing — and why pursuing a dream is part of healing.\n6. What “radical responsibility” really means and practical steps listeners can use to take control.\n7. How to lead by example so your life becomes a blueprint, not a warning, for the next generation.\n\n💡 Key Takeaways:\n\n1. Healing often begins with a single conscious decision to stop waiting for rescue and start taking responsibility.\n2. Trauma compounds when left unaddressed; professional help \u002B sustained action are critical.\n3. Purpose (like Logan’s directing dream) can be a powerful vehicle for recovery.\n4. Leading by example — especially for children — can reframe personal struggle into legacy.\n\nConnect with Logan:\n🌐 Website – https://www.theloganunlimited.com/ \n📸 Instagram – https://www.instagram.com/theloganunlimited/\n💼 LinkedIn – https://www.linkedin.com/in/loganunlimited/ \n\nIf this episode hit you, please Like, Subscribe, and Share — and leave a review so we can keep bringing forward stories that help us all find better.\n\nThanks for watching\n\nPlease subscribe to the channel and hit the bell Icon to stay connected\n\nAt Finding Better, our mission is to help you facilitate the \u0027better\u0027 you want by offering you a unique and transformative opportunity to uncover the path towards a better and more fulfilling life. Our platform is designed to guide you in your pursuit of a \u0027better\u0027 version of yourself, and the key lies in the invaluable experiences shared by those who have successfully traversed this very journey. \nOur approach is firmly grounded in the notion that real-life stories, personal trials, and experiences of successful individuals are the most authentic sources of inspiration and guidance. This experiential element is what sets Finding Better apart. We provide a platform where folks who have gone through their unique challenges and emerged triumphant, willingly share their life-altering insights, strategies, and practical wisdom.\n\nOur host John Suzuki believes we all have three careers; first to learn and go to school, second to earn and make a living, and third to return and give back. Now in his third career of giving back, John’s mission is to make the world better by inspiring people to live with less fear and divisiveness and bring a little more love into the world. Know more about John - https://johnsuzuki.com/\n\nFollow John on Social Media \n\nFacebook - https://www.facebook.com/people/Finding-Better-Podcast/61553181525310/\n\nInstagram - https://www.instagram.com/johnjsuzuki/\n\nLinkedIn - https://www.linkedin.com/in/john-suzuki/\n\nCheck John’s Website - https://johnsuzuki.com/\n\nLet’s come together live better lives through inspiration, inclusion, and understanding. Reach One Teach One.",
      "release": "2025-11-14T23:00:06Z",
      "duration": "00:59:28",
      "explicit": false,
      "youTubeId": "JOpju7WsTu8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JOpju7WsTu8"
      }
    }
  ]
}