{
  "_ts": 0,
  "id": "f8b7362f-3fa4-4260-9435-a06f5856029c",
  "name": "FINE is a 4-Letter Word",
  "spotifyId": "3xC9YpfXCnrlJXiST5b1uu",
  "appleId": 1566596312,
  "episodes": [
    {
      "id": "60b92a14-2fb9-463c-89c6-849ca70d2ffc",
      "title": "119. The Truth is a Lie with Sally Lotz",
      "description": "Imagine, for a moment, being a child and knowing something was wrong, but being too young to understand.Now picture yourself in a cult without knowing the word for it.That’s what happened to Sally Lotz.Until she was four years old, things seemed normal. Then her parents divorced, her dad left the picture as he served overseas in the military, and her mother took Sally and her siblings to a new city.Suddenly, everything changed.Instead of having freedom to explore, now all her decisions were made for her. How she dressed for school and which classmates she was allowed to interact with (meaning none). Her role was to do only what others told her to do.Sally knew something wasn’t right. One of the first clues came when she buried a butterfly she believed was dead, and then unburied the soil later and found the butterfly was gone. If there was no heaven, as Sally was told by the cult, where did the dead butterfly go?Her new stepfather abused her in every horrible way imaginable. And her mother accused her of being a “bad influence” moments after her stepdad kicked their cat across the room. Sally was made to feel that being sexually molested by him was her own fault. On top of that, she was told there was no way to prove it even happened because she didn’t have two witnesses to back her claims.Ironically, the people who caught Sally making out with her high school boyfriend didn’t need two witnesses. All it took was their word, and Sally found herself facing a perverted, sexually charged interrogation by multiple adult men.Sally soon left the cult and joined her father who was now in San Diego, where she went straight from having to follow rules for everything to no rules at all. She finished school, then tried college, but it didn’t work out. She went back to what felt familiar and found a man to take care of her. They married when she was only 20 and had three children.Despite all that had happened up until then, Sally’s life seemed to be improving and everything seemed fine.But Fine is a 4-letter word.She found that out when her husband joined a cult similar to the one she’d been raised in, and all the same rules suddenly came back into play. She divorced him. But then her mother, who had not left the cult, came to stay with her.In a moment, when you meet Sally, you’ll join her on a journey down a winding road with double-backs and wrong turns as she comes to cope with two traumas – the trauma of an abusive home and religious trauma. These two things have fueled her career as an author, writing coach, and mentor. Her fourth book, The Truth is a Lie, is a young adult novel based on her life growing up in a cult and aims to help others understand and gain strength.Sally’s hype song is \u0022Girl on Fire” by Alicia Keys. Resources:Sally Lotz’s website: https://www.sallylotz.com/ LinkedIn: https://www.linkedin.com/in/sallyjlotz/ Facebook: https://www.facebook.com/YourPathToWriting/ Instagram: https://www.instagram.com/sallyjlotzLink to Episode 49, Setting Her Own Course with Sabrina Victoria: https://zenrabbit.com/podcast/setting-her-own-course/Invitation from Lori:Like Sally, you may be so immersed in your...",
      "release": "2023-12-14T10:00:00Z",
      "duration": "00:45:18.8500000",
      "explicit": true,
      "spotifyId": "4WDDoFasOYtc8MvEB2lPR8",
      "appleId": 1000638540070,
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4WDDoFasOYtc8MvEB2lPR8",
        "apple": "https://podcasts.apple.com/podcast/the-truth-is-a-lie-with-sally-lotz/id1566596312?i=1000638540070"
      }
    }
  ]
}