{
  "_ts": 0,
  "id": "18d01c52-3eb8-418b-bdf8-b3460a960d24",
  "name": "Goals, Grit, and Some Woo Woo Sh*t",
  "spotifyId": "6e35eOHfGxUbsWJcovuoIw",
  "appleId": 1665757773,
  "youTubeChannelId": "UCqfSRgOyqAQtU-I8awwmwcA",
  "episodes": [
    {
      "id": "89345ec9-a8bf-41f0-8db1-dbddfead9a8d",
      "title": "Episode 45: Growing Up In A Doomsday Cult (while Black) with LaNisa Frederick",
      "description": "Let’s have a light chat about cults with LaNisa Frederick.\n\nShe’s an award-winning actor, writer, content creator, voiceover artist and black survivor of Doomsday Cult, WorldWide Church of God. \n\nLet’s get the lay of the land. What exactly is a cult? You might find isolation, charismatic leaders, financial arrest, and consequences for leaving, but LaNisa’s experience and research say time and society are the judge. \n\nSo anything can be a cult? These days, language is tricky, but there doesn\u0027t have to be an extreme and devastating end to make it a cult. \n\nI even had my eyes opened to the existence of a diet cult! Woah who knew Jesus said you had to be skinny? \n\nSpeaking of the variety of cults out there, it\u0027s important to note that no one wants to join a cult. Vulnerabilities, life circumstances, and different origins contribute to everyone\u0027s story. \n\nLike LaNisa says, even though black and brown experiences aren’t often talked about, “It’s not just white people shit.”. \n\nDuring our conversation, you can’t help but laugh. LaNisa wants to open the discussion of black and brown cult experiences with comedy.\n\nLaughter is a source of healing and by using comedy, LaNisa can heal AND teach\n\nTune in to the full episode for more about LaNisa’s story and be on the lookout for when comedy and Cult stories will collide with LaNisa’s podcast, Black and CULTivated, coming September 2024.\n\nWhat’s Inside:\n—What’s a cult? And can virtually anything be one?\n—Opening up the conversation about black and brown cult experiences.\n—Surviving the WorldWide Church of God while black.\n—What draws people into cults? \n\nMentioned In This Episode:\n—LaNisa Frederick (@lanisafrederick) • Instagram: https://www.instagram.com/lanisafrederick/\n—HASHTAG BOOKED (@hashtagbooked) • Instagram: https://www.instagram.com/hashtagbooked/\n—Black and CULTivated (@blackandcultivated) • Instagram: https://www.instagram.com/blackandcultivated/\n—Transform Your Body \u0026 Habits In 28 Days.  Guaranteed.: https://www.fitfeelsgood.com/transform\n—Fit Feels Good (@oonaghduncan) • Instagram photos: https://www.instagram.com/oonaghduncan/\n—info@fitfeelsgood.com",
      "release": "2024-06-04T10:00:37Z",
      "duration": "00:40:50",
      "explicit": false,
      "spotifyId": "0kbbAzPzN9hGMDMSLkKgce",
      "appleId": 1000657769930,
      "youTubeId": "b_KYWr6AYKs",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0kbbAzPzN9hGMDMSLkKgce",
        "apple": "https://podcasts.apple.com/podcast/growing-up-in-a-doomsday-cult-while-black-with/id1665757773?i=1000657769930",
        "youtube": "https://www.youtube.com/watch?v=b_KYWr6AYKs"
      }
    }
  ]
}