{
  "id": "c273915b-f57d-4daa-ac66-9a5c89dae187",
  "name": "Flag Down 2014",
  "youTubeChannelId": "UC2_H8y-Z2tiVvf9w32YRtRw",
  "episodes": [
    {
      "id": "933d01df-1e4b-456e-a4f3-4dd9aafa0fdb",
      "title": "John Sweeney Speaks at FLAG Down 2014",
      "description": "BBC journalist John Sweeney speaks on the last day of FLAG Down 2014, in Clearwater Florida. ",
      "release": "2014-05-31T02:06:18Z",
      "duration": "00:08:27",
      "explicit": false,
      "youTubeId": "yxaXRmTHu3Y",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yxaXRmTHu3Y"
      }
    },
    {
      "id": "acf49fa6-e585-4cb7-b529-8270263833ec",
      "title": "Jamie DeWolf - Flag Down 2014",
      "description": "Jamie is a \u0027slam poet\u0027 and the great grandson of the founder of Scientology, L. Ron Hubbard. To say that Jamie has things to say about his great grandfather would be an understatement. Jamie\u0027s grandfather, Ronald DeWolf, helped build Hubbard\u0027s Scientology empire in the 1950s but later denounced him as a \u0022fraud.\u0022\n\nJamie\u0027s mother and ex-girlfriend have been visited by Scientology agents asking about his references to Scientology in his poetry. As he put in his own words -- \u0022In high school, a psychiatrist asked me if I had a history of mental illness in my family. I had to say...YES!\u0022\n\nRecorded at Flag Down 2014 - Exposing the fraud and abuse of the Scientology cult",
      "release": "2014-05-15T23:07:16Z",
      "duration": "01:08:11",
      "explicit": false,
      "youTubeId": "KRUYESI3v3c",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KRUYESI3v3c"
      }
    },
    {
      "id": "fac1e891-14ad-44ae-84a8-9c487e26d272",
      "title": "Mark Bunker - Flag Down 2014",
      "description": "Recorded at Flag Down 2014 - Exposing the fraud and abuse of the Scientology cult",
      "release": "2014-05-15T14:50:46Z",
      "duration": "00:09:25",
      "explicit": false,
      "youTubeId": "ShwsFH_W3cM",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ShwsFH_W3cM"
      }
    },
    {
      "id": "d934c917-ee1d-4e34-9c2a-e97c96bab04c",
      "title": "Ishmael Bey - Flag Down 2014",
      "description": "Ishmael Bey is a community activist and an investigative researcher. Ishmael spent over a decade within the Nation of Islam moving up to the officer ranks to Assistant Minister. He was the first to bring national attention to the recent Church of Scientology\u0027s recent assimilation of the Nation of Islam.\n\nIshmael\u0027s work has been highlighted in national magazines along with his DVDs and radio interviews. Ishmael runs the \u0022Scientology Invasion of The Black Community\u0022 Facebook group, and is also working on a documentary concerning Scientology\u0027s relationship with African-Americans.\n\nRecorded at Flag Down 2014 - Exposing the fraud and abuse of the Scientology cult",
      "release": "2014-05-15T03:46:05Z",
      "duration": "00:39:00",
      "explicit": false,
      "youTubeId": "dirqSGfilmw",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dirqSGfilmw"
      }
    },
    {
      "id": "3c3bb349-418e-47a4-8124-1d9db21715ec",
      "title": "Marisa Sigmond - Flag Down 2014",
      "description": "Recorded at Flag Down 2014 - Exposing the fraud and abuse of the Scientology cult",
      "release": "2014-05-15T02:55:48Z",
      "duration": "00:26:46",
      "explicit": false,
      "youTubeId": "yFqNYbo_r4w",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yFqNYbo_r4w"
      }
    },
    {
      "id": "e4aa1a58-8f74-44f4-a90c-01ebc70ba47f",
      "title": "John Duignan - Flag Down 2014",
      "description": "\u0022Walking down a street in Stuttgart I never imagined I\u0027d lose the next 22 years of my life\u0022 says John.\n\nWhile in the Sea Organisation, John worked 16-hours days for between $8 and $24 dollars a week. When he left the organisation in 2006 at the age of 42, he described himself as feeling \u0022hopelessly suicidal\u0022 - a \u0022ghost\u0022 with no money, no qualifications or transferrable skills, no state entitlements and no way of relating to \u0022wogs\u0022 (non-Scientologists).\n\nJohn has written a book called \u0022The Complex\u0022, in which he describes his two decades within the organisation.\n\nFor the first time ever, a former high-ranking member of the Church of Scientology is lifting the lid on life inside the worlds fastest growing cult. The Complex reveals the true story behind the religion that has ensnared a who\u0027s who list of celebrities such as Tom Cruise and John Travolta, and convinced thousands of ordinary people to join up.\n\nDuignan describes how two years ago he staged a dramatic escape from the elite paramilitary group at the core of the Church, the Sea Organisation, and how he narrowly evaded pursuit by Scientologists from the Office of Special Affairs. He looks back on the 22 years he served in the Church s secret army and describes the hours of sleep deprivation, brain-washing and intense auditing or religious counselling he endured, as he was moulded into a soldier of Scientology. He talks about the money-making-machine at the heart of the Church, the Scientology goal to Clear the Planet and Get Ethics In , the training programmes, the Rehabilitation Project Force and the punishments meted out to anyone who transgresses, including children. We follow his journey through the Church and the painful investigation that leads to his eventual realisation that there is something very wrong at Scientology s core.\n\nThe beliefs of the Church of Scientology might sound like something from a science fiction book but The Complex reveals that the Church\u0027s growing power base is a shocking reality.\n\nhttp://www.ebay.com/usr/spedrofcuk\n\nRecorded at Flag Down 2014 - Exposing the fraud and abuse of the Scientology cult",
      "release": "2014-05-15T02:16:12Z",
      "duration": "00:27:39",
      "explicit": false,
      "youTubeId": "wtw9Au-OdjA",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wtw9Au-OdjA"
      }
    },
    {
      "id": "b9aa97c5-c2a0-4a1f-a2ff-04b9d0987901",
      "title": "Michael Leonard Tilse - Flag Down 2014",
      "description": "Michael Leonard Tilse joined the Scientology organisation in 1975 in San Francisco, and soon joined staff, and then the Sea Organization. He quit in 2003, and is now a strong critic willing to tell his story, and help others to wake up to Scientology\u0027s con.\n\nRecorded at Flag Down 2014 - Exposing the fraud and abuse of the Scientology cult.",
      "release": "2014-05-15T01:45:42Z",
      "duration": "00:54:39",
      "explicit": false,
      "youTubeId": "QepT0ZJmJik",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QepT0ZJmJik"
      }
    },
    {
      "id": "0856dc18-c048-4d27-9ab8-966dac4fe29a",
      "title": "Russell Miller - Flag Down 2014",
      "description": "Russell Miller is an award-winning journalist based in Britain whose work has appeared throughout the world. He is the author of 15 acclaimed books, including \u0022Bare-faced Messiah: The True Story of L. Ron Hubbard\u0022. He has only been sued once -- by the Church of Scientology. While researching the book in the United States, Miller was spied upon. His friends and business associates also received visits from Scientologists and private detectives. Attempts were made to frame him for the murder of a London private detective, the murder of American singer Dean Reed in East Berlin and a fire in an aircraft factory.\n\nRecorded at Flag Down 2014 - Exposing the fraud and abuse of the Scientology cult",
      "release": "2014-05-15T01:45:28Z",
      "duration": "00:46:25",
      "explicit": false,
      "youTubeId": "mTjyALJH8No",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mTjyALJH8No"
      }
    }
  ]
}