{
  "id": "2c623b1c-91f2-4feb-a1d0-220076c8781b",
  "name": "Flightless Bird",
  "spotifyId": "0TY5qJWU2bH9DSX9Gsx8VN",
  "appleId": 1763461729,
  "youTubeChannelId": "UCNVEPjKEtr2UdKXfWy9LZmQ",
  "episodes": [
    {
      "id": "73850323-5549-436f-bb26-223f81fee886",
      "title": "Best Friends: Animal Cult",
      "description": "In this week’s Flightless Bird, David looks at Best Friends, one of America’s largest animal rescue groups. Promoted by the likes of Mark Wahlberg, and with its own Nat Geo show “Dog Town”, David discovers Best Friends had its origins in a cult called “The Process Church Of The Final Judgement”. They wore a lot of black, had big big iron crosses around their necks, and liked keeping big dogs as pets - mainly German Shepards. Rumours spread they were involved in ritualistic murder - and by the time the Manson murders happened, prosecutors alleged there were links between Charles Manson and “The Process”. Under the leadership of “Mary Ann MacLean” the cult would undergo a series of changes, eventually ending up as - you guessed it - Best Friends. David meets a corner member who was born into the cult, and alleges what is now Best Friends’ Utah HQ was built - in part - by children. Support Flightless Bird on Patreon: www.patreon.com/flightlessbird Follow us on Instagram: www.instagram.com/flightlessbirdpod Email us your feedback: flightlessbirdchat@gmail.com Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2026-01-06T08:30:00Z",
      "duration": "01:02:20.5010000",
      "explicit": true,
      "spotifyId": "22Ry5XiNkWuFdgM2gSSiOH",
      "appleId": 1000743942900,
      "youTubeId": "QWvTXd1SY8w",
      "subjects": [
        "Process Church of the Final Judgement",
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22Ry5XiNkWuFdgM2gSSiOH",
        "apple": "https://podcasts.apple.com/podcast/best-friends-animal-cult/id1763461729?i=1000743942900",
        "youtube": "https://www.youtube.com/watch?v=QWvTXd1SY8w"
      }
    },
    {
      "id": "de8416ec-e7a1-4af8-91de-123f98b72379",
      "title": "Scientology",
      "description": "In this week’s Flightless Bird, David and Rob explore Scientology in LA and beyond. David goes on a mini tour of LA Scientology, attempting to visit the Museum of Psychology, Big Blue and the Celebrity Centre to varying degrees of success. He looks at how this church/cult recruits members, before meeting someone who joined and spent around $50,000 on courses before leaving. He then meets Mike Brown, someone raised in Scientology, eventually joining the Sea Org before managing to escape. He takes David through his experience and his own theories about the church today in 2025. Email us: flightlessbirdchat@gmail.com Live show tickets for Denver on July 3: http://bit.ly/lostkiwiDEN Live show tickets for Chicago on July 10: http://bit.ly/lostkiwiCHI Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-06-10T07:30:00Z",
      "duration": "01:37:33.8860000",
      "explicit": true,
      "spotifyId": "6SA8kzEPTDIXVg79FmvmoT",
      "appleId": 1000712216446,
      "youTubeId": "OlesXSxOHR4",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6SA8kzEPTDIXVg79FmvmoT",
        "apple": "https://podcasts.apple.com/podcast/scientology/id1763461729?i=1000712216446",
        "youtube": "https://www.youtube.com/watch?v=OlesXSxOHR4"
      }
    }
  ]
}