{
  "_ts": 0,
  "id": "967d2828-1548-470c-98c7-88874a3feac1",
  "name": "Flipping Tables",
  "spotifyId": "0UeGGKWCn2BeJ2ah4RZ6hj",
  "appleId": 1793373858,
  "episodes": [
    {
      "id": "dd21f600-8a27-47ac-b7f8-29c3786adea4",
      "title": "20. Escaping a Cult w/ Dr. Steven Hassan",
      "description": "How can someone so intelligent end up with a cult like mindset? Someone who otherwise seems to have their life together? Seems to be so grounded? Anyone can fall into a cult, and even those who are deeply indoctrinated can get back out. Dr. Steven Hassan is a leading expert in cults, mind control, and undue influence, best known for transforming his own traumatic experience in a high-control group into a lifelong mission to help others recover from coercive persuasion. Born in Queens, New York, Hassan was raised in a Jewish family and, at age 19, was recruited into the Unification Church (commonly known as the “Moonies”). He quickly became a zealous member, working long hours and cutting ties with family and friends. After a serious car accident in 1976, his family organized a deprogramming intervention, which helped him leave the group and sparked his determination to understand how such manipulation occurs. Hassan earned a Master’s in counseling psychology from Cambridge College and later completed a Ph.D. from Fielding Graduate University. Over the following decades, he dedicated himself to developing non-coercive methods of intervention, eventually creating what he calls the Strategic Interactive Approach. He also founded the Freedom of Mind Resource Center, which provides education, counseling, and expert support for individuals and families affected by cults, extremist groups, human trafficking, and political radicalization. Hassan is widely recognized for his development of the BITE Model (Behavior, Information, Thought, and Emotional control), which helps identify the key mechanisms by which authoritarian groups manipulate people. He also created the Influence Continuum, a framework for understanding the difference between healthy and destructive influence. His published works—including Combating Cult Mind Control, Releasing the Bonds, Freedom of Mind, and The Cult of Trump—have become foundational texts for understanding psychological manipulation and authoritarian control, not just in religious cults but in political movements and abusive relationships as well. He has helped thousands reclaim their autonomy and continues to shape the conversation on cult dynamics, political extremism, and mental freedom in the digital age. There\u0027s always hope that even someone who was raised in a cult or lost their way in one can find their way back out.",
      "release": "2025-06-18T11:21:47Z",
      "duration": "01:31:09.5760000",
      "explicit": false,
      "spotifyId": "3KozpznH3dIhPeRWwcS2nR",
      "appleId": 1000713424109,
      "subjects": [
        "Cult-Expert",
        "Unification Church",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3KozpznH3dIhPeRWwcS2nR",
        "apple": "https://podcasts.apple.com/podcast/20-escaping-a-cult-w-dr-steven-hassan/id1793373858?i=1000713424109"
      }
    },
    {
      "id": "7aa59b70-63ef-4925-9ba2-e12723715aa7",
      "title": "16. Children of God Sex Cult",
      "description": "In a world of cult like beliefs, propaganda, and manipulation its important to become experts on how these tactics work so that we can avoid them and so that we understand whats happening in the world around us. A little true crime break from the norm but an important discussion we have to continue to return to. HOW DO PEOPLE BELIEVE THIS? By using tactics we see everywhere. The Children of God, founded in 1968 by David Berg, was a sex cult that disguised itself as a Christian missionary movement. Berg, who called himself “Moses David,” claimed divine authority and used it to manipulate and control his followers through apocalyptic teachings and a series of writings known as “Mo Letters.” Under his leadership, the group promoted sexual “freedom” that included disturbing practices like “flirty fishing,” where women were encouraged to use sex to recruit new members. Even more sinister, Berg endorsed and participated in the sexual abuse of children, normalizing pedophilia within the group’s teachings. He lived in hiding for much of his life to evade legal consequences, but continued to exert control over the group until his death in 1994. Berg’s legacy is one of extreme psychological, spiritual, and sexual abuse, with many former members coming forward to expose the deep and lasting trauma they endured under his cult leadership. For ad free episodes with early release and exclusive content please become an accomplice for $1 a week www.patreon.com/montemader Beginning in June 10% of patreon will be going to charities starting with project renewal\u0027s Marsha House in NYC",
      "release": "2025-05-21T11:53:34Z",
      "duration": "01:05:51.1230000",
      "explicit": false,
      "spotifyId": "1zJbZbxVLSlqLKTJ9rsooA",
      "appleId": 1000709260427,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zJbZbxVLSlqLKTJ9rsooA",
        "apple": "https://podcasts.apple.com/podcast/16-children-of-god-sex-cult/id1793373858?i=1000709260427"
      }
    }
  ]
}