{
  "_ts": 0,
  "id": "967d2828-1548-470c-98c7-88874a3feac1",
  "name": "Flipping Tables",
  "spotifyId": "0UeGGKWCn2BeJ2ah4RZ6hj",
  "appleId": 1793373858,
  "episodes": [
    {
      "id": "7aa59b70-63ef-4925-9ba2-e12723715aa7",
      "title": "16. Children of God Sex Cult",
      "description": "In a world of cult like beliefs, propaganda, and manipulation its important to become experts on how these tactics work so that we can avoid them and so that we understand whats happening in the world around us. A little true crime break from the norm but an important discussion we have to continue to return to. HOW DO PEOPLE BELIEVE THIS? By using tactics we see everywhere. The Children of God, founded in 1968 by David Berg, was a sex cult that disguised itself as a Christian missionary movement. Berg, who called himself “Moses David,” claimed divine authority and used it to manipulate and control his followers through apocalyptic teachings and a series of writings known as “Mo Letters.” Under his leadership, the group promoted sexual “freedom” that included disturbing practices like “flirty fishing,” where women were encouraged to use sex to recruit new members. Even more sinister, Berg endorsed and participated in the sexual abuse of children, normalizing pedophilia within the group’s teachings. He lived in hiding for much of his life to evade legal consequences, but continued to exert control over the group until his death in 1994. Berg’s legacy is one of extreme psychological, spiritual, and sexual abuse, with many former members coming forward to expose the deep and lasting trauma they endured under his cult leadership. For ad free episodes with early release and exclusive content please become an accomplice for $1 a week www.patreon.com/montemader Beginning in June 10% of patreon will be going to charities starting with project renewal\u0027s Marsha House in NYC",
      "release": "2025-05-21T11:53:34Z",
      "duration": "01:05:51.1230000",
      "explicit": false,
      "spotifyId": "1zJbZbxVLSlqLKTJ9rsooA",
      "appleId": 1000709260427,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zJbZbxVLSlqLKTJ9rsooA",
        "apple": "https://podcasts.apple.com/podcast/16-children-of-god-sex-cult/id1793373858?i=1000709260427"
      }
    }
  ]
}