{
  "_ts": 0,
  "id": "e0af60f0-2449-494c-a5a0-875077c176d3",
  "name": "Flow Rising",
  "spotifyId": "0fd9z0fWnMUaxXWK0htOLd",
  "appleId": 1598969823,
  "youTubeChannelId": "UCICgeiI2ThYB1kFqBtdqQGw",
  "episodes": [
    {
      "id": "2727a3a5-e17e-4720-89a2-886cbf9af1ca",
      "title": "A Cult Survivor’s Lessons on Faith, Spirituality, \u0026Healing-with Martha Kartaoui",
      "description": "In this episode, Martha Kartaoui and I discuss her healing journey from a traumatic past in a religious cult. Martha shares the importance of sharing stories and the power of faith and spirituality in the healing process, and emphasizes the need to be gentle with oneself and to embrace discomfort as part of the healing journey. To connect with Martha, tap one of the links below: Linkedin: www.linkedin.com/in/martha-kartaoui-a7840b291 Facebook: https://www.facebook.com/martha.kartaoui?mibextid=ZbWKwL Instagram: https://instagram.com/marthakartaoui?igshid=OGQ5ZDc2ODk2ZA== Martha Kartaoui is a highly accomplished Certified Life and Health Coach, as well as a respected Spiritual Mentor. She\u0027s the owner of PIC Wellness, LLC. With a remarkable personal journey as a survivor of a religious cult, Martha has fearlessly navigated her own uncharted healing journey and transformed her trauma into triumph. Through her own healing and growth, she has discovered a deep passion for empowering others to do the same. With her expertise and compassionate guidance, Martha is dedicated to assisting individuals on their path to triumph over adversity and unlocking their God given truest and highest potential. Her unique blend of professional training, personal experience, and spiritual wisdom enables her to walk alongside and support her clients profound transformations. Martha Kartaoui is a beacon of hope and inspiration, offering invaluable accountability, motivation and support to those seeking to reclaim their lives in order to thrive in their own journey towards self-discovery and divine fulfillment. Martha is a published author. She is part of the Global Resilience Project vol. 2, and has written an anthology piece for the Breaking the Silence: Voices of Survivors collection. ________________ If you or someone you know need help with a domestic violence situation contact the national domestic violence hotline at 800-799-7233 or online at https://www.thehotline.org/?utm_source=google\u0026utm_medium=organic\u0026utm_campaign=domestic_violence",
      "release": "2024-01-28T16:09:03Z",
      "duration": "00:45:10.8130000",
      "explicit": true,
      "spotifyId": "49QhjbOZdiYoXEY8pN5jpN",
      "appleId": 1000643267596,
      "youTubeId": "3YtAgk0R30E",
      "subjects": [
        "Samanta Roy Institute of Science and Technology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/49QhjbOZdiYoXEY8pN5jpN",
        "apple": "https://podcasts.apple.com/podcast/a-cult-survivors-lessons-on-faith-spirituality/id1598969823?i=1000643267596",
        "youtube": "https://www.youtube.com/watch?v=3YtAgk0R30E"
      }
    }
  ]
}