{
  "id": "65ab32d6-7215-4dc1-a89b-be6dd34ac246",
  "name": "Flux Podcasts",
  "spotifyId": "14DyhBEQzkTK0UC27zh9aQ",
  "appleId": 1486920059,
  "youTubeChannelId": "UCkmucd07dnIOY9Gf2HZ5Y5w",
  "episodes": [
    {
      "id": "63bb9042-809c-4e7c-952d-0854360c2556",
      "title": "Robert Kennedy’s MAHA cult is making America sicker",
      "description": "Episode Summary  \nAmid the constant contradictions of Donald Trump’s second administration, some of his policies have been remarkably consistent, especially those out of the Department of Health and Human Services, where Secretary Robert Kennedy Junior has been ripping up decades of scientific consensus on many areas, including vaccines, diet recommendations, and transgender care. \nBut as a lifelong politician and lawyer with no actual experience as a doctor or medical administrator, he has needed to develop a staff of people with at least some medical experience in order to tear and destroy. What kind of doctor would want to work for a parasite-ridden lawyer who brags about eating roadkill, seems to not understand how viruses work, and advocates eating lots of saturated fats? The answer is: almost none of them. But, unfortunately, there are always a few people out there with enough personal grudges and crank beliefs to do the job.\nOur guest on today’s program, Jonathan Howard, knows all about the new medical establishment after having seen firsthand how they promoted anti-vaccine lies and dangerously underestimated the effects of Covid-19. We had him on the program in 2022 to discuss his first book, We Want Them Infected, and he’s out with a new one examining the policy insanity of Kennedy and his underlings called Everyone Else Is Lying to You.\nThe video of our conversation is available, the transcript is below. Because of its length, some podcast apps and email programs may truncate it. Access the episode page to get the full text. You can subscribe to Theory of Change and other Flux podcasts on Apple Podcasts, Spotify, Amazon Podcasts, YouTube, Patreon, Substack, and elsewhere.\n\nRelated Content\n--Covid contrarians want you to forget that they were much more wrong than the scientific consensus\n--How 1970s tobacco companies pioneered the deceitful marketing strategies used by today’s conspiracy peddlers\n--Why the “naturalistic fallacy” is the basis of so much anti-science thinking\n--Marianne Williamson’s ineffective self-help politics\n--How “post left” grifters use contrarianism and know-nothing socialist rhetoric to push people to the far right\n\nAudio Chapters\n00:00 — Introduction\n07:36 — Robert Kennedy Jr. and his allies are the medical establishment, and they are responsible for what happens\n16:26 — The “Great Barrington Declaration” was initiated by political activists, not scientistsc\n20:48 — After claiming to oppose censorship, the Trumpian medical establishment is conducting it at a massive scale\n25:57 — Anti-vax activists have had years to do their own studies, but they have basically nothing\n33:34 — The cowardice of Republicans like Bill Cassidy who know better\n37:54 — Other people in the MAHA conspiracist movement\n44:41 — MAHA figures have more conflicts of interest than the scientists they hate\n51:24 — The looming conflict between polluters and anti-vax Republicans\n01:03:20 — John Ioannidis and the perils of medical contrarianism\n01:08:08 — Why atheist activists teamed up with far-right Christians who hate medical science\n01:18:44 — Conclusion\n\nAudio Transcript\nThe following is a machine-generated transcript of the audio that has not been proofed. It is provided for convenience purposes only.\nMATTHEW SHEFFIELD: So, I literally just released an episode catching up with a previous guest who had been on the show who had marked a lot of the negative trends that we are now seeing. And unfortunately I’m in the same spot with you, my friend, that, there’s a lot of bad things that have happened. And there are so many things that I do wanna kind of summarize of them so that we can all keep track of what’s been going on for the conversation.\nAnd as we’re talking today on January 30th, the most recent kind of news headline of this awful medical establishment that is in installed itself thanks to Trump, is that, the measles in the United States are, they are what’s being made great, it looks like.\nJONATHAN HOWARD: Yeah, no, measles is spreading out of control.\nThere’s the largest outbreak in 25 or 30 year, probably 26 years, actually in, South Carolina right now. Measles seems to be. Popping up in multiple other states as well. This is of course, [00:04:00] following a very large outbreak in Texas in the spring of 2025 that killed two children, and another adult.\nSo these were the first measles deaths in the country in about 10 or 15 years, and the first children to die, I think since 1991. and our current medical establishment is trying to control it with vitamin a cod liver oil, and by spreading disinformation about the measles vaccine as was eminently predictable.\nSHEFFIELD: It was. And what we’re really seeing, I think, consistently is that, that these guys are kind of across the board are, they have these old fashioned medical viewpoints. Like that’s what really what they’re doing. And they have these ideas that really have been debunked for about 80 years roughly. but they want to try again on everything seems like.\nHOWARD: Yeah, I was gonna say, it depends how old fashioned you’re talking about because, the measles vaccine has been around since 1963 and, probably all current members of our medical establishment, except for maybe RFK would say that they think the MMR is a very important vaccine, but if they actually felt that way, they would not be working for RFK, who has spread more misinformation about the measles vaccine and all vaccines and probably any other American in the past 20 years.\nAnd what we are seeing is that. Disinformation about the COVID vaccine is very predictably bleeding into all vaccines. So all vaccines are kind of connected in, in that if you trust the doctors who recommend them people are more likely to get the measles vaccine if they’re also told accurate information about the COVID vaccine, which they weren’t.\nSHEFFIELD: Yeah. And they weren’t. And this is part of when, if you look back at the history that there has always been suspicion about vaccines. People have always had it since they were first [00:06:00] invented. So it’s, I guess it’s understandable even though we don’t agree with those viewpoints for people to, it does seem on the face of it on the surface that a little bit counterintuitive.\nYou mean you’re telling me that. Injecting diseases into myself is good for me? And it’s always been a challenge, right?\nHOWARD: Yeah. The history of the anti-vaccine movement is as old as vaccines themselves. Even preceding Edward Jenner, as far as I know, the first known vaccinator was an English farmer by the name of Benjamin Esti, who vaccinated his children against smallpox in the 1770s or something like that.\nAnd everyone can go read about him on Wikipedia. And he faced great backlash from his community. And then when a smallpox epidemic ripped through the community, his children were spared. But all, everything that we’re hearing about vaccines. Now, all I should say, all anti-vaccine disinformation, none of this is new.\nIt, all goes back to this idea that vaccines are in pure in some way, whereas catching a virus is natural and therefore there’s no problem with it. Or that vaccines have never been properly tested or that they are just being given by pharmaceutical companies to pad their bottom line. So no, nothing that we’re hearing now is new.\nWhat’s changed is who it’s coming from, top government officials and top doctors who came from Harvard, Stanford, UCSF and Johns Hopkins. That’s what’s new.\nRobert Kennedy Jr. and his allies are the medical establishment, and they are responsible for what happens\nSHEFFIELD: It is. And they still constantly talk about the medical establishment and all that, but they are the medical establishment.\nThey are the ones with the power. They are the ones with the money, and they are the ones who are responsible for the deaths of these children and the other people that will die.\nHOWARD: Absolutely. So our current [00:08:00] medical establishment, and I love that you called them that way, they, rose to power kind of portraying themselves as these outsiders who would have controlled COVID perfectly.\nSo they became famous not for their on the ground accomplishments, but because of their social media content in which they said they would have protected the vulnerable, they would have kept schools open, or the fact that they proposed things and they argued for things and they called for things. But now that they are in power and have been given the opportunity to prove their re real world competency they’re failing.\nAnd it is, of course not just measles. Last year we had 28,000 cases of whooping cough in this country. We had a record number, not a record, but a very high number of pediatric flu death. And of course not all of this can be laid on the hands of our current medical establishment who had just been in power for a few weeks at this time.\nBut they’re showing that they are totally inept at controlling viruses, and I shouldn’t say even inept, indifferent to controlling viruses. They’re not making any or bacteria in the case of whooping cough, but they’re not making any attempt to do that. And they are improving incompetent leaders at the agencies that they run, the NIH, the FDA, and to some degree the CDC as well.\nAnd I say only to, to some degree because I don’t think the current director is a doctor, but, they’re proving inept leaders who are loathed and mocked by the people who work for them.\nSHEFFIELD: Yeah. Well, and you talked about this idea that it seems like a lot of them really actually do not want to do anything to mitigate disease.\nAnd that was the title of your previous book that We Want Them Infected. I mean, so what is this? I mean, I think the idea that doctors would want people to be infected with viruses, it seems so absurd that it’s almost [00:10:00] unbelievable that a doctor would say such a thing, bu",
      "release": "2026-02-13T22:00:15Z",
      "duration": "01:26:05.4980000",
      "explicit": true,
      "spotifyId": "0dQd8UyoHPmAG7RY6Jeffm",
      "appleId": 1000749669897,
      "youTubeId": "4n6MM6dGSCQ",
      "subjects": [
        "_America",
        "Qanon",
        "Political Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dQd8UyoHPmAG7RY6Jeffm",
        "apple": "https://podcasts.apple.com/podcast/robert-kennedys-maha-cult-is-making-america-sicker/id1486920059?i=1000749669897",
        "youtube": "https://www.youtube.com/watch?v=4n6MM6dGSCQ"
      }
    },
    {
      "id": "ef462613-800d-4f61-993f-f9395aec019d",
      "title": "Kara Cooney on demystifying ancient Egyptians, Mormonism, the Hyksos, and societal collapse",
      "description": "I don\u0027t get to do a lot of ancient history episodes on this show, but I always love it when I get the chance, and that\u0027s because history is a mirror of the present.\n\nNot because we judge or even fully understand the people who lived in ancient times, but because they were humans just like we are now. Because they have the same challenges that we do. They just expressed them in different ways.\n\nAnd oftentimes we have a lot that we can learn from them. And that certainly is the case with regard to ancient Egypt, which seems to be as far as we know, the oldest civilization of humans who had created something and began making records of what they were doing.\n\nBecause the fact is that ancient Egypt has always had a magnetic pull, not just from people in our time, but even in ancient times, people were very interested in what the ancient Egyptians were doing, and with good reason. \n\nI\u0027m pleased to be joined on this episode by Kara Cooney. She is a professor of Egyptology at the University of California Los Angeles, and she\u0027s written a number of interesting books on Egypt, and we\u0027ll be talking about some of the themes in one of these books in particular called \u0022The Good Kings: Absolute Power in Ancient Egypt and the Modern World.\u0022 She\u0027s also the host of the podcast \u0022Afterlives of Ancient Egypt.\u0022\n\nCHAPTERS\n00:00 -- Introduction\n05:10 -- Ancient Egyptians were regular people, even though it\u0027s easy to forget\n14:57 -- A brief overview of ancient Egyptian history\n21:44 -- The Exodus narrative and historical evidence\n30:10 -- The fall of civilizations and modern parallels\n34:04 -- Mormonism\u0027s Book of Abraham and Egyptian lore\n41:07 -- Religious neo-orthodoxy and Susan Sontag\u0027s \u0022Against Interpretation\u0022\n47:45 -- Akhenaten\u0027s religious revolution\n55:10 -- The Ma\u0027at goddess and wisdom tradition\n01:05:29 -- Universal human understanding of fairness\n01:09:18 -- Conclusion\n\n\nMEMBERSHIP BENEFITS\nThis is a free episode of Theory of Change, but in order to keep the show sustainable, the full audio, video, and transcript for some episodes are available to subscribers only. The deep conversations we bring you about politics, religion, technology, and media take great time and care to produce. Your subscriptions make Theory of Change possible and we’re very grateful for your help.\n\nPlease join today to get full access!\n\nSubstack:\nhttps://theoryofchange.show/\n\nPatreon:\nhttps://www.patreon.com/discoverflux\n\nIf you would like to support the show but don’t want to subscribe, you can also send one-time donations via PayPal:\nhttps://www.paypal.com/paypalme/theorychange\n\nIf you\u0027re not able to support financially, please help us by subscribing and/or leaving a nice review on Apple Podcasts. Doing this helps other people find Theory of Change and our great guests.\n\nhttps://podcasts.apple.com/us/podcast/theory-of-change-podcast/id1486920059\n\n\nGUEST LINKS\nWebsite: https://karacooney.squarespace.com\nPodcast: https://ancientnow.substack.com/podcast\nDiscovery Channel Miniseries: http://www.amazon.com/gp/product/B007TT8BHO/\n\n\nABOUT THE SHOW\nTheory of Change is hosted by Matthew Sheffield about larger trends and intersections of politics, religion, media, and technology. It\u0027s part of the Flux Community, a new content network of podcasters and writers. Please visit us at flux.community to learn more and to tell us about what you\u0027re doing. We\u0027re constantly growing and learning from the great people we meet.\n\nGet access to all the Flux podcasts visit: https://linktr.ee/discoverflux\n\nTheory of Change on Twitter: https://twitter.com/TheoryChange\n\nTheory of Change on YouTube: https://www.youtube.com/@theoryofchangepodcast\n\nMatthew Sheffield on Mastodon: https://mastodon.social/@mattsheffield\n\nMatthew Sheffield on Bluesky: https://bsky.app/profile/matthew.flux.community\n\nMatthew Sheffield on Twitter: https://twitter.com/mattsheffield",
      "release": "2025-09-19T06:40:31Z",
      "duration": "02:23:10",
      "explicit": false,
      "spotifyId": "1qsrBMGG2T6eZK5oBe9GrY",
      "appleId": 1000727472109,
      "youTubeId": "aCGG1sL8BR4",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1qsrBMGG2T6eZK5oBe9GrY",
        "apple": "https://podcasts.apple.com/podcast/why-everyone-wants-a-piece-of-ancient-egypt/id1486920059?i=1000727472109",
        "youtube": "https://www.youtube.com/watch?v=aCGG1sL8BR4"
      }
    }
  ]
}