{
  "id": "d2f663e9-2348-48a5-b710-d29b3327dde1",
  "name": "Focus On Your Own Family",
  "spotifyId": "46CvmHPy02pyMX1FLS0u4f",
  "appleId": 1696207861,
  "episodes": [
    {
      "id": "646683fa-0d1d-4b95-bac4-a583210922f5",
      "title": "Lindsey Williams- The Woman They Wanted book review",
      "description": "Support the podcast - join the PATREON Please welcome back Lindsey Williams! Lindsey is a survivor of the Institute of Basic Life Principals (IBLP) Bill Gothard\u0027s Cult. She was featured on Shiny Happy People- a documentary about the Duggar cult. Lindsey and I sit down to discuss Shannon Harris\u0027s book \u0022The Woman They Wanted.\u0022 This book is incredible- if you have not read it, I encourage you to. Lindsey\u0027s socials Shannon\u0027s book For those that want to be on the podcast make sure to reach out—link in the show notes. Pre-roll music is composed by Joanna Whaley For those who want to subscribe to my Patreon please look at the show notes for more information Music composed by Joanna Whaley Support the show This podcast contains the personal accounts, thoughts, and opinions of guests. Focus on Your Own Family podcast will not be held liable for the personal feelings, and accounts of their guests. Focus on your Own family podcast holds itself to the highest level of integrity, and the reporting that we do in this podcast to a very high standard. We believe in showing evidence, and letting people draw their conclusions from that evidence. If you would like to be a guest on this podcast please email me. Your life matters, National help numbers SHOW YOUR SUPPORT MY PATREON: Please reach out: focusonyourownfamilypodcast@gmail.com FOLLOW ME ON SOCIALS LINKTREE INTRO AND OUTRO MUSIC Scott Buckley \u0022Omega\u0022 COMMERCIAL MUSIC Composed by Joanna Whaley",
      "release": "2024-04-05T15:00:00Z",
      "duration": "01:07:22.2660000",
      "explicit": true,
      "spotifyId": "3bqjl4eTjU4ZJMEFGP18F7",
      "appleId": 1000651556808,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3bqjl4eTjU4ZJMEFGP18F7",
        "apple": "https://podcasts.apple.com/podcast/lindsey-williams-the-woman-they-wanted-book-review/id1696207861?i=1000651556808"
      }
    }
  ]
}