{
  "id": "167c9c7a-94d8-4af8-bb6a-e1ea397ae179",
  "name": "Foggy Melson",
  "youTubeChannelId": "UCqFK50VbABTGJzwxpt8mtBA",
  "episodes": [
    {
      "id": "f105ef46-46b2-416c-8ea4-8db409bc24d2",
      "title": "Marshall Applewhite Identified as Leader of Heaven\u0027s Gate Cult (March 28, 1997)",
      "description": "MARSHALL APPLEWHITE (DOE) WAS THE LEADER OF THE HEAVEN\u0027S GATE CULT; APPLEWHITE\u0027S JOURNEY BEGAN WHEN HE HAD A BRUSH WITH DEATH AND HIS NURSE TOLD HIM HE HAD A CHANCE FOR LIFE AGAIN AND INTRODUCED HIM TO THE HEAVEN\u0027S GATE PHILOSOPHY AND THEY BOTH CO-FOUNDED THE PHILOSOPHY FROM THERE.",
      "release": "2023-08-27T14:36:23Z",
      "duration": "00:00:52",
      "explicit": false,
      "youTubeId": "MSeLdfRi0FU",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MSeLdfRi0FU"
      }
    },
    {
      "id": "661d777d-d7bf-4087-b1ab-36268ea7124e",
      "title": "Yahweh ben Yahweh \u0026 Nation of Yahweh Members Renovate Liberty City Apartments (July 9, 1987)",
      "description": "The Nation of Yahweh is predominantly a Black Hebrew Israelite religious movement which was founded in 1979 in Miami by Hulon Mitchell Jr., who went by the name Yahweh ben Yahweh. (Yahweh is one of the proper names of the Abrahamic god, so Yahweh ben Yahweh essentially means \u0022God, son of God\u0022.) Its goal is to move African Americans, who it believes are the original Israelites, to Israel. The group accepts Yahweh ben Yahweh as the Son of God. In this way, its beliefs are unique and distinct from those of other Black Hebrew Israelite groups.[1][2]\n\nIts founder, Hulon Mitchell, was indicted on federal racketeering and extortion charges and convicted of conspiracy to commit murder.[3] The group is classified as a black supremacist cult by the Southern Poverty Law Center[4] and as a cult by The Miami Herald.[5]\n\nThe organization describes itself as follows: \u0022In 1979, Yahweh Ben Yahweh came to Miami and became the Spiritual Leader and Founder of The Nation of Yahweh. Although he took a vow of poverty, in seven years he guided The Nation to amass a $250,000,000 empire. Under his direction, The Nation has grown to encompass disciples, followers, and supporters in over 1,300 cities within the U.S. and 16 other countries.\u0022[6][better source needed]\n\nCriticism\nThe SPLC has criticized the beliefs of the Nation of Yahweh as racist, stating that the group believes that Black people are the true Israelites and whites hold \u0022wicked powers\u0022. The Nation of Yahweh has ceased to openly condemn white people as \u0022white devils\u0022 as it once did.[7] The SPLC also claims that the group believes that Yahweh ben Yahweh had a Messianic mission to vanquish whites and that it held views similar to those of the Christian Identity movement, which believes that \u0022Aryans\u0022 are the true Israelites and non-whites are devils. The SPLC quotes Tom Metzger of White Aryan Resistance as saying, \u0022[Groups like the Nation of Yahweh are] the Black counterpart of us.\u0022 By 2007, the Nation of Yahweh had eliminated calls for violence and toned down its anti-white rhetoric, but remained Black supremacist and antisemitic in its ideology.[8]\n\nThe Anti-Defamation League has criticized the Nation of Yahweh and some other Black Hebrew sects, stating, \u0022In 1987, ADL reported on Black sects holding these views [arguing that today\u0027s Jews are not the \u0022chosen people\u0022 described in the Bible, ... instead that the label applies to people of African descent], such as the Yahwehs and the Original African Hebrew Israelite Nation of Jerusalem.\u0022[9]\n\nYahweh ben Yahweh was known to control the clothing, food, and sex lives of group members and became intimately involved with many female followers. \u0022We may be rabbis and nuns here,\u0022 he told The New York Times, \u0022but we don\u0027t believe in celibacy.\u0022[10]\n\nMost followers were men; the main elders were men as well. Yahweh ben Yahweh\u0027s wife, Linda Gaines[11] (Judith Israel) became a significant helper and leader. Gaines collected money, handled finances and the possessions of full-time workers. She had a bodyguard and was high up in the following.[12]\n\nDespite the conviction, incarceration (until 2001), and court-mandated isolation from Nation of Yawweh, of its leader Yahweh ben Yahweh, and his death in 2007, the Nation of Yahweh is still active, and still considers Yahweh ben Yahweh to be a messiah. Its website claims to have abandoned their past racism and the leader\u0027s daughter has apparently stated that all people are children of God.[citation needed] An attorney who is also a member of the group, Wendelyn Rush, insists that its current war with the U.S. government is a non-violent verbal battle. The group is reportedly spread throughout the US and no longer concentrated in one location (formerly Miami-Dade County, Florida, USA). It claims that its present literature downplays and has nearly erased all past racism, and the past criminal behaviour of its leader and followers.\n\nThe Nation of Yahweh is a purchaser of national infomercial time. The Nation airs a weekly half-hour program on stations across the United States, usually on weekends during little-watched early morning hours, that combines Bible studies with discussions about the Nation.[citation needed]\n\nThe Yahweh ben Yahweh group appeared in the news again in 2012 after \u0022Michael the Black Man\u0022 (real name Maurice Woodside), a former member of the group who is now a conservative activist, was invited to speak at a rally for Rick Santorum\u0027s presidential campaign during which he said that Democrats were akin to Nazis.[13] Woodside has since become a vocal supporter of Donald Trump, but continues to defend Yahweh ben Yahweh and the Nation\u0027s beliefs.[14]\n\nSee also\nRobert Rozier, murderer associated with the Nation of Yahweh",
      "release": "2023-04-23T11:23:30Z",
      "duration": "00:01:42",
      "explicit": false,
      "youTubeId": "C1J0S4oqxCk",
      "subjects": [
        "Nation of Yahweh",
        "Black Hebrew Israelites"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=C1J0S4oqxCk"
      }
    },
    {
      "id": "2317872c-bc7b-494c-b63d-f7b6dfb12e9a",
      "title": "Yahweh ben Yahweh Interview in Miami, Fla. (May 28, 1987)",
      "release": "2023-04-23T10:55:05Z",
      "duration": "00:01:42",
      "explicit": false,
      "youTubeId": "vGVtiI6qNro",
      "subjects": [
        "Black Hebrew Israelites",
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vGVtiI6qNro"
      }
    },
    {
      "id": "c3e7c6c1-2398-404e-8d69-d4313282e2de",
      "title": "Shots Fired as Nation of Yahweh Members Evict Tenants from Apartment Complex (October 29, 1986)",
      "description": "YAHWEHS - LIVE EYE, MINTON REPORTS SHOTS FIRED",
      "release": "2023-04-22T16:28:47Z",
      "duration": "00:01:31",
      "explicit": false,
      "youTubeId": "RuXIRUw9v_4",
      "subjects": [
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RuXIRUw9v_4"
      }
    },
    {
      "id": "4f6a0709-d79f-4485-b855-4c0cc13bf089",
      "title": "The Trial of Nation of Yahweh Member Robert Rosier (Neariah Israel) for Murder (December 2, 1986)",
      "description": "SECT MEMBER HELD IN KILLING POLICE CHARGE YAHWEH WITH 1 OF 2 \nOPA-LOCKA -- Terrified tenants of a crime-plagued apartment building taken over by the controversial Yahweh religious sect were evacuated by city officials Thursday after two men who had criticized the cult were shot to death and a sect member was charged with murder.\n\nShortly after the shootings at the complex, police found a suspect hiding in nearby bushes. They identified him as Yahweh member Robert Rosier, 33, and said he also was known as Neariah Israel.\n\nPolice identified the victims as Anthony Brown, 28, and Rudolph Broussard, 37. Rosier was charged with first-degree murder in one of the slayings, but authorities did not say which victim he is accused of killing.\n\nBrown pleaded with his assailant before he was shot, witnesses said.\n\n\u0022He said, \u0027Please don\u0027t shoot me, please don\u0027t shoot me.\u0027 And he shot him, twice in the head, just like that,\u0022 said one unidentified witness.\n\nThe shootings came after a tense two-day standoff between the Yahwehs and tenants ordered by the group to move out of a rundown apartment complex.\n\nYahwehs bought the property on Monday, contending they would turn the drug- infested complex into a respectable place to live by forcing tenants to leave.\n\nThe victims, tenants in the buildings, had criticized the Yahweh black religious cult on television or had been quoted in newspapers on their opposition to the Yahwehs\u0027 taking over the apartment complex.\n\nBrown was shown on television saying, \u0022I\u0027m going to stay here until I get an eviction notice. I don\u0027t care what they say. They ain\u0027t going in, it\u0027s as simple as that.\u0022\n\nBroussard told family and friends the Yahwehs had entered his apartment without permission and removed furnishings.\n\n\u0022They broke into his apartment and took a freezer out,\u0022 his sister, Celine Broussard, said as she stood weeping near the shooting site. \u0022Then my brother tried to get the freezer back. They (Yahwehs) were just throwing people out.\u0022\n\nDetectives said Israel was wearing a white turban at the time of his arrest. Yahwehs all use the surname \u0022Israel\u0022 and wear white robes and turbans.\n\n\u0022We have been falsely accused,\u0022 said Abishag Israel, a group spokeswoman.\n\nCity workers began moving frightened residents out of the five pastel- colored buildings shortly before dawn Thursday.\n\n\u0022We had to cool the situation down,\u0022 Mayor John Riley said.\n\nScared residents, including the slain men\u0027s families, would not reveal their names when they talked with reporters after the killings.\n\nThey said the two men killed had confronted sect members who entered an apartment and carried out a refrigerator. It belonged to Broussard, who, with Brown, retrieved it from the Yahwehs in a tense confrontation, the tenants said.\n\nThe shootings occurred after about eight men in two cars began shouting at Broussard and Brown, who were sitting outside the building at 1 a.m. An argument quickly developed, and the shooting followed.\n\nBroussard was shot four times in the head in front of the complex. Brown was shot but ran and fell two blocks away. He was then shot once in the back and twice in the head when he tried to get up. He died a few hours later at Jackson Memorial Hospital in Miami.\n\nRiley said the 22 Yahweh members who had patrolled the building carrying 6- foot-long wooden staffs and walkie-talkies were asked to leave the site shortly after the slayings.\n\nBefore they left, several shouting blacks surrounded the white buses emblazoned with the name \u0022Yahweh\u0022 that brought the cult members to the complex.\n\n\u0022We\u0027re the same color as you. What are you doing to us? Why are you doing this to brothers?\u0022 one said.\n\nA Dade circuit judge issued an injunction Thursday barring the Yahwehs from returning to the block-long site on Northwest 131st Street at Northwest 32nd Avenue until the tenants\u0027 suit challenging an eviction notice from their previous landlords\u0027 comes to court Nov. 6.\n\nThe residents were moved after the Opa-locka City Commission condemned the buildings at a special meeting Thursday. They will not be permitted to return until the buildings are renovated and new certificates of occupancy are approved.\n\nThe condemnation permitted the American Red Cross and county housing authorities to begin the difficult task of finding accommodations for 80 tenants, primarily low-income, single-parent families with many children, who were moved to emergency shelters.\n\nYahwehs, operating under the corporate name of Temple of Love Inc., assumed a $480,000 mortgage on the Opa-locka building on Monday. The complex recently was assessed at $710,000, but previous owners complained they could not maintain the property and said the neighborhood was too drug-ridden for them to make a profit from the apartments.\n\nSpeaking publicly for the first time about their beliefs and their presence in Opa-locka, Yahweh members on Thursday refused to discuss the shootings and claimed they have been slandered and misunderstood.",
      "release": "2023-04-22T16:24:48Z",
      "duration": "00:00:29",
      "explicit": false,
      "youTubeId": "G37aBlI5mAs",
      "subjects": [
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G37aBlI5mAs"
      }
    },
    {
      "id": "c6725d09-3754-4d15-88ce-f9efb06bfc55",
      "title": "Nation of Yahweh Members Prevent Health Inspectors from Monitoring Grocery Stores January 29, 1986)",
      "description": "The Nation of Yahweh is predominantly a Black Hebrew Israelite religious movement which was founded in 1979 in Miami by Hulon Mitchell Jr., who went by the name Yahweh ben Yahweh. (Yahweh is the proper name of the Abrahamic god, so Yahweh ben Yahweh essentially means \u0022God, son of God\u0022.) Its goal is to move African Americans, who it believes are the original Israelites, to Israel. The group accepts Yahweh ben Yahweh as the Son of God. In this way, its beliefs are unique and distinct from those of other Black Hebrew Israelite groups.[1][2]\n\nIts founder, Hulon Mitchell, was indicted on federal racketeering and extortion charges and convicted of conspiracy to commit murder.[3] The group is classified as a black supremacist cult by the Southern Poverty Law Center[4] and as a cult by The Miami Herald.[5]\n\nThe organization describes itself as follows: \u0022In 1979, Yahweh Ben Yahweh came to Miami and became the Spiritual Leader and Founder of The Nation of Yahweh. Although he took a vow of poverty, in seven years he guided The Nation to amass a $250,000,000 empire. Under his direction, The Nation has grown to encompass disciples, followers, and supporters in over 1,300 cities within the U.S. and 16 other countries.\u0022",
      "release": "2023-04-22T11:17:43Z",
      "duration": "00:01:19",
      "explicit": false,
      "youTubeId": "GYUXFKrIl38",
      "subjects": [
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GYUXFKrIl38"
      }
    },
    {
      "id": "17b902ff-6f54-46d4-adfa-84fa718f6cab",
      "title": "Melchizedek Tafari Claims He Was Beat Up by Nation of Yahweh Black Israelites in Miami, Fla 7/28/83",
      "description": "SAULSBY; CULT; BLACK HEBREW ISRAELITES ACCUSED BEATING ACCUSED BEATING MELCHIZADEK TAFARI; TAFARI AND OFFICER ROCK DIAZ, MIAMI DADE POLICE BOTH (SOT); SHOT TEMPLE AT 2762 NW 62ND ST.\n\nThe Nation of Yahweh is predominantly a Black Hebrew Israelite religious movement which was founded in 1979 in Miami by Hulon Mitchell Jr., who went by the name Yahweh ben Yahweh. (Yahweh is the proper name of the Abrahamic god, so Yahweh ben Yahweh essentially means \u0022God, son of God\u0022.) Its goal is to move African Americans, who it believes are the original Israelites, to Israel. The group accepts Yahweh ben Yahweh as the Son of God. In this way, its beliefs are unique and distinct from those of other Black Hebrew Israelite groups.[1][2]\n\nIts founder, Hulon Mitchell, was indicted on federal racketeering and extortion charges and convicted of conspiracy to commit murder.[3] \n\nThe organization describes itself as follows: \u0022In 1979, Yahweh Ben Yahweh came to Miami and became the Spiritual Leader and Founder of The Nation of Yahweh. Although he took a vow of poverty, in seven years he guided The Nation to amass a $250,000,000 empire. Under his direction, The Nation has grown to encompass disciples, followers, and supporters in over 1,300 cities within the U.S. and 16 other countries.\u0022",
      "release": "2023-04-22T10:31:25Z",
      "duration": "00:02:01",
      "explicit": false,
      "youTubeId": "yAVmfLRLXPc",
      "subjects": [
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yAVmfLRLXPc"
      }
    },
    {
      "id": "a7ef7add-35be-4e59-93a5-7774c4bf9317",
      "title": "Miami Police Continue Investigation into Yahweh ben Yahweh for the Death of Former Members 12/11/81",
      "description": "GILMARTIN; HEBREW ISRAELITES DENOUNCE MEMBERS OF CHURCH ACCUSED OF MURDER; MOSES ISRAEL, LEADER MIAMI TEMPLE; ASIEL BEN (SOT) ON RADIO SHOW.",
      "release": "2023-04-21T14:37:41Z",
      "duration": "00:01:28",
      "explicit": false,
      "youTubeId": "0zgfPonX95Y",
      "subjects": [
        "Black Hebrew Israelites",
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0zgfPonX95Y"
      }
    },
    {
      "id": "7a28dd46-560d-4705-986f-4a7d77b6e060",
      "title": "Miami Police Investigate Yahweh ben Yahweh\u0027s Involvement in Former Member\u0027s  Decapitation (11/16/81)",
      "description": "SAULSBY; INVESTIGATION INTO “BLACK HEBREW ISRAELITES” SECTOR ALSO CALLED YAHWEHS; METRO HOMICIDE INVEST DUE TO MURDERS; FRANK WESOLOWSKI, METRO HOMICIDE AND MOSES ISRAEL, BLACK HEBREW ISRAELITES BOTH (SOT).\n\nYahweh ben Yahweh (born Hulon Mitchell Jr.; October 27, 1935 – May 7, 2007) was an American religious leader, Black separatist and founder of the Nation of Yahweh, a new religious movement headquartered in Florida that had thousands of Black American devotees at its peak. He preached that Jesus is Black and that \u0022white devils\u0022 temporarily rule over Black people. He was accused of teaching hate. Yahweh was indicted on three counts of federal racketeering and extortion charges, of which he was found not guilty. However, he was convicted of conspiracy to commit murder.[1]",
      "release": "2023-04-21T14:28:07Z",
      "duration": "00:01:18",
      "explicit": false,
      "youTubeId": "6UuUZdxzl-Y",
      "subjects": [
        "Black Hebrew Israelites",
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6UuUZdxzl-Y"
      }
    },
    {
      "id": "39d719b4-10b6-49fb-a5a1-3f700b2723e2",
      "title": "The Murder of Mark Kilroy by Adolfo Constanzo and Los Narcosatánicos (April 12, 1989)",
      "description": "On 14 March 1989, University of Texas at Austin student Mark James Kilroy was kidnapped in Matamoros, Tamaulipas, Mexico, while vacationing during spring break. He was taken by his abductors to a ranch where he was tortured and sodomized for hours before being murdered in a human sacrifice ritual. Kilroy was killed with a machete blow and then had his brain removed and boiled in a pot. His killers then inserted a wire through his spinal column, amputated his legs at the knees, and buried him at the ranch along with 14 other people who had been killed there before him. Adolfo Constanzo, the leader of the cult, told his followers that human sacrifice granted them immunity from law enforcement for their drug smuggling operations. The killing drew worldwide media attention and initiated an international police manhunt because of the unusual circumstances of the crime.\n\nAfter the bodies were discovered on 11 April 1989, Constanzo fled to Mexico City but was eventually tracked down. As the police surrounded his apartment complex, Constanzo died after ordering one of the cult members to kill him with a machine gun. Sara Aldrete, another high-ranking member of the cult, was arrested at the scene along with several others. In 1993, the cult members were found guilty of a number of charges, including capital murder and drug trafficking. Several of them, however, claimed they were not guilty of Kilroy\u0027s murder and told the press they were tortured to confess. Only two suspects remain at large.\n\nMark James Kilroy was born on 5 March 1968, in Chicago, Illinois, U.S. His parents were James William \u0022Jim\u0022 Kilroy, a chemical engineer, and Helen Josephine Kilroy, a volunteer paramedic.[1] They moved to Texas from the Midwest after their son was born.[2] Kilroy grew up in Santa Fe, Texas, a small town outside of Houston, for over 15 years along with his brother Keith Richard Kilroy.[1] He was raised as a Catholic and his parents were frequent attendees at Our Lady of Lourdes Catholic Church in the adjacent town of Hitchcock, Texas. Kilroy excelled both in academics and athletics as a teenager, and played baseball, basketball, and golf with his friends at school.[3][4] He was in the Boy Scouts of America and an honors student at Santa Fe High School, where he was a member of the student council, and was ranked 14th in a class of 210 students. Upon graduation in 1986, he attended Southwest Texas State University in San Marcos, Texas, before transferring to Tarleton State University in Stephenville, Texas, on a basketball scholarship. At Tarleton he became a member of the Lambda Chi Alpha fraternity. He then decided to give up his athletics and transferred to the University of Texas at Austin to become a pre-med student and prepare for his Medical College Admission Test (MCAT).[1][4]\n\nProfile of cult leaders\nKilroy\u0027s murderer, Adolfo Constanzo, was a Cuban American who was born in Miami, Florida, in 1962. His father died when he was an infant, so his mother relocated to Puerto Rico with him, where she remarried. They returned to Florida in 1972 and his stepfather died soon afterwards, leaving a large inheritance behind. His mother married again, this time with a man who was involved in drug trafficking and the occult. His stepfather taught him a philosophy that Constanzo carried for the rest of his life: he told him that he should let nonbelievers \u0022kill themselves with drugs\u0022 while he could profit from their foolishness. Around the same time, Constanzo\u0027s mother believed that her son had psychic abilities.[5][6] She introduced him to Palo Mayombe, an Afro-Caribbean religion that involves animal sacrifice.[5] He also was introduced to Santería when he was younger.[a][9] He started as a \u0022palero\u0022, someone who practices Palo Mayombe, and eventually reached the status of high-priest, \u0022padrino\u0022.[10] In 1984, he moved to Mexico City to start his life as a tarot card reader and eventually developed a cult following.[11] His charisma, physical attractiveness (he previously worked as a male model), and claimed psychic talent granted him the opportunity to mingle with Mexico City\u0027s upper class.[12][13] \n\nThe other cult leader was Sara Aldrete, a Matamoros native and an honors student and cheerleader at Texas Southmost College.[15] She was the girlfriend of Gilberto Sosa, a drug dealer linked to the Hernández clan to which Constanzo wanted an introduction.[16][17] In 1987, she met Constanzo and eventually became the cult\u0027s main recruiter.\n\nThe ranch where Kilroy was murdered in Matamoros, Santa Elena, was owned by Brigido Hernández. He was not a follower of Constanzo and was not charged with any crimes in the U.S. or Mexico.[26] The sudden death of Saul Hernandez in a shooting prompted his family, including Elio and his brothers Serafín Sr. and Ovidio, to grow closer to rituals and eventually become members of Constanzo\u0027s cult.[27][28]",
      "release": "2023-04-20T15:58:04Z",
      "duration": "00:01:03",
      "explicit": false,
      "youTubeId": "m5GJ0V7p_Dc",
      "subjects": [
        "Adolfo Constanzo"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=m5GJ0V7p_Dc"
      }
    },
    {
      "id": "d1277b0d-4676-4265-9bba-5d2acdfbab69",
      "title": "The Trial of Larry Layton for the Jonestown Massacre (July 21, 1981)",
      "description": "Report on the return of Peoples Temple of Disciples of Christ member Larry Layton to the United States, and the legal ramifications he faces. Interview with Layton’s lawyer Tom Tamburello about Layton being made a scapegoat for the Jonestown massacre and murder of Congressman Leo Ryan. Footage of Layton being escorted out of a Guyanese prison and arriving back in the US. Footage of airstrip incident in Jonestown. Standup outside San Francisco federal court house. NBC footage used.\nReporter: Kashiwahara, Ken\n\nThe Peoples Temple Agricultural Project, better known by its informal name \u0022Jonestown\u0022, was a remote settlement in Guyana established by the Peoples Temple, a U.S.-based cult under the leadership of Jim Jones. Jonestown became internationally infamous when, on November 18, 1978, a total of 909[1][2] people died at the settlement, at the nearby airstrip in Port Kaituma, and at a Temple-run building in Georgetown, Guyana\u0027s capital city. The name of the settlement became synonymous with the incidents at those locations.[3]\n\nIn total, 918 individuals died in Jonestown,[1] all but two from apparent cyanide poisoning, a significant number of whom were injected against their will, in an event termed \u0022revolutionary suicide\u0022 by Jones and some Peoples Temple members on an audio tape of the event, and in prior recorded discussions. The poisonings in Jonestown followed the murder of five others by Temple members at Port Kaituma, including Congressman Leo Ryan, an act that Jones ordered. Four other Temple members committed murder-suicide in Georgetown at Jones\u0027 command.\n\nTerms used to describe the deaths in Jonestown and Georgetown have evolved over time. Many contemporary media accounts after the events called the deaths a mass suicide.[4][5] In contrast, most sources today refer to the deaths with terms such as mass murder-suicide,[6] a massacre,[7][8] or simply mass murder.[9][10] Seventy or more individuals at Jonestown were injected with poison, and a third of the victims (304) were minors.[11][12] Guards armed with guns and crossbows had been ordered to shoot anyone who attempted to flee the settlement as Jones lobbied for suicide.[8][13]\n\nLarry Layton, who had fired a gun at several people aboard the Cessna, was initially found not guilty of attempted murder in a Guyanese court, employing the defense that he was \u0022brainwashed.\u0022 Acquittal in a Guyanese court did not free Layton, who was promptly deported back to the U.S. and arrested by the US Marshals Service upon arrival in San Francisco. Layton could not be tried in the U.S. for the attempted murders of Gosney, Bagby, Dale Parks, and the Cessna pilot on Guyanese soil and was, instead, tried under a federal statute against assassinating members of Congress and internationally protected people (Ryan and Dwyer). He was convicted of conspiracy and of aiding and abetting the murder of Ryan and of the attempted murder of Dwyer. Paroled in 2002, he is the only person ever to have been held criminally responsible for the events at Jonestown.\n\nSeductive Poison: A Jonestown Survivor\u0027s Story of Life and Death in the Peoples Temple is a first-hand account of the incidents surrounding Peoples Temple (whose base in Guyana was the scene of the 1978 Jonestown massacre), written by survivor Deborah Layton (born February 7, 1953), a high-level member of the Peoples Temple until her escape from the encampment. The first edition of the book was published by Anchor~Doubleday in hardcover on November 3, 1998, and the second edition was published in paperback on November 9, 1999. In 2014, Random House Audio made Seductive Poison into an audio-book read by the author and narrator, Kathe Mazur. Charles Krause, the young Washington Post journalist who accompanied Congressman Leo Ryan into Jonestown and was injured at the airstrip, reads his foreword.\n\nLayton\u0027s older brother was the only one ever prosecuted for the murders of the congressional team by Temple members.[1] After over twenty years in prison, Larry Layton was released on parole in 2002, largely due to the testimony of Vernon Gosney, one of the few survivors of the massacre, and the Federal Chief Judge, Robert F. Peckham.[2]\n\nThe book is published in Italy, France, Australia, Germany, Thailand and United Kingdom.\nThe event was covered heavily by the media, and photographs pertaining to it adorned newspaper and magazine covers for months after its occurrence. It was labeled a \u0022cult of death\u0022 by both Time and Newsweek magazines.[200] In February 1979, 98% of Americans polled said that they had heard of the tragedy.[201] George Gallup stated that \u0022few events, in fact, in the entire history of the Gallup Poll have been known to such a high percentage of the US public\u0022.[201]",
      "release": "2023-01-03T15:38:42Z",
      "duration": "00:00:58",
      "explicit": false,
      "youTubeId": "HKvI2VUdGz4",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HKvI2VUdGz4"
      }
    },
    {
      "id": "8674e453-ad6f-4a08-9e39-035ede42fbe0",
      "title": "Elizabeth Clare Prophet and the Church Universal and Triumphant (1993)",
      "release": "2021-02-03T15:48:43Z",
      "duration": "00:04:19",
      "explicit": false,
      "youTubeId": "j0EKGfmvxB0",
      "subjects": [
        "Church Universal and Triumphant"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j0EKGfmvxB0"
      }
    }
  ]
}