{
  "id": "e585fbe0-9c26-4ae7-b4b6-b7491569d5d4",
  "name": "Follow Your Curiosity",
  "spotifyId": "5IkDC0FwZQa8JC0wy0ac3A",
  "appleId": 1448479451,
  "episodes": [
    {
      "id": "7da74ea4-ec2a-46d3-b5c8-40b981fed61a",
      "title": "Witness Underground with Scott Homan and Ryan Sutter",
      "description": "What’s it like to doubt the beliefs of the strict religious community you grew up with? What’s it like to leave? Where do you find the courage and strength to make that choice, and to adapt to your new life? Director Scott Homan and writer and musician Ryan Sutter have lived these questions, and collaborated to tell the story in the new documentary, Witness Underground. The film focuses on Ryan’s love of music and the musical relationships within the Jehovah’s Witness community that sustained him as a teen and gave him a safe place to land when he left. We talk about all these questions and the process of making the film, which is now running a Kickstarter to fund distribution to popular streaming services. Episode breakdown: [00:05:16] Scott: Wisconsin arts program shaped career in film. [00:10:19] Change your environment for personal growth. [00:14:10] Ryan: Creative kids form band with makeshift instruments. [00:17:39] Creativity and emotional release through music. [00:26:17] Other connections transcended religion, influencing change. [00:30:07] Scott reconnects with Ryan. [00:32:56] Ryan\u0027s wrestling with beliefs through writing, recording music, and live performance = enhanced creative thinking. [00:40:22] How authoritarian regimes suppress artists. [00:44:37] \u0022Coming out.\u0022 [00:50:51] Seeing life through Ryan\u0027s eyes. [00:57:20] Amazing connection to music; influential, undiscovered collection. [01:03:08] Ryan: Therapy, new albums, and a goal: move on and heal. [01:09:26] Music connects people in amazing ways. [01:15:05] Scott: Filmmaker\u0027s struggle with distribution, potential exploitation. [01:19:24] Kickstarter campaign funding distribution of the film, which has amazing perks including music and written work. Check out the full show notes at fycuriosity.com, and connect with me and fellow creatives on Substack. Please leave a review and in it, tell us how your creativity has given you strength when you’ve needed it most. Want more? Here are some handy playlists with all my previous interviews with guests in music.",
      "release": "2023-11-08T00:00:00",
      "duration": "01:22:31.6640000",
      "explicit": false,
      "spotifyId": "66DmmvX4STrRxaeefmOOOk",
      "appleId": 1000634117216,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/66DmmvX4STrRxaeefmOOOk",
        "apple": "https://podcasts.apple.com/podcast/witness-underground-with-scott-homan-and-ryan-sutter/id1448479451?i=1000634117216"
      }
    }
  ]
}