{
  "id": "a4068345-4d6c-42de-920d-5207ab2ec86c",
  "name": "For Tits and Giggles",
  "spotifyId": "21qJTbCyMUCiPF0S390YFT",
  "appleId": 1844520015,
  "episodes": [
    {
      "id": "23ba613e-466e-410d-a1e0-79402469d7ae",
      "title": "The busty benefits of a doomsday cat cult leader",
      "description": "Church, cat rescue, doomsday cult? AND B@@bs?! Tighten your seatbelts, you’re in for a bumpy ride with this episode! Ballerina and ballet teacher, Ophélia Martin-Weber is back as co-host and we’ll be riding with internet trolls who I guess are disappointed that their internet search delivered videos of non-pornified breastfeeding moms? Leaning into their mockery produced laughable results and good times. What is it like being the daughter of the founder of The Leaky B@@b online lactation support and a lactation educator who talks about chesty topics every day? I interviewed Ophélia with her personal experiences growing up surrounded by t*ttee talk all the time and her experience with ballet, breasts, and social pressures. Exploring body image. The Patreon extended ep and bonus segments including outtakes is rich for this one! We had to cut SO MUCH from this episode which means the extended ep is full of juicy titbits over in Patreon. You really don’t want to miss this extended ep. Join us on Patreon for extended episodes, full episode notes, guest profiles, videos, behind the scenes, ad-free eps, bonus segments, afterparties, and more. Be a part of the FTAG Community. Follow For Tits and Giggles on Instagram, Facebook, and TikTok, and join us on Facebook at the For Tits and Giggles Podcast Discussion Group. If you have a story you want to get off of our chest or one to recommend we share, we want to hear from you!",
      "release": "2026-01-23T01:11:50Z",
      "duration": "00:46:47.0660000",
      "explicit": false,
      "spotifyId": "1YN7fhOErNACUm3iBw6Qdq",
      "appleId": 1000746278655,
      "subjects": [
        "Freedom Fire Ministries"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YN7fhOErNACUm3iBw6Qdq",
        "apple": "https://podcasts.apple.com/podcast/the-busty-benefits-of-a-doomsday-cat-cult-leader/id1844520015?i=1000746278655"
      }
    }
  ]
}