{
  "id": "849cb66a-8e47-436f-a1db-9735df041ee0",
  "name": "Forbes True Crime",
  "spotifyId": "2HKgB511dDMybcRb7OFzNM",
  "appleId": 1826808529,
  "youTubeChannelId": "UCg40OxZ1GYh3u3jBntB6DLg",
  "youTubePlaylistId": "PLOYlBMYxtOpB3O7C-RUebIfUCQPqD6GW-",
  "episodes": [
    {
      "id": "0a6e1d53-ae36-4a37-a6e2-a400cf4c5f02",
      "title": "This Is The \u0027Bombshell News\u0027 From Latest Batch Of Epstein Files: Barry Levine",
      "description": "The Epstein Files Transparency Act, signed into law in November, gave the Department of Justice a deadline of December 19th to release all of their documents related to convicted sex offender Jeffrey Epstein. Since Friday, the DOJ has released batches of Epstein-related materials on what has been described as a rolling basis. In the document dumps were photos of Epstein with the rich and prominent people, an image of former President Bill Clinton soaking in a hot tub, and an email sent in January of 2020 from a federal prosecutor that claimed “Donald Trump traveled on Epstein\u0027s private jet many more times than previously has been reported.” The DOJ released a statement with the release of the December 23 files that in part said “Some of these documents contain untrue and sensationalist claims made against President Trump that were submitted to the FBI right before the 2020 election. To be clear: the claims are unfounded and false, and if they had a shred of credibility, they certainly would have been weaponized against President Trump already.” Barry Levine, author of \u0022The Spider: Inside the Criminal Web of Jeffrey Epstein and Ghislaine Maxwell,\u0022 joined “Forbes True Crime” to discuss what has been revealed in the released materials so far. \n\nFuel your success with Forbes. Gain unlimited access to premium journalism, including breaking news, groundbreaking in-depth reported stories, daily digests and more. Plus, members get a front-row seat at members-only events with leading thinkers and doers, access to premium video that can help you get ahead, an ad-light experience, early access to select products including NFT drops and more:\n\nhttps://account.forbes.com/membership/?utm_source=youtube\u0026utm_medium=display\u0026utm_campaign=growth_non-sub_paid_subscribe_ytdescript\n\n\nStay Connected\nForbes on Facebook: http://fb.com/forbes\nForbes Video on Twitter: http://www.twitter.com/forbes\nForbes Video on Instagram: http://instagram.com/forbes\nMore From Forbes:  http://forbes.com",
      "release": "2025-12-23T23:55:42Z",
      "duration": "00:34:13",
      "explicit": false,
      "youTubeId": "GwlWRbmgvCc",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GwlWRbmgvCc"
      }
    },
    {
      "id": "a64e1b9e-7626-4344-b5e9-83a1da955be2",
      "title": "BOMBSHELL: Here\u0027s What\u0027s Been Found In Ghislaine Maxwell\u0027s Prison Emails",
      "description": "Over the summer, Deputy Attorney General Todd Blanche conducted a two-day interview with longtime Jeffrey Epstein associate Ghislaine Maxwell. Maxwell is currently serving a 20-year sentence after being found guilty of sex trafficking charges in connection to Epstein. During her meeting with Blanche, she claimed to have never witnessed any inappropriate behavior, and that she never saw President Donald Trump engage in any wrongdoing. After the meeting, she was transferred to a minimum-security facility in Texas – the type of prison camp that typically does not allow sex offenders. Emails that Maxwell has sent since her move to the Lone Star State show she’s received preferential treatment from the warden, benefits from a host of privileges not usually provided to other inmates, and writes in a tone that is “notably free of regret, remorse, shame, and self-doubt,” according to The Atlantic staff writer Isaac Stanley-Becker, who obtained the correspondence. Stanley-Becker joins “Forbes True Crime” to discuss his takeaways from Maxwell’s emails from prison. Fuel your success with Forbes. Gain unlimited access to premium journalism, including breaking news, groundbreaking in-depth reported stories, daily digests and more. Plus, members get a front-row seat at members-only events with leading thinkers and doers, access to premium video that can help you get ahead, an ad-light experience, early access to select products including NFT drops and more: https://account.forbes.com/membership/?utm_source=youtube\u0026utm_medium=display\u0026utm_campaign=growth_non-sub_paid_subscribe_ytdescript Stay Connected Forbes on Facebook: http://fb.com/forbes Forbes Video on Twitter: http://www.twitter.com/forbes Forbes Video on Instagram: http://instagram.com/forbes More From Forbes: http://forbes.com",
      "release": "2025-11-26T05:00:00Z",
      "duration": "00:20:30.9680000",
      "explicit": false,
      "spotifyId": "3WdcKTX1PK2FcLTHcOf52C",
      "appleId": 1000738534950,
      "youTubeId": "NEMFFdtl7gs",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3WdcKTX1PK2FcLTHcOf52C",
        "apple": "https://podcasts.apple.com/podcast/bombshell-heres-whats-been-found-in-ghislaine-maxwells/id1826808529?i=1000738534950",
        "youtube": "https://www.youtube.com/watch?v=NEMFFdtl7gs"
      }
    }
  ]
}