{
  "id": "85c42120-8b07-4bd0-804c-c09d2644d6c9",
  "name": "Forbidden Conversations",
  "spotifyId": "5mPI7lffv4d0yQ5L3L24RV",
  "appleId": 1672462576,
  "youTubeChannelId": "UCOfpQjCq6wz3g1RtGaznAFQ",
  "episodes": [
    {
      "id": "81e7ea73-02d1-45a8-95b0-4a6acea19701",
      "title": "Dr. Steven Hassan on the Cults We Join | EP28",
      "description": "Steven Hassan, PhD is a mental health professional and expert in undue influence tactics used by authoritarian leaders and destructive cults. His expertise includes harmful influence in cases of destructive religious and political cults, human trafficking, extremist and terrorist groups, one-on-one relationships, families, parental alienation, mini-cults, therapy and self-improvement groups, professional and institutional abuse, corporate and multi-level marketing programs, and harmful belief systems. He is the author of four books including Combating Cult Mind Control, Freedom of Mind, and The Cult of Trump. He is a translated author with books in 10 languages. \n\nHis general audience courses and mental health professional continuing education courses include Understanding Cults: A Foundational Course and Understanding Cults: A Foundational Course for Clinicians. He is the Founding Director of the Freedom of Mind Resource Center, which provides training, consulting, and support to individuals who are struggling to leave or recover from a cult and to families and organizations that are concerned about cult behaviors. He is also the founder of Freedom From Undue Influence, a not-for-profit entity with the purpose of conducting and publishing research on undue influence that is needed to update legal and social policies. He developed the BITE Model of Authoritarian Control to identify control tactics and the Influence Continuum Model to discern ethical from unethical influence. He developed the Strategic Interactive Approach (SIA), as an effective and legal intervention alternative for families to help cult members. \n\nDr. Hassan believes that access to the truth, freedom of thought, and freedom from undue influence are basic human rights. A complex systems approach, based in science and supported by the rule of law, is necessary to protect these rights. He is a member of the Program in Psychiatry and the Law at the Massachusetts Mental Health Center, a teaching hospital of Harvard Medical School. He is an experienced educator having served as an instructor for the Harvard Law School Trial Advocacy Workshop, as an elective teacher and a presenter for the Harvard Longwood Psychiatry Residency Training Program, and in other educational and training capacities for other higher education, professional, law enforcement, governmental, non-governmental and advocacy group audiences. Dr. Hassan began helping people affected by undue influence after he was deprogrammed from the Moon cult in 1976 at age 22. \n\nHis 45-plus years of experience give him a unique perspective on the damaging effects of undue influence and exploitation by destructive cults. He is a frequently requested speaker and media interviewee. Dr. Hassan holds a Master’s Degree in Counseling Psychology from Cambridge College and a Doctorate in Organizational Development and Change from Fielding Graduate University School of Leadership Studies.\n\nWEBSITE:   https://freedomofmind.com\nX: @CultExpert",
      "release": "2024-10-02T00:06:57Z",
      "duration": "01:03:08",
      "explicit": false,
      "spotifyId": "5DjFXUdamR7YfpOgd4oc9w",
      "appleId": 1000671339246,
      "youTubeId": "9dPgJHO8MjU",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5DjFXUdamR7YfpOgd4oc9w",
        "apple": "https://podcasts.apple.com/podcast/dr-steven-hassan-on-the-cults-we-join/id1672462576?i=1000671339246",
        "youtube": "https://www.youtube.com/watch?v=9dPgJHO8MjU"
      }
    }
  ]
}