{
  "id": "44a3b3ca-4891-403d-9f59-bff20d0b223f",
  "name": "Forum Communications Company",
  "youTubeChannelId": "UC4Xi9zt3WlBv4iC0ysBgQ8A",
  "episodes": [
    {
      "id": "29bb34a9-17e9-4a27-9aab-9a9eb293da5f",
      "title": "Is There a Cult in North Dakota? PART 1",
      "description": "How a \u0027cult\u0027 took hold in the small town of Neche, North Dakota   In the summer of 2024, reporters C.S. Hagen and Drew Trafton presented a reporting series and two-part documentary highlighting the Plymouth Brethren Christian Church, a Christian sect that began in the U.K. in the 1800s and has since branched out globally. The PBCC also has historic ties to the small town of Neche, North Dakota.   Former members report that the church is responsible for a wide range of misconduct, from money laundering schemes to complicity with sexual assault.    For this first in a three-part audio series, C.S. and Drew sit down with Trisha Taurinskas to discuss their reporting and give listeners a glimpse inside the church, what it believes and the accusations of its former members.",
      "release": "2025-01-22T21:56:44Z",
      "duration": "00:33:37",
      "explicit": false,
      "youTubeId": "_gjrnosAUhk",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_gjrnosAUhk"
      }
    },
    {
      "id": "0df26ed1-e370-4e44-906f-78734b315a98",
      "title": "Is There a Cult in North Dakota? PART 2",
      "description": "A former \u0027cult\u0027 member describes sexual assault and forced separation from family   According to former members, the Plymouth Brethren Christian Church has operated for years in the small town of Neche, North Dakota, using fear and the separation from family to keep its members in line.   In this episode, the second in a three-part audio series, we hear from a former PBCC member who experienced numerous incidents of sexual assault as a young girl and was shunned from her community and family when she made the choice to leave the church as an adult. Also, reporters Drew Trafton and C.S. Hagen discuss the methods of control the church uses.",
      "release": "2025-01-22T21:24:57Z",
      "duration": "00:32:07",
      "explicit": false,
      "youTubeId": "Wgcwt0O6DvM",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Wgcwt0O6DvM"
      }
    },
    {
      "id": "af08fa79-fb6b-43a9-9038-1b5e0e74e5a1",
      "title": "Is There a Cult in North Dakota? PART 3",
      "description": "A helping hand to former Plymouth Brethren members   In the last of this three-part audio series, host Trisha Taurinskas interviews Carman Drever, a former member of the Plymouth Brethren Christian Church and outspoken critic of the church.   Drever shares her experiences within the church and goes into detail about the PBCC\u0027s control over its members, who face separation from their family if they step out of line. Since leaving the PBCC, Drever has devoted her energy to providing information and resources to other former cult members who often have no other place to turn.",
      "release": "2025-01-22T21:24:56Z",
      "duration": "01:12:12",
      "explicit": false,
      "youTubeId": "Vis3-8tZJaY",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Vis3-8tZJaY"
      }
    }
  ]
}