{
  "id": "c8e75aef-1533-44ec-a050-5183a8e92471",
  "name": "FOX 4 Dallas-Fort Worth",
  "youTubeChannelId": "UCruQg25yVBppUWjza8AlyZA",
  "episodes": [
    {
      "id": "783f83aa-f258-4043-98cf-cac20379452b",
      "title": "🔴LIVE: Epstein survivors speak out; Pam Bondi hearing",
      "description": "Attorney General Pam Bondi is being questioned by lawmakers Wednesday over the Department of Justice’s management of files related to Jeffrey Epstein that have exposed sensitive confidential information about victims despite redaction efforts.\n\nBondi’s appearance marks the first time she is appearing before Congress since an October 2025 hearing where she deflected questions and opposed Democrats’ criticism of her actions. \n\nDemocrats on the House Judiciary Committee are expected to question Attorney General Bondi on how the Department of Justice decided what documents should and should not be made public under the Epstein Files Transparency Act. \n\nThe Associated Press reported that the act was passed by Congress after the DOJ announced in July2025 that no more files would be released.\n\nWednesday’s hearing comes several days after lawmakers visited the Justice Department office to examine unredacted versions of the Epstein files. Legislators were granted access to the over 3 million files released in a room with computers and were permitted to take notes. \n\nOn Feb.5, a collection of Epstein documents released by the DOJ, which included nude photos, names, faces, bank accounts and Social Security numbers of Epstein’s victims.\n\nThe files were released to comply with a law that required the federal government to make Epstein’s case documents public, but the redactions meant to protect his victims have been sloppy, inconsistent, or nonexistent.\n\nTheir names were supposed to be blocked out. Their faces and bodies were supposed to be hidden. Despite the Justice Department’s efforts to repair the blatant mismanagement, nude photos were on the site.\n\nMembers of the Democratic Women\u0027s Caucus and Epstein survivors previously hosted a press conference to demand justice, accountability, and transparency.\n\nFOX 4 News is a FOX-owned station serving Dallas-Fort Worth and all of North Texas.",
      "release": "2026-02-11T20:38:54Z",
      "duration": "06:33:40",
      "explicit": false,
      "youTubeId": "G5SyDCLFVnE",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G5SyDCLFVnE"
      }
    }
  ]
}