{
  "_ts": 0,
  "id": "6373f470-783e-423a-8737-9ff9ec89b804",
  "name": "Frank Report",
  "youTubeChannelId": "UC8z8LTbiP4sxpCGIL9nbndQ",
  "episodes": [
    {
      "id": "45d6f5b2-b134-4a1d-a5ac-1b21e59dc21e",
      "title": "The Man Who Blew the Whistle Sex on Cult NXIVM HBO by VICE - Featuring Reporter Frank Parlato",
      "description": "Published and produced by @VICE, this video features Investigative Reporter Frank Parlato.\n\nNXIVM was a self-help organization founded by Keith Raniere in 1998. Initially marketed as a personal development program, NXIVM gained attention for its controversial practices and allegations of being a cult. Keith Raniere, also known as \u0022Vanguard\u0022 within NXIVM, was the leader and founder of the organization. He presented himself as a charismatic and influential figure, attracting followers who believed in his teachings and philosophies.\n\nRaniere was accused of engaging in manipulative and abusive behavior towards women within NXIVM. It was alleged that he ran a secret society within the organization called DOS (Dominus Obsequious Sororium), which operated as a pyramid scheme and involved coercing women into becoming his \u0022slaves.\u0022 These women were allegedly subjected to physical and emotional abuse, forced to provide collateral, and were branded with Raniere\u0027s initials.\n\nIn June 2019, Keith Raniere was convicted on multiple charges, including racketeering, sex trafficking, forced labor conspiracy, and conspiracy to commit identity theft. The trial revealed the extent of his abusive practices and the harm inflicted upon his victims. Raniere was sentenced to 120 years in prison in October 2020.\n\nFrank Parlato is a journalist and whistleblower who played a significant role in exposing the NXIVM sex cult through his investigative reporting. His work shed light on the illegal activities and manipulation within the organization, leading to the arrest and conviction of several high-ranking members, including the cult\u0027s leader, Keith Raniere. Parlato\u0027s reporting helped bring justice to the victims and dismantle the NXIVM sex cult, ultimately exposing the truth behind its operations.",
      "release": "2024-05-19T03:21:36Z",
      "duration": "00:08:34",
      "explicit": false,
      "youTubeId": "NOVwPsFz5XM",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NOVwPsFz5XM"
      }
    }
  ]
}