{
  "id": "cfd4a9e0-8af8-4168-bd30-a3a84af12bfd",
  "name": "Frederick Chikambure",
  "youTubeChannelId": "UCtudIoQqTV11-vDbJ1PNK6Q",
  "episodes": [
    {
      "id": "ec2e7d40-fc70-492a-af81-e82a7316e199",
      "title": "How Growing Up in a High-Control \u0022Cult\u0022 Environment Silences Your Inner Voice",
      "description": "In this video, I explore the psychological impact of being raised in a system where obedience, fear, and external authority replaced intuition, preference, and self-trust.\n\nAs a former Jehovah’s Witness, I learned very early that my inner voice wasn’t welcome — and many people who grew up in strict religious or controlling environments share this experience.\n\nToday we go deeper into:\n- why your intuition went quiet\n- how your nervous system adapted to survive\n- why decisions feel emotionally risky\nand how you can slowly begin reconnecting with your true inner voice again\n\nThis is the bridge between understanding why decision-making feels difficult (yesterday’s video) and moving toward rebuilding self-trust and clarity.\n\nIf this resonates with your journey — whether you’re an ex-JW, ex-Christian, or anyone recovering from control — you’re not alone.",
      "release": "2025-12-11T16:23:19Z",
      "duration": "00:19:41",
      "explicit": false,
      "youTubeId": "0HINbxw-4Bc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0HINbxw-4Bc"
      }
    },
    {
      "id": "16914b0d-f6fc-4364-86d0-debe582d507b",
      "title": "Why Former Jehovah’s Witnesses Struggle to Trust Their Own Decisions",
      "description": "Many former Jehovah’s Witnesses struggle to trust their own decisions after leaving — not because we’re weak, but because we were trained to outsource every choice to an organization, elders, or doctrine. In this video, I talk about what happens to your inner voice in a high-control environment, why decision-making feels scary after you leave, and how we slowly rebuild independence and confidence again",
      "release": "2025-12-10T06:56:47Z",
      "duration": "00:22:43",
      "explicit": false,
      "youTubeId": "zmGorozYH-8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zmGorozYH-8"
      }
    }
  ]
}