{
  "_ts": 0,
  "id": "7ad16c84-4e34-41f3-b5ba-fc9ef44d7674",
  "name": "Free Outside",
  "spotifyId": "5JIkon9bPlRViVEGiwJgkF",
  "appleId": 1746114870,
  "episodes": [
    {
      "id": "8c58f6ba-eb91-40ef-8dbb-f7a32c048f05",
      "title": "The Calendar Year Triple Crown with Brandon Weis",
      "description": "In this conversation, I interviewed Brandon Wise, who also completed the Calendar Year Triple Crown. We discuss his experience with the Yellow Deli \u0022commune\u0022, his motivation for attempting the Calendar Year Triple Crown, and the challenges he faced along the way. We also talk about the social aspect of thru-hiking and the importance of camaraderie on the trail. Support Brandon Weis\u0027 book \u0022This is Gonna Hurt\u0022 about the Calendar Year Triple Crown: https://amzn.to/3XQzzRT And Follow Brandon on Instagram: https://www.instagram.com/naturalhorsepower/?hl=en Overall, the conversation highlights the physical and mental challenges of long-distance hiking and the transformative power of the outdoors. Takeaways The Calendar Year Triple Crown is a challenging feat that requires careful planning and determination. Thru-hiking can be a solitary experience, but the social aspect and camaraderie with other hikers can greatly enhance the journey. Challenges and obstacles are inevitable on a thru-hike, but overcoming them can lead to personal growth and a sense of accomplishment. The Yellow Deli cult experience highlighted the importance of being open-minded and adaptable while on the trail. Writing a book about the thru-hiking experience can be just as challenging as the hike itself. Thru-hiking the Calendar Year Triple Crown involves hiking the Appalachian Trail, Pacific Crest Trail, and Continental Divide Trail in a single calendar year. Challenging weather conditions, such as blizzards and freezing temperatures, can be encountered during long-distance hikes. Camaraderie among hikers is a significant aspect of the thru-hiking experience, with shared struggles and bonding over shared experiences. The decision to pursue long-distance hiking instead of other life paths, such as attending law school, can be influenced by the desire for adventure, personal growth, and financial considerations. Future plans for hikers may include pursuing ultra running and international hiking, such as the Great Divide Trail in Canada or the Four Corners loop in the United States. Long-distance hiking offers a unique opportunity for personal growth, self-discovery, and a deep connection with nature. Sound Bites \u0022You could say the Count of Your Triple Crown saved you a bunch of money.\u0022 \u0022Yeah, that was one of the weirder nights of my entire life.\u0022 \u0022I mean, we all had a lot of time and not a lot to do. I just put mine to some good use, I guess.\u0022 \u0022Humans were strange creatures because, you know, one of my favorite memories of the whole year is something that was pretty awful in the moment and like super miserable but I look back on it now and I can\u0027t help but smile every time.\u0022 \u0022Yeah, the hardest part\u0027s starting. You can always quit. It\u0027s not a big deal.\u0022 \u0022Yeah, gotta get my first one. Come on. Spent all my money on thru-hiking. It\u0027s the real trick. But it\u0027s worth it to spend on the experiences for sure.\u0022 Chapters 00:00 The Challenges and Triumphs of the Calendar Year Triple Crown 06:42 Navigating the Yellow Deli Cult Experience 13:03 The Dual Challenges of Thru-Hiking and Writing a Book 23:57 Overcoming Obstacles on the Thru-Hiking Journey 26:45 Surviving Freezing Conditions: Tips and Tricks 27:36 The Calendar Year Triple Crown: Challenges and Recommendations 29:01 Thru-Hiking vs. Breaking Up the Trails: Pros and Cons 30:00 Physical Challenges and Long-Term Effects of Thru-Hiking 30:29 Embarking on Additional Backpacking Adventures 32:23 Favorite Trails and Recommendations for Hikers 33:21 Underrated Trails and the Beauty of the Arizona Trail 34:18 Life After Thru-Hiking: Career Choices and Future Plans 38:41 Finding Joy in Challenging Moments: The Magic of Thru-Hiking 41:32 The Power of Shared Struggles and Bonding on the Trail 42:02 Developing Deep Connections and Friendships on the Trail 43:30 The Journey of Writing a Book and Preserving Memories 46:35 Embracing New Adventures and Overcoming Fear of Failure 47:35 The Importance of Starting and Trying New Things 49:32 Exploring Local Trails and Future Hiking Plans Keywords Calendar Year Triple Crown, thru-hiking, Yellow Deli cult, challenges, social aspect, camaraderie, hiking, Calendar Year Triple Crown, thru-hiking, Appalachian Trail, Pacific Crest Trail, Continental Divide Trail, weather conditions, wildlife, camaraderie, challenges, decision-making, law school, ultra running, international hiking, outdoors",
      "release": "2024-07-05T11:00:00Z",
      "duration": "00:50:33.9650000",
      "explicit": false,
      "spotifyId": "2WcFOGWTaCf90fhfnzK0QO",
      "appleId": 1000661233319,
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WcFOGWTaCf90fhfnzK0QO",
        "apple": "https://podcasts.apple.com/podcast/the-calendar-year-triple-crown-with-brandon-weis/id1746114870?i=1000661233319"
      }
    }
  ]
}