{
  "_ts": 0,
  "id": "433b73e5-e24d-439c-8695-4fada04c1c65",
  "name": "free audiobook",
  "youTubeChannelId": "UCPb3RoimTPKslRgg83mQ69A",
  "episodes": [
    {
      "id": "e2ec5f06-7ad2-4f20-a8ba-f2dd13742ef0",
      "title": "Daughter of Gloriavale: My Life in a Religious Cult by Lilia Tarawa",
      "description": "Please visit https://thebookvoice.com/podcasts/1/audiobook/553152 to listen full audiobooks.\nTitle: Daughter of Gloriavale: My Life in a Religious Cult\nAuthor: Lilia Tarawa\nNarrator: Sarah Mollo-Christensen\nFormat: Unabridged Audiobook\nLength: 9 hours 10 minutes\nRelease date: December 14, 2021\nRatings: Ratings of Book: 4.5 of Total 2 \n Ratings of Narrator: 5 of Total 1\nGenres: Memoirs\nPublisher\u0027s Summary: \nIn this personal account, Lilia Tarawa exposes the shocking secrets of the cult, with its rigid rules and oppressive control of women. She describes her fear when her family questioned Gloriavale\u0027s beliefs and practices. When her parents fled with their children, Lilia was forced to make a desperate choice: to stay or to leave. No matter what she chose, she would lose people she loved. In the outside world, Lilia struggled. Would she be damned to hell for leaving? How would she learn to navigate this strange place called \u0027the world\u0027? And would she ever find out the truth about the criminal convictions against her grandfather?",
      "release": "2024-12-09T23:43:35Z",
      "duration": "00:30:05",
      "explicit": false,
      "youTubeId": "GvAexE3h7EE",
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GvAexE3h7EE"
      }
    },
    {
      "id": "9d86aaa7-e1df-4957-a129-b300c4920a75",
      "title": "An Everyday Cult by Gerette Buglion",
      "description": "Please visit https://thebookvoice.com/podcasts/1/audiobook/576166 to listen full audiobooks.\nTitle: An Everyday Cult\nAuthor: Gerette Buglion\nNarrator: Gerette Buglion And Sarah Edmondson\nFormat: Unabridged Audiobook\nLength: 6 hours 59 minutes\nRelease date: January 19, 2022\nGenres: Memoirs\nPublisher\u0027s Summary: \nThis true-life story shows how the author\u0027s innocent quest for meaning is hijacked by a teacher who recognized her thirst for spiritual knowledge…awakening insight while simultaneously strangling her capacity for critical thinking. An Everyday Cult follows the arc of Buglion\u0027s journey through young motherhood into a group that welcomed her but also captured her mind, her heart, and her money. She shows us how a mind and psyche can be compromised by a controlling leader, using techniques that fly under the radar of human awareness—and she implores readers to wake up to these ever-present abuses of power. Gerette vividly describes a personal journey that became increasingly treacherous, culminating in tragedy. In the telling of her story, she exposes the impact of cultic manipulation on daily life. Written in an engaging, self-reflective style, rich with insight into techniques common to cults the world over, An Everyday Cult increases the listener’s understanding and awareness of destructive dynamics that just might be closer to home than anyone ever imagined. An Everyday Cult audio book is written and narrated by Gerette Buglion with a forward written and narrated by Sarah Edmondson, author of Scarred: the True Story of How I Escaped NXVIM, the Cult That Bound My Life.",
      "release": "2024-12-09T23:42:33Z",
      "duration": "00:05:05",
      "explicit": false,
      "youTubeId": "MxDg5tJ3ooE",
      "subjects": [
        "Center For Transformational Learning"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MxDg5tJ3ooE"
      }
    }
  ]
}