{
  "id": "0608d020-2935-42e5-a1c9-595905b89e42",
  "name": "Free Documentary",
  "youTubeChannelId": "UCijcd0GR0fkxCAZwkiuWqtQ",
  "episodes": [
    {
      "id": "a66a72ca-594b-4179-ab40-2b690ba03a53",
      "title": "The Most Controversial Millionaire Preacher in South Africa | Reggie Yates | Free Documentary",
      "description": "Reggie Yates’ Extreme - South Africa: The Millionaire Preacher \n\nReggie Yates’ Extreme - UK: Gay and Under Attack: https://youtu.be/Iw5wPzFCqVU\n\nSouth Africa is a country devoted to God. But forget priests and bishops, many people here go direct to a Prophet for their faith. Reggie is spending a week with one of the most controversial and colourful of them all- Prophet Mboro. \n\nMboro is adored by the thousands of followers in his megachurch and renowned as much for his wacky breakdancing as the ‘miracles’ he performs. It’s a crazy world of witchcraft, exorcisms and AK-47s, but even here can a multi-millionaire King of Bling with 30 flash cars really be a messenger from God? Reggie has already rejected a Pentecostal faith once in his life, and he’s soon determined to expose this showman ‘charlatan’. But the deeper Reggie digs, the more conflicted he becomes- until he starts to confront some truths much closer to home.\n▬▬▬▬▬▬▬▬▬\nSubscribe Free Documentary Channel for free: https://bit.ly/2YJ4XzQ\nInstagram: https://instagram.com/free.documentary/\nFacebook: https://bit.ly/2QfRxbG\nTwitter: https://bit.ly/2QlwRiI\n▬▬▬▬▬▬▬▬▬\n#FreeDocumentary #Documentary #ReggieYates\n▬▬▬▬▬▬▬▬▬\nFree Documentary is dedicated to bringing high-class documentaries to you on YouTube for free. With the latest camera equipment used by well-known filmmakers working for famous production studios. You will see fascinating shots from the deep seas and up in the air, capturing great stories and pictures from everything our beautiful and interesting planet has to offer. \n\nEnjoy stories about nature, wildlife, culture, people, history and more to come.",
      "release": "2023-02-12T14:00:58Z",
      "duration": "00:49:58",
      "explicit": false,
      "youTubeId": "HWdLnvgkqJ4",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HWdLnvgkqJ4"
      }
    }
  ]
}