{
  "id": "7bc22ad4-c8da-477d-9d73-c8e7a93db84c",
  "name": "Free Documentary - History",
  "youTubeChannelId": "UCsgPO6cNV0wBG-Og3bUZoFA",
  "episodes": [
    {
      "id": "52840ee4-73af-4190-8275-62c1920fdb60",
      "title": "Jonestown - The Terrible Fate of the People\u0027s Temple | Free Documentary History",
      "description": "Jonestown: Paradise Lost | History Documentary \n\nWatch \u0027Operation Thunderbolt: The Raid on Entebbe\u0027 here: https://youtu.be/SWhCg49zm64\n\nThis documentary delves into the final chapters of the Peoples Temple saga in Jonestown, Guyana. Through a combination of survivor testimonials and dramatic reenactments, it portrays the escalating paranoia and erratic behavior of Reverend Jim Jones as internal and external pressures mount. Congressman Leo Ryan\u0027s insistence on visiting triggers a tense standoff as Jones vacillates between allowing and resisting the visit. Unexpected defections during the visit catch Jones off guard, prompting drastic actions. In the end over 900 individuals, including men, women, and children, found themselves entangled in a web of manipulation and coercion, ultimately resulting in a devastating loss of life.\n\n▬▬▬▬▬▬▬▬▬\n\nSubscribe Free Documentary - History Channel for free: https://bit.ly/2FjRPgV\nFacebook: https://bit.ly/2QfRxbG\nTwitter: https://bit.ly/2QlwRiI\n\n▬▬▬▬▬▬▬▬▬\n#FreeDocumentary #Documentary #History \n▬▬▬▬▬▬▬▬▬\n\nFree Documentary - History is dedicated to bringing high-class documentaries to you on YouTube for free. You will see fascinating animations showing the past from a new perspective and explanations by renowned historians that make history come alive.\n\nEnjoy stories about people and events that formed the world we live in.",
      "release": "2024-05-03T22:00:34Z",
      "duration": "01:40:06",
      "explicit": false,
      "youTubeId": "qx5PadQkuOk",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qx5PadQkuOk"
      }
    }
  ]
}