{
  "id": "5cba1ea2-ea40-4cd2-ad61-203073f4d269",
  "name": "Fresh Hell Podcast",
  "spotifyId": "5vXOKSEl2fZnC79GUJKNRD",
  "appleId": 1456161753,
  "youTubeChannelId": "UCL2p6FXYitYrHda_3pWpUbA",
  "episodes": [
    {
      "id": "271c70a9-3067-4e70-ae2b-6cf746a6a493",
      "title": "E246: Jim Jones \u0026 the Peoples Temple (part IV)",
      "description": "From Guyana to Tragedy – The Fall of Jonestown In this final episode, we follow Jim Jones and the Peoples Temple from their initial move to Guyana to the harrowing events that culminated in the Jonestown massacre. Discover the challenges of life in the isolated settlement, the increasing paranoia and control exerted by Jones, and the tragic visit by Congressman Leo Ryan. This episode captures the final, tragic chapter of Jonestown and its devastating impact. Jim Jones, Peoples Temple, Jonestown massacre, Guyana, Leo Ryan, cult tragedy, mass suicide, Jonestown settlement, final days, isolation, control, paranoia, Congressman visit, 1978 tragedy, cult leader, communal living, historical events, true crime.",
      "release": "2024-07-12T12:28:23Z",
      "duration": "01:04:14.9030000",
      "explicit": false,
      "spotifyId": "3kHorg8O9UfjWiOfkFi0T0",
      "appleId": 1000662025120,
      "youTubeId": "0rTNEMZ7f28",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3kHorg8O9UfjWiOfkFi0T0",
        "apple": "https://podcasts.apple.com/podcast/e246-jim-jones-the-peoples-temple-part-iv/id1456161753?i=1000662025120",
        "youtube": "https://www.youtube.com/watch?v=0rTNEMZ7f28"
      }
    },
    {
      "id": "9bae3d69-ab24-483b-8956-29fd11a0fb6e",
      "title": "E245: Jim Jones \u0026 the Peoples Temple (part III)",
      "description": "The 1970s – Allegations, Media Scrutiny, and the Move to Guyana In the 1970s, Jim Jones and the Peoples Temple faced escalating allegations of abuse and manipulation. As media scrutiny intensified, Jones leased land in Guyana to create Jonestown, a supposed utopian society. This episode explores the controversial move to South America and the beginning of life in Jonestown, setting the stage for future events. Keywords: Jim Jones, Peoples Temple, Jonestown, 1970s, Guyana, media scrutiny, allegations, abuse, manipulation, utopian society, communal living, relocation, social justice, cult, investigative journalism, jungle settlement.",
      "release": "2024-07-05T13:03:49Z",
      "duration": "00:52:28.8180000",
      "explicit": false,
      "spotifyId": "5AONBfsg2fj4VjXz9BYh1G",
      "appleId": 1000661243365,
      "youTubeId": "aS52VbP2q6Y",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5AONBfsg2fj4VjXz9BYh1G",
        "apple": "https://podcasts.apple.com/podcast/e245-jim-jones-the-peoples-temple-part-iii/id1456161753?i=1000661243365",
        "youtube": "https://www.youtube.com/watch?v=aS52VbP2q6Y"
      }
    },
    {
      "id": "42246061-2cd7-4d68-8b26-22f66ab4e099",
      "title": "E244: Jim Jones \u0026 the Peoples Temple (art II)",
      "description": "Jim Jones\u0027 Path to Guyana:\nIn this episode, we continue the story of Jim Jones, focusing on the pivotal years from his meeting with his future wife, Marceline, to the scandalous sexual assault allegations in the 1970s that precipitated the move to Guyana. Discover how Jones\u0027 marriage influenced his burgeoning ministry, his founding of the Peoples Temple, and the expansion of his influence. We\u0027ll delve into the dark and controversial aspects of his leadership, including the manipulative tactics he used to maintain control over his followers and the allegations that threatened to unravel his carefully constructed world. Join us as we trace the rise and fall of Jim Jones, leading up to the dramatic exodus to the remote jungle of Guyana.\nJim Jones, Peoples Temple, Jonestown Massacre, Jim Jones wife Marceline, Jim Jones marriage, sexual assault allegations, move to Guyana, cult leader, charismatic preacher, religious cult, 1970s scandals, Peoples Temple history, true crime, cult manipulation, leadership tactics, Guyana exodus, Jim Jones controversy, rise and fall, cult dynamics, biography, podcast episode, religious movements, Jim Jones scandals, cult control",
      "release": "2024-06-28T12:51:38Z",
      "duration": "00:57:33",
      "explicit": false,
      "spotifyId": "54MIL4C34ytX3feLD2w7xg",
      "appleId": 1000660546881,
      "youTubeId": "lUjxWVsqerY",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/54MIL4C34ytX3feLD2w7xg",
        "apple": "https://podcasts.apple.com/podcast/e244-jim-jones-the-peoples-temple-part-ii/id1456161753?i=1000660546881",
        "youtube": "https://www.youtube.com/watch?v=lUjxWVsqerY"
      }
    },
    {
      "id": "fbf4dce7-8d23-4555-9c14-29eb7914d1bb",
      "title": "E243: Jim Jones \u0026 and the Peoples temple",
      "description": "The Making of a Cult Leader: Jim Jones\u0027 Early Years\u0022\nIn this episode, we delve into the early life of Jim Jones, the leader of the Peoples Temple. Join us as we explore his childhood in rural Indiana, the influence of his parents, and the formative experiences that shaped his path. From his upbringing and early fascination with religion and social issues to his high school years and burgeoning leadership skills, we\u0027ll uncover the roots of a his personality.\nTune in for an in-depth look at the childhood and upbringing of Jim Jones, shedding light on the factors that influenced his journey from a small-town boy to a charismatic and dangerous cult leader.\n\n\nJim Jones, Peoples Temple, Jonestown Massacre, Jim Jones childhood, Jim Jones upbringing, cult leader, rural Indiana, Jim Jones parents, high school, early life, charismatic leader, religious influence, social issues, 20th century history, biography, true crime, cult history, podcast episode, formative years, Jim Jones education.",
      "release": "2024-06-23T08:41:39Z",
      "duration": "00:49:09",
      "explicit": false,
      "spotifyId": "7L4czX2GL1lC0Bfq71TCzV",
      "appleId": 1000659724162,
      "youTubeId": "w144TuxwNls",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7L4czX2GL1lC0Bfq71TCzV",
        "apple": "https://podcasts.apple.com/podcast/e243-jim-jones-and-the-peoples-temple-part-i/id1456161753?i=1000659724162",
        "youtube": "https://www.youtube.com/watch?v=w144TuxwNls"
      }
    }
  ]
}