{
  "id": "aae947b7-b64b-428f-a4ac-a4ed00e357a4",
  "name": "Frieda Vizel",
  "youTubeChannelId": "UCD2OaOinKRQMK4dclGOw4QA",
  "episodes": [
    {
      "id": "027fb71d-c33f-418f-9c2e-5a8b085201a6",
      "title": "Living and leaving Jehova\u0027s Witness | Miriam Vidal",
      "description": "In this interview, I speak with Miriam Vidal about her childhood growing up as a Jehovah’s Witness, and her eventual decision to leave the faith.\n\nAs a Hasidic child growing up in Kiryas Joel, there was a strange building behind my house that we simply called “the church.” Every Saturday, rows of cars would pull up, and we kids would stand by the gate, watching and waving. Only years later, after I had left my own religious community, did I learn that this building was actually a Jehovah’s Witness Kingdom Hall.\n\nMiriam was one of the people attending services there.\n\nIn this conversation, Miriam shares what it was like to grow up inside the Jehovah’s Witness community: the rules, the rhythms of daily life, the sense of belonging, and the limitations placed on childhood, education, and social life. We talk about her memories of the Kingdom Hall in Kiryas Joel, the wider culture of Jehovah’s Witnesses, and what it meant; emotionally and psychologicall... to leave such a structured religious world.\n\nThis interview is also about what comes after leaving: identity, belief, grief, freedom, and the slow work of figuring out who you are when the framework you grew up in falls away.\n\nAs someone deeply interested in religious subcultures, exit narratives, and the sociology of faith, this conversation felt especially meaningful.... almost like closing a loop that began when I was a child in my Shabbos dress, waving at strangers I didn’t yet understand.\n\nTopics we cover include:\n-Growing up as a Jehovah’s Witness\n-Family life, schooling, holidays, and missionizing\n-The Kingdom Hall in Kiryas Joel and Miriam’s memories of it\n-Community, ritual, and belonging\n-Leaving a high-control religious environment\n-The emotional and psychological impact of exiting\n-Spiritual life and identity after leaving\n-Reflections on religion, culture, and comparison with other faith communities\n\nWant more? Watch my video about the Jehovah\u0027s Witness Church in Kiryas Joel\nhttps://youtu.be/naUJMITJ5sY\n\nIf you prefer reading to listening, here\u0027s the original blog post:\nhttps://friedavizel.com/2014/06/06/a-church-in-kiryas-joel/\n\nWatch my interview with Martha Ross, who left the Amish:\nhttps://youtu.be/teadpfXWCO4\n\nMy own recounting of what it\u0027s like to grow up in Kiryas Joel\nhttps://youtu.be/uHu_17N9GdE\n\nThe story of Anna Shternshis:\nhttps://youtu.be/hKN0_75EuqE\n\nStay tuned for more stories of subcultures and religious groups.",
      "release": "2026-02-15T12:00:06Z",
      "duration": "01:04:32",
      "explicit": false,
      "youTubeId": "2iPiYwftPyg",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2iPiYwftPyg"
      }
    },
    {
      "id": "b733af18-9339-48a9-9f51-4e67781c9495",
      "title": "A Jehova\u0027s Witness church INSIDE the Jewish village Kiryas Joel!",
      "description": "In my view, an amazing story that many of you young \u0027ons of \u0022PALM TREE TOWN\u0022 don\u0027t even know. I feel with this reading especially like I\u0027m the old guard of this young village! It\u0027s such a young population that I\u0027m really among the elders now, and so preserving history and keeping it remembered is so important. I\u0027m looking for people either from KJ or JW who are willing to record their oral histories on this for my channel. Reach out if this is you!",
      "release": "2026-01-21T12:01:30Z",
      "duration": "00:44:04",
      "explicit": false,
      "youTubeId": "naUJMITJ5sY",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=naUJMITJ5sY"
      }
    },
    {
      "id": "942191f7-aa9b-400f-8367-d925e5c13c86",
      "title": "She refused to shave her head and become Satmar | 90 year old Nelly\u0027s story",
      "description": "In today’s video, I’m honored to share with you the remarkable story of Nelly Grussgott. This footage was originally filmed on August 12, 2020—long before I had a YouTube channel. It was part of a project by filmmaker Pearl Gluck, conducted for a documentary she was making with scholar Naomi Seidman about the Bais Yaakov girls\u0027 school movement. Naomi invited me to assist with the interview, and I was there in the room when it was recorded. To get updates on the Documentary, see Palinka Pictures:\nhttps://palinkapictures.com/\n\nFrom the moment I met Nelly, I was completely taken by her. Her life story is one of immense pain and breathtaking resilience—a testimony to survival, transformation, and spirit. Just days after the interview, Nelly made Aliya—she moved to Israel—at the age of 90. We stayed in touch, and I even interviewed her again via Zoom for this channel. But this original interview, which has always felt so precious to me, was never publicly shared until now. With the blessing of Pearl and Naomi, I’ve edited it down and am releasing it here to preserve her memory and her voice for posterity.\n\nAs of today, Nelly Grussgott is 95 years old—bless her soul, may she live to 120.\n\nBorn in Berlin, Germany, in 1930, Nelly witnessed Kristallnacht as a young child. Her early childhood was comfortable—charmed, even—growing up as an only child in a pampered, middle-class Orthodox Jewish home. Her parents were not German-born: her mother, from Czechoslovakia, moved to Berlin at 24 and became successful in the rags/textile business. Her father was Hungarian, and both were deeply religious. Due to the hostility towards Orthodox Jews in Berlin, they adapted to a modern Orthodox lifestyle.\n\nIn 1937, Nelly’s father went to the United States to secure affidavits to bring his family to safety. He succeeded—but history intervened cruelly. While her father was still away, Nelly and her mother were forced out of their home and into an overcrowded apartment with five other Jewish families. One night, Nazi soldiers raided the apartment and took the men at gunpoint. Days later, ashes were returned to their wives in the mail.\n\nIn a desperate move, Nelly’s father returned to Europe in 1938—traveling to Belgium to reunite the family. It proved to be a devastating mistake. Nelly and her mother, Czechoslovakian citizens, were able to emigrate to the U.S. at the very last moment, getting papers as I understand it in late 1939 but actually coming \u0022in the last hour\u0022 in Frebruary 1940. But because her father was Hungarian, and the Hungarian quota was closed, he remained trapped in Europe. His letters continued for several years, growing more despondent until, in 1942, they stopped entirely.\n\nIn 1995, the Red Cross confirmed the fate the family had long feared: Nelly’s father was deported to Majdanek, then to Sobibor in March 1943, where he was murdered, along with many relatives.\n\nNelly’s mother eventually remarried in America, joining with a Satmar Hasid who had also survived great loss. She thrived in Williamsburg, Brooklyn—especially enjoying her later years on Lee Avenue, surrounded by familiar faces and warm greetings. Nelly herself chose a different path, remaining Orthodox but not Hasidic, and went on to raise a mainstream Orthodox family.\n\nI’m deeply grateful to finally bring this interview to light. May Nelly’s story reach far and wide—and may we never forget.",
      "release": "2025-09-21T11:01:39Z",
      "duration": "00:41:31",
      "explicit": false,
      "youTubeId": "z-1VLxn3gZY",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z-1VLxn3gZY"
      }
    },
    {
      "id": "1502e0fa-4598-4fcd-aa07-45f72a0a4e1a",
      "title": "A visually impaired Hasidic woman tells her story | Rochel Bodek",
      "description": "Please support Rochel Yenty Bodek\u0027s wonderful work by donating: https://insightbeyondeyesight.org/donate\n\nRochel Yenty Bodek is a Hasidic woman who lost her sight as a young woman due to a genetic condition. She has faced tremendous challenges as a wife and mother in the Hasidic community and has risen to the challenge with tremendous resilience. In this interview she talks with a lot of candor about the challenges and strengths of the Hasidic community and how she approaches her disability in this realm.\n\nIf you appreciate my work and think it\u0027s important, please consider financially supporting it by becoming a channel member or sending a donation. It takes a team of multiple people to make this channel run and your support means so much.",
      "release": "2025-03-23T11:00:02Z",
      "duration": "00:59:13",
      "explicit": false,
      "youTubeId": "28lP8j8swA0",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=28lP8j8swA0"
      }
    },
    {
      "id": "d8b5e93d-75a1-46c5-a7dd-18b8c7a5be33",
      "title": "A Yiddish theater revolution by Hasidic men | Ari Abromowitz",
      "description": "There\u0027s a whole emerging world of Hasidic theater, acted by men, and including a cast and stories of men only. This has been a tiny element of the Hasidic world for years - it definitely wasn\u0027t a viable career for anyone until recently. In recent years, the Hasidic theater scene has exploded. So much talent is coming to the fore. It was so much my pleasure to talk to Ari (Arye) Abromowitz, who is a veteran of this scene, who has been there from the beginning of this \u0022revolution\u0022 and has been in many ways its face as he acted in many productions. I learned so much about this arts scene from Ari and this was just the tip of the iceberg.\n\nLink to Ari and Friends: https://mostlymusic.com/products/ari-friends-season-1-episode-1-video\n\nEdited by Lee Korak / https://leekorak.site/",
      "release": "2025-03-09T11:01:05Z",
      "duration": "00:55:17",
      "explicit": false,
      "youTubeId": "pVfY5wZlPec",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pVfY5wZlPec"
      }
    },
    {
      "id": "cbebb528-2566-45df-944c-29fc2b85d25f",
      "title": "Netflix Unorthodox Short | Ex-Hasidic woman reacts",
      "description": "Netflix\u0027s show Unorthodox is probably the single most known piece of information about Hasidic Jews. The show was a huge hit and many people learned about Hasidim through the show. This short video summarizes the show. In this reaction video, I give my uncensored, unscripted, unprepared reactions to the show. If you love the show and didn\u0027t want to hear any critical comments... I\u0027m sorry... These are my strongly felt views.\n\nThis video is hardly my most well thought out commentary on the Netflix show Unorthodox. If you\u0027d like to learn more about why I think this show is problematic, please check out my blog posts that I wrote at the time the show first aired.\n\nhttps://friedavizel.com/2020/03/28/sorta-live-tweeting-watching-unorthodox/\n\nhttps://friedavizel.com/2020/04/05/why-i-believe-its-important-to-criticize-shows-like-unorthodox/",
      "release": "2025-02-02T12:00:59Z",
      "duration": "00:13:45",
      "explicit": false,
      "youTubeId": "prkjcPOZ6YU",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=prkjcPOZ6YU"
      }
    },
    {
      "id": "66ab0e76-075e-40e3-b1a1-fb5125a95c88",
      "title": "The side of ultra-orthodox women you don’t see on TV | In conversation with Raizy Fried",
      "description": "In my work documenting the Hasidic community, I\u0027ve gone to great lengths to bring out of the shadows the story of women in this world and their voices. It has been incredibly difficult, as much of the female sphere is modesty and behind a curtain. Still, I\u0027ve felt it\u0027s important to share this world with you all, as I feel that otherwise, the female experience is invisible, as if erased, out of sight and out of mind. So it\u0027s a great honor for me that the first Hasidic \u0022star\u0022 that I interviewed is a woman. I\u0027ve approached several men, but they were apprehensive. I hope to speak to them one day, but for now, this is my discussion with the lovely Raizy Fried from Inspired Living.\n\nPlease check out Raizy\u0027s website at raizyfried.com",
      "release": "2024-10-06T00:00:33Z",
      "duration": "00:51:08",
      "explicit": false,
      "youTubeId": "oycLsS4ulyg",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oycLsS4ulyg"
      }
    },
    {
      "id": "19280f7a-ed47-425c-b834-314cedba2dbd",
      "title": "A very personal journey to the Catskills as an ex-Orthodox Jewish woman",
      "description": "A special thanks to my channel members who support my work. It means a lot to me!\n\nA trip to my home town the Hasidic village of Kiryas Joel, and then to the Catskills mountains, brings up for me strong feelings about my life journey. In this video essay, I open up about what it means to me to be Jewish as an ex-Hasidic woman and how I grapple with my journey.\n\nMany thanks to the anonymous sponsor  לכבוד\nלײבל, שײנדל און טײַבל\n\nA sponsorship was given in memory of George Myers and Maxine Myers. May their memory be a blessing.\n\nMany thanks to Janice Ross for her support of this project.\n\nMany thanks to @shootitsteve for the beautiful edit as well as @shub for the support with this video.",
      "release": "2024-08-18T13:00:00Z",
      "duration": "00:20:42",
      "explicit": false,
      "youTubeId": "-JzYNs1HfLY",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-JzYNs1HfLY"
      }
    },
    {
      "id": "0bb1cca7-3231-4d2d-af25-146fda10f50b",
      "title": "Why do we love to talk about Cults and Subcultures? | In Conversation with Guinevere Turner",
      "description": "Closed religious communities are the subject of great, lurid fascination. I know this very well because I come from the Hasidic community. People love to hear the stories of the unusual customs and darker sides. For instance, Youtube is full of channels that tell ex-Hasidic, ex-Mormon, ex-Amish and ex-Cult stories and these videos draw hundreds of thousands of views. \n\nGuinevere Turner grew up in a cult. In the Lyman Family cult. Is it a cult? Is it a commune? It\u0027s all up for discussion!\n\nWhat\u0027s unique about her is that she doesn\u0027t give the audience the lurid story they want. She also has written about how cults are talked about in the larger society. Her essay in the New Yorker, \u0027My Childhood in a Cult\u0027, influenced my own writing, \u0027Is the Hasidic Community A Cult?\u0027 She also published a book about her life, \u0027When the World Didn\u0027t End.\u0027 \n\nIn this episode, Guinevere joins me to discuss our experiences as women with life stories that draw so much fascination. We talk about why we think the world wants our stories, and why we might not want to give them up. We discuss the Lyman family cult and other groups that are perhaps communes, perhaps cults. A discussion that touches the tip of the iceberg!\n\nLinks are here: \nGuinevere\u0027s memoir: https://www.amazon.com/When-World-Didnt-End-Memoir/dp/0593237595\nEssay in the New Yorker: https://www.newyorker.com/magazine/2019/05/06/my-childhood-in-a-cult\nGuinevere on instagram: https://www.instagram.com/guinevereturner/\nMy essay titled \u0027Is the Hasidic Community a Cult?\u0027: https://friedavizel.com/2020/01/29/is-the-hasidic-community-a-cult/",
      "release": "2024-04-07T13:00:05Z",
      "duration": "01:20:21",
      "explicit": false,
      "youTubeId": "S2LMqtNjg6c",
      "subjects": [
        "The Lyman Family",
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S2LMqtNjg6c"
      }
    },
    {
      "id": "6cb117ba-167c-47a7-ad86-13db310d27ca",
      "title": "An Introduction to Hasidic Judaism and the Sects",
      "description": "Not all Hasidic groups are the same!\n\nThere are many different groups, and in this video I explain what the sects are.\n\nI draw heavily from the book ‘Hasidism, A New History’ which you can purchase here:\nhttps://amzn.to/3SblXwQ\n\n\n\nThis video might be a bit nerdy, but if you stick with it for the 12 minutes you will get a very good primer on Hasidic Judaism and what the sects are.\n\nThe video assumes you have no knowledge about Hasidic Judaism. If you know nothing or a little bit, or even a lot, here\u0027s a video that clears up the basic story of Hasidic Judaism. \n\nIt answer the foundational questions: \nWhat is Hasidic Judaism? \nAnd what do we mean by Hasidic sects? \n\nNot all Hasidic Jews are the same, and this video will help you start to understand some of its history and distinguishments. It will also help you make sense of my work on my channel, which covers only really Hungarian sects.\n\nThe book referenced in this video is ‘Hasidism, A New History’",
      "release": "2024-03-03T15:51:37Z",
      "duration": "00:12:50",
      "explicit": false,
      "youTubeId": "ywWcEMPALlM",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ywWcEMPALlM"
      }
    },
    {
      "id": "bdcd2e68-ca22-436b-b1d1-6e3e0d8c7996",
      "title": "The Rules for Satmar Hasidic Girls | Part 2: On vacation, clothing, technology, and more",
      "description": "What are the rules of expectation for Satmar Hasidic girls?\n\nThe insular Hasidic school publishes many rules in a pretty little book titled \u0027In a Gita Shu\u0027. In this Video, upon request, I will go through the rules for you. You\u0027ll see that there are many different rules, from rules about how to dress at weddings to rules about lice in schools. Some will find these rules draconian, some will find it exotic, and some will find it charming. My goal is simply to educate.  I often stay away from covering such topics because people are so quick to rush to judgment, but I hope you\u0027ll bring some patience and open curiosity to this video.\n\nFor the first part of this book, see this link:\nhttps://youtu.be/jkm-eab7QEM?si=-Ct6tiz3PyQMB8VD\n\n0:00 Recap Part1\n1:50 Rules of recess snacks\n6:12 Lice\n13:03 Against long robes\n17:05 Against the music scene\n24:00 Against the eruv\n29:13 Against Florida\n31:47 Against conference calls, hotlines\n38:20 Against going out at night\n41:38 Rules for weddings\n44:06 Against forbidden reading material\n47:40 Against college\n51:00 Against technologies\n\n#hasidiceducation\n#modesty \n#religiouswomen\n\nhttps://www.youtube.com/watch?v=SQ-oaSPueTk\u0026t",
      "release": "2023-12-24T15:00:30Z",
      "duration": "01:08:45",
      "explicit": false,
      "youTubeId": "Ru0t2JchFV0",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ru0t2JchFV0"
      }
    },
    {
      "id": "eeb5dc01-2b61-47d5-83df-454323de5fb7",
      "title": "The Rules for Satmar Hasidic Girls",
      "description": "The Satmar Hasidic girls school issues rules for its students. Here I go over the rule book with its many rules.\n\nNote: Part 2 is here: https://youtu.be/Ru0t2JchFV0?si=pV00-MosB0oqnK02\n\nWhat are the rules of expectation for Satmar Hasidic girls?\n\nIn my most recent documentary on Hasidim and the internet, I showed a few pages of the Satmar Girl\u0027s school rulebook. This is the rulebook that contains a great many rules that the school has for its students. Among them are rules on modesty, vacationing, technology, college education, and more. Some people asked to see more of it, so I am here sharing the first half. I hope to share the second half whenever I can.\n\n#hasidiceducation\n#modesty \n#religiouswomen\n\nhttps://www.youtube.com/watch?v=SQ-oaSPueTk\u0026t\nhttps://www.youtube.com/watch?v=Ru0t2JchFV0\u0026feature=youtu.be",
      "release": "2023-11-14T13:19:41Z",
      "duration": "00:42:40",
      "explicit": false,
      "youTubeId": "jkm-eab7QEM",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jkm-eab7QEM"
      }
    }
  ]
}