{
  "_ts": 0,
  "id": "a323c574-7302-4e7f-b02f-080bdfcfb6a0",
  "name": "Friendly Atheist",
  "youTubeChannelId": "UCsgjnUBCB9xbUXQfMg0pd8A",
  "episodes": [
    {
      "id": "45e1d9c5-7fb2-4916-92d1-5f9bf17d31f1",
      "title": "Interview with Sarah McCammon, author of \u0022The Exvangelicals\u0022",
      "description": "Sarah McCammon is a National Political Correspondent for NPR and cohost of The NPR Politics Podcast. Her new book is called \u0022The Exvangelicals: Loving, Living, and Leaving the White Evangelical Church.\u0022\r\n\r\nAffiliate link here: https://bit.ly/43N0y1W\r\n\r\nGrowing up in a deeply evangelical family in the Midwest in the ‘80s and ‘90s, Sarah McCammon was strictly taught to fear God, obey him, and not question the faith. Persistently worried that her gay grandfather would go to hell unless she could reach him, or that her Muslim friend would need to be converted, and that she, too, would go to hell if she did not believe fervently enough, McCammon was a rule-follower and—most of the time—a true believer. But through it all, she was increasingly plagued by fears and deep questions as the belief system she\u0027d been carefully taught clashed with her expanding understanding of the outside world.\r\n\r\nAfter spending her early adult life striving to make sense of an unraveling worldview, by her 30s, she found herself face-to-face with it once again as she covered the Trump campaign for NPR, where she witnessed first-hand the power and influence that evangelical Christian beliefs held on the political right.\r\n\r\nSarah also came to discover that she was not alone: she is among a rising generation of the children of evangelicalism who are growing up and fleeing the fold, who are thinking for themselves and deconstructing what feel like the “alternative facts” of their childhood.\r\n\r\nRigorously reported and deeply personal, The Exvangelicals is the story of the people who make up this generational tipping point, including Sarah herself. Part memoir, part investigative journalism, this is the first definitive book that names and describes the post-evangelical movement: identifying its origins, telling the stories of its members, and examining its vast cultural, social, and political impact.",
      "release": "2024-04-04T08:08:20Z",
      "duration": "00:56:40",
      "explicit": false,
      "youTubeId": "VE7xiaAngV0",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VE7xiaAngV0"
      }
    },
    {
      "id": "0b2f23e3-1953-417d-a022-6a0529b9ae4b",
      "title": "Interview with Jess Piper about the \u0022Fundie Baby Voice\u0022",
      "description": "After Senator Katie Britt\u0027s response to the State of the Union went viral for all the wrong reasons, Jess Piper wrote about how her voice was all too familiar. It had all the hallmarks of a \u0022well-practiced fundie baby voice.\u0022\r\n\r\nThat voice, famously used by Michelle Duggar and so many others, is a phenomenon worth exploring, and there\u0027s no one better than Jess to speak to about it. \r\n\r\nYou can read Jess\u0027 article here: https://jesspiper.substack.com/p/the-fundie-baby-voice",
      "release": "2024-03-19T03:56:38Z",
      "duration": "00:48:10",
      "explicit": false,
      "youTubeId": "vPVSwEg2mHk",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vPVSwEg2mHk"
      }
    },
    {
      "id": "2d91aa4f-1e6c-4db7-bf28-12f36235a50a",
      "title": "Norwegian court upholds ban on state funding for Jehovah\u0027s Witnesses (Livestream)",
      "description": "A Norwegian court upheld a decision to rescind the \u0022religious community\u0022 status of the Jehovah\u0027s Witnesses, a move that blocks the JWs from receiving taxpayer-funded subsidies and performing legal marriages. \n\nIt was the group\u0027s cult-like behavior that led to their punishment.\n\nThis is a clip from my recent livestream: \nhttps://youtu.be/VEv1WSoPokY\n\nThe article this is based on is here: \nhttps://www.friendlyatheist.com/p/norwegian-court-upholds-ban-on-state\n\nJoin my channel to get access to special perks!\nhttps://www.youtube.com/channel/UCsgjnUBCB9xbUXQfMg0pd8A/join\n\n✔ Please support what I do: https://www.patreon.com/hemant \n✔ You can also make a one-time donation here: https://paypal.me/FriendlyAtheist\n\n✔ Website: http://www.friendlyatheist.com/\n✔ Contact: Mpromptu@gmail.com\n✔ Twitter: https://twitter.com/HemantMehta\n✔ Podcast: https://podcasts.apple.com/us/podcast/friendly-atheist-podcast/id888637335\n✔ Instagram: https://instagram.com/friendly.atheist/\n✔ Facebook: https://www.facebook.com/friendlyatheist/\n✔ Amazon: https://amzn.to/2mMNzNs (My affiliate link)\n\nThank you to Yanely Del Rosario for providing captioning help!",
      "release": "2024-03-08T13:30:31Z",
      "duration": "00:19:32",
      "explicit": false,
      "youTubeId": "kr4prvTYyfo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kr4prvTYyfo"
      }
    },
    {
      "id": "c6ca4a26-e72b-4545-a463-14f4b4148863",
      "title": "A chat with Andrew Pledger, host of \u0022Surviving Bob Jones University: A Christian Cult\u0022",
      "description": "Andrew Pledger is a former student at Bob Jones University, a fundamentalist Christian school with a long and not-so-great history. He\u0027s also the host of a new podcast called Surviving Bob Jones University: A Christian Cult.\u0022 \r\n\r\nThe stories in that podcast are depressing as all hell but they\u0027re so important to hear if you want to get a real sense of what schools like these do to people.\r\n\r\nYou can listen to the podcast here: https://podcasts.apple.com/us/podcast/surviving-bob-jones-university-a-christian-cult/id1681943920",
      "release": "2023-09-21T07:21:28Z",
      "duration": "01:03:02",
      "explicit": false,
      "youTubeId": "UPMgpT1rM3E",
      "subjects": [
        "Bob Jones University",
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UPMgpT1rM3E"
      }
    }
  ]
}