{
  "_ts": 0,
  "id": "aae947b7-b64b-428f-a4ac-a4ed00e357a4",
  "name": "Frieda Vizel",
  "youTubeChannelId": "UCD2OaOinKRQMK4dclGOw4QA",
  "episodes": [
    {
      "id": "0bb1cca7-3231-4d2d-af25-146fda10f50b",
      "title": "Why do we love to talk about Cults and Subcultures? | In Conversation with Guinevere Turner",
      "description": "Closed religious communities are the subject of great, lurid fascination. I know this very well because I come from the Hasidic community. People love to hear the stories of the unusual customs and darker sides. For instance, Youtube is full of channels that tell ex-Hasidic, ex-Mormon, ex-Amish and ex-Cult stories and these videos draw hundreds of thousands of views. \n\nGuinevere Turner grew up in a cult. In the Lyman Family cult. Is it a cult? Is it a commune? It\u0027s all up for discussion!\n\nWhat\u0027s unique about her is that she doesn\u0027t give the audience the lurid story they want. She also has written about how cults are talked about in the larger society. Her essay in the New Yorker, \u0027My Childhood in a Cult\u0027, influenced my own writing, \u0027Is the Hasidic Community A Cult?\u0027 She also published a book about her life, \u0027When the World Didn\u0027t End.\u0027 \n\nIn this episode, Guinevere joins me to discuss our experiences as women with life stories that draw so much fascination. We talk about why we think the world wants our stories, and why we might not want to give them up. We discuss the Lyman family cult and other groups that are perhaps communes, perhaps cults. A discussion that touches the tip of the iceberg!\n\nLinks are here: \nGuinevere\u0027s memoir: https://www.amazon.com/When-World-Didnt-End-Memoir/dp/0593237595\nEssay in the New Yorker: https://www.newyorker.com/magazine/2019/05/06/my-childhood-in-a-cult\nGuinevere on instagram: https://www.instagram.com/guinevereturner/\nMy essay titled \u0027Is the Hasidic Community a Cult?\u0027: https://friedavizel.com/2020/01/29/is-the-hasidic-community-a-cult/",
      "release": "2024-04-07T13:00:05Z",
      "duration": "01:20:21",
      "explicit": false,
      "youTubeId": "S2LMqtNjg6c",
      "subjects": [
        "The Lyman Family",
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S2LMqtNjg6c"
      }
    }
  ]
}