{
  "_ts": 0,
  "id": "aae947b7-b64b-428f-a4ac-a4ed00e357a4",
  "name": "Frieda Vizel",
  "youTubeChannelId": "UCD2OaOinKRQMK4dclGOw4QA",
  "episodes": [
    {
      "id": "66ab0e76-075e-40e3-b1a1-fb5125a95c88",
      "title": "The side of ultra-orthodox women you don’t see on TV | In conversation with Raizy Fried",
      "description": "In my work documenting the Hasidic community, I\u0027ve gone to great lengths to bring out of the shadows the story of women in this world and their voices. It has been incredibly difficult, as much of the female sphere is modesty and behind a curtain. Still, I\u0027ve felt it\u0027s important to share this world with you all, as I feel that otherwise, the female experience is invisible, as if erased, out of sight and out of mind. So it\u0027s a great honor for me that the first Hasidic \u0022star\u0022 that I interviewed is a woman. I\u0027ve approached several men, but they were apprehensive. I hope to speak to them one day, but for now, this is my discussion with the lovely Raizy Fried from Inspired Living.\n\nPlease check out Raizy\u0027s website at raizyfried.com",
      "release": "2024-10-06T00:00:33Z",
      "duration": "00:51:08",
      "explicit": false,
      "youTubeId": "oycLsS4ulyg",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oycLsS4ulyg"
      }
    },
    {
      "id": "19280f7a-ed47-425c-b834-314cedba2dbd",
      "title": "A very personal journey to the Catskills as an ex-Orthodox Jewish woman",
      "description": "A special thanks to my channel members who support my work. It means a lot to me!\n\nA trip to my home town the Hasidic village of Kiryas Joel, and then to the Catskills mountains, brings up for me strong feelings about my life journey. In this video essay, I open up about what it means to me to be Jewish as an ex-Hasidic woman and how I grapple with my journey.\n\nMany thanks to the anonymous sponsor  לכבוד\nלײבל, שײנדל און טײַבל\n\nA sponsorship was given in memory of George Myers and Maxine Myers. May their memory be a blessing.\n\nMany thanks to Janice Ross for her support of this project.\n\nMany thanks to @shootitsteve for the beautiful edit as well as @shub for the support with this video.",
      "release": "2024-08-18T13:00:00Z",
      "duration": "00:20:42",
      "explicit": false,
      "youTubeId": "-JzYNs1HfLY",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-JzYNs1HfLY"
      }
    },
    {
      "id": "0bb1cca7-3231-4d2d-af25-146fda10f50b",
      "title": "Why do we love to talk about Cults and Subcultures? | In Conversation with Guinevere Turner",
      "description": "Closed religious communities are the subject of great, lurid fascination. I know this very well because I come from the Hasidic community. People love to hear the stories of the unusual customs and darker sides. For instance, Youtube is full of channels that tell ex-Hasidic, ex-Mormon, ex-Amish and ex-Cult stories and these videos draw hundreds of thousands of views. \n\nGuinevere Turner grew up in a cult. In the Lyman Family cult. Is it a cult? Is it a commune? It\u0027s all up for discussion!\n\nWhat\u0027s unique about her is that she doesn\u0027t give the audience the lurid story they want. She also has written about how cults are talked about in the larger society. Her essay in the New Yorker, \u0027My Childhood in a Cult\u0027, influenced my own writing, \u0027Is the Hasidic Community A Cult?\u0027 She also published a book about her life, \u0027When the World Didn\u0027t End.\u0027 \n\nIn this episode, Guinevere joins me to discuss our experiences as women with life stories that draw so much fascination. We talk about why we think the world wants our stories, and why we might not want to give them up. We discuss the Lyman family cult and other groups that are perhaps communes, perhaps cults. A discussion that touches the tip of the iceberg!\n\nLinks are here: \nGuinevere\u0027s memoir: https://www.amazon.com/When-World-Didnt-End-Memoir/dp/0593237595\nEssay in the New Yorker: https://www.newyorker.com/magazine/2019/05/06/my-childhood-in-a-cult\nGuinevere on instagram: https://www.instagram.com/guinevereturner/\nMy essay titled \u0027Is the Hasidic Community a Cult?\u0027: https://friedavizel.com/2020/01/29/is-the-hasidic-community-a-cult/",
      "release": "2024-04-07T13:00:05Z",
      "duration": "01:20:21",
      "explicit": false,
      "youTubeId": "S2LMqtNjg6c",
      "subjects": [
        "The Lyman Family",
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S2LMqtNjg6c"
      }
    },
    {
      "id": "6cb117ba-167c-47a7-ad86-13db310d27ca",
      "title": "An Introduction to Hasidic Judaism and the Sects",
      "description": "Not all Hasidic groups are the same!\n\nThere are many different groups, and in this video I explain what the sects are.\n\nI draw heavily from the book ‘Hasidism, A New History’ which you can purchase here:\nhttps://amzn.to/3SblXwQ\n\n\n\nThis video might be a bit nerdy, but if you stick with it for the 12 minutes you will get a very good primer on Hasidic Judaism and what the sects are.\n\nThe video assumes you have no knowledge about Hasidic Judaism. If you know nothing or a little bit, or even a lot, here\u0027s a video that clears up the basic story of Hasidic Judaism. \n\nIt answer the foundational questions: \nWhat is Hasidic Judaism? \nAnd what do we mean by Hasidic sects? \n\nNot all Hasidic Jews are the same, and this video will help you start to understand some of its history and distinguishments. It will also help you make sense of my work on my channel, which covers only really Hungarian sects.\n\nThe book referenced in this video is ‘Hasidism, A New History’",
      "release": "2024-03-03T15:51:37Z",
      "duration": "00:12:50",
      "explicit": false,
      "youTubeId": "ywWcEMPALlM",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ywWcEMPALlM"
      }
    },
    {
      "id": "bdcd2e68-ca22-436b-b1d1-6e3e0d8c7996",
      "title": "The Rules for Satmar Hasidic Girls | Part 2: On vacation, clothing, technology, and more",
      "description": "What are the rules of expectation for Satmar Hasidic girls?\n\nThe insular Hasidic school publishes many rules in a pretty little book titled \u0027In a Gita Shu\u0027. In this Video, upon request, I will go through the rules for you. You\u0027ll see that there are many different rules, from rules about how to dress at weddings to rules about lice in schools. Some will find these rules draconian, some will find it exotic, and some will find it charming. My goal is simply to educate.  I often stay away from covering such topics because people are so quick to rush to judgment, but I hope you\u0027ll bring some patience and open curiosity to this video.\n\nFor the first part of this book, see this link:\nhttps://youtu.be/jkm-eab7QEM?si=-Ct6tiz3PyQMB8VD\n\n0:00 Recap Part1\n1:50 Rules of recess snacks\n6:12 Lice\n13:03 Against long robes\n17:05 Against the music scene\n24:00 Against the eruv\n29:13 Against Florida\n31:47 Against conference calls, hotlines\n38:20 Against going out at night\n41:38 Rules for weddings\n44:06 Against forbidden reading material\n47:40 Against college\n51:00 Against technologies\n\n#hasidiceducation\n#modesty \n#religiouswomen\n\nhttps://www.youtube.com/watch?v=SQ-oaSPueTk\u0026t",
      "release": "2023-12-24T15:00:30Z",
      "duration": "01:08:45",
      "explicit": false,
      "youTubeId": "Ru0t2JchFV0",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ru0t2JchFV0"
      }
    },
    {
      "id": "eeb5dc01-2b61-47d5-83df-454323de5fb7",
      "title": "The Rules for Satmar Hasidic Girls",
      "description": "The Satmar Hasidic girls school issues rules for its students. Here I go over the rule book with its many rules.\n\nNote: Part 2 is here: https://youtu.be/Ru0t2JchFV0?si=pV00-MosB0oqnK02\n\nWhat are the rules of expectation for Satmar Hasidic girls?\n\nIn my most recent documentary on Hasidim and the internet, I showed a few pages of the Satmar Girl\u0027s school rulebook. This is the rulebook that contains a great many rules that the school has for its students. Among them are rules on modesty, vacationing, technology, college education, and more. Some people asked to see more of it, so I am here sharing the first half. I hope to share the second half whenever I can.\n\n#hasidiceducation\n#modesty \n#religiouswomen\n\nhttps://www.youtube.com/watch?v=SQ-oaSPueTk\u0026t\nhttps://www.youtube.com/watch?v=Ru0t2JchFV0\u0026feature=youtu.be",
      "release": "2023-11-14T13:19:41Z",
      "duration": "00:42:40",
      "explicit": false,
      "youTubeId": "jkm-eab7QEM",
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jkm-eab7QEM"
      }
    }
  ]
}