{
  "id": "a2d4cabe-e5c8-4354-bd24-f72ca4984098",
  "name": "Friends Who Crime",
  "spotifyId": "5b1FlnBWJufQ2DulFFXJcu",
  "appleId": 1793453842,
  "youTubeChannelId": "UCchxx217kReOiQcI0s73_Qw",
  "episodes": [
    {
      "id": "d82be21a-69a1-4a90-b4e0-677a83504512",
      "title": "Ep. 25: The Buddhafield Cult",
      "description": "I’m joined by my friend Andy—who you may remember from a previous episode—as we dive into the wild and disturbing story of the Buddhafield cult. Led by a Speedo-wearing ex-actor turned spiritual guru, this cult promised enlightenment but delivered manipulation, control, and secrecy. I’ll walk you through the timeline, share stories from former members, and dig into the psychology that keeps people trapped in groups like this. With Andy’s unique insight from his own experience growing up Mormon, we balance the dark with a little humor along the way. This one’s a wild ride—trust me. SOURCES Allen, Will, director. Holy Hell. The Film Collaborative, 2016. Blumenfeld, Paul. “The Buddhafield Cult and the Man Who Documented It.” The Atlantic, 29 May 2016, www.theatlantic.com/entertainment/archive/2016/05/holy-hell-will-allen-buddhafield-cult/484376/. Flynn, Meagan. “Buddhafield: Inside the Cult That Hid in Plain Sight in Austin.” Austin Monthly, 19 June 2020, www.austinmonthly.com/buddhafield-inside-the-cult-that-hid-in-plain-sight-in-austin/. Gupta, Prachi. “Inside the Strange, Sad World of Buddhafield, the Yoga Cult.” Cosmopolitan, 27 May 2016, www.cosmopolitan.com/lifestyle/news/a59242/holy-hell-documentary-buddhafield-cult/. Luscombe, Belinda. “The \u0027Holy Hell\u0027 Cult\u0027s Leader Is Still at It. Here\u0027s How to Spot a Cult.” Time, 27 May 2016, www.time.com/4352395/holy-hell-cult-documentary-sundance/. Rosen, Christopher. “Holy Hell Director Will Allen Talks About Escaping from a Cult and Sharing His Story.” Entertainment Weekly, 25 May 2016, www.ew.com/article/2016/05/25/holy-hell-director-will-allen-buddhafield/. Sloat, Sarah. “Inside the Cult at the Center of ‘Holy Hell.’” Inverse, 26 May 2016, www.inverse.com/article/15786-inside-the-cult-at-the-center-of-holy-hell. Weinman, Sarah. “The Cult Next Door.” BuzzFeed News, 2 June 2016, www.buzzfeednews.com/article/sarahweinman/the-cult-next-door.",
      "release": "2025-07-29T07:38:30Z",
      "duration": "00:47:08.3760000",
      "explicit": true,
      "spotifyId": "57QGf3FTpLgItBIOfc3JTi",
      "appleId": 1000719607179,
      "youTubeId": "kloK2h29dF0",
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/57QGf3FTpLgItBIOfc3JTi",
        "apple": "https://podcasts.apple.com/podcast/ep-25-the-buddhafield-cult/id1793453842?i=1000719607179",
        "youtube": "https://www.youtube.com/watch?v=kloK2h29dF0"
      }
    }
  ]
}