{
  "id": "7fbcafd1-06bd-46b5-857b-86eced1c5bdb",
  "name": "Fringe Field Notes",
  "youTubeChannelId": "UCsqSKiNenBh1o8OAYvrICIg",
  "episodes": [
    {
      "id": "351e906c-447a-41ce-9479-3ca95031880b",
      "title": "England’s Forgotten Doomsday Cult and The Quest to Save the World",
      "description": "In this video, we unravel the fascinating and largely forgotten history of the Panacea Society, a female-led millenarian movement that emerged in the early 20th century. It’s a mysterious and mystical tale, featuring prophetic visions, supernatural powers, and preparations for the end of the world.\nThe unusual domesday cult was led by the enchanting Mabel Barltrop - also known as Octavia - who claimed to channel messages from the divine. \n \n🔮 Join us as we explore:\n- The society\u0027s origins and connections to prophetess Joanna Southcott\n- The compelling mission to open a sealed box of prophecies and how it entangled with societal fears of impending apocalypse in a time of national crisis\n- The unique dynamics within a community of dedicated women who sought healing and salvation\n- The complexities of their bizarre practices, from divine healing powers to eccentric daily rules and instructions for how to live forever\n- The cultural context that might provide insight into their strange beliefs, such as the influences of World War I, Victorian Spiritualism, and Women’s Suffrage\n\nWhether you’re intrigued by the strange corners of history, mystical phenomena, cultural oddities, or untold stories of women in history, this journey into the Panacea Society reveals a captivating chapter marked by hope, ambition, and the allure of extraordinary beliefs in times of chaos.\n\nYou can decide if this is a story about feminist themes, supernatural encounters, or healing the world in an era of trauma.\n\n--------------\nChapters\n--------------\n00:00 Intro\n00:48 Panacea Society Origins \u0026 Joanna Southcott \n05:14 The Sealed Box of Prophecies\n06:37 Healing Ministry \n07:38 The Darker Sides of Society Life\n10:17 The Role of Mental Illness \n12:21 The Influence of Victorian Spiritualism \n13:55 Healing From Trauma (World Wars \u0026 Spanish Flu)\n15:27 Female Empowerment \n17:33 Then and Now\n\n-------------------\nAttributions\n-------------------\nSources:\n‘Octavia, Daughter of God: The Story of a Female Messiah and her Followers’ by Jane Shaw\n\nImages:\n‘Bundesarchiv Bild 101I-646-5188-17, Flugzeuge Junkers Ju 87.jpg’, Bundesarchiv, Bild 101I-646-5188-17 / Opitz / CC-BY-SA 3.0, CC BY-SA 3.0 DE, via Wikimedia Commons\n‘File:Bundesarchiv Bild 102-09042, Genf, Völkerbund, Sitzungssaal.jpg’, Bundesarchiv, Bild 102-09042 / CC-BY-SA 3.0, CC BY-SA 3.0 DE, via Wikimedia Commons\n‘File:Jan Luyken\u0027s Jesus 14. Healing of a Man Born Blind. Phillip Medhurst Collection.jpg’, Phillip Medhurst, CC BY-SA 3.0, via Wikimedia Commons\n‘Great Ouse at Town Bridge, Bedford.jpg’, Richard Kelly, CC BY-SA 4.0, via Wikimedia Commons\n‘Jan Luyken\u0027s Jesus 33. Last Judgement. Phillip Medhurst Collection.jpg’, Phillip Medhurst, CC BY-SA 3.0, via Wikimedia Commons\n‘Joanna Southcott’s box.jpg’, A Friend of the Folklore Society, CC BY-SA 4.0, via Wikimedia Commons\n‘Joanna Southcott\u0027s Box - The Panacea Museum, Bedford.jpg’, Alan Denney, CC BY 2.0, via Wikimedia Commons\n‘North-west front of the Asylum near Arsley, Bedfordshire. Wellcome L0004794.jpg’, The Illustrated London News, CC BY 4.0, via Wikimedia Commons\n‘Paul Thomas post consecration.jpg’, KHardie1906, CC BY-SA 4.0, via Wikimedia Commons\n‘Religious melancholy\u0027 Wellcome L0022592.jpg’, Wellcome Collection, CC BY 4.0, via Wikimedia Commons\n‘Shiloh\u0027s crib.jpg’, John Fairburn, CC BY-SA 2.0 DE, via Wikimedia Commons",
      "release": "2025-09-20T09:57:18Z",
      "duration": "00:20:23",
      "explicit": false,
      "youTubeId": "58LuQZ-qQkA",
      "subjects": [
        "Panacea Society",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=58LuQZ-qQkA"
      }
    }
  ]
}