{
  "id": "16a1b303-ca20-47d9-83e5-e42be4c539ff",
  "name": "From Now On",
  "spotifyId": "1vOhoPrOkwIyCNApzsBlF8",
  "appleId": 1766405014,
  "youTubeChannelId": "UCHKwmUQXbKa2bs7qYmlfkNQ",
  "episodes": [
    {
      "id": "cfc76efb-f68b-4722-b98f-72f2f470c790",
      "title": "THE MARTIAL ARTIST: Surviving a cult of control to teaching TRUE self-defense",
      "description": "We step into the martial arts world, a space built on honor and discipline, yet often hiding a darker reality of manipulation and exploitation. Lisa welcomes Elicia Ybarra, a lifelong martial artist and dedicated women’s self-defense instructor, who transformed her own experience of abuse within the industry into a mission to uplift others. Elicia shares how martial arts became her escape from a chaotic, abusive childhood, only to later confront betrayal and harm by those in positions of power. Together, Lisa and Elicia expose how the martial arts community’s strict hierarchies and culture of silence protect abusers and isolate survivors, leaving many trapped in cycles of shame and disbelief. This episode is about more than exposing a broken system; it’s about reclaiming martial arts as a tool for true empowerment. Elicia’s story is one of resilience, teaching that real self-defense starts with permission: to trust your instincts, set boundaries, and speak out. Lisa and Elicia call for a new vision of martial arts, one that builds women up, not breaks them down, and urge listeners to support survivors with empathy and action, not judgment or blame. If you’ve ever wondered how to turn survival into strength or how to make martial arts a place of real empowerment, this conversation is for you. About Elicia Ybarra: Elicia is a lifelong martial artist with over two decades of martial arts experience, including a 4th dan black belt in Taekwondo and a 1st dan black belt in Hapkido. As the founder of Pretty Hands, Hard Punches, Elicia uses her own experiences overcoming abuse and exploitation within the martial arts industry to teach women practical self-defense techniques, boundary-setting, and how to recognize and stand against abuse. Her unique approach combines technical skill, emotional intelligence, and empowerment to help women build physical and mental strength. Follow Elicia @prettyhandshardpunches on Instagram , TikTok , Facebook , LinkedIn and YouTube . To learn more about her services and classes go to prettyhandshardpunches.com . Elicia is offering to guides for From Now On audience. Boundaries \u0026 Bravery: Self-Defense Strategies for Women Everywhere Guide - use Promocode: FromNowOn to access it for free. Creating the Ideal You Guide - use Promocode: IdealYou to access it for free. From Now On is produced by LA PHILLIPS MEDIA. Listen and follow on Apple Podcasts , Spotify , and YouTube . Have a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials. If today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below: If you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673) If you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree). PAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. \u0026#xfeff;Speak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other.",
      "release": "2025-05-08T12:45:00Z",
      "duration": "01:43:54.0170000",
      "explicit": true,
      "spotifyId": "0zEXpBMvEjc3v529oJaAJB",
      "appleId": 1000706803227,
      "youTubeId": "ynunIIqaxYY",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0zEXpBMvEjc3v529oJaAJB",
        "apple": "https://podcasts.apple.com/podcast/the-martial-artist-surviving-a-cult-of-control/id1766405014?i=1000706803227",
        "youtube": "https://www.youtube.com/watch?v=ynunIIqaxYY"
      }
    },
    {
      "id": "c968fe3f-fda2-4eb3-9451-64a23a7da977",
      "title": "THE NARCISSIST: Trapped in a cult of one",
      "description": "What does it mean to be in and escape a “cult of one”? How can we change the conversation around narcissistic abuse to support survivors and break the cycle of harm? In this episode, Lisa welcomes Vanessa Reiser, a therapist, survivor, and author of Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People. Together, they confront the devastating realities of narcissistic abuse, detail the Tell a Therapist’s Hierarchy of Restoration and the steps survivors need to take when trying to break free. Vanessa shares her groundbreaking insights on the parallels between narcissistic relationships and cult dynamics, unveiling how narcissists use tactics like love bombing, future faking, mirroring, triangulation, and isolation to manipulate their prey. Lisa and Vanessa discuss the narcissist playbook and how they use many forms of punishment to control their “cult of one.” Through Vanessa’s book and personal journey, she emphasizes the importance of recognizing abuse, reclaiming autonomy, and building a support system to foster healing. This episode is a powerful call to action, challenging the narratives that glorify toxic relationships, naming abuse, stopping an ecosystem of chaos, and cultivating a life of radical self-love. Survivors deserve more than survival—they deserve autonomy, joy, and respect. From now on… I will sit in truth. Follow Vanessa @vanessareiserlcsw on Instagram, @vanessareiser on TikTok, and @vanessareiserteletherapy on Facebook. You can learn more about Vanessa Reiser and her therapeutic services by going to tellatherapist.net . Buy her book Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People here . From Now On is produced by LA PHILLIPS MEDIA. Listen and follow on Apple Podcasts , Spotify , and YouTube . Have a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials. If today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below: If you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673) If you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree). PAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. \u0026#xfeff;Speak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-09T13:45:00Z",
      "duration": "01:09:39.5650000",
      "explicit": false,
      "spotifyId": "1gTKfCicuDGvYCX4aKeMtR",
      "appleId": 1000683319520,
      "youTubeId": "CQcoY45oBZQ",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gTKfCicuDGvYCX4aKeMtR",
        "apple": "https://podcasts.apple.com/podcast/the-narcissist-trapped-in-a-cult-of-one/id1766405014?i=1000683319520",
        "youtube": "https://www.youtube.com/watch?v=CQcoY45oBZQ"
      }
    }
  ]
}