{
  "_ts": 0,
  "id": "584d511e-1371-47f9-ac46-406297cec1eb",
  "name": "From One To Wicked",
  "spotifyId": "06QAIRzlD07PLxLLm3tHfA",
  "appleId": 1772817108,
  "youTubeChannelId": "UC81uEYLYSXbGgwPfP2aXHhw",
  "youTubePlaylistId": "PLt3D4aBmo9kqFQ-RkGG1qEL4lDXA6E0dR",
  "episodes": [
    {
      "id": "a9458964-85c2-4b1f-add8-308cfd49712d",
      "title": "The Twelve Tribes Cult | The Dangerous Cult In Your Neighborhood",
      "description": "Become a Parajunkie Today! www.patreon.com/savannahunderground Welcome to From One To Wicked, the podcast where true crime meets chilling analysis. Hosted by Madison K. Drayton and JT, we take an in-depth look at the darkest corners of humanity, investigating criminals and cults before placing them on our custom wickedness scale. Each episode is a deep dive into motive, brutality, and more, scored live by our devoted fanbase, the Parajunkies, via interactive YouTube polls. No crime is too taboo, and no perpetrator escapes judgment in our pursuit of dissecting wickedness. In today’s episode, we unravel the twisted history of the Twelve Tribes cult, a sinister Christian fundamentalist group cloaked in hippie charm and communal living. Beneath their seemingly idyllic façade lies a disturbing doctrine that justifies racism, homophobia, and extreme child abuse. Led by founder Gene Spriggs, the Twelve Tribes controlled every aspect of their members’ lives while spreading their oppressive beliefs across continents. We examine the horrifying tales of ex-members, accounts of systemic abuse, and the lasting scars left by one of the most troubling cults in modern history. Buckle up as we rate the Twelve Tribes from One to Wicked — spoiler alert, they’re pretty wicked.",
      "release": "2024-11-22T23:00:00Z",
      "duration": "01:30:56.8080000",
      "explicit": true,
      "spotifyId": "5tLNejqnYS6zklGq24pf4x",
      "appleId": 1000677957638,
      "youTubeId": "GLnd4qLsWUE",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tLNejqnYS6zklGq24pf4x",
        "apple": "https://podcasts.apple.com/podcast/the-twelve-tribes-cult-the-dangerous-cult-in/id1772817108?i=1000677957638",
        "youtube": "https://www.youtube.com/watch?v=GLnd4qLsWUE"
      }
    }
  ]
}