{
  "id": "16a1b303-ca20-47d9-83e5-e42be4c539ff",
  "name": "From Now On",
  "spotifyId": "1vOhoPrOkwIyCNApzsBlF8",
  "appleId": 1766405014,
  "youTubeChannelId": "UCHKwmUQXbKa2bs7qYmlfkNQ",
  "youTubePlaylistId": "PLyQMErdcFFRW5LoxmdONOOnh1s_MWSNaj",
  "episodes": [
    {
      "id": "75b2898d-86f9-4aa1-add5-5d47a82529a4",
      "title": "THE TRUTH ABOUT HUMAN TRAFFICKING: Today’s Modern Slavery \u0026 What Everyone Needs to Know",
      "description": "#HumanTrafficking #ModernSlavery #EndHumanTrafficking \n\nJust a heads up: This episode contains discussions of grooming, coercive control, and sex trafficking. Some may find it upsetting. We encourage you to take care of yourself.\n\nThis episode is dedicated to Virginia Giuffre. And all survivors of Jeffrey Epstein and human trafficking.\n\nWhen survivors of sex trafficking bravely step forward to share their truth, how do we respond? Do we stand with them, or do we doubt and dismiss their experiences? What happens when the media, the justice system, and powerful industries get a hold of a survivor’s story?\n\nToday, we dive deep into the complex, often hidden reality of modern slavery happening all around us—in our neighborhoods, in the shadows of industries we engage with daily, and especially within the world of sex trafficking. More than 40 million people worldwide are trapped in human trafficking, with one in four being children. Sex trafficking, a devastating form of this crime, involves the exploitation of vulnerable individuals through force, fraud, or coercion for commercial sex acts—and minors involved cannot legally consent at all.\n\nLisa Phillips welcomes Davina Durgana, PhD,  an award-winning human rights statistician and expert who has shaped global understanding of modern slavery. Davina brings a crucial data-driven perspective on how sex trafficking thrives where social safety nets and oversight fail, and how traffickers act as entrepreneurial predators exploiting sexual and labor vulnerabilities alike.\n\nTogether, Lisa and Davina unpack the myths versus realities of human trafficking— exploring the types of coercion survivors face, the trafficking ring ecosystems, the powerful economics behind exploitation, and why survivors’ voices are vital in driving awareness and systemic change. They also highlight the retraumatization survivors endure due to stigma, legal challenges, and lack of adequate support, often keeping them trapped in cycles of abuse.\n\nThis episode calls on listeners to educate themselves on trafficking signs, understand how demand fuels exploitation—particularly in commercial sex—and hold institutions accountable, from corporations to governments, so trafficking becomes prohibitively difficult and unprofitable. Because the fight against modern slavery—and sex trafficking—starts with believing survivors, standing up for justice, and transforming communities to protect the most vulnerable.\n\n“From now on, what I would like is that we have a standard that changes American society\u0027s view of the human worth, that if we see individual lives as valuable as our own, then it doesn\u0027t stand that we can also exploit them for labor or exploit them for sex.”\n\n\nAbout Davina Durgana:\nDavina Durgana, PhD is an award-winning international human rights statistician who has developed leading global models to assess risk and vulnerability to modern slavery. \n\nDr. Davina Durgana was a Founding Author of the Global Slavery Index and Contributing Founding Author of the UN’s Global Estimates of Modern Slavery. \n\nShe is the Director of Free the Slaves, the oldest anti-trafficking organization in the United States and is currently working on a book on family court reform for domestic violence survivors and their children. \n\nFollow Davina Durgana:\nInstagram: https://www.instagram.com/davinadurgana/\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\n#SexTrafficking #grooming #financialabuse #BreakTheSilence #HealingJourney #jeffreyepstein #virginiagiuffre #diddy",
      "release": "2025-07-31T12:45:00Z",
      "duration": "01:03:48.0880000",
      "explicit": true,
      "spotifyId": "438CXCgtZY8gnd4u8y7Jje",
      "appleId": 1000720088518,
      "youTubeId": "RAnUleetLlY",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/438CXCgtZY8gnd4u8y7Jje",
        "apple": "https://podcasts.apple.com/podcast/the-truth-about-human-trafficking-todays-modern/id1766405014?i=1000720088518",
        "youtube": "https://www.youtube.com/watch?v=RAnUleetLlY"
      }
    },
    {
      "id": "fce909b6-e1f7-46ab-9d63-b0398cbc30cb",
      "title": "THE TOUR BUS TRAP: How Teen Girls Get Groomed at Concerts",
      "description": "#marilynmanson #SurvivorStories #rockstar\n\nJust a heads up: This episode contains discussions of grooming of a minor, sexual assault, and coercive control. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat really happens when the spotlight fades and the show is over? For years, iconic rock musician Marilyn Manson cultivated an image of rebellion and shock, but behind that façade lies a decades-long history of abuse and predatory behavior targeting underage fans.\n\nIn this episode, Lisa Phillipsm invites Bianca Allaine Kyne who exposes the chilling details of what went on behind the closed doors of Manson’s tour bus. In 1995, Bianca was just 16 when she, along with younger girls—some as young as 13—was invited onto Manson’s bus after a concert. What began as a dream come true for devoted teenage fans quickly turned into a nightmare of manipulation, violation, and threats. Bianca bravely recounts how Manson and bandmate Jeordie White (Twiggy Ramirez) deliberately singled out vulnerable girls, asked personal questions, and used fan clubs to extract addresses and contact details. The grooming was methodical and predatory, leaving Bianca and other young girls isolated, ashamed, abused and silenced.\n\nBut Manson’s pattern of abuse didn\u0027t stop there: his violent, degrading behavior has been corroborated by fellow survivors, including high-profile voices like Evan Rachel Wood, and by testimony about band members and crew being subjected to assault and humiliation. Despite mounting accusations and lawsuits, the music industry has historically looked the other way, settling behind closed doors and allowing predators to remain in the spotlight.\n\nIn this conversation, Bianca shares why she kept her story hidden for so long, the shame and self-blame she carried as a teenage fan betrayed by her idol, and how solidarity among survivors—finally speaking out—has become a catalyst for demanding true accountability. Lisa and Bianca call attention to the patterns of grooming and calculated selection of vulnerable girls; the complicity of institutions that enable abuse; and why, even now, many survivors feel blamed, judged, or disbelieved when they dare to share the truth.\n\nThis episode is a call to listen—truly listen—to survivors, to challenge the culture of silence, and to ensure no other young fan becomes prey behind the glamour of rock stardom.\n\n“From now on, I hope that we can all continue this conversation and this topic. We just have to keep fighting the good fight.”\n\nAbout Bianca Allaine Kyne:\nBianca Allaine Kyne is a model, actor, producer, and survivor. Bianca is one of Marilyn Manson’s earliest survivors who has publicly come forward.\n\nFollow Bianca Allaine Kyne:\nInstagram: https://www.instagram.com/80sNuvo\nInstagram: https://www.instagram.com/Bianca_Allaine\nTikTok: https://www.tiktok.com/@bianca_allaine\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/",
      "release": "2025-07-24T12:45:00Z",
      "duration": "01:13:34.7720000",
      "explicit": true,
      "spotifyId": "64AZWDClkJURgdO7cYQo6J",
      "appleId": 1000718848128,
      "youTubeId": "U0WerOw9Qy4",
      "subjects": [
        "Cult Psychology",
        "Human Trafficking",
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64AZWDClkJURgdO7cYQo6J",
        "apple": "https://podcasts.apple.com/podcast/the-tour-bus-trap-how-teen-girls-get-groomed-at-concerts/id1766405014?i=1000718848128",
        "youtube": "https://www.youtube.com/watch?v=U0WerOw9Qy4"
      }
    },
    {
      "id": "c298d9b7-a295-46e4-8ac0-56904d559f84",
      "title": "THE BOY: 1 in 6 – Groomed, Abused \u0026 the Cycle of Violence in Male Childhood Trauma",
      "description": "#MaleSurvivor #OneInSix #childhoodtrauma \n\nJust a heads up: This episode contains discussions of child sexual assault, grooming, violence, substance abuse, and suicidal ideation. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when a boy is forced to carry a secret so heavy it shapes every part of his life? How do we respond when male survivors of childhood sexual abuse break their silence about grooming, violence, and the lifelong impact of trauma?\n\nToday, we’re confronting the widespread crisis that affects one in six boys before they turn eighteen—a staggering number that is too often hidden by shame, stigma, and disbelief. Most assaults are committed not by strangers, but by people the child knows and trusts, making it even harder for boys to speak out. Society’s expectations of masculinity tell boys to be strong and silent, leaving them isolated and unheard, and allowing the cycle of violence and trauma to continue.\n\nLisa welcomes Nathan Spiteri—author, advocate, and survivor—who was just eight years old when his world was shattered by a stranger. Nathan takes us step-by-step through the grooming tactics that trap children in fear, the violence that follows, and the toxic shame that warps self-worth and behavior for years to come. He shares how the cycle of abuse and violence led to addiction, self-destruction, and profound confusion about love and belonging.\n\nThis episode is not just about pain, but about the power of speaking out. Nathan and Lisa explore how vulnerability is an act of bravery, how naming abuse is the first step toward healing, and why it’s time to end the stigma that keeps male survivors in the shadows. Nathan’s journey shows that breaking the cycle of violence and healing from childhood trauma is possible—with honest conversation, support, and the courage to reclaim your story.\n\nThis episode calls on listeners to listen, believe, and stand with all survivors—because progress begins with breaking the silence and ending the cycle of violence for good.\n“From now on, this is me. From now on, I am who I am, I can\u0027t change it.”\n\nAbout Nathan Spiteri:\n\nNathan Spiteri is the author of Toy Cars, a TEDx speaker, advocate, filmmaker, actor, and screenwriter. Nathan Spiteri is also a sexual abuse survivor. Born in Australia, Nathan was sexually abused as a child, threatened with his life and that of his family.\n\nHe is one of the very few voices of male sexual abuse to speak so openly and publicly, and wants to start the conversation and change the narrative surrounding this global epidemic.\n\nFollow Nathan Spiteri:\nWebsite: https://www.nathanspiteri.com/\nInstagram: https://www.instagram.com/nathanspiteri/\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/",
      "release": "2025-07-17T12:45:00Z",
      "duration": "01:12:29.3870000",
      "explicit": true,
      "spotifyId": "7JDGAxIvLJ12ovChyAKF8j",
      "appleId": 1000717752806,
      "youTubeId": "t-yKGVPN4E8",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7JDGAxIvLJ12ovChyAKF8j",
        "apple": "https://podcasts.apple.com/podcast/the-boy-1-in-6-groomed-abused-the-cycle-of-violence/id1766405014?i=1000717752806",
        "youtube": "https://www.youtube.com/watch?v=t-yKGVPN4E8"
      }
    },
    {
      "id": "bc26f748-014b-43d0-b63d-1db2bd3081c5",
      "title": "THE BOUNDARIES: How to Teach Kids and Teens Consent, Body Autonomy, and Prevent Sexual Abuse",
      "description": "#consent #BodyAutonomy #childhoodtrauma\n\nJust a heads up: This episode contains discussions of sexual assault and coercive control. Some may find it upsetting. We encourage you to take care of yourself.\n\nHow do we equip kids and teens with the tools they need to protect themselves and build healthy relationships? What happens when we break the silence around consent, body autonomy, and sexual abuse prevention?\n\nToday, we’re confronting the myths and silences that leave young people vulnerable. Too often, survivors of childhood sexual abuse grow up without the language or support to process their trauma. Many never learn what consent truly means, or how to recognize and assert their own boundaries. Instead, shame and secrecy are passed down through generations, leaving children and teens to navigate relationships and intimacy without guidance.\n\nLisa welcomes Logan Cooper, a licensed mental health counselor, trauma professional, and survivor, who draws on both her personal and professional experience to empower families. Logan and Lisa discuss the long-term impact of unprocessed childhood trauma, the dangerous myths about sex and consent that persist in families, schools, and media, and how parents and caregivers can start age-appropriate conversations about body autonomy—even with very young children.\n\nThis episode offers practical strategies for teaching consent, recognizing the difference between safe surprises and unsafe secrets, and helping kids and teens build self-worth and confidence. Lisa and Logan explore how education, open dialogue, and modeling healthy boundaries can break cycles of shame and silence, giving the next generation the tools they need to stay safe and thrive.\n\nThis conversation is for every parent, educator, and survivor who wants to create a world where children are empowered, informed, and protected.\n\n“From now on, I will listen to my body over what anybody else tells me about my body. I trust my body first.”\n\nAbout Logan Cooper:\nLogan Cooper is a Mental Health Counselor \u0026 a Certified Clinical Trauma Professional licensed in the state of Florida. Logan draws on her personal experiences of domestic violence and sexual trauma as well as her professional training to provide advocacy \u0026 empowerment to fellow survivors in therapy. Her practice focuses on creating a safe environment where clients can heal from feeling defined by their traumatic experiences, allowing them to rediscover their authentic selves and build the lives they deserve.\n\nFollow Logan Cooper:\nTikTok: https://www.tiktok.com/@crookedcounselorcooper \nInstagram: https://www.instagram.com/crookedcounselorcooper/\n\nTo inquire about counseling services, contact Logan at Logancoopercounseling@gmail.com. \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#ConsentEducation #PreventChildAbuse #TeachConsent\n#SexualAbusePrevention #ChildSafety #ParentingTips #TraumaAwareness #EmpowerKids #HealthyBoundaries #SurvivorSupport #MentalHealthAwareness #SafeKids #EndChildAbuse\n#TalkAboutConsent #consent #PTSD #traumahealing #trauma #healing #relationships #sa #sasurvivor #ptsd #csa #triggered",
      "release": "2025-07-10T12:45:00Z",
      "duration": "01:27:26.7460000",
      "explicit": true,
      "spotifyId": "5oX07WEK9sJC7uIUb432A8",
      "appleId": 1000716675067,
      "youTubeId": "rZPBW2SXrNs",
      "subjects": [
        "Human Trafficking",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5oX07WEK9sJC7uIUb432A8",
        "apple": "https://podcasts.apple.com/podcast/the-boundaries-how-to-teach-kids-and-teens-consent/id1766405014?i=1000716675067",
        "youtube": "https://www.youtube.com/watch?v=rZPBW2SXrNs"
      }
    },
    {
      "id": "bacff3ee-6476-46a8-b76c-bee6a5f01844",
      "title": "THE MILITARY DISCHARGE: Surviving Sexual Assault \u0026 Healing PTSD with a Service Dog",
      "description": "#ptsd #veteran #servicedog \n\nJust a heads up: This episode contains discussions of sexual assault, initmate partner violence, substance abuse and PTSD. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when a survivor of military sexual assault is not only silenced but discarded by the very institution they gave an oath to? How do we respond when their stories of trauma, PTSD, and struggle for justice come to light?\n\nToday, we confront military sexual trauma and the devastating aftermath for those who speak out. Army veteran, author, and PTSD advocate Simone Swartz joins Lisa to share her journey from honor and ambition to betrayal. Simone reveals how the military’s culture of misogyny and silence left her without a safe place to turn after being assaulted by a fellow soldier. Instead of receiving care, she was blamed, ostracized, and ultimately discharged—her service and future erased in a single stamp.\n\nSimone and Lisa discuss the long-term impact of military sexual trauma: PTSD, addiction, and the struggle for basic dignity and healthcare. But Simone’s story is also one of hope and transformation. She is dedicated to helping others understand that PTSD is treatable. Through therapy, community, and the unconditional support of her service dog, Simone learned to manage her symptoms and rebuild her life. She shares practical insights on recognizing PTSD, seeking help, and the importance of persistence in recovery. \n\nFor Simone, her service dog became a lifeline—helping her manage panic, rebuild trust, and reclaim her life one step at a time. Her message to listeners is clear: no matter the trauma, healing is possible, and no one is beyond hope. PTSD can be managed, and survivors deserve support, respect, and the chance to thrive. She has written, soon to be published PTSD and What Helped Me, in hopes of bringing a consolidated resource for those dealing with PTSD.\n\nThis episode is a call to believe survivors, to demand accountability from the systems that fail them, and to recognize that recovery is possible—even after the deepest betrayals. Simone’s courage and advocacy remind us that with the right support, every survivor can find a path forward.\n\n“From now on, PTSD is treatable and the sky\u0027s the limit.”\n\nAbout Simone Swartz:\n\nSimone Swartz is an Army Veteran, mother of 3, author, public speaker, and leading PTSD expert on Service dogs and PTSD.  She is also a Military Sexual Trauma Survivor.  Her journey living with PTSD, intimate partner violence, sexual assault, and addiction has led her to share her story and ways to overcome trauma and live a fulfilled life.\n\nFollow Simone Swartz:\nWebsite: https://www.ptsdandwhathelpedme.com/\nInstagram: https://www.instagram.com/ptsdandwhathelpedme\nTikTok: https://www.tiktok.com/@ptsdandwhathelpedme  \nYouTube: @Ptsdandwhathelpedme \nGunner the Service Dog Instagram: https://www.instagram.com/servicedoginnewyork\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#ptsdandwhathelpedme #ptsdrecovery #healingispossible #traumahealing #trauma #healing #relationships #sa #sasurvivor #servicedogtraining #recovery #combat #recoveryispossible #msa #tbi",
      "release": "2025-07-03T12:45:00Z",
      "duration": "01:01:31.2840000",
      "explicit": true,
      "spotifyId": "0s5Mo6GX0dwdeEjOffCT99",
      "appleId": 1000715595059,
      "youTubeId": "vPxObxNEbY4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0s5Mo6GX0dwdeEjOffCT99",
        "apple": "https://podcasts.apple.com/podcast/the-military-discharge-surviving-sexual-assault/id1766405014?i=1000715595059",
        "youtube": "https://www.youtube.com/watch?v=vPxObxNEbY4"
      }
    },
    {
      "id": "c39d0f4b-e274-48b0-bfbe-60918bb6aa54",
      "title": "THE FATHER’S SECRET: When Your Protector Turns Into Your Predator",
      "description": "#trauma #cptsd #healing #ptsd #csa\n\nJust a heads up: This episode contains discussions of familial sexual assault, grooming, psychological abuse and physical abuse. Some may find it upsetting. We encourage you to take care of yourself.\n\nHow do we recognize the signs of childhood abuse—especially when it’s hidden behind a mask of love and trust? What can we do to educate and empower children, parents, and communities to break the silence before it’s too late?\n\nIn this episode, Lisa welcomes Jessica Ella, Australia’s leading women’s trauma therapist and survivor, to share her powerful story and expertise. Jessica’s childhood was marked by confusion, fear, and secrets—her father, admired by outsiders as “Super Dad,” was in reality her abuser. Like so many children, Jessica trusted her parent completely, making the betrayal and manipulation even more devastating. She describes how abuse cloaked in love creates unbearable confusion, self-blame, and a twisted sense of normalcy that can last for decades.\n\nTogether, Lisa and Jessica break down the subtle and not-so-subtle signs of childhood abuse: secrecy, fear, sudden changes in behavior, withdrawal, and the burden of “unhappy secrets” that children are too scared to share. They discuss the importance of teaching children the difference between safe surprises and unsafe secrets, and why early, age-appropriate conversations are crucial for prevention. Jessica shares her experience writing the children’s book Secret or Surprise—a practical tool designed to help families and educators start these vital conversations with kids as young as four, before grooming and abuse can take root.\n\nThis episode is a call to action for parents, teachers, and caregivers: learn the signs, trust your instincts, and create safe spaces where children know they can speak up. Lisa and Jessica remind listeners that education, open dialogue, and breaking generational cycles of silence are the keys to protecting children and supporting survivors on their path to healing.\n\n“From now on…I will always be the example.”\n\nAbout Jessica Ella:\nJessica Ella is an internationally accredited holistic trauma expert and the founder of Aaruka® Therapy. Known as Australia’s Leading Women’s Trauma Therapist, Jessica has helped thousands of women break free from their past, helping them to heal their complex trauma and sexual abuse so that they can reclaim freedom, love \u0026 power. Her work is raw, real and deeply transformational.\n\nFollow Jessica Ella:\nWebsite: https://www.jessicaella.com.au/\nInstagram: https://www.instagram.com/iamjessicaella\nSecret or Surprise (SOS) Book: https://www.secretorsurprise.com.au/\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\nchildhoodtrauma #triggered #complextrauma #repressed #relational #relationships #listentosurvivors #coercivecontrol #manipulation #isolation #cyclebreaker #hiddenabuse #awareness #trauma #abuse #storytelling  #podcast",
      "release": "2025-06-26T12:45:00Z",
      "duration": "01:23:31.2520000",
      "explicit": true,
      "spotifyId": "4VskdaY1AmlbUeZCj8EQg3",
      "appleId": 1000714662396,
      "youTubeId": "srIk3lAciqk",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VskdaY1AmlbUeZCj8EQg3",
        "apple": "https://podcasts.apple.com/podcast/the-fathers-secret-when-your-protector-turns-into/id1766405014?i=1000714662396",
        "youtube": "https://www.youtube.com/watch?v=srIk3lAciqk"
      }
    },
    {
      "id": "91738e45-fa84-49ef-88c4-a38c93123ee9",
      "title": "THE SECRET RELATIONSHIP: Surviving Abuse When He Denies You Ever Existed",
      "description": "#covertabuse #domesticabuse #healing \n\nJust a heads up: This episode contains discussions of grooming, coercive control, and physical abuse. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when the person who hurt you most insists you were never even together? When survivors come forward with stories of hidden relationships and abuse, they’re often met with disbelief—especially when the abuser’s public persona is charming, generous, and above reproach.\n\nIn this episode, Lisa welcomes Davina Durgana, PhD, an award-winning human rights expert and survivor, who bravely shares her story of a secret relationship marked by manipulation, isolation, and escalating abuse. While her abuser maintained a blameless public image, behind closed doors, he was physically and emotionally abusive—using secrecy, coercion, and violence to control every aspect of her life.\n\nDavina’s story reveals how abusers weaponize secrecy, insisting on hidden relationships under the guise of “protection,” while privately inflicting harm and publicly denying any connection. When Davina finally broke her silence, her abuser not only denied their relationship and their child, but also launched a smear campaign—using legal threats, false accusations, and manipulative tactics to discredit her and protect his reputation.\n\nLisa and Davina discuss the unique trauma of being erased and gaslit, the emotional toll of fighting for acknowledgment in a world that only sees the abuser’s public mask, and the exhausting legal battles survivors face just to be heard. From seeking restraining orders to defending herself against defamation to seeking child support, Davina’s journey exposes the deep flaws in a system that too often fails to recognize covert abuse and protect those most at risk.\n\nThis episode is a call for empathy, validation, and accountability. Survivors deserve to be seen, heard, and believed—even when their abuser pretends they never existed and tries to destroy their credibility. Lisa and Davina challenge the culture of silence, urging listeners to stand with survivors and demand justice, both inside and outside the courtroom.\n\n“From now on…I will not tolerate behavior that I wouldn’t want my daughter to tolerate.”\n\n\nAbout Davina Durgana:\n\nDavina Durgana, PhD, is an award-winning international human rights statistician who has developed leading global models to assess risk and vulnerability to modern\nslavery. \n\nDr. Davina Durgana was a Founding Author of the Global Slavery Index and Contributing Founding Author of the UN’s Global Estimates of Modern Slavery. \n\nShe is the Director of Free the Slaves, the oldest anti-trafficking organization in the United States and is currently working on a book on family court reform for domestic violence survivors and their children. \n\nFollow Davina Durgana:\nInstagram: https://www.instagram.com/davinadurgana\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\nGUKUVDGNQGCQWUE4\n\n#Healingoutloud #survivor #healing #grit #RedFlags #coercivecontrol #manipulation #isolation #hiddenabuse #awareness #trauma #abuse #healing #storytelling  #podcast",
      "release": "2025-06-19T12:45:00Z",
      "duration": "01:38:39.3990000",
      "explicit": true,
      "spotifyId": "2xXMiWXPkh1PF9EpDBNEwE",
      "appleId": 1000713586910,
      "youTubeId": "bDj6QFItd_c",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2xXMiWXPkh1PF9EpDBNEwE",
        "apple": "https://podcasts.apple.com/podcast/the-secret-relationship-surviving-abuse-when-he/id1766405014?i=1000713586910",
        "youtube": "https://www.youtube.com/watch?v=bDj6QFItd_c"
      }
    },
    {
      "id": "2cd43abb-0480-4431-b301-021b6686877e",
      "title": "THE DORM ROOM: Assaulted by 13 athletes and the university that covers it up",
      "description": "#survivor #coverup #listentosurvivors #trauma\n\nJust a heads up: This episode contains discussions of physical, emotional, psychological abuse and sexual assault. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when the place meant to launch your future becomes the site of your worst nightmare—and the very institution meant to protect you chooses to protect itself instead? In this episode, Lisa sits down with Iesha Campbell, whose first weeks at a North Carolina college ended in unimaginable horror: drugged and assaulted by 13 athletes at a party in a dorm room, a place she should have felt safe.\n\nBut the trauma didn’t end with the crime. Despite a positive rape kit and clear evidence, Iesha was met with disbelief, intimidation, and victim-blaming by the university and campus police. Instead of support, she and her family were pressured to stay silent—warned that pursuing justice would only bring shame and ruin to her reputation, while her attackers walked free. The university’s priority was clear: protect its image and its athletes, no matter the cost to the survivor.\n\nIesha’s story is not just about surviving a horrific assault, but about the lifelong consequences of institutional betrayal. She shares the enduring impact of the cover-up: PTSD, anxiety, depression, and the struggle to reclaim her sense of worth and safety in a world that failed to stand by her. Lisa and Iesha confront the staggering reality that one in five college women will be sexually assaulted, and most will never see justice—not because they didn’t come forward, but because those in power chose to look away.\n\nThis episode is a call to break the silence, demand accountability from universities, and support survivors with empathy—not shame. Lisa and Aisha remind listeners that the true cost of a cover-up is measured in lives forever altered by trauma, and that speaking out is the first step toward change.\n\n“From now on… I’ll never abandon me.”\n\nAbout Iesha Campbell:\nIesha Campebell is a resilient soul with a heart of gold. Despite life’s hardships, Iesha shares her story to inspire and empower others on similar paths, turning pain into purpose.\n\nFollow Iesha Campbell:\nInstagram: https://www.instagram.com/Ieshacampbell59\nFacebook: https://www.facebook.com/iesha.campbell.2025\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\n#SurvivorStories #TraumaAwareness #PTSD #stalking #redflags #fightforyourlife #sasurvivor #metoo #listentosurvivors #trauma #abuse #healing #storytelling #podcast #healing \n\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/",
      "release": "2025-06-12T12:45:00Z",
      "duration": "00:48:55.2220000",
      "explicit": true,
      "spotifyId": "2mZh0DcMuilGR5URDZRs4t",
      "appleId": 1000712593162,
      "youTubeId": "cxLXTeK7INU",
      "subjects": [
        "Human Trafficking",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mZh0DcMuilGR5URDZRs4t",
        "apple": "https://podcasts.apple.com/podcast/the-dorm-room-assaulted-by-13-athletes-and/id1766405014?i=1000712593162",
        "youtube": "https://www.youtube.com/watch?v=cxLXTeK7INU"
      }
    },
    {
      "id": "e065636b-0936-42e9-879d-228552f35ea8",
      "title": "THE BOXER: My Coach Controlled Everything—Even Me",
      "description": "#coercivecontrol #groomingtactics #stalking \n\nJust a heads up: This episode contains discussions of intimate partner violence and coercive control, emotional, financial, and psychological abuse. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when the fight for your life takes place outside the ring? In this episode, we expose the hidden world of abuse, coercive control, and grooming in athletics through the powerful story of Nikki Hru—a female boxer whose coach became her abuser.\n\nNikki’s journey reveals how power dynamics in sports can be exploited, turning mentorship into manipulation and training into emotional captivity. She bravely details how her coach groomed her, isolated her from support, and used his authority to control every aspect of her life, both in and out of the gym, under the guise of a relationship. This is not just a story about abuse in the boxing world—it’s a testament to the unique challenges female athletes face when the very system meant to empower them becomes a weapon for control.\n\nBut Nikki’s fight didn’t end when she broke free from her coach’s grip. She faced a new battle in the legal system, navigating the daunting process of seeking a restraining order for her safety. Nikki shares the emotional toll of having to prove her abuse, the barriers survivors encounter in court, and the courage it takes to demand protection when institutions are slow to act.\nNikki’s story is about breaking that silence, challenging the systems that enable abuse, and showing other female athletes that they are not alone.\n\nThis episode is a call to action: to recognize, believe, and support survivors in sports, to hold abusers and institutions accountable, and to empower women everywhere to reclaim their stories—inside and outside the ring.\n\n“From now on… I’ll never abandon me.”\n\nAbout Nikki Hru:\nNikki Hru is an actress and an influencer boxer, as well as a survivor of domestic abuse. Nikki is hoping that sharing at least part of her story will help other victims feel seen and empowered in their survival. She is committed to authentically living, creating good from even the worst of times.\n\nFollow Nikki Hru:\nInstagram: https://www.instagram.com/NikkiHru\n \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#manipulation #domesticabuse #toxicrelationships #abuseawareness #powerdynamics #RedFlags #EmotionalWellness #BoundarySetting #SelfAwareness #PersonalGrowth #listentosurvivors #manipulation #isolation #cyclebreaker #hiddenabuse #awareness #trauma #abuse #healing #storytelling #podcast #diddy #diddytrial #cassie #CassieVentura",
      "release": "2025-06-05T12:45:00Z",
      "duration": "01:38:12.8840000",
      "explicit": true,
      "spotifyId": "2HWfrPkIJZ9iipidPPNOkz",
      "appleId": 1000711685780,
      "youTubeId": "VtqkTp8GLGw",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HWfrPkIJZ9iipidPPNOkz",
        "apple": "https://podcasts.apple.com/podcast/the-boxer-my-coach-controlled-everything-even-me/id1766405014?i=1000711685780",
        "youtube": "https://www.youtube.com/watch?v=VtqkTp8GLGw"
      }
    },
    {
      "id": "f775fddb-b41a-41e3-bb1c-5617a26232f8",
      "title": "THE CYCLE BREAKER: Breaking generational trauma and becoming the hero she needed",
      "description": "#CSAM #familyabuse #Healingoutloud #survivor\n\nJust a heads up: This episode contains discussions of coercion, child sexual assault by a parent, intimate partner violence, and addiction recovery. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat does it mean to shatter the silence that has trapped generations? Today, we confront the hidden epidemic of child sexual abuse within the family and the generational trauma it leaves in its wake. Too many children are forced to carry secrets, confusion, and shame—believing they are the problem, when the truth is, the shame never belonged to them.\n\nLisa welcomes Tiffany Smith, motivational speaker, author, wellness coach, DPS Officer with Nevada State Police: Division of Parole \u0026 Probation and survivor of childhood sexual abuse, domestic violence, and narcissistic abuse. At just 13 years old, Tiffany found the courage to stand up to her abuser—her own father—and declare that the cycle would end with her. She became the protector for her younger sisters, carrying a burden no child should bear, and navigated a home where silence and survival were the only options.\n\nTogether, Lisa and Tiffany explore the lifelong impact of trauma, the complexity of family loyalty, and the courage it takes to finally speak the truth after decades of silence. Tiffany shares how she broke free from the legacy of abuse, faced the pain of disclosure as an adult, and began the journey of healing—not just for herself, but for future generations. Her story is one of fierce resilience, transformation, and the power of becoming the hero she needed as a child.\n\nThis episode is a call to break the silence, end the stigma, and support survivors with empathy and understanding. Lisa and Tiffany remind us that healing is not linear, but every act of truth-telling is a step toward reclaiming power, rewriting the narrative, and breaking generational cycles for good.\n\n\nFollow Tiffany Smith :\nInstagram: https://www.instagram.com/thetiffanysmith\nBook Instagram: https://www.instagram.com/girlgetup_2025\nTikTok: https://www.tiktok.com/@thetiffanysmith\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#healing #grit #grace #justagirl #speaker #advocate #heal #resilience #coach  #family #dv #domesticviolence #intimatepartnerviolence #RelationshipAdvice #RedFlags #EmotionalWellness #BoundarySetting #SelfAwareness #PersonalGrowth #listentosurvivors #coercivecontrol #manipulation #isolation #cyclebreaker #hiddenabuse #awareness #trauma #abuse #healing #storytelling  #podcast",
      "release": "2025-05-29T12:45:00Z",
      "duration": "01:19:15.8530000",
      "explicit": true,
      "spotifyId": "7fGYbMUMWbIL48HxaZ4z0Q",
      "appleId": 1000710425453,
      "youTubeId": "gmz8sV-6Mlw",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7fGYbMUMWbIL48HxaZ4z0Q",
        "apple": "https://podcasts.apple.com/podcast/the-cycle-breaker-breaking-generational-trauma/id1766405014?i=1000710425453",
        "youtube": "https://www.youtube.com/watch?v=gmz8sV-6Mlw"
      }
    },
    {
      "id": "1598dbc9-d2a0-4019-9ac8-56deedc4663f",
      "title": "THE BREAKTHROUGH: Finding courage and self-love after 26 years of abuse",
      "description": "#dv #traumarecovery #healing \n\nJust a heads up: This episode contains discussions of emotional, verbal, psychological and sexual abuse. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat does it take to walk away from a life you’ve known for decades—especially when that life has been shaped by abuse? \n\nToday, we’re exploring the moment of breakthrough: the courageous decision to leave a 26-year abusive marriage and step into the unknown. Too often, society tells us it’s too late to start over, but real freedom can begin when you have the courage to do so. Freedom knows no age.\n\nLisa welcomes Stephanie Strickland, author, motivational speaker, and survivor of intimate partner violence, who shares her powerful journey of finding the courage to leave, heal, and rebuild her life after more than two decades of abusive marriage. Together, Lisa and Stephanie discuss the invisible weight of shame, the masks we wear to survive, and the transformative power of finally telling your truth—not just to others, but to yourself.\n\nThis episode is about reclaiming your story, breaking free from the past, and proving that peace and wholeness are possible, no matter when you begin. Lisa and Stephanie call on listeners to support those making brave choices, reminding us all: it’s never too late for your breakthrough.\n\n“From Now On…I will always advocate for myself. From now on, I will always use my voice. I will never downplay myself again. From now on, I will advocate for other women, and from now on, I will practice self love.”\n\nAbout Stephanie Strickland:\n\nStephanie Strickland is the author of Finding Peace Within, a motivational speaker, and a survivor of intimate partner violence and abusive marriage. Stephanie Strickland passionately spends her time advocating for victims and survivors of abuse. Stephanie believes that by openly sharing her life, removing her mask, and walking in her purpose, she is showing women that you don’t have to live in the shame of your past.\n\n\nFollow  Stephanie Strickland:\nWebsite: https://www.stephaniedstrickland.com/\nInstagram: https://www.instagram.com/iamsdstrickland\nFacebook: https://www.facebook.com/StephanieDStrick\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n\n#family #domesticviolence #intimatepartnerviolence #RelationshipAdvice #RedFlags #EmotionalWellness #BoundarySetting #SelfAwareness #PersonalGrowth #listentosurvivors #coercivecontrol #manipulation #isolation #cyclebreaker #hiddenabuse #awareness #trauma #abuse #healing #storytelling #podcast",
      "release": "2025-05-22T12:45:00Z",
      "duration": "01:25:03.9860000",
      "explicit": true,
      "spotifyId": "1ijvmygweG9YW7pqUQTOVo",
      "appleId": 1000709425988,
      "youTubeId": "0wVLT7Mn7Hs",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ijvmygweG9YW7pqUQTOVo",
        "apple": "https://podcasts.apple.com/podcast/the-breakthrough-finding-courage-and-self-love-after/id1766405014?i=1000709425988",
        "youtube": "https://www.youtube.com/watch?v=0wVLT7Mn7Hs"
      }
    },
    {
      "id": "0cb1be98-8f51-4232-bf21-4d576209aef2",
      "title": "THE MINDSET: Transforming Trauma into Purpose",
      "description": "#healing #transformation #purpose \n\nJust a heads up: This episode contains discussions of healing after trauma. Some may find it upsetting. We encourage you to take care of yourself.\n\nToday, we’re exploring the powerful connection between mindset, healing, and purpose. Too often, survivors are told to “move on” or “just be positive,” but real transformation requires more than empty platitudes; it demands courage, self-reflection, and a willingness to rewrite your story.\n\nLisa welcomes Lewis Huckstep, a purpose and transformation coach who has turned his own history of childhood trauma into a mission to help others reclaim their worth and step into the lives they were meant to live. Lewis shares how his deepest wounds became the seeds of his purpose, and how embracing vulnerability, setting boundaries, and healing old patterns allowed him to create a life of inspiration and service to others.\n\nTogether, Lisa and Lewis break down the myth that trauma defines you and discuss practical steps for transforming emotional triggers, breaking free from toxic cycles, and discovering your authentic self. They explore why purpose often emerges from our greatest pain, and how giving back can be the ultimate act of healing.\n\nThis episode is a call to action for anyone ready to move beyond survival and step into a life of meaning. Lisa and Lewis invite you to see your story not as a source of shame, but as the foundation for your greatest gift to the world. Healing isn’t about forgetting the past. It’s about using it to fuel your future.\n\nIf you’ve ever wondered how to turn adversity into inspiration or how to find purpose on the other side of pain, this conversation is for you.\n\nAbout Lewis Huckstep:\nLewis Huckstep is a Purpose \u0026 Transformation Coach, author of The Inspired Life Method, a speaker, and podcast host of The Lewis Huckstep Experience. Lewis Huckstep discovers people’s life\u0027s purpose and their true, authentic self. He works with his clients to heal their mental and emotional limitations, overcome sabotaging patterns, allowing access to their true potential \u0026 fulfilment.\n\n\nFollow Lewis @lewishuckstep on ⁠Instagram⁠, ⁠Facebook,⁠ and ⁠YouTube⁠. Go to ⁠lewishuckstep.com⁠ to learn more about his services.\n\n\nFollow Lewis Huckstep:\nWebsite: https://lewishuckstep.com/\nInstagram: https://www.instagram.com/lewishuckstep/\nFacebook: https://www.facebook.com/Lewishuckstepp\nYouTube: @LewisHuckstep \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/",
      "release": "2025-05-15T12:45:00Z",
      "duration": "01:08:50.5060000",
      "explicit": true,
      "spotifyId": "0RcVq6XZw1h2B7ozHOd0PS",
      "appleId": 1000708586407,
      "youTubeId": "PeVboYiKRQY",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0RcVq6XZw1h2B7ozHOd0PS",
        "apple": "https://podcasts.apple.com/podcast/the-mindset-transforming-trauma-into-purpose/id1766405014?i=1000708586407",
        "youtube": "https://www.youtube.com/watch?v=PeVboYiKRQY"
      }
    },
    {
      "id": "cfc76efb-f68b-4722-b98f-72f2f470c790",
      "title": "THE MARTIAL ARTIST: Surviving a cult of control to teaching TRUE self-defense",
      "description": "We step into the martial arts world, a space built on honor and discipline, yet often hiding a darker reality of manipulation and exploitation. Lisa welcomes Elicia Ybarra, a lifelong martial artist and dedicated women’s self-defense instructor, who transformed her own experience of abuse within the industry into a mission to uplift others. Elicia shares how martial arts became her escape from a chaotic, abusive childhood, only to later confront betrayal and harm by those in positions of power. Together, Lisa and Elicia expose how the martial arts community’s strict hierarchies and culture of silence protect abusers and isolate survivors, leaving many trapped in cycles of shame and disbelief. This episode is about more than exposing a broken system; it’s about reclaiming martial arts as a tool for true empowerment. Elicia’s story is one of resilience, teaching that real self-defense starts with permission: to trust your instincts, set boundaries, and speak out. Lisa and Elicia call for a new vision of martial arts, one that builds women up, not breaks them down, and urge listeners to support survivors with empathy and action, not judgment or blame. If you’ve ever wondered how to turn survival into strength or how to make martial arts a place of real empowerment, this conversation is for you. About Elicia Ybarra: Elicia is a lifelong martial artist with over two decades of martial arts experience, including a 4th dan black belt in Taekwondo and a 1st dan black belt in Hapkido. As the founder of Pretty Hands, Hard Punches, Elicia uses her own experiences overcoming abuse and exploitation within the martial arts industry to teach women practical self-defense techniques, boundary-setting, and how to recognize and stand against abuse. Her unique approach combines technical skill, emotional intelligence, and empowerment to help women build physical and mental strength. Follow Elicia @prettyhandshardpunches on Instagram , TikTok , Facebook , LinkedIn and YouTube . To learn more about her services and classes go to prettyhandshardpunches.com . Elicia is offering to guides for From Now On audience. Boundaries \u0026 Bravery: Self-Defense Strategies for Women Everywhere Guide - use Promocode: FromNowOn to access it for free. Creating the Ideal You Guide - use Promocode: IdealYou to access it for free. From Now On is produced by LA PHILLIPS MEDIA. Listen and follow on Apple Podcasts , Spotify , and YouTube . Have a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials. If today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below: If you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673) If you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree). PAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. \u0026#xfeff;Speak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other.",
      "release": "2025-05-08T12:45:00Z",
      "duration": "01:43:54.0170000",
      "explicit": true,
      "spotifyId": "0zEXpBMvEjc3v529oJaAJB",
      "appleId": 1000706803227,
      "youTubeId": "ynunIIqaxYY",
      "subjects": [
        "_Blank",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0zEXpBMvEjc3v529oJaAJB",
        "apple": "https://podcasts.apple.com/podcast/the-martial-artist-surviving-a-cult-of-control/id1766405014?i=1000706803227",
        "youtube": "https://www.youtube.com/watch?v=ynunIIqaxYY"
      }
    },
    {
      "id": "7c32444c-aff5-4fb1-bd2d-639b1a1dc32b",
      "title": "THE PRODUCER: Inside the mind games of coercive control",
      "description": "Just a heads up: This episode contains discussions of psychological, financial, sexual, and emotional abuse, as well as family separation. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when the person you love and trust with your dreams turns out to be a master manipulator? How do you escape when your abuser is not only charming and powerful, but also an award-winning reality tv producer who knows how to shape narratives both on and off the screen?\n\nIn this episode, Lisa Phillips welcomes Jane Doe, a devoted mother and accomplished professional, who bravely shares her harrowing journey through the labyrinth of coercive control. Jane reveals how her abuser, a celebrated producer with accolades and industry connections, used his expertise in storytelling, image management, and influence to isolate her, erode her self-worth, and ultimately weaponize the legal system against her.\n\nJane’s story exposes the chilling reality of psychological abuse that leaves no visible scars but inflicts deep wounds. She recounts how her partner’s charm quickly turned to control: love-bombing, social isolation, financial dependence, and relentless gaslighting. But the abuse didn’t end at home. When Jane tried to break free, her ex leveraged his resources and reputation to manipulate the courts, painting her as unstable and unfit, and orchestrating a campaign that ultimately separated her from her children.\n\nLisa and Jane discuss the urgent need for legal reforms to recognize coercive control as a form of domestic violence, and the devastating impact when abusers exploit their power and the justice system to continue their reign of control. Jane’s resilience and determination to end the cycle of trauma for her family are a testament to the strength of survivors everywhere.\n\nThis episode is a call to action: to support survivors, challenge the systems that enable abusers, and demand accountability, no matter how powerful the perpetrator.\n\n“From now on…we are the light, the beacon of warmth, of clarity, to help anyone to navigate this battlefield.” \n\n\nAbout Jane Doe:\n\nJane Doe is, foremost, a devoted mother committed to ending intergenerational trauma in her family. She is also an award-winning academic, athlete, and artist with a passion for outdoor adventure, meditation, and prayer.  A Digital Producer and Designer by professional trade. A recovering codependent and domestic violence survivor. Her recent experience within the criminal and legal system have been a rollercoaster of disappointment and victory. Driven by a desire to empower others, Jane is deeply committed to raising awareness about the insidious nature of coercive control abuse, advocating for accountability, justice and supporting survivors on their healing journey. \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/",
      "release": "2025-05-01T12:45:00Z",
      "duration": "02:18:33.0250000",
      "explicit": true,
      "spotifyId": "0cHykVsTd8oHVYaVZJYtXx",
      "appleId": 1000705689685,
      "youTubeId": "NAKb0n0ZJiM",
      "subjects": [
        "Cult Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0cHykVsTd8oHVYaVZJYtXx",
        "apple": "https://podcasts.apple.com/podcast/the-producer-inside-the-mind-games-of-coercive-control/id1766405014?i=1000705689685",
        "youtube": "https://www.youtube.com/watch?v=NAKb0n0ZJiM"
      }
    },
    {
      "id": "4c92260b-0170-46fb-b81b-a9f296d16c55",
      "title": "THE SEX COACH: How to Handle Kinks, Triggers \u0026 Red Flags",
      "description": "#dating #kinks #bdsm #redflags \n\nJust a heads up: This episode contains discussions of sexual assault, abuse through exploitation of kink and BDSM, and relationships after abuse. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat does it really mean to date after surviving abuse? How do you navigate intimacy, desire, and vulnerability when your past trauma still echoes in the present?\n\nIn this candid episode, Lisa welcomes a certified sex and dating coach, Myisha Battle, who specializes in helping survivors reclaim their sexuality and confidence. Together, they dive deep into the complexities of dating after trauma—exploring how kinks, triggers, and red flags can show up in new relationships.\n\nThe conversation unpacks the unique challenges survivors face: learning to communicate boundaries, recognizing and managing triggers, and distinguishing between healthy exploration and harmful dynamics. Myisha shares practical tools for building trust, handling difficult conversations about consent and pleasure, and spotting red flags before they become patterns.\n\nLisa and Myisha emphasize that survivors deserve safe, fulfilling relationships and that healing is possible. They discuss the importance of self-compassion, community support, and seeking guidance from trauma-informed professionals.\n\nThis episode is a must-listen for anyone navigating dating after abuse or supporting a loved one through their healing journey. It’s about empowering survivors to reclaim their sexuality on their own terms—and reminding everyone that pleasure and safety can coexist.\n\n“From now on… I will listen to myself and my innate feelings about people.” \n\n*Please note that the “S” in FRIES is for “specific,” not “safe/sane” as it was stated in the episode.\n\nIf you are interested in joining an online survivor group, check out the SASS website - https://www.sass-lane.org/support-groups/\n\nAbout Myisha Battle:\n\nMyisha Battle is a certified sex and dating coach, educator and author. She is the host of KCRW’s How’s Your Sex Life? podcast and writes the Real Love column for TIME. Her book, This Is Supposed To Be Fun: How To Find Joy in Hooking Up, Settling Down, and Everything In Between is available now wherever you like to buy books. \n\nFollow Myisha Battle:\nWebsite:  https://myishabattle.com/\nBuy her book: https://myishabattle.com/this-is-supposed-to-be-fun\nInstagram: https://www.instagram.com/MyishaBattle\nX:  https://x.com/MyishaBattle\nPodcast: https://podcasts.apple.com/us/podcast/hows-your-sex-life/id1709536776\nTime\u0027s Column: https://time.com/tag/real-love/\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#datingcoach #myishabattle #cyclebreaker #awareness #trauma #abuse #healing #storytelling  #jeffreyepstein #podcast",
      "release": "2025-04-24T12:45:00Z",
      "duration": "02:00:45.4530000",
      "explicit": true,
      "spotifyId": "3JVIF92aMZspqIUAKKhgMe",
      "appleId": 1000704737599,
      "youTubeId": "mTpxm-_mZGQ",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JVIF92aMZspqIUAKKhgMe",
        "apple": "https://podcasts.apple.com/podcast/the-sex-coach-how-to-handle-kinks-triggers-red-flags/id1766405014?i=1000704737599",
        "youtube": "https://www.youtube.com/watch?v=mTpxm-_mZGQ"
      }
    },
    {
      "id": "992b545d-5ea0-4410-848c-99d82c8770b7",
      "title": "THE POSTPARTUM NIGHTMARE: He changed the SECOND I gave birth!",
      "description": "#dv #domesticviolence #cyclebreaker\n\nJust a heads up: This episode contains discussions of intimate partner violence, physical, emotional, financial, and psychological abuse, as well as postpartum depression and suicidal ideation. Some may find it upsetting. We encourage you to take care of yourself.\n\n\u0022I thought having a baby would bring us closer…instead, it unleashed a MONSTER.\u0022\n\nIn today\u0027s raw and emotional episode, Lisa sits down with Taylor Windmon, a survivor whose seemingly perfect relationship took a dark and terrifying turn immediately after childbirth. Taylor shares the shocking reality of her postpartum experience—how the man she loved transformed into an abusive figure, using her vulnerability against her.\n\nTaylor reveals how her partner weaponized her postpartum depression, using it to gaslight and isolate her, and threatening to take her child away. She recounts the reckless anger, the physical altercations, and the chilling moments when she realized she was trapped in a cycle of abuse. She also discusses the red flags she had missed, such as the violent language and anger directed toward other drivers, which are indicators of a potentially abusive personality.\n\nThis episode isn\u0027t just about Taylor\u0027s survival; it\u0027s a crucial discussion about postpartum abuse and the ways abusers exploit the unique vulnerabilities of new mothers. It\u0027s a vital resource for anyone who suspects something is wrong in their relationship, or who wants to support loved ones navigating the challenges of new parenthood. It also highlights the power of community – Taylor’s family and friends rallied alongside her to help her create a safe and loving home for her and her kids.\n\n“From now on…I am going to put myself and my children first, and I\u0027m gonna love correctly, and I\u0027m going to be loved correctly.”\n\nAbout Taylor Windmon\n\nTaylor is a passionate advocate for breaking the cycle of domestic violence. Having survived two abusive relationships spanning mental, emotional, financial and physical abuse, she draws from her experience to help others recognize the signs of abuse, find support and reclaim their self worth, inspired by her own upbringing with a young mother who also endured violence, Taylor Windmon is determined to change the narrative for future generations through her growing Tiktok platform, she offers education, empowerment and hope to those seeking a path to freedom.\n\n\nFollow Taylor Windmon:\nTikTok: https://www.tiktok.com/@tatortotztay\nInstagram: https://www.instagram.com/Tatortotztayy\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n\n#listentosurvivors #family #dv #domesticviolence #intimatepartnerviolence #cyclebreaker #awareness #trauma #abuse #healing #storytelling",
      "release": "2025-04-17T12:45:00Z",
      "duration": "01:03:13.3190000",
      "explicit": true,
      "spotifyId": "7bUqbz8cjy8tRYWVEQvp1R",
      "appleId": 1000703872084,
      "youTubeId": "5u4Lvha7Kqk",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7bUqbz8cjy8tRYWVEQvp1R",
        "apple": "https://podcasts.apple.com/podcast/the-postpartum-nightmare-he-changed-the-second-i-gave-birth/id1766405014?i=1000703872084",
        "youtube": "https://www.youtube.com/watch?v=5u4Lvha7Kqk"
      }
    },
    {
      "id": "41eea84f-295c-4de8-8e34-c43a898048cb",
      "title": "THE NEIGHBOR: A family’s silence and a child’s suffering",
      "description": "#sextrafficking #grooming #listentosurvivors\n\nJust a heads up: This episode contains discussions of childhood sexual abuse and sex trafficking. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when the person you trust most—your own mother—becomes the architect of unimaginable harm? Today, we delve into the harrowing story of Cindy Lê, a survivor of familial sex trafficking who, starting at 8 years old, endured years of abuse facilitated by her own mother.\n\nCindy shares her journey of survival, beginning with her family\u0027s financial struggles that led her mother to make a devastating \u0022deal\u0022 with a neighbor across the street. Cindy recounts how her mother essentially traded her to this predator, who masked his exploitation as love and trust. For years, Cindy was groomed and sexually assaulted while her mother turned a blind eye in exchange for money. When Cindy did tell her siblings the police got involved. Yet her mother actively encouraged her to “let it go” and not pursue prosecution. Her story sheds light on the systemic failures and personal betrayals that allowed this abuse to persist.\n\nLisa welcomed Cindy to discuss not only her survival but her path to healing and the complex emotions she grapples with, including her feelings toward her mother. Together, they confront the dark realities of grooming, the devastating impact of a parent’s choices, and the cultural silence surrounding abuse. Cindy’s resilience is a testament to the human spirit, and her advocacy aims to help others find their way out of dark times to prevent the heartache she once endured. \n\nThis episode is a call to action: to break the silence, support survivors, and ensure no child has to endure what Cindy did. It’s about exposing predators hiding in plain sight and empowering survivors to reclaim their stories.\n\nAbout Cindy Lê\n\nCindy Lê is a thriving business owner, a loving wife, a caring friend, and a devoted mother. Cindy’s journey does not end with her survival. She has taken it upon herself to shine a light on the dark reality of familial sex trafficking, a subject that is often surrounded by silence. \n\nFollow Cindy Lê:\nWebsite: https://www.beautybymrscindy.com/\nInstagram: https://www.instagram.com/ms_cindyle/\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#family #mom #pedophile #familialsextrafficking #predator #awareness #trauma #abuse #healing",
      "release": "2025-04-10T12:45:00Z",
      "duration": "01:04:30.9810000",
      "explicit": true,
      "spotifyId": "5qZV2tiy2tNXKbBwc7F7Fc",
      "appleId": 1000703011228,
      "youTubeId": "iKWxEXgE7Hk",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qZV2tiy2tNXKbBwc7F7Fc",
        "apple": "https://podcasts.apple.com/podcast/the-neighbor-a-familys-silence-and-a-childs-suffering/id1766405014?i=1000703011228",
        "youtube": "https://www.youtube.com/watch?v=iKWxEXgE7Hk"
      }
    },
    {
      "id": "f08e7619-4856-44f8-b9b8-9be6ffc5c9ff",
      "title": "THE ONLINE GROOMER: The secret lives of gay teens being targeted on dating apps",
      "description": "#protectmyimage #digitaltrafficking #grooming \n\nJust a heads up: This episode contains discussions of child sexual abuse, nonconsensual distribution of child sexual abuse materials, grooming, and eating disorders due to PTSD. Some may find it upsetting. We encourage you to take care of yourself. \n\nWhere are the safe spaces for young gay teens to connect when community is non-existent at school? Why not the internet? Why not a dating app?\n\nToday, we’re highlighting the fact that predators search for minors on dating apps to exploit, coerce, and groom, especially in the gay community. These teens are often blackmailed to remain silent and live these secret lives of pain. The systems that are supposed to protect often don’t take these predators seriously or sweep this exploitation under the rug. In the end, the survivor is further harmed and silenced.\n\nLisa welcomes Albert Flores a survivor, advocate, and storyteller passionate about creating safer spaces for vulnerable communities. Albert shares how they joined a dating app geared toward the LGBTQ community at 14 in the hopes of connecting with other local gay teens. Unfortunately, he found that local adult men sought him out instead. He was groomed by multiple men, even the older brother of a famous influencer family that created content geared toward children.\n\nWhen incidents of exploitation were made public, Albert’s school administration, local police force, friends, and even the app safety protocols woefully mishandled these situations. Albert has been on a journey processing the effects of their trauma and PTSD. Now, Albert uses his voice to raise awareness about online safety, survivor support, and mental health.\nWhat happened to Albert should have never been possible. We’re grateful for their courage to tell their story.\n\nThis episode is all about education, prevention, and a call to action to hold these institutions and companies accountable so that teens can connect safely on the internet. \n\nFrom now on, we will speak up for ourselves and say no. \n\nFollow Albert Flores:\nInstagram: https://www.instagram.com/albertflrz/\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#listentosurvivors #awareness #CSA #trauma, #abuse, #healing, #storytelling #pedophile #survivorstories #podcast #survivorcommunity #toxicrelationship #fromnowon #sasurvivor #endexploitation #predator #groomer",
      "release": "2025-04-03T12:45:00Z",
      "duration": "01:16:05.9680000",
      "explicit": true,
      "spotifyId": "5K4J5O08umuPFfk1yii9Ut",
      "appleId": 1000702051621,
      "youTubeId": "z0vxpftRnuw",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5K4J5O08umuPFfk1yii9Ut",
        "apple": "https://podcasts.apple.com/podcast/the-online-groomer-the-secret-lives-of-gay/id1766405014?i=1000702051621",
        "youtube": "https://www.youtube.com/watch?v=z0vxpftRnuw"
      }
    },
    {
      "id": "9273e252-00ab-401c-b43e-2f2a54f6985b",
      "title": "THE IMPOSTER: A wolf in sheep’s clothing – betraying native heritage",
      "description": "#mmiw #nativewomen #healing \n\nJust a heads up: This episode contains discussions of coercion, sexual assault, stalking, and predatory behavior.  Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when someone claiming to be part of your community isn’t who they say they are? When they use culture as a mask, trust as a weapon, and deception as a means of control?\n\nToday, we’re confronting the historical cycle of submission, manipulation, and control—a cycle that predators exploit to their advantage. For generations, Indigenous communities have endured forced assimilation, systemic oppression, and silencing, conditioning many to submit to authority, to ignore red flags, and to stay silent in the face of abuse. But what happens when someone who claims to be a part of your community turns out to be a fraud?\n\nLisa welcomes Chiffon Lark, an artist, advocate, and Indigenous woman who survived a calculated campaign of deception, coercion, and emotional abuse. What started as a promising connection quickly unraveled into something far more sinister. Chiffon was targeted by a man who fabricated his identity, infiltrated her community, and used trust as a weapon. From love bombing to gaslighting to financial control, his manipulation was relentless—but so was Chiffon’s resilience.\n\nThis episode is about breaking free from cycles of submission, reclaiming power, and exposing imposters who hide behind culture, trust, and false promises.\n\nFrom now on… “I will execute my right to honor myself first so that I can honor my community.”\n\nAbout Chiffon Lark\n\nChiffon Lark (b.1989) is a full time Artist/Illustrator in San Diego, CA. Her father is a member of the White Mountain Apache Tribe (b.1965 Texas) and her mother (b.1968 Arizona) is Mescalero Apache and Coahuiltecan descent.\n\nShe is an Indigenous advocate for environmental sovereignty for all Native People and Wildlife. Chiffon has worked with both non-indigenous and native-led organizations throughout the US that are dedicated to cultural conservation and climate preservation.\n\nFollow Chiffon Lark:\nWebsite: https://www.chiffonlark.com/\nInstagram: https://www.instagram.com/chiffonlark/\nTo learn more about the Missing and Murdered Indigenous Women (MMIW) movement, go to https://www.nativehope.org/missing-and-murdered-indigenous-women-mmiw/ and https://www.bia.gov/service/mmu/missing-and-murdered-indigenous-people-crisis\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n#saytheirnames #sayhername #mmiw #nativewomen #healing #divinefeminine #daughtersoftheland #alcoholinkart #artist #nativewomenrising #trauma #abuse #healing #storytelling #jeffreyepstein #podcast",
      "release": "2025-03-27T12:45:00Z",
      "duration": "02:19:02.7520000",
      "explicit": true,
      "spotifyId": "0wUfX6QcK6THYoZjFpqlSe",
      "appleId": 1000701084965,
      "youTubeId": "00RBONO_L5g",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0wUfX6QcK6THYoZjFpqlSe",
        "apple": "https://podcasts.apple.com/podcast/the-imposter-a-wolf-in-sheeps-clothing-betraying/id1766405014?i=1000701084965",
        "youtube": "https://www.youtube.com/watch?v=00RBONO_L5g"
      }
    },
    {
      "id": "bf8b10da-3c0a-40b0-8d3d-213c225d77fb",
      "title": "THE TRAUMA BOND: The Dark Triad, abuse of power, and gaslighting",
      "description": "#narcissisticabuse #traumabond #toxicrelationship\n\nJust a heads up: This episode contains discussions of intimate partner violence, predatory behavior, and coercive control. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhy is it so hard to leave an abusive relationship? Why do survivors stay, even when the red flags are undeniable? The answer lies in one of the most powerful psychological traps—the trauma bond.\n\nToday, we’re diving deep into the dark triad—narcissism, Machiavellianism, and psychopathy—and how these personality traits drive manipulation, gaslighting, and coercive control. Abusers don’t just use physical violence; they weaponize charm, isolation, and intermittent reinforcement to keep victims emotionally tethered. And they don’t act alone—there’s an entire system of enablers ensuring their power remains intact.\n\nLisa welcomes Dr. Nadine Macaluso, former model, therapist, and author of Run Like Hell: A Therapist’s Guide to Recognizing, Escaping, and Healing from Trauma Bonds. Known to many as “Dr. Nae,” she is the real-life inspiration behind Naomi Belfort’s character in The Wolf of Wall Street. After surviving an eight-year marriage to Jordan Belfort, marked by abuse, greed, and trauma, Dr. Nae turned her trauma into a mission—educating others on how to break free from toxic cycles and reclaim their power.\n\nIn this episode, Lisa and Dr. Nae uncover the warning signs of trauma bonds, the psychological tricks abusers use to maintain control, and how survivors can break free. Survivors deserve more than just an escape—they deserve healing, empowerment, and the ability to write a new story on their own terms.\n\nThis episode is about understanding, empowerment, and reclaiming your life.\nFrom Now On… don\u0027t self abandon, don\u0027t self sacrifice in the name of love.\n\nAbout Dr. Nadine Macaluso: \nHer journey of trauma and healing inspired her to return to school at age 39, where she earned her Master\u0027s in counseling and a Ph.D. in somatic psychotherapy. She further specialized with a two-year postdoctoral training in the Neuro-affective Relational Model (NARM).\n\nAs a therapist, Dr. Macaluso combines her education and personal experiences to help others heal from trauma. Her practice focuses on assisting patients in connecting with their authentic selves, fostering confidence, resilience, and agency. Dr. Macaluso firmly believes in the potential for post-traumatic growth, instilling hope in her patients and guiding them to reach their potential in life and love.\n\nFollow Dr. Nadine Macaluso:\nWebsite: https://drnae.com/\nInstagram: https://www.instagram.com/therealdrnadine/\nFacebook: https://www.facebook.com/drnaelmft\nTikTok: https://www.tiktok.com/@drnaelmft\nX: https://x.com/therealdrnadine\nYouTube:  @TheRealDrNadine  \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#narcbehavior #drnadinemacaluso #wolfofwallstreet #trauma #abuse #healing #storytelling #jeffreyepstein #podcast",
      "release": "2025-03-20T12:45:00Z",
      "duration": "01:21:10.3210000",
      "explicit": true,
      "spotifyId": "3d7Xo73Jsh3jq7mcTXSBUy",
      "appleId": 1000700114826,
      "youTubeId": "Y_jFcYsBgVM",
      "subjects": [
        "Cult Psychology",
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3d7Xo73Jsh3jq7mcTXSBUy",
        "apple": "https://podcasts.apple.com/podcast/the-trauma-bond-the-dark-triad-abuse/id1766405014?i=1000700114826",
        "youtube": "https://www.youtube.com/watch?v=Y_jFcYsBgVM"
      }
    },
    {
      "id": "a586f62c-40af-4966-aac9-d898d13805da",
      "title": "THE WHISTLEBLOWER: Hip hop \u0026 the Vegas “underground” economy",
      "description": "#humantrafficking #sextrafficking #hiphop \n\nJust a heads up: This episode contains discussions of sexual assault and sex trafficking. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when someone dares to expose the truth about an industry built on power, secrecy, and exploitation? How deep does the corruption go when trafficking, hip hop, and the Vegas elite collide?\n\nToday, we’re pulling back the curtain on the dark underbelly of the entertainment world—where money, influence, and exploitation intersect. Sex trafficking isn’t just happening in the shadows; it thrives in high-end hotels, VIP suites, and behind the flashing lights of Las Vegas. Those who profit from this underground economy aren’t just traffickers and pimps—they include law enforcement, media outlets, and powerful figures who choose silence over accountability.\n\nLisa welcomes Brian Joseph, an investigative journalist and author of Vegas Concierge: Sex Trafficking, Hip Hop, and Corruption in America. Brian’s groundbreaking reporting reveals how the trafficking industry operates within elite circles, how law enforcement often turns a blind eye, and how survivors are left to fight for justice alone. Together, they explore the case of Mally Mall, a hip-hop producer and convicted trafficker, and discuss the disturbing ways the entertainment industry shields its own.\n\nThis episode is about speaking truth to power, holding corrupt systems accountable, and standing with those who risk everything to expose the truth.\n\nFrom Now On… sex trafficking is a priority amongst American society to eliminate. \n\nFollow Brian Joseph @vegasconciergebook on Instagram. @bjoseph1 and @vconciergebook on X. To learn more about Vegas Concierge: Sex Trafficking, Hip Hop, and Corruption in America  and to purchase a copy go to vegasconciergebook.com.\n\n\nFollow Brian Joseph:\nWebsite: https://www.vegasconciergebook.com/\nInstagram: https://www.instagram.com/vegasconciergebook\nX: https://x.com/vconciergebook\nX: https://x.com/bjoseph1\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la/podcast\nInstagram: https://www.instagram.com/iamlisaphillips/\nTikTok: https://www.tiktok.com/@lisaphillips_pod\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on Apple Podcasts, Spotify, and YouTube.\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/",
      "release": "2025-03-13T13:00:00Z",
      "duration": "00:53:19.1110000",
      "explicit": true,
      "spotifyId": "1ja9kaNQL0IN9WJ9MQ96YU",
      "appleId": 1000699033473,
      "youTubeId": "RYbey3g65fA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ja9kaNQL0IN9WJ9MQ96YU",
        "apple": "https://podcasts.apple.com/podcast/the-whistleblower-hip-hop-the-vegas-underground-economy/id1766405014?i=1000699033473",
        "youtube": "https://www.youtube.com/watch?v=RYbey3g65fA"
      }
    },
    {
      "id": "17df3a90-7ae5-4533-9c34-e7c2dea71f75",
      "title": "THE PEDOPHILE: Online Grooming, Sextortion, and Stolen Innocence",
      "description": "#protectmyimage #CSA #deepfake\n\nJust a heads up: This episode contains discussions of online predatory grooming, sextortion of a minor, and sexual assault of child. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat if the person you trusted online wasn’t who they claimed to be? What if a friendly conversation turned into manipulation, blackmail, and a nightmare you couldn’t escape?\n\nToday, we’re exposing the terrifying reality of online predators—how they groom, deceive, and exploit children in the digital age. Digital human trafficking and sextortion don’t always start with violence; they often begin with trust. Social media, gaming apps, and private messages have become hunting grounds for predators who hide behind screens, using manipulation to lure their victims into a dangerous trap.\n\nLisa welcomes Summer Beach, a survivor and fierce advocate who was groomed, blackmailed, and ultimately assaulted by an online predator at just 12 years old. Summer courageously shares her story to shine a light on the hidden epidemic of online child exploitation and to empower young people and parents to recognize the warning signs before it’s too late.\n\nThis episode is about breaking the silence, demanding accountability, and taking back power from those who prey on the most vulnerable. \n\nFrom Now On… we will not wish bad things upon ourselves. \n\nFollow Summer Beach @summerbeachglobal236.1 and @summerathebeach_xo on Instagram and @summerathebeach_xo on TikTok. Summer supports The Wolf Project Inc., a nonprofit combating online predators by reporting them to law enforcement. Summer also partners with Foundation RA raising awareness about various legislative initiatives combating online image-based sexual abuse, as well as a place for survivors to go when they need support or their abuse taken down off the internet.\n\nFollow Summer Beach:\nInstagram: https://www.instagram.com/summerbeachglobal236.1\nInstagram: https://www.instagram.com/summerathebeach_xo\nTikTok: https://www.tiktok.com/@UCd6hqS5YwKAW09FMd5eCQTA \nThe Wolf Project Inc.: https://www.thewolfprojectinc.com/home\nFoundation RA: https://foundationra.com/\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#protectact #IBSA #digitaltrafficking #awareness #ibsaawareness #deepfakes #CSAM #truth #humantraffickingawareness #humantrafficking #listentosurvivors #trauma #abuse #healing #storytelling  #jeffreyepstein #podcast",
      "release": "2025-03-06T13:45:00Z",
      "duration": "01:32:24.1240000",
      "explicit": true,
      "spotifyId": "0lOb0YOFfYPE3W0h96YpIt",
      "appleId": 1000698092879,
      "youTubeId": "uRE8G4oO5eU",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0lOb0YOFfYPE3W0h96YpIt",
        "apple": "https://podcasts.apple.com/podcast/the-pedophile-online-grooming-sextortion-and/id1766405014?i=1000698092879",
        "youtube": "https://www.youtube.com/watch?v=uRE8G4oO5eU"
      }
    },
    {
      "id": "46d3609b-7d01-4590-9457-4b6b6e097cb8",
      "title": "THE LINEBACKER: Lies, control and the illusion of security",
      "description": "#nfl #survivorstories #healing\n\nThis episode contains discussions of a high-control abusive relationship, which includes psychological, financial, and emotional abuse. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhen the person you trust the most is also the one who breaks you, how do you find your way back to yourself? What happens when love is used as a weapon, and security is just an illusion?\n\nToday, we’re exposing the hidden reality of emotional, psychological, and financial abuse behind closed doors—especially when the abuser is a powerful figure. The story of intimate partner violence in the NFL is more than just headlines; it’s a deeply rooted issue where fame and wealth often shield perpetrators while silencing survivors.\n\nLisa welcomes Tori Darling, a mother, business owner, and the creator of the viral TikTok series Who the F Did I Almost Marry? NFL Edition. Tori takes us inside her relationship with a former NFL player, revealing the manipulation, deception, and financial control that kept her trapped. From love bombing to gaslighting to the moment she knew she had to escape, Tori shares her journey of survival and reclaiming her power.\n\nTogether, Lisa and Tori discuss the complexities of healing, the challenges of leaving an abusive relationship when financial control is a weapon, and the power of speaking out despite the fear. Survivors deserve to be believed, supported, and empowered—not dismissed or shamed.\n\nThis episode is about dismantling the illusion of security, recognizing the red flags, and standing with survivors who refuse to stay silent.\n\nFrom now on… pay attention to red flags and see them for exactly what they are.\n\nFollow Tori Darling:\nTikTok: https://www.tiktok.com/@toridarlinglife\nInstagram: https://www.instagram.com/toridarlinglife\nYouTube: @ToriDarlingLife \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n #tiktok #wag #financialabuse #psychologicalabuse #survivorstories #emotionalabuse #endexploitation #SpeakTruth #loverboy  #listentosurvivors #trauma #abuse #storytelling  #jeffreyepstein #podcast\n#linebacker #nflfootball",
      "release": "2025-02-27T13:45:00Z",
      "duration": "01:30:41.9060000",
      "explicit": true,
      "spotifyId": "0bhmbpwPNO46yf1SE5MwqP",
      "appleId": 1000696550812,
      "youTubeId": "bIlnLMkJsRc",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0bhmbpwPNO46yf1SE5MwqP",
        "apple": "https://podcasts.apple.com/podcast/the-linebacker-lies-control-and-the-illusion-of-security/id1766405014?i=1000696550812",
        "youtube": "https://www.youtube.com/watch?v=bIlnLMkJsRc"
      }
    },
    {
      "id": "3c776c4d-44b0-4451-a7d2-49e23231e6de",
      "title": "THE ESCAPE: Leaving Abuse and Rebuilding Life",
      "description": "#psychologicalabuse #survivorstories #healing \n\nJust a heads up: This episode contains discussions of intimate partner violence, predatory behavior, and coercive control. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat would you do if the person you loved became the person you feared most?\n\nImagine knowing you need to leave, but the risk of walking away could cost you everything. Survivors of intimate partner violence face impossible choices, navigating a system that often fails to protect them. Leaving an abusive relationship isn’t just about walking away—it’s about reclaiming your power, your voice, and your future. \n\nLisa welcomes Va’rai Unique, a serial entrepreneur, award-winning consultant, and author of Unlocking Your Renaissance. She is also a survivor. From enduring years of psychological and physical abuse to escaping and rebuilding her life (twice), Va’rai walks us through the harsh realities survivors face. Lisa and Va’rai discuss how abusers manipulate and how the legal system often works against victims.\n\nToday Va’rai is free and rebuilt a life on her own terms. Va’rai proves that survival is just the beginning—thriving is the next step.\n\nThis episode is about resilience, hope, and the unshakable courage to start over. \n\nFrom now on…we’re going to love ourselves unapologetically.\n\nABOUT Va\u0027rai:\nVa’rai is a dynamic force in the world of business strategy and personal branding, known for her innovative approach to transforming individuals and organizations alike. A serial entrepreneur with a knack for unlocking potential, she has built a reputation as one of the most sought-after consultants in her field.\n\nHer career is adorned with prestigious accolades, including the Achievement of the Year Award presented at the House of Lords in London, a testament to her trailblazing contributions. In 2023, Va’rai was celebrated as The Most Innovative Consultant at the Influential Business Women Awards and earned the title of Business Strategy Consultancy of the Year at the Global Awards 2023/24.\n\nVa’rai’s expertise extends beyond consulting into motivational speaking, where she has graced stages in the United Kingdom, inspiring audiences with her transformative insights. She is also the celebrated author of Unlocking Your Renaissance, a powerful guide for those seeking to redefine themselves and embrace their authentic identity through creative rebranding.\n\nFollow Va\u0027rai:\nWebsite: https://www.varaiunique.com/\nInstagram: https://www.instagram.com/varaiunique\nInstagram: https://www.instagram.com/entirelyunique/\nBuy Unlocking Your Renaissance: https://www.barnesandnoble.com/w/unlocking-your-renaissance-varai-unique/1144751876\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#survivorstories #emotionalabuse #endexploitation #SpeakTruth #loverboy #listentosurvivors #trauma #abuse #healingjourney  #storytelling  #jeffreyepstein #podcast",
      "release": "2025-02-20T13:45:00Z",
      "duration": "00:55:59.8950000",
      "explicit": true,
      "spotifyId": "5Ut6O5VSzPO9sd5coESg1e",
      "appleId": 1000694364052,
      "youTubeId": "Ha-exA6AkVE",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology",
        "_London"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Ut6O5VSzPO9sd5coESg1e",
        "apple": "https://podcasts.apple.com/podcast/the-escape-leaving-abuse-and-rebuilding-life/id1766405014?i=1000694364052",
        "youtube": "https://www.youtube.com/watch?v=Ha-exA6AkVE"
      }
    },
    {
      "id": "4af3c826-21a7-4d91-8329-cdd7e4f3339a",
      "title": "THE DATING APP: Swiping into a Nightmare PT 2",
      "description": "#dating #datingapps #podcast \n\nJust a heads up: This episode contains discussions of online predatory grooming, sexual assault, human trafficking, and stalking. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when a survivor, still searching for love and normalcy, re-enters the same dating app that led to her trauma?\n\nIn part two of our conversation, Lisa continues speaking with Jane Doe, an artist, tech professional, and survivor, as she shares what happened when she returned to the dating app many months after her assault—only to be matched with another predator.  What began as an attempt to reclaim her autonomy quickly turned into a chilling realization: predators and traffickers use dating apps as a hunting ground, and the platform’s algorithm may have led her straight into another dangerous encounter.\n\nThe professor from an elite school, with connections to many powerful and wealthy people, love-bombed her differently than her first match. Their relationship quickly escalated to her traveling many hours to an island. There, she was controlled – locked in a room, told when to eat, how to dress, when she could go outside, who she could work for, and more. \n\nAs time went on, threats to her safety became more apparent, and she escaped that relationship only to be met with professional stalking and intimidation. With the help of a trafficking resource center and family. Jane was able to relocate to an unknown location for her safety. Her life is forever changed by this abuse.\n\nJane came on From Now On to educate others on the intersection of tech \u002B exploitation through her own experiences. She wants to educate others on the complexities of sexual assault and human trafficking so that her own experiences can be utilized for good to help end exploitation, specifically as it relates to power imbalances and predatory playbooks. She believes if we collectively unpack and examine these playbooks, and step away from the associated shame that wasn\u0027t ours to begin with, we can start to see they mostly utilize the same tactics.Healing isn\u0027t a linear journey so she uses her good days to help others impacted by harm.\n\nFrom Now On…she’s not going to hide.\n\nThank you, Jane Doe. We are with you.\n\nBelow are some resources Jane Doe recommends: \n\nNational Center on Sexual Exploitation (NCOSE) –  a nonprofit defending human dignity. Opposing sexual exploitation. Leading the movement through research, litigation, corporate and legislative policy.  You can follow them @endexploitation on Instagram.\n\nRights4Girls  advocates for the dignity and rights of young women and girls so that every girl can be safe and live a life free of violence and exploitation. You can follow them @rights4girls on Instagram.\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n#psychologicalabuse #survivorstories #emotionalabuse #endexploitation #EndSexTrafficking #SpeakTruth #loverboy #datingapps #dating #predator #DigitalSafety #epstein #diddy #listentosurvivors #trauma #abuse #healing #storytelling  #jeffreyepstein",
      "release": "2025-02-13T13:45:00Z",
      "duration": "01:30:26.3900000",
      "explicit": true,
      "spotifyId": "5aQsVo1phzm4JWffXEoMvp",
      "appleId": 1000691860971,
      "youTubeId": "mTRsmWggrhc",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5aQsVo1phzm4JWffXEoMvp",
        "apple": "https://podcasts.apple.com/podcast/the-dating-app-swiping-into-a-nightmare-pt-2/id1766405014?i=1000691860971",
        "youtube": "https://www.youtube.com/watch?v=mTRsmWggrhc"
      }
    },
    {
      "id": "0b403732-4059-41e4-936d-6b91cf37419a",
      "title": "THE DATING APP: Swiping into a Nightmare PT 1",
      "description": "#dating #datingapps #podcast \n\nJust a heads up: This episode contains discussions of online predatory grooming, sexual assault, human trafficking, and stalking. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when the search for love on a dating app turns into a dangerous trap? How do predators use technology to exploit vulnerabilities, isolate victims, and avoid accountability??\n\nIn today’s episode, Lisa welcomes Jane Doe, an artist, tech professional, and survivor, to share her harrowing experience of meeting a predator through a dating app designed for professionals. What started as a promising match quickly spiraled into a nightmare of love bombing, coercion, and violence—exposing the hidden dangers lurking behind the search for connection.\n\nJane and Lisa unpack the dark reality of online dating, revealing how traffickers, abusers, and serial predators use these platforms to operate in plain sight. They also discuss the systemic failures that allow this exploitation to continue and what can be done to hold both predators and dating apps accountable.\n\nThis episode is a sobering reminder of the hidden dangers behind the search for connection and a call to action to create safer spaces online and off.\n\nStay tuned for part two of our conversation with Jane Doe as she shares what happens next when she gets back on the app.\n\nBelow are some resources Jane Doe recommends: \n\nNational Center on Sexual Exploitation (NCOSE) –  a nonprofit defending human dignity. Opposing sexual exploitation. Leading the movement through research, litigation, corporate and legislative policy.  You can follow them @endexploitation on Instagram.\n\nRights4Girls  advocates for the dignity and rights of young women and girls so that every girl can be safe and live a life free of violence and exploitation. You can follow them @rights4girls on Instagram.\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#psychologicalabuse #survivorstories #emotionalabuse #endexploitation #EndSexTrafficking #SpeakTruth #loverboy #datingapps #dating #predator #DigitalSafety #epstein #diddy #listentosurvivors #trauma #abuse #healing #storytelling  #jeffreyepstein",
      "release": "2025-02-06T13:45:00Z",
      "duration": "00:59:25.1130000",
      "explicit": true,
      "spotifyId": "6cYZBnSNl9VjBaeX9CGDSj",
      "appleId": 1000689641972,
      "youTubeId": "jXdqB_lBy28",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cYZBnSNl9VjBaeX9CGDSj",
        "apple": "https://podcasts.apple.com/podcast/the-dating-app-swiping-into-a-nightmare-pt-1/id1766405014?i=1000689641972",
        "youtube": "https://www.youtube.com/watch?v=jXdqB_lBy28"
      }
    },
    {
      "id": "f0a9c44c-ad1f-4b1d-872c-e37e639a4e04",
      "title": "THE TRANSFORMATION: She Created Her Vagina and Confronted the Shame",
      "description": "What does it take to reclaim your body and rewrite your story when society labels you as broken? How do you confront shame head-on and emerge stronger than ever? Today, we’re tackling the deep connection between shame, stigma, and self-worth. In this episode, Lisa welcomes Ally Hensley, author of Vagina Uncensored: A Memoir of Missing Parts . Diagnosed as a teenager with a rare medical condition, Mayer-Rokitansky-Küster-Hauser Syndrome (MRKH), which changed her life forever, Ally faced decades of shame, self-blame, and disconnection from her body. But through her journey of creating her vagina and confronting her trauma, she found resilience, purpose, and a voice that refuses to be silenced. Ally and Lisa dive deep into the power of confronting stigma and societal censorship around topics like abuse, body image, and sexual health. Together, they explore how storytelling and radical honesty can transform pain into strength, breaking the cycle of shame and empowering others to embrace their truths. This episode is all about transformation—healing from within, reclaiming your power, and redefining what it means to live authentically. From now on… let’s refuse to negotiate with our truths and embrace the courage to transform. Just a heads up: This episode contains discussions of Domestic violence, emotional abuse, and PTSD. Some may find it upsetting. We encourage you to take care of yourself. Ally Hensley is an author, speaker, and global ambassador for women\u0027s health. Born with MRKH syndrome, she advocates for awareness and support of this condition. Ally co-founded MRKH Australia and Global MRKH, and serves on the board of UK\u0027s MRKH Connect. Her podcast, Stigma Shakers, tackles taboo topics and has gained international recognition. VAGINA UNCENSORED: A Memoir of Missing Parts is her debut memoir, continuing her mission to redefine womanhood and challenge stigma surrounding sexual health. Follow Ally on Instagram @ally__hensley . To learn more about Ally’s work, check out allyhensley.com . Buy her book VAGINA UNCENSORED: A Memoir of Missing Parts here . Check out her podcast, Stigma Shakers, here . Follow Lisa Phillips @iamlisaphillips on Instagram. From Now On is produced by LA PHILLIPS MEDIA. Listen and follow on Apple Podcasts , Spotify , and YouTube . Have a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials. If today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below: If you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673) If you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree). PAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. \u0026#xfeff;Speak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other.",
      "release": "2025-01-30T13:45:00Z",
      "duration": "01:03:13.9720000",
      "explicit": true,
      "spotifyId": "7bCv0ruYWshoMT97HvqCmY",
      "appleId": 1000687143371,
      "youTubeId": "GLPk5eab1X0",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7bCv0ruYWshoMT97HvqCmY",
        "apple": "https://podcasts.apple.com/podcast/the-transformation-she-created-her-vagina-and/id1766405014?i=1000687143371",
        "youtube": "https://www.youtube.com/watch?v=GLPk5eab1X0"
      }
    },
    {
      "id": "c73c43f9-ff88-4dac-b616-b8ec5ded831f",
      "title": "THE ECONOMY OF ABUSE: Institutions Profit from Exploiting Survivors Pt 2",
      "description": "#economy  #survivorstories #traumaawareness \n\nJust a heads up: This episode contains discussions of sexual assault, sex trafficking, and predatory behavior. Some may find it upsetting. We encourage you to take care of yourself.\n\nToday, Lisa and Hana Katana, a musician, activist, and content creator, continue their conversation around the economy of abuse. One of the ways this system thrives is there a lack of education on what is sexual assault, consent, sex trafficking, and the reality of survivors trying to heal after an assault.\n\nLisa and Hana have a very frank conversation from survivor to survivor. Together, they are on a mission to collapse this economy of abuse and shift culture to support survivors and hold abusers accountable. \nNo longer will survivors allow their abusers be able to walk free and thrive. \n\nThis episode is all about education so that the general public can understand and support survivors who go public with their story of abuse. \n\n\nFrom now on… I am not ashamed. I’m empowered.\n\n\nHana Katana is a musician, activist, and content creator who exposed her abusers in the entertainment industry on social media. Since going viral, she has connected with other survivors of his abuse but has faced many attacks from her abuser\u0027s fans and the media. Hana Katana wants to foster safe spaces for survivors to speak out, so when other people are finally ready to name their abusers, they will be met with empathy and gratitude rather than victim blaming and shame.\n\nFollow Hana Katana:\nInstagram: https://www.instagram.com/TheHanaKatana\nX: https://x.com/katanaspeaks\nTikTok: https://www.tiktok.com/@hanakatanadragonslayer\nYouTube:  @HanaKatana  \nApple Music: https://music.apple.com/us/artist/hana-katana/1318587827\nSpotify: https://open.spotify.com/artist/3DKsmEfSVbykozM5b9vIOf?si=mImWR-0dTr-050IGaghClw\u0026nd=1\u0026dlsi=70fbedcd692b41e1\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#HollywoodExposed #ExposeTheTruth  #jeffreyepstein #diddy #tiktokviral #audition #talentagent #PredatoryBehavior #MeToo #TimesUp #BelieveSurvivors #standwithsurvivors",
      "release": "2025-01-23T13:45:00Z",
      "duration": "00:54:06.7850000",
      "explicit": true,
      "spotifyId": "6ldtx3ZO8M1L5QprP0Vlvy",
      "appleId": 1000685171492,
      "youTubeId": "gbk53raYvGs",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ldtx3ZO8M1L5QprP0Vlvy",
        "apple": "https://podcasts.apple.com/podcast/the-economy-of-abuse-institutions-profit-from/id1766405014?i=1000685171492",
        "youtube": "https://www.youtube.com/watch?v=gbk53raYvGs"
      }
    },
    {
      "id": "34ce25a7-a993-4e34-af40-7a6bac234a9c",
      "title": "THE ECONOMY OF ABUSE: Institutions Profit from Exploiting Survivors PT 1",
      "description": "#economy  #survivorstories #traumaawareness \n\nJust a heads up: This episode contains discussions of sexual assault, sex trafficking, and predatory behavior. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhen a survivor comes forward and tells their story publically, how do you feel? Do you support them? Do you distrust their story? What happens when the media gets a hold of the survivor’s story?\n\nToday, we’re confronting the issue of the economy of abuse. The media, the entertainment industry, and the justice system all profit from exploiting a survivor. This is why survivors often take years to come forward with their stories. Rather than being supported and encouraged, they are judged, dissected, and questioned.\n\nLisa welcomes Hana Katana, a musician, activist, and content creator who exposed her abusers in the entertainment industry on social media. It went viral. Hana and Lisa discuss how, since going viral, she experienced exploitation from the media, the LAPD, and the rapper\u0027s fans. Although these powerful institutions use fans to question her credibility, aka she’s a “gold digger,” in reality, the media is profiting off of her story. \n\nHana and Lisa want survivors who come forward to be supported given grace and empathy rather than victim blaming or shame.\n\nThis episode is all about calling out the systems that further harm survivors and holding these institutions accountable.\n\nFrom now on… you’ll have to stay tuned for next week’s episode to find out. \n\nHana Katana is a musician, activist, and content creator who exposed her abusers in the entertainment industry on social media. Since going viral, she has connected with other survivors of his abuse but has faced many attacks from her abuser\u0027s fans and the media. Hana Katana wants to foster safe spaces for survivors to speak out, so when other people are finally ready to name their abusers, they will be met with empathy and gratitude rather than victim blaming and shame.\n\nFollow Hana Katana:\nInstagram: https://www.instagram.com/TheHanaKatana\nX: https://x.com/katanaspeaks\nTikTok: https://www.tiktok.com/@hanakatanadragonslayer\nYouTube: @HanaKatana \nApple Music: https://music.apple.com/us/artist/hana-katana/1318587827\nSpotify: https://open.spotify.com/artist/3DKsmEfSVbykozM5b9vIOf?si=mImWR-0dTr-050IGaghClw\u0026nd=1\u0026dlsi=70fbedcd692b41e1\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#HollywoodExposed #ExposeTheTruth  #jeffreyepstein #diddy #tiktokviral #audition #talentagent #PredatoryBehavior #MeToo #TimesUp #BelieveSurvivors #standwithsurvivors",
      "release": "2025-01-16T13:45:00Z",
      "duration": "01:06:17.2470000",
      "explicit": true,
      "spotifyId": "5fuq28AVmtLUAwm27A4Sj4",
      "appleId": 1000684234940,
      "youTubeId": "ziHlzTDRbME",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5fuq28AVmtLUAwm27A4Sj4",
        "apple": "https://podcasts.apple.com/podcast/the-economy-of-abuse-institutions-profit-from/id1766405014?i=1000684234940",
        "youtube": "https://www.youtube.com/watch?v=ziHlzTDRbME"
      }
    },
    {
      "id": "c968fe3f-fda2-4eb3-9451-64a23a7da977",
      "title": "THE NARCISSIST: Trapped in a cult of one",
      "description": "What does it mean to be in and escape a “cult of one”? How can we change the conversation around narcissistic abuse to support survivors and break the cycle of harm? In this episode, Lisa welcomes Vanessa Reiser, a therapist, survivor, and author of Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People. Together, they confront the devastating realities of narcissistic abuse, detail the Tell a Therapist’s Hierarchy of Restoration and the steps survivors need to take when trying to break free. Vanessa shares her groundbreaking insights on the parallels between narcissistic relationships and cult dynamics, unveiling how narcissists use tactics like love bombing, future faking, mirroring, triangulation, and isolation to manipulate their prey. Lisa and Vanessa discuss the narcissist playbook and how they use many forms of punishment to control their “cult of one.” Through Vanessa’s book and personal journey, she emphasizes the importance of recognizing abuse, reclaiming autonomy, and building a support system to foster healing. This episode is a powerful call to action, challenging the narratives that glorify toxic relationships, naming abuse, stopping an ecosystem of chaos, and cultivating a life of radical self-love. Survivors deserve more than survival—they deserve autonomy, joy, and respect. From now on… I will sit in truth. Follow Vanessa @vanessareiserlcsw on Instagram, @vanessareiser on TikTok, and @vanessareiserteletherapy on Facebook. You can learn more about Vanessa Reiser and her therapeutic services by going to tellatherapist.net . Buy her book Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People here . From Now On is produced by LA PHILLIPS MEDIA. Listen and follow on Apple Podcasts , Spotify , and YouTube . Have a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials. If today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below: If you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673) If you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree). PAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. \u0026#xfeff;Speak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-09T13:45:00Z",
      "duration": "01:09:39.5650000",
      "explicit": false,
      "spotifyId": "1gTKfCicuDGvYCX4aKeMtR",
      "appleId": 1000683319520,
      "youTubeId": "CQcoY45oBZQ",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gTKfCicuDGvYCX4aKeMtR",
        "apple": "https://podcasts.apple.com/podcast/the-narcissist-trapped-in-a-cult-of-one/id1766405014?i=1000683319520",
        "youtube": "https://www.youtube.com/watch?v=CQcoY45oBZQ"
      }
    },
    {
      "id": "fa3512c5-8206-4521-bdcb-f259ebf31f5d",
      "title": "THE SHIFT: Transforming society\u0027s role in supporting survivors PT 2",
      "description": "#freefrom #survivormade #supportsurvivors\n\nWhat happens when we stop viewing survivors as broken and start celebrating their resilience, creativity, and power?\n\nIn part two, Lisa continues her conversation with Sonya Passi, founder of FreeFrom and the subject of the powerful documentary SURVIVOR MADE. 1 in 4 women and 1 in 2 trans people in the U.S. will experience Intimate Partner Violence (IPV), and the #1 obstacle to a survivor’s safety is financial insecurity. SURVIVOR MADE follows a group of survivors as they defy the odds - building their own thriving businesses in Los Angeles, lobbying for change in Washington DC, and fighting to prove that investing in survivors saves lives.\n\nThis episode delves into the documentary’s mission to redefine how society views survivors—not as victims bound by their trauma but as creators, innovators, and leaders who are rebuilding their lives with strength and purpose.\n\nLisa and Sonya explore how SURVIVOR MADE challenges media stereotypes by focusing on healing, joy, and community rather than trauma. They discuss the powerful message that financial independence and community support are the cornerstones of lasting freedom for survivors. By shifting the narrative, SURVIVOR MADE  inspires hope and empowers viewers to see survivors in a new light—as agents of change and contributors to a brighter future for us all.\n\nFrom now on… I will not question my potential.\n\nFollow SURVIVOR MADE: \nWebsite: https://survivormadedoc.com/\nGifted by FreeFrom: https://giftedbyfreefrom.org/\nFreeFrom Website: https://www.freefrom.org/\nInstagram: https://www.instagram.com/survivormadedocumentary/\n\nSonya Passi is the Founder \u0026 CEO of FreeFrom, a national organization transforming our society’s response to gender-based violence so that survivors and their families can thrive. To date, FreeFrom has served over 30,000 survivors and successfully changed policy to support the financial security of over 5.3 million survivors in the US. Sonya has been an anti-violence activist since she was 16 years old.\n\nFor her work in the field, Sonya was awarded the 2024 Elevate Prize and was listed in Forbes’ 30 Under 30 Class of 2017 For Law and Policy. She has presented on her work to the UN, White House, members of Congress and federal agencies, several major corporations and various city and state agencies and commissions.\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#freefrom #survivormade #healinghappenshere #trustsurvivors #economicjustice #livingwages #communityiswealth #supportsurvivors #survivorsknowbest #inspiringentrepreneurs \n\n2Z275FXD3ZDZ8IJ5",
      "release": "2024-12-22T13:45:00Z",
      "duration": "00:40:31.1900000",
      "explicit": false,
      "spotifyId": "7jNxLWDdDYpOpnA1M8RpAF",
      "appleId": 1000681302571,
      "youTubeId": "iZ3sH9Qtmng",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jNxLWDdDYpOpnA1M8RpAF",
        "apple": "https://podcasts.apple.com/podcast/the-shift-transforming-societys-role-in-supporting/id1766405014?i=1000681302571",
        "youtube": "https://www.youtube.com/watch?v=iZ3sH9Qtmng"
      }
    },
    {
      "id": "42742992-0032-42f4-842a-8745bd664593",
      "title": "THE SHIFT: Transforming society\u0027s role in supporting survivors PT 1",
      "description": "#trustsurvivors #economicjustice #communityiswealth\n\nWhat happens when survivors work to rebuild their lives after escaping abuse? How does society help—or hinder—their journey? What if we told you that investing in survivors could transform not only their lives but also our entire society?\n\nToday, we’re confronting the systemic barriers survivors face in reclaiming their financial independence. Financial abuse is present in 99% of abusive relationships. Leaving these relationships and surviving is expensive.  \n\nLisa welcomes Sonya Passi, founder of FreeFrom, a grassroots nonprofit organization addressing the economic impact of gender-based violence. Sonya shares how FreeFrom is creating an ecosystem in which survivors can thrive. Sonya details how investing in survivors—through savings programs, entrepreneurial opportunities, and policy reform—not only helps them rebuild but also strengthens our economy and society as a whole. Survivors possess extraordinary resilience, creativity, and drive, and when we empower them, the ripple effects are transformative.\n\nThis episode is a call to shift our mindset: survivors aren’t just surviving—they’re building futures that benefit us all. Let’s support them! Together, we can create a society that values and uplifts those who have endured so much.\n\nStay tuned for part two of Lisa’s conversation with Sonya as they discuss SURVIVOR MADE, a new documentary that follows six survivors of gender-based violence as they strive to grow their\nbusinesses during a make-or-break holiday season in LA.\n\nFollow FreeFrom:\nWebsite: https://www.freefrom.org/\nFreeFrom Instagram: https://www.instagram.com/freefromdotorg/\nGifted by FreeFrom: https://giftedbyfreefrom.org/\nGifted Instagram: https://www.instagram.com/giftedbyfreefrom/\nSURVIVOR MADE Website: https://survivormadedoc.com/\n SURVIVOR MADE Instagram: https://www.instagram.com/survivormadedocumentary/\n\nSonya Passi is the Founder \u0026 CEO of FreeFrom, a national organization transforming our society’s response to gender-based violence so that survivors and their families can thrive. To date, FreeFrom has served over 30,000 survivors and successfully changed policy to support the financial security of over 5.3 million survivors in the US. Sonya has been an anti-violence activist since she was 16 years old.\n\nFor her work in the field, Sonya was awarded the 2024 Elevate Prize and was listed in Forbes’ 30 Under 30 Class of 2017 For Law and Policy. She has presented on her work to the UN, White House, members of Congress and federal agencies, several major corporations and various city and state agencies and commissions.\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#survivormade #healinghappenshere #livingwages #supportsurvivors #survivorsknowbest #trustsurvivors #inspiringentrepreneurs \n\n2Z275FXD3ZDZ8IJ5",
      "release": "2024-12-19T13:45:00Z",
      "duration": "01:00:39.0920000",
      "explicit": false,
      "spotifyId": "2Che0BcUHizoecqB0B35TR",
      "appleId": 1000680973585,
      "youTubeId": "rOPFMGioVc0",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Che0BcUHizoecqB0B35TR",
        "apple": "https://podcasts.apple.com/podcast/the-shift-transforming-societys-role-in-supporting/id1766405014?i=1000680973585",
        "youtube": "https://www.youtube.com/watch?v=rOPFMGioVc0"
      }
    },
    {
      "id": "6b12682d-4484-43ee-9a1d-0f23e5fba8e6",
      "title": "THE STALKER: Surviving nightmare home invasion and it’s aftermath",
      "description": "#stalker #truecrimecommunity #selfdefense\n\nThis episode contains discussions of violent assault, stalking, and PTSD. Some may find it upsetting. We encourage you to take care of yourself.\n\nIn a fight for your life, how would you react? Fight, flight, freeze or fawn? \n\nToday, Lisa addresses a serious issue that doesn’t discriminate: stalking. She shares what it was like to realize her former partner actually stalked her and her family. Lisa also welcomes Leigh Collins, a survivor, author \u0026 advocate for PTSD education and ferocity in girls \u0026 women.\n\nLisa and Leigh recount her experience surviving predatory stalking, assault, and extreme violence. Leigh details the long-term psychological effects, including PTSD, all while navigating her ex’s narcissistic discard and the legal system. Leigh and Lisa share how they both had to regain a sense of self, their voice, self-worth, and trust in others in the aftermath of their survival.\n\nLeigh survived everyone’s worst nightmare. She has sat with and worked to tell her story. First for the trial, second for her own healing, and now for education and awareness. She advocates for encouraging ferocity and supporting little girls to maintain their assertiveness.\n\nThis episode is about how, when it comes to a fight for your life, you are stronger than you know. It’s also a reminder to trust your instincts – it only grows stronger with practice and understanding your self-worth.\n\nFrom now on… every woman is reminded and feels the power of her ferocity.\n\n\nFollow Leigh Collins:\nWebsite: https://www.extraordinary-podcast.com/\nInstagram: https://www.instagram.com/heymisscollins\nTikTok: https://www.tiktok.com/@heymisscollins\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n#survivorstories #trauma #truecrime #sasurvivor #truecrimepodcast #survivorsisters #abusesurvivor #survivor #abuserecovery #abuseawareness #reclaimyourpower #survivorcommunity #mentalhealthmatters #toxicpeople #takebackyourpower #fightforyourlife #traumaawareness #traumarecovery #metoo #ptsd #stalking #redflags",
      "release": "2024-12-12T13:45:00Z",
      "duration": "01:27:36.1240000",
      "explicit": true,
      "spotifyId": "4QJk3fVboean2iz2DAmOED",
      "appleId": 1000680142482,
      "youTubeId": "uB_eNdCcyNo",
      "subjects": [
        "Human Trafficking",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4QJk3fVboean2iz2DAmOED",
        "apple": "https://podcasts.apple.com/podcast/the-stalker-surviving-nightmare-home-invasion-and/id1766405014?i=1000680142482",
        "youtube": "https://www.youtube.com/watch?v=uB_eNdCcyNo"
      }
    },
    {
      "id": "53d65fb1-4ef9-4182-a7b0-8ebafbdd16f4",
      "title": "THE MENTOR: It’s not your fault",
      "description": "#redflags #musicindustry #dj \n\nThis episode contains discussions of sexual assault and coercion. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat would you do if you were put in an uncomfortable position with a powerful person? \n\nToday, Lisa shares a story on how she navigated unwanted advances while on a movie set and how standing up for herself benefitted her in the long run. Lisa also welcomes DROOVYY, an independent artist, singer-songwriter \u0026 DJ who shares her harrowing story of being trapped in an office at sixteen years old.\n\nLisa and DROOVYY recount her experience being a young breakthrough artist as a DJ in Mumbai, India, and the challenges she faced as a teenage girl in a male-dominated industry.  At 16, a well-known businessman in the industry ended up being a predator and attempted to take advantage of her.  This traumatic experience changed her forever.  \n\nDROOVYY shares her healing journey and how a spiritual mentor guiding her to speak to her younger self empowered her to understand it wasn’t her fault. Now DROOVYY is a singer-songwriter producing positive and uplifting songs to empower women to see their worth.\n\nThis episode is about safety and empowerment. It’s about honoring our younger selves who have navigated unsafe situations and forgiving them for not knowing what we know now.\n\nDROOVYY, born and raised in Mumbai, India, is a versatile independent artist, singer-songwriter \u0026 DJ. Now based in Los Angeles, California, she is known for blending R\u0026B, Trap, and Pop music, she is determined to make her place in the music industry, representing her country in the U.S. She believes that women hold the feminine power and wisdom which is the highest form of energy in the Universe!\n\nFollow DROOVYY:\nSpotify: https://open.spotify.com/artist/5jVsTsJ5ceRnFcxZDcEopl?si=PnDSYkrnTO-DEswusNWoxQ\nInstagram: https://www.instagram.com/droovvy\nTikTok: https://www.tiktok.com/@droovy.music\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/",
      "release": "2024-12-05T13:45:00Z",
      "duration": "01:15:17.4330000",
      "explicit": true,
      "spotifyId": "5FfPkN04S9CDH4Q7K854Mv",
      "appleId": 1000679347823,
      "youTubeId": "5sSeDL418Po",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FfPkN04S9CDH4Q7K854Mv",
        "apple": "https://podcasts.apple.com/podcast/the-mentor-its-not-your-fault/id1766405014?i=1000679347823",
        "youtube": "https://www.youtube.com/watch?v=5sSeDL418Po"
      }
    },
    {
      "id": "7b867244-7b1f-4eee-b1f1-935445be5657",
      "title": "THE SYSTEMS of ABUSE: From the entertainment industry to Capitol Hill",
      "description": "#redflags #emotionalabuse #toxicrelationships \n\nJust a heads up: This episode contains discussions of emotional abuse, psychological abuse, sexual assault, and suicidal ideation. Some may find it upsetting. We encourage you to take care of yourself.\n\nAmbitious women have the right to pursue their careers without fear, yet the systems in unregulated industries prey on ambitious women. We’re working to change that. \n\nToday, Lisa welcomes Dr. Alicia Journey, a former attorney who fought for survivors of abuse and who now has a Ph.D. in Metaphysical Sciences. Dr. Journey shares her journey from surviving a cult to confronting sexual abuse and navigating the power imbalances in law and politics. \n\nShe offers advice to individuals who are planning their exit strategy from abusive power imbalances. Lisa and Alicia talk through a scenario on how to escape an uncomfortable audition. \n\nDr. Journey has been on a journey of getting rid of the layers of abuse she has experienced since she was a young child and forging a new path of freedom for others. She has transitioned into working as a full-time Metaphysician, Healer, and Channel. As a trauma expert, it is Alicia’s greatest joy to help her clients walk through the healing process and regain their lives after trauma. Dr. Journey applies her advanced spiritual gifts, formal education, and training, along with her professional and personal life experiences to uniquely and intuitively tailor programs to fit each client’s needs. \n\nThis episode is about empowerment. It’s about recognizing that no one—man or woman—should ever feel forced to compromise their dignity to achieve success. You have the power to live a life that’s not just free from abuse but full of purpose, passion, and deep personal growth.\n\nFollow Dr. Alicia Journey:\nWebsite: https://www.thealiciajourney.com/\nInstagram: https://www.instagram.com/TheAliciaJourney\nFacebook: https://www.facebook.com/alicia.journey.125/\nLinkedIn: https://www.linkedin.com/in/aliciajourney/\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#SurvivorStories #TraumaAwareness #boundaries #lovebombing #codependency #domesticviolenceawareness #financialabuse #redflags #emotionalabuse #gaslighting #financialabuse #narcissisticabusesurvivor #sociopath",
      "release": "2024-11-29T13:45:00Z",
      "duration": "01:02:45.8900000",
      "explicit": true,
      "spotifyId": "343CcaYTgYUMaE4DdZNPaB",
      "appleId": 1000678637872,
      "youTubeId": "5H8gRN7m8KU",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/343CcaYTgYUMaE4DdZNPaB",
        "apple": "https://podcasts.apple.com/podcast/the-systems-of-abuse-from-the-entertainment/id1766405014?i=1000678637872",
        "youtube": "https://www.youtube.com/watch?v=5H8gRN7m8KU"
      }
    },
    {
      "id": "a49ac466-4acc-4647-8d4b-5ee006151cdb",
      "title": "THE COPYCAT: How Predators Disguise Themselves as “Normal” People",
      "description": "#survivorstories #lovebombing #domesticviolenceawareness  \n\nJust a heads up: This episode contains discussions of domestic violence and emotional, physical, and psychological abuse. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when unexpected friendship and love turns out to be a fraud?\n\nToday, Lisa shares the story of a relationship that sent her fleeing across the United States for safety.  This relationship is one of the reasons why From Now On exists. He was a copycat, and Lisa was his prey.\n\nLisa welcomes Kate Ranta, a survivor of intimate partner and gun violence. In 2012, after leaving her abusive marriage, her ex-husband stalked Kate to her apartment, where he shot her and her father in front of their 4-year-old son – miraculously, everyone survived the attack. \n\nIn this episode, Lisa and Kate unpack the layers of abuse Kate experienced with her ex. They also explore the ways systems failed Kate time and time again. \n\nKate has been an advocate and activist for many years since this traumatic event, appearing in documentaries, tv series episodes, podcasts and other outlets including Rolling Stone and New York Magazine’s The Cut, testifying before Congress, participating in expert panels, and more. Kate is the co-author of “Killing Kate: A Story of Turning Abuse and Tragedy into Transformation and Triumph,” available on Amazon.\n\nThis episode is all about seeing the nuanced ways abusers function in an intimate relationship and the ways the system protects abusers rather than survivors. BUT survivorship still prevails.\n\nFollow Kate:\nWebsite: https://kateranta.com/\nFacebook: https://www.facebook.com/supportkateranta\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n\n#TraumaAwareness #boundaries #codependency #domesticviolenceawareness #financialabuse #redflags #emotionalabuse #gaslighting #toxicrelationships #narcissisticabusesurvivor #sociopath",
      "release": "2024-11-21T13:45:00Z",
      "duration": "01:34:34.6050000",
      "explicit": true,
      "spotifyId": "2X70tbdI5PRTz2B1BwpYEz",
      "appleId": 1000677779248,
      "youTubeId": "d2abdi89a-8",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2X70tbdI5PRTz2B1BwpYEz",
        "apple": "https://podcasts.apple.com/podcast/the-copycat-how-predators-disguise-themselves-as/id1766405014?i=1000677779248",
        "youtube": "https://www.youtube.com/watch?v=d2abdi89a-8"
      }
    },
    {
      "id": "ddf8293c-063c-4f49-866a-c62c33c6e5c7",
      "title": "THE FINANCIAL ABUSE: Trapped with no money",
      "description": "Just a heads up: This episode contains discussions of intimate partner violence, sexual assault, and abuse, and some listeners may find it upsetting. We encourage listeners to prepare themselves before listening.\n\n“Why did you stay?” \n\n“Why didn’t you leave? I would have!”\n\nThese statements, made by strangers on the internet, tend to be directed towards survivors when they tell their survivor stories. They forget one of the biggest forms of abuse that trap individuals in their relationships – financial abuse. \n\nToday, Lisa begins to share her own experiences with financial abuse and how that form of abuse is isolating and extremely misunderstood by family, friends, and strangers on the internet. \n\nLisa welcomes Titeänyä Rodríguez,  a proud Afro-Latina (Puerto Rican, Indigenous, \u0026 Jamaican) Writer, Impact Producer, \u0026 Director currently based in Los Angeles, CA. Titeänyä shares her own personal story of experiencing financial abuse that still affects her today. She highlights that abuse isn’t just within heteronormative relationships, but it takes place in the queer community too. As a serial survivor, Titeänyä works to advocate for survivors through her productions, storytelling and as a Certified Crisis Advocate with Peace Over Violence. https://www.peaceoverviolence.org/volunteer\n\nThis episode is all about noticing the red flags in a relationship that could lead to financial abuse and ways to avoid it. \n\nFrom now on, I have a VOICE. I don’t make myself small. I’m using it in whatever way I can.\n\nFollow Titeänyä Rodríguez:\nInstagram: https://www.instagram.com/titeanya/\nProduction House Website: https://www.womxnography.com/\nCreative Management Website: https://cre8tivec0ntr0lmgmt.co/\nYouTube: @titeanya \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/ for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#SurvivorStories #TraumaAwareness #financialabuse #domesticviolence #psychologicalabuse  #MeToo #TimesUp #BelieveSurvivors #standwithsurvivors #podcast",
      "release": "2024-11-07T13:45:00Z",
      "duration": "00:55:39.3890000",
      "explicit": true,
      "spotifyId": "3uAywotNuru7vZqXlMTdtL",
      "appleId": 1000676069172,
      "youTubeId": "KufJPbcAYdk",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uAywotNuru7vZqXlMTdtL",
        "apple": "https://podcasts.apple.com/podcast/the-financial-abuse-trapped-with-no-money/id1766405014?i=1000676069172",
        "youtube": "https://www.youtube.com/watch?v=KufJPbcAYdk"
      }
    },
    {
      "id": "cbdaac9a-8a36-420b-87ac-c04df4f9f77e",
      "title": "THE NDA: Silence as a tool to continue abuse",
      "description": "#nda #speakup #EndNDAmisuse\n\nJust a heads up: This episode contains discussions of sexual assault and suicidal ideation. Some may find it upsetting. We encourage you to take care of yourself.\n\nHow do survivors receive justice? What happens when survivors are influenced to sign an NDA? Today, we’re going to dive deep into the world of NDAs and how NDAs are another form of abuse.\n\nLisa welcomes Zelda Perkins, Co-Founder of the Can’t Buy My Silence campaign. Zelda shares her experience of signing an NDA and breaking the NDA. She educates on how NDAs are predatory and abusive to survivors, why they are so prevalent in SA cases, and how they are ultimately not legally enforceable. \n\nThis episode is all about how your voice, your survivor story is more powerful and important than any lump sum for your silence. We encourage you to educate yourself more about NDAs before you sign them.\nFrom now on, always question… don’t be afraid to question. Don’t believe everything a lawyer tells you. \n\n\nZelda Perkins was the first woman to break an NDA in 2017, signed decades earlier, with Harvey Weinstein. She brought the systematic abuse of NDA’s to the attention of the British Government and international press, giving evidence at two parliamentary inquiries, which uncovered an epidemic of misuse, and pushed the Solicitors Regulatory Authority to take disciplinary action against the lawyer who created the NDA for Weinstein. Her actions have been inspiring others to come forward by her example. She has been campaigning for legislative and regulatory reform in the UK since 2017 and launched the Global campaign Can’t Buy My Silence cantbuymysilence.com with Canadian Co Founder, Professor Julie Macfarlane in September 2021. They are working with Government in the UK, the Republic of Ireland, Canada and Australia to change legislation and regulation around the misuse of NDA’s. They have had legislative success in the UK, Ireland and Canada with the first laws of their kind banning NDAs being passed in all three countries, however there is still a long way to go. Zelda was named a Person of the Year by Time magazine in 2018,  by the Guardian in 2020 and in 2023 awarded for her Outstanding Contribution to Gender Equality by UN Women UK. Her character was portrayed by Samantha Morton in the Universal Pictures feature “She Said” documenting her part in the downfall of Weinstein. \n\nFollow Zelda Perkins:\nWebsite: https://www.cantbuymysilence.com/\nInstagram: https://www.instagram.com/cbmsilenceuk/\nX (Formerly Twitter): https://twitter.com/cbmsilence\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#believesurvivors #psychologicalabuse #standwithsurvivors #traumaawareness #SurvivorStories #metoomovement #cantbuymysilence",
      "release": "2024-10-31T12:45:00Z",
      "duration": "01:06:02.7750000",
      "explicit": true,
      "spotifyId": "22C9MC0fN2nMv33qv14Zs6",
      "appleId": 1000675207645,
      "youTubeId": "EgQBRpd48zw",
      "subjects": [
        "Human Trafficking",
        "_Ireland",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22C9MC0fN2nMv33qv14Zs6",
        "apple": "https://podcasts.apple.com/podcast/the-nda-silence-as-a-tool-to-continue-abuse/id1766405014?i=1000675207645",
        "youtube": "https://www.youtube.com/watch?v=EgQBRpd48zw"
      }
    },
    {
      "id": "97cd5776-799d-42fc-907c-95ae645cfae7",
      "title": "THE GRIEF: The survival mode",
      "description": "Just a heads up: This episode contains discussions of sexual assault and trafficking. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhere does grief fit into the conversation around abuse and survival? Today, we’re going to unpack how compounded trauma and grief can get us stuck in a cycle of suffering. This type of suffering is what serial predators look for as they seek out their next victim. But grief is also a tool to help process trauma. It is a tool in survivors healing. \n\nOn this episode, Lisa welcomes Victoria Valentino. Victoria is a retired hospice nurse,  Playboy’s Miss September 1963, author, speaker, activist, and a multi-rape, child and domestic abuse and sex trafficking survivor. Since 2014, when she went public about being a Bill Cosby survivor, she has been working to educate about rape culture, lobbying to change laws that give the power back to survivors to seek justice against their perpetrators.\n\nVictoria walks Lisa through the life events that made her a target for Cosby and the long-windy road of her healing journey. She shares her experiences with grief, the psychology of trauma, and her expressions of survival through her art. She recently directed  “SHEro: A Tribute to the Sister Survivors of Bill Cosby \u0026 to All Survivors of Sexual Violence,”  a play she wrote that premiered on July 21, 2024. She also authored Dirty Diamonds: The Repurposed Life of a Playboy Icon and Cosby Survivor.\n\nThis episode is all about how it’s never too late to tell your story, process your trauma, fight for justice, and express your healing in art. We are so grateful to Victoria for her honesty and vulnerability. \n\nFrom now on, I want peace. \n\nFollow Victoria Valentino:\nWebsite: https://www.victoriavalentino.com/\nInstagram: https://www.instagram.com/victoriavalentino1/\nFacebook: https://www.facebook.com/victoria.valentino1\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#survivorstories #TraumaAwareness #billcosby #playboy #psychologicalabuse  #MeToo #TimesUp #BelieveSurvivors #cosby #standwithsurvivors",
      "release": "2024-10-24T12:45:00Z",
      "duration": "00:52:54.3470000",
      "explicit": true,
      "spotifyId": "0rLYx12wtrsP3Bkoz5Kecr",
      "appleId": 1000674293369,
      "youTubeId": "eqZEVEi09Nk",
      "subjects": [
        "Human Trafficking",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rLYx12wtrsP3Bkoz5Kecr",
        "apple": "https://podcasts.apple.com/podcast/the-grief-the-survival-mode/id1766405014?i=1000674293369",
        "youtube": "https://www.youtube.com/watch?v=eqZEVEi09Nk"
      }
    },
    {
      "id": "f5b7fcc8-359c-468d-aa2f-91cb092f0570",
      "title": "IN PLAIN SIGHT: The predator\u0027s M.O.",
      "description": "Just a heads up: This episode contains discussions of grooming and sexual assault. Some may find it upsetting. We encourage you to take care of yourself.\n\nSerial predators always have a pattern. They practice and refine their manipulative tactics so that when they approach a new target, their abuse isn’t noticed or at least not actively questioned. It isn’t until years later that the realization that one has been abused comes to the surface. It’s often because a brave survivor decided to go public about the abuse. \n\nToday, Lisa welcomes Olympic Gold Medalist and current head coach of the Arkansas Razorbacks gymnastics team, Jordyn Wieber. Jordyn is also a survivor of Larry Nassar. Lisa and Jordyn discuss her journey in elite gymnastics all the way to the Olympics. Jordyn also shares how she came to testify at Larry Nassar’s sentencing hearing and how, since then, she has been an active advocate for survivors, holding systems account|able who enabled their abuser. Jordyn details Larry’s M.O. and the red flags she came to understand as she processed her trauma.  \n\nJordyn gave us an update on her healing journey and the role coaching has played in that journey. We are grateful for Jordyn’s willingness to share her story and her candor.\n\nThis episode is all about acknowledging there is power behind survivors speaking out and how these voices can hold systems accountable for enabling and protecting abusers.\n\nFrom now on, I will ALWAYS use my voice.\n\nFollow Jordyn Wieber:\nInstagram: https://www.instagram.com/jordyn_wieber/\nX: https://twitter.com/jordyn_wieber\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#Podcast #ProtectTheInnocent #GroomingAwareness #StopGrooming #PredatoryBehavior #ChildGrooming #SurvivorStories #TraumaAwareness #MeToo #TimesUp #BelieveSurvivors #JusticeForVictims #SurvivorsSpeak #BehindTheCurtain",
      "release": "2024-10-17T12:45:00Z",
      "duration": "00:36:40.2670000",
      "explicit": true,
      "spotifyId": "5oENNOk4e0BijS7bWHBIH1",
      "appleId": 1000673438990,
      "youTubeId": "mHePQMoL9qY",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5oENNOk4e0BijS7bWHBIH1",
        "apple": "https://podcasts.apple.com/podcast/in-plain-sight-the-predators-m-o/id1766405014?i=1000673438990",
        "youtube": "https://www.youtube.com/watch?v=mHePQMoL9qY"
      }
    },
    {
      "id": "930d8587-2547-48aa-8e9d-691b760d92b3",
      "title": "THE SISTERHOOD: The Hollywood Pimp’s Survivors Speak Out",
      "description": "Just a heads up: This episode contains discussions of grooming, sexual assault, and human trafficking. Some may find it upsetting. We encourage you to take care of yourself.\n\nWhat happens when you share your truth? What happens when you share your survivor story on social media? More people come forward. Last episode, our guest Ariel Lyndsey shared how she was SA’ed at an audition by two men. This past June, she posted about it on Instagram and now there is a survivor sisters group chat – where they all share similar experiences that span over 10 years.\n\nToday, Lisa welcomes sisters, Aubrey and Amber, who are in the survivor sisters group chat with Ariel. They tell the story of why they have left the entertainment industry and how a social media post calling out their abuser made them realize they aren’t alone. Today, they are reclaiming their power by sharing their own stories. \nWe are humbled and honored to hold this space for them to share their stories.\nThis episode is all about how serial predators are calculated with their grooming tactics. They create a cycle of hope and disappointment, trust and betrayal. This episode is also about the power of telling your story. It will change lives. It will bring safety ultimately to others.\n\nFrom now on we are going to speak our truth, trust our guts, have courage, and do research. \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#tiktokviral #audition #talentagent  #PredatoryBehavior #financialabuse #ExposeTheTruth  #jeffreyepstein #podcast #HollywoodPredators #SilenceBreakers #BelieveSurvivors #AccountabilityNow #MeToo #TimesUp #HollywoodExposed",
      "release": "2024-10-10T12:45:00Z",
      "duration": "01:17:56.9890000",
      "explicit": true,
      "spotifyId": "1RynqGdOR99KrL1NLZU85B",
      "appleId": 1000672508234,
      "youTubeId": "khlAxpMndwA",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1RynqGdOR99KrL1NLZU85B",
        "apple": "https://podcasts.apple.com/podcast/the-sisterhood-the-hollywood-pimps-survivors-speak-out/id1766405014?i=1000672508234",
        "youtube": "https://www.youtube.com/watch?v=khlAxpMndwA"
      }
    },
    {
      "id": "405af740-bdbb-479b-9997-9e5774758e18",
      "title": "THE TARGET: Viral dancer and predatory auditions",
      "description": "Just a heads up: This episode contains discussions of sexual assault, and some may find it upsetting. We encourage listeners to prepare themselves.\n\nThere is a dark side to Hollywood and the entertainment industry. The ecosystems within the entertainment industry are breeding grounds for predators. Power dynamics are constantly in play as artists work to follow their dreams. Predators love to be the gatekeepers, but Lisa is working to expose these abusive tactics to create change and safety for those who are following their dreams.\n\nToday, Lisa welcomes multi-hyphenated artist Ariel Lyndsey to the podcast. Ariel went viral when she was publicly assaulted while on a girl\u0027s trip to Vegas. Her friend just so happened to capture the aftermath of the event and her efforts to have authorities take the assault seriously. Ariel and Lisa discuss how this public event triggered a traumatic experience that happened years earlier at an audition.\n\nThey chat about how unregulated industries allow for predators to be repeat offenders, the importance of sharing your survivor story, ways to navigate trolls, and the journey to hold predators accountable.\n\nThis episode is all about the highs and lows of sharing your story but, ultimately, how liberating it is to share your truth and reclaim your agency after abuse. \n\nFrom now on we share our unfiltered truth.\n\nFollow Ariel Lyndsey:\nInstagram: https://www.instagram.com/ariellyndsey/\nTikTok: https://www.tiktok.com/@ariellyndsey\nTwitch: https://www.twitch.tv/ariellyndsey\nYouTube:   @ArielLyndsey  \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#tiktokviral #audition #hollywood #diddy #jeffreyepstein #pdiddy",
      "release": "2024-10-03T12:45:00Z",
      "duration": "01:02:19.8720000",
      "explicit": true,
      "spotifyId": "5GX3DnVdQsboeRuIM8jKmx",
      "appleId": 1000671667627,
      "youTubeId": "tc2KW_QLLBw",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GX3DnVdQsboeRuIM8jKmx",
        "apple": "https://podcasts.apple.com/podcast/the-target-viral-dancer-and-predatory-auditions/id1766405014?i=1000671667627",
        "youtube": "https://www.youtube.com/watch?v=tc2KW_QLLBw"
      }
    },
    {
      "id": "ca1e6401-b87a-474a-9d50-5d068d3374f1",
      "title": "THE CALL: Breaking down boundaries",
      "description": "Just a heads up: This episode contains discussions of grooming, cults, and coercive control.  Some may find it upsetting. We encourage listeners to prepare themselves.\n\nWhat happened after “Little Saint Jeff’s?” Back in NYC, Lisa tried to put the island behind her, but then the calls began. They didn’t stop.\n\nToday, Lisa welcomes Jennifer French to the podcast. Jennifer since leaving Order of Christ Sophia (OCS) aka Centers of Light cult, has taken her trauma, processed her experience, and educated herself on the subtle elements of grooming that cause people to stay in relationships with unhealthy power dynamics. Lisa and Jennifer discuss the similarities between cults and abusive relationships. Jennifer details what coercive control is and red flags to be aware of as someone utilizes coercive control. \n\nThis episode is all about educating the audience on the tactics an abuser might take to erode the agency and self-esteem of the abused.\n\nFrom now on, let\u0027s respect and honor survivor voices and let\u0027s focus on perpetrators for accountability.\n\nFollow Jennifer French:\nWebsite: https://www.jennifer-french.com/\nInstagram: https://www.instagram.com/jennifer.french.jfh/\nFacebook: https://www.facebook.com/profile.php?id=100063581164409\nYouTube:  @jenniferfrench4461  \n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n#model #jeffreyepstein #cult #coercivecontrol #grooming #isolation #fordmodels",
      "release": "2024-09-26T12:45:00Z",
      "duration": "00:56:51.1210000",
      "explicit": false,
      "spotifyId": "091z7canC5aRaf7OSM8Fb1",
      "appleId": 1000670780204,
      "youTubeId": "U_IPoCSPiAw",
      "subjects": [
        "Order Of Christ Sophia",
        "Cult Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/091z7canC5aRaf7OSM8Fb1",
        "apple": "https://podcasts.apple.com/podcast/the-call-breaking-down-boundaries/id1766405014?i=1000670780204",
        "youtube": "https://www.youtube.com/watch?v=U_IPoCSPiAw"
      }
    },
    {
      "id": "ddf2f646-b5e5-4632-8d7d-ec2e483d0ec0",
      "title": "THE ISLAND: Trapped on Little Saint Jeff’s",
      "description": "Just a heads up: This episode contains discussions of sexual assault, and some may find it upsetting. We encourage listeners to prepare themselves.\n\nIt all started on the island of Little Saint James, aka “Little Saint Jeff’s.” As Lisa’s modeling career began taking off, she was lured and trapped. Her experiences on the island forever changed her. Lisa couldn’t talk about it until now, 20 years later. \n\nToday, Lisa welcomes trauma therapist Ocean Shapiro, MSW, to the podcast. They have a discussion on the power of telling your survivor story. Ocean shares how as a therapist, they help people through their process of being able to talk about their story as a way to help process their trauma. Why is storytelling powerful? Why even tell the story? Advice on how to feel safe in sharing your story with loved ones.  \n\nThis episode is all about giving the audience insight into how therapy can be a safe space to process trauma and how to create healthy boundaries to feel safe to share your story publicly or with loved ones.\n\nFrom now on think about your story as a part of the beautiful, inextricable web of human experiences that deserve to be spoken aloud.\n\nTo learn more about Ocean’s therapeutic services and follow Ocean Shapiro:\nWebsite: https://www.inclusivetherapists.com/california/santa-monica/ocean-shapiro\nInstagram: https://www.instagram.com/oceanfloortherapy\n\nFollow Me, Lisa Phillips: \nWebsite: https://www.lisaphillips.la\nInstagram: https://www.instagram.com/iamlisaphillips/\nFNO Instagram: https://www.instagram.com/fromnowonpod/\nFNO TikTok: https://www.tiktok.com/@fromnowonpod\nFNO Facebook: https://www.facebook.com/fromnowonpod\nFNO X: https://twitter.com/fromnowonpod\n\nFrom Now On is produced by LA PHILLIPS MEDIA. Listen and follow on \nApple Podcasts: https://podcasts.apple.com/us/podcast/from-now-on/id1766405014\nSpotify: https://open.spotify.com/show/1vOhoPrOkwIyCNApzsBlF8\nYouTube: https://www.youtube.com/@FromNowOnPod\n\nHave a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials.\n\nIf today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below:\n\nIf you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673).\n\nIf you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree).\n\nPAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. To learn more, go to https://www.shatteringthesilence.org/\n\nSpeak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. To learn more, go to https://www.speakoutactreclaim.org/\n\n#model #jeffreyepstein #storytelling #trauma #traumatherapy  #abuse #healing #diddy #seancombs #pdiddy",
      "release": "2024-09-19T07:00:00Z",
      "duration": "01:03:05.1160000",
      "explicit": true,
      "spotifyId": "3ySXuhEZ0PMn3FeDSUZ5Lu",
      "appleId": 1000670020976,
      "youTubeId": "ViL0vGOKR80",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ySXuhEZ0PMn3FeDSUZ5Lu",
        "apple": "https://podcasts.apple.com/podcast/the-island-trapped-on-little-saint-jeffs/id1766405014?i=1000670020976",
        "youtube": "https://www.youtube.com/watch?v=ViL0vGOKR80"
      }
    },
    {
      "id": "c0dd3721-fbdd-4660-8b0c-b5bd8881069c",
      "title": "THE AMBITION: Where predators prey",
      "description": "Meet Lisa Phillips. She is on a mission to hold predators accountable for their actions, empower survivors to move forward on their healing journey, and prepare creatives starting their careers in the entertainment industry. Lisa is also ready to talk. Throughout this first season, in each episode, Lisa will share her survivor story of Jeffrey Epstein and his co-conspirators. Today, Lisa welcomes international model, Krystal. Krystal has learned a lot since breaking into the business. She and Lisa discuss creating healthy boundaries with managers, agents, and photographers. They also share red flags to be aware of when choosing management, agencies, and while traveling. This episode is all about understanding unhealthy power dynamics in unregulated industries and how to protect yourself so that you can pursue your dreams. From now on, you will be able to safely pursue your dreams. Just a heads up – This episode contains discussions of grooming and manipulation. Some may find it upsetting. We encourage listeners to prepare themselves. You can connect with Krystal on Instagram @kryoroz . Follow Lisa Phillips @iamlisaphillips on Instagram. From Now On is produced by LA PHILLIPS MEDIA. Listen and follow on Apple Podcasts , Spotify , and YouTube . Have a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials. If today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below: If you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673) If you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree). PAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. \u0026#xfeff;Speak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other.",
      "release": "2024-09-12T07:00:00Z",
      "duration": "00:55:39.8330000",
      "explicit": true,
      "spotifyId": "0wtn2bKir7RkEF9d5YLDMd",
      "appleId": 1000669251042,
      "youTubeId": "S8POCrlP8oo",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0wtn2bKir7RkEF9d5YLDMd",
        "apple": "https://podcasts.apple.com/podcast/the-ambition-where-predators-prey/id1766405014?i=1000669251042",
        "youtube": "https://www.youtube.com/watch?v=S8POCrlP8oo"
      }
    }
  ]
}