{
  "_ts": 0,
  "id": "16a1b303-ca20-47d9-83e5-e42be4c539ff",
  "name": "From Now On",
  "spotifyId": "1vOhoPrOkwIyCNApzsBlF8",
  "appleId": 1766405014,
  "youTubeChannelId": "UCHKwmUQXbKa2bs7qYmlfkNQ",
  "episodes": [
    {
      "id": "c968fe3f-fda2-4eb3-9451-64a23a7da977",
      "title": "THE NARCISSIST: Trapped in a cult of one",
      "description": "What does it mean to be in and escape a “cult of one”? How can we change the conversation around narcissistic abuse to support survivors and break the cycle of harm? In this episode, Lisa welcomes Vanessa Reiser, a therapist, survivor, and author of Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People. Together, they confront the devastating realities of narcissistic abuse, detail the Tell a Therapist’s Hierarchy of Restoration and the steps survivors need to take when trying to break free. Vanessa shares her groundbreaking insights on the parallels between narcissistic relationships and cult dynamics, unveiling how narcissists use tactics like love bombing, future faking, mirroring, triangulation, and isolation to manipulate their prey. Lisa and Vanessa discuss the narcissist playbook and how they use many forms of punishment to control their “cult of one.” Through Vanessa’s book and personal journey, she emphasizes the importance of recognizing abuse, reclaiming autonomy, and building a support system to foster healing. This episode is a powerful call to action, challenging the narratives that glorify toxic relationships, naming abuse, stopping an ecosystem of chaos, and cultivating a life of radical self-love. Survivors deserve more than survival—they deserve autonomy, joy, and respect. From now on… I will sit in truth. Follow Vanessa @vanessareiserlcsw on Instagram, @vanessareiser on TikTok, and @vanessareiserteletherapy on Facebook. You can learn more about Vanessa Reiser and her therapeutic services by going to tellatherapist.net . Buy her book Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People here . From Now On is produced by LA PHILLIPS MEDIA. Listen and follow on Apple Podcasts , Spotify , and YouTube . Have a story to share with us? Email us at fromnowonpod@gmail.com. Join our movement and keep up to date on all things From Now On by following us @fromnowonpod on all socials. If today’s conversation resonated with you and you are seeking more support in your own healing journey, here are some resources below: If you or someone you know has been sexually assaulted, help is available. Call 800.656.HOPE (4673) If you or someone you know is being trafficked, contact the National Human Trafficking Hotline. Text 233733 (befree). PAVE is a 501(c)(3) non-profit creating a world free from sexual violence and building communities to support survivors. \u0026#xfeff;Speak Out, Act, Reclaim (SOAR) is dedicated to providing a safe and empowering space for survivors of sex trafficking to reclaim their stories and stand up for themselves and each other. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-09T13:45:00Z",
      "duration": "01:09:39.5650000",
      "explicit": false,
      "spotifyId": "1gTKfCicuDGvYCX4aKeMtR",
      "appleId": 1000683319520,
      "youTubeId": "CQcoY45oBZQ",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gTKfCicuDGvYCX4aKeMtR",
        "apple": "https://podcasts.apple.com/podcast/the-narcissist-trapped-in-a-cult-of-one/id1766405014?i=1000683319520",
        "youtube": "https://www.youtube.com/watch?v=CQcoY45oBZQ"
      }
    }
  ]
}