{
  "id": "4c5d4553-d606-48f1-9afa-cf7bcafd192e",
  "name": "Full Measure",
  "episodes": [
    {
      "id": "4938739a-2982-48b8-8f18-8e3aa9f1f06b",
      "title": " Surviving Jonestown",
      "description": "Before the 9/11 Islamic extremist terrorist attacks, one of the biggest losses of American civilian life was the Jonestown Massacre in 1978. At its heart was Jim Jones, whose San Francisco- based cult became largely untouchable because of his political influence. As rumors spread about abuses within his church, Jones left the country with hundreds of followers to start a socialist Utopia in South America. A young Congressional aide named Jackie Speier was part of a group investigating Jonestown 41 years ago and survived the massacre.  Today she’s a Congresswoman herself and tells her story in the new book Undaunted.---------Full Measure is a weekly Sunday news program focusing on investigative, original and accountability reporting. The host is Sharyl Attkisson, five-time Emmy Award winner and recipient of the Edward R. Murrow award for investigative reporting. She is backed by a team of award winning journalists.Each week, we have a cover story that explores untouchable topics in a fearless way including: immigration, terrorism, government waste, national security and whistleblower reports on government and corporate abuse and misdeeds.Full Measure is broadcast to 43 million households in 79 markets on 162 Sinclair Broadcast Group stations, including ABC, CBS, NBC, FOX, CW, MyTV, Univision and Telemundo affiliates. It also streams live Sunday mornings at 9:30 a.m. ET.Read more about us at: http://fullmeasure.news/aboutFind out where to watch us at: http://fullmeasure.news/aboutLike us on Facebook: https://www.facebook.com/FullMeasureNewsFollow us on Twitter: https://twitter.com/FullMeasureNews",
      "release": "2019-05-12T19:00:00Z",
      "duration": "00:09:07",
      "explicit": false,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "internetArchive": "https://archive.org/details/youtube-nLp8mcJBGtQ"
      }
    }
  ]
}