{
  "id": "fc9d2012-4f3c-4a45-a1b3-b07fa1028d68",
  "name": "Gabby Bryan",
  "youTubeChannelId": "UCe7tWzp-HozzMLUQ3aRJt0Q",
  "episodes": [
    {
      "id": "fc514ba5-c257-4e97-9ba4-55b88bfd9686",
      "title": "She Got Kicked Out of a Cult and Didn’t Even Know It",
      "description": "Gabby dives into the most chaotic religion story she’s ever heard: a girl who got kicked out of a cult simply for not volunteering. Suddenly, there’s Catholic guilt, Staten Island accents, childhood confusion, and zero actual witnessing of Jehovah. It’s messy, unhinged, and way too relatable for anyone who’s ever switched religions like outfits.\n\n #gabbybryan #standupcomedy #femalecomedy #standup #comedy #crowdwork\n\nDon\u0027t miss a video! Subscribe NOW:  https://www.youtube.com/@gabbyisbryan?sub_confirmation=1\n\nYOUR BEST FRIEND:\nUS \u0026 UK tour tickets https://punchup.live/gabbybryan\n\nABOUT GABBY:\n\nGabby Bryan is a New York-based stand-up comedian, actress, Emmy-award winning producer, and overall girlie girl. She performed alongside Olivia Wilde and Oscar Isaac in the film “Life Itself” (Amazon Prime), appeared in the bilingual film “Ruta Viva” (HBO), and featured in Ilana Glazer’s special “Comedy on Earth” (Comedy Central). Gabby co-hosts \u0022Let Me Ask My Dad” Podcast with musician and composer and her dad David Bryan. She has toured all around the globe and continues with her sold out show \u0022GABBY BRYAN IS MY BESTFRIEND\u0022. She is wildly popular on social media with over 450K\u002B followers, sharing viral stand up clips \u0026 comedy sketches. \n\nFOLLOW ME ON SOCIAL:\nInstagram: https://www.instagram.com/gabbyisbryan/?hl=en \nTikTok: https://www.tiktok.com/@inthelabtv\nX: https://x.com/GABBYISBRYAN \nPodcast: https://letmeaskmydad.lnk.to/listen \nNewsletter: https://substack.com/@gabbyisbryan?utm_source=user-menu \nWebsite: https://linktr.ee/GABBYBRYAN \n\nFor comedy bookings: GOLDS@wmeagency.com\nFor business inquiries: DCHIN@wmeagency.com \n \n=============================\n\nCopyright Notice: This video and my YouTube channel contain dialogue, music, and images that are property of GABBY BRYAN. You are authorized to share the video link and channel, and embed this video in your website or others as long as a link back to my Youtube Channel is provided. \n\n© Gabby Bryan 2025\n\nI Got Kicked Out of a Cult and Didn’t Even Know It | Gabby Bryan\nhttps://youtu.be/7VP7IWSeOFU",
      "release": "2025-12-16T18:00:06Z",
      "duration": "00:04:29",
      "explicit": false,
      "youTubeId": "7VP7IWSeOFU",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7VP7IWSeOFU"
      }
    }
  ]
}