{
  "id": "3250fb32-e9bf-43f2-a31a-105a7b02df4e",
  "name": "Gardens of Evil: Inside the Zion Society Cult",
  "spotifyId": "5w7xyH8ttWZKc64D9q08H4",
  "appleId": 1748894795,
  "episodes": [
    {
      "id": "649e468b-09c6-4d40-9a4b-bfef544a973b",
      "title": "E1 - What Lies Beneath",
      "description": "A pristine neighborhood in Ogden, Utah hides something rotten. When a couple move into Northwood subdivision in 1981, they’re welcomed with free landscaping, shared supplies, and a sense of family - until the community’s leader, Arvin Shreeve, reveals a secret doctrine of polygamy and sexual manipulation. Nearly a decade later, on July 9, 1991, a woman walks into the Weber County Attorney’s Office and confesses to detective Mike King that she was part of the Zion Society, a cult she says was abusing children. See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2026-02-03T07:00:00Z",
      "duration": "00:50:25.0840000",
      "explicit": false,
      "spotifyId": "6VXa7jVhG3E0QGcUtKjp4Q",
      "appleId": 1000747825644,
      "subjects": [
        "Zion Community",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6VXa7jVhG3E0QGcUtKjp4Q",
        "apple": "https://podcasts.apple.com/podcast/e1-what-lies-beneath/id1748894795?i=1000747825644"
      }
    },
    {
      "id": "ebb509cd-e3ee-45d2-b5d9-3b2c08f8d6a2",
      "title": "Prelude: Gardens of Evil",
      "description": "Gardens of Evil: Inside the Zion Society Cult begins February 3rd. It was just another quiet neighborhood in small town America. At least, that\u0027s how it looked. But the immaculately groomed yards, trimmed hedges, and brightly colored flower gardens hid an insidious secret. More than a hundred residents were members of a cult called The Zion Society. Hiding in plain sight, they hoarded guns and ammunition. They created, sold, and modeled sexy lingerie. They took children away from parents and groomed them for sexual abuse. Their beliefs were centered around satisfying the perverted desires of one man - their leader: an unassuming, soft-spoken landscaper. Neighbors knew something was amiss, but it wasn\u0027t until a brave young woman broke away from the secretive group and confessed to authorities that everything began to unravel for this dangerous cult. This is the story of that unraveling told by the people who lived it. Click below to subscribe to Gardens of Evil: Inside the Zion Society Cult: https://podcasts.apple.com/us/podcast/gardens-of-evil-inside-the-zion-society-cult/id1748894795 https://open.spotify.com/show/5w7xyH8ttWZKc64D9q08H4 See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-11-13T10:00:00Z",
      "duration": "00:06:17.2080000",
      "explicit": false,
      "spotifyId": "5YTMFt4hIwFkMV7l4jyXBx",
      "appleId": 1000736571753,
      "subjects": [
        "Zion Community",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5YTMFt4hIwFkMV7l4jyXBx",
        "apple": "https://podcasts.apple.com/podcast/prelude-gardens-of-evil/id1748894795?i=1000736571753"
      }
    },
    {
      "id": "5c4779c7-cba8-4bee-9693-7702edcd4534",
      "title": "Introducing Gardens of Evil",
      "description": "It was just another quiet neighborhood in small town America. At least, that\u0027s how it looked. But the immaculately groomed yards, trimmed hedges, and brightly colored flower gardens hid an insidious secret. More than a hundred residents were members of a cult called The Zion Society. Hiding in plain sight, they hoarded guns and ammunition. They created, sold, and modeled sexy lingerie. They took children away from parents and groomed them for sexual abuse. Their beliefs were centered around satisfying the perverted desires of one man - their leader: an unassuming, soft-spoken retiree. Neighbors knew something was amiss, but it wasn\u0027t until a brave young woman broke away from the secretive group and confessed to authorities that everything began to unravel for this dangerous cult. This is the story of that unraveling told by the people who lived it. Series release begins February 3rd. See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-09-25T05:00:00Z",
      "duration": "00:03:06.7230000",
      "explicit": false,
      "spotifyId": "1sESzG1jaIjJKbZG5w30CI",
      "appleId": 1000728629543,
      "subjects": [
        "_America",
        "Zion Community"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1sESzG1jaIjJKbZG5w30CI",
        "apple": "https://podcasts.apple.com/podcast/introducing-gardens-of-evil/id1748894795?i=1000728629543"
      }
    }
  ]
}