{
  "_ts": 0,
  "id": "7f2e7b99-b9fb-4c57-bbf5-f8d849fcae3c",
  "name": "Gaslit Nation",
  "spotifyId": "2vUkbX4rnbHU8ZrvASDytC",
  "appleId": 1400926647,
  "youTubeChannelId": "UC18gEu4hJc8ZpoIafeB5Pgg",
  "episodes": [
    {
      "id": "74cd6e6c-612a-48e4-bb3b-e83f45e88747",
      "title": "Pope Leo and Opus Dei - TEASER",
      "description": "Fifteen years after Sarah Silverman’s viral call to “Sell the Vatican, Feed the World,” we now have a “Marxist Pope,” according to Trump stormtrooper Laura Loomer, and our wildest dreams. This week for Gaslit Nation’s bonus show, we dive into the groundbreaking election of the first American pope, Robert Francis Prevost, now Pope Leo XIV, whose ancestry ties him to Black lineage. While many celebrate this historic milestone, deeper questions remain. \r\n\r\n Most crucially, Pope Leo’s stance on Opus Dei, a secretive, powerful crime cult aligned with far-right politics and accused of human trafficking and labor abuses, remains unclear, especially given his close connections to Opus Dei in Peru. By Vatican standards, Pope Francis launched an open war on Opus Dei. (Fun fact: Robert Hanssen, the FBI agent and traitor who spied for the Kremlin, was an Opus Dei member). \r\n\r\n Pope Francis began the work of reigning in Opus Dei’s unchecked power. Pope Leo, seen as a moderate administrator, played both sides during his tenure in Peru, where Opus Dei holds sway. Will he now take bold action to finish Francis’s mission, and protect the world from Opus Dei, especially America where Opus Dei has been expanding its influence in Washington, DC, thanks to allies Leonard Leo of the Federalist Society and Kevin Roberts of the Heritage Foundation and Project 2025? \r\n\r\n Want to enjoy Gaslit Nation ad-free? Join our community of listeners for bonus shows, ad-free episodes, exclusive Q\u0026amp;A sessions, our group chat, invites to live events like our Monday political salons at 4pm ET over Zoom, and more! Sign up at Patreon.com/Gaslit!\r\n\r\n EVENTS AT GASLIT NATION:\r\n\r\n   May 26 4pm ET – Book club discussion of Octavia Butler’s The Parable of the Sower  \r\n\r\n   Indiana-based listeners launched a Signal group for others in the state to join,  available on Patreon. \r\n\r\n   Florida-based listeners are going strong meeting in person. Be sure to join their Signal group, available on Patreon. \r\n\r\n   Have you taken Gaslit Nation’s HyperNormalization Survey Yet?\r\n\r\n   Gaslit Nation Salons take place Mondays 4pm ET over Zoom and the first ~40 minutes are recorded and shared on  Patreon.com/Gaslit for our community \r\n\r\n   Show Notes:\r\n\r\n  \r\n\r\n ‘Papabile’ of the Day: Cardinal Robert Francis Prevost https://cruxnow.com/papal-transition/2025/05/papabile-of-the-day-cardinal-robert-francis-prevost\r\n\r\n  \r\n\r\n Trump’s New Favorite Adviser Starts MAGA Meltdown Over ‘TDS’ Pope  https://www.thedailybeast.com/trumps-new-favorite-advisor-laura-loomer-starts-maga-meltdown-over-tds-pope/\r\n\r\n  \r\n\r\n The Far Right is Coming for the Vatican https://www.americanfreakshow.news/p/the-far-right-is-coming-for-the-vatican\r\n\r\n  \r\n\r\n Catholic Church To Excommunicate Priests for Following New US State Law https://www.newsweek.com/catholic-church-excommunicate-priests-following-new-us-state-law-2069039\r\n\r\n  \r\n\r\n Opus Dei: The Gaslit Nation Gareth Gore Interview:  https://www.gaslitnationpod.com/episodes-transcripts-20/2024/12/31/opus-dei?rq=Gareth%20Gore\r\n\r\n  \r\n\r\n Mafia boss breaks silence over Roberto Calvi killing: This article is more than 13 years old Godfather turned supergrass accused of murder of \u0027God\u0027s banker\u0027 claims case will never be solved https://www.theguardian.com/uk/2012/may/12/roberto-calvi-blackfriars-bridge-mafia\r\n\r\n  \r\n\r\n Surveillance Self-Defense: A Presentation by the Gaslit Nation Security Committee  https://www.patreon.com/posts/surveillance-128381880?utm_medium=clipboard_copy\u0026amp;utm_source=copyLink\u0026amp;utm_campaign=postshare_creator\u0026amp;utm_content=join_link\r\n\r\n  \r\n\r\n Parable of the Sower: Gaslit Nation Book Club Discussion: https://www.patreon.com/posts/zoom-link-for-et-128213704?utm_medium=clipboard_copy\u0026amp;utm_source=copyLink\u0026amp;utm_campaign=postshare_creator\u0026amp;utm_content=join_link",
      "release": "2025-05-09T18:39:00Z",
      "duration": "00:19:38.7530000",
      "explicit": false,
      "spotifyId": "1gJH0G8geGjVoBB3cz373q",
      "appleId": 1000706995937,
      "youTubeId": "XZHiy7YomaM",
      "subjects": [
        "Opus Dei",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gJH0G8geGjVoBB3cz373q",
        "apple": "https://podcasts.apple.com/podcast/pope-leo-and-opus-dei-teaser/id1400926647?i=1000706995937",
        "youtube": "https://www.youtube.com/watch?v=XZHiy7YomaM"
      }
    },
    {
      "id": "177c0675-078d-481b-b139-fee813b61a41",
      "title": "Opus Dei",
      "description": "How does Franco’s reign in Spain connect to the rise of Trump? In this gripping true-crime thriller, financial journalist Gareth Gore, while investigating a bank collapse in Spain, follows the money trail to uncover a vast international conspiracy behind Opus Dei. What is Opus Dei? It\u0027s a shadowy global right-wing organization founded in Spain just before the Spanish Civil War. Supported by powerful Republican figures like Leonard Leo, Opus Dei is a Christian nationalist movement fueling efforts to dismantle democracy and pave the way for dictatorship in America. Gore, the author of the explosive book Opus: The Cult of Dark Money, Human Trafficking, and Right-Wing Conspiracy Inside the Catholic Church , delves into this insidious network. In this chilling conversation, recorded just before the U.S. election, Gore reveals how Opus Dei’s influence stretches from Capitol Hill to the Supreme Court—and what is being done, including by the Pope, to try to curb its destructive power. This week\u0027s bonus show features a live interview with Dr. Emma Briant, one of the world’s foremost experts on disinformation warfare and propaganda. Dr. Briant, co-editor of The Routledge Handbook on the Influence Industry and author of Propaganda and Counter-Terrorism: Strategies for Global Change, shares invaluable insights into the weapons of global propaganda. Gaslit Nation returns with all-new episodes on January 7th! We’re excited to continue this fight for truth and justice with you—together, we can plant the seeds of meaningful change. Democracy Defender ($10/month) and higher supporters, don’t forget to submit your questions for our upcoming bonus show Q\u0026A! Thank you to everyone who supports the show–we could not make Gaslit Nation without you! Want to enjoy Gaslit Nation ad-free? Join our community of listeners for bonus shows, ad-free episodes, exclusive Q\u0026A sessions, our group chat, invites to live events like our Monday political salons at 4pm ET over Zoom, and more! Sign up at Patreon.com/Gaslit! We\u0027re running this week\u0027s episode earlier than usual due to the New Year\u0027s Eve holiday--happy new year, everyone! We\u0027ll get through what comes next together!",
      "release": "2024-12-31T19:00:00Z",
      "duration": "01:04:18.1280000",
      "explicit": false,
      "spotifyId": "6Jce8FtmMX7Y3aQt40wEQC",
      "appleId": 1000682259964,
      "youTubeId": "EHB_WtvGies",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Jce8FtmMX7Y3aQt40wEQC",
        "apple": "https://podcasts.apple.com/podcast/opus-dei/id1400926647?i=1000682259964",
        "youtube": "https://www.youtube.com/watch?v=EHB_WtvGies"
      }
    },
    {
      "id": "41aa584b-fce5-4300-847b-f252d3391abd",
      "title": "The Cult Age: Interview with Cult Expert Dr. Janja Lalich",
      "description": "Countries undergoing extreme instability – like, say, a violent insurrectionist coup, a deadly plague, climate change catastrophes, and domestic and foreign information warfare – tend to breed cults, and America is no exception! This week Gaslit Nation welcomes cult and extremism expert Dr Janja Lalich to explain the rise of fringe movements in the US and how to deal with it.",
      "release": "2022-04-13T02:29:03Z",
      "duration": "00:58:41",
      "explicit": false,
      "spotifyId": "7zFGCHW7hPHMqSaFinypHn",
      "youTubeId": "Tk-Lmt30TMA",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7zFGCHW7hPHMqSaFinypHn",
        "youtube": "https://www.youtube.com/watch?v=Tk-Lmt30TMA"
      }
    }
  ]
}