{
  "_ts": 0,
  "id": "7f2e7b99-b9fb-4c57-bbf5-f8d849fcae3c",
  "name": "Gaslit Nation",
  "spotifyId": "2vUkbX4rnbHU8ZrvASDytC",
  "appleId": 1400926647,
  "youTubeChannelId": "UC18gEu4hJc8ZpoIafeB5Pgg",
  "episodes": [
    {
      "id": "177c0675-078d-481b-b139-fee813b61a41",
      "title": "Opus Dei",
      "description": "How does Franco’s reign in Spain connect to the rise of Trump? In this gripping true-crime thriller, financial journalist Gareth Gore, while investigating a bank collapse in Spain, follows the money trail to uncover a vast international conspiracy behind Opus Dei. What is Opus Dei? It\u0027s a shadowy global right-wing organization founded in Spain just before the Spanish Civil War. Supported by powerful Republican figures like Leonard Leo, Opus Dei is a Christian nationalist movement fueling efforts to dismantle democracy and pave the way for dictatorship in America. Gore, the author of the explosive book Opus: The Cult of Dark Money, Human Trafficking, and Right-Wing Conspiracy Inside the Catholic Church , delves into this insidious network. In this chilling conversation, recorded just before the U.S. election, Gore reveals how Opus Dei’s influence stretches from Capitol Hill to the Supreme Court—and what is being done, including by the Pope, to try to curb its destructive power. This week\u0027s bonus show features a live interview with Dr. Emma Briant, one of the world’s foremost experts on disinformation warfare and propaganda. Dr. Briant, co-editor of The Routledge Handbook on the Influence Industry and author of Propaganda and Counter-Terrorism: Strategies for Global Change, shares invaluable insights into the weapons of global propaganda. Gaslit Nation returns with all-new episodes on January 7th! We’re excited to continue this fight for truth and justice with you—together, we can plant the seeds of meaningful change. Democracy Defender ($10/month) and higher supporters, don’t forget to submit your questions for our upcoming bonus show Q\u0026A! Thank you to everyone who supports the show–we could not make Gaslit Nation without you! Want to enjoy Gaslit Nation ad-free? Join our community of listeners for bonus shows, ad-free episodes, exclusive Q\u0026A sessions, our group chat, invites to live events like our Monday political salons at 4pm ET over Zoom, and more! Sign up at Patreon.com/Gaslit! We\u0027re running this week\u0027s episode earlier than usual due to the New Year\u0027s Eve holiday--happy new year, everyone! We\u0027ll get through what comes next together!",
      "release": "2024-12-31T19:00:00Z",
      "duration": "01:04:18.1280000",
      "explicit": false,
      "spotifyId": "6Jce8FtmMX7Y3aQt40wEQC",
      "appleId": 1000682259964,
      "youTubeId": "EHB_WtvGies",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Jce8FtmMX7Y3aQt40wEQC",
        "apple": "https://podcasts.apple.com/podcast/opus-dei/id1400926647?i=1000682259964",
        "youtube": "https://www.youtube.com/watch?v=EHB_WtvGies"
      }
    },
    {
      "id": "41aa584b-fce5-4300-847b-f252d3391abd",
      "title": "The Cult Age: Interview with Cult Expert Dr. Janja Lalich",
      "description": "Countries undergoing extreme instability – like, say, a violent insurrectionist coup, a deadly plague, climate change catastrophes, and domestic and foreign information warfare – tend to breed cults, and America is no exception! This week Gaslit Nation welcomes cult and extremism expert Dr Janja Lalich to explain the rise of fringe movements in the US and how to deal with it.",
      "release": "2022-04-13T02:29:03Z",
      "duration": "00:58:41",
      "explicit": false,
      "spotifyId": "7zFGCHW7hPHMqSaFinypHn",
      "youTubeId": "Tk-Lmt30TMA",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7zFGCHW7hPHMqSaFinypHn",
        "youtube": "https://www.youtube.com/watch?v=Tk-Lmt30TMA"
      }
    }
  ]
}