{
  "id": "6ec2429c-231a-4cc0-9957-24dfaca91e22",
  "name": "Geraldo Rivera",
  "youTubeChannelId": "UCmVyeGK6HCNdOkuLZrXYzNw",
  "episodes": [
    {
      "id": "591599ff-c60c-4fe0-807d-3eea9ed35378",
      "title": "1991.  The cult of John Roger, and how his Insight seminars are sometimes paid for with tax dollars",
      "description": "1991.  Geraldo Rivera on his Now It Can Be Told program investigates \u0027JR\u0027, or John Roger, who has built a multi-million dollar tax exempt empire around his claim to holiness.  Mr. Roger says he was endowed with godly powers during kidney stone surgery in 1963, and he could teach other mortals to use power of the mind in acquiring worldly goods.\n\n\u0027The Movement of Spiritual Inner Awareness\u0027, or MSIA has devotees living at a seminary in Los Angeles, and this church of John Rogers has also attracted some very high profile Hollywood personalities.  The school he founded, the University of Santa Monica, offers Insight Seminars which are popular in the United States and around the world.  Attendees are frequently sent by federal agencies, including the Navy and the Social Security Administration.\n\nLater in the segment we hear from the Cult Awareness Network about the MSIA, and throughout are former disciples, defectors and others familiar with this shadowy network of holy man and tax money.  John Rogers did not want to answer any questions and when found at one of his book signings laughed off the questions.\n\nThe MSIA, Univeristy of Santa Monica, and Insight Seminars all still exist today in 2025.  John Rogers passed away in 2014, age 80.",
      "release": "2025-04-26T04:00:31Z",
      "duration": "00:12:29",
      "explicit": false,
      "youTubeId": "J9aetNZDOxY",
      "subjects": [
        "Movement of Spiritual Inner Awareness"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J9aetNZDOxY"
      }
    },
    {
      "id": "10622138-9173-4b4c-ba14-0d497d30b825",
      "title": "1988.  Charles Manson, at San Quentin prison, extended interview on who, why, and what he is",
      "description": "1988.  Geraldo Rivera goes to San Quentin prison for an interview with convicted murderer Charles Manson.  This exclusive sit-down with the madman uncovers a lot of his criminal mindset.  Serial killer, cult leader....is he a \u0027sane\u0027 trickster or legitimately psycho?  We start with about 1 minute of recap, before Charlie recounts his childhood and world view.  The interview moves on to various aspects of blaming society for wanting him to be the evil man, to \u0027not being guilty of anything\u0027, to his relationship with his followers and how it began.\n\n\u0022I\u0027m in paradise..\u0022 \n \n\u0022I\u0027m the lawmaker...\u0022 \n\nIn the course of this interview Charlie admits having influenced \u0027the kids at the ranch\u0027 but denies responsibility for the 7 murders that put him in prison. \n\nCharles Manson died at age 83, after 4 decades behind bars.",
      "release": "2025-03-05T15:19:45Z",
      "duration": "00:15:39",
      "explicit": false,
      "youTubeId": "hX5y36P9hUU",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hX5y36P9hUU"
      }
    }
  ]
}