{
  "id": "6ec2429c-231a-4cc0-9957-24dfaca91e22",
  "name": "Geraldo Rivera",
  "youTubeChannelId": "UCmVyeGK6HCNdOkuLZrXYzNw",
  "episodes": [
    {
      "id": "06be2a42-d4e7-4da2-8e51-2eb012f9682b",
      "title": "1980.  Lifespring and other cults across America, members and principals speak",
      "description": "October 30th, 1980.  Geraldo Rivera for Eyewitness News brings us this provocative report on Lifespring, and the general cult ecosystem in the United States.\n\n\u0022...and his uncontrolled euphoria is one typical response.  You see the Lifespring training uses powerful psychological techniques...\u0022\n\nThe beginning of this segment puts it in perspective, with hundreds of thousands of young Americans looking for a new addiction.  After mind-altering drugs came mind-altering organizations before leading to organizations likes Lifespring.\n\nWe look at the training sessions in use, speaking to members who have been through it.  Does the group\u0027s emphasis on self-reliance lead to ignorance of serious medical conditions?\n\nLifespring was a for-profit organization founded in 1974 and becoming defunct in the mid 1990s.  Despite the controversy it claimed to have trained over 400,000 people across the United States.\n\nThis day, Geraldo\u0027s television history.",
      "release": "2025-10-31T13:00:07Z",
      "duration": "00:17:47",
      "explicit": false,
      "youTubeId": "2cMrVam7Qbk",
      "subjects": [
        "Lifespring"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2cMrVam7Qbk"
      }
    },
    {
      "id": "7ded6212-2577-4364-8d6e-e37fbd88f391",
      "title": "1990.  Jeffrey Lundgren a cult leader led family to death, former members of his group speak",
      "description": "October 26th, 1990.  Geraldo Rivera on his namesake talk show brings us the story of Jeffrey Lundgren, then facing the electric chair.\n\n\u0022Dennis and Cheryl Avery along with their three young daughters were attracted to Lundgren\u0027s church because it upheld what they believed to be a fundamentalist view of the Mormon religion...\u0022\n\nThe story of Jeffrey Lundgren\u0027s Latter Day Saint based movement is recapped, along with the convincing followers a blood sacrifice must be made to get to the promised land.  Other cults and killings related to them are mentioned.\n\nKeith and Kevin, former members of Mr. Lundgren\u0027s cult are in studio and speak about how they joined the movement in Kirtland, Ohio, an important spot for Mormons.  We learn about Jeffrey\u0027s progression into \u0027prophet\u0027 and \u0027seer\u0027 and how it led to the murder of an innocent family.\n\nJeffrey Lundgren was executed in 2006 at the Southern Ohio Correctional Facility.\n\nThis day, Geraldo\u0027s television history.",
      "release": "2025-10-29T13:00:21Z",
      "duration": "00:12:54",
      "explicit": false,
      "youTubeId": "AxANBTNERSM",
      "subjects": [
        "Jeffrey Lundgren",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AxANBTNERSM"
      }
    },
    {
      "id": "f4bd2b06-1ac8-4966-a4f2-0b052e2f8321",
      "title": "1991.  President of Scientology International and Cult Exit counselor face off",
      "description": "October 10th, 1991.  Geraldo Rivera on his namesake talk show brings us a segment on Scientology, hearing from church president Heber C. Jentzsch and author Steve Hassan.\n\n\u0022Do you sir, allege that Scientology is a destructive cult?\u0022\n\nThis segment largely begins with a response to a recent Time magazine article which accused the religous organization of being less than scrupulous.  We hear from Scientologists in the audience, as well as from Monica Pignotti a former member and confidante of L. Ron Hubbard.\n\nIn 2025, the controversy continues.  Scientology - religion to help millions around the world to a better life, or extortionist cult benefiting those at the top?\n\nThis day, Geraldo\u0027s television history.",
      "release": "2025-10-10T13:00:42Z",
      "duration": "00:10:37",
      "explicit": false,
      "youTubeId": "KHz5w8-Gilo",
      "subjects": [
        "Scientology",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KHz5w8-Gilo"
      }
    },
    {
      "id": "a826357c-3b0a-41ed-a5d0-9430a71444dc",
      "title": "1990.  Scientology, a cult or path to better life?  Member and ex-member of church speak",
      "description": "August 22nd, 1990.  Geraldo Rivera on his namesake talk show brings us \u0027Cult Moms\u0027, with this segment focusing on a mom who escaped the Church of Scientology, as well as a current member.\n\n\u0022..Scientology helps people be more aware of themselves, people find out more about their lives and what they want to do in it, we\u0027re in the business....of keeping families together.\u0022\n\nThis segment focuses on whether Scientology and other potential cults tend to prey on women going through a major life change; divorce, tragic loss.  Is the Church of Scientology destructive, or does it change peoples\u0027 lives for the better?  We also hear from a cult expert and psychologist in the audience about Dianetics, L. Ron Hubbard, and his son who committed suicide.\n\nThis day, Geraldo\u0027s television history.\n\u0022",
      "release": "2025-08-22T13:00:41Z",
      "duration": "00:07:45",
      "explicit": false,
      "youTubeId": "HsxtmL_04Ns",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HsxtmL_04Ns"
      }
    },
    {
      "id": "591599ff-c60c-4fe0-807d-3eea9ed35378",
      "title": "1991.  The cult of John Roger, and how his Insight seminars are sometimes paid for with tax dollars",
      "description": "1991.  Geraldo Rivera on his Now It Can Be Told program investigates \u0027JR\u0027, or John Roger, who has built a multi-million dollar tax exempt empire around his claim to holiness.  Mr. Roger says he was endowed with godly powers during kidney stone surgery in 1963, and he could teach other mortals to use power of the mind in acquiring worldly goods.\n\n\u0027The Movement of Spiritual Inner Awareness\u0027, or MSIA has devotees living at a seminary in Los Angeles, and this church of John Rogers has also attracted some very high profile Hollywood personalities.  The school he founded, the University of Santa Monica, offers Insight Seminars which are popular in the United States and around the world.  Attendees are frequently sent by federal agencies, including the Navy and the Social Security Administration.\n\nLater in the segment we hear from the Cult Awareness Network about the MSIA, and throughout are former disciples, defectors and others familiar with this shadowy network of holy man and tax money.  John Rogers did not want to answer any questions and when found at one of his book signings laughed off the questions.\n\nThe MSIA, Univeristy of Santa Monica, and Insight Seminars all still exist today in 2025.  John Rogers passed away in 2014, age 80.",
      "release": "2025-04-26T04:00:31Z",
      "duration": "00:12:29",
      "explicit": false,
      "youTubeId": "J9aetNZDOxY",
      "subjects": [
        "Movement of Spiritual Inner Awareness"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J9aetNZDOxY"
      }
    },
    {
      "id": "10622138-9173-4b4c-ba14-0d497d30b825",
      "title": "1988.  Charles Manson, at San Quentin prison, extended interview on who, why, and what he is",
      "description": "1988.  Geraldo Rivera goes to San Quentin prison for an interview with convicted murderer Charles Manson.  This exclusive sit-down with the madman uncovers a lot of his criminal mindset.  Serial killer, cult leader....is he a \u0027sane\u0027 trickster or legitimately psycho?  We start with about 1 minute of recap, before Charlie recounts his childhood and world view.  The interview moves on to various aspects of blaming society for wanting him to be the evil man, to \u0027not being guilty of anything\u0027, to his relationship with his followers and how it began.\n\n\u0022I\u0027m in paradise..\u0022 \n \n\u0022I\u0027m the lawmaker...\u0022 \n\nIn the course of this interview Charlie admits having influenced \u0027the kids at the ranch\u0027 but denies responsibility for the 7 murders that put him in prison. \n\nCharles Manson died at age 83, after 4 decades behind bars.",
      "release": "2025-03-05T15:19:45Z",
      "duration": "00:15:39",
      "explicit": false,
      "youTubeId": "hX5y36P9hUU",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hX5y36P9hUU"
      }
    },
    {
      "id": "c287843b-947a-457a-adf4-d64c4721f804",
      "title": "1990.  Jim Jones Jonestown \u0027Peoples Temple\u0027 and congressman Leo Ryan\u0027s untimely death",
      "description": "1990.  On his namesake talk show, Geraldo Rivera hosts Patricia Ryan, the daughter of deceased congressman Leo Ryan.  This clip starts with a look at  the \u0022Peoples Temple\u0022, an allegedly religious movement known for a mass death event at their remote location in Guyana, 1978.  Footage is shown of the location as it was later found by the government of Guyana.  We then hear from daughter Patricia Ryan about what it was like to grow up the midst of these events, losing her father.  \n\nThese events occured in 1978.\n\nCongressman Leo Ryan led a fact finding mission to \u0027Jonestown\u0027 amid reports of involuntary confinement and even murder of the followers there.  On his initiative a large group went to Guyana, including concerned family members of the Jonestown followers.  Upon his departure Congressman Ryan was gunned down by fanatical \u0022People\u0027s Temple\u0022 followers, along with four others, hours before the mass death event killed over 900 people at Jonestown itself. \n\nLarry Layton, likely the first to open fire inside of Congressman Ryan\u0027s departing cessna, was convicted in 1987 of aiding and abetting the murder of the Congressman as well as other crimes.  He served 18 years in prison and was released from custody in 2002.\n\nIn total five people were murdered at Port Kaituma under Jim Jones direction, including Congressman Leo Ryan, as their plane was preparing for departure.\n\nFour others committed suicide at a People\u0027s Temple facility in Georgetown, the capital of Guyana.\n\nHours later 909 cult members died at the Jonestown facility after consuming a grape flavor-aid beverage laced with poisons.  Many were likely injected against their will.",
      "release": "2024-12-02T14:04:54Z",
      "duration": "00:06:13",
      "explicit": false,
      "youTubeId": "81hII1kEbG8",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=81hII1kEbG8"
      }
    }
  ]
}