{
  "id": "fe49a761-9dab-4613-90a8-12d02ff8b299",
  "name": "Get Real with Caroline Hobby",
  "spotifyId": "2Awycqvftc2EsWApVrVgjA",
  "appleId": 1093664694,
  "episodes": [
    {
      "id": "1c7b05c4-6b36-4a97-814f-813e0e153838",
      "title": "Getting Real with Naomi Johnson: From Cults to Clarity, Former Lead Singer of Runaway June, is Ready to Speak Her Truth",
      "description": "Naomi grew up off the grid—one of 11 kids living in a converted school bus, traveling the country, and even spending time in a cult. She learned guitar as a child, playing at gas stations to help her family afford life on the road. Now a wife and mother, Naomi is opening up about the full truth of her past—and the moment that changed everything. After nearly dying during childbirth, she gained a profound new perspective on life. That experience sparked a deep inner shift, awakening a fierce feminine strength and emotional clarity that flows through her latest work. Her new songs, “Bricks Make Houses” and “Mama Ain’t Jesus,” are her most honest yet—music that embraces both the pain and the beauty of the road that led her here. See omnystudio.com/listener for privacy information.",
      "release": "2025-06-09T07:32:08Z",
      "duration": "01:44:28.1330000",
      "explicit": false,
      "spotifyId": "1zht3YTidRcGBSj59ImpnQ",
      "appleId": 1000712059841,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zht3YTidRcGBSj59ImpnQ",
        "apple": "https://podcasts.apple.com/podcast/getting-real-with-naomi-johnson-from-cults-to-clarity/id1093664694?i=1000712059841"
      }
    },
    {
      "id": "91977153-1ca2-4883-9e40-72b90076e583",
      "title": "BETHANY JOY LENZ: Caught in the Web: Getting Real on Escaping a Cult and Reclaiming Her Power",
      "description": "Bethany Joy Lenz, star of One Tree Hill, opens up about one of the most harrowing chapters of her life—being drawn into a spiritual cult. In a candid conversation, she shares how a combination of intense personal loneliness and the search for belonging made her vulnerable to manipulation. Joy reveals the psychological and emotional tactics used to control her, how the leader exploited her trust, and the dangerous effects of losing autonomy in a groupthink environment. With deep honesty, she discusses the moment of clarity that allowed her to break free, reclaim her power, and reconnect with her true self. This is a story of survival, strength, and the courage to break free from the grip of toxic control. From faith to fame, discover how Joy navigated the spiritual minefield that could have derailed her life and career, and how she emerged stronger and wiser than ever before. See omnystudio.com/listener for privacy information.",
      "release": "2024-12-16T05:55:36Z",
      "duration": "01:32:59.2840000",
      "explicit": false,
      "spotifyId": "6Kt0NDlLOHpNPTssHMyxSV",
      "appleId": 1000680516663,
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Kt0NDlLOHpNPTssHMyxSV",
        "apple": "https://podcasts.apple.com/podcast/bethany-joy-lenz-caught-in-the-web-getting-real-on/id1093664694?i=1000680516663"
      }
    }
  ]
}