{
  "id": "8f86f1e2-2416-4450-8a7c-5962aae612c8",
  "name": "Getting Better with Jonathan Van Ness",
  "spotifyId": "0wK8MPt9f2z2R4HustgqHh",
  "appleId": 1068563276,
  "youTubeChannelId": "UCf5LdDDOm1hYgDcSP3KimNA",
  "episodes": [
    {
      "id": "d62fbe87-fa5a-43e6-8ad6-4d3fa4e5f865",
      "title": "When Wellness Turns Dangerous: Inside the OneTaste Cult",
      "description": "Why do smart, curious people join cults? JVN is joined by investigative journalist Ellen Huet, who spent years interviewing more than 125 former members to expose how a movement built around empowerment, intimacy, and “sexual wellness” spiraled into coercion, manipulation, and abuse of power. Together, we break down how wellness culture can blur boundaries, why charismatic leaders are so effective, and how language around healing and liberation can be weaponized. They explore what OneTaste and Orgasmic Meditation (O.M.) actually promised, how social pressure and taboo minimization kept people trapped, and what finally led to an FBI investigation and federal trial. Most importantly, we talk about why smart, curious people join cults, how to spot red flags before it’s too late, and what to do if someone you love might be caught in one. Full Getting Better Video Episodes now available on YouTube . Follow Ellen Huet on Instagram @ehuet Follow us on Instagram @gettingbetterwithjvn Jonathan on Instagram @jvn Senior Producer, Chris McClure Producer, Editor \u0026 Engineer is Nathanael McClure Production support from Chad Hall Our theme music is also composed by Nathanael McClure. Check out the JVN Patreon for exclusive BTS content, extra interviews, and much much more - check it out here: www.patreon.com/jvn Curious about bringing your brand to life on the show? Email podcastadsales@sonymusic.com . Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2026-01-14T05:00:00Z",
      "duration": "00:53:58.0080000",
      "explicit": true,
      "spotifyId": "47q6ZNPqR6Bcvld97yCper",
      "appleId": 1000745089142,
      "youTubeId": "nFVKy9BXm5o",
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/47q6ZNPqR6Bcvld97yCper",
        "apple": "https://podcasts.apple.com/podcast/when-wellness-turns-dangerous-inside-the-onetaste-cult/id1068563276?i=1000745089142",
        "youtube": "https://www.youtube.com/watch?v=nFVKy9BXm5o"
      }
    }
  ]
}