{
  "_ts": 0,
  "id": "c694dcb1-871e-4270-83ca-7839d5c1ce8f",
  "name": "GG4GB",
  "youTubeChannelId": "UCCZyAT1RZ3aMfmrifTic1zQ",
  "episodes": [
    {
      "id": "47f6fdf9-487a-45cc-956b-f330b9dbc441",
      "title": "The Jehovah\u0027s Witness Religion is NOW OFFICIALLY DEAD. \u0022Babies are ENEMIES of jehovah\u0022 WTF???",
      "description": "Steven Lett Governing Body says Babies are Enemies of jehovah their god.\nAND HE IS CORRECT!!!!!!!!",
      "release": "2022-07-03T03:32:54Z",
      "duration": "00:23:58",
      "explicit": false,
      "youTubeId": "6uPMn_4ffqE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6uPMn_4ffqE"
      }
    },
    {
      "id": "2a48e402-3d6b-407a-ae98-e7b6c08e28e5",
      "title": "Why do Jehovah\u0027s Witnesses  Make Videos",
      "description": "This is just seo stuff blah blah \nThere is a Civil war in the Jehovah’s Witness Church.\nGG4GB Gilbert Gonzalez runs for Governing Body in October 2016 Annual meeting of Jehovah’s Witnesses using the Early Voting Ballot\nWith hopes of riding the Organization of the cockroaches and pedophiles .\n \nJehovah’s Witnesses do not be mislead by the 7 “Guardians of Doctrine”\nWatchtower Bible and Tract Society is but a building of brick and mortar. Store your treasures in heaven. Jesus does not teach via jw.org  or watchtower.org nor did he teach Institutionalized shunning .\n  Kingdom Hall or Assembly Hall.  Disfellowship and Shun Charles Taze Russell, Joseph Rutherford, Nathan Knorr , Fredrick Franz, Milton Henschel, John Barr , Theodore Jaracz, David Splain, Anthony Morris III , Geoffrey Jackson, Lett, Samuel Herd, Mark Sanderson  \u0026 all others are simple men that bleed red like you and me. They are no more “anointed” than any other man or woman. there were more than 144,000  christians in the first century christian era. Jesus nor his Father live at 25 Columbia Heights New York NewYork. So why call it God’s House?  If you must go door to door in ministry please do not take the Watchtower \u0026 Awake magazine nor any books by men. Take a Shovel Rake and a Broom if you must go. Jesus does not want a printing empire in Warwick RI, Patterson NY or Watchtower Farms in Walkill NY.\nJesus Wants us to care for the Poor the Widows and Orphans. The Fatherless boy and girl. \nJesus tell us at Luke 14 to save the life by accepting blood transfusions if life is at stake. Organ transplants and Vaccines are a conscience matter. \nThe New World Translation tells us what we already know. You are a Secret Society. Just like the Masons and others.  You may not be Masons but your Spirit is similar. You call yourself “Spirit directed organization” What an insult that is to the “Holy Spirit” and the “Spirit of Truth“ . \nGillead Graduates  spend more time reading about 1919 and 1914 than on our Savior Christ Jesus. My Gillead Missionary friend told me that being a JW missionary was the “greatest expression of loyalty to the Slave Class” WOW He never mentioned Jesus Christ. \nAll Scripture Inspired by God, Revelation it’s grand Climax is at hand, You can live forever in a paradise on earth, my book of bible stories,  Our Christian life and ministry , Theocratic ministry school, Service meeting, Our kingdom ministry, Sing praises to Jehovah, Preaching the Good news, Don Adams , International Bible students association, black mass, governing body of jehovah’s witnesses, Raymond Franz.  Australian Royal Commission on child sex abuse. Paradise lost Paradise regained. Watchtower Bible and tract society of Pennsylvania. \nWatchtower Bible and tract society of New York.  \nStake vs Cross ? The Lords Supper or Sacraments? Westboro Baptist Church , Smurfs Superstition.  pedophilia and homosexuality among governing body?\nsign language and masturbation.",
      "release": "2016-04-17T03:05:35Z",
      "duration": "00:05:35",
      "explicit": false,
      "youTubeId": "V0wx-cA6bzQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V0wx-cA6bzQ"
      }
    }
  ]
}