{
  "id": "397d3f29-89d4-4097-8b5c-5c38614f8280",
  "name": "Giants Amongst Us",
  "spotifyId": "3vqWe0P1jUBuWDpXDzSde5",
  "episodes": [
    {
      "id": "440675db-47ff-461c-91cc-57e7e74df2a6",
      "title": "Raised In A Cult, Abused As A Child, And The Healing And Forgiveness That Came After || Emmanuel",
      "description": "Real stories, told by real people.We\u0027re back!! And I hope this finds you all in good spirits. Today, we\u0027re joined by Emmanuel, and he\u0027s got a story to tell. He talks about life for him as a child - an abusive mother, being raised in a cult, and kept away from his father, and all alone. When the authorities, police officers, school board members, and other adults did nothing in response to his pleas for help and reports of abuse. Emmanuel out of desperation and fear, fled and ran away at 15 years old.Through all the pain, suffering, trauma and the guilt of blaming himself for the abuse. There\u0027s also healing and forgiveness. And Emmanuel, who credits his faith in God for being a reason as to why, years later he was able to forgive his mother for the abuse suffered as a child. That was a big part of his healing. Emmanuel is definitely a GIANT AMONGST US, With new life, purpose, and meaning.If you enjoyed the Show, you can support it with a rating, and leaving a review. And word a mouth is still the best advertisement, so if you know someone who you think might find value in any of these stories, share it with them.\u0027Tilvery soon,PEACE!!_____Connect with Emmanuel :Odysee : odysee.com/$/invite/@EmmanuelGoldstein:dSubscribeStar : subscribestar.com/emmanuel-goldsteinTruth Social : truthsocial.com/@Emmanuel_GoldsteinBitChute : bitchute.com/channel/emmanuelgoldsteinMinds : https://www.minds.com/emanuel_goldstein/?referrer=emanuel_goldsteinYoutube : https://youtube.com/@EmmanuelGoldsteinINGSOC?si=l5KKnhddXbQWb399____More of Giants Amongst Us :Website : https://giantsamongstus.comTo Share Your Story : giantsamongstus@tutanota.comStickers \u0026 Other Accessories : https://www.redbubble.com/people/QuotestoChew/shop?asc=uFollow on Instagram : https://www.instagram.com/giantsamongstus/_____Background music by :@bnoizemusic",
      "release": "2023-10-02T00:00:00",
      "duration": "01:17:17.2880000",
      "explicit": true,
      "spotifyId": "3vs7eK0f3MfYB70IVw9MP9",
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vs7eK0f3MfYB70IVw9MP9"
      }
    }
  ]
}