{
  "id": "397d3f29-89d4-4097-8b5c-5c38614f8280",
  "name": "Giants Amongst Us",
  "spotifyId": "3vqWe0P1jUBuWDpXDzSde5",
  "episodes": [
    {
      "id": "5b931e40-60cd-496f-9a85-1869b99b276c",
      "title": "Shunned, And Ex Communicated, Former Jehovah\u0027s Witness Turned Activist Through The Arts || Scott",
      "description": "Real stories, told by real people.Happy Holidays, we\u0027re back!!! Today, Scott joins us, and he\u0027s got a story to tell.Imagine losing everything and everyone. Family, friends, and any support once had, gone.  Because of a difference in belief.  Scott, lost his entire family, 17 members on his fathers side, ex-communicated him.  Scott left the church 15 years ago, and hasn\u0027t had any contact with his family for 13 of those 15 years.  In the world of Jehovah\u0027s Witness, it\u0027s called \u0022shunning - \u0022children being taken ... grand kids being cut off .... tragic family separations\u0022Leaving the church, and the want to remove himself from anything to do with the cult, he eventually moved to Vietnam.  And that\u0027s where things get interesting - \u0022I would of probably just lived with that traumatic thing inside, and never said anything about it, but something started happening living there.\u0022  From trying to escape his story to becoming an activist.Since 2016, he\u0027s been part of a project : The Witness Underground documentary, as well as The Witness Underground podcast. I\u0027d like to welcome another GIANT AMONGST US.  I enjoyed the conversation we had and Scott left a lot of good nuggets on the table, take what you will from it.\u0027Til next timeand very soon,PEACE!!_____FIND OUT WHAT\u0027S ON DECK, UPCOMING STORIES, AND ANYTHING NEW WITH GIANTS AMONGST US :https://www.buymeacoffee.com/Giantsamongstus_____Scott Homan :Website : WitnessUnderground.com | BananaIslandFilms.comTwitter : @WitnessFilmsInstagram : @WitnessUndergroundYoutube : Youtube.com/@WitnessUndergroundFacebook : WitnessUndergroundSupport : Patreon.com/WitnessUnderground-\u003E Also 50% off discount to watch link (RENT (one week watch) or BUY (download))https://vimeo.com/r/3M2P/VC9vbnNNdm_____More of Giants Amongst Us :Website : https://giantsamongstus.comTo Share Your Story : giantsamongstus@tutanota.comReddit : https://www.reddit.com/r/Giants_Amongst_Us/Follow on Instagram : https://www.instagram.com/giantsamongstus/_____Background music by :@bnoizemusic",
      "release": "2023-12-23T00:00:00",
      "duration": "01:41:52.7710000",
      "explicit": false,
      "spotifyId": "1lei1W3xiy2wb2pyCKJ7HN",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lei1W3xiy2wb2pyCKJ7HN"
      }
    },
    {
      "id": "b0b1e488-c91c-4f0b-8120-ba84e44043c7",
      "title": "From The Fetus, Indoctrinated And Conditioned To Be A Jehovah\u0027s Witness || F.S",
      "description": "Real stories, told by real people.Today, F.S. joins us and he\u0027s got a story to tell. From the womb, indoctrination is encouraged by Jehovah\u0027s Witness. The listening of tapes, and sermons out loud while pregnant was something his mother did, says F.S - \u0022my doctrination started before I was born.\u0022 Child to teenager, then to an adult, F.S, his whole world revolved around a governing body, the ruling council of Jehovah\u0027s Witness.There\u0027s a lot to unpack, and F.S does a great job in doing this. Sharing life growing up as a Jehovah\u0027s Witness. The trauma instilled in him as a child, because of Armageddon, and the destruction that was to follow -\u0022It made me suicidal big time, as a child, the first suicidal thought I had, I was 10 years old.\u0022 F.S. also shares with us, in detail, the death and abuse this organization is responsible for. It\u0027ll be surprising for some.Just recently (a couple years ago) he separated himself from the organization, and because of it, lost everything. Family, friends, and ultimately the world as he knew it. Leaving him at ground zero, and alone in a world he was programmed to believe was against him. He had his truth, his conviction, and an awakening. But, it came with a price. That\u0027s his reason for wanting to share his story with us today. He\u0027s angry, and rightfully so. Another GIANT AMONGST US, with a passion and desire to bring awareness and shed light on what\u0027s really going on behind the curtain, of what he calls, a cult.If you enjoyed the Show, you can support it at no cost at all. Simple as giving a rating and review, if you feel it\u0027s been of value to you. We appreciate the feedback. Word a mouth is still the best advertisement, so if you know someone who also may find value in any of these stories, share it with them.\u0027Til next timeand very soon,PEACE!!_____FIND OUT WHAT\u0027S ON DECK, UPCOMING STORIES, AND ANYTHING NEW WITH GIANTS AMONGST US :https://www.buymeacoffee.com/Giantsamongstus_____Links and references exposing JW\u0027s history and doctrines :Website : https://avoidjw.org/Youtube : https://youtube.com/@altworldly?si=S3Vo-AYASluB7OuRYoutube : https://youtube.com/@Self-AwareNPC?si=UUDVlHEIrdmm2rWBReddit : https://www.reddit.com/r/exjw/_____More of Giants Amongst Us :Website : https://giantsamongstus.comTo Share Your Story : giantsamongstus@tutanota.comReddit : https://www.reddit.com/r/Giants_Amongst_Us/Follow on Instagram : https://www.instagram.com/giantsamongstus/_____Intro Track :officialfifthmusic.com_____Background music by :@bnoizemusic",
      "release": "2023-12-10T00:00:00",
      "duration": "01:58:09.7520000",
      "explicit": false,
      "spotifyId": "7MqY2NDhBHmrI05kgcxKbe",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MqY2NDhBHmrI05kgcxKbe"
      }
    },
    {
      "id": "440675db-47ff-461c-91cc-57e7e74df2a6",
      "title": "Raised In A Cult, Abused As A Child, And The Healing And Forgiveness That Came After || Emmanuel",
      "description": "Real stories, told by real people.We\u0027re back!! And I hope this finds you all in good spirits. Today, we\u0027re joined by Emmanuel, and he\u0027s got a story to tell. He talks about life for him as a child - an abusive mother, being raised in a cult, and kept away from his father, and all alone. When the authorities, police officers, school board members, and other adults did nothing in response to his pleas for help and reports of abuse. Emmanuel out of desperation and fear, fled and ran away at 15 years old.Through all the pain, suffering, trauma and the guilt of blaming himself for the abuse. There\u0027s also healing and forgiveness. And Emmanuel, who credits his faith in God for being a reason as to why, years later he was able to forgive his mother for the abuse suffered as a child. That was a big part of his healing. Emmanuel is definitely a GIANT AMONGST US, With new life, purpose, and meaning.If you enjoyed the Show, you can support it with a rating, and leaving a review. And word a mouth is still the best advertisement, so if you know someone who you think might find value in any of these stories, share it with them.\u0027Tilvery soon,PEACE!!_____Connect with Emmanuel :Odysee : odysee.com/$/invite/@EmmanuelGoldstein:dSubscribeStar : subscribestar.com/emmanuel-goldsteinTruth Social : truthsocial.com/@Emmanuel_GoldsteinBitChute : bitchute.com/channel/emmanuelgoldsteinMinds : https://www.minds.com/emanuel_goldstein/?referrer=emanuel_goldsteinYoutube : https://youtube.com/@EmmanuelGoldsteinINGSOC?si=l5KKnhddXbQWb399____More of Giants Amongst Us :Website : https://giantsamongstus.comTo Share Your Story : giantsamongstus@tutanota.comStickers \u0026 Other Accessories : https://www.redbubble.com/people/QuotestoChew/shop?asc=uFollow on Instagram : https://www.instagram.com/giantsamongstus/_____Background music by :@bnoizemusic",
      "release": "2023-10-02T00:00:00",
      "duration": "01:17:17.2880000",
      "explicit": true,
      "spotifyId": "3vs7eK0f3MfYB70IVw9MP9",
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vs7eK0f3MfYB70IVw9MP9"
      }
    }
  ]
}