{
  "id": "1c03bfb1-dcd6-44ee-92bc-54fb5f92f3d3",
  "name": "Girls Gone Godless",
  "spotifyId": "7eDH08ENJQp5zXSKibuYmt",
  "appleId": 1827740968,
  "youTubeChannelId": "UCNf_qFRvylVwDWzF7Ox4dNw",
  "episodes": [
    {
      "id": "bfea9c31-f1f5-4cdd-b259-64021abc6bd5",
      "title": "Knitting Cult Lady: Knot Today, Fascism.",
      "description": "Whether it be telling the story of being born into the infamous Children of God cult, breaking through barriers in the United States Army, or knitting a dress while teaching us how to combat fascism, Daniella Mestyanek Young (aka Knitting Cult Lady) manages to do these things with a strength and tenacity that can only be rivaled by her flair for color. \nIn this episode, we try not to fan-girl too hard, while learning about the amazing journey of healing, self-discovery and education that Daniella has been on, after all the trauma, obstacles and straight-up b******t that she has had to endure. She also writes about her incredible journey in her 2022 memoir, Uncultured, and in her upcoming book, The Culting of America: What Makes a Cult and Why We Love Them (available for pre-order now).\nCome along with us as we find out what may be hiding inside the Moon, and why cults are so obsessed with our unmentionables!\nYou can find Daniella on Tik Tok as @knitting.cult.lady or visit linktree.com/daniellamyoung to find all of her merch, current projects, podcast information, sword shaped knitting needles, and more.\nSupport the show\nhttps://linktr.ee/girlsgonegodless",
      "release": "2025-10-26T07:00:00Z",
      "duration": "01:28:28",
      "explicit": false,
      "spotifyId": "7raMXXeeZ5Y6v2jLu5Wdi6",
      "appleId": 1000733529259,
      "youTubeId": "0002o-LgkR0",
      "subjects": [
        "Children Of God",
        "Cult-Expert",
        "_America",
        "Political Cult",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7raMXXeeZ5Y6v2jLu5Wdi6",
        "apple": "https://podcasts.apple.com/podcast/knitting-cult-lady-knot-today-fascism/id1827740968?i=1000733529259",
        "youtube": "https://www.youtube.com/watch?v=0002o-LgkR0"
      }
    }
  ]
}