{
  "id": "462e59be-bb88-4ff0-bb1a-6aeba8e22ea1",
  "name": "Girls Who Recover with Dana Hunter Fradella",
  "spotifyId": "1F9W7K0FLktTn7htvrvAa5",
  "appleId": 1788356772,
  "episodes": [
    {
      "id": "3217700d-3138-46e3-a24b-4a6623fb6471",
      "title": "Episode 45: Escaping Domestic Violence, Leaving a Cult, and Finding Personal Freedom: How to Trust Yourself Again After Narcissistic Abuse with Ashana Kaiulani",
      "description": "Text me what you love \u0026#43; suggestions to make GWR even better! So you\u0027ve built a strong recovery foundation and now you’re ready to break through life’s glass ceilings and create next-level success that feels as good as it looks? I want to help you make it happen. Book your free 1:1 Next Level Breakthrough Call , and together we\u0027ll: get clear on what next level success in your life in recovery looks like name the biggest thing holding you back from having it now, and map out a powerful strategy to create success in the areas of your life and career that matter most You deserve to experience next level success, to expand what’s possible in your life, to step into the identity of a woman in recovery who knows WTF she is, and to know exactly what to do to manifest your biggest dreams. And I can help you get there. Book your call here . ___ ⚠️ Disclaimer This episode discusses domestic violence, trauma, and suicidal ideation. Please listen with care and use discretion. If you’re in immediate danger, call 911. Take action today: Donate to Safe Harbor of Eastern Kentucky If you or someone you love is experiencing domestic violence, please reach out for help. National Domestic Violence Hotline: 1-800-799-SAFE (7233) or thehotline.org ____ This episode is one of the most powerful, honest, and riveting conversations we’ve had on Girls Who Recover. My guest, Ashana Kaiulani, takes us on an extraordinary journey—from surviving domestic violence and spiritual manipulation to reclaiming her identity, her power, and her peace. Together, we explore what it truly takes to rebuild your life after trauma and how to trust yourself again when every voice has tried to silence you. Ashana shares honestly that may take your breath away: How she broke free from a violent marriage and found the strength to leave a high-control spiritual community What re-parenting the inner child actually looks like Why self-trust, laughter, and spirituality became her medicine for healing How she turned her pain into purpose through advocacy for survivors of domestic violence If you’ve ever felt trapped in fear, self-doubt, or shame, let this episode be a permission slip to begin again. ____ Love Ashana as much as I do? Connect with her here: Substack \u0026#43; Podcast / Instagram / Website Ashana Kaiulani is a trauma support consultant, recovery coach, and the founder of Way Home Wellness. A former 9-1-1 operator and survivor of both foster care and domestic violence, Ashana now helps women heal after narcissistic abuse and betrayal trauma. Her work blends nervous system regulation, neuroscience, and grounded compassion, guiding women to reclaim their inner light and find peace after years of carrying too much. ___ Let’s connect! Book your free 1:1 Next Level Recovery Breakthrough Call Network \u0026#43; be inspired in the Girls Who Recover: A Community of Miracles DM me on Hey gorgeous. I love you. I\u0027m so proud of you. And I believe in your ability to create a life you absolutely love.",
      "release": "2025-10-28T10:00:00Z",
      "duration": "01:15:31.4870000",
      "explicit": false,
      "spotifyId": "3oXuIx5CA6pcTPrT5nGCpH",
      "appleId": 1000733852595,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3oXuIx5CA6pcTPrT5nGCpH",
        "apple": "https://podcasts.apple.com/podcast/episode-45-escaping-domestic-violence-leaving-a/id1788356772?i=1000733852595"
      }
    }
  ]
}