{
  "id": "382f0d01-b69a-4568-8a59-17858dc9c51f",
  "name": "Glad You Asked",
  "spotifyId": "5xuvPX3HvBjd7j0bxCTXbo",
  "appleId": 1637698268,
  "youTubeChannelId": "UC11L8UsI2E78HxsCK7Aw7tA",
  "episodes": [
    {
      "id": "d4085c7d-ead7-4110-8566-8cf62a677c11",
      "title": "Gareth Gore – What is Opus Dei?",
      "description": "Nearly a century ago, a Spanish priest named Josemaría Escrivá founded a religious movement intended to summon Christians of all races, ages, and social classes to renew the world, not by separating themselves from it, but by making their everyday lives holy. Today, the group Escriva founded, known as Opus Dei (“Work of God”) is a highly respected group with approximately 90,000 members, active in 70 countries. St. Pope John Paul II was an admirer of Escrivá and officially canonized him in 2002. Opus Dei members include priests and religious but also laypeople who work ordinary jobs, have families, and are involved in the life of their parishes. Many of these Opus Dei members are unaware that the organization has been accused of human trafficking and labor exploitation and is the subject of a criminal investigation in Argentina. According to the report that concluded the investigation, people holding different positions within Opus Dei recruited women and girls from low-income families in several South American countries, promised them job training, and placed them in grueling work situations without pay. Opus Dei has also been accused of financial crimes such as fraud and money laundering. Opus Dei leadership denies these allegations, claiming their critics have concocted false charges by taking details out of context. So how do we balance these allegations with the experience of thousands of ordinary Catholics and with Escrivá’s vision of an inclusive church? What exactly is Opus Dei and how does it relate to the rest of the church? On this episode of Glad You Asked, hosts Emily Sanna and Rebecca Bratten Weiss talk to journalist Gareth Gore about what Opus Dei is, how it functions, and the details of the allegations against the group. Gore is the author of Opus: The Cult of Dark Money, Human Trafficking, and Right-Wing Conspiracy inside the Catholic Church (Simon \u0026 Schuster). Based in London, Gore has reported from over 25 countries and covered some of the biggest financial stories in recent years. For more information about this topic, and to read about Gore’s book, check out these links. Opus: The Cult of Dark Money, Human Trafficking, and Right-Wing Conspiracy inside the Catholic Church, by Gareth Gore Opus | Book by Gareth Gore | Official Publisher Page | Simon \u0026 Schuster “Argentine prosecutors accuse Opus Dei leaders in South America of trafficking and labor exploitation,” by Debora Rey Argentine prosecutors accuse Opus Dei leaders in South America of trafficking and labor exploitation | AP News “Women in Argentina claim labor exploitation by Opus Dei,” by Debora Rey Women in Argentina claim labor exploitation by Opus Dei | AP News “How Opus Dei manipulated its way into power,” by John Farrell How Opus Dei manipulated its way into power - U.S. Catholic “In Argentina, Opus Dei \u0027categorically\u0027 denies allegations it\u0027s involved in human trafficking,” by Junno Arocho Esteves In Argentina, Opus Dei \u0027categorically\u0027 denies allegations it\u0027s involved in human trafficking | National Catholic Reporter “Peruvian Opus Dei cardinal denies allegations of sexual abuse of minor,” by Elise Ann Allen Peruvian Opus Dei cardinal denies allegations of sexual abuse of minor - Catholic Herald “Opus Dei Contests Charges of Malfeasance in Author’s New Book,” by Ken Oliver-Méndez Opus Dei Contests Charges of Malfeasance in Author’s New Book| National Catholic Register “Miracle attributed to Blessed Josemaria is approved” Miracle attributed to Blessed Josemaria is approved - Opus Dei “Split in Vatican on Opus Dei\u0027s miracle,” by Giles Tremlett Split in Vatican on Opus Dei\u0027s miracle | World news | The Guardian Glad You Asked is sponsored by the Claretian Missionaries.",
      "release": "2025-04-11T17:00:00Z",
      "duration": "00:42:03.9650000",
      "explicit": false,
      "spotifyId": "40TJNOUvSzlCM6nDqtXLdF",
      "appleId": 1000703184723,
      "youTubeId": "TiZJ2TwS7y8",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/40TJNOUvSzlCM6nDqtXLdF",
        "apple": "https://podcasts.apple.com/podcast/gareth-gore-what-is-opus-dei/id1637698268?i=1000703184723",
        "youtube": "https://www.youtube.com/watch?v=TiZJ2TwS7y8"
      }
    }
  ]
}