{
  "id": "00b9b8a8-b6e7-4ed8-892c-e768a8005d75",
  "name": "Global News",
  "youTubeChannelId": "UChLtXXpo4Ge1ReTEboVvTDg",
  "episodes": [
    {
      "id": "b001bfee-e9d1-42c0-b1f7-c0f2f4dc1532",
      "title": "Global National: Dec. 23, 2025 | What\u0027s in the new batch of Epstein files?",
      "description": "The U.S. Department of Justice has released tens of thousands more documents related to deceased convicted sex offender Jeffrey Epstein. Candice Cole reports on the emails that mention President Donald Trump, the former prince Andrew, and the alleged letter sent to convicted sex offender and disgraced sports doctor Larry Nassar – and how this new batch of files comes with a disclaimer from the DOJ.\n \nElections Alberta has approved a petition from Alberta Prosperity Project, a provincial separatist group, which will ask Albertans about holding a referendum on separating from Canada. Heather Yourex-West looks at why the petition got the green light despite being called unconstitutional by a judge and what needs to happen for the group\u0027s question to go to a referendum.\n \nIn Canada, it\u0027s tough to get an autism diagnosis quickly – and the process can take months or even years. Katherine Ward reports on the Ontario program looking to get more doctors and health professionals trained so people are not left waiting to see a specialist.\n \nPlus, a Japanese woman has \u0022married\u0022 an artificial intelligence character she created with ChatGPT. Neetu Garcha explains why the bride created the AI persona, why the marriage isn\u0027t legally recognized and how it\u0027s sparking debate about loneliness in the digital age.\n\nFor more info, please go to https://globalnews.ca/news/11588874/jeffrey-epstein-files-released-video-photos-trump-jet-dec-23/\n\nSubscribe to Global News Channel HERE: http://bit.ly/20fcXDc\nLike Global News on Facebook HERE: http://bit.ly/255GMJQ\nFollow Global News on X HERE: http://bit.ly/1Toz8mt\nFollow Global News on Instagram HERE: https://bit.ly/2QZaZIB\n#GlobalNews #GlobalNational #Epstein #Trump",
      "release": "2025-12-24T03:00:06Z",
      "duration": "00:22:17",
      "explicit": false,
      "youTubeId": "j8CUdoawazM",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j8CUdoawazM"
      }
    },
    {
      "id": "be51293f-c2af-4f95-a58e-ebb2aaa01c3f",
      "title": "Epstein files: Trump says “I don’t like the pictures being shown” of Bill Clinton, blames Democrats",
      "description": "U.S. President Donald Trump was asked Monday if he was surprised with the amount of photos that have been released that showed former president Bill Clinton with the late Jeffrey Epstein — a convicted sex offender.\n \n“I like Bill Clinton. I\u0027ve always gotten along with Bill Clinton. I\u0027ve been nice to him.  He\u0027s been nice to me.  We\u0027ve always gotten along.   I respect him.  I hate to see photos come out of him,” Trump said.\n \nThe president added “A lot of people are very angry that pictures are being released of other people that really had nothing to do with Epstein, but they\u0027re in a picture with him because he was at a party. And you ruin the reputation of somebody, so a lot of people are very angry that this continues.”\n \nTrump said the Democrats are using the Epstein files as a way to deflect from all the success of the Republican Party and that he thought all the documents had already been released.\n\nFor more info, please go to https://globalnews.ca\n\nSubscribe to Global News Channel HERE: http://bit.ly/20fcXDc\nLike Global News on Facebook HERE: http://bit.ly/255GMJQ\nFollow Global News on X HERE: http://bit.ly/1Toz8mt\nFollow Global News on Instagram HERE: https://bit.ly/2QZaZIB\n#GlobalNews",
      "release": "2025-12-23T01:00:21Z",
      "duration": "00:02:40",
      "explicit": false,
      "youTubeId": "R8AV1iIcuIs",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R8AV1iIcuIs"
      }
    },
    {
      "id": "788b9fc1-b58c-4bf6-80de-e6dcc00f65e7",
      "title": "Global National: Dec. 20, 2025 | Trump administration criticized over release of Epstein files",
      "description": "The U.S. Justice Department has released two more batches of files linked to convicted sex offender Jeffrey Epstein as part of a new transparency law.\n The documents add to the thousands of pages from past investigations released on Friday. Not all of the documents have been made public, which has reignited political tensions and could spark legal action in the days ahead. Candice Cole reports.\n\nThe U.S. conducted multiple airstrikes in Syria against the so-called Islamic State Friday. The attacks were in retaliation for an ambush that killed two U.S. troops and a civilian interpreter last week. As Nathaniel Dove reports, the operation has put a spotlight back on the notorious terror group.\n\nA group of commercial lobster harvesters in Nova Scotia is demanding the courts settle a fight over Indigenous fishing rights. Ever since one Mi\u0027kmaq First Nation launched its own lobster fishery five years ago, tensions between the band and commercial fishers have flared. Heidi Petracek reports.\n\nFor more info, please go to https://globalnews.ca/news/11586484/at-least-16-files-have-disappeared-from-the-doj-webpage-for-documents-related-to-jeffrey-epstein/\nSubscribe to Global News Channel HERE: http://bit.ly/20fcXDc\nLike Global News on Facebook HERE: http://bit.ly/255GMJQ\nFollow Global News on X HERE: http://bit.ly/1Toz8mt\nFollow Global News on Instagram HERE: https://bit.ly/2QZaZIB\n#GlobalNews",
      "release": "2025-12-21T03:00:06Z",
      "duration": "00:21:53",
      "explicit": false,
      "youTubeId": "EILba89jXo8",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EILba89jXo8"
      }
    },
    {
      "id": "6680550c-5a1c-4463-8cf4-fa811d2ca33e",
      "title": "“This is a war now\u0022: Giuffre family seeks accountability over redacted Epstein files",
      "description": "The family of Virginia Giuffre, a victim of convicted sex offender Jeffrey Epstein, said on Friday they were seeking accountability after the U.S. Justice Department released thousands of heavily redacted documents related to the late financier.\n \n“To be honest, in reviewing the documents that’ve been released, at least the first gauge and what we understand is that it’s about 10 per cent,” Giuffre’s brother Sky Roberts said. “I thought we asked for all the documents... so there\u0027s also this mixed feeling of what are we hiding here?”\n \nAmanda Roberts, Giuffre\u0027s sister-in-law, said survivors and their advocates plan to comb through every page and hold authorities accountable. “This is a war now,” she said. “We can hold them in contempt if they do decide to, you know, redact perpetrators, if they don\u0027t release the items that we know they need to release.”\n\nFor more info, please go to https://globalnews.ca\nSubscribe to Global News Channel HERE: http://bit.ly/20fcXDc\nLike Global News on Facebook HERE: http://bit.ly/255GMJQ\nFollow Global News on X HERE: http://bit.ly/1Toz8mt\nFollow Global News on Instagram HERE: https://bit.ly/2QZaZIB\n#GlobalNews #epsteinfiles",
      "release": "2025-12-20T21:10:32Z",
      "duration": "00:01:34",
      "explicit": false,
      "youTubeId": "kLz7llhsd5E",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kLz7llhsd5E"
      }
    },
    {
      "id": "976976b7-4d5b-4f8f-ad32-35f592b56829",
      "title": "Self-proclaimed “Queen of Canada” released from Saskatchewan RCMP custody",
      "description": "Romana Didulo, a conspiracy theorist who calls herself the \u0022Queen of Canada,\u0022 is back in Richmound, Sask., after she and several of her followers were arrested. \n\nNo charges were laid after police searched the buildings where the group has lived for the past two years. \n\nGlobal’s Heather Yourex-West explains what police and Didulo are saying about the arrests – and what Didulo is asking the RCMP to do.\n\nFor more info, please go to https://globalnews.ca/news/11391128/saskatchewan-rcmp-richmound-investigation/\n\nSubscribe to Global News Channel HERE: http://bit.ly/20fcXDc\nLike Global News on Facebook HERE: http://bit.ly/255GMJQ\nFollow Global News on X HERE: http://bit.ly/1Toz8mt\nFollow Global News on Instagram HERE: https://bit.ly/2QZaZIB\n#GlobalNews #QueenofCanada #RomanaDidulo",
      "release": "2025-09-05T02:30:14Z",
      "duration": "00:02:11",
      "explicit": false,
      "youTubeId": "ILJ2_Hh34j0",
      "subjects": [
        "Romana Didulo"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ILJ2_Hh34j0"
      }
    },
    {
      "id": "7578d03e-fa8c-44cc-9aff-cbd2ae610e54",
      "title": "\u0022Dances with Wolves\u0022 actor arrested, accused of running sex cult and abusing young girls",
      "description": "\u0022Dances with Wolves\u0022 actor Nathan Lee Chasing His Horse, who also goes by Nathan Chasing Horse, was arrested on Tuesday and charged on suspicion of running a cult and sexually assaulting a multitude of young Indigenous girls over the last two decades. \n\nThe charges came following a months-long investigation, culminating in authorities conducting a raid on the Las Vegas home of Chasing Horse and his five wives, according to the Associated Press. Chasing Horse is also accused of recording sexual assaults and arranging sex with the victims for other men who paid him. \n\nAs Craig Momney reports, the investigation has involved other police forces including the Tsuut\u0027ina Nation Police and Calgary Police and it\u0027s believed there could be victims in both the U.S. and Canada. \n\nFor more info, please go to https://globalnews.ca/news/9452010/dances-with-wolves-actor-nathan-lee-chasing-his-horse-arrested-sex-cult-abuse/\nSubscribe to Global News Channel HERE: http://bit.ly/20fcXDc\nLike Global News on Facebook HERE: http://bit.ly/255GMJQ\nFollow Global News on Twitter HERE: http://bit.ly/1Toz8mt\nFollow Global News on Instagram HERE: https://bit.ly/2QZaZIB\n#GlobalNews",
      "release": "2023-02-02T20:50:00Z",
      "duration": "00:01:30",
      "explicit": false,
      "youTubeId": "-NgDXWsg_6Q",
      "subjects": [
        "Nathan Lee Chasing His Horse"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-NgDXWsg_6Q"
      }
    }
  ]
}