{
  "id": "e3197272-c54a-4ac9-a51a-fe620d893066",
  "name": "Goatlike Personality",
  "youTubeChannelId": "UCP0Skh44p2zLjnVeB6rcTkQ",
  "episodes": [
    {
      "id": "690b7c48-5a7d-451e-98e9-c5eb661dc920",
      "title": "Jehovah Witness cult block peacefull protestors",
      "description": "Jehovah Witnesses are having a convention at Eden Park and Jonas Skogstroll are leading a protest for children’s rights.\n\nCult will always try to limit their members access to information 😎. It’s always good when they show their dark side.\n\nToday we was contacted by a young man that wanted to leave.\n\nI received a message from him later that said:\n\n“I told my mother I don’t believe anymore. I guess I am POMO now» 😆😆😆😆",
      "release": "2026-01-10T08:31:21Z",
      "duration": "00:04:19",
      "explicit": false,
      "youTubeId": "Ch17GorBhFU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ch17GorBhFU"
      }
    },
    {
      "id": "07811a56-7b6f-4064-b640-bacf86b32e08",
      "title": "Anti Cult Protest - London",
      "description": "A friendly group of ex Jehovah Witnesses invite al excult members to support our protest for the rights of children.\n\nMany religious organisations violate the rights of the children. And many politicians dont understand that freedom or religion also include the right of children to abandon their parents religion without being bullied, shunned or cohersed.\n\nThe camplain #allreligionsmust focus on the fact that all religions must respect human rights and this have already been legislated in Norway.\n\nSince Jehovah Witnesses violates the rights of children, JW do no longer have the status as a religion. They still have the right to belive whatever they want, but they no longer get a taxbreak.  \n\nWhen government give taxbreak to a religion, they are funding the organisation.  Norway finaly realised that they can not finance violations of human rights.  Now we want to make the UK government aware of the same problem.\n\nMember of Parlament, Sam Carling, grew up as a Jehovah\u0027s Witness and have been invited to the protest.  \n\nSupport my activism on Patreon:\nhttps://www.patreon.com/user?u=21842830\nOr use my paypal acount:\njonasiwona@hotmail.com\nTwitter:  https://twitter.com/JonasSkogstroll\nFollow me on facebook:\nhttps://www.facebook.com/goatlikepersonality/\nInstagram:\nhttps://www.instagram.com/goatlike_personality/\nMy farms homepage:\nwww.slettvollgard.no",
      "release": "2025-07-16T18:45:06Z",
      "duration": "00:05:56",
      "explicit": false,
      "youTubeId": "qMHmK59LqBc",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qMHmK59LqBc"
      }
    }
  ]
}