{
  "id": "3b5b6a0b-68e9-48f2-9115-593ef7f3b0f6",
  "name": "God Forbid",
  "appleId": 1203570353,
  "episodes": [
    {
      "id": "fd7f2102-a187-4a06-a4d4-2239ad00d1df",
      "title": "Coercion, control and worship: Where do we draw the line between a religion and a cult?",
      "description": "Is a cult a misunderstood religion? Or something much more dangerous?\nThe line between high-control religions, new religious movements, and \u0027cults\u0027 is as grey as ever. But the fascination we have with these groups is only getting stronger. What counts as a \u0027cult\u0027? Is it your highly controlling tech workplace? Your gym with a forever-binding contract? Or does the casual use of the word \u0027cult\u0027 do a disservice to those stuck in dangerous and emotionally manipulative religious and spiritual organisations?\nTo shed some light on the difference between a new religious movement, a cult, and your regular high-control Pentecostal mega-church are the God Forbid guests who have lived, studied, or spoken to survivors of these groups. \nGUESTS: \nProfessor Carole Cusack, Professor of Religious Studies at the University of Sydney, specialising in new religious movements (NRMs) contemporary religious trends and Western esotericism.Sarah Steel, host and creator of award-winning podcast, Let\u0027s Talk About SectsScott Parker, writer and star of stage production, Hillsong BoyThis episode of God Forbid was made on Gadigal land and first broadcast in May 2025. \nTechnical production by Craig Tilmouth and Tegan Nicholls.\nMore Information\nIf you or someone close to you has been affected by an extreme or controlling group, you can make a submission or anonymous report to the Victorian Parliamentary Inquiry here: Inquiry into the recruitment methods and impacts of cults and organised fringe groups. \nIf you need support or help you can call Lifeline 13 11 14",
      "release": "2026-01-09T17:00:00Z",
      "duration": "00:54:07",
      "explicit": false,
      "appleId": 1000744469043,
      "subjects": [
        "Evangelicalism",
        "Hillsong",
        "Legislation",
        "Cult Psychology",
        "Cult Apologists"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/coercion-control-and-worship-where-do-we-draw-the/id1203570353?i=1000744469043"
      }
    },
    {
      "id": "765a133a-00ad-405d-9a11-33493ef9b284",
      "title": "Coercion, control and worship: Where do we draw the line between a religion and a cult?",
      "description": "Is a cult a misunderstood religion? Or something much more dangerous?\nThe line between high-control religions, new religious movements, and \u0027cults\u0027 is as grey as ever. But the fascination we have with these groups is only getting stronger. What counts as a \u0027cult\u0027? Is it your highly controlling tech workplace? Your gym with a forever-binding contract? Or does the casual use of the word \u0027cult\u0027 do a disservice to those stuck in dangerous and emotionally manipulative religious and spiritual organisations?\nTo shed some light on the difference between a new religious movement, a cult, and your regular high-control Pentecostal mega-church are the God Forbid guests who have lived, studied, or spoken to survivors of these groups. \nGUESTS: \nProfessor Carole Cusack, Professor of Religious Studies at the University of Sydney, specialising in new religious movements (NRMs) contemporary religious trends and Western esotericismSarah Steel, host and creator of award-winning podcast, Let\u0027s Talk About SectsScott Parker, writer and star of stage production, Hillsong BoyThis episode of God Forbid was made on Gadigal land. \nTechnical production by Craig Tilmouth and Tegan Nicholls.",
      "release": "2025-05-23T06:00:00Z",
      "duration": "00:54:06",
      "explicit": false,
      "appleId": 1000709550912,
      "subjects": [
        "Cult Psychology",
        "Cult Apologists",
        "Hillsong"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/coercion-control-and-worship-where-do-we-draw-the/id1203570353?i=1000709550912"
      }
    }
  ]
}