{
  "id": "87a5fbfe-14a6-424f-9526-0f997c0a9be1",
  "name": "GoldenAgeFiles",
  "youTubeChannelId": "UC1blRyZ2xo0A3xViE73WGFw",
  "episodes": [
    {
      "id": "b209e6f2-c311-46b6-bd44-d88f44b45797",
      "title": "10 Golden Age Actors Raised in the \u0022Christian Science\u0022 Cult",
      "release": "2026-01-20T18:04:21Z",
      "duration": "00:35:05",
      "explicit": false,
      "youTubeId": "LQ5tbf-q9uk",
      "subjects": [
        "Christian Science"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LQ5tbf-q9uk"
      }
    },
    {
      "id": "19e3e958-365d-4847-a9e3-00dc10d68b89",
      "title": "12 Stars Who Escaped the \u0022Moral Re-Armament\u0022 Cult",
      "release": "2026-01-16T20:00:06Z",
      "duration": "00:42:08",
      "explicit": false,
      "youTubeId": "uEeOkC3F5lI",
      "subjects": [
        "Moral Re-Armament"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uEeOkC3F5lI"
      }
    },
    {
      "id": "7b7947d8-2dd1-4e4e-8090-edc72cddca46",
      "title": "7 Hollywood Families Destroyed by the \u0022Children of God\u0022 Cult",
      "description": "River Phoenix didn\u0027t die from Hollywood excess—he died from childhood trauma inflicted by the Children of God cult between ages 4 and 7. This documentary reveals how seven Hollywood families, including the Phoenixes, Rose McGowan, and others, survived one of the most disturbing religious organizations in modern history, where thousands of children suffered systematic abuse disguised as divine love.\n\nOctober 31, 1993: Joaquin Phoenix screamed into a 911 call as his brother River convulsed outside the Viper Room. The world blamed fame and drugs, but the real story began two decades earlier when the Bottom family joined David Berg\u0027s cult in South America. This video exposes the hidden connection between Hollywood\u0027s brightest stars and a religious organization that victimized over 4,000 children across multiple continents. From Rose McGowan\u0027s fearless MeToo activism to Joaquin Phoenix\u0027s haunting performances, you\u0027ll discover how childhood cult trauma shaped an entire generation of actors—and why some survivors, like Berg\u0027s own son Ricky Rodriguez, couldn\u0027t escape their past. We reveal survivor testimonies, the \u0022Victor Camps\u0022 where rebellious teens were psychologically tortured, and the famous face who\u0027s never been publicly named as a cult survivor until now.",
      "release": "2026-01-08T16:56:32Z",
      "duration": "00:54:54",
      "explicit": false,
      "youTubeId": "beJ-YujLFFA",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=beJ-YujLFFA"
      }
    }
  ]
}