{
  "id": "acbfc63d-6bbe-48b4-b582-96a5a5b4cd0c",
  "name": "Golden Age History",
  "youTubeChannelId": "UCEuUjr-r-aCbwZ4TiAyBmRA",
  "episodes": [
    {
      "id": "2567e4ab-0ff2-4bf1-a529-763b0255f6c1",
      "title": "19 Graves of Forgotten Cult Leaders - Where Are They Buried?",
      "description": "19 Graves of Forgotten Cult Leaders   Where Are They Buried\n---------------------------------------------------------------------------------------------------\n\nSupport our channel! It\u0027s free! ❤\n👍 Like the video\n✅ Subscribe\n\n---------------------------------------------------------------------------------------------------\n\nFair Use Disclaimer\nThis video may contain copyrighted material, the use of which has not always been specifically authorized by the copyright owner. Such material is made available for the purposes of criticism, comment, news reporting, teaching, scholarship, or research, and is used in a way that is transformative and adds new meaning, message, or expression to the original.\n\nWe believe this constitutes a “fair use” of any such copyrighted material as provided for in Section 107 of the U.S. Copyright Act. Fair use is a legal doctrine that permits limited use of copyrighted material without requiring permission from the rights holders, provided that the use is non-commercial, educational, or otherwise transformative in nature.\n\nAll rights and ownership remain with their respective copyright holders. If you are the copyright owner and believe your material has been used inappropriately, please contact us. No copyright infringement is intended.",
      "release": "2025-10-02T17:54:13Z",
      "duration": "00:29:17",
      "explicit": false,
      "youTubeId": "SMSIdV58T-g",
      "subjects": [
        "Scientology",
        "Manson Family",
        "Bhagwan Shree Rajneesh",
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SMSIdV58T-g"
      }
    }
  ]
}