{
  "_ts": 0,
  "id": "7ca8ae27-ed3d-49b6-8309-a2565525a290",
  "name": "Google Play Books",
  "youTubeChannelId": "UChDyzr6fXuIIQAELYjVqh7Q",
  "episodes": [
    {
      "id": "ce5bd24f-e4fd-4ddd-88bc-a16b90ee32d9",
      "title": "Surviving Modern Yoga: Cult Dynamics,… by Matthew Remski · Audiobook preview",
      "description": "Surviving Modern Yoga: Cult Dynamics, Charismatic Leaders, and What Survivors Can Teach Us\nAuthored by Matthew Remski\nNarrated by Matthew Remski, Theo Wildcroft, PHD\n\n0:00 Intro\n0:03 Surviving Modern Yoga: Cult Dynamics, Charismatic Leaders, and What Survivors Can Teach Us\n0:22 Dedication\n3:18 Content Notice\n4:28 Foreword\n8:12 Preface to the Second Edition\n10:03 Outro\n\n#matthewremski #survivingmodernyogacultdynamicscharismaticleadersandwhatsurvivorscanteachus\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nGrounded in investigative research and real survivor stories, Surviving Modern Yoga uncovers the physical and sexual abuse perpetrated by Ashtanga yoga leader Pattabhi Jois—and reckons with the culture, structures, and mythos that enabled it.\n\nYoga culture sells well-meaning westerners the full package: physical health, good vibes, and spiritual growth. Here, investigative journalist Matthew Remski explores how cultic dynamics, institutional self-interest, and spiritualized indifference collude to obscure the truth: Harm happens in plain sight.\n\nThrough in-depth interviews, insider analysis, and Remski’s own history with high-demand groups, Surviving Modern Yoga brings to light how we’re each susceptible to cult abuse and exploitation. He shows how, with the right kind of situational vulnerability and the wrong kind of guru, the ideas we hold close about ourselves—like It wouldn’t happen to me or I’d speak up for victims—fail to protect us.\n\nRemski reckons with his own complicity in spiritual power dynamics, and shares how a process of disillusionment allowed him to recognize harm. He does the same for readers, peeling back the veneer of yoga marketing to reveal the abuse, assault, and silencing perpetrated against seekers who trusted Jois as a mentor, their guruji—even a father figure. Each survivor speaks in their own words, on their own terms, reclaiming agency against an insular, in-group culture that enabled a charismatic leader’s devastating harm—and positioned him as its only remedy.\n\nSurviving Modern Yoga also includes practical tools to help readers:\n   Understand how high-demand groups trap would-be targets  Evaluate their own situational vulnerabilities  Learn to listen for loaded, red-flag language  Cultivate their literacy of cult tactics\n\n—\nABOUT THE AUTHOR\n\nMatthew Remski is an author and freelance journalist, with bylines in The Walrus and GEN by Medium. Remski is a yoga practitioner who writes about yoga, abuse, and cults. His work is informed by his experiences as a member of multiple cults.  He’s published eight books of poetry, fiction, and non-fiction, including Threads of Yoga: a remix of Patanjali’s Sutras with commentary and reverie. Remski co-host a podcast called Conspirtuality. His forthcoming book Consprituality, co-authored with his podcast co-host Derek Beres and Julian Walker, will be released in 2024. This is a re-edition of Remski most recent book, Practice and All is Coming: Abuse, Cult Dynamics, and Healing in Yoga and Beyond which has earned international praise as a groundbreaking resource for critical thinking and community health. He lives in Toronto with his partner and their two sons.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEDiBxlH6M\nLanguage: English\nPublisher: Penguin Random House Audio\nPublished on: May 14, 2024\nISBN: 9798889841050\nDuration: 16 hr, 21 min\nGenres: Health \u0026 Fitness / Yoga, Religion / Cults, Social Science / Sexual Abuse \u0026 Harassment",
      "release": "2024-09-25T06:59:03Z",
      "duration": "00:10:24",
      "explicit": false,
      "youTubeId": "BcnEraZUERw",
      "subjects": [
        "Yoga Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BcnEraZUERw"
      }
    },
    {
      "id": "08176019-e2ff-4b5f-9177-a12df01e3132",
      "title": "Combating Cult Mind Control: The #1… by Steven Hassan · Audiobook preview",
      "description": "Combating Cult Mind Control: The #1 Best-selling Guide to Protection, Rescue, and Recovery from Destructive Cults\nAuthored by Steven Hassan\nNarrated by Daniel Greenberg\n\n0:00 Intro\n0:03 Combating Cult Mind Control: The #1 Best-selling Guide to Protection, Rescue, and Recovery from Destructive Cults\n0:20 Introduction to the 2018 Edition\n32:27 Foreword to the 1988 Edition\n39:22 Preface to the First Paperback Edition\n46:08 Chapter 1–My Work as a Cult Expert\n1:21:41 Outro\n\n#stevenhassan\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nThis 2018 30th anniversary edition honors the 40th anniversary of the tragedy in Jonestown, Guyana. On November 18th, 1978, over 900 people including a U.S. congressman Leo Ryan died because of Cult Leader Jim Jones. Over 300 were children forced to drink cyanide-laced Kool-Aid by their parents who believed they were doing God’s will. A vast array of methods exist to deceive, manipulate, and indoctrinate people into closed systems of obedience and dependency. If you are reading this updated book for the first time, please know that you have found a safe, respectful, compassionate place. This book can help you protect or regain your sanity, freedom, and health. It can help you protect others from the use of mind control techniques. In this 30th anniversary volume you will find:  Stories of people who fell under the sway of undue influence but who were able to break free.  Information on the many sophisticated ways that social media are now used for mind control.  Updates on the many types of organizations that use mind control.  Information on the neuroscience behind mind control.  A look at what legislators, courts, mental health professionals, and ordinary citizens can do to resist mind control and make our world a safer place.  \n\nPeople around the world remain largely unprepared for the realities of mind control. But there is much you can do to stay safe, sane, and whole - and to help the people you care about. If someone you love is already part of a mind control group, help them break free and rebuild their life using the tools from this book. As you read this book, you will learn to develop, use, and trust your critical thinking skills; your intuition; your bodily and emotional awareness; your ability to ask the right questions; and your skill at doing quick, useful research. You will also learn to create a healthy balance of openness and skepticism. The entire process begins and ends with discernment.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEB8FE1UIM\nLanguage: English\nPublisher: Freedom of Mind Press\nPublished on: March 28, 2015\nISBN: 9781667099507\nDuration: 13 hr, 36 min\nGenres: Psychology / Mental Health, Psychology / Social Psychology",
      "release": "2024-09-24T15:05:14Z",
      "duration": "01:22:03",
      "explicit": false,
      "youTubeId": "qT2jyM3goLs",
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qT2jyM3goLs"
      }
    },
    {
      "id": "8daf83a9-7dab-4f5d-adaf-c701a170e261",
      "title": "Diet Cults: The Surprising Fallacy at the Core… by Matt Fitzgerald · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAABMMFMwDM\n\nDiet Cults: The Surprising Fallacy at the Core of Nutrition Fads and a Guide to Healthy Eating for the Rest of Us\nAuthored by Matt Fitzgerald\nNarrated by Stephen R. Thorne\n\n#mattfitzgerald\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nFrom the national bestselling author of Racing Weight, Matt Fitzgerald exposes the irrationality, half-truths, and downright impossibility of a \u0022single right way\u0022 to eat and reveals how to develop rational, healthy eating habits.\n\nFrom \u0022the Four-Hour Body\u0022 to \u0022Atkins,\u0022 there are diet cults to match seemingly any mood and personality type. Everywhere we turn, someone is preaching the \u0022one true way\u0022 to eat for maximum health. Paleo Diet advocates tell us that all foods less than twelve thousand years old are the enemy. Low-carb gurus demonize carbs, and then there are the low-fat prophets. But they agree on one thing: there is only one true way to eat for maximum health. The first clue that this is a fallacy is the sheer variety of diets advocated. Indeed, while all of these competing views claim to be backed by science, a good look at actual nutritional science suggests it is impossible to identify a single best way to eat. Fitzgerald advocates an agnostic, rational approach to eating habits based on one\u0027s own habits, lifestyle, and genetics and body type. Many professional athletes already practice this \u0022Good Enough\u0022 diet, and now we can too—and ditch the brainwashing of these diet cults for good.\n\n—\nABOUT THE AUTHOR\n\nMatt Fitzgerald is an endurance sports writer, nutritionist, and author of more than twenty books. He is a coach and spokesperson for PEAR Sports and former senior editor at Triathlete and Competitor. Fitzgerald has contributed to Men\u0027s Health, Outside, Runner\u0027s World, Shape, and other publications. He lives in Northern California with his wife, Nataki.\n\n\nStephen R. Thorne is a professional actor and a member of the Trinity Repertory Company in Providence, Rhode Island. He has played Hamlet, Henry V, and Tom Joad, among many other roles. Stephen has narrated over fifty audiobooks.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAABMMFMwDM\nLanguage: English\nPublisher: Blackstone Audio Inc.\nPublished on: May 15, 2014\nISBN: 9781482993356\nDuration: 9 hr, 24 min\nGenres: Health \u0026 Fitness / Diet \u0026 Nutrition / Diets, Health \u0026 Fitness / Diet \u0026 Nutrition / Nutrition, Health \u0026 Fitness / Diet \u0026 Nutrition / Weight Loss",
      "release": "2024-02-27T16:18:22Z",
      "duration": "00:05:24",
      "explicit": false,
      "youTubeId": "wsILX0-bKH0",
      "subjects": [
        "Cult Psychology",
        "Providence"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wsILX0-bKH0"
      }
    },
    {
      "id": "aebb52f0-c78d-4d08-9426-aaa239ecdf6d",
      "title": "Escaping Utopia: Growing Up in a Cult, Getting… by Janja Lalich · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAED8liDWzM\n\nEscaping Utopia: Growing Up in a Cult, Getting Out, and Starting Over\nAuthored by Janja Lalich, Karla McLaren\nNarrated by Kelly Burke\n\n#janjalalich #escapingutopiagrowingupinacultgettingoutandstartingover\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nWe think of cults as bizarre, inexplicable, or otherworldly places that only strange people inhabit, but cults and other abusive and high-demand groups (and relationships) are actually quite commonplace. In fact, the behaviors, social pressures, and authoritarian structures that create cults exist to a greater or lesser extent in every human relationship and every human group. In the first in-depth research of its kind, the author interviewed sixty-five people who were born in or grew up in thirty-nine different cultic groups spanning more than a dozen countries. What’s especially interesting about these individuals is that they each left the cult on their own, without outside help or internal support. In Escaping Utopia: Growing Up in a Cult, Getting Out, and Starting Over, the authors craft Lalich’s original and groundbreaking research into an accessible and engaging book, the first of its kind focusing on this particular population.\n\n—\nABOUT THE AUTHOR\n\nJanja Lalich is a researcher, author, and educator specializing in self-sealing systems (cults, terrorist groups, situations of undue influence, and ideological extremism), with a particular focus on recruitment, indoctrination, and methods of influence and control. She is Professor Emerita of Sociology at California State University, Chico and has been studying the social psychology of controversial groups and exploitative and abusive relationships for thirty years.Her publications include Take Back Your Life: Recovering from Cults and Abusive Relationships (Bay Tree Press 2006) and Bounded Choice: True Believers and Charismatic Cults (University of California Press 2004).\n\nKarla McLaren is an award-winning author and social science researcher who grew up in a New Age healing cult in the San Francisco Bay Area. Her recent publications include The Art of Empathy: A Complete Guide to Life’s Most Essential Skill (Sounds True 2013) and The Language of Emotions: What Your Feelings Are…\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAED8liDWzM\nLanguage: English\nPublisher: Routledge\nPublished on: December 5, 2019\nISBN: 9780367405762\nDuration: 7 hr, 20 min\nGenres: Business \u0026 Economics / Organizational Behavior, Political Science / General, Psychology / Movements / General, Psychology / Social Psychology, Social Science / Criminology, Social Science / Social Classes \u0026 Economic Disparity, Social Science / Social Work, Social Science / Sociology / General",
      "release": "2024-02-23T13:00:26Z",
      "duration": "00:46:10",
      "explicit": false,
      "youTubeId": "NKEaDaQ-WNs",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NKEaDaQ-WNs"
      }
    },
    {
      "id": "47722ba0-1720-4f15-846f-a70fcff97f85",
      "title": "Cults Uncovered: True Stories of Mind Control… by Emily G. Thompson · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEDssR7x4M\n\nCults Uncovered: True Stories of Mind Control and Murder\nAuthored by Emily G. Thompson\nNarrated by Avena Mansergh-Wallace\n\n#emilygthompson #cultsuncoveredtruestoriesofmindcontrolandmurder\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nUncover the secrets of the world\u0027s cruellest criminal cults.\n\nHow did Charles Manson inspire his \u0022family\u0022 to launch a campaign of murder? What twisted ideology lay behind horrific events like the Waco Siege, Aum Shinrikyo\u0027s poison-gas attack on the Tokyo metro, and the mass suicides and murders of Jonestown? Why did the suicidal adherents of Heaven\u0027s Gate believe doomsday was at hand? How did the idealistic commune of Rajneeshpuram collapse into shocking controversies, involving biological terrorism and attempted murder? The shocking truth about some of the most disturbing criminal cults that have ever existed are discussed in this audiobook.\n\nCults Uncovered explores these and many more strange and disturbing factions and sects from all over the world to expose terrifying stories of manipulation, coercion, abuse, and murder.\n\nEmily G. Thompson has several years experience as an investigative reporter. She has her own popular true crime website, Morbidology, and has contributed articles to numerous blogs and websites. She is the author of Unsolved Child Murders: Eighteen American Cases, 1956-1998 and the co-author of DK\u0027s Unsolved Murders:True Crime Cases Uncovered.\n\n© 2020 Emily G. Thompson © 2020 DK Audio\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEDssR7x4M\nLanguage: English\nPublisher: Dorling Kindersley Ltd\nPublished on: March 5, 2020\nISBN: 9780241459959\nDuration: 6 hr, 38 min\nGenres: Religion / Cults",
      "release": "2024-02-22T01:56:48Z",
      "duration": "00:40:11",
      "explicit": false,
      "youTubeId": "aRBicq0XxcA",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aRBicq0XxcA"
      }
    },
    {
      "id": "0bc8dd9f-1e15-4857-8ad1-47891e874f26",
      "title": "Do As I Say: How cults control, why we join… by Sarah Steel · Audiobook preview",
      "description": "Do As I Say: How cults control, why we join them, and what they teach us about bullying, abuse and coercion\nAuthored by Sarah Steel\nNarrated by Sarah Steel\n\n#sarahsteel\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nAt the heart of being human is the desire to belong. It can make us unspeakably vulnerable to the manipulations of others. Cult leaders prey on this desire, but so do many unscrupulous operators hiding in plain sight.\n\nSarah Steel, the creator of the popular \u0027Let\u0027s Talk About Sects\u0027 podcast, has researched the cults you\u0027ve heard of - and dozens you haven\u0027t. What strikes her most are not the differences between bizarre cult behaviour and \u0027normal\u0027 behaviour but the depressing similarities. Her work reveals that we are all susceptible to the power of cult dynamics.\n\nIn Do As I Say, Sarah Steel tells the human tale behind the sensationalism. Sharing deeply personal stories, gathered over years of interviews with survivors, and some shocking tales about the world\u0027s most famous cults, she sheds light on the high cost of unchecked coercive behaviours to individuals and communities at large.\n\n\nPraise for Do As I Say\n\n\u0027Sarah uses the stories of survivors to tease out the common threads of coercive control shared by cults and found in other parts of society. The result is a much-needed spotlight on the behaviours and personalities we are likely to encounter even if we never go anywhere near a cult.\u0027 - David Gillespie, bestselling author and lawyer\n\n\u0027In times of uncertainty when you long for simple answers and have a deep desire for community, you can find yourself incrementally handing over your agency to a charismatic but authoritarian and manipulative leader or group-think. In this book Sarah Steel has brilliantly charted how this happens in all sorts of ways and for all sorts of people; it provides an invaluable map to navigate this dangerous terrain.\u0027 - Reverend Tim Costello AO\n\n\u0027This book is a most comprehensive and studied look at cults, the leaders, and perhaps most importantly the survivors. Sarah Steel has given the world a real gem - one that will not only educate but also help to destigmatize those who have been harmed by cults and con artists. Bravo!\u0027 - Dr Janja Lalich, cult expert, academic and former cult member\n\n—\nABOUT THE AUTHOR\n\nSarah researches, writes, records and edits \u0027Let\u0027s Talk About Sects\u0027. Her writing has been published in The Guardian, Indiewire and ABC Online, and she has appeared on SBS\u0027s The Feed and Channel 9\u0027s Today Show. Her work has been commissioned for ABC Radio National\u0027s Earshot program, and she has also featured on ABC Radio\u0027s Overnights program. For Vivid Sydney 2022 Sarah presented the sold out panel discussion \u0027Sects, Lies and Cults\u0027 with three former cult members.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEACiBzIDM\nLanguage: English\nPublisher: Macmillan Publishers Australia\nPublished on: June 28, 2022\nISBN: 9781761263187\nDuration: 9 hr, 7 min\nGenres: Family \u0026 Relationships / General, Psychology / Emotions, Psychology / General, Psychology / Psychopathology / General, Self-Help / General, Self-Help / Personal Growth / General",
      "release": "2024-02-20T05:32:16Z",
      "duration": "00:55:32",
      "explicit": false,
      "youTubeId": "TlmwN4Za-xc",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TlmwN4Za-xc"
      }
    },
    {
      "id": "ddd04a6c-59c2-4baf-abc9-6da0c0ac5be7",
      "title": "Rebel: The extraordinary story of a childhood… by Faith Morgan · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEDcYUQhiM\n\nRebel: The extraordinary story of a childhood in the \u0027Children of God\u0027 cult\nAuthored by Faith Morgan\nNarrated by Amelia Sciandra\n\n#faithmorgan #rebeltheextraordinarystoryofachildhoodinthechildrenofgodcult\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nThe extraordinary memoir of a childhood spent in the \u0027Children of God\u0027 cult.\n\nRebel tells the story of Faith, a woman who grew up in the Children of God cult (known latterly as The Family). Now in her forties with two teenage children of her own, Faith\u0027s first-person narrative alternates between her childhood adventures and traumas within the cult and her post-cult life following her escape at the age of 19. \n\nFaith travelled the world as a child with the Children of God - to Argentina, Mexico, Spain, India and Greece. Her story features a supporting cast of multiple siblings, eccentric parents and countless transient friends, spiritual leaders, and abusers. And the story of her life in the cult concludes in London, where she is isolated from her family and used as a domestic slave. Faith shares her post-escape experiences of re-entering education for the first time since she was ten, her self-directed deprogramming, and her quest for justice through campaigning and confrontation.\n\nIt\u0027s easy to think of cults as yesterday\u0027s news, and as organisations that operate in other countries, but some of Faith\u0027s most horrible experiences in the cult happened to her in North London. In Rebel, Faith writes about how we need to look and to see what is hiding in plain sight. But more than this, we all need to be wiser to our own vulnerability as adults, our credulity and susceptibility to misinformation and our readiness to take the bait, when it looks like the answer.\n\n(P) 2021 Hodder \u0026 Stoughton Ltd\n\n—\nABOUT THE AUTHOR\n\nFaith Morgan was born in 1973 to a Costa Rican father and English mother. The third child of seven, she was the first of her siblings to be born into the cult The Children of God, later known as The Family of Love. During her time in the cult she lived in communes and travelled extensively as directed by the cult leaders with the purpose of spreading the word. In early 1991, aged 19, she found the courage to escape and now lives in the Home Counties with her family. Faith Morgan is a pseudonym.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEDcYUQhiM\nLanguage: English\nPublisher: Hodder \u0026 Stoughton\nPublished on: June 17, 2021\nISBN: 9781529347623\nDuration: 7 hr, 55 min\nGenres: Biography \u0026 Autobiography / Personal Memoirs, Biography \u0026 Autobiography / Religious, Religion / Cults",
      "release": "2024-02-19T08:11:12Z",
      "duration": "00:47:56",
      "explicit": false,
      "youTubeId": "ZYEJw4vsdss",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZYEJw4vsdss"
      }
    },
    {
      "id": "c187df0e-8560-4d6f-8620-18271b2e2e31",
      "title": "Sins of My Father: A Daughter, a Cult, a Wild… by Lily Dunn · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEB8Rw0HYM\n\nSins of My Father: A Daughter, a Cult, a Wild Unravelling\nAuthored by Lily Dunn\nNarrated by Lily Dunn\n\n#lilydunn #sinsofmyfatheradaughteracultawildunravelling\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\n\u0027An extraordinary story\u0027 CLOVER STROUD\n\u0027Astonishing and valuable\u0027 THE SPECTATOR\n\u0027Beautifully written\u0027 DAILY MAIL\n\u0027Intensely gripping . . . as brutal and funny as it is raw and candid\u0027 VIV GROSKOP\n\u0027As vivid an account of addiction as I can remember reading\u0027 GUARDIAN\n\u0027Will resonate with anyone who has loved a difficult parent and spent a lifetime trying to work them out\u0027 ALI MILLAR\n\nWhen Lily Dunn was six years old, her father left for India to join the cult of Bhagwan Shree Rajneesh. She grew up enthralled by the myth of him - a brilliant, charismatic writer and entrepreneur who would appear with gifts from faraway places. Yet he was also a compulsive liar whose pursuit of transcendence took him from sex addiction, via the Rajneesh cult, to a relentless chase of money, which ended in ruin and finally addiction to alcohol and prescription drugs. A daughter\u0027s investigation into a father who was always out of reach, Sins of My Father is a gripping detective story that asks how much we can forgive of those we love.\n\n—\nABOUT THE AUTHOR\n\nLily Dunn is a writer, teacher and lecturer in creative writing and narrative nonfiction at Bath Spa University. She is the author of one novel, SHADOWING THE SUN, and co-editor with Zoe Gilbert of A WILD AND PRECIOUS LIFE, an anthology of recovery stories.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEB8Rw0HYM\nLanguage: English\nPublisher: Weidenfeld \u0026 Nicolson\nPublished on: March 17, 2022\nISBN: 9781474623391\nDuration: 8 hr, 58 min\nGenres: Biography \u0026 Autobiography / Personal Memoirs, Family \u0026 Relationships / Dysfunctional Families, Family \u0026 Relationships / General, Psychology / Psychopathology / Addiction, Religion / Cults",
      "release": "2024-02-19T07:42:50Z",
      "duration": "00:54:29",
      "explicit": false,
      "youTubeId": "ve1uTg5VdTI",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ve1uTg5VdTI"
      }
    },
    {
      "id": "bf9f7425-26c9-445b-81c0-406598e54a03",
      "title": "Leaving Isn\u0027t the Hardest Thing: The New York… by Lauren Hough · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEDcSkYKiM\n\nLeaving Isn\u0027t the Hardest Thing: The New York Times bestseller\nAuthored by Lauren Hough\nNarrated by Lauren Hough, Cate Blanchett\n\n#laurenhough #leavingisntthehardestthingthenewyorktimesbestseller\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nSearing and extremely personal essays from the heart of working-class America, shot through with the darkest elements the country can manifest - cults, homelessness, and hunger - while discovering light and humor in unexpected corners.\n\n\u0027Hough\u0027s writing will break your heart\u0027 - Roxane Gay, author of Difficult Women\n\n\u0027An edgy and unapologetic memoir in essays\u0027 - Kirkus Reviews\n\n\u0027This moving account of resilience and hard-earned agency brims with a fresh originality\u0027 - Publishers Weekly\n\nSearing and extremely personal essays from the heart of working-class America, shot through with the darkest elements the country can manifest - cults, homelessness, and hunger - while discovering light and humor in unexpected corners.\n\nAs an adult, Lauren Hough has had many identities: an airman in the U.S. Air Force, a cable guy, a bouncer at a gay club. As a child, however, she had none. Growing up as a member of the infamous cult The Children of God, Hough had her own self robbed from her. The cult took her all over the globe--to Germany, Japan, Texas, Chile--but it wasn\u0027t until she finally left for good that Lauren understood she could have a life beyond \u0022The Family.\u0022\n\nAlong the way, she\u0027s loaded up her car and started over, trading one life for the next. She\u0027s taken pilgrimages to the sights of her youth, been kept in solitary confinement, dated a lot of women, dabbled in drugs, and eventually found herself as what she always wanted to be: a writer. Here, as she sweeps through the underbelly of America--relying on friends, family, and strangers alike--she begins to excavate a new identity even as her past continues to trail her and color her world, relationships, and perceptions of self.\n\nAt once razor-sharp, profoundly brave, and often very, very funny, the essays in Leaving Isn\u0027t the Hardest Thing interrogate our notions of ecstasy, queerness, and what it means to live freely. Each piece is a reckoning: of survival, identity, and how to reclaim one\u0027s past when carving out a future.\n\n(P) 2021 Hodder \u0026 Stoughton Ltd\n\n—\nABOUT THE AUTHOR\n\nLAUREN HOUGH was born in Germany and raised in seven countries and West Texas. She\u0027s been an airman in the U.S. Air Force, a green-aproned barista, a bartender, a livery driver, and, for a time, a cable guy. Her work has appeared in Granta, The Wrath-Bearing Tree, The Guardian, and HuffPost. She lives in Austin.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEDcSkYKiM\nLanguage: English\nPublisher: Coronet\nPublished on: April 29, 2021\nISBN: 9781529382518\nDuration: 9 hr, 10 min\nGenres: Biography \u0026 Autobiography / Personal Memoirs, Literary Collections / Essays, Religion / Cults, Social Science / Essays, Social Science / Social Classes \u0026 Economic Disparity",
      "release": "2024-02-14T12:24:39Z",
      "duration": "00:55:35",
      "explicit": false,
      "youTubeId": "v-en-F38DGg",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=v-en-F38DGg"
      }
    },
    {
      "id": "d060b1d7-cd1f-40c6-a4cc-5a9e1ed8e9f2",
      "title": "Sex Cult Nun by Faith Jones · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEC8ERFRvM\n\nSex Cult Nun\nAuthored by Faith Jones\nNarrated by Katherine Fenton\n\n#faithjones #sexcultnun\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\n‘Both inspiring and disturbing, Sex Cult Nun unravels Jones’ complicated upbringing, the trauma she endured as a result and her eventual path to liberation.’ TIME  \n\n‘A moving story about family, courage, religious oppression, and more, and readers will have their heads spinning.’ SHONDALAND \n\n ‘Her gripping memoir—like Educated—takes you inside a disturbing childhood and leaves you marvelling at the resilience of the human spirit’ PEOPLE MAGAZINE  \n\nFaith Jones was raised to be part of an elite army preparing for the End Times. Isolated on a farm in Macau, she practised devotions and read letters of prophecy written by her grandfather, the leader of the now infamous cult, The Children of God. A direct decedent of the founding family, Faith featured in international media coverage – she was celebrated as extraordinary and then published doubly as a sharp reminder that she was not. \n\nWith indomitable grit, Faith created a world of her own, pilfering books and educating herself in secret. At the age of 23, she escaped, abandoning her history, her inheritance and her legacy. While her childhood friends succumbed to addiction, suicide and prostitution, Faith fought her way into Georgetown University and went on to establish a successful career in law. \n\nSex Cult Nun is an enthralling coming-of-age story that gives fascinating insight into the closed and complex world of extreme belief. Exploring the issues of psychological and physical control, Faith draws on her hard-won insight to interrogate the binaries of good and evil, and shed light on the insidiousness of oppression. At its heart, this extraordinary story is a stark warning about the consequences of surrendering our rights and responsibilities.\n\n—\nABOUT THE AUTHOR\n\nFaith Jones is a lawyer, activist, entrepreneur, and business coach. She began her career as an attorney with Skadden Arps representing clients in a wide variety of cross-border corporate transactions and has worked with businesses and government leaders in the Pacific Rim. Faith has been a featured TEDx speaker, has traveled the world, and has done humanitarian aid work in Kazakhstan, Russia, Japan, and Taiwan.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEC8ERFRvM\nLanguage: English\nPublisher: HarperCollins\nPublished on: January 6, 2022\nISBN: 9780008348267\nDuration: 16 hr, 8 min\nGenres: Biography \u0026 Autobiography / General, Biography \u0026 Autobiography / Military, Biography \u0026 Autobiography / Personal Memoirs, Biography \u0026 Autobiography / Survival, Family \u0026 Relationships / Abuse / Child Abuse, Family \u0026 Relationships / Family Relationships, Family \u0026 Relationships / Life Stages / Adolescence, Psychology / Social Psychology, Religion / Cults, Social Science / Sexual Abuse \u0026 Harassment",
      "release": "2024-02-12T23:07:16Z",
      "duration": "00:15:36",
      "explicit": false,
      "youTubeId": "6zCwyuv7MoA",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6zCwyuv7MoA"
      }
    },
    {
      "id": "21a1ca57-b0ef-4579-8dc5-7442f09930f1",
      "title": "The Krugersdorp Cult Killings: Inside Cecilia… by Jana Marx · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEDc8UKxjM\n\nThe Krugersdorp Cult Killings: Inside Cecilia Steyn\u0027s reign of terror\nAuthored by Jana Marx\nNarrated by Nicole Engelbrecht\n\n#janamarx #thekrugersdorpcultkillingsinsidececiliasteynsreignofterror\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nEleven murders over a period of four years sent shockwaves through the Krugersdorp community and made headlines nationwide. Eventually these murders were connected to Cecilia Steyn and her cult, Electus per Deus (chosen by God). Members of the cult were willing to do anything for Cecilia – even if it meant committing murder. Who is Cecilia Steyn? How can one person manipulate five others to commit murder and perjury on her behalf? How did Satanism contribute to all of this? How did inexperienced criminals manage to evade capture for so long? Jana Marx answers these and other questions in this true-crime account that led to one of the most sensational murder cases in the country’s history. Through interviews with those in the inner circle, evidence given in court and police files covering a period of four years, Marx attempts to answer the public’s questions and provide a view of the inner workings of such a cult. Narrated and produced by Nicole Engelbrecht.\n\n—\nABOUT THE AUTHOR\n\nJana Marx is an award-winning journalist, TV producer, and best-selling South African author with a successful track record of working in the media production industry. She is experienced in writing and storytelling for a variety of media platforms, including television, print, and online. She is also the narrator of the Showmax docuseries Devilsdorp.\n\n\nHost of True Crime South Africa, Nicole Engelbrecht, researches each case herself using media coverage, trial footage and social media sources – and often by talking to some of the people involved in these cases. Using her skills as a creative writer with a passion for true crime, she crafts each script for the podcasts, to give listeners deep insight into the mechanics of the case and an understanding of the victims as human beings.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEDc8UKxjM\nLanguage: English\nPublisher: LAPA Publishers\nPublished on: December 15, 2020\nISBN: 9780639601977\nDuration: 9 hr, 0 min\nGenres: True Crime / General",
      "release": "2024-02-10T15:41:04Z",
      "duration": "00:54:38",
      "explicit": false,
      "youTubeId": "kUF122iQsqc",
      "subjects": [
        "Electus per Deus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kUF122iQsqc"
      }
    },
    {
      "id": "3c0edac3-b500-420b-a4c9-b786961ffc11",
      "title": "Rajneeshpuram: Inside the Cult of Bhagwan and… by Russell King · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEACnFHcQM\n\nRajneeshpuram: Inside the Cult of Bhagwan and Its Failed American Utopia\nAuthored by Russell King\nNarrated by Russell King\n\n#russellking #rajneeshpuraminsidethecultofbhagwananditsfailedamericanutopia\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nA tale of breathtaking ambition, flamboyant personalities, palace intrigue, and casualties strewn along the path to enlightenment\n\nIn 1981, ambitious young Ma Anand Sheela transported the Indian guru Bhagwan Shree Rajneesh to the United States to fulfill his dream of creating a utopia for his thousands of disciples. Four years later, the incendiary Rajneeshpuram commune in Oregon collapsed under the weight of audacious criminal conspiracies hatched in its inner sanctum, including the largest bioterrorism attack in US history, an unprecedented election fraud scheme, and multiple attempted murders.\n\nRajneeshpuram explores how this extraordinary spiritual community, featured in the Netflix docuseries Wild Wild Country, went so wrong. Drawing from extensive interviews with former disciples and an unprecedented review of commune records, government and police files, and archival materials, author Russell King probes the charismatic power that Bhagwan (later known as Osho) and Sheela exercised over the community and the turbulent legal and political environment that left commune leaders ready to deceive, poison, and even murder to preserve their home and their master.\n\nRajneeshpuram is a fresh examination of the Rajneesh story, using newly available information and interviews with high-ranking disciples who have never before shared their stories.\n\n—\nABOUT THE AUTHOR\n\nRussell King is a writer, investigator, and attorney. In 2018 he created the podcast Building Utopia: Bhagwan Shree Rajneesh, which explores the history of Bhagwan and his disciples using an immersive narrative nonfiction approach. A former partner at an international law firm who specialized in complex litigation, King draws on his experience piecing together factual narratives based on contradictory evidence to tackle this rich and complicated history.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEACnFHcQM\nLanguage: English\nPublisher: Blackstone Publishing\nPublished on: March 8, 2022\nISBN: 9798200894826\nDuration: 11 hr, 30 min\nGenres: Religion / Cults, True Crime / General",
      "release": "2024-02-09T23:48:46Z",
      "duration": "00:05:44",
      "explicit": false,
      "youTubeId": "wZEPD4pKTJE",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wZEPD4pKTJE"
      }
    }
  ]
}