{
  "_ts": 0,
  "id": "7ca8ae27-ed3d-49b6-8309-a2565525a290",
  "name": "Google Play Books",
  "youTubeChannelId": "UChDyzr6fXuIIQAELYjVqh7Q",
  "episodes": [
    {
      "id": "bf9f7425-26c9-445b-81c0-406598e54a03",
      "title": "Leaving Isn\u0027t the Hardest Thing: The New York… by Lauren Hough · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEDcSkYKiM\n\nLeaving Isn\u0027t the Hardest Thing: The New York Times bestseller\nAuthored by Lauren Hough\nNarrated by Lauren Hough, Cate Blanchett\n\n#laurenhough #leavingisntthehardestthingthenewyorktimesbestseller\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nSearing and extremely personal essays from the heart of working-class America, shot through with the darkest elements the country can manifest - cults, homelessness, and hunger - while discovering light and humor in unexpected corners.\n\n\u0027Hough\u0027s writing will break your heart\u0027 - Roxane Gay, author of Difficult Women\n\n\u0027An edgy and unapologetic memoir in essays\u0027 - Kirkus Reviews\n\n\u0027This moving account of resilience and hard-earned agency brims with a fresh originality\u0027 - Publishers Weekly\n\nSearing and extremely personal essays from the heart of working-class America, shot through with the darkest elements the country can manifest - cults, homelessness, and hunger - while discovering light and humor in unexpected corners.\n\nAs an adult, Lauren Hough has had many identities: an airman in the U.S. Air Force, a cable guy, a bouncer at a gay club. As a child, however, she had none. Growing up as a member of the infamous cult The Children of God, Hough had her own self robbed from her. The cult took her all over the globe--to Germany, Japan, Texas, Chile--but it wasn\u0027t until she finally left for good that Lauren understood she could have a life beyond \u0022The Family.\u0022\n\nAlong the way, she\u0027s loaded up her car and started over, trading one life for the next. She\u0027s taken pilgrimages to the sights of her youth, been kept in solitary confinement, dated a lot of women, dabbled in drugs, and eventually found herself as what she always wanted to be: a writer. Here, as she sweeps through the underbelly of America--relying on friends, family, and strangers alike--she begins to excavate a new identity even as her past continues to trail her and color her world, relationships, and perceptions of self.\n\nAt once razor-sharp, profoundly brave, and often very, very funny, the essays in Leaving Isn\u0027t the Hardest Thing interrogate our notions of ecstasy, queerness, and what it means to live freely. Each piece is a reckoning: of survival, identity, and how to reclaim one\u0027s past when carving out a future.\n\n(P) 2021 Hodder \u0026 Stoughton Ltd\n\n—\nABOUT THE AUTHOR\n\nLAUREN HOUGH was born in Germany and raised in seven countries and West Texas. She\u0027s been an airman in the U.S. Air Force, a green-aproned barista, a bartender, a livery driver, and, for a time, a cable guy. Her work has appeared in Granta, The Wrath-Bearing Tree, The Guardian, and HuffPost. She lives in Austin.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEDcSkYKiM\nLanguage: English\nPublisher: Coronet\nPublished on: April 29, 2021\nISBN: 9781529382518\nDuration: 9 hr, 10 min\nGenres: Biography \u0026 Autobiography / Personal Memoirs, Literary Collections / Essays, Religion / Cults, Social Science / Essays, Social Science / Social Classes \u0026 Economic Disparity",
      "release": "2024-02-14T12:24:39Z",
      "duration": "00:55:35",
      "explicit": false,
      "youTubeId": "v-en-F38DGg",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=v-en-F38DGg"
      }
    },
    {
      "id": "d060b1d7-cd1f-40c6-a4cc-5a9e1ed8e9f2",
      "title": "Sex Cult Nun by Faith Jones · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEC8ERFRvM\n\nSex Cult Nun\nAuthored by Faith Jones\nNarrated by Katherine Fenton\n\n#faithjones #sexcultnun\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\n‘Both inspiring and disturbing, Sex Cult Nun unravels Jones’ complicated upbringing, the trauma she endured as a result and her eventual path to liberation.’ TIME  \n\n‘A moving story about family, courage, religious oppression, and more, and readers will have their heads spinning.’ SHONDALAND \n\n ‘Her gripping memoir—like Educated—takes you inside a disturbing childhood and leaves you marvelling at the resilience of the human spirit’ PEOPLE MAGAZINE  \n\nFaith Jones was raised to be part of an elite army preparing for the End Times. Isolated on a farm in Macau, she practised devotions and read letters of prophecy written by her grandfather, the leader of the now infamous cult, The Children of God. A direct decedent of the founding family, Faith featured in international media coverage – she was celebrated as extraordinary and then published doubly as a sharp reminder that she was not. \n\nWith indomitable grit, Faith created a world of her own, pilfering books and educating herself in secret. At the age of 23, she escaped, abandoning her history, her inheritance and her legacy. While her childhood friends succumbed to addiction, suicide and prostitution, Faith fought her way into Georgetown University and went on to establish a successful career in law. \n\nSex Cult Nun is an enthralling coming-of-age story that gives fascinating insight into the closed and complex world of extreme belief. Exploring the issues of psychological and physical control, Faith draws on her hard-won insight to interrogate the binaries of good and evil, and shed light on the insidiousness of oppression. At its heart, this extraordinary story is a stark warning about the consequences of surrendering our rights and responsibilities.\n\n—\nABOUT THE AUTHOR\n\nFaith Jones is a lawyer, activist, entrepreneur, and business coach. She began her career as an attorney with Skadden Arps representing clients in a wide variety of cross-border corporate transactions and has worked with businesses and government leaders in the Pacific Rim. Faith has been a featured TEDx speaker, has traveled the world, and has done humanitarian aid work in Kazakhstan, Russia, Japan, and Taiwan.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEC8ERFRvM\nLanguage: English\nPublisher: HarperCollins\nPublished on: January 6, 2022\nISBN: 9780008348267\nDuration: 16 hr, 8 min\nGenres: Biography \u0026 Autobiography / General, Biography \u0026 Autobiography / Military, Biography \u0026 Autobiography / Personal Memoirs, Biography \u0026 Autobiography / Survival, Family \u0026 Relationships / Abuse / Child Abuse, Family \u0026 Relationships / Family Relationships, Family \u0026 Relationships / Life Stages / Adolescence, Psychology / Social Psychology, Religion / Cults, Social Science / Sexual Abuse \u0026 Harassment",
      "release": "2024-02-12T23:07:16Z",
      "duration": "00:15:36",
      "explicit": false,
      "youTubeId": "6zCwyuv7MoA",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6zCwyuv7MoA"
      }
    },
    {
      "id": "21a1ca57-b0ef-4579-8dc5-7442f09930f1",
      "title": "The Krugersdorp Cult Killings: Inside Cecilia… by Jana Marx · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEDc8UKxjM\n\nThe Krugersdorp Cult Killings: Inside Cecilia Steyn\u0027s reign of terror\nAuthored by Jana Marx\nNarrated by Nicole Engelbrecht\n\n#janamarx #thekrugersdorpcultkillingsinsidececiliasteynsreignofterror\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nEleven murders over a period of four years sent shockwaves through the Krugersdorp community and made headlines nationwide. Eventually these murders were connected to Cecilia Steyn and her cult, Electus per Deus (chosen by God). Members of the cult were willing to do anything for Cecilia – even if it meant committing murder. Who is Cecilia Steyn? How can one person manipulate five others to commit murder and perjury on her behalf? How did Satanism contribute to all of this? How did inexperienced criminals manage to evade capture for so long? Jana Marx answers these and other questions in this true-crime account that led to one of the most sensational murder cases in the country’s history. Through interviews with those in the inner circle, evidence given in court and police files covering a period of four years, Marx attempts to answer the public’s questions and provide a view of the inner workings of such a cult. Narrated and produced by Nicole Engelbrecht.\n\n—\nABOUT THE AUTHOR\n\nJana Marx is an award-winning journalist, TV producer, and best-selling South African author with a successful track record of working in the media production industry. She is experienced in writing and storytelling for a variety of media platforms, including television, print, and online. She is also the narrator of the Showmax docuseries Devilsdorp.\n\n\nHost of True Crime South Africa, Nicole Engelbrecht, researches each case herself using media coverage, trial footage and social media sources – and often by talking to some of the people involved in these cases. Using her skills as a creative writer with a passion for true crime, she crafts each script for the podcasts, to give listeners deep insight into the mechanics of the case and an understanding of the victims as human beings.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEDc8UKxjM\nLanguage: English\nPublisher: LAPA Publishers\nPublished on: December 15, 2020\nISBN: 9780639601977\nDuration: 9 hr, 0 min\nGenres: True Crime / General",
      "release": "2024-02-10T15:41:04Z",
      "duration": "00:54:38",
      "explicit": false,
      "youTubeId": "kUF122iQsqc",
      "subjects": [
        "Electus per Deus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kUF122iQsqc"
      }
    },
    {
      "id": "3c0edac3-b500-420b-a4c9-b786961ffc11",
      "title": "Rajneeshpuram: Inside the Cult of Bhagwan and… by Russell King · Audiobook preview",
      "description": "PURCHASE ON GOOGLE PLAY BOOKS ►► https://g.co/booksYT/AQAAAEACnFHcQM\n\nRajneeshpuram: Inside the Cult of Bhagwan and Its Failed American Utopia\nAuthored by Russell King\nNarrated by Russell King\n\n#russellking #rajneeshpuraminsidethecultofbhagwananditsfailedamericanutopia\n\n—\nGOOGLE PLAY BOOKS\n\nFind your next great read with Google Play Books.\n\nGoogle Play Books is a global digital bookstore offering ebooks, audiobooks, comics, and manga.  Discover book recommendations personalized just for you.\n\nGet the iOS app: https://goo.gle/books-ios\nGet the Android app: https://goo.gle/books-android\n\n—\nBOOK DESCRIPTION\n\nA tale of breathtaking ambition, flamboyant personalities, palace intrigue, and casualties strewn along the path to enlightenment\n\nIn 1981, ambitious young Ma Anand Sheela transported the Indian guru Bhagwan Shree Rajneesh to the United States to fulfill his dream of creating a utopia for his thousands of disciples. Four years later, the incendiary Rajneeshpuram commune in Oregon collapsed under the weight of audacious criminal conspiracies hatched in its inner sanctum, including the largest bioterrorism attack in US history, an unprecedented election fraud scheme, and multiple attempted murders.\n\nRajneeshpuram explores how this extraordinary spiritual community, featured in the Netflix docuseries Wild Wild Country, went so wrong. Drawing from extensive interviews with former disciples and an unprecedented review of commune records, government and police files, and archival materials, author Russell King probes the charismatic power that Bhagwan (later known as Osho) and Sheela exercised over the community and the turbulent legal and political environment that left commune leaders ready to deceive, poison, and even murder to preserve their home and their master.\n\nRajneeshpuram is a fresh examination of the Rajneesh story, using newly available information and interviews with high-ranking disciples who have never before shared their stories.\n\n—\nABOUT THE AUTHOR\n\nRussell King is a writer, investigator, and attorney. In 2018 he created the podcast Building Utopia: Bhagwan Shree Rajneesh, which explores the history of Bhagwan and his disciples using an immersive narrative nonfiction approach. A former partner at an international law firm who specialized in complex litigation, King draws on his experience piecing together factual narratives based on contradictory evidence to tackle this rich and complicated history.\n\n—\nAUDIOBOOK DETAILS\n\nPurchase on Google Play Books ►► https://g.co/booksYT/AQAAAEACnFHcQM\nLanguage: English\nPublisher: Blackstone Publishing\nPublished on: March 8, 2022\nISBN: 9798200894826\nDuration: 11 hr, 30 min\nGenres: Religion / Cults, True Crime / General",
      "release": "2024-02-09T23:48:46Z",
      "duration": "00:05:44",
      "explicit": false,
      "youTubeId": "wZEPD4pKTJE",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wZEPD4pKTJE"
      }
    }
  ]
}