{
  "_ts": 0,
  "id": "df6f57ce-0b0c-4998-aa12-0cc90f6477d8",
  "name": "Gooned",
  "spotifyId": "1dYZ0lvrHsRbjCXFOIqUat",
  "appleId": 1713230474,
  "episodes": [
    {
      "id": "46778163-a7af-4a29-a891-3947fb40652c",
      "title": "12: The Big Question",
      "description": "Episode 12: The Big Question If not the Troubled Teen Industry, then what else? Where can families, caregivers, schools, the justice system, and the courts look for effective support for struggling teens? Learn what survivors, activists, and lawmakers see in the future for the TTI, and what steps must be taken to change our understanding of youth mental health. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. To get early access to episodes, as well as bonus episodes and behind the scenes content, head to patreon.com/goonedpodcast. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Sources and Further Reading Unsilenced A National Look at the Use of Congregate Care in Child Welfare | The Administration for Children and Families Child Welfare: HHS Should Facilitate Information Sharing Between States to Help Prevent and Address Maltreatment in Residential Facilities | U.S. GAO Stop Institutional Child Abuse NAA Denial of License Renewal Diamond Ranch Academy July 2023 Transcripts available at goonedpodcast.com",
      "release": "2024-02-14T11:00:00Z",
      "duration": "00:34:37.5960000",
      "explicit": false,
      "spotifyId": "3E7pcHO1r2Mck02nhzNLsR",
      "appleId": 1000645293565,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3E7pcHO1r2Mck02nhzNLsR",
        "apple": "https://podcasts.apple.com/podcast/12-the-big-question/id1713230474?i=1000645293565"
      }
    },
    {
      "id": "a4c1a5ee-0682-4410-9a03-8381f428e738",
      "title": "11: Lipstick on a Pig",
      "description": "Episode 11: Lipstick on a Pig It all started with Paris Hilton: since 2020, legislation passed to regulate and oversee the Troubled Teen Industry has outpaced the previous 50 years combined. Hear aboutthe past, present, and future of regulation, activism, and legislation around the TTI, efforts to abolish the industry, and the unexpected influence of America’s favorite socialite. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. To get early access to episodes, as well as bonus episodes and behind the scenes content, head to patreon.com/goonedpodcast. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Sources and Further Reading Trapped in Treatment Podcast (available on all platforms) Child Welfare: HHS Should Facilitate Information Sharing Between States to Help Prevent and Address Maltreatment in Residential Facilities The Watchdog Report Sen. Brad Molnar: Paris Hilton 1, commonsense 0 Paris Hilton On Hand As Gov. Signs Bill Regulating Youth Facilities Montana HB 218 Montana SB 267 Utah SB 127 Missouri HB 557 Missouri HB 560 Oregon SB 749 Oregon SB 710 SICAA Unsilenced Transcripts available at goonedpodcast.com",
      "release": "2024-02-07T11:00:00Z",
      "duration": "00:32:34.6120000",
      "explicit": false,
      "spotifyId": "2XFecauHT6Appmgn6ZIOWl",
      "appleId": 1000644473817,
      "subjects": [
        "Troubled Teen Industry",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2XFecauHT6Appmgn6ZIOWl",
        "apple": "https://podcasts.apple.com/podcast/11-lipstick-on-a-pig/id1713230474?i=1000644473817"
      }
    },
    {
      "id": "b3e0244d-365b-4085-84ef-3684cb2c8318",
      "title": "10: Afterwards",
      "description": "Episode 10: Afterwards Many survivors can remember their very first day out – often, it’s their 18th birthday, a much-anticipated day when, suddenly, they are free. But where do you go from there? Hear from survivors young and old about the lasting effects of the TTI, from the day they got out to the trauma that endures decades later. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. To get early access to episodes, as well as bonus episodes and behind the scenes content, head to patreon.com/goonedpodcast. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Sources and Further Reading Why I Kidnapped My Daughter ( Archived ) Transcripts available at goonedpodcast.com",
      "release": "2024-01-31T11:00:00Z",
      "duration": "00:33:06.6640000",
      "explicit": false,
      "spotifyId": "3pk13VLFOejGvKW1YpO4Dh",
      "appleId": 1000643648182,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3pk13VLFOejGvKW1YpO4Dh",
        "apple": "https://podcasts.apple.com/podcast/10-afterwards/id1713230474?i=1000643648182"
      }
    },
    {
      "id": "6c76006b-5e30-4481-a4a0-16ab1c90f7ad",
      "title": "9: Pray the Gay Away",
      "description": "Episode 9: Pray the Gay Away Conversion therapy has been disavowed by nearly every major medical organization in the United States, but survivors and staff say it is still a prevalent practice in the Troubled Teen Industry. Hear from LGBTQ\u0026#43; survivors about conversion therapy, forcible detransition of transgender youth, homophobia, and transphobia in the TTI. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. To see the academic director’s posts mentioned in this episode, head to Patreon.com/goonedpodcast. Remember to rate, review, and follow Gooned wherever you listen to podcasts, and check out goonedpodcast.com for more information. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Sources and Further Reading Conversion Therapy and LGBT Youth - Williams Institute The Troubled Teen Industry and Its Effects: An Oral History - Jamie Mater Supreme Court rejects an appeal over bans on conversion therapy for LGBTQ\u0026#43; children Conversion Therapy - LGBT Movement Advancement Project New SAMHSA Report Underscores the Harms of Conversion Therapy \u0026 Importance of Affirmation for LGBTQ Young People’s Mental Health | The Trevor Project New SAMHSA Report Underscores the Harms of Conversion Therapy \u0026 Importance of Affirmation for LGBTQ Young People’s Mental Health | The Trevor Project Homosexuality and Sexual Orientation Disturbance: Proposed Change in DSM-II \u0022The diagnostic status of homosexuality in DSM-III: a reformulation of the issues\u0022 Youth treatment center employee fired for \u0027offensive\u0027 posts - FOX 13 News Utah Transcripts available at goonedpodcast.com",
      "release": "2024-01-24T11:00:00Z",
      "duration": "00:31:54.5140000",
      "explicit": false,
      "spotifyId": "3vFqxHh3OmXxwXTTxCP5Yt",
      "appleId": 1000642767663,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vFqxHh3OmXxwXTTxCP5Yt",
        "apple": "https://podcasts.apple.com/podcast/9-pray-the-gay-away/id1713230474?i=1000642767663"
      }
    },
    {
      "id": "eb5c7145-7f50-4c1e-a4ee-5cebbb05ddf3",
      "title": "8: The System Gone Mad",
      "description": "Episode 8: The System Gone Mad Parents aren’t the only ones who can send kids away. Learn about the government’s role in putting juvenile offenders, foster youth, and other wards of the state into the TTI, and how lackluster regulation can make starting a TTI facility all too easy. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. For bonus and behind-the-scenes content and early access to episodes, head to Patreon.com/goonedpodcast. Remember to rate, review, and follow Gooned wherever you listen to podcasts, and check out goonedpodcast.com for more information. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Sources and Further Reading Considering Licensing an Addiction Treatment Center in Utah? You’re in for a Treat. Trapped in Treatment Podcast A National Look at the Use of Congregate Care in Child Welfare National Council of Juvenile and Family Court Judges Making appropriate parenting arrangements in family violence cases: Applying the literature to identify promising practices The Misuse of Parental Alienation in Family Court Proceedings with Allegations of Intimate Partner Violence The Misuse of Parental Alienation in Family Court Proceedings with Allegations of Intimate Partner Violence , Part 2 Children and Domestic Homicide: Understanding the Risks West Ridge Academy - Utah Boys Ranch Utah Code Title 26 - Utah Health Code Chapter 23 - Enforcement Provisions and Penalties Section 10 Religious Exemption at some Florida Children\u0027s Homes shields prying eyes Religious Exemption Laws Transcripts available at goonedpodcast.com",
      "release": "2024-01-17T11:00:00Z",
      "duration": "00:34:40.5740000",
      "explicit": false,
      "spotifyId": "4x5K6z5hVnvxMZQ8rOuea5",
      "appleId": 1000641957197,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4x5K6z5hVnvxMZQ8rOuea5",
        "apple": "https://podcasts.apple.com/podcast/8-the-system-gone-mad/id1713230474?i=1000641957197"
      }
    },
    {
      "id": "b8ad18b5-f1f9-4de0-a407-98a56a538958",
      "title": "7: NATSAP",
      "description": "Episode 7: NATSAP Emma goes undercover at a conference for members of NATSAP, the preeminent trade organization for troubled teen industry programs and directors, to discover the culture of those at the head of the machine. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast.To see the notes and materials from the NATSAP conference and read the study that was presented, head to Patreon.com/goonedpodcast. Remember to rate, review, and follow Gooned wherever you listen to podcasts, and check out goonedpodcast.com for more information. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Sources and Further Reading The Troubled Teen Industry and Its Effects - An Oral History, Jamie Mater Selected Cases of Death, Abuse, and Deceptive Marketing, Statement of Gregory D. Kutz, Managing Director Forensic Audits and Special Investigations Cases Of Child Neglect And Abuse At Private Residential Treatment Facilities , 2007 Salem couple sues school over son\u0027s suicide “Jump and don’t look back”—three-story suicide is latest in Utah’s troubled teen industry Leaked Audio Brings More Attention To Utah’s ’Troubled Teen Industry\u0027 NATSAP and the TTI - Unsilenced Transcripts available at goonedpodcast.com",
      "release": "2024-01-10T11:00:00Z",
      "duration": "00:36:49.5930000",
      "explicit": false,
      "spotifyId": "16MOzUMsiYrRPDfLXNh78o",
      "appleId": 1000641159295,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/16MOzUMsiYrRPDfLXNh78o",
        "apple": "https://podcasts.apple.com/podcast/7-natsap/id1713230474?i=1000641159295"
      }
    },
    {
      "id": "388b28b4-3b9c-423c-9855-3abb617259d8",
      "title": "6: Money Talks",
      "description": "Episode 6: Money Talks The TTI is a multi-billion-dollar industry whose funding is nearly untraceable by design. Tracking where this money comes from and whose pockets it lines is crucial to understand how an industry built around victimizing the vulnerable has continued to thrive for so long. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. For exclusive bonus episodes, behind the scenes content, and further reading, head to Patreon.com/goonedpodcast. Remember to rate, review, and follow Gooned wherever you listen to podcasts, and check out goonedpodcast.com for more information. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Sources and Further Reading A Profitable \u0027Death Trap\u0027 - Sequel youth facilities raked in millions while accused of abusing children - NBC News https://www.nbcnews.com/news/us-news/profitable-death-trap-sequel-youth-facilities-raked-millions-while-accused-n1251319 Social Security Act §1905 https://www.ssa.gov/OP_Home/ssact/title19/1905.htm 2022 GAO Report https://www.gao.gov/products/gao-22-104670 Trapped in Treatment S1E4 https://open.spotify.com/episode/0PhYwQXafHNEUbCN4mNCnq?si=XyJuInWwRLeJrDPSQVE_JQ Youth were abused here - APM Reports https://www.apmreports.org/story/2020/09/28/for-profit-sequel-facilities-children-abused Five Facts About the Troubled Teen Industry - American Bar https://www.americanbar.org/groups/litigation/committees/childrens-rights/practice/2021/5-facts-about-the-troubled-teen-industry/#:~:text=Descriptions%20of%20experiences%20in%20the,needs%20like%20food%20and%20water . Transcripts available at goonedpodcast.com",
      "release": "2024-01-03T11:00:00Z",
      "duration": "00:31:42.6540000",
      "explicit": false,
      "spotifyId": "0u3bLiejYeA5wwKhbinCHA",
      "appleId": 1000640417851,
      "subjects": [
        "Troubled Teen Industry",
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0u3bLiejYeA5wwKhbinCHA",
        "apple": "https://podcasts.apple.com/podcast/6-money-talks/id1713230474?i=1000640417851"
      }
    },
    {
      "id": "29bef54d-da59-47f2-97a7-d1e3b624e92b",
      "title": "5: Straight, Inc.",
      "description": "Episode 5: Straight, Inc. Straight, Incorporated was one of the earliest troubled teen industry programs to take hold in the United States, garnering support from the media and the likes of Nancy Reagan and Princess Diana. Hear from a survivor of Straight, Inc. about the program that became a blueprint for the industry’s current practices. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. For more information about Straight, Incorporated, to listen to testimonies, and to read some of the reports and news articles, head to Patreon.com/goonedpodcast. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Sources and Further Reading 1978 Task Force Investigation of Straight Inc. 1983 Report on Class Action Suit Against Straight, Inc. Weaver v. Straight, Inc. Straight, Inc. Letters written to Nancy Reagan 1978 Project Straight Inc. Investigation Florida Department of Administration 1978 Fiscal Monitoring Abstract Straight Inc. Research for the Florida Department of Administration’s 1978 Fiscal Monitoring Abstract Straight Inc. Research for the Florida Department of Administration 1978 Fiscal Monitoring Abstract Straight Inc., part 2 An Examination of Straight Incorporated, by Andrew \u0026 Barbara Malcolm Straight, Inc. Brimmer Inquiry Letter to CBS President Regarding “60 Minutes” reporting on Straight Transcripts available at goonedpodcast.com",
      "release": "2023-12-27T11:00:00Z",
      "duration": "00:35:07.3240000",
      "explicit": false,
      "spotifyId": "5j3gvn8dor9j0ajvBGuvAg",
      "appleId": 1000639806589,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5j3gvn8dor9j0ajvBGuvAg",
        "apple": "https://podcasts.apple.com/podcast/5-straight-inc/id1713230474?i=1000639806589"
      }
    },
    {
      "id": "b235fc5b-2485-4ac2-8449-e067bdc7fe31",
      "title": "4: Drinking the Kool-Aid",
      "description": "Episode 4: Drinking the Kool-Aid So, what’s the pitch? Despite growing public scrutiny towards the troubled teen industry, tens of thousands of parents and caregivers still send their children away every year. Hear from Sharon, who sent her son into a TTI program, and listen in as the host contacts admissions directors posing as a curious parent. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. To hear the full call between Nancy and the program representative, head to Patreon.com/goonedpodcast. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Marlee Porter’s podcast Broken Promises is available wherever you get your podcasts, and at brokenpromises.com. Sources and Further Reading KC’s article, “My Time Spent in the Troubled Teen Industry” About IECA IECA Principles of Good Practice Transcripts available at goonedpodcast.com",
      "release": "2023-12-20T11:00:00Z",
      "duration": "00:29:12.8940000",
      "explicit": false,
      "spotifyId": "000LrKsmqBp03fC7CJAlCA",
      "appleId": 1000639200725,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/000LrKsmqBp03fC7CJAlCA",
        "apple": "https://podcasts.apple.com/podcast/4-drinking-the-kool-aid/id1713230474?i=1000639200725"
      }
    },
    {
      "id": "2f518517-a3dd-45de-a0d4-f233058716ae",
      "title": "3: Level Zero",
      "description": "Episode 3: Level Zero Troubled Teen Industry programs use a system of points and levels that award or revoke basic needs based on compliance and submission. Necessities like food, water, and social interaction are privileges that can be taken away at any time, and constant surveillance means nothing goes unseen. Inside a TTI facility, you live and die by your level. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. To see program materials and learn more about daily life in a TTI program, head to Patreon.com/goonedpodcast. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Marlee Porter’s podcast Broken Promises is available wherever you get your podcasts, and at brokenpromisespodcast.com. Sources and Further Reading Wilderness Sample Schedule The Troubled Teen Industry and Its Effects: An Oral History , Jamie Mater Beyond Point and Level Systems: Moving Toward Child-Centered Programming Search programs by state, including whether they have a levels/points system and if that system is tied to privileges, on the Unsilened Program Archive Transcripts available at goonedpodcast.com",
      "release": "2023-12-13T11:00:00Z",
      "duration": "00:32:36.4930000",
      "explicit": false,
      "spotifyId": "3znXFYmaRerdupB8S100pO",
      "appleId": 1000638426662,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3znXFYmaRerdupB8S100pO",
        "apple": "https://podcasts.apple.com/podcast/3-level-zero/id1713230474?i=1000638426662"
      }
    },
    {
      "id": "94c3b8dd-b149-4899-a6cb-08841831d70b",
      "title": "2: The Hard Way",
      "description": "Episode 2: The Hard Way With just a few clicks and a phone call, anyone can hire “goons,” or legal kidnappers, to take their child away in the middle of the night. Emma goes undercover as Nancy, a fictional mother looking to transport her daughter to a wilderness therapy program, and discovers just how easy it is for the average parent to hire a pair of goons to abduct their child under the cover of darkness. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. To see the transport estimates and forms in full, listen to the entire call, and read the email communications with transport agencies, head to Patreon.com/goonedpodcast. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. The research of Jamie Mater, who was interviewed in this episode, can be found at https://www.unh.edu/inquiryjournal/spring-2022/troubled-teen-industry-and-its-effects-oral-history . Sources and Further Reading The Troubled Teen Industry and Its Effects: An Oral History A Closer Look at Involuntary Treatment and the Use of Transport Service in Outdoor Behavioral Healthcare (Wilderness Therapy) OAR 309-033-0432: Standards for the Approval of a Secure Transport Provider to Transport a Person in Custody or On Diversion to an Approved Holding Hospital or Nonhospital Facility AMATS website Utah S.B. 239 Congregate Care Program Amendments Transcripts available at goonedpodcast.com",
      "release": "2023-12-06T11:00:00Z",
      "duration": "00:32:40.5680000",
      "explicit": false,
      "spotifyId": "74GfxJFBOJVgBbJy4u4b7I",
      "appleId": 1000637671190,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74GfxJFBOJVgBbJy4u4b7I",
        "apple": "https://podcasts.apple.com/podcast/2-the-hard-way/id1713230474?i=1000637671190"
      }
    },
    {
      "id": "6132f26f-e0bc-477f-bc62-2d5bb1fea178",
      "title": "1: The EdCon",
      "description": "Episode 1: The EdCon Educational consultants, or EdCons, are a first step in the pipeline into the Troubled Teen Industry. Meet Nancy, Emma’s 57-year-old alter-ego, and Sharon, the mother of a child currently in a wilderness program, to learn how consultants prey on parents’ desperation to funnel kids into the TTI. Find Gooned at goonedpodcast.com and on TikTok @goonedpodcast. To see the parent handbooks and other documents referenced in this episode, along with exclusive content and early access to episodes, head to patreon.com/goonedpodcast. Credits Gooned is researched, reported, and edited by Emma Lehman. Original music for the show was created by Olivia Springberg. Victoria Shifflett mastered the show. Episode artwork was created by Sam Doe. Sarah Lukowski and Avery Erskine copyedited and consulted on the show. Special thanks to Martin Gottesfeld and Nora Ashleigh Barrie, whose reporting contributed to researching this episode. Sources and Further Reading Jump and Don’t Look Back Sex Offender, Teen Suicides and $10K Fine Plague Utah Autism Program Forty-nine States Slowly Realize Utah Is Not Safe Place for Children Teen\u0027s death helps close \u0022Troubled Teen\u0022 Center Diamond Ranch Academy Victims of the Troubled Teen Industry in the United States Residential Programs: Selected Cases of Death, Abuse, and Deceptive Marketing Facility Deaths Transcripts available at goonedpodcast.com",
      "release": "2023-12-06T11:00:00Z",
      "duration": "00:31:22.7490000",
      "explicit": false,
      "spotifyId": "50IGO3YMlaFhzRAvHkJWJj",
      "appleId": 1000637671237,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/50IGO3YMlaFhzRAvHkJWJj",
        "apple": "https://podcasts.apple.com/podcast/1-the-edcon/id1713230474?i=1000637671237"
      }
    },
    {
      "id": "9c918f20-c2c3-4d65-930f-044fac40accf",
      "title": "Trailer: Gooned",
      "description": "Gooned is a deep dive into an industry with blood on its hands. The Troubled Teen Industry (TTI) is a network of profit-incentivized behavior modification facilities for youth, ranging from wilderness programs to therapeutic boarding schools. The decades-old industry uses predatory tactics to capitalize on families in crisis and victimize hundreds of thousands of children and teens every year. Gooned premieres December 6th, 2023. Find Gooned at goonedpodcast.com and on TikTok @goonedpod. To support the show and its creators, see exclusive content, and get early access to episodes, head to patreon.com/goonedpodcast. Gooned is researched, reported, and edited by Emma Lehman . Original music for the show was created by Olivia Springberg . This trailer was produced by Grayton Newman . Episode artwork was created by Sam Doe . Sarah Lukowski and Avery Erskine copyedited and consulted on the show.",
      "release": "2023-11-29T11:00:00Z",
      "duration": "00:01:42.0480000",
      "explicit": false,
      "spotifyId": "0Ul7UCKVEsnTdiLKOKRgqO",
      "appleId": 1000636904575,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Ul7UCKVEsnTdiLKOKRgqO",
        "apple": "https://podcasts.apple.com/podcast/trailer-gooned/id1713230474?i=1000636904575"
      }
    }
  ]
}