{
  "id": "4177603b-95f2-4088-9b4b-bdab06097eb9",
  "name": "Gothic Ledger",
  "youTubeChannelId": "UC_h_pKy5jKuvJTI6QDLoAbw",
  "episodes": [
    {
      "id": "a0599105-0670-4b79-bf6d-e43ff76a4376",
      "title": "The Ant Hill Kids: Canada\u0027s Most Disturbing Cult of All Time",
      "description": "The Ant Hill Kids: Canada\u0027s Most Disturbing Cult of All Time\n\nThe Ant Hill Kids was Canada\u0027s most disturbing cult, led by Roch Theriault, who committed unspeakable acts of horror against his followers. This is the complete true crime documentary exposing the horrifying reality of what happened in rural Quebec.\n\nIn this dark history documentary, we uncover the disturbing cult story of the Ant Hill Kids and their leader Roch Theriault. From 1977 to 1989, this Canadian cult operated in isolation, where cult survivors like Gabrielle Lavallee endured unimaginable abuse.\n\nThis true crime documentary explores:\n• The origins of the Ant Hill Kids cult\n• Roch Theriault\u0027s manipulation and control tactics  \n• The horrifying acts committed against cult members\n• How Canadian authorities finally stopped this religious cult\n• Survivor testimonies and the aftermath\n\nThis is one of the most disturbing cult cases in Canadian true crime history, rivaling international cult horror stories in its brutality. If you\u0027re interested in dark history, cult documentaries, and true crime stories from Canada, this investigation reveals the complete timeline of events.\n\n🔔 Subscribe to Gothic Ledger for more disturbing documentary content covering dark history, true crime cases, and forgotten stories from asylum walls, church vaults, and hidden institutions.\n\n#AntHillKids #TrueCrimeDocumentary #DarkHistory #CultDocumentary #CanadianCult #DisturbingCult",
      "release": "2025-10-16T00:01:04Z",
      "duration": "00:53:42",
      "explicit": false,
      "youTubeId": "obJOd74ZWNY",
      "subjects": [
        "Ant Hill Kids"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=obJOd74ZWNY"
      }
    },
    {
      "id": "ea8155d4-a594-4154-b834-187e9171df28",
      "title": "Alaska\u0027s Most Disturbing Cult Family - Papa Pilgrim True Crime Documentary",
      "description": "Alaska\u0027s Most Disturbing Cult Family - Papa Pilgrim True Crime Documentary\n\nThe shocking true crime documentary of Alaska\u0027s most disturbing cult family. Papa Pilgrim fooled an entire community while hiding decades of abuse in the frozen wilderness of McCarthy, Alaska.\n\nIn 2005, two sisters escaped 60 miles across sub-zero terrain to expose the horrifying truth about their father, Robert \u0022Papa Pilgrim\u0022 Hale, and the religious cult family that captivated America.\n\n🔍 CASE FILE: The Papa Pilgrim Cult\n📍 LOCATION: McCarthy, Alaska\n📅 TIMELINE: 1998-2008\n⚖️ OUTCOME: Conviction \u0026 Mysterious Death\n\nThis true crime documentary reveals:\n• How a convicted murderer reinvented himself as a pioneer patriarch\n• The systematic abuse hidden behind a wholesome family image\n• The 60-mile midnight escape that brought justice\n• The cult family dynamics that fooled investigators for years\n• Unanswered questions that haunt Alaska to this day\n\n#TrueCrime #CultDocumentary #AlaskaCrime #PapaPilgrim #CultFamily",
      "release": "2025-10-15T00:30:03Z",
      "duration": "00:51:05",
      "explicit": false,
      "youTubeId": "0ipWKpxRhW8",
      "subjects": [
        "Robert Allen Hale"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0ipWKpxRhW8"
      }
    }
  ]
}