{
  "id": "7d09c222-2f60-4951-b58b-fd8468b4fb67",
  "name": "Grace Report",
  "youTubeChannelId": "UCj56srJRPpwP9sDUHI6qXQQ",
  "episodes": [
    {
      "id": "058eff33-9750-4fea-a647-f9f6df54bcc4",
      "title": "MARY COSBY\u0027S CULT EXPOSED IN SHOCKING NEW DOCUMENTARY!",
      "description": "A shocking new TLC docuseries is putting Real Housewives of Salt Lake City star Mary Cosby and her husband Robert Cosby Sr. back under the microscope — and this time, the focus is on their controversial church and the decades of allegations surrounding it.\n\nThe three-part series, titled “The Cult of The Real Housewife,” dives into claims that the Faith Temple Pentecostal Church has been operating like a full-blown cult. The documentary features former church members speaking out for the first time, sharing disturbing stories about control tactics, intimidation, alleged misconduct, and loyalty rules that kept members in line.\n\nA cult expert appears throughout the doc to break down the couple’s influence, how followers may have been manipulated, and why Mary and Robert have managed to avoid accountability for years.\n\nThe doc also explores one of the most controversial elements of Mary Cosby’s public life — her marriage to her step-grandfather, a topic that has followed her since her first season on RHOSLC.\n\nViewers will also see:\n✨ Never-before-heard recordings of Mary and Robert’s sermons\n✨ Rare archival footage from Faith Temple’s early days\n✨ Firsthand accounts of alleged psychological control\n✨ What really happened behind closed doors\n✨ Why the church is finally being investigated on a national stage\n\nPremiere Date: Thursday, January 1 from 8–11 PM ET/PT on TLC\nStreaming: All three episodes drop the next day on Max and Discovery\u002B\n\nIn this video, we break down everything revealed in the documentary, the new allegations, how RHOSLC fans are reacting, and what this could mean for Mary Cosby moving forward.\n\nHASHTAGS\n\n#MaryCosby #RHOSLC #RealHousewives #HousewivesNews #TLC #TheCultOfTheRealHousewife #FaithTemple #RealityTVScandal #TheGraceReport\n\n\nBecome a Channel Member: http://bit.ly/2TBan0C\n\nGet your Philo free trial: https://philo.sjv.io/Qy1Vb9\n\nLearn a new language with TalkPal! https://talkpalinc.sjv.io/7aBa6Y\n\nMy retinol: https://rstyle.me/\u002BYXx0DEWps5G0XiWLuF2ANA\n\nThe VPN service I use: https://www.xvbelink.com/?offer=3monthsfree\u0026a_fid=GraceReport\n\n\nFollow Me on Social Media:\nhttps://www.instagram.com/gracereport/\nhttps://twitter.com/gracereport\nhttps://www.facebook.com/GraceReport/\n\nEmail: graceisunknown@gmail.com\n*affiliate links included*",
      "release": "2025-11-13T23:32:21Z",
      "duration": "00:15:25",
      "explicit": false,
      "youTubeId": "6jkEAHapR2Y",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6jkEAHapR2Y"
      }
    }
  ]
}