{
  "_ts": 0,
  "id": "e0ce0d7b-ebd5-4a0c-b2f5-5c5ac0cd9ed2",
  "name": "Graceful Atheist",
  "youTubeChannelId": "UCRtAxlF1RkT3MqRcYZFKfXg",
  "episodes": [
    {
      "id": "bd69db4f-c366-4e1b-a5bd-dd94e9bd9a7c",
      "title": "Amanda: Deconversion From An Unnamed Cult",
      "description": "This week’s guest is Amanda. Amanda comes from a rather surprising brand of Christianity she refers to as the “Serpent Seed Pentecostal Cult.” She goes into detail, and it’s quite a ride.  Various things happened throughout her adolescence that made her wonder if Christianity was true, but her mother would violently put a quick stop to those doubts. By 17, Amanda left home to live with a friend, but that couldn’t last long.  Amanda spent a decade trying out every religion under the sun but never found the one that could give real, solid answers.  “Everybody thinks that they have the answer but nobody does.”  Today, she knows she doesn’t need the gods to dictate her life. She’s living it to the fullest and always moving forward.  Interact  For quotes, recommendations, transcripts and more see the full episode show notes https://gracefulatheist.com/2023/08/27/amanda-deconversion-from-an-unnamed-cult/   Join the Deconversion Anonymous Facebook group https://www.facebook.com/groups/deconversion  Graceful Atheist Podcast Merch! https://www.teepublic.com/user/gracefulatheistpodcast  Support the podcast on Patreon https://www.patreon.com/gracefulatheist  Secular Grace https://gracefulatheist.com/2016/10/21/secular-grace/  Deconversion https://gracefulatheist.com/2017/12/03/deconversion-how-to/  Deconstruction https://gracefulatheist.com/2017/12/03/deconversion-how-to/#deconstruction/   Attribution  \u0022Waves\u0022 track written and produced by Makaih Beats https://makaihbeats.net/",
      "release": "2024-12-27T00:26:33Z",
      "duration": "01:15:45",
      "explicit": false,
      "youTubeId": "ztjAibiGTuo",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ztjAibiGTuo"
      }
    }
  ]
}