{
  "_ts": 0,
  "id": "ba635f13-cb8e-47e6-96b6-8057beb8bebb",
  "name": "Grace In The Grind",
  "spotifyId": "1nw8OCTdwQAqjx0hzuRQQM",
  "appleId": 1767405179,
  "youTubeChannelId": "UCeu8GbeqNeXO-ZkCb_PoZTA",
  "episodes": [
    {
      "id": "6d832d63-ac05-49b7-88e6-aee66e61b503",
      "title": "Cult Survivor Turns Trauma into Transformative Coaching Mission",
      "description": "Surviving trauma is not a death sentence, but it requires love and permission to heal, as Martha Gloria Kartaoui passionately shares in this enlightening conversation. Martha, a cult survivor and author of \u0022Going All In,\u0022 discusses her journey of overcoming unimaginable trauma and the profound awakening that led her to help others navigate their healing journeys. With a focus on understanding the interconnectedness of mind, body, and spirit, she emphasizes the importance of recognizing and processing trauma rather than trying to categorize it. Throughout the episode, Martha highlights the significance of community support and the necessity of self-compassion in the healing process. Listeners will find inspiration in her story and practical insights into reclaiming their lives and embracing their identities after trauma. The conversation between Jim Burgoon and Martha Gloria Kartaoui dives deep into the multifaceted realm of trauma recovery, focusing on Martha’s journey from a cult environment to becoming a transformational coach. Martha shares her profound realization that trauma recovery is not simply about moving on; it\u0027s about actively engaging with one’s pain and finding ways to heal it. She discusses the importance of community and the various modalities she utilized throughout her healing, including therapy and holistic practices. The episode also tackles common misconceptions surrounding cults, emphasizing that individuals often seek belonging and purpose, which can lead them into harmful environments. Martha’s insights highlight the significance of maintaining one’s autonomy and the red flags to watch out for when engaging with any group or movement. This rich dialogue not only empowers listeners to reflect on their journeys but also provides practical wisdom on navigating the complexities of healing, emphasizing that grace, patience, and self-love are essential components of the recovery process. Key Takeaways Healing Begins with Choice: Recovery from trauma starts when you decide to stop letting pain define you. The Power of Small Wins: Even the smallest victories in healing can spark massive transformation. Embracing Grace: Learn how extending your grace is essential to overcoming setbacks and staying the course. Red Flags in Leadership: Martha shares insights on spotting controlling, cult-like behaviors in communities. Faith and Reconnection: Rebuilding a personal relationship with God can be a cornerstone of lasting healing. martha kartaoui Martha Glory Kartaoui is a resilient and courageous warrior who has transformed her life from being a Cult Survivor to becoming an influential voice and leader in the wellness industry. As the owner of PIC Wellness, LLC, and the President of her non-profit Let Glory Shine, she is dedicated to helping others achieve their best overall holistic health Mind, Body and Spirit. Martha is also an Amazon Best Selling International Author, a dynamic speaker, a life visionary, and a skilled healing workshop facilitator. Her unique blend of professional training, personal experience, and spiritual wisdom enables her to walk alongside survivors and support profound warrior transformations. Martha Kartaoui is a beacon of hope and inspiration, offering invaluable accountability, motivation and support to those seeking to reclaim their lives in order to thrive in their own journey towards self-discovery and divine fulfillment. martha\u0027s Facebook page martha\u0027s Website Copyright 2024 Jim Burgoon",
      "release": "2024-12-02T11:00:00Z",
      "duration": "00:28:59.6900000",
      "explicit": false,
      "spotifyId": "1l6TSSHeomflvoP7UOk9SM",
      "appleId": 1000678888656,
      "youTubeId": "5b1IjWcOTIc",
      "subjects": [
        "Samanta Roy Institute of Science and Technology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1l6TSSHeomflvoP7UOk9SM",
        "apple": "https://podcasts.apple.com/podcast/cult-survivor-turns-trauma-into-transformative-coaching/id1767405179?i=1000678888656",
        "youtube": "https://www.youtube.com/watch?v=5b1IjWcOTIc"
      }
    }
  ]
}