{
  "id": "414c8ac7-6998-40e3-8553-cbae40d26303",
  "name": "Grappling with the Gray",
  "spotifyId": "45dZ36DR6SxpFGGJSaXPui",
  "appleId": 1628999329,
  "youTubeChannelId": "UCknNpqn_tdS5TfJzDeHuarg",
  "episodes": [
    {
      "id": "99adf295-8b2e-4fa1-ac0c-bf51a2dd5657",
      "title": "Grappling with the Gray #137: Can we escape the cult of partisanship?",
      "description": "Has political ideology crossed the line into cult mentality? That\u0027s the question that drives the conversation when special guest Daniella Mestyanek Young joins me for this week\u0027s episode of Grappling with the Gray. Here is our topic: After the September 10 assassination of Charlie Kirk, reports filled the headlines of tweets and posts celebrating his murder. One teacher in Pennsylvania allegedly shared a post on social media calling Kirk a \u0022racist, xenophobic, transphobic, islamophobic, sexist, white nationalist mouthpiece.\u0022 Days later, a Brazilian comedian wrote that Kirk had \u0022died too late\u0022 and said that he \u0022was the reason for a Nazi demonstration where they marched in tribute to him. Good riddance!\u0022 These and similar comments were widely condemned, especially by conservative Republicans. Three months later, President Donald Trump responded to the murder of Rob Reiner, calling him “deranged,” “very bad for our country,” and suggesting that his death was \u0022reportedly due to the anger he caused others\u0022 by his \u0022raging obsession\u0022 with Trump. Far more Democrats than Republicans took exception to his words. Is this an example of cult mentality in American politics? Donald Trump was not the first to employ extremist rhetoric, but he has certainly accelerated its normalization. If we can’t agree on the need for civil discourse, how can we possibly work together to maintain a functioning society? How does cult mentality encourage and justify this kind of behavior, as well as the double standards that make it acceptable in the minds of each side even as they condemn it from the other? And what can we do about it? Meet this episode’s special guest: Daniella Mestyanek Young is a US army combat veteran, Harvard scholar, TEDx speaker, and bestselling author. Her new book, The Culting of America, examines how cult tactics have quietly infiltrated American life, especially politics, and why they are so effective at keeping followers in line even when leaders disregard their own principles and values.",
      "release": "2026-02-11T10:00:00Z",
      "duration": "01:04:13.0610000",
      "explicit": false,
      "spotifyId": "2vnl5DxwMhmz93pv1uIGdu",
      "appleId": 1000749221110,
      "youTubeId": "BfqEVqxzAN8",
      "subjects": [
        "Children Of God",
        "Cult-Expert",
        "_America",
        "Political Cult",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2vnl5DxwMhmz93pv1uIGdu",
        "apple": "https://podcasts.apple.com/podcast/grappling-with-the-gray-137-can-we-escape/id1628999329?i=1000749221110",
        "youtube": "https://www.youtube.com/watch?v=BfqEVqxzAN8"
      }
    }
  ]
}