{
  "id": "9985ccb5-4f91-47b8-ae95-84f01961958d",
  "name": "Gravitas Documentaries",
  "episodes": [
    {
      "id": "dac33c29-6cd1-4245-8505-d9a7ef4032e9",
      "title": "The Source Family - The Rock and Roll Cult That Shocked the Nation - SXSW - FULL DOCUMENTARY",
      "description": "It\u0027s 1972, a time of social upheaval, radical fervor, and the rise of new religions and communes across the country. The Source Family considers themselves an \u0022Aquarian tribe,\u0022 a secretive but outlandish group of 140 beautiful young people, devotees of a controversial Hollywood restaurateur-turned-spiritual leader who has 14 wives, drives a Rolls Royce and fronts his own rock band, calling himself \u0022Father Yod.\u0022 The Family are local legends. By day, they operate the Source restaurant, which serves organic cuisine to John Lennon, Warren Beatty and many influential figures of the time. Behind closed doors in their Hollywood Hills mansion, the Family convene and meditate under the guidance of their “spiritual father,” Yod. He initiates his “sons and daughters” into a variety of extreme practices, which cause controversy with local authorities. The Family flees to Hawaii, eventually leading to their dramatic demise.2012 SXSW Film Festival; Nominated; SXSW Grand Jury Award; Documentary Feature#documentary #cult #fullmovie #1970s #sourcefamily #music #spirituality #rocknroll Directed By: Maria Demopoulos \u0026 Jodi WilleStarring: The Source FamilyWANT TO SEE MORE MOVIES LIKE THIS FOR FREE here on YouTube? Just visit our other channel for hundreds of free movies and documentaries!https://youtube.com/@gravitasventuresVOD | https://youtube.com/@gravitasadrenaline | https://youtube.com/@gravitasunexplained",
      "release": "2024-03-06T10:46:56",
      "duration": "01:39:07",
      "explicit": false,
      "subjects": [
        "The Source Family"
      ],
      "urls": {
        "internetArchive": "https://archive.org/details/youtube-HONVdFC9ork"
      }
    }
  ]
}