{
  "id": "3308e876-74ed-46e4-b10e-4863172a9937",
  "name": "Grief is a Sneaky Bitch",
  "spotifyId": "0JAu9U0t4YT5D6n9y0Dtlp",
  "appleId": 1474558908,
  "episodes": [
    {
      "id": "f009d26c-e34a-4304-9e5e-a8bf801feaa4",
      "title": "Ronit Plank | When She Comes Back",
      "description": "Today, Ronit plank is a successful writer of fiction and non-fiction, an editor, a podcast host of not 1 but 2 shows, and a teacher. But long before she became all those things, she was a young girl born on a Kibbutz in Israel, shuffled across the globe to Seattle by 2 unhappily married parents. Soon after, her father left to start a new family on the east coast. And then the following year, her mother dropped her and her younger sister on his doorstep - announcing she was headed to India. Her mother was sad and lost and was given cassette tapes by a guru called Bhagwan Shree Rajneesh – the man we now know as the leader of the cult featured in the Netflix Documentary Series Wild Wild Country. But back then Ronit didn’t know any of that, she just knew that she and her sister were abandoned repeatedly, leaving her with a deep well of grief that no one was naming as loss. In her extraordinary memoir, When She Comes Back, she explores the revelations, and she discovered writing her memoir. Insights about the nature of loss when the person is very much alive. In our conversation today, we’re both deeply moved and reflective about the adultification that happens when we grow up in disorganized and chaotic households, and the importance of honoring with care the versions of us that never got what we deserved, a safe and loving home. I can’t wait for you to spend time with Ronit today. I know for sure you will be both touched and inspired by her story. About the Guest \u0026 Resources Ronit Plank is an award-winning writer, teacher, and podcaster who hosts Let\u0027s Talk Memoir featuring interviews with memoir writers and teachers. Her writing has earned Pushcart Prize, Best Microfiction, and Best of the Net nominations and has appeared or is forthcoming in The Atlantic, Writer’s Digest, The Washington Post, Hippocampus, The Rumpus, The New York Times, Poets and Writers, andelsewhere. WHEN SHE COMES BACK, her memoir about the loss of her mother to the guru Bhagwan Shree Rajneesh and their eventual reconciliation, was named Finalist in the 2021 Housatonic Awards,the 2021 Indie Excellence Awards, and was a 2021 Book Riot Best True Crime Book. Her short story collection HOME IS A MADE-UP PLACE won Hidden River Arts’ 2020 Eludia Award and the 2023Page Turner Awards for Short Stories. She earned an MFA in Nonfiction Writing at Pacific University, is Creative Nonfiction Editor at The Citron Review, and lives in Seattle with her family where she editsmemoir manuscripts and teaches workshops. You can learn more at RonitPlank.com, follow her on Instagram, and subscribe to her Memoir Moments newsletter here. Host Lisa Keefauver’s forthcoming book Grief is a Sneaky Bitch: An Uncensored Guide to Navigating Loss IS NOW AVAILABLE FOR PRE-ORDER on Amazon.com, Barnes \u0026 Noble or Bookshop.org. Drop her a DM on Instagram @lisakeefauvermsw to let her know you did and she’ll send you a party invite to her Book Launch Celebration Visit www.lisakeefauver.com to learn more about Lisa, sign up for her Not-So-Regular Newsletter, register for an upcoming online grief workshop or watch her TEDx talk, Why Knowing More About Grief Can Make it Suck Less. Oh, and this season, if you want to WATCH the show, you can now watch it on YouTube @lisakeefauvermsw Recorded April 5, 2024. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-09T11:15:29Z",
      "duration": "01:19:32.5190000",
      "explicit": false,
      "spotifyId": "5uBLIbBvfdBKiVN079ROvo",
      "appleId": 1000651891053,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5uBLIbBvfdBKiVN079ROvo",
        "apple": "https://podcasts.apple.com/podcast/ronit-plank-when-she-comes-back/id1474558908?i=1000651891053"
      }
    }
  ]
}