{
  "_ts": 0,
  "id": "a6d06abb-df12-484c-9742-b6f0b1d9c37e",
  "name": "Grizzly True Crime",
  "youTubeChannelId": "UCY04IfK5QlS8nWDU22bEXig",
  "episodes": [
    {
      "id": "782e360b-1f46-461b-a6f2-80f5932f56df",
      "title": "Alleged Online Cult of Rashad Jamal with Mike King (Profiling Evil)",
      "description": "The University of Cosmic Intelligence is allegedly an online cult, started by Rashad Jamal, 37, and has been linked to murders and missing people. There are six people missing, including two children, in Missouri, who have not been seen since August 2023, and their families are extremely concerned. \r\n\r\nLet\u0027s dive into what this alleged cult is all about, who Rashad Jamal is, and let\u0027s do our best to share information that might help locate the missing people. \r\n\r\nToday we are joined by Mike King from Profiling Evil, a cult expert with decades of law enforcement experience. \r\n\r\nMike\u0027s website: https://profilingevil.com\r\nMike\u0027s channel: https://www.youtube.com/@ProfilingEvil\r\nMike\u0027s books: https://profilingevil.com/store \r\n\r\nThe only Grizzly link you need: https://grizzlytruecrime.com  \r\n2nd channel: https://www.youtube.com/@grizzlytruecrimeshorts\n\nSources: \nhttps://youtu.be/5yVfYA0XiUk?si=bBZhBH10yWCrXCNQ\nhttps://youtu.be/nb0Wy25he8s?si=LooF_HRESooGnOEu\n\r\nDisclaimer: All Grizzly True Crime content is for adults only and may contain themes that some individuals find triggering, offensive or disturbing.\r\nViewer discretion is advised. This Video is protected under copyright laws. The views and opinions expressed in this video are personal and do not necessarily reflect the official policy or position of any other agency, organization, employer, or company. Assumptions made in the analysis are not reflective of the position of any entity other than the creator(s). These views are subject to change, revision, and rethinking at any time and are not to be held in perpetuity. All information is provided on an as-is basis. It is the reader’s responsibility to verify their own facts. Sources used to collect this information include various public media/news sites, interviews, social media accounts, and court documents.\r\n\r\nStay Safe!\r\nGisela K.",
      "release": "2024-03-04T21:50:53Z",
      "duration": "01:10:15",
      "explicit": false,
      "youTubeId": "LYAprdDwxAw",
      "subjects": [
        "University of Cosmic Intelligence"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LYAprdDwxAw"
      }
    }
  ]
}