{
  "id": "ea3f765e-d521-4808-8e63-81c72575a67a",
  "name": "Growing Up In A Cult",
  "youTubeChannelId": "UCEmtkFhnBt1oas6MS3JoXlA",
  "episodes": [
    {
      "id": "78142f62-326a-48b0-a5c8-f2c55138015d",
      "title": "Being Homeschooled In A Cult Ruined My Social Life | IBLP | High Control | Sibling Monitoring",
      "description": "In this video I discuss my experience in a high control environment where females are forced to be reserved while males are encouraged to be leaders and outspoken. I also discuss some of my experiences with a brother reporting my actions to our parents and being rewarded for that while I had to suffer silently. Over a decade later there are still huge gaps in social skills among males vs females in my family, with females suffering more long term. \n\nAll content discussed is my personal opinion and does not reflect anyone else, including people I grew up with. Everyone has their own story to tell, so I share anecdotes to reflect on my experience, but they are not the full story for anyone else mentioned.\n\nEven within the same cult, there were variations depending on the leaders in your area, so I do not represent all experiences within IBLP\n\nTW: \nThis video discusses sensitive topics which may include psychological and emotional abuse, neglect, cult dynamics, homeschooling in controlling environments, and mental health struggles. Viewer discretion is strongly advised.\n\nThe purpose of this video is to raise awareness and share personal experiences in a respectful, educational manner. If you are a survivor or sensitive to these subjects, please take care of yourself—it\u0027s okay to pause or step away if needed. Mental health support resources are listed below. You are not\nalone. \n\nMental Health Resources:\n■ Suicide hotline: Call or text 988 to talk with someone confidentially, or go to https://988lifeline.org/\n■ Mental Health America: https://mhanational.org/\n■ National Alliance on Mental Illness: https://www.nami.org/",
      "release": "2026-01-04T00:47:13Z",
      "duration": "00:12:53",
      "explicit": false,
      "youTubeId": "IX4CUsrtXno",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IX4CUsrtXno"
      }
    },
    {
      "id": "7afb1059-e423-4928-be9a-6e871eab8d25",
      "title": "The Golden Child Effect | Raised in A Cult | IBLP",
      "description": "In this video I discuss more about my upbringing in IBLP within a fundamentalist family. All opinions are my own. I can’t speak fully on the experiences of others who were raised in IBLP, though I do highlight others in my videos such as siblings as we experienced similar challenges at times.",
      "release": "2025-07-24T11:10:13Z",
      "duration": "00:11:37",
      "explicit": false,
      "youTubeId": "9Ep9vHk4kVU",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9Ep9vHk4kVU"
      }
    },
    {
      "id": "920ac2e8-a67c-4a49-aa45-e4ec915fbe99",
      "title": "The Hidden Consequences of Cults - IBLP",
      "description": "Ever wondered why cults end up attracting people and then manage to keep a large following intact? Bait and switch is one way to put it.",
      "release": "2024-06-30T22:35:11Z",
      "duration": "00:00:55",
      "explicit": false,
      "youTubeId": "rNd0WOXIbmI",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rNd0WOXIbmI"
      }
    }
  ]
}