{
  "_ts": 0,
  "id": "6f9265c9-d6ab-4e62-8068-201122ce5662",
  "name": "Uncomfortable Conversations Podcast The Untold Stories of the 3HO Kundalini Yoga Community",
  "spotifyId": "2Z3MLieBS8BDflDeAa5uCZ",
  "appleId": 1542075885,
  "youTubeChannelId": "UCsm7eoVdKGZoD8Z2iyGxetA",
  "youTubePlaylistId": "PLSX7_S7LsTYjyB4_bucgLBKDngo6i78_L",
  "episodes": [
    {
      "id": "a8ca3baf-108e-42a5-a519-aa14f188e39f",
      "title": "Episode 68: Spanish Channel for 3HO Survivor Stories",
      "description": "Rodolfo Caro (formerly Bhajanjeet Singh) became a KY instructor in 2004 and integrated his home, family and spa business into the lifestyle brand of promoting KY and Sikh Dharma over the next 18 years in Guadalajara Mexico. He was even a IKYTA Mexico board member until 2018  when he began to disconnect from his local sangat community because of incongruency. In 2020 when the book Premka came out he began to confront the dark side of KY for real.  After the Beyond the Cage FB group, reading the AOB report, listening to the UCpodcast, and all the material that became available, Rodolfo began deprogramming and figuring out his own practice, totally removing himself from KY Cult. He’s a Bodyworker and massage therapist and Spa owner of Canto Yoga \u0026 Spa in Guadalajara México. He’s a content creator for health and mind and has collaborated in 2024 as a book translator for \u0022Under the Yoga Mat\u0022 spanish versión for Latin America. He’s the Co-Creator of the youtube channel for the continuity of conversations in spanish, for uncomfortable conversations podcast. \nIvan Sanchez (Siri Om Singh) was in the KY Cult from 2006-2021. He was a kundalini instructor for 11 years, taking his first teacher Training by 2009. His mentors were Tarn Taran Kaur (USA), Shiv Charan Singh (PORTUGAL) and Gurujodha Singh (Mexico) at RaMa Kundalini Yoga school in Mexico City. As an instructor he achieved level II certification in his training as a Kundalini Yoga teacher. He was a member of ATA (Aquarian Teachers Academy) training as a leading trainer to teach courses and training for future teachers. In 2020 he discovered the book White Bird in a Golden Cage by Premka and also came across the book Trust All For Nothing, my time saving Yogi Bhajan by Wahe Guru Kaur and seeing himself reflected in many of the statements of physical and psychological abuse that he finds in these documents, he decides to investigate and realizes that there are thousands of people around the world raising their voices and talking about abuse within the so-called Kundalini Yoga community led by 3HO and KRI.\nNot finding support or coherence in many colleagues, students and teachers in Mexico at that time, he makes the decision to renounce his titles, his classes, his lifestyle and the community. From that moment on, he uses social networks to make complaints and support people who are realizing the manipulation that exists in the \u0022white sect\u0022 as he usually calls it. Ivan has been attacked by people who consider that he is harming the community and the teachings of Yogi Bhajan, however that does not stop him from continuing to raise his voice and helping more and more people to realize the deceptions and manipulation into which they can fall by the misnamed Kundalini Yoga community.\nCurrently, after a process of therapy and with the help of his partner and great friends, he’s managed to heal many emotional wounds. He decided to continue raising his voice, because after 4 years, the current Kundalini Yoga teachers continue to give classes and hold teacher training sessions as if nothing had happened, and that seems extremely dangerous to me for people who are looking for something to feel better about themselves. For this reason, he has partnered w/ Els Coenen and Rodolfo to share information in Spanish in Mexico and Latin America since a lot of guidance is needed due to the language difference with regions such as the United States or Europe.\nUC Podcast Episode 48: Siri Om Singh; Mexico City, Mexico (Started KY 2006 - 2021)\nBook link to Under the Yoga Mat: The Dark History of Yogi Bhajan\u0027s Kundalini Yoga \nAbuse in Kundalini Yoga Website \nGuruNischan is a writer, pleasure activist, and consultant in personal reinvention for unorthodox high achievers. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com and follow her media platform \nConversations You Can Feel  is a reader-supported publication. To receive new posts and support my work",
      "release": "2024-10-15T00:18:36Z",
      "duration": "01:40:47",
      "explicit": false,
      "spotifyId": "5Tyzj63DHo88EK9BbYgpkF",
      "appleId": 1000673095991,
      "youTubeId": "BUQoW5-XQRc",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Tyzj63DHo88EK9BbYgpkF",
        "apple": "https://podcasts.apple.com/podcast/episode-68-spanish-channel-for-3ho-survivor-stories/id1542075885?i=1000673095991",
        "youtube": "https://www.youtube.com/watch?v=BUQoW5-XQRc"
      }
    },
    {
      "id": "418e8cfc-cb0b-49c1-ba73-33e2f2deb393",
      "title": "Eps 67: 3HO Kundalini Yoga Cult(ure) Update w/ GuruNischan - May 2024",
      "description": "This episode is a short update on topics relating to the 3HO/Kundalini Yoga Community including the traumatic finale of the 3HO/Kundalini Yoga Independent Healing and Reparations Program (IHRP), recently filed lawsuits by former 2nd Gen staff members, SSSC Board election chaos, upcoming documentaries to look out for \u002B more. \n\nReferenced in this episode:  Former Staff Lawsuit, SSSC video of Jagat Guru as new CEO of KRI, Upcoming Documentaries, IHRP End of Program Update and speaking restrictions lifted, and MORE go to:  https://abuse-in-kundalini-yoga.com/news\n\nInternational Cultic Studies Association: Join Els and GuruNischan at the 2024 ICSA Conference in Barcelona Spain July 3 - 6, 2024 (or attend online) https://www.icsahome.com/\n\nLink to Under the Yoga Mat: The Dark History of Yogi Bhajan\u0027s Kundalini Yoga -  https://www.undertheyogamat.com/\n\n_____________\n\nGuruNischan is a writer, trauma-healing activist, and consultant/facilitator of personal reinvention for unorthodox high achievers.  To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com and follow her media platform Conversations You Can Feel - https://gurunischan.substack.com/\n\nTo contribute to this broadcast you can use this link: https://paypal.me/GuruNischanLLC?country.x=US\u0026locale.x=en_US or donate monthly at https://gurunischan.substack.com/\n\nListen to the Uncomfortable Conversations Spotify Playlist: \nhttps://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg\n\nTo be a guest on the podcast, please email GN@GuruNischan.com",
      "release": "2024-05-15T11:26:06Z",
      "duration": "00:45:54",
      "explicit": false,
      "spotifyId": "6hD3i27s86naJgroyqCgVT",
      "appleId": 1000655665096,
      "youTubeId": "Pcrwv5IzRkM",
      "subjects": [
        "Yoga Cult",
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6hD3i27s86naJgroyqCgVT",
        "apple": "https://podcasts.apple.com/podcast/eps-67-3ho-kundalini-yoga-cult-ure-update-w-gurunischan/id1542075885?i=1000655665096",
        "youtube": "https://www.youtube.com/watch?v=Pcrwv5IzRkM"
      }
    },
    {
      "id": "84d0a2e2-4134-4575-a103-04a3a0ebe0e6",
      "title": "Episode 66: Manju Sadarangani - Kundalini Yoga 2020 - KRI Global Teacher Training",
      "description": "Manju Sadarangani was born and raised in India, surrounded by yoga. Her yoga teacher mother insisted on an upbringing informed by yoga and traditional medicine. In her teen years, her deeply spiritual brilliant father joined a Hindu cult, resulting in upheaval resulting in her immigration to the United States with her mother and brother. Manju found yoga in the US to be deeply puzzling. She would try yoga studios and styles of yoga in an effort to feel the spiritual solace of her childhood yoga practice, but felt extremely excluded at American yoga studios. Through most of her adult life, she avoided yoga, and practiced it only when she visited the country of her birth. In 2019, serendipity led her to a kundalini yoga class. She was intrigued by this unfamiliar style of yoga which she found absurd and amusing, but was soothed by the elements of Surat Shabd that she recognized in kundalini yoga practice. She enjoyed the element of play and creativity in her kundalini meditations, but found herself often flummoxed by the pastiche mantras and practices. She was offended by some practices (like excerpts of Japji inserted into kriyas) - but when she asked questions of kundalini teachers, they were not able to give her answers that felt logical or grounded in any yoga discipline. Her teachers encouraged her to take teacher training with KRI, telling her that was where she would get answers. Manju was understandably reluctant, especially after she read the book Premka. In 2020, she was approached by representatives of KRI, who recommended a brand-new global teacher training program. This new TT was advertised as trauma-informed, inclusive, egalitarian - a symbol of the new direction KRI and 3HO were embracing. Manju applied to this new teacher training global cohort. She was one of only three Americans, all women of color. It turned out to be one of the most traumatic and racist experiences of her life. Since then, Manju has relied on her command of languages, academic background in South Asian history, conversations with elders and teachers in India, and cultural background to deeply research, question, retrain, and reform her yoga practice. She connects deeply with the feminist, spiritual and historical foundations of yoga to counter problematic cultural appropriation. Her evolving yoga practice is grounded in a desire for equity, justice, emotional and mental well-being. She brings her spirit of play, body positivity and radical self-love to her yoga practice, acknowledging that her yoga journey makes her an inconvenient outsider the art of manju manjusadarangani.com Song credit: Vaishnav Janto Tene Kahiye by M.S. Subbalakshmi http://www.UndertheYogaMat.com ______________________ GuruNischan is a trauma-healing activist, and consultant in personal and professional reinvention. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com Follow her media platform at Conversations You Can Feel To contribute to this broadcast you can use this link : Listen to the Uncomfortable Conversations Spotify Playlist:",
      "release": "2023-09-22T19:48:53Z",
      "duration": "02:25:14.5360000",
      "explicit": false,
      "spotifyId": "4uCiql99lG6oNGMq2dffZc",
      "appleId": 1000628861496,
      "youTubeId": "ckKc0WJhDKc",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4uCiql99lG6oNGMq2dffZc",
        "apple": "https://podcasts.apple.com/podcast/episode-66-manju-sadarangani-kundalini-yoga-2020-kri/id1542075885?i=1000628861496",
        "youtube": "https://www.youtube.com/watch?v=ckKc0WJhDKc"
      }
    },
    {
      "id": "8a6bf537-a933-41b3-89e5-640f9face608",
      "title": "Episode 65: Shabd Singh {Born and raised in 3HO 1987 - 2016}",
      "description": "Shabd Singh was born and raised in 3HO Herndon, VA in 1987. His parents are Gurutrang Singh and Gurumata Kaur. He attended MPA from 1999-2005, was in the Eugene, Oregon ashram from 2006-2012, and taught at Miri Piri Academy in India as an economics teacher from 2012-2014. It’s been a slow but gradual disconnect from 3HO, and he fully disconnected in 2016. In 2017 he became politically active with Democratic Socialists of America and began to work in progressive politics eventually working on the Bernie Sanders 2020 Presidential Campaign. He now lives in Washington DC with his wife Sukhmani Kaur and does work in climate advocacy for Al Gore\u0027s non-profit organization The Climate Reality Project. You can find him on Instagram at shabd.one and the platform (formally known as) Twitter at @shabdsingh Song credit: Robin Hood Theory by GangStarr Listen to the full song on the Uncomfortable Conversations 3HO Spotify Playlist : To be a guest on the podcast, email GN@GuruNischan.com GuruNischan is a writer, trauma-healing activist, and consultant in personal and professional reinvention. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com You can follow her media platform - Conversations You Can Feel - To contribute to this broadcast use this link:",
      "release": "2023-09-07T19:13:11Z",
      "duration": "03:09:15.1430000",
      "explicit": false,
      "spotifyId": "5TvFxE8TvWHlI7bODodkTl",
      "appleId": 1000627118636,
      "youTubeId": "-ov_KHujhew",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TvFxE8TvWHlI7bODodkTl",
        "apple": "https://podcasts.apple.com/podcast/episode-65-shabd-singh-born-and-raised-in-3ho-1987-2016/id1542075885?i=1000627118636",
        "youtube": "https://www.youtube.com/watch?v=-ov_KHujhew"
      }
    },
    {
      "id": "dca91d70-5b7f-45ad-b081-5fa90deadb2d",
      "title": "Episode 64: Mel Hofmann {1970 - 1972; San Rafael, CA}",
      "description": "Mel Hofmann, at the time was Melanie Calhoon started studying Kundalini yoga classes in 1970, at the age of 15 in Berkeley, CA . The local area ashram at the time was known as the “Banana Ananda” ashram in San Rafael, CA. She moved into the ashram in the Fall of 1971 at the age of 16 years old. Shortly thereafter, the name of the ashram was changed to Hargobind Sadan. Baba Bert, later named Sat Santokh Singh was the head of the ashram. She lived in the ashram until June of 1972, when her roommate, Jeannie, who later became known as GuruTarethKaur (Jivan Jhoti Kaur) was arranged to be married Robert Zwaag (also known as, GuruTarethSingh). The abrupt marriages, name changes and overall shift in the “lifestyle” led Mel to pursue her own path soon after. She\u0027s was married to Stephen Hofmann and had a daughter who is currently 32 years old. He had cerebral palsy and is featured with our daughter Emily in the documentary, Crip Camp. He passed away in 2017. She’s had a long time relationship to Kundalini energy, healing, and her own CPTSD recovery. Today Mel happily married to Jayne Roseman for 25 years. She’s a professional photographer, fine artist and energy healer. You can learn more about her art at melhofmann.com Song Credit: Truly, Madly, Deeply by Savage Gardens ______________________________________ GuruNischan is a trauma-healing activist, and consultant in personal and professional reinvention. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com and/or follow her media platform Conversations You Can Feel - https://gurunischan.substack.com/ To financially contribute to this broadcast you can use this link : Listen to the Uncomfortable Conversations 3HO Spotify Playlist : To be a guest on the podcast, email GN@GuruNischan.com",
      "release": "2023-08-31T14:54:00Z",
      "duration": "01:41:49.3830000",
      "explicit": false,
      "spotifyId": "4HTz69uBKiVNYN3qLdf4Vb",
      "appleId": 1000626348089,
      "youTubeId": "PEUgvzQfA3A",
      "subjects": [
        "3HO",
        "Psychology",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4HTz69uBKiVNYN3qLdf4Vb",
        "apple": "https://podcasts.apple.com/podcast/episode-64-mel-hofmann-1970-1972-san-rafael-ca/id1542075885?i=1000626348089",
        "youtube": "https://www.youtube.com/watch?v=PEUgvzQfA3A"
      }
    },
    {
      "id": "538bfd08-cc94-4eef-91b4-f42ccc3ae1be",
      "title": "Episode 63: Siri Whitecrow (1972 - 1988, Anchorage, Alaska)",
      "description": "Siri Whitecrow, was born Elias Seneca Whitecrow in 1972 in Juneau, Alaska. His mom, Sat guru Kaur, joined 3HO with his older sister, Siri Kaur, in 1976 and his name was changed to Siri Singh Khalsa. His early life was spent between two different ashrams in Anchorage, Alaska, then in 1979 he was sent to Española New Mexico at 7 years old, living with two different families. In 1981 he was sent to the newly (not yet) established India program GNFC, initially being sent to the girls school because he was so young and only in 3rd grade. After four years in India, and tons of horrific abuse, and plenty of righteous resistance, he was kicked out of that school and sent back to the USA. He spent half a year at Amritsar Academy in Albuquerque, New Mexico, where he was eventually asked to “not return”. He ended up in Los Angeles, near his mom and close to the ashram, but by 1988 he left 3HO/Sikh Dharma/Kundalini Yoga completely, never looking back. Graffiti became a huge part of his life and currently still is. His Graffiti name is ANGER and he runs one of the biggest graffiti crews in the world which began in 1993 when his life was forever altered when his mentor was hit by a train, and he was shot 4X by a Los Angeles police officer. He currently lives in Los Angeles, is married with two boys and continues to navigate his life through art, and creativity. You can learn about him and his Graffiti crew by supporting his work and watching the documentary “Can’t Be Stopped” on Amazon. You can follow and support his work @angercbscrew @cbscrew @defendmelrose @iwuzherefirst Link to Documentary film: https://www.amazon.com/Cant-Be-Stopped-Cody-Smith/dp/B0B 8X5DG7Y/ref=sr_1_1?crid=3LI3AK16WUAX1\u0026keywords=cant\u0026#43;be\u0026#43;stopped\u0026#43;documentary\u0026qid=1692240095\u0026s=instant-video\u0026sprefix=cant\u0026#43;be\u0026#43;stopped%2Cinstant-video%2C461\u0026sr=1- Song credit: Anger by Downset ___________________________________ GuruNischan is the creator and host of the Uncomfortable Conversations Podcasts. She\u0027s a trauma-healing activist, and consultant in personal and professional reinvention. To learn more about her reclamation and recovery work, please subscribe to GuruNischan.com Follow her media platform Conversations You Can Feel - To contribute to this broadcast you can use this link : Listen to the Uncomfortable Conversations Spotify Playlist: To be a guest on the podcast, please send an email to GN@GuruNischan.com",
      "release": "2023-08-23T19:41:58Z",
      "duration": "02:15:42.8880000",
      "explicit": false,
      "spotifyId": "49Ltv89RlCwPPughOUANMy",
      "appleId": 1000625457447,
      "youTubeId": "4oOM62YLPOQ",
      "subjects": [
        "3HO",
        "Yoga Cult",
        "Sikhism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/49Ltv89RlCwPPughOUANMy",
        "apple": "https://podcasts.apple.com/podcast/episode-63-siri-whitecrow-1972-1988-anchorage-alaska/id1542075885?i=1000625457447",
        "youtube": "https://www.youtube.com/watch?v=4oOM62YLPOQ"
      }
    },
    {
      "id": "6cfecf07-dff6-4fbe-9d1b-61f376724f4f",
      "title": "Episode 62: Guruganesha Singh Khalsa (1972 - 2023) - Washington D.C. and Herndon, Virginia Ashrams",
      "description": "Guruganesha Singh grew up in Natick MA, 18 miles west of Boston. Graduated high school class of 1968. In Feb 1972, he attended his first KY class at the boathouse at Smith College in Northampton MA, after seeing YB\u0027s tratakum pic on a flyer in the Student Union. Soon after he attended a weekend KY retreat at the Montague (montagew) in MA with Guru Shabd Singh. Very soon thereafter he moved into the Worcester (wooster)MA Ashram near Clark University where he was a senior year in college. The first week of Jan. 1973 he moved into Ahimsa Ashram on Q St. Washington DC, where he became the dishwasher at the Golden Temple Restaurant for many months. He was arranged to be married to Gurudarshan Kaur originally from Tuscon, AZ in May 1977. They had their son, Akal Sahai Singh in April 1978. In 1986, at age 8 years old, their son, Akal Sahai went to India for one year, which caused a rupture in their marriage, and Gurudarshan started divorce proceedings. In 1987 it was suggested by the head of the ashram that he marry Mata Mandir Kaur from the DC ashram (and they are still married 36 years later) He worked for all the DC ashram businesses thru 1989 when he resigned from the “family” businesses and started his own business Sandler Sales Institute, a sales training in the high-tech sector. In Jan 2000 he founded Spirit Voyage Music and started recording and touring with Snatam Kaur for the next 11 years. In 2011 he and Snatam parted ways, and he started the GuruGanesha Band. The revelations of 2020 exposed what he held at a distance for far too long, and the undeniable truth created a landslide. Most recently, after the results of the 2023 Siri Singh Sahib Corporation (SSSC) elections, he immediately resigned from Khalsa Council and the Sikh Dharma Ministry. Song credit: Landslide by Guruganesha Listen to the Uncomfortable Conversations Spotify Playlist: ________________________ To be a guest on the podcast, please email GN@GuruNischan.com Follow my work at www.GuruNischan.com Contribute to this work at www.paypal.me/gurunischanllc Book website link to Under the Yoga Mat: The Dark History of Yogi Bhajan\u0027s Kundalini Yoga - https://www.undertheyogamat.com/",
      "release": "2023-08-17T03:02:13Z",
      "duration": "02:58:55.0480000",
      "explicit": false,
      "spotifyId": "3tgWC4g1gQjjkpjQ75lIYT",
      "appleId": 1000624715354,
      "youTubeId": "wGS0OJYe6pQ",
      "subjects": [
        "3HO",
        "Sikhism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3tgWC4g1gQjjkpjQ75lIYT",
        "apple": "https://podcasts.apple.com/podcast/episode-62-guruganesha-singh-khalsa-1972-2023-washington/id1542075885?i=1000624715354",
        "youtube": "https://www.youtube.com/watch?v=wGS0OJYe6pQ"
      }
    },
    {
      "id": "c0a48df2-b147-40de-86f3-94a7189ede68",
      "title": "Episode 61: Ravi Singh {Chicago/New York City - 1973 - 1999} - Evolving Kundalini Yoga",
      "description": "Ravi Singh began practicing Kundalini Yoga in 1973 and lived in the 3HO ashram in Chicago, IL. In 1974 he moved to New York City to be a writer and continued to practice Kundalini Yoga and began teaching. In the late 70\u0027s I had a brief stint as a resident of the 3HO ashram in Brooklyn, NY. He attended every Summer and Winter Solstice gathering from 1976 to 2000 and before 1999 would typically teach Kundalini Yoga at those events. In 1999 he discovered that YB had propositioned one of my students at Women\u0027s Camp. That was when the floodgates opened and the scope of what was going on behind the scenes became abundantly clear. When he attempted to alert people he was summarily kicked out of 3HO. His state of mind since then has been one of personal liberation, i.e., relief that he doesn’t have to continue to try to be someone he’s not. It became more obvious over time that there\u0027s no room in an organization like 3HO for artists, autonomous beings, or independent thinkers. Ravi Singh is Author (with partner Ana Brett) of the Kundalini Yoga Book - Life in the Vast Lane. He\u0027s been teaching yoga for 45 yrs. He is Founder of Evolving Kundalini, which was created via the need for a safe space for Kundalini Yoga Teachers to gather and process. EK is now a non-profit dedicated to ethics in yoga, and the forward evolution and the up-leveling of all things Kundalini. Song credit: The Revolution Starts Now by Steve Earle. _______________________________ GuruNischan is a writer, trauma-healing activist, and consultant in personal and professional reinvention. Learn more about her reclamation and recovery work at www.GuruNischan.com To make a one time or monthly contribution to this broadcast you can use this link : Listen to the Uncomfortable Conversations Spotify Playlist:",
      "release": "2023-08-10T23:34:44Z",
      "duration": "02:06:33.3200000",
      "explicit": false,
      "spotifyId": "5Eo4pQy2MdWJr8BoN8QleG",
      "appleId": 1000624100035,
      "youTubeId": "T759IqhmhmY",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Eo4pQy2MdWJr8BoN8QleG",
        "apple": "https://podcasts.apple.com/podcast/episode-61-ravi-singh-chicago-new-york-city-1973-1999/id1542075885?i=1000624100035",
        "youtube": "https://www.youtube.com/watch?v=T759IqhmhmY"
      }
    },
    {
      "id": "5da2c023-8f6d-462c-aec6-7af4ba08d3dd",
      "title": "Episode 60: Els Coenen (Ravinder Kaur; Belgium, 2008 - 2018)",
      "description": "Els Coenen (formerly Ravinder Kaur) lives in Belgium. She was 49 when she took her first Kundalini Yoga class, immediately fell in love with it and became a teacher in 2008. She taught Kundalini Yoga for ten years, gave multiple classes a week, organized workshops and teacher training programs in Belgium and East-Africa and assisted in them. Every year she went to the European Yoga Festival, had a boot at the bazar to collect funds for the seva-based teacher training programs in East-Africa, combining this work with a job in the Telecom sector. She organized a Sat Nam Rasayan training in Belgium. In 2013, two women were sexually abused by an SNR instructor. Because Els insisted that the harm would be recognized, and action would be taken to prevent future abuse, she was excommunicated by Guru Dev Singh master of this healing technique and student of Yogi Bhajan, and Belgium was declared \u0022a no-go-zone\u0022 for SNR for two years. From 2010 till 2018 Els presided the Belgian Federation of Kundalini Yoga and represented her country at an international level. Disillusioned by many things she stopped all Kundalini Yoga related activities in 2018. When in 2020 the book Premka triggered many survivors to tell their stories, Els stepped in again, hoping that the time for transparency and clarity had come. She was part of an advisory team of the Compassionate Reconciliation Program but stepped out at the end of 2022 as she experienced it as window dressing. In April 2021 after she read or listened to survivor stories on many different platforms and had watched hours and hours of Uncomfortable Conversations, she contacted GuruNischan to collaborate. She made extracts of the interviews and put them together on a website (abuse-in-kundalini-yoga.com) to allow people with less free time to be informed. Now, she has written a book in partnership with GuruNischan, including voices of survivor stories called Under the Yoga Mat: The Dark History of Yogi Bhajan’s Kundalini Yoga. Song Credit: Because of You – by Gustaph The book can be found on the website below for platforms available for purchase in Europe, USA and many other countries throughout Asia as well. www.undertheyogamat.com www.abuse-in-kundalini-yoga.com You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2023-07-18T00:36:59Z",
      "duration": "02:17:29.2660000",
      "explicit": false,
      "spotifyId": "7LAywKncxUr530nPLkcLGs",
      "appleId": 1000621457979,
      "youTubeId": "TPzq4Q2yi5M",
      "subjects": [
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LAywKncxUr530nPLkcLGs",
        "apple": "https://podcasts.apple.com/podcast/episode-60-els-coenen-ravinder-kaur-belgium-2008-2018/id1542075885?i=1000621457979",
        "youtube": "https://www.youtube.com/watch?v=TPzq4Q2yi5M"
      }
    },
    {
      "id": "8fde6e92-0c79-4e27-9da2-79a8b5743da9",
      "title": "2nd Generation Speaks Out - Open Letter requesting repairs to the Independent Healing and Reparations Program",
      "description": "Over 100 Second Generation voices came together to craft an Open Letter requesting repairs to the Independent Healing and Reparations Program. Summer Solstice and European Yoga Festival are in full promotional swing--let\u0027s talk about it--and the recent resignation of Sahaj Singh Khalsa from the SSSC Board. Listen Read the OPEN LETTER Sign the Petition www.3HO.org - for perusing their website and seeing the Solstice Festivities planned this week. Make a contribution to this podcast HERE Follow me at GuruNischan.com Listen and Subscribe to my latest podcast → Uncomfortable Conversations on Predators in Business, Community, and Culture",
      "release": "2023-06-16T22:18:28Z",
      "duration": "01:13:19.0800000",
      "explicit": false,
      "spotifyId": "0Koc6VSAOfflrNd0nehXjs",
      "appleId": 1000617322543,
      "youTubeId": "QQUSV1iLwmk",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Koc6VSAOfflrNd0nehXjs",
        "apple": "https://podcasts.apple.com/podcast/2nd-generation-speaks-out-open-letter-requesting-repairs/id1542075885?i=1000617322543",
        "youtube": "https://www.youtube.com/watch?v=QQUSV1iLwmk"
      }
    },
    {
      "id": "167c7452-de10-4dfe-8d5a-dd6a426c44e4",
      "title": "Episode 58: Guru Kartar Kaur (Rue) Born and Raised in 3HO: 1997 - 2016; Mexico City, MX",
      "description": "Guru Kartar Kaur (she now goes by Rue) was born into 3HO in Mexico City in 1997 to her parents, Guru Hans Kaur Khalsa and Siri Simran Singh. A couple months after she was born, Rue and her sister, Partmatma Kaur, were brought to New Mexico by her parents, to attend the Summer Solstice where she met YB and received her spiritual name from him. Rue’s parents were originally raised catholic but later converted to Sikhism and joined the 3HO community through her maternal grandmother, Hari Kaur Khalsa, who first became a member of Babaji’s Ashram; the first 3HO Ashram in Mexico City in 1972. Rue participated in Summer Solstice with her family for 7 years straight. At age 11, her parents decided to send her to MPA so that she could practice and learn more about the Sikh religion. Her older sister was first sent away in 2007 and then Rue joined her a year after. They lived in India for 3 years straight and later returned back to Mexico as their parents no longer found the school appropriate and affordable. Rue has now been living in Ontario, Canada for 11 years. She is currently in the works of opening her own art business and will soon be attending college for social service work. Through her own self-healing journey and research, she discovered she has dealt with racism and sexism as a Latina with indigenous ancestry, especially while being part of a religious cult at a young age. Art IG: @lolitsmerue Song: Raveena - Strong _____________________________________ You can DONATE to this broadcast at: http://www.paypal.me/GuruNischanLLC Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg To be a guest on the podcast, please send an email to GN@GuruNischan.com You can Subscribe, follow, and support my provocative truth-telling work at GuruNischan.com and Conversations You Can Feel at https://gurunischan.substack.com/",
      "release": "2023-04-14T21:30:19Z",
      "duration": "02:02:03.2080000",
      "explicit": false,
      "spotifyId": "2AkknVgzjVflILEi6p9iet",
      "appleId": 1000609020919,
      "youTubeId": "Kw2tNDOj-U0",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AkknVgzjVflILEi6p9iet",
        "apple": "https://podcasts.apple.com/podcast/episode-58-guru-kartar-kaur-rue-born-and-raised-in/id1542075885?i=1000609020919",
        "youtube": "https://www.youtube.com/watch?v=Kw2tNDOj-U0"
      }
    },
    {
      "id": "bf9f5ddf-396e-4d91-933f-584cfe65462e",
      "title": "Episode 57: Ratnavali Kaur Khalsa (Ratna); 1996 -2023 - Boulder, CO and Espanola, NM",
      "description": "Ratnavali Kaur Khalsa, (she goes by Ratna) was born in India in August 1996. At a few months of age she was adopted by Guru Nam Kaur Khalsa, of Espanola, NM and Sadhna Singh of Boulder, CO but it took over 1 year to actually get to the USA. In 1997 at 18 months old, she finally arrived to her parents: whom had adopted another child. in 1993, her brother, Guru Raj Singh, who is currently 29. She went to Miri Piri Academy in 2008 at 11 years old for 6th grade. She didn’t return in 2013 for 11th grade because of health reasons. She currently resides in Boulder, Colorado and is a case manager for a mental health clinic. After years of experience in psychology, she found the correlation between what she went through and the “trouble teen industry’ to be very similar. Follow her at @mpa_code_silence You can DONATE to this broadcast at: Cashapp: @gurunischan www.paypal.me/GuruNischanLLC www.gurunischan/substack.com Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg To be a guest on the podcast, please send an email to GN@GuruNischan.com. You can Subscribe, follow, and support my provocative truth-telling work at GuruNischan.com Follow and Listen to my new podcast: www.gurunischan.substack.com",
      "release": "2023-04-08T00:41:04Z",
      "duration": "01:52:41.7030000",
      "explicit": false,
      "spotifyId": "6WobCKVZrVVp9T1pOFkFpZ",
      "appleId": 1000607934023,
      "youTubeId": "b1ku6arbAec",
      "subjects": [
        "3HO",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6WobCKVZrVVp9T1pOFkFpZ",
        "apple": "https://podcasts.apple.com/podcast/episode-57-ratnavali-kaur-khalsa-ratna-1996-2023-boulder/id1542075885?i=1000607934023",
        "youtube": "https://www.youtube.com/watch?v=b1ku6arbAec"
      }
    },
    {
      "id": "1a547c1d-addc-40c7-8b1b-777de0c334bd",
      "title": "Episode 56: The Lasting Impact of 3HO After Childhood - Darci Larocque Part Two: (1976 - 2022)",
      "description": "This is a follow up conversation w/ Darci Laroque to share the lasting IMPACT of childhood neglect, abandonment, and survivalist 3HO training to breed \u0022spiritual-warriors\u0022 that she, and other children of 3HO/Kundalini Yoga, \u0022Sikh Dharma\u0022 received. Hint: It\u0027s NOT Healthy, Happy, or Holy. It\u0027s communal abandonment disguised as consciousness. You can support this broadcast HERE Subscribe to my new podcast - Uncomfortable Conversations on Predators in Business, Community and Culture - You can comment on each episode and subscribe to get it sent to you directly! GuruNischan.com ____________________ From Eps. 55: Darci Larocque, was born Darci Clack in 1971. Her father joined 3HO in 1974 in the New Haven Ashram. Her mom and father were divorced and at the age of 5, she started visiting the ashram in Dorchester, MA, where her father had moved. One day in first grade catholic school, her dad and a friend in full Bana showed up in the middle of a school day and took her. Darci was taken to the Dorchester ashram and even though her mom had full custody, her father wouldn’t give her back. It was the 1970s - her mom, then 23 year old could not fight it so she joined 3HO and moved in. Darci’s dad was Deva Singh. Her mom was Ram Sarn Kaur and her name became Upma. After Children’s Camp in 1978, at 7 years old she was sent to the newly created Guardian Program in New Mexico where she stayed for years; first with one set of guardians then with the heads of the ashram. Which among other things, she had direct ranch access that only in hindsight she can now see as “special”. During this time, her mom moved to the LA ashram and YB engaged her to be married. She was supposed to go to India - but stayed behind with even more YB and ranch access. Her friends (other kids in the guardian program) left in the first group to Mussoorie, India. She ended up in LA and NM for a couple years back and forth. She was fully \u0022 out\u0022 at 13. Her dad stayed in until he died 16 years ago. Her mom left when she was 15 and she continued to work at the Golden Temple and stayed dressed in her turban while she worked. She died 7 years ago. Her whole life in 3HO was her life via her dad and friends. She didn\u0027t choose to “be cut” out. Until she was 40, she considered herself a Sikh. Only in the past two years did she finally recognize that she wasn\u0027t a Sikh. She was raised in a cult. Song : This is Me by Kesha (from The Greatest Showman) You can DONATE to this broadcast at: https://paypal.me/GuruNischanLLC Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg Subscribe to my new podcast - Uncomfortable Conversations on Predators in Business, Community and Culture - https://gurunischan.substack.com/ You can comment on each episode! Subscribe and follow me at GuruNischan.com Books Referenced: CPTSD: From Surviving to Thriving by Peter Walker The Tao of Fully Feeling by Peter Walker The Language of Emotions: What Your Feelings Are Trying to Tell You by Karla McLaren",
      "release": "2023-03-12T19:21:15Z",
      "duration": "02:33:54.0560000",
      "explicit": false,
      "spotifyId": "5rmQUwPkLNmp7NGi9akUD2",
      "appleId": 1000603820975,
      "youTubeId": "1WDcdhjw3fo",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rmQUwPkLNmp7NGi9akUD2",
        "apple": "https://podcasts.apple.com/podcast/episode-56-the-lasting-impact-of-3ho-after/id1542075885?i=1000603820975",
        "youtube": "https://www.youtube.com/watch?v=1WDcdhjw3fo"
      }
    },
    {
      "id": "09a15cff-8603-4992-8feb-30a020439a8e",
      "title": "Episode 55: Darci Larocque (1971 - 2020 Dorchester, MA, Espanola, NM and Los Angeles Ashrams)",
      "description": "Darci Larocque, was born Darci Clack in 1971. Her father joined 3HO in 1974 in the New Haven Ashram. Her mom and father were divorced and at the age of 5, she started visiting the ashram in Dorchester, MA, where her father had moved. One day in first grade catholic school, her dad and a friend in full Bana showed up in the middle of a school day and took her. Darci was taken to the Dorchester ashram and even though her mom had full custody, her father wouldn’t give her back. It was the 1970s - her mom, then 23 year old could not fight it so she joined 3HO and moved in. Darci’s dad was Deva Singh. Her mom was Ram Sarn Kaur and her name became Upma. After Children’s Camp in 1978, at 7 years old she was sent to the newly created Guardian Program in New Mexico where she stayed for years; first with one set of guardians then with the heads of the ashram. Which among other things, she had direct ranch access that only in hindsight she can now see as “special”. During this time, her mom moved to the LA ashram and YB engaged her to be married. She was supposed to go to India - but stayed behind with even more YB and ranch access. Her friends (other kids in the guardian program) left in the first group to Mussoorie, India. She ended up in LA and NM for a couple years back and forth. She was fully \u0022 out\u0022 at 13. Her dad stayed in until he died 16 years ago. Her mom left when she was 15 and she continued to work at the Golden Temple and stayed dressed in her turban while she worked. She died 7 years ago. Her whole life in 3HO was her life via her dad and friends. She didn\u0027t choose to “be cut” out. Until she was 40, she considered herself a Sikh. Only in the past two years did she finally recognize that she wasn\u0027t a Sikh. She was raised in a cult. Song : This is Me by Kesha (from The Greatest Showman) You can DONATE to this broadcast at: https://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg LISTEN TO MY NEW PODCAST AT THIS LINK : Uncomfortable Conversations on Predators in Business, Community and Culture - https://gurunischan.substack.com/",
      "release": "2023-03-05T01:01:52Z",
      "duration": "03:19:34.6630000",
      "explicit": false,
      "spotifyId": "3Ye7hfSfysf7yDwelJX3aH",
      "appleId": 1000602788924,
      "youTubeId": "EVj3-t1gm1w",
      "subjects": [
        "3HO",
        "Yoga Cult",
        "Sikhism",
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Ye7hfSfysf7yDwelJX3aH",
        "apple": "https://podcasts.apple.com/podcast/episode-55-darci-larocque-1971-2020-dorchester-ma-espanola/id1542075885?i=1000602788924",
        "youtube": "https://www.youtube.com/watch?v=EVj3-t1gm1w"
      }
    },
    {
      "id": "90d84dd6-1295-4de7-b002-4606479bcc9a",
      "title": "Episode 54: First Generation Fragility - Two Years in Review",
      "description": "Speaking on \u00221st Generation\u0022 Fragility: The impact it has on our lives in 3HO present day and historically. Listen to \u0022Second Generation\u0022 perspective on how to listen and hear US in real time. Resources: Group therapy with the Trauma Healing Project Email: dmcilwain@healingattention.org https://healingattention.org/ For Somatic Therapy: https://directory.traumahealing.org/ You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2023-01-06T02:28:42Z",
      "duration": "01:35:44.8710000",
      "explicit": false,
      "spotifyId": "2YN4G0D42E5K8Ni6zYLuU8",
      "appleId": 1000592792840,
      "youTubeId": "L-vSDw4VSvA",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2YN4G0D42E5K8Ni6zYLuU8",
        "apple": "https://podcasts.apple.com/podcast/episode-54-first-generation-fragility-two-years-in-review/id1542075885?i=1000592792840",
        "youtube": "https://www.youtube.com/watch?v=L-vSDw4VSvA"
      }
    },
    {
      "id": "d883b7ba-10e3-4003-8406-a64befdcfa95",
      "title": "Episode 53: Goldie (Started KY in Utah; 2001 - 2014)",
      "description": "Goldie found her first Kundalini class at 10 years old in 2001 and by age 12 was regularly attending KY classes at her local community college in rural Utah. She then started going to 4AM sadhana and started a 40 day practice. At age 17, she attended her first Summer Solstice and went every year for the next 5\u0026#43; years and participated in the setup crew. Gradually, Goldie sank deeper into the lifestyle and was fully immersed in it until her early-mid 20s. Eventually, she left the KY community after finding abuse allegations from previous cases online and practiced Sikhism only for a period of time before leaving it altogether. Song Credit: Smoke by BRYDGS (pronounced Bridges) This is my song that I wrote and recorded.. it\u0027s about coping mechanisms to deal with trauma https://www.youtube.com/watch?v=Zc6GSi-OUjE You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2022-10-14T20:51:53Z",
      "duration": "01:34:25.4480000",
      "explicit": false,
      "spotifyId": "39RljfjTO0eel04oPGo2iI",
      "appleId": 1000582696532,
      "youTubeId": "L-8e9jThDJE",
      "subjects": [
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39RljfjTO0eel04oPGo2iI",
        "apple": "https://podcasts.apple.com/podcast/episode-53-goldie-started-ky-in-utah-2001-2014/id1542075885?i=1000582696532",
        "youtube": "https://www.youtube.com/watch?v=L-8e9jThDJE"
      }
    },
    {
      "id": "d5d3c24f-961b-4dbf-aa32-5e5574cf16d4",
      "title": "Episode 52: Pritam Hari Kaur (Joined in 1981, Hamburg, Germany; 1987 moved to Johannesburg, South Africa)",
      "description": "Pritam Hari Kaur born in Germany and grew up in Indonesia and Spain, of German post-war parents who wanted nothing better than to head out into fresh and new horizons. After being kicked out of her house by father and step-mom at 19 years old, she felt orphaned, and eventually met Yogi Bhajan in 1981 at age 21; fully embraced the ashram lifestyle. Comforted under YB’s tutelage and guidance at the European regional center in Hamburg. She was the European Regional Secretary from 1981 - 1987, co-organized the Annual Yoga Festival in France, the European Tantric Yoga Events and YB’s visits, as well as traveled to New Mexico every year during this time frame 81 - 87. In 1986 he asked her if she wanted to join his staff in Espanola, NM. She declined with much sadness at the time, knowing that she would literally combust if she was there 24/7. YB introduced and arranged her marriage to Har Bhajan from South Africa and sent her to “develop” the area there in 1987. In 1997, YB sent an African American ‘Khalsa’ to South Africa, a Sikh Dharma Minister, purportedly to support the ‘mission’. This teacher was a sex offender addict and seduced (women) in the name of “counseling” and moon center healing” people under the banner of KY, right under our noses at the ashram and on his “duty” as a minister of SD. They brought this to YB’s attention at Solstice two years later (1999), and ensured the man didn\u0027t come back; and that he was NOT sent onward to another African country, Mozambique, which YB had wanted to do. Apparently, EPS, the ethics bureau, was created after this major and tragic scandal that never actually got recognized, reconciled, or resolved. It was said at the time that YB \u0027corrected\u0027 the man. However, the abusive transgressions were not conclusively dealt with via counseling and rehabilitation, being left in limbo for two decades beyond the original offenses. At the time, the South African Ashram moved on and did the best they could to continue focusing on teaching, growing their community and sharing the Yogic lifestyle. Their son Hari Bhajan left for school in India in 1999 at the age of 10. In 2004 when YB passed away, she went into deep grief. During this process she began taking a serious look at her own spiritual life and mental, emotional health. She noticed that despite decades of sadhana and so many tantrics and daily yoga, she was a high functioning depressive with little capacity for happiness, which made her feel flawed and ashamed. At this time, she started very deliberately working with herself to undo her own numbness and pain. She began to feel very different, not chasing elusive goals and keying herself up in spiritual bypass as a routine way of being. Her relationship with yogi bhajan came to feel settled and at peace. When the ‘Premka book’ came out in 2020, she already had some emotional tools for the complexity of it all, the abuses that were being revealed, despite the occasional sense of dissociation or disbelief. She’s in a place where she still loves yoga and also holds the voices of the many persons who were harmed in her heart. There continue to be many local discussions around this and it remains an ongoing topic of transparency within our community. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2022-10-09T20:27:00Z",
      "duration": "02:42:42.7200000",
      "explicit": false,
      "spotifyId": "3rzRIU13bTM5fymk8UNaRg",
      "appleId": 1000582077801,
      "youTubeId": "zA88bUCp7i0",
      "subjects": [
        "3HO",
        "Sikhism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rzRIU13bTM5fymk8UNaRg",
        "apple": "https://podcasts.apple.com/podcast/episode-52-pritam-hari-kaur-joined-in-1981-hamburg/id1542075885?i=1000582077801",
        "youtube": "https://www.youtube.com/watch?v=zA88bUCp7i0"
      }
    },
    {
      "id": "4fda5e16-05a7-4217-9184-0e6785025ab0",
      "title": "Episode 51: BethVandam - (Sat Atma Kaur-2007-2020 Los Angeles)",
      "description": "Beth joined the Los Angeles Kundalini Yoga community in 2007 while at grad school earning her MFA in production design for film and TV at the American Film Institute. She discovered Golden Bridge Yoga studio in Hollywood and soon became a regular student there, then quickly a sevadar, then a part-time front desk manager, and ultimately a full-time front desk manager, teacher, and sadhana leader. She tookLevel 1 Teacher\u0027s Training in 2013-14 with Gurmukh and Gurushabd, and also attended Level 1 Yoga Therapy training with Guru Dharam (of England/Sweden/NY) in 2014 at Golden Bridge. She also assisted 3 other Level 1 TTs (2 at Golden Bridge Santa Monica, 1 at Golden Sol), and taught at Golden Sol studio in LA from 2014-2019. She also organized a Level 2 Yoga Therapy module with Guru Dharam at Guru Ram Das Ashram in 2015. She attended Summer Solstice in NM every year from 2013 through 2019, where she managed the Tent Setup Crew. In 2020, she ended a 5\u0026#43; year-long personal seva commitment for Gurmukh. She also no longer practices or teaches KY. Today, she has a radical and fulfilling career working as a set decorator, creative carpenter, artist, and designer in Hollywood and beyond. IG: @beth.vandam Fb: @ElizaBeth Van Dam (https://facebook.com/elizabeth.j.van.dam) Website: www.bethvandam.com Song: Energy by Sampa the Great (with Nadeem Din-Gabisi) https://open.spotify.com/track/1bj5ZFpxGFP5ooQcctNVB4?si=e1453baae2204b02 You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2022-10-02T21:48:43Z",
      "duration": "02:23:29.8000000",
      "explicit": false,
      "spotifyId": "5lKXaWCk3CzD4iMdJ05WDz",
      "appleId": 1000581320512,
      "youTubeId": "2hqR5p3_s7M",
      "subjects": [
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5lKXaWCk3CzD4iMdJ05WDz",
        "apple": "https://podcasts.apple.com/podcast/episode-51-bethvandam-sat-atma-kaur-2007-2020-los-angeles/id1542075885?i=1000581320512",
        "youtube": "https://www.youtube.com/watch?v=2hqR5p3_s7M"
      }
    },
    {
      "id": "f9ff72e3-8afa-4285-aa1a-79049d693d47",
      "title": "Episode 50: Jules Hartley Part 2 (2011 - 2018 - Joined 3HO in Los Angeles",
      "description": "Part Two with Jules Hartley. We go into detail of her personal story of emotional/psychological abuse from her Teacher Tej Kaur (Los Angeles; Nine Treasures), other 3HO experiences including White Tantric Yoga for both Winter and Summer Solstice, Los Angeles, as well as the highly \u0022coveted\u0022 position and privilege of volunteering at the SSS Cabin to serve the subtle body of YB and the \u0022WTY Facilitators\u0022 who were the live in-person representatives of the Mahan Tantric himself. Lots of details and stories revealed in this episode. _______________ Jules Hartley joined 3HO in 2011, changed her name to Amrita Kaur, and actively participated as a kundalini yoga teacher, worked for WTY (Health\u0026Humanology), Golden Bridge Yoga, Nine Treasures Yoga, and performed work exchange for KRI and 3HO, and did seva at the RaMa Institute as well as the Guru Ram Das Ashram in LA through the end of 2018. She grew up in San Diego and Northern Virginia, and then went to college in New York City where she began her career as an actress and producer in the film \u0026 TV industry. Upon the suggestion of her manager at the time, she moved to Hollywood, where she lived for over a decade––Much of which was defined by her life in 3HO, serving the community. She has lived back in San Diego since leaving LA in 2018, and is currently finishing up her fourth year rotations \u0026 classes of medical school. A second career in naturopathic medicine has given her a fresh perspective and the chance at a new start in my life since leaving the 3HO cult. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomforta... To be a guest on the podcast, please send an email to GN@GuruNischan.com. You can Subscribe, follow, and support work at GuruNischan.com Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lE...",
      "release": "2022-09-16T00:49:15Z",
      "duration": "02:26:47.1110000",
      "explicit": false,
      "spotifyId": "4l4WkpTisHJ7LBqQ9CIxgm",
      "appleId": 1000579634365,
      "youTubeId": "Hfow60vOowA",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4l4WkpTisHJ7LBqQ9CIxgm",
        "apple": "https://podcasts.apple.com/podcast/episode-50-jules-hartley-part-2-2011-2018-joined-3ho/id1542075885?i=1000579634365",
        "youtube": "https://www.youtube.com/watch?v=Hfow60vOowA"
      }
    },
    {
      "id": "42a02fec-e3fc-4d7b-b7d2-f5c246c5723a",
      "title": "Episode 49: Jules Hartley (Amrita Kaur - Los Angeles, CA - 2011 -2018 )",
      "description": "Jules Hartley joined 3HO in 2011, changed her name to Amrita Kaur, and actively participated as a Kundalini Yoga teacher, worked for White Tantric Yoga (Health\u0026Humanology), Golden Bridge Yoga, Nine Treasures Yoga, and performed work exchange for KRI and 3HO, and did seva (selfless service) at the RaMa Institute as well as the Guru Ram Das Ashram in LA through the end of 2018. She grew up in San Diego and Northern Virginia, and then went to college in New York City where she began her career as an actress and producer in the film \u0026 TV industry. Upon the suggestion of her manager at the time, she moved to Hollywood, where she lived for over a decade––Much of which was defined by her life in 3HO, serving the community. She has lived back in San Diego since leaving LA in 2018, and is currently finishing up her fourth year rotations \u0026 classes of medical school. A second career in naturopathic medicine has given her a fresh perspective and the chance at a new start in my life since leaving the 3HO cult. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations To be a guest on the podcast, please send an email to GN@GuruNischan.com. You can Subscribe, follow, and support my provocative truth-telling work at GuruNischan.com Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2022-09-14T00:01:13Z",
      "duration": "02:16:15.0800000",
      "explicit": false,
      "spotifyId": "0vDeSJfCIe5KAWGjqgI5E6",
      "appleId": 1000579396048,
      "youTubeId": "WeE-s4eYM0c",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0vDeSJfCIe5KAWGjqgI5E6",
        "apple": "https://podcasts.apple.com/podcast/episode-49-jules-hartley-amrita-kaur-los-angeles-ca/id1542075885?i=1000579396048",
        "youtube": "https://www.youtube.com/watch?v=WeE-s4eYM0c"
      }
    },
    {
      "id": "abd89746-5819-4b1f-8fa0-9d1f8811031d",
      "title": "Episode 48: Siri Om Singh; Mexico City, Mexico (Started KY 2006 - 2021)",
      "description": "Siri Om was born Ivan Sanchezin Mexico City in 1971, graduated from the National University of Plastic Arts with a degree in Graphic Communication. Being a restless seeker of answers and in the midst of incessant alcoholism and deep depression he begins taking regular kundalini classes in February 2006. Making great changes in his life, he takes his practice to the next level with TT at RaMa Mexico City in 2009. By 2010 he dedicates himself to teaching Kundalini classes, and by 2017 he graduated as a Level II teacher. During those years teaching kundalini classes and along with his work as a graphic designer, he developed his dream of becoming a Lead Trainer or “teacher of future kundalini yoga teachers” in association with 3HO and KRI Kundalini Research Institute. In 2019 he starts an internet radio show called ComoUnidad Radio where he shares his yogic lifestyle grounded in daily life. The Premka book release in 2020 sent him into confusion; But it wasn’t until 2021 that he finally cut ties with the RaMA Mexico City/3HO) base, TT Organization and 3HO altogether. Today he is the founder of the Ganesha Espacio Community, has changed his name to Siri Ganesha and is bringing yoga and meditation to low- and middle-income people. He currently spends most of his time teaching classes online and is passionate about music and cinema. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations To be a guest on the podcast, please send an email to GN@GuruNischan.com. Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2022-09-03T03:35:09Z",
      "duration": "02:46:29.3510000",
      "explicit": false,
      "spotifyId": "7I56n1iVFQzApXM6LQRrwU",
      "appleId": 1000578227502,
      "youTubeId": "sbvyg4hoziw",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7I56n1iVFQzApXM6LQRrwU",
        "apple": "https://podcasts.apple.com/podcast/episode-48-siri-om-singh-mexico-city-mexico-started/id1542075885?i=1000578227502",
        "youtube": "https://www.youtube.com/watch?v=sbvyg4hoziw"
      }
    },
    {
      "id": "30720761-c9dc-4b50-bab4-7410d7cf6896",
      "title": "Eps.47 - 3HO Reparations Claims and Concerns",
      "description": "The deadline for the Independent Healing and Reparations Program of Sikh Dharma (3HO/KY/SSSC) is coming up on August 19, 2022. The protocol and eligibility is available for all to read below. Help get the word out to others who may be eligible by sharing this podcast. This episode discusses basic eligibility guidelines and the importance of legal representation vs. just using the independent facilitator process on your own. Listen to shares from several second generation voices from the 1970\u0027s - 2000\u0027s and how they\u0027ve decided to move forward towards filing their reparations claim. Please reach out if you need support or information: GN@GuruNischan.com Donations to GuruNischan.com/UncomfortableConversations __________________ \u003E\u003E Click this Link to Read the Protocol for the Independent Healing and Reparations Program for the Sikh Dharma Community \u003E\u003E Click this Link to Register your claim for Reparations BEFORE August 19, 2022 Get Support that you need to make your claim! Justice Law Collaborative: email: survivorsupport@justicelc.com www.justicelawcollaborative.com https://www.justicelawcollaborative.com/schools-boarding-schools-colleges-and-universities _________________________ Click this link to read the SSSC\u0027s Acknowledgment, Apology, and Reparations Program Announcement",
      "release": "2022-08-10T02:24:48Z",
      "duration": "00:46:47.1600000",
      "explicit": false,
      "spotifyId": "5HGUBTk0W2G38mZVmnDpBy",
      "appleId": 1000575596873,
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5HGUBTk0W2G38mZVmnDpBy",
        "apple": "https://podcasts.apple.com/podcast/eps-47-3ho-reparations-claims-and-concerns/id1542075885?i=1000575596873"
      }
    },
    {
      "id": "fe5aea56-13b8-470e-8b91-d6703bd481c5",
      "title": "Episode 46: The Ram Das Puri Land Purchase Story with Gigi Kaur; (GuruGun Kaur - 3HO member from -1971 - 1983)",
      "description": "Guru Gun Kaur, simply goes by Gigi, joined 3HO in 1972 at Mendocino Summer Solstice. She became devoted to the practice of yoga, cleansing and detoxing from her young adult years during the time of sex, drugs and rock and roll; moving away from the “negative” lifestyle, while rapidly moving toward her new found faith and “conscious” family, led by Yogi Bhajan. For the next 12 years she immersed herself in the Sikh tradition of sacred music, Kirtan and her faith as a sacred devotion. She was arranged to be married in 1974 and soon after in 1976, YB influenced her to relinquish her family inheritance, which was eventually used to purchase the Summer Solstice land, known in 3HO as Ram Das Puri, in Espanol, New Mexico. In 1979 YB turned on Gigi, vowing to destroy her, and eventually influenced her to give up her children to her ex-husband. Yet she carried on as a devotee until December 1983, when she finally left; but remained devoted to the Sikh Faith. 2020 was an uproar which opened the old wounds and forced her into the swirl of all that went left unexamined. Today Gigi finds herself struggling to even keep a roof over her head, yet in spite of all of this trauma and loss, she knows she’s on the path to healing the deep emotional wounds she has suffered. She’s in contact with her children, who’ve also shared their stories with her of their abuse during the years after she was forced to leave them behind. She’s grateful for all spiritual support and prayers in the spirit of brotherly and sisterly love. * Show correction* The solstice land; Ram Das Puri is in the Jemez mountain range (not Truchas, which is to the East of the Sangres range) It is the Tewa People’s land. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2022-06-22T01:50:14Z",
      "duration": "01:44:44.7760000",
      "explicit": false,
      "spotifyId": "00JOEZgWoR1MfvMVDChBzM",
      "appleId": 1000567333106,
      "youTubeId": "IiK8FBPHzvQ",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/00JOEZgWoR1MfvMVDChBzM",
        "apple": "https://podcasts.apple.com/podcast/episode-46-the-ram-das-puri-land-purchase-story-with/id1542075885?i=1000567333106",
        "youtube": "https://www.youtube.com/watch?v=IiK8FBPHzvQ"
      }
    },
    {
      "id": "41c3427d-e2ae-44da-b781-a0cceedc4d7f",
      "title": "Episode 45: Kartar Diamond (In 3HO from 1974 - 1995; Los Angeles, CA)",
      "description": "Kartar Diamond was Born in 1961 and grew up in the San Fernando Valley area of Los Angeles County with a Reform Jewish upbringing. First exposure to 3HO was about 10 years old. She started practicing Kundalini Yoga at age 14. She took Sikh vows at age 19. She had a semi-arranged marriage at age 20, which lasted 2 years. She dropped out of college before marriage and worked as a secretary for a 3HO chiropractor for 10 years. Married again in 1986 at age of 25. She continued to work until the end of her pregnancy and had her son in 1991. Her 2nd marriage ended in 1995 and she left 3HO while simultaneously getting a divorce. She’s a full-time fengshui consultant, published author, and mental-illness advocate, and still resides in the southern California area. Co-parenting her disabled son, now 31 years old, and interacts with, her ex-husband who remains in 3HO to this day. You can learn more about her brilliant writings, works and advocacy at www.fengshuisolutions.net And www.noahsschizophrenia.com You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2022-06-09T22:20:30Z",
      "duration": "02:01:06.8560000",
      "explicit": false,
      "spotifyId": "4GpXkCm9CLzuK2kimrqaWL",
      "appleId": 1000565900194,
      "youTubeId": "tGZlvO-G5qY",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4GpXkCm9CLzuK2kimrqaWL",
        "apple": "https://podcasts.apple.com/podcast/episode-45-kartar-diamond-in-3ho-from-1974-1995-los/id1542075885?i=1000565900194",
        "youtube": "https://www.youtube.com/watch?v=tGZlvO-G5qY"
      }
    },
    {
      "id": "993cfa8f-1f86-45f3-8057-0e36773f4b74",
      "title": "Episode 44: Vandee Crane (formerly Pavandeep Kaur Khalsa; 2009)",
      "description": "Vandee Crane is the author of My Body, My Soul: One Woman\u0027s Journey to Reclaim Both, as well as Founder and Director of Rise In Love Foundation, a grassroots nonprofit, whose mission is to support individuals, families, communities and companies in understanding and healing the individual and collective Mother Wound by bringing Women of all Nations together to heal through connection, culture and conversation. A process known in Indigenous Cultures around the World as ReMatriation. Vandee, formerly Pavandeep Kaur Khalsa initially came to learn about KY/3HO in 2009 through a series of serendipitous spiritual experiences, after an early life of child trafficking and addiction. She’s here today to offer her unique perspective and share her own experiences in the community as an Indigenous Woman, a Survivor Leader, and Professional Disruptor. Vandee lives in Northern New Mexico, on Ancestral Apache and Pueblo Territory. She herself is of Wazhazhe, Tsalagi, and European American descent. Her partner John SwiftBird and their Daughter TatankaSkaWin \u0022Tata\u0022 SwiftBird are enrolled members of the Oglala Lakota Nation. She and her Family are passionate about Cultural Preservation and keeping their Traditional Values alive through their grassroots nonprofit work. Vandee and their Daughter are also featured in the up and coming documentary Women of the White Buffalo, to be released in 7 languages internationally this coming month. Vandee\u0027s professional and academic background include addictions counseling, trauma informed care, and Integrative studies. She is also an outspoken CSET (child trafficking Survivor Leader) who has brought a lot of awareness and impactful change to the communities and cases she has been involved with. You can donate to her profound work at www.riseinlovefoundation.org Music Credit: Lyla June - Mamwlad https://www.youtube.com/watch?v=TeGLDwfrvb8 Link to purchase her book: (It\u0027s also on Amazon where reviews are awesome...I just really don\u0027t like raising money for Jeff Bezos to play space cowboy ) https://www.target.com/p/my-body-my-soul-one-woman-s-journey-to-reclaim-both-by-vandee-crane-paperback/-/A-83270172 Donations for mutual aid and other grassroots work can be made at: PayPal vandee@riseinlovefoundation.org Cash App https://cash.app/$riseinlovenow Or made out to Rise in Love Foundation \u0026 mailed to: PO Box 425 Tesuque, NM 87574 You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2022-02-17T01:11:10Z",
      "duration": "01:47:51.7830000",
      "explicit": false,
      "spotifyId": "10zaRwO0Et5LHTeXsISryk",
      "appleId": 1000551341122,
      "youTubeId": "vo9L7jFIi84",
      "subjects": [
        "3HO",
        "Human Trafficking",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/10zaRwO0Et5LHTeXsISryk",
        "apple": "https://podcasts.apple.com/podcast/episode-44-vandee-crane-formerly-pavandeep-kaur-khalsa/id1542075885?i=1000551341122",
        "youtube": "https://www.youtube.com/watch?v=vo9L7jFIi84"
      }
    },
    {
      "id": "15553894-568c-4ebf-8599-ca18bd78a237",
      "title": "Episode 43: Mark Bailey (Abuse from ex-3HO Member - 1996 - 1999) ”The Predatory Patterns We Weave”",
      "description": "Mark Bailey left home at a young age and lived as an artist on the fringes of society. From the ages of 15-18 experienced psychological manipulation and abuse from a member of 3HO while a student for Summit School for the Arts in Chisago City, MN before it was shut down in 1999. He settled down after a serious accident in 2006 and spent the next decade painting pictures while learning to manage two chronic illnesses. Since 2014, Mark has worked primarily as a writer. He summarizes news reports for a nonprofit information service, writes articles for the cryptocurrency industry, and maintains a blog. Mark has also published seven science fiction novels. He works from home and rarely leaves his Minneapolis neighborhood. You can learn more with Mark in his short book Navigating Dystopia - https://rstory.io/navigating-dystopia.pdf Or his blog, where his art can be found - https://hive.blog/@mada Song: Laszewo - Don\u0027t Walk Away - https://open.spotify.com/track/3URS9FbHLDKOAFRgKk9pwv?si=e645a3a2f73845a8 You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations",
      "release": "2022-01-08T03:31:02Z",
      "duration": "01:57:12.8080000",
      "explicit": false,
      "spotifyId": "0idQL2AmxUbgmHTyUIWPxC",
      "appleId": 1000547257490,
      "youTubeId": "HqVKdlapFus",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0idQL2AmxUbgmHTyUIWPxC",
        "apple": "https://podcasts.apple.com/podcast/episode-43-mark-bailey-abuse-from-ex-3ho-member-1996/id1542075885?i=1000547257490",
        "youtube": "https://www.youtube.com/watch?v=HqVKdlapFus"
      }
    },
    {
      "id": "d9a98749-4671-47e4-8885-939f3b9adfa4",
      "title": "Episode 42: Predators and the Predatory Formula of 3HO/Kundalini Yoga Culture",
      "description": "Discussing Predators and the \u0022wise-man\u0022 predator formula and grooming behavior that is infused throughout all aspects of 3HO/Kundalini culture, \u0022The Teachings\u0022, the Aquarian Academy and a false sense of safety in these spaces. Help us raise awareness and money for adult survivors of childhood sexual abuse. Host a “Lighting Up the Dark Watch Party” before the end of the year and/or LIVE-Stream the BARE NAKED TRUTH: Breaking the Silence Barrier Spoken Word Burlesque Spectacular w/ GuruNischan on December 21, 2021. You can Online Stream \u0026#43; 8 day replay of this special event happening on the darkest night of the ~ Tuesday, December 21st. Join us as we light up the night with this embodied expression of healing. \u0026#43;Online Streaming \u0026#43; replay and Live in Chicago at The Edge Theater \u0026#43; Highlighting All Male Survivors Panel post-show \u0026#43; A portion of all proceeds will go to Childhood Fractured, a local non profit supporting childhood survivors of abuse through writing, art, and performance. \u0026#43; Two spoken word and music opening acts \u0026#43; GuruNischan making her stage debut as Lala Luminosity in her One Woman Show — “ The P*ssy Whisperer” Tuesday, December 21, 2021 at 6pm CST Get your ticket at the link below or make a donation to the art and healing process. https://www.eventbrite.com/e/bare-naked-truth-breaking-the-silence-barrier-tickets-222603662547 GuruNischan.com",
      "release": "2021-12-20T01:27:58Z",
      "duration": "01:07:05.6080000",
      "explicit": false,
      "spotifyId": "4ZE84o0JfyoMyu6tGLdBVp",
      "appleId": 1000545460660,
      "youTubeId": "caae2rLICm8",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ZE84o0JfyoMyu6tGLdBVp",
        "apple": "https://podcasts.apple.com/podcast/episode-42-predators-and-the-predatory-formula/id1542075885?i=1000545460660",
        "youtube": "https://www.youtube.com/watch?v=caae2rLICm8"
      }
    },
    {
      "id": "12c0f9c8-3b00-4cac-b314-9c7e68fa579a",
      "title": "Episode 41: Our Shared 3HO Identity of ”Exceptionalism” and ”Otherness”",
      "description": "Today\u0027s episode I share my experience of being unravelled the last few months in my sense of IDENTITY, the challenge of \u0022otherness\u0022 that we perpetuate as real, the lie of 3HO \u0022exceptionalism\u0022 and its roots in white supremacy; and all things indoctrination, hidden in plain sight., including, NO BANGS ALLOWED! Break free with me...and let\u0027s discover what\u0027s hidden in our layers of SELF.",
      "release": "2021-11-29T18:14:26Z",
      "duration": "00:01:54.1510000",
      "explicit": false,
      "spotifyId": "7kzIxn4NN1zFgUSEgOKnSM",
      "appleId": 1000543404272,
      "youTubeId": "612A1_YU4co",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7kzIxn4NN1zFgUSEgOKnSM",
        "apple": "https://podcasts.apple.com/podcast/episode-41-our-shared-3ho-identity-of-exceptionalism/id1542075885?i=1000543404272",
        "youtube": "https://www.youtube.com/watch?v=612A1_YU4co"
      }
    },
    {
      "id": "61d335fe-c5c8-4bef-afcb-31ecd72af19c",
      "title": "Episode 40: WHITE SILENCE, EXCEPTIONALISM, SUPERIORITY AND THE SPIRITUAL WHITE WOMAN",
      "description": "Today we explore White Supremacy in all it\u0027s forms of White Silence, White Exceptionalism, White Superiority, Tone Policing, the prey and predator of the Spiritual White Woman and more ways it exposes itself in our actions, thoughts, behaviors and communication within the context of 3HO and the World. Book referenced and played: ME AND WHITE SUPREMACY: Combat Racism, Change the World and Become a Good Ancestor by Layla F. Saad Link to purchase: https://www.meandwhitesupremacybook.com/ Song Credit: White Lies by Death You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-09-10T21:11:57Z",
      "duration": "01:35:39.6560000",
      "explicit": false,
      "spotifyId": "5a87mzdbU3cioiBd0r2tMX",
      "appleId": 1000534971399,
      "youTubeId": "qXN_6LR7hOM",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5a87mzdbU3cioiBd0r2tMX",
        "apple": "https://podcasts.apple.com/podcast/episode-40-white-silence-exceptionalism-superiority/id1542075885?i=1000534971399",
        "youtube": "https://www.youtube.com/watch?v=qXN_6LR7hOM"
      }
    },
    {
      "id": "c4e27200-559e-44ac-a193-c2ebae71a647",
      "title": "Episode 39: Shanti Oshan (Started Practicing Kundalini Yoga in 2014- 2021)",
      "description": "Shanti Oshan, previously known as Shanti Karam Kaur has been practicing Kundalini Yoga since 2014 but became deeply involved when she met her teacher in 2019, Isa at a Sufi retreat in Southern California. This is when she vowed to seek Truth through the guidance of God’s voice no matter what. She started Teacher Training in Oceanside, CA and dove headfirst into her path, going to the Sat Nam fest, Summer Solstice, followed by Winter Solstice. Last March, she went to the Espanola Ashram to be a farm intern on Khalsa Family Farms, and I wound up getting caught in the web of illusions in the 3HO/Kundalini Yoga community. There were red flags everywhere, but ended up falling in love with a man in the community this past June, marrying him then breaking it off on her honeymoon. Having experienced narcissistic, and misogynistic behavior, lies, manipulation, and abuse within the 3HO Community and with this man, she is here to share her story. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomforta... Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lE...",
      "release": "2021-08-31T02:53:02Z",
      "duration": "03:20:34.6400000",
      "explicit": false,
      "spotifyId": "6x9yLqcI0XZXTlOA66CUCQ",
      "appleId": 1000533792023,
      "youTubeId": "9hNhuuYi-T4",
      "subjects": [
        "3HO",
        "Yoga Cult",
        "Sufi"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6x9yLqcI0XZXTlOA66CUCQ",
        "apple": "https://podcasts.apple.com/podcast/episode-39-shanti-oshan-started-practicing-kundalini/id1542075885?i=1000533792023",
        "youtube": "https://www.youtube.com/watch?v=9hNhuuYi-T4"
      }
    },
    {
      "id": "381fc3c9-dd19-437a-99be-b1e3bb2af50f",
      "title": "Episode 38: Dr. Ron Alexander (Mind-Body Psychotherapist; Original KRI Scientist 1970s)",
      "description": "Dr Ron Alexander (formerly Shama Singh) is a Mind- Body psychotherapist, international trainer of health care professionals specializing in creativity and trauma. He was recruited by Yogi Bhajan to co-found the original Kundalini Research Institute in 1973 as well as co-founder the Center for Health and Healing at Cedars Sinai Medical Center in Los Angeles. He conducted the early scientific research on Kundalini Yoga, and other forms of meditation, including Zen and Vipassana through the Veterans Memorial Hospital in Topeka, KS, and Santa Rosa Psychiatric Hospital in Santa Rosa, CA. Both in association with the Menninger Psycho-analytic Institute in Topeka, KS. He has been teaching yoga psychology, mindfulness and trauma informed yoga since 1974 and travels the world now teaching and conducting trainings and workshops. He’s the author of Wise Mind Open Mind: Finding Purpose and Meaning in Times of Crises Loss and Change. His forthcoming book in Spring of 2022, Core Creativity: A Mindful Approach to Unlocking Your Creative Abilities Also listen to podcast episode #8 to hear Dr. Ron Alexander\u0027s early 3HO history https://www.podbean.com/ew/pb-r8uhm-f5a25d Article Referenced: From Maharaj to Mahan Tantric: The Construction of Yogi Bhajan\u0027s Kundalini Yoga by Philip Roland Deslippe https://escholarship.org/uc/item/6r63q6qn For more information, go to www.RonaldAlexander.com You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations",
      "release": "2021-08-20T21:40:24Z",
      "duration": "01:06:33.4160000",
      "explicit": false,
      "spotifyId": "3hCGU4z4UQeMz94ChgWajF",
      "appleId": 1000532630226,
      "youTubeId": "Ldn7AdQMsbo",
      "subjects": [
        "3HO",
        "Self-Help",
        "Psychology",
        "Yoga Cult",
        "S. N. Goenka"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hCGU4z4UQeMz94ChgWajF",
        "apple": "https://podcasts.apple.com/podcast/episode-38-dr-ron-alexander-mind-body-psychotherapist/id1542075885?i=1000532630226",
        "youtube": "https://www.youtube.com/watch?v=Ldn7AdQMsbo"
      }
    },
    {
      "id": "46a8bc5c-b74a-48de-b391-ed35c55fc8a5",
      "title": "Episode 37: Taran Kaur (Started KY in 2014 - 2020; U.K.)",
      "description": "Today’s guest is Taran Kaur. Her birth and original name was Alice, and she started practicing Kundalini Yoga in 2014 (late 20s) following guidance from 3HO’s website on Kriyas, meditations and doing many 40 days practices with them. Through this she quit drinking alcohol and focused on getting on the mat everyday rather than nursing a hangover. Alice continued to practice Kundalini Yoga with teachers on Youtube, at the end of 2016 after switching to health care and doing Radiant Body Kriya for 40 days she realised the reality of the destructive relationship she was in with her partner of nine years, left and returned home. Alice went on to study Kundalini Yoga Level 1 at Sahej TT, in the UK with Hari Har Kaur and Sat Siri Singh in 2017. following a calling to finally teach Yoga after years of practice and styles (Hatha in teens, Bikram in early 20s), here she got given the name Ajeet Amrita Kaur. Through the training Alice/Ajeet fell in love with the Sikh Dharma and went to Khalsa Camp to discover it’s depth, Alice/Ajeet went on to learn and embrace Sikhi from more Sikh camps, was blessed with Amrit in 2018 and given the name Taran Kaur, then legally changed it to Taranjeet-Kaur to honour a Kundalini background, ironically she has always shortened it to Taran. Taran (now 31) is navigating married life, mother to one daughter named Satnaam Kaur Evie. She ditched Kundalini Yoga in 2020 and continues rising early to meditate, is studying to be a therapist and makes Art in any free time she has. Song Credit: Stay Gold by First Aid Kit You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-08-12T18:43:12Z",
      "duration": "01:19:18.5680000",
      "explicit": false,
      "spotifyId": "3aU7ZZGYE01A9CF1Mds7yc",
      "appleId": 1000531848299,
      "youTubeId": "42s43bzWk5U",
      "subjects": [
        "3HO",
        "Sikhism",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3aU7ZZGYE01A9CF1Mds7yc",
        "apple": "https://podcasts.apple.com/podcast/episode-37-taran-kaur-started-ky-in-2014-2020-u-k/id1542075885?i=1000531848299",
        "youtube": "https://www.youtube.com/watch?v=42s43bzWk5U"
      }
    },
    {
      "id": "f675e1ca-9a9c-4cdf-a3ed-e057020a790e",
      "title": "Episode 36: Narangkar Glover (Born and raised into 3HO;1974 in Hartford, CT)",
      "description": "Narangkar is an artist and advocate for 3HO second generation adults. She lives in Oregon with her husband and two cats. Narangkar was born and raised in 3HO in the 70’s. Her parents are the Gurujohns who headed the Hartford CT ashram in the 70’s \u0026 80’s. She a big extended family in 3HO as well: 2 aunts \u0026 uncles, one set of grandparents, 5 cousins plus 1 aunt born in 3ho. And 2 sisters. Narangkar \u0026 her big sister were child-swapped when they were 7, sent to live in Ram Das Puri to live with strangers. In 1983 they got sent to India for boarding school first to GNFC School, and then GRD Academy, and also attended New Mexico Military Institute (which was a short-lived US-based school “program” for 3HO kids). Narangkar left around 18 or 19. In 2008 she started talking about her life growing up in 3HO through the blog rishiknots– advocating for the openness and truth about the abuse we children experienced. The goal is for people to better understand how any seemingly innocuous ’seeker’ culture can lead toward totalitarian and abusive environments that can cause serious and lasting harm. Song: Keyshia Cole “Shoulda Let You Go” https://open.spotify.com/track/1yTfczdv9qGCfJpZF3y4yQ?si=ZbMReiZnRWaJzZY_1NvU7Q\u0026dl_branch=1 You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-07-27T22:47:22Z",
      "duration": "03:15:58.6000000",
      "explicit": false,
      "spotifyId": "6ksLbnyouB4nY1zrGRTfCC",
      "appleId": 1000530220402,
      "youTubeId": "QEgztjbK-9M",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ksLbnyouB4nY1zrGRTfCC",
        "apple": "https://podcasts.apple.com/podcast/episode-36-narangkar-glover-born-and-raised-into-3ho/id1542075885?i=1000530220402",
        "youtube": "https://www.youtube.com/watch?v=QEgztjbK-9M"
      }
    },
    {
      "id": "ad3c9040-0534-4590-90dd-eef40ed1a7cb",
      "title": "Episode 35: Shiv Cook (Started Kundalini Yoga in 2001 - 2020)",
      "description": "Today’s guest is Shiv Cook. On September 1, 2001, super successful on the outside, broken and sad on the inside, as well as being over 220 lb, Shiv was as she called it, \u0022kissed by Kundalini Yoga\u0022. Within 4 months of her first taste, her home burned down two days before the WorldTrade Centers fell and nearly took her with it and this led to her leaving her practice as a Corporate Securities Attorney who was “failing at life and winning in success”, to see if she could find a more peaceful way of being. After sharing over 1,000 Kundalini Yoga videos on YouTube creating a vibrant community and reaching her first million views, Shiv deleted all 1,465 one evening in August 2020 just days from the 19th anniversary of that first practice. She has dropped the dogma, ditched the Guru, and is continuing to explore life to the beat of her own drum, sharing tales along the way. Nature is her teacher and life is her practice. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-06-30T22:06:11Z",
      "duration": "02:00:21.6710000",
      "explicit": false,
      "spotifyId": "7vgdJf0o7ne5zmcBRrCfCM",
      "appleId": 1000527431104,
      "youTubeId": "0hFBRUToXBQ",
      "subjects": [
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vgdJf0o7ne5zmcBRrCfCM",
        "apple": "https://podcasts.apple.com/podcast/episode-35-shiv-cook-started-kundalini-yoga-in-2001-2020/id1542075885?i=1000527431104",
        "youtube": "https://www.youtube.com/watch?v=0hFBRUToXBQ"
      }
    },
    {
      "id": "ca2c4671-ee9a-4e8d-8b53-3ad74f655fe3",
      "title": "Episode 33: Mira \u0022HarKrishan\u0022 Khalsa (Born and raised in 3HO; 2002-2020; Los Angeles, CA)",
      "description": "Today’s guest is Mira “Harkrishan” Khalsa. She was born in 2002 in the Los Angeles ashram. Her parents are Siri Atma Singh and Gobind Kaur Khalsa. She attended Summer Solstice and Khalsa Youth Camp every year growing up. In 2005, her family moved to Nambe, New Mexico to be a part of the Espanola ashram and because her mother got a job at “The Ranch”, YB’s main property. In 2019, her family moved from the Espanola community to Santa Barbara. In 2020, she decided to change her name to Mira. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-05-28T19:46:40Z",
      "duration": "02:11:54.0880000",
      "explicit": false,
      "spotifyId": "39c3OGDVly9DUmh87phPmb",
      "appleId": 1000523436172,
      "youTubeId": "g-DvKUtjrdE",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39c3OGDVly9DUmh87phPmb",
        "apple": "https://podcasts.apple.com/podcast/episode-33-mira-harkrishan-khalsa-born-and-raised-in/id1542075885?i=1000523436172",
        "youtube": "https://www.youtube.com/watch?v=g-DvKUtjrdE"
      }
    },
    {
      "id": "b1d373ed-8ddc-426b-b04a-76e96ae02cfc",
      "title": "Episode 32: Bibi Bhani Khalsa (1970-2020; Phoenix, AZ)",
      "description": "Bibi Bhani Khalsa joined 3HO in 1970 in Columbia, Maryland. She landed in Phoenix, AZ the following year and has lived there ever since except for a brief time in Heber, AZ. She is a musician who has made several recordings over the years. She spent time in LA and Espanola under YB\u0027s direction. She taught Kundalini Yoga for many years, but never transitioned to become a teacher trainer. She has two children who both went to school in India. She decided to leave 3HO and Sikh Dharma last summer after learning of the widespread corruption and criminal acts committed and perpetuated by YB. Song Credit: Jimmy Cliff; I Can See Clearly Now You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-05-17T20:02:17Z",
      "duration": "02:37:10.8880000",
      "explicit": false,
      "spotifyId": "6JRw31ckN0u0y7Ha9yvqzT",
      "appleId": 1000522063600,
      "youTubeId": "GUv66DD1rzE",
      "subjects": [
        "3HO",
        "Yoga Cult",
        "Sikhism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6JRw31ckN0u0y7Ha9yvqzT",
        "apple": "https://podcasts.apple.com/podcast/episode-32-bibi-bhani-khalsa-1970-2020-phoenix-az/id1542075885?i=1000522063600",
        "youtube": "https://www.youtube.com/watch?v=GUv66DD1rzE"
      }
    },
    {
      "id": "95d296ad-83be-44e8-bbb3-c1e9fa0f40d3",
      "title": "Episode 31: Gérard Lach (Jap Nirantar; Germany, 2010 - 2017)",
      "description": "Gérard Lach was born in 1978 in northern Germany. He became involved in Kundalini Yoga/3HO during the years of 2010 to 2017 after suffering a herniated disc and cervical spine issues, seeking healing and repair after physical therapy. Keeping his original name, while integrating his new spiritual name, Gérard Jap Nirantar took to the intensity of Kundalini Yoga and Gong Meditation. After practicing for several years, and feeling the tremendous impact of the gong meditations on his own body, he got referred to Nanak Dev Singh in Berlin, GE, in which he studied and learned Gong Meditation Training in 2012. Among other things, in 2015 he began to notice the culture of silence at the European Yoga Festival and among the “leaders”, that nobody was willing to openly discuss Karta Singh’s sexual transgressions in France as a lead teacher, even though it was a major topic buzzing around. It would take him another two years to see through the facade of ‘Sat Nam’ and realize that a lot of truths, present and historical were not being talked about. Song credit: Fix You by Coldplay You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-05-10T21:29:44Z",
      "duration": "02:04:15.4630000",
      "explicit": false,
      "spotifyId": "4xtmlpSiIU57f0nT6iWe1H",
      "appleId": 1000521186078,
      "youTubeId": "JMj5qvV8Zn0",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xtmlpSiIU57f0nT6iWe1H",
        "apple": "https://podcasts.apple.com/podcast/episode-31-g%C3%A9rard-lach-jap-nirantar-germany-2010-2017/id1542075885?i=1000521186078",
        "youtube": "https://www.youtube.com/watch?v=JMj5qvV8Zn0"
      }
    },
    {
      "id": "3375ce1c-786e-496c-8220-0ed5746bdb9b",
      "title": "Episode 30: Simona aka Dharma Devi (Joined 3HO in Italy; 2000 -2019)",
      "description": "Today\u0027s guest is Simona, aka Dharma Devi, a professional yoga and meditation teacher, as well as a dance educator. She\u0027s been practicing yoga and meditation since she was 9 years old. She entered the Kundalini Yoga community in 2000/2001, and even though the red flags were quite red, she didn\u0027t listen to her intuition, and started her path within the 3HO/Kundalini community anyway. She graduated from KY TT in Rome,Italy in 2003, and as an Associate Teacher Trainer officially in 2012. During this time frame, she alsa graduated as a Shakti Dance Instructor, which is a technology that is based on Kundalini Yoga as taught by Yogi Bhajan. She graduated as a Lead Trainer for this discipline in 2012. She taught Shakti Dance at the summer and winter solstice until 2017, when she started to realize something was wrong within the community. In 2019, she left and broke ties with KY and SD, which has been so painful, after being ostracized and dedicating her entire life to these two technologies. She’s grateful for her background as an artist because the pain of letting everything go, has been excruciating. She graduated in 2004 from the University of Turin, Italy, in History and Anthropology of Dance and Theater. She currently owns her own business teaching ancient movement and dance healing practices including her sacred modality Kundalini Rhythms Dance. She loves guiding people back to their power through the joy and sacredness of dance and Qigong. Song Credit: Mon Amie La Rose by Natasha Atlas You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-05-02T18:24:48Z",
      "duration": "03:22:05.4160000",
      "explicit": false,
      "spotifyId": "6MYbIH27Y6lLjk9kaTwzLt",
      "appleId": 1000519743474,
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6MYbIH27Y6lLjk9kaTwzLt",
        "apple": "https://podcasts.apple.com/podcast/episode-30-simona-aka-dharma-devi-joined-3ho-in-italy/id1542075885?i=1000519743474"
      }
    },
    {
      "id": "e1c74e94-cd58-46a9-8d01-3252fa7b3528",
      "title": "Episode 29: GuruNischan Kaur Khalsa (Born into 3HO 1977; Phoenix, AZ)",
      "description": "GuruNischan Kaur Khalsa was born and raised in the 3HO Kundalini Yoga community in 1977 in the Phoenix, Arizona area. Navigating a challenging early childhood with lots of chaotic changes, including her mother leaving the Dharma in 1978, custody battles and despicable communication between fighting parents, among other things. She grew up resilient, feisty and full of positivity to give to the world that she thought was the \u0022power of her light\u0022, rather than recognizing these symptoms as deeply rooted trauma patterns. At age 19 she lived and worked in the Johannesburg, S.A. 3HO Ashram, and later in the Herndon, Virginia Ashram as well (with interesting stories to share from both). After experiencing \u0022burn-out\u0022 in her decade long sales/wellness business career. She took Kundalini Yoga Teacher Training with Krishna Kaur in Los Angeles in 2009 to \u0022get back to her center and heal\u0022. She had zero interest in teaching KY as her living. After the final collapse and \u0022eerily familiar\u0022 demise of her business enterprise in 2012, she began to teach KY in Chicago as a way to move through her grief, confusion, fear and vitriol surfacing. SLOWLY, (many, many years), she began to recognize trauma patterns of \u0022emotional with-holding\u0022, \u0022emotional bypassing\u0022 \u0022white-washing positivity\u0022, and other symptoms her body was communicating as \u0022standard operation\u0022, and begin to recognize how KY was actually holding her body captive, NOT opening it up to freedom and space. It would take several more years and MANY more sexual embodiment practices before she could recognize her almost constant \u0022disassociation from her body\u0022, a shame-based self image disguised as \u0022perfected projection\u0022, \u0026 \u0022bright-light energy\u0022 as her outward persona. For several yeas she stopped teaching and practicing entirely except at the European Yoga Festival in 2016/2017/2018 as she oscillated between her \u0022love of KY\u0022 and her vitriol for aspects of \u0022The Teachings\u0022 that felt false, and riddled with corruption. In March 2020, she experience total liberation, and what felt like \u0022unhooking\u0022 from her 10th gate/Crown chakra/Source-Current, to finally SEE and HEAR publicly what her body had been communicating to her LOUDLY for the last 8 years; but her MIND could not accept. Lies, deceit, sadistic predatory abuse and manipulation were at the heart of her \u0022conscious community upbringing\u0022. Her story reveals details and descriptions of the complexity of love and abuse in an incestuous community upbringing; navigating uncertainty, the detriment of \u0022over-training your will-power\u0022, as well as tantalizing tales of SELF reclamation. Song Credit: The Rose, Bette Midler You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-04-29T22:53:24Z",
      "duration": "02:37:12.6160000",
      "explicit": false,
      "spotifyId": "7khMkGdfCy5g9MheBAGyWw",
      "appleId": 1000519323002,
      "youTubeId": "CCy78oO0uks",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7khMkGdfCy5g9MheBAGyWw",
        "apple": "https://podcasts.apple.com/podcast/episode-29-gurunischan-kaur-khalsa-born-into-3ho-1977/id1542075885?i=1000519323002",
        "youtube": "https://www.youtube.com/watch?v=CCy78oO0uks"
      }
    },
    {
      "id": "699c396f-9357-4d04-84db-50e2af9fab06",
      "title": "Episode 28: Porter Singer aka Sirgun Kaur (2009 - 2020)",
      "description": "Today\u0027s guest is Porter Singer (aka Sirgun Kaur) Porter Singer took her first Kundalini Yoga class at the Golden Bridge in Hollywood, CA in 2009. Drawn to the allure of this space and (mainly) the music they played, she signed up for a children’s teacher training program that same day. It was in that training she met a fellow musician who invited her to be part of the Summer Solstice sound team, in June 2010. At Solstice, she learned about the month-long Aquarian teacher training at the Española ashram in August, which she ended up taking that year too. Upon returning from this 1-month intensive, she felt her identity slowly morph, adopting her spiritual name completely and wearing a head covering any time she went out. Propelled by what she believed to be positive changes in her life, she decided to skip Christmas with the family that year in favor of attending Winter Solstice. There, she reunited with two men from the Summer Solstice Sound Team who would launch her further along her 3HO path. At Summer Solstice 2011, she married Harimander Singh and also released her first mantra album \u0022The Music Within\u0022 with Sat Darshan Singh. This album contained the single “Bliss”, which would become the soundtrack for a Yogi Bhajan slide show entitled “Facets of the Master”— played at every White Tantric Yoga event in the world. Things seemed to be evolving \u0022magically\u0022, and in 2013, after the birth of her first son, she released her second album. Postpartum depression was really her first clue that kundalini yoga, or “Yogi Bhajan”, might not have, or be, the answer to everything. She started to seek alternate solutions to wellness. The more she researched and branched out, the more confining her life started to feel. And in 2019, she finally made the decision to separate from her husband and move from the Phoenix ashram community. She now lives in Washington state with her two boys and her new partner. Song Credit: \u0022She Used To Be Mine\u0022 by Sara Bareilles You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-04-23T01:14:46Z",
      "duration": "01:52:42.6310000",
      "explicit": false,
      "spotifyId": "45QdmyxbfE7RmggdT6zbIs",
      "appleId": 1000518264517,
      "youTubeId": "-MwPVVjstK4",
      "subjects": [
        "3HO",
        "Self-Help",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/45QdmyxbfE7RmggdT6zbIs",
        "apple": "https://podcasts.apple.com/podcast/episode-28-porter-singer-aka-sirgun-kaur-2009-2020/id1542075885?i=1000518264517",
        "youtube": "https://www.youtube.com/watch?v=-MwPVVjstK4"
      }
    },
    {
      "id": "dd318fe8-3ca1-4c3d-9a67-13af7eed190e",
      "title": "Episode 27: Jivan Elizabeth Dorji (1994 -2012)",
      "description": "Jivan Elizabeth Kaur found Kundalini Yoga in 1994 when she sought help and attended a holistic therapy center where she met Shiv Charan Singh (The Founder of the Karam Kriya School in Europe) who was the head counselor there. In 2001 she qualified as a KY teacher at the Karam Kriya School , and in 2005 she went to India with her daughter (born 1995) who enrolled at MPA. After 5 months in Amritsar, Jivan moved to Dharamsala HP Where she met her future husband. In 2008 they married. She and her husband moved to London in 2012 where they live currently. Her daughter Karta joined them a year later after graduating MPA in 2013. Jivan is now at college studying hairdressing finally feeling the joy of learning. Song: \u0022Do you love me\u0022 by The Contours You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-04-07T02:46:14Z",
      "duration": "01:38:56.9680000",
      "explicit": false,
      "spotifyId": "6hUG6Y4phbYWorxjT844Rp",
      "appleId": 1000516072816,
      "youTubeId": "b0fCMWJ7_iQ",
      "subjects": [
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6hUG6Y4phbYWorxjT844Rp",
        "apple": "https://podcasts.apple.com/podcast/episode-27-jivan-elizabeth-dorji-1994-2012/id1542075885?i=1000516072816",
        "youtube": "https://www.youtube.com/watch?v=b0fCMWJ7_iQ"
      }
    },
    {
      "id": "66c25783-5a0a-41f5-98a2-2d240a165c74",
      "title": "Episode 26: Sofía Becerra (Joined 3HO in Mexico City; 2007 -2014)",
      "description": "Sofía Becerra was born in Mexico City, to a non-practicing catholic family. She was always interested in spiritual experiences, and when she was 21-22 years old she lived two very traumatic experiences that involved sexual abuse and drugs, that left her very confused and in a cuasi schizophrenic state. In 2007, as part of her search for healing, she started practicing Kundalini Yoga in a place called \u0022Iztac\u0022. In 2008 she went to live in \u0022Guru Ram Das Ashram\u0022 in Mexico City, led by a couple of Yogis named Jai Hari Singh and Jai Hari Kaur. After around half a year of living there, she started having a sensual/sexual relationship with Jai Hari Singh; who quickly decided to divorce his wife, and begin a serious relationship with Sofia. This relationship lasted until 2014, until Sofía finally had the courage to step out of it. Around 2018 Sofía started to realize that the relationship had not been entirely consensual, because of the mental state that she was in when the relationship happened. Today Sofía works as the director of an education NGO in a rural area in Mexico. She lives with her partner, two twin daughters, and one boy due to be born in May. Song: Blackbird by Brad Mehldau You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist:",
      "release": "2021-03-30T04:14:27Z",
      "duration": "02:07:04.5830000",
      "explicit": false,
      "spotifyId": "4ajHyXnxng2Oz8HK7GXEjL",
      "appleId": 1000514969893,
      "youTubeId": "tIjtKuD_I_M",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ajHyXnxng2Oz8HK7GXEjL",
        "apple": "https://podcasts.apple.com/podcast/episode-26-sof%C3%ADa-becerra-joined-3ho-in-mexico-city-2007-2014/id1542075885?i=1000514969893",
        "youtube": "https://www.youtube.com/watch?v=tIjtKuD_I_M"
      }
    },
    {
      "id": "051f13a3-c69d-43f8-9c25-6a4fa8fdb9fc",
      "title": "Episode 25: Olivia Taglioli (brought into 3HO in Italy at age 6; 1985 - 2010)",
      "description": "Today\u0027s guest is Olivia Taglioli. Originally born in Italy and lived there until 1998. At age 6 years old, her mom announced that Olivia was to receive her spiritual name, Atma Kaur, from Yogi Bhajan, whom she met in the summer of 1985 in Spain. From then on, under her mom\u0027s guidance and sometimes insistence, she began practicing Kundalini Yoga and later Sat Nam Rasayan, and other 3HO lifestyle practices. She met Guru Dev (Master of Sat Nam Rasayan) in 1990 at age 11. She attended her first European Yoga Festival in Loches, France in 1992 at age 13; Also the first time she sat through White Tantric Yoga. She was “counseled”, and receiving \u0022Healing Treatments\u0022 by GuruDev Singh and was regularly sexually abused by him at the age of 16/17. She was forced to keep quiet by her mom and Guru Dev Singh and overall community atmosphere. At 19 (1998) she was \u0022moved\u0022 to the Amsterdam Ashram, working for the ashram, the 3HO Foundation and the Yogi Tea Company for several years in numerous capacities. In 1999 she married a former MPA student from San Diego, CA (who’s parents are well-known members in 3HO) and their wedding was officiated by GuruDev Singh at Solstice 1999. They had three daughters together and later divorced in 2010. She currently resides in San Diego, CA with her four daughters.) She’s a massage and cranio-sacral therapist part time, a writer and a self healer. Song credit: No Ceiling by Eddie Vedder Listen to the Uncomfortable Conversations Spotify Playlist You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations",
      "release": "2021-03-24T01:25:41Z",
      "duration": "02:13:34.8880000",
      "explicit": false,
      "spotifyId": "2hdFeltdZaRI85brXvjuK3",
      "appleId": 1000514156839,
      "youTubeId": "x1_OvjT3X3k",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2hdFeltdZaRI85brXvjuK3",
        "apple": "https://podcasts.apple.com/podcast/episode-25-olivia-taglioli-brought-into-3ho-in-italy/id1542075885?i=1000514156839",
        "youtube": "https://www.youtube.com/watch?v=x1_OvjT3X3k"
      }
    },
    {
      "id": "ef781b57-7ccf-4690-925f-ce689f9f39da",
      "title": "Episode 24: Kewal Wright (Joined 3HO in 1996 -2013)",
      "description": "Kewal came into 3HO in the late 90’s. She met and became a student of Yogi Bhajan when she was 20 years old and spent the majority of her 20s and 30s working in the 3HO community. She was one of the founding owners of Yoga Yoga, opening and managing multiple yoga centers and living in Guru’s Grace Ashram in Austin, Texas. Later she became the director of Yoga Phoenix, the 3HO yoga center in Phoenix, Arizona, and was the assistant director of 3HO Foundation of Arizona. Kewal was a KRI teacher trainer as well as doing work for KRI. She was part of 3HO communities in Austin, Texas, Espanola, NM, and Phoenix, Arizona. She had an arranged marriage (now amicably divorced) and two children while in 3HO. Kewal’s relationship with 3HO began to change around 2010, and was a gradual and personal process, but she still holds close, meaningful connections with family and community established in the 3HO years. She currently lives in Phoenix, Arizona, where she is finishing graduate school and raising her two children. Song: Losing My Religion by R.E.M. You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-03-17T22:28:18Z",
      "duration": "01:45:11.9430000",
      "explicit": false,
      "spotifyId": "1dNk9CIt5eSwDeoFzZKx01",
      "appleId": 1000513483539,
      "youTubeId": "FikkRgqxnUA",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dNk9CIt5eSwDeoFzZKx01",
        "apple": "https://podcasts.apple.com/podcast/episode-24-kewal-wright-joined-3ho-in-1996-2013/id1542075885?i=1000513483539",
        "youtube": "https://www.youtube.com/watch?v=FikkRgqxnUA"
      }
    },
    {
      "id": "cf95da13-0709-4b99-9ebe-5de3c8c27017",
      "title": "Episode 23: Gurunam Atwal (Born in 3HO 1989; Eugene, OR)",
      "description": "Gurunam Atwal was born and raised into 3HO in Eugene, Oregon in 1989. Her parents are Sarbjit Singh Atwal, a Punjabi Sikh who was raised on a farm in the Punjab and her mother, Simrit Khalsa, who joined 3HO in her early 20s while taking Kundalini Yoga classes in Seattle. Gurunam and her brother Hargobind Atwal, both attended Miri Piri Academy for several years. During summer breaks, she worked at the 3HO owned, Golden Temple Enterprises as a temp worker. After graduating MPA, she attended the University of Oregon in International Studies with a focus on Peace and Conflict Resolution. She did modeling for Kundalini Research Institute at this time as well, so you may recognize her from some Kundalini Yoga manuals. In 2018 became a flight attendant for Alaska Airlines and currently lives in Alaska. Song: Krewella - Human You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations",
      "release": "2021-03-10T00:14:28Z",
      "duration": "01:58:54.5030000",
      "explicit": false,
      "spotifyId": "19TAXpcK2BpsvzRT19GcZM",
      "appleId": 1000512314512,
      "youTubeId": "PwrJcJnMEac",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/19TAXpcK2BpsvzRT19GcZM",
        "apple": "https://podcasts.apple.com/podcast/episode-23-gurunam-atwal-born-in-3ho-1989-eugene-or/id1542075885?i=1000512314512",
        "youtube": "https://www.youtube.com/watch?v=PwrJcJnMEac"
      }
    },
    {
      "id": "885f4974-05ec-41fc-9288-2fd587f2fe1f",
      "title": "Episode 22: Ardas Khalsa (1981 - 2020)",
      "description": "Ardas lives in the Austin area of Texas. She took her first Kundalini Yoga class in Hamburg Germany in 1981 when she was 21. She went back to the US and moved into the Roswell ashram just north of Atlanta in 1982. In 1982/83 academic year she attended Association Montessori Internationale in Atlanta to be a certified Montessori teacher. Her plan was to teach at one of the Khalsa Montessori schools, either in LA, Phoenix, or Espanola. She went to Summer Solstice 1983 and, instead, was arranged to marry Siri Bahadur Singh in Dallas. The directors of the Dallas ashram sent a telegram to Solstice that they were leaving. It was determined that Siri Bahadur Singh would be the best choice to be the director of the ashram and they wanted him to marry. She took minister vows in 1984. Ardas and Siri Bahadur moved to Austin in 1990. In 1995, she completed a Master’s Degree at UT Austin and has had a career in government service. During the 80s and 90s she spent most every summer attending Khalsa Women’s Training Camp (KWTC). She also taught Kundalini Yoga until the mid-2000s. Song: Bohemian Rhapsody by Queen You can DONATE to this broadcast at: http://www.gurunischan.com/uncomfortableconversations Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-03-05T01:00:10Z",
      "duration": "02:01:45.6000000",
      "explicit": false,
      "spotifyId": "0azZW5QSxU3xRDj4veMk9P",
      "appleId": 1000511691006,
      "youTubeId": "IsJwjswkcz4",
      "subjects": [
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0azZW5QSxU3xRDj4veMk9P",
        "apple": "https://podcasts.apple.com/podcast/episode-22-ardas-khalsa-1981-2020/id1542075885?i=1000511691006",
        "youtube": "https://www.youtube.com/watch?v=IsJwjswkcz4"
      }
    },
    {
      "id": "20a3a968-135d-4d84-a5a9-d15a7954854e",
      "title": "Episode 21: Dev Dharm Singh Khalsa (born in 3HO 1992; Alaska)",
      "description": "Dev Dharm Khalsa was born \u0026 raised in Anchorage Alaska to his parents Guru Bandhu Singh \u0026 Hari Atma Kaur Khalsa, both 3HO Kundalini Yoga practitioners. Shortly after the Anchorage, Alaska Ashram (run by the Nirvairs) closed. At the age of 13, he left Alaska to attend Miri Piri Academy in Amritsar, India. He spent five years at MPA before returning to the US for college \u0026 professional life. He is currently a freelance videographer \u0026 photographer specializing in environmental conservation \u0026 government. Song: For What It’s Worth Buffalo Springfield DONATE to the broadcast at: http://www.gurunischan.com/uncomfortableconversations ___________________________________ Please rate, review and share the podcast. Available on ALL platforms. Here are a few links: Apple podcast: https://podcasts.apple.com/us/podcast/uncomfortable-conversations-podcast-untold-stories/id1542075885?fbclid=IwAR1WjmBQNu1uHXyU5am8t4NYwazonceA9nzuiCRATr_TpeA76Bw6XK9bSpw Google podcast: https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkLnBvZGJlYW4uY29tL3VuY29tZm9ydGFibGVjb252ZXJzYXRpb25zL2ZlZWQueG1s Iheart radio https://www.iheart.com/podcast/269-uncomfortable-conversation-74754118/ Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-02-23T17:28:38Z",
      "duration": "01:37:48.1360000",
      "explicit": false,
      "spotifyId": "0w3Dv28lsnLCIk24tx3w1f",
      "appleId": 1000510376567,
      "youTubeId": "JwDINu2GWro",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0w3Dv28lsnLCIk24tx3w1f",
        "apple": "https://podcasts.apple.com/podcast/episode-21-dev-dharm-singh-khalsa-born-in-3ho-1992-alaska/id1542075885?i=1000510376567",
        "youtube": "https://www.youtube.com/watch?v=JwDINu2GWro"
      }
    },
    {
      "id": "d811a274-f33a-4d7c-bc36-e8dc45252b5e",
      "title": "Episode 20: Lana April Reed (formerly Shakta Khalsa; Joined in1972)",
      "description": "Lana Reed (formerly Shakta Khalsa) started practicing Kundalini Yoga in 1976. She lived in the Baltimore Ashram where she met Kartar, her husband. She lived fully committed to the path, worked with children in the dharma, and raised a son, Ram Das, who went to MPA for many years. Lana started making inner shifts beginning in 2001, and around 2008 the Dharmic identity no longer represented her fully, and she changed her outer look, and more recently, she changed her name as well. She and her husband, who also has changed tremendously over the last decade, have found a way to let each other be themselves (most of the time!)l Lana is a political and social activist, author of yoga books, and founder of Radiant Child Yoga, a method of being with children that allows them to maintain their tremendous wisdom and radiance. Song Credit: Emptiness by Wah! DONATE to the broadcast at: http://www.gurunischan.com/uncomfortableconversations ___________________________________ Please share the podcast with a friend, rate and review it! Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-02-19T20:16:22Z",
      "duration": "01:34:21.0310000",
      "explicit": false,
      "spotifyId": "2bEGnQfLC0WoVWnjgxBN9S",
      "appleId": 1000509966810,
      "youTubeId": "MPGPKcBMhwU",
      "subjects": [
        "3HO"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bEGnQfLC0WoVWnjgxBN9S",
        "apple": "https://podcasts.apple.com/podcast/episode-20-lana-april-reed-formerly-shakta-khalsa-joined/id1542075885?i=1000509966810",
        "youtube": "https://www.youtube.com/watch?v=MPGPKcBMhwU"
      }
    },
    {
      "id": "7c04f86b-47e9-4ac0-8d71-e955bea6f870",
      "title": "Episode 19: SatHanuman Singh Khalsa  (Joined 3HO in 1972)",
      "description": "Uncomfortable Conversations: The Untold Stories of the 3HO Kundalini Yoga Community SatHanuman Singh Khalsa started practicing Kundalini Yoga in 1972. He was one of the 13 original members of the Baba Siri Chand Ashram (founded by Yogi John Twombly and wife Soorya Kaur). He started teaching KY in 1972 and continued until 2007 after relocating to Portland Oregon in which he continued his interfaith work and lecturing at schools from Florida, New England and Portland Oregon on Sikhi! . His daughters are Sat Pavan Kaur and Siri Swami Kaur who are both married to son\u0027s of our community. He worked at Golden Temple Conscious Cookery in Wash DC and Boston for five years and was top salesman at Golden Temple EMPORIUM in Cambridge, Mass. from 1976 until 1980. He went on to start the Community Business Brokers in 1986 and Siri Guru Nanak Inc. (CBB/SGN) built both the southeast and northeast regions in 1986 until 2002. SGN fell under KIIT (Khalsa Industries and Trades Umbrella: is the holding entity of all the Khalsa businesses; i.e. Akal, Yogi Tea, Golden Temple Bakery, Sunshine Oils, 3HO Health, Sun and Sons, KRI, SGN, Herb Tech, SikhNet). He’s trained police and FBI about the Sikh path and is the first Sikh (with turban and full beard) to be hired by TSA/DHS. He’s now semi-retired working as the Presence Marketing Retail services for Whole Foods in Oregon for the past 8 years. Song: Dougie MacLean - Caledonia ___________________________________ To Donate to this broadcast http://www.gurunischan.com/uncomfortableconversations Please Subscribe, Rate, Review and Share the Podcast with a friend. Uncomfortable Conversations Spotify Playlist: https://open.spotify.com/playlist/2lEfcoaDgbCCmztPZ4XIuN?si=vH-cH7HzRs-qFxzEuogOqg",
      "release": "2021-02-10T03:54:37Z",
      "duration": "02:46:53.2800000",
      "explicit": false,
      "spotifyId": "1eoyx2IDYWJuF11ryBEnQG",
      "appleId": 1000508522319,
      "youTubeId": "13azFzDZPZc",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1eoyx2IDYWJuF11ryBEnQG",
        "apple": "https://podcasts.apple.com/podcast/episode-19-sathanuman-singh-khalsa-joined-3ho-in-1972/id1542075885?i=1000508522319",
        "youtube": "https://www.youtube.com/watch?v=13azFzDZPZc"
      }
    },
    {
      "id": "c07d7f0c-9f32-456e-9e9c-0b6303a38173",
      "title": "Episode 18: Mani Niall (Mani Singh Khalsa 1972-1985)",
      "description": "Episode 18: Mani Niall (formerly Mani Singh Khalsa 1972-1985) was introduced to 3HO at the age of 12 when he attended the wedding of his sister at the Mendocino, CA Solstice. He moved into an ashram at the age of 15 in Sedona, AZ as well as lived in other Ashrams: Cave Creek, AZ, Tucson, AZ, Salem Oregon, Portland, OR and then Los Angeles from 1979-1985. He left 3HO in 1985. Mani has been a baker, private chef, two-time bakery owner/operator and chief cupcake froster, has written four cookbooks, and currently resides in Oakland, CA working as an advisor to small food businesses. Song: Jimmy Somerville - Smalltown Boy Reprise 2014",
      "release": "2021-02-05T06:17:29Z",
      "duration": "02:38:21.0800000",
      "explicit": false,
      "spotifyId": "0dWBqx4ID3FGevap8xWDsE",
      "appleId": 1000507897589,
      "youTubeId": "G92-eBbF73k",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dWBqx4ID3FGevap8xWDsE",
        "apple": "https://podcasts.apple.com/podcast/episode-18-mani-niall-mani-singh-khalsa-1972-1985/id1542075885?i=1000507897589",
        "youtube": "https://www.youtube.com/watch?v=G92-eBbF73k"
      }
    },
    {
      "id": "9e858d53-c540-4cb6-985d-dd51015c34ee",
      "title": "Episode 17: Michelle Melito (Born 1982; Denver, CO )",
      "description": "Michelle Melito is a second generation of 3HO. She was born in Colorado in 1982 to Darshan Singh and Kaur. She has two older second generation siblings who were Saraswati Kamal and GuruMantra. At the age of 2 her family moved to the Espanola Ashram. At age 5 her family left 3HO and her parents divorced. She grew up in Albuquerque where she suffered parental neglect and other heavily traumatic experiences. At age 15 she turned back to the only “good thing” she thought she knew: 3HO and Yogi Bhajan. In 1999/2000 she attended Miri Piri Academy in India, and also lived with Yogi Bhajan on the Ranch for about one month before moving to the Phoenix Ashram for several years working for the head of the Ashram in his accounting firm. She has many, many layers to her story and she’s here to share it with us today. . Let us hold her here in the light of truth.",
      "release": "2021-01-28T02:44:00Z",
      "duration": "01:24:44",
      "explicit": false,
      "spotifyId": "0u5OT3bj1kxUy5QeHaBxxG",
      "appleId": 1000506856079,
      "youTubeId": "e2Rd1O5IBw8",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0u5OT3bj1kxUy5QeHaBxxG",
        "apple": "https://podcasts.apple.com/podcast/episode-17-michelle-melito-born-1982-denver-co/id1542075885?i=1000506856079",
        "youtube": "https://www.youtube.com/watch?v=e2Rd1O5IBw8"
      }
    },
    {
      "id": "6c49b0a0-46a3-486d-86a6-7d26b700c3ee",
      "title": "Episode 15: Nirinjan Kaur Khalsa (Born 1988 in Vancouver, BC)",
      "description": "Nirinjan Kaur Khalsa was born and raised in 3HO in 1988 in Vancouver British Columbia (born to her mother, father and 14 year older sister (a practicing 3HO Sikh/Kundalini Yoga oriented family). She took KY teacher training in 2001 at her mother’s Teacher’s Training in Vancouver(GuruRaj Kaur Khalsa) TT, and then decided she wanted to go to MIri Piri Academy in India for 10th, 11th, and 12th grade, graduating in 2006. She released her first musical album “Aquarian” in 2007, made as mantra music to accompany the Kundalini practice of morning Aquarian Sadhana. Over the next 13 years, also released 4 more spiritually oriented albums, and did several tours. She’s married to Siri Amrit Singh, also born and raised in the 3HO Sikh Kundalini Yoga Community, and together they have two sons, raising their family in Vancouver. She has recently started an astrology based life-coaching practice out of her home in Vancouver. She plans to make more music in the future, branching out into broader musical genres, less specific to Sikh/Kundalini Yoga oriented content. Song Credit: Vicktor Taiwo - Digital Kids [Ft. Solomon] Uncomfortable Conversations Spotify Playlist",
      "release": "2021-01-18T13:07:43Z",
      "duration": "02:24:34.2400000",
      "explicit": false,
      "spotifyId": "69XtQnCYdxmAQ14iNLDr4o",
      "appleId": 1000505735234,
      "youTubeId": "EtK8TZFOElc",
      "subjects": [
        "3HO",
        "Yoga Cult",
        "Sikhism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/69XtQnCYdxmAQ14iNLDr4o",
        "apple": "https://podcasts.apple.com/podcast/episode-15-nirinjan-kaur-khalsa-born-1988-in-vancouver-bc/id1542075885?i=1000505735234",
        "youtube": "https://www.youtube.com/watch?v=EtK8TZFOElc"
      }
    },
    {
      "id": "daee0ead-623c-4113-b1b3-0f8793ba38b1",
      "title": "Episode 14: Jyoti Ma",
      "description": "Episode 14: Jyoti Ma is a Siddha yogini and Shakta Tantra practitioner. Before she transited into her spiritual life, she worked as a professional psychotherapist, specializing in traumatic stress and addiction treatment. This intersection of her clinical and yogic experience led to her seeing and counseling seekers who had left groups/communities led by fake gurus/charismatic leaders. She’s consulted with and helped many who left such communities, including people who left 3HO over the past 20 years. She has an extensive background in treating complex trauma and specifically with group think dynamics. She has a wealth of knowledge to support our listeners in processing the complexity of our own wide range of experiences in the 3HO Kundalini Yoga Community.",
      "release": "2021-01-14T04:42:22Z",
      "duration": "02:45:18.9200000",
      "explicit": false,
      "spotifyId": "3mh9qK57YM44vKTWrImWct",
      "appleId": 1000505322692,
      "youTubeId": "2pTOnFk8nyI",
      "subjects": [
        "3HO",
        "Yoga Cult",
        "Siddha Yoga"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mh9qK57YM44vKTWrImWct",
        "apple": "https://podcasts.apple.com/podcast/episode-14-jyoti-ma/id1542075885?i=1000505322692",
        "youtube": "https://www.youtube.com/watch?v=2pTOnFk8nyI"
      }
    },
    {
      "id": "273f6924-8cfe-419d-83ae-8037e2f2c55d",
      "title": "Episode 13: Elizabeth Sadhu (Sadhu Kaur Khalsa 1972-1988)",
      "description": "Laura Elizabeth Sadhu Roberts took her first Kundalini yoga class when she was 15, in 1972 Eugene, Oregon. She received her name Sadhu Kaur Khalsa at 1975 Summer Solstice, had an arranged marriage, worked and lived in both Eugene and Salem Ashrams, growing the early Amrit Bakery/Golden Temple Bakery business, among others, birthed two children, and has many stories to share from those early days in Oregon. She and her husband and children left 3HO in 1988. Song credit: James Brown Get Up Offa That Thing",
      "release": "2021-01-06T02:36:55Z",
      "duration": "01:43:09.8000000",
      "explicit": false,
      "spotifyId": "3Cvu8A7ZqhJsYx1B6XmhHQ",
      "appleId": 1000504559547,
      "youTubeId": "cZv8WaqA84g",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Cvu8A7ZqhJsYx1B6XmhHQ",
        "apple": "https://podcasts.apple.com/podcast/episode-13-elizabeth-sadhu-sadhu-kaur-khalsa-1972-1988/id1542075885?i=1000504559547",
        "youtube": "https://www.youtube.com/watch?v=cZv8WaqA84g"
      }
    },
    {
      "id": "ce5b960d-e756-4189-af64-cbf7ab416d71",
      "title": "Episode 12: George Craig McMillian aka Kirantana Khalsa  (Joined 3HO 1971 Hari Shabd Singh))",
      "description": "George Craig McMillian also known as Kiriantana Khalsa, who met Yogi Bhajan in 1971, at 22 years old, and became one of his first bodyguards. He has many stories to share including moving on from 3HO to teach Kundalini Yoga in war-torn countries including Bosnia, Palestine and Egypt. Kirantana is also a musician, recording artist, published author, and a devout Amritdhari-Udasi Sikh Song Credit: Pacing the Cage by Bruce Cockburn",
      "release": "2020-12-31T22:27:52Z",
      "duration": "01:55:40.7600000",
      "explicit": false,
      "spotifyId": "3FVKOyQODiHkErKhZEd6ad",
      "appleId": 1000504073633,
      "youTubeId": "RTfu5Nq2B6o",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3FVKOyQODiHkErKhZEd6ad",
        "apple": "https://podcasts.apple.com/podcast/episode-12-george-craig-mcmillian-aka-kirantana-khalsa/id1542075885?i=1000504073633",
        "youtube": "https://www.youtube.com/watch?v=RTfu5Nq2B6o"
      }
    },
    {
      "id": "769248b0-b830-495c-83b3-a0eb7451b01a",
      "title": "Episode 11: SiriNirongkar Singh Khalsa (Mother joined 3HO 1976 when he was 9yrs old)",
      "description": "Siri NirongKar Singh Khalsa (now goes by Siri) was born in 1967 in the Boston area. He’s 53 years old currently. His mother converted to 3HO Sikhism in 1976, (he was 9) then moved into ashrams in Los Angeles, New Mexico, Oregon. 1981 went to India and attended boarding school. (GNFC). He graduated from India 1985, went on to work for Akal Security, Bodyguard to Yogi Bhajan, went back to India and ran the school for a few years, came back to the states and while employed as a paramedic I was involved in caring for Yogi Bhajan until his death. Song Credit: Black Dog by Led Zeppelin",
      "release": "2020-12-30T03:29:33Z",
      "duration": "03:38:07.8400000",
      "explicit": false,
      "spotifyId": "7CPuwg9aCGnpWKqzZghFpJ",
      "appleId": 1000503884098,
      "youTubeId": "5Wg9q6Tp4kI",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7CPuwg9aCGnpWKqzZghFpJ",
        "apple": "https://podcasts.apple.com/podcast/episode-11-sirinirongkar-singh-khalsa-mother-joined/id1542075885?i=1000503884098",
        "youtube": "https://www.youtube.com/watch?v=5Wg9q6Tp4kI"
      }
    },
    {
      "id": "ecc9cce1-3e50-4b1f-b395-88bca5c28c75",
      "title": "Episode 10: Siriji Lamenzo (Born and raised in 3HO as Siri Sunderta Kaur Khalsa in 1976)",
      "description": "Today\u0027s guest is Siriji Lamenzo, born Siri Sunderta Kaur Khalsa in 1976 in Hartford, CT. Most of her family on her mom\u0027s side are all in 3HO. Grandma, 3 aunts, and lots of cousins. She has 2 older sisters who also were born and raised in 3ho and “swapped”, sent to India etc. She was sent to India in 1983 at age 7. Went to GNFC and GRD, came home in 1991. She did all the usual 3HO things--children\u0027s camp, India, etc. She never felt any connection to 3HO. And never got into doing yoga or meditation. She removed herself as best as she could after finishing high school in Espanola, and has been open about her own negative experiences in India and with 3HO for as long as she can remember. She’s spent many, many years unravelling the trauma of the 3HO upbringing and the effects it\u0027s had on her life and who she is. Song Credit: \u0027Radio\u0027 by Rancid",
      "release": "2020-12-27T01:50:35Z",
      "duration": "01:59:17.5750000",
      "explicit": false,
      "spotifyId": "1keWX5DFyEgLDJiGrr4SxQ",
      "appleId": 1000503599724,
      "youTubeId": "LaoYv_jpmnE",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1keWX5DFyEgLDJiGrr4SxQ",
        "apple": "https://podcasts.apple.com/podcast/episode-10-siriji-lamenzo-born-and-raised-in-3ho-as/id1542075885?i=1000503599724",
        "youtube": "https://www.youtube.com/watch?v=LaoYv_jpmnE"
      }
    },
    {
      "id": "9d14310c-04d9-4c5a-b37b-7138d348e43d",
      "title": "Episode 9: Ximena Saling (Joined 3HO at age 16; 2002-2020)",
      "description": "Ximena was born and raised in Mexico City. In 2002, at age 16 she moved into an ashram and adopted the 3ho lifestyle. She married into 3HO after meeting her ex husband at summer solstice in Espanola, New Mexico. She began teaching KY in 2004 and has been a part of the Aquarian Academy and reached professional level, as well as served as \u0022SSS cabin Manager\u0022 for multiple years at Summer and Winter solstices and co directed KYC for the last 3 years as well as a Staff member at MPA in 2015. Song: \u0022Nothing arrived Live version\u0022 by Villagers",
      "release": "2020-12-24T01:06:42Z",
      "duration": "01:50:35.5600000",
      "explicit": false,
      "spotifyId": "7luie9wogk5AEF3BsjPwcR",
      "appleId": 1000503382085,
      "youTubeId": "96pXWOhb6ZA",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7luie9wogk5AEF3BsjPwcR",
        "apple": "https://podcasts.apple.com/podcast/episode-9-ximena-saling-joined-3ho-at-age-16-2002-2020/id1542075885?i=1000503382085",
        "youtube": "https://www.youtube.com/watch?v=96pXWOhb6ZA"
      }
    },
    {
      "id": "47eb842b-9f7d-4e5d-a37b-ccea54768dbe",
      "title": "Episode 8: Dr. Ron Alexander (1970-79)",
      "description": "Dr Ron Alexander (formerly Shama Singh) is a Mind- Body psychotherpist, international trainer of health care professionals specializing in creativity and trauma. He was recruited by Yogi Bhajan to co found the original Kundalini Research Institute and the Center for Health and Healing at Cedars Sinai Medical Center in Los Angeles. He has been teaching yoga psychology, mindfulness and trauma informed yoga since 1974 and travels the world now teaching and conducting training and workshops.",
      "release": "2020-12-21T23:18:52Z",
      "duration": "01:20:42.4000000",
      "explicit": false,
      "spotifyId": "35Gge1rPNYO5POfb05M7T8",
      "appleId": 1000503157736,
      "youTubeId": "D55GPtnMWHw",
      "subjects": [
        "3HO",
        "Self-Help",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/35Gge1rPNYO5POfb05M7T8",
        "apple": "https://podcasts.apple.com/podcast/episode-8-dr-ron-alexander-1970-79/id1542075885?i=1000503157736",
        "youtube": "https://www.youtube.com/watch?v=D55GPtnMWHw"
      }
    },
    {
      "id": "cb0bf46a-52bd-407f-bb52-301b7bd07ac6",
      "title": "Episode 7: HarGobind (Born and Raised in 3HO; 1988)",
      "description": "Hargobind Khalsa was born in the Baltimore, Maryland ashram in 1988. His family moved to the Herndon ashram when he was 4. He attended school in India in 1996 for 10 years. He then worked as the assistant to the Principle at Miri Piri Academy from 2006 to 2010. He lives in Portland Oregon with his wife, Gurusurya, and their dog, Remy.",
      "release": "2020-12-17T22:53:52Z",
      "duration": "01:23:58.5600000",
      "explicit": false,
      "spotifyId": "4alFoZyXhYM5tXiJc3OcRM",
      "appleId": 1000502868852,
      "youTubeId": "Gur2CH4hQp0",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4alFoZyXhYM5tXiJc3OcRM",
        "apple": "https://podcasts.apple.com/podcast/episode-7-hargobind-born-and-raised-in-3ho-1988/id1542075885?i=1000502868852",
        "youtube": "https://www.youtube.com/watch?v=Gur2CH4hQp0"
      }
    },
    {
      "id": "c417314e-4a7d-45be-b849-5f6f54064740",
      "title": "Episode 6: Marc Pootmans (30 year student of Kundalini outside of 3HO)",
      "description": "Marc was initiated into an oral tradition of Kundalini from India about 30 years ago from his teacher, Dennis in Canada. He shares his story of learning about how his teacher and Har Bhajan Singh Puri (Yogi Bhajan) knew each other before 3HO even was started.",
      "release": "2020-12-14T23:02:43Z",
      "duration": "01:08:48.2800000",
      "explicit": false,
      "spotifyId": "4F32sxCCArnP1ZDdp0gy6g",
      "appleId": 1000502486976,
      "youTubeId": "AOlVScMzLbE",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4F32sxCCArnP1ZDdp0gy6g",
        "apple": "https://podcasts.apple.com/podcast/episode-6-marc-pootmans-30-year-student-of-kundalini/id1542075885?i=1000502486976",
        "youtube": "https://www.youtube.com/watch?v=AOlVScMzLbE"
      }
    },
    {
      "id": "03b8269b-f423-4c39-8519-559d724d3500",
      "title": "Episode 5: Dharam Khalsa Lietz (Born and Raised in 3HO; 1986)",
      "description": "Dharam was born and raised in 3HO and went to school in India for 10 years. He shares a vulnerable story of his childhood and the transformation and authenticity that 2020 has been for him. He still consider himself a Sikh and a part of the 3HO community.",
      "release": "2020-12-13T19:53:41Z",
      "duration": "01:53:24.4400000",
      "explicit": false,
      "spotifyId": "2UUk9wUBz8wUnxrRP7Gzxi",
      "appleId": 1000502365365,
      "youTubeId": "isC3wAP_x4g",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2UUk9wUBz8wUnxrRP7Gzxi",
        "apple": "https://podcasts.apple.com/podcast/episode-5-dharam-khalsa-lietz-born-and-raised-in-3ho-1986/id1542075885?i=1000502365365",
        "youtube": "https://www.youtube.com/watch?v=isC3wAP_x4g"
      }
    },
    {
      "id": "017f22e8-d46b-4d02-bc4a-237a61996427",
      "title": "Episode 4: Meeri Bylund (Born and Raised in 3HO Meeri Peeri Singh Khalsa)",
      "description": "Meeri Bylund is an artist and designer who resides in Santa Fe New Mexico with his husband Blake and dog Charlie. Meeri was born and raised \u0022Meeri Peeri Singh Khalsa\u0022 in 3HO and survived physical, emotional and spiritual abuse directly from Yogi Bhajan when he was a teenager. Now he wants to shed light on those abuses as well as provide support for others.",
      "release": "2020-12-11T22:09:22Z",
      "duration": "01:14:26.8000000",
      "explicit": false,
      "spotifyId": "0VuuKpUHgt5gxp6NBxi0cj",
      "appleId": 1000502171084,
      "youTubeId": "j8B6vnfFYm8",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0VuuKpUHgt5gxp6NBxi0cj",
        "apple": "https://podcasts.apple.com/podcast/episode-4-meeri-bylund-born-and-raised-in-3ho-meeri/id1542075885?i=1000502171084",
        "youtube": "https://www.youtube.com/watch?v=j8B6vnfFYm8"
      }
    },
    {
      "id": "84dbab29-ed69-49ff-bb11-c64ef70e3f43",
      "title": "Episode 3: Gnosis Rena Garcia (formerly GuruRattan Kaur Khalsa; Born and Raised in 3HO)",
      "description": "Gnosis Rena Garcia (formerly GuruRattan Kaur) was born and raised in the 3HO Los Angeles Ashram. She attended school in India at MPA from ages 12-18, graduating in 2006 . She is a Certified Therapeutic Hypnotist and teaches Breath-work and Meditation currentyl.",
      "release": "2020-12-11T18:59:49Z",
      "duration": "01:13:18.0400000",
      "explicit": false,
      "spotifyId": "74X4evtTbDvFzJf55iDFy5",
      "appleId": 1000502171085,
      "youTubeId": "0a_GnuVJD3I",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74X4evtTbDvFzJf55iDFy5",
        "apple": "https://podcasts.apple.com/podcast/episode-3-gnosis-rena-garcia-formerly-gururattan-kaur/id1542075885?i=1000502171085",
        "youtube": "https://www.youtube.com/watch?v=0a_GnuVJD3I"
      }
    },
    {
      "id": "0e7b9b5b-cad5-4f4f-ba16-2dd0a380f099",
      "title": "Episode 2: Tej Steiner (1970-1988)",
      "description": "Tej became involved with 3HO in 1970 while living in Toronto, Canada, becoming the Canadian Director of 3HO and Sikh Dharma. In 1988, he left both organizations when he found out about YB’s sexual involvement with his Secretariate staff. He’s founder of The Heart Circle Network and teaches the Heart Circle model internationally within organizations and businesses. His latest book is, Waking Up with Everyone Around Us.",
      "release": "2020-11-25T17:41:41Z",
      "duration": "01:16:08.1200000",
      "explicit": false,
      "spotifyId": "687lFB6d2afIqZLpsiS55e",
      "appleId": 1000500239186,
      "youTubeId": "433Vv3xZDyQ",
      "subjects": [
        "3HO",
        "Yoga Cult",
        "Sikhism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/687lFB6d2afIqZLpsiS55e",
        "apple": "https://podcasts.apple.com/podcast/episode-2-tej-steiner-1970-1988/id1542075885?i=1000500239186",
        "youtube": "https://www.youtube.com/watch?v=433Vv3xZDyQ"
      }
    },
    {
      "id": "7114b59c-9f3f-445f-898e-36111b05d899",
      "title": "Episode 1: GuruBir Singh and Gur Siri Kaur (1974-1992)",
      "description": "Guru Bir Singh and Gur Siri Kaur received their names from Yogi Bhajan in the Honolulu Ashram in 1974, and were married in 1975. They lived in Los Angeles and Northern California before \u0022graduating\u0022 from 3HO in 1992. Black Diamond by The Rippingtons All You Need is Love by The Beatles",
      "release": "2020-11-21T23:41:21Z",
      "duration": "01:03:35.2000000",
      "explicit": false,
      "spotifyId": "5xMsW95LVe8O13ooQVydiS",
      "appleId": 1000500239187,
      "youTubeId": "KtFEg1nn-xY",
      "subjects": [
        "3HO",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5xMsW95LVe8O13ooQVydiS",
        "apple": "https://podcasts.apple.com/podcast/episode-1-gurubir-singh-and-gur-siri-kaur-1974-1992/id1542075885?i=1000500239187",
        "youtube": "https://www.youtube.com/watch?v=KtFEg1nn-xY"
      }
    }
  ]
}