{
  "id": "93202558-ea2d-488b-86a6-d8b60b619ea9",
  "name": "GZT",
  "youTubeChannelId": "UClWewRX7n_IY3mBbxmttR5Q",
  "episodes": [
    {
      "id": "50241876-28df-4a0a-8953-2686aeeae99b",
      "title": "Tünelden ormana: Yahudi topluluk neyi gizliyor?",
      "description": "Bu hafta sonu çocuğunuzu gezdirmek, eğlendirmek için nereye götürmek istersiniz? Devasa balıklar görebileceği bir akvaryuma mı, koşup eğlenebileceği parklara mı, yoksa keyifli bir film izleyebileceği sinemaya mı? Sorumuzu biraz değiştirelim. Bu hafta sonu 1 tane değil, 160 çocukla vakit geçirecek olsanız ne yapardınız? Biraz düşünmek lazım değil mi? \n\nSiz ne yapacağınızı düşünedurun, ben ne yapmayacağınızı söyleyeyim. 160 tane çocuğu Guatemala’nın güneyinde bir çiftliğe götürüp, ailelerinden habersiz bir şekilde onları ağır şartlar altında eğitime tabi tutup bir de onları kurtarmaya gelen polisle çatışmazdınız.Siz yapmazdınız ama radikal bir Yahudi topluluğu olan Lev Tahor, bunu ve çok daha fazlasını yaptı. Alıkoydukları 160 çocuğu bir tarım bölgesinde insanlık dışı muameleyle kendilerince “dindar” birer Yahudi olmaları için eğitiyorlardı.\n\nGuatemalalı yetkililer, ultra-Ortodoks bir topluluk olan Lev Tahor\u0027un işlettiği bir çiftlikte en az 160 çocuk ve gencin insan ticareti ve diğer suçların kurbanı olabileceğini söyledi. Geçmişte çocuk istismarıyla bağlantıları bulunan ultra-Ortodoks Yahudi topluluğu Lev Tahor\u0027a ait bir yerleşkeye baskın düzenlendi . Savcılar, insan ticareti ve diğer suçların kurbanı olduğuna inandıkları en az 160 çocuk ve genci siteden çıkardıklarını söyledi.\n\nBu olayı ve Lev Tahor topluluğunu detaylıca inceleyeceğiz. Hatırlarsanız birkaç ay önce ABD’de bir sinagogun altında tüneller kazıldığı ve orada çok tatsız olayların döndüğü ortaya çıkmıştı. Yani, zaten sinagog seninken neden altına tünel kazıp gizli kapaklı işler çevirirsin ki? Guatemala’daki olaydan sonra bazı Yahudilerin ve Yahudi toplulukların buna benzer faaliyetlerini sizler için araştırdım. Epstein’den Rosenbaum’a, New York’tan Guatemala’ya, Filistin’den Avrupa’ya uzanan farklı olayları inceleyeceğiz. Gündeme gelmeyenlerin masaya yatırıldığı yere, Propaganda’ya hoş geldiniz.\n\n00:00 Giriş\n01:30 Lev Tahor Topluluğu\n05:03 Sinagogun Altındaki Tünel\n06:49 Levy Izhak Rosenbaum\n07:31 İsrail’in Kaçakçılık Faaliyetleri\n10:20 Çok Daha Fazlası ve Kapanış\n\nÖzel ayrıcalıklardan yararlanmak için GZT\u0027ye katıl:\nhttps://www.youtube.com/channel/UClWewRX7n_IY3mBbxmttR5Q/join\n\nVideoyu beğenin! Yeni videolar için abone olun: https://bit.ly/3oO5zRn\n\nHaberlerin anlık bildirim ile cebinize gelmesi için \u0027GZT\u0027 mobil uygulamamızı indirin!\n\nEditör Anlatıyor: https://www.youtube.com/playlist?list=PLCfrUpxxk3D1qrTbkJOhHFCnuoBy8EtXn\n10/ON: https://www.youtube.com/playlist?list=PLCfrUpxxk3D0wZ4UDkzH3lfW04Gs9r1CX\nGZT İstihbarat: https://www.youtube.com/playlist?list=PLCfrUpxxk3D3YdOo1TJxG4Tloq4U0e-DI\nGZT Profil: https://www.youtube.com/playlist?list=PLCfrUpxxk3D32PKj7Kiih2YB4E00gDJ3N\nModern Ordular: https://www.youtube.com/playlist?list=PLCfrUpxxk3D2Bbhi2RQgzyommPV4hYedf\nUzman Anlatıyor: https://www.youtube.com/playlist?list=PLCfrUpxxk3D1_2eXXgDjhOOLmOYdYJ2NV\nDoğu Türkistan: https://www.youtube.com/playlist?list=PLCfrUpxxk3D3lg_5LGUtzKiFL_tEVIUo7\nGazze\u0027de Neler Oluyor: https://www.youtube.com/playlist?list=PLCfrUpxxk3D18biymnIyKe8p61v1pRi3H\n\n🔎 BİZE ULAŞIN:\nWeb sitemiz: https://www.gzt.com/\nGZT Uygulama Android: https://play.google.com/store/apps/details?id=com.pirimedya.gzt\u0026hl=tr\u0026gl=US\nGZT Uygulama İOS: https://apps.apple.com/tr/app/gzt/id1156493430 \nGZT Uygulama Huawei: https://onelink.to/htmuff \nInstagram: https://www.instagram.com/gzt/\nFacebook: http://facebook.com/gzt\nX (Twitter): https://twitter.com/gztcom\nTiktok: https://www.tiktok.com/@gzt\nThreads: https://www.threads.net/@gzt\nWhatsApp: https://whatsapp.com/channel/0029Va7EgKpEawdsO6KUYm2I\nTelegram: https://t.me/gztcom\n\nMerhaba, \u0027Haberin Sosyal Medyası\u0027 GZT\u0027ye hoş geldin! Türkiye\u0027de dijital haberciliğin benzersiz örneği olan GZT\u0027nin Youtube kanalındasın. Bu kanalda gündem ile ilgili özel içerikler ve röportajlar bulabilirsin. Tarihten siyasete, bilimden sanata her alanda içerik bulabileceğiniz kanalımıza abone olmayı ve bizi diğer sosyal mecralarda takip etmeyi unutma!\n\nHer gün 1 yeni video 🙌\n\nİzlediğin için teşekkürler!",
      "release": "2025-02-13T18:20:50Z",
      "duration": "00:11:33",
      "explicit": false,
      "youTubeId": "0KNEz3YyT_0",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0KNEz3YyT_0"
      }
    }
  ]
}