{
  "id": "81c52f0f-0dda-455d-9683-f6a903b0fb90",
  "name": "Half-Cocked Tales",
  "spotifyId": "08XBNGXgpr1TahUaenfX7n",
  "appleId": 1714696540,
  "episodes": [
    {
      "id": "88c59d14-a9f9-4f06-9152-39e2e8f90b87",
      "title": "Top Five Brainwashing Secrets for Dirty Mormons",
      "description": "Join us in the lounge as Dan, the Professor, and Amber discuss experiences growing up in the Mormon Church and the impact it had on their beliefs and sense of identity. They explore the role of testimony and how it can be a form of brainwashing. They also discuss the manipulative power of persecution and the pressure to conform to religious practices. The conversation highlights the transition from innocence to doubt and the changes in church practices over time. In this part of the conversation, the hosts discuss religious education and indoctrination, the lack of critical thinking skills in education, the origins of Mormonism and Joseph Smith, polygamy and marriage in Mormonism, and the translation of hieroglyphics and The Pearl of Great Price. This conversation delves into the manipulation of power within the Mormon Church, highlighting the hierarchy and gender inequality that exists. It explores the restrictions placed on women and the control exerted by the priesthood. The conversation also touches on the abuse and secrecy within the church, as well as the propagation of lies and faith-promoting rumors. It discusses the history of polygamy and the manipulation of Joseph Smith. The impact of faith crisis and the loss of members is examined, along with the church\u0027s resistance to change and progress. The conversation concludes by considering the Mormon Church as a cult. In this conversation, the hosts discuss their experiences growing up in the Mormon Church and shed light on the abusive practices within the organization. They encourage listeners to have conversations and seek support outside of the church.    Latter Day Saint movement Personal Mormon Faith Crisis Report – Introduction and Overview  Joseph Smith List of Joseph Smith\u0027s wives Helen Mar Kimball, 14 year old Wife of Joseph Smith Pearl of Great Price/ Breathing Permit of Hôr “The Breathing Permit of Hôr” Among The Joseph Smith Papyri   Find us at the Half-Cocked Tales Lounge Half-Cocked Tales Discord",
      "release": "2024-01-16T18:03:45Z",
      "duration": "01:35:51.5620000",
      "explicit": true,
      "spotifyId": "0iBHUxM78ROpCx0iQRQP2c",
      "appleId": 1000641871412,
      "subjects": [
        "Cult Psychology",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0iBHUxM78ROpCx0iQRQP2c",
        "apple": "https://podcasts.apple.com/podcast/top-five-brainwashing-secrets-for-dirty-mormons/id1714696540?i=1000641871412"
      }
    }
  ]
}