{
  "id": "908e3b2e-4a3e-4f91-b760-136dda865cb1",
  "name": "Hallowed History",
  "youTubeChannelId": "UCsWXb6OILXsb2lT51Q_swvg",
  "episodes": [
    {
      "id": "5a2fbfee-b542-4373-ba01-26c718bcad97",
      "title": "4\u002B HOURS of Ancient Cults, Oracles, and Prophets",
      "description": "In the ancient world, religion was never just about worship—it was power, prophecy, mystery, and fear. Cults gathered in hidden temples. Prophets claimed visions of the future. Oracles spoke in riddles from sacred caves. These weren’t just spiritual leaders—they were political players, revered mystics, and sometimes, dangerous manipulators.\n\nIn this 4\u002B hour documentary, we explore the shadowy world of ancient cults, divine messengers, and the prophetic traditions that once shaped empires. From blood rituals and sacred trances to cryptic visions that foretold the rise and fall of kings, these are the real stories behind the ancient world’s most mysterious figures. Whether seen as madmen or messengers of the gods, they left behind legacies that still fascinate us today.\n\nThis long-form history documentary is perfect for anyone fascinated by ancient religions, mysterious rituals, and the strange intersection of power and prophecy. Dive into forgotten cults, real oracles, and prophetic figures who claimed to speak for the gods. Great for background listening, late-night viewing, or falling asleep to something dark, immersive, and educational. Ideal for fans of mythology, archaeology, ancient mysticism, and true historical mysteries. If you\u0027re searching for eerie documentaries about spiritual power, ancient secret societies, divine visions, or just long relaxing history videos—this journey through ancient cults and prophets is made for you.\n\n00:00 Intro\n00:41 The Cult of Mithras\n22:23 The Sibyls\n43:05 The Pythia of Delphi\n01:01:41 Oracle Bones\n01:21:31 The Druids\n01:42:08 The Cult of Osiris\n02:10:30 The Cult of Cybele and Attis\n02:34:22 The Eleusinian Mysteries\n03:00:16 Zoroaster (Zarathustra)\n03:21:36 The Oracle of Ammon\n03:48:46 The Cult of Hecate\n\nDisclaimer:\nThe images, audio, and video featured on this channel are a combination of licensed stock, attribution-based, royalty-free, public domain, or used under the principles of fair use. No copyright infringement is intended, and all rights remain with their respective owners. If you are the copyright holder or represent one and have concerns about any material used in this video, please contact me directly—I’ll address the issue promptly.\n\nAt times, when original images or footage of historical events aren’t available, Hallowed History may use comparable visuals to enhance storytelling. Every effort is made to ensure historical and visual accuracy. All content is thoroughly researched, produced, and presented within an educational context. While we\u0027re passionate about history, we’re not experts in every subject—so feel free to reach out with corrections, insights, or suggestions for future topics.",
      "release": "2025-04-20T03:14:10Z",
      "duration": "04:14:16",
      "explicit": false,
      "youTubeId": "BMYq9SADCe4",
      "subjects": [
        "Mithraism",
        "Zoroastrianism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BMYq9SADCe4"
      }
    },
    {
      "id": "44bcbcec-2179-4221-b4dc-c13447981430",
      "title": "4\u002B HOURS of the Most Disturbing Cults in History",
      "description": "Behind closed doors and beneath a façade of spiritual enlightenment, some of the darkest chapters in modern history unfolded. These are the cults that didn’t just break away from society—they twisted it. With mind control, abuse, mass suicides, apocalyptic visions, and manipulative leaders, these real-life groups went far beyond the bounds of belief.\n\nIn this 4\u002B hour documentary, we explore the most disturbing cults ever documented. From doomsday prophecies to government standoffs and chilling rituals, these stories reveal how charisma, fear, and blind devotion can be weaponized to terrifying ends. These aren’t fictional horror stories. They happened—and the consequences were devastating.\n\nThis long-form cult documentary is perfect for fans of true crime, psychological horror, and disturbing real-life stories. Whether you’re looking for terrifying background audio, chilling documentaries to fall asleep to, or long videos about cults and mass manipulation, this deep dive delivers. Ideal for anyone who enjoys creepy history, criminal minds, twisted belief systems, and real cult stories more shocking than fiction. Great for late-night listening, relaxing with something dark and eerie, or learning about cult leaders, brainwashing, and the psychology of control. If you\u0027re into documentaries about Jonestown, Charles Manson, or Heaven’s Gate, or searching for disturbing stories to play while working, sleeping, or winding down—this video was made for you.\n\n0:00 Intro\n0:58 The Order of the Solar Temple – The Apocalyptic Cult of Ritual Suicide\n29:12 Aum Shinrikyo – The Japanese Doomsday Cult Behind a Subway Attack\n56:10 The Ant Hill Kids – The Canadian Cult of Torture and Control\n1:20:30 The Branch Davidians – The Waco Standoff and Government Siege\n1:45:43 Children of God – The Cult That Exploited Faith and Families\n2:11:46 Superior Universal Alignment – The Brazilian Cult That Targeted Children\n2:37:22 The Twelve Tribes – The Hidden Cult Behind the Café Façade\n2:51:13 Heaven’s Gate – The Mass Suicide to Catch a Spaceship\n3:16:52 The Peoples Temple (Jonestown Massacre) – The Deadliest Cult in Modern History\n3:35:48 The Manson Family – The Cult That Tried to Start a Race War\n4:02:40 The Rajneesh Movement – The Cult That Took Over an American Town\n\nThe images, audio, and video featured on this channel are a combination of licensed stock, attribution-based, royalty-free, public domain, or used under the principles of fair use. No copyright infringement is intended, and all rights remain with their respective owners. If you are the copyright holder or represent one and have concerns about any material used in this video, please contact me directly—I’ll address the issue promptly.\n\nAt times, when original images or footage of historical events aren’t available, Uncharted Mysteries may use comparable visuals to enhance storytelling. Every effort is made to ensure historical and visual accuracy. All content is thoroughly researched, produced, and presented within an educational context. While we\u0027re passionate about history, we’re not experts in every subject—so feel free to reach out with corrections, insights, or suggestions for future topics.",
      "release": "2025-04-11T18:42:56Z",
      "duration": "04:23:23",
      "explicit": false,
      "youTubeId": "TZT0gWviBj0",
      "subjects": [
        "Order of the Solar Temple",
        "Peoples Temple",
        "Bhagwan Shree Rajneesh",
        "Branch Davidians",
        "Heaven\u0027s Gate",
        "Manson Family",
        "Ant Hill Kids",
        "Aum Shinrikyo",
        "Children Of God",
        "Superior Universal Alignment",
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TZT0gWviBj0"
      }
    }
  ]
}