{
  "id": "2e0e605b-7053-4a0e-9d5a-9a21d138ac94",
  "name": "Hannah Wiz Podcast | The Show About Mindset, Spirituality \u0026 Healing",
  "spotifyId": "25tJr15Qr9YebdDzcJnS8f",
  "appleId": 1622147010,
  "youTubeChannelId": "UCWoiwCmKhYMjjhq8ViEZLQQ",
  "episodes": [
    {
      "id": "95867fff-1c87-455c-8ca4-483c521c3a17",
      "title": "From Brainwashed to Breaking Free: A Cult Survivor\u0027s Journey to Freedom | Peter Young",
      "description": "In this episode, Hannah sits down with Peter Young, who shares his firsthand experience of being sucked into a cult. Peter discusses the tactics of toxic leadership that led to his indoctrination and the dangers posed by such groups. He bravely opens up about his journey to escape the cult\u0027s grip and his path to recovery. Tune in for a raw and insightful conversation about breaking free from manipulation and reclaiming personal empowerment! \u0026#x1f4aa;\u0026#x1f3fb; Connect with Peter: www.authorpeteryoung.com Thank you so much for listening! — Subscribe so you don’t miss a single episode! If you like this podcast, share it with someone who is looking to live an extraordinary life. For Daily Inspiration: ✨ Instagram: http://www.instagram.com/hannahwiz_ ✨ Youtube: http://www.youtube.com/hannahwiz ✨ TikTok: http://www.tiktok.com/hannahwiz_ ✨ Download your free morning meditation: https://bit.ly/getyourmorningmeditation If you want to dive even deeper into becoming your best self and you would like my support, check out my website https://www.hannahwiz.com Thank you so much for being part of this beautiful community. I am sending you so much love and a big, big hug. Love, Hannah — Hannah Wiz is a life coach, host of The Hannah Wiz Podcast, certified yoga teacher, and founder of Yoga Junkies, a yoga lifestyle for on and off the mat. Hannah’s mission is to teach you how to turn your dreams into reality. On this channel, you will find empowering interviews with inspiring guests who share their knowledge and stories about mindset, inspiration, mental health, mindfulness, healing, passion, yoga, and modern spirituality. You will also be guided through powerful meditations and learn the tools and tactics to heal your heart, follow your intuition, and connect with your true authentic self. This channel will help you to awaken your full potential. ✨It’s time to shine your light! ✨",
      "release": "2024-05-10T16:00:00Z",
      "duration": "00:50:06.4580000",
      "explicit": false,
      "spotifyId": "0rMUVwaQe2a3Pzg4Pji9XF",
      "appleId": 1000655192934,
      "youTubeId": "hZV8OgzTSyA",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rMUVwaQe2a3Pzg4Pji9XF",
        "apple": "https://podcasts.apple.com/podcast/from-brainwashed-to-breaking-free-a-cult-survivors/id1622147010?i=1000655192934",
        "youtube": "https://www.youtube.com/watch?v=hZV8OgzTSyA"
      }
    }
  ]
}