{
  "_ts": 0,
  "id": "359a26cc-3912-465a-8998-1d8fe069a273",
  "name": "Hannibal Is Hungry",
  "youTubeChannelId": "UClGw1m5bqayp2w1cGdhbGUA",
  "episodes": [
    {
      "id": "343ad621-63cd-4b4f-8c17-baf7553edea5",
      "title": "Exposed: The CULT of Grant Cardone",
      "description": "Start the FREE Introduction Course with CourseCareers Now: https://coursecareers.com/a/hannibal\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UClGw1m5bqayp2w1cGdhbGUA/join\n\n🚀 Click Here to join My Email Newsletter to get updates on the channel \u0026 More!: https://shorturl.at/zDKWY\n\n🚀  CHECK OUT MY PATREON - Join my Patreon community today and help fuel our journey into uncovering scams, gaining financial insights, and empowering our lives – your support makes all the difference! https://bit.ly/4aN0K4n\n\n\n\n--------\n🚀Check Out Para app:https://bit.ly/3m8pRtQ\n Your ultimate gig-driving sidekick! With Para, you get:\n🔮 Auto Decline filters - Customize your offers to suit your preferences\n📍 Geo Filter \u0026 Restaurant Filter - Avoid sketchy areas and unwanted restaurant orders\n🏴 Flagging Feature - Mark locations or customers you\u0027d rather not deal with\n🏠 House/Apartment Feature - Know your destination before you hit accept\n\nAnd that\u0027s just the beginning! Transform your gig-driving experience with the Para app today, and take control of your earnings, safety, and work-life balance like never before!\n\n----------\n📱💰👨‍💼 Want to maximize your earnings as a gig worker? \n💪 Look no further than the SOLO app! \n🚀 Manage your income, track expenses, and guarantee your pay with ease. \n💸💼 Plus, get $10 just for signing up and linking your active gig work account!\n🎉 Don\u0027t wait, download SOLO today! 📲💻\nhttps://bit.ly/3N5dPJb\n-------------\n\n🚀Try the BEST Budget App from Simplifi by Quicken! 30 Days Free\nhttps://bit.ly/3HrKAhB\n\n🚀Support my Channel\nVenmo - @HannibalisHungry\nCashapp - $HannibalisHungry\n\n\n\n\n\n.\nCredit to owner: - \n\nThis site may contain copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available in an effort to advance understanding of environmental, political, human rights, economic, democracy, scientific, and social justice issues, etc. we believe this constitutes a ‘fair use’ of any such copyrighted material as provided for in section 107 of the US Copyright Law. In accordance with Title 17 U.S.C. Section 107, the material on this site is distributed without profit. \n \nCOPYRIGHT DISCLAIMER:- \n\nCopyright Disclaimer under section 107 of the Copyright Act of 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.”",
      "release": "2024-05-15T00:00:05Z",
      "duration": "00:11:57",
      "explicit": false,
      "youTubeId": "6F31DQiE6Vo",
      "subjects": [
        "Grant Cardone"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6F31DQiE6Vo"
      }
    }
  ]
}