{
  "id": "354e2f37-1a55-4357-9692-cddbfd3b4435",
  "name": "Hanna Castañeda",
  "youTubeChannelId": "UC1uivhmqsw6cGl3EhFMGrYA",
  "episodes": [
    {
      "id": "aa9b5b56-7958-4f3b-8a70-a9b6d8ca2543",
      "title": "New Age Deception to Jesus (BORN AGAIN)",
      "description": "This is my testimony from being raised in the radical Unification Church cult and then seeking healing via New Age Spirituality, witchcraft, and indigenous shamanism leading me down a dangerous and dark path. Jesus was the last thing I\u0027d consider; even rejected, but I\u0027d come to the end of myself where God \u0022broke me\u0022 to a place of complete surrender.\nAlthough not thoroughly mentioned in the video, my adolescent years had me wandering the globe as a nomad--many times a homeless vagabond. Entangled in the sin of idolatry, lust, addiction, theft, and sexual immorality--by God\u0027s grace I\u0027ve been delivered from being a slave to sin and now free in the One True Creator of this universe. This was none of my own doing, but the Sovereign power of Almighty God revealing His glorious presence which overwhelmed me to the point of days in repentance, glued to the ground and tears that flowed endlessly. I, being overcome in realizing His holiness, His rich mercy and agape\u0027 love for me who was utterly depraved, dead in my sins and completely undeserving yet His grace was suffucient to save and redeem me.\n\nI always thought I believed in God but now I ask people a more important question which is NOT do you believe in God, but do you believe in the right God, the one that can save? Many people know of God and like to speak about Him, but the real question is do we know Him personally and how is He actively working in our lives?\n\nIn the book of Roman chapter 8, the apostle Paul writes about how God made man subject to emptiness; humans were deliberately designed that way so that man could never be complete apart from God. Nature seeks to fulfill the vacuum, so man by nature has sought to fulfill the spiritual void with a variety of physical and emotional experiences. You cannot satisfy an emotional thirst with a physical experience. It is also true that, down deep, man has a deep spiritual thirst for God. One of the problems of our age is that man has endevoured  to satisfy that deep thirst for God with emotional  and physical experiences. This deep thirst for God is one of the reasons behind the pleasure mania in the world today. It also partially explains why people, like myself, abuse drugs and have pseudo-spiritual experiences through the use of these, particularly psychadelics. I truly did believe at the time I was having spiritual experiences with God and now understand it was a conterfeit experience orchestrated by the devil to deceive me.\n\nMy excessive escapism through nomadism and rebellion to yielding to the Holy Spirit via my hippie lifestyle of drugs and immorality was due to not being able to face the reality of my failure to find true fulfillment..so I escaped into unreality. I did not want to admit that I was wrong and as much as I had done all these awesome adventures, tried an array of super-healing modalities, all while trying to sustain being a \u0022good person\u0022 by worldly standards...I was still somehow so empty and confused to why I was!\n\nNot until I realized how incredibly lost I was and repulsed by my lifestyle of sin and self-righteousness, did I actually come to see that I needed saving. And that is the problem-- most people don\u0027t think they need to be saved because their material lifestyle has made them too comfortable to realize it and the god of this world (satan) has blinded them. I\u0027m grateful God pushed me beyond the point of being the slightest comfortable. It took my very stubborn stiff-necked self to experience the on-going hellish nightmare of mental and spiritual torment for me to beg for mercy. God desires a contrite heart and broken spirit and that is exactly the point I had to be, stripped of my pride and call upon Him with all my heart. Praise the Lord because He answered!\n\n\u0022For what shall it profit a man, if he shall gain the whole world, and lose his own soul?\u0022 ~Mark 8:36\n\n\u0022Whoever would save his life will lose it, but whoever loses his life for my sake will find it.\u0022~ Matthew 16:25\n\n\u0022Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.\u0022~ 2 Corinthians 5:17\n\nJust fyi: I want to clarify in the video when I say \u0022I\u0027m still a sinner\u0022; I didn\u0027t mean I go on living in sin. As a young believer here, I chose a poor choice of words. When one is born-again they\u0027re dead to their sins and alive to Christ. I will still make mistakes but will not deliberately be living in the flesh as unbelievers--this is the difference. Through salvation a person goes from sinner to saint, follower, and disciple and passes from death to life. Justified by the blood of Christ and sanctified by the work of His indwelling Holy Spirit. ",
      "release": "2020-07-12T08:21:34Z",
      "duration": "00:25:45",
      "explicit": false,
      "youTubeId": "KPailZfdBQw",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KPailZfdBQw"
      }
    }
  ]
}