{
  "_ts": 0,
  "id": "a1b5c899-1b7a-4a20-afc7-2261b213f522",
  "name": "Happiness Solved",
  "spotifyId": "3XhfvtlZJGuyIl8BqeTx5t",
  "appleId": 1551244792,
  "episodes": [
    {
      "id": "040eb8f3-4f2f-42bf-ad10-0f0e0b4cdf79",
      "title": "406. From Cult to Confidence: Dr. Robyn Lynette\u0027s Journey",
      "description": "Happiness Solved with Sandee Sgarlata. In this episode, Sandee interviews Dr. Robyn Lynette. In this engaging conversation, Dr. Robyn Lynette shares her remarkable journey from growing up in a cult to becoming a successful performance business psychologist. She discusses the challenges she faced, including brainwashing and self-sabotage, and how she learned to overcome them. Dr. Lynette emphasizes the importance of resilience, accountability, and making conscious choices to create a fulfilling life. Her insights on personal growth and the impact of our perceptions provide valuable lessons for high performers and anyone looking to break through barriers in their lives. Guest Bio: Dr Robyn, affectionately known as Mental MacGyver, is a former competitive beach volleyball player turned high-performance business psychologist and professional confidante. She did her graduate work in business psychology with a concentration in high performance and sport. She has been working in the space between executive coach, therapist and best friend for more than fifteen years and has designed her business to support ultra-busy clients who live excessively fast-paced and often global lives. Dr Robyn’s expertise has been showcased through her TEDx talk, Creating Success Out of Chaos, the seven books she has authored, co-authored or contributed to, her Five-Point Paradigm for Creating Success Out of Chaos™, and her signature talk: Take Out the Head Trash: How to fight the demons keeping you awake at 3am. In her downtime she enjoys reading astrophysics for fun, gardening, hiking with her husband and teaching her dog Nebula to do circus tricks. Takeaways: Dr. Lynette\u0027s journey from a cult to independence is inspiring. Understanding brainwashing is crucial for personal growth. Resilience is about moving towards goals, not just stubbornness. Accountability is key for high performers to break barriers. Self-sabotage often stems from past experiences and perceptions. It\u0027s important to articulate what you want to be different. You can only help those who are open to receiving help. Creating boundaries is essential for personal well-being. Success can be created out of chaos with the right mindset. Recognizing the limitations of others can improve relationships. Connect with Dr. Robyn: Website: https://MentalMacGyver.com Email: DrRobyn@MentalMacGyver.com LinkedIn: https://www.linkedin.com/in/robynodegaard/ YouTube: https://www.youtube.com/@DrRobyn TEDx Talk: “Creating Success Out of Chaos” https://youtu.be/k7HKJn7NDZs Keynote: \u0022Take Out the Head Trash! How to fight the demons keeping you awake at 3am\u0022 https://youtu.be/Kx12TTCoojg Nebula practicing circus tricks: https://youtu.be/LvbHNNHCVP4 Connect with Sandee: Website: www.sandeesgarlata.com Podcast: www.happinesssolved.com Facebook: www.facebook.com/coachsandeesgarlata Twitter: www.twitter.com/sandeesgarlata Instagram: www.instagram.com/coachsandeesgarlata",
      "release": "2025-04-16T07:00:00Z",
      "duration": "00:29:08.5840000",
      "explicit": false,
      "spotifyId": "6Zh1PhcoyjeRuv0lD6r6fA",
      "appleId": 1000703707539,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Zh1PhcoyjeRuv0lD6r6fA",
        "apple": "https://podcasts.apple.com/podcast/406-from-cult-to-confidence-dr-robyn-lynettes-journey/id1551244792?i=1000703707539"
      }
    }
  ]
}