{
  "id": "c411bf64-88a4-4ee9-af19-1d76bf1f736f",
  "name": "Harmonic Atheist",
  "youTubeChannelId": "UCrPKXNg9PAL6bROvsaUFvAA",
  "episodes": [
    {
      "id": "0f000802-326b-4ddf-8cb4-29d727cf48eb",
      "title": "Imagine losing everyone you\u0027ve ever known ... by their choice - Scott Homan / Witness Underground",
      "description": "Today I spoke with Scott Homan, a former Jehovah\u0027s Witness (JW) and the Director of the new documentary \u0022Witness Underground,\u0022 which tells the story of several ex-JW\u0027s as they share the pain of questioning their worldview and use music as a way to express the amazing journey of deconversion.\n\nWe touched on many topics, including:\n\n• Being told that Jesus was going to come back soon and personally kill everyone who was not a JW.\n• Hearing that Jesus is in Jehovah\u0027s throne room doing the work of Jehovah but that the main relationship and the direction of prayer was to Jehovah, not Jesus.\n• Being told to not be formulaic with his prayers, but still being given ritual prayers to say.\n• Hearing the preaching of physical immortality promised to those who remained consistently faithful to Jehovah.\n• Never feeling secure in his \u0022salvation\u0022 because there was always the threat that he was not doing enough and would fall away.\n• Seeing people shamed in public for failure to follow all the rules or for having a questionable witness.\n• Hearing fellow JWs talk joyfully about non-believers soon being \u0022blasted\u0022 by Jesus and how they, the witnesses, would help clear the land of the carcasses.\n• Being told from some family that his deceased grandfather was in heaven, and from other family that his grandfather had been annihilated.\n• Being told that he could lose eternal life both during his life here and during the future kingdom.\n• Starting to study evolution even though it had been described as a satanic belief.\n• Finally admitting that Bible stories are fantasy lore and make believe.\n• Being completely shunned by his family after he deconverted.\n• Realizing that most Christians are exceptionally fragile in both their faith and their emotions.\n• The importance of Christians needing to have a \u0022unified\u0022 faith where dissent is strongly discouraged.\n• How the freedom to create lyrics and music led to freethought for many JWs.\n• Seeing those who escaped slowly influencing those still stuck in the cult, even from a distance.\n• Realizing that getting out of the JW cult is like leaving an extremely abusive relationship.\n• The background and goals of the Witness Underground documentary where JWs share their stories, face intense shunning, reclaim their identities, and rebuild their identities post-deconversion, all centered around their music.\n\nMany thanks to Scott for sharing his story and for his amazing work in the Witness Underground documentary!\n\n\n_________________________________________\n\n\nConnect with Scott and the documentary:\n\nhttps://www.witnessunderground.com/\n\nhttps://www.youtube.com/@WitnessUnderground/videos\n\nhttps://linktr.ee/witnessunderground\n\nhttps://www.facebook.com/WitnessUnderground/\n\nInstagram\n @witnessunderground  \n\n_________________________________________\n\n\nPlease subscribe to my other channels (many more channels and videos coming soon!)\n\nhttps://linktr.ee/harmonicatheist\n\n\n_________________________________________\n\n\nTim may be reached by email at: harmonicatheist@yahoo.com\n\n\n_________________________________________\n\n\nYour support for my channel, Harmonic Atheist, is very appreciated.\n\nOne time\nPayPal (preferred):      paypal.me/harmonictim\nVenmo:      @harmonicatheist\nZelle email: harmonicatheist@yahoo.com\nGoFundMe:     https://www.gofundme.com/f/help-tim-stay-full-time-on-harmonic-atheist\n\nMonthly\nhttps://www.patreon.com/harmonicatheist\n\nThanks!\n\n--Tim\n\n\n_________________________________________",
      "release": "2023-11-06T14:37:18Z",
      "duration": "01:42:56",
      "explicit": false,
      "youTubeId": "24PWMNPY008",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=24PWMNPY008"
      }
    }
  ]
}