{
  "_ts": 0,
  "id": "c411bf64-88a4-4ee9-af19-1d76bf1f736f",
  "name": "Harmonic Atheist",
  "youTubeChannelId": "UCrPKXNg9PAL6bROvsaUFvAA",
  "episodes": [
    {
      "id": "89bc9d3a-af35-4c99-a362-acf7e512f538",
      "title": "I escaped a cult of pedophilia and preparing for the apocalypse - Daniella Mestyanek Young",
      "description": "T/W - discussion of child abuse, childhood sexual assault, pedophilia kidnapping, torture, suicide ideation, extreme brainwashing.\n\n_________________________________________\n\n\nToday my co-host Summer Biby and I spoke with Daniella Mestyanek Young, a third-generation survivor of an apocalyptic sex cult called the \u0022Children of God,\u0022 which she wrote about extensively in the book \u0022Uncultured.\u0022\n\nWe discussed many topics, including:\n\n• How David Berg began the apocalyptic cult called \u0022Children of God\u0022 with a strong focus on \u0022sexually liberating children.\u0022\n• Growing up in a context where the cult actively broke up families, kidnapped children, taught them that \u0022rape is love,\u0022 took away all personal rights, and put everyone under David Berg\u0027s total control.\n• How the \u0022sacred transcendent assumption\u0022 that David Berg was God\u0027s Prophet created the deprogramming atmosphere where adults, who should have easily known better, ended up allowing and supporting extreme abuse and criminal behavior.\n• Having the messaging of \u0022self sacrifice\u0022 drilled into her in the cult.\n• She and the other children being severely disciplined almost nonstop and consequently never having spontaneous moments of joy out of fear that something they said or did would earn punishment -- including severe corporal punishment, sexual assault and solitary confinement.\n• Observing that cults start to die when the cult leaders fail to successfully indoctrinate the next generation.\n• Being almost entirely cut off from private time with her own birth mom in a context where all the children had to treat all adults equally as their collective parents most of the time.\n• Being blamed for accidents from clumsiness and being told that they were part of God\u0027s punishment.\n• Being driven to disassociate and shut down her emotions to an extreme level, as a survival mechanism.\n• Being taught that she was lovable only when she was perfect and that she was \u0022nothing without Jesus.\u0022\n• Intentionally choosing to raise the next generation without fear, pain, and violence.\n• Being told that David Berg was \u0022the\u0022 end times prophet from God and they needed to be ready for Jesus\u0027 imminent return.\n• Reading stories of Christian martyrs and fantasizing about being killed for Jesus by the Antichrist.\n• Going through training drills for how to survive and deal with the end times and Tribulation as they prepared to be \u0022God\u0027s insurgency.\u0022\n• Realizing that, in the context of apocalyptic cults, that cult leaders precipitate their own apocalypse because they want the world to burn, to find a way to prove themselves right.\n\nMany thanks to Daniella for sharing her story and for her amazing voice and strength through all she does for the community!\n\n\n_________________________________________\n\n\nConnect with Daniella!\n\nhttps://www.amazon.com/Uncultured-Memoir-Daniella-Mestyanek-Young/dp/125083547X/\n\nhttps://www.uncultureyourself.com/\n\nhttps://linktr.ee/Daniellamyoung\n\nTiktok\n@daniellamestyanekyoung\n\nIG\n@daniellamyoung_\n\nTwitter\n@daniellamyoung \n\n_________________________________________\n\n\nConnect with Summer!\n\nhttps://www.youtube.com/@summerbiby1496/videos\n\n_________________________________________\n\n\nPlease subscribe to my other channels (many more channels and videos coming soon!)\n\nhttps://linktr.ee/harmonicatheist\n\n_________________________________________\n\n\nTim may be reached by email at: harmonicatheist@yahoo.com\n\n_________________________________________\n\n\nYour support for my channel, Harmonic Atheist, is very appreciated.\n\nOne time\nPayPal (preferred):      paypal.me/harmonictim\nVenmo:      @harmonicatheist\nZelle email: harmonicatheist@yahoo.com\nGoFundMe:     https://www.gofundme.com/f/help-tim-stay-full-time-on-harmonic-atheist\n\nMonthly\nhttps://www.patreon.com/harmonicatheist\n\nThanks!\n\n--Tim\n\n\n_________________________________________\n\n\nEnding music by Eyal Raz, \u0022Friends\u0022\n\nhttps://www.youtube.com/watch?v=4qbqNO6DdAQ\n\n\n_________________________________________",
      "release": "2023-11-09T15:42:31Z",
      "duration": "01:55:28",
      "explicit": false,
      "youTubeId": "gTYqnwoasNk",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gTYqnwoasNk"
      }
    },
    {
      "id": "0f000802-326b-4ddf-8cb4-29d727cf48eb",
      "title": "Imagine losing everyone you\u0027ve ever known ... by their choice - Scott Homan / Witness Underground",
      "description": "Today I spoke with Scott Homan, a former Jehovah\u0027s Witness (JW) and the Director of the new documentary \u0022Witness Underground,\u0022 which tells the story of several ex-JW\u0027s as they share the pain of questioning their worldview and use music as a way to express the amazing journey of deconversion.\n\nWe touched on many topics, including:\n\n• Being told that Jesus was going to come back soon and personally kill everyone who was not a JW.\n• Hearing that Jesus is in Jehovah\u0027s throne room doing the work of Jehovah but that the main relationship and the direction of prayer was to Jehovah, not Jesus.\n• Being told to not be formulaic with his prayers, but still being given ritual prayers to say.\n• Hearing the preaching of physical immortality promised to those who remained consistently faithful to Jehovah.\n• Never feeling secure in his \u0022salvation\u0022 because there was always the threat that he was not doing enough and would fall away.\n• Seeing people shamed in public for failure to follow all the rules or for having a questionable witness.\n• Hearing fellow JWs talk joyfully about non-believers soon being \u0022blasted\u0022 by Jesus and how they, the witnesses, would help clear the land of the carcasses.\n• Being told from some family that his deceased grandfather was in heaven, and from other family that his grandfather had been annihilated.\n• Being told that he could lose eternal life both during his life here and during the future kingdom.\n• Starting to study evolution even though it had been described as a satanic belief.\n• Finally admitting that Bible stories are fantasy lore and make believe.\n• Being completely shunned by his family after he deconverted.\n• Realizing that most Christians are exceptionally fragile in both their faith and their emotions.\n• The importance of Christians needing to have a \u0022unified\u0022 faith where dissent is strongly discouraged.\n• How the freedom to create lyrics and music led to freethought for many JWs.\n• Seeing those who escaped slowly influencing those still stuck in the cult, even from a distance.\n• Realizing that getting out of the JW cult is like leaving an extremely abusive relationship.\n• The background and goals of the Witness Underground documentary where JWs share their stories, face intense shunning, reclaim their identities, and rebuild their identities post-deconversion, all centered around their music.\n\nMany thanks to Scott for sharing his story and for his amazing work in the Witness Underground documentary!\n\n\n_________________________________________\n\n\nConnect with Scott and the documentary:\n\nhttps://www.witnessunderground.com/\n\nhttps://www.youtube.com/@WitnessUnderground/videos\n\nhttps://linktr.ee/witnessunderground\n\nhttps://www.facebook.com/WitnessUnderground/\n\nInstagram\n @witnessunderground  \n\n_________________________________________\n\n\nPlease subscribe to my other channels (many more channels and videos coming soon!)\n\nhttps://linktr.ee/harmonicatheist\n\n\n_________________________________________\n\n\nTim may be reached by email at: harmonicatheist@yahoo.com\n\n\n_________________________________________\n\n\nYour support for my channel, Harmonic Atheist, is very appreciated.\n\nOne time\nPayPal (preferred):      paypal.me/harmonictim\nVenmo:      @harmonicatheist\nZelle email: harmonicatheist@yahoo.com\nGoFundMe:     https://www.gofundme.com/f/help-tim-stay-full-time-on-harmonic-atheist\n\nMonthly\nhttps://www.patreon.com/harmonicatheist\n\nThanks!\n\n--Tim\n\n\n_________________________________________",
      "release": "2023-11-06T14:37:18Z",
      "duration": "01:42:56",
      "explicit": false,
      "youTubeId": "24PWMNPY008",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=24PWMNPY008"
      }
    },
    {
      "id": "5050cd57-e56c-43fc-b5c3-58768be7f783",
      "title": "I Escaped from the \u0022Children of God\u0022 Christian Sex Cult and Reclaimed my Identity - Angel DeSantis",
      "description": "*** Trigger warning: sexual assault, child abuse and exploitation, childhood rape, pedophilia, suicide.\n\n____________________________________\n\nToday I spoke with Angel DeSantis, who grew up in the \u0022Children of God\u0022 Christian sex cult, but ultimately escaped as she examined the truth claims of the group, and of Christianity in general, and reclaimed her identity.\n\nWe discussed many topics, including: \n\n• Being indoctrinated to believe that the Antichrist and the End Times were coming very soon and that she was part of the Lord\u0027s End Time army.\n• Being told to prepare for rape by the Antichrist\u0027s soldiers, but to use that as a means to seduce them to believe in Jesus.\n• Seeing older women being sent out to do \u0022Flirty Fishing\u0022 to seduce men sexually and then invite them to become involved in the cult.\n• Being taught that your body belongs to the collective cult community, and consent was assumed.\n• Receiving punishment for being kind toward her own sister, as a means to push the narrative that the entire community was as important as her immediate family.\n• Hearing the Christian message of the Gospel of forgiveness of sin through Jesus altered into a works salvation message, focused primarily on whether the cult leaders where pleased with you.\n• Seeing the cult leaders portray the known Christian characters (such as Yahweh, Jesus, the Holy Spirit, the Angel Gabriel, the Virgin Mary) in hyper-sexual terms.\n• How the cult grooming process led to parents failing to see the danger or to protect their own children.\n• How their worldview about god was highly authoritarian, where he was easily displeased with people, based on the cult leaders\u0027 perspectives.\n• How the Yahweh character is shown as promising unconditional love yet with overwhelming conditions.\n• How Christianity keeps people deeply stuck in cognitive dissonance because confused people are easier to control.\n• How \u0022purity culture\u0022 in the cult was reversed, encouraging women to show as much skin as possible and encouraging young men to \u0022claw at\u0022 a woman\u0027s body.\n• Hearing women being encouraged to not fight rape, but to see it as part of the will and plan of god.\n• How the ultra-patriarchal and misogynistic mentalities of the cult saw women primarily as sex objects and childbearing objects.\n• The extreme sheltering the cult imposed on members, so much that people who chose to leave would find their quality of life so poor that they would be compelled to return.\n• Seeing all other Christians as foolish and unliberated.\n• Being taught that heaven was basically an orgy scene.\n• The importance of being self-aware enough to see red flags in our lives, worldviews, and relationships so that we can be mentally healthy and pass on healthiness to the next generation.\n• The importance of autonomy and logical thinking in escaping fundamentalist religions.\n• The importance of \u0022setting a bar\u0022 that thoughts need to be 1) true and 2) useful, in order to be thoughts we are willing to entertain ... and rejecting any which don\u0027t meet that criteria.\n• Slowly walking toward things that lead you to peace and health, and away from toxic ideas.\n• How the Christian narrative actively degrades your sense of self.\n• After deconversion, the importance of building yourself from ground zero as you discover and create your identity apart from the cult worldview.\n\nMany thanks to Angel for sharing her story!\n\n\n____________________________________\n\nConnect with Angel!\n\nwww.angeldesantis.com\n\nhttps://www.youtube.com/@AngelDeSantis\nhttps://www.youtube.com/@angeldesantis3641/videos\n\n____________________________________\n\nLearn more about the \u0022Children of God\u0022 Christian sex cult:\n\nhttps://www.youtube.com/@childrenofgodcultdocumentr9813/videos\n\n_________________________________________\n\n\n*** Please subscribe to my other channels ***\n(many more channels and videos coming soon!)\n\nhttps://linktr.ee/harmonicatheist\n\n_________________________________________\n\n\nTim may be reached by email at: harmonicatheist@yahoo.com\n\n_________________________________________\n\n\nYour support for my channel, Harmonic Atheist, is very appreciated.\n\nMonthly\nhttps://www.patreon.com/harmonicatheist\n\nOne time\nPayPal:      paypal.me/harmonictim\nVenmo:      @harmonicatheist\nGoFundMe:     https://www.gofundme.com/f/help-tim-stay-full-time-on-harmonic-atheist\n\nThanks!\n\n--Tim\n\n_________________________________________\n\n\nEnding music by Eyal Raz, \u0022Friends\u0022\n\nhttps://www.youtube.com/watch?v=4qbqNO6DdAQ\n\n_________________________________________",
      "release": "2023-05-14T15:03:10Z",
      "duration": "01:45:57",
      "explicit": false,
      "youTubeId": "TDmErdTes74",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TDmErdTes74"
      }
    }
  ]
}