{
  "id": "66450146-a7a6-4ada-ba46-0e962e49ab3b",
  "name": "Hawk\u0027s Podcasts / mdg650hawk",
  "youTubeChannelId": "UCCcrmvbQbfwSZaTgBZPrjMQ",
  "episodes": [
    {
      "id": "187019c1-df33-4e70-a8c6-1bfb9855c48b",
      "title": "Leaving the Mormon Cult, Confronting ICE, and Why MAGA Is a Religion",
      "description": "Leaving the Mormon Cult, Confronting ICE, and Why MAGA Is a Religion\n\nHawk sits down with Chelsea Gods, a San Diego-based TikTok creator who has built a massive following by walking up to off-duty ICE agents outside the federal courthouse and verbally confronting them on camera. What started as a lighthearted way to make content quickly became something much bigger once the videos went viral across every platform on the internet.\n\nThe conversation covers the real mechanics behind how Chelsea finds these agents, what the interactions actually look like up close, and why she keeps doing it even after DHS police tried to stop her on the street. She talks about the night cops came out in full gear and she ran toward them instead of away, and what happened next.\n\nFrom there, the talk turns to the killing of Renee Good in Minneapolis, the ICE agent identified as the shooter, the lies that came straight out of the Trump administration in the hours after, and a 2014 DHS memo that already laid out exactly why what happened should never have been allowed to happen.\n\nChelsea and Hawk get into the psychology behind the MAGA movement, including theories on CTE, lead poisoning, and repressed identity driving support for Donald Trump. Chelsea shares what it was like growing up Mormon in Salt Lake City, the questions she started asking at 15 that got her in trouble with church leaders, and how she eventually deconverted her entire family over the course of a decade.\n\nThe two also talk about the Epstein files, the way conservative women on the right have publicly defended predatory behavior toward minors, anti-intellectualism rooted in religion, and what it actually feels like to carry out the kind of activism Chelsea does every single day while knowing the risks involved.\n\n#ChelseaGods #Gods #Hawk #HawkPodcast #ICEAgents #ICE #TrumpAdministration #Trump #ReneeGood #JDVance #NickShirley #CaitlynBennett #StephenMiller #Mormonism #Mormon #DHS #Immigration #PoliticalSatire #AntiIntellectialism #Democracy #MAGA #Epstein #CurrentEvents #TikTok #Activism\n\nTimestamps\n00:01 Chelsea Gods is introduced and the podcast kicks off with context on the episode recording timeline\n02:05 Chelsea talks about how she started confronting off-duty ICE agents at the San Diego federal courthouse\n04:31 She walks through exactly how she finds the agents and what happens during the confrontations\n09:00 Chelsea reveals that DHS police came after her and describes the face-off that followed\n12:08 The killing of Renee Good in Minneapolis and the Trump administration\u0027s response come up\n13:39 The 2014 DHS memo that already warned against the exact scenario that led to the shooting is brought up\n19:11 Chelsea lays out her theories on why Trump supporters behave the way they do\n25:14 Chelsea opens up about growing up in the Mormon church and the questions that led her to leave\n36:08 The conversation shifts to anti-intellectualism, education, and how religion fuels it\n46:22 Hawk and Chelsea talk about Nick Shirley, Caitlyn Bennett, and their roles in Trump-era propaganda\n51:00 Chelsea addresses whether she plans to keep confronting ICE agents after the violence in Minneapolis\n\nIf you have the means and want to support Hawk you can become a Channel Member:\nhttps://www.youtube.com/channel/UCCcrmvbQbfwSZaTgBZPrjMQ/join\n\nSUPPORT \u0026 CONNECT WITH HAWK\n- Support on Patreon: https://www.patreon.com/mdg650hawk\n- Hawk\u0027s Merch Store: https://hawkmerchstore.com\n- Connect on TikTok:  https://www.tiktok.com/@mdg650hawk7thacct\n- Connect on TikTok:  https://www.tiktok.com/@hawkeyewhackamole\n- Connect on BlueSky: https://bsky.app/profile/mdg650hawk.bsky.social\n- Connect on Substack: https://mdg650hawk.substack.com\n- Connect on Facebook: https://www.facebook.com/hawkpodcasts/\n- Connect on Instagram: https://www.instagram.com/mdg650hawk/\n- Connect on Twitch: https://www.twitch.tv/mdg650hawk (will be integrating this in the future)\n\n HAWK PODCASTS INFO\n- Additional Content Available Here: \n     - https://www.hawkpodcasts.com or\n     - https://www.youtube.com/channel/UCCcrmvbQbfwSZaTgBZPrjMQ/join \n\n- Listen to Hawk Podcasts On Your Favorite Platform:\n  •  Spotify: https://spoti.fi/3RWeJfy\n  •  Apple Podcasts: https://apple.co/422GDuL\n  •  YouTube: https://youtube.com/@hawkpodcasts\n  •  iHeartRadio: https://ihr.fm/47vVBdP\n  •  Pandora: https://bit.ly/48COaTB\n  •  Simplecast: https://hawk-droppings.simplecast.com",
      "release": "2026-02-03T17:36:09Z",
      "duration": "00:53:37",
      "explicit": false,
      "youTubeId": "FJ-0Jx8LgT0",
      "subjects": [
        "Political Cult",
        "Qanon",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FJ-0Jx8LgT0"
      }
    }
  ]
}