{
  "id": "1626a14f-c483-4ed4-9b7d-3bb0d944bc9e",
  "name": "Head Game",
  "spotifyId": "64K9s77YaZajRWCy6QuOen",
  "appleId": 1708506032,
  "youTubeChannelId": "UCi3H6Lf-Q_WskAME26pHWSg",
  "episodes": [
    {
      "id": "09a20917-0961-49c7-9643-505357cc5220",
      "title": "Claire McAuliffe’s Escape From A Religious Cult",
      "description": "Growing up in a strict religious household and sheltered from the outside world, Claire McAuliffe found herself coerced into marriage at the age of 18. When her husband moved Claire and their growing family to a compound belonging to a known doomsday cult, she slowly began to question the absurd teachings and questionable actions of cult leaders and members. As her questions grew, Claire found herself and her children kicked out of the family home. In this episode, Claire reveals why she and her kids were actually happy when the sheriff knocked on her door with an eviction notice, and how she endured decades under strict religious lifestyles. SUPPORT For domestic violence support, contact 1800 RESPECT More resources are available here LINKS Claire\u0027s book \u0027 Lessons From A Cult Survivor \u0027 is out now Follow Claire on Instagram Follow Ant on Instagram , X , and Facebook Learn more about Ant on his website antmiddleton.com Follow Nova Podcasts on Instagram for videos from the podcast and behind the scenes content – @novapodcastsofficial . CREDITS Host: Ant Middleton Editor: Adrian Walton Executive Producer: Damien Haffenden Managing Producer: Ricardo Bardon Nova Entertainment acknowledges the traditional custodians of the land on which we recorded this podcast, the Gadigal People of the Eora Nation. We pay our respect to Elders past and present. See omnystudio.com/listener for privacy information.",
      "release": "2025-10-28T14:05:00Z",
      "duration": "00:49:14.0830000",
      "explicit": false,
      "spotifyId": "6kyku7Wsp5rQZKCldv9BDE",
      "appleId": 1000733877362,
      "subjects": [
        "Order of St Charbel",
        "Society of Saint Pius X"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6kyku7Wsp5rQZKCldv9BDE",
        "apple": "https://podcasts.apple.com/podcast/claire-mcauliffes-escape-from-a-religious-cult/id1708506032?i=1000733877362"
      }
    },
    {
      "id": "a922de4d-cf22-47aa-a0c5-334b96213638",
      "title": "Life Inside a Cult",
      "description": "In this episode, Ant is joined by Carli McConkey. Carli was just 21 years old when she attended a wellness festival in Sydney one Sunday afternoon. She met with a psychic, hoping to gain some clarity and direction. But that encounter ended up altering the course of her life for 13 years. Carli shares her story of losing her identity, freedom and family. She also opens up about the realisation that she needed to escape, and how she fought against mind control techniques in order to do so. If you suspect you or someone you know may be involved in a cult, support is available at www.cifs.org.au If you think you need immediate assistance, call 000. If you would like to speak to someone for support, you may wish to contact one of the following services. Lifeline – Call 13 11 14, or visit www.lifeline.org.au. 1800RESPECT – Call 1800 737 732, or visit www.1800respect.org.au. LINKS Find out more about Carli McConkey\u0027s book, The Cult Effect, here More information about Carli\u0027s work on cult education and recovery can be found on her website, carlimcconkey.com Follow Ant on Instagram , X , and Facebook Learn more about Ant on his website antmiddleton.com Follow Nova Podcasts on Instagram for videos from the podcast and behind the scenes content – @novapodcastsofficial . The matters discussed in this episode are Carli McConkey’s personal opinions and experiences relating to the allegations of abuse detailed in her book The Cult Effect: A True Story of Mind Control in Australia 1996 (2027). CREDITS Host: Ant Middleton Editor: Adrian Walton Executive Producer: Anna Henvest Managing Producer: Elle Beattie Nova Entertainment acknowledges the traditional custodians of the land on which we recorded this podcast, the Gadigal People of the Eora Nation. We pay our respect to Elders past and present. See omnystudio.com/listener for privacy information.",
      "release": "2024-11-12T15:00:00Z",
      "duration": "00:34:01.0770000",
      "explicit": false,
      "spotifyId": "6dNssu0VSSm5e60SwJS7l0",
      "appleId": 1000676665059,
      "youTubeId": "PqqyHOpmKnI",
      "subjects": [
        "Universal Knowledge",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6dNssu0VSSm5e60SwJS7l0",
        "apple": "https://podcasts.apple.com/podcast/life-inside-a-cult/id1708506032?i=1000676665059",
        "youtube": "https://www.youtube.com/watch?v=PqqyHOpmKnI"
      }
    }
  ]
}