{
  "id": "6859e148-a4fb-4de6-ae4a-dd945f613e8e",
  "name": "Heal NPD",
  "youTubeChannelId": "UCHeT5kujD1JqHRAi-x8xD-w",
  "episodes": [
    {
      "id": "dd018393-87bd-4c37-ad45-83cb1a81e05c",
      "title": "Decoding NPD: The Critical Role of Attachment",
      "description": "In this video, Dr. Ettensohn draws heavily on his own research concerning pathological narcissism and attachment patterns, using attachment theory as a lens to focus explanatory power onto the often confusing dynamics of NPD. \n\nBeginning with a general overview of Bartholomew\u0027s four-prototype model of adult attachment, Dr. Ettensohn identifies the most common attachment patterns of individuals with NPD. He describes the relevant research on the development of these patterns and draws parallels with descriptions of early care deficits thought to cause pathological narcissism. \n\nPurchase Unmasking Narcissism: A Guide to Understanding the Narcissist in Your Life here: https://amzn.to/3nG9FgH\n\nSUBSCRIBE HERE: https://rb.gy/kbhusf\nLISTEN ON APPLE PODCASTS: https://rb.gy/cklpum\nLISTEN ON GOOGLE PODCASTS: https://rb.gy/fotpca\nLISTEN ON AMAZON MUSIC: https://rb.gy/g4yzh8\n\nVISIT THE WEBSITE: https://www.healnpd.org\n\n\nCited References:\n\nBartholomew, K. (1990). Avoidance of intimacy: An attachment perspective. Journal of Social and Personal Relationships, 7(2), 147-178.\n\nBartholomew. K., \u0026 Horowitz, L. M. (1991). Attachment styles among young adults: A test of a four-category model. Journal of Personality and Social Psychology, 61(2), 226-244.\n\nBennett, C. S. (2006). Attachment theory and research applied to the conceptualization and treatment of pathological narcissism. Clinical Social Work Journal, 34(1), 45-60.\n\nBlatt, S. J., \u0026 Levy, K. N. (2003). Attachment theory, psychoanalysis, personality development, and psychopathology. Psychoanalytic Inquiry, 23, 104-152.\n\nBowlby, J. (1973). Attachment and loss: Volume 2: Separation. New York: Basic Books.\n\nConnors, M. E. (1997). The renunciation of love: Dismissive attachment and its treatment. Psychoanalytic Psychology, 14, 475-493.\n\nDickinson, K. A., \u0026 Pincus, A. L. (2003). Interpersonal analysis of grandiose and vulnerable narcissism. Journal of Personality Disorders, 17(3), 188-207.\n\nEttensohn, M.D. (2011). The relational roots of narcissism: Exploring relationships between attachment style, acceptance by parents and peers, and measures of grandiose and vulnerable narcissism. (Doctoral dissertation). Retrieved from Dissertations and Theses: Full Text. (Publicaiton No. AAT 3515488). \n\nGabbard, G.O. (1989). Two subtypes of narcissistic personality disorder. Bulletin of the Menninger Clinic, 53, 527-532.\n\nHoldren, M. (2004).  Causal attributions among overt and covert narcissism subtypes for hypothetical, retrospective, and prospective events. (Doctoral dissertation). Retrieved from Dissertations \u0026 Theses: Full Text. (Publication No. AAT 3146467).\n\nKernberg, O. F. (1970). Factors in the psychoanalytic treatment of narcissistic personalities. Journal of the American Psychoanalytic Association, 18, 51-85.\n\nKobak, R. R., \u0026 Sceery, A. (1988). Attachment in late adolescence: Working models, affect regulation, and representations of self and others. Child Development, 59, 135-146.\n\nMain, M., \u0026 Stadtman, J. (1981). Infant response to rejection of physical contact by the mother. Journal of the American Academy of child Psychiatry, 20, 292-307.\n\nOtway, L.J., Vignoles, V.L. (2006). Narcissism and childhood recollections: A quantitative test of psychoanalytic predictions. Personality and Social Psychology Bulletin, 32(1), 104-1116.\n\nPistole, C. M. (1995). Adult attachment style and narcissistic vulnerability. Psychoanalytic Psychology, 12(1), 115-126.\n\nScroufe, L. A., Waters, E. (1977). Heart rate as a convergent measure in clinical and developmental research. Merrill Palmer Quarterly, 23, 3-25.\n\nSmolewska, K., \u0026 Dion, K. L. (2005). Narcissism and adult attachment: A multivariate approach. Self and Identity, 4, 59-68.",
      "release": "2024-03-08T16:00:34Z",
      "duration": "00:22:48",
      "explicit": false,
      "youTubeId": "hvOSWypH3Ak",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hvOSWypH3Ak"
      }
    }
  ]
}