{
  "id": "39c6c79e-2c5e-4a7c-a102-7261479bacb6",
  "name": "Healing My Parts: Real Talk on Dissociative Identity Disorder and Complex Trauma",
  "spotifyId": "0KRcLU6PVPa2rJYjRVZw84",
  "appleId": 1727411790,
  "youTubeChannelId": "UCHEya5-tsXl7iIoVmaRgXLA",
  "episodes": [
    {
      "id": "61c2b1a4-7612-4c83-a1cc-edcbb962dd1f",
      "title": "Cheryl Rainfield on Cult Torture, Programming, and Healing DID with Compassion",
      "description": "In this deeply nuanced conversation, we’re joined by author and survivor Cheryl Rainfield to explore the realities of cult torture, dissociative identity, and the layered impact of organized abuse. We unpack what it means to reclaim the word torture, how cult-created programming functions inside dissociative systems, and how healing unfolds when compassion replaces fear. We explore: • Why some survivors reclaim the term cult torture• How programming operates — and how it can be gently dismantled• The distinction between cult-created parts and other trauma-based or persecutory parts• Subtle indicators that may suggest a history of organized abuse• Why relational repair, attachment, and emotional responsiveness matter profoundly in treatment• What therapists often misunderstand about working with survivors of organized abuse• How systems can begin building trust with cult created parts This conversation does not sensationalize. It names. It clarifies. And it holds hope. Cheryl speaks candidly about what survivors need most: to be believed, to be heard, and to be met with steady compassion. Whether you are a survivor, clinician, or someone seeking to better understand complex dissociation, we hope this episode offers clarity, validation, and thoughtful guidance. Time Stamps 00:00 – Introduction \u0026#43; reclaiming the term “cult torture”08:40 – What programming is and how it functions21:15 – Cult-created parts vs. persecutory/trauma parts36:20 – Subtle signs of organized abuse histories52:10 – What therapists need to understand1:06:30 – Modifying modalities (EMDR, grounding, attachment needs)1:20:45 – Community, writing, and reclaiming voice1:32:00 – Hope for survivors \u0026#43; practical next steps Content Note This episode discusses organized abuse, dissociation, and suicidality. Please listen at your own pace and care for yourself as needed. Connect with Cheryl CherylRainfield.com Cheryl’s Books Cheryl’s Social Media TikTok @Cherylrainfield Instagram @Cherylrainfield Facebook Cheryl Rainfield YouTube Cheryl.Rainfield Substack Cheryl Rainfield Cheryl’s Articles Some Signs and Symptoms of Cult Torture and How To Help: Article on cult torture and programming : Cheryl’s Links to Resources on Cult torture and DID Cheryl’s Recommended Books on cult torture/RAMCOA: Becoming Yourself by Alison Miller Healing The Unimaginable by Alison Miller Demystifying Mind Control \u0026 Ritual Abuse Safe Passage to Healing by Chrystine Oksana. Cheryl’s Recommended Websites: Survivorship.org ra-info.org ritualabuse.us endritualabuse.org grassroots-ra-mc-collective.org Get full access to Healing My Parts at healingmyparts.substack.com/subscribe",
      "release": "2026-02-19T17:00:00Z",
      "duration": "01:27:58.7540000",
      "explicit": false,
      "spotifyId": "3PvIpxXJTdXnjIRu6NjxJn",
      "appleId": 1000750522611,
      "youTubeId": "aYb6rd00XC4",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PvIpxXJTdXnjIRu6NjxJn",
        "apple": "https://podcasts.apple.com/podcast/cheryl-rainfield-on-cult-torture-programming-and/id1727411790?i=1000750522611",
        "youtube": "https://www.youtube.com/watch?v=aYb6rd00XC4"
      }
    }
  ]
}