{
  "_ts": 0,
  "id": "fb33355a-659a-4bbc-9d24-4150d48d36b4",
  "name": "Hector Alejandro Guerrero",
  "youTubeChannelId": "UCExfSFWnG-a1qNHosHqUSBg",
  "episodes": [
    {
      "id": "2d18f442-15a4-4fd5-b381-2a8ec6afc58f",
      "title": "Inside the Cult Compound of David Koresh.. And I Felt the Darkness Still There",
      "description": "I traveled to the site of one of the darkest chapters in modern American history — the former compound of David Koresh and the Branch Davidians near Waco, Texas.\n\nBecome a YouTube member to directly support this channel: https://www.youtube.com/channel/UCExfSFWnG-a1qNHosHqUSBg/join\n\nIn 1993, this location became the epicenter of a 51-day standoff between the Branch Davidians and federal agents from the ATF and FBI. It ended in unimaginable tragedy: a fire consumed the compound, and 76 people lost their lives, including innocent women and children. They were followers of a man who claimed to be a prophet—David Koresh—whose grip on his followers blurred the line between faith, manipulation, and control.\n\nThis video is not about sensationalism. It’s about remembering the lives lost, grappling with the horror of what happened, and trying to understand how a belief system can spiral into something so destructive.\n\n🕊️ My heart goes out to the victims, survivors, and families forever impacted by the events at Mount Carmel. This was real. These were real people. And this place carries a weight that I’ll never forget.\n\n🙏 May we never forget their names or their pain.\n\n#Waco #DavidKoresh #WacoSiege #BranchDavidians #CultDocumentary #TrueCrime #MountCarmel #TexasHistory #ReligiousCults #InsideTheCult\n#ExploringAbandoned #DarkHistory #CultsExplained #TrueCrimeCommunity #CultLeader #ExplorationVideo #AmericanHistory\n#Waco #DavidKoresh #WacoSiege #BranchDavidians #TrueCrime #CultDocumentary #TexasHistory #MountCarmel #ReligiousCults #InsideTheCult #ExploringAbandoned #DarkHistory #AmericanTragedy #TrueCrimeYouTube #ExplorationVideo",
      "release": "2025-06-25T16:40:43Z",
      "duration": "00:25:11",
      "explicit": false,
      "youTubeId": "mHntKEU8qK8",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mHntKEU8qK8"
      }
    }
  ]
}