{
  "_ts": 0,
  "id": "2108b2e9-808c-4b14-a93a-07db1658ffc2",
  "name": "Heinous beliefs",
  "spotifyId": "4VeidY5ar9foGxft4c1MRe",
  "appleId": 1792071779,
  "episodes": [
    {
      "id": "77e208e2-cb45-4e6a-b29f-7f4e041c3b6c",
      "title": "5: Faith Over Medicine: The Death of Elizabeth Struhs",
      "description": "Episode Overview In this episode of Heinous Beliefs, we uncover the heartbreaking case of Elizabeth Struhs, an eight-year-old girl from Toowoomba, Queensland, Australia, who tragically lost her life due to religious medical neglect. Elizabeth was diagnosed with Type 1 diabetes, a condition that requires regular insulin to manage blood sugar levels and prevent life-threatening complications. However, her parents, Jason and Kerrie Struhs, made a devastating choice—to stop her insulin treatment entirely, trusting that their faith and prayers would heal her instead. Under the influence of an extreme religious sect called The Saints, led by Brendan Stevens, Elizabeth’s parents, along with 12 other group members, stood by for six agonizing days, watching as she grew weaker and sicker. Instead of seeking urgent medical help, they fasted, prayed, and sang hymns, believing that their faith alone would restore her health. When Elizabeth finally succumbed to diabetic ketoacidosis, the group waited a full 24 hours before calling emergency services—still clinging to the hope that she might be resurrected. This episode breaks down the shocking details of this case, how religious extremism led to a preventable death, and the legal aftermath that followed. \u0026#x1f4d6; What You’ll Learn in This Episode ✅ Who was Elizabeth Struhs? A glimpse into Elizabeth’s life, her diagnosis, and how her parents’ beliefs dictated her medical care—or lack thereof. ✅ Inside The Saints: The Sect That Rejected Medicine How Brendan Stevens, the leader of The Saints, created a closed-off, extremist religious group that rejected modern medicine, convinced followers that illness was a test of faith, and controlled every aspect of their lives. ✅ The Six Days of Suffering A step-by-step timeline of Elizabeth’s rapid health decline, her unbearable suffering, and how the adults around her chose to ignore obvious medical red flags in favor of prayer. ✅ How Police Discovered the Truth The shocking moment when authorities arrived at the Struhs home to find Elizabeth’s lifeless body surrounded by praying sect members. How investigators pieced together the events leading up to her death and arrested 14 individuals, including Jason and Kerrie. ✅ The Trial and Sentencing: Did Justice Prevail? The courtroom battle where prosecutors argued that every person involved played a role in Elizabeth’s death, either through direct negligence or enforcing harmful beliefs. How the Australian legal system handled the case and what the sentencing meant for religious freedom vs. child protection laws. ✅ How This Case Sparked a National Debate The larger conversation around faith-based medical neglect, parental rights, and government intervention. Can religious freedom go too far? And when should the law step in to protect children from dangerous beliefs? ⚖️ The Legal Outcome – What Happened to The Saints? After an intense trial, all 14 members of The Saints were found guilty of manslaughter for their roles in Elizabeth’s death. Sentences handed down included: Jason \u0026 Kerrie Struhs (Parents): 15 years in prison, no parole for 10 years. Brendan Stevens (Leader of The Saints): 12 years in prison for his role in enforcing faith-based medical neglect. Other Members of The Saints: Sentences ranging from 7 to 10 years, based on their level of involvement. The court ruled that faith is not a legal defense for criminal neglect—a landmark decision that reinforced the duty of care parents and guardians must uphold, regardless of religious beliefs. \u0026#x1f4ad; Why This Case Matters Elizabeth’s death wasn’t just a tragic accident—it was a direct result of extreme religious beliefs overriding common sense and medical reality. Cases like this raise difficult but necessary questions: ❓ Where do we draw the line between religious freedom and criminal negligence? ❓ How do cult-like communities manipulate people into ignoring basic medical care? ❓ What can be done to prevent more children from suffering the same fate? \u0026#x1f4e2; Stay Connected \u0026 Join the Conversation \u0026#x1f4f8; Follow us on Instagram: @heinousbeliefs \u0026#x1f4e7; Email us: heinousbeliefs@gmail.com \u0026#x1f4ac; We want to hear from you! Share your thoughts on this case, suggest future topics, and connect with other listeners. ⚠️ Trigger Warning: This episode discusses child death due to medical neglect and religious extremism. Listener discretion is strongly advised.",
      "release": "2025-02-21T05:00:00Z",
      "duration": "00:26:12.2840000",
      "explicit": false,
      "spotifyId": "3Axos3xtel6JGQaAXrNJB9",
      "appleId": 1000694611179,
      "subjects": [
        "The Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Axos3xtel6JGQaAXrNJB9",
        "apple": "https://podcasts.apple.com/podcast/5-faith-over-medicine-the-death-of-elizabeth-struhs/id1792071779?i=1000694611179"
      }
    }
  ]
}