{
  "_ts": 0,
  "id": "6c604909-773e-4fc2-bbdd-893364a17743",
  "name": "heinousbeliefs",
  "spotifyId": "4VeidY5ar9foGxft4c1MRe",
  "appleId": 1792071779,
  "youTubeChannelId": "UCZFucnX9h223EjC1yyInjFg",
  "episodes": [
    {
      "id": "58112b38-477e-4310-9626-cfab3aa7e97b",
      "title": "20: The House of Prayer: Anna Young’s Cult of Control",
      "description": "The House of Prayer: Anna Young’s Cult of Control\n\n Season 1 Finale\n\n\n\n📍 Episode Summary:\n\n This ain\u0027t your grandma’s Bible study. In our Season One finale, we take you deep inside one of the most twisted so-called religious institutions to ever hide behind scripture: The House of Prayer for All People. At the center of it? Anna Elizabeth Young a woman who styled herself as a prophetess named “Mother Anna” but acted more like a prison warden in God’s name.\n\n\n\nIn Gainesville, Florida during the 1980s and ‘90s, Anna created what she called a “spiritual healing ministry.” But what really happened behind those locked doors was nothing short of psychological warfare. She starved children, beat them, locked them in closets, burned their skin in bleach baths, and denied medical treatment all while quoting the Bible. And for years, she got away with it.\n\n\n\nIn this episode, we walk through the depths of her control, the lives lost under her reign, the survivors who never stopped speaking out, and the long-overdue justice that finally came decades later. With testimonies pulled from court records, media interviews, police reports, and direct survivor accounts, this is one of the most disturbing and important stories we’ve told all season.\n\n\n\n⛓️ Crimes Covered:\n\n • Religious cult abuse\n\n • Child starvation and neglect\n\n • Physical torture\n\n • Spiritual and psychological manipulation\n\n • Murder of a minor\n\n • Coercive isolation and mind control\n\n • Denial of medical care as religious punishment\n\n • Abuse of power under a religious veil\n\n\n\n⚠️ Content Warning:\n\n This episode contains detailed discussions of child abuse, trauma, spiritual exploitation, and murder. Listener discretion is strongly advised. Please care for your mental health and take breaks as needed.\n\n\n\n🕯️ To the Victims:\n\n This episode is dedicated to the memory of Katonya Jackson, Emon Harper, and every child who was silenced inside Anna Young’s cult. You deserved protection, love, and joy not pain. We say your names.\n\n\n\n📣 Season Finale Announcement:\n\n This is the final episode of Season One of Heinous Beliefs. Thank y’all so much for riding with me all the way through this journey. It’s been raw, heavy, emotional and absolutely necessary.\n\n\n\nWe’ll be back with Season Two on January 20, 2026, with brand-new stories, deeper research, and even more fearless storytelling about crimes driven by dangerous belief systems.\n\n\n\n💥 But don’t trip we’re not going silent. If you’re subscribed on Apple Podcasts or supporting us on Patreon, you’ll still get access to exclusive bonus episodes and sporadic drops in between seasons. These episodes go even deeper into cases, survivor updates, cult breakdowns, and the dark intersections between belief and violence.\n\n\n\n📢 Support the Podcast \u0026 Stay Connected:\n\n 📸 Instagram: @heinousbeliefs (https://www.instagram.com/heinousbeliefs) \n\n 📧 Email: heinousbeliefspodcast@gmail.com\n\n 🔒 Subscribe on Apple for bonus content\n\n 🩸 Join the Patreon fam: https://www.patreon.com/heinousbeliefs/gift\n\n\n\n 💌 Share this episode with a friend, post it on socials, and keep the conversation alive using #HeinousBeliefs\n\n\n\n🗣️ If this story touched you, made you think twice, or opened your eyes—share it.\n\n Because silence is what allows abuse to hide in plain sight. And belief, when manipulated, can become one of the most dangerous weapons of all.",
      "release": "2025-06-06T07:30:59Z",
      "duration": "00:36:15",
      "explicit": false,
      "spotifyId": "7kzJfNcMKAAfXHrH6fnxbJ",
      "appleId": 1000711790909,
      "youTubeId": "5VQXetRSzew",
      "subjects": [
        "House of Prayer for All"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7kzJfNcMKAAfXHrH6fnxbJ",
        "apple": "https://podcasts.apple.com/podcast/20-the-house-of-prayer-anna-youngs-cult-of-control/id1792071779?i=1000711790909",
        "youtube": "https://www.youtube.com/watch?v=5VQXetRSzew"
      }
    }
  ]
}