{
  "id": "08be44a9-47d0-4ad9-a7b9-46500ce85453",
  "name": "Here For The Truth",
  "spotifyId": "46WXKZsvOsR4R4Q6JGnNAy",
  "appleId": 1570026970,
  "youTubeChannelId": "UCz6qcPjQdZSTRX70wxCEBGQ",
  "episodes": [
    {
      "id": "0d5ab361-91e4-42f2-8c3b-c81b9689004c",
      "title": "Mark Vicente | Inside the Making of a Cult",
      "description": "In this powerful episode, acclaimed filmmaker and whistleblower Mark Vicente—director of the groundbreaking documentary What the Bleep Do We Know!?—joins Joel and Yerasimos to peel back the layers of cult dynamics, media manipulation, and the human psyche. Mark shares his riveting journey out of NXIVM, the infamous self-help organization that devolved into a web of coercion, blackmail, and branding. With raw honesty, he reveals how curiosity and self-reflection helped him break free from the grip of manipulation, as well as the pivotal role his wife played in exposing the truth and encouraging his awakening. Together, the trio explores the universal patterns of control used by cults, governments, and media, drawing chilling parallels between them. They delve into the psychological need for certainty, the dangers of externalizing discomfort, and the transformative power of questioning beliefs. Mark’s deep insights into personal growth and authenticity, combined with his firsthand experiences as a whistleblower, provide a profound lens through which to examine the lies we’ve been sold and the truths we must reclaim. This episode is a compelling call to awaken, to challenge mainstream narratives, and to reclaim agency in the face of manipulation. https://www.markvicente.com/ https://www.instagram.com/markvicente/ Become a premium member and support our podcast. Take the Real AF Test Now! Discover Your Truth Seeker Archetype. Watch all our episodes. Join our group coaching program Rise Above The Herd. Listen to Joel’s album “Scorpio” here! Connect with us on Telegram. Access all our links. Hosted by Joel Rafidi \u0026 Yerasimos Intro and outro music: Illusion by Joel Rafidi Intro voice-over: Namakula ( https://www.namakula.com/voice-over )",
      "release": "2025-01-12T11:30:00Z",
      "duration": "01:39:58.8520000",
      "explicit": true,
      "spotifyId": "2dQZCCBk8JBtVKdckn8fU3",
      "appleId": 1000683654765,
      "youTubeId": "l1ndF5roKmc",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2dQZCCBk8JBtVKdckn8fU3",
        "apple": "https://podcasts.apple.com/podcast/ep-221-mark-vicente-inside-the-making-of-a-cult/id1570026970?i=1000683654765",
        "youtube": "https://www.youtube.com/watch?v=l1ndF5roKmc"
      }
    }
  ]
}