{
  "id": "08be44a9-47d0-4ad9-a7b9-46500ce85453",
  "name": "Here For The Truth",
  "spotifyId": "46WXKZsvOsR4R4Q6JGnNAy",
  "appleId": 1570026970,
  "youTubeChannelId": "UCz6qcPjQdZSTRX70wxCEBGQ",
  "episodes": [
    {
      "id": "b9634ba8-5e84-44fc-b94d-7b748597d7b9",
      "title": "From Being Groomed in a Cult to Helping Build a Chess Empire | Danny Rensch",
      "description": "Raised inside the Church of Immortal Consciousness and taken from his mother under the banner of “spiritual purpose,” Danny Rensch grew up in a world where channeling spirits and chasing chess mastery were intertwined. In this gripping conversation, the International Master and co-founder of Chess.com opens up about being groomed for greatness by a chess-obsessed cult leader, the trauma of spiritual manipulation, the collapse of the collective that shaped him, and the long road toward forgiveness and integration. Danny shares how chess became both his escape and his evolution — an unsolvable, unforgiving game that mirrors life itself — and how he helped lead the digital revolution that brought the royal game to over 200 million players worldwide. This is a raw, nuanced exploration of consciousness, power, resilience, and what it really means to reclaim your own narrative.\n\n00:00 Episode Teaser\n00:28 Opening Conversation\n03:13 Meet Denny Rensch: Co-Founder of Chess.com\n04:07 Growing Up in a Cult: Inside the Church of Immortal Consciousness\n13:06 Chess Becomes ‘Destiny’: Rising Fast, Then Being Taken From His Mom\n23:54 How the Cult Imploded (and the Aftermath)\n29:54 The ‘Like Vibration Family’ Doctrine\n34:20 A Complicated Relationship With His Father:\n40:54 Did the cult village survive? \n55:46 Why chess matters and what it teaches\n59:14 Chess Origins: India to Europe and Queen Isabella’s rule change\n01:14:03 Searching for Bobby Fischer\n01:18:15 Igor’s wild backstory: Soviet defector, mentor, and the chessboard keepsake\n01:20:03 Do the kids play? And chess’s mainstream boom\n01:22:06 Marriage lessons: healing, purpose, and commitment over agreement\n01:33:05 Rapid-fire chess Q\u0026A: favorite player, piece, and time controls\n01:37:49 GOAT debate: Magnus vs Kasparov\n\nGuest Links\nhttps://www.chess.com/ \nDanny’s incredible memoir “Dark Squares: How Chess Saved My Life”: https://www.amazon.com/Dark-Squares-Chess-Saved-Life/dp/1541703286\n\nConnect with Us\nJoin our membership Friends of the Truth: https://hereforthetruth.com/fott/\n\nRise Above The Herd: https://hereforthetruth.com/rath/\n\nTake the Real AF Test Now!: https://discover.hereforthetruth.com/realaf\n\nDiscover Your Truth Seeker Archetype: https://discover.hereforthetruth.com/truthseeker\n\nWatch all our episodes: https://hereforthetruth.com\n\nConnect with us on Telegram: https://t.me/areyouhereforthetruth\n\nAccess all our links: https://linktr.ee/hereforthetruth",
      "release": "2026-02-19T12:51:27Z",
      "duration": "01:50:18",
      "explicit": false,
      "spotifyId": "6KkjMsHUr48gtEAUppRxOB",
      "appleId": 1000750474703,
      "youTubeId": "Gj5TH1P9kHk",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KkjMsHUr48gtEAUppRxOB",
        "apple": "https://podcasts.apple.com/podcast/ep-283-danny-rensch-chess-cults-the-game-of-life/id1570026970?i=1000750474703",
        "youtube": "https://www.youtube.com/watch?v=Gj5TH1P9kHk"
      }
    },
    {
      "id": "0d5ab361-91e4-42f2-8c3b-c81b9689004c",
      "title": "Mark Vicente | Inside the Making of a Cult",
      "description": "In this powerful episode, acclaimed filmmaker and whistleblower Mark Vicente—director of the groundbreaking documentary What the Bleep Do We Know!?—joins Joel and Yerasimos to peel back the layers of cult dynamics, media manipulation, and the human psyche. Mark shares his riveting journey out of NXIVM, the infamous self-help organization that devolved into a web of coercion, blackmail, and branding. With raw honesty, he reveals how curiosity and self-reflection helped him break free from the grip of manipulation, as well as the pivotal role his wife played in exposing the truth and encouraging his awakening. Together, the trio explores the universal patterns of control used by cults, governments, and media, drawing chilling parallels between them. They delve into the psychological need for certainty, the dangers of externalizing discomfort, and the transformative power of questioning beliefs. Mark’s deep insights into personal growth and authenticity, combined with his firsthand experiences as a whistleblower, provide a profound lens through which to examine the lies we’ve been sold and the truths we must reclaim. This episode is a compelling call to awaken, to challenge mainstream narratives, and to reclaim agency in the face of manipulation. https://www.markvicente.com/ https://www.instagram.com/markvicente/ Become a premium member and support our podcast. Take the Real AF Test Now! Discover Your Truth Seeker Archetype. Watch all our episodes. Join our group coaching program Rise Above The Herd. Listen to Joel’s album “Scorpio” here! Connect with us on Telegram. Access all our links. Hosted by Joel Rafidi \u0026 Yerasimos Intro and outro music: Illusion by Joel Rafidi Intro voice-over: Namakula ( https://www.namakula.com/voice-over )",
      "release": "2025-01-12T11:30:00Z",
      "duration": "01:39:58.8520000",
      "explicit": true,
      "spotifyId": "2dQZCCBk8JBtVKdckn8fU3",
      "appleId": 1000683654765,
      "youTubeId": "l1ndF5roKmc",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2dQZCCBk8JBtVKdckn8fU3",
        "apple": "https://podcasts.apple.com/podcast/ep-221-mark-vicente-inside-the-making-of-a-cult/id1570026970?i=1000683654765",
        "youtube": "https://www.youtube.com/watch?v=l1ndF5roKmc"
      }
    }
  ]
}