{
  "id": "b9e143b9-91af-499f-b95d-246cfa2985e9",
  "name": "heute journal - der Podcast",
  "spotifyId": "5D4qaXzDSdLPS1A8flbSQk",
  "appleId": 1798670690,
  "episodes": [
    {
      "id": "fc7be077-c998-4078-8a4a-2a5305ba6340",
      "title": "Epstein-Files – welche Spuren führen nach Deutschland?",
      "description": "Die Epstein-Files erschüttern erneut Politik, Wirtschaft und Justiz – erstmals rücken auch deutsche Verbindungen in den Fokus. Millionen veröffentlichte Dokumente zeigen, wie weit das Netzwerk des verurteilten Sexualstraftäters Epstein reichte: Von europäischen Regierungskreisen über Diplomaten bis hin zur Deutschen Bank, die trotz der Verurteilung Epsteins mit ihm gute Geschäfte machte. Host Helene Reiner spricht mit Investigativjournalist Daniel Laufer über neue Recherchen im Fall Epstein. Sicherheitspolitiker Konstantin von Notz erklärt, warum er umfassende Ermittlungen fordert, und welche politischen Folgen der Skandal für Deutschland und Europa haben könnte. Außerdem gehen wir der Frage nach, warum den Opfern immer noch so wenig Aufmerksamkeit geschenkt wird. heute journal - der Podcast – in der ZDF heute App, im Web und auf Youtube. Lasst gern eine Bewertung da und abonniert unseren Podcast. Wir freuen uns über Fragen, Kritik oder Themenvorschläge an: heutejournal-podcast@zdf.de Team: CvD (ZDF): Christoph Söller Host: Helene Reiner Autor: Cedric Wrieden Redaktion: Till Schadel Factchecking: Iris Schwarz, Franziska Meyer Redaktion Pool Artists: Esther Stephan, Julia Illmer, Nicklas Stellhorn Kamera: Manfred Peiter Ton: Oliver Jäger Weitere Links zum Thema: zdfheute.de: Epstein-Files: Kommt es zu Ermittlungen auf EU-Ebene? zdfheute.de: Epstein-Ermittlungen in Europa: Jurist macht wenig Hoffnung zdfheute.de: Jeffrey Epstein - Aktuelle Nachrichten und Hintergründe zdfheute.de: Epstein-Affäre: US-Handelsminister Lutnick räumt Treffen ein zdfheute.de: Deutsche Bank hielt jahrelang an Jeffrey Epstein fest Hilfeangebote für Betroffene von sexualisierter Gewalt in Kindheit und Jugend Hilfe \u0026 Beratung Frauennotrufe und Frauenberatungsstellen",
      "release": "2026-02-12T19:27:00Z",
      "duration": "00:36:22.0240000",
      "explicit": false,
      "spotifyId": "2QnlhaK3OezRHAsoZ4ogu2",
      "appleId": 1000749479805,
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QnlhaK3OezRHAsoZ4ogu2",
        "apple": "https://podcasts.apple.com/podcast/epstein-files-welche-spuren-f%C3%BChren-nach-deutschland/id1798670690?i=1000749479805"
      }
    }
  ]
}