{
  "_ts": 0,
  "id": "2174be0d-ed6c-4099-bc64-1326cd0bb512",
  "name": "Hey White Women",
  "spotifyId": "7a8M6svudd8AtSTcRTb9wK",
  "appleId": 1756352466,
  "episodes": [
    {
      "id": "fa6e80f6-21c6-4bf0-9bf2-5e7b4d37888d",
      "title": "Episode 11 | The Popular Girls Aren\u0027t Happy",
      "description": "This conversation explores the complexities of ageism, objectivity, and bias, particularly in relation to race and gender. The speakers discuss the societal perceptions of age, the historical context of bias, and the reinterpretation of myths through feminist lenses. They delve into the impact of gender in combat and leadership roles, the illusion of popularity and happiness, and the flaws of objectivity in society. The discussion also touches on cognitive dissonance, indoctrination, and the intersection of whiteness and objectivity, emphasizing the dangers of extremism and the importance of nuanced conversations in challenging societal norms.\n   Connect with Rebecca at: \n  Website\n  Patreon\n   TikTok\n  \n   Connect with Daniella at:\n  Daniella\u0027s Patreon\n  TikTok\n  Instagram \n  Website\n  Youtube\n  \n   Uncultured by Daniella Mestyanek Young\n    From Bookshop.org\n    Autographed \n    UnAMERICAN   Videobook\n   Takeaways\n  Ageism is perceived differently across communities. Objectivity is often a facade used to assert dominance. Historical narratives are often biased and subjective. Feminist retellings of myths challenge patriarchal perspectives. Gender diversity in leadership enhances effectiveness. The pursuit of popularity does not guarantee happiness. Cognitive dissonance complicates personal beliefs and actions. Indoctrination can occur in various forms, including societal norms. Whiteness often dictates the perception of objectivity. Extremism thrives on the need for certainty and belonging.  Sound Bites\n \u0022Ageism in the black community just doesn\u0027t fly.\u0022\n \u0022Objectivity doesn\u0027t exist, but it\u0027s weaponized.\u0022\n Chapters\n 00:00 Challenging Perspectives on Ageism and Objectivity\n 04:08 The Role of Bias in Historical Contexts\n 07:04 Reinterpreting Myths Through Feminist Lenses\n 09:59 The Impact of Gender in Combat and Leadership\n 13:02 The Illusion of Popularity and Happiness\n 16:04 The Flaws in Measuring Success and Happiness\n 18:56 Recognizing Red Flags in Relationships and Cults\n 21:54 The Complexity of Indoctrination and Self-Identity\n 25:01 The Dangers of Extremism and Objectivity\n 27:47 The Role of Whiteness in Conflict and Identity\n 31:04 Navigating Relationships Across Racial Lines\n 33:50 The Burden of Representation and Identity\n 36:58 The Importance of Conflict in Personal Growth\n 39:56 The Role of Emotions in Decision Making\n 43:06 The Nuances of Anti-Racism and Personal Responsibility\n 45:58 The Intersection of Trauma and Identity\n 48:59 The Complexity of Objectivity and Subjectivity\n 51:55 The Role of Humor and Stereotypes in Society\n 54:52 The Value of Suffering and Hard Work\n 57:54 The Need for Change in Leadership Dynamics\n 01:00:58 The Search for Identity Beyond White Supremacy\n  \n  \n  ",
      "release": "2024-10-08T12:00:00Z",
      "duration": "01:13:04",
      "explicit": false,
      "spotifyId": "4So4Pc8DoQqPwJ0sLIRzHR",
      "appleId": 1000672213225,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4So4Pc8DoQqPwJ0sLIRzHR",
        "apple": "https://podcasts.apple.com/podcast/episode-11-the-popular-girls-arent-happy/id1756352466?i=1000672213225"
      }
    }
  ]
}