{
  "id": "2174be0d-ed6c-4099-bc64-1326cd0bb512",
  "name": "Hey White Women",
  "spotifyId": "7a8M6svudd8AtSTcRTb9wK",
  "appleId": 1756352466,
  "youTubeChannelId": "UCuFRBZ2w3QsYs7Km69keHsg",
  "youTubePlaylistId": "PLEM2mhO5Zn0kss8YeRwzmQZHxVJn67I5e",
  "episodes": [
    {
      "id": "788d6c08-b11b-40bc-b6ad-8ad36023bd0e",
      "title": "Hey White Women with Knitting Cult Lady and White Woman Whisperer | 60 | De-radicalization",
      "description": "In this episode, Rebecca and Daniella dive into how cult dynamics show up way beyond just \u0022cults.\u0022 Daniella shares pieces of her childhood in the Children of God and how those patterns of coercion, shame, and identity erasure followed her into adulthood—including her time in the military. They compare notes on how institutions, extremist movements, and even online communities use the same tactics to control people, and why so many folks get pulled into these systems in the first place. The conversation stays honest, nuanced, and very human as they talk about deradicalization, belonging, patriarchy, and the long, messy process of rebuilding your sense of self after leaving high-control environments.\n   Connect with Rebecca at: \n   Website\n   Patreon\n    TikTok \n  \n   Connect with Daniella at:\n  Daniella\u0027s Patreon\n  TikTok\n  Instagram \n  Website\n  Youtube\n  KnittingCultLady Store\n  \n   Preorder for Culting of America:  The Culting of America PRE-SALE (SHIPS BY JANUARY 20, 2026) – Knitting Cult Lady\n   Uncultured by Daniella Mestyanek Young\n    From Bookshop.org\n    Autographed \n    UnAMERICAN   Videobook\n   Key Takeaways   Cults, extremist groups, and rigid institutions all rely on the same tools: shame, control, isolation, and obedience.\n   People don\u0027t join these groups because they\u0027re weak—they\u0027re looking for community, safety, identity, or purpose.\n   Perfectionism and purity culture keep people trapped by making them feel like they\u0027re never \u0022good enough.\u0022\n   Leaving a high-control group doesn\u0027t erase the internalized rules; those scripts take time to unlearn.\n   Extremists almost never see themselves as extremists—they think they\u0027re doing the right or noble thing.\n   Institutions like the military can reinforce the same patterns of self-erasure and unquestioning loyalty.\n   Healing requires nuance; black-and-white thinking is part of what got people stuck in the first place.\n   Online spaces make radicalization easier by offering instant community and grievance-based belonging.\n   Patriarchy shapes how these systems recruit, punish, and reward people.\n   Rebuilding a sense of self is a long process that often starts with reconnecting to your body, not just your beliefs.\n   Chapters\n 00:00 The Struggles of Content Creation and Listening\n 02:46 Engagement and Miscommunication in Online Spaces\n 05:41 Community Care and Collective Responsibility\n 08:38 The Value of Dignity in Work and Service\n 11:25 The Complexity of Professional Identity\n 14:16 Tradition, Culture, and the Constitution\n 17:08 Navigating Social Dynamics at Thanksgiving\n 19:59 The Importance of Curiosity in Understanding Cults\n 24:54 The Complexity of Sharing Personal Stories\n 27:46 Community and the Importance of Trust\n 29:26 Navigating Urgency and Awareness in Conversations\n 32:53 Military Choices and Racial Perspectives\n 36:08 Brainwashing and Military Culture\n 40:10 The Perception of Time and Future\n 43:22 Understanding Whiteness and Its Implications\n 47:07 The Incentive Behind Accusations\n 51:20 Bridging the Gap in Conversations\n 52:59 Understanding White Privilege\n 56:42 The Impact of Innocence and Purity\n 01:00:34 Navigating Conversations on Race\n 01:04:18 Deconstructing Whiteness and Corporate Culture\n 01:07:57 The Importance of Storytelling in Learning\n 01:13:42 Embracing the Learning Journey\n Produced by Haley Phillips",
      "release": "2025-12-11T13:00:00Z",
      "duration": "01:18:51",
      "explicit": false,
      "spotifyId": "4oF5fM42JC5H3neKglHny9",
      "appleId": 1000740845120,
      "youTubeId": "9ASeDYMfQWg",
      "subjects": [
        "Children Of God",
        "Cult Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4oF5fM42JC5H3neKglHny9",
        "apple": "https://podcasts.apple.com/podcast/hey-white-women-with-knitting-cult-lady-and-white/id1756352466?i=1000740845120",
        "youtube": "https://www.youtube.com/watch?v=9ASeDYMfQWg"
      }
    },
    {
      "id": "fa6e80f6-21c6-4bf0-9bf2-5e7b4d37888d",
      "title": "Episode 11 | The Popular Girls Aren\u0027t Happy",
      "description": "This conversation explores the complexities of ageism, objectivity, and bias, particularly in relation to race and gender. The speakers discuss the societal perceptions of age, the historical context of bias, and the reinterpretation of myths through feminist lenses. They delve into the impact of gender in combat and leadership roles, the illusion of popularity and happiness, and the flaws of objectivity in society. The discussion also touches on cognitive dissonance, indoctrination, and the intersection of whiteness and objectivity, emphasizing the dangers of extremism and the importance of nuanced conversations in challenging societal norms.\n   Connect with Rebecca at: \n  Website\n  Patreon\n   TikTok\n  \n   Connect with Daniella at:\n  Daniella\u0027s Patreon\n  TikTok\n  Instagram \n  Website\n  Youtube\n  \n   Uncultured by Daniella Mestyanek Young\n    From Bookshop.org\n    Autographed \n    UnAMERICAN   Videobook\n   Takeaways\n  Ageism is perceived differently across communities. Objectivity is often a facade used to assert dominance. Historical narratives are often biased and subjective. Feminist retellings of myths challenge patriarchal perspectives. Gender diversity in leadership enhances effectiveness. The pursuit of popularity does not guarantee happiness. Cognitive dissonance complicates personal beliefs and actions. Indoctrination can occur in various forms, including societal norms. Whiteness often dictates the perception of objectivity. Extremism thrives on the need for certainty and belonging.  Sound Bites\n \u0022Ageism in the black community just doesn\u0027t fly.\u0022\n \u0022Objectivity doesn\u0027t exist, but it\u0027s weaponized.\u0022\n Chapters\n 00:00 Challenging Perspectives on Ageism and Objectivity\n 04:08 The Role of Bias in Historical Contexts\n 07:04 Reinterpreting Myths Through Feminist Lenses\n 09:59 The Impact of Gender in Combat and Leadership\n 13:02 The Illusion of Popularity and Happiness\n 16:04 The Flaws in Measuring Success and Happiness\n 18:56 Recognizing Red Flags in Relationships and Cults\n 21:54 The Complexity of Indoctrination and Self-Identity\n 25:01 The Dangers of Extremism and Objectivity\n 27:47 The Role of Whiteness in Conflict and Identity\n 31:04 Navigating Relationships Across Racial Lines\n 33:50 The Burden of Representation and Identity\n 36:58 The Importance of Conflict in Personal Growth\n 39:56 The Role of Emotions in Decision Making\n 43:06 The Nuances of Anti-Racism and Personal Responsibility\n 45:58 The Intersection of Trauma and Identity\n 48:59 The Complexity of Objectivity and Subjectivity\n 51:55 The Role of Humor and Stereotypes in Society\n 54:52 The Value of Suffering and Hard Work\n 57:54 The Need for Change in Leadership Dynamics\n 01:00:58 The Search for Identity Beyond White Supremacy\n  \n  \n  ",
      "release": "2024-10-08T12:00:00Z",
      "duration": "01:13:04",
      "explicit": false,
      "spotifyId": "4So4Pc8DoQqPwJ0sLIRzHR",
      "appleId": 1000672213225,
      "youTubeId": "HGZp-coihQQ",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4So4Pc8DoQqPwJ0sLIRzHR",
        "apple": "https://podcasts.apple.com/podcast/episode-11-the-popular-girls-arent-happy/id1756352466?i=1000672213225",
        "youtube": "https://www.youtube.com/watch?v=HGZp-coihQQ"
      }
    }
  ]
}