{
  "id": "fb4fb2cb-2e14-48e6-8eaa-7135f537fff7",
  "name": "Hezakya Newz \u0026 Films",
  "youTubeChannelId": "UCn4pspw828JmDmmDBYxc-yA",
  "episodes": [
    {
      "id": "ab6f4b95-3365-4b4d-a613-45a63ef19183",
      "title": "1995 SPECIAL REPORT: \u0022GENERATION X...CULTS\u0022",
      "description": "MTV\u0027s investigative report on alternative religions including the Church Universal and Triumphant, International Churches of Christ, and Scientology.",
      "release": "2024-08-07T22:19:56Z",
      "duration": "00:26:08",
      "explicit": false,
      "youTubeId": "JTtyiMmqgPc",
      "subjects": [
        "Church Universal and Triumphant",
        "International Churches Of Christ",
        "Scientology",
        "Evangelicalism",
        "Raëlism",
        "Branch Davidians",
        "Cult Apologists",
        "Cult-Expert",
        "Transcendental Meditation",
        "Bhagwan Shree Rajneesh",
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JTtyiMmqgPc"
      }
    },
    {
      "id": "b04cb801-1bca-48f3-8a27-dc096ce767a1",
      "title": "1980s SPECIAL REPORT : \u0026quot;CREEPY CULTS\u0026quot;",
      "description": "Cult is a term, in most contexts pejorative, for a relatively small group which is typically led by a charismatic and self-appointed leader, who excessively controls its members, requiring unwavering devotion to a set of beliefs and practices which are considered deviant (outside the norms of society).This term is also used for a new religious movement or other social group which is defined by its unusual religious, spiritual, or philosophical beliefs and rituals, or its common interest in a particular person, object, or goal. This sense of the term is weakly defined – having divergent definitions both in popular culture and academia – and has also been an ongoing source of contention among scholars across several fields of study.An older sense of the word involves a set of religious devotional practices that is conventional within its culture, is related to a particular figure, and is frequently associated with a particular place. References to the imperial cult of ancient Rome, for example, use the word in this sense. A derived sense of \u0022excessive devotion\u0022 arose in the 19th century.Beginning in the 1930s, cults became an object of sociological study within the context of the study of religious behavior.  Since the 1940s, the Christian countercult movement has opposed some sects and new religious movements, labeling them \u0022cults\u0022 because of their unorthodox beliefs. Since the 1970s, the secular anti-cult movement has opposed certain groups and, as a reaction to acts of violence, frequently charged those cults with practicing mind control. Scholars and the media have disputed some of the claims and actions of anti-cult movements, leading to further public controversy.Sociological classifications of religious movements may identify a cult as a social group with socially deviant or novel beliefs and practices, although this is often unclear. Other researchers present a less-organized picture of cults, saying that they arise spontaneously around novel beliefs and practices. Groups labelled as \u0022cults\u0022 range in size from local groups with a few members to international organizations with millions. There are thousands of cults around the world.",
      "release": "2023-12-07T06:48:18",
      "duration": "01:37:48",
      "explicit": false,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "internetArchive": "https://archive.org/details/youtube-BJAlZYJH604"
      }
    },
    {
      "id": "9cbe0483-6a72-4634-853c-a13e20162c75",
      "title": "1997 SPECIAL REPORT: \u0026quot;HEAVENS GATE\u0026quot;",
      "description": "Heaven\u0027s Gate was an American UFO religious millenarian cult based near San Diego, California. It was founded in 1974 and led by Marshall Applewhite (1931–1997) and Bonnie Nettles (1927–1985). On March 26, 1997, members of the San Diego County Sheriff\u0027s Department discovered the bodies of 39 members of the group in a house in the San Diego suburb of Rancho Santa Fe. They had participated in a mass suicide, a coordinated series of ritual suicides, in order to reach what they believed was an extraterrestrial spacecraft following Comet Hale–Bopp.Just before the mass suicide, the group\u0027s website was updated with the message: \u0022Hale–Bopp brings closure to Heaven\u0027s Gate ... Our 22 years of classroom here on planet Earth is finally coming to conclusion—\u0027graduation\u0027 from the Human Evolutionary Level. We are happily prepared to leave \u0027this world\u0027 and go with Ti\u0027s crew.\u0022",
      "release": "2023-06-21T21:55:16",
      "duration": "01:27:02",
      "explicit": false,
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "internetArchive": "https://archive.org/details/youtube-tBWASshQ0qA"
      }
    },
    {
      "id": "78d9a705-2fdb-4ff3-b470-b3576447b40e",
      "title": "1978-1982 SPECIAL REPORT: \u0026quot;JONESTOWN AFTERMATH\u0026quot;(PART I)",
      "description": "The Temple\u0027s San Francisco headquarters came under siege by national media and relatives of Jonestown victims. The mass killing became one of the best-known events in U.S. history as measured by the Gallup poll and appeared on the cover of several newspapers and magazines, including Time, for months afterward.In addition, according to various press reports, after the Jonestown suicides, surviving Temple members in the U.S. announced their fears of being targeted by a \u0022hit squad\u0022 of Jonestown survivors. Similarly, in 1979, the Associated Press reported a U.S. Congressional aide\u0027s claim that there were \u0022120 white, brainwashed assassins out from Jonestown awaiting the trigger word to pick up their hit.\u0022Temple insider Michael Prokes, who had been ordered to deliver a suitcase containing Temple funds to be transferred to the Communist Party of the Soviet Union, killed himself in March 1979, four months after the Jonestown incident. In the days leading up to his death, Prokes sent notes to several people, together with a thirty-page statement he had written about the Temple. Caen reprinted one copy in his Chronicle column.Prokes then arranged for a press conference in a Modesto, California motel room, during which he read a statement to the eight reporters who attended. He then excused himself, entered a restroom, and fatally shot himself in the head.Before the tragedy, Temple member Paula Adams engaged in a romantic relationship with Guyana\u0027s Ambassador to the United States, Laurence \u0022Bonny\u0022 Mann. Adams later married Mann. On October 24, 1983, Mann fatally shot both Adams and the couple\u0027s child, and then fatally shot himself. Defecting member Harold Cordell lost twenty family members the evening of the poisonings. The Bogues family, which had also defected, lost their daughter Marilee (age 18), while defector Vernon Gosney lost his son Mark (age 5).The mass suicide of the Peoples Temple has helped embed in the public mind the idea that all new religious movements are destructive. Bryan R. Wilson argues against that view by pointing out that only four other such events have occurred in similar religious groups: the Branch Davidians, the Solar Temple, Aum Shinrikyo and Heaven\u0027s Gate.",
      "release": "2023-06-21T21:28:06",
      "duration": "02:33:18",
      "explicit": false,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "internetArchive": "https://archive.org/details/youtube-39KAuhFkTDo"
      }
    },
    {
      "id": "3447d5af-5e95-4784-b9fb-4e2258fef9f9",
      "title": "1975 SPECIAL REPORT: \u0026quot;NATION OF ISLAM\u0026quot;",
      "description": "The Nation of Islam (NOI) is a religious and political organization founded in the United States by Wallace Fard Muhammad in 1930. A black nationalist organization, the NOI focuses its attention on the African diaspora, especially on African Americans. While it identifies itself as promoting a form of Islam, its beliefs differ considerably from mainstream Islamic traditions. Scholars of religion characterize it as a new religious movement. It operates as a centralized and hierarchical organization.",
      "release": "2023-06-21T21:01:15",
      "duration": "00:17:48",
      "explicit": false,
      "subjects": [
        "United Nation of Islam"
      ],
      "urls": {
        "internetArchive": "https://archive.org/details/youtube-37HMIsUqOJM"
      }
    },
    {
      "id": "dcbde2f8-498f-473d-9f8e-3afa4e66cc60",
      "title": "1978-1988 SPECIAL REPORT: \u0022JONESTOWN AFTERMATH (PART III)",
      "description": "On Nov. 18, 1978 — willingly or unwillingly — the followers of the charismatic Pentecostal leader Jim Jones drank cyanide-laced fruit punch. Over 300 children were made to drink it, and syringes full of the mixture were emptied into infants’ mouths. Those who didn’t join Jones’ so-called “revolutionary suicide” were injected with poison; others tried to run for the surrounding jungle only to be shot by one of Jones’ armed guards. All told, 918 people died that day.\n\nThe U.S. tried to have the bodies interred on site, offering to foot the bill for the Guyanese government. But the Guyanese government wanted no part in the burial, and families of the dead wanted their loved ones returned. The military was the only organization able to handle mass casualty recovery and Dover Air Force Base in Delaware was assigned receipt of the dead. What happened there in the aftermath would become one of the first records of how deeply first responders can be affected by the trauma to which their jobs expose them.\n\nLoaded with waterproof canvas body bags and coffin-like metal transport containers, U.S. military helicopters shuttled the dead and recovery personnel alike between Guyana’s capital and Jonestown, isolated deep in the jungle.\n\nRecovery workers would later report that the staggering number of children they saw there was the most disturbing thing they encountered. “Can’t sleep,” reported one worker. “Cannot get the small children out of my mind.”\n\nSociety’s understanding of post-traumatic stress disorder was limited in 1978 and associated almost exclusively with wartime experiences, falling under the umbrella of what was often thought of as “shell shock.” Even less was known about the impact a mass casualty recovery mission would have on first responders. A smattering of studies had been done by the military on nurses, for example, but the literature was sparse.\n\nJonestown was different. It involved the deaths of civilians and demanded the involvement of a cross-section of workers, from doctors and pathologists to typists and the yeomen who cleaned the transport containers.\n\nWhen the first C-141 aircraft touched down at Dover on Nov. 23, 1978, it carried the remains of 40 U.S. civilians. The magnitude of the situation was still unknown — and grossly underestimated. So was the emotional impact it would have on those left to deal with it.\n\nJim Jones had become a popular Pentecostal preacher in the 1960s, using a gospel of social justice and inclusion to attract followers to his San Francisco-based congregation, the People’s Temple. The hundred or so followers he’d brought West from his home in Indiana soon ballooned to a thousand, even as his paranoia likewise grew, fed by his growing dependency on pills. Jones staged fake faith healings to draw more people to his church and consolidate his power with only a small circle of trusted faithful. He began referring to himself as God.\n\nBut in 1977, with a damning article about abuses within the Temple about to break, Jones and nearly a thousand of his followers fled to land the Temple had previously purchased in Guyana.\n\nLess than a year later, most of them would be dead. The bodies that would need to be brought back totaled more than 900.\n\nThose bodies were taken to the base mortuary for identification and in some cases autopsy; the remains would eventually be stored on base in Hangar 1301.\n\nAt the time, Patricia Edwards had worked for seven years as a civilian employee at Dover AFB, where she still is until today. Now working in the Airman and Family Readiness Center, back then Edwards’ job was to manage logistics.\n\n“I had to recruit individuals that would work in the mortuary environment and to make sure that there was enough staff and administrators to handle the Jonestown situation,” she told me.\n\n“I found out about Jonestown like everyone else did back then, through the media,” she said. It was from those reports that Edwards and her colleagues found out just how much of a job they would have to do, and quickly. “What would normally take about two to three weeks had to be done in one,” Edwards said.\n\nThe conditions at Jonestown were compounded by rain and staggering humidity. Bodies bloat and change color and are infested by insects. Above all, the authors write, “the overpowering and unforgettable odor of just one body [are] beyond imagination.”\n\nThe study asked first basic questions about age, race, marital status and whether military or civilian. Respondents were asked if they had any exposure to human remains: none, saw bodies in containers with no odor, odor only, handled containers, handled body bags or handled human remains directly.\n\nThe immediate emotional impact was what you would imagine; seeing “three or four babies per [body] bag” kept workers up nights. Some were angry the military was involved in recovering “fanatics’” bodies at all. Some reported personal growth from the experience, one person realizing as human beings “you’ve got to give a damn.”",
      "release": "2023-06-18T02:11:14Z",
      "duration": "00:42:34",
      "explicit": false,
      "youTubeId": "tU27LdmRhCc",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tU27LdmRhCc",
        "internetArchive": "https://archive.org/details/youtube-tU27LdmRhCc"
      }
    },
    {
      "id": "c8f1d702-9cac-4405-b4cd-4cbc9690a0d9",
      "title": "1978-1988 SPECIAL REPORT: \u0022JONESTOWN AFTERMATH\u0022 (PART II)",
      "description": "The Temple\u0027s San Francisco headquarters came under siege by national media and relatives of Jonestown victims.\n\n The mass killing became one of the best-known events in U.S. history as measured by the Gallup poll and appeared on the cover of several newspapers and magazines, including Time, for months afterward.\n\nIn addition, according to various press reports, after the Jonestown suicides, surviving Temple members in the U.S. announced their fears of being targeted by a \u0022hit squad\u0022 of Jonestown survivors. Similarly, in 1979, the Associated Press reported a U.S. Congressional aide\u0027s claim that there were \u0022120 white, brainwashed assassins out from Jonestown awaiting the trigger word to pick up their hit.\u0022\n\nTemple insider Michael Prokes, who had been ordered to deliver a suitcase containing Temple funds to be transferred to the Communist Party of the Soviet Union, killed himself in March 1979, four months after the Jonestown incident. In the days leading up to his death, Prokes sent notes to several people, together with a thirty-page statement he had written about the Temple. Caen reprinted one copy in his Chronicle column.\n\nProkes then arranged for a press conference in a Modesto, California motel room, during which he read a statement to the eight reporters who attended. He then excused himself, entered a restroom, and fatally shot himself in the head.\n\nBefore the tragedy, Temple member Paula Adams engaged in a romantic relationship with Guyana\u0027s Ambassador to the United States, Laurence \u0022Bonny\u0022 Mann. Adams later married Mann. On October 24, 1983, Mann fatally shot both Adams and the couple\u0027s child, and then fatally shot himself. Defecting member Harold Cordell lost twenty family members the evening of the poisonings. The Bogues family, which had also defected, lost their daughter Marilee (age 18), while defector Vernon Gosney lost his son Mark (age 5).\n\nThe mass suicide of the Peoples Temple has helped embed in the public mind the idea that all new religious movements are destructive. Bryan R. Wilson argues against that view by pointing out that only four other such events have occurred in similar religious groups: the Branch Davidians, the Solar Temple, Aum Shinrikyo and Heaven\u0027s Gate.",
      "release": "2023-06-14T17:51:39Z",
      "duration": "01:13:16",
      "explicit": false,
      "youTubeId": "_OgwfK4udP4",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_OgwfK4udP4",
        "internetArchive": "https://archive.org/details/youtube-_OgwfK4udP4"
      }
    },
    {
      "id": "817bb0cd-6efb-45ac-bbc1-3c70ac1e64e8",
      "title": "1989 SPECIAL REPORT: \u0022YAHWEH.. IN GODS NAME\u0022",
      "description": "Yahweh ben Yahweh (born Hulon Mitchell Jr.; October 27, 1935 – May 7, 2007)in 1979 founded and led the Nation of Yahweh, a new religious movement headquartered in Florida that had thousands of black American devotees at its peak. Yahweh was later indicted on three counts of federal racketeering and extortion charges, of which he was found not guilty. However, he was convicted of conspiracy to commit murder.\n\n#yahwehbenyahweh\n\n#blackhistory\n\n#miami",
      "release": "2021-12-05T22:32:02Z",
      "duration": "00:20:52",
      "explicit": false,
      "youTubeId": "jDHEyOTsnj0",
      "subjects": [
        "Nation of Yahweh",
        "Black Hebrew Israelites"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jDHEyOTsnj0"
      }
    },
    {
      "id": "d0f3d38c-6300-4b9f-a563-da16ee1a5244",
      "title": "1996 SPECIAL REPORT: \u0022CROWN HEIGHTS CULT\u0022",
      "description": "While investigating a report of suspected child abuse, New York City police got a surprise: they uncovered a cache of weapons hidden in a false closet in a house in Brooklyn\u0027s Crown Heights neighborhood. Thirty-five people were taken into custody, believed to be members of a small group called the Provisional Party of Communism. While only five have been charged, the case will go to a grand jury for further investigation into who the group is, and what they were planning. NPR\u0027s Melissa Block reports. \n\n\nPolice officials said yesterday that the 30 people arrested in the late-night raid were followers of Eugenio Perente-Ramos, who experts in fringe groups and cults said had created a mythological persona as a radical labor organizer. The experts said Mr. Perente-Ramos had a following of several hundred people on the East and West Coasts who remained devoted to him after his death in March 1995 at the age of 59.\n\nStunned police officers recovered a large arsenal from the cluster of apartment buildings on Carroll Street in Crown Heights, where the group lived, a place the members called the Cave. The officers seized 16 pistols, 26 rifles, 5 shotguns and 2 working replicas of Thompson submachine guns. They also found five canisters of black powder, which could be used for making explosives.\n\nAt 1 A.M., Jerry Varson, a police spokesman, said a total of 35 people had been arrested, but he could not say when the additional arrests had been made. Of those held, six people were charged yesterday, most for possessing illegal weapons.\n\n\n\n#BROOKLYN\n#CROWNHEIGHTS\n#CULTS",
      "release": "2021-10-05T03:07:42Z",
      "duration": "00:19:49",
      "explicit": false,
      "youTubeId": "rDgK8H-EwOA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rDgK8H-EwOA"
      }
    },
    {
      "id": "ac416ebc-1e94-4891-a65c-f5318bf8d761",
      "title": "1972 SPECIAL REPORT: \u0022JESUS FREAKS\u0022",
      "description": "Jesus freak is a term arising from the late 1960s and early 1970s counterculture and is frequently used as a pejorative for those involved in the Jesus movement. As Tom Wolfe illustrates in The Electric Kool-Aid Acid Test, the term \u0022freak\u0022 with a preceding qualifier was a strictly neutral term and described any counterculture member with a specific interest in a given subject; hence \u0022acid freak\u0022 and \u0022Jesus freak\u0022. \n\n\nThe term \u0022freak\u0022 was in common-enough currency that Hunter S. Thompson\u0027s failed bid for sheriff of Pitkin County, Colorado, was as a member of the \u0022Freak Power\u0022 party. However, many later members of the movement, those misunderstanding the countercultural roots believed the term to be negative, and co-opted and embraced the term, and its usage broadened to describe a Christian subculture throughout the hippie and back-to-the-land movements that focused on universal love and pacifism, and relished the radical nature of Jesus\u0027s message. \n\n\nJesus freaks often carried and distributed copies of the Good News for Modern Man, a 1966 translation of the New Testament written in modern English. In Australia, and other countries, the term Jesus freak, along with Bible basher, is still used in a derogatory manner. In Germany, there is a Christian youth culture, also called Jesus Freaks International, that claims to have its roots in the U.S. movement.",
      "release": "2021-08-12T07:49:33Z",
      "duration": "00:09:35",
      "explicit": false,
      "youTubeId": "2G0HbYthDaw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2G0HbYthDaw"
      }
    },
    {
      "id": "e7c4142f-bba8-4b75-86a7-ae88f6f41a4c",
      "title": "1978-2018 SPECIAL REPORT: \u0022THE PEOPLES TEMPLE\u0022",
      "description": "The Peoples Temple of the Disciples of Christ, commonly shortened to Peoples Temple, was an American new religious organization which existed between 1954 and 1978. Originally founded in Indianapolis, Indiana, by Reverend Jim Jones, the Peoples Temple spread a message that combined elements of Christianity with communist and socialist ideology, with an emphasis on racial equality. \n\n\nAfter Jones moved the group to California in the 1960s and established several locations throughout the state, including its headquarters in San Francisco, the Temple forged ties with many left-wing political figures and boasted 20,000 members (though 3,000–5,000 is more likely).\n\nThe Temple is best known for the events of November 18, 1978, in Guyana, when 909 people died in a mass suicide and mass murder at its remote settlement, named \u0022Jonestown\u0022, as well as the murders of U.S. Congressman Leo Ryan and members of his visiting delegation at the nearby Port Kaituma airstrip. The incident at Jonestown resulted in the greatest single loss of American civilian life in a deliberate act prior to the terrorist attacks of September 11, 2001. Because of the killings in Guyana, the Temple is regarded by scholars and by popular view as a destructive cult.",
      "release": "2021-06-20T00:59:03Z",
      "duration": "00:47:00",
      "explicit": true,
      "youTubeId": "g-FJRyQVvKc",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g-FJRyQVvKc"
      }
    },
    {
      "id": "9e7c621c-cc08-4232-b78c-9eefde5f07b2",
      "title": "1978 THROWBACK: \u0022JONESTOWN SURVIVORS SPEAK OUT ON JIM JONES\u0022",
      "description": "At the time of his death, Jim Jones held such power over his followers that he was able to direct more than 900 of them to participate in a mass murder-suicide.\n\nJones was the leader of the Peoples Temple, a ministry of his own devising that convinced hundreds of Americans to move to his compound, known as Jonestown, in the South American nation of Guyana. Of the 918 Americans who lost their lives in the Jonestown massacre on Nov. 18, 1978, investigators determined 907 died from ingesting poison, including nearly 300 children. They used cyanide, and either injected it into people with syringes or mixed it with a powdered soft drink called Flavor Aid.\n\nOthers were shot or stabbed that day. Jones himself was found with a single bullet wound to the head.",
      "release": "2021-06-13T12:24:04Z",
      "duration": "00:18:25",
      "explicit": false,
      "youTubeId": "wuXfaKhVfBM",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wuXfaKhVfBM"
      }
    },
    {
      "id": "630d05a4-2ae2-4270-a911-765dc28b39cd",
      "title": "1978 SPECIAL REPORT: \u0022TIM AND MIKE CARTER SPEAK OUT ON JONESTOWN\u0022",
      "description": "By October 1978, all of the defectors had allied with Stoen and the Concerned Relatives.\n\n\n On October 3, Stoen told the State Department that he would retrieve his son John from Jonestown by force if necessary. Three days later he sent a telegram reiterating the threat and warning of the danger of mass suicide at the settlement.\n\n\nAs pressure grew, the Temple learned that Stoen would accompany a investigatory trip by Rep. Ryan to Guyana. On November 15, 1978, both Grace and Tim Stoen traveled with the Ryan delegation to Georgetown. However, they were not permitted to accompany the delegation on its trip to Jonestown on November 17.\n\n\n While the Stoens remained in Georgetown, the Ryan delegation was attacked on November 18 at an airstrip in Port Kaituma, near Jonestown. Ryan and four others were killed by Temple members wielding rifles and shotguns, while several others were injured.\n\n\nStoen encountered Jones\u0027 son Stephan in his Georgetown hotel, neither knowing that Jones was conducting a mass murder-suicide two hundred miles away.\n\n\n As they spoke, 909 inhabitants of Jonestown, 276 of them children, died of apparent cyanide poisoning, mostly in and around the settlement\u0027s central pavilion. An audio recording of Jones, speaking to his followers during the massacre, mentions Stoen: Jones stated:\n\n    What we\u0027d like to get are the people that caused this stuff, and some – if some people here are p – are prepared and know how to do that, to go in town and get Timothy Stoen, but there\u0027s no plane. There\u0027s no plane. You can\u0027t catch a plane in time. He\u0027s responsible for it. He brought these people to us. He and [Jeannie Mills]. The people in San Francisco will not – not be idle over this. They\u0027ll not take our death in vain, you know. ...\n\n    It\u0027s suicide. Plenty have done it. Stoen has done it. But somebody ought to live. Somebody – Can they talk to – and I\u0027ve talked to San Francisco – see that Stoen does not get by with this infamy – with this infamy. He has done the thing he wanted to do. Have us destroyed. ...\n\n    Tim Stoen has nobody else to hate. He has nobody else to hate. Then he\u0027ll destroy himself.\n    — Jim Jones on the final \u0022death tape\u0022\n\nJones also discussed whether the Temple should include Stoen among the names of those committing \u0022revolutionary suicide\u0022, and whether to include children in the plan:\n\n    do you think I\u0027d put John\u0027s life above others? If I put John\u0027s life above others, I wouldn\u0027t be standing with Ujara [nickname of Don Sly, a Temple member who attempted to stab Rep. Ryan]. I\u0027d send John out – out, and he could go out on the driveway tonight. ... I know, but he\u0027s no – he\u0027s no different to me than any of these children here. He\u0027s just one of my children. I don\u0027t prefer one above another. I don\u0027t prefer him above Ujara. I can\u0027t do that. I can\u0027t separate myself from your actions or his actions.\n    — Jim Jones on the final \u0022death tape\u0022\n\nSix-year-old John Stoen was found poisoned in Jim Jones\u0027 cabin at Jonestown.[66] The mass murder-suicide was the greatest single loss of American civilian life in a non-natural disaster until September 11, 2001.",
      "release": "2021-06-13T00:41:23Z",
      "duration": "00:27:27",
      "explicit": false,
      "youTubeId": "4ZwgaM7n0uY",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4ZwgaM7n0uY"
      }
    },
    {
      "id": "6862a30a-1740-4966-aebb-b89b6c6c2d04",
      "title": "1966 SPECIAL REPORT: \u0022SYNANON\u0022",
      "description": "Synanon was initially a drug rehabilitation program founded by Charles E. \u0022Chuck\u0022 Dederich Sr., (1913–1997) in 1958 in Santa Monica, California. By the early 1960s, Synanon became an alternative community centered on group truth-telling sessions that came to be known as the \u0022Synanon Game\u0022, a form of attack therapy.\n\n\n Synanon ultimately became the Church of Synanon in the 1970s. Synanon disbanded in 1991 due to members being convicted of criminal activities (including attempted murder) and retroactive loss of its tax-free status with the Internal Revenue Service due to financial misdeeds, destruction of evidence, and terrorism.\n\n\n It has been called one of the \u0022most dangerous and violent cults America had ever seen\u0022.",
      "release": "2021-05-27T03:25:14Z",
      "duration": "00:30:23",
      "explicit": false,
      "youTubeId": "Woc03LumzuU",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Woc03LumzuU"
      }
    },
    {
      "id": "f8138d63-9f82-4bc8-9a70-89a24b34cbac",
      "title": "1980 SPECIAL REPORT:  \u0022SCIENTOLOGY\u0022",
      "description": "Scientology is a set of beliefs and practices invented by American author L. Ron Hubbard, and an associated movement. It has been variously defined as a cult, a business or a new religious movement.",
      "release": "2020-10-12T02:59:25Z",
      "duration": "00:17:34",
      "explicit": false,
      "youTubeId": "Wc8Jr6GsfFY",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Wc8Jr6GsfFY"
      }
    },
    {
      "id": "206f81bc-5c6c-4ba6-b0a6-0822c75d545c",
      "title": "1983 THROWBACK: \u0022AMWAY\u0022",
      "description": "Amway is an American multi-level marketing company that sells health, beauty, and home care products. The company was founded in 1959 by Jay Van Andel and Richard DeVos and is based in Ada, Michigan. Amway and its sister companies under Alticor reported sales of $8.8 billion in 2018.",
      "release": "2020-10-08T21:28:22Z",
      "duration": "00:16:24",
      "explicit": false,
      "youTubeId": "EM9WF22zv4s",
      "subjects": [
        "Amway"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EM9WF22zv4s"
      }
    },
    {
      "id": "6c8761f6-672a-452a-b1f3-21958416cf5b",
      "title": "1997 SPECIAL REPORT: \u0022HEAVENS GATE\u0022",
      "description": "Heaven\u0027s Gate was an American UFO religious millenarian cult based near San Diego, California. It was founded in 1974 and led by Marshall Applewhite (1931–1997) and Bonnie Nettles (1927–1985). On March 26, 1997, members of the San Diego County Sheriff\u0027s Department discovered the bodies of 39 members of the group in a house in the San Diego suburb of Rancho Santa Fe. They had participated in a mass suicide, a coordinated series of ritual suicides, in order to reach what they believed was an extraterrestrial spacecraft following Comet Hale–Bopp.\n\nJust before the mass suicide, the group\u0027s website was updated with the message: \u0022Hale–Bopp brings closure to Heaven\u0027s Gate ... Our 22 years of classroom here on planet Earth is finally coming to conclusion—\u0027graduation\u0027 from the Human Evolutionary Level. We are happily prepared to leave \u0027this world\u0027 and go with Ti\u0027s crew.\u0022",
      "release": "2020-03-12T23:22:33Z",
      "duration": "01:27:02",
      "explicit": false,
      "youTubeId": "tBWASshQ0qA",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tBWASshQ0qA"
      }
    },
    {
      "id": "d138bde7-60f8-408c-9043-7a81ccb8ae3c",
      "title": "1990 SPECIAL REPORT: \u0022NATION Of YAHWEH\u0022",
      "description": "The Nation of Yahweh is a predominantly African American group that is the most controversial offshoot of the Black Hebrew Israelites religious movement. It was founded in 1979 in Miami by Hulon Mitchell Jr., who went by the name Yahweh ben Yahweh. Its goal is to move African Americans, whom they see as the original Israelites, to Israel.",
      "release": "2019-05-22T04:53:51Z",
      "duration": "00:13:58",
      "explicit": false,
      "youTubeId": "YtV3cSLTQIc",
      "subjects": [
        "Nation of Yahweh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YtV3cSLTQIc"
      }
    },
    {
      "id": "11829c62-05fc-468f-8ac4-766d1011e7c1",
      "title": "1970 THROWBACK: \u0022MANSON IN COURT\u0022",
      "description": "Beginning in January 1970, Manson was embraced by the underground newspapers Los Angeles Free Press and Tuesday\u0027s Child, with the latter proclaiming him \u0022Man of the Year\u0022. In June 1970, he was the subject of a Rolling Stone cover story, \u0022Charles Manson: The Incredible Story of the Most Dangerous Man Alive\u0022. When a Rolling Stone writer visited the Los Angeles District Attorney\u0027s office in preparing that story, he was shocked by a photograph of the bloody \u0022Healter [sic] Skelter\u0022 that would bind Manson to popular culture. Prosecutor Vincent Bugliosi pointed out the dispute in the underground press over whether Manson was \u0022Christ returned\u0022 or \u0022a sick symbol of our times\u0022[where?] to his Helter Skelter co-author, Curt Gentry.\n\nBernardine Dohrn, a leader of the Weather Underground, reportedly said of the Tate murders: \u0022Dig it, first they killed those pigs, then they ate dinner in the same room with them, then they even shoved a fork into a victim\u0027s stomach. Wild!\u0022 Neo-Nazi and Manson follower James Mason founded the Universal Order, a group which has influenced alt-right movements such as the neo-Nazi terrorist Atomwaffen Division. Universal Order\u0027s name and logo, a swastika between scales of justice, were remotely designed by Manson.\n\nIn an afterword composed for the 1994 edition of the non-fiction book Helter Skelter, Bugliosi quoted a BBC employee\u0027s assertion that a \u0022neo-Manson cult\u0022 existing then in Europe was represented by, among other things, approximately 70 rock bands playing songs by Manson and \u0022songs in support of him\u0022.",
      "release": "2019-04-09T03:42:11Z",
      "duration": "00:02:03",
      "explicit": false,
      "youTubeId": "k8YW42AMTOw",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k8YW42AMTOw"
      }
    },
    {
      "id": "fb32fde3-3b49-4ec6-9944-e6e14baa76a8",
      "title": "1993 THROWBACK: \u0022Charles Manson RAW INTERVIEW With Diane Sawyer\u0022",
      "description": "ABC News gets this week\u0027s award for the story you really didn\u0027t know you needed to hear more about. \u0022The Manson Women: Inside the Murders\u0022 delivers the accounts of Leslie Van Houten and Patricia Krenwinkel of how they and other members of their love-in went about killing seven people in California 25 years ago. (No re-enactments; just the camera moving threateningly to spooky sounds.)\n\nCharles Manson himself, hairy and running to fat, with a swastika decorating the bridge of his nose, is also heard from. He is plainly impressed with himself and has the nerve to address Diane Sawyer as \u0022woman.\u0022\n\nMs. Sawyer, who presides over this official opening of \u0022Turning Point,\u0022 the fourth ABC prime-time news magazine, gives an explanation of sorts for a show whose main attraction is its stab-by-stab description of the killings. She cautions that children are now playing Manson\u0027s music: \u0022He has a following.\u0022\n\nAn alternative explanation for \u0022The Manson Women\u0022 is that last month\u0027s pre-debut offering of \u0022Turning Point,\u0022 a grim report on the effects of fallout from nuclear blasts in Nevada in the 1950\u0027s and early 60\u0027s, did not do well in the ratings. Can it be that the producers, who seem to be grasping for a rationale for their new series beyond keeping Ms. Sawyer, Barbara Walters and Peter Jennings occupied, decided that grisly might attract more of a following than grim? \u002748 Hours\u0027 \u0027A Killer Walks Free\u0027 CBS, tonight at 10 (Channel 2 in New York)\n\nTrue-crime fans are in luck tonight. If Charles Manson doesn\u0027t do it for them, they can meet Russell Obremski, who has lately been returned to society after serving about as much time as the still-incarcerated Mansonites for killing two women in Oregon. He is the central figure in a \u002248 Hours\u0022 episode called \u0022A Killer Walks Free,\u0022 with Dan Rather himself recounting the crime. There\u0027s nothing like network competition.\n\nMr. Obremski (\u0022I\u0027m a nice guy\u0022) says he doesn\u0027t remember anything about his murders and objects to what he calls persecution by the children of the women he killed; Ms. Van Houten and Ms. Krenwinkel remember everything about theirs and say they do not like Charles Manson anymore. But they all seem to feel they have done enough time. My question is how much time they deserve on television. Turning Point The Manson Women: Inside the Murders ABC, tonight at 10 (Channel 7 in New York) Premiere of a news magazine directed by Roger Goodman; produced by Denise Schreiner for ABC News; senior broadcast producer, Betsy West; broadcast producer, Bret Marcus; Phyllis McGrady, executive producer; Diane Sawyer, anchor and reporter.",
      "release": "2019-03-24T22:42:29Z",
      "duration": "00:19:52",
      "explicit": false,
      "youTubeId": "YxxH6xm_ZVg",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YxxH6xm_ZVg"
      }
    },
    {
      "id": "f98cd873-87fc-45c7-8e98-ad3f9ab2b168",
      "title": "1969-1986 SPECIAL REPORT: \u0022CHARLES MANSON\u0022",
      "description": "Donate To The Channel: \n\nhttps://cash.me/$hezakyanewz#\n\nhttps://www.paypal.me/hezakyanewz \n\nPATREON: https://www.patreon.com/Hezakyanewz\n\nA great interview with a fascinating character. This interview I can, sort of, understand his B.S. and where he comes from. His belief and value systems got shaped in prison and on the street, and he really tries hard to make clear how different his reality tunnel is from the interviewer. And also how the image of him was partly manufactured (in a different interview more so than here). He makes a lot of fascinating remarks and social comments between some of the madness, and the ending is just gold. Many gems in there.",
      "release": "2019-03-13T00:28:47Z",
      "duration": "01:07:32",
      "explicit": false,
      "youTubeId": "ABVQkS_5z3M",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ABVQkS_5z3M"
      }
    },
    {
      "id": "b6470576-8b56-406e-b1c4-6b513de48a91",
      "title": "1979 SPECIAL REPORT: \u0022CULTS\u0022",
      "description": "Donate To The Channel: \r\n\nhttps://cash.me/$hezakyanewz#\n\nhttps://www.paypal.me/hezakyanewz \n\nPATREON: https://www.patreon.com/Hezakyanewz\n\nThe Love Family, or the Church of Jesus Christ at Armageddon, was a U.S. communal religious movement led by Paul Erdman, who named himself Love Israel. The Love Family began in 1968 as one small communal household on Queen Anne Hill, Seattle, and within the first ten years, it expanded to a network of communal homes and businesses. As more people arrived and settled in the surrounding neighborhood, Erdman, as the leader, continued to inherit land and homes (primarily from those who joined) in other, more rural areas of Washington State, Alaska, and Hawaii. Most of the property is no longer under the control of Erdman, having been sold or returned to the original owners via litigation.\n\nSources differ on the Love Family\u0027s duration; some[who?] claim that after a fractious conflict in 1984, the community was reduced to a small fraction residing in suburban Bothell, Washington, while according to The Seattle Times and an article written by Serious Israel,[ the Love Family continued living on their 300-acre (1.2 km2) property in Arlington, Washington. The Love Family flourished on that acreage from 1984 until 2004, when, according to the Seattle Times, some families moved to other, smaller properties. The Arlington commune supported both a local organic restaurant and an annual festival open to the public called the Garlic Festival, which drew healthy crowds to the property.",
      "release": "2019-03-12T07:37:30Z",
      "duration": "00:13:19",
      "explicit": false,
      "youTubeId": "WzShOTSs65k",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WzShOTSs65k"
      }
    }
  ]
}