{
  "id": "0045edd6-4c88-4bb1-bc84-e47668e895e5",
  "name": "Hibernia Eugenesis",
  "youTubeChannelId": "UCUX-NUI9UT7JTTRWOO-pwlg",
  "episodes": [
    {
      "id": "d418c2e8-775f-4ab8-a101-a887b80ea663",
      "title": "A Tangled Web; Scientology \u0026 Clearwater Police Dept. (part IV)",
      "description": "Detective Stephen Bohling of the Clearwater, Florida Police Department was the lead investigator looking into the extremely suspicious death of Kyle Brennan. His investigation, however, was careless, sloppy and perjurious. Many quandaries went unanswered and witnesses ( Denise Miscavige, husband Gerald Gentile and Tom Brennan) who\u0027d obviously contradicted themselves walked away without further questioning. The result of Detective Bohling\u0027s fraudulent behavior was a miscarriage of justice. In the end, the lies, the mishandling of information and the obstruction of justice came at the expense of a twenty-year-old college student whose existence to the corrupt powers-that-be in Clearwater, Florida was absolutely meaningless.\nThe perjured testimony.",
      "release": "2019-03-12T03:01:29Z",
      "duration": "00:13:37",
      "explicit": false,
      "youTubeId": "Z5OdbC_kbug",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z5OdbC_kbug"
      }
    },
    {
      "id": "6b12a92d-2b77-432d-9df7-212c687e99bf",
      "title": "In the Name of Miscavige (part III)",
      "description": "Watch members of Scientology’s first family--Denise Miscavige, twin-sister of Church of Scientology leader David Miscavige, and husband Gerald Gentile--obstruct justice (lying during a police interview), and commit perjury regarding their early presence at the Clearwater, Florida, apartment of Tom Brennan (the death scene of his non-Scientologist son, twenty-year-old Kyle Brennan). Irrefutable is the fact that Miscavige, Gentile, and Brennan lied--repeatedly, and evidently without conscience. Their stories regarding the circumstances surrounding Kyle\u0027s death are riddled with lies and inconsistencies.   \nClearwater Police Officer Jon Yuen omitted from his report the fact that present at Brennan’s apartment the evening of Kyle’s death were these two important members of Scientology’s first family--Denise and Gerald. Did the police department deliberately lie to protect two individuals with extremely close ties to Scientology\u0027s top leadership? You be the judge!\nFor more information regarding the highly questionable events surrounding Kyle’s death, the extremely mishandled police investigation, and the perjured testimony given by the defendants please refer to “The Truth for Kyle Brennan” blog at https://vbreton2062.wordpress.com/",
      "release": "2019-02-06T23:04:24Z",
      "duration": "00:13:17",
      "explicit": false,
      "youTubeId": "yTkONTGiP_Q",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yTkONTGiP_Q"
      }
    },
    {
      "id": "20bbb0ba-d726-4fdd-acd8-8e5734198684",
      "title": "Scientology in Ireland, Primetime 2018",
      "release": "2019-01-01T03:08:03Z",
      "duration": "00:34:04",
      "explicit": false,
      "youTubeId": "cQLDhNtPDlE",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cQLDhNtPDlE"
      }
    },
    {
      "id": "c2e46cf9-e5a0-40b1-915d-bfc4ae309f8b",
      "title": "Scientology; Hearts of Darkness (Part II)",
      "description": "In a June 1952 lecture titled “Off the Time Track,” L. Ron Hubbard, founder of the Church of Scientology, stated the following: “The only way you can control people is to lie to them. You can write that down in your book in great big letters. The only way you can control anybody is to lie to them.” (Quoted in Journal of Scientology issue 18-G, reprinted in Technical Volumes of Dianetics \u0026 Scientology, Vol.1, pg.418.)\n\nDenise Miscavige Gentile—twin sister of Church of Scientology head David Miscavige, herself a lifelong Scientology practitioner—would do L. Ron Hubbard proud.   \n\nWatch Denise Miscavige and Tom Brennan, father of the deceased (non-Scientologist) Kyle Brennan, commit perjury while displaying an utter lack of compassion or empathy. As a devoted follower Brennan put Scientology first in his life. Everything else was secondary, including his son’s well-being. Why would Kyle’s death mean so very little to his father? From a Scientology point-of-view, Kyle had simply “dropped his body.” He could pick up another one soon.\n\nScientologists have been taught that the collective, the Church of Scientology, comes first. It comes before themselves, their families, and sometimes even the lives of their children. What many Scientologists lack--indeed, what the Church itself drills out of them--is a deep attachment to other people, the very hallmark of humanity.  \n\nFor more information regarding the highly questionable events surrounding the death of Kyle please refer to “The Truth for Kyle Brennan” blog at:\n\nhttps://vbreton2062.wordpress.com/2015/02/01/heart-of-darkness-part-ii-scientologist-tom-brennan/\n\nThis video is the property of the estate of Kyle Brennan; it may not be copied, altered or redistributed without permission. \nCOPYRIGHT 2018 ALL RIGHTS RESERVED.",
      "release": "2019-01-01T03:02:58Z",
      "duration": "00:12:29",
      "explicit": false,
      "youTubeId": "7t-MqT4EsmY",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7t-MqT4EsmY"
      }
    },
    {
      "id": "286283bb-8fef-4dae-94d1-310d2464f0c1",
      "title": "Psychiatrist on scientology Ireland 1968",
      "description": "Irish Psychiatrist, the late Dr. Anthony Clare, was ahead of his time in his synopsis of the $cientology cult. His words ring true today more than ever.",
      "release": "1968-07-26T00:00:00Z",
      "duration": "00:01:16",
      "explicit": false,
      "youTubeId": "74XuOJIOO_0",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=74XuOJIOO_0"
      }
    }
  ]
}