{
  "id": "3066abc2-db97-4a2a-9590-836e697cb597",
  "name": "Hidden Killers With Tony Brueski | True Crime",
  "spotifyId": "6sTbMgWRC2A5EJWLrFb7eP",
  "appleId": 1655749292,
  "youTubeChannelId": "UC8-vxmbhTxxG10sO1izODJg",
  "episodes": [
    {
      "id": "47939e44-1ce3-48bf-83b9-a6cbfd03e06b",
      "title": "Chad Daybell’s Love Letters to Tammy EXPOSED: Fiction or Reality?",
      "description": "Chad Daybell’s Love Letters to Tammy EXPOSED: Fiction or Reality?\n\nOn Hidden Killers Live, Tony Brueski and the crew unpack Letter Two from Chad Daybell’s prison writings, where he devotes the entire entry to Tammy Daybell — the wife he was later convicted of conspiring to kill.\n\nChad paints a glowing portrait of their early romance, marriage, and family life. He gushes over their first meeting, the Oingo Boingo and B-52s concerts they attended, and the book company they built together. He describes Tammy as vibrant, kind, and angelic — almost saintlike in his retelling.\n\nBut the irony is suffocating: this is the same man convicted of orchestrating Tammy’s murder, burying children in his backyard, and plotting alongside Lori Vallow in one of the most infamous cult-driven cases in American true crime.\n\nThe hosts break down the surreal contradictions. How does a man convicted of family annihilation manage to write love letters that sound like Hallmark scripts? How does nostalgia about “family dance parties” ring when you know what he really did?\n\nWith sharp banter and biting analysis, this segment reveals the psychological gymnastics of a killer desperate to rewrite his own history. It’s unsettling, absurd, and a darkly fascinating glimpse into how Chad Daybell sees himself — and how far he’ll go to manipulate even from death row.\n\n#ChadDaybell #TammyDaybell #LoriVallow #DaybellTrial #CultCrimes #HiddenKillers #TrueCrimeObsessed #PodcastClips #CourtCase #FamilyMurder\n\nWant to comment and watch this podcast as a video? \n\nCheck out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-09-16T11:00:00Z",
      "duration": "00:15:19",
      "explicit": false,
      "spotifyId": "4fkowYRbaUIGuDxLtSkqyk",
      "appleId": 1000727040702,
      "youTubeId": "tWEqY4xUrww",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fkowYRbaUIGuDxLtSkqyk",
        "apple": "https://podcasts.apple.com/podcast/chad-daybells-love-letters-to-tammy-exposed-fiction/id1655749292?i=1000727040702",
        "youtube": "https://www.youtube.com/watch?v=tWEqY4xUrww"
      }
    },
    {
      "id": "856605c0-b1d6-4b85-8f46-e114b4996e56",
      "title": "INSANE Confession: Amish Mom Claims Husband Is “In a Fish” After Drowning at Ohio Lake",
      "description": "INSANE Confession: Amish Mom Claims Husband Is “In a Fish” After Drowning at Ohio Lake \n\nIt sounds like something ripped straight from a dark biblical parable — but it’s real. At a quiet Ohio lake, what should have been a simple Amish family camping trip turned into one of the most shocking true crime stories of the year. By the end of the day, Marcus Miller was dead, 4-year-old Vincent was drowned, and his mother Ruth Miller was calmly telling police on bodycam that her husband was “at the bottom of the lake in a fish.”\n\nIn this Hidden Killers Live segment, Tony Brueski, Stacy Cole, and Todd Michaels break down the timeline of August 23rd at Atwood Lake. What started as a “test from God” spiraled into horror: Marcus walking into the water and never returning, Ruth “giving” her son to God, and her desperate claim to officers that her husband had been swallowed whole like a modern-day Jonah.\n\nThe hosts dig deep into the questions this case forces us to ask: Was Ruth Miller insane, or was this faith taken to its most destructive extreme? How does a community with limited access to mental health care handle delusions that masquerade as religious devotion? And how can a family’s private spiral turn into a public tragedy that shocks the entire country?\n\nWith bodycam footage capturing Ruth’s chilling calmness, this case exposes the razor-thin line between devotion and delusion, faith and psychosis. Is this simply madness — or a warning about what happens when insular belief systems collide with untreated mental illness?\n\n#RuthMiller #Amish #TrueCrime #HiddenKillers #AtwoodLake #InsanityDefense #OhioCrime #Bodycam #ReligiousDelusion #FaithAndCrime\n\nWant to comment and watch this podcast as a video?\n\nCheck out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-09-15T17:00:32Z",
      "duration": "00:17:51",
      "explicit": false,
      "youTubeId": "HJysHDkuNUo",
      "subjects": [
        "Amish"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HJysHDkuNUo"
      }
    },
    {
      "id": "0465a412-21c5-4eaa-a037-357f191ee6cd",
      "title": "Chad Daybell Prison Letter #4: Missionary Memories, Excommunication, and Whitney Houston",
      "description": "​Convicted killer Chad Daybell — sentenced to death for murdering his wife Tammy Daybell and Lori Vallow’s children, Tylee and J.J. — has released another surreal letter from prison. This time, he rewinds to his days as a young LDS missionary in New Jersey, recounting street confrontations, spiritual visions, and even a moment when Whitney Houston’s “So Emotional” became, in his words, a “sacred hymn.”\n\nDaybell also uses the letter to lament his excommunication from the LDS Church, portraying himself as the victim of a cold and unfair process, and insisting he is still spiritually intact despite being cast out. Throughout, he frames himself as a devoted man of faith — a bizarre self-portrait that clashes violently with the reality of his conviction for orchestrating a doomsday-fueled murder plot.\n\nThe insanity of this letter is in the contradictions: Daybell attempts to wrap himself in nostalgia, music, and missionary zeal while ignoring the lives destroyed by his actions. It’s another manipulative rewrite from a man the jury found guilty of cold-blooded killings.\n\nIn this episode, we break down Daybell’s prison narrative, exploring how his words reveal denial, delusion, and an ongoing effort to control his legacy from behind bars.\n\n#ChadDaybell #LoriVallow #TammyDaybell #TyleeRyan #JJVallow #DeathRow #CultMurders #TrueCrime #HiddenKillers\n\nWant to comment and watch this podcast as a video? Check out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\n\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-09-15T08:00:06Z",
      "duration": "00:15:18",
      "explicit": false,
      "youTubeId": "2PlVhwTfJwE",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2PlVhwTfJwE"
      }
    },
    {
      "id": "bccd1da2-2255-47d5-a0ef-15ae692f7cc4",
      "title": "Chad Daybell Prison Letter #3: Death Row Lies About (His Wife) Tammy’s Death",
      "description": "​Chad Daybell — sentenced to death for murdering his wife Tammy Daybell and Lori Vallow’s children, Tylee and J.J. — has released yet another prison letter, this time spinning a detailed story about Tammy’s supposed health decline leading up to her death in 2019.\n\nIn this account, Daybell paints a picture of Tammy as a devoted wife, mother, animal lover, librarian, and gardener, while chronicling fainting spells, bloating, fatigue, and a “sudden” death that he claims shocked the family. He even laces the narrative with LDS spiritual encounters and nostalgic family memories, all while insisting she died of natural causes.\n\nThe insanity of this letter is that it reads like an elaborate cover story — a murderer rewriting history from his cell on Death Row. Instead of taking responsibility for what a jury unanimously decided was a calculated, apocalyptic murder plot, Daybell uses pages of personal anecdotes and religious imagery to portray himself as a loving husband blindsided by tragedy.\n\nIn this episode, we dissect the contradictions in Chad Daybell’s writing, exposing how his prison letters attempt to sanitize the reality of Tammy’s murder, erase his role in the “doomsday cult” killings, and manipulate perception as he fights for appeals.\n\nSubscribe for more in-depth breakdowns as we continue uncovering the chilling disconnect between Daybell’s words and the horrific truth.\n\n#ChadDaybell #TammyDaybell #LoriVallow #TyleeRyan #JJVallow #CultMurders #DeathRow #TrueCrime #HiddenKillers\n\nWant to comment and watch this podcast as a video? Check out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\n\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-09-15T06:00:06Z",
      "duration": "00:13:17",
      "explicit": false,
      "youTubeId": "nZPNkjXGNUA",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nZPNkjXGNUA"
      }
    },
    {
      "id": "fb29cf86-7386-4c91-befe-7eaa98709390",
      "title": "Chad Daybell Prison Letter #2: The Twisted Love Letter to Tammy",
      "description": "On Death Row for the murders of his wife Tammy Daybell and Lori Vallow’s children, Tylee and J.J., Chad Daybell has released another letter from prison — this one devoted entirely to Tammy, the very woman he was convicted of killing. In it, he waxes poetic about their love story, their early marriage, their publishing company, their shared passion for music, and their family life, all while denying he ever harmed her.\n\nThe insanity of this letter lies in its surreal disconnect: a convicted murderer romanticizing his “forever love” with the wife a jury unanimously concluded he conspired to kill. Daybell paints himself as a devoted husband and family man, while the reality remains that Tammy’s sudden death was part of the doomsday-fueled scheme that also claimed the lives of two innocent children.\n\nIn this episode, we break down Chad Daybell’s disturbing attempt to rewrite history, looking at how he uses sentimentality, faith, and nostalgia to cast himself as the victim of media lies — and why these prison writings may be less about Tammy’s memory and more about manipulation and control.\n\nSubscribe for more in-depth true crime analysis as we continue exposing the chilling contradictions in the Daybell–Vallow saga.\n\n#ChadDaybell #TammyDaybell #LoriVallow #TyleeRyan #JJVallow #CultMurders #DeathRow #TrueCrime #HiddenKillers\n​Want to comment and watch this podcast as a video? Check out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\n\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-09-15T05:00:53Z",
      "duration": "00:14:06",
      "explicit": false,
      "youTubeId": "lvsMmeEX6NM",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lvsMmeEX6NM"
      }
    },
    {
      "id": "903aebea-8775-40a5-b459-492c7b3d153d",
      "title": "Chad Daybell Prison Letter #1 In His Own Words",
      "description": "Chad Daybell sits on Death Row after being convicted of murdering his wife Tammy Daybell and Lori Vallow’s children, Tylee Ryan and J.J. Vallow — yet from his prison cell, he’s now writing letters that sound almost surreal in the face of his crimes. In his first message, Daybell thanks supporters, reminisces about building a bookshelf in junior high, shares favorite Christian radio songs, and insists he’s a “gentle peacemaker” who never killed anyone.\n\nThe insanity of this letter is how completely detached it is from the brutal reality of what a jury unanimously found him guilty of: a calculated, apocalyptic plot that ended three innocent lives. Daybell uses his platform to rewrite history, deny responsibility, and cloak himself in faith and nostalgia, all while families of the victims continue to grieve.\n\nIn this episode, we break down the disturbing gap between Chad Daybell’s words and his actions, exploring whether these letters are an attempt at manipulation, self-delusion, or the groundwork for his appeals.\n\nSubscribe for more deep-dive analysis as we continue covering the chilling Daybell–Vallow case.\n\n#ChadDaybell #LoriVallow #TyleeRyan #JJVallow #TammyDaybell #DeathRow #CultMurders #TrueCrime #HiddenKillers #CrimeAnalysis​\n\nWant to comment and watch this podcast as a video? Check out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\n\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-09-15T03:57:26Z",
      "duration": "00:08:24",
      "explicit": false,
      "youTubeId": "3S_P_y7AqfQ",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3S_P_y7AqfQ"
      }
    },
    {
      "id": "9bfca881-c157-4be7-946d-2f8a27cdebae",
      "title": "Lori Vallow Daybell Sentencing   Larry Woodcock Tells Off Lori In Court",
      "description": "In one of the most emotionally charged moments of the Lori Vallow Daybell sentencing in Arizona, Larry and Kay Woodcock delivered unforgettable victim impact statements. Their words weren’t just about punishment — they were a raw, powerful memorial to the people Lori helped destroy.\n\nKay Woodcock read a heartbreaking letter written from the perspective of her murdered grandson, JJ Vallow. “I should be 13 now,” she read, “but I’m forever seven… I trusted you.” The courtroom was left silent, the weight of those words settling heavy over everyone. It was a moment of unimaginable grief, wrapped in a message of love and betrayal.\n\nThen came Larry. His delivery was fiery, unapologetic, and deeply personal. He called Lori a narcissist, a psychopath, and a murderess. He spared no detail in describing the devastation she left behind — not just in lives lost, but in the emotional carnage that followed. His voice shook, but his message was unshakable: Lori Vallow was no misunderstood mother. She was a cold, calculating killer who tore families apart.\n\nThis episode dives deep into those statements, examining how victim impact testimony influences sentencing and helps reclaim power in a courtroom often dominated by the accused. We’ll explore what these words meant to the Woodcocks, to the judge, and to a public that’s followed this disturbing case from day one.\n\nIf you want to understand the real cost of Lori Vallow’s actions, it’s in these voices — the ones still standing.\n\n#LoriVallow #JJVallow #KayWoodcock #LarryWoodcock #VictimImpact #JusticeForJJ #SentencingHearing #TrueCrimePodcast #HiddenKillers #DoomsdayMom\n\n\n\n​Want to comment and watch this podcast as a video? Check out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\n\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-07-25T22:28:26Z",
      "duration": "00:06:31",
      "explicit": false,
      "youTubeId": "Zt6ssn2AHnU",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Zt6ssn2AHnU"
      }
    },
    {
      "id": "c8b82896-cde6-44bd-8fb1-3b4ab7f0f15e",
      "title": "Lori Vallow Daybell\u0027s FULL CRAZY Court Speech At Sentencing",
      "description": "It was less a legal argument and more a psychological showcase. Lori Vallow Daybell’s sentencing speech wasn’t just strange — it was downright surreal. Representing herself in court, she took the stand and delivered what might go down as one of the most bizarre courtroom performances in true crime history.\n\nOver the course of her statement, Lori invoked religious visions, referenced biblical betrayal, claimed persecution by the justice system, and refused to show remorse for any of the lives lost. She called the case a “family tragedy” rather than a crime. She rambled about angels, spirits, and justice from a higher plane. She even went so far as to suggest that if people truly understood the spiritual truth behind the events, they would forgive her.\n\nJudge Beresky wasn’t having it. He interrupted her multiple times, asked her to remain relevant, and eventually reprimanded her for using the courtroom as a stage rather than a legal venue. His message was clear: this wasn’t a pulpit for self-righteous delusion — this was about justice.\n\nIn this episode, we break down every disturbing, bewildering moment. What was she trying to accomplish? Did her strategy backfire? Was this the last gasp of control from a woman who’s lost everything? Or just another chapter in the ongoing psychological unraveling of the so-called “Doomsday Mom”?\n\nFrom legal analysis to behavioral interpretation, we dissect this unforgettable moment in the Lori Vallow saga. Strap in — this one’s wild.\n\n#LoriVallow #SentencingSpeech #SelfRepresentation #CourtroomDrama #TrueCrimePodcast #DoomsdayMom #LegalBreakdown #HiddenKillers #PsychologicalAnalysis #CultCrimes\n\n​Want to comment and watch this podcast as a video? Check out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\n\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-07-25T22:02:35Z",
      "duration": "00:11:44",
      "explicit": false,
      "youTubeId": "22BXYe-xpMQ",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=22BXYe-xpMQ"
      }
    },
    {
      "id": "e128c561-8103-4fa3-bd61-3d30f0629426",
      "title": "‘God’s Misfits’ Members Detail Chilling Plot to Kill Two Mothers in Oklahoma Murder Case",
      "description": "Two Oklahoma residents, Paul Grice and Cora Twombly—members of the fringe group God’s Misfits—are cooperating with authorities in a disturbing murder case involving the March 2024 killings of Veronica Butler and Jilian Kelley. Testimony reveals that the victims were lured to a trailer under false pretenses and murdered in a religiously motivated plot led by Tifany Adams, the children’s grandmother, amid a custody dispute. Grice admitted Adams asked him to kill Butler and used Bible verses to justify the act, while Twombly described her role in destroying evidence. The women’s bodies were later found in an underground freezer, and both defendants now face lengthy sentences under plea deals as the case heads toward trial.\n\n\n\nWant to comment and watch this podcast as a video?\n\n\n\nCheck out our YouTube Channel.  (https://www.youtube.com/@hiddenkillerspod) https://www.youtube.com/@hiddenkillerspod\n\nInstagram  (https://www.instagram.com/hiddenkillerspod/) https://www.instagram.com/hiddenkillerspod/\n\nFacebook  (https://www.facebook.com/hiddenkillerspod/) https://www.facebook.com/hiddenkillerspod/\n\nTik-Tok  (https://www.tiktok.com/@hiddenkillerspod) https://www.tiktok.com/@hiddenkillerspod\n\nX Twitter  (https://x.com/tonybpod) https://x.com/tonybpod\n\n\n\nListen Ad-Free On Apple Podcasts Here:  (https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872) https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872 ",
      "release": "2025-07-15T11:35:39Z",
      "duration": "00:15:29",
      "explicit": false,
      "spotifyId": "2KttN6YG410gP6Zv8X9gO2",
      "appleId": 1000717356800,
      "youTubeId": "NsaOKPEP4RQ",
      "subjects": [
        "God\u0027s Misfits"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2KttN6YG410gP6Zv8X9gO2",
        "apple": "https://podcasts.apple.com/podcast/gods-misfits-members-detail-chilling-plot-to-kill-two/id1655749292?i=1000717356800",
        "youtube": "https://www.youtube.com/watch?v=NsaOKPEP4RQ"
      }
    },
    {
      "id": "c793d5da-9abf-4629-b916-f072b1cf795f",
      "title": "88 Children Removed From Iowa Bible Camp Inside the Human Trafficking Investigation",
      "description": "In June 2025, law enforcement descended on a small Iowa town to execute one of the largest child removal operations in the state\u0027s history. 88 children were evacuated from the Shekinah Glory Camp in Columbus Junction, launching a human trafficking investigation that would expose troubling questions about religious authority, refugee vulnerability, and alleged exploitation.\nThe Kingdom Ministry of Rehabilitation and Recreation, run by Burmese pastors in a town where 25% of residents are Myanmar refugees, operated what they claimed was a Bible camp for addiction recovery. But when a 15-year-old from Texas made a desperate call to authorities, it triggered a multi-agency raid involving the Louisa County Sheriff\u0027s Office, Iowa DHS, and state criminal investigators.\nIn this video, we examine:\n\nThe timeline of events leading to the raid\nWhy authorities launched a trafficking investigation\nThe vulnerable Burmese refugee community targeted\nHow 60\u002B people lived in 5 mobile homes\nThe ministry\u0027s claims vs. what investigators found\nLegal precedents from similar religious compound cases\nWhy no arrests have been made (yet)\n\nThis case sits at the intersection of immigration, religious freedom, and child protection - raising critical questions about oversight of faith-based organizations serving vulnerable populations.\n⚠️ This is an active investigation. All individuals are presumed innocent until proven guilty in a court of law.\n📧 Submit tips: [your email]\n🔔 Subscribe for updates on this developing case\nChapters:\n00:00 The Raid\n[Add timestamps as needed]\nSources: Louisa County Sheriff\u0027s Office, Iowa DHS, KWQC, The Gazette, WQAD\nHashtags:\n#ShekinahGloryCamp #IowaTrueCrime #KingdomMinistry #ColumbusJunction #HumanTraffickingCase #ReligiousCamp #BurmeseRefugees #MyanmarCommunity #TrueCrime2025 #ChildRescue #IowaInvestigation #CultInvestigation #ReligiousExploitation #RefugeeCommunity #BibleCampRaid #TrueCrimeCommunity #ActiveInvestigation #ChildTrafficking #ReligiousFreedom #JusticeFor88 #IowaCrime #ChurchScandal #BreakingTrueCrime #CriminalInvestigation #MinistryScandal​\n\nWant to comment and watch this podcast as a video? Check out our YouTube Channel. https://www.youtube.com/@hiddenkillerspod\n\nInstagram https://www.instagram.com/hiddenkillerspod/\nFacebook https://www.facebook.com/hiddenkillerspod/\nTik-Tok https://www.tiktok.com/@hiddenkillerspod\nX Twitter https://x.com/tonybpod\n\nListen Ad-Free On Apple Podcasts Here: https://podcasts.apple.com/us/podcast/true-crime-today-premium-plus-ad-free-advance-episode/id1705422872",
      "release": "2025-06-18T20:00:06Z",
      "duration": "00:15:47",
      "explicit": false,
      "spotifyId": "49twbQTcYZ3DmshfemsGsO",
      "appleId": 1000713321900,
      "youTubeId": "k8V5Ql-KNj8",
      "subjects": [
        "Human Trafficking",
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/49twbQTcYZ3DmshfemsGsO",
        "apple": "https://podcasts.apple.com/podcast/88-children-removed-from-iowa-bible-camp-inside-the/id1655749292?i=1000713321900",
        "youtube": "https://www.youtube.com/watch?v=k8V5Ql-KNj8"
      }
    },
    {
      "id": "0fb65772-2abc-4bc0-b998-a5223ba61d74",
      "title": "Psychotherapist Breaks Down What To Expect From Lori Vallow Daybell As New Trial Begins",
      "description": "Psychotherapist Breaks Down What To Expect From Lori Vallow Daybell As New Trial Begins Could a self-declared prophet really be her own best defense attorney—while on trial for conspiracy to murder? Lori Vallow Daybell isn’t just accused of plotting her husband’s death—she’s also decided she’s the right person to argue her own case in court. Yeah, because nothing says “stable and innocent” like cross-examining witnesses in shackles. In this episode, Tony Brueski and psychotherapist/author Shavaun Scott dive into the chilling psychology of Lori Vallow Daybell. From beauty queen and game show contestant to cult follower and alleged killer, Lori’s journey is packed with delusion, narcissism, and a little too much confidence for someone on trial for murder. They explore her manipulative nature, religious delusions, and the disturbing dynamic between her and alleged cult leader Chad Daybell—think less “meant to be,” more “shared psychosis with a body count.” What makes someone truly believe their spouse is a demon and deserves to die? And worse—how do they convince others to believe it too? #LoriVallowDaybell #TrueCrimePodcast #CultMentality #PsychologicalDisorders #MurderTrial #HiddenKillers #DarkPsychology Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-04-01T17:00:00Z",
      "duration": "00:12:32.5350000",
      "explicit": false,
      "spotifyId": "6yvZe5C9m5wgzv3w5g04qL",
      "appleId": 1000701765211,
      "youTubeId": "5AVOPcFKKG4",
      "subjects": [
        "Chad Daybell",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6yvZe5C9m5wgzv3w5g04qL",
        "apple": "https://podcasts.apple.com/podcast/psychotherapist-breaks-down-what-to-expect-from-lori/id1655749292?i=1000701765211",
        "youtube": "https://www.youtube.com/watch?v=5AVOPcFKKG4"
      }
    },
    {
      "id": "29eaae8b-0777-4f51-8ef5-b7974282e428",
      "title": "RAW COURT AUDIO-AZ v. Lori Daybell, Pretrial Hearing- Part 1",
      "description": "Convicted killer Lori Vallow Daybell, known as the \u0022Doomsday Cult Mom,\u0022 has filed a handwritten motion requesting that Court TV be barred from covering her Arizona courtroom proceedings. She claims the network’s past coverage of her and her fifth husband, Chad Daybell\u0027s, murder cases in Idaho have been prejudicial. \n\n\n\nRepresenting herself at trial, Daybell faces charges for the murder of her fourth husband, Charles Vallow, and the attempted murder of her niece’s ex-husband, Brandon Boudreaux. \n\n\n\nWant to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free:  (https://tinyurl.com/ycw626tj) https://tinyurl.com/ycw626tj\n\nFollow Our Other Cases:  (https://www.truecrimetodaypod.com/) https://www.truecrimetodaypod.com\n\n The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com (https://www.truecrimetodaypod.com/)  ",
      "release": "2025-03-11T20:29:09Z",
      "duration": "00:29:11",
      "explicit": false,
      "spotifyId": "6S1ulfsZ6o8IaYr5bvzJpg",
      "appleId": 1000698788089,
      "youTubeId": "oJVlApy3JvM",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6S1ulfsZ6o8IaYr5bvzJpg",
        "apple": "https://podcasts.apple.com/podcast/raw-court-audio-az-v-lori-daybell-pretrial-hearing-part-1/id1655749292?i=1000698788089",
        "youtube": "https://www.youtube.com/watch?v=oJVlApy3JvM"
      }
    },
    {
      "id": "e36412c4-f70b-412b-b6d8-c8a9318dc067",
      "title": "RAW COURT AUDIO-AZ v. Lori Daybell, Pretrial Hearing- Part 2",
      "description": "Convicted killer Lori Vallow Daybell, known as the \u0022Doomsday Cult Mom,\u0022 has filed a handwritten motion requesting that Court TV be barred from covering her Arizona courtroom proceedings. She claims the network’s past coverage of her and her fifth husband, Chad Daybell\u0027s, murder cases in Idaho have been prejudicial. \n\n\n\nRepresenting herself at trial, Daybell faces charges for the murder of her fourth husband, Charles Vallow, and the attempted murder of her niece’s ex-husband, Brandon Boudreaux. \n\n\n\nWant to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free:  (https://tinyurl.com/ycw626tj) https://tinyurl.com/ycw626tj\n\nFollow Our Other Cases:  (https://www.truecrimetodaypod.com/) https://www.truecrimetodaypod.com\n\n The latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com (https://www.truecrimetodaypod.com/)  ",
      "release": "2025-03-11T20:29:08Z",
      "duration": "00:28:53",
      "explicit": false,
      "spotifyId": "0gvRkNmKSveN4R3N5otxKo",
      "appleId": 1000698788197,
      "youTubeId": "vd7qUm5d7Ro",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0gvRkNmKSveN4R3N5otxKo",
        "apple": "https://podcasts.apple.com/podcast/raw-court-audio-az-v-lori-daybell-pretrial-hearing-part-2/id1655749292?i=1000698788197",
        "youtube": "https://www.youtube.com/watch?v=vd7qUm5d7Ro"
      }
    },
    {
      "id": "2ac10714-4d2f-43d2-8e88-98557cbfb406",
      "title": "Inside Lori Vallow’s Mind - Psychotherapist Breaks Down Her Dateline Interview",
      "description": "What does it take for someone to completely detach from reality? Apparently, not much if you\u0027re Lori Vallow Daybell. Fresh off her first-ever on-camera interview, she\u0027s still doubling down on her delusions, claiming Jesus personally assured her she and Chad would be exonerated. Because, you know, visions trump a life sentence and a guilty verdict.\n\nPsychotherapist and author Shavaun Scott joins the discussion, breaking down how Lori\u0027s unwavering belief system isn’t just a stubborn personality trait—it\u0027s likely the result of a rare and severe delusional disorder. Could this have been avoided if she’d never crossed paths with Chad Daybell, or was this path inevitable? And what about Alex Cox—was he suffering from the same disorder, or just a dangerously devoted follower?\n\nWhen two people’s delusions feed off each other, where does the manipulation end and the madness begin?\n\n#LoriVallow #TrueCrime #PsychologyOfEvil #ChadDaybell #HiddenKillers #DelusionalDisorder #CultMindset\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-03-10T20:00:05Z",
      "duration": "00:22:12",
      "explicit": false,
      "spotifyId": "1IbxamX6YJllw1Bl8oeijY",
      "appleId": 1000698615314,
      "youTubeId": "ywMMSSFig00",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IbxamX6YJllw1Bl8oeijY",
        "apple": "https://podcasts.apple.com/podcast/inside-lori-vallows-mind-psychotherapist-breaks-down/id1655749292?i=1000698615314",
        "youtube": "https://www.youtube.com/watch?v=ywMMSSFig00"
      }
    },
    {
      "id": "d3aa79e7-f815-408f-a23e-9dc073d4e57a",
      "title": "The Hidden Psychology Behind Kevin Franke’s Inaction – FBI Expert Weighs In",
      "description": "How do you go from being a father of six to turning a blind eye when your children are suffering? That’s the question swirling around Kevin Franke, who spent a year estranged from his wife, Ruby, and their kids—only to seemingly jump right back into the chaos when given the chance. Even as disturbing truths about alleged child abuse surfaced, he clung to the belief that Ruby and Jodi Hildebrandt had everything under control.\n\nWas it brainwashing? An addiction to a toxic relationship? Or was Kevin simply so deep in denial that reality didn’t stand a chance? Retired FBI Special Agent Robin Dreeke breaks down the psychological stronghold that kept Kevin tethered to an allegedly abusive dynamic, even as the walls of his world came crashing down. And with Kevin now fighting for custody of his children, the question remains—should he get them back? Or is he still too lost in the wreckage to be the father they need?\n\n#TrueCrime #KevinFranke #RubyFranke #JodiHildebrandt #ChildAbuse #PsychologicalManipulation #HiddenKillers\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ Spotify: https://shorturl.at/eksC5 Follow Us On Social Media: Instagram: https://www.instagram.com/hiddenkillerspod/ TikTok: https://www.tiktok.com/@hiddenkillerspod Facebook: https://www.facebook.com/hiddenkillerspod/ #truecrime #truecrimecommunity #murdermystery #unsolvedmysteries #coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-03-09T20:00:06Z",
      "duration": "00:12:18",
      "explicit": false,
      "youTubeId": "3L5fT-W9kEU",
      "subjects": [
        "Connexions",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3L5fT-W9kEU"
      }
    },
    {
      "id": "f5e67a4e-4b1a-4e0d-8221-c91250891d0c",
      "title": "Breaking Down The Beliefs of Chad \u0026 Lori Vallow Daybell | Part 4 - Prophecies \u0026 Fatalities",
      "description": "At some point, reality catches up with delusion. For Chad and Lori, that moment came when their doomsday prophecy failed, the bodies were found, and the world demanded answers.\n\nThis episode follows the unraveling of their belief system, from the moment their July 2020 doomsday prediction never came true to the mounting pressure from law enforcement and national media. Lori’s chilling lack of emotion after her children disappeared and her refusal to cooperate with investigators only fueled the fire. Chad, once seen as a spiritual leader, suddenly found himself a fugitive, his so-called prophetic status crumbling under legal scrutiny.\n\nThrough court testimonies, expert breakdowns, and official LDS responses, we explore how justice was finally served. Chad and Lori’s religious justifications were torn apart in court, and their former followers turned against them. The trial exposed the full extent of their manipulation, their self-serving doctrine, and the horrifying reality of what they had done in the name of their so-called divine mission.\n\nThis wasn’t just a story about a crime—it was a case study in radicalization, cult psychology, and the dangers of unchecked belief.\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ Spotify: https://shorturl.at/eksC5 Follow Us On Social Media: Instagram: https://www.instagram.com/hiddenkillerspod/ TikTok: https://www.tiktok.com/@hiddenkillerspod Facebook: https://www.facebook.com/hiddenkillerspod/ #truecrime #truecrimecommunity #murdermystery #unsolvedmysteries #coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-03-07T18:00:31Z",
      "duration": "00:20:36",
      "explicit": false,
      "spotifyId": "7gPARH2Kl8DoUnHdbl4gjM",
      "appleId": 1000698278432,
      "youTubeId": "0rSKWvT0V4Y",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7gPARH2Kl8DoUnHdbl4gjM",
        "apple": "https://podcasts.apple.com/podcast/breaking-down-the-beliefs-of-chad-lori-vallow/id1655749292?i=1000698278432",
        "youtube": "https://www.youtube.com/watch?v=0rSKWvT0V4Y"
      }
    },
    {
      "id": "ab393861-3e48-4264-a325-30f783c950c7",
      "title": "Breaking Down The Beliefs of Chad \u0026 Lori Vallow Daybell  | Part 3 - Running A Cult",
      "description": "Chad and Lori weren’t just theorizing about the apocalypse—they were actively preparing for it. This episode takes you inside the cult-like rituals that cemented their control over their small but devoted group of followers. From prayer circles and casting ceremonies to exorcisms meant to drive out “dark spirits,” we reveal the manipulative practices they used to create an unshakable belief system where questioning was not allowed.\n\nOnce Chad and Lori had their followers’ trust, the next step was eliminating the obstacles—anyone who didn’t fit into their end-times prophecy. Their doctrine of “zombies” and demonic possession became a convenient excuse to justify murder. When Chad prophesied that his wife Tammy would soon die, she did. When Lori declared her own children were no longer “themselves,” they vanished.\n\nThrough chilling text messages, firsthand testimonies, and expert psychological analysis, we examine how Lori and Chad stripped away their moral inhibitions. By the time law enforcement caught on, the body count was growing. What made them believe that murder was righteous? And how did their manipulation techniques turn everyday people into accomplices?\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ Spotify: https://shorturl.at/eksC5 Follow Us On Social Media: Instagram: https://www.instagram.com/hiddenkillerspod/ TikTok: https://www.tiktok.com/@hiddenkillerspod Facebook: https://www.facebook.com/hiddenkillerspod/ #truecrime #truecrimecommunity #murdermystery #unsolvedmysteries #coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-03-06T18:00:21Z",
      "duration": "00:17:53",
      "explicit": false,
      "spotifyId": "1uYepoURNQdgI4xAuswpK0",
      "appleId": 1000698116600,
      "youTubeId": "c9o15JCbIMM",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1uYepoURNQdgI4xAuswpK0",
        "apple": "https://podcasts.apple.com/podcast/breaking-down-the-beliefs-of-chad-lori-vallow/id1655749292?i=1000698116600",
        "youtube": "https://www.youtube.com/watch?v=c9o15JCbIMM"
      }
    },
    {
      "id": "0dcf0c0d-9fdc-4492-8034-7d15c7f498fb",
      "title": "Breaking Down The Beliefs of Chad \u0026 Lori Vallow Daybell | Part 2 - The Doom \u0026 Gloom",
      "description": "Once Chad Daybell and Lori Vallow believed they were chosen by God, their doctrine evolved into a radical, self-serving theology that justified their crimes. In this episode, we break down the specific tenets of their belief system, from Chad’s doomsday timelines predicting the world would end in July 2020 to the twisted reincarnation doctrine known as “multiple mortal probations.”\n\nTheir obsession with end-times prophecy was fueled by LDS tent-city survivalist movements, where members believed they would be called to gather in safe zones before the world collapsed. But Chad and Lori took it further, convincing themselves that some souls were no longer human at all. Through their bizarre “light vs. dark” ranking system, they determined who was “worthy” to move forward—and who had become a zombie that needed to be eliminated.\n\nWe also explore their belief in divine powers, including Lori’s claim that she was immortal and Chad’s so-called spiritual portal. These doctrines weren’t just harmless religious speculation—they were the foundation of a doomsday cult that led to multiple murders. How did Chad and Lori justify their actions as part of their divine mission? And what happens when a prophecy fails but the believers refuse to accept it?\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ Spotify: https://shorturl.at/eksC5 Follow Us On Social Media: Instagram: https://www.instagram.com/hiddenkillerspod/ TikTok: https://www.tiktok.com/@hiddenkillerspod Facebook: https://www.facebook.com/hiddenkillerspod/ #truecrime #truecrimecommunity #murdermystery #unsolvedmysteries #coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkies",
      "release": "2025-03-05T18:00:06Z",
      "duration": "00:32:06",
      "explicit": false,
      "spotifyId": "0l6A5PsAbMjhDdMmMB8ovd",
      "appleId": 1000697989114,
      "youTubeId": "K7UpGtc1erY",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0l6A5PsAbMjhDdMmMB8ovd",
        "apple": "https://podcasts.apple.com/podcast/breaking-down-the-beliefs-of-chad-lori-vallow/id1655749292?i=1000697989114",
        "youtube": "https://www.youtube.com/watch?v=K7UpGtc1erY"
      }
    },
    {
      "id": "7b6f85b7-2a62-453b-a068-77eb52c242d2",
      "title": "Breaking Down The Beliefs of Chad \u0026 Lori Vallow Daybell | Part 1- How It Started",
      "description": "The story of Chad Daybell and Lori Vallow didn’t start with murder—it started with faith twisted into fanaticism. In this episode, we explore the LDS Church’s core beliefs, how mainstream Mormonism views prophecy and the Second Coming, and how Chad and Lori veered from religious devotion into dangerous extremism. Chad’s near-death experiences convinced him he had access to divine knowledge, while Lori’s obsession with end-times prophecy led her to believe she was a goddess chosen to gather the righteous. How did a simple belief in personal revelation and spiritual preparedness turn into an apocalyptic worldview that justified murder?\n\nWe break down Chad’s early writings, his rise in LDS prepping circles, and how fiction became fact in his mind. We also examine Lori’s transformation from a devoted Mormon mother to a self-proclaimed leader of the 144,000. By tracking their path from faith to fanaticism, we expose the psychological and religious factors that led them to classify people as “light” or “dark,” ultimately determining who lived and who died.\n\nThrough expert analysis and firsthand accounts, this episode lays the groundwork for understanding how a dangerous cult ideology took root within the framework of a mainstream religion. How did their beliefs develop? What warning signs were ignored? And could this have been stopped before it spiraled into murder?\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ Spotify: https://shorturl.at/eksC5 Follow Us On Social Media: Instagram: https://www.instagram.com/hiddenkillerspod/ TikTok: https://www.tiktok.com/@hiddenkillerspod Facebook: https://www.facebook.com/hiddenkillerspod/ #truecrime #truecrimecommunity #murdermystery #unsolvedmysteries #coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-03-04T18:00:05Z",
      "duration": "00:35:20",
      "explicit": false,
      "spotifyId": "33PXhAo9QnrU3pohEhcuoi",
      "appleId": 1000697737649,
      "youTubeId": "isLKtVPz_SQ",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33PXhAo9QnrU3pohEhcuoi",
        "apple": "https://podcasts.apple.com/podcast/breaking-down-the-beliefs-of-chad-lori-vallow/id1655749292?i=1000697737649",
        "youtube": "https://www.youtube.com/watch?v=isLKtVPz_SQ"
      }
    },
    {
      "id": "b836954c-0065-4c44-aeb3-e3e100a41d9c",
      "title": "Lori Vallow Daybell Wants Court TV Cameras Out Her Trial... Claims Slander",
      "description": "Lori Vallow Daybell, convicted murderer and self-proclaimed prophet, is gearing up for another courtroom battle, this time in Arizona. And in true Vallow fashion, she’s already trying to control the narrative. Representing herself, she’s filed an objection with the Maricopa County Superior Court, demanding that Court TV be banned from streaming the proceedings. Her reasoning? She claims the network is profiting off her tragedy and misrepresenting her in their coverage.\n\nNow, let’s be clear—Court TV is in the business of true crime entertainment. That’s not exactly breaking news. But Vallow’s sudden concern for journalistic integrity is ironic, to say the least, considering she’s been at the center of a twisted saga of deception, manipulation, and murder.\n\nVallow alleges that the network has used her and her husband, Chad Daybell, in promotional materials that have \u0022falsely characterized, libeled, and slandered\u0022 them. That’s quite a claim coming from someone who has already been convicted of killing two of her own children, along with her husband\u0027s first wife. Daybell, for his part, has been sentenced to death in Idaho for his role in those murders.\n\nChicago-based attorney Andrew Stoltmann sees right through her play. He believes Vallow is setting the stage for a circus—one where she’s the ringleader. By representing herself, she gains control over courtroom theatrics, with little to lose since she’s already serving a life sentence in Idaho. And if things don’t go her way? Self-representation could set her up for an ineffective counsel argument on appeal.\n\nThis latest trial stems from a 2021 indictment, in which a grand jury in Arizona charged Vallow with conspiracy to commit murder in the death of her fourth husband, Charles Vallow, and attempted murder of her niece’s ex-husband, Brandon Boudreaux. Prosecutors say Charles was shot and killed by Lori’s brother, Alex Cox, in 2019 in what was initially deemed self-defense. But as the bodies started piling up around Lori, investigators took another look. Cox, who conveniently died of an apparent blood clot months later, was also accused of conspiring with his sister in the attempted murder of Boudreaux.\n\nIt’s all part of a tangled web of so-called \u0022doomsday\u0022 beliefs, where Vallow and Daybell convinced themselves—and a select group of followers—that they were chosen by God to prepare for the end times. And in their twisted version of righteousness, getting rid of “dark spirits” meant eliminating people who stood in their way.\n\nOf course, the public fascination with this case exploded when the bodies of seven-year-old J.J. Vallow and sixteen-year-old Tylee Ryan were found buried on Daybell’s property in 2020. The children had been missing for months while Vallow and Daybell were off in Hawaii, seemingly unbothered. When authorities finally caught up with them, the excuses were endless. But by the time the trial rolled around, it was clear that no amount of religious justification could explain away the horrors uncovered in Idaho.\n\nA jury convicted Vallow on all counts, and in July 2023, she was sentenced to life in prison without parole. At her sentencing, Judge Steven Boyce didn’t hold back. He told Vallow, \u0022You had so many other options. You chose the most evil and destructive path possible.\u0022 Prosecutors and experts alike have pointed to Vallow’s psychiatric evaluations, which diagnosed her with delusional disorder, hyper-religiosity, and narcissistic tendencies. But none of it was enough to declare her legally insane.\n\nNow, as she prepares for her Arizona trial, Vallow has once again been granted a mental health evaluation. But if history is any indicator, she will likely be deemed competent to stand trial—meaning the next chapter of this saga is set to unfold in court on March 31.\n\nDespite her best efforts, cameras have been a fixture in this case from the beginning, and this time will likely be no different. Judges have weighed the pros and cons of public trials since O.J. Simpson’s infamous courtroom spectacle, and while some believe transparency is key, others argue that it turns legal proceedings into a performance. If anyone’s likely to take advantage of that, it’s Lori Vallow.\n\nWhether or not Court TV gets its live feed, one thing is certain—Vallow’s fight for control won’t stop here.\n\n#LoriDaybell #TrueCrime #CourtTV #MurderTrial\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ Spotify: https://shorturl.at/eksC5 Follow Us On Social Media: Instagram: https://www.instagram.com/hiddenkillerspod/ TikTok: https://www.tiktok.com/@hiddenkillerspod Facebook: https://www.facebook.com/hiddenkillerspod/ #truecrime #truecrimecommunity #murdermystery #unsolvedmysteries #coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-02-28T16:01:06Z",
      "duration": "00:12:32",
      "explicit": false,
      "spotifyId": "5AurJMgKXwFQhnPQ9TB6Kf",
      "appleId": 1000696784598,
      "youTubeId": "soyReQ_9QsQ",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5AurJMgKXwFQhnPQ9TB6Kf",
        "apple": "https://podcasts.apple.com/podcast/lori-vallow-daybell-wants-court-tv-cameras-out-her/id1655749292?i=1000696784598",
        "youtube": "https://www.youtube.com/watch?v=soyReQ_9QsQ"
      }
    },
    {
      "id": "faeb5259-533f-45db-88b6-ffa09e6e1656",
      "title": "What Happened In Little Diddy\u0027s Mom\u0027s House After Dark?",
      "description": "What happens when a childhood allegedly steeped in excess, control, and questionable choices becomes the foundation for a life of fame and power?\n\nExploring the accusations against Diddy, the episode dives into allegations from his past, including claims of an upbringing filled with sex, drugs, and the influence of those who shaped his early life. From alleged traumatic beginnings to questions about empathy, respect, and control, Robin Dreeke sheds light on how such experiences could mold a person\u0027s psyche and behavior. Is this a case of \u0022nature vs. nurture\u0022 gone wrong, or simply the dark shadow of fame?\n\nWith claims, counterclaims, and a legacy that continues to stir controversy, the episode pulls no punches in examining the unsettling underbelly of an empire built on fame. But amidst it all, one question lingers: Does a twisted upbringing excuse a lifetime of alleged manipulation and abuse?\n\n#TrueCrime #DiddyCase #HiddenKillers #RobinDreeke #DarkPast #PsychologicalAnalysis #CelebrityScandals\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-01-22T03:00:06Z",
      "duration": "00:09:22",
      "explicit": false,
      "youTubeId": "3bwUvmklSJ0",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3bwUvmklSJ0"
      }
    },
    {
      "id": "bb91a21b-36bf-4917-bf79-4bb1c3746069",
      "title": "Reactions To Lori Vallow Playing \u0027Attorney\u0027 With REAL Attorney, Eric Faddis",
      "description": "Could Lori Vallow’s courtroom antics end up sealing her own fate?\n\nIn this episode, we take a closer look at the chaotic scene that unfolds when Lori Vallow decides to act as her own legal counsel. From bizarre claims about her own children’s deaths to outlandish courtroom behavior, this case raises questions not just about her competency, but about how far a person can push the limits of self-representation.\n\nHow does a former prosecutor view the unfolding spectacle of Lori’s trial? And how might her own words come back to haunt her on the stand?\n\n#HiddenKillers #TrueCrimeToday #LoriVallow #CourtroomDrama #TrueCrimePodcast #MurderTrial #DarkHumor\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-01-21T05:00:05Z",
      "duration": "00:12:08",
      "explicit": false,
      "youTubeId": "n9y8rVRablw",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n9y8rVRablw"
      }
    },
    {
      "id": "02fc0e16-c738-46ac-a740-98ea95991b7d",
      "title": "Could Diddy\u0027s Mom Face Charges For Alleged Sex Parties Around Kids?",
      "description": "Is Sean \u0022Diddy\u0022 Combs’ past finally catching up with him? Allegations of wild parties, coerced encounters, and a troubling upbringing are swirling in a storm of controversy. What role did his mother allegedly play in shaping the environment that molded one of the music industry\u0027s biggest moguls? Dive into unsettling claims of drug-fueled parties, coercion, and exploitation, as well as their eerie parallels to the accusations leveled against him today. Could his defense team use his childhood experiences to sway the narrative, or is this just another chapter in a story of alleged abuse and manipulation? How do you prove coercion or consent decades later when the line between truth and deception is so blurred?\n\n#HiddenKillers #SeanCombs #DiddyAllegations #TrueCrimeToday #CelebrityScandal #JusticeMatters #DarkSecrets\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-01-21T01:00:05Z",
      "duration": "00:09:39",
      "explicit": false,
      "youTubeId": "CrAGSQk5V_Q",
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CrAGSQk5V_Q"
      }
    },
    {
      "id": "b13584a0-7886-4989-8bab-1db867b7f658",
      "title": "Breaking Down \u0027Attorney\u0027 Lori Vallow\u0027s First Court Appearance With Psychotherapist Shavaun",
      "description": "What happens when someone like Lori Vallow Daybell, accused of unthinkable acts, takes the courtroom stage as her own attorney? You get a front-row seat to what can only be described as a chaotic blend of legal jargon, conspiracy theories, and courtroom theatrics. From citing constitutional rights to playing the victim in her own delusions, Lori’s attempts to defend herself seem more like a bizarre performance than a coherent legal strategy.\n\nPsychotherapist Shavaun Scott joins Tony Brueski to unpack the layers of Lori\u0027s alleged delusional mindset, her courtroom antics, and how someone can present as \u0022competent\u0022 while seemingly detached from reality. As Lori spins her narrative, one can\u0027t help but wonder: is this a ploy, a symptom, or both? And just how low is the bar for courtroom competency?\n\n#LoriVallow #TrueCrimeToday #HiddenKillers #CourtroomDrama #PsychologyOfCrime #DelusionalDisorder #CrimeAnalysis\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2025-01-20T22:00:06Z",
      "duration": "00:16:20",
      "explicit": false,
      "spotifyId": "5rFtD5CeUSR1CZDWaW7rje",
      "appleId": 1000684727954,
      "youTubeId": "1lFVWHRwCW0",
      "subjects": [
        "Chad Daybell",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rFtD5CeUSR1CZDWaW7rje",
        "apple": "https://podcasts.apple.com/podcast/breaking-down-attorney-lori-vallows-first-court-appearance/id1655749292?i=1000684727954",
        "youtube": "https://www.youtube.com/watch?v=1lFVWHRwCW0"
      }
    },
    {
      "id": "739fa922-517e-4b0a-8ab2-fb8c50350061",
      "title": "Breaking Down Ruby Franke Daughter\u0027s Tell-All With Ret. FBI Robin Dreeke",
      "description": "What happens when the picture-perfect family life portrayed online hides a much darker reality? Ruby Franke, once a beloved family vlogger, and her business partner Jodi Hildebrandt now stand convicted of aggravated child abuse, their twisted dynamic exposed in the wake of Sherry Franke\u0027s memoir, The House of My Mother. Sherry’s story offers a harrowing glimpse into the alleged horrors she and her siblings endured, while peeling back the layers of manipulation, control, and the cult-like influence Jodi seemingly wielded over Ruby.\n\nBut it’s not just about Ruby and Jodi—it’s about the cost of family vlogging, the exploitation of children for clicks, and the dangerous line between parenting and profiting. With allegations of grooming, isolation, and a chilling level of control, how do we draw the line between sharing family life and selling it? Should children have a say in their digital presence, or is it all just the price of parental ambition?\n\nAnd what about you—how far is too far when it comes to family life on the internet?\n\n#TrueCrime #RubyFranke #FamilyVlogging #ChildExploitation #Memoir #Cults #ParentingDilemma\n\nWant to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj\nFollow Our Other Cases: https://www.truecrimetodaypod.com\nThe latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-01-20T22:00:00Z",
      "duration": "00:20:56",
      "explicit": false,
      "spotifyId": "6CvsQNGPxReiiJBhFGVDj5",
      "appleId": 1000684757788,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6CvsQNGPxReiiJBhFGVDj5",
        "apple": "https://podcasts.apple.com/podcast/breaking-down-ruby-franke-daughters-tell-all-with-ret/id1655749292?i=1000684757788"
      }
    },
    {
      "id": "7e274529-aff4-4f9d-8ecb-67cf849ac69c",
      "title": "Is Ruby Franke Evil, Victim Of A Cult Or Both?",
      "description": "What happens when a seemingly perfect family reveals its dark, twisted secrets? Ruby Franke, once a beloved YouTuber with millions of followers, is now facing prison for alleged horrific abuse of her children. Her daughter, Shari Franke, is breaking her silence, sharing chilling accounts of life behind closed doors—tales of deprivation, sadistic punishments, and a cult-like atmosphere that defy belief. Was Ruby always capable of such cruelty, or did her relationship with Jody Hildebrandt push her over the edge?\n\nJennifer Coffindaffer, retired FBI Special Agent, dissects the case, exposing the psychological dynamics that turned a mother into a monster. Is redemption ever possible for someone capable of such acts, or will Ruby\u0027s shadow haunt her family forever?\n\nWould you forgive, or is some betrayal simply unforgivable? #RubyFrankeCase #TrueCrimePodcast #HiddenKillers #FamilySecrets #ChildAbuseAllegations #CultMentality #JusticeForVictims\n\nWant to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj\nFollow Our Other Cases: https://www.truecrimetodaypod.com\nThe latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-01-20T14:00:00Z",
      "duration": "00:18:30",
      "explicit": false,
      "spotifyId": "1uU8ohuYK3VJlGK56FeBnb",
      "appleId": 1000684700744,
      "youTubeId": "DDEqNU_v9jk",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1uU8ohuYK3VJlGK56FeBnb",
        "apple": "https://podcasts.apple.com/podcast/is-ruby-franke-evil-victim-of-a-cult-or-both/id1655749292?i=1000684700744",
        "youtube": "https://www.youtube.com/watch?v=DDEqNU_v9jk"
      }
    },
    {
      "id": "12cf8e53-45ff-47a2-9ac1-ba36147a9f0e",
      "title": "When Did It All Go Wrong For Ruby Franke?",
      "description": "Did a YouTube mom turn her family into a real-life horror story? Ruby Franke, the once-popular family vlogger behind 8 Passengers, is now better known for her alleged role in a chilling tale of child abuse, manipulation, and a disturbing partnership with Jodi Hildebrandt. After years of portraying a picture-perfect life online, Ruby and Jodi’s reality shattered as they faced charges of aggravated child abuse—charges that ultimately led to lengthy prison sentences. Ruby’s eldest daughter, Sherry Franke, is breaking her silence. In her memoir The House of My Mother, Sherry reveals the haunting truths about life behind the camera. But this isn\u0027t just a tell-all; it’s a survival guide for anyone trapped in a web of control and trauma. From Jodi\u0027s alleged cult-like manipulation to shocking revelations of a physical relationship between the two women, Sherry unpacks a twisted story that feels almost too dark to be real. Can we ever truly see behind the curtain of someone’s carefully curated life?\n\n#RubyFranke #TrueCrime #SherryFranke #ChildAbuseAwareness #CultBehavior #TraumaRecovery #HiddenKillers\n\nWant to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj\nFollow Our Other Cases: https://www.truecrimetodaypod.com\nThe latest on The Downfall of Diddy, The Trial of Karen Read, The Murder Of Maddie Soto, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, The Menendez Brothers: Quest For Justice, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, The Murder Of Sandra Birchmore, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2025-01-20T13:00:00Z",
      "duration": "00:10:00",
      "explicit": false,
      "spotifyId": "1Ey22OhsQ5B3DBBHFZljcy",
      "appleId": 1000684693522,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Ey22OhsQ5B3DBBHFZljcy",
        "apple": "https://podcasts.apple.com/podcast/when-did-it-all-go-wrong-for-ruby-franke/id1655749292?i=1000684693522"
      }
    },
    {
      "id": "d173fe5e-9116-4e41-b439-c72df5fd2af6",
      "title": "Did Diddy Run One Of The Largest \u0026 Darkest Sexual Assault Cults In History?",
      "description": "What happens when someone’s public persona contrasts so sharply with their alleged private actions? In the case of Diddy, we’re not talking about a couple of minor accusations. We’re talking about 120 allegations that span over decades, ranging from minors to adults, with claims of sex trafficking, assault, kidnapping, and more. The dark irony here? His defense team claims he’s going to be “completely exonerated” as if the ship hasn’t already sunk. With so many lives affected, how do you even begin to address the magnitude of such a case? And what does it say about our culture that these things went on for so long? What happens when the stories just keep piling up?\n\n#TrueCrime #DiddyCase #Allegations #SexTrafficking #BehavioralAnalysis #JusticeForVictims #GroupThink\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2024-10-03T19:58:59Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "sfJeNbRV7vE",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sfJeNbRV7vE"
      }
    },
    {
      "id": "72a78b2a-81b8-4951-b4a7-cfae480892f1",
      "title": "Why Do Former Daybell \u0027Cult Members\u0027 Still Believe The Crazy Concepts Of Chad Daybell?",
      "description": "In this episode of \u0022Hidden Killers With Tony Brueski,\u0022 retired FBI Special Agent Robin Dreeke discusses the psychological effects of cult-like belief systems and their impact on individuals involved in high-profile legal cases like those of Chad Daybell and Lori Vallow. Dreeke explores how deeply ingrained beliefs and the need for belonging can affect people\u0027s perceptions and reactions when faced with the reality of their actions, especially when those actions conflict with societal norms. He elaborates on the difficulty some individuals face in reconciling their actions with their belief systems, often resulting in cognitive dissonance where they cannot accept reality even when confronted with irrefutable evidence. Key Points from the Conversation - **Cult-like Belief Systems:** Dreeke discusses how individuals involved in cults struggle to distance themselves from their beliefs even when faced with legal consequences or societal rejection. - **Cognitive Dissonance:** Members of these groups often exhibit cognitive dissonance, rationalizing their actions within their belief system despite evidence to the contrary. - **Echo Chambers:** The conversation touches on how echo chambers reinforce existing beliefs, making it difficult for individuals to accept contrary evidence. - **Social Needs and Group Belonging:** Dreeke highlights the human need to belong to groups and how this can lead people to remain in harmful situations or belief systems. - **Challenges in Changing Beliefs:** The discussion explores why it\u0027s hard for some people to change their views, even when faced with overwhelming evidence or after experiencing major life events. - **Impact on Legal Defense:** The ingrained beliefs and the public revelation of private communications can significantly undermine a legal defense, as seen in the trials of Chad Daybell and others. #HiddenKillersWithTonyBrueski #RobinDreeke #CultBeliefs #CognitiveDissonance #ChadDaybell #LoriVallow #EchoChambers Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, Justice for Harmony Montgomery, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2024-05-02T21:00:00Z",
      "duration": "00:09:46.0830000",
      "explicit": false,
      "spotifyId": "3VeuYi8Oaot58TMP6iomHV",
      "appleId": 1000654363108,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3VeuYi8Oaot58TMP6iomHV",
        "apple": "https://podcasts.apple.com/podcast/why-do-former-daybell-cult-members-still-believe-the/id1655749292?i=1000654363108"
      }
    },
    {
      "id": "e93ff498-6d70-4be6-b59b-19c5a5461854",
      "title": "Did Chad Daybell\u0027s \u0027Cult Community\u0027 Enable The Murders",
      "description": "In this episode of \u0027Hidden Killers With Tony Brueski,\u0027 psychotherapist and author Shavaun Scott delves into the complex psychological factors surrounding belief persistence and fanaticism. Discussing the case of Richard Allen in the Delphi murder trial, Shavaun explores how bizarre and inconsistent confessions, possibly influenced by psychological breakdowns in solitary confinement, challenge the credibility of his admissions. The discussion expands into the psychology of false confessions, highlighting how solitary confinement and coercive interrogation can distort reality for individuals. Shavaun stresses the importance of understanding the psychological mechanisms that cause some people to cling to disproven beliefs, despite overwhelming evidence to the contrary. She explains that confronting such individuals with direct opposition often reinforces their beliefs, suggesting that gentle questioning might be more effective in introducing doubt.\n\n **Main Points of the Conversation:**\n   - **Richard Allen\u0027s Confessions:** Analyzed the validity of Allen\u0027s confessions, noting discrepancies with actual events and suggesting they may be products of his psychological state.\n   - **Psychology of Belief:** Discussed how individuals may persist in their beliefs despite contradicting evidence, often worsening when directly challenged.\n   - **False Confessions:** Highlighted the prevalence of false confessions in the criminal justice system, particularly under coercive conditions or mental duress.\n   - **Influence of Isolation:** Explored the detrimental effects of solitary confinement on mental health, potentially leading to delusions and false admissions.\n   - **Strategies for Persuasion:** Considered approaches to help individuals reassess their beliefs, emphasizing empathy and gentle questioning over confrontation.\n   - **Community and Belief Reinforcement:** Noted how modern online platforms can reinforce extreme beliefs, creating communities that validate and escalate dangerous ideologies.\n\n#TonyBrueski #ShavaunScott #RichardAllen #DelphiMurders #FalseConfessions #PsychologyOfBelief #SolitaryConfinement\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2024-05-01T03:00:06Z",
      "duration": "00:07:14",
      "explicit": false,
      "youTubeId": "fy3jASNrrmw",
      "subjects": [
        "Chad Daybell",
        "Richard Allen"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fy3jASNrrmw"
      }
    },
    {
      "id": "32699fea-27ed-40fe-a5df-623a219125a0",
      "title": "What Does The Future Hold For Ruby Franke \u0026 Jodi Hildebrandt?",
      "description": "Is a convincing apology enough to earn early release? Could convicted child abusers Ruby Frankie and Jody Hildebrandt manipulate their way out of prison? On this episode of \u0022Hidden Killers\u0022, Tony Brueski and psychotherapist Shavaun Scott dissect the sentencing of Ruby Frankie and Jody Hildebrandt. Sentenced to four to sixty years for their horrific abuse, their ultimate fate rests in the hands of the parole board. Shavaun analyzes Ruby Frankie\u0027s courtroom statement, calling it a \u0022coached response\u0022 aimed at manipulating the system. Tony questions if parole boards are easily swayed by such performances, or if genuine remorse can be faked. The discussion then turns to Jody Hildebrandt\u0027s claim that she \u0022sincerely loved these children,\u0022 a statement Shavaun links to the narcissistic tendencies often found in cult leaders. With the possibility of release looming, the podcast delves into the chilling question of whether these women pose a continued threat to the public. Could they resurface under new identities, preying on the vulnerable once again? Closing Question: How do we protect ourselves and our communities from those who mask their monstrous behavior behind a facade of love and concern? Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, Justice for Harmony Montgomery, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2024-02-28T18:00:00Z",
      "duration": "00:07:27.4770000",
      "explicit": false,
      "spotifyId": "34ncdYjtH48vp70OuIyFEX",
      "appleId": 1000647433423,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34ncdYjtH48vp70OuIyFEX",
        "apple": "https://podcasts.apple.com/podcast/what-does-the-future-hold-for-ruby-franke-jodi-hildebrandt/id1655749292?i=1000647433423"
      }
    }
  ]
}