{
  "_ts": 0,
  "id": "00f9df9c-45e8-43a1-a13d-84e7e75c80f1",
  "name": "Hidden Killers With Tony Brueski | True Crime News \u0026 Commentary",
  "spotifyId": "6sTbMgWRC2A5EJWLrFb7eP",
  "appleId": 1655749292,
  "episodes": [
    {
      "id": "72a78b2a-81b8-4951-b4a7-cfae480892f1",
      "title": "Why Do Former Daybell \u0027Cult Members\u0027 Still Believe The Crazy Concepts Of Chad Daybell?",
      "description": "In this episode of \u0022Hidden Killers With Tony Brueski,\u0022 retired FBI Special Agent Robin Dreeke discusses the psychological effects of cult-like belief systems and their impact on individuals involved in high-profile legal cases like those of Chad Daybell and Lori Vallow. Dreeke explores how deeply ingrained beliefs and the need for belonging can affect people\u0027s perceptions and reactions when faced with the reality of their actions, especially when those actions conflict with societal norms. He elaborates on the difficulty some individuals face in reconciling their actions with their belief systems, often resulting in cognitive dissonance where they cannot accept reality even when confronted with irrefutable evidence. Key Points from the Conversation - **Cult-like Belief Systems:** Dreeke discusses how individuals involved in cults struggle to distance themselves from their beliefs even when faced with legal consequences or societal rejection. - **Cognitive Dissonance:** Members of these groups often exhibit cognitive dissonance, rationalizing their actions within their belief system despite evidence to the contrary. - **Echo Chambers:** The conversation touches on how echo chambers reinforce existing beliefs, making it difficult for individuals to accept contrary evidence. - **Social Needs and Group Belonging:** Dreeke highlights the human need to belong to groups and how this can lead people to remain in harmful situations or belief systems. - **Challenges in Changing Beliefs:** The discussion explores why it\u0027s hard for some people to change their views, even when faced with overwhelming evidence or after experiencing major life events. - **Impact on Legal Defense:** The ingrained beliefs and the public revelation of private communications can significantly undermine a legal defense, as seen in the trials of Chad Daybell and others. #HiddenKillersWithTonyBrueski #RobinDreeke #CultBeliefs #CognitiveDissonance #ChadDaybell #LoriVallow #EchoChambers Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Trial of Karen Read, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, Justice for Harmony Montgomery, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2024-05-02T21:00:00Z",
      "duration": "00:09:46.0830000",
      "explicit": false,
      "spotifyId": "3VeuYi8Oaot58TMP6iomHV",
      "appleId": 1000654363108,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3VeuYi8Oaot58TMP6iomHV",
        "apple": "https://podcasts.apple.com/podcast/why-do-former-daybell-cult-members-still-believe-the/id1655749292?i=1000654363108"
      }
    },
    {
      "id": "32699fea-27ed-40fe-a5df-623a219125a0",
      "title": "What Does The Future Hold For Ruby Franke \u0026 Jodi Hildebrandt?",
      "description": "Is a convincing apology enough to earn early release? Could convicted child abusers Ruby Frankie and Jody Hildebrandt manipulate their way out of prison? On this episode of \u0022Hidden Killers\u0022, Tony Brueski and psychotherapist Shavaun Scott dissect the sentencing of Ruby Frankie and Jody Hildebrandt. Sentenced to four to sixty years for their horrific abuse, their ultimate fate rests in the hands of the parole board. Shavaun analyzes Ruby Frankie\u0027s courtroom statement, calling it a \u0022coached response\u0022 aimed at manipulating the system. Tony questions if parole boards are easily swayed by such performances, or if genuine remorse can be faked. The discussion then turns to Jody Hildebrandt\u0027s claim that she \u0022sincerely loved these children,\u0022 a statement Shavaun links to the narcissistic tendencies often found in cult leaders. With the possibility of release looming, the podcast delves into the chilling question of whether these women pose a continued threat to the public. Could they resurface under new identities, preying on the vulnerable once again? Closing Question: How do we protect ourselves and our communities from those who mask their monstrous behavior behind a facade of love and concern? Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, Justice for Harmony Montgomery, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2024-02-28T18:00:00Z",
      "duration": "00:07:27.4770000",
      "explicit": false,
      "spotifyId": "34ncdYjtH48vp70OuIyFEX",
      "appleId": 1000647433423,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34ncdYjtH48vp70OuIyFEX",
        "apple": "https://podcasts.apple.com/podcast/what-does-the-future-hold-for-ruby-franke-jodi-hildebrandt/id1655749292?i=1000647433423"
      }
    }
  ]
}