{
  "id": "fc377abe-ee74-4131-86f6-fed75cf3e12a",
  "name": "Hidden: A True Crime Podcast",
  "spotifyId": "3mvwYdfADoV1AMz8tA4vXP",
  "appleId": 1521619380,
  "episodes": [
    {
      "id": "7b12732a-a13c-4992-8eb2-c4d3bee510a2",
      "title": "RUBY FRANKE/JODI HILDEBRANDT CASE: Hildebrandt Unmasked. Forensic psychologist Dr John Matthias shows what\u0027s Hidden",
      "description": "August 30, 2023--a brave 12-year-old boy escapes a house of torture in Southern Utah --rescuing himself and his 10-year-old sister. A neighbor feeds the emaciated boy and calls 911. The children\u0027s mother YouTube Celebrity Ruby Franke, and Ruby\u0027s therapist Jodi Hildebrandt, are arrested 250 miles north in Springville, Utah and charged with 6 counts of aggravated child abuse.TODAY WE AKS: WHY IS JODI HILDEBRANDT?  Dr John Matthias leads the discussion. Dr John is a clinical and forensic psychologist. Dr John Matthias and reporter Lauren Matthias, who are husband and wife, have been covering this story since the arrests, and will continue to bring you the very latest in this heartbreaking story that sounds all too familiar.Thank you for subscribing to our podcast and to our YouTube channelLAUREN MATTHIAS has worked as an anchor and reporter for ABC, NBC, and FOX News in East Idaho, Boise, Idaho and Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah. In 2015 she received the Idaho State Broadcaster’s Association Best Reporter award. She left the reporting world to produce the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California.Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day.Dr. Matthias has been an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program since 2007. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.Your support helps us produce these podcasts/videos. We have some big plans to explore the true crime terrain in a way that no one else has attempted.HIDDEN: A TRUE CRIME PODCAST is: CRIMINAL PSYCHOLOGY REINVENTED. Join us on a journey into the darkest recesses of the human mind and the unconscious motivations that drive human behaviors in order to understand the world and ourselves.WEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeJoin our channel to get access to perks:https://www.youtube.com/channel/UCBp03toXz-WZ6gSt7YtSdEg/joinOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-10-09T00:00:00",
      "duration": "02:01:42.1380000",
      "explicit": false,
      "spotifyId": "0L3lPTzjCJcbw7FkxNlne0",
      "appleId": 1000630738626,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0L3lPTzjCJcbw7FkxNlne0",
        "apple": "https://podcasts.apple.com/podcast/ruby-franke-jodi-hildebrandt-case-hildebrandt-unmasked/id1521619380?i=1000630738626"
      }
    },
    {
      "id": "ee7f18b2-a950-4e84-88f4-f9aa4d4a5867",
      "title": "RUBY FRANKE/JODI HILDEBRANDT CASE - ADAM STEED,  PART TWO - Boy Scout Abuse Cover-up?",
      "description": "TW: Abuse \u0026 difficult topics relating to LDS church. ADAM STEED PART 2Dr John Matthias and reporter Lauren Matthias have been covering Ruby Franke and Jodi Hildebrandt since the arrests, and will continue to bring you the very latest.We start with Adam Steed--a man who was Jodi Hildebrandt\u0027s patient back in 2007, and listen to his heart wrenching interview in two parts ...This is PART 2August 30, 2023--a brave 12-year-old boy escapes a house of torture in Southern Utah --rescuing himself and his 10-year-old sister. A neighbor feeds the emaciated boy and calls 911. The children\u0027s mother YouTube Celebrity Ruby Franke, and Ruby\u0027s therapist Jodi Hildebrandt, are arrested 250 miles north in Springville, Utah and charged with 6 counts of aggravated child abuse.To learn more about Adam Steed and his victimization from Jodi Hildebrandt: https://tinyurl.com/22kcfkpeAdam Steed v Boy Scouts of America: https://law.justia.com/cases/idaho/supreme-court-civil/2007/steed.htmlThank you for subscribing to our podcast and to our YouTube channel LAUREN MATTHIAS has worked as an anchor and reporter for ABC, NBC, and FOX News in East Idaho, Boise, Idaho and Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah. In 2015 she received the Idaho State Broadcaster’s Association Best Reporter award. She left the reporting world to produce the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California.Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day.Dr. Matthias has been an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program since 2007. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.Your support helps us produce these podcasts/videos. We have some big plans to explore the true crime terrain in a way that no one else has attempted.HIDDEN: A TRUE CRIME PODCAST is: CRIMINAL PSYCHOLOGY REINVENTED. Join us on a journey into the darkest recesses of the human mind and the unconscious motivations that drive human behaviors in order to understand the world and ourselves.WEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-09-25T00:00:00",
      "duration": "01:00:49.2800000",
      "explicit": false,
      "spotifyId": "1UFTDhCqBNp8V3kR35R0Sj",
      "appleId": 1000629014483,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1UFTDhCqBNp8V3kR35R0Sj",
        "apple": "https://podcasts.apple.com/podcast/ruby-franke-jodi-hildebrandt-case-adam-steed-part-two/id1521619380?i=1000629014483"
      }
    },
    {
      "id": "57b4e6aa-66e1-4f25-9127-619358a5579b",
      "title": "RUBY FRANKE/JODI HILDEBRANDT CASE - Victim of Jodi, ADAM STEED,  PART ONE",
      "description": "August 30, 2023--a brave 12-year-old boy escapes a house of torture in Southern Utah --rescuing himself and his 10-year-old sister. A neighbor feeds the emaciated boy and calls 911. The children\u0027s mother YouTube Celebrity Ruby Franke, and Ruby\u0027s therapist Jodi Hildebrandt, are arrested 250 miles north in Springville, Utah and charged with 6 counts of aggrevated child abuse.Dr John Matthias and reporter Lauren Matthias have been covering this story since the arrests, and will continue to bring you the very latest in this heartwrenching story that sounds all too familiar.We start with Adam Steed--a man who was Jodi Hildebrandt\u0027s patient back in 2007, and listen to his heart wrenching interview in two parts ...This is PART 1To learn more about Adam Steed and his victimization from Jodi Hildebrandt: https://tinyurl.com/22kcfkpeAdam Steed v Boy Scouts of America: https://law.justia.com/cases/idaho/supreme-court-civil/2007/steed.htmlThank you for subscribing to our podcast and to our YouTube channel    LAUREN MATTHIAS has worked as an anchor and reporter for ABC, NBC, and FOX News in East Idaho, Boise, Idaho and Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah. In 2015 she received the Idaho State Broadcaster’s Association Best Reporter award. She left the reporting world to produce the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California. Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day. Dr. Matthias has been an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program since 2007. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.Your support helps us produce these podcasts/videos. We have some big plans to explore the true crime terrain in a way that no one else has attempted.HIDDEN: A TRUE CRIME PODCAST is:  CRIMINAL PSYCHOLOGY REINVENTED. Join us on a journey into the darkest recesses of the human mind and the unconscious motivations that drive human behaviors in order to understand the world and ourselves. WEBSITE: https://hiddentruecrime.com/TO SUPPORT: https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeJoin our channel to get access to perks:https://www.youtube.com/channel/UCBp03toXz-WZ6gSt7YtSdEg/joinOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-09-20T00:00:00",
      "duration": "01:43:55.1150000",
      "explicit": false,
      "spotifyId": "2pd1c5nHd2Xqk4ghvYssM8",
      "appleId": 1000628593369,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2pd1c5nHd2Xqk4ghvYssM8",
        "apple": "https://podcasts.apple.com/podcast/ruby-franke-jodi-hildebrandt-case-victim-of-jodi/id1521619380?i=1000628593369"
      }
    },
    {
      "id": "fa85a039-0462-408d-92a6-6472c9d6e6a5",
      "title": "DUGGAR FAMILY -Shiny Happy People-Dr John takes us inside what\u0027s really going on inside the documentary",
      "description": "Hosts Dr John Matthias and Lauren Matthias take listeners inside the Shiny Happy People documentary about the Josh Duggar family, IBLP and Bill Gothard. DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California. Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day. Dr. Matthias is an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrime. #joshduggar #shinyhappypeopleOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-09-02T00:00:00",
      "duration": "01:36:21.4720000",
      "explicit": false,
      "spotifyId": "0pDX8hp4kzBQosDSkg0i4H",
      "appleId": 1000626526084,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pDX8hp4kzBQosDSkg0i4H",
        "apple": "https://podcasts.apple.com/podcast/duggar-family-shiny-happy-people-dr-john-takes-us-inside/id1521619380?i=1000626526084"
      }
    },
    {
      "id": "742e6cd8-f3d0-49ef-a7ce-f7c1d07b450f",
      "title": "BEYOND THE VEIL: AN INTERVIEW WITH  LORI VALLOW\u0027S PREPPER COUSIN BRAXTON SOUTHWICK",
      "description": "This interview with Braxton Southwick takes us deep into his beliefs and worldview as well as his cousin Lori Vallow Daybell. Braxton and Lori were close and often shared near death experience books as well as beliefs about the last days. Braxton talks with Lauren Matthias about zombies, portals, preparing, and even politics. Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and reported with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-08-26T00:00:00",
      "duration": "02:13:48.1600000",
      "explicit": false,
      "spotifyId": "3RI05vciTZYUJBifNx2VST",
      "appleId": 1000625737887,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3RI05vciTZYUJBifNx2VST",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-an-interview-with-lori-vallows/id1521619380?i=1000625737887"
      }
    },
    {
      "id": "f966dcc2-e0d1-429c-be76-1cb4f6a2ebd0",
      "title": "BEYOND THE VEIL- News Nation Correspondents Brian Entin and Alex Caprariello, along with Gigi with Pretty Lies and Alibis talks to Lauren Matthias about their experience at the Lori Vallow Daybell trial",
      "description": "Host Lauren Matthias sat each day in court during Lori Vallow Daybell\u0027s trial in Boise, Idaho sharing updates from court and appearing with Alex, Brian and Gigi for News Nation broadcasts. She worked daily with each of the guests. Brian Entin is a News Nation Senior National Correspondent. An Emmy award-winning journalist well known for his coverage of the Gabby Petito case, and now the tragedy in Moscow, Idaho. Entin most recently worked as a reporter for WSVN in Miami. Brian covered several major hurricanes, and spent much of the first 100 days of the Trump presidency in Washington, DC. He has won Emmy Awards for his coverage of the aftermath of the Fuego Volcano eruption in Guatemala and his coverage of the death of Cuban dictator Fidel Castro.In 2018, Brian extensively covered the Parkland school shooting and was the first reporter to obtain video of the shooter attacking deputies in jail. He also was the first reporter with video of Charles Kinsey — an unarmed man with his hands in the air — shot by police in North Miami.Prior to working in Miami, Brian was a reporter at WPTV in West Palm Beach, WTOC in Savannah, and KTVO in Kirksville, Missouri.He graduated from the University of Missouri.FOLLOW BRIAN HERE: https://twitter.com/brianentinALEX CAPRARIELLO is a News Nation Morning in America’s West Coast Correspondent.Morning in America airs weekdays from 7ET to 10 ET. Born in Raleigh, North Carolina, Caprariello has also lived in Princeton, New Jersey, Madison, Wisconsin, Phoenix, Arizona, Fayetteville, Arkansas and most recently Austin, Texas.Caprariello earned his bachelor’s degree from the W.P. Carey School of Business at Arizona State University in 2013. He later received his master’s degree in Journalism from ASU’s Walter Cronkite School of Journalism and Mass Communication in 2016.Caprariello joined News Nation after beginning his career at KNWA/KFTA in Fayetteville, Arkansas. He was the weekend anchor and senior reporter at the NBC/Fox affiliate located in Northwest Arkansas. Known for his in-depth reporting, Caprariello began working at investigative powerhouse KXAN in Austin in 2018. As the station’s lead education reporter, he quickly established credibility within the community through accurate and dependable reporting on K-12 issues during the pandemic.Caprariello won numerous awards while in Austin, including a Lone Star Emmy for his two-part investigative series, Racism at Westlake. The investigation uncovered years of alleged racism within the halls of a dominant academic and athletic high school in the Texas suburbs. Caprariello was also honored with awards from the Texas State Teachers Association, the Association of Texas Professional Educators and the Society of Professional Journalists.While in Arkansas, Caprariello initiated a number of notable reports including an analysis of the state’s struggle to launch the medical marijuana industry, an examination into allegations of bribery in a tightly-contested mayoral race and an investigation which uncovered repeated abuse of patients in a treatment center for deviant children.His special report, “Pricing Parenthood: The Cost of In Vitro Fertilization,” which details the financial burdens infertile families experience when undergoing last-resort procedures, was a finalist for best television feature by the Society of Professional Journalists Diamond Journalism Awards. FOLLOW ALEX HERE: https://twitter.com/alcaprari23GIGI is the host of the podcast “Pretty Lies and Alibis” and covered the trial as a Law and Crime correspondent and also appeared on News Nation.Listen HERE: https://podcasts.apple.com/us/podcast/pretty-lies-alibis/id1519114534LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho and Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist. Follow her on FACEBOOK: https://facebook.com/hiddentruecrime or on TWITTER: https://twitter.com/hiddentruecrimeContact at: HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-08-16T00:00:00",
      "duration": "01:07:06.9320000",
      "explicit": false,
      "spotifyId": "4vAows7BzxlJ5UksoP3hEz",
      "appleId": 1000624706613,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vAows7BzxlJ5UksoP3hEz",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-news-nation-correspondents-brian/id1521619380?i=1000624706613"
      }
    },
    {
      "id": "d2275941-f7d4-4213-a905-d4595a512b28",
      "title": "BEYOND THE VEIL: INTERVIEW WITH LARRY AND KAY WOODCOCK THE DAY BEFORE LORI VALLOW IS SENTENCED",
      "description": "This interview with Larry and Kay Woodcock and Dr John Matthias took place on July 30, 2023, the day before Lori Vallow Daybell was sentenced in Rexburg, Idaho.Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California. Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day. Dr. Matthias has been an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program since 2007. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and reported with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-08-11T00:00:00",
      "duration": "00:30:11.0430000",
      "explicit": false,
      "spotifyId": "2Yc6y0UhVn9p4PQ6BmgOHU",
      "appleId": 1000624108473,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Yc6y0UhVn9p4PQ6BmgOHU",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-interview-with-larry-and-kay/id1521619380?i=1000624108473"
      }
    },
    {
      "id": "64ad988e-d94c-48de-97f9-7451b5494801",
      "title": "BEYOND THE VEIL -JUROR FROM LORI VALLOW DAYBELL TRIAL BREAKS SILENCE AFTER SENTENCING - MINI EPISODE",
      "description": "Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.Host Lauren Matthias sat each day in court during Lori Vallow Daybell\u0027s trial in Boise, Idaho and is in Rexburg during the sentencing. You can get caught up by listening to our full \u0027Beyond the Veil\u0022 season.as well as our numerous interviews like this one.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and reported with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-08-09T00:00:00",
      "duration": "00:11:57.4790000",
      "explicit": false,
      "spotifyId": "03S5titDK8cDipkIYHda9b",
      "appleId": 1000623963636,
      "urls": {
        "spotify": "https://open.spotify.com/episode/03S5titDK8cDipkIYHda9b",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-juror-from-lori-vallow-daybell-trial/id1521619380?i=1000623963636"
      }
    },
    {
      "id": "f868485a-dfbe-4731-8b78-70b06f0304cb",
      "title": "BEYOND THE VEIL: LORI VALLOW DAYBELL\u0027S COUSIN MEGAN CONNER MAKES STATEMENT AFTER LORI\u0027S SENTENCING",
      "description": "Megan Conner, Lori Vallow Daybell\u0027s cousin, took the day off of work to watch and process the sentencing. she shares her feelings and a statement she wrote after hearing her cousin testify in court. Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.Host Lauren Matthias sat each day in court during Lori Vallow Daybell\u0027s trial in Boise, Idaho and is in Rexburg during the sentencing. You can get caught up by listeningto our full \u0027Beyond the Veil\u0022 season.as well as our numerous interviews like this one.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and reported with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-08-08T00:00:00",
      "duration": "00:45:36.6660000",
      "explicit": false,
      "spotifyId": "5vt2RNDdE74AmaLhD37XuD",
      "appleId": 1000623828409,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5vt2RNDdE74AmaLhD37XuD",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-lori-vallow-daybells-cousin-megan/id1521619380?i=1000623828409"
      }
    },
    {
      "id": "9f13df54-c068-48f5-90f0-4c9e6d0de645",
      "title": "BEYOND THE VEIL: THE FULL SENTENCING OF LORI VALLOW DAYBELL",
      "description": "July 31, 2023 - Fremont County Courthouse. Lori Vallow Daybell is sentenced by Judge Boyce for murdering of her two children--16-year-old Tylee Ryan and 7-year-old JJ Vallow. She is sentenced for conspiring to kill 49-year-old Tammy Daybell, as well as two counts of insurance fraud, and one count of grand theft.Watch Dr John Matthias, Psychologists analysis of sentencing HEREOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-08-06T00:00:00",
      "duration": "02:41:07.4480000",
      "explicit": false,
      "spotifyId": "4n4CBhNR377WgNrPk5hp6b",
      "appleId": 1000623612789,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4n4CBhNR377WgNrPk5hp6b",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-full-sentencing-of-lori-vallow-daybell/id1521619380?i=1000623612789"
      }
    },
    {
      "id": "79788d26-29eb-4917-ad85-1436bdbc6e6b",
      "title": "BEYOND THE VEIL: Colby Ryan\u0027s Jailhouse call and David Warwick\u0027s testimony",
      "description": "Lori Vallow Daybell will be sentenced on July 31st, 2023 and Lauren is traveling to attend. HTC will livestream the sentencing on their YouTube channel http://YouTube.com/HiddenTrueCrime so make sure to subscribe. Lauren attended each day of Lori\u0027s trial, and was there when she was convicted of murdering her two children.While we prep for her sentencing, we\u0027ve decided to share some never before recordings we made during Lori Vallow Daybell\u0027s trial, this one taking place three weeks into the trial, after her son Colby Ryan testified.A forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.While Lauren attended Lori\u0027s trial and plans to attend her sentencing in July of 2023, the hosts continue interviewing and investigating what\u0027s Hidden, just as they have been for three years. You can get caught up by listening to our full \u0027Beyond the Veil\u0022 season.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California. Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day. Dr. Matthias is an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrime.Our Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-07-28T00:00:00",
      "duration": "01:19:06.6050000",
      "explicit": false,
      "spotifyId": "01SGwXtOl20y9SbqxZybNW",
      "appleId": 1000622627608,
      "urls": {
        "spotify": "https://open.spotify.com/episode/01SGwXtOl20y9SbqxZybNW",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-colby-ryans-jailhouse-call-and/id1521619380?i=1000622627608"
      }
    },
    {
      "id": "52c24ee3-0247-4100-9a8e-58937e9bbdd9",
      "title": "BEYOND THE VEIL: Interview with Tammy Daybell\u0027s Aunt Vicki Hoban",
      "description": "Lori Vallow Daybell has been convicted of conspiracy in the death of Tamara Douglas Daybell. Vicki Hoban, Tammy Daybell\u0027s aunt, is preparing to give a victim impact statement at Vallow Daybell\u0027s sentencing on July 31, 2023 but first she speaks to Hidden True Crime\u0027s Lauren Matthias to share more about Tammy and what her family has suffered due to Vallow Daybell\u0027s crimes. HIDDEN TRUE CRIME: A forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.While Lauren attended Lori\u0027s trial and plans to attend her sentencing in July of 2023, the hosts continue interviewing and investigating what\u0027s Hidden, just as they have been for three years. You can get caught up by listening to our full \u0027Beyond the Veil\u0022 season.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrime.DISCLAIMER: The views of our guests/interviewees, do not reflect the views of Hidden True Crime.Our Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-07-21T00:00:00",
      "duration": "00:52:24.8550000",
      "explicit": false,
      "spotifyId": "59mhRe8eiE7wGegIdk1GJ8",
      "appleId": 1000621915993,
      "urls": {
        "spotify": "https://open.spotify.com/episode/59mhRe8eiE7wGegIdk1GJ8",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-interview-with-tammy-daybells-aunt/id1521619380?i=1000621915993"
      }
    },
    {
      "id": "dbe8a8ff-1f3e-41de-8cff-8598bc86a5d5",
      "title": "BEYOND THE VEIL: The Secrets of Lori Vallow Daybell, PART 2",
      "description": "Lori Vallow Daybell has been convicted of murdering her two children, but right before her trial began in April, Hidden hosts John and Lauren Matthias sat down to ask the question many have been wondering: Did Lori change before she commited her crimes, or is this who Lori Vallow has always been? This is PART TWO of a TWO PART Episode exploring Lori Vallow Daybell\u0027s mind.A forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.While Lauren attended Lori\u0027s trial and plans to attend her sentencing in July of 2023, the hosts continue interviewing and investigating what\u0027s Hidden, just as they have been for three years. You can get caught up by listening to our full \u0027Beyond the Veil\u0022 season.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California. Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day. Dr. Matthias is an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrime.DISCLAIMER: The views of our guests/interviewees, do not reflect the views of Hidden True Crime.Our Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-07-08T00:00:00",
      "duration": "01:35:39.1540000",
      "explicit": false,
      "spotifyId": "42jBu9qVfUGQSaNVBnqcQL",
      "appleId": 1000620170235,
      "urls": {
        "spotify": "https://open.spotify.com/episode/42jBu9qVfUGQSaNVBnqcQL",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-secrets-of-lori-vallow-daybell-part-2/id1521619380?i=1000620170235"
      }
    },
    {
      "id": "89602143-31df-48cd-b301-028a06e52777",
      "title": "BEYOND THE VEIL: The Secrets of Lori Vallow Daybell, PART 1",
      "description": "Lori Vallow Daybell has been convicted of murdering her two children, but right before her trial began in April, Hidden hosts John and Lauren Matthias sat down to ask the question many have been wondering: Did Lori change before she commited her crimes, or is this who Lori Vallow has always been? This is PART 1 of a TWO PART Episode exploring Lori Vallow Daybell\u0027s mind.A forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.While Lauren attended Lori\u0027s trial and plans to attend her sentencing in July of 2023, the hosts continue interviewing and investigating what\u0027s Hidden, just as they have been for three years. You can get caught up by listening to our full \u0027Beyond the Veil\u0022 season.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California. Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day. Dr. Matthias is an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrime.DISCLAIMER: The views of our guests/interviewees, do not reflect the views of Hidden True Crime.Our Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-07-05T00:00:00",
      "duration": "01:02:14.4910000",
      "explicit": false,
      "spotifyId": "6k1BFJ0PwXhRKFABsXzqx8",
      "appleId": 1000619421407,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6k1BFJ0PwXhRKFABsXzqx8",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-secrets-of-lori-vallow-daybell-part-1/id1521619380?i=1000619421407"
      }
    },
    {
      "id": "1fa896be-b7fe-4932-b9cb-655ba1461e48",
      "title": "BEYOND THE VEIL: Interview with Lori Vallow Daybell\u0027s Brother and Uncle- Adam Cox and Rex Conner",
      "description": "Lori Vallow Daybell has been convicted of murdering her two children. Her brother Adam Cox and her Uncle Rex Cox sit down with hosts John and Lauren Matthias to discuss the crimes that have rocked their family.A forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.While Lauren attended Lori\u0027s trial and plans to attend her sentencing in July of 2023, the hosts continue interviewing and investigating what\u0027s Hidden, just as they have been for three years. You can get caught up by listening to our full \u0027Beyond the Veil\u0022 season.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California. Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day. Dr. Matthias is an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrime.DISCLAIMER: The views of our guests/interviewees, do not reflect the views of Hidden True Crime.Our Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-30T00:00:00",
      "duration": "01:25:22.8730000",
      "explicit": false,
      "spotifyId": "2z21Lb4BJ1scZ7o9gTyuvM",
      "appleId": 1000618915344,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2z21Lb4BJ1scZ7o9gTyuvM",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-interview-with-lori-vallow/id1521619380?i=1000618915344"
      }
    },
    {
      "id": "2e37c2a0-1e84-422e-b4a3-df6253ffe73e",
      "title": "JOSH DUGGAR VERDICT- IBLP,  BILL GOTHARD and INSIGHTS INTO SHINY HAPPY PEOPLE",
      "description": "With the documentary #ShinyhappyPeople making waves, Hidden True Crime revisits this podcast with Lauren Matthias and guest Shellie G. Shelli once attended a church that used IBLP’s materials and teachings. Our discussion takes us through #JoshDuggar’s guilty verdict and into discussions about Bill Gothard, Anna Duggar, women in the church, and childhood abuse.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho and Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and a continuing guest with News Nation. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-07T00:00:00",
      "duration": "00:56:35.0560000",
      "explicit": false,
      "spotifyId": "7c8jJ5w1rx8FW0YPNJeJNy",
      "appleId": 1000615943086,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7c8jJ5w1rx8FW0YPNJeJNy",
        "apple": "https://podcasts.apple.com/podcast/josh-duggar-verdict-iblp-bill-gothard-and-insights/id1521619380?i=1000615943086"
      }
    },
    {
      "id": "6b449296-c4dc-4889-90e6-6b1fa54bad80",
      "title": "BEYOND THE VEIL: An Interview with Sharie Dowdle (Her story behind her secret recording with Melanie Gibb)",
      "description": "Who is Sharie? Most know her as the voice gasping in shock during a recorded phone call with Melanie Gibb in 2020. Melanie Gibb was Lori Vallow\u0027s best friend and testified at her ex-friend\u0027s 2023 trial.Why did Sharie Dowdle record Melanie Gibb? How does she know Melanie? How was Sharie involved, and how did this recording get released? Hopefully this interview from June, 2021 will help to answer those your questions.Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.While they\u0027ve uncovered what\u0027s hidden for three a half years, ever before have they put a backstory together like this--allowing it\u0027s listeners to understand the full context of episodes and interveiws--those published and unpublished.While host Lauren Matthias sits each day in court during Lori Vallow Daybell\u0027s trial in Boise, Idaho and sharing updates from court, you can get caught up by listening here, and listening to our full \u0027Beyond the Veil\u0022 season.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrime.DISCLAIMER: The views of our guests/interviewees, do not reflect the views of Hidden True Crime.Our Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-05-23T00:00:00",
      "duration": "01:10:29.9030000",
      "explicit": false,
      "spotifyId": "6zl2TLienY4IMPN7REQ9lG",
      "appleId": 1000614101317,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6zl2TLienY4IMPN7REQ9lG",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-an-interview-with-sharie-dowdle/id1521619380?i=1000614101317"
      }
    },
    {
      "id": "78630f3d-af9f-408e-925c-838cc2097677",
      "title": "INTERVIEW: LOR VALLOW DAYBELL\u0027S COUSIN - MEGAN CONNER - shares Bombshell info about growing up with Lori Cox",
      "description": "Megan Conner shares about growing up with Lori Cox Vallow Daybell and the family system surrounding the mother who is currently on trial for murdering her two children. Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.While host Lauren Matthias sits each day in court during Lori Vallow Daybell\u0027s trial in Boise, Idaho and sharing updates from court, you can get caught up by listening and listening to our full \u0027Beyond the Veil\u0022 season.as well as our numerous interviews like this one.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has been reporting with News Nation throughout the trial. She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-05-09T00:00:00",
      "duration": "02:02:13.7200000",
      "explicit": false,
      "spotifyId": "3MD56gkIMUxjhxcwn9agBF",
      "appleId": 1000612588349,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3MD56gkIMUxjhxcwn9agBF",
        "apple": "https://podcasts.apple.com/podcast/interview-lor-vallow-daybells-cousin-megan-conner-shares/id1521619380?i=1000612588349"
      }
    },
    {
      "id": "176bfed5-99c3-46f0-83a3-e4d3402c4680",
      "title": "BEYOND THE VEIL: THE PREQUEL - Chad Daybell and Lori Vallow - The background story you\u0027ve never heard",
      "description": "Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.While they\u0027ve uncovered what\u0027s hidden for three a half years, ever before have they put a backstory together like this--allowing it\u0027s listeners to understand the full context of episodes and interveiws--those published and unpublished. While host Lauren Matthias sits each day in court during Lori Vallow Daybell\u0027s trial in Boise, Idaho and sharing updates from court, you can get caught up by listening here, and listening to our full \u0027Beyond the Veil\u0022 season. LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes and criminals to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah and in 2015 she received the Idaho State Broadcaster’s Association Best Reporter award and has  been reporting with News Nation throughout the trial.  She is the producer and editor of the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.Contact them at HiddenTrueCrimeInfo@gmail.comWEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-05-02T00:00:00",
      "duration": "00:54:18.0700000",
      "explicit": false,
      "spotifyId": "1LS5HjfXPhMXg6J9nAiN4U",
      "appleId": 1000611512151,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1LS5HjfXPhMXg6J9nAiN4U",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-prequel-chad-daybell-and/id1521619380?i=1000611512151"
      }
    },
    {
      "id": "b9ca79d2-e7bd-47f0-b861-7b4a9f4bd2b6",
      "title": "BEYOND THE VEIL: Remembering 7-year-old JJ - An Interview with the Woodcocks",
      "description": "Our original Beyond the Veil season continues as a forensic psychologist and journalist (who are husband and wife) explore the inner workings of Chad Daybell and Lori Vallow Daybell\u0027s minds, as well as the hidden motivations driving a series of inexplicable murders in 2019.Kay and Larry Woodcock --the biological grandparents of one of the victims 7-year-old JJ Vallow--join John and Lauren Matthias at their dinner table for an intimate conversation about love and grief.Next week Lori Vallow Daybell\u0027s trial begins in Boise, Idaho, and Hidden True Crime will be there every step of the way. To get caught up--please listen to our original \u0027Beyond the Veil\u0022 season, or watch the Netflix documentary \u0022Sins of our Mother\u0022 featuring our host Doctor John Matthias.DR. JOHN MATTHIAS is a licensed clinical and forensic psychologist with 30 years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He received his Master’s degree in Marriage, Family and Child counseling, as well his doctorate degree, from the University of Southern California.Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day.Dr. Matthias has been an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program since 2007. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.LAUREN MATTHIAS worked as an anchor and reporter for ABC, NBC, and FOX News in Boise, Idaho Salt Lake City, Utah. She spent a decade reporting on a diverse range of topics from high profile crimes to Presidential visits. Most recently, she reported for Salt Lake City’s ABC affiliate News4Utah. In 2015 she received the Idaho State Broadcaster’s Association Best Reporter award. She left the reporting world to produce the Hidden True Crime Podcast along with her husband Dr. John Matthias, a forensic psychologist.HIDDEN: A TRUE CRIME PODCAST is: CRIMINAL PSYCHOLOGY REINVENTED. Join us on a journey into the darkest recesses of the human mind and the unconscious motivations that drive human behaviors in order to understand the world and ourselves.WEBSITE: https://hiddentruecrime.com/TO SUPPORT:https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-03-31T00:00:00",
      "duration": "00:26:27.6440000",
      "explicit": false,
      "spotifyId": "6mIjvdDKO1OkjMDyLIauHW",
      "appleId": 1000606819702,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6mIjvdDKO1OkjMDyLIauHW",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-remembering-7-year-old-jj-an/id1521619380?i=1000606819702"
      }
    },
    {
      "id": "bd3061a7-b371-4a25-8432-c96b8c847b76",
      "title": "Beyond the Veil: Interview with Netflix \u0027Sins of our Mother\u0027 Director Skye Borgman",
      "description": "Dr. John Matthias appears in the Netflix Documentary \u0022Sins of Our Mother\u0022 and today we talk to our friend, Director Skye Borgman about the recent documentary that is already making waves on Netflix. We also talk about the recent arrest of Colby Ryan. (Colby\u0027s charges have been dismissed.)You can also watch this interview, and see some of the visuals discussed here: https://www.youtube.com/watch?v=s4Q3i4ocu_ITo see Dr. John\u0027s other insight on the case, head to our Podcast playlist. To see our other interviews about the Daybell case, head to our Interview playlist on YouTube.TO DONATE, PLUS BONUS CONTENT AND EPISODES):https://www.patreon.com/hiddentruecrimeDONATE:https://www.paypal.me/hiddentruecrimeWith your generosity, let\u0027s see how far we can go together to reinvent the true crime genre. Your support helps us produce these podcasts/videos. We have some big plans to explore the true crime terrain in a way that no one else has attempted.Dr. John Matthias is a licensed clinical and forensic psychologist with over twenty-five years’ experience in both clinical and forensic work. He serves as an expert witness for the federal government and he has consulted on numerous high-profile cases for District Attorney’s offices and defense attorneys in several states.In the forensic area, Dr. Matthias has developed expertise in personality assessments, hidden behavioral motivations, complex trauma and criminal psychology. In the clinical realm, he has worked with numerous victims. He also received his Master’s degree in Marriage, Family and Child counseling from the University of Southern California and he has worked with hundreds of families, couples and children over the years. He supervises UNLV doctoral students on forensic assessments, clinical case formulation, and various therapeutic approaches to clinical work.Dr. Matthias graduated with honors in philosophy from Princeton University, and he won the prestigious McCosh Thesis prize while there. In high school he graduated valedictorian from a large public high school in Chicago where he was chosen to participate in a ground-breaking valedictory study that continues to this day. He received his doctorate from the University of Southern California.Dr. Matthias has been an adjunct assistant professor in the University of Nevada Las Vegas clinical psychology doctoral program since 2007 and he has trained over 25 doctoral students since that time.Advertising Inquiries: HiddenTrueCrime@gmail.com https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-12-06T00:00:00",
      "duration": "00:59:28.7440000",
      "explicit": false,
      "spotifyId": "1z8h8Dare0MW3YuAZmt0Ry",
      "appleId": 1000589100142,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1z8h8Dare0MW3YuAZmt0Ry",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-interview-with-netflix-sins-of/id1521619380?i=1000589100142"
      }
    },
    {
      "id": "f223d994-ea52-474f-ac43-dcd03a441c3d",
      "title": "BEYOND THE VEIL EXCLUSIVE: Heather Daybell, Chad Daybell\u0027s \u0022Dark\u0022 Sister-in-Law, Breaks Her Silence (PART THREE)",
      "description": "Welcome to our dinner table. HIDDEN: A TRUE CRIME PODCAST is: CRIMINAL PSYCHOLOGY REINVENTED. Join us on a journey into the darkest recesses of the human mind and the unconscious motivations that drive human behaviors in order to understand the world and ourselves. Subscribe to our YouTube, @Hidden True Crime, for additional insider interviews and an in depth psychological podcast covering the Chad Daybell case. This is the first episode of a three-part tell-all interview you will not want to miss. In our opinion--the most detailed interview to date. Heather Daybell is Chad Daybell\u0027s \u0022dark\u0022 sister-in-law. She sat down with Lauren and John Matthias at their dinner table for 5 hours, and shared her experience. Watch Part Three of Heather Daybell\u0027s Interview here: https://www.youtube.com/watch?v=KTAN4caCGMc\u0026t=126sChad Daybell is behind bars along with his wife Lori Vallow Daybell. They are the subjects of the Netflix Documentary \u0022Sins of Our Mother\u0022 that our host Dr. John Matthias was featured. We\u0027ve also been featured on Dateline\u0027s covering of this case. Chad and Lori are charged with murdering their spouses, and Lori\u0027s two children--Tylee Ryan and JJ Vallow. They await trial in 2023.Each night this weekend at 6 pm pacific we will premiere an episode of Heather\u0027s interview. Episode 1- Friday, Saturday, and Sunday at 6 pm pacific (7 MST, 8 Central, 9 Eastern). WEBSITE: https://hiddentruecrime.com/INTERESTED IN ADVERTISING?: https://hiddentruecrime.com/TO SUPPORT: https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeAdvertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-12-03T00:00:00",
      "duration": "01:21:49.7660000",
      "explicit": false,
      "spotifyId": "4LnTOCAiRrMsGbthOQ8iuF",
      "appleId": 1000588583095,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LnTOCAiRrMsGbthOQ8iuF",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-exclusive-heather-daybell-chad/id1521619380?i=1000588583095"
      }
    },
    {
      "id": "25981258-6d8d-4acb-aa6d-b21bc693bedd",
      "title": "BEYOND THE VEIL EXCLUSIVE: Heather Daybell, Chad Daybell\u0027s \u0022Dark\u0022 Sister-in-Law, Breaks Her Silence (PART TWO)",
      "description": "Welcome to our dinner table. HIDDEN: A TRUE CRIME PODCAST is: CRIMINAL PSYCHOLOGY REINVENTED. Join us on a journey into the darkest recesses of the human mind and the unconscious motivations that drive human behaviors in order to understand the world and ourselves. Subscribe to our YouTube, @Hidden True Crime, for additional insider interviews and an in depth psychological podcast covering the Chad Daybell case. This is the first episode of a three-part tell-all interview you will not want to miss. In our opinion--the most detailed interview to date. Heather Daybell is Chad Daybell\u0027s \u0022dark\u0022 sister-in-law. She sat down with Lauren and John Matthias at their dinner table for 5 hours, and shared her experience. Watch Part Two of Heather Daybell\u0027s Interview here: https://www.youtube.com/watch?v=z0iMs019-Q4Chad Daybell is behind bars along with his wife Lori Vallow Daybell. They are the subjects of the Netflix Documentary \u0022Sins of Our Mother\u0022 that our host Dr. John Matthias was featured. We\u0027ve also been featured on Dateline\u0027s covering of this case. Chad and Lori are charged with murdering their spouses, and Lori\u0027s two children--Tylee Ryan and JJ Vallow. They await trial in 2023.Each night this weekend at 6 pm pacific we will premiere an episode of Heather\u0027s interview. Episode 1- Friday, Saturday, and Sunday at 6 pm pacific (7 MST, 8 Central, 9 Eastern). WEBSITE: https://hiddentruecrime.com/INTERESTED IN ADVERTISING?: https://hiddentruecrime.com/TO SUPPORT: https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeAdvertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-11-30T00:00:00",
      "duration": "01:26:09.7370000",
      "explicit": false,
      "spotifyId": "2onfL85L95eIzXo5jDCscI",
      "appleId": 1000588210030,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2onfL85L95eIzXo5jDCscI",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-exclusive-heather-daybell-chad/id1521619380?i=1000588210030"
      }
    },
    {
      "id": "64a6d461-89d9-4fdd-bd2e-2784699cd7e8",
      "title": "BEYOND THE VEIL EXCLUSIVE: Heather Daybell, Chad Daybell\u0027s \u0022Dark\u0022 Sister-in-Law, Breaks Her Silence (PART ONE)",
      "description": "Welcome to our dinner table. HIDDEN: A TRUE CRIME PODCAST is: CRIMINAL PSYCHOLOGY REINVENTED. Join us on a journey into the darkest recesses of the human mind and the unconscious motivations that drive human behaviors in order to understand the world and ourselves. Subscribe to our YouTube, @Hidden True Crime, for additional insider interviews and an in depth psychological podcast covering the Chad Daybell case. This is the first episode of a three-part tell-all interview you will not want to miss. In our opinion--the most detailed interview to date. Heather Daybell is Chad Daybell\u0027s \u0022dark\u0022 sister-in-law. She sat down with Lauren and John Matthias at their dinner table for 5 hours, and shared her experience. Watch Part One of Heather Daybell\u0027s Interview here: https://www.youtube.com/watch?v=DoiFM...Chad Daybell is behind bars along with his wife Lori Vallow Daybell. They are the subjects of the Netflix Documentary \u0022Sins of Our Mother\u0022 that our host Dr. John Matthias was featured. We\u0027ve also been featured on Dateline\u0027s covering of this case. Chad and Lori are charged with murdering their spouses, and Lori\u0027s two children--Tylee Ryan and JJ Vallow. They await trial in 2023.Each night this weekend at 6 pm pacific we will premiere an episode of Heather\u0027s interview. Episode 1- Friday, Saturday, and Sunday at 6 pm pacific (7 MST, 8 Central, 9 Eastern). WEBSITE: https://hiddentruecrime.com/INTERESTED IN ADVERTISING?: https://hiddentruecrime.com/TO SUPPORT: https://www.patreon.com/hiddentruecrimehttps://paypal.me/hiddentruecrimehttps://cash.app/$hiddenTruecrimeAdvertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-11-28T00:00:00",
      "duration": "02:01:00.8130000",
      "explicit": false,
      "spotifyId": "6uJzFSFunzEPZxfF7gv4hT",
      "appleId": 1000587830357,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6uJzFSFunzEPZxfF7gv4hT",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-exclusive-heather-daybell-chad/id1521619380?i=1000587830357"
      }
    },
    {
      "id": "76a24dd0-9e66-415a-ae78-cd0d759db543",
      "title": "Beyond the Veil: When Lori Met Chad and the Dream of Immortal Love Part II",
      "description": "Tonight, we continue our dinner conversation about the power of love in human behavior, beliefs, and, quite possibly, as a primary motivation for murder. Join us as we continue to untangle Lori’s quest for ideal love and its repercussions for her extreme behaviors.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2021-03-26T00:00:00",
      "duration": "01:33:18.1180000",
      "explicit": false,
      "spotifyId": "0sohbT9noaRnoKnujDiKHt",
      "appleId": 1000514531490,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0sohbT9noaRnoKnujDiKHt",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-when-lori-met-chad-and-the/id1521619380?i=1000514531490"
      }
    },
    {
      "id": "1f09de2f-3963-4299-a279-152b898d2f0d",
      "title": "Beyond the Veil: When Lori Met Chad and the Dream of Immortal Love Part I",
      "description": "Join us for an in-depth dinner conversation about belief formation and the desire for ideal love. We dig as deep as we can into Lori Vallow Daybell’s psyche and start to put all of the pieces together to develop a comprehensive psychological portrait of how and why these murders occurred. Tonight, we explore Lori’s role in these tragic events through an examination of Lori’s yearning for other-worldly love as a panacea for all her worldly pain and suffering.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2021-02-20T00:00:00",
      "duration": "01:25:45.0690000",
      "explicit": false,
      "spotifyId": "2uFt1O51jSFsCLF6UKgvox",
      "appleId": 1000509989517,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2uFt1O51jSFsCLF6UKgvox",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-when-lori-met-chad-and-the/id1521619380?i=1000509989517"
      }
    },
    {
      "id": "a4ec106d-909e-4f44-9931-afe87d1cd731",
      "title": "Beyond the Veil: When Chad Met Lori and the Dream of Immortality",
      "description": "Join us for an in-depth dinner conversation about death anxiety, terror management theory and Chad’s desire to achieve immortality. We dig as deep as we can into Chad Daybell’s psyche and start to put all of the pieces together to develop a comprehensive psychological portrait of how and why these murders occurred. When Chad met Lori a seemingly inescapable cascade of events and psychological elements began to unfold that ended in multiple murders. Join us to discover why.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-11-20T00:00:00",
      "duration": "01:14:59.8400000",
      "explicit": false,
      "spotifyId": "16efHnBD1knEawilFshfZQ",
      "appleId": 1000499512055,
      "urls": {
        "spotify": "https://open.spotify.com/episode/16efHnBD1knEawilFshfZQ",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-when-chad-met-lori-and/id1521619380?i=1000499512055"
      }
    },
    {
      "id": "61d92c99-37a1-4902-b216-8b42ecd12abf",
      "title": "Beyond the Veil: Revisiting Chad and a Tribute to Tammy Daybell",
      "description": "Tonight, we revisit Chad’s role in the murders through a close examination of his family upbringing, books and career choices based upon new information since our first episodes. We lay the foundation for the combustible moment when Chad and Lori meet and nothing can deter them from their murderous mission. Lauren concludes dinner with a personal tribute to Tammy Daybell. Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-10-27T00:00:00",
      "duration": "01:01:39.7130000",
      "explicit": false,
      "spotifyId": "7ww7P5MYRAc8D9Ov8eMD0M",
      "appleId": 1000496221752,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7ww7P5MYRAc8D9Ov8eMD0M",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-revisiting-chad-and-a-tribute/id1521619380?i=1000496221752"
      }
    },
    {
      "id": "ac606f07-46ff-4928-9444-6536ed3d9973",
      "title": "Beyond the Veil: The Fearlessness and Filicide of Lori Vallow Daybell",
      "description": "We get closer to answering the big questions at dinner tonight- Why do human beings murder? Why did Lori really kill her children? We examine the research on filicide and psychopathy to provide some insight into these thorny questions in addition to bringing in a famous child murderer from the past, Diane Downs, to assist in our analysis. Before finishing dinner, we explore the roles of courage and fearlessness in homicide. What does fearlessness have to do with murder? And what does real courage look like and how can we attain it?Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-10-07T00:00:00",
      "duration": "01:10:03.2660000",
      "explicit": false,
      "spotifyId": "31iwaeu2Cj2YuAZPFGi1WZ",
      "appleId": 1000493991671,
      "urls": {
        "spotify": "https://open.spotify.com/episode/31iwaeu2Cj2YuAZPFGi1WZ",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-fearlessness-and-filicide/id1521619380?i=1000493991671"
      }
    },
    {
      "id": "2a81b628-fd51-4432-87a2-9aa8d40eb583",
      "title": "Beyond the Veil: The Many Extremes of Lori Vallow Daybell Part II",
      "description": "In this second half of dinner we explore the relationship between borderline personality disorder and violence potential. We also make the connection between Lori’s extremism and research on terrorists and terrorism. Is Lori a terrorist? Is Chad a terrorist? What makes a terrorist? We conclude our lengthy two-week dinner with a tribute to the many victims of crime and the emotional impact of delving deeply into crime.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-09-23T00:00:00",
      "duration": "00:52:31.4840000",
      "explicit": false,
      "spotifyId": "2zue0qZ7YaEs8ib3g5ayEH",
      "appleId": 1000492305586,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2zue0qZ7YaEs8ib3g5ayEH",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-many-extremes-of-lori/id1521619380?i=1000492305586"
      }
    },
    {
      "id": "3dda09ae-d08e-4926-baf1-c79c463b349e",
      "title": "Beyond the Veil: The Many Extremes of Lori Vallow Daybell Part I",
      "description": "We pick up where we left off in the last episode with the impact of Lori’s family upbringing upon her personality dynamics and life decisions, exploring Lori’s propensity for the extremes in emotions, behaviors and beliefs. We ask: Does Lori have a personality disorder? Was she sexually abused? Is she a borderline personality disorder? Have her past traumas and family wounds contributed to her decision to murder her children? Join us for dinner tonight to find out.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-09-10T00:00:00",
      "duration": "00:49:11.3980000",
      "explicit": false,
      "spotifyId": "5StG4GxuImv2GJKKmMMYM3",
      "appleId": 1000490780598,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5StG4GxuImv2GJKKmMMYM3",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-many-extremes-of-lori/id1521619380?i=1000490780598"
      }
    },
    {
      "id": "769d12f7-921e-4a51-b9de-1ec4c4b49457",
      "title": "Beyond the Veil: The Making of Lori Vallow Daybell",
      "description": "In this episode we begin to disentangle the twisted web that is Lori Vallow Daybell through a close examination of her family upbringing and dynamics. We explore the Cox family system (Lori’s family of origin) through the story of Narcissus and explain how this classic mythological tale still holds sway today.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-08-30T00:00:00",
      "duration": "01:02:38.3920000",
      "explicit": false,
      "spotifyId": "1pkgnNJ7zfcQAslPKgxnyN",
      "appleId": 1000489554978,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1pkgnNJ7zfcQAslPKgxnyN",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-making-of-lori-vallow-daybell/id1521619380?i=1000489554978"
      }
    },
    {
      "id": "1a6c373c-64a7-4591-a243-485e965efecd",
      "title": "Beyond the Veil: Midnight Musings on Chad Daybell’s Preliminary Hearing",
      "description": "In a late-night dinner, we explore some of the implications and repercussions from Chad Daybell’s preliminary hearing. We also discuss serial killer signatures and typologies as they relate to this case.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-08-20T00:00:00",
      "duration": "00:53:10.8420000",
      "explicit": false,
      "spotifyId": "5ITJdlljOy3DJb3G1lXmVa",
      "appleId": 1000488665796,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ITJdlljOy3DJb3G1lXmVa",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-midnight-musings-on-chad-daybells/id1521619380?i=1000488665796"
      }
    },
    {
      "id": "bc7a6bb6-a210-4f5b-a8ae-e8976db4af57",
      "title": "Beyond the Veil: Oprah and Portals and Daybell- Oh My!",
      "description": "Before we move on to explore Lori Vallow’s role in these murders, we examine Chad Daybell’s peculiar obsession with portals and his and Lori’s disdain for Oprah Winfrey- and what these two quirky beliefs mean for this case and, more generally, for understanding the criminal mind and the human condition.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-07-30T00:00:00",
      "duration": "00:37:23.7930000",
      "explicit": false,
      "spotifyId": "28yJ81PbkpsCC9WDPsNg4U",
      "appleId": 1000486696693,
      "urls": {
        "spotify": "https://open.spotify.com/episode/28yJ81PbkpsCC9WDPsNg4U",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-oprah-and-portals-and-daybell-oh-my/id1521619380?i=1000486696693"
      }
    },
    {
      "id": "2e2eba75-23c3-4760-9371-81ccabbde037",
      "title": "Beyond the Veil: Inside Chad Daybell’s Murderous Mind",
      "description": "We begin to piece together the disparate elements of Chad Daybell’s life and the underlying motivations for the murderous schemes he devised along with Lori, examining how and why his upbringing, avoidance of his mortality and the quest for significance all led to his eventual crimes.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-07-22T00:00:00",
      "duration": "00:50:26.8920000",
      "explicit": false,
      "spotifyId": "6EkU1DK3MsTs0xNAVRaRJ3",
      "appleId": 1000485768535,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6EkU1DK3MsTs0xNAVRaRJ3",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-inside-chad-daybells-murderous-mind/id1521619380?i=1000485768535"
      }
    },
    {
      "id": "8404b3a4-d0d0-441e-a1d9-98d0aa32e848",
      "title": "Beyond the Veil: The Closing of the Daybellian Mind",
      "description": "This week we conclude our exploration of the three major psychological elements that led to Chad Daybell’s crimes through an examination of closed-mindedness and uncritical acceptance of paranormal phenomenon- both of which played a significant role in forming his cult and failing to curtail his murderous path.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-07-15T00:00:00",
      "duration": "01:00:23.1570000",
      "explicit": false,
      "spotifyId": "2pNl6IScJcd5m9FuTwXpf6",
      "appleId": 1000485125704,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2pNl6IScJcd5m9FuTwXpf6",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-the-closing-of-the-daybellian-mind/id1521619380?i=1000485125704"
      }
    },
    {
      "id": "5ad096e6-bd93-4c22-9b03-58ded7164314",
      "title": "Beyond The Veil: Chad Daybell\u0027s Big Disconnect",
      "description": "In this second episode we dig deeper into Chad Daybell\u0027s psyche, examining his struggles to develop close relationships and how this social and emotional detachment increased his risks for future criminal behavior. Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-07-09T00:00:00",
      "duration": "00:54:02.3180000",
      "explicit": false,
      "spotifyId": "1F8tbVWK3YmQIbfnHm22xN",
      "appleId": 1000483738683,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1F8tbVWK3YmQIbfnHm22xN",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-chad-daybells-big-disconnect/id1521619380?i=1000483738683"
      }
    },
    {
      "id": "2a8d6472-f463-4924-8cc9-71cb9d29ea5f",
      "title": "Beyond The Veil: Chad Daybell\u0027s Prophetic Yearnings",
      "description": "A forensic psychologist and journalist begin to explore the inner workings of Chad Daybell\u0027s mind, and the hidden motivations driving a series of inexplicable murders.Advertising Inquiries: https://redcircle.com/brandsOur Sponsors:* Check out HelloFresh: http://hellofresh.com* Check out Rosetta Stone and use my code TODAY for a great deal: https://www.rosettastone.com/Advertising Inquiries: https://redcircle.com/brandsPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2020-07-01T00:00:00",
      "duration": "00:30:38.6080000",
      "explicit": false,
      "spotifyId": "0ybPsreShzE3L1zQpfDlGX",
      "appleId": 1000480892453,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ybPsreShzE3L1zQpfDlGX",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-veil-chad-daybells-prophetic-yearnings/id1521619380?i=1000480892453"
      }
    }
  ]
}