{
  "_ts": 0,
  "id": "3066abc2-db97-4a2a-9590-836e697cb597",
  "name": "Hidden Killers With Tony Brueski | True Crime",
  "youTubeChannelId": "UC8-vxmbhTxxG10sO1izODJg",
  "episodes": [
    {
      "id": "d173fe5e-9116-4e41-b439-c72df5fd2af6",
      "title": "Did Diddy Run One Of The Largest \u0026 Darkest Sexual Assault Cults In History?",
      "description": "What happens when someone’s public persona contrasts so sharply with their alleged private actions? In the case of Diddy, we’re not talking about a couple of minor accusations. We’re talking about 120 allegations that span over decades, ranging from minors to adults, with claims of sex trafficking, assault, kidnapping, and more. The dark irony here? His defense team claims he’s going to be “completely exonerated” as if the ship hasn’t already sunk. With so many lives affected, how do you even begin to address the magnitude of such a case? And what does it say about our culture that these things went on for so long? What happens when the stories just keep piling up?\n\n#TrueCrime #DiddyCase #Allegations #SexTrafficking #BehavioralAnalysis #JusticeForVictims #GroupThink\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2024-10-03T19:58:59Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "sfJeNbRV7vE",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sfJeNbRV7vE"
      }
    },
    {
      "id": "e93ff498-6d70-4be6-b59b-19c5a5461854",
      "title": "Did Chad Daybell\u0027s \u0027Cult Community\u0027 Enable The Murders",
      "description": "In this episode of \u0027Hidden Killers With Tony Brueski,\u0027 psychotherapist and author Shavaun Scott delves into the complex psychological factors surrounding belief persistence and fanaticism. Discussing the case of Richard Allen in the Delphi murder trial, Shavaun explores how bizarre and inconsistent confessions, possibly influenced by psychological breakdowns in solitary confinement, challenge the credibility of his admissions. The discussion expands into the psychology of false confessions, highlighting how solitary confinement and coercive interrogation can distort reality for individuals. Shavaun stresses the importance of understanding the psychological mechanisms that cause some people to cling to disproven beliefs, despite overwhelming evidence to the contrary. She explains that confronting such individuals with direct opposition often reinforces their beliefs, suggesting that gentle questioning might be more effective in introducing doubt.\n\n **Main Points of the Conversation:**\n   - **Richard Allen\u0027s Confessions:** Analyzed the validity of Allen\u0027s confessions, noting discrepancies with actual events and suggesting they may be products of his psychological state.\n   - **Psychology of Belief:** Discussed how individuals may persist in their beliefs despite contradicting evidence, often worsening when directly challenged.\n   - **False Confessions:** Highlighted the prevalence of false confessions in the criminal justice system, particularly under coercive conditions or mental duress.\n   - **Influence of Isolation:** Explored the detrimental effects of solitary confinement on mental health, potentially leading to delusions and false admissions.\n   - **Strategies for Persuasion:** Considered approaches to help individuals reassess their beliefs, emphasizing empathy and gentle questioning over confrontation.\n   - **Community and Belief Reinforcement:** Noted how modern online platforms can reinforce extreme beliefs, creating communities that validate and escalate dangerous ideologies.\n\n#TonyBrueski #ShavaunScott #RichardAllen #DelphiMurders #FalseConfessions #PsychologyOfBelief #SolitaryConfinement\n\nSubscribe \u0026 Listen on Apple Podcasts: https://shorturl.at/opFUZ\nSpotify: https://shorturl.at/eksC5\n\nFollow Us On Social Media: \nInstagram: https://www.instagram.com/hiddenkillerspod/\nTikTok: https://www.tiktok.com/@hiddenkillerspod\nFacebook: https://www.facebook.com/hiddenkillerspod/\n\n#truecrime #truecrimecommunity #murdermystery #unsolvedmysteries\n#coldcase #truecrimepodcast #documentary #justicefor #truecrimeaddict #crimejunkie",
      "release": "2024-05-01T03:00:06Z",
      "duration": "00:07:14",
      "explicit": false,
      "youTubeId": "fy3jASNrrmw",
      "subjects": [
        "Chad Daybell",
        "Richard Allen"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fy3jASNrrmw"
      }
    }
  ]
}