{
  "id": "8da7be13-f740-4584-9a56-b892d9c6dd8e",
  "name": "HIEROS GRAPHE",
  "youTubeChannelId": "UCjFExCQRPJ4_xWztg-Z_Lqw",
  "episodes": [
    {
      "id": "d079da56-b69f-4867-8116-f2ff41a6c45c",
      "title": "CULT INITIATION 💥 PASTOR CHRIS \u0026 TB JOSHUA‼️ EXPOSED ‼️#Duncan Williams Uebert Angel #Joshuaselman",
      "description": "Many questions have been raised over the years about the mysterious connection between Prophet TB Joshua and Pastor Chris Oyakhilome. Did TB Joshua truly initiate Pastor Chris into a cult? Or are these just baseless conspiracy theories fueled by critics and religious controversies?\n\nIn this video, we dive deep into:\n🔹 The background of Prophet TB Joshua and Pastor Chris\n🔹 The rumors and allegations surrounding “cult initiation”\n🔹 Why these claims keep resurfacing in Christian circles\n🔹 The possible truth behind the controversy\n🔹 What this means for the church and the faith of millions worldwide\n\nThis is not about attacking or defending anyone, but about shedding light on a story that has kept many people talking for years. Whether fact or fiction, the alleged link between TB Joshua and Pastor Chris continues to spark heated debates among Christians, critics, and seekers of truth.\n\n👉 Watch till the end as we uncover shocking details you may have never heard before!\n\n📌 Don’t forget to like 👍, share 🔁, and subscribe 🔔 for more videos on trending religious issues, church controversies, and hidden truths.\n\n#TBJoshua #PastorChris #CultAllegations #Christianity #ChurchControversyThis\n channel explores happenings within the Christian faith",
      "release": "2025-09-26T15:14:59Z",
      "duration": "00:11:36",
      "explicit": false,
      "youTubeId": "x5MUoaCZuZA",
      "subjects": [
        "T. B. Joshua",
        "Chris Oyakhilome"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x5MUoaCZuZA"
      }
    }
  ]
}