{
  "_ts": 0,
  "id": "3166cd8e-9cd4-472e-b509-064469c29c90",
  "name": "High Control",
  "spotifyId": "63aeG1Ky2BnKPz0PQ0Oe0y",
  "appleId": 1726995281,
  "episodes": [
    {
      "id": "710e5146-8dcf-48c3-952c-c9b8d76e2960",
      "title": "Residue",
      "description": "In this season finale episode, Scot and Ally discuss the residue that remains in their lives after leaving high-control groups. They reflect on the “positive” residue of skills learned within their high-control groups as well as the residue of trauma that they still cope with. They explore the loss of identity and the struggle to find a sense of self outside of the cult. Scot and Ally also discuss the struggles and complexities of leaving and how they found closure. Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, Instagram, and YouTube: @highcontrolpod",
      "release": "2024-05-22T18:37:09Z",
      "duration": "01:19:18.6600000",
      "explicit": false,
      "spotifyId": "4vokTJBBZiTwHIkkBzlUOB",
      "appleId": 1000656424502,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vokTJBBZiTwHIkkBzlUOB",
        "apple": "https://podcasts.apple.com/podcast/residue/id1726995281?i=1000656424502"
      }
    },
    {
      "id": "e0804d29-d75b-4a7f-95d2-32aec2e3a778",
      "title": "Picking up the pieces",
      "description": "Hosts discuss detoxing and recovering from their experiences with high-demand, high-control groups and their faith journey after the cult. In this episode, Scot and Ally discuss the process of picking up the pieces on the other side of high control religion. They explore the feelings and emotions experienced after leaving cult-like groups, including the loss of community and identity. They also discuss the importance of grieving and lamenting the losses while also finding gratitude for any positive aspects of the experience. They emphasize the importance of self-reflection, seeking therapy, and finding support groups. Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, Instagram, and YouTube: @highcontrolpod",
      "release": "2024-05-15T12:23:00Z",
      "duration": "01:11:10.3480000",
      "explicit": false,
      "spotifyId": "6V7apxCT1U0mltiOXT255I",
      "appleId": 1000655668464,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6V7apxCT1U0mltiOXT255I",
        "apple": "https://podcasts.apple.com/podcast/picking-up-the-pieces/id1726995281?i=1000655668464"
      }
    },
    {
      "id": "8ea50ac0-eec3-4478-b610-fc2ff960d78d",
      "title": "Leaving a cult",
      "description": "In this episode, Ally and Scot discuss their experience of leaving cults. Scot shares about leaving the United Pentecostal Church (UPC), which he was born into. Ally\u0027s experience of leaving the UPC was more combative, as her entire church left due to disagreements with the organization\u0027s teachings. Ally and Scot share personal stories and offer advice for those who have experienced high-control groups. They also address the consequences of leaving, including being labeled as bitter and the loss of relationships. They emphasize the importance of recognizing unhealthy practices and questioning beliefs. They also discuss the appeal of charismatic leaders and the deceptive tactics they employ. The episode highlights the abusive history of Mike Bickle and the International House of Prayer (IHOPKC) as an example of how charismatic leaders can deceive their followers. The conversation concludes with a discussion on the cult-like nature of multi-site churches and the reduction of people to consumers in the cult of capitalism. Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, Instagram, and YouTube: @highcontrolpod",
      "release": "2024-05-08T11:01:46Z",
      "duration": "01:13:57.9400000",
      "explicit": false,
      "spotifyId": "63AtSwTI0nTXEzeMhrfSR2",
      "appleId": 1000654919140,
      "subjects": [
        "International House of Prayer Kansas City",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/63AtSwTI0nTXEzeMhrfSR2",
        "apple": "https://podcasts.apple.com/podcast/leaving-a-cult/id1726995281?i=1000654919140"
      }
    },
    {
      "id": "016fa16d-3c19-48d8-a74f-1796340a3d06",
      "title": "Cult Math",
      "description": "In this episode, Ally and Scot discuss the concept of \u0027cult math,’ that is, the rules and practices within high control groups that don’t make sense and are often flat out hypocritical. They share examples of cult math from their experiences in high-control groups. They highlight the ways that cult math shapes the mindsets and behaviors of individuals in high-control groups. Ally and Scot also discuss how cult math is used to reinforce beliefs and establish norms within cults. Here\u0027s a video of one of the kind of altar calls that Scot was talking about...Ally is somewhere in this crowd at Missouri Youth Convention 2009: https://youtu.be/CDfoACUmXA8?si=5kcYX2tpbmaEIQM9 Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, Instagram, and YouTube: @highcontrolpod",
      "release": "2024-05-01T11:01:11Z",
      "duration": "01:07:46.4510000",
      "explicit": false,
      "spotifyId": "7z62ZiWeVXHZMXvAtq05t4",
      "appleId": 1000654160068,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7z62ZiWeVXHZMXvAtq05t4",
        "apple": "https://podcasts.apple.com/podcast/cult-math/id1726995281?i=1000654160068"
      }
    },
    {
      "id": "b689cdf4-4a95-47c5-8b01-3200cae8d551",
      "title": "I showed up to worship Jesus, and all I got was this lousy trauma",
      "description": "Ally shares her experiences of joining multiple high-control groups and the trauma she faced. She talks about her involvement with the United Pentecostal Church (UPC) and the strict standards and control imposed by the church. Despite initially joining with a passion for Jesus, Ally found herself conforming to the church\u0027s rules and regulations. Eventually, she and her church decided to leave the UPC. This episode highlights the harmful effects of high-control groups and the need to recognize and address them. Ally also highlights the connection between the white Charismatic prayer movement and white Christian nationalism, as well as the thought control and radicalization that can take place in those spaces. Ally encourages listeners to ask questions, deliver pushback, and prioritize their own safety and well-being. Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, Instagram, and YouTube: @highcontrolpod",
      "release": "2024-04-24T11:01:05Z",
      "duration": "01:16:25.0300000",
      "explicit": false,
      "spotifyId": "2rQwAwhlhdNCH5rAj1tLrE",
      "appleId": 1000653585036,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rQwAwhlhdNCH5rAj1tLrE",
        "apple": "https://podcasts.apple.com/podcast/i-showed-up-to-worship-jesus-and-all-i-got-was-this/id1726995281?i=1000653585036"
      }
    },
    {
      "id": "d85a8459-4285-4f3e-b859-2621ab19abd2",
      "title": "Growing up culty",
      "description": "Scot shares his experience growing up in a high control environment within the United Pentecostal Church. He discusses the contributing factors that led him to be a part of this organization and the lack of exposure to the outside world. Scot also talks about his realization of being in a cult and the gradual process of leaving the UPC, emphasizing the importance of agency and seeking help to come out of a harmful religious environment. Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, Instagram, and YouTube: @highcontrolpod",
      "release": "2024-04-17T11:01:06Z",
      "duration": "01:13:09.5320000",
      "explicit": false,
      "spotifyId": "4mf4AlXgCpABlAOhIfVc1C",
      "appleId": 1000652726593,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mf4AlXgCpABlAOhIfVc1C",
        "apple": "https://podcasts.apple.com/podcast/growing-up-culty/id1726995281?i=1000652726593"
      }
    },
    {
      "id": "4a8437ca-7c20-4216-9b35-d2ec2ecdf07b",
      "title": "Cults are for white people",
      "description": "It seems like most of the time, when people talk about cults, they mean groups led and populated by white people. Are white people more prone to joining cults, or is something else at play? Ally and Scot attempt to answer these questions and discuss their observations about race and racism in their own cult experiences. Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, Instagram, and YouTube: @highcontrolpod",
      "release": "2024-04-10T11:01:29Z",
      "duration": "01:15:24.3710000",
      "explicit": false,
      "spotifyId": "1L2QVMg4PtEpuAXdyc8gzf",
      "appleId": 1000652013054,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1L2QVMg4PtEpuAXdyc8gzf",
        "apple": "https://podcasts.apple.com/podcast/cults-are-for-white-people/id1726995281?i=1000652013054"
      }
    },
    {
      "id": "43c0a838-b189-4815-bf0d-4dac654534d1",
      "title": "Nobody joins a cult",
      "description": "Nobody willingly signs up to be in an abusive environment. In this episode of High Control, Scot Loyd and Ally Henny discuss their experiences in high-control groups. They explore the reasons why people join these groups, shedding light on the complex factors that contribute to individuals joining and remaining in high-control groups. The episode emphasizes the vulnerability of intelligent individuals to high-control groups and the importance of unraveling cult psychological conditioning and choosing one\u0027s own path. It also addresses the stigma associated with cults and the exploitation that occurs within them. Here\u0027s that song Ally was talking about...\u0022Jean Skirt Girl\u0022 by Fallen Chains: https://youtu.be/kLOQaPSWR1A?si=jq-8BHqXgtRZI9Fp Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, Instagram, and YouTube: @highcontrolpod",
      "release": "2024-04-03T11:01:00Z",
      "duration": "01:02:46.5040000",
      "explicit": false,
      "spotifyId": "54M5BW2y2CzY3UIreGZgaI",
      "appleId": 1000651298832,
      "urls": {
        "spotify": "https://open.spotify.com/episode/54M5BW2y2CzY3UIreGZgaI",
        "apple": "https://podcasts.apple.com/podcast/nobody-joins-a-cult/id1726995281?i=1000651298832"
      }
    },
    {
      "id": "4e212bc6-3a6e-49ce-a1f6-52c1ce210455",
      "title": "Was I in a cult?",
      "description": "Hosts Ally Henny and Scot Loyd discuss their experiences with high-control groups and wrestle with the question of whether or not they were each in a cult. Resources: The BITE Model Combatting Cult Mind Control by Steven Hassan Uncultured: A Memoir by Daniella Mestyanek Young 12 Signs That Someone May Be in a Cult by Ewan Morrison Questions? Comments? Ideas for the show? Email us at highcontrolpodcast@gmail.com Facebook: https://www.facebook.com/highcontrolpod TikTok, Twitter/X, and Instagram: @highcontrolpod",
      "release": "2024-02-29T22:38:24Z",
      "duration": "01:10:23.4280000",
      "explicit": false,
      "spotifyId": "1Gg90gCNB6Gotsg0xWqBeT",
      "appleId": 1000647595866,
      "subjects": [
        "Children Of God",
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Gg90gCNB6Gotsg0xWqBeT",
        "apple": "https://podcasts.apple.com/podcast/was-i-in-a-cult/id1726995281?i=1000647595866"
      }
    }
  ]
}