{
  "_ts": 0,
  "id": "348169d3-dc5e-45b9-878e-30ce76ca857e",
  "name": "Highland Yoga",
  "spotifyId": "6uy03n1ilNa0pFgpy0hrva",
  "appleId": 1740801749,
  "youTubeChannelId": "UC5_oPQ5AO5KH432C3EKqVtQ",
  "episodes": [
    {
      "id": "727a61a5-2497-4334-a401-2eaa212f4dd2",
      "title": "NXIVM Cult Survivor Sarah Edmondson on Healing, Spotting Abuses of Power, and Resilience",
      "description": "In this episode, Reidy sits down with Sarah Edmondson, an actor, activist, and survivor of the notorious NXIVM cult, to dive deep into her harrowing experience within the organization and its lasting effects on her life. Sarah opens up about how her involvement in NXIVM altered her trajectory, both personally and professionally, and how her traumatic experience in a \u0022secret sisterhood\u0022 within NXIVM prompted her escape and ultimately led to the imprisonment of cult leader Keith Raniere and many of his followers. \n\nWe also explore how the subtle yet dangerous dynamics of abuse and power can infiltrate even the most seemingly benign spaces, including the yoga and spiritual communities. Sarah shares her insights on spotting signs of narcissism and abusive behavior, emphasizing the importance of setting and maintaining healthy boundaries.\n\nThroughout the conversation, Sarah reflects on the lessons she’s learned about herself after overcoming such a profound ordeal. Her journey of healing and self-discovery is a testament to resilience and the power of reclaiming one’s autonomy. Whether you’re looking to understand the psychology behind cults, navigate toxic environments, or simply gain insight into the process of self-reclamation, this episode offers profound wisdom and hope.\n\nTune in for an enlightening and courageous conversation on survival, strength, and the path to reclaiming your life.",
      "release": "2024-12-19T14:20:10Z",
      "duration": "00:58:45",
      "explicit": false,
      "spotifyId": "5nRyGFxqqR1Zz8UOJkaZnq",
      "appleId": 1000680976667,
      "youTubeId": "LnvYReZ8aAw",
      "subjects": [
        "NXIVM",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nRyGFxqqR1Zz8UOJkaZnq",
        "apple": "https://podcasts.apple.com/podcast/nxivm-cult-survivor-sarah-edmondson-on-healing-spotting/id1740801749?i=1000680976667",
        "youtube": "https://www.youtube.com/watch?v=LnvYReZ8aAw"
      }
    }
  ]
}