{
  "id": "e7bedb24-ecbd-44a0-82ed-625e63ec5518",
  "name": "Hinduism \u0026 Current Events w/ Premanand Das Bhagat",
  "youTubeChannelId": "UCKGDiJvDQcPLLGQY5yIoqmA",
  "episodes": [
    {
      "id": "ac37a5f2-a2ac-4a05-93c0-a5b735921c6b",
      "title": "100 NXIVM\u0027s Keith Raniere REACTION VIDEO. Jailed sex cult leader, but what did he say?",
      "description": "0:00 – We all know of the horrible person Keith Raniere who abused women in his cult of NXIVM, and was glorified by Battlestar Galactica cast member Alison Mack, but what did he say that was so alluring to so many? Nobody joins a cult willingly. They do so because something resonates, so I wanted to try to see. This reaction video does not excuse Keith, what it does is try to see (as I do in all my reaction videos) is how frauds/con-men/fake gurus/cult leaders speak, and to learn what we should avoid.\n\nSource videos: https://www.youtube.com/watch?v=Dfp5q3T4j8Y\nhttps://www.youtube.com/watch?v=i9Buo3Gj3Zk\nhttps://www.youtube.com/watch?v=z-J8x1_pMpM\nhttps://www.youtube.com/watch?v=5czUYLYQX8A\nhttps://www.youtube.com/watch?v=e4i03j2XBxU\nhttps://www.youtube.com/watch?v=B7lr2xwTzic\nhttps://www.youtube.com/watch?v=oVBagmm1f7E\nhttps://www.youtube.com/watch?v=Afew5XpqrJs\n\nLive 2/23/2024, unedited and off the cuff.\n\nWeekly live show on society \u0026 religion, plus Vedic scriptures. Vaishnava. Combating conversion! Sanatana Dharma not Neo-Hinduism.\n\nI am Premanand Das Bhagat (Aaron Joy), in Maine USA.\n📣 * Contact: aronmatyas@hotmail.com\n* My books: http://www.aaronjoyauthor.weebly.com \n\nI want to help you grow spiritually, discover your life\u0027s purpose, and know god!\n\n📚 I\u0027m a Mystic, Certified Spiritual Life Coach, Certified Ayurveda Specialist, and currently studying Integrel Vedic Counseling under Dr. David Frawley (Pandit Vamadeva Shastri). Spiritual name bestowed by Dr. Chaturbhai Babaria (via Swaminaryan Gurukul USA, Ramanuja lineage). Student of Dr. Frawley \u0026 Sri Dharma Pravartaka Acharya.\n\nChannel originates on youtube, duplicated on Rumble, Spotify, Bitchute, Amazon, Audible, Apple \u0026 Google Podcasts, iHeart, Pocket Casts, Castbox, Chromecast, Listen Notes, Podcast Addict, People Ai, Everend, Rephonic, allfeeds.ai, fyyd.de.\n\n#religion #sanatanadharma #spirituality #hinduism #hindu #ancientwisdom #india #krishnaconsciousness #cultleaders #cults",
      "release": "2024-04-27T17:10:04Z",
      "duration": "02:13:43",
      "explicit": false,
      "youTubeId": "rFlKcLZZisA",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rFlKcLZZisA"
      }
    }
  ]
}