{
  "id": "63a9d4f3-514c-402d-97a9-9bc8cb029b71",
  "name": "Hindustan Times",
  "youTubeChannelId": "UCm7lHFkt2yB_WzL67aruVBQ",
  "episodes": [
    {
      "id": "b7051093-7175-44f4-a92b-ec98955f0524",
      "title": "Russia’s ‘Jesus Christ’ Arrested: How Ex-Traffic Cop Turned Messiah Built A Cult After Soviet Fall",
      "description": "The end of the USSR in 1991 was one of the most cataclysmic events in history, with its aftereffects still being felt three decades on. But there was one such moment triggered at the same time, that was unforeseen. It was the rise of a new religious order in a remote corner of Russia, powered by the \u0027spiritual awakening\u0027 of a man. Meet Sergei Torop, or as he is popularly known, the \u0027Vissarion\u0027. In the 1990s, Torop claimed he was the reincarnation of Jesus of Nazareth. A new Church was established, Torop amassed thousands of followers but then came his fall from grace, he was subjected to thorough investigation leading to a severe directive from the Russian state.\n\n\nIn this episode of HT In-Depth, we look at the history of Sergei Torop\u0027s cult, from his \u0027divine revelation\u0027, to the establishment of his new \u0027Church\u0027, and the perceived end of his massive cult. Watch this video for full details on the Vissarion.\n\n\nINTERNATIONAL NEWS\n\n#russia #christianity #jesus #jesuschrist #virginmary #religion #vissarion #fsb #vladimirputin #putin\n\nHindustan Times Videos brings all the News for the Global Indian under one umbrella. We break down news from across the globe from the unique lens of a Rising India. Tune in for Explainers, Opinions, Analysis and a 360 degree view of big events in India and the World which impact your present and future. \n\nFollow the Hindustan Times Channel on WhatsApp for News Alerts, Top Stories and Editor picks. Join Us Today - https://www.bit.ly/3PQ4kSv\n\nSubscribe to the Hindustan Times YT channel and press the bell icon to get notified when we go live.\n\nVisit our website https://www.hindustantimes.com/\nFollow us on Twitter https://twitter.com/htTweets\nFollow us on Facebook https://www.facebook.com/hindustantimes",
      "release": "2025-07-09T12:31:09Z",
      "duration": "00:13:22",
      "explicit": false,
      "youTubeId": "usQERW2BjT4",
      "subjects": [
        "Last Testimentism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=usQERW2BjT4"
      }
    }
  ]
}