{
  "id": "d13fa977-c237-4184-9f50-c24b4961b8a4",
  "name": "Hiraya",
  "youTubeChannelId": "UCYTUFWR-NLeOe8K9IPfOnxw",
  "episodes": [
    {
      "id": "2819996a-68dd-498a-8625-386d9812ad89",
      "title": "This Religion Worships Their National Hero: Cult or Creed? The Rizalista Documentary",
      "description": "What if your national hero was worshipped not just as a symbol—but as a god?\n\nIn this captivating documentary, we explore the mysterious and powerful world of the Rizalistas—Filipino religious movements that revere Dr. José Rizal, the Philippines’ national hero, as a divine figure. From the sacred caves and springs of Mount Banahaw to the fading shrine at Mount Arayat, this video reveals a hidden spiritual tradition where faith, nationalism, and decolonization intertwine.\n\nDiscover how Rizal, a rationalist and reformist executed by Spanish colonizers in 1896, was transformed into a Filipino Christ—a messiah figure whose life, death, and writings sparked a revolutionary faith known as Rizalismo. You\u0027ll witness pilgrimage rituals, hear the stories of charismatic spiritual leaders, and see how sacred landscapes have become living altars to Rizal\u0027s memory.\n\nWhether you’re passionate about Philippine history, curious about folk religion, or interested in the intersection of colonialism, spirituality, and identity, this video offers a profound journey into a faith you’ve never heard of—but one that continues to shape the Filipino soul.\n\n📍 Featuring sacred sites:\n\nMount Banahaw – The \u0022New Jerusalem\u0022 of Filipino mysticism\n\nMount Arayat – Home of the “Female Rizal” and her spiritual teachings\n\n🎥 Topics covered:\n\nRizalismo and the theology of the Rizalistas\n\nFolk Catholicism and indigenous spirituality\n\nNational identity, martyrdom, and myth-making\n\nRitual pilgrimages and sacred geography\n\nThe decline and resilience of charismatic religious movements in modern Philippines\n\n🔔 Subscribe for more in-depth stories about untold histories, faith, and the spiritual heart of Southeast Asia.\n\n#JoseRizal #Rizalistas #PhilippineHistory #FolkReligion #Rizalismo #MountBanahaw #MountArayat #Mysticism #FilipinoFaith #Documentary",
      "release": "2025-07-16T21:36:42Z",
      "duration": "00:28:27",
      "explicit": false,
      "youTubeId": "II1H-_NsmEE",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=II1H-_NsmEE"
      }
    }
  ]
}