{
  "id": "7a557a95-2c23-47de-bac6-b7685621d925",
  "name": "History for the Tourist",
  "youTubeChannelId": "UCILm54bhL9aHhdnofdFCIVg",
  "episodes": [
    {
      "id": "878ef5d4-2058-47d6-838a-ffc532f8b4e2",
      "title": "Temple of Augustus and Rome in Ankara – Provincial Imperial Cults",
      "description": "The Temple of Augustus and Rome located in Ankara is a classic example of a temple to the Imperial Cult. Beginning with Octavian after he assumed the title of Caesar Augustus, the imperial cult was designed to bring Roman values and customs to the far flung reaches of the Roman Empire. It also served as a symbol of power, a deterrent to insurrection, and litmus test of a subject’s loyalty to the divine emperor. In this video we will explore the role of the Imperial Cult during the Roman Empire.\r\n\r\nIG: HistoryfortheTourist\r\n\r\nMap of Roman Asia from Historical Atlas by William R. Shepherd 1911\r\nThe Death of Caesar by Jean-Léon Gérôme 1867 a two-dimensional, public domain work of art\r\nBattle of Actium by Laureys a Castro 1672 a two-dimensional, public domain work of art\r\nA Roman Triumph by Peter Paul Rubens 1630 a two-dimensional, public domain work of art\r\nMaecenas Presenting the Liberal Arts to Emperor Augustus by Giovanni Battista Tiepolo 1743 a two-dimensional, public domain work of art\r\nCrucifixion of Saint Peter by Caravaggio 1600 a two-dimensional, public domain work of art\r\nMonumentum Ancyranum from Compendium of Roman History: Res Gestae Divi Augusti by ‎Frederick William Shipley, ‎Augustus 1924\r\nThe Death of Julius Caesar by Vincenzo Camuccini 1804 a two-dimensional, public domain work of art\r\nCicero Denounces Catiline by Cesare Maccari 1889 a two-dimensional, public domain work of art\r\n\r\nEmperor Augustus under license Gilmanshin/Shutterstock\r\nJulius Caesar Bust under license Kamira/Shutterstock\r\nJulius Caesar Statue under license Aaron Wood/Shutterstock\r\nRoman Sacrifice under license BasPhoto/Shutterstock\r\nRoman Sacrifice on Arch of Constantine under license zebra0209/Shutterstock\r\nEarly Frost by Dynamedion – royalty free, copyright free music license through CyberLink’s PowerDirector 365\r\n\r\nMessage for licensing details.\r\n\r\nAll other photos by the creator of this video TPF July 2023 Greece, September 2023 Turkey, January 2024 Los Angeles, July 2024 Greece.\r\nAll overlays and labeling by the creator of this video TPF January 2025",
      "release": "2025-01-12T08:50:58Z",
      "duration": "00:08:17",
      "explicit": false,
      "youTubeId": "isnoZURpze0",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=isnoZURpze0"
      }
    }
  ]
}