{
  "id": "e803e906-ef27-4b5c-98dd-7b6f6ef89337",
  "name": "History Buffoons Podcast",
  "spotifyId": "1xzN0HsROKKFBJNpIx42mb",
  "appleId": 1760425383,
  "youTubeChannelId": "UCPRBAO2swBpzKFIWd-qKdVA",
  "episodes": [
    {
      "id": "4c908c59-aa82-40a9-b2b0-bca1df6ba7a7",
      "title": "Holy Hitman Roofie: Thuggee Cult of India",
      "description": "A friendly smile by the fire, a shared meal on a dusty road, and a scarf that turns into a weapon in a heartbeat. We dive into the shadowed world of the Thuggee—bands of highway killers who claimed divine orders from the goddess Kali—and the colonial machine that made their legend larger than life. From slow-burn cons inside caravans to the lethal elegance of the rumal, we unpack how method, belief, and fear intersected to create one of history’s most unsettling criminal systems.\n\nWe trace the rise and fall of these organized bands across centuries: the paramilitary structure under jemadars, a private cant called Ramasi, taboos that often bent under pressure, and the chilling efficiency of pre-dug graves and datura-laced meals. Then the British arrive. Captain William Henry Sleeman builds an empire-wide case with informants, mass arrests, and new laws, and then pens bestsellers that electrify Victorian readers. Was this a necessary public safety campaign, or a masterclass in imperial storytelling? We weigh both sides: Thuggee as fanatical cult versus disciplined banditry wrapped in religious language, possibly fueled by disbanded soldiers and quiet support from local elites.\n\nThe story doesn’t end on the road. “Thug” leaps into English, morphs through Dickens and colonial reports, and later reemerges in American slang and hip-hop as a symbol of toughness and survival. Along the way we ask: who gets to define savagery and civilization? How do policy and propaganda feed each other? And what happens when a single narrative reshapes law, culture, and language for generations?\n\nGrab a seat, crack a Broken Skull, and journey with us through faith, fear, and the thin line between truth and myth. If this exploration challenged what you thought you knew, follow the show, share it with a friend, and leave a quick review to help more curious listeners find us.\n\nDash, Mike. Thug: The True Story of India’s Murderous Cult. (Outline of Thuggee history and British suppression, with analysis of legends vs. facts)en.wikipedia.orgen.wikipedia.org.\n\nReynolds, Christopher. \u0022Tracing India’s cult of thugs.\u0022 Los Angeles Times, Aug. 3, 2003. (Review of Children of Kali with historical summary of Thuggee and Sleeman’s campaign)latimes.comlatimes.com.\n\nSavage, Mike. \u0022Thug Life: The Murderous Cult that Birthed a Common English Word.\u0022 Medium, Sep. 16, 2023. (Discusses the origin of the Thuggee cult and how “thug” entered English slang)medium.commedium.com.\n\nWagner, Kim A. Thuggee: Banditry and the British in Early Nineteenth-Century India. (Academic work re-examining Thuggee, suggesting it was a form of banditry patronized by local elites)moltensulfur.commoltensulfur.com.\n\nEncyclopædia Britannica entry on “Thuggee.” (Describes Thuggee as organized assassins in India, their methods, and devotion to Kali)latimes.comlatimes.com.\n\nSleeman, William H. The Thugs or Phansigars of India, 1839. (Primary source by the British officer who led the anti-Thug campaigns, detailing Thug confessions, practices, and the suppression effort)en.wikipedia.orgen.wikipedia.org.\n\nWikipedia: “Thuggee.” (General reference for Thuggee history, beliefs, jargon, and modern skepticism)en.wikipedia.orgen.wikipedia.org.\n\nPopular Culture References: Confessions of a Thug (1839 novel)en.wikipedia.org; Indiana Jones and the Temple of Doom (film, 1984)en.wikipedia.org; The Deceivers (film, 1988)en.wikipedia.org; Gunga Din (film, 1939)medium.com, etc., which have variously interpreted and fictionalized the Thuggee legend.",
      "release": "2025-11-11T11:00:57Z",
      "duration": "00:46:54",
      "explicit": false,
      "spotifyId": "7r8h1caEOck0KanC9sUqYc",
      "appleId": 1000736219056,
      "youTubeId": "WrQA-YXLAKw",
      "subjects": [
        "Thuggee"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7r8h1caEOck0KanC9sUqYc",
        "apple": "https://podcasts.apple.com/podcast/holy-hitman-roofie-thuggee-cult-of-india/id1760425383?i=1000736219056",
        "youtube": "https://www.youtube.com/watch?v=WrQA-YXLAKw"
      }
    }
  ]
}