{
  "id": "5bd533bf-5293-4665-9d0d-262018bdef6f",
  "name": "hithertoexisting",
  "youTubeChannelId": "UCx7RdXPIgg2TSvWnnotrucg",
  "episodes": [
    {
      "id": "ebd03878-5c74-49f8-8c64-4b7531a3d282",
      "title": "Cult Explosion (1980) New Liberty VHS",
      "description": "**Cult Explosion (1980) | New Liberty Films - A Deep Dive into Controversial Religious Groups**\n\nIn this thought-provoking VHS tape from New Liberty Films, *Cult Explosion* explores the rise of religious movements in the 20th century that have been labeled as \u0022cults\u0022 by critics and mainstream society. Featuring a detailed look at various groups considered controversial or unorthodox, the film delves into their beliefs, practices, and the controversies surrounding them. \n\nFrom the Hare Krishna movement and the Manson Family to the People\u0027s Temple, Scientology, and beyond, *Cult Explosion* examines the sometimes dangerous and often misunderstood nature of these groups. It also features a look at Christian Science, Unity, the Worldwide Church of God, Jehovah\u0027s Witnesses, the Latter-Day Saints (Mormons), the Unification Church (Moonies), and Transcendental Meditation.\n\nThis vintage documentary offers a unique perspective on the era\u0027s religious landscape, making it an essential watch for those interested in the psychology of cults, religious movements, and their influence on society. \n\n**Watch now and dive into the controversial world of religious cults.**",
      "release": "2025-05-10T19:20:00Z",
      "duration": "00:55:40",
      "explicit": false,
      "youTubeId": "aZvUjRASUg0",
      "subjects": [
        "Peoples Temple",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Unification Church",
        "Christian Science",
        "Hare Krishnas",
        "Jehovah\u0027s Witnesses",
        "Manson Family",
        "Scientology",
        "Transcendental Meditation",
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aZvUjRASUg0"
      }
    }
  ]
}