{
  "_ts": 0,
  "id": "32fdd927-86a4-4906-bb93-b1852b219b0f",
  "name": "HJ Talks About Abuse",
  "spotifyId": "5ehsPetv8i5uo8zQNCoeaN",
  "appleId": 1465259035,
  "youTubeChannelId": "UCb9K2p-ZLMlRTnOxGooIlYg",
  "episodes": [
    {
      "id": "2a518f79-3931-44be-98e5-80a733770a7e",
      "title": "Exploring the Al-Fayed Case: Legal Challenges and Survivors\u0027 Rights",
      "description": "Source:\nhttps://www.podbean.com/eau/pb-z4ftd-16e3063\n\nWelcome to the H.J. Talks About Abuse podcast, where we delve into sexual abuse cases, aiming to foster open discussions on these often-ignored topics. Brought to you by the abuse team at Hugh James, we offer insights into both the legal aspects and broader issues faced by survivors of sexual abuse.\nIn this episode, Alan Collins, the head of the abuse team at Hugh James, discusses the troubling allegations against the late Mohammed Al-Fayed. Known for his ownership of Harrods and his omnipresence in the media, Al-Fayed has been accused of sexually abusing numerous women. Alan explores the similarities between Al-Fayed\u0027s case and that of the infamous Jimmy Savile, and the potential legal avenues available for survivors seeking justice.\nThe discussion highlights the complexities of pursuing civil claims against deceased abusers, the principles of vicarious liability, and the challenges posed by the Limitation Act 1980. Alan underscores the importance of specialist legal representation to navigate these hurdles and ensure that survivors have a fair chance at justice.\nIf you are a survivor or have questions about the topics discussed, the Hugh James team is available for confidential consultations. Thank you for joining us on this latest episode of H.J. Talks About Abuse.\n#AbuseofPower\nWho we are:\nWe are a leading, full-service UK law firm.  \nSince our beginning, we have been led by the things that matter. We care about fighting for the right outcomes. Solving the seemingly unsolvable. Protecting businesses, individuals, and livelihoods. Supporting our people, our communities. Safeguarding our planet.  \nLooking for a way forward? At Hugh James, challenges – of all sizes – are readily accepted. \nOur team of specialist sexual abuse solicitors have helped many people secure sexual abuse compensation.  Find out more- https://www.hughjames.com/services/sexual-abuse-claims-and-compensation/  \nFollow us on socials: \nLinkedIn- https://www.linkedin.com/company/hugh-james/ \nX- https://twitter.com/hj_abuse  \nFacebook- https://www.facebook.com/abusejustice/",
      "release": "2024-09-24T16:04:56Z",
      "duration": "00:11:15",
      "explicit": false,
      "spotifyId": "3knIXWe4qumXlq3SGsVfdA",
      "appleId": 1000670547472,
      "youTubeId": "Q4jsrQb2SfU",
      "urls": {
        "spotify": "https://open.spotify.com/episode/3knIXWe4qumXlq3SGsVfdA",
        "apple": "https://podcasts.apple.com/podcast/exploring-the-al-fayed-case-legal-challenges/id1465259035?i=1000670547472",
        "youtube": "https://www.youtube.com/watch?v=Q4jsrQb2SfU"
      }
    },
    {
      "id": "38ebc3a2-4234-47c1-b653-d5d65204b3be",
      "title": "Unveiling the Church\u0027s Safeguarding Failures: The Canon Andrew Hindley Case",
      "description": "Welcome to the H.J. Talks About Abuse podcast, where we delve into sexual abuse cases to foster open discussions on often ignored topics. Hosted by Alan Collins, head of the abuse team at Hugh James, this episode features Danielle Vincent and Hannah Hodgson. This episode explores a recent news story about the Church of England\u0027s financial settlement with Canon Andrew Hindley following unproven sexual assault allegations. Despite multiple risk assessments deeming Hindley a potential threat, no criminal convictions were made, raising serious safeguarding concerns within the Church. The team discusses the implications of such cases on survivors, the Church\u0027s safeguarding measures, and the broader issues faced by those affected by sexual abuse. Tune in to understand why safeguarding is crucial and how the Church\u0027s actions may impact future disclosures. Join us as we seek clarity on this complex case and emphasize the importance of protecting the vulnerable.",
      "release": "2024-09-06T15:51:48Z",
      "duration": "00:12:18.4200000",
      "explicit": false,
      "spotifyId": "750nzFYsr8sZtF0MXbwaG4",
      "appleId": 1000668633676,
      "youTubeId": "JxfnXS-Kqyg",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/750nzFYsr8sZtF0MXbwaG4",
        "apple": "https://podcasts.apple.com/podcast/unveiling-the-churchs-safeguarding-failures-the/id1465259035?i=1000668633676",
        "youtube": "https://www.youtube.com/watch?v=JxfnXS-Kqyg"
      }
    },
    {
      "id": "8da02052-1f29-419b-a8c2-2c6ebe07216a",
      "title": "Church of England\u0027s Safeguarding Scandal: A Deep Dive",
      "description": "Source:\nhttps://www.podbean.com/eau/pb-cprnk-16abdff\n\nWelcome to the H.J. Talks About Abuse podcast, where we discuss sexual abuse cases to encourage open conversations on topics often ignored. Brought to you by the abuse team at Hugh James, we aim to empower survivors with our discussions.\n \nIn this episode, Alan Collins, head of the abuse team at Hugh James, is joined by Justin Humphreys, CEO and Head of Safeguarding Development at Thirtyone:eight. They delve into a recent BBC news story concerning safeguarding issues within the Church of England, focusing on the diocese of Blackburn.\n \nAmidst allegations and a controversial payout to a canon, Alan and Justin discuss the complexities and failures of the Church\u0027s safeguarding processes. They explore the implications for victims and survivors, and what needs to change to restore trust and ensure robust safeguarding practices.\n \nJoin us for a thought-provoking discussion on the challenges and necessary reforms in safeguarding within religious settings.",
      "release": "2024-08-22T09:50:34Z",
      "duration": "00:24:07",
      "explicit": false,
      "spotifyId": "0GXSEEw5m6rBWEOSdLVANB",
      "appleId": 1000666221665,
      "youTubeId": "HhJJicXR4Ks",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0GXSEEw5m6rBWEOSdLVANB",
        "apple": "https://podcasts.apple.com/podcast/church-of-englands-safeguarding-scandal-a-deep-dive/id1465259035?i=1000666221665",
        "youtube": "https://www.youtube.com/watch?v=HhJJicXR4Ks"
      }
    },
    {
      "id": "d3ecd518-65bc-44b3-b044-ca29e495f8be",
      "title": "Election Promises and Child Abuse: A Critical Review",
      "description": "In this episode, Alan dives into the manifestos of the Labour Party, the Conservative Party, and the Liberal Democrats to examine what they have to say about child abuse and related issues. Alan provides a non-partisan analysis, focusing on key topics such as mandatory reporting laws, justice for victims, and proposed redress schemes. Alan discusses the Independent Inquiry into Child Sexual Abuse (ICSA) recommendations and how each party addresses—or fails to address—them. He highlights the importance of mandatory reporting and the need for accountability in the justice system. The episode also touches on the complex nature of handling rape cases and the necessity for timely justice. Join Alan as he navigates through these political manifestos, offering insights and critiques that are crucial for survivors of sexual abuse and those advocating for their rights. Whether you are a regular listener or tuning in for the first time, this episode aims to inform and empower.",
      "release": "2024-06-20T14:22:00Z",
      "duration": "00:25:08.5400000",
      "explicit": false,
      "spotifyId": "4PVV7R26xnzcH2jcY70Nnv",
      "appleId": 1000659646743,
      "youTubeId": "WYM5OWaHOOA",
      "subjects": [
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4PVV7R26xnzcH2jcY70Nnv",
        "apple": "https://podcasts.apple.com/podcast/election-promises-and-child-abuse-a-critical-review/id1465259035?i=1000659646743",
        "youtube": "https://www.youtube.com/watch?v=WYM5OWaHOOA"
      }
    },
    {
      "id": "207f257d-50ec-4f92-805f-6b7e1399dd14",
      "title": "Unveiling the Dark Side: The Case of the Disgraced Vicar",
      "description": "Welcome to the HJ Talks About Abuse podcast, brought to you by the abuse team at Hugh James. In this episode, Alan Collins, the head of the abuse team, along with his colleagues Kathleen Hallisey and Hannah Hodgson, delve into the unsettling case of Reverend Julian Wheeler, a former Church of England clergyman recently convicted of sexually abusing two altar boys. We discuss the legal concept of vicarious liability and its implications for organisations in cases of abuse. This episode highlights how the misuse of power by individuals in positions of authority, such as priests, can lead to severe consequences for victims. We also explore the broader issues faced by survivors, including the impact of mandatory reporting and the complex dynamics within faith communities that can hinder justice. Join us as we examine the importance of safeguarding, the challenges of mandatory reporting, and the profound need for support and empowerment for survivors of clergy abuse. We hope this discussion not only informs but also encourages those affected to come forward and seek help. Thank you for listening to this episode of HJ Talks About Abuse. You can subscribe to our podcast on iTunes, Spotify, or your favorite podcast player. If you\u0027d like to speak to us about something you\u0027ve heard today, we\u0027d love to hear from you.",
      "release": "2024-05-24T10:13:52Z",
      "duration": "00:16:31.7730000",
      "explicit": false,
      "spotifyId": "7gC8LWoOrqegzAL2aTF48i",
      "appleId": 1000656624836,
      "youTubeId": "9h5QU2F6Y1Y",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7gC8LWoOrqegzAL2aTF48i",
        "apple": "https://podcasts.apple.com/podcast/unveiling-the-dark-side-the-case-of-the-disgraced-vicar/id1465259035?i=1000656624836",
        "youtube": "https://www.youtube.com/watch?v=9h5QU2F6Y1Y"
      }
    },
    {
      "id": "af726a66-3ee1-41e4-9ff2-4461dce878b3",
      "title": "Sexual Abuse, Stalking, and Overcoming Trauma",
      "description": "Delve into the themes of \u0027Baby Reindeer\u0027, a riveting Netflix series, with Danielle and Hannah in the H.J. Talks About Abuse Podcast. This episode presents a thoughtful discussion about the serious issues portrayed in the TV series, which include sexual abuse, stalking, and broader issues faced by survivors of such traumas. As legal experts, Danielle and Hannah also explore the legal aspects surrounding these issues. They talk about the power dynamics, the stigmatization, and the barriers to reporting such incidents, particularly for gay and bisexual men. Listeners are warned about potentially upsetting themes. At the end of the podcast, they emphasize the importance of seeking support and help. It\u0027s a powerful discussion not just for survivors of abuse, but for all audiences to broaden their understanding and empathy towards such grave issues. A numbe rof support services: Services - Safeline - Believe in you - Surviving sexual abuse \u0026 rape 1in6 | Sexual Abuse of Boys \u0026 Men - Confidential Support www.survivorsuk.org/ Support For Male Survivors - MSP - The Male Survivors Partnership Rape Crisis England \u0026 Wales",
      "release": "2024-05-03T14:33:02Z",
      "duration": "00:15:58.0490000",
      "explicit": false,
      "spotifyId": "5OcrHoCwUDj8DfhETZU0Et",
      "appleId": 1000654443971,
      "youTubeId": "z9CtmprnWOs",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5OcrHoCwUDj8DfhETZU0Et",
        "apple": "https://podcasts.apple.com/podcast/sexual-abuse-stalking-and-overcoming-trauma/id1465259035?i=1000654443971",
        "youtube": "https://www.youtube.com/watch?v=z9CtmprnWOs"
      }
    },
    {
      "id": "7e0c9080-a18c-4479-ab2e-63e90a9aae6d",
      "title": "The Need for Effective Mandatory Reporting Laws",
      "description": "Welcome to this insightful podcast brought to you by Alan Collins, the head of the abuse team at Hugh James. As he explores the current stance on child abuse reporting, he dives into the necessity of mandatory reporting and the implications of non-enforcement. Alan underscores the need for a law that requires individuals aware of child abuse to report the incident to the police or relevant authorities. Alan discerns the substantial gaps in the existing system, noting that the majority of Western countries have enforcement laws, but a large portion have no legal obligation to report child abuse. He refers to a publicized Home Office announcement, revealing the introduction of new legal requirements for those in positions of responsibility to report known child sexual abuse. Through the discussion, Alan expresses his concerns about the current arrangements. He encourages rigorous reporting of any suspicions or concerns about child abuse, stating that waiting until after abuse has been confirmed equates to shutting the stable door after the horse has bolted. Drawing from experience, Alan elaborates on the real-world repercussions of neglecting to report child abuse and observes the lack of accountability evident in public failure. As a solution, he advocates for the establishment of more effective mandatory reporting laws that would bring about significant culture changes, minimizing future instances of abuse. Alan concludes the podcast by voicing his intention to bring up this issue again at Parliament in the following month and continues to hope for decisive strides in establishing more beneficial laws governing mandatory reporting of child abuse. He makes the point that these laws should cover a wide range of adults working with children and not be exclusive to teachers and health professionals. If you found this podcast informative, and wish to share thoughts, questions or suggestions for future podcasts, please reach out. We, at Hugh James, are always open to hearing what you have to say. Thank you for your time!",
      "release": "2024-02-28T09:24:41Z",
      "duration": "00:12:50.9330000",
      "explicit": false,
      "spotifyId": "2ozo8Xpip7ysy5uLL6pkgL",
      "appleId": 1000647369503,
      "youTubeId": "xtUaalvKOSw",
      "subjects": [
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ozo8Xpip7ysy5uLL6pkgL",
        "apple": "https://podcasts.apple.com/podcast/the-need-for-effective-mandatory-reporting-laws/id1465259035?i=1000647369503",
        "youtube": "https://www.youtube.com/watch?v=xtUaalvKOSw"
      }
    },
    {
      "id": "480744a1-8003-4095-959f-54fc3ecda72a",
      "title": "Plymouth Brethren Christian Church members under investigation for alleged sexual abuse",
      "description": "In this episode, the team discusses the recent reports that have surfaced uncovering decades of alleged child sexual abuse within the Plymouth Brethren Christian Church.",
      "release": "2023-11-10T00:00:00",
      "duration": "00:18:57.5800000",
      "explicit": false,
      "spotifyId": "6v3Vyb6xV9HbBw3fVJ1x4f",
      "appleId": 1000634398248,
      "youTubeId": "V1IpYIw09Ms",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6v3Vyb6xV9HbBw3fVJ1x4f",
        "apple": "https://podcasts.apple.com/podcast/plymouth-brethren-christian-church-members-under-investigation/id1465259035?i=1000634398248",
        "youtube": "https://www.youtube.com/watch?v=V1IpYIw09Ms\u0026t=6s"
      }
    },
    {
      "id": "c4ac213c-ce94-4d9f-bce8-07522b549057",
      "title": "Vicar barred from Church of England after failing to disclose husband’s abuse",
      "description": "This week, the abuse team discuss a recent headline in the BBC which discusses a vicar from Solihull who failed to disclose to the Church of England her husband\u0027s sexual abuse of children, which led to her being barred from the ministry.",
      "release": "2023-03-10T00:00:00",
      "duration": "00:24:03.7350000",
      "explicit": false,
      "spotifyId": "5fAOjrPuVIqOpdcmjAdu88",
      "appleId": 1000603601964,
      "youTubeId": "6UGfOjofAZw",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5fAOjrPuVIqOpdcmjAdu88",
        "apple": "https://podcasts.apple.com/podcast/vicar-barred-from-church-of-england-after-failing-to/id1465259035?i=1000603601964",
        "youtube": "https://www.youtube.com/watch?v=6UGfOjofAZw"
      }
    },
    {
      "id": "b7d8d06f-7fbc-4b8e-bea5-5ba226ff49d7",
      "title": "The Jesus Fellowship Redress Scheme",
      "description": "This week Danielle and Kathleen discuss the Jesus Fellowship Redress Scheme, which was introduced on Monday the 26th of September. Applications are open until 31st December 2023 for victims to apply for compensation.",
      "release": "2022-09-30T00:00:00",
      "duration": "00:13:04.3780000",
      "explicit": false,
      "spotifyId": "2avB0cnqGTQIStLSlPficG",
      "appleId": 1000581161815,
      "youTubeId": "NeDYEnlerjU",
      "subjects": [
        "Jesus Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2avB0cnqGTQIStLSlPficG",
        "apple": "https://podcasts.apple.com/podcast/the-jesus-fellowship-redress-scheme/id1465259035?i=1000581161815",
        "youtube": "https://www.youtube.com/watch?v=NeDYEnlerjU"
      }
    },
    {
      "id": "f682dee0-f66f-4af6-89d1-036fcef5002a",
      "title": "Child abuse within the Mormon church",
      "description": "Alan, Kathleen and Danielle discuss a recent headline in the Associated Press in the US involving sexual abuse in the Mormon Church.",
      "release": "2022-09-02T00:00:00",
      "duration": "00:12:49.6970000",
      "explicit": false,
      "spotifyId": "3sfKB6WKJ9Rj1T7EvfaSQ2",
      "appleId": 1000578161215,
      "youTubeId": "uNvtJRjGqow",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sfKB6WKJ9Rj1T7EvfaSQ2",
        "apple": "https://podcasts.apple.com/podcast/child-abuse-within-the-mormon-church/id1465259035?i=1000578161215",
        "youtube": "https://www.youtube.com/watch?v=uNvtJRjGqow"
      }
    },
    {
      "id": "28774277-5f03-4f4f-877d-06fe75b426e1",
      "title": "Netflix –Keep Sweet: Pray and Obey",
      "description": "An untold story of Warren Jeffs Texas based religious closed community, the expose looked a bigamy, abuse and peadophilia. Leader of the Fundamentalist Church of Jesus Christ of Latter Day Saints.  He had been head of the church since 2002 and imprisoned in 2011. The documentary focused on the accounts of those who had left the cult and the impact on their lives. Warren had 78 wives in which 24 of these were under 17. One of the people featured in the documentary was married to Warren at 14.",
      "release": "2022-08-26T00:00:00",
      "duration": "00:17:11.0530000",
      "explicit": false,
      "spotifyId": "6qGsrqwTo8pDUfBiLoV9qT",
      "appleId": 1000577419372,
      "youTubeId": "CIphQBFGGEU",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6qGsrqwTo8pDUfBiLoV9qT",
        "apple": "https://podcasts.apple.com/podcast/netflix-keep-sweet-pray-and-obey/id1465259035?i=1000577419372",
        "youtube": "https://www.youtube.com/watch?v=CIphQBFGGEU"
      }
    },
    {
      "id": "b347e64a-6cc4-4dae-8649-29d074c60af6",
      "title": "Pope Benedict Admits To Providing False Information To Abuse Inquiry",
      "description": "Former pope Benedict XVI of the Roman Catholic Church has admitted providing false information to the German inquiry into clerical sexual abuse. The report found Benedict whilst in his role of the Archbishop of Munich and Freising from 1977-1982 failed to take action against four priests accused of sexual abuse. Benedict stated initially he was not at a meeting in the 1980’s which discussed allegations of abuse and that it was deemed by him as an oversight. An investigation found he was in fact involved in such meeting and was aware of the allegations. This allowed the perpetrators in question to remain in their positions within the church without sanction or supervision. As Pope between 2005 and 2013, Benedict has previously come under fire for failing to act against widespread child sexual abuse within the Roman Catholic church and has repeatedly denied his role in knowingly covering up abuse, although in 2010 he admitted that the church “did not act quickly or firmly enough to take the necessary action”. A previous report into historical abuse in Germany concluded that more than 3,600 people nationwide had been abused by clergy members between 1946 and 2014. Many of the survivors were very young and served as altar boys. Again as with any reported figures, these numbers are likely to be the tip of the iceberg with many survivors not disclosing their abuse. The report, like many before them, is disappointing and once again demonstrates the failures of the church to protect those in the congregation. It will be very upsetting for many who could have been protected by the church. We encourage anyone who has concerns about sexual abuse to get in touch. You can contact Alan Collins at Alan.collins@hughjames.com or Danielle Vincent at  Danielle.vincent@hughjames.com.",
      "release": "2022-02-25T00:00:00",
      "duration": "00:06:02.3700000",
      "explicit": false,
      "spotifyId": "6jz4cF3erDIR1kH2hCeLuT",
      "appleId": 1000552236341,
      "youTubeId": "CCXGh24En2Q",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6jz4cF3erDIR1kH2hCeLuT",
        "apple": "https://podcasts.apple.com/podcast/pope-benedict-admits-to-providing-false-information/id1465259035?i=1000552236341",
        "youtube": "https://www.youtube.com/watch?v=CCXGh24En2Q"
      }
    }
  ]
}