{
  "id": "32fdd927-86a4-4906-bb93-b1852b219b0f",
  "name": "HJ Talks About Abuse",
  "spotifyId": "5ehsPetv8i5uo8zQNCoeaN",
  "appleId": 1465259035,
  "episodes": [
    {
      "id": "480744a1-8003-4095-959f-54fc3ecda72a",
      "title": "Plymouth Brethren Christian Church members under investigation for alleged sexual abuse",
      "description": "In this episode, the team discusses the recent reports that have surfaced uncovering decades of alleged child sexual abuse within the Plymouth Brethren Christian Church.",
      "release": "2023-11-10T00:00:00",
      "duration": "00:18:57.5800000",
      "explicit": false,
      "spotifyId": "6v3Vyb6xV9HbBw3fVJ1x4f",
      "appleId": 1000634398248,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6v3Vyb6xV9HbBw3fVJ1x4f",
        "apple": "https://podcasts.apple.com/podcast/plymouth-brethren-christian-church-members-under-investigation/id1465259035?i=1000634398248"
      }
    },
    {
      "id": "c4ac213c-ce94-4d9f-bce8-07522b549057",
      "title": "Vicar barred from Church of England after failing to disclose husband’s abuse",
      "description": "This week, the abuse team discuss a recent headline in the BBC which discusses a vicar from Solihull who failed to disclose to the Church of England her husband\u0027s sexual abuse of children, which led to her being barred from the ministry.",
      "release": "2023-03-10T00:00:00",
      "duration": "00:24:03.7350000",
      "explicit": false,
      "spotifyId": "5fAOjrPuVIqOpdcmjAdu88",
      "appleId": 1000603601964,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5fAOjrPuVIqOpdcmjAdu88",
        "apple": "https://podcasts.apple.com/podcast/vicar-barred-from-church-of-england-after-failing-to/id1465259035?i=1000603601964"
      }
    },
    {
      "id": "b7d8d06f-7fbc-4b8e-bea5-5ba226ff49d7",
      "title": "The Jesus Fellowship Redress Scheme",
      "description": "This week Danielle and Kathleen discuss the Jesus Fellowship Redress Scheme, which was introduced on Monday the 26th of September. Applications are open until 31st December 2023 for victims to apply for compensation.",
      "release": "2022-09-30T00:00:00",
      "duration": "00:13:04.3780000",
      "explicit": false,
      "spotifyId": "2avB0cnqGTQIStLSlPficG",
      "appleId": 1000581161815,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2avB0cnqGTQIStLSlPficG",
        "apple": "https://podcasts.apple.com/podcast/the-jesus-fellowship-redress-scheme/id1465259035?i=1000581161815"
      }
    },
    {
      "id": "f682dee0-f66f-4af6-89d1-036fcef5002a",
      "title": "Child abuse within the Mormon church",
      "description": "Alan, Kathleen and Danielle discuss a recent headline in the Associated Press in the US involving sexual abuse in the Mormon Church.",
      "release": "2022-09-02T00:00:00",
      "duration": "00:12:49.6970000",
      "explicit": false,
      "spotifyId": "3sfKB6WKJ9Rj1T7EvfaSQ2",
      "appleId": 1000578161215,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sfKB6WKJ9Rj1T7EvfaSQ2",
        "apple": "https://podcasts.apple.com/podcast/child-abuse-within-the-mormon-church/id1465259035?i=1000578161215"
      }
    },
    {
      "id": "28774277-5f03-4f4f-877d-06fe75b426e1",
      "title": "Netflix –Keep Sweet: Pray and Obey",
      "description": "An untold story of Warren Jeffs Texas based religious closed community, the expose looked a bigamy, abuse and peadophilia. Leader of the Fundamentalist Church of Jesus Christ of Latter Day Saints.  He had been head of the church since 2002 and imprisoned in 2011. The documentary focused on the accounts of those who had left the cult and the impact on their lives. Warren had 78 wives in which 24 of these were under 17. One of the people featured in the documentary was married to Warren at 14.",
      "release": "2022-08-26T00:00:00",
      "duration": "00:17:11.0530000",
      "explicit": false,
      "spotifyId": "6qGsrqwTo8pDUfBiLoV9qT",
      "appleId": 1000577419372,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6qGsrqwTo8pDUfBiLoV9qT",
        "apple": "https://podcasts.apple.com/podcast/netflix-keep-sweet-pray-and-obey/id1465259035?i=1000577419372"
      }
    },
    {
      "id": "b347e64a-6cc4-4dae-8649-29d074c60af6",
      "title": "Pope Benedict Admits To Providing False Information To Abuse Inquiry",
      "description": "Former pope Benedict XVI of the Roman Catholic Church has admitted providing false information to the German inquiry into clerical sexual abuse. The report found Benedict whilst in his role of the Archbishop of Munich and Freising from 1977-1982 failed to take action against four priests accused of sexual abuse. Benedict stated initially he was not at a meeting in the 1980’s which discussed allegations of abuse and that it was deemed by him as an oversight. An investigation found he was in fact involved in such meeting and was aware of the allegations. This allowed the perpetrators in question to remain in their positions within the church without sanction or supervision. As Pope between 2005 and 2013, Benedict has previously come under fire for failing to act against widespread child sexual abuse within the Roman Catholic church and has repeatedly denied his role in knowingly covering up abuse, although in 2010 he admitted that the church “did not act quickly or firmly enough to take the necessary action”. A previous report into historical abuse in Germany concluded that more than 3,600 people nationwide had been abused by clergy members between 1946 and 2014. Many of the survivors were very young and served as altar boys. Again as with any reported figures, these numbers are likely to be the tip of the iceberg with many survivors not disclosing their abuse. The report, like many before them, is disappointing and once again demonstrates the failures of the church to protect those in the congregation. It will be very upsetting for many who could have been protected by the church. We encourage anyone who has concerns about sexual abuse to get in touch. You can contact Alan Collins at Alan.collins@hughjames.com or Danielle Vincent at  Danielle.vincent@hughjames.com.",
      "release": "2022-02-25T00:00:00",
      "duration": "00:06:02.3700000",
      "explicit": false,
      "spotifyId": "6jz4cF3erDIR1kH2hCeLuT",
      "appleId": 1000552236341,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6jz4cF3erDIR1kH2hCeLuT",
        "apple": "https://podcasts.apple.com/podcast/pope-benedict-admits-to-providing-false-information/id1465259035?i=1000552236341"
      }
    }
  ]
}