{
  "_ts": 0,
  "id": "fa09afe3-39fb-4e8f-b5b7-6752f456f60f",
  "name": "HolesForRabbits",
  "youTubeChannelId": "UCdcgI6ltpJMMPHqN0v-mWgg",
  "episodes": [
    {
      "id": "723d175f-b42e-4dfc-b9ec-9c0048684636",
      "title": "My Experience in a Cult | Growing up in, and leaving the Exclusive Brethren",
      "description": "I was born to a family who for many generations belonged to a religious cult or \u0022exclusive sect\u0022 as some may call it, called the Exclusive Brethren. They are more recently called the Plymouth Brethren Christian Church or PBCC. This is my story of growing up on the inside, and finding my freedom in leaving.\n\nApologies for the small amount of images and video from inside the cult. They are extremely secretive so there is not much to be found online, and I never thought of taking photos when I was inside.\n\nLinks:\nPBCC YouTube Channel: www.youtube.com/@plymouthbcc\n(Take the videos you see there with a grain of salt, they are pretty much for the purpose of maintaining their public image, but you can see more of what the people are like)\n\nChapters:\n00:00 - Intro\n03:15 - Chapter 1\n09:59 - Chapter 2\n21:17 - Chapter 3\n23:14 - Outro\n\nMusic Credits:\n\n\u0022Retribution\u0022 by Cold Cinema \nLink: https://www.youtube.com/watch?v=K7OvVuH-IlA\n\nSergePavkinMusic\n\n‘A Passing Era’\n‘Awareness of Infinity’\n‘Come Back Home’\n‘Emotional Feeling’\n‘Forever in My Heart’\n‘Goodbye Forever’\n‘Hypertime’\n‘Into Eternity’\n‘Lingering Rain’\n‘Prayer’ \n\nCopyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, commenting, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balances in favor of fair use.",
      "release": "2023-11-24T06:46:23Z",
      "duration": "00:25:14",
      "explicit": false,
      "youTubeId": "G7j1GlToKlk",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G7j1GlToKlk"
      }
    }
  ]
}