{
  "id": "b2e1cefd-e3d2-4943-a6fc-cfdad58f31c5",
  "name": "Holy Ghosting",
  "spotifyId": "4QASlHtEIdtCA93DpCmXFn",
  "appleId": 1627628186,
  "youTubeChannelId": "UCnb4FMBUy3N3PWuYSwTEu4g",
  "episodes": [
    {
      "id": "6d322d14-b462-4110-80f5-512e90455bf2",
      "title": "Resist Through Art: Comics as a Canvas for Change with Andrea Gilroy",
      "description": "From my first comic, the chick track, chit-trak, christ-trick?!?  The christian hell-comic given to children on halloween to scare them into submission to finding my way as an adult into fully embracing the comic world I\u0027d say I\u0027ve come a long way baby. The conversation with Andrea Gilroy is a gentle reminder that resistance is existence and living a good life is valuable too. \nIn an era where voices are silenced, and stories are censored, embracing and supporting spaces that offer uncensored narratives is more crucial than ever.\n\n* Artistic Resistance: Andrea shares her insights on how comics have historically challenged societal norms and offered a platform for collective power and identity expression. With her expertise in comics history, she delves into how these narratives confront binaries and foster world-building.\n\n* Comics and Community: Explore the role of local comic shops like Books with Pictures in creating safe communities and resisting censorship, especially in times when book banning is prevalent.\n\n* Saga’s Universe: We scratch the surface of the epic story of \u0022Saga,\u0022 a comic series that epitomizes the struggle for identity and belonging in a vast universe, mirroring our own challenges in society.",
      "release": "2025-03-10T00:20:00Z",
      "duration": "00:39:41",
      "explicit": false,
      "spotifyId": "54f5RcFETUE4gmzygCga87",
      "appleId": 1000698514758,
      "youTubeId": "dEqer2nrCfE",
      "urls": {
        "spotify": "https://open.spotify.com/episode/54f5RcFETUE4gmzygCga87",
        "apple": "https://podcasts.apple.com/podcast/resist-through-art-comics-as-a-canvas-for-change/id1627628186?i=1000698514758",
        "youtube": "https://www.youtube.com/watch?v=dEqer2nrCfE"
      }
    },
    {
      "id": "f7b90131-5403-47aa-8df6-c5d01700f8eb",
      "title": "Everyday Acts of Rebellion with Brit Koch",
      "description": "We welcome Brit Koch to Holy Ghosting. She is a native woman, wellness guide, and firm believer that rest is resistance and knowledge is power.\nhttps://britkoch.com/\n\nThe Power of Rest: Brit Koch breaks down why stepping back and resting isn\u0027t just beneficial; it\u0027s essential for sustaining our efforts in fighting against societal norms and injustices.\nKnowledge as a Tool: Learn how gaining knowledge empowers us to stand up and take action, making informed decisions that impact our communities and beyond.\nConnecting with Nature: Discover how engaging with the natural world can rejuvenate and ground us, offering a necessary respite and a source of strength in our activism.\nRespecting Indigenous Practices: A crucial conversation on how to honor and integrate indigenous wellness practices respectfully, avoiding cultural appropriation and supporting true cultural appreciation.\nMindful Consumption: Britt shares strategies on how to use our economic power to resist oppressive systems and support ethical, sustainable practices.\nCivic Engagement: Highlighting the importance of getting involved locally, Britt discusses how active participation in civic matters can drive change in public spaces and policies.\nCommunity and Connection: Learn about the importance of building and relying on a supportive community network to amplify our resistance efforts and protect our mental health.\n\n#rest, #resistance, #wellness, #knowledge, #indigenouspractices, #civicengagement, #culturalappropriation , #communitysupport , #decolonizingwellness, #self-care",
      "release": "2025-03-02T08:00:00Z",
      "duration": "00:43:08",
      "explicit": false,
      "spotifyId": "2myl4EKqDd7FqtD0UgGh2h",
      "appleId": 1000697119764,
      "youTubeId": "RozBpU6aoTY",
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2myl4EKqDd7FqtD0UgGh2h",
        "apple": "https://podcasts.apple.com/podcast/everyday-acts-of-rebellion-with-brit-koch/id1627628186?i=1000697119764",
        "youtube": "https://www.youtube.com/watch?v=RozBpU6aoTY"
      }
    },
    {
      "id": "4de3a9f0-aca8-4781-998b-a457a69d7dc9",
      "title": "the CULT of YWAM",
      "description": "To hear the full episode with listener stories check it out everywhere podcasts stream",
      "release": "2025-01-26T22:30:00Z",
      "duration": "00:19:36",
      "explicit": false,
      "youTubeId": "-W1eijqrEDY",
      "subjects": [
        "Youth with a Mission"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-W1eijqrEDY"
      }
    },
    {
      "id": "da99c3a7-8905-4c68-bee6-2d50bba7afba",
      "title": "Election Tensions: Managing Political Anxiety with Dr Laura Anderson",
      "description": "In this crucial episode, we’re joined by Dr. Laura Anderson to unravel the complex web of religious trauma and its intersection with political turbulence. We\u0027re adventuring into the realms of election anxiety, religious healing, and Christian nationalism, we discover challenges and pathways to personal empowerment and peace.\n\nWhat we\u0027re talking about this episode:\n\nElection Anxiety \u0026 Healing Trauma:How the current political climate exacerbates religious trauma and what it means for those caught at the intersection.\nThe Christian Nationalism Conundrum: We break down the long game of Christian nationalism and its profound impact on personal and societal boundaries.\nMastering Self-Care: Learn practical techniques for visualization, bodily awareness, and establishing emotional and physical boundaries, especially in tumultuous times.\nNavigating Family \u0026 Information Overload: Get insights on handling tricky family dynamics and shielding yourself from the chaos of constant news cycles.\nEmbracing Change and Lightness: Amidst serious discussions, we find moments of lightness and strategies to embrace ease and joy in everyday life.\n\n\nDr. Laura Anderson, author of When Religion Hurts You, and the Center for Trauma Resolution and Recovery have created the: Religious Trauma and the Elections Course: www.traumaresolutionandrecovery.com\nDirect Link Here: https://ctrr.podia.com/religious-trauma-and-the-election-cycle",
      "release": "2024-11-04T22:15:00Z",
      "duration": "01:00:10.7080000",
      "explicit": true,
      "spotifyId": "50fgqKqySfc5rtgFogrM6I",
      "appleId": 1000675681706,
      "youTubeId": "Jchjpdw3Z_I",
      "subjects": [
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/50fgqKqySfc5rtgFogrM6I",
        "apple": "https://podcasts.apple.com/podcast/election-tensions-managing-political-anxiety-with-dr/id1627628186?i=1000675681706",
        "youtube": "https://www.youtube.com/watch?v=Jchjpdw3Z_I"
      }
    },
    {
      "id": "8533fcda-2c4d-49ad-b562-e15236b64431",
      "title": "I Was Told The Simpsons Were Evil and other silly things with Kevin Garcia",
      "description": "\u0022More of Me, Less of Him: Making Space for Our Messy Human Selves After High Control Religion\u0022 - New Episode Out Now!\n\n🔥 A Journey of Self-Discovery: As we say our last goodbye to 2023, join us, your Holy Ghosting crew, in an episode that\u0027s more than just a podcast – it\u0027s a piece of our hearts. This is where we get real about our paths to self-discovery and the life-changing epiphanies we\u0027ve encountered along the way.\n\n💬 In This Episode:\n\nDive deep with us as we share our personal experiences of evolving beyond high control religious backgrounds.\nHear our stories of questioning, unlearning, and ultimately finding a more authentic connection with ourselves.\nWe talk about the struggles, the victories, and the sheer vulnerability of embracing our \u0027messy human selves.\u0027\n\n🌈 You Are Not Alone: This episode is for anyone who\u0027s ever felt the weight of expectation, the confusion of transition, or the beauty of finding their true self amidst the chaos. It\u0027s a testament to the strength found in vulnerability and the power of community.\n\n💌 Our Message to You: It\u0027s okay to be \u0027messy\u0027, it\u0027s okay to question, and it\u0027s okay to grow in ways you never expected. We\u0027re all in this together, exploring, learning, and supporting one another.\n\n🎧 Listen and Reflect: Join us in this intimate farewell to the year, and let\u0027s look forward to a future where we can all be more authentically us. Listen now on:\n\nSpotify: https://open.spotify.com/show/4QASlHtEIdtCA93DpCmXFn?si=a902d0376b1d4f74\nApple Podcasts: https://podcasts.apple.com/us/podcast/holy-ghosting/id1627628186\n\nJOIN our Facebook Group\nFollow Along on Patreon https://www.patreon.com/holyghosting\n👍 Like, Share, and Subscribe for more heartfelt, honest conversations about faith, identity, and finding your own path.\n\n#EmbracingSelf #LifeBeyondControl #HolyGhostingPodcast #SpiritualJourney #EndOfYearReflection\n\n\nChapters:\n\n00:00: Lindsay\u0027s Journey and Self-Discovery\n25:20: Sarai\u0027s Year of Shedding and Growth\n32:23: Meg\u0027s Exploration of Identity and Sexuality\n40:35: Navigating Personal Challenges\n41:15: Finding Your People\n42:13: Embracing Self-Acceptance\n43:35: Healing and Clearing Generational Trauma\n44:05: Accessing Personal Power\n45:25: Making New Mistakes\n46:23: Asking for Help and Receiving Support\n48:07: Humility and Growth\n49:34: Creating Inclusive Community\n50:52: Dreaming and Defining the Future\n52:30: Reflecting on Personal Growth\n58:13: Setting Boundaries and Honoring Limitations\n01:00:10: Shaping Personal Identity\n01:02:53: Being Authentic and Showing Up as Yourself\n01:04:20: Gratitude and Looking Forward\n01:07:19: Supporting the Podcast and Future Plans\n01:13:30: Celebrating Diversity and Queerness",
      "release": "2024-10-29T19:50:00Z",
      "duration": "01:05:42.1660000",
      "explicit": true,
      "spotifyId": "0tHXtJhU9HZaSgOvdkBNNT",
      "appleId": 1000674911782,
      "youTubeId": "6wrsaZXrRX0",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0tHXtJhU9HZaSgOvdkBNNT",
        "apple": "https://podcasts.apple.com/podcast/i-was-told-the-simpsons-were-evil-and-other-silly/id1627628186?i=1000674911782",
        "youtube": "https://www.youtube.com/watch?v=6wrsaZXrRX0"
      }
    },
    {
      "id": "80f71ba2-1f14-403c-ae31-fc10362b40e7",
      "title": "Whole Again! Embracing the Body from Separation to Integration",
      "description": "Welcome to Part 1 of our explosive series, \u0022The Cult of YWAM,\u0022 where we peel back the layers of Youth With A Mission’s complex and controversial practices. Join Lindsay, Meg, Sarai and their special guest, friend of the pod, sibling to a host, D.L. Mayfield as we delve into the heart of YWAM\u0027s cult-like aspects and the profound impact it continues to have on countless lives.\n\n\nOrigins and Operations: We kick things off with a look at YWAM\u0027s beginnings, exploring how what started with grand visions of global mission evolved into a sprawling organization with 1,100 locations worldwide, steeped in scandal and controversy.\nCult-Like Structures: Discover the cult-like tactics YWAM employs, from intense recruitment strategies targeting vulnerable youths to the infamous Plumline sessions where members confess sins in emotionally charged settings.\nDominionism and Control: We discuss YWAM’s dominionist ideology that seeks to infiltrate all societal spheres and the dangers such beliefs pose to individuals and communities.\nPersonal Stories: Hear firsthand accounts from those deeply affected by YWAM’s practices, including emotional manipulation, financial exploitation, and the struggle for personal freedom post-YWAM.\n\nWhy It Matters:\nThis series sheds light on the darker sides of a globally influential organization, highlighting the urgent need for accountability and reform. By sharing these stories, we aim to empower former members and educate potential recruits about the realities behind YWAM\u0027s mission facade.\n\nJoin the Conversation:\nHave you or someone you know been affected by YWAM? We encourage you to share your experience in the comments below. Your stories can help others feel less alone and contribute to a broader understanding of high-control groups. \n\nStay Tuned and make sure to subscribe and hit the bell icon to not miss the upcoming parts of this series, where we\u0027ll hear personal experiences from Ex-YWAMERs.\n\nSubscribe and Share:\nLike, subscribe, and share this video to help spread awareness about the realities of life inside YWAM and similar organizations. Your support makes a difference in continuing these important conversations.",
      "release": "2024-10-13T19:30:00Z",
      "duration": "01:10:27.3690000",
      "explicit": true,
      "spotifyId": "36huDzf8tlL8111CKu3PHJ",
      "appleId": 1000672943522,
      "youTubeId": "s6GrNZQ6UwU",
      "subjects": [
        "Youth with a Mission"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/36huDzf8tlL8111CKu3PHJ",
        "apple": "https://podcasts.apple.com/podcast/whole-again-embracing-the-body-from-separation-to/id1627628186?i=1000672943522",
        "youtube": "https://www.youtube.com/watch?v=s6GrNZQ6UwU"
      }
    },
    {
      "id": "49890cd5-99bd-4ab7-902c-7eec053a761b",
      "title": "We Stan A Woke Queen, Our Love Letter to Amy Grant",
      "description": "Hi Ghosties! What\u0027s your summer been like? Ours were wild! Your hosts, Lindsay, Meg and Sarai start this episode by sharing our summer experiences, personal growth and big news about the podcast. AND THEN!!!! Ekkk! We celebrate Amy Grant. We talk about her legacy and her influence on our lives, discussing our favorite album art, our desert island song and the controversies surrounding her divorce. We get into the scandal and the redemption of our favorite crossover pop star on the newest episode of Holy Ghosting",
      "release": "2024-09-29T07:00:00Z",
      "duration": "01:09:19.3750000",
      "explicit": true,
      "spotifyId": "1nS9jsnAWH9Vwk6RxfyoBz",
      "appleId": 1000671157539,
      "youTubeId": "l4wIZpopA5g",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1nS9jsnAWH9Vwk6RxfyoBz",
        "apple": "https://podcasts.apple.com/podcast/we-stan-a-woke-queen-our-love-letter-to-amy-grant/id1627628186?i=1000671157539",
        "youtube": "https://www.youtube.com/watch?v=l4wIZpopA5g"
      }
    },
    {
      "id": "498ba0e2-8f79-4e6b-a986-74b36b3374c3",
      "title": "It\u0027s Good To Feel Good: The Sexvangelicals Talk Sex \u0026 Purity Culture",
      "description": "Welcome, Ghosties! In this episode titled \u0022It\u0027s Good To Feel Good,\u0022 Julia and Jeremiah from the Sexvangelicals podcast join Meg \u0026 Sarai to discuss the journey from sexual repression to liberation. They shed light on how purity culture has influenced our views on intimacy and desire. The discussion covers personal stories and insights on reclaiming bodily autonomy, exploring pleasures without shame, and challenging conventional norms like monogamy.\n\nWe will explore the process of deconstructing religious beliefs about sex and how our guests have transformed from sexual repression to embracing joyful expression. The episode will also unravel the impact of shame and outdated gender roles that are often linked to high-control religions.\n\nWe will take a look at therapies like sensate focus, which can help us explore touch and intimacy without the pressure of performance, leading to a healthier connection with our bodies. Additionally, we will discuss why monogamy is often seen as the default and consider how expanding perspectives on relationships can lead to a more fulfilling sexual life.\n\nThe episode will conclude with insights on embodying pleasure, the therapeutic power of yoga, and creating a safe space for our souls within our bodies.\n\nSexual liberation and healing from trauma are not just topics; they are paths to deeper self-discovery and healthier relationships. Whether you\u0027re navigating these issues personally or are simply curious about the topic, there\u0027s something in this episode for everyone.\n\nYou can find the Sexvangelicals, Julia \u0026 Jeremiah, at https://www.sexvangelicals.com/.deconstruction, religious trauma, sexual repression, purity culture, reclaiming agency, unlearning, healthy relationships, desires, shame, gender scripts, sexual liberation, high control religion, consent, communication, healing, sensate focus, touch, pleasure, monogamy, sexual relationships, new agreements, embodiment, sexual liberation, long-term relationships, past experiences, #yoga #mindfulness #mindblown",
      "release": "2024-06-30T07:00:00Z",
      "duration": "01:16:05.7600000",
      "explicit": true,
      "spotifyId": "51wyceS9vIX2u8lDY5EqxT",
      "appleId": 1000660675085,
      "youTubeId": "aP1fZKLthZ0",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/51wyceS9vIX2u8lDY5EqxT",
        "apple": "https://podcasts.apple.com/podcast/its-good-to-feel-good-the-sexvangelicals-talk-sex/id1627628186?i=1000660675085",
        "youtube": "https://www.youtube.com/watch?v=aP1fZKLthZ0"
      }
    },
    {
      "id": "cdcaf0e1-19c8-4979-aae8-31470e4ccb20",
      "title": "We’re here. We’re queer. And we’re finally out! Our Late in Life Queer Stories",
      "description": "Have you ever known some hetero Christian married couple who were together a real long time and then one of them is like, “oops, I’m gay!” and they break up? A lot of us have known folks in this position. And we also remember the fallout and the “prayer chain” (read: gossip train) buzz when these woes befell our brethren. \n\nBy the way, is there such a thing as “sisthren?” or “siblingthren?” There should be. We digress. \n\nLong story short, this podcast is hosted by a sisthren of “oops, I’m gay!” women in their 40’s. Lindsay, Meg, and Sarai have all experienced different journeys in discovering, accepting, and embracing their queerness. In this episode, our Holy Ghosting triumvirate share the ways their paths wound from compulsory heteronormativity toward full awareness of their unique sexualities. \n\nIn this episode topics include feeling like imposters, finding acceptance and love in the LGBTQIA2S\u002B\u002B\u002B community, and navigating the aftermath of a lifetime of mandatory sexual repression. \n\nContent Warning: welp. These broads definitely talk a lot about LGBTQIA2s\u002B history including discussion of internalized homophobia, general homophobia as disseminated by the evangelical right wing from the 80’s until…um, right now, and honestly, the hosts are wont to talk about sexual trauma kind of a lot. Listen with care, and if it’s not an episode that feels good to you, take a beat and take good care of your beautiful human self.",
      "release": "2024-06-16T22:40:00Z",
      "duration": "00:45:53.6970000",
      "explicit": true,
      "spotifyId": "2VUx8JVTGt2xSiHmXv6Dh7",
      "appleId": 1000659200710,
      "youTubeId": "A2s2WhymQ2I",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2VUx8JVTGt2xSiHmXv6Dh7",
        "apple": "https://podcasts.apple.com/podcast/were-here-were-queer-and-were-finally-out-our-late-in/id1627628186?i=1000659200710",
        "youtube": "https://www.youtube.com/watch?v=A2s2WhymQ2I"
      }
    },
    {
      "id": "711b4ee9-99c6-4a61-9da3-0e520ded3846",
      "title": "The Cult of YWAM Pt. 4 Ghostie Stories",
      "description": "Explore the Intersection of Faith, Doubt, and Mental Health with Anna Gazmarian\n\nJoin Lindsay and Meg in a compelling new episode of Holy Ghosting as they delve into an intimate conversation with Anna Gazmarian, author of the touching memoir, Devout: A Memoir of Doubt. This episode takes us through Anna\u0027s personal narrative of spiritual and mental health challenges, offering insights into the complexities of religious OCD, depression, and the journey toward healing.\n\nContent Warning:\nThis discussion includes topics on suicide, depression, and dark thoughts. Listener discretion is advised. Please take care of your mental and emotional well-being as you listen.\n\nIn This Episode:\nChapters\n00:00  Introduction and Content Warning\n03:03  The Intersection of Faith and Mental Health Struggles\n10:39  The Challenges of Believing in God\n13:53  Navigating Faith and Parenting\n22:44  The Need for Therapy and Medication\n24:41  Challenging the Effectiveness of Christian Counseling\n26:02  The Ongoing Process of Deconstructing Faith\n28:25  The Need for Trauma-Informed Churches\n32:33  Finding God Outside of the Church\n44:42  Embracing Sorrow and Joy\n\nWe discuss the provocative idea of Jesus experiencing dark thoughts, challenging traditional views and opening a dialogue on the humanity within religious figures.\nThe Damage of Toxic Positivity: Discover how evangelical culture\u0027s focus on positive appearances can harm mental health, discouraging honest discussions about real struggles.\nChallenges of Religious Upbringing: Anna shares how growing up in a strict religious community impacted her understanding and acceptance of her bipolar disorder diagnosis, and the isolation that often accompanies such environments.\nThe Dangers of Ignoring Professional Help: We tackle the crucial topic of the church\u0027s inadequacy in dealing with mental health and the importance of seeking professional therapy and medication.\nCreating New Pathways for Support: Learn about the need for trauma-informed, supportive communities outside traditional religious settings and the importance of open conversations about mental health within these spaces.\nRedefining Joy and Self-Worth: Anna discusses how sorrow and joy can coexist and the journey towards embracing a multifaceted identity beyond mental illness.\nGet the Book:\nFor those looking to delve further into Anna’s experiences and insights, Devout: A Memoir of Doubt is available now. It’s a compelling read for anyone navigating the complexities of faith and mental health.\n\nhttps://bookshop.org/p/books/devout-a-memoir-of-doubt-anna-gazmarian/20165565\n\nWe Want to Hear from You:\nHow have your spiritual beliefs impacted your mental health journey? Share your thoughts and stories in the comments below. Your engagement helps build a community that supports and understands the depth of these issues.\n\n👍 Support Our Channel: Like, subscribe, and share to help us continue bringing these vital conversations to light. Your support enables us to explore these deep and often challenging topics.\n\nThank you for joining us in this important discussion. Your presence here makes a difference in broadening the conversation and breaking down stigmas.\n\n#faithjourney  #mentalhealth  #healing  #evangelicalism, #anxiety #depression #OCD #suicidalthoughts  #ideations #therapy #medication #deconstruction #church #support #traumainformed #pastor #suffering #Christianity #community  #identity",
      "release": "2024-06-13T23:00:00Z",
      "duration": "00:49:55.4160000",
      "explicit": true,
      "spotifyId": "6Pkw9JUURh6KF9B7BJZbSj",
      "appleId": 1000658964575,
      "youTubeId": "KQtiy2aDqkI",
      "subjects": [
        "Youth with a Mission"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Pkw9JUURh6KF9B7BJZbSj",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-ywam-pt-4-ghostie-stories/id1627628186?i=1000658964575",
        "youtube": "https://www.youtube.com/watch?v=KQtiy2aDqkI"
      }
    },
    {
      "id": "6176d635-d10a-4be1-9efa-82417a2ed147",
      "title": "The Cult of YWAM Part 3: Navigating the Seas of Deconstruction with Karen Alea",
      "description": "👻🎙️ Join us for a riveting conversation as Deconversion Therapy meets Holy Ghosting to unravel the intricate narratives surrounding Youth With A Mission (YWAM) and the challenges we faced as young YWAMers. \n\nUnmasking YWAM: We\u0027re jumping back into the world of YWAM with Karen Alea from Deconversion Therapy, exploring its cult-like structures, and the magnetic allure of missionary adventures.\nIntellectual Battles: We tackle the tensions between faith and reason, discussing how intellectual skepticism is often demonized in evangelical circles, shaping beliefs and behaviors.\nLaughter and Lightness: Discover how humor serves as a crucial tool in coping with and discussing the profound issues of religious deconstruction and intellectual freedom.\n\nWhy Watch?\n\nInsightful Discussions: Get unique perspectives from leading femme voices in the realm of spiritual questioning and religious satire.\n\nChallenging Ideas: Explore how intellectualism and critical thinking clash with established religious doctrines, inviting you to think critically about your own beliefs.\n\nCommunity and Support: Join a community that values questioning, humor, and candid discussions about the often-taboo aspects of religion and faith.\n\n👻 Engage With Us: Have you experienced similar challenges in your journey of faith and intellect? Share your story in the comments below. We love hearing from our viewers and building a supportive dialogue around these pivotal topics.\n\n👍 Like, Share, and Subscribe: Enjoying the discussion? Hit like, share this video with friends, and subscribe to our channel for more enlightening conversations and explorations into the complex world of faith, skepticism, and everything in between.\n\nThank you for tuning in, and let’s keep the conversation going!",
      "release": "2024-05-26T07:00:00Z",
      "duration": "01:10:07.7510000",
      "explicit": true,
      "spotifyId": "7hMaLsrsO1VdoSjjBC04Nq",
      "appleId": 1000656780357,
      "youTubeId": "xyUkQamR_sQ",
      "subjects": [
        "Youth with a Mission"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7hMaLsrsO1VdoSjjBC04Nq",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-ywam-part-3-navigating-the/id1627628186?i=1000656780357",
        "youtube": "https://www.youtube.com/watch?v=xyUkQamR_sQ"
      }
    },
    {
      "id": "e358d2c7-9561-47c5-8352-7d8e2ac990e5",
      "title": "Unveiling Shadows: Challenging Stigmas and Seeking Healing Beyond the Church with Anna Gazmarian",
      "description": "It\u0027s Part 2! Jump into the bizarre world of Youth With A Mission with Lindsay, Meg, and Sarai in this explosive episode of Holy Ghosting! Join us as we peel back the layers of YWAM\u0027s intense culture, strict rules, and the wild things young folks do in the name of the Lord.\n\nWhat\u0027s Inside:\n\nMeg’s YWAM Journey: From her days down under in Australia to challenging missions in Africa, Meg opens up about her time with YWAM. Hear about her deep friendship with a guy she calls \u0022J\u0022 and how it was scrutinized by the powers that be within YWAM\u0027s leadership.\nChallenging the System: Meg recounts a disturbing incident of physical assault and the shockingly inadequate response from YWAM leadership. We delve into the serious issues of lack of proper education, resources, and the often dehumanizing treatment of individuals within the organization.\nExploitation Unveiled: Discover how YWAM exploits traumatic experiences for fundraising purposes, turning personal pain into promotional material.\nPower of Voice: This conversation is a rallying cry for trusting oneself, speaking up against questionable religious authority, and the sheer importance of deconstruction for those entangled in high-control religious settings.\nComing Up: Stay tuned for Part Three of our series, where we\u0027ll feature stories from our listeners who\u0027ve had their own encounters with YWAM. The truths get deeper and the tales get even wilder!\n\n🔗 Watch, Listen, Reflect: Whether you’re questioning, leaving, or just curious about high-control religious groups like YWAM, this episode is packed with raw insights and eye-opening revelations. Don’t miss out on this deep dive into the reality behind the mission trips and the so-called spiritual leadership.\n\n👉 Engage with Us: After watching, we want to hear from you! Drop a comment below, share your thoughts, or send us your own YWAM stories. Your voice matters and can help others feel less alone in their journeys.\n\nSubscribe and Join the Ghostie Community: For more unfiltered discussions, insider stories, and our unique take on everything from missions to misadventures, make sure to subscribe to our channel. Your support helps us keep these important conversations going. \n\n\n\n\n#YWAM #Deconstruction #ReligiousDeconstruction #HolyGhosting #MissionsGoneMad #deconstruction  #podcast #young people, #crazythings #friendship #rules #scrutiny #DTS, #mission, young women after men, young wolves after maidens, Youth With A Mission, physical assault, inadequate response, #education, #resources, #dehumanizing treatment, #exploitation, #trauma, #fundraising, #speakingup, #trust oneself, religious leadership",
      "release": "2024-05-13T15:55:33Z",
      "duration": "00:51:54.1870000",
      "explicit": true,
      "spotifyId": "6KKgyaSrQXfuUForjZn6ts",
      "appleId": 1000655439507,
      "youTubeId": "se6ypfbOhQI",
      "subjects": [
        "Youth with a Mission"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KKgyaSrQXfuUForjZn6ts",
        "apple": "https://podcasts.apple.com/podcast/unveiling-shadows-challenging-stigmas-and-seeking/id1627628186?i=1000655439507",
        "youtube": "https://www.youtube.com/watch?v=se6ypfbOhQI"
      }
    },
    {
      "id": "49926fa7-0a74-46f4-a752-0afba6f95a6a",
      "title": "The Cult of YWAM Part 2: Meg\u0027s Horror Story",
      "description": "Season 1 | Episode 2\n\nWhat does one do with the conundrum of abortion? When Lindsay, Meg, and Sarai were growing up, the Evangelical Christian stance on abortion was never, ever, no way, no how. The church made specious (and racist, xenophobic, peri-holocaust denying or at best minimizing) arguments meant to tug at the heartstrings of nice, Christian, white ladies. Present-day: billboards litter the interstates of America, showing bright-eyed (almost exclusively white) babies with ominous words like “abortion stops a beating heart” emblazoned across their tidily diapered butts; pro-choice and pro-life people don’t even speak the same language much less know how to fight in the same battle; and the powers that be have successfully edged Roe v Wade toward the dustbin of history. \n\nEnter some deconstructing, young former Evangelicals (one of whom shamefully admitted she voted for George W. Bush…TWICE) and they start to ask questions about this once untouchable medical procedure. Your 40-ish mom friends talk through the taboo tornado of purity culture (patriarchy), Nice Christian White Ladies (white supremacy), and hit action movies from bygone decades, oh and abortion...all while we realize it was never really about the babies…and Evangelicals didn’t give any toots about abortion until, like, a year or two before our hosts were all born. How would we have known when we were standing on the streets in our respective hometowns begging people to just realize that life begins at conception (but where does conception begin? Oh…I think we’re in an inception now)…anyway…give it a listen! And join the conversation with us at HolyGhosting.com\n\nIf you or someone you know needs abortion healthcare call the NAF Hotline at 1-800-772-9100 for help and to learn about safe options for ending a pregnancy.\n\nTikTok @holyghosting\nInstagram \u0026 Twitter @holyghostingpod",
      "release": "2024-04-29T05:00:00Z",
      "duration": "00:53:58.4520000",
      "explicit": true,
      "spotifyId": "5dRn7083cIUy6Mtlic8n7H",
      "appleId": 1000653872733,
      "youTubeId": "rMILmB7QvpM",
      "subjects": [
        "Youth with a Mission"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5dRn7083cIUy6Mtlic8n7H",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-ywam-part-2-megs-horror-story/id1627628186?i=1000653872733",
        "youtube": "https://www.youtube.com/watch?v=rMILmB7QvpM"
      }
    },
    {
      "id": "f1426d59-a03d-4e21-82b4-52810069e7a7",
      "title": "The Cult of YWAM Part 1 with DL Mayfield",
      "description": "In this episode, we dive into the not-so-wonderful world of Youth With a Mission, aka YWAM. We chat with our pal (and Lindsay’s sister), D.L. Mayfield about the history and horrors of the cult-like organization that began with one white guy\u0027s vision of young people sweeping the globe for Jesus. (Totally not creepy, right?) Fast forward a few decades and YWAM is one of the largest missions organizations on the planet, with 1100 locations in 180\u0026#43; countries and over 18,000 (unpaid!) staff. It should come as no surprise to our listeners that YWAM is super problematic.. We get into all the cultiest aspects of this organization - from their Discipleship Training School to the forced trauma bonding that they call “Plumbline”. YWAM’s entire model is recruiting young people - before their prefrontal cortexes are fully formed - and they make it VERY hard to leave. If you do manage to escape the cult of YWAM, chances are you’ll be left with zero real-life skills with a side of religious trauma. We’ll be back in a few weeks with a part 2 where we hear from friends and listeners about their about their firsthand encounters with YWAM. (Spoiler alert: the reviews aren\u0027t exactly glowing.) Links -Check out DL and Krispin Mayfield’s brand new project, Strong Willed (all about recovering from religious authoritarian parenting) - -DL Mayfield on Instagram - @d_l_mayfield -Tiktok - @dlmayfield Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-04-14T07:00:00Z",
      "duration": "01:11:43.6080000",
      "explicit": true,
      "spotifyId": "2jUcLgVtXNn9DlxvMmsNFn",
      "appleId": 1000652397914,
      "subjects": [
        "Youth with a Mission"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2jUcLgVtXNn9DlxvMmsNFn",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-ywam-part-1-with-dl-mayfield/id1627628186?i=1000652397914"
      }
    },
    {
      "id": "0f52bd4c-1b45-4568-b20a-33890f61a95d",
      "title": "Pure or Lure: How to NOT Cause a Guy to Stumble in Ten Thousand Easy Steps",
      "description": "In our latest episode we jump into the turbulent waters of gendered messages and purity culture with a critical eye on the Christian advice book, \u0027For Young Women Only\u0027—or as we like to call it, “How to NOT Cause a Guy to Stumble.” Published in the early 2000s, this book perpetuates harmful beliefs about gender, sexuality, and the role of women in the church, echoing through youth groups and beyond. We dissect the enforced performance of masculinity, the unjust objectification of women\u0027s bodies, and the dangerous overlap of rape and purity cultures that unjustly places blame on women. Our discussion goes deeper, challenging the control exerted over thoughts and visuals, the male gaze, and the relentless standards set by modesty teachings and visual temptations, all underscored by eyebrow-raising survey results from teenage boys. This episode is an unflinching conversation about the impacts of sexual assault and harassment, underscoring the urgent need for autonomy, consent education, and a seismic shift in attitudes toward women\u0027s bodies and choices. Get ready, Ghosties, to break free from the shackles of high-control religion. It\u0027s time to unravel the mess, advocate for bodily autonomy, and maybe, just maybe, start healing. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-03-26T22:00:00Z",
      "duration": "01:06:23.5910000",
      "explicit": true,
      "spotifyId": "6TqDMxEmJfSZOK0ygEEjVA",
      "appleId": 1000650537991,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6TqDMxEmJfSZOK0ygEEjVA",
        "apple": "https://podcasts.apple.com/podcast/pure-or-lure-how-to-not-cause-a-guy-to-stumble-in/id1627628186?i=1000650537991"
      }
    },
    {
      "id": "1a94bdc2-bac3-4915-b2e8-d57c745f07ea",
      "title": "Hi, I’m the Problem, It’s Me:  Savior Complex \u0026 the White Woman Problem (Recap Pt.2)",
      "description": "What happens when a homeschooled horse girl feels “god put Africa on her heart?” Well. It could be a lot of things. In fact, your own fave Ghostie Hostie, Lindsay, was exactly this kind of girlie. And yet! Just as two paths diverge in a yellow wood, so do our choices take us to different places. Lindsay, for one, went on a medical mission to Uganda, wore scrubs, and - shockingly - didn’t perform a single medical intervention that would require training, certification, or licensure. For Renee Bach, the white missionary who is the subject of Savior Complex an HBO Original Documentary Series, she chose a path (hopefully) less taken and went full speed ahead providing services that were way beyond her training and competency - with dire results. Join your thrilling throuple, Lindsay, Meg, and Sarai, as they discuss the second half of the Max docuseries, Savior Complex. Listen to Part One of our Recap Here They get down and dirty into the accusations surrounding Renee as No White Saviors picks up momentum online, talk a whole load of shit about Renee’s doting mother, Laurie Bach, and wrestle with the centering of white voices and behaviors that are rife within this story (including ours!) While it’s useful, at times, to wrap our minds around something by defaulting to narratives with good guys and bad guys (or…good homeschool horse girls vs bad ones?), real life is much more complicated than all that. What we end up with is a very gray story with a lot of problematic white women centering themselves in it. Which you can hear more of while your ghostie hosts do a little of that too, hopefully in a helpful way. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-03-03T08:00:00Z",
      "duration": "01:12:15.0200000",
      "explicit": true,
      "spotifyId": "1IkFJEOrZSkIzwc5ycX7QJ",
      "appleId": 1000647811802,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IkFJEOrZSkIzwc5ycX7QJ",
        "apple": "https://podcasts.apple.com/podcast/hi-im-the-problem-its-me-savior-complex-the-white/id1627628186?i=1000647811802"
      }
    },
    {
      "id": "7da482a8-85cd-4e6f-918e-3be40e92fc67",
      "title": "Maybe God SHOULD Call the Qualified: Our Review of Savior Complex Part One",
      "description": "Your Holy Ghosting Hosts are LIVE! \n\n🎉 Welcome to Our First Ever \u0022High Times With the Most High\u0022 Livestream!\n\n👋 Hello Ghosties! This is your chance to ask us anything, spark up a conversation, or just enjoy the banter!\n\nWhat’s Happening?\n\nYour Questions Answered: Got something on your mind? Send us your questions! From the serious to the silly, we’re ready to tackle them all.\nLive Interaction: Jump into the chat and let\u0027s make this discussion lively! Expect a mix of insights, unexpected moments, and genuine laughter.\nExpect the Unexpected: Live sessions are unpredictable—anything can happen, and that’s half the fun!\n\nWhy Watch?\n\nChill With Us: What better way to spend some time than hanging out with your favorite podcast hosts live?\nLaughs and Learning: We\u0027re here to mix entertainment with enlightenment. Who says you can\u0027t have a good time while getting deep?\nYour Influence: This show thrives on your input. Help guide our discussion and make your voice heard!\n\nGet Involved:\n\nJoin the Live Chat: We’re here, we’re live, and we want to hear from you. This is real-time interaction at its best.\nStay Respectful: Let’s keep the chat cool and constructive. We’re all here to have a good time.\nSubscribe for More:\nEnjoying the live session? Subscribe to our channel to not miss out on our future antics, advice, and whatever else we come up with. Your support helps us keep this going!\n\n👍 Like, Share, and Subscribe: Spread the word about our community. The more, the merrier!\n\nThanks for Joining:\nYour participation makes these live sessions incredibly special. Let’s make this one unforgettable!",
      "release": "2024-02-20T04:00:00Z",
      "duration": "01:01:49.5180000",
      "explicit": true,
      "spotifyId": "70ycXZYsU72AtCR4Lv6q8t",
      "appleId": 1000645947304,
      "youTubeId": "5uypatW-vpk",
      "urls": {
        "spotify": "https://open.spotify.com/episode/70ycXZYsU72AtCR4Lv6q8t",
        "apple": "https://podcasts.apple.com/podcast/maybe-god-should-call-the-qualified-our-review-of/id1627628186?i=1000645947304",
        "youtube": "https://www.youtube.com/watch?v=5uypatW-vpk"
      }
    },
    {
      "id": "ecc564a0-8451-45bb-879b-dc3992d1cbe3",
      "title": "The Five Love Languages are Garbage \u0026 Other Spicy Takes with Crystal Britt",
      "description": "In this episode, Meg and Lindsay chat with Crystal Britt, a licensed clinical social worker and actual therapist about the famed book, ‘The Five Love Languages: The Secret to Love that Lasts’ by pastor (NOT therapist) Gary Chapman. We talk about how the Five Love Languages are reductive, gendered, and heteronormative and how there are many better resources for communication in relationships. Christians especially love this read and recommend the Five Love Languages as if the Lord himself wrote this book. Why is that? Welp, we get into it with the lovely Crystal Britt throughout this episode. (Spoiler alert: it’s the misogyny.) Follow Crystal Everywhere@itscrystalbritt Podcast: Time To Lean Recommended: Bell Hooks: All About Love The Gottman\u0027s: 7 Principles for Making a Marriage Work Dr. Rachel Vanderbuilt on TikTok - Queer Focus Dr. Stan Tatkin: Wired For Love Emily Nagoski, Ph.D.: Come As You Are \u0026 Come Together Jessica Fern: Polysecure: Attachment, Trauma and Consensual Nonmonogamy Marisa G. Franco PhD: Platonic: How the Science of Attachment Can Help You Make--and Keep--Friends Fresh Starts Registry - A resource place to share your post-divorce needs Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-02-11T08:00:00Z",
      "duration": "01:04:53.4200000",
      "explicit": true,
      "spotifyId": "0joIvK16XgDsZ5hUEHkX0T",
      "appleId": 1000644915598,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0joIvK16XgDsZ5hUEHkX0T",
        "apple": "https://podcasts.apple.com/podcast/the-five-love-languages-are-garbage-other-spicy-takes/id1627628186?i=1000644915598"
      }
    },
    {
      "id": "6f86e2cc-19a7-4423-9247-9c72922426dd",
      "title": "Less of Them, More of Me: Taking Our Power Back with Meredith Holley",
      "description": "Have you ever felt like you didn\u0027t have a voice? Or that you didn\u0027t feel safe to talk about your needs or interests in your relationships, workplaces, your home -- uh, church, maybe? Well, today your favorite Apostolic Apostates, Lindsay, Meg, and Sarai join forces with Meredith Holley of Eris Resolution to dig into the basics of Empowered Communication. Learn how to find your voice, how high control religion taught us disempowered communication strategies, and get ready for some juicy gossip about how Meredith\u0027s first betrothal (at the age of 7) worked out. Meredith is the cohost of The Empowered Communication Podcast, which focuses primarily on workplace communication. Meredith was also a civil rights litigator, expert shit talker, and - Oh! Also? This woman was raised in a cult, so she knows a thing or two about how to find yourself and speak your truth after high control religion. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2024-01-21T07:55:00Z",
      "duration": "01:09:38.2330000",
      "explicit": true,
      "spotifyId": "5ybFHYCe2SdaECENVOQ7q3",
      "appleId": 1000642364648,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ybFHYCe2SdaECENVOQ7q3",
        "apple": "https://podcasts.apple.com/podcast/less-of-them-more-of-me-taking-our-power-back/id1627628186?i=1000642364648"
      }
    },
    {
      "id": "cdfd3272-da33-47ea-be3c-99aaf9a43d4f",
      "title": "Best Of: Losing My Religion with DL Mayfield",
      "description": "Deconversion, Neurodiversity, Healing Beyond Evangelicalism\n\nJoin us for an update since last Spring when this Best Of episode was first recorded and then stay tuned for the enlightening episode of Holy Ghosting, featuring DL Mayfield\u0027s impactful journey through identity shifts, neurodiversity, and spiritual exploration.\n\n🌟 In This Episode:\n\nExploring Identity: Join us as DL Mayfield delves into their transformative experience of coming out as non-binary and journeying through deconversion from Christianity. It\u0027s a powerful narrative that challenges and inspires.\nAutism and Spirituality: Discover how DL\u0027s diagnosis with autism has provided unique insights into their view of religion and spirituality, reshaping their understanding of self and faith.\nBreaking Free from Evangelicalism: We explore the lingering effects of evangelical upbringing, its impact on emotional growth, and the liberation found in stepping away and redefining one\u0027s beliefs.\nThe Path to Deconversion: DL shares their personal journey of questioning and leaving behind religious indoctrination, embracing autonomy, and creating a new, self-defined path.\nHealing from Religious Trauma: Engage in a candid discussion about the challenges of healing from religious trauma, including its influence on parenting and breaking generational cycles.\nMusic and Freedom: Experience the cathartic power of music in DL\u0027s life as a tool for releasing religious conditioning and finding liberation.\n💬 Key Takeaways:\n\nEmbracing identity shifts can profoundly alter one\u0027s worldview and spiritual path.\nUnderstanding and accepting neurodivergence can lead to profound self-discovery and healing.\nThe journey away from religious indoctrination is deeply personal, demanding introspection, patience, and courage.\nHealing from religious trauma is an essential, ongoing process for personal and generational well-being.\nMusic serves as a powerful conduit for personal freedom and emotional release.\n👂 Listen and Reflect: This episode invites you to ponder your own journey, embrace your true self, and find comfort in shared experiences of growth and recovery.\n\n🔗 Join Us on Patreon: For more intimate discussions and exclusive content, follow us on Patreon: Holy Ghosting on Patreon\n\n👍 Like, Share, and Subscribe for more episodes where we explore the intersections of faith, identity, and the path to healing after high control religion.\n\n#DLMayfield #Deconversion #Neurodiversity #HolyGhostingPodcast #SpiritualJourney #ReligiousTrauma #HealingAndGrowth",
      "release": "2024-01-08T03:44:00Z",
      "duration": "01:20:13.9200000",
      "explicit": true,
      "spotifyId": "7hA4P1Ul3KkCVlU3ltTSPo",
      "appleId": 1000640854058,
      "youTubeId": "rP7RphJmZsw",
      "subjects": [
        "Evangelicalism",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7hA4P1Ul3KkCVlU3ltTSPo",
        "apple": "https://podcasts.apple.com/podcast/best-of-losing-my-religion-with-dl-mayfield/id1627628186?i=1000640854058",
        "youtube": "https://www.youtube.com/watch?v=rP7RphJmZsw"
      }
    },
    {
      "id": "7ab4ed61-a03f-48b7-a152-617c5d849e13",
      "title": "More of Me, Less of Him: Making Space for Our Messy Human Selves After High Control Religion",
      "description": "What happens when you\u0027re deconstructing with your middle-aged mom friends...and you get to a point where you\u0027re like, cool, I\u0027m no longer a part of this religion, but how do I live now? Short answer: Howsoever you fucking want; but more specifically, it\u0027s something you get to work out with fear and trembling, just like you probably did with your own salvation. Join your fave apostates as they discuss what this strange post-pandemic peri-apocalyptic year has wrought - at least at a micro-level. \u0026#x1f50d; Lindsay\u0027s Leap: From the tangled threads of faith, Lindsay\u0027s been unraveling a spirituality that\u0027s as authentic as her favorite pair of jeans. Spoiler: It\u0027s a perfect fit. \u0026#x1f308; Sarai\u0027s Shift: Breaking free from a long-term relationship, Sarai embraced her full, fabulous queerness. It\u0027s a story of transformation, glitter, and growing into her own. \u0026#x1f4ab; Meg\u0027s Metamorphosis: God, the universe, and everything in between - Meg\u0027s been reshaping her beliefs and sexuality into a mosaic that\u0027s uniquely hers. Be it laughter or lamentation, your hosts unwrap the lessons learned, hopes for the future, and the reality that sometimes...it\u0027s just gonna be dark for a while, even while you\u0027re living into your fullest, biggest self. Dare to jump into the fray and reflect on the places you\u0027ve been this year - and where you hope to walk in the coming journey around the sun. If you\u0027re anything like the Unholy Trinity (Lindsay, Meg, and Sarai), you might have occasion to peel back layers on healing generational trauma, tap into your own power, and maybe even learning how and when to ask for help. Join with all Ghosties everywhere to co-create an inclusive community, dreaming up vibrant futures, and setting those oh-so-important boundaries. Let\u0027s celebrate the journey of being wonderfully, messily human together. #SelfDiscovery #FaithJourney #QueerPride #GenerationalHealing #HolyGhostingPodcast Support Here Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-12-24T16:55:00Z",
      "duration": "01:05:15.3890000",
      "explicit": true,
      "spotifyId": "5yJErlCU65cGAHVeffSXvz",
      "appleId": 1000639597246,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5yJErlCU65cGAHVeffSXvz",
        "apple": "https://podcasts.apple.com/podcast/more-of-me-less-of-him-making-space-for-our-messy/id1627628186?i=1000639597246"
      }
    },
    {
      "id": "70626e47-0b2f-4f74-b7ad-6c3f2f39a362",
      "title": "War On Xmas with the Original Sinfluencer",
      "description": "Deck the halls and dive into the debate! In this festive episode of the Holy Ghosting Podcast, we\u0027re unraveling the knotted Christmas lights of controversy. It\u0027s not just about silver bells and Santa – there\u0027s a whole history behind the \u0027Happy Holidays\u0027 hullabaloo.\n\nJoin your Bible Busting Besties – Lindsay, Meg, and Sarai – along with our special guest, the myth, the man, the legend: The Original Sinfluencer, Joshua Colburn. This delightful hangout is more than just merry musings; we\u0027re delving deep into who really canceled Christmas (Hint: Thanks, Puritans!) and discussing why certain media figures might just be Evangelical Christianity\u0027s unofficial saints.\n\nBut wait, there\u0027s myrrh! We\u0027re also dishing out a taste of post-Evangelical holiday tunes. Perfect for anyone who\u0027s ever felt like they\u0027re living in a Christmas carol written by Charles Dickens and directed by Tim Burton.\n\n🔊 Listen to the full episode on:\nSpotify https://open.spotify.com/show/4QASlHtEIdtCA93DpCmXFn?si=a902d0376b1d4f74\u0026nd=1\u0026dlsi=f348ff9615d34ece\n\nApple Podcasts https://podcasts.apple.com/us/podcast/holy-ghosting/id1627628186\n\n💬 We\u0027re peeling back layers of the festive season like never before. So, whether you\u0027re all about that Yuletide cheer or find yourself more of a Scrooge, this episode has something for everyone. Tune in, get cozy, and let\u0027s explore the War on Xmas together!\n\n👍 Don\u0027t forget to Like, Share, and Subscribe for more episodes where we explore the quirkier sides of faith, culture, and everything in between.\n\nChapters\n00:00\nIntroduction and Draft Setup\n02:53\nNostalgic Favorites\n08:27\nSongs to Wipe Off the Face of the Earth\n13:49\nChristmas Karaoke Jams\n17:13\nWild Card Picks\n21:19\nAdditional Wild Card Picks\n29:00\nConclusion\n\n#WarOnXmas #HolyGhostingPodcast #ChristmasControversy #PostEvangelical #HolidayDebate",
      "release": "2023-12-10T08:00:00Z",
      "duration": "01:02:45.2630000",
      "explicit": true,
      "spotifyId": "4bbmJUPGPyKSxkqyOkD938",
      "appleId": 1000638072740,
      "youTubeId": "F22b_Mjisi8",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4bbmJUPGPyKSxkqyOkD938",
        "apple": "https://podcasts.apple.com/podcast/war-on-xmas-with-the-original-sinfluencer/id1627628186?i=1000638072740",
        "youtube": "https://www.youtube.com/watch?v=F22b_Mjisi8"
      }
    },
    {
      "id": "cef1f9a8-3c26-4182-bf9a-304ed317d8c9",
      "title": "What Would Jesus Buy?",
      "description": "In honor of Black Friday, Cyber Monday, and All the Buying Things Days from now until approximately December 25th, your Queen Ghosties, Lindsay, Meg, \u0026 Sarai bring you a deep dive into all things Christian bookstores, products, and marketing. They also take a perplexing look at why Christians are such brilliant capitalists whilst claiming they follow a broke carpenter who, apparently, \u0022never asked for a raise\u0022 (listen if you want to be extra grossed out by what this actually means). Bottom line: we get into what we thought and bought as young Christian babes. Hear how Lindsay worked in not one, but TWO Christian bookstores. Learn how Sarai does real time podcast research to confirm her suspicions that the White Jesus Gets Us (erm, \u0022He Gets Us\u0022) ad campaign has something to do with politics (shockingly, it does!)...and enjoy as Meg reveals her strange and wonderful journey from coveter of \u0022the hottest Bibles\u0022 to Christian Bookstore-eschewing crone. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-11-26T08:00:00Z",
      "duration": "00:45:00.4340000",
      "explicit": true,
      "spotifyId": "1UrlSAv44esAKy9YXVPltP",
      "appleId": 1000636531949,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1UrlSAv44esAKy9YXVPltP",
        "apple": "https://podcasts.apple.com/podcast/what-would-jesus-buy/id1627628186?i=1000636531949"
      }
    },
    {
      "id": "0b286b8b-f204-4e65-afdd-294ccf7843cc",
      "title": "No, Mom, That’s Not How Boundaries Work and Other Fun Tips with Dr. Laura Anderson to Survive the Holidays With Your Family",
      "description": "🦃🎄✨ Turkey, Tinsel, and Trauma: Navigating the Holiday Horror with Dr. Laura Anderson ✨🎄🦃\n\nThe holiday season can be a time of joy and celebration, but it can also bring up complex feelings and challenges, especially for those deconstructing their religious beliefs and experiences. In this enlightening conversation with Dr. Laura Anderson, we dive deep into the nuances of navigating the holidays while dealing with the aftermath of being raised in a Christian evangelical environment.\n\nIn this episode, we explore:\n\nHow to set healthy boundaries with family members who may not understand your journey.\nTips for managing holiday-related triggers and stress.\nSetting boundaries is essential for protecting your own well-being and peace during family gatherings.\nBoundaries are for you, not for anyone else, and it is important to recognize the difference between boundaries and suggestions.\nUnderstanding codependency and trauma responses can help in navigating family dynamics and setting healthier boundaries.\nCreating a safe space in your own home is crucial for your own mental and emotional well-being.\nAsserting boundaries and prioritizing your own beliefs and values is important, even if it may lead to discomfort or conflict with family members.\nWays to find joy and create new traditions that align with your current beliefs and values.\n\nWhether you\u0027re in the midst of deconstructing your faith, seeking to understand your religious trauma, or just looking for ways to navigate the holiday season with more ease, this conversation is for you.\n\nJoin us as we discuss \u0027Turkey, Tinsel, and Trauma,\u0027 and share your experiences and thoughts in the comments below. We\u0027re here to support each other through this journey.\n\n👉 Don\u0027t forget to Like, Share, and Subscribe for more content like this!\n\n#Deconstruction #ReligiousTrauma #ExEvangelical #HolidayStress #MentalHealth #FaithJourney #SpiritualHealing #FamilyBoundaries #CreatingNewTraditions #NavigatingHolidays #DrLauraAnderson #DeconstructingFaith\n#HolidayCoping #mentalhealthawareness  #spiritualhealing \n#boundaries  #familydynamics \n#ChristianDeconstruction #SurvivingTheHolidays #NavigatingTrauma #HolidayStress #MindfulnessDuringHolidays\n\nChapters\n03:01  Navigating Family Dynamics During the Holidays\n10:59  Setting Boundaries and Dealing with Family Reactions\n21:08  Understanding Codependency and Trauma Responses\n37:36  Creating a Safe Space in Your Home\n49:11  Asserting Boundaries in Your Own Space\n01:02:47  Trusting Yourself\n01:08:24  Healing Starts with You\n01:09:10  Living in a Healing Body\n01:10:03  The Lifelong Process of Healing\n01:14:18  Upcoming Projects and Book\n\n📚 Recommended Reading: \u0022When Religion Hurts You\u0022 by Dr. Laura Anderson https://drlauraeanderson.com/book\n💌 Connect with Us: @holyghosting",
      "release": "2023-11-13T05:00:00Z",
      "duration": "01:15:21.4160000",
      "explicit": true,
      "spotifyId": "7hqYciheS5YRYIqHiGoWeR",
      "appleId": 1000634582561,
      "youTubeId": "DUyBayd3cM8",
      "subjects": [
        "Evangelicalism",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7hqYciheS5YRYIqHiGoWeR",
        "apple": "https://podcasts.apple.com/podcast/no-mom-thats-not-how-boundaries-work-and-other-fun/id1627628186?i=1000634582561",
        "youtube": "https://www.youtube.com/watch?v=DUyBayd3cM8"
      }
    },
    {
      "id": "7734d881-457a-4e14-a49d-d7cc047a15ac",
      "title": "Tales From the Purity Culture Crypt",
      "description": "Imagine a world, where you could admit that you were interested - nay, desirous of - sex. What?? That\u0027s nuts - ladies don\u0027t want that shit, right?? Get ready to think again: it\u0027s ok to want sex (contrary to popular DC Talk lyrics). \n\nJoin your triumphant trio as they talk with Dr. Laura Anderson about the literal pain and trauma that purity culture leaves in its wake. Did you, for instance, know that sex is supposed to feel good????? And that feeling good includes not having pain? \n\nAnd what about that interesting \u0022you\u0027re not married yet so shut that sexual anything down ASAP\u0022 to \u0022you\u0027re married now, you gotta let that P into your V full force, or you\u0027re bad\u0022 transition? That\u0027s fun! No? It\u0027s terrible? OK, you\u0027re not wrong. \n\nLong story short here? Purity culture is a disaster for all the people it has harmed, continues to harm today, and will continue to harm well into the future - unless....hear me out...unless, we refuse to let sexual repression ruin our experience of being human. Join us and learn how a few chaste women entered their permanent slut era, or at least have found some nice ways to reach orgasm. And that\u0027s worth some investment of your time and energy. \n\nIn closing: cum early, cum often. Love you! xoxo\n\n\u0022When Religion Hurts You: \n\nHEALING FROM RELIGIOUS TRAUMA AND THE IMPACT OF HIGH CONTROL RELIGION\u0022 Dr Laura Anderson, PHD \n\nPre-Order: https://drlauraeanderson.com/book\n\n\u0022Transforming the Sacred Wound\u0022 by Peter Levin (Audio Book Only)",
      "release": "2023-11-01T00:20:00Z",
      "duration": "01:23:21.5510000",
      "explicit": true,
      "spotifyId": "0nK80VxCykurJghpVHu8F9",
      "appleId": 1000633290006,
      "youTubeId": "9bsZfwVMxF8",
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nK80VxCykurJghpVHu8F9",
        "apple": "https://podcasts.apple.com/podcast/tales-from-the-purity-culture-crypt/id1627628186?i=1000633290006",
        "youtube": "https://www.youtube.com/watch?v=9bsZfwVMxF8"
      }
    },
    {
      "id": "59cd68f5-8622-489f-8bfc-706652f066dc",
      "title": "Best Of: Suck It Harvest Parties!",
      "description": "👻 Hey Ghosties! In the spirit of this wicked season, we\u0027re taking a nostalgic yet eye-opening trip back to the 90s—when TV was considered the ultimate evil! Join us as we welcome Kevin Garcia back to the show for a spooky and spirited discussion about the so-called \u0027evils\u0027 we grew up with.\n\nIn This Episode:\n\nBlast from the Past: Dive into the 90s middle school era with Meg, Sarai, and Kevin as we explore the cultural and religious taboos surrounding television and pop culture.\nDebunking Myths: We dissect the fears and myths that made TV the big bad wolf of our youth. From horror shows to sitcoms, we examine what really made these shows \u0027evil\u0027 according to the standards back then.\nLaugh and Reflect: It\u0027s not just about looking back—it\u0027s about laughing at the absurdity and reflecting on how these \u0027evil\u0027 labels shaped our perceptions and experiences.\nWhy Watch? Whether you\u0027re here to relive some 90s nostalgia, unravel the quirks of religious taboos, or just enjoy a good laugh with some enlightening company, this episode has something for everyone. Plus, Kevin\u0027s insights are not to be missed!\n\n👍 Like, Share, and Subscribe: Enjoyed the journey back in time? Hit that like button, share this video with your friends, and don\u0027t forget to subscribe to Holy Ghosting for more episodes where we uncover the fun and folly of our spiritual pasts.\n\nJoin the Conversation: What were you told was \u0027evil\u0027 growing up? Share your stories in the comments below—we love hearing from you and expanding our ghostly community with more tales and talks.\n\nStay Tuned after the ghost departing sound for the moment Kevin plans his Halloween costume!\n\n00:00  Growing Up Under Watchful Eyes\n01:51  Navigating Success and Community Support\n04:52  Nostalgia and Control in the 90s\n07:45  The Impact of Media Restrictions\n10:52  Editing Out the Unacceptable\n13:54  The Lengths Parents Go to Protect Their Kids\n15:44  The Flawed Savior: Messiahs in Fiction\n17:20  Nostalgic Recollections: Beavis and Butthead\n18:41  Cinematic Adventures: Discovering New Genres\n20:41  Cultural Commentary: South Park and Religious Views\n22:40  Navigating Boundaries: Parental Restrictions on Media\n26:40  The Simpsons: A Controversial Classic\n31:42  Guilt and Enjoyment: The Struggle with Humor\n33:03  Navigating Early Experiences with Sexuality\n35:58  The Role of Humor in Family Dynamics\n40:16  The Impact of Media on Personal Beliefs\n41:49  Revisiting Childhood Restrictions\n41:57  The Intersection of Faith and Pop Culture\n48:09  Flirting and Humor in Conversations\n49:02  Cultural References and Nostalgia\n51:05  Social Commentary in The Simpsons\n56:00  Personal Reflections on Sneaking Shows\n59:07  The Impact of The Simpsons on Lives\n01:03:13  Vulnerability and Authenticity in Expression",
      "release": "2023-10-25T19:35:00Z",
      "duration": "00:57:48.9040000",
      "explicit": true,
      "spotifyId": "7LDu3QGv8ym3yqyko5ateJ",
      "appleId": 1000632615008,
      "youTubeId": "RHoDKGGs158",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LDu3QGv8ym3yqyko5ateJ",
        "apple": "https://podcasts.apple.com/podcast/best-of-suck-it-harvest-parties/id1627628186?i=1000632615008",
        "youtube": "https://www.youtube.com/watch?v=RHoDKGGs158"
      }
    },
    {
      "id": "5569b090-f163-4594-bcc6-167059fd862c",
      "title": "Demons Watching Over Me",
      "description": "For kids who grew up during the Satanic Panic - especially those of us raised in Good Christian Homes - talking about, thinking about, worrying about, or wondering about demons was just an everyday thing. Join your Unwholesome Homeschoolers (and Meg) as they remember their personal demonologies and the way we really did think we always had demons scratching at every \u0022foothold\u0022 to get in and influence (?) or possess (?) us. Phew! Wild times! Come along for this spooky season episode all about our demon upbringings. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-10-16T05:00:00Z",
      "duration": "01:04:28.2120000",
      "explicit": true,
      "spotifyId": "40osSTXC6xsVmN4uK6JRpG",
      "appleId": 1000631432720,
      "urls": {
        "spotify": "https://open.spotify.com/episode/40osSTXC6xsVmN4uK6JRpG",
        "apple": "https://podcasts.apple.com/podcast/demons-watching-over-me/id1627628186?i=1000631432720"
      }
    },
    {
      "id": "7c8c4eb8-564e-4eb8-a97a-174ce4a9bd0b",
      "title": "Wake Up Sheeple! Christians, Conspiracies and Qanon:  with Cynane Shay",
      "description": "(Ultimate Spoiler: Oops, All White Supremacy - AGAIN?) Have you lost some people you love to an internet conspiracy theory? Is your weird aunt saying wild shit about Jewish space lasers at family dinners? If so, you might be a human being who still believes the earth is a globe that orbits the sun, or, say, that gravity exists...and your friends and relatives and people from church, in particular, are doubting those generally agreed upon realities. What gives? Why do Christians seem to fall for this stuff? And you know what - it\u0027s not because they already believe some pretty mind-boggling things - it\u0027s much deeper, more sinister, and perverse than that. Join Cynane Shay and your unholy trinity of hosts as they discuss the rapid unraveling of reality, thought reform, fascism, and why do Christians believe this stuff? (Once again, the answer will be disappointingly obvious). Cynane is the mastermind behind Taking Off the Tinfoil Hat. Find her work at: https://takingoffthetinfoilhat.com/ Instagram: @taking.off.the.tinfoil.hat TikTok: @takingoffthetinfoilhat Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-10-03T03:00:00Z",
      "duration": "01:26:57.9850000",
      "explicit": true,
      "spotifyId": "6df7Qo6UJN2chu7cZK0z9Q",
      "appleId": 1000629988089,
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6df7Qo6UJN2chu7cZK0z9Q",
        "apple": "https://podcasts.apple.com/podcast/wake-up-sheeple-christians-conspiracies-and-qanon/id1627628186?i=1000629988089"
      }
    },
    {
      "id": "5238b81c-4235-43dc-b9b9-3d67e9871ba4",
      "title": "The Homeschool of Hard Knocks: Our Plea for You to Not Brainwash Your Child",
      "description": "It\u0027s an episode about motherhood! It\u0027s an episode about feminism! It\u0027s an episode about feminism and motherhood and all of the fun messages we were taught about being a Good Christian Girl™!\n\nIn this episode we get into all the nitty gritty of what it means to identify as a woman in The United States of Evangelical America. \n\nHere are just a few of the things we cover:\n\n-The Equal Rights Amendment (ERA)\n-Concerned Women for America and the work of Phyllis Schlafly (spoiler: she\u0027s not in favor of equal rights for women! Not great!)\n-The (very few) positive female role models that exist in the Bible (and what was so wrong with Vashti anyway? And Jezebel got a bad rap!)\n-SPAGHETTI STRAPS AND THE PROBLEM OF SHOWING TOO MUCH SEXY SHOULDER\n-The mixed messages about what it meant to be a woman in Evangelical Christianity\n-Passing the Bechdel Test in your own damn IG bio\n-How Mothers are treated like garbage in this country. Paid maternity leave and free healthcare for all, plz.\n-The church’s insistence on giving women carnations on Mother’s Day. WHY?\n-How it’s none of your business if people are going to have a baby or not! (Lookin’ at you, Vanessa Lachey)\n-You can be anything and do anyone! You can change your name or your gender! You don’t have to take your husband’s name!\n-Motherhood is not the highest and only calling for women. It is a choice and we support your choice to be or not to be a mother. Period.\n-Motherhood is a gift and also a pain in the ass. Happy Mother’s Day, call your senators, and support the Equal Rights Amendment. The end.\n\nTo learn more about how to support the Equal Rights Movement please visit: https://www.eracoalition.org/\n\nSupport us on Patreon: https://www.patreon.com/holyghosting\n\nFollow us on social: \nTik Tok: https://www.tiktok.com/@holyghosting\nInstagram: https://www.instagram.com/holyghostingpod/\nJoin our Facebook group: https://www.facebook.com/groups/holyghosting",
      "release": "2023-09-17T07:00:00Z",
      "duration": "01:06:50.2920000",
      "explicit": true,
      "spotifyId": "3290BZgqhBI85858qNOVxv",
      "appleId": 1000628133847,
      "youTubeId": "WjuRB8rIqQo",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3290BZgqhBI85858qNOVxv",
        "apple": "https://podcasts.apple.com/podcast/the-homeschool-of-hard-knocks-our-plea-for-you-to/id1627628186?i=1000628133847",
        "youtube": "https://www.youtube.com/watch?v=WjuRB8rIqQo"
      }
    },
    {
      "id": "2b4ee375-496d-4ce4-ba42-4446db3ebf69",
      "title": "Born Into A Cult: Chad Harris from Shiny Happy People",
      "description": "Ep 39 of the Holy Ghosting Podcast\n\nContent Warning:\nTW Child Abuse\nIBLP and Bill Gothard Abuse\n\nIf you\u0027re a survivor of IBLP please go to: Recovering Grace https://www.recoveringgrace.org/\n\nShiny Happy People gave us a tiny glimpse into the realities of the IBLP (Institute in Basic Life Principles) cult. *Sidebar: be sure to listen to the Too Many Cults mini-series on this feed if you want to deep dive with our very own Lindsay and Krispin Mayfield from The Prophetic Imagination Station podcast! \n\nBut even with 4 episodes, Shiny Happy People barely scratches the surface of daily life when you’re a kid in a cult. And so, we are thrilled to welcome Chad Harris, an IBLP survivor who shared his experiences on Shiny Happy People, to give us his testimony of how he Holy Ghosted IBLP and high control religion. \n\nNot only will you learn more about “encouragement” (read: “corporal punishment with mind games”), the Joshua Project (Christian Nationalism through political and military-esque training), and more; you’ll get insider tips on why white bread is the evil kind of bread, how the IBLP business model works (kind of), and whether snake oil really works or not. \n(Our sincere apologies to Aubrey Gordon for omitting to fangirl about you in this episode WE LOVE YOU TOO!!) \n\nToo Many Cults: Our Re-Cap Series of Shiny Happy People https://redcircle.com/shows/959851a6-8328-49d4-b7c6-dff88a82faa2/ep/f444b82e-e7e6-4a1c-a6e4-b5040e129dba\n\nListen to the Prophetic Imagination Station’s New Series: This is the Bad Place \nA recap of The Good Place https://www.propheticimaginationstation.com/\n\nWatch Shiny Happy People on Amazon Prime \n\nListen to the Snake Oil Episode Here: https://www.audible.com/pd/Snake-Oil-Podcast/B08VG9F749",
      "release": "2023-09-03T07:00:00Z",
      "duration": "01:18:16.5020000",
      "explicit": true,
      "spotifyId": "4OCzPBvyw67WeIRcuK3hTd",
      "appleId": 1000626585035,
      "youTubeId": "-gwosGuyft4",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4OCzPBvyw67WeIRcuK3hTd",
        "apple": "https://podcasts.apple.com/podcast/born-into-a-cult-chad-harris-from-shiny-happy-people/id1627628186?i=1000626585035",
        "youtube": "https://www.youtube.com/watch?v=-gwosGuyft4"
      }
    },
    {
      "id": "de83ba9e-f80b-4ea7-8d36-adcf9110ebfe",
      "title": "Extraction, Exploitation, and Ego: An Interview with Fina on Capitalism and the Church",
      "description": "Content heads up: rape, sexual assault, and institutional irresponsibility. \n\n\nThe Evangelical church has quite an interesting relationship with capitalism and exploitation, and guess who cares about that? We do! And bonus: Fina of the Mindful Minds podcast cares about this too, so buckle up as she joins the Unfaithful Few, Lindsay, Meg, and Sarai, on today’s episode. \n\n\nLearn about how uncannily (and horrifically) THE SAME it is to grow up in the Evangelical church as a human being, especially one who is not a cis man, as it was 20 years ago when these middle aged mom friends got all tangled up in purity culture. Fina, a relatively recent college grad, tells your aghast hosts about her life in the church as a volunteer and as a survivor of sexual assault. Not only is this lack of evolution unacceptable, but it is also time for these institutions and the people who participate in them to take accountability for the lives they have failed to care about and support. It’s not pretty, and it’s not cool, but it’s true and happening - so let’s talk about it and uncover ways we might make different choices for ourselves now, as we heal from the experience of exploitation and repression the church foisted upon us. And more importantly, let’s start looking at ways religious institutions must catch up with the rest of society in some key ways.",
      "release": "2023-08-15T02:30:00Z",
      "duration": "01:21:55.0560000",
      "explicit": true,
      "spotifyId": "6aHG52lqdDzAj9lEiodNNk",
      "appleId": 1000624464871,
      "youTubeId": "ZVbar_ri8BA",
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aHG52lqdDzAj9lEiodNNk",
        "apple": "https://podcasts.apple.com/podcast/extraction-exploitation-and-ego-an-interview-with/id1627628186?i=1000624464871",
        "youtube": "https://www.youtube.com/watch?v=ZVbar_ri8BA"
      }
    },
    {
      "id": "a8ba9c95-23c2-45dc-825b-d98c1e842a24",
      "title": "Best Of: Travel The World On God\u0027s Dime",
      "description": "Ahoy, Ghosties! While we\u0027re still on break until we launch our next episodes starting in September, we missed you too much to stay all the way away. Give a listen to a classic episode from our first season and cringe at the stories of white saviorism, poverty tourism, and otherwise ghastly evangelizing activities Lindsay, Meg, and Sarai performed in their respective youths. Don\u0027t forget to rate (an honest five stars, oh please!) and review this podcast so other listeners like you can find us! Rock and roll. Support Holy Ghosting and become a part of our Patreon community We want to be friends!! TikTok YouTube and Instagram Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-07-30T07:00:00Z",
      "duration": "01:15:03.4570000",
      "explicit": true,
      "spotifyId": "3TkMr80pB0TFavIBSLx6Va",
      "appleId": 1000622803146,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3TkMr80pB0TFavIBSLx6Va",
        "apple": "https://podcasts.apple.com/podcast/best-of-travel-the-world-on-gods-dime/id1627628186?i=1000622803146"
      }
    },
    {
      "id": "7a00fe81-5e26-4a6c-a3f3-566f9a07ba7b",
      "title": "Age to Age She’s Still Aflame: Queer Joy with Flamy Grant",
      "description": "Y’all. Flamy Grant is this podcast’s favorite Drag Queen, and today’s episode is glorious because we get to talk with her! Join Meg and an ailing Sarai, as well as Lindsay, in spirit, as they chat with Flamy about queer joy and how we can all make more room to be more compassionate to ourselves and others. Pride month is full of celebration and joy AND ALSO a lot of your fave middle aged mom friends being their MOST middle aged mom-ness with relentless reminders to call your legislators and all the above. And all that’s true and still stands (eat your damn vegetables!) - yet, let’s not forget about the joy of finally being able to show up as fully, truly, and completely one’s self. By embracing our sexuality and who we love (whether it’s allowed by the religious programming we’ve endured or no) we are able to set ourselves and others free. Support Holy Ghosting and become a part of our Patreon community We want to be friends!! TikTok YouTube and Instagram Find more information about Flamy Grant here Flamy Grant TikTok Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-30T22:03:00Z",
      "duration": "00:47:35",
      "explicit": true,
      "spotifyId": "2xrO7DGAMIDJopLJcyvNo4",
      "appleId": 1000618923009,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2xrO7DGAMIDJopLJcyvNo4",
        "apple": "https://podcasts.apple.com/podcast/age-to-age-shes-still-aflame-queer-joy-with-flamy-grant/id1627628186?i=1000618923009"
      }
    },
    {
      "id": "55c34d59-f1df-4ae5-b806-c5e15ca28d7a",
      "title": "It\u0027s Never Too Late: Coming Out After 30",
      "description": "Join your bestie ghostie trifecta, Lindsay, Meg, and Sarai as we have an amazing conversation with a particularly rad human being. Val is one of Meg\u0027s longtime dear friends, raised the same funky way we were in the Evangelical church. Listen as Val shares her journey of coming out in her 30\u0027s. Y\u0027all, repression is REAL! She has a beautiful story to tell about self-discovery, community building, and representation. Most of all, she has clearly learned to trust herself - a massive accomplishment for those of us who were raised to trust only those who told us what god supposedly wanted for our lives. Join our Patreon community to support this podcast. You can find us on TikTok YouTube and Instagram . Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-28T20:10:00Z",
      "duration": "00:41:33.1680000",
      "explicit": true,
      "spotifyId": "6nYSzIuUrOYyHRR3w9kubv",
      "appleId": 1000618667674,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nYSzIuUrOYyHRR3w9kubv",
        "apple": "https://podcasts.apple.com/podcast/its-never-too-late-coming-out-after-30/id1627628186?i=1000618667674"
      }
    },
    {
      "id": "6575f240-dcf8-4852-bf13-593982bd4987",
      "title": "Image Management Strategies \u0026 More (Recap of Ep 4 Shiny Happy People)",
      "description": "This is the last of our four-episode series \u0022Too Many Cults\u0022, where Lindsay and Krispin (from the Prophetic Imagination Station and Linds\u0027 BIL) recap the docuseries Shiny Happy People: Duggar Family Secrets .TW: religious abuse, sexual abuse, family cover-up of abuse, psychological abuse, harsh punishment of children), controlling parenting, grooming, and sexual abuse. Most of this episode discusses sexual abuse and child pornography. A short section 13:55-22:55 discusses the plan for Christian homeschoolers to go to Washington and Republican politics, and also current youtube Christian influencers. 39:40-end is free of triggers around sexual abuse, and discusses the hope of survivors of IBLP. The episode talks about how the Duggar family and friends respond to Josh Duggar\u0027s allegations, how they respond to the sexual abuse of girls. There\u0027s also discussion of abuse charges and also legal retaliation. There\u0027s a short portion about how conservative Christians are trying to hold cultural power through politics and social media. We also talk a bit about the survivors of IBLP and how they\u0027ve been healing and recovering from trauma. Join our Patreon community Hang out with us on socials TikTok and Instagram . Check out our YouTube Channel Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-26T07:00:00Z",
      "duration": "00:49:45.0380000",
      "explicit": true,
      "spotifyId": "0IMRjV4nt1fUDn5sITnL7h",
      "appleId": 1000618320198,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0IMRjV4nt1fUDn5sITnL7h",
        "apple": "https://podcasts.apple.com/podcast/image-management-strategies-more-recap-of-ep-4-shiny/id1627628186?i=1000618320198"
      }
    },
    {
      "id": "d9917977-d4d0-4938-8920-f24f7cd3de8f",
      "title": "Coming Out: Stories of Living Your Truth Under Christian Scrutiny",
      "description": "Content Heads-Up: this episode contains mentions of attempted suicide, mental health challenges, and sexuality and gender dysphoria. Listen with care and call your bestie if you need support. If you or someone you know is struggling with thoughts about taking their own lives, please dial the National Suicide Prevention Lifeline at 988. Hey, Ghosties! What a day. As you know by now, Holy Ghosting is celebrating Pride this month with weekly episodes about different aspects of LGBTQ\u0026#43; and Evangelicalism. This week, we are talking about Coming Out - and bonus: you\u0027ll get to hear directly from four listeners about how their entanglements with the church have worked out after they came out. Some folks are still (non-Evangelical) Christians, and others are no longer religious. All of them have something important to share about the challenges of being alienated from one\u0027s own sense of self, sexuality, and gender - and what it is like when you still make space for yourself to be all of who you are. We all want to thank the listeners who took the time and effort to send us their stories. We also want to thank Joy Weber, our spritely right-hand enbie who read one of the stories submitted anonymously by a 41 yr old listener who is still healing her own soul after her very difficult coming out story. Y\u0027all. Be you. Be strong. Be safe. Be bold. You are not alone - and the more we all peel our layers of oppression away from ourselves, we make it safe for others to do the same. Rock and roll! Join our patreon community to support this podcast. You can find us on TikTok and Instagram . Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-21T20:15:00Z",
      "duration": "00:34:18.0310000",
      "explicit": true,
      "spotifyId": "2ZtgrFsdwG1gsGx9Micx5h",
      "appleId": 1000617891140,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZtgrFsdwG1gsGx9Micx5h",
        "apple": "https://podcasts.apple.com/podcast/coming-out-stories-of-living-your-truth-under/id1627628186?i=1000617891140"
      }
    },
    {
      "id": "49f66760-d194-4f4c-8451-58e4c40426df",
      "title": "Fascism in Plain Sight:  A Recap of Ep. 3 of Shiny Happy People",
      "description": "Fascism in Plain Sight is the third episode of our mini-series \u0022Too Many Cults\u0022, where Lindsay and Krispin (from the Prophetic Imagination Station and Linds\u0027 BIL) recap the docuseries Shiny Happy People: Duggar Family Secrets . In this episode we talk about how IBLP and Jim Bob Duggar hold onto money while those with less power do unpaid work. We also talk about how Gothard created an environment in the IBLP that encouraged abuse to exist with impunity. Krispin shares some of the parallels he saw in his evangelical community in response to his disclosure of sexual abuse by a family member. TW: religious abuse, sexual abuse, family cover-up of abuse, psychological abuse, harsh punishment of children), controlling parenting, grooming and sexual abuse. Here\u0027s a breakdown of the episode and the topics: 0:00 Introduction, brief non-specific mention on Josh\u0027s child pornography charges. 2:00 Discussion of free labor in Evangelical spaces 23:00 Discussion of sexual abuse from Gothard and sexual abuse within the IBLP. Join our patreon community to support this podcast. You can find us on TikTok and Instagram . Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-19T16:00:00Z",
      "duration": "00:47:14.0500000",
      "explicit": true,
      "spotifyId": "3maRPzfWoVo5rIcp9Yttiq",
      "appleId": 1000617588586,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3maRPzfWoVo5rIcp9Yttiq",
        "apple": "https://podcasts.apple.com/podcast/fascism-in-plain-sight-a-recap-of-ep-3-of-shiny-happy-people/id1627628186?i=1000617588586"
      }
    },
    {
      "id": "adf3de42-d4a8-44b6-9926-7582a03e17ea",
      "title": "Our Pride and Joy: Gender Affirming Parenting",
      "description": "Imagine, giving birth to a beautiful baby…assigning them a gender, and just a few years later finding out they already know themselves better than we ever could. Hearing “I’m a girl” from a kiddo you assumed was a boy can elicit a lot of reactions. Today we talk to two moms who heard their kids when their children told them who they really are and have chosen to raise them to affirm their respective genders. Their reactions were to believe and nurture their unique and beautiful children. That’s what is happening in families across the world - and in America, a whooooole chunk of the country is actively trying to erase these kids (and their adult counterparts!) with anti-trans legislation. We can’t stand by while old white men chat in state halls about who gets to pee where when our kids’ very lives are on the line. Join the unholy trinity, Lindsay, Meg, and Sarai as they learn from two parents who have joyously embraced their kids’ identities, and raise them to affirm and support who their kids know they are. Have trouble understanding folks who are trans? Stick with us as we talk a bit about how we’ve chosen to learn from the courageous, self-knowing humans who dare to be completely true to their entire selves as they show up in the world. Celebrate and support your trans friends and don’t let them be crushed by the hatred they face in the world. Stand beside the ones you love and believe them when they tell you who they really are. As Waterdeep would say, “Everyone’s Beautiful” (and you’re welcome for the very specific CCM deep cut). ———————————————————— Information about Trans suicide rates ACLU guide to talking to people about attacks on Trans Youth Human Rights Campaign: fight anti trans legislation. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-14T07:00:00Z",
      "duration": "01:20:47.4900000",
      "explicit": true,
      "spotifyId": "126Gui5sUFLEzZtZPFiewM",
      "appleId": 1000616951239,
      "subjects": [
        "Legislation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/126Gui5sUFLEzZtZPFiewM",
        "apple": "https://podcasts.apple.com/podcast/our-pride-and-joy-gender-affirming-parenting/id1627628186?i=1000616951239"
      }
    },
    {
      "id": "9dda0205-29d4-4974-bc23-89036b055495",
      "title": "An Environment Where Abuse Thrives (Recap of Ep 2 Shiny Happy People)",
      "description": "TW: religious abuse, sexual abuse, family cover-up of abuse, emotional neglect, psychological abuse, physical abuse (and violent punishment of children), intimate partner abuse. In this episode we talk about Bill Gothard’s teachings, women\u0027s gender roles, and parenting ideals that create environments where abuse could occur with impunity. This is the second of a four-episode series called Too Many Cults, where Lindsay and Krispin (from the Prophetic Imagination Station ) recap the docuseries Shiny Happy People: Duggar Family Secrets (Amazon Prime) Here are this Episode\u0027s topics: 0:00 Introduction, overview of episode, discussion of why traumatized people can be drawn to fundamentalism 9:45 homeschooling 22:10 subjugation of women; abuse of girls \u0026 women, purity culture, gender roles 30:00 child abuse; the discipline of children 47:30 sexual abuse Join our patreon community to support this podcast. Or join us on TikTok and Instagram Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-12T07:00:00Z",
      "duration": "00:56:37.8770000",
      "explicit": true,
      "spotifyId": "6AkAlI4JI2GEk1OF0D9zgo",
      "appleId": 1000616604125,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6AkAlI4JI2GEk1OF0D9zgo",
        "apple": "https://podcasts.apple.com/podcast/an-environment-where-abuse-thrives-recap-of-ep-2/id1627628186?i=1000616604125"
      }
    },
    {
      "id": "b0e00965-0cb7-4aca-9e02-24312a2f49cc",
      "title": "God, Gays, and Getting Your Spiritual Groove Back with Kevin Garcia",
      "description": "Ghosties! Get ready for a month of amazing interviews celebrating PRIDE. Our first episode of this 4-Part Mini Series is a conversation with Kevin Garcia, author (of many things and most recently), “What Makes You Bloom: Cultivating a Practice for Connecting with Your Divine Self.” Kevin is a mystic who has discovered a path back to himself and his spirituality after a lifetime of Evangelical gay-shaming…nay, gay-annihilating… doctrine and practice. Luckily, the Vengeful Evangelical God™️ doesn’t have a monopoly on spirituality. Kevin, like your fab three faves (Lindsay, Meg, and Sarai), has been able to carve a beautiful spiritual life out for himself - and he helps others do the same with his work today. You won’t want to miss this or any other Pride conversation this month, so be sure to subscribe, tell all your friends, and leave a nice review if you have the inkling to do so. :) Love is Love and We Love YOU! Resources from this episode: Pray Away (Documentary on Netflix) App Suggestions: Headspace, Bloom Reading Suggestions: A Course in Miracles, The Soul of RUMI Kevin’s Podcast: A Tiny Revolution Socials @thekevingarcia TikTok @thekevingarcia_ Books by Kevin Garcia “ Bad Theology Kills ” BadTheologyKills.com “ What Makes You Bloom: Cultivating a Practice for Connecting with Your Devine Self ” Available for Pre-Sale Now ! Coming January 2024 Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-07T07:00:00Z",
      "duration": "01:00:21.6680000",
      "explicit": true,
      "spotifyId": "6kLecNyJ4rCIXxJ5kLy6r8",
      "appleId": 1000615971885,
      "subjects": [
        "Evangelicalism",
        "A Course in Miracles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6kLecNyJ4rCIXxJ5kLy6r8",
        "apple": "https://podcasts.apple.com/podcast/god-gays-and-getting-your-spiritual-groove-back-with/id1627628186?i=1000615971885"
      }
    },
    {
      "id": "b770d0e6-4300-4423-aaa0-b7785cd8ef0c",
      "title": "19 Cults and Counting: A Recap of Ep. 1 of Shiny Happy People",
      "description": "This is the first in a special four-episode series: Too Many Cults, hosted by Lindsay and Krispin (from the Prophetic Imagination Station ). They recap the docuseries Shiny Happy People: Duggar Family Secrets [Amazon Prime] TW: religious abuse, sexual abuse, family cover-up of abuse We’re recapping the episodes, talking about what stands out to us, and processing some religious trauma along the way. Oh! And you can find episodes on both podcasts, a true crossover series! We\u0027re calling the series Too Many Cults, inspired by the video Too Many Cooks , which you should go watch! In this episode, we talk about how Bill Gothard’s teachings of the Institute of Basic Life Principles (IBLP) are incredibly similar to mainstream evangelicalism and the Focus on the Family we all grew up with. Bill Gothard and Dr. Dobson were incredibly similar and created very similar dysfunctional family cultures (the latter just had fewer kids). Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-06-05T07:00:00Z",
      "duration": "00:52:20.0480000",
      "explicit": true,
      "spotifyId": "6MFtsVSx6F8loVVMu7H7sk",
      "appleId": 1000615679262,
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6MFtsVSx6F8loVVMu7H7sk",
        "apple": "https://podcasts.apple.com/podcast/19-cults-and-counting-a-recap-of-ep-1-of-shiny-happy-people/id1627628186?i=1000615679262"
      }
    },
    {
      "id": "63a3e42a-734d-45e7-bc78-87ff7d186ba3",
      "title": "I Don\u0027t Want It: The Pain of Purity Culture with Dr. Laura Anderson, PHD",
      "description": "Imagine a world, where you could admit that you were interested - nay, desirous of - sex. What?? That\u0027s nuts - ladies don\u0027t want that shit, right?? Get ready to think again: it\u0027s ok to want sex (contrary to popular DC Talk lyrics). Join your triumphant trio as they talk with Dr. Laura Anderson about the literal pain and trauma that purity culture leaves in its wake. Did you, for instance, know that sex is supposed to feel good????? And that feeling good includes not having pain? And what about that interesting \u0022you\u0027re not married yet so shut that sexual anything down ASAP\u0022 to \u0022you\u0027re married now, you gotta let that P into your V full force, or you\u0027re bad\u0022 transition? That\u0027s fun! No? It\u0027s terrible? OK, you\u0027re not wrong. Long story short here? Purity culture is a disaster for all the people it has harmed, continues to harm today, and will continue to harm well into the future - unless....hear me out...unless, we refuse to let sexual repression ruin our experience of being human. Join us and learn how a few chaste women entered their permanent slut era, or at least have found some nice ways to reach orgasm. And that\u0027s worth some investment of your time and energy. In closing: cum early, cum often. Love you! xoxo \u0022When Religion Hurts You: HEALING FROM RELIGIOUS TRAUMA AND THE IMPACT OF HIGH CONTROL RELIGION\u0022 Dr Laura Anderson, PHD Pre-Order: https://drlauraeanderson.com/book \u0022Transforming the Sacred Wound\u0022 by Peter Levin (Audio Book Only) Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-05-28T07:00:00Z",
      "duration": "01:24:32.2080000",
      "explicit": true,
      "spotifyId": "1zl1Lap8tW3x9JvuXtOQYX",
      "appleId": 1000614742307,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zl1Lap8tW3x9JvuXtOQYX",
        "apple": "https://podcasts.apple.com/podcast/i-dont-want-it-the-pain-of-purity-culture-with/id1627628186?i=1000614742307"
      }
    },
    {
      "id": "fb23161a-187e-4294-9696-eebc05eae841",
      "title": "Be Anything. Do Anyone. Feminism, Motherhood, and the ERA",
      "description": "It\u0027s an episode about motherhood! It\u0027s an episode about feminism! It\u0027s an episode about feminism and motherhood and all of the fun messages we were taught about being a Good Christian Girl™! In this episode we get into all the nitty gritty of what it means to identify as a woman in The United States of Evangelical America. Here are just a few of the things we cover: -The Equal Rights Amendment (ERA) -Concerned Women for America and the work of Phyllis Schlafly (spoiler: she\u0027s not in favor of equal rights for women! Not great!) -The (very few) positive female role models that exist in the Bible (and what was so wrong with Vashti anyway? And Jezebel got a bad rap!) -SPAGHETTI STRAPS AND THE PROBLEM OF SHOWING TOO MUCH SEXY SHOULDER -The mixed messages about what it meant to be a woman in Evangelical Christianity -Passing the Bechdel Test in your own damn IG bio -How Mothers are treated like garbage in this country. Paid maternity leave and free healthcare for all, plz. -The church’s insistence on giving women carnations on Mother’s Day. WHY? -How it’s none of your business if people are going to have a baby or not! (Lookin’ at you, Vanessa Lachey) -You can be anything and do anyone! You can change your name or your gender! You don’t have to take your husband’s name! -Motherhood is not the highest and only calling for women. It is a choice and we support your choice to be or not to be a mother. Period. -Motherhood is a gift and also a pain in the ass. Happy Mother’s Day, call your senators, and support the Equal Rights Amendment. The end. To learn more about how to support the Equal Rights Movement please visit: https://www.eracoalition.org/ Support us on Patreon: https://www.patreon.com/holyghosting Follow us on social: Tik Tok: https://www.tiktok.com/@holyghosting Instagram: https://www.instagram.com/holyghostingpod/ Join our Facebook group: https://www.facebook.com/groups/holyghosting Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-05-18T00:00:00Z",
      "duration": "01:08:42.9830000",
      "explicit": true,
      "spotifyId": "604hdms93zeHznWNxgO4B5",
      "appleId": 1000613452927,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/604hdms93zeHznWNxgO4B5",
        "apple": "https://podcasts.apple.com/podcast/be-anything-do-anyone-feminism-motherhood-and-the-era/id1627628186?i=1000613452927"
      }
    },
    {
      "id": "d3688da8-d0df-47cf-a54a-5026ed993b73",
      "title": "Being Black in White Churches: Where Belonging is Actually Just Conformity",
      "description": "Season 2 | Episode 11\nYour fave middle-aged mom apostates connect with their friend Shaunea, a black woman who grew up in almost exclusively white spaces when her white mother converted to Christianity in the 1980’s. Sha’s mom had the kind of testimony Evangelicals went batshit crazy for back then (and still now!)\n\nSha’s story about growing up black in a white Evangelical world reveals some of the deeper beliefs and White Supremacist/Christian Nationalist leanings that have been with the American Evangelical church from…probably the beginning, let’s be real. Join Lindsay, Meg, and Sarai as they listen and discover a long-suppressed reality - when people are not able to be themselves, where belonging is conditional to how one looks, acts, talks, and moves through the world - including the color of their skin (sorry, D.C. Talk - being colorblind isn’t a thing and it’s actually racist, heads up!)….well, it doesn’t do anybody any good to continue to allow that system to flourish and persist. Let’s confront some of the uglier sides of who we were as Evangelical white kids (say Lindsay, Meg, and Sarai) and learn from people who had a much more alienating and disempowering experience than we did. Which…if you’ve listened to even 10 minutes of a single episode of Holy Ghosting, you realize is saying A LOT.",
      "release": "2023-04-30T07:00:00Z",
      "duration": "01:19:31.7510000",
      "explicit": true,
      "spotifyId": "00tOMDI3YDyxxJkuVsIffV",
      "appleId": 1000611170761,
      "youTubeId": "QE83vgQAs3I",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/00tOMDI3YDyxxJkuVsIffV",
        "apple": "https://podcasts.apple.com/podcast/being-black-in-white-churches-where-belonging-is-actually/id1627628186?i=1000611170761",
        "youtube": "https://www.youtube.com/watch?v=QE83vgQAs3I"
      }
    },
    {
      "id": "6cfd5e33-c3cd-4ee1-aa0e-8a406cf19ced",
      "title": "We Don’t Need No (Public) Education: Schooling for Evangelicals",
      "description": "If you grew up with Creationism instead of Science or had odd electives like Lapidary or Little House on the Prairie Curriculum then you may have been schooled by Christian Education! Our three hosts share all about their sheltered education from unschooling, homeschooling, and private education …so you know there are some pretty wild stories from Christian Campus life. If you’d like to support the show, become a Ghostie at Patreon.com/holyghosting Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-04-16T07:00:00Z",
      "duration": "01:10:30.0860000",
      "explicit": true,
      "spotifyId": "4k9alcN4bqtOcLkYIGINE2",
      "appleId": 1000609128622,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4k9alcN4bqtOcLkYIGINE2",
        "apple": "https://podcasts.apple.com/podcast/we-dont-need-no-public-education-schooling-for-evangelicals/id1627628186?i=1000609128622"
      }
    },
    {
      "id": "ef62c917-6793-4052-8b6f-6989f7c010d7",
      "title": "This Hurts Me More Than it Hurts You: And Other Lies from the Cult of Dobson Discipline",
      "description": "Growing up in American Christianity in the 80’s and 90’s meant we were smack dab in the height of Dobson Domination. That is, Dr. James Dobson and his Focus on the Family ubiquity in the realm of parenting and child rearing advice, children’s entertainment (and, behind the scenes, lobbying and more exciting political dealings)… If your parents “dared to discipline” their “strong-willed children” the Dobson way, you probably got a good amount of spanking, control, and fear in your childhood. Parents were told that breaking the spirit of a child would ensure they would become good little Christians and (just as or more importantly) good little Republicans. Amazingly, many of us didn’t end up that way - and the Boomers who listened to Focus on the Family’s terrible advice haven’t learned how to apologize for their behavior. And some of them are just left to wonder why their children have betrayed them. So…what now??? How do we learn to parent our children differently? How do we raise kids who become emotionally mature and intelligent? Join the conversation and hear how a handful of your fave middle-aged mom friends have been trying their hand at it so far. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-04-02T07:00:00Z",
      "duration": "01:21:55.0560000",
      "explicit": true,
      "spotifyId": "5JFUW4K2JxMynnGLli9xAh",
      "appleId": 1000606948026,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JFUW4K2JxMynnGLli9xAh",
        "apple": "https://podcasts.apple.com/podcast/this-hurts-me-more-than-it-hurts-you-and-other-lies/id1627628186?i=1000606948026"
      }
    },
    {
      "id": "39856095-fc49-4466-a915-6e7fa0ceb3dc",
      "title": "That’s Me In The Corner: DL Mayfield on Neurodivergence, Evangelicalism, and Losing Her Religion",
      "description": "We are Holy Ghosting, three middle age mom friends raised in the 80\u0027s and 90\u0027s in American Evangelical Christianity. \n\nGrowing up neurodivergent and in the throes of evangelicalism, a high control and fear-based religion, offered DL Mayfield one choice...to be the best darn good girl she could be, the bestest christian and martyr for the lord, and to do it with perfection and grace. And so she did. FOR YEARS, DECADES even!\n\nCome along on a wild ride as we hear how DL Mayfield (Lindsay\u0027s sister!!!) has begun to disentangle her life from the world she grew up in after her autism diagnosis...and now she\u0027s Holy Ghosting.\n\nxoxo\nLindsay, Meg \u0026 Sarai",
      "release": "2023-03-19T07:00:00Z",
      "duration": "01:10:07.4630000",
      "explicit": true,
      "spotifyId": "4X2C3n10zlnc2bAFn7yhCp",
      "appleId": 1000604806396,
      "youTubeId": "N-ZvPD-AEWI",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4X2C3n10zlnc2bAFn7yhCp",
        "apple": "https://podcasts.apple.com/podcast/thats-me-in-the-corner-dl-mayfield-on-neurodivergence/id1627628186?i=1000604806396",
        "youtube": "https://www.youtube.com/watch?v=N-ZvPD-AEWI"
      }
    },
    {
      "id": "bc26855c-d5e3-4c30-8e7f-cea3ed3d5fb8",
      "title": "Are you there, God? It\u0027s me. I left this performance fleece outside for you",
      "description": "When we were kids, we were told to listen to “the voice of God” which was usually something someone else told us, and rarely, if ever, something we actually “heard” with our ears. Even our own intuition couldn’t possibly be right, so we spent our childhoods and young adulthoods under the impression that we couldn’t make a decision lest we be out of God’s will. In the Bible, there are SO MANY stories about people using divination to understand what they perceived the will of God to be - and some of those stories (Gideon, for instance) are held up as triumphs…whereas others are condemned (King Saul consulting a medium or fortune teller - Jehova was like, NOPE, you’re not King anymore). What is divination, anyway? Will you be smoted from the earth if you use it? (spoiler: no) Divination is the practice of getting insight into a question or situation, it\u0027s not scary at all, we promise. Things you can read about divination (if you dare!) Divination is terrible and a sin: https://www.gotquestions.org/Bible-divination.html References in the Old Testament to Divination: https://en.wikipedia.org/wiki/Witchcraft_and_divination_in_the_Hebrew_Bible A Very Fun Article About Christians and Magic: https://en.wikipedia.org/wiki/Christian_views_on_magic Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-03-05T08:00:00Z",
      "duration": "00:59:49.0080000",
      "explicit": true,
      "spotifyId": "4Mib6sWGa8rgblvnw6x91t",
      "appleId": 1000602807086,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Mib6sWGa8rgblvnw6x91t",
        "apple": "https://podcasts.apple.com/podcast/are-you-there-god-its-me-i-left-this-performance-fleece/id1627628186?i=1000602807086"
      }
    },
    {
      "id": "33e35e40-6791-4bbc-b3ee-1e7951c78c67",
      "title": "Rolling with My Holies: Revival in the Land",
      "description": "Not since Carman personally slayed the DEVIL himself when he called for Revival in the Land has there ever been such a meaningful movement of the awakening of the Christian spirit\u0027s openness to the Holy Ghost. Not until now. Asbury University has experienced a celebrity-level Revival in the Land amongst its student body. But, REVIVAL...what is it good for? Dr. Amy Ferrell \u0022I hope for everyone\u0027s sake that if there is any kind of awakening that it is to the truths of this world. Especially the truth of our complicity in harm, like racism, patriarchy, ableism, homophobia, transphobia, Christian exceptionalism (\u0022We\u0027re the good and right ones\u0022), saviorism, martyrdom, emotional repression, binaries, paradigms of control using manipulation, coercion, intimidation, and punishment, and I could go on. Hoping we all can wake up and see through the illusions of the world and of us.\u0022 Revival is never said in the New Testament, but 2 Chronicles 7:14 is used to justify \u0022healing the land\u0022 of America from things Christians don\u0027t like. Watch the Carman Revival In The Land video with us at Patreon.com/holyghosting Biola Revival Article: https://charismamag.com/charisma-archive/spiritual-awakening-continues-to-shake-biola-university-in-california/ Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-02-24T08:00:00Z",
      "duration": "01:18:34.0310000",
      "explicit": true,
      "spotifyId": "3uBPx3EnZuhv70C6Bcp4nS",
      "appleId": 1000601397177,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3uBPx3EnZuhv70C6Bcp4nS",
        "apple": "https://podcasts.apple.com/podcast/rolling-with-my-holies-revival-in-the-land/id1627628186?i=1000601397177"
      }
    },
    {
      "id": "b750c9ad-7518-4d8d-81b7-cf2e65dc3576",
      "title": "God Hates Divorce But Sarai Loves It",
      "description": "It’s no surprise “God Hates Divorce” or at least “God Hates Divorce for Women” in evangelical christianity. There’s only one thing that will end a marriage in God’s eyes…ADULTERY. But even then, sometimes it’s best to forgive (the man) and stay married! We’re all big fans of personal choice over here, even if you signed a legal (gasp!) document one time when you were 20 (oh, was that just Meg?!) you don’t HAVE to stay in a relationship you don’t like (you don’t even have to say your reason). Join us for a healing episode celebrating the TABOO of divorce! Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-02-17T08:00:00Z",
      "duration": "01:09:49.1750000",
      "explicit": true,
      "spotifyId": "2ocCax6IID39hJ3ty8H61T",
      "appleId": 1000600122551,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ocCax6IID39hJ3ty8H61T",
        "apple": "https://podcasts.apple.com/podcast/god-hates-divorce-but-sarai-loves-it/id1627628186?i=1000600122551"
      }
    },
    {
      "id": "dc67ac82-71cf-486e-9783-290bebbddae3",
      "title": "This is Your Mom on Drugs",
      "description": "A lot of things were considered real bad in the 80’s and 90’s - especially for evangelical kids like your fave trio, Lindsay, Meg, and Sarai. The devil, yikes! Having boobs, terrible! Even thinking about or knowing anybody who drank any kind of alcohol?? NO! And especially…DRUGS. Then again, in the 80’s and 90’s, drugs were bad for everyone, because Nancy Reagan said so. This season is all about Taboos! In this episode, we delve into the realm of substances and how we’ve learned where, when, and how substances harm or help us. “Before we can ask an addict to say no to drugs we have to give them something to say yes to.” Gabor Maté, MD In the Realm of Hungry Ghosts This Naked Mind by Annie Grace Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-02-03T08:00:00Z",
      "duration": "01:22:00.9460000",
      "explicit": true,
      "spotifyId": "7LZyzwmvWYG6pRjCLgVoE1",
      "appleId": 1000597832174,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LZyzwmvWYG6pRjCLgVoE1",
        "apple": "https://podcasts.apple.com/podcast/this-is-your-mom-on-drugs/id1627628186?i=1000597832174"
      }
    },
    {
      "id": "cd908764-ef9b-4e6b-a30c-2566c7aee69c",
      "title": "Fat \u0026 Faithful: Finding Freedom through Fat Liberation",
      "description": "Get ready for our latest podcast episode, \u0022Maybe God SHOULD Call the Qualified: Our Review of Savior Complex Part One,\u0022 where your Murder of MILFs (and by that, we mean \u0022Mom I’d Like to Friend\u0022 – get those minds out of the gutter!) tackle the alarming story of Renee Bach and her organization, Serving His Children, in Uganda.\n🎥 What\u0027s Inside:\nWe watched it so you don’t have to! HBO Max\u0027s docu-series \u0022Savior Complex\u0022 is a three part mini documentary series and in this episode we unravel the disturbing ascent of Renee Bach. At just 19, Bach, with no medical training, felt \u0022a heart for Africa\u0022 and believed she was called by God. What began as a feeding program alarmingly transformed into an unlicensed medical clinic, with Renee performing medical procedures on malnourished children, leading to catastrophic outcomes.\n🚨 Viewer Discretion Advised: This episode is not for the faint of heart. Prepare for a discussion that spans ill and malnourished children, infant and child mortality, the glaring issue of white supremacy, and the deeply problematic Laurie Bach (Renee’s mom, homeschool teacher and head of the Serving His Children board of directors).\n🔍 Why Watch?:\nCritical Analysis: We provide a critical review of the first and part of the second episode of \u0022Savior Complex,\u0022 sparing you the horror and giving you the essentials.\nHard Conversations: This story is a crucial conversation starter about white saviorism, unqualified missions in Africa, and the dire consequences of unchecked privilege.\nUpcoming Review: Stay tuned for Part 2 of our review, where we continue to dissect this complex story and its implications.\n💬 Join the Conversation: After watching, we invite you to share your thoughts, reactions, and insights in the comments below. Let\u0027s dissect this controversial tale together and reflect on its broader societal impacts.\n👉 Subscribe and Stay Updated: For more insightful reviews and discussions, make sure to subscribe to our channel. Your support enables us to continue exploring and unpacking stories that matter.\n#SaviorComplex #ReneeBach #PodcastReview #WhiteSaviorism #CriticalAnalysis",
      "release": "2023-01-21T21:55:00Z",
      "duration": "01:01:14.2260000",
      "explicit": true,
      "spotifyId": "4DGewsNrlm99sVsT20R48O",
      "appleId": 1000595894038,
      "youTubeId": "jNYgzhl2xPw",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4DGewsNrlm99sVsT20R48O",
        "apple": "https://podcasts.apple.com/podcast/fat-faithful-finding-freedom-through-fat-liberation/id1627628186?i=1000595894038",
        "youtube": "https://www.youtube.com/watch?v=jNYgzhl2xPw"
      }
    },
    {
      "id": "ba4504da-1f15-4a9d-9802-a4c71a7d371b",
      "title": "We’re All From a Long Line of Leavers: an Interview with Derek Webb",
      "description": "In this very special episode of Holy Ghosting, we got to chat with everyone’s favorite rogue CCM songwriter, Derek Webb of Caedmon’s Call! If you were an evangelical Christian in the 90’s/2000’s, you know who we’re talkin about. Caedmon’s Call was THE band of youth groups and Bible colleges. And as it turns out, Derek is quite literally from a Long Line of Leavers (SEE WHAT WE DID THERE?!) and after a long and successful career in the Christian music industry, he decided to leave Christianity entirely. He’s made a lot of music about his faith journey, and has been refreshingly open and honest along the way. p.s. Derek is on tour currently, debuting songs from his soon-to-be released album, The Jesus Hypothesis. Tickets and info at derekwebb.com That said, we were super excited to sit down and chat with Derek about alllllllllll the things. We talked about his CCM days, his “fall from grace”, deconversion, solo career, and all that fun stuff! (We also heard a little from his adorable pup, Etta.) We got into all the nitty gritty of evangelical Christianity and were floored by his kind and graceful way of speaking about the messiness of faith and doubt and everything in between. And we talked about David Bazan (because if you’re talkin about deconstruction, it always comes back to Bazan). Just trust us when we say we had the best conversation with Derek and he made us feel a part of something bigger and it made us feel thankful for YOU (our Ghosties!) and this rad community we’re building. Now stop reading and go listen to the interview! Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-01-13T01:35:00Z",
      "duration": "01:02:09.5800000",
      "explicit": true,
      "spotifyId": "538BspfeaBtBVc4fWZKPkk",
      "appleId": 1000594145624,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/538BspfeaBtBVc4fWZKPkk",
        "apple": "https://podcasts.apple.com/podcast/were-all-from-a-long-line-of-leavers-an/id1627628186?i=1000594145624"
      }
    },
    {
      "id": "06ef5f2a-fd07-4e7a-87a6-a660e78a4592",
      "title": "Burn It Down: the Evangelical Environmental Agenda",
      "description": "As Evangelical children in the 80’s and 90’s, we had plenty of Big Terrible Things to fear. Satanic Panic was in full swing, stranger danger lurked in every darkened doorway, and America’s Most Wanted sailed into our living rooms on the reg. One of the most fearful things, of course, was the rise of Environmentalism. (BUT WHY?!) Seriously, though, does anybody know why Evangelicals - people who believe God literally created the world and everything it and who believe the earth is a gift from God above - also hate environmentalism? Deny climate change? Fight for industry over the health of the earth? (All God’s creatures great and small, unless you’re the Spotted Owl, then fuck you!) The cognitive dissonance is astounding. So, if you, like this unanimous trio of co-hosts, were not allowed to watch Fern Gully, lest your fertile young mind absorb the poison of the message to protect the earth, listen in as we get into the nitty gritty of Christians and the Environmental Agenda. If, on the other hand, you’re reading this description and thinking it makes literally no sense - you’re not wrong. Join the club and still listen, because if nothing else, this will entertain you for a little while. This season, Holy Ghosting is focusing on the philosophies, activities, existences, and concepts that were taboo in our Evangelical experience. Anything and everything from fat bodies, naked bodies, LGBTQIA\u0026#43; bodies and humans…we’re gonna opine and weep and laugh our way through it all. If you’re into that sort of thing, you might want to become one of our besties and become a Holy Ghostie at Patreon.com/holyghosting Don’t forget to subscribe so you don’t miss a single episode this season! What’s more fun than Taboo? Guesstures? NO. Taboo is the best group game, end of discussion. But also a very interesting topic to unpack amongst consenting adults. xoxox Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2023-01-06T19:45:00Z",
      "duration": "00:55:25.2830000",
      "explicit": true,
      "spotifyId": "1L86xbljMeWE80bruYpRdc",
      "appleId": 1000592917831,
      "youTubeId": "Kjl3_C_49pg",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1L86xbljMeWE80bruYpRdc",
        "apple": "https://podcasts.apple.com/podcast/burn-it-down-the-evangelical-environmental-agenda/id1627628186?i=1000592917831",
        "youtube": "https://www.youtube.com/watch?v=Kjl3_C_49pg"
      }
    },
    {
      "id": "dfdaa529-a874-4767-8f7a-9d3d1b3674c3",
      "title": "Giving up the Ghost",
      "description": "One afternoon, months and months ago, three loudmouth Type-A women gathered in Meg’s living room to record the inaugural episode of Holy Ghosting (“Panic at the Altar”). And if that weren’t enough sharing for one day, we decided to share our Testimonies and catch each other up on our walks, because that’s what fellowship is, we supposed. So if you’ve ever wondered how we went from Good Girls to whatever we are now, this is the episode for you. Each of us had similar beginnings, but we each had a Very Specific Journey through and out of Evangelical Christianity. Pull some threads with us as we share pieces of our deconstruction and reconstruction stories. Ever wondered how many sidebars Sarai could stick in one episode, find out now! Who among us majored in Bible? What the heck happened with these perfectly suitable evangelical Good Girls? Listen, enjoy, and then go ahead and work out your own Salvation, fear and trembling optional. Thank you for joining us for Season One of Holy Ghosting, we’re already working on Season Two, so we’ll see you in January! We’ve launched a Patreon, and if you sign up in December at any level you will become a Founding Member and be granted Eternal Ghostie Benefits. Learn more at https://www.patreon.com/holyghosting Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-12-02T08:00:00Z",
      "duration": "01:11:26.2750000",
      "explicit": true,
      "spotifyId": "5XB3AyJb8P6wrbFjDGvTV8",
      "appleId": 1000588450442,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5XB3AyJb8P6wrbFjDGvTV8",
        "apple": "https://podcasts.apple.com/podcast/giving-up-the-ghost/id1627628186?i=1000588450442"
      }
    },
    {
      "id": "c7f9db9c-f531-4f51-bf01-dea74c7b4628",
      "title": "The White Elephant Gift to Our Ghosties",
      "description": "Hiiiii! We’re surprising you this week with an extra special bonus extravaganza bonanza to let our beautiful Ghosties know we’ve launched a *drumrollllllllll* Patreon. Can you even believe it? You can?? Well, good. Because it’s the gospel truth. We wanted to let y’all know that you, if you are so bold as to join the Ghostie brigade at any level before 12:00 AM on January 1, 2023, you’ll be an Eternal Ghostie with all access to everything we create now and into perpetuity, or until we all die, whatever comes first. That’s wild! It’s amazing! It’s….some might say…”priceless.” Stay tuned \u0027till the end of the episode for all the amazing details, but spoiler, you can just go to Patreon.com/HolyGhosting to join today - and tell all your Ghost-like friends, because this will be a one-time deal December ONLY (P.S. But, also, like, now, so some of November too). Come to the altar today, folks, and commit your life to…honestly, whatever you want or don\u0027t, but more importantly, let’s be friends and you do you! *kiss-kiss* Anyway - this episode is bonus in the most bonusey way because it’s a behind the scenes welcome into the inner world of your middle aged mom friends as we talk amongst themselves to get ready to record an episode. Join us in taking the Spiritual Gifts Quiz at www.giftstest.com (not a sponsor! We got nothin’ from them besides a list of our top five spiritual gifts, straight from the mouth of our sweet baby Yoda). Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-11-19T06:00:00Z",
      "duration": "00:45:27.2620000",
      "explicit": true,
      "spotifyId": "2RdcpS3eS3vpQDz0sdgx60",
      "appleId": 1000586780236,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2RdcpS3eS3vpQDz0sdgx60",
        "apple": "https://podcasts.apple.com/podcast/the-white-elephant-gift-to-our-ghosties/id1627628186?i=1000586780236"
      }
    },
    {
      "id": "57f5b1a4-645e-4849-9a99-e73eeb70cf72",
      "title": "Your Holiday (Spiritual) Gift Guide",
      "description": "Every holiday season brings tidings of great joy and shiny toys for the girls and boys (and people) who celebrate whatever holidays. For evangelical kids, the gifts kept giving all year long, because ours were…spiritual. Join Lindsay, Meg, and Sarai as they troll through their past and reanimate their spiritual ghosts, we mean gifts. Remember words normals never use (exhortation, anyone??), join us as we talk through the controversy surrounding tongues (with and without interpretation, nerds), and rediscover one key gift all three of us share: Discernment. (We will wait for your collective gasp!) Ever wonder what spiritual gifts were all about? Even if you don’t believe the stuff you were raised with, what can we do with this information? Turns out Discernment is a pretty rad signifier of having intuition and listening to it. And, the gift of Administration leads a kid to just absolutely love paperwork and be the boss-betch of the world. And of course, Hospitality makes all potlucks possible - and science says nobody can survive without being forced to eat room temperature green bean casserole at least once. Plus! Bonus: Stay tuned next week for a special release (Our Spiritual Gift to you, dear Ghostie), as we release behind the scenes content of the three of us middle aged mom friends reconstructing our top five spiritual gifts, and deconstructing the leftover shreds of pain and shame and doubt and turning them to wailing laughter and hopefully, something useful we can all still take from our experience. Yay! It’s fun! It’s gifts! Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-11-11T08:00:00Z",
      "duration": "00:46:48.0320000",
      "explicit": true,
      "spotifyId": "41gRMNSnCxIR98hvF5VWSB",
      "appleId": 1000585848192,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/41gRMNSnCxIR98hvF5VWSB",
        "apple": "https://podcasts.apple.com/podcast/your-holiday-spiritual-gift-guide/id1627628186?i=1000585848192"
      }
    },
    {
      "id": "53fc0d08-9d13-4fc2-8338-e9b2e9e6fa7b",
      "title": "Little Rebellions",
      "description": "What’s one thing you regret NOT doing as a young evangelical? If you’re like us, it probably had something to do with sex. Don’t worry, the entire episode isn’t about premarital sexual things…but most of it is. So, content warning for those of you who want to be the ones to tell your teens that self-pleasure is good and to worry more about giving consent and getting consent than crossing an imaginary purity boundary imposed by people that were obsessed with our virginity. But that isn’t the only thing these Good Christian Girls®, Lindsay, Meg, and Sarai, rebelled against. This week we’re gossiping about our younger selves and revealing the secrets we thought would stay in our journals until we died, or until we burned them in a cleansing ritual (you guess if it’ll be the holy kind or the witchy kind). We want to hear your stories of rebellion, too. How did you rebuke the church elders or reply to a bat-shit-crazy interpretation of scripture or call out the youth pastor? Send us your stories and we’ll share them with our community. We’re louder together and they can’t shut us ALL up. Oh. And for the faithful reader and listener...there\u0027s a bonus ending if your loyalty and patience are never-ending. Hint: If you\u0027re a Marvel fan, you know to wait. TikTok @holyghosting IG @holyghostingpod Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-10-28T07:00:00Z",
      "duration": "00:53:56.3620000",
      "explicit": true,
      "spotifyId": "6YfvSw0gdZnlYb4E5lGnFJ",
      "appleId": 1000584200728,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YfvSw0gdZnlYb4E5lGnFJ",
        "apple": "https://podcasts.apple.com/podcast/little-rebellions/id1627628186?i=1000584200728"
      }
    },
    {
      "id": "815125d6-003d-4bde-9f5c-19c69434353c",
      "title": "The Elephant in the Room: Evangelicals, White Nationalism, and the GOP",
      "description": "SURPRISE! We couldn\u0027t stay quiet about politics...so we\u0027re sharing a bonus episode! Our advice in a nutshell? Vote your VALUES. If you “search engine” * the term “What should I NEVER talk about?” you’ll get a lot of lists. Most of those lists include sex, death, money, and especially religion and politics. Unfortunately, for those consumed with propriety, this podcast pretty much covers all of them at one point or another. In this episode, join your favorite throuple, Lindsay, Meg, and Sarai, to learn about how their Evangelical upbringing informed (or misinformed, more accurately) the shape of their political lives and choices. From being raised on a steady diet of Rush Limbaugh to using Christian Voter Guides -- codename: “how to be a Republican no matter how far it leads you from your supposed ‘biblical worldview’ -- to how the three of them have unraveled themselves from the entanglement of the church and the right-wing in America. Important sidebars and rabbit** trails this episode include: health care is a human right, Oregon-specific political rants, and the strange affection Lindsay and Sarai both harbor toward the fearfully departed Limbaugh, PLUS a surprise worship song that is sure to tug at your heartstrings. It was written and performed by Kermit The Frog, originally. Want to chat about fun (read: terrible) things like Christian Nationalism (aka White Supremacy and Colonialist Idealism) and wonderful things (read: actually wonderful) like voting by mail? Hit us up. And we’d love, as always, to hear your stories about this work of dismantling your ideologies after Evangelicalism. Or during it, in some cases, which, wow, that is a trip. Or a stumble, depending on who you ask. TikTok @holyghosting IG @holyghostingpod *looking at you, Google, you don’t get a mention unless you sponsor this podcast **don\u0027t worry there isn\u0027t another terrible story involving a rabbit in this episode (but if you missed that one, check out our Halloween Episode!) Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-10-21T07:00:00Z",
      "duration": "00:56:57.4950000",
      "explicit": true,
      "spotifyId": "5Nod5Hbn1ClE2kKqbFf2Vf",
      "appleId": 1000583389701,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Nod5Hbn1ClE2kKqbFf2Vf",
        "apple": "https://podcasts.apple.com/podcast/the-elephant-in-the-room-evangelicals-white/id1627628186?i=1000583389701"
      }
    },
    {
      "id": "a1417e19-657d-4b62-8b40-540c8dd6cb95",
      "title": "To Hell with the Devil’s Holiday: How we learned to ditch the harvest party \u0026 embrace Halloween",
      "description": "Before we dive into the good, clean fun (explicit fun, so with all the swears still) of the episode, please take note if you are a human with regular human emotions. This episode contains a few campfire horror stories about strange events and spooky shit that happened in our youths. Content warning includes: demon possession, youth pastors grooming…well, youth, animal death (in a DEEPLY disturbing way), and, if you love Sarai’s conspiracy theories, there’s a real humdinger in this episode. For the bravest among us who can wade these dark and murky waters, carry on. As Good Christian Girls®, Lindsay, Meg, and Sarai grew up in the shadow of the Satanic Panic, which made Halloween a ghastly time for Evangelicals. To create a safe haven from the ghosts and witches and satan worshippers (can we stop for a moment and appreciate that this was a THING we all learned??? That satan worshippers are marauding about your suburbs and sacrificing stray cats??)…ahem, the safe haven, that is, was one that was nestled inside the holy walls of a church. Harvest Parties! (Or Harvest Festivals! If you were extra). Wind your way through the emerging Halloween appreciation your 40-Something Mom Friends are experiencing in their own special ways. And then?? Then! Get on the sosh meeds and tell us your favorite Evangelical childhood antics - anybody dress up like Larry the Cucumber? We need to know, and we need to see the photographic evidence, PLEASE! TikTok @holyghosting IG @holyghostingpod Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-10-14T07:00:00Z",
      "duration": "00:56:13.8710000",
      "explicit": true,
      "spotifyId": "6n7NskY7zs1JTfD0DBJLW2",
      "appleId": 1000582621193,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6n7NskY7zs1JTfD0DBJLW2",
        "apple": "https://podcasts.apple.com/podcast/to-hell-with-the-devils-holiday-how-we-learned-to/id1627628186?i=1000582621193"
      }
    },
    {
      "id": "9d975daa-accd-498f-a3a8-af6f5bd7f432",
      "title": "Prayer is Just Casting Spells: an Interview with Dr. Melissa Bird, Christian Witch",
      "description": "Witches and Christians haven’t always enjoyed one another’s company (see: all of church history, witch hunts, etc), but what if there’s more to it than ladies with ergot poisoning who may or may not have rode brooms around the house as a way to…pleasure…themselves…and a systematic femicide perpetuated by the patriarchy? When we met Dr. Melissa Bird and heard about her work as a Christian witch, we had to know more. Join your triumphant trio of 40-something moms to learn how there just might be room in the world to make space for all of who we are. Even if we’re charting new territory. In fact, it’s not really new at all - it’s just casting spells aka prayer and joining into the ongoing work of creation. Content heads up for this episode: prepare to hear the worst (or most epic) pickup line in the history of pickup hackery. Other than that, it’s rather shockingly trauma free for once. Awaken your own graceful revolution and connect with Dr. Bird drmelissabird.com FB, Twitter, TikTok, and IG @birdgirl1001 A message for our listeners from Dr. Melissa Bird: For the last 3 months of 2022 I am offering a special 3 month coaching package. 7 1:1 coaching sessions, 1 misfit magic hour, 2 clairvoyant meditations. https://www.drmelissabird.com/coachingoffer Through the month of October I am offering a Misfit Magic Hour BOGO special buy one get the next 50% off. 2 1 hour readings! Whoohoo! https://www.drmelissabird.com/misfit-magic-hour I am booking speaking engagements at spiritual and religious conferences for women. Here is the link to learn more about my speaking https://www.drmelissabird.com/live-events Books Dr. Bird Recommends: Mary Magdalene Revealed by Meggan Watterson Waking the Witch by Pam Grossman Inspired by Rachel Held Evans If Women Rose Rooted by Sharon Blackie Wholehearted Faith by Rachel Held Evans Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-09-30T07:00:00Z",
      "duration": "00:52:04.2180000",
      "explicit": true,
      "spotifyId": "3rsUKefVzNLEKWL1HwwdRk",
      "appleId": 1000581121682,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rsUKefVzNLEKWL1HwwdRk",
        "apple": "https://podcasts.apple.com/podcast/prayer-is-just-casting-spells-an-interview-with/id1627628186?i=1000581121682"
      }
    },
    {
      "id": "67ba5520-6848-4ff8-b547-02c9edcabeda",
      "title": "Travel the World on God’s Dime! Short Term Missions",
      "description": "Something Old, Something New: a Tale of Two Mexicos Plus: save your soul and the world, inquire inside! If you were an evangelical in your coming of age period at the turn of the millennium, you or several of your close God-fearing friends took a mission trip (or dozens). Mission trips were like…I guess a wandering train of [Jesus] Freaks setting up shop in one nation or another. Instead of fortune tellers, strongmen, and bearded ladies, mission trips brought a gimmicky way to “spread the gospel”. Anyhoo, these trips were SO emo. We all got on board a bus or a plane or some kid’s mom’s minivan and entered the mission field. Once there, we’d build (and/or rebuild - allegedly) a playground or a church or an orphanage, or dress up like mimes, or stand on actual soapboxes on street corners - all to shout about the wonderful plan Jesus has for your life. Then, Mission Accomplished, we would leave enriched with culture, travel, and the uncanny feeling that perhaps this trip was for us all along. We’d reflect, shocked, that maybe we learned more from the people we came to help than we ever had to teach them. White saviors start early. Lindsay, Meg, and Sarai talk about their experiences going to exotic places (including Oklahoma!!), spreading the gospel like a linen duvet cover (shout out to our 40-ish mom friends!). Cringe your way through the past and remember that oh, so fresh feeling of saving souls and taking names. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-09-17T03:30:00Z",
      "duration": "01:10:47.6400000",
      "explicit": true,
      "spotifyId": "64cxbyrCC2sOay6ASAEIY1",
      "appleId": 1000579752929,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/64cxbyrCC2sOay6ASAEIY1",
        "apple": "https://podcasts.apple.com/podcast/travel-the-world-on-gods-dime-short-term-missions/id1627628186?i=1000579752929"
      }
    },
    {
      "id": "c39dccc5-37df-4bec-b3c3-14b0311edc60",
      "title": "The Proverbs 31 Woman, Capitalism \u0026 Naps",
      "description": "Chances are if you were assigned the tender feminine gender at your evangelical birth, well, ya probably have a lot of baggage and issues that stem from questionable portrayals of women in the Bible. Among the vagina-laden humans celebrated in the canon, we have everyone from a literal teenager, whose virginity inspired millennia of penis-havers to idolize purity, to the wily, vengeful Judge Deborah, who straight up murdered a Philistine with a wicked tent peg through the temple. Pretty badass, tbh. But greatest among these female role models, as few and scattered they were amid the many, many Jezebel-style characters (by the way, “eaten by dogs” is my preferred way to describe a death)…there stood alone a perfect prototype of the ideal wife. The Proverbs 31 Woman. This strong, gluten-free woman (she eats not the bread of idleness), stays awake all damn night working on her embroideries and preserves, dresses her children in scarlet, herself in purple and linens, and gets busy making food, importing and exporting goods, feeding the poor, feeding her lovin’ man/king, and fully celebrated by all excellence at everything. She surpasses all other women with her tireless, industrious, wise work ethic. But when does she get to take a damn nap? Join your new favorite heretics as they discuss what The Proverbs 31 Woman meant to them, why 3/3rds of them *still* have a hard time letting their lamp go out by night, and where and how we might like to grow in perhaps less hurried and productive ways. Welcome to radical uselessness. And yeah, you can wear all the scarlet and purple and strength and dignity you can handle - no shame in that. Just know that it’s good to take a beat sometimes and even better to remember this P 31 woman (as I’ve seen her referred to on her most devoted fan websites) - she was never a real person at all. What if we could become our own heroes instead of living up to an impossible idea? What if we got to enjoy the fruit of our labor too? Let’s try it. After we take a wee nap. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-08-13T21:05:00Z",
      "duration": "01:02:36.2250000",
      "explicit": true,
      "spotifyId": "50b7bO6UEvK7UsT4WtxhIt",
      "appleId": 1000575990501,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/50b7bO6UEvK7UsT4WtxhIt",
        "apple": "https://podcasts.apple.com/podcast/the-proverbs-31-woman-capitalism-naps/id1627628186?i=1000575990501"
      }
    },
    {
      "id": "e79b9038-c176-47f1-a4e8-80c8094e5474",
      "title": "The Object of My Affliction",
      "description": "In the harrowing days of puberty, evangelical young women and girls were foisted into a shame spiral that kept them tame and readily codependent for…maybe their entire lives. Their every move governed by the grave understanding that it was their job to “not cause your brother to stumble,” they walked about with hunched shoulders, tucked their butts, and generally shut their every desire or bodily sensation DOWN, and fast. They were especially horrified by their own breasticles, as they seemed to cause their “brothers” to stumble despite their best efforts to wear Modest Is Hottest fashion (read: not fashion). Join Lindsay, Meg, and Sarai - three cisgendered ladies whose boobs have haunted them their entire post-pubescent lives - as they uncover the real meaning behind the context of that stupid “brothers stumbling” BS, and reckon with the aftermath of blaming oneself for literally everybody else’s problems and working their lifelong butts off to appease and make others feel more comfortable in their presence. If you’re a former church kid who grew up when Modest really was Hottest, whether cis, trans, queer, or straight, you’ll recognize these damaging ideas. Hopefully, as these three boob-havers discuss their experiences with the oppression and abuse grooming inherent in Purity Culture, you might be able to unwind a little bit of your own bosom-or non-bosom related woes. Good news, though: knowing is half the battle, and…half is pretty good progress, tbh. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-07-16T01:00:00Z",
      "duration": "00:55:15.3300000",
      "explicit": true,
      "spotifyId": "0CIHXrhJbMl77sIHLa1fZh",
      "appleId": 1000570073211,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CIHXrhJbMl77sIHLa1fZh",
        "apple": "https://podcasts.apple.com/podcast/the-object-of-my-affliction/id1627628186?i=1000570073211"
      }
    },
    {
      "id": "24df9850-65d5-47f7-854b-44080334d229",
      "title": "Best Of: Let\u0027s Talk About Camp, Baby!",
      "description": "Season 1 | Episode 3\n\nJoin Lindsay, Meg \u0026 Sarai your favorite middle-aged mom friends as they talk about Camp, Baby!\n\nFrom the one-piece swimsuits and the oversized free t-shirts all the way to the tearful confessionals and personal testimonies around a bonfire, Evangelical Christian summer camps were a masterpiece of emotional manipulation and unadulterated peer on peer action. \n\nLindsay, Meg, and Sarai - a bevy of former camp attendees (and a lifer in the bunch, who would reconvert TODAY if a lifelong summer camp job opened up for her) - as they discuss the Camp ExperienceTM. Whether they were finding sneaky ways to be near crushes, witnessing gross-out challenges in the mess hall, or reliving an experience with a rattlesnake that is less parable and more badass than you\u0027d expect, these maidens were camp mavens. \n\nIf you’re a former church kid who grew up going to camp, you’ll find some familiar tales of the dust-laden camps where craft shacks ruled the day, all the way to the fanciest-pants California camps with pools and comparatively luxurious cabins *with bathrooms INSIDE THEM*, and hopefully, it will be a relatively soothing trip down memory lane. Hey, even Exvangelicals need a break sometimes, and what’s better than some good, clean, camp-based fun?",
      "release": "2022-07-02T01:59:00Z",
      "duration": "00:41:44.1760000",
      "explicit": true,
      "spotifyId": "3gMTjyQjCMgWlHvJckXv59",
      "appleId": 1000568521880,
      "youTubeId": "Rik22SpEf84",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3gMTjyQjCMgWlHvJckXv59",
        "apple": "https://podcasts.apple.com/podcast/lets-talk-about-camp-baby/id1627628186?i=1000568521880",
        "youtube": "https://www.youtube.com/watch?v=Rik22SpEf84"
      }
    },
    {
      "id": "6e2b733d-fb26-4e45-a42a-84ff09c5adce",
      "title": "Let\u0027s Talk About Camp, Baby!",
      "description": "From the one-piece swimsuits and the oversized free t-shirts all the way to the tearful confessionals and personal testimonies around a bonfire, Evangelical Christian summer camps were a masterpiece of emotional manipulation and unadulterated peer on peer action. Join Lindsay, Meg, and Sarai - a bevy of former camp attendees (and a lifer in the bunch, who would reconvert TODAY if a lifelong summer camp job opened up for her) - as they discuss the Camp ExperienceTM. Whether they were finding sneaky ways to be near crushes, witnessing gross-out challenges in the mess hall, or reliving an experience with a rattlesnake that is less parable and more badass than you\u0027d expect, these maidens were camp mavens. If you’re a former church kid who grew up going to camp, you’ll find some familiar tales of the dust-laden camps where craft shacks ruled the day, all the way to the fanciest-pants California camps with pools and comparatively luxurious cabins *with bathrooms INSIDE THEM*, and hopefully, it will be a relatively soothing trip down memory lane. Hey, even Exvangelicals need a break sometimes, and what’s better than some good, clean, camp-based fun? Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-07-02T00:00:00",
      "duration": "00:36:45.2830000",
      "explicit": true,
      "spotifyId": "7kYGnvsFiSItrxWcQ7qI5X",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7kYGnvsFiSItrxWcQ7qI5X"
      }
    },
    {
      "id": "242a587a-a09d-47aa-822f-30c2f115ec00",
      "title": "It Was Never About Babies",
      "description": "What does one do with the conundrum of abortion? When Lindsay, Meg, and Sarai were growing up, the Evangelical Christian stance on abortion was never, ever, no way, no how. The church made specious (and racist, xenophobic, peri-holocaust denying or at best minimizing) arguments meant to tug at the heartstrings of nice, Christian, white ladies. Present-day: billboards litter the interstates of America, showing bright-eyed (almost exclusively white) babies with ominous words like “abortion stops a beating heart” emblazoned across their tidily diapered butts; pro-choice and pro-life people don’t even speak the same language much less know how to fight in the same battle; and the powers that be have successfully edged Roe v Wade toward the dustbin of history. Enter some deconstructing, young former Evangelicals (one of whom shamefully admitted she voted for George W. Bush…TWICE) and they start to ask questions about this once untouchable medical procedure. Your 40-ish mom friends talk through the taboo tornado of purity culture (patriarchy), Nice Christian White Ladies (white supremacy), and hit action movies from bygone decades, oh and abortion...all while we realize it was never really about the babies…and Evangelicals didn’t give any toots about abortion until, like, a year or two before our hosts were all born. How would we have known when we were standing on the streets in our respective hometowns begging people to just realize that life begins at conception (but where does conception begin? Oh…I think we’re in an inception now)…anyway…give it a listen! And join the conversation with us at HolyGhosting.com TikTok@holyghosting Instagram \u0026 Twitter @holyghostingpod If you or someone you know needs abortion healthcare call the NAF Hotline at 1-800-772-9100 for help and to learn about safe options for ending a pregnancy. ProChoice.org Samatha Bee Episode Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-06-17T13:00:00Z",
      "duration": "00:52:06.5950000",
      "explicit": true,
      "spotifyId": "6zu5MZZ6SjmJWpufveIJH6",
      "appleId": 1000566806080,
      "subjects": [
        "Evangelicalism",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6zu5MZZ6SjmJWpufveIJH6",
        "apple": "https://podcasts.apple.com/podcast/it-was-never-about-babies/id1627628186?i=1000566806080"
      }
    },
    {
      "id": "aeb85eea-dede-4316-980b-408197aeda8b",
      "title": "Panic! At The Altar",
      "description": "Here we are, June of 2022. Welcome summer, and farewell Mental Health Awareness Month (May!). But if we go back in time, just a little bit, to remember the good old days of the freewheeling 1980’s - when Evangelical churches and politicians were in the golden age of knitting together the interests of church and state (so cute!)…people were too busy to talk about mental health (at least not at church)…even though Mental Health Awareness Month started WAY BACK in 1949 - oh, we’ve had Mental Health issues all along as humans? No Way! In this inaugural episode of Holy Ghosting, you’ll meet Lindsay, Meg, and Sarai - a bunch of former church girls who came of age in 80s and 90s American Evangelicalism. With a veritable host of mental health diagnoses between them, you’ll learn more than you ever thought you’d want to know about their own journeys through mental health by way of the church, and you might find echoes of your own experience if you were once a church kid too. We cover everything from the laying on of hands, the shame of mental health issues, using the Bible as therapy (instead of therapy because that wasn’t a thing we ever considered doing), and everything from visual hallucinations to the revolutionary idea that maybe, just maybe, telling other people the truth about our own mental wellbeing can help everybody be a little safer and a little better. If you or someone you know needs mental health support: text BRAVE to the Crisis Text Line at 741741 A trained crisis counselor will receive it and respond within minutes. Then, the crisis counselor will help you de-escalate your situation and connect you to help locally. Support this podcast at — https://redcircle.com/holy-ghosting/exclusive-content Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2022-06-03T13:30:00Z",
      "duration": "00:57:44.1240000",
      "explicit": true,
      "spotifyId": "4G1I7oakRAoh3GzJNvHqzI",
      "appleId": 1000565129088,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4G1I7oakRAoh3GzJNvHqzI",
        "apple": "https://podcasts.apple.com/podcast/panic-at-the-altar/id1627628186?i=1000565129088"
      }
    }
  ]
}