{
  "id": "b282e8e0-0e51-4692-9502-f6d60dc846d0",
  "name": "Holy Watermelon",
  "spotifyId": "6WRR3gXItYrJEu5J27dWHw",
  "appleId": 1534587756,
  "episodes": [
    {
      "id": "8ffc8816-af6b-4a98-8ebb-84878443f7f0",
      "title": "How YOU Could Become a God",
      "description": "Apotheosis is the process of becoming a god, and that gift isn\u0027t always limited to the dead. Some classic examples include Asclepius, Ariadne, and Glaucus. Apotheosis also appears in the Abrahamic tradition, in a varity of manifestations, including the Alawite tradition, which elevates Ali ibn Abi Talib to godhood. We examine the diference between Apotheosis and Theosis in the Christian tradition. Preston expounds on the exaltation promised in the Latter-day Saint tradition. We look at the worship of mortals in cults of personality (Jim Jones, Amy Carlson, Joseph Kony, Nirmala Srivastava, and Alan John Miller), the god kings of the empires, and those who were deified posthumously by their followers (Buddha, Hitler, Washington, Pythagoras, Mother Mary, Saint Teresa of Calcutta), and even some who were involuntarily deified in their lifetimes (Raj Patel, Kumari, Prince Philip, as well as some of the old Apostles of Christ). There\u0027s also the wonder of Apocolocyntosis (divi) Claudi, or pumpkinification, the extravagant or absurdly uncritical glorification of a person. All this and more.... Support us on Patreon or you can get our merch at Spreadshop . Join the Community on Discord . Learn more great religion factoids on Facebook and Instagram .",
      "release": "2024-02-26T09:00:00Z",
      "duration": "00:59:09.3360000",
      "explicit": true,
      "spotifyId": "4wkOWEfGfngQDUWLIpIw93",
      "appleId": 1000646850916,
      "subjects": [
        "Peoples Temple",
        "Love Has Won",
        "Divine Truth",
        "Nirmala Srivastava"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wkOWEfGfngQDUWLIpIw93",
        "apple": "https://podcasts.apple.com/podcast/how-you-could-become-a-god/id1534587756?i=1000646850916"
      }
    }
  ]
}