{
  "id": "02e92c28-e680-4a51-a536-54ac28e74ba5",
  "name": "Hoodwinked with Dr. Mara Einstein",
  "spotifyId": "4MPp2hiip2CaSdOqSbWObh",
  "appleId": 1847768908,
  "youTubeChannelId": "UCSV_OXecDvswqCvgDlSNg5A",
  "youTubePlaylistId": "PLaQ5rhKfgu6LVAt7wJgX2ZPPKy7kSMHgo",
  "episodes": [
    {
      "id": "b66530f5-b718-4492-bff8-0eea584d50d3",
      "title": "What is a cult?",
      "description": "What exactly is a cult—and how is it different from religion? In this opening episode, Dr. Mara Einstein sits down with Kathryn Lofton, one of today’s most incisive scholars of religion and culture, to unpack how belief, devotion, and consumer behavior intertwine. From worshiping gods to worshiping brands, Lofton and Einstein explore how modern life blurs the line between the sacred and the sold. Mentions: Oprah: The Gospel of an Icon by Kathryn Lofton Consuming Religion by Kathryn Lofton Amusing Ourselves to Death by Neil Postman The Cult of Thinness by Sharlene Nagy Hesse-Biber About the guest Kathryn Lofton is Lex Hixon Professor of Religious Studies and American Studies, History and Divinity, at Yale University. She is the author of two books, Consuming Religion and Oprah: The Gospel of an Icon. Learn more about Kathryn’s work: https://religiousstudies.yale.edu/people/kathryn-lofton About the host Dr. Mara Einstein spent a decade in corporate marketing working for some of the world’s biggest brands before turning her focus to exposing the industry’s inner workings. Now a tenured professor of media studies at CUNY, she’s dedicated to helping people understand how marketing shapes what we buy, what we believe, and even who we think we are. With a background spanning business, media, and the arts, Dr. Einstein brings sharp insight and humor to the systems that sell us our identities—and the power we have to push back. Pick up Dr. Einstein’s book Hoodwinked: How Marketers Use the Same Tactics as Cults on Bookshop.org (and beyond): https://bookshop.org/a/116018/9781493086153 Website: https://www.drmaraeinstein.com Books: https://www.drmaraeinstein.com/writing Instagram, TikTok, Threads: @drmaraeinstein YouTube: https://www.youtube.com/@Drmaraeinstein Credits Production: Multitude Lead Producer \u0026 Editor: Bren Frederick Music: Marc Langer Cover art: Cayla Einstein See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-10-30T09:00:00Z",
      "duration": "00:41:33.9880000",
      "explicit": false,
      "spotifyId": "6n8kxgqaLQHNSBtxfr5mZB",
      "appleId": 1000734185864,
      "youTubeId": "z829vOLjNfo",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6n8kxgqaLQHNSBtxfr5mZB",
        "apple": "https://podcasts.apple.com/podcast/what-is-a-cult/id1847768908?i=1000734185864",
        "youtube": "https://www.youtube.com/watch?v=z829vOLjNfo"
      }
    }
  ]
}