{
  "_ts": 0,
  "id": "d49aa8ef-24b3-450a-8fd4-c2a3b8d9348d",
  "name": "HoosLeft Podcast",
  "spotifyId": "71ne0HBwEGf4SfamvkhrP7",
  "appleId": 1670253397,
  "youTubeChannelId": "UCme0SgwqiRD3qicIMf1XS-A",
  "episodes": [
    {
      "id": "2ddd8059-13fb-49ad-934c-1f9ce1ee5150",
      "title": "Episode 77: Wait, Are WE In a Cult?",
      "description": "Guest: Leslie Nuss - Singer/Songwriter, Disability Rights Advocate, and Former Candidate for Indiana State Senate\n\n\nFull show notes at https://hoosleft.us/\n\n\nLeslie’s Music on Bandcamp: https://leslienuss.bandcamp.com/\n\n\n2024 Campaign Website: https://www.nussforus.com/\n\n\nWelcome to the HoosLeft Podcast, a show about Indiana politics, history, and culture from the unapologetic perspective of the social democratic left. My name is Scott Aaron Rogers, and I’m recording from Bloomington.\n\n\nI didn’t start this podcast intending to focus on thought control, social manipulation, cult dynamics, and myth-making, but these themes keep coming up again and again. Companies, politicians, and foreign governments alike are using technology and methodology to influence our thoughts, beliefs, and behaviors all around us, at all times. From Dr. Steven Hassan’s Influence Continuum,\n\n\n“From the moment we are born, we are constantly being influenced by all kinds of people, ideas, and forces. Some of this influence is healthy, and promotes our ability to grow into independent, fulfilled, authentic adults.\n\n\nOther forms of influence instill dependency and obedience, at times even indoctrinating people to harm themselves and others. There is a wide spectrum of healthy and unhealthy influence. Individual experiences vary within the same organization based on how the individual conforms to the norms of the group. For example, a lesbian teen in a homophobic church will be subject to a different degree of undue influence than a straight man who is married with children in the same church.”\n\n\nWe talk about folks on the political right being caught up in the cult of Trump, or being brainwashed by Fox News, but as we learned from Dr. Dustin Steinhagen several months ago, everybody is susceptible to thought control - and those most likely to fall prey to such manipulation are those who think it can’t happen to them. Humility is the key to maintaining sovereignty over your mind.\n\n\nSo, knowing that, and knowing this is going on all around us, I think it’s important to ask ourselves how we’ve been influenced - sometimes in healthy and constructive ways, and other times in unhealthy and destructive ways. Why do we believe what we believe, and value what we value?\n\n\nMy guest today is a return visitor to our show. Leslie Nuss is a singer-songwriter, disability rights advocate, and former candidate for Indiana State Senate, sadly losing to incumbent Republican Ed Charbonneau in November. She also introduced me to Dr. Steinhagen’s work, so I invited her to have this big conversation with us today.\n\n\nIn this discussion, we’ll look at the MAGA cult before talking about what shaped our beliefs and values, our own vulnerabilities, and whether leftists and liberals have our own cultic subcultures. We’ll examine the ways our thoughts about America, democracy, and capitalism have been shaped since our youth, and how some of our foundational values are based on myth. We’ll talk about free speech, authoritarianism, and the fluid meaning of words.\n\n\nReal quick before we jump to the interview, please consider supporting HoosLeft with a paid subscription. This is an independent media project; I don’t paywall content; and I don’t rely on advertising. I depend on individuals like you. So please, if you find value in my work, go to HoosLeft.us and subscribe at the paid level - it’s only $5 a month, or $50 a year, to help me write more, research more, and organize more. You can even throw a one-time contribution in my hat on Cash App (https://cash.app/$scottrog78)  or Venmo (https://account.venmo.com/u/hoosleft) . I would like to dedicate my full time to you, this project, and Indiana’s future; but I need your financial support to do so. And right now, I’m offering yearly subscriptions for $30 until the end of April.\n\n\nAnd there are other ways to help grow this community - by liking and sharing on social media, commenting, leaving reviews, providing feedback, and forwarding articles to your people. We are building a community of Hoosiers dedicated to making this state, and its government, work for all of us, not just the elite few. \n\n\nFollow us on Facebook, Bluesky, YouTube, and TikTok at HoosLeft, and I’m personally at scottrog78 on Instagram, Threads, Twitter and Mastodon. Tell the others. Let’s build a radically-democratic Indiana together. Thanks again.\n\n\nNow, here is my conversation with Leslie Nuss.\n\n\n\n\n\nPlease consider a paid subscription to keep this project going.\n\n\n\n\n\nThings We Talked About:\n\n\nMy Interview with Jen Senko: https://www.hoosleft.us/p/episode-63-the-brainwashing-of-our (https://www.hoosleft.us/p/episode-63-the-brainwashing-of-our?r=1ss5n3) \n\n\nMy Interview with Dylan Noble: https://www.hoosleft.us/p/episode-62-saving-young-men-from (https://www.hoosleft.us/p/episode-62-saving-young-men-from?r=1ss5n3) \n\n\nMy Interview with Dustin Steinhagen: https://www.hoosleft.us/p/episode-70-defending-our-minds-fro...",
      "release": "2025-04-19T22:46:37Z",
      "duration": "01:12:38",
      "explicit": false,
      "spotifyId": "6tpcnGhTLrX9PZArXkTGFe",
      "appleId": 1000704144405,
      "youTubeId": "QYBMlwkY5os",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6tpcnGhTLrX9PZArXkTGFe",
        "apple": "https://podcasts.apple.com/podcast/episode-77-wait-are-we-in-a-cult/id1670253397?i=1000704144405",
        "youtube": "https://www.youtube.com/watch?v=QYBMlwkY5os"
      }
    },
    {
      "id": "924e01ca-5106-4a4a-86a7-e472739bc8ad",
      "title": "Episode 70: Defending Our Minds from Psychological Manipulation",
      "description": "Episode 70: Defending Our Minds from Psychological Manipulation Guest: Dr. Dustin Rozario Steinhagen Full show notes at https://hoosleft.us/ Find Dustin at https://dustinsteinhagen.wordpress.com/ Welcome to the HoosLeft Podcast, a show about Indiana politics, history, and culture from the unapologetic perspective of the social democratic left. My name is Scott Aaron Rogers, and I’m recording from Bloomington. A while back, friend of the pod Leslie Nuss, last year’s Democratic candidate for Indiana State Senate up in District 5 - who we need to get back on the show real soon - told me she was about to have a Zoom with a fascinating researcher named Dustin Rozario Steinhagen. Dustin, who completed his doctorate last July, was coming off a recent appearance on the popular podcast, The Influence Continuum with cult expert, Dr. Steven Hassan . I listened to their discussion and thought we could all benefit to hear from Dr. Steinhagen, one of very few researchers working at the intersection of mind control and cybersecurity. His dissertation begins thusly: “Thought reform – also known as brainwashing or psychological manipulation – is a profound threat to the security of the human mind. This complex form of social engineering is associated with terrorist movements, domestic abuse, destructive cults, and many other forms of totalitarianism present in society (Stein, 2017). Thought reform can result in various harms that range in severity depending on each person’s individual experience (Lalich \u0026 Tobias, 2006; Stein, 2017). The work of security and privacy professionals inherently concerns psychological manipulation – thought reform often occurs over the internet (Hassan \u0026 Shah, 2019), most data breaches occur due to one or more people being maliciously influenced by attackers (Hadnagy, 2018), and the topics of coercion, psychological manipulation, and undue influence have garnered increased attention from privacy and cybersecurity scholars in recent years due to their central role in perpetuating online privacy harms (Citron \u0026 Solove, 2022; Susser et al., 2019). The primary tactic for defending people against all forms of psychological exploitation is education and awareness about scams, fraud, and the ways in which attackers exploit human beings (Hadnagy, 2018).” In this conversation, we talk about the research at the center of Dustin’s doctoral thesis, define the scientific concept of psychological manipulation, and look at what kind of people are susceptible to it. Dr. Steinhagen introduces us to Robert Jay Lifton’s “Eight Criteria for Thought Reform,” and details how mental predators use these techniques online and in real life to groom people into an ideology. Finally, we’ll discuss the ways we as individuals, and together as a society, can defend ourselves from these tactics. Before we turn to the interview, thank you all for your support - for liking and sharing on social media, for forwarding our articles and podcast episodes, for commenting, leaving reviews, and providing feedback - and especially for the financial support paid subscriptions provide. Your contributions have helped me make meaningful connections with fascinating people from across Indiana, and beyond. We are building a network of Hoosiers dedicated to making this state, and its government, work for all of us, not just the elite few. I have so much more to give you, this community, and Indiana’s future; but the reality is I need financial support to do this work. All I’m asking is $5 a month, or $50 a year, to help me write more, research more, organize more, and keep improving HoosLeft. Improvements like our own domain, where it’s now much easier to find us. Visit HoosLeft.US for all of our articles, episodes, archives, and again, please consider a paid subscription while you’re there. We’re also on Facebook, Bluesky, YouTube, and TikTok at HoosLeft, and I’m still on Instagram, Threads, and Twitter at scottrog78 and scottrog78@hoosier.social on Mastodon. Tell the others. Let’s build a radically-democratic Indiana together. Thanks again. Now, here is my interview with Dr. Dustin Rozario Steinhagen. Please consider a paid subscription to keep this project going. Cited in the Interview Dustin’s Doctoral Dissertation: https://www.proquest.com/docview/3102571621 Dunning-Kruger Effect: https://www.psychologytoday.com/us/basics/dunning-kruger-effect Anyone Can Be Brainwashed: https://www.vice.com/en/article/a-cult-member-turned-expert-explains-how-anyone-can-be-brainwashed-2/ Margaret Singer: https://en.wikipedia.org/wiki/Margaret_Singer Robert Jay Lifton: https://www.robertjaylifton.com/ Steven Hassan: https://freedomofmind.com/ Philip Zimbardo: https://en.wikipedia.org/wiki/Philip_Zimbardo Lifton’s Eight Criteria for Thought Reform: https://en.wikipedia.org/wiki/Thought_Reform_and_the_Psychology_of_Totalism Cambridge Analytica Scandal: https://en.wikipedia.org/wiki/Facebook%E2%80%93Cambridge_Analytica_data_scandal 4th and 5th Generation Warfare: https://en.wikipedia.org/wiki/Generations_of_warfare Propaganda - Not Just For the Far-Right: * For leftists: https://gnet-research.org/2023/10/02/tankies-a-data-driven-understanding-of-left-wing-extremists-on-social-media/ * For centrists: https://www.france24.com/en/live-news/20240730-bending-of-reality-us-liberals-stoke-political-conspiracies Can Mind Control Techniques Ever Be Ethical? https://www.cpreview.org/articles/2023/4/censorship-to-what-extent-can-a-country-justify-media-regulation Seduced: Inside the NEXIVM Cult https://www.imdb.com/title/tt13269706/ Amygdala Hijack: https://www.verywellmind.com/what-happens-during-an-amygdala-hijack-4165944 Importance of Teaching Critical Thinking: https://www.theguardian.com/education/article/2024/aug/10/uk-children-to-be-taught-how-to-spot-extremist-content-and-misinformation-online Need for Federal Data Protection: https://epic.org/campaigns/dpa/ The Algorithm Knows You Better Than Friends \u0026 Family: https://www.gsb.stanford.edu/insights/michal-kosinski-computers-are-better-judges-your-personality-friends Sleep Deprivation as a Control Technique: https://www.alternet.org/2015/10/here-are-five-infamous-religious-cults-used-sleep-deprivation-control-their-followers# Importance of Maintaining Communication: https://www.psychologytoday.com/us/blog/freedom-mind/202104/the-definitive-guide-helping-people-trapped-in-cult Once again, that was Dr. Dustin Rozario Steinhagen, a scholar working at the crossroads of thought reform and cybersecurity. He gives us an important framework with which to look at the mind control techniques being employed all around us, at all times. We didn’t get to spend enough time talking about how to defend ourselves against malign influence, but he did devote significant space to this topic in his dissertation. So, let’s dig into it. As one of Dr. Steinhagen’s mentors, the computational psychologist Dr. Shimon Edelman, explains , the human brain is a computer and the mind is computation. And as such, it can be hacked. Cult leaders, con men, and despots all understand these mind tricks and utilize them to run different versions of the same scam - deceiving people into giving up their autonomy by unethical modification of their identities (Hassan, 2018; Singer, 2003). So, just the computers on our desktops and in our pockets are susceptible to viruses, so are our brains. In times gone by, these mind viruses (and I kinda hate to use that term because, like all things, it has been co-opted and weaponized by the right ) spread more slowly. Techniques of the analog era, like pamphlets and one-on-one recruiting, are the equivalent of taking a floppy disk from workstation to workstation to install a new program. We used to have to do it that way, old man yells at cloud. The internet has multiplied the problem exponentially. Social media is like plugging your head into LimeWire - you might download every song you ever wanted - and you might get brain AIDS. All of us are vulnerable, particularly in times of rapid change - war, natural disaster, economic instability, social upheaval - hey that sounds like now! The widespread uncertainty, isolation, and anomie leave individuals even riper for exploitation. And hey, that’s a 100 dollar word right there - anomie . The term, commonly understood to mean normlessness, was popularized by French sociologist Émile Durkheim , who defined it as \u0022derangement\u0022, and \u0022an insatiable will.\u0022 He used the term \u0022the malady of the infinite\u0022 because desire without limit can never be fulfilled; it only becomes more intense. For Durkheim, anomie arises more generally from a mismatch between personal or group standards and wider social standards; or from the lack of a social ethic . And if that doesn’t describe a handful of oligarchs commandeering the power of the state because, “well, that’s best for humanity in the reallllly long term \u0022, in a single word, I don’t know how to say it better. The point is, times of uncertainty leave people searching for answers. That is why - in the wake of widespread financial collapse, a global pandemic, and increasingly omnipresent planetary climate breakdown - folks turn to conspiracy theories and authoritarian movements for easy explanations and a sense of control. So, what is the vaccine to combat the mind virus? Scholars and experts have advocated for more legal protection, and more education in the areas of critical thinking, reasoning, and detecting faulty logic. Others suggest a public health approach - think anti-tobacco and safe-sex campaigns. Also needed are protections for journalists and whistle-blowers, data privacy, and fully-informed consent. I think it’s safe to say a Trump/Musk administration with RFK Jr acting as health czar - a conglomerate of con men completely dependent on the proliferation of lies and misinformation for their power and wealth - will NOT be distributing the vaccine. Lifton warns about the creep of “ malignant normality ,” when a “a norm of destructive or violent behavior, so that such behavior is expected or required of people” - for example, doctors sworn to do no harm were conditioned to help carry out the Holocaust. We will largely be left to ourselves to fend against this phenomenon, so it is important we know our values. Sarah Kendzior wrote the following in 2016, “I want you to write about who you are, what you have experienced, and what you have endured. Write down what you value; what standards you hold for yourself and for others. Write about your dreams for the future and your hopes for your children. Write about the struggle of your ancestors and how the hardship they overcame shaped the person you are today. Write your biography, write down your memories. Because if you do not do it now, you may forget. Write a list of things you would never do. Because it is possible that in the next year, you will do them. Write a list of things you would never believe. Because it is possible that in the next year, you will either believe them or be forced to say you believe them.” We can also look to what Lifton calls “witnessing professionals” for inspiration, people in civil society working to combat malignant normality and actively exposing it. These are folks like national security expert Alexander Vindman , Dr. Anthony Fauci , officer Michael Fanone , and here in Indiana, Dr. Caitlin Bernard . But, for the love of God, avoid cults of personality built around them. Grifters and hope-peddlers pop up on all sides, exploiting our innate desires for easy answers and hero stories. Neither the left nor the center, nor you or I, are immune. The need for belonging is universal. It is normal to seek a tribe. Psychological manipulators know this and cultivate relationships dependent on disorganized attachment, or trauma bonding. Secure attachment , based on trust and truth, healthy boundaries, and emotional availability is the solution. We will not get that from Trump/Vance and we won’t get it from Braun/Beckwith. So it’s on us to protect ourselves, hold firm in our values, and keep the light on for those who’ve been led astray. It is not a moral failing to have been conned, to have had your amygdala hijacked, or your mainframe hacked. Gird your mind, and the rest will follow. What do you think? Let me know in the comments. Or holler at me on social media - on Facebook, Bluesky, YouTube and TikTok at hoosleft and on most other social media sites at scottrog78. You can also email me at scott@hoosleft.us. Thanks again to my guest, Dustin Rozario Steinhagen - you can find him at dustinsteinhagen.wordpress.com - and thank you for listening. If you can, head over to HoosLeft.US and help support this project with a paid subscription. Again, hit me up on social media with your feedback, tips, ideas, and concerns. Please forward the show to a friend and have them to forward it to another friend. Let’s keep building this project - and truly democratic state - one conversation at a time. Until the next one, this has been the HoosLeft podcast. I’m Scott Aaron Rogers. Love each other, Indiana. Leftist voices are suppressed on oligarch-owned social media. Subscribe to make sure you don’t miss any of our updates. HoosLeft on Social Media: https://www.facebook.com/hoosleft https://hoosleft.bsky.social https://www.youtube.com/@hoosleft https://www.tiktok.com/@hoosleft https://www.instagram.com/scottrog78/ https://www.x.com/scottrog78/ https://www.threads.net/@scottrog78 https://hoosier.social/@scottrog78 And once again, subscribe at: https://hoosleft.us/subscribe To hear more, visit www.hoosleft.us",
      "release": "2025-02-11T13:58:15Z",
      "duration": "01:16:09.3020000",
      "explicit": false,
      "spotifyId": "1lfNCgprBPKi9ZlbWtJIlv",
      "appleId": 1000691113232,
      "youTubeId": "9by7-3Tfr5w",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1lfNCgprBPKi9ZlbWtJIlv",
        "apple": "https://podcasts.apple.com/podcast/episode-70-defending-our-minds-from-psychological-manipulation/id1670253397?i=1000691113232",
        "youtube": "https://www.youtube.com/watch?v=9by7-3Tfr5w"
      }
    }
  ]
}