{
  "id": "c2d5a19e-366f-49fe-a18e-3d063da6e1e8",
  "name": "Horror In The Heartland",
  "spotifyId": "2wBUJAuun0IN3MGsYMIxQe",
  "youTubeChannelId": "UCCjG8NtOig0USdrT5D1FpxQ",
  "youTubePlaylistId": "PL6PrA6lo8rJIVCCL1bJgDqiAOlzezkBXj",
  "episodes": [
    {
      "id": "9ac8476e-e8f4-4b07-b551-926f90dfaa71",
      "title": "Cults often rebrand: Amanda Montell on tactics of high-control groups | Horror in the Heartland",
      "description": "\u0022Horror in the Heartland\u0022 host Hena Doba sits down with Amanda Montell, a best-selling author and podcast host, for a compelling deep dive into the world of cults, the 2x2 Church and the psychological impact of being a part of high-controlled groups. Montell draws on her extensive knowledge to discuss the subtle but powerful use of community and language to manipulate everyday people to join these dangerous organizations, and the strength it takes to leave them.\n\nTo watch episode four: https://www.youtube.com/watch?v=-3QLZfjHMPQ\nTo watch episode five: https://www.youtube.com/watch?v=ZRDRItaR-0c\n\n#2x2sect #cult #truecrime\n\nCREDITS\nHost: Hena Doba\nExecutive Producer: Kayla Jardine\nSenior Producer: April Gambardella\nBooker: Alexis Howell\nEditor: Rita Cripe\n\n\u0022Horror in the Heartland\u0022 is NewsNation\u0060s chilling, new digital series hosted by anchor Hena Doba, where the quiet streets of Middle America become the backdrop for the nation\u0060s most shocking crimes. Each investigative episode unravels a gripping true story: mysteries, betrayals, and unthinkable acts that shattered small towns. \n\nNewsNation is your source for fact-based, unbiased news for all Americans. \n\nMore from NewsNation: https://www.newsnationnow.com/ \nGet our app: https://trib.al/TBXgYpp \nFind us on your screen: https://www.joinnn.com/",
      "release": "2025-12-03T00:29:35Z",
      "duration": "00:21:36",
      "explicit": false,
      "spotifyId": "4G5StgaPcW6TsJR6Gw9qyJ",
      "youTubeId": "fdOfReIVHIA",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4G5StgaPcW6TsJR6Gw9qyJ",
        "youtube": "https://www.youtube.com/watch?v=fdOfReIVHIA"
      }
    },
    {
      "id": "0a967c5b-7bf8-48ea-8259-25a8340db22a",
      "title": "Historian reveals when secret religion \u0027Two by Twos\u0027 was actually founded | Horror in the Heartland",
      "description": "Historian Cherie Kropp has spent her entire life observing and eventually documenting everything she could about the 2x2 sect, a religion found in the heart of America that has managed to stay under the radar. Cherie reveals when and how the religious group was founded, a truth that followers were not told. As a former member herself, she tells host Hena Doba her unique insight into what it was like to be brought up on convention grounds, a place where followers from all over would join together to practice their religion. Episode one: https://www.youtube.com/watch?v=B6Dg54Haw9g\u0026list=PL6PrA6lo8rJIVCCL1bJgDqiAOlzezkBXj Episode two: https://youtu.be/8j7Ry5aKaqQ?si=MP6uzIKJW5xhgcc2 Episode three: https://www.youtube.com/watch?v=ZlP2-d9jljQ\u0026list=PL6PrA6lo8rJIVCCL1bJgDqiAOlzezkBXj\u0026index=3 Episode four: https://www.youtube.com/watch?v=-3QLZfjHMPQ\u0026list=PL6PrA6lo8rJIVCCL1bJgDqiAOlzezkBXj #truecrime #2x2sect #cult CREDITS Host: Hena Doba Executive Producer: Kayla Jardine Senior Producer: April Gambardella Booker: Alexis Howell Editor: Rita Cripe \u0022Horror in the Heartland\u0022 is NewsNation\u0026#96;s chilling, new digital series hosted by anchor Hena Doba, where the quiet streets of Middle America become the backdrop for the nation\u0026#96;s most shocking crimes. Each investigative episode unravels a gripping true story: mysteries, betrayals, and unthinkable acts that shattered small towns. NewsNation is your source for fact-based, unbiased news for all Americans. More from NewsNation: https://www.newsnationnow.com/ Get our app: https://trib.al/TBXgYpp Find us on your screen: https://www.joinnn.com/",
      "release": "2025-11-26T21:00:06Z",
      "duration": "00:32:10.9010000",
      "explicit": false,
      "spotifyId": "7GifH70cExehrqmNgP1foU",
      "youTubeId": "ZRDRItaR-0c",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7GifH70cExehrqmNgP1foU",
        "youtube": "https://www.youtube.com/watch?v=ZRDRItaR-0c"
      }
    },
    {
      "id": "5da2a953-a3ad-4dea-9303-d073d90bd1a1",
      "title": "\u0027I\u0027m so angry\u0027: Private investigator looking into 2x2 abuse claims | Horror in the Heartland",
      "description": "Private investigator Cynthia Liles has been looking into the religious organization known as the \u0022Two by Twos\u0022 for years. She speaks with \u0022Horror in the Heartland\u0022 host Hena Doba about the widespread abuse she says she\u0027s uncovered after spending years investigating the church and shares what she knows about the ongoing FBI investigation. To watch episode one: https://www.youtube.com/watch?v=B6Dg54Haw9g\u0026list=PL6PrA6lo8rJIVCCL1bJgDqiAOlzezkBXj To watch episode two: https://youtu.be/8j7Ry5aKaqQ?si=MP6uzIKJW5xhgcc2 #truecrime #2x2sect #cult Credits: Host: Hena Doba Executive Producer: Kayla Jardine Senior Producer: April Gambardella Booker: Alexis Howell Editor: Rita Cripe \u0022Horror in the Heartland\u0022 is NewsNation\u0026#96;s chilling, new digital series hosted by anchor Hena Doba, where the quiet streets of Middle America become the backdrop for the nation\u0026#96;s most shocking crimes. Each investigative episode unravels a gripping true story: mysteries, betrayals, and unthinkable acts that shattered small towns. NewsNation is your source for fact-based, unbiased news for all Americans. More from NewsNation: https://www.newsnationnow.com/ Get our app: https://trib.al/TBXgYpp Find us on your screen: https://www.joinnn.com/",
      "release": "2025-11-19T00:00:00",
      "duration": "00:29:17.0340000",
      "explicit": false,
      "spotifyId": "65eUQFTxY2iuo9YzUC8ymj",
      "youTubeId": "-3QLZfjHMPQ",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65eUQFTxY2iuo9YzUC8ymj",
        "youtube": "https://www.youtube.com/watch?v=-3QLZfjHMPQ"
      }
    },
    {
      "id": "f7f89150-c13d-4bc9-8bc7-a64c31d05875",
      "title": "Former \u0027Two by Twos\u0027 members speak out on widespread abuse | Horror in the Heartland",
      "description": "Hena Doba speaks with Abbi and Mike Prussack, a married couple who met in the \u0022Two by Twos\u0022 sect before deciding to leave together. Once out of the religious group, they decided to create resources for former members to transition back into society and for abuse victims to share their stories.\n\n#Truecrime #2x2sect #cult\n\n\u0022Horror in the Heartland\u0022 is NewsNation’s chilling, new digital series hosted by anchor Hena Doba, where the quiet streets of Middle America become the backdrop for the nation’s most shocking crimes. \n\nEach investigative episode unravels a gripping true story: mysteries, betrayals, and unthinkable acts that shattered small towns. \n\nHost: Hena Doba\nExecutive Producer: Kayla Jardine\nSenior Producer: April Gambardella\nBooker: Alexis Howell\nEditor: Rita Cripe\n\nNewsNation is your source for fact-based, unbiased news for all Americans. \n\nMore from NewsNation: https://www.newsnationnow.com/ \nGet our app: https://trib.al/TBXgYpp \nFind us on your screen: https://www.joinnn.com/",
      "release": "2025-11-12T21:00:06Z",
      "duration": "00:39:10",
      "explicit": false,
      "youTubeId": "ZlP2-d9jljQ",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZlP2-d9jljQ"
      }
    },
    {
      "id": "d11ad484-f356-43c4-aeaf-3ae040e05910",
      "title": "Former 2x2 worker says he warned church about child abuse and was ignored | Horror in the Heartland",
      "description": "Former \u0022Two by Twos\u0022 worker Andy Scholl didn\u0027t leave the religion until he was in his 50s, but he says he wishes he spoke up against his former church sooner. In an interview with Hena Doba, Scholl details the abuses he saw firsthand and how he says leadership refused to take action after allegations of child abuse surfaced.To read the letter from church leaders following Dean Bruer\u0027s death, you can view it here: https://www.tellingthetruth.info/phot... To watch episode one, you can go here: • ‘I Was His Target’: Former 2x2 member\u0027s sh... For more of Andy Scholl\u0027s story, you can visit here: • Let Love Lead. My journey Part 4: My Journ... \u0022Horror in the Heartland\u0022 is NewsNation’s chilling, new digital series hosted by anchor Hena Doba, where the quiet streets of Middle America become the backdrop for the nation’s most shocking crimes. Each investigative episode unravels a gripping true story: mysteries, betrayals, and unthinkable acts that shattered small towns. NewsNation is your source for fact-based, unbiased news for all Americans. More from NewsNation: https://www.newsnationnow.com/ Get our app: https://trib.al/TBXgYpp Find us on your screen: https://www.joinnn.com/ #truecrime #2x2sect #cult Credits:Host: Hena DobaExecutive Producer: Kayla JardineSenior Producer: April GambardellaBooker: Alexis HowellEditor: Rita Cripe",
      "release": "2025-11-05T00:00:00",
      "duration": "00:35:29.6420000",
      "explicit": false,
      "spotifyId": "0h13av2jLbLEH8sRWQs3dP",
      "youTubeId": "8j7Ry5aKaqQ",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0h13av2jLbLEH8sRWQs3dP",
        "youtube": "https://www.youtube.com/watch?v=8j7Ry5aKaqQ"
      }
    },
    {
      "id": "3a41fef4-6722-4c34-9224-27b85b1cca7b",
      "title": "‘I Was His Target’: Former 2x2 member\u0027s shocking abuse claims | Horror in the Heartland",
      "description": "Former 2x2 church member Sheri Autrey says she was just 14 when a 28-year-old church worker moved into her family’s home and began abusing her. In this exclusive interview with Hena Doba, Autrey shares never-before-released audio recordings she says prove what happened. NewsNation reached out to the accused, but has not heard back at the time of publication.\u0022Horror in the Heartland\u0022 is NewsNation’s chilling, new digital series hosted by anchor Hena Doba, where the quiet streets of Middle America become the backdrop for the nation’s most shocking crimes. Each investigative episode unravels a gripping true story: mysteries, betrayals, and unthinkable acts that shattered small towns. Host: Hena DobaExecutive Producer: Kayla JardineSenior Producer: April GambardellaBooker: Alexis HowellEditor: Rita CripeNewsNation is your source for fact-based, unbiased news for all Americans. More from NewsNation: https://www.newsnationnow.com/ Get our app: https://trib.al/TBXgYpp Find us on your screen: https://www.joinnn.com/",
      "release": "2025-10-29T00:00:00",
      "duration": "00:39:34.5490000",
      "explicit": false,
      "spotifyId": "12pvyobGkuwNDP0wUncvL4",
      "youTubeId": "B6Dg54Haw9g",
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/12pvyobGkuwNDP0wUncvL4",
        "youtube": "https://www.youtube.com/watch?v=B6Dg54Haw9g"
      }
    }
  ]
}