{
  "id": "cb665fcc-ce25-4fba-9432-56d47fb57079",
  "name": "Horrifying History",
  "spotifyId": "21Lq5LZc4b9eBbTxc3gRtJ",
  "appleId": 1484707139,
  "episodes": [
    {
      "id": "799cbf24-4d68-464d-b1f1-e18f5bcae46b",
      "title": "Jamie Gomez: From Porn to Cult Leader",
      "description": "There are a lot of different cult leaders out there, but many of them have a lot of the same characteristics. They are able to bind their followers to them by shared belief and practices. They boost their societal status by projecting dominance over others, either physically or mentally. They often display arrogance, and share their controversial views to gain followers. Now a great example of this is a man who the press has called the “chiseled charlatan”.So get comfortable my spooky friends…you are about to hear the tale of Jamie Gomez: From Porn to Cult Leader. But a word of caution before we get started: today we are going to be talking about the inner workings of a cult. As part of this, we will be talking about different forms of violence and abuse - including sexual abuse. Listener discretion is advised. We got merch! Shop now: HorrifyingHist1.redbubble.com Join our fan club at: https://www.patreon.com/horrifyinghistory Facebook: https://www.facebook.com/horrifyinghistoryInstagram \u0026 Threads: https://instagram.com/horrifying_historyTwitter: https://twitter.com/horrifyinghist1 Horrifying History is part of the Darkcast Network. Check out their other amazing podcasts at https://www.darkcastnetwork.comHorrifying History would like to thank Factor for sponsoring this episode. Get Factor to enjoy eating well without any hassle. Simply choose your meals, and enjoy fresh flavour packed meals delivered to your door that are ready to eat in 2 minutes. Go to www.factormeals.com/horrorstory50 to get 50% off on your first order.This show is part of the Spreaker Prime Network, if you are interested in advertising on this podcast, contact us at https://www.spreaker.com/show/4180070/advertisement",
      "release": "2023-11-08T00:00:00",
      "duration": "00:29:32.8780000",
      "explicit": false,
      "spotifyId": "1T0p0Erbsw5ERfdhBTIfOm",
      "appleId": 1000634093689,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1T0p0Erbsw5ERfdhBTIfOm",
        "apple": "https://podcasts.apple.com/podcast/jamie-gomez-from-porn-to-cult-leader/id1484707139?i=1000634093689"
      }
    }
  ]
}