{
  "id": "96956d41-158e-4878-a52b-7ee4d55c3d58",
  "name": "Hostage",
  "spotifyId": "07Do1GFU3Y4htyVQbp0uuC",
  "appleId": 1437958287,
  "episodes": [
    {
      "id": "93b64f42-6427-41be-92d3-10164b082e91",
      "title": "John Cantlie \u0026 ISIS Pt. 2",
      "description": "Journalists John Cantlie and James Foley were kidnapped by ISIS in 2012. They were imprisoned all over the ISIS prison network, until Foley met a grim end and Cantlie was summoned to become the face of the terrorist group. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2020-09-10T00:00:00",
      "duration": "00:37:43.6140000",
      "explicit": false,
      "spotifyId": "7sRlRfdFyfsdP9uDauzkCy",
      "subjects": [
        "Fundamentalist Islam"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sRlRfdFyfsdP9uDauzkCy"
      }
    },
    {
      "id": "b96ab93d-cc46-46d9-8717-82367ed25037",
      "title": "John Cantlie \u0026 ISIS Pt. 1",
      "description": "In 2012, British photojournalist John Cantlie was kidnapped by ISIS—twice. But as the conflict in Syria grew, the safety of journalists in the area was seriously threatened. Cantlie was held hostage with American journalist James Foley and at least 21 other international journalists and aid workers. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2020-09-03T00:00:00",
      "duration": "00:32:56.0320000",
      "explicit": false,
      "spotifyId": "0wivpZZ6oo0tcz1ixGwP7f",
      "subjects": [
        "Fundamentalist Islam"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0wivpZZ6oo0tcz1ixGwP7f"
      }
    },
    {
      "id": "49866eb7-48c9-449d-be28-8e8f3082be9f",
      "title": "Siege at Waco Pt. 2: Babylon at the Gates",
      "description": "In late February, 1992, the ATF laid siege to Mount Carmel, just outside Waco, Texas. Inside, David Koresh and his followers barricaded themselves, until Koresh finally found a bargaining chip that gave him carte blanche: his own children. Parcasters - On Unexplained Mysteries we jump into the second half of our exploration of the Shroud of Turin. Leave no stone unturned and tune in to Unexplained Mysteries, available on Spotify or wherever you get your Parcast Originals! Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2019-07-04T00:00:00",
      "duration": "01:01:40.6360000",
      "explicit": false,
      "spotifyId": "4mKev2exmr5kAfxWpEuEBx",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mKev2exmr5kAfxWpEuEBx"
      }
    },
    {
      "id": "37dd41b0-c53f-48d9-bd75-b43aa72681eb",
      "title": "Siege at Waco Pt. 1: The Prophecy ",
      "description": "For years, cult leader David Koresh was abusing the young girls in his cult and stockpiling weapons for the apocalyptic war he believed was coming. But in early 1992, just outside Waco, Texas, two events sparked a chain reaction that would result in numerous casualties. Parcasters - This week on Unexplained Mysteries we explore the Shroud of Turin, and the faint image of a man that appears on it’s fibers. Is it Jesus Christ? Let’s find out! Available now on Unexplained Mysteries, listen on Spotify or wherever you listen to podcasts. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2019-06-27T00:00:00",
      "duration": "01:00:27.5460000",
      "explicit": false,
      "spotifyId": "5PfIyudznY9fGf4mgyWSom",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5PfIyudznY9fGf4mgyWSom"
      }
    },
    {
      "id": "bfd5a4ef-0094-4063-b966-a4ac5ac9630d",
      "title": "Patty Hearst Pt. 3: Captive of the SLA",
      "description": "After two months of fruitless negotiations, the FBI stopped trying to rescue a hostage, and started trying to catch a criminal. This week, we’ll look at the crimes Patricia committed under coercion, and her life on the run. How do you rescue a hostage who doesn’t want to be found? Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2018-10-18T00:00:00",
      "duration": "00:59:05.2080000",
      "explicit": false,
      "spotifyId": "6S1zA7t4eEikMGwjDfymUx",
      "subjects": [
        "Symbionese Liberation Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6S1zA7t4eEikMGwjDfymUx"
      }
    },
    {
      "id": "a3f61d89-81e7-4e53-bb69-47882595f553",
      "title": "Patty Hearst Pt. 2: Girl on the Run",
      "description": "Blindfolded and locked in a closet for 57 days, Patricia Hearst was subjected to torture, abuse, and brainwashing. How did she survive? We examine her psyche, how she handled a death threat, and clips from the audio messages she was forced to record. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2018-10-18T00:00:00",
      "duration": "00:50:15.5490000",
      "explicit": false,
      "spotifyId": "0pTB7DrRQCuEbkktIljMwe",
      "subjects": [
        "Symbionese Liberation Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pTB7DrRQCuEbkktIljMwe"
      }
    },
    {
      "id": "8e363fa0-e49a-41bc-86d9-8b8752caae8a",
      "title": "Patty Hearst Pt. 1: The Kidnapping",
      "description": "Patricia Hearst lived every woman’s nightmare. She was violently taken from her own apartment, tied up, and thrown in the back of a stolen car. For the next two years, Patricia was held hostage. In our first episode, we explore the dramatic lead-up to Patricia’s kidnapping, and why her kidnappers were able to snatch the heiress from her apartment in under four minutes. To listen Part 2 along with more episodes, head over to Spotify and follow HOSTAGE for more.\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2018-10-17T23:00:00Z",
      "duration": "00:45:28",
      "explicit": false,
      "spotifyId": "5DSBK3GiAPK6pxUrya7Jyu",
      "appleId": 1000422059253,
      "subjects": [
        "Symbionese Liberation Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5DSBK3GiAPK6pxUrya7Jyu",
        "apple": "https://podcasts.apple.com/podcast/patty-hearst-pt-1-the-kidnapping/id1437958287?i=1000422059253"
      }
    }
  ]
}