{
  "id": "fdaf5e8d-3c2c-4a2b-8675-049fccbead35",
  "name": "House of Mystery Radio on NBC",
  "spotifyId": "2ScQTpX9kJDC974JUIHlM7",
  "appleId": 1114414039,
  "youTubeChannelId": "UCeXBku5SWnkGDOXhHYWolqA",
  "episodes": [
    {
      "id": "4d002306-cb3e-47f2-b0e6-6b4a96bc0b2f",
      "title": "Mark Hewitt - Charles Manson Behind Bars",
      "description": "For more than 40 years, Charles Manson languished in prison for his participation in the Manson family murders of 1969. He was America\u0027s icon of evil, the one who brought down the curtain on the 1960s. He was never a quiet inmate, either. From his unbridled outbursts of rage to his tender acts of generosity, he made his presence felt to everyone around him. Over time, he parlayed his notoriety, through clever manipulation and shrewd alliances, to great power behind bars. He inspired awe in other inmates, he cozied up to prison guards who were more than eager to do him favors, and he was responsible for countless staff transfers within and outside of the institution. This book details the dramatic journey of Willie Mendez, a troubled inmate, housed next to the serial killer for more than a year. Willie became institutionalized after repeated violations of the law, including attempted murder and armed robbery. He is serving a 68-year prison sentence. Author Mark Hewitt was introduced to Mendez by Charles Manson, who thought the two had similar ideas and a shared optimism about life. From his initial feelings of contempt toward the aging killer, Willie, nicknamed, \u0022Boxcar,\u0022 by Manson, traveled to a place of openness and acceptance of the old man\u0027s ideas. Over time, he began to defer more and more to Manson without reservation. The relationship eventually soured when some of Manson\u0027s claims were proven false. Through great internal strength, and the support of others, Willie distanced himself from the cult leader. Finally, he was able to extricate himself completely from Manson\u0027s manipulations. This is a tale of growth and maturity that contains intimate details and shocking jailhouse secrets. Willie shares an insider\u0027s view of Charles Manson, his crazy behavior, his whispered confessions, and his sometimes profound wisdom. \u0022Charlie\u0022 speaks openly about his sexuality, shares some vivid details of the Tate and LaBianca murders, and relates his childhood experience of being forced to wear a dress to school. The iconic killer described for him the many people who influenced him, some when he was a child, others, during his adulthood. Willie describes the episode in which Charlie made and wore a Ku Klux Klan outfit to stir up trouble on the tier. He shares his discovery of Manson\u0027s intricate artwork, including the creative techniques used to produce masterpieces behind bars. He details Manson\u0027s trip to the shower where the aging killer walked into the water fully clothed. Willie gives us profound insight into Manson\u0027s personality and character through stories that illustrate the killer\u0027s false bravado, his feigned insane behavior, and a few deep-seated insecurities. Support this show http://supporter.acast.com/houseofmysteryradio. Become a member at https://plus.acast.com/s/houseofmysteryradio . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-05-02T16:58:54Z",
      "duration": "00:44:27.9110000",
      "explicit": false,
      "spotifyId": "5vkoR0AgwlcW4NO7ZpaGos",
      "appleId": 1000705867864,
      "youTubeId": "mGxjz_ER4dA",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5vkoR0AgwlcW4NO7ZpaGos",
        "apple": "https://podcasts.apple.com/podcast/mark-hewitt-charles-manson-behind-bars/id1114414039?i=1000705867864",
        "youtube": "https://www.youtube.com/watch?v=mGxjz_ER4dA"
      }
    }
  ]
}