{
  "id": "8477d51a-28dc-4de7-9d0d-edd80e3b6937",
  "name": "How2Exit",
  "youTubeChannelId": "UC_ONnhwaKSTPFt2nOxKoXXQ",
  "episodes": [
    {
      "id": "135e712d-a3ed-49d6-9621-1618e7b73ebf",
      "title": "Peter Graves Interview Highlights - E281: Escaped a Cult, Built Digital Empires, and Acquired....",
      "description": "About the Guest:\nPeter Graves is the embodiment of reinvention. From cult survivor to international motorcycle racer, tech entrepreneur, sailor, corporate VP, and now acquisition entrepreneur—his story reads like a movie script. He brings credibility and capability to the table, blending real-world riding experience with a deep command of e-commerce and systems. As interim CEO of his recently acquired dealership, Peter is using his diverse skill set to lead a digital transformation while laying the groundwork for a broader roll-up strategy in the powersports and e-commerce industries.\n\nSummary:\nPeter Graves\u0027 journey is anything but typical. From a cult-controlled childhood in London to becoming a successful motorcycle racer, digital entrepreneur, global sailor, and now acquisition entrepreneur, Peter’s path is a story of bold pivots and purposeful reinvention. In this episode of How to Exit, Peter shares how his passion for motorcycles and deep digital experience helped him acquire and now turn around a struggling motorcycle dealership with a thriving but under-leveraged e-commerce arm.\n\nThis episode is a masterclass in resilience, digital transformation, and how to build rapport with sellers by being the most credible and trustworthy buyer in the room. Peter offers insight not only into his dealmaking process but also into his vision for a synergistic group of businesses tied together by common values, systems, and operational excellence.\n--------------------------------------------------\nContact on\nLinkedin: https://www.linkedin.com/in/petergraves/\nWebsite: https://morewaysgroup.com/\n--------------------------------------------------\n💰If you’d like additional ways to support this podcast, you can become a paid subscriber here:\nhttps://how2exit.substack.com/\n\n►Visit Our Website: https://www.how2exit.com/\n\n📧For Business Inquiries: Me@4sale2sold.com\n\nDon\u0027t Forget to SUBSCRIBE to the How2Exit channel and press (🔔) to join the Notification Squad and stay updated with new uploads.✨\n\n👇🏻SUBSCRIBE HERE\nhttps://www.youtube.com/channel/UC_ONnhwaKSTPFt2nOxKoXXQ?sub_confirmation=1\n\n🎧  Stream Purpose:\n»Spreaker - \n»Apple Podcast - \n»Spotify - \n\n𝐖𝐚𝐧𝐭 𝐭𝐨 𝐬𝐞𝐞 𝐦𝐨𝐫𝐞 𝐜𝐨𝐧𝐭𝐞𝐧𝐭 𝐥𝐢𝐤𝐞 𝐭𝐡𝐢𝐬...? \n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬\n👍 Like the video (it helps a ton!)\n💬 Comment below to share your opinion!\n🔗 Share the video with anyone you think might help :)\n▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬\n📱Stay Tuned On Our Social Media :\n» Linkedin - https://www.linkedin.com/in/ronskelton/\n» Twitter -  https://twitter.com/ronaldskelton\n» Facebook - https://www.facebook.com/How2Exit\n» Newsletter - http://deeper.how2exit.com/\n\n#How2Exit # #\n💖Thanks for watching! 💖",
      "release": "2025-07-18T14:09:25Z",
      "duration": "00:12:16",
      "explicit": false,
      "youTubeId": "8Q2WHNRx7QI",
      "subjects": [
        "_London",
        "School of Philosophy and Economic Science"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8Q2WHNRx7QI"
      }
    },
    {
      "id": "fb254075-3e8e-4a40-8780-96213be71518",
      "title": "E281: Escaped a Cult, Built Digital Empires, and Acquired a Motorcycle Business Turnaround",
      "release": "2025-05-23T18:10:05Z",
      "duration": "00:52:45",
      "explicit": false,
      "youTubeId": "kdA7A3y5XA0",
      "subjects": [
        "School of Philosophy and Economic Science"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kdA7A3y5XA0"
      }
    }
  ]
}