{
  "_ts": 0,
  "id": "0abfb80e-f74f-425f-b611-5ba51aebd461",
  "name": "How My Parents Raised Me",
  "spotifyId": "1DIDX6l9HiNc9YMXmM9bY4",
  "appleId": 1533741808,
  "episodes": [
    {
      "id": "0a0437fd-03b0-4527-9496-75fe01fb3193",
      "title": "I Can\u0027t Believe I\u0027m Not Dead: How Your Tolerance to Abuse Leads to Chaos",
      "description": "This week my guest is Kendra Petty, the author of I Can\u0027t Believe I\u0027m Not Dead: Escaping Abuse, a Cult, Attempted Murder and Other Insanities. Kendra’s story involves terrible abuse at the hands of her mother in a very toxic childhood home. Kendra’s mother was deeply religious and eventually started a cult, preaching the word of god, whilst continuing to physically abuse Kendra until she was 18 years old. When Kendra was finally able to move away, the deep programming from an abusive parent continued to send Kendra into more and more situations of abuse throughout her life. An abusive marriage and an attempted poisoning by an employer leading to Graves Disease and a cancer diagnosis are just a part of this story. Kendra is an absolute THRIVER and you will hear about Kendra\u0027s decision that it was time to stop living in fear and create a life she desired for herself. You must get Kendra’s book to hear the full story. You can purchase Kendra’s book here https://www.amazon.com.au/Cant-Believe-Not-Dead-Insanities/dp/1952491509 You can find Kendra via her Instagram https://www.instagram.com/kendrapettyofficial/ If you have a story to share for this podcast please connect with me at www.instagram.com/mybigloveproject or send an email to bigloveproject@iinet.net.au . I would LOVE! to connect with you. Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-26T15:00:57Z",
      "duration": "00:56:30.8760000",
      "explicit": false,
      "spotifyId": "3JOXrcNAiChsKSirgvGca4",
      "appleId": 1000646894564,
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JOXrcNAiChsKSirgvGca4",
        "apple": "https://podcasts.apple.com/podcast/216-i-cant-believe-im-not-dead-how-your-tolerance-to/id1533741808?i=1000646894564"
      }
    }
  ]
}