{
  "_ts": 0,
  "id": "f03c0408-77b1-4677-a3c2-a305047b38a8",
  "name": "How Did We Get Here?",
  "spotifyId": "6A7eHnljo9H9RnU21nA4np",
  "appleId": 1744718182,
  "youTubeChannelId": "UC47xQgGHeA5PtdKoE_QL-Mw",
  "episodes": [
    {
      "id": "a987ffd7-3c75-40df-bd5e-e921b5dc98fa",
      "title": "Heaven\u0027s Gate Part 1",
      "description": "Summary This episode explores the beliefs and actions of the Heaven\u0027s Gate cult, led by Marshall Applewhite and Bonnie Lou Nettles. The cult believed that planet Earth was about to be recycled and that their only chance for survival was to evacuate with the cult. The conversation delves into the background of the leaders. The podcast host also discusses the allure of cults and explores other infamous cults throughout history. Keywords: Heaven\u0027s Gate, cult, Marshall Applewhite, Bonnie Lou Nettles, beliefs, evacuation, survival, allure, infamous cults, true crime, cults, UFO, aliens",
      "release": "2024-07-26T10:42:26Z",
      "duration": "00:10:44.8410000",
      "explicit": false,
      "spotifyId": "4aKGGT6R4wRKmNEjqpVMGW",
      "appleId": 1000663422819,
      "youTubeId": "onWHaTkz_1Y",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4aKGGT6R4wRKmNEjqpVMGW",
        "apple": "https://podcasts.apple.com/podcast/heavens-gate-part-1/id1744718182?i=1000663422819",
        "youtube": "https://www.youtube.com/watch?v=onWHaTkz_1Y"
      }
    },
    {
      "id": "cb89e501-90fd-4f32-8376-cdef0aaa38eb",
      "title": "Cult Leader Psyche - Personality Disorders",
      "description": "SummaryIn this episode, Emily O\u0027Brien explores personality disorders and how they pertain to cult leaders. She discusses the three clusters of personality disorders: odd and eccentric, dramatic and erratic, and anxious and inhibitive. Emily provides an overview of each disorder within these clusters and highlights examples of cult leaders who may exhibit these traits. Understanding the psychology of cult leaders can help identify red flags and prevent individuals from getting involved in harmful groups.\n\n\n\nKeywords: personality disorders, clusters, cult leaders, red flags, psychology, borderline, paranoid, narcissistic, narcissist, true crime, cults, depression, psychotic, schizoid, jim jones",
      "release": "2024-07-20T17:34:23Z",
      "duration": "00:13:20",
      "explicit": false,
      "spotifyId": "4Xw4REUfqBbX7Wg1hjsEEd",
      "appleId": 1000662832466,
      "youTubeId": "Y3YbtCFp1j4",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Xw4REUfqBbX7Wg1hjsEEd",
        "apple": "https://podcasts.apple.com/podcast/cult-leader-psyche-personality-disorders/id1744718182?i=1000662832466",
        "youtube": "https://www.youtube.com/watch?v=Y3YbtCFp1j4"
      }
    },
    {
      "id": "acab6537-a54b-4713-92ed-93e966e003e9",
      "title": "The Children of Thunder",
      "description": "SummaryThe podcast explores the chilling and tragic tale of the Children of Thunder, a cult that terrorized California in the late 1990s. The story begins with Glenn Heltzer, the cult\u0027s charismatic yet troubled leader, and his descent into extreme religious delusions. The cult\u0027s beliefs and principles are outlined, including the concept of blood atonement. The cult\u0027s activities took a deadly turn when they murdered several individuals, including Selena Bishop and her mother. The cult members were eventually arrested and received harsh sentences. The story serves as a reminder of the dangers of unchecked mental illness and charismatic leaders.\n\nKeywords: Children of Thunder, cult, California, Glenn Heltzer, religious delusions, murder, blood atonement, mental illness, charismatic leaders, cults, true crime",
      "release": "2024-07-14T23:41:40Z",
      "duration": "00:09:35",
      "explicit": false,
      "spotifyId": "1dG53hgSMPrRpMVDj3Qt0b",
      "appleId": 1000662233309,
      "youTubeId": "1gXMxZgaMns",
      "subjects": [
        "Glenn Helzer"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dG53hgSMPrRpMVDj3Qt0b",
        "apple": "https://podcasts.apple.com/podcast/the-children-of-thunder/id1744718182?i=1000662233309",
        "youtube": "https://www.youtube.com/watch?v=1gXMxZgaMns"
      }
    },
    {
      "id": "018ce9d6-a1ff-400a-a248-573038b8dfed",
      "title": "FLDS",
      "description": "Summary\n\n\n\nThis episode explores the Fundamentalist Church of Jesus Christ of Latter-day Saints (FLDS) and the challenges faced by its members in leaving the cult. It discusses the history of the FLDS, the control exerted by its leaders, and the beliefs and practices that made it difficult for members to leave. The episode also highlights the stories of women who escaped the cult and the psychological tactics used by cult leaders to maintain control. The host provides tips on how to support someone who may be in a cult and emphasizes the importance of empathy and building trust.\n\n\n\nKeywords\n\n\n\nFLDS, cults, leaving a cult, Warren Jeffs, control, beliefs, practices, psychological tactics, support, empathy",
      "release": "2024-07-05T13:00:00Z",
      "duration": "00:15:17",
      "explicit": false,
      "spotifyId": "2QTUCpen60S4bsZvHH64Rx",
      "appleId": 1000661243305,
      "youTubeId": "sT4Uj9WdfSo",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QTUCpen60S4bsZvHH64Rx",
        "apple": "https://podcasts.apple.com/podcast/flds/id1744718182?i=1000661243305",
        "youtube": "https://www.youtube.com/watch?v=sT4Uj9WdfSo"
      }
    }
  ]
}