{
  "_ts": 0,
  "id": "9be820e2-fac4-4366-a36c-216caba2bbad",
  "name": "How To Leave A Cult",
  "spotifyId": "1wFepHSUrPZfnfRFalNd6j",
  "appleId": 1723601274,
  "youTubeChannelId": "UCHDfEL6hgO1rS4X3W_My76w",
  "youTubePlaylistId": "PLPk9OlDPA-Z5JeRgII5OClicyCVAcbXvy",
  "episodes": [
    {
      "id": "43c192ed-b7b7-4703-ad1a-e9267d4470e5",
      "title": "When a Minister Crosses the Line: Guilt, Shame, and the Fear of Not Being Believed",
      "description": "I share a harrowing experience where my minister crossed the line, touching me inappropriately and making suggestive advances. I talk about the overwhelming guilt and shame I felt, believing it was my fault, and how this abuse affected my emotional well-being for years. What made it even harder was the fear that no one would believe me—after all, he was a trusted figure. The trauma of this experience is just one piece of the bigger picture. Growing up in a cult, I was constantly navigating an environment of control, manipulation, and confusion. The shame and guilt I carried, both from this abuse and my upbringing, shaped how I viewed myself and the world for years. This episode reflects on how deep-rooted trauma can affect every aspect of life, making it incredibly difficult to shift from merely surviving to thriving. Healing from this kind of trauma isn’t linear, and the emotional weight of it can feel suffocating, especially when you’re left questioning your worth and struggling to break free from the lasting effects of a lifetime of control. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2025-05-16T21:00:00Z",
      "duration": "00:36:33.1100000",
      "explicit": true,
      "spotifyId": "242PllVUK2Yqv3Z7PwZb0V",
      "appleId": 1000708778917,
      "youTubeId": "9IagpNRZV4g",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/242PllVUK2Yqv3Z7PwZb0V",
        "apple": "https://podcasts.apple.com/podcast/when-a-minister-crosses-the-line-guilt-shame-and/id1723601274?i=1000708778917",
        "youtube": "https://www.youtube.com/watch?v=9IagpNRZV4g"
      }
    },
    {
      "id": "23fea05f-a58b-4ca7-b72a-7135ce42f91e",
      "title": "Building Stability After Divorce: Overcoming Shame and Strengthening Resilience",
      "description": "In this deeply personal episode, I open up about the emotional journey I navigated after my divorce and the search for stability in the aftermath. I discuss how going back to school played a crucial role in creating a future for myself and my children, giving me the confidence and direction to move forward. Along the way, I explore the powerful emotion of shame, how it can hold us back, and how understanding and processing it is essential for healing. I also touch on the core values that have helped me build resilience, empowering me to avoid falling prey to cults and toxic environments. This episode offers valuable insights on how to reclaim your life, develop a strong sense of self, and protect your future by nurturing personal growth and self-awareness.",
      "release": "2025-04-28T21:00:00Z",
      "duration": "00:30:33.2730000",
      "explicit": true,
      "spotifyId": "0qQwUwgDluswg5eJMYUDQD",
      "appleId": 1000705320651,
      "youTubeId": "WGywZMrVsO8",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qQwUwgDluswg5eJMYUDQD",
        "apple": "https://podcasts.apple.com/podcast/building-stability-after-divorce-overcoming-shame-and/id1723601274?i=1000705320651",
        "youtube": "https://www.youtube.com/watch?v=WGywZMrVsO8"
      }
    },
    {
      "id": "5f7c076c-7e6f-4ba8-99cf-47b7b5d8c4f1",
      "title": "Breaking Free from Cult Legacies: Divorce, Systemic Blame, and Emotional Landmines",
      "description": "Kicking off Season 2 of How to Leave a Cult, I open up about the emotional aftermath of my divorce and the deep sense of failure I felt. I share insights into the cult\u0027s prestigious school, which boasted renowned teachers in basketball, chess with Igor Ivanov, and ballet with Yen Li Chen, gaining recognition statewide and nationally. We delve into the evolving expectations placed on cult children across generations and the pervasive issue in religion of blaming individuals rather than flawed systems.\n\nThis episode also guides you through identifying and diffusing triggers—those emotional landmines that can impact not only you but also those around you. Join me as we explore these challenges and learn how to reclaim personal power in the face of systemic control and emotional turmoil.",
      "release": "2025-01-22T16:00:00Z",
      "duration": "00:34:25.7370000",
      "explicit": true,
      "spotifyId": "5tqq9sNjoYQDHEovqFSSxv",
      "appleId": 1000685036345,
      "youTubeId": "nscox_2yW5s",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tqq9sNjoYQDHEovqFSSxv",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-from-cult-legacies-divorce-systemic-blame/id1723601274?i=1000685036345",
        "youtube": "https://www.youtube.com/watch?v=nscox_2yW5s"
      }
    },
    {
      "id": "7f6b8990-d6f5-4e79-8b4f-46f046cf8c22",
      "title": "When the Lies Become Too Much: Losing a Marriage to Cult Control",
      "description": "Send us a text In this heart-wrenching episode of How to Leave a Cult, I share the unraveling of my marriage amidst the powerful grip of cult influence. After the birth of our second child, my husband told me he couldn’t bear the people in the group anymore and decided to leave. I reflect on the pain of this loss, amplified by cult members’ gaslighting—insisting that he was a liar and had never truly loved me. Together, we’ll examine how cults use manipulation to isolate us from genuine love and support, and how I began to piece my life back together while facing profound betrayal and grief. This episode offers insight into the harsh realities of escaping cult influence, even in the deepest parts of personal relationships. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-10-30T00:00:00Z",
      "duration": "00:42:04",
      "explicit": false,
      "spotifyId": "1bFCSu4cUL1pCg4ZzadlXZ",
      "appleId": 1000674938226,
      "youTubeId": "Op53nLm89yc",
      "subjects": [
        "Church of Immortal Consciousness",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1bFCSu4cUL1pCg4ZzadlXZ",
        "apple": "https://podcasts.apple.com/podcast/when-the-lies-become-too-much-losing-a-marriage-to/id1723601274?i=1000674938226",
        "youtube": "https://www.youtube.com/watch?v=Op53nLm89yc"
      }
    },
    {
      "id": "3295bed0-15be-49cc-89a6-9b5e7c96bd3e",
      "title": "Unlearning Venom: Healing Cult Trauma Through Gratitude",
      "description": "Send us a text In this episode of How to Leave a Cult, I take you inside the intense and often toxic dynamics of life as a young couple in the cult. From attending trance circles and processes to learning the cult\u0027s harsh, down-and-dirty communication methods, I share how venomous words became a way of life. We explore the damage that such negative patterns can cause in relationships and personal well-being. But there’s hope—healing is possible. I discuss how practicing gratitude helped me transform those harmful habits and the health benefits of embracing this positive mindset. Join me as I share how gratitude can be a powerful tool in breaking free from a toxic past and fostering genuine emotional healing. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-10-23T01:00:00Z",
      "duration": "00:37:20.8620000",
      "explicit": true,
      "spotifyId": "521FqPfq8C9RheFpzDirN7",
      "appleId": 1000674083456,
      "youTubeId": "KB14UdxAsHE",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/521FqPfq8C9RheFpzDirN7",
        "apple": "https://podcasts.apple.com/podcast/unlearning-venom-healing-cult-trauma-through-gratitude/id1723601274?i=1000674083456",
        "youtube": "https://www.youtube.com/watch?v=KB14UdxAsHE"
      }
    },
    {
      "id": "d29a7956-decf-4b6e-9cd0-b8a5c30f90f1",
      "title": "Healing Beyond the Surface: Cult Expectations, Trauma, and Recovery",
      "description": "Send us a text In this episode of How to Leave a Cult, we dive deep into how living under a cult’s control affects us long after we’ve left. We start by exploring the 80/20 iceberg theory, which reveals how explicit rules and hidden expectations from cult life shape our recovery from trauma. I share the emotional journey of my child\u0027s birth, where the pressure to meet cult standards—like having a home birth—led to feelings of failure when I needed to go to the hospital. Through personal experiences, we explore how healing is like peeling layers off an onion, addressing each painful emotion—grief, anger, and hurt—without judgment. This episode helps us see the importance of sitting with these emotions and finding the hidden gifts that come from facing our trauma. Whether you\u0027re in the process of leaving a controlling group or working through past wounds, this episode offers insight into how to break free and heal. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-10-01T23:00:00Z",
      "duration": "00:30:27.7350000",
      "explicit": true,
      "spotifyId": "5NgxlNkaTSF98GsJdSIXLf",
      "appleId": 1000671481232,
      "youTubeId": "CasCTIkHvg8",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5NgxlNkaTSF98GsJdSIXLf",
        "apple": "https://podcasts.apple.com/podcast/healing-beyond-the-surface-cult-expectations-trauma/id1723601274?i=1000671481232",
        "youtube": "https://www.youtube.com/watch?v=CasCTIkHvg8"
      }
    },
    {
      "id": "e9cdbc99-b8b6-47f2-b6e7-3246a96c7116",
      "title": "When Milestones Aren’t Yours: The Wedding and Baby Shower I Didn’t Plan",
      "description": "Send us a text In this deeply personal episode, I open up about two major life events—my wedding and baby shower—that were entirely decided for me. From the guest list to the location, nothing was truly mine. I share how these moments, which should have been joyful and celebratory, were orchestrated by the controlling hands of the group I was part of. Join me as I reflect on the emotional toll of having such meaningful life experiences taken over by others and how I began the journey of reclaiming my autonomy. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-09-24T01:00:00Z",
      "duration": "00:30:36",
      "explicit": false,
      "spotifyId": "6nKPcUjWkItiCZ7Lw4LgxF",
      "appleId": 1000670473202,
      "youTubeId": "Xs4cMxGqABI",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nKPcUjWkItiCZ7Lw4LgxF",
        "apple": "https://podcasts.apple.com/us/podcast/when-milestones-arent-yours-the-wedding-and-baby-shower/id1723601274?i=1000670473202",
        "youtube": "https://www.youtube.com/watch?v=Xs4cMxGqABI"
      }
    },
    {
      "id": "3f52aae7-f551-47cd-8f0c-f74e30435158",
      "title": "Returning to the Fold: David\u0027s Journey In and Out of Cult Life",
      "description": "Send us a text In the upcoming episode of \u0022How to Leave a Cult,\u0022 I\u0027m joined by David, a former cult member whose story is both unique and deeply compelling. David and his wife initially found solace in practices like Transcendental Meditation and Rebirthing, which brought them positive experiences and a sense of peace. However, these very practices led them to the doors of the cult, where they were drawn in by charismatic leaders, Trina and Steven. David shares his emotional journey of joining the cult, leaving, and then rejoining years later, all while grappling with the influence of the ministers he once admired. When the cult\u0027s leaders turned his wife against him, David felt trapped, unable to leave as she distanced herself from him. Their situation became even more dire when one of the ministers resorted to physical abuse, prompting them to finally flee together. This episode sheds light on the power of manipulation, the challenges of breaking free, and the complex interplay between spiritual practices and cult influence. Tune in for an insightful conversation about resilience, love, and the struggle to reclaim one\u0027s life. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-09-03T09:00:00Z",
      "duration": "01:10:49.4170000",
      "explicit": true,
      "spotifyId": "0K787xZB3vwhbYEXFuKapQ",
      "appleId": 1000668143397,
      "youTubeId": "sBGmxgogWRg",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0K787xZB3vwhbYEXFuKapQ",
        "apple": "https://podcasts.apple.com/podcast/returning-to-the-fold-davids-journey-in-and-out-of-cult-life/id1723601274?i=1000668143397",
        "youtube": "https://www.youtube.com/watch?v=sBGmxgogWRg"
      }
    },
    {
      "id": "ba5ece12-99fb-4277-80c4-3f5c1e58fd70",
      "title": "Enforcing the Faith: How Cult Teachings Made Me Controlling",
      "description": "Send us a text In this episode of \u0022How to Leave a Cult,\u0022 I dive into how the harsh and unforgiving teachings of the church led me to become controlling in my relationships. Driven by a desperate need to live up to the impossible standards set by the cult, I started to enforce the same rigid rules that were imposed on me. This episode explores how the pressure to conform to extreme beliefs can warp your sense of self and turn love into a mechanism of control. But there’s hope for healing. I also share how I began the journey of breaking down the layers of walls I had built around myself. Through powerful visualization techniques, I slowly started to reclaim my identity and free myself from the cycle of control that had been ingrained in me. Join me as I reveal the personal struggles of navigating relationships under the weight of cult expectations and how visualization helped me rediscover who I truly am. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-08-28T22:00:00Z",
      "duration": "00:31:00",
      "explicit": false,
      "spotifyId": "7K1nCNVZpCCowTOYtUQx4D",
      "appleId": 1000666953982,
      "youTubeId": "71z5bF-GAlk",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7K1nCNVZpCCowTOYtUQx4D",
        "apple": "https://podcasts.apple.com/us/podcast/enforcing-the-faith-how-cult-teachings-made-me-controlling/id1723601274?i=1000666953982",
        "youtube": "https://www.youtube.com/watch?v=71z5bF-GAlk"
      }
    },
    {
      "id": "81c82c54-c61c-4d4a-a9a1-135c5540e355",
      "title": "Shame and Submission: Life in My Cult-Arranged Relationship",
      "description": "Send us a Text Message. In this episode of \u0022How to Leave a Cult,\u0022 I share the harrowing experience of navigating my arranged relationship within the cult. Not only was I responsible for teaching him the \u0022law of the land\u0022 and dictating our living situations, but we also faced constant emotional torment due to false accusations. The cult\u0027s leadership would tear us down emotionally, using shame as a weapon to maintain control. Adding to the turmoil, we were forced to divulge our sexual pasts to prove our purity, a humiliating process that further stripped us of our dignity and autonomy. This episode explores the dark intersection of control, shame, and manipulation, revealing how cults use relationships to dominate and break down their members. Join me for an eye-opening look at the crushing weight of life under a cult’s rule. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-08-22T01:00:00Z",
      "duration": "00:37:21.4100000",
      "explicit": false,
      "spotifyId": "20PvhqL9nuZjzM9rIrcFDS",
      "appleId": 1000666189524,
      "youTubeId": "DMmncZMbPrs",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/20PvhqL9nuZjzM9rIrcFDS",
        "apple": "https://podcasts.apple.com/podcast/shame-and-submission-life-in-my-cult-arranged-relationship/id1723601274?i=1000666189524",
        "youtube": "https://www.youtube.com/watch?v=DMmncZMbPrs"
      }
    },
    {
      "id": "9f2b2c63-3db0-4531-94e7-6771ee10e3bb",
      "title": "Dictated Destiny: My Arranged Cult Marriage",
      "description": "Send us a Text Message. In this gripping episode of \u0022How to Leave a Cult,\u0022 I recount the carefully orchestrated meeting with the man I was chosen to marry within the cult. Through this personal story, we delve into the power dynamics that dictate relationships in cults, where choices are rarely one\u0027s own. Explore how leaders manipulate and control members\u0027 lives, using marriage as a tool to maintain their authority and reinforce their rigid hierarchy. We\u0027ll break down the psychological and emotional tactics employed to strip away personal agency and ensure compliance, revealing the unsettling realities of how power operates in these closed communities. Join me as I shed light on the dark undercurrents of control, manipulation, and forced relationships in cults. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-08-13T02:00:00Z",
      "duration": "00:37:21.0970000",
      "explicit": false,
      "spotifyId": "6cRxVLjiYcpOwHausKWkp9",
      "appleId": 1000665101024,
      "youTubeId": "YqiONbWX1yM",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6cRxVLjiYcpOwHausKWkp9",
        "apple": "https://podcasts.apple.com/podcast/dictated-destiny-my-arranged-cult-marriage/id1723601274?i=1000665101024",
        "youtube": "https://www.youtube.com/watch?v=YqiONbWX1yM"
      }
    },
    {
      "id": "5cd169ea-abe5-4d2d-bb80-7dd19f4caa37",
      "title": "Behind Closed Doors: My Life in a Cult at 16",
      "description": "Send us a Text Message. In this compelling episode of \u0022How to Leave a Cult,\u0022 we take a deeply personal journey into a day in my life as a 16-year-old living within a cult. Through vivid storytelling and raw reflections, you\u0027ll experience the daily routines, emotional struggles, and pervasive control that defined my existence at that age. We will also explore the profound question: Why don\u0027t people leave cults? Unpacking the psychological manipulation, emotional dependency, and fear tactics employed by cult leaders, this episode provides a comprehensive look at the barriers that prevent members from breaking free. Join me for an intimate glimpse into the realities of cult life and gain a deeper understanding of the complex reasons that keep people bound to these oppressive groups. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-08-06T02:00:00Z",
      "duration": "00:35:42",
      "explicit": false,
      "spotifyId": "5qctvUpZJWQKlBidbMpY7H",
      "appleId": 1000664434137,
      "youTubeId": "PZ7tY6IkzBY",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qctvUpZJWQKlBidbMpY7H",
        "apple": "https://podcasts.apple.com/us/podcast/behind-closed-doors-my-life-in-a-cult-at-16/id1723601274?i=1000664434137",
        "youtube": "https://www.youtube.com/watch?v=PZ7tY6IkzBY"
      }
    },
    {
      "id": "fe885013-22da-4e9d-8ebe-c33be003e157",
      "title": "Hidden in Plain Sight - Defining Cults and The Tactics they Use",
      "description": "Send us a Text Message. In this episode of \u0022How to Leave a Cult,\u0022 we delve into the unsettling reality that cults are not as strange or distant as they might seem—they exist right among us. Using the APA Dictionary of Psychology\u0027s definition as our foundation, we explore the intricate dynamics that make these groups both captivating and dangerous. Discover how authoritarian control, targeting the vulnerable, extremist beliefs, and comprehensive manipulation shape these highly cohesive and secretive organizations. We\u0027ll reveal the tactics cults use, like love bombing, isolation, and fostering an us-versus-them mentality, to maintain power and elude accountability. Plus, we\u0027ll provide you with 10 ways to identify a cult, helping you recognize the signs and protect yourself and your loved ones. Join us as we uncover how these groups blend into our communities, exploiting the unsuspecting and silencing dissent. Whether you\u0027re a curious listener or someone seeking to understand the pervasive presence of cults, this episode promises a revealing journey into the heart of cult control. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-07-16T01:00:00Z",
      "duration": "00:27:01.4460000",
      "explicit": false,
      "spotifyId": "22i8EhKwQVqeVIl9TBOOWH",
      "appleId": 1000662354183,
      "youTubeId": "dbm6SuGcVyU",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22i8EhKwQVqeVIl9TBOOWH",
        "apple": "https://podcasts.apple.com/podcast/hidden-in-plain-sight-defining-cults-and-the-tactics/id1723601274?i=1000662354183",
        "youtube": "https://www.youtube.com/watch?v=dbm6SuGcVyU"
      }
    },
    {
      "id": "15a4e6f4-5144-435f-8d12-1b84b6abcfef",
      "title": "Lawsuits Galore: The Cult\u0027s Legal Onslaught Unveiled",
      "description": "Send us a Text Message. In this eye-opening episode of \u0022HOW TO LEAVE A CULT,\u0022 we delve into the aggressive legal tactics employed by the Church of Immortal Consciousness. Discover how the church launched a series of lawsuits against neighbors, the community, the sheriff\u0027s department, a cult deprogrammer, a news station, and a reporter after accusations of cult activities began to surface. We\u0027ll explore the impact of these lawsuits on the victims, the community\u0027s response, and the broader implications for those seeking justice against powerful cult organizations. Expect to hear shocking news clippings, witness accounts of trance-like states displayed in court, and a deep dive into the legal documents that reveal the extent of the church\u0027s retaliatory measures. Tune in for a detailed look at how legal battles are used to silence dissent and protect cult interests, and what this means for survivors and whistleblowers seeking to expose the truth. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-07-04T00:00:00Z",
      "duration": "01:21:50",
      "explicit": false,
      "spotifyId": "0H6fpBcLnvQdDls38dQmsY",
      "appleId": 1000661092037,
      "youTubeId": "VtBuMnYkjJA",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0H6fpBcLnvQdDls38dQmsY",
        "apple": "https://podcasts.apple.com/us/podcast/lawsuits-galore-the-cults-legal-onslaught-unveiled/id1723601274?i=1000661092037",
        "youtube": "https://www.youtube.com/watch?v=VtBuMnYkjJA"
      }
    },
    {
      "id": "f801d870-d947-4ffb-b2e7-251f96661433",
      "title": "Echoes of Waco: Rumors, Threats, and Protective Measures in Cult Communities",
      "description": "Send us a Text Message. In this riveting episode of \u0022HOW TO LEAVE A CULT,\u0022 we delve into the far-reaching consequences of the Waco Texas Cult Branch Davidians massacre, how it sparked rumors about our church and cult, and the failures of the sheriff\u0027s department in providing protection. Join us as we uncover the challenges of dealing with threats, combating rumors of devil worship, and the necessity of hiring bodyguards for safety within cult communities. Gain valuable insights into the impact of external events on cult dynamics, the tactics used to maintain control amidst adversity, and the resilience of survivors navigating these turbulent times. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-05-29T09:00:00Z",
      "duration": "00:25:47.5720000",
      "explicit": false,
      "spotifyId": "6JatKHmdSEtO1B0ZMXj3c5",
      "appleId": 1000657146475,
      "youTubeId": "5lq_N1_bg0w",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6JatKHmdSEtO1B0ZMXj3c5",
        "apple": "https://podcasts.apple.com/podcast/echoes-of-waco-rumors-threats-and-protective-measures/id1723601274?i=1000657146475",
        "youtube": "https://www.youtube.com/watch?v=5lq_N1_bg0w"
      }
    },
    {
      "id": "22b82f12-f8dc-4257-98c5-1353402d9b0b",
      "title": "Forced Friendships, Pot Fallout, and Learning to Lie: Navigating Cult Dynamics",
      "description": "Send us a Text Message. In this gripping episode of \u0022HOW TO LEAVE A CULT,\u0022 we unravel the complex web of forced friendships, the aftermath of getting caught using pot, and the art of deception learned within cults. Join us as we delve into the pressures of maintaining artificial relationships, the repercussions of rebellious behavior like cannabis use, and the survival strategies that often involve bending the truth. Gain valuable insights into the psychological impact of these experiences and discover how survivors navigate authenticity and trust after leaving a cult. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-05-23T01:00:00Z",
      "duration": "00:22:43.1210000",
      "explicit": false,
      "spotifyId": "7FQ4HrAqaeW2bODN4vBSzB",
      "appleId": 1000656458301,
      "youTubeId": "AqkFtv06dus",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7FQ4HrAqaeW2bODN4vBSzB",
        "apple": "https://podcasts.apple.com/podcast/forced-friendships-pot-fallout-and-learning-to-lie/id1723601274?i=1000656458301",
        "youtube": "https://www.youtube.com/watch?v=AqkFtv06dus"
      }
    },
    {
      "id": "bebd6536-eb3e-437a-85a5-aa31d1384a90",
      "title": "From Junior High to Cult \u0022Service\u0022: My Journey through Rumors and Legal Realities",
      "description": "In this episode of \u0022How To Leave A Cult,\u0022 I share my personal journey of being ripped out of junior high to serve in the church, the rumors that swirled around the cult and its activities, and my experience working in the law office. Join me as I unveil the truth behind these experiences, offering insights into the inner workings of cults, the impact of rumors on perception, and the challenges of reintegration into society. Tune in for a candid and introspective discussion on resilience, truth, and the complexities of living in a cult. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-04-20T15:00:00Z",
      "duration": "00:33:52.7700000",
      "explicit": false,
      "spotifyId": "5jO7hzhHL7qvrEUdWmVUbJ",
      "appleId": 1000653062817,
      "youTubeId": "bmewji96lEY",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jO7hzhHL7qvrEUdWmVUbJ",
        "apple": "https://podcasts.apple.com/podcast/from-junior-high-to-cult-service-my-journey-through/id1723601274?i=1000653062817",
        "youtube": "https://www.youtube.com/watch?v=bmewji96lEY"
      }
    },
    {
      "id": "4c3ad83c-bc50-4be8-8885-17a3126ec603",
      "title": "School, Sexual Promiscuity, Religious Purity, and Relationships in Light of Church Expectations",
      "description": "In this episode of \u0022HOW TO LEAVE A CULT,\u0022 we delve into the complex dynamics of balancing societal norms with religious teachings. Join us as we discuss the challenges faced by church member when navigating the expectations of education versus spiritual devotion, the conflicts between sexual freedom and religious purity, and the impact of church expectations on relationships. Gain insights, strategies, and personal story of how life was at the ages of 12-13 in the Church of Immortal Consciousness while I shed light on these intricate intersections of belief systems and trying to grow. Healing Resource: Practice Gratitude - listen to learn more. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-03-26T21:00:00Z",
      "duration": "00:32:10.1610000",
      "explicit": false,
      "spotifyId": "30EUwonU6EEEY8Uchr5YGq",
      "appleId": 1000650538450,
      "youTubeId": "IXcgx0HdX1Q",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/30EUwonU6EEEY8Uchr5YGq",
        "apple": "https://podcasts.apple.com/podcast/school-sexual-promiscuity-religious-purity-and/id1723601274?i=1000650538450",
        "youtube": "https://www.youtube.com/watch?v=IXcgx0HdX1Q"
      }
    },
    {
      "id": "9ff3ad19-735f-48d9-860e-76be16f260c7",
      "title": "Absolute Chaos",
      "description": "Welcome to \u0027HOW TO LEAVE A CULT,\u0027 where we navigate the challenging path of breaking free from manipulative systems. In this episode, we delve into a lesser-known aspect of cult dynamics—using utter chaos as a method to keep members too busy and in fear. Through personal reflections, we unveil the tactics cults employ to create a constant state of turmoil and uncertainty. I share stories the consistent fear and chaos of no safe or calm, shedding light on the psychological impact of living in a chaotic environment. Which leads to emotionally declining health, which leads to physically declining health. Join me as I also share how reading and education can bring light to the darkness and create new levels of healing. Through shared experiences and compassionate guidance, we empower survivors and allies to navigate the path towards healing and freedom. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-03-20T20:00:00Z",
      "duration": "00:31:38.7360000",
      "explicit": false,
      "spotifyId": "7BvryyYP8Dcih76V9NqlaA",
      "appleId": 1000649913764,
      "youTubeId": "_fFRYN0CKkE",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7BvryyYP8Dcih76V9NqlaA",
        "apple": "https://podcasts.apple.com/podcast/absolute-chaos/id1723601274?i=1000649913764",
        "youtube": "https://www.youtube.com/watch?v=_fFRYN0CKkE"
      }
    },
    {
      "id": "23e9e4ee-a0c9-4dbf-8551-72377711d3ce",
      "title": "Beyond the Cult: Navigating Relationships After Leaving",
      "description": "Join us in this episode of \u0022How to Leave a Cult\u0022 as we delve into the complexities of rebuilding relationships post-cult departure. Whether you\u0027ve sought therapy, hired a coach, or embarked on a journey of self-discovery, navigating interpersonal connections can be daunting. We explore strategies, insights, and personal stories to guide you through this transformative process. Tune in to discover how to cultivate healthy relationships and reclaim your sense of belonging after leaving a cult. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-03-12T21:00:00Z",
      "duration": "00:25:24.5320000",
      "explicit": false,
      "spotifyId": "6Wak7jq4Tm3SFz5hAvOSD0",
      "appleId": 1000648970340,
      "youTubeId": "xjEmXN4mzIs",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Wak7jq4Tm3SFz5hAvOSD0",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-cult-navigating-relationships-after-leaving/id1723601274?i=1000648970340",
        "youtube": "https://www.youtube.com/watch?v=xjEmXN4mzIs"
      }
    },
    {
      "id": "616d21bf-9505-42ae-81f9-9382cb79a066",
      "title": "Cult Redefines Sibling Relationships and other WTF",
      "description": "In this episode of How To Leave A Cult; the first of the lawsuits I was made aware of. The cult moves cities and siblings get redefined and my parents were able to have their hearts eased. Mom got the day off work! Forgiveness, why it is so important in the healing process and how to do it. You have to start with the small things. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-02-27T01:00:00Z",
      "duration": "00:41:28.5550000",
      "explicit": false,
      "spotifyId": "4xWOzjXlCDE7Kejsc2jPER",
      "appleId": 1000647169996,
      "youTubeId": "__I35fEsmoU",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xWOzjXlCDE7Kejsc2jPER",
        "apple": "https://podcasts.apple.com/podcast/cult-redefines-sibling-relationships-and-other-wtf/id1723601274?i=1000647169996",
        "youtube": "https://www.youtube.com/watch?v=__I35fEsmoU"
      }
    },
    {
      "id": "c589d5eb-19eb-4e6a-a4b8-6fb092845fdf",
      "title": "Gaslighting and Spiritual Hierarchy",
      "description": "Cults and some churches often lead you to believe that there is not a hierarchy, but it\u0027s a lie. They also gaslight you and encourage you stay obedient. If you can ask questions and get answers it might not be this toxic environment. If you can\u0027t, you might be in a cult. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-02-20T01:00:00Z",
      "duration": "00:29:42.3860000",
      "explicit": false,
      "spotifyId": "5KZMpBqcJeGFocD4TGKfAL",
      "appleId": 1000645937194,
      "youTubeId": "Lci3G4zHJzk",
      "subjects": [
        "Church of Immortal Consciousness",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KZMpBqcJeGFocD4TGKfAL",
        "apple": "https://podcasts.apple.com/podcast/gaslighting-and-spiritual-hierarchy/id1723601274?i=1000645937194",
        "youtube": "https://www.youtube.com/watch?v=Lci3G4zHJzk"
      }
    },
    {
      "id": "40ee80a8-ad56-453d-8865-30d64b2a87cc",
      "title": "Speaking to the dead, and cruel practices toward the living.",
      "description": "There were several practices that were part of the church that we had to actively participate in. Let\u0027s break them down and explain how they all worked. Dive into this episode to learn what trance or channeling was like. Specifically how Trina spoke a dead spirit. The process was a meeting with the ministers of the church where there was a free for all to obliterate people and say the unthinkable. Finally bhajans was a practice taken from Hindi traditions. Let\u0027s get weird. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-02-10T22:00:00Z",
      "duration": "00:32:55.6400000",
      "explicit": false,
      "spotifyId": "3UwB9UhWeHb2Yd4AWWXZZr",
      "appleId": 1000644892019,
      "youTubeId": "-IG2CEJvcVA",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3UwB9UhWeHb2Yd4AWWXZZr",
        "apple": "https://podcasts.apple.com/podcast/speaking-to-the-dead-and-cruel-practices-toward-the-living/id1723601274?i=1000644892019",
        "youtube": "https://www.youtube.com/watch?v=-IG2CEJvcVA"
      }
    },
    {
      "id": "0f8c5830-3eff-44f8-9d82-faa79476e523",
      "title": "Baby Elephants",
      "description": "If you have ever seen an adult elephant they may have a shackle on that is chained to a post and with a slight tug they could easily break free. Then why do they remain chained to a post. They are strong majestic beasts. For the same reason you are still being undervalued in your life. You are strong and majestic, but you don\u0027t see this strength. Dive into this weeks episode to learn how to break free. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-01-22T10:00:00Z",
      "duration": "00:27:18.6350000",
      "explicit": false,
      "spotifyId": "5OAshJT9W8d1hm16PJFE9X",
      "appleId": 1000642473990,
      "youTubeId": "OGycg4SoB28",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5OAshJT9W8d1hm16PJFE9X",
        "apple": "https://podcasts.apple.com/podcast/baby-elephants/id1723601274?i=1000642473990",
        "youtube": "https://www.youtube.com/watch?v=OGycg4SoB28"
      }
    },
    {
      "id": "f0d562ce-bd3f-4c9f-912b-3a430541e7cc",
      "title": "Family Secrets",
      "description": "In this weeks episode I share a huge family secret! In this episode learn about a family secret and the way it unfolded. Then learn how family dynamics began to be rewritten and redefined. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-01-12T22:00:00Z",
      "duration": "00:27:37.3910000",
      "explicit": false,
      "spotifyId": "4ZbM5OEBoUxIvhkjyNa0Ij",
      "appleId": 1000641486431,
      "youTubeId": "6PNPYBPiaK4",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ZbM5OEBoUxIvhkjyNa0Ij",
        "apple": "https://podcasts.apple.com/podcast/family-secrets/id1723601274?i=1000641486431",
        "youtube": "https://www.youtube.com/watch?v=6PNPYBPiaK4"
      }
    },
    {
      "id": "da1ab20e-18ef-40ac-b7b7-131a95cce66f",
      "title": "The Cult Habitat",
      "description": "The Story: As I begin to adjust to life in the church, it is every part of our life. Our home, school, neighbors and friends are all the same surroundings. We lived collectively both physically and financially. Each member is considered family and we have to treat everyone as such. (Which included giving free labor of whatever skill you had to the other members). How we began to get indoctrinated in the school and turned against our parents. Healing Technique: Mirror Work The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-01-01T15:00:00Z",
      "duration": "00:30:20.9170000",
      "explicit": false,
      "spotifyId": "4J3glRqTQRRoP3SpVeGgXn",
      "appleId": 1000640238855,
      "youTubeId": "14D5oY4K1F4",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4J3glRqTQRRoP3SpVeGgXn",
        "apple": "https://podcasts.apple.com/podcast/the-cult-habitat/id1723601274?i=1000640238855",
        "youtube": "https://www.youtube.com/watch?v=14D5oY4K1F4"
      }
    },
    {
      "id": "f9bff15e-6461-4c21-b0f5-a94365036e3d",
      "title": "Moving to the Cult",
      "description": "Story: In September of 1986 my family drove across the US from Rockville, Maryland to Mesa, Arizona to join the Church of Immortal Consciousness. From the very beginning there was huge changes in my life. Communal living, hierarchy and many weird changes to the way life had been. Healing Technique: Learn how to do diaphragmatic breathing. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-01-01T09:00:00Z",
      "duration": "00:37:27.8880000",
      "explicit": false,
      "spotifyId": "4W72OAbK0eTxedrZkFffyd",
      "appleId": 1000640219542,
      "youTubeId": "v9_2usSANfo",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4W72OAbK0eTxedrZkFffyd",
        "apple": "https://podcasts.apple.com/podcast/moving-to-the-cult/id1723601274?i=1000640219542",
        "youtube": "https://www.youtube.com/watch?v=v9_2usSANfo"
      }
    },
    {
      "id": "d4038389-e040-4a16-93a1-6850cf341294",
      "title": "Intro - How To Leave A Cult",
      "description": "Welcome to HOW TO LEAVE A CULT. This is our fabulous intro! I want to share why I am creating this podcast as well as what you can expect from future episodes. I want to create a community where people who have been abused by cults or religious groups can learn and heal. I will be sharing my very personal story of being raised in a religious cult for nearly 30 years. I will also be sharing how I have healed and how you can too. You can move past the past. You deserve to not carry that kind of baggage anymore. My story will share manipulation, gaslighting, alcoholism, as well as a cult run charter school, massive lawsuits, cult experts, arranged marriage and so much more. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2023-12-30T13:00:00Z",
      "duration": "00:14:10.2850000",
      "explicit": false,
      "spotifyId": "4H2yGgdYkId1GARyRZpVyb",
      "appleId": 1000640089274,
      "youTubeId": "IPBu0VRwtVk",
      "subjects": [
        "Church of Immortal Consciousness",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4H2yGgdYkId1GARyRZpVyb",
        "apple": "https://podcasts.apple.com/podcast/intro-how-to-leave-a-cult/id1723601274?i=1000640089274",
        "youtube": "https://www.youtube.com/watch?v=IPBu0VRwtVk"
      }
    }
  ]
}