{
  "id": "b24051eb-a5c8-40e8-8ea6-9da034ad7607",
  "name": "How I Survived",
  "youTubeChannelId": "UCnm7qjWccQaPt5yNoGAlxiw",
  "episodes": [
    {
      "id": "a49cbe28-516e-406c-836e-369993881dfe",
      "title": "I\u0027m A Four Time Cult Survivor... What I\u0027ve Seen Would Shock You",
      "description": "Channel Disclaimer: This video includes is a cult survivor story. Please watch with care. \n-------------------------------------------------------------------------------------------------------------------------------\nThis genuine real life horror story of Jaya Gibson - a four time cult survivor. While sharing this true crime cult story, Jaya reveals secrets about some of the biggest cults in the world, including Scientology. \n\nBorn into this life, Jaya spent his childhood living a cult horror story. He saw bizarre cult rituals and practices. \n\nWhen he was old enough, he left... but soon found himself caught up in some of the biggest cults in the world. He got unique insights into cult leaders\u0027 personality traits and even how a cult is started. Now, he explains cult practices and how cult members are indoctrinated. \n\nAfter finally escaping his fourth cult, Jaya decided to share his cult survivor story to help others who might be trying to leave. He now has an inspirational real life story of rebuilding his life - and helping others who have survived some of the most shocking cults in the world. \n-------------------------------------------------------------------------------------------------------------------------------\nHow I Survived is a platform for people to share their real survival stories and real true crime stories. Everyday people reveal how they survived real life horror stories of unimaginable trauma and have gone on to rebuild their lives. \n\nThrough these motivational and inspirational real life stories, we are raising awareness about trauma, including abuse, violence, experiences with cults, grief, and other life-changing experiences. Our goal as a supportive and motivational story channel is to share these important, emotional real life stories to help other survivors feel less alone - and to foster greater understanding of and compassion for others. \n\nWe share these motivational real life stories Thursdays at 12 PM ET.\n\n#crime #truecrimestories #viralvideo #truecrimestory #reallifehorrorstory",
      "release": "2025-10-02T16:00:06Z",
      "duration": "00:19:28",
      "explicit": false,
      "youTubeId": "1A9jKiNzphI",
      "subjects": [
        "Fourth Way",
        "Triratna Buddhist Community",
        "Scientology",
        "Falun Gong"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1A9jKiNzphI"
      }
    }
  ]
}