{
  "id": "394570ca-8ffd-4ea0-85c7-83d049f5e77f",
  "name": "How We Get Thru Podcast",
  "spotifyId": "4PQw5SlSltVaqH9Kd6bHVZ",
  "appleId": 1685931154,
  "episodes": [
    {
      "id": "20125491-ff9a-41a4-8d7c-a2c639dfb391",
      "title": "Archived Episode Healing Generational Trauma and Confronting Familial Shame with Kelsey Grimm",
      "description": "Welcome to How We Get Thru, the podcast where we share stories, mental health insights, and healing advice on life\u0027s everyday challenges. I\u0027m your host, Jen, a licensed therapist and founder of the How We Get Thru app.Today\u0027s guest is Kelsey Grimm, a registered clinical counselor from British Colombia, Canada. In this episode, Kelsey shares how family shame patterns are formed and how it can translate to feeling unlovable. This feels like such a heavy topic and it can be but I want to invite you into this conversation because it can also be very empowering. And if you’ve listened to this podcast so far, you know we can go deep but we always come out the other side. Take a listen. Live in Canada and want to work with Kelsey? Check out her info here . Get on the waitlist for Fear To Change! If you\u0027ve resonated with our podcast and its transformative impact, I encourage you to take the next step and check out Kelsey\u0027s course, \u0022Family Shame Patterns,\u0022 on the How We Get Thru app. By downloading the app on your iPhone or Android, you\u0027ll gain access to a FREE 7-day trial, allowing you to watch, listen, or read Kelsey\u0027s course and many others at your own pace. Dive deep into the healing process and emerge on the other side, equipped with the tools to overcome and thrive. Did you know that our podcast is also on YouTube? Head to our channel to watch our full podcast episodes and make sure you subscribe so you don’t miss out! Get your How We Get Thru 2024 Journal \u0026#43; Planner: https://www.howwegetthru.com/merch/p/2024planner Get the How We Get Thru App: https://www.howwegetthru.com/ Follow How We Get Thru on IG: https://instagram.com/howwegetthru?igshid=OGQ5ZDc2ODk2ZA%3D%3D\u0026utm_source=qr",
      "release": "2024-06-06T11:00:00Z",
      "duration": "00:59:09.9100000",
      "explicit": false,
      "spotifyId": "39GNcD1c2czBpYENUmZxD0",
      "appleId": 1000658037989,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/39GNcD1c2czBpYENUmZxD0",
        "apple": "https://podcasts.apple.com/podcast/archived-episode-healing-generational-trauma-and/id1685931154?i=1000658037989"
      }
    },
    {
      "id": "ead75292-ccb6-46d6-bc4b-3ad6196e8e18",
      "title": "The Impacts of Religious Trauma and IVF with Quincee Gideon, PsyD.",
      "description": "What does religious trauma and IVF have in common? Well in this episode you\u0027re about to find out. Dr. Quincee Gideon, she is a licensed psychologist who specializes in religious trauma and cult recovery, with us. But, she\u0027s not just any expert – she\u0027s on a personal quest of her own. Quincee\u0027s about to share her unique journey of shedding even more layers of religious trauma as she unravels it from her IVF journey.From the basics of religious trauma to the painful undercurrent of \u0022god\u0027s timing\u0022 when it comes to trying to conceive, we\u0027re diving deep into these experiences. Join us in this candid conversation as we explore the intersection of faith, trauma, and fertility.You’re listening to the how we get thru podcast, a place for you to feel connected thru deep and meaningful conversations. I\u0027m your host Jen, a licensed therapist and founder and CEO of the how we get thru app. My mission is to bring affordable \u002B diverse therapy resources to help you get thru the hard stuff—all in one place, at your own pace. Welcome to the How We Get Thru community. Resources:A Year of Non-Magical Thinking: https://www.traumastery.com/yonmtTraumastry: https://www.traumastery.com/Fertility Support Groups: PSI: https://www.postpartum.net/get-help/psi-online-support-meetings/#fertility-challengesUniquely Knitted: https://uniquelyknitted.org/process-groups/",
      "release": "2023-10-31T00:00:00",
      "duration": "01:04:59.8200000",
      "explicit": false,
      "spotifyId": "3zvaBuKy6LhSjs7OuCBYie",
      "appleId": 1000633208852,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zvaBuKy6LhSjs7OuCBYie",
        "apple": "https://podcasts.apple.com/podcast/the-impacts-of-religious-trauma-and-ivf/id1685931154?i=1000633208852"
      }
    }
  ]
}