{
  "id": "b24051eb-a5c8-40e8-8ea6-9da034ad7607",
  "name": "How I Survived",
  "youTubeChannelId": "UCnm7qjWccQaPt5yNoGAlxiw",
  "episodes": [
    {
      "id": "003e4996-e9ed-44bf-8ba2-a2640c58f989",
      "title": "My Cult Leader Abused Me For Over 20 Years... Here\u0027s How I Got Out",
      "description": "In this real life cult survival story, Will Allen shares how he was sucked into a dangerous, abuse cult for over two decades. It was only after years of secret abuse, the cult leader being the target of an FBI manhunt, and even a murder plot, that Will was finally able to break free - and tell his survival story. \n\nAfter college, Will got kicked out and was searching for a path to happiness. That\u0027s when he joined Buddhafield - what would become one of LA\u0027s most notorious cults. \n\nAt first, Will found new faith and seemed to be on a path to enlightenment. He and the other cult followers didn\u0027t realize that they were in the clutches of a narcissist. \n\nWill became one of The Teacher\u0027s right hand people - a situation he created to draw Will close, then secretly abuse him for years. \n\nAs the cult leader\u0027s manipulations were exposed, it led to an FBI investigation and manhunt that forced the cult underground. \n\nWhen things reached a crisis point with a murder plot, some followers realized they were living in a real life horror story. \n\nFind out how Will finally broke away - and discover his inspirational story of how he rebuilt his life from the ground up, even making the critically acclaimed documentary Holy Hell about his experiences. \n-------------------------------------------------------------------------------------------------------------------------------\nTruth Be Told is a platform for people to share their real survival stories and real true crime stories. Everyday people reveal how they survived real life horror stories of unimaginable trauma and have gone on to rebuild their lives. \n\nThrough these motivational and inspirational real life stories, we are raising awareness about trauma, including abuse, violence, experiences with cults, grief, and other life-changing experiences. Our goal as a supportive and motivational story channel is to share these important, emotional real life stories to help other survivors feel less alone - and to foster greater understanding of and compassion for others. \n\nWe share these motivational real life stories Thursdays at 12 PM ET.\n\n#crime #truecrimestories #viralvideo #truecrimestory #reallifehorrorstory #terrorist #kidnapping #survival #shot",
      "release": "2025-12-04T17:00:29Z",
      "duration": "00:30:14",
      "explicit": false,
      "youTubeId": "L_pewigy3MM",
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L_pewigy3MM"
      }
    },
    {
      "id": "00185366-2c2a-4fe8-a1ec-57e43d8932a5",
      "title": "I Survived The Children Of God Cult... What I\u0027ve Seen Would Shock You",
      "description": "Channel Disclaimer: This video includes is a cult survivor story. Please watch with care. \n-------------------------------------------------------------------------------------------------------------------------------\nThis genuine real life horror story of Jerry Golland - a Children of God cult survivor. This infamous cult has counted Rose McGowan, River Phoenix, and Joaquin Phoenix amongst its members. \n\nRecruited after being robbed and stranded in London, Jerry entered the Children of God and spent the next decades living a cult horror story. He shares the bizarre cult rituals and practices he saw, as well as the shocking beliefs Children of God held. \n\nWhile sent around the world by the cult, Jerry ended up wrongful arrested and thrown in a Moroccan prison, saw the shift to the organization becoming a \u0022sex cult\u0022, and preached about the cult\u0027s doomsday prophecies. \n\nJerry shares what ultimately saved his life and the elaborate plan that allowed him to flee the cult with his children. He now is allowing others to hear his inspirational real life story of rebuilding his life - and helping others who have survived one of the most shocking cults in the world. \n-------------------------------------------------------------------------------------------------------------------------------\nTruth Be Told is a platform for people to share their real survival stories and real true crime stories. Everyday people reveal how they survived real life horror stories of unimaginable trauma and have gone on to rebuild their lives. \n\nThrough these motivational and inspirational real life stories, we are raising awareness about trauma, including abuse, violence, experiences with cults, grief, and other life-changing experiences. Our goal as a supportive and motivational story channel is to share these important, emotional real life stories to help other survivors feel less alone - and to foster greater understanding of and compassion for others. \n\nWe share these motivational real life stories Thursdays at 12 PM ET.\n\n#crime #truecrimestories #viralvideo #truecrimestory #reallifehorrorstory #cult",
      "release": "2025-11-06T17:00:09Z",
      "duration": "00:24:57",
      "explicit": false,
      "youTubeId": "714tqVVgmuc",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=714tqVVgmuc"
      }
    },
    {
      "id": "a49cbe28-516e-406c-836e-369993881dfe",
      "title": "I\u0027m A Four Time Cult Survivor... What I\u0027ve Seen Would Shock You",
      "description": "Channel Disclaimer: This video includes is a cult survivor story. Please watch with care. \n-------------------------------------------------------------------------------------------------------------------------------\nThis genuine real life horror story of Jaya Gibson - a four time cult survivor. While sharing this true crime cult story, Jaya reveals secrets about some of the biggest cults in the world, including Scientology. \n\nBorn into this life, Jaya spent his childhood living a cult horror story. He saw bizarre cult rituals and practices. \n\nWhen he was old enough, he left... but soon found himself caught up in some of the biggest cults in the world. He got unique insights into cult leaders\u0027 personality traits and even how a cult is started. Now, he explains cult practices and how cult members are indoctrinated. \n\nAfter finally escaping his fourth cult, Jaya decided to share his cult survivor story to help others who might be trying to leave. He now has an inspirational real life story of rebuilding his life - and helping others who have survived some of the most shocking cults in the world. \n-------------------------------------------------------------------------------------------------------------------------------\nHow I Survived is a platform for people to share their real survival stories and real true crime stories. Everyday people reveal how they survived real life horror stories of unimaginable trauma and have gone on to rebuild their lives. \n\nThrough these motivational and inspirational real life stories, we are raising awareness about trauma, including abuse, violence, experiences with cults, grief, and other life-changing experiences. Our goal as a supportive and motivational story channel is to share these important, emotional real life stories to help other survivors feel less alone - and to foster greater understanding of and compassion for others. \n\nWe share these motivational real life stories Thursdays at 12 PM ET.\n\n#crime #truecrimestories #viralvideo #truecrimestory #reallifehorrorstory",
      "release": "2025-10-02T16:00:06Z",
      "duration": "00:19:28",
      "explicit": false,
      "youTubeId": "1A9jKiNzphI",
      "subjects": [
        "Fourth Way",
        "Triratna Buddhist Community",
        "Scientology",
        "Falun Gong"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1A9jKiNzphI"
      }
    }
  ]
}