{
  "_ts": 0,
  "id": "deb4a21f-75a0-4e4a-ad8a-6ad2c9a73047",
  "name": "How to Survive Society",
  "spotifyId": "3nJVjQhwjFAdbk9nXm127f",
  "appleId": 1625906192,
  "episodes": [
    {
      "id": "caacd4c4-e501-42fe-ae1a-ba351e2cb953",
      "title": "How To Survive Society with Isabella Young",
      "description": "Isabella Young (B.Ed., M.Ed. Pre.) studied and taught Physical Education, Outdoor Education, Health, and Exercise Physiology to undergraduate and postgraduate students in Victoria, Australia. She was a pioneer in the establishment, development, and research of therapeutic Outdoor Education programs in Australia, and a founder of Out Doors Inc. (www.outdoorsinc.org.au), a non-profit organization that has provided outdoor adventure and recreation programs for people with poor mental health since 1987. In 1994, while completing a Ph.D. and lecturing in Outdoor Education, personal tragedy struck. At 33, widowed, pregnant, and with a three-year-old son, Isabella began her own healing journey that has spanned three decades. She has crisscrossed three continents under three different names, undertaking pilgrimages, retreats, shamanic journeys, and vision quests; living in the wilderness and in ashrams, including eight years in a messianic cult as the wife of the “guru,” who took the life of her son to prevent being exposed as a pedophile, a rapist, a thief, and a con man. Her son’s murder broke her free from cult brainwashing, and she escaped to Hawaii. Through her relentless devotion to heal, free her mind, and discover the Truth, Isabella is now free from suffering and enjoying life immersed in the natural beauty of Kauai, writing, swimming, growing food, and going barefoot. Isabella is the author of Putting on the Armor of God: A survival handbook for the Great Awakening and the Future of Humanity, which is essential reading to understand that humanity and the organic evolution of our species is under attack and that we need to be connected to our Divine nature, Nature, and each other to ensure our health, well-being, the freedom and future of humanity. Thank you to BetterHelp for sponsoring this episode. BetterHelp is the world\u0027s largest therapy service, and it\u0027s 100% online. With BetterHelp, you can tap into a network of over 30,000 licensed and experienced therapists who can help you with a wide range of issues. Get 10% off your first month at betterhelp.com/howtosurvivesociety Support the show Thank you for listening to another episode of How To Survive Society. Thank you to BetterHelp for sponsoring this episode. BetterHelp is the world\u0027s largest therapy service, and it\u0027s 100% online. With BetterHelp, you can tap into a network of over 30,000 licensed and experienced therapists who can help you with a wide range of issues. To get started, you just answer a few questions about your needs and preferences in therapy. That way, BetterHelp can match you with the right therapist from their network, Then you can talk to your therapist however you feel comfortable, whether it\u0027s via text, chat, phone or video call. You can message your therapist at any time, and schedule live sessions when it\u0027s convenient for you. If your therapist isn\u0027t the right fit for any reason, you can switch to a new therapist at no additional charge. With BetterHelp, you get the same professionalism and quality you expect from in-office therapy, but with a therapist who is custom-picked for you, more scheduling flexibility, and at a more affordable price. Get 10% off your first month at https://www.betterhelp.com/howtosurvivesociety",
      "release": "2023-05-09T07:00:00Z",
      "duration": "00:55:17.2110000",
      "explicit": false,
      "spotifyId": "14Dziq0hjWAd5ZJz65nw9T",
      "appleId": 1000612288717,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/14Dziq0hjWAd5ZJz65nw9T",
        "apple": "https://podcasts.apple.com/podcast/how-to-survive-society-with-isabella-young/id1625906192?i=1000612288717"
      }
    }
  ]
}