{
  "id": "c40eb115-fcb7-4fa7-afa8-c958bb5e19a9",
  "name": "How You Find Your Voice",
  "spotifyId": "4cFAHHwD7MED3wQao3LoXi",
  "appleId": 1862155383,
  "episodes": [
    {
      "id": "7df2fc34-c96a-46f4-a0d0-6813ae871948",
      "title": "Lily Dunn on the Radical Craft of Memoir",
      "description": "Writer Lily Dunn joins host Jessie Huth for a wide-ranging conversation about writing memoir, finding a voice, and what it takes to tell the truth on the page.\n\n \n\nDrawing on her latest book Into Being Lily reflects on the power and transformative potential of memoir, the role of editing in shaping a voice, and why memoir is rarely about revelation alone. She speaks candidly about writing her critically acclaimed memoir, Sins of My Father: A Daughter, a Cult, a Wild Unraveling, the emotional and ethical complexity of writing about family, and what happens when private stories enter the public world.\n\n\nTogether they explore authenticity, memory, and the vulnerability of publication, as well as the ways in which writing can be empowering and sustaining. This is a thoughtful, honest conversation about creativity, self-inquiry, and finding your voice as narrator. \n\n \n\nTopics covered\n\n\nInto Being and the long process of developing a writing voice   \nSins of My Father and the complexities of writing about family\nThe role of editors in shaping memoir\nPsychoanalysis, reflection, and self-inquiry in writing\nAuthenticity, vulnerability, and being read\nWriting as an empowering and healing practice\n\n \n\nKeywords\n\nvoice, women’s voices, writing, creativity, memoir, personal narrative, family, truth-telling, Lily Dunn, Sins of My Father, Into Being\n\n\nAbout Lily Dunn\n\nDr Lily Dunn is a writer of both fiction and non-fiction, an editor and a lecturer at Bath Spa University. Her memoir, Sins of my Father: A Daughter, a Cult, a Wild Unravelling won The Guardian Nonfiction Book of the Year in 2022. Her latest book, Into Being: the radical craft of memoir and its power to transform is an essential guide to writing memoir as a radical and empowering practice. \n\nLily co-founded the London Lit Lab at Birkbeck University in London, where she teaches creative writing. Her specialisms include memoirs, personal essays and narrative nonfiction.\n\n \n\nBooks mentioned\n\nInto Being by Lily Dunn\n\nSins of My Father by Lily Dunn\n\nRead more here  \n\n \n\nAbout the guest\n\n Lily Dunn on Substack \n\n\nListen and follow\n\nHow You Find Your Voice\n\nIf you enjoyed this conversation, you can follow the podcast for future episodes. \n\n ",
      "release": "2025-12-29T10:29:16Z",
      "duration": "01:05:40",
      "explicit": false,
      "spotifyId": "07Cgmy0XrTXDO8Gdya5tID",
      "appleId": 1000743041908,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07Cgmy0XrTXDO8Gdya5tID",
        "apple": "https://podcasts.apple.com/podcast/lily-dunn-on-the-radical-craft-of-memoir/id1862155383?i=1000743041908"
      }
    }
  ]
}