{
  "id": "f03c0408-77b1-4677-a3c2-a305047b38a8",
  "name": "How Did We Get Here?",
  "spotifyId": "6A7eHnljo9H9RnU21nA4np",
  "appleId": 1744718182,
  "youTubeChannelId": "UC47xQgGHeA5PtdKoE_QL-Mw",
  "episodes": [
    {
      "id": "8c61126f-00f2-429b-a4a9-e012b84b0d8b",
      "title": "7M: TikTok Terror?",
      "release": "2024-12-24T04:50:47Z",
      "duration": "00:11:59",
      "explicit": false,
      "spotifyId": "5gy8pWkQ712JxLYBaLrcWE",
      "appleId": 1000681514345,
      "youTubeId": "crVrgxS55SI",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5gy8pWkQ712JxLYBaLrcWE",
        "apple": "https://podcasts.apple.com/podcast/7m-tiktok-terror/id1744718182?i=1000681514345",
        "youtube": "https://www.youtube.com/watch?v=crVrgxS55SI"
      }
    },
    {
      "id": "84b63a29-826c-42b3-95d2-2a105c9375ad",
      "title": "Heaven\u0027s Gate Part 4",
      "description": "Summary This episode explores the infamous cult Heaven\u0027s Gate and its tragic end. It discusses the factors leading up to the mass suicide, the beliefs of the cult, and the concept of free will. The episode also raises questions about the human capacity for belief and the willingness to make drastic choices. The deaths of the cult members are examined as both suicides and murders. Keywords Heaven\u0027s Gate, cult, mass suicide, beliefs, free will, human capacity, drastic choices, suicides vs murders, modern cults Takeaways Heaven\u0027s Gate was a cult that believed in the existence of extraterrestrial life and the opportunity to ascend to a higher level of existence. The death of Bonnie Lou Nuttles, a member of the cult, led to a change in belief system and the eventual mass suicide. The members of Heaven\u0027s Gate believed that their souls needed to leave their bodies to reach the next level and that suicide was the means to achieve this. The deaths of the cult members can be seen as both suicides and murders, as some members may have been peer pressured into taking drastic steps. The episode raises questions about the power of belief and the human capacity to make extreme choices.",
      "release": "2024-09-09T23:22:34Z",
      "duration": "00:13:54.8500000",
      "explicit": true,
      "spotifyId": "5JZbDzmUZyKezkdG5SWwG0",
      "appleId": 1000668949066,
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5JZbDzmUZyKezkdG5SWwG0",
        "apple": "https://podcasts.apple.com/podcast/heavens-gate-part-4/id1744718182?i=1000668949066"
      }
    },
    {
      "id": "b6160798-8484-42a1-b0cf-99d9e074c9d2",
      "title": "Heaven\u0027s Gate Part 3",
      "description": "Summary\n\n\n\n\n\n\n\n\nThis episode of How Did We Get Here explores the topic of cults, specifically focusing on the members of Heaven\u0027s Gate. The host discusses the types of people who join cults, including those who are well-educated, have time and money, and lack a solid religious background. The episode highlights some notable members of Heaven\u0027s Gate, such as Steven McCarter, Gail Mader, and Sawyer. It delves into the intense decision to join the cult and the complete upheaval of members\u0027 lives. The episode also explores the regimented lifestyle, celibacy, and self-renunciation practiced by the members. \n\n\n\n\n\n\n\n\nKeywords\n\n\n\n\n\n\n\n\ncults, Heaven\u0027s Gate, members, types of people, well-educated, time, money, religious background, Sawyer, decision to join, upheaval, lifestyle, celibacy, self-renunciation, suicide, finding yourself, finding god, true crime",
      "release": "2024-08-12T02:17:21Z",
      "duration": "00:13:56",
      "explicit": false,
      "spotifyId": "7vH05bV5ezV08BQX8sAAtt",
      "appleId": 1000664987540,
      "youTubeId": "379Rr1STi8o",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vH05bV5ezV08BQX8sAAtt",
        "apple": "https://podcasts.apple.com/podcast/heavens-gate-part-3/id1744718182?i=1000664987540",
        "youtube": "https://www.youtube.com/watch?v=379Rr1STi8o"
      }
    },
    {
      "id": "d5a14312-8f45-4504-8cca-f5bf5f7e3898",
      "title": "Heaven\u0027s Gate Part 2",
      "description": "Summary\n\n\n\n\n\n\n\n\nIn this episode, Emily O\u0027Brien explores the beliefs and teachings of the Heaven\u0027s Gate cult, led by Marshall Applewhite and Bonnie Nettles. The cult believed in the existence of extraterrestrial beings and the opportunity for humans to ascend to a higher level of existence. They followed a strict set of rules and behaviors, and their ultimate goal was to leave their human bodies behind and join the Kingdom of Heaven. The episode discusses the origins of the cult, their recruitment methods, and the shared delusions that characterized their belief system.\n\n\n\n\n\n\n\n\nKeywords\n\n\n\n\n\n\n\n\nHeaven\u0027s Gate, cult, Marshall Applewhite, Bonnie Nettles, beliefs, teachings, extraterrestrial beings, ascension, Kingdom of Heaven, rules, behaviors, recruitment, shared delusions\n\n\n\n\n\n\n\n\nKeywords\n\n\n\n\n\n\n\n\nHeaven\u0027s Gate, cult, Marshall Applewhite, Bonnie Nettles, beliefs, teachings, extraterrestrial beings, ascension, Kingdom of Heaven, rules, behaviors, recruitment, shared delusions",
      "release": "2024-08-02T12:18:24Z",
      "duration": "00:19:55",
      "explicit": false,
      "spotifyId": "4YHI5lA43bPe5UGjBdvruS",
      "appleId": 1000664130618,
      "youTubeId": "iu0BFbGtRGQ",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YHI5lA43bPe5UGjBdvruS",
        "apple": "https://podcasts.apple.com/podcast/heavens-gate-part-2/id1744718182?i=1000664130618",
        "youtube": "https://www.youtube.com/watch?v=iu0BFbGtRGQ"
      }
    },
    {
      "id": "a987ffd7-3c75-40df-bd5e-e921b5dc98fa",
      "title": "Heaven\u0027s Gate Part 1",
      "description": "Summary This episode explores the beliefs and actions of the Heaven\u0027s Gate cult, led by Marshall Applewhite and Bonnie Lou Nettles. The cult believed that planet Earth was about to be recycled and that their only chance for survival was to evacuate with the cult. The conversation delves into the background of the leaders. The podcast host also discusses the allure of cults and explores other infamous cults throughout history. Keywords: Heaven\u0027s Gate, cult, Marshall Applewhite, Bonnie Lou Nettles, beliefs, evacuation, survival, allure, infamous cults, true crime, cults, UFO, aliens",
      "release": "2024-07-26T10:42:26Z",
      "duration": "00:10:44.8410000",
      "explicit": false,
      "spotifyId": "4aKGGT6R4wRKmNEjqpVMGW",
      "appleId": 1000663422819,
      "youTubeId": "onWHaTkz_1Y",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4aKGGT6R4wRKmNEjqpVMGW",
        "apple": "https://podcasts.apple.com/podcast/heavens-gate-part-1/id1744718182?i=1000663422819",
        "youtube": "https://www.youtube.com/watch?v=onWHaTkz_1Y"
      }
    },
    {
      "id": "cb89e501-90fd-4f32-8376-cdef0aaa38eb",
      "title": "Cult Leader Psyche - Personality Disorders",
      "description": "SummaryIn this episode, Emily O\u0027Brien explores personality disorders and how they pertain to cult leaders. She discusses the three clusters of personality disorders: odd and eccentric, dramatic and erratic, and anxious and inhibitive. Emily provides an overview of each disorder within these clusters and highlights examples of cult leaders who may exhibit these traits. Understanding the psychology of cult leaders can help identify red flags and prevent individuals from getting involved in harmful groups.\n\n\n\nKeywords: personality disorders, clusters, cult leaders, red flags, psychology, borderline, paranoid, narcissistic, narcissist, true crime, cults, depression, psychotic, schizoid, jim jones",
      "release": "2024-07-20T17:34:23Z",
      "duration": "00:13:20",
      "explicit": false,
      "spotifyId": "4Xw4REUfqBbX7Wg1hjsEEd",
      "appleId": 1000662832466,
      "youTubeId": "Y3YbtCFp1j4",
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Xw4REUfqBbX7Wg1hjsEEd",
        "apple": "https://podcasts.apple.com/podcast/cult-leader-psyche-personality-disorders/id1744718182?i=1000662832466",
        "youtube": "https://www.youtube.com/watch?v=Y3YbtCFp1j4"
      }
    },
    {
      "id": "acab6537-a54b-4713-92ed-93e966e003e9",
      "title": "The Children of Thunder",
      "description": "SummaryThe podcast explores the chilling and tragic tale of the Children of Thunder, a cult that terrorized California in the late 1990s. The story begins with Glenn Heltzer, the cult\u0027s charismatic yet troubled leader, and his descent into extreme religious delusions. The cult\u0027s beliefs and principles are outlined, including the concept of blood atonement. The cult\u0027s activities took a deadly turn when they murdered several individuals, including Selena Bishop and her mother. The cult members were eventually arrested and received harsh sentences. The story serves as a reminder of the dangers of unchecked mental illness and charismatic leaders.\n\nKeywords: Children of Thunder, cult, California, Glenn Heltzer, religious delusions, murder, blood atonement, mental illness, charismatic leaders, cults, true crime",
      "release": "2024-07-14T23:41:40Z",
      "duration": "00:09:35",
      "explicit": false,
      "spotifyId": "1dG53hgSMPrRpMVDj3Qt0b",
      "appleId": 1000662233309,
      "youTubeId": "1gXMxZgaMns",
      "subjects": [
        "Glen Helzer"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dG53hgSMPrRpMVDj3Qt0b",
        "apple": "https://podcasts.apple.com/podcast/the-children-of-thunder/id1744718182?i=1000662233309",
        "youtube": "https://www.youtube.com/watch?v=1gXMxZgaMns"
      }
    },
    {
      "id": "018ce9d6-a1ff-400a-a248-573038b8dfed",
      "title": "FLDS",
      "description": "Summary\n\n\n\nThis episode explores the Fundamentalist Church of Jesus Christ of Latter-day Saints (FLDS) and the challenges faced by its members in leaving the cult. It discusses the history of the FLDS, the control exerted by its leaders, and the beliefs and practices that made it difficult for members to leave. The episode also highlights the stories of women who escaped the cult and the psychological tactics used by cult leaders to maintain control. The host provides tips on how to support someone who may be in a cult and emphasizes the importance of empathy and building trust.\n\n\n\nKeywords\n\n\n\nFLDS, cults, leaving a cult, Warren Jeffs, control, beliefs, practices, psychological tactics, support, empathy",
      "release": "2024-07-05T13:00:00Z",
      "duration": "00:15:17",
      "explicit": false,
      "spotifyId": "2QTUCpen60S4bsZvHH64Rx",
      "appleId": 1000661243305,
      "youTubeId": "sT4Uj9WdfSo",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QTUCpen60S4bsZvHH64Rx",
        "apple": "https://podcasts.apple.com/podcast/flds/id1744718182?i=1000661243305",
        "youtube": "https://www.youtube.com/watch?v=sT4Uj9WdfSo"
      }
    }
  ]
}