{
  "id": "02ddf52b-29ef-4158-96c6-30f4fd3b88c1",
  "name": "How to Recover",
  "spotifyId": "1adx3095hkQD1VPAAEF6sZ",
  "appleId": 1847036131,
  "episodes": [
    {
      "id": "06a400ac-ee04-44c4-bf6a-d44c65084fd8",
      "title": "How to Recover from a Sex Cult with guest Ruwan Meepagala hosted by Zoe Clews and Hattie Moll",
      "description": "Ruwan Meepagala joins Zoe and Hattie to discuss his experiences of entering and exiting Nicole Daedone\u0027s wellness organisation turned high control sex cult, One Taste. The podcast is released on the eve of her sentencing for being found guilty of using abuse and deception to obtain labour and services from her victims. We pull apart the customs and behaviours of One Taste including some rather explicit and funny chat about what the men got out of all that clitoral stimulation. And we discuss how cults entice and hold members until they inevitably fall apart. In the case of One Taste, the huge rise and dramatic fall of the cult that put feminine pleasure at the heart of its belief system, has been well documented with a special you can watch on Netflix. Ruwan gives us the guy\u0027s perspective and explains the childhood and adolescence that set him up to find an alternative way to live. We also discuss the ways One Taste gave Ruwan a chance to heal old wounds and the very obvious fact that cults offer benefits as well as trauma otherwise they wouldn\u0027t be so damn persistent. Ruwan is an established men\u0027s coach and therapist and we talk about the new(ish) cults spearheaded by Andrew Tate and the red pill, black pill worlds of online masculine. Hattie talks about her experience of the influence of it all on her two teenage sons and the fact it is all just another way for people to make a quick buck off our kids. Zoe brings her decades of experience as a hypnotherapist to explain how the techniques of NLP and hypnotism are used by cults to inculcate their members and Ruwan describes his personal experiences of this. To buy Ruwan\u0027s book Orgsm and learn more about his coaching visit his website https://ruwando.com/ To contact the podcast, email or send a voice note to: info@howtorecover.co.uk To book an appointment with Zoe Clews or any of her team email: info@zoeclews.co.uk To complain about the dodgy editing of the podcast, do not message Hattie at: hattie@harrietmoll.com The podcast is produced and directed by Zoe and Hattie with no adult supervision. We make reference to NXIVM another cult with a great documentary series called The Vow should you wish to go further down the cult rabbit hole.",
      "release": "2025-10-28T21:57:08Z",
      "duration": "01:14:43.7260000",
      "explicit": true,
      "spotifyId": "4VVafCWpy3OtNN4aYa1nQX",
      "appleId": 1000733936152,
      "subjects": [
        "Onetaste",
        "NXIVM",
        "Cult Psychology",
        "Hustler\u0027s University",
        "Self-Help",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VVafCWpy3OtNN4aYa1nQX",
        "apple": "https://podcasts.apple.com/podcast/how-to-recover-from-a-sex-cult-with-guest/id1847036131?i=1000733936152"
      }
    }
  ]
}