{
  "id": "394570ca-8ffd-4ea0-85c7-83d049f5e77f",
  "name": "How We Get Thru Podcast",
  "spotifyId": "4PQw5SlSltVaqH9Kd6bHVZ",
  "appleId": 1685931154,
  "episodes": [
    {
      "id": "ead75292-ccb6-46d6-bc4b-3ad6196e8e18",
      "title": "The Impacts of Religious Trauma and IVF with Quincee Gideon, PsyD.",
      "description": "What does religious trauma and IVF have in common? Well in this episode you\u0027re about to find out. Dr. Quincee Gideon, she is a licensed psychologist who specializes in religious trauma and cult recovery, with us. But, she\u0027s not just any expert – she\u0027s on a personal quest of her own. Quincee\u0027s about to share her unique journey of shedding even more layers of religious trauma as she unravels it from her IVF journey.From the basics of religious trauma to the painful undercurrent of \u0022god\u0027s timing\u0022 when it comes to trying to conceive, we\u0027re diving deep into these experiences. Join us in this candid conversation as we explore the intersection of faith, trauma, and fertility.You’re listening to the how we get thru podcast, a place for you to feel connected thru deep and meaningful conversations. I\u0027m your host Jen, a licensed therapist and founder and CEO of the how we get thru app. My mission is to bring affordable \u002B diverse therapy resources to help you get thru the hard stuff—all in one place, at your own pace. Welcome to the How We Get Thru community. Resources:A Year of Non-Magical Thinking: https://www.traumastery.com/yonmtTraumastry: https://www.traumastery.com/Fertility Support Groups: PSI: https://www.postpartum.net/get-help/psi-online-support-meetings/#fertility-challengesUniquely Knitted: https://uniquelyknitted.org/process-groups/",
      "release": "2023-10-31T00:00:00",
      "duration": "01:04:59.8200000",
      "explicit": false,
      "spotifyId": "3zvaBuKy6LhSjs7OuCBYie",
      "appleId": 1000633208852,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zvaBuKy6LhSjs7OuCBYie",
        "apple": "https://podcasts.apple.com/podcast/the-impacts-of-religious-trauma-and-ivf/id1685931154?i=1000633208852"
      }
    }
  ]
}