{
  "_ts": 0,
  "id": "9be820e2-fac4-4366-a36c-216caba2bbad",
  "name": "How To Leave A Cult",
  "spotifyId": "1wFepHSUrPZfnfRFalNd6j",
  "appleId": 1723601274,
  "youTubeChannelId": "UCHDfEL6hgO1rS4X3W_My76w",
  "youTubePlaylistId": "PLPk9OlDPA-Z5JeRgII5OClicyCVAcbXvy",
  "episodes": [
    {
      "id": "f801d870-d947-4ffb-b2e7-251f96661433",
      "title": "Echoes of Waco: Rumors, Threats, and Protective Measures in Cult Communities",
      "description": "Send us a Text Message. In this riveting episode of \u0022HOW TO LEAVE A CULT,\u0022 we delve into the far-reaching consequences of the Waco Texas Cult Branch Davidians massacre, how it sparked rumors about our church and cult, and the failures of the sheriff\u0027s department in providing protection. Join us as we uncover the challenges of dealing with threats, combating rumors of devil worship, and the necessity of hiring bodyguards for safety within cult communities. Gain valuable insights into the impact of external events on cult dynamics, the tactics used to maintain control amidst adversity, and the resilience of survivors navigating these turbulent times. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-05-29T09:00:00Z",
      "duration": "00:25:47.5720000",
      "explicit": false,
      "spotifyId": "6JatKHmdSEtO1B0ZMXj3c5",
      "appleId": 1000657146475,
      "youTubeId": "5lq_N1_bg0w",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6JatKHmdSEtO1B0ZMXj3c5",
        "apple": "https://podcasts.apple.com/podcast/echoes-of-waco-rumors-threats-and-protective-measures/id1723601274?i=1000657146475",
        "youtube": "https://www.youtube.com/watch?v=5lq_N1_bg0w"
      }
    },
    {
      "id": "22b82f12-f8dc-4257-98c5-1353402d9b0b",
      "title": "Forced Friendships, Pot Fallout, and Learning to Lie: Navigating Cult Dynamics",
      "description": "Send us a Text Message. In this gripping episode of \u0022HOW TO LEAVE A CULT,\u0022 we unravel the complex web of forced friendships, the aftermath of getting caught using pot, and the art of deception learned within cults. Join us as we delve into the pressures of maintaining artificial relationships, the repercussions of rebellious behavior like cannabis use, and the survival strategies that often involve bending the truth. Gain valuable insights into the psychological impact of these experiences and discover how survivors navigate authenticity and trust after leaving a cult. Support the Show. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-05-23T01:00:00Z",
      "duration": "00:22:43.1210000",
      "explicit": false,
      "spotifyId": "7FQ4HrAqaeW2bODN4vBSzB",
      "appleId": 1000656458301,
      "youTubeId": "AqkFtv06dus",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7FQ4HrAqaeW2bODN4vBSzB",
        "apple": "https://podcasts.apple.com/podcast/forced-friendships-pot-fallout-and-learning-to-lie/id1723601274?i=1000656458301",
        "youtube": "https://www.youtube.com/watch?v=AqkFtv06dus"
      }
    },
    {
      "id": "bebd6536-eb3e-437a-85a5-aa31d1384a90",
      "title": "From Junior High to Cult \u0022Service\u0022: My Journey through Rumors and Legal Realities",
      "description": "In this episode of \u0022How To Leave A Cult,\u0022 I share my personal journey of being ripped out of junior high to serve in the church, the rumors that swirled around the cult and its activities, and my experience working in the law office. Join me as I unveil the truth behind these experiences, offering insights into the inner workings of cults, the impact of rumors on perception, and the challenges of reintegration into society. Tune in for a candid and introspective discussion on resilience, truth, and the complexities of living in a cult. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-04-20T15:00:00Z",
      "duration": "00:33:52.7700000",
      "explicit": false,
      "spotifyId": "5jO7hzhHL7qvrEUdWmVUbJ",
      "appleId": 1000653062817,
      "youTubeId": "bmewji96lEY",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jO7hzhHL7qvrEUdWmVUbJ",
        "apple": "https://podcasts.apple.com/podcast/from-junior-high-to-cult-service-my-journey-through/id1723601274?i=1000653062817",
        "youtube": "https://www.youtube.com/watch?v=bmewji96lEY"
      }
    },
    {
      "id": "4c3ad83c-bc50-4be8-8885-17a3126ec603",
      "title": "School, Sexual Promiscuity, Religious Purity, and Relationships in Light of Church Expectations",
      "description": "In this episode of \u0022HOW TO LEAVE A CULT,\u0022 we delve into the complex dynamics of balancing societal norms with religious teachings. Join us as we discuss the challenges faced by church member when navigating the expectations of education versus spiritual devotion, the conflicts between sexual freedom and religious purity, and the impact of church expectations on relationships. Gain insights, strategies, and personal story of how life was at the ages of 12-13 in the Church of Immortal Consciousness while I shed light on these intricate intersections of belief systems and trying to grow. Healing Resource: Practice Gratitude - listen to learn more. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-03-26T21:00:00Z",
      "duration": "00:32:10.1610000",
      "explicit": false,
      "spotifyId": "30EUwonU6EEEY8Uchr5YGq",
      "appleId": 1000650538450,
      "youTubeId": "IXcgx0HdX1Q",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/30EUwonU6EEEY8Uchr5YGq",
        "apple": "https://podcasts.apple.com/podcast/school-sexual-promiscuity-religious-purity-and/id1723601274?i=1000650538450",
        "youtube": "https://www.youtube.com/watch?v=IXcgx0HdX1Q"
      }
    },
    {
      "id": "9ff3ad19-735f-48d9-860e-76be16f260c7",
      "title": "Absolute Chaos",
      "description": "Welcome to \u0027HOW TO LEAVE A CULT,\u0027 where we navigate the challenging path of breaking free from manipulative systems. In this episode, we delve into a lesser-known aspect of cult dynamics—using utter chaos as a method to keep members too busy and in fear. Through personal reflections, we unveil the tactics cults employ to create a constant state of turmoil and uncertainty. I share stories the consistent fear and chaos of no safe or calm, shedding light on the psychological impact of living in a chaotic environment. Which leads to emotionally declining health, which leads to physically declining health. Join me as I also share how reading and education can bring light to the darkness and create new levels of healing. Through shared experiences and compassionate guidance, we empower survivors and allies to navigate the path towards healing and freedom. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-03-20T20:00:00Z",
      "duration": "00:31:38.7360000",
      "explicit": false,
      "spotifyId": "7BvryyYP8Dcih76V9NqlaA",
      "appleId": 1000649913764,
      "youTubeId": "_fFRYN0CKkE",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7BvryyYP8Dcih76V9NqlaA",
        "apple": "https://podcasts.apple.com/podcast/absolute-chaos/id1723601274?i=1000649913764",
        "youtube": "https://www.youtube.com/watch?v=_fFRYN0CKkE"
      }
    },
    {
      "id": "23e9e4ee-a0c9-4dbf-8551-72377711d3ce",
      "title": "Beyond the Cult: Navigating Relationships After Leaving",
      "description": "Join us in this episode of \u0022How to Leave a Cult\u0022 as we delve into the complexities of rebuilding relationships post-cult departure. Whether you\u0027ve sought therapy, hired a coach, or embarked on a journey of self-discovery, navigating interpersonal connections can be daunting. We explore strategies, insights, and personal stories to guide you through this transformative process. Tune in to discover how to cultivate healthy relationships and reclaim your sense of belonging after leaving a cult. Support the show The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-03-12T21:00:00Z",
      "duration": "00:25:24.5320000",
      "explicit": false,
      "spotifyId": "6Wak7jq4Tm3SFz5hAvOSD0",
      "appleId": 1000648970340,
      "youTubeId": "xjEmXN4mzIs",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Wak7jq4Tm3SFz5hAvOSD0",
        "apple": "https://podcasts.apple.com/podcast/beyond-the-cult-navigating-relationships-after-leaving/id1723601274?i=1000648970340",
        "youtube": "https://www.youtube.com/watch?v=xjEmXN4mzIs"
      }
    },
    {
      "id": "616d21bf-9505-42ae-81f9-9382cb79a066",
      "title": "Cult Redefines Sibling Relationships and other WTF",
      "description": "In this episode of How To Leave A Cult; the first of the lawsuits I was made aware of. The cult moves cities and siblings get redefined and my parents were able to have their hearts eased. Mom got the day off work! Forgiveness, why it is so important in the healing process and how to do it. You have to start with the small things. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-02-27T01:00:00Z",
      "duration": "00:41:28.5550000",
      "explicit": false,
      "spotifyId": "4xWOzjXlCDE7Kejsc2jPER",
      "appleId": 1000647169996,
      "youTubeId": "__I35fEsmoU",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xWOzjXlCDE7Kejsc2jPER",
        "apple": "https://podcasts.apple.com/podcast/cult-redefines-sibling-relationships-and-other-wtf/id1723601274?i=1000647169996",
        "youtube": "https://www.youtube.com/watch?v=__I35fEsmoU"
      }
    },
    {
      "id": "c589d5eb-19eb-4e6a-a4b8-6fb092845fdf",
      "title": "Gaslighting and Spiritual Hierarchy",
      "description": "Cults and some churches often lead you to believe that there is not a hierarchy, but it\u0027s a lie. They also gaslight you and encourage you stay obedient. If you can ask questions and get answers it might not be this toxic environment. If you can\u0027t, you might be in a cult. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-02-20T01:00:00Z",
      "duration": "00:29:42.3860000",
      "explicit": false,
      "spotifyId": "5KZMpBqcJeGFocD4TGKfAL",
      "appleId": 1000645937194,
      "youTubeId": "Lci3G4zHJzk",
      "subjects": [
        "Church of Immortal Consciousness",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KZMpBqcJeGFocD4TGKfAL",
        "apple": "https://podcasts.apple.com/podcast/gaslighting-and-spiritual-hierarchy/id1723601274?i=1000645937194",
        "youtube": "https://www.youtube.com/watch?v=Lci3G4zHJzk"
      }
    },
    {
      "id": "40ee80a8-ad56-453d-8865-30d64b2a87cc",
      "title": "Speaking to the dead, and cruel practices toward the living.",
      "description": "There were several practices that were part of the church that we had to actively participate in. Let\u0027s break them down and explain how they all worked. Dive into this episode to learn what trance or channeling was like. Specifically how Trina spoke a dead spirit. The process was a meeting with the ministers of the church where there was a free for all to obliterate people and say the unthinkable. Finally bhajans was a practice taken from Hindi traditions. Let\u0027s get weird. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-02-10T22:00:00Z",
      "duration": "00:32:55.6400000",
      "explicit": false,
      "spotifyId": "3UwB9UhWeHb2Yd4AWWXZZr",
      "appleId": 1000644892019,
      "youTubeId": "-IG2CEJvcVA",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3UwB9UhWeHb2Yd4AWWXZZr",
        "apple": "https://podcasts.apple.com/podcast/speaking-to-the-dead-and-cruel-practices-toward-the-living/id1723601274?i=1000644892019",
        "youtube": "https://www.youtube.com/watch?v=-IG2CEJvcVA"
      }
    },
    {
      "id": "0f8c5830-3eff-44f8-9d82-faa79476e523",
      "title": "Baby Elephants",
      "description": "If you have ever seen an adult elephant they may have a shackle on that is chained to a post and with a slight tug they could easily break free. Then why do they remain chained to a post. They are strong majestic beasts. For the same reason you are still being undervalued in your life. You are strong and majestic, but you don\u0027t see this strength. Dive into this weeks episode to learn how to break free. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-01-22T10:00:00Z",
      "duration": "00:27:18.6350000",
      "explicit": false,
      "spotifyId": "5OAshJT9W8d1hm16PJFE9X",
      "appleId": 1000642473990,
      "youTubeId": "OGycg4SoB28",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5OAshJT9W8d1hm16PJFE9X",
        "apple": "https://podcasts.apple.com/podcast/baby-elephants/id1723601274?i=1000642473990",
        "youtube": "https://www.youtube.com/watch?v=OGycg4SoB28"
      }
    },
    {
      "id": "f0d562ce-bd3f-4c9f-912b-3a430541e7cc",
      "title": "Family Secrets",
      "description": "In this weeks episode I share a huge family secret! In this episode learn about a family secret and the way it unfolded. Then learn how family dynamics began to be rewritten and redefined. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-01-12T22:00:00Z",
      "duration": "00:27:37.3910000",
      "explicit": false,
      "spotifyId": "4ZbM5OEBoUxIvhkjyNa0Ij",
      "appleId": 1000641486431,
      "youTubeId": "6PNPYBPiaK4",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ZbM5OEBoUxIvhkjyNa0Ij",
        "apple": "https://podcasts.apple.com/podcast/family-secrets/id1723601274?i=1000641486431",
        "youtube": "https://www.youtube.com/watch?v=6PNPYBPiaK4"
      }
    },
    {
      "id": "da1ab20e-18ef-40ac-b7b7-131a95cce66f",
      "title": "The Cult Habitat",
      "description": "The Story: As I begin to adjust to life in the church, it is every part of our life. Our home, school, neighbors and friends are all the same surroundings. We lived collectively both physically and financially. Each member is considered family and we have to treat everyone as such. (Which included giving free labor of whatever skill you had to the other members). How we began to get indoctrinated in the school and turned against our parents. Healing Technique: Mirror Work The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-01-01T15:00:00Z",
      "duration": "00:30:20.9170000",
      "explicit": false,
      "spotifyId": "4J3glRqTQRRoP3SpVeGgXn",
      "appleId": 1000640238855,
      "youTubeId": "14D5oY4K1F4",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4J3glRqTQRRoP3SpVeGgXn",
        "apple": "https://podcasts.apple.com/podcast/the-cult-habitat/id1723601274?i=1000640238855",
        "youtube": "https://www.youtube.com/watch?v=14D5oY4K1F4"
      }
    },
    {
      "id": "f9bff15e-6461-4c21-b0f5-a94365036e3d",
      "title": "Moving to the Cult",
      "description": "Story: In September of 1986 my family drove across the US from Rockville, Maryland to Mesa, Arizona to join the Church of Immortal Consciousness. From the very beginning there was huge changes in my life. Communal living, hierarchy and many weird changes to the way life had been. Healing Technique: Learn how to do diaphragmatic breathing. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2024-01-01T09:00:00Z",
      "duration": "00:37:27.8880000",
      "explicit": false,
      "spotifyId": "4W72OAbK0eTxedrZkFffyd",
      "appleId": 1000640219542,
      "youTubeId": "v9_2usSANfo",
      "subjects": [
        "Church of Immortal Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4W72OAbK0eTxedrZkFffyd",
        "apple": "https://podcasts.apple.com/podcast/moving-to-the-cult/id1723601274?i=1000640219542",
        "youtube": "https://www.youtube.com/watch?v=v9_2usSANfo"
      }
    },
    {
      "id": "d4038389-e040-4a16-93a1-6850cf341294",
      "title": "Intro - How To Leave A Cult",
      "description": "Welcome to HOW TO LEAVE A CULT. This is our fabulous intro! I want to share why I am creating this podcast as well as what you can expect from future episodes. I want to create a community where people who have been abused by cults or religious groups can learn and heal. I will be sharing my very personal story of being raised in a religious cult for nearly 30 years. I will also be sharing how I have healed and how you can too. You can move past the past. You deserve to not carry that kind of baggage anymore. My story will share manipulation, gaslighting, alcoholism, as well as a cult run charter school, massive lawsuits, cult experts, arranged marriage and so much more. The perspectives shared on HOW TO LEAVE A CULT are personal and do not necessarily represent the official stance of the podcast. The opinions of our guests, sponsors, or authors are their own and should not be interpreted as an endorsement or condemnation. This podcast is a platform for diverse voices, and the content is not intended to disparage any religion, group, organization, or individual. Remember, it\u0027s okay to have different views, but let\u0027s keep it respectful. Nobody\u0027s upset with you; just remember, let\u0027s avoid any culty shenanigans. Find us here: Facebook: https://www.facebook.com/howtoleaveacult YouTube: https://www.youtube.com/@brookewalker9118 Instagram: https://www.instagram.com/how_to_leave_a_cult",
      "release": "2023-12-30T13:00:00Z",
      "duration": "00:14:10.2850000",
      "explicit": false,
      "spotifyId": "4H2yGgdYkId1GARyRZpVyb",
      "appleId": 1000640089274,
      "youTubeId": "IPBu0VRwtVk",
      "subjects": [
        "Church of Immortal Consciousness",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4H2yGgdYkId1GARyRZpVyb",
        "apple": "https://podcasts.apple.com/podcast/intro-how-to-leave-a-cult/id1723601274?i=1000640089274",
        "youtube": "https://www.youtube.com/watch?v=IPBu0VRwtVk"
      }
    }
  ]
}