{
  "_ts": 0,
  "id": "a9128549-cfee-4c88-8d84-0f3adcde6583",
  "name": "Humanism Now",
  "spotifyId": "4ZL6qAJRIzTieiY8rUVH5G",
  "appleId": 1707753752,
  "episodes": [
    {
      "id": "29f8a6b3-b717-4469-8b85-ba0c7779dac5",
      "title": "37. Rachael Reign on Coercive Control Beyond the Home: Protecting Cult Survivors",
      "description": "“Surviving isn’t just about leaving — it’s about learning to trust yourself again after someone else’s voice has lived in your head for years.” — Rachael Reign In this powerful episode of Humanism Now, Rachael Reign, survivor and founder of Surviving Universal UK, shares her deeply personal story of escaping spiritual abuse and coercive control and her ongoing campaign to protect others. As founder of Surviving Universal UK, Rachael supports other survivors of high-control groups and leads a growing campaign to amend Section 76 of the UK Serious Crime Act. In this episode Rachael\u0027s journey into, and out of, UCKG What draws vulnerable young people into high-control groups How unpaid labour and spiritual obedience become normalised What led Rachael to walk away and how she supports other survivors The warning signs of cultic or coercively controlling groups Where UK law falls short in protecting against coercive control outside domestic settings How we can hold abusive systems accountable The role the public and policymakers can play in driving survivor-led legal reform Surviving Universal UK \u0026#x1f517; Surviving Universal UK \u0026#x1f4e7; info@survivinguniversaluk.org \u0026#x1f4f8; @survivinguniversaluk \u0026#x1f3b5; @survivinguniversaluk Contact Rachael \u0026#x1f333; linktr.ee \u0026#x1f3a4;Speaker bookings - Rachael Reign \u0026#x1f4f8; @Msrachaelreign Resources BBC Panorama The Guardian The Londoner Need support? If you or someone you know has been affected by the topics discussed in this episode, Faith to Faithless are here to help. Faith to Faithless Helpline (UK): 0800 448 074 Send us a text Support the show Support us on Patreon Advertising opportunities Click here to submit questions, nominate guest \u0026 topics. Follow Humanism Now @HumanismNowPod YouTube Instagram TikTok X BlueSky Threads This Podcast is produced by Humanise Live. Humanise Live makes podcasting easy for charities and social causes. Contact us to get starting in podcasting today at www.humanise.live or hello@humanise.live",
      "release": "2025-06-22T07:00:00Z",
      "duration": "00:49:19.5680000",
      "explicit": false,
      "spotifyId": "4zUft9aRBRwUJWg6YOmNBs",
      "appleId": 1000714026889,
      "subjects": [
        "Universal Church Of The Kingdom Of God",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4zUft9aRBRwUJWg6YOmNBs",
        "apple": "https://podcasts.apple.com/podcast/37-rachael-reign-on-coercive-control-beyond-the-home/id1707753752?i=1000714026889"
      }
    },
    {
      "id": "b2a15c9e-32f2-4de0-a8aa-6b2e20005ed3",
      "title": "29. Faith to Faithless on Finding Community after Leaving High-Control Groups (part of Podcastathon 2025)",
      "description": "This special episode of Humanism Now is released as part of Podcastathon 2025, the world’s largest podcast charity initiative. We’re proud to dedicate this episode to Faith to Faithless, a programme by Humanists UK supporting those leaving high-control religious groups. Three incredible guests—George, Leena, and Sarah—share raw, courageous accounts of their journeys out of fundamentalist religions and the new communities they\u0027re helping to build. Faith to Faithless is proudly marking its 10th anniversary in 2025, celebrating a decade of support, solidarity, and advocacy for apostates. ⭐ Episode Highlights Life inside high-control religious groups The emotional toll of shunning and \u0022thought crimes\u0022 How Faith to Faithless supports apostates across the UK Starting new peer groups and reclaiming lost experiences Why public services and mental health professionals must understand apostasy better \u0026#x1f4fa; Introducing Faith to Faithless | Helping people leaving high-control religious groups (2 mins) Need support? If you or someone you know has been affected by the topics discussed in this episode, Faith to Faithless are here to help. Faith to Faithless Helpline (UK): 0800 448 0748 \u0026#x1f4de;Opening hours (Wed 10am–1pm, Thu 4pm–7pm, Fri 8am–11am) \u0026#x1f4e7; Email: helpline@faithtofaithless.com \u0026#x1f310; More info: www.faithtofaithless.com ******** Also mentioned in this episode: Recovering from Religion offers peer and professional support offering hope, healing, and support to those struggling with issues of doubt and non-belief. Contact RFR here. ******** Podcastathon is the world’s largest podcast charity initiative — a global wave of inspiring episodes released simultaneously by podcasters everywhere, all in support of causes they care about. The aim? To raise awareness for hundreds of charities by uniting storytellers in one powerful, coordinated moment each March. \u0026#x1f3a7; Be part of the movement: podcasthon.org/register Send us a text Support the show Support us on Patreon Advertising opportunities Click here to submit questions, nominate guest \u0026 topics. Follow Humanism Now @HumanismNowPod YouTube Instagram TikTok X BlueSky Threads This Podcast is produced by Humanise Live. Humanise Live makes podcasting easy for charities and social causes. Contact us to get starting in podcasting today at www.humanise.live or hello@humanise.live",
      "release": "2025-03-30T08:00:00Z",
      "duration": "00:45:04.9530000",
      "explicit": false,
      "spotifyId": "0FE1jk1IAuAiW8BOPwQU49",
      "appleId": 1000701427893,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0FE1jk1IAuAiW8BOPwQU49",
        "apple": "https://podcasts.apple.com/podcast/29-faith-to-faithless-on-finding-community-after-leaving/id1707753752?i=1000701427893"
      }
    }
  ]
}