{
  "id": "7c5a2988-2ba6-4333-9bab-d42b5136fa53",
  "name": "Hypno Wellness",
  "spotifyId": "0G9fnvQVe7vtICsjz2NhSm",
  "appleId": 1667930259,
  "episodes": [
    {
      "id": "2e053dc4-a67c-4d8d-a202-049a440351d9",
      "title": "Breaking Free: Understanding Cults and Hypnosis",
      "description": "  Join Cindy Brainerd, a retired hygienist and certified hypnotherapist, as she delves into the intricate world of cult dynamics and the intriguing connections to hypnosis in her podcast, \u0022Breaking Free: Understanding Cults and Hypnosis.\u0022In this compelling series, Cindy unravels the mysterious influences and manipulative tactics employed by cults, offering insightful analysis and exploration into how hypnosis intertwines with these behaviors. In this episode, I also talk about the cults that have been on many documentaries lately, like the Twin Flames Academy. My mission in this episode is to empower her audience with knowledge, helping them recognize warning signs, navigate through undue influences, and foster mental resilience against manipulative forces.Whether you\u0027re seeking to comprehend the subtle influences of hypnosis in group dynamics or looking to fortify your mental defenses against cult-like behaviors, \u0022Breaking Free: Understanding Cults and Hypnosis\u0022 offers invaluable insights and guidance to reclaim autonomy and break free from undue influences.Tune in to this enlightening podcast series to unravel the complexities of cults, hypnosis, and the path to empowerment and mental freedom. Also, don\u0027t forget to check out my reimagined mirror exercise that companies this episode.   My Instagram https://www.instagram.com/hypnowellness1/ Podcast Network https://linktr.ee/theunfilteredpod?utm_source=linktree_profile_share",
      "release": "2023-12-13T16:42:54Z",
      "duration": "00:12:17.3490000",
      "explicit": false,
      "spotifyId": "65W9nVfR8ArAqOwwSPG2fI",
      "appleId": 1000638461343,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65W9nVfR8ArAqOwwSPG2fI",
        "apple": "https://podcasts.apple.com/podcast/breaking-free-understanding-cults-and-hypnosis/id1667930259?i=1000638461343"
      }
    }
  ]
}