{
  "_ts": 0,
  "id": "ad5aedd5-9172-464d-8e25-bef2062b7c4a",
  "name": "I Call Bullsh*t with Kristina Braly",
  "spotifyId": "4jccFcH9YUJh0m425uU1Va",
  "appleId": 1797359170,
  "youTubeChannelId": "UC1eL4LzgU3V_y_3lyHFc3YQ",
  "episodes": [
    {
      "id": "dd6f606a-2bc3-4a09-a0b1-9963100964a2",
      "title": "The MLM Cult You Didn’t Know You Were In",
      "description": "In this episode of I Call Bullsh*t, Kristina Braly exposes the Multi-Level Marketing (MLM) industry, a $35 billion empire built on false promises, manipulation, and financial ruin for most participants. These “business opportunities” masquerade as female empowerment, side hustles, or easy passive income, but the reality is only 1% of participants ever make a profit—and many go into serious debt instead. What Is an MLM? The key differences between MLMs and pyramid schemes (spoiler: they’re nearly identical). Why 99% of Participants Lose Money: FTC data on income disclosure statements proves these businesses are set up to fail. Manipulation Tactics: Love bombing, toxic positivity, shaming quitters, and weaponized female empowerment. MLM Horror Stories: People losing their homes, maxing out credit cards, and destroying friendships for the “dream.” The Cult-Like Mentality: Why MLMs mirror religious cults, and how they brainwash members into staying. Red Flags to Spot an MLM: From Facebook DMs to overpriced starter kits, how to recognize a scam before you get sucked in. Host: Kristina Braly Research \u0026 Fact-Checking: Kristina Braly LLC Production \u0026 Editing: Kristina M Braly, M.D. Music \u0026 Sound Design: Epidemic Sound, Kristina Braly LLC Special Thanks To: Riverside FM Federal Trade Commission (FTC). “Consumer Awareness on MLMs.” \u0026#x1f517; https://www.ftc.gov/news-events/press-releases/2023/02/mlm-income-disclosure-warning Jon M. Taylor, PhD. (2011). The Case (For and) Against Multi-Level Marketing. \u0026#x1f517; http://www.ftc.gov/sites/default/files/documents/public_comments/16-cfr-part-437-business-opportunity-rule-536058-00014%C2%A0/536058-00014-54741.pdf AARP Foundation. (2018). “AARP Study: The Truth About MLMs and Older Adults.” \u0026#x1f517; https://www.aarp.org/content/dam/aarp/research/surveys_statistics/econ/2018/mlm-schemes-older-adults.doi.10.26419-2Fres.00259.001.pdf Federal Trade Commission (FTC). “The 99% Failure Rate in MLMs.” \u0026#x1f517; https://www.ftc.gov/system/files/documents/reports/federal-trade-commission-staff-advisory-opinion-multi-level-marketing-compensation-plan/ftc_advisory_opinion_mlm.pdf Robert FitzPatrick. Ponzinomics: The Untold Story of Multi-Level Marketing. \u0026#x1f517; https://www.amazon.com/Ponzinomics-Untold-Story-Multi-Level-Marketing/dp/1734501605 The Dream Podcast (2018). Behind the MLM facade. \u0026#x1f517; https://podcasts.apple.com/us/podcast/the-dream/id1435743296 Cult Education Institute: “MLMs and Cult-Like Behavior.” \u0026#x1f517; https://culteducation.com/group/1260-multi-level-marketing.html Vice News. (2022). “I Lost $30,000 to an MLM—And I\u0027m Not Alone.” \u0026#x1f517; https://www.vice.com/en/article/7kbznd/mlm-pyramid-scheme-victims-stories New York Times. (2021). “When an MLM Takes Over Your Life.” \u0026#x1f517; https://www.nytimes.com/2021/06/08/style/multi-level-marketing-moms.html ✅ Recognize the Red Flags: If an opportunity requires you to buy a starter kit, recruit others, or promises ‘unlimited’ income, it’s likely an MLM scam. ✅ Spread Awareness: Send this episode to someone considering joining an MLM—it might save them thousands of dollars and years of regret. ✅ Report MLM Scams: If you\u0027ve been scammed by an MLM, file a complaint with the FTC at https://reportfraud.ftc.gov/ . ✅ Subscribe \u0026 Review: If this episode saved you from an MLM, leave a 5-star review and help others avoid the trap. \u0026#x1f4e9; Have an MLM horror story? DM us on Instagram @ICallBSPodcast or email contact@kristinabraly.com —we may feature your story in a future episode! \u0026#x1f399; Next Episode Teaser: Next week, we’re exposing the hidden fees secretly draining your wallet—from airline seat selection to credit card charges, you’re paying WAY more than you think. \u0026#x1f514; Subscribe \u0026 Follow so you don’t get ripped off again! #ICallBS #MLMScams #PyramidSchemes #BossBabeLies #AntiMLM What We Cover in This Episode:Credits:MLMs and Financial LossesMLM Failure Rates \u0026 Pyramid StructurePsychological Manipulation \u0026 MLM TacticsMLM Horror Stories \u0026 Real-Life ImpactListener Action Items:",
      "release": "2025-03-03T21:46:27Z",
      "duration": "00:25:54.6680000",
      "explicit": true,
      "spotifyId": "4Mv6Jssd3DHxyIFPnhLpfb",
      "appleId": 1000697494277,
      "youTubeId": "9zeSMblqwcI",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Mv6Jssd3DHxyIFPnhLpfb",
        "apple": "https://podcasts.apple.com/podcast/ep-004-the-mlm-cult-you-didnt-know-you-were-in/id1797359170?i=1000697494277",
        "youtube": "https://www.youtube.com/watch?v=9zeSMblqwcI"
      }
    }
  ]
}