{
  "_ts": 0,
  "id": "69e73d68-20bb-4c42-ab8b-700553bddb8c",
  "name": "I Don\u0027t Know Anything with Paige Harriman",
  "spotifyId": "3XYEr4LtzJpACd9TdBaQmQ",
  "appleId": 1709758926,
  "episodes": [
    {
      "id": "848270f2-d910-4cc9-98b2-053b13fd0183",
      "title": "37: Don\u0027t You Want to Become a Cult Leader? with Carey Burtt",
      "description": "So it looks like your girl became an accidental cult reporter! Many people are e-mailing, calling, and texting me with stories of their cult experiences and escapes. One potential interviewee mailed me a DVD with some interesting audio demonstrations, including one about how to become a cult leader. This TOTALLY BANANAS track shows how cult leaders manipulate, procure, and brainwash their followers. I hope you\u0027ll find it entertaining/educational! (I tracked down where this recording originated from – Mind Control Made Easy (or How to Become a Cult Leader), a film made by Cary Burtt (1999)! All rights reserved.)",
      "release": "2024-06-11T04:17:50Z",
      "duration": "00:12:44.4930000",
      "explicit": false,
      "spotifyId": "4LVw0FTFpFjbcyeyCmhAkH",
      "appleId": 1000658554181,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LVw0FTFpFjbcyeyCmhAkH",
        "apple": "https://podcasts.apple.com/podcast/37-dont-you-want-to-become-a-cult-leader-with-carey-burtt/id1709758926?i=1000658554181"
      }
    },
    {
      "id": "17483d4f-9535-4fa1-b6ef-5bd36d681a8f",
      "title": "35: Rising Up from the Ashes of the Children of God Cult – The Complete Series",
      "description": "Olivia Eden was born into the Children of God, a notorious cult led by treacherous leaders David Brandt Berg and Karen Elva Zerby (also known as “Mamma Maria”). Rising Up from the Ashes of the Children of God Cult, Fire Walk with Olivia Eden – The Complete Series combines all three acts of her story: the Escape, the Confrontation, and the Resolution. (Also, as a majority of my listeners have requested, the media clips have all been removed!)) (Just as a disclaimer, intellectual property from the Family International, including songs, television clips, and radio recordings, has been used in this episode under the Fair Use doctrine. Fair use is a doctrine in the United States copyright law that allows limited use of copyrighted material without requiring permission from the rights holders, such as for commentary, criticism, news reporting, research, teaching or scholarship.)",
      "release": "2024-06-09T23:11:19Z",
      "duration": "02:23:49.6810000",
      "explicit": false,
      "spotifyId": "5gEdnnVoQb21y55CrupWcU",
      "appleId": 1000658389005,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5gEdnnVoQb21y55CrupWcU",
        "apple": "https://podcasts.apple.com/podcast/35-rising-up-from-the-ashes-of-the-children/id1709758926?i=1000658389005"
      }
    },
    {
      "id": "4bcab6bc-9d1f-4c8c-91ce-2b69cbea6256",
      "title": "30: Rising Up from the Ashes of the Children of God Cult, Fire Walk with Olivia Eden – Act 3, The Resolution",
      "description": "Olivia Eden was born into the Children of God, a notorious cult led by treacherous leaders David Brandt Berg and Karen Elva Zerby (also known as “Mamma Maria”). Rising Up from the Ashes of the Children of God Cult, Fire Walk with Olivia Eden – The Complete Series combines all three acts of her story: the Escape, the Confrontation, and the Resolution. (Just as a disclaimer, intellectual property from the Family International, including songs, television clips, and radio recordings, has been used in this episode under the Fair Use doctrine. Fair use is a doctrine in the United States copyright law that allows limited use of copyrighted material without requiring permission from the rights holders, such as for commentary, criticism, news reporting, research, teaching or scholarship.)",
      "release": "2024-06-01T19:21:57Z",
      "duration": "02:23:49.6810000",
      "explicit": true,
      "spotifyId": "137sSB66wRW3Jm8tI2urtX",
      "appleId": 1000657521239,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/137sSB66wRW3Jm8tI2urtX",
        "apple": "https://podcasts.apple.com/podcast/30-rising-up-from-the-ashes-of-the-children-of/id1709758926?i=1000657521239"
      }
    },
    {
      "id": "6953a1f2-e27d-4d14-aa26-7f1d5bc7dba4",
      "title": "16: Rising Up from the Ashes of the Children of God Cult, Fire Walk with Olivia Eden – Act 2, The Confrontation",
      "description": "Olivia Eden was born into the Children of God, a notorious cult led by treacherous leaders David Brandt Berg and Karen Elva Zerby (also known as “Mamma Maria”). In the second act of this explosive three-part series, \u0022The Confrontation,\u0022 we learn about how the world experienced Olivia Eden. (Just as a disclaimer, intellectual property from the Family International, including songs, television clips, and radio recordings, has been used in this episode under the Fair Use doctrine. Fair use is a doctrine in the United States copyright law that allows limited use of copyrighted material without requiring permission from the rights holders, such as for commentary, criticism, news reporting, research, teaching or scholarship.)",
      "release": "2024-02-04T23:27:24Z",
      "duration": "00:55:14.3370000",
      "explicit": true,
      "spotifyId": "6Byy6DJfNylaZ4oSTdDTcD",
      "appleId": 1000644142344,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Byy6DJfNylaZ4oSTdDTcD",
        "apple": "https://podcasts.apple.com/podcast/16-rising-up-from-the-ashes-of-the-children-of/id1709758926?i=1000644142344"
      }
    },
    {
      "id": "864de766-1bf7-4dc4-bf21-1396a1eb0528",
      "title": "15: Rising Up from the Ashes of the Children of God Cult, Fire Walk with Olivia Eden – Act I, The Escape",
      "description": "Olivia Eden was born into the Children of God, a notorious cult led by treacherous leaders David Brandt Berg and Karen Elva Zerby (also known as “Mamma Maria”). In the first act of this explosive three-part series, she reflects on her highly unconventional childhood, where Christianity was mixed with sexual abuse and show tunes. (Just as a disclaimer, intellectual property from the Family International, including songs, television clips, and radio recordings, has been used in this episode under the Fair Use doctrine. Fair use is a doctrine in the United States copyright law that allows limited use of copyrighted material without requiring permission from the rights holders, such as for commentary, criticism, news reporting, research, teaching or scholarship.)",
      "release": "2024-01-29T23:49:47Z",
      "duration": "00:56:58.8270000",
      "explicit": true,
      "spotifyId": "1QFv1ZYHKIbNdHScHlj2px",
      "appleId": 1000643449932,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1QFv1ZYHKIbNdHScHlj2px",
        "apple": "https://podcasts.apple.com/podcast/15-rising-up-from-the-ashes-of-the-children-of/id1709758926?i=1000643449932"
      }
    }
  ]
}