{
  "id": "5d6fde8a-57f8-468f-9d35-0aac77d4d664",
  "name": "I Don’t Take Spiritual Advice from Men",
  "spotifyId": "1r3KegpGgaCqrnoQ6AywRj",
  "appleId": 1827696665,
  "episodes": [
    {
      "id": "4ec5e3a9-440a-456e-be67-5ed0da4912fe",
      "title": "Record #2: Cult #2, Mysore, India",
      "description": "CONTENT WARNING: This episode contains detailed, explicit accounts of sexual assault in a yoga context. In this episode, I tell the story of my first trip to Mysore, India to study with Sri K. Pattabhi Jois—the founder of Ashtanga yoga and a man revered by thousands of practitioners worldwide. What I witnessed in that shala wasn\u0027t hidden. It wasn\u0027t secret. It was normalized. Women were being sexually assaulted during \u0022adjustments\u0022 while dozens of students watched. And the most devastating part? Some of them called it healing. This is about what happens when you see abuse clearly and stay anyway. About how I convinced myself that confronting one man made me empowered, when really I\u0027d just learned how to function inside a violent system. About the decades that followed, and why it took decades to understand what I\u0027d actually done. This is Part Two of a longer project documenting the three high-control spiritual environments I\u0027ve been part of over thirty years. I\u0027m not here to reform these systems. I\u0027m here to document how they work. ABOUT MAGS: Clinical Ayurvedic Specialist, former certified Ashtanga teacher (one of only 20 women worldwide), and founder of ABQ Yoga Lab in Albuquerque, New Mexico. I walked away from the Ashtanga community in 2017 on principle and now run a clinical Ayurveda practice and create content analyzing power structures in yoga and wellness communities. FIND MY WORK: Website: https://magnoliazuniga.com/ YouTube: Subscribe for clinical guidance without wellness platitudes https://www.youtube.com/@MagnoliaSezSo?app=desktop About Magnolia Zuniga: Magnolia Zuniga is a former Ashtanga yoga teacher and one of only 20 women worldwide who were certified by the K. Pattabhi Jois Ashtanga Yoga Institute (KPJAYI) before publicly walking away from the lineage. After abuse allegations against Pattabhi Jois became public, she stopped teaching Ashtanga sequences and lost her certification—choosing survivor solidarity over professional advancement. She now teaches at ABQ Yoga Lab in Albuquerque, New Mexico, focusing on decolonizing yoga practice, recognizing cult dynamics in spiritual communities, and building accountability in yoga spaces. She speaks publicly about institutional abuse, guru culture, and what yoga becomes when you remove the harmful power structures. Find me at www.magnoliazuniga.com and https://www.youtube.com/@MagnoliaSezSo",
      "release": "2025-11-23T19:00:00Z",
      "duration": "00:34:03.6630000",
      "explicit": true,
      "spotifyId": "5265X9aQ0XtWTGx8pnXlc4",
      "appleId": 1000738021412,
      "subjects": [
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5265X9aQ0XtWTGx8pnXlc4",
        "apple": "https://podcasts.apple.com/podcast/record-2-cult-2-mysore-india/id1827696665?i=1000738021412"
      }
    },
    {
      "id": "ac54c1bf-0c88-40ce-8bec-e1c16db5d337",
      "title": "Record #1: Cult #1, Berkeley, CA",
      "description": "Record #1: Cult #1, Berkeley, CA Berkeley, 2001. I was twenty-something, restless, and aching for spiritual direction when I drove eight hours through the night to knock on a tantric yoga teacher\u0027s door. He told me I needed to do something extraordinary to prove my devotion. So I showed up in the fog at midnight. This is the record of a tantric yoga community in the Berkeley Hills led by a teacher who claimed lineage with Swami Satyananda Saraswati and Swami Niranjanananda Saraswati at the Bihar School of Yoga in India—gurus who had never heard of him. It was a community where beautiful, devoted women enforced the hierarchy. Where silence was considered devotion. Where questioning was spiritual immaturity. Where sexual abuse was disguised as sacred tantric \u0022practice.\u0022 I thought I was choosing spiritual freedom and transformation. I was choosing erasure. This is my origin story—why I recognize cult patterns and manipulation in yoga communities so clearly now. Why I can\u0027t be gaslit by institutional yoga\u0027s accountability theater. Why I understood exactly what was happening when abuse allegations against Pattabhi Jois became public. Why I left Ashtanga yoga when so many others couldn\u0027t. Years later, the truth emerged: the teacher had been raping one of his students for years. There were lawsuits. Whispers of women drugged. A pregnant woman. He eventually fled to Thailand. Had I pleased him with the fish dinner I cooked that night, I would have lived in that house. I would have shared her fate. I walked in hungry. I left dangerous. This is Record #1: Cult #1 Content Warning: This episode contains detailed descriptions of sexual coercion, spiritual manipulation, and abuse within a tantric yoga community. Please take care of yourself while listening. #yogacult #tantricyogaabuse #berkeleyyoga #spiritualabuse #cultrecovery #yogateachertraining #ashtangayoga #pattabhijois #yogaaccountability #guruabuse #sexualabuseinyoga #yogacommunityredflags Next Episode: Record #2: Cult #2, Mysore, India About Magnolia Zuniga: Magnolia Zuniga is a former Ashtanga yoga teacher and one of only 20 women worldwide who were certified by the K. Pattabhi Jois Ashtanga Yoga Institute (KPJAYI) before publicly walking away from the lineage. After abuse allegations against Pattabhi Jois became public, she stopped teaching Ashtanga sequences and lost her certification—choosing survivor solidarity over professional advancement. She now teaches at ABQ Yoga Lab in Albuquerque, New Mexico, focusing on decolonizing yoga practice, recognizing cult dynamics in spiritual communities, and building accountability in yoga spaces. She speaks publicly about institutional abuse, guru culture, and what yoga becomes when you remove the harmful power structures. Find me at www.magnoliazuniga.com and https://www.youtube.com/@MagnoliaSezSo",
      "release": "2025-11-02T19:00:00Z",
      "duration": "00:24:10.6840000",
      "explicit": true,
      "spotifyId": "1ma7dKWjEin3qiOr85j5qb",
      "appleId": 1000734880573,
      "subjects": [
        "Cult Psychology",
        "Satyananda Yoga Ashram",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ma7dKWjEin3qiOr85j5qb",
        "apple": "https://podcasts.apple.com/podcast/record-1-cult-1-berkeley-ca/id1827696665?i=1000734880573"
      }
    },
    {
      "id": "f93adbdd-14fe-4c45-b328-a98c4c0a9489",
      "title": "The Myth Of The Balanced Woman",
      "description": "We’re told that the goal of a “good life” is balance. Balance between work and family, activism and self-care, health and relationships. But what if balance isn’t real? What if the myth of the balanced woman is actually a trap designed to keep us exhausted, ashamed, and profitable to a system that was never built to support us?\nIn this episode of Spiritual Autopsy, I unpack how “balance” has been sold as control: eat perfectly, work out perfectly, manage your stress, stay calm, never tip too far. Through the lens of Ayurveda, I explore why balance isn’t a static state but a living relationship with change. Change that moves with seasons, hormones, emotions, and cycles.\nAbout Magnolia Zuniga:\n Magnolia Zuniga is a former Ashtanga yoga teacher and one of only 20 women worldwide who were certified by the K. Pattabhi Jois Ashtanga Yoga Institute (KPJAYI) before publicly walking away from the lineage. After abuse allegations against Pattabhi Jois became public, she stopped teaching Ashtanga sequences and lost her certification—choosing survivor solidarity over professional advancement.\n She now teaches at ABQ Yoga Lab in Albuquerque, New Mexico, focusing on decolonizing yoga practice, recognizing cult dynamics in spiritual communities, and building accountability in yoga spaces. She speaks publicly about institutional abuse, guru culture, and what yoga becomes when you remove the harmful power structures.\n Find me at www.magnoliazuniga.com and https://www.youtube.com/@MagnoliaSezSo",
      "release": "2025-08-26T21:00:00Z",
      "duration": "00:07:40",
      "explicit": false,
      "spotifyId": "1AeasaEn0cgwz8dLrW3AGM",
      "appleId": 1000723641352,
      "subjects": [
        "Satyananda Yoga Ashram",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1AeasaEn0cgwz8dLrW3AGM",
        "apple": "https://podcasts.apple.com/podcast/the-myth-of-the-balanced-woman/id1827696665?i=1000723641352"
      }
    }
  ]
}