{
  "_ts": 0,
  "id": "fdaa269c-f127-4093-af82-6526e5ba6dfa",
  "name": "I Heart My Life",
  "youTubeChannelId": "UC3QDKQp7Pbw6Q7WREmm21Rw",
  "episodes": [
    {
      "id": "18a9d42f-ee52-4873-b46a-3de7b3021c15",
      "title": "From Cult to Confidence with Candice Morgan",
      "description": "On this powerful episode of The I Heart My Life Show, Emily Williams talks to Candice Morgan, a business development expert and inspirational speaker who has transformed her life from one of restriction to empowerment. Candice shares her deeply personal story of growing up in a controlling religious environment, facing the challenges of an abusive marriage, and finding the courage to create a life of freedom and purpose.\n\nThrough vulnerability and determination, Candice turned her unique experiences into strengths, building a thriving career and an inspiring message of hope and resilience. Her philosophy of “prumble”—balancing pride and humility—has become her guiding principle as she navigates intimidating spaces and forges her own path to success.\n\nCandice’s journey is a testament to the power of self-awareness, courage, and the belief that you can create a meaningful life no matter your starting point.\n\nKey Takeaways: \n\n• The Courage to Leave: Candice opens up about her decision to leave a restrictive religious environment and an abusive marriage. She shares how these pivotal choices shaped her journey toward self-discovery and freedom.\n• Turning Pain into Power: By embracing her past and leveraging the skills she developed in challenging circumstances, Candice created a fulfilling career in business development and public speaking.\n• Introducing “Prumble”: Candice explains her unique philosophy, “prumble,” which combines pride and humility. This balance has been key to her ability to thrive while staying authentic.\n• Overcoming Impostor Syndrome: Candice shares her strategies for confidently navigating spaces that once felt intimidating, including her approach to mindset and self-belief.\n\n—\nHost, Emily Williams is a success coach, author, speaker, and CEO of multiple brands.\n\nAfter falling into a quarter-life crisis and struggling through a string of low-paying jobs (including serving up lattes at Starbucks), she finally decided it was time to follow her heart. So she packed her bags, moved to London (where she knew no one), and launched her own coaching business, I Heart My Life (without knowing if she’d ever make a dime). And that’s when her whole life changed course.\n\nIn her first month in business, Emily earned $442. She then went on to hit 6 figures before her 30th birthday, and—after just 18 months—successfully scaled what she\u0027d started to a multi-million dollar empire.\n\nToday, she remains the CEO of I Heart My Life, which has evolved into a media, educational and lifestyle brand through which she carries out her mission of helping thousands of women worldwide to create a life better than their dreams. \n\nConnect with Emily on her websites: \n\niheartmylife.com \nemilywilliams.com \nAnd on Instagram \nI Heart My Life on Instagram: instagram.com/iheartmylife/ \nEmily on Instagram: instagram.com/emilywilliams/ \n\n—\n\nThe guest on this episode is Candice Morgan. Candice was Born and raised in California within a strict religious cult, her life took an unexpected turn when she married young to a man, leading her to a life of poverty in rural Mexico. Grappling with her husband\u0027s alcoholism, she made the bold decision to leave, relocating to Georgia only to discover she was pregnant. The year 2020 marked a pivotal moment as she courageously left the cult and finalized her divorce, unleashing her potential. Remarkably, she doubled her income annually for four consecutive years, discovering an unexpected talent in sales honed by her years of religious conversion efforts. Today, she stands at a crossroads of self-discovery, unpacking her complex journey - a testament to resilience, growth, and the power of breaking free from constraining circumstances to forge a new path in life.\n\nConnect with Candice on Linked-In: http://linkedin.com/in/candice-morgan-7a2b88233",
      "release": "2024-11-26T05:01:00Z",
      "duration": "00:42:16",
      "explicit": false,
      "youTubeId": "0l04UWjgGR4",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0l04UWjgGR4"
      }
    }
  ]
}