{
  "id": "c958107e-8a1f-4cb5-9dd8-f1719099653f",
  "name": "I Ken Not with Kendrick Tucker",
  "spotifyId": "0TuDlx8Q7j7xRYL3x4Nuy2",
  "appleId": 1525311067,
  "episodes": [
    {
      "id": "ca02fc9e-cec5-4900-b2c0-48a8606f11c5",
      "title": "I Ken Not... Believe How this \u0022Mary Cosby\u0027s Cult\u0022 Documentary Concludes! Chile...",
      "description": "I’VE NOW SEEN THE REST OF TLC’S MARY COSBY DOCUMENTARY! I got the rest of the screeners for “The Cult of the Real Housewife” recently, and it’s time to dive into them! These last two episodes (there are 3 total) focus on Mary’s grandmother’s legacy and the beginnings of Faith Temple, Robert Sr. entering the picture, the marriage heard round the world, many tales of alleged financial, verbal, and sexual abuse, and so much more! It feels like required supplemental viewing for the Real Housewives of Salt Lake City, so let’s dive back in and get ready for its premiere on New Years Day! Download and listen today! SPONSORED BY: RexMD Visit rexmd.com/KENDRICK to get started today and receive up to 95% off this holiday season! *** HEY! Some of you have asked how you can show your appreciation for all the content provided by your mama’s favorite Black geek. How about you buy me a beer/coffee? CLICK HERE TO SUPPORT ! *** New episodes of “I Ken Not with Kendrick Tucker” are released weekly! DON’T FORGET TO SUBSCRIBE, RATE, AND REVIEW! I LOVE 5 STARS! EMAIL ME AT IKENNOTPODCAST@GMAIL.COM ! FOLLOW ME ON INSTAGRAM ! FOLLOW ME ON THREADS! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-12-29T14:30:00Z",
      "duration": "01:15:31.2260000",
      "explicit": false,
      "spotifyId": "0LdIwjx1uHEBNJBe1wQP4r",
      "appleId": 1000743063959,
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0LdIwjx1uHEBNJBe1wQP4r",
        "apple": "https://podcasts.apple.com/podcast/i-ken-not-believe-how-this-mary-cosbys-cult-documentary/id1525311067?i=1000743063959"
      }
    },
    {
      "id": "0c1a2ace-a72f-4db7-821c-e46728f1f952",
      "title": "I Ken Not... Believe They Sent Me the \u0022Mary Cosby\u0027s Cult\u0022 Documentary EARLY! Chile...",
      "description": "I’VE SEEN THE FIRST EPISODE OF TLC’S MARY COSBY DOCUMENTARY!! I got the screener for “The Cult of the Real Housewife,” which is TLC’s documentary about the Real Housewives of Salt Lake City’s Mary Cosby, her church, her wealth, her relationship with Robert Sr. and the members of the congregation, alleged affairs, and SO MUCH MORE! I give you my honest thoughts about the documentary and why it’s worth a watch! PLUS: I convince you to also watch the Danish Deception on TikTok! We love a good “Reesa Teesa” cheater brand! Download and listen today! Listen to the Danish Deception HERE! SPONSORED BY: RexMD Visit rexmd.com/KENDRICK to get started today and receive up to 95% off this holiday season! SPONSORED BY: Lumi Gummies Go to LumiGummies.com and use code KENDRICK for 30% off your order! *** HEY! Some of you have asked how you can show your appreciation for all the content provided by your mama’s favorite Black geek. How about you buy me a beer/coffee? CLICK HERE TO SUPPORT ! *** New episodes of “I Ken Not with Kendrick Tucker” are released weekly! DON’T FORGET TO SUBSCRIBE, RATE, AND REVIEW! I LOVE 5 STARS! EMAIL ME AT IKENNOTPODCAST@GMAIL.COM ! FOLLOW ME ON INSTAGRAM ! FOLLOW ME ON THREADS! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-12-15T14:30:00Z",
      "duration": "00:59:49.0410000",
      "explicit": false,
      "spotifyId": "4keeFqRkRKi1f97RmfeNT3",
      "appleId": 1000741375647,
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4keeFqRkRKi1f97RmfeNT3",
        "apple": "https://podcasts.apple.com/podcast/i-ken-not-believe-they-sent-me-the-mary-cosbys-cult/id1525311067?i=1000741375647"
      }
    }
  ]
}