{
  "_ts": 0,
  "id": "bd8d8d5d-40de-45c7-91a4-2578d9447838",
  "name": "IAmAnSP",
  "youTubeChannelId": "UChfec7Liil8Rkqv32XJkrsg",
  "episodes": [
    {
      "id": "89326450-f5c8-4ee9-b608-4db123af1d1c",
      "title": "Richard and Judy - Scientology",
      "description": "Richard \u0026 Judy item on Scientology\r\n\r\nFormer Scientologist Astra Woodcraft is interviewed, along with a spokeswoman for Scientology, Janet Laveau. Includes details on life inside Scientology,  and the policy of compulsory abortions for female members of the \u0022Sea Orgs\u0022.\r\n\r\nChannel 4, Oct 11 2005 [British television]\r\n\r\nLRonHubbard : why weren\u0027t you a lot harder on that scientology woman?\r\nDarth_yoda : Richard and judy would you be happy if any of your children became interested in scientology?\r\nsuzi puzi : hello.. what is your personal opinion on scientology?\r\n\r\nRichard : Neither of us particularly believes in beating up interviewees who may have something to hide. It\u0027s up to all of you to judge but hopefully the way we questioned her, rather than expressing our own views, we revealed in a more subtle way the inconsistencies in the religion. If either of our children were to want to become scientologists we\u0027d strain every sinew to stop them, we think it\u0027s a very dubious religion, if you can even call it that. \r\n\r\nhttp://www.channel4.com/community/showcards/R/Richard_and_Judy_-_Oct_05.html\r\n\r\n\r\nJudy: \u0022Have you been to one of these tests or something?\u0022\r\n\r\nRichard: \u0022I.. I.. Some years ago when I was walking past.. you know the Scientologist place on Deansgate, and there\u0027s this very sad looking guy that hangs around the town with a clipboard, and every time, well several times I went past, and every time he tried to get me to go in for one of these tests. And actually I will be straight. I said \u0027But you\u0027re a Scientologist!\u0027 .. \u0027No! It\u0027s a personality test!\u0027\u0022\r\n\r\nDr. Raj Persaud: \u0022When I did the test, I was very worried the night before about revising for it.\u0022\r\n\r\n[Total collapse of all into laughter]\r\n\r\nRaj: \u0022I didn\u0027t want to fail the personality test. It\u0027s very difficult to do the homework for it.\u0022 \r\n\r\nhttp://cosmedia.freewinds.cx/media/articles/thismorn.html\r\n\r\nDianetics  by L. Ron Hubbard http://www.amazon.com/dp/088404632X/ (Search Inside facility available)\r\n\r\nTom Cruise: An Unauthorized Biography  by Andrew Morton http://www.amazon.com/dp/0312359861/\r\n\r\n(not affliate links)\r\n\r\nSee more videos at http://www.xenutv.com/",
      "release": "2008-02-04T00:00:53Z",
      "duration": "00:09:21",
      "explicit": false,
      "youTubeId": "kkq9HQjMlAI",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kkq9HQjMlAI"
      }
    }
  ]
}