{
  "id": "e400dcd0-c072-4f05-ac92-282d36fb48e0",
  "name": "I’m on the phone!",
  "spotifyId": "3tQXEBZIqC6txghsgomvAg",
  "appleId": 1834775202,
  "episodes": [
    {
      "id": "09259047-016c-40b0-8844-d9eb9752945d",
      "title": "Ep.16 | Spiritual Abuse and Child Safety Failures in the Church",
      "description": "We discuss two deeply disturbing but necessary stories that reveal how power, theology, and silence collide in high-control church environments. We unpack: • A situation involving a known offender attending church while under restrictions around children • How leadership failure placed responsibility on women instead of prioritizing child safety • Why these patterns are not rare — and why survivors often struggle to name them • A moment where forced forgiveness was demanded under threat of hell • How spiritual authority is used to coerce compliance instead of protect victims • The weaponization of sexual abuse stories to control behavior • A situation involving a known offender attending church while under restrictions around children • How leadership failure placed responsibility on women instead of prioritizing child safety • Why these patterns are not rare — and why survivors often struggle to name them This conversation is not about sensationalism. It’s about recognizing systems that protect power over people, and why so many survivors leave feeling confused, silenced, or blamed. If you’ve ever felt that something was deeply wrong but couldn’t quite articulate it — this episode is for you. #SpiritualAbuse #ChurchHurt #ReligiousTrauma #TraumaInform",
      "release": "2025-12-15T13:00:00Z",
      "duration": "01:07:28.5830000",
      "explicit": true,
      "spotifyId": "35GZbeAnrO0lg3koSG3x4S",
      "appleId": 1000741363493,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/35GZbeAnrO0lg3koSG3x4S",
        "apple": "https://podcasts.apple.com/podcast/ep-16-spiritual-abuse-and-child-safety-failures-in/id1834775202?i=1000741363493"
      }
    },
    {
      "id": "92e13103-f4b5-4673-9813-e1fe61b5ac84",
      "title": "Books, Brainwashing, \u0026 Behavior",
      "description": "⚠️Content note: This episode includes discussion of cult dynamics, religious trauma, and LGBTQ\u002B topics. Please listen with care if those areas are sensitive for you. \n\n🎙️What starts as a cozy book chat turns into a deep dive on beliefs, mindset shifts, culty brainwashing, and dating after deconstruction. We even touch on the movie Frailty — which we’ll be unpacking fully in next week’s episode 👀\n\nThis one’s honest, a little messy, and full of “oh wow, same” moments. It might also be uncomfortable for those who’ve left this particular cult or others like it. We discuss topics like homosexuality and gender identity — areas that can feel polarizing or sensitive for those deconstructing from fundamentalism.\n\n🌀 Real talk, thoughtful reflection, and plenty of space for nuance.\n\n\n#CultyConversations #DeconstructionPodcast #ReligiousTraumaRecovery #CultSurvivor #MindsetShift #FrailtyMovie #BeliefUnpacking #HealingJourney #CultyEntertainment #PopCultureAndFaith #Deprogramming #HealingOutLoud",
      "release": "2025-10-13T12:00:00Z",
      "duration": "01:43:10",
      "explicit": false,
      "spotifyId": "1STeuqKK1IcrrdTcXBy84w",
      "appleId": 1000731621957,
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Christian Fundamentalist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1STeuqKK1IcrrdTcXBy84w",
        "apple": "https://podcasts.apple.com/podcast/books-brainwashing-behavior/id1834775202?i=1000731621957"
      }
    }
  ]
}