{
  "_ts": 0,
  "id": "3277edd8-6a03-4aa7-bcac-fccdaee2f104",
  "name": "Imaginary Friends Adventure Club",
  "youTubeChannelId": "UC3olFxWg-F6r_abqMXn00nQ",
  "episodes": [
    {
      "id": "d9cb9b8f-0d7d-4d00-8537-4aeadf60f2db",
      "title": "Explored Inside Abandoned Carriage House \u0026 Horse Stables Converted To Cult Member Dorm Rooms In MA",
      "description": "This place is creepy. It\u0027s behind a former religious cult leader owned mansion which is also abandoned. It was most likely just a rich persons\u0027 mansion and a normal carriage house and stables at one time.\n\nThe cult leader was able to purchase and renovate it into dorm type living by brainwashing his followers into donating large sums of money. He would even try to have followers sell their homes and donate the money to him and live there.\n\nOne artist named Betsy Dovydenas donated 6.5 million dollars. She was a member from 1984 to 1985 and claimed she was brainwashed in the lawsuit. She was awarded a lesser amount of 5.5 million in 1987.\n\nThe religious cult went by the name \u0022The Bible Speaks\u0022 and called itself a Christian religious group. It operated in Lenox Massachusetts from 1976 to 1987. It was run by Carl H. Stevens Jr. who also declared bankruptcy in 1987 and moved to Baltimore. He died in 2005.\n\nFormer members allege there was Mind Control practiced, Sexual Misconduct, Child Molestation, Fraud \u0026 Extortion.\n\nThe mansion was locked \u0026 boarded up so I couldn\u0027t go inside but i filmed the outside of it at the end of the video.\n\nThe Carriage house was a fun inside explore but creepy finding out what it was used for. One of the doors opened by itself although it was a very windy day it was spooky. \n\nI also noticed that one of the doors on one of the small rooms had a locking latch hook on the outside of the door to lock someone in - maybe a kid.\n\nThere were a couple dozen papers completely filled with handwritten bible quotes in another room. Was that someone being punished or was that part of the brainwashing technique?\n\nI hope you enjoy the video. Thanks for watching. Please subscribe. \n\nThank You to all my current subscribers.\n\nTake Care...",
      "release": "2025-04-03T07:30:44Z",
      "duration": "00:16:39",
      "explicit": false,
      "youTubeId": "QIlbQym1ssU",
      "subjects": [
        "Greater Grace World Outreach"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QIlbQym1ssU"
      }
    }
  ]
}