{
  "_ts": 0,
  "id": "571a54d3-bf58-43ac-85fc-6b914b9a2e88",
  "name": "Impolite Company with Demetra Gray",
  "spotifyId": "1Ra4aPA3zV0Eay1G8Dn1Al",
  "appleId": 1788568554,
  "youTubeChannelId": "UCPOTWnlSfvb9aC97yniQz3g",
  "episodes": [
    {
      "id": "13fb8622-29d9-4ef5-9234-b09a3d61ef64",
      "title": "#19: The Aubrey Marcus drama, cult dynamics, Marc Gafni, \u0026 the sad attempt to redefine monogamy",
      "description": "A few weeks ago, Aubrey Marcus released a podcast explaining how God told him to open up his marriage and find a younger woman and how the spirit of Isis told him to impregnate both of them. Our characters are Aubrey, 44; his wife Vyana, 38; the new addition Alana, 28; and Marc Ganfi, a culty ex-rabbi posing as a \u0022relationship coach\u0022 who was accused of molesting young girls in his time as a youth leader. Jade and I dissect the dynamics of this podcast — about what we call \u0022God,\u0022 how we know \u0022truth,\u0022 the tactics narcissists use to manipulate others, our own experience in the sex coaching world, opinions on polyamory, and more. Videos referenced in this episode: The Aubrey Marcus podcast episode on YouTube Clip of Marc Gafni on Dr. Phil (a hilarious bit) Clip of Gafni on Dr. Phil where his victim explains her story Jennifer Jade Merrihue is a relationship coach, sexologist, \u0026 medicine woman. Her background is in philosophy, academia, neuropsych, CBT, Eastern \u0026 Western medicine and philosophies, Neotantra/Taoism, human sexuality, existential/ spiritual kink, alternative relationships and sacred sexuality, nutrition, relationships, trauma, Neurolinguistics, psychology… among many other things! You can connect with her on Instagram @jennifer.jade.merrihue or on her website merrihue.com. Demetra\u0027s Substack Demetra\u0027s email list Watch this episode on YouTube here",
      "release": "2025-06-13T08:00:00Z",
      "duration": "02:23:20.5550000",
      "explicit": true,
      "spotifyId": "1T4IKLYg4N9t2qw4POgGZK",
      "appleId": 1000712721104,
      "youTubeId": "wBLt8xuzt1w",
      "subjects": [
        "Aubrey Marcus"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1T4IKLYg4N9t2qw4POgGZK",
        "apple": "https://podcasts.apple.com/podcast/19-the-aubrey-marcus-drama-cult-dynamics-marc-gafni/id1788568554?i=1000712721104",
        "youtube": "https://www.youtube.com/watch?v=wBLt8xuzt1w"
      }
    },
    {
      "id": "4011ac0d-30b8-4efe-8911-dd16bbfdaea3",
      "title": "#13: Growing up in a Christian cult, sexual abuse \u0026 grooming, winning in court, \u0026 a story of healing",
      "description": "Danielle grew up in a Duggar-family-style Christian cult. Leading a very sheltered childhood, she left to find her own independence as a teenager and ended up getting groomed into another “Christian” cult, by a narcissistic couple who sexually abused and financially exploited her. Danielle has a lot of self-awareness about exactly how this happened and also tells the story of her escape and the rebuilding of her life. She was later able to testify against her abuser in court and contributed to him going to prison. She is now happily married and has truly moved on from her past experiences.",
      "release": "2025-05-02T07:01:00Z",
      "duration": "02:34:09",
      "explicit": false,
      "spotifyId": "3sJRGXzRH7yJEAoisJg9FS",
      "appleId": 1000705815386,
      "youTubeId": "pouWj0XZ2pw",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sJRGXzRH7yJEAoisJg9FS",
        "apple": "https://podcasts.apple.com/podcast/13-growing-up-in-a-christian-cult-sexual-abuse/id1788568554?i=1000705815386",
        "youtube": "https://www.youtube.com/watch?v=pouWj0XZ2pw"
      }
    }
  ]
}