{
  "_ts": 0,
  "id": "571a54d3-bf58-43ac-85fc-6b914b9a2e88",
  "name": "Impolite Company with Demetra Gray",
  "spotifyId": "1Ra4aPA3zV0Eay1G8Dn1Al",
  "appleId": 1788568554,
  "youTubeChannelId": "UCPOTWnlSfvb9aC97yniQz3g",
  "episodes": [
    {
      "id": "46fef19d-6d85-4a7d-8eb0-bd66e672088b",
      "title": "#21: Narcissistic tactics, the cult mind, \u0026 how to heal from mind control | Danyelle part 2",
      "description": "In this episode Danyelle and I go deeper into mind control tactics, how narcissists work, and how and why it\u0027s so easy to fall into their trap. We discuss cult dynamics and the cult mind, and what made us each more susceptible in our experiences. We also talk about exactly how Danyelle healed and what that experience looked like - plus we touch on eating disorders and how control of food and also sex can play into cults and cult recovery. \n\nDanyelle\u0027s first episode on this podcast was episode 13, where she told us the full story of how she grew up in a Christian cult, only to run away and be groomed into another, more intense cult full of sexual abuse and financial exploitation.",
      "release": "2025-06-27T07:00:05Z",
      "duration": "03:01:22",
      "explicit": false,
      "spotifyId": "6Ic3b8PzqY4FmLVIRQGrtz",
      "appleId": 1000714778194,
      "youTubeId": "3iTXwxflbdU",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Ic3b8PzqY4FmLVIRQGrtz",
        "apple": "https://podcasts.apple.com/podcast/21-narcissistic-tactics-the-cult-mind-how-to-heal/id1788568554?i=1000714778194",
        "youtube": "https://www.youtube.com/watch?v=3iTXwxflbdU"
      }
    },
    {
      "id": "13fb8622-29d9-4ef5-9234-b09a3d61ef64",
      "title": "#19: The Aubrey Marcus drama, cult dynamics, Marc Gafni, \u0026 the sad attempt to redefine monogamy",
      "description": "A few weeks ago, Aubrey Marcus released a podcast explaining how God told him to open up his marriage and find a younger woman and how the spirit of Isis told him to impregnate both of them. Our characters are Aubrey, 44; his wife Vyana, 38; the new addition Alana, 28; and Marc Ganfi, a culty ex-rabbi posing as a \u0022relationship coach\u0022 who was accused of molesting young girls in his time as a youth leader. Jade and I dissect the dynamics of this podcast — about what we call \u0022God,\u0022 how we know \u0022truth,\u0022 the tactics narcissists use to manipulate others, our own experience in the sex coaching world, opinions on polyamory, and more. Videos referenced in this episode: The Aubrey Marcus podcast episode on YouTube Clip of Marc Gafni on Dr. Phil (a hilarious bit) Clip of Gafni on Dr. Phil where his victim explains her story Jennifer Jade Merrihue is a relationship coach, sexologist, \u0026 medicine woman. Her background is in philosophy, academia, neuropsych, CBT, Eastern \u0026 Western medicine and philosophies, Neotantra/Taoism, human sexuality, existential/ spiritual kink, alternative relationships and sacred sexuality, nutrition, relationships, trauma, Neurolinguistics, psychology… among many other things! You can connect with her on Instagram @jennifer.jade.merrihue or on her website merrihue.com. Demetra\u0027s Substack Demetra\u0027s email list Watch this episode on YouTube here",
      "release": "2025-06-13T08:00:00Z",
      "duration": "02:23:20.5550000",
      "explicit": true,
      "spotifyId": "1T4IKLYg4N9t2qw4POgGZK",
      "appleId": 1000712721104,
      "youTubeId": "wBLt8xuzt1w",
      "subjects": [
        "Aubrey Marcus"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1T4IKLYg4N9t2qw4POgGZK",
        "apple": "https://podcasts.apple.com/podcast/19-the-aubrey-marcus-drama-cult-dynamics-marc-gafni/id1788568554?i=1000712721104",
        "youtube": "https://www.youtube.com/watch?v=wBLt8xuzt1w"
      }
    },
    {
      "id": "4011ac0d-30b8-4efe-8911-dd16bbfdaea3",
      "title": "#13: Growing up in a Christian cult, sexual abuse \u0026 grooming, winning in court, \u0026 a story of healing",
      "description": "Danielle grew up in a Duggar-family-style Christian cult. Leading a very sheltered childhood, she left to find her own independence as a teenager and ended up getting groomed into another “Christian” cult, by a narcissistic couple who sexually abused and financially exploited her. Danielle has a lot of self-awareness about exactly how this happened and also tells the story of her escape and the rebuilding of her life. She was later able to testify against her abuser in court and contributed to him going to prison. She is now happily married and has truly moved on from her past experiences.",
      "release": "2025-05-02T07:01:00Z",
      "duration": "02:34:09",
      "explicit": false,
      "spotifyId": "3sJRGXzRH7yJEAoisJg9FS",
      "appleId": 1000705815386,
      "youTubeId": "pouWj0XZ2pw",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sJRGXzRH7yJEAoisJg9FS",
        "apple": "https://podcasts.apple.com/podcast/13-growing-up-in-a-christian-cult-sexual-abuse/id1788568554?i=1000705815386",
        "youtube": "https://www.youtube.com/watch?v=pouWj0XZ2pw"
      }
    },
    {
      "id": "11fd5ffb-6672-410a-aa4d-5dfb559cf0c0",
      "title": "#10: Yoga culture \u0026 when it’s culty, witchcraft, changing spiritual beliefs, \u0026 funny stories",
      "description": "In this episode, Christina and I discuss the weird, funny, and sometimes healing world of yoga culture. We talk about her experience with Baptiste yoga teacher training, the aspects of that training that were very culty, and how emotional manipulation can show up in spiritual spaces. We also get into the ethics of coaching, question whether energy work is real, and talk about the power of belief in healing. I talk about my experience owning a yoga studio when I was younger, and how I used to identify as a witch, and we discuss returning to Christianity. This conversation went so many places — other topics include libertarianism, politics, veganism, the Amish, Mark Rippetoe and strength training, and Christina’s experience working as a first responder. There is a lot of laughter in this episode!\n\nChristina is a paramedic first responder, nurse, and new mother of a 7-month-old boy. She spent many years deeply immersed in all things yoga, meditation, and Eastern medicine. Having lived in four states across both coasts and the Midwest, she has gained insight from her experiences in both traditional healthcare and New Age practices.\n\nDemetra\u0027s Substack: demetragray.substack.com\n\nDemetra\u0027s Website \u0026 email list: demetragray.com",
      "release": "2025-04-11T07:00:52Z",
      "duration": "02:29:28",
      "explicit": false,
      "spotifyId": "5Q2Pdb85vgMB1SeGyeUVvG",
      "appleId": 1000703127763,
      "youTubeId": "nxns-eXwleo",
      "subjects": [
        "Amish",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Q2Pdb85vgMB1SeGyeUVvG",
        "apple": "https://podcasts.apple.com/podcast/10-yoga-culture-when-its-culty-witchcraft-changing/id1788568554?i=1000703127763",
        "youtube": "https://www.youtube.com/watch?v=nxns-eXwleo"
      }
    },
    {
      "id": "55ad581d-8d74-45d1-9b57-1792af55d2da",
      "title": "#8: Ex-Mormon, from queer to straight, parenting boys, \u0026 re-discovering Christianity with Kymberli",
      "description": "Kymberli tells us all about growing up Mormon, what Mormonism really means, and what it was like to decide to leave the community. She describes deciding she was lesbian and where that came from and her realization that she is straight after all. We discuss healthy masculinity and how that comes up when parenting her son, the rise of wokeism especially in schools, cults, and slowly starting to return to Christianity. \n\nKymberli is a single mom to her almost 10 year son living in a small agricultural community in Northern California. She is leaning into a new identity after being raised in a multi-generational Mormon family and as an adult decades in queer leftist communities. She now considers both to be cults and is rebuilding her life from a foundation of truth and reality with sprinkles of magic and faith. She spends her time watching old 90\u0027s movies with her kid and their two cats, cooking, baking and taking long walks along the creek behind their apartment.",
      "release": "2025-03-28T07:00:49Z",
      "duration": "02:35:25",
      "explicit": false,
      "spotifyId": "4stjIZIKU8MdZOkGTlTR9t",
      "appleId": 1000701213959,
      "youTubeId": "un9AYCxhMcg",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4stjIZIKU8MdZOkGTlTR9t",
        "apple": "https://podcasts.apple.com/podcast/8-ex-mormon-from-queer-to-straight-parenting-boys-re/id1788568554?i=1000701213959",
        "youtube": "https://www.youtube.com/watch?v=un9AYCxhMcg"
      }
    }
  ]
}