{
  "id": "ef537a95-597f-492a-957a-4c23e34d7e39",
  "name": "In Conversation… with Frank Schaeffer",
  "spotifyId": "1FVF48mNwzNaLd1tJ4zH6y",
  "appleId": 1570357787,
  "youTubeChannelId": "UCeEyQuE2XSdHHEr9F4Jrjpg",
  "episodes": [
    {
      "id": "0f5672cc-e8d1-4f75-99b4-54093010f2d0",
      "title": "How Marketers Brainwash You: Dr. Mara Einstein, PhD on Hoodwinked and Cult Tactics",
      "description": "Marketing or mind control? Dr. Mara Einstein, former NBC and MTV executive, exposes how brands use cult tactics to manipulate you. Based on her book Hoodwinked and featured in Netflix’s Buy Now documentary, this Conversation pulls back the curtain on deceptive marketing’s dark side. _____  https://www.drmaraeinstein.com  https://www.instagram.com/drmaraeinstein/  https://www.linkedin.com/in/drmaraeinstein/  https://www.tiktok.com/@drmaraeinstein  https://www.threads.net/@drmaraeinstein  https...",
      "release": "2025-04-29T04:00:00Z",
      "duration": "01:04:31",
      "explicit": false,
      "spotifyId": "2CNcGVuqinXTyPHtqbMQiO",
      "appleId": 1000705357748,
      "youTubeId": "kv9H5NWisSI",
      "subjects": [
        "Cult Psychology",
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2CNcGVuqinXTyPHtqbMQiO",
        "apple": "https://podcasts.apple.com/podcast/how-marketers-brainwash-you-dr-mara-einstein-phd-on/id1570357787?i=1000705357748",
        "youtube": "https://www.youtube.com/watch?v=kv9H5NWisSI"
      }
    },
    {
      "id": "6daa7a6d-1322-47cd-932d-3d997380a72d",
      "title": "Dr. Laura Anderson, PhD, LMFT",
      "description": "Frank Schaeffer In Conversation with Dr. Laura Anderson, PhD, LMFT, founder and director of the Center for Trauma Resolution and Recovery, exploring the themes of her upcoming book, When Religion Hurts You.\n_____\nLINKS\n\nhttps://drlauraeanderson.com/book\n_____\nDr. Laura Anderson (PhD, Saybrook University; LMFT) is a therapist, trauma resolution and recovery coach, writer, educator, and creator who specializes in complex trauma with a focus on domestic violence, sexualized violence and religious trauma. Laura has a private practice in Nashville, TN and is the founder and director of the Center for Trauma Resolution and Recovery, an online coaching company where she and the other practitioners work with clients who have experienced high demand/high control religions, adverse religious experiences, cults, and religious trauma.\n\nIn 2019, Laura co-founded the Religious Trauma Institute with the goal of providing trauma-informed resources, consultation, and train\nAlternate SidesA movie podcast with a twistListen on: Apple Podcasts   Spotify\n From The BlockchainFrom supply chains to customer loyalty programs, blockchain tech will touch every businessListen on: Apple Podcasts   Spotify\nI have had the pleasure of talking to some of the leading authors, artists, activists, and change-makers of our time on this podcast, and I want to personally thank you for subscribing, listening, and sharing 100-plus episodes over 100,000 times.\nPlease subscribe to this Podcast, In Conversation… with Frank Schaeffer, on your favorite platform, and to my Substack, It Has to Be Said.Thanks!\n Every subscription helps create, build, sustain and put voice to this movement for truth.Subscribe to It Has to Be Said.\n Support the show_____\nIn Conversation… with Frank Schaeffer is a production of the George Bailey Morality in Public Life Fellowship. It is hosted by Frank Schaeffer, author of Fall In Love, Have Children, Stay Put, Save the Planet, Be Happy.\n Learn more at https://www.lovechildrenplanet.com\n\nFollow Frank on Substack, Facebook, Twitter, Instagram, Threads, and YouTube.\n https://frankschaeffer.substack.com\nhttps://www.facebook.com/frank.schaeffer.16\nhttps://twitter.com/Frank_Schaeffer\nhttps://www.instagram.com/frank_schaeffer_art\nhttps://www.threads.net/@frank_schaeffer_art\nhttps://www.youtube.com/c/FrankSchaefferYouTube\n \nIn Conversation… with Frank Schaeffer Podcast\n\nLove In Common Podcast with Frank Schaeffer, Ernie Gregg, and Erin Bagwell",
      "release": "2023-12-19T05:00:00Z",
      "duration": "01:06:35",
      "explicit": false,
      "appleId": 1000639032449,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/dr-laura-anderson-phd-lmft/id1570357787?i=1000639032449"
      }
    }
  ]
}