{
  "id": "5deff804-cdc7-496e-9e0d-bd29e246b3d4",
  "name": "In Detail...",
  "spotifyId": "0aThRr8LBt7LZDWdL9t0VG",
  "appleId": 1781007323,
  "episodes": [
    {
      "id": "2a7f80ac-65de-4a7d-93d7-99c64a8c1192",
      "title": "2. Genesis",
      "description": "All new followers were welcome to the Jesus Fellowship, they were given new names and strict rules to become a member of the community.\n\nTreasured possessions are left at the door. No media, no music, no belongings and harsh discipline for children.\n\nFor information and support on issues covered in this episode, visit bbc.co.uk/actionline.",
      "release": "2025-07-28T00:06:00Z",
      "duration": "00:26:35",
      "explicit": false,
      "subjects": [
        "Jesus Army"
      ],
      "urls": {
        "bbc": "https://www.bbc.co.uk/sounds/play/p0lrwfv1"
      }
    },
    {
      "id": "9e75056b-3e4a-4173-acfb-a4ce4bd32c0b",
      "title": "1. Follow The Leader",
      "description": "Exploring how the Fellowship Church and the \u0027Jesus Army\u0027, led by Noel Stanton, settled in the rural Northamptonshire village of Bugbrooke.\nThe church attracted thousands with promises of Christian faith, community and a better life.",
      "release": "2025-07-28T00:05:00Z",
      "duration": "00:25:33",
      "explicit": false,
      "spotifyId": "5WSoi5mEJO3YLcb8nQbWWp",
      "appleId": 1000719426164,
      "subjects": [
        "Jesus Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WSoi5mEJO3YLcb8nQbWWp",
        "apple": "https://podcasts.apple.com/podcast/1-follow-the-leader/id1781007323?i=1000719426164",
        "bbc": "https://www.bbc.co.uk/sounds/play/p0lrwd5f"
      }
    },
    {
      "id": "7ed1d610-66c7-4953-b620-39ff94487eba",
      "title": "Introducing... The Jesus Army Cult",
      "description": "Uncovering the rise and unravelling of one of the biggest religious cults in Britain. Exploring the controversies, abuses and lasting scars left on those who lived within it. Diving deep into the Fellowship Church and the \u0027Jesus Army\u0027, led by Baptist evangelical maverick Noel Stanton in the Northamptonshire village of Bugbrooke. Devotees gave up their homes, their money and in some cases their family to live in Noel’s \u0027heaven on earth\u0027 where everything was shared – even children. Presenter Annabel Amos grew up in a village 5 minutes away from where this all began, as ex-members and survivors share their stories she has realised she knew little of the horrors lurking behind a promise of faith. Presenter: Annabel Amos. Producer: Ellena Wood, Tim Wheeler and Sarah-Jane Muddiman. Writer: Tim Wheeler with additional scripting by Jack Kibble White. Story consultant: Jack Kibble White. Sound design: Meic Parry. Sounds producer: Alex Huxley. Online Producer: Rachael Smith. Executive Producer: Anna Bartlett and Katie Buchanan. Commissioning Editor: Alistair Miskin. For help and information on issues covered in this series, visit bbc.co.uk/actionline.",
      "release": "2025-07-24T16:30:00Z",
      "duration": "00:02:52.8200000",
      "explicit": false,
      "spotifyId": "6GlTaVIcJeZ1zefEoPuMgh",
      "appleId": 1000718869997,
      "subjects": [
        "Jesus Army"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6GlTaVIcJeZ1zefEoPuMgh",
        "apple": "https://podcasts.apple.com/podcast/introducing-the-jesus-army-cult/id1781007323?i=1000718869997",
        "bbc": "https://www.bbc.co.uk/sounds/play/p0lrwcf4"
      }
    }
  ]
}