{
  "_ts": 0,
  "id": "a1ad7047-bb44-40a4-9483-3c82689e60fc",
  "name": "In Jesus Name We Cult",
  "spotifyId": "0i5dbG3vLVQIAvH3OxmqiX",
  "appleId": 1762210738,
  "episodes": [
    {
      "id": "bbecaaac-83c3-48cd-9230-a3d1143945f5",
      "title": "The Gendered Consequences of Christian Cults for Women and Girls",
      "description": "Summary\nSigning a purity contract, promising not to have sex before marriage, when you aren\u0027t even old enough to consent to the act. Being branded with the stamp of promiscuity because you are taking the pill for your acne, and being unhealthily fixated on marriage as a teenager. This episode discusses the gendered consequences for women and girls that find themselves in Christian cults.\nThis conversation focuses on the experiences of a woman named \u0027Chloe\u0027 (her name and voice have been changed to keep her anonymous). The discussion highlights the victim-blaming and policing of women\u0027s bodies within these cults, as well as the subtle coercive control exerted by the leaders.The discussion also delves into the double standards and hypocrisy exhibited by these leaders, who promote purity culture while engaging in affairs themselves. \nThe gendered nature of Chloe\u0027s experience is evident in the emphasis on female sexuality, the pressure to conform to traditional gender roles, and the restriction of personal autonomy. The conversation concludes with advice for women currently in Christian cults; encouraging them to seek information, maintain communication with supportive individuals, prioritise their own well-being, and not dwell on lost time.\nKeywords\nChristian cults, gendered consequences, victim-blaming, policing, coercive control, double standards, purity culture, female sexuality, traditional gender roles, personal autonomy, advice\nTakeaways\nChristian cults often engage in victim-blaming and policing of women\u0027s bodies.Leaders in these cults exhibit double standards and hypocrisy.The gendered nature of the cult experience is evident in the emphasis on female sexuality and the restriction of personal autonomy.Women in these cults should seek information, maintain communication with supportive individuals, prioritise their well-being, and not dwell on lost time.Titles\nAdvice for Women in Christian CultsThe Restriction of Female Autonomy in CultsSound Bites\n\u0022It\u0027s our fault for wearing the wrong thing. It\u0027s our fault for being alone with a boy.\u0022\u0022They convince you to police yourself, your own thoughts, your own behaviour.\u0022\u0022I don\u0027t think as a child you can fully consent to celibacy. I think that\u0027s inappropriate.\u0022",
      "release": "2024-08-31T12:00:31Z",
      "duration": "00:30:25",
      "explicit": false,
      "spotifyId": "3n6etq9R9aFHVV7pZIunN7",
      "appleId": 1000667730748,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3n6etq9R9aFHVV7pZIunN7",
        "apple": "https://podcasts.apple.com/us/podcast/the-gendered-consequences-of-christian-cults-for/id1762210738?i=1000667730748"
      }
    },
    {
      "id": "08b79cce-a78f-446b-9f73-c2fbca61df10",
      "title": "The Psychology Of Cult Followers",
      "description": "Summary In this conversation, Richard, a cult recovery therapist and former member of a Bible-based cult, discusses the psychology of cult followers. He explains that people are often recruited and manipulated into cults, rather than knowingly joining them. Vulnerable individuals, such as students or those going through transition periods, are targeted by cults. Richard highlights the systematic process of manipulation that cults use to control their members, including suppressing their individuality and creating cognitive dissonance. He also discusses the psychological toll on cult members, the exit process, and the reconciliation of faith after leaving a cult. Takeaways People are often recruited and manipulated into cults, rather than knowingly joining them. Cults target vulnerable individuals, such as students or those going through transition periods. Cults use a systematic process of manipulation to control their members, including suppressing individuality and creating cognitive dissonance. Cult membership can have a severe psychological toll, leading to emotional suppression and identity issues. The exit process involves understanding and diagnosing the cult experience, learning about coercive control, and healing emotionally. Reconciling faith after leaving a cult involves deconstructing beliefs, realigning with healthier perspectives, and finding a personal and less intense connection to spirituality. Titles The Psychology of Cult Followers Recruitment and Manipulation in Cults. Sound Bites \u0022It\u0027s like you get a handshake from someone and then they hold your wrist and then they hold your elbow and then they\u0027ve got your whole arm and they\u0027ve got your shoulder and you\u0027re in a grip.\u0022 \u0022I ignored my gut feelings because of the other manipulation processes going on in the church, the love bombing especially, because it didn\u0027t feel bad, I dismissed and emotions are a key things in all of this.\u0022 \u0022People sometimes struggle to even understand what\u0027s real or not anymore. They have massive identity issues because the whole identity has been shaped by the cult and the cult leader.\u0022 Chapters 01:00Retaliation and Intervention After Leaving a Cult. 01:19Understanding the Recruitment and Manipulation into Cults 04:29Separation and Control of Cult Members 07:31The Mental Math of Committing to a Cult 09:36Changing Thoughts, Emotions, and Behaviours in Cults 14:49Shame and Guilt in Cult Survivors 19:54Rebuilding Faith and Identity After Exiting a Cult 24:27No Shame in Admitting Involvement in a Cult",
      "release": "2024-08-17T12:00:30Z",
      "duration": "00:32:11.9040000",
      "explicit": false,
      "spotifyId": "5oN9xIGDlb1Zkh5OdywvNg",
      "appleId": 1000665711316,
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5oN9xIGDlb1Zkh5OdywvNg",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-cult-followers/id1762210738?i=1000665711316"
      }
    },
    {
      "id": "04430ab9-41d4-484d-9c4a-c2973630eaa0",
      "title": "The Psychology Of Christ-Centred Cult Leaders",
      "description": "Summary In this episode, the psychology of Christ-centred cult leaders is explored. Cult leaders are often narcissistic or psychopathic individuals who have deep-seated insecurities and a poor sense of self. They may have unresolved trauma from childhood and seek to fulfill their own needs and desires through the establishment and control of a cult. Cult leaders often use spiritual language and manipulate biblical teachings to justify their control and gain the worship and adoration of their followers. Recovery for cult leaders is possible, but it requires acknowledging their actions, facing their past, and undergoing a significant amount of personal growth and healing. Takeaways Cult leaders are often narcissistic or psychopathic individuals with deep-seated insecurities and a poor sense of self. They may have unresolved trauma from childhood and seek to fulfill their own needs and desires through the establishment and control of a cult. Cult leaders manipulate spiritual language and biblical teachings to justify their control and gain worship and adoration from their followers. Recovery for cult leaders is possible, but it requires acknowledging their actions, facing their past, and undergoing personal growth and healing. Titles Recovery and Healing for Cult Leaders The Psychology of Christ-Centred Cult Leaders. Sound Bites \u0022Cult leaders are deeply insecure and have a poor sense of self.\u0022 \u0022Cult leaders wrap their coercive control in spiritual language.\u0022 \u0022Recovery for cult leaders requires acknowledging their actions and facing their past.\u0022 Chapters 01:40Introduction: Defining Cults and Exploring the Psychology of Cult Leaders 02:08The Insecurities and Control Motives of Cult Leaders 04:08The Spiritual Aspect of Cult Leaders: Masking Control with Religion 20:38Protecting Oneself from Harmful Leaders: Understanding Cult Psychology 33:33The Therapy Process and Client Work",
      "release": "2024-08-17T12:00:30Z",
      "duration": "00:39:29.8800000",
      "explicit": false,
      "spotifyId": "7rW9DUynU48tITw0aDLGms",
      "appleId": 1000665711349,
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7rW9DUynU48tITw0aDLGms",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-christ-centred-cult-leaders/id1762210738?i=1000665711349"
      }
    }
  ]
}