{
  "id": "a1ad7047-bb44-40a4-9483-3c82689e60fc",
  "name": "In Jesus Name We Cult",
  "spotifyId": "0i5dbG3vLVQIAvH3OxmqiX",
  "appleId": 1762210738,
  "episodes": [
    {
      "id": "b7066e85-19bc-437c-8908-2dfbdb4908a3",
      "title": "My cult experience being neurodivergent and chronically ill: I was told to lie about my sickness!",
      "description": "Keywords\nchronic illness, neurodivergence, Christian cults, mental health, abuse prevention, faith, healing, vulnerability, safeguarding, advocacy\nSummary\nIn this conversation, Sola and Chioma Alade discuss the intersection of chronic illness, neurodivergence, and the experiences of individuals within Christian cults. They explore the negative narratives surrounding illness in these environments, the mental health impacts of being blamed for one\u0027s condition, and the control exerted by cult leaders. Choma shares her personal experiences of abuse and the struggle for healing, emphasizing the importance of community and advocacy in preventing such exploitation. The discussion also highlights the need for safeguarding measures in Christian settings to protect vulnerable individuals.\nTakeaways\nChronic illness and neurodivergence are often weaponised in cults.Mental health struggles are exacerbated by cult dynamics.Leaders may manipulate scripture to control individuals.The expectation of healing can lead to mental distress.Community support is crucial for those with chronic illnesses.Cult leaders often target vulnerable individuals without support.Hindsight reveals the true nature of cult leaders\u0027 actions.Advocacy work is essential for preventing abuse.Safeguarding measures must be implemented in churches.Healing is a continuous journey for survivors.Titles\nMessages to Cult LeadersHindsight and RealisationsSound Bites\n\u0022I would dress in my suit to go to A \u0026 E\u0022\u0022He was a torturous wolf on the inside\u0022\u0022You have value. You have value. You have value.\u0022",
      "release": "2024-10-19T12:00:18Z",
      "duration": "00:35:56",
      "explicit": false,
      "spotifyId": "0YNoRy6vaCLa8nbyilsiPJ",
      "appleId": 1000673675955,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YNoRy6vaCLa8nbyilsiPJ",
        "apple": "https://podcasts.apple.com/podcast/my-cult-experience-being-neurodivergent-and/id1762210738?i=1000673675955"
      }
    },
    {
      "id": "b9100fe3-794c-4520-a954-e602c614a71c",
      "title": "Men and young boys are affected by Christian Cults too! The hidden struggles of men in cults",
      "description": "Keywords\nChristian cults, gender dynamics, male victims, coercive control, healing journey, cult recovery, psychological impact, submission, accountability, identity\nSummary\nThis conversation explores the complex dynamics of gender within Christian cults, particularly focusing on the experiences of men. Richard Turner shares his personal journey of manipulation, control, and the psychological impact of being in a cult. He discusses the unrealistic expectations placed on men, the use of scripture to enforce submission, and the emotional turmoil that arises from gaslighting and coercive control. The dialogue emphasises the need for understanding and acknowledging the untold stories of male victims, as well as the importance of healing and self-discovery after leaving such environments.\nTakeaways\nMen in cults often face unrealistic expectations of perfection.Scripture can be weaponised to control both men and women.Gaslighting leads to deep emotional wounds and shame.The narrative around cults often omits male experiences of abuse.Healing involves understanding the dynamics of control and manipulation.Men may feel pressured to conform to harmful gender roles.The journey of recovery is ongoing and multifaceted.Supportive environments are crucial for healing from cult experiences.Education about cult dynamics aids in recovery and decision-making.Autistic individuals may be particularly vulnerable to cult manipulation.Titles\nThe Hidden Struggles of Men in CultsFinding Identity After Leaving a CultSound Bites\n\u0022I\u0027m a bad person for being a man.\u0022\u0022The really messed up thing about cultures.\u0022\u0022I was painted as like obsessive.\u0022",
      "release": "2024-10-12T12:00:22Z",
      "duration": "00:36:23",
      "explicit": false,
      "spotifyId": "5ATYXME2n9tpIZW4Zrln3n",
      "appleId": 1000672807275,
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Cult Recovery",
        "Evangelicalism",
        "C3 Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ATYXME2n9tpIZW4Zrln3n",
        "apple": "https://podcasts.apple.com/podcast/men-and-young-boys-are-affected-by-christian-cults/id1762210738?i=1000672807275"
      }
    },
    {
      "id": "5b6a125b-76e4-4a25-bbea-035cf5e7cc36",
      "title": "Why I left the Mormon Church: Racism, Stalking, Sexual Harassment \u0026 Sexism",
      "description": "Keywords\nMormonism, faith journey, cult, indoctrination, racial dynamics, family relationships, gender roles, spirituality, religious disaffiliation, personal growth\nSummary\nIn this conversation, Carla Santa Maria shares her journey from being a devout member of the Church of Jesus Christ of Latter-day Saints (Mormon Church) to recognising the cult-like behaviours within the organisation. She discusses her experiences with indoctrination, racial dynamics, family relationships, and the impact of gender roles on her life. Carla reflects on the challenges of leaving the church, the responses from the community, and her evolving beliefs about spirituality and a higher power. Ultimately, she emphasises the importance of sharing these experiences to help others who may be navigating similar faith journeys.\nTakeaways\nMormonism has a strong indoctrination system that shapes beliefs.Racial dynamics within the church can create a sense of conflict.Family relationships are often strained by church commitments.Leaving the church can lead to harassment from active members.Recognising cult-like behaviours is crucial for personal growth.Gender roles in Mormonism contribute to a culture of harassment.The church prioritises its reputation over individual well-being.Evolving beliefs can lead to a deeper understanding of spirituality.There is a sense of loneliness in religious disaffiliation.There is hope and light at the end of the tunnel for those leaving.Titles\nThe Hidden Truths of the Mormon FaithFinding a Higher Power Beyond MormonismSound Bites\n\u0022I pledge to give everything that I am.\u0022\u0022Mormonism is a cult.\u0022\u0022I didn\u0027t realise it was a punishment from God.\u0022",
      "release": "2024-10-05T12:00:25Z",
      "duration": "00:29:12",
      "explicit": false,
      "spotifyId": "5bVdO66NwVRs79RWAqhTvr",
      "appleId": 1000671862817,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5bVdO66NwVRs79RWAqhTvr",
        "apple": "https://podcasts.apple.com/us/podcast/why-i-left-the-mormon-church-racism-stalking-sexual/id1762210738?i=1000671862817"
      }
    },
    {
      "id": "b262fd87-9d36-4175-8451-dfd5a5b4052e",
      "title": "Donald Trump \u0026 The Mormon Vote: Ex-Mormon Carla Santamaria breaks down the Church\u0027s support for the Republican nominee",
      "description": "Keywords\nMormonism, politics, Donald Trump, Republican Party, personal beliefs, human rights, political activism, Kamala Harris, abortion rights, LGBTQ rights\nSummary\nIn this conversation, Sola and Carla Santamaria explore the complex relationship between Mormonism and politics, particularly in the context of the Republican Party and Donald Trump\u0027s presidency. They discuss the pressures within the Mormon community to align with certain political ideologies, the personal political evolution of individuals post-Mormonism, and the broader implications of the church\u0027s political stance on issues such as abortion and LGBTQ rights. The conversation highlights the struggle for personal beliefs against institutional pressures and the ongoing quest for justice and human rights.\nTakeaways\nThe exit from the Mormon church was traumatic for many.Mormonism has a significant influence on political alignment, especially with the Republican Party.There is a strong pressure within the Mormon community to support certain political candidates.Personal political beliefs can evolve significantly after leaving the church.The church\u0027s official stance on political neutrality is often contradicted by its members\u0027 actions.Issues like abortion and LGBTQ rights are central to the political discourse among Mormons.Many Mormons prioritize Supreme Court nominations over personal feelings about candidates.Activism and speaking out against injustice are core values for many ex-Mormons.The moral compass for political views often revolves around human rights.The conversation reflects a broader struggle for justice and ethical governance.Titles\nActivism and the Ex-Mormon ExperienceThe Future of Mormon Political EngagementSound Bites\n\u0022I left the Mormon church for the same reason that I stayed.\u0022\u0022I always come back to it.\u0022\u0022I think that one of the biggest issues that Mormons fight against is the rights of the LGBTQ plus community.\u0022",
      "release": "2024-09-28T12:03:32Z",
      "duration": "00:25:04",
      "explicit": false,
      "spotifyId": "4NwVcbrE24wJG9DfecUErL",
      "appleId": 1000671086186,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4NwVcbrE24wJG9DfecUErL",
        "apple": "https://podcasts.apple.com/us/podcast/donald-trump-the-mormon-vote-ex-mormon-carla/id1762210738?i=1000671086186"
      }
    },
    {
      "id": "faf99e17-6d41-4647-bdc3-bb3fc97f6593",
      "title": "The Bible was used to control and silence me, not anymore: Ruth\u0027s Story",
      "description": "Keywords Christian cults, scripture manipulation, faith journey, biblical literacy, spiritual abuse, church dynamics, personal growth, Ruth Conteh, cult experiences, safeguarding in churches Summary In this conversation, Ruth Conteh shares her personal journey of navigating through a Christian cult, the manipulation of scripture within such groups, and the impact it had on her faith. She discusses the gradual process of being drawn into a cult, the misuse of biblical texts for control, and the emotional and spiritual ramifications of such experiences. Ruth emphasizes the importance of biblical literacy, personal growth, and safeguarding within church communities, while also offering practical advice for those looking to rebuild their faith after trauma. Takeaways Ruth\u0027s experience in a cult was gradual and insidious. Scriptures are often manipulated to control and silence individuals. The analogy of the frog in boiling water illustrates cult dynamics. Many individuals in cults desire to please God, leading to manipulation. The scripture \u0027Touch not my anointed\u0027 is misused to silence dissent. Ruth emphasizes the importance of personal biblical study. Reinterpreting scripture can lead to healing and freedom. Safeguarding vulnerable individuals in church settings is crucial. Biblical literacy is a lifelong journey that requires effort. Buying a new Bible can help in rebuilding one\u0027s faith. Titles Scriptural Misuse: A Tool for Control Reclaiming Faith: A Journey of Healing Sound Bites \u0022I didn\u0027t even necessarily think that I was in a cult.\u0022 \u0022Touch not my anointed and do my prophet no harm.\u0022 \u0022I began to see God as a God that lacked justice.\u0022",
      "release": "2024-09-21T12:00:51Z",
      "duration": "00:34:12.2880000",
      "explicit": false,
      "spotifyId": "0kiRld3C7erW2HiL7gLSwR",
      "appleId": 1000670245500,
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0kiRld3C7erW2HiL7gLSwR",
        "apple": "https://podcasts.apple.com/us/podcast/the-bible-was-used-to-control-and-silence-me-not/id1762210738?i=1000670245500"
      }
    },
    {
      "id": "e1ba0ec9-1afb-4451-ac5d-c3620c349c59",
      "title": "Trying church again after more than a decade in a Christian cult: Chioma\u0027s Story",
      "description": "Keywords\ncult survivors, healing, therapy, Christianity, church, trauma, community, scripture, leadership, empowerment\nSummary\nIn this episode, Sola interviews Chioma Alade, a pastor and advocate for cult survivors, discussing the journey of healing and re-engagement with Christianity after experiencing a cult. They explore the importance of therapy, the common traits of cults, and the challenges faced by survivors in distinguishing between healthy churches and cult-like environments. Chioma shares her personal experiences and emphasizes the need for community support, self-awareness, and discernment in navigating new church environments. The conversation concludes with encouragement for those healing from cult experiences, highlighting the hope for a brighter future.\nTakeaways\nThe journey post-cult can be complex and challenging.Therapy is crucial for cult survivors to heal and differentiate experiences.Many survivors struggle to identify what constitutes a healthy church.Common experiences in cults include manipulation and control.Understanding the twisting of scripture is vital for discernment.Survivors often need to rebuild their sense of self and autonomy.Community support plays a significant role in recovery.It\u0027s important to address vulnerabilities that may lead to cult involvement.Deconstruction of past experiences is necessary for healing.There is hope for a fulfilling life after cult experiences.Titles\nFinding Hope After Cult ExperiencesThe Role of Community in Cult RecoverySound Bites\n\u0022I think I might want to try church again.\u0022\u0022Survivors would benefit from having a therapist.\u0022\u0022They were never actually in a real church.\u0022",
      "release": "2024-09-14T12:00:42Z",
      "duration": "00:41:27",
      "explicit": false,
      "spotifyId": "5wn9lEeY6J92dFX2PvYKOc",
      "appleId": 1000669528207,
      "subjects": [
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wn9lEeY6J92dFX2PvYKOc",
        "apple": "https://podcasts.apple.com/us/podcast/trying-church-again-after-more-than-a-decade-in/id1762210738?i=1000669528207"
      }
    },
    {
      "id": "ba965e9e-dac4-476c-868e-9a03e5159b15",
      "title": "Chloe\u0027s Story: The Evangelical Church Cult",
      "description": "Summary\nChloe shares her experience of being part of a Christian cult and the lasting impact it has had on her life. She discusses the shame and judgment she faced for being pregnant outside of marriage and the recurring nightmares she still experiences. The conversation explores the pressure to serve and the manipulation tactics used by the cult to control its members. Chloe reflects on the loss of family and friendships due to her involvement in the group. She also shares her journey of questioning her faith and distancing herself from organised religion. The episode emphasises the importance of self-awareness, creating safe spaces for others to share their experiences, and allowing time for healing and self-discovery.\nKeywords\nChristian cult, shame, judgment, pregnancy, nightmares, pressure to serve, manipulation, loss of family, loss of friendships, questioning faith, self-awareness, safe spaces, healing, self-discovery\nTakeaways\nChristian cults can exert control through shame and judgment, particularly regarding personal choices and relationships.The pressure to serve in a cult can be overwhelming, with members expected to dedicate excessive time and energy to the group.Involvement in a cult can lead to the loss of family and friendships outside of the group.Questioning one\u0027s faith and distancing oneself from organised religion can be a part of the healing process after leaving a cult.Creating safe spaces and being non-judgmental allows individuals to share their experiences and seek support.Self-awareness is crucial in recognising the impact of cult experiences and navigating the journey of healing and self-discovery.Titles\nCreating Safe Spaces for Sharing ExperiencesQuestioning Faith and Distancing from Organised ReligionSound Bites\n\u0022The idea that people would find her pregnant belly disgusting because she is a mother outside of wedlock and has had a baby with her partner, not her husband.\u0022\u0022Something else that I would like us to talk about is this idea of service.\u0022\u0022What place did friendship have? What place did family have in the midst of all of this?\u0022",
      "release": "2024-09-07T12:00:34Z",
      "duration": "00:24:45",
      "explicit": false,
      "spotifyId": "14CHUdUdN9bBUmkM25iNlr",
      "appleId": 1000668713229,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/14CHUdUdN9bBUmkM25iNlr",
        "apple": "https://podcasts.apple.com/us/podcast/chloes-story-the-evangelical-church-cult/id1762210738?i=1000668713229"
      }
    },
    {
      "id": "bbecaaac-83c3-48cd-9230-a3d1143945f5",
      "title": "The Gendered Consequences of Christian Cults for Women and Girls",
      "description": "Summary\nSigning a purity contract, promising not to have sex before marriage, when you aren\u0027t even old enough to consent to the act. Being branded with the stamp of promiscuity because you are taking the pill for your acne, and being unhealthily fixated on marriage as a teenager. This episode discusses the gendered consequences for women and girls that find themselves in Christian cults.\nThis conversation focuses on the experiences of a woman named \u0027Chloe\u0027 (her name and voice have been changed to keep her anonymous). The discussion highlights the victim-blaming and policing of women\u0027s bodies within these cults, as well as the subtle coercive control exerted by the leaders.The discussion also delves into the double standards and hypocrisy exhibited by these leaders, who promote purity culture while engaging in affairs themselves. \nThe gendered nature of Chloe\u0027s experience is evident in the emphasis on female sexuality, the pressure to conform to traditional gender roles, and the restriction of personal autonomy. The conversation concludes with advice for women currently in Christian cults; encouraging them to seek information, maintain communication with supportive individuals, prioritise their own well-being, and not dwell on lost time.\nKeywords\nChristian cults, gendered consequences, victim-blaming, policing, coercive control, double standards, purity culture, female sexuality, traditional gender roles, personal autonomy, advice\nTakeaways\nChristian cults often engage in victim-blaming and policing of women\u0027s bodies.Leaders in these cults exhibit double standards and hypocrisy.The gendered nature of the cult experience is evident in the emphasis on female sexuality and the restriction of personal autonomy.Women in these cults should seek information, maintain communication with supportive individuals, prioritise their well-being, and not dwell on lost time.Titles\nAdvice for Women in Christian CultsThe Restriction of Female Autonomy in CultsSound Bites\n\u0022It\u0027s our fault for wearing the wrong thing. It\u0027s our fault for being alone with a boy.\u0022\u0022They convince you to police yourself, your own thoughts, your own behaviour.\u0022\u0022I don\u0027t think as a child you can fully consent to celibacy. I think that\u0027s inappropriate.\u0022",
      "release": "2024-08-31T12:00:31Z",
      "duration": "00:30:25",
      "explicit": false,
      "spotifyId": "3n6etq9R9aFHVV7pZIunN7",
      "appleId": 1000667730748,
      "subjects": [
        "Cult Psychology",
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3n6etq9R9aFHVV7pZIunN7",
        "apple": "https://podcasts.apple.com/us/podcast/the-gendered-consequences-of-christian-cults-for/id1762210738?i=1000667730748"
      }
    },
    {
      "id": "08b79cce-a78f-446b-9f73-c2fbca61df10",
      "title": "The Psychology Of Cult Followers",
      "description": "Summary In this conversation, Richard, a cult recovery therapist and former member of a Bible-based cult, discusses the psychology of cult followers. He explains that people are often recruited and manipulated into cults, rather than knowingly joining them. Vulnerable individuals, such as students or those going through transition periods, are targeted by cults. Richard highlights the systematic process of manipulation that cults use to control their members, including suppressing their individuality and creating cognitive dissonance. He also discusses the psychological toll on cult members, the exit process, and the reconciliation of faith after leaving a cult. Takeaways People are often recruited and manipulated into cults, rather than knowingly joining them. Cults target vulnerable individuals, such as students or those going through transition periods. Cults use a systematic process of manipulation to control their members, including suppressing individuality and creating cognitive dissonance. Cult membership can have a severe psychological toll, leading to emotional suppression and identity issues. The exit process involves understanding and diagnosing the cult experience, learning about coercive control, and healing emotionally. Reconciling faith after leaving a cult involves deconstructing beliefs, realigning with healthier perspectives, and finding a personal and less intense connection to spirituality. Titles The Psychology of Cult Followers Recruitment and Manipulation in Cults. Sound Bites \u0022It\u0027s like you get a handshake from someone and then they hold your wrist and then they hold your elbow and then they\u0027ve got your whole arm and they\u0027ve got your shoulder and you\u0027re in a grip.\u0022 \u0022I ignored my gut feelings because of the other manipulation processes going on in the church, the love bombing especially, because it didn\u0027t feel bad, I dismissed and emotions are a key things in all of this.\u0022 \u0022People sometimes struggle to even understand what\u0027s real or not anymore. They have massive identity issues because the whole identity has been shaped by the cult and the cult leader.\u0022 Chapters 01:00Retaliation and Intervention After Leaving a Cult. 01:19Understanding the Recruitment and Manipulation into Cults 04:29Separation and Control of Cult Members 07:31The Mental Math of Committing to a Cult 09:36Changing Thoughts, Emotions, and Behaviours in Cults 14:49Shame and Guilt in Cult Survivors 19:54Rebuilding Faith and Identity After Exiting a Cult 24:27No Shame in Admitting Involvement in a Cult",
      "release": "2024-08-17T12:00:30Z",
      "duration": "00:32:11.9040000",
      "explicit": false,
      "spotifyId": "5oN9xIGDlb1Zkh5OdywvNg",
      "appleId": 1000665711316,
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5oN9xIGDlb1Zkh5OdywvNg",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-cult-followers/id1762210738?i=1000665711316"
      }
    },
    {
      "id": "04430ab9-41d4-484d-9c4a-c2973630eaa0",
      "title": "The Psychology Of Christ-Centred Cult Leaders",
      "description": "Summary In this episode, the psychology of Christ-centred cult leaders is explored. Cult leaders are often narcissistic or psychopathic individuals who have deep-seated insecurities and a poor sense of self. They may have unresolved trauma from childhood and seek to fulfill their own needs and desires through the establishment and control of a cult. Cult leaders often use spiritual language and manipulate biblical teachings to justify their control and gain the worship and adoration of their followers. Recovery for cult leaders is possible, but it requires acknowledging their actions, facing their past, and undergoing a significant amount of personal growth and healing. Takeaways Cult leaders are often narcissistic or psychopathic individuals with deep-seated insecurities and a poor sense of self. They may have unresolved trauma from childhood and seek to fulfill their own needs and desires through the establishment and control of a cult. Cult leaders manipulate spiritual language and biblical teachings to justify their control and gain worship and adoration from their followers. Recovery for cult leaders is possible, but it requires acknowledging their actions, facing their past, and undergoing personal growth and healing. Titles Recovery and Healing for Cult Leaders The Psychology of Christ-Centred Cult Leaders. Sound Bites \u0022Cult leaders are deeply insecure and have a poor sense of self.\u0022 \u0022Cult leaders wrap their coercive control in spiritual language.\u0022 \u0022Recovery for cult leaders requires acknowledging their actions and facing their past.\u0022 Chapters 01:40Introduction: Defining Cults and Exploring the Psychology of Cult Leaders 02:08The Insecurities and Control Motives of Cult Leaders 04:08The Spiritual Aspect of Cult Leaders: Masking Control with Religion 20:38Protecting Oneself from Harmful Leaders: Understanding Cult Psychology 33:33The Therapy Process and Client Work",
      "release": "2024-08-17T12:00:30Z",
      "duration": "00:39:29.8800000",
      "explicit": false,
      "spotifyId": "7rW9DUynU48tITw0aDLGms",
      "appleId": 1000665711349,
      "subjects": [
        "Cult Psychology",
        "Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7rW9DUynU48tITw0aDLGms",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-christ-centred-cult-leaders/id1762210738?i=1000665711349"
      }
    }
  ]
}