{
  "id": "edc073c1-e725-4f5e-8a55-e07004ee3312",
  "name": "In The Black Podcast",
  "spotifyId": "6VDhQHMormF1Rb4FCawelg",
  "appleId": 1779368143,
  "youTubeChannelId": "UCSk0kYeyzdfNipoxZntptyA",
  "episodes": [
    {
      "id": "708eeb2d-bfbb-474d-a0f4-b122a20ac06f",
      "title": "Episode 47: From Cult Survival to Spiritual Sovereignty: Isabella’s Journey to Healing and Freedom",
      "description": "Sixteen years ago, Isabella escaped a messianic cult after the tragic murder of her son. A crime meant to protect the cult leader from exposure as a predator and conman. In this deeply moving conversation, Isabella opens up about the years of trauma, mind control, and abuse she endured and the extraordinary path she’s taken to heal, reclaim her sovereignty, and help others break free from fear-based control systems.\nWe explore how she transformed unimaginable pain into purpose, the tools she uses to dismantle brainwashing and gaslighting, and her mission to help people live with optimal physical, mental, and spiritual health. Isabella’s courage and wisdom will inspire you to confront your own limiting beliefs, step into your power, and live as a sovereign being.\nIf you’ve ever faced abuse, manipulation, or deep loss and wondered if joy and freedom were still possible, this episode will remind you that healing is not only possible, it’s your birthright.\n\nWhere to Find Isabella:\n🌐 Website:⁠ www.feelingbetternaturally.love⁠\n📺 YouTube: ⁠Feeling Better Naturally⁠\n📰 Substack: ⁠Feeling Better Naturally⁠\n\n\nFollow for more stories: \n⁠@intheblackpassionproject⁠",
      "release": "2025-10-15T15:00:59Z",
      "duration": "01:29:27",
      "explicit": false,
      "spotifyId": "0B6jkq9jgEWb7WE8YTXwEm",
      "appleId": 1000732000869,
      "youTubeId": "XZYnjZPwXxs",
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0B6jkq9jgEWb7WE8YTXwEm",
        "apple": "https://podcasts.apple.com/podcast/episode-47-from-cult-survival-to-spiritual-sovereignty/id1779368143?i=1000732000869",
        "youtube": "https://www.youtube.com/watch?v=XZYnjZPwXxs"
      }
    }
  ]
}