{
  "_ts": 0,
  "id": "cac56d67-c899-411f-b3fb-dad0029c6cf9",
  "name": "In The News",
  "spotifyId": "5LdvU3hLoVFskuROWcP39t",
  "appleId": 1566625447,
  "episodes": [
    {
      "id": "32bbaae2-a2e2-411f-882a-c665cabb73c7",
      "title": "\u0027We believe in the healing power of God\u0027: How a religious sect in Australia left an eight-year-old girl to die",
      "description": "When the parents of eight-year-old Elizabeth Struhs stopped giving her the insulin she needed to control her diabetes, they thought God would cure her.\nAnd when the little girl slowly died in their home in the Australian city of Toowoomba they and other members of the Saints, a religious sect stood by waiting for her to rise from the dead.\nThe details that emerged at the trial in Queensland of the 14 members of the cult were harrowing. The court heard that the child’s father Jason Struhs finally called emergency services 36 hours after his daughter’s death, saying “though God would still raise Elizabeth, they could not leave a corpse in the house”.\nBoth Jason and her mother Kerrie Struhs were found guilty of manslaughter. The sect’s leader, Brendan Stevens was found guilty of manslaughter for encouraging the father to withhold insulin from his daughter in January 2022.\nThe Saints are a conservative Christian sect made up mostly of three families who believe in speaking in tongues and who reject modern medicine as “witchcraft”.\nThe 14 will be sentenced on February 11th.\nAndrew Messenger from the Guardian Australia details this tragic case.\nPresented by Bernice Harrison. Produced by Suzanne Brennan.\n\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-02-04T05:00:00Z",
      "duration": "00:20:53",
      "explicit": false,
      "spotifyId": "3P4XfaXNkzmIYLXMtm2Tbh",
      "appleId": 1000688763427,
      "subjects": [
        "The Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3P4XfaXNkzmIYLXMtm2Tbh",
        "apple": "https://podcasts.apple.com/podcast/we-believe-in-the-healing-power-of-god-how/id1566625447?i=1000688763427"
      }
    },
    {
      "id": "926f2973-37d4-4d0a-b22a-9ebde3c53489",
      "title": "Why Scientology gets refugees to work for free on the streets of Dublin",
      "description": "The Irish branch of the Church of Scientology has been going into an international protection asylum centre in Dublin and recruiting the refugees living there for all types of work, from cleaning parks to handing out anti-drug leaflets on the streets of the capital. The men are not paid, instead they are given a “certificate” which they are told will help them in their asylum applications. Many of the people strolling though Dublin who take a leaflet off one of these men will not be aware that it originates in the Church of Scientology. Irish Times reporters Sorcha Pollak and Conor Gallagher investigated this practice and they talked to some of the vulnerable men who felt taken in by the scheme. They explain to In the News. And why is Scientology – a very wealthy organisation with a tiny membership in Ireland – operating in this way? Presented by Bernice Harrison. Produced by John Casey Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-11-25T05:00:45Z",
      "duration": "00:26:32.5550000",
      "explicit": false,
      "spotifyId": "6KXLiuExiMH6RbJPsYnQk9",
      "appleId": 1000678118821,
      "subjects": [
        "Scientology",
        "_Ireland"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KXLiuExiMH6RbJPsYnQk9",
        "apple": "https://podcasts.apple.com/podcast/why-scientology-gets-refugees-to-work-for-free-on-the/id1566625447?i=1000678118821"
      }
    }
  ]
}