{
  "_ts": 0,
  "id": "55084101-0b40-4535-afd7-e4e5bebef8a1",
  "name": "INA Arditube",
  "youTubeChannelId": "UCNBD4uZG6nWH2MMdgGESisw",
  "episodes": [
    {
      "id": "cfcb6cee-adad-4e46-9ba0-856c14e69b34",
      "title": "Raël, le mouvement sectaire raëlien et les extraterrestres chez Thierry Ardisson | INA Arditube",
      "description": "Abonnez-vous http://bit.ly/InaArdiTube\nAutant En Emporte Le Temps | Antenne 2 | 18/06/1994\nThierry Ardisson reçoit Raël au sujet sa rencontre supposée avec les extra-terrestres, de sa vie consacrée à diffuser leur message et à collecter des fonds pour leur construire une ambassade. Pour lui, les extra-terrestres qu\u0027il a rencontrés sont des êtres humains comme nous, vivant sur une autre planète et qui auraient 25000 ans d\u0027avance technologique sur nous. Ce serait d\u0027ailleurs eux qui auraient amené la vie sur terre. Il n\u0027y aurait donc pas de Dieu et tout ce qui est écrit dans la Bible serait le message que ces extra-terrestres auraient voulu nous laisser. Ils viendront sur terre quand leur ambassade sera construite et la terre pacifiée. Leur venue interviendra au plus tard en 2035. Il raconte son voyage sur leur planète. Il réagit face aux articles qui le calomnient dans la presse. Il décrit l\u0027organisation de son mouvement, notamment sur le plan financier.\n\n\n****** info sur les commentaires ******\nSur les chaînes YouTube, vous êtes libre de donner votre opinion, fût-elle critique. Pour assurer la qualité du débat, nous vous demandons toutefois de toujours rester calme, poli et respectueux des autres commentateurs. Le prosélytisme, les propos grossiers, agressifs, irrévérencieux envers une personne ou un groupe de personnes sont proscrits. Tout commentaire insultant ou diffamant sera supprimé. Nous nous réservons le droit de bannir tout utilisateur qui ne respecterait pas les règles de la communauté.\n*******************************************************************\n\n\n\n\nImages d\u0027archive INA\nInstitut National de l\u0027Audiovisuel\nhttp://www.ina.fr\n#INA #Ardisson #Arditube",
      "release": "2020-11-24T16:00:10Z",
      "duration": "00:12:32",
      "explicit": false,
      "youTubeId": "cxbV53Ymtns",
      "subjects": [
        "Raëlism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cxbV53Ymtns"
      }
    }
  ]
}