{
  "id": "e4dd0492-0ff5-4f8d-bc2b-26aeb4af157b",
  "name": "IndiaTV News English",
  "youTubeChannelId": "UCd40cNBtOEqeWL2zz4HNSaQ",
  "episodes": [
    {
      "id": "7db9829f-c961-4bef-93d9-42773d6b2620",
      "title": "Epstein Files Released: Survivor Marina Lacerda Urges Full Transparency, Says \u0027Stop Redacting Names\u0027",
      "description": "The U.S. Department of Justice (DOJ) has begun releasing documents related to convicted sex offender Jeffrey Epstein, but many of the files remain incomplete, with numerous names redacted. The release of these files has sparked outrage, particularly from survivors like Marina Lacerda, who has publicly identified herself as one of Epstein\u0027s victims.\n\nLacerda, who was abused by Epstein starting at the age of 14, has been a vocal advocate for transparency and accountability. After reviewing the documents, she called for the DOJ to stop redacting names that don’t need to be hidden, stating, \u0022Just put out the files and stop redacting names that don\u0027t need to be redacted.\u0022 While the files provide further insight into Epstein\u0027s extensive network of powerful connections, the incomplete release leaves many questions unanswered. Lacerda and other survivors continue to demand full disclosure to ensure justice is served and to help the public better understand the full extent of Epstein\u0027s abuse. The release of these files comes after years of legal battles and public outcry. Survivors like Lacerda are pushing for a more open and transparent process to ensure that the truth is fully revealed.\n#epsteinfiles #epstein #departmentofjustice \n\nWelcome to India TV English News!\n\nThe place to find the latest breaking news, comprehensive analysis, and in-depth reporting from India and around the world. Real-time updates on politics, business, sports, entertainment, technology, and more are provided to keep you informed about the events that shape our world.\n\nWhy Subscribe?\n\nBreaking News: Get timely alerts on the most important news stories as they happen.\nExpert Analysis: Insightful commentary and expert opinions to help you understand complex issues.\nExclusive Interviews: Conversations with key newsmakers and influential figures.\nDiverse Coverage: From local stories to global events, we cover a wide spectrum of topics.\nEngaging Content: High-quality videos, live streams, and interactive discussions.\nJoin our community and never miss an update. Hit the subscribe button and click the bell icon to stay connected with India TV English News.\n\nStay informed, stay ahead.\n\n[Subscribe Now!]\n\nFollow us on social media for more updates:\n\nFacebook: https://www.facebook.com/IndiaTV/\nTwitter: https://x.com/indiatv\nWebsite: https://www.indiatvnews.com/",
      "release": "2025-12-20T21:00:49Z",
      "duration": "00:02:38",
      "explicit": false,
      "youTubeId": "jo8rqTJkczA",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jo8rqTJkczA"
      }
    }
  ]
}