{
  "_ts": 0,
  "id": "bd075040-1613-44f6-9052-e7005ae4baff",
  "name": "Infamous",
  "spotifyId": "389qIHRrnmIsktjaTxqMHa",
  "appleId": 1652941051,
  "episodes": [
    {
      "id": "ccec6c18-0d56-4824-b457-7622943a16d7",
      "title": "The Truth About Ruby Franke | 8 Passengers, Part 1",
      "description": "Stay-at-home mom Ruby Franke starts a YouTube channel, joining a popular niche of Mormon women sharing their lives online as mommy vloggers. While Ruby gains a following for her videos of the everyday life of a big Mormon family, we hear from Ruby\u0027s former neighbor, who sensed that something dark was going on in her home. Click ‘Subscribe’ at the top of the Infamous show page on Apple Podcasts or visit GetTheBinge.com to get access wherever you get your podcasts. A Campside Media \u0026 Sony Music Entertainment production. Find more great podcasts from Sony Music Entertainment at sonymusic.com/podcasts Learn more about your ad choices. Visit megaphone.fm/adchoices A Campside Media \u0026 Sony Music Entertainment production. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2024-06-13T05:00:00Z",
      "duration": "00:36:14.1190000",
      "explicit": true,
      "spotifyId": "0yvYJVrwcUTQnlhN2WbEz4",
      "appleId": 1000658665897,
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0yvYJVrwcUTQnlhN2WbEz4",
        "apple": "https://podcasts.apple.com/podcast/the-truth-about-ruby-franke-8-passengers-part-1/id1652941051?i=1000658665897"
      }
    },
    {
      "id": "a30b826e-8547-4080-bf22-5cf5aa994294",
      "title": "Justin Bieber’s Breathwork Santa",
      "description": "In the last decade, the “Iceman” Wim Hof has become a household name. Orlando Bloom to Oprah Winfrey have practiced his method, which includes daily cold plunges and hyperventilation breath work. But despite intense success, could Wim Hof be responsible for encouraging practices known to be dangerous—and even deadly? In this episode, Vanessa interviews investigative journalist Scott Carney, Wim’s former ghostwriter, who has been looking into deaths related to Wim’s method. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2024-02-15T06:00:00Z",
      "duration": "00:48:37.1460000",
      "explicit": true,
      "spotifyId": "5hnpSs0PORnqQPwdxynhmZ",
      "appleId": 1000645342360,
      "subjects": [
        "Wim Hof Method"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5hnpSs0PORnqQPwdxynhmZ",
        "apple": "https://podcasts.apple.com/podcast/justin-biebers-breathwork-santa/id1652941051?i=1000645342360"
      }
    }
  ]
}