{
  "id": "4badecee-d0d3-476d-bc19-039f9359ea93",
  "name": "Info-Cult",
  "youTubeChannelId": "UCatiJsg74rYkEmzc03lWmvg",
  "episodes": [
    {
      "id": "43bb1e6e-1e89-4346-ade2-bcb0334f620e",
      "title": "Presentation of Marie-Andrée Pelland and Mike Kropveld at the ICSA 2023 Annual Conference",
      "description": "Presentation of Marie-Andrée Pelland and Mike Kropveld at the ICSA 2023 Annual International Conference, in Louisville, Kentucky June 29- July 1, 2023\n\nIn 2023, Info-Cult celebrated 43 years of serving the public! Founded in Montreal (Quebec, Canada) in 1980, Info-Cult is a non-profit  organization that offers information and assistance about groups - their ideology, structure and functioning.\n\nThis presentation provides an overview of Info-Cult with regard to its conceptualization of religious, new religious, and cultic movements. The presenters discuss the circumstances surrounding the creation of the organization and how its perspective on cultic phenomena has evolved over time. They also highlight how the organization has developed an approach that goes beyond labels (cults, new religious movements, extremist, radical or coercive groups) in order to help people in  understanding their individual experiences in groups.",
      "release": "2024-02-15T15:59:37Z",
      "duration": "00:26:03",
      "explicit": false,
      "youTubeId": "8eOtoSkg_3s",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8eOtoSkg_3s"
      }
    },
    {
      "id": "5d6ea05f-5a09-43a7-b866-32c015d4c007",
      "title": "Meet the Author : Erika Bornman",
      "description": "In this interview with Erika Bornman, inaugural Dianne Casoni Award recipient, we discuss her book, Mission of Malice: My Exodus from KwaSizabantu (Penguin Random House, 2022), her upbringing in a South African evangelical mission, navigating news media, and much more.\nLearn more about the book here : https://www.penguinrandomhouse.co.za/book/mission-malice/9781776096237\n\nThe Dianne Casoni Award was formed to honour the memory of its namesake. Dianne was an important research collaborator and a board member of Info-Cult, a professor of criminology at the Université de Montréal, and a psychologist who worked closely with people who had lived in high-control groups. Learn more about the award here : https://infosecte.org/en/dianne-casoni-award/\n\nPresented by Info-Cult.\nWith thanks to\nGuest, Erika Bornman\nHost, Sam Downs\nMusic, “Street Walk” by Paolo Pavan",
      "release": "2023-05-20T17:00:21Z",
      "duration": "00:39:10",
      "explicit": false,
      "youTubeId": "gmAurqBEF88",
      "subjects": [
        "Evangelicalism",
        "Kwasizabantu"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gmAurqBEF88"
      }
    }
  ]
}