{
  "id": "4badecee-d0d3-476d-bc19-039f9359ea93",
  "name": "Info-Cult",
  "youTubeChannelId": "UCatiJsg74rYkEmzc03lWmvg",
  "episodes": [
    {
      "id": "1b0684fa-5a97-42ee-a18e-be995ab875d8",
      "title": "Marie andrée 9 septembre 2025",
      "description": "🎙️ Marie-Andree Pelland, présidente du conseil d’administration d’Info-Secte est intervenue sur le balado Point du Jour de Radio Canada à propos de Romana Didulo, la « reine du Canada » autoproclamée.\n\n➡️ Pour écouter la suite, rendez-vous sur ici.radio-canada.ca",
      "release": "2025-10-02T18:45:29Z",
      "duration": "00:02:28",
      "explicit": false,
      "youTubeId": "fZ2-PGDRLzU",
      "subjects": [
        "Romana Didulo",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fZ2-PGDRLzU"
      }
    },
    {
      "id": "8c523daa-3129-4591-9b80-626ca82f372a",
      "title": "What Makes Cult Members Vulnerable to Sexual Abuse?",
      "description": "This presentation will examine the sexual context of cults through the lens of coercive control and manipulation. Doni Whitsett will discuss the consequences experienced by victims/survivors and some ways to overcome the trauma. \n\nPresented by: \n\nDoni Whitsett (Ph.D., LCSW, Professor Emerita of Social Work, University of Southern California)\n\nand \n\nSam Downs (Intervention Support worker at Info-Cult)\n\nThanks to them for contributing to Victims and Survivors of Crime Week!\n \nMusic: Piano for Spring de Sonican (Pixabay) \n\nIf you or someone you know needs help, don\u0027t hesitate to contact us: https://infosecte.org/en/contacten/  \n\nYou can also find local support services by consulting the Victim Services Directory : https://www.canada.ca/en/office-federal-ombudsperson-victims-crime/services-services/directory-repertoire.html  \n\nN. B.: The question-and-answer period was not recorded.\n\n#genderbasedviolence #cultabuse #sexualviolence #cultawareness #cult #sexualabuse",
      "release": "2025-09-19T20:41:40Z",
      "duration": "00:40:58",
      "explicit": false,
      "youTubeId": "uLKIeCFRoUU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uLKIeCFRoUU"
      }
    },
    {
      "id": "4074b1c5-a56b-40ac-a4ef-9c754655f357",
      "title": "What is coercive control?",
      "description": "Presented by: \nAndrea Silverstone (CEO, Sagesse) \nCarrie McManus (Director of Innovation and Programs, Sagesse) and\nSam Downs (Intervention Support worker at Info-Cult)\n\nCoercive control is a manipulative pattern of behaviors designed to remove an individual’s sense of personal agency and autonomy. While it\u0027s commonly linked to domestic abuse, coercive control can also appear in workplaces, cultic contexts, and even within legal systems. By recognizing these signs and understanding the profound impact of coercive control, we can develop effective policies and support systems to safeguard individuals from psychological trauma and the erosion of their autonomy. This presentation explores the theory of coercive control, as well as how this concept may help break down barriers between different service providers for people impacted by abuse in multiple, overlapping contexts.\n\nMusic: Piano for Spring de Sonican (Pixabay)  \n\nIf you or someone you know needs help, don\u0027t hesitate to contact us: https://infosecte.org/en/contacten/  \n\nYou can also find local support services by consulting the Victim Services Directory : https://www.canada.ca/en/office-federal-ombudsperson-victims-crime/services-services/directory-repertoire.html  \n\nN. B.: The question-and-answer period was not recorded.",
      "release": "2025-09-18T14:25:56Z",
      "duration": "00:49:46",
      "explicit": false,
      "youTubeId": "DOim3ILAOmM",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DOim3ILAOmM"
      }
    },
    {
      "id": "d6f4b468-e243-4ab9-93c7-f001cd81534e",
      "title": "Comprendre le fonctionnement des groupes sectaires pour reconnaître les violences criminelles",
      "description": "Comprendre le fonctionnement des groupes sectaires pour reconnaître les violences criminelles et mieux intervenir. \n\nCette conférence vise à sensibiliser le public à propos du fonctionnement des groupes sectaires. La présentation permettra d’aborder les relations leader-adeptes, les différentes formes de contrôle et expériences d’emprises possibles au sein d’un groupe sectaire. Elle s’attardera autant aux réalités des personnes nées ou ayant grandi à l’intérieur d’un groupe que de celles des personnes l’ayant intégré à l’âge adulte. En conclusion, Mike explorera les services et les collaborations qui pourraient mieux prévenir la victimisation criminelle en contexte sectaire. \n\nCette formation vous a été donnée le 12 mai 2025 et présentée par :  \n\nMike Kropveld (directeur général et fondateur d\u0027Info-Secte) \n\net\n\nSam Downs (Intervenant en services d’aide pour Info-Secte)\n\nMusique : Piano for Spring de Sonican (Pixabay)  \n\n \nSi vous ou l\u0027un de vos proches avez besoin d\u0027aide, n\u0027hésitez pas à nous contacter : https://infosecte.org/contact/  \n\nVous pouvez également trouver des services de soutien locaux en consultant le Répertoire des services aux victimes : https://www.canada.ca/fr/bureau-ombudsman-federal-victimes-actes-criminels/services-services/repertoire-directory.html?fbclid=IwZXh0bgNhZW0CMTAAYnJpZBExdlVFV2Nxbk5ZY3ZSZVV2QgEeydxgi-___1NIea7kutB6wmKS47srWO7H_lhdH6dF-cIXiIKcDBZNEq-2JW4_aem_CQMi1fS8U2tg3e-11YMd3w \n\nN. B. : La période de questions-réponses n’a pas été enregistrée.",
      "release": "2025-09-12T13:37:36Z",
      "duration": "00:50:30",
      "explicit": false,
      "youTubeId": "pfO6-L3zz_w",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pfO6-L3zz_w"
      }
    },
    {
      "id": "5ab2c0f8-1317-4478-95c9-8ffc05a86d21",
      "title": "Life in Patriarchal Communities: Understanding Victimization",
      "description": "Presented by:\nMadeline Lamboley, Ph.D., Professor of Criminology at the Université de Moncton and Canada Research Chair in Sexual Violence, Prevention and Intervention\nand\nMarie-Andrée Pelland, Ph.D., Associate Professor of Criminology at the Université de Moncton and President of Info-Cult.\n \nThanks to them for contributing to Victims and Survivors of Crime Week!\n \nMusic: Piano for Spring de Sonican (Pixabay) \n\nIf you or someone you know needs help, don\u0027t hesitate to contact us: https://infosecte.org/en/contacten/  \n\nYou can also find local support services by consulting the Victim Services Directory : https://www.canada.ca/en/office-federal-ombudsperson-victims-crime/services-services/directory-repertoire.html  \n\nN. B.: The question-and-answer period was not recorded.",
      "release": "2025-08-07T11:40:42Z",
      "duration": "01:08:29",
      "explicit": false,
      "youTubeId": "EDXwJsTCwTs",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EDXwJsTCwTs"
      }
    },
    {
      "id": "65d84f36-e6c0-4358-949b-1c22b873c946",
      "title": "Gender and Criminal Violence in Cultic Contexts: The Experience of Former Members",
      "description": "Presented by:\n\nMarie-Andrée Pelland (Ph.D., associate professor of criminology at the Université de Moncton, and president of Info-Cult)\n\nand\n\nCéleste Goguen (master’s candidate in social sciences at the Université de Moncton)\n\nThanks to them for contributing to Victims and Survivors of Crime Week!\n\nMusic: Piano for Spring de Sonican (Pixabay)  \n\nIf you or someone you know needs help, don\u0027t hesitate to contact us: https://infosecte.org/en/contacten/  \n\nYou can also find local support services by consulting the Victim Services Directory : https://www.canada.ca/en/office-federal-ombudsperson-victims-crime/services-services/directory-repertoire.html  \n\nN. B.: The question-and-answer period was not recorded.",
      "release": "2025-08-05T11:32:50Z",
      "duration": "01:14:12",
      "explicit": false,
      "youTubeId": "bOQcLbhg5Mk",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bOQcLbhg5Mk"
      }
    },
    {
      "id": "d88762e7-1934-44f0-8931-23c58a74aa2b",
      "title": "Le genre et les violences criminelles vécues en contexte sectaire : l’expérience d’anciens membres",
      "description": "Cette formation vous a été donnée le 15 mai 2025 et présentée par :  \n\nMarie-Andrée Pelland (Ph.D., professeure agrégée de criminologie à l’Université de Moncton et présidente d’Info-Secte). \n\net \n\nCéleste Goguen (candidate à la maîtrise en sciences sociales à l’Université de Moncton) \n\nUn grand merci pour leur collaboration dans le cadre de la Semaine des victimes et survivants d’actes criminels !  \n\nMusique : Piano for Spring de Sonican (Pixabay)  \n\nSi vous ou l\u0027un de vos proches avez besoin d\u0027aide, n\u0027hésitez pas à nous contacter : https://infosecte.org/contact/  \n\nVous pouvez également trouver des services de soutien locaux en consultant le Répertoire des services aux victimes : https://www.canada.ca/fr/bureau-ombudsman-federal-victimes-actes-criminels/services-services/repertoire-directory.html?fbclid=IwZXh0bgNhZW0CMTAAYnJpZBExdlVFV2Nxbk5ZY3ZSZVV2QgEeydxgi-___1NIea7kutB6wmKS47srWO7H_lhdH6dF-cIXiIKcDBZNEq-2JW4_aem_CQMi1fS8U2tg3e-11YMd3w \n\nN. B. : La période de questions-réponses n’a pas été enregistrée.",
      "release": "2025-08-04T15:43:19Z",
      "duration": "01:11:39",
      "explicit": false,
      "youTubeId": "bYu5cBQrjb0",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bYu5cBQrjb0"
      }
    },
    {
      "id": "e4aeb862-e4f8-4ef6-9402-c4e0c410a411",
      "title": "Prix Dianne Casoni 2025 / 2025 Dianne Casoni Award",
      "description": "La lauréate du Prix International Dianne Casoni 2025 a été révélée lors de la cérémonie de clôture du congrès, organisée pendant le congrès annuel de l\u0027International Cultic Studies Association, du 2 au 5 juillet 2025 à Montréal. \n\nThe recipient of the 2025 Dianne Casoni International Award was announced during the closing ceremony of the International Cultic Studies Association Annual Conference, from July 2 to 5, 2025, in Montréal. \n\nVolet Vulgarisation / Popular Category : Sarah Patrick for her book: Binding Shame: Life Inside a Cult of Obedience\n\nPour plus d’informations : https://infosecte.org/laureats-du-prix-dianne-casoni/  \n\nFor more information: https://infosecte.org/en/dianne-casoni-award-recipients/",
      "release": "2025-07-31T18:16:54Z",
      "duration": "00:11:42",
      "explicit": false,
      "youTubeId": "zKOLXFmA-sk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zKOLXFmA-sk"
      }
    },
    {
      "id": "7def5012-6340-451c-a76f-37a47cf66261",
      "title": "Prix Dianne Casoni 2024 / 2024 Dianne Casoni Award",
      "description": "Les lauréats du Prix International Dianne Casoni 2024 ont été révélés lors de la cérémonie de remise des prix, organisée pendant le congrès annuel de l\u0027International Cultic Studies Association, du 3 au 6 juillet 2024 à Barcelone. Les interventions en espagnol ont été sous-titrées en anglais, et celles en anglais, en français. \n\nThe recipients of the 2024 Dianne Casoni International Award were announced during the award ceremony held at the International Cultic Studies Association Annual Conference, from July 3 to 6, 2024, in Barcelona. Speeches in Spanish were subtitled into English, and those in English were subtitled into French. \n\nVolet Scientifique / Scientific Category \n\nOmar Saldaña, Emma Antelo and Álvaro Rodríguez-Carballeira \nGroup Psychological Abuse Perpetration: Development and Validation of a Measure Using Classical and Modern Test Theory (Article paru dans le périodique Psychology of Violence / Article published in the journal Psychology of Violence) \n\nVolet Vulgarisation / Popular Category \n\nGillie Jenkinson \nWalking Free from the Trauma of Coercive, Cultic and Spiritual Abuse. A Workbook for Recovery and Growth (Routledge) \n\nPour plus d’informations : https://infosecte.org/laureats-du-prix-dianne-casoni/  \n\nFor more information: https://infosecte.org/en/dianne-casoni-award-recipients/",
      "release": "2025-02-17T20:18:47Z",
      "duration": "00:15:41",
      "explicit": false,
      "youTubeId": "caHnI6hS7p4",
      "subjects": [
        "Psychology",
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=caHnI6hS7p4"
      }
    },
    {
      "id": "43bb1e6e-1e89-4346-ade2-bcb0334f620e",
      "title": "Presentation of Marie-Andrée Pelland and Mike Kropveld at the ICSA 2023 Annual Conference",
      "description": "Presentation of Marie-Andrée Pelland and Mike Kropveld at the ICSA 2023 Annual International Conference, in Louisville, Kentucky June 29- July 1, 2023\n\nIn 2023, Info-Cult celebrated 43 years of serving the public! Founded in Montreal (Quebec, Canada) in 1980, Info-Cult is a non-profit  organization that offers information and assistance about groups - their ideology, structure and functioning.\n\nThis presentation provides an overview of Info-Cult with regard to its conceptualization of religious, new religious, and cultic movements. The presenters discuss the circumstances surrounding the creation of the organization and how its perspective on cultic phenomena has evolved over time. They also highlight how the organization has developed an approach that goes beyond labels (cults, new religious movements, extremist, radical or coercive groups) in order to help people in  understanding their individual experiences in groups.",
      "release": "2024-02-15T15:59:37Z",
      "duration": "00:26:03",
      "explicit": false,
      "youTubeId": "8eOtoSkg_3s",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8eOtoSkg_3s"
      }
    },
    {
      "id": "aa506f27-23e8-4f7c-ad87-af79eb348699",
      "title": "Rencontre avec l’autrice Lorraine Derocher",
      "description": "Dans cette entrevue avec Lorraine Derocher, nous discutons de son dernier ouvrage, «Ces enfants oubliés - Grandir dans une communauté sectaire» (Éditions de l\u0027Homme, 2022).\n\nLe sort des enfants au sein de communautés fermées et autoritaires est l’un des enjeux fondamentaux à la mission d’Info-Secte. Depuis de nombreuses années, il est également au cœur des travaux de recherche de Lorraine Derocher, en tant que sociologue des religions, mais aussi experte en intervention et en protection de la jeunesse en contexte sectaire.\n\nPlus sur le livre ici : https://editionshomme.groupelivre.com/products/cultes-religieux-ces-enfants-oublies\n\nPrésenté par Info-Secte, en collaboration avec Formations Syllabus.\nUn merci spécial à\nInvitée : Lorraine Derocher\nAnimation : Marie-Andrée Pelland\nMusique : “Beyond the Ice [Underscore]” par Magnus Moone",
      "release": "2023-06-01T19:00:24Z",
      "duration": "01:00:23",
      "explicit": false,
      "youTubeId": "YBkGpB4VdnQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YBkGpB4VdnQ"
      }
    },
    {
      "id": "5d6ea05f-5a09-43a7-b866-32c015d4c007",
      "title": "Meet the Author : Erika Bornman",
      "description": "In this interview with Erika Bornman, inaugural Dianne Casoni Award recipient, we discuss her book, Mission of Malice: My Exodus from KwaSizabantu (Penguin Random House, 2022), her upbringing in a South African evangelical mission, navigating news media, and much more.\nLearn more about the book here : https://www.penguinrandomhouse.co.za/book/mission-malice/9781776096237\n\nThe Dianne Casoni Award was formed to honour the memory of its namesake. Dianne was an important research collaborator and a board member of Info-Cult, a professor of criminology at the Université de Montréal, and a psychologist who worked closely with people who had lived in high-control groups. Learn more about the award here : https://infosecte.org/en/dianne-casoni-award/\n\nPresented by Info-Cult.\nWith thanks to\nGuest, Erika Bornman\nHost, Sam Downs\nMusic, “Street Walk” by Paolo Pavan",
      "release": "2023-05-20T17:00:21Z",
      "duration": "00:39:10",
      "explicit": false,
      "youTubeId": "gmAurqBEF88",
      "subjects": [
        "Evangelicalism",
        "Kwasizabantu"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gmAurqBEF88"
      }
    },
    {
      "id": "5d96950b-0358-4ffc-b4fa-3068155c1d53",
      "title": "Les violences basées sur l’honneur en contexte sectaire - Lamboley \u0026 Pelland",
      "description": "Présentation donnée lors du congrès annuel 2021 de l’International Cultic Studies Association (ICSA) par Marie-Andrée Pelland et Madeline Lamboley.\nTitre complet : « Les violences basées sur l’honneur en contexte sectaire : un concept pertinent»\n\nLes violences basées sur « l’honneur » sont le résultat d’un contexte global de patriarcat et d’inégalité des sexes pouvant entraîner des situations de violence. Celles-ci peuvent toucher de jeunes femmes ayant une connaissance limitée de leurs droits. La transgression des normes sexuelles ou de l’honneur peut survenir lorsqu’une femme tombe en amour, lorsqu’elle s’engage dans une relation extra-conjugale, lorsqu’elle demande le divorce, ou encore, lorsqu’elle souhaite choisir son propre mari. Aux yeux d’une communauté donnée, de telles situations peuvent dès lors justifier, voire normaliser le contrôle, les abus ou les actes de violence perpétrés à l’endroit de ces femmes. Bien que ces observations soient mieux connues dans un contexte migratoire des communautés culturelles, cette communication cherche à définir le sens et la portée de ce concept d’honneur en contexte sectaire. À l’aide d’exemples, elle examine ensuite les répercussions de ce concept sur le contrôle exercé sur les femmes au sein de différents groupes canadiens.\n\nMadeline Lamboley est professeure de criminologie au département de sociologie et de criminologie à l’Université de Moncton (Nouveau-Brunswick, Canada). La particularité de ses travaux réside dans la production de savoirs transversaux et intersectoriels qui sauront intéresser les différents milieux de pratique dont la clientèle inclut des femmes en situation de vulnérabilité.\nMarie-Andrée Pelland, PhD, est professeure agrégée et directrice du département de sociologie et de criminologie de l’Université de Moncton (Nouveau-Brunswick, Canada). Elle a obtenu son diplôme de 3e cycle de l’École de criminologie de l’Université de Montréal. Marie-Andrée est devenue la 5e présidente d’Info-Secte à la fin de juin 2022.",
      "release": "2022-08-10T14:42:56Z",
      "duration": "00:48:20",
      "explicit": false,
      "youTubeId": "uOAfkT4V-ME",
      "subjects": [
        "School of Philosophy and Economic Science"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uOAfkT4V-ME"
      }
    },
    {
      "id": "e6d806e4-819b-4b0b-9ebc-e7a09d130674",
      "title": "La victimisation en contexte sectaire - Pelland \u0026 Goguen",
      "description": "Présentation donnée lors du congrès annuel 2021 de l’International Cultic Studies Association (ICSA) par Marie-Andrée Pelland et Céleste Goguen.\nTitre complet : « La victimisation en contexte sectaire : Construire un portrait statistique de l’expérience de victimisation de membres et d’anciens membres canadiens »\nEn plus d’être peu nombreuses, les données canadiennes sur la victimisation en contexte sectaire ou religieux ne permettent pas de cerner adéquatement l’ampleur du phénomène parmi les différentes catégories d’individus potentiellement victimes : croyants, anciens membres, enfants nés dans ces groupes, etc. Cette présentation a donc pour premier objectif de visiter les différentes définitions de victimisation en contexte sectaire qui ont été recensées dans les écrits scientifiques à l’étude. Elle fera également une analyse comparative des différentes recherches et commissions d’enquête afin de dégager leurs stratégies de collecte de données visant à mesurer la victimisation subie par des enfants aux mains de différentes autorités religieuses. Enfin, elle traitera des impacts de ces travaux sur la compréhension du phénomène de victimisation en contexte religieux.\nMarie-Andrée Pelland, PhD, est professeure agrégée et directrice du département de sociologie et de criminologie de l’Université de Moncton (Nouveau-Brunswick, Canada). Elle a obtenu son diplôme de 3e cycle de l’École de criminologie de l’Université de Montréal. Marie-Andrée est devenue la 5e présidente d’Info-Secte à la fin de juin 2022.\nCéleste Goguen est étudiante à la majeure en criminologie à l\u0027Université de Moncton (Nouveau-Brunswick, Canada). Dans le cadre de son projet de fins d\u0027études, elle analyse la victimisation en contexte sectaire au Canada.",
      "release": "2022-08-10T14:40:31Z",
      "duration": "00:48:36",
      "explicit": false,
      "youTubeId": "lvSb3ydMUyw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lvSb3ydMUyw"
      }
    },
    {
      "id": "0a701d3c-79ac-49b2-b59e-e64a9ff08b73",
      "title": "Expériences de victimisations par des figures d\u0027autorités religieuses - Pelland \u0026 Thériault",
      "description": "Présentation donnée lors du congrès annuel 2021 de l’International Cultic Studies Association (ICSA) par Marie-Andrée Pelland et Christine Thériault.\n\nTitre complet: « Analyse d’expériences de victimisations par des figures d\u0027autorités religieuses dans les provinces de l’Atlantique (Canada) : Un silence systémique prolongé »\n\nLes provinces de l’Atlantique sont touchées depuis la fin des années 80 par plusieurs scandales d’allégations ainsi que par de nombreuses affaires impliquant la condamnation judiciaire de prêtres catholiques pour crimes sexuels. À l’aide d’une analyse de plus de 560 articles de journaux, de données issues de l\u0027Institut canadien d\u0027information juridique (CANLII) ou publiées par les diocèses de ces provinces, cette présentation vise à mieux cerner l’ampleur du phénomène de victimisation résultant d’abus perpétrés par des figures d’autorités religieuses dans ces provinces, entre 1989 et 2018. Les données présentées apportent un éclairage sur les stratégies déployées pendant plus de cinquante ans afin de protéger l’institution religieuse et les prêtres agresseurs, de même que sur les conséquences de ce silence institutionnel sur les victimes.\nMarie-Andrée Pelland, PhD, est professeure agrégée et directrice du département de sociologie et de criminologie de l’Université de Moncton (Nouveau-Brunswick, Canada). Elle a obtenu son diplôme de 3e cycle de l’École de criminologie de l’Université de Montréal. Marie-Andrée est devenue la 5e présidente d’Info-Secte à la fin de juin 2022.\nChristine Thériault est étudiante en droit à l\u0027Université de Moncton. Elle détient un baccalauréat avec majeure en criminologie.  Elle a complété son projet de recherche au baccalauréat sur l\u0027expérience de victimisation par des victimes d\u0027un prêtre catholique au Nouveau-Brunswick.",
      "release": "2022-08-10T14:35:25Z",
      "duration": "00:48:44",
      "explicit": false,
      "youTubeId": "eJ9Lyw-mxyo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eJ9Lyw-mxyo"
      }
    },
    {
      "id": "41cddebf-16ca-4417-beff-c0f59131c592",
      "title": "Le châtiment corporel des enfants en milieu protestant conservateur - Pacheco",
      "description": "Présentation donnée lors du congrès annuel 2021 de l’International Cultic Studies Association (ICSA) par Adriana Pacheco.\n\nCette communication traite du phénomène du châtiment corporel des enfants en tant que pratique liée à un cadre doctrinal chez les protestants conservateurs fondamentalistes. La présentation s’intéresse à quatre cas récents de dérives violentes au Québec, afin d’analyser les éléments qui entourent cette problématique, notamment la radicalisation de la doctrine, la méconnaissance des lois qui encadrent les pratiques punitives parentales, ainsi que l’emprise des pasteurs sur les membres des groupes religieux. Enfin, elle rend compte des difficultés d’intervention pour les organismes de protection de l’enfance.\n\nAdriana Pacheco, PhD (Criminologie, Université de Montréal), s’intéresse particulièrement à la violence envers les enfants en contexte religieux. Elle a mené des recherches sur le cas de l’Église Baptiste de Windsor et sur les pratiques punitives parentales auprès de quatre congrégations protestantes conservatrices québécoises. Elle a été rédactrice en chef de la revue Criminologie de 2007 à 2012. Elle est membre d’Info-Secte depuis 2013.",
      "release": "2022-08-10T14:32:20Z",
      "duration": "00:23:57",
      "explicit": false,
      "youTubeId": "rVoATM1VgTU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rVoATM1VgTU"
      }
    },
    {
      "id": "a2473ab9-c692-45d3-b35e-ed6d51f97b0d",
      "title": "Institutional Silence on Sexual Violence - Goguen \u0026 Pelland",
      "description": "Presentation for the 2022 International Cultic Studies Association conference by Céleste Goguen and Marie-Andrée Pelland.\n\nFull title: “Institutional Silence on Sexual Violence: Analysis of Strategies Used by Organizations and Cultic Groups to Keep the Victims Silenced and Protect their Reputations”\n\nAnalysis of public reports of sexual abuse in religious organizations, universities, sports organizations, and cultic groups to identify institutional strategies used to silence and isolate victims. With comparisons between the different internal abuse-reporting and resolving processes, to identify strategies used by institutions to keep matters hidden from the public and discuss best practices to prevent sexual abuse in organizational settings.\n\nMarie-Andrée Pelland, PhD, is Professor and Director of the Department of Sociology and Criminology at the Université de Moncton (New Brunswick, Canada). She received her Doctorate from the School of Criminology of the Université de Montréal. Marie-Andrée also became Info-Cult’s 5th President at the end of June 2022.\n\nCéleste Goguen is pursuing a Master’s degree in social science at the Université de Moncton (New Brunswick, Canada) with a major in criminology.  As part of her final project, she is analyzing victimization in cultic environments in Canada.",
      "release": "2022-08-10T14:27:18Z",
      "duration": "00:52:51",
      "explicit": false,
      "youTubeId": "oRjKza3EB_o",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oRjKza3EB_o"
      }
    },
    {
      "id": "d11f35c4-5981-4eec-af35-724e9a668ffd",
      "title": "Recognizing and coping with coercive control in religious cultic groups - Goguen \u0026 Pelland",
      "description": "Presentation for the 2022 International Cultic Studies Association (ICSA) conference by Céleste Goguen and Marie-Andrée Pelland.\n\nFull title: “Former members\u0027 process of recognizing and coping with experience of coercive control in religious cultic groups”\n\nAnalysis of the process by which former members recognize and name experiences of control, abuse and violence during their life within a religious cultic group after having left the group, as well as the forms of help or services contacted to cope with the recognized victimization.\n\nCéleste Goguen is pursuing a Master’s degree in social science at the University of Moncton with a major in criminology.  As part of her final project, she is analyzing victimization in cultic environments in Canada.\n\nMarie-Andrée Pelland, PhD, is Professor and Director of the Department of Sociology and Criminology at the Université de Moncton, New Brunswick, Canada. She is also Vice President of Info-Cult. She received her Doctorate from the School of Criminology of the Université de Montréal.",
      "release": "2022-08-10T14:22:25Z",
      "duration": "00:41:46",
      "explicit": false,
      "youTubeId": "155RpVf5eNw",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=155RpVf5eNw"
      }
    },
    {
      "id": "0548b235-e55c-4168-97a9-b73a9273fcad",
      "title": "Au delà des mirages (1993)",
      "description": "Cette vidéo éducative destinée à sensibiliser les jeunes aux phénomènes sectaires fut utilisée au Canada et aux États-Unis à des fins pédagogiques.\nAnnée de production : 1993\nProduction : Info-Secte\nRéalisation : Jorge Martinez\nDistribution : Vidéographe\n\nDescription originale de la vidéo :\nLa vidéocassette a été conçue comme un outil de sensibilisation au phénomène sectaire. Bien que la plupart d\u0027entre nous ayons une petite idée de ce qu\u0027est une secte, nous ne connaissons pas toujours l\u0027ampleur du phénomène sectaire ni ses implications à la fois sur les adeptes et sur la société en général. Cette vidéocassette s\u0027adresse à tous et particulièrement aux jeunes, cible privilégiée du recrutement des sectes. Elle pourra servir de complément d\u0027information à la fois aux intervenants, aux différents professionnels qui doivent faire face à ce phénomène ainsi qu\u0027aux enseignants de différents niveaux. Enfin, elle s\u0027adresse à tous ceux qui veulent en savoir plus sur la question. A travers le témoignage de deux ex-adeptes de sectes différentes (l\u0027une de type oriental et l\u0027autre de type millénariste) et les explications de M. Mike Kropveld, directeur général d\u0027Info-Secte, et de M. Yves Casgrain, ex-directeur de la recherche, le spectateur pourra revivre en partie le cheminement qui conduit une personne à adhérer à une secte puis, un jour, à s\u0027en dissocier. La vidéo privilégie le témoignage personnel afin de sensibiliser le public aux facteurs qui rendent les gens vulnérables aux discours de sectes. Au-delà des Mirages se veut un document à la fois éducatif et préventif. (1993) Pour en savoir plus : www.infosecte.org",
      "release": "2022-07-20T15:43:12Z",
      "duration": "00:23:44",
      "explicit": false,
      "youTubeId": "JgGAV4jPBFQ",
      "subjects": [
        "Cult-Expert",
        "School of Philosophy and Economic Science"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JgGAV4jPBFQ"
      }
    },
    {
      "id": "2ab8a53d-69c4-490f-82fd-c1536f713b3a",
      "title": "Beyond the Mirage (1994)",
      "description": "Educational video raising youth awareness of cultic phenomena, for pedagogical use in Canada and the United States.\nProduced in 1994 by Info-Cult, directed by Jorge Martinez, and distributed by Vidéographe.\n\nOriginal description:\nBeyond the Mirage was created to raise awareness about the cult phenomenon. Though most of us have some vague idea of what a cult is, we do not always know the extent of cults nor their impact on members and society in general. Beyond the Mirage examines two cults, one with an Eastern approach and another that is apocalyptic. Through the stories of former cult members, the viewer will gain insight into what leads a person to join a cult and then eventually leave. Mike Kropveld, Executive Director of Info-Cult, and Linda James, psychologist and professor at Vanier College in Montreal, are also interviewed on their experience with and analysis of cultic thinking. This video was made for the general public with a special focus on young people who are often the target of cult recruitment. It can be useful in providing information to community workers, professions, teachers and anyone who would like to know more about the issue. Beyond the Mirage is both an education and preventive tool to sensitize the viewer to what makes people vulnerable to cults. (1994) For more information: www.infocult.org",
      "release": "2022-07-20T15:43:01Z",
      "duration": "00:21:37",
      "explicit": false,
      "youTubeId": "GViYtElwLjA",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GViYtElwLjA"
      }
    }
  ]
}