{
  "_ts": 0,
  "id": "0f3866f6-8c78-422b-ab39-833225be707f",
  "name": "Informed Dissent",
  "spotifyId": "27hFAfvIxibgYDPy1Hw6bb",
  "appleId": 1588306974,
  "episodes": [
    {
      "id": "bb70d5e2-b36a-4e63-9db3-f06616ffa2f3",
      "title": "Episode #191 Hoyt Richards",
      "description": "Back again with Hoyt Richards, Award-winning actor/writer/filmmaker and Founder/CEO of Tortoise Entertainment. Originally from the main line area outside of Philadelphia, Hoyt was a scholar-athlete who graduated from Princeton with a BA in Economics, where he also played football. In his early career, Hoyt worked as a fashion model for the Ford and Wilhelmina agencies and is considered to be the world\u0027s first male supermodel. Over his fifteen-year career, Hoyt was the face of numerous campaigns for the industry’s top designers, and he appeared in over three hundred commercials. In 2000, Hoyt moved from New York to Los Angeles where he began working as an actor and now has over forty films to his credit. Expanding his skill set to include directing, screenwriting, editing and producing, Hoyt created his own production company, Tortoise Entertainment, in 2010. With Tortoise, Hoyt has produced two award-winning feature films. Dumbbells, a buddy comedy set in the gym, and Intersection, a psychological, romantic thriller. Hoyt is also a cult survivor. He has been speaking publicly about the dangers and the lessons learned from his experience of cultic and abusive environments for over two decades. And he assists families and individuals who have loved ones caught in cultic situations. Currently, Hoyt is co-hosting and producing a podcast series called WhaTheFlok, where he interviews other cult survivors and can be found on all major streaming platforms. In addition, Hoyt is developing a scripted TV series that chronicles his twenty-year journey into the Eternal Values religious cult and his subsequent escape and recovery. Also, he is writing a memoir, Picture Perfect, which chronicles his journey through the cult years and after while living a double life as one of the world’s top fashion models. You can follow Hoyt on IG at @HoytRich Show sponsored by RogersHood.com, use code IDM for 10% off! Support the show For more Informed Dissent visit our website at Informed Dissent Media Follow us on Social media @InformedDissentMedia",
      "release": "2024-11-29T17:00:00Z",
      "duration": "00:43:27.5420000",
      "explicit": false,
      "spotifyId": "0J0ItnLtRnam7uHW7oAQOS",
      "appleId": 1000678655442,
      "subjects": [
        "Eternal Values",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0J0ItnLtRnam7uHW7oAQOS",
        "apple": "https://podcasts.apple.com/podcast/episode-191-hoyt-richards/id1588306974?i=1000678655442"
      }
    }
  ]
}