{
  "id": "a212d5de-e7cf-4f99-a545-2903b9e917a3",
  "name": "Inner Source - Healing from Toxic Abuse",
  "spotifyId": "099EyQn1y8eEIDEMnBGxJx",
  "appleId": 1538055123,
  "episodes": [
    {
      "id": "e500daa8-1936-4dd4-b7de-86fc93a607e5",
      "title": "50. The Stages of Manipulation: The Similarities Between Cults and Toxic Relationships",
      "description": "In this episode of \u0022Healing From Toxic Abuse,\u0022 we explore the chilling similarities between the tactics used by cults and those employed in toxic and controlling relationships. This discussion revolves around the stages of brainwashing and manipulation that both cults and abusive partners employ to gain control over their victims.We explore how the brainwashing techniques used by cults to recruit and retain members closely resemble the tactics used by abusive partners to assert dominance and maintain power in their relationships. From love-bombing and idealization to guilt-tripping and gaslighting, we break down the common stages of manipulation and discuss how they can lead to a sense of helplessness and entrapment.  We also touch on the importance of recognizing the warning signs of brainwashing and manipulation and how individuals can empower themselves to break free from these toxic patterns. We highlight suggestions for those who have experienced emotional abuse or have been involved in cult-like situations.  Tune in to this insightful episode to learn more about the striking parallels between cult brainwashing and abusive relationships, and how to reclaim your power and heal from toxic abuse.  #brainwashing #cults #manipulation #toxicrelationships",
      "release": "2024-02-06T22:32:03Z",
      "duration": "00:39:12.6450000",
      "explicit": false,
      "spotifyId": "5mVuhn0StGWCQxC1PT2DmM",
      "appleId": 1000644411738,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5mVuhn0StGWCQxC1PT2DmM",
        "apple": "https://podcasts.apple.com/podcast/50-the-stages-of-manipulation-the-similarities/id1538055123?i=1000644411738"
      }
    }
  ]
}