{
  "_ts": 0,
  "id": "6b9eae73-527a-4807-a0b4-2cf1272180aa",
  "name": "Inside Edition",
  "youTubeChannelId": "UC9k-yiEpRHMNVOnOi_aQK8w",
  "episodes": [
    {
      "id": "62b53571-6864-4da8-90c7-5aead4c9e65a",
      "title": "‘Doomsday Mom’ Lori Vallow Says She Will Be Exonerated",
      "description": "Lori Vallow Daybell is speaking out in her first TV interview. She\u0027s the notorious woman convicted of killing her two children and running off to Hawaii with her new husband, Chad Daybell. The woman is now serving life in prison for the murder of two of her children. She was interviewed by \u0022Dateline\u0022 NBC\u0027s Keith Morrison. From her prison in Arizona, she insists that she and her husband will soon be walking free.",
      "release": "2025-03-05T22:31:45Z",
      "duration": "00:01:50",
      "explicit": false,
      "youTubeId": "8psQWKU1Gwg",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8psQWKU1Gwg"
      }
    },
    {
      "id": "95358768-5a5a-406f-b3e0-3d8e5d9766a5",
      "title": "Police Bodycam Video Shows Cops Raiding Ruby Franke\u0027s Home",
      "description": "Newly released police bodycam video shows armed cops raiding the home of “8 Passengers” mom Ruby Franke to uncover horrific child abuse. Paramedics were moved to tears by what they found inside their multi-million home. A traumatized child sat motionless in a closet undernourished and too terrified to talk. He was treated by paramedics at the scene. As handcuffs closed over Franke\u0027s wrists, her brutal reign of terror came to an abrupt end.",
      "release": "2024-03-22T22:42:45Z",
      "duration": "00:02:13",
      "explicit": false,
      "youTubeId": "2eFKeMpahXM",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2eFKeMpahXM"
      }
    },
    {
      "id": "ec11a2ae-c84d-4cd5-845f-932b466fef83",
      "title": "7 ‘Soldiers of Christ’ Charged With Murder of Korean Woman",
      "description": "A Korean community in Georgia is in shock after a woman’s emaciated body was found in the trunk of a car in September. Six adults and one teen of Korean descent are now facing charges that include murder, false imprisonment, and concealing the death of another. Many in the community say this crime is not representative of who they are. Inside Edition Digital’s Mara Montalbano has more.",
      "release": "2024-01-09T00:09:58Z",
      "duration": "00:01:29",
      "explicit": false,
      "youTubeId": "jBR-Vh4ybCs",
      "subjects": [
        "Soldiers of Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jBR-Vh4ybCs"
      }
    },
    {
      "id": "655e9727-1228-4fd7-b4fa-8666077a8b31",
      "title": "Manson Family Member Freed From Prison After 53 Years",
      "description": "Former Manson Family member Leslie Van Houten walked free from prison after serving 53 years of a life sentence. Van Houten was 19 when she took part in the Tate-LaBianca killing spree under Charles Manson. The cult leader targeted Los Angeles grocery store tycoon Leno LaBianca and his wife, Rosemary, and his followers brutally stabbed them to death. Van Houten admitted to holding down Rosemary as she begged for her life. Her release comes after a state appeals court ruled that Van Houten should be granted parole.",
      "release": "2023-07-11T21:52:46Z",
      "duration": "00:01:32",
      "explicit": false,
      "youTubeId": "nu-fLAhuQxE",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nu-fLAhuQxE"
      }
    },
    {
      "id": "59300e96-31b5-4ff0-a546-8030e9b36497",
      "title": "Lori Vallow Daybell Found Guilty of Killing Her 2 Kids",
      "description": "\u0022Doomsday Mom\u0022 Lori Vallow Daybell was found guilty of killing her children, 7-year-old JJ and 16-year-old Tylee. She was also found guilty of conspiracy to murder her husband\u0027s ex-wife. JJ and Tylee disappeared in September 2019. Five months later, Daybell and her husband, Chad Daybell, were in Hawaii when police served her with papers ordering her to produce the children to authorities. Six months later, the children\u0027s bodies were found buried on Chad Daybell\u0027s Idaho property. Chad Daybell has denied any wrongdoing.",
      "release": "2023-05-12T21:53:08Z",
      "duration": "00:03:03",
      "explicit": false,
      "youTubeId": "xYt335Tn9uY",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xYt335Tn9uY"
      }
    },
    {
      "id": "7d38a136-fa8f-439b-b2bf-d3abcd402531",
      "title": "A Look Back at the Waco Siege 30 Years Later",
      "description": "An upcoming Showtime drama series, \u0022Waco: The Aftermath,\u0022 explores what happened in the wake of the tragedy. It\u0027s been 30 years since the standoff between armed members of the Branch Davidian cult, led by the self-appointed prophet, David Koresh, and federal agents. The tragedy ended with 86 people killed, including 28 children. To this day, what started the final conflagration after the 51-day standoff remains in dispute.",
      "release": "2023-04-16T12:01:59Z",
      "duration": "00:02:24",
      "explicit": false,
      "youTubeId": "1VWJuPTqtWQ",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1VWJuPTqtWQ"
      }
    },
    {
      "id": "e1b303c8-60c4-4e22-a1cf-4f579313f67e",
      "title": "Jinger Duggar Says Her Childhood Was ‘Cult-Like’",
      "description": "Jinger Duggar was one of the \u002219 Kids and Counting\u0022 clan who grew up on TV. She is the sixth oldest of the 19 Duggar children. However, she now likens her childhood to a cult. She says her husband, Jeremy Vuolo, had to fill out a 50-page questionnaire to get permission to date her with chaperones. Now, Jinger is 29 and married with two children in Los Angeles. Her newly published memoir \u0022Becoming Free Indeed: My Story of Disentangling Faith from Fear\u0022 is already a best-seller.",
      "release": "2023-02-02T13:28:55Z",
      "duration": "00:01:42",
      "explicit": false,
      "youTubeId": "zcF8Xe_Nuq8",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zcF8Xe_Nuq8"
      }
    },
    {
      "id": "88c1e761-1b40-42f6-b1ff-950771a65518",
      "title": "Never-Before-Seen Footage of 1993 Jeffrey Dahmer Interview",
      "description": "Inside Edition is opening its archives to share never-before-seen video of our 1993 interview with Jeffrey Dahmer. A new generation is learning about the convicted serial killer’s horrifying crimes through the Netflix series “Dahmer – Monster: The Jeffrey Dahmer Story.” The world exclusive interview took place at a maximum security prison where Dahmer was serving a 999-year sentence. The then 33-year-old told Inside Edition’s Nancy Glass about his motives for killing 17 men.",
      "release": "2022-10-06T22:28:13Z",
      "duration": "00:02:32",
      "explicit": false,
      "youTubeId": "4QTTDmqc_3E",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4QTTDmqc_3E"
      }
    },
    {
      "id": "0848e621-8cb8-4bc2-87d3-fcbd285a303d",
      "title": "Wife of Supreme Court Justice Was in a Cult",
      "description": "Virginia “Ginni” Thomas, wife of Supreme Court Justice Clarence Thomas, has been outspoken about her interest in the QAnon and her belief that the election was stolen from Donald Trump. As newly unearthed footage showed Mrs. Thomas — who said she attended Donald Trump’s “Stop The Steal” rally on Jan. 6 before it turned violent — speaking about her departure from the now-defunct Lifespring, experts are wondering if her past is what informed her controversial viewpoints today.",
      "release": "2022-04-06T16:00:55Z",
      "duration": "00:01:57",
      "explicit": false,
      "youTubeId": "e3Qo1fScIlQ",
      "subjects": [
        "Qanon",
        "Lifespring"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e3Qo1fScIlQ"
      }
    },
    {
      "id": "340ec6dc-fb6a-49b7-8b37-3de3fa9418ed",
      "title": "Heaven’s Gate Cult Member Recalls Bizarre House Rules",
      "description": "This month marks the 25th anniversary of the Heaven\u0027s Gate mass suicide. Thirty-nine members of the bizarre cult led by Marshall Applewhite all took their own lives, making it one of the largest mass suicides in U.S. history. Survivor Jana Gibbons was a vulnerable 16-year-old girl when she moved into the mansion. Newly released home video shows inside the cult, where every minute was controlled, including when and how they slept, how long they showered and rules about not talking.",
      "release": "2022-03-11T22:42:06Z",
      "duration": "00:02:13",
      "explicit": true,
      "youTubeId": "CrdQNh6bNco",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CrdQNh6bNco"
      }
    },
    {
      "id": "fde26506-ddae-4424-8b25-b90f620a4685",
      "title": "Deputies Find Mummified Body of Alleged Cult Leader",
      "description": "Authorities released bodycam video of their discovery of the mummified remains of an alleged cult leader. The Saguache County Sheriff’s Department says Amy Carlson’s body was found wrapped in a sleeping bag and decorated with Christmas lights back in April. She was the leader of Love Has Won based in Moffat, Colorado. Reports say a group member told authorities a dead body was in the house where Carlson and other members lived. Inside Edition Digital’s Mara Montalbano has more.",
      "release": "2021-10-19T17:42:13Z",
      "duration": "00:01:38",
      "explicit": false,
      "youTubeId": "lX_e0BamqHs",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lX_e0BamqHs"
      }
    },
    {
      "id": "490d32eb-3814-4afc-a290-d8336d82edf1",
      "title": "Growing Up in a Cult Made for a Strange Childhood",
      "description": "Inside Edition Digital’s Sal Bono has been following the career of Mikel Jollett and his band, Airborne Toxic Event, for years. But until he read Jollett’s memoir, “Hollywood Park,” he had no idea of the singer’s extraordinary childhood. Jollett’s parents were part of a group called Synanon, which many people consider to be a cult. According to Sal, “Considering how chaotic and wildly insane his childhood upbringing was inside the Synanon walls, Jollett\u0027s done really well for himself.”",
      "release": "2021-09-05T14:03:28Z",
      "duration": "00:06:57",
      "explicit": false,
      "youTubeId": "URs23sMeum4",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=URs23sMeum4"
      }
    },
    {
      "id": "c10eb958-9f93-4354-870e-ff41643b7118",
      "title": "Polygamist With Family of 39 Wives and 94 Children Dies",
      "description": "A man who led one of the world’s largest families died earlier this week. Ziona Chana lived in Northeast India with his 39 wives, 94 children, and 33 grandchildren. They all dwelled together in a massive, 100-room purple-pink building in a remote village. Reportedly, the family’s unusual structure made them something of a tourist attraction. The 70-something Ziona was head of a Christian group that allowed polygamy. The Chana Pawl sect was founded by Ziona’s grandfather in 1942. #InsideEdition",
      "release": "2021-06-16T18:03:21Z",
      "duration": "00:01:18",
      "explicit": false,
      "youTubeId": "JIyMgazxs7o",
      "subjects": [
        "Ziona"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JIyMgazxs7o"
      }
    },
    {
      "id": "460a1504-4fff-424d-bf99-14029509fbce",
      "title": "Cult Leaders Created Nicknames Based on ‘The Sound of Music’",
      "description": "One of the most notorious cult leaders in American history, Marshall Applewhite, was known to his followers as “Do.” Now, never before seen footage shows Bonnie Nettles, who went by “Ti\u0022 and recruited Applewhite into the leadership ranks. All these years later, we are learning that the cult leaders called themselves “Do” and “Ti” because they were huge fans of the film “The Sound of Music.” Inside Edition spoke with Clay Tweel, director of the docuseries, “Heaven’s Gate: The Cult of Cults.” #InsideEdition",
      "release": "2021-02-01T23:54:11Z",
      "duration": "00:01:59",
      "explicit": false,
      "youTubeId": "EVO3mDlzAWA",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EVO3mDlzAWA"
      }
    },
    {
      "id": "bb983802-85c3-4e96-a7e7-372eaf2a1ced",
      "title": "How \u0027Cult\u0027 Splintered From Catholic Church Operated",
      "description": "Patricia Chadwick grew up in the Boston-based Slaves of the Immaculate Heart of Mary, a community that splintered from the Catholic Church and was founded by a priest named Leonard Feeney. Over time, the group grew stricter and its control over its members’ lives expanded. Chadwick told Inside Edition Digital, “My father used to love to sing songs to us, and that was all gone. We now lived a life very much in silence.” She recounts her life with the group in her new book, “Little Sister.” #InsideEdition",
      "release": "2020-11-27T14:51:23Z",
      "duration": "00:04:28",
      "explicit": false,
      "youTubeId": "BPi69QP10dQ",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BPi69QP10dQ"
      }
    },
    {
      "id": "00909b60-c9aa-48dd-9cc1-51dad6142572",
      "title": "How This Famous Musician Escaped the Synanon Cult as a Child",
      "description": "Mikel Jollett has found fame fronting the acclaimed rock and roll band The Airborne Toxic Event. Though the singer and songwriter has had many bright spots in his life, his past is darker, as he tells his story of being raised inside a cult. Jollett, who released his bestselling memoir, “Hollywood Park,” earlier this year, detailed how he was raised inside the Synanon cult until he, his brother and biological mother escaped to live with his grandparents in Oregon. #InsideEdition",
      "release": "2020-11-14T11:23:29Z",
      "duration": "00:04:38",
      "explicit": false,
      "youTubeId": "cUkSEj1C4Kw",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cUkSEj1C4Kw"
      }
    },
    {
      "id": "08167735-badb-4087-9000-b453c70f3165",
      "title": "How to Get Someone Out of a Cult",
      "description": "Cults, conspiracy theories and fringe belief systems have always been around, and Joe Szimhart’s job is to help people out of them. Szimhart is a cult interventionist and has been working in the field since the 1980s, when he left a harmful group. “The leaders didn’t seem to be living according to the strict code of ethics,” he said. Ever since, he has been helping others find information, including Rick Larsen, who now also volunteers his time supporting people like him after he saved his wife from an organization’s dangerous influence. Inside Edition Digital’s Johanna Li has more. #InsideEdition",
      "release": "2020-10-16T19:05:17Z",
      "duration": "00:05:20",
      "explicit": false,
      "youTubeId": "0rUN6aMAzX4",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0rUN6aMAzX4"
      }
    },
    {
      "id": "fa30d89d-353f-419a-8bcf-1bc89cc890f0",
      "title": "Mom of Heaven’s Gate Member Reflects on Son’s Last Moments",
      "description": "In March 1997, 18 men and 21 women dressed in identical black clothing and sneakers were found dead in their beds in a mansion in Rancho Santa Fe, near San Diego in California. The 38 deceased were members of the cult Heaven’s Gate, a group founded in 1974 by Marshall Herff Applewhite Jr. A year after the mass suicide, the mother of one of the cult’s members spoke to Inside Edition about how she lost her son. #InsideEdition",
      "release": "2020-03-14T11:26:50Z",
      "duration": "00:03:15",
      "explicit": false,
      "youTubeId": "ubyFHrtN1M8",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ubyFHrtN1M8"
      }
    },
    {
      "id": "5a85d846-7b94-4772-ae48-821ebc2306e1",
      "title": "Dad Who Moved Into Daughter’s Dorm Accused of Trafficking",
      "description": "We\u0027re learning more about the dad who allegedly recruited his daughter\u0027s college classmates into a cult-like group. Federal authorities say Lawrence Ray forced a student to stay awake for days, destroying her will to resist. The now 60-year-old suspect moved into his daughter\u0027s dorm room with her three roommates at Sarah Lawrence College. Prosecutors say he gave the roommates therapy and somehow turned them against their parents. #InsideEdition",
      "release": "2020-02-13T22:30:36Z",
      "duration": "00:02:22",
      "explicit": false,
      "youTubeId": "MujntEZbrO4",
      "subjects": [
        "Larry Ray",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MujntEZbrO4"
      }
    },
    {
      "id": "9a103f1d-1179-486c-9f4b-9ab30b1f106f",
      "title": "Woman Branded by NXIVM Cult Says Pain Was \u0027Horrific\u0027",
      "description": "A former NXIVM cult member is speaking candidly about her ordeal. Sarah Edmondson, 42, spent 12 years in the cult led by the charismatic Keith Raniere. She said she was selected to join a secret sisterhood within NXIVM and as part of the initiation she had Raniere\u0027s initials, \u0022KR,\u0022 branded into her skin. \u0022It was horrific,\u0022 she told Inside Edition. \u0022The whole point was to experience pain and to overcome the pain, to be really strong, so they cut our flesh open without anesthetic.\u0022 #InsideEdition",
      "release": "2019-09-18T22:08:00Z",
      "duration": "00:02:20",
      "explicit": false,
      "youTubeId": "wlpQHYOhdyw",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wlpQHYOhdyw"
      }
    },
    {
      "id": "60c8687b-04c1-4899-b74a-28edecb121ca",
      "title": "Full Interview: Preacher Kenneth Copeland Defends Lavish Lifestyle",
      "description": "Televangelist Kenneth Copeland enjoys a life of luxury. He has his own airport next to his mansion in Newark, Texas, where he keeps his private jets. When Inside Edition’s Chief Investigative Correspondent Lisa Guerrero caught up with him in Branson, Missouri, he spoke to her at length about his lifestyle and why he says the jets are important to his ministry. “If I flew commercial, I’d have to stop 65% of what I’m doing,\u0022 he said. Guerrero asked him about a previous comment he made saying he doesn’t fly commercial because he doesn’t “want to get into a tube with a bunch of demons.” “Do you really believe that human beings are demons?” she asked. “No, I do not and don’t you ever say I did,” Copeland responded as he pointed his finger at her. Watch Guerrero’s full interview above and see the investigation here: https://www.youtube.com/watch?v=FZmGmGnkBVM #InsideEdition",
      "release": "2019-05-20T23:09:52Z",
      "duration": "00:11:57",
      "explicit": false,
      "youTubeId": "9LtF34MrsfI",
      "subjects": [
        "Kenneth Copeland"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9LtF34MrsfI"
      }
    },
    {
      "id": "cae176c5-1578-4779-803d-27c7e422d3fb",
      "title": "How ‘Dynasty’ Star Catherine Oxenberg Fought to Save Daughter From Suspected Cult",
      "description": "“Dynasty” actress Catherine Oxenberg fought to rescue her daughter, India, from what some have called a dangerous sex cult. The organization, NXIVM, billed itself as a self-help group. Its leader is the charismatic Keith Raniere. “Somewhere deep down I knew this was a bogus scam,” Oxenberg told Inside Edition. Oxenberg was a member of the group and introduced her daughter to it but says she didn’t know where “this was headed.” She got out in 2011 but India stayed for years after before escaping herself. #InsideEdition",
      "release": "2018-08-08T00:43:20Z",
      "duration": "00:02:40",
      "explicit": false,
      "youTubeId": "Q6iz2hIZqNM",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q6iz2hIZqNM"
      }
    },
    {
      "id": "722b40c2-3c3d-4037-9e2d-674a8a901cb8",
      "title": "How Inside Edition Went Undercover to Expose Child Labor at Commune",
      "description": "What does it take to go undercover to expose injustices? Inside Edition producer Zara Lockshin was assigned to investigate claims of child labor at businesses owned by a religious sect called the Twelve Tribes. She discovered children as young as 6 years old working on the group\u0027s farm in Cambridge, N.Y. Lockshin believes her \u0022friendly, open-minded\u0022 personality and her age made her a good fit for the assignment. InsideEdition.com\u0027s Leigh Scheps (http://twitter.com/LeighTVReporter) has more.\n\nFor Inside Edition\u0027s full investigation on this story, please go to:\nhttps://www.insideedition.com/undercover-investigation-exposes-child-labor-new-york-compound-43812 #InsideEdition",
      "release": "2018-06-07T13:25:13Z",
      "duration": "00:02:53",
      "explicit": false,
      "youTubeId": "3OgH64BbFqY",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3OgH64BbFqY"
      }
    },
    {
      "id": "2e0829b8-5935-4174-932f-a30f40e81e51",
      "title": "Did ‘Smallville’ Star Try to Recruit Kelly Clarkson for Alleged Sex Cult?",
      "description": "Did television actress Allison Mack try to recruit celebrities Emma Watson and Kelly Clarkson to an alleged sex cult? Mack, who appeared in the ‘Smallville’ series, was arrested Friday for allegedly recruiting woman as sex \u0022slaves\u0022 to service the leader of a group to which she belonged, according to prosecutors. The group, called NXIVM (Nexium), is based in Albany, New York. The 35-year-old pleaded not guilty in Brooklyn federal court to charges of sex trafficking and forced labor. #InsideEdition",
      "release": "2018-04-24T21:11:16Z",
      "duration": "00:02:00",
      "explicit": false,
      "youTubeId": "LMo9mgpstEo",
      "subjects": [
        "NXIVM",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LMo9mgpstEo"
      }
    },
    {
      "id": "d95508b7-421e-419d-97ec-415cce0c472a",
      "title": "Ex-‘Smallville’ Star Kristin Kreuk ‘Disturbed’ Over Past NXIVM Link",
      "description": "‘Smallville’ star Kristin Kreuk has denied reports she recruited sex slaves for an alleged cult. The actress, who played Clark Kent\u0027s love interest in the TV series, acknowledged that she had taken a course with the organization, NXIVM (pronounced Nexium), but denied claims she recruited women to be \u0022sex slaves.\u0022 “I left about five years ago and had minimal contact with those who were still involved,” Kreuk wrote in a statement that she shared to Twitter on Thursday. #InsideEdition",
      "release": "2018-03-30T21:22:22Z",
      "duration": "00:02:51",
      "explicit": false,
      "youTubeId": "7P57ncenzCk",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7P57ncenzCk"
      }
    },
    {
      "id": "06c07fee-5c78-4644-a1f1-296b605f6e68",
      "title": "Ex-‘Smallville’ Actress Allison Mack Believed to Be Part of Alleged Cult",
      "description": "Two former stars of the hit TV series ‘Smallville’ allegedly used their celebrity status to recruit young women for a sex cult, according to a report. Kristin Kreuk and Allison Mack signed up with self-help guru Keith Raniere, leader of the NXIVM (pronounced Nexium) group based in upstate New York. Mack played a high school student with a secret crush on a young Superman. Kreuk played Clark Kent\u0027s love interest, Lana Lang. Raniere was arrested this week and was charged with sex trafficking. #InsideEdition",
      "release": "2018-03-29T22:00:32Z",
      "duration": "00:02:35",
      "explicit": false,
      "youTubeId": "WqABAOI2jYA",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WqABAOI2jYA"
      }
    },
    {
      "id": "9113f8eb-743c-42f3-97e1-59efd7112abb",
      "title": "This Woman Claims R. Kelly Is Running a Cult",
      "description": "R. Kelly faces claims of holding women against their will at his homes in Atlanta and Chicago, which he denies. Now, one woman says she was under his spell. After meeting him, Kitti Jones quit her job and moved to a compound owned by Kelly. \u0022He could make you feel like you\u0027re wearing red and you\u0027re wearing blue,\u0022 she said. \u0022We had to ask to go to the bathroom, ask if we could order food.\u0022 Jones says she wasn\u0027t held against her will, but after nine months, she says she got up the nerve to leave. #InsideEdition",
      "release": "2017-09-22T21:48:52Z",
      "duration": "00:03:06",
      "explicit": false,
      "youTubeId": "m2muGNE9t_s",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=m2muGNE9t_s"
      }
    },
    {
      "id": "f3be65ff-7efe-4b90-9a3f-dc07909b40fc",
      "title": "Manson Cult Follower Leslie Van Houten Seeks Parole After 50 Years In Jail",
      "description": "The youngest of Charles Manson\u0027s murderous followers is one step closer to freedom. A California Department of Corrections panel recommended that Leslie Van Houten be paroled after spending nearly 50 years in prison for her role in killings that shook the nation in 1969. She was convicted for the Los Angeles murders of Leno and Rosemary LaBianca. InsideEdition.com\u0027s Mara Montalbano (https://twitter.com/MaraMontalbano) has more. #InsideEdition",
      "release": "2017-09-08T00:14:23Z",
      "duration": "00:01:53",
      "explicit": false,
      "youTubeId": "0jYwOuUEPRk",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0jYwOuUEPRk"
      }
    },
    {
      "id": "9736c760-3ebd-477f-b3ae-1a962b556c30",
      "title": "Parents Claim Their Kids Are Part of a Cult Led By Singer R. Kelly",
      "description": "R\u0026B singer R. Kelly is facing accusations of running a \u0027sex cult,\u0027 but one woman who is living with the superstar tells police and TMZ she is fine. The claim came from two parents who say their daughter has been brainwashed by the artist. Tim Savage says Kelly is holding his daughter, Joycelyn, and five other young women in two locations, one at his mansion in Atlanta and another at his Chicago apartment in Trump Tower. \u0022My daughter is being held against her will,\u0022 said Savage. #InsideEdition",
      "release": "2017-07-18T21:53:18Z",
      "duration": "00:02:35",
      "explicit": false,
      "youTubeId": "WBRS3fG3kJ4",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WBRS3fG3kJ4"
      }
    },
    {
      "id": "baeeac83-f37e-4df6-a8fa-48ef0737c7d7",
      "title": "An Exclusive Look Inside the Compound Warren Jeffs Shared With 79 \u0027Sister Wives\u0027",
      "description": "It looks like a motel off the beaten path, but a property in a remote area of Utah was actually the home of notorious polygamist Warren Jeffs with his 79 wives. Brielle Decker, who was wife number 65, gave Inside Edition a tour of the compound where Jeffs and his so-called \u0022sister wives\u0022 lived. The rambling compound is located in Hildale, the headquarters of the radical polygamist sect run by Jeffs, who is currently serving life in prison for sexually assaulting two teenage girls. #InsideEdition",
      "release": "2017-06-23T21:23:25Z",
      "duration": "00:02:36",
      "explicit": false,
      "youTubeId": "Uxs52z-Lj1Q",
      "subjects": [
        "Apostolic United Brethren",
        "FLDS Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Uxs52z-Lj1Q"
      }
    },
    {
      "id": "0a7c9e32-4a47-4fe0-82b7-8ffb78d38d6c",
      "title": "Beach Boys\u0027 Mike Love Reveals Details Of Spooky Encounter with Charles Manson",
      "description": "More from Inside Edition: http://bit.ly/2bF0iuC\nA chilling 1993 interview with Charles Manson and ABC\u0027s Diane Sawyer has been unearthed for the first time. In the documentary, an ABC sound engineer talks about the moment he placed the microphone on Manson for the 1993 interview. Chris Connelly told Inside Edition: \u0022It\u0027s remarkable how much is in all that that we\u0027ve never been able to put on TV before.\u0022 The interview is now at the core of a new ABC documentary, \u0022Truth And Lies: The Family Manson,\u0022 airing Friday night. #InsideEdition",
      "release": "2017-03-17T21:34:58Z",
      "duration": "00:02:32",
      "explicit": false,
      "youTubeId": "vbbTe4xkSvk",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vbbTe4xkSvk"
      }
    },
    {
      "id": "f2f18315-cd7e-4bb6-a442-7e54d66a2d62",
      "title": "3 Sex Cult Members Convicted of Murdering Marine\u0027s Wife for \u0027Sadistic Pleasure\u0027",
      "description": "Three people who were part of a so-called \u0022master-slave sex cult\u0022 were convicted of torturing and murdering Brittany Killgore, according to reports. #InsideEdition",
      "release": "2015-10-22T23:49:30Z",
      "duration": "00:01:36",
      "explicit": false,
      "youTubeId": "hsrtQTnMx3g",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hsrtQTnMx3g"
      }
    }
  ]
}