{
  "id": "bf9e8dbb-8bac-4739-9f8e-3ea2b134ee9b",
  "name": "INSIGHT WITH AMBIKESH",
  "youTubeChannelId": "UCpNXhF9azgWmJb2E7mtPhJA",
  "episodes": [
    {
      "id": "b27d4caa-4bb4-46ba-a3cb-4833bbdb1c18",
      "title": "BrahmaKumari Cult Tactics EXPOSED Again | This Video Was Removed",
      "description": "⚠️ This video was taken down after a copyright strike by the Brahma Kumaris.\nBut truth doesn’t stay buried for long. We’re reuploading it because the public deserves to know the facts.\n\n🎥 In this video, we expose:\n\nThe cult-like tactics used by the Brahma Kumari organization\nThe false prophecies including the claim that the world will end in 2036\nThe manipulation of followers, including married couples being told to live as siblings\nThe origin story of Dada Lekhraj (a.k.a. Brahma Baba) and the rise of factions like Shankar Party and Vishnu Party\nClaims that Shiva gave the Gita, not Krishna, and that all scriptures except their \u0022knowledge\u0022 are false\nAllegations of brainwashing and hidden inner conflicts within the organization\n❗This isn’t just a video — it’s a mirror held up to blind faith, authoritarian spirituality, and emotional manipulation.\n\n🔍 Watch till the end and decide for yourself — is this spirituality, or is this control in the name of God?\n\n🙏 Disclaimer: This video is based on publicly available claims, testimonies, and literature from and about the Brahma Kumaris. The goal is analysis, not to offend anyone’s faith.\n\n👍 If you support free speech and truth, please LIKE, SHARE, and SUBSCRIBE.\n💬 Let us know your thoughts in the comments below.\n\n#BrahmaKumariExposed, #CultTactics, #SpiritualControl, #2036EndTimes, #BrahmaBabaTruth, #ShivBabaMyth, #RajyogaExposed, #MindControlCult, #DeletedVideo, #ReuploadTruth, #IndianSpirituality, #SpiritualScam, #TruthVsFaith",
      "release": "2025-07-20T14:10:49Z",
      "duration": "00:09:13",
      "explicit": false,
      "youTubeId": "r5U4IH_7-IY",
      "subjects": [
        "Brahma Kumaris",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r5U4IH_7-IY"
      }
    }
  ]
}