{
  "id": "286e1d10-a41a-4108-b5f3-6ad4ba7cd903",
  "name": "Insights from the Couch - Mental Health at Midlife",
  "spotifyId": "2uAm0tXUVPI3RwScvqg2Ge",
  "appleId": 1745180987,
  "youTubeChannelId": "UCIwt2hdSREH4j9q8cfmp4Kg",
  "episodes": [
    {
      "id": "8528df9f-894b-4b18-9a7d-8f1766e89dcc",
      "title": "Surviving Narcissistic Abuse Part 1",
      "description": "In this episode of Insights from the Couch, we dive into the complex world of narcissistic abuse with the incredible Vanessa Reiser, a licensed clinical social worker specializing in narcissistic and cult abuse. Together, we explore what it’s really like to experience this insidious form of domestic violence, how to identify narcissistic behaviors early on, and the warning signs that often go unnoticed until it’s too late. Vanessa shares her personal story of surviving narcissistic abuse, shedding light on the psychological manipulation that victims face and the steps they can take to heal and escape. This episode is packed with insights on understanding narcissistic personality disorder (NPD), the difference between someone acting narcissistically versus having NPD, and the trauma bonds that make it so difficult for victims to break free. Whether you\u0027re dealing with a narcissist in your life or just curious about the subject, this episode will open your eyes to the tactics used by these master manipulators and the hope that lies in recovery. Episode Highlights: [3:10] - Vanessa’s personal journey: From working in the Bronx to becoming an advocate for domestic violence survivors. [6:10] - What is narcissistic personality disorder (NPD) and how does it differ from narcissistic behavior? [9:22] - Red flags to watch for in a relationship: Love bombing, superficial charm, and fast-moving affection. [12:46] - How long can a narcissist hold their mask before revealing their true self? [15:33] - The dangerous cycle of abuse and why victims struggle to leave. [18:25] - The role of intermittent reinforcement and how victims become addicted to the narcissist’s approval. [22:16] - The biological and psychological factors that drive narcissistic behavior. Resources: For more on this topic visit our website insightsfromthecouch.org If you have questions please email us at info@insightsfromthecouch.org we would love to hear from you! If today\u0027s discussion resonated with you or sparked curiosity, please rate, follow, and share \u0022Insights from the Couch\u0022 with others. Your support helps us reach more people and continue providing valuable insights. Here’s to finding our purposes and living a life full of meaning and joy. Stay tuned for more!",
      "release": "2024-10-30T08:00:00Z",
      "duration": "00:29:59.3400000",
      "explicit": false,
      "spotifyId": "3e9Ao8QefnGI7JNKAcfSO5",
      "appleId": 1000674978677,
      "youTubeId": "4OAlMPCttmY",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3e9Ao8QefnGI7JNKAcfSO5",
        "apple": "https://podcasts.apple.com/podcast/surviving-narcissistic-abuse-part-1/id1745180987?i=1000674978677",
        "youtube": "https://www.youtube.com/watch?v=4OAlMPCttmY"
      }
    }
  ]
}