{
  "id": "a2e4e295-5d31-43f8-a302-471e57182374",
  "name": "Inside the Tent with Campside Media",
  "spotifyId": "3N4ktEpZU47ttwVreP59Mw",
  "appleId": 1768758485,
  "youTubeChannelId": "UCJrYB1nfJBMvu_MCJcjKAKQ",
  "youTubePlaylistId": "PLLurr_1up60T0MjZVHT5Jfre8MbX98qxM",
  "episodes": [
    {
      "id": "3becb576-0b6d-49fa-bf62-007f47199939",
      "title": "The Story Behind Allison After NXIVM",
      "description": "This is an episode of Inside the Tent, a podcast going behind the scenes of Campside’s award winning shows. Listen on Apple Podcasts , Spotify , YouTube or wherever you get your podcasts. You think you know the NXIVM story. The secretive self-help empire. The sex cult headlines. The downfall of its leader, Keith Raniere. But the most famous woman at the center of the story has remained largely silent. Allison after NXIVM tells the story of Allison Mack: former Smallville actress, high-ranking NXIVM member, and convicted felon. With exclusive access following her release from prison, this series traces her astonishing path from Smallville fame to NXIVM’s inner circle - and her effort to rebuild a life in the wreckage. Natalie begins by admitting she was reluctant to host the show given what she’d read about Allison. But she agreed to a meeting arranged by Campside co-founder Vanessa Grigoriadis, who wrote a key 2018 story in the New York Times Magazine about NXIVM. And Natalie found someone charming and beautiful - this is Hollywood after all - and seemingly willingly to take responsibility for her actions. Lily then wonders how you can interview someone compassionately, while also asking intensely personal questions. Is a traumatized person stable enough to tell their story? And are they telling the truth? Natalie describes spending hours and hours interviewing Allison, learning about controlling behavior and sexual abuse that began even before NXIVM. The conversation then touches on fact checking, unexpectedly tracking down one of the cult’s leaders, Lauren Salzman, and the potential healing powers of a new tattoo. Listen to Inside the Tent on Apple Podcasts , Spotify , YouTube or wherever you get your podcasts. Email us with questions or comments: questions@campsidemedia.com. We hope to see you inside the tent again soon. Subscribe now for updates on all of Campside’s hit shows. To hear more, visit join.campsidemedia.com",
      "release": "2025-12-05T21:13:18Z",
      "duration": "00:23:13.8150000",
      "explicit": false,
      "spotifyId": "4gdy24wPO6kumhjjQABMc9",
      "appleId": 1000739915873,
      "youTubeId": "6qxcoGtUIlo",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4gdy24wPO6kumhjjQABMc9",
        "apple": "https://podcasts.apple.com/podcast/the-story-behind-allison-after-nxivm/id1768758485?i=1000739915873",
        "youtube": "https://www.youtube.com/watch?v=6qxcoGtUIlo"
      }
    }
  ]
}