{
  "id": "888e46a2-a237-4c13-9b8f-4330ac8e0604",
  "name": "International Cultic Studies Association (ICSA)",
  "youTubeChannelId": "UCS_hc5LO1HtMvoa8kRcLcig",
  "episodes": [
    {
      "id": "4163a523-dd1f-4103-a68e-5082744aad5e",
      "title": "International Cultic Studies Association (ICSA) Live Stream",
      "release": "2023-03-23T02:43:00Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "J8OhMsQ9cm0",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J8OhMsQ9cm0"
      }
    },
    {
      "id": "4d31179f-33d7-4776-9b93-efe9510b1666",
      "title": "Learning From Former Members\u0027 Experiences of Receiving Professional Help",
      "description": "Learning From Former Members\u0027 Experiences of Receiving Professional Help: How Therapy Narratives Can Inform Practice (Catherine de Boer) \n\nPresentation at the NY Monthly Meeting January 31, 2020, 7-9 pm EST. Domestic abuse is now recognized as a widespread social problem   It is estimated that nearly half of all women and men will experience interpersonal aggression in a familial context during their lifetimes. This talk will suggest a connection between the power dynamic of domestic abuse, or as it is now often called, interpersonal violence, and the dynamic of coercive control in cultic groups.  I will present an overview of the stages and defining characteristics of coercive relationships, common to both domestic violence and cults. The talk will focus on Albert Biderman\u0027s eight coercive methods for eliciting compliance, including threats, degradation, trauma bonding, and isolation and how they manifest in both cults and domestic violence. Education to recognize and understand relationships of dominance and subjugation is the first line of defense against interpersonal violence of all types.",
      "release": "2022-09-23T18:11:57Z",
      "duration": "00:44:21",
      "explicit": false,
      "youTubeId": "MCoJG8CTa2M",
      "subjects": [
        "Erhard Seminars Training"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MCoJG8CTa2M"
      }
    },
    {
      "id": "c838dc29-66d7-47ee-b775-3d15b28f9bc6",
      "title": "Generation Cult: Using New Media to Share Your Story",
      "description": "Generation Cult: Using New Media to Share Your Story (Dhyana Levey)\n\nPresentation at the International Cultic Studies Association annual conference in Manchester, UK in 2019. The public loves a good story and is especially interested in true tales about cults. Unfortunately, there’s a lot of inaccurate information floating around about these high-demand, authoritarian groups. That’s why it’s so important for people who have had personal experiences with a variety of cults to share their stories. So, how does someone do that? Traditionally, writers have published books. Some are lucky enough to get a legitimate publisher, but that can be difficult, even more so now as that publishing industry has been in decline. But there are many other options now for people to share their stories. The internet and social media have become a very effective way to share information about cults, from online support groups to personal blogs to a simple confession on Facebook shared with your friends. Podcasts are an excellent way to learn about cults. There’s one just called “Cults,” another called “We’re Starting a Cult,” podcasts that just focus on a single cult like “Heaven’s Gate” and then there’s my own called “Generation Cult,” that discusses people raised in high-demand groups. At first I thought traditional publishing was the only way to get my message to the public, but I learned how to make my own podcast and it wasn’t that hard. Other people can do it, too. There are plenty of creative options out there now for former cult members to use to share their stories, they just have to know how to use them.",
      "release": "2022-09-23T18:10:10Z",
      "duration": "00:24:16",
      "explicit": false,
      "youTubeId": "2zE_XE5iaO0",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2zE_XE5iaO0"
      }
    },
    {
      "id": "748fa5fc-ebb4-457a-be19-1dd1ea30610e",
      "title": "Developing the ‘Totalistic Identity Theory’",
      "description": "Developing the ‘Totalistic Identity Theory’ for cults and extremist groups\n(Rod Dubrow-Marshall, Ph.D.)\n\nResearch previously presented (Dubrow-Marshall and Martin 2008) has articulated the ‘Totalistic Identity Theory’ for cultic and extremist groups whereby it is advanced that members identity structures are largely dominated and fixed on the cult identity at the expense of many or all other levels and categories of identity and in a polarized or differentiated position in relation to other groups and society at large. This theory (Dubrow-Marshall 2007) is an extension of traditional social psychological theory on group identity (e.g. Turner’s (1987) Self-Categorization Theory). Analysis of former cult members from the Wellspring Retreat and Resource Center in Ohio (Dubrow-Marshall \u0026 Martin 2008) has also shown a clear relationship between aspects of psychopathology and extent of identity with the group, thus providing evidence that a totalistic or polarized identity structure is harmful for group members.\nThis paper presents further analysis from the Wellspring sample advancing further a model for the specific psychopathology of former cult members. This analysis points to additional evidence for the ‘Totalistic Identity Theory’ and in particular aspects relating to the polarized identity position and its relationship to overall psychological well being and the perception by current group members of non-group members and the rest of the world and the behavioural correlates of such perceptions. The theory also points to and supports strategies for depolarization and de-identification with extremist groups and approaches to preventing initial recruitment to them.",
      "release": "2022-09-23T18:06:38Z",
      "duration": "00:52:41",
      "explicit": false,
      "youTubeId": "8eOGX_R162Y",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8eOGX_R162Y"
      }
    },
    {
      "id": "dbf9da2e-7056-46cc-8686-a0b55eaeb4fc",
      "title": "Understanding the Experience of African American Families in Religiously Abusive Organizations",
      "description": "Understanding The Experience of African American Families and Individuals in Religiously Abusive Organizations (Alisha Powell)\n\nThis presentation will discuss the appeal of abusive religious organizations to African American families and individuals due to a myriad of historical and social factors. The presenter will draw upon her personal experience of living on a religious compound as a teenager and her professional experience of working with African American families and individuals. Ways to better relate and understand the experience of African American families and individuals will be discussed. Implications for social change and increasing cultural competence of mental health professionals and the general population will also be discussed.",
      "release": "2022-09-23T15:37:21Z",
      "duration": "00:26:36",
      "explicit": false,
      "youTubeId": "nEtYiMS-iMg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nEtYiMS-iMg"
      }
    },
    {
      "id": "1b6052bf-83e5-40b9-9338-91e1ca259ad1",
      "title": "Religious Conflict Resolution",
      "description": "Religious Conflict Resolution (Michael Langone, PhD.) \n\nResearch suggests that, in the West, hundreds of thousands of individuals join and leave\ncultic groups each year. Research studies also suggest that at least a sizable minority of\nthose who join cultic groups are adversely affected. The families of these group members,\nand probably many other families, tend to become concerned about their loved one‘s group\ninvolvement.\nRoughly 80 percent of the groups that cause concern are religious. The psychological,\npolitical, and occasionally commercial groups that aren‘t overtly religious often influence\nmembers‘ lives as though they were religions because they typically bring about a major\nshift in members‘ views of self, world, and other—i.e., a conversion experience.\nDuring the past 25 years, most professionals who work with these families have emphasized\nhelping them persuade their loved ones to leave cultic groups. Exit counseling, a process\naimed at helping families create conditions under which their loved one will reevaluate a\ngroup involvement, has been very valuable to thousands of grateful families and group\nmembers. (Exit counseling is also often referred to as ―thought reform consultation.‖)\n\nNevertheless, only a very small percentage of families are able to proceed to an exit-\ncounseling intervention. In many cases, an intervention is not possible or even appropriate\n\nbecause the loved one‘s relationship to a group does not fit the typical pattern of\nexploitative manipulation associated with the subjects of exit-counseling interventions, even\nthough the family may have valid concerns. In other cases, the loved one may be so\nattached to the group (e.g., because of family ties within the group, decades of\ncommitment, fear of adjusting to the mainstream world) that his or her departure is\nunlikely, even with an intervention.\nVery little attention has been paid to this large majority of families for whom an exit\ncounseling is not feasible or appropriate. Livia Bardin‘s book, Coping with Cult Involvement:\nA Handbook for Families and Friends, offers some guidance. Ms. Bardin says that a cult\ninvolvement is often ―a situation to manage, not a problem to solve.‖\nThis talk will explore ways in which families can more effectively ―manage‖ a loved one‘s\ninvolvement in a group that causes concern, at least in part because of the nature of the\nconversion that it tends to bring about. The talk will approach the situation as a family\nconflict over what at least overtly are religious issues. Through lecture and discussion, the\nspeakers, a counseling psychologist, an educational/organizational consultant, and an exit\ncounselor (thought-reform consultant), will examine\n- How families and group members can come to better understand and appreciate\neach other‘s perspectives on the conflict that divides them.\n- How they can improve communication so as to reduce the level of conflict.\n- How they can negotiate mutual behavioral changes that will reduce the level of\nconflict.\n- How they can come to terms with the need to compromise so as to protect the love\nbetween them while respecting differences that divide them.",
      "release": "2022-09-23T15:19:36Z",
      "duration": "00:45:52",
      "explicit": false,
      "youTubeId": "6g68AzqifU4",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6g68AzqifU4"
      }
    },
    {
      "id": "b6b2f112-79b0-4f3d-a61c-caf074d689ef",
      "title": "Relational Psycho-Educational Intensive: Time Away for Post-Cult Counseling",
      "description": "Relational Psycho-Educational Intensive: Time Away for Post-Cult Counseling (Gillie Jenkinson) \n\nPresentation at the International Cultic Studies Association annual conference in Dallas, Texas on July 1, 2016. Gillie Jenkinson of Hope Valley Counselling describes the therapeutic approach she has developed for working with former members of cults, spiritual abuse, coercive control, and other high demand situations.\n\nUpdate: Since presenting her Post-Cult Counselling model at the Dallas Conference, Gillie has developed a ‘Recovery Workbook’ with the handouts mentioned (and more) in one place and is currently writing it up into a publishable book. She has trained 8 former member therapists in UK to use the Recovery Workbook on a ‘Certificate in Post-Cult Counselling’. These therapists are being mentored, coached, and supervised by Gillie as they also use the Recovery Workbook with clients. She plans to deliver another Certificate in Post-Cult Counselling in late 2021 or 2022 (depending on covid) and it is already oversubscribed!!",
      "release": "2022-09-23T15:16:35Z",
      "duration": "00:41:07",
      "explicit": false,
      "youTubeId": "s47temAUizA",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=s47temAUizA"
      }
    },
    {
      "id": "02b77197-3906-461c-aa7e-bf3d1030fd44",
      "title": "Regaining Your Footing: First Steps of Recovery from Spiritual Abuse",
      "description": "Regaining Your Footing: First Steps of Recovery from Spiritual Abuse (Ken Garrett)\n \nThis workshop will explore the initial experience of leaving an abusive group or cult, and will suggest some natural, basic steps of self-care and recovery as survivors begin the healing process. Pastor Garrett will share from his own recovery journey, and his experience in helping other survivors begin to heal.",
      "release": "2022-09-23T15:15:46Z",
      "duration": "00:32:23",
      "explicit": false,
      "youTubeId": "kB7RPfQMSCs",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kB7RPfQMSCs"
      }
    },
    {
      "id": "b4e9985f-1a04-408c-877b-e2f3b7f20652",
      "title": "Reawakening Your Spirituality After a Cult Experience",
      "description": "Reawakening Your Spirituality After a Cult Experience\n(Doug and Wendy Duncan)\n\nPresentation at the International Cultic Studies Association annual conference in Philadelphia, PA in 2018. Spiritual abuse is widespread and can be found in all religions. Cultic/spiritual abuse occurs when leaders use their position of authority to manipulate, control, and dominate. The cult leader portrays himself as the truth-bearer and members are led to believe that God has specifically chosen him to bring light into the world. The cult leader’s claim that God has given him a unique and special revelation justifies his role as the leader and his right to exercise control over his members. Followers are taught to accept the leader’s authority as divinely mandated. In whatever manner the abusive leader uses God, karma, salvation, the threat of damnation, the promise of enlightenment, or other spiritual promises/threats, the result is the same: spiritual abuse. Any doubts or questions are quickly extinguished by the leader utilizing intimidation, humiliation, and fear. Over time, the devotee adopts the cult’s view of God and has difficulty leaving because of the fear that doing so means they are leaving “The Truth” and even God himself. When an individual manages to separate from a cultic or spiritually abusive group, he faces myriad issues of a physical and psychological nature. Defining and reclaiming post-cult spirituality is often postponed while the individual sorts through day-to-day life outside the cult. However, acknowledging the damage and recapturing one’s spiritual identity is a core task of recovery. How can we reawaken our spirituality? How do we fill that emptiness of the soul? How do we get past the feelings of confusion and disillusionment? How do we recapture a sense of purpose? This presentation will focus on:\n \nObstacles in transitioning out of a spiritually manipulative group/religion \nExpunging the image of the god of the cult \nRecovering your faith \nReconnecting with your spiritual self”",
      "release": "2022-09-23T15:15:09Z",
      "duration": "00:36:52",
      "explicit": false,
      "youTubeId": "Q01jzSbqInM",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q01jzSbqInM"
      }
    },
    {
      "id": "37311d65-9056-4264-ba70-b9c784b355d9",
      "title": "Christian Cults and the Concept of Hell",
      "description": "Christian Cults and the Concept of Hell (Robert Pardon, Michael Langone)\n\nThe inculcation of fear is a control tactic that is commonly observed in cultic groups. Those that are ostensibly Christian will often use threats of hell as one means of instilling fear designed to strengthen leaders’ hold on group members. Though most mainstream Christians accept the concept of hell, cultic groups distort and misapply the concept. Frequently, those who leave cultic Christian groups can benefit by understanding how mainstream Christians conceive of hell and how cultic groups use hell as a control tactic. This panel will explore: (1) Historical and cultural contexts that may contribute to cultic formulations of hell (e.g., Dante’s Inferno, what we would today consider inhumane punishments for misdeeds). (2) Contemporary ideas about hell that are inconsistent with cultic views. (3) Cases of former cult members whose recovery involved a reevaluation of the views of hell that resulted from their group experience.",
      "release": "2022-09-23T15:09:35Z",
      "duration": "00:34:56",
      "explicit": false,
      "youTubeId": "t7oMJENxXQk",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=t7oMJENxXQk"
      }
    },
    {
      "id": "4abddbda-6d67-44a7-8eea-dd95f3df85e9",
      "title": "Punishment and the Concept of Hell",
      "description": "Punishment and the Concept of Hell (Robert Pardon, Michael Langone)\n\nThe inculcation of fear is a control tactic that is commonly observed in cultic groups. Those that are ostensibly Christian will often use threats of hell as one means of instilling fear designed to strengthen leaders’ hold on group members. Though most mainstream Christians accept the concept of hell, cultic groups distort and misapply the concept. Frequently, those who leave cultic Christian groups can benefit by understanding how mainstream Christians conceive of hell and how cultic groups use hell as a control tactic. This panel will explore: (1) Historical and cultural contexts that may contribute to cultic formulations of hell (e.g., Dante’s Inferno, what we would today consider inhumane punishments for misdeeds). (2) Contemporary ideas about hell that are inconsistent with cultic views. (3) Cases of former cult members whose recovery involved a reevaluation of the views of hell that resulted from their group experience.",
      "release": "2022-09-23T15:08:35Z",
      "duration": "00:16:06",
      "explicit": false,
      "youTubeId": "k8awJ8neP6g",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k8awJ8neP6g"
      }
    },
    {
      "id": "6a248132-c1c3-411c-941f-a39d31c226c7",
      "title": "Plenary: We Disagree - Let\u0027s Talk!: Why Diversity and Dialogue are Necessary",
      "description": "Plenary: We Disagree - Let\u0027s Talk!: Why Diversity and Dialogue are Necessary (Lorna Goldberg)\n\nPresentation at the International Cultic Studies Association annual conference in Philadelphia, PA in 2018. Unlike closed cult groups, ICSA firmly is committed to freedom of thought and expression. ICSA conferences provide an open arena for people from different backgrounds with diverse points of view. The speaker believes, in general, that dealing with conflicting viewpoints can be a healthy phenomenon. Dialogue expands our reality by helping us gain new insight into others as well as ourselves. In this presentation, the speaker will consider some factors that undermine ICSA’s goal for dialogue among diverse groups and will suggest some ideas that might help members to connect. To understand the undermining factors, the speaker will focus upon the concept of transference and, also, upon the human tendency to stereotype those from groups that are different from their own. The speaker suggests that we should not let our expectation of others shape our reality. It is only possible to hear and learn from one another if there is a willingness to move past our assumptions. It helps to keep in mind the need to be humble, remembering that all are equals deserving of respect.",
      "release": "2022-09-23T15:01:28Z",
      "duration": "01:00:16",
      "explicit": false,
      "youTubeId": "MRJCwchkh2Q",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MRJCwchkh2Q"
      }
    },
    {
      "id": "8626fdea-3ed6-4379-82fa-ca75bcb4a8ed",
      "title": "\u0022All Life is Suffering\u0022 - Cultic Tendencies and Student Abuse in Buddhism",
      "description": "Panel: All Life is Suffering - Cultic Tendencies and Student Abuse in Buddhism (Christopher Hamacher [moderator]; Stuart Lachs; Tenzin Peljor)\n\nPresentation at the International Cultic Studies Association annual conference in Bordeaux, FR in 2017. This panel will attempt to cast a more realistic light on some of the less positive elements within the religion of Buddhism, which as a whole still tends to enjoy an unblemished, \u0022warm and fuzzy\u0022 standing in the public imagination. \n\n1. Ready to Mine: Zen’s Legitimating Mythology and Cultish Behavior. Long-time practitioner and outspoken critic of Zen Buddhism Stuart Lachs will show how Zen\u0027s legitimating story and mythic history lays the groundwork for authoritarian-inclined charismatic leaders ‒ called \u0022Zen masters\u0022 or roshi ‒ to draw their followers into a world based on unquestioning obedience to the master, reliance on his approval, and an ethical framework dependent on his self-serving understanding. Though Zen presents its idealized masters as being fully in the world, spontaneous, and ‒ most importantly ‒ \u0022unattached\u0022, a state in which they are internally firm and free while remaining perceptually competent, this has hardly been the case in reality. Stuart will accordingly provide a number of examples of Asian and Western Zen masters who, along with their followers, have displayed cult-like behavior. Link to blog: https://buddhism-controversy-blog.com/2017/07/16/ready-to-mine-zens-legitimating-mythology-and-cultish-behavior/  \n\n2. Tibetan Buddhist monk Tenzin Peljor will explain how doctrinal issues and cross-cultural misunderstandings, for example about the concepts of faith and the guru in Tibetan Buddhism, can contribute to abusive spiritual systems. His review will begin with the highly controversial \u0022New Kadampa Tradition\u0022 and his own experiences with that movement, and then expand to other groups. Having run an online information portal about controversial Buddhist groups for many years, Tenzin can draw on numerous examples of suspect behavior from across the broad Buddhist spectrum. Link to PowerPoint: https://tenzinpeljor.de/PDF/ICSA2017.pdf \n\n3. How Zen Groups Respond to Allegations of Abuse. Zen teacher Christopher Hamacher will compare various Zen Buddhist groups from the perspective of how they have responded to abuse by their teachers. Based on a number of recent scandals, he will demonstrate how various Buddhist doctrines are invoked by the leaders and students, firstly to deny the abuse and/or refuse to intervene, and afterwards to deal \u0022compassionately\u0022 ‒ i.e ineffectively ‒ with the abuser. Christopher will then propose that, ultimately, the way a group reacts to allegations of misconduct may be a better indicator of its underlying dysfunction than the content of the allegations themselves.",
      "release": "2022-09-23T14:54:02Z",
      "duration": "01:23:33",
      "explicit": false,
      "youTubeId": "138G9WVkor8",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=138G9WVkor8"
      }
    },
    {
      "id": "7f50180a-1109-456c-a209-add3a5140d0d",
      "title": "Spiritual Issues in Counseling",
      "description": "Spiritual Issues in Counseling (Rev. Robert Pardon; Judy Pardon)\n2017\n\nSome apply the term spiritual abuse to any kind of psychological, physical, or sexual abuse that takes place in a religious context.  Others apply the term specifically to manipulations that damage a person\u0027s relationship to God or to his/her core self. Spiritual abuse has been reported in mainstream religious organizations as well as nonmainstream groups, such as cults.\n\nThe terms psychological abuse or emotional abuse refer to harms that overlap those associated with both of these conceptualizations of spiritual abuse. These harms include but are not limited to damaged self-esteem, induced dependency, impaired capacity to trust oneself or others, and emotional reactions such as anger, anxiety, and depression. In some cases, one\u0027s faith in God may also be shaken.\n\nTo a large degree, the choice of a term, psychological abuse or spiritual abuse, depends upon the framework (psychological or religious) with which the speaker/writer feels comfortable. This two-day conference finds value in resources coming from psychological and religious frameworks, though obviously some issues, e.g., questions about God\u0027s mercy, may require religious concepts to address properly. The conference is aimed at those who were spiritually abused, whether recently or in the past, family members concerned about a loved one, and helping professionals, including pastors and therapists.\n\nThe agenda will include the following topics:\n\nThe varieties of abuse\nCoping with triggers\nPersonal accounts of spiritual abuse\nPsychological issues in counseling\nSpiritual issues in counseling\nHow can churches and synagogues become spiritual safe havens\nSpiritual abuse victims dialogue with religious and mental health professionals\nOpen discussion",
      "release": "2022-09-08T15:41:09Z",
      "duration": "01:23:08",
      "explicit": false,
      "youTubeId": "_2VhAh8ciVk",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_2VhAh8ciVk"
      }
    },
    {
      "id": "b1d57819-2109-41c0-a11e-d9be5879080b",
      "title": "Overcoming Barriers to Healthy Sexuality for S/MGAs",
      "description": "Overcoming Barriers to Healthy Sexuality for S/MGAs (Doni Whitsett)\n\nPart 1 of this series discussed some general sexual issues of S/MGAs. Part 2 addresses more specific issues with which this populations often struggles. \n\nThe life of a cult child is highly controlled and their personality shaped to conform to the expectations of the leadership. These expectations carry severe consequences when not adhered to. While some groups suppress erotic development, others foster indiscriminate sexual activity creating an atmosphere that is inappropriately sexually charged and overstimulating. Anxiety surrounding sexuality may result in the sexual self becoming alienated. Messages instilled by the cult leader or belief system may continue in a person’s psyche and body after a former member throws off the constricting cult norms and seeks to explore their own sexual potential. Learning to cope with these messages is necessary to be able to engage in healthy relationships. \n\nInsecure attachments characteristic of families in cults well as messages instilled by the cult often contribute to biological sexual dysfunction.  This talk will address some specific sexual difficulties in the various phases of sexual response (i.e. desire, arousal and orgasmic phases) and offer suggestions for overcoming them.",
      "release": "2022-07-01T17:41:31Z",
      "duration": "00:17:56",
      "explicit": false,
      "youTubeId": "CJoaLe109B0",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CJoaLe109B0"
      }
    },
    {
      "id": "1a95e912-0b6e-46ed-b89a-a2a77d9e5c51",
      "title": "The Cult Pseudo Identity and the Phases of Recovery and Growth",
      "description": "The Cult Pseudo Identity and the Phases of Recovery and Growth (Gillie Jenkinson)\nSunday, April 3rd 2022: \n\nICSA is pleased to introduce our new monthly series for our mental health community. Each month will feature a different clinician discussing some aspect of clinical work. Each presentation will serve as a stimulus for questions and a discussion of clinical issues, which will occur during the following hour.\n\nDr Gillie Jenkinson will discuss the rationale for being informed by the Phases of Recovery and Growth when working with former cult members. She will explore how a psychoeducational approach can assist the individual to unlayer and dismantle their cult pseudo-identity. The therapist can then work with the former member’s authentic autonomous identity and not the cult pseudo-identity. The client can then recover and grow, free of the influence and control of the cultic experience.\n\nGillie Jenkinson, PhD, is an accredited counsellor and psychotherapist in UK and is experienced in delivering counselling face-to-face as well as on the telephone and Skype. She served two internships at Wellspring Retreat Center, Ohio, and has many years’ experience working with trauma, including survivors of spiritual and cult abuse, and sexual abuse. She has developed an approach to counselling former members - \u0022Time Away for Post-Cult Counselling.\u0022 Gillie was a member of an abusive Bible-based cult in the 1970’s. She is a regular presenter at conferences and a published author, including a co-authoring a chapter entitled \u0022Pathological Spirituality\u0022 for a medical text book entitled Spirituality and Psychiatry, published by RCPsych Publications in UK - 2009. She is the Mental Health Editor for ICSA Today. Gillie’s doctoral research dissertation is entitled: ‘Freeing the authentic-self: Phases of Recovery and Growth from an Abusive Cult Experience’. Website: www.hopevalleycounselling.com Email: info@hopevalleycounselling.com Phone: \u002B44 1433 639032. United Kingdom",
      "release": "2022-04-05T23:39:11Z",
      "duration": "00:50:09",
      "explicit": false,
      "youTubeId": "tPcyuukYJg4",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tPcyuukYJg4"
      }
    },
    {
      "id": "2a1a00d8-fb56-4a0f-8630-57ea99ace6b3",
      "title": "Destigmatizing Medical Care Post Cult",
      "description": "Destigmatizing Medical Care (Eva Mackey and Ck Rardin)\nSunday, March 27th, 2022\n\nDisclaimer: Views expressed on ICSA Websites or in ICSA\u0027s publications or events or other venues are those of the document\u0027s author(s) or speaker(s) and are not necessarily shared, endorsed, or recommended by ICSA or any of its directors, staff, or advisers.  \n\nSecond and Multigenerational Adult Former Cult Member Recovery Series \n\nThose who have exited cults are likely to have many psychological barriers to accessing the medical care they need. Individuals raised in cults may have never received appropriate medical care and may have many misconceptions about illness, doctors and medicine. This talk will explore how two second generation adult (SGA) former cult members overcame those barriers. You will hear from one SGA who become his own medical advocate and was able to form healing, therapeutic relationships with his medical team and doctors. The other speaker is an SGA who went to medical school after exiting the cult and has been a practicing family physician for 20 years. She will explore the issue from both perspectives and will specifically address stigmas attached to mental illness and psychiatric medicines.\n\nEva Mackey Meyrat, MD, is a second-generation adult former cult member and a facilitator of the ICSA CT Workshop for Those Born or Raised in Cultic Groups. Her mother became a devotee of an Indian guru in 1975 when she was one year old. He taught a branch of Hinduism called Advaita Vedanta, a non-dualistic philosophy which teaches that the self is one with the ultimate truth or reality. Half of Eva’s childhood was spent in the ashram in India, where she and the other children were unsupervised much of the time. Despite the upheavals and instability that characterized her childhood, Eva managed to get out of the cult at the age of 16 and eventually earned her MD degree from the University of Texas Medical Branch in Galveston. Dr. Mackey has a busy family practice, and she lives near Dallas with her husband and four children.\n\nCk Rardin, facilitator, ICSA CT Workshop for Those Born or Raised in Cultic Groups, was born in California. His parents raised him in a cultic Catholic group and when he reached adolescence, they signed over their parental rights to the group. Ck was then sent to the cult’s headquarters in Itaquera, Sao Paulo, Brazil. He stayed in the group till age 26 when he gathered the courage and strength to leave the organization on his own. After leaving he became a certified EMT, then was certified and joined the American Society of Clinical Pathologists (ASCP ), with which he maintains his certification. He now runs his own IT consulting firm in upstate New York and spends much of his time involved in recovery from his experience, working to expose these groups (for example, assisting in research for MTV’s production of The Cult Question) as well as helping others in their recovery.",
      "release": "2022-03-29T18:16:07Z",
      "duration": "00:33:05",
      "explicit": false,
      "youTubeId": "On-4cuUF-Xc",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=On-4cuUF-Xc"
      }
    },
    {
      "id": "4db2203c-9e86-440c-9c8c-c71e36382bd8",
      "title": "The Impact of Yesterday on Today",
      "description": "The Impact of Yesterday on Today (Lorna Goldberg and Ck Rardin)\nSunday, March 20th, 2022 \n\nDisclaimer: Views expressed on ICSA Websites or in ICSA\u0027s publications or events or other venues are those of the document\u0027s author(s) or speaker(s) and are not necessarily shared, endorsed, or recommended by ICSA or any of its directors, staff, or advisers.  \n\nTo a large extent, the cult environment has shaped many of the beliefs and character traits of S/MGAs. After they leave the cult, they may bring these beliefs and character traits with them. S/MGAs can discover that attitudes shaped within the cult might be impeding their present life. For example, in the cult, they were expected to reach perfection. This belief causes them to struggle with internalized pressure to be perfect after they leave. When S/MGAs fail at perfection, they typically might feel depressed or filled with shame. S/MGAs also might experience symptoms of C-PTSD, such as hypervigilant or hypovigilent (dissociative) behavior. Additionally, S/MGAs typically struggle with complicated emotions about their parents in the cult, and they might be uncertain about how to deal with their feelings after they leave the cult. Finally, the presenters will explore how post-cult relationships and therapy might aid former cult members.\n\nLorna Goldberg, LCSW, PsyA, Board Member and Past President of ICSA, is a clinical social worker and psychoanalyst in private practice and Director at the Institute of Psychoanalytic Studies. In 1976, she and her husband, William Goldberg, began facilitating a support group for former cult members that continues to meet monthly in their home in Englewood, New Jersey. She has cochaired ICSA’s Mental Health Committee, published numerous articles in professional journals about her therapeutic work with former cult members, and contributed chapters to several important texts on psychotherapy and cults. Most recently Lorna coedited (along with William Goldberg, Rosanne Henry, and Michael Langone) Cult Recovery: A Clinician’s Guide to Working With Former Members and Families (2017). Lorna and Bill are founding facilitators of the CT Workshop for Those Born or Raised in Cultic Groups.\n\nCk Rardin, facilitator, ICSA CT Workshop for Those Born or Raised in Cultic Groups, was born in California. His parents raised him in a cultic Catholic group and when he reached adolescence, they signed over their parental rights to the group. Ck was then sent to the cult’s headquarters in Itaquera, Sao Paulo, Brazil. He stayed in the group till age 26 when he gathered the courage and strength to leave the organization on his own. After leaving he became a certified EMT, then was certified and joined the American Society of Clinical Pathologists (ASCP ), with which he maintains his certification. He now runs his own IT consulting firm in upstate New York and spends much of his time involved in recovery from his experience, working to expose these groups (for example, assisting in research for MTV’s production of The Cult Question) as well as helping others in their recovery.",
      "release": "2022-03-22T03:25:10Z",
      "duration": "00:34:15",
      "explicit": false,
      "youTubeId": "aZdU3jQeQYM",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery",
        "Psychology",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aZdU3jQeQYM"
      }
    },
    {
      "id": "b9545ef0-68bd-42c7-88f0-04c5ec115392",
      "title": "After the Cult: Exploring Healthy Relationships for LGBQA\u002B Individuals",
      "description": "After the Cult: Exploring Healthy Relationships for LGBQA\u002B Individuals (Cyndi Matthews, Ashlen Hilliard)\n\nDisclaimer: Views expressed on ICSA Websites or in ICSA\u0027s publications or events or other venues are those of the document\u0027s author(s) or speaker(s) and are not necessarily shared, endorsed, or recommended by ICSA or any of its directors, staff, or advisers.  \n\nLesbian, gay, bisexual, queer, and asexual (LGBQA\u002B) individuals who were born or raised in cults may have dealt with a litany of constructs regarding what a healthy relationship looks like and how they were to live their lives while in their respective cults. These constructs could include mandates such as \u0022Only heterosexual relationships are allowed,\u0022 \u0022Sex is only for marriage,\u0022 \u0022Sex is only for procreation,\u0022 \u0022Masturbation will turn you gay,\u0022 and \u0022Wives, submit to your husbands including whenever they want sex,\u0022 along with a myriad of other constructs and beliefs. They may have been punished/rewarded by leaders/members requiring reparative therapy, public and private confessions, doctrinal lessons, marrying a person of the other gender, etc. This discussion will focus on how these constructs and mandates may have led to unhealthy expectations and outcomes in current and past relationships. Presenters will also discuss how healing can occur by re-evaluating and redefining what constitutes a healthy relationship, and ways LGBQA\u002B can re-imagine, explore, and reconstruct their present and future relationships.\n\nCyndi Matthews, PhD, LPC-S, NCC, is an experienced Counseling Clinician (15\u002B yrs.) working in Private Practice and as an Associate Professor in the Counseling (CMHC) program at The Chicago School of Professional Psychology (Dallas). She has earned a Ph.D. in Counseling and Counselor Education, a Masters in Counseling, and a Masters in Business - Organizational Behavior. Her passion for social justice and advocacy is exemplified in her counseling practice and research, both of which focus on effective counseling interventions for marginalized populations, such as cult survivors, domestic violence survivors, and LGBTQ\u002B populations. Based on her scholarship and clinical expertise she has researched and developed theory for counseling with second and multi-generation adult cult survivors.\n\nAshlen Hilliard (she/her), MSc, is the Director of Events for the International Cultic Studies Association (ICSA). Her MSc research focused on the relationship between reproductive coercion, psychologically abusive environments, and the extent of group identity in a sample of those who have left cultic groups. Before ICSA, she worked as a case manager in Salt Lake City, Utah helping individuals leaving polygamist groups out west. Ashlen relocated to Portland, Oregon in 2020 and is a co-organizer for the local Spiritual Abuse Forum for Education (SAFE) Meetups for survivors of cultic and spiritual abuse. She has presented at multiple ICSA conferences on a variety of topics and has been interviewed on podcasts and media programs. She published an article in ICSA Today 10.2 / 2019 on, “The Genesis, Text, and Implications of Utah House Bill 214: Office for Victims of Crime Amendments.” Ashlen enjoys living in Portland, Oregon with her partner Ryan, their blind dog Hamilton, and their cat Ferguson.",
      "release": "2022-03-15T19:21:47Z",
      "duration": "00:32:09",
      "explicit": false,
      "youTubeId": "uhpJF4sYv0Y",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uhpJF4sYv0Y"
      }
    },
    {
      "id": "ba39fc82-6090-4d55-9931-fd54f5545b9d",
      "title": "Counseling LGB\u002B Individuals Coming Out of Religious Cult",
      "description": "Counseling LGB\u002B Individuals Coming Out of Religious Cult (Cyndi Matthews)\n \nIn this discussion, we will focus on the presenter’s research findings and experience in counseling with lesbian, gay, and bisexual individuals (LGB) coming out of religious cults and fundamental religions. Lesbian and gay individuals who grow up in religious cults can face opposition and condemnation based on the individual’s affectional/sexual orientation. This opposition may come from religious doctrines and teachings, cult/church leaders, and even from family members. As a result of this opposition and condemnation, LGB individuals may struggle with depression, anxiety, drug/alcohol abuse, self-mutilation, and suicidal ideation. The researcher will describe the lived experiences of LGB individuals who grew up in fundamental religious organizations/cults that have subsequently left these groups and discuss best counseling practices to work with these individuals, based on experience and research.\n \nAfter this session participants will be able to:\n1. Participants will gain an understanding of the collective experiences of former cult members who identify as LGB\n2. Participants will identify coping mechanisms and strategies LGB individuals utilized to survive and thrive while in the group and after leaving the group\n3. Participants will identify best counseling practices to utilize when counseling with former cult members who identify as LGB\n\nPresenter Information:\n\nDr. Cyndi Matthews is a Licensed Professional Counselor-Supervisor (LPC-S) in Texas and a Nationally Certified Counselor (NCC) with over 17 years of counseling experience. She graduated from Texas A\u0026M Commerce with her PhD and is currently an Associate Counseling Professor at The Chicago School of Professional Psychology. She has also taught at Southern Methodist University, The University of Louisiana Monroe, and The University of North Texas at Dallas. Dr. Matthews\u0027 private practice specializes in Complex Trauma Recovery, Religious Abuse \u0026 Cult Recovery, and LGBTQGE\u002B Issues. Her research interests include complex trauma, religious/spiritual abuse, and counseling individuals born and raised in religious cults. Dr. Matthews is trained in Trauma-Focused Cognitive Behavioral Therapy (TF-CBT), EMDR, Gottman Couple’s Therapy, Sandtray Therapy, Telehealth Counseling, and Psychodrama.",
      "release": "2022-02-08T22:38:47Z",
      "duration": "00:34:06",
      "explicit": false,
      "youTubeId": "pBrSxv9SgsM",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pBrSxv9SgsM"
      }
    },
    {
      "id": "de298829-6604-4780-9807-47129e78b6dc",
      "title": "The Drama Triangle and the Power \u0026 Control Wheel Walk Into a Church",
      "description": "\u0022The Drama Triangle and the Power \u0026 Control Wheel Walk Into a Church\u0022 (Kathryn Keller, Ph.D.)\n \nIn this presentation, we will explore the Karpman Drama Triangle and the Power and Control Wheel and how these two models can be used together to conceptualize religious trauma for and with our clients. We\u0027ll examine how the models intersect, resulting in harmful dynamics, and how our clients can be empowered to recognize these dynamics as they continue to heal from their painful experiences. \n \nLearning Objectives:\n1. Identify the three roles in the Karpman Drama Triangle\n2. Identify abuses of power\n3. Identify how the Drama Triangle and abuses of power can intersect in high-control environments\n \nKathryn Keller, Ph.D.  is a Licensed Psychologist in Dallas, TX.  She co-owns a group counseling practice, Dallas Therapy Collective, where she sees clients for individual therapy. She conducted her doctoral dissertation on the topic of spiritual abuse, resulting in the first known measure of spiritual abuse. Kathryn’s practice is focused on clients who have experienced traumatic stress, including spiritual and religious trauma. She works particularly well with people who have experienced high levels of control in fundamentalist and evangelical Christian traditions.",
      "release": "2022-01-18T20:05:06Z",
      "duration": "00:29:39",
      "explicit": false,
      "youTubeId": "YJEo6lAyo4Y",
      "subjects": [
        "Psychology",
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YJEo6lAyo4Y"
      }
    },
    {
      "id": "2cb030f2-7b44-4379-ac1c-31727ff40c47",
      "title": "Ken Garrett\u0027s Story",
      "description": "Ken Garrett is the founder of the Spiritual Abuse Forum for Education Meetups in Portland, Oregon (SAFE). Ken shares his story about his experience with an abusive church.\n\nIf you are interested in attending a SAFE Meetup, you can check out: https://www.safeportland.org/",
      "release": "2021-12-22T20:23:38Z",
      "duration": "00:01:11",
      "explicit": false,
      "youTubeId": "Eyb9UMxHY-o",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Eyb9UMxHY-o"
      }
    },
    {
      "id": "e1e0cf25-a9ba-4fce-9e22-a1e0127c0a64",
      "title": "Meet the Author! Interview With Livia Bardin",
      "description": "Coping With Cult Involvement: A Handbook for Families \u0026 Friends\nInterview with Livia Bardin by Pat Ryan\n\n\u0022A cult involvement is often a situation to manage, not a problem to solve.\u0022\n\nFrom the Foreword:\nThis book, which was written to explain these forms, is built on the knowledge and experience gained from years of working with families in workshops and in private consultations. This is not a “fun” book. Nor is it a book that aims to validate feelings of anger, hurt, helplessness, and fear, although it does that to some extent. This book is a handbook, a tool designed to help you achieve a goal, namely, to help a loved one. As with all tools, the book requires effort to learn how to use it. It is not something that you merely read. It is something that you use, something that you wrestle with, that you come back to again and again.\n\nIf you are willing to give the requisite time and mental exertion that this book demands, I am confident that you will find it to be extremely helpful. It may not solveyour problem, for, as Mrs. Bardin states in the Introduction, a cult involvement is often a situation to manage, not a problem to solve. The book will, however, make you confident that you are doing all that you realistically can to manage, if not solve, the problem that has caused you so much distress.\n\nAbout the Author:\nLivia Bardin, MSW, is a clinical social worker who has been engaged with cult victims and their families for more than fifteen years. She is particularly interested in the interface between high-demand groups and cults and mainstream society. Her research in this area has been published in the Cultic Studies Review and the Journal of Public Child Welfare. Now retired, Ms. Bardin has provided training on cult-related issues for mental health professionals in the Washington area and elsewhere, She is the author of Coping with Cult Involvement: A Handbook for Families and Friends of cult members. In 2014 Ms. Bardin received ICSA\u0027s Margaret T. Singer Award.",
      "release": "2021-12-22T19:34:34Z",
      "duration": "00:28:11",
      "explicit": false,
      "youTubeId": "riMHknSUrxQ",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=riMHknSUrxQ"
      }
    },
    {
      "id": "a8ca586e-6690-466d-ad69-51fcaf1f03e6",
      "title": "Spiritual Abuse Forum for Education (SAFE) Meetups in Portland, OR",
      "description": "Interview between Ken Garrett and Ashlen Hilliard on the Spiritual Abuse Forum for Education (SAFE) Meetups in Portland, Oregon.\n\nIn 2019, SAFE partnered with ICSA for its first regional conference in Portland, Oregon. Over 70 people attended from the local area and surrounding states. SAFE is also listed as an ICSA Local Meetup.\n\nThe Spiritual Abuse Forum for Education is a regular meetup in Portland, Oregon for those who have left or are considering leaving high-demand religious groups, and for those with friends and loved ones who are members of such groups. \n\nSAFE\u0027s Mission:\nWe are survivors of spiritual abuse, and gather to form a friendly, growing, gracious community as we walk a path of healing from our abuse. \n\nSAFE offers Education, Support, and Community.\n\nThere is no cost, no demands, no expectation that attendees will speak of their abuse, and no commitment or signing up! \n\nThis group is led by survivors and educators experienced with spiritual abuse.\n\nIf you are interested in learning more about SAFE you can visit https://www.safeportland.org/\n\nSpecial thanks to:\n\nWest of Center Productions \nJoe Jatcko, Producer\nForrest Brennan, Videographer\nforrestbrennan.com",
      "release": "2021-12-22T18:17:50Z",
      "duration": "00:06:50",
      "explicit": false,
      "youTubeId": "K5UOl1xthH4",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K5UOl1xthH4"
      }
    },
    {
      "id": "8bcfab69-c26b-400d-bc14-2fe08e3a6f1a",
      "title": "The Heart of Cult Recovery: Finding Compassion for the Self",
      "description": "The Heart of Cult Recovery: Finding Compassion for the Self (Daniel Shaw LCSW.)\n\nICSA is pleased to introduce our new monthly series for our mental health community. Each month will feature a different clinician discussing some aspect of clinical work. Each presentation will serve as a stimulus for questions and a discussion of clinical issues, which will occur during the following hour.\n\nDaniel Shaw LCSW will discuss his clinical approach to working with cult survivors. His approach is based on more than 25 years of experience as a psychoanalyst, and on his own experience of 13 years living and working in the ashram of a guru he came to see as a cult leader. He will discuss the importance of psycho-education, about the psychology of the cult leader, and about the effects on survivors of trauma. His approach emphasizes the importance of self-compassion, the antidote to self-alienation, through the use of self-reflection and self-regulation skills.\n\nAfter completing this webinar, participants will be able to:\n1. Define self-alienation and identify the symptoms of self-alienation in cult survivors. \n2. Identify the psychopathology of the traumatizing narcissist, including their specific abusive behaviors that negatively impact the functioning of cult survivors.\n3. Educate cult-survivor clients to develop self-reflection and affect regulation skills in their process of trauma recovery. \n\nBibliography:\nBenjamin, J. (1998). The bonds of love: Psychoanalysis, feminism, and the problem of domination. New York: Pantheon Books.\nFisher, J. (2017). Healing the fragmented selves of trauma survivors: Overcoming internal self-alienation. New York: Routledge.\nGhent, E. (1990).  Masochism, Submission, Surrender1—Masochism as a Perversion of Surrender. Contemp. Psychoanal., 26:108-136\nAccess here: https://www.wawhite.org/uploads/PDF/E1f_9%20Ghent_E_Masochism.pdf\n\nDaniel Shaw, LCSW, is the author of Traumatic Narcissism: Relational Systems of Subjugation, published by Routledge. His affiliations include: Psychoanalyst, Private Practice, New York City and Nyack, NY; Faculty and Clinical Supervisor, The National Institute for the Psychotherapies (NIP), New York, NY; Clinical Supervisor and Faculty, Westchester Center for the Study of Psychoanalysis and Psychotherapy, NY; Adjunct Clinical Supervisory, Smith College of Social Work, MA; former co-chair, Continuing Education Committee, The International Association for Relational Psychoanalysis and Psychotherapy. Shaw spent thirteen years as a staff member in Siddha Yoga (SYDA Foundation). There he wore many hats, including: manager of the residential Manhattan facility, educator, spokesperson, public relations coordinator, community organizer, and writer/director of public programs. Shaw exited Siddha Yoga in 1994, published an Open Letter about Siddha Yoga on the internet in 1995, and helped create the Leaving Siddha Yoga website, one of the first internet websites for ex cult members. Shaw is the author of Traumatic Abuse in Cults: A Psychoanalytic Perspective, published in the Cultic Studies Journal, numerous psychoanalytic papers, and the editor of a special issue on the traumatizing narcissist in ICSA\u0027s International Journal of Cultic Studies.. Mr. Shaw is available through Skype and leads the monthly New York area ICSA group with Chris Carlson. This group offers support, education and interaction for all those who have been harmed by, or want to learn about high demand groups. Website: www.danielshawlcsw.com Email: danielshawlcsw@gmail.com",
      "release": "2021-11-18T20:05:07Z",
      "duration": "00:34:22",
      "explicit": false,
      "youTubeId": "fBOqHAHL8dA",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fBOqHAHL8dA"
      }
    },
    {
      "id": "b90664c4-f996-4ccc-8140-1cd04dde8a83",
      "title": "\u0022It\u0027s Hard to put Into Words:\u0022 Understanding My Experience with Spiritual Abuse",
      "description": "\u0022It\u0027s Hard to put Into Words:\u0022 Understanding my Experience with Spiritual Abuse (Ashlen Hilliard)\nSunday, November 7th, 2021\n\nDisclaimer: Views expressed on ICSA Websites or in ICSA\u0027s publications or events or other venues are those of the document\u0027s author(s) or speaker(s) and are not necessarily shared, endorsed, or recommended by ICSA or any of its directors, staff, or advisers.  \n\nAbout this presentation (Second and Multigenerational Adult Former Cult Member Recovery Series): \nSpiritual abuse may present itself in many different ways, and have lasting impacts. This talk will focus on how unhealthy Christian churches may cultivate an environment for spiritual abuse to thrive, the role controlling theology can play in creating a high-pressure environment, and conclude with questions you can raise about a group to help evaluate spiritual abuse, the potential for it, or if high-control scenarios already exist. Understanding my experience was essential for my recovery to begin! The context for this discussion will pull from reflections of being a born and raised former member of a fundamentalist Christian sect.\n\nOverview of series:\nThis series is specifically for second and multi-generational adult former cult members, however, this is going to be the first program for S/MGAs that is open to all. In the past, ICSA workshops for this population have been limited to those who were themselves born or raised in cults. But we see the increasing need for those outside of this population to learn about the unique recovery issues relevant to S/MGAs.\n\nPresenter Bio:\nAshlen Hilliard is the Director of Events for the International Cultic Studies Association (ICSA). Before ICSA, she worked as a case manager in Salt Lake City, Utah that helped individuals leaving polygamy out west. Ashlen relocated to Portland, Oregon in 2020 where she is involved in local Spiritual Abuse Forum for Education (SAFE) Meetups for survivors of cultic and spiritual abuse. Ashlen facilitates support groups and meetings online for former members of cultic groups. \n\nHer current focuses with ICSA are event organization and former member outreach. Ashlen has also presented at multiple ICSA conferences, and continues moderating online conference and webinar programs. She has been interviewed on cults on NPR One Podcast Series with FGCU and The Tennessee Holler. She has published an article in ICSA Today 10.2 / 2019 on, The Genesis, Text, and Implications of Utah House Bill 214: Office for Victims of Crime Amendments.\n\nShe is currently pursuing her Masters in the Psychology of Coercive Control through the University of Salford.",
      "release": "2021-11-10T20:03:38Z",
      "duration": "00:27:24",
      "explicit": false,
      "youTubeId": "q09fB4YGIlw",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=q09fB4YGIlw"
      }
    },
    {
      "id": "74f7d8ea-7db0-4b1d-b0c5-9c56b2ad1fb8",
      "title": "The Harsh Conscience",
      "description": "The Harsh Conscience (Lorna Goldberg and Heather Zweiback)\nSunday, October 24th, 2021\n\nDisclaimer: Views expressed on ICSA Websites or in ICSA\u0027s publications or events or other venues are those of the document\u0027s author(s) or speaker(s) and are not necessarily shared, endorsed, or recommended by ICSA or any of its directors, staff, or advisers.  \n\nAbout this presentation (Second and Multigenerational Adult Former Cult Member Recovery Series):\nThis presentation will focus on how those born and raised in cults (SGAs/MGAs) develop a harsh conscience. Children will dissociate from their emotional reactions to abuse or neglect in an attempt to protect themselves and survive in the face of overwhelming anxiety. Dissociation allows them to continue to rely on a frightening or abandoning adult. Children defend themselves further by identifying with their perpetrator\u0027s attitude. The cult leader or parent reinforces this attitude by creating a punitive and shaming world for the child. Living in such a harsh reality has numerous ramifications for the character of SGA/MGAs. SGA/MGAs continue to struggle with their harsh conscience after they leave the cult. To help, therapists can provide a compassionate and respectful environment where former cult members gain a broader sense of reality by connecting the present to the past. \n\nOverview of series:\nThis series is specifically for second and multi-generational adult former cult members, however, this is going to be the first program for S/MGAs that is open to all. In the past, ICSA workshops for this population have been limited to those who were themselves born or raised in cults. But we see the increasing need for those outside of this population to learn about the unique recovery issues relevant to S/MGAs.\n\nPresenter Bios:\nHeather Zweiback spent 8 years of her early childhood in a bible-based group. She has attended ICSA’s CT Workshop for Those Born or Raised in Cultic Groups since 2015, becoming a co-facilitator in 2020. She is certified as a Victim Advocate through the National Advocate Credentialing Program and has degrees in Safety, Human Resources and Accounting. (heatherzweiback@yahoo.com)\n\nLorna Goldberg, LCSW, PsyA, Board Member and Past President of ICSA, is a clinical social worker and psychoanalyst in private practice and Director at the Institute of Psychoanalytic Studies. In 1976, she and her husband, William Goldberg, began facilitating a support group for former cult members that continues to meet monthly in their home in Englewood, New Jersey. She has cochaired ICSA’s Mental Health Committee, published numerous articles in professional journals about her therapeutic work with former cult members, and contributed chapters to several important texts on psychotherapy and cults. Most recently Lorna coedited (along with William Goldberg, Rosanne Henry, and Michael Langone) Cult Recovery: A Clinician’s Guide to Working With Former Members and Families (2017). Lorna and Bill are founding facilitators of the CT Workshop for Those Born or Raised in Cultic Groups.",
      "release": "2021-10-25T21:36:08Z",
      "duration": "00:31:12",
      "explicit": false,
      "youTubeId": "L7eN4mPO-mE",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=L7eN4mPO-mE"
      }
    },
    {
      "id": "45458e1d-e2f9-4cc9-9701-a5d8838219a1",
      "title": "The Impact of Cults on Childhood Development",
      "description": "The Impact of Cults on Childhood Development Presented (Eva Mackey)\nSunday, October 17th, 2021\n\nDisclaimer: Views expressed on ICSA Websites or in ICSA\u0027s publications or events or other venues are those of the document\u0027s author(s) or speaker(s) and are not necessarily shared, endorsed, or recommended by ICSA or any of its directors, staff, or advisers.  \n\nAbout this presentation (Second and Multigenerational Adult Former Cult Member Recovery Series):\nThis presentation compares healthy childhood development with that which occurs in cults. Viewers will learn the difference between healthy and unhealthy attachment patterns. The cult involved parent is likely to display unhealthy attachment patterns which will negatively impact the child. Erickson’s eight developmental stages will be reviewed with an emphasis on how they may not be successfully complete by children in cults. Children develop survival strategies in response the unhealthy caregiver and environment. These strategies, while necessary for the child, may create problems as the child grows into an adult. These problems include but are not limited to the following: Problems with the development of a unique identity and sense of self. 2. Trouble with affect regulation and inability to self-soothe. Those who were raised in cults often struggle with anxiety and depression. 3. Trouble with setting and maintaining healthy boundaries. 4. Difficulty with adult relationships.\n\nOverview of series:\nThis series is specifically for second and multi-generational adult former cult members, however, this is going to be the first program for S/MGAs that is open to all. In the past, ICSA workshops for this population have been limited to those who were themselves born or raised in cults. But we see the increasing need for those outside of this population to learn about the unique recovery issues relevant to S/MGAs.\n\nAbout the speaker:\nEva Mackey Meyrat, MD, is a second-generation adult former cult member. Her mother became a devotee of an Indian guru in 1975 when she was 1 year old. He taught a branch of Hinduism called Advaita Vedanta; a non-dualistic philosophy which teaches that the self is one with the ultimate truth or reality. Half of Eva’s childhood was spent in the ashram in India, where she and the other children were unsupervised much of the time. Despite the upheavals and instability that characterized her childhood, Eva managed to get out of the cult at the age of 16 and eventually earned her MD degree from the University of Texas Medical Branch in Galveston. Dr. Mackey has a busy family practice, and she lives near Dallas with her husband and four children.",
      "release": "2021-10-18T19:55:54Z",
      "duration": "00:36:49",
      "explicit": false,
      "youTubeId": "LqLh7KmsWY8",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LqLh7KmsWY8"
      }
    },
    {
      "id": "3880a4b4-811f-4d92-98fd-096291a6e53d",
      "title": "Common Experiences and Reactions of Second Generation Adults \u0026 Multi-Generation Former Cult Members",
      "description": "Common Experiences and Reactions of Second Generation Adults and Multi-Generation Former Cult Members (Bill Goldberg\nSunday, October 10th, 2021\n\nDisclaimer: Views expressed on ICSA Websites or in ICSA\u0027s publications or events or other venues are those of the document\u0027s author(s) or speaker(s) and are not necessarily shared, endorsed, or recommended by ICSA or any of its directors, staff, or advisers.  \n\nAbout this presentation (Second and Multigenerational Adult Former Cult Member Recovery Series):\nPeople can recover from trauma through therapy, nurturing relationships and self-care. Regardless of the primary focus of a particular cult (e.g. religious, political, therapeutic, philosophical, etc.) practically everyone who has been in one experienced feelings and reactions that were common to most cult encounters. These reactions and experiences were the predictable results of the group dynamics and manipulations common to all cults, even though their cult may have offered a self-serving mystical or magical explanation for them. For the initial presentation in this recovery workshop, the presenter will describe some common experiences of second-and multi-generation cult members (SGA\u0027s/MGA\u0027s). The goal of this presentation is to help the participants to define and describe these experiences as well as to consider non-mystical explanations for them.\n\nOverview of series:\nThis series is specifically for second and multi-generational adult former cult members, however, this is going to be the first program for S/MGAs that is open to all. In the past, ICSA workshops for this population have been limited to those who were themselves born or raised in cults. But we see the increasing need for those outside of this population to learn about the unique recovery issues relevant to S/MGAs.\n\nAbout the speaker:\nBill Goldberg, LCSW, PsyA, is a clinical social worker and psychoanalyst with more than forty years’ experience working with former cult members. He and his wife, Lorna, colead a support group for former cult members, which has been meeting for more than forty years. It is the oldest group of its kind in the world. In 2007, Bill retired from the Rockland County, New York Department of Mental Health, where he directed several programs and clinics. He is presently an adjunct professor in the Social Work and Social Science departments of Dominican College, and he is on the faculty of the Institute for Psychoanalytic Studies. Bill has published numerous articles in books and professional journals and is a frequent speaker at ICSA conferences. Among other awards, in 2010, Bill was the recipient of ICSA’s Lifetime Achievement Award. He is also coeditor of ICSA\u0027s Cult Recovery: A Clinician\u0027s Guide to Working With Former Members and Their Families, published in 2017.",
      "release": "2021-10-11T22:58:02Z",
      "duration": "00:28:07",
      "explicit": false,
      "youTubeId": "lIU-0ucAbNA",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lIU-0ucAbNA"
      }
    },
    {
      "id": "e52a03d8-db0f-4647-bd46-f688ba2b7be0",
      "title": "Lessons Learned: Therapy with Survivors of Cult Groups or Relationships",
      "description": "Lessons Learned: Therapy with Survivors of Cult Groups or Relationship (Lorna Goldberg, LCSW, PsyA.)\n\nICSA is pleased to introduce our new monthly series for our mental health community. Each month will feature a different clinician discussing some aspect of clinical work. Each presentation will serve as a stimulus for questions and a discussion of clinical issues, which will occur during the following hour.\n\nIn her 45 years working with former cult members, Lorna has learned valuable clinical lessons from her clients and colleagues. She will discuss these lessons and share some insights discovered from her personal therapy.  This overview presentation will introduce a monthly series of educational programs for our mental health community.",
      "release": "2021-10-04T18:10:14Z",
      "duration": "00:35:28",
      "explicit": false,
      "youTubeId": "kiqwn6a9YdY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kiqwn6a9YdY"
      }
    },
    {
      "id": "85381102-3694-4fc2-bd19-6f145d77aa71",
      "title": "Meet the Author! Interview with Maria Peregolise",
      "description": "THE FIRST OF ITS KIND - Testimony from a 2nd Generation Adult, Born and Raised in, and Leaving a Cult Leader of The URANTIA Book\nInterview with Maria Peregolise by Patrick Ryan\n\nYou can now listen to Author Maria Peregolise speak about her new book, \u0022Culted Child: The True Story of a Daughter Disciple\u0022.\n\nAuthor and Educator Maria Peregolise was born into and raised in The URANTIA Book cult, with her father as her leader. Her interest is in sharing research that identifies aspects of how a coercive environment may affect the growing number of those born into and raised in manipulative systems.\n\nMaria shares her experiences on Rachel Berstein\u0027s IndoctriNATION Podcast, “Thought Adjusters w/ Maria Peregolise,”\n\nhttps://www.patreon.com/posts/thought-w-maria-40364743?utm_medium=post_notification_email\u0026utm_source=post_link\u0026utm_campaign=patron_engagement, or https://soundcloud.com/indoctrinationshow/unseen-friends-w-maria-peregolise\n\nShe has been published in Art Ascent Magazine, winning the Gold Writer Award, with “God the Father: A Portrait of Divinity,” https://artascent.com/maria-d-peregolise/, and has a testimonial article on the Art Ascent website, https://artascent.com/artascent-has-helped-me-charge-through-a-terrifying-hurdle/. Other articles are “Journal Entry at Age Thirteen,” Peregolise, M. (2020). ICSA Today, Vol. 11, No. 2. (2020 - PDF of Issue). Arts: Poetry - Maria Peregolise (24-25). https://www.icsahome.com/memberelibrary/it, and iGotOut, “Just Trust Me...,” https://www.igotout.org/written-stories-1/just-trust-me\n\nShe has a Bachelor of Science in Elementary Education, a Master of Science in Learning Disabilities, and has taught for more than 25 years. Married to her high-school sweetheart for 36 years, they have three grown children: a writer, a musician, and an artist.\n\nYou can purchase Maria\u0027s book here: https://www.amazon.com/Culted-Child-Story-Daughter-Disciple/dp/1736249711/ref=sr_1_3?crid=310CY64H6HEWV\u0026dchild=1\u0026keywords=culted\u002Bchild\u002Bthe\u002Btrue\u002Bstory\u0026qid=1629154044\u0026sprefix=culted%2Caps%2C249\u0026sr=8-3",
      "release": "2021-08-20T03:48:42Z",
      "duration": "01:00:19",
      "explicit": false,
      "youTubeId": "0AAR7S9p_BM",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0AAR7S9p_BM"
      }
    },
    {
      "id": "21247f57-86af-48ef-9974-da313558fe50",
      "title": "Malignant Narcissism as the Core Madness of the Cult Leader",
      "description": "Malignant Narcissism as the Core Madness of the Cult Leader (Charles Zeiders and Peter Devlin)\n\nLearning Objectives:\n\n-Utilize case vignettes to develop a profile of the malignant narcissist in cult leadership (MNL).\n-Identify the four principal traits of malignant narcissism in leadership and associated features of this dangerous psychopathology.\n-Articulate controversies surrounding the treatability of the MNL character.\n-Identify the pathogenic features of the MNL in the context of his or her cult-like organization, and identify specific manipulative behaviors MNL’s and their confederates use to gain followers, ascend to power, and maintain socially destructive power.\n-Articulate clinically useful insight regarding MNL pathology concerning sexuality, traumatizing style, and their uncanny allure.\n\nCharles Zeiders, PsyD, is the T.S. Eliot Lecturer for Humanities and Spiritual Psychology, Reformed Episcopal Seminary in metropolitan Philadelphia. A clinical and forensic psychologist, Dr. Zeiders is Practice Director of CCT Associates of the Main Line. His books include The Clinical Christ, Faith, Forensics, and Firearms, and volumes of depth-psychological poetry. Dr.Zeiders is an expert in psychopathology.\n\nPeter Devlin, LGSW, is a psychotherapist at Capitol Hill Consortium for Counseling and Consultation in Washington, DC. He received his BA from the University of Pennsylvania and his MSW from the University of Southern California. His research interests include personality disorders, trauma, and the psychology of power.",
      "release": "2021-06-04T21:50:34Z",
      "duration": "02:11:09",
      "explicit": false,
      "youTubeId": "ZrPyH3Q8mdg",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZrPyH3Q8mdg"
      }
    },
    {
      "id": "b2043364-700e-4ff2-a3f7-a453ee71241c",
      "title": "Meet the Author! Interview With Carli McConkey - Q\u0026A Included!",
      "description": "\u0022The Cult Effect: A True Story of Mind Control in Australia 1996 - 2010\u0022.\nInterview with Carli McConkey by Patrick Ryan\n\n\u0022A gripping account of the brutal impact of spiritual and violent extremism. Carli McConkey was 21 years old when she happened upon New Age guru, Natasha Lakaev, and her personal development company, Life Integration Programmes, at the Mind Body Spirit Festival in Sydney, Australia in 1996. What at first appeared professional and promising, became a vehicle for psychological and physical abuse. Over the next thirteen years, Carli lost her freedom…her mind…and her family. This memoir demonstrates the subtle and insidious process of mind control, gives insights into the period of recovery after escape, and shows how determination and strength can overcome adversity.\u0022 You can purchase her book here: https://www.amazon.com/Cult-Effect-Story-Control-Australia-ebook/dp/B074DFJ3BH#:~:text=The%20Cult%20Effect%20is%20an,absolutely%20never%20signed%20up%20for.\n \nAbout the Author\n\u0022Carli McConkey spent over 13 years in a destructive cult from the age of 21 to 35 and escaped in January, 2010. She says \u0027escape\u0027, because she was brainwashed into believing that she could not leave. If she did, either her three children would be taken from her, or she and her family would die in Armageddon, prophesised by the cult leader for December 2012. Carli is a normal, everyday person, who is intelligent and from a loving family, and yet she found herself in this situation. Carli wishes to help educate family and friends of current and former cult members so that they are better able to understand the process of mind control and support their loved ones through recovery. She also hopes that sharing her story, personal insights and triumphs, will help support fellow ex-cult members and prevent others from falling prey to such predators. Carli completed a BA (Communication), majoring in Organisational Communication and Public Relations, at Charles Sturt University, Bathurst, in 1995. She has been rebuilding her career since leaving the cult, working as an Executive Assistant. Carli lives in Sydney with her three children.\u0022",
      "release": "2021-04-26T19:26:55Z",
      "duration": "01:05:54",
      "explicit": false,
      "youTubeId": "-OqAue2potU",
      "subjects": [
        "Cult Psychology",
        "Self-Help",
        "Transcendental Meditation",
        "Universal Knowledge"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-OqAue2potU"
      }
    },
    {
      "id": "48c9e38f-368a-4e40-87f8-5926a62a230a",
      "title": "Meet the Author! Interview With Nori Muster",
      "description": "\u0022Betrayal of the Spirit\u0022 \nInterview with Nori Muster by Joseph Szimhart\n\nNori J. Muster joined the International Society of Krishna Consciousness (ISKCON)--the Hare Krishnas--in 1978, shortly after the death of the movement\u0027s spiritual master, and worked for ten years as a public relations secretary and editor of the organization\u0027s newspaper, the ISKCON World Review. In this candid and critical account, Muster follows the inner workings of the movement and the Hare Krishnas\u0027 progressive decline.\nCombining personal reminiscences, published articles, and internal documents, Betrayal of the Spirit details the scandals that beset the Krishnas--drug dealing, weapons stockpiling, deceptive fundraising, child abuse, and murder within ISKCON–as well as the dynamics of schisms that forced some 95 percent of the group\u0027s original members to leave. In the midst of this institutional disarray, Muster continued her personal search for truth and religious meaning as an ISKCON member until, disillusioned at last with the movement\u0027s internal divisions, she quit her job and left the organization.\n\nIn a new preface to the paperback edition, Muster discusses the personal circumstances that led her to ISKCON and kept her there as the movement\u0027s image worsened. She also talks about \u0022the darkest secret\u0022–child abuse in the ISKCON parochial schools--that was covered up by the public relations office where she worked. \nhttps://www.amazon.com/Betrayal-Spirit-Headlines-Krishna-Movement/dp/0252065662\n\nAbout Nori:\nNori Muster is a journalist, researcher, and artist based in Arizona. She earned her Master of Science degree at Western Oregon University studying creative art therapy. She started writing full time for publication in 1981, and published Betrayal of the Spirit, a memoir, in 1997.\nNori has written two follow-up books, Child of the Cult and Cult Survivor\u0027s Handbook. She writes journal articles on the subject, is a spokesperson to the media, and a regular presenter at International Cultic Studies Association (ICSA) conferences.\n\nNori wrote her own I Ching (Learning to Flow with the Dao), and her own positive thinking book (Dreaming Peace), for people in the post-9/11 world. She also published Positive Quotations, gathered during her research for Dreaming Peace.",
      "release": "2021-03-31T06:08:36Z",
      "duration": "00:33:07",
      "explicit": false,
      "youTubeId": "nYK-hrcw7yA",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nYK-hrcw7yA"
      }
    },
    {
      "id": "c8805f75-543f-47d6-9960-5f4839d2aed2",
      "title": "Meet the Author! Interview With Alexandra Stein",
      "description": "Terror, Love, \u0026 Brainwashing: Attachment in Cults and Totalitarian Systems\u0022\nInterview with Alexandra Stein by Joseph Szimhart\n \n\u0022Written by a cult survivor and renowned expert on cults and totalitarianism, Terror, Love and Brainwashing draws on the author’s 25 years of study and research to explain how almost anyone, given the right set of circumstances, can be radically manipulated to engage in otherwise incomprehensible and often dangerous acts.\n \nIllustrated with compelling stories from a range of cults and totalitarian systems, from religious to political to commercial, the book defines and analyses the common and identifiable traits that underlie almost all these groups. It focuses on how charismatic, authoritarian leaders control their followers’ attachment relationships via manipulative social structures and ideologies so that, emotionally and cognitively isolated, they become unable to act in their own survival interests. Using the evolutionary theory of attachment to demonstrate the psychological impact of these environments, and incorporating the latest neuroscientific findings, Stein illustrates how the combined dynamic of terror and ‘love’ works to break down people’s ability to think and behave rationally. From small local cults to global players like ISIS and North Korea, the impact of these movements is widespread and growing.\n \nThis important book offers clarity and a unique perspective on the dynamics of these systems of control, and concludes with guidance to foster greater awareness and prevention. It will be essential reading for mental health professionals in the field, as well as policy makers, legal professionals, cult survivors, and their families, as well as anyone with an interest in these disturbing groups. Students of social and developmental psychology will also find it fascinating.\u0022\n\nhttps://www.amazon.com/Terror-Love-Brainwashing-Attachment-Totalitarian/dp/1138677973",
      "release": "2021-03-21T15:00:15Z",
      "duration": "00:34:02",
      "explicit": false,
      "youTubeId": "tYtjKktiMYE",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tYtjKktiMYE"
      }
    },
    {
      "id": "7ae84577-32a6-4796-a424-ad9b2d63b5e5",
      "title": "Meet the Author! Interview With Mike King",
      "description": "\u0022Deceived: An Investigative Memoir of the Zion Society Cult\u0022 \nInterview with Mike King by Joseph Szimhart\n\n“Deceived” is a memoir of Detective Mike King’s 1991 investigation and the ultimate take-down of a deviant polygamous cult called the Zion Society. For over a decade, gossip swirled around northern Utah that a secretive group of religious zealots were buying up homes to take over a developing neighborhood in an Ogden community. The homes were known far and wide for their immaculately landscaped yards. Rumors spread that a well-known landscaper in the city had proclaimed himself to be a prophet of god and was being commanded to start his own secret religion that promoted polygamy. It was also believed these extremists were stockpiling weapons as part of their doomsday beliefs. In reality, the leader was directing some of the most repugnant crimes against women and children ever seen in the state. The hidden atrocities of the cult may never have been discovered if not for the courage of one of its members. Thirty years later, victims reconnected with each other and with the lead investigator to address the shortcomings of the criminal justice system regarding child victims.\n\nYou can purchase \u0022Deceived\u0022 here: https://www.profilingevil.com/store/p/zionsociety",
      "release": "2021-03-13T21:00:02Z",
      "duration": "00:39:45",
      "explicit": false,
      "youTubeId": "9FAiGRY36iI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9FAiGRY36iI"
      }
    },
    {
      "id": "f0417570-2d1d-49f2-b371-823dee3578b5",
      "title": "Meet the Author! Interview With Lisa Kohn",
      "description": "\u0022To the Moon and Back: A Childhood Under the Influence\u0022\nInterview with Lisa Kohn by Joseph Szimhart\n\nINDIES Book of the Year Bronze - Rubery Book Award Shortlist - National Indie Excellence Awards Finalist - Readers\u0027 Favorite Book Award Silver Medal - International Book Awards Finalist - London Book Festival Honorable Mention\n\nBorn to hippie parents and raised in New York City\u0027s East Village in the 1970s, Lisa\u0027s early years were a mixture of encounter groups, primal screams, macrobiotic diets, communes, Indian ashrams, Jefferson Airplane concerts in Central Park, and watching naked actors on off-Broadway stages during the musical HAIR. By the time her older brother was ten, Lisa\u0027s father had him smoking pot. By the time Lisa was ten, Lisa\u0027s mother had them pledging their lives to the Unification Church (the \u0022Moonies\u0022) and self-appointed Messiah, Reverend Sun Myung Moon. As a child Lisa knew the ecstatic comfort of inclusion in a cult and as a teenager the torment of rebelling against it. As an adult, Lisa struggled to break free from the hold of abuse and the scars in her heart, mind, and psyche--battling her own addictions and inner demons and searching her soul for a sense of self-worth. Told in spirited candor, to the moon and back reveals how one can leave behind absurdity and horror and create a life of intention and joy. \n\nAbout the Author: The best seats Lisa Kohn ever had at Madison Square Garden were at her mother\u0027s wedding, and the best cocaine she ever had was from her father\u0027s friend, the judge. Lisa was raised in a religious cult (the Moonies) with her mom and in a life of \u0022sex, drugs, and squalor\u0022 in New York City\u0027s East Village in the 1970s with her dad. Lisa is now a teacher and public speaker who owns a leadership consulting and executive coaching firm and who works to bring to others the tools, mind-shifts, and practices she’s found that have helped her heal from her crazy, mixed-up childhood.\nYou can read more at her website, www.lisakohnwrites.com, where you can also download the first chapter of her book, watch and read Lisa’s interviews in media such as Megyn Kelly Today, Daily Mail, Marie Claire, and hear her podcast interviews for IndoctrNation, Generation Cult, and Lionrock. Lisa will always tell you that she is a native New Yorker, but she currently lives in Pennsylvania with her husband and two children, whenever they’re around. Keep up with Lisa at www.chatsworthconsulting.com and www.lisakohnwrites.com or follow her on Twitter (@thoughtfulldrs and @lisakohnwrites), Facebook, and LinkedIn.",
      "release": "2021-03-06T21:00:08Z",
      "duration": "00:34:07",
      "explicit": false,
      "youTubeId": "Msv5ofdmaDs",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Msv5ofdmaDs"
      }
    },
    {
      "id": "83d86ffe-9775-4b3e-9215-78049540df6b",
      "title": "Meet the Author! Interview With Sarah Edmondson",
      "description": "\u0022Scarred: The True Story of How I Escaped NXIVM, the Cult That Bound My Life\u0022\nInterview with Sarah Edmonson by Joseph Szimhart\n\nSarah Edmondson is an actress and voice-over artist. She is featured in the CBC investigative podcast Uncover: Escaping NXIVM and The Vow, the HBO documentary series on NXIVM. She is launching her own podcast “A Little Bit Culty” and initiating a movement for healing from cultic abuses called #IGotOut​ (igotout.org)\n\nAs seen in the HBO docuseries THE VOW: The shocking and subversive memoir of a 12-year-NXIVM-member-turned-whistleblower, and her inspiring true story of abuse, escape, and redemption. \u0022\u0027Master, would you brand me? It would be an honor.\u0027 From the second I climb onto the table, acutely aware that I am lying in the sweat of my sisters, I will have blocked that out. Lying there completely naked, I am at my most vulnerable but determined to prove my strength. I try to keep my legs closed as my body wills itself to protect my most private area. . . . I tell myself: I am a warrior. I birthed a human. I can handle pain. But nothing could have ever prepared me for the feel of this fire on my skin.\u0022\n\nScarred is Sarah Edmondson\u0027s compelling memoir of her recruitment into the NXIVM cult, the 12 years she spent within the organization, her breaking point, and her harrowing fight to get out, to expose Keith Raniere and the leadership, to help others, and to heal. Complete with personal photographs, Scarred is also an eye-opening story about abuses of power, female trust and friendship, and how sometimes the search to be \u0022better\u0022 can override everything else.",
      "release": "2021-03-01T01:26:08Z",
      "duration": "00:37:33",
      "explicit": false,
      "youTubeId": "HcC3WvGPfyQ",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HcC3WvGPfyQ"
      }
    },
    {
      "id": "6effd2e2-53c5-4ef1-b5af-a053c1d824f9",
      "title": "Psycho-Social Aspects of Belief in Conspiracy Theories",
      "description": "Psycho-Social Aspects of Belief in Conspiracy Theories (Bill Goldberg, LCSW, PsyA)\n\nMore than any other time in recent history, conspiracy theories have contaminated political thinking in this country. Bizarre theories and explanations for current events, both real and imagined, have become an acceptable part of our public dialogue; and some political leaders have given credence to speculations about the motivations of opponents that would once have been viewed as embarrassingly ludicrous.  In this lecture and conversation, we will explore this phenomenon from a psychoanalytic viewpoint. We will discuss the historical antecedents of today\u0027s conspiracy theories and the factors in the Information Age that make it unique. We will also discuss developmental and defensive factors that render otherwise intelligent individuals susceptible to conspiracy theories. \n\nLearning Objectives:\n\n1. Participants will be able to identify the similarities and differences between today’s conspiracy theories and their historical antecedents.\n2. Participants will be able to identify the developmental factors that render people vulnerable to the appeal of conspiracy theories.\n3. Participants will learn intervention techniques that can help clients who believe in bizarre conspiracy theories.\n\nWilliam Goldberg, LCSW, PsyA, is a clinical social worker and psychoanalyst with over forty years’ experience working with former cult members. He and his wife, Lorna, co-lead a support group for former cult members, which has been meeting for over forty years. It is the oldest group of its kind in the world. In 2007, Bill retired from the Rockland County, NY Department of Mental Health, where he directed several programs and clinics. He is presently an adjunct professor in the social work and social science departments of Dominican College and he is on the faculty of the Institute for Psychoanalytic Studies. Bill has published numerous articles. Bill is a frequent speaker at ICSA conferences, and he and Lorna have been the recipients of the Authentic CAN Hall of Fame Award and the Leo J. Ryan Award. In 2010, Bill was the recipient of ICSA’s Lifetime Achievement Award. He is also co-editor of ICSA\u0027s Cult Recovery: A Clinician\u0027s Guide to Working With Former Members and Their Families, published in 2017.  (201) 894-8515   Website: blgoldberg.com Email:bill@blgoldberg.com    New Jersey (Englewood) Phone/Electronic Consultation Possible",
      "release": "2021-02-21T23:00:20Z",
      "duration": "00:41:52",
      "explicit": false,
      "youTubeId": "m5N8AOjQc-k",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=m5N8AOjQc-k"
      }
    },
    {
      "id": "68414459-70fd-480f-8a85-781f7a21336d",
      "title": "Meet the Author! Interview with Daniel Shaw",
      "description": "\u0022Traumatic Narcissism: Relational Systems of Subjugation\u0022\nInterview with Daniel Shaw by Joseph Szimhart\n\nIn this volume, Traumatic Narcissism: Relational Systems of Subjugation, Daniel Shaw presents a way of understanding the traumatic impact of narcissism as it is engendered developmentally, and as it is enacted relationally. Focusing on the dynamics of narcissism in interpersonal relations, Shaw describes the relational system of what he terms the \u0027traumatizing narcissist\u0027 as a system of subjugation – the objectification of one person in a relationship as the means of enforcing the dominance of the subjectivity of the other. Daniel Shaw illustrates the workings of this relational system of subjugation in a variety of contexts: theorizing traumatic narcissism as an intergenerationally transmitted relational/developmental trauma; and exploring the clinician\u0027s experience working with the adult children of traumatizing narcissists. He explores the relationship of cult leaders and their followers, and examines how traumatic narcissism has lingered vestigially in some aspects of the psychoanalytic profession. Bringing together theories of trauma and attachment, intersubjectivity and complementarity, and the rich clinical sensibility of the Relational Psychoanalysis tradition, Shaw demonstrates how narcissism can best be understood not merely as character, but as the result of the specific trauma of subjugation, in which one person is required to become the object for a significant other who demands hegemonic subjectivity. Traumatic Narcissism presents therapeutic clinical opportunities not only for psychoanalysts of different schools, but for all mental health professionals working with a wide variety of modalities. Although primarily intended for the professional psychoanalyst and psychotherapist, this is also a book that therapy patients and lay readers will find highly readable and illuminating.\n\nAbout the Author:\nDaniel Shaw, LCSW is a psychoanalytically oriented psychotherapist in private practice in New York City, and in Nyack, New York. He is a training analyst, teacher and supervisor of analytic candidates at the National Institute for the Psychotherapies in New York City. Website: danielshawlcsw.com\n\nYou can purchase Dan\u0027s book here: https://www.amazon.com/Traumatic-Narcissism-Relational-Subjugation-Perspectives/dp/0415510252/ref=sr_1_1?crid=31ASBO38EBXJQ\u0026dchild=1\u0026keywords=dan\u002Bshaw\u0026qid=1611181414\u0026s=books\u0026sprefix=dan\u002Bshaw%2Cstripbooks%2C232\u0026sr=1-1",
      "release": "2021-02-20T18:00:07Z",
      "duration": "00:29:10",
      "explicit": false,
      "youTubeId": "PUhQlc-7Fn0",
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PUhQlc-7Fn0"
      }
    },
    {
      "id": "209bda6b-c7bf-46bc-9fee-e602206b703e",
      "title": "Meet the Author! Interview with Debby Schriver",
      "description": "\u0022Whispering in the Daylight: The Children of Tony Alamo Christian Ministries and Their Journey to Freedom\u0022\nInterview with Debby Schriver by Joseph Szimhart\n\nBeginning in the 1960s in California, erstwhile music producer Tony Alamo became interested in authoritarian religion and, along with his charismatic wife, Susan, began gathering followers. By the 1970s, Tony Alamo Christian Ministries had established particularly strong footholds in Arkansas, as well as maintaining outposts in California. The ministry gained a legion of followers, with branches not only in the USA but in places as diverse as Africa and Sri Lanka. Even through their leader’s eventual imprisonment under federal charges (related to transporting minors across state lines for sexual purposes), Alamo’s vision survived—and his community survives him today.\n\nWhispering in the Daylight: The Children of Tony Alamo Christian Ministries and Their Journey to Freedom is based on numerous interviews from group members and, more importantly, on interviews with the children—second and third-generation followers. Author Debby Schriver chronicles how this group was formed, documenting its many abuses and its gradual adoption of cult-like behaviors and practices. Like many cult leaders, Tony Alamo had different faces. The public saw him as a somewhat self-important but harmless music promoter and designer of bedazzling denim jackets. Schriver chronicles firsthand the condemnation, rejection, and torment that the second-generation survivors of Tony Alamo’s abuses experienced. Schriver’s interviews, particularly those with children, illuminate the real horrors of the Alamos’ behavior, ranging from economic exploitation, extreme forced fasts, and beatings, that resulted in permanent injury.\n\nSchriver’s extensive research—including interviews with Tony Alamo himself, harrowing visits to Alamo compounds, and witnessing gut-wrenching confrontations between freed children and their unreformed parents—tells the story of a closed group whose origins and history are unlikely ever to be definitively unraveled.\n\nAbout the Author:\nDEBBY SCHRIVER has spent her career working with students, parents, and staff in the departments of student life and employee training and development at the University of Tennessee, Knoxville. She is the author of In the Footsteps of Champions: The University of Tennessee Lady Volunteers, the First Three Decades, coauthor, with Jenny Moshak, of Ice ’n’ Go: Score in Sports and Life, and coeditor, with Lucia McMahon of To Read My Heart: The Journal of Rachel Van Dyke, 1810–1811.\n\nYou can purchase Debby\u0027s book here: https://www.amazon.com/Whispering-Daylight-Children-Christian-Ministries/dp/1621903869",
      "release": "2021-02-06T18:00:25Z",
      "duration": "00:37:22",
      "explicit": false,
      "youTubeId": "huFQjIzxV44",
      "subjects": [
        "Alamo Christian Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=huFQjIzxV44"
      }
    },
    {
      "id": "c2f42570-311f-4e67-9454-7885695139fc",
      "title": "A Loving Provision? How Former Jehovah\u0027s Witnesses Experience Shunning Practices",
      "description": "A Loving Provision? How Former Jehovah\u0027s Witnesses Experience Shunning Practices (Julia Gutgsell)\n\nThis presentation offers a general introduction into the field of ostracism and presents a high-level overview of the research findings presented in Julia\u0027s MSc dissertation. The presentation concludes by offering some fresh thinking on future directions to grow our understanding of ostracism and its impact.\n\nJulia Gutgsell (BSc, MSc) is a criminologist based in Edinburgh, Scotland. Her dissertation on ostracism in high control groups and relationships was awarded the Jeanine Seghers prize. She recently co-authored \u0027A semantic and discursive analysis of Watchtower May 2019\u0027 which was given as evidence to IICSA\u0027s (Inquiry into Child Sexual Abuse) investigation, \u0027Child protection in religious organisations and settings\u0027.\n\nShe aims to contribute to criminological perspectives by examining, challenging and discovering new areas for research on crime, social harm and the boundaries between\nvictim-perpetrators.\n\nContact details:\nEmail: Julia.gutgsell@gmail.com  \nLinkedIn: https://www.linkedin.com/in/julia-gutgsell/\nTo access the dissertation and paper: https://vub.academia.edu/JuliaGutgsell",
      "release": "2020-12-22T02:34:33Z",
      "duration": "01:13:56",
      "explicit": false,
      "youTubeId": "GwLix-4NOBk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GwLix-4NOBk"
      }
    },
    {
      "id": "17d148ae-db2b-44e1-a06d-5e42d2cfd142",
      "title": "Cults and the Law: A Practical Guide",
      "description": "Cults \u0026 the Law: A Practical Guide (Phil Elberg)\nBonus, Recorded Interactive Roundtable Discussion\n\nCults and the Law\nHour 1:  Stimulus Presentation by Phil Elberg, Esq. \u0022Cults and the Law: A Practical Guide\u0022\nHour 2:  Interactive Roundtable Discussion with Phil Elberg, Esq., William Goldberg, LCSW, PsyA, Patrick Ryan, and Joseph Kelly. Moderated by Ashlen Hilliard, ICSA\n\nA year ago Phil Elberg, former president of ICSA and winner of the first Margaret Singer Award for Advancing the Understanding of Coercive Influence spoke at a meeting of ICSA’s New York Chapter. For the first time in a public forum Phil told the story of how while looking into a case in his law office against the leader of a drug rehabilitation program led by Miller Newton, he made the cultic connection to his sister’s involvement with an abusive cult leader, Fred Newman, and how making that connection led to his success in exposing the cultic nature of Kids and Straight, Inc.  Phil’s fascinating and moving talk included a discussion of his advocacy work in the troubled teen industry and other cultic groups including NXIVM and focused from the perspective of a practicing lawyer what “cult law” is and is not.  It concluded with a discussion of the legal issues that people concerned about cults focus on.\n\n\u0022Keeping a family member from joining a toxic group;\nGetting them out if they are in;\nOnce they are in preventing a loved one from turning over financial assets \nAttempting to speak out about a cultic group (particularly on the internet) after leaving as part of the healing process and with the goal of helping others;\nSuing the group or its leaders for economic and emotional damages arising from cult involvement;\nDealing with family court issues of custody and visitation when one parent remains and one leaves;  \nUsing proof of brainwashing to excuse criminal conduct, mitigate a criminal penalty or convince prosecutors to pursue a prosecution of a group or its leader.\u0022\n\nICSA has decided to make Phil’s talk available on the internet as a stimulus presentation and to then provide an interactive discussion with Phil Elberg, Bill Goldberg, Pat Ryan, and Joseph Kelly moderated by Ashlen Hilliard in which legal and related issues associated with these topics can be discussed.\n\nPhil Elberg, Esq. – pelberglaw@gmail.com \n\nWilliam Goldberg, LCSW, PsyA – bill@blgoldberg.com \n(blgoldberg.com)\n\nPat Ryan – pryan19147@gmail.com  \nJoseph Kelly -- joekelly411@gmail.com \n(CultNews101.com)\n(Cults101.org)\n(CultMediation.com): \n(Intervention101.com)\n(CultRecovery101.com)",
      "release": "2020-11-10T17:59:06Z",
      "duration": "02:02:35",
      "explicit": false,
      "youTubeId": "izVFbq849k8",
      "subjects": [
        "Troubled Teen Industry",
        "NXIVM",
        "Cult Psychology",
        "Cult-Expert",
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=izVFbq849k8"
      }
    },
    {
      "id": "8932642c-97d6-47bb-aba6-8b80d1ce8772",
      "title": "The Continuum of Informed Consent",
      "description": "The Continuum of Informed Consent: An Exploration of the Conditions Within Families and Long-Term Residential Programs Where the Risk for Harmful Thought-Reform and Child Maltreatment is Increased; a Timeline of the Decision for Parent-Paid Placements Outside of the Home (Zack Bonnie)\nFebruary 8-9, 2020\n\nZack Bonnie is the author of the Dead, Insane, or in Jail memoir series, about his experience as a troubled teen incarcerated in the 80s at a cultish, Synanon-influenced facility called Rocky Mountain Academy. With a solid background in the entertainment field, he proposes that art is the antidote to thought reform. His presentation will encompass the mechanics of undue influence and cultic dynamics focusing on coercive institutionalized persuasion. His hope is to reach younger audiences as they enter careers in psychology and other social sciences. He works to create and promote media to illustrate the common dynamics of high-control groups wherever they appear: in the teen-treatment related programs, in religious failure, in strife at home, and as part of the US court system. Part of a larger plea for increased individual awareness, Zack Bonnie\u0027s mission is to educate the public - through the arts - about the systems applied in these institutions.",
      "release": "2020-08-21T03:13:46Z",
      "duration": "00:45:30",
      "explicit": false,
      "youTubeId": "7iZE9cjDrM8",
      "subjects": [
        "Troubled Teen Industry",
        "Psychology",
        "Synanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7iZE9cjDrM8"
      }
    },
    {
      "id": "15c4dd5f-14fe-4dad-b525-9f9ddb8b0b24",
      "title": "How to Choose a Therapist",
      "description": "How to Choose a Therapist (Bill Goldberg, LCSW, PsyA)\nFebruary 8-9, 2020\n\nWilliam Goldberg, LCSW, PsyA, is a clinical social worker and psychoanalyst with over forty years’ experience working with former cult members. He and his wife, Lorna, co-lead a support group for former cult members, which has been meeting for over forty years. It is the oldest group of its kind in the world. In 2007, Bill retired from the Rockland County, NY Department of Mental Health, where he directed several programs and clinics. He is presently an adjunct professor in the social work and social science departments of Dominican College and he is on the faculty of the Institute for Psychoanalytic Studies. Bill has published numerous articles in books and professional journals, and he is one of the editors of a soon to be published book, sponsored by ICSA, which will focus on clinical work with former cult members. Bill is a frequent speaker at ICSA conferences, and he and Lorna have been the recipients of the Authentic CAN Hall of Fame Award and the Leo J. Ryan Award. In 2010, Bill was the recipient of ICSA’s Lifetime Achievement Award. He is also co-editor of ICSA\u0027s Cult Recovery: A Clinician\u0027s Guide to Working With Former Members and Their Families, which is due to be published in 2017.  (201) 894-8515   Website: blgoldberg.com Email:bill@blgoldberg.com    New Jersey (Englewood) Phone/Electronic Consultation Possible",
      "release": "2020-08-12T01:41:19Z",
      "duration": "00:57:01",
      "explicit": false,
      "youTubeId": "DlE5OXO9lxA",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DlE5OXO9lxA"
      }
    },
    {
      "id": "374906a3-6c08-4518-ab78-d0b8a628fc10",
      "title": "The Legal Case of the Kids of Bergen County",
      "description": "The Legal Case of the Kids of Bergen County (Bill Goldberg, LCSW, PsyA)\nFebruary 8-9, 2020\n\nWilliam Goldberg, LCSW, PsyA, is a clinical social worker and psychoanalyst with over forty years’ experience working with former cult members. He and his wife, Lorna, co-lead a support group for former cult members, which has been meeting for over forty years. It is the oldest group of its kind in the world. In 2007, Bill retired from the Rockland County, NY Department of Mental Health, where he directed several programs and clinics. He is presently an adjunct professor in the social work and social science departments of Dominican College and he is on the faculty of the Institute for Psychoanalytic Studies. Bill has published numerous articles in books and professional journals, and he is one of the editors of a soon to be published book, sponsored by ICSA, which will focus on clinical work with former cult members. Bill is a frequent speaker at ICSA conferences, and he and Lorna have been the recipients of the Authentic CAN Hall of Fame Award and the Leo J. Ryan Award. In 2010, Bill was the recipient of ICSA’s Lifetime Achievement Award. He is also co-editor of ICSA\u0027s Cult Recovery: A Clinician\u0027s Guide to Working With Former Members and Their Families, which is due to be published in 2017.  (201) 894-8515   Website: blgoldberg.com Email:bill@blgoldberg.com    New Jersey (Englewood) Phone/Electronic Consultation Possible",
      "release": "2020-08-12T00:33:45Z",
      "duration": "01:00:27",
      "explicit": false,
      "youTubeId": "-LDilIK-Mn8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-LDilIK-Mn8"
      }
    },
    {
      "id": "b18a2ef2-eac5-4e06-8378-ad1e1bc1a4a5",
      "title": "The Psychology of Coercive Control Online Masters Program Overview",
      "description": "More information on the Online Psychology of Coercive Control Masters Program with edited Q\u0026A University of Salford, Manchester, UK (Linda, Rod Dubrow-Marshall)\n\nLinda Dubrow-Marshall, PhD, Reg. MBACP (Accred.), is Chair of the Mental Health Network for ICSA, is Research Co-editor of ICSA Today, and a member of the Research Network for ICSA.  She is a co-founder of RETIRN (please also see www.retirn.com), a private practice that provides services to individuals and families who have been affected by cultic influence and abusive relationships. Linda has developed a new MSc Psychology of Coercive Control program at the University of Salford and is leading the program with Dr. Rod Dubrow-Marshall. She is also the Programme Leader of the MSc Applied Psychology (Therapies) Program at the University of Salford. She is registered with the Health and Care Professions Council, United Kingdom, as both a clinical and a counselling psychologist, and she is a registered counsellor/psychotherapist with the British Association for Counselling and Psychotherapy. She is a licensed psychologist in Pennsylvania, USA, and a registered psychologist with the National Register of Health Service Psychologists, USA. She attends as co-representative of RETIRN/UK as correspondent to the General Assembly of FECRIS (European Federation of Centres of Research and Education on Sects). Dr. Dubrow-Marshall is a Consultant in Clinical Hypnosis (advanced certification) with the American Society of Clinical Hypnosis and is certified by the Eye Movement Desensitization and Reprocessing Institute. She is certified as a Master Addiction Counselor with the National Certification Commission for Addiction Professionals. Website: http://www.retirn.com/Dr._Linda.htm Email: LJDMarshall@aol.com Phone: \u002B44 7973 310599/ United Kingdom Phone/Electronic Consultation Possible\n\nRod Dubrow-Marshall, PhD, MBPsS, is Professor of Psychology and Visiting Fellow, Criminal Justice Hub, University of Salford, United Kingdom. Rod is a Social Psychologist who has been researching the psychology and aetiology of undue influence and cults or extremist groups for over twenty years, and he has developed the Totalistic Identity Theory as an evidence-based theory to explain and tackle ideological extremism and ideologically driven violence. He is also an active researcher in a variety of other areas including organizational behaviour and healthiness, the social psychology of identity and prejudice, and public policy and education. A graduate member of the British Psychological Society, Rod is a member of the Board of Directors of the International Cultic Studies Association and is also Chair of the ICSA Research Committee and Network and he is co-Editor of the International Journal of Cultic Studies (since its inception in 2010). In 2006, he was awarded The Herbert L. Rosedale Award, jointly with Dr. Paul Martin, for their psychological research on undue influence. Rod co-founded the Re-Entry Therapy Information and Referral Network (RETIRN) UK in 2004 with Dr Linda Dubrow-Marshall, where he serves as a consultant in helping individuals and families who have been adversely affected by destructive or damaging cults and other extremist and high demand/manipulative groups or relationships. He operates out of offices in Pontypridd, Wales and Buxton, Derbyshire, UK (please also see www.retirn.com). Rod has also served on more than a dozen Governing Boards of Schools, Colleges and Universities over the last two decades and he is currently a governor and director of the Akaal Primary School in Derby and is also a longstanding member of the Board of the homelessness charity the Wallich (headquartered in Cardiff, Wales). In addition, he is a member of the Board of Directors of the Buxton International Festival and is Chair of the Board of the Preston Guild Link charity (in Lancashire, UK) which is fundraising for the next Preston Guild cultural festival in 2032! Rod is also an experienced senior leader and manager in higher education having served for 15 years in the roles of Deputy Vice-Chancellor at the University of Derby, Pro Vice-Chancellor at the University of Central Lancashire in Preston and as Dean of Humanities and Social Sciences at the University of South Wales and Dean of Applied Social Sciences and Humanities at Buckinghamshire New University. United Kingdom\n\nYou can check out more about the program here: \nsalford.ac.uk/pgt-courses/psychology-of-coercive-control",
      "release": "2020-08-11T20:20:51Z",
      "duration": "01:11:11",
      "explicit": false,
      "youTubeId": "51kBjE9hFgM",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=51kBjE9hFgM"
      }
    },
    {
      "id": "0824d9ca-efff-4f29-bffa-4838dad1b3aa",
      "title": "ICSA History Collection Interview of Carol Giambalvo",
      "description": "ICSA History Collection: Carol Giambalvo \nInterview with Carol Giambalvo by Robert E. Schecter \n\nRobert E. Schecter, PhD, interviewed Carol Giambalvo on July 5, 2018 as part of a series of interviews designed to illuminate ICSA’s history. Ms. Giambalvo discusses her personal cultic experience, how she became involved in the field, the work she did for ICSA, and her views on ICSA and its future.",
      "release": "2020-08-07T13:36:05Z",
      "duration": "00:21:31",
      "explicit": false,
      "youTubeId": "-HjHj4x-oP4",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-HjHj4x-oP4"
      }
    },
    {
      "id": "27f8c807-ad81-43d7-9c57-b1e2853203ee",
      "title": "From Coping to Thriving - A Survivor\u0027s Perspective",
      "description": "From Coping to Thriving - A Survivor\u0027s Perspective (Gary Alt)\nFebruary 8-9, 2020 \n\nWorkshop Day 1 -- Saturday, February 8th -- Recovery Issues After Leaving an Abusive Church\n\nWorkshops aimed towards addressing the specific needs of former Jehovah\u0027s Witnesses and others recovering from spiritual abuse. A variety of topics will be covered to help former members identify psychological challenges that may arise when they leave the faith.",
      "release": "2020-08-01T04:00:48Z",
      "duration": "01:15:52",
      "explicit": false,
      "youTubeId": "nXiO935gJVw",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nXiO935gJVw"
      }
    },
    {
      "id": "5f3192ab-814a-4b05-9fa6-c57e6ffa4508",
      "title": "Fix my Teenager! My Experience in a Behavior-Modification Program",
      "description": "Fix My Teenager! My Experience in a Behavior-Modification Program, the Aftermath, and are There Alternatives for Parents (Sunny Linkfield)\nFebruary 8-9, 2020 \n\nSpeaker Bio:\nSunny Linkfield is a survivor of Straight Inc. from 1982-1984. This abusive teen \u0022rehab\u0022 center, convinced thousands of parents that normal behavior was a sign of \u0022druggie\u0022 behavior. Sunny was an over achiever but became a moody teenager, experimenting with pot, alcohol and a few other drugs. After her parents read an article in Reader\u0027s Digest, they dropped her off in a warehouse called Straight Incorporated.\n\nStraight, Inc. was an abusive mind control cult that practiced torture techniques formerly used in Communist China and North Korea on youth. These techniques were ostensibly employed to help Straight’s victims overcome the problems and addictions that Straight claimed they had. Spin-offs still exist today.\n\nSunny is now a make-up artist/esthetician and a trainer in retail cosmetics. She was recently interviewed in the new movie, Surviving Straight Inc., a Documentary. Sunny was also the lead make-up artist for the film.\n\nMs. Linkfield is active with the International Cultic Studies Association and serves on the Board of Directors of the Community Alliance For the Ethical Treatment of Youth. She is active in raising awareness of abusive teen programs and is fighting for the US to sign the United Nations treaty for the Rights of a Child. Currently, the US and Somalia are the only two countries who have not signed the treaty.",
      "release": "2020-07-31T20:45:40Z",
      "duration": "00:59:39",
      "explicit": false,
      "youTubeId": "5iRuaaLEaKU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5iRuaaLEaKU"
      }
    },
    {
      "id": "db90a475-8b89-415d-a5d4-bec7e7e5b54c",
      "title": "Power Threat in the Context of a Global Pandemic",
      "description": "Power Threat in the Context of a Global Pandemic (Rod and Linda Dubrow-Marshall)\n\nLinda Dubrow-Marshall, PhD, Reg. MBACP (Accred.), is Chair of the Mental Health Network for ICSA, is Research Co-editor of ICSA Today, and a member of the Research Network for ICSA.  She is a co-founder of RETIRN (please also see www.retirn.com), a private practice that provides services to individuals and families who have been affected by cultic influence and abusive relationships. Linda has developed a new MSc Psychology of Coercive Control program at the University of Salford and is leading the program with Dr. Rod Dubrow-Marshall. She is also the Programme Leader of the MSc Applied Psychology (Therapies) Program at the University of Salford. She is registered with the Health and Care Professions Council, United Kingdom, as both a clinical and a counselling psychologist, and she is a registered counsellor/psychotherapist with the British Association for Counselling and Psychotherapy. She is a licensed psychologist in Pennsylvania, USA, and a registered psychologist with the National Register of Health Service Psychologists, USA. She attends as co-representative of RETIRN/UK as correspondent to the General Assembly of FECRIS (European Federation of Centres of Research and Education on Sects). Dr. Dubrow-Marshall is a Consultant in Clinical Hypnosis (advanced certification) with the American Society of Clinical Hypnosis and is certified by the Eye Movement Desensitization and Reprocessing Institute. She is certified as a Master Addiction Counselor with the National Certification Commission for Addiction Professionals. Website: http://www.retirn.com/Dr._Linda.htm Email: LJDMarshall@aol.com Phone: \u002B44 7973 310599/ United Kingdom Phone/Electronic Consultation Possible\n\nRod Dubrow-Marshall, PhD, MBPsS, is Professor of Psychology and Visiting Fellow, Criminal Justice Hub, University of Salford, United Kingdom. Rod is a Social Psychologist who has been researching the psychology and aetiology of undue influence and cults or extremist groups for over twenty years, and he has developed the Totalistic Identity Theory as an evidence-based theory to explain and tackle ideological extremism and ideologically driven violence. He is also an active researcher in a variety of other areas including organizational behaviour and healthiness, the social psychology of identity and prejudice, and public policy and education. A graduate member of the British Psychological Society, Rod is a member of the Board of Directors of the International Cultic Studies Association and is also Chair of the ICSA Research Committee and Network and he is co-Editor of the International Journal of Cultic Studies (since its inception in 2010). In 2006, he was awarded The Herbert L. Rosedale Award, jointly with Dr. Paul Martin, for their psychological research on undue influence. Rod co-founded the Re-Entry Therapy Information and Referral Network (RETIRN) UK in 2004 with Dr Linda Dubrow-Marshall, where he serves as a consultant in helping individuals and families who have been adversely affected by destructive or damaging cults and other extremist and high demand/manipulative groups or relationships. He operates out of offices in Pontypridd, Wales and Buxton, Derbyshire, UK (please also see www.retirn.com). Rod has also served on more than a dozen Governing Boards of Schools, Colleges and Universities over the last two decades and he is currently a governor and director of the Akaal Primary School in Derby and is also a longstanding member of the Board of the homelessness charity the Wallich (headquartered in Cardiff, Wales). In addition, he is a member of the Board of Directors of the Buxton International Festival and is Chair of the Board of the Preston Guild Link charity (in Lancashire, UK) which is fundraising for the next Preston Guild cultural festival in 2032! Rod is also an experienced senior leader and manager in higher education having served for 15 years in the roles of Deputy Vice-Chancellor at the University of Derby, Pro Vice-Chancellor at the University of Central Lancashire in Preston and as Dean of Humanities and Social Sciences at the University of South Wales and Dean of Applied Social Sciences and Humanities at Buckinghamshire New University. United Kingdom",
      "release": "2020-07-29T00:45:53Z",
      "duration": "01:28:20",
      "explicit": false,
      "youTubeId": "GLBgkCpKAEU",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GLBgkCpKAEU"
      }
    },
    {
      "id": "2431d12a-603f-4014-901a-f1cad5f6d865",
      "title": "Self Care and Resilience",
      "description": "Self Care and Resilience (Rod and Linda Dubrow-Marshall)\n\nLinda Dubrow-Marshall, PhD, Reg. MBACP (Accred.), is Chair of the Mental Health Network for ICSA, is Research Co-editor of ICSA Today, and a member of the Research Network for ICSA.  She is a co-founder of RETIRN (please also see www.retirn.com), a private practice that provides services to individuals and families who have been affected by cultic influence and abusive relationships. Linda has developed a new MSc Psychology of Coercive Control program at the University of Salford and is leading the program with Dr. Rod Dubrow-Marshall. She is also the Programme Leader of the MSc Applied Psychology (Therapies) Program at the University of Salford. She is registered with the Health and Care Professions Council, United Kingdom, as both a clinical and a counselling psychologist, and she is a registered counsellor/psychotherapist with the British Association for Counselling and Psychotherapy. She is a licensed psychologist in Pennsylvania, USA, and a registered psychologist with the National Register of Health Service Psychologists, USA. She attends as co-representative of RETIRN/UK as correspondent to the General Assembly of FECRIS (European Federation of Centres of Research and Education on Sects). Dr. Dubrow-Marshall is a Consultant in Clinical Hypnosis (advanced certification) with the American Society of Clinical Hypnosis and is certified by the Eye Movement Desensitization and Reprocessing Institute. She is certified as a Master Addiction Counselor with the National Certification Commission for Addiction Professionals. Website: http://www.retirn.com/Dr._Linda.htm Email: LJDMarshall@aol.com Phone: \u002B44 7973 310599/ United Kingdom Phone/Electronic Consultation Possible\n\nRod Dubrow-Marshall, PhD, MBPsS, is Professor of Psychology and Visiting Fellow, Criminal Justice Hub, University of Salford, United Kingdom. Rod is a Social Psychologist who has been researching the psychology and aetiology of undue influence and cults or extremist groups for over twenty years, and he has developed the Totalistic Identity Theory as an evidence-based theory to explain and tackle ideological extremism and ideologically driven violence. He is also an active researcher in a variety of other areas including organizational behaviour and healthiness, the social psychology of identity and prejudice, and public policy and education. A graduate member of the British Psychological Society, Rod is a member of the Board of Directors of the International Cultic Studies Association and is also Chair of the ICSA Research Committee and Network and he is co-Editor of the International Journal of Cultic Studies (since its inception in 2010). In 2006, he was awarded The Herbert L. Rosedale Award, jointly with Dr. Paul Martin, for their psychological research on undue influence. Rod co-founded the Re-Entry Therapy Information and Referral Network (RETIRN) UK in 2004 with Dr Linda Dubrow-Marshall, where he serves as a consultant in helping individuals and families who have been adversely affected by destructive or damaging cults and other extremist and high demand/manipulative groups or relationships. He operates out of offices in Pontypridd, Wales and Buxton, Derbyshire, UK (please also see www.retirn.com). Rod has also served on more than a dozen Governing Boards of Schools, Colleges and Universities over the last two decades and he is currently a governor and director of the Akaal Primary School in Derby and is also a longstanding member of the Board of the homelessness charity the Wallich (headquartered in Cardiff, Wales). In addition, he is a member of the Board of Directors of the Buxton International Festival and is Chair of the Board of the Preston Guild Link charity (in Lancashire, UK) which is fundraising for the next Preston Guild cultural festival in 2032! Rod is also an experienced senior leader and manager in higher education having served for 15 years in the roles of Deputy Vice-Chancellor at the University of Derby, Pro Vice-Chancellor at the University of Central Lancashire in Preston and as Dean of Humanities and Social Sciences at the University of South Wales and Dean of Applied Social Sciences and Humanities at Buckinghamshire New University. United Kingdom",
      "release": "2020-07-29T00:22:40Z",
      "duration": "01:29:46",
      "explicit": false,
      "youTubeId": "7Rx3fFDvjVg",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7Rx3fFDvjVg"
      }
    },
    {
      "id": "28754a68-81a9-498f-94b3-e3b7080db10e",
      "title": "ICSA History Collection: Interview with Marsha Addis",
      "description": "ICSA History Collection: Marsha Addis \nInterview with Marsha Addis by Robert E. Schecter\n\nRobert E. Schecter, PhD, interviewed Marsha Addis on March 11, 2018 as part of a series of interviews designed to illuminate ICSA’s history. Ms. Addis discusses her early work in this field with Dr. Jolly West, including her work with the Los Angeles Jewish Family Service\u0027s Cult Clinic and her history with ICSA. She co-authored an early paper in the field: The Cult Clinic Helps Families in Crisis (https://drive.google.com/file/d/1kXMhANM3WJVH1GtRh-6eXR4k91jVBRui/view?usp=sharing).",
      "release": "2020-07-27T20:57:23Z",
      "duration": "00:19:12",
      "explicit": false,
      "youTubeId": "I_Fdi8Mw5wQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I_Fdi8Mw5wQ"
      }
    },
    {
      "id": "bd579067-2970-482c-9523-f23bb104e4eb",
      "title": "Wrap up to Cult Recovery Series",
      "description": "Wrap up to Cult Recovery Series with (Gillie Jenkinson, PhD; Ashlen Hilliard)\n\nGillie Jenkinson, PhD, is an accredited counsellor and psychotherapist in UK and is experienced in delivering counselling face-to-face as well as on the telephone and Skype. She served two internships at Wellspring Retreat Center, Ohio, and has many years’ experience working with trauma victims, including survivors of spiritual and cult abuse, and sexual abuse. She has developed an approach to counselling former members - \u0022Time Away for Post-Cult Counselling.\u0022 Gillie was a member of an abusive Bible-based cult in the 1970’s. She is a regular presenter at conferences and a published author, including a co-authoring a chapter entitled \u0022Pathological Spirituality\u0022 for a medical text book entitled Spirituality and Psychiatry, published by RCPsych Publications in UK - 2009. She is the Mental Health Editor for ICSA Today. Gillie’s doctoral research dissertation is entitled: ‘Freeing the authentic-self: Phases of Recovery and Growth from an Abusive Cult Experience’. Hopevalleycounselling.com.   info@hopevalleycounselling.com.  \u002B44 1433 639032",
      "release": "2020-05-20T20:08:28Z",
      "duration": "01:04:58",
      "explicit": false,
      "youTubeId": "ENOhMI272UM",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ENOhMI272UM"
      }
    },
    {
      "id": "9e3cf224-95c5-4dc8-bec6-3bf59f296d53",
      "title": "Understanding Trauma Theory",
      "description": "Understanding Trauma Theory (Gillie Jenkinson, PhD, Ashlen Hilliard)\n\nGillie Jenkinson, PhD, is an accredited counsellor and psychotherapist in UK and is experienced in delivering counselling face-to-face as well as on the telephone and Skype. She served two internships at Wellspring Retreat Center, Ohio, and has many years’ experience working with trauma, including survivors of spiritual and cult abuse, and sexual abuse. She has developed an approach to counselling former members - \u0022Time Away for Post-Cult Counselling.\u0022 Gillie was a member of an abusive Bible-based cult in the 1970’s. She is a regular presenter at conferences and a published author, including a co-authoring a chapter entitled \u0022Pathological Spirituality\u0022 for a medical text book entitled Spirituality and Psychiatry, published by RCPsych Publications in UK - 2009. She is the Mental Health Editor for ICSA Today. Gillie’s doctoral research dissertation is entitled: ‘Freeing the authentic-self: Phases of Recovery and Growth from an Abusive Cult Experience’. Website: www.hopevalleycounselling.com Email: info@hopevalleycounselling.com Phone: \u002B44 1433 639032. United Kingdom",
      "release": "2020-05-20T19:55:38Z",
      "duration": "01:39:28",
      "explicit": false,
      "youTubeId": "AIkwBiwoEvI",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AIkwBiwoEvI"
      }
    },
    {
      "id": "18db03c2-142b-4da3-bbd6-405dc6f5d0d3",
      "title": "Impact of COVID-19 on Former Cult Members",
      "description": "Impact of COVID-19 on Former Cult Members (Lorna Goldberg, LCSW PsyA \u0026 Bill Goldberg, LCSW, PsyA)\n\nLorna Goldberg, LCSW, PsyA, Board member and past president of ICSA, is a psychoanalyst in private practice and Dean of Faculty at the Institute of Psychoanalytic Studies. In 1976, she and her husband, William Goldberg, began facilitating a support group for former cult members that continues to meet on a monthly basis in their home in Englewood, New Jersey. In1989, Lorna and Bill received the Hall of Fame Award from the authentic Cult Awareness Network and, in 1999; they received the Leo J. Ryan Award from the Leo J. Ryan Foundation. In 2009, she received the Margaret T. Singer Award from ICSA. Lorna joined ICSA’s Board of Directors in November 2003. Along with Rosanne Henry, she co-chaired ICSA’s Mental Health Committee until her term as President of ICSA from 2008 to 2012. Lorna has published numerous articles about her therapeutic work with former cult members in professional journals, most recently: Goldberg, L. (2012). Influence of a Charismatic Antisocial Cult Leader: Psychotherapy with an Ex-Cultist Prosecuted for Criminal Behavior. International Journal of Cultic Studies, Vol. 2, 15-24. Goldberg, L. (2011). Diana, Leaving the Cult: Play Therapy in Childhood and Talk Therapy in Adolescence. International Journal of Cultic Studies, (Vol.2), 33-43. She also wrote a chapter on guidelines for therapists in the book, Recovery from Cults, edited by Michael Langone. Lorna has co-written with Bill Goldberg, a chapter on psychotherapy with targeted parents in the book, Working with Alienated Children and Families (2012), edited by Amy J.L. Baker \u0026 S. Richard Sauber. She is also co-editor of ICSA\u0027s Cult Recovery: A Clinician\u0027s Guide to Working With Former Members and Their Families, which is due to be published in 2017. Website: blgoldberg.com Email: Lorna@BLGoldberg.com Phone: (201) 894-8515. New Jersey (Englewood) Phone/Electronic Consultation Possible\n\nWilliam Goldberg, LCSW, PsyA, is a clinical social worker and psychoanalyst with over forty years’ experience working with former cult members. He and his wife, Lorna, co-lead a support group for former cult members, which has been meeting for over forty years. It is the oldest group of its kind in the world. In 2007, Bill retired from the Rockland County, NY Department of Mental Health, where he directed several programs and clinics. He is presently an adjunct professor in the social work and social science departments of Dominican College and he is on the faculty of the Institute for Psychoanalytic Studies. Bill has published numerous articles in books and professional journals, and he is one of the editors of a soon to be published book, sponsored by ICSA, which will focus on clinical work with former cult members. Bill is a frequent speaker at ICSA conferences, and he and Lorna have been the recipients of the Authentic CAN Hall of Fame Award and the Leo J. Ryan Award. In 2010, Bill was the recipient of ICSA’s Lifetime Achievement Award. He is also co-editor of ICSA\u0027s Cult Recovery: A Clinician\u0027s Guide to Working With Former Members and Their Families, which is due to be published in 2017.  (201) 894-8515   Website: blgoldberg.com Email:bill@blgoldberg.com    New Jersey (Englewood) Phone/Electronic Consultation Possible\n\nSee \u0022Letter to Former Cultic Group Members: Recovery in the Era of COVID-19\u0022: https://documentcloud.adobe.com/link/trackuri=urn:aaid:scds:US:6f6d7eee-f64c-4b7c-9bd4-f27b8fe19d47",
      "release": "2020-05-18T20:44:34Z",
      "duration": "00:57:34",
      "explicit": false,
      "youTubeId": "1pjhVwTR8ps",
      "subjects": [
        "Cult Recovery",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1pjhVwTR8ps"
      }
    },
    {
      "id": "c3a91f67-682a-49ac-b2de-fdb5d54ca6a8",
      "title": "Cult Recovery and Family Support: Q\u0026A Session with Doni Whitsett, PhD, LCSW",
      "description": "Q\u0026A Session with Doni Whitsett, PhD, LCSW (Doni Whitsett; Ashlen Hilliard)\n\nDoni Whitsett, PhD, LCSW, is a Clinical Professor at the USC Suzanne Dworak-Peck School of Social Work where she teaches various courses in practice, behavior, mental health, and human sexuality. She has been working with cult-involved clients and their families for over 20 years and gives lectures to students and professionals on this topic. She has presented at national and international conferences in Madrid, Poland, Canada, and in Australia, where she helped organize two conferences in Brisbane. Her talks have included The Psychobiology of Trauma and Child Maltreatment (2005, Madrid) and Why Cults Are Harmful: A Neurobiological View of Interpersonal Trauma (2012, Montreal). Her publications include The Psychobiology of Trauma and Child Maltreatment (Cultic Studies Review, Vol. 5, No. 3, 2006), A Self Psychological Approach to the Cult Phenomenon (Journal of Social Work, 1992), Cults and Families (Families in Society, Vol. 84, No. 4, 2003), which she coauthored with Dr. Stephen Kent, and Why cults are harmful: Neurobiological speculations on inter-personal trauma. ICSA Today, Vol. 5, No. 1, 2014. Dr. Whitsett also has a specialty in Sexuality and was awarded a Fulbright Specialist Scholarship in 2016 to study, teach, and do research on this topic in China. Email: whitsett@usc.edu Phone: (323) 907-2400",
      "release": "2020-05-12T23:43:00Z",
      "duration": "00:44:06",
      "explicit": false,
      "youTubeId": "E9D3knB292k",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E9D3knB292k"
      }
    },
    {
      "id": "95f6d22e-759d-4a5c-87f1-85a1085aa27f",
      "title": "Q\u0026A with Michael Shemwell -- Former Jehovah\u0027s Witness Recovery Series",
      "description": "Q\u0026A with Michael Shemwell -- Former Jehovah\u0027s Witness Recovery Series (Michael Shemwell; Ashlen Hilliard)\nBonus, Recorded Q\u0026A\n\nMichael Shemwell is a life coach, and started the podcast \u0022Shunned\u0022 in which he now helps others tell their stories. The 40 episodes to date cover people shunned from not only Jehovah’s Witnesses but other high control groups as well. For more information on Michael: https://michaelshemwell.com/",
      "release": "2020-05-12T21:37:34Z",
      "duration": "00:40:15",
      "explicit": false,
      "youTubeId": "ljGlTqVVwBw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ljGlTqVVwBw"
      }
    },
    {
      "id": "50f8021d-a354-4c36-9ac8-1f895bd8c005",
      "title": "Understanding the Role of Shame in Cult Indoctrination \u0026 Recovery",
      "description": "A Prison of Shame \u0026 Fear: Understanding the Role of Shame in Cult Indoctrination \u0026 Recovery (Dan Shaw, LCSW; Ashlen Hilliard)\n\nFear and shame are what bedevil all traumatized people, as they struggle to feel safe in a world where they have felt the trapped, helpless, powerlessness of traumatic experience. I explore in this talk how shame plays a part in successful cult recruitment; the role of shame in the cult leader’s psychology; the use of shame in cults as a means of control and domination; and the ways that shame haunts those who leave cults.\n\nDaniel Shaw, LCSW, is the author of Traumatic Narcissism: Relational Systems of Subjugation, published by Routledge. He is a Psychoanalyst in  Private Practice in New York City and Nyack, NY; and he is Faculty and Clinical Supervisor at The National Institute for the Psychotherapies (NIP), in New York City. Shaw spent thirteen years as a staff member in Siddha Yoga (SYDA Foundation). There he wore many hats, including: manager of the residential Manhattan facility, educator, spokesperson, public relations coordinator, community organizer, and writer/director of public programs. Shaw exited Siddha Yoga in 1994, published an Open Letter about Siddha Yoga on the internet in 1995, and helped create the Leaving Siddha Yoga website, one of the first internet websites for ex cult members. Shaw is the author of Traumatic Abuse in Cults: A Psychoanalytic Perspective, published in the Cultic Studies Journal, numerous psychoanalytic papers, and the editor of a special issue on the traumatizing narcissist in ICSA\u0027sInternational Journal of Cultic Studies. In 2018 Mr. Shaw received ICSA’s Margaret T. Singer Award for for advancing the understanding of coercive persuasion and undue influence. Website: www.danielshawlcsw.com Email: danielshawlcsw@gmail.com Phone: (845) 548-2561.",
      "release": "2020-05-12T21:34:28Z",
      "duration": "01:14:16",
      "explicit": false,
      "youTubeId": "bpqW_LTi-vg",
      "subjects": [
        "Psychology",
        "Cult-Expert",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bpqW_LTi-vg"
      }
    },
    {
      "id": "15f478df-1804-404c-979a-838503a94f90",
      "title": "Parenting After the Cult",
      "description": "Parenting After the Cult (Eva Mackey, Ann Stamler, and Joseph Kelly)\n\nEva Mackey, MD, is a second generation adult whose father was a tenured professor of philosophy at the University of Texas at Austin. Her mother was a devotee of an eastern cult that practiced a branch of Hinduism called Advaita Vedanta, a non-dualistic philosophy that teaches that the self is one with the ultimate truth or reality. Half of Eva’s childhood was spent in an ashram in India where she and the other children were unsupervised much of the day. Despite the upheavals and instability that characterized her childhood, Eva managed to get out of the cult at the age of 16 and eventually earned her MD from the University of Texas Medical Branch in Galveston. Dr. Meyrat has a busy Family Practice and she lives near Dallas with her three small children.\n\nJoseph Kelly \n1300 S. 13th Street Philadelphia, PA 19147 267-679-5493 joekelly411@gmail.com Intervention101.com, Cultmediation.com: \nThese sites offer resources designed to help thoughtful families and friends understand and respond to the complexity of a loved one’s cult involvement. Cultrecovery101.com: assists group members and their families make the sometimes difficult transition from coercion to renewed individual choice.",
      "release": "2020-05-12T04:23:35Z",
      "duration": "01:04:40",
      "explicit": false,
      "youTubeId": "7WJ4l4AZRtg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7WJ4l4AZRtg"
      }
    },
    {
      "id": "45afab15-9388-44c7-afb1-ba1866202287",
      "title": "Widening the Frame: What Understanding Coercive Control Can Mean for the Larger Discussion",
      "description": "Widening the Frame: What Understanding Coercive Control Can Mean for the Larger Discussion (Ragan Schriver)\n\nThis interactive program will involve a presentation on coercive control from three different perspectives; a trauma-informed lens, as a population health concern and a call to action for the wider community. These different perspectives will help attendees understand how the issues related to cults and coercive control connect with the wider community, how we can all strive to prevent this from happening and how we can be welcoming to others in recovery.\n\nLEARNING OBJECTIVES\nAfter attending this session participants will be able to: 1. Describe the concepts of Trauma Responsive Care, including the neuroscience of trauma reactions, the lifelong impact of traumatic events, and principles of care;\n2. List the elements that make the issue of coercive control a population health issue; 3. Define steps to making a difference in the larger community in response to issues of coercive control.\n\nRagan Schriver is an Associate Professor of Practice at the University of Tennessee College of Social Work as well as the Director of the MSSW Program, Knoxville Campus and chair of the Forensic Social Work Certificate Program. He teaches clinical and leadership courses in the MSSW program. He also serves as the Special Assistant to the President of Catholic Charities USA. In this role he takes part in a team process to develop integrated health\nprograms within the network. He previously served as Executive Director of Catholic Charities of East Tennessee for fifteen years. He earned his MSW from Washington University in St. Louis, MO and became a licensed social worker in 2001. He earned his Doctor of Psychology degree in 2016, and his capstone project was on Trauma Informed Care.",
      "release": "2020-05-12T03:03:24Z",
      "duration": "00:55:42",
      "explicit": false,
      "youTubeId": "HJUbz5pnhbo",
      "subjects": [
        "Catholicism",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HJUbz5pnhbo"
      }
    },
    {
      "id": "1315165d-b019-426c-90f2-64ceff5b70e2",
      "title": "Therapy with Former Cult Members",
      "description": "Therapy with Former Cult Members (Lorna Goldberg, LCSW, PsyA)\n\nLorna Goldberg will talk about counseling approaches that address the unique circumstances of former cult members.\n\nLEARNING OBJECTIVES\n1. Participants will learn about the importance of a psych-educational approach in which the therapist and the former cult member focus upon the specific dynamics of the cult to show how the client was influenced to become and remain a member; 2. Participants will gain an understanding of the different therapeutic approaches utilized for first generation former cult members and those who have been born or raised in cults; 3. The presenter will describe the case of a former cult member, so that the participants will see how therapy with a former member might unfold; 4. Participants will learn about the typical aftereffects of former members and consider how these aftereffects can be helped within the therapy process.\n\nLorna Goldberg, LCSW, PsyA, Board member and past president of International Cultic Studies Association (ICSA), is a clinical social worker and psychoanalyst in private practice and Director, Institute for Psychoanalytic Studies. In 1976, she and her husband, Bill Goldberg, began facilitating a support group for former cult members that continues to meet on a monthly basis in their home in Englewood, New Jersey. In 2009, Lorna received the Margaret T. Singer Award from ICSA. Lorna joined ICSA’s Board of Directors in November 2003. Lorna has published numerous articles about her therapeutic work with former cult members in professional journals, most recently: Goldberg, L. (2012). Influence of a Charismatic Antisocial Cult Leader: Psychotherapy with an Ex-Cultist Prosecuted for Criminal Behavior. International Journal of Cultic Studies, Vol. 2, 15-24. Goldberg, L. (2011). Diana, Leaving the Cult: Play Therapy in Childhood and Talk Therapy in Adolescence. International Journal of Cultic Studies, Vol.2, 33-43. She also wrote a chapter on guidelines for therapists in the book, Recovery from Cults, edited by Michael Langone. Lorna has co-written with Bill Goldberg, a chapter on psychotherapy with targeted parents in the book, Working with Alienated Children and Families (2012), edited by Amy J.L. Baker \u0026 S. Richard Sauber. She also wrote a chapter on psychotherapy with a former member of a destructive cult, New Religious Movements and Counseling: Academic, Professional and Personal Perspectives, edited by Sarah Harvey, Silke Steidinger, \u0026 James Beckford (2017). Lorna was a co-editor of ICSA’s Cult Recovery: A Clinician’s Guide to Working with Former Members and Their Families, published in 2017.",
      "release": "2020-05-08T22:29:53Z",
      "duration": "01:10:43",
      "explicit": false,
      "youTubeId": "nxeGiacBXZc",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nxeGiacBXZc"
      }
    },
    {
      "id": "f9a2dc26-1692-4e53-abab-0c5b20258231",
      "title": "Stage 5: Escaping Exploitation",
      "description": "Stage 5: Escaping Exploitation (Dylesia Barner, LCSW)\n\nFormer cult member Dylesia Barner will give a personal account of her experience.\n\nLEARNING OBJECTIVES\n1. Identify the six stages of the grooming process and describe what occurs during each stage; 2. Formulate ideas around ethical intervention approaches for victims within each stage; 3. List resources available for\nvictims within each stage.\n\nDylesia Barner, LCSW, is a licensed clinical social worker and a second-generation adult cult survivor. She received a Master of Social Work from Norfolk State University in 2013 and a Bachelor of Science degree in Communication from Old Dominion University in 2011. From ages 15-18, Dylesia was a member of a cult of Christianity in Virginia. Having the perspectives of a survivor and a mental health provider, she is passionate about raising awareness about spiritual abuse and how to counsel those who are experiencing or have experienced it. Dylesia owns Existence, Consciousness, Bliss Counseling, Psychotherapy \u0026 Wellness Center in Nashville, TN and is a Doctorate of Social Work student at Millersville University.",
      "release": "2020-05-08T05:58:06Z",
      "duration": "00:27:59",
      "explicit": false,
      "youTubeId": "Z9XxEcUUaHo",
      "subjects": [
        "Self-Help",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z9XxEcUUaHo"
      }
    },
    {
      "id": "dba7e952-91a5-4d29-aa79-2e4d5f63275d",
      "title": "Coercive Control \u0026 Cults: An Overview",
      "description": "Coercive Control \u0026 Cults: An Overview (Steve Eichel)\n\nThink cults are a thing of the hippy dippy past? Think again. They affect almost every community in our country and across the globe. They may look like the traditional cult, or they may express themselves in coercive control of other stripes: human trafficking or radicalization. Learn how ever prevalent these scenarios are in our communities, and how to start to see clues of their presence.\n\nLEARNING OBJECTIVES\n1. Define a cult; 2. List three effects of coercive control on individuals and/or community; 3. Describe the state of cults in the U.S. today.\n\nSteve Eichel received his B.A. from Columbia University, and his M.S. and Ph.D. degrees from the University of Pennsylvania, and has been a licensed psychologist since 1982. After completing a clinical psychology internship at the Devereux Foundation, Eichel worked for six years as a child and family psychologist at the Irving Schwartz Institute for Children \u0026 Youth, followed by several years as the director of child and family services for a large urban mental health center in Camden, NJ. He was then appointed consulting forensic psychologist to the Family Court and juvenile justice systems of Camden County (NJ). Returning to Pennsylvania, he served as Clinical Director of the St. Francis Homes for Boys from 1989–1994, and directed the well-regarded Widener University-affiliated clinical psychology internship there. He also worked as a training consultant to the University of Medicine \u0026 Dentistry of NJ and as a family therapist for Community Centered Treatment, a multisystemic family therapy program funded by the Montgomery County (PA) family court and juvenile justice system. Eichel was associated with the Verree Psychology Group (formerly Dubrow-Eichel Psychological Associates) in Philadelphia from 1983 to the end of 2006.\nPresently, in addition to his private practice, he is an Adjunct Associate Professor of Psychology at the University of Delaware; previously he was on the part-time faculty at Philadelphia University (5 years) and for 10 years had been on the core faculty of Villanova University’s drug \u0026 alcohol counseling program. From 2004–06 he was a counselor educator/supervisor and Program Assistant for the CACREP-approved M.S.\nin Community Counseling program at Wilmington University in Delaware, and he served through 2006 as a Clinical Supervisor and Consulting Psychologist to St. Francis/St. Joseph’s Homes for Boys. From 1998–2000,\nhe was President of the Greater Philadelphia Society of Clinical Hypnosis (GPSCH), and was the 2006-07 President of the American Academy of Counseling Psychology, one of the national academies of advanced practitioners (ABPP Diplomates). He has served as a mentor to future candidates for ABPP Board certification. He was the 2009–10 Chair and CEO of the Council of Presidents of Psychology Specialty Academies. He currently serves as President of the Board of the International Cultic Studies Association. He is a member of APA’s Society of Psychological Hypnosis, Society for Counseling Psychology and the American Psychology-Law Society (APA Divisions 30, 17 and 41 respectively) and since 2006, he has served on the Executive Council of the Delaware Psychological Association as Chair of the Psychology and Law Committee. He has written articles on child therapy, hypnosis, child custody evaluations, capital (death penalty) mitigation, sex therapy and cults, and has authored four book chapters (with two more on the way); over the years, he has presented well over 150 workshops, papers and panels to local, state, regional, national and international professional associations.",
      "release": "2020-05-08T03:47:58Z",
      "duration": "01:15:46",
      "explicit": false,
      "youTubeId": "3zrd7yvucWA",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3zrd7yvucWA"
      }
    },
    {
      "id": "5e5a04a9-2625-4e75-8de7-877173d55c13",
      "title": "Repairing the \u0022Repair\u0022 After Reparative Therapy",
      "description": "Repairing the \u0022Repair\u0022 After Reparative Therapy (Dr. Cyndi Matthews and Dr. Colleen Logan; Ashlen Hilliard)\n\nDr. Colleen Logan’s career spans decades of activism, advocacy, and diversity training. She is known in particular for her expertise in providing diversity training related to the unique needs of the Lesbian, Gay, Bisexual, Transgender, and Queer (LGBTQ) communities.\n\nDr. Logan has been a Licensed Professional Counselor since 1994. She has maintained a private practice for over twenty years. She holds a License as a Supervisor in Texas. She has been recognized and commended by the American Counseling Association (ACA) and The Association of Gay, Lesbian, Bisexual and Transgender Issues in Counseling, a division of ACA for her contributions to the field of counseling and affirmative therapy with lesbian, gay, bisexual, and transgender individuals and their significant others. She is co-founder of the Texas Association of Gay, Lesbian and Bisexual Issues in Counseling, a division of Texas Counseling Association. She is a Fellow and former past president of the American Counseling Association (ACA). She remains active in the organization and currently serves as a trustee on the American Counseling Association Foundation (ACAF). She is also active in the Texas Counseling Association (TCA) and serves on the Board of Directors.\n\nDr. Logan has authored or co-authored a number of articles and chapters as well as a book regarding how to work effectively with gay, lesbian, bisexual, and transgender clients and their significant other. In 2016, Dr. Logan authored a document entitled Inclusion and Wellbeing of LGBTQ Youth, an award-winning document created for the Boys and Girls Clubs of America staff and volunteers. Moreover, in 2017, Dr. Logan co-authored a seminal guide to counseling the LGBTQ\u002B community across the lifespan.\n\nhttps://www.smu.edu/Simmons/AboutUs/Directory/Counseling/Logan\n\nDr. Cyndi Matthews is an Assistant Clinical Professor from Southern Methodist University and graduated with a PhD and Masters in Counseling and Counselor Education from Texas A\u0026M University-Commerce. Dr. Matthews previously worked at the University of Louisiana Monroe and the University of North Texas at Dallas before coming to SMU. She is a Licensed Professional Counselor-Supervisor (LPC-S) and a Nationally Certified Counselor (NCC) with over 17 years’ experience working with individuals, couples, and families. She is also a Cult Consultant who works with former cult members and their families from around the world.\n\nDr. Matthews’ research interests include religious/spiritual abuse along with its long-term effects and counseling best practices; counseling with LGBTQ\u002B individuals; and counseling individuals born and raised in religious cults. Her dissertation examined the long term effects of those born and raised in religious cults. She has published in the International Journal for the Advancement of Counselling, The Journal of LGBT Issues in Counseling, and the International Journal of Cultic Studies.\n\nShe is a member of ACA, ASERVIC, ALGBTIC, CSJ, TCA, TxCSJ, TALGBTIC, TAMFC, and ICSA and currently serves on the ICSA, ASERVIC, and ALGBTIC boards.\n\nDr. Matthews\u0027 private practice specializes in Depression/Anxiety/Stress, LGBTQ\u002B Issues/Gender Identity, Addiction, Religious Abuse \u0026 Cult Recovery, Post-Traumatic Stress Disorder, Sexual, Emotional, \u0026 and Physical Abuse, Anger Management, Domestic Violence, Sex Therapy, Premarital Counseling, Communication Skills, Crisis Management, and Relationship Effectiveness.\nDr. Matthews is trained in Trauma Focused Cognitive Behavioral Therapy (TFCBT), EMDR, Couples\u0027 Gottman (Levels I and II) and Couples’ Imago therapy, Sandtray Therapy, Online Counseling, and Psychodrama.\n\nhttps://www.smu.edu/Simmons/AboutUs/Directory/Counseling/Matthews",
      "release": "2020-05-07T01:04:20Z",
      "duration": "01:34:16",
      "explicit": false,
      "youTubeId": "zFT6R9tWZrw",
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zFT6R9tWZrw"
      }
    },
    {
      "id": "697c4da2-0167-4976-9750-cea6a5855ac4",
      "title": "Cults of Bible Misunderstanding: Basic Principles of Ancient Literature Interpretation",
      "description": "Cults of Bible Misunderstanding: Basic Principles of Ancient Literature Interpretation (Ron Burks)\n\nCult leaders greatest hits: passages of hope in the Bible twisted into triggers and despair.\n\nRon Burks, PhD, holds an MDiv and an MA in counseling from Asbury Theological Seminary and a PhD in Counselor Education from Ohio University. He worked for many years at Wellspring Retreat and Resource Center in Albany, Ohio. He and his wife Vicki wrote Damaged Disciples: Casualties of Authoritarian Churches and the Shepherding Movement, published by Zondervan. His other publications include a chapter on a connection between cults and addiction in the medical reference, Substance Abuse: A Comprehensive Textbook, published by Williams and Wilkins. He and Vicki now live near Tallahassee, Florida where both are licensed mental health counselors and operate an intensive outpatient substance abuse program at Tallahassee Memorial Hospital. Ron is a former president of the Wellspring board and is a clinical advisor to both Wellspring and Meadowhaven, a treatment center near Boston. \nEmail: ron@ronburksphd.com Phone: 850-273-6678. \nFlorida Phone/Electronic Consultation Possible",
      "release": "2020-05-06T05:10:39Z",
      "duration": "01:29:54",
      "explicit": false,
      "youTubeId": "EnaXqH56M6c",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EnaXqH56M6c"
      }
    },
    {
      "id": "c80f31c4-d6e4-428e-9d4c-3aec5b4008c7",
      "title": "ICSA History Collection Interview of Clark, Kelly, Ryan",
      "description": "ICSA History Collection: Clark, Kelly, Ryan \nInterview by Robert E. Schecter\n\nRobert E. Schecter interviewed tree exit counselors, David Clark, Joseph Kelly, and Patrick Ryan, on October 27, 2018 as part of a series of interviews designed to illuminate ICSA\u0027s history. The three men discuss the changes they have seen over the many years of their involvement in the field.",
      "release": "2020-05-05T15:55:48Z",
      "duration": "00:55:48",
      "explicit": false,
      "youTubeId": "-z1M1HRkobw",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-z1M1HRkobw"
      }
    },
    {
      "id": "355b6856-4d44-4a3d-8ec5-a58298501ae1",
      "title": "Spiritual Abuse, the Dallas Conference, and COVID-19",
      "description": "Spiritual Abuse, the Dallas Conference, and COVID-19 with (Dr. Cyndi Matthews and Kathyrn Keller Ph.D; Ashlen Hilliard)\n\nKathryn Keller, Ph.D.  is a Licensed Psychologist and Licensed Professional Counselor – Supervisor in Dallas, TX.  She co-owns a group counseling practice, Dallas Therapy Collective, where she sees clients for individual therapy. She graduated from Texas Woman’s University with her doctorate in counseling psychology. She conducted her doctoral dissertation on the topic of spiritual abuse, resulting in the first known measure of spiritual abuse. Kathryn’s practice is focused on clients who have experienced traumatic stress, including spiritual and religious trauma. She works particularly well with people who have experienced high levels of control in fundamentalist and evangelical Christian traditions. In addition to therapy, she enjoys training, consulting, supervising, and running many of the behind the scenes business aspects of her group practice. \n\nDr. Cyndi Matthews is an Assistant Clinical Professor from Southern Methodist University and graduated with a PhD and Masters in Counseling and Counselor Education from Texas A\u0026M University-Commerce. Dr. Matthews previously worked at the University of Louisiana Monroe and the University of North Texas at Dallas before coming to SMU. She is a Licensed Professional Counselor-Supervisor (LPC-S) and a Nationally Certified Counselor (NCC) with over 17 years’ experience working with individuals, couples, and families. She is also a Cult Consultant who works with former cult members and their families from around the world.\n\nDr. Matthews’ research interests include religious/spiritual abuse along with its long-term effects and counseling best practices; counseling with LGBTQ\u002B individuals; and counseling individuals born and raised in religious cults. Her dissertation examined the long term effects of those born and raised in religious cults. She has published in the International Journal for the Advancement of Counselling, The Journal of LGBT Issues in Counseling, and the International Journal of Cultic Studies.\n\nShe is a member of ACA, ASERVIC, ALGBTIC, CSJ, TCA, TxCSJ, TALGBTIC, TAMFC, and ICSA and currently serves on the ICSA, ASERVIC, and ALGBTIC boards.\n\nDr. Matthews\u0027 private practice specializes in Depression/Anxiety/Stress, LGBTQ\u002B Issues/Gender Identity, Addiction, Religious Abuse \u0026 Cult Recovery, Post-Traumatic Stress Disorder, Sexual, Emotional, \u0026 and Physical Abuse, Anger Management, Domestic Violence, Sex Therapy, Premarital Counseling, Communication Skills, Crisis Management, and Relationship Effectiveness.\nDr. Matthews is trained in Trauma Focused Cognitive Behavioral Therapy (TFCBT), EMDR, Couples\u0027 Gottman (Levels I and II) and Couples’ Imago therapy, Sandtray Therapy, Online Counseling, and Psychodrama.\n\nhttps://www.smu.edu/Simmons/AboutUs/Directory/Counseling/Matthews",
      "release": "2020-04-30T02:07:26Z",
      "duration": "01:33:58",
      "explicit": false,
      "youTubeId": "ejsFLUxy-z8",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ejsFLUxy-z8"
      }
    },
    {
      "id": "2c747c56-a1a6-4cd4-a4f1-5f0cccd9c336",
      "title": "Spiritual Practices During Uncertain Times; Spiritual Abuse and Transgender Individuals",
      "description": "Spiritual Practices During Uncertain Times; Spiritual Abuse and Transgender Individuals (Cyndi Matthews and Mark Wingfield; Ashlen Hilliard)\n\nMark Wingfield is associate pastor of Wilshire Baptist Church in Dallas and author of the new book Why Churches Need to Talk About Sexuality. He is a regular columnist for the Dallas Morning News and Baptist News Global and presented a 2016 TEDx Talk, “The Baptist Pastor And His Transgender Friends.” He is a former print journalist who combines his passion for social justice with his role as a pastor to serve as an advocate for those estranged from organized religion.\n\nWebsite: https://www.wilshirebc.org/about-wilshire/ministerial-staff/\n\nTed Talks: https://www.youtube.com/watch?v=ugl5hDuaVwQ\n\nDr. Cyndi Matthews is an Assistant Clinical Professor from Southern Methodist University and graduated with a PhD and Masters in Counseling and Counselor Education from Texas A\u0026M University-Commerce. Dr. Matthews previously worked at the University of Louisiana Monroe and the University of North Texas at Dallas before coming to SMU. She is a Licensed Professional Counselor-Supervisor (LPC-S) and a Nationally Certified Counselor (NCC) with over 17 years’ experience working with individuals, couples, and families. She is also a Cult Consultant who works with former cult members and their families from around the world.\n\nDr. Matthews’ research interests include religious/spiritual abuse along with its long-term effects and counseling best practices; counseling with LGBTQ\u002B individuals; and counseling individuals born and raised in religious cults. Her dissertation examined the long term effects of those born and raised in religious cults. She has published in the International Journal for the Advancement of Counselling, The Journal of LGBT Issues in Counseling, and the International Journal of Cultic Studies.\n\nShe is a member of ACA, ASERVIC, ALGBTIC, CSJ, TCA, TxCSJ, TALGBTIC, TAMFC, and ICSA and currently serves on the ICSA, ASERVIC, and ALGBTIC boards.\n\nDr. Matthews\u0027 private practice specializes in Depression/Anxiety/Stress, LGBTQ\u002B Issues/Gender Identity, Addiction, Religious Abuse \u0026 Cult Recovery, Post-Traumatic Stress Disorder, Sexual, Emotional, \u0026 and Physical Abuse, Anger Management, Domestic Violence, Sex Therapy, Premarital Counseling, Communication Skills, Crisis Management, and Relationship Effectiveness.\n\nDr. Matthews is trained in Trauma Focused Cognitive Behavioral Therapy (TFCBT), EMDR, Couples\u0027 Gottman (Levels I and II) and Couples’ Imago therapy, Sandtray Therapy, Online Counseling, and Psychodrama.\n\nhttps://www.smu.edu/Simmons/AboutUs/Directory/Counseling/Matthews",
      "release": "2020-04-30T00:00:25Z",
      "duration": "01:33:14",
      "explicit": false,
      "youTubeId": "EWAxUKyY8nA",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EWAxUKyY8nA"
      }
    },
    {
      "id": "2b044e0f-f54d-4e4d-8da2-273a4f9286e3",
      "title": "Former LDS Response to COVID-19",
      "description": "Former LDS Response to COVID-19 (Julienna Viegas and Dr. Cyndi Matthews; Ashlen Hilliard) \n\nJulienna Viegas was born and raised in Belgium. She grew up as a member of the Church of Jesus Christ of latter-day saints. She left the mainstream Mormon Church in 2015 after going through a faith crisis which led her to question the foundation of her childhood beliefs. Since then she has published several articles in the Salt Lake Tribune questioning practices in the Mormon Church, she was interviewed on Mormon Stories by John Dehlin, she participated in multiple podcasts and hosts her own Faith Transition Podcast. Julienna studied International Politics at Brigham Young University in Provo, Utah. She currently works as a business developer in a FinTech company and also volunteers to lead a faith transition support group in North Dallas. Julienna is the mother of three children. She is currently finishing a book about faith transition. She enjoys traveling and staying physically active.\n\nWebsite: https://thefaithtransitionpodcast.com/if6oq2yk6qk6l453u5oxl38ojb66y4\n\nOp-ed: https://archive.sltrib.com/article.php?id=3826343\u0026itype=CMSID\n\nDr. Cyndi Matthews is an Assistant Clinical Professor from Southern Methodist University and graduated with a PhD and Masters in Counseling and Counselor Education from Texas A\u0026M University-Commerce. Dr. Matthews previously worked at the University of Louisiana Monroe and the University of North Texas at Dallas before coming to SMU. She is a Licensed Professional Counselor-Supervisor (LPC-S) and a Nationally Certified Counselor (NCC) with over 17 years’ experience working with individuals, couples, and families. She is also a Cult Consultant who works with former cult members and their families from around the world.\n\nDr. Matthews’ research interests include religious/spiritual abuse along with its long-term effects and counseling best practices; counseling with LGBTQ\u002B individuals; and counseling individuals born and raised in religious cults. Her dissertation examined the long term effects of those born and raised in religious cults. She has published in the International Journal for the Advancement of Counselling, The Journal of LGBT Issues in Counseling, and the International Journal of Cultic Studies.\n\nShe is a member of ACA, ASERVIC, ALGBTIC, CSJ, TCA, TxCSJ, TALGBTIC, TAMFC, and ICSA and currently serves on the ICSA, ASERVIC, and ALGBTIC boards.\n\nDr. Matthews\u0027 private practice specializes in Depression/Anxiety/Stress, LGBTQ\u002B Issues/Gender Identity, Addiction, Religious Abuse \u0026 Cult Recovery, Post-Traumatic Stress Disorder, Sexual, Emotional, \u0026 and Physical Abuse, Anger Management, Domestic Violence, Sex Therapy, Premarital Counseling, Communication Skills, Crisis Management, and Relationship Effectiveness.\n\nDr. Matthews is trained in Trauma Focused Cognitive Behavioral Therapy (TFCBT), EMDR, Couples\u0027 Gottman (Levels I and II) and Couples’ Imago therapy, Sandtray Therapy, Online Counseling, and Psychodrama.\n\nhttps://www.smu.edu/Simmons/AboutUs/Directory/Counseling/Matthews",
      "release": "2020-04-29T21:59:22Z",
      "duration": "01:24:54",
      "explicit": false,
      "youTubeId": "Z7bWlVIG1PE",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z7bWlVIG1PE"
      }
    },
    {
      "id": "21202c2a-9496-4afb-b744-30c11e08a366",
      "title": "ICSA History Collection: Interview with Mr. Kay Barney",
      "description": "ICSA History Collection: Mr. Kay Barney \nInterview with Mr. Kay Barney by Robert E. Schecter \n\nRobert E. Schecter  interviewed Mr. Kay Barney, on November 10, 2018 as part of a series of interviews designed to illuminate ICSA’s history.  Mr. Barney founded the American Family Foundation (AFF), which in 2004 changed its name to the International Cultic Studies Association (ICSA). Mr. Barney discusses the personal situation that first got him interested in cults, the events that led to the formation of ICSA (then AFF), early challenges, and current prospets.",
      "release": "2020-04-29T16:26:34Z",
      "duration": "00:35:47",
      "explicit": false,
      "youTubeId": "HztfXvw1w0c",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HztfXvw1w0c"
      }
    },
    {
      "id": "7d9dc627-9854-47e2-babc-1f90bd8db6bf",
      "title": "Therapy and Recovery",
      "description": "Therapy and Recovery (Rachel Bernstein, LMFT; Ashlen Hilliard)\n\nRachel Bernstein LMFT offers:\n* FORMER CULT MEMBER SUPPORT GROUP - Every other Wednesday night in Los Angeles\n* Office line - 818-907-0036\n* Bernsteinlmft@gmail.com \n* www.rachelbernsteintherapy.com \n* Facebook- Rachel Bernstein LMFT\n* Host of the weekly podcast \u0022IndoctriNation\u0022 \n* Check out IndoctriNation on #SoundCloud https://soundcloud.com/indoctrination...\n* Advisory Board Member - ICSA",
      "release": "2020-04-29T02:41:45Z",
      "duration": "01:15:11",
      "explicit": false,
      "youTubeId": "pbTm0DTi5Ck",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pbTm0DTi5Ck"
      }
    },
    {
      "id": "90900c58-fbde-4a02-914d-7cadafd1ed31",
      "title": "How the Current Crisis May Be Triggering Spiritual Abuse Survivors",
      "description": "How the Current Crisis May Be Triggering Spiritual Abuse Survivors (Dylesia Barner, LCSW; Ashlen Hilliard)\n\nIn what ways coercive control group involvement and COVID-19 are similar crises and what common clinical treatment and self-management approaches exist for survivors who are currently experiencing  PTSD symptoms as a result of all that’s occurring. \n\nDylesia Barner, LCSW,  is a licensed clinical social worker and a second-generation adult survivor. She received a Master of Social Work from Norfolk State University in 2013 and a Bachelor of Science degree in Communication from Old Dominion University in 2011. From ages 15-18, Dylesia was a member of a cult of Christianity in Virginia. Having the perspectives of a survivor and a mental health provider, she is passionate about raising awareness about spiritual abuse and how to counsel those who are experiencing or have experienced it. Dylesia owns Existence, Consciousness, Bliss Counseling, Psychotherapy \u0026 Wellness Center in Nashville, TN and is a Doctorate of Social Work student at Millersville University.  Existence, Consciousness, Bliss Counseling, Psychotherapy \u0026 Wellness Center, 1033 Demonbreun St., Suite 300, Nashville, TN 37203. dylesia@ecb-nashville.org. www.ecb-nashville.org.  615-212-8955",
      "release": "2020-04-29T01:27:43Z",
      "duration": "00:51:12",
      "explicit": false,
      "youTubeId": "5BtJgYZTJQI",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5BtJgYZTJQI"
      }
    },
    {
      "id": "3b930cad-854b-4d6a-9744-f0cf90355d40",
      "title": "Recovery and the New Age",
      "description": "Recovery and the New Age (Joseph Szimhart; Ashlen Hilliard)\n\nRecovering from New Ageism and cults that promote channeling, magical or mental healing, and cults of positive thinking. I’ll talk about channeling as having gods or angels on a leash as “mind puppets”. The similarities to and distinctions from mental illness in people who overvalue their ideas and beliefs. The persistence of hope for a massive change in one lifetime that enables cult leaders to tap recruits. \n\nCheck out his new book! \nSanta Fe, Bill Tate, and me: How an artist became a cult interventionist\nhttps://www.amazon.com/Santa-Fe-Bill-Tate-interventionist/dp/1676003886\n\nJoseph Szimhart began research into cultic influence in 1980, after ending his two-year devotion to a New Age sect. He began to work professionally as an intervention specialist and exit counselor in 1986 on an international scale. From 1985 through 1992, he was chairman of an interdenominational, cult information organization in New Mexico. Since 1998 he has worked in the crisis department of a psychiatric emergency hospital in Pennsylvania. He continues to assist families with interventions and former members in recovery, including consultations via phone and the Internet. He maintains a cult informational website, lectures, consults for the media, and has published articles, book reviews, and papers related to the cult problem. His first novel, Mushroom Satori: The Cult Diary, was released in 2013 through Aperture Press. He has an art studio at Goggleworks Center for the Arts in Reading, PA. In 2016 he received an ICSA Lifetime Achievement Award at the Annual Conference in Dallas, Texas. \n\nWebsite: http://jszimhart.com/ \nEmail: jszimhart@gmail.com \nPhone: (484) 529-1936.",
      "release": "2020-04-29T00:35:12Z",
      "duration": "01:06:48",
      "explicit": false,
      "youTubeId": "rLASDGPStsE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rLASDGPStsE"
      }
    },
    {
      "id": "b322e996-8b4e-4205-b2e8-6af1bb4b2fcc",
      "title": "ICSA History Collection: Interview of Linda Dubrow Marshall",
      "description": "ICSA History Collection: Linda Dubrow Marshall \nInterview with Linda Dubrow Marshall by Robert E. Schecter\n\nRobert E. Schecter interviewed Linda Dubrow-Marshall on July 5, 2018 as part of a series of interviews designed to illuminate ICSA\u0027s history. Dr. Dubrow-Marshall describes her early work in this area, including the founding of the counseling organization, RETIRN, and her views of ICSA and its future.",
      "release": "2020-04-26T23:11:21Z",
      "duration": "00:46:38",
      "explicit": false,
      "youTubeId": "riMK9ghri-c",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=riMK9ghri-c"
      }
    },
    {
      "id": "895f5dd5-e736-4194-b70f-006eb533cba5",
      "title": "ICSA History Collection: Interview of Rod Dubrow Marshall",
      "description": "ICSA History Collection: Rod Dubrow Marshall\nInterview with Rod Dubrow Marshall by Robert E. Schecter\n\nRobert E. Schecter interviewed Rod Dubrow-Marshall on July 5, 2018 as part of a series of interviews designed to illuminate ICSA\u0027s history. Dr. Dubrow-Marshall describes his initial contact with ICSA, early work in this area, development of totalistic identity theory, and his views on ICSA and its future.",
      "release": "2020-04-26T23:10:57Z",
      "duration": "00:43:29",
      "explicit": false,
      "youTubeId": "g9SMN56RGho",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g9SMN56RGho"
      }
    },
    {
      "id": "7c44da66-2e18-4b51-bf8c-75d36a48185b",
      "title": "The Challenge of Cult Recovery During a Time of Crisis",
      "description": "The Challenge of Cult Recovery During a Time of Crisis (Rachel Bernstein LMFT)\n\nHow former cult members and the families of current and former cult members can address the needs they have along with the additional stress and worry brought on by global unpredictability.\n\nRachel Bernstein LMFT offers:\n* FORMER CULT MEMBER SUPPORT GROUP - Every other Wednesday night in Los Angeles\n* Office line - 818-907-0036\n* Bernsteinlmft@gmail.com \n* www.rachelbernsteintherapy.com \n* Facebook- Rachel Bernstein LMFT\n* Host of the weekly podcast \u0022IndoctriNation\u0022 \n* Check out IndoctriNation on #SoundCloud https://soundcloud.com/indoctrinationshow\n* Advisory Board Member - ICSA",
      "release": "2020-03-27T15:49:09Z",
      "duration": "01:00:36",
      "explicit": false,
      "youTubeId": "itzv2DAXPow",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=itzv2DAXPow"
      }
    },
    {
      "id": "fe3c1ebc-a7b6-49b4-a068-e1518c2f6c59",
      "title": "ICSA History Collection: Interview of Wendy Ford Wolfberg",
      "description": "ICSA History Collection: Wendy Ford Wolfberg\nInterview with Wendy Ford Wolfberg by Robert E. Schecter \n\nRobert E. Schecter interviewed Wendy Ford Wolfberg on May 3, 2018 as part of a series of interviews designed to illuminate ICSA’s history. Ms. Ford Wolfberg, who wrote Recovery From Abusive Groups, discusses her cult experience, deprogramming, and recovery. She also discusses changes she has observed in the field and her views on ICSA and its future.",
      "release": "2020-02-04T00:45:04Z",
      "duration": "00:27:40",
      "explicit": false,
      "youTubeId": "f-xoarCZmmY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f-xoarCZmmY"
      }
    },
    {
      "id": "c669e6c7-9e0a-41e7-b2de-870ffa35d90d",
      "title": "ICSA History Collection: Interview of Alan Scheflin",
      "description": "ICSA History Collection: Alen Scheflin \nInterview with Alan Scheflin by Robert E. Schecter \n\nRobert E. Schecter interviewed Alan W. Scheflin on July 6, 2018 as part of a series of interviews designed to illuminate ICSA’s history. In the interview, Professor Scheflin, a former president of ICSA, discusses how he became interested in cults, his research and writings, and his views on ICSA and its future.​",
      "release": "2020-01-15T21:10:17Z",
      "duration": "00:21:54",
      "explicit": false,
      "youTubeId": "BqIAc6OYTl8",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BqIAc6OYTl8"
      }
    },
    {
      "id": "e9b4fff6-8a5b-421c-a802-e43d0752f69b",
      "title": "ICSA History Collection: Interview of Steve Eichel",
      "description": "ICSA History Collection: Steve Eichel \nInterview with Steve Eichel by Robert E. Schecter \n\nRobert E. Schecter interviewed Steve K. D. Eichel on July 7, 2018 as part of a series of interviews designed to illuminate ICSA’s history. Dr. Eichel, who has served as ICSA’s president, discusses his early work in this field, including co-founding the counseling organization RETIRN. He also discusses changes he has observed in the field and his views on ICSA and its future.​",
      "release": "2020-01-04T18:19:57Z",
      "duration": "00:40:35",
      "explicit": false,
      "youTubeId": "D4lbyMwkvvs",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=D4lbyMwkvvs"
      }
    },
    {
      "id": "9c999907-409e-43d6-bd84-9952de9326a1",
      "title": "ICSA History Collection: Interview of Eileen Barker",
      "description": "ICSA History Collection: Eileen Barker \nInterview with Eileen Barker by Robert E. Schecter \n\nRobert E. Schecter interviewed Professor Barker on July 7, 2018 as part of a series of interviews designed to illuminate ICSA’s history. Dr. Barker describes her early work in this area, including the founding of the British organization, INFORM, and how the pro-anti-cult polarization diminished as a result of ongoing dialogue that began in the late 1990s. She also discusses her views of ICSA and its future.",
      "release": "2020-01-04T18:10:44Z",
      "duration": "00:40:07",
      "explicit": false,
      "youTubeId": "iSJhnRx7N74",
      "subjects": [
        "Cult Apologists"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iSJhnRx7N74"
      }
    },
    {
      "id": "2fad5b90-3d16-48b7-be63-b47df270660b",
      "title": "ICSA History Collection: Interview with Michael Kropveld",
      "description": "ICSA History Collection: Michael Kropveld \nInterview with Michael Kropveld by Robert E. Schecter \n\nRobert E. Schecter interviewed Michael Kropveld on April 7, 2018 as part of a series of interviews designed to illuminate ICSA’s history. Mr. Kropveld discusses how he first got interested in this field, the founding of the organization he now heads (Info-Cult/Info-Secte), changes he has observed in the field over the years, and his views on ICSA and its future.",
      "release": "2020-01-04T16:02:06Z",
      "duration": "00:40:12",
      "explicit": false,
      "youTubeId": "SQOBRIgmEFw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SQOBRIgmEFw"
      }
    },
    {
      "id": "98750a76-7f7a-48f1-b870-f7af114905dc",
      "title": "ICSA History Collection: Interview of Marcia Rudin",
      "description": "ICSA History Collection: Marcia Rudin\nInterview with Marcia Rudin by Robert E. Schecter\n\nRobert E. Schecter interviewed Marcia Rudin on July 5, 2018 as part of a series of interviews designed to illuminate ICSA’s history. Ms. Rudin discusses her early work in this field, including the publication of one of the first books on the subject. She also discusses her work as director of ICSA’s International Cult Education Program and her views on ICSA and its future.",
      "release": "2019-12-19T20:32:48Z",
      "duration": "00:18:58",
      "explicit": false,
      "youTubeId": "K6F5jE2wmJk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K6F5jE2wmJk"
      }
    },
    {
      "id": "a0ab93ff-9161-45a4-81a9-c7c097336902",
      "title": "Former Jehovah\u0027s Witness Recovery Series: Interview with Gillie Jenkinson",
      "description": "Former Jehovah\u0027s Witness Recovery Series: Gillie Jenkinson \nInterview with Gillie Jenkinson by Ashlen Hilliard \nFriday, November 15th, 2019\r\n\nThe objectives for this series:\r\n1) Help former members identify psychological challenges that may arise when they leave the faith.\r\n2) Provide relevant background information for therapists working with former Jehovah’s Witnesses.\r\n3) Provide information that will help former Jehovah’s Witnesses in therapy better understand the issues with which they are dealing.\r\n\nAdditional Resources:\nCult Recovery: A Clinician’s Guide to Working with Former Members and Families (pp. 215-240)\r\nhttps://documentcloud.adobe.com/link/track?uri=urn%3Aaaid%3Ascds%3AUS%3A9f5dde23-6cd0-4629-993d-2adb1977bf7b\r\n\nInfluence: The Psychology of Persuasion, Revised Edition\r\nby Robert B. Cialdini\r\nhttps://www.amazon.com/Influence-Psychology-Persuasion-Robert-Cialdini/dp/006124189X\r\n\nThe Discipling Dilemma, Chapter 2:\nPersonality assessment tool results amongst members of the International Churches of Christ (Boston Movement)\nhttp://www.somis.org/TDD-02.html\r\n\nOut in the World: Post-Cult Recovery\nBy Gillie Jenkinson\nAccess link: https://www.researchgate.net/publication/332036519_Out_in_the_World_Post-Cult_Recovery\r\n\nEmail mail@icsamail.com if you would like a pdf of this article\r\n\nQuestions to Ask a Potential Therapist\r\nAdobe Cloud Viewing link: https://documentcloud.adobe.com/link/track?uri=urn%3Aaaid%3Ascds%3AUS%3Aef19cfb8-36fb-44ab-b791-3b81ad5db6b0\r\n\nEmailmail@icsamail.com if you would like a pdf of this article\r\n\n\u0027Leaving Psychologically - Breaking the Confluential Trance\u0027 \nBy Gillie Jenkinson in the latest version of the International Journal of Cultic Studies (IJCS) \r\nhttps://drive.google.com/file/d/172bEHlQpNOvmqajGXQFPrG_q4pTk8UEw/view\r\n\n(Journals are typically for ICSA members only, to access future and past journals please consider becoming a member)",
      "release": "2019-12-05T18:26:12Z",
      "duration": "00:59:50",
      "explicit": false,
      "youTubeId": "gCuV8uYVzbk",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gCuV8uYVzbk"
      }
    },
    {
      "id": "6b8f9b9d-4e11-4635-9d49-d29c2769724f",
      "title": "ICSA History Collection: Interview with Michael Langone",
      "description": "ICSA History Collection: Michael Langone \nInterview with Michael Langone by Robert E. Schecter \n\nRobert E. Schecter  interviewed Michael Langone, on April 7, 2018 as part of a series of interviews designed to illuminate ICSA’s history. Dr. Langone, long-time executive director of ICSA, discusses his work in the early 1980\u0027s with Dr. John Clark and the American Family Foundation (ICSA\u0027s original name), the changes he has observed in the organization and the cultic studies field, and his views on ICSA and its future.",
      "release": "2019-11-28T21:16:43Z",
      "duration": "01:03:50",
      "explicit": false,
      "youTubeId": "hJBErAyWv5A",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hJBErAyWv5A"
      }
    },
    {
      "id": "f6d5c205-6afb-4c21-a551-4ad37b7f57ed",
      "title": "Former Jehovah\u0027s Witness Recovery Series: Interview with Michael Shemwell",
      "description": "Former Jehovah\u0027s Witness Recovery Series: Michael Shemwell\nInterview with Michael Shamwell by Ashlen Hilliard\nSunday, October 27th, 2019\n\nThe objectives for this series:\n\n1) Help former members identify psychological challenges that may arise when they leave the faith.\n\n2) Provide relevant background information for therapists working with former Jehovah’s Witnesses.\n\n3) Provide information that will help former Jehovah’s Witnesses in therapy better understand the issues with which they are dealing.",
      "release": "2019-11-15T14:16:55Z",
      "duration": "01:23:04",
      "explicit": false,
      "youTubeId": "2wfJB7O319Q",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2wfJB7O319Q"
      }
    },
    {
      "id": "4e0b7fa0-f5a7-4487-8efb-d02f7588c835",
      "title": "Building Bridges; Leaving and Recovering From Cultic Groups and Relationships",
      "description": "Building Bridges; Leaving and Recovering From Cultic Groups and Relationships (Patrick Ryan, Joseph Kelly)\n\nTopics discussed include:\nAssessing a family’s unique situation; understanding why people join and leave groups; considering the nature of psychological manipulation and abuse; being accurate, objective, and up-to-date; looking at ethical issues; learning how to assess you situation; formulating a helping strategy; learning how to communicate more efficiently with your loved one; learning new ways of coping.",
      "release": "2019-10-10T23:34:09Z",
      "duration": "00:44:06",
      "explicit": false,
      "youTubeId": "b_wzgSdX_hQ",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=b_wzgSdX_hQ"
      }
    },
    {
      "id": "1bb0df8e-d93c-4df5-add4-0736b037efb7",
      "title": "Former Member Guilt and the Path to Self-Forgiveness",
      "description": "Former Member Guilt and the Path to Self-Forgiveness (Nori Muster, Lorna Goldberg)\n\nWhen individuals join a dangerous cult, they unconsciously adopt the group’s negative habits. Certain assumptions in the group’s “perfect” dogma contribute to this process, for example, leaders might openly profess “anything is allowed if it’s done for god,” “the guru said it’s okay, so it’s okay,” and “the laws of man do not apply to us because we dedicated ourselves to god.” To prove themselves loyal, new recruits quickly learn to repress their gut feelings and rightly-felt doubts. Authoritarian groups operate under a “no talk” rule, where it is considered a grave sin to acknowledge shortcomings in the hierarchy. For example, in ISKCON, the Krishna consciousness organization, they called it “blasphemy of a pure devotee” to speak about anything the gurus did wrong. Meanwhile, gurus notoriously did dishonest things and involved followers in unethical behavior that would make any normal person feel shame. Gurus then use this shame to manipulate followers. While under the spell of the group, even good, honest people who join may internalize the attitudes of arrogance and denial. They may never uncover any reason to feel guilt. However, most often, former members who took part in crimes and abuses do feel guilt after they leave. Ex-members’ guilt may be overly harsh, due to internalizing cult leaders’ punitive and uncompassionate attitudes. In this presentation, Nori Muster will discuss her personal struggle overcoming post-cult guilt, and Lorna Goldberg and Nori will discuss reasons why former members may hold onto or deny the guilt they feel. Lorna will share self-forgiveness tools to help ex-members reframe their experiences, reduce their self-punishing attitudes, and free themselves from their groups once and for all.",
      "release": "2019-10-04T14:35:55Z",
      "duration": "01:29:52",
      "explicit": false,
      "youTubeId": "qD-0VNDsRlA",
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qD-0VNDsRlA"
      }
    },
    {
      "id": "a5dbe6cf-bacb-4589-bbca-491730d1492c",
      "title": "Parent to Parent: Keeping Your Teen Safe and Prevention Before Recruitment: Where Do We Begin?",
      "description": "Parent to Parent: Keeping Your Teen Safe and Prevention Before Recruitment: Where do we Begin? (Robin Boyle-Laisure and Andrea Laisure)\n\nThis talk will address various forms of harmful relationships affecting pre-teens, teenagers, and young adults. Attempts to lure minors and young adults into organizations take the form of religious or non-religious cults, with college campuses as vulnerable sites for recruitment. International human trafficking rings, have become increasingly difficult to police. Furthermore, as detailed in Rachel Lloyd\u0027s book, Girls Like Us, teenagers are often targets of commercial sexual exploitation. In addition, are incidents of one-on-one abuse between teens within romantic relationships. Previously depicted as \u0022\u0022domestic violence\u0022\u0022 among adults, there can be similar harmful dynamics between teenagers. In Part I of my talk, I would focus on how undue influence plays a role in the following: - Recruitment into cults; (many speakers will address this, so this would be short) - Recruitment into human trafficking rings; - Commercial sex industry; and - Abusive one-on-one romantic relationships. And Part II would be - how to talk to your pre-teen and teenager to prevent these relationships from forming; - warning signs for parents about abusive relationships their children may be having; - suggested ways to handle if you\u0027ve suspected a dangerous relationship; and - where to turn for help.\n\n\nPrevention Before Recruitment: Where do we Begin? \n\nAlexandra Stein \n\nIn 1952, Solomon Asch, the great social psychologist and scholar of social influence, wrote: “The greater man’s ignorance of the principles of his social surroundings, the more subject is he to their control; and the greater his knowledge of their operations and of their necessary consequences, the freer he can become with regard to them.” Unfortunately, there has been little progress in the 21st century on developing public education to remedy this ignorance of controlling social influence mechanisms and thereby increase resistance in the general population to recruitment to cults and extremist groups. This paper will examine why this might be so, and propose what steps can be taken to increase knowledge of social influence to strengthen this resistance. I will suggest that prevention of both cult involvement and radicalization to extremism requires teaching people, in an ideologically neutral way, specifically about totalist groups and relationships including the methods, structures and likely outcomes of such involvements. Current prevention efforts on extremism tend to be targeted at those already recruited, or at least exposed to recruitment attempts. I will suggest that we must start much earlier in the process and reinforce this education at all levels of learning. Educators and policy makers can contribute to this effort by drawing on the rich history of research in the social and psychological sciences that has accumulated over the past 70 years, along with contemporary scholarship.",
      "release": "2019-04-17T13:57:01Z",
      "duration": "00:37:28",
      "explicit": false,
      "youTubeId": "AKuiZFPHVfw",
      "subjects": [
        "Human Trafficking",
        "One-on-one",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AKuiZFPHVfw"
      }
    },
    {
      "id": "f6e4cba5-5e56-440d-aa18-69437dd45b2f",
      "title": "Leaving and Recovering From Cultic Groups and Relationships",
      "description": "Leaving and Recovering From Cultic Groups and Relationships (Michael Langone, PhD; Patrick Ryan)\n\nVirtual event of International Cultic Studies Association (ICSA), conducted on Nov. 17, 2018. Speakers: Michael Langone, PhD; Patrick Ryan. For more information, visit www.icsahome.com",
      "release": "2019-01-18T19:34:09Z",
      "duration": "01:49:19",
      "explicit": false,
      "youTubeId": "UzFjuqJ6Ngk",
      "subjects": [
        "Cult-Expert",
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UzFjuqJ6Ngk"
      }
    },
    {
      "id": "67e89ab8-3b4b-4516-85fa-e6eec9209cc5",
      "title": "Coming to Grips With Your Story",
      "description": "Coming to Grips with Your Story (Chris Shelton)\n\nChris Shelton works to educate the public about extremist/high control groups such as the Church of Scientology, through videos, podcasts and print publications. Known as the “Critical Thinker at Large” to nearly 15,000 YouTube subscribers, Chris has been producing video content from Denver, CO since 2014. Following his exit in 2012 from Scientology’s management group, the Sea Organization, Chris cultivated the specialized communication and organizational skills he developed through various roles in Scientology’s management group, the Continental Liaison Office of the Western United States. Chris was a second-generation Scientologist, brought into the group at age three by his parents in California, and began working for Scientology after completing high school. After nearly 25 years of membership, Chris left Scientology. Motivated to expose his experiences in Scientology and to educate the general public on the beliefs, policies, practices, and dangers of the group, Chris published Scientology: A to Xenu (Graphicwerks, 2014), has produced dozens of solo broadcasts, has interviewed more than 100 guests for video and his “Sensibly Speaking” podcast, edits the interviews and promotes them through social media channels. Chris appeared on Leah Remini: Scientology and the Aftermath (A\u0026E, 2017) in Season One, Special Episode One. Three strong influences in his post-Scientology recovery include Carl Sagan\u0027s The Demon Haunted World, James Randi, skeptic.com, and Michael Shermer, who contributed to the reshaping of his worldview and his desire to promote critical thinking and reason as a counter to undue influence and thought reform techniques. Just one of Chris’s near future goals includes university studies in undue influence and anti-extremism.",
      "release": "2018-09-22T15:17:37Z",
      "duration": "00:24:21",
      "explicit": false,
      "youTubeId": "xjKNaxq6Jbg",
      "subjects": [
        "Scientology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xjKNaxq6Jbg"
      }
    },
    {
      "id": "724923d8-bfbd-4784-b906-a86677d74ad2",
      "title": "We Disagree-Let’s Talk! Why Diversity \u0026 Dialogue are Necessary \u0026 How We Overcome Undermining Factors",
      "description": "\u0022We Disagree-Let’s Talk! Why Diversity and Dialogue are Necessary and How We Overcome Undermining Factors\u0022 (Lorna Goldberg) \n\n\nOpening Plenary with Lorna Goldberg, LCSW: 2018 Annual Conference",
      "release": "2018-09-01T18:04:45Z",
      "duration": "00:38:30",
      "explicit": false,
      "youTubeId": "fvqJVCMSaiw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fvqJVCMSaiw"
      }
    },
    {
      "id": "8d87064b-fa44-43fa-81e5-8077ccf4f54d",
      "title": "Interview with Dr. Eolene Boyd-MacMillan",
      "description": "Interview with Dr. Eolene Boyd-MacMillan by Oliver Smith\n\nDr Eolene Boyd-MacMillan is a social psychologist based in the Department of Psychology, University of Cambridge, and co-directs the ICthinking® research group. She is also Co-Founder, Co-Director of IC Thinking (Cambridge) Ltd (company no. 09128885). Since 2007, Dr Boyd-MacMillan and colleagues at the University of Cambridge have pioneered an approach to address inter-group conflicts and extremisms, which uses an empirical measure frame with predictive results. I asked Dr Boyd-MacMillan about what ICthinking® might have to say about the links between cults and extreme groups just generally, as well as finding out more about the ICthinking® project itself.\n\nSome useful links:\n\nDr Boyd-MacMillan staff profile, Cambridge: http://www.csap.cam.ac.uk/network/eolene-boyd-macmillan/\n\nICthinking® homepage: https://sites.google.com/site/icthinking/\nI SEE! Scotland\n\nYouTube video: https://www.youtube.com/watch?v=crJVh5v-2xs\n\nLink to video transcript here: \nhttps://drive.google.com/file/d/1RULZFdaz3HTDjQAJGR-tn2vf-Da1MNdA/view?usp=sharing",
      "release": "2018-06-01T16:40:54Z",
      "duration": "01:00:45",
      "explicit": false,
      "youTubeId": "NxZoPcOYeVY",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NxZoPcOYeVY"
      }
    },
    {
      "id": "b4a44473-bf25-4169-ad66-c976e827934c",
      "title": "Applying Cultural Competency to Work with Former Cult Members",
      "description": "Applying Cultural Competency to Work with Former Cult Members (Matthew Staton, MDiv Counseling)\n\nHow can we improve competence in counseling clients emerging from coercive religious backgrounds? Training and conceptual models for use with this specific population are scarce. However, research and anecdotal evidence indicate that each coercive group (broadly defined, a cult) creates its own culture, complete with a unique body of knowledge, morality, rules, literature, and terminology. This culture so shapes its adherents that second-generation adults often feel like third-culture kids when assimilating into mainstream culture after exiting the cult. A question we often encounter in our online cult-recovery groups is whether anyone can recommend a local counselor who “gets it” — that is, someone who understands how deeply the cult\u0027s teachings are ingrained and can help them overcome the conditioned responses that inhibit their assimilation into society outside the cult. In this session, we will address the vacuum that exists for counselors working with this population by building on the premise that a cult is a culture. Approaching a cult as a culture provides counselors with an opportunity to apply their existing cultural competence. It also implies possible challenges for the client that might not otherwise be obvious in communicating between the cult and mainstream culture. We will use the knowledge and skills related to cultural competence in general to suggest interventions for working with those who have experienced abusive spiritual systems.",
      "release": "2018-04-17T17:46:19Z",
      "duration": "00:46:50",
      "explicit": false,
      "youTubeId": "z1ouLm2I-_o",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=z1ouLm2I-_o"
      }
    },
    {
      "id": "2c46bae0-1a54-4203-90db-1c1b8efa6f6b",
      "title": "Can A Fish See Water?",
      "description": "Can A Fish See Water? (Cathy Harris)\n\nCathy Harris is a former member of Jehovah’s Witnesses. She committed to the group by baptism at 17 years old. After 23 years and a suicide attempt, she began attending college (in spite of the group’s ban on higher education). After 3 years, at 43 years old, she made the decision to “disassociate” from the group, essentially ex-communicating herself. Reading Lifton\u0027s work, Thought Reform and the Psychology of Totalism: A Study of \u0022Brainwashing\u0022 in China and The Orwellian World of Jehovah’s Witnesses by Gary and Heather Botting was life-changing and put her on a path to leaving the religious group she had served for 26 years. Freedom and personal integrity—foreign concepts in the group—became paramount as she struggled to leave the cocoon of membership behind. Cathy had previously been quite active in preaching and staying faithful to Watchtower teachings. As Cathy tells her own story she will demonstrate her adaptation of Dr. Colin Ross’ Trauma Model for treatment and she will answer:\n\nWho joins cults and why? \nWhat makes individuals begin to question their group involvement? \nWhat if no qualified support is available? \nHow can family members and friends help their loved ones who are involved? \nWhat challenges do survivors face as they recover? \nHow can parents help their children resist participation in cultic groups?",
      "release": "2018-03-28T20:35:10Z",
      "duration": "00:34:33",
      "explicit": false,
      "youTubeId": "sBO7JcdbHz0",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sBO7JcdbHz0"
      }
    },
    {
      "id": "e80ce3ac-a35d-44d6-8090-1ac6de4042f2",
      "title": "Updating The Legal Concept of Undue Influence in the 21st Century",
      "description": "Updating The Legal Concept of Undue Influence in the 21st Century (Alan Scheflin)\n\nThis talk will explain how the legal concept of undue influence, which has existed for centuries, can be helpful to former members of cultic groups today. Judges have hesitated or refused to hear testimony about brainwashing, mind control, and thought reform on the grounds, that, in their opinion, these concepts lack scientific validity. How can expert witnesses be more persuasive in court? What will help bring clever influencers to justice? The discussion will focus on how the undue influence concept can be updated and applied to cultic relationships, human trafficking, domestic violence, and other influence situations.",
      "release": "2018-03-24T20:19:59Z",
      "duration": "00:38:15",
      "explicit": false,
      "youTubeId": "BrvNIaYoA4c",
      "subjects": [
        "Cult Psychology",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BrvNIaYoA4c"
      }
    },
    {
      "id": "5e0e414b-9c54-453b-a186-35d488f82c74",
      "title": "Ready to Mine: Zen\u0027s Legitimating Mythology and Cultish Behavior",
      "description": "Ready to Mine: Zen\u0027s Legitimating Mythology and Cultish Behavior (Stuart Lachs)\n\nZen Buddhism was the first of Eastern religions to gain wide acceptance in the West post WWII. It was accepted mostly uncritically by artists and intellectuals alike. However, beginning in the 1970’s, the most prominent Zen groups in America were wracked by scandal. In spite of these repetitive scandals caused by the sexual abuse of students by their supposedly enlightened Zen masters, Zen followers and academics have refused to associate the phrase “cultish behavior” to these developments. This was not the case with a range of Christian oriented groups or with Asian teachers associated with other traditions or a variety of other groups, though the Zen scandals mirrored these groups. This paper will show how Zen’s legitimating story and mythic history lays the ground work for authoritarian inclined charismatic leaders - titled Zen master or rosh i- to draw his followers into a world dependent on obedience, his approval and with an ethical frame dependent on the master’s self serving understanding. Though Zen presents its idealized master as being fully in the world, spontaneous, unattached, a state in which one is internally firm and free while remaining perceptually competent in the world, this has hardly been the case. This is not an abstract conjecture as the paper will mention a number of examples of Zen masters, both Eastern and Western and their followers that displayed cultish behavior, while highlighting one case in particular. It is by explaining the mythic and idealized legitimating story of Zen that helps followers make sense of their lives and earlier choices when these groups implode. After all, the Zen mythology of the super human Zen master was developed over hundreds of years which makes it hard to counter for individuals breaking with a group when the Zen master’s great attainment is shown to be wishful thinking.",
      "release": "2018-02-25T03:04:27Z",
      "duration": "00:29:20",
      "explicit": false,
      "youTubeId": "uvzpeX9EdQM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uvzpeX9EdQM"
      }
    },
    {
      "id": "89877dad-46a3-49eb-b25d-7ff860923f13",
      "title": "Interview with Professor Roger Griffin",
      "description": "Interview with Professor Roger Griffin by Oliver Smith\n\nNote to reader: An edited transcript of this interview--edited by Prof Griffin--can be found here:\nhttps://drive.google.com/file/d/1wtF8_5sLC9Yf9C4IREn5i94t7baizIRj/view\n\nProfessor Roger Griffin is one of the world’s foremost experts on the socio-historical and ideological dynamics of fascism, as well as the relationship of various forms of fanaticism, and in particular contemporary terrorism, to Modernity. He has made a number of contributions to a humanistic understanding of terrorist radicalisation and the identification of the processes involved in de-radicalisation. Professor Griffin wrote a book called Terrorist’s Creed, published in 2012, which outlines a lot of his thinking on this subject; Oliver Smith asked him about the relevance of cults to terrorist groups, when considered as devices for achieving meaning, in particular.\n\nSome useful links:\nProf Griffin staff profile, Oxford Brookes: https://www.brookes.ac.uk/hpc/staff-and-students/academic-staff/?wid=academic-staff\u0026op=full\u0026uid=p0054581\n\u0027Terrorist\u0027s Creed: Fanatical violence and the human need for meaning\u0027, book: http://www.palgrave.com/us/book/9780230241299\n\u0027The role of heroic doubling in ideologically motivated state and terrorist violence\u0027, paper: http://www.tandfonline.com/doi/abs/10.1080/09540261.2017.1343528",
      "release": "2018-01-05T19:46:31Z",
      "duration": "00:53:58",
      "explicit": false,
      "youTubeId": "dNVKEGZVkFk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dNVKEGZVkFk"
      }
    },
    {
      "id": "52e552b4-b46d-49ac-9855-58a75b859906",
      "title": "Interview with Dr. Florence Gaub",
      "description": "Interview with Dr. Florence Gaub by Oliver Smith\n\nDr Florence Gaub is a deputy director at the European Union Institute for Security Studies where she heads the Middle East and North Africa programme. In her work, she focuses on conflict, strategy and security, with particular emphasis on Iraq, Lebanon and Libya; she also works on Arab military forces more generally, conflict structures and geostrategic dimensions of the Arab region. Dr Gaub wrote a paper called, ‘The Cult of ISIS’ which was published in Survival: Global Politics and Strategy in early 2016. Oliver Smith asked Dr Gaub about the links that can be made between cults and terrorist groups, and the strategic implications of these links.\n\nSome useful links:\nDr Gaub, twitter page: https://twitter.com/FlorenceGaub\nDr Gaub staff profile, EUISS: https://www.iss.europa.eu/author/florence-gaub\n\u0027The Cult of ISIS\u0027, paper: http://www.tandfonline.com/doi/full/10.1080/00396338.2016.1142142\nTranscript of Interview: \nhttps://drive.google.com/file/d/13ZbkUqYbSZB7QckZd1mENMMkCXGyvmnK/view?usp=sharing",
      "release": "2017-12-18T15:59:16Z",
      "duration": "00:48:56",
      "explicit": false,
      "youTubeId": "laZw7nvU9AU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=laZw7nvU9AU"
      }
    },
    {
      "id": "ec71b59d-6843-4287-a703-86693f60bc2a",
      "title": "Sexual/Romantic Intimacy: Challenges for People Raised in a Cult",
      "description": "Sexual/Romantic Intimacy: Challenges for People Raised in a Cult (Sara Waters)\n\nThis talk is an introduction to the ways that cult dynamics can negatively impact the normal sexual development of children. Issues include the effects of institutionalized sexual coercion, hypersexuality and/or sexual repression. Psychological abuse related to sexuality will be discussed, both in terms of sexual and intimacy issues while in the group, and after a person leaves the group. Strategies are offered for developing beneficial attitudes and behaviors related to sexuality and intimacy as a part of healing from cult involvement.",
      "release": "2017-12-16T01:43:16Z",
      "duration": "00:25:40",
      "explicit": false,
      "youTubeId": "EcO-_Js8v6s",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EcO-_Js8v6s"
      }
    },
    {
      "id": "a13b765a-2eac-4321-898a-4fb54d1c7318",
      "title": "Brainwashing - Scientific Concept or Mere Label",
      "description": "Brainwashing - Scientific Concept or Mere Label (Dr. Benjamin Zablocki; Daniel Shaw)\n\nBrainwashing is not an easy concept to pin down. For decades it has been the most controversial of all words in the vocabulary of those who try to understand cults. Many scholars even doubt whether something called “brainwashing” should be spoken of at all, regarding it as nothing more than an insulting label used to scare people about the activities of socially unpopular groups. On the contrary, I’m going to argue here tonight that “brainwashing” is not only a valid scientific concept but an essential one if we are to have any hope of understanding cults and helping people recover from cults. For a complete understanding of brainwashing we should try to understand three things: (1) what precisely brainwashing is; (2) how it works; and (3) how victims of brainwashing may be cured. Because the concept has been so misunderstood, I’m going to focus here mainly on defining what brainwashing is (and equally important what it is not). If there is time, I will also discuss what we know about how it works and how its harmful effects can be undone. For those interested, more on these topics can be found on my website: benzablocki.net and on my Facebook page “Benjamin Zablocki.”",
      "release": "2017-10-29T19:05:44Z",
      "duration": "00:29:15",
      "explicit": false,
      "youTubeId": "i4JngQ4sWrI",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=i4JngQ4sWrI"
      }
    },
    {
      "id": "f25f2f27-3f4e-4ddb-9f03-4a21b8931574",
      "title": "On Being Born and Raised in a High-Demand Group",
      "description": "On Being Born and Raised in a High-Demand Group (Jill Mytton)\n\nPurpose: The purpose of this paper is to stimulate awareness and discussion of the impact on child development of being raised in a high-demand group. Background: Influences from parents, teachers and other sources that promote and facilitate normal childhood development are important aspects of the early years of an individual’s life. Despite an increase in research in the cultic studies field there is still relatively little literature regarding the impact on a child’s development of being born and raised in a cultic group. Using a specific example of such a group, namely the Exclusive Brethren, this paper will explore the experiences of and impact on children being raised in high-demand groups Key points: The paper is based on an informal thematic analysis of descriptions and stories provided by former members via email and social media. Like many similar groups, the brethren exert considerable control over their members based on their doctrine of “separation from evil,” a doctrine many consider to be taken to extremes. Now that their children only attend Brethren schools, all influence from sources outside the group that could offer alternative perspectives or narratives are absent. A number of important themes have emerged including the experience of fear and guilt, the impact of such a closed separate life on social development, the lack of life skills that inhibits them if they leave, and the common experience of dissonance as the child seeks to resolve the messages from different environments and narratives. The paper will also present findings from a quantitative study that suggests that control imposed in childhood might resonate in adult life through long term psychological sequelae Conclusions: I will argue that control imposed in childhood may affect various aspects of child development and may later impact on adult mental health.",
      "release": "2016-12-22T19:27:50Z",
      "duration": "00:41:24",
      "explicit": false,
      "youTubeId": "GsBSZqJNj5Y",
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GsBSZqJNj5Y"
      }
    },
    {
      "id": "144578df-fc4f-42a9-826f-74c9960b6802",
      "title": "First Generation Parents and Second Generation Children",
      "description": "First Generation Parents and Second Generation Children (Lorna Goldberg)\n\nOne of the most painful aspects of the cult experience is the undermining of the natural bond between parents who are in cults and their children. This presentation will explore the numerous techniques that cult leaders use to diminish the empathic connection between 37 parents and their children. The presenter also will discuss the powerful feelings that emerge when exiting a cult. How can those who leave the cult better deal with potentially crushing emotions? Often there is intense guilt on the part of the parents. On the other hand, there is often intense anger on the part of the second-generation adults. These emotions can be so overwhelming that former cult members can become unable to move towards a more satisfactory life. This presentation will contend that these post-cult feelings not only are the result of facing the reality of the cult experience; but, also, are a legacy of identification with the cult leader’s punitive and uncompassionate attitude, which results in a harsh conscience for cult members. The presenter will provide examples from her clinical work, from the support group that she facilitates with Bill Goldberg, from workshops with first generation parents, and from ICSA workshops with second-generation former cult members. All case material will be disguised.",
      "release": "2016-11-11T21:18:58Z",
      "duration": "00:48:59",
      "explicit": false,
      "youTubeId": "qDqMWtT1oCQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qDqMWtT1oCQ"
      }
    },
    {
      "id": "6807f7c6-037a-4e5c-aa42-9223952b156a",
      "title": "Truth From the Mouths of Babes",
      "description": "Truth From the Mouths of Babes (Eva Mackey Meyrat)\n\nAs a little girl raised in a guru cult, Eva Mackey Meyrat came to the French Parc Asterix, but saw little of the park and enjoyed none of it because her job was to serve the guru’s grandson. As an adult, she took her own little children to the same park. They enjoyed themselves immensely but couldn’t understand why their mother hadn’t enjoyed herself when she came to the park as a little girl.  The children’s questions and “theories” about why their mom’s childhood experience was so different from theirs poignantly illuminates the stark differences between cults and normal life. From this story grew a talk about the unique challenges second generation adult former cult members face when raising their own children. Truth indeed does come from the mouths of babes.",
      "release": "2016-10-22T18:22:03Z",
      "duration": "01:01:31",
      "explicit": false,
      "youTubeId": "g5UGO9bNJkg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g5UGO9bNJkg"
      }
    },
    {
      "id": "23edacc4-c2f8-41b2-a419-542cce566059",
      "title": "Antisocial Personality Disorder in Cult Leaders, Dependent Personality Disorder in Cult Members",
      "description": "Antisocial Personality Disorder in Cult Leaders, Dependent Personality Disorder in Cult Members (John Burke, Ph.D.)\n\nA number of studies have found evidence of antisocial acts and behaviors by cult leaders toward cult followers (Martin, Langone, Dole and Wiltrout, 1992; Tobias, \u0026 Lalich, 1994; West \u0026 Martin, 1999; and Kent, 2004). Each of these studies offers well-documented evidence of antisocial acts and behaviors by cult leaders toward cult members. These published accounts, as well as previously unpublished author research, are used to develop an explanatory model of the personality organization of the cult leader. Additionally, the emergence of dependent personality disorder and other psychological sequelae among cult members is investigated. Diagnostic criteria and descriptions describing antisocial personality disorder as published in Diagnostic and Statistical Manual, 4th Edition (1994) can be employed as part of the characterization of the personality organization of the cult leader. The author has participated as a clinical team member in the diagnosis of personality disorders for juvenile offenders in the California Juvenile Probation Department and for juvenile and adult offenders in the Colorado Department of Corrections. A number of peer-reviewed studies including studies by Martin, Langone, Dole, and Wiltrout, (1992); Tobias \u0026 Lalich, (1994); West \u0026 Martin, (1999); and Kent (2004), present findings from clinical interviews of ex-cult members, which report many different antisocial acts and behaviors by cult leaders. These accounts detail numerous instances of personal mistreatment, psychological intimidation, and physical and sexual abuse of cult members by cult leaders, and offer credible evidence for the hypothesis that cult leaders may meet minimum DSM-IV criteria for diagnosis of antisocial personality disorder (ASPD).",
      "release": "2016-10-19T17:38:41Z",
      "duration": "00:41:28",
      "explicit": false,
      "youTubeId": "hdU4TdHbw3c",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hdU4TdHbw3c"
      }
    },
    {
      "id": "a36def23-34e0-408a-9702-b8963fd5df04",
      "title": "Overview of Cultic Studies Research",
      "description": "Overview of Cultic Studies Research (Rod Dubrow-Marshall)\n\nIn this session, Dr. Dubrow-Marshall will explore the key\nquestions asked by cultic studies researchers, the types\nof research conducted, methodological issues, and the\ndominant theories in the field.",
      "release": "2016-09-30T23:28:21Z",
      "duration": "00:51:55",
      "explicit": false,
      "youTubeId": "f-kR4WyWbYo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f-kR4WyWbYo"
      }
    },
    {
      "id": "d11b5865-bf52-4fc3-ac21-001f74be5922",
      "title": "Mental Health Issues in Cult Related Interventions",
      "description": "Mental Health Issues in Cult Related Interventions (Steve Eichel, Bill Goldberg, Steve Hassan, Arnold Markowitz, Daniel Shaw)\n\nIn this special event, cult-intervention specialists and mental-health professionals will discuss their roles in helping families and former members—in particular, how they work together and how they differ.",
      "release": "2016-09-10T17:43:29Z",
      "duration": "01:25:31",
      "explicit": false,
      "youTubeId": "YNtKYyYdVmc",
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YNtKYyYdVmc"
      }
    },
    {
      "id": "3a4c9b5d-81c4-4eab-97e1-5603ebbc4ca5",
      "title": "Listening to the Still Small Voice: Reclaiming the Self after Leaving Religious Totalistic Groups",
      "description": "Listening to the still small voice: Reclaiming the self after leaving religious totalistic groups (Catherine De Boer) \n\nMemberships in social groups are central to one’s self- understandings and can provide individuals with purpose, meaning, and feelings of competence and value. At times, these memberships also can test and potentially compromise one’s self-understandings. In either case, disengagement from a social group has identity implications, and “finding,” “(re)claiming” or \u0027discovering” one’s self is a crucial component of a successful leaving. Using disengagement from religious totalistic groups as its focus, an argument will be made that some individuals leaving such groups not only face identity challenges typical of other socialgroup leavings, but in addition may also need to cope with the impacts of mind control, trauma, abuse, and the ego destruction they experienced in the group. These unique challenges can make achievement of identity congruence postmembership especially difficult. This presentation will highlight findings from two research studies that investigated the identity implications of disengagement from a variety of social groups. The first study (2007) investigated voluntary disengagement; a current study is investigating forced leavings. These qualitative studies using a narrative analysis had as their central aims (a) to discover whether a disengagement process exists, and if so, to discover the defining characteristics and phenomenological aspects; (b) to describe the shifts in identity that accompany the process; and (c) to consider clinical or treatment implications. This presentation will make the following claims: (a) that social group disengagement is a definable social process, and what we know about this broader phenomenon bears relevance to exiting religious totalistic groups; (b) the degree to which the associated identity-based challenges are acknowledged and addressed could determine the trajectory of the individual’s life, postgroup membership; and (c) a good 33 outcome includes the achievement of identity congruence and personal agency. Specific treatment strategies and practice implications will be discussed.",
      "release": "2016-08-24T15:31:48Z",
      "duration": "00:42:38",
      "explicit": false,
      "youTubeId": "eeIDgDw8A5k",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eeIDgDw8A5k"
      }
    },
    {
      "id": "ba1cac76-da9c-4fd3-95a6-df2d0d69eafc",
      "title": "Inner Experience and Conversion",
      "description": "Inner Experience and Conversion (Michael D. Langone, Patrick Ryan, Joseph Kelly)\n\nCognitive therapy is similar to religious conversion in that both are associated with changes in a person\u0027s fundamental assumptions about the world, self, and others. These fundamental assumptions derive in large part from experience, rather than rational deliberation. In some conversions powerful inner experiences, whether manipulated (\u0022outer generated\u0022) or not (\u0022inner generated\u0022), may cause a person to adopt new fundamental assumptions. Sometimes, a new set of experiences can cause a convert to reject the new assumptions and leave the group. The resulting disillusionment may cause serious adjustment problems. The impact and implications of inner experiences should be considered when trying to help former group members.",
      "release": "2016-08-17T17:09:46Z",
      "duration": "01:20:40",
      "explicit": false,
      "youTubeId": "l-nYaiBVkHE",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=l-nYaiBVkHE"
      }
    },
    {
      "id": "c46cb79a-ea5d-43e4-a4f7-3acc649d2a9c",
      "title": "Luncheon Talk: Paul Martin Memorial Lecture",
      "description": "Luncheon Talk: Paul Martin Memorial Lecture (Rod Dubrow-Marshall, Ph.D.)\n\nInaugural Lecture, NY 2010\n\nThe Paul R Martin Memorial Lecture honors and celebrates the work of Paul Martin by highlighting in accessible terms and for an inter-disciplinary audience the key advances in research on cults and cultic abuse and the successful treatment of the victims of this abuse. \n\nIn the inaugural Paul R Martin Memorial Lecture, Rod Dubrow-Marshall will summate on the body of research that Paul Martin led and co-ordinated in his lifetime as the Director of the Wellspring Retreat and Resource Center in Ohio. This will include a summary of research undertaken by Paul Martin and a number of colleagues on the Wellspring treatment approach and outcomes, the identification of a distinct pattern of harm arising from cults and the legal and policy implications of these findings. The lecture will also attempt to summarise some of the possible next steps in taking forward the research that Paul Martin and others have pioneered out of Wellspring.",
      "release": "2016-08-15T15:51:50Z",
      "duration": "00:29:44",
      "explicit": false,
      "youTubeId": "qQLoGGmcZxI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qQLoGGmcZxI"
      }
    },
    {
      "id": "f95ae50c-fb56-4c52-a087-1948a5be483f",
      "title": "Marriage After the Cult",
      "description": "Marriage After the Cult (Lorna Goldberg, MSW)\n\nMarried life within a cult can impact on former cult members’ post-cult experiences. Among the factors that may influence the nature and severity of problems that may arise are: the behavior of the cult leader, transference, and defense mechanisms of projection and projective identification. Although these processes are common to most marriages, they take on a particular hue in cult situations.",
      "release": "2016-08-09T14:23:01Z",
      "duration": "00:38:53",
      "explicit": false,
      "youTubeId": "ArZiuRPwCp4",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ArZiuRPwCp4"
      }
    },
    {
      "id": "4d9c0f23-c264-4ea7-a3fd-bf3500974cd3",
      "title": "Traumatic Narcissism: The Psychology of Cult Leaders",
      "description": "Traumatic Narcissism: The Psychology of Cult Leaders (Daniel Shaw)\n\nIn this talk, which was a plenary presentation at ICSA’s 2015 Santa Fe Conference, Daniel Shaw presents some of the ideas he has developed about the leaders of cultic groups, people he describes as traumatizing narcissists, and the relational system such people create.  He draws from clinical research, psychoanalytic theories, and personal experience as a former member of a high-demand group for more than ten years. Dan’s ideas are developed in his book, Traumatic Narcissism: Relational Systems of Subjugation.",
      "release": "2015-12-24T19:28:10Z",
      "duration": "01:18:01",
      "explicit": false,
      "youTubeId": "TISvFOq-kMw",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TISvFOq-kMw"
      }
    },
    {
      "id": "8c06e355-d4c8-4962-85ae-bcaca12e4f70",
      "title": "A Practical Approach for Law Enforcement when Dealing with Cultic Groups",
      "description": "A Practical Approach for Law Enforcement when Dealing with Cultic Groups (Mark Roggeman)\n\nMany people who have had an experience with cults because a relative became involved have been disillusioned when they have asked law enforcement for help.  The response they usually get is that there is not much that can be done unless there is illegal activity.  The police concern is that they may be interfering with the freedom of religion.  In the present day, police departments are successfully using problem-solving models through the Community Policing model.  This model can also be implemented when a questionable group comes to the attention of local police departments.  A simple approach that officers can take is to visit a group and let them know who they are and that they are there to assist them.  They can let the group know that the department is there to protect them from those who might dislike the group or who possibly threaten to cause harm.  The connection that results could possibly cause authorities to become aware of the group’s behavior, so that the authorities may be able to observe any changes that might occur relative to the group that could signal a violation of the law or even harm to the members. Law enforcement, both local and federal, most often become involved with cults after a tragedy occurs, such as suicide, involvement in financial fraud, or a case that affects children through neglect or abuse, including sexual violations.  Most of these groups probably will never do anything that attracts the attention of law enforcement.  The problem is that illegal activities that are not known to anyone outside the group do go on because of the group’s isolation from the rest of society.  This kind of situation is one in which officers become effective in gathering intelligence by getting to know the group.  The result is that officers may become aware of illegal activities.  I personally had members of a group in southern Colorado reach out to me because they did not know anyone one else outside the group.  Through this connection, authorities learned that children had died, they believe because medicine was denied as a result of the group’s belief that to take medicine reflected a lack of faith. An article on cultic groups in the FBI Law Enforcement Bulletin of September 2000 stated accurately that the potential for violence on behalf of members of biblically driven cults is determined almost exclusively by the whims of the cult leader.  Therefore, effective intelligence and analysis of such cults requires an extensive understanding of the cult leader. To address the concern of authorities about violating the protection of individuals’ freedom of religion, officers need to be concerned only with behavior that may be harmful to people both inside and outside the group.  Granted, the beliefs may be the cause of the harmful behavior, but only the behavior is the cause for concern.",
      "release": "2015-12-15T18:05:20Z",
      "duration": "00:42:18",
      "explicit": false,
      "youTubeId": "JbVBdBB1vPA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JbVBdBB1vPA"
      }
    },
    {
      "id": "3b8d9815-e410-4980-9836-587f12b52459",
      "title": "Saved by our Son",
      "description": "Saved by our Son (Russell H. Bradshaw)\n\nMost of the literature on childrenin high-demand groups focuses on how distraught parents and desperate families attempt to get young people out of a cultic group. This case study, set in both Sweden and the United States tells the opposite story. An adolescent, resisting the belief system of parents and the norms of the spiritual group he was raised in, revolted and struck out on his own path. He quickly found out that the leader was in fact, not the celibate and “realized” guru he claimed to be, but a deceptive and manipulative narcissist. In the midst of his own alienation and suffering, he nevertheless struggled for several years trying to convince his “true-believer” parents of the hypocritical behavior of the leader. He also had to contend with the morally corrupt rationalizations, denials, and double-standards adopted by the inner circle of first-class disciples and other followers who tried to destroy his credibility, his career, and his relationships. Finally, amidst death threats, police complaints, and an intense “internet war” that erupted when he created a web-site, which included first-person accounts of sexual abuse by several young women, he managed to convince his parents and drag them out of the group -after almost a quarter of a century of belief and devoted service to their Guru.Central to this case study is the psychodynamic theory of Erik Erikson concerning the adolescent stage of development labeled, “identity versus role-confusion.” The specific identity crisis at this stage is the necessity of choosing an identitystatus and the use of resistance behavior to develop this identity. In Erikson’s theories, adolescent revolt, turmoil, and resistance are seen as positive attributes that are necessary to the positive development of personality",
      "release": "2015-10-31T17:56:04Z",
      "duration": "00:34:13",
      "explicit": false,
      "youTubeId": "REiMO3e4viE",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=REiMO3e4viE"
      }
    },
    {
      "id": "76815257-af0a-44d4-96ef-5d705168205c",
      "title": "Self-Care Issues for Families and Mental Health Professionals",
      "description": "Self care Issues for Families and Mental Health Professionals (Linda Dubrow-Marshall)\n\nThis workshop is intended to help mental health professionals who are working with individuals and families who have been affected by cultic groups or abusive relationships. Most ethical codes for mental health professionals include a commitment to self-care, and to ensure that they do not work in a way that becomes detrimental to their health or well-being. Yet mental health professionals who work within the cultic field are subjected to intense pressures and risks in their professional practice. For example, they may experience stress and may suffer vicarious traumatisation. This workshop will help them to develop a self-care plan that goes beyond ticking the boxes of their professional codes.",
      "release": "2015-10-12T16:57:21Z",
      "duration": "01:09:32",
      "explicit": false,
      "youTubeId": "nGzsDpTUF0k",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nGzsDpTUF0k"
      }
    },
    {
      "id": "0598a441-f7d0-4f12-981c-6ee1a40ac8f5",
      "title": "Co-Leading an Ex Member Support Group",
      "description": "Co-Leading an Ex Member Support Group (William Goldberg, MSW, PsyA)\n\nIn this video William Goldberg, MSW, PsyA, describes the rationale and methods that he and his wife Lorna have used in their support group for former cultic group members.  Having run a monthly support group since the late 1970s, their experience is long and deep.  This video should be useful to those interested in facilitating or participating in a support group.",
      "release": "2015-09-29T20:06:55Z",
      "duration": "01:21:34",
      "explicit": false,
      "youTubeId": "84dOdMNR2wA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=84dOdMNR2wA"
      }
    },
    {
      "id": "273f478b-5ad1-4252-bb09-d53563695a2f",
      "title": "Conversion and Worldviews",
      "description": "Conversion and Worldviews (Michael D. Langone, Ph.D., William Goldberg, M.S.W., L.C.S.W.; Patrick Ryan)\n\nThis session will examine conversion in general and conversion to cultic belief systems specifically. Conversion will be conceptualized as a shift in worldview that results in a person’s looking at self, world, and relationships in different ways. The challenge for families and friends of people who have experienced cultic conversions is to understand the convert’s new worldview and to communicate with him/her accordingly. Such “cross-cultural communication” is vital to enhancing the relationship with the cult-involved loved one and to finding ways to lessen conflict.",
      "release": "2015-09-24T15:18:46Z",
      "duration": "01:29:33",
      "explicit": false,
      "youTubeId": "n6aGVB3np3E",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n6aGVB3np3E"
      }
    },
    {
      "id": "d487791b-d027-41d0-ad39-813a88af7043",
      "title": "Four Approaches to Helping Families",
      "description": "Four Approaches to Helping Families (Lois Svoboda, M.D., LMFT, Moderator, David Clark; Joseph Szimhart; Joseph Kelly/Patrick Ryan; Steve Hassan, M.Ed., LMHC, NCC)\n\nEach presenter has spent at least 20 years helping families concerned about a loved one involved in a cultic group. Yet they represent four distinct approaches to working with families (Kelly and Ryan work as a team). In this session, each of the four approaches will be briefly described, and then the presenters will answer questions from the audience.",
      "release": "2015-08-10T12:58:16Z",
      "duration": "01:27:06",
      "explicit": false,
      "youTubeId": "f-OUSx3V_A0",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f-OUSx3V_A0"
      }
    },
    {
      "id": "8ed23807-5c31-4ed9-86b0-1263f0f07bdc",
      "title": "Getting Therapy After a Group Involvement",
      "description": "Rosanne Henry, a psychotherapist from Colorado, and former cult member, has co-led ICSA\u0027s Colorado recovery workshops for seven years. She will talk about issues former members should consider when seeking therapy. Because so few therapists understand cults, she will focus on how ex-members can locate therapists who are most likely to be helpful, how ex-members can teach their therapists about cult issues, and how cult experts can be included in their treatment team.",
      "release": "2015-07-25T18:28:52Z",
      "duration": "01:15:28",
      "explicit": false,
      "youTubeId": "Rp4mnf5G6Nc",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Rp4mnf5G6Nc"
      }
    },
    {
      "id": "3222e405-6831-4b81-bf91-6b56c372deb5",
      "title": "Anger, Rage, Pseudo Personality and Cults",
      "description": "Anger, Rage, and Relationship (Sue Parker Hall)\nCult Pseudo-Personality (Gillie Jenkinson)\n\nIn this session Gillie Jenkinson and Sue Parker Hall will explore how theories of anger and rage (Parker Hall, 2008) and the concept of pseudo-personality (Jenkinson, 2008) interact to support ex-cult members and therapists to make meaning of a cult experience and to identify important recovery tasks. Sue will present her research around how anger and rage are different processes requiring different therapeutic responses. Gillie will outline her research on cult pseudo-personality and discuss the interaction of this with anger and rage.\n\nIt is argued that, in many cults, anger may be projected outside the group and personal anger may go underground; as a consequence, a cult member may lose the capacity to develop and protect his or her unique identity. And as a consequence of this, the cult member may become vulnerable to the persuasion and control of a thought-reform program. Alienated from one‘s organismic self, an individual introjects a compliant \u0027pseudo-personality\u0027 (Jenkinson, 2008) which overlays the pre-cult personality. When genuine emotional responses are forsaken, life experiences remain unprocessed and unintegrated, and cult members may operate from a state of cold rage, which often continues after leaving the group.\n\nThere will also be some discussion about Sue‘s ideas on ‗adult rage‘. She notes there is a difference between trauma-related and nontrauma-related rage, and she identifies the negative impact of the former and the positive impact of the latter on the aims and practice of social activism.",
      "release": "2015-07-20T20:47:22Z",
      "duration": "01:17:46",
      "explicit": false,
      "youTubeId": "fwuzrFmYdYM",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fwuzrFmYdYM"
      }
    },
    {
      "id": "475bdb13-f2bc-4c82-9c07-383f20f5f21a",
      "title": "Why Attorneys Do Not Accept Cult Related Litigation",
      "description": "Why Attorneys do not Accept Cult Related Litigation (Peter Georgiades)\n\nDuring the 1990s Peter Georgiades was one of most successful attorneys in lawsuits against cultic groups.  He won many cases.  Yet his activity in the cultic area diminished significantly.  At the ICSA 2004 conference in Atlanta in 2004, Mr. Georgiades explained why he and other attorneys are reluctant to take on cases related to cultic groups.  His explanation is candid and illuminating.",
      "release": "2015-05-16T18:36:24Z",
      "duration": "01:24:08",
      "explicit": false,
      "youTubeId": "tTO5swNZokk",
      "subjects": [
        "Legislation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tTO5swNZokk"
      }
    },
    {
      "id": "59d780e8-5e18-4711-aa8f-9d81c9c335a9",
      "title": "Reflections on Being a \u0022Blessed Child\u0022 in the Unification Church",
      "description": "Reflections on Being a \u0022Blessed Child\u0022 in the Unification Church (Donna Collins)\n\nDonna Collins, daughter of the founders of the Unification Church in England, was the first “blessed child” born in the West.  She recounts her experiences growing up in this group and the factors that led to her departure.",
      "release": "2015-05-06T19:52:49Z",
      "duration": "00:44:40",
      "explicit": false,
      "youTubeId": "dMKksp7fKOA",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dMKksp7fKOA"
      }
    },
    {
      "id": "7a876229-e8c5-4146-844c-23727b19d4e5",
      "title": "Critical Thinking Skills for Former Cult Members",
      "description": "Critical Thinking Skills for Former Cult Members (Doug Duncan, M.S., L.P.C.; Wendy Duncan, M.A., L.B.S.W.)\n\nFormer cult members often ask themselves, \u0022How could I have been duped so easily?\u0022 While it is certainly the case that cult recruiters make manipulative, emotional appeals, bypassing the prospective member\u0027s reason and informed consent, there are certain learned cognitive skills we can all develop that help to make us more resistant to such manipulation. What are those skills? How can I develop my reason and intellectual discernment to make it more difficult for someone to sell me a bill of goods? What can I teach my children so that they will be less subject to the dark allure of a seductive cult recruiter? Drawing from some of the basic texts in critical thinking, Doug and Wendy Duncan will show why the acquisition of critical thinking skills is helpful in a variety of contexts. Obviously, one is less likely to be drawn into a cult when one can quickly recognize a manipulative, emotional appeal, but these skills have a broad utility in many areas of modern life, such as analysis of slanted news reports, identifying deceptive sales techniques, seeing through unethical public figures, and even in facilitating informed participation in our civic institutions. Indeed, it is hard to think of any other skill set that has so many important applications as does critical thinking. Doug and Wendy will give a quick overview of critical thinking in history, identify some of the basic skills, and then have some participatory exercises that will allow for experiential learning by the workshop participants. Learning these skills cannot only help former members to keep from being re-victimized by another high-demand group, it can also facilitate their recovery process by increasing their sense of empowerment. Since the topic is so broad and cannot be exhaustively covered in the short time available for this workshop, Doug and Wendy will have handouts with a bibliography to suggest how the participants can further develop their critical thinking skills.",
      "release": "2015-03-30T18:37:51Z",
      "duration": "00:29:33",
      "explicit": false,
      "youTubeId": "GynqJ9uOGh8",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GynqJ9uOGh8"
      }
    },
    {
      "id": "39f5b019-1c0d-493d-83de-a8bb6393fae7",
      "title": "Cults, Conversion, Science and Harm",
      "description": "Cults, Conversion, Science and Harm (Michael D. Langone) \n\nPersonal vs. social (intrinsic vs. extrinsic), sudden vs. gradual, and inner-generated vs. outer-generated aspects of conversion experience are discussed in order to illuminate the complexity and variability of conversions associated with cultic groups. Negative aspects of conversion are discussed in relationship to psychological, ethical, social, and theological concerns. The importance of differentiating these concerns and studying the varied ways in which harm manifests in cultic groups is stressed.",
      "release": "2015-03-03T22:52:23Z",
      "duration": "01:15:24",
      "explicit": false,
      "youTubeId": "WgHsoeS2GwI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WgHsoeS2GwI"
      }
    },
    {
      "id": "574672ea-a6c6-448e-aa9a-bf2b3a68ed60",
      "title": "How to Investigate Cults: Paper Trailing and Cultivating Resources",
      "description": "How to Investigate Cults: Paper Trailing and Cultivating Resources (Dennis King)\n\nDennis King discusses some of the topics covered in his book, Get the Facts on Anyone.  In the talk, he focuses on the investigative needs of former cultic group members, families, and professionals helping people adversely affected by a cultic involvement.  Among the topics he discusses are:\n \n•Biographical indexes, newspaper databases, professional and trade publications, and military and medical records--to check out people\u0027s backgrounds\n\n•Tax lien files, bankruptcy court records, and bank account records--to collect credit and financial information\n\n•Court records and case files--to research people and companies\n\n•Internet and other new on-line and CD-ROM resources--to track down information or missing persons\n\n•The use of library archives to read past publications of a political or religious cult and to gather the names of former members whom you might want to contact.",
      "release": "2015-01-31T15:52:29Z",
      "duration": "00:57:08",
      "explicit": false,
      "youTubeId": "HXrC4oo38NA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HXrC4oo38NA"
      }
    },
    {
      "id": "7ab472f1-a7bf-4c1e-aeef-714532fd5428",
      "title": "Writing Down the Pain: A Case Study of the Benefits of Writing for Cult Survivors",
      "description": "Writing Down the Pain: A Case Study of the Benefits of Writing for Cult Survivors (K. Gordon Neufeld)\n\nK. Gordon Neufeld presenting at the 2003 ICSA Annual Conference in Orange, CA.  His talked discussed the psychological benefits of writing about a cultic experience.",
      "release": "2015-01-21T01:21:54Z",
      "duration": "00:45:55",
      "explicit": false,
      "youTubeId": "J-rPLARoB9I",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J-rPLARoB9I"
      }
    },
    {
      "id": "7b1d3996-4c4f-4c3b-83a5-7842b0e5abf5",
      "title": "The Colorado Model: A Workshop for Ex-Members",
      "description": "The Colorado Model: A Workshop for Ex-Members (Carol Giambalvo; Rosanne Henry) \n\nFor the past sixteen years, ICSA has been developing a brief, time-limited, yet comprehensive group model for cult recovery, which we call the Colorado Model because it was developed and refined in that state. This model consists of weekend workshops that are open to former members of destructive cults who have applied and been screened for their compatibility for attendance. The Colorado Model differs from other workshops in its strong emphasis on psycho-education and its use of former member facilitators who are mental health professionals. The ex-member facilitator team, equipped with the important credentials of cult recovery often instills hope for those struggling with cult trauma.\n\nThe Colorado Model is similar to the Trauma Recovery and Empowerment Model (TREM). This approach uses an educational and supportive, skill-building curriculum that allows members to understand and acknowledge the impact of abuse while focusing their energies on developing techniques for mastery and enhancing     their existing strengths for coping with their current life events (Harris \u0026 Fallot, 2002). The Colorado Model adapts this approach to unique workshops that address the needs of former cult members.",
      "release": "2015-01-17T19:09:13Z",
      "duration": "01:19:42",
      "explicit": false,
      "youTubeId": "fynvy6tPN3E",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fynvy6tPN3E"
      }
    },
    {
      "id": "a1e9bce3-2c22-4297-9770-b6197d6f3579",
      "title": "Problems Ex-Members and Families Face: An Overview",
      "description": "Problems Ex-Members and Families Face: An Overview (Lorna Goldberg, M.S.W., L.C.S.W.; William Goldberg, M.S.W., L.C.S.W.)\n\nThis session will provide an overview of the kinds of problems former group members and families with involved loved ones confront. The speakers will first discuss those aspects of cultic environments and personal vulnerability that places individuals, families, and groups at risk of causing conflict and concern. The kinds of experiences influence their post-group problem picture will be explored , as will ways in which former members typically deal with post-group issues. Lastly, the perspectives of families will be examined, with a focus on how families can help current and former group members. Special issues, such as children and divorce, will also be discussed.",
      "release": "2015-01-09T19:33:13Z",
      "duration": "01:58:47",
      "explicit": false,
      "youTubeId": "Q_tloTtKhmE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q_tloTtKhmE"
      }
    },
    {
      "id": "df8afe9c-768b-47fa-b61b-d5055ac0a58c",
      "title": "Supporting Human Rights By Testifying Against Human Wrongs",
      "description": "Supporting Human Rights By Testifying Against Human Wrongs (Alal Scheflin; Rod Dubrow-Marshall)\n2014 \n\nAlan Scheflin  (Paper delivered by Professor Rod Dubrow-Marshall because Professor Scheflin had to leave the conference early on urgent personal business.) Experts seeking to testify in court about extreme-influence processes practiced by clever influencers against susceptible and vulnerable influencees have encountered difficulty from some judges who have hesitated or refused to hear testimony about brainwashing, mind control, and thought reform on the grounds that these concepts lack scientific validity. This paper suggests that the legal concept of undue influence be used as a vehicle for such testimony. The paper also provides a Social Influence Model (SIM) to assist an expert in presenting the extensive science of social influence to judges and jurors.",
      "release": "2014-12-20T16:33:32Z",
      "duration": "00:38:09",
      "explicit": false,
      "youTubeId": "ye5qv55S6ig",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ye5qv55S6ig"
      }
    },
    {
      "id": "adb7836c-c986-45e8-ada8-066ee34b709a",
      "title": "Individual Variations in a High Control Group",
      "description": "Individual Variations in a High Control Group (Maureen Griffo)\n2004\n\nMaureen Griffo, an ex-member of The Church of Bible Understanding as well as several fringe churches, is a board member of reFOCUS and also was one of four collaborators who established the Leo J. Ryan Education Foundation. Ms. Griffo had moderated an online chat/support group for former members for many years. Currently she is spearheading the ICSA New York City Educational Initiative. She has a Master\u0027s in Sociology with a focus on cultic practices as well as a Master\u0027s in Education with a focus on special education. She works with children with severe emotional and developmental disabilities in New York City.",
      "release": "2014-12-14T19:09:17Z",
      "duration": "00:35:12",
      "explicit": false,
      "youTubeId": "CTnOHUZ1Q8A",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CTnOHUZ1Q8A"
      }
    },
    {
      "id": "cc5150d5-462c-41b5-8d2b-cba1009355b5",
      "title": "Spiritual Manipulation in Pseudo-Christian Cults: A Panel Discussion with Former Members",
      "description": "Spiritual manipulation in pseudo-Christian cults: A panel discussion with former members (Wendy Duncan; Doug Duncan; Molly Koshatka)\n\nReligious cults depend on fear and intimidation to maintain their hold over group members.  In order to manipulate followers, the cult leader is revered and group members believe that God has specifically chosen him and given him absolute authority.  The cult leader’s claim that God has imparted a unique and special revelation justifies his existence as the leader and his right to exercise control.  Members of pseudo-Christian cults are taught to accept the cult leader’s authority as divinely mandated.  Any doubt or questions are quickly extinguished by the leader or the group culture that dismisses external influences that contradict the groups stated mission or vision.  Through spiritual manipulation, the leader is able to obtain control over the devotees.  The tactics of manipulation include the use of guilt, peer pressure, intimidation, ridicule, and fear.  Over time, the cult member is deluged with fears of thinking independently, making wrong decisions, losing salvation, losing his relationship with God, experiencing extreme calamity if he leaves the group, and numerous other horrors.\nA panel discussion of former members of pseudo-Christian cults will focus on the spiritually manipulative techniques employed by their former cults.  The panel will focus on four primary areas:\n\nManipulative techniques used by leader(s)\nThe role of fear in pseudo-Christian cults\nObstacles in transitioning out of a spiritually manipulative group/religion\nReconnecting with faith after cult affiliation",
      "release": "2014-12-08T20:01:54Z",
      "duration": "01:08:27",
      "explicit": false,
      "youTubeId": "nHX_eNaXqcA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nHX_eNaXqcA"
      }
    },
    {
      "id": "3f2b10ec-50a1-4f31-bf4a-5e5109c45173",
      "title": "Luncheon Talk: Human Rights and Cults",
      "description": "Luncheon Talk: Human Rights and Cults (Michael Langone)\n2010\n\nThis talk at ICSA’s 2010 annual conference in New York City examined some human rights implications of cultic studies, including definitions, human rights relevant to this field, sources of controversy, the misuse of power by governments and groups, and balancing conflicting rights.",
      "release": "2014-11-07T17:59:12Z",
      "duration": "00:31:35",
      "explicit": false,
      "youTubeId": "VkXyX3NRJm0",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VkXyX3NRJm0"
      }
    },
    {
      "id": "301e8b3a-5149-40f2-9d0e-b680cb3cfd8a",
      "title": "What Is A Cult and How Does It Work?",
      "description": "What Is A Cult and How Does It Work? (Margaret Singer)\n\nBy Margaret Thaler Singer, Ph.D., a clinical psychologist and emeritus adjunct professor at the University of California, Berkeley, who counseled and interviewed more than 3,000 current and former cult members, relatives and friends.   What is a Cult and How Does it Work? What are cults?  How do cults operate?  How many people are involved in cults?  What are cult leaders\u0027 goals and methods?  How do cults recruit?  What is thought reform?  Inside the group.  Development of a cult. Pseudoidentity.  Returning to the outside world.",
      "release": "2014-10-12T17:57:49Z",
      "duration": "00:58:05",
      "explicit": false,
      "youTubeId": "8bRBFhMEQFk",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8bRBFhMEQFk"
      }
    },
    {
      "id": "dabe0294-0dca-4bfb-ae03-99b2a05991e4",
      "title": "Leaving a Cult",
      "description": "Leaving a Cult (Margaret Singer) \n\nBy Margaret Thaler Singer, Ph.D., a clinical psychologist and emeritus adjunct professor at the University of California, Berkeley, who counseled and interviewed more than 3,000 current and former cult members, relatives and friends.  Leaving A Cult: Information About Exiting and Recovery for Ex-Members, Families, and Friends.  What is the family\u0027s experience like?  How cults use thought reform techniques to control people.  How cult involvement affects members.  How to help a cult member leave a group.  Why exit counseling is important.  How family members can help with the recovery process.",
      "release": "2014-10-03T16:31:48Z",
      "duration": "00:54:03",
      "explicit": false,
      "youTubeId": "UO0vPYd9Txw",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UO0vPYd9Txw"
      }
    },
    {
      "id": "1c928c81-f5fa-4e15-970a-ed044c5a5872",
      "title": "Trauma Conference Part 4",
      "description": "Making Sense of Post-Cult Trauma and the Relational System of the Traumatizing Narcissist, organized jointly by ICSA and the National Institute for the Psychotherapies. The conference took place on October 13, 2012.",
      "release": "2014-09-28T17:52:06Z",
      "duration": "00:22:27",
      "explicit": false,
      "youTubeId": "X3UowtrADys",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=X3UowtrADys"
      }
    },
    {
      "id": "1539d1f4-17f3-4bb0-8201-e8c7a4f9277e",
      "title": "Trauma Conference Part 3",
      "description": "Making Sense of Post-Cult Trauma and the Relational System of the Traumatizing Narcissist, organized jointly by ICSA and the National Institute for the Psychotherapies. The conference took place on October 13, 2012.",
      "release": "2014-09-28T15:45:25Z",
      "duration": "00:42:40",
      "explicit": false,
      "youTubeId": "1EgaO1j9WIo",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1EgaO1j9WIo"
      }
    },
    {
      "id": "0509878f-53f7-4ae0-8df6-e1e3ad5a3d07",
      "title": "Trauma Conference Part 1",
      "description": "Making Sense of Post-Cult Trauma and the Relational System of the Traumatizing Narcissist, organized jointly by ICSA and the National Institute for the Psychotherapies. The conference took place on October 13, 2012.",
      "release": "2014-09-24T18:27:20Z",
      "duration": "00:44:45",
      "explicit": false,
      "youTubeId": "1zdH5RqA-X0",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1zdH5RqA-X0"
      }
    },
    {
      "id": "6d89000d-390d-470f-a2d4-22b79b42a558",
      "title": "How to Set Up and Facilitate a Support Group",
      "description": "How to Set Up and Facilitate a Support Group (William and Lorna Goldberg) \n\nICSA Conference DVD with William \u0026 Lorna Goldberg.",
      "release": "2014-09-21T16:26:16Z",
      "duration": "01:26:31",
      "explicit": false,
      "youTubeId": "G-BOV1QBANU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G-BOV1QBANU"
      }
    },
    {
      "id": "948afbb6-151a-4f7e-ac2f-06c5ce57e5ec",
      "title": "Human Trafficking as a Commercial Cult Mind-Control Phenomenon",
      "description": "Human Trafficking as a Commercial Cult Mind-Control Phenomenon (Steve Hassan; Christine Marie Katas; Kimberlyn Meyer; Rachel Thomas)\n2014",
      "release": "2014-09-14T19:37:04Z",
      "duration": "01:21:40",
      "explicit": false,
      "youTubeId": "BGwxwjRndY4",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BGwxwjRndY4"
      }
    },
    {
      "id": "80c1e839-08fd-478c-8b1e-7d27301123f9",
      "title": "Trauma Conference Part 2",
      "description": "Making Sense of Post-Cult Trauma and the Relational System of the Traumatizing Narcissist, organized jointly by ICSA and the National Institute for the Psychotherapies. The conference took place on October 13, 2012.",
      "release": "2014-09-07T15:59:27Z",
      "duration": "00:44:17",
      "explicit": false,
      "youTubeId": "aG-Jk1kDrrk",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aG-Jk1kDrrk"
      }
    },
    {
      "id": "fd7034c7-5231-4244-84a0-0699c23e6f29",
      "title": "An Evening With Margaret Singer and Jolly West",
      "description": "An Evening With Margaret Singer and Jolly West\n\nThe late cultic studies pioneers, Drs. Margaret Singer and Louis Jolyon (Jolly) West, reminisce about their work since the Korean War, when they both studied brainwashing in returning POWs.",
      "release": "2014-09-02T20:48:55Z",
      "duration": "02:00:36",
      "explicit": false,
      "youTubeId": "qPMacCIf11k",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qPMacCIf11k"
      }
    },
    {
      "id": "5b5a3b5c-3f8f-42fe-8375-e96d416dad06",
      "title": "Born or Raised in Cultic Groups",
      "description": "Born or Raised in Cultic Groups (Leona Furnari, M.S.W.; Lorna Goldberg M.S.W.)\n\nConference DVD.  Two experienced social workers discuss the special clinical and psychological needs of people born or raised in high-demand, cultic groups.",
      "release": "2014-08-20T20:32:43Z",
      "duration": "00:54:10",
      "explicit": false,
      "youTubeId": "niDJQHfidjs",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=niDJQHfidjs"
      }
    },
    {
      "id": "d611ad59-3e34-4968-8666-efdadd232d0f",
      "title": "Cults Saying No Under Pressure",
      "description": "Cults Saying No Under Pressure (Marcia Rudin; Charlton Heston)\n\nThis 29-minute educational videotape, produced by Marcia Rudin with the InService Videotape Network of the National Association of Secondary School Principals (NASSP) and Instructivision, Inc., is narrated by Charlton Heston.  The DVD describes how to resist the deception and pressure used to recruit members into cults and keep them there.  It also provides advice on how to resist these tactics. The video is designed for young people, parents, educators, counselors, clergy, law enforcement officials, and others.",
      "release": "2014-08-20T20:10:15Z",
      "duration": "00:27:18",
      "explicit": false,
      "youTubeId": "8kIUx_qtZvc",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8kIUx_qtZvc"
      }
    },
    {
      "id": "28b3bca4-da06-4733-8cff-c684fcf3fbf0",
      "title": "After the Cult",
      "description": "After the Cult \n\nIn this twenty-five minute videotape developed by ICSA, ten ex-cult members of various ages and backgrounds share their moving and dramatic personal stories.",
      "release": "2014-08-20T19:53:55Z",
      "duration": "00:23:06",
      "explicit": false,
      "youTubeId": "iLWk-xVqBPI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iLWk-xVqBPI"
      }
    }
  ]
}