{
  "id": "888e46a2-a237-4c13-9b8f-4330ac8e0604",
  "name": "International Cultic Studies Association (ICSA)",
  "spotifyId": "",
  "appleId": null,
  "youTubeChannelId": "UCS_hc5LO1HtMvoa8kRcLcig",
  "episodes": [
    {
      "id": "b18a2ef2-eac5-4e06-8378-ad1e1bc1a4a5",
      "title": "The Psychology of Coercive Control Online Masters Program Overview",
      "description": "More information on the Online Psychology of Coercive Control Masters Program with edited Q\u0026A University of Salford, Manchester, UK (Linda, Rod Dubrow-Marshall)\n\nLinda Dubrow-Marshall, PhD, Reg. MBACP (Accred.), is Chair of the Mental Health Network for ICSA, is Research Co-editor of ICSA Today, and a member of the Research Network for ICSA.  She is a co-founder of RETIRN (please also see www.retirn.com), a private practice that provides services to individuals and families who have been affected by cultic influence and abusive relationships. Linda has developed a new MSc Psychology of Coercive Control program at the University of Salford and is leading the program with Dr. Rod Dubrow-Marshall. She is also the Programme Leader of the MSc Applied Psychology (Therapies) Program at the University of Salford. She is registered with the Health and Care Professions Council, United Kingdom, as both a clinical and a counselling psychologist, and she is a registered counsellor/psychotherapist with the British Association for Counselling and Psychotherapy. She is a licensed psychologist in Pennsylvania, USA, and a registered psychologist with the National Register of Health Service Psychologists, USA. She attends as co-representative of RETIRN/UK as correspondent to the General Assembly of FECRIS (European Federation of Centres of Research and Education on Sects). Dr. Dubrow-Marshall is a Consultant in Clinical Hypnosis (advanced certification) with the American Society of Clinical Hypnosis and is certified by the Eye Movement Desensitization and Reprocessing Institute. She is certified as a Master Addiction Counselor with the National Certification Commission for Addiction Professionals. Website: http://www.retirn.com/Dr._Linda.htm Email: LJDMarshall@aol.com Phone: \u002B44 7973 310599/ United Kingdom Phone/Electronic Consultation Possible\n\nRod Dubrow-Marshall, PhD, MBPsS, is Professor of Psychology and Visiting Fellow, Criminal Justice Hub, University of Salford, United Kingdom. Rod is a Social Psychologist who has been researching the psychology and aetiology of undue influence and cults or extremist groups for over twenty years, and he has developed the Totalistic Identity Theory as an evidence-based theory to explain and tackle ideological extremism and ideologically driven violence. He is also an active researcher in a variety of other areas including organizational behaviour and healthiness, the social psychology of identity and prejudice, and public policy and education. A graduate member of the British Psychological Society, Rod is a member of the Board of Directors of the International Cultic Studies Association and is also Chair of the ICSA Research Committee and Network and he is co-Editor of the International Journal of Cultic Studies (since its inception in 2010). In 2006, he was awarded The Herbert L. Rosedale Award, jointly with Dr. Paul Martin, for their psychological research on undue influence. Rod co-founded the Re-Entry Therapy Information and Referral Network (RETIRN) UK in 2004 with Dr Linda Dubrow-Marshall, where he serves as a consultant in helping individuals and families who have been adversely affected by destructive or damaging cults and other extremist and high demand/manipulative groups or relationships. He operates out of offices in Pontypridd, Wales and Buxton, Derbyshire, UK (please also see www.retirn.com). Rod has also served on more than a dozen Governing Boards of Schools, Colleges and Universities over the last two decades and he is currently a governor and director of the Akaal Primary School in Derby and is also a longstanding member of the Board of the homelessness charity the Wallich (headquartered in Cardiff, Wales). In addition, he is a member of the Board of Directors of the Buxton International Festival and is Chair of the Board of the Preston Guild Link charity (in Lancashire, UK) which is fundraising for the next Preston Guild cultural festival in 2032! Rod is also an experienced senior leader and manager in higher education having served for 15 years in the roles of Deputy Vice-Chancellor at the University of Derby, Pro Vice-Chancellor at the University of Central Lancashire in Preston and as Dean of Humanities and Social Sciences at the University of South Wales and Dean of Applied Social Sciences and Humanities at Buckinghamshire New University. United Kingdom\n\nYou can check out more about the program here: \nsalford.ac.uk/pgt-courses/psychology-of-coercive-control",
      "release": "2020-08-11T20:20:51Z",
      "duration": "01:11:11",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "51kBjE9hFgM",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=51kBjE9hFgM"
      }
    }
  ]
}