{
  "_ts": 0,
  "id": "07aee0a6-44dc-4c33-86b2-f18ad85da0ca",
  "name": "Intrinsically Ordered",
  "spotifyId": "18I4mvIhH9vz5ty3Pm4qSw",
  "appleId": 1780842579,
  "youTubeChannelId": "UChh43qJiJ7hIDtRXjSESgKw",
  "episodes": [
    {
      "id": "ac0b1b98-826e-4478-9a13-438336b4cf15",
      "title": "The Absurdity of Catholic Spiritual Warfare: Cult Control Tactics \u0026 Unfalsifiable Hypotheses",
      "description": "Colin is working on a video on spiritual warfare in conservative/traditional catholicism, so we sat down this morning to talk through what spiritual warfare is, how it control peoples, some psychological ideas of why it takes a hold on folks, how it\u0027s used to influence politics, some internal consistencies, and some other things. Yes, this video is directly attacking church teaching and is quite condescending. Why? This teaching, more than almost any other, destroys peoples\u0027 lives and takes away peoples\u0027 rights. I\u0027m a fan of people choosing religious beliefs that work for them, but this realm is perhaps one of the worst parts of catholicism. Hence, the forceful speaking out. To support this work, get early access, and join my discord community, please consider supporting me on patreon: patreon.com/c/gayextrad If you want to be on the show, send me an email! (available on my YT channel)",
      "release": "2024-12-01T02:00:00Z",
      "duration": "00:58:11.3170000",
      "explicit": true,
      "spotifyId": "4Bg312ArBKFxftZGRQcRfC",
      "appleId": 1000678813498,
      "youTubeId": "_sEkWqZwm_8",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Bg312ArBKFxftZGRQcRfC",
        "apple": "https://podcasts.apple.com/podcast/the-absurdity-of-catholic-spiritual-warfare-cult/id1780842579?i=1000678813498",
        "youtube": "https://www.youtube.com/watch?v=_sEkWqZwm_8"
      }
    },
    {
      "id": "67bb8e1d-612e-47cd-8d07-adbaced76a2c",
      "title": "Catholic Conversion Therapy, Homophobia in Ordination, and Starting an Independent Church Plant: Andrew\u0027s Story",
      "description": "In this powerful and candid episode of The Intrinsically Ordered Podcast, we sit down with Andrew, a former Catholic with deep roots in the faith, now part of the Anglican Church. Andrew shares his story of growing up in a devout Catholic family, grappling with his identity as a queer man, and his transformative journey navigating homophobia within the Church.\n\n0:00 Intro\n1:45 Andrew’s Catholic Upbringing\n7:30 Coming Out in a Religious Family\n12:15 Navigating Homophobia in Youth Groups\n18:40 Conversion Therapy and Its Impact\n24:55 Seminary Life: Challenges and Lessons\n32:10 Leaving Catholicism for Anglicanism\n39:50 Reconciling Faith and Sexuality\n46:35 Andrew’s Spiritual Practices Today\n51:10 Advice for Others on Their Journey\n55:00 Closing Reflections\n\nTo get early access to episodes, join our private discord community, and support this work, consider joining my patreon: patreon.com/c/gayextrad\n\nTo be a guest on the episode, visit my shoot me an email.",
      "release": "2024-11-29T13:00:00Z",
      "duration": "00:46:58.8470000",
      "explicit": true,
      "spotifyId": "6xCj9A9swiE6JWhfxlHCNn",
      "appleId": 1000678635165,
      "youTubeId": "t8oKT2wxw0Q",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6xCj9A9swiE6JWhfxlHCNn",
        "apple": "https://podcasts.apple.com/podcast/catholic-conversion-therapy-homophobia-in-ordination/id1780842579?i=1000678635165",
        "youtube": "https://www.youtube.com/watch?v=t8oKT2wxw0Q"
      }
    },
    {
      "id": "67a22cf6-0021-45e5-85b2-ca0634489e0b",
      "title": "Answering Trent Horn\u0027s \u0027Questions Liberals Can\u0027t Answer\u0027 - Non-Catholic Answers Ep 1",
      "description": "Trent Horn, a catholic apologist for Catholic Answers and host of the Counsel of Trent show, published a talk recently at Young Americans for Freedom called \u00277 Questions Liberals Can\u0027t Answer.\u0027 I hopped on a call with Veronica from the Leave Laugh Love podcast and my two friends Ben \u0026 Colin to respond to some of Trent\u0027s questions on socialism, gay marriage, contraception, transgenderism, MAID, and abortion. Myself and co-host in this episode are all ex-catholic is varying degrees. All opinions are each individual\u0027s own (including my own crazy takes). To join the show on a future episode or submit content for us to react to, shoot me an email (available on my YT channel) or Patreon. To support this work in fighting radical catholicism, get early access to episodes, and join my discord of ex/current catholics, consider supporting me on patreon: patreon.com/c/gayextrad",
      "release": "2024-11-27T13:00:00Z",
      "duration": "01:37:54.9120000",
      "explicit": true,
      "spotifyId": "33waCuV013HiElHGdR4rI2",
      "appleId": 1000678409505,
      "youTubeId": "XxZKIoUmOpg",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33waCuV013HiElHGdR4rI2",
        "apple": "https://podcasts.apple.com/podcast/answering-trent-horns-questions-liberals-cant-answer/id1780842579?i=1000678409505",
        "youtube": "https://www.youtube.com/watch?v=XxZKIoUmOpg"
      }
    },
    {
      "id": "c6907410-83c8-4379-bb80-2b7b059dc620",
      "title": "Being a Queer Woman of Color in Traditional Catholicism \u0026 Using Witchcraft to Heal: Therese\u0027s Story",
      "description": "Therese was born into a FSSP parish. She has many good memories, but also many bad memories from her time: an overbearing mother, purity culture, being in the closet, and catholic dating. But now, Therese is living her best life after deconstructing - experiencing the world, practicing witchcraft, and falling in love. Today, Colin and I sat down with Therese to hear her story and thoughts on life. It was an honor getting to hear her story. To join our community of ex/current catholics, get early access to videos, and support this work, consider supporting me on patreon: patreon.com/c/gayextrad. If you\u0027d like to be on the show, please email me - contact info on my YT channel. I\u0027d love to hear your story and thoughts on the world!",
      "release": "2024-11-24T20:00:00Z",
      "duration": "00:56:26.9060000",
      "explicit": true,
      "spotifyId": "1ej55xnD2NHK1j2ovQsZDZ",
      "appleId": 1000678092671,
      "youTubeId": "JOVO6SdLLV8",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ej55xnD2NHK1j2ovQsZDZ",
        "apple": "https://podcasts.apple.com/podcast/being-a-queer-woman-of-color-in/id1780842579?i=1000678092671",
        "youtube": "https://www.youtube.com/watch?v=JOVO6SdLLV8"
      }
    },
    {
      "id": "4b63db3a-b89d-4050-ba7e-62658984dba9",
      "title": "Queer Folks Are a Danger to the Catholic Church\u0027s \u0027Infallible\u0027 Magisterium",
      "description": "The Catholic Church promises \u0027true peace\u0027 to all who follow Him, but what do you do when you don\u0027t? What if your existence and wellbeing run contrary to this path that contains the \u0027fullness of the truth?\u0027 Today, I had a longer discussion with my friend Colin (gay, raised FSSP) and Astronaut (gay, former cleric) about my last video \u0027The Catholic Church Doesn\u0027t Know What to Do With Gay People.\u0027 The Intrinsically Ordered Podcast is available on all major podcast platforms and explores the intersection of queer identity and catholicism - sharing stories of those who\u0027ve left, remained, and created their own journeys; providing commentary on the catholic church\u0027s harmful teachings; helping those who\u0027ve been hurt. To get early access to new episodes, submit questions to guests, and support this work, consider supporting me on patreon: patreon.com/c/gayextrad 00:02:00 - Queer Identity and the Church\u0027s Structure 00:10:00 - Emotional Impact of Catholicism 00:33:27 - Gay Priests 00:44:12 - Intimacy \u0026 Sexuality 00:52:32 - Philosophical Dilemmas 01:02:35 - Navigating Logic Mazes in Theology 01:12:02 - Should You Stay Catholic To be a guest on the show or to contact, email can be found in channel information",
      "release": "2024-11-22T13:00:00Z",
      "duration": "01:19:53.6000000",
      "explicit": true,
      "spotifyId": "6EtF9eKXPBQArCt4Wx3pqg",
      "appleId": 1000677899554,
      "youTubeId": "g7mhifXTRLg",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6EtF9eKXPBQArCt4Wx3pqg",
        "apple": "https://podcasts.apple.com/podcast/queer-folks-are-a-danger-to-the-catholic/id1780842579?i=1000677899554",
        "youtube": "https://www.youtube.com/watch?v=g7mhifXTRLg"
      }
    },
    {
      "id": "3f3ca79a-a26b-427e-a07b-fbfaa1a928ce",
      "title": "Why I Stay Catholic as a Gay Man - Chris Dowling-Magill Interview",
      "description": "I sat down with Chris Dowling to hear his story of loosing his job after coming out, why he still stays religious, how he lives out of the fruits of the spirit, and his upcoming two-year anniversary of being married. To connect with Chris and hear more of his work, make sure to follow him on Instagram and Facebook. To support interviews like this, consider supporting my work on Patreon and gain early access to new episodes: patreon.com/gaytradspeaks. I have Simon Kent Fung (creator of Dear Alana), Justin (\u0027EmptyChairsHome\u0027 on social media), and a number of other guests lined up to be on the podcast. The goal of this podcast format is to to hear stories of people at the intersection of queer identity and religion. I\u0027ve shared plenty about my story and my own thoughts on my main channel, but I wanted to create a second channel dedicated to hearing others\u0027 stories - remaining in the church, leaving the church, finding a more accepting denomination, etc. Hopefully these stories can give you more of a perspective and help you make decisions for your faith journey. If you\u0027d like to be on the podcast, feel free to reach out - contact info is on my channel, or send me a DM.",
      "release": "2024-11-20T17:00:00Z",
      "duration": "00:45:23.6570000",
      "explicit": true,
      "spotifyId": "5iH8SR3aTLRPDyK2BzBxGO",
      "appleId": 1000677659925,
      "youTubeId": "CFRadTylCEY",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5iH8SR3aTLRPDyK2BzBxGO",
        "apple": "https://podcasts.apple.com/podcast/why-i-stay-catholic-as-a-gay-man-chris-dowling/id1780842579?i=1000677659925",
        "youtube": "https://www.youtube.com/watch?v=CFRadTylCEY"
      }
    }
  ]
}