{
  "id": "d964a7c1-383b-45b2-bc3d-5fb33551ac8e",
  "name": "is it really so?",
  "youTubeChannelId": "UC7RgOW3_XHEt3uWU7JOcGdg",
  "episodes": [
    {
      "id": "0778787d-9f61-4352-b2f8-b7f58397a3f6",
      "title": "Why Do Jehovah\u0027s Witnesses Preach? The Real Reasons.",
      "description": "Jehovah’s Witnesses preach about their beliefs and attempt to make converts. Why is this?\n\n\nThey call it the preaching ‘work’. It\u0027s not work. It’s ritualistic and embodied subjugation to the dogma. It’s how you act out your submission to the beliefs in a ritualistic way. It’s self flagellation. It’s self indoctrination. It\u0027s a defense mechanism against the absurdity of the beliefs themselves. It’s a performance of reputation management and an act of community self-monitoring. It is a savage consumer of a person\u0027s mental and emotional energy and of their precious time.\n\n(Matthew 24:14) . . .And this good news of the kingdom will be preached in all the inhabited earth for a witness to all the nations; and then the end will come. . .\n(Matthew 28:19, 20) . . .Go therefore and make disciples of people of all the nations, baptizing them in the name of the Father and of the Son and of the holy spirit,  teaching them to observe all the things I have commanded you. And, look! I am with you all the days until the conclusion of the system of things.”\n\n\nYou dress up, listen to some half baked pep-talk and go knocking on doors that you don\u0027t want to knock on to preach at people who don\u0027t want to be preached to. So this is a ritual, to remind yourself and others of what a good submissive boy you are.\n\nYou do it because you want other Witnesses to see you are doing it and to live up to the expectations of what some old men have decided constitutes service to God. \n\n\nWhether the group is a “fraternity or tenured faculty,” the more difficult, “painful and humiliating” the initiation process, the higher value members will place on the group. The mere act of devoting time and effort “changes the way we evaluate it.”\nAreily, D. 2010. The Upside of Irrationality. The Unexpected Benefits of Defying Logic at Home and at Work. pp.89, 103\n\nIt is self indoctrination. \nYou are there to give them the truth. You have this important information and you are intensely focused on that mindset for the time you are in that work. You are also expressing publicly and repeatedly that you believe this and that you have good reasons for it. You are reinforcing the indoctrination of yourself. \n\nSteve Hassan. Combating Cult Mind Control.\nP.118 Cult “members are also kept so busy that they don’t have time to think and seek outside answers to questions. When they do read, it is primarily cult-generated propaganda or material that has been censored to keep members focused.”\n\nIt reminds the JW’s that they are different from the world. Reminds them that the only place they will find validation and acceptance is in the org. Yet perversely, this is only because the org has artificially created these conditions.\n\n“Social strength, or maintenance of community, is attained by creating strong ties within the congregation, primarily due to emphasizing the difference with the larger community.” Djupe, P. A. 2000. Religious Brand Loyalty and Political Loyalties. p.80\n\nThis preaching is also a natural reaction to the dogma\u0027s manifest falsity.\n\n“The proselytizing fanatic strengthens his own faith by converting others. The creed whose legitimacy is most easily challenged is likely to develop the strongest proselytizing impulse.” True believer p.110 \n\n“If more and more people can be persuaded that a system of belief is correct, then clearly it must, after all, be correct.” p. 30 Festinger\n\nHere\u0027s another perverse thing about it. When people reject the message it\u0027s proof of their dogma. When people accept it it is proof of their ideology. \n\nThis is the desperate mess that JWs find themselves in. \n\nIt has multiple layers or artificiality stacked up on itself and that is why it’s so hated  by so many Witnesses. It’s superficial, it’s demeaning. \n\nEven though they might not like doing it, It makes Witnesses believe that they are having a part to play in the grand cosmic drama at the center of JW beliefs. The end is coming, people are going to die, but we warned them, and saved some too. \n\nWhether the Governing Body knows it or not, they are following the cult playbook very well. Keep people very busy in their cult activities, and praise those people who are very active loyal cult members and scold those that dare to have personal goals or ambitions that don’t center on advancing in the cult.\n\nCan you imagine the respect the JWs would have if they spent this time doing something constructive. Imagine 1 billion hours a year being given to helping the hom;less, picking up trash on the streets, community visits for the elderly. There’s  a thousand things they could do if they really wanted to help people.\n\nYou’ll hear JW call it a volunteer work as if this imbues it some kind of nobility. \n\nSo we can safely say that, even though this is something JWs are famous for, and something for which the JWs think they have good reasons for; they in fact don’t know why they preach, because if they knew the real reasons they’d never do it again.",
      "release": "2021-05-08T19:15:24Z",
      "duration": "00:12:39",
      "explicit": false,
      "youTubeId": "vsn_GdeiSkM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vsn_GdeiSkM"
      }
    }
  ]
}