{
  "_ts": 0,
  "id": "44dc1735-4ea6-48db-a5a6-185fe126492a",
  "name": "It Can\u0027t Just Be Me",
  "spotifyId": "77EVDth81JV2aRdiUHXJVI",
  "appleId": 1679925286,
  "episodes": [
    {
      "id": "7528d503-9789-4e10-9dc0-71f8a635656d",
      "title": "39: The Cult of Wellness? With Charlotte Church and Michele Knight",
      "description": "The wellness industry is worth about $5 trillion worldwide and it feels like there\u0027s always something we should be spending money on to benefit our mind, body and soul. But the quest to feel our best can come at a cost that extends beyond the financial - it can impact our relationships too. Here to unpack the world of wellness, spirituality and radical healing with Anna is Charlotte Church (singer and founder of wellness and healing centre, The Dreaming ) and Michele Knight (psychic, astrologer and Sunday-Times best-selling author). Together, they discuss a dilemma from a listener who is skeptical about his partner’s belief in alternative therapies and the validity of the wellness industry as a whole. They also address a dilemma from someone who is concerned his partner is becoming overly dependent on her psychic. During the conversation, Charlotte and Michele explore the tension between helping people and monetisation, the dangers of spiritual and psychic practices when not conducted ethically, and whether it’s possible to build a relationship with someone who fundamentally has different beliefs. — Have questions about sex? Divorce? Motherhood? Menopause? Mental health? With no topic off limits, Anna’s here to prove that whatever you’re going through, it’s not just you. If you have a dilemma you’d like unpacked, visit itcantjustbeme.co.uk and record a voice note. Or tell Anna all about it in an email to itcantjustbeme@podimo.com This podcast contains adult themes that may not be suitable for children. Listener caution is advised. Please note that advice given on this podcast is not intended to replace the input of a trained professional. If you’ve been affected by anything raised in this episode and want extra support, we encourage you to reach out to your general practitioner or an accredited professional. From Podimo \u0026 Mags Creative Producers: Laura Williams and Christy Callaway-Gale Editor: Kim Milsom Theme music: Kit Milsom Executive Producers for Podimo: Jake Chudnow and Matt White Executive Producer for Mags: Faith Russell Follow @itcantjustbemepod and @podimo_uk on Instagram and @itcantjustbemepod on TikTok for weekly updates. You can also watch the full episode on Youtube . Headshot by Rekha Garton",
      "release": "2024-03-13T03:00:00Z",
      "duration": "00:42:44.0880000",
      "explicit": true,
      "spotifyId": "5q2oBX2pGfKIv8mcNsZjJQ",
      "appleId": 1000648994637,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5q2oBX2pGfKIv8mcNsZjJQ",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-wellness-with-charlotte/id1679925286?i=1000648994637"
      }
    }
  ]
}