{
  "id": "e3d7d7ff-aa98-4f35-85a7-a89f9ecd20cd",
  "name": "It Wasn’t Me: A True Crime Podcast",
  "spotifyId": "1226MYLehxar35CJD6avoa",
  "appleId": 1484263510,
  "episodes": [
    {
      "id": "8430f568-019e-41de-b5e1-6c40c6628142",
      "title": "Lisa McPherson: 17 Days Inside Scientology (part 1) - EP98",
      "description": "Summary: In this episode, hosts Cynthia and Mercedes dive deep into the tragic story of Lisa McPherson, a member of the Church of Scientology who died under mysterious circumstances after being isolated for 17 days. The conversation begins with a light-hearted introduction, but quickly shifts to the serious nature of the topic as they discuss the psychological and medical neglect that Lisa faced during her time in the church\u0027s care. They explore the controversial practices of Scientology, including the \u0027introspection rundown\u0027 and the church\u0027s aversion to psychiatric help, which ultimately contributed to Lisa\u0027s demise. The hosts emphasize the importance of understanding the broader implications of her story, including the cult-like dynamics within Scientology and the tragic consequences of blind obedience to doctrine over medical intervention. Disclaimer: The views and opinions expressed on this podcast are our own and do not reflect the views of any employer, agency, organization, or affiliated entity. The content discussed is based on our research, interpretation, commentary, and opinion and may change as new information becomes available. While we strive for accuracy, we make no guarantees regarding the completeness or correctness of any information presented. All content is provided on an “as-is” basis. Listeners are encouraged to independently verify facts and draw their own conclusions. We are not responsible for any errors, omissions, or outcomes resulting from the use of this information. Resources: Death of Lisa McPherson - Wikipedia Who Was Lisa McPherson? | The Lisa McPherson Files Lisa McPherson died at the hands of Scientology Opposition to Summary Judgment State of Florida vs. Church of Scientology Felony Indictment | The Lisa McPherson Files Lisa_criminal_case_docs.pdf Sinners and Secrets - Podcast - Apple Podcasts Twenty-eight years ago today: The final hours of Lisa McPherson’s Scientology life HUBBARD COMMUNICATIONS OFFICE Scientology And The Mysterious Death Of Lisa McPherson Lisa McPherson - Alchetron, The Free Social Encyclopedia Lisa-death-reports-1995-1997.pdf Support: www.patreon.com/itwasntmepod https://www.tiktok.com/@it.wasnt.me.podcast www.facebook.com/itwasntmepod www.instagram.com/itwasntmepodcast/",
      "release": "2026-02-13T06:00:00Z",
      "duration": "00:58:35.8950000",
      "explicit": true,
      "spotifyId": "4RvSksVQRIcJsjlHNO5LPh",
      "appleId": 1000749553317,
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4RvSksVQRIcJsjlHNO5LPh",
        "apple": "https://podcasts.apple.com/podcast/lisa-mcpherson-17-days-inside-scientology-part-1-ep98/id1484263510?i=1000749553317"
      }
    }
  ]
}