{
  "id": "8de36403-3cab-41bb-9ada-ff108f8b7552",
  "name": "ITV News In Full",
  "youTubeChannelId": "UCcmAANCRTU2xdsC2Pdlq0SQ",
  "episodes": [
    {
      "id": "14f17a53-ac32-4385-bfb7-36ca3bfca1ee",
      "title": "Summer camp leader jailed for drugging and sexually abusing boys | ITV News Central (East)",
      "description": "The latest news, sport and weather from the ITV News Central team. On today’s programme:\n\n-  A summer camp leader from Nottinghamshire who injected sedatives into sweets to sexually abuse boys is jailed for more than 23 years \n\nA church goer, Ruben was accused of using the \u0027Cloak of Christianity\u0027 to offend - police now investigate what else happened in the 27 years he ran the camp \n\n-  The funeral of a mother and daughter from Nottinghamshire who died off the East Yorkshire coast has been held today.\n\nHearses carried the coffins of Sarah Keeling and her 15 year old daughter Grace to a private service for family and friends in Mansfield. Grace was swept away in the sea in Withernsea on the 2nd of January.\n\n- The opening ceremony of the Winter Olympics will soon get underway in the northern Italian city of Milan. We take a look at the local talent.\n\n- The opening ceremony of the Winter Olympics will soon get underway in the northern Italian city of Milan. We take a look at the local talent.\r\nFor more of the biggest news stories in the UK and around the world, visit the ITV News YouTube channel: https://www.youtube.com/@ITVNews\r\n\r\n• Subscribe to ITV News In Full on YouTube: https://www.youtube.com/@ITVNewsInFull?sub_confirmation=1\r\n• Get breaking news and more stories at http://www.itv.com/news\r\n\r\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\r\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\r\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \r\nFollow ITV News on X: https://twitter.com/itvnews\r\n\r\nThese programmes may be edited to comply with copyright agreements.",
      "release": "2026-02-06T20:19:49Z",
      "duration": "00:25:15",
      "explicit": false,
      "youTubeId": "E76rhOj6Y94",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E76rhOj6Y94"
      }
    }
  ]
}