{
  "id": "39004a76-a73a-44d0-82de-86a05aafb2e2",
  "name": "ITV News",
  "youTubeChannelId": "UCFQgi22Ht00CpaOQLtvZx2A",
  "episodes": [
    {
      "id": "528beb42-1a85-4bdb-a0cd-fa0bf5871894",
      "title": "We took the mother of an Epstein victim back to the site of his infamous mansion | ITV News",
      "description": "We accompanied the mother of Epstein victim Carolyn Andriano, as she returned to visit the site of his infamous West Palm Beach mansion for the first time ever. \n\nHer daughter began working in the mansion as a cleaner but was then abused by Epstein for years, resulting in a spiral of depression and drug dependency.\n\nShe died almost three years ago, in what was ruled as an accidental overdose.\n\nDorothy Groenert also recounts how Carolyn told her that Virginia Giuffre, who also worked at the Epstein mansion, recruited her and tried to persuade her to have sex with Andrew Mountbatten-Windsor.\n\nAndrew Mountbatten-Windsor has always strongly denied any allegations or wrongdoing in relation to Jeffrey Epstein. \n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2026-02-13T17:38:02Z",
      "duration": "00:05:02",
      "explicit": false,
      "youTubeId": "8gtDnOK-OYY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8gtDnOK-OYY"
      }
    },
    {
      "id": "89ecbccd-3343-402c-9962-6387fddbc762",
      "title": "Was Prince Andrew planning to start a business with Jeffrey Epstein? | ITV News",
      "description": "Andrew Mountbatten-Windsor appears to have been attempting to build a business partnership with the convicted paedophile Jeffrey Epstein while he was still acting as trade envoy, according to documents released under the Epstein files.\n\nITV News has discovered more than a dozen emails which show ongoing discussions between Epstein, Andrew, and a mutual liaison called David Stern, who used to run Andrew’s Pitch@Palace business.\n\nMore than a dozen emails, found in the latest Epstein files, show ongoing discussions between Epstein, Andrew, and a mutual liaison called David Stern, who used to run Andrew’s Pitch@Palace business.\n\nThe emails range from early 2010 to at least 2018, overlapping with Andrew’s time as trade envoy to the prime minister — a role that would have seen him promoting British business and trade interests abroad.\n\nAndrew has previously vehemently denied any wrongdoing.\n\nWe\u0027ve contacted David Stern for comment.\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram:   / itvnews  \nFollow ITV News on Facebook:   / itvnews   \nFollow ITV News on X:   / itvnews",
      "release": "2026-02-13T10:50:18Z",
      "duration": "00:02:29",
      "explicit": false,
      "youTubeId": "VekWcYCobeU",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VekWcYCobeU"
      }
    },
    {
      "id": "e608e343-c254-41c9-a3b4-b84b44057727",
      "title": "Virginia Giuffre\u0027s brother wants to meet King Charles | ITV News",
      "description": "Virginia Giuffre\u0027s brother has told ITV News that he wants to meet with King Charles face to face, following the latest details in the Epstein Files.\n\nMs Giuffre claimed that she was trafficked by Epstein to have sex with the King\u0027s brother Andrew Mountbatten-Windsor. The former prince has always denied any wrongdoing.\n\nMs Giuffre took her own life in April 2025.\n\nIn an interview with ITV News, her brother Sky Roberts was joined by his wife Amanda.\n\nThey called on the Metropolitan Police to re-open its investigation into the allegations against Mr Mountbatten-Windsor relating to Virginia Giuffre.\n\nA statement released by the force in December last year said: “A decision was made in November 2016 not to proceed to a full criminal investigation. That decision was reviewed in August 2019 and again in 2021 and 2022; in each instance, the position remained unchanged, and Ms Giuffre and her legal representative were informed.\n\n“Following recent reporting suggesting that Mr Andrew Mountbatten-Windsor asked his Met Police close protection officer to carry out checks on Ms Giuffre in 2011, the MPS has carried out a further assessment. This assessment has not revealed any additional evidence of criminal acts or misconduct.\u0022\n\nBuckingham Palace has said it will assist with any inquiries relating to the King\u0027s brother, in relation to a Thames Valley Police investigation relating to misconduct in a public office.\n\nThe pair also spoke about Lord Mandelson, and said that he had questions to answer over his relationship with Jeffrey Epstein.\n\nHe has previously given the following statement: \u0022I was never culpable or complicit in his [Epstein’s] \rcrimes. Like everyone else, I learned the full \rtruth about him after his death.\n\n\r\u0022But his victims did know what he was doing, their voices were not heard, and I am truly sorry I was amongst those who believed him over them.\n\n\u0022I want to say loudly and clearly that I was wrong to believe him following his conviction and to continue my association with him afterwards.” \n\n-----------------------------------------\r\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2026-02-12T11:13:39Z",
      "duration": "00:08:41",
      "explicit": false,
      "youTubeId": "EuCQSCWa-68",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EuCQSCWa-68"
      }
    },
    {
      "id": "99295da4-3fe6-457d-a61e-dcbf7744a693",
      "title": "Two Epstein survivors share their story | ITV News",
      "description": "Two survivors of Jeffrey Epstein\u0027s abuse have shared their experience with ITV News. \n\nThey also revealed their frustrations at the public nature of the ongoing release of the Epstein files - with many victim names left unredacted. \n\nThey also spoke of their belief in a lack of accountability for alleged perpetrators of abuse. \n\nAlongside family members of Virginia Giuffre they have called for a new law to bring their abusers to justice. \n\nSupported by Democratic senators, the survivors brought their fight to Washington as revelations from the Epstein Files continue to cause outrage and calls for action on both sides of the Atlantic. \n\nAndrew Mountbatten-Windsor has always strongly denied any allegations of wrongdoing.\n\nLord Peter Mandelson has previously said: \u0022I was never culpable or complicit in his [Epstein’s] crimes. Like everyone else, I learned the full truth about him after his death.” \n\n\u0022But his victims did know what he was doing, their voices were not heard, and I am truly sorry I was amongst those who believed him over them.\u0022 \n\n\u0022I want to say loudly and clearly that I was wrong to believe him following his conviction and to continue my association with him afterwards.” \n\n“I apologise unequivocally for doing so to the women and girls who suffered.\u0022 \n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2026-02-10T20:46:21Z",
      "duration": "00:21:41",
      "explicit": false,
      "youTubeId": "pULUqgV9XqM",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pULUqgV9XqM"
      }
    },
    {
      "id": "8a1e7ba7-697a-4db9-8b2e-bcc25282e573",
      "title": "Epstein Files: King\u0027s \u0027profound concern\u0027 about Andrew allegations, as police launch investigation",
      "description": "King Charles has shared his \u0022profound concern\u0022 over the latest allegations about his brother Andrew and made it clear he will support Thames Valley Police in assessing claims that Mountbatten-Windsor allegedly shared confidential reports from his role as the UK\u0027s trade envoy with Jeffrey Epstein.\n\nEmails released by the US Department of Justice earlier this month appear to show the former duke sharing reports of official visits to Hong Kong, Vietnam, and Singapore with the disgraced financier.\n\nOn Monday, Thames Valley Police confirmed they were looking into the fresh allegations.\n\nThis prompted the following statement from a Buckingham Palace spokesperson:\n\n\u0022The King has made clear, in words and through unprecedented actions, his profound concern at allegations which continue to come to light in respect of Mr Mountbatten-Windsor’s conduct.\n\n\u0022While the specific claims in question are for Mr Mountbatten-Windsor to address, if we are approached by Thames Valley Police we stand ready to support them as you would expect.\n\n\u0022As was previously stated, Their Majesties’ thoughts and sympathies have been, and remain with, the victims of any and all forms of abuse.\u0022\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2026-02-09T22:38:45Z",
      "duration": "00:07:06",
      "explicit": false,
      "youTubeId": "727BxwGYNPo",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=727BxwGYNPo"
      }
    },
    {
      "id": "11543903-1c11-40f4-9d3a-ee448502ea00",
      "title": "Epstein Files: Why have the police now searched Peter Mandelson\u0027s homes? | ITV News",
      "description": "Police have searched two addresses linked to former US ambassador Peter Mandelson.\n\nOfficers are searching one address in Wiltshire and another in Camden. Two people believed to be police officers arrived outside Lord Mandelson’s house near Regent’s Park in central London on Friday afternoon.\n\nOne of them appeared to be wearing a small body camera. They knocked on the door and entered the house.\n\nIt came before Prime Minister Sir Keir Starmer warned a \u0022very significant volume of material\u0022 will likely need to be reviewed in relation to Lord Mandelson’s appointment as ambassador to the US as Parliament’s security watchdog assesses which documents can be released.\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2026-02-06T22:45:00Z",
      "duration": "00:06:17",
      "explicit": false,
      "youTubeId": "E2Gtk9lGQcY",
      "subjects": [
        "Human Trafficking",
        "_London",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E2Gtk9lGQcY"
      }
    },
    {
      "id": "cf7ce20b-c0cb-4e69-a6cf-2cea6fe51f74",
      "title": "\u0027Sadistic paedophile\u0027 Jon Ruben who injected drugs into children\u0027s sweets is jailed | ITV News",
      "description": "WARNING: this video contains details of the offences which some viewers may find distressing.\n\nA summer camp leader who crushed up drugs and injected them into sweets for children has been jailed for 23 years and ten months.\n\nFormer vet and church-goer Jon Ruben pleaded guilty to 17 offences relating to incidents at the camp at Stathern Lodge in Leicestershire which he ran for 27 years.\n\nA number of children fell ill at the camp near Melton Mowbray last year. Emergency services attended the scene the day after receiving the report.\n\nEight children aged between eight and 11, were taken to hospital as a precaution, said police.\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2026-02-06T18:52:43Z",
      "duration": "00:03:36",
      "explicit": false,
      "youTubeId": "R_OVFKdJISk",
      "subjects": [
        "Church Of England"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R_OVFKdJISk"
      }
    },
    {
      "id": "b1948c4c-6beb-4ec3-8f45-17c10f8b65d9",
      "title": "Epstein files fallout: Andrew out of Royal Lodge - as police investigate Mandelson | ITV News",
      "description": "A criminal investigation has been launched into Lord Mandelson amid allegations he passed market-sensitive information to paedophile financier Jeffrey Epstein.\n\nMet Police Commander Ella Marriott confirmed the force \u0022has now launched an investigation into a 72-year-old man, a former Government Minister, for misconduct in public office offences\u0022.\n\nIt comes hours after the Lord Speaker confirmed Mandelson will step down from the House of Lords following fresh allegations concerning his relationship and dealings with Jeffrey Epstein.\n\nNumber 10 said they had passed material to the police after an initial review of documents released as part of the so-called Epstein files found they contained “likely market-sensitive information” and official handling safeguards had been “compromised”.\n\nOn Tuesday evening, a government spokesperson confirmed they will \u0022provide whatever support and assistance the police need\u0022 in their investigation.\n\nEarlier, former prime minister Gordon Brown said that he had written to Met Police Commissioner Sir Mark Rowley “with information relevant to his investigation of Lord Mandelson’s disclosure of market sensitive and confidential government information” to Jeffrey Epstein.\n\nMandelson has insisted Epstein’s money did not influence his actions in government.\n\nHe will formally retire from the House of Lords on February 4, the newly-installed Lord Speaker Lord Forsyth of Drumlean said.\n\nA Downing Street spokesperson said: “It is right that Peter Mandelson will no longer be a member of the House of Lords.\n\n“As the prime minister said this morning, Peter Mandelson let his country down.”\n\nSpeaking exclusively to ITV News on Tuesday, Foreign Secretary Yvette Cooper said the revelations have been \u0022truly shocking\u0022.\n\nCooper sacked Mandelson as US ambassador in September, and was in government with him during the period over which he allegedly forwarded emails on to Epstein.\n\nShe said: \u0022I removed Peter Mandelson as ambassador to the US very shortly after being appointed as foreign secretary.\n\n\u0022There\u0027s clearly been a lot of information that just was not known and these revelations, for me, as someone who was in the Treasury at the time of the financial crisis, I find truly shocking.\u0022\n\nDespite resigning, Mandelson will keep his title as a Lord.\n\nThis is because a life peerage cannot be relinquished – an Act of Parliament is needed to do that.\n\nA law change to remove peerages last happened more than 100 years ago, when the Titles Deprivation Act 1917 (TDA) was created after the First World War to remove peerages from \u0022enemies\u0022 of the UK.\n\nThe prime minister’s official spokesman said Starmer opened Tuesday’s Cabinet meeting by saying he was “appalled by the information that had emerged over the weekend in the Epstein files”.\n\n“He said the alleged passing-on of emails of highly sensitive government business was disgraceful, adding that he was not reassured that the totality of information had yet emerged,” the spokesman said.",
      "release": "2026-02-03T23:13:25Z",
      "duration": "00:12:53",
      "explicit": false,
      "youTubeId": "bGebxGr9g8Q",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bGebxGr9g8Q"
      }
    },
    {
      "id": "c8e507e2-8fd6-4b1a-9b06-5d259a89a1ab",
      "title": "Epstein files released as FBI says it has identified over 1,000 victims",
      "description": "The long-awaited release of the Epstein Files has been met with anger and disappointment by survivors.\n\nTonight hundreds of thousands of documents relating to the American sex offender Jeffrey Epstein were made public - but its not the full set.\n\nMany are also heavily redacted - prompting fury from Donald Trump\u0027s opponents.\n\nWhat we have learned is the true scale of Epstein\u0027s abuse.\n\nThe Department of Justice said it identified more than a thousand victims as part of its investigation.\nAnd there were more photos of Epstein\u0027s lavish lifestyle and celebrity associates.\n\nWith the details, here\u0027s our US Correspondent Dan Rivers. \n-------------------------------------------------------------------------------------------------------------\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2025-12-19T23:31:53Z",
      "duration": "00:04:42",
      "explicit": false,
      "youTubeId": "vTpYQy_ccSQ",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vTpYQy_ccSQ"
      }
    },
    {
      "id": "df944fa4-da60-46c4-8574-00f624929549",
      "title": "Epstein files: Victims and US politicians speak ahead of key vote | ITV News",
      "description": "US Representatives hold a press conference with survivors of sex offender Jeffrey Epstein\u0027s abuse. \n\nRepresentatives Ro Khanna, Thomas Massie and Marjorie Taylor Greene are expected to speak and survivors of Epstein’s abuse will be presented at the start of the press conference. \n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news \n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en \nFollow ITV News on Instagram: https://www.instagram.com/itvnews/ \nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2025-11-18T15:19:27Z",
      "duration": "01:08:40",
      "explicit": false,
      "youTubeId": "TuSQl2QWfBY",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TuSQl2QWfBY"
      }
    },
    {
      "id": "064af249-44fd-4ebb-8a57-40473c7444f3",
      "title": "Victim says Epstein tried to lure her to a dinner with a British royal | ITV News",
      "description": "A survivor of the serial paedophile Jeffrey Epstein has given her first on the record interview telling ITV News how the disgraced financier tried to lure her to a dinner with a member of the British Royal family. \n\nAnn Fisher says she was assaulted by Epstein in May 2001 at his Upper East Side mansion in New York, having gone to what she thought was a business meeting. \n\nAfter talking for some three hours, he invited her to an upcoming dinner with a member of the Royal family where he said she would fit in well as Fisher is half English and according to Epstein, resembled Princess Diana. \n\nEpstein then attacked her. He later offered her a cheque which she refused. In the subsequent days, one of Epstein’s assistants repeatedly called her, on her mobile phone, her work phone and her home phone, pestering her to attend the dinner. \n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2025-11-14T09:15:10Z",
      "duration": "00:05:52",
      "explicit": false,
      "youTubeId": "kNyEstYyxIU",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kNyEstYyxIU"
      }
    },
    {
      "id": "67286210-6252-4b69-8494-bdfae4870164",
      "title": "Andrew Mountbatten Windsor: The downfall of a former British prince | ITV News",
      "description": "He was said to be the late Queen Elizabeth\u0027s favourite son, but after what is arguably the biggest royal scandal since the abdication crisis of 1936, the former prince will now be known as Andrew Mountbatten Windsor.\n\nThe disgraced royal, whose friendship with convicted paedophile financier Jeffrey Epstein led to his downfall, has also agreed to move out of his Windsor home.\n\nHe has strenuously denied the allegations made by Virginia Giuffre concerning him and Epstein, but a once-celebrated war hero, Mountbatten Windsor, is now an ex-prince, with his public life as a royal effectively ended by the King.\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: / itvnews  \nFollow ITV News on Facebook:/ itvnews   \nFollow ITV News on X:  / itvnews",
      "release": "2025-10-31T22:37:45Z",
      "duration": "00:02:48",
      "explicit": false,
      "youTubeId": "UJ40ZJzPrR0",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UJ40ZJzPrR0"
      }
    },
    {
      "id": "dab2e556-ded9-4a11-af5e-f60c37a59bb5",
      "title": "\u0027He was on the island\u0027: Giuffre memoir co-writer says Andrew could help investigation | ITV News",
      "description": "The co-writer of Virginia Giuffre\u0027s memoir has said it would be a mistake to think \u0022the fetishisation of young girls\u0022 died with Jeffrey Epstein, as she detailed how Prince Andrew could still help with the investigation.\n\nSpeaking to ITV News, Amy Wallace, who helped write the book, said she had \u0022no doubt\u0022 about the truth of the allegations Giuffre made about the prince in it.\n\nThe book, titled Nobody\u0027s Girl, details Ms Giuffre\u0027s life and her interactions with Prince Andrew, Jeffrey Epstein and Ghislaine Maxwell.\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2025-10-21T05:29:08Z",
      "duration": "00:31:11",
      "explicit": false,
      "youTubeId": "0nPVYclHoTQ",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0nPVYclHoTQ"
      }
    },
    {
      "id": "dd986cc5-41ef-45f1-a50f-905cd9854095",
      "title": "Explained: Key Prince Andrew claims we learnt from Virginia Giuffre\u0027s posthumous memoir | ITV News",
      "description": "What have we learnt from Virginia Giuffre\u0027s posthumous memoir about her alleged sexual abuse by Prince Andrew?\n\nVirginia Giuffre detailed an orgy she claimed she had with Prince Andrew and Jeffrey Epstein in her posthumously published memoir that revealed more details about her alleged relationship with the former duke, who has long denied having ever met her.\n\nIn her memoir, Nobody\u0027s Girl, Ms Giuffre claimed she had sex three times with Andrew, in London, New York and on Epstein\u0027s private island.\n\n• Subscribe to ITV News on YouTube: http://bit.ly/2lOHmNj \n• Get breaking news and more stories at http://www.itv.com/news\n\nFollow ITV News on TikTok https://www.tiktok.com/@itvnews?lang=en\nFollow ITV News on Instagram: https://www.instagram.com/itvnews/\nFollow ITV News on Facebook: https://www.facebook.com/itvnews/ \nFollow ITV News on X: https://twitter.com/itvnews",
      "release": "2025-10-20T22:05:00Z",
      "duration": "00:02:55",
      "explicit": false,
      "youTubeId": "4jboDjXYFbg",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4jboDjXYFbg"
      }
    }
  ]
}