{
  "_ts": 0,
  "id": "0acc8e7a-d85e-4a2f-a99e-702961f9f639",
  "name": "I\u0027ve Never Said This Before With Tommy DiDario",
  "spotifyId": "2Ao7ExIQd1nXBQb1Zvacbv",
  "appleId": 1693322370,
  "episodes": [
    {
      "id": "3b9cbb67-d68f-4b81-8219-c03c2d9c4380",
      "title": "Bethany Joy Lenz of One Tree Hill",
      "description": "This week, Tommy is joined by actress Bethany Joy Lenz who became a household name by playing the beloved role of Haley James Scott in One Tree Hill. Joy and her co-star James Lafferty became cemented in pop culture as one of the most popular television couples ever. Her new memoir, “Dinner for Vampires,” is out now and chronicles her spending a decade in a cult, and her quest to break free. Publicly, she was the “it” girl that people adored from One Tree Hill, rising to the height of international fame. But privately, she felt like she was falling deeper and deeper into a cult that she couldn’t break free from…until one day she had enough. Today, Joy opens up about how she went from going to a weekly bible study to being fully immersed in a cult, the red flags about this group that she now realizes she ignored, the first moment she really began feeling being isolated from her friend and family, joining Once Tree Hill and juggling her work life with the cult, what makes her smile when she thinks back on her fan-favorite role on the series, that iconic kissing in the rain scene, why she wishes she could go back in time and give co-star Sophia Bush a really big hug, the latest on a potential reboot, why thinking about the kindness from her cast after going through a difficult time makes her emotional, the moment she realized the cult took over $2 million from her, how she was able to most past feeling self-loathing to start forgiving herself, what she wants to say to her parents for the first time and so much more. See omnystudio.com/listener for privacy information.",
      "release": "2024-10-29T07:00:00Z",
      "duration": "01:03:19.1700000",
      "explicit": false,
      "spotifyId": "6NAu7YXB8FCh8EuzTkQ0YH",
      "appleId": 1000674828593,
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6NAu7YXB8FCh8EuzTkQ0YH",
        "apple": "https://podcasts.apple.com/podcast/bethany-joy-lenz-of-one-tree-hill/id1693322370?i=1000674828593"
      }
    }
  ]
}