{
  "_ts": 0,
  "id": "8d4db461-d344-44dc-8deb-5a30d4e71442",
  "name": "J Diskarté Anonymous TV",
  "youTubeChannelId": "UC036geW9nwCvqoPWpDsMuQA",
  "episodes": [
    {
      "id": "231bebaa-641f-4e38-8f9e-2dffec5b30c4",
      "title": "The End of Apollo Quiboloy Kingdom of Jesus Christ CULT",
      "description": "In the following video, we will dissect the story of Apollo Quiboloy. Apollo Quiboloy is a pastor of a church that is by the name of the Kingdom of Jesus Christ. It is a modern-day cult that believes in essentially one-ness Pentecostalism. \n\nA monotheistic cult with a pastor who claims to be the appointed son of God. Not only does he think he is the appointed son of God, but he believes he has a deity and should be worshipped. \n\nAnd you know, no one here to blame him for what he thinks is true. However, his lifestyle is one thing to question. It\u0027s one thing to say, you know, that you are the Christ of the modern day. But it\u0027s another thing to say that you are the Christ of the modern day, but you also engage in sex trafficking, money laundering, immigration fraud, and marriage fraud, and you are somehow on the FBI\u0027s most wanted list. It\u0027s tough to draw the line where you can convince us that you are the son of God. Still, as we say in America, everybody is innocent until proven guilty, even though they are treated like they are guilty until proven innocent. \n\nHe flew by his whole life, lying and stealing from the poorest people in the world. He was a snake at the beginning and middle of his life and is still a snake today. Having lived a lavish life of luxury for the past 30 years, it\u0027s only happened that four years ago, something finally caught on the federal government\u0027s radar. He must have been slick for so long, but he was detained in Hawaii after being discovered with over 350,000 dollars in undeclared cash inside a briefcase and weapons. He hasn\u0027t been near the United States since he\u0027s wanted now by the Federal Bureau of Investigations. \n\nWhile he\u0027s been in hiding for quite some time, it has only been a few months since the Philippines started questioning if they should begin the investigation. And they finally did the right thing for once, and they investigated. It was definitely guilty of crimes against women and crimes against children. And there are several more crimes that he has yet to be charged for. This video is not an overall of what\u0027s happening, but it will show you what is happening to him. At the end of the video, there\u0027s a sneak peek at what happened to Apollo Quiboloy and what made him turn this way, a story that has never been told. \n\nThank you to @Rappler for providing 95% of this content. I just added my spice to it with jokes. Please subscribe to @Rappler  To keep up with current events and get real news! I hope Rappler starts uploading their content on Rumble! We need that!",
      "release": "2024-03-19T16:45:13Z",
      "duration": "00:20:44",
      "explicit": false,
      "youTubeId": "y6goALpQz8E",
      "subjects": [
        "Apollo Quiboloy"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=y6goALpQz8E"
      }
    }
  ]
}