{
  "_ts": 0,
  "id": "d8c96074-6fa9-4c83-b6cc-c426d30fe264",
  "name": "James Jani",
  "youTubeChannelId": "UCT0dmfFCLWuVKPWZ6wcdKyg",
  "episodes": [
    {
      "id": "9c59fe9f-8015-4d5d-b934-9b37605ffb55",
      "title": "Inside an Investment Cult.",
      "release": "2024-09-25T17:00:26Z",
      "duration": "00:57:47",
      "explicit": false,
      "youTubeId": "7LPuXowifJ4",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7LPuXowifJ4"
      }
    },
    {
      "id": "43298188-9496-469d-be07-bfafa3eca35e",
      "title": "The Multilevel Marketing Cults: Lies, Pyramid Schemes, and the Pursuit of Financial Freedom.",
      "description": "► 💻2 Free Weeks of Skillshare Premium: https://skillshare.eqcm.net/Kr3Yn\n\nMulti Level Marketing (MLM) companies have been around for a long while now. Yet their controversy seems endless, with accusations of being pyramid schemes, or operating in a cult like fashion… \n\nIt’s time we dive into the MLM industry and find out exactly what is going on… \n\n******\n►  Become a Patron for behind the scenes, Q\u0026A\u0027s, and editing tutorials: https://www.patreon.com/jamesvj\n\n💻Where I began Learning How to Edit \u002B Other Clases (Skillshare)\n► https://skillshare.eqcm.net/Kr3Yn\n\n📦 Download my Video Editing Templates:\n►  https://www.jamesjani.com/shop/\n\n📹 My Equipment:\n►https://bit.ly/2OfHCTO\n\n🎶 Where I Get My Music:\n►Epidemic Sounds - https://www.epidemicsound.com/referral/5uqnji\n\n🔧 Helpful tool for YouTubers (TubeBuddy):\n►  https://www.tubebuddy.com/Jamesvj\n\n💼 Job Opportunities: \n► https://jamesjani.notion.site/James-Jani-Hiring-Hub-b669861daa0b4b3bbe60b6515aab418b\n\n\n***\n𝗟𝗘𝗧\u0027𝗦 𝗖𝗢𝗡𝗡𝗘𝗖𝗧:\n📸 IG: james.v.j // https://bit.ly/2TOaBBC\n🐦 Twitter: @jamesvjani // https://bit.ly/2zYPrsT\n\n\n\n******\n𝐒𝐨𝐮𝐫𝐜𝐞𝐬/𝐂𝐥𝐢𝐩𝐬 𝐔𝐬𝐞𝐝:\n►WHY I QUIT THE MLM INDUSTRY AT THE TOP | ANTI-MLM HORROR STORY\nhttps://bit.ly/2YHkt1T\n\n►The MLM \u0022Girl Boss\u0022 Narrative is a Lie\nhttps://bit.ly/3jjSz3H\n\n►Why Women Are Quitting Their Side Hustle: Leaving LuLaRoe\nhttps://bit.ly/3lmXSkM\n\n►Multilevel Marketing: Last Week Tonight with John Oliver (HBO)\nhttps://bit.ly/3je16Fk\n\n******\n📹𝗠𝘆 𝗘𝗾𝘂𝗶𝗽𝗺𝗲𝗻𝘁: https://bit.ly/2OfHCTO\n\n📚 𝐌𝐨𝐬𝐭 𝐈𝐧𝐟𝐥𝐮𝐞𝐧𝐭𝐢𝐚𝐥 𝐁𝐨𝐨𝐤𝐬 𝐈 𝐇𝐚𝐯𝐞 𝐑𝐞𝐚𝐝: https://bit.ly/33pDvw7\n\n🎶 𝐌𝐮𝐬𝐢𝐜 𝐔𝐬𝐞𝐝: \nEpidemic Sounds - https://bit.ly/2SblgUB \nArtlist - https://bit.ly/2IzPbVo \nOutro: My My Snake Eyes (Feat. Malena Stark) - The Darkness Of The Light\n\n\n\n******\nThese companies follow a Multi-Level Marketing model, that means they often do not sell their products/services via retailers, but through a workforce of people sometimes called their “distributors”. This strategy is also often labelled as Network Marketing. \n\nExamples of these companies are: Herbalife, Amway, ACN, Younique, LuLaRoe, Arbonne, Beachbody, doTerra, Mary Kay, Nu Skin, etc. \n\nAlthough it seems ordinary on the surface, many of these companies have received a great amount of backlash, with entire communities built to oppose these companies (often labelled as the anti-mlm community). \n\nThe question here is: why the backlash? \n\nIn this video we dive into the industry and the reasoning behind the backlash, as well as the shady practices some MLM companies use in order to keep their distributors inside the company. \n\nSome of these practices include the selling of a “dream” and promises of high returns, wealth, residual income, or “financial freedom” if they join, whilst simultaneously promoting many self-help concepts. \n\nWe also take a look at what exactly a Pyramid Scheme is, how to spot one, and whether the accusations against network marketing companies are deserved. \n\nThe pursuit of wealth and financial freedom can often be consuming – the question is who out there is choosing to exploit these desires… \n\n\n******\n🙏 Special thanks to everyone who agreed to be interviewed and helped me out for my research on this video. \n\nAlso big thank you to @rubensalsaa (on Instagram) for helping me sort through my research and the countless clips! \n\n******\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement is intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please contact me via my email in the \u0022about\u0022 page on my channel.\n\nSPONSORSHIP DISCLOSURE: This video was sponsored by Skillshare. \n\nAFFILIATE DISCLOSURE: there may be a few links in this description that, at no cost to you, will earn me a commission if you choose to click them and make a purchase 🙂\nDon’t worry – I only ever promote things that have genuinely helped me.\n\nCopyright © James Jani 2020\n\n\n******\nPrologue - 00:00\nPart 1: The Pitch - 03:17\nPart 2: The Opportunity  - 6:20\nAd Break - 14:06\nPart 3: The Industry - 15:49\nPart 4: Pyramid Schemes \u0026 Cults - 18:36\nPart 5: Unravelling the Truth - 22:37\nEnd/Bloopers - 27:47",
      "release": "2020-08-16T17:00:04Z",
      "duration": "00:29:41",
      "explicit": false,
      "youTubeId": "He1bgJ0sqtw",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=He1bgJ0sqtw"
      }
    }
  ]
}