{
  "_ts": 0,
  "id": "84792f11-5541-423f-b0d4-77b3fbf90593",
  "name": "Jana Brock",
  "youTubeChannelId": "UChHFAakoHY42nGc1hpqnVqQ",
  "episodes": [
    {
      "id": "63edb735-0431-4469-98ef-f6e390661893",
      "title": "Raised In A Cult - Part 2",
      "description": "This video is PART 2 of my Raised In A Cult series. I was born into Armstrongism - a high demand religion many labeled as a cult. I was the third generation in my family to become a member. Herbert W. Armstrong died when I was 19. My entire childhood was spent adhering to his original, manipulative, controlling, isolating teachings. \n\nWhen I was 26, I broke free and so did my parents. My siblings were already out by that time. It would take several decades before therapists could help me begin to understand why I thought the way I did, why intimate relationships always failed and why I reacted so harshly to the world around me.\n\nThere is no way to measure how many people have suffered needlessly because of high-demand religions (aka cults) and their harmful teachings. \n\nMany bible-based churches are nothing like what I learned growing up. They are filled with good people who have good intentions and live good lives. If you choose to go to church,  hopefully you can find one of them.\n\nBe well,\n\nJana\n\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\n\nThere is very limited, unbaised documentation about the early years of on Armstrongism - the orignal teachings. I was raised with those teachings. Many other families joined much later. As I said in this introduction video, my paternal grandparents were among the handful of people when the first church was founded here in the Pacific Northwest. My roots in this religion are deep.\n\nMuch information about Armstrongism is inaccurate or based on experiences of those who attended the church after it was so-called \u0022reformed\u0022. Some information is more accurate. See below:\n\nhttps://youtu.be/zTAPoFuOpp0?si=qMqEYIY909-_R7LI \n\nhttps://en.wikipedia.org/wiki/Herbert_W._Armstrong#cite_note-96 \n\nhttps://hwarmstrong.com/1-article-index.htm \n\n_______________________________________________________\nBooks by Jana Brock:\n\nBunny Conversations, The Entertaining Dialogue of Pet Rabbits\nJust Keep Breathing, A Journey Through Grief and Recovery - Second Edition\nOlder Generations in the Digital Age (eBook - available on my website soon!)\n\nJana\u0027s Website:\nJanabrock.com\n\n**************************\n\nFAIR USE ACT INFORMATION. ALL COPYRIGHTS BELONG TO THEIR RESPECTIVE OWNERS.** Jana Brock may not own the copyright for some of the pictures or videos used in this video. Copyright Act of 1976 17 U.S.C. § 107 allows for the use of work that is used for comment, criticism, or education. All original writing is copyrighted and is the propety of Jana Brock. All rights reserved. \n\nFAIR USE: Some content displayed on this video/site may contain copyrighted material the use of which has not been specifically authorized by a copyright owner. If this is the case, it is an error on channel creator\u0027s part. She will remove any copyrighted material immediately should a valid claim be presented. Please contact channel creator to request that material be removed if copyrights are discovered. Contact information is available on janabrock.com.\n\nThis content has been produced for entertainment and/or educational purposes. Some content on this channel is intended only for entertainment. This video is protected under the FAIR USE ACT because its purpose is to inform, educate or entertain the public. Channel creator shares owns all original writing and has copyrighted it prior to sharing publicly. \n\nThe content on this channel was not made for children under the age of 18. Jana Brock does not intentionally publish content that would offend, or adversely affect, younger viewers or any other viewers. Content is specifically written, produced and published for adult audiences who have an interest in the writings and content published by Jana Brock. Thank you to all the amazing artists and photographers who contribute their work royalty and copyright-free for public use. All Content is for educational and/or entertainment purposes.",
      "release": "2025-03-30T23:35:17Z",
      "duration": "00:10:27",
      "explicit": false,
      "youTubeId": "yG16DnRG57o",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yG16DnRG57o"
      }
    },
    {
      "id": "73674699-0baf-4007-8e9b-907f34bd7047",
      "title": "Raised In A Cult - Part One",
      "description": "This video is the introduction to a series I intend to publish about a very specific high demand religion. Since the leader\u0027s death, the church I was raised in splintered off into other churches. \n\nHowever, many family members on my dad\u0027s side went with the splinter groups that still adhere to the nonsense I was taught growing up. I know the people in this documentary about the original Armstrong church, which  my grandparents helped start: https://youtu.be/XLQRIUU9-9c?si=znYH3-e3O2hZV7ax \n\nThe documentary (called to be free) was focused on doctrinal errors. That’s all well and good for the paid ministers who had to admit they were wrong, but it does nothing to correct the immense harm inflicted on countless families around the world - including needless deaths and severe, permanent disabilities of the people who were told not to seek medical care. And the trauma suffered by countless kids due to a long list of harm done to them in the shadows. \n\nThere is no way to know how many people have suffered needlessly because of high-demand religions (aka cults) and their harmful teachings. \n\nMany bible-based churches are nothing like what I learned growing up. They are filled with good people who have good intentions and live good lives. If you choose to go to church,  hopefully you can find one of them.\n\nBe well,\n\nJana\n\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\n\nThere is very limited, unbaised documentation about the early years of on Armstrongism - the orignal teachings. I was raised with those teachings. Many other families joined much later. As I said in this introduction video, my paternal grandparents were among the handful of people when the first church was founded here in the Pacific Northwest. My roots in this religion are deep.\n\nHere is some topical information, for those interested:\n\nhttps://en.wikipedia.org/wiki/Herbert_W._Armstrong#cite_note-96 \n\nhttps://hwarmstrong.com/1-article-index.htm \n\n\n\n\n\n\n\n_______________________________________________________\nBooks by Jana Brock:\n\nBunny Conversations, The Entertaining Dialogue of Pet Rabbits\nJust Keep Breathing, A Journey Through Grief and Recovery - Second Edition\nOlder Generations in the Digital Age (eBook - available on my website soon!)\n\nJana\u0027s Website:\nJanabrock.com\n\n**************************\n\nFAIR USE ACT INFORMATION. ALL COPYRIGHTS BELONG TO THEIR RESPECTIVE OWNERS.** Jana Brock may not own the copyright for some of the pictures or videos used in this video. Copyright Act of 1976 17 U.S.C. § 107 allows for the use of work that is used for comment, criticism, or education. All original writing is copyrighted and is the propety of Jana Brock. All rights reserved. \n\nFAIR USE: Some content displayed on this video/site may contain copyrighted material the use of which has not been specifically authorized by a copyright owner. If this is the case, it is an error on channel creator\u0027s part. She will remove any copyrighted material immediately should a valid claim be presented. Please contact channel creator to request that material be removed if copyrights are discovered. Contact information is available on janabrock.com.\n\nThis content has been produced for entertainment and/or educational purposes. Some content on this channel is intended only for entertainment. This video is protected under the FAIR USE ACT because its purpose is to inform, educate or entertain the public. Channel creator shares owns all original writing and has copyrighted it prior to sharing publicly. \n\nThe content on this channel was not made for children under the age of 18. Jana Brock does not intentionally publish content that would offend, or adversely affect, younger viewers or any other viewers. Content is specifically written, produced and published for adult audiences who have an interest in the writings and content published by Jana Brock. Thank you to all the amazing artists and photographers who contribute their work royalty and copyright-free for public use. All Content is for educational and/or entertainment purposes.",
      "release": "2025-03-29T20:46:24Z",
      "duration": "00:08:25",
      "explicit": false,
      "youTubeId": "C2z7Uo-9s-w",
      "subjects": [
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=C2z7Uo-9s-w"
      }
    }
  ]
}