{
  "_ts": 0,
  "id": "57eb2a49-82d5-4ec2-a8f5-101df26ea474",
  "name": "Jasper Brown",
  "youTubeChannelId": "UCXiV5uTv1hxbeyr7jZB2Jpg",
  "episodes": [
    {
      "id": "54a1ba4e-5cbc-4aac-810c-67dacbdd4147",
      "title": "I Joined a Cult: Part 1 - My Journey of Recovery and Sense Making",
      "description": "In this first part of my story, I open up about how I got involved in a tantric yoga cult. What began as a sincere desire to awaken, heal, and connect with the divine slowly evolved into a system of control, dogma, and manipulation. I was spiritually naive, emotionally vulnerable, and lacking the tools to discern real truth from charismatic illusion. \n\nThis is the story of how I got pulled in, what I learned about human psychology and power, and how I’ve been slowly making sense of it all — not from bitterness, but from integration.\n\n🎧 Check out The Awakened Evolution Podcast: https://awakenedevolution.org/podcast\n\n🔥 Learn more about working with me: https://awakenedevolution.org/one-on-one\n\n⚔️ Check out The Conscious Masculine Online Course and Men\u0027s Community. https://courses.thelegendarylover.com... \n\n❤️‍🔥 Check out The Legendary Lover Online Course https://courses.thelegendarylover.com... \n\n⚡️ Follow me on Instagram for daily insights and updates: https://www.instagram.com/the_jasper_brown/\n\n 🔗 Important Links: Free trainings and more info about the work I do, including men\u0027s coaching, retreats and more. https://stan.store/awakened_evolution\n\nIn this video, I share Part 1 of my personal journey of joining — and eventually leaving — a tantric yoga cult. This story explores the early stages of spiritual seeking, the psychological dynamics of cults, and the vulnerable mindset that made me susceptible to charismatic leaders and ideological belief systems. I discuss my experience inside the high-control group, the red flags I ignored, and the deeper process of recovery, integration, and spiritual sensemaking that followed. If you’ve ever struggled with spiritual abuse, dogmatic teachings, or the dark side of awakening, this video is for you. Keywords: tantric cult experience, cult recovery, spiritual manipulation, dogma, sensemaking, tantra, spiritual abuse, leaving a cult, spiritual awakening journey.",
      "release": "2025-04-21T08:37:22Z",
      "duration": "00:12:34",
      "explicit": false,
      "youTubeId": "AAw3jdc1ga8",
      "subjects": [
        "Yoga Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AAw3jdc1ga8"
      }
    }
  ]
}