{
  "id": "b1f42e94-b207-4f51-a318-caf852e8f501",
  "name": "Jayda Hope",
  "youTubeChannelId": "UCZHUxo1BIezsFxCeGNeysqA",
  "episodes": [
    {
      "id": "e1b621ad-c037-4d4b-8f4e-5ac9d07aaebb",
      "title": "Mary Cosby MUST Be Stopped | The Cult Of The Real Housewife",
      "description": "On January 1st, 2026, TLC dropped what was supposed to be an explosive, jaw dropping three part documentary on Real Housewives of Salt Lake City breakout star Mary Cosby; and yet it fell flat. Despite the network having an overwhelming amount of material to work with, they decided to go with a dramatic compilation, rather than the hard hitting investigative documentary fans were not only craving, but waiting for. Most of the information shared within the series had been documented by content creators for years prior to it\u0027s release. TLC dropped the ball in some pretty major ways, including but not limited to: using content from online creators without their knowledge, consent, or compensation, refusing to acknowledge that Mary can be both a victim and a perpetrator, and missing important information crucial to understanding the web woven between Mary Cosby, Real Housewives of Salt Lake City, and Faith Temple Pentecostal Church. Unfortunately, this documentary is not the only thing that has a thick cloud named controversy hanging over its head.\n\nMary Cosby has been surrounded with an insane amount of controversy the moment she was introduced on our TV screens. Whether it be the fact that she is married to her step grandfather 20 years her senior (who has played a paternal role in her life since she was 3 years old), her unique and expensive fashion taste, or the fact that she is a pastor who runs an alleged cult in Utah; Mary remains proudly in denial of who audiences experience her to be. Despite everything alleged in this video, and the documentary, it is important to note that Mary and Robert Cosby have not been charged with, or convicted of any crimes related to any of the allegations outlined in this video as of January 13th, 2026.\n\nIn this video, we analyze, and give commentary on the documentary itself while bringing in outside research, and personal experiences to give a much more rounded picture than the documentary on it\u0027s own. As usual, it is important to come to your own conclusions on the information shared, and be sure to let me know your thoughts, feelings and opinions down in the comments below.\n\nAnt Hill Kids Cult: https://youtu.be/DQ6_9s6rQXc\nInquiries: Jayda.Hope.Biz@Gmail.com \nFind Me On Instagram: https://www.instagram.com/jayda_isha/?hl=en\nBecome a Channel Member For Exclusive Perks: https://www.youtube.com/channel/UCZHUxo1BIezsFxCeGNeysqA/join\nFind Girl, You Haven\u0027t Heard on Apple Podcasts: https://podcasts.apple.com/us/podcast/girl-you-havent-heard-true-crime-black-history/id1585227039 \nFind Girl, You Haven\u0027t Heard on Spotify: https://open.spotify.com/show/31X49pkXs4BgFiowYJQReP\nBecome a Patron: https://www.patreon.com/girlyouhaventheard\n\n00:00 Background Information\n01:35 Episode One\n02:38 RHOSLC\n03:46 Preacher Mary\n35:38 Episode Two\n48:17 Brotherhood Meetings\n52:39 Mary Is A Liar\n1:12:20 Episode Three\n1:45:07 TLC Dropped The Ball",
      "release": "2026-01-14T03:23:01Z",
      "duration": "01:54:41",
      "explicit": false,
      "youTubeId": "DFRpX8N8UIs",
      "subjects": [
        "Faith Temple Pentecostal Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DFRpX8N8UIs"
      }
    }
  ]
}