{
  "id": "f7c569e7-6f68-4def-8998-bf03974701de",
  "name": "JaySHess",
  "youTubeChannelId": "UCjcQWQW1ZsVG-p9ufjqtn2Q",
  "episodes": [
    {
      "id": "45e9c2c6-d33d-441c-b470-6ddd78db81a7",
      "title": "Are Jehovah\u0027s Witnesses really false prophets?",
      "description": "Discuss the claim of Jehovah\u0027s Witnesses that their organization alone has been chosen by Jehovah God since 1919 to tell the nations of the earth about God and his requirements for everlasting life. Use their publication \u0022The Nations Shall Know that I am Jehovah - How? chapters 4 \u0026 12 along with Deuteronomy 18:20-22.\n\nFrom that book \u0022The Nations shall know that I am Jehovah - How?\u0022\nIn chapter 4 they claim their leaders were chosen to speak as a prophet in God\u0027s name.\nhttps://wol.jw.org/en/wol/d/r1/lp-e/1101971004?q=%22Jehovah\u002Bcommissioned\u002Bthis\u002Bdedicated\u002Bbaptized\u002Banointed\u002Bclass\u002Bof\u002Bservants\u002Bto\u002Bspeak\u002Bto\u002Ball\u002Bthe\u002Bnations\u002Bin\u002BHis\u002Bname%22\u0026p=par\n\nFrom Chapter 12 (\u0022Until He Comes Who Has The Legal Right\u0022) .\np.216  \u0022Jehovah\u0027s \u0027Sword\u0027 against \u0027all those of flesh\u0027\npar 9: \u0022Shortly, within our twentieth century, the \u0027battle in the day of Jehovah\u0027 will begin against the modern antitype of Jerusalem, Christendom. ...\nhttps://wol.jw.org/en/wol/d/r1/lp-e/1101971012?q=%E2%80%9Cwithin\u002Bour\u002Btwentieth\u002Bcentury\u002Bthe\u002Bbattle\u002Bin\u002Bthe\u002Bday\u002Bof\u002BJehovah\u002Bwill\u002Bbegin\u002Bagainst\u002Bthe\u002Bmodern\u002Bantitype\u002Bof\u002BJerusalem\u002BChristendom%22\u0026p=par#h=12\n\npar 10: \u0022However, Jehovah\u0027s \u0027sword\u0027 will not be applied merely to those adhering to Christendom. It will also be brandished against \u0027all flesh from south [Christendom] to north.\u0027 Religionists belonging to all the rest of the world empire of false religion will feel the cutting edge of Jehovah\u0027s \u0027sword\u0027. ... They will not be left to gloat over the destruction of Christendom as a rival religious system.\n\npar 11: \u0022... As the \u0027battle in the day of Jehovah\u0027 against all false religion gets closer ...\u0022\n\npar 14: \u0022... When, not before very long, the authentic report is published that Jehovah\u0027s executional \u0027sword\u0027 has actually brought about the utter ruin of Christendom ...\u0022\n\npar 15\u0022 \u0022... The modern-day remnant of Jehovah\u0027s anointed witnesses are calling attention to this notable \u0027sword\u0027 that Jehovah will unsheath against the organization of hypocritical Christianity, as the prophet Ezekiel was told to do ... \u0022Son of man, prophesy, ... For the purpose of organizing a slaughter it has been sharpened ...\u0022\n\npar 54: \u0022... they will be brought to eternal ruin in the \u0027war of the great day of God the Almighty\u0027  \u0022",
      "release": "2010-03-22T05:39:07Z",
      "duration": "00:10:08",
      "explicit": false,
      "youTubeId": "s-MVRD0V5OA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=s-MVRD0V5OA"
      }
    }
  ]
}