{
  "id": "b00caf60-ac7e-4edc-be8c-7b9e5c40abb9",
  "name": "Jeffrey Epstein:  The Coverup Chronicles",
  "spotifyId": "66Ufrq2B9ehCO6F9YwQoPm",
  "appleId": 1800917451,
  "episodes": [
    {
      "id": "65708c46-2ef9-4710-b220-c33b239a0d25",
      "title": "R. Kelly Was Hit With RICO Charges.  Why Wasn\u0027t Ghislaine Maxwell? (10/6/25)",
      "description": "Critics have long pointed out the glaring double standard between how the federal government prosecuted R. Kelly and how it handled Ghislaine Maxwell. R. Kelly was charged under the RICO statute—a law designed for organized crime syndicates—because prosecutors argued his entourage operated like a criminal enterprise built to recruit, control, and silence victims. The government presented his staff, managers, and associates as part of a coordinated system enabling his abuse, using racketeering charges to reflect the organized and ongoing nature of his crimes. This strategy allowed prosecutors to bring in decades of conduct and establish a broader pattern of criminal enterprise, ultimately securing a conviction that led to a 30-year sentence.\n\nYet, when it came to Ghislaine Maxwell and Jeffrey Epstein, no such RICO framework was used—despite evidence of an operation that spanned decades, involved private jets, shell companies, multiple properties, and a network of employees who allegedly procured and groomed victims. Critics argue the decision not to pursue racketeering charges against Maxwell and Epstein’s wider circle protected powerful individuals who might have been implicated as co-conspirators in an enterprise. The government instead treated Maxwell’s case as a narrow trafficking conspiracy, conveniently sidestepping the far-reaching implications that a RICO indictment would have carried for Epstein’s broader network of enablers and clients.\n\nto contact me:\n\nbobbycapucci@protonmail.com",
      "release": "2025-10-06T16:05:07Z",
      "duration": "00:43:32",
      "explicit": false,
      "spotifyId": "5TZMgrR58vgdmVmZMhc6zF",
      "appleId": 1000730434460,
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TZMgrR58vgdmVmZMhc6zF",
        "apple": "https://podcasts.apple.com/podcast/r-kelly-was-hit-with-rico-charges-why-wasnt-ghislaine/id1800917451?i=1000730434460"
      }
    }
  ]
}