{
  "id": "33c2b141-9452-41bf-b665-64a8cb318eab",
  "name": "jenesis productions",
  "youTubeChannelId": "UCRZcgJ-606FJWEXnZLqtzcg",
  "episodes": [
    {
      "id": "1e4a3f07-1dc0-4ba2-908e-31d24eefada1",
      "title": "Daystar Scandal: \u0026quot;Pete\u0026#39;s\u0026quot; Polygraph Examiner Speaks",
      "description": "“Overly dramatic” is how a polygraph examiner described Daystar’s Lamb family. \n\nIn this exclusive release, we’re sharing a phone call with the man who conducted a polygraph on “Pete.”. The conversation took place in December 2024, during the height of the scandal involving Daystar Television Network. Part of the shocking claims included allegations that “Pete” SA’d a child in the Lamb family. \n\nThis call is being released now—months after it happened—because the investigation has concluded. Last week, the Colleyville Police Department announced the case was closed. No charges were filed, but the case could be reopened if new information comes to light. \n\nIn this call, retired Mansfield, TX police officer Ralph Standefer answers questions about “Pete’s” polygraph, some of which have been widely speculated about on social media. \n\n*** Any comments that disclose the identify of the child will be deleted.***",
      "release": "2025-05-23T04:23:22Z",
      "duration": "00:06:33",
      "explicit": false,
      "youTubeId": "o8l-J5m_C70",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o8l-J5m_C70"
      }
    },
    {
      "id": "85f0c451-9e5b-4fc2-80d0-d17cb4abe336",
      "title": "Daystar Board Meeting: New Recording Released",
      "description": "There is a lot to unpack in a secret recording from a Daystar board meeting that has not previously been released and contains new details. Among them:\n- Doug Weiss\u0027 polygraph, in which he was asked a blunt question about Joni Lamb.\n- How Joni confronted Marcus Lamb about his lengthy affair with an employee, and how he reacted.\n- Whether Doug Weiss counseled Marcus and Joni through their marital challenges.\n- Anna Kendall\u0027s (\u0022Red Wig\u0022) impression when she met Doug\u0027s former wife, Lisa. \n- Why God \u0022clapped His hands\u0022 at Joni Lamb.\n\nThis recording is from an emergency board meeting held on August 29, 2023. The purpose of the meeting was to discuss how to publicly address the absence of Jonathan and Suzy Lamb from Daystar\u0027s program, Ministry Now. Board chair Joni Lamb and board members Arnold Torres and Jonathan Lamb were in attendance in person. Board member Tom Calender participated earlier in the meeting by phone to discuss Jonathan and Suzy\u0027s situation, but hung up before this lengthy portion of the conversation.",
      "release": "2025-05-10T02:32:50Z",
      "duration": "00:22:44",
      "explicit": false,
      "youTubeId": "0AYAP6-lbcA",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0AYAP6-lbcA"
      }
    },
    {
      "id": "2009ed7d-a3be-4459-9840-c31232cd3135",
      "title": "Daystar Scandal: Donations \u0026amp; Denials",
      "description": "A longtime donor asked Daystar Television Network for her money back. The answer was no, but not before a lengthy email response blasted Jonathan Lamb as having a \u0022corrupt spirit of greed\u0022 and stated that police concluded their investigation into a child\u0027s SA. Find out if that is true in this short video.\n\nTo read the article on the donor\u0027s request, visit The Roys Report: https://julieroys.com/embattled-daystar-tv-refuses-to-refund-donations-says-jonathan-lamb-has-corrupt-spirit-of-greed-and-power/\n\nThis video is transformative and intended for the purpose under Section 107 of the Copyright Act, including: commentary, criticism, entertainment and research. Fair Use is permitted by copyright statute that might otherwise be infringing.\n\nMusic credit: \u0022Magistar\u0022 Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/",
      "release": "2025-04-26T19:55:42Z",
      "duration": "00:08:06",
      "explicit": false,
      "youTubeId": "k0DqYqSEpyE",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k0DqYqSEpyE"
      }
    },
    {
      "id": "65a5510b-d571-4880-897e-3044f0502696",
      "title": "Dishing with the Dead at Daystar",
      "description": "Do you believe dead people can communicate with the living? Daystar Television Network, a Christian broadcasting ministry, apparently thinks so. \n\nDeceased spouses have communicated with people who talked about the experience. Joni Lamb recalls hearing from her husband, Marcus, who passed away in 2021. A recent guest had a visitation from her future husband’s dead wife. \n\nIs speaking with the dead scriptural? Watch the video and leave your comments. \n\nThis video is transformative and intended for the purpose under Section 107 of the Copyright Act, including: commentary, criticism, entertainment and research. Fair Use is permitted by copyright statute that might otherwise be infringing.\n\nMusic credit: \u0022Magistar\u0022 Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/",
      "release": "2025-04-09T23:00:19Z",
      "duration": "00:10:35",
      "explicit": false,
      "youTubeId": "QZcEwNl7-Mc",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QZcEwNl7-Mc"
      }
    },
    {
      "id": "6eb5d6d0-b848-457c-b512-8b7024ca9180",
      "title": "Where is Janice Smith? [Marcus Lamb\u0026#39;s Mistress]",
      "description": "Daystar Television Network is no stranger to scandal. The founder of the Christian network had a seven year affair with employee Janice Smith.  It shocked followers years ago and now that illicit relationship is taking social media by storm. The reason? The whistleblower has come forward  to talk about the epic fallout publicly for the first time. \n\nMarcus Lamb‘s mistress, Janice Smith, vanished. No one seemed to know what happened to her after she was banished from Daystar because of the illicit relationship.  \n\nWe found Janice Smith and will reveal details in this video about her life after the scandal.  \n\nBe sure to watch the entire video and leave comments. \n\nOther must-see videos: a deep dive into the hot mess at Daystar Television Network: Breaking the Silence of the Lambs \nhttps://youtu.be/Ln5Jlu5TlaU\n\n\nThe Top 10 Jaw-dropping Moments in Daystar Scandal: https://youtu.be/RUi8VzcXvVI?si=fXupomOOerwtVFoV\n\n\n\nThis video is transformative and intended for the purpose under Section 107 of the Copyright Act, including: commentary, criticism, entertainment and research. Fair Use is permitted by copyright statute that might otherwise be infringing.\n\n“Undaunted\u0022 Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/",
      "release": "2025-03-18T15:00:46Z",
      "duration": "00:13:15",
      "explicit": false,
      "youTubeId": "Prr_k-rSM80",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Prr_k-rSM80"
      }
    },
    {
      "id": "b00d3c99-bcbb-4d29-a053-3323eea28c40",
      "title": "Joni Lamb: Let\u0026#39;s Talk About Sex",
      "description": "Joni Lamb, the president of Daystar Television Network, has denied sexting with divorced sex therapist Doug Weiss during their romance. However, in an audio clip that hasn\u0027t been released until now,  Joni admits reading racy texts from Doug to her daughter-in-law,  Suzy Lamb. The contents of those texts were troubling enough for Suzy to seek pastoral counsel over them.\n\nAdditionally, former family friend Denise Boggs was shocked by something Joni Lamb said her betrothed told her.  Finally, preacher and friend Rodney Howard-Browne raised a stink about whether sexting was going on between the sexagenarians. \n\nLord, have mercy! 👀",
      "release": "2025-03-11T15:01:13Z",
      "duration": "00:09:56",
      "explicit": false,
      "youTubeId": "puetQ5c3Ick",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=puetQ5c3Ick"
      }
    },
    {
      "id": "968126b2-2e76-4562-ba4e-0334b5f90d98",
      "title": "“If Anything Happens…” Marcus Lamb’s Final Wishes Email",
      "description": "“It is mine and Joni\u0027s desire that our children are always involved as the leadership of Daystar.”\n\nMarcus Lamb, the founder of Daystar Television Network, left specific instructions about the future of the network and who should carry on his legacy after his death. \n\nA recently-obtained email outlines his plans in great detail. \n\nAn in-depth report on the Daystar scandal with this information and more can be found here: \n\nhttps://youtu.be/Ln5Jlu5TlaU?si=6XzugS7doCeTzsOI\n\n\n\nThis video is transformative and intended for the purpose under Section 107 of the Copyright Act, including: commentary, criticism, entertainment and research. Fair Use is permitted by copyright statute that might otherwise be infringing.\n\n“Undaunted\u0022 Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/",
      "release": "2025-03-09T16:21:58Z",
      "duration": "00:05:42",
      "explicit": false,
      "youTubeId": "5qM0eoGXI5M",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5qM0eoGXI5M"
      }
    },
    {
      "id": "5dba31d9-979e-4447-972f-94074118bb57",
      "title": "Breaking the Silence of the Lambs [Inside the Daystar Scandal]",
      "description": "There is no longer silence of the Lambs in a shocking scandal at \nDaystar, the second-largest Christian broadcasting network in the country. \n\nMarcus Lamb, the founder of Daystar, left specific instructions about the future of the network and who should carry on his legacy after his death. The Christian broadcasting dynasty has been embroiled in a public family feud since his passing and the remarriage of his wealthy widow.  \n\nThe Lamb family feud has blown up on social media and involves allegations of a SA coverup, misuse of ministry funds, and a family brawl over whether Joni Lamb’s marriage to divorced sex therapist Doug Weiss is biblical...or not.\n\nHere are links to background articles: \nhttp://jenesisproductions.com/2024/05/17/the-unsilence-of-the-lambs/\n\nhttp://jenesisproductions.com/2024/06/08/fifty-shades-of-dr-doug/\n\nhttp://jenesisproductions.com/2024/06/27/the-truth-shall-set-you-free/\n\nTop 10 Jaw-dropping Moments in Daystar Scandal: https://youtu.be/RUi8VzcXvVI?si=fXupomOOerwtVFoV\n\nJoni Lamb/Doug Weiss Romance Timeline: https://youtu.be/92FdgC2zVP8?si=EWocNG7Bp1yyusAj\n\n\n\nThis video is transformative and intended for the purpose under Section 107 of the Copyright Act, including: commentary, criticism, entertainment and research. Fair Use is permitted by copyright statute that might otherwise be infringing.\n\n“Undaunted\u0022 Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/",
      "release": "2025-03-09T15:00:21Z",
      "duration": "00:46:47",
      "explicit": false,
      "youTubeId": "Ln5Jlu5TlaU",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ln5Jlu5TlaU"
      }
    },
    {
      "id": "f375a611-3ce7-4abd-a172-574d257726fd",
      "title": "Inside Daystar: the Bible vs the Boardroom",
      "description": "The public battle between Joni Lamb and her son and daughter-in-law started over their refusal to read a viewer comment praising her new husband during a live broadcast in July 2023. Jonathan and Suzy Lamb opposed the marriage of Daystar’s CEO to divorced sex therapist Doug Weiss on biblical principles. The couple was immediately removed from Ministry Now and Suzy was fired. Jonathan was demoted and eventually terminated, too. Did Daystar violate the couple\u0027s religious rights?\n\nAn audio recording of a board meeting on November 16, 2023 raises questions about whether Daystar backpedaled on those disciplinary actions. The Civil Rights Act prohibits religious discrimination in the workplace. Attorney John Lynch told Jonathan Lamb he had no legal claim, but Lynch and the board members reversed their position about Jonathan having to submit, and decided he did not have to read anything that violated his religious beliefs. Board members Tom Calender and Arnold Torres also spoke during the meeting. \n\nWhat do you think? Did Daystar change its mind because of potential legal issues? Was it a C.Y.A. move?",
      "release": "2025-03-03T16:00:40Z",
      "duration": "00:12:01",
      "explicit": false,
      "youTubeId": "blRQcJG1gh0",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=blRQcJG1gh0"
      }
    },
    {
      "id": "4593713f-1095-4f6e-8c25-53289b5c4364",
      "title": "Daystar Scandal: \u0026quot;Get Past it or Resign\u0026quot;",
      "description": "Jonathan Lamb wasn\u0027t given many options by Daystar\u0027s board of directors, lead by his mother, Joni Lamb. However, the comments in this video take the ultimatum he was given to a new level. Jonathan raised concerns over comments made by Joni Lamb about the SA of his child. Daystar\u0027s attorney John Lynch told him, \u0022You either get past it or you need to resign.\u0022",
      "release": "2025-02-22T16:00:52Z",
      "duration": "00:04:43",
      "explicit": false,
      "youTubeId": "p4QHqhLJE4M",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=p4QHqhLJE4M"
      }
    },
    {
      "id": "abb5fc9c-d0b0-49b7-ab21-8c7fd3cfadb8",
      "title": "Joni Lamb: \u0026quot;Let\u0026#39;s Just Say That I Married Out of The Will of God...\u0026quot;",
      "description": "There has been much controversy about the marriage of Daystar\u0027s Joni Lamb and divorced sex therapist \u0026 marriage counselor Doug Weiss. In this video, Joni Lamb opines before Daystar\u0027s board of directors and Jonathan Lamb what the consequences would be if they married out of God\u0027s will. \n\nShe also answers Jonathan\u0027s question about whether she is happier now that she was with his father, Marcus Lamb.",
      "release": "2025-02-21T21:30:51Z",
      "duration": "00:04:49",
      "explicit": false,
      "youTubeId": "BAXU3LfEAjM",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BAXU3LfEAjM"
      }
    },
    {
      "id": "f797f499-38d2-49d5-8d3c-3d8811518a31",
      "title": "Did Joni Lamb Cast a Spell on Live TV?",
      "description": "Daystar\u0027s Joni Lamb is raising eyebrows with a \u0022prophetic prayer\u0022 that is being compared to casting a spell or a curse. \n\n She read during a live broadcast of Ministry Now on February 19, 2025, while husband Doug Weiss repeated after her. The prayer from a trusted \u0022prophetic voice\u0022 sounded a lot like a curse, calling for suffering, blindness, etc., to punish  enemies. Apostle Kathryn Krick was a guest also recited the prayer/curse. \n\nIt certainly wasn\u0027t the type of prayer viewers would expect to hear on worldwide Christian television, especially a network that has a highly-promoted prayer line. \n\nI accepted the invitation to call the prayer line and we focused on the situation at Daystar. The conversation is included in the video.\n\n\nThis video is transformative in nature  and is intended for the purpose under Section 107 of the Copyright Act, including: commentary, criticism, entertainment and research. Fair Use is permitted by copyright statute that might otherwise be infringing.\n\n \u0022Magistar\u0022 Kevin MacLeod (incompetech.com)\nLicensed under Creative Commons: By Attribution 4.0 License\nhttp://creativecommons.org/licenses/by/4.0/",
      "release": "2025-02-20T16:38:47Z",
      "duration": "00:10:08",
      "explicit": false,
      "youTubeId": "TOWU7JsBZQY",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TOWU7JsBZQY"
      }
    },
    {
      "id": "1c1ea779-f6ec-4e4d-8cf8-a6f640295b44",
      "title": "Joni Lamb: The Lord Told Me...",
      "description": "Daystar\u0027s Joni Lamb heard from the Lord again and reveals what He told her in this video. Also, some namedropping of famous leaders in the ministry wold as she recites a list of big names who supported her marriage to divorced sex therapist Doug Weiss. However, three of the people Joni Lamb said approved of the marriage and gave their blessing have since left Daystar Television Network.\n\nDoug Weiss also claims support from Andrew Wommack, Paula White, James Robison and Jesse Duplantis in this video: https://youtu.be/uJN1Va36MEA?si=lRyeEsOIdV9Vz7dC",
      "release": "2025-02-19T03:30:41Z",
      "duration": "00:07:12",
      "explicit": false,
      "youTubeId": "bX_1b_gwcBA",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bX_1b_gwcBA"
      }
    },
    {
      "id": "5399cf13-a35c-4fd4-9fda-3aba91b9b885",
      "title": "Jonathan Lamb\u0026#39;s Letter",
      "description": "“I’m happier now than I’ve ever been.”\n\nThat was Joni Lamb’s reaction after her son, Jonathan, read an impassioned letter at a Daystar board meeting. Jonathan wrote the letter in response to an email from Daystar attorney John Lynch. In it, Jonathan revealed that Joni scolded Suzy Lamb over the SA of a child during a meeting with Jimmy Evans. Jonathan said the couple was ordered to submit and not talk about the incident. \n\nThe couple refused to read a viewer comment on air that complimented Joni’s new husband, Doug Weiss. That kicked off a firestorm that played out publicly when they were kicked off Ministry Now. More about that in this video:  https://youtu.be/RUFWsWAx0x4?si=pWjLp_W67OfEqiX4\n\nWere Jonathan and Suzy Lamb fired because of poor job performance or was it retaliation for not endorsing the marriage of Joni Lamb to recently divorced sex therapist Doug Weiss? Post your comments.",
      "release": "2025-02-17T21:19:42Z",
      "duration": "00:12:28",
      "explicit": false,
      "youTubeId": "NNsZKKjNqXQ",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NNsZKKjNqXQ"
      }
    },
    {
      "id": "33b24b0b-82a5-481a-ad0e-fe86b9dcae2a",
      "title": "Joni Lamb: In Her Own Words",
      "description": "\u0022I know now that\u0027s why the Lord wanted me to do it.\u0022 \nThat is what Daystar\u0027s Joni Lamb said  about a decision she made during a live broadcast of Ministry Now that sent the family into a public tailspin. \n\nIn this newly-released video, Joni Lamb describes hearing from God on multiple occasions regarding her relationship with divorced sex therapist Doug Weiss.\n\nShe once again points to the \u0022prophetic voices\u0022 that gave her \u0022a word\u0022 regarding the romance with Doug Weiss, including Daystar\u0027s security guard who had a dream about her new man. What wasn\u0027t commonly known prior to this recording is that the security guard is a relative of one of the gals on Joni Table Talk. (Hint: It isn\u0027t \u0022Red Wig.\u0022)\n\nJoni Lamb\u0027s recollection of the meeting she and Jimmy Evans had with Jonathan and Suzy Lamb is a mild version of the July 11, 2023 meeting. The comments in this video are from a recorded conversation five days later.",
      "release": "2025-02-16T01:31:15Z",
      "duration": "00:24:36",
      "explicit": false,
      "youTubeId": "RUFWsWAx0x4",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RUFWsWAx0x4"
      }
    },
    {
      "id": "a3a90c58-0883-4886-a487-fa8e47ccca13",
      "title": "Daystar Romance: The Timeline",
      "description": "The whirlwind romance of Daystar\u0027s Joni Lamb and divorced marriage/sex therapist Doug Weiss continues to raise eyebrows nearly two years after the wedding.\nNew questions about an appearance Doug Weiss made on Daystar during his divorce process are creating quite a buzz on social media. He filed for divorce in January 2022, but appeared on Daystar Television Network in April 2022 wearing his wedding ring and talking about his wife and kids. Just two months later, he began a relationship over the phone with the widowed (and wealthy) Joni Lamb.\nIn this video, we\u0027ll take a closer look at the the relationship timeline plus show a clip from the show in question - which Daystar has since deleted.\n\nThis video is transformative in nature  and is intended for the purpose under Section 107 of the Copyright Act, including: commentary, criticism, entertainment and research. Fair Use is permitted by copyright statute that might otherwise be infringing.\n\n\nMusic by Bensound.com\nLicense code: OLQVEHCRHUUWKTDO",
      "release": "2025-02-13T15:00:15Z",
      "duration": "00:21:06",
      "explicit": false,
      "youTubeId": "92FdgC2zVP8",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=92FdgC2zVP8"
      }
    },
    {
      "id": "52f9365d-17f9-4a5f-ab1c-80e80d9f8b0d",
      "title": "Daystar Scandal: The Top Ten",
      "description": "Daystar Television Network, the second-largest Christian broadcasting network in the world, is embroiled in a huge scandal. There has been an explosion of coverage across social media channels and there are several moments that stand out.\nThis is our Top 10 list with a couple of honorable mentions. What moment stands out to you? \n#DaystarScandal\n\n\nThis video is transformative in nature  and is intended for the purpose under Section 107 of the Copyright Act, including: commentary, criticism, entertainment and research. Fair Use is permitted by copyright statute that might otherwise be infringing.\n\nMusic by: https://www.bensound.com/free-music-for-videos\r\nLicense code: IZ1WLGOFFTLTNOQ4",
      "release": "2025-02-10T16:00:06Z",
      "duration": "00:17:26",
      "explicit": false,
      "youTubeId": "RUi8VzcXvVI",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RUi8VzcXvVI"
      }
    },
    {
      "id": "f0e6e494-eb04-4972-b5f0-6efed29ece55",
      "title": "Marcus Lamb: A Warning Before He Died",
      "description": "\u002B\u002BEXCLUSIVE VIDEO\u002B\u002B\n\n\u0022If you want the blessing to continue on your life...on Daystar...you must continuously be lead and guided by by the Holy Spirit.\u0022\n\nIn this exclusive video, Marcus Lamb speaks about the future of Daystar in April 2021, about seven months before he died. His words carry what could be interpreted as a warning, given the current multi-faceted scandal. \n\nMarcus Lamb also gives a special blessing over Jonathan in a touching moment between father and son.\n\nMusic by https://www.bensound.com\nLicense code: QXB4G98AGUQ4I3LK",
      "release": "2025-02-05T22:43:26Z",
      "duration": "00:02:59",
      "explicit": false,
      "youTubeId": "AGjXl7wBb_s",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AGjXl7wBb_s"
      }
    },
    {
      "id": "8cd5701d-0032-4bf1-b937-ddad6d7c33a8",
      "title": "The Real Joni Lamb?",
      "description": "**New Audio** \nDaystar\u0027s Joni Lamb repeatedly berates and taunts her son, Jonathan, about not being the head of his household. It is almost as though she is trying to emasculate her own son for not going against his wife, Suzy. \n\nJoni goes as far as to tell Jonathan that his deceased father, Marcus Lamb, was concerned about his leadership. There is no indication that Marcus ever had those worries or any conversation about it with Jonathan. \n\n\nIncluded in the video are previous clips where Joni Lamb threatens Jonathan and Suzy with demonic activity in their lives if they don’t submit to her. Joni also predicts curses on her own grandchildren because of Jonathan and Suzy’s so-called rebellion.\n\n#TheRealJoniLamb",
      "release": "2025-02-04T23:09:19Z",
      "duration": "00:02:29",
      "explicit": false,
      "youTubeId": "Flt-tBX7uhA",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Flt-tBX7uhA"
      }
    },
    {
      "id": "4e97cf3e-445d-4825-9796-1efa5f565986",
      "title": "Joni Lamb Doubles Down at Daystar",
      "description": "\u0022They\u0027re questioning whether I heard from God or not in marrying this man.\u0022\nJoni Lamb won\u0027t budge on her claim that the Lord brought divorced sex therapist Doug Weiss into her life and says she can\u0027t work with anyone who doesn\u0027t believe her. Ever.",
      "release": "2025-02-01T06:16:05Z",
      "duration": "00:04:54",
      "explicit": false,
      "youTubeId": "U7MYZO2pvwM",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=U7MYZO2pvwM"
      }
    },
    {
      "id": "b374c0c3-436c-43f7-b6f6-4b6e5b0e5fbb",
      "title": "Joni Lamb’s Daughter: \u0026quot;Rebecca is Unhinged\u0026quot;",
      "description": "Doug Weiss called his soon-to-be stepdaughter \u0022unhinged\u0022 because of an outburst Rebecca Lamb Weiss had over his upcoming marriage to her mother, Joni Lamb. \n\nThe comments came during a three-hour meeting between the couple and Jonathan and Suzy Lamb, where concerned were expressed about the upcoming marriage between the recently-divorced sex therapist and Daystar\u0027s Joni Lamb.\n\nAlso included in the video is an interview from Laura-Lynn Live, which can be viewed in its entirety at this link: \nhttps://youtube.com/@LauraLynnThompson?si=pFRrVHrRaExYFoZU",
      "release": "2025-01-28T23:53:30Z",
      "duration": "00:05:34",
      "explicit": false,
      "youTubeId": "Djxo5nS7HrY",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Djxo5nS7HrY"
      }
    },
    {
      "id": "4e5e14e9-166b-4596-98fd-ef077da0096e",
      "title": "Daystar Support: A Spiritual Grand Slam",
      "description": "Divorced sex therapist Doug Weiss claims that his marriage to Daystar president Joni Lamb had the approval of \u0022world leaders\u0022 - an example of a spiritual grand slam of endorsement. \n\nThe comment was made during a three hour meeting in which Jonathan and Suzy Lamb met with the couple and Pastor Jimmy Evans to discuss concerns about the upcoming marriage.",
      "release": "2025-01-27T19:48:23Z",
      "duration": "00:03:43",
      "explicit": false,
      "youTubeId": "uJN1Va36MEA",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uJN1Va36MEA"
      }
    },
    {
      "id": "d724e54a-aa19-492e-8107-d811a3076d31",
      "title": "Daystar: Ministry or Mob?",
      "description": "A tracker was secretly placed in the vehicle of Daystar\u0027s vice president followed by a termination letter delivered by an armed security guard. The same security guard who had a \u0022prophetic dream\u0022 about the marriage of Joni Lamb and Doug Weiss. \nNow that couple is threatening to cancel \u0022cancel culture\u0022 and kill \u0022censorship\u0022 while blocking people in droves on social media.\nIs this a ministry or a mob?\n\n#DaystarScandal\n#MinistryOrMob",
      "release": "2025-01-26T22:59:07Z",
      "duration": "00:08:50",
      "explicit": false,
      "youTubeId": "jFkjnf6A24E",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jFkjnf6A24E"
      }
    },
    {
      "id": "75120a5a-605d-4608-9910-e8bf6b068aa2",
      "title": "Lambasted: Joni Lamb vs. Rodney Howard-Browne",
      "description": "Daystar\u0027s Joni Lamb has harsh words for preacher Rodney Howard-Browne. She didn\u0027t hold back her criticism even after he gave her $100,000 as a gift. Joni said she used the money to pay for her wedding, even though Rodney opposed the marriage to sex therapist Doug Weiss.",
      "release": "2025-01-26T04:11:46Z",
      "duration": "00:03:14",
      "explicit": false,
      "youTubeId": "AgNNgYhRvXc",
      "subjects": [
        "Daystar",
        "Rodney Howard-Browne"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AgNNgYhRvXc"
      }
    },
    {
      "id": "0fcfd51b-928c-46aa-9d47-73182827a64f",
      "title": "Daughter Rebecca Confronts Joni Lamb",
      "description": "“She said I had demons and that he cast a spell on me.”\nJoni Lamb discloses details about a confrontation with her daughter, Rebecca, who erupted over the relationship with Doug Weiss. \n\nRebecca Lamb Weiss has been silent about the multi-tiered scandal at Daystar, but that wasn’t always the case. \n\nThe youngest daughter of the late Marcus Lamb had strong objections about Joni Lamb’s marriage to sex therapist Doug Weiss. \n\nJoni Lamb describes a confrontation with Rebecca - prior to her wedding - during a secretly-recorded meeting on May 5, 2023.",
      "release": "2025-01-23T01:16:32Z",
      "duration": "00:04:01",
      "explicit": false,
      "youTubeId": "dKDgSxfH_zI",
      "subjects": [
        "Daystar"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dKDgSxfH_zI"
      }
    }
  ]
}