{
  "id": "12e5c382-451a-4948-b4f9-46cf54e1d552",
  "name": "Jenn\u0027s Corner",
  "youTubeChannelId": "UCSchxwvbPS-cmGEFUFJNUqg",
  "episodes": [
    {
      "id": "fed13add-9fbd-40fb-8d0c-365fc243cb6d",
      "title": "Vlog - Anyone can be a cult victim!",
      "description": "I did this vlog to explain not only vulnerable \u0026 ‘’uneducated’’ people get lured into cults but anyone can be manipulated into one. That’s why it’s important to question everything \u0026 use critical thinking.  I hope this video helps you to identify people who are trying to recruit you into a cult if it ever happens. I pray that it never does happen to you. ￼￼\n\nMusic - I don’t own the background music.",
      "release": "2025-08-12T03:00:48Z",
      "duration": "00:07:15",
      "explicit": false,
      "youTubeId": "wW_O_nrj2ss",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wW_O_nrj2ss"
      }
    },
    {
      "id": "8e4b4357-b141-4465-8aa0-7578d7cbeb9c",
      "title": "Episode #2 - Beware of SCJ Cult",
      "description": "In this episode, I am sharing my experience with Shincheonji (SCJ) aka New Heaven New Earth ￼￼(English translation from Korean). \nI was lured in by a trusted friend who duped me at￼ a vulnerable time suffering through Long Covid (still have Long Covid)￼. This cult goes after young people, vulnerable people, and  Christians believing they are doing the work of God. They can be very aggressive, coercive \u0026 they use spiritual abuse to control their victims. They cherry pick scripture to create their own narrative that you need to be saved by believing in the interpretation of their founder Lee Man Hee ￼\u0026 register with their church of SCJ in order to truly have salvation. \n\nI will insert some important websites for resources purposes, so everyone can be aware of this cult, and stay away from them. The most devastating thing about this cult, and any other cult that pretends to be Christian is that they lure people away from placing their faith solely in Jesus Christ, and so they are in apostasy.\n\nAlthough I was very sick, I joined this group, thinking it was a true Bible study, but I was tricked, and it really affected my health. I wished I saw the red flags sooner and got out, nevertheless, I’ve learned a good valuable lesson and I can share with others to be aware of them￼.",
      "release": "2024-08-03T01:41:03Z",
      "duration": "00:07:17",
      "explicit": false,
      "youTubeId": "VsqcUAHpbHU",
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VsqcUAHpbHU"
      }
    }
  ]
}