{
  "_ts": 0,
  "id": "db362c83-ec74-473b-8542-50394098d7fa",
  "name": "Jessica Savano",
  "youTubeChannelId": "UCCtfgQDRGsm2KyD0ys6tpLQ",
  "episodes": [
    {
      "id": "002c4232-b929-447e-87e2-4c089a6f1621",
      "title": "Searching for Taylor Casey: My Trip to the Bahamas to Find Her",
      "description": "In this episode, I travel to the Bahamas in search of my friend, Taylor Casey, who mysteriously disappeared from Paradise Island on the evening of July 19th, 2024. I distribute flyers and try to piece together any clues 🕵️‍♀️ that may lead to answers about her disappearance.\n\n🔔 Please note: I do not hold the yoga ashram responsible for her disappearance. If you have any tips, clues, or ideas on how we can spread her story further, please email me at jessicasavanotravels@gmail.com\n\nYoga Centers in India that I recommend: \nMathatitu Yoga AshramKerala, India\nRishikesh Yoga Teacher Training -Rishikesh, India\nTattvaa Yogashala - Rishikesh, India\nPyramid Yogshala - Rishikesh, India \nNath Yoga Shala - Rishikesh, India\n\nContact my dear friend/yogi Harshvardhan on IG as he does traveling yogic programs @yogatman \n\n=============================\n\n🌍 Join me on a journey of exploration as I see the world through a free-spirited lens ✨. Since 2018, I’ve been immersing myself in diverse cultures and showing how travel can transform perspectives. My channel is all about embracing human connection, spreading love ❤️, and finding magic in stepping out of our comfort zones 🌟.\n\nStay tuned for rich cultural discoveries, heartfelt adventures, and inspiring stories that encourage you to live fully and trust that everything unfolds as it should. Let’s explore the world together and spread positivity wherever we go! 🌎💫\n\n🔔 Subscribe for Inspired Journeys!\n\n=============================\n\n✖️ Copyright Notice:\nThis video and my channel contain content that belongs to Jessica Savano. You’re welcome to share or embed this video, as long as a link back to my channel is provided.\n\n© Jessica Savano",
      "release": "2024-10-14T15:36:47Z",
      "duration": "00:43:37",
      "explicit": false,
      "youTubeId": "qXAGgVEwzw0",
      "subjects": [
        "Sivananda Yoga",
        "Yoga Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qXAGgVEwzw0"
      }
    }
  ]
}