{
  "_ts": 0,
  "id": "3e2d293f-6638-4e28-b073-18f33b50bf54",
  "name": "Jessica Ash Wellness",
  "youTubeChannelId": "UCYxE-PBo06P035AxeZdQm4w",
  "episodes": [
    {
      "id": "626eff53-0a34-486a-a459-f70ffd882a7f",
      "title": "Growing Up In A Cult with Libby Wescombe",
      "description": "Today’s episode is so interesting and insightful with my guest, Libby Wescombe!\n\nLibby was born into and raised in a cult in Thailand. Around puberty, she began to ask questions and see that the teachings in the cult weren’t quite aligned with what she felt was true in the real world. After spending the first part of her life in Thailand, and then in a different section in the cult in the middle east, she made the decision to leave at the age of 21.\n\nWith very little tools for success in the real world, LIbby struggled to rebuild her life in Australia, finding work, buying food, all while navigating young motherhood with her daughter. She found solace in joining a gym that allowed her to take control over an area of her life and found her passion in fitness by eventually becoming a trainer.\n\nLibby is now a very popular face in the fitness world, and she shared her opinions on the lack of fitness and how it truly impacts the health and wellness of her clients and especially women. It goes beyond just physical appearance and penetrates deep down into your biomechanics that affect your energy, insulin sensitivity, and sleep. \n\nBuilding up our fitness regimen slowly and gradually helps set you up for success with good habits, and helps combat the misconception of exercise intolerance. While it exists as a medical condition, it is becoming an identity that women are using in response to being deconditioned and out of shape.\n\nLibby shares more about building the fundamentals of exercise and how to get past the difficult spells of starting exercise. Tune in to this episode to hear more about how Libby is helping women everywhere uncover their true potential and step into exercise with confidence while improving their overall wellbeing! \nIn this episode:\n[00:00:46] Thanks for joining me on The Fully Nourished Podcast.\n[00:04:39] Welcome my guest today, Libby Wescombe.\n[00:05:58] Libby shares her experience of being born into and growing up inside a cult in Thailand. \n[00:07:36] The tipping point that caused Libby to question the cult she was part of and how she left the cult.\n[00:15:31] How Libby got from the cult in the Middle East to home in Australia and rebuilt her life at the age of 21.\n[00:22:54] How becoming a mother at a young age immediately after leaving a cult shaped her experience and their mother-daughter relationship. \n[00:24:28] Libby’s message about having compassion for the past version of ourselves. \n[00:26:18] How Libby found her place in fitness. \n[00:34:08] Libby’s opinion on the lack of fitness and how it leads to health issues.  \n[00:39:09] Is exercise intolerance as common as we think it is? And what can be done to refrain it? \n[00:44:19] The impact of exercise on mental tenacity and resilience. \n[00:46:01] The biggest mistakes women make when stepping into a new exercise routine.\n[00:48:10] How Libby is helping women redefine body recomposition and understand what they really want out of their fitness regimen. \n[00:55:21] Loving the exercise you do and staying motivated. \n[01:00:27] Establish a regular exercise routine even when you “don’t have time.”\n[01:05:37] A solid tip from Libby to help you stay motivated but to give yourself grace to validate how you’re feeling. \n[01:12:36] Libby’s best practices for increased recovery and better results over time. \n[01:15:11] What are some of Libby’s offerings for women who want to get fit?\n[01:17:14] Thanks for joining Libby and me on The Fully Nourished Podcast! \nLinks and Resources:\n\nFree online course (best place to get started):\nhttps://healthyskinglows.com/free-skincare-course\n\nThe Skin Barrier Fix ebook - https://www.amazon.com/dp/B0BWYNZNN9\n\nDiscount Codes from Our Sponsors:\n\nLoveBirds\nLink: https://lovebirdfoods.com/?ref=jessicaashwellness\nJESSICAASH for 10% off\n\nConnect with Libby:\nInstagram -  https://www.instagram.com/libbywescombe/?hl=en@libbywescombe\n\nYour Monthly Fuel Membership: https://hl437.isrefer.com/go/YMF/YMFJess1/\n\nConnect with Jessica:\n\nHave Sunday tea with me! Sign-up for my Sunday newsletter where I share what’s on my brain from the nutritional to spiritual: https://www.jessicaashwellness.com/email-subscribe.\n\nJoin the Fully Nourished community! Follow me @jessicaashwellness on Instagram: https://www.instagram.com/jessicaashwellness/ \n\n#functionalnutrition #cultsurvivor #feminineenergy",
      "release": "2024-06-13T17:00:29Z",
      "duration": "01:19:39",
      "explicit": false,
      "youTubeId": "Seyc0zSXsAo",
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Seyc0zSXsAo"
      }
    }
  ]
}