{
  "id": "fe2e6b5c-ac33-4c6a-b55d-d0cf48fbe924",
  "name": "Jezebel",
  "youTubeChannelId": "UCI4iIRZltBUQITyvCXz_PZg",
  "episodes": [
    {
      "id": "8a6cc3a4-3bf9-4710-93c8-cea341c3ecac",
      "title": "Inside the Thai Spiritual Haven Run by an Alleged Sexual Abuser",
      "description": "Koh Phangan is a small island in southeast Thailand known to tourists for its parties and beautiful beaches. The beauty of the locale also lures visitors in search of relaxation and spiritual awakening. Among the island’s most popular schools is Agama, a yoga community led by Swami Vivekananda Saraswati, whose teachings have attracted thousands of students since opening in 2003.\n\nOnly recently have allegations of sexual assault by the Swami come to light, as reported by the Guardian. (Agama and the Swami deny these allegations.) This short documentary is an in-depth look at how the school—led by one charismatic leader—is accused of fostering a culture of abuse and manipulation under the guise of healing and enlightenment. Janja Lalich PhD, a sociologist and specialist in coercive influence, also explains how leaders can assert power in isolated groups.\n\nSend tips and inquiries to Jennifer Perry, jennifer@jezebel.com",
      "release": "2019-05-10T17:33:12Z",
      "duration": "00:18:57",
      "explicit": false,
      "youTubeId": "sLzqVrA5t9o",
      "subjects": [
        "Agama Yoga",
        "Yoga Cult",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sLzqVrA5t9o"
      }
    },
    {
      "id": "2f9085ee-6c82-4ffe-b179-dbcad7d2f5d8",
      "title": "Trailer: The Spiritual Guru Accused of Sexual Assault",
      "description": "Agama is the type of spiritual retreat that has, in the shadow of the wellness movement, become increasingly fashionable. Located in Koh Phangan, Thailand, it is a tropical, paradise-like community focused on nurturing mental and physical health, or as Agama’s website puts it, the “secret spiritual path of true Integral Yoga courses.”\n\nBut some Agama students say that what they found there was the opposite after interacting with Agama’s founder, Swami Vivekananda Saraswati, a Romanian national who is accused of sexual assault of 14 of his students, as reported by the Guardian. (Agama and the Swami deny the allegations.) In December, Jezebel went to Koh Phangan to speak to some of these accusers, and to try and unravel how a place meant for healing could become so toxic for them. Our full documentary will debut next week; in the meantime, watch the trailer above. Read our full post here: https://jezebel.com/watch-the-trailer-for-agama-jezebels-first-ever-short-1834008279\n\nA link to Agama\u0027s statements are below:\nhttp://bit.ly/agamafacebook",
      "release": "2019-04-15T23:03:07Z",
      "duration": "00:01:21",
      "explicit": false,
      "youTubeId": "ex2Al4jYlIc",
      "subjects": [
        "Agama Yoga",
        "Yoga Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ex2Al4jYlIc"
      }
    }
  ]
}