{
  "id": "c2b1939c-a08c-4a39-94f1-278285bc723e",
  "name": "Jillian Michaels",
  "youTubeChannelId": "UCdsvmOV_qYJUPqlUxs72Jtw",
  "episodes": [
    {
      "id": "ffa68b1d-f84a-4cbc-b388-28a11a9802df",
      "title": "MTG: “It’s Much Bigger Than Epstein” | The 3 Million Missing Files",
      "description": "Marjorie Taylor Greene (MTG) sits down to reveal the dark reality behind the January 2026 Epstein files release. Greene details the career-ending pressure she faced from the GOP establishment and a scorching phone call where Donald Trump allegedly warned her that his \u0022friends will get hurt\u0022 if the files went public.\n\nWe break down the most disturbing findings from the archives, including the infamous \u0022walking jerky\u0022 emails , the Bill Gates connection to pandemic planning , and the \u0022Massacre of the Innocents\u0022 painting request. From the business model of the war in Ukraine to the evidence of geoengineering and weather modification, MTG explains why the \u0022Uniparty\u0022 is terrified of the truth—and why she believes the global elite are operating a system of \u0022pure evil.\u0022\n\nTopics Discussed:\n\nThe Trump Fracture: Being called a \u0022traitor\u0022 and the threat to primary her.\n\nTDecoding the Files: What \u0022pizza,\u0022 \u0022hot dogs,\u0022 and \u0022shrimp\u0022 really mean in the archives.\n\nThe Global Cabal: BlackRock, Vanguard, JP Morgan and the looting of world resources.\n\nBio-Weapons \u0026 Neuro Tech: The emails linking big tech to health data and depopulation. (Gates, Bannon, Summers \u0026 More)\n\nThe Coalition: Why MTG wants a Left-Right populist alliance to defeat the ruling class.\n\n#EpsteinFiles #MarjorieTaylorGreene #GlobalElite #GovernmentCorruption #Populism #UkraineWar #Censorship #DeepState #KeepingItReal #TruthOverTribe\n\nCHAPTERS\n0:00:00 - Intro\n0:03:00 - Q Anon\n00:07:07 - The Monopoly: BlackRock, Vanguard \u0026 the illusion of choice\n00:15:09 - LEAKED EMAILS: Bill Gates, Neuro-Tech \u0026 \u0022Getting Rid of Poor People”\n00:23:30 - The Ukraine Business Model: Epstein, the Rothschilds \u0026 the 2014 Coup\n00:36:39 - Geoengineering: Cloud seeding \u0026 \u0022Blocking Out The Sun”\n00:43:33 - The \u0022Black Pill\u0022: Why donors control Congress (and you can\u0027t vote your way out)\n00:51:15 - The Cover-Up: How Speaker Johnson \u0026 the GOP blocked the file release\n01:03:00 - THE TRUMP PHONE CALL: \u0022My friends will get hurt”\n01:09:37 - The Fallout: Being branded a \u0022traitor\u0022 \u0026 death threats against her son\n01:15:41 - DECODING THE FILES: \u0022Walking Jerky,\u0022 Human Flesh, \u0026 The Bannon Emails\n01:24:12 - The New Alliance: Uniting Left \u0026 Right against the Ruling Class\n01:34:29 - Life After Congress: What’s next for MTG?\n\nSundays for Dogs: Upgrade your dog’s food without the hassle—try Sundays for Dogs and get 50% off your first order at https://sundaysfordogs.com/JILLIAN50 or use code JILLIAN50 at checkout.\n\nCardiff: Get fast business funding without bank delays—apply in minutes with Cardiff and access up to $500,000 in same‑day funding at https://Cardiff.co/JILLIAN \n\nSKIMS: Shop my favorite bras and underwear at http://www.skims.com/jillian #skimspartner\n\nSubscribe to the YouTube channel:\nhttps://www.youtube.com/@JillianMichaels\n\nWatch full episodes of Keeping it Real here: https://www.youtube.com/playlist?list=PLiii-iSEaAue6WFBwW7i6CQfaJZViGhZp\nWatch clips of Keeping it Real here: https://youtube.com/playlist?list=PLiii-iSEaAuekunvlzuUDl3W5UY3tEydK\u0026si=2RUFlp3Vo79h9XBW\n\nClick Here to Download My App! https://www.jillianmichaels.com/join\nFacebook: https://www.facebook.com/jillianmichaels/\nInstagram: https://www.instagram.com/jillianmichaels/\nX: https://x.com/JillianMichaels/\n\n\nWelcome to the \u0022Keeping It Real\u0022 podcast – where authenticity meets impactful storytelling. Hosted by Jillian, this podcast dives into the stories, ideas, and truths that shape our world. Featuring top journalists, newsmakers, thought leaders, and everyday heroes, we explore breaking news, global events, and the personal journeys that inspire and challenge us. From controversial current events and transformative ideas to health, wellness, and self-discovery, no topic is off-limits. With honest dialogue and fresh perspectives, \u0022Keeping It Real\u0022 is your go-to space for staying informed, inspired, and engaged.",
      "release": "2026-02-15T16:00:06Z",
      "duration": "01:39:04",
      "explicit": false,
      "youTubeId": "hwzNIYDJCaU",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hwzNIYDJCaU"
      }
    }
  ]
}