{
  "id": "b137c2cf-89ab-496b-9742-2c97b7e16621",
  "name": "jillybeenz",
  "youTubeChannelId": "UCjn0WUGQvadMzIIWOI3Go4g",
  "youTubePlaylistId": "PLTtSFzDLSaeeO44ujcN_FgK-qysf1mcjk",
  "episodes": [
    {
      "id": "cbf6a807-7736-427f-9af2-8a145f08b288",
      "title": "Is the Twelve Tribes a cult??",
      "description": "In this video I go over 13 clear criteria to recognize a cult.  Does the Twelve Tribes meet any of them? Watch to find out!!\n\n#twelvetribes \n#cultsandextremebeliefs \n#freedom \n\nHere are a couple of valuable products I have found since leaving the Twelve Tribes that I want to show you...maybe you\u0027d find them valuable to you and your family!\n\nJuice Plus! This is a great nutritional product that myself and kids have been using for years.  It\u0027s made with fresh and real foods and turned into a capsule or gummy so you can have more confidence getting the nutrition your body needs!  Here are a couple of quick videos...\nhttps://www.youtube.com/watch?v=jzWHTGc9Wmc\u0026t=4s\nhttps://www.youtube.com/watch?v=_w9ywOJ4Z8M\u0026t=1s\n#juiceplus \nAnd here is my affiliate link...\nhttps://j-d29.juiceplus.com/\n\nAnd... Shoes!! Xero shoes are my most favorite.  They are \u0022barefoot\u0022 shoes, and have a durable but thin sole, and slightly wider footbed for maximum comfort and connectedness.  Check em out!   You might love em as much as I do!\nhttps://xeroshoes.com/go/jillybeenz\n#xeroshoes \n#barefootshoes \n\nEnjoy!!\nThanks for stopping by!!\nJillybeenz",
      "release": "2022-06-21T18:43:02Z",
      "duration": "00:11:01",
      "explicit": false,
      "youTubeId": "c-5bzAE9KRI",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c-5bzAE9KRI"
      }
    },
    {
      "id": "b05bdbc2-79e4-41d7-a450-a14151612461",
      "title": "A beautiful experience out of the Twelve Tribes ✨️",
      "description": "Ahhhh!  Freedom tastes so good! In this video I explain a couple of reasons why I love having #Freedom of choice.   So good to be out of the mind controlling cult!!\n\n#cultsandextremebeliefs \n#freedom \n#twelvetribes \n\nHeeeey! On a side note, would you like to put good things in your body, feel better, AND support my channel? Check out these great plant based supplements that are loaded with nutrition that is otherwise hard to get into your body...\nMe and my kiddos have been taking them for a couple of years now.  #juiceplus \n\nhttps://j-d29.juiceplus.com/",
      "release": "2022-06-03T16:18:23Z",
      "duration": "00:08:44",
      "explicit": false,
      "youTubeId": "qTCKSh98NA0",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qTCKSh98NA0"
      }
    },
    {
      "id": "6eed18f0-c863-45c8-aaa4-9fbdd3fbe470",
      "title": "Parenting after leaving the 12 Tribes cult community #twelvetribes #cultsandextremebeliefs #freedom",
      "description": "Parenting surely isn\u0027t easy, but transitioning from Parenting in the Twelve Tribes I to Parenting in the \u0022world\u0022 is extra crazy! Here are some thoughts about the transition that we went throumore than 6 years ago!",
      "release": "2022-05-20T17:25:40Z",
      "duration": "00:07:04",
      "explicit": false,
      "youTubeId": "I9gjWrEz9Zk",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I9gjWrEz9Zk"
      }
    },
    {
      "id": "2b7cda05-6c7b-4383-8d23-966b74b40438",
      "title": "Do I regret living in the Twelve Tribes for 8 years?",
      "description": "I spent a good amount of time living with the Twelve Tribes community/cult. So, do I regret my decision? How has it influenced my life? In this video I explore these topics and others. Enjoy 😉 \n\n#cultsandextremebeliefs \n#twelvetribes \n#freedom",
      "release": "2022-05-20T16:19:06Z",
      "duration": "00:16:52",
      "explicit": false,
      "youTubeId": "c0L4GOSs14Q",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c0L4GOSs14Q"
      }
    },
    {
      "id": "920d2afa-6bde-437a-b08d-1b07ed143803",
      "title": "Life after 8 years of living in the Twelve Tribes cult",
      "description": "I lived in the Twelve Tribes community for 8 years! After I left life took many turns and we had many changes. In this video I explain what it was like to leave and regain my independence,  regain my own way of thinking,  and am continually moving to a better life for myself and kiddos.  Join me😉\n\n#cultsandextremebeliefs \n#twelvetribes \n#freedom \n\nWant to check out a couple of things I\u0027ve found these last years that I\u0027d like to pass onto you? And support my channel at the same time?  Win win, eh?\n\n#juiceplus \nJuice Plus is a capsule or gummy (or other products they make) to bridge the gap from what we eat every day to what our bodies need to be healthy and strong.  They are made with real foods and are a wonderful compliment to a human body!\nHere are a few videos explaining what the product is...\nhttps://www.youtube.com/watch?v=_w9ywOJ4Z8M\u0026t=1s\nhttps://www.youtube.com/watch?v=hj2hCEqDEOM\n\nAnd here is my affiliate link... https://j-d29.juiceplus.com/\n\nAnd... #xeroshoes \nThese barefoot shoes are made with great products, super comfy, stylish, and good for tus pies! (your feet).  I own many pairs and love how down to earth I am walking around in them.  \nCheck em out!  https://xeroshoes.com/go/jillybeenz\n#barefootshoes \n\nYou dig my camera? I do! It\u0027s a Insta360 oneX2.  It is a super cool and easy 360 camera that\u0027s fun to use, small, and can do some amazing stuff!  Here\u0027s my link for that...\nhttps://www.insta360.com/sal/one_x2?insrc=INR40PW\n\nThank you and you\u0027re welcome!!😊\nJillybeenz",
      "release": "2022-05-14T17:42:15Z",
      "duration": "00:12:20",
      "explicit": false,
      "youTubeId": "8sgvONoe-tk",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8sgvONoe-tk"
      }
    },
    {
      "id": "4ccec3c2-bd7b-44dd-8a65-1f5210027bc6",
      "title": "What valuable lessons I learned from living with the Twelve Tribes for 8 YEARS!",
      "description": "Many things I learned while in, and many things I learned from being out.  Check out this video for the value I retained from living in the Twelve Tribes community/ cult for 8 years!",
      "release": "2022-04-29T16:51:12Z",
      "duration": "00:11:37",
      "explicit": false,
      "youTubeId": "S0pcYqEhPak",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S0pcYqEhPak"
      }
    },
    {
      "id": "ad56cc70-14db-4eb8-89ae-ba87ef20b019",
      "title": "Twelve Tribes Ex cult member going back for a visit...intentions and emotions!",
      "description": "I\u0027m heading to the Twelve Tribes Friday night celebration! WHAA?  \nI lived in the group for 8 years.  I\u0027ve been gone for 6 years.  I have had the inspiration to go back and lay at rest some ropes that I feel are still attached.  I have no intention of returning to stay, rather to experience this place again, but as a more mature human.  I don\u0027t mind pushing myself into uncomfortable situations in order for myself to see where I\u0027m at, so here we go!  Check for the update!",
      "release": "2022-04-29T16:48:39Z",
      "duration": "00:04:51",
      "explicit": false,
      "youTubeId": "KblWH4Hu_cg",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KblWH4Hu_cg"
      }
    },
    {
      "id": "9e161424-df79-4dcc-ba99-02cc1304ceaa",
      "title": "*update* 12 tribes ex member goes back to visit after 6 years!?",
      "description": "It\u0027s been quite the journey to escape the mental beliefs that I acquired while living in The Twelve Tribes for 8 years! And I\u0027ve come such a long way! In this video I explain my experience of going back to a Twelve Tribes house that I used to live in, and visiting with old friends. It wasn\u0027t easy, but I was inspired and want growth and detachment.  Thanks to support from my friend, I was able to attend a Friday night celebration, have a dance, go through a lot of emotions, feel free, see it more clearly, reunite with old friends,  and find more peace in my soul.\n\n#cultsandextremebeliefs \n#twelvetribes \n#freedom \n\nOn a different subject...I wanted to share some great products I support and use and am an affiliate for.  Never hurts to check em out!\n\n#juiceplus \nJuice Plus is a product that we have been using for years.  Their products are loaded with real food nutrients that you just can\u0027t eat every day. I mean, who eats arceola cherries every day??  Here are a couple of vids that explain the products they offer...\nhttps://www.youtube.com/watch?v=hj2hCEqDEOM\nhttps://www.youtube.com/watch?v=_w9ywOJ4Z8M\u0026t=1s\nand here is my affiliate link... https://j-d29.juiceplus.com/\n\nMy favorite barefoot shoes you ask?  Xero! #xeroshoes #barefootshoes \nWith a durable yet flexible footbed, consciously selected materials, stylish models, who could ask for more? I don\u0027t!  Check em out, you might never go back to sneakers!\nhttps://xeroshoes.com/go/jillybeenz\n\nOne more thing...\nYou like my trippy camera?  360 baby!\nhttps://www.insta360.com/sal/one_x2?insrc=INR40PW\n\nAll the best!! Jillybeenz",
      "release": "2022-04-29T16:43:14Z",
      "duration": "00:08:35",
      "explicit": false,
      "youTubeId": "ZHBgBmsLRoc",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZHBgBmsLRoc"
      }
    },
    {
      "id": "0f10cde3-9705-4a9e-aed9-4c5c7ff0cbba",
      "title": "Advice about how to handle family or friends in or considering joining the Twelve Tribes cult",
      "description": "There\u0027s some specific ways to relate to those who have joined or are considering joining the Twelve Tribes.   In this video I share my best advice about  how to maintain a relationship and support them in the process.  It\u0027s crucial to maintain a relationship! Hope this helps!",
      "release": "2022-04-29T16:41:07Z",
      "duration": "00:09:04",
      "explicit": false,
      "youTubeId": "2qMw5t6QoSs",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2qMw5t6QoSs"
      }
    },
    {
      "id": "c131fd93-f87e-44fa-a793-7e7318d6e5b2",
      "title": "Raising kids in the Twelve Tribes",
      "description": "Being a child in the Twelve Tribes cult is unlike any other place. Kids are a main focus of the group,  and there is a very clear way to raise them.  I raised two kiddos in the group until my oldest was 4, then we got out.  Here\u0027s what I can pass on, in a very basic way, about raising children in the Twelve Tribes.",
      "release": "2022-04-29T16:38:30Z",
      "duration": "00:08:53",
      "explicit": false,
      "youTubeId": "jA4LUqLzlLQ",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jA4LUqLzlLQ"
      }
    },
    {
      "id": "f260f7ee-1319-4a66-b6ce-c4bfde1400c5",
      "title": "What I gave up to join the Twelve Tribes cult/community and what I left with!",
      "description": "Joining the Twelve Tribes is a huge decision.  I was young and naiiev when I joined and ended up staying for 8 years! After a marriage and two kids later, along with a thorough brainwashing,  I was sent out back into the world. In this video I explain specific things I gave up, as well as going into details about what I kept when I left.\n\n#twelvetribes \n#cultsandextremebeliefs \n#cults \n#freedom\n\nOn a side note...\nWant to give your body better nutrition and support me at the same time?😁\nCheck out these awesome plant based food supplements my kids and I have been taking for the last couple of years. \n#juiceplus\n\nA couple of informative vids for ya...\nhttps://youtu.be/jzWHTGc9Wmc\nhttps://youtu.be/_w9ywOJ4Z8M \n\nAnd here\u0027s my affiliate link!\nhttps://j-d29.juiceplus.com/\n\nThe best shoes ever? (In my opinion)\nBarefoot shoes, XERO.  Super flexible, stylish, and comfy. AND ergonomically sound!\nCheck em out and use my link!\n https://xeroshoes.com/go/jillybeenz\n\nOne more thing...you like my camera?  Pretty funky, huh? It\u0027s a 360 camera and is really fun and simple to use.  There\u0027s a lot you can do with it, I keep in pretty simple.  Here is a link to learn more about it!\nhttps://www.insta360.com/sal/one_rs?insrc=INR40PW\n\n\nThank you and you\u0027re welcome 😊 \n\n♥️ jillybeenz",
      "release": "2022-04-28T23:09:28Z",
      "duration": "00:15:51",
      "explicit": false,
      "youTubeId": "D-wttZib-UU",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=D-wttZib-UU"
      }
    },
    {
      "id": "1460a875-bca1-4d2e-b7eb-c6279d831c8a",
      "title": "5 good things about living in the Twelve Tribes community/ cult",
      "description": "Reality is, there\u0027s some great benefits to living together,  but be careful! Because it\u0027s a huge commitment! (and not easy to get out!)\n\n#twelvetribes \n#cultsandextremebeliefs",
      "release": "2022-01-31T19:21:28Z",
      "duration": "00:05:08",
      "explicit": false,
      "youTubeId": "-6AA1RGvz6w",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-6AA1RGvz6w"
      }
    },
    {
      "id": "53842758-67c1-4a07-8910-d87fdbae7bcd",
      "title": "Is it easy to leave the Twelve Tribes cult/community?",
      "description": "I was a part of this group for 8 years, and feel a responsibility to pass on info about my experience there. Learning is power, so I am here to share. How easy is it to leave the group? I\u0027ll answer that question and others here in this video.\n\n#twelvetribes\n#cult\n#community\n\nWant to give your body whole food plant based nutrition?  And support my channel at the same time? What a deal!😁\n\nMyself and kiddos have been taking  #juiceplus for a couple of years now, and it\u0027s a product I believe in! Here are a couple of videos about it...\n\nhttps://youtu.be/_w9ywOJ4Z8M\nhttps://youtu.be/jzWHTGc9Wmc\n\nAnd here is my affiliate link...\nhttps://j-d29.juiceplus.com/\n\nHere\u0027s a link to my most favorite shoes.  They are super flexible and are in the category of \u0022barefoot\u0022 shoes.  I have several pairs of shoes and sandals,  and I super dig em!\nhttps://xeroshoes.com/go/jillybeenz\n\n\nThanks for watching 👀 🙂",
      "release": "2021-12-09T19:44:39Z",
      "duration": "00:08:29",
      "explicit": false,
      "youTubeId": "-LGR21RMjRg",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-LGR21RMjRg"
      }
    },
    {
      "id": "2c3b07e2-29a8-4f54-a3a0-f7113fdf9d41",
      "title": "Why I joined the Twelve Tribes community/cult!  How I was drawn in.",
      "description": "I was in the Twelve Tribes cult for 8 years! I learned so much while I was there, and even more since I\u0027ve been out! This video is about the specific things that drew me into being a member.  Things don\u0027t always end up as they appear!\n\nOn a side note...\nHere is a link to my most favorite brand of shoes, XERO. They are responsibility made, feel super comfy, and the sole is very flexible. They are in the realm of barefoot shoes. I have several pairs and pretty much don\u0027t wear anything else. Check em out!\n\nhttps://xeroshoes.com/go/jillybeenz\n\n\nAnother thing I wanted to introduce you to is Juice Plus.   Me and my kiddos have been taking it for a few years now and I love how many fruits and veggies (and other nutritious foods) are packed in them.  I believe it\u0027s a great quality product that gives me much more confidence about our diets.\nHere are a couple of videos...\n\nhttps://youtu.be/jzWHTGc9Wmc\n\nhttps://youtu.be/_w9ywOJ4Z8M\n\nhttps://youtu.be/RdKKUXpJxaI\n\nAnd here\u0027s my affiliate link!   https://j-d29.juiceplus.com/\n\n#freedom \n#cultsandextremebeliefs \n#twelvetribes\n#juiceplus",
      "release": "2021-10-20T19:15:01Z",
      "duration": "00:09:21",
      "explicit": false,
      "youTubeId": "4QlfC75_cSY",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4QlfC75_cSY"
      }
    },
    {
      "id": "20c18506-36e4-4124-a454-2d4c68a099c4",
      "title": "Would I ever return to the Twelve Tribes?",
      "description": "Oh man! I was fully immersed in the Twelve Tribes cult for 8 years!\nI\u0027m so dang glad I\u0027m out! Here are the top 6 reasons why I would NEVER even consider going back to join.  There is far too much control and far too little autonomy for me to ever consider going back.  This video gives 6 specific reasons (among many) that I would never return to the Twelve Tribes.\n\n#twelvetribes\n#12tribes",
      "release": "2021-10-20T19:14:49Z",
      "duration": "00:11:47",
      "explicit": false,
      "youTubeId": "j2EH3FOiN_M",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j2EH3FOiN_M"
      }
    }
  ]
}