{
  "id": "1efbd161-a4a8-422e-aa21-d53ad10ebafc",
  "name": "Jim Distortion Podcasts Home of 50 and Coping?",
  "youTubeChannelId": "UCRMD0Lkgv1XxJ0R1nU6nYxw",
  "episodes": [
    {
      "id": "54b0c6fa-1a7c-40db-acd0-92f25d696827",
      "title": "50 and Coping? Sn 3 EP 5: Indoctrination Into a Cult",
      "description": "This time we talk to Hannah about her experience of being indoctrinated into a rogue sect of an otherwise peaceful religion as a teenager. \n\nWe talk about how fundamentalists use techniques to control and manipulate people, who are often vulnerable due to other circumstances, and draw them to what appears to be the way to enlightenment and the solution to all their woes using indoctrination.\n\nWe reference some terms we haven\u0027t heard before like \u0027lovebombing\u0027. Want to know more? Then please check it out and let us know what you think in the comments...\n\n50 and Coping is a podcast video show that looks to explore people’s coping mechanisms to trauma and mental health issues. \n\nAt no time are we suggesting we have all the answers but we have lived our lives and have coped with many things and if our experience can give any solace or guidance then we see that as a positive.\n\nhttp://www.madhousetattoo.co.uk the place we record all the Podcasts \n\nhttp://www.georgehersantpgotography.co.uk George produces our podcasts and films it all!\n\nWe have a Patreon page where all of the member content is not available anywhere else. all support from you guys on there is greatly appreciated and makes it easier for us to make content for you!\nhttps://patreon.com/user?u=78899672 click here to join 7 day free trial available!\n\nIf at anytime you feel that you can’t cope mentally please seek professional help, below are listed some people who can help you so please talk to them.\n\nhttps://www.samaritans.org\nhttps://www.nhs.uk/mental-health \n\nIn the UK these two organisations are set up to help you.\n\n*Disclaimer*\nWe are not mental health professionals so we are not able to issue medical advice and are only able to offer our opinions on what has worked for us!",
      "release": "2024-07-10T10:18:38Z",
      "duration": "00:47:01",
      "explicit": false,
      "youTubeId": "I6URfn308J4",
      "subjects": [
        "Hare Krishnas",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I6URfn308J4"
      }
    }
  ]
}