{
  "id": "9b988b72-f777-429d-87c5-bba53d204cd1",
  "name": "Jimmy Kimmel Live",
  "youTubeChannelId": "UCa6vGFO9ty8v5KZJXQxdhaw",
  "episodes": [
    {
      "id": "ce3a4c56-36be-4ee2-89f5-ebf0a2c3c10b",
      "title": "Trump Attorney General Pam Bondi Gets Hammered on Epstein \u0026 MAGA Coalition Starting to Crack",
      "description": "Trump became the first and only recipient of the “Undisputed Champion of Coal Award,” since Trump likes to put his name on the front of everything we rename the Epstein Files the Trump-Epstein Files, Attorney General Pam Bondi took a turn in the hotseat and was “offended” by a line of questioning, she got into it with Thomas Massie who was a Republican co-sponsor of the bill that got the files released in the first place, Nancy Mace and Lauren Boebert aren’t buying the coverup, Greg Kelly from Newsmax thinks this whole thing is a hoax, the Trump-Epstein files have even rocked the world of dinosaur fossils, and the Brits are cracking down on porn.\n\nSUBSCRIBE to get the latest #Kimmel: http://bit.ly/JKLSubscribe\n \nFollow Jimmy Kimmel on Instagram: https://bit.ly/KimmelInstagram \nFollow Jimmy Kimmel Live on Instagram: http://bit.ly/JKLInstagram\nFollow Jimmy Kimmel Live on TikTok: https://bit.ly/JKLTikTok \nLike Jimmy Kimmel on Facebook: http://bit.ly/KimmelFB  \nLike Jimmy Kimmel Live on Facebook: http://bit.ly/JKLFacebook  \nVisit the Jimmy Kimmel Live Website : http://bit.ly/JKLWebsite \n \nAbout Jimmy Kimmel Live: \n \nJimmy Kimmel serves as host and executive producer of Emmy® nominated “Jimmy Kimmel Live,” ABC’s late-night talk show. “Jimmy Kimmel Live” is well known for its viral video successes, with over 16 billion views and more than 19 million subscribers on the show’s YouTube channel. Some of Kimmel’s most popular comedy bits include Celebrities Read Mean Tweets, Lie Witness News, Halloween Candy YouTube Challenge, Jimmy and Cousin Sal pranking Aunt Chippy and music stars like Rihanna and Dua Lipa surprising Jimmy in the middle of the night.",
      "release": "2026-02-12T04:45:08Z",
      "duration": "00:14:34",
      "explicit": false,
      "youTubeId": "jYtqhtK2q1E",
      "subjects": [
        "_America",
        "Human Trafficking",
        "Political Cult",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jYtqhtK2q1E"
      }
    }
  ]
}