{
  "id": "01d9e2e7-dffd-4713-b440-782664339534",
  "name": "Joe Schmoe",
  "youTubeChannelId": "UC6ILVGEFwxCIApCXvVXb8Ng",
  "episodes": [
    {
      "id": "700fd74d-2e5d-4663-a9de-ad840c969d43",
      "title": "🔴  Lori Vallow, Cults \u0026 Conspiracies: An Evening with Kresha (LIVE Feb 25th) #doomsdaycultmom",
      "description": "Join me for an interview with Special Guest Kresha Easton of @diffiCULTresearch  \n\n#lorivallowdaybell #doomsdaycultmom #lds\n\nKresha Easton is a member of the Woodcock family and a niece of Charles Vallow. As the aunt of JJ Vallow and cousin of Tylee Ryan, I am on a mission to seek justice by uncovering the troubling beliefs of my former aunt, Lori Vallow, and her husband, Chad Daybell. Throughout this journey, I’ve encountered powerful individuals within the mainstream system, revealing the truths we’ve been misled about. By subscribing to my channel, you can help amplify the voices of Tylee, JJ, Tammy, Charles, and Joe.\nJoin me in this critical endeavor to tell their stories and advocate for meaningful change in policy and prevention. Support my work through PayPal at https://paypal.me/difficultresearch, Venmo @love-always-wins, or on Patreon at www.patreon.com/diffiCULTreSEARCH. Check out our merch at difficult-researchs.creator-spring.com/. For inquiries, reach out via email at kresha0123@gmail.com. Thank you for your support!\n\nhttps://www.youtube.com/@diffiCULTresearch\n\nGRAPHIC CONTENT ADVISORY WARNING:\nThis video may contain video and/or audio content and/or discussions that are graphic in nature, and may be disturbing to some viewers. Viewer discretion is advised.\n\nCRIMINALITY WARNING:\nAll suspects are presumed innocent until proven guilty beyond a reasonable doubt in a court of law. Any and all opinions stated herein are speculative in nature, and are in no way intended to predict or affect affect the ultimate outcome of a case or court proceeding.\n\nFAIR USE DISCLAIMER:\nThis video qualifies as \u0022fair use\u0022 under multiple factors as defined in Section 107 of the Copyright Act, which defines fair use as follows: \n\nThe fair use of a copyrighted work, including such use by reproduction in copies or phonorecords or by any other means specified by that section, for purposes such as criticism, comment, news reporting, teaching (including multiple copies for classroom use), scholarship, or research, is not an infringement of copyright. \n\nThis content is not produced for commercial purposes, and in no way prohibits or restricts the original content creator from profiting from their original product.",
      "release": "2025-02-26T03:41:44Z",
      "duration": "02:29:04",
      "explicit": false,
      "youTubeId": "l8DoLERfoKw",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=l8DoLERfoKw"
      }
    }
  ]
}