{
  "id": "ac37becb-a7e5-4494-a3d4-0a72f486bd96",
  "name": "Joseph Szimhart",
  "youTubeChannelId": "UCPySlzmlPrwOJN-YGRVK28Q",
  "episodes": [
    {
      "id": "5c2348e1-214f-49e2-bc05-1d32c382be53",
      "title": "On OBE, Simulations, the Matrix and occultists on the “Nature of Reality”",
      "description": "Alisha Brache, Lisa M Harrison, Darius J Wright, “Athena” and hundreds of other psychics online are influencers who claim that humans live in a “simulation” or matrix controlled by dark forces or lower energies that keep us ignorant and trapped. I briefly explore the roots of this recurring theme through some history. I also suggest that every one of these influencers will trap you in a more constricted matrix or world of their own psychic construction while promising to help you escape the big matrix that they define for you. OBEs are nothing more than a disorder called dissociation whether you bring it on consciously through auto suggestion or it happens spontaneously from stress. Teaching people to dissociate to reach the “other side” is dumb and possibly dangerous.",
      "release": "2024-01-27T17:08:41Z",
      "duration": "00:22:31",
      "explicit": false,
      "youTubeId": "072xkpZKAgs",
      "subjects": [
        "Theosophical Society",
        "Saint Germain Foundation",
        "Ramtha\u0027s School of Enlightenment"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=072xkpZKAgs"
      }
    },
    {
      "id": "c22f5529-0dd7-472e-8f06-366cf54c59d1",
      "title": "Jesus Solstice Christ? Conflation of myth",
      "description": "Winter Solstice celebrations worldwide predate by millennia the establishment of Christmas December 25 in the 4rth Century as the birthday of Jesus. I comment on the faulty conflation of Mithra worship with the “Christ myth” popularized in the late 19th century and repeated by pseudo scholars like Acharya S. \nIn any case, may all solstice and Christian celebrations at this time of year emphasize kindness to your sisters and brothers who view that time differently.",
      "release": "2023-12-21T23:13:06Z",
      "duration": "00:12:34",
      "explicit": false,
      "youTubeId": "FBLYopek3dw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FBLYopek3dw"
      }
    },
    {
      "id": "4a02d9d7-05df-4843-8b17-3abcef632acc",
      "title": "Ascended Master Blood and the Gold Standard",
      "description": "Occultists and seekers worldwide yearn for a return or reemergence of the Golden Age of Perennial Wisdom or Satya Yuga. Current Ascended Master cults yearn for the same New Age and offer urgent teachings for self transformation to bring that about. \n\nThis short talk is about Ichor and the golden amber fluid in the veins of Greek gods that somehow emerges in modern cults that teach the their godlike Ascended Masters have that same amber golden fluid in their veins. \n\nOf interest is the correlation of this golden blood and age idol to arch-conservatives as well as flaky New Agers who believe that gold has sacred qualities and thus we should go back to a “gold standard” in our economies.",
      "release": "2023-12-01T17:04:16Z",
      "duration": "00:09:47",
      "explicit": false,
      "youTubeId": "FHYu9la_BAg",
      "subjects": [
        "\u0022I AM\u0022 Activity"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FHYu9la_BAg"
      }
    },
    {
      "id": "687ba8e3-3a11-4357-adfb-761f7bbcd8c5",
      "title": "GEOTRAN, Morphogenetic Fields, and Applied-Kinesiology",
      "description": "We will look into a newer self-help and success guide called GEOTRAN that bases its reality on the pseudoscientific claims about “morphogenetic fields” by fringe scientist, Rupert Sheldrake. GEOTRAN also leans on Applied-Kinesiology invented in the 1960s by a chiropractor who claimed that his “muscle testing” technique will answer questions about health, spirituality, and life choices. \n\nGETRAN is popular with life coaches. It has similarities to The Silva Method from the 1950s, Scientology, Reiki, Radionics, acupuncture, and Ayurvedic medicines. \n\nhttps://en.m.wikipedia.org/wiki/Applied_kinesiology\n\nhttps://en.m.wikipedia.org/wiki/Rupert_Sheldrake\n\nhttps://www.geotran.com/\n\nhttps://quackwatch.org/ncahf/articles/o-r/radionics/",
      "release": "2023-11-28T22:45:15Z",
      "duration": "00:12:26",
      "explicit": false,
      "youTubeId": "xGmfNJ5DXjE",
      "subjects": [
        "Scientology",
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xGmfNJ5DXjE"
      }
    },
    {
      "id": "c5201e56-8d15-40dd-b5de-5b64f5bac6d3",
      "title": "Twin Flames burn again on Netflix",
      "description": "Responding to new Netflix series “ Escaping Twin Flames”, a very good documentary with keen insight into how cult leaders manipulate unwary cult members. \n\nhttps://youtu.be/lFsJNp1aho4?si=BwcbxmBXiVeysf-1\nMy first Twin Flame video link above. \n\nI refer to The Plato Cult by David Stove (1991) as a useful philosophical read to help ex members correct their bad thinking habits that likely got them into a cult like Twin Flames Universe. \n\nForgive my errors. Eg, I called David Stove “Anthony”.",
      "release": "2023-11-11T15:30:12Z",
      "duration": "00:17:32",
      "explicit": false,
      "youTubeId": "vw5QQ9r97Ss",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vw5QQ9r97Ss"
      }
    },
    {
      "id": "6fb1de1f-89e2-4560-afcc-12398f881149",
      "title": "“Haunted” Pennhurst Asylum",
      "description": "In this video, I mention that 41% of Americans believe ghosts and ufo aliens are real. I mistakenly said that\u0027s 150 thousands of ...",
      "release": "2023-10-31T20:50:30Z",
      "duration": "00:13:04",
      "explicit": false,
      "youTubeId": "kCEfH8-0vqY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kCEfH8-0vqY"
      }
    },
    {
      "id": "35fab200-6b87-4de1-9ee8-206cf6e641db",
      "title": "Ramana Maharshi. Meher Baba, Paul Brunton, and banal mysticism",
      "description": "Ramana Maharshi and Meher Baba have been touted as the most significant mystics of the 20th Century. Paul Brunton was a seeker who met and wrote about Ramana Maharshi, Meher Baba and there as truly enlightened yet criticized both as flawed human beings with flawed followings. Brunton himself was outed as a fraud or phony guru by Jeffrey Masson who grew up with “PB” living with his parents for 20 years. \n\nSee links for more info. \n\nMy point in this video is that claims of being one with God, the Absolute, Brahman, or the Oversoul may be true claims, but a rock can make the same claim of “unattachment” to human conscious and suffering. \n\nToo often, the ashrams and devotees surrounding gurus fall far short of the pure ideals spouted or presented by the guru. \n\nDictionary of World Religions (Keith Krim editor. 1981)\n\nhttps://www.britannica.com/biography/Ramana-Maharshi\n\nMuch Silence (bio of Meher Baba) 1974 \n\nMy Father’s Guru by J Masson, 1993\n\nhttps://www.amazon.com/My-Fathers-Guru-Spirituality-Disillusion/dp/0345452801\n\nThe Sensitives by Paul Brunton \n\nhttps://www.amazon.com/Sensitives-Dynamics-Dangers-Mysticism-Notebooks/dp/0943914345",
      "release": "2023-09-24T20:41:10Z",
      "duration": "00:15:42",
      "explicit": false,
      "youTubeId": "ACoMyCAh5F4",
      "subjects": [
        "Ramana Maharshi",
        "Meher Baba"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ACoMyCAh5F4"
      }
    },
    {
      "id": "d3232cf1-ea5e-43a3-a28c-f135ecd04878",
      "title": "What is a “genuine” religion?",
      "description": "One of my subscribers noted that I might be skeptical of all religion, therefore none are “genuine” in my view. Asking what is a genuine religion can get you into deep trouble. I briefly examine the roots of what genuine, authentic and true can mean. I use two ‘mushrooms’ to illustrate.",
      "release": "2023-08-12T16:58:16Z",
      "duration": "00:09:27",
      "explicit": false,
      "youTubeId": "-EjXW5BrHF0",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-EjXW5BrHF0"
      }
    },
    {
      "id": "37c14a16-492c-45b2-877b-5905b9b458ac",
      "title": "Apocalypse Christianity and Post-modern Art Are Similar",
      "description": "I compare the edgy art of Basquiat (died 1988 at age 27) today selling in the tens of millions of dollars with Apocalyptic sects in Christianity based on 100 year old Fundamentalist ideas. To people uninitiated to modern art history, Basquiat art seems bizarre and atrocious. Why would anyone value it? The same remains true of Fundamentalism that to outsiders and many scholars appears as a disturbing distortion to faith. \nSo, both fundamentalism and many aspects of modern art are “populist” or primitive in style. Basquiat appeared as a tag prophet from the graffiti streets to sell to collectors through major galleries. Most of fundamentalism came from populist itinerant preachers who, like Billy Graham sold it in major “galleries” raising radical evangelical ideas into lucrative political capital. \n\n\nI refer to American Apocalypse by Matthew Sutton. \n\nhttps://en.m.wikipedia.org/wiki/Jean-Michel_Basquiat\n\nhttps://www.hup.harvard.edu/catalog.php?isbn=9780674975439",
      "release": "2023-07-31T22:06:40Z",
      "duration": "00:12:18",
      "explicit": false,
      "youTubeId": "xHm3rXkSqvY",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xHm3rXkSqvY"
      }
    },
    {
      "id": "8cb94694-cbcd-4dc0-8255-267dab4587e0",
      "title": "Nietzsche, Satori, Mushrooms",
      "description": "A quote from Nietzsche introduces my novel “Mushroom Satori: The cult diary” published in 2013. I discuss Nietzsche’s ideas in relation to the book and to today, July 21, being my mothers 99th birthday. The significance of writing, freedom, suicide, and insanity are other themes. \n\nhttps://www.amazon.com/Mushroom-Satori-Diary-Joseph-Szimhart/dp/0985002697\n\nhttps://en.m.wikipedia.org/wiki/The_Gay_Science\n\nhttps://www.faculty.umb.edu/gary_zabel/Phil_100/Nietzsche_files/Friedrich-Nietzsche-Twilight-of-the-Idols-or-How-to-Philosophize-With-the-Hammer-Translated-by-Richard-Polt.pdf",
      "release": "2023-07-21T17:25:34Z",
      "duration": "00:17:48",
      "explicit": false,
      "youTubeId": "fM4mDBpj9zQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fM4mDBpj9zQ"
      }
    },
    {
      "id": "0b3d8721-c5ee-4790-aca0-ca4e5849e3e5",
      "title": "Jesus lost years in India conspiracy myths.",
      "description": "All reliable sources say that the stories about Jesus traveling and perhaps dying in India are either fabricated lies or results of poor scholarship based on hoax manuscripts. \nMy video was triggered by this 2016 Jesus in India presentation by Edward Martin at a Hindu center in Austin:\n\nhttps://youtu.be/xHPVHshW0hU\n\nWe look at the main source hoaxer N. Notovitch and another misguided cult leader, Ghulam Ahmad, who claimed in 1889 that Jesus did not die on the cross but lived and died in Kashmir at an old age. \n\nhttps://en.m.wikipedia.org/wiki/Jesus_in_India_(book)\n\nBart Erhman blog on this:\n\nhttps://ehrmanblog.org/did-jesus-go-to-india-a-modern-gospel-forgery/\n\nSathya Sai Baba fake miracles \n\nhttp://www.exbaba.com/articles/p_holbach/dbbooke/cont.htm",
      "release": "2023-06-20T15:12:50Z",
      "duration": "00:16:07",
      "explicit": false,
      "youTubeId": "3Cqhcly_mXM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3Cqhcly_mXM"
      }
    },
    {
      "id": "5b414a03-db78-4073-854c-674c4a17a567",
      "title": "Jung, the occult, and astrology of Liz Greene.",
      "description": "Robert Ellwood in The Politics of Myth  called Carl G. Jung along with Mircea Eliade and Joseph Campbell the “Midcentury Mythic Trinity.”  I look into Ellwood’s account of Jung and his colleagues who “dallied” with fascism in the 1930s and why. Also, famous UK astrologer Liz Greene applies Jungian ideas to her astrological readings. \nWe explore how Jung’s idea is\nIndividuating can lead to cultic participation. \n\nhttps://sunypress.edu/Books/T/The-Politics-of-Myth2\n\nhttps://en.m.wikipedia.org/wiki/Liz_Greene\n\nhttps://www.amazon.com/Jungs-Studies-Astrology-Liz-Greene/dp/1138289124\n\nhttps://www.theosophical.org/publications/quest-magazine/4505",
      "release": "2023-06-19T17:45:38Z",
      "duration": "00:15:13",
      "explicit": false,
      "youTubeId": "lGJvSDFC_aE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lGJvSDFC_aE"
      }
    },
    {
      "id": "d4225974-715d-45be-b3fa-449e6bef9c5d",
      "title": "Fred Rama Lenz, Carlos Castaneda. @AtrocityGuide",
      "description": "Look at this story below by Atrocity Guide to get a clear idea of who Fred “Zen Master Rama” Lenz was: \n\nhttps://youtu.be/urMxgevzd4c\n\nMy short video adds information about the influence of Carlos Castaneda on Lenz  whose character Master Fwap in his novel Surfing the Himalaya is modeled on Castaneda’s don Juan. Both Fwap and don Juan are fabrications by hoax writers of spiritual adventure fiction.",
      "release": "2023-06-13T17:00:12Z",
      "duration": "00:05:33",
      "explicit": false,
      "youTubeId": "KIxeLtK-yCw",
      "subjects": [
        "Zen Master Rama"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KIxeLtK-yCw"
      }
    },
    {
      "id": "dfa6d663-6b79-4f66-8333-c2660d23f610",
      "title": "Liana Shanti court case: recommends to reveal her criminal history",
      "description": "On June 5 US District Court in Hawaii recommended that Liana Shanti / Liane Wilson post weekly on all her social media accounts that she has a criminal record of fraud regarding bankruptcy and that she’s been on probation (not parole, as I say in video). \nI read from court transcript of the defendant Liane W admitting to a “panic disorder” after the judge asked her to stop “racing” in her speech during her rambling, unconvincing defense.",
      "release": "2023-06-06T13:21:21Z",
      "duration": "00:09:41",
      "explicit": false,
      "youTubeId": "NsQxfP-fVQk",
      "subjects": [
        "Liana Shanti"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NsQxfP-fVQk"
      }
    },
    {
      "id": "625e594e-0c24-4947-a336-376efce300b5",
      "title": "Proverbs 12:1 and cult leaders as braggart-dimwits.",
      "description": "Whoever loves discipline loves knowledge, but whoever hates correction is stupid. (Proverbs 12:1, New International Version of the Bible)\n\nGrandiose cult leaders tend to hate correction. That dim witted side is overshadowed by the braggart side that devoted followers want to see and hear. \n\nCritics are called losers, stupid, evil, etc. the latter occurs in conservative Christian homeschooling that, for example, uses a “rod” or spanking to discipline children who might question the “standards” of the ruling father. Proverbs 12:1 is weaponized in such cults reversing the noble intent of the Proverb.",
      "release": "2023-06-03T13:57:02Z",
      "duration": "00:07:37",
      "explicit": false,
      "youTubeId": "s7WJeZiWTzc",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=s7WJeZiWTzc"
      }
    },
    {
      "id": "1e3f518a-2130-4b70-a3c4-38239ba570ae",
      "title": "Crystals, Pendulums, Sage: How real is the energy?",
      "description": "Magical or spiritual power in objects, relics, and thought or prayer has a long, enduring history in human culture. Animals pay no attention to it. So, who is smarter?  The answer is not simple. I address the use of crystals, pendulums, and the Bull Roarer.\n\nhttps://skeptics.stackexchange.com/questions/19220/do-pendulums-have-any-explanatory-power\n\nhttps://www.skepticblog.org/2008/12/19/pendulums/",
      "release": "2023-05-22T16:42:32Z",
      "duration": "00:14:32",
      "explicit": false,
      "youTubeId": "1bF3EX50MXg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1bF3EX50MXg"
      }
    },
    {
      "id": "ab1dd450-2009-481e-98c7-81cf5a3246a5",
      "title": "NRM or Cult? The Prosperos and Daughters of Bilitis",
      "description": "Following up on last video comparing New Religious Movement with cult. Examples are The Prosperos led by Thane Walker (?1900-1989), a mix of New Thought, the Gurdjieff (died 1949)  Fourth Way cult, astrology, theater, and elite teacher/student relationships. I read an article about 2 members of the first Lesbian advocacy group founded in 1955 who joined The Prosperos between 1965 -1970 and as ex members called it a “New Age sect or cult.” \n\n(Btw, i mispronounced Bilitis that should sound more like bi-lee-tis. Also, The Ladder ceased publication in 1972, not in the 1990s as I blurted out!)\n\nWalker’s group name was from the magician Prospero in The Tempest by Shakespeare. \n\nhttps://www.theprosperos.org/\n\nhttps://www.amazon.com/Bodies-Evidence-Practice-History-Oxford/dp/0199742731\n\nhttps://en.m.wikipedia.org/wiki/\n\nThe_Ladder_(magazine)\n\nhttps://www.encyclopedia.com/science/encyclopedias-almanacs-transcripts-and-maps/walker-thane-ca-1890",
      "release": "2023-04-30T19:11:08Z",
      "duration": "00:13:36",
      "explicit": false,
      "youTubeId": "xHrqxbpFuXU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xHrqxbpFuXU"
      }
    },
    {
      "id": "414ab856-0464-4345-9a91-21f6c7c2b361",
      "title": "Cult or New Religious Movement?",
      "description": "Words have impact on awareness and help others grasp what we mean and intend. For the past century, there’s been a debate in how to define and what to call troublesome, high demand groups. Two major camps emerged, one in sociology that uses New Religious Movement and another among some academics but mostly in public discussion that uses Cult. \n\nMy point here is that in the end we have to regard behavior and context first before we slap a label onto any group.",
      "release": "2023-04-29T15:43:15Z",
      "duration": "00:08:19",
      "explicit": false,
      "youTubeId": "5_CDbIz38hk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5_CDbIz38hk"
      }
    },
    {
      "id": "7771a51b-fca8-4247-9fa1-1881275063f0",
      "title": "When Shadow Meets the Bodhisattva: Andrew Cohen and Hegel’s totalism",
      "description": "Followup on previous comments on Andrew Cohen’s new book and evolution of consciousness project (cult?) called Manifest Nirvana. The latter project is based on two highly flawed if not outright false assumptions: that Andrew Cohen and company were ever “enlightened” and that “consciousness” evolves either according to K Wilber’s Spectrum of Consciousness scheme or in this generation’s lifetime. \n\nQuoting George Steiner from his slim collection of essays, In Bluebeard’s Castle (1971): “There are currently, particularly in the United States, some fashionable, silly theories about total revolution of consciousness. Mutations of internal structure do not occur at such a rate.” (In a Post-Culture, p 91).\n\nManifest Nirvana is a hoax. The very language encourages techniques and religious strategies (hybrid Western Buddhism) to mentally force Nirvana or enlightenment. Darwin would be amused at this comical thought experiment as would Kierkegaard. \n\nSee my take on Hegel via Kierkegaard \n\nhttps://youtu.be/mI0iv64FvIw\n\n#kenwilber\n#manifest.nirvana\n\nBook review here:\n\nhttps://www.jszimhart.com/reviews/when-shadow-meets-the-bodhisattva",
      "release": "2023-03-11T16:17:20Z",
      "duration": "00:14:47",
      "explicit": false,
      "youTubeId": "vfCh3Enn8wg",
      "subjects": [
        "Evolutionary Enlightenment"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vfCh3Enn8wg"
      }
    },
    {
      "id": "64123312-29b9-4282-8fed-10170cce9ded",
      "title": "Disgraced guru Andrew Cohen and his comeback book",
      "description": "Andrew Cohen, born to a secular Jewish family in 1955, claimed to be enlightened in 1986 in India, then started a movement with himself as guru. His motherLuna Tarlo became his disciple along with hundreds of others. I mention Cohen’s fall and that in 2013 hundreds of former cult members signed a document stating that Cohen should never teach again. \nKen Wilber continues to endorse Cohen who this year released a new book. \n\nhttps://www.themotherofgod.com/\n\nhttps://www.psychologytoday.com/us/articles/199803/crimes-the-soul\n\nhttps://centerforintegralwisdom.org/\n\nhttps://www.amazon.com/When-Shadow-Meets-Bodhisattva-Transformation-ebook/dp/B09WQ7RRRR",
      "release": "2023-02-18T23:21:49Z",
      "duration": "00:11:46",
      "explicit": false,
      "youTubeId": "N3zdbzJjTbM",
      "subjects": [
        "Evolutionary Enlightenment"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=N3zdbzJjTbM"
      }
    },
    {
      "id": "b2a2d35d-89c4-45c6-aa1e-d89136d4d0bc",
      "title": "Falun Gong and Fascism",
      "description": "Brief look at Falun Gong with readings from its founder Li Hongzhi’s book Zhuan Falun, the group’s links to Epoch Times and the dance Troupe Shen Yun. Comparison of Li Hongzhi to Benito Mussolini. Criticism of Falun Gong and its leader does not mean you favor the Communist Party. \n\nhttps://www.newyorker.com/culture/culture-desk/stepping-into-the-uncanny-unsettling-world-of-shen-yun\n\nFor an excellent video commentary,see this by JJ McCullough:\n\nhttps://youtu.be/1JaPzJKycxc\n\nSpy vs Spy\n\nhttps://youtu.be/onR7PD3Grc0\n\nMarinetti and Fascist influence \n\nhttps://en.m.wikipedia.org/wiki/Filippo_Tommaso_Marinetti#:~:text=In%20The%20Founding%20and%20Manifesto,for%20the%20importance%20of%20violence.",
      "release": "2023-01-28T21:47:09Z",
      "duration": "00:13:30",
      "explicit": false,
      "youTubeId": "LpnD7zEjE04",
      "subjects": [
        "Falun Gong"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LpnD7zEjE04"
      }
    },
    {
      "id": "bbf20172-a16e-4565-a343-d241eaa5678f",
      "title": "Three-Body Problem: social pressure personality disorder",
      "description": "Cixin Liu wrote the trilogy that began with The Three-Body Problem written in Chinese in 2011. It was translated into English around 2015 and soon followed by sequels that became international best sellers. An entire media industry of podcasts, reviews, illustrations, and a film series erupted based on Liu’s brilliant science fiction. \nMy interest here is in Liu’s inclusion in Death’s End of The Wave experiment run in 1967 by a high school teacher and in a “diagnosis” he introduces centuries into the future called “social pressure personality disorder.” \n\nSee my article for further information:\n\nhttps://www.jszimhart.com/reviews/social-pressure-personality-disorder-in-deaths-end-by-cixin-liu",
      "release": "2023-01-14T20:51:06Z",
      "duration": "00:11:33",
      "explicit": false,
      "youTubeId": "AwpM5a3SWx0",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AwpM5a3SWx0"
      }
    },
    {
      "id": "6da5b0b4-50aa-4847-b0c3-37b440ffaa21",
      "title": "Narcissistic clusters, cults, and Aboriginal sand talk",
      "description": "Sand Talk by Tyson Yunkaporta (2020) inspired this look at cults as narcissistic clusters that in the extreme become, in my words, Narcissistic Cluster F*cks. Approaching governance through respect, connect, reflect, and direct can create a sustainable relationship with the land, people, and diversity. \n\nhttps://www.amazon.com/Sand-Talk-Indigenous-Thinking-World/",
      "release": "2023-01-07T17:14:05Z",
      "duration": "00:09:50",
      "explicit": false,
      "youTubeId": "G9eJDdYDLI8",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G9eJDdYDLI8"
      }
    },
    {
      "id": "91be5e43-b6e6-421b-8553-23a0eabd1616",
      "title": "Edgar Cayce and The Atlantis Conspiracy",
      "description": "Edgar Cayce fans believe that he had real psychic powers, yet there is no solid evidence that he did. He was often very wrong or merely right due to a placebo effect. The Atlantis Conspiracy, a 1974 book by Dr Maxine Asher, promotes the Atlantis myth enhanced by dozens of Cayce “readings” about Atlantis and its alleged energized, magic crystals used to power Atlantean culture. \nGood scholarly source:\n\nhttps://www.academia.edu/37107075/Thinking_in_Continents_Hyperborea_and_Atlantis_in_Ren%C3%A9_Gu%C3%A9nons_Conception_of_Tradition\n\nI reference skeptical sources:\n\nhttps://www.amazon.com/How-Think-About-Weird-Things/dp/007353577X\n\nhttps://cdn.centerforinquiry.org/wp-content/uploads/sites/29/1996/01/22165048/p32.pdf\n\nThe Atlantis Conspiracy by Dr. Maxine Asher (1974)\n\nThis is good on Cayce in 7 minutes: \n\nhttps://youtu.be/KCg04Z5BeSA",
      "release": "2022-11-19T14:50:15Z",
      "duration": "00:10:44",
      "explicit": false,
      "youTubeId": "et3ZjKbFRjk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=et3ZjKbFRjk"
      }
    },
    {
      "id": "85a39ee2-b0d4-47a7-aa64-0f1220fd9ba3",
      "title": "Eckhart Tolle, mud, and blood: Part 2",
      "description": "I add information on another New Thought teacher, Wayne Dyer, and expand on my anecdote about the pit bull attack on my dog. The dog attack occurred 7 months ago. Dog is okay. \n\nI recently listened to video talk by Eckhart Tolle whose books I read 20 years ago. His reliance on New Thought and teachers like G. Gurdjieff and J. Krishnamurti I find troublesome and overvalued. \n\nThis talk is in 2 parts.\n\nCritic of Tolle: https://www.siftingtothetruth.com/blog/tag/Eckhart\u002BTolle\n\nTolle mentions Gurdjieff: https://www.youtube.com/watch?v=kElGPeqEasw\n\nhttps://en.m.wikipedia.org/wiki/Ken_Wilber\n\nNon dual philosopher Shankara:\n\nhttps://en.m.wikipedia.org/wiki/Adi_Shankara",
      "release": "2022-10-28T20:50:09Z",
      "duration": "00:13:16",
      "explicit": false,
      "youTubeId": "7FHiwlsJRbE",
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7FHiwlsJRbE"
      }
    },
    {
      "id": "e7cc382f-e0b3-4c55-a1ef-0a1875e4fe6b",
      "title": "Eckhart Tolle, mud, and blood: Part 1",
      "description": "I recently listened to video talk by Eckhart Tolle whose books I read 20 years ago. His reliance on New Thought and teachers like G. Gurdjieff and J. Krishnamurti I find troublesome and overvalued. \nThe dog attack mentioned occurred 7 months ago. Dog is okay. \n\nThis talk is in 2 parts.\n\nCritic of Tolle: https://www.siftingtothetruth.com/blog/tag/Eckhart\u002BTolle\n\nTolle mentions Gurdjieff: https://www.youtube.com/watch?v=kElGPeqEasw\n\nhttps://en.m.wikipedia.org/wiki/Ken_Wilber\n\nNon dual philosopher Shankara:\n\nhttps://en.m.wikipedia.org/wiki/Adi_Shankara",
      "release": "2022-10-28T20:30:13Z",
      "duration": "00:13:08",
      "explicit": false,
      "youTubeId": "RfZGQ7mW1nM",
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RfZGQ7mW1nM"
      }
    },
    {
      "id": "54b346d1-ea15-4d1f-8968-61cf0aa7e7fe",
      "title": "Stefan Molyneux, Liana Shanti, A Course In Miracles, and Garbage Eaters",
      "description": "Stefan Molyneux, Liana Shanti, A Course In Miracles, and Garbage Eaters is a comparison video about how groups and group leaders influence followers and students to cut ties with family for specious psychological reasons and misinterpreted scriptures. I also show, despite Liana’s claim that ACIM is “”satanic,” that her approach to Jesus is quite similar to ACIM, using the same phobia indoctrination of end times prophecy.\n\nOn ACIM:\nhttps://www.jszimhart.com/essays/project-one-tt3yk\n\nOn Garbage Eaters:\nhttps://en.m.wikipedia.org/wiki/The_Brethren_(Jim_Roberts_group)\n\nhttps://www.lianashanti.com/\n\nOn Stefan Molyneux:\n\nhttps://en.m.wikipedia.org/wiki/Stefan_Molyneux",
      "release": "2022-10-09T19:49:59Z",
      "duration": "00:15:35",
      "explicit": false,
      "youTubeId": "UjJCvF7pObc",
      "subjects": [
        "Liana Shanti"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UjJCvF7pObc"
      }
    },
    {
      "id": "9e8239ae-1bf0-47a3-ab48-5a540ed41b9c",
      "title": "Liana Shanti, Lemuria, Akashic Records, and Blavatsky.",
      "description": "Liana Shanti along with hoards of common psychics claim to tap into Akashic Records and ancient wisdom from Lemuria. In LS’s case, she offers a “Lemurian Mystery School” initiation for a price. This video shows that the Lemurian civilization did not exist and that Akashic Records do not exist. Both concepts or fake memes were largely concocted by Madame Blavatsky in the late 19th Century. See:\n\nhttps://www.amazon.com/Masters-Revealed-Madame-Blavatsky-Great/dp/0791420647\n\nhttps://en.m.wikipedia.org/wiki/Lemuria\n\nhttps://en.m.wikipedia.org/wiki/Akasha\n\nhttps://programs.lianashanti.com/\n\nOccult America by John Godwin (1972) p 132-133 on Blavatsky’s influence.",
      "release": "2022-09-28T13:15:59Z",
      "duration": "00:09:45",
      "explicit": false,
      "youTubeId": "ZcL3XJz1ytQ",
      "subjects": [
        "Liana Shanti"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZcL3XJz1ytQ"
      }
    },
    {
      "id": "33aa25f3-5321-40b5-a076-55c36a9001e8",
      "title": "Liana Shanti and “I AM” Activity",
      "description": "lianashanti.com is the topic \n\nLiana Shanti is an online enterprise as a dietary advisor, neo shaman, channel or seer for Jesus, astrology interpreter, ant-Covid vaxxer who critiques the “parent cult” and other bad influences that keep people wounded and from gaining their ascension to heaven like Jesus did. \nLinks as reference:\n\nhttps://forum.culteducation.com/read.php?12,159923\n\nhttps://www.britannica.com/topic/I-AM-movement\n\nhttps://en.m.wikipedia.org/wiki/Ramtha%27s_School_of_Enlightenment\n\nhttps://en.m.wikipedia.org/wiki/Psychiana\n\nhttps://www.google.com/search?q=courage\u002Bto\u002Bheal\u002Bbass\u002Bcontroversy\u0026rlz=1CDGOYI_enUS736US736\u0026oq=courage\u002Bto\u002Bheal\u002Bbass\u002Bcontroversy\u0026aqs=chrome..69i57j0i546j0i30i546j0i546l2.17681j0j4\u0026hl=en-US\u0026sourceid=chrome-mobile\u0026ie=UTF-8\n\nhttps://supreme.justia.com/cases/federal/us/322/78/",
      "release": "2022-09-24T18:49:35Z",
      "duration": "00:14:25",
      "explicit": false,
      "youTubeId": "NH8WeCStB4A",
      "subjects": [
        "Liana Shanti",
        "Saint Germain Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NH8WeCStB4A"
      }
    },
    {
      "id": "35f857be-b553-4f45-84ae-f2797015f4b9",
      "title": "Bias is as bias does. Am I biased?",
      "description": "Over the years I’ve been a used of having a bias, so in this video we look at bias, why it’s necessary and how it can also be way off a reality base. \n\nWe cannot make clothing without cutting fabric on a bias. The problem is that there is a bias but the the bias may be off, resulting in an unwearable product. \n\nWe look at an example of extreme bias in tailoring as we regard the story of “The Emperor’s New Clothes.” Only enlightened people could see the naked emperor’s clothes. \n\nSo, the errant bias in extreme points of view can lead to Totalism that demands that we either believe or remain stupid.",
      "release": "2022-08-02T16:58:37Z",
      "duration": "00:07:23",
      "explicit": false,
      "youTubeId": "fsHsrjTBObE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fsHsrjTBObE"
      }
    },
    {
      "id": "e322f7e7-5e52-4800-85bf-fef748e76df1",
      "title": "Padre Pio, fascism and healing",
      "description": "I discuss a large shrine to St. Padre Pio I visited recently outside of Barto, PA. My sister who passed away from cancer in May of this year had lit a votive candle there last summer to plea for healing. I reference the historical analysis of Pio (1887-1968) by Sergio Luzzatto in his Padre Pio: Miracles and Politics in a Secular Age (2010).\n“A case of stigmata” in JAMA Psychiatry, and “The Stigmatics/science/The Guardian 2004 13 Oct.",
      "release": "2022-07-10T20:35:33Z",
      "duration": "00:11:18",
      "explicit": false,
      "youTubeId": "F0YwnZvWUok",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F0YwnZvWUok"
      }
    },
    {
      "id": "e375f076-5362-4599-b924-3b4d9710a033",
      "title": "Mars, Myth, and Musk",
      "description": "In his 1964 novel The Simulacra, P K Dick offers a post WW3 world around 2050 ruled by authoritarian regimes but with an option to emigrate on “jalopies” for a no return trip to Mars where humans and androids live in rudimentary colonies. I look at various Mars quests through fiction (John Carter series by Burroughs), occultists (Rudolf Steiner, Elizabeth Prophet), and the failed Biosphere 2 project headed by cult leader Johnny Dolphin Allen. I mention Elon Musk’s SpaceX dream to colonize Mars within the coming decades.\n\nhttps://www.retroreport.org/transcript/biosphere-2-an-american-space-odyssey/\n\nBuddha on Mars: \nhttps://rsarchive.org/Lectures/GA130/English/RSP1950/19121218p01.html",
      "release": "2022-05-07T15:28:47Z",
      "duration": "00:12:45",
      "explicit": false,
      "youTubeId": "zW7vzGwR02Y",
      "subjects": [
        "Saint Germain Foundation",
        "Anthroposophy"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zW7vzGwR02Y"
      }
    },
    {
      "id": "a1a96ddd-cd8f-4b70-b141-28f6f7af14e4",
      "title": "Brainwashing, Gravity, and Science",
      "description": "Gravity and brainwashing theories are not based in science fact. No one knows why we have gravitational activity or what exactly defines brainwashing. I’ll examine how I use “orbiting” as a metaphor for how so-called brainwashing works. \n\nhttps://ncse.ngo/gravity-its-only-theory#:~:text=Universal%20Gravity%20is%20a%20theory,not%20even%20a%20good%20theory.\nMisunderstanding Cults by Zablocki \u0026 Robbins\nhttps://www.jstor.org/stable/10.3138/9781442677302\n\nhttps://genius.com/Bob-dylan-ballad-of-a-thin-man-lyrics\n\nhttps://en.m.wikipedia.org/wiki/Dick_Anthony\n\nNew Vigilantes\n\nhttps://www.amazon.com/New-Vigilantes-Deprogrammers-Anti-Cultists-Religions/dp/080391542X\n\nTed Patrick\n\nhttps://www.amazon.com/Let-our-children-Ted-Patrick/dp/0525144501",
      "release": "2022-04-28T19:50:03Z",
      "duration": "00:11:39",
      "explicit": false,
      "youTubeId": "qbNECRgCRAE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qbNECRgCRAE"
      }
    },
    {
      "id": "18f29a3e-fd04-4c8e-b57b-14491d605e4e",
      "title": "Karma, Economy, Koch and the Mont Pelerin Society",
      "description": "Referring to Democracy in Chains by Nancy MacLean 2017 and to The Vedic Origins of Karma by Herman Tull 1989 to comment on how karma and economy are meant among followers of Mont Pelerin Society (established 1947 by libertarian economists who adhere to “public choice” theory as defined by James M Buchanan and Milton Friedman. \nAlso refer to “Karma tastes rich in new, humane economy” by K Parker (Seattle Times April 17 2016. \nAnd to illustration by John Knott 1918 “It shoots further than he dreams”",
      "release": "2022-04-20T17:52:05Z",
      "duration": "00:16:31",
      "explicit": false,
      "youTubeId": "NSb9M7lTL00",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NSb9M7lTL00"
      }
    },
    {
      "id": "25fca774-bf05-4243-bff1-9c72aed23af2",
      "title": "John Birch, Elizabeth Prophet, Communist conspiracies.",
      "description": "New book by Edward Miller: A Conspiratorial Life, Robert Welch, The John Birch Society, and the Revolution of American Conservatism (2021). \nI talk about parallels to Church Universal \u0026 Triumphant and my old cult leader, Elizabeth Prophet.  Reference Church Universal \u0026 Triumphant (an apocalyptic movement) by Bradley Whitsel (2003).",
      "release": "2022-04-09T22:49:05Z",
      "duration": "00:09:57",
      "explicit": false,
      "youTubeId": "TfauFqOhqtk",
      "subjects": [
        "Saint Germain Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TfauFqOhqtk"
      }
    },
    {
      "id": "c7dbcfc8-80ea-4789-9580-fdcaf20b30ff",
      "title": "Putin’s Brain 2: Traditionalism, Fundamentalism, end-times, and Kali Yuga.",
      "description": "Another look at “Putin’s brain”, Traditionalism, and Fundamentalism. Referencing Mark Sedgwick’s book Against the Modern World (2004). Both Traditionalism and Fundamentalism want to see an end to modernity and progressivism even if it means an Apocalyptic bloodbath predicted in the Book of Revelations and the Hindu prophecies about the Kali Yuga.",
      "release": "2022-04-01T22:34:02Z",
      "duration": "00:11:45",
      "explicit": false,
      "youTubeId": "rUzGOChWLWw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rUzGOChWLWw"
      }
    },
    {
      "id": "57d8e1ce-3224-48b5-b43e-831371b97884",
      "title": "Tucker Carlson and the Cult of Coronavirus",
      "description": "On 7/28/2021 Fox News published a a Tucker Carlson opinion titled “Christianity is dying and being replaced by cult of coronavirus”\n\nI make some observations including correcting his mawkish claim that America was once a “Christian nation.”",
      "release": "2022-03-27T22:51:28Z",
      "duration": "00:08:12",
      "explicit": false,
      "youTubeId": "WhXcn2Wqifo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WhXcn2Wqifo"
      }
    },
    {
      "id": "19ed8e3c-9678-4982-b56d-6c94fd3f87c5",
      "title": "Putin’s Brain and Traditionalism",
      "description": "Response to the Russian invasion of Ukraine. My Hungarian parents were refugees after WW2 and they met in a DP camp in Pocking, Germany where I was born in 1947. We arrived in America in 1951. My mother 97 finds the news about Ukraine painful to watch. \n\nI discuss the influence of Traditionalism grounded in the work of Rene Guenon, Martin Heidegger, and Julius Evola on Putin’s chief ideolog Alex Dugin, of Steve Bannon, and others on the Christian far right. \n\nI first read Guenon around 1981 with deep interest but years later rejection his Traditionalism as too authoritarian and wrongheaded. \n\nhttps://www.amazon.com/Against-Modern-World-Traditionalism-Intellectual/dp/0195396014\n\nhttps://www.newstatesman.com/ideas/2020/10/rise-traditionalists-how-mystical-doctrine-reshaping-right\n\nhttps://theconversation.com/alexander-dugin-eurasianism-and-the-american-election-87367\n\nThe Devil’s Bargain by Joshua Green\n\nhttps://www.academia.edu/40386287/Mysteries_of_Eurasia_The_Esoteric_Sources_of_Alexander_Dugin_and_the_Yuzhinsky_Circle?email_work_card=view-paper",
      "release": "2022-03-05T20:58:38Z",
      "duration": "00:15:49",
      "explicit": false,
      "youTubeId": "DcRClN0mVfw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DcRClN0mVfw"
      }
    },
    {
      "id": "8f7d605d-3457-4123-b633-0cfdd7a81d86",
      "title": "Idealism and Realism: 2 ways to harmful cult behavior",
      "description": "I reference a Great Courses lecture by Professor William Cook on “The Catholic Church: A History” to explore different tendencies in religion and cult behavior. St. Augustine of Hippo emphasized grace and faith as well as “God’s hidden election of those to whom God freely gives the gift of love,” whereas St Thomas Aquinas “was committed to the notion that grace goes not destroy nature but perfects it.” (Dictionary of World Religions, K Crim, Ed.). These tendencies lead to conservative and progressive movements respectively. Both tendencies can lead to harmful cult behavior when deception, manipulation, and dispensing of existence occur. Healthy movements employ transparency, education, and a fair means of choosing out.",
      "release": "2022-01-30T16:03:27Z",
      "duration": "00:11:26",
      "explicit": false,
      "youTubeId": "3X10pOpVD9M",
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3X10pOpVD9M"
      }
    },
    {
      "id": "fdc822bc-81ee-444c-9967-e6161ac7eee6",
      "title": "Dressmakers of Auschwitz, loaded questions, and QAnon",
      "description": "Loaded questions like “Are you a Jew?” often betray bias in the questioner as someone using loaded language as a simplistic emotional basis for grasping reality. I reference a new, bestseller by fashion historian Lucy Adlington (2021), The Dressmakers of Auschwitz: The true story of the women who sewed to survive.  I mention the QAnon movement that has elements of anti-semitism in it as Q folk sow hate toward the “Elites” that run the world and ruin their lives. Persistent in this idea of an elite “Cabal if Satanists” is the ZOG or Zionist Occupation Government, a favorite whipping post for white supremacy cults for over a century. \n\nhttps://www.bbc.com/news/av/world-us-canada-59888867\n\nhttps://www.amazon.com/Dressmakers-Auschwitz-Story-Women-Survive/dp/0063118882",
      "release": "2022-01-08T17:07:48Z",
      "duration": "00:15:23",
      "explicit": false,
      "youTubeId": "5uPzFIIimgw",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5uPzFIIimgw"
      }
    },
    {
      "id": "ab9b1f97-41ba-4357-9055-abad030335f1",
      "title": "Anti-Semitic roots in Rosicrucianism’s “Q-drops”",
      "description": "Following up on Twin Flames video to indicate the Rosicrucian/Theosophical sources of Antisemitism. I read from Rosicrucian Cosmo-Conception by Heindel (1909: 334-335) and The Coming Race by Bulwer-Lytton (1873)",
      "release": "2021-12-21T16:37:03Z",
      "duration": "00:12:50",
      "explicit": false,
      "youTubeId": "r324uiU3QAQ",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r324uiU3QAQ"
      }
    },
    {
      "id": "0cdfe115-51b6-49d3-9a1f-ba9956d2961a",
      "title": "Twin Flame cults and their origins in Rosicrucian lore",
      "description": "Twin Flames are more intense and cosmically guided than soul mate relationships. If you believe that, you are ripe for recruitment into a variety of cults and abusive relationships w spiritual guides who charge thousands of dollars for workshops and guidance as you seek your “true self.”  I talk about my own twin flame journey under the teachings of Elizabeth Prophet and her cult that inspires many of the new Twin Flame journey programs out there. The I AM Activity and Rosicrucians are mentioned.",
      "release": "2021-12-21T15:12:57Z",
      "duration": "00:12:42",
      "explicit": false,
      "youTubeId": "lFsJNp1aho4",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lFsJNp1aho4"
      }
    },
    {
      "id": "d5b283d0-dd7a-4f94-b8d7-2bd6113d3af2",
      "title": "RFK Jr, Covid vaccine, Proverbs 12:1",
      "description": "Antivaxxers come in varieties of certainty. While some are cautionary, others can be downright fixated. An acquaintance from decades ago, a successful businessman, has been feeding me antivax videos to prove that Dr Fauci is a criminal along with Bill Gates and George Soros. I’ve watched most and gave him feedback that he never likes. Here, I mention recent video interviews by Theo Von with Robert F Kennedy Jr #370 and another by Tony Lin who suggest that the Vaccines are ineffective and doing more harm than good. Proverbs 12:1 states He who hates correction is stupid. So, this cuts both ways because from the rigid antivaxx position, I can’t be corrected, therefore….I’m stupid.\nMy conversation over RFK Jr ended with my opponent calling me a “millennial snowflake liberal” and telling me to “f#ck off.”",
      "release": "2021-12-19T00:59:08Z",
      "duration": "00:09:13",
      "explicit": false,
      "youTubeId": "xS21UAbJqPM",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xS21UAbJqPM"
      }
    },
    {
      "id": "35824d2a-8818-4ee6-b81c-aa9da15378c2",
      "title": "Does it pass the smell test? Suggestion and reality",
      "description": "Last year I had a mild case of Covid and lost my sense of smell. This video looks how smell and taste can by influenced by disease as well as suggestion. Our “taste” for an idea, art object, or political view can be altered dramatically by suggestion or “influence communication.”  \n\nhttps://pubmed.ncbi.nlm.nih.gov/26599992/",
      "release": "2021-12-13T17:31:02Z",
      "duration": "00:08:24",
      "explicit": false,
      "youTubeId": "GwEMtpg4P5c",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GwEMtpg4P5c"
      }
    },
    {
      "id": "852f8751-ca0b-454c-8457-42e9bc99c7e0",
      "title": "Braves, Bombs, Christian Identity",
      "description": "In 1997, I took my dad to a Braves baseball game in Atlanta for his 75th birthday. We visited Centennial Park where in 1996 at the Olympics, a bomb went off killing 2 wounding 100. Eric Rudolf was arrested in 2003 and confessed to the bombing in 2005. I delve into his confession and his roots in white supremacy. I also discuss wounded narcissism as Rudolf’s state of mind.",
      "release": "2021-11-20T16:44:23Z",
      "duration": "00:14:18",
      "explicit": false,
      "youTubeId": "2da4oO6DDkE",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2da4oO6DDkE"
      }
    },
    {
      "id": "ffcfb0bf-3816-480d-a8da-0cf5af6bcf67",
      "title": "Satan. Good Fight Ministries, and the Civil War.",
      "description": "A subscriber asked that I comment on Good Fight Ministries founded by Pastor Joe Schimmel in 1987 as another form of Christian fundamentalism. Schimmel concentrates on fighting evil and has a very different take on Satan, Halloween, and the Gospel than I do. I reference The Death of Satan by Andrew Delbanco (1995) and Satanic Panic by Jeffrey Victor (1993).",
      "release": "2021-10-17T18:21:40Z",
      "duration": "00:17:07",
      "explicit": true,
      "youTubeId": "Lkb9qwh6NfA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Lkb9qwh6NfA"
      }
    },
    {
      "id": "321ae051-2133-41d8-b28e-83e4782a610e",
      "title": "Jan. 6, Lifton, Psychology of Totalism",
      "description": "In September 2021 a Florida man pleaded guilty to a misdemeanor for participating in the Jan. 6 raid and riot at the Capital. The judge said over a tele-court session, “You’ve disgraced this country…. “ He wanted to “lock him up” but legal guidelines would not allow it. I examine how someone who is later contrite managed to get caught up in the madness of cult-like behavior. I read from Though Reform and the Psychology of Totalism by Robert J Lifton (1961) to make the point that immoderate behavior can take in a momentum of its own with the leader getting caught up in the energy. I also reference Brainwashing: The Science of Thought Control by Kathleen Taylor (2006).",
      "release": "2021-10-11T17:50:42Z",
      "duration": "00:09:06",
      "explicit": false,
      "youTubeId": "2p_BrIQ45MI",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2p_BrIQ45MI"
      }
    },
    {
      "id": "2a4ba3e9-0c6d-474d-b703-0495a3b82aaf",
      "title": "Moving beyond basic assumptions",
      "description": "Responding to my last video on Power of Prayer to revisit what is behind basic assumption states (referencing WR Bion. \nI use the turtle with its Bell Curve shape to locate the working group that rises above locked in assumption states among conservatives and liberals at ends of the curve’’s lower state. To rise also means to move toward and work with “enemies” of your basic assumptions.",
      "release": "2021-09-26T19:01:50Z",
      "duration": "00:12:57",
      "explicit": false,
      "youTubeId": "CRrBdYkhU0Y",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CRrBdYkhU0Y"
      }
    },
    {
      "id": "dfba8dc0-ae2f-469f-82ec-935762e242f4",
      "title": "Power of prayer, Michael Flynn, QAnon, and The Great Invocation",
      "description": "I comment on a video of retired Gen. Flynn invoking 7-fold rays and Archangels at a service on Sept 17 at Kenneth Copeland ministries or Lord of Hosts Church. I reference Alice A Bailey’s theosophy that promotes her Great Invocation and “The Plan” that superior beings called Masters implement to bring about the return of The Christ. There’s a curious correspondence of ideas that stems from occultism and Name it, Claim it cults in Christianity about our duty to command God’s or the Universe’s Will and energy. I examine a source of this folly in the Old King James Version of scripture, citing Isaiah 45:11. The latter bad translation is used by occultists in the New Age and Christians in the Prosperity Gospel movements. There is a penchant toward authoritarian religion that we can call fascism in these movements and cults.\nSee:\n\nhttps://www.jszimhart.com/blog/the-great-invocation-of-alice-a-bailey",
      "release": "2021-09-19T21:54:20Z",
      "duration": "00:11:40",
      "explicit": false,
      "youTubeId": "SyrZBbBY15o",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SyrZBbBY15o"
      }
    },
    {
      "id": "a9a694a4-d533-47ee-8286-e4eaaff4b33d",
      "title": "Captive Minds:  a commentary on how cults gain compliance",
      "description": "Captive Minds: Hypnosis and Beyond is an educational film produced in Canada in 1983 to address the so-called cult explosion or rise of new religions that were not all benign. I comment on the film as a good resource to help anyone grasp how the compliance process works in social movements.",
      "release": "2021-08-23T14:04:37Z",
      "duration": "00:10:35",
      "explicit": false,
      "youTubeId": "ETm5YEZuTzU",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ETm5YEZuTzU"
      }
    },
    {
      "id": "7ee6f543-0e4c-45ca-a2a5-1628d7ba2092",
      "title": "Populism, QAnon, and the Hungarian Revolution",
      "description": "Quoting from a 2013 book by Krisztina Fehervary, PhD, I comment on the tension between populism and urbanism and how that tension has been absorbed and constricted by the QAnon movement. I also mention The Long Road to Revolution [in Hungary] by Istvan Fehervary (1989), Krisztina’s father. Populism and progressivism as such are normal and expected in any nation, but any ism can collapse into constricted belief and behavior. “Outsiders” become “Evil” rather than potential sources of insight and correction, as evidenced by the collapse into delusion among QAnon fanatics.",
      "release": "2021-08-14T17:23:14Z",
      "duration": "00:09:28",
      "explicit": false,
      "youTubeId": "bPSLxod7b20",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bPSLxod7b20"
      }
    },
    {
      "id": "52fceeb4-0d4b-40d5-8f56-4d5ee2de27a2",
      "title": "Journey to Nowhere, a review",
      "description": "A review of Journey to Nowhere by Shiva Naipaul (1980), a journalist account about Jim Jones, his People’s Temple, and the social context for the murder-suicide cult tragedy in Guyana in 1978. I suggest the book helps us understand how and why tension between radical left and right narratives continue today.",
      "release": "2021-08-04T15:28:39Z",
      "duration": "00:07:36",
      "explicit": false,
      "youTubeId": "VCt_aUgAN08",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VCt_aUgAN08"
      }
    },
    {
      "id": "0cbf0d69-2539-41df-bc2c-91c113027dae",
      "title": "QAnon and The Wave",
      "description": "The Wave referred to here is an “after school special” produced by Norman Lear and aired in the early 1980s. The Wave was based on a book and a real high school classroom experiment that took place in California in 1967. Ron Jones, a history teacher, ran the experiment to help students grasp how German people during WW2 claimed to not know that death camps were exterminating around 10,000,000 people, most of whom were Jews. The experiment lasted 2 weeks, half the school joined and it began causing an us versus them situation that got out of control. Fights broke out. To view the film, Google “The Wave after school special 1967 classroom experiment”. \n\nI offer this as a way to answer the question How did QAnon arise to help create an insurrection, or as cynics called it, a “stupid coup,” to follow the delusion that they were going to take back the country from deep state control.",
      "release": "2021-06-26T17:42:51Z",
      "duration": "00:14:18",
      "explicit": false,
      "youTubeId": "nLowTrembOY",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nLowTrembOY"
      }
    },
    {
      "id": "e1a038e6-0fa6-47bb-8f0f-7e6d2b9e268d",
      "title": "Useful Delusions: a review",
      "description": "I review Useful Delusions, a new book by Shankar Vedantam and Bill Mesler who wrote about the power and paradox of our self-deceiving brains.",
      "release": "2021-05-30T18:07:58Z",
      "duration": "00:10:15",
      "explicit": false,
      "youTubeId": "GCR4eq8QVVY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GCR4eq8QVVY"
      }
    },
    {
      "id": "2cfe0149-0100-43a3-9160-836a251e5e16",
      "title": "Invoking the Beyond, 2020: a review",
      "description": "Invoking the Beyond: The Kantian Rift, Mythologized Menaces, and the Quest for the New Man by Paul D. Collins and Phillip Collins (2020, 1160 pages). I reviewed this book because the content is from territory I’ve covered since the late 1970s. 25 years ago I may have been inclined to agree with the authors who critique Modernism as a “satanic” formation stemming from the Enlightenment, Kant’s “Copernican revolution,”  and neo-Gnostic immersions into the Deep State of global oligarchs intent on destroying the traditional or Orthodox Christian relationships with God and objective reality. I disagree with its basis. This review is a foretaste of a lengthy one I hope to post online soon and in an International Cultic Studies Association magazine.",
      "release": "2021-05-02T17:35:55Z",
      "duration": "00:07:55",
      "explicit": false,
      "youTubeId": "hcBaz-fPmWE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hcBaz-fPmWE"
      }
    },
    {
      "id": "4dd6084e-3fb0-4ac7-b51e-c647b9057f99",
      "title": "CULT is a 4 letter word.",
      "description": "Words depend on context for their meaning. Cult like the number 4 can indicate a neutral designation as well as evil and sacred. Some scholars avoid the “c” word to describe alternative, peculiar, or new religions, but I argue that whatever label one slaps on a devotional group or activity, it will be the group’s  behavior and teachings that will determine if it’s good or bad, not the label.",
      "release": "2021-03-13T20:00:04Z",
      "duration": "00:13:41",
      "explicit": false,
      "youTubeId": "ppDQAK5_iSs",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ppDQAK5_iSs"
      }
    },
    {
      "id": "65a08c94-1631-480d-ae88-01d24f288ca8",
      "title": "Conspiracy Judge",
      "description": "I met John Judge 1947-2014) in 1965. We were freshman at the University of Dayton in OH. I will focus on my relationship with John and the 2017 book of his writings and talks, Judge for Yourself  edited by Joseph Green. Judge was an early researcher into the JF Kennedy assassination and engaged with Mae Brussell (1922-1988) in her life work to expose Fascist operators in government. I take issue with Judge’s interpretation of The Peoples Temple and cult leader Jim Jones as an extension of the CIA and American government MKUltra mind control experiments. I criticize a recent book The Essential Mae Brussell: Investigations of Fascism in America by Alex Constantine (2014). Constantine fits the paranoid conspiracy category in his many books. Reference \n\nhttps://www.google.com/amp/s/theconversation.com/amp/conspiracy-theories-start-to-take-hold-at-age-14-study-suggests-156006",
      "release": "2021-02-27T17:53:45Z",
      "duration": "00:14:02",
      "explicit": false,
      "youTubeId": "Z-VgQczs9q0",
      "subjects": [
        "Peoples Temple",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Z-VgQczs9q0"
      }
    },
    {
      "id": "f88d2093-fecb-4dce-968d-efb53830aa77",
      "title": "Kierkegaard and the comic Hegel",
      "description": "Soren Kierkegaard said that Hegel’s total view of human history as a religious philosophy would have been the best ever formed if viewed as a thought experiment but taken seriously, Hegel’s system is merely “comic.”\n\nMost harmful cults propose theories of everything not as brilliantly as Hegel did but nevertheless all encompassing for believers who incline to impose their beliefs on others through government and force if necessary. \n\nBoth conservative and liberal pundits hijack Kierkegaard to back their versions of individual freedom and the ultimate leap of faith it takes to be an authentic believer and Christian. Yet, Kierkegaard’s put down in Hegel is a put down on every totalist thought or belief system conceived by cult leaders. \n\nI turn to Professor Lawrence Kahoone for his summary of Hegel and Kierkegaard.",
      "release": "2021-02-21T20:27:39Z",
      "duration": "00:07:32",
      "explicit": false,
      "youTubeId": "mI0iv64FvIw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mI0iv64FvIw"
      }
    },
    {
      "id": "660fe6f2-533b-4f69-8c01-551e42857693",
      "title": "Flag Cults: #23",
      "description": "Cult-like devotion to flags exists throughout history. This talk was triggered by the January 6 insurrectionists, many carrying flags and banners including the U.S.A.’s Stars and Stripes. I ask if you would revere the American flag when it is carried by a white supremacist or neo-Nazi?  I refer to Black Sun, a 2002 book by Nicholas Goodricks-Clark who has extensively researched the occulture behind Nazism. I mention The Silver Legion, an overtly fascist group founded by William Dudley Pelley in the early 1930s. I indicate the origins and meaning of the swastika and how it emerged as the Nazi symbol. I discuss Odinism and it’s relevance to Nazi identity.",
      "release": "2021-02-02T00:50:44Z",
      "duration": "00:14:10",
      "explicit": false,
      "youTubeId": "iWwPeySGCV0",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iWwPeySGCV0"
      }
    },
    {
      "id": "d15e6a0a-2b8f-4aa4-b73d-0297a9368b2e",
      "title": "Alice’s mushroom, cults, \u0026 QAnon",
      "description": "The mushroom that Hookah the Caterpillar sits on in Alice in Wonderland and the question “Who are you?” are the themes of this segment. “Who are you” was a popular quip that sprung up like a mushroom in London in the early 19th Century according to Charles Mackay in Extraordinary Popular Delusions and the Madness of Crowds (1841). I also reference The Annotated Alice by Martin Gardner (1960; 2001) which is an excellent source for realizing where Lewis Carroll got his ideas for Alice in Wonderland.  I compare the spread of memes like Who Are You to QAnon meme spread today. I also examine why a left or right choice both drive us to unreality when the context (mushroom) creates unreality.",
      "release": "2021-01-28T15:16:01Z",
      "duration": "00:09:58",
      "explicit": false,
      "youTubeId": "7rbbdNoNj3Q",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7rbbdNoNj3Q"
      }
    },
    {
      "id": "151b94a0-8352-43bc-93c5-61472152066f",
      "title": "Cognitive Dissonance \u0026 QAnon",
      "description": "Cognitive Dissonance theory was tested by Leon Festinger and others in the mid-1950s when researchers infiltrated a small cult that was predicting the end of the world by flood. Their results were published in When Prophecy Fails in 1956. The cult in question was led by Dorothy Martin (1900-1992) who channeled a “space brother” called Sananda (the Christ) and Ascended Master Sanat Kumaris. As Sister Thedra, Martin eventually established her group ASSK in Sedona, AZ. \n\nPulitzer Prize winning author Alison Lurie published Imaginary Friends in 1967, a fictional account of When Prophecy Fails. \n\nI was motivated to post this by the recent assault on Congress by the Trump cult which is a mix of paramilitias, QAnon operatives, and citizens gone mad and amuck over a false belief in a “stolen election.”\n\nCognitive dissonance occurs when disconfirming evidence counters string beliefs. The theory says that rather than change your mind, you will double down and rationalize your strong beliefs even after they are proven false. Indeed, the Sananda cult members for the most part stuck with the group beliefs after the prophecies by Sister Thedra failed several times. \n\nIt is painful to admit to being fooled or being wrong especially after investing a lot of time and effort and sacrifice to hold into a belief. Dangerous behaviors can arise when people who believe in the existence of a “deep state” feel cornered by the reality that they have been living in a fantasy world.",
      "release": "2021-01-10T17:45:23Z",
      "duration": "00:08:23",
      "explicit": false,
      "youTubeId": "19ROlVoyQCg",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=19ROlVoyQCg"
      }
    },
    {
      "id": "3f9975fb-77e2-48eb-9168-89d76920f752",
      "title": "Traitor in Your Skull: stop “your truth” from lying",
      "description": "Your brain can fool you and a predator can use the patterns you recognize in your brain to change and control your behavior. I refer to several books, primarily to Brainwashing: The science of thought control by Kathleen Taylor. Also, How To Think About Wired Things by T Schick and L Vaughn.",
      "release": "2020-12-14T00:25:36Z",
      "duration": "00:08:24",
      "explicit": false,
      "youTubeId": "FSO9g6L9dZ0",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FSO9g6L9dZ0"
      }
    },
    {
      "id": "95838587-41d6-4f2b-8df2-f5229026d1c1",
      "title": "The Mighty Atom: the power of a small Jewish man",
      "description": "I first met The Mighty Atom when I was in grade school in the mid-1950s at a Farmers Market blocks from where I grew up in Pottstown, PA. He was in his sixties then at the time. While my parents shopped, I stood transfixed listening to the old man lecture the crowd about living a healthy life and pitching his liniment or tonic for joint and muscle pain. He was at one time early in the century one of the famous strongmen on the carnival and vaudeville circuits known for pulling several cars tied to his hair, breaking chains strapped around his chest by expansion through breath control, biting coins in half, etc. I saw him bend horseshoes and tear phone books in half. \n\nHe was born Yosselle Greenstein to a large and very poor Jewish family in Poland in 1893. Born prematurely, he was not expected to survive. His doctors told his mother that Yosselle at age 14 would likely die by age 18 due to an acute asthmatic condition. Greenstein ran away from home to join Volanko, a strongman wrestler with a Russian circus. Volanko convinced young Yosselle to follow a training regimen that would cure asthma. Greenstein at 5 feet 4 and a half inches as an adult not only overcame asthma, he became one of the famous strongman performers in America. \n\nI talk about Greenstein’s approach to spirituality as a Jew among harsh anti-Semitic factions. \nI reference a book, The Spiritual Journey of Joseph L. Greenstein, The Mighty Atom: World’s Strongest Man by Ed Spielman (1979). Spielman was the Emmy award winning creator of the television series “Kung Fu.”",
      "release": "2020-12-02T22:57:54Z",
      "duration": "00:10:52",
      "explicit": false,
      "youTubeId": "seadXOyeqOo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=seadXOyeqOo"
      }
    },
    {
      "id": "a52653ce-a048-429f-a48e-7a97e8bd337f",
      "title": "Moon Fullery: in effect, the moon is always full",
      "description": "When we were around 5 years old, my friend Bart and I decided to throw stones at the full moon. The neighbor lady yelled at us for throwing stones into her yard. This is an example of a correlation illusion. We experienced (psychologically) that the moon was close to us. \nSee: http://jszimhart.com/blog/stoning_the_moon\n\nThe earliest astrology among Chaldean culture was moon centered, so the moon has influenced our myths, songs, and religions in exceptional ways. Full moons have been correlated to lunacy and the Transylvania Effect or people that believed in the moon cults surrounding vampires and werewolves since the Middle Ages in Europe \n.     If we assign 1 tidal unit to the force the moon has on a baby being born, science shows that the attending doctor’s tidal force is 2,000,000 units and the mother’s is 12,000,000 units!  The hospital building has 7,000,000 units. This is also called the mosquito effect of the moon in humans. I ran the numbers in the psych hospital where I work over a 2-year period and found no difference in average on admission activity on the day of, day before, and day after a full moon compared to any other day. Yet, after 20 years I continue to hear nurses and police officers swear that the full moon increases activity. In fact, more than half of hospital workers believe in a full moon effect. References include: “How does the Full Moon affect our physical and mental well being?” by Debra Rose Wilson (9/17/2020); “Moon Myths” by I. Kelly, J Rotton, and R. Culver (Skeptical Inquirer, Vol. X No. 2/Winter 1985-1986); “The Moon and the Maternity Ward” by G. Abell and B. Greenspan (Skeptical  Inquirer, Vol. III No. 4, Summer 1979). \n  Be careful that your correlation illusions do not become fixed delusions. Your firm beliefs can hurt you.",
      "release": "2020-11-15T18:54:35Z",
      "duration": "00:09:18",
      "explicit": false,
      "youTubeId": "yvJ8mZXi-RE",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yvJ8mZXi-RE"
      }
    },
    {
      "id": "94f9cd70-7e87-478d-bbe8-51a8f880547d",
      "title": "God as Bait: the ultimate hook",
      "description": "I ended #16 with “God forbid,” so in this talk we explore how this ineffable, unexplainable God is interpreted for us through hero systems. Moses interpreted his experience of I Am that I Am and gave his people a code to live by, became their hero, but being human had his limits and flaws. I look at the ancient Hindu god Rudra that was an outsider god of destruction that later evolved to become Shiva, perhaps the most revered God among Brahmins today. Shiva as a Hindu high God has numerous cults and hero systems surrounding gurus, some of whom became manipulative narcissists/cult leaders. In other words, an ownership of a God concept can be overvalued. I talk about how this process can become individualized in terrorists like Anders Breivik who killed 77 people in 2011 claiming he was a Knights year Templar and savior of Christianity intending to save Europe from multiculturalism. Psychiatrists changed his initial diagnosis from paranoid schizophrenia to narcissism as a disorder after determining that he was not psychotic. Rather he held”extreme overvalued beliefs” as a self-appointed hero within a Christian white supremacy hero system. So, God or a concept if god can serve as bait to drag us down the rabbit hole of a promising superior hero system.",
      "release": "2020-11-04T15:52:19Z",
      "duration": "00:08:05",
      "explicit": false,
      "youTubeId": "5LJqb6oRt6A",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5LJqb6oRt6A"
      }
    },
    {
      "id": "12aa82aa-7384-4fea-add1-eacc41b32966",
      "title": "A Course in Miracles nullibiety 2: is salvation automatic?",
      "description": "As a followup to #15, I concentrate on ACIM’s idea of a “final judgement” and compare it to Universalism. I quote Karl Barth and mention Origen as preceding ACIM in this notion that all will be restored in the end and already has been in Christ. I discuss the harmful cults the used ACIM including Full Endeavor Academy and Bridging the Gap, the latter combining Rebirthing techniques w ACIM to influence followers. I mention a client who tried to apply ACIM to his life for years, read my paper, and subsequently tossed the Course in the trash realizing he’d been “living with a crazy woman” in his head all that time! \nI discuss Rebirthing in the New Age by Sondra Ray and Leonard Orr (1977) that influenced Bridging the Gap. Orr expounds on the 10 Commandments but imposes his idea that “You are God” and if everything God thinks and does is true, then lying, murder, adultery are not sins and not wrong. I look at Helen Schucman’s psychological condition through Symptoms in the Mind by Andrew Sims and discuss religions and grandiose delusions.",
      "release": "2020-11-02T14:46:29Z",
      "duration": "00:08:03",
      "explicit": false,
      "youTubeId": "I2GXbhmzKL4",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I2GXbhmzKL4"
      }
    },
    {
      "id": "0d195ffe-efe4-4032-95a0-68dcdb7e1e45",
      "title": "A Course in Miracles as nullibiety: being nowhere",
      "description": "For a long treatment of this topic read http://jszimhart.com/essays/a_course_in_miracles.   I reference The Vanishing Messiah by David Wetzel (2016), Quimby’s Science of Happiness by E S Collie (1980), The Secret by Rhonda Byrne (2006), Think and Grow Rich by Napoleon Hill (1960), The Greatest Salesman in the World by Og Mandino (1968). I compare the end-times warning of A Course in Miracles (ACIM) to preacher-healers who use dire warnings and the power of suggestion to work miracles. I discuss the origins of ACIM in New Thought religions influenced by the work of Phineas Parkhurst Quimby why inspired Christian Science. I mention that Donald Trump lauded New Thought minister Norman Vincent Peale. Also, Marianne Williamson has been an avid advocate of ACIM.",
      "release": "2020-11-01T20:55:19Z",
      "duration": "00:10:34",
      "explicit": false,
      "youTubeId": "9Gb84INSYuE",
      "subjects": [
        "Christian Science",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9Gb84INSYuE"
      }
    },
    {
      "id": "1ff6bf28-a5c2-40fa-a1f3-edcb00d32389",
      "title": "Banality of Born-Again: #14 Cults in Occulture",
      "description": "During the past two centuries being born-again among many Christian denominations came to mean being saved. The born-again experience is akin to the enlightenment experience we discussed in #13. Being born-again is a form of knowledge, a knowing born of an experience defined by the social context and language in which the experience occurs. I cite I M Lewis from his book Ecstatic Religion, p 5, in his study of shamanism and spirit possession. Around 1990 I attended a weekend retreat for Christian men in New Mexico during which in the final day the session leader led the men in prayer and song. At one stage men began to speak in tongues and prophecy in the manner of charismatic Christians.  Four or five men gathered around me laying on hands appearing to call Jesus to show a sign through his grace that I was saved. I felt uncomfortable with what I saw as an influence technique, so I began to pray aloud in “tongues” and they quickly pulled away praising God. I was praying in Hungarian. I discuss how the born-again experience can be manipulated by abusive churches referencing The Subtle Power of Spiritual Abuse by Johnson and Van Vonderen (1991) and The Discipling Dilemma by Flavil Yeakley, Jr. editor (1988). I also mention the Twice Born castes in Hinduism by comparison. Again, having a knowledge experience of being born-again or enlightened is no big deal in itself if the context is limiting and harmful.",
      "release": "2020-10-31T17:50:22Z",
      "duration": "00:11:06",
      "explicit": false,
      "youTubeId": "wSAHyyr_70Q",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wSAHyyr_70Q"
      }
    },
    {
      "id": "435b785c-00dd-4333-9edf-21e1a413a141",
      "title": "Banality of Enlightenment: #13 Cults in Occulture",
      "description": "Varieties of enlightenment as special, occult wisdom or knowledge as gnosis or cosmic awareness or self-realization occur in the claims of gurus, life coaches, mass therapy leaders, and cult leaders. Too often, enlightened teachers feel entitled to behave anyway they want with claims of transcending good and evil with “non-dual” awareness. Enlightenment claims come from seekers who have experience with entheogens (god drugs), shamanic techniques and meditation. I argue that enlightenment by itself is hardly special as any teenager can have enlightened spiritual insights comparable to meditation masters by using “shrooms,” cannabis, and other psychotropics. Many seeker claims of enlightenment point to Buddhism or zen for context. I use Alexandra David-Neel and Werner Erhard as examples of popular, enlightened cult personalities who behaved badly and showed no signs of ethical governance. Pythagoras as guru formed a cult following 2500 years ago at a Greek colony in what was later southern Italy. Despite his genius his commune was elitist and he proved to be inept at general governance, refusing to defer to a more democratic alternative. Locals rebelled against the Pythagoreans, burning a meeting hall. Philosophy, that began with Pythagoras, evolved to cover a vast array of problems generally listed as problems of knowledge, conduct, and governance. Enlightenment is banal when the claimant has no sense of ethical conduct or governance.",
      "release": "2020-10-28T23:16:58Z",
      "duration": "00:11:00",
      "explicit": false,
      "youTubeId": "d_PBt8tz9ls",
      "subjects": [
        "Erhard Seminars Training"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d_PBt8tz9ls"
      }
    },
    {
      "id": "bcdc5d66-85e3-4de6-9fb1-c96cd9e86385",
      "title": "Cult leader traits: varieties of pathology",
      "description": "Narcissism and antisocial personality are often associated with cult leader character. I use a cover if Life Magazine December 1969 featuring Charles Manson on the cover to introduce this short discussion. Both narcissistic and antisocial traits can have an attractive quality and we see them in benign ways in comedians, entrepreneurs, entertainers, and military leaders. Traits become disorders when they become tools for manipulative and malignant behavior. Antisocial disorders often include aggression and criminal behavior whereas a narcissist tends to stay clear of getting trapped in prison. I feature the book Take Back Your Life by Janja Lalich and Madeleine Tobias (2006 edition) as a resource for help after a bad cult or relationship experience. The book examines cult leader character traits thoroughly.",
      "release": "2020-10-24T17:55:19Z",
      "duration": "00:09:12",
      "explicit": false,
      "youTubeId": "pimBQGJR4dE",
      "subjects": [
        "Manson Family",
        "Psychology",
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pimBQGJR4dE"
      }
    },
    {
      "id": "af66500d-afe6-42cd-8057-c8061c993f25",
      "title": "Satan \u0026 Exorcism: #11",
      "description": "Satan can mean adversary (Hebrew) slanderer or accuser (diabolical in Greek) depending on which language you use. In the past 20 years there has been a rise in exorcist activity in Italy and in Catholic circles as well as a rise in “deliverance” ministry among Protestant churches. The devil or Satan concept evolved from ancient Zoroastrian culture that influenced later Hebrew, Greek and Christian. I mention a 1991 September issue of Details Magazine that featured my deprogrammer work in a 5000 word article titled “The New Age Exorcist “. I argue that I was not exorcising anything, rather I educated a young man who was caught up in a cult called Masterpath, an offshoot of Eckankar. I talk about an interaction I had with a young woman around 1983 at Christ in the Desert Monastery in NM. She borrowed my book People of the Lie by M Scott Peck to read. Not heeding my warning to read it from the beginning, she read two chapters on exorcism. At 2 am she knocked on my cottage door to tell me that she could not sleep because she saw and heard Demons in her room. I I helped her settle down redirecting her with stories about my recent trip to India until she fell asleep. I discuss other books that look at “the death of Satan” and “history of hell”.",
      "release": "2020-10-20T20:09:46Z",
      "duration": "00:13:37",
      "explicit": false,
      "youTubeId": "Nvy6bvxAizE",
      "subjects": [
        "Catholicism",
        "Eckankar",
        "Zoroastrianism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Nvy6bvxAizE"
      }
    },
    {
      "id": "0b7c524b-d1f9-4d99-8a83-f8234eaa8cc9",
      "title": "Tarot and Cartomancy: #10 Cults in the Occulture",
      "description": "When I was a young teen, I used a deck of cards to determine which girl I should like, assigning a Queen card to four girls, shuffling the deck, then seeing which “Queen” that the deck picked for me. This instinct I had for Cartomancy was spontaneous—no one taught me. Tarot cards have a similar origin as divining tools from a 14th century version of Egyptian playing cards that gained popularity in Europe, especially Italy and France. I use the Rider Deck developed by occultists in the Order of the Golden Dawn in the early 20th Century. Devotees of the cult of Tarot say it has ancient inspiration from the Egyptian god Thoth, an Ibis-headed deity associated with the moon, reckoning, writing, and wisdom. The modern Tarot deck of 78 cards appeared in the 19th Century. Though banned at times in Europe centuries ago due to it both being a form of sorcery as well as a gambling game, today even Christian users see it as a tool to communicate with God, the universe, or the inner self. I warn about bait and switch tactics that online Tarot readers use offering readings at little cost then switching by offering more expensive readings once you are hooked. I recommend reading A Wicked Pack of Cards by Decker, DePaulis, and Dummet (1996) [ https://www.amazon.com/Wicked-Pack-Cards-Origins-Occult/dp/0715627139 ] to get a thorough history of Tarot and its rich connection to the Occulture of the past few centuries.  And I warn that the most important card in the deck is the FOOL which translates to the JOKER in our modern playing cards. Beyond having some fun, don’t be fooled by Tarot!",
      "release": "2020-10-18T15:49:19Z",
      "duration": "00:09:33",
      "explicit": false,
      "youTubeId": "mUL8DSn4oJU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mUL8DSn4oJU"
      }
    },
    {
      "id": "9c7f56a5-f105-435a-b820-1d1e3c5c000a",
      "title": "Astrology: myth for manipulating you",
      "description": "Astrology by most accounts is the queen of the occult arts of divination that include Tarot, Kabbalah, and reading tea leaves. I first seriously explored astrology in the late 1970s, getting my first professional reading of my horoscope from Alan Oken at his Voice of the Turtle gift shop in Santa Fe NM. I needed to know my rising sign, moon and sun signs to apply for entry into the Keeper of the Flame fraternity of a large Theosophy-based sect run then by Elizabeth Prophet. Astrologers seek precise information about birth time and place to better “read” your star chart or horoscope. After I defected from  Prophet’s cult in 1980, I learned how to cast a horoscope using an ephemeris, then got a good idea how to do a reading from professioal astrologers I knew. One old astrologer told me she only had to glance at a person’s chart to do a reading. “It is all intuitive,” she said. After two years of research I found that astrology is horrible as a predictive tool and totally unreliable reference as to a person’s character. Astrologers who know how to read a chart with its thousands of relational aspects can easily get most customers to agree with a reading. It comes down to an influence game. Invariably, most people will find accurate information about themselves when tricked into reading the an astrologer\u0027s report on someone else\u0027s chart. Astrology can effect national decisions. I point to how in 1948 the New Indian government had to consult an astrologer for the auspicious moment when to sign their declarations of independence from Great Britain. After Ronald Reagan was shot in 1981, his wife Nancy consulted a celebrity astrology to names dates and times when the president could safely travel, thus causing havoc and unnecessary delays among White House staff decisions. Time Magazine had a cover feature in 1988 about “Astrology in the White House.” I mention that fundamentalist Christians have published books against astrology saying it is deceptive and is a tool of the devil. Skeptics have proven that astrology has no basis in reality, though it remains a popular psychological and cultural means for self reflection among young adults with a resurgence of interest since 2014. I warn that astrology can be easily overvalued and cause harm in relationships as well as decision- making.",
      "release": "2020-10-10T20:58:55Z",
      "duration": "00:10:57",
      "explicit": false,
      "youTubeId": "eiDuK5FQrvE",
      "subjects": [
        "Saint Germain Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eiDuK5FQrvE"
      }
    },
    {
      "id": "b318376d-c41d-42f6-b074-59630cdaf272",
      "title": "Holy Grail as a Tektite #8",
      "description": "In the installment of Cults in the Occulture, I explore the symbolic power of holy grail legends and quests concentrating on a tektite called Moldavite found primarily in the Moldavia region of Eastern Europe. Millions of years ago a meteor or comet impacted that area causing existing silica or sand to melt and hurtle through the air resulting in greenish glassy stones. Moldavite as a rare tektite has been valued by the Occulture as having transformative powers. Believers in its energy experience changes they say occur through the agency if Moldavite. I reference the book Moldavite: Starborn Stone of Transformation by Simmons and Parker (1989) with an endorsement and intro by Jean Houston, Director of the Foundation for Mind Research. I heard Houston, now in her early 80s, lecture about LSD effects on mind research she had done in early 1960s at my University of Dayton around 1967 where I was an undergraduate. Houston gained unwanted fame in 1993 as Hillary Clinton’s spiritual therapist who had Clinton channel Eleanor Roosevelt and Gandhi to help Hillary write a book. Although this was actually an exercise in inspired meditation, the press had fun calling it a “seance.”  In any case, Houston is firmly in the alternative spirituality realm of the Human Potential Movement. I reference a 2020 YouTube talk about the transformative power of Moldavite by Hibiscus Moon, a woman who got 33,333 views on her discourse that reminded me that the New Age Movement if the 1960s is yet alive and thriving!  Hibiscus said that Moldavite helps with ascension work and other spiritual quests, (she sold it from her store), but in the past two years due to a cosmic shift the green tektite’s powers have diminished due to a cosmic shift. \n\nI mention in 1989 I purchased a tiny Moldavite at a Santa Fe NM New Age bookstore and rock shop as a sample for lectures. While in the shop, I observed two guys trying on expensive Moldavite jewelry and expressing euphoric feelings from contact with it. I felt nothing more than curiosity. My days of naive suggestibility to the symbolic jargon attending rocks and overvaluing the energy were over. \nThe authors Simmons and Parker first encounter stories about the Holy Grail as Moldavite from reading talks by Nicholas and Helena Roerich who founded the Agni Yoga sect I once followed in the late 1970s.",
      "release": "2020-10-04T18:21:36Z",
      "duration": "00:11:22",
      "explicit": false,
      "youTubeId": "MOL9rmPTlBs",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MOL9rmPTlBs"
      }
    },
    {
      "id": "3d0caa3e-b00e-4dc6-aaaa-2216de304354",
      "title": "QAnon: #7 Cults in the Occulture",
      "description": "I express my views on QAnon, the now notorious pro-Trump Internet conspiracy fad that had bled over into a pseudo reality that people believe. Families have been torn apart, ex- Qs claim it’s a brainwashing cult, and people on the religious right and left are being manipulated from within the context of QAnon websites. I refer to Foucault’s Pendulum by Umberto Eco, the Federalist Papers, and Sir Francis Bacon. And I wear a tin hat to illustrate my point.",
      "release": "2020-09-28T15:59:09Z",
      "duration": "00:07:33",
      "explicit": false,
      "youTubeId": "NXx1bay0Khg",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NXx1bay0Khg"
      }
    },
    {
      "id": "f86875a5-4f98-4d5a-8695-10ccf0ee13a9",
      "title": "Is Ramtha Real?",
      "description": "After my video on Channeling someone asked me to address Ramtha channeled by JZ Knight since 1977. I use the book Finding Enlightenment by J Gordon Melton (1997) as reference in which Melton tries to describe and explain the new Gnostic teachings of Ramtha. Melton arranged for Stanley Krippner, a parapsychologist with his team to test JZ to rule out fraud and pathology, which Melton claims they did. I argue that they did not because there was no serious peer review and no similar studies with professionals character actors to compare. To me, Ramtha is nothing more than JZ Knight performing the character.",
      "release": "2020-09-27T17:11:51Z",
      "duration": "00:07:20",
      "explicit": false,
      "youTubeId": "S8Ae_Qt4cC8",
      "subjects": [
        "Ramtha\u0027s School of Enlightenment"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S8Ae_Qt4cC8"
      }
    },
    {
      "id": "413d10b6-f1dd-4cd3-b09e-cb685d7a6905",
      "title": "Channeling or spirit possession",
      "description": "Channeling or spirit possession has ancient roots in human religious behavior going back beyond oracles in  Greece to the first shamans. Channeling takes many forms like infusing life forces into crystals using mental power to performing on a stage before thousands of devotees as if your body is possessed by an angel. Agency and influence formation are features of most channeling cults. Examples mentioned are Book of Mormon, OAHSPE, Seth Speaks, Ramtha, Lazaris, and Silva Mind Control Method.",
      "release": "2020-09-26T20:44:30Z",
      "duration": "00:12:36",
      "explicit": false,
      "youTubeId": "xfOTAqoezCk",
      "subjects": [
        "Cult Psychology",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Ramtha\u0027s School of Enlightenment"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xfOTAqoezCk"
      }
    },
    {
      "id": "44e476b2-62c4-45e5-8f87-4c73dcd97fa5",
      "title": "Shamanism: when it’s real and when it’s hijacked",
      "description": "Shaman from the ancient Tungus language means he who knows or wise man. Interest in shamanism bloomed in the 1960s with advent of new seekers using drugs and techniques of ecstasy. Books by Eliade and Castaneda helped fuel vision quests and experiential workshops by being- shamans, some of whom were quite manipulative and In it for personal power. Interest in indigenous healing techniques has bloomed again in past decades.  For example, photographer/filmmaker Phil Borges posted his TED talk on Psychosis \u0026 Spiritual Awakening in 2014 that now has over 3,525,000 views. I look at criticism of neo-shamanism by Alice Kehoe and Patrick McNamara. .",
      "release": "2020-09-24T15:50:52Z",
      "duration": "00:11:29",
      "explicit": false,
      "youTubeId": "FpuY0DZSuRU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FpuY0DZSuRU"
      }
    },
    {
      "id": "196ec60a-4abc-4b6c-bed8-2fba8cdfc260",
      "title": "Agni Yoga",
      "description": "Agni Yoga is a new religion founded around 1920 by Russians Nicholas and Helena Roerich who studied Theosophy and had influence in American politics.",
      "release": "2020-09-19T16:39:32Z",
      "duration": "00:17:38",
      "explicit": false,
      "youTubeId": "gSUh34YORvg",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gSUh34YORvg"
      }
    },
    {
      "id": "23bafa74-4b26-4af4-8ae4-aebbf230e69b",
      "title": "St. Germain and Theosophy as a con",
      "description": "#2 in my series discusses how I went down the Theosophy rabbit hole in 1975 to find the I AM Activity sect founded by Guy and Edna Ballard. Reading Manly P. Hall\u0027s esoteric history \u0022Secret Teachings of all Ages\u0022 gave me the impressive intellectual force (pseudo-intellectual as it turned out) to believe that Comte de St. Germain (18th Century occultist) was the real deal \u0022Master\u0022 revered by many Freemasons, Theosophists, and modern occultists to this day. Hall argued confidently that St. Germain was Francis Bacon who authored the Shakespeare plays [proven false]. I discuss my involvement with Summit Lighthouse (aka Church Universal and Triumphant) as an offshoot of the I AM cult. I discuss and recommend Foucault\u0027s Pendulum by Umberto Eco (1988) that features St Germain as a main character.  I borrowed \u0022Occulture\u0022 from Christopher Partridge, a scholar who has written and lectured extensively on the topic and calls occulture \u0022normal\u0022 throughout human history--in other words, most people are believers and actors in a phase of occulture even if they only read a daily horoscope in the paper, believe in the deep state behind government, or pray that God or an angel help an ailing mother. I mention books that expose the historic St Germain as a charlatan including Myth of the Magus by E M Butler (!948) and Extraordinary Popular Delusions and the Madness of Crowds by Charles Mackay (1852, 2nd ed.)",
      "release": "2020-09-18T18:39:48Z",
      "duration": "00:14:59",
      "explicit": false,
      "youTubeId": "pW2PXJFWQCU",
      "subjects": [
        "Saint Germain Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pW2PXJFWQCU"
      }
    },
    {
      "id": "caf5a898-7377-462b-91de-660ea8754d6a",
      "title": "Cults in the Occulture",
      "description": "Joe Szimhart uses his vast experience as a cult interventionist and research on the cult problem to address how modern acceptance of esoteric and occult ideas has created a lively matrix for cult formation, whether good, bad, or ridiculous. He uses his new memoir “Santa Fe, Bill Tate, and me: How an artist became a cult interventionist” as a basis for his casual presentations from his art studio. This first video is but and introduction.",
      "release": "2020-09-17T18:48:21Z",
      "duration": "00:09:34",
      "explicit": false,
      "youTubeId": "VZ2TkrB-GiQ",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VZ2TkrB-GiQ"
      }
    }
  ]
}