{
  "_ts": 0,
  "id": "7082c26a-d37b-4a69-8a88-a80cecae673b",
  "name": "Journey Into Yoga Cults",
  "spotifyId": "687KtDe4q0G2RcCTaKcrk7",
  "appleId": 1599860304,
  "episodes": [
    {
      "id": "1180c823-64cc-4eaa-a094-4de1da9e2d58",
      "title": "17 - “Call your dad, you’re in a yoga cult!” w/ Shelley Carroll",
      "description": "This interview is with Shelley Carroll (formerly Lowther) who has been one of the first Baptiste affiliate studio owners to publicly bow out of Baptiste Yoga and tell you why in this conversation. Alos be sure to read her blog post from Feb. 2022 entitled \u0022Call your Dad, you\u0027re in a yoga cult\u0022: https://dancingdogsyoga.com/blog/call-your-dad-youre-in-a-yoga-cult Shelley shows that it can be done, step away from harmful practices, apologize for harm done, take accountability and do better moving forward. Thank you Shelley for sharing your courage with us! Bio: Shelley is a future expatriate but current Atlantian. She is the founder of Dancing Dogs Yoga, the DDY Yoga School, and DDY Travels. Shelley has trained hundreds of yoga teachers world-wide and is passionate about creating teachers and leaders to share the practice of yoga. Shelley is a Chopra Center Certified Ayurvedic Practitioner and runs DDY Travels, a yoga travel retreat company with curated yoga and wellness retreats around the globe.  A self-described activist, Shelley went from a volunteer with ACLU to running the ACLU of Georgia’s Legal Observer Program, where she trained and deploys legal observers in cases of protests, civic actions, and elections. Shelley is a kale-smoothie-drinking, goal-smashing junkie who believes in people and community. When she isn’t traveling the globe or saving democracy with the ACLU, Shelley lives in historic Reynoldstown in Atlanta, GA with her awesome dog, Holli and can often be found drinking coffee, eating pickles, and strolling the Beltline.",
      "release": "2022-06-01T21:21:24Z",
      "duration": "01:29:00.5430000",
      "explicit": true,
      "spotifyId": "3O8YqEPXegL6wgfMExuS8v",
      "appleId": 1000564887128,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3O8YqEPXegL6wgfMExuS8v",
        "apple": "https://podcasts.apple.com/podcast/17-call-your-dad-youre-in-a-yoga-cult-w-shelley-carroll/id1599860304?i=1000564887128"
      }
    },
    {
      "id": "6ba92f68-ba48-4532-b0ee-0488e9d828a6",
      "title": "16 - A Little Bit Culty w Sarah Edmonson \u0026 Nippy Ames",
      "description": "What a treat to start our season 2 with A Little Bit Culty podcast hosts (and NXIVM cult survivors) Sarah Edmonson and Nippy Ames! Sarah Edmondson is a Canadian actress who has starred in the CBS series Salvation and more than twelve films for the Hallmark Channel and Lifetime. She is also a well-established voice-over artist for popular series such as Transformers: Cybertron and My Little Pony: Friendship Is Magic. In 2005, when NXIVM, a personal and professional development company, promised to provide the tools and insight Sarah needed to reach her potential, she was intrigued. Over her twelve-year tenure, she went from student to coach and eventually operated her own NXIVM center in Vancouver. Questions kept coming up about the organization’s rules and practices, which came to a head in 2017 when she accepted an invitation from her best friend to join DOS, a “secret sisterhood” within NXIVM. In 2019, Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life, with Kristine Gasbarre. In this tell-all memoir, she shares her story from the moment she takes her first seminar to her harrowing fight to get out. Her full story as a whistleblower is featured in the CBC podcast Uncover: Escaping NXIVM  (downloaded over 25 million times) and The Vow, the critically acclaimed HBO documentary series on NXIVM. Now with the launch of “A Little Bit Culty,” Sarah and her co-host/husband Anthony “Nippy” Ames are keeping the conversation going by discussing the healing process with the help of experts and fellow survivors. As an aspiring actor and former college athlete, Anthony “Nippy” Ames was drawn to NXIVM’s goals program. In his 12 years with the organization, he rose steadily up the ranks as a teacher, built centers in New York and Vancouver, and even met his now wife, “A Little Bit Culty” co-host Sarah Edmondson there. But when he learned that the company was, in fact, a dangerous cult, he wasted no time in doing exactly what needed to be done: helping burn its carefully constructed public image to the ground. With NXIVM’s notorious founder now behind bars facing a brisk 120-year sentence, Nippy isn’t planning on going quiet anytime soon. As Executive Producer of the “A Little Bit Culty” podcast, Nippy has come full circle back to what he was born to do: performing, creating, and truth telling. He’s proving to be an emerging voice in the conversation around what it means to be an upstanding man, husband, and father in 2021.",
      "release": "2022-05-25T18:41:51Z",
      "duration": "01:14:43.6100000",
      "explicit": true,
      "spotifyId": "6gbJtJvNPIR7VSTcdFmrpv",
      "appleId": 1000563883332,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6gbJtJvNPIR7VSTcdFmrpv",
        "apple": "https://podcasts.apple.com/podcast/16-a-little-bit-culty-w-sarah-edmonson-nippy-ames/id1599860304?i=1000563883332"
      }
    },
    {
      "id": "b7c2cd4a-1cc8-41ad-a558-1e5da4a09f28",
      "title": "15 - Smells Like Sex Trafficking w/ attorney Vanessa Baehr-Jones",
      "description": "Trigger Warning: this episode contains content about sex trafficking. Please take care of your needs regarding this topic or skip this episode if this topic is triggering for you.   Recruiting and grooming sexual partners, weeding out critics, using harassment and coercion, encouraging others to take expensive courses to further control them are all reasons that prosecutions have proceeded in court in other cases. Listen and hear how some real cases could potentially bring these crimes to justice. What laws are in place to protect women from abuse?  Listen and learn about what is actually sex trafficking and how it is happening when people put trust into a leader and an organization. It really makes you look at how people have been used and how the law can actually protect them. There are tools for survivors to use Civil Law for federal crimes. \u0022Masha\u0027s Law\u0022 is written into Title 18 where all the Federal crimes are located. It gives survivors the power to bring their own civil lawsuits against sex offenders who may have abused or exploited them, even if it wasn\u0027t reported and police did not arrest. The survivor can still go after that offender. It covers sex trafficking (a broad expansive federal crime meant to protect victims of exploitative abuse) includes \u0022enticement\u0022 either in person or online. It\u0027s very powerful but also under-used. More than forced prostitution, the federal definition qualifies: makes it illegal for someone to participate in a venture (2 or more people) that uses force, fraud or coercion to subject the victim to engage in a commercial sex act (defined as \u0022in exchange for anything of value\u0022 including but not limited to: a free training; moving up in the organization; benefit or status -- and does not have to be a direct contract) or if it\u0027s a minor, even if there is no force or coercion needed. Even \u0022demanding absolute commitment\u0022 to the leader, or inducing shame and guilt to control the members and their behavior. If you think you may have experienced sexual coercion, abuse or trafficking contact here for support:    www.advocatesforsurvivors.com and https://www.Vanessabaehrjones.com  Special guest: Vanessa Baehr-Jones Founding partner of Advocates for Survivors of Abuse a woman-owned law firm specializing in seeking justice for survivors of sexual abuse, exploitation, and trafficking Vanessa spent nearly a decade prosecuting child sex offenders and securing restitution for survivors. As the Project Safe Childhood coordinator in Los Angeles, she managed intake of all child exploitation cases in the seven-county district. After leaving Los Angeles, Vanessa served as a federal prosecutor in Northern California, providing expertise on child exploitation and trafficking cases. A skilled trial and appellate attorney, she is fearless in seeking the best outcomes for her clients. Vanessa earned her B.A. summa cum laude from Tufts University, and then served as an intelligence officer for the Defense Intelligence Agency. She holds a law degree from UCLA School of Law. She is a member of the National Crime Victims Bar Association and the American Association for Justice. About Vanessa: https://www.advocatesforsurvivors.com/advocates _____________________________________  ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)",
      "release": "2022-04-14T19:53:06Z",
      "duration": "00:59:46.3210000",
      "explicit": true,
      "spotifyId": "6Nh8Yo3x5bZEy82J0QFUOO",
      "appleId": 1000557643342,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Nh8Yo3x5bZEy82J0QFUOO",
        "apple": "https://podcasts.apple.com/podcast/15-smells-like-sex-trafficking-w-attorney-vanessa-baehr/id1599860304?i=1000557643342"
      }
    },
    {
      "id": "93bddbb3-4103-4ca0-b3b7-2d76605e06e9",
      "title": "14 - Q \u0026 A: Your Questions Answered, like: \u0022How do we protect people from Baron Baptiste?\u0022",
      "description": "You asked, we answered. Thank you so much for writing into us and sharing your stories, questions and topic ideas. We are listening. A peek into this conversation: how to protect people from Baron, real talk about \u0022affiliate studios\u0022 businesses, the lack of support from Baron and \u0022The Institute\u0022 but lots of encouragement to open open open an affiliate studio, to BE A YES to opening a yoga studio with no concern for the cost or the reality of how you need to be business wise to succeed in this market... and what to do if you are employed by a Baptiste affiliate and you are questioning the harmful practices? How to keep teaching yoga and what to teach in order to stop being harmful and stop perpetuating Baptiste Yoga. Is it possible to still teach for an affiliate and not perpetuate harm? Good questions! Let\u0027s talk about it and let us know your thoughts. @yogacultspod Resources mentioned in the conversation: The real history of yoga.  Article: https://www.yogajournal.com/yoga-101/history-of-yoga/10-things-didnt-know-yoga-history/ Books: Roots of Yoga (Penguin Classics) Mallinson, James Sir Yoga Body: The Origins of Modern Posture Practice Singleton, Mark  _____________________________________ ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)",
      "release": "2022-04-07T19:00:25Z",
      "duration": "00:53:37.4730000",
      "explicit": true,
      "spotifyId": "1NTMkC7k6yWrahcX7GzxNI",
      "appleId": 1000556564989,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1NTMkC7k6yWrahcX7GzxNI",
        "apple": "https://podcasts.apple.com/podcast/14-q-a-your-questions-answered-like-how-do-we/id1599860304?i=1000556564989"
      }
    },
    {
      "id": "6172ea52-d2b5-4f92-8fbd-ac39e2948d93",
      "title": "13 - Is Baptiste Yoga a \u0027System of Control\u0027? w/ Rachel Bernstein from IndoctriNATION Podcast",
      "description": "We are thrilled to give you this episode with Rachel Bernstein! Bernstein is a therapist in LA specializing in cult recovery and has worked With India Oxenberg in her healing from the NXIVM cult as well as her mother, Catherine Oxenberg. Her popular podcast, IndoctriNATION has had over 900K listens from all over the world and features regular people who are healing from cults, high control groups and narcissistic relationships. Join us in the conversation as Bernstein helps us to understand how Baptiste Yoga is a system of control and what steps to take to heal from the influence so we don\u0027t join another culty group or relationship again.  Rachel Bernstein, MSed, LMFT, has been working with former cult members for nearly 30 years. She is a Licensed Marriage and Family Therapist, and Educator, who lives in Los Angeles, CA. She has been a member of ICSA for many years and has presented talks and moderated panels at ICSA conferences. Rachel previously ran the Maynard Bernstein Resource Center on cults, named after her father. She was the Clinician at the former Cult Clinic in Los Angeles, as well as the Cult Hotline and Clinic in Manhattan. She now treats former cult members and the families and friends of those in cults in her private practice. Rachel has facilitated numerous support groups for former cult members, for people who were in one-on-one cults, and for the families of those in cults. Rachel has published many articles, made media appearances, consulted on shows and movies about cults, and has been interviewed for podcasts and YouTube videos. Rachel is the host of her weekly Podcast, \u0022IndoctriNation,\u0022 about breaking free from systems of control. RachelBernsteinTherapy.com, bernsteinlmft@gmail.com 818-907-0036  _____________________________________ ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)",
      "release": "2022-03-30T16:21:30Z",
      "duration": "00:54:32.3640000",
      "explicit": true,
      "spotifyId": "4kEMNnjnKKVMqk0qpYj91T",
      "appleId": 1000555733918,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4kEMNnjnKKVMqk0qpYj91T",
        "apple": "https://podcasts.apple.com/podcast/13-is-baptiste-yoga-a-system-of-control-w/id1599860304?i=1000555733918"
      }
    },
    {
      "id": "6a758038-f9a0-4b8d-89ec-3f68544fdbfe",
      "title": "12 - The \u0027FIT to Lead\u0027 Training, aka: \u0022I\u0027ll Fuck Your Head Off!\u0022 - Baron Baptiste",
      "description": "\u0022I\u0027ll Fuck Your Head Off!\u0022  \u0022I\u0027m over here, Gino is over there. My seeing of Gino is happening out there where I am not. There is no 8\u0022 Gino in my head\u0022 - Baron Baptiste  Does this sound like advanced-level facilitator training content to you? Well, believe it or not this (and more!) is what we learned in the first “Facilitator In Training” in 2014 (now known as Fit to Lead). 28 of us paid $10K each for the promise that we would be trained directly by Baron to be the successors of the “Baptiste Legacy”, able by the end of the 2-year, 8 weekend-long training, to lead Baptiste programs. We were nervous, excited but quickly learned we were about to get NOTHING we signed up for and could not have imagined how horribly abusive Baron would turn out to be.  All names except Baron Baptiste have been changed to preserve peoples’ privacy and to keep the focus where it belongs - on Baron.  There are so many stories of public humiliation and abuse, including “Liam”  (international yoga teacher)shredded by Baron for (private) pot useage, getting help from his parents and his use of the term “hotel motel, holiday inn” to describe a yoga black. Baron required participation in 40 days because he thought we needed to lose weight; “CEO” had us create content for free that BY then turned around and SOLD to the general public. As part of our training… We PAID Baron to create content!!  A rich drunk participant was praised while a sincere grown man was berated to the point of tears… a person who could not speak English well was made to believe (by Baron) that they could potentially lead programs; speech about your most embarrassing moment; name change, bait-and-switch; addition of Tier 4, teacher at Yoga Journal (pay), creating the content; creating more programs for them to use and charge community members for the programs.“Colleen you’re fucked”. - Baron. The Exorcism of Rick performed by Baron; If this episode doesn’t f*ck your head off, we don’t know what will?!  About the second FIT group and beyond… (Chelle) enrolling more and more people after our FIT… and so much more! Please leave us a 5 star review and DM us at @yogacultspod  \u0022Integrity: Without it Nothing Works\u0022 - Michael C. Jensen https://bit.ly/3ubKPrE",
      "release": "2022-03-23T15:54:30Z",
      "duration": "01:18:02.6050000",
      "explicit": true,
      "spotifyId": "2KQgj5wn8Vl6lsMjClY6DJ",
      "appleId": 1000555001304,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2KQgj5wn8Vl6lsMjClY6DJ",
        "apple": "https://podcasts.apple.com/podcast/12-the-fit-to-lead-training-aka-ill-fuck-your-head/id1599860304?i=1000555001304"
      }
    },
    {
      "id": "f28116eb-8d53-4fe8-a5f4-99be02e06c1d",
      "title": "11 - Sh*t Cult Members Say: \u0022I\u0027m ignoring your harm because it was great for me!\u0022",
      "description": "We are hearing the ripple effects of this podcast and not afraid to tawk about it!  Grab your cawwwwffee and get ready we\u0027re tawwking about you - people who don\u0027t listen to victims and double down to defend your own benefits... In this episode we talk about people who are publicly buckling down hard defending Baptiste Yoga and Baron instead of listening to those who are telling their true stories of harm. We talk about how to respond to these people until wait -- they blocked me and erased my comments anyway???!!!! In other words...  \u0022I’m going to ignore your harm and let me tell you how great it is for me!\u0022 We hear your \u0022I’ve got mine-ism.” We talk about the latest ALBC episode about Bentinho Massaro\u0027s cult and the whistleblowers saying “I never imagined people would not believe me.” We can relate! Do you think they believe us or not? They were our friends. Or they said they were. “The good outweighs the bad.”  (file under \u0027things cult members say\u0027) People are listening to our podcast in their yoga teacher training! The discussions hopefully raise awareness and questions... \u0022Can you still use the methodology and not do harm?\u0022   \u0022Does the good outweigh the bad?\u0022   \u0022Do the ends justify the means?\u0022 \u0022If you’re paying attention to people who have been abused, can you still justify it?\u0022 Other cawwwffee cult tawwwlk tawwwwpics include:   What do I do now… I teach at an affiliate, how do I talk to the studio owners? What is the answer?  What do I teach now? Should I even teach JIP anymore?  \u0022I Got Mine-ism\u0022 galore. If it didn\u0027t happen to you did it even happen? Ugh!  Talking about people who credit Baron for their success.   How did we personally transition out of Baptiste and how did we begin the healing process?  All this and more! Also send us your Q\u0027s for our upcoming Q \u0026 A episode DM us at @yogacultspod on IG or send us a voice message here https://anchor.fm/yogacultspod1029/message",
      "release": "2022-03-16T13:42:43Z",
      "duration": "00:35:13.9670000",
      "explicit": true,
      "spotifyId": "2vaZYYiKsQTgLsC3m3zabh",
      "appleId": 1000554210041,
      "subjects": [
        "Bentinho Massaro"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2vaZYYiKsQTgLsC3m3zabh",
        "apple": "https://podcasts.apple.com/podcast/11-sh-t-cult-members-say-im-ignoring-your-harm-because/id1599860304?i=1000554210041"
      }
    },
    {
      "id": "52d82f74-c395-40c6-853a-402340b303d9",
      "title": "10 - Cult Expert Dr. Janja Lalich on How We Became the \u0022Perfect Followers\u0022",
      "description": "Listen to our mind-blowing conversation with Dr. Lalich and we describe in detail the process of going through Baptiste training and her explanation of how it\u0027s deliberately designed to make us into \u0022perfect little followers\u0022 and pretty soon taking on the doctrine of the group as our own. We have learned to commit and not speak out so any red flags we see are put on a \u0022shelf\u0022 until one day the shelf breaks and we start to untangle and question everything. Classic techniques used since the 60\u0027s and 70\u0027s birth of the Large Group Awareness Trainings (LGAT) era have been re-purposed by Baron and Baptiste Yoga which are touted as \u0022self-help\u0022 are actually designed to cause self abuse and train the participant to abuse and gaslight themselves using the \u0022tools\u0022 learned in the trainings. Learn how to not \u0022cult-hop\u0022 from one high control group to another by recognizing the sign and techniques used by many different types of cult-like groups. Janja Lalich, Ph.D. is a researcher, author, and educator specializing in cults and extremist groups, with a particular focus on charismatic relationships, political and other social movements, ideology and social control, and issues of gender and sexuality. She has been a consultant to educational, mental health, business, media, and legal professionals, as well as having worked with current members, former members, and families of members of controversial groups. A former Fulbright scholar, Dr. Lalich is Professor Emerita of Sociology at California State University, Chico, where in 2007 she was awarded the Professional Achievement Honor. Also, Dr. Lalich is the founder and director of the Center for Research on Influence and Control. She received a B.A. with Honors from the University of Wisconsin, Madison. She has a Master’s in Human Development and a Ph.D. in Human and Organizational Systems from Fielding Graduate University in Santa Barbara, California. Dr. Lalich has written and lectured extensively and is author, coauthor, or editor of numerous books, articles, and chapters. Her most recent book is Take Back Your Life: Recovering from Cults and Abusive Relationships (Bay Tree Publishing, 2006), a fully-revised and expanded edition of her first book, Captive Hearts, Captive Minds, which has been the number-one book used by former cult members and their friends and families to better understand cult experiences and their consequences. Another of her recent publications is the critically acclaimed Bounded Choice: True Believers and Charismatic Cults (University of California Press, 2004), based on her research on the Heaven’s Gate cult, the group that committed collective suicide in 1997, and her own 10\u002B years’ experience in a political cult, the San Francisco-based Democratic Workers Party. Most importantly, this book puts forth Dr. Lalich’s “bounded choice” theory, which offers a new approach for understanding the dynamics of “self-sealed” groups and the true-believer phenomenon.  Resources: Follow Janja Lalich @janja_lalich Books: Take Back Your Life; Bounded Choice, Escaping Utopia, Captive Hearts, Captive Minds, Cults in Our Midst Take Back Your Life Recovery https://www.tbylr.com/ Shows Janja has appeared in: The Lost Women of NXIVM; Seduced; Cults \u0026 Extreme Beliefs Mentioned in this episode: Karma Cola (book) \u0022what happens when the traditions of an ancient and long-lived society are turned into commodities and sold to those who don\u0027t understand them\u0022  https://www.amazon.com/Karma-Cola-Marketing-Vintage-International-ebook/dp/B007SGM28W Kumaré (movie) https://kumaremovie.com/synopsis.php",
      "release": "2022-03-09T20:57:07Z",
      "duration": "00:52:29.2520000",
      "explicit": true,
      "spotifyId": "7hekstnBGP9kEo2D2qQ645",
      "appleId": 1000553486292,
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Cult Recovery",
        "Democratic Workers Party"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7hekstnBGP9kEo2D2qQ645",
        "apple": "https://podcasts.apple.com/podcast/10-cult-expert-dr-janja-lalich-on-how-we-became-the/id1599860304?i=1000553486292"
      }
    },
    {
      "id": "c94f7906-3c7c-42bd-be0f-f8783d405fff",
      "title": "9 - “Fear Not” the Legal Threats and Bullying Tactics",
      "description": "Threats of Non-Disclosure Agreements (NDAs) and Cease and Desist letters from attorneys are designed to bully and silence would-be whistler blowers. Could that be why so many people are speaking underground about Baptiste Yoga and so many women have stories to share about Baron but are afraid to go public? Attorney and former Baptiste Yoga teacher Eva Sedgwick explains why these tactics are lame attempts to scare us into silence and why they cannot hold up in a court of law. Also, Eva tells her own story and experience with Baptiste Yoga, why she got out after being publicly defamed by Baron in front of hundreds of people and never looked back. Eva then breaks down the difference between defamation and speaking the truth or giving your opinion about a \u0022Public figure\u0022 which falls under freedom of speech and is what we do here in this podcast. For any women who have been seduced by Baron while a student or training participant, Eva offers resources for Pro Bono (free) attorneys who will represent women in a case where Baptiste Yoga finally has it\u0027s #metoo moment.   About our special guest: Eva Sedgwick is an associate professor of business law in the Albers School of Business and Economics at Seattle University. She has been teaching and writing about business and technology and how they intersect with human rights and social justice for over 20 years. Her work is published in such journals as the Stanford Technology Law Review and the American Business Law Journal. Eva has been recognized frequently for her innovative teaching. Teaching is Eva’s passion and vocation. At Seattle University she teaches undergraduates and graduate students in topics such as business law, negotiation skills and law and ethics in business analytics/Artificial Intelligence. Eva is also a yoga teacher. She received her original yoga alliance certification after completing levels 1 and 2 with the Baptiste Power Yoga Institute. In 2019 she stepped back into training and completed her 240 hours of trauma-informed yoga teacher training with Yogamour, a nonprofit yoga organization in Maryland whose mission it is to bring yoga and mindfulness practices as an adjunct therapy for communities in trauma. When she is visiting Maryland, Eva teaches power vinyasa classes at Yogamour’s affiliated studio. She is a former yoga instructor in Seattle at BeLuminous Yoga and Shakti Vinyasa Yoga.   NEW Baptiste policies just release this week and seem suspiciously in response to our podcast and the issues we have discussed.... Baptiste Yoga buckling down to protect the man and the organization, instead of actually making changes where harm is being done. Buyer beware of any \u0022program\u0022 you enroll in: https://www.baptisteyoga.com/terms-conditions-agreement/?fbclid=IwAR2V7HJTWCSHPzpPrhC3wNfLCJYdszCSGgMpM4ZPUfy16BtJEbXtfCJvAO0 Questions about this episode or stories to share? Contact us on IG @yogacultspod _____________________________________ ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)",
      "release": "2022-03-02T20:46:46Z",
      "duration": "01:09:17.2310000",
      "explicit": true,
      "spotifyId": "21UjIoTkrGVkjrsK6CSIYu",
      "appleId": 1000552745747,
      "urls": {
        "spotify": "https://open.spotify.com/episode/21UjIoTkrGVkjrsK6CSIYu",
        "apple": "https://podcasts.apple.com/podcast/9-fear-not-the-legal-threats-and-bullying-tactics/id1599860304?i=1000552745747"
      }
    },
    {
      "id": "a482a2c0-54ba-4695-a558-7af29728e911",
      "title": "8 - Certifiably Affiliate-ified and Indoctri-buted",
      "description": "We thought that becoming a \u0022Certified Baptiste Teacher\u0022 and a \u0022Baptiste Affiliate Studio\u0022 owner actually meant something of value and we worked hard to achieve this status thinking it represented a higher level of skill and ability in our careers. We took it seriously and then paid a lot of money and spent a lot of time to get there! But as it turns out the \u0022Path of a Baptiste Certified Teacher\u0022 is paved with moving targets and dangling carrots. And standards that change depending on how much status you bring or how many recruits you enroll = $$$ in Baron\u0027s pocket. It\u0027s a \u0022Pay to Play\u0022 system where the goal posts move every few years (or whenever he changes his mind). One day you are paying over $10K to become a \u0022Tier One\u0022 certified teacher and the next day all the standards go away in favor of a Cross-fit model where it takes just one weekend to earn a \u0022Baptiste Certificate. But what does Baptiste Certification even mean when some people just had to be friends with the right people to earn their \u0022500-Hour\u0022 status? Certribut-ifully nothing! Affiliate studios who pay $3K per year to sport the Baptiste name on their website benefit by being allowed to be Facebook friends with other studio owners and being listed on the Baptiste website. Literally, that\u0027s all. A dwindling number of affiliated studios act as recruitment stations by enrolling students into \u002240 Days to Personal Revolution\u0022 where they learn their first thought-terminating cliches and how to start gaslighting themselves, then the studios benefit by getting a $ kick-back for each Level 1 recruit they generate. Would you like to join into this and become a Tier 3 Certified Influencer for the low low price of $100,000?! We can show you how and how much value you will actually (not) get for your investment. Follow us for more tips! _____________________________________ ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)",
      "release": "2022-02-23T23:00:39Z",
      "duration": "01:01:48.7140000",
      "explicit": true,
      "spotifyId": "0WAcD3SiWCQ8EBgtvXpd8v",
      "appleId": 1000552053064,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0WAcD3SiWCQ8EBgtvXpd8v",
        "apple": "https://podcasts.apple.com/podcast/8-certifiably-affiliate-ified-and-indoctri-buted/id1599860304?i=1000552053064"
      }
    },
    {
      "id": "fd536282-2088-4ed0-bb85-149ef1aba60f",
      "title": "7 - Feedback, Victim-blaming \u0026 Tone-police",
      "description": "Updates! We have had SO MANY people reach out to us over he past week which inspired this episode where we respond to some of them.... 1) We have received some \u0022love and light\u0022 style \u0022feedback\u0022 that is outright tone-police.\u0022Let me tell you how to do your podcast so you will land your point...\u0022 Um, NO. 2) People trying to silence us by telling their so-called Leaders to \u0022stop gossiping\u0022 and \u0022stop spiraling below the line\u0022 Aka: victim-blaming 3) Thank you to the brave people who are starting to speak out and take their minds and lives back. Oh f*ck, did we join a yoga cult?! We thought it was an organization that was changing the world through yoga - because the yoga felt so amazing and that\u0027s what the \u0022methodology\u0022 was supposed to help us do. But the deeper we got in, the more indoctrinated we became. We\u0027ve learned a LOT since then about manipulation, coercion, abuse of power and undue influence. (Be a yes, don\u0027t get me started...) And we\u0027re going to share it with you here. Super casual style, not fancy. It\u0027s just us and our opinions and true stories. We are allowed to speak our truth. We hope this helps people. ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.***",
      "release": "2022-02-09T23:40:37Z",
      "duration": "00:52:45.2280000",
      "explicit": false,
      "spotifyId": "2qmG5OguIufOjVkanly65o",
      "appleId": 1000550617636,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qmG5OguIufOjVkanly65o",
        "apple": "https://podcasts.apple.com/podcast/7-feedback-victim-blaming-tone-police/id1599860304?i=1000550617636"
      }
    },
    {
      "id": "7e3e1caf-336e-4450-bfc6-c73bef006678",
      "title": "6 - It\u0027s Been Happening For Years: interview w/ Debbie Williamson the Excommunicated \u0022CEO\u0022",
      "description": "Debbie Williamson was called the \u0022CEO\u0022 in the early days of Baptiste Yoga and owned affiliate studios until she was forced out by Baron in 2011. She had trained with him and loved his style of yoga since her first \u0022Bootcamp\u0022 in 2003 and went on to open one of the first Baptiste Affiliate studios and become a \u0022Master Baptiste Teacher\u0022 as appointed by Baron. She worked as his right hand person during programs (then called bootcamps), conferences and at managing his studios in Boston during those years as was on call for him by phone every day many times a day even on Holidays. One day Baron decided she should not host other \u0022big name\u0022 yoga teachers at her studio, even though the other affiliates were. He bent his own rules until he found a way to force her out and then told the other Baptiste teachers and affiliates that she had quit and stolen his contact list. But wait, there\u0027s much, much more... As evidenced by Debbie\u0027s story, there has been a lot of \u0022odd\u0022 stuff happening in this organization for many years!  ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)",
      "release": "2022-02-03T01:24:29Z",
      "duration": "01:32:23.7170000",
      "explicit": true,
      "spotifyId": "5IpzvNB9jIAf5gAKQHc8bk",
      "appleId": 1000549843674,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5IpzvNB9jIAf5gAKQHc8bk",
        "apple": "https://podcasts.apple.com/podcast/6-its-been-happening-for-years-interview-w-debbie-williamson/id1599860304?i=1000549843674"
      }
    },
    {
      "id": "d3cc8582-10eb-41b8-9368-dec2a87ae106",
      "title": "5 - Level 1: Welcome to Your Indoctrination",
      "description": "What exactly happened in this 6-day training…? Was it a training or was it a “self-help” style Large Group Awareness Training (LGAT) that serves as an indoctrination intensive. Did I even learn any yoga? \u0022If it felt bad, why did you stay? Why did you fall for it?\u0022 Why did we drink the kool-aid? Did you think you were going for one thing - to learn to teach yoga or to deepen your practice -  but you find yourself sharing deep personal trauma in a “hot seat” style questioning session that go on for hours draining your capacity to keep your critical thinking. Did you see red flags but were afraid to speak up because Baron singled out anyone who seemed to not participate and because you had no time to process by yourself or with others because you were too busy. Did you actually learn any yoga alignment, philosophy, ethics? What happened to you on Day 3 - “Breakthrough Day” as the staff calls it. Did you breakthrough or breakdown on that day, give in to Baron and the Methodology and accept and embrace it all? Does this sound familiar? The Recipe for Thought Reform: (from Combating Cult Mind Control by Steven Hassan) “Induced dissociated states, trance-induction via repeated affirmations, extended meditation, lengthy denunciation sessions, renegade psychotherapy without a license, hot seat criticisms focusing on one individual, extensive self-awareness training sessions, trauma bonding, isolation from friends and family, sleep deprivation, food deprivation. Control of information going in and out of the group environment. Peer and leadership pressure, extensive indoctrination sessions…” Did it prey on your desire to good in the world and then give you a discount if you register for Level 2 by then end of the week... what happened to you? ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer) Resources: Therapists for narcissistic abuse support: https://narcissistabusesupport.com/practitioners-page/ @alittlebitculty podcast https://www.alittlebitculty.com/",
      "release": "2022-01-27T00:07:12Z",
      "duration": "01:02:20.3630000",
      "explicit": true,
      "spotifyId": "4qhEPxpl0wyhPir9RyKbO4",
      "appleId": 1000549111832,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qhEPxpl0wyhPir9RyKbO4",
        "apple": "https://podcasts.apple.com/podcast/5-level-1-welcome-to-your-indoctrination/id1599860304?i=1000549111832"
      }
    },
    {
      "id": "7197beee-4dae-451f-b1c5-26fde787a818",
      "title": "4 - The Letter",
      "description": "Be prepared. If a Baptiste leader reaches out to you and tells you to “be in inquiry” around why Baptiste Yoga is not a cult, they might say…   “Don’t go discuss your concerns with other people”  “I’ll tell you what to think and how to feel”  “If you don’t agree with our community’s storyline, please be in inquiry so we can 3 themes the shit out of you until you do”  But seriously, in this episode we talk about a real letter from a real Baptiste studio owner to their present and former teachers and community members, about how they should think, feel and respond to this podcast. This is not so much our response, as our point of view on why they decided to resort to name-calling and doubling down. We talk about what indoctrination is and how it happens to GOOD people. It happened to us! Also, why this type of defensive response is a tell-tale sign that this might be a cult. There, we said it. But you should use your own clear and critical thinking and decide for yourself.  Also, we don\u0027t want your feedback, thanks! (PTSD around that so....)  But do reach out to us with your thoughts on our Instagram @yogacultspod we would love to hear from you! _____________ ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)",
      "release": "2022-01-19T22:03:29Z",
      "duration": "00:37:57.3200000",
      "explicit": true,
      "spotifyId": "5kOZlzoiJbANu6zPnB7RjF",
      "appleId": 1000548411367,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kOZlzoiJbANu6zPnB7RjF",
        "apple": "https://podcasts.apple.com/podcast/4-the-letter/id1599860304?i=1000548411367"
      }
    },
    {
      "id": "c3b6112a-58d2-4aea-a809-2b85d3b9d263",
      "title": "3 - Warning Signs",
      "description": "Let\u0027s see, does it check the boxes? Join us as we go through the warning signs as outlined by cult expert Alexandra Stein: Cult/Totalist Recruitment Warning Signs. This list comes from here website if you want to learn more here: http://www.alexandrastein.com/warning-signs.html   The group/person has the Total and Only answer. Only they have the right line, will make the revolution, solve your problems, empower you, make you loved, rich, effective, holy, etc.  Attempts to isolate you from existing close relationships (friends/family) and the outside world  Extreme, immediate and/or inappropriate friendliness or attention.  Promises of perfection if only you adhere to their program   Your “gut-feeling” tells you something is wrong. Trust this, and try to analyze it.   The group creates conditions of extreme stress, threat or fear (emotional and/or physical)   Not answering questions, or turning them back on the questioner.   Inappropriate personal boundaries   Loaded language: strange language or jargon you initially can’t understand. Canned, repetitive phrases.   A hard sell for further commitment, programs or contact. If you resist, you’re selfish, ungodly, “bourgeois”, don’t believe in yourself, etc.   Encouragement to cut ties with family or friends, unless you can recruit them.   Secrecy, inappropriate “confidentiality”.   Lack of privacy - constantly with group members, constantly busy with group activities.   Ends justifies the means. It’s OK to lie to others in the name of the Cause, God, for success, etc.   Challenging your fundamental identity:  Your strengths are criticized as your weaknesses.   Once you’re in, heavy pressure to stay in.   Those who do leave are shunned. They become the enemy, or objects of pity.   No criticism allowed of the group or leader. The group/leader is always right.   Deception: what you thought you’d get on joining or attending an activity turns out to be something else.  And also... ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)  More resources: \u0022Terror, Love and Brainwashing\u0022 by Alexandra Stein https://www.google.com/books/edition/Terror_Love_and_Brainwashing/ICslDwAAQBAJ?hl=en\u0026gbpv=1\u0026dq=andrea\u002Bstein\u002Bcult\u002Bbook\u0026printsec=frontcover \u0022Thought Reform and the Psychology of Totalism: A Study of \u0027brainwashing\u0027 in China\u0022 by Robert J. Lifton https://www.amazon.com/Thought-Reform-Psychology-Totalism-brainwashing/dp/0807842532",
      "release": "2022-01-12T22:42:59Z",
      "duration": "00:58:36.4290000",
      "explicit": true,
      "spotifyId": "1PGVtFV6mp63xKsXhaqDOZ",
      "appleId": 1000547723943,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1PGVtFV6mp63xKsXhaqDOZ",
        "apple": "https://podcasts.apple.com/podcast/3-warning-signs/id1599860304?i=1000547723943"
      }
    },
    {
      "id": "159bcfc8-f85d-4ebc-99b5-0a75ab5d3a16",
      "title": "2 - What Happened?",
      "description": "Join us as we ask each other \u0022What happened?!\u0022 How did we get here and what do we do now? Do you have similar questions you are asking yourself? Join us as we try and figure out what to do now, what to take ownership for,  who will answer for the wrong-doing and what does accountability look like? Please feel free to reach out to us on our Instagram @yogacultspod if you have something to share, ask or suggest. We are here for all of it. The article from Medium mentioned: https://medium.com/@karinaaynmirsky/abuse-of-spiritual-power-my-story-fc3055e45224 No White Saviors Medium article mentioned: https://nowhitesaviors.medium.com/did-she-bring-yoga-to-africa-or-did-she-just-bring-chaos-to-kenya-8241cd742905 The Vow (HBO documentary about the NXIVM cult) https://www.hbo.com/the-vow Scarred (memoir by Sarah Edmonson her experience in the NXIVM cult) https://www.sarahedmondson.com/book  And also... ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.*** (thank you @alittlebitculty for letting us borrow your very awesome legal disclaimer)",
      "release": "2022-01-05T21:19:53Z",
      "duration": "01:16:48.8120000",
      "explicit": true,
      "spotifyId": "4oXbqdXlVwkjVNyvXkqSse",
      "appleId": 1000547039333,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4oXbqdXlVwkjVNyvXkqSse",
        "apple": "https://podcasts.apple.com/podcast/2-what-happened/id1599860304?i=1000547039333"
      }
    },
    {
      "id": "1a16237e-d995-4f4e-ba89-3a8967bdb415",
      "title": "1 - If You See Something Say Something",
      "description": "Welcome to our very honest and conversations about our own experiences in Baptiste Yoga. We are not here to burn anything down or cancel anyone. BUT however, there are some \u0022practices and techniques\u0022 in this organization that walks, talks and quacks in a very curious way and while claiming to be the pillar of Integrity itself. We had some gut feelings and red flags galore; we ignored them for years because of our strong commitment to \u0022Being a Yes\u0022 for transforming the WHOLE PLANET (!!!) through Baptiste Yoga. Can we save the very essence of what got us all here, what transformed our own lives for the better? While also stopping the manipulative and controlling, exploitative and coercive practices that have us now re-thinking everything we have learned and taught? Join us in our conversation and on this journey. DM us at @yogacultspod on IG or send us a voice message here https://anchor.fm/yogacultspod1029/message ***The views and opinions expressed on Journey Into Yoga Cults are just that: views and opinions; and do not necessarily reflect the official policy or position of the podcast or the hosts. Stories told by hosts and guests are their own personal experiences, viewpoints and perspective. Any content provided by our hosts, guests, sponsors or authors are of their opinion and are not intended to malign any religion, group, club, organization, institution, corporation, business, individual, anyone or anything.***",
      "release": "2021-12-11T08:39:58Z",
      "duration": "00:55:38.6570000",
      "explicit": true,
      "spotifyId": "7xPfJm0iM7PK3dadmhoCKf",
      "appleId": 1000544637116,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7xPfJm0iM7PK3dadmhoCKf",
        "apple": "https://podcasts.apple.com/podcast/1-if-you-see-something-say-something/id1599860304?i=1000544637116"
      }
    }
  ]
}