{
  "_ts": 0,
  "id": "d3b26925-16cc-4f1f-b1f2-00bed45b16ee",
  "name": "Judging Meghan Podcast",
  "youTubeChannelId": "UCaFRplEilf2_-JQvPKDVU5A",
  "episodes": [
    {
      "id": "377dbff5-7938-4998-84a1-19f21ccda5b9",
      "title": "Crystal Ball’s Journey from Cult Trauma to Rediscovering Her Voice",
      "description": "Breaking Free from a Life of Control: Crystal Ball’s Journey from Cult Trauma to Rediscovering Her Voice\n\n\nIn this episode I welcome Crysta Ball, a powerful survivor whose story sheds light on resilience, courage, and the journey of reclaiming one\u0027s life. From an oppressive childhood in a strict cult to the immense challenges she faced after breaking free, Crystal opens up about her path to healing and rebuilding. She shares the reality of leaving behind a life where every choice was controlled, enduring profound losses, and learning to survive on her terms after the devastation of Hurricane Michael.\n\nTogether, we explore the effects of growing up in an environment ruled by fear and repression, and the strength it takes to confront trauma, unlearn harmful teachings, and reclaim self-worth. Crystal discusses her journey to embrace emotional freedom, how she’s breaking generational cycles for her own children, and finding solace in a spirituality rooted in kindness and acceptance.\n\nFor anyone struggling with trauma or looking for hope in dark times, this episode is a raw testament to the resilience of the human spirit. Through heartbreak, loss, and ultimately triumph, Crystal’s story encourages us to find our own paths forward, proving that no matter how challenging the journey, healing, love, and authenticity are within reach.\nWant to learn more about Crystal and her upcoming book go to https://crystalballadventures.com/ \n\n\n\n\n\n\n\n\n\n\nThis podcast is a place for trauma survivors as well as their friends and family. This is a safe environment to be vulnerable but it\u0027s also a place for celebration and moving forward. Let\u0027s all start to embrace who we are becoming by #mentalhealth #selfcare #self #judgingothers #judgingmeghan #suicideawareness #suicideprevention #survivor #resilience #traumahealing #mentalhealthawareness #mentalhealthmatters #podcasts #courage #selfworth #cultsurvivor #breakingfree #vulnerability #entrepreneur  #crystalball #shinyhappypeople #cult #controlled #trauma",
      "release": "2024-10-28T17:56:53Z",
      "duration": "01:01:47",
      "explicit": false,
      "youTubeId": "9Y0Rh5bir-Q",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9Y0Rh5bir-Q"
      }
    }
  ]
}