{
  "id": "25159a17-25c9-4ccd-b4fd-017f332fb152",
  "name": "JULIAN DOREY Clips",
  "youTubeChannelId": "UChs-BsSX71a_leuqUk7vtDg",
  "episodes": [
    {
      "id": "3f8c36cb-e5f3-4385-8776-6681cd14e325",
      "title": "NXIVM Underground Cult is STILL Alive | Sarah Edmondson",
      "description": "FULL EPISODE: https://youtu.be/gw5nhlRiMB8\n\nNXIVM didn’t just recruit vulnerable people — they infiltrated the homes, wallets, and social circles of the ultra-rich.\nFrom Tourette’s “miracle cures” to pseudo-scientific therapy sessions, Keith Raniere built a pipeline straight to billionaires like the Bronfman sisters and the Baskin-Robbins heiress, convincing them that he alone held the key to unlocking their hidden potential.\n\nSARAH\u0027S LINKS:\nIG: https://www.instagram.com/sarahedmondson/?hl=en\nX: https://x.com/sarahjedmondson\nNEW BOOK: https://www.sarahedmondson.com/book\nYT: https://www.youtube.com/results?search_query=a\u002Blittle\u002Bbit\u002Bculty\n\nInside this clip:\n\nHow NXIVM staged fake medical breakthroughs\n\nWhy the Bronfmans handed over their fortune\n\nThe disturbing “hope manipulation” Keith used on recruits\n\nHow Sarah was brought in through a personal connection\n\nThe cult pipeline that mirrored Wild Wild Country\n\nThe insane story of an heiress who gave Keith everything she owned\n\nNo sensationalism.\nNo speculation.\nJust what really happened inside NXIVM’s elite-targeting machine.\n\nWatch the full conversation on the Julian Dorey Podcast.\n@juliandoreyclips",
      "release": "2025-12-04T15:01:19Z",
      "duration": "00:12:01",
      "explicit": false,
      "youTubeId": "hSLPWzDyMEM",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hSLPWzDyMEM"
      }
    },
    {
      "id": "5fac3bf7-aee2-44ef-989c-4a4b5d94b416",
      "title": "Ex-Apple Insider: \u0022Working at Apple Felt Like a Cult...\u0022 | Joe Weil",
      "description": "FULL EPISODE: https://youtu.be/PYcy5ZkLvaw\n\nWhy would a former Apple insider walk away from one of the most powerful companies on Earth? Joe Weil explains why Apple operates like a cult, how your data is quietly handed over, and why the company’s “privacy” branding isn’t what it seems.\n\nJOE\u0027s LINKS:\n- UNPLUGGED PHONE: https://unplugged.com/products/up-phone\n- IG: https://www.instagram.com/weare_unplugged/\n\nFrom Apple’s hidden deals to the rise of spyware like Pegasus, Joe reveals how smartphones have become the perfect tool for surveillance—and why even Apple can’t protect you from it.\n\nInside this episode:\n\nWhy Apple is run like a cult from the inside\n\nHow your data is shared despite Apple’s “privacy” promise\n\nWhy spyware like Pegasus proves Apple can’t stop surveillance\n\nJoe Weil’s unplugged phone solution to fight back\n\nThe real cost of convenience in the smartphone era\n\n🔔 Subscribe to Julian Dorey Clips for more explosive conversations with insiders, whistleblowers, and experts exposing the truths big tech doesn’t want you to know.",
      "release": "2025-09-24T23:00:54Z",
      "duration": "00:14:54",
      "explicit": false,
      "youTubeId": "mi8vRrKWFe4",
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mi8vRrKWFe4"
      }
    }
  ]
}