{
  "_ts": 0,
  "id": "9029bbbc-ab54-497e-ada5-600d5e79a5e8",
  "name": "Just June",
  "youTubeChannelId": "UCqITTxDtoAC6iANuhd3yDdw",
  "episodes": [
    {
      "id": "81b6ed67-da8a-46c9-84dc-5011f5c374ef",
      "title": "My CSA story and the correlation with the story of Dinah. 💗Sensitive subject matter.",
      "description": "Hey there, Just June here...\n\nI just want to edit that the CSA I endured happened from \u002779-\u002781 not the 70s as I stated in the video. \n\nI\u0027ve been taking off the summer, but came across a video that really spoke to me and I felt the need to talk about it... \nThe video came from a channel called \u0027Ghostapostate\u0027 about the worst Bible story ever. And to my surprise we had the same idea on what that story was. it was the story of Dinah and Victim Blaming. I hope you take a few minutes to watch, I will warn you there is a good bit of talk and detail about my CSA experience, so please proceed with caution if you are sensitive to this subject! \n\nAs always, remember to Be Yourself and Be Well!!! 💗😉",
      "release": "2024-07-19T14:56:54Z",
      "duration": "00:14:51",
      "explicit": false,
      "youTubeId": "P8OV2l7m4-o",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P8OV2l7m4-o"
      }
    },
    {
      "id": "b20703be-d733-482c-92a2-313e6382d464",
      "title": "Interview With Stef Woke Up About PA CSA Cases",
      "description": "Hi there,    \nJust June here...\n\nI recently sat down with Stef Woke Up on her channel for a chat.  She was nice enough to send me the video to post on my channel as well in case anyone missed it.  \n\nI hope you enjoy it, and while you\u0027re at it, check out Stef\u0027s channel here: http://www.youtube.com/@StefWokeUp\n\nAnd as always...  remember, be yourself and be well! 💗",
      "release": "2024-06-11T12:34:18Z",
      "duration": "00:57:13",
      "explicit": false,
      "youTubeId": "FqZaBswoAj4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FqZaBswoAj4"
      }
    },
    {
      "id": "4113c7b2-e156-4322-b25a-acab0fcd298e",
      "title": "A Call for Help",
      "description": "Go Fund Me for the Haugh family:\nhttps://gofund.me/243d2e8d\n\nJust June here.  I wanted to get a brief video out to see if any are able to help our dear friends Martin and Jenn Haugh, who tragically lost their son Sam recently.  The link to the go fund me is above.  I have also linked my interview from last year with Jenn.  She is a wonderful soul and I hope this helps you get to know her a bit better.\n\nJenn\u0027s Interview:\nhttps://youtu.be/BJa8IXPahBY?si=JnxgHth1TBw4tXip",
      "release": "2024-05-31T10:24:04Z",
      "duration": "00:02:47",
      "explicit": false,
      "youTubeId": "VNk43apuBtw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VNk43apuBtw"
      }
    },
    {
      "id": "b0f82eda-48fb-435b-a006-db79b2ca81f8",
      "title": "Just June Channel Update! Taking a Summer Hiatus 🪷 Be back in the Autumn...",
      "description": "Hey there Just June here... \n\nAfter some careful consideration, I\u0027ve decided to take a little hiatus for the summer. I\u0027ll be back in November. I have 2 interviews already lined up. ☺️ \n\nMy social media forms are as follows, in case you want to get in touch through the summer: \nInstagram: justjune73 \nFacebook: Deanna June Nic\nEmail: justjune1973@gmail.com \n#stoptheshun \nI sincerely hope you all have an absolutely amazing summer and remember... to be yourself and be well! \n💗🪷😉",
      "release": "2024-05-03T12:49:55Z",
      "duration": "00:05:32",
      "explicit": false,
      "youTubeId": "qT7yWkvqmSM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qT7yWkvqmSM"
      }
    },
    {
      "id": "0927aa7c-b31f-471f-8232-f4e3d1a5cb75",
      "title": "Can You \u0022Wake Up\u0022 Your Loved One From Watchtower Indoctrination? Our Story.",
      "description": "Hi there,    \nJust June here...\n\nIn this video, Jared and I talk about our waking up story in greater detail, specifically, me not being ready to be \u0022awake\u0022 when the rest of my family was. They decided to be open and honest and tell me that they no longer wanted to go to meetings or be JWs! They also told me they would love and support me as I continued, on my own, with my service to Jehovah... and they really meant it! \n\nEventually, I did \u0022wake up\u0022 but did THEY do it? or was I just READY? We discuss all the ins and outs of this complicated topic and hope to give you some insight on what to do, and more importantly, what NOT to do with a loved one you are hoping will \u0022wake up\u0022 from Watchtower indoctricroction. \n\nand as always...  remember, be Yourself and be well! 💗",
      "release": "2024-04-15T13:00:45Z",
      "duration": "00:56:56",
      "explicit": false,
      "youTubeId": "lYgIexdorl8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lYgIexdorl8"
      }
    },
    {
      "id": "80a963eb-81d0-4d52-add0-409f99dd6080",
      "title": "Are Watchtower\u0027s New Changes Driving JWs to Drink?",
      "description": "Just June Here.  Today I wanted to go a little deeper into drinking, addiction, and Jehovah\u0027s Witnesses.  With the recent changes to organizational policy adding frustration and pressure to some in and some who have left the JWs, some have turned to unhealthy ways to cope.  There are healthier means, though, to dealing with these pressures.\n\nUnlike what is being offered by the Governing Body for addiction support and recovery, the World actually offers helpful and scientifically proven methods to treat and overcome addiction.\n\nDo you need help with addiction right now?  Here are some groups that can help regardless of what you believe or don\u0027t believe.\n\nhttps://smartrecovery.org/ - SMART Recovery is the leading, evidence-informed approach to overcoming addictive behaviors and leading a balanced life. SMART is stigma-free and emphasizes self-empowerment.\n\nhttps://www.aa.org/ - 12 step recovery program with an emphasis on a Higher Power.\n\nhttps://na.org/ - 12 step recovery program with an emphasis on a Higher Power.\n\nhttps://www.worldwidesecularmeetings.com/ - 12 step recovery program with an emphasis on a Higher Power, geared toward agnostics and atheists.\n\nhttps://thesatanictemple.com/pages/sober-faction  - The Satanic Temple Sober Faction provides peer support recovery for addiction free from the pseudoscience and superstitious dogma entrenched in most mainstream programs.\n\nThough I am not an addiction treatment professional, if you need someone to talk to, I can be reached via email at justjune1973@gmail.com\n\nAs always, be yourself, and be well.",
      "release": "2024-04-02T00:27:17Z",
      "duration": "00:56:14",
      "explicit": false,
      "youTubeId": "yVysvAdCTV4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yVysvAdCTV4"
      }
    },
    {
      "id": "6cd8b7ce-9bfd-4f21-a207-ea239f18c27b",
      "title": "Do watchtower\u0027s new policies change anything for some? - Ken\u0027s Story",
      "description": "Just June here...\n\nPlease join me in welcoming Ken to my channel.  His story is all too common in the Jehovah\u0027s Witness community.  Hiding who you are, unable to live an authentic life, trying to make it work, finally breaking free, suffering widespread shunning from family and friends.\n\nKen\u0027s story is such a wonderful example of learning to love who you are, setting healthy boundaries with people in your life who don\u0027t understand what boundaries are,  and finding family, community, love and kindness on the other side.\n\nThis is a longer video, so here are some chapters in case you want to navigate around.\n\n00::00 - Intro - Early life\n11:35 - Baptism and Meeting my JW Wife\n32:50 - Cracks Start to Form\n44:00 - Married at 18!\n1:03:18 - Beginning to Fade\n1:06:30 - Starting to Live My Truth/A Plan\n1:16:35 - Coming Out\n1:25:36 - Push and Pull With Parents\n1:43:00 - Shunned\n1:48:00 - A New Start and A Growing Family\n1:52:36 - Setting Healthy Boundaries\n1:56:54 - A Reunion and More Shunning\n2:05:58 - One Last Chance\n\nKen is just breaking into the world of exjw activism, so please head over to his YT channel and socials and give him some love.\n\nKen\u0027s Youtube channel and socials:\nYoutube: www.youtube.com/@kennethexjw\nTikTok: https://www.tiktok.com/@kennethexjw\nFacebook: https://www.facebook.com/kenneth.e.stutzman/\n\nAre you in the LGBTQ community and in need of help or resources?\nhttps://www.thetrevorproject.org/\n\nAnd always remember, to be yourself and be well!",
      "release": "2024-03-23T12:00:30Z",
      "duration": "02:14:15",
      "explicit": false,
      "youTubeId": "dO15qsRNHS4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dO15qsRNHS4"
      }
    },
    {
      "id": "5b2c0fd1-0d53-4c0b-a199-b0a1df781f58",
      "title": "June and Jared Outtakes #1",
      "description": "Just a little fun that happens when we film.",
      "release": "2024-03-18T12:23:04Z",
      "duration": "00:00:34",
      "explicit": false,
      "youTubeId": "YdQENCUrC9w",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YdQENCUrC9w"
      }
    },
    {
      "id": "6d376aec-8735-41d2-921f-d2ea8c2d5550",
      "title": "June and Jared Outtakes #2",
      "description": "Just a little fun that happens while we film.",
      "release": "2024-03-18T12:23:00Z",
      "duration": "00:00:37",
      "explicit": false,
      "youTubeId": "h-Rv-StiZas",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h-Rv-StiZas"
      }
    },
    {
      "id": "87fa25de-073e-4760-9fee-f563f1d4eae4",
      "title": "June and Jared Outtakes #3",
      "description": "Just a little fun that happens while filming.",
      "release": "2024-03-18T12:22:56Z",
      "duration": "00:00:31",
      "explicit": false,
      "youTubeId": "oq96kCFE8zE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oq96kCFE8zE"
      }
    },
    {
      "id": "cf719d5e-e313-4130-8a06-ef1fc0fd8866",
      "title": "June and Jared Outtakes #4",
      "description": "Just a little fun that happens while filming.",
      "release": "2024-03-18T12:22:53Z",
      "duration": "00:00:34",
      "explicit": false,
      "youTubeId": "_PLb8ESJ6F4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_PLb8ESJ6F4"
      }
    },
    {
      "id": "d017e4d6-95a6-47bb-89cf-474ced7714eb",
      "title": "June and Jared Watch the Governing Body Update - Are They Serious?",
      "description": "Just June here...\n\nI decided to go for something a little different, and enlist a helper for this video.  The latest update from the GB is full of some very interesting changes.  Join me, along with my husband Jared, as he makes a rare appearance and we discuss, debate, deliberate and dissect the latest from our beard loving friends in New York.  I hope you enjoy watching it as much as we enjoyed filming it!\n\nDon\u0027t forget to like, comment and subscribe if this is content that interests you.  And please let us know if this format is something you would like to see every month or so.  We are considering making this an ongoing segment.\n\nAnd always remember, to be yourself and be well!",
      "release": "2024-03-16T23:41:36Z",
      "duration": "00:54:46",
      "explicit": false,
      "youTubeId": "wDh5Cj8gBOw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wDh5Cj8gBOw"
      }
    },
    {
      "id": "9de2f3ef-c09f-4121-b603-44520158b763",
      "title": "Shunned by Our Four Kids - Joe and Fran\u0027s Story",
      "description": "Just June here...\nI think you will find Fran and Joe Guerino\u0027s story full of love and compassion. Especially when you take into consideration the fact that they asked me to share their home phone number and email address with all of you.\n\n They want anyone who is in need of a listening ear about the things they are going through in regards to the JW organization to please feel free to reach out to them. They are looking to build a network of ExJWs across the globe. They are hoping to support, encourage and help one another while we get through the shunning that the Watchtower puts us through. Watchtower does this in an attempt to shame, guilt and break us down. Let\u0027s pull together and #StopTheShun\n\nFran \u0026 Joe: 315-221-0130\njandfguerino@gmail.com \nTo get in touch with me, Deanna June:\njustjune1973@gmail,com \nAnd always remember, to be yourself and be well!",
      "release": "2024-03-09T21:08:43Z",
      "duration": "01:12:01",
      "explicit": false,
      "youTubeId": "LXMrHuNEQ-Y",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LXMrHuNEQ-Y"
      }
    },
    {
      "id": "1a78b0ca-b1c8-4d20-8ab8-6fbe6fe193b2",
      "title": "Shame \u002B Shunning = Control   #StopTheShun",
      "description": "Just June here...\n    I wanted to share with you some interesting things I\u0027ve learned from a book I\u0027m reading called \u0027Atlas of the Heart\u0027 by Brene Brown. In it, she talks about how our emotions affect our actions and how we see ourselves. I cover the section specifically about \u0027Shame\u0027 and how we can combat this often negative emotion that Watchtower so often uses as a tool to keep it\u0027s members under their control, including the shunning that is still going on throughout the world. And always remember, to be yourself and be well!",
      "release": "2024-03-02T01:15:46Z",
      "duration": "00:15:29",
      "explicit": false,
      "youTubeId": "RdxVQYaUdbc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RdxVQYaUdbc"
      }
    },
    {
      "id": "b5fb0c1e-7633-408f-b337-44c208fa10e7",
      "title": "Jehovah\u0027s Witness kids... not allowed to celebrate birthdays! How it affects them even years later!",
      "description": "It\u0027s my 51st birthday and just some reflection of not celebrating my birthday for the first 46 years and how it affects children at the time and us years later.",
      "release": "2024-02-22T20:21:59Z",
      "duration": "00:11:02",
      "explicit": false,
      "youTubeId": "_OdqstAWF0w",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_OdqstAWF0w"
      }
    },
    {
      "id": "96ebae3b-4745-445a-8bf2-5ae269007eab",
      "title": "Just June is live!",
      "description": "Let\u0027s chat and get to know each other better! 😁",
      "release": "2024-02-12T08:07:06Z",
      "duration": "01:27:36",
      "explicit": false,
      "youTubeId": "NOjdskjzOD8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NOjdskjzOD8"
      }
    },
    {
      "id": "a047e128-3daf-4ffc-9d54-a230ddd890cf",
      "title": "Just June is live!",
      "description": "Let\u0027s chat and get to know each other better!",
      "release": "2024-02-11T18:06:37Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "kRIgTiUCas4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kRIgTiUCas4"
      }
    },
    {
      "id": "ed20cebe-e02c-4fc4-810c-86359d65601a",
      "title": "I Was Still Letting Watchtower Set My Boundaries!!!",
      "description": "Just June here! \nWatchtower set out all our Choices and Boundaries for us, we could not make any decisions for ourselves, could we? Take a look with me, with the help of professional therapist, Sarri Gilman,  at the benefits and power of taking back control and setting your OWN boundaries. Ultimately, gaining the ability to have a happy and healthy way of life after leaving the JW organization.  And as always, remember to... Be Yourself and Be Well!",
      "release": "2024-02-07T00:44:04Z",
      "duration": "00:27:04",
      "explicit": false,
      "youTubeId": "CwxOFF1mj7A",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CwxOFF1mj7A"
      }
    },
    {
      "id": "f28fb8c5-7db1-41ee-a1ed-c46633f4124b",
      "title": "I wasn\u0027t being totally honest with you.  An EXJWs confession.",
      "description": "Just June here!\n\nSometimes we have to discuss things that aren\u0027t pleasant.  This is one of those times.  My alcoholism was affecting my ability to be honest while creating content for my channel when I started out.  I felt the need to give you the whole story as well as the positive outcome.\n\nIf you need to reach out or someone to talk to, you can always email me at justjune1973@gmail.com\n\nAs always, be yourself and be well.  :)",
      "release": "2024-01-27T22:30:00Z",
      "duration": "00:32:17",
      "explicit": false,
      "youTubeId": "1KuSnZ3K3x8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1KuSnZ3K3x8"
      }
    },
    {
      "id": "c595f251-85a9-48a9-906f-ac90ec50a871",
      "title": "Positivity and Sobriety after waking up from the JWs...",
      "description": "Some thoughts on positivity and possibilities for everyone to help with your outlook on the day! I talk about an experience with an elder that actually helped me get into rehab and not get disfellowshipped. And the benefits of always showing kindness despite how JWs may be treating you and why it\u0027s a good idea. #exjw #positivevibes #sobrietyafterjwlife #sobriety",
      "release": "2024-01-22T20:05:16Z",
      "duration": "00:16:27",
      "explicit": false,
      "youTubeId": "G1s7L5kaNkM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=G1s7L5kaNkM"
      }
    },
    {
      "id": "f53c7859-7152-485b-89ec-bf0010a711a0",
      "title": "My struggle with alcohol and freedom after Watchtower!",
      "description": "This is just a quick glimpse into a longer upcoming video I intend to put out in February. It\u0027s about why I was not making videos for the last year and my struggle with alcoholism, self worth and the pressure of having new found freedom from Watchtower and not knowing how to handle it after 45 years in the high control religion. I hope you stay tuned for the longer, more in depth video coming soon and subsequent videos thereafter. And remember, Be yourself and Be well! ☺️💗",
      "release": "2024-01-21T05:30:50Z",
      "duration": "00:07:57",
      "explicit": false,
      "youTubeId": "dJkw1Y8_m4A",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dJkw1Y8_m4A"
      }
    },
    {
      "id": "bdec33d3-8253-400b-8740-5934017e1534",
      "title": "Life As a Woman Inside the Jehovah\u0027s Witnesses - Interview with Jenn Haugh",
      "description": "Just June here!\n\nI want to thank Jenn for coming on the channel.  I hope you all enjoy our conversation, as we talk about life and misogyny inside the organization, and ways to empower ourselves after we get out.\n\nIf you would like to reach out to Jenn you can email her here: jhaugh5@wgu.edu\n\nAs always, be yourself and be well.  :)",
      "release": "2023-03-26T19:28:36Z",
      "duration": "00:54:52",
      "explicit": false,
      "youTubeId": "BJa8IXPahBY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BJa8IXPahBY"
      }
    },
    {
      "id": "1b644af0-38ba-4750-91dc-255d723b7609",
      "title": "Putting on the New Personality - With Phylice - Totally Awake! Exjw",
      "description": "Just June here...\n\nAre you putting on the new personality?  Join me and my friend Phylice, aka Totally Awake! Exjw, as we discuss this requirement of the org to fundamentally change your thinking, whether you need to or not, in order to fit in with what 8...I mean 10... men in New York demand.\n\nPhylice\u0027s channel - https://www.youtube.com/@totallyawakeexjw\n\nThe Bite Model - https://freedomofmind.com/cult-mind-control/bite-model/\n\nI hope you enjoy our breakdown and discussion of this topic.  I\u0027d love to hear what you think, either in comments or at my email justjune1973@gmail.com\n\nAs always, remember to be yourself, and be well.",
      "release": "2023-01-26T14:00:28Z",
      "duration": "00:27:37",
      "explicit": false,
      "youTubeId": "p8fUvPZg3Dg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=p8fUvPZg3Dg"
      }
    },
    {
      "id": "08d9c0b0-1ff3-42d4-b64b-41f52bf17452",
      "title": "Andies Story - Awake at 8",
      "description": "Just June here - What\u0027s it like growing up around but not in the JWs?  Join me as I have a conversation with my friend Andie.  We talk about family, indoctrination, and having really advanced critical thinking skills as a very young child.  I hope you enjoy!!",
      "release": "2023-01-15T00:30:13Z",
      "duration": "01:11:17",
      "explicit": false,
      "youTubeId": "jDSiiAG3a_U",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jDSiiAG3a_U"
      }
    },
    {
      "id": "806e1cff-f465-4513-94d1-6036dc315850",
      "title": "Disfellowshipping - Loving and Scriptural or Cruel and Inhumane?",
      "description": "Just June here.\n\nAround 70,000 Jehovah\u0027s Witnesses get disfellowshipped every year, most of whom never come back.  What purpose does it serve?   Is it kind or inhumane?  Let\u0027s get into to it.\n\nPlease check out the fine work Steve Hassan is doing at https://freedomofmind.com/\n\nAnd here are the links to the two books I mentioned:\nCombatting Cult Mind Control - https://a.co/d/9utDEXI\nFreedom of Mind - https://a.co/d/gowKnsP\n\nAs always, be yourself, and be well.",
      "release": "2023-01-08T02:37:59Z",
      "duration": "00:25:56",
      "explicit": false,
      "youTubeId": "_Zb0hvvCI0w",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_Zb0hvvCI0w"
      }
    },
    {
      "id": "a63c672b-c6e3-4c0a-9e02-968ed9f42bfc",
      "title": "How I Woke Up - My husband, the former Ministerial Servant\u0027s story.",
      "description": "Just June here.  Please join me as a interview my husband, The Producer.  :)\nHis story is involved and worth a listen to.  He is the one who helped me wake up from the indoctrination.  I hope you enjoy it!\nAs always, be yourself and be well.",
      "release": "2022-12-30T04:03:57Z",
      "duration": "01:12:18",
      "explicit": false,
      "youTubeId": "g35OMZFZWYE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g35OMZFZWYE"
      }
    },
    {
      "id": "f423a9b1-455a-473f-9ab7-33a8cc0a0ab1",
      "title": "Snooping on my ExJW Daughter\u0027s iPad and Guess What I Found",
      "description": "June here - back with an interview with my daughter.  This is a particularly emotional interview for both of us.  We talk about what life is like inside an overtly homophobic organization when you know you don\u0027t fit their perfect vision of a \u0022young Christian woman.\u0022  \n\nThanks so much for all of your ongoing support.  And as always be yourself - no matter who you are, who you love or what you believe - and be well.",
      "release": "2022-12-24T15:00:00Z",
      "duration": "00:43:54",
      "explicit": false,
      "youTubeId": "1V6YOUb4agc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1V6YOUb4agc"
      }
    },
    {
      "id": "36e3a1eb-4ceb-4a31-84c1-7273f6ea04e7",
      "title": "Some small musical ExJW comfort despite despair",
      "description": "Just June here!\n\nShorter video this time, it\u0027s all about music and the helpful impact it\u0027s had on me. I say it at the end, but I wanna reiterate, that I\u0027d love to hear from all of you! What are your go-to songs when you need a pick-me-up?\n\nAs always, be yourself and be well. ♡",
      "release": "2022-12-21T20:04:08Z",
      "duration": "00:12:51",
      "explicit": false,
      "youTubeId": "so7mTOGHn8M",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=so7mTOGHn8M"
      }
    },
    {
      "id": "3bcb6f75-1ff0-4ac3-9239-13dbfc7b1b31",
      "title": "How I Woke Up: The Guilt of a JW Mom",
      "description": "Just June here.  This is the story of me waking up from the organization.  It\u0027s a little more on the  serious side and it was not my easiest video to record.  I hope my experience - the good, the bad and the painful - is something  beneficial  for you all.    As always, be yourselves, and be well.",
      "release": "2022-12-17T16:55:09Z",
      "duration": "01:02:14",
      "explicit": false,
      "youTubeId": "LP4zABMuMyI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LP4zABMuMyI"
      }
    },
    {
      "id": "f886921f-8ff2-4a9c-b2ab-99103718404e",
      "title": "My son leaving the JWs, part 2 of the interview...",
      "description": "Just June here,\n\nI hope you enjoy Part 2 of my interview with my exJW son, Thomas.  If you haven\u0027t seen Part 1 yet, you can find it here - https://youtu.be/M5tRXn6xdds\n\nThanks again for watching!  Don\u0027t forget to like, comment and subscribe.",
      "release": "2022-12-13T13:00:18Z",
      "duration": "00:27:10",
      "explicit": false,
      "youTubeId": "bCQJu4l2VMM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bCQJu4l2VMM"
      }
    },
    {
      "id": "ec780a84-5371-4cd4-b4b5-ed153deac91b",
      "title": "ExJW mom interviews ExJW son...",
      "description": "Just June here!\n\nThank you for coming back, hope you enjoy this interview with my son. Stay tuned for part 2!\n\nAs always, thank you for watching! Be yourself and be well. ♡",
      "release": "2022-12-10T00:54:27Z",
      "duration": "00:29:07",
      "explicit": false,
      "youTubeId": "M5tRXn6xdds",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=M5tRXn6xdds"
      }
    },
    {
      "id": "e53f646b-8b8d-463c-9c66-6409bb9ec095",
      "title": "first ever ExJW video #jehovahswitnesses #exjw  #exjwhelp #yourstorymatters",
      "release": "2022-11-29T23:55:51Z",
      "duration": "00:12:26",
      "explicit": false,
      "youTubeId": "aQoG4ixI3hI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aQoG4ixI3hI"
      }
    },
    {
      "id": "7cbe42f9-c075-41d8-97a1-09ca8d652903",
      "title": "I love this old memory....",
      "release": "2022-09-27T05:30:29Z",
      "duration": "00:02:37",
      "explicit": false,
      "youTubeId": "otk3phlIpCw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=otk3phlIpCw"
      }
    }
  ]
}