{
  "_ts": 0,
  "id": "21d6d34e-c91b-473d-b122-1b8fe1e3d2b0",
  "name": "Just Healing",
  "spotifyId": "5ymUmTDF36KCTThJcMKM13",
  "appleId": 1647439232,
  "episodes": [
    {
      "id": "e77d3c9e-3efb-4940-9454-917f09d2b689",
      "title": "Healing From High Control: Survivor Insights on Cult Dynamics and How to Break Free of Them",
      "description": "In this episode, Dr. Debra explores the less-sensationalized side of cults with Ashley Easter, the resilient founder of Courage365 and a survivor of a high-control religious group. Together, they delve into the complexities of defining and categorizing cults. Ashley candidly discusses her personal experience growing up in a highly controlled religious community, providing insights into the numerous layers of control she navigated. Emphasizing the importance of critical thinking and trusting one\u0027s intuition when confronted with cult dynamics, Ashley also extends valuable resources and support for survivors as she highlights her impactful efforts in empowering individuals through coaching and education. Ashley\u0027s Links: AshleyEaster.com, Ashley\u0027s Instagram, Courage365.org, Courage365 Instagram Dr. Debra\u0027s Links: Website⁠⁠, ⁠⁠Instagram⁠⁠, ⁠⁠LinkedIn⁠⁠ Note: This conversation includes some content that might not be suitable for all audiences and ages. The views and opinions expressed in this program are those of the speakers and do not necessarily reflect the views or positions of MenHealing. #CultDiscussion #TrustYourGut #CriticalThinking #SurvivorSupport #Healing Join us for a new episode each week throughout 2024, where we\u0027ll continue to spread the message of hope and healing and welcome Just Healing\u0027s other three new co-hosts, ⁠Timothy Duvall Brown⁠, ⁠Dr. Greg Cason⁠, and ⁠Jayce Baron⁠. It\u0027s going to be an exciting year. And remember, you are worthy, trauma does not define us and healing is a collective journey. This podcast is produced by Dr. Debra, in collaboration with ⁠MenHealing⁠, a nonprofit dedicated to helping provide accessible resources and community for any male or male identifying survivor of sexual harm. MenHealing\u0027s aim is to help, heal, inspire, and break isolation for survivors. You can donate, check out our healing events, videos, and other resources at ⁠www.menhealing.org⁠ Connect with MenHealing on social media! ⁠Facebook,⁠ ⁠Instagram⁠, ⁠LinkedIn,⁠ ⁠X⁠, and ⁠YouTube⁠ We want to hear from you! At MenHealing, we value feedback on all of our healing work and projects, including this podcast! ⁠CLICK HERE⁠ to share your thoughts. If you or someone you know has been a victim of sexual harm and you need to talk to someone, ⁠RAINN ⁠can help. Call their National Sexual Assault Hotline to speak with a trained staff member who can provide you with confidential crisis support. It\u0027s free, confidential, and 24-7. Call 1-800-656-4673.  ---   Send in a voice message: https://podcasters.spotify.com/pod/show/justhealing/message",
      "release": "2024-01-12T12:00:00Z",
      "duration": "00:35:20.7690000",
      "explicit": true,
      "spotifyId": "0mIdr0VRL3DGlywiFURbuR",
      "appleId": 1000641424156,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0mIdr0VRL3DGlywiFURbuR",
        "apple": "https://podcasts.apple.com/podcast/healing-from-high-control-survivor-insights-on-cult/id1647439232?i=1000641424156"
      }
    }
  ]
}