{
  "id": "dfed454e-0862-4761-b8ff-884e99bc2b0e",
  "name": "Just Over Here with Kimberly Novosel",
  "spotifyId": "63ae9zmgzApu4Ct4rwRmbR",
  "appleId": 1710034046,
  "episodes": [
    {
      "id": "4dde21b4-8359-464f-ae51-d572367ca689",
      "title": "04. Just Over Here Deconstructing with Dr. Quincee Gideon",
      "description": "Dr. Quincee Gideon is here talking about her journey recovering from religious trauma and all the ways we heal over and over again throughout our lives.The advice Dr. Quincee gave to Kimberly before her divorceLearning about trauma from within itCreating a description of \u0022God\u0022 for ourselvesDefining and understanding trauma and the impacts of religious traumaThe work of deconstructing: \u0022Can I tell myself the truth of what I\u0027ve been through?\u0022An exercise in practicing empathy for our past selvesConnect with us at Just Over Here:Website: justoverhere.comIG: @justoverherepodcastIG: @kimberlynovoselAbout Dr. Quincee GideonDr. Quincee Gideon is a licensed psychologist that specializes in religious trauma and cult recovery.  She takes science-backed ways of understanding trauma in the brain and body to help trauma survivors recover.  She owns Woven Together Trauma Therapy, a trauma-specialty practice in Los Angeles and Traumastery, which is an online space for religious trauma and cult recovery.  She has a growing monthly membership of survivors of religious trauma coming together to learn the psychology behind religious abuse while getting some peer support along the way. She also teaches therapists how to address religious trauma clinically in her monthly therapist training program. Website: woventraumatherapy.com and traumastery.comIG: @drquincee",
      "release": "2023-10-30T00:00:00",
      "duration": "00:52:32.4570000",
      "explicit": true,
      "spotifyId": "0XUuzlY9R46shm51bBBcxd",
      "appleId": 1000633126036,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0XUuzlY9R46shm51bBBcxd",
        "apple": "https://podcasts.apple.com/podcast/04-just-over-here-deconstructing-with-dr-quincee-gideon/id1710034046?i=1000633126036"
      }
    }
  ]
}