{
  "_ts": 0,
  "id": "d6e2d166-80cf-46d1-a6e6-e43551d1ff10",
  "name": "Just Dumb Enough Podcast",
  "spotifyId": "7HRfNpksIn3qVHcU0MFHBY",
  "appleId": 1588060916,
  "youTubeChannelId": "UCQbY5JwT3F4c_AcmT16mbvw",
  "episodes": [
    {
      "id": "97367373-5d81-4eba-914f-d11e9d59f89c",
      "title": "Born in a Cult with Gabriel Milon",
      "description": "As a global culture obsessed with cults, we know very little about what it\u0027s truly like to be in one; much less what it takes to escape and start a normal life for yourself. Welcome to the Just Dumb Enough Podcast. A show that acknowledges no one is always an expert, by dispelling misconceptions with real experts. My guest today is Gabriel Milon. Gabriel was born into a very famous Christianity based cult, and by the time he tried to make a normal life: He had to rebuild who he was from the ground up. It\u0027s not all black cloaks and daggers with human sacrifice, but it is an absolutely enlightening and engaging story, so stick around! ( Www.MagicMind.Com/JustDumb20 - Code: Dumb20 ) Let\u0027s be careful with who we call Grandpa! This story of escape and a successful life after is really something that makes me feel good and hopeful, but for as much as we touched on: There is hours more content about the darkness and depravity behind the Children of God cult. Honestly, I don\u0027t think there is a solid reason for this show to dive into the worst of the worst. If you found this episode entertaining, use it as a springboard to seek out other shows like \u0022Last Podcast on the Left\u0022 who did a full five part series on the inner workings. In other news, July is almost over and the rankings have updated just a little: 1. The United States, now led by New York, California, and Texas. 2. England of the United Kingdom. 3. Canada, led by Ontario, with British Columbia trying to catch up last minute. 4. Australia, with New South Wales holding a lead, and Victoria trailing behind. 5. Ghana, overtaking New Zealand this week. It\u0027s a tight race as we close up the month in a few days. That\u0027s it for this week! Have a great week, a great weekend, and I\u0027ll see you all back here next week for another new episode! Until the next episode, pretty please do all the things to help the show: rate, review, like, and subscribe. Reach out to DumbEnoughPodcast@Gmail.Com or on any social media if you want to reach me personally. Most importantly, Stay Dumb!",
      "release": "2024-07-29T23:25:00Z",
      "duration": "00:58:49.1680000",
      "explicit": false,
      "spotifyId": "1qhwXdkKXBrGYMGX5sHn2N",
      "appleId": 1000663734785,
      "youTubeId": "D33YEmxGV50",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1qhwXdkKXBrGYMGX5sHn2N",
        "apple": "https://podcasts.apple.com/podcast/born-in-a-cult-with-gabriel-milon/id1588060916?i=1000663734785",
        "youtube": "https://www.youtube.com/watch?v=D33YEmxGV50"
      }
    }
  ]
}