{
  "id": "4ab9e17f-540d-48ad-b425-64b0da739805",
  "name": "JUSTICE DIARIES 254",
  "youTubeChannelId": "UCVyBvrObzkrq1-bLLaMgchg",
  "episodes": [
    {
      "id": "aa846af2-36a1-4809-9a75-5890260150a5",
      "title": "Who Cries For The Children Of Shakahola?",
      "description": "Who cries for the children of Shakahola?\nThis episode of Justice Diaries follows the emotional testimony of Hellen Mwikali Kimwele, a frontline child advocate whose story represents far more than one individual.\nHellen stands in for the many:\n• the child protection officers,\n• the state agents on the ground,\n• and the relatives — the uncles, aunties, grandparents —\nwho tried to save children long before the nation understood the scale of the tragedy.\nIn this episode, we revisit her journey from 2017 to 2025, tracing the impact of the Shakahola tragedy on those who carried the children into safety, held their stories, and continue to shoulder the weight of their healing and justice. Her tears in court are not only personal; they echo the grief and frustration of countless families and frontline responders across the country.\nWho Cries for the Children of Shakahola? is not about one witness — it is about an entire network of people who fought to protect the children long before the cameras arrived.\nIt is about the national silence, the unanswered questions, and the human cost of a tragedy still unfolding in Kenya’s courts.\nThrough this story, we ask the country to look beyond the headlines and see the individuals who carried the burden, the children who survived, and the justice still owed to a nation.",
      "release": "2025-11-30T07:07:07Z",
      "duration": "00:17:31",
      "explicit": false,
      "youTubeId": "9QSCKpCtZnU",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9QSCKpCtZnU"
      }
    },
    {
      "id": "7d57490c-bc2f-42e7-a644-bcb9c9eb0291",
      "title": "Charging Paul Mackenzi:Kwa Binzaro Homicide",
      "description": "Charging Paul Mackenzie: The Kwa Binzaro Homicide\n\nThis episode opens in court, where four individuals are charged in the Kwa Binzaro case—a matter barely three months old since the exposé, yet already of significant public interest.\n\nThough officially treated as a homicide, the emerging links between Kwa Binzaro and the broader events associated with Mackenzie suggest a far more serious pattern. When viewed together, homicide becomes an understatement; the scale and impact resemble a massacre.\n\nIn this episode, we trace the unfolding story from the courtroom back to the community, documenting what is known so far and why this case demands close public attention. We also explore parallels with similar cases in other jurisdictions, highlighting the importance of early intervention and transparent processes.\n\nFollow, subscribe, and stay informed.\nFor every account narrated, the verdict is yours.\nShare your reflections in the comments (within community guidelines).",
      "release": "2025-11-20T00:46:44Z",
      "duration": "00:18:18",
      "explicit": false,
      "youTubeId": "d1rJfEIoHso",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d1rJfEIoHso"
      }
    }
  ]
}