{
  "_ts": 0,
  "id": "a8e5281d-f557-4290-863d-57c0c57168b9",
  "name": "Justice Is A Process!!!!",
  "youTubeChannelId": "UCOyS97z2Kium7iDV6wwctUg",
  "episodes": [
    {
      "id": "d79b5efe-9394-4871-9834-a7c23417a2fa",
      "title": "Cult Members Wild Testimony Ends With Crazy Cross-Examination!!!",
      "description": "Twenty-four-year-old mom Chloe Driver was charged with malice murder after she allegedly stabbed her 13-month-old daughter, Hannah, to death in 2020. When 911 was called, police said they found both the baby and Driver in her bedroom, each suffering from severe stab wounds. Chloe Driver is facing multiple charges, including murder and child cruelty. If convicted, she could face life behind bars.\n\nWe will cover questions, comments, and reactions during our live Justice Watch Live Broadcasts as we cover the trial and witnesses. \n \nOfficial Support For Channel Can Be Shown At Following Sites Below!!!!\n\nBuy Us A Coffee:\n\nhttps://ko-fi.com/justiceisaprocess\n\nCash App:\n\nhttps://cash.app/$Justiceisaprocess\n\nWe appreciate You All!!!\n\nJoin me for some fun reviewing the latest happenings around the country in our Justice System. This is a new interactive daily live show for true crime lovers and justice watchers alike. After the gavel sounds and court adjourns we will be hanging out talking about the day. We will watch videos, review documents, conduct interviews and discuss all things related to watching the Justice System Work. Come ready with your thoughts, opinions, and ideas. Hope to see you at the live!!!\n\nAbout This Channel\n\nHello To All And Welcome To My Channel. This Channel covers trials and criminal cases that are in the media. Justice is often looked at as an outcome. This is because the media and lawyers focus on Justice for the self serving purposes that apply to their interests. However. Justice is the process and it’s actually what makes our country the greatest on earth. We will be approaching cases from that perspective and looking at the process not the outcome to determine if justice has been served. My father was a renowned criminal defense attorney so I spent my childhood working in his law office and seeing the perspective of a defense attorney. I also got to see the justice system from the perspective of a family member of a criminal defendant as well. I have served on a jury (as foreperson) and have watched court for most of my life. It is through these experiences I bring a unique perspective to criminal cases and will share my thoughts and analysis on this channel!\n\n#justice #trials #crime \n\nYou can contact me at Justiceisaprocess@gmail.com\n\nFeel free to reach out regarding questions about any cases you see. Also if you have a suggestion for a case to cover feel free to send my way. \n\nIf you would Ikie to make a donation of support to the channel do so here: \n\nhttps://cash.app/$Justiceisaprocess\n\nDonations are much appreciated but never ever expected!!\n\nCOPYRIGHT DISCLAIMER UNDER SECTION 107 OF THE COPYRIGHT ACT 1976, ALLOWANCE IS MADE FOR \u0022FAIR USE\u0022 FOR PURPOSES SUCH AS CRITICISM, COMMENT, NEWS REPORTING, TEACHING, SCHOLARSHIP, AND RESEARCH. FAIR USE IS A USE PERMITTED BY COPYRIGHT STATUTE THAT MIGHT OTHERWISE BE INFRINGING. NON-PROFIT, EDUCATIONAL OR PERSONAL USE TIPS THE BALANCE IN FAVOR OF FAIR USE\n\nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UCOyS97z2Kium7iDV6wwctUg/join",
      "release": "2024-11-13T22:00:06Z",
      "duration": "01:31:32",
      "explicit": false,
      "youTubeId": "IVqgIqlOe58",
      "subjects": [
        "Benyamin Ben-Michaeil"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IVqgIqlOe58"
      }
    }
  ]
}