{
  "_ts": 0,
  "id": "8f1f7646-accd-404d-a96b-12ded84834b3",
  "name": "JusticeFor",
  "youTubeChannelId": "UCXShWvmKqkkL2g4vkatOSEg",
  "episodes": [
    {
      "id": "a3489b72-5087-4ed2-abce-9a2cd553683e",
      "title": "A Cult or Divine Intervention? | The Heartbreaking Story of Elizabeth Struhs",
      "description": "January 2022, 8 year old Elizabeth Struhs suffered for 5 days through a 100 percent preventable death. While her Mother and Father, along with members of their cult-like church The Saints, stood by and watched. Join us and Elizabeth\u0027s sister Jayde in fighting for justice for Elizabeth!\n\nDisclaimer \n\nThe views and opinions expressed in this podcast are those of the hosts and do not necessarily reflect the views of any affiliated organizations. All suspects are considered innocent until proven guilty in a court of law. This podcast is intended for informational and entertainment purposes only and should not be considered as legal advice or a substitute for professional consultation.\n\nSins of The Saints: The tragic and short life of Elizabeth Struhs | A Current Affair \n\nParents Sentenced Over Death of Diabetic Daughter They Denied Insulin \n\nElizabeth Struhs\u0027s parents each sentenced to 14 years jail for her manslaughter - ABC News\n\nElizabeth Struhs: Mother, father, other members of fringe group the Saints jailed for girl’s death in Toowoomba\n\n\n\nFollow us @justice for podcast on all platforms for discussion posts and more!\n\nFacebook https://www.facebook.com/profile.php?id=61557246968627\n\nInstagram https://www.instagram.com/justiceforpodcast\n\nigsh=MTQ2ajlzNXI5b2Jjcw%3D%3D\u0026utm_source=qr\n\nTikTok https://www.tiktok.com/@justiceforpodcast?_t=8mHHqktOEEV\u0026_r=1\n\nYouTube https://youtube.com/@justiceforpodcast?si=rI5sP7MltdqZMZuE",
      "release": "2025-05-27T08:00:24Z",
      "duration": "00:46:29",
      "explicit": false,
      "youTubeId": "RPW7jmr6wT8",
      "subjects": [
        "The Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RPW7jmr6wT8"
      }
    }
  ]
}