{
  "id": "1bfb5d1b-e115-4cd8-a39b-460b71ef2a7c",
  "name": "JW Researcher Rose",
  "youTubeChannelId": "UCRKbc7PcKyz350FZHyjjF4A",
  "episodes": [
    {
      "id": "fa74fbf5-1902-46f5-84e9-752a4efddbec",
      "title": "Exposed — Inside: as one of Jehovah’s Witnesses",
      "description": "When belief loosens, the body doesn’t instantly feel safe — it finally responds.\n\nThis video explains why fear, confusion, or physical reactions can surface after belief has already shifted.  As one of Jehovah’s Witnesses, many of us learned to override instinct, doubt our perceptions, and stay aligned in order to feel safe. When that structure loosens, the nervous system doesn’t collapse — it reveals what it was carrying.\n\nThis is not about doctrine being exposed.\n\nIt’s about understanding the human impact, the bodily cost, and why these reactions make sense.\n\nIf you’ve experienced symptoms you couldn’t explain — or you’re trying to understand what leaving a high-control belief system does to a person — this video is meant to give language to that experience.\n\nIf you would like to see more about the internal workings, history and changing doctrines as well as lived experience please make sure to subscribe.\n\nstock footage and image sources\nWatchtower Bible and Tract Society\nPexels\nGoogle images",
      "release": "2026-01-29T19:30:08Z",
      "duration": "00:18:21",
      "explicit": false,
      "youTubeId": "LOYkt8NjGnU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LOYkt8NjGnU"
      }
    },
    {
      "id": "ab715992-cc48-41df-9dbb-d6ae1df34015",
      "title": "The Hidden Rulebook Jehovah’s Witnesses Are Judged By",
      "description": "Jehovah’s Witnesses are judged by a rulebook most members are never allowed to see.\n\nIn this video we examine Shepherd the Flock of God—the elders’ manual that governs discipline, repentance, apostasy, and family separation—using the organization’s own publications and procedures.\n\nMost Witnesses are taught that decisions about disfellowshipping, repentance, and spiritual standing come directly from the Bible. But the reality is more complex. This manual outlines internal rules, definitions, and judicial processes that ordinary members are never shown, even though they are held accountable to them—often for life-altering consequences.\n\nIn this video, we look at:\nhow discipline is defined and enforced\nwhy baptism binds members to unseen rules\nhow apostasy is classified\nwhere mental health and sexuality are addressed\nand how internal policy can outweigh scripture in practice\n\nThis is not an attack on individual believers. It’s an examination of systems, authority, and transparency—using Watchtower’s own material.\n\nIf you were one of Jehovah’s Witnesses, or are questioning now, you’re not alone.\n\nTake your time. Watch at your own pace.\n💬 What stood out to you most?\n\nJehovah\u0027s Witnesses video and images - Watchtower Bible and Tract Society\nGoogle images",
      "release": "2026-01-05T17:01:04Z",
      "duration": "00:12:41",
      "explicit": false,
      "youTubeId": "_HWj3gglaYw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_HWj3gglaYw"
      }
    },
    {
      "id": "ac3f9380-3e8c-4671-9972-4e54cb27809d",
      "title": "The Hidden Pressure Behind the JW “Bloodless” Medical Care",
      "description": "The pressure Jehovah’s Witness families face in hospitals is far greater than most people realize — and recently, my husband and I experienced it firsthand.\n\nJehovah’s Witness Hospital Liaison Committees (HLCs) are supposed to “support” members with medical decisions… but what actually happens behind the scenes often feels very different. In this video, I walk you through what we just went through during my husband’s surgery prep, how quickly the “bloodless” expectations kicked in, and the kind of emotional, spiritual, and social pressure that comes with it.\n\nAs a former JW raised to believe bloodless care was the only faithful option, I know exactly how the fear, guilt, and organizational loyalty shape a person’s choices — especially when their health or their life is on the line. Today, I’m sharing both the research and the lived reality.\n\nIn this video, we’ll cover:\n• How JW Hospital Liaisons approach families\n• The subtle and not-so-subtle pressure to agree to “bloodless” care\n• Why many Witnesses feel they have no real choice\n• How high-control groups influence medical decision-making\n• What my husband and I experienced this week\n• Why informed consent becomes complicated inside the organization\n\nIf you’ve ever wondered what really happens in these situations — or if you’ve been through something similar — you’re not alone. Your experiences matter, and your voice deserves to be heard.\n\nIf this video helps you, please like, share, and subscribe. And tell me your story in the comments — I read every one.\n— Rose\nBeyond Watchtower with Rose",
      "release": "2025-12-07T14:45:01Z",
      "duration": "00:10:20",
      "explicit": false,
      "youTubeId": "-Up1vXU_5xU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-Up1vXU_5xU"
      }
    },
    {
      "id": "dd62ecec-4642-42b7-8473-4fea67bc62b0",
      "title": "Why My Jehovah’s Witness Family Is Shunning Me | What Led to This Moment",
      "description": "If you’re searching for real experiences of Jehovah’s Witnesses shunning or why JW families cut off loved ones, this is my personal story of what led to my family shunning me.\n\nFamily shunning is one of the most painful experiences anyone can go through — and for many former Jehovah’s Witnesses or people leaving high-control groups, it’s heartbreakingly common.\n\nIn this video, I share why my Witness family is shunning me, what led up to this moment, and how I’m learning to process and heal from it. My hope is that by opening up about my story, others who are experiencing religious shunning, family cut-offs, or conditional love will feel a little less alone.\n\n🌼 Topics in this video:\n• Why my JW family is shunning me\n• What led up to the family shunning\n• Emotional impact of religious shunning\n• How shunning affects families and relationships\n• Healing after being cut off\n• My personal journey beyond the Watchtower\n\nIf you’ve experienced Jehovah’s Witness shunning, religious shunning, family estrangement, or pressure to cut off a loved one, I hope this video helps you feel understood and supported.\n\n💛 You’re always welcome here.\nThank you for being part of this community, for sharing your experiences, and for walking this path with me. Your stories matter so much.\n\n— Rose\nBeyond Watchtower with Rose ~ formerly JW Researcher Rose\n\nNIMH-  National Institute of Mental Health\nIrene’s Entropy - https://www.youtube.com/watch?v=Nb3NJR664Sc\u0026list=RDNb3NJR664Sc\u0026start_radio=1\n\nVideo and Image sources - Pexels\nMe",
      "release": "2025-11-23T18:34:05Z",
      "duration": "00:20:40",
      "explicit": false,
      "youTubeId": "K_66Ve1OqsM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K_66Ve1OqsM"
      }
    },
    {
      "id": "0f689820-cb06-4bc7-9752-fa68ab307ddf",
      "title": "When the Watchtower Quoted Johannes Greber’s Spiritist Bible",
      "description": "Formerly JW Researcher Rose, in this video I uncover who Johannes Greber was — and how his Bible translation, connected to spiritism, was actually referenced in multiple Watchtower publications and even influenced parts of the New World Translation.\n\nThrough documented evidence from Watchtower publications and correspondence, I show how Greber’s Bible translation was cited multiple times, even in explaining verses central to the New World Translation.  Main verses like John 1:1 and Matt 27:52-54\n\nThis video explores how that connection was later quietly removed, what it reveals \nabout source vetting inside the organization, and what this means for those who trusted the Watchtower’s scholarship.\n\n🔍 All references shown in this video come directly from Watchtower publications and historical archives.\n💬 I encourage you to comment below with your thoughts — or any references you’ve found related to this topic.\n\n\nAs someone who spent decades inside the organization, learning this shocked me — and it may surprise you too.\n\n🔔 Subscribe for more historical and personal insights into the Watchtower Bible and Tract Society.\n\n🎧 Watch More Research:\n👉https://www.youtube.com/playlist?list=PL7y1oPawaRY9aR2y-MHhB3KsLgb-reYId",
      "release": "2025-11-03T19:30:01Z",
      "duration": "00:12:49",
      "explicit": false,
      "youTubeId": "BrWQzoA4daI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BrWQzoA4daI"
      }
    },
    {
      "id": "873039d0-64c1-4f6b-a4d2-c2adf4e702d8",
      "title": "Is Watchtower Finally Softening on Shunning?",
      "description": "For decades, shunning has been one of the most painful and defining parts of life inside the Watchtower organization. Families torn apart. Friends lost overnight. Many of us know that pain firsthand.\nBut lately… something feels different. I’ve noticed subtle changes — not just in wording, but in tone and attitude — that suggest Watchtower may be quietly softening its stance on shunning.\nIn this video I have a conversation with my husband, I’ll share what we’ve observed, compare it to past teachings, and explain what this could mean for those still inside and those who’ve left.\nIf you’ve ever been affected by shunning, or if you’re just trying to understand what’s really happening, I hope this helps you see the bigger picture.\n\n🌹 Please like, comment, and subscribe to help this reach others who might need it.Your story matters, and you’re not alone.\n\nVideo clips and image sources\nPexels\nAI\nWatchtower publications at jw.org  If publication has been removed from that website please see  https://jws-library.one\nMe",
      "release": "2025-10-13T18:30:38Z",
      "duration": "00:14:27",
      "explicit": false,
      "youTubeId": "X-eAluJh_wY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=X-eAluJh_wY"
      }
    },
    {
      "id": "203b8a46-5c59-4453-8bfb-ce0e18ae3a97",
      "title": "Ex-JW Explains: Is Jehovah Really God’s Name",
      "description": "Jehovah’s Witnesses build their entire identity around the name Jehovah. But is it really God’s personal name — or is there more to the story than we were taught?\n\nIn this video, Beyond Watchtower with Rose (formerly JW Researcher Rose), I’ll walk you through:\nWhat the Bible actually says about God’s name (YHWH / the Tetragrammaton)\nWhy Jews stopped saying it out loud and used “Adonai” instead\nHow the name Jehovah came centuries later by mistake\nWhat Jesus emphasized when he prayed, “Hallowed be your name”\nWhy “hallowed” and “sanctified” aren’t the same\nWhy it’s vital to look outside the Watchtower when researching truth\n📖 Psalm 9:10 — “Those who know your name trust in you.”\n✨ Whether you’re still in, just waking up, or long out — this history matters.\nIf this video helps you, please like, share, and subscribe. And tell me your story in the comments — I’d love to hear how you learned about the history of God’s name.\n\nWatchtower video source - JW organization\u0027s website",
      "release": "2025-10-02T18:30:09Z",
      "duration": "00:12:29",
      "explicit": false,
      "youTubeId": "3LSC_usMGt4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3LSC_usMGt4"
      }
    },
    {
      "id": "d3f8abd3-b232-4b7f-9987-2d703fea76e4",
      "title": "Who Is Our Mediator? — What the Bible Really Says (Ex-JW Perspective)",
      "description": "Rose here. In this video I dive into a simple but powerful question: who is our mediator?  As one of Jehovah\u0027s Witnesses who are we taught is our mediator?  Who do we go through so Jehovah will hear our prayers — and what does the Bible actually say about it? \n\nI compare translations, quote key scriptures (1 Timothy 2:5, John 14:6, Hebrews, Acts), and look at the Watchtower’s teaching that Jesus is only the mediator for the anointed. Then I ask the obvious question: does that line up with Scripture?\n\n What you’ll find in this video:\n• A plain-English definition of “mediator”\n• Side-by-side verses from different translations (NIV, KJV, NWT)\n• Why Jesus being “the way” matters for everyone — not just a select few\n• A look at Matthew 24:4–5 and why claiming to speak for Jesus is problematic\n• My conclusion from Bible passages and what that means for you\n\n(Stay to the end to hear a short comment from a man defending the men in New York)\n\n💬 I want to hear from you — tell me what you think in the comments. Did the Bible convince you that Jesus is the one mediator for everyone? How did you interpret these verses when you were in?\n👍 If this helped you, please Like, Subscribe, and Share — algorithms matter.\n🛎️ Want more? Subscribe for more content from JW Researcher Rose.\n\nImage and video sources:\nhttps://biblehub.com\nPexels\nJW website\nGoogle images\nMe",
      "release": "2025-09-22T17:51:48Z",
      "duration": "00:10:15",
      "explicit": false,
      "youTubeId": "ray05BgmMHU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ray05BgmMHU"
      }
    },
    {
      "id": "6f11c78b-68ba-46d4-b6f1-5636a8365dae",
      "title": "The Cost of Leaving: Shunning \u0026 Isolation After Jehovah’s Witnesses",
      "description": "Leaving Jehovah’s Witnesses doesn’t just mean walking away from an organization—it often means losing your entire community, family, and sense of belonging. This video explores the pain of shunning and isolation, what many call a “social death.”\n\nI’ll share how it feels to sit alone after losing those closest to you, and why the cost of leaving can be so high. My hope is that by speaking openly, others who are going through this will know they’re not alone.\n\nIf you’re an ex-JW, someone questioning, or just curious about what life after leaving is really like, this video is for you.\n\n🔔 Subscribe to JW Researcher Rose for more honest conversations about the history of Watchtower and life after leaving.\n\n💬 Please share your own experience in the comments—I’d love to hear from you.\n\nImage and video sources\nPexels\nGoogle images\nJW org website\nme",
      "release": "2025-09-16T18:31:14Z",
      "duration": "00:10:33",
      "explicit": false,
      "youTubeId": "scbuku9Wk_8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=scbuku9Wk_8"
      }
    },
    {
      "id": "dbc258ad-f194-4744-b02a-3ffc5fac315f",
      "title": "Elders daughter-Pioneer-Elders Wife and \u0026quot;Need Greater\u0026quot; -  Chap three",
      "description": "I was born into the Watchtower organization.  I\u0027m a fourth generation Witness, my husband is a fifth generation.  The stories our relatives have told us about this organization goes back to the turn of the 20th century.  I was an elder\u0027s daughter a pioneer and elder\u0027s wife and I raised my children as Jehovah\u0027s Witnesses. I have also worked \u0022where the need is great\u0022 territory. My parents met while working at Bethel in 1959 under Nathan Knorr the third president and Faithful Slave of the Watchtower organization.  My mother-n-law\u0027s dad was a bodyguard for Rutherford\n\nThis is the story of my life\n\nVideo footage  and image sources\nWatchtower Bible and Tract Society\nPexels\nGoogle\nMy family",
      "release": "2025-03-06T19:00:19Z",
      "duration": "00:32:03",
      "explicit": false,
      "youTubeId": "HZim9LF8Cr0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HZim9LF8Cr0"
      }
    },
    {
      "id": "72c4f27f-dd40-49a9-a611-29f0ef7de089",
      "title": "Elders daughter-Pioneer-Elders Wife and \u0026quot;Need Greater\u0026quot; -  Chap two",
      "description": "I was born into the Watchtower organization.  I\u0027m a fourth generation Witness, my husband is a fifth generation.  The stories our relatives have told us about this organization goes back to the turn of the 20th century.  I was an elder\u0027s daughter a pioneer and elder\u0027s wife and I raised my children as Jehovah\u0027s Witnesses. I have also worked \u0022where the need is great\u0022 territory. My parents met while working at Bethel in 1959 under Nathan Knorr the third president and Faithful Slave of the Watchtower organization.  My mother-n-law\u0027s dad was a bodyguard for Rutherford\n\nThis is the story of my life\n\nVideo footage  and image sources\nWatchtower Bible and Tract Society\nPexels\nGoogle\nMy family",
      "release": "2025-02-27T19:00:19Z",
      "duration": "00:36:16",
      "explicit": false,
      "youTubeId": "VH8Y68Ak44k",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VH8Y68Ak44k"
      }
    },
    {
      "id": "4c6e15d5-3008-46d5-b287-8a658e418640",
      "title": "Elders daughter-Pioneer-Elders Wife and \u0022Need Greater\u0022 -  Chap One",
      "description": "I was born into the Watchtower organization.  I\u0027m a fourth generation Witness, my husband is a fifth generation.  The stories our relatives have told us about this organization goes back to the turn of the 20th century.  I was an elder\u0027s daughter a pioneer and elder\u0027s wife and I raised my children as Jehovah\u0027s Witnesses. I have also worked \u0022where the need is great\u0022 territory. My parents met while working at Bethel in 1959 under Nathan Knorr the third president and Faithful Slave of the Watchtower organization.  My mother-n-law\u0027s dad was a bodyguard for Rutherford\n\nThis is the story of my life\n\nVideo footage sources\nWatchtower Bible and Tract Society\nPexels",
      "release": "2025-02-20T19:15:00Z",
      "duration": "00:25:49",
      "explicit": false,
      "youTubeId": "B4mmhZkntTE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=B4mmhZkntTE"
      }
    },
    {
      "id": "6b5248e2-9f7c-4170-98f9-cad42e04605a",
      "title": "The many changes to Jehovah\u0026#39;s Witnesses baptismal questions",
      "description": "The organization has gone through many changes since 1913.  Find out what they were and how they now affect Witnesses lives in this video",
      "release": "2025-02-13T19:00:39Z",
      "duration": "00:10:46",
      "explicit": false,
      "youTubeId": "uLqCBufRfFs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uLqCBufRfFs"
      }
    },
    {
      "id": "00f10ef3-e217-4794-8ebf-82222dbd8cb2",
      "title": "Jehovah\u0026#39;s Witnesses- Beth Sarim-Rutherford and Mary",
      "description": "Have you ever heard of Beth Sarim or Mary Rutherford?  How about Berta Peale? Find out who they were and how they are connected to Beth Sarim this video.\n\n\n\n\nWe left Jehovah\u0027s Witnesses (circa 1976) -  Edmund Gruss\nVisions of Glory - Barbara G Harrisun\n30 years a Watchtower Slave - William Schnell\nCrisis of Conscience - Raymond Franz\nFaith on the March - A.H. Macmillan \nRutherford’s Coup - Rudd Persson\nJehovah\u0027s Witnesses and the Third Reich - James Benton\n\nTime magazine - @WatchtowerHistory \nJW.org",
      "release": "2024-12-18T20:00:11Z",
      "duration": "00:30:06",
      "explicit": false,
      "youTubeId": "OPpmkrTWQTQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OPpmkrTWQTQ"
      }
    },
    {
      "id": "cf4ab460-998a-4426-9e00-b3e338cf0b67",
      "title": "The effects of shunning as one of Jehovah\u0026#39;s Witnesses",
      "description": "Jehovah\u0027s Witnesses have had many titles when it comes to shunning.  Disfellowshipped, no longer one of Jehovah\u0027s Witnesses or removed from the Christian congregation.  Whatever it\u0027s called this is how shunning makes you feel as one of Jehovah\u0027s Witnesses.  From my personal experience \n\nVideo sources:\nJW.org\n@pexel",
      "release": "2024-12-04T19:30:08Z",
      "duration": "00:09:31",
      "explicit": false,
      "youTubeId": "tYL3vrI3Q4A",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tYL3vrI3Q4A"
      }
    },
    {
      "id": "9c32b510-893d-4c59-9bd4-55784c01792a",
      "title": "Jehovah\u0026#39;s Witnesses do they have the true religion?",
      "description": "What makes a true religion?  What did Jesus say?  Find out in this video",
      "release": "2024-11-18T14:00:20Z",
      "duration": "00:11:57",
      "explicit": false,
      "youTubeId": "BYoXt9Abjz8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BYoXt9Abjz8"
      }
    },
    {
      "id": "87ae0de8-e76c-4d06-99c5-e6907e2d1d8d",
      "title": "Jehovah\u0027s Witness elders.  Appointed by Holy Spirit or not?",
      "description": "Are elders truly the spiritual heads in the congregation as intended in the Bible?  Find out in this video\n\nDebutante - Award-Winning Short Film (2021) -  https://www.youtube.com/watch?v=nDApJdZJ0ss\u0026t=779s\n\nOther video footage found at JW.org\nOlder publications not found on the JW.org website can be found at\njws-library.one",
      "release": "2024-10-28T18:08:18Z",
      "duration": "00:23:57",
      "explicit": false,
      "youTubeId": "H9Y10taKICQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=H9Y10taKICQ"
      }
    },
    {
      "id": "d686f77a-5b3c-499c-8cd8-e32599c12c63",
      "title": "The Judge and the changes he made Watchtower make",
      "description": "Rutherford worked his way in, then took over the Watchtower organization.  He ignored Russell\u0027s Will and did whatever he wanted to do.  \n\nWhich ended up getting him and a bunch of other people arrested.  So what else did Rutherford do and change.  I hope you enjoy the video.  Please comment and give me your feedback.\n\nImage sources\n@JWStruggle \njwfacts.com\nJW.org\n\nWatchtower publication sources:\nMillions Now Living Will Never Die\nProclaimers of God\u0027s Kingdom\nVindication",
      "release": "2024-10-02T13:00:29Z",
      "duration": "00:24:53",
      "explicit": false,
      "youTubeId": "HG-_ZBy4304",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HG-_ZBy4304"
      }
    },
    {
      "id": "2f70d1fd-be54-4201-aef1-6e49fba20dbf",
      "title": "Joseph Rutherford gets himself and Witnesses arrested",
      "description": "The first thing Joseph Rutherford did after taking over the Watchtower organization is publish a book that get\u0027s both himself and many Witnesses of the time arrested.  I hope you enjoy the video",
      "release": "2024-09-19T13:30:11Z",
      "duration": "00:17:36",
      "explicit": false,
      "youTubeId": "NKLzyPzpgNk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NKLzyPzpgNk"
      }
    },
    {
      "id": "0a3d7c72-a2cb-429e-8489-4369b1cef7d5",
      "title": "How do the Governing Body of Jehovah\u0026#39;s Witnesses act as a channel?",
      "description": "The Governing Body state they are God\u0027s channel.  So how exactly do they get their new information to share with all of mankind today? \n\nWhat does it mean to be a channel for God?\n\n Tell me what you think in the comments\n\n\nImage sources jw.org\nVideo on the organization using the Spiritist Johannes Greber:\nhttps://youtu.be/JTsBvdbdPcs",
      "release": "2024-09-11T13:20:00Z",
      "duration": "00:12:03",
      "explicit": false,
      "youTubeId": "acuMTKpsz_s",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=acuMTKpsz_s"
      }
    },
    {
      "id": "35bf1cf1-453e-407d-86dd-8274e61a2ebb",
      "title": "Watchtower I\u0026#39;m a little upset right now.  Here\u0026#39;s why",
      "description": "This video may be triggering.  I\u0027m truly sorry if it is but it\u0027s something that needs to be made known.  If you find anything incorrect in this video, please let me know in the comments.\n\nI was a victim of child sexual abuse.  I never could do anything about it.  Until now\n\nvideo sources\njw.org\n@pexel",
      "release": "2024-08-20T16:15:02Z",
      "duration": "00:17:19",
      "explicit": false,
      "youTubeId": "gkpTIhVcarA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gkpTIhVcarA"
      }
    },
    {
      "id": "d4a74122-6289-4cba-b22f-1fa02a1e1533",
      "title": "Rutherford lies to legalize his complete control over Watchtower",
      "description": "Find out how Joseph Rutherford illegally took complete control over the Watchtower organization in 1917.  Once he became the President he then also becomes the Faithful Slave, leader of the Bible Students who became known as Jehovah\u0027s Witnesses under his presidency \n\nOnce Joseph Rutherford became the President of the Watchtower Bible and Tract Society he completely changed things.  From how the business was ran to the many doctrinal changes Jehovah\u0027s Witnesses now believe as Bible truths from God. \n\nI hope you enjoy the video.\n\nI was born and raised as one of Jehovah\u0027s Witnesses.  My parents met while serving under Nathan Knorr in the late 50\u0027s through the mid 60\u0027s.   They knew four of the seven people that were in prison with Rutherford in 1918.  But the history they were told had been whitewashed.  That\u0027s the history I grew up listening to.  Maybe that\u0027s the reason I\u0027m so fascinated in the real history of the organization and Jehovah\u0027s Witnesses.   Because it\u0027s so different from the organizations white washed version.\n\n\nPersons mentioned in this video:\nCharles T Russell - Founder and President of the WTBS and People\u0027s Pulpit Assoc., as well as leader of the Bible Students \nJoseph Rutherford - Society/Organizations attorney and People\u0027s Pulpit Assoc. Board member \nAlexander MacMillan - Brooklyn Bethel member\nPaul Johnson - Bible Student\nAlfred Ritchie - Vice President and board member Peoples Pulpit Assoc.\nWilliam Van Amburgh - Secretary/Treasurer board member Peoples \nFrancis McGee assistant to the Attorney General in Pittsburgh\n\nSources\nWatchtower Bible and Tract Society publications:\nJehovah\u0027s Witnesses - Proclaimers of God\u0027s Kingdom\n1973, 1975, 1979 , 2017 Yearbooks\nThe Watch Tower - Dec 1916\nJehovah’s Witnesses in the Divine Purpose\n****  Please note: If you are unable to find the publications on the JW website or obtain a personal copy please go to this website:  https://jws-library.one\n\nEpiphany Studies in the Scriptures, vol.10 - Paul Johnson\nLight after Darkness a Message to the Watchers, Being a refutation of “Harvest Siftings” -  J.D. Wright, A.I. Richie, I.F. Hoskins and R.H. Hirsh\nHarvest Siftings - Joseph Rutherford\nHarvest Siftings Reviewed - Paul Johnson\nHarvest Siftings II - Joseph Rutherford\nAnother Harvest Siftings Reviewed - Paul Johnson\n30 years a Watchtower Slave - William Schnell\nFaith on the March - A.H. Macmillan \nCrisis of Conscience - Raymond Franz\nRutherford’s Coup - Rud Persson\nhttp://jwdivorces.bravehost.com/rutherford.html\n\nStock footage credit - @Pexels.com\nImages - WBTS  JW.org",
      "release": "2024-08-05T14:00:32Z",
      "duration": "00:25:47",
      "explicit": false,
      "youTubeId": "VH54rvHdBqo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VH54rvHdBqo"
      }
    },
    {
      "id": "cfee1621-873e-494b-858b-e6717363bad5",
      "title": "What does it mean to \u0022wake up\u0022 as one of Jehovah\u0027s Witnesses?",
      "description": "What it means to acknowledge your Cognitive Dissonance, actually look at both sides of a debate and then be willing to deconstruct anything that proves to not be factual.  As one of Jehovah\u0027s Witnesses\n\nHelp for waking up and fading - https://jw.support\nHelp with reclaiming yourself - https://www.reclamationcollective.com\nAll older publication hidden and erased - https://jws-library.one\nIf you like a good read on everything Watchtower - https://jwfacts.com\nIf you want to know what changes they have made over 150 years - \nhttps://www.youtube.com/playlist?list=PL7y1oPawaRY8VVtgu8g_lnmn8MWoVFCik\n\nAll stock footage credit -  @pexels\nImages JW.org",
      "release": "2024-07-26T22:00:22Z",
      "duration": "00:22:53",
      "explicit": false,
      "youTubeId": "dQqo-RwHzmo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dQqo-RwHzmo"
      }
    },
    {
      "id": "52978d41-3c47-4767-b2aa-7c8761b61258",
      "title": "Another conversation w/former elder and CSA whistleblower Ed Narayan",
      "description": "Ed helped expose the child sexual abuse within the organization in the New Zealand Royal Commission.  Listen as we now talk about meetings, the ongoing child sexual abuse within the organization, the Bible and God.\n\nThanks my new friend.\n\nEd sent me the final report that came out of the Royal Commission and how the organization tried to fight it being made public as they were included\nhttps://www.abuseincare.org.nz/reports/whanaketia\nhttps://www.courtsofnz.govt.nz/assets/cases/2024/2024-NZCA-340.pdf\n\nMy conversation with Ed regarding the New Zealand Royal Commission\nhttps://youtu.be/pcxKWOytlgY",
      "release": "2024-07-22T13:00:06Z",
      "duration": "01:17:12",
      "explicit": false,
      "youTubeId": "4t63cszlZLI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4t63cszlZLI"
      }
    },
    {
      "id": "b57dda64-c654-4d63-ae2a-e8a261d59429",
      "title": "The reason Jehovah\u0027s Witnesses insist on 607 BCE and not 587",
      "description": "607 BCE and 1914 are foundational dates for the Watchtower organization.  They state that bible chronology from 607 leads to 1914.  When they claim Jesus was enthroned, only invisibly.  But what happens if that date is wrong?\n\n\nJeremiah Films - Witnesses of Jehovah 1986:  https://youtu.be/oYZ8mt3mk40?si=zulk1WnUzryXdYMV",
      "release": "2024-07-12T16:00:28Z",
      "duration": "00:12:53",
      "explicit": false,
      "youTubeId": "N-qRsN2mKOI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=N-qRsN2mKOI"
      }
    },
    {
      "id": "944ef095-be79-4ee7-a746-9cb6d14b4488",
      "title": "Oh the changes I have seen - my unrehearsed random thoughts",
      "description": "Thinking back, I’ve seen constant changes.  Why does truth keep changing?\n\n\nGoverning Body roles through the years - https://youtu.be/ozzcbFAxmis\nWatchtower’s history on donations throughout the years - https://youtu.be/4I1QG0sPJQQ\nThe 1914 teaching throughout the years  - https://youtu.be/4GKfuTYWEKo\nThe publications changes throughout the years - https://youtu.be/achfG2ALZWI\nWatchtowers history on receiving a blood transfusion - https://youtu.be/achfG2ALZWI\nWhen the organization decided to change who Gog of Magog was - https://youtu.be/_TL9gO0MCHY\n\nSupport while waking up - https://jw.support\nHelp coping -  https://www.reclamationcollective.com\n\nAll stock footage credit - Pexels.com",
      "release": "2024-07-08T14:11:45Z",
      "duration": "00:17:10",
      "explicit": false,
      "youTubeId": "AKSNXEOxqNU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AKSNXEOxqNU"
      }
    },
    {
      "id": "bbe0647f-f6eb-45af-97b1-31d7630a259e",
      "title": "Response to the defense in courts around the world on SHUNNING",
      "description": "Jehovah\u0027s Witnesses have been in multiple courts around the world defending their unbiblical stance on shunning.  Disfellowshipping.  Removing someone from the congregation.\n\nHere is my response to their defense that this does not affect normal family relations.  I have included videos and publications.\n\nWhen it looks like shunning, feels like shunning, and it sounds like shunning - it\u0027s shunning.  No matter what it\u0027s called.  Plain and simple.  So why does the organization keep denying it\u0027s shunning?\n\nStock footage credit:  Pexels.com\nPublications and JW videos - jw.org",
      "release": "2024-07-05T12:01:05Z",
      "duration": "00:16:00",
      "explicit": false,
      "youTubeId": "v6bTwGZjKp4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=v6bTwGZjKp4"
      }
    },
    {
      "id": "46a0b71a-9192-4f0d-b93f-421c727a5418",
      "title": "Ruby was baptized at ten.  Shunned by 16.  Here is her story",
      "description": "If you need help or support  here are two resources for you 🌹\nhttps://jw.support\nhttps://www.reclamationcollective.com\n\nRuby was kind enough to share her life growing up with a single mom as one of Jehovah\u0027s Witnesses.  The struggles she started having at a very early age, the trouble she found herself in at 15 and how it was handled by the elders.  The troubles she had with her family and the impact that had on her mental health.\n\nIf you\u0027re able to, please make sure to thank Ruby for sharing her story.  Thanks!\n\n\n\nStock footage -@pexels\nCaleb and Sophia footage and images - JW.org\nRuby Tavares On YouTube @NewyorkerRican",
      "release": "2024-06-28T16:00:49Z",
      "duration": "01:25:16",
      "explicit": false,
      "youTubeId": "uXoabB2F0QE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uXoabB2F0QE"
      }
    },
    {
      "id": "93a765b0-bdbf-469a-9abb-37a21de9c8fd",
      "title": "How Joseph Rutherford lied to become President of Watchtower",
      "description": "Find out exactly how Rutherford lies to become the President of the Watchtower Bible and Tract Society.  Once President he then becomes the Faithful Slave, leader of the Bible Students who became known as Jehovah\u0027s Witnesses under his presidency \n\nOnce Joseph Rutherford became the President of the Watchtower Bible and Tract Society he completely changed things.  From how the business was ran to the many doctrinal changes Jehovah\u0027s Witnesses now believe as Bible truths from God. \n\nI hope you enjoy the video.\n\nI was born and raised as one of Jehovah\u0027s Witnesses.  My parents met while serving under Nathan Knorr in the late 50\u0027s through the mid 60\u0027s.   They knew four of the seven people that were in prison with Rutherford in 1918.  But the history they were told had been whitewashed.  That\u0027s the history I grew up listening to.  Maybe that\u0027s the reason I\u0027m so fascinated in the real history of the organization and Jehovah\u0027s Witnesses.   Because it\u0027s so different from the organizations white washed version.\n\n\nPersons mentioned in this video:\nCharles T Russell - Founder and President of the WTBS and People\u0027s Pulpit Assoc., as well as leader of the Bible Students \nJoseph Rutherford - Society/Organizations attorney and People\u0027s Pulpit Assoc. Board member \nAlexander MacMillan - Brooklyn Bethel member\nPaul Johnson - Bible Student\nAlfred Ritchie - Vice President and board member Peoples Pulpit Assoc.\nWilliam Van Amburgh - Secretary/Treasurer board member Peoples Pulpit/WTBS\nAndrew Pierson - Board member  WTBS\nIsaac Hoskins - WTBS and Peoples Pulpit Assoc. Board member\nRobert Hirsh - Peoples Pulpit Assoc. Board member\nEdward Brenneison - Board member WTBS\nJames Wright - Board member WTBS\nHenry Rockwell - WTBS and Peoples Pulpit Assoc. Board member \n\nSources\nWatchtower Bible and Tract Society publications:\nJehovah\u0027s Witnesses - Proclaimers of God\u0027s Kingdom\n1973, 1975, 1979 , 2017 Yearbooks\nThe Watch Tower - Dec 1916\nJehovah’s Witnesses in the Divine Purpose\n****  Please note: If you are unable to find the publications on the JW website or obtain a personal copy please go to this website:  https://jws-library.one\n\n\nEpiphany Studies in the Scriptures, vol.10 - Paul Johnson\nLight after Darkness a Message to the Watchers, Being a refutation of “Harvest Siftings” -  J.D. Wright, A.I. Richie, I.F. Hoskins and R.H. Hirsh\nHarvest Siftings - Joseph Rutherford\nHarvest Siftings Reviewed - Paul Johnson\nHarvest Siftings II - Joseph Rutherford\nAnother Harvest Siftings Reviewed - Paul Johnson\n30 years a Watchtower Slave - William Schnell\nFaith on the March - A.H. Macmillan \nCrisis of Conscience - Raymond Franz\nRutherford’s Coup - Rud Persson\n\nStock footage credit\nJW.org\nPexels.com",
      "release": "2024-06-07T19:00:00Z",
      "duration": "00:27:03",
      "explicit": false,
      "youTubeId": "aUBz1kLFfzg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aUBz1kLFfzg"
      }
    },
    {
      "id": "dce0e9e8-01ea-4557-a868-93fdb92b3873",
      "title": "Paul Johnson.  Why did Joseph Rutherford want him gone?",
      "description": "Did Joseph Rutherford undermine Paul Johnson to become the President and Faithful Slave of the Watchtower organization in 1916/1917?  Why would Rutherford do something like that to a fellow brother and the one he went to for Bible answers.  If Rutherford did undermine Johnson, how did Rutherford do it?  Who was Paul Johnson?\n\nFind out in this video.  I hope you enjoy it.\n\nI was born and raised as one of Jehovah\u0027s Witnesses.  My parents met while serving under Nathan Knorr in the late 50\u0027s through the mid 60\u0027s.   They knew four of the seven people that were in prison with Rutherford in 1918.  But the history they were told had been whitewashed.  That\u0027s the history I grew up listening to.  Maybe that\u0027s the reason I\u0027m so fascinated in the real history of the organization and Jehovah\u0027s Witnesses.   Because it\u0027s so different from the organizations white washed version.\n\n\nPersons mentioned in this video\n\nPaul Johnson - Charles Russell’s right hand man and confident\nAlfred Ritchie - Vice President and board member WTBS\nWilliam Van Amburgh - Secretary/Treasurer board member WTBS\nAndrew Pierson - Board member  WTBS\nJoseph Rutherford - Society/Organizations attorney and board member WTBS\nJesse Hemmrey - Board member and chairman for IBSA London Branch\nHenry Shearn - Elder manager and Secretary IBSA London Branch\nWilliam Crawford - Elder manager and Treasurer IBSA London Branch\n\nSources\nWatchtower Bible and Tract Society publications:\nJehovah\u0027s Witnesses - Proclaimers of God\u0027s Kingdom\n1973, 1975, 1979 , 2017 Yearbooks\nJehovah’s Witnesses in the Divine Purpose\n****  Please note: If you are unable to find the publications on the JW website or obtain a personal copy please go to this website:  https://jws-library.one\n\n30 years a Watchtower Slave - William Schnell\nEpiphany Studies in the Scriptures, vol.10 - Paul Johnson\nA Conspiracy Exposed 1894 - Charles Russell\nHarvest Siftings - Joseph Rutherford\nHarvest Siftings Reviewed - Paul Johnson\nHarvest Siftings II - Joseph Rutherford\nAnother Harvest Siftings Reviewed - Paul Johnson\nCrisis of Conscience - Raymond Franz\nFaith on the March - A.H. Macmillan \nRutherford’s Coup - Rud Persson",
      "release": "2024-05-28T14:00:18Z",
      "duration": "00:44:03",
      "explicit": false,
      "youTubeId": "NkZZz3GKinQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NkZZz3GKinQ"
      }
    },
    {
      "id": "fc4e6a90-1b0a-4aff-801e-78e3ff57dc86",
      "title": "Who was the man who took over the Watchtower org in 1917?",
      "description": "So far Charles Russell who turned out to be a narcissistic medical quack, fraud, conman, and horrible husband -  passed away.  But before he died, Charles and his attorney Joseph Rutherford moved the Watchtower publishing company from Pennsylvania to Brooklyn, New York.  And that my friends is what we find in this Podcast Video.  Find out why the organization moved to New York and who this self proclaimed \u0022Judge and Faithful Slave\u0022 was.\n\nI hope you catch up and follow along on my journeys through my Podcasts or Videos.\n\nI was born and raised as one of Jehovah\u0027s Witnesses.  My parents met while serving under Nathan Knorr in the late 50\u0027s through the mid 60\u0027s.   They knew four of the seven people that were in prison with Rutherford in 1918.  But the history they were told had been whitewashed.  That\u0027s the history I grew up listening to.  Maybe that\u0027s the reason I\u0027m so fascinated in the real history of the organization and Jehovah\u0027s Witnesses.   Because it\u0027s so different from the organizations white washed version.\n\n\nSources:\n\nWe left Jehovah\u0027s Witnesses (circa 1976) -  Edmund Gruss\nVisions of Glory - Barbara G Harrisun\n30 years a Watchtower Slave - William Schnell\nCrisis of Conscience - Raymond Franz\nFaith on the March - A.H. Macmillan \nRutherford’s Coup - Rudd Persson\nHarvest Siftings - J.F. Rutherford \nHarvest Siftings Reviewed - Paul Johnson\nLight After Darkness - J. F. Rutherford \nAnother Harvest Siftings Reviewed - Paul Johnson\n\nWatchtower Bible and Tract Society publications -  Please note: If you are unable to find the following publications on the JW website or obtain a personal copy please go to this website:  https://jws-library.one\n\nProclaimers Book\nYearbooks -  1973, 1975, 1979 , 2017 \nJehovah’s Witnesses in the Divine Purpose",
      "release": "2024-05-23T16:00:03Z",
      "duration": "00:19:49",
      "explicit": false,
      "youTubeId": "3LpyjtU--Ss",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3LpyjtU--Ss"
      }
    },
    {
      "id": "cd04ed16-eeca-4492-9fef-eb9578273090",
      "title": "How the term “Faithful Slave\u0022 started in 1895",
      "description": "How exactly did the term \u0022Faithful Slave\u0022 for all mankind around the world become the men in New York?  Charles was becoming extremely dogmatic in what and how the Bible Students believed regarding the Bible.  Like the Governing Body have always been with all witnesses around the world. Charles was also caught doing some very questionable, unscrupulous business dealings with the Watchtower funds they received from their members.  Like the organization does with all of the donations they receive today.  So Charles wife had to come up with a solution to make him not look so bad.  And that my friends is how the doctrine and teaching of the \u0022Faithful and Discreet Slave\u0022 came into existence.  You\u0027re just going to have to watch the video to see why and how she did it!  \n\nIt seems arrogant men who want to keep their control like Russell had, have kept what a woman did and claimed to save her husbands reputation and ego.   Why?  To keep that control for themselves for 145 years.  About time they are called out!\n\nI was born and raised as one of Jehovah\u0027s Witnesses.  My parents met while serving under Nathan Knorr in the late 50\u0027s through the mid 60\u0027s.   They knew four of the seven people that were in prison with Rutherford in 1918.  But the history they were told had been whitewashed.  That\u0027s the history I grew up listening to.  Maybe that\u0027s the reason I\u0027m so fascinated in the real history of the organization and Jehovah\u0027s Witnesses.   Because it\u0027s so different from the organizations white washed version.\n\n\nSources:\n\nJohn Jacob Ross:  Some Facts and More Facts About the Self-styled \u0022Pastor\u0022 Charles T. Russell (of Millennial Dawn Fame)\n E.L. Eaton:  The Millennial Dawn Heresy: An Examination of Pastor Charles T. Russell\u0027s Teaching Concerning the Purpose of the Second Advent and the Millennium\nEncyclopedia Britannica\nStudy.com\nCarl Olaf: Sign of the Last Days When\nLink to the Watchtower organizations publications since 1878 - https://jws-library.one\nAll older publications not on the jw website:  https://jws-library.one\n* Bains, David R. \u0022Russell, Charles Taze.\u0022 American National Biography Online. Feb. 2000. 31 Jan. 2007. \nhttp://www.anb.org/articles/08/08-01302.html.\n* \u0022Biography.\u0022 Pastor-Russell.com. 2005. 27 Mar. 2007\nhttp://www.pastor-russell.com/misc/bio.html.\n* \u0022Charles Taze Russell.\u0022 Biographies. Answers Corporation, 2006.Answers.com. 14 Feb. 2007. http://www.answers.com/topic/charles-t-russell.\n* \u0022North Side: Charles Taze Russell.\u0022 Carnegie Library of Pittsburgh. 2007.carnegielibrary.org. 14 Feb. 2007. http://www.clpgh.org/exhibit/neighborhoods/northside/nor_n107.html\n* Penton, M. James. Apocalypse Delayed: The Story of Jehovah\u0027s Witnesses.Toronto: U of Toronto P, 1985.\n* Pike, Royston. Jehovah\u0027s Witnesses: Who They Are, What They Teach, What They Do. London: Watts and Co, 1954.\n* Stevenson, W.C. The Inside Story of Jehovah\u0027s Witnesses. New York City: Hart Publishing Company, Inc., 1967.\n* Swetnam, George. Where else but Pittsburgh! Pittsburgh: David and Warde, Inc., 1958. 14 Feb. 2007. http://www.pastor-russell.com/legacy/webp.pdf.\n* \u0022The Biography of Pastor Russell.\u0022 Zion\u0027s Watch Tower. 1 Dec. 1916. 14 Feb. 2007. http://www.heraldmag.org/olb/contents/history/bio%20ctr.htm.\n* Thomas, Stan. Jehovah\u0027s Witnesses and What They Believe. Grand Rapids, MI: Zondervan Publishing House, 1967.\nhttps://pabook.libraries.psu.edu/literary-cultural-heritage-map-pa/bios/Russell__Charles_Taze\nhttp://jwdivorces.bravehost.com/decisions/ctrdivorce.html\nhttps://ed5015.tripod.com/JwHenningesRoseBall130.html\nhttps://pabook.libraries.psu.edu/literary-cultural-heritage-map-pa/bios/Russell__Charles_Taze\nhttps://www.jehovahs-witness.com/topic/229897/proclaimed-later-rejected-anointed-one-timeline\nhttp://pastorrussell.blogspot.com/2008/07/pastor-russell-was-not-immoral.html\nhttps://ctrussell.wordpress.com/2013/12/04/r-a-s-r/\nhttp://jwdivorces.bravehost.com/decisions/ctrdivorce.html\n\n\nThanks for watching.  Please share if you can",
      "release": "2024-05-14T21:30:00Z",
      "duration": "00:28:25",
      "explicit": false,
      "youTubeId": "2iVDRGIF0ew",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2iVDRGIF0ew"
      }
    },
    {
      "id": "b06b35b1-7e6b-4fb9-9381-9c5a907bee28",
      "title": "The man behind the Watchtower organization",
      "description": "I\u0027m not joking it really is a crazy ride.  It\u0027s amazing to me how alike the beginning of the Mormon religion and Jehovah\u0027s Witnesses are with how they got their start.  One guy could read rocks in a special bucket with something covering his head.  (It really is a great story let me tell you!!  I might have to do a video)  The other guy went around spouting everyone needed to repent because Armageddon was happening anytime and everyone was going to be taken to heaven.  He just couldn\u0027t make up his mind when.  \n\nRussell  worked as a partner with his dad selling mens clothing.  Sold it for a ton of money.   Got all these crazy guys spouting their teachings of that time together, and turned them into his own interpretation.   Then got two friends to put his predictions in their magazines and newspaper.  Nada.  Nothing happened.  But that wasn\u0027t going to stop young Charles T Russell who was determined - I prefer to say arrogant - to come up with his own explanations of what HE believed and his interpretations.  It didn\u0027t matter if they were true or not.  So he started a magazine to spout them.\n\nThe Mormon religion started with a poor farm boy in upstate New York.  He was determined to take his personal writings that were written under extremely questionable means and preach them to everyone as absolute fact and truth. \n\nThe other a rich clothing store kid.  A guy who knew just enough to be dangerous when it came to the Bible.   He couldn\u0027t read Greek.  He couldn\u0027t read Hebrew.  The only thing he was really good at was copying someone else\u0027s interpretations and saying he came up with them himself.  That\u0027s who started what eventually became known as the Watchtower Bible and Tract Society.  Jehovah\u0027s Witnesses.   Crazy I tell ya!!  Hope you enjoy it\n\nI was born and raised as one of Jehovah\u0027s Witnesses.  My parents met while serving under Nathan Knorr in the late 50\u0027s through the mid 60\u0027s.   They knew four of the seven people that were in prison with Rutherford in 1918.  But the history they were told had been whitewashed.  That\u0027s the history I grew up listening to.  Maybe that\u0027s the reason I\u0027m so fascinated in the real history of the organization and Jehovah\u0027s Witnesses.   Because it\u0027s so different from the organizations white washed version.\n\n\nSources:\nJohn Jacob Ross:  Some Facts and More Facts About the Self-styled \u0022Pastor\u0022 Charles T. Russell (of Millennial Dawn Fame)\n E.L. Eaton:  The Millennial Dawn Heresy: An Examination of Pastor Charles T. Russell\u0027s Teaching Concerning the Purpose of the Second Advent and the Millennium\nEncyclopedia Britannica\nStudy.com\nSome Facts and More Facts about the Self-Styled \u0022Pastor\u0022 Charles T. Russell (of Millennial Dawn Fame) -  Rev. J. J. Ross June 1912\nCarl Olaf: Sign of the Last Days When\nLink to the Watchtower organizations publications since 1878 - https://jws-library.one",
      "release": "2024-04-30T20:00:01Z",
      "duration": "00:29:27",
      "explicit": false,
      "youTubeId": "2thmVUYe6w8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2thmVUYe6w8"
      }
    },
    {
      "id": "0ad68dc0-4729-47ee-9a20-7a9d3cce901b",
      "title": "Does \u0022clarified understanding\u0022 mean it wasn\u0027t Truth before?",
      "description": "The Governing Body of Jehovah\u0027s Witnesses claim God gives them clarified understanding of the scriptures in his due time.  What does that really mean?  I hope you enjoy this video\n\n\n\nStock footage courtesy of Pexels.com",
      "release": "2024-04-11T20:00:10Z",
      "duration": "00:13:51",
      "explicit": false,
      "youTubeId": "UJPnjBtxRLw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UJPnjBtxRLw"
      }
    },
    {
      "id": "1bfdf9b4-a941-43b9-b8a3-183effb081a0",
      "title": "How do the Governing Body come up with all the changes?  THEY decide",
      "description": "I would like to know what you think.  The men that make up the Governing body of Jehovah\u0027s Witnesses admit they are not inspired and have made and still make mistakes.  Yet they expect close to nine million people to do whatever they say and decide.",
      "release": "2024-04-04T22:40:00Z",
      "duration": "00:19:27",
      "explicit": false,
      "youTubeId": "35pIDw1ig4M",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=35pIDw1ig4M"
      }
    },
    {
      "id": "f756c2b3-e70e-4a74-86f2-12d3c40b4598",
      "title": "What causes Religious Trauma for Jehovah’s Witnesses",
      "description": "Religious Trauma is a form of psychological trauma that stems from the harmful experiences within a religious context.  It occurs when an individual is subjected to abuse, control, manipulation or mistreatment in the name of one\u0027s religion.\n\nThis video is something that I am very passionate about as I feel it needs more awareness in the mental health field not only for Jehovah’s Witnesses, but for all high control religions, organizations or groups of any type.\n\nPlease share this video if you are able to and make sure to tell me what you think in the comments regarding this.\n\nAll stock footage -  @www.pexels.com\n\nMarlene Winell - https://www.journeyfree.org\nJW Facts  -  https://jwfacts.com",
      "release": "2024-03-04T15:00:12Z",
      "duration": "00:32:02",
      "explicit": false,
      "youTubeId": "FUmKRdDqdaI",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FUmKRdDqdaI"
      }
    },
    {
      "id": "01548291-f150-46f0-bdc7-d7b0a230e17d",
      "title": "Rose here.   I raised my children the way I was.  As a JW",
      "description": "I was born and raised as one of Jehovah’s Witnesses.  I started to question things about the organization when I was in my late 40\u0027s early 50’s.  When you come from a religion that’s dictates what you can and cannot do your entire life you begin to think of things.  This video shows how I was looking back at how the organization had impacted my life as I was growing up and in turn impacted my children’s lives.  There is so much more I have thought about regarding the impact the organization had on my youth and my life in general.  This is a small portion of me sharing my thoughts about it.\n\nTake care everyone.\n\n\nLink to my channel;\nhttps://www.youtube.com/@jwresearcher...\n\nstock footage credit - Pexels.com",
      "release": "2024-02-22T13:29:08Z",
      "duration": "00:11:45",
      "explicit": false,
      "youTubeId": "BRY1ki3Cj00",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BRY1ki3Cj00"
      }
    },
    {
      "id": "55c0411a-5113-42e1-a5cb-f7538f9b539e",
      "title": "The effect of indoctrination upon Jehovah\u0027s Witnesses",
      "description": "If you have ever tried to show one of Jehovah\u0027s Witnesses something to try and get them to think, this video shows why it\u0027s hard for them to process what you are showing them\n\nThanks for watching\n\nLink to my channel;\nhttps://www.youtube.com/@jwresearcherrose/featured\n\nstock footage credit - Pexels.com",
      "release": "2024-02-02T18:09:43Z",
      "duration": "01:04:48",
      "explicit": false,
      "youTubeId": "SPZlQfH2Wc4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SPZlQfH2Wc4"
      }
    },
    {
      "id": "66e4d8ec-f232-4866-8398-9581f193f881",
      "title": "If the 1914 teaching of Jehovah\u0027s Witnesses ever went away",
      "description": "What happens if the 1914 doctrine that Jehovah\u0027s Witnesses have been told to back their doctrines for 100 years went away?  The whole house of cards fall.  See what I mean in this video.\n\nLink to the organizations history regarding 607 BCE\nhttps://youtu.be/00T3JMeU14E?si=1Y1Wfm1J8uyBFoP7\n\nLink to the organizations many 1914 Generation teachings\nhttps://youtu.be/4GKfuTYWEKo?si=ZR_S2fB-VgF1QfE-\n\nLink to my channel\nhttps://www.youtube.com/@jwresearcherrose/featured\n\nStock footage credit\nWBTS\nPexels.com\n#jehovah #jehova #jehovahwitnesses #jehovahswitnesses #watchtower  #exjehovahswitness #exjw #exjwsthink #jw #1914 #exjehovahwitness #exjehovahswitness",
      "release": "2024-01-25T21:06:19Z",
      "duration": "00:16:34",
      "explicit": false,
      "youTubeId": "q34cTG5e7uw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=q34cTG5e7uw"
      }
    },
    {
      "id": "9a5f049c-2739-41e7-8771-f393047f0fee",
      "title": "The \u0022Change of Understanding\u0022 for Jehovah\u0027s Witnesses on Dec. 15, 2023",
      "description": "What made the Governing Body of Jehovah\u0027s Witnesses change their stance on males having beards within the organization?  Why is that no longer an indication of a bad attitude or lack of spirituality?  Watch the video to find out\n\nImage sources\nPublications of Jehovah\u0027s Witnesses\nJW Facts\n\n#jehovah #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjw #exjwsthink #exjehovahwitness #exjehovahswitness\n\n\nSources\n30 Years a Watchtower Slave - William Schnell\nWBTS publications and videos of Governing Body - JW.ORG \nArticles shown are from older Watchtower publications \n\nHistorical facts of the Watchtower organization including Judge Joseph Rutherford\u0027s coup; \nhttps://www.youtube.com/playlist?list=PL7y1oPawaRY8z-5g3NYszlWYiIh_rWMhf\n\nChanging understanding of who are considered the Governing Body of Jehovah\u0027s Witnesses;\nhttps://youtu.be/ozzcbFAxmis?si=g5cvFuaIicTPFOq1\n\nThe Watchtowers changing doctrines over 145 years;\nhttps://youtu.be/achfG2ALZWI?si=2uUIMQehTc8JkNbG\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2024-01-11T14:00:35Z",
      "duration": "00:51:10",
      "explicit": false,
      "youTubeId": "ipsczPqpSbw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ipsczPqpSbw"
      }
    },
    {
      "id": "910cc469-ef4f-48ec-9fbd-0f4cf04178a0",
      "title": "The difficult decision I made",
      "description": "Being one of Jehovah\u0027s Witnesses I had a difficult time with my daughter accepting a Blood Transfusion.  For over 50 years I was completely indoctrinated not to have a Blood Transfusion and even though I knew the history regarding Blood Transfusions and the Watchtower organization, the indoctrination I had been taught my entire life still resurfaced and I had a difficult time with my daughter accepting a Blood Transfusion. \n\nJehovahs Witnesses and Blood Transfusions:  https://youtu.be/kxuI660OHdE?si=J-5VfBJoPuVcPR0i\nThe history of the Governing Body of Jehovah\u0027s Witnesses:  https://youtu.be/ozzcbFAxmis?si=7vqzt24UEPmvYuDb\n\n\n\nStock footage credit:  Pixels.com",
      "release": "2023-12-30T21:51:15Z",
      "duration": "00:12:43",
      "explicit": false,
      "youTubeId": "EOu1uwzhC6c",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EOu1uwzhC6c"
      }
    },
    {
      "id": "7f2df4be-8e50-4d95-bbd9-a2995fef14fa",
      "title": "Why did Jehovah\u0027s Witnesses STOP celebrating Christmas?",
      "description": "Jehovah’s Witnesses, then known as Bible Students, celebrated Christmas for over 46 years including at Brooklyn Bethel until 1926.  Most Witnesses aren\u0027t aware of this.  What were the reasons they stopped?  What “New Light” did the governing body of that time show as the reason Witnesses were to not celebrate Christmas?  How did Christmas go from being celebrated to a disfellowshipping offense?\n\nI hope you enjoy this video\n\nLink to Playlist about 1916-1919 - https://www.youtube.com/playlist?list=PL7y1oPawaRY8z-5g3NYszlWYiIh_rWMhf\nLink to video about pagan practices still practiced by Witnesses - https://youtu.be/uCrrRR7qWn0?si=Qw0WBPL8XGnSzgAc\n\n\nStock footage credit - @Pexel.com",
      "release": "2023-11-28T18:35:16Z",
      "duration": "00:51:38",
      "explicit": false,
      "youTubeId": "tVwC2KJStoI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tVwC2KJStoI"
      }
    },
    {
      "id": "78228378-e68c-4555-a233-67e838b7e40b",
      "title": "Rose here.  As one of Jehovah\u0027s Witnesses I didn\u0027t \u0022OBEY\u0022  I\u0027m so glad",
      "description": "My children were born and raised Jehovah\u0027s Witnesses but left the organization.  Here is what I would have lost out on if I would have shunned them like I was supposed to.\n\nLink to video on history of disfellowshipping - https://youtu.be/yAS5kH32P2I\nLink to my channel - https://www.youtube.com/@jwresearcherrose/featured\nLink to history on the Governing Body - https://youtu.be/ozzcbFAxmis?si=mDnklkXQ1JnavB54",
      "release": "2023-10-10T07:32:12Z",
      "duration": "00:14:12",
      "explicit": false,
      "youTubeId": "B1uXLUfYF78",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=B1uXLUfYF78"
      }
    },
    {
      "id": "d4560449-3581-4e02-a1c5-dff59d12ed7c",
      "title": "The changes all Jehovah\u0027s Witnesses don\u0027t know - PAST AND CURRENT",
      "description": "The many changes Jehovah\u0027s Witnesses don\u0027t know about.  The changes made after this video was published\n\nThey are:\n\n1.  Witnesses are no longer required to track their time, publications given out or videos shown.  They currently check a box if they \u0022shared in any form in the ministry during the month\u0022.  10/2023 annual meeting\n2.  New understanding of being able to change your mind regarding choosing or returning to the organization during the Great Tribulation \u0022up to\u0022 armageddon.  Prior to that the understanding was that the Great Tribulation was the \u0022Cut Off\u0022 date for all those that did not become one of Jehovah\u0027s Witnesses. 10/2023 annual meeting\n3.  Clarification made to all Witnesses worldwide that \u0022the Governing Body do not have a problem with men having a beard.\u0022  Beards started to immediately be seen on brothers in Bethel with Governing Body member Geoffrey Jackson seen sporting a beard.  Beards exploded in the congregations. 12/2023 update\n4.  Women can wear pants to meetings and service, they are only required to wear a skirt/dress on stage.  Men don\u0027t have to wear a tie or jacket to meeting or service, they are only required to wear one on stage. 3/2024 update\n5.  Noah did not lead a preaching campaign to reach everyone living on earth before the Flood as was once taught - May 2024 Watchtower\n6.  The \u0022Good News\u0022 will not reach everyone before the Great Tribulation as once stated it will - May 2024 Watchtower\n7.  No more marking from the stage.  It is now a personal decision -  August 2024 Watchtower\n8.  You are now able to invite a disfellowshipped one to the meeting and say a greeting to them - August 2024 Watchtower\n9.  The word disfellowshipped will now be replaced with \u0022removed from the congregation\u0022 -August 2024 Watchtower\n\nThe Watchtower organization has been able to erase and change its history regarding past beliefs and understanding.  It\u0027s even easier now that everything is digital. I want to make sure the past isn\u0027t forgotten like the organization wants it to be.  Like they are trying to erase my history now.\n\n\nLink to my channel - https://www.youtube.com/@jwresearcherrose/featured\nLink to history on the Governing Body - https://youtu.be/ozzcbFAxmis?si=mDnklkXQ1JnavB54\n\n\nStock footage credit -  pexels.com",
      "release": "2023-09-27T04:49:20Z",
      "duration": "00:20:54",
      "explicit": false,
      "youTubeId": "achfG2ALZWI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=achfG2ALZWI"
      }
    },
    {
      "id": "4e0cf858-64a2-4264-b34f-e1c51c30bcbb",
      "title": "What really is an APOSTATE to Jehovah\u0027s Witnesses",
      "description": "Jehovah\u0027s Witnesses use that word towards anyone who says something negative about the Watchtower Bible and Tract Society or Governing Body.  But are they correct in doing so?  No.  What really is the Bible\u0027s definition of an Apostate?  As you see in this video, it\u0027s not what the organization/Branch/Governing Body claim it is\n\nSpecial thanks to editor_Mach\n\nLink to video on history of disfellowshipping - https://youtu.be/yAS5kH32P2I\nLink to my channel - https://www.youtube.com/@jwresearcherrose/featured\nLink to history on the Governing Body - https://youtu.be/ozzcbFAxmis?si=mDnklkXQ1JnavB54\nThank you for your support of this channel at - https://www.patreon.com/Jwresearcherrose/membershiphttps://www.patreon.com/Jwresearcherrose/membership\n\nStock footage credit -  pexels.com\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjehovahswitness #exjwsthink #exjw #jw #apostates",
      "release": "2023-09-08T16:19:42Z",
      "duration": "00:16:56",
      "explicit": false,
      "youTubeId": "7gYXJwugfVg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7gYXJwugfVg"
      }
    },
    {
      "id": "80148593-d202-49cb-b2ce-452db19b70e2",
      "title": "Interview with the Director of the newly released documentary “Witness Underground” (some language)",
      "description": "Director Scott Homan was brought into the Watchtower organization at a very young age.  Although his parents did not fully practice as he was growing up they became very dedicated later in life leading to Scott being shunned by his entire family.  His shunning led to this documentary.\n\nSpecial thanks to editor_Mach\n\nThe first 100 to use this special Link can watch the documentary for $5.00.  \nhttps://vimeo.com/r/3M2P/VC9vbnNNdm\n\nWitness Underground on Patreon - \nhttps://Patreon.com/WitnessUnderground\nDocumentary is also available here - Supports XJW Coming Out, Witness Underground Podcast\nhttps://YouTube.com/@WitnessUnderground\nXJW Coming Out series and Witness Underground Video Podcast\nhttp://WitnessUnderground.com \nProject and film site - Everything related to the movie, series, music, press, interviews, art, people, etc.\n\nLink to my research findings on the history on disfellowshipping - https://youtu.be/yAS5kH32P2I\nLink to the history on the governing body - https://youtu.be/ozzcbFAxmis\nLink to my channel - https://www.youtube.com/@jwresearcherrose/featured\nLink to Watchtower organizations publications since 1880  -  https://jws-library.one\n\nThank you for your support of this channel on Patreon - https://www.patreon.com/Jwresearcherrose/membership\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower  #exjehovahswitness #exjwsthink  #exjw #exjwsupport",
      "release": "2023-09-02T16:11:10Z",
      "duration": "01:03:09",
      "explicit": false,
      "youTubeId": "b-EgHLaPC2U",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=b-EgHLaPC2U"
      }
    },
    {
      "id": "565db24e-f78e-412c-9cc5-18838fe9bc30",
      "title": "New Zealand CSA and disfellowshipping with Jehovah\u0027s Witnesses.  Aug 20, 2023",
      "description": "Ed Narayan was an elder in the Pukekohe East congregation in New Zealand.  Ed stepped down and eventually disassociated himself from the Watchtower organization due to what he was told to do and found as Secretary in his congregation in October of 2021.  He has since helped in the New Zealand Royal Commission Abuse in Care regarding child sexual abuse within the congregations and the Watchtower organization’s policies held about how to handle a case of CSA.\n\nSpecial thanks to Ed for coming on this channel and editor_Mach\n\nCorrection:  There was no appeal made regarding the Hawaii judgement.  Someone rightfully corrected me \u0022 \u0027The plaintiff\u0027s claims against Apana and the church were resolved through a confidential settlement, but she then proceeded to trial on her damages claims against Apana.\u0027 \u0022\n\nLink to RNZ news articles - \nhttps://www.rnz.co.nz/news/in-depth/495727/rnz-investigation-reveals-11-alleged-paedophiles-active-within-the-jehovah-s-witnesses\nhttps://www.rnz.co.nz/news/in-depth/495802/jehovah-s-witness-elder-alleges-order-to-destroy-evidence-in-child-sex-abuse-cases\nhttps://www.rnz.co.nz/news/national/491206/jehovah-s-witness-church-seeks-exemption-from-royal-commission-abuse-in-care-inquiry\n\n\nLink to letter introducing Ed and his family - https://drive.google.com/file/d/1h6w8fzlh3DSg_Bhe0dTOGVZOSavEdIkE/view?usp=drivesdk\nLink to second letter - https://drive.google.com/file/d/1QFbuhIFs4cPTLYEqRrFY1uq6h9CNEVdN/view?usp=drivesdk\nLink to final letter Pukekohe regarding Ed becoming an elder again - https://drive.google.com/file/d/1ZI0sAt1z1-Lxfiomozd_YpWlFxis1Ucr/view?usp=drivesdk\nLink to Ed’s Statement to NZ Royal Commission - https://drive.google.com/file/d/1sSP0NQKN51HNbZsaCHuVKnu_kg5v8qJ7/view?usp=drivesdk\nLink to Oct 2021 Addendum to elder’s manual - https://drive.google.com/file/d/1KUE9QzlA-7gBWZymyWUB6JMUHE0Bcpdv/view?usp=drivesdk\nLink to paper written by a Professor and Doctor for the NZ Royal Commission - https://drive.google.com/file/d/1CMyhzDRA_Ln1Gx8s150nrYIebeQCNYuJ/view?usp=drivesdk\n\n\nLink to the church membership statistics (a Government stat):\nhttps://www.abs.gov.au/AUSSTATS/abs@.nsf/mediareleasesbyReleaseDate/7E65A144540551D7CA258148000E2B85\n\nLink to Cameron\u0027s story - https://youtu.be/CSMiTak8UzI\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower  #exjehovahswitness #exjehovahswitness #exjw #csa #jw",
      "release": "2023-08-20T14:44:43Z",
      "duration": "01:18:38",
      "explicit": false,
      "youTubeId": "pcxKWOytlgY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pcxKWOytlgY"
      }
    },
    {
      "id": "f7ca7476-01e8-4599-ba3c-67ba868a558f",
      "title": "Jehovah\u0027s Witnesses defense of CSA and disfellowshipping - SHUNNING",
      "description": "Jehovah\u0027s Witnesses Legal department at Watchtower headquarters and how it defends CSA ind shunning worldwide. \n\nSpecial thanks to editor_Mach\n\nLink to disfellowshipping - https://youtu.be/yAS5kH32P2I\nLink to the history on the governing body - https://youtu.be/ozzcbFAxmis\nLink to my channel - https://www.youtube.com/@jwresearcherrose/featured\nLink to Watchtower organizations publications since 1880  -  https://jws-library.one\n\nStock footage credit -  pexels.com\n#jehovah #jehova #jehovahswitnesses  #jehovahswitness  #watchtower #jehovahwitnesses  #exjw #exjwsthink #jw #exjehovahwitness",
      "release": "2023-08-06T15:17:52Z",
      "duration": "00:22:11",
      "explicit": false,
      "youTubeId": "aeQJx8HaltM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aeQJx8HaltM"
      }
    },
    {
      "id": "0ed49bdb-0fb1-4b33-8a74-32bbd3778c04",
      "title": "The complete control of Watchtower over millions of Jehovah\u0027s Witnesses",
      "description": "Control Jehovah\u0027s Witnesses are under.  Many think that the word \u0022control\u0022 is an overstatement - an exaggeration.  After watching this video please tell me in the comments if I am wrong about the control over Jehovah\u0027s Witnesses worldwide\n\nSpecial thanks to editor_Mach\n\nLink to disfellowshipping - https://youtu.be/yAS5kH32P2I\nLink to the history on the governing body - https://youtu.be/ozzcbFAxmis\nLink to my channel - https://www.youtube.com/@jwresearcherrose/featured\nThank you for your support of this channel at - https://www.patreon.com/Jwresearcherrose/membershiphttps://www.patreon.com/Jwresearcherrose/membership\n\nStock footage credit -  pexels.com\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #exjwsupport #jw #religious trauma",
      "release": "2023-07-30T15:04:05Z",
      "duration": "00:16:45",
      "explicit": false,
      "youTubeId": "xO2IQBC3IAs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xO2IQBC3IAs"
      }
    },
    {
      "id": "e30433e6-0477-482f-8da3-0a21c461a071",
      "title": "Can Jehovah\u0027s Witnesses leave if they want?",
      "description": "Can Jehovah\u0027s Witnesses stop believing or even leave their religion if they want? The answer is no.\n\nThe Watchtower organization tells others of different religions if they find something wrong in the practices, teachings and history regarding their religion they should leave it for its bad fruitage.  But if someone leaves the Watchtower Bible and Tract Society due to its practice of not protecting children from child sexual abuse and protecting pedophiles, or the ongoing changes of teachings they have found to be false as well as the organizations lies regarding the history of the organization they find, they are to be shunned.  It seems the Watchtower Bible and Tract Society have different standards regarding leaving one\u0027s religion.   Why the hypocrisy?  \n\nSpecial thanks to editor_Mach\n\n\nLink to video on history of disfellowshipping - https://youtu.be/yAS5kH32P2I\nLink to my channel - https://www.youtube.com/@jwresearcherrose/featured\nThank you for your support of this channel at - https://www.patreon.com/Jwresearcherrose/membershiphttps://www.patreon.com/Jwresearcherrose/membership\n\nStock footage credit -  pexels.com\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower  #exjehovahswitness #exjw #exjwsthink #jw #religioustrauma",
      "release": "2023-07-23T18:43:18Z",
      "duration": "00:16:29",
      "explicit": false,
      "youTubeId": "4InC31j-sig",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4InC31j-sig"
      }
    },
    {
      "id": "b2c3c126-7a87-4864-a601-1d2734a5643a",
      "title": "Is a Governing Body of Jehovah\u0027s Witnesses Biblical?",
      "description": "The \u0022Governing body\u0022 of Jehovah\u0027s Witnesses claim that the men who lead them located in New York are God\u0027s channel of communication here on earth by stating there was a governing body in the Bible.  \n\nWas there an actual governing body in the first century?  Does the Bible actually back a \u0022Governing Body\u0022?  The scripture to back a governing body is Acts 15:2.  So let\u0027s delve into the whole chapter  to see what an entire chapter actually says compared to just one verse.  \n\nPlease let me know what you think in the comments after watching this video\n\nTake care my friends.\n\nRose\n\nSpecial thanks to editor_Mach\n\nLink to what the GB said about 1975 - https://youtu.be/5WOf3ojCVnQ\nLink to video on Bethel elder - https://youtu.be/yOmWjrnlqJc\nLink to the hypocrisy of the \u0022Governing Body\u0022 - https://youtu.be/fGuhkixfr3U\nLink to my channel - https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\nIf you are able please support this channel through Patreon.  Thank you so much in advance. https://www.patreon.com/Jwresearcherrose/membership\n\n#jehovah  #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #jehovahwitness #exjwsthink  #exjwsupport #jw #exjehovahwitness #exjehovahswitnesses #exjw",
      "release": "2023-07-16T11:39:37Z",
      "duration": "00:15:28",
      "explicit": false,
      "youTubeId": "5WOf3ojCVnQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5WOf3ojCVnQ"
      }
    },
    {
      "id": "54ee54ad-a2c0-45ad-9d4c-5805acfd3516",
      "title": "The many changing 1914 \u0022Generation\u0022 teachings for Jehovah\u0027s Witnesses",
      "description": "Jehovah\u0027s Witnesses claim that 1914 is when Jesus came invisibly and that year started the \u0022Generation\u0022 mentioned at Matthew 24.  That particular teaching is what kept all Witnesses in expectation of the end being \u0022right around the corner\u0022.  However, with the changing doctrines and teachings Jehovah\u0027s Witnesses have lost that urgency to preach about the end.  Here is what Witnesses are seeing now along with the Watchtowers six explanations of the \u0022Generation\u0022 in 50 years.  Why does the Watchtower organization continue to change who the \u0022Generation\u0022 of Matt 24 is?  So far I have had six completely different explanations.  Every time we get a new explanation the time gets extended out. The most recent change was in 2010. \n\nFind out the multiple changes the Watchtower organization has claimed who that \u0022generation\u0022 is.  \n\nSpecial thanks to editor_Mach\n\nLink to Watchtower\u0027s 1975 prediction - https://youtu.be/WaDC_IV7rZ4\nLink to my channel - https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\nSource footage material can be found on the JW website",
      "release": "2023-07-01T01:31:08Z",
      "duration": "00:19:20",
      "explicit": false,
      "youTubeId": "4GKfuTYWEKo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4GKfuTYWEKo"
      }
    },
    {
      "id": "64c1a034-b6eb-4358-b4f0-7a9dbba89c63",
      "title": "The misquotes in Watchtower\u0027s Creation brochure and book",
      "description": "I have found many misquotes and misinformation in the Creation brochure.  Why does the Watchtower Bible and Tract Society feel the need to misquote or \u0022mine\u0022 for quotes?  This was just one brochure.  Imagine all the misquotes in the publications that have been made over the last 145 years\n\nA very special thank you to editor_Mach \n\nLink to my channel - https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to how I believed the universe was only 48,000 years old - https://youtu.be/NjSge28_s_g\nLink to WBTS publications from 1880 on - https://jws-library.one\nThank you for supporting this channel on Patreon at - https://www.patreon.com/Jwresearcherrose/membership\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #jw  #exjwsthink",
      "release": "2023-06-24T05:11:17Z",
      "duration": "00:25:47",
      "explicit": false,
      "youTubeId": "KWyS4aDsUnA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KWyS4aDsUnA"
      }
    },
    {
      "id": "bdb70bc1-d7bf-4168-9c3f-8ccd5f8d1980",
      "title": "Watchtower- donations and Jehovah\u0027s Witnesses.  The history",
      "description": "I was one of Jehovah\u0027s Witnesses for over five decades.  The recent increase in donation talks had really been bothering me.   I started to dig and research.  My research started to bring back memories I have long forgotten but shook me to my core.  The Watchtower Bible and Tract Society was making money off of me.\n\nThe organization is worth billions.  This is what I found in my research.  Thank you for watching\n\nSpecial thanks to editor_Mach\n\nMy video on CSA - https://youtu.be/Czh4nHxiWS8\nLink to Geoffrey Jackson\u0027s testimony -  https://youtu.be/OnKl2qM5C5A\nLink to my channel - https://www.youtube.com/@jwresearcherrose/featured\n\nThank you for supporting this channel -  https://www.patreon.com/Jwresearcherrose/membership\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2023-06-17T17:31:40Z",
      "duration": "00:38:15",
      "explicit": false,
      "youTubeId": "4I1QG0sPJQQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4I1QG0sPJQQ"
      }
    },
    {
      "id": "703bae98-11f7-44d8-bd6c-233a7f4e144e",
      "title": "Born in and raised as one of Jehovah\u0027s Witnesses.  \u0022Blakes Story\u0022",
      "description": "\u0022Blakes\u0022 story of growing up as one of Jehovah\u0027s Witnesses and the impact it has on the young lives of those born into the organization.  The emotional turmoil of waking up in her early 40\u0027s.  How she has managed to become happy and enjoy life even though she is now being shunned by her family.\n\nThank you Blake for sharing your story.  I related to a lot of how you felt as a child growing up, what you felt you missed out on and waking up later in life.\n\nTake care everyone - Rose\n\nSpecial thanks to editor_Mach\nThank you Blake\n\nLink to my channel - https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nGeoffrey Jackson\u0027s testimony - https://youtu.be/OnKl2qM5C5A\nPatreon thank you for your support of this channel. - https://patreon.com/Jwresearcherrose?utm_medium=clipboard_copy\u0026utm_source=copyLink\u0026utm_campaign=creatorshare_creator\u0026utm_content=join_link\n\n\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower  #exjehovahswitness #witness #documentary #exjwsupport #exjw #exjwsthink #jwchildren",
      "release": "2023-06-10T15:16:12Z",
      "duration": "00:45:02",
      "explicit": false,
      "youTubeId": "g7xhzGoXpfk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g7xhzGoXpfk"
      }
    },
    {
      "id": "cc110e6d-f952-46c3-ab1d-43858be9bdf7",
      "title": "Unquestioned power and authority.  History of the “Governing Body\u0022",
      "description": "Jehovah\u0027s Witnesses history of the evolving \u0022Governing body\u0022 and how they came to have the complete authority they have now.  \n\nIt’s very important to remember the Watchtower Bible and Tract Society is a Corporate Business entity.  At one time the Governing Body were only administrators of this corporate entity until they separated themselves from legal corporate matters in 2001.  Over the last one hundred years their control over all Witnesses lives have got them the authority they now have.\n\nMy interpretation of the “Governing Body” through my research is that Joseph Rutherford wanted power and got it when he did his coup of Watchtower in 1917/18.  \n\nAfter Rutherford’s death Fred Franz and Nathan Knorr started to turn the organization into the direction they wanted it to go.  This was after they told Hayden Covington he couldn’t be President because he wasn’t anointed.  Once Nathan Knorr became President he and Fred Franz started making all of these doctrinal changes and basically did whatever they wanted. The rest of the board stepped in and voted for more than one man to be in charge of the organization. What Charles Russell had originally intended but Rutherford just ignored.  That is why there is more than one man now as the \u0022Faithful Slave\u0022.\n\nI think Knorr was a great administrator and that is how he grew the organization to the extent he did.  Franz was this crazy bible thumper that had all these ideas he wanted put as “truths of the bible”.  These two men ran everything and my personal opinion is the rest of the board wanted to reign them in and that\u0027s how we got the arrangement we have today.\n\nThey turned a Publishing corporation into a worldwide religion\n\nNow all men on the Governing Body - that was once made up of only board members - became supreme authority over all of Jehovah\u0027s Witnesses today.  As Russell, Rutherford and Knorr once were in their day.\n\nA group of men who by their own admissions state they are imperfect, fallible and not inspired, so not spirit directed.  Yet they speak on behalf of Jesus.  I\u0027m not sure how that works.\n\nJust men with their own interpretations of the Bible just like Charles Russell, Joseph Rutherford, Nathan Knorr and all the men had who have followed.  \n\nNow instead of a Publishing company the organization is a Real Estate holding, video production company promoting their website\n\nIt’s not new light when something is changed.  It’s just other mens interpretations of what their predecessors stated as truth.  See \u0022Beliefs Clarified\u0022 on jw.org and on https://jws-library.one\n\nThanks for watching and Take care\n\nExtra special thanks to editor_Mach\n\nJoseph Rutherford coup of Watchtower Part 1 of 3 -https://youtu.be/Eub_0jvLnw8\nPart 2 of 3 - https://youtu.be/gIsm_J9texk\nPart 3 of 3 - https://youtu.be/LPReg_31fok\n\nLink to my channel - https://www.youtube.com/@jwresearcherrose\nThank you for your support of this channel - https://www.patreon.com/Jwresearcherrose/membership\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #governingbody #exjw #exjwsthink #jw #jehovahswitnessdocumentary",
      "release": "2023-06-03T17:58:57Z",
      "duration": "00:23:10",
      "explicit": false,
      "youTubeId": "ozzcbFAxmis",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ozzcbFAxmis"
      }
    },
    {
      "id": "0820d504-375e-4d1e-9b51-7b6da15a8a40",
      "title": "Rose here.  Part of my experience as PIMO",
      "description": "I was one of Jehovah\u0027s Witnesses. Now I\u0027m PIMO. My personal experience living life PIMO - \u0022Physically In but Mentally Out\u0022 as one of Jehovah\u0027s Witnesses.  What it\u0027s like mentally dealing with family and friends when you learn things that make you no longer believe in the Watchtower organization.  When you know the information you found is easily accessible but frowned upon within the community.  My personal experience of what this organization does.\n\n \n\nTake care of yourself\n\nSpecial thanks to Editor_mach. \nLink to my channel - https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\n\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #exjwsupport #jw #religioustrauma",
      "release": "2023-05-13T18:37:01Z",
      "duration": "00:14:17",
      "explicit": false,
      "youTubeId": "iKPstAXcRkE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iKPstAXcRkE"
      }
    },
    {
      "id": "9db63437-0d4b-44a9-8bed-528ce4d07e35",
      "title": "When one of Jehovah\u0027s Witnesses questions former beliefs",
      "description": "What happens as one of Jehovah\u0027s Witnesses when you are called into an elders meeting for questioning anything regarding the organization?  Do the elders listen to what you say or show them?  This is how the scenario works out in my head.  I end up disfellowshipped for apostasy\n\nLink to my channel - https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Watchtower publications from 1880 - https://jws-library.one\n\nSpecial thanks to editor_Mach\n\n#jehovah #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #exjwsupport #jw  #exjehovahwitness #exjehovahswitness",
      "release": "2023-04-29T13:39:19Z",
      "duration": "00:10:42",
      "explicit": false,
      "youTubeId": "WOc_DyivxDE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WOc_DyivxDE"
      }
    },
    {
      "id": "5beee948-47f0-4eb5-8f8d-c371124ed2f6",
      "title": "Hypocrisy that Jehovah\u0027s Witnesses are unaware of",
      "description": "There have been multiple instances of hypocrisy Jehovah\u0027s Witnesses aren\u0027t aware of within the Watchtower organization over the last 100 years.  Do you know of any of them?  In this video we will see five instances that I have found.\n\nA special thanks to my new editor who helped me make a much better video\n\nLink to 1975 video - https://youtu.be/WaDC_IV7rZ4\nVideo on the blood doctrine instituted - https://youtu.be/kxuI660OHdE\nVideo on disfellowshipping - https://youtu.be/yAS5kH32P2I\nLink to series - https://www.youtube.com/playlist?list=PL7y1oPawaRY8z-5g3NYszlWYiIh_rWMhf\nLink to video on the Governing Body - https://youtu.be/5WOf3ojCVnQ\nLink to my channel Playlists - https://www.youtube.com/@jwresearcherrose/playlists\nLink to Jeremiah films documentary - https://youtu.be/VE3zp9FiyiQ\nPatreon thank you for supporting this channel  -  https://www.patreon.com/Jwresearcherrose/membership\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2023-04-23T04:07:46Z",
      "duration": "00:14:20",
      "explicit": false,
      "youTubeId": "fGuhkixfr3U",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fGuhkixfr3U"
      }
    },
    {
      "id": "f9f88d68-dde7-44e7-bfa1-3ea788d4aa99",
      "title": "Is misogyny systemic among Jehovah\u0027s Witnesses?",
      "description": "Are Jehovah\u0027s Witnesses really misogynistic?  Is the Watchtower organization really misogynistic?  Is it patriarchal?  Do Jehovah\u0027s Witnesses view men as superior to women?  What I have found through my research in the publication throughout the last 100 years\n\nPlease keep searching\n\nMaria Russell:  https://youtu.be/NGw3S9ycLvg\nMy experience in 1975 video:  https://youtu.be/WaDC_IV7rZ4\nShepherd the Flock of God:  https://youtu.be/ndMuXAYX0b0\nLink to the Watchtower organizations publications since 1878 - https://jws-library.one\n\nLink to my channel:  https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\n\n\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw #jworg",
      "release": "2023-03-31T01:33:07Z",
      "duration": "00:21:33",
      "explicit": false,
      "youTubeId": "egofw6J7c_w",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=egofw6J7c_w"
      }
    },
    {
      "id": "2d5806be-f6e3-4de2-a8c5-35c315f0329d",
      "title": "Are Jehovah\u0027s Witnesses controlled by the Watchtower organization",
      "description": "When this video was made beards were not allowed.  If a man wanted to wear a beard he was considered spiritually weak.  That has changed as of Dec 2023.  Questions to ask whether or not Jehovah\u0027s Witnesses are a high control organization.  Is what you do for God, or is it for the organization/church/community/group you belong to?\n\nPlease keep searching.\n\nLink to my channel:  https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to the Watchtower organizations publications since 1878 - https://jws-library.one\nPatreon thank you for supporting this channel  -  https://www.patreon.com/Jwresearcherrose/membership",
      "release": "2023-03-19T02:27:34Z",
      "duration": "00:16:56",
      "explicit": false,
      "youTubeId": "3j3OtBJatok",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3j3OtBJatok"
      }
    },
    {
      "id": "6bc68711-1b36-4017-8169-2c4ab07c11fe",
      "title": "The prediction of 1975 stated as fact to Jehovah\u0027s Witnesses",
      "description": "Jehovah\u0027s Witnesses don\u0027t realize that Watchtower predicted 1975 as the beginning of Christ\u0027s millennial reign.  Jehovah\u0027s Witnesses have no idea that was stated as truth.  This video will show you how.  I will show you what I was hearing, reading and being taught about in 1975 as one of Jehovah\u0027s witnesses.  What we went out in service and told others was truth.  I\u0027ll show you how 1975 was made as a prediction but proved to be just another failed prophecy of Watchtower.\n\nI will also show you how Witnesses can get so confused with the constant changing teachings and convoluted explanations they are given\n\n\nLinks to my other videos mentioned in this video:\n\nThe multiple “Generation” teachings in my lifetime - https://youtu.be/x8y2Lu9dmmQ\n\nHow we were taught the universe was only 48,000 years old - https://youtu.be/NjSge28_s_g\n\nFred Franz 1966 talk about 1975 - https://youtu.be/v7E714EGGIQ\n\nLink to my channel:  https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one",
      "release": "2023-02-23T19:43:41Z",
      "duration": "00:28:09",
      "explicit": false,
      "youTubeId": "WaDC_IV7rZ4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WaDC_IV7rZ4"
      }
    },
    {
      "id": "a964ccf4-952d-43d6-a9b1-18e3efaf0393",
      "title": "The Watchtower organization used a self proclaimed spiritist",
      "description": "Jehovah\u0027s Witnesses are unaware that the Watchtower organization used a self proclaimed spiritist and medium\u0027s translation of the Greek scriptures as references in the publications to back the thinking of the organization on key scriptures\n\nWhat I found through my research\n\nLink to my channel:  https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\n\nSources:\nWatchtower Bible and Tract Society\nWitnesses of Jehovah - Jeremiah films  https://youtu.be/VE3zp9FiyiQ\nThe New Testament - Johaness Greber\n\nThank you for supporting this channel. - https://www.patreon.com/Jwresearcherrose",
      "release": "2023-02-19T23:47:51Z",
      "duration": "00:30:53",
      "explicit": false,
      "youTubeId": "JTsBvdbdPcs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JTsBvdbdPcs"
      }
    },
    {
      "id": "0925de58-2a74-4450-8b4f-839b6c5b5b0d",
      "title": "Jehovah\u0027s Witnesses and their 607 BCE teaching and doctrine",
      "description": "1914 is a pivotal date to Jehovah\u0027s Witnesses.  They believe 607 BC was the fall of Babylon.  Through Bible chronology they are shown that 607 BC point to 1914 as the date Jesus Christ came invisibly and sat on his heavenly throne. \n\nGoverning Body members Fred Franz and Nathan Knorr actually changed the date of Jerusalem\u0027s fall from 606 BCE to 607 BCE.  But somehow that didn\u0027t change like changing a year would normally do.  Why?  See how the teaching was changed\n\nPlease Keep Searching.\n\nSources\nJehovah\u0027s Witnesses -  Proclaimers of Gods Kingdom\nEncyclopedia Britannica\n\nLink to my channel:  https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\n\nThank you for supporting this channel - https://www.patreon.com/Jwresearcherrose\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2023-02-05T03:25:37Z",
      "duration": "00:14:52",
      "explicit": false,
      "youTubeId": "00T3JMeU14E",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=00T3JMeU14E"
      }
    },
    {
      "id": "03457ee5-3720-493d-a520-f1ec5e712d41",
      "title": "Rose here.  It wasn\u0027t easy when I started to wake up",
      "description": "I was one of Jehovah\u0027s Witnesses for over 50 years. This is what it was like for me emotionally as I was dealing with the aftermath of just recently realizing the organization was not what I thought.  The thoughts and emotions I was going through\n\nPart of my journey waking up as one of Jehovah’s Witnesses after 50 years.  \n\nKeep searching\n\nLink to my personal experience waking up\nhttps://www.youtube.com/playlist?list=PL7y1oPawaRY-fEmy7O2rIStf7aYIpTcog\nLink to my channel\nhttps://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A",
      "release": "2023-02-03T05:41:49Z",
      "duration": "00:12:03",
      "explicit": false,
      "youTubeId": "umdLEexr0VY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=umdLEexr0VY"
      }
    },
    {
      "id": "66e21880-4701-43f4-90fb-da99a8f71849",
      "title": "Jehovah\u0027s Witnesses and the history with Disfellowshipping - SHUNNING",
      "description": "Jehovah\u0027s Witnesses disfellowshipping history.  In this video you will see when the disfellowshipping arrangement was instituted by Nathan Knorr.  Did you even know that disfellowshipping hasn\u0027t always been a practiced by Jehovah\u0027s Witnesses?\n\nIn March of 2023 all religious status was removed in Norway due to the disfellowshipping arrangement which meant the organization lost roughly $1,778,793 in U.S. dollars in governmental support annually.  About $140 per member.\n\nThe organization was ordered pay to  NOK 100,000 ($9,010 US dollars) in damages, NOK 512,063.50 ($46,902 US dollars) as expenses for the Court of Appeal case, and NOK 386,082 ($34,789 US) for the expenses before the District Court.  All paid through the voluntary donations that were supposed to be used for the Worldwide preaching work.  Donations which are now considered part of all Witnesses sacred service.\n\nLink to my channel:  https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to the Watchtower organizations publications since 1878 - https://jws-library.one\n\nPlease keep searching.\n\n\n\n\n#jehovah #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #exjwsupport #jw #disfellowship #jehovahswitnessdocumentary #exjehovahwitness #exjehovahswitness  #religioustrauma",
      "release": "2023-01-29T08:34:34Z",
      "duration": "00:16:42",
      "explicit": false,
      "youTubeId": "yAS5kH32P2I",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yAS5kH32P2I"
      }
    },
    {
      "id": "f4c54025-7797-420d-940f-8a854e544c01",
      "title": "Is the Blood doctrine of JW\u0027s scriptural or a death sentence?",
      "description": "Jehovah\u0027s Witnesses used to accept blood transfusions.  In fact they were even commended for giving blood to save others.  This is the history on the changing blood doctrine and when \u0022No Blood Transfusions\u0022 was instituted in the organization for Jehovah\u0027s witnesses\n\n\n\n\n\n\nLink to my channel:  \nhttps://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to the Watchtower Organizations publications since 1878 - https://jws-library.one\n\nThank you for supporting this channel - https://www.patreon.com/Jwresearcherrose",
      "release": "2023-01-20T03:10:44Z",
      "duration": "00:14:15",
      "explicit": false,
      "youTubeId": "kxuI660OHdE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kxuI660OHdE"
      }
    },
    {
      "id": "e7a296a1-adb8-4f72-ae68-48d5e6e862f4",
      "title": "Jehovah\u0027s Witnesses and the Holocaust. The real story not Watchtowers",
      "description": "Jehovah\u0027s Witnesses and the Holocaust.  The original founder and first \u0022Faithful Slave\u0022 Charles Russell was a Zionist. He thought the Bible spoke of actual Jews getting their land back.  The second Faithful Servant Joseph Rutherford had a much different and negative opinion about them.  I have included my sources for you.\n\n\nLink to my channel:  https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to the Watchtower organizations publications since 1878 - https://jws-library.one\n\nSources:\nPaul Balzeriet the Magdeburg Branch Overseer who I spoke about in the video is who spoke about that convention.  The 1974 Yearbook mentions him quite a bit starting on page 88.\n\nBetween Resistance and Martyrdom:  Jehovah\u0027s Witnesses in the Third Reich - Garbe Detlef. University of Wisconsin Press \n\nJehovah\u0027s Witnesses in the Divine Purpose - WBTS\nJehovah\u0027s Witnesses - Falk, Pingel - Encyclopedia of the Holocaust\nTaking the Stand:  We have more to say - Bernhard Rammerstorfer\nFaith on the March - A.H. MacMillan \n30 Years a Watchtower Slave - William Schnell\nJames Penton - Jehovah\u0027s Witnesses and the Third Reich\nWatchtower History - the complete history regarding Judge Joseph Rutherford - https://www.youtube.com/@UCYThpH-M1vnT7O6juUu2Smg \n\nThere are others you will find through your own research\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw #jehovahswitnessdocumentary",
      "release": "2023-01-13T18:29:18Z",
      "duration": "00:15:55",
      "explicit": false,
      "youTubeId": "hD5j_gUXRLw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hD5j_gUXRLw"
      }
    },
    {
      "id": "ba33b86b-b1e5-4ad5-bf8d-6d79afe9018e",
      "title": "As a victim of CSA what I found as one of Jehovah\u0027s Witnesses",
      "description": "Jehovah\u0027s Witnesses and child sexual abuse. There has been a massive cover up of child sexual abuse within the Watchtower organization for over 70 years.  The Governing Body also known as the \u0022Faithful Slave\u0022 of Jehovah\u0027s Witnesses have known of this problem since the 1950\u0027s.  This video goes over my personal experience, the cover up I found and some of the news reports I\u0027ve seen such as 60 Minutes and Dateline over the last 20 years.  \n\nWe now know as victims that for decades - tens and tens of thousands ~ not hundreds but thousands ~ of us will never get the closure or the apology we need to help us heal.  The Governing Body of Jehovah\u0027s Witnesses, who to Witnesses are God\u0027s channel as well as Jesus\u0027 spokesmen here on earth  -   will never acknowledge this happens. \n\n\nLink to VICE Documentary I need you to see a one of Jehovah\u0027s Witnesses - https://youtu.be/SDvox6_oRQk\nLink to my channel: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Barbara Anderson’s 2002 Dateline interview:  https://youtu.be/ZtzyCgWQ7kI\nLink to current update on the ARC - https://www.nzherald.co.nz/nz/jehovahs-witness-church-seeks-exemption-from-royal-commission-abuse-in-care-inquiry/7C2M5Q5SCRCT7F473DJ52N3WUU/\n\n\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #exjwsupport #csa #jw #religioustrauma",
      "release": "2022-09-30T07:31:08Z",
      "duration": "00:52:35",
      "explicit": false,
      "youTubeId": "Czh4nHxiWS8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Czh4nHxiWS8"
      }
    },
    {
      "id": "4d6d7b50-abb2-4df1-8241-8792aeaf18f4",
      "title": "Barbara Anderson’s 2002 interview on CSA in Watchtower’s organization",
      "description": "Barbara Anderson’s first interview regarding child sexual abuse within the Watchtower Bible and Tract Society.\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Vice documentary:  https://youtu.be/SDvox6_oRQk\n\nThank you for supporting this channel. - https://www.patreon.com/Jwresearcherrose\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #exjwsupport #csa #jw",
      "release": "2022-09-29T02:05:56Z",
      "duration": "00:25:47",
      "explicit": false,
      "youTubeId": "ZtzyCgWQ7kI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZtzyCgWQ7kI"
      }
    },
    {
      "id": "746d7c24-ffcb-477d-b66b-73aa22535372",
      "title": "Many properties in New York Jehovah\u0027s Witnesses have had to pay for",
      "description": "Many Jehovah\u0027s Witnesses have no idea about the properties in New York.  Here are just some of the many properties of the Watchtower organization.  Anthony Morris speaking about Ramapo in a 2020 Morning worship at the Branch\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences. Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nMany thanks to the following:\n\nTour of Ramapo - @JWEscape\nTour of Fishkill - @ExJWBethelite\nGoverning Body jewelry - @TheBlueEnvelope\n\nMusic credit:  Breathless by Elision \nYouTube music license # HCBJK8QRFKXTS12Y\n\n\nLink to my channel: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2022-09-16T14:54:55Z",
      "duration": "00:24:42",
      "explicit": false,
      "youTubeId": "5Ka52rdudwk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5Ka52rdudwk"
      }
    },
    {
      "id": "d1ce11a8-a6c1-4574-a39d-e5face43a789",
      "title": "Rose here.  My analogy of thinking critically as a JW",
      "description": "It\u0027s not easy as one of Jehovah\u0027s Witnesses to look at something negative about the organization with a critical eye.  Your indoctrinated defense system gives off this intense feeling of discomfort that immediately gives you a negative feeling about what you are looking at.\n\nPart of my thought process waking up process as one of Jehovah\u0027s Witnesses\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences. Like this video.  Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\nLink to information on leaving:  https://readJW.Info",
      "release": "2022-09-10T16:26:33Z",
      "duration": "00:13:13",
      "explicit": false,
      "youTubeId": "Uj2tyESrIU0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Uj2tyESrIU0"
      }
    },
    {
      "id": "68c5e583-9ec0-499a-a862-18d3b65c3307",
      "title": "The truth behind 1914 and Jehovah’s Witnesses",
      "description": "How exactly did the Watchtower Bible and Tract Society come up with 1914?\n\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences.  Catch up on my channel and follow for more!\n\nThank you\n\nRose\n\nLink to my channel: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2022-09-05T15:10:32Z",
      "duration": "00:12:12",
      "explicit": false,
      "youTubeId": "ukWyL0Fje70",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ukWyL0Fje70"
      }
    },
    {
      "id": "330e4b9b-d0dc-4072-ba0c-36ee447e32e3",
      "title": "What Jehovah\u0027s Witnesses are taught regarding Jesus",
      "description": "What Jehovah\u0027s Witnesses don\u0027t realize regarding the organizations view of Jesus as Mediator\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences.  Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\nLink to the Watchtower organizations publications from 1878 -  https://jws-library.one\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2022-08-07T02:14:03Z",
      "duration": "00:11:41",
      "explicit": false,
      "youTubeId": "17UcCzVMb1c",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=17UcCzVMb1c"
      }
    },
    {
      "id": "c379633f-7dbc-48ae-bdae-837045a0d9c5",
      "title": "Science doesn\u0027t prove certain things to Jehovah\u0027s Witnesses.  EXAMPLE",
      "description": "As one of Jehovah\u0027s Witnesses I was actually taught in my youth that the earth and the entire universe were only 48,000 years old.  All Witnesses believed that until the turn of the 21st century.   How Watchtower changed that way of thinking for Witnesses over a decade\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences.  Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my personal experience in 1975 with the talks and publications - https://youtu.be/WaDC_IV7rZ4\nLink to 1975 video:  https://youtu.be/v7E714EGGIQ\nLink to Charles T. Russell photo Drama of Creation:  https://youtu.be/xcoRBdoMoM4\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to the Watchtower publications since 1878 - https://jws-library.one",
      "release": "2022-07-18T03:52:29Z",
      "duration": "00:11:37",
      "explicit": false,
      "youTubeId": "NjSge28_s_g",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NjSge28_s_g"
      }
    },
    {
      "id": "da473f7d-03c5-4c5e-8e85-047c7e961af2",
      "title": "2022 Regional Convention of Jehovah\u0027s Witnesses videos - pm session",
      "description": "Certain videos by Jehovah\u0027s Witnesses at the 2022 Regional Convention.  Here are the highlights of certain videos shown at the 2022 Regional Convention of Jehovah\u0027s Witnesses.  What I thought about them at the time they were being aired.  What I wanted to bring attention to regarding the Friday pm session\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences.  Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to the Watchtower organizations publications since 1878 - https://jws-library.one\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2022-07-08T05:49:36Z",
      "duration": "00:15:50",
      "explicit": false,
      "youTubeId": "pw976ilkWwo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pw976ilkWwo"
      }
    },
    {
      "id": "d97efbcb-1e6a-4a6b-85a9-7a4f0b425186",
      "title": "Why are certain Jehovah\u0027s Witnesses required to sign a vow of poverty?",
      "description": "Jehovah\u0027s Witnesses aren\u0027t aware of the vow required in order to live at the Bethel headquarters in New York.\n\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences.  Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nJT\u0027s video regarding the \u0022Vow\u0022:  https://youtu.be/olch0jCBzMg\nLink to my channel: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to the Watchtower organizations publications since 1878 - https://jws-library.one\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2022-06-17T22:45:02Z",
      "duration": "00:11:06",
      "explicit": false,
      "youTubeId": "eVNc1icjyFk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eVNc1icjyFk"
      }
    },
    {
      "id": "85912bcb-be85-4ec2-8c5d-b89e470dbdb1",
      "title": "A Jehovah\u0027s Witness Elder spoke about times at \u0022Bethel\u0022 during Covid",
      "description": "Bethel Elder speaks out about times during the Covid pandemic in which all those living at headquarters were quarantined in their rooms.  The depression and alcoholism that was common place as well as the spousal abuse that arose.\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences.  Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\nExjw Critical Thinker video:   https://youtu.be/SL4gzfjH1Sw\nLink to Exbethelelder: https://www.reddit.com/u/exbethelelder/?utm_source=share\u0026utm_medium=ios_app\u0026utm_name=iossmf",
      "release": "2022-06-14T00:32:46Z",
      "duration": "00:13:36",
      "explicit": false,
      "youTubeId": "yOmWjrnlqJc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yOmWjrnlqJc"
      }
    },
    {
      "id": "c8a7fb94-0aa4-4d84-8abb-96c1154a4d40",
      "title": "The VICE documentary you need to see as one of Jehovah\u0027s Witnesses",
      "description": "The VICE documentary I need you to see as one of Jehovah\u0027s witnesses\n\nHi!  I\u0027m Rose.  Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\n\n\nThank you - Rose\n\n\nLink to my channel:  https://www.youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to my personal experience:  https://youtu.be/Czh4nHxiWS8\nPatreon - https://www.patreon.com/Jwresearcherrose/membership\nLink to Documentary:  https://youtu.be/gDwHdj7plWo\nLink to the Watchtower organization publications from 1878 - https://jws-library.one\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw #csa",
      "release": "2022-05-31T05:14:15Z",
      "duration": "01:27:44",
      "explicit": false,
      "youTubeId": "SDvox6_oRQk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SDvox6_oRQk"
      }
    },
    {
      "id": "9a1e365d-6a1d-490e-a618-3b435c65c662",
      "title": "Geoffrey Jackson lies under oath regarding Jehovah\u0027s Witnesses",
      "description": "Geoffrey Jackson a Governing Body member of Jehovah\u0027s Witnesses lies under oath by claiming it\u0027s OK for Jehovah\u0027s Witnesses to stop believing.  He claimed the Watchtower Governing Body are not God\u0027s only channel of communication and he is not familiar with certain Witness beliefs as they are not under his purview.  \n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences, like this video. Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nRoyal Commission video footage credit: https://www.youtube.com/@jakkecontrol6292\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\n\nLink to my personal experience:  https://youtu.be/TuouCe7_nLc\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2022-05-23T23:48:09Z",
      "duration": "01:10:52",
      "explicit": false,
      "youTubeId": "OnKl2qM5C5A",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OnKl2qM5C5A"
      }
    },
    {
      "id": "9154f9d9-6cbb-421d-a9be-f1c02b807652",
      "title": "Watchtower why haven’t I been able to get answers in 40 years?",
      "description": "1980\u0027s video regarding the organization.  I have so many questions because of what I have found\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences. Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\n\nVintage documentary footage credit:  Jeremiah Films; edited for content   MUST SEE!\nhttps://youtu.be/VE3zp9FiyiQ\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2022-05-23T06:37:20Z",
      "duration": "00:16:33",
      "explicit": false,
      "youTubeId": "QBZr_heTWBw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QBZr_heTWBw"
      }
    },
    {
      "id": "770d2b69-6127-459a-bcbb-0308f131877d",
      "title": "Rose here.  The thoughts and feelings I had waking up.  Hope they help",
      "description": "What does it mean to deconstruct as one of Jehovah\u0027s Witnesses?  My personal deconstruction process after over five decades as a witness.  The emotions and feelings I went through.  My personal experience on learning about the Watchtower organization.\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #exjwsupport #jw #religioustrauma",
      "release": "2022-05-14T23:30:39Z",
      "duration": "00:11:57",
      "explicit": false,
      "youTubeId": "aZlAhi0jRZA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aZlAhi0jRZA"
      }
    },
    {
      "id": "b118a4d6-e665-414d-b5bb-4e8ab79961e5",
      "title": "Footage of Joseph Rutherford as Beth Sarim was being built in 1929",
      "description": "Vintage footage of  \u0022Judge\u0022 Joseph Rutherford at Beth Sarim the mansion he had built and deeded to house the \u0022Faithful men of old\u0022 in the Bible.  Rutherford claimed these men were coming to usher in the New World.  When that failed to happen he lived luxuriously in it until his death in 1942.\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences. Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\n\nLink to Judge Rutherford’s multiple predictions;  https://youtu.be/PfMhvIyLHf8\n\nVintage documentary footage credit:  @JWStruggle.com edited for content\n\nhttps://youtu.be/VE3zp9FiyiQ\n\nMusic credits:\n\nMusic: Lovely Piano Song\nMusician: Rafael Krux\nSite: https://freepd.com/\nLicense: https://creativecommons.org/publicdomain/zero/1.0/legalcode\n\nMusic: Upbeat Fun Ukulele\nMusician: REDproductions\nSite: https://pixabay.com/music/-positive-hopeful-upbeat-fun-ukulele-hope-pleasure-music-16525/\n\nThird music song;   Some One There/Redline\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw \n\nCopyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Nonprofit, educational or personal use tips the balance in favor of fair use.",
      "release": "2022-04-26T20:05:00Z",
      "duration": "00:14:06",
      "explicit": false,
      "youTubeId": "ATlHLQeHcSA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ATlHLQeHcSA"
      }
    },
    {
      "id": "699cc43e-2d26-4fee-af5b-b4a91e462679",
      "title": "Jehovah\u0027s Witness are denied religious status and subsidies Norway 2022",
      "description": "The appeal by the Watchtower organization to keep their religious subsidies was denied on April 2022 which meant they lost roughly $1,778,793 in U.S. dollars in governmental support annually.  About $140 per member.   In March of 2023 all religious status was removed due to the disfellowshipping arrangement.\n\nThe organization was ordered pay to NOK 100,000 ($9,010 US dollars) in damages, NOK 512,063.50 ($46,902 US dollars) as expenses for the Court of Appeal case, and NOK 386,082 ($34,789 US) for the expenses before the District Court.  All paid through voluntary donations that were supposed to be used for the Worldwide preaching work.\n\nNorway state administers Decision \nhttps://a-jw.org/wp-content/uploads/2022/04/20220330LTI_no.pdf\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences. Catch up on my channel and follow for more!￼\n\nThank you!\n\nRose\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\nLink to the history of disfellowshipping - https://youtu.be/yAS5kH32P2I\nLink to 1980’s experiences of disfellowshipping;  https://youtu.be/ySFjNHxZsgw\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw",
      "release": "2022-04-23T04:59:02Z",
      "duration": "00:11:31",
      "explicit": false,
      "youTubeId": "-a5yE2PzVVk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-a5yE2PzVVk"
      }
    },
    {
      "id": "e9bc0f02-2c34-43d2-81ae-1bd4abc40b09",
      "title": "Fred Franz talk for Jehovah\u0027s Witnesses in 1966 regarding 1975",
      "description": "Governing Body member Fred Franz talk at the 1966 District Assembly regarding the new understanding regarding 1975 and the book that explained everything \u0022Life Everlasting in the Freedom of the Sons of God\u0022\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences. Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\n\nLink to Charles T Russell predictions;  https://youtu.be/QsfZCp9FftA\nSynopsis of Watchtower’s predictions over 150 years;  https://youtu.be/HKMaWmv_llo\n\n#jehovah #exjehovahwitness #exjehovahswitness #jehova #jehovahwitnesses #jehovahswitnesses #watchtower #exjehovahswitness #exjw #exjwsthink #jw #1975",
      "release": "2022-04-21T20:25:08Z",
      "duration": "00:15:38",
      "explicit": false,
      "youTubeId": "v7E714EGGIQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=v7E714EGGIQ"
      }
    },
    {
      "id": "3ed0ce20-e6a9-42ff-a33b-ae5f1bdb02b5",
      "title": "Rose here.  My vent about this new paradise they\u0027re spouting now",
      "description": "As one of Jehovah\u0027s Witnesses I was taught that we were going to walk into or wake up in this beautiful paradise. Over recent years the understanding of that Paradise has changed.  This was part of my process of deconstructing what I believed and beginning to use more critical thinking in what I was listening to\n\nAlso I think I might have had one two many glasses of wine.  I repeated myself so sorry about that.\n\n\nLink to my complete playlists: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one",
      "release": "2022-04-10T09:21:49Z",
      "duration": "00:14:05",
      "explicit": false,
      "youTubeId": "wBe01_1u8Q4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wBe01_1u8Q4"
      }
    },
    {
      "id": "946ea03e-ee76-430c-995d-a02b291c55e9",
      "title": "Rose here.  A trip down memory lane with my childhood bible book",
      "description": "As I was waking up from being one of Jehovah\u0027s Witnesses for over 50 years I had a lot of things come to mind.  These are some of my personal thoughts as I was dealing with my emotions and feelings.  My way of processing them at the time.\n\n\nHi! Welcome to my channel. I am a born in elders daughter, fifth generation. Follow my channel for the complete history of the Watchtower Bible and Tract Society as well as up to date commentary with what’s going on with the organization.  \n\nSometimes I even share my experiences. Like this video.  Catch up on my channel and follow for more!\n\nThank you!\n\nRose\n\nLink to my channel: https://youtube.com/channel/UCRKbc7PcKyz350FZHyjjF4A\nLink to Link to the Watchtower organizations publications since 1878 - https://jws-library.one\n\n\nLink to my circuit assembly building years;  https://youtu.be/ZmPNM4GzFFw",
      "release": "2022-04-06T02:41:08Z",
      "duration": "00:16:38",
      "explicit": false,
      "youTubeId": "1q3nuU-CCEY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1q3nuU-CCEY"
      }
    }
  ]
}