{
  "_ts": 0,
  "id": "90e8b20c-9ee3-4fde-bea2-d568293e9467",
  "name": "JWStruggle",
  "youTubeChannelId": "UCCLreH8z5nWXuytHdH15FkQ",
  "episodes": [
    {
      "id": "7a10e466-54e0-4b69-8b0f-e8490e1c0db8",
      "title": "Circuit Overseers or District Managers?",
      "description": "Successful franchises bring millions of dollars in profits to their corporations. The Watchtower Bible and Tract Society of Pennsylvania Inc. has become the virtual \u0022McDonald\u0027s\u0022 of religion when it comes to their business model.\n\nIn this video I discuss the similarities between the position that a District Manager does in a retail sales business and Circuit Overseers, the title given to paid clergymen for the Jehovah\u0027s Witnesses religion which is owned and controlled by Watchtower Inc. These full-time company men and their wives visit one local city/congregation of JWs after another, \u0022rousing and rallying the troops\u0022 as they say to stay loyal (and paying customers) to the Watchtower organization. They communicate and dictate directives to the managers (elders) of each individual congregation and ensure that WT policies are being carried out to the letter. They hire and fire new managers and assistant managers (Ministerial Servants) when making their rounds, and perform human relations duties as they settle disputes and contentions and monitor the flock by the authority given to them by the Governing Body of Jehovah\u0027s Witnesses.",
      "release": "2016-07-08T04:29:19Z",
      "duration": "00:11:01",
      "explicit": false,
      "youTubeId": "rbWKiK7ZNAs",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rbWKiK7ZNAs"
      }
    },
    {
      "id": "bca0d1f3-d954-4ade-908c-209e91fecbc5",
      "title": "A second JW Elder speaks out!  part 2 of 2",
      "description": "Our discussion with James continues. \n \n\n----- Descriptions from part 1 -----\nYet another active elder contacted me recently and requested to speak on \u0022The Struggle\u0022. We will call him James. When we first began this freewheeling interview (which was not scripted or planned as far as questions or topic) I asked James why he wanted to speak to an \u0027apostate\u0027, and this is what he said:\n\n\u0022It\u0027s important for active Witnesses to see that there are even those that have responsibilities in the congregation that have this conflict they are struggling with. \n\nIt\u0027s important for them  to hear from us, and to also understand that it\u0027s ok to have that conflict-  especially when it\u0027s justified which in the case of recent events* it absolutely is.\u0022\n\n*(The Australian Royal Commission investigation of the Watchtower Society and Jehovah\u0027s Witnesses)",
      "release": "2015-08-31T22:58:09Z",
      "duration": "00:45:28",
      "explicit": false,
      "youTubeId": "zHipLTEZmV4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zHipLTEZmV4"
      }
    },
    {
      "id": "60845e0f-c9ef-47e3-b821-548f0e2caa84",
      "title": "An active JW Elder speaks! Part 1",
      "description": "On this episode of The Struggle I interview Steve (not his real name) about how he woke up to The Truth About The Truth (TTATT) and how he plans to make his escape. To make matters more difficult, Steve is carefully navigating the waters of this transition with his asleep Jehovah\u0027s Witness wife, who has been a pioneer for almost 20 years.\n\nSteve discusses the lack of Bible study and \u0022Holy Spirit\u0022 to be found by the elders in his area, and how he woke up. The call was cut short due to him needing privacy as he cannot speak openly on the phone about what he has learned of the Watchtower Corporation\u0027s lies and deception.\n\nStay tuned for more as soon as we can Skype again for part 2!!!!\n\n\n---- NOTE ----\nSmall but annoying technical problems! Skype has decided to start putting ads sporadically along a sidebar while having a call, and it made a mess of my video, and caused me to spend hours instead of minutes in the editing process.  I have to blank out certain sections to protect Steve\u0027s identity and it caused some other technical issues.\n\n---- NOTE 2 ----\nAlso, more observant viewers will note that I have a new logo for my interview show and hope to transition to this name with a new opening in the near future. Thanks for all your loyal support and great suggestions on who to interview- keep it coming please fellow Strugglers!! Email me with your ideas and interview suggestions at:\nJWStruggle@gmail.com",
      "release": "2015-07-19T22:59:24Z",
      "duration": "00:32:54",
      "explicit": false,
      "youTubeId": "MDXnbdjT8rE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MDXnbdjT8rE"
      }
    },
    {
      "id": "8cda527e-7111-4b85-a458-200ecf9e5494",
      "title": "Apostasy Trial - Undercover spycam part 1",
      "description": "As many of you that visit this channel know, the Jehovah\u0027s Witness religion does not allow people to have freedom of thought and belief. If a person changes their viewpoint and questions the JW hierarchy and leadership then they will be sanctioned. If a member adopts an \u0022unacceptable\u0022 opinion or conviction and dares to speak of it, then the local religious leaders (called Elders) will come after them, using an iron fist in a velvet glove to bring them back in line. If that fails, then they will cut the person off and ostracize them before everyone, announcing them from a public pulpit as a satanic person, not fit for anyone in their club to associate with ever again.\n\nAnd so now, for only the second time in the history of the Internet, we have a front row seat (and a live video recording) of another \u0022Apostasy Trial\u0022 put on by the Jehovah\u0027s Witness religion. This two-hour meeting revolves around a man raised in the JW religion. His so-called sin is speaking out about the flaws and contradictions he has discovered through studious research into the religion of his birth. He is summoned to stand before a puritanical committee of three JW clergymen, without representation and without friends or witnesses to speak up in his behalf. \n\nThe Watchtower Corporation that controls this pseudo-religion does not want a stenographer, nor a camera, nor any other witnesses to this kangaroo court proceeding. They want no public record of what goes on. These three men act as judge, jury, and executioner and hold his \u0022everlasting life\u0022 in their hands. If found guilty, then he will be spiritually executed and stoned for his \u0022disobedient, rebellious acts\u0022 against the Watchtower organization\u0027s strict dogma.\n\nBut the silver lining is that nearly 100,000 people each year fade away or are kicked out of the controlling religion. Ironically, this grants them opportunity to pursue freedom and clarity of thought. Isaac is now yet another person that has been freed from the religious bondage to the Watchtower Bible and Tract Society of New York!\n\nThis video is part 1 of a multi-part series covering just one of the  thousands of these secret star chamber trials conducted by JW elders each year. We leave it to posterity and to each viewer to decide if these trials are appropriate and just.",
      "release": "2015-04-13T04:26:15Z",
      "duration": "00:37:42",
      "explicit": false,
      "youTubeId": "Se9rH6qUx0o",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Se9rH6qUx0o"
      }
    },
    {
      "id": "8c82f185-2cdc-4f35-b5c3-effc1e938ccb",
      "title": "Ricky G talks- \u0022A few months ago I was giving public talks!\u0022 part 1",
      "description": "This interview with Ricky Gonzalez has been anticipated by myself and many of us in the exJW community. In just the last few months, Ricky has endured much, and been persecuted to the hilt by the cult members of the JW.org religion for his beliefs.\n\nFive months ago (around memorial season in April of 2014) he was a Minsterial Servant in the Jehovah\u0027s Witnesses and he did research and learned The Truth About The Truth (#TTATT) and he went to his wife and others with what he had learned. His transparency was not unrewarded and the elders whisked him into the back room and he freely admitted that he had done independent research online at various sites. \n\nWhen he questioned them sincerely about what he had learned they quickly and cruelly attempted to bring him into line with the Governing Body slave masters \u0022Holy Writ\u0022 as transcribed in the pages of the Watchtower magazine. This is as most of you know their primary form of mind control over their customers oops I mean members.\n\nOne Elder played Junior G man and slid a stack of print outs over to him, as if he was being indicted and was in a scene in a bad movie. This \u0022brother\u0022 had copies of his emails, personal correspondence, comments on JWStruggle and other internet forums, etc. The \u0022smoking gun\u0022 this little manager of the Watchtower Corporations slid across the table made Ricky feel very upset, and understandably so.\n\nRicky details the meeting, his leaving the organization, and the difficult aftershocks that continue to ripple through his life in this fascinating interview. He talks about meeting the \u0022apostates\u0022 outside the Regional Convention, and the love and caring they showed him. He candidly talks about the harsh feelings his wife has shown him and how the marriage is now threatened simply due to him learning and sharing the knowledge of #TTATT. \n\nWhether we are Christian, agnostic, atheist or Buddhist, let\u0027s send prayers and good vibrations out to this brave man as he continues to fight the fine fight of the faith and stands up for truth. We all have a journey to walk when we grow up and free our minds. I can sincerely say that Ricky left a mark on me and I consider him a friend after this excellent Skype conversation.",
      "release": "2014-09-14T16:41:24Z",
      "duration": "00:48:55",
      "explicit": false,
      "youTubeId": "SpBi38W_Q48",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SpBi38W_Q48"
      }
    },
    {
      "id": "6e986630-86cc-4c03-b05f-c65b0c0d2b29",
      "title": "Interview With a Friend - Moving on after Watchtower",
      "description": "A good friend of mine and I talk about how he escaped from the Watchtower mindset after leaving the Jehovah\u0027s Witnesses religion. There are many that have been kicked out via disfellowshipment or have faded and become inactive yet still are held captive to the concepts and many erroneous teachings of the JW Governing Body leadership.\n\nAnd since leaving a cult is so traumatic and leaves such a lasting impression, some of us need more work to clear out the #WatchtowerCraziness than others do. Regardless of where we stand, if we have been in the clutches of a cult at some point in our life then we will have much to relate to and get out of this candid interview.\n\nWhat do you guys think? Should I do more interviews on my YT channel?\nLEMME KNOW!\n\n------------------------------------------------------------------------------\nDon\u0027t forget to subscribe to the JWStruggle channel! \nAnd you can follow me on Twitter at @JWStruggle for more breaking news on the twisted world of Watchtower.",
      "release": "2013-12-22T04:17:34Z",
      "duration": "00:25:40",
      "explicit": false,
      "youTubeId": "Ogmdi7FIDQA",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ogmdi7FIDQA"
      }
    },
    {
      "id": "527110a1-7292-49ac-9f61-2cfcfd315c6c",
      "title": "Apostasy Trial - Part 5 Jehovah\u0027s Witness judicial committee recorded",
      "description": "Part 4 covered the second 45 minute segment of my judicial committee meeting. After posting it, comments were received about how much leeway these brothers gave me, and how at least one of the elders seemed to be having a struggle himself with his beliefs. This may be only wishful thinking, but praying for these men and others like them is always a good thing. Christ sees their hearts, and can call anyone anytime out of the WT if it suits his will; we only need consider the account of Saul of Tarsus for proof of that. \n\nWe again resume the meeting, utilizing video still frames from the first 48 minutes to help visualize the scene. \n\n\nTopics covered include:\n\n• Our culture as JWs is based on works and it\u0027s not right\n• The vast majority don\u0027t deserve to be DFed and it is overly harsh\n• Armageddon is used by JWs like hellfire is used by some churches to control the people\n• The love inside JW congregations is not any different from other Christian groups\n• Charitable works were a large part of Jesus\u0027 and the apostles ministry- why doesn\u0027t WT do this?\n• Expressing doubts and opinions does not weaken but can strengthen Christians\n• Oral sex discussed in WT- why? \n• Letter to the elders re how some porn is not as bad as other kinds of porn- is that scriptural?\n• Anonymous elders post all the secret correspondence from JW.org and the GB\n• Carl Olaf Jonsson and what he discovered about 607\n• WT was a member of the UN for ten years\n• Many JWs are terrified to google anything that is not WT approved\n• Transfusions of cow\u0027s blood is ok- why?\n\n-------------------------------------\nA one-year update on what\u0027s been happening with me, as well as a full transcript of this meeting is here:\n\nhttp://www.jwstruggle.com/2013/10/one-year-since-my-judicial-committee/\n\n-------------------------\nFollow me on Twitter at @JWStruggle for more breaking news in the twisted world of Watchtower!",
      "release": "2012-09-28T02:53:58Z",
      "duration": "00:46:19",
      "explicit": false,
      "youTubeId": "Ee0tbSJ6gg8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ee0tbSJ6gg8"
      }
    },
    {
      "id": "1f28017c-46e8-4100-96d4-cb0d9be8b545",
      "title": "Apostasy Trial - Part 4 Jehovah\u0027s Witness judicial committee recorded",
      "description": "Part 3 covered the first 48 minutes of my judicial meeting with the elders. The entire meeting was around three hours, which is quite long for one these trials. In my opinion, these elders were truly attempting to \u0022save their brother\u0022 and for that I am grateful to them. My intention remained the same: To let my light shine, encourage others to stand up for Truth, and to perhaps reach one of them with TTATT.\n\nWe now resume the meeting, utilizing still frames from Part 3 to help visualize the scene. The audio recording will now be played back from where the last video left off.\n\n-------------------------------------------------------------\nTopics covered include:\n\n• Do I believe in the Faithful and Discreet Slave?\n• McCarthyism and loyalty questions\n• The elders have taken an oath to uphold the WT Organization \n• Can JWs have differing opinions?\n• The baptismal questions and how they were changed in 1985\n• The Organization has become a \u0022golden calf\u0022 \n• Is Jesus your mediator? Or the faithful slave?\n• We need is a relationship with God and Christ according to scripture, not to men\n• God\u0027s \u0022org\u0022 back in ancient times told all to worship the baals- would we have followed the organization blindly if we lived then?\n• Jesus was disfellowshipped\n• Who was God using in the 1400s? The 1500s? The 1600s?\n• There are thousands of dissident JWs that pray for change\n• Organ transplants were \u0022cannabalism\u0022 for decades- was that Holy Spirit that directed that?\n• Is the WT inspired?\n• Martin Luther, William Tyndale and others stood up to the Catholic church due to conscience\n\n-------------------------------------\nA one-year update on what\u0027s been happening with me, as well as a full transcript of this meeting is here:\n\nhttp://www.jwstruggle.com/2013/10/one-year-since-my-judicial-committee/\n\n\n-------------------------------------\nFollow me on Twitter at @JWStruggle for more breaking news in the twisted world of Watchtower!",
      "release": "2012-09-26T00:31:13Z",
      "duration": "00:47:05",
      "explicit": false,
      "youTubeId": "7zcvocGamQg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7zcvocGamQg"
      }
    },
    {
      "id": "6d3e6417-8e19-4cea-bfc9-f73b0f73c8a6",
      "title": "Apostasy Trial - Part 3 Jehovah\u0027s Witness judicial committee recorded",
      "description": "The purpose of this video is to shine a light on truth, and a light on the secret rules and practices of Jehovah\u0027s Witnesses. You will not find this information on JW.org. What goes on during a judicial committee meeting, when an accused person is brought before the local elders to be judged? This is the first opportunity that I know of for someone to see it happen firsthand, short of violating one of the rules of the JW congregation and getting called before the elders themselves!\n\n(NOTE: Wear earphones while listening if at all  possible. Due to low voices, normal computer speakers will not amplify some words properly, but with headphones every word is clearly decipherable.)\n\nI found out in early 2010 (the video intro says \u0022late\u0022 2010 that\u0027s a typo) that there are some serious problems within the Jehovah\u0027s Witness organization. It led me to study and research for literally thousands of hours what my beliefs are, what the history of the Jehovah\u0027s Witness movement is, and what multiple translations of the Bible says on dozens of Christian doctrines. For the first time in my life I researched ALL the available facts, not just the carefully prepared and selected information I had been exposed to through the Watchtower magazine and its publications for so many years.\n\nI encourage all to watch this video, whether a member of the Jehovah\u0027s Witnesses or not. It shows the chilling side of star-chamber judgment, even when good intentions are evident. As humans we need checks and balances. We need transparency to temper our justice. And whenever one or more men set themselves up as kings and consciences over others, then danger and abuses can become rampant.\n\nWhat happened to me in this case is of little consequence. I feel this is bigger than that. This issue is more important than any one of us that was in that room. It affects tens of millions of people, from all around the globe right now. Jehovah\u0027s Witnesses are mentally trapped in a movement that suppresses critical thinking and individuality. They are for the most part sincere, and all-around \u0022nice people\u0022 in my personal experience. But the vast majority do not have a relationship with Christ, and have substituted their leadership (The men of the Governing Body) in his place as their mediator between them and God. \n\nI would also like to state that the purpose of this video is NOT to humiliate the men conducting this meeting with me. Despite it all, I still consider them friends. I respect them as fellow worshippers of God, even if they did disfellowship (excommunicate) me unjustly. They have been misled by the Watchtower Society and its many corporations. \n\nMy prayer is that this series of videos (spanning over three hours) will encourage, enlighten, and benefit as many people as possible.\n\n-----------------------------------------------------\nTopics covered include:\n\n• Accusations against me are still unknown. Who was offended by me is still unknown\n• I was told that I would never get out of high school. That I would never grow old in this system\n• Russell would be DFed if alive today\n• The organization has a serious problem with dissident Jehovah\u0027s Witnesses\n• Anonymous elders are posting secret correspondence and information online- what does that mean? \n•After the memorial thousands partake of the bread and wine at home- why?\n• Elders make a vow to support the faithful and discreet slave\n• There\u0027s a problem with legalism and judgmentalism in the Organization\n• Discussion of of 1 Corinthians 4:3-6 re: human tribunals\n• Who decides which fraction of blood we can take and which we cannot?\n• Jeremiah preached to his own people because the leaders had apostasized\n• Reading a slip of paper about me from the platform does not mean God has DFed me \n• New Governing Body member Sanderson is only 47 and he partakes- is he mentally unbalanced?\n\n\n\n-------------------------------------\nA one-year update on what\u0027s been happening with me, as well as a full transcript of this meeting is here:\n\nhttp://www.jwstruggle.com/2013/10/one-year-since-my-judicial-committee/\n\n-------------------------------------\nFollow me on Twitter at @JWStruggle for more breaking news in the twisted world of Watchtower!",
      "release": "2012-09-22T16:09:49Z",
      "duration": "00:48:02",
      "explicit": false,
      "youTubeId": "QDdcFQZNwJ4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QDdcFQZNwJ4"
      }
    },
    {
      "id": "f1acd521-605d-4cc4-9244-d2b55fd62594",
      "title": "Apostasy Trial - Part 2 Jehovah\u0027s Witness judicial committee before the meeting",
      "description": "This was recorded shortly before I was to appear before the three-elder tribunal. (1 Cor 4:2-6)  In part one I talked about receiving a certified letter \u0022inviting me\u0022 to appear before the elders under the accusation of spreading apostate teachings.\n \nI have been overwhelmed by the positive responses received by my friends locally and the online community about my upcoming judicial proceeding and how I have decided to document it and let my light shine.\n\nMy \u0022spiritual stoning\u0022 will be recorded and preserved for posterity. Not with the purpose of glorifying myself, not to try and rescue these elders from the WT enslavement either. (Although that would be wonderful if it happened!) \n\nI am going through this stressful meeting so that the awakening JWs of the \u0022conscious class\u0022 can be encouraged and empowered, and that those former Witnesses that are hurting can be reaffirmed and upbuilt to see that their situation apart from the Watchtower movement is a better one.My goal is not to humiliate these men, and indeed, the whole issue is bigger than them or me. \n\nI plan to record the main meeting in two ways- by an audio recorder in my pocket, and a video recorder embedded on my person.  I\u0027m not sure if the video recording will work, but I am going to try, as a judicial meeting of this kind has never been filmed before as far as I know.\n\nSo this clip is part 2, and takes place right before I met with them for the meeting.  I plan to release \u0022Apostate Trial - Part 3\u0022 and possibly parts 4, 5, etc. depending upon how long they allow me to speak as soon as possible thereafter.\n\nThese kinds of proceedings depend greatly on the individual identities of the three elders handling the case. Some would shut me down quite rapidly and be harsh about doing so. Other elders would try but defer if voices were raised or myself (the accused) is persistent and/or persuasive enough to verbally wrangle with them. How much time will they give me? Will I be allowed to really shine my light and give a witness about \u0022The Truth About The Truth\u0022? ...I don\u0027t know but am determined to try.\n \nI pray I am up to the task. I will do my best; and that\u0027s all any of us can do!\n\n\nhttp://www.jwstruggle.com/2013/10/one-year-since-my-judicial-committee/\n\n\n-------------------------------------\nA one-year update on what\u0027s been happening with me, as well as a full transcript of this meeting is here:\n\nhttp://www.jwstruggle.com/2013/10/one-year-since-my-judicial-committee/\n\n\n-------------------------------------\nFollow me on Twitter at @JWStruggle for more breaking news in the twisted world of Watchtower!",
      "release": "2012-09-16T09:16:33Z",
      "duration": "00:14:19",
      "explicit": false,
      "youTubeId": "o-9ub7yeAB8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=o-9ub7yeAB8"
      }
    },
    {
      "id": "f96d2e78-fb54-4b4a-812c-6ed77e7abaa1",
      "title": "Apostasy Trial - Part 1 Jehovah\u0027s Witness judicial committee before the meeting",
      "description": "The elders sent me a letter summoning me to a judicial committee in August of 2012, accusing me of \u0022spreading apostate teachings that go against Bible truth as taught by Jehovah\u0027s Witnesses.\u0022 For those of you that are in the know, this means that they have already determined that I am guilty of the above mentioned \u0022crime\u0022. The letter was sent certified mail, and when I received it I signed and printed \u0022Martin Luther\u0022 on the return receipt. I wrote back and asked for a date one week later as I could not make the 8/30 day they had ordained for my spiritual stoning.\n\nA continuance was granted and I was given a tentative date of 9/12/2012 so we will see what happens. I am not afraid of this meeting, however it is not something that I relish either. I personally feel it must be done as my conscience will not allow me otherwise. The early Christians were fed to the lions and Yeshua said that if we confessed him as Christ we would be persecuted and delivered up before the synagogue and expelled. (John 16:1-4)\n\nIn Christ,\nEric, aka \u0022JJ\u0022\n\n \nP.S.\nThis is the first video I am releasing where I appear on camera. More will follow though, as it seems natural enough. Initially I even disguised my voice as it is quite recognizable to many thousands of JWs that have heard me speak at Circuit and District Conventions and Kingdom Halls all over Central California. After a couple of those I felt silly doing this and so stopped distorting my voice.\n\nIronically that never did get me discovered. I made the mistake of sharing with a few close family members and friends TTATT and that is ultimately what got back to the elder\u0027s ears. I knew that was the risk I took, but I did it to try and help these ones that I care so much about to wake up to the truth about this mind-controlling organization. I wonder when JW.org will begin to allow a free flow of information and questions to be asked? As of this date, you cannot even send an email and ask a Bible-based question at this \u0022official site of Jehovah\u0027s Witnesses\u0022, JW.org!\n\nPerhaps it did not help these ones (only time will tell though), but my prayers are that www.JWStruggle.com and these YouTube will videos encourage others to get out of the WT Society and ...free ...their ...minds!\n\n\n-------------------------------------\nA one-year update on what\u0027s been happening with me, as well as a full transcript of this meeting is here:\n\nhttp://www.jwstruggle.com/2013/10/one-year-since-my-judicial-committee/\n\n\n-------------------------------------\nFollow me on Twitter at @JWStruggle for more breaking news in the twisted world of Watchtower!",
      "release": "2012-09-06T18:45:43Z",
      "duration": "00:09:00",
      "explicit": false,
      "youTubeId": "imXHdRRONxc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=imXHdRRONxc"
      }
    }
  ]
}