{
  "id": "9e2d3c6d-e967-463a-b086-39289e0269e9",
  "name": "Katherine Lizardo, Esq.",
  "youTubeChannelId": "UCuFQss8CTxsMtXbhuWWF8PA",
  "episodes": [
    {
      "id": "10b6bdbc-d2a3-4c1d-8b5f-41419b0ccd44",
      "title": "Doomsday Cult Prophet Trial: Detective Mattingly Speaks with Defendant\u0027s Daughter Emma Murray",
      "description": "ID v. Chad Daybell - 55-year-old defendant Chad Daybell faces the Death Penalty if convicted of three counts of first-degree murder. He is accused of killing his former wife Tammy, and his current wife\u0027s two children: 16-year-old Tylee Ryan and 7-year-old Joshua \u0027\u0027JJ\u0027\u0027 Vallow. Chad and Lori Daybell appear to have been convinced that the end of times was approaching and that dark spirits were taking over the souls of various people in their lives. They purportedly believed that the dark spirits were turning people into zombies and that they needed to \u0022eliminate,\u0022 or kill those people to save their souls. His trial is slated to last ten weeks. In her separate trial, Lori Vallow Daybell has been convicted and sentenced to life in prison without parole in the deaths of her two children and for conspiring to murder her husband\u0027s previous wife (Tammy)\n\n***All content in this video is intended for purposes of news reporting and commentary only.***\n\n► Watch the full video on Law \u0026 Crime website: https://www.youtube.com/@UCz8K1occVvDTYDfFo7N5EZw\n\n► Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCuFQss8CTxsMtXbhuWWF8PA/join\n\n-----------------------------------------------------------------------------\n\nKatherine Lizardo, Esq. is a regular Legal Analyst for Law \u0026 Crime Network every Friday. She has been quoted as an expert in notable media outlets and has over 19 years of legal experience. She is licensed to practice law in Texas and California.\n\nKatherine\u0027s passion is her mission-driven company called ADHD Life Simplified, which supports moms with ADHD in embracing their ADHD so they can navigate their neurodiversity in motherhood with compassion. This mission is personal; Katherine and her son have ADHD.\n\nA thriving ADHD Mom of 2 boys, bestselling author, TEDx and inspirational speaker, accomplished bilingual immigrant, and Creator of the no-shame, no-stigma online community called ADHD Simplifiers, Katherine simplifies ADHD for ADHD moms so they can find peace \u0026 confidence.\n\nHer work has been featured on ABC, CBS, FOX, NBC, New York Post, Texas Business Times, The Philippine Tribune, Asian Pacific Culture News, Law \u0026 Crime Trial Network, Manila News Journal, and more!\n\n💞 For in-depth discussions with Katherine, connect with her at ADHD Simplifiers: https://www.skool.com/adhdlifesimplified/about\n\n🧠 To learn more about Katherine, visit https://www.adhdlifesimplified.com/speakerpage\n\n📲 Follow her on social media @ADHDLifeSimplified\n\n🔴 Watch Katherine’s TEDx Talk here:\nhttps://www.adhdlifesimplified.com/speakerpage\n\n📣 Disclaimer: I’m required by my Lawyer Code of Ethics to say this. Although I am a lawyer by profession, I am NOT your lawyer. No attorney-client relationship is established with you in any way. This video and the ideas presented in it are for entertainment purposes only and should not be considered legal advice.\n\n-------------------------------------------------------------------------------------\n\n✨ LET’S CONNECT! Follow me on social media 👇\n\n❤️ TikTok: https://www.tiktok.com/@adhdlifesimplified \n\n🧡 YouTube: https://www.youtube.com/@ADHD_LifeSimplified \n\n💛 X: https://twitter.com/ADHDLifeSimpli\n\n💚 Instagram: https://www.instagram.com/adhdlifesimplified/\n\n💙 Facebook: https://www.facebook.com/adhdlifesimplified\n\n💜 LinkedIn: https://www.linkedin.com/in/katherine-lizardo-esq/\n\n🩷 Pinterest: https://www.pinterest.ph/ADHDLifeSimplified/\n\n🩶 Website: https://www.adhdlifesimplified.com/speakerpage\n\n----------------------------------------------------------------------------------\n\n🙏THANKS FOR WATCHING!!!! 🙏",
      "release": "2024-05-27T09:03:10Z",
      "duration": "00:09:26",
      "explicit": false,
      "youTubeId": "dDC943CIDj8",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dDC943CIDj8"
      }
    }
  ]
}