{
  "id": "26f79e9e-4762-4b3f-a4a3-f2bcb041a572",
  "name": "Kayamisi",
  "youTubeChannelId": "UC096syT2BgZamIcknBhWh8w",
  "episodes": [
    {
      "id": "138af9e7-f75c-4b25-81ea-db6d78c6e8f7",
      "title": "Two Sisters Raised In Cult School (Our Story)",
      "description": "My sister and I retell our story of being raised from a young age in a live-in cult school and share our thoughts about it in hindsight. This school indoctrinated us with the teachings of the Unification Church movement. This video was made from a place of compassion and love for Unification Church members and to give them a message of hope that is found in the message of the gospel. \n\nLink to my testimony: https://youtu.be/c8v32Icfic8?si=EH32NNDDhmN5rzxs",
      "release": "2024-02-19T01:27:53Z",
      "duration": "01:21:57",
      "explicit": false,
      "youTubeId": "r0ElaZ4cX0w",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=r0ElaZ4cX0w"
      }
    },
    {
      "id": "a0638a4e-d174-41c0-b891-dbb4dd871e96",
      "title": "From Korean Cult to the real Jesus",
      "description": "Here\u0027s a link to my sister\u0027s testimony: https://youtu.be/KPailZfdBQw \n\nIn this video, I briefly review my life\u0027s journey to finally finding the truth that is Jesus Christ. I was a broken, confused, and lost person who was set free by the transforming power of Christ...the real Jesus not the one I was taught about in the Korean cult aka Unification Church I was raised in. This upbringing led me to a path of depression, confusion, and addiction. If you are a member of this cult otherwise known as the Unification Church and have questions I would tell you there is a reason for your doubt and to lean into those questions with everything you have in you. I pray this video speaks to you by way of the Holy Spirit and He can move you to cry out to Him to break the chains of being a slave to sin.\n\n I did not create this video to attack, criticize, or show hate for anyone. I did this because as a follower of Christ, I am to obey His word as He tells me in the bible to expose the darkness and deception in this world in whatever form it may take.  Ephesians 5:11 \u0022Have no fellowship with the fruitless deeds of darkness, but rather expose them.\u0022\n\nEdit: Just to clarify when I say \u0022completed testament\u0022 I am referring to the views of Unification church members NOT me or any other bible believing Christian.",
      "release": "2023-03-03T00:00:32Z",
      "duration": "00:18:31",
      "explicit": false,
      "youTubeId": "c8v32Icfic8",
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=c8v32Icfic8"
      }
    }
  ]
}