{
  "id": "7aad54e2-0a1b-4664-9e85-ee586f3e5615",
  "name": "Keep Calm Mother On! with Christy Thomas",
  "spotifyId": "69aunX4J8vIRR0TbB8BHa5",
  "appleId": 1441790418,
  "youTubeChannelId": "UCuPvNbpYJSTNcpSRzMdNNsQ",
  "episodes": [
    {
      "id": "4eeb9673-e6cf-49c3-8869-9f3213c710e1",
      "title": "384. Tia Levings on Mothering",
      "description": "384. Tia Levings on Mothering I have been waiting years for this one. I met Tia in 2016 at BraveWriter homeschool conference. Since then our friendship has developed and I count her as a mentor in my circle of trust. I am so excited that this episode means her memoir is out in the world and it is a NEW YORK TIMES BEST SELLER. Purchase it here: https://a.co/d/2kkE7tK (affiliate link) Tia Levings grew up in a Southern Baptist megachurch, was recruited into fundamentalism by mentors following Bill Gothard\u0027s IBLP (Institute of Basic Life Principles), and eventually landed in a high control group (cult) that taught Federalist Marriage: the idea that husbands are responsible for their wives before God, and so are accountable to lead and discipline them as children. She was excommunicated and formally shunned in 2007 and narrowly escaped that violent marriage with her 4 children later that year. She started trauma therapy for CPTSD in 2008. Today she\u0027s an author \u0026 advocate who supports survivors of religious trauma and educates on the abuses in Christian Fundamentalism. Tia believes that how the fundamentalists run their homes is how they want run the country ––and that\u0027s why it\u0027s vital to understand what it\u0027s really like to live that way. https://www.instagram.com/tialevingswriter Facebook --Tia Levings The Anti-Fundamentalist | Tia Levings | Substack A Well-Trained Wife: My Escape from Christian Patriarchy. Coming August 6th, 2024 - TIA LEVINGS Self-Care: Sit down on the ground Family Fun: Internatinal group chat of family members on WhatsApp You\u0027re The Right Mom For Your Kids: Bite Size Pep Talks Just For You by Christy Thomas Want to try a coaching call-- sign up for a free 30-minute call: https://calendly.com/christythomas/exploratory-call-free Find me on Instagram: Christy Thomas — Coach for Exhausted Moms (@everyday_christy) • Instagram photos and videos . Don\u0027t forget to leave a rating or review. Email me Play4life.Christy@gmail.com Don\u0027t hesitate to reach out for coaching with Christy: Coaching (christythomascoaching.com)",
      "release": "2024-08-30T04:00:00Z",
      "duration": "00:41:00",
      "explicit": false,
      "spotifyId": "1n7mnQT1dGdzNnJGGvlorb",
      "appleId": 1000667230229,
      "youTubeId": "wIk0JPCmRvo",
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1n7mnQT1dGdzNnJGGvlorb",
        "apple": "https://podcasts.apple.com/podcast/384-tia-levings-on-mothering/id1441790418?i=1000667230229",
        "youtube": "https://www.youtube.com/watch?v=wIk0JPCmRvo"
      }
    }
  ]
}