{
  "_ts": 0,
  "id": "254b0384-cfe0-435f-9e0e-9a0c6199f1c4",
  "name": "Kelli Copter",
  "youTubeChannelId": "UC6q1t92tB_nPPWkW76Gzeww",
  "episodes": [
    {
      "id": "5d96890f-662a-4711-95f4-98794baa1246",
      "title": "Scientology\u0026#39;s Evil Disconnection Policy - Phil Jones",
      "description": "#Cults often isolate their members by enforcing disconnection with non-believers. Scientology is a cult that literally has an ACTUAL policy of doing just that. Phil Jones lost contact with his children over a decade ago, they are part of Scientology\u0027s Sea Organisation. Phil continues to speak out against Scientology abuses with the hope of reconnecting with his children. \n#ScientolologyDisconnection #cultawareness \n\nSubscribe to Phil at @phildoggo and check out his videos for even more stories of his experiences in Scientology. \n\n📡 Under the Radar / Need help leaving Scientology? These charities were set up to help people like you! \nhttps://sptvfoundation.org/   \nhttps://www.theaftermathfoundation.org/ \n\n🎙️ Have you been involved with a high control group/ cult or MLM? If you\u0027d like to share your story on this channel, please fill in the google form here: \nhttps://forms.gle/SxDyoSdXP2138S1v6\n\n🚁 Channel memberships! Join my amazing propellers for members-only perks! \nhttps://www.youtube.com/channel/UC6q1t92tB_nPPWkW76Gzeww/join\n\n📸 Social Media \nhttps://linktr.ee/kellicopter \n\nVideo Chapters:\n0:00 A Family Shattered: The Pain of Disconnection - Introduction to Phil Jones and the   devastating impact of Scientology\u0027s disconnection policy on his life.\n1:10 From Believer to Outcast: A Journey of Disillusionment - Phil\u0027s 40-year journey in Scientology, from devoted member to outspoken critic.\n3:15 The Facebook Police, OSA - How Scientology\u0027s control extends to personal relationships and the consequences of defiance.\n6:51 Disconnected: The Brutal Reality - The swift and devastating consequences of being declared \u0022suppressive\u0022 and losing all contact with loved ones.\n11:47 Scientology\u0027s School of Conformity - Examining the role of Scientology schools in indoctrinating children and grooming them for the Sea Org.\n16:35 Close Calls and the Billboard That Rocked the World - Phil\u0027s brushes with Scientology\u0027s disciplinary system and the birth of the \u0022Call Me\u0022 campaign.\n21:15 Protests, TV Shows, and a Desperate Fight for Recognition - Phil\u0027s relentless efforts to reach his children and expose Scientology\u0027s practices.\n26:33 From $70 to Thousands: The Power of Collective Action - How the \u0022Call Me\u0022 campaign became a symbol of hope for Disconnected Families.\n33:28 The Uncertain Future and the Fight Continues - Phil\u0027s reflections on his journey, the challenges ahead, and his hopes for the future.\n38:26 United We Stand: The Power of Protest and Online Activism - Phil\u0027s perspective on the growing movement against Scientology and the importance of unity.\n47:55 The Unfathomable: Disconnecting from Family and Investing in Scientology - Exploring the mindset behind Scientology\u0027s disconnection policy and the financial burden it places on members.\n58:05 Mentally Out, Physically In: The Under the Radar Struggle - Describing the difficult reality of those still trapped within Scientology and Phil\u0027s own journey to freedom.",
      "release": "2025-02-23T14:30:06Z",
      "duration": "01:26:07",
      "explicit": false,
      "youTubeId": "rnlHSuk_Ens",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rnlHSuk_Ens"
      }
    },
    {
      "id": "e00dec8b-80c5-4c50-afed-4f8ec27a89c5",
      "title": "\u0022Cult Hunter\u0022: The Journalist Who Exposed a Hidden Alaskan Cult",
      "description": "\u0022Five years. That\u0027s how long journalist @syranwarner  has been documenting the activities of the controversial Alaskan cult, \u0027The Body.\u0027  I was fortunate enough to interview him about his experiences. He is a fantastic journalist and documentarian. Please go and check out his awesome channel here :\n\n@syranwarner \n\nCheck out his documentary on \u0022The Body\u0022 cult \n: https://youtu.be/57xSVk8BOxs?si=HDvrIojlHAWOIDXb\nInstagram \nhttps://www.instagram.com/freemelissaparker/\nTikTok \nhttps://www.tiktok.com/@syranwarner?lang=en\n\n\nThank you to the members of this channel! Your support is greatly appreciated. \nJoin this channel to get access to perks:\nhttps://www.youtube.com/channel/UC6q1t92tB_nPPWkW76Gzeww/join\n\nhttps://linktr.ee/kellicopter",
      "release": "2025-02-16T14:00:06Z",
      "duration": "01:00:55",
      "explicit": false,
      "youTubeId": "48Kz8ZYFeA0",
      "subjects": [
        "Marc Bisset",
        "Profundity Yours",
        "Scientology",
        "EDUCO"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=48Kz8ZYFeA0"
      }
    },
    {
      "id": "ad40d9f9-4f3a-4c39-b2e4-42370cfe000c",
      "title": "My Last Conversation with Doug Kramer | Scientology and Hollywood",
      "description": "This never-before-seen interview was filmed in November 2023. It is my last conversation with my friend Doug Kramer before he passed away less than a month later Initially, I wasn\u0027t sure if I would ever share this with you all because I couldn\u0027t bring myself to watch the interview until very recently. Doug had so much wisdom to share, even in this casual setting. \n\nI find myself feeling envious of the blissful ignorance we both had, not realising that this would be our final conversation. We discussed Hollywood and how Scientology recruits young actors who are trying to make it in the industry.\n@dbnc \n\n\nJoin this channel to get access to the perks:\nhttps://www.youtube.com/channel/UC6q1t92tB_nPPWkW76Gzeww/join\n\nhttps://linktr.ee/kellicopter",
      "release": "2025-02-02T11:00:06Z",
      "duration": "01:16:22",
      "explicit": false,
      "youTubeId": "dR7J7UBlmOw",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dR7J7UBlmOw"
      }
    },
    {
      "id": "e29d4b82-c5fb-4689-bf2f-a69addcd2a10",
      "title": "When Scientology Kids Grow Up.- Bianca Larsson Lanciai",
      "description": "When Scientology kids grow up. The organisation did not consider that those same kids would use their voices to expose what happened to them. Bianca Larsson Lanciai was introduced to Scientology at just 2 years old after her parents joined the sea organisation, she too would sign her billion year contract as a child and resort to desperate measures to escape. \n\nJoin me in this interview as Bianca shares her story. #NoMoreKidsInScientology #scientology #cults \n\nWanna see your name in the credits and have access to exclusive content? Become a member today! https://www.youtube.com/channel/UC6q1t92tB_nPPWkW76Gzeww/join\n\nSocials and Contact details: \nhttps://linktr.ee/kellicopter\n\nMedia referenced\nScientology Flag Spiritual Headquarters in Florida \nhttps://www.youtube.com/watch?v=W3MBY5jot7o\n\nhttps://youtu.be/HugowvI4vqw?si=kh-dv6grE-biB4aY Bare Britain Audits \n\nhttps://youtube.com/shorts/Djy0x62NoHk?si=oYsJFmw1DNgA_0px Scientology Audit \n\nhttps://www.tampabay.com/gallery/2019/10/20/slideshow-all-the-church-of-scientologys-buildings-in-pinellas-county/. The Yatchsman\n\nhttps://youtu.be/qFaUhLkdRPg?si=x9hRcla_LLYVn-bF mannequin challenge Bailey fisher \n\nhttps://youtu.be/wsTibwLgSm0?si=pcAMINvsRREMfo2k Scientology Assists \n\nWake up call \nhttps://file.wikileaks.org/file/ign-bulletin-44-wake-up-call.pdf\n\nSong : Hush You - Velvet Moon",
      "release": "2024-01-07T23:00:09Z",
      "duration": "01:40:37",
      "explicit": false,
      "youTubeId": "WPlbLPv4_nY",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WPlbLPv4_nY"
      }
    },
    {
      "id": "7135dbb4-ae9a-4df1-ab68-7f85f0ea3a73",
      "title": "Leaving Scientology With The Man Who Made it Famous | Jeff Hawkins",
      "description": "Today I am joined by the wonderful Jeff Hawkins who recounts his journey of leaving Scientology after creating an advertising campaign that put Scientology on the map. We discuss the abuse he suffered at the hands of David Miscavige  and how Jeff has approached recovery since leaving the Cult. \n\nYou can buy Jeff\u0027s books here :\n\nCounterfeit Dreams \nhttps://www.amazon.co.uk/Counterfeit-Dreams-Journey-Church-Scientology/dp/0615375642\n\nLeaving Scientology \nhttps://www.amazon.co.uk/Leaving-Scientology-Practical-Escape-Recovery-ebook/dp/B0089SHGJI\n\nClosing Minds \nhttps://www.amazon.co.uk/Closing-Minds-Scientologys-Technology-Control-ebook/dp/B00TQEJ8EU\n\nMy links and contact \nhttps://linktr.ee/kellicopter",
      "release": "2023-10-08T13:54:57Z",
      "duration": "00:50:14",
      "explicit": false,
      "youTubeId": "Ic7ZJ42Ys68",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ic7ZJ42Ys68"
      }
    },
    {
      "id": "2e74b907-efc4-468c-ab19-056d38e560b4",
      "title": "1 year ago I made a film about Scientology, here\u0027s what\u0027s happened since.",
      "description": "I can\u0027t believe it\u0027s been a whole year since my Scientology series! Hello to my new subscribers this is just a Life Update of what has happened since then. I also will be letting you know what my ideas are for the channel going forward. please let me know if you have questions or any topics you would like me to cover in future videos! Let\u0027s go! 🚁\n\nLinks\n\nhttps://youtu.be/LvJB7XfkAWk my mysterious phone call!\n\nScientology Iceberg Series \n\nhttps://youtube.com/playlist?list=PLNpyq1BMZqyLL8yZ3KPt5RIEyjg4Lkrdf\n\nChannels I mention in this video - Go check them out and subscribe! \n\n@GrowingUpInScientology \n@AndrewGold1\n@blownforgood \n@apostatealex",
      "release": "2023-04-10T19:44:19Z",
      "duration": "00:10:05",
      "explicit": false,
      "youTubeId": "1R9PCkCO16A",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1R9PCkCO16A"
      }
    },
    {
      "id": "42f3692e-a607-46f2-8f9c-3fb2b645a390",
      "title": "I Answered The Call From Scientology...Here’s the Mystery 👀",
      "description": "#ThechurchofScientology called me yesterday and left me with a #mystery. what do you guys think? \n\n\nThank you for all the new subscribers we hit 3000 today can\u0027t believe it! let me know what videos you would like to see next 🫶🚁 \n\nI\u0027ve made this video with the interest of protecting the public and the Prevention/ detection of crime or fraud.\n\n\nFor help leaving Scientology please visit https://theaftermathfoundation.org\n\n\n\nTo see my other Scientology videos you can check out this playlist \n\nScientology Iceberg Explained\nhttps://www.youtube.com/playlist?list=PLNpyq1BMZqyLL8yZ3KPt5RIEyjg4Lkrdf\n \n#scientologycalled #kellicopter #scientologymystery #scientologytracking #scientologyrecovery #cos #scientologyfairgame",
      "release": "2023-04-01T22:11:24Z",
      "duration": "00:13:06",
      "explicit": false,
      "youTubeId": "LvJB7XfkAWk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LvJB7XfkAWk"
      }
    },
    {
      "id": "7b031af8-422b-42c2-a301-63164ed909bc",
      "title": "I took the Scientology Personality Test so you don’t have to.",
      "description": "I took a Scientology personality test! Online…so you don’t have to. I filmed the results in case you are curious like me 😉 Please be aware that if you take this test they will be phoning you and they will be trying to sell you a course. I personally think these tests are quite degrading and I believe they could be dangerous if used to manipulate vulnerable people. \n\nI am currently editing episode 3 of the Scientology iceberg series  thank you for the support I have recieved!  if you haven’t see it yet you can watch part 1 and 2 here: \n\nhttps://youtu.be/4hLHLmUa4qI - Scientology Iceberg explained Part 1: My story. The 6 year old SP\n\nhttps://youtu.be/Vvbe4WBrCWU - Scientology Iceberg explained Part 2: The Tip ( Celebrities front groups and money!) \n\nI grew up in Scientology, now we are taking a look at what this multi billion dollar organisation is really all about. I thought this needed it’s own moment. Many people take the test, for a joke, for fun or because they are seeking help. By all means if you want to do it. Go ahead but I thought it would be in the interest of the public to see an example of the results you might get. \n\nThe aim of these tests are to get you to pay for books, courses and even DVD’s. Be aware and be careful ❤️",
      "release": "2021-07-14T18:21:07Z",
      "duration": "00:04:40",
      "explicit": false,
      "youTubeId": "tc03EnCvwj4",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tc03EnCvwj4"
      }
    }
  ]
}