{
  "id": "838e7bd5-7455-4781-ac05-0e396bb0e6fe",
  "name": "Ken Cook Is Having Another Episode",
  "spotifyId": "5bfloMW0WJnEeQYHxqnbw0",
  "appleId": 1735379217,
  "youTubeChannelId": "UC0HuASskjV3jhgj2ONLc8VA",
  "episodes": [
    {
      "id": "7c54f2db-ee19-4709-870f-78a6a0b5086d",
      "title": "Cult-like thinking in America",
      "description": "Are you susceptible to cult-like thinking? According to author Jane Borden, everyone might be, especially Americans. In today’s episode, Jane talks with Ken about how the Pilgrims and Puritans essentially founded America as a \u0022high-control doomsday group\u0022 and that those patterns never went away. In her book, \u0022Cults Like Us: Why Doomsday Thinking Drives America,\u0022 Jane identifies the warning signs: worship of a charismatic leader who can\u0027t be criticized, apocalyptic crisis narratives, conspiratorial thinking that explains away inconvenient facts, and promises to return to a \u0022pure\u0022 past. Sound familiar? The “Make America Great Again” and “Make America Healthy Again” movements check many of these boxes even while acknowledging that the health threats many Americans face are very real. Are we addressing those threats through evidence and accountability, or through cult-like devotion to leaders who promise easy answers? For a deeper dive into today’s discussion: Jane Borden’s Website Ken Cook Is Having Another Episode every other week. @kencookspodcast www.ewg.org @environmentalworkinggroup",
      "release": "2025-12-02T11:00:00Z",
      "duration": "00:39:47.8560000",
      "explicit": true,
      "spotifyId": "48VzmVIYq727qlX2Bd82WS",
      "appleId": 1000739270757,
      "youTubeId": "m7o4SaKv8pw",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/48VzmVIYq727qlX2Bd82WS",
        "apple": "https://podcasts.apple.com/podcast/cult-like-thinking-in-america/id1735379217?i=1000739270757",
        "youtube": "https://www.youtube.com/watch?v=m7o4SaKv8pw"
      }
    }
  ]
}