{
  "id": "31e542be-47a2-4f1b-b3f6-d76a12ef96b3",
  "name": "Kerry McAvoy, PhD",
  "youTubeChannelId": "UCKLQyhjWUzWrBfoQlC5ZotQ",
  "episodes": [
    {
      "id": "2ee977f8-9337-401e-b7e3-427829520a23",
      "title": "The Narcissist: A Cult Leader of Two",
      "description": "A Narcissist has a lot in common with a cult leader. Instead of controlling a compound of people, they focus on the immediate relationship with you. \n\nIn this week\u0027s podcast, Daniella Mestyanek-Young, author of Uncultured and survivor of the Children of God, joins me to discuss the similarities between a narcissist and a cult leader. \n\nTo learn more about Daniella,\nTikTok - @knittingcultlady\nWebsite - https://uncultureyourself.com/\nTo buy her book, Uncultured - https://amzn.to/3CDhFcY\n\n*******************\n\nWant to read a true story of narcissistic abuse?\nLOVE YOU MORE: The Harrowing Tale of Lies, Sex Addiction, \u0026 Double Cross\nAvailable here at the following online stores. https://amzn.to/3NVMBXO\n\nHealing requires understanding and support. Join a community that gets it. Get weekly group coaching, monthly book reads, access to past webinars and Dr. McAvoy\u0027s online course with the Toxic-Free Relationship Club: https://kerrymcavoyphd.com/toxic-free-relationship-club/\n\nFollow Dr. McAvoy!\nYouTube: @kerrymcavoyphd\nInstagram: @kerrymcavoyphd\nFacebook: @kerrymcavoyphd\nE-mail: hello@kerrymcavoyphd.com\nNewsletter: https://breakingfreenarcabuse.substack.com/ \nWebsite: https://www.breakingfreenarcissisticabuse.com/\n\nKerry Kerr McAvoy, Ph.D., a mental health specialist and author, is an expert on cultivating healthy relationships, deconstructing narcissism, and understanding various other mental health-related issues. Her memoir, Love You More: The Harrowing Tale of Lies, Sex Addiction, \u0026 Double Cross, gives an uncensored glimpse into the dynamics of narcissistic abuse.\n\nChapters:\n00:00 The Dark Side of Love Bombing: When Romance Becomes Control\n02:30 From Cult Survivor to Army Intelligence: Daniella\u0027s Extraordinary Journey\n05:00 The 10 Warning Signs of Cult-Like Control in Relationships\n07:30 Love Bombing \u0026 Brainwashing: How Predators Create False Intimacy\n10:00 The Manipulation of Basic Human Needs: Connection \u0026 Belonging\n12:30 Red Flags: The Subtle Signs of Coercive Control You\u0027re Missing\n15:00 Breaking Free: Mourning the Loss of Toxic \u0027Oneness\u0027\n17:30 Control Through Chaos: How Abusers Keep You Too Busy to Think\n20:00 House Dysmorphia: When Perfect Cleanliness Becomes Control\n22:30 The Path to Recovery: Learning to Just \u0027Be\u0027 Again",
      "release": "2024-12-02T11:00:08Z",
      "duration": "00:25:12",
      "explicit": false,
      "youTubeId": "3SHu0igRdDA",
      "subjects": [
        "One-on-one",
        "Psychology",
        "Cult Psychology",
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3SHu0igRdDA"
      }
    }
  ]
}