{
  "id": "2e741512-53f3-4f3f-a3ea-a4ca3cffe5b3",
  "name": "Killer Queens: A True Crime Podcast",
  "spotifyId": "1Jscb9OAXbbtmwpA6kCxiX",
  "appleId": 1268919812,
  "youTubeChannelId": "UCOL0wFERHVr_gU7VUABgXMA",
  "episodes": [
    {
      "id": "42edff2e-e07f-41b8-9eaf-8782bc7f1b5b",
      "title": "Doomsday Cat Cult: The Wildest True Crime Story Yet 🐱",
      "description": "Get ready to hear the wildest true crime story yet—the Doomsday Cat Cult! 🐱 This bizarre case has everything: secret religions, disturbing manipulation, murder plots, and yes—cats that are supposedly vessels of salvation. Join us as we unravel the twisted tale of Cheryl Ruthven, her fiery sermons, and her followers who believed saving cats could protect them from the apocalypse. From Bellingham, Washington to Tennessee, this story is packed with shocking twists, cult dynamics, and jaw-dropping revelations.\n\nHang with us as we dive deep into how Cheryl turned her ministry into a full-blown cat-centric cult and explore the unbelievable lengths her followers went to in the name of faith. From secret rituals to cat worship, this podcast-style breakdown will leave you questioning everything. \n\n🚨 Trigger Warning: This video discusses themes of manipulation, cult activity, and mentions of violence. Viewer discretion is advised. \n\nSupport Our AMAZING Sponsors and stay connected! Don’t forget to follow us on social media, join the conversation in our discussion group, and check out our merch for even more fun. Love crazy stories like this? Hit that subscribe button and never miss a case!\n\n#TrueCrime #DoomsdayCatCult #TrueCrimePodcast #Murder #Disappearance #Case #CultStory #Podcast\n\n#lorivallow #courttv #truecrime #heavensgate #truecrimedocumentary\n\nCHAPTERS:\n00:00 - Intro\n01:15 - Mark and Mary Walker\n07:31 - Cheryl Walker Ruth and Mark Walker\n09:45 - Freedom Fire Ministries\n10:55 - Mary Walker\u0027s Journey\n13:06 - Eva\u0027s Eden: A New Beginning\n18:17 - Cheryl\u0027s Escape to Colombia\n22:04 - The Doomsday Cat Cult Explained\n23:10 - Doomsday Cat Cult Update\n25:20 - Outro",
      "release": "2025-05-08T21:00:10Z",
      "duration": "00:25:39",
      "explicit": false,
      "youTubeId": "8QxoC_Ac3ts",
      "subjects": [
        "Freedom Fire Ministries",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8QxoC_Ac3ts"
      }
    },
    {
      "id": "da2f7d62-a49c-4307-822b-579f9ffadca2",
      "title": "The Viral Cult You Can\u0027t Look Away From: Atlantis Revealed",
      "description": "Witness the birth of a modern cult unfolding in real-time on social media. In the dusty outskirts of El Paso, Texas, a mysterious compound called \u0022Atlantis\u0022 is drawing followers with promises of free living and off-grid paradise. Led by Michael Guzman, this growing community blends social media influence with concerning cult-like behavior.\n\nFrom panhandling and Amazon purchases to makeshift living conditions in the desert, this story follows the key players who\u0027ve joined this \u0022revolution.\u0022 Watch as former homeowners, crystal healers, and social media personalities abandon their lives to join this questionable venture, while others escape and expose dark truths.\n\nWhat starts as a seemingly innocent commune quickly reveals red flags: controlling behavior, desperate calls for followers, and contradictory messages about living off-grid while constantly seeking social media fame. Is this the first social media cult of our time?\n\nJoin us as we explore this developing story that\u0027s simultaneously fascinating and disturbing. Many are already calling it a future Netflix documentary in the making - watch it unfold before your eyes.\n\nWARNING: This video contains discussions of cult behavior and potentially concerning situations.\n\n#documentary #cultphenomenon #documentaries #historychannel #history\n\nCHAPTERS:\n00:00 - Intro\n00:41 - The Players\n03:05 - The Land\n07:30 - Julie B and Whiskey\n08:38 - The Illegal from Ecuador\n10:42 - Visionary Empress\n14:26 - Austin\n18:44 - Whiskey Overview\n20:53 - Human Waste Management Solutions\n22:16 - Slab City Comparison\n24:10 - Final Thoughts and Reflections",
      "release": "2025-01-03T00:00:40Z",
      "duration": "00:25:21",
      "explicit": false,
      "youTubeId": "toIpbahEV2I",
      "subjects": [
        "Michael Guzman"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=toIpbahEV2I"
      }
    }
  ]
}