{
  "_ts": 0,
  "id": "ae768785-8caf-487a-a988-25d5fa96ef0b",
  "name": "Killers, Cults and Queens",
  "spotifyId": "73tMDbHLUK4sucBVbuESnh",
  "appleId": 1641463028,
  "youTubeChannelId": "UCi7ZBMUcmQ6CRlPIrtfz14Q",
  "episodes": [
    {
      "id": "78533739-31cc-468f-a49d-be26498f24cd",
      "title": "The dark rise of Jim Jones and the road to Jonestown",
      "description": "Nikki Druce and Cheryl are BACK, and they\u0027re back with a bang. This week on Killers, Cults and Queens, Nikki and Chez are headed to Guyana to experience one of the worst cults of all time... The People\u0027s Temple. How did a preacher from humble beginnings convince hundreds of people to up and leave their lives all over the world for the now infamous Jonestown? And what were the events leading up to the horrific mass suicide of almost 1,000 people? Nikki and Chez are going to find out. This episode is not suitable for listeners under the age of 18. It contains depictions of mass suicide, and discussions of coercive behaviour. It is not intended for all audiences. Listener discretion is strongly advised. Got a theory? Been lost in a rabbit hole? We want to hear from YOU! Email queens@global.com to get in touch, or DM us @killerscultsqueens on Instagram. And follow Cheryl @cheryldragqueen and Nikki Druce @nikkimacabrelondon. Listen on Global Player for free. Download Global Player from the app store or go to globalplayer.com. If you have been affected by any of the themes in this episode, please consider contacting the following resources: The Samaritans helpline: 116 123 Confidential Emotional Support Line: 01708 765200 Hope Not Hate: 020 7952 1181 Exit UK: 0800 999 1945 Safeline national male survivor helpline: 0808 800 5005 Sexual Assault Support Line: 01708 765200 Sane mental health line: 0300 304 7000",
      "release": "2024-10-14T03:00:00Z",
      "duration": "01:03:35.8880000",
      "explicit": true,
      "spotifyId": "2UyEyrsCioEqfqMw5wIEPG",
      "appleId": 1000672972304,
      "youTubeId": "YBOtPx--Jgo",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2UyEyrsCioEqfqMw5wIEPG",
        "apple": "https://podcasts.apple.com/podcast/the-dark-rise-of-jim-jones-and-the-road-to-jonestown/id1641463028?i=1000672972304",
        "youtube": "https://www.youtube.com/watch?v=YBOtPx--Jgo"
      }
    },
    {
      "id": "fd06b5fe-a30d-4bc2-95be-405df2e9f222",
      "title": "Christmas Special, the bizarre case of the Love Has Won cult",
      "description": "Ho ho ho! Christmas has come early thanks to Cheryl and Nikki Druce. High on the spirit of crimbo, they present an unreleased episode from season one… the pilot! So get in, we’re heading back 7 months to learn about the crazy Love Has Won cult. A tale of mother and father gods, colloidal silver and glitter covered desiccated corpses… what could be more festive than that… But who was mother god, and how did a potentially well intentioned community turn into a police raid that went viral? Cheryl and Nikki are going to find out. Expect baby Nikki and Chez, tails of swingers hotels and a shocking discovery. This episode contains graphic details of violence, mental and physical abuse. This episode also comes with a trigger warning for those who are currently living with or recovering from an eating disorder. It is not intended for all audiences. Listener discretion is strongly advised. For all things Killers, Cults and Queens, head over to @killerscultsqueens on Instagram. And follow Cheryl @cherylqueen and Nikki Druce @nikkimacabrelondon. If you have been affected by any of the themes in this episode, please consider contacting the following resources: The Samaritans helpline: 116 123 Confidential Emotional Support Line: 01708 765200 Refuge domestic abuse helpline: 0808 2000 247 (live chat is also available at https://www.nationaldahelpline.org.uk/Contact-us *times apply) Safeline domestic abuse helpline: 01926 402 498 Safeline national male survivor helpline: 0808 800 5005 Sexual Assault Support Line: 01708 765200 Sane mental health line: 0300 304 7000 Beat Eating Disorder Support Lines, England, Scotland, Wales and Ireland: https://www.beateatingdisorders.org.uk/get-information-and-support/get-help-for-myself/i-need-support-now/helplines/ The knowledge out there on this topic is vast, so if your interest is peaked by this episode please take a look at our sources: Vice - Meet Mother God The INSANE story of the Love Has Won cult \u0026 Amy Carlson | DEEP DIVE Is It Legal to Mummify Your Cult Leader? Love Has Won: The Cult of Mother God Love Has Won - Wikipedia Love Has Won - RationalWiki New Earth Healing Essentials Love Has Won: What was the cult led by Amy Carlson? | The Independent Love Has Won cult leader died from anorexia, substance abuse and colloidal silver use, autopsy report says Where Are the Members of Bizarre Cult Love Has Won Today? ‘Love Has Won’ cult reappears online under new name - KESQ Seven arrested in \u0027Love Has Won\u0027 death appear in court 5d Full Disclosure| Sessions and Classes From \u0027Mother God\u0027 to Mummified Corpse: Inside the Fringe Spiritual Sect \u0027Love Has Won\u0027 Crystal Schools",
      "release": "2022-12-22T04:00:00Z",
      "duration": "00:48:51.8530000",
      "explicit": true,
      "spotifyId": "0r74HYf0TxmPR0r4bj1Bko",
      "appleId": 1000590944916,
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0r74HYf0TxmPR0r4bj1Bko",
        "apple": "https://podcasts.apple.com/podcast/christmas-special-the-bizarre-case-of-the-love-has-won-cult/id1641463028?i=1000590944916"
      }
    },
    {
      "id": "e84056cf-70d3-4f97-b0a9-35bb7584d013",
      "title": "The worst cult you’ve probably never heard of, The Ant Hill Kids",
      "description": "Nikki Druce and Cheryl are travelling to Canada to meet the WORST cult leader to have ever existed. After growing up in the stereotypical cult leader way (being told he was really smart and eventually dropping out of school), Roch Theriault spent his early 20s hell bent on creating a world for himself, one that he could control with all of his might… containing the most disturbing details Nikki and Cheryl have ever heard, they’re about to find that this ‘equalism’ community was not all that it seemed. Expect earth shattering revelations, horrific living conditions, and the story of one very very brave woman. This episode contains graphic details of violence, mental and physical abuse, including abuse against children and babies. It is not intended for all audiences. Listener discretion is strongly advised. For those who would like to skip mentions of physical abuse, please skip the following time codes: 30:30 - 34:19: Amputation 33:00 - 35:00: Child abuse 37:00 - 40:30: Severe physical abuse 43:00 - 46:36: Severe physical abuse and amputation For all things Killers, Cults and Queens, head over to @killerscultsqueens on Instagram. And follow Cheryl @cheryldragqueen and Nikki Druce @nikkimacabrelondon. If you have been affected by any of the themes in this episode, please consider contacting the following resources: The Samaritans helpline: 116 123 Confidential Emotional Support Line: 01708 765200 Refuge domestic abuse helpline: 0808 2000 247 (live chat is also available at https://www.nationaldahelpline.org.uk/Contact-us *times apply) Safeline domestic abuse helpline: 01926 402 498 Safeline national male survivor helpline: 0808 800 5005 Sexual Assault Support Line: 01708 765200 Sane mental health line: 0300 304 7000 The knowledge out there on this topic is vast, so if your interest is peaked by this episode please take a look at our sources: Chilling insight into doomsday cult where members were forced to break their own legs Roch Theriault | Murderpedia, the encyclopedia of murderers Roch Thériault - Wikipedia The Most Disturbing Cult of All Time: The Ant Hill Kids THE ANT HILL KIDS: Break your legs with a sledgehammer or go to Hell - CVLT Nation . Cult Leader Roch Moïse Thériault - The Deadly Messiah Crime Documentary",
      "release": "2022-12-01T04:00:00Z",
      "duration": "00:54:08.8220000",
      "explicit": true,
      "spotifyId": "3IUxm7BemkcXK8eK1ccN6r",
      "appleId": 1000588255933,
      "subjects": [
        "Ant Hill Kids"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3IUxm7BemkcXK8eK1ccN6r",
        "apple": "https://podcasts.apple.com/podcast/the-worst-cult-youve-probably-never-heard-of-the/id1641463028?i=1000588255933"
      }
    },
    {
      "id": "c8e55060-a16c-44c1-9499-7d1e85a8d7b4",
      "title": "The horrific sex cult inside NXIVM",
      "description": "Cheryl and Nikki Druce are heading down a road they’ve never been before to the heinous sex cult Dominus Obsequious Sororium of NXIVM. Promoted as a self improvement community, NXIVM was an MLM of gargantuan proportions, allegedly giving advice to The Bronfman Sisters and even Richard Branson… but no one could have guessed the cruel underside ruled by sick leader Keith ‘Vanguard’ Raniere and Smallville actress Alison Mack. Who was Keith Reniere, and how did a self improvement company lead to the mutilation of almost a dozen women? Cheryl and Nikki are going to find out. Expect modern day cult behaviour, a very confused Chez, and some SERIOUSLY messed up behaviour. This episode contains graphic details of violence, mental and physical abuse. This episode also comes with a trigger warning for those who are currently living with or recovering from an eating disorder. It is not intended for all audiences. Listener discretion is strongly advised. For all things Killers, Cults and Queens, head over to @killerscultsqueens on Instagram. And follow Cheryl @cheryldragqueen and Nikki Druce @nikkimacabrelondon. If you have been affected by any of the themes in this episode, please consider contacting the following resources: The Samaritans helpline: 116 123 Confidential Emotional Support Line: 01708 765200 Refuge domestic abuse helpline: 0808 2000 247 (live chat is also available at https://www.nationaldahelpline.org.uk/Contact-us *times apply) Safeline domestic abuse helpline: 01926 402 498 Safeline national male survivor helpline: 0808 800 5005 Sexual Assault Support Line: 01708 765200 Sane mental health line: 0300 304 7000 MLM Checker: www.isthisanmlm.com MLM Master List: www.mlmtruth.org Beat Eating Disorder Support Lines, England, Scotland, Wales and Ireland: https://www.beateatingdisorders.org.uk/get-information-and-support/get-help-for-myself/i-need-support-now/helplines/ The knowledge out there on this topic is vast, so if your interest is peaked by this episode please take a look at our sources: NXIVM - Wikipedia NXIVM. What the Media Won\u0027t Report. The Rise \u0026 Fall of Allison Mack | Documentary The Lost Women of NXIVM: Rumors vs. Reality 20/20 Apr 27 Part 1: Woman recalls being branded as part of joining secret society Escaping NXIVM: Behind the investigation of the alleged sex cult Catherine and India Oxenberg Recall NXIVM Experience \u0026 Recovery The Man Who Blew the Whistle On Alleged Sex Cult Inside NXIVM (HBO) Keith Raniere - Wikipedia Nancy Salzman - Wikipedia Allison Mack - Wikipedia Emiliano Salinas - Wikipedia Clare Bronfman - Wikipedia Mega Society - Wikipedia Multi-Level Marketing Businesses and Pyramid Schemes | Consumer Advice . Sarah Edmonson, the Woman Branded Nxivm Branding Was Scripted by Sex Cult Leader to Be ‘Like a Sacrifice’ - The New York Times How NXIVM Seduced Hollywood Stars and America\u0027s Most Powerful Elite Into a Barbaric \u0027Sex Cult\u0027 Allison Mack Forced NXIVM Sex Cult Members to Follow 500-Calorie-a-Day Diets, Witness Testifies How NXIVM Used the Strange Power of Patents to Build Its “Sex Cult” | Vanity Fair",
      "release": "2022-11-17T04:00:00Z",
      "duration": "01:03:56.0810000",
      "explicit": true,
      "spotifyId": "6jga9HrnHoEKI3IrMPtWOd",
      "appleId": 1000586525665,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6jga9HrnHoEKI3IrMPtWOd",
        "apple": "https://podcasts.apple.com/podcast/the-horrific-sex-cult-inside-nxivm/id1641463028?i=1000586525665"
      }
    },
    {
      "id": "10b36dc4-7ba1-47f5-aab6-04805f1becd2",
      "title": "The horrific crimes of The Manson Family cult - Part 2",
      "description": "Cheryl and Nikki Druce are back to uncover the horrendous crimes of The Manson Family Cult. Picking straight back up where we left off, Cheryl and Nikki arrive at Spahn Ranch, where Charles is just about to take his love for music to a whole new level… How did a chance meeting with a Beach Boy and the classic Beatles track Helter Skelter spiral into the brutal murders of at least seven innocent people, and how did Charles manipulate his followers to do the unthinkable? Cheryl and Nikki are about to find out. Expect the house guests from hell, places that REALLY shouldn’t be used as a toilet, and the end of one of the most awful manipulators in history. This episode contains graphic details of violence and murder, including violence against a heavily pregnant woman and is not intended for all audiences. Listener discretion is strongly advised. For all things Killers, Cults and Queens, head over to @killerscultsqueens on Instagram. And follow Cheryl @cheryldragqueen and Nikki Druce @macabrelondonpodcast. If you have been affected by any of the themes in this episode, please consider contacting the following resources: The Samaritans helpline: 116 123 Confidential Emotional Support Line: 01708 765200 Refuge domestic abuse helpline: 0808 2000 247 (live chat is also available at https://www.nationaldahelpline.org.uk/Contact-us *times apply) Safeline domestic abuse helpline: 01926 402 498 Safeline national male survivor helpline: 0808 800 5005 Sexual Assault Support Line: 01708 765200 Sane mental health line: 0300 304 7000 The knowledge out there on this topic is vast, so if your interest is peaked by this episode. Please take a look at our sources: Two former Manson followers discuss how cult family, 1969 murders changed their lives Charles Manson - Wikipedia THE BIZARRE STORY OF CHARLES MANSON Charles Manson: The Cult of the Manson Family Crazy Facts About The Manson Family (True Crime) *GRAPHIC* Sharon Tate\u0027s FINAL Moments Before Death | The Charles Manson Murders Breakdown (18\u0026#43; only) What happened to the Manson \u0027family\u0027? A look at key figures, decades after horrific murders - Los Angeles Times Tate–LaBianca murders - Wikipedia Spahn Ranch - Wikipedia Tex Watson - Wikipedia Susan Atkins - Wikipedia Squeaky Fromme - Wikipedia Sharon Tate - Wikipedia Kathleen Maddox Charles Manson\u0027s Family Reveals They Were \u0027Not Surprised\u0027 After Learning He Was the Mastermind Behind the 1969 Murders - Biography",
      "release": "2022-10-20T03:00:00Z",
      "duration": "00:53:38.1810000",
      "explicit": true,
      "spotifyId": "6sjK8v6fFb7JAZU11BWE1q",
      "appleId": 1000583253696,
      "subjects": [
        "Manson Family",
        "Family Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6sjK8v6fFb7JAZU11BWE1q",
        "apple": "https://podcasts.apple.com/podcast/the-horrific-crimes-of-the-manson-family-cult-part-2/id1641463028?i=1000583253696"
      }
    },
    {
      "id": "05dc2657-18de-4789-aa26-c07a09ae0967",
      "title": "Charles Manson, the man behind the horrific Manson Family Cult - Part 1",
      "description": "Cheryl and Nikki Druce are deep diving into the childhood of one of the most infamous cult leaders of modern day history, Charles Manson. After a rocky childhood spending most of his years in and out of schools for troubled teens and maximum security prisons, Charles heads to Berkeley to find a family of his own… Was Charles destined for the horrible fate he was racing towards, or was the nightmare ahead a product of his own making? Cheryl and Nikki are going to find out. Expect tales of the most delinquent teen of all time, an enormous amount of car stealing, and LSD fuelled orgies. This episode contains graphic details of violence and murder, and is not intended for all audiences. Listener discretion is strongly advised. 00:00 - Introduction 05:34 - Nikki sets the scene 07:15 - Charles’ Manson’s early life 20:31 - Charles gets sent to boarding school 24:08 - Charles tries to make a life on his own as a criminal apprentice 31:54 - Charles meets his first wife, Rosalie Willis 32:31 - Charles is determined to start over 34:39 - Charles learns how to charm 43:47 - Berkeley gets a new resident 45:53 - Charles starts to accumulate a following 49:55 - The original members of The Manson Family 53:14 - Charles sets off to find his makeshift family a new home 53:42 - Outro For all things Killers, Cults and Queens, head over to @killerscultsqueens on Instagram. And follow Cheryl @cheryldragqueen and Nikki Druce @nikkimacabrelondon. If you have been affected by any of the themes in this episode, please consider contacting the following resources: The Samaritans helpline: 116 123 Confidential Emotional Support Line: 01708 765200 Refuge domestic abuse helpline: 0808 2000 247 (live chat is also available at https://www.nationaldahelpline.org.uk/Contact-us *times apply) Safeline domestic abuse helpline: 01926 402 498 Safeline national male survivor helpline: 0808 800 5005 Sexual Assault Support Line: 01708 765200 Sane mental health line: 0300 304 7000 The knowledge out there on this topic is vast, so if your interest is peaked by this episode. Please take a look at our sources: Two former Manson followers discuss how cult family, 1969 murders changed their lives Charles Manson - Wikipedia THE BIZARRE STORY OF CHARLES MANSON Charles Manson: The Cult of the Manson Family Crazy Facts About The Manson Family (True Crime) *GRAPHIC* Sharon Tate\u0027s FINAL Moments Before Death | The Charles Manson Murders Breakdown (18\u0026#43; only) What happened to the Manson \u0027family\u0027? A look at key figures, decades after horrific murders - Los Angeles Times Tate–LaBianca murders - Wikipedia Spahn Ranch - Wikipedia Tex Watson - Wikipedia Susan Atkins - Wikipedia Squeaky Fromme - Wikipedia Sharon Tate - Wikipedia Kathleen Maddox Charles Manson\u0027s Family Reveals They Were \u0027Not Surprised\u0027 After Learning He Was the Mastermind Behind the 1969 Murders - Biography",
      "release": "2022-10-13T03:00:00Z",
      "duration": "00:56:07.0790000",
      "explicit": true,
      "spotifyId": "0Q9mWJABpExWU3QDXzQVGX",
      "appleId": 1000582486153,
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Q9mWJABpExWU3QDXzQVGX",
        "apple": "https://podcasts.apple.com/podcast/charles-manson-the-man-behind-the-horrific-manson/id1641463028?i=1000582486153"
      }
    }
  ]
}