{
  "_ts": 0,
  "id": "34466903-5386-4138-b425-26290820af2c",
  "name": "Kim Iversen",
  "youTubeChannelId": "UCoJTOwZxbvq8Al8Qat2zgTA",
  "episodes": [
    {
      "id": "5cd4605b-9372-4e73-a36b-fbb67f63f3d5",
      "title": "“They’re Coming for Your Kids”: Inside the 764 Cult the FBI Can No Longer Ignore",
      "description": "A terrifying online cult known as “764” is targeting children through gaming apps and chat platforms — and the FBI says it’s now a top-tier national threat. Tonight, private investigator and self-defense expert Becca X joins the show to expose how this network operates, how it’s radicalizing and exploiting minors, and what every parent needs to know right now.\n\nBecca — known online as @bx_on_x — has spent years tracking online predator networks and raising the alarm about the group 764. She’s also a competitive shooter and self-defense trainer committed to protecting the vulnerable and holding predators accountable. Follow Becca on X: @bx_on_x  Substack: bxwrites.substack.com and Rumble: Becca X Channel\n\n\n**About the show\nThe Kim Iversen Show is a fully independent program produced for your entertainment and information. The one hour show airs live M-F at 5pm PT / 8pm ET at www.TheKimIversenShow.com. Clips from the program are published to YouTube daily. \n\n**Medical Disclaimer: \nThe CDC states that masks are effective and patients should not try medications or protocols that are not approved for the treatment or prevention of COVID-19. The CDC states that COVID-19 vaccines are safe, effective, and reduce your risk of severe illness. Hundreds of millions of people have received a COVID-19 vaccine, and serious adverse reactions are uncommon. This program is not a replacement for medical advice and may explore counter opinions. Always consult your personal physician before making any decisions about your health.",
      "release": "2025-05-09T19:16:24Z",
      "duration": "00:46:46",
      "explicit": false,
      "youTubeId": "heBNjXDaut8",
      "subjects": [
        "The Order of Nine Angles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=heBNjXDaut8"
      }
    }
  ]
}