{
  "id": "4d26ffef-60e3-4a4c-94bb-0bf3e517fff5",
  "name": "Kim Kelley",
  "youTubeChannelId": "UC5P-QSPqZwMFhfQEOOtx9Kw",
  "episodes": [
    {
      "id": "fb71aea8-00b3-4871-b7b0-61b4a9c4d910",
      "title": "From Cult \u0026 Trafficking Survivor to Whistleblower: Exposing Corruption \u0026 Fighting to Protect Kids",
      "description": "I was born and raised in a religious cult. I survived 20 years of abuse, including child trafficking, extreme religious control, and systemic exploitation. But escaping was only the beginning.\n\nThrough my work in advocacy, law enforcement collaboration, and uncovering corruption, I’ve seen firsthand how deep the darkness runs. I’ve witnessed powerful people use nonprofits, law enforcement, and even anti-trafficking organizations as fronts to exploit the very issue they claim to fight.\n\nWhen I realized no one was coming to save us, I stopped waiting.\nNow, I work alongside law enforcement, tech experts, and policymakers to protect children, expose corruption, and bring real solutions to the fight against exploitation.\n\nBut speaking the truth comes at a cost. After blowing the whistle on fraud, mismanagement, and unethical behavior within an anti-trafficking nonprofit, I became the target of slander, lies, and retaliation.\n\nThis is the story they don’t want you to hear.\nThis is why I fight.\nAnd this is why I won’t stop.\n\n💡 If you believe in protecting children, exposing corruption, and standing up for the truth, subscribe now. This is just the beginning.\n\n#KimKelley #Whistleblower #ExposeCorruption #Survivor #ProtectChildren #JusticeForSurvivors #TraumaToTriumph #EndExploitation #FightingForTruth",
      "release": "2025-02-27T22:46:47Z",
      "duration": "00:18:40",
      "explicit": false,
      "youTubeId": "th9YSAp1wKw",
      "subjects": [
        "Children Of God",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=th9YSAp1wKw"
      }
    },
    {
      "id": "9db20968-8ddf-46d8-9f60-98049b6c3aa7",
      "title": "Christians, Why Aren’t You Protecting Children? | Unfiltered Truth With Kim Kelley",
      "description": "POV: Why don\u0027t we see Christians on the front lines of protecting children from exploitation? As a child trafficking survivor raised in a Christian cult, I’ve seen firsthand how faith can be manipulated—and how many churches stay silent when they should be leading the fight.\n\nIn this video, I’m sharing my personal story and challenging the church to step up, lead by example, and take real action to protect the innocent. This isn’t about attacking faith—it’s about holding people accountable to the values they preach.\n\nAre churches speaking out? Are they doing anything to confront child exploitation?\n\nYou tell me: where are the real Christians? \nLet’s talk about it. 👇\n\n\n#UnfilteredTruth #ProtectChildren #ExposingCults #FaithInAction #ChildSafety #Christianity #JusticeForVictims #ReligiousTrauma #SurvivorStories #ChildProtection #Christianity #ReligiousTrauma #FaithInAction",
      "release": "2025-02-08T15:00:15Z",
      "duration": "00:29:33",
      "explicit": false,
      "youTubeId": "CP6eIBFh3eA",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CP6eIBFh3eA"
      }
    },
    {
      "id": "f40f1d89-dee8-4029-9ef3-3cb64f001ae0",
      "title": "The Playbook of Every Cult : How They Control \u0026 Manipulate | Kim Kelley Child Safety Advocate",
      "description": "Cults aren’t always obvious. They disguise themselves as movements, organizations, or even religious communities—until you’re deep inside and the control begins.\n\nIn this video, I break down The 10 Rules Every Cult Follows—the unspoken playbook they use to manipulate, isolate, and control their members. From forced loyalty and financial exploitation to the “us vs. them” mentality, these rules reveal the hidden tactics cults use to keep people trapped.\n\n⚠️ Key topics covered:\n🔹 The fear and isolation tactics used to control members\n🔹 How cults demand loyalty, financial support, and blind faith\n🔹 The psychological tricks used to make people ignore red flags\n🔹 Why healing and breaking free is possible\n🔹 How to recognize the signs before it’s too late\n\nI was born and raised in a notorious international religious cult, and I know firsthand how these rules work. If you’ve ever felt manipulated, pressured, or controlled by an organization or belief system—watch this video and learn how to spot the warning signs.\n\nWhat are your thoughts? Have you ever noticed these tactics in groups, workplaces, or religious movements? Let’s talk in the comments. 👇\n\n#CultsExposed #CultSurvivor #ReligiousTrauma #MindControl #SpiritualManipulation #PsychologicalAbuse #HealingJourney #ProtectYourMind #ExposingCults #TraumaRecovery",
      "release": "2025-02-07T22:11:25Z",
      "duration": "00:11:40",
      "explicit": false,
      "youTubeId": "0dTJXcNqH7w",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0dTJXcNqH7w"
      }
    }
  ]
}