{
  "id": "1e0b453a-3239-4b7a-825c-fffaf8803def",
  "name": "Korea JoongAng Daily - Daily News from Korea",
  "spotifyId": "0x07qhlmLvU9G88eGqJW0S",
  "appleId": 1766648872,
  "episodes": [
    {
      "id": "01003507-442c-4995-a8ec-b18622cbbd63",
      "title": "Long-maligned religious group Shincheonji draws new scrutiny over political collusion claims",
      "description": "This article is by Michael Lee and read by an artificial voice.\n\n[EXPLAINER]\nSix years after it first attracted national attention for its role in Korea\u0027s initial mass outbreak of Covid-19, the secretive Shincheonji religious movement has come under renewed focus for allegedly helping to propel former President Yoon Suk Yeol to power.\nOngoing probes into Yoon\u0027s administration have uncovered evidence that the group, formally known as the Shincheonji Church of Jesus, mobilized its members to influence the conservative People Power Party\u0027s (PPP) presidential primaries ahead of the 2022 election.\nWhile Shincheonji denies these claims, the accusations have stirred public anxiety about the organization\u0027s reach beyond religion.\nThe latest controversy follows years of public misgivings regarding Shincheonji, whose reputation was severely damaged during the early months of the pandemic.\nThat episode hardened perceptions that the group — long characterized by critics as a cult — was resistant to outside scrutiny even during a public health crisis, though courts later dismissed some criminal charges against its leaders related to their lack of cooperation with epidemiological investigations.\nAs investigators probe Shincheonji\u0027s alleged political activities, the group once again finds itself at the center of a broader national debate over how a democratic society committed to freedom of religion should respond to religious organizations accused of deception, social harm and covert political influence.\n\nWhat are the latest allegations?\nThe latest controversy centers on claims that Shincheonji members were encouraged to join the PPP in large numbers during the party\u0027s 2021 presidential primaries, which Yoon ultimately won.\nThe allegations are based in part on statements by former Daegu Mayor Hong Joon-pyo and testimony from former Shincheonji insiders who say the effort was coordinated.\nAccording to these accounts, members were urged to sign up for PPP membership to block other presidential hopefuls seen as hostile to Shincheonji, including current President Lee Jae Myung, who at the time was a prominent figure in the liberal Democratic Party.\n\nThe insider, who has remained unnamed in domestic media reports, told investigators that Shincheonji\u0027s leadership decided to push members to support Yoon \u0022to repay him for blocking raids into the group\u0027s facilities on two occasions\u0022 during his tenure as prosecutor general.\nEarlier this month, Hong claimed the PPP saw a influx of approximately 190,000 new members in the months leading up to the primaries in November. He further estimated that 100,000 of these new party members were affiliated with Shincheonji.\nA photograph of Yoon meeting the head of an association with ties to Shincheonji in January 2022, which resurfaced recently, has further fueled suspicions of improper political meddling by the group.\nShincheonji, for its part, has categorically denied directing members to engage in organized political action, stating that it does not support any political party and that its followers act independently as voters.\nWhile Korean law places no restrictions on individual political participation by religious believers, religious organizations risk violating election laws if they encourage members to vote for a specific candidate or party.\nArticle 85 of the Public Official Election Act stipulates that no person may engage in political activities targeting members of an educational, religious or professional organization by taking advantage of their position within the group.\nThe ongoing controversy has raised concerns about whether secretive religious movements can exert influence within democratic institutions without public visibility.\n\nWhy is the group seen as a cult?\nFounded in the 1980s, Shincheonji identifies itself as a Christian church, but its teachings sharply diverge from those of mainstream Protestant and Catholic denominations. The group\u0027s name, which in Korean means \u0022new heaven and new ...",
      "release": "2026-01-28T22:00:33Z",
      "duration": "00:10:03",
      "explicit": false,
      "spotifyId": "62Wz66JMUqq5F5iBHQQN2i",
      "appleId": 1000747086045,
      "subjects": [
        "Shincheonji Church of Jesus"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/62Wz66JMUqq5F5iBHQQN2i",
        "apple": "https://podcasts.apple.com/podcast/long-maligned-religious-group-shincheonji-draws-new/id1766648872?i=1000747086045"
      }
    }
  ]
}