{
  "id": "09743d96-c730-45dd-84bd-77e007a060e6",
  "name": "KQED\u0027s Forum",
  "spotifyId": "1QN1TOcYhAqgk5jDO3pPu6",
  "appleId": 73329719,
  "youTubeChannelId": "UC0FISFbEaHFc5ccrIgkZ3mg",
  "youTubePlaylistId": "PLCxtKFQXBuRirbXGU1ZhZXLonwrXow4Do",
  "episodes": [
    {
      "id": "20bd5be7-8daa-4728-9366-15ed27ee8409",
      "title": "Forum From the Archives: Jonathan Hirsch on Losing His Father to \u0027A Cult and Dementia\u0027",
      "description": "In his popular podcast “Dear Franklin Jones,” radio producer Jonathan Hirsch tried to make sense of a childhood dominated by his parents’ spiritual guru. In a new memoir he more deeply explores his relationship with his father and the complexity of providing care for a parent who didn’t take care of him. We talk to him about his audio memoir, “The Mind is Burning: Losing My Father to a Cult and Dementia.” Guests: Jonathan Hirsch, podcast producer; author of the audiobook memoir, \u0022The Mind Is Burning: Losing my Father to a Cult and Dementia\u0022 Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-05-26T18:00:00Z",
      "duration": "00:56:43.0750000",
      "explicit": false,
      "spotifyId": "4EbRh3lkZ0QgJOiRTj5B1j",
      "appleId": 1000709965331,
      "youTubeId": "lmdJrgjq1M4",
      "subjects": [
        "Adi Da"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EbRh3lkZ0QgJOiRTj5B1j",
        "apple": "https://podcasts.apple.com/podcast/forum-from-the-archives-jonathan-hirsch-on-losing-his/id73329719?i=1000709965331",
        "youtube": "https://www.youtube.com/watch?v=lmdJrgjq1M4"
      }
    },
    {
      "id": "10e10a26-b8c0-4a79-ace4-c5ba0b878a01",
      "title": "Jonathan Hirsch on Losing His Father to ‘A Cult and Dementia’",
      "description": "In his popular podcast “Dear Franklin Jones,” radio producer Jonathan Hirsch tried to make sense of a Northern California childhood dominated by his parents’ spiritual guru. In a new memoir he more deeply explores his relationship with his father and the complexity of providing care for a parent who didn’t take care of him. We talk to him about his audio memoir, “The Mind is Burning: Losing My Father to a Cult and Dementia”\n\n\n\nGuests:\n\nJonathan Hirsch, author of the audiobook memoir, \u0022The Mind Is Burning: Losing my Father to a Cult and Dementia\u0022; podcast producer, \u0022Dear Franklin Jones\u0022; founder, Neon Hum Media, a partner company with Sony Music Entertainment; creator, original series \u0022Smoke Screen\u0022\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-05-15T18:57:00Z",
      "duration": "00:57:47",
      "explicit": false,
      "spotifyId": "0SZD0asupC0LR6AnAjncSY",
      "appleId": 1000708641331,
      "subjects": [
        "Adi Da"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0SZD0asupC0LR6AnAjncSY",
        "apple": "https://podcasts.apple.com/podcast/jonathan-hirsch-on-losing-his-father-to-a-cult-and-dementia/id73329719?i=1000708641331"
      }
    },
    {
      "id": "041e214c-37d7-470e-b48b-92e6fdb8959f",
      "title": "Why Cults Fascinate Us With UC Berkeley Professor Poulomi Saha",
      "description": "In the last several years, a cult industrial complex has emerged to capitalize on Americans’ fascination with groups such as Jonestown, the Manson Family, the Branch Davidians, and the Rajneeshpuram community in Wasco County, Ore., argues UC Berkeley professor Poulomi Saha. But in her highly sought-after class called Cults in Popular Culture, they emphasize that it’s important to look beyond the sensational examples and recognize how cult-like behavior shows up in many facets of our lives and society. We’ll talk with Saha about why some groups are labeled as cults, why people are drawn to them, and what cults reveal about spirituality and culture in America. Guests: Poulomi Saha, associate professor of English and co-director of the Program in Critical Theory, UC Berkeley. Saha teaches a course called Cults in Popular Culture.",
      "release": "2023-11-30T20:39:57Z",
      "duration": "00:54:17.2340000",
      "explicit": false,
      "spotifyId": "1Wcu7uzLRc0azjnkyvB1AY",
      "appleId": 1000637099423,
      "subjects": [
        "Bhagwan Shree Rajneesh",
        "Hare Krishnas",
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Wcu7uzLRc0azjnkyvB1AY",
        "apple": "https://podcasts.apple.com/podcast/why-cults-fascinate-us-with-uc-berkeley-professor/id73329719?i=1000637099423"
      }
    }
  ]
}