{
  "id": "f578e337-0abb-480c-879a-777e46eae31a",
  "name": "Kris Rainwaters-The Real Estate Witch",
  "youTubeChannelId": "UCtwGvL5HRLc_10vo36QdS1A",
  "episodes": [
    {
      "id": "e6e75587-241a-4462-a3d6-e66f0ec836ec",
      "title": "Inside the Spiritual Coaching Grift: Cult Tactics Disguised as Healing \u0026 Empowerment",
      "description": "Spiritual coaching scams are everywhere. Glossy marketing wrapped in healing and empowerment, but built on cult tactics and manipulation. In this video, I expose the spiritual coaching grift: how it works, the red flags to watch for, and why real transformation can’t be sold through shame, secrecy, or subscription traps.\n\nAfter falling for the hype myself, I learned how to tell the difference between real guidance and spiritual marketing that keeps you dependent.\n\nYou’ll learn:\n✨ The cult tactics hiding inside spiritual coaching “containers”\n✨ Why charging for spirituality isn’t the problem... dependency is\n✨ How unfair advantage fuels the myth of “overnight success”\n✨ Seven red flags that expose a grift before it hooks you\n✨ How to trust your body’s cues as your first line of spiritual defense\n\n🔮 Start with something real\n\n🕯️ Buried Strength — a free guided descent to help you find your power in the dark.\nThis isn’t a class. It’s a threshold.\nReceive it here:\n👉 https://witchythings.shop/pages/buried-strength-a-free-visualization-to-reclaim-yourself\n\n✨ Want to go deeper?\nHere are more ways to work with me:\n\n🌙 The Ritual of Light – My 44-day energetic reset for body, mind, and soul.\n(Full guided version or standalone ritual format available)\n👉 https://witchythings.shop/collections/sacred-lightwork\n\n🎓 Free Masterclasses – Practical magick, nervous system work, sacred geometry \u0026 more\n👉 CONDENSED Version https://youtu.be/V44DfS6mjnY\n👉 Original Full Length Version https://youtu.be/cn2KZwc_--U\n👉 Follow Up https://youtu.be/suWAXWr6-_0\n\n🗝 Work with me: https://calendly.com/therealestatewitch – For spiritual or real estate guidance that aligns both the magickal and the mundane.\n\nIf this gave you clarity, like, subscribe, and share it with someone who needs the reminder.\nStay sovereign, stay witchy, and I’ll see you in the next one. 🌙\n\n#spiritualscam #spiritualgrift #culttactics #fakegurus #spiritualsovereignty #healingjourney #ritualoflight #buriedstrength #spiritualawakening #witchtok #krisrainwaters #realestatewitch #spiritualdiscernment #energywork #shadowwork #magickandscience #sovereignty",
      "release": "2025-10-15T00:29:22Z",
      "duration": "00:10:21",
      "explicit": false,
      "youTubeId": "n7KZI5DehsA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=n7KZI5DehsA"
      }
    }
  ]
}