{
  "_ts": 0,
  "id": "9d2700ee-d10b-4d99-8b59-2c20fefbb3fb",
  "name": "Kumar Exclusive",
  "youTubeChannelId": "UCiMmvOZ0bCA5RVrNTViY5oQ",
  "episodes": [
    {
      "id": "fc9d7ca9-dfd7-431a-8bb8-83f0222a122a",
      "title": "#Telugu video: Amway is a Cult \u0026 FRAUD SCHEME, SCAM! || Kumar Exclusive",
      "description": "Raj Boggala requested this video.\nhttps://www.linkedin.com/pulse/my-experience-being-pyramid-scheme-amway-darren-mudd-ggf8c/\n\nhttps://en.wikipedia.org/wiki/Amway#:~:text=Amway%20has%20been%20investigated%20in,illegal%20business%20practices%20in%20India.\n\nAmway-alleged pyramid scheme practices.\n#Telugu video: Amway is a Cult \u0026 FRAUD SCHEME,SCAM!\n           Amway-alleged pyramid scheme practices.\nAbout Channel:\nI am writing here, everything about my life, journey from India to America. \n\n“Kumar Exclusive, has been painstakingly talking about the H1-B violations, and how ‘desi’ consulting companies have been abusing the American immigration laws for decades. I hope enough people are watching this channel and waking up to the fact that most Indians’ lives in America are far from rosy, and how desperation and greed can lead them into a rabbit hole \u0027the murky world of Indian Incs, Vendors, Prime Vendors, and their various ‘layers’\u0027, which offers no respite or hope. It’s all the more heartening to know that an Indian is talking about ethics, morality, and doing the right thing, because — and there’s no other way to put it — Indians aren’t the most moral lot. People can of course point towards the social and economic realities as the reasons for our dishonesty, but here’s the thing: What’s wrong is wrong. Which is why it’s so heartening to see an Indian not mince words and talk about this underground industry, which has taken an economic and mental toll on tens of thousands of Indians, particularly young graduates, who can do better in life than fake resumes, stage interviews, dupe employers. “\n\nKE YouTube channel, in particular, was a great source of help for many investigative journalists to investigate further or write books on H1-B topics. This is how KE is helpful to many Indians victims in the USA/India and several Dream America aspirants across the globe. -KE.\n\n\nSubscribe to My channel at  https://www.youtube.com/@KumarPandruvada \nCheck out My website: https://kumarexclusive.com/my-life-story/\nConnect with me on my social media handles:\nFacebook:  https://www.facebook.com/KumarexclusiveFB\nTwitter: https://twitter.com/KumarExclusive\nemail: kumar@kumarexclusive.com \n\nKumar does not represent by anyone.\nif anyone ask money for VISA - any visas. It is free you do not need to pay any money for anyone and do not pay.\nIf you complain no use either in India or USA because systems failed.\nKumar is not associated any placement agencies or educational agencies or caste or religious groups.\n\nDisclaimer: \nAll information is gathered on actual conversations and electronic communication with followers of my videos. Although I can not guarantee the accuracy, it is my assumption all information provided is factual and true. My opinions are protected by the 1st Amendment of the Constitution of the United States of America. Any threats made against my family or myself is in violation of The Whistleblower Protection Act of 1989, 5 U.S.C. 2302(b)(8)-(9), Pub.L. 101-12 and will be reported to proper authorities. \n\nTHIS IS EXCLUSIVELY FOR TELUGU SPEAKING PEOPLE\u0022Telugu videos\u0022. \nKUMAR EXCLUSIVE IS NOT GENERALIZING OR STEREOTYPING. \nPLEASE DO NOT GET OFFENDED BY TAKING \nIF YOU ARE GETTING OFFENDED, WE WILL UNDERSTAND YOUR COLOR. THANKS.\n\nPlease LIKE/Share this video but do not re-upload our videos. If so it is a copyrights violation.\nPLEASE DO NOT WATCH MY VIDEOS ON ANY WEBSITES. WATCH ONLY FROM MY THIS CHANNEL KUMAR EXCLUSIVE. I did not authorize anyone to host my videos anywhere.\n\nKumar does not make random hate/troll posts on social media. Kumar also does not send random hate/troll emails or texts. If you get such a message somewhere on social media or an email that appears to be from Kumar Exclusive, it is not. It is fake. There are several fake emails and fake social media accounts that use KE’s name and picture. KE only uses his official email for communication. KE official email is listed below. kumar@kumarexclusive.com\n\nDisplaced American is working on this:\nit has the h-1b, h-2a, h-2b, perm, and other visa information as well as the stories of the americans who have been harmed \nhttps://guestworkervisas.com/",
      "release": "2024-07-24T16:00:56Z",
      "duration": "00:15:20",
      "explicit": false,
      "youTubeId": "xejJlTtsGio",
      "subjects": [
        "Amway"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xejJlTtsGio"
      }
    }
  ]
}