{
  "id": "3890eac4-c6a2-409f-91f6-d9fe812a6693",
  "name": "KVAL News",
  "youTubeChannelId": "UCzqM84Y2CCaChhUH4Q9lWnw",
  "episodes": [
    {
      "id": "fbb171c5-fc87-4903-ab58-d3a5f6f2a594",
      "title": "Multiple accusations of sexual assault at local Buddhist retreat",
      "description": "A second accuser has come forward alleging a Buddhist teacher at Dzogchen Shri Singha, a Buddhist retreat center in Veneta, raped and abused her for years.\n\nIn May 2023, KVAL News presented a Special Report, which included an exclusive interview with a woman who says she was raped and impregnated by Khenpo Choga, a Dzogchen guru at the remote retreat center. \n\nFULL STORY: https://kval.com/news/local/breaking-the-silence-multiple-accusations-of-sexual-assault-at-local-buddhist-retreat# \n\n---------------------\nStay connected with us online and on social media! \n\nVisit our website: https://kval.com/\nFollow us on X: https://twitter.com/KVALnews\nFollow us on IG: https://www.instagram.com/kvalnews/\n\nHave a news tip?\nkvalnews@kval.com\n\n#KVAL #Eugene #Springfield #Corvallis #Albany #Roseburg #CoosBay #Oregon #News #LocalNews #buddhist #accusations #assaut",
      "release": "2024-07-12T23:10:53Z",
      "duration": "00:00:55",
      "explicit": false,
      "youTubeId": "Bn8dHusoOxw",
      "subjects": [
        "Dzogchen Shri Singha Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Bn8dHusoOxw"
      }
    },
    {
      "id": "06155b94-f970-4b42-afd8-744457f18f0b",
      "title": "Breaking the Silence: Khenpo Choga\u0027s \u0027Regime of Sexual Predation\u0027",
      "description": "A year ago we brought you an exclusive interview with a woman who says she was raped and impregnated by a Buddhist teacher in a remote retreat center in Veneta.\n\nThat story generated a lot of reaction from people in our community, most of whom knew nothing about this organization that has been operating in Lane County for nearly two decades. A Eugene family watched that story, and reached out to their son and daughter-in-law who had studied at the Buddhist Center. That’s when, for the first time, their daughter-in-law told her husband and those close to her just what she says happened to her in her nearly 10 years under that Buddhist Guru, Khenpo Choga’s watch.\n\nReporter: Brandon Kamerman\n\n---------------------\nStay connected with us online and on social media! \n\nVisit our website: https://kval.com/\nFollow us on X: https://twitter.com/KVALnews\nFollow us on IG: https://www.instagram.com/kvalnews/\n\nHave a news tip?\nkvalnews@kval.com\n\n#KVAL #Eugene #Springfield #Corvallis #Albany #Roseburg #CoosBay #Oregon #News #LocalNews",
      "release": "2024-07-12T01:05:00Z",
      "duration": "00:11:01",
      "explicit": false,
      "youTubeId": "xY02sWUavEc",
      "subjects": [
        "Dzogchen Shri Singha Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xY02sWUavEc"
      }
    },
    {
      "id": "98de4833-e18d-4cb0-b508-b4e4da0a7f1b",
      "title": "An Awakening: Woman Claims She Was Raped at Local Buddhist Center",
      "description": "This story describes allegations of sexual assault and can be triggering. Reader discretion is advised.\n\nIn a lawsuit currently in U.S. District Court in Portland, Ore., a woman claims she was raped by a Buddhist teacher at a religious center in Veneta. People our news team spoke with say the center functions like a cult.\n\nRachel Montgomery says she experienced an awakening years later, which led her to filing a lawsuit requesting $8,000,000 in damages. Multiple defendants are listed in the suit, including individuals and the Dzogchen Retreat Center in Oregon.\n\nKVAL News started looking into the lawsuit and allegations in early April. As we talked with people familiar with the Buddhist Retreat Center, we heard stories about financial pressure, sexual grooming and a godlike figure who rules at times like a dictator. In the lawsuit, which was originally filed in state court, Montgomery describes how she was a vulnerable teenager from Washington who moved to the Dzogchen Buddhist Retreat Center in a remote section of Veneta.\n\nIn an exclusive interview with KVAL News, Montgomery said she was excited about the opportunity.\n\nFor the full article visit kval.com.\n\nReporter: Brandon Kamerman\nAnchor: Brandon Kamerman\nhttps://kval.com/\nhttps://twitter.com/KVALnews\nhttps://www.instagram.com/kvalnews/\n\nHave a news tip?\nkvalnews@kval.com",
      "release": "2023-06-01T01:25:32Z",
      "duration": "00:08:16",
      "explicit": false,
      "youTubeId": "zi2V38fjLr0",
      "subjects": [
        "Dzogchen Shri Singha Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zi2V38fjLr0"
      }
    }
  ]
}