{
  "id": "6ba82242-5dbc-414c-a1b1-85dbb5c4f92c",
  "name": "La7 Attualità",
  "youTubeChannelId": "UC2_ZJDH5PXEoJJz9zAvBuiA",
  "episodes": [
    {
      "id": "16e8708f-dbeb-4c1e-a29a-8984f20e3507",
      "title": "I segreti negli Epstein Files: cosa nascondono i documenti censurati",
      "description": "Epstein Files: i documenti censurati e l’accusa di insabbiamento. \n\nQuesto speciale analizza la pubblicazione degli Epstein Files, milioni di pagine di documenti giudiziari e investigativi legati alla rete di abusi di Jeffrey Epstein, resi pubblici tra dicembre 2025 e gennaio 2026 dopo l’approvazione dell’Epstein Files Transparency Act. Un rilascio senza precedenti che però solleva nuove e pesanti polemiche.\n\nAl centro dell’inchiesta ci sono i cosiddetti “redacted files”: documenti diffusi con ampie censure che, secondo parlamentari di entrambi i partiti e le stesse vittime, avrebbero protetto i nomi dei presunti complici più che tutelare i sopravvissuti, spesso esposti con dati sensibili lasciati in chiaro.\n\nUn passaggio chiave riguarda l’individuazione di almeno sei presunti co-conspiratori di Epstein, i cui nomi sarebbero stati oscurati in modo ingiustificato. A sollevare il caso sono stati il deputato repubblicano Thomas Massie e il democratico Ro Khanna, che, analizzando versioni diverse dei documenti, hanno denunciato discrepanze e cancellature mirate. Secondo i due parlamentari, le redazioni avrebbero nascosto identità già note agli investigatori, alimentando il sospetto di una protezione politica selettiva.\n\nLo speciale ripercorre i momenti chiave dell’udienza infuocata della Procuratrice Generale Pam Bondi alla Commissione Giustizia della Camera, dove l’amministrazione Trump viene accusata di aver gestito la pubblicazione dei file come un’operazione di insabbiamento politico. Deputati repubblicani e democratici contestano le redazioni, l’assenza di nuove incriminazioni e i legami tra Epstein e figure di alto profilo del mondo politico, economico e finanziario.\n\nGuarda gli episodi di House of Trump - La Serie https://www.la7.it/house-of-trump-la-serie/video/house-of-trump-la-serie-08-01-2026-627226",
      "release": "2026-02-18T11:22:40Z",
      "duration": "00:41:25",
      "explicit": false,
      "youTubeId": "HMfIST15Sio",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HMfIST15Sio"
      }
    }
  ]
}