{
  "id": "aec38469-660c-4b8b-98f6-271e973dc481",
  "name": "Label Free Podcast",
  "spotifyId": "6bsUUwZUIAZvxQZFyjQERW",
  "appleId": 1473450378,
  "youTubeChannelId": "UC5t_ELs5dkqBxa0DLxegKsw",
  "episodes": [
    {
      "id": "ee0e4d0e-b934-4d74-8a95-8737f71bd159",
      "title": "Dr. Darla Shaw: From Cult Upbringing to Inclusive Leadership",
      "description": "In this episode of the Label Free Podcast, host Deanna Radulescu interviews Dr. Darla Shaw, the CEO and co-founder of Talent Masters. Dr. Darla shares her incredible journey from being raised in a white nationalist cult to becoming a champion of diversity, equity, inclusion, and belonging (DEIB) in the workplace. She discusses how her upbringing in the cult shaped her perspective and motivated her to create a business focused on human-first hiring practices. Dr. Darla emphasizes the importance of questioning what we\u0027ve been taught and encourages listeners to verify information from multiple sources. She shares insights on building inclusive communities and the impact of her work in bridging gaps in society. Dr. Darla also highlights the charitable aspect of Talent Masters, where 10% of profits are donated to human rights organizations. To learn more about Dr. Darla Shaw and Talent Masters, listeners can visit https://www.talentmasters.com or connect on social media platforms such as LinkedIn, Facebook, Twitter, Instagram, and YouTube. Don\u0027t miss out on this inspiring episode filled with wisdom and advice on challenging beliefs and fostering inclusivity.\n\nAre you looking to take control of your vitality, health, and wellness? Look no further! I\u0027m Deanna Radulescu, your host from Label Free Podcast, and I\u0027m here to share an incredible online telehealth resource with you.\n\nIntroducing Valhalla Vitality, the premier telehealth concierge service that caters to all your health and wellness needs. Whether you\u0027re seeking guidance on sexual health, weight loss, peptides, or simply looking to boost your metabolism, Valhalla Vitality has got you covered.\nI personally experienced the benefits of their telehealth services and was blown away by the results. Now, I\u0027m excited to share an exclusive discount code with you. Use \u0022Deanna15\u0022 to unlock a special offer when you sign up at link here: \n\nhttps://t.ly/AjrFk\n\nWith Valhalla Vitality, you\u0027ll have access to a team of expert telehealth doctors, supervisors, and consultants who will guide you every step of the way. Say goodbye to long waiting times and hello to personalized care from the comfort of your own home.\nReady to take charge of your health and wellness journey? Visit the link in the description below to sign up and schedule your appointment with Valhalla Vitality. Don\u0027t miss out on this incredible opportunity to transform your life.\nRemember, it\u0027s time to prioritize your well-being. Choose Valhalla Vitality and experience the future of telehealth today.\n\nAs always thank you for the support, to contact me directly follow the link below:\n\nhttps://www.labelfreepodcast.com​ \n\nStay Healthy, Stay Ready- \nDeanna Marie Radulescu\n\n🎙️ New to streaming or looking to level up? Check out StreamYard and get $10 discount! 😍 https://streamyard.com/pal/d/4806488547524608",
      "release": "2024-04-17T12:33:25Z",
      "duration": "00:28:17",
      "explicit": false,
      "spotifyId": "2lqHDu4ky6ytW19MXFLIGd",
      "appleId": 1000652754229,
      "youTubeId": "2j1zq4NqBtw",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2lqHDu4ky6ytW19MXFLIGd",
        "apple": "https://podcasts.apple.com/podcast/dr-darla-shaw-from-cult-upbringing-to-inclusive-leadership/id1473450378?i=1000652754229",
        "youtube": "https://www.youtube.com/watch?v=2j1zq4NqBtw"
      }
    }
  ]
}