{
  "id": "b8aaffbd-a302-4f08-bf73-cf189160afea",
  "name": "LaidOPEN Podcast",
  "spotifyId": "7839I16W3CQiRYTrYRcBj9",
  "appleId": 1591077284,
  "episodes": [
    {
      "id": "d8ee6bc1-e4ce-49a7-b51f-d809cf6cd3bd",
      "title": "The Body Keeps the Score but the Church Keeps the Secrets with Margaret Bronson",
      "description": "Join host Charna Cassell for a raw and eye opening conversation with Margaret Bronson, founder of Deconstruction Doulas. Margaret grew up inside a high control Christian cult and survived domestic violence, child abuse, excommunication, and the long psychological fallout of authoritarian religion. Now she guides others through the same dismantling of belief systems that once owned them. In this episode, Margaret unpacks how she and her husband developed somatic practices to help survivors heal the trauma stored in the body after years of purity culture, spiritual coercion, and obedience enforced through shame and fear. She breaks down what truly happens inside high control religious communities and why so many people leaving them feel like they\u0027re stepping out of a parallel universe. This conversation also dives into the political reality many of us are waking up to. Margaret explains how the same ideology that shaped her childhood is now embedded in Project 2025, Christian Reconstructionism, and the growing Trad Wife movement. She outlines the playbook of modern theocrats and shows how personal trauma and national policy are intertwined when religion is weaponized. If you\u0027re feeling a visceral reaction to Project 2025, this episode will help you understand why. Margaret offers grounding tools, embodied healing practices, and a clear-eyed look at what we\u0027re facing as the country edges closer to an openly theocratic agenda. Tune in for a fierce, validating, and deeply necessary conversation for anyone untangling from religious trauma or trying to make sense of this political moment. Show Notes: 00:00 Introduction and Content Warning 01:20 Meet Margaret Bronson: A Journey of Healing 03:17 Life in a Cult: Margaret\u0027s Early Years 04:03 Excommunication and Its Aftermath 06:07 Deconstruction Doulas: Birth of a Support System 06:30 Parental Vulnerability and Cult Recruitment 08:24 The Impact of Cult Ideology 13:43 Breaking Free: Personal and Collective Healing 18:02 Somatic Practices and Reclaiming the Body 19:31 Navigating Sexual Trauma and Rediscovery 25:42 Resources and Support for Survivors 26:35 Generational Trauma and Abuse 27:55 Challenges in Seeking Help 29:49 The Trad Wife Movement 33:17 Christian Reconstructionism and Theocracy 39:21 Embodied Freedom and Healing 46:25 Practical Exercises for Grounding 49:09 Conclusion and Resources",
      "release": "2025-11-18T18:15:00Z",
      "duration": "00:50:47.8050000",
      "explicit": false,
      "spotifyId": "1VhnzjoI0TCpBu9Y7zS7Xt",
      "appleId": 1000737193447,
      "subjects": [
        "Purity Culture",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1VhnzjoI0TCpBu9Y7zS7Xt",
        "apple": "https://podcasts.apple.com/podcast/the-body-keeps-the-score-but-the-church/id1591077284?i=1000737193447"
      }
    }
  ]
}