{
  "id": "35f5b490-607d-46c8-88c1-114244e91b38",
  "name": "Lara Land",
  "spotifyId": "3QJgYw2rzHAQx3g11ZNT1G",
  "appleId": 1616708763,
  "youTubeChannelId": "UCHaGTF92j6Wxx1gkSP0Fv7Q",
  "episodes": [
    {
      "id": "ebe4ade5-57a1-4011-892d-689d2060a7d7",
      "title": "50 | Cult Recruitment, Vulnerability \u0026 Recovery | Dr. Steve Eichel",
      "description": "In this riveting conversation with cult expert Dr. Steve Eichel, we uncover the common recruitment strategies of some of the most notorious cults. Dr. Eichel shares his personal experience infiltrating a cult and the tactics they used on him and the rest of his cohort. That early encounter with cult culture informed his decades-long work supporting survivors of cult trauma and their families. We cover human psychology and how it impacts politics, signs you might be in a high-demand organization, and the parallels between intimate partner violence (IPV) and cult practices. Dr. Steve Eichel has been a licensed psychologist since 1982. He received his M.S. and Ph.D. degrees from the University of Pennsylvania after which he spent many years as a child and family psychologist and as a director of child and family services. Currently, in addition to his private practice, Dr. Eichel serves as an Adjunct Associate Professor of Psychology at the University of Delaware. He has a specialty in drug and alcohol counseling and cultic practices, a subject he has written many articles dissecting. ------------------------------------------------------------------------------------------------------------ Your support is deeply appreciated! Find me, Lara, on my Website / Instagram You can support this podcast with any level of donation here . Order The Essential Guide to Trauma Sensitive Yoga: How to Create Safer Spaces for All",
      "release": "2024-03-18T09:00:00Z",
      "duration": "01:00:12.4730000",
      "explicit": false,
      "spotifyId": "6KslQOflKaKiaYoUcks2nI",
      "appleId": 1000649554456,
      "youTubeId": "LIpOrk5tXoo",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KslQOflKaKiaYoUcks2nI",
        "apple": "https://podcasts.apple.com/podcast/cult-recruitment-vulnerability-recovery-dr-steve-eichel/id1616708763?i=1000649554456",
        "youtube": "https://www.youtube.com/watch?v=LIpOrk5tXoo"
      }
    }
  ]
}