{
  "id": "b7822186-a333-40d0-a95f-a0b52fa6946b",
  "name": "Late Night Legends",
  "youTubeChannelId": "UCnefjugkGgXVsRzOLr77FLQ",
  "episodes": [
    {
      "id": "6f011537-fd4c-4d2c-9aac-8c01e46ad55b",
      "title": "The Rajneeshpuram Cult: Oregon’s Forgotten Nightmare",
      "description": "Tonight on Late Night Legends, Charlie leads us into the eerie, intoxicating, and terrifying history of the Rajneeshpuram cult of Oregon. Thousands of followers in crimson robes followed their guru into the desert, built a city, poisoned a town, and nearly rewrote history with the largest bioterror attack in America.\n\nBut this episode is even more special—it’s Ashley’s very first show with us! 🎉\nJoin us in giving her a spooky welcome by liking this video and subscribing for more haunted adventures with her. She’s bringing her own brand of chills to the Legends table, and you won’t want to miss what’s next.\n\n👉 Check out Ashley’s other content here: https://linktr.ee/ashvsevilbread\n\n\n💀 Go haunt her follow button… drift like a ghost into her channel and subscribe.\n\nAnd don’t forget… something wicked this way comes. 👀 Our Halloween Special 2025 is brewing—and this year, the entire Late Night Legends crew will be dressed as characters straight out of the Potterverse! ⚡🪄\nWill dark magic reign? Will mischief actually stay managed? You’ll have to see for yourself… Trust us, this is one you’ll want to watch live.\n\nHere at the Late Night Legends, we think spooky season should last all year long! Join our community of restless spirits to ask the Legends questions and keep the conversation going:\n👉 https://discord.gg/kESdgRH47U",
      "release": "2025-09-29T15:00:09Z",
      "duration": "01:05:52",
      "explicit": false,
      "youTubeId": "5fu_RcuqpwY",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5fu_RcuqpwY"
      }
    }
  ]
}