{
  "_ts": 0,
  "id": "dc27e09e-d7cc-4d23-97e6-3a812b5ae42b",
  "name": "Lately",
  "spotifyId": "66hW3O6eftDv4Ui8R8ecjZ",
  "appleId": 1738584308,
  "episodes": [
    {
      "id": "5dec1b12-06e3-471a-9f99-d2be5668348c",
      "title": "The $3-billion industry where almost nobody makes money",
      "description": "Tupperware just filed for bankruptcy, but the direct sales model it pioneered lives on. These days, the hustle might be candles, leggings or sex toys. You may be recruited to join via a Facebook friend, who will call this “social selling.” But really, it’s multi–level marketing – a $3–billion industry where the vast majority of salespeople make little to no money. Here to unpack it all is our guest, Peabody and Emmy Award–winning investigative journalist Jane Marie, host of the podcast The Dream and author of Selling the Dream: The Billion-Dollar Industry Bankrupting Americans, an exposé of the dark side of MLMs. Marie talks to us about how the business model attracts good people in a bad economy. Instead of #bossbabe independence, they find themselves broke and ashamed, drowning in unsellable stuff, and wondering: “Hey, am I in a cult?” This is Lately. Every week, we take a deep dive into the big, defining trends in business and tech that are reshaping our every day. Our executive producer is Katrina Onstad. This episode is produced by Andrea Varsany and Jay Cockburn. Our sound designer is Cameron McIver. Subscribe to the Lately newsletter , where we unpack more of the latest in business and technology. Find the transcript of today’s episode here. We’d love to hear from you. Send your comments, questions or ideas to lately@globeandmail.com.",
      "release": "2024-09-27T09:00:00Z",
      "duration": "00:33:39.0560000",
      "explicit": false,
      "spotifyId": "1dL7PHoHV4lLyGV1BUZykH",
      "appleId": 1000670919060,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1dL7PHoHV4lLyGV1BUZykH",
        "apple": "https://podcasts.apple.com/podcast/the-%243-billion-industry-where-almost-nobody-makes-money/id1738584308?i=1000670919060"
      }
    }
  ]
}