{
  "_ts": 0,
  "id": "cf039242-cd0f-4ef7-91fa-54617b86ff24",
  "name": "Laura X Timber",
  "youTubeChannelId": "UCPR3FHz8hj9OhI2qR2zxRYw",
  "episodes": [
    {
      "id": "e9262219-71e6-4939-9e74-046ad00a8318",
      "title": "EX JW Elder Breaks Silence on Abuse, Shunning \u0026 Cult Tactics - Daily J Speaks Out!",
      "description": "EX JW Elder Breaks Silence on Abuse, Shunning \u0026 Cult Tactics\n\nIn this raw and real interview, Jay shares his deeply personal and emotional journey of escaping the high-control world of the Jehovah’s Witnesses. Originally from Mexico, his family immigrated to the U.S. as devoted Catholics but everything changed for Jay’s family when they got that infamous knock at the door. What followed was love bombing, manipulation, and a descent into a world ruled by fear, control, and unquestionable authority.\n\nJay reveals how his mother was swept into the Jehovah’s Witness cult, threatening to leave his father, unless she could raise her children within the religion. His father called it what it was — a cult — but resistance only brought more division and he allowed it. At just 12, Jay was baptized into the Jehovah’s Witnesses, fully immersed in the organization\u0027s grip.\n\nAt 16, he became a ministerial servant (deacon). By 23, he was married and well on his way up the ranks. Eventually, he was appointed an Elder, witnessing firsthand how the Watchtower Society deals with internal abuse, allegations, and predators within the church.\n\n🛑 What he shares is disturbing — including how abuse victims are silenced, predators protected, and women marginalized. Jay was told to “stay in his lane,” never question the Elders above him, and keep things quiet, no matter how serious.\n\nAfter years of spiritual suppression, emotional manipulation, and watching the harm unfold, Jay finally walked away. But leaving the Jehovah’s Witnesses came at a massive cost: he lost his marriage, friends, and even family who were still inside. He was shunned, isolated, and left to rebuild from scratch — like so many Ex JWs who are cast out after choosing truth over fear.\n\n📌 If you’re an Ex Jehovah’s Witness, someone currently questioning the organization, or a survivor of religious trauma, this video will resonate deeply. It’s raw, real, and completely unfiltered. Jay’s story shines a light on the emotional abuse, spiritual gaslighting, and toxic culture of silence that thrives inside high-control groups like the Jehovah’s Witnesses.\n\n💬 Comment below if you\u0027ve been through something similar, or are ready to share your own Ex JW testimony.\n\n📲 Don’t forget to subscribe for more raw interviews with Ex Jehovah’s Witnesses, former cult members, and people rebuilding their lives after religious trauma.\n\nSupport and Follow Jay\nhttps://www.youtube.com/@UCJSKQTvXgb3WapRaZ6w3DLg \n\nLaura X Timber\nhttps://www.youtube.com/@lauraxtimber\nhttps://www.facebook.com/profile.php?id=61566000317102\nhttps://www.tiktok.com/@UCPR3FHz8hj9OhI2qR2zxRYw \n\n#ExJehovahsWitness  #ExJW  #JehovahsWitnessCult  #WatchtowerExposed  #CultSurvivor  \n#ReligiousTrauma  #SpiritualAbuse  #LeavingTheWitnesses  #Disfellowshipped  #Shunned",
      "release": "2025-05-16T19:01:46Z",
      "duration": "00:25:03",
      "explicit": false,
      "youTubeId": "QrvylD8CMxc",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QrvylD8CMxc"
      }
    },
    {
      "id": "98649a79-b338-41c0-a5f1-782ceff9ca0f",
      "title": "I left Jehovah\u0027s Witnesses   I Never Saw My Family Again - Ex JW Bethany from Stop the Shunning",
      "description": "I Left Jehovah\u0027s Witnesses - I Never Saw My Family Again - Bethany from Stop the Shunning\u0022\n\nLeaving the Jehovah’s Witnesses isn’t just about walking away from a religion—it’s about losing everything you thought you knew. In this powerful and emotional interview, Bethany from Stop the Shunning shares her heartbreaking story of being shunned by her entire family after leaving the Jehovah’s Witnesses cult. If you’re an Ex-JW, thinking of leaving, or simply seeking to understand the real cost of leaving Jehovah’s Witnesses, this video is a must-watch.\n\nBethany opens up about the hidden truths she discovered—specifically the Watchtower’s cover-up of childhood abuse—and how those revelations shattered her faith. The organization preaches against other religions like Catholicism while hiding the same systemic abuse within its own walls. The hypocrisy and control became undeniable. Using the B.I.T.E. model of cult behavior (Behavior, Information, Thought, and Emotional control), we break down why Jehovah’s Witnesses meet nearly every criterion of a high-control religious group—a cult.\n\nWhether you’ve already left or are still inside questioning things, this video will resonate deeply. Bethany doesn’t just tell her story—she offers hope, advice, and support for those navigating disfellowshipping, religious trauma, family shunning, and the painful isolation that follows. She also shares how she’s rebuilding her life and finding freedom and healing after religious abuse.\n\n Don’t miss out—subscribe for more raw and honest Ex-JW interviews, survivor stories, and support.\n Like, comment, and share to help others find this vital information.\n\nBethany - Stop the Shunning\nhttps://www.youtube.com/@stoptheshunning\nwww.bethanyleger.com\n\nLaura X Timber\nhttps://www.youtube.com/@lauraxtimber\nhttps://www.facebook.com/profile.php?id=61566000317102\nhttps://www.tiktok.com/@lauraxtimber\n#ExJW #JehovahsWitnesses #StopTheShunning #CultSurvivor #ReligiousTrauma #Shunning #ExJWInterview #BITEModel #WatchtowerExposed #PeopleAndLifestyle",
      "release": "2025-05-02T19:17:48Z",
      "duration": "00:58:44",
      "explicit": false,
      "youTubeId": "I2JiFKDUnfw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=I2JiFKDUnfw"
      }
    },
    {
      "id": "afc7c4d5-0118-454a-b0ad-3ecc6ec00edd",
      "title": "SHUNNED by My Own Family! EX JW Speaks Out - Ex Jehovah\u0027s Witness Story",
      "description": "SHUNNED by My Own Family! EX JW Speaks Out | Ex-Jehovah\u0027s Witness Story\n\nWhat happens when you leave Jehovah\u0027s Witnesses? In this powerful Ex-JW interview, Alissa opens up about the heartbreaking reality of being shunned by her family after leaving the Jehovah\u0027s Witness (JW) organization. Her parents, in-laws, and even her sister-whom she once trusted-have completely cut her off. But she refuses to stay silent.\n\nThis eye-opening discussion exposes the high-control nature of the Jehovah\u0027s Witness religion, the fear that kept her trapped for years, and the painful consequences of leaving. She shares her journey of breaking free from the JW cult, reclaiming her identity, and helping others realize that it\u0027s okay to walk away.\n\nIf you are an Ex-JW, a former Jehovah\u0027s Witness, or someone healing from religious trauma, this video is for you. Many ex-members struggle with shunning, religious trauma, and emotional abuse after leaving. This story is a message of hope, resilience, and empowerment for those seeking freedom from the Watchtower Society and its strict doctrine.\n\n💬 Have you experienced shunning after leaving Jehovah\u0027s Witnesses? Share your thoughts in the comments below-let\u0027s build a supportive community for Ex-JWs!\n\n🔔 Subscribe for more eye-opening Ex-JW stories, religious trauma recovery, and interviews with former Jehovah\u0027s Witnesses!\n\n👍 Like \u0026 share to help this video reach others trapped in high-control religions.\n\nAlissa \nYouTube https://www.youtube.com/@athomewithalissa\nInstagram https://www.instagram.com/athome_withalissa/\nTikTok https://www.tiktok.com/@athomewithalissa\n\nLaura X Timber\nhttps://www.youtube.com/@lauraxtimber\nhttps://www.facebook.com/profile.php?id=61566000317102\nhttps://www.tiktok.com/@lauraxtimber\n\n#ExJW #JehovahsWitness #ReligiousTrauma #ExJehovahsWitness #Shunned #CultSurvivor #BreakingFree #Watchtower #ExJWRecovery #LeavingJehovahsWitnesses #HighControlReligion #ReligiousAbuse #ExJWStories #Shunning #SpiritualAbuse",
      "release": "2025-04-03T20:34:03Z",
      "duration": "00:32:56",
      "explicit": false,
      "youTubeId": "nJtJbP5X5Ok",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nJtJbP5X5Ok"
      }
    },
    {
      "id": "f1d198f2-1043-4e38-a386-776b2e6a1d1e",
      "title": "Finding Freedom From Spiritual Bondage and Discovering Truth -  Ex Jehovah\u0027s Witness - Isaac Miller",
      "description": "Finding Freedom From Spiritual Bondage and Discovering Truth -  Ex Jehovah\u0027s Witness - Isaac Miller\n\nLeaving the Jehovah\u0027s Witness (JW) religion can be overwhelming, especially when searching for true spirituality and a deeper connection with God. In this powerful interview, Isaac Miller, an Ex-Jehovah\u0027s Witness, shares his journey of breaking free from the high-control JW organization and discovering his own faith outside of Watchtower teachings.\n\nIf you\u0027re an Ex-JW feeling lost, questioning your beliefs, or struggling to find your spiritual path after leaving the Jehovah\u0027s Witnesses, this video is for you. Isaac opens up about the emotional challenges of leaving a high-control religion, dealing with shunning, and navigating the difficult process of deconstructing JW doctrine. His story will resonate with former Jehovah\u0027s Witnesses looking to break free from religious fear and find their own version of God.\n\nWe dive deep into topics like:\n✅ The emotional toll of leaving the Jehovah\u0027s Witnesses\n✅ How the Watchtower controls beliefs and suppresses free thinking\n✅ Finding true faith and spirituality beyond JW teachings\n✅ The struggles of shunning and family rejection\n✅ Rebuilding life and identity after leaving a high-control religion\n\nIf you\u0027re searching for answers, healing, or support after leaving the Jehovah\u0027s Witnesses, this conversation will give you hope, guidance, and inspiration. You\u0027re not alone! Many Ex-JWs have found freedom, happiness, and a deeper relationship with God outside of the Watchtower.\n\n🔔 Subscribe for more powerful Ex-JW interviews and stories!\n👍 Like \u0026 Share to help others break free from religious control!\n💬 Comment below if you relate to Isaac\u0027s journey!\n\nIsaac Miller - Tune Up Your Mind\nhttps://www.youtube.com/@JustWakeUp2704\nwebsite: www.isaacsmiller.com\n\nLaura X Timber\nhttps://www.youtube.com/@lauraxtimber\nhttps://www.facebook.com/profile.php?id=61566000317102\nhttps://www.tiktok.com/@lauraxtimber\n\n#ExJW #JehovahsWitness #ReligiousTrauma #FindingGod #SpiritualFreedom #ExJWspeakout #LeavingTheWatchtower #FaithAfterReligion #HighControlReligion #ReligiousDeconstruction",
      "release": "2025-03-29T21:37:22Z",
      "duration": "00:27:19",
      "explicit": false,
      "youTubeId": "X313VzycxUU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=X313VzycxUU"
      }
    },
    {
      "id": "1d45fdd0-f213-4715-bc01-3c247796f752",
      "title": "Ex JW Exposes the Hidden Abuse in the Cult",
      "description": "Are you an ex-Jehovah\u0027s Witness or someone recovering from religious trauma? In this eye-opening video, Ex JW Exposes the Hidden Abuse in the Cult, we delve into the untold stories of abuse, manipulation, and control within the Jehovah’s Witness organization. Whether you\u0027re an ex-JW survivor, questioning your faith, or seeking support in your journey to heal from religious trauma, this video uncovers the harsh realities often hidden behind closed doors.\n\nJoin us as we shed light on the psychological, emotional, and spiritual toll of life in a high-control religious group. We discuss key topics like SA, disfellowshipping, and the emotional isolation faced by ex-JWs, offering hope and support to those looking to reclaim their lives after leaving the Jehovah\u0027s Witness cult.\n\nThis video is for you if you’re searching for answers, validation, or a community of like-minded individuals who understand your experience. Don’t forget to like, comment, and subscribe to join the conversation and help others find this important message.",
      "release": "2024-12-20T19:00:06Z",
      "duration": "00:27:38",
      "explicit": false,
      "youTubeId": "ZFkfKyja7tI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZFkfKyja7tI"
      }
    },
    {
      "id": "83a027a1-9257-48fa-9d0d-06186c67a77d",
      "title": "Is JW a CULT? Hear Elle Reno\u0027s Horrific Experience! - EX JW - Interview",
      "description": "\u0022Is JW a CULT? Hear Elle Reno\u0027s Horrific Experience! - EX JW - Interview \u0022 takes you on a powerful and emotional exploration of life after leaving a high-control group. This video dives deep into the experiences of former Jehovah\u0027s Witnesses breaking free from the grip of cults and high-control organizations.\n\nIf you’ve recently left the Jehovah\u0027s Witnesses or are contemplating leaving a similar group, this video offers encouragement, hope, and practical insights. Discover the challenges Elle faced during the journey of healing from religious trauma, rebuilding a sense of self, and finding freedom.\n\nLearn about common struggles like overcoming the fear of shunning, coping with emotional manipulation, and reclaiming personal autonomy. This video is ideal for ex-Jehovah’s Witnesses, ex-cult members, or anyone seeking information on deprogramming from cults and starting anew.\n\nAt Laura X Timber we welcome all people to join the conversation and help those transitioning out of high-control groups.\n\nDon’t miss out—subscribe for more videos on leaving cults, healing journeys, and personal growth. Like, share, and comment to connect with a supportive community of others who understand your experience.\n\nElle Reno\nhttps://www.youtube.com/@UClKj9XNWYI0Y1DD-nleyzJg \n\nLaura X Timber\nhttps://www.youtube.com/@lauraxtimber \nhttps://www.facebook.com/profile.php?id=61566000317102\nhttps://www.tiktok.com/@lauraxtimber\n\n#ExJehovahsWitness #CultRecovery #exjw #jw #ReligiousTrauma #breakingstigmas  #mentalhealthawareness #MentalHealth #addictionrecovery #survivingtrauma #addictionrecoverypath #peopleandblogs",
      "release": "2024-12-13T13:00:06Z",
      "duration": "00:47:54",
      "explicit": false,
      "youTubeId": "xkIJp05aywg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xkIJp05aywg"
      }
    },
    {
      "id": "b16e9557-fc28-4ecc-adfc-7b4b75aceed3",
      "title": "The Ex-Amish Woman Who Became a Missionary",
      "description": "Discover the inspiring journey of an ex-Amish woman who overcame cultural and religious barriers to embrace a new life as a missionary. In \u0022The Ex-Amish Woman Who Became a Missionary,\u0022 we dive into her remarkable story of courage, faith, and transformation. This video is a must-watch for anyone curious about leaving the Amish lifestyle or navigating life as an ex-Amish individual.\n\nLearn about the challenges faced when breaking away from the traditional Amish way of life and the steps she took to rebuild her identity. Whether you’re considering leaving the Amish community, adjusting to the outside world, or seeking guidance on starting a fresh chapter, this video offers hope, encouragement, and practical advice.\n\nSarah\nhttps://www.youtube.com/@UC6HLpjsNxhexD7TT_7uJZPA \n\nLaura X Timber\nhttps://www.youtube.com/@UCPR3FHz8hj9OhI2qR2zxRYw \nhttps://www.facebook.com/profile.php?id=61566000317102\nhttps://www.tiktok.com/@lauraxtimber\n\n🔔 Don’t forget to like, subscribe, and share to reach others who might need this message! \n\nJoin the conversation and connect with a community that understands your journey. \n#examish   #LeavingAmish #AmishStories #FaithJourney #LifeTransformation #breakingstigmas  #mentalhealthawareness #MentalHealth #survivingtrauma #peopleandblogs",
      "release": "2024-12-04T19:42:41Z",
      "duration": "00:29:58",
      "explicit": false,
      "youTubeId": "A4xU83VCkpU",
      "subjects": [
        "Amish"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A4xU83VCkpU"
      }
    },
    {
      "id": "91769719-fb73-4f2c-9928-e1d618af405d",
      "title": "How I Escaped the IFB Cult - SA Survivor - Amber Interview",
      "description": "In this eye-opening video, Amber shares her story of growing up in the Independent Fundamental Baptist (IBF) church, and how it has shaped her life.  From the strict rules and regulations to the SA, physical, and emotional abuse. Amber will reveal the dark side of her childhood.  If you\u0027re a survivor of a cult experience or are interested in cult recovery, this video is for you. Join Amber as she opens up about her journey and shares her experiences of breaking free from the cult\u0027s grasp.\n\nhttps://www.youtube.com/@fundiefreed\nhttps://www.tiktok.com/@fundiefreed\nhttps://www.facebook.com/profile.php?id=100087950148177\n\nLaura X Timber\nhttps://www.tiktok.com/@UCPR3FHz8hj9OhI2qR2zxRYw \nhttps://www.facebook.com/people/Laura-X-Timber/61566000317102/",
      "release": "2024-11-07T19:51:25Z",
      "duration": "00:13:51",
      "explicit": false,
      "youTubeId": "uwmi6HpFSD8",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uwmi6HpFSD8"
      }
    },
    {
      "id": "8ea61de2-1aeb-4992-8d64-7f75d794388b",
      "title": "How I Left the Amish Community- Jacob - Ex-Amish Interview",
      "description": "In this eye-opening interview, Jacob shares his emotional and inspiring story of escaping the Amish community in Canada, where he faced physical abuse and childhood trauma. Having been shunned by the Amish community, Jacob bravely opens up about his experiences, offering a unique insight into the lives of those who have left the Amish. From the struggles of adapting to modern life to the lingering effects of trauma, Jacob\u0027s story is a powerful testament to the human spirit. Join us as we delve into the world of the Ex-Amish, and explore the complexities of leaving a community that is often shrouded in mystery.\n\nIf you would like to share your story, please email me: lauraxtimbers@gmail.com\n\nhttps://www.youtube.com/@UCkg8MTSk_Luv3_0xH6FGAYQ\n\nLaura X Timber\nhttps://www.youtube.com/@lauraxtimber?sub_confirmation=1\nhttps://www.tiktok.com/@lauraxtimber\nFB Page: Laura X Timber https://www.facebook.com/profile.php?id=61566000317102\n\n#PeopleAndBlogs #FightingAddiction #recoveryjourney #breakingstigmas  #mentalhealthawareness #MentalHealth  #survivingtrauma",
      "release": "2024-10-25T19:16:45Z",
      "duration": "00:39:39",
      "explicit": false,
      "youTubeId": "nYCxsCj_MY4",
      "subjects": [
        "Amish"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nYCxsCj_MY4"
      }
    }
  ]
}