{
  "id": "d8478f54-21a0-40e3-be48-d43b8756c200",
  "name": "Lauren Marie",
  "youTubeChannelId": "UCblL6ggwzxiv5c4H2iWccxw",
  "episodes": [
    {
      "id": "ed71204e-0ea0-48d2-a85b-c63133473617",
      "title": "Fear Indoctrination and Mystical Manipulation in Cults",
      "description": "Before you ask someone - \u0022Why didn’t you leave sooner? Or why don’t you just quit?\u0022 You need to understand the powerful dynamics at play inside cults and high-demand groups and some religious organizations.\n\nIn today\u0027s video, we delve deep into the disturbing world of fear indoctrination, a tactic used by cults and manipulative organizations to control their members. This coercive method focuses on instilling fear to suppress any form of dissent and ensure unwavering obedience. From preaching end-of-the-world scenarios and isolating members from the outside world, to invoking fear of the unknown and the potential loss of one\u0027s identity, we\u0027ll explore how these tactics play a pivotal role in a member\u0027s life. \n\nThe extent of this control even reaches public humiliation sessions often used by LGATs (Large Group Awareness Trainings). By understanding these methods, we aim to shed light on the dangers of such organizations and the psychological grip they hold over individuals. \n\nTune in to uncover the layers behind these chilling strategies.",
      "release": "2023-10-19T10:06:19Z",
      "duration": "00:22:33",
      "explicit": false,
      "youTubeId": "qzi3F6udCPM",
      "subjects": [
        "Large Group Awareness Trainings"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qzi3F6udCPM"
      }
    },
    {
      "id": "835acb66-eb64-49a7-a208-388c6f94cb1f",
      "title": "Attacked for Leaving a Cult",
      "description": "After 12 years of being in a cult, I woke up and left and today I want to talk about being a whistleblower and the process that abusers will use when confronted. \n\nMy intention in shedding light on this is that it will free someone who watches this to be able to leave, to speak out and to not blame or gaslight yourself for the things that the abusers do to you when you finally become strong enough to leave.\n\n*editors note: At 3 minutes in there was a 16 second audio clip of the leader of this group which we were asked to removed as it is proprietary material\n\nDARVO stands for \u0027Deny, Attack, and Reverse Victim and Offender.\u0027 \n\nPerpetrators often use DARVO to shame victims into believing they are responsible for the abuse.\n\nThe original email series I put out that triggered their attack can be found here: https://docs.google.com/document/d/1mJx-65bbvOqLjWHFGCIJo3zZO9ulDLSudbvXAVydOgE/edit?usp=sharing\n\nDr. Janja Lalich and her work on Cults, Extremism, \u0026 Undue Influence can be found here: https://janjalalich.com/\n\nJanja works to promote a deeper, more accurate understanding of cults with the intent to avoid their manipulation, exploitation, and abuse.\n\nCheck out and follow the #igotout movement. \n\nThe mission of #igotout is to inspire survivors of high-demand environments who have experienced cultic, religious, or spiritual abuse to tell and share their stories - if and when it\u0027s safe to do so.",
      "release": "2023-03-16T11:12:24Z",
      "duration": "00:18:33",
      "explicit": false,
      "youTubeId": "HeRhFCOc10U",
      "subjects": [
        "Cult-Expert",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HeRhFCOc10U"
      }
    }
  ]
}