{
  "_ts": 0,
  "id": "cf039242-cd0f-4ef7-91fa-54617b86ff24",
  "name": "Laura X Timber",
  "youTubeChannelId": "UCPR3FHz8hj9OhI2qR2zxRYw",
  "episodes": [
    {
      "id": "83a027a1-9257-48fa-9d0d-06186c67a77d",
      "title": "Is JW a CULT? Hear Elle Reno\u0027s Horrific Experience! - EX JW - Interview",
      "description": "\u0022Is JW a CULT? Hear Elle Reno\u0027s Horrific Experience! - EX JW - Interview \u0022 takes you on a powerful and emotional exploration of life after leaving a high-control group. This video dives deep into the experiences of former Jehovah\u0027s Witnesses breaking free from the grip of cults and high-control organizations.\n\nIf you’ve recently left the Jehovah\u0027s Witnesses or are contemplating leaving a similar group, this video offers encouragement, hope, and practical insights. Discover the challenges Elle faced during the journey of healing from religious trauma, rebuilding a sense of self, and finding freedom.\n\nLearn about common struggles like overcoming the fear of shunning, coping with emotional manipulation, and reclaiming personal autonomy. This video is ideal for ex-Jehovah’s Witnesses, ex-cult members, or anyone seeking information on deprogramming from cults and starting anew.\n\nAt Laura X Timber we welcome all people to join the conversation and help those transitioning out of high-control groups.\n\nDon’t miss out—subscribe for more videos on leaving cults, healing journeys, and personal growth. Like, share, and comment to connect with a supportive community of others who understand your experience.\n\nElle Reno\nhttps://www.youtube.com/@UClKj9XNWYI0Y1DD-nleyzJg \n\nLaura X Timber\nhttps://www.youtube.com/@lauraxtimber \nhttps://www.facebook.com/profile.php?id=61566000317102\nhttps://www.tiktok.com/@lauraxtimber\n\n#ExJehovahsWitness #CultRecovery #exjw #jw #ReligiousTrauma #breakingstigmas  #mentalhealthawareness #MentalHealth #addictionrecovery #survivingtrauma #addictionrecoverypath #peopleandblogs",
      "release": "2024-12-13T13:00:06Z",
      "duration": "00:47:54",
      "explicit": false,
      "youTubeId": "xkIJp05aywg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xkIJp05aywg"
      }
    },
    {
      "id": "b16e9557-fc28-4ecc-adfc-7b4b75aceed3",
      "title": "The Ex-Amish Woman Who Became a Missionary",
      "description": "Discover the inspiring journey of an ex-Amish woman who overcame cultural and religious barriers to embrace a new life as a missionary. In \u0022The Ex-Amish Woman Who Became a Missionary,\u0022 we dive into her remarkable story of courage, faith, and transformation. This video is a must-watch for anyone curious about leaving the Amish lifestyle or navigating life as an ex-Amish individual.\n\nLearn about the challenges faced when breaking away from the traditional Amish way of life and the steps she took to rebuild her identity. Whether you’re considering leaving the Amish community, adjusting to the outside world, or seeking guidance on starting a fresh chapter, this video offers hope, encouragement, and practical advice.\n\nSarah\nhttps://www.youtube.com/@UC6HLpjsNxhexD7TT_7uJZPA \n\nLaura X Timber\nhttps://www.youtube.com/@UCPR3FHz8hj9OhI2qR2zxRYw \nhttps://www.facebook.com/profile.php?id=61566000317102\nhttps://www.tiktok.com/@lauraxtimber\n\n🔔 Don’t forget to like, subscribe, and share to reach others who might need this message! \n\nJoin the conversation and connect with a community that understands your journey. \n#examish   #LeavingAmish #AmishStories #FaithJourney #LifeTransformation #breakingstigmas  #mentalhealthawareness #MentalHealth #survivingtrauma #peopleandblogs",
      "release": "2024-12-04T19:42:41Z",
      "duration": "00:29:58",
      "explicit": false,
      "youTubeId": "A4xU83VCkpU",
      "subjects": [
        "Amish"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A4xU83VCkpU"
      }
    },
    {
      "id": "91769719-fb73-4f2c-9928-e1d618af405d",
      "title": "How I Escaped the IFB Cult - SA Survivor - Amber Interview",
      "description": "In this eye-opening video, Amber shares her story of growing up in the Independent Fundamental Baptist (IBF) church, and how it has shaped her life.  From the strict rules and regulations to the SA, physical, and emotional abuse. Amber will reveal the dark side of her childhood.  If you\u0027re a survivor of a cult experience or are interested in cult recovery, this video is for you. Join Amber as she opens up about her journey and shares her experiences of breaking free from the cult\u0027s grasp.\n\nhttps://www.youtube.com/@fundiefreed\nhttps://www.tiktok.com/@fundiefreed\nhttps://www.facebook.com/profile.php?id=100087950148177\n\nLaura X Timber\nhttps://www.tiktok.com/@UCPR3FHz8hj9OhI2qR2zxRYw \nhttps://www.facebook.com/people/Laura-X-Timber/61566000317102/",
      "release": "2024-11-07T19:51:25Z",
      "duration": "00:13:51",
      "explicit": false,
      "youTubeId": "uwmi6HpFSD8",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uwmi6HpFSD8"
      }
    },
    {
      "id": "8ea61de2-1aeb-4992-8d64-7f75d794388b",
      "title": "How I Left the Amish Community- Jacob - Ex-Amish Interview",
      "description": "In this eye-opening interview, Jacob shares his emotional and inspiring story of escaping the Amish community in Canada, where he faced physical abuse and childhood trauma. Having been shunned by the Amish community, Jacob bravely opens up about his experiences, offering a unique insight into the lives of those who have left the Amish. From the struggles of adapting to modern life to the lingering effects of trauma, Jacob\u0027s story is a powerful testament to the human spirit. Join us as we delve into the world of the Ex-Amish, and explore the complexities of leaving a community that is often shrouded in mystery.\n\nIf you would like to share your story, please email me: lauraxtimbers@gmail.com\n\nhttps://www.youtube.com/@UCkg8MTSk_Luv3_0xH6FGAYQ\n\nLaura X Timber\nhttps://www.youtube.com/@lauraxtimber?sub_confirmation=1\nhttps://www.tiktok.com/@lauraxtimber\nFB Page: Laura X Timber https://www.facebook.com/profile.php?id=61566000317102\n\n#PeopleAndBlogs #FightingAddiction #recoveryjourney #breakingstigmas  #mentalhealthawareness #MentalHealth  #survivingtrauma",
      "release": "2024-10-25T19:16:45Z",
      "duration": "00:39:39",
      "explicit": false,
      "youTubeId": "nYCxsCj_MY4",
      "subjects": [
        "Amish"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nYCxsCj_MY4"
      }
    }
  ]
}