{
  "id": "34b9848f-e436-43da-b43e-9576699bc75c",
  "name": "Law Enforcement Talk: True Crime and Trauma Stories",
  "spotifyId": "2GTfUgDDVeVaqSI6p3VTNh",
  "appleId": 1217923682,
  "youTubeChannelId": "UCay_jYIy9Zbi4MYJJmkPHGQ",
  "episodes": [
    {
      "id": "e5736701-80aa-4067-b69d-eb9be59a6fe0",
      "title": "Married to a Cult Leader The Mysterious Death",
      "description": "Married to a Cult Leader The Mysterious Death of Her Son and Isabella Young’s Journey from California to Hawaii. Isabella Young\u0027s story reads like a modern-day epic, equal parts heartbreak, healing, and spiritual transformation. Once married to a cult leader in Southern California and later a grieving mother after the mysterious death of her son, Isabella has emerged from unimaginable darkness to become a beacon of hope, wisdom, and resilience. Now living in Hawaii, she shares her harrowing journey through her books, art, and online presence, reaching audiences on Facebook, Instagram, Apple Podcasts, Spotify, and more. “I didn’t want to die, but I didn’t know how to live,” she says. “That’s when I began the deepest journey of my life.” A Sudden Loss and the Start of a Spiritual Odyssey Isabella’s life took a tragic turn in 1994 when she was widowed while pregnant, left to raise a three-year-old son alone. The grief of losing her husband was only the beginning. Driven by a desperate need for healing and understanding, she set off on a quest that spanned three continents, embracing everything from shamanic journeys and vision quests to living in ashrams, and retreats. But the path she hoped would heal her led instead to deeper suffering. She became entangled in what she now identifies as a \u0022messianic cult\u0022 in Southern California, a group with disturbing similarities to the infamous spiritual movements that once flourished in the Golden State. Married to a Cult Leader The Mysterious Death of Her Son and Isabella Young’s Journey from California to Hawaii. Cults and California: A Dangerous Combination From \u0022Heaven’s Gate\u0022 and the \u0022Manson Family\u0022 to the \u0022Peoples Temple\u0022 and more, Southern California has long been a magnet for unconventional spiritual movements, some with devastating outcomes. These groups often center around a charismatic leader, promise enlightenment, and prey on people during vulnerable moments, much like Isabella\u0027s own experience. “We came looking for healing,” Isabella recalls. “Instead, we became trapped.” The cult’s leader, Isabella’s husband at the time, exercised complete psychological control. She spent eight years in submission, surrendering her identity to the teachings of a man she now claims was directly responsible for her son’s \u0022murder\u0022, staged as a suicide. The Mysterious Death of Her Son Isabella’s teenage son died under suspicious circumstances that were quickly labeled a suicide. But to Isabella, the truth is much darker. Married to a Cult Leader The Mysterious Death of Her Son and Isabella Young’s Journey from California to Hawaii. “It wasn’t suicide,” she insists. “It was murder. And it was the final act that set me free.” The grief shattered her illusions. That moment, the deepest wound of her life, became the catalyst for escape. She fled the cult, fleeing California with nothing but a mother’s broken heart and a soul desperate for truth. From Trauma to Transformation in Hawaii Now residing in Hawaii, Isabella has spent the last several years rebuilding her life, and reclaiming her power. She shares her journey and healing modalities through her website, and through her writing, including her most recent book, New Human of New Earth: Medicine for the Freedom and Future of Humanity. In her book, Isabella explores ancient, indigenous wisdom and spiritual tools that she believes hold the key to personal and collective transformation in this era of chaos and awakening. Married to a Cult Leader The Mysterious Death of Her Son and Isabella Young’s Journey from California to Hawaii. “The world is changing fast,” she writes. “We need ancient wisdom now more than ever, for our health, our freedom, and our future.” Her message is not just spiritual, but deeply practical. She speaks to people facing trauma, confusion, and isolation in a rapidly evolving world, offering tools for sovereignty, truth, and divine embodiment. A Voice for the Voiceless Through social media, her podcast appearance on the Law Enforcement Talk Radio Show and Podcast available on their website, also on Apple Podcasts, Spotify, and others. Isabella is now a voice for those who’ve been silenced, especially former cult members and survivors of religious trauma. Her advocacy also touches on how governments and societies label spiritual movements, often with vague or politically motivated definitions. In fact, across countries like France, Germany, and Russia the term “cult” or “sect” has been used in ways that stigmatize non-traditional faiths, even when they don’t cause harm. But Isabella makes clear: when a movement exerts psychological control, separates families, or enables violence, it is no longer benign. Married to a Cult Leader The Mysterious Death of Her Son and Isabella Young’s Journey from California to Hawaii. Isabella’s Message Today As the world continues to shift, Isabella’s journey serves as both a warning and a light. From the tragedy of being married to a cult leader to surviving the \u0022murder\u0022 death of her son, she has emerged stronger, wiser, and more determined than ever to guide others toward awakening and autonomy. “The Great Awakening is real,” she says. “And each of us must take responsibility for our own healing, our own power, and our own truth.” If her message resonates with you, follow Isabella Young. Her books are available now and her story is being featured in a powerful podcast series streaming for free on the Law Enforcement Talk Radio Show and Podcast webnsite, also on Apple Podcasts, Spotify, and other major platforms. In a world where the line between spiritual freedom and manipulation is often blurred, Isabella Young’s journey is a rare testimony of courage, clarity, and rising from the ashes. Her story is more than a tale of survival, it\u0027s a blueprint for transformation. Married to a Cult Leader The Mysterious Death of Her Son and Isabella Young’s Journey from California to Hawaii.",
      "release": "2025-07-20T09:00:00Z",
      "duration": "00:38:53.2040000",
      "explicit": false,
      "spotifyId": "1OQobkZdrILkUPZzc0U6fx",
      "appleId": 1000718141142,
      "youTubeId": "qwuh7RofPVE",
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1OQobkZdrILkUPZzc0U6fx",
        "apple": "https://podcasts.apple.com/podcast/married-to-a-cult-leader-the-mysterious-death/id1217923682?i=1000718141142",
        "youtube": "https://www.youtube.com/watch?v=qwuh7RofPVE"
      }
    }
  ]
}