{
  "id": "0898cd1e-ebab-4ad4-aa41-2c267ade0031",
  "name": "Layla Martin",
  "youTubeChannelId": "UClrmRMLRlV-qsGbUaV6dOFQ",
  "episodes": [
    {
      "id": "bab0ce0b-3bd4-49a3-9a10-ad1d8374dcc2",
      "title": "My Experience Of Abuse At A Tantra School ( Agama Yoga ) – #MeToo",
      "description": "In sharing this, I hope that I can encourage a deeper healing and integration for all of us...and to also share a new vision for what yoga and tantra and healing can look like in the new world we are creating together of safety, integrity and accountability. \n\nYou can find the resources I talk about in the video below:\n\nFor reporting harassment, abuse, rape and other crimes.\nIf someone gets multiple reports, they are turned into law enforcement. You can remain anonymous and if you want, you can get connected to others who have reported the same perpetrator and receive legal support.\nhttps://jdoe.io/\n\nSophie Bekkering\nInstagram name is: bysophielua and\nwebsite: http://www.sophielua.com\n\nMahasatvaa Ma Anand Sarita\nTantra Essence with Mahasatvaa Ma Ananda Sarita\nThe sublime ecstasy of Tantra as a spiritual path\nhttp://www.tantra-essence.com/\n\nMinke De Vos\nhttp://www.femininetreasures.com/\n\nDownload my FREE healing breathwork exercise here: https://go.laylamartin.com/healing-breathwork-guide\n\n\n--------------\nTRUTH AND LOVE COACHING INTERNATIONAL, LLC – VIDEO DISCLAIMER\nThe information contained within this video is for informational purposes only. We shall in no event be held liable to any party for any reason arising directly or indirectly for the use or interpretation of the information presented in this video.\n\nCopyright 2018, Truth and Love Coaching, LLC - All Rights Reserved.",
      "release": "2018-09-13T15:30:04Z",
      "duration": "00:20:21",
      "explicit": true,
      "youTubeId": "iGJO6A_e2kA",
      "subjects": [
        "Agama Yoga",
        "Yoga Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iGJO6A_e2kA"
      }
    }
  ]
}