{
  "id": "6c4a4de2-a1b9-4a4d-a477-ef8945ee739b",
  "name": "LBC",
  "youTubeChannelId": "UCb1Ti1WKPauPpXkYKVHNpsw",
  "episodes": [
    {
      "id": "e955b668-f901-4118-a2eb-f2e363835469",
      "title": "Labour MP addresses Mandelson’s links to Epstein",
      "description": "Labour MP Natalie Fleet joins Shelagh Fogarty to discuss the Epstein files and the scandal involving former Labour Peer Peter Mandelson. \n\nAs a grooming survivor herself, Fleet emphasises how the narrative must change and victims need to be believed. \n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#shelaghfogarty  #nataliefleet #virginiagiuffre #crime #grooming  #ukpolitics #starmer #keirstarmer #politics #epsteinfiles #mandelson #uknews #labour #debate #petermandelson #jeffreyepstein #LBC\n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2026-02-13T15:47:33Z",
      "duration": "00:13:03",
      "explicit": false,
      "youTubeId": "5xTyKIMxczw",
      "subjects": [
        "Human Trafficking",
        "Cult Psychology",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5xTyKIMxczw"
      }
    },
    {
      "id": "a86be2b8-baaa-4074-93c3-fda21bbe81d1",
      "title": "Epstein files: Andrew \u0027walks right into\u0027 another controversy | Emily Maitlis",
      "description": "The News Agents\u0027 Emily Maitlis joins Shelagh Fogarty to discuss the latest in the Epstein-Andrew scandal, as the King says he\u0027s \u0027ready to support\u0027 police over claims his brother shared confidential information.\n\nThames Valley Police are investigating claims Andrew shared confidential documents with Jeffrey Epstein while serving as UK trade envoy.\n\nIn a statement released on Monday night, Buckingham Palace said: \u0022The King has made clear, in words and through unprecedented actions, his profound concern at allegations which continue to come to light in respect of Mr Mountbatten-Windsor\u0027s conduct.\n\n\u0022While the specific claims in question are for Mr Mountbatten-Windsor to address, if we are approached by Thames Valley Police, we stand ready to support them as you would expect.\n\n\u0022As was previously stated, Their Majesties’ thoughts and sympathies have been, and remain with, the victims of any and all forms of abuse.\u0022\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#emilymaitlis #princeandrew #andrew #epsteinfiles #jeffreyepstein #news #LBC\n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2026-02-10T16:04:40Z",
      "duration": "00:06:43",
      "explicit": false,
      "youTubeId": "NxGApIN0A9k",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NxGApIN0A9k"
      }
    },
    {
      "id": "5f7f2e62-75db-41ff-8ef9-198a11a83c42",
      "title": "Disgraced Andrew Windsor moves into \u0027unspectacular\u0027 Marsh Farm",
      "description": "Andrew Mountbatten-Windsor is downsizing and LBC\u0027s Henry Riley is keen to take a look around and meet his new neighbours.\n\nAfter years of controversy linked to his association with the convicted paedophile Jeffrey Epstein, the man once known as Prince Andrew was stripped of his titles by his brother, King Charles, who also ordered him to vacate his grace-and-favour residence, Royal Lodge.\n\nThe Grade II-listed, 30-room mansion in Windsor Great Park has been the York family’s main home since 2004, when Mountbatten-Windsor moved in with his daughters, Princess Beatrice and Princess Eugenie. \n\nHis former wife, Sarah Ferguson, previously the Duchess of York, joined the household in 2008. \n\nAlthough the former Prince paid only a nominal size of rent to live there, his stay at Royal Lodge has now come to an end.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#henryriley #andrewwindsor #LBC #princeandrew #royalfamily #britishroyals #royalscandal #uknews #royallodge #kingcharles #debate\n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2026-02-06T18:49:20Z",
      "duration": "00:11:50",
      "explicit": false,
      "youTubeId": "p0I9ObTnX_c",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=p0I9ObTnX_c"
      }
    },
    {
      "id": "c29a37fc-9bb7-4523-8098-c97835e7b144",
      "title": "What did Starmer know when he appointed Mandelson?",
      "description": "Shelagh Fogarty is joined by The News Agent\u0027s co-host Lewis Goodall to discuss what\u0027s next for Prime Minister Keir Starmer.\n\nLewis says Starmer is in serious trouble \u0027not because new facts have emerged\u0027 about Peter Mandelson and Jeffrey Epstein, but because Starmer has now publicly owned something that was always known.\n\nHe argues that in doing so, Starmer has exposed a deeper problem of judgment, culture, and hypocrisy at the heart of Labour.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#lewisgoodall  #shelaghfogarty #LBC #politics #starmer #debate \n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2026-02-05T18:18:43Z",
      "duration": "00:12:53",
      "explicit": false,
      "youTubeId": "VhRMOf0qK1s",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VhRMOf0qK1s"
      }
    },
    {
      "id": "8e7134e1-9fd3-46ff-988a-0a56215662af",
      "title": "Ex-MI6 Spy insists Epstein was a Russian spy and blackmailing Trump",
      "description": "A former MI6 spy has told LBC that it is \u0022quite likely\u0022 that Jeffrey Epstein had compromising information about Donald Trump, as he suggested that the paedophile financier was \u0022recruited by Russian organised criminals\u0022.\n\nChristopher Steele, who used to head up MI6\u0027s Russia desk, told Tom Swarbrick that the latest Epstein files published by the US Department of Justice on Friday show the extent of the connection between the disgraced paedophile financier and Russia.\n\nThe former spy told LBC that US sources have highlighted that Epstein\u0027s money didn\u0027t seem to come from business deals and, instead, possibly came from the Soviet Union and then Russia.\n\nMillions of files, including emails and photos, relating to the dealings of Epstein were published by the Department.\n\nMr Steele said: \u0022I would argue this goes right back to the 1970s.\n\n\u0022My sources in America tell me that the American government, the American intelligence services\u0027 assessment was that Epstein was recruited as early as the 1970s by Russian organised crime figures in New York and that his information was being used, his operational techniques were being used from that point onwards.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#tomswarbrick #mi6 #russia #epstein #politics #starmer #israel #trump #LBC\n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2026-02-05T14:07:17Z",
      "duration": "00:06:43",
      "explicit": false,
      "youTubeId": "hYRVezF5-hk",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hYRVezF5-hk"
      }
    },
    {
      "id": "8edb7701-3e94-48ae-8b3c-7572f34bd9b8",
      "title": "Is the DOJ punishing Epstein survivors? Victims\u0027 lawyer speaks out",
      "description": "Police are reviewing allegations that Lord Mandelson leaked inside information to paedophile financier Jeffrey Epstein while he was Business Secretary under Gordon Brown.\n\nThe most recent release resulted in thousands of files being deleted after victims\u0027 private information was revealed.\n\nAs the fallout of the files grows larger and larger, and gets closer to US President Donald Trump, whose name comes up 38,000 times. \n\nAndrew Marr sits down with Gloria Allred, lawyer to the survivors and LBC\u0027s Natasha Clark to discuss. \n\n#andrewmarr #epsteinfiles #donaldtrump #pambondi #uspolitics #ukpolitics #petermandelson #uspolitics  #lbc \n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2026-02-04T19:02:18Z",
      "duration": "00:09:21",
      "explicit": false,
      "youTubeId": "kPoPWERaVS8",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kPoPWERaVS8"
      }
    },
    {
      "id": "4e501e39-1e52-4b80-a043-708751150b81",
      "title": "\u0027It is jaw-dropping\u0027: Ian Hislop on Mandelson and Epstein",
      "description": "Journalist Ian Hislop joins Andrew Marr to discuss the fallout from the Epstein Files and Peter Mandelson’s resignation.\n\nLord Mandelson says he has resigned his membership of the Labour Party as he does not want to \u0022cause further embarrassment\u0022 by his links to the late convicted paedophile Jeffrey Epstein.\n\nThe former cabinet minister, who was sacked as US ambassador last year because of his past connections to Epstein, appeared in the latest release of files by the US Department of Justice on Friday.\n\nDocuments suggest Epstein made $75,000 (£55,000) in payments to Lord Mandelson in three separate $25,000 transactions in 2003 and 2004.\n\nIn his letter to Labour\u0027s general secretary on Sunday, Lord Mandelson said: \u0022I have been further linked this weekend to the understandable furore surrounding Jeffrey Epstein and I feel regretful and sorry about this.\u0022\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#andrewmarr #ianhislop #LBC #epsteinfiles #mandelson #debate \n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2026-02-03T19:00:07Z",
      "duration": "00:10:13",
      "explicit": false,
      "youTubeId": "7CyDNxPnvhw",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7CyDNxPnvhw"
      }
    },
    {
      "id": "b6cef527-2454-4970-b73a-4d1a9b7f3ec8",
      "title": "\u0022The truth is coming\u0022: Epstein survivor speaks out | LBC",
      "description": "The US DOJ\u0027s newest release of the Epstein files included the names of many powerful men, and injected fresh allegations into the conversation. \n \nPresident Donald Trump, Lord Mandelson, Narendra Modi and Andrew Windsor were among those mentioned in the files, sending shockwaves both through Westminster and Washington.\n \nAs the story continues to develop, Lisa Phillips, a survivor of the prolific paedophile and financier joins Ben Kentish to discuss her experience.  \n \nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#benkentish  #jeffreyepstein #survivor #petermandelson #LBC\n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2026-02-03T07:00:16Z",
      "duration": "00:10:10",
      "explicit": false,
      "youTubeId": "DKEbGWnsKqA",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DKEbGWnsKqA"
      }
    },
    {
      "id": "36bd10b1-ab77-42c1-b4a9-c1b8eaecd4a6",
      "title": "\u0027Everything was videotaped,\u0027 expert breaks down new Epstein files",
      "description": "Ben Kentish is joined by Nina Burleigh, US Political commentator and author of \u0027The Trump Women part of the deal\u0027, to look at the newly released Epstein files. \n\nNew evidence reveals emails to Ghislaine \u0027from Balmoral\u0027 asking for \u0027inappropriate friends\u0027. The latest documents show a series of emails between Maxwell and someone dubbed ‘the invisible man’ with the email address \u0027abx17@dial.pipex.com\u0027.\n\nThe freshly released files are putting Donald Trump under renewed scrutiny. We look at what federal prosecutors were examining and how these documents reshape what we know.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#benkentish #epstein #epsteinfiles #ghislainemaxwell #trump #donaldtrump #uspolitics #usnews #usa #politics #LBC\n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2025-12-24T09:31:38Z",
      "duration": "00:09:34",
      "explicit": false,
      "youTubeId": "-Z0SHDkMPzE",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-Z0SHDkMPzE"
      }
    },
    {
      "id": "ac560b4c-9530-4a4f-8779-c0738e2aee19",
      "title": "\u0027Why did Trump change his mind?\u0027: Emily Maitlis on the Epstein files",
      "description": "\u0027Donald Trump rarely surprises me,\u0027 Emily Maitlis tells Shelagh Fogarty. It comes after the US President urged his fellow Republicans in Congress to vote for the release of files related to the late convicted sex offender Jeffrey Epstein. It is a reversal of Trump\u0027s previous opposition to the move.\n\nTrump said on his Truth Social platform that politicians from his own party should back releasing the Justice Department documents.\n\n\u0022House Republicans should vote to release the Epstein files, because we have nothing to hide.\u0022\n\n\u0022And it\u0027s time to move on from this Democrat Hoax perpetrated by Radical Left Lunatics in order to deflect from the Great Success of the Republican Party...\u0022 Trump wrote.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp#\n\n#shelaghfogarty #emilymaitlis #LBC #donaldtrump #trump #epsteinfiles #debate \n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2025-11-17T16:37:24Z",
      "duration": "00:07:23",
      "explicit": false,
      "youTubeId": "fh2KDXEm5os",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fh2KDXEm5os"
      }
    },
    {
      "id": "5e24cd0f-baa3-4c24-898f-592375e5bb3d",
      "title": "Andrew Windsor: \u0027What straw broke the camel\u0027s back?\u0027 | LBC",
      "description": "Emily Maitlis joins James O\u0027Brien to provide the latest on the Andrew Windsor saga. \n\nThe disgraced former prince has now been stripped of his style, title and honours, and is being removed from the 30-room Royal Lodge. \n\nA copy of the leasehold agreement, shared with the PA news agency by the Crown Estate, which oversees the royal family\u0027s land and property holdings, shows Andrew signed a 75-year lease on the property in 2003.\n\nIt reveals he paid £1 million for the lease and that since then he has paid \u0022one peppercorn\u0022 of rent \u0022if demanded\u0022 per year.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#jamesobrien #emilymaitlis #princeandrew #royalfamily #royals #royalnews #uknews #ukpolitics \n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2025-10-31T15:30:20Z",
      "duration": "00:13:22",
      "explicit": false,
      "youTubeId": "V_3TRckLHfM",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V_3TRckLHfM"
      }
    },
    {
      "id": "9edffbcb-726d-49da-8208-e04fa8046852",
      "title": "African tribe set up in Scotland refuse to be evicted",
      "description": "Kofi Offeh, 36, from Ghana, now goes by the name \u0022King Atehene\u0022 and camps in an area of woodland near Jedburgh which he and two others claim to be the lost \u0022Kingdom of Kubala\u0022.\n\nThe group has attracted worldwide media attention and gathered millions of views on TikTok with posts documenting their lives and their ongoing battle with Scottish authorities who have been trying to evict them.\n\nThey allege the land belonged to their ancestors despite the lack of any widely accepted historical evidence supporting that claim.\n\nSome of the videos show Mr Offeh sitting on a chair while the two women with him clean his hair, cook for him and fix a crown on his head.\n\nBut in the latest bizarre twist in this story LBC has learned how he was previously invited to perform at a forum on the Parliamentary estate attended by politicians and other London mayoral candidates while trying to make his name as an opera singer in 2015.\n\nHe reportedly sung the national anthems of both the United Kingdom and Ghana at the event at Portcullis House discussing relations with his home country.\n\nPhotos on the \u0027Ghana Society\u0027 website and on X appear to show him singing in front of a podium and posing for photos with other attendees including the former MP Kelvin Hopkins.\n\nA post on the site stated: \u0022The discussion centred on how the UK can collaborate with Ghana to foster longstanding ties.\n\n\u0022Panellists comprising publishers, economists and politicians used the floor to explore how Ghana’s mineral wealth, manpower and expertise can be partnered with the UK.\u0022\n\nThe event seemingly took place while Mr. Offeh was still trying to forge a career in the music industry as an artist going by the name of \u0027Nino\u0027.\n\nHis old @ninomusiq X account is tagged in photos from the night and links to a page for the now dissolved Black British Entertainment networking agency of which Companies House lists him as a Director.\n\nThe earliest videos on the \u0027KINGDOM OF KUBALA\u0027 YouTube account also show him singing and speaking under the \u0027Nino\u0027 name.\n\nOther images from the Westminster event show Labour MP and former Minister Gareth Thomas and Policy Consultant Tom Chance in attendance, who were vying for the position ultimately won by Sadiq Khan.\n\nJournalist and former mayoral candidate, Christian Wolmar, was also there.\n\nSpeaking to LBC, he said: \u0022I do remember being invited to a rather strange event in one of the rooms in Portcullis House which adjoins Parliament... and it was a little bit strange.\n\n\u0022We were not quite sure why we were there.\u0022As far as I can remember, it was a kind of standard parliamentary event with I think some musical performance and a relatively small attendance of people in aid of... promoting Ghana.\n\n\u0022Attendance was fairly thin... I think that people who were more important than me clearly didn\u0027t bother to turn up.\u0022\n\nWhen asked what we made of Mr. Offeh\u0027s new life as \u0022King Athene\u0022, Wolmar said \u0022good luck to him in trying to prove his Scottish ancestry.\u0022\n\nAnd in an exclusive interview with LBC, Mr. Offeh himself claimed: \u0022There was a time when I sang the song which I was told to sing in order to be here. It was a journey, just like my ancestor, King David. He used to sing for King Saul. But when the day came, he had to put away his music and become the ruler of Great Britain. \n\n\u0022I am following his footsteps. I have come... the king of Scotland.\n\n\u0022I still sing...opera, classical music. We also sing our chants, Kubala songs.\u0022\n\nLast week Sheriff Officers arrived at his woodland camp to remove his group from the site where they\u0027d spent several weeks.\n\nHe and his wife Jean Gasho, 43, who calls herself Queen Nandi, as well as Kaura Talor, an American woman who had been reported missing in Texas and now calls herself Handmaiden Asnat, moved over a fence to another spot of land just 20 foot away. \n\nThey\u0027ve now been served a second eviction notice and officers expect to try and remove the group again soon.\n\nThe Deputy Leader of the Scottish Borders Council Scott Hamilton said earlier this week: \u0022We\u0027re obviously very relieved to get the news that we had been granted the eviction order.\n\n\u0022So obviously we\u0027re looking to execute that in an appropriate manner. I think we have to be aware of what happened last time, where they moved simply to another piece of land. So we\u0027re obviously looking at this in a much more coordinated effort. They are clever and they know what they\u0027re doing.\u0022\n\nBut Mr Offeh told us he had no plans to move: \u0022They (officials) are ignorant. If they know the history of this land they should come and bow before me.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#scotland #uknews #LBC\n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2025-09-27T08:00:45Z",
      "duration": "00:05:47",
      "explicit": false,
      "youTubeId": "eayZl-YChKY",
      "subjects": [
        "Kingdom of Kubala"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eayZl-YChKY"
      }
    }
  ]
}