{
  "id": "6c4a4de2-a1b9-4a4d-a477-ef8945ee739b",
  "name": "LBC",
  "youTubeChannelId": "UCb1Ti1WKPauPpXkYKVHNpsw",
  "episodes": [
    {
      "id": "5e24cd0f-baa3-4c24-898f-592375e5bb3d",
      "title": "Andrew Windsor: \u0027What straw broke the camel\u0027s back?\u0027 | LBC",
      "description": "Emily Maitlis joins James O\u0027Brien to provide the latest on the Andrew Windsor saga. \n\nThe disgraced former prince has now been stripped of his style, title and honours, and is being removed from the 30-room Royal Lodge. \n\nA copy of the leasehold agreement, shared with the PA news agency by the Crown Estate, which oversees the royal family\u0027s land and property holdings, shows Andrew signed a 75-year lease on the property in 2003.\n\nIt reveals he paid £1 million for the lease and that since then he has paid \u0022one peppercorn\u0022 of rent \u0022if demanded\u0022 per year.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#jamesobrien #emilymaitlis #princeandrew #royalfamily #royals #royalnews #uknews #ukpolitics \n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2025-10-31T15:30:20Z",
      "duration": "00:13:22",
      "explicit": false,
      "youTubeId": "V_3TRckLHfM",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V_3TRckLHfM"
      }
    },
    {
      "id": "9edffbcb-726d-49da-8208-e04fa8046852",
      "title": "African tribe set up in Scotland refuse to be evicted",
      "description": "Kofi Offeh, 36, from Ghana, now goes by the name \u0022King Atehene\u0022 and camps in an area of woodland near Jedburgh which he and two others claim to be the lost \u0022Kingdom of Kubala\u0022.\n\nThe group has attracted worldwide media attention and gathered millions of views on TikTok with posts documenting their lives and their ongoing battle with Scottish authorities who have been trying to evict them.\n\nThey allege the land belonged to their ancestors despite the lack of any widely accepted historical evidence supporting that claim.\n\nSome of the videos show Mr Offeh sitting on a chair while the two women with him clean his hair, cook for him and fix a crown on his head.\n\nBut in the latest bizarre twist in this story LBC has learned how he was previously invited to perform at a forum on the Parliamentary estate attended by politicians and other London mayoral candidates while trying to make his name as an opera singer in 2015.\n\nHe reportedly sung the national anthems of both the United Kingdom and Ghana at the event at Portcullis House discussing relations with his home country.\n\nPhotos on the \u0027Ghana Society\u0027 website and on X appear to show him singing in front of a podium and posing for photos with other attendees including the former MP Kelvin Hopkins.\n\nA post on the site stated: \u0022The discussion centred on how the UK can collaborate with Ghana to foster longstanding ties.\n\n\u0022Panellists comprising publishers, economists and politicians used the floor to explore how Ghana’s mineral wealth, manpower and expertise can be partnered with the UK.\u0022\n\nThe event seemingly took place while Mr. Offeh was still trying to forge a career in the music industry as an artist going by the name of \u0027Nino\u0027.\n\nHis old @ninomusiq X account is tagged in photos from the night and links to a page for the now dissolved Black British Entertainment networking agency of which Companies House lists him as a Director.\n\nThe earliest videos on the \u0027KINGDOM OF KUBALA\u0027 YouTube account also show him singing and speaking under the \u0027Nino\u0027 name.\n\nOther images from the Westminster event show Labour MP and former Minister Gareth Thomas and Policy Consultant Tom Chance in attendance, who were vying for the position ultimately won by Sadiq Khan.\n\nJournalist and former mayoral candidate, Christian Wolmar, was also there.\n\nSpeaking to LBC, he said: \u0022I do remember being invited to a rather strange event in one of the rooms in Portcullis House which adjoins Parliament... and it was a little bit strange.\n\n\u0022We were not quite sure why we were there.\u0022As far as I can remember, it was a kind of standard parliamentary event with I think some musical performance and a relatively small attendance of people in aid of... promoting Ghana.\n\n\u0022Attendance was fairly thin... I think that people who were more important than me clearly didn\u0027t bother to turn up.\u0022\n\nWhen asked what we made of Mr. Offeh\u0027s new life as \u0022King Athene\u0022, Wolmar said \u0022good luck to him in trying to prove his Scottish ancestry.\u0022\n\nAnd in an exclusive interview with LBC, Mr. Offeh himself claimed: \u0022There was a time when I sang the song which I was told to sing in order to be here. It was a journey, just like my ancestor, King David. He used to sing for King Saul. But when the day came, he had to put away his music and become the ruler of Great Britain. \n\n\u0022I am following his footsteps. I have come... the king of Scotland.\n\n\u0022I still sing...opera, classical music. We also sing our chants, Kubala songs.\u0022\n\nLast week Sheriff Officers arrived at his woodland camp to remove his group from the site where they\u0027d spent several weeks.\n\nHe and his wife Jean Gasho, 43, who calls herself Queen Nandi, as well as Kaura Talor, an American woman who had been reported missing in Texas and now calls herself Handmaiden Asnat, moved over a fence to another spot of land just 20 foot away. \n\nThey\u0027ve now been served a second eviction notice and officers expect to try and remove the group again soon.\n\nThe Deputy Leader of the Scottish Borders Council Scott Hamilton said earlier this week: \u0022We\u0027re obviously very relieved to get the news that we had been granted the eviction order.\n\n\u0022So obviously we\u0027re looking to execute that in an appropriate manner. I think we have to be aware of what happened last time, where they moved simply to another piece of land. So we\u0027re obviously looking at this in a much more coordinated effort. They are clever and they know what they\u0027re doing.\u0022\n\nBut Mr Offeh told us he had no plans to move: \u0022They (officials) are ignorant. If they know the history of this land they should come and bow before me.\n\nListen to the full show on the all-new LBC App: https://app.af.lbc.co.uk/btnc/thenewlbcapp\n\n#scotland #uknews #LBC\n\nLBC is the home of live debate around news and current affairs in the UK.\n\nJoin in the conversation and listen at https://www.lbc.co.uk/ \nSign up to LBC’s weekly newsletter here: https://l-bc.co/signup",
      "release": "2025-09-27T08:00:45Z",
      "duration": "00:05:47",
      "explicit": false,
      "youTubeId": "eayZl-YChKY",
      "subjects": [
        "Kingdom of Kubala"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eayZl-YChKY"
      }
    }
  ]
}