{
  "id": "33dc48d9-76c6-4882-a00e-ea52e5809a69",
  "name": "LCI",
  "youTubeChannelId": "UCewhc0fvja891XkpIPGRMxQ",
  "episodes": [
    {
      "id": "472b9f4f-16f9-44d6-bae7-fe32f9adbb8d",
      "title": "Affaire Epstein : Trump, l\u0027étau se resserre ?｜LCI",
      "description": "L\u0027ancienne secrétaire d\u0027État américaine Hillary Clinton a accusé, ce lundi, le président Donald Trump d\u0027avoir orchestré une opération de \u0022dissimulation\u0022 au sujet des dossiers liés au criminel sexuel Jeffrey Epstein, dans une interview accordée à la chaîne britannique BBC. \n\n\u0022Publiez ces dossiers. Ils traînent\u0022, a asséné à l\u0027adresse du gouvernement Hillary Clinton, qui doit être entendue par une commission du Congrès sur le sujet à la fin du mois. \n\nEn janvier, le ministère américain de la Justice a publié une nouvelle série de pièces du dossier dit \u0022Epstein\u0022, comprenant plus de trois millions de documents, photos et vidéos liés au criminel sexuel, mort en prison en 2019, un décès conclu comme un suicide. \n\nLe mari d\u0027Hillary Clinton, l\u0027ancien président démocrate Bill Clinton (1993-2001), apparaît régulièrement dans ces fichiers, sans preuve que le couple ait été impliqué dans des activités illégales. \n\nIls doivent être interrogés à huis clos devant une commission du Congrès américain. La commission souhaite entendre l\u0027ancien président en raison de ses liens d\u0027amitié avec le criminel sexuel, et l\u0027ancienne cheffe de la diplomatie américaine pour ce qu\u0027elle sait de ces liens entre son époux et le financier.\n\n\u0022Nous nous y rendrons, mais nous pensons qu\u0027il serait mieux de le faire en public\u0022, a déclaré Hillary Clinton à la BBC. \u0022Je veux que tout le monde soit traité de la même manière\u0022, a-t-elle ajouté.\n\nDécryptage dans Le Grand Dossier, une émission présentée par Amélie Carrouër.\n\n#trump #epsteinfiles \n\n📺 Retrouvez LCI sur le canal 15. Le meilleur de l\u0027info, de l\u0027analyse, du décryptage et tous les grands événements en direct.",
      "release": "2026-02-18T20:00:09Z",
      "duration": "00:56:13",
      "explicit": false,
      "youTubeId": "EwToxzoUfFg",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EwToxzoUfFg"
      }
    },
    {
      "id": "965c6ec8-aad1-42b3-8248-43f1580f548d",
      "title": "Jeffrey Epstein : victime présumée, elle raconte l\u0027horreur｜LCI",
      "description": "En 2004, alors âgée de 21 ans, Juliette assure être tombée dans le piège de Jeffrey Epstein à New-York.\n\nElle raconte sur LCI sa rencontre avec le milliardaire américain.\n\n📺 Retrouvez LCI sur le canal 15. Le meilleur de l\u0027info, de l\u0027analyse, du décryptage et tous les grands événements en direct.",
      "release": "2026-02-16T12:02:04Z",
      "duration": "00:19:59",
      "explicit": false,
      "youTubeId": "KjFOwHWrrJY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KjFOwHWrrJY"
      }
    },
    {
      "id": "f77b8723-7909-4f48-84e1-304e25007277",
      "title": "ENQUÊTE - Jeffrey Epstein : l\u0027affaire qui fait tomber des têtes !｜LCI",
      "description": "Une affaire qui déchaîne les passions sur les réseaux sociaux. Alors que trois millions de documents resteraient encore non publiés, l\u0027affaire Epstein intrigue autant qu\u0027elle révolte. De nouvelles révélations font surface chaque semaine après la publication par le ministère de la Justice américain de 3,5 millions de documents.\n\nInculpé en 2019 pour trafic sexuel impliquant des dizaines de mineurs, Jeffrey Epstein ne sera pas jugé car il a été retrouvé mort dans sa cellule un mois plus tard. Parmi les millions de documents déjà dévoilés, de nombreuses informations ont été caviardées et n\u0027ont donc pas été révélées pour des questions de sécurité et de légalité.\n\n\n📺 Retrouvez LCI sur le canal 15. Le meilleur de l\u0027info, de l\u0027analyse, du décryptage et tous les grands événements en direct.",
      "release": "2026-02-09T10:56:16Z",
      "duration": "00:16:50",
      "explicit": false,
      "youTubeId": "qx550A1TH24",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qx550A1TH24"
      }
    }
  ]
}