{
  "id": "1a1bdfa4-46d2-4c25-838e-6b09054c21cf",
  "name": "Le Média",
  "youTubeChannelId": "UCT67YOMntJxfRnO_9bXDpvw",
  "episodes": [
    {
      "id": "6609f041-9994-40ab-9705-d59adbb07ee4",
      "title": "EPSTEIN FILES, ICE, BAD-BUNNY : DONALD TRUMP PLUS CRITIQUÉ QUE JAMAIS",
      "description": "L\u0027affaire Jeffrey Epstein refait surface avec la publication de près de trois millions de documents. Transparence historique ou opération politique ? Pour Claire Rabes, consultante et militante démocrate, l’enjeu est immense mais le travail reste à faire : masse d’archives, documents caviardés, auditions incomplètes. Elle pointe la responsabilité du ministère de la Justice et les tentatives d’obstruction de l’administration Donald Trump. De son côté, l’historien Tristan Cabello invite à dépasser la chasse aux noms : l’essentiel serait d’analyser les structures – banques, fondations, partis – qui ont permis un tel système. Plus qu’un scandale individuel, Epstein révèle une crise institutionnelle et nourrit la défiance envers les élites.\n\nAutre fracture majeure : l’immigration. Les interventions musclées d’ICE à Minneapolis ont ravivé les tensions. Si le retrait partiel de l’agence peut sembler un revers, nos invités estiment que le climat de peur est installé. Face à cela, des mobilisations locales émergent, parfois hors des partis traditionnels, tandis que les démocrates peinent à afficher une ligne claire.\n\nLa culture n’échappe pas à la polarisation. Lors du Super Bowl, la performance de Bad Bunny, en espagnol, a symbolisé une Amérique plurielle, à rebours du récit identitaire trumpiste. Plus qu’une provocation, un miroir des mutations démographiques et culturelles du pays.\n\nEnfin, sur la scène internationale, la rencontre entre Benjamin Netanyahu et Trump illustre les ambiguïtés américaines au Moyen-Orient, notamment face à l’Iran. Entre soutien stratégique et calcul politique, la ligne reste floue.\n\nDes scandales judiciaires aux débats migratoires, de la pop culture à la diplomatie, les États-Unis apparaissent sous pression. Mais derrière la fatigue et la polarisation, émergent aussi de nouvelles dynamiques politiques, notamment à gauche, qui pourraient redessiner l’avenir.\n\n\nSuivez Le Média sur sa seconde chaîne Youtube :\n👉 https://www.youtube.com/@LeMédia24-7\n\n\n\n👉 Pour recevoir les dernières actualités, le résumé de la semaine et être alerté des derniers programmes publiés du Média, directement dans votre boîte e-mail.\nhttps://newsletter.lemediatv.fr\n\n\n▶ Soutenez Le Média : \n👉 https://soutenez.lemediatv.fr (CB - SEPA - Chèque)\n👉 https://dons.lemediatv.fr (CB - SEPA - Chèque)\n👉 https://fr.tipeee.com/le-media (CB - Paypal)\n\n✅  Suivez-nous : \nInstagram : https://www.instagram.com/lemedia_tv/\nFacebook : http://bit.ly/FacebookLeMedia\nBlueSky : https://bsky.app/profile/lemediatv.bsky.social\nYoutube : http://bit.ly/YouTubeLeMedia\nPeertube : https://video.lemediatv.fr\nTelegram :  https://t.me/LeMediaOfficiel\nTikTok : https://www.tiktok.com/@lemediatv\n\nRejoignez la communauté des Socios !",
      "release": "2026-02-15T10:01:19Z",
      "duration": "00:51:03",
      "explicit": false,
      "youTubeId": "x8rqQNpmtE0",
      "subjects": [
        "_America",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x8rqQNpmtE0"
      }
    },
    {
      "id": "7ab6f9e9-b580-4c39-9e69-a80a914471b9",
      "title": "AFFAIRE EPSTEIN : POURQUOI MACRON ET LES PUISSANTS S\u0027INQUIÈTENT",
      "description": "🔴 Soutenez le Média ! 👉 https://soutenez.lemediatv.fr (CB - SEPA - Chèque)\n⚠️ Le Média est également diffusé sur le canal 165 de la Freebox, sur le canal 235 de la Livebox (Orange) et sur le bouquet GRATUIT de l\u0027application Molotov TV.\n\nL’onde de choc de l’affaire Jeffrey Epstein remonte jusqu’au sommet de l’État et fait trembler la classe politique, y compris autour d’Emmanuel Macron. Révélations, réseaux d’influence, stratégies de défense : comment les puissants tentent-ils de contenir les scandales et de préserver leur image ? Nils s’est plongé dans les coulisses d’un système où communication de crise et silences bien organisés deviennent des armes politiques.\n\nDans le même temps, Gabriel Attal soigne sa place au cœur du bloc central : déplacements, opérations de terrain et collectes de dons à répétition pour consolider son socle et afficher sa domination interne. Une stratégie offensive qui mêle image publique et mobilisation financière.\n\nEnfin, à gauche, Jean-Luc Mélenchon avance une « offre fédérative » au Parti communiste français pour les municipales, sous la bannière de La France insoumise. Objectif : rassembler sans s’effacer, recomposer les alliances locales et tenter de reprendre la main sur une gauche fragmentée, entre calcul stratégique et pari risqué.\n\n\nSuivez Le Média sur sa seconde chaîne Youtube :\n👉 https://www.youtube.com/@LeMédia24-7\n\n👉 Pour recevoir les dernières actualités, le résumé de la semaine et être alerté des derniers programmes publiés du Média, directement dans votre boîte e-mail.\nhttps://newsletter.lemediatv.fr\n\n\n▶ Soutenez Le Média : \n👉 https://soutenez.lemediatv.fr (CB - SEPA - Chèque)\n👉 https://dons.lemediatv.fr (CB - SEPA - Chèque)\n👉 https://fr.tipeee.com/le-media (CB - Paypal)\n\n✅  Suivez-nous : \nInstagram : https://www.instagram.com/lemedia_tv/\nFacebook : http://bit.ly/FacebookLeMedia\nBlueSky : https://bsky.app/profile/lemediatv.bsky.social\nYoutube : http://bit.ly/YouTubeLeMedia\nPeertube : https://video.lemediatv.fr\nTelegram :  https://t.me/LeMediaOfficiel\nTikTok : https://www.tiktok.com/@lemediatv\n\nRejoignez la communauté des Socios !",
      "release": "2026-02-13T19:30:28Z",
      "duration": "00:29:38",
      "explicit": false,
      "youTubeId": "wZJDvAQD40A",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wZJDvAQD40A"
      }
    }
  ]
}