{
  "id": "5925e593-32fe-4e9a-8e84-ae0f1112257f",
  "name": "Leading Our Own Way",
  "youTubeChannelId": "UCph_1XP8uupB3WYyD0ooWfA",
  "episodes": [
    {
      "id": "235f9095-0817-471e-8828-c2c24ab32cf3",
      "title": "Leaving My Cult Family!",
      "description": "What happens when the love you receive as a child comes with conditions? When the world you\u0027re born into demands absolute obedience, and questioning means losing everything?\n\nIn this raw and powerful conversation, Sean Faingold takes us inside his journey from being born into the Jehovah\u0027s Witnesses—a world where conditional love shaped his earliest understanding of himself—to becoming a fierce advocate for emotional awareness and challenging toxic masculinity.\n\nSean doesn\u0027t just share his story of escape; he reveals the deeper battle that followed. The addiction that filled the void. The struggle to find his voice after years of silence. The moment he realised that true strength isn\u0027t about suppressing emotions—it\u0027s about having the courage to feel them.\n\nThis is a conversation about resilience, healing, and the ongoing journey of self-discovery. Sean\u0027s work challenging misogyny and creating safe spaces for men to express their emotions is transforming lives, one vulnerable conversation at a time.\n\nIf you\u0027ve ever felt trapped by expectations, struggled with conditional love, or wondered what it truly means to be emotionally aware in a world that tells men to \u0022toughen up\u0022—this episode will resonate deeply.\n\nSean\u0027s story reminds us that breaking free isn\u0027t just about leaving a place—it\u0027s about finding the courage to become who you were always meant to be.\n\nThis is Part 1 of a 2-part series.\n\nPart One: https://youtu.be/mCC0e22kHfo\nTuesday Truths: https://youtu.be/sGXs4ndWHQ4\nPart Two: https://youtu.be/5rqeou37QBA\n\nConnect with Sean Faingold\n⁠https://www.instagram.com/seanfaingold?igsh=Znhyd2xtOWw5bnp3⁠\n\nTakeaways \n- Conditional love shapes identity - Growing up with love tied to obedience creates deep wounds that require intentional healing and self-discovery.\n- Addiction often fills the void - When we escape one form of control, we can easily fall into another; recognising this pattern is the first step to freedom.\n- Emotional suppression isn\u0027t strength - True courage lies in feeling and expressing emotions, not burying them beneath a mask of toughness.\n- Finding your voice takes time - After years of silence and compliance, learning to speak your truth is a gradual, ongoing process.\n- Safe spaces transform lives - Creating environments where men can be vulnerable without judgment is essential for breaking cycles of toxic masculinity.\n- Healing is a journey, not a destination - Self-discovery and emotional awareness require continuous work, reflection, and compassion for yourself.\n\nChapters\n🔴 (00:00) Welcome Sean Faingold to Leading Our Own Way \n🔴 (04:37) Sean\u0027s Mission and Anti-Misogyny Content\n🔴 (07:42) Engaging with the Manosphere and Challenging Beliefs\n🔴 (10:25) Examples of Content and Audience Engagement\n🔴 (13:44) Understanding Female Perspectives and Safety\n🔴 (16:36) Handling Negative Comments and Criticism\n🔴 (19:31) Evolution of Social Media Presence\n🔴 (22:26) Writing an Emotional Intelligence Workbook\n🔴 (25:37) Personal Journey and Background\n🔴 (28:36) Growing Up in a Cult\n🔴 (31:50) Childhood Experiences and Sensitivity\n🔴 (31:54) Conditional Love and Confusion\n🔴 (33:35) The Impact of Religion on Upbringing\n🔴 (35:34) The Blessing of Technical Difficulties\n🔴 (38:35) Support Systems and Speaking Up\n🔴 (40:35) Rebuilding Friendships After Loss\n🔴 (43:31) Life in the Kingdom Halls\n🔴 (46:10) The Structure of Jehovah\u0027s Witnesses\n🔴 (47:12) Childhood Memories and Bullying\n🔴 (51:06) The Impact of Martial Arts\n🔴 (53:16) The Mission of Jehovah\u0027s Witnesses\n🔴 (55:23) The History of Jehovah\u0027s Witnesses\n🔴 (59:34) Addiction and Relationships\n\nEverything Leading Our Own Way\n🪪 ⁠https://www.link.me/leadingourownway⁠ \n🌐 ⁠https://www.leadingourownway.com ⁠\n\nListen to the Full Podcast Episode:\n🎧 Spotify: ⁠https://www.bit.ly/43H0Mr6⁠ 📺 \n🎧 Amazon Music: ⁠https://www.bit.ly/3IIyCFC⁠  \n📺 YouTube: ⁠https://www.bit.ly/4a0aQ1F⁠ \n\n📚Buy My Book 📚\n‘How To Lead With Purpose’ by Andrew White \u0026 Mike Nichols ~ ⁠https://www.azonlinks.com/B0C9SNQL6C⁠ \n\n#LeadingOurOwnWay #SeanFeingold #MentalHealthAwareness #EmotionalAwareness #ToxicMasculinity",
      "release": "2025-11-23T17:00:06Z",
      "duration": "01:07:31",
      "explicit": false,
      "youTubeId": "mCC0e22kHfo",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mCC0e22kHfo"
      }
    }
  ]
}