{
  "id": "413a8521-0de5-4a7f-81fd-0349b3925373",
  "name": "Leah Remini",
  "spotifyId": "",
  "appleId": null,
  "youTubeChannelId": "UCHz-rH0kR_wzshscjRap74Q",
  "episodes": [
    {
      "id": "610ce2e7-e916-4a30-b3e7-7f7c132a59a8",
      "title": "Shelly Miscavige Update - Horrible Meeting With LAPD Chief On Scientology",
      "description": "In June, thanks to the pressure many of you applied to his office, I met with the Chief of the Los Angeles Police Department, Michel Moore. \n\nOn the agenda: discussing LAPD\u0027s inappropriate and corrupt relationship with Scientology, which includes how the LAPD handled the missing person\u0027s investigation into Shelly Miscavige.\n\nI promised to update you on the meeting: it was a disaster.\n\nFrom Chief Moore\u0027s antagonistic attitude to the insistence that Scientology is an excellent partner to the LAPD, I left the meeting in shock. \n\nMike Rinder and I and Claire Headley discussed the meeting on our podcast\u0027s latest episode.\n\nRead My Memoir About My Life in Scientology and Hollywood: https://amzn.to/3rialy7",
      "release": "2023-09-20T03:05:57Z",
      "duration": "01:14:24",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "chUfGJnayHM",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=chUfGJnayHM"
      }
    },
    {
      "id": "8c00a2cb-a9cc-4976-9595-7342979e648d",
      "title": "David Miscavige\u0027s Camerawoman Speaks Out For First Time Since Escaping Scientology",
      "description": "Rachael Hastings Adair joined Scientology\u0027s Sea Org (paramilitary workforce that runs and controls Scientology) in 2004. Rachael, who is a filmmaker, soon became a favorite of Scientology\u0027s image obsessed and criminal leader David Miscavige. During her time in Scientology, Rachael, due to her position, was witness to a great deal. In her first interview with Mike and Me, Rachael talks about the two things that led her to leave: she is gay (which in Scientology is one of the worst things you can be) and she was tired of witnessing Scientology cover up crimes against minors. \n\nRachael finally escaped Scientology in 2020 and went straight to the FBI to tell them what she had witnessed. \n-------------------------------------------------\nRead My Memoir About My Life In Scientology: https://amzn.to/3sYRXdX",
      "release": "2023-09-20T15:47:39Z",
      "duration": "01:17:26",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "QEaCMqJ6Nd8",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=QEaCMqJ6Nd8"
      }
    },
    {
      "id": "f0511ffe-5a2a-40ee-90b5-6cc14230eb3a",
      "title": "Why Tom Cruise Will Never Leave Scientology",
      "description": "In 2016, I explained why Tom Cruise will never leave Scientology. Not only is he a true believer in Scientology, but he benefits from his incredible power within Scientology. Tom is the beneficiary of a level of power and treatment that even movie stars don\u0027t get. \n\nRead My Memoir About My Life In Scientology: https://amzn.to/3sYRXdX",
      "release": "2023-09-29T22:42:55Z",
      "duration": "00:01:58",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "Zfogb2TBChQ",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=Zfogb2TBChQ"
      }
    }
  ]
}