{
  "id": "870adefc-3be8-46d2-944d-9d6ca5097e6d",
  "name": "LearnLoveHeal",
  "youTubeChannelId": "UC-3rcT1YnH0Hoe6QFhBhGcA",
  "episodes": [
    {
      "id": "01dbf3c9-2e83-41b1-8f40-d822f16cb9fd",
      "title": "My Ex JW Story (Regular Pioneer, Daughter of 144 000) Part 2",
      "description": "Here\u0027s Part 2 of my story regarding my exit from the JW organization 18 years ago.  I was a regular pioneer for nearly 10 years, completely brainwashed and willing to give my life for this cult.  My story touches on many topics from child abuse, challenges growing up as a daughter of one of the \u0022anointed\u0022 144 000, as well as my coming out as a lesbian.  \n\nI am finally past the fear that has held me back my entire life.  The more of us that share our unique stories, the more we can heal, prosper and grow.  \n  \nThank you for stopping by and watching my video!  \n\nFeel free to like, subscribe and share with any who may benefit. :)\n\nVisit my website for more updates and my blog! \nhttps://learnloveheal.co",
      "release": "2019-01-09T03:17:41Z",
      "duration": "00:28:22",
      "explicit": false,
      "youTubeId": "jueSfDhGzIQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jueSfDhGzIQ"
      }
    },
    {
      "id": "ab12012f-8352-491f-a6be-1fdc44af9acc",
      "title": "My Ex-JW Story (Regular Pioneer, Daughter of 144 000) Part 1",
      "description": "Here\u0027s the story of my exit from the JW organization 18 years ago.  I was a regular pioneer for nearly 10 years, completely brainwashed and willing to give my life for this cult.  My story touches on many topics from child abuse, challenges growing up as a daughter of one of the \u0022anointed\u0022 144 000, as well as my coming out as a lesbian.  \n\nI am finally past the fear that has held me back my entire life until now, my 45th year.  The more of us that share our unique stories, the more we can heal.\n  \nThank you for stopping by and watching my video!  \n\nFeel free to like, subscribe and share with any who may benefit. :)\n\nVisit my website for more updates and my blog! \nhttps://learnloveheal.co",
      "release": "2019-01-06T06:03:08Z",
      "duration": "00:44:57",
      "explicit": false,
      "youTubeId": "IFMyWUuAAQU",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IFMyWUuAAQU"
      }
    }
  ]
}