{
  "_ts": 0,
  "id": "c236f9c8-b82e-40dd-a4bb-5108da62031f",
  "name": "Lee McDaid - Donegal",
  "youTubeChannelId": "UCFQw3bQGbgyXFXERN5Jk39g",
  "episodes": [
    {
      "id": "5642b91f-2858-4cae-b30d-108b6737e3af",
      "title": "Atlantis Commune (The Screamers) - Donegal 1983",
      "description": "The Atlantis Commune pursue a more simple way of living on Inishfree off the coast of Donegal.\n\nOnce resident in Burtonport, County Donegal, the Atlantis Commune, nicknamed The Screamers, moved to the nearby island of Inishfree.\n\nThe Atlantis Commune owns a cluster of cottages on Inishfree. The group no longer practise primal screaming as a form of therapy but aggression is still encouraged. This can be confined to verbal arguments, or it might be expressed in musical form. There are also physical confrontations. Atlantis member Ken Mallard sustained a broken nose but,\n\nWithin this community such behaviour is acceptable in pursuit of emotional honesty and fulfilment.\n\nAtlantis member Mary Kelly explains that men and women in the group have different roles. The men,\n\nAre encouraged to be men and the women are encouraged to be more feminine.\n\nFounded in 1974 by English woman Jenny James, the Atlantis Commune has attracted hundreds of visitors who stay with them annually. One such visitor is Alex Cunningham, a graduate of St Andrew’s University in Scotland who previously trained and worked as a chartered accountant.\n\nAlex Cunningham became despondent with his life and dissatisfied with the world and its ways. He believes the Atlantis Commune members are attempting to reverse the current consumerist way of life which he is convinced will lead to earth’s destruction. The group’s lifestyle on Inishfree is deliberately frugal,\n\nTo find out what went wrong, because the human race has taken a wrong turning and we want to go back and see if we can undo it.\n\nMost members of the Atlantis Commune are in Dartmouth in the south of England, preparing to sail to South America under the steerage of Tristan Jones. Once they reach South America the plan is to find a suitable place to live and then move the entire Atlantis Commune there.\n\n New report from the 7th of January 1983.",
      "release": "2023-01-07T12:26:50Z",
      "duration": "00:05:30",
      "explicit": false,
      "youTubeId": "oQcu9mxNzVE",
      "subjects": [
        "The Screamers"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oQcu9mxNzVE"
      }
    },
    {
      "id": "68e37694-1cd6-4557-9361-ced9d8c727b9",
      "title": "The Victorian Romantics - Burtonport,  Donegal Ireland (1988)",
      "description": "The Victorian Romantics of Burtonport in County Donegal have eschewed modern life in order to live according to 19th century values.\n\nA group of women known as the Victorian Romantics live in Atlantis House in Burtonport.  The property was previously inhabited by the Atlantis commune known locally as the Screamers.\n\nA short film made for the Late Late Show shows the ladies visiting Michael Farren’s butchers shop in Dungloe, a maid carrying out various duties, instruction being given on deportment, and members of the group sewing and reading by gaslight while listening to their wind up gramophone.\n\nMistress of the house Miss Clare Tyrrell, originally from England and her housekeeper, New Zealander Miss Reiner, appear on the ‘The Late Late Show’ to explain why they have chosen to live as Victorians. Miss Tyrrell says,\n\n    We don’t concern ourselves with present at all, we live in a little world inside our house.\n\nMiss Tyrrell is not living in a precise year and the different members of the household each favour different periods within the Victorian era. Miss Tyrrell prefers the early part of Queen Victoria’s reign as she enjoys being demure, modest and ladylike. Another member of the group prefers the mid 19th century and chooses to wear a crinoline petticoat.\n\nMiss Tyrrell is keen to stress the group are not simply escaping the modern world.\n\n    We see it as something much more creative and enjoyable than that.\n\nThis episode of ‘The Late Late Show’ was broadcast on 25 March 1988.",
      "release": "2018-07-16T10:37:01Z",
      "duration": "00:09:50",
      "explicit": false,
      "youTubeId": "gm1KJmwjdzo",
      "subjects": [
        "The Screamers",
        "Silver Sisterhood"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gm1KJmwjdzo"
      }
    },
    {
      "id": "b959a9d9-9eb1-4dd2-943c-3672e76c8de6",
      "title": "\u0022Maids of the Silver Sisterhood\u0022  Burtonport, Donegal Ireland - 1983",
      "description": "Groups living more unorthodox lifestyles have been attracted to Burtonport. Now the Silver Sisterhood plans to set up a matriarchal society.\n\nThe fishing village of Burtonport in County Donegal has quite the profound ability to attract the unusual. In the 1970s Atlantis House became home to the sect known locally as the Screamers.\n\nIn September 1982, new tenants moved in calling themselves the Rhennish Community or the Silver Sisterhood. They believe God is a woman and wish to set up a matriarchal society.\n\nThe group members are all female and they refer to themselves as ‘maids’ rather than women. The role man has played in civilisation has no place in this community. The one man in the group when it was founded in Burtonport has since left.\n\nThe maids work the land and grow their own crops. Sister Breca says the community plans to open a craft shop and tea rooms which will utilise produce from their cow and chickens, and salads from their gardens. Ultimately they would like to offer visitors a bed and breakfast.\n\nReligious devotion is central to this religious community.\n\nEverything we do is because we love God and she’s the centre of our lives so that when we’re working we chant her name, we sing songs to her.\n\nSister Breca is aware of the difficulties in trying to attract men to join the community in the long term. Although men are treated with kindness in the community there is a different order of things which they find difficult as they are used privilege and power in a patriarchal society.\n\nHowever this is a minor problem and for the moment\n\nWe’re just spending this time building up our community with maids but that will change in the future.\n\n12 July 1983",
      "release": "2018-07-12T15:04:03Z",
      "duration": "00:03:20",
      "explicit": false,
      "youTubeId": "59KuV4tlk2I",
      "subjects": [
        "Silver Sisterhood",
        "The Screamers"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=59KuV4tlk2I"
      }
    },
    {
      "id": "b9bea628-45ae-4f1e-8c6a-0fc4dcf9473b",
      "title": "Maids Of The Silver Sisterhood ( Rhennes ) - Donegal  19/11/1982",
      "description": "A group of women have come to Donegal to set up a sanctuary from the modern world.\n\nThe Silver Sisterhood, also known as Rhennes, arrived in Burtonport, Co Donegal in September 1982 from a small town in Yorkshire. They call themselves Rhennes in honour of a mythical goddess who was half maid, half-mare. They have their own language, music and a deep tradition of crafts in a pre-mechanised lifestyle. They wear full-length dresses and shawls and keep their heads covered when in public.\n\n    It’s here next door to the raw Atlantic they plan to establish their village. It’s to be a sanctuary from the modern world.\n\nAll of the group were strangers from different backgrounds before arriving in the Donegal town. The group is all women apart from one man, and refer to themselves as ‘maids’ rather than women. The role man has played in civilisation has no place in this community.\n\nThe group’s spiritual leader Sister Angelina tells RTÉ News about the origins of the group since its foundations in Devon and Cornwall. \n\n    he Rhennish tradition is the most ancient religious and cultural tradition in these Islands, that is to say in Britain and in Ireland, and we worship God as the mother and everything we do is centred around that worship.\n\nThis tradition extends beyond acts of worship to the crafts they practice, their language, their songs and their stories. The group have a strong work ethic which is an integral part of their spirituality.\n\nIn their new home by the sea, music and storytelling are now daily occurrences all spoken through the Rhennish tongue which dates back to the 14th century. All of their musical instruments are handmade by community members. They also make their own clogs, which they wear and will soon be sold to the public. They also plan to sell embroidered cloths depicting important Rhennish beliefs in the tree of life. \n\nThe maids live a simple existence without electricity or modern appliances in this centre which was once the home of the Screamers called ‘Atlantis’, and has now been renamed as ‘An Droichead Beo’ (The Bridge of Life). More members from Yorkshire are due to arrive at the centre before Christmas.  In keeping with their pursuit of self-sufficiency, they plan to grow their own crops and have already begun to work the land around the centre. \n\nWhile they mix little with the outside world, they have so far maintained a harmonious relationship with the local community. \n\n    For all their friendliness these new settlers aren’t quite what you expect to find in a Donegal fishing village.",
      "release": "2017-12-02T17:53:55Z",
      "duration": "00:04:42",
      "explicit": false,
      "youTubeId": "PUKigKY0grs",
      "subjects": [
        "Silver Sisterhood"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PUKigKY0grs"
      }
    },
    {
      "id": "0dcf71d4-a341-4f42-acff-c5b9d7968470",
      "title": "Atlantis Commune ( The Screamers ) - Co. Donegal 30/01/1981",
      "description": "Visit the Screamers Community in Burtonport, County Donegal and meets Atlantis founder Jenny James, her sister Snowy, daughter Becky and an Englishwoman Sally.\n\nThe Atlantis commune members believe aggression is a healthy emotion. As they see it, society has put a premium on mediocrity and being sweet and polite. In Atlantis a balanced person is somebody that can show the whole gamut of emotions with a premium put on being argumentative and aggressive.\n\n    Very extreme things get said indeed, that’s the point, that you get out every horrible thought you have about this person and then it’s up to the other person to feel what that does to them.\n\nThis philosophy is demonstrated in a heated exchange between Becky and Sally where Sally releases all her negative feelings about Becky. Becky however, is unsure of how to deal with what Sally is saying. Nevertheless, Jenny is happy for Sally to work her grudges off her daughter because if this did not happen she believes\n\n    She’ll feel it as a vibration, she’ll feel it as a tension, she’ll hate her she’ll want to cut off from her. We actually want people to express their aggression towards us because it’s then deal-able with, its see-able, touchable, feel-able and it’s not just a horrible feeling of something going on under the surface.\nAfter leaving Burtonport, the Atlantis Commune lived on the nearby island of Inishfree for several years before relocating to Colombia in South America.",
      "release": "2017-12-02T17:27:02Z",
      "duration": "00:05:42",
      "explicit": false,
      "youTubeId": "7Sm-AjNMxco",
      "subjects": [
        "The Screamers"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7Sm-AjNMxco"
      }
    },
    {
      "id": "df0f5112-6ff0-4b00-89e1-9acfdeaaa870",
      "title": "Atlantis Commune ( The Screamers ) - Co. Donegal  10/01/1980",
      "description": "An alternative way of life for the Atlantis Commune.\n\nReported on 10 January 1980 that the Atlantis Commune was to leave Burtonport in Co. Donegal. Known locally as the Screamers, the group practised primal screaming as a form of therapy. It was founded in 1974 by Englishwoman Jenny James, who features in this report along with other Atlantis members living in the commune’s house in Burtonport. The group talk about the benefits of their way of life, but locals such as Hugh Boyle do not agree.\n\nThe Atlantis commune members believe aggression is a healthy emotion. As they see it, society has put a premium on mediocrity and being sweet and polite. In Atlantis a balanced person is somebody that can show the whole gamut of emotions with a premium put on being argumentative and aggressive.\n\n    Very extreme things get said indeed, that’s the point, that you get out every horrible thought you have about this person and then it’s up to the other person to feel what that does to them.\n\nAfter leaving Burtonport, the Atlantis Commune lived on the nearby island of Inishfree for several years before relocating to Colombia in South America.",
      "release": "2017-12-02T17:11:29Z",
      "duration": "00:05:08",
      "explicit": false,
      "youTubeId": "D5dwGA4wDHM",
      "subjects": [
        "The Screamers"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=D5dwGA4wDHM"
      }
    }
  ]
}