{
  "id": "cf104bad-0d18-4319-8865-4ad52379f0ad",
  "name": "Lehigh Valley with Love Podcast",
  "spotifyId": "1yKYuS4U617bKeDQYeS6kW",
  "appleId": 1347726074,
  "youTubeChannelId": "UChehZgOASv6bqnRQGsKda3g",
  "episodes": [
    {
      "id": "58a985f5-494c-4dad-8f16-e8729e6e1522",
      "title": "Some of Lisa’s Favorite Cult Items | Lisa Joins a Cult at The Emmaus Theatre on February 23",
      "description": "Get More LVWITHLOVE Content Guests: Lisa Van Arsdale – Storyteller and Performer, “Lisa Joins a Cult” In this episode, we sit down with Lisa Van Arsdale to discuss her upcoming show, Lisa Joins a Cult, happening February 23 at 6 p.m. at the Emmaus Theatre. Lisa shares her journey of exploring fringe religious communities and collecting fascinating artifacts—like a “Jesus First” pin from the Jerry Falwell Museum, a protective card from Father Divine followers, and a pamphlet predicting Judgment Day in 2011. Far from mocking these beliefs, Lisa approaches these groups with curiosity and respect, offering a unique lens into their cultures. We dive into the stories behind these artifacts and how they’ve shaped her show. If you’ve ever been curious about fringe communities, this episode is for you! Links Lisa Joins a Cult Show Info \u0026 Tickets: https://emmaustheatre.com Learn More About Lisa: https://lisajoinsacult.com Watch Episode www.lvwithlove.com Thank you to our Partners! WDIY Lehigh Valley Health Network Wind Creek Event Center Michael Bernadyn of RE/MAX Real Estate Molly’s Irish Grille \u0026 Sports Pub Banko Beverage Company",
      "release": "2025-02-13T12:08:05Z",
      "duration": "00:27:05.3030000",
      "explicit": false,
      "spotifyId": "3MfEAebgkObmUf7N8Vj0Yc",
      "appleId": 1000691832793,
      "youTubeId": "R2UiYtC1LmU",
      "subjects": [
        "International Peace Mission movement",
        "Thomas Road Baptist Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3MfEAebgkObmUf7N8Vj0Yc",
        "apple": "https://podcasts.apple.com/podcast/some-of-lisas-favorite-cult-items-lisa-joins-a-cult/id1347726074?i=1000691832793",
        "youtube": "https://www.youtube.com/watch?v=R2UiYtC1LmU"
      }
    },
    {
      "id": "f5ae76a7-a142-424c-96a2-c1b09f49b9c0",
      "title": "Lisa Joins a Cult | March 23 at SteelStacks",
      "description": "We’re joined by Lisa Van Arsdale to talk about her one woman show “Lisa Joins a Cult”, which is taking place on March 23 at SteelStackts at 7:30 p.m! Lisa VanArsdale is a comedian, podcast host, and cult enthusiast whose love of culty groups and curiosity about the divine has taken her to holy sites all over the world. Lisa’s years of visiting with these groups is what drives her podcast-turned-live-performance “Lisa Joins A Cult.” Lisa approaches the complexity of cults and the people inside these communities with tenderness and humor, sharing a side of humanity many outsiders don’t get to see. Lisa has performed standup on three continents, but mostly here in the Lehigh Valley. She is also probably the only human to own both Mormon underwear and a Moonie crown and she’s obnoxiously proud of that. GUESTS Lisa Van Arsdale LINKS Lisa Joins a Cult",
      "release": "2024-02-26T12:57:30Z",
      "duration": "00:26:55.2030000",
      "explicit": false,
      "spotifyId": "0Nombvf0sISsler58bFuTW",
      "appleId": 1000646879364,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Unification Church",
        "International Peace Mission movement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Nombvf0sISsler58bFuTW",
        "apple": "https://podcasts.apple.com/podcast/lisa-joins-a-cult/id1347726074?i=1000646879364"
      }
    }
  ]
}