{
  "_ts": 0,
  "id": "3e83fd73-f5cf-4e4e-8f46-d6060a1a5709",
  "name": "Leonard East",
  "youTubeChannelId": "UC7yk661CON7521hh2o0eUKw",
  "episodes": [
    {
      "id": "8a421396-3bf0-4bcb-9ffd-9e44854ea837",
      "title": "What Russell said would cause the end of The Watchtower. JW.org",
      "description": "At the 2017 Annual Meeting of the Watchtower Bible and Tract Society of Pennsylvania, the legal hierarchy of the Jehovah\u0027s Witnesses religion, Governing Body member Anthony Morris explained the largest decrease in publishing of The Watchtower magazine in the history of the corporation. He also exposed that new issues of this publication may end in two years. The journal, founded by Charles Taze Russell, has been the principal means by which this cult has spread its false prophecies, doctrines, and teachings. This organization has seen a decline in new members in recent years due to exposure of its failed prophecies, harmful and destructive beliefs, and mind control indoctrination. The leadership claims this magazine contains God\u0027s truth and must have authority over the faith practices of their followers, but it has proven to contain deceit, propaganda, and errors.",
      "release": "2017-10-21T07:42:11Z",
      "duration": "00:13:21",
      "explicit": false,
      "youTubeId": "DbR4Sv8Urd4",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DbR4Sv8Urd4"
      }
    },
    {
      "id": "689ba2b6-7c31-4ee0-bb1c-8410f97a7d81",
      "title": "How the Governing Body lost most of their \u0022credentials.\u0022 JW.org",
      "description": "The Governing Body of Jehovah\u0027s Witnesses has throughout its history exerted unquestioned authority over the faith, practices, and lives of followers of the Watchtower Bible and Tract Society. Of all their false doctrines, teachings, and failed prophecies, the belief that the hierarchy is God\u0027s prophet and chosen organization has explained their destructive process of cult indoctrination, mind control, deceit, and abuse of the members of this religion. The recent changing of some old doctrines and beliefs by the leadership has exposed these exclusive claims to be errors.",
      "release": "2017-09-08T16:24:08Z",
      "duration": "00:12:59",
      "explicit": false,
      "youTubeId": "uQItMkQzDTE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uQItMkQzDTE"
      }
    },
    {
      "id": "3e36e80b-319f-4df4-8ed9-0f992fdd4c0a",
      "title": "The Governing Body doesn\u0027t care if JW\u0027s don\u0027t really believe the changing doctrines. JW.org",
      "description": "Comments excerpted from a recent radio talk show explain the principle of forcing people to accept big lies, which also exposed how the Watchtower Bible and Tract Society uses its authority to force Jehovah\u0027s Witnesses to accept the flip flop beliefs and doctrines of this false religion. Their history of conflicting false teachings, practices, have left members in confusion and fear, and subject to the indoctrination, mind control, and abuse from the leadership of this dangerous cult.",
      "release": "2017-08-27T05:02:35Z",
      "duration": "00:02:58",
      "explicit": false,
      "youTubeId": "RVH4QyXecdY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RVH4QyXecdY"
      }
    }
  ]
}