{
  "id": "41b685e5-26b3-4618-9651-b22972befc0b",
  "name": "Let Fear Bounce - Tossing out nuggets of hope",
  "spotifyId": "0tLAznvUG8hVVsTXdvTMTk",
  "appleId": 1541906455,
  "episodes": [
    {
      "id": "a0fe2807-9efc-4737-a1de-255cbd509c90",
      "title": "Trauma Bonded with author, Sarah Westbrook S4 EPS 27",
      "description": "Sarah Westbrook, MS, LPC, NCC, founded Westbrook Counseling Services and Daisy Girl Communications. As a trauma survivor herself, she understands the work that goes into healing. She helps her clients work through their pain to achieve lasting results, laughing along the way to becoming their most authentic selves. \u0026#xfeff;As a National Certified Counselor (NCC) and an American Counseling Association (ACA) member, Sarah entered clinical practice as a professional counselor in 2014. With a master of science in mental health counseling from Walden University and focused continued education in Trauma-Informed Therapy, The Gottman Method, DBT, and CBT, she provides individual therapy, couples and family counseling, and weekend psychoeducational training courses. After a dysfunctional and abusive Mormon upbringing, Sarah left the religion and began her journey to heal from c-PTSD and the religious trauma of her childhood. She shares her faith transition, along with advice for healing from toxic cult-like religious systems, on her podcast Unpacking with Sarah, where she offers psychoeducation for parents and caregivers, especially those with behaviorally challenging children. After traveling the US as an Army wife and mother of nine, Sarah and her family settled in central Missouri. In her rare spare time, she loves to read, binge-watch Friends, and hike. She can occasionally be found hiding from her children and eating caramel popcorn in her closet. Learn more at www.daisygirlcommunications.com. Book: Trauma Bonded: A True Story of Navigating Attachments Forged in Complex PTSD available on Amazon Learn more about your host, Kim Lengling www.kimlenglingauthor.com",
      "release": "2024-07-10T10:30:00Z",
      "duration": "00:56:28.6040000",
      "explicit": false,
      "spotifyId": "1CuOiO8ZHFh97uxLSizjms",
      "appleId": 1000661769144,
      "subjects": [
        "Psychology",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1CuOiO8ZHFh97uxLSizjms",
        "apple": "https://podcasts.apple.com/podcast/trauma-bonded-with-author-sarah-westbrook-s4-eps-27/id1541906455?i=1000661769144"
      }
    }
  ]
}