{
  "id": "38a02a90-bec1-4c5d-adc8-1a849e5718a0",
  "name": "Let The Fresh Erin",
  "spotifyId": "5U17Abq4dAC410b3H7Osw1",
  "youTubeChannelId": "UCdUiO-KWP-u0ytmOSoWm_-g",
  "episodes": [
    {
      "id": "d3b9f558-54ec-4389-acd7-32e6684beb78",
      "title": "The Dark Truth About Group 764: How a Teen Cult Became a Global Threat",
      "description": "They call themselves 764—a shadowy online cult that began on Discord and spread across the world. What started in a Texas zip code quickly became one of the most disturbing internet movements ever uncovered.\n\nIn this investigation, we expose how 764 targeted children as young as nine, coerced them into acts of self-harm and abuse, and spread across continents despite arrests, takedowns, and FBI crackdowns. You’ll hear how the group splintered into factions like Inferno and No Lives Matter, and how law enforcement is still fighting to contain it today.\n\n🔎 Chapters:\n0:00 – The Ping That Started It All\n4:30 – Origins in Texas\n11:15 – The Rise of Rituals and Grooming\n20:45 – Escalation: Abuse, Extortion \u0026 Violence\n33:10 – Splintering Into The Com\n46:25 – Public Exposure \u0026 FBI Response\n55:00 – Major Arrests Around the World\n1:05:30 – Where 764 Stands Today\n\n⚠️ Trigger Warning: This video discusses child exploitation, self-harm, and extremist content. Viewer discretion is strongly advised.\n\n✦ If you or someone you know is struggling with online abuse, contact the National Sexual Assault Hotline (RAINN)\n at 1-800-656-4673, or reach out to your local child protection services.\n\n➤ Subscribe for more in-depth investigations into the hidden corners of the internet.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-09-13T13:00:19Z",
      "duration": "00:38:09",
      "explicit": false,
      "youTubeId": "CyzLsIPqvx0",
      "subjects": [
        "The Order of Nine Angles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CyzLsIPqvx0"
      }
    },
    {
      "id": "3456a56e-6e33-46df-84cc-2ee1221c3beb",
      "title": "Inside Jared Leto\u0027s \u0022Cult\u0022: The Thirty Seconds to Mars Echelon",
      "description": "He calls his fans a cult – and they wear it like a badge. Jared Leto, an Oscar-winning actor turned rock frontman, has built a fanbase so devout that it’s drawn comparisons to a religious cult. Clad in white robes on a private island, Leto addressed hundreds of followers in scenes eerily reminiscent of a spiritual retreat, even captioning one 2019 photo, “Yes, this is a cult.”\n\n In truth, these fans call themselves The Echelon, a tight-knit community around Leto’s band Thirty Seconds to Mars – a group the band itself once cheerfully described as “a cult” from early on\n\n. How did a Hollywood star’s rock band inspire such fervent, cult-like devotion? This video goes behind the sensational headlines and viral images to find out.\n\nToday, we delve into Thirty Seconds to Mars’ unusual journey from its formation in 1998 to the creation of an obsessive fan community. We explore the band’s early days and the rise of the Echelon fan culture, including the symbolic slogans and cult imagery (like the now-infamous “Yes, this is a cult” tagline) that Leto and his brother Shannon wove into their music and merch\n\nYou’ll see how these immersive events and rituals fueled the “cult” reputation, and hear how media coverage amplified the mystique (with headlines dubbing Leto a real-life cult leader). We also compare the Echelon’s structure and us-vs-them mentality with bona fide cults, asking where the line blurs between an ardent fan community and a cult of personality. Finally, the film reveals Jared Leto’s response to the cult allegations – including his insistence that it’s all an inside joke\n – and invites you to decide just how far is too far when fandom turns fanatic. Join us as we uncover the truth behind the hype, exposing the fine line between passionate fandom and the cult of Mars.\n\nChapters\n\n0:00 Introduction – A shocking look at Jared Leto’s band and its cult-like fanbase\n\n3:00 Band Formation \u0026 Early Years – From Hollywood actor to rock frontman: how Thirty Seconds to Mars began\n\n8:00 Rise of the Echelon – The emergence of an intense fan community and its unique culture\n\n14:00 \u0022Yes, This Is a Cult\u0022 Slogan \u0026 Symbolism – The band’s use of cult-like imagery, slogans, and insider language\n\n20:00 Camp Mars Fan Retreats – Summer camp gatherings that brought fans closer and blurred fan-idol boundaries\n\n27:00 Mars Island Controversy – Inside the 2019 Croatian island retreat that sparked headlines of a “rock cult”\nkqed.org\n\n34:00 Media Coverage \u0026 Public Reaction – How press and social media responded to Thirty Seconds to Mars’ cult reputation\n\n40:00 Cult vs. Fandom – Comparing the Echelon’s devotion and structure to actual cults, and the psychology of fanatical loyalty\n\n46:00 Jared Leto’s Response \u0026 Aftermath – Leto’s own explanation of the “cult” label, the band’s stance, and closing thoughts on the fine line between fan culture and cult culture\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-09-06T13:01:44Z",
      "duration": "00:49:45",
      "explicit": false,
      "youTubeId": "umhBQTBa6nc",
      "subjects": [
        "Jared Leto"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=umhBQTBa6nc"
      }
    },
    {
      "id": "6fc8c7f4-b354-4cab-8013-c6c396d160d7",
      "title": "Human Design EXPOSED: Cult, Scam, or Just Astrology on Steroids?",
      "description": "What if your entire life could be explained by a chart mixing astrology, chakras, and quantum physics… and if you don’t follow it, aliens will wipe us out by 2060? 🤯 Welcome to Human Design — the bizarre New Age system with cult vibes, a doomsday prophecy, and a founder who renamed himself Ra Uru Hu.\n\nIn this dramatic \u002B funny exposé, we break down:\n\nThe wild origin story (a mystical “Voice” in Ibiza 👀)\n\nHow Human Design works (Types, BodyGraph, and cosmic nonsense explained)\n\nThe cult-like red flags: hierarchies, gatekeeping, $$$ workshops\n\nThe apocalyptic alien prophecy you’ve never heard of\n\nWhy influencers \u0026 companies are cashing in on it\n\nChapters\n\n0:00 Intro \n\n1:20 Origins – Ra Uru Hu’s “Voice” revelation\n\n3:45 Human Design 101 – How the chart works\n\n6:30 Red Flags – Cult bingo \u002B alien prophecies\n\n8:50 Follow the Money – Paywalls \u0026 influencer hustle\n\n10:15 Why People Buy In – Psychology \u0026 validation\n\n12:30 Final Verdict – Fun tool, scam, or soft cult?\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-08-23T13:00:05Z",
      "duration": "00:55:43",
      "explicit": false,
      "youTubeId": "259XfW-F2_Y",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=259XfW-F2_Y"
      }
    },
    {
      "id": "e0d9b14d-eab7-4718-8853-5aefb1cf0449",
      "title": "Inside the Jesus Army: The Dark Truth About the UK’s Most Controversial Cult",
      "description": "Step inside the Jesus Army, one of the UK’s most secretive and controversial religious movements. From communal living and strict daily routines to spiritual manipulation and controlled relationships, this deep dive exposes what life was truly like for members—and the lasting impact on children, teens, and adults who grew up inside.\n\nThrough survivor testimonies, investigative reporting, and rare archival footage, we explore the cult’s origins, rise, and eventual decline, revealing the psychological, social, and spiritual mechanisms that held this community together.\n\n0:00 – Introduction\n1:45 – Origins: How the Jesus Army Began in the UK\n4:20 – The Daily Grind: Life Inside the Cult\n9:10 – Childhood \u0026 Teens: Growing Up Under Control\n13:45 – Worship \u0026 Evangelism: The Pressure to Belong\n18:30 – Leadership \u0026 Authority: How Control Was Maintained\n22:50 – Relationships \u0026 Marriage: Love Under Scrutiny\n27:15 – Abuse Allegations \u0026 Investigations: The Dark Side Revealed\n31:40 – Decline \u0026 Legacy: What Happened to the Jesus Army\n35:20 – Lessons Learned: Recognizing Cult Patterns Today\n38:00 – Conclusion: Reflecting on Faith, Control, and Freedom\n⚠️ Content warning: This video discusses manipulation, coercion, and abuse. Viewer discretion is advised.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-08-16T13:00:46Z",
      "duration": "01:11:21",
      "explicit": false,
      "youTubeId": "Q5tv1TXZ-ak",
      "subjects": [
        "Jesus Army"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q5tv1TXZ-ak"
      }
    },
    {
      "id": "40e753d8-1f00-4777-9bd7-bb638e3d1f4e",
      "title": "Inside the Shekinah TikTok Dance Cult: FBI Raid, Shocking Evidence \u0026amp; Survivor Testimonies",
      "description": "🔍 The Shekinah TikTok Dance Cult Raid EXPOSED! 🔥\n\nIn this exclusive deep dive, we investigate the explosive FBI raid on the Shekinah TikTok Dance Cult in Los Angeles. The shocking discovery has rocked the online world, revealing disturbing truths behind the cult’s secretive practices. Survivor stories, insider accounts, and expert analysis paint a terrifying picture of a group that used fame, faith, and manipulation to control its followers.\n\n👉 Watch as we break down:\n\nThe history of Shekinah Church and its ties to TikTok stardom\n\nHow the cult used social media to exploit young dancers for fame and fortune\n\nThe shocking FBI raid: What they found inside and why it took years for the authorities to intervene\n\nSurvivors speak out: Heartbreaking testimonies of escape, abuse, and survival\n\nExpert opinions: Cult experts explain how Shekinah’s tactics mirror dangerous high-control groups\n\nThis is a MUST-WATCH for anyone interested in understanding how social media can be manipulated by charismatic leaders. Don’t forget to like, share, and subscribe for more in-depth investigations!\n\nChapters:\n00:00 – Introduction: The Shekinah TikTok Cult Exposed\n02:15 – Who Was Robert Shinn? The Rise of Shekinah Church\n06:30 – The Hidden World of Shekinah: Secrets Behind the TikTok Fame\n12:10 – FBI Raid: The Shocking Discovery at Shekinah’s Headquarters\n18:00 – What They Found: Evidence of Trafficking, Fraud, and Abuse\n25:45 – Survivors Speak: Heartbreaking Testimonies from Escapees\n33:00 – Cult Experts Weigh In: How Shekinah Used Manipulation and Fear\n40:00 – The Fallout: How the Raid Is Changing Lives and What’s Next\n45:30 – Conclusion: The Ongoing Fight for Justice and Healing\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-08-09T13:01:13Z",
      "duration": "00:57:09",
      "explicit": false,
      "youTubeId": "cItz9MPlUPk",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cItz9MPlUPk"
      }
    },
    {
      "id": "2eb3d605-5fca-41f5-ae04-c96d4cab9ca8",
      "title": "The Vampire Sugar Daddy Cult Murder | The Chilling Case of Aubrey Trail \u0026 Bailey Boswell",
      "description": "A twisted love story. A Tinder date turned deadly. A chilling “vampire cult” led by a con man and his deadly muse.\n\nThis is the full, disturbing story of Aubrey Trail and Bailey Boswell, the couple who lured 24-year-old Sydney Loofe to her death under the guise of a romantic date—only to become national headlines for their bizarre claims of witchcraft, supernatural powers, and murder-for-pleasure.\n\nFrom their dark personal histories and manipulative scams to the occult-obsessed sex cult they built, this in-depth true crime documentary uncovers the full horror behind the headlines.\n\n👉 LIKE if you’re into deep true crime cases\n👉 SUBSCRIBE for weekly long-form investigative stories\n\n⚠️ Trigger Warning: This video contains descriptions of violence, murder, and psychological ab*se. Viewer discretion is advised.\n\n🎙️ Chapters\n\n00:00 – Intro: The Disappearance That Shook Nebraska\n03:22 – TEACHER OF THE DAY!\n07:18 – Aubrey Trail: Conman, Manipulator, Predator\n13:02 – Bailey Boswell: From All-Star to Accomplice\n19:55 – A Match Made in Hell: How They Met\n24:37 – Building the “Coven”: Their Alleged Cult and Vampire Claims\n32:11 – Sex, Scams, and Control: The Cult\u0027s Inner Workings\n38:56 – Target: Sydney – The Tinder Trap Is Set\n44:12 – The Murder of Sydney Loofe\n50:45 – Cover-Up and Road Trip: Trail \u0026 Boswell on the Run\n56:08 – Facebook Live and Public Gaslighting\n1:00:41 – The Manhunt and Arrest\n1:05:00 – The Shocking Discovery of Sydney’s Remains\n1:09:18 – The Confessions: Lies, Claims, and Fantasy\n1:16:29 – Aubrey Trail’s Trial \u0026 Courtroom Chaos\n1:25:44 – Bailey Boswell’s Trial and the Death Penalty Debate\n1:35:13 – Final Sentencing \u0026 Aftermath\n1:40:08 – Legacy of the Case: Justice, Warnings, and Sydney’s Impact\n1:44:20 – Outro: Evil Disguised in Fantasy\n👇 Let us know your thoughts in the comments.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-08-02T13:01:26Z",
      "duration": "01:13:38",
      "explicit": false,
      "youTubeId": "k-D6Qv2er6o",
      "subjects": [
        "Aubrey Trail"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k-D6Qv2er6o"
      }
    },
    {
      "id": "b8e2909e-b430-462a-9ccd-373a738bf9f4",
      "title": "Alpha Male Culture EXPOSED: The Dark Truth Behind Andrew Tate and Toxic Masculinity",
      "description": "Is the rise of “alpha male” influencers empowering men—or destroying them?\nIn this explosive investigation, we dive deep into the disturbing world of alpha male culture, uncovering the truth behind Andrew Tate\u0027s rise to fame, the Romanian human trafficking scandal, and the multi-billion dollar industry built on male insecurity. From luxury lifestyle scams to brutal retreats where men pay to be screamed at, this video reveals the dangerous lies being sold to a generation of boys and men.\n\n💥 Featuring expert analysis, court records, and real-world examples, this is the full breakdown the media won’t show you.\n\n⏱️ Chapters:\n0:00 Intro/Teacher Story!\n7:50 Andrew Tate: From Kickboxer to Controversial Icon\n14:22 The Romania Scandal Explained\n21:40 Inside the “War Room” and Hustler’s University\n28:15 The Rise of Alpha Male Bootcamps\n35:00 How It Hurts Men, Women, and Society\n42:55 What We Can Do About It\n\n📌 SUBSCRIBE for more investigative deep dives\n👍 Like | 💬 Comment | 🔔 Turn on notifications\n\n\nThis documentary-style breakdown explores it all — with real facts, verified sources, and no sensationalism. Share this if you believe we need to have harder conversations about online hate, gender-based violence, and how to stop the next attack before it happens.\n\n👇 Let us know your thoughts in the comments.\n\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-07-26T13:00:24Z",
      "duration": "01:08:46",
      "explicit": false,
      "youTubeId": "FlimnxuK6kU",
      "subjects": [
        "Hustler\u0027s University"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FlimnxuK6kU"
      }
    },
    {
      "id": "224dc449-7938-4adb-941a-80b38dd6f131",
      "title": "INCELS: From Elliot Rodger to Bryan Kohberger: The Internet Cult You’re Not Supposed to Talk About",
      "description": "A hidden online subculture of angry men, a growing trail of mass violence, and a terrifying ideology that began on obscure internet forums — this is the dark reality of the incel movement.\n\nFrom the 2014 Isla Vista massacre by Elliot Rodger, to the tragic Idaho student murders and speculation surrounding Bryan Kohberger, this investigative deep dive uncovers the rise of incel extremism, the deadly consequences it has left behind, and the chilling online world where misogyny turns into murder.\n\n🔍 What exactly is an incel?\n💻 How did these communities grow in the shadows of the internet?\n🧠 Is incel ideology a form of terrorism?\n🧾 And what does the public get wrong about cases like Idaho 4?\n\n00:00 - Introduction: A Rage That Echoes  \n07:22- Video begins\n11:30 - From Online Grievance to Offline Violence  \n15:05 - The Toronto Van Attack \u0026 Incel Rebellion  \n18:40 - Misogynist Massacres: Tallahassee and Beyond  \n23:10 - Is Incel Violence Terrorism? What Law Enforcement Says  \n27:55 - The Digital Ecosystem: Forums, Saints, and Algorithms  \n32:30 - Idaho 4 Murders: Who Is Bryan Kohberger?  \n36:50 - The Incel Speculation: Rumors vs. Reality  \n41:00 - Preventing the Next Attack: Warning Signs and Action  \n45:25 - Conclusion: What We Choose to See  \n\n\nThis documentary-style breakdown explores it all — with real facts, verified sources, and no sensationalism. Share this if you believe we need to have harder conversations about online hate, gender-based violence, and how to stop the next attack before it happens.\n\n👇 Let us know your thoughts in the comments.\n\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-07-19T13:00:16Z",
      "duration": "00:57:46",
      "explicit": false,
      "youTubeId": "9nJXxB6c8S8",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9nJXxB6c8S8"
      }
    },
    {
      "id": "c6584cd8-f773-4776-9fc6-3b08c7cc275f",
      "title": "Sister Wives EXPOSED: The Shocking Truth Behind Polygamy, Power \u0026 the Mormon Church",
      "description": "What really happened behind the scenes of Sister Wives? From heavenly callings to heartbreaking betrayals, this deep-dive exposes the secret history of Mormon polygamy, the rise and fall of Kody Brown’s plural family, and the cult-like underworld of fundamentalist sects. We trace it all—from Joseph Smith’s revelations to modern scandals, legal battles, and the unraveling of America’s most famous polygamist clan.\n\n🔔 Subscribe for more investigative documentaries on religion, power, and pop culture.\n📌 Chapters:\n00:00 - Intro: Behind the Smiles\n08:12 - Mormonism’s Secret Doctrine\n12:45 - Meet the Browns: A Family on Display\n23:30 - Legal Trouble \u0026 the Fight for Polygamy\n33:50 - Betrayals, Breakups \u0026 Catfishing\n39:05 - What the Church Won’t Tell You\n55:10 - Cults, Crimes \u0026 the Real Cost of Plural Marriage\n\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-07-12T13:00:31Z",
      "duration": "00:58:32",
      "explicit": false,
      "youTubeId": "9s0bNQ0s2XE",
      "subjects": [
        "Apostolic United Brethren",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9s0bNQ0s2XE"
      }
    },
    {
      "id": "9bdf8094-a98a-41b8-9725-8783891b4c70",
      "title": "Is America a Cult? The Dark Truth Behind the Flag, the Pledge, and the Myth of Freedom 🇺🇸",
      "description": "Is the United States really the land of the free—or the most powerful cult in modern history?\n\nIn this explosive long-form breakdown, we investigate how America functions not just as a country, but as a belief system built on myth, ritual, and enforced loyalty. From childhood indoctrination in schools to the worship of the flag and military, from whitewashed history to media propaganda and religious nationalism—this video exposes the uncomfortable truth behind what we\u0027ve always been told.\n\n🔥 Why are children pledging allegiance before they can think critically?\n🔥 Why are whistleblowers treated like traitors?\n🔥 Why does questioning American greatness feel like heresy?\n\nWhether you\u0027re a patriot, a skeptic, or just curious—this is the conversation America refuses to have.\n\n🎧 Watch the full essay and decide for yourself: Is America a democracy... or a national cult?\n\n📌 Chapters:\n0:00 – Intro: The Ritual Begins\n2:20 – Today\u0027s Teacher!\n8:10 – The Myth of American Innocence\n15:45 – Sacred Symbols and Patriotism as Worship\n22:30 – The Propaganda Machine\n28:00 – Dissent Is Treason: Whistleblowers and Protest\n35:20 – One Nation Under God: Evangelical Nationalism\n42:00 – Conclusion: Deprogramming a Nation\n\n📌 Like, share, and subscribe for more critical deep dives into faith, control, and cults\n\n👉 Don’t forget to like, comment, and subscribe for more deep dives into toxic institutions and untold stories.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-07-05T13:01:54Z",
      "duration": "01:30:22",
      "explicit": false,
      "youTubeId": "ssVMV7lMYyo",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ssVMV7lMYyo"
      }
    },
    {
      "id": "1a2a12f8-84f7-481b-b3fd-00955265c800",
      "title": "TWIN FLAMES UNIVERSE CULT RAIDED BY POLICE!!!  Is this the end of TFU?!?!",
      "description": "Twin Flames Universe was RAIDED by poice yesterday.  Let’s discuss it all and talk about the allegations!\n\nWANNA HELP TAKE THEM DOWN?!  Share your evidence with MIchigan AG Dana Nessell at \nhttps://forms.office.com/pages/responsepage.aspx?id=h3D71Xc3rUKWaoku9HIl0cUCDdmxp3NGv0yqkBL6EwhUN1ExS1cxMlE4TEhSQjJJVlFJV1ZFMFhQQyQlQCN0PWcu\u0026route=shorturl\n\nOR EMAIL THEM AT AG-TFUInfo@Mi.gov",
      "release": "2025-07-02T22:31:15Z",
      "duration": "01:27:02",
      "explicit": false,
      "youTubeId": "XqCBIH6rCz0",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XqCBIH6rCz0"
      }
    },
    {
      "id": "bd83ca74-d832-401c-b347-ac6ee419bff8",
      "title": "MOMTOK EXPOSED: The REAL Secret Lives of Mormon Wives-The Rules That Break Mormon Women",
      "description": "In this powerful deep dive, we expose the hidden expectations placed on women inside the Church of Jesus Christ of Latter-day Saints — from childhood modesty training to temple marriage, from purity interviews with grown men at 13 to the crushing perfectionism behind Utah’s “happy mom” facade.\n\nInspired by The Secret Lives of Mormon Wives, this investigation pulls back the curtain on the reality behind the pastel filters of MomTok. Why are so many LDS women medicated, silenced, or leaving the Church entirely? And how much control does the Mormon Church really exert over a woman’s mind, body, marriage, and destiny?\n\n✦ Discover:\n\nThe truth about LDS purity culture and shame\n\nWhy modesty begins before puberty — and never ends\n\nHow temple marriage and motherhood become a woman’s only “divine” path\n\nThe fallout of “soft-swinging” in the most chaste religion in America\n\nThe unseen cost of being the perfect Mormon wife\n\nThis is more than a story about religion. It’s about identity, obedience, and the price women pay to be seen as “worthy.”\n\n📌 Like, share, and subscribe for more critical deep dives into faith, control, and cults\n\n👉 Don’t forget to like, comment, and subscribe for more deep dives into toxic institutions and untold stories.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-06-28T13:00:07Z",
      "duration": "01:26:31",
      "explicit": false,
      "youTubeId": "aqkuP-Sj5OQ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aqkuP-Sj5OQ"
      }
    },
    {
      "id": "91149f39-b722-41a0-9f30-011f1985f255",
      "title": "The Dark Truth Behind the Duggars | How a Reality TV Empire Covered Up a Cult",
      "description": "They were America’s most famous family — 19 kids, strict values, and a Bible in every hand. But behind the smiles and matching outfits was a darker story.\n\nThis in-depth investigation exposes how the Duggar family rose to fame while hiding disturbing truths: abuse, manipulation, and a dangerous religious ideology known as the Institute in Basic Life Principles (IBLP). From Josh Duggar’s hidden crimes to the psychological control wielded by patriarch Jim Bob, this is the story the cameras never showed.\n\n✨ Featuring the stories of Jill and Jinger Duggar, survivor testimony, and analysis of how faith became fear — and how the truth finally broke through.\n\n⛓️ Cult dynamics.\n📺 Reality TV deception.\n🧠 Religious trauma.\n🔥 This is the real story of the Duggars.\n\n👉 Don’t forget to like, comment, and subscribe for more deep dives into toxic institutions and untold stories.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-06-21T13:00:46Z",
      "duration": "01:01:15",
      "explicit": false,
      "youTubeId": "MjVRgAr-bLU",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MjVRgAr-bLU"
      }
    },
    {
      "id": "66cacb67-db14-4ff3-9ad6-fcf789a9d68f",
      "title": "White Nationalism EXPOSED: How a Hate-Fueled Lie Became a Global Threat",
      "description": "It didn’t start with tiki torches or viral hashtags—white nationalism has been quietly growing for over a century. This video pulls back the curtain on the movement’s dark origins, its rebranding in modern politics, and how it spreads online today. From secret societies to Capitol riots, we trace the blueprint of an ideology built on fear, lies, and power. If you think it’s just fringe—think again.\n\nWhite nationalism has deep roots in American and global history, but its modern resurgence presents new and alarming challenges. In this documentary-style deep dive, we explore the origins of white nationalist ideology, how it has evolved over the decades, and why it continues to pose a serious threat today. From historical movements to recent events, this video sheds light on the myths, the manipulation, and the real-world consequences of extremist beliefs. Watch to understand the past—so we can better protect the future.\n\n🔔 Watch now to see how hate evolves—and why staying silent is not an option.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-06-14T13:00:43Z",
      "duration": "01:11:13",
      "explicit": false,
      "youTubeId": "PA-336AA3vs",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PA-336AA3vs"
      }
    },
    {
      "id": "1cb807e3-138a-4cb0-955a-dea1a3cd5943",
      "title": "Shiny Happy Lies: The Disturbing World of IBLP-EXPOSING Bill Gothard",
      "description": "Bill Gothard built a Christian empire through the Institute in Basic Life Principles (IBLP), influencing families, churches, and even politicians for decades. But beneath the surface of modesty, authority, and “God’s perfect plan” was a deeply troubling reality.\n\nThis documentary dives into the dark side of IBLP — from strict gender roles and spiritual manipulation to the disturbing allegations that brought it all crashing down.\n\n🔍 What you’ll learn in this video:\n\nWho is Bill Gothard, and how did he gain so much power?\n\nThe core teachings of IBLP and their impact on generations\n\nFirsthand survivor accounts and whistleblowers\n\nThe scandal that led to Gothard’s downfall\n\n➡️ If you’ve seen Shiny Happy People — this goes deeper.\n\n👁️‍🗨️ Trigger warning: Topics include spiritual abuse and misconduct.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-06-07T13:00:26Z",
      "duration": "01:00:15",
      "explicit": false,
      "youTubeId": "HJz2zAZLteE",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HJz2zAZLteE"
      }
    },
    {
      "id": "53235c81-bc6e-4f3f-9832-abd5a487e889",
      "title": "The Angel’s Landing Cult: The ‘Angel’ Who Killed for Money",
      "description": "This is the horrifying true story of Angel’s Landing—a secluded Kansas commune led by a man who claimed to be a centuries-old angel. But behind the gates of this peaceful property, Lou Castro (aka Daniel Perez) orchestrated a dark web of manipulation, sexual abuse, and a string of suspicious deaths… all for insurance money.\n\nHow did he convince families to follow him?\nWhy did so many people around him die?\nAnd how did one brave survivor finally expose the truth?\n\nThis deep-dive documentary uncovers the shocking secrets of one of America’s most disturbing modern cults. Watch until the end—you won’t believe how it all unravels.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-05-31T13:01:26Z",
      "duration": "00:48:04",
      "explicit": false,
      "youTubeId": "pqShjni7CGE",
      "subjects": [
        "Angel\u0027s Landing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pqShjni7CGE"
      }
    },
    {
      "id": "5f9a3f7d-7910-48fd-a2ed-b93e010e6e3a",
      "title": "Charles Manson: The Cult Leader Who Manipulated Murder | The Manson Family Murders EXPLAINED",
      "description": "He never killed anyone himself — but his words did.\nCharles Manson, the failed musician turned cult mastermind, orchestrated one of the most shocking crime sprees in American history. This deep dive unpacks the chilling psychology of Manson, the twisted loyalty of his followers, and the horrifying events that led to the 1969 Tate-LaBianca murders.\n\nDiscover how a man with messiah delusions and apocalyptic visions manipulated a group of young minds into committing unspeakable acts — all in the name of starting a race war he called Helter Skelter.\n\n📌 What was Manson’s real plan?\n📌 Who were the victims—and why were they targeted?\n📌 How did this cult spiral out of control?\n\n⚠️ This video contains sensitive content intended for educational and documentary purposes.\n\n🔔 Subscribe for more true crime deep dives, cult breakdowns, and infamous cases that shook the world.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-05-24T13:01:01Z",
      "duration": "01:12:40",
      "explicit": false,
      "youTubeId": "Y08EIziGEoY",
      "subjects": [
        "Manson Family",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Y08EIziGEoY"
      }
    },
    {
      "id": "8fc62c22-b0e1-4eca-987e-b6298a2f83a0",
      "title": "Inside Japan’s DEADLIEST Cult: The Aum Shinrikyo Terror That Shook the World",
      "description": "On March 20, 1995, Tokyo\u0027s subway system turned into a nightmare when commuters began collapsing—choking, blinded, and convulsing. Behind the deadly sarin gas attack was a doomsday cult led by a self-proclaimed messiah: Shoko Asahara.\n\nThis is the unbelievable true story of Aum Shinrikyo—how a blind yoga instructor convinced scientists, doctors, and elite students to build chemical weapons, plot mass murder, and try to end the world.\n\nIn this deep investigation, we uncover:\n🚨 The terrifying psychology behind the cult’s rise\n🧪 How they built weapons of mass destruction in secret\n🕵️‍♂️ Why Japan’s police missed the warning signs\n💀 The twisted theology that justified mass killing\n⚖️ And how justice finally caught up with them\n\n👉 This isn’t fiction. This happened.\nWatch until the end for survivor accounts, court revelations, and the chilling legacy of the cult’s remnants today.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-05-16T13:00:01Z",
      "duration": "01:16:20",
      "explicit": false,
      "youTubeId": "0Bw9Nevm_hY",
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0Bw9Nevm_hY"
      }
    },
    {
      "id": "e21f0c20-4c3e-47a3-bce5-243a8c3b9d77",
      "title": "Inside Tulsi Gabbard’s Secret Past: Cult Ties, Signal Leaks \u0026 Political Flip",
      "description": "From spiritual disciple to U.S. spy chief—this investigative deep dive unpacks the wild and controversial rise of Tulsi Gabbard.\nRaised in a secretive religious sect led by a reclusive guru, Gabbard’s journey to becoming Donald Trump’s Director of National Intelligence is full of twists: alleged cult influence, political shapeshifting, ties to authoritarian regimes, and a shocking 2025 Signal chat scandal that exposed top-secret war plans.\n\nWe break it all down—backed by real evidence, insider accounts, and verified sources.\n\n🔍 What really drives Tulsi Gabbard?\n💥 Why was a journalist accidentally added to a military group chat?\n🤯 Is a cult leader still pulling strings behind the scenes?",
      "release": "2025-05-13T13:01:13Z",
      "duration": "01:09:38",
      "explicit": false,
      "youTubeId": "gKrA8cdFsvw",
      "subjects": [
        "Science of Identity Foundation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gKrA8cdFsvw"
      }
    },
    {
      "id": "60088671-577e-43cc-a5e2-32ec4b5159ed",
      "title": "Inside the Cult: Exposing The Dark Truth About Chris Butler and the Science of Identity Foundation",
      "description": "What do you get when you mix yoga, politics, and cult-like control? In this explosive exposé, we dive deep into the secretive world of the Science of Identity Foundation and its enigmatic leader, Chris Butler — also known as Jagad Guru Siddhaswarupananda. From its beginnings in Hawaii to its rumored influence in American politics, including ties to high-profile figures like Tulsi Gabbard, this video uncovers disturbing allegations, bizarre spiritual practices, and the psychological grip of one of the most shadowy spiritual movements in modern history.\n\nJoin us as we investigate:\n\nThe cult-like structure behind the scenes\n\nFirst-hand accounts from ex-members\n\nChris Butler’s origins and evolution as a guru\n\nHow the Foundation intertwines spirituality with control\n\nThe hidden influence in political circles\n\n🔍 Based on real reports, insider testimony, and investigative research.\n\nViewer discretion advised.\nSubscribe for more deep dives into hidden worlds and underground movements.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-05-09T13:01:09Z",
      "duration": "01:10:16",
      "explicit": false,
      "youTubeId": "dw7BhKcHYdM",
      "subjects": [
        "Science of Identity Foundation",
        "Hare Krishnas"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dw7BhKcHYdM"
      }
    },
    {
      "id": "c78b206f-feb5-4299-a570-bdd1f79f5180",
      "title": "The Untold Truth About Joel Osteen: Mega Pastor or Master Manipulator?",
      "description": "Joel Osteen built the largest church in America and became the smiling face of modern Christianity — but what’s really behind the curtain? In this full investigative deep dive, we explore Osteen’s rise from camera operator to global televangelist, the truth about his prosperity gospel, the Hurricane Harvey backlash, his $10 million mansion, and the controversies that have divided millions.\n\nThis isn’t just another profile — it’s the complete story of one of the most polarizing figures in religion today. Love him or hate him, Joel Osteen changed the face of American faith forever.\n\n⏱️ Chapters:\n0:00 Intro — Who is Joel Osteen?\n3:21 The Rise of Lakewood Church\n10:45 Prosperity Gospel Explained\n18:07 The Hurricane Harvey Controversy\n25:30 Money, PPP Loans, and Public Backlash\n33:05 The Legacy of Joel Osteen\n41:00 Final Thoughts\n\n👉 Like, Comment, and Subscribe for more longform documentaries and deep dives.\n🔔 Turn on notifications to never miss an upload!\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-05-07T13:00:54Z",
      "duration": "00:54:30",
      "explicit": false,
      "youTubeId": "VC-V2C7EehU",
      "subjects": [
        "Joel Osteen"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VC-V2C7EehU"
      }
    },
    {
      "id": "7d6ce24f-f496-4c9a-a501-f6039072e687",
      "title": "Russell Brand EXPOSED: THE DEEP DIVE into ALL THE ALLEGATIONS",
      "description": "Russell Brand has always been known for having an abrasive style and sense of humor...but what\u0027s hidden behind his conspiracy ramblings and quasi intellectual rants is enough to make even the most loyal fan turn their back on him.  In today\u0027s episode, we unpack the man, the comedian, the theorist and determine if he is really telling the truth-or is he just another privileged man trying to hid behind deflection?  Sit back, relax and take a deep breath, it\u0027s time to Let the Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-04-20T13:00:40Z",
      "duration": "01:45:01",
      "explicit": false,
      "youTubeId": "NwvDw0_4RRk",
      "subjects": [
        "Spiritual Narcissist"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NwvDw0_4RRk"
      }
    },
    {
      "id": "136bf145-11ab-4e41-a361-f9970cfc0525",
      "title": "Inside the Zizian Cult: The Radical Vegan Anarchists Who Turned Deadly THE DEEP DIVE",
      "description": "They believed they were saving the world from a rogue AI.\nThey lived off-grid, wore black robes, and spoke in code.\nThen the bodies started showing up.\n\nThis is the true story of The Zizians — a group of brilliant, disillusioned young idealists whose utopian dreams spiraled into chaos, violence, and death. From Bay Area tech circles to a nationwide manhunt, this investigative deep dive uncovers how a fringe philosophy became a full-blown cult.\n\n📍 Set in the heart of California counterculture.\n💀 Includes real events, real people, and real consequences.\n\nWatch now — and decide for yourself where the line between activism and extremism is drawn.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-04-18T13:01:15Z",
      "duration": "01:22:46",
      "explicit": false,
      "youTubeId": "djQySQSG6eg",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=djQySQSG6eg"
      }
    },
    {
      "id": "4ebbc713-56fc-4db7-a9a7-9f1279e4dba5",
      "title": "Inside Australia’s Most Controversial Spiritual Cult: The Rise and Fall of Universal Medicine",
      "description": "What started as energy healing turned into one of the most shocking spiritual movements in Australia’s history.\n\nIn this gripping documentary, we trace the life of Serge Benhayon—former tennis coach turned self-proclaimed \u0022World Teacher\u0022—and the explosive rise of Universal Medicine, a group once hailed as a path to enlightenment and now widely condemned as a harmful cult.\n\nFrom esoteric breast massage to million-dollar bequests, discover how one man captivated thousands with promises of spiritual purity… and the devastating consequences that followed.\n\n🔍 Featuring:\n\nSurvivor testimonies\n\nThe bizarre beliefs of “pranic” vs. “fiery” energy\n\nLegal battles and court revelations\n\nThe chilling influence of Alice A. Bailey\n\nWhat’s happening with Universal Medicine today\n\n👇 Watch until the end to see how it all unraveled — and why it matters now more than ever.\n\n#UniversalMedicine #SergeBenhayon #CultDocumentary #SpiritualScams #AustraliaExposed\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-04-09T13:00:44Z",
      "duration": "01:07:04",
      "explicit": false,
      "youTubeId": "T2mL580_6bs",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T2mL580_6bs"
      }
    },
    {
      "id": "e36d346d-3267-432d-845a-0f194ec5e8fb",
      "title": "Jack Parsons: Cult Leader or Creepy Dude? The Occult Rocket Scientist Who Danced with the Devil",
      "description": "Dive deep into the enigmatic life of Jack Parsons, a pioneering rocket scientist whose groundbreaking work laid the foundation for modern space exploration. Beyond his scientific achievements, Parsons led a double life as a devoted follower of Thelema, engaging in esoteric rituals under the guidance of Aleister Crowley. This investigative documentary uncovers Parsons\u0027 complex relationships, including his tumultuous association with L. Ron Hubbard, the future founder of Scientology. Explore the fusion of science and the occult in Parsons\u0027 life, and how his unconventional pursuits influenced both his meteoric rise and tragic demise.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-03-26T16:00:41Z",
      "duration": "00:47:04",
      "explicit": false,
      "youTubeId": "_IXYUncFruA",
      "subjects": [
        "Scientology",
        "Ordo Templi Orientis"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_IXYUncFruA"
      }
    },
    {
      "id": "a3dda655-3732-4698-8ec3-a4d5f6a79941",
      "title": "Inside the Secret Cult of Fine Wine \u0026 Power: The Dark Truth About the Fellowship of Friends",
      "description": "For over 50 years, the Fellowship of Friends has hidden behind a façade of art, culture, and fine wine—while its members lived under strict control, financial exploitation, and disturbing abuse. Led by self-proclaimed prophet Robert Earl Burton, this secretive cult promised enlightenment but delivered a nightmare of manipulation, broken lives, and shocking scandals.\n\nFrom bizarre rules (banning humor and eyeglasses) to doomsday prophecies that never came true, this deep dive exposes how the Fellowship thrived in secrecy—until ex-members started speaking out. Even Google was caught up in the group’s influence! Now, as new lawsuits and survivor testimonies emerge, the cult is facing its biggest reckoning yet.\n\n🔴 What really happened inside this elite, mind-controlling cult?\n🔴 How did it infiltrate major institutions like Google?\n🔴 Will the truth finally bring the Fellowship down?\n\nWatch until the end for chilling survivor stories and the latest updates on this still-active cult. Don’t forget to like, comment, and subscribe for more deep-dive investigations!\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-03-15T13:00:06Z",
      "duration": "01:02:13",
      "explicit": false,
      "youTubeId": "46f0svegVNk",
      "subjects": [
        "Fellowship Of Friends"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=46f0svegVNk"
      }
    },
    {
      "id": "c51de728-b1ad-42f8-a8e8-636de748b458",
      "title": "The Delphi Murders: Dark Secrets, Cult Ritual Theories \u0026 the Chilling Case That Shocked America",
      "description": "In 2017, two teenage girls, Liberty German and Abigail Williams, were brutally murdered while hiking near the Monon High Bridge in Delphi, Indiana. Their final moments were captured on Libby’s phone—an eerie video of an unknown man uttering the chilling phrase: \u0022Guys… down the hill.\u0022 For years, the case remained a mystery, until an arrest in 2022 finally brought new revelations. But was Richard Allen truly the killer, or is there a darker, more sinister truth hidden beneath the surface?\n\nIn this gripping deep dive, we uncover the shocking twists, disturbing crime scene details, and explosive Odinist cult theory that turned this case upside down. Was this a ritualistic sacrifice carried out by a secretive group? Did investigators overlook crucial evidence in their pursuit of justice? And what does law enforcement say about the claims of pagan symbols, staged crime scenes, and white supremacist Odinist ties?\n\nJoin us as we explore the facts, theories, and unanswered questions behind one of the most haunting true crime cases in modern history.\n\n🔔 Subscribe for more true crime deep dives!\n👍 Like \u0026 Share if you want justice for Abby and Libby.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own research.  Viewer discretion is advised.",
      "release": "2025-03-12T13:15:02Z",
      "duration": "01:15:21",
      "explicit": false,
      "youTubeId": "ER1RR4tJCDQ",
      "subjects": [
        "Richard Allen"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ER1RR4tJCDQ"
      }
    },
    {
      "id": "110a15ed-d96a-45ec-bdc4-e97bdac68dfa",
      "title": "TWIN FLAMES UNIVERSE DOWNFALL: LIVE REACTION PART 2!!!!",
      "description": "Jeff and Shaleia seem to still be scared of the cult allegations…and we are here to…..basically try to prove those allegations right!  Is this the beginning of the end of Twin Flames Universe Cult?!  Let’s watch together!",
      "release": "2025-03-09T17:28:31Z",
      "duration": "00:55:08",
      "explicit": false,
      "youTubeId": "VCLBw4h_Tmg",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VCLBw4h_Tmg"
      }
    },
    {
      "id": "9b409169-377e-4ce0-95eb-9f1b7ad8353c",
      "title": "The Chilling Story of the Yahweh Cult of Nebraska | The Tragedy of the Rulo Compound",
      "description": "In the 1980s, a small farming town in Nebraska became the setting for one of the most disturbing cases of religious extremism in American history. Led by self-proclaimed prophet Michael Wayne Ryan, the Yahweh Cult turned into a brutal and controlling regime, culminating in ritualistic torture, murder, and a deadly police raid.\n\nThis deep-dive explores the tragic fate of James Thimm and five-year-old Luke Stice, the manipulation that kept followers trapped, and the harrowing escape that led to the cult’s downfall. Through survivor accounts and historical evidence, we uncover the horrors of blind obedience, radical ideology, and unchecked power.\n\n⚠️ Warning: This video contains graphic descriptions of violence and a*use. Viewer discretion is advised.\n\n📌 Chapters:\n00:00 - Intro\n02:15 - How the Cult Began\n08:30 - The Tragic Fate of James Thimm\n15:45 - The Heartbreaking Death of Luke Stice\n21:20 - The Cult’s Beliefs \u0026 Control Tactics\n28:10 - Rick Stice’s Escape \u0026 Police Involvement\n35:00 - The Raid That Ended It All\n42:25 - The Trial \u0026 Aftermath\n48:00 - Lessons from Rulo\n\n🔔 Subscribe for more true crime stories and hit the notification bell so you never miss an episode!\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-03-05T14:00:35Z",
      "duration": "00:38:42",
      "explicit": false,
      "youTubeId": "MnF45H9ZSFw",
      "subjects": [
        "Michael W. Ryan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MnF45H9ZSFw"
      }
    },
    {
      "id": "06cf9a30-60cb-4f2c-b9c7-5040e422f8f5",
      "title": "TWIN FLAMES UNIVERSE FOLLOWERS DESPERATE TO DEFEND JEFF AND SHALEIA",
      "release": "2025-03-01T17:02:44Z",
      "duration": "01:03:20",
      "explicit": false,
      "youTubeId": "lIjGvnzLzVo",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lIjGvnzLzVo"
      }
    },
    {
      "id": "b27e6a4a-bcaf-4ef8-a696-ebe92e38e11d",
      "title": "Belle Gibson EXPOSED: The Fake Cancer Scam That Shocked the World",
      "description": "Belle Gibson built an empire on a lie. She claimed to have cured her terminal brain cancer through clean eating and holistic wellness—only for the shocking truth to unravel. With an app endorsed by Apple, a bestselling book, and thousands of devoted followers, she became a beacon of hope for cancer patients worldwide. But when investigative journalists uncovered the truth, everything came crashing down.\n\nIn this deep dive, we expose the full story of Belle Gibson’s rise and fall, her fraudulent claims, the heartbreaking impact on real cancer patients, and where she is now after facing legal consequences.\n\n🔔 Subscribe for more true crime stories and hit the notification bell so you never miss an episode!\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-02-26T14:00:11Z",
      "duration": "00:40:32",
      "explicit": false,
      "youTubeId": "BERUDUMuwWc",
      "subjects": [
        "Belle Gibson"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BERUDUMuwWc"
      }
    },
    {
      "id": "8a0d62ef-acb1-4a12-80ea-21135ec4278f",
      "title": "The Fall River Cult: A Satanic Reign of Terror",
      "description": "In the late 1970s, Fall River, Massachusetts, became the epicenter of one of the most chilling true crime cases in American history. A brutal cult, led by the self-proclaimed “Son of Satan” Carl Drew, ruled the city’s underworld through fear, manipulation, and ritualistic murder. Victims were sacrificed in gruesome Satanic rituals, and those who dared to leave paid the ultimate price.\n\nThis in-depth video uncovers the dark origins of Carl Drew, the horrifying details of the cult’s practices, and the relentless investigation that brought them down. Featuring expert analysis and firsthand accounts, we unravel the terror that gripped Fall River and the lingering questions that remain to this day.\n\n🔔 Subscribe for more true crime stories and hit the notification bell so you never miss an episode!\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-02-19T14:01:05Z",
      "duration": "00:36:01",
      "explicit": false,
      "youTubeId": "sRLst8qCCCo",
      "subjects": [
        "The Fall River Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sRLst8qCCCo"
      }
    },
    {
      "id": "c523e920-207c-4952-802d-29aaa36ebecc",
      "title": "The Dark Truth Behind OneTaste: The Wellness Cult That Went Too Far",
      "description": "OneTaste promised transformation, intimacy, and empowerment—but behind the scenes, it became something far more sinister. What started as a revolutionary wellness movement spiraled into allegations of manipulation, coercion, and financial exploitation. With its charismatic leader, Nicole Daedone, at the helm, OneTaste drew in thousands, only to leave many emotionally and financially broken.\n\nIn this deep dive, we uncover the rise and fall of OneTaste, the shocking 2018 Bloomberg exposé, the FBI investigation, and the voices of survivors who risked everything to speak out. With Daedone now facing federal charges, what does this mean for the future of OneTaste and the self-help industry?\n\n🔔 Subscribe for more true crime and investigative deep dives.\n📢 Share your thoughts in the comments below—were you aware of OneTaste before this?\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-02-08T14:00:34Z",
      "duration": "00:56:32",
      "explicit": false,
      "youTubeId": "U6doijuhjco",
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=U6doijuhjco"
      }
    },
    {
      "id": "80d31955-195b-4b7d-bfe4-3c2d22941d61",
      "title": "Escaping Scientology’s Sea Org Cult: The Untold Stories of Pain, Control, and Survival",
      "description": "What really happens inside Scientology’s elite Sea Organization? Former members reveal the shocking truth about life in the Sea Org—where billion-year contracts, grueling labor, and intense psychological control are the norm. In this deep dive, we expose the harsh realities of daily life, the feared Rehabilitation Project Force (RPF), and the extreme lengths members must go to in order to escape.\n\nHear firsthand accounts from survivors like Marc Headley and Valerie Haney, who risked everything to break free. How does Scientology keep its members trapped? What happens when someone tries to leave? And how do they rebuild their lives after years of indoctrination?\n\n🔴 Watch now to uncover the hidden world of Scientology’s most secretive organization.\n\n👉 Subscribe for more untold stories and deep dives into the world’s most controversial organizations.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-02-05T14:00:55Z",
      "duration": "00:34:41",
      "explicit": false,
      "youTubeId": "qQvp4pEMixk",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qQvp4pEMixk"
      }
    },
    {
      "id": "7160070b-4c12-4440-8d67-eefb63b266fe",
      "title": "Inside Scientology: Secrets, Scandals, and Escape Stories",
      "description": "What’s the truth behind Scientology? In this deep dive, we unravel its origins, controversial beliefs, and explosive scandals. From L. Ron Hubbard’s rise as a pulp fiction writer to David Miscavige’s controversial leadership, discover the shocking practices that have divided families and sparked global debate.\n\nHear from defectors like Mike Rinder, Leah Remini, and others who risked everything to escape—and learn about the mysterious disappearance of Shelly Miscavige. Plus, the secrets of the infamous E-Meter, the chilling OT III Xenu story, and why Scientology owns empty properties worldwide.\n\nThis isn’t just a story about a church—it’s a story about control, power, and resilience. Whether you’re curious or critical, you won’t want to miss this gripping exposé.\n\n👉 Subscribe for more untold stories and deep dives into the world’s most controversial organizations.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-01-25T14:00:48Z",
      "duration": "01:07:48",
      "explicit": false,
      "youTubeId": "fAERBBam3gg",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fAERBBam3gg"
      }
    },
    {
      "id": "0e8b5dd0-bb32-4e81-b770-dd1c18833741",
      "title": "The Cult That Killed for \u0027God\u0027: The Shocking Story of the Lamb of God Cult",
      "description": "What happens when faith becomes a weapon of fear? The Lamb of God cult, led by the ruthless Ervil LeBaron, left a trail of terror, manipulation, and violence that spanned decades. From orchestrating murders in the name of “divine justice” to forcing loyalty through fear and bloodshed, this cult stands as one of history’s most chilling examples of religious extremism gone wrong.\n\nIn this deep dive, we uncover the dark truth behind the Lamb of God cult: Ervil’s rise to power, the psychological tactics he used to control his followers, and the heartbreaking stories of those who escaped his grip. How could one man turn devotion into destruction—and what lessons can we learn from this harrowing tale?\n\nWatch now as we unravel the shocking truth about the Lamb of God cult, and don’t forget to share your thoughts in the comments.\n\nTrigger warning: This video discusses violence, ab*se, and religious extremism.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-01-18T14:00:13Z",
      "duration": "00:39:53",
      "explicit": false,
      "youTubeId": "8MCagHkTUp0",
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8MCagHkTUp0"
      }
    },
    {
      "id": "ca67dcf1-b11b-4e9a-ba2c-d5dd132dcdf6",
      "title": "Inside the Most Twisted Cult You’ve Never Heard Of: Ant Hill Kids Cult",
      "description": "Step into the terrifying world of the Ant Hill Kids, a remote cult led by the sadistic Roch Thériault. Discover how a self-proclaimed prophet manipulated his followers into enduring unimaginable abuse, bizarre punishments, and grueling labor in the name of salvation. This shocking deep dive reveals the cult’s horrifying daily life, the psychological tactics that kept members trapped, and the brave survivors who exposed the truth. Don’t miss this harrowing tale of power, control, and resilience. Sit back, relax and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-01-15T14:00:57Z",
      "duration": "00:37:57",
      "explicit": false,
      "youTubeId": "mPyQz3eFcdk",
      "subjects": [
        "Ant Hill Kids"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mPyQz3eFcdk"
      }
    },
    {
      "id": "9aa679b6-55a5-4dbb-8374-a36565f656ad",
      "title": "Faith, Manipulation, and Murder: The Chilling Take of the Kirtland Cult and it\u0027s murderous leader",
      "description": "How did a quiet Ohio town become the site of one of the most horrifying cult murders in history? This is the chilling true story of Jeffrey Lundgren and the Kirtland Cult—a group drawn together by faith but torn apart by manipulation, fanaticism, and murder. Discover how a self-proclaimed prophet turned scripture into a deadly weapon, leading his followers to commit an unthinkable crime. From the cult’s twisted beliefs to the shocking aftermath, this is a story you won’t believe could be real....it\u0027s time to Let The Fresh Erin.\n\nViewer discretion advised.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2025-01-11T14:01:03Z",
      "duration": "00:38:19",
      "explicit": false,
      "youTubeId": "xvo85YTE-yc",
      "subjects": [
        "Jeffrey Lundgren"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xvo85YTE-yc"
      }
    },
    {
      "id": "7114821e-17cf-4a85-b3b5-aa2921819ae0",
      "title": "The Cult Leader Who Assassinated Santa: The Bizarre Tale of Paul Schaefer",
      "description": "Paul Schaefer was no ordinary cult leader. His twisted beliefs led him to turn a symbol of joy and innocence—Santa Claus—into the embodiment of evil. In this chilling true story, we unravel the strange journey of Schaefer’s life, from his troubled childhood in post-war Germany to the creation of the Fellowship of the New Purity, and the horrifying events that led to the assassination of Santa Claus at a Christmas festival in Munich.\n\nThis bizarre and haunting chapter in history reveals the dangers of unchecked fanaticism and the power of manipulation. How did Schaefer convince his followers that Santa was a demon in disguise? And what happened to the cult after their shocking act?\n\nJoin us as we dive into one of the most surreal stories you\u0027ve ever heard—part tragedy, part cautionary tale, and completely unforgettable.\n\n🕊️ Trigger Warning: This video contains discussions of cult behavior, violence, and manipulation.\n\n💬 Share your thoughts in the comments below!\n🔔 Don’t forget to LIKE, SUBSCRIBE, and hit the bell for more strange and fascinating stories.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-12-28T14:00:26Z",
      "duration": "00:35:06",
      "explicit": false,
      "youTubeId": "WvbGYFELeQM",
      "subjects": [
        "Colonia Dignidad"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WvbGYFELeQM"
      }
    },
    {
      "id": "4fa51de7-e6c1-4aec-b521-ca60d4196e9c",
      "title": "Shen Yun \u0026 Falun Gong: The Controversial Truth Behind the Performances, the Cult and Communist China",
      "description": "Discover the fascinating and controversial world of Shen Yun Performing Arts and its ties to Falun Gong. This deep dive explores the organization’s mission to revive traditional Chinese culture, the spiritual roots of Falun Gong, and the troubling allegations of forced labor, exploitation, and organ harvesting. Hear both the positive and negative accounts of former performers and uncover the complexities of life within Shen Yun.\n\nLearn about:\n\nThe origins of Shen Yun and its spiritual foundation in Falun Gong.\nAllegations of forced organ harvesting in China and its international implications.\nThe restrictive and demanding conditions faced by performers.\nHow Shen Yun uses its platform to spotlight human rights abuses and Falun Gong persecution.\nJoin us as we navigate the intersection of art, spirituality, and political controversy that defines Shen Yun.\n\nAMAZON WISHLIST: \nhttps://www.amazon.com/registries/gl/guest-view/15ZDIE0RWYLV5\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-12-21T14:00:12Z",
      "duration": "00:49:34",
      "explicit": false,
      "youTubeId": "98s_RNlIEqI",
      "subjects": [
        "Falun Gong"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=98s_RNlIEqI"
      }
    },
    {
      "id": "02a3d141-7f88-4589-b07b-f7976ad61fb6",
      "title": "Spend the Night at Jonestown?!  The Deranged Jim Jones Cult and Exploitative Price Tag to Visit",
      "description": "Discover the shocking story of Jonestown, the remote Guyanese settlement where over 900 followers of Jim Jones met a tragic end in 1978. Explore how a charismatic preacher turned a vision of utopia into a nightmare of control, paranoia, and mass tragedy. From Jim Jones\u0027s early rise to his transformation into a dangerous cult leader, this video dives into the chilling details of life in Jonestown, the fatal visit by Congressman Leo Ryan, and the horrifying events that unfolded on November 18, 1978.\n\nWe also examine Jonestown\u0027s legacy and its transformation into a potential tourist destination, sparking debates about its significance and remembrance. This is a cautionary tale about the dangers of blind loyalty and the fragility of trust in charismatic leaders.\n\nAMAZON WISHLIST: \nhttps://www.amazon.com/hz/wishlist/ls/3PFUAU0V2903Z?ref_=wl_share\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-12-18T14:00:16Z",
      "duration": "00:49:02",
      "explicit": false,
      "youTubeId": "7SYKbuT0auk",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7SYKbuT0auk"
      }
    },
    {
      "id": "780a79d1-9245-47a8-9bcf-3109b9ec12ca",
      "title": "Jehovah\u0027s Witnesses EXPOSED: Secrets, Control, and Escaping the CULT",
      "description": "What really happens behind the closed doors of Jehovah\u0027s Witnesses? Beneath the polished image of unity and faith lies a world of strict control, emotional manipulation, and devastating shunning practices. This deep dive uncovers their controversial handling of child abuse allegations, failed prophecies, and the chilling consequences for those who dare to leave. Hear harrowing accounts from ex-members as they reveal the trauma of escaping the organization and rebuilding their lives. Prepare to uncover the truth about one of the most secretive and polarizing religious groups in the world. Don’t miss this eye-opening exposé.\n\nAMAZON WISHLIST: \nhttps://www.amazon.com/hz/wishlist/ls/5M119VP9CG4R?ref_=wl_share\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-12-14T14:00:30Z",
      "duration": "00:58:39",
      "explicit": false,
      "youTubeId": "cTDjmrCb3rg",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cTDjmrCb3rg"
      }
    },
    {
      "id": "277d1bef-b1fa-491e-b354-982e3ea7dca1",
      "title": "TwinRay Exposed: The Shocking Truth About This Controversial Spiritual Community (AKA CULT)",
      "description": "From promises of enlightenment and a \u0022Golden Age\u0022 to allegations of financial exploitation and psychedelic misuse, TwinRay\u0027s story is as captivating as it is controversial. Led by Akasha Sananda and Shekinah Ma, this spiritual group rose to prominence with their lavish retreats, high-end products, and teachings. But what really happened behind the scenes? Dive into the rise, fall, and ongoing controversies of TwinRay, including the closure of their Ashland storefront and claims of cult-like practices.\n\nAMAZON WISHLIST: \nhttps://www.amazon.com/hz/wishlist/dl/invite/d9Ejeob?ref_=wl_share\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-12-11T14:00:09Z",
      "duration": "00:58:25",
      "explicit": false,
      "youTubeId": "AkPvFSbVyD4",
      "subjects": [
        "TwinRay"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AkPvFSbVyD4"
      }
    },
    {
      "id": "0cf56cbd-5078-45cf-b257-550de0eec0a6",
      "title": "Abraham Hicks: Inspiration or Cult Exploiting the Vulnerable? The Law of Attraction Examined",
      "description": "Abraham Hicks and the Law of Attraction promise personal empowerment and the ability to manifest your desires, but is there more to the story? In this video, we explore the transformative teachings of Abraham, channeled by Esther Hicks, alongside criticisms of their \u0027infinite intelligence\u0027 philosophy. Are these ideas a path to joy and abundance, or do they veer into cult-like territory? Dive into the core concepts, the controversies, and the impact of this global phenomenon.\n\nAMAZON WISHLIST: https://www.amazon.com/hz/wishlist/ls/27J60XCRES4DE?ref=cm_sw_em_r_un_un_uGa0hxaQjoUI8\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-12-07T14:01:02Z",
      "duration": "00:44:45",
      "explicit": false,
      "youTubeId": "yABIZb-MLiU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yABIZb-MLiU"
      }
    },
    {
      "id": "5071c461-a1f8-489c-b6e0-8f5f326f7ab4",
      "title": "The Cult That Believed Death Was Salvation: The Chilling Story of the Solar Temple Cult",
      "description": "Discover the chilling story of the Order of the Solar Temple, a secretive cult that culminated in a series of horrifying mass murder-suicides in 1994. Led by Joseph Di Mambro and Luc Jouret, the group combined apocalyptic beliefs, strict rituals, and psychological manipulation to control its members. Convinced they were destined to ascend to the star Sirius, over 50 followers tragically lost their lives in coordinated events across Switzerland and Canada. This video explores the cult’s origins, practices, and the devastating consequences of its leaders’ paranoia and delusions. A haunting tale of control, belief, and betrayal.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-12-04T14:00:35Z",
      "duration": "00:52:52",
      "explicit": false,
      "youTubeId": "W9WPVdRaGn4",
      "subjects": [
        "Order of the Solar Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=W9WPVdRaGn4"
      }
    },
    {
      "id": "b51382c3-cd82-4296-90fc-00fb1b55b2b6",
      "title": "WE ARE NOT A CULT!  Twin Flames Universe Cult Followers Finally Speak Out: Part 2 REACTION",
      "description": "WELCOME TO PART 2!  Twin Flames Universe Cult Leaders have tried to flip the switch on us.  In a classic showcase of the typical things cult leaders and their followers do, TFU followers took to Youtube to \u0022Share their side\u0022 of the story and prove to us all that they aren\u0027t a cult.....a year later....after they had multiple opportunities to share \u0022their side\u0022.  So today we are reacting to their video, and breaking down all the tactics.  Sit back, relax and take a deep breath, it\u0027s time to Let The Fresh Erin!\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-11-30T14:00:04Z",
      "duration": "01:14:06",
      "explicit": false,
      "youTubeId": "6UVUgzuScJk",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6UVUgzuScJk"
      }
    },
    {
      "id": "4044e281-2f56-42fa-a0a8-4ba63bee5574",
      "title": "Twin Flames Universe Cult Leaders FINALLY Prove They Aren\u0027t a Cult...? Part One REACTION",
      "description": "Twin Flames Universe Cult Leaders have tried to fliip the switch on us.  In a classic showcase of the typical things cult leaders and their followers do, TFU followers took to Youtube to \u0022Share their side\u0022 of the story and prove to us all that they aren\u0027t a cult.....a year later....after they had multiple opportunities to share \u0022their side\u0022.  So today we are reacting to their video, and breaking down all the tactics.  Sit back, relax and take a deep breath, it\u0027s time to Let The Fresh Erin!\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-11-27T14:00:36Z",
      "duration": "00:52:22",
      "explicit": false,
      "youTubeId": "YwkVJecx4DQ",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YwkVJecx4DQ"
      }
    },
    {
      "id": "f82c64cc-7aad-478b-9542-f257a773613a",
      "title": "Self Help or Harm?  The Truth about Landmark Worldwide EXPOSED",
      "description": "What really happens inside the Landmark Forum? Is it the ultimate self-help breakthrough, or does it push people too far? In this video, we uncover the controversial teachings of Landmark Worldwide, exploring its emphasis on personal responsibility, intense group dynamics, and the emotional risks faced by participants.  \n\nFrom stories of personal transformation to allegations of psychological harm, we dive deep into the fine line Landmark walks between empowerment and exploitation. Whether you’re considering attending or just curious about its cult-like reputation, this is everything you need to know.  \n\n➡️ **Timestamps:**  \n00:00 – Introduction  \n02:45 – Landmark’s Philosophy Explained  \n08:30 – Participant Stories: Breakthroughs and Breakdowns  \n15:00 – The Dangers of High-Pressure Dynamics  \n22:00 – Expert Opinions on Landmark\u0027s Risks  \n28:15 – Conclusion: Is Landmark Worth It?  \n\n💬 Have you or someone you know attended Landmark? Share your experiences in the comments below!  \n\n🔔 Don’t forget to like, subscribe, and hit the bell for more deep dives into self-help programs and personal development trends.  \n\n#LandmarkForum #SelfHelp #Controversies #PersonalDevelopment #Viral\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.\n\nCheck out my Patreon! https://www.patreon.com/c/letthefresherin/membership",
      "release": "2024-11-20T14:00:36Z",
      "duration": "00:53:34",
      "explicit": false,
      "youTubeId": "Y-_XFObcKlg",
      "subjects": [
        "Landmark",
        "Large Group Awareness Trainings"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Y-_XFObcKlg"
      }
    },
    {
      "id": "7c1f22fc-45fe-4195-9ea5-e419635b75bb",
      "title": "The School of Prophets: How Radical Faith Caused The Tragic Murder of a Mother and Child",
      "description": "Dive deep into the chilling story of the School of Prophets, a radical religious sect led by self-proclaimed prophet Robert Crossfield. Discover how its teachings on personal revelation, polygamy, and divine authority inspired Ron and Dan Lafferty to commit unthinkable acts in the name of faith. From the sect\u0027s origins to the infamous Lafferty murders, this video uncovers the dangerous power of unchecked belief and religious extremism.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.\n\nCheck out my Patreon! https://www.patreon.com/c/letthefresherin/membership",
      "release": "2024-11-16T16:00:53Z",
      "duration": "00:54:58",
      "explicit": false,
      "youTubeId": "ysss9ZAKB5k",
      "subjects": [
        "School Of Prophets"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ysss9ZAKB5k"
      }
    },
    {
      "id": "12a8df22-8906-4490-bad7-4325e010688a",
      "title": "The Hidden World of the 12 Tribes: Control, Escape, and Survival",
      "description": "In this video, we dive into the secretive and controversial world of the 12 Tribes—a religious cult known for its strict control over followers, intense discipline, and isolated lifestyle. Founded by Eugene Spriggs in the 1970s, the 12 Tribes created a system where obedience was paramount, from daily routines to deeply personal choices, leaving members with little freedom or independence. Children faced harsh discipline and rigid upbringing, while adults endured intense oversight, limited expression, and rigid gender roles.\n\nThe 12 Tribes used businesses like the Yellow Deli as recruitment tools and means of control, with members working long, unpaid hours, cut off from mainstream society. For those who escaped, the journey was far from easy. Leaving often meant abandoning everything, from family and finances to the only world they’d ever known. Former members describe the overwhelming challenges of reintegrating into society, rebuilding their identities, and coping with deep-seated psychological scars. This video tells the story of those who managed to break free and offers insight into the ongoing impact of life within the 12 Tribes.  Sit back and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nCHAPTERS: \n0:00 - Intro  \n5:00 - Origins and Promises of the 12 Tribes  \n15:00 - Strict Rules and Lifestyle Control  \n25:00 - The Yellow Deli and Unpaid Labor  \n35:00 - The Struggles of Leaving and Rebuilding\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-11-08T14:00:18Z",
      "duration": "00:40:14",
      "explicit": false,
      "youTubeId": "JTgEwvOfzao",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JTgEwvOfzao"
      }
    },
    {
      "id": "03a7d259-1f71-4fd7-8c0a-405c2de39bbe",
      "title": "Heaven’s Gate: The Rise, Beliefs, and Tragic End of a UFO Cult",
      "description": "In this in-depth documentary, we explore the story of Heaven’s Gate, the infamous cult that captured the world’s attention in 1997 when 39 of its members were found dead in a mass suicide in Rancho Santa Fe, California. Led by Marshall Applewhite and Bonnie Nettles—known as “Do” and “Ti”—Heaven’s Gate was founded on a unique blend of Christian eschatology, New Age mysticism, and science fiction. Applewhite and Nettles preached that they were divine guides sent to help their followers ascend to the “Next Level,” an extraterrestrial realm beyond Earth. \n\nJoin us as we uncover how the group’s strict lifestyle, rules, and evolving doctrines drew in followers seeking enlightenment and belonging. We’ll dive into the journey from the initial recruitment tours of the 1970s to the events leading up to the group’s tragic “final exit” in 1997, when they believed a spacecraft behind the Hale-Bopp comet would transport their souls to salvation.\n\nDiscover what led so many intelligent individuals to abandon their former lives, cut ties with family, and surrender to the teachings of Applewhite. Through their farewell videos and the symbolic rituals of their last moments, we’ll explore the powerful influence of belief and the dangers of charismatic leadership.\n\nSit back and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.",
      "release": "2024-11-05T14:00:46Z",
      "duration": "01:00:48",
      "explicit": false,
      "youTubeId": "i0k3WaPk9BM",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=i0k3WaPk9BM"
      }
    },
    {
      "id": "8c95238b-17ad-4c69-9026-962bd6a85afd",
      "title": "A DEATH CULT?  How Paul Mackenzie’s Cult Led to a Mass Starvation Tragedy: The Untold Story",
      "description": "Imagine a leader so charismatic, he convinces hundreds of people to starve themselves to death in the name of salvation. This is the terrifying story of Paul Mackenzie, the man behind the Good News International Church—a deadly cult that shocked the world. In this video, we unravel Mackenzie’s rise to power, his controversial teachings, and the devastating aftermath of his \u0027Mass Starvation Doctrine,\u0027 where hundreds, including women and children, perished in a remote Kenyan forest. We’ll also explore the ongoing trial and the survivors’ heartbreaking stories. How did this happen, and what can be done to stop it from happening again? Watch now to uncover the full, chilling tale.  Sit back and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.\n\nWe’ll also take a close look at the claims of immunity boosting, increased energy, stress reduction, and even mental clarity. But are these benefits scientifically backed? Could there be hidden risks with cold exposure and breathwork?\n\nI share my own experience with the Wim Hof Method and breathwork, having practiced it for years, along with insights into cult-like behavior around extreme wellness practices. We’ll discuss real-life dangers like shallow water blackout and legal challenges that are now putting Wim Hof under scrutiny.\n\nJoin me as we uncover whether the Wim Hof Method is a true breakthrough in health or a risky wellness trend.\n\nTimestamps:\n\n00:00 – Who is Wim Hof?\n02:00 – The Wim Hof Method Explained\n10:00 – Health Benefits and Claims\n20:00 – The Dark Side: Lawsuits, Dangers, and Cult-Like Followings\n40:00 – Is It Worth Trying?\n\nIf you enjoy content about wellness, cults, and true crime, hit that subscribe button and turn on notifications for more!\n\n#WimHofMethod #ColdTherapy #Breathwork #MentalHealth #WellnessJourney #ColdExposure #BreathworkBenefits #CultLikeFollowings #WellnessRisks #ImmuneBoosting #StressRelief #TrueCrime #LetTheFreshErin",
      "release": "2024-10-18T13:01:02Z",
      "duration": "00:36:47",
      "explicit": false,
      "youTubeId": "mJh97sBlcdg",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mJh97sBlcdg"
      }
    },
    {
      "id": "1adbbbe6-f63c-4247-b0e4-bd623bb6c4e2",
      "title": "The Wim Hof Method: Miracle Cure or Dangerous Scam?",
      "description": "Are you curious about the Wim Hof Method and its supposed benefits for your health? Wim Hof, also known as The Ice Man, claims his combination of breathwork, cold therapy, and mental focus can improve physical and mental well-being. But is it all it’s cracked up to be? In this video, we dive deep into the science and controversies surrounding Wim Hof’s practices. From world records to tragic accidents, we explore both the benefits and the dangers of this method.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group, person, entity or organization.  Erin presents many opinions, so please do your own opinions.  Viewer discretion is advised.\n\nWe’ll also take a close look at the claims of immunity boosting, increased energy, stress reduction, and even mental clarity. But are these benefits scientifically backed? Could there be hidden risks with cold exposure and breathwork?\n\nI share my own experience with the Wim Hof Method and breathwork, having practiced it for years, along with insights into cult-like behavior around extreme wellness practices. We’ll discuss real-life dangers like shallow water blackout and legal challenges that are now putting Wim Hof under scrutiny.\n\nJoin me as we uncover whether the Wim Hof Method is a true breakthrough in health or a risky wellness trend.\n\nTimestamps:\n\n00:00 – Who is Wim Hof?\n02:00 – The Wim Hof Method Explained\n10:00 – Health Benefits and Claims\n20:00 – The Dark Side: Lawsuits, Dangers, and Cult-Like Followings\n40:00 – Is It Worth Trying?\n\nIf you enjoy content about wellness, cults, and true crime, hit that subscribe button and turn on notifications for more!\n\n#WimHofMethod #ColdTherapy #Breathwork #MentalHealth #WellnessJourney #ColdExposure #BreathworkBenefits #CultLikeFollowings #WellnessRisks #ImmuneBoosting #StressRelief #TrueCrime #LetTheFreshErin",
      "release": "2024-10-11T13:00:20Z",
      "duration": "00:47:46",
      "explicit": false,
      "youTubeId": "Er6whEA9njI",
      "subjects": [
        "Wim Hof Method"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Er6whEA9njI"
      }
    },
    {
      "id": "3617da3c-8481-4f69-ba7d-b10eab28d74c",
      "title": "The Deadly Sweat Lodge: James Arthur Ray\u0027s Spiritual Retreat Tragedy Exposed",
      "description": "In 2009, self-help guru James Arthur Ray promised enlightenment and spiritual transformation through his high-priced retreats. But his Sedona sweat lodge ceremony turned into a nightmare, leading to the deaths of three people and the injury of many more. In this deep dive, we uncover Ray’s rise to fame, the disturbing details of the sweat lodge tragedy, and the survivors\u0027 chilling accounts. What went wrong that day? How did Ray’s teachings push people to the brink of death? Join us as we explore the legal aftermath, his trial, and the red flags to watch out for when it comes to wellness influencers and spiritual gurus. It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, organization, belief or entity.  Please consider everything said in this video to be the creator\u0027s opinion.  The content featured is protected by fair use.  Please do not reach out to or harass/bully anyone mentioned in this video.\n\nWhether you’re fascinated by cults, true crime, or just curious about the psychology behind these movements, this video is for you. Join us as we debunk their wildest claims and shed light on the hidden dangers of modern-day cults. Perfect for people who are intrigued by the dark side of spirituality and cult dynamics.\n\nMake sure to like, subscribe, and share your thoughts in the comments below. And if you’re a current or former follower, we welcome your insights with respect and compassion. Let’s unravel these manipulative ideologies together!",
      "release": "2024-10-04T13:00:10Z",
      "duration": "00:44:50",
      "explicit": false,
      "youTubeId": "97lXa1B6bIQ",
      "subjects": [
        "James Arthur Ray"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=97lXa1B6bIQ"
      }
    },
    {
      "id": "860015f6-a22b-4975-88d8-4887cfab4564",
      "title": "She Escaped FLDS Cult as a Teenager...AMA With a Survivor",
      "description": "She ran away from the FLDS when she was a teenager and never looked back.  Today, we talk about an AWA on Reddit that an anonymous survivor did and boy do we learn a lot!  I hope you enjoy today\u0027s video!  Sit back, relax and take a deep breath: It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, organization, belief or entity.  Please consider everything said in this video to be the creator\u0027s opinion.  The content featured is protected by fair use.  Please do not reach out to or harass/bully anyone mentioned in this video.\n\nWhether you’re fascinated by cults, true crime, or just curious about the psychology behind these movements, this video is for you. Join us as we debunk their wildest claims and shed light on the hidden dangers of modern-day cults. Perfect for people who are intrigued by the dark side of spirituality and cult dynamics.\n\nMake sure to like, subscribe, and share your thoughts in the comments below. And if you’re a current or former follower, we welcome your insights with respect and compassion. Let’s unravel these manipulative ideologies together!",
      "release": "2024-09-30T13:00:30Z",
      "duration": "00:33:38",
      "explicit": false,
      "youTubeId": "KHGgsSOgRa0",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KHGgsSOgRa0"
      }
    },
    {
      "id": "f2a3518f-9b80-458e-a598-b6e0a07bc109",
      "title": "The Rise and Fall of Diddy: Music Mogul or Master Manipulator? | Deep Dive into the Diddy Scandal",
      "description": "Sean \u0022Diddy\u0022 Combs, once hailed as a hip-hop mogul and cultural icon, is now at the center of a major scandal. Over the years, Diddy has faced numerous allegations—from financial exploitation of artists on his Bad Boy Records label to personal scandals involving abusive relationships. These claims have tarnished his reputation, with former partners and artists speaking out against his actions. In this deep dive, we explore Diddy\u0027s rise to fame, the controversies surrounding his empire, and the potential legacy he leaves behind amid these troubling accusations. What really lies behind the shiny façade of his success?  Well let\u0027s unpack it all today, it\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group or organization.  The creator shares many of her own opinions and speculations.  Viewer discretion is advised.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-09-27T13:00:06Z",
      "duration": "00:55:48",
      "explicit": false,
      "youTubeId": "7-0eJLy1aQY",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7-0eJLy1aQY"
      }
    },
    {
      "id": "2a6f0d6f-56d6-4065-8af6-b0683ea0928f",
      "title": "🔴 Live: Breaking Down the Latest on the Diddy Case | What You Need to Know",
      "description": "Join us live as we dive deep into the latest news surrounding the Diddy case making headlines. We’ll cover key developments, provide in-depth analysis, and discuss what this means moving forward. Whether you’re following this closely or hearing about it for the first time, we’ll break it all down for you.\n\nTopics We’ll Cover:\n\n • Key facts about the case\n • Legal implications and expert insights\n • Public reactions and media coverage\n • What’s next for Diddy and others involved\n\nFeel free to ask questions and share your thoughts in the chat—we’ll be addressing viewer comments throughout the livestream! Don’t forget to like, subscribe, and turn on notifications so you don’t miss future live coverage.",
      "release": "2024-09-20T16:06:55Z",
      "duration": "01:00:38",
      "explicit": false,
      "youTubeId": "tBsi_4tYnc4",
      "subjects": [
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=tBsi_4tYnc4"
      }
    },
    {
      "id": "47bb84a0-5428-44c0-aa50-899c4376412c",
      "title": "Polygamist Cult Leader Samuel Bateman and His Rise to Power in the FLDS | Finally See Justice?!",
      "description": "Samuel Bateman is a disgusting, depraved man who not only used the FLDS following as a means to prey upon young girls, he also claimed to be the new prophet after Warren Jeff\u0027s was arrested.  So where are we now with this case.  We are gonna break it all down, so sit back, relax and take a deep breathe: it\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group or organization.  The creator shares many of her own opinions and speculations.  Viewer discretion is advised.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-09-13T13:00:41Z",
      "duration": "00:37:33",
      "explicit": false,
      "youTubeId": "ZyMAV_AdU_g",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ZyMAV_AdU_g"
      }
    },
    {
      "id": "be9797b0-f058-4d16-8380-5aa91b1c32a6",
      "title": "Inside the Disturbing World of the Children of God Cult: A Deep Dive | Let The Fresh Erin",
      "description": "In this unsettling episode, we explore one of the most twisted and infamous cults in modern history: The Children of God, later rebranded as The Family International. Led by David Berg, this group lured vulnerable youth with promises of free love, only to subject them to years of exploitation, manipulation, and horrifying abuse. If you\u0027re intrigued by true crime, cult dynamics, or the dark side of spirituality, this deep dive will both captivate and horrify you.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any group or organization.  The creator shares many of her own opinions and speculations.  Viewer discretion is advised.\n\n🧠 Highlights in This Episode:\n\nThe rise of David Berg and his dangerous ideologies.\nThe disturbing tactics used to recruit and control members.\nHow the Children of God transitioned into a global cult with communes across the world.\nA close look at the shocking practices that devastated countless lives.\nIf you’re someone who can’t get enough of cult psychology, twisted leaders, and bizarre spiritual movements, then this is a must-watch. Erin’s thoughtful analysis and empathetic storytelling make it easier to approach such difficult topics with the depth and sensitivity they deserve.\n\n🚨 Trigger Warning: This video covers themes of abuse, manipulation, and sexual exploitation. Viewer discretion is advised.\n\n📅 New Videos Every Week! Erin dives into cults, true crime, and unique spiritual practices, so make sure to subscribe and hit the bell icon for notifications. Let\u0027s let the fresh air in together!\n\n🎉 Celebrate with Us! This is Erin\u0027s 100th episode on Let The Fresh Erin! Thank you to our incredible community of over 16,000 subscribers for making this journey possible. 🙏\n\n🔗 Related Videos:\n\nThe Rise of the Jesus Movement and Its Impact on 60s Counterculture\nExposing the Dark Side of Spiritual Communities\nThe Psychology of Cult Leaders: Why People Follow\n#TrueCrime #CultDocumentary #ChildrenOfGod #LetTheFreshErin #DavidBerg #FamilyInternational #CultPsychology #TrueCrimeCommunity #CultSurvivors",
      "release": "2024-08-23T13:01:14Z",
      "duration": "01:06:12",
      "explicit": false,
      "youTubeId": "vpo_74vCrBI",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vpo_74vCrBI"
      }
    },
    {
      "id": "9c643e9e-b4d8-418a-94b9-fca44d1cded9",
      "title": "Exposing Cult Leader Fails: Shocking Manipulations \u0026 Dangerous Ideologies | Teal Swan and MORE",
      "description": "In this deep dive, we’re breaking down the shocking and manipulative tactics used by cult leaders like Teal Swan and Bentinho Massaro. Discover how these so-called spiritual leaders twist ideologies to control their followers, often with dangerous consequences. From gaslighting to redefining common terms, we’ll expose the subtle yet powerful ways they keep people under their spell.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, organization, belief or entity.  Please consider everything said in this video to be the creator\u0027s opinion.  The content featured is protected by fair use.  Please do not reach out to or harass/bully anyone mentioned in this video.\n\nWhether you’re fascinated by cults, true crime, or just curious about the psychology behind these movements, this video is for you. Join us as we debunk their wildest claims and shed light on the hidden dangers of modern-day cults. Perfect for people who are intrigued by the dark side of spirituality and cult dynamics.\n\nMake sure to like, subscribe, and share your thoughts in the comments below. And if you’re a current or former follower, we welcome your insights with respect and compassion. Let’s unravel these manipulative ideologies together!\n\nKeywords: Cult Leader Exposed, Teal Swan, Bentinho Massaro, Spiritual Manipulation, Gaslighting, Cult Psychology, Women and Cults, True Crime, Cult Deep Dive, Dangerous Ideologies, Modern Cults.",
      "release": "2024-08-14T13:00:51Z",
      "duration": "00:33:26",
      "explicit": false,
      "youTubeId": "i_bXaf8XyT0",
      "subjects": [
        "Teal Swan",
        "Bentinho Massaro",
        "Bhagwan Shree Rajneesh",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=i_bXaf8XyT0"
      }
    },
    {
      "id": "ee0406fa-f44d-48d9-935c-184dfaadba84",
      "title": "Are You in a CULT?!  10 Questions to Ask Yourself if You Think You\u0027re in a Cult or Bad Relationship",
      "description": "When you\u0027re in the midst of cultic or relationship control, it can be really difficult to recognize and accept. We become clouded by the love or admiration we have for the person. Then it can be even more difficult to get away.  Today I lay out some rules to help you decipher what questions to ask yourself, or a friend who might be in a dangerous situation, and asses whether what you\u0027re involved with is dangerous.  Hopefully this video will be a good resource for you and your loved ones!  So sit back, relax and take a deep breathe: It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  Many of the statements made are the creator\u0027s opinion.  She shares what her understanding of the group/religion/practices.  This video is not meant to harass, bully or malign anyone from any person or entity.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro, Teacher and Explanation of Topic\n8:41 Were You Vulnerable?\n12:28 Love Bombed?\n15:54 Did you change your personality to better fit in?\n18:03 Were You Encouraged to Break Off Relationships?\n21:55 BITE Model Questions\n30:04 Are You Allowed to Question Them?\n31:12 Are You Afraid to Confide in Others?\n\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-08-10T14:00:27Z",
      "duration": "00:37:40",
      "explicit": false,
      "youTubeId": "XQtiYD9wVMQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XQtiYD9wVMQ"
      }
    },
    {
      "id": "1e381be2-5c13-4897-a37a-b62ef318c4f2",
      "title": "Inside \u0022The Movement\u0022: The Truth About The Maharishi\u0027s Meditation Community | CULT VISIT VLOG",
      "description": "In this documentary/vlog/interview, we discuss what life is like INSIDE the MAHARISHI WORLD PEACE MOVEMENT.  I explore the cult town of Fairfield, Iowa, the home of Maharishi\u0027s International University.  I get a tour of the town and learn the inside scoop from an ex-member.  We cover a lot of interesting topics so I hope you enjoy today\u0027s episode: it\u0027s a little different!  Today we are going to get to the bottom of all this!  It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  Many of the statements made are the creator\u0027s opinion.  She shares what her understanding of the group/religion/practices.  This video is not meant to harass, bully or malign anyone from any person or entity.  Viewer discretion is advised.\n\nWATCH THIS DEEP DIVE ON MAHARISHI FIRST!\nhttps://youtu.be/im93k8ku81s?si=R38uGg6UolBN-qUU\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-08-07T14:09:06Z",
      "duration": "00:59:32",
      "explicit": false,
      "youTubeId": "aY9BA8f6IEI",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aY9BA8f6IEI"
      }
    },
    {
      "id": "05ff957e-e858-4780-9e65-909aca4f85c6",
      "title": "The Maharishi: Great Seer or GREAT SCAMMER?!  The Truth About His Cult and Transcendental Meditation",
      "description": "Is The Maharishi’s World Peace Movement a cult dressed in fancy robes?  He has been celebrated as “The Beatles Guru” for decades, but in actuality, The Beatles fled the ashram after learning of this “celibate ascetic’s” predatory and s*xually exploitative behavior behind the scenes.  So why does he still have a following?  Well, his University filters directly into the cult, whether the students want to or not.  Today we are going to get to the bottom of all this!  It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  Many of the statements made are the creator\u0027s opinion.  She shares what her understanding of the group/religion/practices.  This video is not meant to harass, bully or malign anyone from any person or entity.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n3:50 Personal Connection to the Cult\n10:15 Who is Maharishi?\n19:13 What is Transcendental Meditation\n31:30 Maharishi and The Beatles\n35:00 Scandals and Predatory Practices\n39:50 The Siddhis\n42:00 Maharishi Invites Followers to Fairfield, Iowa\n46:30 Recruiting Through the University\n56:30 Thoughts and Conclusion\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-08-02T13:00:52Z",
      "duration": "01:00:08",
      "explicit": false,
      "youTubeId": "im93k8ku81s",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=im93k8ku81s"
      }
    },
    {
      "id": "61b74c39-51d4-497c-8fe2-c421c36d0c4f",
      "title": "CULT SURVIVOR STORIES 1: A Boy Disowned for Being Gay and INTENSE Time Control",
      "description": "Today we feature several stories from several Cult Survivors in my new series \u0022Survivor Stories\u0022.  I hope that by sharing these stories we can inspire empathy in others and better understand the challenges of being involved in a cult, whether they are in it or have finally broken free.  So sit back, relax and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  Many of the statements made are the creator\u0027s opinion.  She shares what her understanding of the case is.  This video is not meant to harass, bully or malign anyone from any person or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-07-30T13:01:04Z",
      "duration": "00:38:15",
      "explicit": false,
      "youTubeId": "x9AoT6H3Y30",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x9AoT6H3Y30"
      }
    },
    {
      "id": "5e010654-4341-4d81-b72a-bca31fb213de",
      "title": "THE BEAUTY CULT?! The Disturbing Truth About The Buddhafield",
      "description": "TW: S*xual a*use, manipulation, DV\nForced plastic surgery, coerced s*x acts, multiple decades of devotion.  Today, we break it all down here!  So sit back, relax and take a deep breath, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  Many of the statements made are the creator\u0027s opinion.  She shares what her understanding of the case is.  This video is not meant to harass, bully or malign anyone from any person or entity.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n4:00 The Acting Culture Connection\n10:14 Background on the Leader and How People Got Sucked In\n25:57 Daily Life in the Cult\n32:30 The Leader FLEES\n41:40 Forced Plastic Surgery\n45:45 \u0022Cleansing Sessions\u0022\n50:08 Survivors Speak Out\n54:28 Thoughts and Conclusion\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-07-26T13:00:22Z",
      "duration": "01:01:26",
      "explicit": false,
      "youTubeId": "MoxbRYuGbrs",
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MoxbRYuGbrs"
      }
    },
    {
      "id": "00dc1d96-ff27-4ee1-bdc6-84ef0a407ed5",
      "title": "Spiritual Influencers Want to SCAM YOU: The Problem With Law of Attraction Manifestation Coaches",
      "description": "Thank you to my sponsor, Aura!  Get your 2-week FREE trial with Aura HERE: https://aura.com/letthefresherin\n\nWe\u0027ve seen them all over our feeds: beautiful influencers who seem to have it all and according to them, it just magically happened for them: They MANIFESTED IT.   But did they really?  Or are they just trying to prey upon vulnerable people who want a quick fix to their money issues?  Today, we break it all down here!  So sit back, relax and take a deep breath, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  Many of the statements made are the creator\u0027s opinion.  She shares what her understanding of the case is.  This video is not meant to harass, bully or malign anyone from any person or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-07-21T14:00:12Z",
      "duration": "00:37:33",
      "explicit": false,
      "youTubeId": "JTQ8DyL78q0",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JTQ8DyL78q0"
      }
    },
    {
      "id": "bf400ed9-7b69-433f-8632-13d2e2a04b84",
      "title": "Kat Torres: Model Turned Cult Leader | The Truth Behind Her Lies",
      "description": "Kat Torres became an international sensation as a model, Leonardo DiCaprio\u0027s \u0022special friend\u0022 and most recently, as manipulative cult leader.  She\u0027s sitting in a Brazilian prison for how she treated 20 or more women.  Today, we break down all the details So sit back, relax and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  Many of the statements made are the creator\u0027s opinion.  She shares what her understanding of the case is.  This video is not meant to harass, bully or malign anyone from any person or entity.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n3:25 Story Begins\n4:59 Kat Torres\n9:45 The Russian Sugar Daddy\n19:30 Exploiting Vulnerable Women\n24:19 The Austin Mansion\n35:00 Missing Women\n38:15 Kat Torres Arrest\n40:00 Thoughts and Conclusion \n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-07-19T14:01:01Z",
      "duration": "00:45:08",
      "explicit": false,
      "youTubeId": "zUEAW5-qo-g",
      "subjects": [
        "Kat Torres",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zUEAW5-qo-g"
      }
    },
    {
      "id": "42c1ade3-e80b-4324-8cd5-6823cd18ae22",
      "title": "Jeff and Shaleia\u0027s TOXIC Twin Flame Advice EXPOSED: Cult Fails #1 | Twin Flames Universe Cult",
      "description": "Twin Flames Universe Cult Leaders Jeff and Shaleia give us some TERRIBLE and TOXIC advice on how to attract our Twin Flame...Let\u0027s go ahead and debunk this, shall we?  I hope you enjoy the first installment of CULT FAILS!  So sit back and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is for entertainment purposes only.  It is not meant to malign anyone from any group, entity or organization or belief.  All opinions expressed are just that opinions, alleged or even speculation.  Please do your own research and do not contact anyone featured or discussed in this video.  Thank you\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Youtube Channel dedicated to showcasing victims stories.  Hopefully by creating awareness and understanding, we can people and promote empathy.",
      "release": "2024-07-16T14:00:47Z",
      "duration": "00:46:53",
      "explicit": false,
      "youTubeId": "uT9B6gEKAEk",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uT9B6gEKAEk"
      }
    },
    {
      "id": "6f1c7420-00a9-404c-bae7-626ef0d221ab",
      "title": "Is Taylor Casey TRAPPED in A CULT?!  What is Going On at this Bahamas Yoga Retreat: The Real Story",
      "description": "Missing person Taylor Casey thought she was attending a normal yoga retreat.  She went to Sivananda Ashram Yoga Retreat in the Bahamas...and it sounded like it was going to be your typical relaxing yoga retreat, but under the surface we discover the true insidiousness behind this dangerous organization and try to uncover the mystery surrounding this case.  So sit back, relax and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER: This video is for entertainment purposes only.  Many of the statements made are the creator\u0027s opinion.  She shares what her understanding of the case is.  This video is not meant to harass, bully or malign anyone from any person or entity.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n3:33 About Taylor Casey\n13:21 Press Release\n25:23 Government and Police Corruption (Allegedly)\n29:40 The Cult\n46:23 Thoughts and Conclusion \n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-07-12T13:00:02Z",
      "duration": "00:49:18",
      "explicit": false,
      "youTubeId": "aEFdyXVJNj4",
      "subjects": [
        "Sivananda Yoga",
        "Yoga Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aEFdyXVJNj4"
      }
    },
    {
      "id": "e894f21f-58e5-4a78-8d51-e18c50d63513",
      "title": "Twin Flames Universe Got Her ARRESTED:  How One Woman Finally Broke Free From The Cult",
      "description": "Twin Flames Universe Cult Leaders have continued to maintain that they do not promote stalking and harrasment...so how come their followers are getting MULTIPLE restraining orders taken out against them AND ending up in jail (allegedly) because of Twin Flames Universe\u0027s teachings?  When we hear these stories, it only confirms that TFU is problematic, but don\u0027t take my word for it: listen to this survivor who was brave enough to come forward and share her story.  So sit back and take a deep breathe, it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is for entertainment purposes only.  It is not meant to malign anyone from any group, entity or organization or belief.  All opinions expressed are just that opinions, alleged or even speculation.  Please do your own research and do not contact anyone featured or discussed in this video.  Thank you\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Youtube Channel dedicated to showcasing victims stories.  Hopefully by creating awareness and understanding, we can people and promote empathy.",
      "release": "2024-07-05T14:00:35Z",
      "duration": "00:49:41",
      "explicit": false,
      "youTubeId": "dvUvn5_jWHg",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dvUvn5_jWHg"
      }
    },
    {
      "id": "db733e38-462e-4fb0-9ffb-76357dc01c5d",
      "title": "EXPOSING The High Existence Ayahuasca Cult: Is The Apotheosis Retreat a Cult Gateway?",
      "description": "The High Existence Website leaves much to be seen.  With word salad galore, strange phrasing and cult -speak throughout the material, one can\u0027t help but wonder...is this a CULT?  And when it comes to the Apotheosis Ayahuasca Retreat...is it a gateway to the very High Existence Cult, or is it the cult itself?  Today we explore ALL of this: its time to Let The Fresh Erin\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Please consider all comments made to be speculation, alleged, or opinion.  Viewer discretion is advised.\n\nTFU COMPILATION:\nhttps://youtu.be/p22NqEjH4dk?si=OPp5rMQC3eRzIeNU\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-07-02T14:00:13Z",
      "duration": "00:51:41",
      "explicit": false,
      "youTubeId": "KzdTGLJQmAs",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KzdTGLJQmAs"
      }
    },
    {
      "id": "675725d0-886f-4686-a9dd-9138a6e1fece",
      "title": "PROOF The Twin Flames Universe Cult PROMOTES HOME-WRECKING!  AND Gets Some BAD PRESS!",
      "description": "The Twin Flames Universe Cult is DESPERATELY trying to change their public image, but don\u0027t you worry, they are still getting some very bad press and we are here to break it all down with you!  PLUS!  We have PROOF that Twin Flames Universe Promotes Homewrecking and Stalking!  So let\u0027s break it all down: sit back, relax and Let The Fresh Erin.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Please consider all comments made to be speculation, alleged, or opinion.  Viewer discretion is advised.\n\nTFU COMPILATION:\nhttps://youtu.be/p22NqEjH4dk?si=OPp5rMQC3eRzIeNU\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-06-30T14:00:46Z",
      "duration": "00:50:55",
      "explicit": false,
      "youTubeId": "yi681cRRBvA",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yi681cRRBvA"
      }
    },
    {
      "id": "9a1dd94a-5d97-4539-b34b-d8eec69c42ec",
      "title": "EXPOSING Jeff and Shaleia\u0027s Plans for the Twin Flames Universe Cult: Inside the Summit",
      "description": "I have the INSIDE SCOOP about the Twin Flames Universe Cult Summit hanks to dedicated folks who are passionate about uncovering the truth.  We have once again infiltrated the group and are able to see a look inside and I cannot wait to share with you what we learned....it\u0027s scarier than we thought!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Please consider all comments made to be speculation, alleged, or opinion.  Viewer discretion is advised.\n\nTFU COMPILATION:\nhttps://youtu.be/p22NqEjH4dk?si=OPp5rMQC3eRzIeNU\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-06-21T14:00:46Z",
      "duration": "00:41:35",
      "explicit": false,
      "youTubeId": "rXQCLrtAw8o",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rXQCLrtAw8o"
      }
    },
    {
      "id": "65ac4fc0-3975-41f8-b150-f5a83c1d1807",
      "title": "Twin Flames Universe Cult Summit FULL RECAP!  DID IT EVEN HAPPEN?!",
      "description": "Thank you to my sponsor, Aura!  Get your 2-week FREE trial with Aura HERE: https://aura.com/letthefresherin\n\nThings have been kept pretty hush hush about the Twin Flames Universe Cult Summit, but today, I have the scoop for you...or as much as I could find!  Hopefully I\u0027ll have more for you soon!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Please consider all comments made to be speculation, alleged, or opinion.  Viewer discretion is advised.\n\nTFU COMPILATION:\nhttps://youtu.be/p22NqEjH4dk?si=OPp5rMQC3eRzIeNU\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-06-18T14:00:28Z",
      "duration": "00:29:10",
      "explicit": false,
      "youTubeId": "_bJwSYtPhVE",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_bJwSYtPhVE"
      }
    },
    {
      "id": "106eb841-def5-4351-9b37-c3f1ed3a820f",
      "title": "ESCAPING a Cult: Can It Be Done Safely? How to Help Miranda Derrick Leave The 7M Tiktok Cult",
      "description": "The hit Netflix Docu-series \u0022Dancing For The Devil\u0022 details the experiences of several ex members and families of current members of the 7M Tiktok Dance Cult and it\u0027s connection to the Shekinah Church Cult. This has sparked a lot of conversation online and has caused the members to be fearful for their lives.  So today we will share some of the ways we can help people like Miranda escape their dangerous cults. So sit back, relax and take a deep breathe: it\u0027s time to Let The Fresh Erin\n\nDISCLAIMER:  This video is for entertainment purposes only.  It is not meant to malign anyone from any group, entity or organization or belief.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Youtube Channel dedicated to showcasing victims stories.  Hopefully by creating awareness and understanding, we can people and promote empathy.",
      "release": "2024-06-16T14:00:43Z",
      "duration": "00:34:04",
      "explicit": false,
      "youTubeId": "wO0YANFue7I",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wO0YANFue7I"
      }
    },
    {
      "id": "75f203b1-1f1d-442f-8fc1-341f6c012788",
      "title": "Dangerous Aftermath of 7M Tiktok Dance Cult Documentary:  Are The Trolls Going too Far?",
      "description": "The hit Netflix Docu-series \u0022Dancing For The Devil\u0022 details the experiences of several ex members and families of current members of the 7M Tiktok Dance Cult and it\u0027s connection to the Shekinah Church Cult. This has sparked a lot of conversation online and has caused the members to be fearful for their lives.  So today we will unpack some of the aftermath. So sit back, relax and take a deep breathe: it\u0027s time to Let The Fresh Erin\n\nDISCLAIMER:  This video is for entertainment purposes only.  It is not meant to malign anyone from any group, entity or organization or belief.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Youtube Channel dedicated to showcasing victims stories.  Hopefully by creating awareness and understanding, we can people and promote empathy.",
      "release": "2024-06-14T14:00:19Z",
      "duration": "00:38:38",
      "explicit": false,
      "youTubeId": "O-0NN6HRFyI",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=O-0NN6HRFyI"
      }
    },
    {
      "id": "55869658-8aef-44a1-b891-4a37ffa42756",
      "title": "WATCH THIS Before Going to The Twin Flames Universe Cult Summit! Exposing Jeff and Shaleia Divine",
      "description": "ANNOUNCEMENT:  Twin Flames Universe Cult Leaders Jeff and Shaleia are hosting a summit in their home town NEXT WEEKEND.  They\u0027ve been hush hush about all the details, so today I wanted to provide a reminder about why you need to avoid this event at all costs, and break down how Twin Flames Universe operates like a cult.  Let\u0027s take a breath and Let The Fresh Erin\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Please consider all comments speculation, alleged, or opinion.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-06-09T14:00:36Z",
      "duration": "03:08:13",
      "explicit": false,
      "youTubeId": "p22NqEjH4dk",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=p22NqEjH4dk"
      }
    },
    {
      "id": "3788cd18-77b7-4d55-afef-0f96cd1b9090",
      "title": "THE TRUTH About the 7M Tiktok Dance Cult and it\u0027s Creepy Connection to the Shekinah Church DEEP DIVE",
      "description": "The hit Netflix Docu-series \u0022Dancing For The Devil\u0022 details the experiences of several ex members and families of current members of the 7M Tiktok Dance Cult and it\u0027s connection to the Shekinah Church Cult. This has sparked a lot of conversation online and has shown that people do not have a deep enough understanding of coercive control, or know the impact that decades of bad behavior and treatment can have on a person. Today we consider Miranda Derrick\u0027s recent posts, Robert Shinn\u0027s past and unpack how problematic this cult is. So sit back, relax and take a deep breathe: it\u0027s time to Let The Fresh Erin\n\nDISCLAIMER:  This video is for entertainment purposes only.  It is not meant to malign anyone from any group, entity or organization or belief.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Youtube Channel dedicated to showcasing victims stories.  Hopefully by creating awareness and understanding, we can people and promote empathy.",
      "release": "2024-06-07T14:00:19Z",
      "duration": "00:51:43",
      "explicit": false,
      "spotifyId": "2GtGFz1Cf76pyFk8iJmeiH",
      "youTubeId": "MJ5mU41Cqkg",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2GtGFz1Cf76pyFk8iJmeiH",
        "youtube": "https://www.youtube.com/watch?v=MJ5mU41Cqkg"
      }
    },
    {
      "id": "f1e6d34b-572e-48a4-9243-17628a41522b",
      "title": "Chad Daybell SENTENCED TO DEATH and Honoring JJ, Tylee and Tammy",
      "description": "Chad Daybell has been sentenced to death.  Today we review some of the wildest moments from the trial and honor the victims as best we can as outsiders It\u0027s time to Let the Fresh Erin.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: letfresherin@gmail.com \n\nLawyer You Know\nhttps://www.youtube.com/watch?v=rXWa3dBIsn8\u0026t=1149s\n\nFull Victim Impact Statements\nhttps://www.youtube.com/watch?v=lfGBIUP4ios\u0026t=257s\n\nAnnie Elise\u0027s FULL COVERAGE Playlist\nhttps://www.youtube.com/watch?v=vq9WFB0Uk4Q\u0026list=PLCY3SEDjbHKSUkKW6pqTeSZDb1qMDXU_Z\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-06-04T14:30:01Z",
      "duration": "00:55:28",
      "explicit": false,
      "youTubeId": "5578EZeqJbU",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5578EZeqJbU"
      }
    },
    {
      "id": "11e057f0-db04-4157-a5b0-a1983ac56e1e",
      "title": "Chad Daybell SENTENCED TO DEATH and Honoring JJ, Tylee and Tammy",
      "description": "Chad Daybell has been sentenced to death.  Today we review some of the wildest moments from the trial and honor the victims as best we can as outsiders It\u0027s time to Let the Fresh Erin.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: letfresherin@gmail.com \n\nLawyer You Know\nhttps://www.youtube.com/watch?v=rXWa3dBIsn8\u0026t=1149s\n\nFull Victim Impact Statements\nhttps://www.youtube.com/watch?v=lfGBIUP4ios\u0026t=257s\n\nAnnie Elise\u0027s FULL COVERAGE Playlist\nhttps://www.youtube.com/watch?v=vq9WFB0Uk4Q\u0026list=PLCY3SEDjbHKSUkKW6pqTeSZDb1qMDXU_Z\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-06-04T01:24:22Z",
      "duration": "00:55:28",
      "explicit": false,
      "youTubeId": "fR7jkFrXjDI",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fR7jkFrXjDI"
      }
    },
    {
      "id": "eff2ab06-27d1-4e8c-8b04-50ea0946b976",
      "title": "The LARGEST Teal Swan DEEP DIVE: Exposing the MANY LIES \u002B SCAMS of Cult Leader Teal Swan FULL SERIES",
      "description": "FULL 6-EPISODE SERIES COMPILATION: Teal Swan has been a controversial figure for over a decade.  From her confusing and disturbing childhood, to her concerning mental health practices: critics have been hard on her for years.  No matter how many stories are told of the harm she\u0027s done, or her lies are debunked, or documentaries and podcasts are produced..she seems to evade taking any responsibility for the negative impact she has on people.  And what\u0027s worse: she keeps going with the same messages.  Today, we talk all about Teal Swan\u0027s lies, debunk her theories and put her story up next to those who knew her best.  So sit back, relax and take a deep breath; it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is not meant to malign anyone from any person, entity, organization or religion.  It is simply for entertainment purposes only.  Many of the creators statements are her speculation or opinion.  Viewer discretion is advised.\n\nCHAPTERS:\n0:00 Intro\n3:00 Episode 1- The Truth About Teal Swan\n51:55 Episode 2- Barbara Snow and the Satanic Panic\n1:38:02 Episode 3-The Dangers of the Completion Process\n2:19:39 Episode 4- Survivors Speak Out (part 1)\n3:17:59 Episode 5- Survivors Speak Out (part 2)\n3:55:09 Episode 6- The Many Scams of Teal Swan \n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-06-02T14:00:23Z",
      "duration": "04:40:57",
      "explicit": false,
      "youTubeId": "TcRm2f6kflw",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TcRm2f6kflw"
      }
    },
    {
      "id": "336dcb45-3c59-4fb1-874f-7ab1c294b160",
      "title": "7M TikTok Dance Cult EXPOSED: HOW Are These Influencers Getting Sucked In?!  Dancing For The Devil",
      "description": "Netflix\u0027s hit docu-series details the tragic and sad experiences of not just many tiktok dance influencers, but also Korean Americans who were targeted by an evil man.  Today we break down how these hopeful artists got sucked in and explain what cult indoctrination really looks like.\n\nDISCLAIMER:  This video is for entertainment purposes only.  It is not meant to malign anyone from any group, entity or organization or belief.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Youtube Channel dedicated to showcasing victims stories.  Hopefully by creating awareness and understanding, we can people and promote empathy.",
      "release": "2024-05-31T14:00:35Z",
      "duration": "00:37:38",
      "explicit": false,
      "youTubeId": "gH01omasb2U",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gH01omasb2U"
      }
    },
    {
      "id": "5df36546-c49b-4103-ac46-e5244d67f7af",
      "title": "Twin Flames Universe Cult SUMMIT IS ACTUALLY HAPPENING?!  Plus I Take Jeff\u0027s Twin Flame Test",
      "description": "For the last several months, Jeff and Shaleia of the Twin Flames Universe Cult have been planning their Summit.  However, they\u0027ve been very tight lipped publicly about any details regarding this meet up.  So is it still happening?  AND we take a little Twin Flame Test Together, to see if I\u0027m ready for my Twin Flame.  This should be a fun one: take a breath and take a deep breath in!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2024-05-28T14:00:03Z",
      "duration": "00:35:39",
      "explicit": false,
      "youTubeId": "aMY8LnV_jO4",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aMY8LnV_jO4"
      }
    },
    {
      "id": "9604c437-f4a8-4dd0-b07d-33ac85dd31a3",
      "title": "Teal Swan: Guru or Grifter?  EXPOSING the MANY SCAMS of Teal Swan Ep. 6",
      "description": "Teal Swan claims to have many gifts and those gifts come at a high price.  So is it legit, or just a scam?  Today we are going to break down all the things she has to offer and their very high prices. So sit back, relax and take a deep breath; it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is not meant to malign anyone from any person, entity, organization or religion.  It is simply for entertainment purposes only.  Many of the creators statements are her speculation or opinion.  Viewer discretion is advised.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-05-24T14:00:18Z",
      "duration": "00:50:59",
      "explicit": false,
      "spotifyId": "22u3xULUOma8yxW3uswdVe",
      "youTubeId": "DM7T7J7l5O4",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/22u3xULUOma8yxW3uswdVe",
        "youtube": "https://www.youtube.com/watch?v=DM7T7J7l5O4"
      }
    },
    {
      "id": "32a162e2-7f2a-4c2e-b12e-c87a3a444427",
      "title": "MORE Teal Swan SURVIVORS Speak Out and Share THE TRUTH: Deity or Delusional- The Teal Swan Cult Pt 5",
      "description": "Teal Swan has been a controversial figure for over a decade.  Often times with cults and cult leaders, people don\u0027t want to speak out for fear of retaliation from the leader.  But with Teal, people have been trying to expose her for YEARS.  Somehow, she keeps evading taking any responsibility or accountability.  Today, we share more real stories from her survivors. So sit back, relax and take a deep breath; it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is not meant to malign anyone from any person, entity, organization or religion.  It is simply for entertainment purposes only.  Many of the creators statements are her speculation or opinion.  Viewer discretion is advised.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-05-17T14:00:25Z",
      "duration": "00:46:51",
      "explicit": false,
      "spotifyId": "2qqU1mFj1tiTLPy5vzVWe2",
      "youTubeId": "X709xsp1lu4",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qqU1mFj1tiTLPy5vzVWe2",
        "youtube": "https://www.youtube.com/watch?v=X709xsp1lu4"
      }
    },
    {
      "id": "663047c3-c897-4ec5-b1af-7ff3b21fb0d1",
      "title": "Teal Swan SURVIVORS Speak Out and Share THE TRUTH: Deity or Delusional- The Teal Swan Cult Part 4",
      "description": "Teal Swan has been a controversial figure for over a decade.  Often times with cults and cult leaders, people don\u0027t want to speak out for fear of retaliation from the leader.  But with Teal, people have been trying to expose her for YEARS.  Somehow, she keeps evading taking any responsibility or accountability.  Today, we share a real story from one of her survivors. So sit back, relax and take a deep breath; it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is not meant to malign anyone from any person, entity, organization or religion.  It is simply for entertainment purposes only.  Many of the creators statements are her speculation or opinion.  Viewer discretion is advised.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-05-10T14:00:24Z",
      "duration": "01:06:29",
      "explicit": false,
      "spotifyId": "5FRliRDBy4ds6fzAjqpkPa",
      "youTubeId": "IXsmeVeDpkc",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FRliRDBy4ds6fzAjqpkPa",
        "youtube": "https://www.youtube.com/watch?v=IXsmeVeDpkc"
      }
    },
    {
      "id": "2a64c1da-3c6d-4213-9be5-234b5e618476",
      "title": "The DANGERS of Teal Swan\u0027s COMPLETION PROCESS: Deity or Delusional? The TRUTH About Teal Swan: P. 3",
      "description": "Teal Swan\u0027s Completion Process: is it valuble or dangerous?   From her confusing and disturbing childhood, to her concerning mental health practices: critics have been hard on her for years.  No matter how many stories are told of the harm she\u0027s done, or her lies are debunked, or documentaries and podcasts are produced..she seems to evade taking any responsibility for the negative impact she has on people.  And what\u0027s worse: she keeps going with the same messages.  Today, we talk all about Teal Swan\u0027s controversial Completion Process. So sit back, relax and take a deep breath; it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is not meant to malign anyone from any person, entity, organization or religion.  It is simply for entertainment purposes only.  Many of the creators statements are her speculation or opinion.  Viewer discretion is advised.\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-05-03T14:00:46Z",
      "duration": "00:49:31",
      "explicit": false,
      "spotifyId": "7nwUPpMDwrk7uGVeq2aszN",
      "youTubeId": "x3eTTZXAvnU",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7nwUPpMDwrk7uGVeq2aszN",
        "youtube": "https://www.youtube.com/watch?v=x3eTTZXAvnU"
      }
    },
    {
      "id": "afd6bc6a-2983-4580-8584-625f2228d532",
      "title": "Teal Swan A VICTIM?!  Barbara Snow, The SATANIC PANIC and Implanting False Memories: A Deep Dive",
      "description": "It was the onslaught of the Satanic Panic and the US was in an absolute FRENZY!  And Barbara Snow played a very interesting role in the saga.  She claimed she was helping tramatized children, but experts allege she was actually implaning false memories into the children\u0027s minds. If that\u0027s the truth: Teal Swan may actually be a victim in this situation and in todays 2nd installment of this series, we are going to try to answer that question. So sit back, relax and take a deep breath; it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is not meant to malign anyone from any person, entity, organization or religion.  It is simply for entertainment purposes only.  Many of the creators statements are her speculation or opinion.  Viewer discretion is advised.\n\nCHAPTERS:\n0:00 Intro\n2:33 Review \u002B Disclaimers\n11:00 The Satanic Panic Origins\n20:43 Barbara Snow and the Satanic Panic\n33:12 What Do Satanists Believe?\n37:23 Barbara Implants Memories into Teal\n41:20 Teal Goes to Police\n45:00 Conclusion\n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-04-26T14:00:39Z",
      "duration": "00:47:25",
      "explicit": false,
      "spotifyId": "18u0wifJp91Fmxbk4ZDyx3",
      "youTubeId": "i3Y1A49QPdo",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18u0wifJp91Fmxbk4ZDyx3",
        "youtube": "https://www.youtube.com/watch?v=i3Y1A49QPdo"
      }
    },
    {
      "id": "f92dfa43-a89b-417e-b99a-9f0eb3d8273a",
      "title": "The Teal Swan DEEP DIVE: Deity or DELUSIONAL?  Exposing the MANY LIES of Cult Leader Teal Swan",
      "description": "Teal Swan has been a controversial figure for over a decade.  From her confusing and disturbing childhood, to her concerning mental health practices: critics have been hard on her for years.  No matter how many stories are told of the harm she\u0027s done, or her lies are debunked, or documentaries and podcasts are produced..she seems to evade taking any responsibility for the negative impact she has on people.  And what\u0027s worse: she keeps going with the same messages.  Today, we talk all about Teal Swan\u0027s lies, debunk her theories and put her story up next to those who knew her best.  So sit back, relax and take a deep breath; it\u0027s time to Let The Fresh Erin.\n\nDISCLAIMER:  This video is not meant to malign anyone from any person, entity, organization or religion.  It is simply for entertainment purposes only.  Many of the creators statements are her speculation or opinion.  Viewer discretion is advised.\n\nCHAPTERS:\n0:00 Intro\n3:00 Erin\u0027s Intro to Teal\n11:28 Teal\u0027s Early Life\n18:15 Teal Meets \u0022Doc\u0022\n27:15 Details of the Ritual Ab***\n32:58 Diana Debunks Teal\n42:57 Teal \u0022Escapes\u0022 \u0022Cult\u0022\n51:41 Teal Meets Barbara Snow \u002B Conclusion \n\nLet The Fresh Erin is a Cult Deep Dive and True Crime Channel.  The intention is to bring a deeper understanding to cults, cult behavior, speak out on behalf of survivors, create awareness and infuse more empathy into the viewer.  Thank you for tuning in!",
      "release": "2024-04-19T14:07:16Z",
      "duration": "00:54:01",
      "explicit": false,
      "spotifyId": "6LNXIHFPI7Pt1iE7U9KUED",
      "youTubeId": "SBbcqhpczpw",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6LNXIHFPI7Pt1iE7U9KUED",
        "youtube": "https://www.youtube.com/watch?v=SBbcqhpczpw"
      }
    },
    {
      "id": "517763eb-95dd-4685-9196-3ad79371ebb2",
      "title": "Chad Daybell Helpless to Seductress Lori Vallow?! Lawyer is DELUSIONAL: Unpacking Opening Statements",
      "description": "Chad Daybell\u0027s Trial has begun, and both sides have shared their opening statements.  Chad Daybell\u0027s lawyer has really put quite the spin on this case.  Today, we break it down and explain why this is a delusional tactic.  It\u0027s time to Let the Fresh Erin.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: letfresherin@gmail.com \n\nAnnie Elise\u0027s FULL COVERAGE Playlist\nhttps://www.youtube.com/watch?v=vq9WFB0Uk4Q\u0026list=PLCY3SEDjbHKSUkKW6pqTeSZDb1qMDXU_Z\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-04-15T14:00:04Z",
      "duration": "00:38:33",
      "explicit": false,
      "youTubeId": "8sFd1gA8P2w",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8sFd1gA8P2w"
      }
    },
    {
      "id": "61c760bc-6230-40f8-b555-aaaf3f85b96b",
      "title": "Chad Daybell and Lori Vallow\u0027s DERANGED Doomsday CULT EXPLAINED: Exposing The Disturbing Beliefs",
      "description": "Chad Daybell\u0027s Trial has begun, so now it\u0027s time to try to once again answer the question: how could someone justify harming their children...EVER?! Chad and Lori Vallow\u0027s strange religious beliefs became cult-like, difficult for people on the outside to understand.  So today, we go through a religious history to try to uncover how these two became such Monsters.  It\u0027s time to Let the Fresh Erin.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: letfresherin@gmail.com \n\nCHAPTERS:\n0:00 Intro\n4:25 Lori and Her Twisted Father\n14:20 Chad Daybell\u0027s Indoctrination\n22:25 The Doomsday Cult\n41:30 My Thoughts and Conclusion\n\nAnnie Elise\u0027s FULL COVERAGE Playlist\nhttps://www.youtube.com/watch?v=vq9WFB0Uk4Q\u0026list=PLCY3SEDjbHKSUkKW6pqTeSZDb1qMDXU_Z\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-04-05T14:00:01Z",
      "duration": "00:45:53",
      "explicit": false,
      "youTubeId": "1xaKK8iQ7VM",
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1xaKK8iQ7VM"
      }
    },
    {
      "id": "7bc81dff-e778-4af6-980e-fc9b1eb3a6cd",
      "title": "Ruby Franke VS Lori Vallow Sentencing: DELUSIONAL or BRAINWASHED? Culty Mormon Moms Finally Speak",
      "description": "Ruby Franke was a famous Youtube Mom thanks to her channel: 8 Passengers.  Her parenting techniques have been criticized for years, so not all people have been surprised by her recent guilty plea.  However, when she claimed she was influenced by friend and potential cult leader, Jodi Hildebrandt, some people couldn\u0027t help but raise their eyebrows.  Today we are going to break down her sentencing and decide if she truly feels remorseful.  We will compare it to Lori Vallow\u0027s sentencing and dissect what cult indoctrination and deconstruction looks like.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: letfresherin@gmail.com \n\nCHAPTERS:\n0:00 Intro\n4:39 Jodi Hildebrandt Sentencing\n14:55 Ruby Franke Sentencing\n39:49 Lori Valow Sentencing\n\nAnnie Elise\u0027s FULL COVERAGE\nhttps://www.youtube.com/watch?v=KiwreZn6Z5k\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-04-01T14:00:18Z",
      "duration": "00:58:32",
      "explicit": false,
      "youTubeId": "FY7v-HM_WKE",
      "subjects": [
        "Chad Daybell",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Connexions"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FY7v-HM_WKE"
      }
    },
    {
      "id": "375b5027-988f-40e0-8793-0976c5c8d9bf",
      "title": "Ruby Franke EVIDENCE EXPOSED, Jodi Hildebrandt a CULT Leader? What is WRONG With These Mormon Moms?!",
      "description": "Ruby Franke was a famous Youtube Mom thanks to her channel: 8 Passengers.  Her parenting techniques have been criticized for years, so not all people have been surprised by her recent guilty plea.  However, when she claimed she was influenced by friend and potential cult leader, Jodi Hildebrandt, some people couldn\u0027t help but raise their eyebrows.  Is Jodi a cult leader?  Was Ruby just under her spell?  Or is Ruby Franke far more evil and calculated than we realize?  When we hear stories like this, we can\u0027t help but be reminded ot Lori Vallow, another Mormon Monster Mom.  So we have to ask:  WHAT is going on with these Mormon Moms??\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: letfresherin@gmail.com \n\nCHAPTERS:\n0:00 Intro\n3:10 Brief Review\n10:18 Ruby\u0027s Diary\n28:36 Prison Phone Calls\n45:28 Kevin Franke Police Interrogation \n54:10 Conclusion\n\nAnnie Elise\u0027s FULL COVERAGE\nhttps://www.youtube.com/watch?v=KiwreZn6Z5k\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-03-29T14:00:45Z",
      "duration": "01:00:28",
      "explicit": false,
      "youTubeId": "qoLvq0poI0I",
      "subjects": [
        "Connexions",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qoLvq0poI0I"
      }
    },
    {
      "id": "e158271e-99f7-4d04-b4cd-2926eed0c043",
      "title": "EXPOSING The Troubled Teen Industry, A Deep Dive: The DISTURBING History of these CULT-LIKE SCAMS",
      "description": "The new Netflix Docu-series, The Program: Cults, Cons and Kidnapping, details the SHOCKING hidden life that kids experienced inside a Troubled Teen Institute.  When we peel back all the layers of this Scam of an industry, we begin to see how similar they are to a cult...and not only that...explore the deep deep history of this scam.  It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  All statements expressed are opinions of the speakers.  This video is not meant to malign anyone from any person, organization, entity or belief.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-03-25T14:00:45Z",
      "duration": "00:53:22",
      "explicit": false,
      "youTubeId": "puf5rR8w8uk",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=puf5rR8w8uk"
      }
    },
    {
      "id": "e4f304d4-4c22-4cf9-9b42-446d7b6101c5",
      "title": "Wives of Nature Boy (Eligio Bishop) DESPERATE To Prove He Was a Good Guy?! | Won\u0027t Leave The CULT!",
      "description": "Nature Boy, AKA Th3 3God, AKA Eligio Bishop\u0027s Trial has been sentenced to life in prison without parole.  Despite this, he still has supporters on the outside who are desperate to prove that he was a good guy.  It begs the question: WHY are these women still supporting him and why are they still in the cult.  Let\u0027s explore!\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, entity or organization.  It includes the creators opinion and several things shared are alleged.  Viewer discretion is advised.\n\nCheck out my other Nature Boy Videos!\nDeep Dive: https://youtu.be/R49NKc7RZS4\nTestimony Breakdown: https://youtu.be/SuSwYnV0dBU\nTrial Coverage: https://youtu.be/HRo-WITgNWA\nSentencing: https://youtu.be/hT7MnRgGYUs\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-03-22T14:00:00Z",
      "duration": "00:40:30",
      "explicit": false,
      "youTubeId": "aMVmqtlFFo8",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aMVmqtlFFo8"
      }
    },
    {
      "id": "4d50d6a0-5013-43d3-bf03-6120f9f97689",
      "title": "The Program: The Cult Parents PAY To Brainwash Kids: EXPOSING the SCAM of the Troubled Teen Industry",
      "description": "The new Netflix Docu-series, The Program: Cults, Cons and Kidnapping, details the SHOCKING hidden life that kids experienced inside a Troubled Teen Institute.  When we peel back all the layers of this Scam of an industry, we begin to see how similar they are to a cult.  Today, we are going to unpack all the reasons these organizations are similar to cults and how we can protect future kids from having these terrible, traumatizing experiences.  It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  All statements expressed are opinions of the speakers.  This video is not meant to malign anyone from any person, organization, entity or belief.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n2:12 The Overview and Sources\n4:10 What is a Troubled Teen Institute?\n10:57 Life Inside \u002B Cult Comparison\n22:58 Survivor Testimonials\n44:25 Conclusion\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-03-11T14:00:35Z",
      "duration": "00:49:19",
      "explicit": false,
      "youTubeId": "fOKQKq1p-rA",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fOKQKq1p-rA"
      }
    },
    {
      "id": "f6cce135-9b6a-4072-87fa-b737a1637a47",
      "title": "Natureboy AKA Eligio Bishop ABSURD Reaction to LIFE SENTENCE: The Cult Leader Shows NO REMORSE",
      "description": "Nature Boy, AKA Th3 3God, AKA Eligio Bishop\u0027s Trial has been sentenced to life in prison without parole.  The survivors finally get justice and we get to hear the cult leader\u0027s reaction and break down the sentencing and aftermath of this verdict.  It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, entity or organization.  It includes the creators opinion and several things shared are alleged.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-03-08T15:00:37Z",
      "duration": "00:50:45",
      "explicit": false,
      "youTubeId": "hT7MnRgGYUs",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hT7MnRgGYUs"
      }
    },
    {
      "id": "83199b13-1770-4707-9538-c1e3a5ff555f",
      "title": "RUBY FRANKE GOES TO JAIL, CHAD DAYBELL\u0027S ATTORNEY TRIES TO QUIT, AND MORE!  A True Crime UPDATE",
      "description": "Ruby Franke, Chad Daybell, Soldiers of Christ and more.  Today we are going to take a look at what\u0027s going on with previous cases I\u0027ve discussed on the channel.  From True Crime to cults, we\u0027ve covered it all!  I hope you enjoy!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nCHAPTERS\n0:00 Intro\n1:32 Missing Woman Hoax\n4:44 Timothy Smith Murder\n6:57 Jeju Spa Body: Soldiers of Christ Cult\n10:15 Ruby Franke and Chad Daybell\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-03-04T15:00:32Z",
      "duration": "00:19:16",
      "explicit": false,
      "youTubeId": "Ow4ZkR-csHM",
      "subjects": [
        "Chad Daybell",
        "Connexions",
        "Soldiers of Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ow4ZkR-csHM"
      }
    },
    {
      "id": "119f13e3-e4f8-4205-8708-666beffb15f1",
      "title": "Nature Boy AKA Eligio Bishop\u0027s SHOCKING Behavior During Trial: Will the Cult Leader Be Convicted?",
      "description": "Nature Boy, AKA Th3 3God, AKA Eligio Bishop\u0027s Trial has been an utter s*** show!  And today we are gong to break it all down for you!  It has been an absolutely wild ride.  From trying to fire his attorney to leaving the courtroom we are going to react to all of it!  Let\u0027s hope this Cult Leader finally gets convicted.  It\u0027s time to Let The Fresh Erin\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, entity or organization.  It includes the creators opinion and several things shared are alleged.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n3:06 Trial Summary\n9:20 Crazy Trial Footage\n\nSupport these awesome creators!\nhttps://www.youtube.com/@NiqueatNite\nhttps://www.youtube.com/@KINGWURLD2023\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-03-01T15:00:13Z",
      "duration": "00:46:20",
      "explicit": false,
      "youTubeId": "HRo-WITgNWA",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=HRo-WITgNWA"
      }
    },
    {
      "id": "f250202d-e3ff-4486-baf5-27e27acc4157",
      "title": "Cult Leader Bentinho Massaro Says ADD/ADHD Isn\u0027t Real? | Debunking The Delusion 3",
      "description": "Today, Bentinho Massaro tells us that there is no ADD/ADHD but also implies that it can be cured through awareness of it....So which is it??  Today we are going to  break down the word salad and see if we agree with him...that is..if we can even understand what he\u0027s trying to say  It\u0027s time to take a deep breathe and Let The Fresh Erin\n\n*DISCLAIMER: This video is for entertainment purposes only and all statements made are opinion or alleged.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nEmail me your story at eringfinleigh@gmail.com",
      "release": "2024-02-26T16:00:15Z",
      "duration": "00:37:26",
      "explicit": false,
      "youTubeId": "S4SfvOWSG18",
      "subjects": [
        "Bentinho Massaro"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=S4SfvOWSG18"
      }
    },
    {
      "id": "d13a78fd-cb15-4f82-97fd-0e047764c6fc",
      "title": "Twin Flames Universe Cult SUMMIT UPDATE! Will It Happen?!",
      "description": "For the last several months, Jeff and Shaleia of the Twin Flames Universe Cult have denied that they promote breaking up marriages and pursuing your twin flame no matter what.  In this video, not only do we prove that their defense is a lie, we also debunk the delusion and ideology that they love to promote.  Thank you for tuning into today\u0027s video!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2024-02-23T16:00:34Z",
      "duration": "00:36:25",
      "explicit": false,
      "youTubeId": "iPd63yNdqog",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iPd63yNdqog"
      }
    },
    {
      "id": "0d04df6a-cbec-438d-be21-4b9e841f1baf",
      "title": "Nature Boy AKA Eligio Bishop and His Sick Cult ON TRIAL!  New Disturbing Details from Survivors",
      "description": "Great News!  Two expert witnesses have been announced who will testify tomorrow in court.  I read the full pre-trial transcript so you don\u0027t have too!  \n\nToday we take a look at Nature Boy, AKA Th3 3God, AKA Eligio Bishop and explore his disturbing cult, the terrible things he\u0027s done and read the transcript of the survivors of his cult\u0027s testimony.   Today we hope to shed light on this person to help the current followers, and hopefully stop people from join him.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, entity or organization.  It includes the creators opinion and several things shared are alleged.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-02-19T16:00:28Z",
      "duration": "01:28:32",
      "explicit": false,
      "youTubeId": "SuSwYnV0dBU",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SuSwYnV0dBU"
      }
    },
    {
      "id": "7cfb6b6b-34c0-4449-b205-dc60e9b45575",
      "title": "Debunking the Delusion of Bentinho Massaro and His Cult: Is He Really An Alien Sent to Save Us All?",
      "description": "Bentinho Massaro is no stranger to media criticism.  In fact he seems to embrace it, and carry on pushing his ideologies and problematic practices to his followers despite being publicly named a cult.  He has fled from country to country, and as people speak out about what they endured being involved with him, too soon after, those experiences seem to be forgotten.  So today, we are going to react to and debunk some of the ideology he loves to push.  It\u0027s time to take a deep breathe and Let The Fresh Erin\n\n*DISCLAIMER: This video is for entertainment purposes only and all statements made are opinion or alleged.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nEmail me your story at eringfinleigh@gmail.com",
      "release": "2024-02-16T16:00:44Z",
      "duration": "00:48:25",
      "explicit": false,
      "youTubeId": "zJHKz0kOsWM",
      "subjects": [
        "Bentinho Massaro"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zJHKz0kOsWM"
      }
    },
    {
      "id": "69311492-1aae-4f3c-b0cd-b56b8aebbb6d",
      "title": "Bentinho Massaro: Influencer, Cult Leader, or Millennial Monster?  A Deep Dive Into Him and His Cult",
      "description": "Bentinho Massaro is no stranger to media criticism.  In fact he seems to embrace it, and carry on pushing his ideologies and problematic practices to his followers despite being publicly named a cult.  He has fled from country to country, and as people speak out about what they endured being involved with him, too soon after, those experiences seem to be forgotten.  So today, we are going to take a deep dive into Bentinho Massaro and his cult that just won\u0027t seem to go away.  It\u0027s time to take a deep breathe and Let The Fresh Erin\n\n*DISCLAIMER: This video is for entertainment purposes only and all statements made are opinion or alleged.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n2:07 Background and Beginnings\n21:38 Sedona Retreat\n33:22 Bentinho Goes Abroad\n44:16 Life Inside the Cult\n44:16 Conclusion\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-02-12T16:00:12Z",
      "duration": "00:47:28",
      "explicit": false,
      "youTubeId": "J6vTkj95Z0A",
      "subjects": [
        "Bentinho Massaro"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J6vTkj95Z0A"
      }
    },
    {
      "id": "03a485e1-fed5-4b10-a4f0-14d05918395c",
      "title": "Debunking the Delusion of Twin Flames Universe: Cult Leaders Jeff and Shaleia Divine are LIARS",
      "description": "For the last several months, Jeff and Shaleia of the Twin Flames Universe Cult have denied that they promote breaking up marriages and pursuing your twin flame no matter what.  In this video, not only do we prove that their defense is a lie, we also debunk the delusion and ideology that they love to promote.  Thank you for tuning into today\u0027s video!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n4:02 Mirror Exercise Reaction\n37:32 If Your Twin Flame is Married Reaction\n01:05:17 Love List Reaction\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2024-02-09T16:00:00Z",
      "duration": "01:11:26",
      "explicit": false,
      "youTubeId": "aNuLKegIhuU",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aNuLKegIhuU"
      }
    },
    {
      "id": "6e5ea646-f4df-4238-be30-b50baa051c7b",
      "title": "Nature Boy\u0027s \u0022Spiritual\u0022 Tactics and Teachings Exposed | Debunking the Delusion Episode 1",
      "description": "Nature Boy shared a lot of beliefs with his followers to get them to join the cult.  Since it would take years to unpack ALL his content, today we break down moments from a few videos and discuss the tactics he used to get people in the cult and get them to stay in the cult.  The goal of this video is to help provide a deeper understanding of why people joined this group and discover the indoctrination tactics he used to do this.  Thank you for watching!  I hope you enjoy this video: Debunking the Delusion Episode 1\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, entity or organization.  It includes the creators opinion and several things shared are alleged.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n4:48 How to Poo Outside\n19:20 How Intercourse Is Just Information\n33:27 Men are Poly Because of \u0022Science\u0022\n\nRESOURCES\nNature Boy TV\nKing Wurld\u0027s Channel\nhttps://www.youtube.com/results?search_query=king\u002Bwurld\u002Bnatureboy\n\nSimply Anna\nhttps://www.youtube.com/@UCVNcrFRg0VwkFh-afAbgozg \n\nSeanDavieWavy Show\nhttps://www.youtube.com/@UCJKoX8eTXpsEYQOzviSlxYQ \n\nThe Women of Carbon Nation:\nhttps://www.youtube.com/watch?v=3mlLPMiDxiA\n\nOTHER\nhttps://www.youtube.com/watch?v=3K-d73AbaH0\nBBC Documentary\nCult Education Website\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-02-05T16:00:24Z",
      "duration": "00:40:45",
      "explicit": false,
      "youTubeId": "gM14MXLk34M",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gM14MXLk34M"
      }
    },
    {
      "id": "575a8e08-8c48-4770-a1b0-7eccdbc9e73a",
      "title": "Nature Boy AKA  Eligio Bishop and His Disturbing Cult: Carbon Nation, Disgusting Behavior and Arrest",
      "description": "Today we take a look at Nature Boy, AKA Th3 3God, AKA Eligio Bishop and explore his disturbing cult, the terrible things he\u0027s done and see where we are now.  Survivors of his cult have been trying to speak out for years and he was finally arrested in April 2024.  He has a criminal history, a personal history of wrongdoing and despite all that, still has a following.  Today we hope to shed light on this person to help the current followers, and hopefully stop people from join him.\n\nDISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign anyone from any person, entity or organization.  It includes the creators opinion and several things shared are alleged.  Viewer discretion is advised.\n\nCHAPTERS\n0:00 Intro\n3:30 Background\n21:02 Velvet\u0027s Story\n39:34 Costa Rica\n33:18 Costa Rica Deportation\n41:42 Back to US and Current Status\n48:33 Conclusion\n\nRESOURCES\n\nNoor Jasmine\u0027s Deep Dive\nhttps://www.youtube.com/watch?v=lM4TIYjfjgY\u0026t=1s\n\nVelvet Interview\nhttps://www.youtube.com/watch?v=j5j9u5OeAxE\n\nSeanDavieWavy Show\nhttps://www.youtube.com/@UCJKoX8eTXpsEYQOzviSlxYQ \n\nThe Women of Carbon Nation:\nhttps://www.youtube.com/watch?v=3mlLPMiDxiA\n\nKing Wurld\u0027s Channel\nhttps://www.youtube.com/results?search_query=king\u002Bwurld\u002Bnatureboy\n\n11 Alive\nhttps://www.youtube.com/watch?v=2FHQRf0jq9g\n\nOTHER\nhttps://www.youtube.com/watch?v=3K-d73AbaH0\nBBC Documentary\nCult Education Website\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-02-02T16:00:20Z",
      "duration": "00:51:50",
      "explicit": false,
      "youTubeId": "R49NKc7RZS4",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=R49NKc7RZS4"
      }
    },
    {
      "id": "687c593c-a627-4b0a-be35-412425f20bcb",
      "title": "A TikTok Marketing Cult Linked to NXIVM??  What is going on with Movers and Shakers?!",
      "description": "Evan Horowitz and Geoffrey Goldberg were devoted followers of Keith Raniere, the founder of the NXIVM Cult.  During their time in the cult, they created Movers and Shakes, a marketing company that specializes in creating viral TikTok videos fro brands.  According to ex employees, they ran the company just like a cult, and even shared the same mission as Keith Raniere.  Today we dive deeper into Movers and Shakers and its connection to the NXIVM Cult\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-01-29T16:00:25Z",
      "duration": "00:34:03",
      "explicit": false,
      "youTubeId": "_hvOwX8B2uI",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=_hvOwX8B2uI"
      }
    },
    {
      "id": "889a83ed-61d4-48ad-aca7-3b6df5400621",
      "title": "CULTS ARE MONEY MACHINES!  How Cults EXPLOIT You Using the MLM Business Structure: Twin Flames/NXIVM",
      "description": "The video discusses how cults use the MLM business model to exploit their followers to work for free.  Today we dive deep into cults like Twin Flames Universe, NXIVM, and Scientology and explore how their \u0022coaching\u0022 programs are run just like MLMs\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nSome of my favorite Anti-MLM Creators:\n@HannahAlonzo \n@IAMCCSuarez \n@IsabellaLanter \n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-01-26T16:30:04Z",
      "duration": "00:33:55",
      "explicit": false,
      "youTubeId": "Ph0WzvUELhM",
      "subjects": [
        "NXIVM",
        "Multi-Level Marketing",
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ph0WzvUELhM"
      }
    },
    {
      "id": "8497f038-5279-4384-b5a3-97749493b0de",
      "title": "PROOF That MLMs are Just Commercial Cults: Breaking Down the Manipulative Tactics",
      "description": "MLMs: Are they pyramid schemes, cults or both cuz there\u0027s no way they are legitimate, right?!  In today\u0027s video we explore how MLMs are just commercial cults and we break down all the manipulative tactics and expose why MLMs are cults disguised as small businesses.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nSome of my favorite Anti-MLM Creators:\n@HannahAlonzo \n@IAMCCSuarez \n@IsabellaLanter \n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-01-22T15:00:06Z",
      "duration": "00:27:25",
      "explicit": false,
      "youTubeId": "A1ksIwYXAhI",
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A1ksIwYXAhI"
      }
    },
    {
      "id": "8bd83de3-3600-41ad-b166-23472a7102a5",
      "title": "Twin Flames Universe Cult Summit: Pointless Workshops and a Promise to Meet Your Twin Flame?  UPDATE",
      "description": "This Twin Flames Universe Culty Summit has little to offer in my opinion.  In this video, we go over exactly what the summit is and what workshops are being offered and spoiler alert: it\u0027s nothing you can\u0027t find or do for free!  Jeff and Shaleia Divine are still selling tickets to this summit, but the locals are not happy about it...are they potentially going to be announcing the opening of their commune??This is another warning for anyone tempted to go to this event.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-01-19T01:28:36Z",
      "duration": "00:33:53",
      "explicit": false,
      "youTubeId": "CfemBvi3YmU",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CfemBvi3YmU"
      }
    },
    {
      "id": "7a63b456-070f-4249-9b6a-e792b2be97cf",
      "title": "Twin Flames Universe Cult Summit: Jeff and Shaleia Divine Host an In-Person Event You Should AVOID",
      "description": "ANNOUNCEMENT:  Twin Flames Universe Cult Leaders Jeff and Shaleia are hosting a summit in their home town.  This video breaks down all the details and tries to show you if it\u0027s even worth it and why I\u0027m suspicious this is only going to lead to bad news and a potential announcement and invitation to a commune. This video will review the event and their Church of Union website to try to uncover what this group actually has to offer.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2024-01-15T16:00:11Z",
      "duration": "00:48:48",
      "explicit": false,
      "youTubeId": "8AQ3JATYVPU",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8AQ3JATYVPU"
      }
    },
    {
      "id": "10328612-8a77-4573-983d-6f2706feb0aa",
      "title": "Children in Cults: From Abandoning Children to Manual Labor: The Dangers of Your Child in a Cult",
      "description": "Every cult seems to see children differently, but no matter the cult, it seems they all are a terrible place for a child to be.  Today we discuss the dangers of a child being in a cult and explore what to look out for so you can avoid a cult and protect your child.\n\nCHAPTERS\n0:00 Intro\n2:07 Disclaimer\n2:40 Overview\n3:53 Osho and Sterilization\n7:10 Scientology\n11:09 NXIVM\n13:22 Twelve Tribes\n15:12 Warren Jeffs and FLDS\n17:39 Branch Davidians\n21:46 Steven Hassan\u0027s Message\n23:36 Conclusion\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-12-31T16:01:56Z",
      "duration": "00:28:11",
      "explicit": false,
      "youTubeId": "cn2mE2fdLsg",
      "subjects": [
        "Twin Flames Universe",
        "NXIVM",
        "Scientology",
        "FLDS Church",
        "Cult-Expert",
        "Bhagwan Shree Rajneesh",
        "Branch Davidians",
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cn2mE2fdLsg"
      }
    },
    {
      "id": "39954d92-f480-43e5-9891-714990b52b36",
      "title": "Going Against God P.2: How Jessi Hersey Escaped Twin Flames Universe and Challenged Jeff and Shaleia",
      "description": "I am honored to have had the opportunity to interview Jessi Hersey, who actually escaped Twin Flames Universe!  She once questioned Jeff \u0022Divine\u0022 and he said she was \u0022Going Against God\u0022. In this video she shares how she got in, why Shaleia \u0022Divine\u0022 is just as harmful as Jeff, what it was like being told she was a man in a woman\u0027s body, what finally got her out, and shares her path towards healing.  Please enjoy this interview with someone who was brave enough to come forward to share her story not just here, but on the international platform Netflix: it doesn\u0027t get much more brave than that! Please enjoy Part One of my interview with Jessi Hersey.  Thank you!\n\nPART ONE HERE:\nhttps://youtu.be/UD_9Ypbjalc?si=eGbiwmvmikJvWuCi\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nCHAPTERS\n0:00 Intro\n01:10 Aftermath of Gender Assignment\n23:00 Healing and How She Left\n31:00 Similarities in Cult Leaders\n39:15 Tageting LGBTQIA\u002B and Special Needs\n42:05 Advice for Those Still in Cult\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2023-12-27T16:00:28Z",
      "duration": "00:46:18",
      "explicit": false,
      "youTubeId": "UGXiiwEsC4U",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UGXiiwEsC4U"
      }
    },
    {
      "id": "51c8627e-5560-43b9-8d19-530d3d02cc9d",
      "title": "Going Against God: How Jessi Hersey Escaped Twin Flames Universe and Challenged Jeff and Shaleia P.1",
      "description": "I am honored to have had the opportunity to interview Jessi Hersey, who actually escaped Twin Flames Universe!  She once questioned Jeff \u0022Divine\u0022 and he said she was \u0022Going Against God\u0022. In this video she shares how she got in, why Shaleia \u0022Divine\u0022 is just as harmful as Jeff, what it was like being told she was a man in a woman\u0027s body, what finally got her out, and shares her path towards healing.  Please enjoy this interview with someone who was brave enough to come forward to share her story not just here, but on the international platform Netflix: it doesn\u0027t get much more brave than that! Please enjoy Part One of my interview with Jessi Hersey.  Thank you!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nCHAPTERS\n0:00 Intro\n4:40 How She Got In\n15:41 Becoming a \u0022Coach\u0022\n23:41 Time Control\n29:10 Shaleia is AS BAD as Jeff\n31:44 Jeff and Shaleia as Bosses\n36:18 The First Red Flag\n42:45 Spying on Other Members\n44:50 Leading Up to the Twin Flame Pairing\n59:00 The Twin Flame Pairing and Gender Assignment\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2023-12-22T16:00:15Z",
      "duration": "01:14:35",
      "explicit": false,
      "youTubeId": "UD_9Ypbjalc",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UD_9Ypbjalc"
      }
    },
    {
      "id": "c09d6a30-2265-4f65-b63d-eb67b357ff98",
      "title": "Youtube Mom Ruby Franke Pleads Guilty, Blames Connexions Cult Leader Jodi Hildebrandt: Is She Evil?",
      "description": "Ruby Franke was a famous Youtube Mom thanks to her channel: 8 Passengers.  Her parenting techniques have been criticized for years, so not all people have been surprised by her recent guilty plea.  However, when she claimed she was influenced by friend and potential cult leader, Jodi Hildebrandt, some people couldn\u0027t help but raise their eyebrows.  Is Jodi a cult leader?  And is Connexions actually a CULT?  Today, we try to answer these questions.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nCHAPTERS:\n0:00 Intro\n04:26 Background on Ruby Franke Case\n08:25 Details of Guilty Plea\n15:36 Who is Jodi Hildebrandt\n18:10 The Conexions Cult\n33:17 Moms of Truth\n35:43 Jodi\u0027s Niece Speaks Out\n37:10 Conclusion\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-12-20T15:00:33Z",
      "duration": "00:42:20",
      "explicit": false,
      "youTubeId": "SvfuAvUQic8",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=SvfuAvUQic8"
      }
    },
    {
      "id": "0a0c8fb2-95bf-433b-8ea0-7ff8d38b50ec",
      "title": "Mother God\u0026#39;s Love Has Won CULT: The Rules, Brainwashing and How The Followers Got in So Deep Part 2",
      "description": "Love Has Won is another New Age Cult lead by a woman named Amy Carlson who claimed to be God in human, feminine form.  She invited young hippies to live in her house with her, asked them to donate money to create The New Earth and heal humanity as a whole.  Her followers flocked to her and didn\u0027t ask any questions when she went on drunken rampages and started turning blue.  I fast, they just somehow fell deeper and deeper into the cult ideology.  In todays video, we explore how her victims got sucked in and why they never really got out.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nCHAPTERS:\n0:00 Intro\n04:08 Single Parent Story\n19:01 Rules of the Cult\n37:03 Was Father God to Blame?\n40:00 Impact on Followers\n43:28 Death of Mother God\n51:28 Aftermath and Miquel Being Shady\n56:20 Conclusion\n\nPART ONE\nhttps://youtu.be/vfQ4AWsVspQ?si=iktaaDoBLJDkOr7u\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-12-17T16:00:10Z",
      "duration": "00:58:59",
      "explicit": false,
      "youTubeId": "CpIPOgeDjAM",
      "subjects": [
        "Cult Psychology",
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CpIPOgeDjAM"
      }
    },
    {
      "id": "22680f50-44a5-4d10-b74f-e742c0cc59e4",
      "title": "Love Has Won (Or Has It?) A Deep Dive Into Mother God and her Cult PART ONE",
      "description": "Love Has Won is another New Age Cult lead by a woman named Amy Carlson who claimed to be God in human, feminine form.  She invited young hippies to live in her house with her, asked them to donate money to create The New Earth and heal humanity as a whole.  Was she truly Mother God?  A Divine entity sent here over multiple lifetimes to heal us all?  Or was she a woman who was self medicating from deeply rooted mental health concerns.  And how did her followers. get roped in to enabling her delusions?  In today\u0027s video, we try to answer those questions.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nCHAPTERS:\n0:00 Intro\n03:30 Who is Mother God\n11:39 What is A Lightworker?\n12:54 Amy\u0027s Online Activity\n13:35 Amy Connects With Amerith\n14:23 Amy Moves to Crestone\n15:44 Amy and Amerith\u0027s Beliefs \n22:05 Forming the Cult\n30:50 The Cult Grows\n34:17 D*** Use in the Cult\n38:23 Confirmation Bias and Conclusion\n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-12-15T16:02:02Z",
      "duration": "00:43:44",
      "explicit": false,
      "youTubeId": "vfQ4AWsVspQ",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vfQ4AWsVspQ"
      }
    },
    {
      "id": "074dce5d-63f3-43fa-b397-e7169e241b7e",
      "title": "Wait, I\u0026#39;M IN A CULT?!  Part Two: A Deep Dive into Miracle of Love AKA: Center of the Golden One CULT",
      "description": "It\u0027s never easy to admit that you\u0027re in a cult.  It\u0027s challenging to come to that realization and even more difficult to talk about it openly-let alone expose the cult for what it is.  Today I expose the cult, Miracle of Love, which in recent years has rebranded as Center of the Golden One and is still operating today. \n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nWAIT, I\u0027M IN A CULT?! My Story\nhttps://www.youtube.com/watch?v=fsOISS2OIWQ\u0026t=221s\n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-12-13T16:00:21Z",
      "duration": "00:47:40",
      "explicit": false,
      "youTubeId": "KlG3yyy9Utg",
      "subjects": [
        "Miracle of Love"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KlG3yyy9Utg"
      }
    },
    {
      "id": "67fee1e8-e96b-4767-9042-2e3f5ef838bc",
      "title": "She Escaped Twin Flames Universe: One Woman\u0026#39;s True Story of Leaving the Cult and How She Healed",
      "description": "I am honored to have had the opportunity to interview someone who actually escaped Twin Flames Universe!  In this video she shares how she got in, how she worked for free for years, the red flags she saw, what finally got her out, and shares her path for healing.  Please enjoy this interview with someone who was brave enough to come forward to share her story.  Thank you!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nCHAPTERS\n0:00 Intro\n2:35 How She Got In\n11:35 How Information is Controlled\n17:15 How the Mirror Exercise in Harmful\n20:00 \u0022Working\u0022 For TFU\n32:07 Internal Complaints and Hidden Unaliving\n35:00 First Red Flag and Getting Out\n48:45 Problems with Twin Flames as a Concept\n55:25 The Dangers of Co-Dependency\n01:11:00 Advice on Healing\n01:24:00 Conclusion\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2023-12-10T15:00:37Z",
      "duration": "01:29:25",
      "explicit": false,
      "youTubeId": "k-Q1q7dpFvc",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=k-Q1q7dpFvc"
      }
    },
    {
      "id": "b6c28667-90a5-4c4a-a1c5-0a8d80ec81fc",
      "title": "Is Jeff \u0022Divine\u0022 Delusional or Just Another Cult Leader? More BS from Twin Flames Universe Leaders",
      "description": "Well, Jeff and Shaleia are at it again.  With tone deaf, manipulative and strange defense posts in their Open Forum, we are seeing the beginning of the inevitable downfall of The Twin Flames Universe.  In today\u0027s video, we explore the defensive tactics Jeff is using to try to prove that he is doing good in his community, but this video wants to argue that perhaps he is actually doing harm.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2023-12-08T16:00:39Z",
      "duration": "00:53:42",
      "explicit": false,
      "youTubeId": "wNpK6bIUDZA",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wNpK6bIUDZA"
      }
    },
    {
      "id": "8701db35-5aea-4689-b995-6897d5bb3be0",
      "title": "The Disturbing Exploitation of Women in a Spiritual Setting #osho #cults",
      "release": "2023-12-07T15:33:13Z",
      "duration": "00:01:01",
      "explicit": false,
      "youTubeId": "Y6RghiisKO0",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Y6RghiisKO0"
      }
    },
    {
      "id": "d2d27b10-83ef-4a27-bdb4-5c8ee2551579",
      "title": "OSHO: Enlightened Guru or Evil Deviant: Exposing The Truth About The Free Love Cult",
      "description": "Osho is a world-renowned spiritual guru, spreading individualistic and free love ideology.  His meditation and yoga centers continue to thrive across the world.  But we must not forget, that behind the mask of spiritual teacher, was a devious, gross, ab*sive cult leader.  Today we explore Rajneesh, AKA Osho and the growth and destruction of his cult.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  My statements are alleged and or my opinion.\n\nCHAPTERS:\n0:00 Intro\n02:04 Video Intention\n04:04 Who is Rajneesh\n07:46 His Problematic Beliefs and Practices\n16:27 Why People Joined the Cult\n22:48 The Ashram\n26:08 Why He Fled India\n28:41 The American Commune\n35:44 Political Strife\n44:43 Rajneesh Turns on Sheela\n47:33 Osho Followers Today\n48:32 Conclusion/My Opinion\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-12-06T16:00:42Z",
      "duration": "00:53:48",
      "explicit": false,
      "youTubeId": "q91YPeUuTUM",
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=q91YPeUuTUM"
      }
    },
    {
      "id": "79c0e142-c7f8-479d-b34e-069f86f12c16",
      "title": "Why The Twin Flames Universe MAP Program is PROBLEMATIC: Can You Reprogram Trauma w/ Lexie Strasser",
      "description": "I am so thrilled to be able to bring you this interview with Alexandra (Lexie)  Strasser!  She holds a Masters in Counseling, Extensive experience working with patients, and has been helping expose the harmful practices and teachings of Jeff and Shaleia within Twin Flames Universe.  I hope you enjoy this interview with her!\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  My statements are alleged and or my opinion.\n\n00:00 Intro\n02:20 Interview Begins\n05:45 What is MAP?\n16:30 What is Problematic About MAP\n34:50 Requirements of Therapists vs Mindset Coaches\n45:35 How to Find the RIGHT Therapist\n58:12 Best Therapy for Cult Survivors\n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-12-02T16:00:15Z",
      "duration": "01:11:36",
      "explicit": false,
      "youTubeId": "PmiHaPDq3fs",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=PmiHaPDq3fs"
      }
    },
    {
      "id": "2b38d948-6099-4cb1-abb5-2c5d8b9275db",
      "title": "Are Twin Flames Even Real?  The Twin Flames Universe SCAM",
      "description": "The concept of Twin Flames has recently risen in popularity.  People looking for The One search for answers to their love lifes, only to have that longing be preyed upon and exploited.  Today we dive into the religion, spirituality and history behind the concept of Twin Flames and try to answer the question: Is this even real?\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  My statements are alleged and or my opinion.\n\nCHAPTERS:\n\n0:00 Intro\n01:49 Single Mother Story\n05:40 Intention of Video\n08:13 Differences Between Twin Flames and Soulmates\n10:40 How To Know You\u0027ve Met Your Twin Flame\n12:27 Dangers of Online Spiritual Gurus\n13:18 Ancient Egyptian Mythology\n15:00 Greek Mythology\n18:14 Vedic Ideology\n18:43 Hindu Beliefs\n19:05 Christian Symbolism\n19:35 Occult Theories\n20:35 My Opinion and Conclusion\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-11-30T03:20:59Z",
      "duration": "00:28:53",
      "explicit": false,
      "youTubeId": "M8qeWPFs3sE",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=M8qeWPFs3sE"
      }
    },
    {
      "id": "9f56504a-ea78-497c-ae3e-9b1a63bf658a",
      "title": "Does Twin Flames Universe Promote TOXIC Relationships?  The Deeply Concerning Dynamics in the Cult",
      "description": "Allegedly, Jeff and Shaleia, the leaders of Twin Flames Universe have promoted toxic dynamics within their member\u0027s relationships.  Including stalking, harassing their potential partner\u0027s and even breaking up families.  Today we explore some of those dynamics and why they are dangerous and toxic,\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  My statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-11-25T02:58:28Z",
      "duration": "00:33:39",
      "explicit": false,
      "youTubeId": "jUw1rg34FF0",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jUw1rg34FF0"
      }
    },
    {
      "id": "46de1cb4-5c3b-41db-892b-e1876b8d7eda",
      "title": "Wait, I\u0027M IN A CULT?!  Why Twin Flames Universe is an Online Cult and How I Out of One: My Story",
      "description": "It\u0027s never easy to admit that you\u0027re in a cult.  It\u0027s challenging to come to that realization and even more difficult to talk about it openly-let alone expose the cult for what it is.  Today I do something I\u0027ve never done before: Share my story about being involved in an online spiritual cult, similar to the Twin Flames Universe.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\u0026t=0s\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-11-23T14:02:21Z",
      "duration": "00:44:37",
      "explicit": false,
      "youTubeId": "fsOISS2OIWQ",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fsOISS2OIWQ"
      }
    },
    {
      "id": "70843a9e-df23-4bfd-9dc3-c051e43ef64d",
      "title": "Twin Flames Universe Leaders DESPERATE to Save Face: Reacting to Jeff and Shaleia\u0027s Awful Response",
      "description": "What is the Twin Flames Universe?  And what is the new \u0022Netflix Documentary: Escaping The Twin Flame Universe\u0022 all about.  Well, it\u0027s a documentary featuring stories from the victims of the cults of The Twin Flames Universe. In today\u0027s video, we react to the response the cult leaders: Jeff and Shaleia and their inner circle have given.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.  Many of my statements are alleged and or my opinion.\n\nEmail me your story: erinfinleigh@gmail.com \n\nTWIN FLAMES UNIVERSE MANIPULATIVE TACTICS EXPOSED\nhttps://www.youtube.com/watch?v=IF3Cc0oBdLU\n\nTOP TEN SIGNS YOU\u0027RE IN A CULT\nhttps://www.youtube.com/watch?v=u681PbRoHnE\u0026t=3s\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2023-11-18T17:57:40Z",
      "duration": "00:59:44",
      "explicit": false,
      "youTubeId": "J5v45kmJMDs",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=J5v45kmJMDs"
      }
    },
    {
      "id": "b1d1ba5b-4f05-4d98-8f58-5f8e08023330",
      "title": "Top Ten Signs You\u0027re in a CULT: Twin Flames Universe, NXIVM Tactics EXPOSED",
      "description": "Last week we covered The Twin Flames Universe.  Today we are going to do a follow up video to expose the tactics used by cults like this one.  If you fear you are in a cult or are worried a friend could have been manipulated into a cult, please watch or show them this video.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nRESOURCES: \n\nCULT EXPERT Stephen Hassan\u0027s Website\nhttps://freedomofmind.com/\n\nhttps://www.citizen.digital/news/how-do-i-know-im-in-a-cult-14-telltale-signs-to-look-out-for-n318604\n\nhttps://medium.com/@steveinadelaide/unmasking-the-power-of-thought-terminating-clich%C3%A9s-162ba929589c\n\n\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2023-11-16T18:09:19Z",
      "duration": "00:22:30",
      "explicit": false,
      "youTubeId": "u681PbRoHnE",
      "subjects": [
        "Twin Flames Universe",
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=u681PbRoHnE"
      }
    },
    {
      "id": "9d5088f4-2ae9-4ca3-a78d-c2def6329c2a",
      "title": "Twin Flames Universe: The Manipulative Tactics of The Cult Leaders",
      "description": "What is the Twin Flames Universe?  And what is the new \u0022Netflix Documentary: Escaping The Twin Flame Universe\u0022 all about.  Well, it\u0027s a documentary featuring stories from the victims of the cults of The Twin Flames Universe. In today\u0027s video, we explore exactly what manipulative tactics the cult leaders used to reel people in, control them and how it escalated to the point it did.  I hope you enjoy today\u0027s video exploring this spiritual cult.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin\n\nFind me on IG!\ninstagram.com/let_the_fresh_erin",
      "release": "2023-11-11T00:11:21Z",
      "duration": "00:35:21",
      "explicit": false,
      "youTubeId": "IF3Cc0oBdLU",
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IF3Cc0oBdLU"
      }
    },
    {
      "id": "effd3ecb-7fbe-486a-9450-7348e1f1b71c",
      "title": "DEATH AT THE SPA: Body Found in Parking Lot Trunk: The Gruesome Details",
      "description": "What would you do if you went for a Spa Day and learned there was a dead body found just outside in the trunk of someone\u0027s car?  Would you be worried the killer was in the spa with you, waiting to find you in a vulnerable moment?  Today we dive deep into the cult behind the death and murder of a young woman, whose body was found outside Jeju Spa in a suburb of Atlanta.\n\nRESOURCES:\n\nhttps://www.atlantanewsfirst.com/2023/09/14/several-arrested-connection-body-found-trunk-outside-gwinnett-spa-police-say/\n\nhttps://www.fox5atlanta.com/news/soldiers-christ-woman-found-trunk-car-gwinnnett-county-arrest-update\n\nhttps://www.11alive.com/article/news/crime/gwinnett-county-soldiers-christ-woman-video-torture-sehee-cho/85-1cde9415-32e1-4f2b-ba33-7a7e315c90ac\n\nhttps://www.11alive.com/article/news/crime/gang-charge-for-suspects-duluth-body-found-trunk-cult/85-bb0b9df8-a934-4ad5-a94c-0df01746c87c\n\nhttps://knewz.com/soldiers-of-christ-joonho-lee-abuse-murder-georgia-gwinnett-county/\n\nhttps://religionunplugged.com/news/2023/4/7/netflix-show-in-the-name-of-god-a-holy-betrayal-exposes-cults-thriving-in-south-korea\n\nSUBSCRIBE to Let The Fresh Erin!\nhttps://www.youtube.com/@UCdUiO-KWP-u0ytmOSoWm_-g \n\nLet The Fresh Erin is a True Crime and Cult Deep Dive channel dedicated to sharing victims stories and inspire empathy towards the victims of cults.  It\u0027s so easy for us to form opinions and pass judgements based on our conditioning, but this channel\u0027s purpose is to inspire you to take a deep breathe, open a window (and your mind) to Let The Fresh Erin",
      "release": "2023-11-03T17:58:24Z",
      "duration": "00:18:51",
      "explicit": false,
      "youTubeId": "YJknt7H-W6k",
      "subjects": [
        "Soldiers of Christ"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YJknt7H-W6k"
      }
    },
    {
      "id": "7b8b7045-38f5-4faf-84b3-f89da072f410",
      "title": "Jesus Was a Womanizer?  The Strange Beliefs and Horrible Murders in Marcus Wesson\u0027s House of Horrors",
      "description": "Known as The Vampire King of Fresno, he married his daughters and nieces, and kept the away from other people.  He believed he was Jesus: but also believed he was a Vampire.  He also murdered his entire family when he was about to be exposed.  He ran a small cult for years behind closed doors, so when those doors opened, he decided he had to destroy all evidence that he was an incestuous cult leader.  Today we take a peak inside Marcus Wesson\u0027s house of horrors and uncover the truth under the lies.\n\n*DISCLAIMER: This video is for entertainment purposes only.  All opinions expressed are not meant to malign anyone against any person, belief or entity.  Viewer discretion is advised.\n\nRESOURCES:\n\nhttps://lightsonpod.medium.com/the-vampire-king-of-fresno-debd87792cd6\nhttps://www.cnn.com/2005/LAW/04/22/wesson/\nhttps://www.investigationdiscovery.com/crimefeed/murder/marcus-wesson-believed-jesus-was-a-vampire-married-6-of-his-daughters-murdered-9-of-his-kids\nhttps://murderpedia.org/male.W/w/wesson-marcus.htm\nhttps://allthatsinteresting.com/marcus-wesson",
      "release": "2023-10-21T13:40:50Z",
      "duration": "00:28:33",
      "explicit": false,
      "youTubeId": "8H90MSkRPXI",
      "subjects": [
        "Marcus Wesson"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8H90MSkRPXI"
      }
    },
    {
      "id": "695c87fe-712c-4bd0-a81a-2caff43df6b7",
      "title": "The Vampire Cult Murders: They Drank Blood to Become Immortal?! | Rod Ferrell and his Creepy Cult",
      "description": "What happens when a small Christian town gets infultrated by a Vampire Cult? Well, people die.  Today we share the story of Rod Ferrell, and how he got involved in a creepy Vampire Cult and ended up murdering multiple people.\n\n*DISCLAIMER: This video is for entertainment purposes only.  It is not meant to malign or judge any one person, entity or group*\n\nRESOURCES:\nhttps://www.mylifetime.com/shows/killer-kids/season-4/episode-8\n\nhttps://www.youtube.com/watch?v=VRddrXzwgY0\n\nhttps://www.ranker.com/list/rod-ferrell-facts/nathan-gibson\n\nhttps://www.today.com/life/holidays/are-vampires-real-rcna35691",
      "release": "2023-10-13T22:01:16Z",
      "duration": "00:18:30",
      "explicit": false,
      "youTubeId": "4gvWEW30Wsg",
      "subjects": [
        "Rod Ferrell"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4gvWEW30Wsg"
      }
    },
    {
      "id": "ff112655-c46c-492c-aee3-120534983b90",
      "title": "Forced to Sleep with 1800 Men?! The Satanic Black Magic Wales Cult | Colin Batley \u0026 The Book of Law",
      "description": "A small, quiet town in Wales had a deep dark secret.  Hidden in plain sight in a cul-de-sac was a Satanic Black Magic.  The members engaged in orgies, and unspeakable acts against minors.  Learn all about this disturbing cult and the man who lead it in this video.\n\n*DISCLAIMER:  This video is for entertainment purposes only*\n\nResources:\n\nhttps://www.walesonline.co.uk/news/wales-news/carmarthen-kidwelly-colin-batley-police-20837645\n\nhttps://www.bristolpost.co.uk/news/uk-world-news/bristol-prostitutes-satanic-sex-cult-2262149\n\nhttps://mythoughtsbornfromfire.wordpress.com/2022/02/11/on-the-colin-batley-case-satanic-panic-and-the-vilification-of-the-occult/\n\nhttps://www.walesonline.co.uk/news/wales-news/satanic-sex-cult-face-years-1845296\n\nhttps://www.theguardian.com/uk/2011/mar/09/paedophile-satanic-cult-batley-kidwelly\n\nNightmare in Suburbia:\nhttps://www.amazon.com/gp/video/detail/amzn1.dv.gti.a426b4e0-0a4b-4e1c-8482-fd79bcd566ab?ref_=imdbref_tt_wbr_pvs_piv\u0026tag=imdbtag_tt_wbr_pvs_piv-20",
      "release": "2023-10-06T19:45:21Z",
      "duration": "00:32:31",
      "explicit": false,
      "youTubeId": "zaeF-lk9dYA",
      "subjects": [
        "Colin Batley"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zaeF-lk9dYA"
      }
    },
    {
      "id": "00148795-ee9d-44bc-a673-4847a5c720fb",
      "title": "America\u0027s Most Diabolical Serial Killer: Exposing the Double Life and Creepy Murders of Israel Keyes",
      "description": "From Cult to Killer...the story of Israel Keyes has rarely been told.  After leaving a cult, Israel went on a murder-spree for over a decade.  He was known as a doting boyfriend and father but his secrets were disturbing even for the most hardcore true crime fans.  Let\u0027s explore his life, the cults he and his family hopped to and from; and crimes in today\u0027s episode of Let The Fresh Erin.\n\n* DISCLAIMER:  This video is for entertainment purposes only.  It includes many of my own opinions and does not imply that those opinions are facts.  Please use discretion before watching.\n\nI want to credit fellow creators for making FANTASTIC videos on this topic as well; they all go into a lot more detail on the crimes themselves:\n\nFor an incredible in-depth exploration of Israel Keyes, please enjoy the True Crime BS Podcast:\n\nhttps://open.spotify.com/show/073muZEPrJTiwYvsDplJRp\n\nFor more GRUESOME details on these cases, please go to these true crime channels:\n\n@annieelise \nhttps://www.youtube.com/watch?v=mXy6VQPl9A4\n\n@DanielleKirsty11 \nhttps://www.youtube.com/watch?v=hVfJ5XPaWwY\n\nOTHER SOURCES:\nhttps://www.seattletimes.com/seattle-news/alaska-serial-killer-told-police-he-targeted-victims-boyfriend/\n\nhttps://www.adn.com/alaska-news/crime-courts/2018/05/18/unsealed-interviews-detail-two-lives-of-alaska-serial-killer-israel-keyes/\n\nhttps://www.fbi.gov/video-repository/israel-keyes-interview-november-29-2012.mp4/view\n\nhttps://www.spokesman.com/stories/2013/jul/14/lawmaker-rejects-views-of-grandfathers-church/\n\nTimeline:\nhttps://www.timetoast.com/timelines/israel-keyes-true-crime-bullshit-timeline\n\nNote:\nhttps://www.dailymail.co.uk/news/article-2274650/Israel-Keyes-The-chilling-page-note-body-Alaska-serial-killer.html",
      "release": "2023-09-28T16:55:21Z",
      "duration": "00:39:33",
      "explicit": false,
      "youTubeId": "0F_u7smqJMI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0F_u7smqJMI"
      }
    }
  ]
}