{
  "_ts": 0,
  "id": "3f25e6e4-597d-4940-ac96-75e948eb45c8",
  "name": "Let’s Talk Memoir",
  "spotifyId": "6iLAEI8gy00aLBXHR1C20U",
  "appleId": 1612365112,
  "episodes": [
    {
      "id": "9893507a-b4e1-46f6-9ab7-9bd6ee1fe95d",
      "title": "184. Writing About Childhood Sexual Abuse without Reliving It featuring Dr. Stacey Hettes",
      "description": "Dr. Stacey Hettes joins Let’s Talk Memoir for a conversation about therapeutic writing and how she crafted a memoir about childhood sexual abuse without revictimizing herself, metabolizing childhood trauma, inviting readers into our physiological response, the role of our limbic systems, deciding whether to share specifics about abuse in our manuscripts, italicizing difficult material for readers so they can decide, approaching a story of child sexual abuse in a protective way, putting therapy into our memoirs, demonstrating our character’s progress in our narrative, remembering we can write beautifully about hard things, and her new memoir Dispatches from the Couch. Also in this episode: -sharing a memoir with family -the amygdala and child trauma victims -deciding whether to share specifics about abuse Books mentioned in this episode: -Bodywork by Melissa Febos -Wintering by Catherine May -Writing a Woman’s Life by Caroline G. Heilbrun -Learning to Walk in the Dark by Barbara Brown Taylor Professor Stacey Hettes teaches biology and neuroscience to undergraduates eager to enter the worlds of science and medicine at Wofford College in Spartanburg, SC. She holds a PhD from the University of California, Riverside, and is the youngest winner to date of the Milliken Award for Excellence in the Teaching of Science. Her classes are difficult because life is difficult. They are also full of wonder, joy, and triumph because, like her students, she is a hard-working seeker. She relishes in shared struggle and shared discovery, even when the topic is long-buried child sexual abuse. Reemerging from the shadows of her past was only possible once she resolved to carry the story found in her Debut memoir, Dispatches from the Couch, into the light. Connect with Stacey: Website: https://www.staceyhettes.com/ Facebook: Stacey Hettes, https://www.facebook.com/stacey.hettes Instagram: @staceyhetteswrites, https://www.instagram.com/staceyhetteswrites/ If you\u0027d like to know more about Wofford College: https://www.wofford.edu/ Books may be purchased from all major outlets – Ronit’s writing has appeared in The Atlantic, The Rumpus, The New York Times, Poets \u0026 Writers, The Iowa Review, Hippocampus, The Washington Post, Writer’s Digest, American Literary Review, and elsewhere. Her memoir WHEN SHE COMES BACK about the loss of her mother to the guru Bhagwan Shree Rajneesh and their eventual reconciliation was named Finalist in the 2021 Housatonic Awards Awards, the 2021 Indie Excellence Awards, and was a 2021 Book Riot Best True Crime Book. Her short story collection HOME IS A MADE-UP PLACE won Hidden River Arts’ 2020 Eludia Award and the 2023 Page Turner Awards for Short Stories. She earned an MFA in Nonfiction Writing at Pacific University, is Creative Nonfiction Editor at The Citron Review, and teaches memoir through the University of Washington\u0027s Online Continuum Program and also independently. She launched Let\u0027s Talk Memoir in 2022, lives in Seattle with her family of people and dogs, and is at work on her next book. More about Ronit: https://ronitplank.com Subscribe to Ronit’s Substack: https://substack.com/@ronitplank Follow Ronit: https://www.instagram.com/ronitplank/ https://www.facebook.com/RonitPlank https://bsky.app/profile/ronitplank.bsky.social Background photo credit: Photo by Patrick Tomasso on Unsplash Headshot photo credit: Sarah Anne Photography Theme music: Isaac Joel, Dead Moll’s Fingers",
      "release": "2025-07-15T08:00:00Z",
      "duration": "00:45:06.1210000",
      "explicit": false,
      "spotifyId": "1IcBquKnfzLzynz92l34ji",
      "appleId": 1000717306285,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IcBquKnfzLzynz92l34ji",
        "apple": "https://podcasts.apple.com/podcast/184-writing-about-childhood-sexual-abuse-without-reliving/id1612365112?i=1000717306285"
      }
    },
    {
      "id": "0c1456c5-5860-48a8-aaeb-75b76c7cd348",
      "title": "37. Sharing A Dangerous Story featuring Erika Bornman",
      "description": "Erika Bornman joins Let’s Talk Memoir for a conversation about her experience escaping from KwaSizabantu and her participation in News24’s exposé alleging this strict Christian mission is a cult is a cult riddled with abuse, the compassion she found writing about loved ones with whom she has longstanding conflict, how she approached crafting emotionally difficult passages, the legal advice she got about including controversial material in her memoir Mission of Malice, and why our voice matters.\n\n \n\nAlso in this episode: \n\n-the importance of therapy for memoirists\n\n-working with hard deadlines\n\n-building empathy through stories\n\n \n\nMemoirs mentioned in this episode:\n\nAngela’s Ashes by Frank McCourt\n\nThe Choice by Dr Edith Eger\n\nMan’s Search for Meaning by Viktor Frankl\n\nThe Witness Wore Red by Rebecca Musser\n\nLost Boy by Brent Jeffs and Maia Szalavitz\n\nWholly Unravelled by Keele Burgin\n\nUnfollow by Meghan Phelps-Roper\n\nI Know Why the Caged Bird Sings by Maya Angelou \n\nAlways Another Country by Sisonke Msimang\n\nBoy on the Run by Welcome Mandla Lishivha\n\nKilling Karoline by Sara-Jayne King\n\nMad Bad Love by Sara-Jayne Makwala King\n\n \n\nErika Bornman has carved a career for herself in magazine publishing as a writer and editor, despite her lack of formal training. Her memoir is her first book and an important element in her quest to make the world a safer place for children. She lives in Cape Town, South Africa, with her two cats.\n\nAbout her memoir Mission of Malice:\n\nWhen Erika Bornman was nine years old, her family joined, and ultimately moved to, KwaSizabantu, a Christian mission in South Africa – a place touted as a nirvana, founded on egalitarian values. But something sinister lurks below the veneer of piousness here.\n\nLife at KwaSizabantu is hard. Christianity is used to justify harsh punishments and congregants are forced to repent for their sins. Threats of physical violence ensure adherence to stringent rules. Parents are pitted against children. Friendships are discouraged. Isolated and alone, Erika lives in constant fear of eternal damnation.\n\nAt 17, her grooming at the hands of a senior mission counsellor begins. For the next five years, KwaSizabantu wages emotional, psychological and sexual warfare on her, until, finally, she manages to break free and walk away at the age of 21.\n\nEscaping a restrictive religious community is difficult, but rehabilitation into ‘normal’ life after a decade of ritual humiliation, brainwashing and abuse is much more painful, as Erika soon discovers. She cannot ignore her knowledge of the grievous human-rights abuses being committed at KwaSizabantu, and so she embarks on a quest to expose the atrocities. With her help, News24 launches a seven-month investigation, culminating in a podcast that will go on to win the internationally renowned One World Media Award for Radio and Podcast in 2021.\n\nIn Mission of Malice: My Exodus from KwaSizabantu, Erika chronicles her journey from a fearful young girl to a fierce activist determined to do whatever it takes to save future generations and find personal redemption and self-acceptance.\n\n \n\nConnect with Erika:\n\nTwitter: https://twitter.com/Ebee40\n\nInstagram: https://www.instagram.com/erikabornman/\n\nWebsite: www.erikabornman.com\n\nGet Erika’s book: https://www.amazon.com/Mission-Malice-My-exodus-KwaSizabantu-ebook/dp/B09B45VMP6\n\n \n\n--\n\nRonit Plank is a writer, teacher, and editor whose work has been featured in The Atlantic, The Washington Post, The New York Times, Writer’s Digest, The Rumpus, American Literary Review, Hippocampus, The Iowa Review, and elsewhere. Her memoir WHEN SHE COMES BACK about the loss of her mother to the guru Bhagwan Shree Rajneesh and their eventual reconciliation was named a 2021 Best True Crime Book by Book Riot and was a Finalist in the National Indie Excellence Awards, the Housatonic Book Awards, and the Book of the Year Awards. Her fiction and creative nonfiction have been nominated for Pushcart Prizes, the Best of the Net, and the Best Microfiction Anthology, and her short story collection HOME IS A MADE-UP PLACE won Hidden River Arts’ Eludia Award. She is creative nonfiction editor at The Citron Review and lives in Seattle with her family where she is working on her next book.\n\n \n\nMore about Ronit: https://ronitplank.com\n\nSign up for monthly podcast and writing updates: https://bit.ly/33nyTKd\n\nFollow on Instagram: https://www.instagram.com/ronitplank/\n\nMore about WHEN SHE COMES BACK, a memoir: https://ronitplank.com/book/\n\nMore about HOME IS A MADE-UP PLACE, a short story collection: https://ronitplank.com/home-is-a-made-up-place/\n\n\n\n\n\nConnect with Ronit:\n\nhttps://www.instagram.com/ronitplank/\n\nhttps://twitter.com/RonitPlank\n\nhttps://www.facebook.com/RonitPlank\n\n \n\nBackground photo: Canva\n\nHeadshot photo credit: Sarah Anne Photography\n\nTheme music: Isaac Joel, Dead Moll’s Fingers",
      "release": "2023-04-04T08:00:00Z",
      "duration": "00:44:13",
      "explicit": false,
      "spotifyId": "7fW6xZJIlX3V9K5A2a63YW",
      "appleId": 1000607301530,
      "subjects": [
        "Kwasizabantu"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7fW6xZJIlX3V9K5A2a63YW",
        "apple": "https://podcasts.apple.com/podcast/37-sharing-a-dangerous-story-featuring-erika-bornman/id1612365112?i=1000607301530"
      }
    },
    {
      "id": "c8628625-65d1-446b-97fb-cb3ece0a600f",
      "title": "17. The Role of the Reflective Narrator featuring Lily Dunn",
      "description": "Lily Dunn joins Let’s Talk Memoir for a conversation about the impact her father leaving to follow the guru Bhagwan Shree Rajneesh had on her childhood, when she knew it was time to write her memoir Sins of the Father, stepping into her role as reflective narrator, creating tension, family members in our work, and understanding as a means to healing.\n\n \n\nAlso in this episode:\n\n-writing to find answers\n\n-our early experiences as shadows in our lives\n\n-staying true to your purpose \n\n \n\nBooks mentioned in this episode:\n\nEducated by Tara Westover\n\nWhip Smart by Meliss Febos\n\nYour Voice in My Head by Emma Forrest\n\nBusy Being Free by Emma Forrst\n\n \n\nLily Dunn writes fiction and nonfiction. Her literary memoir, Sins of My Father: A Daughter, A Cult, A Wild Unravelling is published by Weidenfeld \u0026 Nicolson (March 2022), and her novel, Shadowing the Sun, by Portobello Books (2007). She has personal essays in Granta, Litro, Hinterland, MIRonline and The Real Story, and is a regular writer for Aeon magazine. She is co-editor of A Wild and Precious Life: Recovery Anthology, with Zoe Gilbert (Unbound 2021). She teaches creative writing at Bath Spa University in the UK and co-runs London Lit Lab. \n\n \n\nConnect with Lily:\n\nTwitter: https://twitter.com/lilydunnwriter\n\nInstagram: https://www.instagram.com/lilydunnwriting/\n\nWebsite: lilydunn.co.uk\n\nLondon Lit Lab: londonlitlab.co.uk\n\nUK Book Link: https://smarturl.it/SinsOfMyFatherHB\n\nUS Book Link: https://geni.us/SinsOfMyFatherUS\n\n--\n\nRonit is a teacher and speaker whose essays, creative nonfiction, and fiction have been featured in The Atlantic, The Rumpus, The New York Times, The Iowa Review, The Washington Post, Writer’s Digest, American Literary Review, and elsewhere. Her memoir WHEN SHE COMES BACK about the loss of her mother to the guru Bhagwan Shree Rajneesh and their eventual reconciliation was named a 2021 Best True Crime Book by Book Riot and was a Finalist in the National Indie Excellence Awards, the Housatonic Book Awards, and the Book of the Year Awards. Her short story collection HOME IS A MADE-UP PLACE won Hidden River Arts’ 2020 Eludia Award and will be published in 2023. She is creative nonfiction editor at The Citron Review and lives in Seattle with her family where she is working on her next book.\n\n\nMore about Ronit: https://ronitplank.com\n\nMore about WHEN SHE COMES BACK, a memoir: https://ronitplank.com/book/\n\nFollow Ronit: https://www.instagram.com/ronitplank/\n\nhttps://twitter.com/RonitPlank\n\nhttps://www.facebook.com/RonitPlank\n\nBackground photo: Canva Headshot photo credit: Sarah Anne\n\nPhotography Theme music: Isaac Joel, Dead Moll’s Fingers\n\n ",
      "release": "2022-11-22T09:00:00Z",
      "duration": "00:33:07",
      "explicit": false,
      "spotifyId": "0uPFnZRiRkg3wIPrnZBQeo",
      "appleId": 1000587090280,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0uPFnZRiRkg3wIPrnZBQeo",
        "apple": "https://podcasts.apple.com/podcast/17-the-role-of-the-reflective-narrator-featuring-lily-dunn/id1612365112?i=1000587090280"
      }
    }
  ]
}