{
  "id": "c7d42ca2-c7a1-44a8-9a05-4be416fd70b4",
  "name": "Let\u0027s Go To Court!",
  "spotifyId": "13K8XKhgpoNqjY8XzHtcTm",
  "appleId": 1353728357,
  "episodes": [
    {
      "id": "9f84f978-37ff-4c9e-accd-a51061e0ebca",
      "title": "175: A Cult \u0026 the Murder of Doris Angleton",
      "description": "Sherry Shriner had a wacky belief: That alien lizards had come to Earth, shape shifted into human form, and were conspiring to put the antichrist in power. Sherry shared this belief online, and incredibly, her views gained traction. Soon, thousands of people came to believe the “prophet” Sherry Shriner’s teachings. Steven Mineo and his girlfriend Barbara Rogers were two of Sherry’s loyal followers. But when Barbara made a Facebook post about steak tartare, their online community turned on them. Then Kristin tells us about the Angleton family. The Angletons had it all. They lived in an affluent area of Houston, Texas. They belonged to the best country club. They hobnobbed with all the right people. Bob Angleton worked long hours as a bookie. His hard work meant big money. But the money couldn’t make up for the problems in Bob and Doris’ marriage. So in February of 1997, Doris asked Bob for a divorce. Two months later, police discovered Doris Angleton dead in her home. And now for a note about our process. For each episode, Kristin reads a bunch of articles, then spits them back out in her very limited vocabulary. Brandi copies and pastes from the best sources on the web. And sometimes Wikipedia. (No shade, Wikipedia. We love you.) We owe a huge debt of gratitude to the real experts who covered these cases. In this episode, Kristin pulled from: An episode of The Dead Wives Club titled, “The Bookie’s Wife” “The Bookmaker’s Wife,” by Skip Hollandsworth for Texas Monthly An episode of Power Privilege and Justice titled, “The Murder of Doris Angleton” “Doris Angleton” entry on Wikipedia In this episode, Brandi pulled from: “Online Alien Reptiles” episode Deadly Cults “Man\u0027s Online Feud With Reptile-Fearing Cult Ends In Bizarre Murder” by Erik Hawkins, Oxygen “Reptile Cult Feud Ends in Death” by Kelly Weill, The Daily Beast “It looked like a simple domestic murder. Then police learned about the alien reptile cult.” by Kyle Swenson, The Washington Post “Homicide Trial: Woman Claims Online Alien Cult Led to Deadly Shooting” by Carmella Mataloni, WNEP16 News “Tobyhanna woman convicted in cult-related slaying” The Pocono Record “She killed her boyfriend because of an alien cult – and was sentenced to up to 40 years” by Ryan W. Miller, USA Today “Barbara Rogers Loses Murder Appeal” by Alberto Luperon, LawandCrime.com YOU’RE STILL READING? My, my, my, you skeezy scunch! You must be hungry for more! We’d offer you some sausage brunch, but that gets messy. So how about you head over to our Patreon instead? (patreon.com/lgtcpodcast). At the $5 level, you’ll get 19\u0026#43; full length bonus episodes, plus access to our 90’s style chat room!",
      "release": "2021-05-26T11:00:00Z",
      "duration": "02:19:29.5680000",
      "explicit": true,
      "spotifyId": "30RlpI8MZaXKngVnPNo5CR",
      "appleId": 1000523156127,
      "subjects": [
        "Sherry Shriner"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/30RlpI8MZaXKngVnPNo5CR",
        "apple": "https://podcasts.apple.com/podcast/a-cult-the-murder-of-doris-angleton/id1353728357?i=1000523156127"
      }
    }
  ]
}