{
  "_ts": 0,
  "id": "baa186e5-7147-4f61-abf6-a66ed2754866",
  "name": "Let\u0027s Talk About Sects",
  "spotifyId": "5TDbOP1GQRfTio7atRjkeX",
  "appleId": 1286328757,
  "youTubeChannelId": "UCdGCgxr3Sq61gVTRyH-5Ipg",
  "episodes": [
    {
      "id": "0437f7f8-5552-4bf1-82cd-94367cdc5659",
      "title": "ISKCON / Hare Krishnas – Part 2",
      "description": "When asked about the Hare Krishnas, most people will conjure images of dancing, chanting people with colourful robes and joyful dispositions. Members of the general public, whom Hare Krishnas refer to as \u0027karmis\u0027, may have encountered devotees through their vegetarian food offerings at music festivals or city restaurants. Their anti-LGBTQI\u002B and patriarchal beliefs, as well as the darker aspects of their history – including horrifying stories of abuse, and even murders – come as a surprise to many.\nFull research sources listed here. You can support us on Patreon. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.\nLinks:\nSrila Prabhupada’s arrival in the USA — by Ramai Swami, 27 September 2021Authoritarian Culture and Child Abuse in ISKCON — by Nori J. Muster, Cultic Studies Review, 3(1), 2004Children of ISKCON vs. ISKCON complaint — Plaintiffs’ original petition in the Dallas lawsuit, Surrealist.org, filed 25 October 2001How I Once Was a Hare Krishna… — by Christopher Fici, Medium, 7 January 2023Holy Cow, Swami — documentary by Jacob Young, 1996History — ISKCON Child Protection Office, accessed January 2025Child Abuse in the Hare Krishna Movement: 1971-1986 — by E. Burke Rochford, Jr. with Jennifer Heinlein, ISKCON Communications Journal, Vol. 6, #1, June 1998Children of ISKCON vs. ISKCON Timeline — Surrealist.org (Nori Muster’s website), accessed January 2025Tortured Souls — by Mark Donald, Dallas Observer, 6 December 2001Dial Om for Murder — by John Hubner \u0026 Lindsey Gruson, Rolling Stone, Issue 497, 1987Religion: Control Stressed at Krishna Children’s School — by Eleanor Blau, The New York Times, 25 November 1973Why ISKCON Needs to be on Guard Against “Cultic Behavior” — by Anuttama Dasa, ISKCON News, 26 July 2024The Krishna Cult — by Paul Ford, Mad After Krishna, 1994 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.\n\n\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-02-18T13:15:00Z",
      "duration": "00:46:51",
      "explicit": false,
      "spotifyId": "5WbKDV9bRx3VnE8wqodtbu",
      "appleId": 1000693507295,
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5WbKDV9bRx3VnE8wqodtbu",
        "apple": "https://podcasts.apple.com/podcast/iskcon-hare-krishnas-part-2/id1286328757?i=1000693507295"
      }
    },
    {
      "id": "cac932a8-0d30-4a7c-a7c0-2392da72170c",
      "title": "ISKCON / Hare Krishnas – Part 1",
      "description": "When asked about the Hare Krishnas, most people will conjure images of dancing, chanting people with colourful robes and joyful dispositions. Members of the general public, whom Hare Krishnas refer to as \u0027karmis\u0027, may have encountered devotees through their vegetarian food offerings at music festivals or city restaurants. Their anti-LGBTQI\u0026#43; and patriarchal beliefs, as well as the darker aspects of their history – including horrifying stories of abuse, and even murders – come as a surprise to many. Part 2 is already available to Patreon supporters, and will be released on the main feed on Wednesday 19 February. Full research sources listed here . Links: Srila Prabhupada’s arrival in the USA — by Ramai Swami, 27 September 2021 Authoritarian Culture and Child Abuse in ISKCON — by Nori J. Muster, Cultic Studies Review, 3(1), 2004 Children of ISKCON vs. ISKCON complaint — Plaintiffs’ original petition in the Dallas lawsuit, Surrealist.org, filed 25 October 2001 How I Once Was a Hare Krishna… — by Christopher Fici, Medium, 7 January 2023 Holy Cow, Swami — documentary by Jacob Young, 1996 History — ISKCON Child Protection Office, accessed January 2025 Child Abuse in the Hare Krishna Movement: 1971-1986 — by E. Burke Rochford, Jr. with Jennifer Heinlein, ISKCON Communications Journal, Vol. 6, #1, June 1998 Children of ISKCON vs. ISKCON Timeline — Surrealist.org (Nori Muster’s website), accessed January 2025 Tortured Souls — by Mark Donald, Dallas Observer, 6 December 2001 Dial Om for Murder — by John Hubner \u0026 Lindsey Gruson, Rolling Stone, Issue 497, 1987 Religion: Control Stressed at Krishna Children’s School — by Eleanor Blau, The New York Times, 25 November 1973 Why ISKCON Needs to be on Guard Against “Cultic Behavior” — by Anuttama Dasa, ISKCON News, 26 July 2024 The Krishna Cult — by Paul Ford, Mad After Krishna, 1994 Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-02-11T13:15:00Z",
      "duration": "00:42:11.5000000",
      "explicit": false,
      "spotifyId": "7dSdtfuCyVSv08beK4ZkT5",
      "appleId": 1000691103550,
      "subjects": [
        "Hare Krishnas"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7dSdtfuCyVSv08beK4ZkT5",
        "apple": "https://podcasts.apple.com/podcast/iskcon-hare-krishnas-part-1/id1286328757?i=1000691103550"
      }
    },
    {
      "id": "93496a94-2622-4aee-a7eb-534c8fc95ae6",
      "title": "Interview Episode: Two by Twos Update",
      "description": "Let’s Talk About Sects did a deep dive episode about the Two by Twos, also known as The Truth, in October 2020. In the years since we recorded, huge numbers of followers in the USA in particular have left as more and more allegations of child sexual abuse have been made against workers, and the FBI is currently investigating the organisation. It was never Abbi and Mike Prussack\u0027s intention to become involved in advocacy work, but once the couple became aware of the extent of the abuse and how it was concealed, there didn’t seem to be an option other than putting the real truth out into the world and attempting to create some transparency where there was none before. Abbi and Mike have been releasing information that the Two by Twos have kept hidden for decades, and Abbi co-founded a not-for-profit called Voices for the Truth to help provide education and resources to victim-survivors of the organisation. You can support us on Patreon . Sarah Steel\u0027s debut book Do As I Say is available on audiobook now . Links: Voices for the Truth — victim-survivor-led NFP co-founded by Abbi Seeking Victim Information in 2x2 Investigation — FBI page with links to form to submit tips Voices for the Truth RAINN Hotline: 928-756-8654 (US only) Ex-2x2 Support Group on Facebook — this group membership is limited to ex-members or those who are in the process of leaving Ex-2x2 Support Group on YouTube 2x2 Church Updates — current events page Our 2x2 Story — Mike \u0026 Abbi\u0027s TikTok Kyle Hanks\u0027 YouTube — channel discussing many aspects of 2x2 life Timeline of events and publicly named perpetrators since the release of the Dean Bruer letter Bridges and Balm — Survivor care organisation with funding available internationally to help with therapeutic care Preserving the Truth — by Cherie Kropp-Ehrig, Clarion Call Publishing, 2022 (also on Amazon ) Telling the Truth — Cherie Kropp-Ehrig\u0027s informational website With thanks to The Finance and Property Survival Guide , presenting partner of Let\u0027s Talk About Sects. Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-02-06T13:15:00Z",
      "duration": "01:35:28.0260000",
      "explicit": false,
      "spotifyId": "6EuVJTUBHTPJd11Mb5mcKL",
      "appleId": 1000689635074,
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6EuVJTUBHTPJd11Mb5mcKL",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-two-by-twos-update/id1286328757?i=1000689635074"
      }
    },
    {
      "id": "78dc84a2-6701-4f9a-9d52-91e7041775af",
      "title": "Interview Episode: Geelong Revival Centre with Richard Baker",
      "description": "Richard Baker\u0027s Pray Harder podcast for LiSTNR\u0027s Secrets We Keep series delves into the world of the Geelong Revival Centre, which Richard describes as “one of Australia’s most extreme” Pentecostal churches. The GRC has the same roots as the Revival Fellowship , and its pastor was a man named Noel Hollins who died in April 2024 after 65 years in leadership. Pray Harder shares some shocking stories of a number of former members, and it’s a vital listen. You can support us on Patreon . Sarah Steel\u0027s debut book Do As I Say is available on audiobook now . With thanks to The Finance and Property Survival Guide , presenting partner of Let\u0027s Talk About Sects. Links: Secrets We Keep: Pray Harder podcast Stop Religious Coercion Australia — Facebook page Southern Ocean Media — Richard Baker\u0027s production company If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia (via www.cifs.org.au), and you can find resources outside of Australia with the International Cultic Studies Association (via www.icsahome.com). Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-01-07T13:15:21Z",
      "duration": "00:45:47.6370000",
      "explicit": false,
      "spotifyId": "0NUHxCEKXnMf4bmmRXdfuJ",
      "appleId": 1000683020623,
      "subjects": [
        "Geelong Revival Centre"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NUHxCEKXnMf4bmmRXdfuJ",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-geelong-revival-centre-with-richard/id1286328757?i=1000683020623"
      }
    },
    {
      "id": "d5f787f8-c46f-477e-9c26-d5a5af5138b1",
      "title": "The Jesus Christians – Part 2",
      "description": "In Melbourne you might have picked up a book or a comic from a Jesus Christian outside Flinders Street Station, or you could have seen their religious graffiti messages along Sydney’s railway lines. But while they portray themselves as an altruistic Christian community living life by faith and rejecting the money motivation of work, former members have been shunned and demonised, and parents tell heartbreaking stories of losing their relationship with their child after they have joined the Jesus Christians. Full research sources listed here . You can support us on Patreon . Sarah Steel\u0027s debut book Do As I Say is available on audiobook now . With thanks to The Finance and Property Survival Guide , presenting partner of Let\u0027s Talk About Sects. Links: JC History 1981 - 1996 — Jesus Christians official website, accessed December 2024 Australians find godliness in latrines and sewers of Madras — by Tim McGirk, The Independent, 25 June 1994 Kidneys for Jesus — Jon Ronson’s 2003 documentary Comments on Kidneys for Jesus — The Jesus Christians’ response to Jon Ronson’s documentary, accessed December 2024 Blood sacrifice and Blood sacrifice (part two) — by Jon Ronson, The Guardian, 6 April 2002 Kicked Out — by Alan, Making it Real, June 2013 Why did we leave the Jesus Christians, led by Dave McKay? — by Sue, Making it Real, undated The Rise and Fall of the Jesus Christians — by Ross, Making it Real, 2013 Australian Christian group fights claim it was linked to leader of Kenya starvation massacre doomsday cult — by Elle Hardy, The Guardian, 28 November 2023 The Guardian\u0027s Shakahola Article by Elle Hardy | The Good, the Bad, and The Ugly — the Jesus Christians’ commentary on The Guardian article, undated Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-12-24T13:15:52Z",
      "duration": "00:56:06.9480000",
      "explicit": true,
      "spotifyId": "1SA6YFhB2rP4nKcfuuABB9",
      "appleId": 1000681559605,
      "subjects": [
        "Jesus Christians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1SA6YFhB2rP4nKcfuuABB9",
        "apple": "https://podcasts.apple.com/podcast/the-jesus-christians-part-2/id1286328757?i=1000681559605"
      }
    },
    {
      "id": "54686a22-4cc2-4a09-9fd3-c20004b2dd39",
      "title": "The Jesus Christians – Part 1",
      "description": "The media coverage of the Jesus Christians tends to outweigh their size. Most people who have heard of them recognise the name ‘The Kidney Cult’, derived from an initiative where numerous members have donated one of their kidneys to a stranger. What may be surprising is that the person who first suggested that name was the Jesus Christians’ founder himself, Dave Mckay. Part 2 is already available to Patreon supporters, and will be released on the main feed on Wednesday 25 December. Happy holidays all! Full research sources listed here . You can support us on Patreon . Sarah Steel\u0027s debut book Do As I Say is available on audiobook now . With thanks to The Finance and Property Survival Guide , presenting partner of Let\u0027s Talk About Sects. Links: JC History 1981 - 1996 — Jesus Christians official website, accessed December 2024 Australians find godliness in latrines and sewers of Madras — by Tim McGirk, The Independent, 25 June 1994 Kidneys for Jesus — Jon Ronson’s 2003 documentary Comments on Kidneys for Jesus — The Jesus Christians’ response to Jon Ronson’s documentary, accessed December 2024 Blood sacrifice and Blood sacrifice (part two) — by Jon Ronson, The Guardian, 6 April 2002 Why did we leave the Jesus Christians, led by Dave McKay? — by Sue, Making it Real, undated The Rise and Fall of the Jesus Christians — by Ross, Making it Real, 2013 Australian Christian group fights claim it was linked to leader of Kenya starvation massacre doomsday cult — by Elle Hardy, The Guardian, 28 November 2023 The Guardian\u0027s Shakahola Article by Elle Hardy | The Good, the Bad, and The Ugly — the Jesus Christians’ commentary on The Guardian article, undated Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-12-17T13:15:53Z",
      "duration": "00:52:39.4050000",
      "explicit": true,
      "spotifyId": "7uAcxnbZZCLGHM5chRUiBy",
      "appleId": 1000680694502,
      "subjects": [
        "Jesus Christians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7uAcxnbZZCLGHM5chRUiBy",
        "apple": "https://podcasts.apple.com/podcast/the-jesus-christians-part-1/id1286328757?i=1000680694502"
      }
    },
    {
      "id": "87579080-61f1-40a5-a562-6a85736a8ce4",
      "title": "Bonus Episode: A New Media Narrative at Decult",
      "description": "Sarah moderated a panel discussion at the recent Decult conference in Christchurch, New Zealand, entitled \u0027A new media narrative: Survivor-focussed cult reporting\u0027. The panel featured MISA survivor Bec Sonkkila, documentary filmmaker Natalie Malcon, RNZ investigative reporter Anusha Bradley, and media law Professor Ursula Cheer. This bonus episode is a recording of the session, courtesy of Decult, and you can access a package of recordings from the entire conference at decult.net/tickets . Full episode page here . You can support us on Patreon or with a one-off donation or merch purchase . Links: Decult conference — online session recording package available from the Decult website Tantric yoga guru Gregorian Bivolaru charged with human trafficking — AAP article in The Guardian for further reading about MISA, 29 November 2023 If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia (via www.cifs.org.au), and you can find resources outside of Australia with the International Cultic Studies Association (via www.icsahome.com). Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-12-03T13:15:30Z",
      "duration": "01:06:39.2680000",
      "explicit": true,
      "spotifyId": "56tMeslxsWU97uLa425ZHk",
      "appleId": 1000679076891,
      "subjects": [
        "Gregorian Bivolaru",
        "Human Trafficking",
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/56tMeslxsWU97uLa425ZHk",
        "apple": "https://podcasts.apple.com/podcast/bonus-episode-a-new-media-narrative-at-decult/id1286328757?i=1000679076891"
      }
    },
    {
      "id": "17f62355-e38b-431a-bb0e-566c5cbd53aa",
      "title": "The Revival Fellowship",
      "description": "The Revival Fellowship is a Pentecostal Australian sect that believes in Bible Numerics, a thoroughly debunked theory about numerical patterns found within the Bible. It also teaches British Israelism, generally considered to be unscientific and ahistorical and by some as a justification for racism. The Fellowship would say its teachings are in line with \u0027complementarianism\u0027, though women have no place in the hierarchy or leadership of the organisation. Over the years since it formed from a schism with Revival Centres International in the 1990s, the offshoot (as well as the RCI itself) has faced numerous accusations from former members that it operates as a cult.\nFull research sources listed here. You can support us on Patreon. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.\nLinks:\nHeart of Fire: The Story of Australian Pentecostalism — by Barry Chant, House of Tabor, 1984The British-Israel Myth - Christian Identity and the Lost Tribes of Israel — by Nick Greer, 2004Revival Stories \u0026 Document Archive — “a historical document archive and collection of stories of members and former members of the Revival Centres groups of churches”, accessed October 2024An Open Letter from Paul Longfield (son of Lloyd Longfield) — 27 November 1988 letter and undated letterForum for ex-members of Revival Churches — accessed September/October 2024Revival On the Air Today — Revival Fellowships podcast featuring interviews with John \u0026 Janet Kuhlmann in 2019Leaving a Revival Church Is Hard, but It’s Worth It — by Mark Darbyshire, Medium, 20 July 2022The link between gender inequality and violence against women — Our Watch, accessed October 2024Letter to the Adelaide Revival Fellowship — by Jean and Frank O’Flaherty, 20 January 1998Ivan Panin and Friends — Australian National University webpage that includes links to Panin’s Panic, the program created by Brendan McKay in 1997Papua New Guinean revivalist churches push dangerous campaign for \u0027faith-healing\u0027 of AIDS — by Liam Cochrane, ABC News, 22 July 2014 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.\n\n\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-11-19T13:15:31Z",
      "duration": "01:07:36",
      "explicit": false,
      "spotifyId": "5inviNi4i239GC0w4k4i3K",
      "appleId": 1000677475412,
      "youTubeId": "Hn8f504bhb4",
      "subjects": [
        "Evangelicalism",
        "British Israelism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5inviNi4i239GC0w4k4i3K",
        "apple": "https://podcasts.apple.com/podcast/the-revival-fellowship/id1286328757?i=1000677475412",
        "youtube": "https://www.youtube.com/watch?v=Hn8f504bhb4"
      }
    },
    {
      "id": "b4cf9438-1ee2-41f1-99db-f9f56b299c21",
      "title": "Running River: the Divine Madness School",
      "description": "AJ was sent to the Running River school in around 2007, to attend kindergarten when she was five or six years old. The school was headed up by longtime Divine Madness community member Nancy Monson, and founder Marc ‘Yo’ Tizer didn’t have a whole lot to do with it. AJ stayed in the school up until sixth grade, when a new teacher became concerned and shared with parents some of the things he had found out. As soon as AJ’s parents realised the serious deficits in her education, along with some other worrying details, they pulled her from Running River. The school shut down soon afterwards, around 2014. Full episode page here . You can support us on Patreon or with a one-off donation or merch purchase . Links: Running River — archived snapshot of the school website from 5 April 2005 Inner Journey Wilderness Camps — archived snapshot of the \u0027Summer overnight camps for girls\u0027 website from 11 March 2022 If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia (via www.cifs.org.au), and you can find resources outside of Australia with the International Cultic Studies Association (via www.icsahome.com). Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-10-08T13:15:50Z",
      "duration": "01:07:01.6290000",
      "explicit": false,
      "spotifyId": "6TKAJqzw5AcKsTX9a6QAig",
      "appleId": 1000672225364,
      "subjects": [
        "Divine Madness Running Club"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6TKAJqzw5AcKsTX9a6QAig",
        "apple": "https://podcasts.apple.com/podcast/running-river-the-divine-madness-school/id1286328757?i=1000672225364"
      }
    },
    {
      "id": "f77d4cd9-c582-4e98-ac70-3216afe1d313",
      "title": "ICAM \u0026 The Freedom Train Project",
      "description": "Dr Tabitha Chapman is the founder of The Freedom Train Project, a 501(c)(3) non-profit that provides crucial services for individuals exiting cults or coercive environments. One initiative of the project is International Cult Awareness Month (ICAM) which just concluded its third annual instalment in August 2024 with a focus on policy and cults. In this episode, Tabitha shares some highlights of ICAM, thoughts on policy, and how we can all help to effect change.\nTabitha’s personal journey and struggle within NXIVM deeply influenced her resolve to create a support system for others facing similar situations. Her firsthand experience provided unique insights into the needs of victims of coercive control and cultic abuse. This drives the mission and services of The Freedom Train Project.\nFull episode page here. You can support us on Patreon or with a one-off donation or merch purchase.\nLinks:\nThe Freedom Train ProjectICAM 2024 Webinars\nIf you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia (via www.cifs.org.au), and you can find resources outside of Australia with the International Cultic Studies Association (via www.icsahome.com).\n Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.\n\n\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-09-10T14:15:15Z",
      "duration": "00:52:12",
      "explicit": false,
      "spotifyId": "0PTkkFNpdjrD4iUnW39o1c",
      "appleId": 1000669027908,
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0PTkkFNpdjrD4iUnW39o1c",
        "apple": "https://podcasts.apple.com/us/podcast/icam-the-freedom-train-project/id1286328757?i=1000669027908"
      }
    },
    {
      "id": "f5f0bb99-a90a-4a92-8c9c-6c4256bce31a",
      "title": "Cults \u0026 Healthcare Neglect",
      "description": "Dr Caroline Ansley is the founder of Centrepoint Restoration Project, a website that serves as a connection point, archive of information and safe landing space for former children of New Zealand’s notorious Centrepoint cult – with which Caroline has personal experience. She is also a General Practitioner, with over 20 years\u0027 clinical experience in community medicine, and 10 years\u0027 experience working in clinical leadership in the Canterbury Health System. As Senior Clinical Editor of Canterbury and West Coast Community Healthpathways, Dr Ansley is uniquely positioned to help health practitioners navigate the complexities around healthcare when it comes to current and former cult members.\nFull episode page here. You can support us on Patreon or with a one-off donation or merch purchase.\nLinks:\nCentrepoint Restoration ProjectCult Chat podcast — with Dr Caroline Ansley, Lindy Jacomb and Liz GregoryDecult Conference — 19-20 October 2024 in ChristchurchHeaven and Hell – The Centrepoint Story — Warner Bros., 2021An Open Letter Calling for Restorative Justice for the Children of Centrepoint Community — 2021HealthPathways: A Canterbury tale - From paper tiger in Christchurch to asset in consult rooms globally — by Fiona Cassie, New Zealand Doctor, 18 August 2023Olive Leaf NetworkGloriavale Leavers\u0027 Support Trust Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.\n\n\n\n Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-08-20T14:15:54Z",
      "duration": "01:00:37",
      "explicit": false,
      "spotifyId": "6FxIrZD3ZJchW0N0ic1Rj1",
      "appleId": 1000666010621,
      "youTubeId": "I-136U260TQ",
      "subjects": [
        "Cult Psychology",
        "Centrepoint"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6FxIrZD3ZJchW0N0ic1Rj1",
        "apple": "https://podcasts.apple.com/podcast/cults-healthcare-neglect/id1286328757?i=1000666010621",
        "youtube": "https://www.youtube.com/watch?v=I-136U260TQ"
      }
    },
    {
      "id": "474b0db5-c97e-4b6c-afea-a27d8b6a02af",
      "title": "Universal Predator with Esther Rockett",
      "description": "You may recall the name ‘Esther Rockett’ from episode 2, season 3 of this podcast, which was all about Universal Medicine – Serge Benhayon’s esoteric healing cult in the Northern Rivers region of NSW. Esther has been blogging about the more alarming elements of Serge’s ‘modalities’ since 2012, and he sued her for defamation in 2015. The case went to trial in 2018, and in an incredible David and Goliath tale, Esther’s defence proved that the bulk of the defamatory claims found to have been conveyed in her writings were true. Esther\u0027s new book \u0027 Universal Predator \u0027 is out now and it\u0027s all about this battle. It is riveting reading. Full episode page here . You can support us on Patreon or with a one-off donation or merch purchase . Links: Universal Predator — by Esther Rockett, 2024 Esther Rockett\u0027s official website Universal Medicine Cult Exposed and Universal Medicine Accountability — Esther Rockett\u0027s blogs Benhayon v Rockett (No 8) [2019] NSWSC 169 — Supreme Court New South Wales judgement, 6 December 2018 With thanks to our episode sponsor, The Finance and Property Survival Guide podcast . If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia, or with the International Cultic Studies Association. Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-07-16T14:15:26Z",
      "duration": "01:01:04.3260000",
      "explicit": false,
      "spotifyId": "3CiH2rWX62wg1LUHT8dIw3",
      "appleId": 1000662414009,
      "youTubeId": "9NNe4IVdkXs",
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3CiH2rWX62wg1LUHT8dIw3",
        "apple": "https://podcasts.apple.com/podcast/universal-predator-with-esther-rockett/id1286328757?i=1000662414009",
        "youtube": "https://www.youtube.com/watch?v=9NNe4IVdkXs"
      }
    },
    {
      "id": "9a288562-fc29-42cd-ae60-8502fe9dfaa4",
      "title": "Interview Episode: CIFS with Tore Klevjer",
      "description": "Tore Klevjer has been involved with the volunteer charity organisation Cult Information and Family Support (CIFS) since its very formation almost three decades ago, in 1996. Avid listeners of this podcast will know that the end of every episode mentions CIFS. We’re lucky in Australia to have this incredibly dedicated group of volunteers who support those impacted by cults and offer a variety of assistance to both former members and the loved ones of those affected. Find out what CIFS does, what it sees as the biggest obstacles facing leavers, how to support its work, and what drives Tore to keep at it after all these years.\n\nFull episode page here. You can support us on Patreon or with a one-off donation or merch purchase.\n\nLinks:Cult Information and Family Support — official websiteStarting Out in Mainstream America — by Livia Bardin (available for free online via the ICSA)\n\nWith thanks to our episode sponsor, The Finance and Property Survival Guide podcast. If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia, or with the International Cultic Studies Association.\n\nIf you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website.",
      "release": "2024-06-13T07:53:24Z",
      "duration": "00:46:34",
      "explicit": false,
      "spotifyId": "4h9AhZCqo4movYkxrCduqm",
      "appleId": 1000659404961,
      "youTubeId": "KI0-kFyqi4g",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4h9AhZCqo4movYkxrCduqm",
        "apple": "https://podcasts.apple.com/podcast/cult-information-and-family-support-with-tore-klevjer/id1286328757?i=1000659404961",
        "youtube": "https://www.youtube.com/watch?v=KI0-kFyqi4g"
      }
    },
    {
      "id": "ac2041fd-1e67-4ff8-b8f1-27a4e7558d9b",
      "title": "Escaping Twin Flames with Cecilia Peck \u0026 Inbal B. Lessner",
      "description": "Cecilia Peck and Inbal B. Lessner are the director/producer/editor team behind the award-winning Escaping Twin Flames, a three-part documentary series for Netflix about Twin Flames Universe – a cult you may remember from season 5 . This powerhouse duo has turned their talents to investigating high-control groups over their last couple of projects, with Cecilia and Inbal also behind the Starz series Seduced: Inside the NXIVM Cult. Their filmmaking takes a trauma-informed approach with deep care for its subjects, and they share more about this as well as what they found out about Twin Flames for this interview episode. Full episode page here . You can support us on Patreon or with a one-off donation. Links: Escaping Twin Flames — Netflix, 2023 What \u0022Escaping Twin Flames\u0022 teaches us about the anti-trans nature of a supposedly loving cult — by Melanie McFarland, Salon, 11 November 2023 Seduced: Inside the NXIVM Cult — website for the docuseries including resources for cult survivors and loved ones Brave Miss World — website for the documentary film where rape survivors can also share their stories This YouTube School Promised True Love. Students Say They Got Exploited Instead — by Sarah Berman, VICE, 6 February 2020 Accused Cult Leader Threatened Ex-Members After VICE Investigation — by Sarah Berman, VICE, 12 March 2020 Cecilia Peck\u0027s Instagram , X , Facebook and LinkedIn If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia, or with the International Cultic Studies Association. If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website. Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-05-15T06:15:34Z",
      "duration": "01:00:29.1130000",
      "explicit": false,
      "spotifyId": "2h43cdShDWH5Uo1xiRkpV8",
      "appleId": 1000655636261,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2h43cdShDWH5Uo1xiRkpV8",
        "apple": "https://podcasts.apple.com/podcast/escaping-twin-flames-with-cecilia-peck-inbal-b-lessner/id1286328757?i=1000655636261"
      }
    },
    {
      "id": "785721bb-aa2a-41e2-b30a-93ed7ce1254c",
      "title": "Interview Episode: LGATs with John Hunter PhD",
      "description": "For his 2017 PhD, John Hunter put forward a hypothesis that offers insights into both the “transformational” experiences associated with large group awareness training (LGAT) participation and the common claims of psychological harm and problematic behaviour associated with participation. Dr Hunter presented his work at the 2023 International Cultic Studies Association conference, and for this episode, he breaks down some of his findings – including where LGATs may or may not intersect with cults and cult-like behaviour. Full episode page here . You can support us on Patreon or with a one-off donation. Links: John Hunter PhD website Stress-induced hypomania in healthy participants: the allostatic “manic-defence hypothesis” — Dr John Hunter’s 2017 PhD Dissertation Rational Emotive Behaviour Therapy (Dr Albert Ellis) Cognitive Behaviour Therapy (Dr Aaron T. Beck) Robert J. Lifton’s Eight Criteria for Thought Reform The Book of est — Kirkus Reviews \u0027We\u0027re Gonna Tear You Down and Put You Back Together\u0022 — by Mark Brewer, Psychology Today, August 1975 Mindbreakers — by Roland Howard, The Daily Mail, 23 July 2001 Cults in Our Midst — by Margaret Singer, 1995 Psychiatric disturbances associated with Erhard Seminars Training — by L. L. Glass, M. A. Kirsch \u0026 F. N. Parris, American Journal of Psychiatry, 1977 Psychological effects of participation in a large group awareness training — by Fisher, J. D., Silver, R. C., Chinsky, J. M., Goff, B., Klar, Y., \u0026 Zagieboylo, C., Journal of Consulting and Clinical Psychology, 1989 The Elaboration Likelihood Model of Persuasion — by Richard E. Petty \u0026 John T. Cacioppo, Advances in Experimental Social Psychology Vol 19, 1986 Thinking, Fast and Slow — by Daniel Kahneman, Farrar, Straus and Giroux, 2011 The Program: Cons, Cults and Kidnapping — Fishbowl Films, 2024 Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-04-16T14:15:08Z",
      "duration": "01:36:01.1230000",
      "explicit": false,
      "spotifyId": "6Fq2FU0AdyvZn8jRGs1eQG",
      "appleId": 1000652622956,
      "subjects": [
        "Large Group Awareness Trainings"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Fq2FU0AdyvZn8jRGs1eQG",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-lgats-with-john-hunter-phd/id1286328757?i=1000652622956"
      }
    },
    {
      "id": "868b5d88-e1c0-4c3c-a7a4-13aecf914815",
      "title": "Message from Sarah",
      "description": "A little update from Sarah about what to expect with Let\u0027s Talk About Sects now that we\u0027re winding up the sixth season of the show. Don\u0027t worry, we\u0027re not going anywhere! But there are a few small changes to make sure that this project remains sustainable. Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-26T13:15:35Z",
      "duration": "00:05:46.6970000",
      "explicit": false,
      "spotifyId": "0kYBdeuwMqkMqmkfviL36W",
      "appleId": 1000650493183,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0kYBdeuwMqkMqmkfviL36W",
        "apple": "https://podcasts.apple.com/podcast/message-from-sarah/id1286328757?i=1000650493183"
      }
    },
    {
      "id": "21cc7c76-9ff4-4bf7-b41f-08ff1ac8f436",
      "title": "The Retreat: a Divine Madness Update",
      "description": "In the last episode of season 5, we looked into a Boulder, Colorado community then known as Divine Madness and led by Marc Tizer, usually referred to as \u0027Yo\u0027. Its members were recognised for some amazing results in ultramarathons. At the time of researching that episode, updates about the current status of the group were hard to come by. Deru Youmans came across a listing for \u0027The Retreat\u0027 in the Gila National Forest on the World Wide Opportunities on Organic Farms (WWOOF) website, and it sounded amazing. Their recent experience in this remote community had them very concerned for others who might come across a similar listing in the future. Full episode page here . You can support us on Patreon or with a one-off donation, or grab some merch . Sarah\u0027s debut book Do As I Say is available on audiobook now . Thanks to Audio-Technica , presenting partner for season 6 of Let\u0027s Talk About Sects. Links: Teachings of Value — website for The Retreat and other current activities of Marc Tizer\u0027s group once known as Divine Madness Scenic, secluded farm in the Gila National Forest — WWOOF listing for The Retreat Highland Intentional Community — Foundation for Intentional Community listing for the group\u0027s Boulder, Colorado farm A Running Club Is 100 Miles Outside of the Mainstream — by Jere Longman, The New York Times, 28 July 1997 Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-03-12T13:15:49Z",
      "duration": "01:37:20.4570000",
      "explicit": false,
      "spotifyId": "1a4DFkkZcHoqz3v52OOyPk",
      "appleId": 1000648912798,
      "subjects": [
        "Divine Madness Running Club"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1a4DFkkZcHoqz3v52OOyPk",
        "apple": "https://podcasts.apple.com/podcast/the-retreat-a-divine-madness-update/id1286328757?i=1000648912798"
      }
    },
    {
      "id": "961458b1-acc5-46a9-86c0-6b860bc6a074",
      "title": "Interview Episode: The Troubled Teen Industry with Emma Lehman",
      "description": "Journalist Emma Lehman is the creator of the independent podcast Gooned , which dives into the Troubled Teen Industry or TTI – a network of for-profit congregate care facilities for youth ranging from wilderness programs to therapeutic boarding schools. In the podcast, Emma interviews survivors, parents, staff members, experts and activists. Across the USA, young people are funnelled into this $23 billion industry not only by their caregivers but by government agencies. While these places advertise themselves as solutions to everything from troublesome conduct to mental illness, Emma shares through Gooned that they are ground zero for emotional, physical, and psychological abuse with lasting traumatic impacts on the teens they say they serve. And a number of the dubious and damaging methods many of them use can draw a straight line to a cult. Full episode page here . You can support us on Patreon or Acast\u0026#43; , with a one-off donation, or grab some merch . Sarah Steel\u0027s debut book Do As I Say is available on audiobook now . Thanks to Audio-Technica, presenting partner for season 6 of Let\u0027s Talk About Sects. Links: Gooned — podcast , website and TikTok Unsilenced — US non profit organisation that serves past, present, and future victims of institutional child abuse Emma Lehman — Emma\u0027s website where you can find out more about her work Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-20T13:15:11Z",
      "duration": "00:37:14.9320000",
      "explicit": false,
      "spotifyId": "1FDiqXq0c68wimL9Ao6B8X",
      "appleId": 1000645998775,
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1FDiqXq0c68wimL9Ao6B8X",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-the-troubled-teen-industry-with/id1286328757?i=1000645998775"
      }
    },
    {
      "id": "76c6554b-2eea-4412-97fc-dfdd5f547d3b",
      "title": "Avatar",
      "description": "Harry Palmer created Avatar after his presidency of the Church of Scientology\u0027s Elmira Mission ended in the mid-1980s, as a result of legal proceedings around trademark infringement. Avatar says that it aims to create an \u0027enlightened planetary consciousness\u0027 or EPC through its courses, which are expensive and numerous. Former students say they have been left with massive debts as a result of their attendance. Full research sources listed here . You can support us on Patreon or Acast\u0026#43;, with a one-off donation, or grab some merch . Sarah Steel\u0027s debut book Do As I Say is available on audiobook now , and you can order Joe Gould\u0027s LTAS soundtrack album here . With thanks to Audio-Technica , presenting partner for season 6 of Let\u0027s Talk About Sects. Head here to enter our competition to win a pair of ATH-SQ1TW Wireless Earbuds! Links: Who is Harry Palmer? — archived founder bio on former Avatar website, May 2006 Living Deliberately: The Discovery and Development of Avatar — by Harry Palmer, Star’s Edge International, 1994 Harry Palmer’s Scientology Mission, Star’s Edge, and Avatar — special report series by Lisa Bennett, Elmira Star-Gazette, 2-7 February 1988 We\u0027d like to welcome you to \u0027enlightenment\u0027 — by Russell Blackstock, NZ Herald, 17 August 2014 Interview with Margie - Ex-Scientology / Avatar | The Origins of the Avatar Course - Part 1 and Part 2 — Avatar Uncovered YouTube channel, 15 \u0026 19 January 2018 Avatar Uncovered — website maintained by former Avatar Master Amanda Reed, accessed January 2024 An Interview With Harry Palmer — by Matt Ding, HP Magazine, 1996, interview excerpt archived from About Harry Palmer website Avatar: Scientology-style sect causes concern in Netherlands — by Anna Holligan, BBC News, 31 March 2018 Subscribe and support the production of this independent podcast, and you can access early \u0026#43; ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects . Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-13T13:15:18Z",
      "duration": "00:51:14.7680000",
      "explicit": false,
      "spotifyId": "0zcncZt3tYoxIn19W59UHV",
      "appleId": 1000645172139,
      "subjects": [
        "Avatar",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0zcncZt3tYoxIn19W59UHV",
        "apple": "https://podcasts.apple.com/podcast/avatar/id1286328757?i=1000645172139"
      }
    },
    {
      "id": "12502954-0d1b-4e3f-9509-236ab001a844",
      "title": "Interview Episode: Thomas Parsons",
      "description": "Thomas Parsons joined the Twelve Tribes community in Hiddenite, North Carolina in April 2019, and left in November 2021. With Hiddenite being the unofficial headquarters of the organisation, he had direct contact with a number of senior leaders of the Tribes. Following last week’s live episode release, this conversation with Thomas provides an interesting insight into some of the more recent developments in the communities, as well as a more recent personal experience there.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Thanks to Audio-Technica, presenting partner for season 6 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show! Links:The Twelve Tribes LTAS episode page with a full list of resources is hereCult Information and Family Support (CIFS) — Australian volunteer-run support serviceICSA (International Cultic Studies Association) — cult info since 1979 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-01-23T13:15:03Z",
      "duration": "01:17:27.6530000",
      "explicit": false,
      "spotifyId": "6M3gYVCThZnqabRbsPiBYx",
      "appleId": 1000642636844,
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6M3gYVCThZnqabRbsPiBYx",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-thomas-parsons/id1286328757?i=1000642636844"
      }
    },
    {
      "id": "5faec100-2adf-4039-84e9-a3b334cbfb45",
      "title": "Woodford Folk Festival Live Show: The Twelve Tribes",
      "description": "This episode was recorded live at Woodford Folk Festival on 1 January 2024. Many people in the audience would have come across the Twelve Tribes previously at that very festival, as they used to build a big Common Ground cafe by the lake where tens of thousands of festival-goers ate and drank over the years.Numerous wonderful people have devoted themselves to the communities and the lifestyle of the Twelve Tribes. Thousands of fantastic individuals and families are truly dedicated to a way of life that in certain respects has a lot to offer. Their positive experiences, however, don’t negate the stories of those who have come out with less positive things to say. And it’s important to understand why there have been numerous stories with similar themes of harm that have come out of this group over the decades since they formed.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.Links:The Restoration of All Things — a history on the Twelve Tribes’ official website, dated 14 January 2021Our Child Training Manual — Twelve Tribes text, 2000Châm: The Proverbial Lesson to the Whole World — Twelve Tribes teaching, 19 March 2005Châm and Servitude — Twelve Tribes teaching, 19 March 1991Homosexuals and Lesbians — Twelve Tribes teaching, 3 July 1990Lying — Twelve Tribes teaching, 29 November 1998Twelve Tribes Teachings — links to teachings not meant for the public, compiled by the Question 12 Tribes blog, 1977-2008Taking Moral Responsibility for Your Children (An Introduction to Effective and Defective Parenting) — Twelve Tribes teaching, 8 July 2004Children of the Tribes — by Julia Scheeres, Pacific Standard Magazine, 1 September 2015“They are evil”: Ex-Twelve Tribes members describe child abuse, control inside religious cult — by Shelly Bradbury, The Denver Post, 3 March 2022 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-01-16T13:15:58Z",
      "duration": "01:16:51.9180000",
      "explicit": false,
      "spotifyId": "2JDT0uHp48L8b6UaSbAizV",
      "appleId": 1000641840331,
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JDT0uHp48L8b6UaSbAizV",
        "apple": "https://podcasts.apple.com/podcast/woodford-folk-festival-live-show-the-twelve-tribes/id1286328757?i=1000641840331"
      }
    },
    {
      "id": "a975e092-9aed-4676-b649-9a9efcadd8a0",
      "title": "Interview Episode: The Hate Next Door with Matson \u0026 Tawni Browning",
      "description": "Matson Browning is a law enforcement officer who, along with his wife Tawni, spent years undercover infiltrating various hate groups to research and report on the rise of hate crimes and white supremacy in the United States. Together they wrote the book The Hate Next Door: Undercover Within the New Face of White Supremacy, which was published in July 2023.What others dismissed as fringe groups, Matson quickly recognised as large and interconnected organisations permeating every facet of American society, effectively spreading their dangerous and repugnant rhetoric at unprecedented speeds. Now, with the violent polarisation in our communities and an increase in hate crimes, the threat posed by these toxic organisations feels as acute as ever.Episode page here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.Links:Matt \u0026 Tawni Browning — Matson and Tawni\u0027s websiteThe Hate Next Door: Undercover Within the New Face of White Supremacy  — by Matson \u0026 Tawni Browning, Sourcebooks, 2023If you have been personally affected by involvement in a cult or would like to support those who have been, you can find support with, or donate to, Cult Information and Family Support if you’re in Australia, and you can find resources outside of Australia at icsahome.com.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website at iasp.info. Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-12-19T13:15:32Z",
      "duration": "00:44:56.1500000",
      "explicit": false,
      "spotifyId": "2Dqb1hVRBu6r572F95gNeq",
      "appleId": 1000639081829,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Dqb1hVRBu6r572F95gNeq",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-the-hate-next-door-with-matson/id1286328757?i=1000639081829"
      }
    },
    {
      "id": "de3b08de-2d53-4313-bf9a-afb3ee9dd6bb",
      "title": "Interview Episode: Chabad and Zionism",
      "description": "Yaakov Aharon and Shula Kirovsky’s lives in Sydney’s famous beach suburb of Bondi were lived largely separate from mainstream society, within the Chassidic sect of Chabad. Their families’ lifestyles were a world away from the fashionable bikini and boardshorts-wearing demographics usually associated with the area. Though Yaakov disconnected himself from the sect’s beliefs while he was still quite young, as a teenager he remained keen to join the Israel Defence Forces. Shula disengaged from her religious upbringing at the age of 19, when she was told it was time for her to get married.Today, both Shula and Yaakov are involved with the Tzedek Collective, an anti-Zionist Jewish group currently attending Sydney’s pro-Palestine rallies every Sunday in Hyde Park and calling for a permanent ceasefire in Gaza. For this episode, they share a selection of their experiences, including some of the things that changed their perspectives from the ideology they were brought up to believe in.Episode page here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.Links:Tzedek Collective — website, Facebook, Twitter/X, InstagramThe Shock Doctrine — by Naomi Klein, Penguin Books, 2007 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-12-12T13:15:18Z",
      "duration": "01:26:13.7330000",
      "explicit": false,
      "spotifyId": "4cjbaRQl49NPx2VPJN0kfo",
      "appleId": 1000638311138,
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cjbaRQl49NPx2VPJN0kfo",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-chabad-and-zionism/id1286328757?i=1000638311138"
      }
    },
    {
      "id": "6731d696-d72d-44e0-88f9-482039d5df0c",
      "title": "Interview Episode: IndoctriNation with Rachel Bernstein",
      "description": "Rachel Bernstein is an LA-based therapist who has specialized in cult intervention and re-acclimation for over 30 years. She serves on the advisory board of the International Cultic Studies Association and has worked with the Department of Justice providing support to cult survivors. Over the years she has made many media appearances as a cult expert and is also the host of IndoctriNATION, a weekly podcast covering cults, manipulators, and protecting yourself from systems of control, where she has interviewed hundreds of cult survivors, journalists, and experts.In this episode, Rachel speaks about some of her therapeutic approaches to those who are in cults or have exited them and offers some advice to loved ones on how they may be able to reach someone who has become enmeshed in one of these organisations.Episode page here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.Links:IndoctriNATION podcast — Rachel Bernstein\u0027s podcastRachel Bernstein Therapy — Rachel\u0027s website which includes webinars and video lecturesNow I Know — by Rachel Bernstein, Mascot Books, 2015Unique Ways to Reach Out to Loved Ones in Cultic Groups — by Rachel Bernstein, ICSA Today Vol. 12, No. 1, 2021If you have been personally affected by involvement in a cult or would like to support those who have been, you can find support with, or donate to, Cult Information and Family Support if you’re in Australia, and you can find resources outside of Australia at icsahome.com.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website at iasp.info. Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-11-14T13:15:56Z",
      "duration": "00:55:18.3340000",
      "explicit": false,
      "spotifyId": "2e2gsyWzntgt7st1ObbcSV",
      "appleId": 1000634771061,
      "subjects": [
        "Cult-Expert",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2e2gsyWzntgt7st1ObbcSV",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-indoctrination-with-rachel-bernstein/id1286328757?i=1000634771061"
      }
    },
    {
      "id": "eefd7fc9-e696-4496-8d57-a8d327f1e1f1",
      "title": "Xenos / Dwell – Part 2",
      "description": "Xenos was originally set up as a leaderless group that rejected the structures and trappings of mainstream churches. Springing forth from the Jesus Movement of the late 1960s and early 1970s, it focused on meeting in people’s homes and embracing members from the youth counter-cultures. So why does the church’s own website admit to a history that involves cult-like behaviour? And how did it come to face allegations of manipulation and control that have been made by people who joined and left in completely different decades? Full research sources listed here. You can support us on Patreon. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 6 of Let\u0027s Talk About Sects.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:History of Dwell — Dwell website, accessed September 2023Coming Home: The Jesus People Movement In the Midwest And Their Attempts To Escape Fundamentalism — by Benjamin Williamson, Doctoral dissertation, University of Dayton, 2021An Organic Deception: The Xenos / Dwell Heresy Briefly Examined — by Reverend Rafael D Martinez, Director, Spiritwatch Ministries, undated, accessed September 2023Spiritwatch Response — by Dennis McCallum, Dwell website, undated, accessed September 2023Xenos critics say church is controlling — by Danae King, The Columbus Dispatch, 26 November 2018Dwell Community Church, Xenos Christian Fellowship: exploring how well-meaning individuals cause significant abuse through religious dogmatism — by Katie M. Reinaker, March 2022Inside the Megachurch That Has Ex-Members Screaming Cult — by Emily Shugerman, The Daily Beast, 21 May 2022Dwell\u0027s Response to The Daily Beast — by James M. Rochford, Dwell website, accessed September 2023‘It’s really tragic’: Former members speak out against Columbus church — by Jamie Ostroff, NBC4, 21 February 2022 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-10-24T13:15:26Z",
      "duration": "01:05:29.7040000",
      "explicit": false,
      "spotifyId": "4fmUMJlOj2LzIHXm1pqrpy",
      "appleId": 1000632443897,
      "subjects": [
        "Xenos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fmUMJlOj2LzIHXm1pqrpy",
        "apple": "https://podcasts.apple.com/podcast/xenos-dwell-part-2/id1286328757?i=1000632443897"
      }
    },
    {
      "id": "91f9992a-2b81-446c-b889-1cf765d578e8",
      "title": "Xenos / Dwell – Part 1",
      "description": "Xenos was originally set up as a leaderless group that rejected the structures and trappings of mainstream churches. Springing forth from the Jesus Movement of the late 1960s and early 1970s, it focused on meeting in people’s homes and embracing members from the youth counter-cultures. So why does the church’s own website admit to a history that involves cult-like behaviour? And how did it come to face allegations of manipulation and control that have been made by people who joined and left in completely different decades? Full research sources listed here. You can support us on Patreon. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 6 of Let\u0027s Talk About Sects.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:History of Dwell — Dwell website, accessed September 2023Coming Home: The Jesus People Movement In the Midwest And Their Attempts To Escape Fundamentalism — by Benjamin Williamson, Doctoral dissertation, University of Dayton, 2021An Organic Deception: The Xenos / Dwell Heresy Briefly Examined — by Reverend Rafael D Martinez, Director, Spiritwatch Ministries, undated, accessed September 2023Spiritwatch Response — by Dennis McCallum, Dwell website, undated, accessed September 2023Xenos critics say church is controlling — by Danae King, The Columbus Dispatch, 26 November 2018Dwell Community Church, Xenos Christian Fellowship: exploring how well-meaning individuals cause significant abuse through religious dogmatism — by Katie M. Reinaker, March 2022Inside the Megachurch That Has Ex-Members Screaming Cult — by Emily Shugerman, The Daily Beast, 21 May 2022Dwell\u0027s Response to The Daily Beast — by James M. Rochford, Dwell website, accessed September 2023‘It’s really tragic’: Former members speak out against Columbus church — by Jamie Ostroff, NBC4, 21 February 2022 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-10-17T13:15:46Z",
      "duration": "00:58:51.3630000",
      "explicit": false,
      "spotifyId": "2MWll8bJXX0d2US9Dz3sAF",
      "appleId": 1000631605771,
      "subjects": [
        "Xenos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2MWll8bJXX0d2US9Dz3sAF",
        "apple": "https://podcasts.apple.com/podcast/xenos-dwell-part-1/id1286328757?i=1000631605771"
      }
    },
    {
      "id": "202d57d1-489d-44f7-be33-92b20389b8b9",
      "title": "Theatre of All Possibilities / Odyssey Study Group",
      "description": "In many ways, this theatre troupe and Fourth Way school became the most secretive this podcast has looked into yet. Most members didn’t know each other’s jobs, marital status, or even surnames. They didn’t see each other outside of what they referred to as ‘the work’, they didn’t know the classes they were going to each week had anything to do with the teachings of Russian philosophers, and they didn’t tell anyone outside what it was they were attending two nights each week. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now, and you can order Joe Gould\u0027s LTAS soundtrack album here.  With thanks to Audio-Technica, presenting partner for season 6 of Let\u0027s Talk About Sects. Head here to enter our competition to win a pair of ATH-SQ1TW Wireless Earbuds!Links:Theater group, cult or stage? — by Jack Brooks, The San Francisco Progress, 22 December 1978Strange School — by Michael Taylor and Bernard Weiner, The San Francisco Chronicle, 23 December 1978‘Theater of All Possibilities’ deserves a second look — by Jack Brooks, The San Francisco Progress, 10 January 1979My Life in a Cult — by Spencer L. Schneider, The East Hampton Star Magazine, 16 December 2019Manhattan Cult Story — Spencer Schneider’s blog ‘Exposing the Sharon Gans Cult’Manhattan Cult Story: My Unbelievable True Story of Sex, Crimes, Chaos, and Survival — by Spencer Schneider, Arcade Publishing, 2022Seeing Into the Heart of Things — Bette Leahy’s blog about OSGThe Gentle Souls Revolution — Esther Friedman’s blog about ‘The School’The Gentle Souls Revolution — by Esther Friedman, GSR Healing Arts, 2023A Safety Guide For Gentle Souls w/Esther Friedman — IndoctriNation podcast with Rachel Bernstein, 30 August 2022 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-09-12T14:15:16Z",
      "duration": "01:03:55.7940000",
      "explicit": false,
      "spotifyId": "0oXLdy3n5Jh1eUSkLs7UW9",
      "appleId": 1000627614903,
      "subjects": [
        "Odyssey Study Group"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0oXLdy3n5Jh1eUSkLs7UW9",
        "apple": "https://podcasts.apple.com/podcast/theatre-of-all-possibilities-odyssey-study-group/id1286328757?i=1000627614903"
      }
    },
    {
      "id": "9b3fc3b5-fa62-4d40-a7a8-fbe8d110b0b0",
      "title": "International Cult Awareness Month: Andrew Pledger and BJU",
      "description": "Andrew Pledger was raised in the Independent Fundamental Baptist movement, and after completing his homeschool education, attended Bob Jones University. He is the creator of the limited podcast Surviving Bob Jones University: A Christian Cult. His podcast explores the school’s history, the psychology of fundamentalism, the criteria for cults, and survivors’ experiences.Full episode page here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia (via www.cifs.org.au), and you can find resources outside of Australia with the International Cultic Studies Association (via www.icsahome.com).If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website at www.iasp.info.Links:Surviving Bob Jones University: A Christian Cult — Andrew Pledger\u0027s podcastAndrew\u0027s LinktreeReligious Trauma is Trauma — a fine art photo series by Andrew PledgerIndoctriNation podcast — with Rachel Bernstein Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-08-22T14:15:34Z",
      "duration": "02:01:09.5900000",
      "explicit": true,
      "spotifyId": "7IrDRuvvqshiOS2yGC2A8W",
      "appleId": 1000625271408,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7IrDRuvvqshiOS2yGC2A8W",
        "apple": "https://podcasts.apple.com/podcast/international-cult-awareness-month-andrew-pledger-and-bju/id1286328757?i=1000625271408"
      }
    },
    {
      "id": "6e31b941-d415-44bd-ace4-91de28459aec",
      "title": "International Cult Awareness Month: Sarah",
      "description": "Sarah is a cult survivor, domestic violence survivor, and a survivor of trafficking and modern slavery. She wouldn’t have been able to name these things as she was experiencing them, or even for some time in the aftermath. Like many cult survivors, Sarah can draw a line between the coercive behaviours that she experienced in the high-demand organisation she was brought up in, KwaSizabantu, and the coercive behaviours of those who abused and exploited her later in life.Now Sarah uses her experiences to advocate for change. She is a fierce defender of the rights of others and has recently launched Survivor Connections, a resource she built alongside survivors for others who have experienced exploitation to assist them with all the things she wishes she knew earlier on.Full episode page here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Links:Survivor ConnectionsAustralian Federal Police — link to report human trafficking, slavery and slavery-like practices (including forced marriage), or phone 131 AFP (131237)Mission of Malice: My Exodus from KwaSizabantu – by Erika Bornman, Penguin Random House South Africa, August 2021If you have been personally affected by involvement in a cult or would like to support those who have been, you can find support with, or donate to, Cult Information and Family Support if you’re in Australia, and you can find resources outside of Australia at icsahome.com.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website at iasp.info. Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-08-15T14:15:56Z",
      "duration": "00:48:55.0130000",
      "explicit": false,
      "spotifyId": "394tYGWSbVPvULu3AsLVO3",
      "appleId": 1000624535036,
      "subjects": [
        "Kwasizabantu",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/394tYGWSbVPvULu3AsLVO3",
        "apple": "https://podcasts.apple.com/podcast/international-cult-awareness-month-sarah/id1286328757?i=1000624535036"
      }
    },
    {
      "id": "0540b87d-74ba-4e1b-9807-593756aca4df",
      "title": "International Cult Awareness Month: Carol Merchasin",
      "description": "Carol Merchasin spent many years as an employment lawyer. She has also been a partner in the Philadelphia office of Morgan, Lewis \u0026 Bockius and director of Morgan Lewis Resources. She has conducted dozens of workplace investigations and taught investigative techniques to human resource professionals at many Fortune 50 companies. She has since joined McAllister Olivarius, where she heads up a practice covering sexual misconduct in religious, faith-based and spiritual communities.Later in her career, Carol Merchasin was asked to take her investigative background and use it to investigate sexual abuse within various Buddhist and yoga communities. The response she received was one of open hostility – certain religious leaders were not interested in investigating or ensuring their members were safe. This led Carol to the realisation that corporate America, a segment of society not necessarily known for its high moral and ethical standards, was doing far better than religious America when it came to stamping out abuse.Full episode page here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Links:McAllister OlivariusBuddhist center in Eugene sued over rape accusation against master guru — by April Ehrlich, OPB, 19 April 2023Halifax Shambhala leader accused of sexually assaulting cook at Chilean dinner — by Brett Bundale, CBC, 11 July 2018Argentina Arrests Yoga Sex Abusive Teacher, 84 – Will US Follow Suit With Swami, 72? — by Frank Parlato, Frank Report, 15 November 2022If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with, or donate to, Cult Information and Family Support if you’re in Australia, and you can find resources outside of Australia at icsahome.com.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website at iasp.info. Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-08-08T14:15:01Z",
      "duration": "00:54:33.9260000",
      "explicit": false,
      "spotifyId": "3UwcfoREuX8aKtc00g7lbi",
      "appleId": 1000623810779,
      "subjects": [
        "Legislation",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3UwcfoREuX8aKtc00g7lbi",
        "apple": "https://podcasts.apple.com/podcast/international-cult-awareness-month-carol-merchasin/id1286328757?i=1000623810779"
      }
    },
    {
      "id": "23fe492b-a733-4456-80ba-ab2f731a2a67",
      "title": "International Cult Awareness Month: Lisa Kendall",
      "description": "Lisa Kendall spent the ages of 9-19 in The Move of God, Sam Fife\u0027s apocalyptic cult. Today, she devotes her time to working on policy changes that will help former cult members and children in high-demand organisations. For International Cult Awareness Month 2023, she updates us about her work with Counter Cult Coalition and the work of others in the counter-cult space.Full episode page here. You can buy Joe Gould\u0027s LTAS soundtrack album Nobody Joins a Cult here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with or donate to Cult Information and Family Support if you’re in Australia, and you can find resources outside of Australia with the International Cultic Studies Association.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Counter Cult Coalition – Facebook page Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-08-01T14:30:24Z",
      "duration": "00:48:00.7570000",
      "explicit": false,
      "spotifyId": "1OxQiS4m9bOLubjFkVpuL2",
      "appleId": 1000623063184,
      "subjects": [
        "The Move Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1OxQiS4m9bOLubjFkVpuL2",
        "apple": "https://podcasts.apple.com/podcast/international-cult-awareness-month-lisa-kendall/id1286328757?i=1000623063184"
      }
    },
    {
      "id": "63585a6b-aca4-42ef-a779-65ec1f1fc89b",
      "title": "Interview Episode: When the World Didn\u0027t End with Guinevere Turner",
      "description": "Guinevere Turner grew up in The Lyman Family, a group she now understands was a cult, but at the time was the only family she knew. Guinevere has recently released her memoir When the World Didn\u0027t End. In it, she recounts her childhood experiences, including the abusive family situation she found herself in when she was pulled out of the cult. She spoke with Sarah about her book, as well as the work she\u0027s doing now to help others who have exited cults.Full episode page here. You can buy Joe Gould\u0027s LTAS soundtrack album Nobody Joins a Cult here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Links:When the World Didn\u0027t End — (via Amazon) by Guinevere Turner, Penguin Random House, May 2023When the World Didn\u0027t End — (via the publisher) by Guinevere Turner, Penguin Random House, May 2023My Childhood in a Cult — by Guinevere Turner, The New Yorker, 29 April 2019The Lalich CenterIf you have been personally affected by involvement in a cult or would like to support those who have been, you can find support with, or donate to, Cult Information and Family Support if you’re in Australia, and you can find resources outside of Australia at icsahome.com and The Lalich Center.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website at iasp.info. Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-06-13T06:13:57Z",
      "duration": "01:01:27.8360000",
      "explicit": true,
      "spotifyId": "5iEJYSsEmmvBoIGZBHzJdH",
      "appleId": 1000616856234,
      "subjects": [
        "The Lyman Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5iEJYSsEmmvBoIGZBHzJdH",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-when-the-world-didnt-end-with/id1286328757?i=1000616856234"
      }
    },
    {
      "id": "a73d8ab6-3cac-4e01-aff8-c7932ebbc1e3",
      "title": "Interview Episode: Rosanna Overcomer",
      "description": "Gloriavale Christian Community has been in the news recently in New Zealand for court cases around labour and servitude, and there are further cases happening as well. To understand more about the history of the organisation, you can listen to our 2-part episode about the group. Rosanna Overcomer recently celebrated 10 years out of Gloriavale, at the end of March 2023, and shares some of her story and the work she does now to help support others.Full episode page here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Links:The Gloriavale Leavers\u0027 Support TrustThe Olive Leave Network — Lindy Jacomb\u0027s new organisationThe Lalich CenterIf you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support with, or donate to, Cult Information and Family Support if you’re in Australia, and you can find resources outside of Australia at icsahome.com.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention website at iasp.info. Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-04-27T06:08:22Z",
      "duration": "00:53:16.5510000",
      "explicit": false,
      "spotifyId": "7LsvZzdfeMp9ZFYluQMhhz",
      "appleId": 1000611459119,
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LsvZzdfeMp9ZFYluQMhhz",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-rosanna-overcomer/id1286328757?i=1000611459119"
      }
    },
    {
      "id": "83b6821b-b24a-48c5-8e7c-8e3974876df7",
      "title": "Divine Madness",
      "description": "Divine Madness Running Club boasted some spectacular results in ultramarathons and became known for their excellent support teams and low-impact style of running. But the Boulder, Colorado based group was also notorious for their strange ways, whereby members were expected to follow the directions of their teacher in all aspects of their lives. Full research sources listed here. You can pre-order Joe Gould\u0027s LTAS soundtrack album here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show!Links:A Leader\u0027s Long, Strange Trip — by Jere Longman, The New York Times, 28 July 1997The Long, Strange Trip of a Running Guru — by Bruce Schoenfeld, Sports Illustrated, 4 August 2003A Divine Madness? — by Andrew Murr, Newsweek, 17 August 1997Community or Cult? — by Clay Evans, Daily Camera, 5 October 1997My spiritual odyssey: A work in progress — blog by Alexander Cassady, undatedRun Ragged — by Clay Evans, Daily Camera, 7 March 200442 Miles to Enlightenment — by Daniel Glick, Women Outside, Fall 1999Running Like Hell — by Michael Finkel, Women\u0027s Sports and Fitness, Nov/Dec 1999ULTRARUNNING; Runner\u0027s Death Places Sport Under Scrutiny — by Jere Longman, The New York Times, 7 March 2004A Spiritual Community in Reserve Is Also An Ultramarathon Powerhouse — by Leslie Linthicum, Albuquerque Journal, 21 May 2006 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-04-10T05:16:12Z",
      "duration": "01:04:41.1160000",
      "explicit": false,
      "spotifyId": "1rBoUKHptvHjj4DlzACWUX",
      "appleId": 1000608428901,
      "subjects": [
        "Divine Madness Running Club"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1rBoUKHptvHjj4DlzACWUX",
        "apple": "https://podcasts.apple.com/podcast/divine-madness/id1286328757?i=1000608428901"
      }
    },
    {
      "id": "c717453e-91c1-4bc6-982d-a68d478c19a8",
      "title": "The Ishayas\u0027 Ascension / The Bright Path",
      "description": "Carolyn Millemon learned about a form of meditation called ‘Ascending’ at a weekend workshop in Western Australia when she was 21. A couple of years later, in North Carolina, she decided to dedicate her life to the teachings. A decade later, some of the behaviours of her own teachers weren’t sitting so well with her.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show!Links:MSI and the Ishayas — posts by user ‘scribe’ archived from now defunct FACTNet forum, late 2004 to early 2005The Ishaya’s Ascension — by MSI, Sedona Journal, May 1997First Thunder: An Adventure of Discovery — by MSI, 1996Group Claims TM Movement is a Cult — by Phil McCombs, The Washington Post, 2 July 1987Para — by R. Vaughn Abrams, Seven Suns Publications, 1986, The University of Sydney Rare Books \u0026 Special Collections listingThe Society for Ascension — North Carolina Secretary of State listing, accessed March 2023The Bright Path Ishayas \u002B Maharishi Krishnananda — Cult Education Institute forum, includes post by user ‘FlatEarthRound’ which shares an email circulated to teachers in 2008, posted 19 July 2020the bright path — Cult Education Institute forum posts from 2009The Bright Path — official websiteThe Lineage — page on The Ishayas’ Ascension website, accessed March 2023 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-03-14T13:15:02Z",
      "duration": "01:18:22.9280000",
      "explicit": false,
      "spotifyId": "2ixZMEiV3J1kI3QRdjyZnL",
      "appleId": 1000604129797,
      "subjects": [
        "The Bright Path"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ixZMEiV3J1kI3QRdjyZnL",
        "apple": "https://podcasts.apple.com/podcast/the-ishayas-ascension-the-bright-path/id1286328757?i=1000604129797"
      }
    },
    {
      "id": "99f7753a-231c-450a-85ce-b8dbf8bc4800",
      "title": "Interview Episode: Matthew Klein",
      "description": "Matthew Klein’s story is featured on the podcast Inside the Tribe, and Matt sat down with LTAS for a chat about what he learned from his time in the Twelve Tribes, and what he thinks society could be doing about organisations like this.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show! Links:Inside the Tribe — podcast by Tim Elliott and Camille Bianchi featuring Matt\u0027s story and those of the other people he mentionsI Catch Killers with Gary Jubelin — podcast mentioned by Matt, who will feature on an upcoming episodeCult Information and Family Support (CIFS) — Australian volunteer-run support service Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-03-07T13:15:44Z",
      "duration": "01:20:11.6240000",
      "explicit": true,
      "spotifyId": "4SFzdRIXkEXosp4dBJvEGD",
      "appleId": 1000603143895,
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4SFzdRIXkEXosp4dBJvEGD",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-matthew-klein/id1286328757?i=1000603143895"
      }
    },
    {
      "id": "a002231a-c87c-4a9c-8e3f-9f673e8f925c",
      "title": "Brisbane Christian Fellowship",
      "description": "Brisbane Christian Fellowship sounds like a fairly innocuous name for a church. But the BCF and its network of organisations across Australia have been the subject of a Four Corners investigation and a detailed book, speaking with former members who have numerous stories of families being torn apart as a result of their involvement. Author Morag Zwartz wrote that this ‘church’ “is every bit as pernicious and harmful as the Exclusive Brethren.” Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show!Links:Apostles of Fear: A Church Cult Exposed — by Morag Zwartz, Parenesis Publishing, 2008Who Are the Brisbane Christian Fellowship? — by David Holden, Aletheia Publishing, September 2008 (3rd Ed.)Open Letter to Melbourne Christian Fellowship (MCF) — blog by Paul ‘Kovaks’, accessed January 2023Issues Arising from Four Corners Investigation into Latter Rain Movement — Immanuel Website Article by Brian Rensford, undatedThe God of Broken Hearts — Four Corners, Australian Broadcasting Corporation, 23 June 2008Streetcar Forum — Support forum for those affected by “the teachings and behaviours of RFI leaders”, accessed January \u0026 February 2023Melbourne Christian Fellowship – Why I Left It. — by Roger Williams, 27 June 2008The Brisbane Christian Fellowship – A Government Sponsored Cult — by Chrys Stevenson, Gladly the Cross-Eyed Bear blog, 30 April 2010Fired pastor sues church — by Toni Mcrae, The Courier Mail, 27 March 2010 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-02-14T13:15:18Z",
      "duration": "01:17:06.8860000",
      "explicit": false,
      "spotifyId": "2gV0bSvpFpgevTsizhXXpi",
      "appleId": 1000599557007,
      "subjects": [
        "Brisbane Christian Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2gV0bSvpFpgevTsizhXXpi",
        "apple": "https://podcasts.apple.com/podcast/brisbane-christian-fellowship/id1286328757?i=1000599557007"
      }
    },
    {
      "id": "2b74d0fa-37bc-4717-8bfb-f6b147a70bc7",
      "title": "MOVE Philadelphia",
      "description": "MOVE Philadelphia made headlines in 1978, when police and MOVE members ended up in a prolonged siege and a gunfire exchange that left a police officer dead. They hit the headlines again in 1985, when a confrontation with the authorities became even more deadly after an explosive device was dropped on their property. The events led many to understand the organisation as a Black liberation group who were the victims of a racist system. The latter is hardly debatable, but credible stories from a multitude of former members portray MOVE as never truly being about Black liberation at all. Instead, they characterise it as a cult. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show! If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:What the survivors of MOVE deserve — by Kevin Price, Leaving MOVE blog, 22 October 2021Help Maria Start Over After MOVE — GoFundMe fundraiser for Maria Hardy, formerly Maria Africa, to help with general life expensesHelp June (Pixie) and kids resettle in hiding — GoFundMe fundraiser for June Stokes, formerly Pixie Africa, and her children to help with general life expensesThe Invention of John Africa — by Kevin Price, Leaving MOVE blog, 15 September 2021Move: An American Religion — by Richard Kent Evans, Oxford University Press, 2020Who was John Africa? — by Craig R. McCoy, The Philadelphia Inquirer, 12 January 1986 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2023-01-15T07:54:19Z",
      "duration": "01:07:34.6220000",
      "explicit": true,
      "spotifyId": "7jZDMONDrH5NL8aRdwMBOm",
      "appleId": 1000594942260,
      "subjects": [
        "MOVE (Philadelphia organization)"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jZDMONDrH5NL8aRdwMBOm",
        "apple": "https://podcasts.apple.com/podcast/move-philadelphia/id1286328757?i=1000594942260"
      }
    },
    {
      "id": "7e2f9955-5aaa-49a1-b560-778137cb7866",
      "title": "Bob Barlow\u0027s \u0022Truth\u0022",
      "description": "There’s a group in regional Queensland that claims to have no name. Members meet in each other’s homes on Wednesdays and Sundays. They don’t have any of their beliefs written down, though they do sing hymns from a particular hymn book. A lot of what they follow sounds incredibly similar to a group that also claimed to have no name but was often referred to as the Two by Twos or The Truth. This one doesn’t have pairs of ‘workers’ who travel around and stay with community members, however. That job was left up to its founder, a man named Robert Barlow. If you\u0027re a member or former member of Bob Barlow\u0027s \u0027church\u0027 who would like to get in touch with Candice Curran, you can email survivingthetruth@outlook.com.au. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show! Links:Two by Twos / The Truth — sources for previous LTAS episode about the Two by Twos / The Truth available here, October 2020Family history research service — Queensland Government, searched November 2022David’s Rape of Bathsheba and Murder of Uriah (2 Samuel 11-12) — The Theology of Work Project (TOW), accessed November 2022If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia. If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Credits:Written and hosted by Sarah SteelMusic by Joe GouldEdited by Matt Brazel Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-12-13T13:15:48Z",
      "duration": "01:12:09.5080000",
      "explicit": false,
      "spotifyId": "2AL8yFFxLWjh8jCs2Bj1My",
      "appleId": 1000590029205,
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AL8yFFxLWjh8jCs2Bj1My",
        "apple": "https://podcasts.apple.com/podcast/bob-barlows-truth/id1286328757?i=1000590029205"
      }
    },
    {
      "id": "efe091e1-0e7f-40c6-942c-accacad3de56",
      "title": "Interview Episode: Uncultured with Daniella Mestyanek Young",
      "description": "Daniella Mestyanek Young was born into the Children of God, as was her mother before her. She left as a teenager and put herself through school and university, then decided to join the military. Her fantastic book Uncultured explores many of the parallels between the cult and the armed forces. The New York Times called it, “A painful and propulsive memoir delivered in the honest tones of a woman who didn’t always think she’d live to tell her story.\u0022You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show!Links:Uncultured — by Daniella Mestyanek Young, Macmillan, 2022Daniella Mestyanek Young — official websiteDaniella\u0027s Twitter, Instagram and LinkedInLost In Translation — Daniella\u0027s TEDx Tacoma talk, 20 December 2018 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-29T13:15:55Z",
      "duration": "01:00:46.9280000",
      "explicit": false,
      "spotifyId": "16cZIlLzdi5XpUWCucASTd",
      "appleId": 1000587934268,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/16cZIlLzdi5XpUWCucASTd",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-uncultured-with-daniella-mestyanek/id1286328757?i=1000587934268"
      }
    },
    {
      "id": "b1609b45-d4cc-422d-a3f0-88b20e6ba7da",
      "title": "Interview Episode: Inside the Tribe with Tim Elliott",
      "description": "Many people around the world would have come across the food produced by the Twelve Tribes through their Common Ground market stalls and bakeries or their Yellow Deli cafes. A post from 2011 on the popular Weekend Notes website says, “The Common Ground Café has had its share of media-related controversy as it is run by a religious community, whose mysteriously stand-offish ways freak some people out. Do not be deterred by that, as no one will try to convert you and the food is truly delicious. If you are curious, just ask them.”It might be worth listening to award-winning journalist Tim Elliott’s new podcast, Inside the Tribe, before you follow this advice.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show! Links:Inside the Tribe — podcast by Camille Bianchi and Tim Elliott, out Monday 28 November 2022Have a tip or information about Twelve Tribes? You can email ITT at insidethetribepod@gmail.comThe great escape — by Tim Elliott, The Sydney Morning Herald, 20 April 2007Sect woos recruits among the fairy floss at Easter Show — by Tim Elliott, The Sydney Morning Herald, 24 March 2008Secrets of the family — by Tim Elliott, The Sydney Morning Herald, 18 December 2013Common Ground Café — review by Nekoburro, Weekend Notes, 21 February 2011Farewell to the Father — by Tim Elliott, Picador Australia, 2016 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-22T19:00:19Z",
      "duration": "00:35:33.2630000",
      "explicit": false,
      "spotifyId": "07pAEUzCYzavfYSJFTOB25",
      "appleId": 1000587170586,
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07pAEUzCYzavfYSJFTOB25",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-inside-the-tribe-with-tim-elliott/id1286328757?i=1000587170586"
      }
    },
    {
      "id": "024bddcd-4620-404d-a571-a15ca9cefca3",
      "title": "The Logos Foundation",
      "description": "The Logos Foundation was often described as ‘mysterious’ in media coverage, but became a part of the religious right that published full page newspaper advertisements encouraging the electorate to vote on ‘moral’ issues at Queensland state elections in the late 1980s. Its embrace of the Shepherding Movement led many to consider it incredibly cult-like, and certain facets of the religious right today can trace a direct lineage to its teachings. Founder Howard Carter’s hard-line approach to sinful behaviour would prove to be hypocrisy-ridden for almost the entire time his organisation existed.Guest: Esther (not her real name) Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show! Links:The Logos Foundation: The Rise and Fall of Christian Reconstructionism in Australia — by John Harrison, University of Queensland, 2006Sex Scandal Divides The Bible Belt — by Greg Roberts, Sydney Morning Herald, 13 October 1990The Promised Land — by Melanie Myers, Kill Your Darlings, 12 November 2018The Story — by David P. B. Orton, Lifemessenger, date unknownGod in the Suburbs and Beyond: The Emergence of an Australian Megachurch and Denomination — by PhD thesis by Sam Hey, Griffith University, 2011The Shepherding Movement: Controversy and Charismatic Ecclesiology — by S. David Moore, Bloomsbury Academic, 2003 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-15T13:15:23Z",
      "duration": "00:59:49.8510000",
      "explicit": false,
      "spotifyId": "65BhDah35TjhO96DtZliHP",
      "appleId": 1000586274222,
      "subjects": [
        "The Logos Foundation"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65BhDah35TjhO96DtZliHP",
        "apple": "https://podcasts.apple.com/podcast/the-logos-foundation/id1286328757?i=1000586274222"
      }
    },
    {
      "id": "633e005a-3b2a-4b7f-a7cf-d1bdf2819bcc",
      "title": "Interview Episode: Cult Trip with Anke Richter",
      "description": "Anke Richter is an international journalist and author based in NZ. Over time she’s found herself covering more and more cults, to the point where she recently published her first book about the subject: ‘Cult Trip’. Anke is also a member and co-founder of FACT Aotearoa (Fight Against Conspiracy Theories). Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. Thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 at Audio-Technica’s Australian store for 10% off and to support the show! Links:Cult Trip: Inside the World of Coercion and Control — by Anke Richter, HarperCollins, 2022FACT Aotearoa — Fighting Against Conspiracy Theories (New Zealand) official websiteankerichter.net — Anke Richter’s official websiteRabbit Hole Resistance — Facebook groupBert\u0027s Labyrinth — by Anke Richter, North \u0026 South, September 2015Fire and Fury — documentary by Paula Penfold \u0026 Louisa Cleave, Stuff Circuit, August 2022Cultish: The Language of Fanaticism — by Amanda Montell, HarperCollins, 2021Departures — by Anke Richter, New Zealand Geographic, Issue 155, Jan-Feb 2019 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-08T13:15:13Z",
      "duration": "01:21:54.3640000",
      "explicit": false,
      "spotifyId": "1nRaYjeotf8uNkAlmGFV6z",
      "appleId": 1000585494947,
      "subjects": [
        "Bhagwan Shree Rajneesh",
        "Centrepoint",
        "Agama Yoga"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1nRaYjeotf8uNkAlmGFV6z",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-cult-trip-with-anke-richter/id1286328757?i=1000585494947"
      }
    },
    {
      "id": "6011a9b1-19e5-415c-b51d-04a205630d24",
      "title": "Interview Episode: Issues in Coaching and Wellness with Kathleen Oh",
      "description": "Kathleen Oh is a rare breed: a wellness coach who is cynical about wellness and the coaching industry. She works with clients across integration and psychedelics education. Kathleen is trained in Internal Family Systems (also known as IFS Informed or IFSCA), which is a trauma-informed approach, and comes from a background of trauma herself. Kathleen was once an anti-vaxxer, and her community embraced all kinds of magical thinking and conspiracy theories. Over time, she realised that her own coaching may have involved undue influence, and through the words of a dear friend she recognised that a lot of her perspectives were rooted in white privilege.You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 for 10% off their Australian store, and to support the show. Links:Coach Kathleen Oh — Kathleen’s websiteOh My Heart — Kathleen’s Substack (we spoke about her Psychedelics, Cults and Predators article in particular, from 13 July 2022)The Real Coach Oh — Kathleen’s InstagramPsychedelics, Politics and Predators with Kathleen Oh — Free Your Inner Guru podcast episode, 28 March 2022Cover Story: Power Trip — New York Magazine podcast series from Lily Kay Ross and David Nickles about the psychedelic underground, November 2021Dr Janja Lalich’s websiteTake Back Your Life Recovery — Dr Janja Lalich’s courses that Kathleen mentionedGerette Buglion’s website#igotout — Gerette Buglion and Lisa (anonymous activist)’s movement for cult survivorsLaura Tucker’s website — host of the Free Your Inner Guru podcast Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-11-01T13:15:01Z",
      "duration": "01:50:15.7970000",
      "explicit": true,
      "spotifyId": "79NBstiE3VvjiwPeD24xmd",
      "appleId": 1000584650497,
      "subjects": [
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79NBstiE3VvjiwPeD24xmd",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-issues-in-coaching-and-wellness/id1286328757?i=1000584650497"
      }
    },
    {
      "id": "c2451cdd-6496-470a-a1ff-b53c632a1839",
      "title": "Interview Episode: Dr Janja Lalich",
      "description": "Dr Janja Lalich is a Professor Emerita of Sociology at California State University, Chico. She has written multiple world-renowned books on cultic studies, and is soon to launch the non-profit Lalich Center on Cults and Coercion. Dr Lalich offers resources to help survivors of coercive groups, as well as courses for therapists and social workers to help them understand the issues involved in treatment. She was once a member of a cult herself, and rose to a leadership rank. She has spent her life since using her experiences to educate and assist others. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Use promo code LTAS10 for 10% off their Australian store, and to support the show. If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or find resources at janjalalich.com. If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Janja Lalich\u0027s websiteLalich Center on Cults and CoercionTake Back Your Life Recovery — resources and coursesTake Back Your Life — by Janja Lalich \u0026 Madeleine Tobias, Bay Tree Publishing, 2006 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-21T13:15:01Z",
      "duration": "00:54:09.6060000",
      "explicit": false,
      "spotifyId": "505X66DSPdApgOwOzr316w",
      "appleId": 1000583829123,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/505X66DSPdApgOwOzr316w",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-dr-janja-lalich/id1286328757?i=1000583829123"
      }
    },
    {
      "id": "0a78c53d-7b6f-4c82-a7a8-fdd5c9fdccfa",
      "title": "Interview Episode: Gloriavale with Noel Smyth  \u0026 Fergus Grady",
      "description": "When widespread abuse is uncovered at a New Zealand cult, a family must turn to the legal system in an effort to save themselves and their community from the all-powerful leaders. Filmmakers Noel Smyth and Fergus Grady documented the impact of the civil action, and of the cult itself. Their gripping expose on New Zealand’s most infamous and secretive religious group, founded by Australian evangelist Neville Cooper, has quickly become New Zealand’s highest grossing local documentary. It is out in Australian cinemas on 3 November, with festival screenings from 22 October and Q\u0026A sessions with the filmmakers around the country. To find your nearest screening, visit gloriavale.com/screenings. Guests: Noel Smyth \u0026 Fergus GradySupport the work of the Gloriavale Leavers’ Support Trust here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Aussie listeners can win some Audio-Technica goodies here! If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia. Links:To find your nearest screening of Gloriavale: New Zealand\u0027s Secret Cult visit gloriavale.com/screeningsFacebook: facebook.com/GloriavaleDocoInstagram: instagram.com/gloriavalefilmHashtag: #gloriavalefilm Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-15T13:15:05Z",
      "duration": "00:42:20.1730000",
      "explicit": false,
      "spotifyId": "6vk7iuwpxzc0KJSutok3Rx",
      "appleId": 1000583031112,
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6vk7iuwpxzc0KJSutok3Rx",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-gloriavale-with-noel-smyth-fergus-grady/id1286328757?i=1000583031112"
      }
    },
    {
      "id": "b554d6c2-54cf-4c7c-ab04-048a9d5ed10f",
      "title": "Twin Flames Universe",
      "description": "Twin Flames Universe promises devotees a path to ascension through finding their ultimate lover, and building a permanent, harmonious union. But former followers have accused the organisation of exploitative labour, encouraging people to stay in abusive relationships, and pressuring members to undergo gender reassignment. Guest: Kara Brodsky Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Aussie listeners can win some Audio-Technica goodies here! Links:“Everywhere I Went, They Went With Me, Because They Were on My Phone”: Inside the Always Online, All-Consuming World of Twin Flames Universe — by Alice Hines, Vanity Fair, 3 December 2020This YouTube School Promised True Love. Students Say They Got Exploited Instead — by Sarah Berman, VICE, 6 February 2020Accused Cult Leader Threatened Ex-Members After VICE Investigation — by Sarah Berman, VICE, 12 March 2020Twin Flames Universe — official website, accessed September 2022Church of Union — official website, accessed September 2022EndersAdventures.com — 2012 archived snapshot of former website of ‘Lifestyle Design Entrepreneur’ Ender Ayanethos (later Jeff Ayan)Warrior Forum — posts from Ender Ayanethos, May to December 2012Keely Griffin on Twin Flames \u0026 Other Dumpster Fires — A Little Bit Culty, 14 February 2022Twin Flames: Finding Your Ultimate Lover — by Jeff and Shaleia, September 2015The Mirror Exercise (OFFICIAL) | The Only Tool You\u0027ll Ever Need — Twin Flames Universe YouTube video, 10 February 2019 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-08T02:49:15Z",
      "duration": "00:50:35.2970000",
      "explicit": true,
      "spotifyId": "6YOYkH8TSqJ5HZvxu6R0OH",
      "appleId": 1000582286522,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YOYkH8TSqJ5HZvxu6R0OH",
        "apple": "https://podcasts.apple.com/podcast/twin-flames-universe/id1286328757?i=1000582286522"
      }
    },
    {
      "id": "bb3ddc68-cca8-48e9-ac73-9d09469c00ad",
      "title": "Interview Episode: Avi\u0027s Story",
      "description": "In January 2018, Avi started seeing a new psychologist in Melbourne, Australia. She\u0027d experienced childhood trauma, and wanted to get some help with managing panic attacks. The registered psychologist she found seemed to be a great fit.But a couple of months into the 2020 lockdowns, Avi realised that her life had become completely entwined with her psychologist’s. Over time, Avi came to understand that her psychologist had been trying to groom her into a cult.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.EPISODE LINKSThe Other C Word – by Her, 28 February 2021Register of Practitioners – Australian Health Practitioner Regulation Agency (AHPRA) website Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-10-02T19:15:32Z",
      "duration": "01:25:04.0390000",
      "explicit": false,
      "spotifyId": "3v3fibT7Ib7JWyGa1fTIyK",
      "appleId": 1000581540671,
      "subjects": [
        "Therapy Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3v3fibT7Ib7JWyGa1fTIyK",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-avis-story/id1286328757?i=1000581540671"
      }
    },
    {
      "id": "035e69e4-4fc2-4be0-8ed2-51b7c5d3762e",
      "title": "The New Gnostic Society",
      "description": "Samael Aun Weor claimed that he could remember his own birth, and had identified the only true path to spiritual development. Crucial to his religion was a sexual practice that involved couples never reaching orgasm. Though many who follow his belief system understand sickness to be a result of one’s own karma, their master died of stomach cancer in 1977. He claimed that when he died, he would be resurrected. Guest: Lynn Short Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. With thanks to Audio-Technica, presenting partner for season 5 of Let\u0027s Talk About Sects. Aussie listeners can win some Audio-Technica goodies here! If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Three Mountains — by Samael Aun Weor, Glorian Publishing, 2008Samael Aun Weor — New World Encyclopedia, accessed July 2022The Social Christ — by Samael Aun Weor, 1964Inside the Vestibule of Wisdom — by Samael Aun Weor, 1953Lynn Short - The New Gnostic Society, Sexual Alchemy, \u0026 Lucid Dreaming — Trust Me podcast, 6 April 2022Former member of Circle for Investigation of Gnostic Anthropology Aust (CIGA) and Gnosis in Australia — Name Withheld, entry on the CIFS website Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-09-01T06:49:21Z",
      "duration": "01:15:50.7650000",
      "explicit": true,
      "spotifyId": "4DJh2Z6ssSUPxyZcj4HX55",
      "appleId": 1000579342683,
      "subjects": [
        "The New Gnostic Society"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4DJh2Z6ssSUPxyZcj4HX55",
        "apple": "https://podcasts.apple.com/podcast/the-new-gnostic-society/id1286328757?i=1000579342683"
      }
    },
    {
      "id": "71d5d40e-dd90-4c23-b34c-4d13a9993659",
      "title": "Interview Episode: A Little Bit Culty",
      "description": "Sarah Edmondson is an actor, voice over artist and activist who spent 12 years in NXIVM, rising from student to coach to eventually running her own center in Vancouver, Canada. After becoming involved with its secret society, DOS, she managed to escape and alongside her husband Anthony ‘Nippy’ Ames, became a whistleblower on the cult and worked with the FBI to expose Keith Raniere’s crimes. Today Sarah and Nippy make the fantastic podcast A Little Bit Culty, in which they speak with some incredible guests including other former cult members and experts in cult dynamics. Guests: Sarah Edmondson \u0026 Anthony ‘Nippy’ Ames Full research sources listed on each episode page at www.ltaspod.com. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now. If you have been personally affected by involvement in a cult, or would like to support those who have been, you can find support or donate to Cult Information and Family Support if you’re in Australia (via www.cifs.org.au), and you can find resources outside of Australia with the International Cultic Studies Association (via www.icsahome.com). Links:A Little Bit Culty — Sarah and Nippy’s podcastUncover: Escaping NXIVM — CBC podcast featuring Sarah EdmondsonThe Vow — HBO series featuring Sarah EdmondsonResources — a collection of useful resources on cults at Sarah Edmondson’s websiteScarred: The True Story of How I Escaped NXIVM, the Cult That Bound My Life — by Sarah Edmondson with Kristine Gasbarre, Hardie Grant, 2019Take Back Your Life — by Janja Lalich \u0026 Madeleine Tobias, Bay Tree, 2006, audiobook narrated by Sarah EdmondsonNippy’s Instagram, Sarah’s Instagram and Twitter, and A Little Bit Culty’s Instagram Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-07-26T14:15:29Z",
      "duration": "00:54:15.7970000",
      "explicit": true,
      "spotifyId": "6do6lE8VZtqLz9nmqgcIiN",
      "appleId": 1000571230933,
      "subjects": [
        "NXIVM",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6do6lE8VZtqLz9nmqgcIiN",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-a-little-bit-culty/id1286328757?i=1000571230933"
      }
    },
    {
      "id": "0b0acd4a-c451-4033-be3e-07e2e127e7e7",
      "title": "Bonus Episode: Do As I Say, Chapter One",
      "description": "Sarah Steel\u0027s debut book Do As I Say is published by Pan Macmillan Australia, and out on 28 June 2022. It will be available in audiobook, ebook and paperback. This is chapter 1, read by Sarah for the audiobook release.\u0022In times of uncertainty when you long for simple answers and have a deep desire for community, you can find yourself incrementally handing over your agency to a charismatic but authoritarian and manipulative leader or group-think. In this book Sarah Steel has brilliantly charted how this happens in all sorts of ways and for all sorts of people; it provides an invaluable map to navigate this dangerous terrain.\u0022 - Reverend Tim Costello AO\u0022This book is a most comprehensive and studied look at cults, the leaders, and perhaps most importantly the survivors. Sarah Steel has given the world a real gem - one that will not only educate but also help to destigmatize those who have been harmed by cults and con artists. Bravo!\u0022 - Dr Janja Lalich, Professor Emerita of Sociology, Co-Founder of Take Back Your Life Recovery LLC, International Authority on Cults \u0026 Coercion\u0022Sarah uses the stories of survivors to tease out the common threads of coercive control shared by cults and found in other parts of society. The result is a much-needed spotlight on the behaviours and personalities we are likely to encounter even if we never go anywhere near a cult.\u0022 - David Gillespie, bestselling author and lawyer Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-06-08T22:37:04Z",
      "duration": "00:31:17.2110000",
      "explicit": false,
      "spotifyId": "3PHVleZD0csCsBBGXBGj11",
      "appleId": 1000565710727,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PHVleZD0csCsBBGXBGj11",
        "apple": "https://podcasts.apple.com/podcast/bonus-episode-do-as-i-say-chapter-one/id1286328757?i=1000565710727"
      }
    },
    {
      "id": "34eb5c44-1795-4841-a2ce-ab209aea7baf",
      "title": "Interview Episode: Counter Cult Coalition",
      "description": "Lisa Kendall spent the ages of 9-19 in The Move of God, Sam Fife\u0027s Apocalyptic cult. Today, she devotes her time to working on policy changes that will help former cult members and children in high-demand organisations. For this bonus episode she speaks about her work with Counter Cult Coalition, the organisation she founded alongside spiritual abuse expert Kent Burtner.From its Facebook page: “Counter Cult Coalition\u0027s mission is to raise awareness of issues related to involvement in coercive groups known as cults and to improve public policy in order to protect and provide for children harmed by group involvement.”Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.EPISODE LINKSCounter Cult Coalition – Facebook pageTo support Counter Cult Coalition, you can donate via PayPal: wkburtner@aol.com; or via Venmo: William Burtner (phone confirmation number: 3429) Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2022-04-19T14:15:04Z",
      "duration": "00:49:17.9750000",
      "explicit": false,
      "spotifyId": "7kxQDp9ejl4YY92BfVQXpQ",
      "appleId": 1000558044250,
      "subjects": [
        "The Move Of God",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7kxQDp9ejl4YY92BfVQXpQ",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-counter-cult-coalition/id1286328757?i=1000558044250"
      }
    },
    {
      "id": "536e80ce-3832-4386-a4c6-f00fb15e66e9",
      "title": "Interview Episode: KwaSizabantu",
      "description": "KwaSizabantu means “the place where people are helped” in Zulu. Erika Bornman spent most of her childhood years at the KwaSizabantu Mission. Her memoir Mission of Malice is about her childhood, and about her life since leaving. It’s an incredible read. Daniel Schricker is a composer and writer based in Adelaide, South Australia. He also spent his childhood and teenage years in KwaSizabantu, and has written a series of articles entitled Scaring the Hell Out of You, “A 4-part examination of the role of fear in the theology and practices of KwaSizabantu and the psychological implications for children”. This bonus episode is an interview with Erika and Daniel, who were kind enough to share their insights, including why they have doubts that KwaSizabantu is capable of changing for the better. Guests: Erika Bornman \u0026 Daniel Schricker Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Mission of Malice: My Exodus from KwaSizabantu – by Erika Bornman, Penguin Random House South Africa, August 2021Scaring the Hell Out of You – Part 1: Fear of God, Part 2: Fear of Authority, Part 3: Fear of Self, Part 4: Fear of the Outside World – by Daniel Schricker, 18 September 2021Mission of malice by Erika Bornman: A reader impression – by Daniel Schricker, LitNet, 20 August 2021Devotion KwaSizabantu Mission – 9 September 2020 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2021-12-07T13:15:36Z",
      "duration": "01:43:35.8100000",
      "explicit": false,
      "spotifyId": "3qFomdV3sFglu0j5cfm0fV",
      "appleId": 1000544209948,
      "subjects": [
        "Kwasizabantu"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3qFomdV3sFglu0j5cfm0fV",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-kwasizabantu/id1286328757?i=1000544209948"
      }
    },
    {
      "id": "7ed28ffd-a07d-4cd4-868e-0bc01b56fd00",
      "title": "Interview Episode: David Freeman – former child member of The Family",
      "description": "David Freeman was handed over to Anne Hamilton Byrne at the age of two, when he went to live with the other children at The Family’s Lake Eildon property. It took 12 years before he was rescued by the police, and given his freedom. At 15, he vowed not to tell anyone about his childhood in the notorious Victorian cult, and it was a promise he kept for 25 years. Guest: David Freeman Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Deprived of his childhood in a notorious cult — by Einar Þór Sigurðsson, Fréttablaðið, 5 February 2021 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2021-06-29T14:15:00Z",
      "duration": "01:18:01.8740000",
      "explicit": false,
      "spotifyId": "6yEMgkIcpMnqvuHCru5eKM",
      "appleId": 1000527249828,
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6yEMgkIcpMnqvuHCru5eKM",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-david-freeman-former-child-member/id1286328757?i=1000527249828"
      }
    },
    {
      "id": "3d46699d-bc8a-4a1a-b2d3-96e28dfeaaed",
      "title": "Gloriavale – Part 2",
      "description": "Gloriavale Christian Community is recognised around New Zealand for the distinctive dress of its members, especially the women, who wear headscarves to denote submission to men, and a neck-to-ankle garment designed by the group’s Australian founder, Neville Cooper. Some say the community represents a pious life set up around ideals of sharing everything, but others say the way it’s set up is breeding predators. Guests: Hannah Harrison, Liz Gregory Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Gloriavale Christian Community — official website, accessed March 2021Gloriavale Leavers’ Support Trust — official website, accessed March 2021The Christian Church Community Trust Charities Services Investigation — 22 December 2016, supplied under the Official Information Act to Newsroom and published 28 March 2017Lilia Tarawa — official website, accessed March 2021Who was Hopeful Christian and how did he rise to notoriety at Gloriavale? — by Brad Flahive, Stuff, 15 May 2018Gloriavale: A World Apart — directed by Amanda Evans, 2016Gloriavale: The Return — directed by Amanda Evans, 2018Gloriavale leavers describe fear, oppression in community — Logan Church, Checkpoint, RNZ, 14 November 2019 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2021-04-20T14:15:00Z",
      "duration": "01:05:24.9240000",
      "explicit": false,
      "spotifyId": "6brDPNY32dayTgPejEuXAh",
      "appleId": 1000517922689,
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6brDPNY32dayTgPejEuXAh",
        "apple": "https://podcasts.apple.com/podcast/gloriavale-part-2/id1286328757?i=1000517922689"
      }
    },
    {
      "id": "4841092c-edfa-49ba-b613-be2a6f52343e",
      "title": "Gloriavale – Part 1",
      "description": "Gloriavale Christian Community has found itself in the New Zealand media headlines on multiple occasions. Its founder was once jailed for sexual abuse, but community members were convinced that it he was jailed for preaching the gospel. Followers claim that their way of life is all about the common good and nobody having more than anyone else. Former members say their time there was dominated by endless work and an overriding sense of fear. Guests: Hannah Harrison, Liz Gregory Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Gloriavale Christian Community — official website, accessed March 2021Gloriavale Leavers’ Support Trust — official website, accessed March 2021The Christian Church Community Trust Charities Services Investigation — 22 December 2016, supplied under the Official Information Act to Newsroom and published 28 March 2017Lilia Tarawa — official website, accessed March 2021Who was Hopeful Christian and how did he rise to notoriety at Gloriavale? — by Brad Flahive, Stuff, 15 May 2018Gloriavale: A World Apart — directed by Amanda Evans, 2016Gloriavale: The Return — directed by Amanda Evans, 2018Gloriavale leavers describe fear, oppression in community — Logan Church, Checkpoint, RNZ, 14 November 2019 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2021-04-13T14:15:00Z",
      "duration": "00:58:47.1310000",
      "explicit": false,
      "spotifyId": "5H11UGnzL03Lz7MnqiXxwv",
      "appleId": 1000516996586,
      "subjects": [
        "Gloriavale"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5H11UGnzL03Lz7MnqiXxwv",
        "apple": "https://podcasts.apple.com/podcast/gloriavale-part-1/id1286328757?i=1000516996586"
      }
    },
    {
      "id": "eaa162a9-5bc2-4eca-b808-ab8896eefd75",
      "title": "Zion Full Salvation Ministry",
      "description": "Violet Pryor told her followers that she was God. They gave up their money and possessions to keep her in comfort. David Ayliffe became one of her key Pillars, a right-hand man. After her death, he became the leader of the cult she had created in Sydney, Australia – the Zion Full Salvation Ministry. Guest: David Ayliffe Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:My Brother’s Eyes — by David \u0026 John Ayliffe, John Garratt Publishing, 2009David Ayliffe’s website — with links to the audiobook of My Brother’s EyesThe development of, and opposition to, Healing Ministries in the Anglican Diocese of Sydney, with special reference to the Healing Ministry at St Andrew’s Cathedral 1960-2010 — by Paul Francis Egan, PhD thesis for Macquarie University, 2012Full Salvation Fellowship — Peter and Verlie Hobson’s website, accessed February 2021Omegaman Internet Radio Station — accessed February 2021Violet Dorothy Pryor — gravesite listing, Kangaroo Valley CemeteryWedding Bells: Wills-Pryor — Sunshine Advocate, 25 February 1944Violet Dorothy Wills — Victorian marriage listing with the Registry of Births, Deaths and Marriages, accessed February 2021 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2021-03-16T13:15:00Z",
      "duration": "01:09:46.3820000",
      "explicit": false,
      "spotifyId": "1UkKFjXfHVxx464mYgpYxv",
      "appleId": 1000513257913,
      "subjects": [
        "Zion Full Salvation Ministry"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1UkKFjXfHVxx464mYgpYxv",
        "apple": "https://podcasts.apple.com/podcast/zion-full-salvation-ministry/id1286328757?i=1000513257913"
      }
    },
    {
      "id": "5b3b7bc5-1bee-4403-9295-b8aceeaee050",
      "title": "Master\u0027s Commission",
      "description": "As he was about to turn 17, Remy Attig was keen to get away from his parents’ fracturing marriage, and ready for something to give his life purpose. The Master’s Commission program seemed like just the thing to set him up for a life of travel and spreading the word of God. Instead, it ran him ragged, instilled fear, built on his internalised homophobia, and set him up for unhealthy relationships and trust issues. In hindsight, he believes that the Master’s Commission was a cult. Guest: Remy Attig Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Master’s Commission International Network (MCIN) — official websiteAthletes International Ministry — official websitePhoenix Megachurch Hosting Trump Rally Says It Has Special Coronavirus-Killing Air System — by Ray Stern, Phoenix New Times, 22 June 2020AG Warns Phoenix Megachurch and Air-System Firm About Fraudulent COVID Statements — by Ray Stern, Phoenix New Times, 26 June 2020Without a Vision, You Perish — Trivita profile of Larry Kerychuck, unknown dateLloyd Zeigler — Jim Bakker Show profile, accessed January 2021Statement of Fundamental Truths — Assemblies of GodMy Cult Life — blog by Lisa Kerr, archived January 2014 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2021-02-16T13:15:00Z",
      "duration": "01:14:04.6300000",
      "explicit": false,
      "spotifyId": "5DODoPCA8yN7iEmzHeCe9o",
      "appleId": 1000509349936,
      "subjects": [
        "Master\u0027s Commission International Network"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5DODoPCA8yN7iEmzHeCe9o",
        "apple": "https://podcasts.apple.com/podcast/masters-commission/id1286328757?i=1000509349936"
      }
    },
    {
      "id": "364761b8-fb50-4cd1-8939-a9bf3234d095",
      "title": "Exclusive Brethren – Part 2",
      "description": "Lindy Jacomb was born into the Exclusive Brethren in Auckland, New Zealand, and was told there was no longer a place for her there in 2008. Her family cut off all communication with her and she was forced to start a new life at the age of 20, without any of the people she knew and loved. Guests: Lindy Jacomb and Michael Bachelard Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Behind the Exclusive Brethren — by Michael Bachelard, Scribe Publications, 2008Separation from Evil - God\u0027s Principle of Unity — by John Nelson Darby, 1853BIG JIM TAYLOR, LEADER OF SECT — James Taylor Jnr. obituary, The New York Times, 17 October 1970\u0022The Aberdeen Incident\u0022 July, 1970 — a compilation of material including a transcription of the Aberdeen Tapes, from the 25 July 1970 meeting following the incidentThe closed-door church: Inside the secretive and strict Plymouth Brethren sect in Manitoba — by Bill Redekop, Winnipeg Free Press, 10 May 2014Howard defends meeting the Exclusive Brethren — by Peta Donald, PM, ABC Radio National, 22 August 2007OneSchool Global NSW Enrollment Policy — accessed December 2020OneSchool Global — official website, accessed December 2020 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2021-01-19T13:16:00Z",
      "duration": "01:01:55.2130000",
      "explicit": false,
      "spotifyId": "6lbXEmCFYjq7hLY9jxFTOr",
      "appleId": 1000505863804,
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6lbXEmCFYjq7hLY9jxFTOr",
        "apple": "https://podcasts.apple.com/podcast/exclusive-brethren-part-2/id1286328757?i=1000505863804"
      }
    },
    {
      "id": "e8ff4959-a964-472e-905c-ee160dfb9931",
      "title": "Exclusive Brethren – Part 1",
      "description": "Lindy Jacomb was born into the Exclusive Brethren in Auckland, New Zealand, and was told there was no longer a place for her there in 2008. Her family cut off all communication with her and she was forced to start a new life at the age of 20, without any of the people she knew and loved. Guests: Lindy Jacomb and Michael Bachelard Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Behind the Exclusive Brethren — by Michael Bachelard, Scribe Publications, 2008Separation from Evil - God\u0027s Principle of Unity — by John Nelson Darby, 1853BIG JIM TAYLOR, LEADER OF SECT — James Taylor Jnr. obituary, The New York Times, 17 October 1970\u0022The Aberdeen Incident\u0022 July, 1970 — a compilation of material including a transcription of the Aberdeen Tapes, from the 25 July 1970 meeting following the incidentThe closed-door church: Inside the secretive and strict Plymouth Brethren sect in Manitoba — by Bill Redekop, Winnipeg Free Press, 10 May 2014Howard defends meeting the Exclusive Brethren — by Peta Donald, PM, ABC Radio National, 22 August 2007OneSchool Global NSW Enrollment Policy — accessed December 2020OneSchool Global — official website, accessed December 2020 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2021-01-19T13:15:00Z",
      "duration": "01:11:08.5910000",
      "explicit": true,
      "spotifyId": "7nzBGytGxwz97JREBEdpJz",
      "appleId": 1000505863805,
      "subjects": [
        "Plymouth Brethren Christian Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7nzBGytGxwz97JREBEdpJz",
        "apple": "https://podcasts.apple.com/podcast/exclusive-brethren-part-1/id1286328757?i=1000505863805"
      }
    },
    {
      "id": "662502a9-445b-4aa2-9896-39a8e59ee69c",
      "title": "Fire This Time",
      "description": "As a disaffected youth, Shannon Bundock was drawn to progressive ideas. In her late teens she moved into the city, to a poor neighbourhood in Vancouver, Canada, where she became hyper aware of the inequality all around her. The activists who were trying to do something about this in the early 2000s ignited her passion for radical politics. At 19, Shannon was ready to dedicate herself wholeheartedly to doing her part to change the world for the better. Five and a half years later, she’d find herself flat broke and unable to make life decisions about the simplest things, like what to wear. Guest: Shannon Bundock Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:That revolution thing? My bad — by Erin Millar, Maclean’s, 12 March 2008No Fire No Time — Ivan Drury’s blog archive of materials around his and other ex-members’ experiences in FTT, accessed November 2020Cuba Solidarity in Canada: Five Decades of People-to-People Foreign Relations — edited by Nino Pagliccia, FriesenPress, 2 December 2014Battle of Ideas Press website — accessed November 2020Fire This Time website — accessed November 2020, including Derrick O’Keefe’s private emails still online“The Movement,” Mullahs and Liberal Muddleheads: From MAWO to Revolutionary Marxism — by Andrew Malieni, Spartacist Canada, No. 152, Spring 2007 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-12-15T13:15:00Z",
      "duration": "01:33:48.4470000",
      "explicit": false,
      "spotifyId": "5v15IJHCUu7rnaK4hJaY27",
      "appleId": 1000502467101,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5v15IJHCUu7rnaK4hJaY27",
        "apple": "https://podcasts.apple.com/podcast/fire-this-time/id1286328757?i=1000502467101"
      }
    },
    {
      "id": "081292bc-67c7-4cc9-9b04-7f15567b5cde",
      "title": "The Welcomed Consensus \u002B OneTaste – Part 2",
      "description": "Natasha Tiku wrote for Gawker in 2013, “Everyone is interested in doing fun things with their bodies. But the impulse to systematize, replicate, package, sell, and build an ideology around it is uniquely Silicon Valley.” She was writing about an organisation that was monetising the female orgasm. And they weren’t the only ones doing so. Guests: Christine Talbott Acosta, Ruwan Meepagala, Sasha Nelson Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. For sexual assault resources in Australia, visit www.1800respect.org.au, and in the USA, visit www.rainn.org. Links:The Pleasure Principle — by Patricia Leigh Brown and Carol Pogash, New York Times, 13 March 2009Lafayette Morehouse — official website, accessed October 2020Lafayette Morehouse, Inc. v. The Chronicle Publishing Co., No. A067522. — 37 Cal. App. 4th 855, 44 Cal. Rptr. 2d 46, California Court of Appeal, First District, Division 5, 9 August 1995Sgt. Bilko Meets The New Culture — by Robin Green, Rolling Stone, 9 December 1971Inside The Purple People House, The Freaky, Stand-Offish Sex Cult In Northern California — by Anna Lindwasser, Ranker, 7 November 2018The Truth about RJ Testerman — Christine... Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-11-24T13:15:00Z",
      "duration": "01:16:42.9580000",
      "explicit": true,
      "spotifyId": "0qLhbGGFvZcjS6ByqzFEYf",
      "appleId": 1000500096785,
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qLhbGGFvZcjS6ByqzFEYf",
        "apple": "https://podcasts.apple.com/podcast/the-welcomed-consensus-onetaste-part-2/id1286328757?i=1000500096785"
      }
    },
    {
      "id": "e5332086-ecfa-46d2-9228-cdd4316c91f9",
      "title": "The Welcomed Consensus \u002B OneTaste – Part 1",
      "description": "Natasha Tiku wrote for Gawker in 2013, “Everyone is interested in doing fun things with their bodies. But the impulse to systematize, replicate, package, sell, and build an ideology around it is uniquely Silicon Valley.” She was writing about an organisation that was monetising the female orgasm. And they weren’t the only ones doing so. Guests: Christine Talbott Acosta, Ruwan Meepagala, Sasha Nelson Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. For sexual assault resources in Australia, visit www.1800respect.org.au, and in the USA, visit www.rainn.org. Links:The Pleasure Principle — by Patricia Leigh Brown and Carol Pogash, New York Times, 13 March 2009Lafayette Morehouse — official website, accessed October 2020Lafayette Morehouse, Inc. v. The Chronicle Publishing Co., No. A067522. — 37 Cal. App. 4th 855, 44 Cal. Rptr. 2d 46, California Court of Appeal, First District, Division 5, 9 August 1995Sgt. Bilko Meets The New Culture — by Robin Green, Rolling Stone, 9 December 1971Inside The Purple People House, The Freaky, Stand-Offish Sex Cult In Northern California — by Anna Lindwasser, Ranker, 7 November 2018 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-11-17T13:15:00Z",
      "duration": "01:28:22.4650000",
      "explicit": true,
      "spotifyId": "7MrRuBkT6GDWVprhwcPviw",
      "appleId": 1000499042008,
      "subjects": [
        "Onetaste"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7MrRuBkT6GDWVprhwcPviw",
        "apple": "https://podcasts.apple.com/podcast/the-welcomed-consensus-onetaste-part-1/id1286328757?i=1000499042008"
      }
    },
    {
      "id": "be86b5ff-4fea-45b4-98d6-cc962eeac90f",
      "title": "Two by Twos / The Truth",
      "description": "Laura McConnell was born into a fundamentalist Christian sect that claims it has no name. Former member Elizabeth Coleman told Nathan Jolly for news.com.au earlier this year that, “It is of utmost importance to them that they do not have an official name or headquarters or centrally identifiable presence anywhere on earth.” From his investigative reporting in 2013, journalist Chris Johnston estimated there were 20,000 members in Australia, and hundreds of thousands around the world. Sometimes referred to as The Truth, the Two by Twos, or the Friends and Workers, the sect has seen multiple leaders face accusations of child sexual abuse, some of which are currently in court. Laura and many former members believe that this highly secretive group should certainly be considered a cult. Special Guests: Laura McConnell, Chris Johnston Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Wings for Truth — support site for sexual assault survivors of the Two by TwosLaura McConnell’s website — including various blog posts and Links \u0026 Articles Related to The Truth SectFriends and enemies, truth and lies — by Chris Johnston, The Age, 23 September 2013Secrets, lies and sex abuse as ex-sect leader chooses life on the inside — by Chris Johnston, The Sydney Morning Herald, 28 July 2014The Truth Church: Inside the nameless church cult where TV and dancing are \u0022the devil\u0027s work\u0022 — by Amy Clark, Mamamia,... Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-10-13T13:15:00Z",
      "duration": "01:16:08.9730000",
      "explicit": true,
      "spotifyId": "6aWFcpYOx2nb0rrPLmrxxY",
      "appleId": 1000494601557,
      "subjects": [
        "Two By Twos"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aWFcpYOx2nb0rrPLmrxxY",
        "apple": "https://podcasts.apple.com/podcast/two-by-twos-the-truth/id1286328757?i=1000494601557"
      }
    },
    {
      "id": "1e00f246-dbc8-47df-a360-549311da8e91",
      "title": "Zendik Farm",
      "description": "Helen Zuman describes herself as “a tree-hugging dirt worshipper devoted to turning waste into food and the stinky guck of experience into fertile, fragrant prose.” Her memoir ‘Mating in Captivity’ details her experiences joining Zendik Farm, a commune in North Carolina with the motto ‘Stop Bitching, Start a Revolution’, which she came across in 1999. Helen stayed until 2004, but it wasn’t until the following year that she recognised she’d been in a cult. Special Guest: Helen Zuman Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 4 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Mating in Captivity: A Memoir — by Helen Zuman, She Writes Press, 2018The Green Alternative At Zendik Arts Farm, a Commune Strives for a Dollar and Change — by Fredrick Kunkle, The Washington Post, 22 January 2006Who Are These People? — by Ryan Grim, Washington City Paper, 4-10 November 2005Commune Unplugs From the World to Save It — by Tom Gorman, Los Angeles Times, 19 April 1987Leaving Zendik Farm — by Alison Rooney, The Highlands Current, 9 May 2017Wulf Zendik — Facebook pageArol Wulf-Zendik — Facebook profileThe Work of Wulf Zendik — online archive of Wulf Zendik’s writings Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-09-15T14:15:00Z",
      "duration": "01:52:53.8380000",
      "explicit": true,
      "spotifyId": "29BN7Gkj2iuElnueeqqMWA",
      "appleId": 1000491362048,
      "subjects": [
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29BN7Gkj2iuElnueeqqMWA",
        "apple": "https://podcasts.apple.com/podcast/zendik-farm/id1286328757?i=1000491362048"
      }
    },
    {
      "id": "6724108b-d83d-4233-89a5-a9891fcc8ae9",
      "title": "Interview Episode: Posadism with A.M. Gittlitz",
      "description": "Journalist A.M. Gittlitz released his book I Want to Believe: Posadism, UFOs and Apocalypse Communism earlier this year. In it, he explores the fascinating world of the Posadists – a Latin American Trotskyist group who are best known today for their zany beliefs around extra-terrestrial and dolphin intelligence. But their movement had a lot more to it than this, and in its later days would devolve into a cult around the authoritarian leadership of J. Posadas.Gittlitz drew on considerable archival research and numerous interviews with ex- and current Posadists in writing his book, and he spoke to me about the more cultic elements of this unusual socialist movement.Special Guest: A.M. Gittlitz.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.LinksI Want to Believe: Posadism, UFOs and Apocalypse Communism — by A.M. Gittlitz, 2020 (Use code POSADAS20 for 20% discount)J. Posadas, the Trotskyist Who Believed in Intergalactic Communism — an interview with A.M. Gittlitz by David Broder, Jacobin, 5 April 2020A.M. Gittlitz on Twitter, and on The Antifada podcastPromo: The Troubles podcast Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-07-21T14:15:00Z",
      "duration": "01:04:22.0990000",
      "explicit": false,
      "spotifyId": "7vvSS3gE4k84V9iUo11ZNp",
      "appleId": 1000485679902,
      "subjects": [
        "Fourth International Posadist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7vvSS3gE4k84V9iUo11ZNp",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-posadism-with-a-m-gittlitz/id1286328757?i=1000485679902"
      }
    },
    {
      "id": "0df2b85e-541a-4cc6-a302-fd2d77f9cb84",
      "title": "Children of God – Part 2",
      "description": "The Children of God, later known as The Family, became notorious for their practise called “flirty fishing”. They believed in bringing up their children to have no inhibitions around sex, but the ramifications of their approach to this would echo through the generations as trauma, and result in a shocking murder-suicide committed by the very son prophesied as the Prince who would lead them through the End Times. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:The Origins of a Movement: From \u0022The Children of God\u0022 to \u0022The Family International\u0022 — website archive from thefamily.org, 29 April 2009The Children of God: The Inside Story — by Deborah Davis \u0026 Bill Davis, Zondervan Publications, 1984The Children of God — by Robert McFarland, MD, The Journal of Psychohistory, Volume 24 Issue 4, Spring 1994The Family in Transition: The Moral Career of a New Religious Movement — by Gordon Shepherd and Gary Shepherd, research paper presented at CESNUR International Conference 2002The \u0022RNR\u0022! Destruction of the Super-Blob \u0026 the New Nationalisation — by David Berg, Mo Letter, January 1978The Pubs Purges — scanned and archived on exfamily.org, June 1991 \u0026 March 1996Summit ’93 Mama Jewels! — No.2, portion of newsletter by Karen Zerby written in 1992 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-04-21T14:15:00Z",
      "duration": "01:05:54.4160000",
      "explicit": false,
      "spotifyId": "6oBsSXS4Iy1BMEsRHBcwCG",
      "appleId": 1000472199073,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6oBsSXS4Iy1BMEsRHBcwCG",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-part-2/id1286328757?i=1000472199073"
      }
    },
    {
      "id": "106f4b33-ec53-43a0-ba7b-4b8254c9bae9",
      "title": "Children of God – Part 1",
      "description": "The Children of God, later known as The Family, became notorious for their practise called “flirty fishing”. They believed in bringing up their children to have no inhibitions around sex, but the ramifications of their approach to this would echo through the generations as trauma, and result in a shocking murder-suicide committed by the very son prophesied as the Prince who would lead them through the End Times. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:The Origins of a Movement: From \u0022The Children of God\u0022 to \u0022The Family International\u0022 — website archive from thefamily.org, 29 April 2009The Children of God: The Inside Story — by Deborah Davis \u0026 Bill Davis, Zondervan Publications, 1984The Children of God — by Robert McFarland, MD, The Journal of Psychohistory, Volume 24 Issue 4, Spring 1994The Family in Transition: The Moral Career of a New Religious Movement — by Gordon Shepherd and Gary Shepherd, research paper presented at CESNUR International Conference 2002The \u0022RNR\u0022! Destruction of the Super-Blob \u0026 the New Nationalisation — by David Berg, Mo Letter, January 1978The Pubs Purges — scanned and archived on exfamily.org, June 1991 \u0026 March 1996Summit ’93 Mama Jewels! — No.2, portion of newsletter by Karen Zerby written in 1992 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-04-14T14:15:00Z",
      "duration": "01:00:01.0310000",
      "explicit": false,
      "spotifyId": "6slgCdKRbA92jTb6qJRxuS",
      "appleId": 1000471456110,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6slgCdKRbA92jTb6qJRxuS",
        "apple": "https://podcasts.apple.com/podcast/children-of-god-part-1/id1286328757?i=1000471456110"
      }
    },
    {
      "id": "43bb8940-a261-4eb8-bea6-c8ccc8e2dde7",
      "title": "The Living Word Fellowship",
      "description": "John Robert Stevens wrote when he was just 14 years old: “My joy must be in doing His will, in being His slave, in the confidence that whatever comes to me, when following Him, is His doing. In a real sense, I make Him responsible for my life.” He was writing about Jesus Christ, but it would turn out in the decades following that he could well have been writing to his future devotees as to how they should feel about himself. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:I Saw Satan: Breaking away from a Boomer Christian cult — by Andrew Marzoni, The Baffler, No. 44, March 2019Vain Glory — documentary film by Tony Cox, 1986A Brief History of The Living Word Fellowship — internet archive of The Living Word Fellowship’s now defunct websiteThe Life of John Robert Stevens — website about John Robert Stevens by The Living Word, “a California nonprofit corporation”, accessed February 2020Frequently Asked Questions — Shiloh website, accessed February 2020An Open Letter to The Living Word Fellowship Congregation — from Shalom Abrahamson-Caples, 24 October 2018Shalom Abrahamson-Caples’ Facebook post — linking to the open letter, 25 October 2018Comparison of ‘To Be a Christian’ and excerpt from ‘The Call of the Cross’ — comparing John Robert Stevens’ 1933 text and George Herron’s 1892 text Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-03-17T13:15:00Z",
      "duration": "01:25:12.4240000",
      "explicit": false,
      "spotifyId": "07mHjZ3QJ60HOnMFClMP0E",
      "appleId": 1000468718114,
      "subjects": [
        "The Living Word Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07mHjZ3QJ60HOnMFClMP0E",
        "apple": "https://podcasts.apple.com/podcast/the-living-word-fellowship/id1286328757?i=1000468718114"
      }
    },
    {
      "id": "aed08e55-ba26-451a-9ac2-6c429f91d26f",
      "title": "The New Kadampa Tradition",
      "description": "In 1996, journalist Madeleine Bunting wrote for The Guardian UK: “Most of the 130,000 Buddhists in this country are in the caring professions, or are academics, or are part of an ex-hippy culture; they are trusting, idealistic and naive. They thought Buddhism was immune to the fanaticism and hypocrisy which riddles all religions. The controversy surrounding the NKT is shattering illusions that Buddhism was the one fail-safe religion.” Twenty years later, clinical psychologist Dr Michelle Haslam joined the NKT under that very same illusion – one that she now feels obliged to help truly shatter herself. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Geshe Kelsang Gyatso — biography by Tenzin Peljor and Carol McQuire, Tibetan Buddhism in the West blog, 2015To the Tibetan Buddhists around the world and fellow Tibetan compatriots within and outside Tibet — undated open letter with 15 Tibetan official signatoriesSeparate document regarding Geshe Kelsang\u0027s personal situation — Kelsang Gyatso statement on NKT letterhead, June 2008Recovery from The New Kadampa Tradition – A Resource Centre — website by Dr Michelle Haslam and former NKT membersPotential harm to mental and physical health through exposure to The New Kadampa Tradition (NKT-IKBU), Version 4 — by Dr Michelle Haslam, 17 January 2020Dr Michelle Haslam: Plagiarization \u0026 Misrepresentation of Research — website attributed to “Dr Robert Harrison”, archived as at 23 January 2020 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-02-11T13:15:00Z",
      "duration": "01:33:38.3900000",
      "explicit": false,
      "spotifyId": "4CxCWSXevNBsSKCFOmqGop",
      "appleId": 1000465275055,
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4CxCWSXevNBsSKCFOmqGop",
        "apple": "https://podcasts.apple.com/podcast/the-new-kadampa-tradition/id1286328757?i=1000465275055"
      }
    },
    {
      "id": "09c0c090-a3fa-464b-a6f6-422e2e50c120",
      "title": "The Garden Ashram",
      "description": "Hare Krishnas are often seen as joyous, harmless people, dancing their way through the streets, chanting to bells in their colourful robes. But in one particular Australian offshoot, a young woman named Lina told me about her not-so-harmless experiences. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:About ISKCON — background at Krishna.com, accessed November 2019What You Need to Know About Hare Krishnas — by Barbara Bradley Hagerty, NPR, 22 May 2008Wollumbin — Geographical Names Extract, Geographical Names Board, accessed November 2019Wollumbin (Mount Warning) summit track — NSW National Parks and Wildlife Service listing, accessed November 2019Hardly Krishna — by Sushi Das, The Age, 2 June 2003Judge Rejects Charges of ‘Brainwashing’ Against Hare Krishna Aides — by Murray Schumach, The New York Times, 18 March 1977Krishna Expels Leader of Group Under U.S. Probe — UPI, Los Angeles Times, 18 March 1987 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2020-01-14T13:15:00Z",
      "duration": "00:53:14.5920000",
      "explicit": false,
      "spotifyId": "5QOV5AOCBZseoLe669vQl2",
      "appleId": 1000462464886,
      "subjects": [
        "Hare Krishnas",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5QOV5AOCBZseoLe669vQl2",
        "apple": "https://podcasts.apple.com/podcast/the-garden-ashram/id1286328757?i=1000462464886"
      }
    },
    {
      "id": "9c6265ee-a944-4fbd-9260-c4c051a4f949",
      "title": "Ideal Human Environment",
      "description": "WANTED: families to volunteer to live for six months in the Australian outback “to advance the frontiers of social science.” Be part of a cutting edge research project to test the ideal human environment. In a country known for a population that loves to travel, the write-ups appealed to plenty of adventurous spirits. Little did they know the reality of what they would be getting themselves into. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:A snake in the grass — by Andrew Burrell, The Weekend Australian Magazine, 24 August 2019The Utopia Project — by Andrew Burrell, The Weekend Australian Magazine, 8 August 2015Cult friction — by Frank Robson, Good Weekend, 6 November 1999Cult leader James \u0027Taipan\u0027 Salerno jailed for repeated sexual abuse of teenage girl — by Rebecca Opie, ABC News, 29 July 2019Leader of Adelaide Cult the ‘Ideal Human Environment’ Has Been Jailed for Sexual Abuse — by Gavin Butler, VICE, 30 July 2019Salute to Adelaide Hills cult leader inspired by Gladiator movie, court told — by Rebecca Opie, ABC News, 19 October 2018 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-12-17T13:15:00Z",
      "duration": "00:47:38.2920000",
      "explicit": false,
      "spotifyId": "7kRw2rkQfNwCIfLHyK6MZy",
      "appleId": 1000459896580,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7kRw2rkQfNwCIfLHyK6MZy",
        "apple": "https://podcasts.apple.com/podcast/ideal-human-environment/id1286328757?i=1000459896580"
      }
    },
    {
      "id": "79ea667d-880d-4215-88d8-e04e699e7d29",
      "title": "The Move",
      "description": "Followers of The Move rejected mainstream society and headed into the wilderness in the 1970s, building isolated communities that were to set them up for the coming Apocalypse. Many ex-members would later tell stories of physical hardship, beatings, and worse, experienced in these communities. Move leader Sam Fife told devotees that should he ever die, they could consider it proof that he was a false prophet. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:Swindled by Faith: A Time For Reconciliation — by Richard A Kiers, Tellwell Talent, 2019Practices of Cults Receiving New Scrutiny — The New York Times, 21 January 1979From Survivor to Thriver — by Angela “Vennie” Kocsis, ICSA Today, Vol. 5, No. 3, 2014Vennie Kocsis’ website — includes various collected materials about The MoveBrother Sam Prepares His Flock For The ‘End Days’ — by Adon Taft, Charleston Daily, 10 April 1975Awaiting apocalypse in the Peace River Valley — by Douglas Todd, Vancouver Sun, 27 October 2016Peace River commune awaits imminent apocalypse: Christian community of 250 shuns TV and requires year-long courtship void of physical contact — by Douglas Todd, Vancouver Sun, 22 September 2003 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-11-12T13:15:00Z",
      "duration": "00:57:20.8480000",
      "explicit": false,
      "spotifyId": "0aFgqayHCiw5FnK27CNtFh",
      "appleId": 1000456605007,
      "subjects": [
        "The Move Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0aFgqayHCiw5FnK27CNtFh",
        "apple": "https://podcasts.apple.com/podcast/the-move/id1286328757?i=1000456605007"
      }
    },
    {
      "id": "264ff83a-1310-4f43-a888-1a56f894fa47",
      "title": "Universal Medicine",
      "description": "Australian esoteric healing organisation Universal Medicine teaches that entities known as The Four Lords of Form rule over 9-foot-tall spirits that are all around us, and that most people have lived at least 2,300 lives before. Former student Matt Sutherland told Sunday Night journalist Matt Doran that he would describe Universal Medicine’s founder Serge Benhayon as “a human wrecking ball.”CORRECTION: The \u0027groping\u0027 allegations were found to be conveyed by the publication but the court did not find that Esther Rockett had proven them true. Defences of honest opinion and qualified privilege were upheld for these allegations. This episode has been updated to remove these points. Also, Esther Rockett named herself \u0022Darkly Venus\u0022 and \u0022Pranic Princess\u0022, it was not Serge Benhayon who did so. Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention. Links:The Cult: International investigation into Serge Benhayon and Universal Medicine — by Matt Doran, Sunday Night, Channel 7, 17 February 2019Australian cult leader Serge Benhayon targeted in international investigation — by Matt Doran, Sunday Night, Channel 7, 15 May 2019The Da Vinci Mode — by David Leser, Good Weekend, 25 August 2012Universal Medicine cult founder exposed as ‘charlatan’ — by Rhian Deutrom, news.com.au, 18 February 2019Universal Medicine \u0027cult\u0027 received hundreds of thousands in charity donations from prominent donors — by Josh Robertson, ABC News, 14 September 2019 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-10-15T13:15:00Z",
      "duration": "01:17:57.6160000",
      "explicit": false,
      "spotifyId": "0XwNHeT3dr1GJiWtfp85S6",
      "appleId": 1000453623821,
      "subjects": [
        "Universal Medicine"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0XwNHeT3dr1GJiWtfp85S6",
        "apple": "https://podcasts.apple.com/podcast/universal-medicine/id1286328757?i=1000453623821"
      }
    },
    {
      "id": "b24830c9-c9fc-4d24-8e0b-f2ca2cfb7117",
      "title": "NXIVM",
      "description": "Edgar Bronfman Sr. of the Seagram liquor fortune once wrote a testimonial for a course he had taken through an organisation called Executive Success Programs, or ESP. He said, quote, “If everyone were to go through this training, the world would be a much better and safer place to live.” Seventeen years later, the leader and inner circle of that same organisation, now going under the name NXIVM, would be on trial for charges including sex trafficking, forced labour, fraud, extortion and child pornography.UPDATE: Keith Raniere sentenced to 120 years in prison. Allison Mack sentenced to 3 years in prison.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.With thanks to Audio-Technica, presenting partner for season 3 of Let\u0027s Talk About Sects.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:The Founder of “Nxivm,” a Purported Self-Help Organization Based in Albany, N.Y., Arrested for Sex Trafficking and Forced Labor Conspiracy — US Attorney\u0027s Office for the Eastern District of New YorkComplaint and Affidavit — US Attorney\u0027s Office for the Eastern District of New YorkJury Finds Nxivm Leader Keith Raniere Guilty of All Counts — US Attorney\u0027s Office for the Eastern District of New York Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-09-17T14:15:00Z",
      "duration": "01:13:00.6040000",
      "explicit": false,
      "spotifyId": "2ufbLCuxPvX062YjowKgve",
      "appleId": 1000450108782,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ufbLCuxPvX062YjowKgve",
        "apple": "https://podcasts.apple.com/podcast/nxivm/id1286328757?i=1000450108782"
      }
    },
    {
      "id": "8a854aeb-308d-4000-876e-30fcf4800a16",
      "title": "Interview Episode: The Family update with Chris Johnston",
      "description": "On the 14 June 2019, news broke in Australia that many people had been waiting on for a number of years. That news was the death of this country’s most notorious cult leader, Anne Hamilton-Byrne.In this bonus episode, I’m bringing you an interview with investigative journalist Chris Johnston, who has been looking into The Family for quite some time. He worked with director Rosie Jones on her recent documentary ‘The Cult of the Family’, and they also co-wrote a book together about the group and its history. Chris spoke to me from Melbourne.CORRECTION: In this episode I mentioned that Chris Johnston is a senior journalist for The Age. He worked with The Age for 20 years but is not currently working there.Special Guest: Chris Johnston.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:The Family: The shocking true story of a notorious cult — by Chris Johnston \u0026 Rosie Jones, Scribe Publications, 2016The Family — Documentary film website Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-07-18T07:30:00Z",
      "duration": "00:56:17.0840000",
      "explicit": false,
      "spotifyId": "59CT0tngBLlobY7v7XxgZq",
      "appleId": 1000444765529,
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/59CT0tngBLlobY7v7XxgZq",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-the-family-update-with-chris-johnston/id1286328757?i=1000444765529"
      }
    },
    {
      "id": "1a659987-32f3-4bae-99cc-4415fafad66f",
      "title": "Chung Moo Quan",
      "description": "Chung Moo Quan positioned itself as a superior martial arts school that taught eight different practices at once. Though this may have originally struck prospective students as a bargain-and-a-half, many who chose to take it up would come out the other end having lost thousands of dollars, personal relationships and job opportunities, and even their sense of self. Before the school’s founder and four other defendants were jailed in 1995, various experts had told reporters that Chung Moo Quan fit their definition of a destructive cult.Special Guest: Russell Johnson.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Deceived: The Moo Years — podcast by Russell Johnson, with many resources from his researchHerding the Moo: Exploits of a Martial Arts Cult — by Joe Smith, Trafford Publishing, 2006Investigators: Students take aim at martial arts school  — by Chris Ingalls, KING 5 News, 16 February 2005The Cult and the Con — special report by Pam Zekman, CBS 2 Chicago, 1989Chung Moonies? Critics call martial-arts club a cult of violence and greed — by Ric Kahn, The Boston Phoenix, 25 October 1991Be True to Your School — by Jennifer Vogel, City Pages, 1 April 1992The Martial Arts Cult of John C. Kim — by Laurence Gonzales, unpublished article for Penthouse, 5 May 1992 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-04-16T14:15:00Z",
      "duration": "01:04:01.2010000",
      "explicit": true,
      "spotifyId": "5rqA114yRmTFSwSfE7xj9u",
      "appleId": 1000435139892,
      "subjects": [
        "Oom Yung Doe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rqA114yRmTFSwSfE7xj9u",
        "apple": "https://podcasts.apple.com/podcast/chung-moo-quan/id1286328757?i=1000435139892"
      }
    },
    {
      "id": "f54719bb-7d8f-4cfd-823d-f5a152f004c4",
      "title": "Order of the Solar Temple",
      "description": "The Order of the Solar Temple was a secret society that would go down sharing the pages of history with Jonestown, the Branch Davidians and Heaven’s Gate. But is it fair to compare the groups? When it comes to incidents of mass violence and cults, perhaps it may be unavoidable. Because whether they ended in mass murder-suicide or a different form of violence, in spite of the striking ideological differences between them, there were some similarities – in all of these groups that ended with such undeniable tragedy.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Millennium, Messiahs, and Mayhem: Contemporary Apocalyptic Movements — by Thomas Robbins \u0026 Susan J. Palmer, Psychology Press, 1997Pont-Saint-Esprit poisoning: Did the CIA spread LSD? — by Mike Thomson, BBC News, 23 August 2010Ancient Mystical Order Rosae Crucis — AMORC international websiteThe Tragedy Of The Solar Temple Cult — by Stephen Dafoe, TemplarHistory.com, 1 April 2010A Preacher With a Dark Side Led Cultists to Swiss Chalets — by Alan Riding, The New York Times, 9 October 1994The Order of the Solar Temple: The Temple of Death — by Professor James R Lewis, Ashgate Publishing, 2013Coroner\u0027s Report into the deaths at Morin Heights, Cheiry and Salvan — in French, June 1996\u0022Our Terrestrial Journey is Coming to an End\u0022: The Last Voyage of the Solar Temple — by Jean-Francois Mayer, Nova Religio, 1999 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-03-12T13:15:00Z",
      "duration": "00:57:58.4130000",
      "explicit": false,
      "spotifyId": "1YmMP0QZJ5jrGPgGu0i2Nh",
      "appleId": 1000431636765,
      "subjects": [
        "Order of the Solar Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YmMP0QZJ5jrGPgGu0i2Nh",
        "apple": "https://podcasts.apple.com/podcast/order-of-the-solar-temple/id1286328757?i=1000431636765"
      }
    },
    {
      "id": "c1e5f97c-14b9-48a0-bf11-9f84b8934a83",
      "title": "The Seaside Sect",
      "description": "A New Zealand-born man who moved to Australia in the 1970s and started a sect, telling his eventual 9 wives and 60-plus children that he was Jesus Christ, was put behind bars for 7 years in Victoria in 2000. In spite of the fairly sensational nature of his lifestyle and crimes, his name is not well-known here, and his polygamous group gained the most media attention when a recent Bachelor Australia contestant was outed by the press for her childhood involvement.This episode we’re talking about a cult that didn’t officially have a name, but was unofficially referred to as The Seaside Sect.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Abuser kept secret through cult of fear — by Naomi Larkin, NZ Herald, 12 August 2000Meet Sam and James, the Unsuspecting Villains of Netflix\u0027s \u0027Instant Hotel\u0027 — by Pippa Raga, Distractify, 11 January 2019Cult head, 71, molested girls, trial told — AAP, The Sydney Morning Herald, 20 July 2000\u0027Harem\u0027 deserts convicted guru — AAP, The Age, 4 August 2000\u0027Guru\u0027 jailed for child molestation — News24, 11 August 2000Polygamist guru faces new child sex charges — by Katie Lapthorne, The Courier Mail, 8 March 2003Ian Francis LOWE Death Notice — New Zealand Herald, 14 April 2012The Bachelor Cult Bombshell — Alison Petrovsky, A Current Affair, 8 August 2016 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-02-12T13:15:00Z",
      "duration": "00:25:55.2000000",
      "explicit": false,
      "spotifyId": "76XTv8Dq9cqL5Vb3Syzl3W",
      "appleId": 1000429710609,
      "subjects": [
        "The Seaside Sect"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/76XTv8Dq9cqL5Vb3Syzl3W",
        "apple": "https://podcasts.apple.com/podcast/the-seaside-sect/id1286328757?i=1000429710609"
      }
    },
    {
      "id": "e283ced3-1a5e-4676-bf7c-cfc73fcfa662",
      "title": "Joy Kuo \u0026 Iphigenie Amoutzias\u0027 Story",
      "description": "Joy Kuo and her husband moved to Sydney from Taiwan in 2000, and the couple both began working for the University of Sydney Library the following year. They both studied for and gained their masters degrees, and enjoyed their work. By 2012 they had had a son together, and Joy found herself wanting to help humanity in some greater way. She was looking for something she could really dedicate herself to in her career.Iphigenie Amoutzias moved to New Zealand from Germany in 1996. She completed postgraduate studies in her new home country, and had practised Buddhism for many years. By 2011 she had reached a point in her life where something seemed to be missing. She felt that the modern world was lacking in connection, that technology was driving people apart, and that she wanted to be surrounded with a greater sense of community.Both women came across the same new age group at this point in their lives. They had no idea that years later they would find themselves broke, emotionally affected, and questioning all of their previous decisions to become involved.Special Guest: Joy Kuo \u0026 Iphigenie Amoutzias.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:KF websiteBad Vibrations – The implosion of a New Age cult — by Steve Kilgallon and Tony Wall, stuff.co.nz, July 2018NZ Cult List — Entry for KFKF Foundation webpageKF Chronicles — blog credited to Ananya Bhakt NiranjanaAwakening with Joy — YouTube channel by Joy KuoJoy’s Story — by Joy Kuo, via the Cult Information and Family Support (CIFS) website Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2019-01-15T13:15:00Z",
      "duration": "00:55:21.3910000",
      "explicit": false,
      "spotifyId": "5aJ4PPWYVwusoAHROxJcEE",
      "appleId": 1000427715491,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5aJ4PPWYVwusoAHROxJcEE",
        "apple": "https://podcasts.apple.com/podcast/joy-kuo-iphigenie-amoutzias-story/id1286328757?i=1000427715491"
      }
    },
    {
      "id": "6868fa67-d09f-4ada-9c64-a71ef455b293",
      "title": "Interview Episode: Grace J. Adams and Poia Alpha, Former Branch Davidians",
      "description": "Grace J. Adams and Poia Alpha are two sisters from New Zealand, who joined David Koresh’s Branch Davidians in the 1980s along with their other sister, the younger Rebecca. Poia left the sect in early 1990, and Grace in late 1991. Rebecca remained with the group at the compound in Waco, Texas, and perished in the fire of April 1993. Grace and Poia have recently released their memoir, called ‘Hearken O Daughter’, and I caught up with them on a recent trip to Auckland.Special Guest: Grace J. Adams and Poia Alpha.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Hearken O Daughter — by Grace J. Adams and Poia Alpha, 2018Take Back Your Life: Recovering from Cults and Abusive Relationships — by Janja Lalich and Madeleine Tobias, Bay Tree Publishing, 2006 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-12-18T13:15:00Z",
      "duration": "00:54:51.6370000",
      "explicit": false,
      "spotifyId": "0JJax0Nsy9c2fw5deg1SU9",
      "appleId": 1000426045392,
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0JJax0Nsy9c2fw5deg1SU9",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-grace-j-adams-and-poia-alpha-former/id1286328757?i=1000426045392"
      }
    },
    {
      "id": "0a404a8c-8d28-4d55-8707-118f62ed74f3",
      "title": "Outreach International – Part 2",
      "description": "Laura left Outreach International when she was 32 years old, having been born into the sect in the late 1970s. Hear her story as she relates the experience of being a young woman in a highly patriarchal and controlling organisation, the difficult decision to leave, the trauma of starting her life from scratch, and the joy that she\u0027s found in this new life – a kind that most of us take for granted. You\u0027ll also hear from other ex-members about their experiences, and where the sect stands today.Special Guest: Laura Sullivan.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Billy Graham in Australia, 1959 - Was it Revival? — by Dr. Stuart Piggin, Lucas: An Evangelical History Review, no. 6, Oct 1989Letters to the Editor — Vision Magazine, No. 9, May-June 1975Salaries for ministers rapped by church founder — by Rose Simpson, The Ottawa Journal, Wednesday July 25, 1979Outreach International websiteTony Kostas\u0027 personal websiteSeek Ye First — by Tony Kostas, Outreach International, 1975The Ultimate Attainment — by Tony Kostas, Outreach Media, 1983Building with God — series by Tony Kostas, 1985Led Into Love — by Tony Kostas, 2016 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-11-20T13:15:00Z",
      "duration": "01:22:21.7920000",
      "explicit": true,
      "spotifyId": "0sIqtaOldhQp75EGAjtEup",
      "appleId": 1000424221678,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0sIqtaOldhQp75EGAjtEup",
        "apple": "https://podcasts.apple.com/podcast/outreach-international-part-2/id1286328757?i=1000424221678"
      }
    },
    {
      "id": "0e9a56d2-b55a-4192-b3b0-e7640a625169",
      "title": "Outreach International – Part 1",
      "description": "In May 2017, a sect that started in Melbourne, Australia, 50 years ago, and has been highly secretive over the last few decades, decided to change its closed-doors policy and go public with a website. Whilst up until now very little has been known about the group except by direct conversations with former believers, its members go to government schools, attend public universities, and work in everyday jobs. They could be your neighbour, your colleague, or even a friend, and you’d have no idea what’s really going on in their private lives.CORRECTION: There is a mention of the Book of David in this episode – this was a slip of the tongue, it should be the Book of John.Special Guest: Laura Sullivan.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Billy Graham in Australia, 1959 - Was it Revival? — by Dr. Stuart Piggin, Lucas: An Evangelical History Review, no. 6, Oct 1989Letters to the Editor — Vision Magazine, No. 9, May-June 1975Salaries for ministers rapped by church founder — by Rose Simpson, The Ottawa Journal, Wednesday July 25, 1979Outreach International websiteSeek Ye First — by Tony Kostas, Outreach International, 1975The Ultimate Attainment — by Tony Kostas, Outreach Media, 1983Building with God — series by Tony Kostas, 1985Led Into Love — by Tony Kostas, 2016 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-11-13T13:15:00Z",
      "duration": "01:05:31.5590000",
      "explicit": true,
      "spotifyId": "0nvv1iX3QIzIOYZe8lgSeH",
      "appleId": 1000423774569,
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nvv1iX3QIzIOYZe8lgSeH",
        "apple": "https://podcasts.apple.com/podcast/outreach-international-part-1/id1286328757?i=1000423774569"
      }
    },
    {
      "id": "cfe895f8-4ef6-494e-a808-481052d450f0",
      "title": "The Workers’ Institute of Marxism-Leninism-Mao Tsetung Thought",
      "description": "In October of 2013, the British organisation Freedom Charity received a call on their hotline. The woman on the other end said that her housemate had been held captive in South London for 30 years.At the time of this call, Katy Morgan-Davies was 30 years old, and the period of her imprisonment was her entire life. She, and the women she lived with, believed that an invisible machine called JACKIE could control household appliances, read their thoughts, and would incinerate them if they tried to escape the man they called ‘Comrade Bala’ – who was the covert leader of the world, and, in fact, God himself.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Caged Bird — by Katy Morgan-Davies, Random House, 2018The Cult Next Door — BBC documentary directed by Vanessa Engle, 2017Aravindan Balakrishnan: the Maoist cult leader who used brutal violence and rape to strip women of their dignity — by Victoria Ward, The Telegraph, 4 December 2015Thirty Years in Captivity — by Simon Parkin, The New Yorker, 3 December 2016The Classification and Dynamics of Sectarian Forms of Organisation: Grid/Group Perspectives on the Far-Left in Britain — by Stephen Frank Rayner, PhD thesis for University College London, 1979Maoist cult follower: “I think he’s being framed” — Channel 4 News segment with Josephine Herivel, 4 December 2015The radical ideological background of \u0027slave women\u0027 suspects — by Jake Wallis Simons, The Telegraph, 24 November 2013 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-10-16T13:15:00Z",
      "duration": "00:56:49.9720000",
      "explicit": false,
      "spotifyId": "6n8uGcVsdcUSudQNmiiATT",
      "appleId": 1000421945578,
      "subjects": [
        "Lambeth Slavery Case"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6n8uGcVsdcUSudQNmiiATT",
        "apple": "https://podcasts.apple.com/podcast/the-workers-institute-of-marxism-leninism-mao/id1286328757?i=1000421945578"
      }
    },
    {
      "id": "6056b3ec-a26b-4f5d-b91c-61fb5499e502",
      "title": "Synanon",
      "description": "Synanon began as an addiction support group that gathered in a grimy Californian flat in the late 1950s. It would grow to become a well-funded utopian society throughout the late ’60s and early ’70s, before declaring itself a religion in 1974. This organisation would attract Hollywood stars like Leonard Nimoy and Jane Fonda to participate in its so-called “Game”, and eventually break up married couples, force men to have vasectomies and women to have abortions, amass assets worth tens of millions of dollars, and become entangled in a web of violence.Synanon’s leader Charles Dederich is often credited with coining the phrase “Today is the first day of the rest of your life.”Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:American National Biography: Supplement — Oxford University Press, 2002Self-Reliance — by Ralph Waldo Emerson, 1847 edition, Wikisource full textEstimating Emerson: An Anthology of Criticism from Carlyle to Cavell — edited by David LaRocca, A\u0026C Black, 1 January 2013Charles Dederich, 83, Synanon Founder, Dies — by Lawrence van Gelder, The New York Times, 4 March 1997Paul Morantz\u0027s website — with extensive writings by the attorney and investigative journalist about SynanonThe Man Who Fought the Synanon Cult and Won — by Matt Novak, Gizmodo, 27 August 2014Synanon\u0027s Sober Utopia: How A Drug Rehab Program Became A Violent Cult — by Matt Novak, Gizmodo, 20 April 2014 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-09-18T14:15:00Z",
      "duration": "01:02:51.5850000",
      "explicit": false,
      "spotifyId": "1DcxN3ri730HwX7m61GkM9",
      "appleId": 1000419994128,
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1DcxN3ri730HwX7m61GkM9",
        "apple": "https://podcasts.apple.com/podcast/synanon/id1286328757?i=1000419994128"
      }
    },
    {
      "id": "9d0828bd-5931-4526-abac-dfe0ae61f4f8",
      "title": "Branch Davidians",
      "description": "2018 marks the 25-year anniversary of a 51-day siege that ended in tragedy, following a shootout between the U.S. government and members of a sect called the Branch Davidians. The gunfire exchange lasted for well over an hour, killing four U.S. agents and six Branch Davidians, and wounding their leader Vernon Howell, also known as David Koresh. Yet this violence was just the beginning of an ordeal that would culminate in an inferno later to become known as the Waco Massacre.CW: references to manipulative behaviours, suicide, murder, and physical abuse and sexual assault, including of minors. Please consider whether this is suitable for you and those around you who may be listening too.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:The Sinful Messiah — The Waco Tribune-Herald\u0027s 7-part investigative series, 1993.The Ashes of Waco: An Investigation — by Dick J. Reavis, Syracuse University Press, 1998Breaking through the myths surrounding the 1993 Branch Davidian raid — by Lee Hancock, Dallas News, 27 February 2018Armageddon in Waco: Critical Perspectives on the Branch Davidian Conflict — by Stuart A. Wright, University of Chicago Press, 1995Four Years After the Flames of Waco, a Film Keeps the Doubts Smoldering — by Sam Howe Verhovek, The New York Times, 19 August 1997Who was David Koresh: Ex-followers describe life inside apocalyptic religious sect involved in 1993 Waco siege — by Muriel Pearson, Spencer Wilking \u0026 Lauren Effron, ABC News, 2 January 2018 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-04-17T14:15:00Z",
      "duration": "01:27:05.6910000",
      "explicit": false,
      "spotifyId": "6CBwOMMjCa2DPesxxKn4WY",
      "appleId": 1000409073426,
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6CBwOMMjCa2DPesxxKn4WY",
        "apple": "https://podcasts.apple.com/podcast/branch-davidians/id1286328757?i=1000409073426"
      }
    },
    {
      "id": "8ddded1d-7709-42f1-a47e-7cf48799dd7d",
      "title": "Interview Episode: Aum Shinrikyo update with Sarah Hightower",
      "description": "Over recent days, several of the 13 incarcerated Aum Shinrikyo members sentenced to death have been moved to new facilities, prompting speculation that their execution is imminent.In this bonus episode, a follow-up to our third episode about the infamous Japanese sect, Let\u0027s Talk About Sects spoke with a woman who has researched the group for over 16 years, and has also been in direct contact with ex-members. Sarah Hightower (who went by the name Sarah Skibtower) was kind enough to share her expertise and opinions with us ahead of this big development in the “Aum Affair”, which she considers to be one of the biggest tragedies the world has ever seen.Includes a correction from episode 3 about Aum Shinrikyo.UPDATE: The death penalty was carried out in Japan in July of 2018. Aum sympathiser Kazuhiro Kusakabe left 8 injured on 1 January 2019 when he drove into a crowd of people in the Harajuku district of Tokyo.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Aum Shinrikyo Anime OP (English Subbed) — Aum Shinrikyo anime with the real audio (correction from original episode), featuring the voice of Shoko AsaharaJapan prepares to execute up to 13 members of Aum Shinrikyo cult — by Daniel Hurst, The Guardian, 20 March 2018 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-03-21T13:15:00Z",
      "duration": "00:47:00.9890000",
      "explicit": false,
      "spotifyId": "359OaDTyiLNoSkSWLvE3PL",
      "appleId": 1000407058686,
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/359OaDTyiLNoSkSWLvE3PL",
        "apple": "https://podcasts.apple.com/podcast/interview-episode-aum-shinrikyo-update-with-sarah/id1286328757?i=1000407058686"
      }
    },
    {
      "id": "443c8a92-2fd0-4cc6-b22d-eb7476bc0532",
      "title": "The Order of St Charbel",
      "description": "William Kamm has a 10pm curfew, and is not allowed to spend time with girls under the age of 17. He is prevented from entering the Shoalhaven district of New South Wales, and his movements and communications are monitored. These are conditions of his release after serving 9 years in jail for crimes he committed against two teenage girls – yet his followers still believe that he is the next true Pope, and that the Virgin Mary speaks to him on the 13th day of every month.Special Guest: Claire Ashman.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Claire Ashman\u0027s website — where her book \u0027Lessons from a Cult Survivor\u0027 is available for pre-orderLessons From A Cult Survivor — by Claire Ashman, 2018 – book pre-sale linkA WOLF Among the SHEEP: How God\u0027s Prophet the Little Pebble Became a Womanising, Millionaire Cult Leader — by Graeme Webber, KeyStone Press, 2008The Little Pebble: The Last Pope, A Man of Contradiction, Petrus Romanus, Sinner or Saint? — by William Costellia, self-published, 1999 (volume 1)Official website of The Little PebbleWilliam \u0027Little Pebble\u0027 Kamm\u0027s supervision to continue — AAP, The Illawarra Mercury, 8 January 2016South Coast cult leader William \u0027Little Pebble\u0027 Kamm fails to have supervision order lifted — by Angela Thompson, Illawarra Mercury, 14 August 2017Cult leader and convicted sex offender William Kamm to be freed within days — AAP, The Age, 11 November 2014 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-03-13T13:15:00Z",
      "duration": "01:33:23.1860000",
      "explicit": true,
      "spotifyId": "46YBGovLKvnnYsd3WmhQLM",
      "appleId": 1000406214343,
      "subjects": [
        "Order of St Charbel"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/46YBGovLKvnnYsd3WmhQLM",
        "apple": "https://podcasts.apple.com/podcast/the-order-of-st-charbel/id1286328757?i=1000406214343"
      }
    },
    {
      "id": "3ce7ed6d-8c1e-4e5b-acae-b96da6b79eee",
      "title": "Koreshanity",
      "description": "The Koreshans believed that the earth was hollow, and that humans lived on the concave inside surface of it. They theorised that the moon and stars, and indeed the rest of the universe, was contained within. On the outside? A void. When they formed the utopian community in Estero, Florida that they called the Koreshan Unity Settlement, a common greeting of one member to another was, “We live inside.”Special Guest: Lyn Millner.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.Links:The cellular cosmogony, or, The earth, a concave sphere, Part 1 — by Koresh and Ulysses G. Morrow, The Guiding Star Publishing House, 1898The Immortal Manhood: The Laws and Processes of Its Attainment in the Flesh — by Koresh, The Guiding Star Publishing House, 1902The Allure of Immortality: An American Cult, a Florida Swamp, and a Renegade Prophet — by Lyn Millner, University Press of Florida, 2015Author turns over every rock to reveal Estero’s Koreshans — by Dayna Harpster, Spotlight Estero News Magazine, 1 November 2015Cyrus Teed, Estero\u0027s Koreshans get their due in new book — by Amy Bennett Williams, News-Press, 19 October 2015The Teed House at Koreshan State Historic Site — Video uploaded by YouTube user Florida Trailblazer, 15 November 2013Koreshan State Historic Site History — page on the Friends of Koreshan State Park websiteKoreshan State Historic Site plans for future — by Maryann Batlle, Naples Daily News, 31 July 2016Sr. Marco Pagano\u0027s YouTube Channel — Includes a variety of videos about the Earth as a concave sphere, with over 500K views to date Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-02-13T13:15:00Z",
      "duration": "00:42:29.8120000",
      "explicit": false,
      "spotifyId": "5GTxJeXfMaaaRbuCXCVEWb",
      "appleId": 1000402188284,
      "subjects": [
        "Koreshanity"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GTxJeXfMaaaRbuCXCVEWb",
        "apple": "https://podcasts.apple.com/podcast/koreshanity/id1286328757?i=1000402188284"
      }
    },
    {
      "id": "8b8b9d17-b8bb-4387-8ec9-86d3a299438f",
      "title": "Universal Knowledge",
      "description": "Carli McConkey was a 21-year-old university graduate when she decided to attend the Mind Body Spirit Festival in Sydney, and came across the stand for Life Integration Programmes. The course they offered sounded like exactly what she needed to get her life on track and realise her potential. Little did she know that this encounter was the start of a 13-year ordeal that would see her estranged from her family, under continued financial stress, a victim and perpetrator of physical assault, working untold hours of unpaid labour, and eventually, medically sterilised.Special Guest: Carli McConkey.The opinions expressed in this podcast are not necessarily those of the makers of Let\u0027s Talk About Sects.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:The Cult Effect — by Carli McConkeyCarli McConkey\u0027s websiteCult Leaders and Ballet Dancers: The Strange Rock School Lawsuit — by Victor Fiorillo, Philadelphia Magazine, 30 June 2014Alleged cult leader to settle defamation claims out of court — by Chris Calcino, Byron Shire News, 11 October 2014Ex-alleged cult members \u0027sleep well\u0027 with court case over — APN Newsdesk, The Northern Star, 11 October 2014LAKAEV v. THE ROCK SCHOOL FOR DANCE EDUCATION et al — PacerMonitor record of libel, assault, slander case – plaintiff\u0027s claims dismissed with prejudice 24 November 20149354/11 LAKAEV -V- THE AGE COMPANY LIMITED \u0026 others — Supreme Court of Queensland case file summary Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2018-01-16T13:15:00Z",
      "duration": "00:57:56.1400000",
      "explicit": true,
      "spotifyId": "3nHTGlHiCYNNl9C3HqMrXi",
      "appleId": 1000399983150,
      "subjects": [
        "Universal Knowledge"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3nHTGlHiCYNNl9C3HqMrXi",
        "apple": "https://podcasts.apple.com/podcast/universal-knowledge/id1286328757?i=1000399983150"
      }
    },
    {
      "id": "1be1e9b3-13b0-4af6-aa1f-fc50bede7a45",
      "title": "Kenja Communication",
      "description": "Ken Dyers passed away 10 years ago this year, but the organisation that he spearheaded with his partner Jan Hamilton lives on. In spite of a few parallels, this Australian organisation, called Kenja, has been listed as a suppressive group by the Church of Scientology.Jan claims that Kenja has faced decades of persecution by those who want to bring them down, including a member of parliament, and charges levied at the organisation include brainwashing, exacerbation of psychological illnesses with dire consequences, alienation from family and friends, and sexual abuse.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Kenja Concert website — Includes Jan Hamilton early biography timelineKenja Communication websiteKenja Lecture websiteGuilty Until Proven Innocent — A Kenja Communication \u0022theatre documentary\u0022 production: \u0022The incredible story of the 15 year-long attack on the reputation of Ken Dyers – in an attempt to destroy Kenja Communication, the organisation he co-founded – which ultimately led to his death at age 85.\u0022Ken Dyers: Tributes and accusations — Sydney Morning Herald, 4 August 2007Kenja Facebook page — Image of the 10th annual full page ad Kenja placed in Fairfax Media publications for the anniversary of Ken Dyers\u0027 deathKen Dyers YouTube channelBeyond Our Ken — Documentary directed by Luke Walker and Melissa Maclean, Scribble Films 2007 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2017-12-12T13:15:00Z",
      "duration": "01:17:01.9230000",
      "explicit": false,
      "spotifyId": "0GfkQOz9SReiuYNtIQ3dhq",
      "appleId": 1000397156597,
      "subjects": [
        "Kenja Communication",
        "Scientology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0GfkQOz9SReiuYNtIQ3dhq",
        "apple": "https://podcasts.apple.com/podcast/kenja-communication/id1286328757?i=1000397156597"
      }
    },
    {
      "id": "9d88b590-8ba0-49e0-a4dc-2b0afe86e9eb",
      "title": "Aum Shinrikyo",
      "description": "Twenty years ago this year, Japan was to become a nuclear wasteland, according to the leader of a sect who claimed that the only survivors would be his followers and 10% of the major cities. It was in the lead up to this year of the predicted apocalypse, 1997, that he ordered shocking acts that would eventually result in his group being labelled a terrorist organisation, and himself and 12 other sect members being sentenced to death.UPDATE 2: The death penalty was carried out in Japan in July of 2018.UPDATE: An Aum Shinrikyo update episode was released on 21 March 2018. It includes a small correction from this episode.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Profile: Shoko Asahara — BBC News, 27 February 2004A Guru\u0027s Journey – A special report. The Seer Among the Blind: Japanese Sect Leader\u0027s Rise — by Nicholas D. Kristof with Sheryl WuDunn, The New York Times, 26 March 1995Daughters of doomsday cult leader fight to save their \u0027loving\u0027 father — by Justin McCurry, The Guardian, 19 April 2006How a Religious Sect Rooted in Yoga Became a Terrorist Group — by Jennifer Latson, TIME, 20 March 2015Asahara’s No. 3 daughter writes on life during, after cult — by Keiji Hirano, Japan Times, 26 March 2015Former Aum cultist publishes memoir on gas attacks, Asahara — by Eiji Shimura, The Asahi Shimbun, 10 January 2017Sarin gas attack survivor recalls near miss on Tokyo subway — by Julian Ryall, South China Post, 19 March 2015 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2017-11-14T13:15:00Z",
      "duration": "00:59:06.4880000",
      "explicit": false,
      "spotifyId": "4R8dGExke9OqCDK2eLoN4L",
      "appleId": 1000394792725,
      "subjects": [
        "Aum Shinrikyo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4R8dGExke9OqCDK2eLoN4L",
        "apple": "https://podcasts.apple.com/podcast/aum-shinrikyo/id1286328757?i=1000394792725"
      }
    },
    {
      "id": "d2b056f8-f7a8-455e-8693-d3d2c4f90725",
      "title": "The Movement for the Restoration of the Ten Commandments of God",
      "description": "Ugandan cult The Movement for the Restoration of the Ten Commandments of God was one of the deadliest in world history, with the number of casualties similar to the infamous Jonestown massacre. The mastermind behind it? A woman who said she was receiving messages directly from the Virgin Mary.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:Report of the Parliamentary Committee on Defence and Internal Affairs on the Petition by the Orphans of the Victims of the Kanungu Church Infernos — Parliament of the Republic of Uganda, July 2014The Kanungu Massacre: The Movement for the Restoration of the Ten Commandments of God Indicted — The Uganda Human Rights Commission Periodical Report, 2002Uganda Cult’s Mystique Finally Turned Deadly — by Ian Fisher, New York Times, 2 April 2000The preacher and the prostitute — BBC News, 29 March 2000Mary’s Flames: The Long Road to Horror in Kanungu — The East African, 8 February 2001The power behind the cult — The Telegraph (UK), 2 April 2000Violence and New Religious Movements — edited by James R. Lewis, Oxford University Press 2011A party, prayers, then mass suicide — by Anne Borzello, The Guardian, 20 March 2000 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2017-10-17T13:15:00Z",
      "duration": "00:40:39.4440000",
      "explicit": false,
      "spotifyId": "0smNnoxw4vKvpxU5vImwFc",
      "appleId": 1000393637192,
      "subjects": [
        "Cult Apologists",
        "Peoples Temple",
        "Movement for the Restoration of the Ten Commandments of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0smNnoxw4vKvpxU5vImwFc",
        "apple": "https://podcasts.apple.com/podcast/the-movement-for-the-restoration-of/id1286328757?i=1000393637192"
      }
    },
    {
      "id": "2f1c5fb1-94bd-42c8-bedb-25c2b8d2ef5e",
      "title": "The Family",
      "description": "There is a 95-year-old woman in a Melbourne nursing home who dotes on a plastic baby doll. You wouldn’t guess it to look at her, but this is a woman who amassed a multi-million dollar fortune, destroyed families, and affected the lives of numerous people giving them ongoing psychological issues, some of which ended in suicide.Former police detective Lex de Man said of this women to 60 Minutes, “Of all the crimes that I investigated, she is the most evil person that I’ve ever met.”Special guest: Ben Shenton.Full research sources listed here. You can support us on Patreon or Acast\u002B, with a one-off donation, or grab some merch. Sarah Steel\u0027s debut book Do As I Say is available on audiobook now.If you have been personally affected by involvement in a cult, or would like to support those who have been, contact Cult Information and Family Support in Australia, or the International Cultic Studies Association outside of Australia.If you or someone you know is in crisis or needs support right now, please call Lifeline on 13 11 14 in Australia, or find your local crisis centre via the International Association for Suicide Prevention.Links:The Diaries of Raynor Johnson Part 1 and Part 2How to become a successful cult leader: offer love, and then withdraw it — by Mary Wakefield, The Spectator, December 2016Creating the family tree — Herald Sun, 16 August 2000Bizarrism – Strange Lives, Cults, Celebrated Lunacy — by Chris Mikul, 2002Growing up with The Family: inside Anne Hamilton-Byrne’s sinister cult — by Abigail Haworth, The Guardian, 20 November 2016‘Evil, Wicked’: What it was like to grow up in one of Australia’s most notorious cults — by Ange McCormack, Triple J, 3 August 2016The Family’s ‘living god’ fades to grey, estate remains — by Chris Johnston, The Age, 17 May 2014 Subscribe and support the production of this independent podcast, and you can access early \u002B ad-free episodes at https://plus.acast.com/s/lets-talk-about-sects.   Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2017-09-19T14:15:00Z",
      "duration": "00:48:30.9020000",
      "explicit": false,
      "spotifyId": "7Mp2LdxpxbXat5eOD5n8mD",
      "appleId": 1000392442273,
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Mp2LdxpxbXat5eOD5n8mD",
        "apple": "https://podcasts.apple.com/podcast/the-family/id1286328757?i=1000392442273"
      }
    }
  ]
}