{
  "id": "9920c4fe-c16e-422b-91c0-4c924d403371",
  "name": "Let\u0027s Keep Talking with Braxton Gilbert",
  "spotifyId": "2X7WJz6BYmiKsYLBs8jGyC",
  "appleId": 1628244183,
  "episodes": [
    {
      "id": "4cab7dc1-3a07-4474-8e3b-94bc4913b570",
      "title": "From Cult Escape to Spiritual Awakening with Angel DeSantis",
      "description": "When Angel DeSantis recounts her escape from the Children of God cult, her story isn\u0027t just a chronicle of survival; it\u0027s a beacon of transformation for anyone seeking to reclaim their life from the shadows of oppression. Our latest podcast episode is a riveting narrative of Angel\u0027s ascent from a world where free thought was shackled by doctrine to a space where divinity is a personal and empowering experience.Through candid recollections, Angel shares the complexities of her past life in the cult and the nuances of adapting to a world unfettered by dogmatic control. Her tales range from the humorous misuse of the term \u0027systemite\u0027 to the heartbreaking dissolution of her marriage, painting a vivid picture of resilience. This episode also peels back the layers on the therapeutic role of psychedelics in Angel\u0027s healing journey, inviting us to contemplate the ceremonial and transformative power of substances like ayahuasca, psilocybin mushrooms, MDMA, and ketamine.Ending on a note of gratitude and encouragement, we\u0027re reminded by Angel\u0027s powerful message to persist in our own paths toward growth. Whether you\u0027re mending from similar experiences or seeking to empower your journey through adversity, this episode promises a mix of wisdom, comfort, and inspiration that speaks to the fortitude of the human spirit. Join us for an exploration into the heart of one woman\u0027s inspiring journey from victimhood to a life rich with self-discovery and freedom.⬇️⬇️⬇️Watch this episode and many more on my Youtube channel! 👀Instagram/ Braxtongilbert",
      "release": "2024-01-15T14:00:00Z",
      "duration": "01:22:30.7780000",
      "explicit": false,
      "spotifyId": "49dYGdS9PHtZrSeXn26Oy2",
      "appleId": 1000641715116,
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/49dYGdS9PHtZrSeXn26Oy2",
        "apple": "https://podcasts.apple.com/podcast/from-cult-escape-to-spiritual-awakening-with-angel/id1628244183?i=1000641715116"
      }
    }
  ]
}