{
  "_ts": 0,
  "id": "b98d127b-fa8b-49b8-902d-1db0c6ac0b9c",
  "name": "Let\u0027s Talk Relationships",
  "spotifyId": "5mW8HBnuesb4qRkfBF7im9",
  "appleId": 1710318726,
  "episodes": [
    {
      "id": "cf10b673-eb1d-42f8-a0b3-cdaedb9b881a",
      "title": "EP 30: How to Spot a Narcissist with Licensed Therapist, Carla Litto",
      "description": "In this episode, we\u0027re shining a light on narcissists—what to look for, how to protect yourself, and why these red flags are so often missed. I’m joined by Carla Litto, a no-BS licensed therapist known for helping people break free from toxic relationship patterns. She’s also the author of Outsmarting Egomaniacs , a self-help guide for anyone tired of getting manipulated, bullied, or emotionally drained. From dating disasters to manipulative friendships and even cult-like dynamics, we break down the shady behavior that’s more common than you think—and how to stay one step ahead. About Carla Litto: Carla Litto, MA, LMFT is a licensed marriage and family therapist with a successful private practice in Los Angeles. Known as the “tell-it-like-it-is” therapist, she’s got a sharp radar for manipulation and a no-BS approach that helps clients get unstuck and take charge of their relationships. She’s the author of Outsmarting Egomaniacs, a guide to protecting yourself from bullies, abusers, and manipulators. When she’s not helping clients, Carla enjoys Brazilian Jiu-Jitsu, stand-up comedy, and pizza—with more cats than kids at home. Instagram Instagram: @letstalkrelationships_ Website: https://www.theltrpodcast.com/",
      "release": "2025-04-30T00:00:00Z",
      "duration": "00:49:51",
      "explicit": false,
      "spotifyId": "0joUfsvgUwKoQeFW7vkeRb",
      "appleId": 1000705480948,
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0joUfsvgUwKoQeFW7vkeRb",
        "apple": "https://podcasts.apple.com/podcast/ep-30-how-to-spot-a-narcissist-with-licensed/id1710318726?i=1000705480948"
      }
    }
  ]
}