{
  "_ts": 0,
  "id": "4586bafc-1c68-485d-b9a5-b5cc47665e6f",
  "name": "LFraudHubbard",
  "youTubeChannelId": "UClcCQWvRTM1VyowxXBAZmYw",
  "episodes": [
    {
      "id": "652f0930-0ac3-4c73-82ff-ff86a6bc0430",
      "title": "Churches in France",
      "description": "\u0022Scientology  was convicted in France as a \u0022Organised Fraud\u0022 by the courts.\u0022 \r\n \r\n As part of the penalties, the church was ordered to publish the results of the verdict in several national and international magazines to warn people, the judge said, about what Scientology offers and what was discovered at trial.",
      "release": "2009-11-19T04:49:58Z",
      "duration": "00:01:55",
      "explicit": false,
      "youTubeId": "kiUUXCIa_y4",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kiUUXCIa_y4"
      }
    },
    {
      "id": "0a35f42b-593e-48f1-ad2d-497b11c43e5a",
      "title": "PAULETTE COOPER Exposes Scientologys Darkest Secrets",
      "description": "**ORIGNAL FROM\r\nhttp://www.youtube.com/user/doyle6315i **\r\nIn 1971, Paulette Cooper published a book entitled, The Scandal of Scientology; it was a critical exposé of the sinister, dangerous, criminal and arcane activities and beliefs of the Church of Scientology.\r\nThe book earned her hostile attention from members of the Cult and they filed a lawsuit against her filed in Los Angeles Superior Court. Further lawsuits followed throughout the years, totaling nineteen from all over the world.\r\nThrough the next 15 years, as she continued to expose the Cult, Paulette Cooper was the target not only of litigation but of several harassment campaigns including a Scientology campaign known as OPERATION FREAKOUT, the goal of which was to have Cooper \u0022incarcerated in a mental institution or jail or at least to hit her so hard that she was put under so much stress and anxiety that she was incapable of work.\r\nThe Cult then broke into Coopers home and forged bomb threats using her typewriter and paper with her fingerprints on it. Cooper was arrested by the FBI and charged. She faced a jail sentence of 15 years.\r\nFortunately for Cooper, the Church\u0027s campaign was discovered when the FBI raided Scientology offices in 1977 and recovered documents relating to the operation. The Church finally agreed to an out-of-court settlement with Cooper in 1985 in exchange for her discontinuing her legal actions against Scientology.\r\nThis video is a unique interview with Cooper about her attack by the scientology cult.",
      "release": "2008-10-28T23:07:57Z",
      "duration": "00:10:14",
      "explicit": false,
      "youTubeId": "Aj1_ezrRVrw",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Aj1_ezrRVrw"
      }
    },
    {
      "id": "de0ac5b3-fd10-40d6-a1ef-df26985d450b",
      "title": "Scientology - Child Abuse and Labour Pt.1",
      "description": "ATTENTION!\r\nThere are many anti-Scientology videos being flagged fraudulently for copyright violations by the American Rights Counsel LLC. Upon searching for this company, it has been revealed that it doesn\u0027t exist.\r\n\r\nThis is once again a form of Internet censorship and an example that Youtube is willing to buckle under the pressure of Scientology\u0027s bullying. Even personal videos users have made themselves have been removed, citing copyright violation.\r\n\r\nOne begs to question also, why an American company has a right to call the shots over international content.\r\n\r\nThe original video this is mirrored from was one of the videos that has been targetted by the American Rights Counsel LLC. This is a massive expose on the child abuses employed by the Church of Scientology.\r\n\r\nI ASK ALL OF THIS FROM YOU! Mirror this video EVERYWHERE! Show the cult of Scientology just what a massive mistake they\u0027ve made!\r\n\r\nOriginal air date: July 7th, 2008 Reporter: Bryan Seymour P.S.,\r\n\r\nScientology, go on... keep on trying to silence us. It shows just how desperate you are. You are losing. Your cult is dying, and anything you do will only fuel the fire. You just footbulleted... again.",
      "release": "2008-10-25T07:55:48Z",
      "duration": "00:09:02",
      "explicit": false,
      "youTubeId": "N6fG9XaGzf0",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=N6fG9XaGzf0"
      }
    },
    {
      "id": "ff873bc8-1f06-4624-8589-8ec97615441f",
      "title": "Scientology - Child Abuse and Labour Pt.2",
      "description": "ATTENTION!\r\nThere are many anti-Scientology videos being flagged fraudulently for copyright violations by the American Rights Counsel LLC. Upon searching for this company, it has been revealed that it doesn\u0027t exist.\r\n\r\nThis is once again a form of Internet censorship and an example that Youtube is willing to buckle under the pressure of Scientology\u0027s bullying. Even personal videos users have made themselves have been removed, citing copyright violation.\r\n\r\nOne begs to question also, why an American company has a right to call the shots over international content.\r\n\r\nThe original video this is mirrored from was one of the videos that has been targetted by the American Rights Counsel LLC. This is a massive expose on the child abuses employed by the Church of Scientology.\r\n\r\nI ASK ALL OF THIS FROM YOU! Mirror this video EVERYWHERE! Show the cult of Scientology just what a massive mistake they\u0027ve made!\r\n\r\nOriginal air date: July 7th, 2008 Reporter: Bryan Seymour\r\n\r\nP.S., Scientology, go on... keep on trying to silence us. It shows just how desperate you are. You are losing. Your cult is dying, and anything you do will only fuel the fire. You just footbulleted... again.",
      "release": "2008-10-25T07:55:37Z",
      "duration": "00:04:12",
      "explicit": false,
      "youTubeId": "iFSunPkIZ04",
      "subjects": [
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iFSunPkIZ04"
      }
    }
  ]
}