{
  "id": "6bfa8d29-6946-48d2-86e1-aba8e663f1e3",
  "name": "Liberating Motherhood",
  "spotifyId": "7kC1RuCfZOKoZ0MLR8MXCC",
  "appleId": 1710481243,
  "episodes": [
    {
      "id": "ac5e54a4-2a46-4178-a074-5012bfc3bd30",
      "title": "8: Why coercively controlling men are never good parents with Emma Katz",
      "description": "Content warning: This podcast extensively discusses all forms of intimate partner violence, some child abuse, and briefly discusses the death of a child, but not in graphic detail. Intimate partner violence is much more than physical violence. Every physically violent perpetrator was, for a time, not physically violent. The emotionally abusive , degrading, and controlling environment these perpetrators create is ultimately what enables the physical violence. Our society recognizes only a very limited number of behaviors as abusive, which is why so many women feel shocked and stunned when their partners finally become violent. When you understand coercive control, though, it becomes clear that the violence is part of a controlling strategy. Coercive control is the environment abusers create, and it’s much more—and much worse—than just violence. While it is deeply isolating, it follows very predictable patterns. In this podcast, we talk about topics such as: What coercive control is, and why it is the norm in heterosexual relationships. Why a relationship can be abusive even if there is no physical violence. How to tell if your relationship is abusive. Why abusers abuse their partners. The most common strategies abusers use. Why abusers cannot be good fathers. Helping a child recover from exposure to domestic violence. How gender socialization renders women more vulnerable to abuse. Risk factors for the father weaponizing the child against the mother. Emma Katz, a world-renowned expert on coercive control, focuses her research and writing on the effects of coercive control on children. She dispels the notion that a man can abuse the mother but still be a “ good dad, ” and talks extensively about how courts often replicate abusive norms . These coercively controlling men might seem cunning, but they’re largely following the same playbook. Understanding that playbook empowers women to recognize abuse earlier, to identify when it is happening, and potentially, to leave. I highly recommend Dr. Katz’s Substack. Find that here . Read more about her on her website , or buy her incredible book here .",
      "release": "2024-09-25T00:00:00",
      "duration": "01:19:40.7730000",
      "explicit": false,
      "spotifyId": "7viU3yaIaY00PBBhByzMrE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7viU3yaIaY00PBBhByzMrE"
      }
    }
  ]
}