{
  "_ts": 0,
  "id": "e9b0e867-4b00-46c0-bc6c-3ce7deb20879",
  "name": "Liesbeth diary",
  "youTubeChannelId": "UCp4KCeFmF1_M-AwTFmK0P3Q",
  "episodes": [
    {
      "id": "dea0c915-bfff-4817-8599-fc0dd934b46e",
      "title": "The Secrets of Opus Dei",
      "description": "The Secrets of Opus Dei\n\n\n\nOpus Dei, (Latin: “Work of God”) in full Prelature of the Holy Cross and Opus Dei, Roman Catholic lay and clerical organization whose members seek personal Christian perfection and strive to implement Christian ideals and values in their occupations and in society as a whole. Theologically conservative, Opus Dei accepts the teaching authority of the church without question and has long been the subject of controversy; it has been accused of secrecy, cultlike practices, and political ambitions.\n\nHistory and organization\nOpus Dei was founded in 1928 in Spain by St. Josemaría Escrivá de Balaguer y Albás (canonized in 2002), a priest trained in law. Believing that daily life can be sanctifying, Escrivá sought to encourage Catholic laypeople and priests in their pursuit of holiness through their chosen professions. Opus Dei was formally approved by the Holy See in 1950 as a secular institute (i.e., a new form of religious association whose members “profess the evangelical counsels in secular life”). On November 28, 1982, Pope John Paul II, a staunch supporter of Opus Dei, established it as the first and only personal prelature in the church, with jurisdiction over people rather than a geographic area. With separate branches for men and women, the organization has been headed since 1982 by a prelate elected by its members. The prelate can establish seminaries and promote students to holy orders, but the organization remains subject to some oversight by local bishops.\n\nMembership and activities\nOpus Dei originally required new members to take a vow of obedience and chastity. Since the organization became a prelature, however, it has required only a contractual commitment to receive spiritual formation, which includes weekly classes (“circles”) and an annual religious retreat, among other activities. Members commonly practice self-sacrifice, which can include fasting and abstinence from certain pleasures, and self-mortification, such as the wearing of a cilice (which often takes the form of a spiked chain worn around the upper thigh), is not discouraged. New members serve a period of probation, which lasts at least five years, before they are fully admitted. Some members of Opus Dei, called numeraries, devote much of their time to the organization. Like priests, they are required to remain unmarried and celibate, but they live in the world and pursue secular occupations. The majority of members, however, are the supernumeraries, who are free to marry, contribute financially to Opus Dei, and demonstrate Christian virtue in their daily activities. The group is also financially assisted by cooperators, who are not members and, by permission of the Holy See, need not even be Christians. Ordained priests constitute only a tiny percentage of the organization; in 2016 they numbered some 2,100 of the almost 95,000 members worldwide.\n\nThe organization has established vocational, trade, home-arts, and agricultural centres in various parts of the world, numerous high schools, schools of business administration, and charitable activities. Opus Dei also founded and endowed (with government assistance) the University of Navarra, which is regarded by many as Spain’s finest university, and operates the Pontifical University of the Holy Cross in Rome and the University of Piura in Peru.\n\n#history #vatican #opusdei\n\nReferance:\n\n -Opus Dei (Personal Prelature) [Catholic-Hierarchy]\u0022. www.catholic-hierarchy.org. Retrieved 8 June 2019.\n\n-Decoding secret world of Opus Dei\u0022. BBC News. 16 September 2005. Retrieved 27 November 2006.\n\n-Bill Tammeus (19 October 2005). \u0022Bishop confirms connection to group\u0022. Kansas City Star.\n\n- Peter Berglar (1994). \u0022Opus Dei: Life and Works of its Founder\u0022. EWTN. Scepter. Retrieved 29 March 2008.\n \u0022Comments by the Popes on Blessed Josemaria and Opus dei\u0022.\n\n-Terry Mattingly. \u0022\u0027Da Vinci Code\u0027 mania opened up Opus Dei\u0022. Alburquerque Tribune. Archived from the original on 29 September 2007. Retrieved 2 April 2007.\n\n-\u0022Opus Dei\u0022. JosemariaEscriva.info. Retrieved 27 November 2006.\n\n-Archer, Graeme (5 October 2002). \u0022Vatican proves the power of Opus Dei Founder\u0022. The Daily Telegraph. London. Retrieved 27 November 2006.\n\n- David Van Biema (19 April 2006). \u0022The Ways of Opus Dei\u0022. Time. Archived from the original on 19 May 2006. Retrieved 24 March 2007.\n\n-Josemaría Escrivá. \u0022Opus Dei: an Association which fosters the Search for Holiness in the World\u0022. Conversations. Retrieved 13 April 2007.\n\n-\u0022Decree of Canonization\u0022. JoseMaria.info. Archived from the original on 29 June 2006. Retrieved 27 November 2006\n\n-Michael Walsh (2004). Opus Dei: An Investigation into the Powerful Secretive Society within the Catholic Church. Harper San Francisco. ISBN 0-06-075068-5.\n\n-Miriam Díez i Bosch. \u0022Opus Dei Opens its Doors to Everyone: Interview With the Vicar General of the Personal Prelature\u0022. Zenit News Agency. Archived from the original on 12 April 2008. Retrieved 2 April 2008.",
      "release": "2019-06-19T22:33:41Z",
      "duration": "00:23:58",
      "explicit": false,
      "youTubeId": "6zGAT5VKdts",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6zGAT5VKdts"
      }
    }
  ]
}