{
  "id": "1121b30e-b121-4190-b5d4-7182206ae87c",
  "name": "Life As We See It with A and A Podcast",
  "youTubeChannelId": "UCdik2UsaHGykt6yB0gJJCWA",
  "episodes": [
    {
      "id": "53cc06bc-faa9-4155-8d8b-b84ce81e73ba",
      "title": "my marriage to a narcissistic cult leader: how i escaped, healed \u0026 advice | Isabella Young",
      "description": "In this video, I interviewed Isabella Young who shared her experience of being married to a narcissistic cult leader for 8 years, how she escaped, and her journey of healing. After the loss of her first husband, her search for life\u0027s true meaning and purpose, led her to her narcissistic ex husband who started out as the leader of a trans group which quickly evolved into becoming a cult. He used lots of control and manipulative tactics like gaslighting, brainwashing, triangulation, etc to keep her and members of the cult in check. Her marriage to him lacked both physical and emotional intimacy, he constantly made her doubt her self, he blamed her for everything until she lost her self.  However, the scales fell off her eyes after the loss of her son when a search on the internet about the characteristics of a cult opened her eyes/awareness to know she had been in a cult and then began planning her escape amidst multiple threats from him.\n\nIsabella shares red flags and signs of a cult group and how to know if you are in one. She also share how she healed through connection with the divine and with nature. Her spiritual practice is all about being one with nature and allowing it heal you. If you\u0027re searching for a story of survival, healing, and overcoming a narcissistic relationship, abusive marriage/relationship, a cult or cult leader, you\u0027re in the right place! Isabella personal journey of escaping the clutches of a toxic leader and recovery is very intriguing and eye opening. From experiencing emotional manipulation to  finally break free, she held nothing back in this raw and honest account. If you\u0027re a survivor of narcissistic abuse or know someone who is, this video is a must-watch. Get ready for a story of hope, resilience, and triumph! #toxicrelationships #narcissisticabuse #storytime #truelifestory #emotionalabuse #narcissistsurvivor #relationship #marriage #divorce #podcast \n\nPlease connect with Isabella Young below: \nWebsite: www.feelingbetternaturally.love\nYouTube: Feeling Better Naturally\nSubstack: https://www.substack.com/@feelingbetternaturally\n\nChapters:\n0:00     Intro\n1:55     Isabella\u0027s early life \u0026 family dynamics\n6:00     Entering the cult: Love bombing and manipulation\n11:13   Life inside the cult: control \u0026 isolation\n14:58   Tragic loss \u0026 breaking free\n18:56   Healing \u0026 self love after trauma\n21:47   Understanding cult dynamics and red flags\n32:16   Impact of control \u0026 cult dynamics\n37:02   Healing through nature\n51:12   Final thoughts \u0026 advice for healing\n\nYou can also listen on apple/spotify:\nApple: https://podcasts.apple.com/us/podcast/life-as-we-see-it-with-a-and-a/id1699106198\nSpotify: https://open.spotify.com/show/3k4RJK3VjfFZQxgOoMaxmo",
      "release": "2025-05-06T19:00:48Z",
      "duration": "00:56:16",
      "explicit": false,
      "youTubeId": "TA83bOiWG8c",
      "subjects": [
        "Louix Dor Dempriey"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TA83bOiWG8c"
      }
    }
  ]
}