{
  "id": "2a23f2b1-9604-4b51-8933-9b92f21dc387",
  "name": "Life After Religion  - Cult Recovery",
  "youTubeChannelId": "UCZRLeRhI-dd_0aUWwtR-FNw",
  "episodes": [
    {
      "id": "0e5c23c6-72a2-47b1-9ae8-42e154355714",
      "title": "Meet Richard A. Kiers - Cult Survivor of the Cult  Known as \u0022The Move\u0022 - Escaping at Age 15 Alone!",
      "description": "Richard Tells of the Abuse and  Mind Control he Experienced and Witnessed in this Destructive Cult.  He is an author of the book:  Swindled By Faith:  A Time for Reconciliation and another coming shortly:  Silent Voices.  He has a  New Podcast:  Silent Voices and a Private Facebook Group:  Silent Voices\n\nRichard Kiers:  Facebook Group \u0026 Podcast Called:  Silent Voices\nHis Book: Swindled by Faith:  A Time for Reconciliation  Buy Here on Amazon: https://a.co/d/5FSIMpg\n\nMore About Guest: Having Grown Up and Then Escaping an Abusive Cult as a Teenager, known as, “The Move” – Our Guest Today, Richard A. Kiers will share with us just what he has endeavored to overcome as well as share insights that will hopefully encourage those on the same path – from captive slavery to ultimate freedom – mentally, emotionally, spiritually, physically and more.  Richard is the author of the book:  Swindled by Faith:  A Time for Reconciliation  https://a.co/d/5FSIMpg  which details his experience growing up in this cult and sharing the various forms of abuse he experienced and witnessed.  He since has become a prolific writer – enjoying his artistry flare by writing in various genres, autobiography, self-help, children’s books, fiction, non-fiction most of which are upcoming releases (17 books in total).  Currently, Richard is working on his 3rd book called, “Silent Voices” and has recently started his own Private Facebook Group and a Brand New Podcast all with the same name: “Silent Voices” where he helps his members wrap their heads around the tactics used by these cults – like disrupting our critical thinking processes – or freezing our emotional processing to gain and maintain control over members.  So, Richard encourages us to think for ourselves, to make our own decisions, and to get a grasp on how cult leaders think and operate and so much more.\n\nMore recently, he has been profiled in the Discovery ID Documentary Episode: “The Movement of God”  (People Magazine Investigates Cults) with another documentary in the making.\n\nRichard currently resides in Edmonton, Alberta, Canada.\n\nMore About Dan and Angela Clark:\nFacebook:  Life After Religion\nTikTok:  Life After Religion\nTikTok: Indoctrination Interrupter\nWebsite:  https://www.ProdigalJourneys.com\nAngela\u0027s: \nFacebook:  Angela\u0027s Inspirations\nWebsite:  https://www.angelasinspirations.com\nYouTube Channel:  Ex-Worldwide Truth Seekers; Angela\u0027s Inspirations \u0026 Art of Healthy Relationships",
      "release": "2024-10-23T20:58:43Z",
      "duration": "01:10:24",
      "explicit": false,
      "youTubeId": "VfNqmx0FBiw",
      "subjects": [
        "The Move Of God",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VfNqmx0FBiw"
      }
    },
    {
      "id": "651c7b12-99e8-4778-a0b6-0d5dbd75226c",
      "title": "Wow!  I Was In a Frickin Cult!  Here\u0027s How I Know.  Ex-Member of WWCG and JW - This is for Us!",
      "description": "We often wonder when we get out of an organization if we really truly were in a cult.  We think of Jim Jones, David Koresh, James Manson, etc. where people got killed for thinking they were following God through this man.  Well, there are signs of a cult which we\u0027ve gathered in here as well as the definition of a cult.  It\u0027s all very interesting.  After reading through these, we take the time to examine our cult next to the \u0022the list\u0022.  We\u0027re able to give a definitive answer after reading back through the list at the end.  OMG!\n\nAngela Clark is NOW OFFERING:  Empower Her Life Coach - helping woman find their authentic expression and freedom by getting their voices; To Do More, Be More and Have More - Hope, Friends...\nTO SCHEDULE A SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\nDan Clark is an Intuitive Breakthrough Coach\nTO SCHEDULE A SESSION:  Email Dan at myprodigaljourney@gmail.com\nhttps://www.ProdigalJourneys.com\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-05-10T23:34:38Z",
      "duration": "00:48:22",
      "explicit": false,
      "youTubeId": "Tdnay4fm13I",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Tdnay4fm13I"
      }
    },
    {
      "id": "d7c5f406-b565-4449-b09c-b93959624d7d",
      "title": "How People get Hooked By Jehovah\u0027s Witnesses! How To Never Get Hooked Ever Again By Any One!!",
      "description": "This video Gives warning advice on how people get hooked by Jehovah\u0027s Witnesses! It Shares there Watchtowers tactics, and Talks about our vulnernabilitie\u0027s due to life\u0027s ups and downs. There is a trap/ invitation on every corner. The Cults Don\u0027t Stop With Jehovah\u0027s Witnesses. There are hundreds waiting to pull you in. There Is a way to never let that happen again! This video is for, Jehovah\u0027s Witnesses, Governing Body, Disfellowshipped, Apostate, cult, cult recovery, Faithful and discreet slave, EX-JW\u0027S, recovering Jehovah\u0027s witness, Watchtower, Former Jw, Six screen of the watchtower, exposing watchtower, 2 witness rule,\nFacebook: Life After religion\nSixscreens of the watchtower: Heat To Heart With Dan And Angela\nInstagram:\nWebsite link: www.myprodigaljourneys.com",
      "release": "2021-02-27T06:39:49Z",
      "duration": "00:20:44",
      "explicit": false,
      "youTubeId": "7SSo9uinYk8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7SSo9uinYk8"
      }
    },
    {
      "id": "3d4bdf04-f8fa-4d47-9418-147b98a91dad",
      "title": "Reasoning With Jehovah\u0027s Witnesses - What Happens When You Decide To Leave",
      "description": "For more resources Check out prodigaljouneys.com",
      "release": "2018-12-05T22:30:00Z",
      "duration": "00:02:54",
      "explicit": false,
      "youTubeId": "2oAOf-475tk",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2oAOf-475tk"
      }
    },
    {
      "id": "fe4f3f24-7a13-45a4-91ad-72364a76d55c",
      "title": "What Jehovah\u0027s Witness Don\u0027t Tell You At The Door - Indoctrination and Isolation",
      "description": "For more resources Check out prodigaljouneys.com",
      "release": "2018-08-29T21:00:02Z",
      "duration": "00:03:08",
      "explicit": false,
      "youTubeId": "kM0ljbIAVC8",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kM0ljbIAVC8"
      }
    },
    {
      "id": "92a05aad-378b-4ebe-911e-c88cd7c17370",
      "title": "False Prophecies of Jehovah Witness Watchtower Organization- WARNING",
      "description": "http://ex-jehovah-witness.com  Dan Clark, ex-Jehovah Witness discusses false prophecies of Watchtower organization.  One of a series of videos about things JW Watchtower doesn\u0027t want you to know. redo with lower background music...",
      "release": "2012-01-06T02:02:19Z",
      "duration": "00:11:14",
      "explicit": false,
      "youTubeId": "GKO4bm0sxdw",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GKO4bm0sxdw"
      }
    },
    {
      "id": "a131573b-3670-499b-8731-155efd14e982",
      "title": "Jehovah Witness Watchtower List of Do\u0027s and Dont\u0027s",
      "description": "http://ex-jehovah-witness.com  Dan Clark, ex-Jehovah Witness discusses the long list  of Watchtower organization rules and list of do\u0027s and don\u0027ts.  One of a series of videos about things JW Watchtower doesn\u0027t want you to know.",
      "release": "2010-08-23T20:18:49Z",
      "duration": "00:12:05",
      "explicit": false,
      "youTubeId": "jbSeaIBsBpQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jbSeaIBsBpQ"
      }
    }
  ]
}