{
  "_ts": 0,
  "id": "a0b584a7-b29d-4028-8a3c-1bb196870fbb",
  "name": "LifeAfterLandmark",
  "youTubeChannelId": "UCqEOpXW49-TIZWkZsVuiDQg",
  "episodes": [
    {
      "id": "1dc01ef1-b122-4b40-a6cd-28ea55ffb78a",
      "title": "Continuing conversations with Anne Peterson, where is the exit?",
      "description": "what I\u0027m finding with the theme of this channel is that with the (so far) few people willing to speak about their lives AFTER participating in Landmark\u0027s Education, there is a sense of freedom in the room. I know for myself, once Chris Shelton gave me the space to talk, I couldn\u0027t stop.. and it\u0027s a bit like this with these conversations. There is a LOT to talk about, and by the same token there is a lot of information to take in for any listeners who might be researching whether or not to participate in the courses, programs, seminars... or god forbid, \u0022leadership\u0022 programs offered by Landmark Education/Landmark Worldwide.\n\nAccommodating these potential audiences has me take small steps into the lives of people in the room, and so we slowly slowly unravel this highly complex world to have it make sense for ourselves, and whoever tunes in.\n\nThrough these regular conversations with Anne Peterson, the author of \u0022Is This A Cult\u0022, we confront the line between transformation and exploitation. It\u0027s a very fine one.\n\nToday we talk about the exit, why it\u0027s important to know where that door is.. and the stepping stones Anne is building for those who can at least now see the sign.\n\nWe also spell out a few other interesting gems :)\n\nHere\u0027s where you can buy Anne\u0027s book:\nhttps://www.amazon.com.au/This-Cult-Confronting-Transformation-Exploitation/dp/B0CX8XFLWQ",
      "release": "2024-07-04T03:12:17Z",
      "duration": "01:17:49",
      "explicit": false,
      "youTubeId": "9wI-MHuUv4A",
      "subjects": [
        "Landmark",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9wI-MHuUv4A"
      }
    },
    {
      "id": "78ec05fa-5d93-4c47-b303-46f1f01666f0",
      "title": "Meet Riley Wilson, he was an introduction leader with Landmark Education",
      "description": "... and... he has lived through 3 iterations of the Introduction Leaders program, which now no longer exists.\n\nI was curious to learn about what Landmark\u0027s like now compared to back then, if anything\u0027s rrreeeeallly changed at all. \n\nWhat do you think?",
      "release": "2024-07-01T07:41:04Z",
      "duration": "01:06:55",
      "explicit": false,
      "youTubeId": "yr35UP7weSI",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yr35UP7weSI"
      }
    },
    {
      "id": "03cbb940-47e8-4d91-a2b4-9eec2bde92eb",
      "title": "conversations with Anne Peterson part 3",
      "description": "Today we talked about the differences between the Wisdom Course and Landmark\u0027s what they call \u0022Education\u0022.... and put forth some ideas about trauma within the Rosenberg family.\n\nGiven that there\u0027s a whole lot more to discuss, Anne and I have organised ourselves to upload one of these video\u0027s every two weeks, and I\u0027m planning on the next one going live. If you\u0027re online at 7.30amAEDT please put the next one in your diary for Thursday 4July.",
      "release": "2024-06-20T02:04:45Z",
      "duration": "01:10:35",
      "explicit": false,
      "youTubeId": "xePKoAhUSOs",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xePKoAhUSOs"
      }
    },
    {
      "id": "ccb47695-76c5-45d2-b0e7-fd1fd1150481",
      "title": "The conversation continues \u0026quot;Is This A Cult\u0026quot; author Anne Peterson shares more of her history",
      "description": "I know, the title is Life AFTER Landmark... however there\u0027s a lot of background to uncover first, to truly grasp the intensity of having been involved with Landmark in the first place. We touch on why it could be that people are afraid to talk, well, that\u0027s what we intended and the dynamics of the conversation took us in a round about way of uncovering the reason.\n\nAnne has a private Facebook group for anybody who would like to test the waters with their story. FB Group, and given the sensitive nature of the subject matter, she has guidelines: People must answer the questions and agree t group rules we are screening.  This group is primarily for ex-staff, leaders, assistants who are grappling to understand what happened and how to recover and heal. \n\nIf you are on Facebook and would like to \u0022talk\u0022 in an online forum setting, here is the link: https://www.facebook.com/groups/372327595646763/ \n\nAnne\u0027s interview with Chris Shelton is well worth listening to as well, she touches on some of the content in today\u0027s chat:\nhttps://www.youtube.com/watch?v=mFmJBxrgnsY\u0026ab_channel=ChrisShelton%2CMSc \n\nWe\u0027ll be sharing more of our experiences \u002B/- every two weeks. If you\u0027re not subscribed already it might be a good idea.",
      "release": "2024-06-08T00:13:58Z",
      "duration": "01:02:29",
      "explicit": false,
      "youTubeId": "uN3lZPgtGpA",
      "subjects": [
        "Landmark",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uN3lZPgtGpA"
      }
    },
    {
      "id": "e46b8cec-ed9e-4ed0-bd11-9ebc3350a035",
      "title": "LifeAfterLandmark Live Stream",
      "release": "2024-03-18T10:26:53Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "krJs5hkmskQ",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=krJs5hkmskQ"
      }
    },
    {
      "id": "1d854998-207b-4dbf-88ab-c5b20efe4a90",
      "title": "First interview with an ex-staff person, meet \u0022X\u0022",
      "description": "X prefers to keep the black screen up during this interview and she gives the reason for that, it\u0027s probably not what you\u0027re thinking! here she goes into detail about her life after Landmark and why she was drawn to the organisation - like a moth to a flame.\n\nNow that the first one is done, I sense it\u0027s the first of many more, she has a lot to say.",
      "release": "2024-03-18T07:41:46Z",
      "duration": "01:23:57",
      "explicit": false,
      "youTubeId": "A15994U4HJc",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A15994U4HJc"
      }
    },
    {
      "id": "e0fca95b-835e-43d3-ab7e-092cc416d099",
      "title": "Life After Landmark",
      "description": "Hi, I\u0027m Dale Dickins and I was \u0022on staff\u0022 with Landmark Education and Landmark Education Corporation (when it transitioned). I was employed as Manager for the Assisting Program, Self Expression and Leadership registration, the Communication Curriculum I completed the Course Supervisor Program, was also the Participation Manager for (at the time) Australia\u0027s smallest \u0022Centre\u0022 in Perth, Western Australia and I had a short stint as a Self Expression and Leadership Program Leader.\n\nWhen I finally \u0022completed\u0022 as a Staff person and left the company, I was left very confused and tormented for 18 years until I finally plucked up the courage to contact Chris Shelton who I\u0027d been listening to regularly to make sense of my experience. Ex-Scientologists were speaking a language I understood and I soaked up all the information I could... astounded at the similarities. \n\nThe ontological shift I\u0027ve experienced since that interview is what has me create this channel. The intent is to create a (safe) space for people to speak, to realise they are not going crazy. Those questionable events did happen... and, Landmark is correct, airing what has been suppressed.... saying those things that can\u0027t be said... it really does work. \n\nIf you have something to say about your experience with Landmark, please contact me, let\u0027s talk.",
      "release": "2024-01-04T01:16:38Z",
      "duration": "00:00:50",
      "explicit": false,
      "youTubeId": "06R336cwad8",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=06R336cwad8"
      }
    }
  ]
}