{
  "id": "a0b584a7-b29d-4028-8a3c-1bb196870fbb",
  "name": "LifeAfterLandmark",
  "youTubeChannelId": "UCqEOpXW49-TIZWkZsVuiDQg",
  "episodes": [
    {
      "id": "04b246cd-f174-493f-977a-69f1745b52bd",
      "title": "Anne Peterson\u0026#39;s life after Landmark, what\u0026#39;s been happening?",
      "description": "After a few weeks of silence we thought we\u0027d simply press record and explore what happens with this one question. We went into different tangents as we do, free flowing in one direction then the other.\n\nIn a way this is a light hearted conversation about pivotal questions for humans, or, the human potential movement.",
      "release": "2024-09-05T03:21:32Z",
      "duration": "01:31:05",
      "explicit": false,
      "youTubeId": "XKLkVTpMRRM",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XKLkVTpMRRM"
      }
    },
    {
      "id": "2bd15d47-ccbe-46c2-8cf2-730c157a37b7",
      "title": "It\u0027s already time to talk about Landmark\u0027s Life After Landmark!!",
      "description": "Anne Peterson, author of \u0022Is This a Cult?\u0022 joins me again with an update on Landmark\u0027s state of affairs since she published her book 7 March this year - they\u0027ve filed for bankruptcy and made a huge cut back in staff. \n\nWe talk about how this could have happened, was it the pandemic or were they already destined for closure pre-Covid?",
      "release": "2024-08-08T12:13:08Z",
      "duration": "01:25:50",
      "explicit": false,
      "youTubeId": "vacBHIDmlXo",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vacBHIDmlXo"
      }
    },
    {
      "id": "fc7034c6-3bd7-4552-9be2-259343e47d36",
      "title": "Ann Betz shares (some of) her Life After Landmark",
      "description": "Now that we have covered some of the background it seems the perfect time to ask Ann what has happened in her life since she left Landmark\u0027s Education.. and what was the pivotal moment that had her choose to remove herself?\n\nThis conversation completes our intention to close the loop we opened. Next week, Ann will be podcasting with Brian Nord, and other interesting channels are opening up for her too.\n\nWe will very possibly cross paths in this very small circle called Landmark Education, it\u0027s really not as big as many people think... and I think it\u0027s shrinking to unmanageable levels (based on the statistics Riley has been sharing). \n\nIn this, the era of transparency... companies hiding secrets are really struggling, and Landmark is no exception.",
      "release": "2024-07-31T10:11:20Z",
      "duration": "01:10:53",
      "explicit": false,
      "youTubeId": "qP_QjIJRqjs",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qP_QjIJRqjs"
      }
    },
    {
      "id": "d3fc5922-1dcf-4674-9b6e-4d18fe026d5e",
      "title": "Forking Landmark with Ann Betz",
      "release": "2024-07-24T10:10:57Z",
      "duration": "01:10:54",
      "explicit": false,
      "youTubeId": "GjU-k-9t4Kk",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GjU-k-9t4Kk"
      }
    },
    {
      "id": "9465ffc8-5592-40df-b4fa-2bcfccc85800",
      "title": "Exploring that very fine line between transformation and exploitation.",
      "description": "Anne and I dive into agreements, what each of us \u0022make them mean\u0022 (as we would say in Landmark). We navigate our way through coercion vs giving people the freedom to participate voluntarily.. and all the murky stuff in between. We touch on giving people room to negotiate the terms and conditions.. and prepare ourselves for future conversations that enable people to TRULY choose.",
      "release": "2024-07-18T02:38:30Z",
      "duration": "01:13:35",
      "explicit": false,
      "youTubeId": "dwbzxySv6oY",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=dwbzxySv6oY"
      }
    },
    {
      "id": "caa48b16-ca58-4f12-a215-1e4d30cfe951",
      "title": "To agree or not to agree... that is the hook.",
      "description": "agreements begin in the very early days and build over time as more response-ability is given to the people assisting - and growing the enterprise known as Landmark Education.\n\nRiley explains the steps to what Landmark call \u0022leadership\u0022",
      "release": "2024-07-15T11:31:17Z",
      "duration": "01:06:56",
      "explicit": false,
      "youTubeId": "BH3UxCH94S4",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BH3UxCH94S4"
      }
    },
    {
      "id": "56d77c80-5571-467c-8650-35ab63ff3500",
      "title": "Ann Betz and Fruit of the Poisonous Tree",
      "description": "An applied neuroscientist with a sub-speciality in trauma, Ann connected to share some of her perspective on life after landmark. The topics she\u0027s raising are well worth opening the channel to explore at a deeper level. \n\nToday, the beginning we touch on a few of those topics to give you a sense of how conversations with Ann could develop.\n\nWhat I\u0027m particularly interested in are the forks that have taken the \u0027guts\u0027 of EST/Landmark Education, Corporation \u0022worldwide\u0022 and spread like tentacles around the world. And, we hardly touched on that in this, our first podcast. \n\nFirst we found some common ground in the good ol\u0027 days.. because some things never change in this tiny little world of transformation!",
      "release": "2024-07-10T05:18:35Z",
      "duration": "01:16:38",
      "explicit": false,
      "youTubeId": "t-2qDf2OLmc",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=t-2qDf2OLmc"
      }
    },
    {
      "id": "78910bca-d37a-4c6d-8a1d-38fdb178f665",
      "title": "Riley rips the Introduction Leaders program apart",
      "description": "As promised we... well, we start to and then we go off track a little... we take the leadership program apart, and some of what Riley shares has me horrified. \n\nHas me wonder what do people from the early days think about the state of Landmark now??",
      "release": "2024-07-08T14:10:31Z",
      "duration": "01:12:16",
      "explicit": false,
      "youTubeId": "qL1BJoxqxHY",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qL1BJoxqxHY"
      }
    },
    {
      "id": "78ec05fa-5d93-4c47-b303-46f1f01666f0",
      "title": "Meet Riley Wilson, he was an introduction leader with Landmark Education",
      "description": "... and... he has lived through 3 iterations of the Introduction Leaders program, which now no longer exists.\n\nI was curious to learn about what Landmark\u0027s like now compared to back then, if anything\u0027s rrreeeeallly changed at all. \n\nWhat do you think?",
      "release": "2024-07-01T07:41:04Z",
      "duration": "01:06:55",
      "explicit": false,
      "youTubeId": "yr35UP7weSI",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yr35UP7weSI"
      }
    },
    {
      "id": "03cbb940-47e8-4d91-a2b4-9eec2bde92eb",
      "title": "conversations with Anne Peterson part 3",
      "description": "Today we talked about the differences between the Wisdom Course and Landmark\u0027s what they call \u0022Education\u0022.... and put forth some ideas about trauma within the Rosenberg family.\n\nGiven that there\u0027s a whole lot more to discuss, Anne and I have organised ourselves to upload one of these video\u0027s every two weeks, and I\u0027m planning on the next one going live. If you\u0027re online at 7.30amAEDT please put the next one in your diary for Thursday 4July.",
      "release": "2024-06-20T02:04:45Z",
      "duration": "01:10:35",
      "explicit": false,
      "youTubeId": "xePKoAhUSOs",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xePKoAhUSOs"
      }
    },
    {
      "id": "e46b8cec-ed9e-4ed0-bd11-9ebc3350a035",
      "title": "LifeAfterLandmark Live Stream",
      "release": "2024-03-18T10:26:53Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "krJs5hkmskQ",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=krJs5hkmskQ"
      }
    },
    {
      "id": "1d854998-207b-4dbf-88ab-c5b20efe4a90",
      "title": "First interview with an ex-staff person, meet \u0022X\u0022",
      "description": "X prefers to keep the black screen up during this interview and she gives the reason for that, it\u0027s probably not what you\u0027re thinking! here she goes into detail about her life after Landmark and why she was drawn to the organisation - like a moth to a flame.\n\nNow that the first one is done, I sense it\u0027s the first of many more, she has a lot to say.",
      "release": "2024-03-18T07:41:46Z",
      "duration": "01:23:57",
      "explicit": false,
      "youTubeId": "A15994U4HJc",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A15994U4HJc"
      }
    }
  ]
}