{
  "_ts": 0,
  "id": "d9370c6d-773d-4ccd-9f58-912fc24965d2",
  "name": "Life After PTSD",
  "youTubeChannelId": "UCdyYC_IWzXuSRkFM2wZdhNA",
  "episodes": [
    {
      "id": "13ec8102-d83a-4a2a-98f3-2b0cc78e0d4e",
      "title": "The Ultimate Betrayal: Breaking Free From The Narcissistic Family Cult",
      "description": "Hello everybody it\u0027s Nathan here and I want to thank you for coming to my channel. \n\nIn the last few days I\u0027ve had a whole bunch of major realizations to do with my past. What happened to me and why I wound up in this place? And one assured with you here, because it\u0027s it is my sincere hope that whatever I say will help those of you who are coming to my channel and looking at. \n\nWhat I have to say about narcissism and also how narcissism is similar to being in a cult group and that\u0027s actually a big part of my history. So one of the videos that I\u0027m going to be doing are actually a series of videos will be about the topic of mind control. And how? \n\nNarcissistic relationships and families mimic a cult group and so that information is going to be drawn from a book called thought reform in the psychology of totalism by Robert J Lifton, and I believe it was written in the 1950s. And for a very long time, it was the manual, if you will, a handbook for deprogrammers. Who were using these these points in the book? To get people out of call groups, including myself, when I was in one, many, many years ago. \n\n~~~~ excerpt\n\nMy e-mail address is visualvisualartist49 AT gmail.com so. Thanks for watching and I will see you in the next video.",
      "release": "2025-01-10T18:41:47Z",
      "duration": "00:08:57",
      "explicit": false,
      "youTubeId": "qxTlVFcig-0",
      "subjects": [
        "Family Cult",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qxTlVFcig-0"
      }
    },
    {
      "id": "a92ec664-eaf1-4db3-89eb-bd4b35e4fbd8",
      "title": "The Narcissistic Family Cult",
      "description": "#npd #narcissist #narcissisticfamilycult #bipolar #mentalillness \n\nHey everybody. My name is Nathan Segal and I want to welcome you to my channel. So chances are you\u0027re looking at the title and you\u0027re thinking how in the world did he come up with that well. It\u0027s both simple and complex, but essentially. \n\nWhen I was 19 years old, I was in a religious cult. Was under this group. They called themselves a born again Christians and they were a part of a church called First Assembly Pentecostal in Calgary. \n\nYears later I was chatting with a friend of mine, a guy by the name of Mike Kropveld, and Mike runs the Citizens Information Center in Montreal and it\u0027s all about helping people who are involved with call groups or want to get out of them? \n\nI was sitting with Mike day and we were talking and he said, I know why you were so susceptible to winding up in a cult. I\u0027m sitting there going. Yeah, really. He said. You grew up in a cult. Your family, your parents were cult leaders. \n\nIt was one of those pie in the face moments that I I have to tell you because I instantly recognized that he was right. And. Explained so much and it also tied into another thing that happened after my mother died. \n\nYou know, I\u0027ve been a part of a group where we were talking about post traumatic stress disorder and for a year, people were yapping about narcissism. Every time they did it were. No, no, I I I don\u0027t want to hear it. Leave me alone. And then my mother died. And then a guy I know by the name of Mark Santos, he sent me a video to a guy by the name of Ross Rosenberg, and he was about covert narcissism.\n\nNow, for decades before that, my family, I was trying to figure out what went wrong, why my family was so weird, why there was so much. What I could see is mental illness. I thought it was bipolar. That\u0027s what seemed to be the diagnosis, but I didn\u0027t know any. I was sitting there one day. I got this video. I watched it and afterwards I just thought oh shit!, because I instantly recognized my mother as a covert narcissist. My father as a narcissist and my brother and all of a sudden everything fell into place and I understood. \n\nAnd that\u0027s where so much of this came from. So anyway, what you\u0027re going to see on this side are snippets of my story. Highlights different things that I learned over the years. \n\nIf you have any questions, reach out to. I\u0027ll do my best to answer them for you, and if you need coaching, I know of a couple of great coaches I can refer you to and I\u0027ve got some great resource material as well. So anyway, thanks for watching and I\u0027ll look forward to any questions you might have. Bye for now.",
      "release": "2024-12-29T19:52:14Z",
      "duration": "00:03:04",
      "explicit": false,
      "youTubeId": "H4Vrvon7nKk",
      "subjects": [
        "Family Cult",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=H4Vrvon7nKk"
      }
    }
  ]
}