{
  "_ts": 0,
  "id": "2a23f2b1-9604-4b51-8933-9b92f21dc387",
  "name": "Life After Religion  - Cult Recovery",
  "youTubeChannelId": "UCZRLeRhI-dd_0aUWwtR-FNw",
  "episodes": [
    {
      "id": "651c7b12-99e8-4778-a0b6-0d5dbd75226c",
      "title": "Wow!  I Was In a Frickin Cult!  Here\u0027s How I Know.  Ex-Member of WWCG and JW - This is for Us!",
      "description": "We often wonder when we get out of an organization if we really truly were in a cult.  We think of Jim Jones, David Koresh, James Manson, etc. where people got killed for thinking they were following God through this man.  Well, there are signs of a cult which we\u0027ve gathered in here as well as the definition of a cult.  It\u0027s all very interesting.  After reading through these, we take the time to examine our cult next to the \u0022the list\u0022.  We\u0027re able to give a definitive answer after reading back through the list at the end.  OMG!\n\nAngela Clark is NOW OFFERING:  Empower Her Life Coach - helping woman find their authentic expression and freedom by getting their voices; To Do More, Be More and Have More - Hope, Friends...\nTO SCHEDULE A SESSION:  Email Angela:  angelasinspirations@gmail.com  \nWebsite https://www.AngelasInspirations.com (under construction) but can schedule your appointment here soon.\nDan Clark is an Intuitive Breakthrough Coach\nTO SCHEDULE A SESSION:  Email Dan at myprodigaljourney@gmail.com\nhttps://www.ProdigalJourneys.com\n\nJOIN US EVERY SUNDAY AT 10:00AM\nZOOM/PODCAST - SUNDAY MORNINGS - PROGRAM:  \u0022Spiritual Discoveries\u0022 with Dan \u0026 Angela Clark\n10:00am MST.\nZOOM/PODCAST LINK: https://us06web.zoom.us/j/87175205956?pwd=ncbaqL3elb08av5U5n5FXZ9QyJpHpJ.1\n\nMeeting ID: 871 7520 5956\nPasscode: 777992\nDonations Welcome:  Link:  https://paypal.me/CoachMe777?country.x=US\u0026locale.x=en_US",
      "release": "2024-05-10T23:34:38Z",
      "duration": "00:48:22",
      "explicit": false,
      "youTubeId": "Tdnay4fm13I",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Worldwide Church Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Tdnay4fm13I"
      }
    }
  ]
}