{
  "_ts": 0,
  "id": "a0b584a7-b29d-4028-8a3c-1bb196870fbb",
  "name": "LifeAfterLandmark",
  "youTubeChannelId": "UCqEOpXW49-TIZWkZsVuiDQg",
  "episodes": [
    {
      "id": "ccb47695-76c5-45d2-b0e7-fd1fd1150481",
      "title": "The conversation continues \u0026quot;Is This A Cult\u0026quot; author Anne Peterson shares more of her history",
      "description": "I know, the title is Life AFTER Landmark... however there\u0027s a lot of background to uncover first, to truly grasp the intensity of having been involved with Landmark in the first place. We touch on why it could be that people are afraid to talk, well, that\u0027s what we intended and the dynamics of the conversation took us in a round about way of uncovering the reason.\n\nAnne has a private Facebook group for anybody who would like to test the waters with their story. FB Group, and given the sensitive nature of the subject matter, she has guidelines: People must answer the questions and agree t group rules we are screening.  This group is primarily for ex-staff, leaders, assistants who are grappling to understand what happened and how to recover and heal. \n\nIf you are on Facebook and would like to \u0022talk\u0022 in an online forum setting, here is the link: https://www.facebook.com/groups/372327595646763/ \n\nAnne\u0027s interview with Chris Shelton is well worth listening to as well, she touches on some of the content in today\u0027s chat:\nhttps://www.youtube.com/watch?v=mFmJBxrgnsY\u0026ab_channel=ChrisShelton%2CMSc \n\nWe\u0027ll be sharing more of our experiences \u002B/- every two weeks. If you\u0027re not subscribed already it might be a good idea.",
      "release": "2024-06-08T00:13:58Z",
      "duration": "01:02:29",
      "explicit": false,
      "youTubeId": "uN3lZPgtGpA",
      "subjects": [
        "Landmark",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uN3lZPgtGpA"
      }
    },
    {
      "id": "e46b8cec-ed9e-4ed0-bd11-9ebc3350a035",
      "title": "LifeAfterLandmark Live Stream",
      "release": "2024-03-18T10:26:53Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "krJs5hkmskQ",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=krJs5hkmskQ"
      }
    },
    {
      "id": "1d854998-207b-4dbf-88ab-c5b20efe4a90",
      "title": "First interview with an ex-staff person, meet \u0022X\u0022",
      "description": "X prefers to keep the black screen up during this interview and she gives the reason for that, it\u0027s probably not what you\u0027re thinking! here she goes into detail about her life after Landmark and why she was drawn to the organisation - like a moth to a flame.\n\nNow that the first one is done, I sense it\u0027s the first of many more, she has a lot to say.",
      "release": "2024-03-18T07:41:46Z",
      "duration": "01:23:57",
      "explicit": false,
      "youTubeId": "A15994U4HJc",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A15994U4HJc"
      }
    },
    {
      "id": "e0fca95b-835e-43d3-ab7e-092cc416d099",
      "title": "Life After Landmark",
      "description": "Hi, I\u0027m Dale Dickins and I was \u0022on staff\u0022 with Landmark Education and Landmark Education Corporation (when it transitioned). I was employed as Manager for the Assisting Program, Self Expression and Leadership registration, the Communication Curriculum I completed the Course Supervisor Program, was also the Participation Manager for (at the time) Australia\u0027s smallest \u0022Centre\u0022 in Perth, Western Australia and I had a short stint as a Self Expression and Leadership Program Leader.\n\nWhen I finally \u0022completed\u0022 as a Staff person and left the company, I was left very confused and tormented for 18 years until I finally plucked up the courage to contact Chris Shelton who I\u0027d been listening to regularly to make sense of my experience. Ex-Scientologists were speaking a language I understood and I soaked up all the information I could... astounded at the similarities. \n\nThe ontological shift I\u0027ve experienced since that interview is what has me create this channel. The intent is to create a (safe) space for people to speak, to realise they are not going crazy. Those questionable events did happen... and, Landmark is correct, airing what has been suppressed.... saying those things that can\u0027t be said... it really does work. \n\nIf you have something to say about your experience with Landmark, please contact me, let\u0027s talk.",
      "release": "2024-01-04T01:16:38Z",
      "duration": "00:00:50",
      "explicit": false,
      "youTubeId": "06R336cwad8",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=06R336cwad8"
      }
    }
  ]
}