{
  "_ts": 0,
  "id": "47d6db6b-cf73-4d8d-9fba-f990a574acf0",
  "name": "Life After Leaven w/ Tamice Spencer-Helms",
  "spotifyId": "1MqOlWPkKdmqobDiXCItbX",
  "appleId": 1679856218,
  "episodes": [
    {
      "id": "e2c5d50c-04e3-4ee8-ab38-2615bb1954a6",
      "title": "Healing From Religious Trauma",
      "description": "Have you ever felt the ground beneath your religious beliefs quiver and crack? Join me, Spencer Helms, alongside Darren Slade of the Global Center for Religious Research, as we venture into the heartache and complexity of religious trauma. Through our conversation, we shine a light on the psychological toll of departing from a faith-based community, discuss the nuances of toxic Christianity, and contemplate the evolving landscape of American evangelicalism. Our personal accounts intersect with broader discussions on the marginalization of black and queer identities, offering a raw, unfiltered look at the very real impacts of religious indoctrination and exclusion. Navigating the murky waters of faith and politics can leave anyone gasping for air. In this episode, Darren and I dissect the tight weave of American Christianity with political ideologies, pondering the future of a religion at the brink of institutional collapse. We also provide a lifeline for those swimming through the aftermath of religious trauma, highlighting resources like Recovering from Religion. By widening one\u0027s literary horizon, we argue, one can foster resilience and growth in the wake of deconstructing fundamentalist beliefs. My journey from a tumultuous post-high school period to finding solace in religion, only to grapple with its darker sides, serves as a testament to the transformative power of self-enquiry and education. The path to intellectual freedom is often strewn with obstacles, yet it’s a journey worth embarking upon. For those who have walked through the fire of religious trauma or wrestled with the shackles of cult-like environments, this episode is a guiding beacon. We wrap up our deep-dive with a discussion on essential readings that informed our transformative experiences and a spotlight on the certifications offered by Darren\u0027s organization, aiding anyone on the road to recovery. This is more than an exchange of ideas—it\u0027s a harbinger of healing, a call to rethink our spiritual journeys, and an invitation to reshape our understanding of religion\u0027s role in our lives. Support the show Life After Leaven is sponsored by Sub:Culture Incorporated , a 501c3 committed to eradicating cultural, social, spiritual, financial, and academic barriers for Black College Students. If you are interested in giving a tax deductible donation toward our work with black college students, you can do that here . Thank you for helping us ensure temporary roadblocks don\u0027t become permanent dead ends for students with marginalized identities. You can follow us on Instagram: @subc_incorporated , Facebook: facebook.com/subcultureinco , and Twitter: @subcultureinco1 . Our episodes are written and produced by Tamice Namae Speaks LLC. Don’t miss out on what Tamice has planned next! Follow her on Instagram and Twitter , or subscribe to her Patreon page.",
      "release": "2024-03-21T10:00:00Z",
      "duration": "00:55:25.8310000",
      "explicit": false,
      "spotifyId": "3MMg4dBVy3tbjs2eHRhAHY",
      "appleId": 1000649981843,
      "subjects": [
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3MMg4dBVy3tbjs2eHRhAHY",
        "apple": "https://podcasts.apple.com/podcast/healing-from-religious-trauma/id1679856218?i=1000649981843"
      }
    }
  ]
}