{
  "id": "f594a64f-cd5f-4886-8080-e98e271ed840",
  "name": "Life’s Checkmark",
  "spotifyId": "1RzjiymntY8HvP42EAcdjz",
  "appleId": 1655532499,
  "youTubeChannelId": "UCY9CNwbPyxll9fRyPZ45jqQ",
  "episodes": [
    {
      "id": "bf143024-b66f-4254-a8d0-ec11c2b2ea04",
      "title": "Escaping a Cult, Finding Purpose: Martha’s Journey Through Hell \u0026 Toward Healing EP | 153",
      "description": "Escaping a Cult, Finding Purpose: Martha’s Journey Through Hell \u0026 Toward Healing EP | 153 In this episode of Life’s Checkmark, I talk with Martha Kartaoui, an incredible woman who escaped a life of strict control and trauma in a religious cult. Together, we unpack Martha’s brave journey and how she found the strength to break free, face her past, and use her story to help others heal. Martha opens up about what it means to be a “battle angel,” the hard choices she made for her future, and the role faith played in her healing. This episode is all about hope, resilience, and the power of choice. If you or someone you know is carrying weight from the past, Martha’s insights and honesty will lift you up. 5 Key Takeaways: Trauma looks different for everyone Healing is a choice and a journey You are not your pain or your past Connection fuels growth and resilience Faith and self-worth shape recovery Connect with Martha Kartaoui: Facebook: https://www.facebook.com/martha.kartaoui Instagram: https://www.instagram.com/marthakartaoui/ TikTok: https://www.tiktok.com/search?q=let%20glory%20shine\u0026t=1749513531289 Let Glory Shine TV On Prospera Network https://www.youtube.com/@prosperatvnetwork Get Martha’s book: Glory Going All In https://a.co/d/8Czob03 Subscribe to our newsletter: https://www.lifescheckmark.com Ready to start your podcast? Grab my free Podcast Worksheet now and take the first step toward your dream podcast: https://www.lifescheckmark.com/freeresource Ready to elevate your podcasting game? Whether you\u0027re a podcaster, an aspiring podcaster, or a podcast guest enthusiast, the Podcaster\u0027s Hub is your go-to community! Learn about all of the perks and Join! ⁠⁠https://www.lifescheckmark.com/podcastershub Listen to Life’s Checkmark Podcast: Apple: https://podcasts.apple.com/us/podcast/lifes-checkmark-real-journeys-inspiration-motivation/id1655532499 Spotify: https://open.spotify.com/show/1RzjiymntY8HvP42EAcdjz?si=a7ccc512bd264ef7",
      "release": "2025-06-10T08:00:00Z",
      "duration": "00:40:13.2410000",
      "explicit": true,
      "spotifyId": "7qnm6WppAtoNhmfKoCYy5x",
      "appleId": 1000712227727,
      "youTubeId": "vwz3KQIMr3M",
      "subjects": [
        "Samanta Roy Institute of Science and Technology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7qnm6WppAtoNhmfKoCYy5x",
        "apple": "https://podcasts.apple.com/podcast/escaping-a-cult-finding-purpose-marthas-journey/id1655532499?i=1000712227727",
        "youtube": "https://www.youtube.com/watch?v=vwz3KQIMr3M"
      }
    }
  ]
}