{
  "_ts": 0,
  "id": "a0b584a7-b29d-4028-8a3c-1bb196870fbb",
  "name": "LifeAfterLandmark",
  "youTubeChannelId": "UCqEOpXW49-TIZWkZsVuiDQg",
  "episodes": [
    {
      "id": "e46b8cec-ed9e-4ed0-bd11-9ebc3350a035",
      "title": "LifeAfterLandmark Live Stream",
      "release": "2024-03-18T10:26:53Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "krJs5hkmskQ",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=krJs5hkmskQ"
      }
    },
    {
      "id": "1d854998-207b-4dbf-88ab-c5b20efe4a90",
      "title": "First interview with an ex-staff person, meet \u0022X\u0022",
      "description": "X prefers to keep the black screen up during this interview and she gives the reason for that, it\u0027s probably not what you\u0027re thinking! here she goes into detail about her life after Landmark and why she was drawn to the organisation - like a moth to a flame.\n\nNow that the first one is done, I sense it\u0027s the first of many more, she has a lot to say.",
      "release": "2024-03-18T07:41:46Z",
      "duration": "01:23:57",
      "explicit": false,
      "youTubeId": "A15994U4HJc",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=A15994U4HJc"
      }
    },
    {
      "id": "e0fca95b-835e-43d3-ab7e-092cc416d099",
      "title": "Life After Landmark",
      "description": "Hi, I\u0027m Dale Dickins and I was \u0022on staff\u0022 with Landmark Education and Landmark Education Corporation (when it transitioned). I was employed as Manager for the Assisting Program, Self Expression and Leadership registration, the Communication Curriculum I completed the Course Supervisor Program, was also the Participation Manager for (at the time) Australia\u0027s smallest \u0022Centre\u0022 in Perth, Western Australia and I had a short stint as a Self Expression and Leadership Program Leader.\n\nWhen I finally \u0022completed\u0022 as a Staff person and left the company, I was left very confused and tormented for 18 years until I finally plucked up the courage to contact Chris Shelton who I\u0027d been listening to regularly to make sense of my experience. Ex-Scientologists were speaking a language I understood and I soaked up all the information I could... astounded at the similarities. \n\nThe ontological shift I\u0027ve experienced since that interview is what has me create this channel. The intent is to create a (safe) space for people to speak, to realise they are not going crazy. Those questionable events did happen... and, Landmark is correct, airing what has been suppressed.... saying those things that can\u0027t be said... it really does work. \n\nIf you have something to say about your experience with Landmark, please contact me, let\u0027s talk.",
      "release": "2024-01-04T01:16:38Z",
      "duration": "00:00:50",
      "explicit": false,
      "youTubeId": "06R336cwad8",
      "subjects": [
        "Landmark"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=06R336cwad8"
      }
    }
  ]
}