{
  "id": "94fcc796-869c-42ab-8f65-d240fa44b985",
  "name": "Lilia Tarawa",
  "spotifyId": "3IM81LperO0ILaN5SPdPca",
  "youTubeChannelId": "UCeX_SmMBGyhqukRBKr8LICQ",
  "episodes": [
    {
      "id": "903f388e-bb0a-4170-bfe5-8d0bed28a67e",
      "title": "Raised in a Cult: The Lasting Impact of Religious Trauma",
      "description": "Leaving a religious cult, fundamentalist church, or high-control faith environment doesn’t always bring the relief people expect.\n\nFor many people raised in evangelical, fundamentalist, or authoritarian religious systems, the effects of religious trauma, church harm, and faith-based harm don’t show up right away. They often surface years later, when life finally slows down enough for the body and mind to catch up.\n\nIn this episode, cult survivor and bestselling author, Lilia Tarawa, responds to listener questions about religious trauma, belief, and healing after faith-based harm. These are questions asked repeatedly by people trying to make sense of themselves after leaving religion, especially those who grew up in religious cults or rigid church systems.\n\nThis conversation focuses on what happens after you leave. \n❓ How do you navigate belief after psychiatric and psychological harm linked to religion?\n❓ Why do so many capable, self-aware people still struggle long after walking away from church or faith?\n\nIn this episode, we discuss:\n❓ Why religious trauma lingers even when you’re no longer part of the church or cult\n❓ What makes church harm and faith-based harm so hard to explain to others\n❓ Why being told to forgive, move on, or have more faith can make things worse\n❓ What happens when professionals acknowledge harm, but there is no clear pathway for repair or justice\n❓ Why asking for help can feel complicated after religious cults or fundamentalist environments\n❓ How faith, doubt, and curiosity change after harm\n❓ What makes church harm and faith-based harm so difficult to explain to others\n❓ Why asking for help can feel complicated after religious cults, evangelical churches, or fundamentalist environments\n\nThis episode is for people who:\n👉 Were raised in religious cults or high-control faith environments\n👉 Experienced religious trauma, church harm or faith-based harm\n👉 Left an evangelical or fundamentalist church but still feel affected\n👉 Are trying to figure out what they believe without being pressured\n👉 Are navigating belief, doubt or spirituality without wanting to be preached at\n👉 Feel family or community pressure to conform to religious beliefs or ideologies\n\nListener care note\nThis episode discusses religious trauma, church harm, and faith-based harm. Please listen in a way that feels safe for you. Lilia not a medical professional. She is sharing lived experience and general support. If you need additional help, we encourage you to reach out to qualified mental health professionals or local support services.\n\nNew Zealand National Helplines\nNeed to Talk? Call or text 1737 (24/7)\nYouthline – 0800 376 63 (24/7) or free text 234, webchat at youthline.co.nz, DM on Instagram @youthline, message on WhatsApp 09 886 56 96\nDepression Helpline – 0800 111 757 (24/7) or free text 4202\nAnxiety NZ – 0800 269 4389 (24/7)\nLifeline – 0800 543 354 (0800 LIFELINE) or free text 4357 (HELP)\nSuicide Crisis Helpline – 0508 828 865 (7am - midnight)",
      "release": "2026-01-25T19:00:47Z",
      "duration": "00:21:37",
      "explicit": false,
      "spotifyId": "0HefqJTfciEhFjfftiGlaE",
      "youTubeId": "n3dsdbp130Y",
      "subjects": [
        "Gloriavale",
        "Cult Recovery",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0HefqJTfciEhFjfftiGlaE",
        "youtube": "https://www.youtube.com/watch?v=n3dsdbp130Y"
      }
    }
  ]
}