{
  "id": "857f71e0-e8de-4653-b051-9aba2f6c8273",
  "name": "Liminal Living",
  "spotifyId": "2TiMziuLoN1Oklw4PPRLHq",
  "appleId": 1028836498,
  "youTubeChannelId": "UCseqDsKpQv2r7AbFfrWF0ow",
  "episodes": [
    {
      "id": "8394da37-8a95-4869-a3b2-9c2922fafd69",
      "title": "Blair Coyle: Escaping Evangelical Indoctrination",
      "description": "takeaways Catching the Northern Lights was a long-awaited dream. Growing up in evangelical communities shaped my worldview. Fear-based teachings can lead to obsessive faith practices. Experiencing spiritual abuse can lead to complex PTSD. Questioning beliefs is a crucial part of personal growth. YWAM provided both community and indoctrination. Different theological perspectives can expand understanding. The journey of deconstruction is often painful but necessary. Finding supportive communities is essential for healing. Books and podcasts can be valuable resources for exploration. Listening and taking a lot of input and learning is crucial. Music can reflect the struggle of faith and personal growth. There is a narrative of death and resurrection in belief systems. Finding grounding in new perspectives can lead to freedom. Community can provide stability but can also become cult-like. It\u0027s important to navigate the balance between individuality and community. Influences from music and thinkers can guide personal journeys. Spiritual practices like meditation can aid in personal growth. Beliefs can evolve beyond traditional dogmas. Authenticity in spirituality is a continuous journey. Links: https://www.blaircoylemusic.com/ https://www.youtube.com/@blaircoylemusic Find us on the web: https://liminalliving.simplecast.com/ Follow us on Facebook: https://www.facebook.com/liminalliving Follow us on YouTube: https://www.youtube.com/channel/UCseqDsKpQv2r7AbFfrWF0ow Follow us on Patheos: patheos.com/editorial/podcasts/liminal-living All Music for this episode composed by Axeltree",
      "release": "2024-12-11T11:00:00Z",
      "duration": "01:03:41.3740000",
      "explicit": true,
      "spotifyId": "24N2tvJWcK4wdsYn0cSPoD",
      "appleId": 1000679999747,
      "youTubeId": "-tS4KpWcvA4",
      "subjects": [
        "Evangelicalism",
        "Cult Psychology",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/24N2tvJWcK4wdsYn0cSPoD",
        "apple": "https://podcasts.apple.com/podcast/blair-coyle-escaping-evangelical-indoctrination/id1028836498?i=1000679999747",
        "youtube": "https://www.youtube.com/watch?v=-tS4KpWcvA4"
      }
    }
  ]
}