{
  "_ts": 0,
  "id": "123619c0-15cc-4c62-bf45-9004a84cc512",
  "name": "Lin Bouthillier, CTRC",
  "youTubeChannelId": "UC4HAqGvomYXf6z6BAQSX5tg",
  "episodes": [
    {
      "id": "8170f0d1-7a93-4c7d-89dc-c60b71d72155",
      "title": "Severe Trauma From Paranormal Experiences, SRA, Cults, And Extreme Abuse",
      "description": "\u0022Monogamous at 13\u0022 Special Episode # 63 Severe Trauma From Paranormal Experiences, SRA, Cults, And Extreme Abuse Lin discusses the numerous difficulties that come with attempting to find a reliable, empathetic and compassionate person that will listen to us if we have had troubling, upsetting, traumatizing experiences through extreme abuse from SRA, cults, paranormal experiences or if we have seen or interacted with \u0022something that shouldn\u0027t exist in our world.\u0022 Many people have experienced the highly traumatizing and painful responses from family, friends, colleagues, clergy, religious groups and mental health professionals who inform you that you will not speak about this aloud or else I will shame, humiliate, ignore, malign, smear, separate from or disconnect from you. \nIf you have experienced this form of painful and life changing trauma, there is help, and you can trust that a certified trauma recovery coach will hold heart space, compassion, curiosity and creativity in the process of staunchly supporting you on your healing journey. \n***Scroll down to the bottom of this video description to find the clickable google Reviews link so you may leave a review of Lin\u0027s coaching work, even if you are not a paid client but watch her coaching practice videos.Thank You! **\n\n***TRIGGER WARNING: This video contains  possible references to sexual abuse, abuse dynamics, and traumatic experiences. This content may contain language that is unsuitable for some viewers because Lin Bouthillier CTRC speaks from her authentic self. Please use your best self care practices to become anchored and grounded before, during and after viewing all videos on this channel.***\n\n***This video is not intended to be a substitute for the interventions of a licensed and credentialed mental or medical healthcare practitioner. It is informational only.***\n\n***This video may contain some adult language. Lin is a trauma survivor and as such she speaks as her authentic self, and her authentic self swears sometimes.***\n\n***This video is not intended for viewers under the age of 18 unless accompanied by a licensed and credentialed mental or medical healthcare practitioner, a parent or a primary caregiver.***\n\nI would love to be your unwavering, supportive, co-equal partner in healing by offering you voice, choice, and client led trauma recovery care. Certified trauma recovery coaching is rooted in safety, authenticity, confidentiality, and total acceptance of where the client is on their trauma recovery journey. If you are interested in one on one certified trauma recovery coaching with Lin Bouthillier CTRC, please reach out by:\n\nWebsite: linbouthillier.com\n\nEmail: lin@linbouthillier.com\n\nPhone in the USA:  1-716-994-3052\n\nI do my best to return calls, texts and emails within 48 hours.\n\nI am proud to offer evening or late night appointments for individuals who work non typical work shifts. I am also able to offer weekend appointments upon request.\n\nPlease remember that self care is never ever selfish, and that you are infinitely worthy of your own trauma recovery. Have the best day. \nTo leave a Google Review for Lin Bouthillier CTRC LLC, please use this link: \n\nhttps://g.page/r/CUbm6CffxigfEBM/review \n\nAll the best to you, \nLin Bouthillier CTRC",
      "release": "2024-07-11T16:15:29Z",
      "duration": "01:15:54",
      "explicit": true,
      "youTubeId": "KEXzvLvJwZI",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KEXzvLvJwZI"
      }
    }
  ]
}