{
  "id": "7b5c89b5-0283-4a74-a5a1-04ae40523a13",
  "name": "Linda Moser",
  "youTubeChannelId": "UCkux_U5qfa8n6S18ukgD_CA",
  "episodes": [
    {
      "id": "e347f099-d71d-4d28-a2d8-849f358478f1",
      "title": "Roy Masters Calls  Me a Liar!!",
      "description": "Ken Schram gives me the opportunity to confront Roy about the damaging effects of the meditation.  He barely even allows me to talk, and has a ready assessent of me before I even open my mouth. He has to be repeatedly told - let her talk.  When I explain specifics of the hypnotic aspect of the meditation, Roy hollers - she\u0027s lying! she\u0027s lying.  Maybe he needs to go back and listen to what his tapes really say.  I was taken aback by his denial of what he actually says on his meditation tapes (before they had cd-roms).  He underestimates the power of my very detailed memory of the content of his meditation exercise.",
      "release": "2020-12-30T13:33:08Z",
      "duration": "00:01:38",
      "explicit": false,
      "youTubeId": "37PPoz4MtaY",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=37PPoz4MtaY"
      }
    },
    {
      "id": "6b08494e-1610-4610-a3de-9cd08f26fa94",
      "title": "Roy Masters is Insensitive",
      "description": "This is Linda, who appeared with me on Northwest Afternoon and talked about how her husband\u0027s involvement with Roy Masters caused their marriage to break up.  She had gotten counseling from Roy directly, which consisted of hey lady, he\u0027s the man you should just follow him and do what he says.  Being a very intelligent woman, she saw the change in her husband was a bad thing and couldn\u0027t go along with it.",
      "release": "2020-12-30T13:21:46Z",
      "duration": "00:01:17",
      "explicit": false,
      "youTubeId": "geE2HbIlm_U",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=geE2HbIlm_U"
      }
    },
    {
      "id": "92cb9545-00e1-420b-8d16-ac1dff79bccf",
      "title": "Roy Masters Calls Steve Hassan a Parasite!",
      "description": "Steve Hassan gets an opportunity to explain the criteria for what constitutes a cult.  This is a continuation from the video Roy Masters Explains the Foundation of Human Understanding.  Roy is not happy with having to appear on the show alongside his \u0022arch enemy\u0022, Steve, as this position puts him in a position to have  to defend himself against the accusation that he is a cult leader.  He claims he fits none of the criteria, then unloads a verbal attack on Steve.",
      "release": "2020-12-30T13:21:40Z",
      "duration": "00:04:41",
      "explicit": false,
      "youTubeId": "MVTy4EtusHc",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MVTy4EtusHc"
      }
    },
    {
      "id": "d2f6f477-3b27-4b24-8ef3-797689669b99",
      "title": "Roy Masters Explains the Foundation of Human Understanding",
      "description": "Roy Masters explains how the FHU is not a cult, as it has no teachings, no doctrine, you can\u0027t join. Notice how he tells you all about yourself -- when you were young you were violated, you were motivated, you lost your identity, you took on the identity of those around you, you are not your own person.  He whitewashes  everyone with the same brush.  He claims that the FHU\u0027s purpose is to help you realize self-actualization.  No, of course there\u0027s no mind control going on here.  He strips himself of the totalitariam, authoritative, \u0022I know it all\u0022  personality he exemplifies on his radio show. He gives the audience a nice \u0022soft-shoe\u0022 performance. No controversial statements here.  Clever guy.",
      "release": "2020-12-30T13:21:24Z",
      "duration": "00:02:38",
      "explicit": false,
      "youTubeId": "aLrWXXLDuz0",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aLrWXXLDuz0"
      }
    },
    {
      "id": "623b50ee-00d6-48b8-82a1-9da15e388bb3",
      "title": "Roy Masters is Going to Be the Media One Day!!!",
      "description": "The video quality on this is bad, but the audio is clear.  Roy responds to a comment made by Steve Hassan about controlling the media,and Roy makes the statement: Im going to be the media one day (at 00:29) The audience didn\u0027t hear it,but Steve did, and now, thanks to YouTube, you are hearing it.\r\n\r\nI\u0027ll let you draw your own conclusions about Roy\u0027s words.",
      "release": "2020-12-30T13:21:17Z",
      "duration": "00:00:44",
      "explicit": false,
      "youTubeId": "RpXGLbzU-nI",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RpXGLbzU-nI"
      }
    },
    {
      "id": "ff0fd513-ad3a-4da9-bfb0-2f44fa9f7d63",
      "title": "Roy Masters is the Greatest Leader in the World Today!!",
      "description": "Steve Hassan interacts with an audience member who is a follower of Roy\u0027s. Masters keeps grabbing Steve\u0027s arm and wants to stop the interaction.",
      "release": "2020-12-30T13:20:45Z",
      "duration": "00:00:38",
      "explicit": false,
      "youTubeId": "XErbPSLLNj4",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XErbPSLLNj4"
      }
    },
    {
      "id": "aaa668af-9d74-4cf0-abea-916e31262458",
      "title": "Roy Masters Agrees with Steve Hassan!!!  Town Meeting  1989",
      "description": "A hypnotherapist in the audience takes offence to both Steve and Roy about hypnosis.  A classic moment in time, probably the only thing these guys can agree on!!",
      "release": "2020-12-30T13:20:38Z",
      "duration": "00:00:53",
      "explicit": false,
      "youTubeId": "kCHK2Et0pTQ",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kCHK2Et0pTQ"
      }
    },
    {
      "id": "b34ef9f5-1371-4d76-85bf-6bc58c7777cc",
      "title": "Roy Masters Gets Praise and Criticism!",
      "description": "Comments and questions from the audience of Town Meeting. One old dude thinks Roy\u0027s and Steve\u0027s statements support atheism.  Ken Schram quotes from \u0022The Hypnosis of Life\u0022 and suggests that Masters may be the very psychpath that he warns others about -- to  which the audience responds with a load roar... Two people in the audience give their endorsements for Masters organization -- notice that Roy\u0027s \u0022followers\u0022 always emphasize the word \u0022understanding\u0022 as if using that word makes their involvement with him sound more like enlightenment than entanglement.",
      "release": "2020-12-30T13:20:23Z",
      "duration": "00:05:57",
      "explicit": false,
      "youTubeId": "91JiZu7Jm_M",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=91JiZu7Jm_M"
      }
    },
    {
      "id": "9d4c9759-2170-46c4-b30a-ef13df118045",
      "title": "Roy Masters Calls Me a Liar Again....",
      "description": "This is my 10th attempt at uploading this.  I had to cut the clip shorter in order to get it uploaded.",
      "release": "2020-12-30T13:20:12Z",
      "duration": "00:00:44",
      "explicit": false,
      "youTubeId": "rCTH41yYlFg",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rCTH41yYlFg"
      }
    },
    {
      "id": "7947959b-5f7d-4fa3-9e7b-384aca937c1d",
      "title": "Roy Masters  -- the Debate Goes On...",
      "description": "Masters takes great exception to being compared to Jim Jones. Can\u0027t really blame him for that, I suppose. Masters tells Ken Schram that he is hypnotizing everyone, then he tells Steve Hassan that he still hasn\u0027t gotten over being programmed by the Moonies.  I wish I could dub in that \u0022Twilight Zone\u0022 music here, it would really be appropriate.",
      "release": "2020-12-30T13:19:33Z",
      "duration": "00:08:16",
      "explicit": false,
      "youTubeId": "yf2BYhuzcAQ",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=yf2BYhuzcAQ"
      }
    },
    {
      "id": "7be6e742-8f94-4d8f-bb60-6b3b91fe2e5e",
      "title": "Roy Masters Says Women Are Evil!!",
      "description": "Roy tries to explain away his statement about \u0022women are the embodiment of evil,\u0022 and that they have a \u0022serpent within.\u0022  He tries to blame all the wickedness in the world on the fact that men don\u0027t love women properly;  however, anyway you slice it, according to Masters\u0027 convoluted theories all the evil in the world enters through the  woman.",
      "release": "2020-12-30T13:19:09Z",
      "duration": "00:03:34",
      "explicit": false,
      "youTubeId": "bvNtgi9WIT4",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bvNtgi9WIT4"
      }
    },
    {
      "id": "8dbf3a49-fc2a-4536-a7f6-c2afbf7ba210",
      "title": "Roy Masters is Not a Cult Leader! (is he?)",
      "description": "Segment following the Intro to Town Meeting which leads into the segment called Roy Masters Explains the FHU. Roy does not appreciate being associated with the likes of Bagwan Shree Rashneesh or JZ Knight the Ramtha channeler.  Some famous Roy quotes -- such as \u0022Knowledge .... makes beasts of us.\u0022  Chew on that a while.",
      "release": "2008-06-13T06:47:20Z",
      "duration": "00:04:47",
      "explicit": false,
      "youTubeId": "Y8wW3GHrcj4",
      "subjects": [
        "Foundation of Human Understanding",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Y8wW3GHrcj4"
      }
    }
  ]
}