{
  "id": "4a4d93e3-7b8d-4d59-bd8c-8eaed0984e11",
  "name": "Lingo Nas",
  "youTubeChannelId": "UCaoF8mZgNpbyGYBCCdvoJRA",
  "episodes": [
    {
      "id": "7c5eb59f-036e-46b7-a8ca-6ceb95e039e8",
      "title": "Learn how to discuss CULTS in #english #esl Advanced #englishvocabulary Group Class",
      "description": "https://youtu.be/s0ukxJCYoqk?si=t0-jidCirNHc5DOS\n\nAt LingoNas, we offer a variety of extra services to enhance your learning experience and fast-track your path to fluency in just 12 weeks, not 12 months!\nExplore our structured courses designed to propel you towards fluency with precision and efficiency. Say goodbye to lengthy timelines and hello to rapid progress!\nhttps://lingonas.wixsite.com/lingonas \n\n📚 Dive into our trendy and insightful blog, where you can advance your reading and vocabulary skills while staying up-to-date with the latest language learning tips and trends.\nhttps://lingonas.blogspot.com/\n\n🎉 Follow us on Instagram for your daily dose of idioms and phrases! Expand your language repertoire and impress others with your newfound linguistic flair.\nhttps://www.instagram.com/lingonas/\n\n🎧 Tune in to LingoNas\u0027 fun and engaging podcasts to master active listening skills while enjoying entertaining content that will keep you engaged and motivated.\nhttps://nascelta.buzzsprout.com\n\n💻 Contact us via our website to receive a complimentary downloadable lesson plan and take your language learning to the next level!\n https://lingonas.wixsite.com/lingonas \n\n\n🎓 NAS Celta Certified, and accredited by both IELTS and PTE, Nas brings over 12 years of international teaching experience to the table. 🌍\n💼 Formerly recognized as one of the Top 10 Tutors at Wall Street English in China, NAS has had the privilege of tutoring esteemed individuals, including Ministers and Mayors, among others, on a VIP basis. 🏛️\n💻 With an impressive 11,000 hours of online teaching under their belt, NAS has conducted over 500 group classes, catering to the diverse learning needs of more than 2,000 students worldwide.\n\n#EnglishLearning\n#LearnEnglish\n#EnglishGrammar\n#ESL (English as a Second Language)\n#TOEFL (Test of English as a Foreign Language)\n#IELTS (International English Language Testing System)\n#EnglishVocabulary\n#EnglishSpeaking",
      "release": "2024-04-20T07:00:30Z",
      "duration": "00:17:48",
      "explicit": false,
      "youTubeId": "f9cdjUJu_CY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=f9cdjUJu_CY"
      }
    }
  ]
}