{
  "_ts": 0,
  "id": "892c97c5-072a-4e33-b41a-74a18646692c",
  "name": "Lisa Bilyeu",
  "spotifyId": "2Pv6X6iCwFmwGwxfrwHdfW",
  "appleId": 1435217865,
  "youTubeChannelId": "UCeir7Wbzzfg43c1eL7PSa3g",
  "episodes": [
    {
      "id": "7ab77720-3218-4f8d-9d8c-fcf32b5c6a0b",
      "title": "DIDDY vs CASSIE: Control, Power, Manipulation, \u0026 His Dirty Tactics Exposed",
      "description": "On this gripping episode of Women of Impact, we’re pulling back the curtain on the Diddy Trial and exposing what really happens when decades of alleged coercion, abuse, manipulation, and control come to light.\n\nLet’s be real: for YEARS, women’s voices were silenced and ignored. But when Cassie stepped forward—it changed EVERYTHING. And if you’ve ever wondered why women stay silent, how abuse thrives in the shadows, and what actually keeps someone trapped in a relationship with a high-powered predator, then you NEED this episode.\n\nWith powerhouse criminal analyst and my co-host, Laura Richards, legendary defense attorney Karen Conti, and the iconic Dr. Ann Burgess, we’re cutting through the noise to answer the hardest questions:\n- Why do women stay silent for so long—even when the abuse is horrifying?\n- How do predators select, groom, and entrap their victims?\n- What makes a woman finally reclaim her voice, stand up, and say “ENOUGH”?\n- What tactics do defense lawyers use to gaslight, blame, and shame victims…and how can we fight back?\n- How can YOU spot the signs of manipulation, coercive control, and abuse—before it’s too late?\n\nWe dig deep into:\n- The shocking video evidence at the heart of the Diddy Trial, and why it’s so damn important for the world to see.\n- The dangerous myth of “mutual abuse”—and why it’s NOT a real thing.\n- The psychological traps, power imbalances, and legal loopholes that silence women.\n- How to spot grooming, gaslighting, and manipulation tactics—so you’ll NEVER be caught off guard.\n- Actionable steps for reclaiming your voice, knowing your worth, and building the kind of support network every woman deserves.\n\nYou are NOT alone—these patterns are real, and together, we can make sure NONE of us ever have to suffer in silence again.\n\nShare this with every woman in your life. Smash that subscribe button. Because this isn’t just a trial—it’s a turning point.\n\n\n\nFollow Laura Richards:\nWebsite: https://www.crime-analyst.com \u0026\nhttps://www.thelaurarichards.com   \nPatreon: https://www.patreon.com/CrimeAnalyst  \nDASH Checklist: https://www.dashriskchecklist.com/  \nInstagram: https://www.instagram.com/laurarichards999/ \u0026 https://www.instagram.com/crimeanalyst/\nYouTube: http://www.youtube.com/@crimeanalyst\n\n\nCheck out Dr. Ann Burgess’ books:\nPre-order her upcoming book: Expert Witness: https://a.co/d/2BzlPIl\nOrder her book that’s out now, A Killer by Design: https://a.co/d/doInYVB\n\n\nFollow Karen Conti:\nWebsite: https://www.karenconti.com/\nOrder her book: “Killing time with John Wayne Gacy”: https://a.co/d/0Idrn4B\n\n\nFollow Me, Lisa Bilyeu: \nWebsite: https://www.lisabilyeu.com\nInstagram: https://www.instagram.com/lisabilyeu/ \nFacebook: https://www.facebook.com/lisabilyeu \n\n\nAll individuals mentioned are presumed innocent until proven guilty in a court of law. Any views expressed are based on publicly available information at the time of recording, namely the ongoing proceedings in the criminal trial of Sean “Diddy” Combs occurring in federal court in New York. If any individual believes something presented is factually incorrect, please contact us directly at operations@impacttheory.com so we may address the concern promptly.\n\n\nIf you want to dive deeper into my content, search through every episode, find specific topics I\u0027ve covered, and ask me questions. Go to my Dexa page: https://dexa.ai/lisabilyeu \n\n\nWARNING: I will never ask for your contact info in the comments section, that is someone impersonating me!",
      "release": "2025-05-13T16:43:44Z",
      "duration": "00:54:45",
      "explicit": false,
      "spotifyId": "0lFZFwScW9MjbuzXScB8VS",
      "appleId": 1000708347311,
      "youTubeId": "zEXSuztIF2s",
      "subjects": [
        "Human Trafficking",
        "Sean Combs",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0lFZFwScW9MjbuzXScB8VS",
        "apple": "https://podcasts.apple.com/podcast/the-diddy-trial-begins-how-he-manipulated-everyone/id1435217865?i=1000708347311",
        "youtube": "https://www.youtube.com/watch?v=zEXSuztIF2s"
      }
    },
    {
      "id": "106621bf-60bf-47fe-ae9a-48d82c605abd",
      "title": "Top 10 Signs You\u0027re in a Manipulative Relationship | Rick Alan Ross - PT 1",
      "description": "Welcome to another enlightening episode of Women of Impact, where today’s conversation will take you deep into the world of cults and manipulative relationships. I\u0027m your host, Lisa Bilyeu, and joining me is cult expert Rick Alan Ross. In this episode, we unravel the insidious tactics of love bombing and conditional affection, the manipulation and dependency that cults and abusive relationships foster, and the isolation and indoctrination techniques that rob individuals of their autonomy. We also delve into the intricacies of leaving such environments and the intense feelings of shame and guilt that often accompany this challenging process. We\u0027ll discuss gender dynamics in narcissistic behaviors, the rise of female cult leaders like Amy Carlson and Elizabeth Claire Prophet, and the complex realities faced by cult members. From high-profile cases like Charles Manson’s manipulation tactics and Leslie Van Houten\u0027s eventual transformation, to the impact of modern social media in cult awareness, Rick offers invaluable insights into how cults recruit even the most intelligent individuals and celebrities. Plus, we explore the critical role of intervention and the journey towards recovery, touching on compelling stories like Elizabeth Smart’s and Patricia Hearst\u0027s abductions and subsequent reprogramming. Whether you’re curious about the psychological traps of cults, or looking for ways to protect yourself and others, this episode is a powerful guide to understanding and safeguarding your autonomy. SHOWNOTES 00:00 Beware of manipulation: Love bombing and control. 04:27 Isolation limits feedback, ensuring control and dependency. 08:31 Charismatic leader controlled, abused small devoted following. 12:04 Beware online groups for cult-like behaviors. 15:19 Keith Raniere trial: witnessed downfall after lengthy battle. 18:00 Seek professional help to understand and recover. 21:32 Mark uses social media to educate against cults. 25:15 Manson incited race war due to failed fame. 29:32 Cult leaders manipulate followers into apocalyptic narratives. 33:02 Leslie Van Houten: cult recovery, family support, transformation. 35:42 Elizabeth Smart kidnapped, abused, coerced, threatened family. 39:17 Patty Hearst, SLA involvement, prison, Carter commutation. 44:22 Defining cults, coercive tactics, and family concerns. 47:29 Love-based relationships reveal truth through discussions. 51:50 Find me on Twitter @XallenRoss; culteducation.com resources. CHECK OUT OUR SPONSORS Shopify: Sign up for your one-dollar-per-month trial period at https://shopify.com/lisa OneSkin: Visit https://oneskin.co and use code LISA for 15% off to make your skin look, feel, and act younger with OneSkin! Helix: Get 25% off and 2 FREE Dream Pillows with any CORE mattress purchase or get a FREE Bedding Bundle with any Luxe or Elite mattress at https://helixsleep.com/woi FOLLOW LISA: Instagram: https://www.instagram.com/lisabilyeu/ Twitter: https://twitter.com/lisabilyeu YouTube: https://www.youtube.com/womenofimpact Tik Tok: https://www.tiktok.com/@lisa_bilyeu?lang=en LISTEN AD FREE \u0026#43; BONUS EPISODES on APPLE PODCASTS: apple.co/womenofimpact Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-13T09:00:00Z",
      "duration": "00:53:31.8850000",
      "explicit": false,
      "spotifyId": "17P7MA09kDBvFfrJOmNGRs",
      "appleId": 1000676773523,
      "youTubeId": "C1mtm2fVgiI",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/17P7MA09kDBvFfrJOmNGRs",
        "apple": "https://podcasts.apple.com/podcast/top-10-signs-youre-in-a-manipulative-relationship/id1435217865?i=1000676773523",
        "youtube": "https://www.youtube.com/watch?v=C1mtm2fVgiI"
      }
    },
    {
      "id": "a2b4584e-a096-4676-80a8-353db72e61a2",
      "title": "CIA Spy: “Do NOT Trust Your Gut”-Signs You’re Being Used, Manipulated \u0026 Lied To! | Andrew Bustamante",
      "description": "Thank you to today’s sponsor:\nBeam Minerals: Head to https://impacttheory.co/BeamWOIOct24 and enter code “LISA” at checkout for 20% off your first order.\n\n\nWhat up guys, it\u0027s Lisa Bilyeu here, and I\u0027m going to tell you something that\u0027s an absolute frickin’ fact that no one wants to believe AND is the reason we find ourselves getting tricked, used, manipulated, cheated on, and gaslit…\n\nEVERYONE LIES!\n\nFrom small innocent white lies to really freaking hurtful, huge lies that are like a bombshell that ends up destroying your life, your relationship, and your confidence. \n\nNow the sooner we can just accept the fact that everyone lies, the sooner you can start to figure out how to spot the lies, uncover the truth, and take your power back so you won’t be manipulated ever again. \n\nAnd so here to help us uncover the web of lies and reveal the truth is former CIA spy and agent, Andrew Bustamante!! \n\nAndrew has literally been professionally trained in how to gain people\u0027s trust very quickly and how to use that trust to get information, and today he\u0027s going to be teaching us:\n- the three parts that go into building trust\n- what a con man, serial killer, or cult leader will do to gain your trust quickly \n- how to take control back and ask the right questions to test and reveal the true intentions behind someone’s actions\n- how famous people like P Diddy, Bill Cosby, and R Kelly were able to lie and manipulate and abuse people to the EXTREME \n\nThis episode is a masterclass on how to become a human lie detector and crack the con!!!\n\nBy the end of this episode, your tool belt will be full of the tools that top agents in the CIA use to crack the cons, expose the lies, and manipulate the manipulator so you can protect your own damn self-confidence, reveal the truth behind anyone\u0027s actions, and then take your power back in any situation!!\n\n\nCHAPTER MARKERS: \n\n🧠 [00:00] What skilled manipulators do to gain your trust quickly \n🗣️ [19:26] The echochamber that makes cults so dangerous \n🔍 [32:36] How to spot a lie \u0026 find the truth \n🔄 [1:03:56] Famous cases of lies, manipulation, and abuse \n😖 [1:20:57] Why people believe their own lies \n\n\nANDREW’S TRUTH BOMBS:\n\n\u0022A cult is a perfect example of know, like, trust happening in real time…Each individual in the group is now hearing the message multiple times over, not just from the source, but from the other people in the group…So then all the people who know what it is get kicked out, and all the people who believe it\u0027s not a cult stay in. And then you have this echo chamber of bad ideas.\u0022\n\n\u0022CIA teaches every field officer out there, there will always be lies, and everybody will forever lie. Just accept it, understand that truth, and then that\u0027s going to make it that much more powerful and that much more effective when you have tools to find the truth.\u0022\n\n“How many times do you have to see a super wealthy celebrity completely melt down, completely fall apart, before you realize they\u0027re just people and we are all equally fucked up?\u0022\n\n“The way that you keep such a diverse group of people safe is by giving them the same simple and effective self defense system. And that system is based in something we call biomechanical advantages.\u0022\n\n\nTo join Andrew \u0026 Lisa in Vegas for OPDEF Live self defense training, CLICK HERE: https://everydayspy.com/lisa\n\nWant to learn more from Andrew Bustamante?\nFind your Spy Superpower:https://yt.everydayspy.com/WoILying \nFollow Andrew on YouTube: https://youtube.com/@Andrew-Bustamante\nExplore Spy School: https://everydayspy.com/\nJoin the podcast: https://youtube.com/@EverydaySpyPodcast\nInstagram: https://www.instagram.com/everydayspy/\n\n\nFollow Me, Lisa Bilyeu: \nWebsite: https://www.radicalconfidence.com/ \nInstagram: https://www.instagram.com/lisabilyeu/ \nFacebook: https://www.facebook.com/lisabilyeu \nX: https://twitter.com/lisabilyeu \n\n\nIf you want to dive deeper into my content, search through every episode, find specific topics I\u0027ve covered, and ask me questions. Go to my Dexa page: https://dexa.ai/lisabilyeu \n\nThemes: Confidence, Relationships, Business, Mental Health, Self-Improvement\n\n\nWARNING: I will never ask for your contact info in the comments section, that is someone impersonating me!",
      "release": "2024-10-02T13:01:01Z",
      "duration": "01:32:56",
      "explicit": false,
      "spotifyId": "13VW3eHtikoBzgKcMUTGvL",
      "appleId": 1000671555415,
      "youTubeId": "llO1FOiPH5U",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/13VW3eHtikoBzgKcMUTGvL",
        "apple": "https://podcasts.apple.com/podcast/cia-spy-how-to-spot-a-liar-in-2-minutes-andrew-bustamante-pt-1/id1435217865?i=1000671555415",
        "youtube": "https://www.youtube.com/watch?v=llO1FOiPH5U"
      }
    },
    {
      "id": "91b954f7-dea6-44a4-bf9e-c12e3a24799e",
      "title": "Cult Expert: Signs He\u0027s a Psychopath, Narcissist, Con Man Or CULT LEADER! (Don\u0027t be his next victim)",
      "description": "If you\u0027ve ever been controlled by someone mentally or emotionally, then you know how crushing it is to your confidence, your self-esteem, and your belief in yourself. \n\nYou question HOW this person convinced you to do or say or believe things that you KNOW deep down to your core are not true? WHAT did they do to get you to fall for the lies and change so much, without you even frikin’ realizing it? And HOW can you make sure it doesn’t happen to you again?? \n\nWell homie, the reality is that this type of manipulation happens more often than you might think, 1 on 1 in toxic relationships and sometimes even whole groups of people at a time in a cult. \n\nSo in this episode of Women of Impact, I wanted to get to the bottom of how good, well-intentioned, educated, “normal” people like you and me can fall into the trap of a controlling person like a cult leader or narcissistic romantic partner, and literally leave behind their life, family, job, money, friends, belief system, sanity, and everything about themselves for this person. \n\nAnd whether it’s coz of a cult, a toxic partner, or a guy at work that keeps trying to convince you to join this “amazing self-help group”, if you think it “won’t happen to you” – well homie you’re actually that much more likely to become their next target and victim!!!! \n\nAnd that’s why today’s guest is none other than the ultimate cult expert and deprogrammer, Rick Alan Ross. This guy is an aboslute LEGEND when it comes to cults!!\n\nWe go deep into: \n- the type of people who start cults.\n- how cults like NXIVM and Scientology bring people in.\n- what specifically makes a person more vulnerable to saying yes and “drinking the Kool-aid”.\n- strategies used by notorious cult leaders to gain control and brainwash people (and you’ll be surprised by what they have in common with your toxic ex!!!).\n- HOW you can actually avoid getting into a cult or toxic relationship in the first place.\n- \u0026 so much more!!!\n\nAnd that’s just in PART 1 of this 2 part episode!\n\nThis episode is truly FILLED with the knowledge you NEED if you want to have any hope of spotting the cult leaders, con men, and toxic boyfriends BEFORE they can rope you, or anyone you love, into their manipulative world and cut you off from the life YOU want to live!!! \n\n\nCHAPTER MARKERS: \n\n🚩 [0:00] Warning signs of a cult or abusive relationship \n🧠 [8:55] The process of cult indoctrination \n😖 [35:39] Notorious cults, their crimes \u0026 the victims\n❌ [1:02:46] How toxic abusers gain control \n\n\n🔥 HOT RICK ALAN ROSS QUOTES:\n\n\u0022You have to ask yourself, can I disagree with this person? Can I disagree with the leader of this group? Is there a place for constructive criticism? Am I becoming socially isolated by being in this group? Am I cutting off people that are my family, my friends, particularly if they\u0027ve raised questions about this leader of the group I\u0027m involved with or this partner that I\u0027m now going out with and making an integral part of my life?\u0022\n\n\u0022[Cult leader Keith] Raniere, by working on these people year after year, seminar after seminar, over a period of time, he would, as you say, wear them. He would wear them down and they would change and they would bend and change their thinking, their perception of reality based on what he indoctrinated them to believe.\u0022\n\n“These were very sophisticated, very well educated people, and yet they succumb to these persuasion techniques.\u0022\n\n\u0022The group makes you feel so broken continuously, but you feel you can\u0027t leave because you\u0027re broken and you need to be fixed, and it\u0027s always your fault. You\u0027re made to feel shame and guilt.\u0022\n\n\u0022In groups that are totalistic and authoritarian, people are led to believe that the group has one solution and that this solution is perfect and that it is right for all people at all times.\u0022\n\n\u0022This is that ‘us versus them’ mentality that we see in cults, where there\u0027s a sharp line drawn between us, the people that have the truth and the way and everyone else.\u0022\n\n\nFollow Rick Alan Ross:\nWebsite: https://culteducation.com/\nX: https://x.com/RickAlanRoss\nGet “Is This a Cult?”: https://a.co/d/hKoEsRt\n\nFollow Me, Lisa Bilyeu: \nWebsite: https://www.radicalconfidence.com/ \nInstagram: https://www.instagram.com/lisabilyeu/ \nFacebook: https://www.facebook.com/lisabilyeu \nX: https://twitter.com/lisabilyeu \n\n\nIf you want to dive deeper into my content, search through every episode, find specific topics I\u0027ve covered, and ask me questions. Go to my Dexa page: https://dexa.ai/lisabilyeu \n\nThemes: Confidence, Relationships, Business, Mental Health, Self-Improvement\n\nWARNING: I will never ask for your contact info in the comments section, that is someone impersonating me!",
      "release": "2024-09-18T13:00:57Z",
      "duration": "01:08:01",
      "explicit": false,
      "spotifyId": "65kZDuDLs0wq6jdFyjcPhQ",
      "appleId": 1000669909049,
      "youTubeId": "nmTfVrlWdyQ",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65kZDuDLs0wq6jdFyjcPhQ",
        "apple": "https://podcasts.apple.com/podcast/from-cults-to-control-freaks-a-cult-experts-guide/id1435217865?i=1000669909049",
        "youtube": "https://www.youtube.com/watch?v=nmTfVrlWdyQ"
      }
    },
    {
      "id": "57517b42-934b-46fc-8099-a1081e121c22",
      "title": "EXCLUSIVE: #1 Narcissist Expert on How She Got Fooled Too! | Dr. Ramani PT 2",
      "description": "Welcome back to part 2 of this POWERFUL episode of Women of Impact with the world’s #1 narcissist expert, Dr. Ramani!\nAnd guys, we just. keep. frikin’. digging DEEPER into the complex emotions and feelings that come up when you’re in a toxic relationship and how to heal from the abuse. \nWe cover…\n\n- How shame deeply affects your actions AND the narcissist’s actions \n\n- How confusion \u0026 despair wear down your spirit and energy for life\n\n- The 3 Rs that keep you trapped in the toxic web\n\n- How to finally move on with the “recover from the lie” method \n\n\nDon\u0027t miss out on the final part of this eye-opening conversation with Dr. Ramani. \n\nAnd if you\u0027re loving Women of Impact, please take a moment to leave us a review or rate the show. Your feedback is incredibly valuable!\n\nFollow Dr. Ramani:\nWebsite: https://doctor-ramani.com/ \nYouTube: https://www.youtube.com/@DoctorRamani\nOrder “It’s Not You”: https://a.co/d/7qYmF0f\n\nFollow Me, Lisa Bilyeu: \nWebsite: https://www.radicalconfidence.com/ \nInstagram: https://www.instagram.com/lisabilyeu/ \nFacebook: https://www.facebook.com/lisabilyeu \nX: https://twitter.com/lisabilyeu \n\nIf you want to dive deeper into my content, search through every episode, find specific topics I\u0027ve covered, and ask me questions. Go to my Dexa page: https://dexa.ai/lisabilyeu \n\nThemes: Confidence, Relationships, Business, Mental Health, Self-Improvement\n\nSPONSORS:\nIf you purchase an item using these affiliate links, Impact Theory may receive a commission.\nSign up for a one-dollar-per-month trial period at https://shopify.com/lisa now to grow your business–no matter what stage you’re in.\nSign up at https://lastbottlewines.com, use code LISA to save 10%, and find out why Last Bottle is the most fun way to discover and buy amazing wine. \nThis episode is sponsored by Betterhelp. Give online therapy a try at https://betterhelp.com/women and get on your way to being your best self!\nGet a free 30-day Alo Moves subscription by going to https://alomoves.com and use code WOI30.\nGo to https://tryviome.com/LISA and use code LISA to get 20% off your first 3 months, and take control of your gut health today!\nTry AG1 and get a FREE 1-year supply of Vitamin D3K2 AND 5 free AG1 Travel Packs with your first purchase by going to https://drinkAG1.com/lisa.\n\n***CALLING ALL BADASSES!***\nIf you really want to level up your confidence game, check out the WOMEN OF IMPACT SUBSCRIPTION, specially designed to turn you into the badass you were born to be! \n\n*New episodes delivered ad-free, EXCLUSIVE access to hundreds of archived Women of Impact episodes, and so much more!*\nDon\u0027t settle for mediocrity when you can be extraordinary!\n\n*****Subscribe on Apple Podcasts: https://apple.co/457ebrP*****\nSubscribe on all other platforms (Google Podcasts, Spotify, Castro, Downcast, Overcast, Pocket Casts, Podcast Addict, Podcast Republic, Podkicker, and more) : https://impacttheorynetwork.supercast.com/\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-03-21T13:00:00Z",
      "duration": "00:39:31",
      "explicit": false,
      "spotifyId": "5cWcgWxA7kS5gATquq87AO",
      "appleId": 1000649969555,
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5cWcgWxA7kS5gATquq87AO",
        "apple": "https://podcasts.apple.com/podcast/exclusive-1-narcissist-expert-on-how-she-got-fooled/id1435217865?i=1000649969555"
      }
    },
    {
      "id": "9db0e491-30d0-4c96-b7b7-02f37dfd5d11",
      "title": "\u0022The REAL Reason You Attract Narcissists Into Your Life!\u0022 - How They Fool \u0026 Trap You | Dr. Ramani",
      "description": "Thank you to today’s sponsor:\nJoi Wellness: 10% off with code IMPACT Link: https://bit.ly/woijoi\n\nBecome Un-Frikin’ Stoppable and Build Your Confidence RIGHT NOW: https://bit.ly/3SWzKqL\n\nGet ready for a RAW, honest look at the devastating effects that narcissists have on our self-worth, the allure of magical moments in relationships, the pain of betrayal, and the realities of navigating emotional recovery.\n\nIn today’s episode of Women of Impact, we’re joined by the world’s #1 narcissist expert who is here to help you actually heal and move on from narcissistic abuse!\n\nAs a licensed clinical psychologist and expert in narcissistic relationships, Dr. Ramani digs deep into the behaviors and patterns that narcissists use every single day to manipulate the hell out of you and keep you sucked into the relationship. \n\nMost people don’t know this about her, but my girl Dr. Ramani has actually been a victim of narcissistic abuse many times throughout her own life. And in this episode she is sharing some of the lessons she learned from her own experiences and the knock-on effects those experiences still have on her to this day.\n\nIn this episode, we’re diving into:\n- Societal myths about narcissists that diminish the seriousness of their abuse \n- How shame deeply affects your actions AND the narcissist’s actions \n- The best way to approach someone you think is in a relationship with a narcissist (and how to respond if YOU’RE the one approached!)\n- How to finally move on with the “recover from the lie” method \n- The self-blame spiral that has you thinking it’s YOUR fault \u0026 why you MUST escape it to take your power BACK from the narcissist!\n- How confusion \u0026 despair wear down your spirit and energy for life\n- The 3 Rs that keep you trapped in the toxic web\n\nSo if you’re ready to finally frikin’ MOVE ON from that toxic person in your life then grab a cuppa and listen close homie, because this episode is here to help you heal from the abuse and put the pieces back together. \n\nOrder your copy of Dr. Ramani\u0027s new book here: https://a.co/d/7qYmF0f\n\nChapter Markers: \n\n💔 [00:00] The Last Effects of Narcissistic Abuse \n❌ [16:22] Why the Narcissist Won’t Change\n❤️‍🩹 [21:36] Phases of Healing\n💁‍♀️ [38:54] Expressing Needs, Building Trust, Making Progress\n🔥 [43:56] Toxic Shame, The Narcissist \u0026 You\n🚪 [59:37] Despair \u0026 Painful Realities of Leaving the Narcissist\n👉 [1:19:28] Bonus Episode: Jenna Kutcher\n\n****Bonus Episode: Change EVERYTHING with Jenna Kutcher****\n\nKeep watching for a BONUS conversation with my homie Jenna Kutcher, who is helping us get to the heart of what so many women are struggling to articulate. She’s talking about how to stop wasting your life feeling stuck, why you need to feel your feelings, and what you need to change to get excited and really look forward to a version of you 5 years from now.\n\n\n🔥 DR. RAMANI’S FIRE QUOTES:\n\n“And so things that I feel like I could do now were simply not possible then. The resources, the knowledge, the information. So when I feel like I want to be hard on myself, I have to recognize that it\u0027s actually a damned miracle that I\u0027m doing all the things I\u0027m doing, given how much doubt is in my mind about everything.\u0022\n\n\u0022Enough people have told me that they have narcissistic mothers to let me know there\u0027s plenty of narcissistic women out there. I\u0027ve worked with enough men who have been through relationships with narcissistic women to know there\u0027s plenty of narcissistic women out there.\u0022\n\n\u0022Narcissism is considered a maladaptive personality because it puts them at odds with other people. So it\u0027s even less likely to change. And more importantly, because the personality won\u0027t change, the behaviors won\u0027t change, and the behaviors are what affect us in relationships.\u0022\n\n“A lot of people often don\u0027t want to tell their friend or family member that [they\u0027re] a little worried about your new relationship because their fear is that they\u0027re going to alienate that friend or family member. They don\u0027t want to lose that relationship. And so most people don\u0027t say anything.\u0022\n\n“People will lose 20 years over one night.”\n\nFollow Dr. Ramani:\nWebsite: https://doctor-ramani.com/ \nYouTube: https://www.youtube.com/@DoctorRamani\nOrder “It’s Not You”: https://a.co/d/7qYmF0f\n\nFollow Jenna Kutcher:\nWebsite: https://jennakutcher.com/\nPodcast: https://jennakutcher.com/home \nInstagram: https://www.instagram.com/jennakutcher/\n\nFollow Me, Lisa Bilyeu: \nWebsite: https://www.radicalconfidence.com/ \nInstagram: https://www.instagram.com/lisabilyeu/ \nFacebook: https://www.facebook.com/lisabilyeu \nX: https://twitter.com/lisabilyeu \n\nIf you want to dive deeper into my content, search through every episode, find specific topics I\u0027ve covered, and ask me questions. Go to my Dexa page: https://dexa.ai/lisabilyeu \n\nThemes: Confidence, Relationships, Business, Mental Health, Self-Improvement",
      "release": "2024-03-20T13:00:54Z",
      "duration": "02:06:59",
      "explicit": false,
      "youTubeId": "od0mkJLH-G0",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=od0mkJLH-G0"
      }
    },
    {
      "id": "804d46f4-e782-48df-a0ea-be5a2880c6da",
      "title": "EXCLUSIVE: #1 Narcissist Expert on How She Got Fooled Too! | Dr. Ramani PT 1",
      "description": "It’s Lisa Bilyeu here with another incredible episode of Women of Impact and today we’re joined by the world’s #1 narcissist expert who is here to help you actually heal and move on from narcissistic abuse!\nAs a licensed clinical psychologist and expert in narcissistic relationships, Dr. Ramani digs deep into the behaviors and patterns that narcissists use every single day to manipulate the hell out of you and keep you sucked into the relationship. \nMost people don’t know this about her, but my girl Dr. Ramani has actually been a victim of narcissistic abuse many times throughout her own life. And in this episode she is sharing some of the lessons she learned from her own experiences and the knock-on effects those experiences still have on her to this day.\n\nIn this episode, we’re diving into:\n\n- Societal myths about narcissists that diminish the seriousness of their abuse \n\n- The best way to approach someone you think is in a relationship with a narcissist (and how to respond if YOU’RE the one approached!)\n\n- The self-blame spiral that has you thinking it’s YOUR fault \u0026 why you MUST escape it to take your power BACK from the narcissist!\n\n- AND SOOOO MUCH MORE!! \n\n\nAnd that’s just in part 1 of this 2 part episode! \n\nSo if you’re ready to finally frikin’ MOVE ON from that toxic person in your life then grab a cuppa and listen close homie, because this episode does NOT disappoint! \n\nOrder your copy of Dr. Ramani\u0027s new book here: https://a.co/d/7qYmF0f\n\nFollow Dr. Ramani:\nWebsite: https://doctor-ramani.com/ \nYouTube: https://www.youtube.com/@DoctorRamani\nOrder “It’s Not You”: https://a.co/d/7qYmF0f\n\nFollow Me, Lisa Bilyeu: \nWebsite: https://www.radicalconfidence.com/ \nInstagram: https://www.instagram.com/lisabilyeu/ \nFacebook: https://www.facebook.com/lisabilyeu \nX: https://twitter.com/lisabilyeu \n\nIf you want to dive deeper into my content, search through every episode, find specific topics I\u0027ve covered, and ask me questions. Go to my Dexa page: https://dexa.ai/lisabilyeu \n\nThemes: Confidence, Relationships, Business, Mental Health, Self-Improvement\n\nSPONSORS:\nIf you purchase an item using these affiliate links, Impact Theory may receive a commission.\nSign up for a one-dollar-per-month trial period at https://shopify.com/lisa now to grow your business–no matter what stage you’re in.\nSign up at https://lastbottlewines.com, use code LISA to save 10%, and find out why Last Bottle is the most fun way to discover and buy amazing wine. \nThis episode is sponsored by Betterhelp. Give online therapy a try at https://betterhelp.com/women and get on your way to being your best self!\nGet a free 30-day Alo Moves subscription by going to https://alomoves.com and use code WOI30.\nGo to https://tryviome.com/LISA and use code LISA to get 20% off your first 3 months, and take control of your gut health today!\nTry AG1 and get a FREE 1-year supply of Vitamin D3K2 AND 5 free AG1 Travel Packs with your first purchase by going to https://drinkAG1.com/lisa.\n\n***CALLING ALL BADASSES!***\nIf you really want to level up your confidence game, check out the WOMEN OF IMPACT SUBSCRIPTION, specially designed to turn you into the badass you were born to be! \n\n*New episodes delivered ad-free, EXCLUSIVE access to hundreds of archived Women of Impact episodes, and so much more!*\nDon\u0027t settle for mediocrity when you can be extraordinary!\n\n*****Subscribe on Apple Podcasts: https://apple.co/457ebrP*****\nSubscribe on all other platforms (Google Podcasts, Spotify, Castro, Downcast, Overcast, Pocket Casts, Podcast Addict, Podcast Republic, Podkicker, and more) : https://impacttheorynetwork.supercast.com/\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-03-20T08:00:00Z",
      "duration": "00:47:20",
      "explicit": false,
      "spotifyId": "6yM6jH6hzScFD6TKF8tZnJ",
      "appleId": 1000649839821,
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6yM6jH6hzScFD6TKF8tZnJ",
        "apple": "https://podcasts.apple.com/podcast/exclusive-1-narcissist-expert-on-how-she-got-fooled/id1435217865?i=1000649839821"
      }
    },
    {
      "id": "c1cb54c8-19af-4160-8f00-85405036da0e",
      "title": "Girl, That\u0027s TOXIC! - Signs They’re A Narcissist \u0026 How to Set Boundaries ASAP! | Dr. Ramani",
      "description": "Today I\u0027m joined live by the one and only Dr. Ramani! She\u0027s here to answer YOUR questions about how to spot the signs you\u0027re dealing with a narcissist. Have you wondered if your parent might be a narcissist? Maybe a sibling or a partner? What do you do after you\u0027ve spotted the red flags? How do you set boundaries with a narcissist? Join us live to get these questions (and more!) answered by the incredible Dr. Ramani!\n\np.s. Ramani has a new book coming out in February! Pre-order it here: \nhttps://a.co/d/7ubHHTr",
      "release": "2023-11-18T02:36:47Z",
      "duration": "00:26:15",
      "explicit": false,
      "youTubeId": "NIqfRoEmXcU",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NIqfRoEmXcU"
      }
    }
  ]
}