{
  "id": "69fcae3e-b9c3-4718-847a-59a7bd66999b",
  "name": "Lisa Sonni | Stronger Than Before",
  "youTubeChannelId": "UC36rwVG3641w5FZIuxNJxRg",
  "episodes": [
    {
      "id": "44930287-1c2f-4f22-99c7-b02752f32f65",
      "title": "Narcissistic Abuse Is a Cult: Trauma Bonds, Brainwashing, and Breaking Free w/ Vanessa Reiser | S2E6",
      "description": "When a relationship feels like oxygen at first and a chokehold later, you’re not “being dramatic”—you’re being indoctrinated. Narcissistic abuse doesn’t look like a one-off bad boyfriend; it mirrors a cult: love-bombing as recruitment, rules that keep shifting, punishment for noncompliance, and a leader who claims to be the only source of truth and love. If you’ve ever wondered why smart, capable people stay, this is why. Lisa sits down with licensed therapist and author Vanessa M. Reiser, LCSW, to map the cult mechanics of narcissistic relationships: idealize–devalue–discard, the Pavlovian reward/punishment loop that forges a trauma bond, and the “double bind” that ensures you’re wrong whether you comply or resist. They dismantle myths (“I’d never fall for that,” “you could have left anytime”) and name what’s really happening—coercive control that erodes free will, isolates you from your reality checks, and keeps you chasing crumbs after a manufactured high. Vanessa shares clear, clinician-backed ways to reclaim yourself: depersonalize the abuse (“it wasn’t about your worth”), rebuild nervous-system safety, and replace the fantasy with facts. \n\nYou are not weak for being targeted; predators select, condition, and confuse. Clarity is the exit ramp. With language for what happened and community that reflects your reality back to you, you can break the bond and rebuild a self that’s yours again.  \n\nResources mentioned:\n• Vanessa M. Reiser, LCSW — therapist \u0026 author \n• Dr. Ramani — educator on narcissistic abuse \n• Dr. Nadine Macaluso — clinician speaking on trauma bonds\n\nLisa Sonni\nStronger Than Before Coaching | Narcissistic Abuse \u0026 Trauma Bond Recovery Expert\nCertified Trauma Recovery Coach specializing in evidence-based healing methods\n\nHelping survivors break free from narcissistic abuse and trauma bonds through evidence-based recovery coaching and healing resources. Transform from surviving to thriving with proven trauma recovery methods.\n\nAbout Lisa Sonni:\nTrusted by over 1 million survivors worldwide. Providing expert narcissistic abuse recovery coaching, trauma healing resources, and transformational programs. Author of 4 bestselling recovery books and creator of the Break \u0026 Rebuild Method™ featured inside the Trauma Bond Recovery Course. Host of Real Talk with Lisa Sonni: Relationships Uncensored Podcast.\n\n✨ FREE RECOVERY RESOURCES:\n→ FREE \u0027Are You Trauma Bonded?\u0027 2 minute quiz with instant results \n   https://kcdplmm983r.typeform.com/traumabondquiz\n→ FREE Narcissistic Abuse Recovery Guide: 12-Step Healing Blueprint\n   https://www.subscribepage.com/trauma-bond-recovery\n→ FREE \u0027What\u0027s Your Biggest Roadblock To Healing?\u0027 2 min quiz with instant results\nhttps://kcdplmm983r.typeform.com/Rebuilding \n→ FREE \u0027Are You Done Yet?\u0027 2 min quiz with instant results to find out if you\u0027re even ready to let go: https://kcdplmm983r.typeform.com/to/oSYnDn3R\n\n🌟 TRANSFORM YOUR LIFE:\n→ 1:1 Recovery Coaching: Talk to Lisa\n   https://strongerthanbefore.ca/book-a-session\n→ Trauma Bond Recovery Course: Break Free Forever\n   https://strongerthanbefore.ca/trauma-bond-recovery\n→ Toxic Free Relationship Club: Join Our Healing Community\n   https://strongerthanbefore.ca/membership\n\n📚 HEALING RESOURCES BY LISA SONNI:\nThe Trauma Bond Recovery Journal\nhttps://a.co/d/h7pdo14\nRebuilding After A Trauma Bond: A Self-Love Journal\nhttps://a.co/d/5aefClg\nNarcissism Unmasked: A Survivors Handbook\nhttps://a.co/d/dM16LbZ\nSurviving To Thriving: Six Step Blueprint to Recovery\nhttps://a.co/d/0Jtxpym\n\n🔒 CERTIFIED TRAUMA SPECIALIST:\n- Certified Narcissistic Abuse Recovery Coach\n- Trauma-Informed Relationship Expert\n- Danger Assessment Professional\n- Certified Trauma Bond Recovery Specialist\n- Specialized in Complex PTSD Recovery\n\n💕 JOIN OUR HEALING COMMUNITY:\nInstagram: @stronger_than_before_coach_\nTikTok: @stronger_than_before\nWebsite: https://strongerthanbefore.ca\n\n#NarcissisticAbuse #TraumaRecovery #NarcissisticAbuseRecovery \n#TraumaBonding #EmotionalAbuse #NarcissisticPersonalityDisorder #HealingFromTrauma #ToxicRelationships\n\n⚠️ DISCLAIMER: This content is for educational and informational purposes only. It is not therapy or medical advice. Always seek professional help for your specific situation.",
      "release": "2025-10-09T16:12:55Z",
      "duration": "00:00:00",
      "explicit": false,
      "youTubeId": "4Y463OKlhI8",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4Y463OKlhI8"
      }
    }
  ]
}