{
  "_ts": 0,
  "id": "892c97c5-072a-4e33-b41a-74a18646692c",
  "name": "Lisa Bilyeu",
  "spotifyId": "2Pv6X6iCwFmwGwxfrwHdfW",
  "appleId": 1435217865,
  "youTubeChannelId": "UCeir7Wbzzfg43c1eL7PSa3g",
  "episodes": [
    {
      "id": "91b954f7-dea6-44a4-bf9e-c12e3a24799e",
      "title": "Cult Expert: Signs He\u0027s a Psychopath, Narcissist, Con Man Or CULT LEADER! (Don\u0027t be his next victim)",
      "description": "If you\u0027ve ever been controlled by someone mentally or emotionally, then you know how crushing it is to your confidence, your self-esteem, and your belief in yourself. \n\nYou question HOW this person convinced you to do or say or believe things that you KNOW deep down to your core are not true? WHAT did they do to get you to fall for the lies and change so much, without you even frikin’ realizing it? And HOW can you make sure it doesn’t happen to you again?? \n\nWell homie, the reality is that this type of manipulation happens more often than you might think, 1 on 1 in toxic relationships and sometimes even whole groups of people at a time in a cult. \n\nSo in this episode of Women of Impact, I wanted to get to the bottom of how good, well-intentioned, educated, “normal” people like you and me can fall into the trap of a controlling person like a cult leader or narcissistic romantic partner, and literally leave behind their life, family, job, money, friends, belief system, sanity, and everything about themselves for this person. \n\nAnd whether it’s coz of a cult, a toxic partner, or a guy at work that keeps trying to convince you to join this “amazing self-help group”, if you think it “won’t happen to you” – well homie you’re actually that much more likely to become their next target and victim!!!! \n\nAnd that’s why today’s guest is none other than the ultimate cult expert and deprogrammer, Rick Alan Ross. This guy is an aboslute LEGEND when it comes to cults!!\n\nWe go deep into: \n- the type of people who start cults.\n- how cults like NXIVM and Scientology bring people in.\n- what specifically makes a person more vulnerable to saying yes and “drinking the Kool-aid”.\n- strategies used by notorious cult leaders to gain control and brainwash people (and you’ll be surprised by what they have in common with your toxic ex!!!).\n- HOW you can actually avoid getting into a cult or toxic relationship in the first place.\n- \u0026 so much more!!!\n\nAnd that’s just in PART 1 of this 2 part episode!\n\nThis episode is truly FILLED with the knowledge you NEED if you want to have any hope of spotting the cult leaders, con men, and toxic boyfriends BEFORE they can rope you, or anyone you love, into their manipulative world and cut you off from the life YOU want to live!!! \n\n\nCHAPTER MARKERS: \n\n🚩 [0:00] Warning signs of a cult or abusive relationship \n🧠 [8:55] The process of cult indoctrination \n😖 [35:39] Notorious cults, their crimes \u0026 the victims\n❌ [1:02:46] How toxic abusers gain control \n\n\n🔥 HOT RICK ALAN ROSS QUOTES:\n\n\u0022You have to ask yourself, can I disagree with this person? Can I disagree with the leader of this group? Is there a place for constructive criticism? Am I becoming socially isolated by being in this group? Am I cutting off people that are my family, my friends, particularly if they\u0027ve raised questions about this leader of the group I\u0027m involved with or this partner that I\u0027m now going out with and making an integral part of my life?\u0022\n\n\u0022[Cult leader Keith] Raniere, by working on these people year after year, seminar after seminar, over a period of time, he would, as you say, wear them. He would wear them down and they would change and they would bend and change their thinking, their perception of reality based on what he indoctrinated them to believe.\u0022\n\n“These were very sophisticated, very well educated people, and yet they succumb to these persuasion techniques.\u0022\n\n\u0022The group makes you feel so broken continuously, but you feel you can\u0027t leave because you\u0027re broken and you need to be fixed, and it\u0027s always your fault. You\u0027re made to feel shame and guilt.\u0022\n\n\u0022In groups that are totalistic and authoritarian, people are led to believe that the group has one solution and that this solution is perfect and that it is right for all people at all times.\u0022\n\n\u0022This is that ‘us versus them’ mentality that we see in cults, where there\u0027s a sharp line drawn between us, the people that have the truth and the way and everyone else.\u0022\n\n\nFollow Rick Alan Ross:\nWebsite: https://culteducation.com/\nX: https://x.com/RickAlanRoss\nGet “Is This a Cult?”: https://a.co/d/hKoEsRt\n\nFollow Me, Lisa Bilyeu: \nWebsite: https://www.radicalconfidence.com/ \nInstagram: https://www.instagram.com/lisabilyeu/ \nFacebook: https://www.facebook.com/lisabilyeu \nX: https://twitter.com/lisabilyeu \n\n\nIf you want to dive deeper into my content, search through every episode, find specific topics I\u0027ve covered, and ask me questions. Go to my Dexa page: https://dexa.ai/lisabilyeu \n\nThemes: Confidence, Relationships, Business, Mental Health, Self-Improvement\n\nWARNING: I will never ask for your contact info in the comments section, that is someone impersonating me!",
      "release": "2024-09-18T13:00:57Z",
      "duration": "01:08:01",
      "explicit": false,
      "spotifyId": "65kZDuDLs0wq6jdFyjcPhQ",
      "appleId": 1000669909049,
      "youTubeId": "nmTfVrlWdyQ",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65kZDuDLs0wq6jdFyjcPhQ",
        "apple": "https://podcasts.apple.com/podcast/from-cults-to-control-freaks-a-cult-experts-guide/id1435217865?i=1000669909049",
        "youtube": "https://www.youtube.com/watch?v=nmTfVrlWdyQ"
      }
    }
  ]
}