{
  "_ts": 0,
  "id": "3b89ed6d-4ea6-432c-b980-728a772d8373",
  "name": "How We Can Heal",
  "spotifyId": "3mr3c9GgQusuL0dy08B3IW",
  "appleId": 1613646964,
  "youTubeChannelId": "UClWtofIVMVvqDZ5na4urmDw",
  "episodes": [
    {
      "id": "6b9af98b-444a-4018-8d11-8d1f427e0267",
      "title": "Traumatic Narcissism and Cult Dynamics With Dan Shaw – How We Can Heal Podcast S4 E 8",
      "description": "Traumatic Narcissism and Cult Dynamics With Dan Shaw\n\nIn this episode of the How We Can Heal Podcast, host Lisa Danylchuk welcomes Daniel Shaw, a psychotherapist trained in psychoanalysis and trauma-informed therapies, to discuss traumatic narcissism and cult dynamics. Daniel shares his personal journey from being an actor early in life to becoming a member of what he discovered over time was a spiritual cult. Today he shares how these experiences spurred his interest in trauma, and why he coined the term \u0022traumatizing narcissist\u0022. He elaborates on the behaviors and characteristics of traumatizing narcissists, the impact on their victims, and how these dynamics can manifest in various relationships and institutions. They also touch on the importance of recognizing these abusive patterns for effective therapy and recovery. This episode aims to validate and support victims of traumatic narcissism while providing insights for therapists.\n\n00:52 Acknowledging Our Sponsor: ISSTD\n02:13 Introducing Daniel Shaw\n03:43 Daniel Shaw\u0027s Journey into Trauma Work\n15:01 Understanding Traumatic Narcissism\n31:43 Delusional Contagion and Narcissistic Omnipotence\n34:48 Impact on Victims and Coercive Control\n39:32 Yoga for Trauma Online Training Program\n41:01 Abuse in the Yoga Community\n44:28 Narcissism in Helping Professions\n48:39 Personal Reflections on Authoritarianism\n51:49 Resources for Healing from Narcissistic Abuse\n56:57 Hope and Human Potential\n58:48 Podcast Conclusion and Acknowledgements\n\nFor more info about Dan\u0027s work visit: https://danielshawlcsw.com/\n\n-- \n\nThis episode is sponsored by the International Society for the Study of Trauma and Dissociation (ISSTD). \n\nThe International Society for the Study of Trauma and Dissociation is an international, non-profit, professional association organized to develop and promote comprehensive, clinically effective and empirically based resources and responses to trauma and dissociation and to address its relevance to other theoretical constructs. \n\nVisit https://cfas.isst-d.org/ to access educational offerings for both professionals and non-professionals \n\nTo learn more and become a member, visit: https://www.isst-d.org/",
      "release": "2024-08-19T14:00:26Z",
      "duration": "01:00:41",
      "explicit": false,
      "spotifyId": "0i1kjkPs6RDlOgfC82310d",
      "youTubeId": "Jwky7X3GwL0",
      "subjects": [
        "Cult-Expert",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0i1kjkPs6RDlOgfC82310d",
        "apple": "https://podcasts.apple.com/podcast/untitled-episode/id1613646964?i=1000665894180",
        "youtube": "https://www.youtube.com/watch?v=Jwky7X3GwL0"
      }
    }
  ]
}