{
  "_ts": 0,
  "id": "aa803057-5a8a-43e3-976e-9561dba580b3",
  "name": "Lisa Joins a Cult",
  "spotifyId": "4nvTrcyYR4HXKRBlMNNBrh",
  "appleId": 1690727232,
  "episodes": [
    {
      "id": "d6b24cd0-9ea8-4a67-b51e-bb3c1dffb039",
      "title": "The Amish",
      "description": "In this episode, Lisa delves into her immersive experience among the Amish community in Lancaster, Pennsylvania, known for its significant Amish population. Staying with an elderly Amish couple, Lisa explores the intricacies of the Amish lifestyle, emphasizing their strict adherence to traditional practices and their aversion to modern conveniences. Her intimate encounter provides a rare insight into the personal and community dynamics of the Amish, revealing the complexities and contradictions of their seemingly simple way of life. The episode also examines the broader implications of the Amish\u0027s secluded lifestyle, including the challenges and pressures associated with living under rigid religious doctrines. Lisa discusses the internal and external perceptions of the Amish, contrasting their idealized image with the reality of their daily lives, which are governed by stringent rules that control every aspect of their existence. Through personal anecdotes and reflective insights, the episode offers a thoughtful critique of Amish culture, questioning the sustainability and ethical implications of their insular practices in a modern context. Welcome to Lisa joins a cult",
      "release": "2024-04-27T18:00:00Z",
      "duration": "00:48:43.9370000",
      "explicit": false,
      "spotifyId": "6QJniEzKuLRgrY26SGa6Hq",
      "appleId": 1000653777666,
      "subjects": [
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6QJniEzKuLRgrY26SGa6Hq",
        "apple": "https://podcasts.apple.com/podcast/the-amish/id1690727232?i=1000653777666"
      }
    },
    {
      "id": "2414a0ce-01f4-4684-a930-2afe94bd5919",
      "title": "12 Tribes",
      "description": "When Lisa embarked on her exploration of the 12 Tribes, what she encountered was a microcosm of communal living that operates at the intersection of Christian communalism and retro-hippie idealism, underscored by a unique self-sufficiency reminiscent of a Mennonite settlement. The 12 Tribes, with their self-governing ethos and economic reliance on internal businesses like the Yellow Deli, illustrate a potent example of how religious and communal identities can shape economic structures and daily practices in insular communities. Delving deeper, Lisa’s narrative sheds light on the complex dynamics of life within the 12 Tribes. Her accounts reveal a community deeply invested in maintaining cultural purity through strict adherence to dress codes, dietary restrictions, and limited external influences, which includes a cautious approach to technology and a heavy emphasis on communal labor. This exploration, rich in detail and observation, not only highlights the operational intricacies of the 12 Tribes but also prompts a broader reflection on the implications of such a lifestyle for personal freedom and societal norms, framed through the lens of a community striving to carve out a path that is both separate from and in response to modern societal pressures. Welcome to Lisa joins a cult",
      "release": "2024-04-18T01:00:00Z",
      "duration": "01:07:08.9690000",
      "explicit": false,
      "spotifyId": "2jlsOMtMjf3sNgyAeQbEAk",
      "appleId": 1000652796702,
      "subjects": [
        "Twelve Tribes",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2jlsOMtMjf3sNgyAeQbEAk",
        "apple": "https://podcasts.apple.com/podcast/12-tribes/id1690727232?i=1000652796702"
      }
    },
    {
      "id": "c06e4afb-f148-4a1c-ad51-9d2dab0f84e2",
      "title": "Catholicism",
      "description": "In this episode, Lisa shares her unique experiences with the Catholic Church, starting with a childhood misunderstanding at a relative\u0027s wedding, leading to humorous encounters with church customs. She recounts living in a nun-operated dorm in New York, her initial awe and subsequent interactions with nuns, and a reflective visit to St. Patrick\u0027s Cathedral. The discussion broadens to include Lisa\u0027s interactions with religious practices, including an attempt at confession and attending a church service, juxtaposing personal beliefs with institutional doctrines. Highlighting moments of connection and questioning, the episode captures the complexity of religious identity and belonging. It invites reflection on the diversity of spiritual experiences and the impact of cultural and religious frameworks on individual paths to understanding. Welcome to Lisa joins a cult",
      "release": "2024-04-10T15:00:00Z",
      "duration": "00:51:02.2560000",
      "explicit": false,
      "spotifyId": "1f9kUfJTgAmmDsMlgAno5Q",
      "appleId": 1000652039948,
      "subjects": [
        "Catholicism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1f9kUfJTgAmmDsMlgAno5Q",
        "apple": "https://podcasts.apple.com/podcast/catholicism/id1690727232?i=1000652039948"
      }
    },
    {
      "id": "5aeb2981-92e7-4438-8a5c-51968e66cecc",
      "title": "Church of Jesus Christ of Latter-day Saints Pt. 2",
      "description": "In this episode of \u0022Lisa Joins a Cult,\u0022 join Lisa as she embarks on a journey deep into the heart of Mormonism. It all begins with her fascination with touring a temple, leading her to anticipate visiting the iconic Washington, D.C. temple for its open house. However, plans take an unexpected turn, and Lisa finds herself heading to Idaho to explore a newly constructed temple, immersing herself in encounters that provide fascinating insights into the Mormon faith.As the episode progresses, listeners are taken on a deep dive into the complexities of Mormon family dynamics. Through candid conversations and observations, Lisa juxtaposes her own familial experiences with those she encounters within Mormon gatherings, shedding light on the significance of large families and the theological underpinnings driving procreation within Mormonism. With thought-provoking discussions on the similarities and differences between Mormonism and mainstream Christianity, \u0022Lisa Joins a Cult\u0022 offers a captivating exploration of faith, culture, and identity, blending personal anecdotes with insightful cultural analysis to engage listeners throughout the episode.Welcome to Lisa joins a cult",
      "release": "2024-02-08T02:00:00Z",
      "duration": "00:43:50.3730000",
      "explicit": false,
      "spotifyId": "5ekZC8iodgI1UOfzr9wC1l",
      "appleId": 1000644573976,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ekZC8iodgI1UOfzr9wC1l",
        "apple": "https://podcasts.apple.com/podcast/church-of-jesus-christ-of-latter-day-saints-pt-2/id1690727232?i=1000644573976"
      }
    },
    {
      "id": "c6dd0cb6-384b-46bb-b990-2aaa3243f870",
      "title": "Church of Jesus Christ of Latter-day Saints Pt. 1",
      "description": "In this podcast episode, the host, Lisa, shares quirky experiences with members of the Church of Jesus Christ of Latter-day Saints, commonly known as Mormons. The stories span various regions of the United States and highlight the distinctions between mainstream Mormons (LDS) and fundamentalist Mormons (FLDS). The episode delves into the history of the Mormon Church, including the founder Joseph Smith\u0027s alleged encounter with an angel and the creation of the Book of Mormon. Lisa also explores Mormon practices such as celestial marriage, baptism for the dead, and the unique garments worn by Mormons. The episode concludes with a preview of upcoming content and encourages listeners to like, subscribe, and share for the upcoming part two.Welcome to Lisa joins a cult",
      "release": "2024-01-24T22:00:00Z",
      "duration": "00:43:40.4210000",
      "explicit": false,
      "spotifyId": "7Ci0ioW2pbiWmEukKGnaVD",
      "appleId": 1000642835820,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Ci0ioW2pbiWmEukKGnaVD",
        "apple": "https://podcasts.apple.com/podcast/church-of-jesus-christ-of-latter-day-saints-pt-1/id1690727232?i=1000642835820"
      }
    },
    {
      "id": "6d294dec-cdeb-46a4-b5b0-00ce063dad03",
      "title": "Father Divine",
      "description": "Listen in as Lisa tells her tale of visiting the infamous community started by the illustrious Father Divine.  Welcome to Lisa joins a cult",
      "release": "2023-09-30T20:00:00Z",
      "duration": "00:58:49.3510000",
      "explicit": true,
      "spotifyId": "25fWqDiURKOlaawFKy8rIm",
      "appleId": 1000629759101,
      "subjects": [
        "International Peace Mission movement"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/25fWqDiURKOlaawFKy8rIm",
        "apple": "https://podcasts.apple.com/podcast/father-divine/id1690727232?i=1000629759101"
      }
    },
    {
      "id": "7a91a019-c9eb-448f-b32e-3c997064864f",
      "title": "The Moonies Pt. 2",
      "description": "Welcome, welcome, welcome, one and all.You’re listening to the inaugural episode of Lisa Joins a Cult. A show that explores the world of cultic organizations through real life encounters and lived-in research. In each episode you’ll hear a conversation about a group Lisa VanArsdale has infiltrated in her curious quest to understand faith and the belief systems of others. Joining Lisa in these conversations is co-host Syran Warner, a journalist who’s brought a number of obscure cult stories into the public imagination.Today, we’ll be hearing the second installment of a discussion about the unification church, whose members are commonly known as the moonies. In the last episode we learned about the group’s history and were introduced to the two factions of the that are currently active in America. This week we’ll be jumping straight into Lisa’s personal encounters with both sects and we’ll find out how she found herself on a gun range in Pennsylvania with a cult leader. Welcome to Lisa joins a cult",
      "release": "2023-06-24T21:00:00Z",
      "duration": "00:40:57.9650000",
      "explicit": true,
      "spotifyId": "4Zf7b5N5C7xawflCwlekuR",
      "appleId": 1000618205182,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Zf7b5N5C7xawflCwlekuR",
        "apple": "https://podcasts.apple.com/podcast/the-moonies-pt-2/id1690727232?i=1000618205182"
      }
    },
    {
      "id": "cc8aef6f-ce71-400a-b0a2-95364f173372",
      "title": "The Moonies Pt. 1",
      "description": "Welcome, welcome, welcome, one and all.You’re listening to the inaugural episode of Lisa Joins a Cult. A show that explores the world of cultic organizations through real life encounters and lived-in research. In each episode you’ll hear a conversation about a group Lisa VanArsdale has infiltrated in her curious quest to understand faith and the belief systems of others. Joining Lisa in these conversations is co-host Syran Warner, a journalist who’s brought a number of obscure cult stories into the public imagination.Today Lisa and Syran will be discussing a group called the Unification Church, whose followers are commonly known as the Moonies. The cult originated in South Korea before turning into a global institution with a hell of a lot of influence. You’ll hear a discussion about mass weddings, espionage, and the man who created the madness before Lisa tells us about visiting the various remaining factions of Moonies in the United States.   Welcome to Lisa joins a cult.Welcome to Lisa joins a cult",
      "release": "2023-06-02T03:00:00Z",
      "duration": "00:40:12.4860000",
      "explicit": true,
      "spotifyId": "28nkZIbozL9idDfJft8pWX",
      "appleId": 1000615368870,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28nkZIbozL9idDfJft8pWX",
        "apple": "https://podcasts.apple.com/podcast/the-moonies-pt-1/id1690727232?i=1000615368870"
      }
    }
  ]
}