{
  "_ts": 0,
  "id": "15087059-ccbb-4e53-aab3-8684ac2a1a80",
  "name": "Lissa Rankin, MD",
  "youTubeChannelId": "UCz4WBHOoj__N722JQrih_eA",
  "episodes": [
    {
      "id": "a5ca149c-c173-4e47-ad9c-9cd8ddf57695",
      "title": "Part 1/3 Acknowledging The Invisible Wound Of Being A Cult Survivor",
      "description": "Spiritual abuse leaves hidden scars. Dr. Lissa Rankin, Dr. Jeffrey Rediger, and Anke Richter explore cult recovery, childhood indoctrination, and the lifelong wounds caused by coercive spirituality. Resources: https://lissarankin.com\n\nSpiritual Abuse, Cult Recovery \u0026 Culty Families | Lissa Rankin, Jeffrey Rediger \u0026 Anke Richter\n\nWhy is recovering from cult abuse so devastating—especially when it’s wrapped in spiritual language?\n\nIn this raw and revealing conversation, Dr. Lissa Rankin (author of Mind Over Medicine), Dr. Jeffrey Rediger (author of Cured), and investigative journalist Anke Richter (author of Cult Trip) dive deep into the hidden wounds of spiritual abuse, childhood indoctrination, and the long-term impacts of growing up in high-control, culty environments.\n\n💔 Whether you grew up in a fundamentalist church, were raised in a spiritually abusive household, or fell under the spell of a narcissistic teacher or guru, the impact on your sense of self, boundaries, and nervous system regulation can last for decades.\n🧠 We explore:\n• The trauma of “blanket training” and forced obedience in the IBLP cult\n• How spiritual bypassing is weaponized to suppress dissent and enforce loyalty\n• The invisible handicaps children carry into adulthood after cult conditioning\n• Why leaving is only the beginning of the healing journey\n• What real relational and spiritual recovery requires\n\n📘 Learn more from:\nCult Trip by Anke Richter\nCured by Jeffrey Rediger, MD, MDiv\nRelationSick (coming May 2026) by Lissa Rankin, MD \u0026 Jeffrey Rediger, MD\n\n💗 Join our ongoing IFS-based recovery community at:\n 🌐 https://lissarankin.com\n\n🎥 Subscribe for more trauma-informed content on relational healing, cult recovery, nervous system repair, and spiritual integrity.",
      "release": "2025-06-29T02:39:09Z",
      "duration": "00:27:39",
      "explicit": false,
      "youTubeId": "WzEu20ZyoYw",
      "subjects": [
        "Cult Recovery",
        "Cult Psychology",
        "Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WzEu20ZyoYw"
      }
    },
    {
      "id": "08d81baf-315b-4d93-9a8a-9a580add6f31",
      "title": "3 Why Oprah Owes John of God Victims Apologies, Accountability \u0026 Reparations",
      "description": "Oprah helped elevate John of God—then erased all trace of it. In this powerful conversation, we talk about survivor justice, celebrity accountability, and the spiritual bypassing that still protects abusers. More: https://lissarankin.com\n\nHow do cult leaders like John of God gain legitimacy?\n By enlisting doctors, journalists, and celebrities who unknowingly amplify their image, until the truth can no longer be ignored.\nIn this urgent and unflinching conversation, Dr. Lissa Rankin (Sacred Medicine), journalist Anke Richter (Cult Trip), and psychiatrist Dr. Jeffrey Rediger (Cured) examine how Oprah Winfrey’s global platform contributed to the rise of John of God, now convicted of over 50 counts of rape and abuse.\n💥 Topics we explore:\n• How Oprah’s team featured John of God twice and later deleted all evidence without a public apology or reparations to victims\n• The responsibility of public figures to vet spiritual leaders before platforming them\n• Why victims deserve more than silencez–they deserve truth, justice, and repair\n• Anke’s experience as a former “cult tourist” and her call for accountability from Rajneesh/Osho enablers\n• How spiritual bypassing protects abusers while retraumatizing survivors\n• What it means to be a bystander—and how to use your power to speak up\n\nThis conversation is not about blame—it’s about repair.\nIt\u0027s about what happens when discernment fails, and what accountability could look like in the aftermath.\n\n📣 Three key takeaways close the video with actionable insights for viewers who care about justice, trauma healing, and survivor support.\n\n💗 Learn more or join our trauma-informed recovery community:\n 🌐 https://lissarankin.com\n📘 Read Cult Trip by Anke Richter\n📘 Read Cured by Jeffrey Rediger\n📘 RelationSick (coming May 2026) by Lissa Rankin \u0026 Jeffrey Rediger\n\n🔔 Subscribe for more truth-telling conversations about spiritual abuse, relational healing, and trauma-informed activism.",
      "release": "2025-06-26T22:15:32Z",
      "duration": "00:31:52",
      "explicit": false,
      "youTubeId": "b5GMjThOqU8",
      "subjects": [
        "John of God",
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=b5GMjThOqU8"
      }
    },
    {
      "id": "ec4da635-4f53-4613-ade5-77b52916abb1",
      "title": "2 Nobody Is Too Smart To Get Seduced Into A Cult",
      "description": "Cults don’t exploit your flaws—they exploit your goodness. In this compassionate talk, Lissa Rankin, Anke Richter, and Jeffrey Rediger explore why nobody is immune to cultic dynamics. Resources: https://lissarankin.com\n\nThink you’re too smart, too skeptical, too self-aware to fall for a cult?\nThink again.\n\nIn this honest and eye-opening conversation, Dr. Lissa Rankin (Mind Over Medicine), psychiatrist Dr. Jeffrey Rediger (Cured), and journalist Anke Richter (Cult Trip) explore how cults prey not on our weaknesses—but on our strengths.\n\n🌟 Cults don’t just target the lost or naive. They attract people who are:\n• Idealistic\n• Emotionally intelligent\n• Committed to healing and justice\n• Curious, open-hearted seekers\n• Willing to do their shadow work and be accountable\n\nIt’s precisely these high-integrity traits that are exploited by high-control leaders and narcissistic group dynamics.\n\n💬 In this video, we unpack:\n• Why anyone can be pulled into cultic dynamics—regardless of intelligence or education\n• How spiritual, therapeutic, and activist communities can become cult-adjacent\n• Why shame after leaving a cult is misplaced (and how to reclaim your narrative)\n• How power corrupts—and why power must be checked\n• What healthy community and true growth actually look like\n\nThis is a must-watch for anyone recovering from spiritual abuse, toxic mentorship, or high-demand group dynamics. You are not alone—and you were never foolish for trusting the parts of you that longed to make the world better.\n\n💗 Learn more and find support at:\n 🌐 https://lissarankin.com\n 📘 Cult Trip by Anke Richter\n 📘 Cured by Jeffrey Rediger\n 📘 RelationSick (coming May 2026)\n\n🔔 Subscribe for more trauma-informed conversations about healing, power, and post-cult integration.",
      "release": "2025-06-26T21:16:56Z",
      "duration": "00:27:15",
      "explicit": false,
      "youTubeId": "MvHBfPTia6U",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery",
        "Cult-Expert",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=MvHBfPTia6U"
      }
    },
    {
      "id": "a25bdc9d-c30e-4fa9-b518-150e815e7644",
      "title": "Acknowledging The Invisible Wound Of Being A Cult Survivor 1",
      "description": "Spiritual abuse leaves hidden scars. Dr. Lissa Rankin, Dr. Jeffrey Rediger, and Anke Richter explore cult recovery, childhood indoctrination, and the lifelong wounds caused by coercive spirituality. Resources: https://lissarankin.com",
      "release": "2025-06-26T05:25:51Z",
      "duration": "00:28:17",
      "explicit": false,
      "youTubeId": "4hq1tYoJ--4",
      "subjects": [
        "Cult Recovery",
        "Psychology",
        "Cult-Expert",
        "Cult Psychology",
        "Institute In Basic Life Principles",
        "Gloriavale",
        "Children Of God",
        "Centrepoint"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4hq1tYoJ--4"
      }
    }
  ]
}