{
  "_ts": 0,
  "id": "ce3d646d-1a35-4350-bc9a-cb4ef7609ad3",
  "name": "LIVE LIKE EDEN",
  "spotifyId": "3rzFyHt1VE8FRtHsRwDWgP",
  "appleId": 1660060852,
  "youTubeChannelId": "UC8gYZH0t9e6wwoRzgOe6dRg",
  "episodes": [
    {
      "id": "52f2aadb-8bb1-48d6-b9fd-bbf8cfdfb24e",
      "title": "Healing from Religious Cults and Abusive Relationships with Brooke Deanne",
      "description": "Join me today as I share an in-depth chat with Trauma Healing Mentor Brooke Deanne. She shares her personal story being born and raised in a religious cult, her courage and strength to leave in her thirties, and the journey of healing and re-discovering her true identity. Brooke\u0027s personal journey of spiritual transformation is inspiring and a testament to the human spirit. Her experience shaped who she is today and created the incredible healing services she offers others who have lived through cult trauma and other abusive relationships. Don\u0027t miss today\u0027s show to learn more about: Characteristics of the Cult Mentality Brainwashing, Authority and Control The Process of Healing- Denial, Losing the Identity, \u0026 Rediscovering Your Authentic Self Awakening to the Higher Self Help is Available in Various Forms of Therapy Bringing awareness to the suffering from cult brainwashing and narcissistic abuse is reframing the path forward for true healing and empowerment. Show Notes: Look for her upcoming book Shattered, Broken, \u0026 Beautiful - Losing My Religion and Finding Faith due out this spring 2025. It will be available on Amazon and directly on Brooke’s website: https://www.lifecoachinggoddess.com/ . Visit Brooke\u0027s website for therapeutic services based on healing from abusive relationships and religious cult trauma. The Grief Monster Children\u0027s Book Brooke\u0027s Podcast: Goddess Rising I love hearing from you! Please send me a text with your insights, questions, and show topic ideas anytime! TAKE THE AWAKENING QUIZ Click Here Receive your results with a personal podcast playlist to help guide you on your own unique spiritual path. Website www.livelikeeden.com Do you need assistance, guidance, and someone to talk to during your own awakening? Sign up for a free consult and I\u0027d be more than happy to work with you. 1:1 Sessions — Live. Like. Eden. (livelikeeden.com) Subscribe for Podcast email reminders. https://www.livelikeeden.com/subscribe Read My Personal Journey https://www.livelikeeden.com/my-story Follow LIVE LIKE EDEN on Instagram! https://www.instagram.com/live.like.eden/ RATE AND REVIEW I invite you to write a review on Apple Podcasts. Share your insights with others about your own takeaways from any episode! This not only helps support the show, but it helps support all the people needing more information, assistance, and understanding during the awakening process.",
      "release": "2025-02-12T10:00:00Z",
      "duration": "00:53:36.3520000",
      "explicit": false,
      "spotifyId": "1ZcqVAfUyJNooiBvyaJfDw",
      "appleId": 1000691368448,
      "youTubeId": "WRUPuSe7kOM",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ZcqVAfUyJNooiBvyaJfDw",
        "apple": "https://podcasts.apple.com/podcast/healing-from-religious-cults-and-abusive/id1660060852?i=1000691368448",
        "youtube": "https://www.youtube.com/watch?v=WRUPuSe7kOM"
      }
    }
  ]
}