{
  "_ts": 0,
  "id": "128ed728-6b6f-4a55-8f63-3078ec2b0793",
  "name": "Live, Laugh, Lies",
  "spotifyId": "2kaqYZyWpGGVzHyziRCPRB",
  "appleId": 1754604859,
  "youTubeChannelId": "UCoGuQgZw3SvDaLYtlckP3vA",
  "episodes": [
    {
      "id": "a6c53b0a-32cb-4652-907d-5b309155acdc",
      "title": "Why People Fell for The Twin Flames Universe with Investigator Slater",
      "description": "What do you get when you mix love bombing, manipulation, and a soulmate sales pitch? In this episode of Live, Laugh, Lies, Susie teams up with true crime queen and Psychopedia co-host Brooke Slater to unpack the chaos behind the Twin Flames cult—yep, the same one that blew up on Netflix. Brooke brings her background in criminology and experience as an investigator to help us break down how this so-called love story spiralled into full-blown cult territory. From delusion to danger, we’re talking about the dark side of obsession—and why so many people got caught in the trap. More Brooke! https://www.instagram.com/investigatorslater/?hl=en https://podcasts.apple.com/ca/podcast/psychopedia/id1677222172 Live, Laugh, Like and follow your host on Instagram @susiecevans , the podcast @livelaughliespodcast and subscribe to our YouTube at youtube.com/@LiveLaughLiespodcast Submit your lies and juiciest stories via our voicemail at https://www.speakpipe.com/LiveLaughLiesVoicemail or email us at livelaughliespodcast@gmail.com Thank you to our incredible sponsor! L-Nutra: Prolon is offering Live, Laugh, Lies listeners 15% off sitewide plus a $40 bonus gift when you subscribe to their 5-Day Program! Just visit ProlonLife.com/LIVELAUGHLIES Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-04-09T10:00:00Z",
      "duration": "00:58:52.7470000",
      "explicit": false,
      "spotifyId": "2iynQUINSmYSeTYvYBG9fJ",
      "appleId": 1000702848228,
      "subjects": [
        "Twin Flames Universe"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2iynQUINSmYSeTYvYBG9fJ",
        "apple": "https://podcasts.apple.com/podcast/why-people-fell-for-the-twin-flames-universe/id1754604859?i=1000702848228"
      }
    },
    {
      "id": "9c1aad32-a8c7-4dee-a7a3-634be127d728",
      "title": "How I Escaped a Cult (India Oxenberg’s NXIVM Story)",
      "description": "Trigger Warning: Sexual abuse and suicidal ideation What would you do if everything you believed in turned out to be a lie? This week, Susie sits down with India Oxenberg to share her harrowing experience in the NXIVM cult, a so-called self-help group led by convicted leader Keith Raniere. India opens up about being lured into the group at 19, the manipulation and abuse she endured, and the red flags she missed along the way. She also reflects on the strength it took to escape, rebuild her life, and repair her relationship with her mother, Catherine Oxenberg, whose determination helped expose the cult. India\u0027s story isn’t just one of survival—it’s about reclaiming her voice, finding purpose in her pain, and helping others recognize the lies that can trap them. This compelling conversation is a powerful reminder of the strength it takes to rebuild after betrayal. Don’t miss it. Be sure to keep up with India on Instagram and grab a copy of her book here LA Wildfire Relief: Los Angeles Fire Foundation Baby2Baby Pasadena Humane Society World Central Kitchen LAUSD Education Foundation Emergency Relief WatchDuty App Thank you to our incredible sponsors! Zocdoc: Go to zocdoc.com/LIVELAUGHLIES to find and instantly book a top-rated doctor today. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-15T11:00:00Z",
      "duration": "00:53:15.2190000",
      "explicit": false,
      "spotifyId": "4yHOf6LOHAwfwYwNURq8lB",
      "appleId": 1000684071423,
      "youTubeId": "7CxWBEbDey8",
      "subjects": [
        "NXIVM",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4yHOf6LOHAwfwYwNURq8lB",
        "apple": "https://podcasts.apple.com/podcast/how-i-escaped-a-cult-india-oxenbergs-nxivm-story/id1754604859?i=1000684071423",
        "youtube": "https://www.youtube.com/watch?v=7CxWBEbDey8"
      }
    },
    {
      "id": "6421563a-db5d-459c-88c8-8ff3227bdb47",
      "title": "The Secret LIES of Mormon Wives (Mayci Neeley’s Story)",
      "description": "Hulu’s new series, The Secret Lives of Mormon Wives, has broken the internet after its controversial premiere last week. Mayci Neely joins us to open up about her experiences within the #MomTok group, from the initial nervousness to the unexpected controversies that emerged. Susie gives Mayci the floor to discuss the dynamics of being a Mormon in Salt Lake City, the intricacies of the Church of Jesus Christ of Latter-Day Saints, and the stereotypes associated with it. \n\nThey discuss the reality behind the \u0027Secret Lives of Mormon Wives,\u0027 the viral success of Macy\u0027s social media posts, and the breakdown of personal boundaries and relationships within the #MomTok group. Of course, the two of them touch on the swinger scandal that rocked the internet and the ensuing personal journey Mayci went through, revealing her ambitions of providing for her family, starting a business, and possibly penning a book. (We’d fully support that!)  \n\nFull of candid moments, heartfelt advice, and juicy confessions from Sinner Sundays, this episode gives a behind-the-scenes look at the life and challenges of a modern Mormon influencer.  \n\nLive, Laugh, Like \u0026 Follow:\nhttps://www.instagram.com/maycineeley/\nhttps://www.instagram.com/susiecevans/\nhttps://www.instagram.com/livelaughliespodcast/\n \nGo check out Baby Mama: https://www.babymama.co/  \nhttps://www.instagram.com/babymama.co/ \n\nSubmit your lies and juiciest stories at https://www.speakpipe.com/LiveLaughLiesVoicemail or livelaughliespodcast@gmail.com.  \n\nThank you to our awesome sponsors for supporting this episode:  \nCookUnity: Go to https://cookunity.com/LIVELAUGHLIES or enter code LIVELAUGHLIES before checkout for 50% off your first week.\nFungies: Go to https://eatfungies.com and use code LIVELAUGHLIES for shipping and 20% off.\nVIIA: Try VIIA Hemp! Use code LIVELAUGHLIES at checkout.  \n\n---- \n\nLive, Laugh, Lies is an original series fully produced and managed by @podcast.nation  \nhttps://www.podcastnation.co/ \nhttps://www.instagram.com/podcast.nation/ \nhttps://www.tiktok.com/@podcast.nation \n\nSyncID: MB01JSQPKKQL2IX",
      "release": "2024-09-11T09:00:57Z",
      "duration": "00:54:05",
      "explicit": false,
      "spotifyId": "6ITbHCLTTjdFTys5pcqvyt",
      "appleId": 1000669132239,
      "youTubeId": "x4OOZELG2ak",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ITbHCLTTjdFTys5pcqvyt",
        "apple": "https://podcasts.apple.com/podcast/the-secret-lies-of-mormon-wives-mayci-neeleys-story/id1754604859?i=1000669132239",
        "youtube": "https://www.youtube.com/watch?v=x4OOZELG2ak"
      }
    }
  ]
}