{
  "id": "4914d43b-daf9-4f8d-8f45-aa9e88070751",
  "name": "Living Truth",
  "youTubeChannelId": "UCQfErQtRcqbaO10HteIv2ow",
  "episodes": [
    {
      "id": "f9c443b5-3928-4660-bb08-1d7c0872725e",
      "title": "Leah Remini: The Jehovah’s Witnesses - A\u0026E Special",
      "description": "#leahremini #exjw #jehovahswitnesses\n\nFirst off, thank you to Leah Remini for doing this documentary.  And big thanks and hugs to all the ex-JW’s that were on the A\u0026E Special, and for openly sharing their experiences and stories. \n\nIn this video, I share my thoughts about the show, triggers, and other stuff that came up. Regardless of how long you’ve been out of the JW Organization, (ExJW; DF’d; or just have JW family), there will be things from this Special that will stir up emotions, on various levels. \nBe mindful of this, and take care of yourselves. x\n\nFor people that are considering joining, leaving, or studying with Jehovah\u0027s Witnesses, please watch the A\u0026E program. It is an honest look at real-life experiences of what happens in this Organization. \n\n———————\nIf you missed the A\u0026E special that aired last night, (Nov 13/18), \u0022Leah Remini - The Jehovah\u0027s Witnesses\u0022... and don\u0027t have access to A\u0026E, or have a cable service provider that let’s you stream it, here\u0027s a workaround I found…\n\nDownload the A\u0026E app on your phone. \nSign up with a new account, and you’ll get 3 credits to watch 3 programs, one of which you can choose this Special. \nHope that works for any of you that are looking for it! \n:)  \n\nUPDATE: Here\u0027s a link that was shared with me for those that are able to view it... https://www.dailymotion.com/video/x6x5upe\n-------------------\n\nAbout sharing stories and experiences - \n\nI love this quote by Iyanla Vanzant: \n\u0022It\u0027s important that we share our experiences with others. Your story will heal you and your story will heal somebody else. When you tell your story, you free yourself and give other people permission to acknowledge their own story.\u0022 \n\n--------------------\n\nPLEASE NOTE: If you are only here to troll, preach, or be disrepectful, your comments will be deleted. \n\nThis channel is meant to be a positive, respectful and welcoming space/community for people that are going through similar experiences from their association of the JW.Org . Especially those of you that have been disfellowshipped or shunned from your friends and family, know that you aren\u0027t alone. Thanks for being here.  :)",
      "release": "2018-11-15T00:33:43Z",
      "duration": "00:12:56",
      "explicit": false,
      "youTubeId": "iptEh7l6Bec",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Scientology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=iptEh7l6Bec"
      }
    }
  ]
}