{
  "_ts": 0,
  "id": "e5f6be38-7c74-4089-94de-815d3961f759",
  "name": "Living Lchaim",
  "youTubeChannelId": "UCJHk7NZyFnyphA_jfdK5rvA",
  "episodes": [
    {
      "id": "4b63f653-10cb-4ff4-be88-62287c7987ac",
      "title": "Exposing The Extremist \u0022Jewish\u0022 Cult Lev Tahor",
      "description": "Mendy Levy was born in 2003 in Canada to parents who were members of Lev Tahor, an extremist Jewish cult founded in the 1980s. Shunned by members of other Jewish groups and facing a kidnapping scandal, its leader Shlomo Helbrans had moved Lev Tahor to Canada in the 1990s. Helbrans then moved the group to Guatemala in 2014, in the wake of child abuse investigations in Quebec.\n\nLevy escaped the group in 2018 and now splits his time between Canada and New York. Shlomo Helbrans drowned in Guatemala in 2017. US authorities arrested his son, Nachman Helbrans, and other Lev Tahor leaders in late 2018 and 2021. They\u0027re currently on trial in federal court in New York on kidnapping and fraud charges, to which they\u0027ve pleaded not guilty.\n\nThe remainder of Lev Tahor, which numbers an estimated 300 people, continues to live in Guatemala and has been unsuccessfully trying to move to Iran.\n\nCheck \u0026 support Mendy\u0027s awesome photography work here: https://www.instagram.com/mendy_levy_photography/?hl=en\n\n____________________________________\n✬ SPONSOR OF THIS EPISODE ✬\n____________________________________\n► The Book Every Parent Needs!\n\nFinally! A book that integrates the Torah’s wisdom and cutting-edge psychological research to provide a comprehensive approach to educating and supporting our sons and students regarding health and safety, puberty, marital intimacy, and today’s challenges to kedushah.\n\nThrough kind and generous donors, you can get this book for just an $18 donation towards Living Lchaim (this includes free shipping!)\n\n► GET YOUR BOOK HERE: https://www.livinglchaim.com/drz\n____________________________________\n► New Yiddish Podcast!\n\nShmueliCast is a fun \u0026 vibrant podcast for fun \u0026 vibrant people by a fun \u0026 vibrant person. Cool guests, gripping stories, and if you’re still reading this, great, because it’s important to care about all the little stuff, and not just focus on the big. Here’s to you. Here’s to ShmueliCast.\n\n► WATCH HERE https://www.youtube.com/@ShmueliCast\nLISTEN HERE: https://podcasts.apple.com/us/podcast/shmuelicast/id1693139726\nSpotify: https://open.spotify.com/show/57sZtsNpZcjijVySx5qHfW\n\n____________________________________\n\nLIVING LCHAIM WHATSAPP GROUP\nGet exclusive insider sneak peeks to upcoming episodes in our Living Lchaim group: https://bit.ly/44sjUIO\n\nThis episode is in memory of:\n• Shimon Dovid ben Yaakov Shloima \n• Miriam Sarah bas Yaakov Moshe\n\nHelp Support our Episodes with Dedicating an Episode in Memory of a Loved One or As a Zechus for a Refuah Shleima!\n\n► Here: https://www.livinglchaim.com/in-memory\n\n✬ Donate and Inspire Millions (Tax-Deductible) ✬ \nYour generous donation enables us at Living Lchaim to share uplifting messages globally, enrich lives, and foster positive change worldwide! \nThank you! 🙏 ➡️ https://www.livinglchaim.com/donate\n\n____________________________________\n\nFollow us on social media for more content:\n• TikTok - https://www.tiktok.com/@livinglchaim\n• IG - https://www.instagram.com/livinglchaim/\n• FB - https://www.facebook.com/livinglchaim\n• LinkedIn - https://www.linkedin.com/company/living-lchaim\n• Website - https://www.livinglchaim.com/\n\nOur free call-in-to-listen feature is here:\n• USA: (605) 477-2100\n• UK: 0333-366-0154\n• ISRAEL: 079-579-5088\n\nHave a specific question? email us hi@livinglchaim.com\n\nWhatsApp us feedback and get first access to episodes: 914-222-5513\n\nLchaim.\n\n#jewishpodcast #cult #levtahor #escape",
      "release": "2023-07-09T01:35:00Z",
      "duration": "00:45:17",
      "explicit": false,
      "youTubeId": "lpZDP9E3ysc",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=lpZDP9E3ysc"
      }
    }
  ]
}