{
  "_ts": 0,
  "id": "af970d15-a12e-419e-bba1-d977486b3ccd",
  "name": "Living Cult Free: The Podcast",
  "spotifyId": "0zaPvF356GdsZxSSDEGM2W",
  "appleId": 1585674758,
  "episodes": [
    {
      "id": "d70f6d5f-dc3a-4a5a-8625-f7c3742319ba",
      "title": "S3:  Breaking Free: Mariama’s Journey of Healing and Self Discovery",
      "description": "In this powerful episode, Mariama shares her deeply personal journey of growing up in a high-control religious group. She reflects on her upbringing, the constraints on personal expression, and the challenges of finding her identity while under constant scrutiny. Mariama opens up about the pivotal moments that led her to question the group\u0027s teachings, the emotional toll of leaving, and the courage it took to reclaim her life. Her candid storytelling highlights themes of self-discovery, healing, and resilience, offering hope and insight to those on similar paths. Trigger Warning: Due to these episodes containing stories that involve cults and other types of coercive control that may be disturbing to some, listener discretion is advised. This episode contains mentions of child sexual abuse and suicidal ideation. You can find Living Cult Free on social media, especially on Instagram, at living_cult_free Our website is livingcultfree.com where the mission is to support the creative expression of survivor stories and empower advocacy through education. At the website above, you can: Contact us to share your story Meet who runs and collaborates with Living Cult Free Make a donation to help further Living Cult Free’s mission Thank you for your support! ©2024 Living Cult Free Intro \u0026 outro by Jon Snow; Original Music by Esther Friedman Editing and production by Vanessa Hennessey Huge thanks to Living Cult Free’s intern, Nikki Kattamuri, and the Living Cult Free Board of Directors; as well as Erica A. Slauson for her help with transcription. Music and sound by: Ashot Danielyan, BRVAN, Clavier Clavier, Dvir Silver, Emmraan, John Britton, Sergii Pavkin, Valentin Iakovlev. All music found on Pixabay. The views, thoughts, and opinions expressed are the speaker’s own and do not represent the views, thoughts, and opinions of Living Cult Free. The material and information presented here is for general information purposes only. The Living Cult Free name and all forms and abbreviations are the property of its owner and its use does not imply endorsement of or opposition to any specific organization, product, or service.",
      "release": "2025-01-20T16:00:00Z",
      "duration": "00:53:45.4170000",
      "explicit": true,
      "spotifyId": "5MN3qQlYdzp9aESZa3g1Oe",
      "appleId": 1000684720014,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5MN3qQlYdzp9aESZa3g1Oe",
        "apple": "https://podcasts.apple.com/podcast/s3-breaking-free-mariamas-journey-of-healing-and/id1585674758?i=1000684720014"
      }
    },
    {
      "id": "069d1f7f-592a-4fab-a77a-d1f68cd4f22a",
      "title": "S3: A Mother’s Journey: From Control to Freedom",
      "description": "Karina reflects on how her challenging childhood created a deep yearning for connection and stability and how she and her husband sought belonging. They turned to a messianic congregation that combined Jewish traditions with Christianity. The pressure to conform grew, as the group insisted on rigid adherence to its rules and practices about child rearing - and all aspects of church life. Over time, she began to critically examine the congregation’s culture of silence, where addressing personal struggles or differing views was discouraged and seen as gossip. Things came to a crisis after the church responded with harsh judgment to the needs of her family, prompting Karina\u0027s profound realization about the importance of protecting her family, embracing her true self and cultivating authenticity. Shownotes: Trigger Warning: Due to these episodes containing stories that involve cults and other types of coercive control that may be disturbing to some, listener discretion is advised. Mentioned in the episode: The International Cultic Studies Association (link: https://www.icsahome.com/) You can find Living Cult Free on social media, especially on Instagram, at living_cult_free Our website is livingcultfree.com where the mission is to support the creative expression of survivor stories and empower advocacy through education. At the website above, you can: Contact us to share your story Meet who runs and collaborates with Living Cult Free Make a donation to help further Living Cult Free’s mission Thank you for your support! ©2024 Living Cult Free Intro \u0026 outro by Jon Snow; Original Music by Esther Friedman Editing and production by Vanessa Hennessey Huge thanks to Living Cult Free’s intern, Nikki Kattamuri, and the Living Cult Free Board of Directors Music and sound by: Alex Grohl, Calvin Clavier, Denys Kyshchuk, Dream-Protocol, Grand_Project, Josef Surikov, Juan Sanchez, Julius H, Serge Pavkin, UNIVERSFIELD, Vasileios Ziogas, Yevhen Shtakal. All music found on Pixabay. The views, thoughts, and opinions expressed are the speaker’s own and do not represent the views, thoughts, and opinions of Living Cult Free. The material and information presented here is for general information purposes only. The Living Cult Free name and all forms and abbreviations are the property of its owner and its use does not imply endorsement of or opposition to any specific organization, product, or service.",
      "release": "2024-11-11T18:00:00Z",
      "duration": "00:56:23.3790000",
      "explicit": true,
      "spotifyId": "10FoVGydJiSRqdBmKuBfbn",
      "appleId": 1000676531513,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/10FoVGydJiSRqdBmKuBfbn",
        "apple": "https://podcasts.apple.com/podcast/s3-a-mothers-journey-from-control-to-freedom/id1585674758?i=1000676531513"
      }
    },
    {
      "id": "2ef7c3fa-e7d9-4d72-9b03-1f8c4b5264ed",
      "title": "S3: Finding Home: Elad\u0027s Journey Into and Out of Hasidic Judaism",
      "description": "Elad shares how he grew up a secular Jew with Israeli parents and went on a spiritual journey, seeking meaning and community. This led him to a Hasidic community where he found “beauty, truth and beautifully true people.” Over time, though, he realized that ongoing acceptance within this religious family required a “total sublimation of my selfhood.” He describes the painful journey into a spiritual home, through disillusionment and, finally, walking away from the beliefs, people and places that had been his home to return to his authentic self. Note: 2 years have passed since this interview with Elad was first recorded. Naturally, Elad\u0027s views and writings have evolved since then. This episode begins with Elad reading from his piece, \u0022I Sold My Soul,\u0022 published on his Substack newsletter. Find Elad on Instagram at https://www.instagram.com/EladNehorai/ and On Substack https://eladnehorai.substack.com/ Trigger Warning: Explicit mentions of sex and death threats. In addition, due to these episodes containing stories that involve cults and other types of coercive control that may be disturbing to some, listener discretion is advised. You can find Living Cult Free on social media, especially on Instagram, at living_cult_free Our website is livingcultfree.com where the mission is to support the creative expression of survivor stories and empower advocacy through education. At the website above, you can: Contact us to share your story Meet who runs and collaborates with Living Cult Free Make a donation to help further Living Cult Free’s mission Thank you for your support! ©2024 Living Cult Free Intro \u0026 outro by Jon Snow; Original Music by Esther Friedman Editing and production by Vanessa Hennessey Huge thanks to Living Cult Free’s intern, Nikki Kattamuri, the Living Cult Free Board of Directors, and Erica A. Slauson for help with transcriptions. Music and sound by: Ashot Danielyan, Jerome Chauvel, Fae Spencer, UNIVERSFIELD, Sergei Chetvertnykh, Piano Amor, ArctSound, and Sergii Pavkin The views, thoughts, and opinions expressed are the speaker’s own and do not represent the views, thoughts, and opinions of Living Cult Free. The material and information presented here is for general information purposes only. Please keep in mind that each episode is recorded long before it is shared live and the views and perspective of the storyteller may have changed. The Living Cult Free name and all forms and abbreviations are the property of its owner and its use does not imply endorsement of or opposition to any specific organization, product, or service.",
      "release": "2024-10-07T04:00:00Z",
      "duration": "00:46:35.9370000",
      "explicit": true,
      "spotifyId": "5pytTJTLMkf0SvTDITbpPe",
      "appleId": 1000672010143,
      "subjects": [
        "Hasidic Judaism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5pytTJTLMkf0SvTDITbpPe",
        "apple": "https://podcasts.apple.com/podcast/s3-finding-home-elads-journey-into-and-out-of/id1585674758?i=1000672010143"
      }
    },
    {
      "id": "48f3fb42-3845-43b2-954b-a485441fc9f5",
      "title": "S3: Rebecca’s Story: The Profound Impact of Religious Cults on Personal Identities",
      "description": "Rebecca’s story transcends individual experience to illuminate universal themes of resilience, identity, and healing. It underscores the power of community, self-discovery, and the ongoing process of healing from psychological and emotional wounds inflicted by cults and similar restrictive groups while celebrating the courage and strength required to break free and reclaim one’s authentic self. Listen as Rebecca describes accepting and flourishing in her queer and polyamorous identity, and how grounding herself in those communities has allowed her to thrive. TW: Due to these episodes containing stories that involve cults and other types of coercive control that may be disturbing to some, listener discretion is advised. Find Rebecca on Instagram @mightybrecca You can find Living Cult Free on social media, especially on Instagram, at living_cult_free Our website is livingcultfree.com where the mission is to support the creative expression of survivor stories and empower advocacy through education. At the website above, you can: Contact us to share your story Meet who runs and collaborates with Living Cult Free Make a donation to help further Living Cult Free’s mission Thank you for your support! ©2024 Living Cult Free Intro \u0026 outro by Gerette Buglion; Original Music by Esther Friedman Editing and production by Vanessa Hennessey Huge thanks to Living Cult Free’s intern, Nikki Kattamuri, the Living Cult Free Board of Directors, and Erica A. Slauson for help with transcriptions. Music and sound by: Ashot Danielyan, PianoAmor, Sergii Pavkin, SoundGalleryBy. All music found on Pixabay and used under Pixabay Content License. Sound effects: Public domain. The views, thoughts, and opinions expressed are the speaker’s own and do not represent the views, thoughts, and opinions of Living Cult Free. The material and information presented here is for general information purposes only. The Living Cult Free name and all forms and abbreviations are the property of its owner and its use does not imply endorsement of or opposition to any specific organization, product, or service.",
      "release": "2024-08-05T04:00:00Z",
      "duration": "00:34:13.9550000",
      "explicit": true,
      "spotifyId": "67hxEXpAOam4AzDIcTH1oI",
      "appleId": 1000664323851,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/67hxEXpAOam4AzDIcTH1oI",
        "apple": "https://podcasts.apple.com/podcast/s3-rebeccas-story-the-profound-impact-of-religious/id1585674758?i=1000664323851"
      }
    },
    {
      "id": "64e4a92d-37c1-496a-84e9-45dee757a99a",
      "title": "S3: Ciara’s Story: Is it a Sin to Talk About It?",
      "description": "Grappling with existential questions about the origins of her thoughts, the influence of external forces on her autonomy, and her experiences within a religious cult, Ciara reflects on themes of control, deception, and the struggle for personal identity and freedom within a structured belief system. Listen to find out how Ciara finds bursts of inspiration often fueled by a sense of urgency or emotional resonance throughout her daily life. Find Ciara on Instagram You can find Living Cult Free on social media, especially on Instagram, at living_cult_free Our website is livingcultfree.com where the mission is to support the creative expression of survivor stories and empower advocacy through education. At the website above, you can: Contact us to share your story Meet who runs and collaborates with Living Cult Free Make a donation to help further Living Cult Free’s mission Thank you for your support! ©2024 Living Cult Free Intro \u0026 outro by Gerette Buglion; Original Music by Esther Friedman Editing and production by Vanessa Hennessey Huge thanks to Living Cult Free’s intern, Nikki Kattamuri, the Living Cult Free Board of Directors, and Erica A. Slauson for help with transcriptions. Music and sound by: Aleksey Chistilin, Alex Grohl, Ashot Danielyan, Daniel Hourtoulle, Geoff Harvey, Joe, Luca Francini, Maksym Dudchyk, Pixabay, UNIVERSFIELD. All music found on Pixabay and used under Pixabay Content License. The views, thoughts, and opinions expressed are the speaker’s own and do not represent the views, thoughts, and opinions of Living Cult Free. The material and information presented here is for general information purposes only. The Living Cult Free name and all forms and abbreviations are the property of its owner and its use does not imply endorsement of or opposition to any specific organization, product, or service.",
      "release": "2024-07-01T04:00:00Z",
      "duration": "01:00:04.5320000",
      "explicit": true,
      "spotifyId": "24HF32DuHKItvBnMazI5W1",
      "appleId": 1000660750575,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/24HF32DuHKItvBnMazI5W1",
        "apple": "https://podcasts.apple.com/podcast/s3-ciaras-story-is-it-a-sin-to-talk-about-it/id1585674758?i=1000660750575"
      }
    },
    {
      "id": "8915d658-4211-4b7f-a47c-bfbee600f68a",
      "title": "S2: STRATEGIES - Get Out or Help Someone You Love Get Out",
      "description": "Today we explore strategies you can use to get out of a cult or help a loved one get out. To setup the framework for our discussion, we look at numbers and definitions. The numbers are huge. Up to 10,000 cults still exist today in the United States. That number is growing. “Millions of people have been affected by undue influence. Many of us have had religions chosen for us or we’ve joined self-help or spiritual groups that became harmful or destructive. We have suffered from coercive control and mind manipulations while bending to narcissists. We’ve given our power of decision making over to an organization and their leadership.” And language matters. The way we talk about cultic abuse influences how our good intentions are received. Someone who might shy away from what Gerette calls the C-word (cult), could respond better to “Controlling Group,” or “High Demand Group,” or “Spiritual Abuse.” We discuss Dr. Hassan’s “reality testing,” and Gerette’s escape after 18 years from the Center for Transformational Learning and the strategies that worked for her. We also talk about strategies we can employ when helping others who might be embroiled in a controlling group. If you have been in ANY culty high-control group or religion, you are invited to connect with us through livingcultfree.com. To Learn more about Writing to Reckon, visit www.gerettebuglion.com/writingtoreckon. Learn more about the signs of thought control and other aspects of Dr. Hassan\u0027s work by visiting www.freedomofmind.com.",
      "release": "2021-11-11T15:00:00Z",
      "duration": "00:44:32.5440000",
      "explicit": false,
      "spotifyId": "5chjrxlwIHbY6yup7lsTZ6",
      "appleId": 1000541510472,
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Center For Transformational Learning"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5chjrxlwIHbY6yup7lsTZ6",
        "apple": "https://podcasts.apple.com/podcast/s2-strategies-get-out-or-help-someone-you-love-get-out/id1585674758?i=1000541510472"
      }
    },
    {
      "id": "b0110d95-6484-4e32-8023-b0fdf05ced87",
      "title": "S2: EMOTION CONTROL - Emotional Backfire",
      "description": "The subject of today’s podcast is Emotion Control. Like it or not, as human beings, we creatures tend to respond emotionally. Comfort, praise, recognition, and a sense of belonging are among our top stimuli. Our yearning for these is manna from heaven to cult leaders. They prey upon exactly this type of vulnerability. They lure us in under the veil of comfort and specialness and then set up an “us” versus “them” dichotomy. While under cultic influence, Dr. Hassan was told that the Moonies were his true family, all others were false – even evil. Vaxxers versus Anti-vaxxers is a similar kind of fault line. Today we discuss the ways cult leaders disrupt the normal right brain/left brain integration necessary to make rational decisions. By sidestepping reason, cult leaders foment fear and self-doubt. We also explore phobia Indoctrination, the Christian persecution complex, and FreedomofMind.Org’s itemized list of methods cult leaders use to control their followers. If you have been in ANY culty high-control group or religion, we invite you to reach out to us through livingcultfree.com. Learn more about the signs of thought control and other aspects of Dr. Hassan\u0027s work by visiting freedomofmind.com.",
      "release": "2021-11-05T02:00:00Z",
      "duration": "00:37:44.8230000",
      "explicit": false,
      "spotifyId": "5AQYykyHI8GDXecZIRHfe0",
      "appleId": 1000540835716,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5AQYykyHI8GDXecZIRHfe0",
        "apple": "https://podcasts.apple.com/podcast/s2-emotion-control-emotional-backfire/id1585674758?i=1000540835716"
      }
    },
    {
      "id": "fe645463-c0ff-4806-8aba-4ff5474fa972",
      "title": "S2: THOUGHT CONTROL - They Co-Opted my Brain!",
      "description": "As smart, functioning adults, we like to think that we are in control of our own thoughts. This is not always the case. As we know from Gerette’s book An Everyday Cult and from this podcast, we know that destructive cults use any number of techniques to get members to stay and commit themselves to what may be harmful activities. Thought Control is the most insidious. Listen in as we discuss the different techniques cult leaders use to control the thoughts of their followers. Some techniques are extreme, others are subtle but insidious... If you have been in ANY culty high-control group or religion we invite you to connect with us through livingcultfree.com. Learn more about the signs of thought control and other aspects of Dr. Hassan\u0027s BITE Model visit freedomofmind.com or freedomofmind.com/cult-mind-control/bite-model.",
      "release": "2021-10-29T18:00:00Z",
      "duration": "00:37:32.1890000",
      "explicit": false,
      "spotifyId": "08db9ouOi1Zn0wkCUuiHcx",
      "appleId": 1000540164209,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/08db9ouOi1Zn0wkCUuiHcx",
        "apple": "https://podcasts.apple.com/podcast/s2-thought-control-they-co-opted-my-brain/id1585674758?i=1000540164209"
      }
    },
    {
      "id": "14074e73-db48-488f-9fb9-3c079d429426",
      "title": "S2: INFORMATION CONTROL - Standing up to Scrutiny",
      "description": "Controlling information is a critical way authoritarian leaders and cult leaders control the hearts and minds of their followers. This week we discuss how they do it and how you can take some agency regarding the information you consume. Dr. Hassan suggests that we must each do independent research, that we must ask difficult questions, and really dig beyond the cult-controlled internet algorithms to challenge our own beliefs. Gerette describes her experience within CTL, whose leaders subtly controlled information by dominating cult members’ free time. She sheds some light on the difference between information control in an Everyday Cult versus that in more controlling cults. We talk about personal truths, political truths, and objective truths. And how ambiguity tolerance—allowing for the possibility of another person’s personal truth to coexist with one’s own—can open the door to a more objective reality. If you have been in ANY culty high-control group or religion we invite you to connect with us through livingcultfree.com.",
      "release": "2021-10-21T12:00:00Z",
      "duration": "00:34:24.8080000",
      "explicit": false,
      "spotifyId": "6YQGk2NVDXZPm8EKv7i3AZ",
      "appleId": 1000539286081,
      "subjects": [
        "Center For Transformational Learning"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YQGk2NVDXZPm8EKv7i3AZ",
        "apple": "https://podcasts.apple.com/podcast/s2-information-control-standing-up-to-scrutiny/id1585674758?i=1000539286081"
      }
    },
    {
      "id": "a5a10527-1078-4233-ba75-ea91c94880f4",
      "title": "S2: BEHAVIOR- Love is Stronger Than Mind Control",
      "description": "Our focus today is Behavior Control, the first methodology in the BITE model, which refers to control of Behavior, Information, Thought, and Emotion. Dr. Hassan developed BITE as a model for evaluating degrees undue influence. As functioning adults, we like to think that we are in control of our own behavior. Last week’s conversation about Influence leads us to reexamine that possibility. In this episode, we discuss how we become vulnerable to behavior control, types of behavior control, and how our environment shapes our behavior. Vulnerability to influence is part of the human condition. Dr. Hassan suggests that we are susceptible to behavior control from the moment we are born. Using healthy cynicism, curiosity, and discernment, we can begin to understand exactly who or what is control of our behavior. In the end, love is stronger than mind control. If you have been in ANY culty high-control group or religion, we\u0027d love to connect with you. Please check out our website, follow us on social media and send us an email if you would like to consider having YOUR story shared on this podcast. livingcultfree.com.",
      "release": "2021-10-15T12:00:00Z",
      "duration": "00:40:41.5700000",
      "explicit": false,
      "spotifyId": "3wJvjDTSfJOQDjE7pnc31h",
      "appleId": 1000538687990,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3wJvjDTSfJOQDjE7pnc31h",
        "apple": "https://podcasts.apple.com/podcast/s2-behavior-love-is-stronger-than-mind-control/id1585674758?i=1000538687990"
      }
    },
    {
      "id": "9a98303a-7a36-4dc4-924d-1658e45adf6e",
      "title": "S2: INFLUENCE - from mild to extreme and everything in between",
      "description": "Can understanding the nature of influence support people in cult recovery? Dr. Steve Hassan, former cult member, author, educator, and world authority on cults will be our honored guest throughout this season . His published works include: The Cult of Trump: A Leading Cult Expert Explains How the President Uses Mind Control, Combating Cult Mind Control: The Guide to Protection, Rescue and Recovery from Destructive Cults, Freedom of Mind: Helping Loved Ones Leave Controlling People, Cults, and Beliefs. Today we are going to discuss his dissertation published January 2021: “The BITE Model of Authoritarian Control: Undue Influence, Thought Reform, Brainwashing, Mind Control, Trafficking and the Law.” Our focus today is the BITE model, which refers to Behavior-Information-Thought-Emotion control. Dr. Hassan developed BITE as a model for evaluating degrees undue influence. Gerette references the book Influence: Science and Practice by Robert Cialdini. Steven Hassan, PhD is a mental health professional and expert in undue influence tactics used by authoritarian leaders and destructive cults. His foundational online course is “Understand Cults: The Basics.” He is the Founding Director of the Freedom of Mind Resource Center , which provides training, consulting and support to individuals who are struggling to leave or recover from a cult and to families and organizations that are concerned about cult behaviors. He also is the founder of Freedom From Undue Influence , a not-for-profit entity with the purpose of conducting and publishing the research on undue influence that is needed to update legal and social policies. He developed the BITE Model of Authoritarian Control to identify control tactics and the Influence Continuum Model to discern ethical from unethical influence. He developed the Strategic Interactive Approach (SIA), as an effective and legal intervention alternative for families to help cult members. Dr. Hassan believes that access to the truth, freedom of thought, and freedom from undue influence are basic human rights. A complex systems approach, based in science and supported by the rule of law , is necessary to protect these rights. He is a member of the Program in Psychiatry and the Law at the Massachusetts Mental Health Center, a teaching hospital of Harvard Medical School. He is an experienced educator having served as an instructor for the Harvard Law School Trial Advocacy Workshop, as an elective teacher and a presenter for the Harvard Longwood Psychiatry Residency Training Program, and in other educational and training capacities for other higher education, professional, law enforcement, governmental, non-governmental and advocacy group audiences. Dr. Hassan began helping people affected by undue influence after he was deprogrammed from the Moon cult in 1976 at age 22. His 45 plus years of experience give him a unique perspective on the damaging effects of undue influence and exploitation by destructive cults. He is a frequently requested speaker and media interviewee . Dr. Hassan holds a Master’s Degree in Counseling Psychology from Cambridge College and a Doctorate in Organizational Development and Change from Fielding Graduate University School of Leadership Studies. Visit freedomofmind.com to access information and services . If you hav",
      "release": "2021-10-09T02:00:00Z",
      "duration": "00:41:51.1380000",
      "explicit": false,
      "spotifyId": "54OX3T4RwwvGQ0Q6gUyvn8",
      "appleId": 1000538028957,
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Human Trafficking",
        "Psychology",
        "Qanon",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/54OX3T4RwwvGQ0Q6gUyvn8",
        "apple": "https://podcasts.apple.com/podcast/s2-influence-from-mild-to-extreme-and-everything-in-between/id1585674758?i=1000538028957"
      }
    },
    {
      "id": "bbf2e7f9-3c11-409b-9368-cb816716fe9b",
      "title": "S1: Everyday Cults. Everyday People. Episode Six: Waking Up Again and Again",
      "description": "We explore what Gerette has identified in her book as the final stage of cultic involvement: Waking Up Again and Again. In this ongoing phase, one becomes fully aware of the reality of cultism. Awake, cult survivors remain ever watchful for the potential for harmful power dynamics that play out in the world or in themselves. Waking Up Again and Again is the effort required to be a conscious, conscientious, human being. In this episode on post-cult life, we discuss the human need to be part of a group, cult-hopping, self-care, the importance of recognizing one’s own vulnerability, and how to be an ally. Tune in for frank talk about everyday cults and how they can endanger everyday people like you and me. Views and opinions expressed in this podcast are those of Gerette Buglion arising from her personal 18-year cultic involvement and from her subsequent work in cult recovery and education. We are deeply grateful to Moon Panda for the use of their song \u0022Slow Drive.\u0022 Yes, Everyday Cults. Everyday People is a kind of slow cruise around the cult world, taking in the varied landscapes. Let us know what you liked and where you\u0027d like to head for Season Two. Contact Gerette through her website GeretteBuglion.com or through direct message on Instagram or Facebook.",
      "release": "2021-07-07T18:00:00Z",
      "duration": "00:39:41.0390000",
      "explicit": false,
      "spotifyId": "74ODqDvQNuVeEf0J3iORJc",
      "appleId": 1000535188538,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74ODqDvQNuVeEf0J3iORJc",
        "apple": "https://podcasts.apple.com/podcast/s1-everyday-cults-everyday-people-episode-six-waking/id1585674758?i=1000535188538"
      }
    },
    {
      "id": "cfa764c2-f857-48a6-ac3c-167c180dfc82",
      "title": "S1: Everyday Cults. Everyday People. Episode Five: Snapping",
      "description": "In this episode of Everyday Cults. Everyday People, we explore what Gerette identified in her book as the fourth stage of cultic involvement: Snapping—as in snapping out of it. This is the period of dawning recognition; it’s the acknowledgement that you have been indoctrinated. It demands a huge shift in consciousness. For many, it is also an awakening of conscience when you see how you or your loved ones have been harmed by the group. It may also be a realization that you have been complicit with something that is in direct contradiction to your deepest personal values or even morality itself. We discuss complicity, accountability, and then ask the one question cult survivors hate to be asked. Tune in for frank talk about everyday cults and how they can endanger everyday people like you and me. Views and opinions expressed in this podcast are those of Gerette Buglion arising from her personal 18-year cultic involvement and from her subsequent work in cult recovery and education. We are deeply grateful to Moon Panda for the use of their song \u0022Slow Drive.\u0022 Yes, Everyday Cults. Everyday People is a kind of slow cruise around the cult world, taking in the varied landscapes. Let us know what you liked and where you\u0027d like to head for Season Two. And tune in next week for our wrap up of Season One. We will discuss the fifth stage of cultic involvement: Waking Up Again and Again.",
      "release": "2021-06-11T12:00:00Z",
      "duration": "00:27:43.4790000",
      "explicit": false,
      "spotifyId": "6irYB3Co3NZln5uMu3XFM5",
      "appleId": 1000535188709,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6irYB3Co3NZln5uMu3XFM5",
        "apple": "https://podcasts.apple.com/podcast/s1-everyday-cults-everyday-people-episode-five-snapping/id1585674758?i=1000535188709"
      }
    },
    {
      "id": "c9d75542-086a-4522-a3b0-e566bddb3006",
      "title": "S1: Everyday Cults. Everyday People. Episode Four: Asleep",
      "description": "Everyday Cults. Everyday People explores the five stages of cultic involvement identified by Gerette Buglion in her new memoir An Everyday Cult. In this episode, we discuss what she calls “Asleep,” the third stage of cultic involvement. Gerette estimates that she was asleep for five out of the eighteen years she was in the cult. We discuss how the cult leader lulled members into this stage and the impact it had and still has on their lives. We also talk about how to recognize such a sleeper and what you can do when you think a loved one has fallen prey to the dangers of a cult. A recent New York Times article suggests that 15% of people in the US are involved in QAnon, an organization that many people consider to either be a cult or have cultic qualities. We talk about how to determine whether or not the group or organization we are interested in is a cult and the questions we should be asking ourselves. Tune in for frank talk about everyday cults and how they can endanger everyday people like you and me. Views and opinions expressed in this podcast are those of Gerette Buglion arising from her personal 18-year cultic involvement and from her work in cult recovery and education. We are deeply grateful to Moon Panda for their song \u0022Slow Drive\u0022. Yes, Everyday Cults. Everyday People is a kind of slow cruise around the cult world, taking in the varied landscapes. Please be sure to comment about what you liked and where you\u0027d like to head for Season Two. Be sure to tune in next week for the fourth stage of cultic involvement: Snapping.",
      "release": "2021-06-04T11:00:00Z",
      "duration": "00:29:33.6270000",
      "explicit": false,
      "spotifyId": "3gKbwJpNgqBidoumzRTfBs",
      "appleId": 1000535188649,
      "subjects": [
        "Qanon",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3gKbwJpNgqBidoumzRTfBs",
        "apple": "https://podcasts.apple.com/podcast/s1-everyday-cults-everyday-people-episode-four-asleep/id1585674758?i=1000535188649"
      }
    },
    {
      "id": "976f47d0-9e34-4c3e-b745-d263125b4407",
      "title": "S1: Everyday Cults. Everyday People. Episode Three: Drifting",
      "description": "In this, our first season of Everyday Cults. Everyday People we explore the five stages of cultic involvement Gerette identifies in her new memoir An Everyday Cult. Last week, our subject was Falling—as in falling for the trickery of a cult. Today, we discuss drifting, the second stage. Drifting is a period of psychological meandering where part of one’s psyche is lulled into unconscious complicity with a doctrine. During this stage one can be easily influenced but can also hold down a job and raise a family without great negative impact, despite the fact that they are living a split reality. We also discuss the cult leader’s lack of accountability, training, or ethical standards for the ‘therapy’ sessions he conducted, and the predatory, non-consensual relationships ‘Doug’ had with members of the ‘Center for Transformational Learning’ cult he founded. (For the protection of those who have been and are subject to cultic abuse, \u0027Doug\u0027 and \u0027Center for Transformational Learning\u0027 are pseudonyms.) Tune in for frank talk about everyday cults and how they can endanger everyday people like you and me. Views and opinions expressed in this podcast are those of Gerette Buglion arising from her personal 18-year cultic involvement and from her work in cult recovery and education.",
      "release": "2021-05-25T13:00:00Z",
      "duration": "00:31:11.1150000",
      "explicit": true,
      "spotifyId": "4ufObT8kY3qvu5iNlZdwt1",
      "appleId": 1000535188539,
      "subjects": [
        "Cult Recovery",
        "Center For Transformational Learning"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ufObT8kY3qvu5iNlZdwt1",
        "apple": "https://podcasts.apple.com/podcast/s1-everyday-cults-everyday-people-episode-three-drifting/id1585674758?i=1000535188539"
      }
    },
    {
      "id": "d19a13d6-8141-483f-9e2c-d7ddc938018f",
      "title": "S1: Everyday Cults. Everyday People. Episode Two: Falling",
      "description": "Just as no one intentionally falls in love with an abuser, no one intentionally joins a cult—we fall for them. Falling, in this case, refers to both falling in love and falling asleep. Gerette fell. Her fall lasted eighteen years. Often - but not always – cultic involvement begins with \u0027love-bombing\u0027 - a starry-eyed stage where someone is magnetically drawn to a group or a leader who promises the moon and it feels really good. Typically, the early stages of cultic involvement can include a lot of longing, learning about one’s self, and a whole lot of idealizing. In this episode, we discuss the early days of Gerette’s cult life which devolved into the gradual erosion of her psyche. Tune in for frank talk about everyday cults and how they can endanger everyday people like you and me. Views and opinions expressed in this podcast are those of Gerette Buglion arising from her personal 18-year cultic involvement and from her work in cult recovery and education.",
      "release": "2021-05-18T19:00:00Z",
      "duration": "00:22:30.4860000",
      "explicit": false,
      "spotifyId": "0NMFpDsFJqzoaYa99jrJOi",
      "appleId": 1000535188710,
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NMFpDsFJqzoaYa99jrJOi",
        "apple": "https://podcasts.apple.com/podcast/s1-everyday-cults-everyday-people-episode-two-falling/id1585674758?i=1000535188710"
      }
    },
    {
      "id": "7e0c2721-7eee-4205-9040-eebba4551139",
      "title": "S1: Everyday Cults. Everyday People. Episode One: Everyday Cults 101",
      "description": "What is a cult? How are they created? Who joins a cult? Why? How can we recognize a cult if we’re in one? In this introductory episode, cult survivor Gerette Buglion, author of An Everyday Cult, delves into her experience living in a cult for eighteen years to answer these compelling questions. Cult dynamics exist in all layers of society. They can be political, racist, religious, sexual, satanic, or educational. They can be founded on human potential, mass transformation, or mass marketing… Initially, many Everyday Cults can seem perfectly normal and acceptable until that very convincing façade starts to crack. We discuss the techniques cults use—such as ‘love bombing’, polarized thinking, and loading the language which we’ll investigate further in future episodes—to attract and keep members and the unbalanced power dynamics that often result. We talk about the recognition of abuse that caused Gerette to leave the cult and dedicate her life to helping others come to similar realizations. Tune in for frank talk about everyday cults and how they can endanger everyday people like you and me. Views and opinions expressed in this podcast are those of Gerette Buglion arising from her personal 18-year cultic involvement and from her work in cult recovery and education.",
      "release": "2021-05-12T15:00:00Z",
      "duration": "00:27:04.7140000",
      "explicit": false,
      "spotifyId": "3ljODKXxTtDVAsCWt0tKAc",
      "appleId": 1000535188622,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ljODKXxTtDVAsCWt0tKAc",
        "apple": "https://podcasts.apple.com/podcast/s1-everyday-cults-everyday-people-episode-one-everyday/id1585674758?i=1000535188622"
      }
    }
  ]
}