{
  "id": "0245f992-94ce-407d-ab41-06f409b52d64",
  "name": "Liz Plank",
  "youTubeChannelId": "UC6Y-EUwR1u7010ieaZEdKug",
  "episodes": [
    {
      "id": "8f5eb1fb-f81e-4c96-a719-ced6b413faa7",
      "title": "Are We All In A Cult?",
      "description": "Welcome back to Hopecore - the optimistically hopeful pod, that just may be a cult. We’re chatting with Amanda Montell, an author, podcaster, and all-around cult specialist from Scientology to Soul Cycle, and every cult in between. Amanda and Liz dive into all things cultish - the way language influences leaders \u0026 followers, the groupthink power of social media, and how we can make meaning out of the current apocalypse. Come for the vibes, and stay for the cult. \n\nIf Hopecore really is a cult, we need you to recruit more followers. Rate, review, comment, like, submit questions, and let us know your favorite cult - we all have one. \n\nSubmit your boy problems here! https://docs.google.com/forms/d/1HS1sBjrrvSYLTSTJni3HZlt-ADxrAB9rtCH9-C6hT70/viewform?edi t_requested=true \n\nCheck out Airplane Mode with Liz Plank on Substack!  https://substack.com/@lizplank\n\nFind Amanda Montell\u0027s work here! https://amandamontell.com\n\n------------------------------------------------ \nFor more from Liz Plank, subscribe to her Substack, Airplane Mode: https://substack.com/@lizplank. \n\nSubscribe to our channel to get access to perks like ad-free episodes and exclusive videos: www.youtube.com/@feministabulous \n\nWrite to Liz and share your Boy Problems they might make it onto the show! \nhttps://docs.google.com/forms/d/1HS1sBjrrvSYLTSTJni3HZlt-ADxrAB9rtCH9-C6hT70/viewform?edi t_requested=true \n\nLiz Plank is an award-winning journalist, filmmaker, international bestselling author, and producer of several critically acclaimed digital series at Vox Media and NBC News. She currently hosts Boy Problems, a podcast that tackles love, masculinity, dating disasters, and life’s biggest questions. \n\nHer widely celebrated book, For The Love of Men: A Vision for Mindful Masculinity, became an international sensation, captivating readers across the globe. Praised for its bold exploration of modern masculinity, it has been featured in iconic publications such as Vogue, Esquire, Playboy, ELLE, GQ, and has earned thoughtful coverage on NPR, The Washington Post, and MSNBC. Its impact transcended borders, sparking vital conversations about the future of gender and identity. \n\nLiz’s groundbreaking journalism has garnered widespread acclaim, earning her a spot on Forbes’ prestigious 30 Under 30 list, as well as recognition as one of Mediaite’s Most Influential in News Media and Marie Claire’s Most Powerful Women. Adding to her global impact, she was honored as one of the World’s Most Influential People in Gender Policy by Apolitical, cementing her status as a trailblazer in shaping the future of gender equality.\n\nLearn more about Liz and her work at https://www.elizabethplank.com/\n\nFollow Liz Plank on Twitter https://x.com/feministabulous/ \nFollow Liz Plank on Facebook https://www.facebook.com/feministabulous/\nFollow Liz Plank on Instagram https://www.instagram.com/feministabulous/\nFollow Liz Plank on TikTok https://www.tiktok.com/@lizplank \nFollow Liz Plank on Bluesky https://bsky.app/profile/lizplank.bsky.social",
      "release": "2025-10-17T10:01:01Z",
      "duration": "00:38:18",
      "explicit": false,
      "youTubeId": "V4sBCIC-org",
      "subjects": [
        "Scientology",
        "SoulCycle",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V4sBCIC-org"
      }
    }
  ]
}