{
  "_ts": 0,
  "id": "9f45bcda-d60d-45e4-8312-1e3f29600eb7",
  "name": "Liz \u0026 Crystal Sister Chats",
  "youTubeChannelId": "UC7vEfMfhMb90gT-n0Tgxg8A",
  "episodes": [
    {
      "id": "8f077a4c-9710-4862-821f-608425b081de",
      "title": "Fun Movie Chat: Joe vs the Volcano \u0026amp; Search for Purpose #theunknown #movie #purpose #findyourself",
      "description": "Movie Discussion: Joe vs. the Volcano – Big Changes, Big Heart\n\nIn this episode of Sisters Chat, we’re talking about one of our favorite weird little movies: Joe vs. the Volcano. It’s funny, quirky, and totally out there — but underneath all the oddball moments is a story that hits home about times of big change needed.\n\nJoe’s stuck in a dead-end job, feeling sick and drained by life, until he’s told he’s dying of a \u0022brain cloud\u0022 and agrees to jump into a volcano to appease the gods of a faraway island. Sounds ridiculous, right? But in saying yes to something completely wild, he unknowingly says yes to a whole new version of himself. On his way to the volcano, he finds adventure, love, and — most importantly — the courage to truly live. A true heroe\u0027s journey tale most can relate to. The journey of finding ourselves.\n\nWe talk about how Joe’s journey mirrors some of our own — times we’ve faced big changes or felt totally lost because of life or health concerns, only to be surprised by the new opportunities that came out of it that expanded our way of looking at waking up each day and finding purpose. That moment of stepping away from the life we thought we had to live... and realizing we get to choose joy. We get to wake up with purpose.\n\nThis one’s full of laughs, real talk, and sisterly reflection. Whether you’ve seen the movie or not, we think you’ll connect with the themes — especially if you’ve ever felt like you needed to leap into the unknown just to feel alive again.\n\nThank you for Being Here. It is an Honor to be Present.\n- Liz Salazar \u0026 Crystal Welsh\n\n#mentalhealth #podcast #innerresilience #courageousconversations #courage #changeisgrowth #change #nevergiveup #traumainformed #connection #sisters #healingtheinnerchild #youarenotalone #youmatter #adventureoflife #movies #joevsthevolcanomovie #resilience",
      "release": "2025-06-21T00:22:45Z",
      "duration": "00:14:40",
      "explicit": false,
      "youTubeId": "e0bN7tTlME4",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e0bN7tTlME4"
      }
    },
    {
      "id": "0930a2c8-a4aa-4497-8306-a34a18260be8",
      "title": "Nervous System Regulation: From Fight-or-Flight-or Freeze to a more Empowered Mind \u0026amp; Body State",
      "description": "Nervous System Regulation: From Fight-or-Flight-or Freeze to a more Empowered Emotional State \n\nLiz Salazar \u0026 Crystal Welsh discuss what Liz is learning in a nervous system regulation program. \nExploring through the discussion how to recognize triggering situations, understand the body’s stress responses, and navigate tough moments with greater clarity and self compassion. \nThey talk about helpful tools and techniques like breath work that can be powerful tools for calming the body in moments when the nervous system is activated—whether in fight, flight, or freeze. By learning to pause, breathe, and create SPACE between reaction and response, how we can gently shift \u0026 retrain our survival mode into a state of more regulated presence.\n\nLiz reflects on how this process is not just about managing stress, but about consciously evolving—expanding our awareness, softening old patterns, and allowing our personality to shift in ways that bring more ease and emotional freedom. It literally feels like a miracle; as we evolve before our own eyes! We become more conscious of our inner self, our self talk, reactions, response emotions like extreme: sadness, anger, confusion, anxiety, that translate into outward expressions like we get quiet, we start to over explain looking for validation, we start to sweat or shake, get physically sick to our stomach. These are some of the ways the body and mind react when the nervous system is activated in an effort to protect ourselves. Through seeing how the nervous system works we can become more empowered to shape how we experience and respond to life.\n\nThank YOU for Being Here. It is an Honor to Be Present.\n~ Liz Salazar \u0026 Crystal Welsh ✨\n\n#mentalhealth #nervoussystem #nervoussystemregulation #resilience #selflove #empowerempowered #copingmechanism #podcast #traumainformed #selfhealingcommunity #compassionateinquiry #compassion #personalgrowthjourney #nevergiveupmotivation #beautifullife  #healingtheinnerchild #sisters #traumahealing #hopecore #believeinyourself #imatter #iamenough #miracles #addictionrecovery #addictionfree #innerpower #innerpeace #fightorflight #emotionalstate",
      "release": "2025-06-03T01:11:14Z",
      "duration": "00:27:56",
      "explicit": false,
      "youTubeId": "a-ddpSjNqbY",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=a-ddpSjNqbY"
      }
    },
    {
      "id": "9a7a3912-7261-4517-b757-0563544e279e",
      "title": "Shift Your Mindset: The Power of Perspective \u0026amp; Intention #innerresilience #mindset #perspective",
      "description": "Shift Your Mindset helps turn hardship into strength. While it may not change the past, it gives us the tools to reshape how we view it. We revisit the stories of growing up poor — not to relive the past, but to reframe it. Through honest reflections and raw moments, we explore how shifting our perspective can transform hardship into strength, shame into confidence, and struggle into resilience. We reflect on how doing charity work as kids led to a surprising realization: maybe we weren’t as poor as we once thought compared to the children we were helping. Join us as we revisit these personal chapters, rewrite the narrative, and uncover the power of seeing our past through a new lens. Perspective is everything — and it can change the way we see ourselves and our journey.\n\nThank YOU for Being Here. It is an Honor to Be Present.\n- Liz Salazar \u0026 Crystal Welsh\n\n#podcast #growinguptogether #struggle #poorchildren #perspective #resilience #charityworks #neveralone #nevergiveup #traumainformed #mentalstrength #mentalhealth #selfhealingcommunity #growthmindset #personaldevelopment #beyondmotivation #dontcompare #wishfulfillment #createreality #reframe #triumphofgood #compassionateinquiry #innerresilience #accountability #imagination #strength #spiritualjourney #addictionfree #painandsuffering #intentionalliving #imatter #sistersworld #lacks #abundance #abundância #abundancia #perspectivas #cambiatumentecambiatuvida #mejoratusalud #másallá",
      "release": "2025-05-08T07:28:27Z",
      "duration": "00:15:27",
      "explicit": false,
      "youTubeId": "vflz_TlfO50",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vflz_TlfO50"
      }
    },
    {
      "id": "b8698ab1-cd7e-4edd-8f77-c711faf34ed8",
      "title": "Speak Your Truth: Your Voice Matters | Liz Salazar \u0026amp; Crystal Welsh Sister Chats Podcast EP 3",
      "description": "In this episode, we’re diving deep into what it really means to speak your truth. From unlearning people-pleasing habits to embracing uncomfortable conversations, we talk about the beauty and bravery in being honest — with yourself and with the world around you.",
      "release": "2025-04-18T22:44:37Z",
      "duration": "00:17:02",
      "explicit": false,
      "youTubeId": "e4lu8iqeWoU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e4lu8iqeWoU"
      }
    },
    {
      "id": "5853cb87-a73e-429f-9a9e-c927b3812ee0",
      "title": "Empty Nesting \u0026amp; Reparenting Our Inner Child | Ep 2 Part 2 | Sister Chats Liz Salazar \u0026amp; Crystal Welsh",
      "description": "In this continuation of our Empty Nesting episode, we dive deeper into the  process of reparenting our inner child. \n\nThis episode explores how we can become the caregivers we always needed, now, for ourselves. We talk about self-compassion, setting new boundaries, and creating rituals of nurturing and joy. \n\nIt is an honor to be present!\n\n#reparenting #emptynest #selfimprovement #parenthood",
      "release": "2025-04-10T23:55:04Z",
      "duration": "00:17:34",
      "explicit": false,
      "youTubeId": "QqxMnKdFd4s",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QqxMnKdFd4s"
      }
    },
    {
      "id": "df211da4-9ef5-4ff0-b499-3cd3b518d400",
      "title": "Empty Nesting: Embracing the Unexpected | Liz and Crystal Sister Chats Ep. 2 Part 1",
      "description": "In this first episode of our two-part series, we dive into the emotional and practical challenges of empty nesting.  We explore the evolving dynamics between parents and their now-adult children—how roles shift, boundaries change, and what it means to support them without overstepping.\n\n Whether you’re in the middle of this transition or preparing for it, this conversation is all about finding balance, connection, and purpose in this next chapter.\n\nStay tuned for Part 2 where we dive into reparenting, reframing childhood trauma, and breaking generational patterns to become the best parents we can be for our children.\n\n#EmptyNest #ParentingAdults #LifeTransitions #Reparenting #HealingGenerations #EmptyNestSyndrome #ParentingJourney #FamilyDynamics #PersonalGrowth  #BreakingCycles #EmotionalWellness",
      "release": "2025-04-04T05:19:58Z",
      "duration": "00:16:56",
      "explicit": false,
      "youTubeId": "TdH9wM5VR6M",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TdH9wM5VR6M"
      }
    },
    {
      "id": "39bc4d9f-61e3-4d1b-a522-03a15b8a06b5",
      "title": "Beyond the Cult: Finding Ourselves \u0026 Moving Forward | Liz \u0026 Crystal Sister Chats Ep. 1",
      "description": "Welcome to the first episode of Liz and Crystal Sister Chats! In this episode, sisters Liz and Crystal share their story, what led them to start this podcast, and their decision to leave the cult they were born into, with their children’s future in mind. But more importantly, this podcast is about what comes next: the healing journey, personal growth, and creating a new life.\n\nIf you’ve ever felt stuck in a controlling environment, faced challenges in rebuilding your life, or simply need a story of resilience and hope, you’re not alone. This is just the start of a new chapter.\n\nSubscribe for more episodes on healing, growth, and life beyond the cult.\nIt is an honor to be present.\n\n#LifeAfterACult  #HealingJourney #PersonalGrowth\n#humantraffickingawareness #abusesurvivors #lifejourney #consciousness",
      "release": "2025-03-26T04:56:26Z",
      "duration": "00:13:47",
      "explicit": false,
      "youTubeId": "s31wNF_zZvY",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=s31wNF_zZvY"
      }
    }
  ]
}