{
  "id": "78388dcb-9702-424b-a898-32b5924929a4",
  "name": "LondonNey",
  "youTubeChannelId": "UCcpwFnwSHdIPvHNjZlEF9Bw",
  "episodes": [
    {
      "id": "b487eeb6-7c39-4e8c-b096-4a0e1e09077f",
      "title": "Panel Discussion: \u0022The Shugden Controversy \u0026 the 14th Dalai Lama\u0022",
      "description": "Panel Discussion: \u0022The Shugden Controversy \u0026 the 14th Dalai Lama\u0022\n\n00:00:07, Welcome and introduction by Nathan Hill \n00:12:28 Kelsang Rabten  - International Shugden Community\n00:22:43 Geshe Tashi Tsering \u0027Refuting the claim of Dugyal (Shugden) as a protector in the Tsongkhapa tradition\u0027\n00:33:06 Carol McQuire \u0027Shugden \u0027practitioners\u0027 or Shugden \u0027followers\u0027?\u0027\n00:42:50 Dr Martin A. Mills \u0027Human rights and the Shugden ban amongst Himalayan communities\u0027\n00:53:58 Thierry Dodin \u0027From Lhasa to Singapore: History and function of Shugden worship\u0027\n01:05:25 John McBretney \u0027The suffering of Shugden Buddhists within the Tibetan Exile Community, and the Dalai Lama\u0027s role in this\u0027\n01:16:00 Nathan Hill, Response to all presentations\n01:26:35 Kelsang Rabten, Response to all presentations\n01:31:51 Geshe Tashi Tsering, Response to all presentations\n01:37:20 Carol McQuire, Response to all presentations\n01:42:29 Dr Martin A. Mills, Response to all presentations\n01:48:14 Thierry Dodin, Response to all presentations\n01:53:49 John McBretney, Response to all presentations\n01:59:30 Nathan Hill, Closing remarks and thanks\n\nOrganised by Dr Nathan W. Hill of the School of Oriental and African Studies with LondonNey\n \nFriday, 15th Aug 2014, from 6pm to 8pm at SOAS, University of LONDON, UK\n \nThis panel discussion will address the on-going ‘Shugden controversy’ in the Gelug school of Tibetan Buddhism, which is surrounded by confusion, misinformation, and disagreement. While the Dalai Lama and many Tibetans have ceased to honour ‘Shugden’ and regard the propitiation of Shugden as problematic, a vocal minority, especially the New Kadampa Tradition (NKT) established in the West, believe the Shugden deity to be an essential component or Dharma protector of the Gelug School, and claim to be a minority discriminated against on religious grounds.\n \nThe community of Tibetan Buddhists has been agitated and are puzzled by the intensity of this dispute concerning the practice of the controversial deity – Shugden. Tibetans are generally bewildered by the actions of Western Buddhist organisations such as the NKT and their protests wherever the Dalai Lama travels, leading many Tibetans to become suspicious of Western Buddhist practitioners in general.\n \nThen, many Tibetans accuse the Shugden protesters as “devil worshippers”, “Chinese agents” and “Taliban Buddhists” while the pro-Shugden protestors question the very authenticity of the 14th Dalai Lama, using slogans such as “fake Dalai Lama”, “Muslin Dalai Lama”, “lying Dalai Lama”, and so on.\n \nThe purpose of this unprecedented, moderated discussion among experts and representatives from different sides of the dispute is to openly address this issue. The event is open to the general public with the aim of providing a better understanding of this issue.\n \nThe event will be live-streamed in order to provide the opportunity for far greater audiences. Here is the link www.livestream.com/Tibetan\n \nThis discussion will be moderated by Dr Nathan W. Hill, Lecturer in Tibetan and Linguistics at SOAS and the speakers include:\n \nDr Martin A. Mills (University of Aberdeen), ‘Human rights and the Shugden ban amongst Himalayan communities’\n \nThierry Dodin (Tibetologist) ‘From Lhasa to Shigatse: History and function of Shugden worship”\n \n \nKelsang Rabten (Shugden Community), ‘Refuting the claim of Tenzin Gyatso as an authentic Dalai Lama’\n \nGeshe Tashi Tsering (Jamyang Buddhist Centre), ‘Refuting the claim of Dolgyal (Shugden) as a protector in the Tsongkhapa tradition’\n \n \nCarol McQuire (former member of New Kadampa Tradition) ‘Shugden practitioners or Shugden followers’\n \nJohn McBretney (Shugden Community), ‘The suffering of Shugden Buddhists within the Tibetan exile community, and the Dalai Lama’s role in this’\n \nVenue: Vernon Square Room V211\nThe School of Oriental and African Studies (SOAS)\nUniversity of London, WC1X 9EW",
      "release": "2014-08-18T11:55:10Z",
      "duration": "02:05:00",
      "explicit": false,
      "youTubeId": "Ba-pdha1noE",
      "subjects": [
        "New Kadampa Tradition",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ba-pdha1noE"
      }
    }
  ]
}