{
  "id": "9b75d43a-a169-4ea9-9ee9-b7284766ea89",
  "name": "Long Story Short Girlies Podcast",
  "spotifyId": "4SkuyTJvhvyPJdZ6yorBjM",
  "youTubeChannelId": "UCXjLJtD1ITSJb6ZH4R2rxbw",
  "episodes": [
    {
      "id": "7347eaa1-8fac-4735-8f1d-8a5ce585d884",
      "title": "Episode 16: Some Fun Stuff but Mostly Cult Stuff",
      "description": "Hey Short Girlie Gang! \nWelcome back to another episode of the Long Story Short Girlies Podcast! After a couple of weeks off from the pod, Monica and Nikki have had time to regroup from last weeks episode. This week jump into a sort-of new set, a few fun topics of convo and lots of cult talk (not just sacred ventures). If you are lame and feel like skipping over these two giggling and having a good time, jump to 25:59 to get right into the cult of it all. Thanks for tuning in to another episode of Long Story Short Girlies!",
      "release": "2024-06-06T12:51:34Z",
      "duration": "00:56:34",
      "explicit": false,
      "youTubeId": "sszTxvGHWAE",
      "subjects": [
        "Sean Combs",
        "Sacred Ventures"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sszTxvGHWAE"
      }
    },
    {
      "id": "cb0aa07d-2539-416e-82d9-a524a283832f",
      "title": "Episode 15: Threats, retaliation sermons and still no accountability 🤷🏻‍♀️",
      "release": "2024-05-16T12:00:40Z",
      "duration": "00:54:29",
      "explicit": false,
      "youTubeId": "d_bYbjZBYus",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d_bYbjZBYus"
      }
    },
    {
      "id": "85e09a30-c8d1-4965-b736-6847d46da0a6",
      "title": "Episode 10: The Reset",
      "description": "A little episode update for this weeks podcast…\n\nThe last 8-9 weeks have been a little heavy with all of the things we have been sharing. We do it because we believe the truth needs to be told and we do it to try and help others in similar situations and circumstances. However, it’s doesn’t mean it’s easy! In fact, it can be really hard some days. \n\nSo, this week we are taking the opportunity to reel it in a do a mini reset. We want to remind people that we are so much more than what happened to us and we are so much more than our time at “Sacred Ventures”. We are humannnnn and we have regular, messed up, normal, fun and weird human experiences that pop up on a daily basis that are also important for us to share. \n\nToday, we were able to breakdown pieces of OUR relationship and communication that we need to work on and we both took accountability and ownership of some character defects we would like to change. \n\nWe hope that by being real and raw and RELATABLE, you are able to realize that you’re not alone in your day to day shortcomings either. \n\nWe love you guys and we are forever grateful for this wonderful community of short guys and girlies that blossomed out of something so dark. 💕💕💕",
      "release": "2024-03-19T22:06:15Z",
      "duration": "00:27:46",
      "explicit": false,
      "youTubeId": "ak17uIWMmHs",
      "subjects": [
        "Sacred Ventures"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ak17uIWMmHs"
      }
    },
    {
      "id": "c5234331-7dbb-40d7-b5b5-f7b7abd460b9",
      "title": "Episode 9: The Aftermath - Part 2",
      "description": "Welcome to one long and crazy episode of The Long Story Short Girlies podcast! Monica and Nikki start off the episode as they promised they would: The Bachelorette Story. Looking back on this rollercoaster ride of a story had the girlies remembering all sorts of bits and pieces from their past at “Sacred Ventures”. Be sure to till the end to get the fulllllll truth of it all. Tune in next week for more!",
      "release": "2024-03-12T13:00:01Z",
      "duration": "01:12:59",
      "explicit": false,
      "youTubeId": "1jPmfBWlKj0",
      "subjects": [
        "Sacred Ventures"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=1jPmfBWlKj0"
      }
    }
  ]
}