{
  "_ts": 0,
  "id": "263ad8e2-c584-4aa9-9331-c48dd5162ceb",
  "name": "Look At Me Now with Alexis Artin",
  "spotifyId": "2x8ffK1XF4OGICLztWJ2Lm",
  "appleId": 1724573645,
  "youTubeChannelId": "UCY5HF1lWfa95dHbSVqw19Mw",
  "episodes": [
    {
      "id": "0077b451-7cec-40ea-9355-2bcf20399823",
      "title": "Ep. 6 - We Escaped a \u0022Sexy Cult\u0022! Discovering the True Strength of Being a Woman, Sensual Empowerment and Unshackling Femininity with Janelle Marra",
      "description": "Today’s episode is an exhilarating journey through the twists and turns of personal transformation and sensual awakening. Listen in as one of my best friends and co-founder of Soulsway, Janelle Marra, sits down with me to unravel our shared past within what I playfully refer to as a \u0022sexy cult.\u0022 Together, we\u0027ll reflect on our evolution from vulnerability to empowerment, sharing laughter and candid memories along the way. Janelle, a former doula and actress, dives into her acting class revelation that sparked a deeper connection with her own sensuality, inviting you to celebrate our paths to self-discovery. \u0022That was the huge aha and she said - You were not sexy and you need to do something about it!\u0022 - Janelle Marra This conversation is where movement and sensuality intertwine, as I recount my own eye-opening experiences with a unique exercise that redefined my relationship with my body. You will feel the power of a supportive community of women, evocative music, and the transformative impact of embracing fluid, sensual movement. With Janelle\u0027s insight, we discuss the significance of finding one\u0027s rhythm and the courage to break free from rigidity. Janelle and I also delve into the emotional intricacies of leading high-pressure retreats and the personal challenges that come with such a demanding role. We close the loop by sharing our dedication to fostering a new environment where emotional and physical expression is not only permitted but fervently celebrated. This episode is an open invitation to join us in embracing personal freedom and self-expertise, all while building a sanctuary free from external judgment. \u0022I took her words to heart, thinking about how I could become more comfortable with myself, how I could embody that sensuality she spoke of. It was like discovering a new side of myself, a side that I never thought I had.\u0022 - Janelle Marra ----- In this episode, we discuss… (01:00) Journey Into a Sexy Cult (15:31) Discovering Sensual Movement Practice (19:28) Empowering Body Confidence Through Movement (24:22) Exploring Erotic Feminine Empowerment (36:08) Journey in Female Empowerment Retreats (45:16) Building a New Safe Space ----- Follow Janelle @janellemarrahealing Learn more at JanelleMarraHealing.com and SoulSwayPractice.com Learn more at AlexisArtin.com Follow me on Instagram @alexis_artin",
      "release": "2024-03-04T08:30:00Z",
      "duration": "01:00:39.0830000",
      "explicit": true,
      "spotifyId": "6mHAfcyxRvswS3KNK1kNuA",
      "appleId": 1000647906861,
      "youTubeId": "1gl-E6pya2E",
      "subjects": [
        "S Factor Studio"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6mHAfcyxRvswS3KNK1kNuA",
        "apple": "https://podcasts.apple.com/podcast/we-escaped-a-sexy-cult-discovering-the-true/id1724573645?i=1000647906861",
        "youtube": "https://www.youtube.com/watch?v=1gl-E6pya2E"
      }
    }
  ]
}