{
  "id": "53547075-619c-4ad6-9bff-d52fc78d27ba",
  "name": "Lucas Mack",
  "spotifyId": "3Gh0IeRtRkLh5riBOsGN39",
  "appleId": 1288773949,
  "youTubeChannelId": "UCILxJNrb5LF_zC92vczURUQ",
  "episodes": [
    {
      "id": "a63964f8-9618-4295-ad91-6855d4d6f360",
      "title": "From Leaving a Cult to Changing Culture with Micah Johnson | The Lucas Mack Show",
      "description": "After growing up in a cult, Micah Johnson found himself disillusioned from his spiritual beliefs and searched for truth outside of his community, which led him on a journey that many can relate to. He\u0027s now a profound keynote speaker and coach and is helping countless people find their truth and internal power.\n\nFind Micah at:\n\nhttps://www.instagram.com/micahjames07/\n\nhttps://www.facebook.com/micah.johnson.790/\n\nhttps://www.tiktok.com/@micahjjohnson\n\nhttps://www.linkedin.com/in/micahjames07/\n\nhttps://x.com/MicahJJohnson7\n\nSpeaker Reel\n\nWebsite: https://www.thecollectiveflow.com\n\nThank you for listening – if you’re struggling to break free and need support – go to my website and www.lucasmack.com. There’s you’ll find resources like videos and eBooks and information on how to work with me for coaching.\n\nWATCH MY TEDx talk: https://www.youtube.com/watch?v=zG0zXJ8bUOA\u0026t=47s\n\nSign up for coaching: https://www.lucasmack.com/coaching\n\n------------\n\nLucas Mack is an Author, Speaker, and Healing Catalyst for people, especially men who carry concealed trauma. Through his transformative process—the 5 Vulnerable Truths of Healing—he creates a safe, sacred, and deeply healing container for his clients to liberate themselves from the shackles of shame, trauma, and abuse. His mission is to give men permission to put down their armor and experience the power of vulnerability and unconditional love—initiating their healing and empowering them to live with authenticity and purpose. He is the founder and CEO of 4th Avenue Media as well as the host of The Golden Rule Revolution podcast, author of Everyone Has a Plan Until They Get Punched in the Face, and has spoken globally at events including TEDx, Microsoft, Society of Human Resources, and more. After healing from his own childhood abuse, he’s been devoted to freeing other high-achieving men from the trauma of the past.\n\nWorking for clients like Microsoft, T-Mobile, MOD Pizza, Napoleon Foods and more, Lucas dedicated more than 18 years providing companies with ideas, products and services that improved clarity, employee engagement, and sales. His passion for inspiring people to build deeper relationships with those around them is reflected in his writing, speaking, and coaching.",
      "release": "2024-12-22T23:02:44Z",
      "duration": "01:02:27",
      "explicit": false,
      "spotifyId": "08gdTPlSzhh1XRu3a3q0bZ",
      "appleId": 1000681344173,
      "youTubeId": "ld2L4gsFsz4",
      "urls": {
        "spotify": "https://open.spotify.com/episode/08gdTPlSzhh1XRu3a3q0bZ",
        "apple": "https://podcasts.apple.com/podcast/307-from-leaving-a-cult-to-changing-culture-with/id1288773949?i=1000681344173",
        "youtube": "https://www.youtube.com/watch?v=ld2L4gsFsz4"
      }
    }
  ]
}