{
  "id": "8ac63736-b7b1-4c01-bbd6-48692da98be2",
  "name": "Lucid Lab Podcast",
  "spotifyId": "1pH9hDYZoo7n9kbZwJ4Phd",
  "appleId": 1684133202,
  "episodes": [
    {
      "id": "0b89c59c-6f1a-4899-aaa0-6949bb7cd664",
      "title": "Mormon Manson: The Bloody Legacy of Ervil LeBaron (Part 2 of 2)",
      "description": "Outside of Juarez, Mexico in the 1970s, Ervil LeBaron led a fundamentalist sect of the Mormon religion known as the Lambs of God. Ervil would gather many followers and lead them down a treacherous path that involved killing their own family members in the name of God. By the time it was all done, there would be over 30 people killed but Ervil would never pull a trigger or kill one person by his own hand. This is what earned him the name of The Mormon Manson. In the second part of our story, we go into the LeBaron family as they flee Utah to escape the religious persecution after polygamy was outlawed. Once in Mexico, the LeBarons would claim to be the righful heir to Joseph Smith himself and the title of the One Mighty \u0026 Strong would pass to various brothers, all vying to be the one in control of the colony. This is where things go very, very wrong resulting in many unnecessary deaths. __________ Follow Lucid Lab Podcast on your favorite platform and be sure to subscribe and leave a review where available! Please visit us on social media @lucidlabpodcast on TikTok, Instagram, Facebook and YouTube __________ Sources: Spencer, Irene. Cult Insanity. 2009. Center Street. LeBaron, Anna. The Polygamist\u0027s Daughter. 2017. Blackstone Publishing. Park, Benjamin. American Zion: A New History of Mormonism. 2024. HighBridge. Foster, Craig. American Polygamy. 2015. Arcadia Publishing. Denton, Sally. The Colony: Faith and Blood in a Promised Land. 2022. Liveright.",
      "release": "2024-07-16T11:00:00Z",
      "duration": "02:25:56.1330000",
      "explicit": true,
      "spotifyId": "5udiqxvng3kFbpjCrq2bVB",
      "appleId": 1000662396991,
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5udiqxvng3kFbpjCrq2bVB",
        "apple": "https://podcasts.apple.com/podcast/mormon-manson-the-bloody-legacy-of-ervil-lebaron-part-2-of-2/id1684133202?i=1000662396991"
      }
    },
    {
      "id": "f9bb7d87-db0f-4d92-b098-6bb251ccd329",
      "title": "Mormon Manson: The Bloody Legacy of Ervil LeBaron (Part 1 of 2)",
      "description": "Outside of Juarez, Mexico in the 1970s, Ervil LeBaron led a fundamentalist sect of the Mormon religion known as the Lambs of God. Ervil would gather many followers and lead them down a treacherous path that involved killing their own family members in the name of God. By the time it was all done, there would be over 30 people killed but Ervil would never pull a trigger or kill one person by his own hand. This is what earned him the name of The Mormon Manson. In this first part of our story, we will go back to understand some core teachings that were established by the early 1800s prophets of the Mormon church. One of those being the dangerous philosophy of Blood Atonement introduced by Brigham Young that would result in these murders 100\u0026#43; years later. __________ Follow Lucid Lab Podcast on your favorite platform and be sure to subscribe and leave a review where available! Please visit us on social media @lucidlabpodcast on TikTok, Instagram, Facebook and YouTube __________ Sources: Spencer, Irene. Cult Insanity. 2009. Center Street. LeBaron, Anna. The Polygamist\u0027s Daughter. 2017. Blackstone Publishing. Park, Benjamin. American Zion: A New History of Mormonism. 2024. HighBridge. Foster, Craig. American Polygamy. 2015. Arcadia Publishing. Denton, Sally. The Colony: Faith and Blood in a Promised Land. 2022. Liveright.",
      "release": "2024-07-09T11:00:00Z",
      "duration": "02:04:34.4830000",
      "explicit": true,
      "spotifyId": "4Om3imjH1bFrb5VddpjKp2",
      "appleId": 1000661647733,
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Om3imjH1bFrb5VddpjKp2",
        "apple": "https://podcasts.apple.com/podcast/mormon-manson-the-bloody-legacy-of-ervil-lebaron-part-1-of-2/id1684133202?i=1000661647733"
      }
    },
    {
      "id": "ba31705d-8274-4d8a-bc12-3eda4efc1ccc",
      "title": "E32 Heaven’s Gate: Marshall Applewhite and Bonnie Nettle’s UFO Cult",
      "description": "This week, Jessica brings us another cult - Heaven’s Gate! Not your normal 1970’s cult. There was abstinence from all things, spiritual ascension, unwavering devotion, lots of camping, and suicide. And what made this cult stand out compared to some others of the time? Aliens and UFOs!  --- Please rate and subscribe on iTunes and anywhere else you listen to podcasts!! ⭐⭐⭐⭐⭐ Follow Lucid Lab Podcast on social media (Facebook, Instagram, TikTok and YouTube) @lucidlabpodcast Support Lucid Lab on Patreon! Join the Lab Rat Clan - New Tiers Available! - https://www.patreon.com/LucidLabPodcast Email us with any questions or suggestions @ lucidlabpodcast@gmail.com ***LAB REPORTS*** Don’t forget to email in your own stories! We’ll read a select few each month on our special Lab Reports episode! An episode dedicated to our listeners and their crazy experiences! --- Sources: Heaven’s Gate: The 17 Steps. (1976, November). The 17 Steps (Behavioral Guidelines) (heavensgate.com) Tweel, C. (2020, December 3). Heaven’s Gate: The Cult of Cults. CNN Original Studios.  Wikipedia. (n.d.). Heaven’s Gate (religious group).. Heaven\u0027s Gate (religious group) - Wikipedia Barcella, L. (2022, March 15). Heaven’s Gate, 25 Years Later: Remembering 38 People Who Died with Cult Leader. Heaven\u0027s Gate, 25 Years Later: Remembering Lives Lost in Cult (people.com)",
      "release": "2023-11-07T00:00:00",
      "duration": "02:03:33.3010000",
      "explicit": true,
      "spotifyId": "5vfIwzMO145gkTnCimBHry",
      "appleId": 1000633991077,
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5vfIwzMO145gkTnCimBHry",
        "apple": "https://podcasts.apple.com/podcast/e32-heavens-gate-marshall-applewhite-and-bonnie/id1684133202?i=1000633991077"
      }
    },
    {
      "id": "9e8f4641-010a-4f5a-addf-0c7028fead8c",
      "title": "E23 The Family Cult: Australia’s Infamous Anne Hamilton-Byrne and ’Her’ Children",
      "description": "It’s our first cult story! Welcome to The Family! The Family, or The Great White Brotherhood, is a woman-led doomsday cult founded in the 1960s in beautiful Australia. It is the twisted story of Anne Hamilton-Bryne, who gained too much power way too fast and destroyed all the lives of those who followed her. Especially her precious children. She was the Messiah, and her children were to educate what was left of humanity after the apocalypse. She was selfish, vain, and evil. And her Aunties were not the type of Aunties you would want to raise your children. Listen in to hear all the sinister details. There is a reason some consider her to be one of the cruelest people to come from Australia. --- Please rate and subscribe on iTunes and anywhere else you listen to podcasts!! Follow Lucid Lab Podcast on social media (Facebook, Instagram, TikTok and YouTube) @lucidlabpodcast Support Lucid Lab on Patreon! Join the Lab Rat Clan - New Tiers Available! - https://www.patreon.com/LucidLabPodcast Email us with any questions or suggestions @ lucidlabpodcast@gmail.com ***LAB REPORTS*** Don’t forget to email in your own stories! We’ll read a select few each month on our special Lab Report episode! An episode dedicated to our listeners and their crazy experiences! --- Sources: Cusack, C. (2018). The Family / Anne Hamilton-Byrne (Santiniketan Park Association). World Religions and Spirituality Project. Douglas, J. (2017, February 12). Inside the bizarre 1960s cult, The Family: LSD, yoga, and UFOS. Inside the bizarre 1960s cult, The Family: LSD, yoga and UFOs | The Family | The Guardian Johnston, C. (n.d.) Family Ties. The Sydney Morning Herald. Family ties (smh.com.au) Wikipedia. (n.d.). The Family (Australian New Age group). The Family (Australian New Age group) - Wikipedia Shenton, B. (2019, June 17). Reflections on the Death of Anne Hamilton-Byrne. Blog - Rescue the Family | Reflections on the death of Anne Hamilton Byrne",
      "release": "2023-09-05T00:00:00",
      "duration": "02:09:29.1830000",
      "explicit": true,
      "spotifyId": "1PhYbAK8L8zpSkYzSeLTMr",
      "appleId": 1000626800786,
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1PhYbAK8L8zpSkYzSeLTMr",
        "apple": "https://podcasts.apple.com/podcast/e23-the-family-cult-australias-infamous-anne-hamilton/id1684133202?i=1000626800786"
      }
    }
  ]
}