{
  "_ts": 0,
  "id": "d5265e19-f62d-4e86-827e-78607160f089",
  "name": "Lucid Living with Bre",
  "spotifyId": "3N7BMlajwNA2l7iJwTYTEQ",
  "appleId": 1714991254,
  "youTubeChannelId": "UCBd9yoGwfdc-m5RhAUolGwg",
  "episodes": [
    {
      "id": "a6a1fbb2-bcd9-426e-a285-41c87276198c",
      "title": "How Narcissistic Relationships Mirror Cult-Like Control \u0026 Trap You In A Cycle of Addiction",
      "description": "What if there was a clear reason that your last narcissistic relationship was so hard to leave?\n\nIn this episode, we uncover the striking parallels between narcissistic relationships, cult dynamics and addiction. These relationships don’t just manipulate your emotions—they hijack your mind, body, and sense of reality which can make leaving (and healing) feel impossible.\n\nIn this episode you will discover:\n- How narcissistic relationships mirror cult dynamics and trap you in a false reality\n- Why these toxic bonds feel addictive and how they rewire your brain to keep you dependent on them\n- The steps to detox from the addictive cycle and break free from manipulation.\n\nDon’t let the cycle control you any longer—press play now to uncover the truth, and break free.\n\nMENTIONED:\n- Submit an interest form⁠ to work with me: https://tinyurl.com/interest-form-htwshownotes\n- Get the free 3 WAYS TO RECOGNIZE LOVE BOMBING GUIDE to spot love bombing and walk away from the red flags early: https://tinyurl.com/lovebombguide-htwshownotes\n- Hilary’s other podcast episodes:\nEp. 47: Was Any Of It Real? Signs You\u0027ve Been Deceived In A Narcissistic Relationship \u0026 How To Finally Understand It With Hilary Buckwalter-Wilde: https://youtu.be/LkXs6vWobGc\nEp. 48: How Narcissists Use Sex As Manipulation \u0026 Control In Toxic Relationships With Hilary Buckwalter-Wilde (Part 2): https://youtu.be/bCYsyeY-L1E\nEp. 59: The Narcissist\u0027s Lie: Weaponized Sex And The Path to Reclaiming Your Sexuality \u0026 Self-Esteem with Hilary Buckwalter-Wilde\n- Hilary’s website: indwellingduluth.com\n- Hilary’s Instagram: @‌sacredcounsel.duluth\n\n\nRESOURCES FOR YOUR HEALING:\n\n❤️ For more resources on healing from the mindf*ck of confusing relationships so you can securely attach \u002B experience healthy love: ⁠⁠⁠⁠https://www.brewolta.com⁠⁠⁠⁠\n\n🫶🏻 Get the free 3 WAYS TO RECOGNIZE LOVE BOMBING GUIDE to spot love bombing and walk away from the red flags early: https://tinyurl.com/lovebombguide-htwshownotes\n\n🫶🏻 ⁠Get the free RELATIONSHIP RESET GUIDE⁠: https://tinyurl.com/rrg-htwshownotes\n- Learn how to communicate your feelings (without feeling guilty)\n- Navigate triggering moments without shutting down\n- Feel secure on your own so you aren’t jumping into the wrong relationship\n- Expand your capacity to hold next-level love while remaining true to you\n\n🌻 ⁠Submit an interest form⁠ to work with me: https://tinyurl.com/interest-form-htwshownotes\n\n\n\nIn this podcast, we unpack the challenges faced by empaths and those struggling with codependency who’ve found themselves healing from the heartbreak and confusion of narcissistic relationships. We’ll explore the meaning of gaslighting and love bombing that comes with narcissistic abuse and toxic relationships, dive into attachment styles, and learn to build confidence while setting boundaries, improving self-worth, and learning to effectively communicate in future healthy relationships.",
      "release": "2025-03-19T11:15:05Z",
      "duration": "00:41:04",
      "explicit": false,
      "spotifyId": "7im5NCwSeDLTbl6n4EEWrk",
      "appleId": 1000699880319,
      "youTubeId": "tDH-xdCPa1c",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7im5NCwSeDLTbl6n4EEWrk",
        "apple": "https://podcasts.apple.com/podcast/69-how-narcissistic-relationships-mirror-cult-like/id1714991254?i=1000699880319",
        "youtube": "https://www.youtube.com/watch?v=tDH-xdCPa1c"
      }
    }
  ]
}