{
  "id": "45f68703-c076-49b6-98be-bbed2fa4ddae",
  "name": "Madness Madness!",
  "spotifyId": "1no6c1nKgzVbKt850UcYeZ",
  "appleId": 1546796793,
  "episodes": [
    {
      "id": "ce99d2eb-e248-4e4a-83c5-02bb1a784e2a",
      "title": "Episode 48: People Unlimited Incorporated vs. The Waldorf School!",
      "description": "Today we learn how to live forever, but for real this time, from People Unlimited Incorporated! (We also take a moment to mourn the death of its founder, Charles Paul Brown, who died in 2014 NO YOU SHUT UP!) Are we ready to spend our immortal lives eating the worst food imaginable? Before we decide, we\u0027ll take a look at The Waldorf School, founded by Rudolf Steiner, who dared to ask the question, \u0022What if we did like that Montessori lady but without applying any provable facts at all?\u0022 Steiner hated facts, so thank god he started a school. Speaking of school, this week it\u0027s book fair! Bring your rolls of pennies, as Amanda is not accepting loose coins. ",
      "release": "2022-02-17T00:00:00",
      "duration": "02:15:26.5110000",
      "explicit": true,
      "spotifyId": "77Sg9kuyrewndJtCvkuDNC",
      "appleId": 1000551425333,
      "subjects": [
        "Anthroposophy"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/77Sg9kuyrewndJtCvkuDNC",
        "apple": "https://podcasts.apple.com/podcast/episode-48-people-unlimited-incorporated-vs-the/id1546796793?i=1000551425333"
      }
    },
    {
      "id": "47d38dab-4c99-4384-8758-48c45d9124da",
      "title": "Episode 47: Terasem vs. Access Consciousness",
      "description": "One of this week\u0027s cults is a rare example of a cult not primarily being a financial grift. Terasem\u0027s founders are already super fucking rich, and so they\u0027re really more interested in your unquestioning allegiance, their own desperate desire to cheat death, and your interest in hanging out with a deeply disturbing AI automaton named BINA48. It\u0027s pitted against Access Consciousness, which is a more traditional grift, but one that has a secret star from the wide world of sports! Described as \u0022Scientology Adjacent,\u0022 where \u0022Adjacent\u0022 means \u0022Shitty Clone,\u0022 Access Consciousness has currently shelled out for paid ads in Google search when you look for \u0022access consciousness cult.\u0022 Try it! It\u0027s pathetic!",
      "release": "2022-02-03T00:00:00",
      "duration": "01:59:09.6880000",
      "explicit": true,
      "spotifyId": "3wsXqcii6kKyvYr1lnzfVr",
      "appleId": 1000549999664,
      "subjects": [
        "Scientology",
        "Access Consciousness"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3wsXqcii6kKyvYr1lnzfVr",
        "apple": "https://podcasts.apple.com/podcast/episode-47-terasem-vs-access-consciousness/id1546796793?i=1000549999664"
      }
    },
    {
      "id": "2a51dcd8-8c8e-466d-ad6e-d03b47b0d416",
      "title": "Episode 46: Soka Gakkai vs. Thierry Tilly",
      "description": "This week we\u0027re throwin\u0027 a party! A POLITICAL party! Under the smug, starfucking veneer of leader Daisaku Ikeida, a Japanese Buddhism rip-offshoot called Soka Gakkai that is also a political party? With like 20% of the vote?!? I\u0027m sure there\u0027s a reasonable explanation (there isn\u0027t). We\u0027re also partying down in an abandoned secretarial school, in Paris! That\u0027s thanks to Thierry Tilly, a run-of-the-mill creep who bled a family of French aristocrats dry, and if you\u0027re not noting any sadness in this sentence, you\u0027re not imagining things. Hon hon! Bread! Also this week we realize our podcast\u0027s long lost tag line: \u0022Something to look forward to; and something to do.\u0022",
      "release": "2022-01-27T00:00:00",
      "duration": "01:47:12.0260000",
      "explicit": true,
      "spotifyId": "3H0WLwbscORG0KbGXiqrk8",
      "appleId": 1000549180024,
      "subjects": [
        "Soka Gakkai"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3H0WLwbscORG0KbGXiqrk8",
        "apple": "https://podcasts.apple.com/podcast/episode-46-soka-gakkai-vs-thierry-tilly/id1546796793?i=1000549180024"
      }
    },
    {
      "id": "8357582f-76fc-4450-9ecd-9869d6f60e11",
      "title": "Episode 45: Ganas vs. The Sterling Institute of Relationship",
      "description": "I think we can all agree that what we really need in these troubled times are more diploma mills. How else are we gonna get more unlicensed group psychotherapists? THERE IS NO OTHER WAY. The founders of Ganas, which as it happens began as an unaccredited school for group therapy, are entirely with me on this one, and would like to interest you in a completely different, entirely legitimate diploma. But before you accept, two questions: Men, have you ever asked yourself, \u0022Am I denying my sacred manliness by not acting like some horrifying post-pubescent toddler all the fucking time?\u0022 Women, have you ever thought, \u0022I sure wish a gross little Boomer twerp from some shithole suburb outside Boston could tell me a lot of dumb fucking garbage about what I\u0027m doing wrong in my relationship!\u0022 Boy oh boy, is A. Justin \u0022My real name is Arthur Kasarjian\u0022 Sterling the guy you should be burying alive as he kicks his stupid little baby legs in weak protest. Join us, won\u0027t you?",
      "release": "2022-01-20T00:00:00",
      "duration": "01:54:53.8710000",
      "explicit": true,
      "spotifyId": "5Nw5XZ6TNAufMPLOWaU0oR",
      "appleId": 1000548526671,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Nw5XZ6TNAufMPLOWaU0oR",
        "apple": "https://podcasts.apple.com/podcast/episode-45-ganas-vs-the-sterling-institute-of-relationship/id1546796793?i=1000548526671"
      }
    },
    {
      "id": "98bbb04b-fe66-45a2-978f-45f532b840e9",
      "title": "Episode 36: The Rainbow Family vs. Kabbalah",
      "description": "This week\u0027s matchup gives you a choice of cultures to appropriate: You can hang out with the Rainbow Family and immerse yourself in some muddled, deeply unsurprising theft of Native American ideas, or you can tie a string on with the Kabbalah and take a moment to consider if it\u0027s possible to improperly appropriate your own culture! Seems like a yes to me. ",
      "release": "2021-10-07T00:00:00",
      "duration": "02:20:59.8590000",
      "explicit": true,
      "spotifyId": "5rae1Qn1Sh64132AUW6aHK",
      "appleId": 1000537910964,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5rae1Qn1Sh64132AUW6aHK",
        "apple": "https://podcasts.apple.com/podcast/episode-36-the-rainbow-family-vs-kabbalah/id1546796793?i=1000537910964"
      }
    },
    {
      "id": "7a382b15-d2e0-4f9a-acae-62850c3d498b",
      "title": "Episode 35: The Church Universal \u0026 Triumphant vs. J.Z. Knight and Ramtha",
      "description": "Sometimes talkin\u0027 real fast is the same as enlightenment, especially when you\u0027re extremely sleep-deprived and possibly living in a fallout shelter because the cult you\u0027re in is definitely sure there\u0027s gonna be a nuclear war any day now. This was certainly the case with the Church Universal and Triumphant, a bunch of weirdos in Montana. Today they go up against J.Z. Knight and Ramtha, a power duo consisting of a drunk person who \u0022channels\u0022 a \u002235,000-year-old\u0022 \u0022Lemurian warrior\u0022 who lives in rural Washington and is \u0022definitely not a con artist and a huge fucking fraud.\u0022 In local news, Brian is on steroids.",
      "release": "2021-09-30T00:00:00",
      "duration": "02:18:11.0550000",
      "explicit": true,
      "spotifyId": "6euYiAfBFp19xV0E44l40h",
      "appleId": 1000537155672,
      "subjects": [
        "Ramtha\u0027s School of Enlightenment"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6euYiAfBFp19xV0E44l40h",
        "apple": "https://podcasts.apple.com/podcast/episode-35-the-church-universal-triumphant-vs-j-z/id1546796793?i=1000537155672"
      }
    },
    {
      "id": "8051f37e-db2c-4a51-8342-ed253d34a2cc",
      "title": "Episode 34: Larry Ray \u0026 the Sarah Lawrence 9 vs. Beta Dominion Xenophilia",
      "description": "Y\u0027ever meet a college roommate\u0027s dad and think, \u0022Now THERE\u0027S a guy I want to move into the common area of our dorm room!\u0022 Man, have we got the Dad for you. In today\u0027s episode we meet Larry Ray, an insane creep who took advantage of his daughter\u0027s suitemates at Sarah Lawrence College and conned them into nearly a decade of deeply bizarre servitude and exploitation. The cult doesn\u0027t have a proper name so I\u0027m gonna call it Electric Larryland. Pitted! Against! A little ethos called Beta Dominion Xenophila, invented by petty criminal, constant liar, serial bigamist, and adult prom date extraordinaire \u0022Scott\u0022 Caruthers. Ole Scott realized at some point that he could Just Start Saying Things and enough people would believe them that he could stop doing work and start having a cult/long con/weirdly actually successful fitness invention. There\u0027s a lot here, friends. Jump in!",
      "release": "2021-09-23T00:00:00",
      "duration": "02:28:12.9690000",
      "explicit": true,
      "spotifyId": "2qMcaS7tMGDeSjI40Jwj9x",
      "appleId": 1000536414362,
      "subjects": [
        "Larry Ray"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2qMcaS7tMGDeSjI40Jwj9x",
        "apple": "https://podcasts.apple.com/podcast/episode-34-larry-ray-the-sarah-lawrence-9-vs-beta/id1546796793?i=1000536414362"
      }
    },
    {
      "id": "6b2599be-e67c-4c27-993c-8a250861b133",
      "title": "Episode 33: Educo vs. Zendik Farms (Season 3 Premiere! Cults are back!)",
      "description": "We\u0027ve had a good time with clubs and organizations, but there\u0027s also a limit to how much right-wing white guy bullshit a person can study before they have to switch back to studying not-necessarily right-wing bullshit. That\u0027s right folks, cults are back! The season 3 premiere pits a couple of obscure dipshits against each other, which is clearly shocking: Educo, a health cult from the shores of fair Ireland, and Zendik Farms, a badly structured attempt to arrange some Strange for a never-was beatnik. ",
      "release": "2021-09-16T00:00:00",
      "duration": "02:22:55.6340000",
      "explicit": true,
      "spotifyId": "7zEhGt4yVku0GIoIanL2sV",
      "appleId": 1000535572685,
      "subjects": [
        "EDUCO",
        "Zendik Farm"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7zEhGt4yVku0GIoIanL2sV",
        "apple": "https://podcasts.apple.com/podcast/episode-33-educo-vs-zendik-farms-season-3-premiere/id1546796793?i=1000535572685"
      }
    },
    {
      "id": "3d26e4f4-d174-497a-94d9-e92e3745e436",
      "title": "Episode 17: Multi-Level Madness: Avon vs. Amway!",
      "description": "Two giants of the field square off this week! One\u0027s a semi-beloved fixture of domestic life; the other is Amway. Not to tip our hand too much, but if you\u0027re a betting person, think about laying your money on the MLM that isn\u0027t a right-wing monstrosity shilling a bunch of goddamn garbage to keep the DeVos family afloat on an obnoxious yacht. ",
      "release": "2021-04-29T00:00:00",
      "duration": "02:02:50.1090000",
      "explicit": true,
      "spotifyId": "5KjAtAm5N9ESMPtonmx7xs",
      "appleId": 1000519448696,
      "subjects": [
        "Amway"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5KjAtAm5N9ESMPtonmx7xs",
        "apple": "https://podcasts.apple.com/podcast/episode-17-multi-level-madness-avon-vs-amway/id1546796793?i=1000519448696"
      }
    },
    {
      "id": "0c129eac-b5ea-401b-be32-38ab1f5a6ce4",
      "title": "Episode 16: Multi-Level Madness! Mary Kay vs. Holiday Magic",
      "description": "IT\u0027S SEASON TWO, SUCKERS!!! Now that we\u0027re wig-carrying Unarians, we need another income stream to pay for all these costumes and 8mm film. Time to start a small business and be our own bosses and definitely not wind up thousands of dollars in debt with a garage full of unsalable products! That\u0027s right, we\u0027re joining a Multi-Level Marketing scheme, and definitely not a pyramid scheme!In our season 2 inaugural matchup, it\u0027s a face-off between two cosmetics MLMs! That\u0027s why it\u0027s a FACE-OFF! Because faces! And makeup! You see. Uh, anyway. Mary Kay and Holiday Magic! One started by a steely Texas lady with seemingly good intentions, the other bought out of some dude\u0027s garage by a right-wing grifter who liked flying planes a lot more than learning how to fly them! It\u0027s good stuff, people. For real.",
      "release": "2021-04-22T00:00:00",
      "duration": "02:29:18.5630000",
      "explicit": true,
      "spotifyId": "0J0QfhtpQAu2bMU7lcwMwH",
      "appleId": 1000518343356,
      "subjects": [
        "Multi-Level Marketing",
        "Mary Kay"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0J0QfhtpQAu2bMU7lcwMwH",
        "apple": "https://podcasts.apple.com/podcast/episode-16-multi-level-madness-mary-kay-vs-holiday-magic/id1546796793?i=1000518343356"
      }
    },
    {
      "id": "45ff9c15-f779-4bf6-af3e-b338bc4e8cc8",
      "title": "Episode 15: BONUS! Cults \u0027n\u0027 Capitalism \u002B Exercise Cults \u002B What\u0027s up next season!!!",
      "description": "Sometimes—OK, who are we kidding, literally all the time—you look down at the stuff you\u0027ve had to cut from previous episodes due to time constraints, and you say to yourself, \u0022There\u0027s no way I\u0027m leaving this behind.\u0022 And you\u0027re right, there\u0027s no way we\u0027d let that happen. SO! This week, a fun little grab bag!A Special Listener Letter: Friend of the Program Allen asks an interesting question about cults and capitalism, which we do some blue-skyin\u0027 and some spitballin\u0027 about.Exercise Cults: Sometimes when you insist that people are Doing It Wrong if they\u0027re not paying a whole lot extra for the specific exercise program you\u0027re selling, it gets kinda culty! Especially if you\u0027re selling Crossfit or Soul Cycle! You fucking weirdo! CONTENT WARNING: This segment contains discussion about disordered eating and exercising, so you might consider skipping it if that stuff is troubling to you.Next Season!!! It\u0027s time to learn what kind of madness we\u0027ll be getting up to in season 2! OMFG!!!",
      "release": "2021-04-15T00:00:00",
      "duration": "01:00:23.6270000",
      "explicit": true,
      "spotifyId": "7bLJBtQfQKR441wx1TthkM",
      "appleId": 1000517385925,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7bLJBtQfQKR441wx1TthkM",
        "apple": "https://podcasts.apple.com/podcast/episode-15-bonus-cults-n-capitalism-exercise-cults/id1546796793?i=1000517385925"
      }
    },
    {
      "id": "1de28541-fcc3-49ae-bdc6-61dbbc33e14c",
      "title": "Episode 14: SEASON ONE FINALE! Ivanwald, The Breatharians, and a Winner!",
      "description": "It\u0027s all come down to this, folks: After grueling weeks of intense research, our intrepid hosts take on the final four contestants and determine which cult is the cult for them! IT\u0027S REALLY HAPPENING!!!... After a reasonable discussion of two more cults, of course. Spoilers: Neither fucked-up Jesus Power Cult \u0022Ivanwald\u0022 or the alternating straight-up lies and batshit craziness of the Breatharians will be bursting into The Big Dance.",
      "release": "2021-04-08T00:00:00",
      "duration": "02:01:19.7770000",
      "explicit": true,
      "spotifyId": "7pR3yioQfWgnordjAhG6mk",
      "appleId": 1000516399648,
      "subjects": [
        "Inedia"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7pR3yioQfWgnordjAhG6mk",
        "apple": "https://podcasts.apple.com/podcast/episode-14-season-one-finale-ivanwald-the/id1546796793?i=1000516399648"
      }
    },
    {
      "id": "9000218f-c7a1-400b-bd6b-44fb0fd3111e",
      "title": "Episode 13: Wild Card Round!",
      "description": "As you might expect, we here at Madness Madness are constantly bombarded with fun, exciting, and horrific cult news at all hours of the day and night. We\u0027re picking it out of our hair; spooning particles of it off the surface of our morning coffee. And today we share some of that goodness with you! Join us for shorter-than usual discussions of Iglesia Maradoniana, Armstrong-ism, the GOP, the Silva Mind Control Method, and much more! Plus listener mail! Exclamation points! My god, the exclamation points.",
      "release": "2021-03-30T00:00:00",
      "duration": "02:06:21.3350000",
      "explicit": true,
      "spotifyId": "155ILcVJ5YU4ue77XaoY2y",
      "appleId": 1000515110561,
      "subjects": [
        "Cult Psychology",
        "Conscious Development of Body, Mind and Soul"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/155ILcVJ5YU4ue77XaoY2y",
        "apple": "https://podcasts.apple.com/podcast/episode-13-wild-card-round/id1546796793?i=1000515110561"
      }
    },
    {
      "id": "6ee5956a-dd01-44b5-a337-ec1118f937bc",
      "title": "Episode 12: Eckankar vs. Moral Re-Armament",
      "description": "Sometimes you have to look your former spiritual mentor in the eyes and say, \u0022Hey, buddy. I\u0027m thoroughly plagiarizing your work so I can make some cash off this cult. And that\u0027s OK.\u0022 Other times you have to sing over the Berlin Wall at an old East German woman who\u0027s been through both world wars about how you have to work hard for your freedom. It\u0027s a complicated life, this crazy ride we call a podcast. Join us, won\u0027t you?",
      "release": "2021-03-23T00:00:00",
      "duration": "02:21:45.8610000",
      "explicit": true,
      "spotifyId": "2rhlUdPx9NpeoeMBN0WPJ1",
      "appleId": 1000514122948,
      "subjects": [
        "Eckankar"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rhlUdPx9NpeoeMBN0WPJ1",
        "apple": "https://podcasts.apple.com/podcast/episode-12-eckankar-vs-moral-re-armament/id1546796793?i=1000514122948"
      }
    },
    {
      "id": "608f9457-ec96-44f4-b25e-fc9aa674cb08",
      "title": "Episode 11: The Sullivan Institute vs. Desteni",
      "description": "Picture it: It\u0027s the \u002770s, you live in New York, you like getting screamed at, and you\u0027re really into humpin\u0027. Bang! Welcome to the Sullivan Institute, pal! Or, alternately, picture it: It\u0027s the early 2000s, you\u0027re at your desk, and your three favorite things are incoherent garbage, constant antisemitism, and MDMA. Whoomp! There\u0027s your cult! It\u0027s Desteni, a spelling so stupid my keyboard caps keep coming off when I try to type it. Join us, won\u0027t you?",
      "release": "2021-03-16T00:00:00",
      "duration": "02:15:26.8760000",
      "explicit": true,
      "spotifyId": "421IwjTAa5U3YVZ9qh1VD4",
      "appleId": 1000513366457,
      "subjects": [
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/421IwjTAa5U3YVZ9qh1VD4",
        "apple": "https://podcasts.apple.com/podcast/episode-11-the-sullivan-institute-vs-desteni/id1546796793?i=1000513366457"
      }
    },
    {
      "id": "f89995d7-b766-4fa6-8f26-a915b6e4d600",
      "title": "Episode 10: Mankind United vs. EST",
      "description": "This week it\u0027s Mankind United, a cult whose story includes a startling refutation of Chekhov\u0027s Tiny Man With a Metal Head rule; and EST, whose story includes reinforcement of Chekhov\u0027s Confused Boomers Entering the \u002770s Rule. Join us as we sniff through these grifts, overturning numerous tidbits of knowledge like so many cult-researching truffle pigs.",
      "release": "2021-03-09T00:00:00",
      "duration": "02:26:11.4220000",
      "explicit": true,
      "spotifyId": "4v56MJH6HjKsWfzEWwllLn",
      "appleId": 1000512327268,
      "subjects": [
        "Erhard Seminars Training"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4v56MJH6HjKsWfzEWwllLn",
        "apple": "https://podcasts.apple.com/podcast/episode-10-mankind-united-vs-est/id1546796793?i=1000512327268"
      }
    },
    {
      "id": "71837f39-11ba-4b7d-9f29-29df7cc82dad",
      "title": "Episode 9: Raelians vs. Kenja",
      "description": "France! Australia! Oy! Hon hon! Today we go deep—down under, even—into the Raelians, France and French Canada\u0027s clone-happy UFO booster club, and see if it\u0027s a better fit for us than Kenja, Australia\u0027s sorta home-grown, sorta ripped off from Scientology cash vacuum. Raelism (not realism) is, at the very least, a cult where you\u0027re less likely to be burned to death for the knights templar than France\u0027s other entry into the series. Kenja, meanwhile, may have out-Scientologied Scientology in a few key respects. Join us for bad accents, at least one suppressive person, and the gripping origin story of Corn Thins.",
      "release": "2021-03-02T00:00:00",
      "duration": "02:18:30.8830000",
      "explicit": true,
      "spotifyId": "3mlfMSN1IXqrWwy13dCRHX",
      "appleId": 1000511339346,
      "subjects": [
        "Raëlism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mlfMSN1IXqrWwy13dCRHX",
        "apple": "https://podcasts.apple.com/podcast/episode-9-raelians-vs-kenja/id1546796793?i=1000511339346"
      }
    },
    {
      "id": "d4304d5c-f14b-474c-95f2-71cc8d7df4b8",
      "title": "Episode 8: The Moonies vs. Falun Gong",
      "description": "Stadiumwide mass weddings! Questionable claims about organ harvesting! Richard Nixon! Al Haig! SHEN YUN!!! This episode\u0027s got it all, folks. The Rev. Sun Myung Moon and his absolutely third-grade-boy ideas about gay people fight for the elite eight against Falun Going, a relative newcomer with an omnipresent troupe of acrobats and a massive compound in the U.S. that you are not invited to. Also we would like to go on record as saying that this matchup was 100% picked by the automatic bracket creator, and that we didn\u0027t just throw the two Asian cults in a ring to duke it out.",
      "release": "2021-02-23T00:00:00",
      "duration": "02:01:58.2040000",
      "explicit": true,
      "spotifyId": "5BWGJTH1dnTKz44GaprVqg",
      "appleId": 1000510368811,
      "subjects": [
        "Unification Church",
        "Falun Gong"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5BWGJTH1dnTKz44GaprVqg",
        "apple": "https://podcasts.apple.com/podcast/episode-8-the-moonies-vs-falun-gong/id1546796793?i=1000510368811"
      }
    },
    {
      "id": "34e375e3-74dd-4f48-89fd-5f38d1105df7",
      "title": "Episode 7: The Solar Temple vs. Tony and Susan Alamo",
      "description": "CONTENT WARNING: The story of Tony Alamo contains details of child abuse awful enough to inspire a person to dig up Tony Alamo\u0027s body and beat the shit out of it.The Solar Temple got pretty goddamn lucky when the randomizer put it up against Tony Alamo, let me tell you. But it does have some stuff going for it: Champagne! The Swiss Alps! Grail holograms! Arson! Meanwhile, Tony Alamo makes the impossible possible by making Susan Alamo look like Mother Teresa by comparison. Seriously. We knew Tony Alamo was a piece of shit but we had no idea how bad it was. Onward!",
      "release": "2021-02-16T00:00:00",
      "duration": "02:10:24.7180000",
      "explicit": true,
      "spotifyId": "65BfVkN0efEBYJ1FM9eBXm",
      "appleId": 1000509579475,
      "subjects": [
        "Alamo Christian Foundation",
        "Order of the Solar Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/65BfVkN0efEBYJ1FM9eBXm",
        "apple": "https://podcasts.apple.com/podcast/episode-7-the-solar-temple-vs-tony-and-susan-alamo/id1546796793?i=1000509579475"
      }
    },
    {
      "id": "cb3eaf38-7cfe-4e22-aebf-ef1ebe5f366a",
      "title": "Episode 6: UNARIUS vs. \u0022Teal Swan\u0022",
      "description": "We had plans, you see, to talk this week about the Children of God and Aleister Crowley\u0027s religion of Thelema. These cults turned out to be, respectively, far too awful and nowhere near awful enough to talk about for even part of a podcast. So we got way better cults! This week: The charmingly earnest weirdos of UNARIUS square off against the social media influencer who is totally not a cult leader you guys, \u0022Teal Swan.\u0022 Teal Swan is in quotes for the same reason we spell out Nexium how it sounds.* In advance: You are welcome for the last-minute reschedule, folks, \u0027cause this one is a hoot and a holler. Yay!* because it\u0027s dumb",
      "release": "2021-02-09T00:00:00",
      "duration": "01:52:28.0030000",
      "explicit": true,
      "spotifyId": "08vcEvFVEXEVinyQV9WGLh",
      "appleId": 1000508474244,
      "subjects": [
        "Teal Swan",
        "Unarius Academy of Science"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/08vcEvFVEXEVinyQV9WGLh",
        "apple": "https://podcasts.apple.com/podcast/episode-6-unarius-vs-teal-swan/id1546796793?i=1000508474244"
      }
    },
    {
      "id": "b026940f-d674-43d9-bc61-795694cc8a91",
      "title": "Episode 5: The Source Family vs. Buddhafield",
      "description": "Having your own cult is about not having to decide between being a wildly successful health-food restaurant pioneer or being White Human Man God. Or between telling your gaggle of model-like Californians that sex is ridiculous while also ... uh, look, no spoilers, but the dude pushing that notion may actually have had sex.The Source Family was a foundational southern California \u002760s cult; Bhuddafield was, 20 years later ... another southern California cult. They go head to head in today\u0027s episode, which includes togas, the Dorothy Chandler family mansion, something like 13 albums of psychedelia, budgie-smugglers, professional videographers, and paying a dude $50 to gently poke you in the eyes. It is yet another banger of an episode in what has become a nonstop series of bangers. Let\u0027s go!",
      "release": "2021-02-02T00:00:00",
      "duration": "01:58:40.0910000",
      "explicit": true,
      "spotifyId": "3hNEIOpjgzRbtseiNf5xGS",
      "appleId": 1000507560130,
      "subjects": [
        "The Source Family",
        "Buddhafield"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3hNEIOpjgzRbtseiNf5xGS",
        "apple": "https://podcasts.apple.com/podcast/episode-5-the-source-family-vs-buddhafield/id1546796793?i=1000507560130"
      }
    },
    {
      "id": "dc4638ae-cb29-43da-b5b7-81ae0cebb873",
      "title": "Episode 4: Heaven\u0027s Gate vs. Bhagwan Shree Rajneesh",
      "description": "At some point in their lives, everyone ends up asking themselves \u0022Do I wear robes often enough? And should they be maroon? And why are all these pancakes different sizes? What the hell, Self!\u0022 Bearing that in mind, there is a 100 percent chance you\u0027ll find something relatable in this episode, when we compare weirdly touching space Jesus suicide cult Heaven\u0027s Gate to the salad bar-poisoning, small town-overtaking cult of the off-putting libertarian materialist Bhagwan Shree Rajneesh. Come for the weirdly specific breakfast specifications! Stay for some deeply selfish ideas about what your kids can do while you go to group screeching-and-humping therapy! ",
      "release": "2021-01-26T00:00:00",
      "duration": "02:03:48.3880000",
      "explicit": true,
      "spotifyId": "0L8odg96HZXJtEvVmXfBgb",
      "appleId": 1000506707499,
      "subjects": [
        "Bhagwan Shree Rajneesh",
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0L8odg96HZXJtEvVmXfBgb",
        "apple": "https://podcasts.apple.com/podcast/episode-4-heavens-gate-vs-bhagwan-shree-rajneesh/id1546796793?i=1000506707499"
      }
    },
    {
      "id": "97aaf5ac-c631-4b55-8cae-0425e1f8e781",
      "title": "Episode 3: Scientology vs. The Center for the Conscious Development of Body, Mind, and Spirit",
      "description": "Some people like their cults real big and real ugly, and those people can fuck off! Hahaha, just not kidding. It’s the big one this week, folks. Scientology. The brain fart of L. Ron Hubbard, a man whose writing ability was only eclipsed by his Navy career, this multibillion-dollar jargon cesspit may finally answer the question: “What if I could be surrounded by insufferable batshit narcissists *and* bankrupt myself in the process?” The pile of elephant shit in the room goes head to head with a frankly quite refreshing little cult born from the visions of Terri Hoffman, a woman who refused to let the Dallas suburbs keep her from fighting creatures who weren’t there and protecting the government of Peru: The Center for the Conscious Development of Body, Mind, and Spirit. Got a lot on our plate here, folks. Get comfortable.",
      "release": "2021-01-19T00:00:00",
      "duration": "02:10:32.6850000",
      "explicit": true,
      "spotifyId": "66xHg2tHzmYj9R4PUthOjl",
      "appleId": 1000505971376,
      "subjects": [
        "Conscious Development of Body, Mind and Soul",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/66xHg2tHzmYj9R4PUthOjl",
        "apple": "https://podcasts.apple.com/podcast/episode-3-scientology-vs-the-center-for-the/id1546796793?i=1000505971376"
      }
    },
    {
      "id": "28bf9827-942c-46b7-8016-8cbfb378aadb",
      "title": "Episode 2: Synanon vs. NXIVM (Nexium)",
      "description": "Sometimes your cult leader is a recovering drunk who\u0027s super into LSD. Sometimes he\u0027s a twerpy little sex pest coasting on a middle-school judo championship and a good result on an OMNI Magazine IQ test. And since we\u0027re all about making choices here, it\u0027s time to dig into both these weirdos and the cults they founded. This week\u0027s cults: Synanon, a rehab-turned-shaved-heads-and-overalls joint in California, and Nexium, a pyramid scheme-turned-Adult-Friend-Finding service which is supposed to be spelled NXIVM but we\u0027re not doing that because it\u0027s fucking stupid. THERE CAN BE ONLY ONE!",
      "release": "2021-01-07T00:00:00",
      "duration": "01:58:27.9960000",
      "explicit": true,
      "spotifyId": "0hf3Vcft1Ix1bZVf4R9MYz",
      "appleId": 1000504684053,
      "subjects": [
        "NXIVM",
        "Synanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hf3Vcft1Ix1bZVf4R9MYz",
        "apple": "https://podcasts.apple.com/podcast/episode-2-synanon-vs-nxivm-nexium/id1546796793?i=1000504684053"
      }
    },
    {
      "id": "9391fd52-a0de-4945-9c1d-cfc6d226da68",
      "title": "Episode 1: Krishna Consciousness vs. the FLDS",
      "description": "Yogurt rivers? Forfeiture of property rights? Why not both? \u0027Cuz that\u0027s not what this show\u0027s about! Our first episode pits the Temple of Krishna Consciousness (the Hare Krishnas) against the Fundamentalist Church of Jesus Christ of Latter-Day Saints (FLDS) (the ones that still do polygamy). Turns out both groups are appropriated versions of existing religions! Who could have foreseen this? It\u0027s apricot body wraps vs. denim prairie skirts in this battle for the ages!",
      "release": "2020-12-29T00:00:00",
      "duration": "01:35:06.3700000",
      "explicit": true,
      "spotifyId": "4tVjPlX7psnYQSZnfsEkHV",
      "appleId": 1000503838065,
      "subjects": [
        "FLDS Church",
        "Hare Krishnas"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4tVjPlX7psnYQSZnfsEkHV",
        "apple": "https://podcasts.apple.com/podcast/episode-1-krishna-consciousness-vs-the-flds/id1546796793?i=1000503838065"
      }
    }
  ]
}