{
  "_ts": 0,
  "id": "5323def9-6c00-457f-a910-59998eaf81b1",
  "name": "Maka Chosen",
  "youTubeChannelId": "UCR-aGMiL42F2b-E-8DCp-og",
  "episodes": [
    {
      "id": "c8bbc445-cc8c-4061-9f4a-93f7e3119c24",
      "title": "Part 3 Exposing A New Morden Cult in Ireland \u0026 New Zealand",
      "description": "This video goes into detail of what the cult was and how it was formed. \n\nIf you are a christian please be aware of people and the messages they claim to have been told by God. Build you own independent relationship with God, so that when people come you can tell whether they are form God or not. \n\nThis message is being shared to prevent more people from listening to the false message these women claim to have and  because these women are creating an idol posing as God, when in reality this has nothing to do with God - her teaching drive you away from God.",
      "release": "2025-04-15T02:01:43Z",
      "duration": "00:52:21",
      "explicit": false,
      "youTubeId": "WJ7AbFMjJtk",
      "subjects": [
        "_Ireland"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WJ7AbFMjJtk"
      }
    },
    {
      "id": "4ed68b12-d9bf-4971-812d-0ecea4796924",
      "title": "Part 1 \u0026 2  Exposing A New Morden Cult in Ireland \u0026 New Zealand | Background Stories",
      "description": "This video explains our background stories and how this made us more susceptible being used and lied to like we did. PLEASE if you experience a childhood trauma that you ignored or that adult ignored, take the time to heal and understand your trauma and how that can leave you vulnerable to certain attacks from others and the enemy. \n\nUnderstand how your body can react to trauma, for example for Maka her body lost memory off it, and her memory started resurfacing in her early 20s as a result of the adults around her not taking action. For Trish, her trauma a was suppressed also by her parent which led her to believe it was normal behaviour. \n\nThis messaged is being shared out the conviction I has from God to share it because these woman are creating an idol posing as God, when in reality this has nothing to do with God - her teaching drive you away from God.",
      "release": "2025-04-13T23:06:26Z",
      "duration": "00:31:55",
      "explicit": false,
      "youTubeId": "BXWkIf78URI",
      "subjects": [
        "_Ireland"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BXWkIf78URI"
      }
    }
  ]
}