{
  "id": "40288c50-ae73-4f97-91d1-4fe759ce8a64",
  "name": "Makes Sense - with Dr. JC Doornick",
  "spotifyId": "1WHfKWDDReMtrGFz4kkZs9",
  "appleId": 1730954168,
  "youTubeChannelId": "UCr1mf2qnzENRxhiH4H3Be1A",
  "episodes": [
    {
      "id": "49d2e8b5-14e6-484a-add4-c1c75d552d6c",
      "title": "THEY’RE CONTROLLING YOU - The Cult We’re All In: The Invisible Science of Social Control with Georgia Clare -  Episode 139",
      "description": "We all like to believe we think for ourselves, but what if our most deeply held beliefs were actually engineered through social pressure and moral conditioning? The Cult We’re All In explores the invisible science of belief and how high-control groups recruit and sustain members through psychological social proof. Using Georgia Clare’s lived experience of escaping a structured religious organization as a lens, we pull back the curtain on the \u0022cults\u0022 of modern society—from corporate culture to political echo chambers. This conversation isn\u0027t just about religion; it’s about the science of why leaving a group feels like losing your identity and how to rebuild yourself from the ground up after waking up to the truth. Connect with Georgia: ► Substack: / @georgiaclare ► Website: / www.georgiaclare.com ► IG: / Georgiaclare75 Follow Dr. JC Doornick and the Makes Sense Academy:► Makes Sense Substack - https://drjcdoornick.substack.com ► Instagram: / drjcdoornick ►Facebook: / makessensepodcast ►YouTube: / drjcdoornick MAKES SENSE PODCAST Welcome to the Makes Sense with Dr. JC Doornick Podcast. This podcast explores topics that expand human consciousness and enhance performance. On the Makes Sense Podcast, we acknowledge that it\u0027s who you are that determines how well what you do works, and that perception is subjective and an acquired taste. When you change the way you look at things, the things you look at begin to change. Welcome to the uprising of the sleepwalking masses. Welcome to the Makes Sense with Dr. JC Doornick Podcast. SUBSCRIBE/RATE/REVIEW \u0026 SHARE our new podcast. FOLLOW Podcast: You will find a \u0022Follow\u0022 button in the top right. This will enable the podcast software to alert you when a new episode launches each week. Apple: https://podcasts.apple.com/ca/podcast/makes-sense-with-dr-jc-doornick/id1730954168 Spotify: https://open.spotify.com/show/1WHfKWDDReMtrGFz4kkZs9?si=003780ca147c4aec Podcast Affiliates: Kwik Learning: Many people ask me where I get all these topics, which I\u0027ve been covering for almost 15 years. I have learned to read nearly four times faster and retain information 10 times better with Kwik Learning. Learn how to learn and earn with Jim Kwik. Get his program at a special discount here: https://jimkwik.com/dragon OUR SPONSORS: Makes Sense Academy: A private mastermind and psychologically safe environment full of the Mindset and Action steps that will help you begin to thrive. The Makes Sense Academy. https://www.skool.com/makes-sense-academy/about The Sati Experience: A retreat designed for the married couple that truly loves one another, yet wants to take their love to that higher magical level. Relax, reestablish, and renew your love at the Sati Experience. https://www.satiexperience.com 0:00 - Intro 1:07 - Welcome, Georgia Clare 2:51 - How did you become a member of the Jehovah\u0027s Witnesses 7:32 - The stages of building a cult. - How did you get out? 16:24 - Sin and bringing Reproach to Jehovah? 18:01 - Reaching the top of the organization and seeing what\u0027s really going on 27:21 - Paying the penalty of leaving a controlled environment. 31:30 - Do you ever truly shed your old belief system? 36:09 - How do you define freedom these days? 39:05 - A new definition for CULT-URE 41:39 - How is the world we live in any different from the Jehovah’s Witness Hosted by Simplecast, an AdsWizz company. See pcm.adswizz.com for information about our collection and use of personal data for advertising.",
      "release": "2026-01-27T12:00:00Z",
      "duration": "00:48:55.6400000",
      "explicit": true,
      "spotifyId": "5LuTxXuuLXZ7i8v7CslKSp",
      "appleId": 1000746844894,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5LuTxXuuLXZ7i8v7CslKSp",
        "apple": "https://podcasts.apple.com/podcast/theyre-controlling-you-the-cult-were-all-in-the/id1730954168?i=1000746844894"
      }
    }
  ]
}