{
  "id": "9c90ddfc-406e-4415-a200-13e5ddf7b52d",
  "name": "Make More Love",
  "spotifyId": "2IAgELXMgyACdBveB27rx5",
  "appleId": 1721200501,
  "episodes": [
    {
      "id": "ad8d09d5-5801-468a-93cd-6be252232110",
      "title": "50: Love, Money, and Self-Knowledge in Relationships — with Manny Wolfe (part 2)",
      "description": "In the second part of this deeply personal interview, Ellen breaks down the real-life lessons behind Manny Wolfe’s extraordinary story — from surviving a cult to confronting addiction and rebuilding his life. But this episode isn’t just about extreme experiences. If you\u0027re a business owner/entrepreneur trying to understand the connections between love, money, and self-knowledge, this episode will speak directly to your experience. Ellen draws a direct line from Manny’s journey to the everyday challenges faced by high-performing men in relationships: solving the wrong problems, falling short of your own values, and overthinking instead of taking meaningful action. Whether you\u0027re struggling with relationship stress, emotional disconnection, or the pressure to succeed, this conversation offers raw insights and practical takeaways for creating a stronger, more connected partnership. Part 1: Fixing the Wrong Problem Manny and Ellen explore how high-performing men often try to solve relationship challenges by focusing on business success. They unpack the common trap of doubling down on work instead of addressing what your partner truly needs — presence, emotional connection, and attention. Part 2: Honor, Integrity, and Self-Respect This section dives into the idea of the “moral man” — the part of yourself that knows what’s right but can’t always stop you from making poor choices. It breaks down the ways men unintentionally betray their own code of honor in relationships, and how that damages both the partnership and their self-worth. Part 3: Overthinking vs. Action Manny shares how personal growth work and spiritual reflection became a way of hiding from real-world change. They discuss the pattern of analysis paralysis. They discuss how to catch yourself when it\u0027s time to stop reflecting and start doing. Key Takeaways: Misplaced effort is common: Like many men, Manny tried to fix his relationship by making more money — but that didn’t meet his partner’s real needs. Integrity matters: If you repeatedly act out of alignment with your values — through cheating, disrespect, emotional neglect, or passive-aggressive language — you’re not just damaging your relationship; you’re eroding your self-worth. Overthinking is a trap: There’s a fine line between spiritual growth and navel-gazing. Sometimes the most powerful move is to knock that shit off and just do what needs doing. Money isn’t evil — or magic: It\u0027s a neutral tool that can amplify your character. If you believe it’s bad or unimportant, you may unconsciously sabotage yourself and your relationship. Relationships are growth containers: They’re not just about comfort — they’re where you confront your deepest patterns and either grow or stagnate. Call to Action: If Manny’s story made you reflect on your own situation — maybe it’s time for a conversation. Book a free Relationship Reset Call with Ellen and get clarity on your next step. It’s 15 minutes, one-on-one, and focused on solutions. Head to relationshipresetcall.com and grab your spot. Closing Thoughts: There’s real value in hearing another man’s story — not to compare, but to connect. You may not have grown up in a cult or battled the same demons Manny did, but I bet something in his story landed with you. Maybe it mirrored a quiet part of your own experience — a time you ignored your gut, broke your own code, or kept thinking about taking action instead of actually doing it. That’s why I share these conversations. Not because they’re dramatic, but because they’re true. And in that truth, there’s insight — the kind that can move you forward. Let this be more than just something interesting you heard today. Let it be a reason to stop and ask yourself what part of your life is ready for change. Support \u0026 Resources: Ellen invites listeners to share their thoughts, either in the P3 Insider\u0027s Community or directly with her via email. Or, for one on one brainstorming on a specific situation, listeners can set up a time on Ellen\u0027s Calendar for a free Relationship Reset Call. All links can be found below. \u0022Until next time, remember, \u0027What I want most in the world is for you to Make More Love in Your Life and with Your Wife.\u0027\u0022 - Ellen Dorian Disclaimer: The Make More Love show is for information and entertainment purposes only, and reflects the personal opinions and experiences of the host and guests. It is not a substitute for professional advice or guidance in specific situations. \u0026#xfeff; Make More Love Show Website: www.makemorelove.show Parent Company: The Passionate Partners Project: www.passionatepartnersproject.com Join Our Passionate Partners Insider Community: https://www.facebook.com/groups/682764239165105 Contact Me Directly: Email: ellen@passionatepartnersproject.com Or direct message me via social media: Facebook: https://www.facebook.com/ellen.dorian.7/ LinkedIn: https://www.linkedin.com/in/ellendorian/ Or set up a Free Relationship Reset Call with me here: relationshipresetcall.com Read Manny\u0027s Book! The Tao of the Unbreakable Man",
      "release": "2025-04-10T13:00:00Z",
      "duration": "00:29:08",
      "explicit": false,
      "spotifyId": "0WFueBvLR7gh715kZMYeW4",
      "appleId": 1000703023060,
      "subjects": [
        "One-on-one",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0WFueBvLR7gh715kZMYeW4",
        "apple": "https://podcasts.apple.com/podcast/50-love-money-and-self-knowledge-in-relationships/id1721200501?i=1000703023060"
      }
    },
    {
      "id": "090f887d-3b08-459b-938b-02aabdd933c7",
      "title": "49: Endless Loops: When Your Relationship Feels Like Groundhog Day (with Manny Wolfe – Part 1)",
      "description": "In this first part of a two-part conversation, Ellen Dorian sits down with speaker, author, and coach Manny Wolfe to explore how early life experiences, unresolved trauma, and subconscious patterns can trap us in relationship dynamics that feel like endless loops. From cult survival to addiction recovery, Manny brings raw honesty and deeply reflective insight into how our past silently shapes our present — especially in love. This episode offers a candid look at how personal responsibility, emotional awareness, and a willingness to “do the work” can help us break those loops, even when the outcome is still uncertain. Part 1: Manny shares his upbringing in a cult, how that shaped his sense of identity and attachment, and how unresolved abandonment trauma created patterns in romantic relationships. Ellen and Manny unpack the way avoidant and anxious attachment styles often magnetize each other, and why so many of us unconsciously recreate the very pain we say we want to avoid. Part 2: They explore the story behind Manny’s viral post on the link between financial stress and relationship breakdown — and how some spiritual and psychological narratives can accidentally become excuses for avoiding action. Part 3: The conversation shifts toward taking full responsibility — not just for your healing, but for your choices. Manny shares the moment he realized that his “abandonment wound” might have been a red herring, distracting him from deeper, more practical issues. Together, they highlight how emotional insight and grounded strategy need to work together — not in opposition. Key Takeaways: Relationship patterns often trace back to unconscious childhood beliefs and unprocessed trauma. Avoidant and anxious attachment styles often attract each other — creating a painful but familiar dynamic. Financial issues are rarely just about money — but they\u0027re also not always about deep trauma. Healing is essential, but it’s not a substitute for taking real-world action. Long-term relationships are containers for growth — not just safe harbors. You can\u0027t force someone else to change, but you can be an influence and an inspiration. Call to Action: If this conversation struck a chord and you\u0027re ready to break your own loop — whether it’s emotional, financial, or relational — set up your free Relationship Reset Call with Ellen. In just 15 minutes, you’ll clarify your next move and leave with actionable steps that fit your real life. \u0026#x1f5d3;️ Book now at: relationshipresetcall.com Closing Thoughts: Your past may explain your patterns — but it doesn’t have to dictate your future. When you see the loop, you can step outside it. And when you take personal responsibility, you stop waiting to be rescued and start building the love you actually want. Support \u0026 Resources: Ellen invites listeners to share their thoughts, either in the P3 Insider\u0027s Community or directly with her via email. Or, for one-on-one brainstorming on a specific situation, listeners can set up a time on Ellen\u0027s Calendar for a free Relationship Reset Call. All links can be found below. \u0022Until next time, remember, \u0027What I want most in the world is for you to Make More Love in Your Life and with Your Wife.\u0027\u0022 — Ellen Dorian Disclaimer: The Make More Love show is for information and entertainment purposes only and reflects the personal opinions and experiences of the host and guests. It is not a substitute for professional advice or guidance in specific situations. \u0026#xfeff; Make More Love Show Website: www.makemorelove.show Parent Company: The Passionate Partners Project: www.passionatepartnersproject.com Join Our Passionate Partners Insider Community: https://www.facebook.com/groups/682764239165105 Contact Me Directly: Email: ellen@passionatepartnersproject.com Or direct message me via social media: Facebook: https://www.facebook.com/ellen.dorian.7/ LinkedIn: https://www.linkedin.com/in/ellendorian/ Or set up a Free Relationship Reset Call with me here: relationshipresetcall.com Read Manny\u0027s Book! The Tao of the Unbreakable Man",
      "release": "2025-04-03T13:00:00Z",
      "duration": "00:39:22.2000000",
      "explicit": false,
      "spotifyId": "3RhvjJCkqkncpHsxNlA4Sl",
      "appleId": 1000702052147,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3RhvjJCkqkncpHsxNlA4Sl",
        "apple": "https://podcasts.apple.com/podcast/49-endless-loops-when-your-relationship-feels-like/id1721200501?i=1000702052147"
      }
    }
  ]
}