{
  "_ts": 0,
  "id": "17cfd4d5-f47c-4a6d-8d2b-088cc09bb515",
  "name": "Mamamia Out Loud",
  "spotifyId": "7dPYxszTS36t2he9P9Jmcj",
  "appleId": 928350893,
  "episodes": [
    {
      "id": "e3d62b05-63e3-4b91-8021-db992a89956d",
      "title": "The Woman No One Wants To Hear From At A Dinner Party",
      "description": "Subscribe to Mamamia The burden of caring for babies, sick friends and elderly parents - is it time to recast care work as a privilege? We discuss why women often find themselves in caring roles and how society really values it (or not). Plus, our weekly recommendations which include two things to watch and one thing to listen to all weekend. And, our bests and worsts including a special exemption from talking about news, wholesome family fun in the Freedman house and a night out at the greatest show in the world. END BITS: Enter Lazy Gewl Giveaways here! Use code VACAY20 for 20% off a yearly subscription. What To Listen To Next: Listen to our latest episode: Listener Dilemma: Escort On A Bucks Night Listen: Ben Is The Most Newly Divorced Man You\u0027ve Ever Seen Listen: Unpacking The Olympic Boxing Gender Panic Listen to Holly on Mid: From No Sex To Best Sex At 49 Listen to Mid: The Cure For Burn-Out Is Cooked Listen to Mia on No Filter: Tia Levings Escaped A Trad Wife Cult And: Part Two: Tia Levings Escaped a Trad Wife Cult Connect your subscription to Apple Podcasts Sign up to the Mamamia Out Loud Newsletter for all our recommendations and behind-the-scenes content in one place. Want to try our new exercise app? Click here to start a seven-day free trial of MOVE by Mamamia What To Read: Read: \u0027I\u0027m in a mixed phone relationship and it\u0027s ruining my life.\u0027 Read: \u0027 We asked women about the mental load of caring. Their answers were overwhelming. GET IN TOUCH: Feedback? We’re listening. Send us an email at outloud@mamamia.com.au Share your story, feedback, or dilemma! Send us a voice message Join our Facebook group Mamamia Outlouders to talk about the show. Follow us on Instagram @mamamiaoutloud CREDITS: Hosts: Holly Wainwright, Mia Freedman \u0026 Jessie Stephens Producer: Emeline Gazilas Audio Production: Leah Porges Mamamia acknowledges the Traditional Owners of the Land we have recorded this podcast on, the Gadigal people of the Eora Nation. We pay our respects to their Elders past and present, and extend that respect to all Aboriginal and Torres Strait Islander cultures.",
      "release": "2024-08-09T06:40:00Z",
      "duration": "00:51:54.7360000",
      "explicit": false,
      "spotifyId": "41My9I3QNuK1QGzfYl6sSU",
      "appleId": 1000664797304,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/41My9I3QNuK1QGzfYl6sSU",
        "apple": "https://podcasts.apple.com/podcast/the-woman-no-one-wants-to-hear-from-at-a-dinner-party/id928350893?i=1000664797304"
      }
    }
  ]
}