{
  "_ts": 0,
  "id": "9e121bcd-92af-4bb2-8aee-c6b6cfa99deb",
  "name": "Mandy Reborn",
  "youTubeChannelId": "UCPyEtM0xTEoC1MqSNCM5xYg",
  "episodes": [
    {
      "id": "64136dc3-c57a-44b2-82e2-d9be8ba6f07b",
      "title": "Chased Outta the Cult: Episode 2 | Positives of Cult Life,Divine Encounter, Future Cult Leader Plans",
      "description": "In Episode 2, we explore the good (yes, there were a few positives!) and the downright bizarre lessons I learned while in the cult. Ever thought a power outage was your fault? Welcome to my life back then! Now I’m free and introspective but still can’t help wondering… what if I started my own nice cult, with perks like paid labour and Japanese toilets? 😏\n\nI also break down the sheer incompetence of cult leaders—why isn’t there a training program for them? They’re basically the best illusionists in the world, managing to make you feel both superior and worthless at the same time. That’s some next-level magic! 🎩✨\n\nOh, and did I mention I didn’t leave the cult? I got chased out! Turns out, I was delaying my career… who knew comedy was so important to the Almighty? Guess who’s chosen now? 🤣\n\nTune in for more laughs, cult confessions, and a wild mix of dark humour and truth!\n\n👉 Don’t forget to like, subscribe, and hit the notification bell for Episode 3\n\nChapters:\n\n00:00 - The Positives of Cult Life (Yes, Really)\n00:21 - Introspective thinking \n00:36 - Starting My Own (Nice) Cult\n00:50 - Cult Leaders Need a Training Program!\n01:24 - Cult leaders are the best illusionist \n02:00 - Kicked out of a Cult \n02:29 - Divine Encounter: Why I Got Chased Out\n03:11 - Iyanla fix my life\n\n#ChasedOuttaTheCult #CultSurvivor #ComedyConfessions #CultLife #DarkHumour #CultEscape #DivineComedy #StandUpComedy #RelatableComedy #PharaohsChosen #BizarreTruth #CultLeaders #ComedyInHeaven #CultIllusions\n#comedy #cultsurvivor #darkhu",
      "release": "2024-10-16T21:25:39Z",
      "duration": "00:03:25",
      "explicit": false,
      "youTubeId": "6jyNirZ5Qco",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6jyNirZ5Qco"
      }
    },
    {
      "id": "5b37ba0a-3006-4b1c-b111-db44f692379e",
      "title": "Chased Outta The Cult |From Worship to WTF – Cult Survivor Comedy|Suing Cults In America|episode 1",
      "description": "Cult survivor, comedy special, cult awareness, Chased Outta the Cult, Mandy Reborn, WTF moments, religious satire, funny cult stories, ex-cult member, sit-up comedy, stand-up comedy, suing cults America, brainwashed\n \nWelcome to the first episode of \u0027Chased Outta the Cult\u0027!\nIn this sit-up comedy special,I will take you on a hilarious yet eye-opening journey through my experiences of surviving not one, but TWO cults.From the strange rituals to the unbelievable rules. if you\u0027ve ever thought cults should be illegal, you’re in the right place. \nIn this episode, titled \u0027From Worship to WTF\u0027,I reflect on how I went from a devoted cult member to stand-up comic. If you love cult awareness, comedy, and real-life survivor stories, hit the subscribe button and turn on notifications for more! \nEpisode 2: Coming Soon\n\nFOLLOW ME ON SOCIAL\nInstagram: @MandyReborn \nTikTok: @Mandy.Reborn\nFacebook: Mandy Reborn\nX : MandyReborn",
      "release": "2024-09-23T18:10:18Z",
      "duration": "00:05:00",
      "explicit": false,
      "youTubeId": "De1zlD291Qg",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=De1zlD291Qg"
      }
    }
  ]
}