{
  "id": "fcee5394-9372-4b4f-8678-996fb0d83099",
  "name": "Mark Groves",
  "spotifyId": "5se5aQBcki87JV3zo1RYSi",
  "appleId": 1282044290,
  "youTubeChannelId": "UClgLCOnztdrdu6qAOH-PVdA",
  "episodes": [
    {
      "id": "6af40488-27ff-4717-b29b-26e5b8305a28",
      "title": "Don\u0027t Get Trapped in Cult Mentality and Stop Over Identifying with Pain",
      "description": "Why do we get stuck in life and how do trauma and our mental health narratives play into that? In this thought-provoking conversation with neuropsychotherapist, Britt Frank, we explore the nuances of trauma, mental health labels, and the personal responsibility often overlooked in modern therapeutic discussions. Britt shares insights from her own experiences, diving deep into how trauma is often misunderstood or misdiagnosed, and how this affects our ability to heal and grow. Together we challenge the popular notion of trauma as an all-encompassing explanation for struggle and instead encourage an approach that blends empathy with accountability. From societal trends to gender identity, we tackle tough topics, making this episode a must-listen for anyone interested in navigating the complexities of human behavior and finding greater personal agency.\n\nBritt Frank, LSCSW, SEP is a licensed neuropsychotherapist and author of The Science of Stuck (Penguin Random House), named by SHRM, Esquire, New York Magazine, and The Next Big Idea Club as a must-read. Britt received her undergraduate degree from Duke University and her master\u0027s degree from the University of Kansas, where she later became an award-winning adjunct instructor. Britt is a contributing writer to Psychology Today and her work has been featured in Forbes, NPR, The New York Times, Fast Company, Psych Central, SELF, and Thrive Global.\n\n-Britt\u0027s Instagram: https://www.instagram.com/brittfrank/ \n-Britt\u0027s Website: https://www.scienceofstuck.com/ \n-Britt\u0027s Book: https://www.scienceofstuck.com/book \n-Britt\u0027s Previous Podcast Episode: You\u0027re Not Broken, You\u0027re Just Stuck: https://markgroves.com/episode/youre-not-broken-youre-just-stuck-with-britt-frank/ \n\nResources From the Episode:\n\n-Still Face Experiment: https://youtu.be/vmE3NfB_HhE?si=QivHWP9_jREexK3s\u0026t=34 \n-Greg Lukianoff\u0027s Book: The Canceling of the American Mind: Cancel Culture Undermines Trust and Threatens Us All―But There Is a Solution: https://amzn.to/3XDayrT\n-Sarah Baldwin Podcast Episodes:\nHow to Somatically Rewire Your Past to Create Secure Attachment with Sarah Baldwin: https://markgroves.com/episode/how-to-somatically-rewire-your-past-to-create-secure-attachment-with-sarah-baldwin/ \nThe Attachment Theory \u0026 Nervous System Connection with Sarah Baldwin: https://markgroves.com/episode/the-attachment-theory-nervous-system-connection-with-sarah-baldwin/ \nThe Nervous System Explained with Sarah Baldwin: https://markgroves.com/episode/the-nervous-system-explained-with-sarah-baldwin/ \n\n\nIf you want to dive deeper into Mark\u0027s content, search through every episode, find specific topics we\u0027ve covered, and ask him questions, go to his Dexa page: https://dexa.ai/markgroves\n\n\nThemes: Trauma Healing, Mental Health Awareness, Britt Frank Interview, The Science of Stuck, Trauma vs Pathology, Overcoming Trauma, Personal Accountability in Therapy, Mental Health Labels, Gender Identity and Mental Health, Neuropsychotherapy Insights, Healing Childhood Trauma, Social Media and Mental Health, Trauma and Responsibility, Emotional Healing Journey, Navigating Gender Dysphoria, Trauma-Informed Therapy, Personal Growth Strategies, Breaking Free from Trauma, Healing and Accountability, Curiosity and Personal Growth\n\n\n0:00:00 Intro\n0:01:49 The Science of Stuck\n0:05:35 Understanding Attachment and Multiplicity\n0:08:46 Britt\u0027s Journey to Becoming a Therapist\n0:13:05 The Mental Health Crisis Post Pandemic\n0:15:49 The Role of Labels in Mental Health\n0:17:17 The Impact of Social Media on Well-Being\n0:20:07 Navigating Ideological Division\n0:28:04 The Complexity of Trauma and Identity\n0:35:18 The Role of Choice in Personal Growth\n0:41:19 Understanding Triggers and Their Purpose\n0:46:53 The Intersection of Trauma and Gender Dysphoria\n0:55:38 Finding a Path to Compassionate Dialogue\n1:02:35 The Role of Curiosity in Healing\n1:18:00 The Need for Nuanced Conversations\n\n\nThis episode is sponsored by:\n\n-Cozy Earth: Use code GROVES for 40% off sitewide at http://www.cozyearth.com\n\n-Qualia Life: Use code MARKGROVES to save 15% at https://qualialife.com/markgroves \n\nContact us at podcast@markgroves.com for sponsor product support, questions, comments, or just to say hello!",
      "release": "2024-09-23T10:00:42Z",
      "duration": "01:30:21",
      "explicit": false,
      "spotifyId": "54Nj6SMi2couM3qMnUEutw",
      "appleId": 1000670389397,
      "youTubeId": "jXL4Jh2VkaU",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/54Nj6SMi2couM3qMnUEutw",
        "apple": "https://podcasts.apple.com/podcast/cults-diagnosis-the-danger-of-mono-minded-thinking/id1282044290?i=1000670389397",
        "youtube": "https://www.youtube.com/watch?v=jXL4Jh2VkaU"
      }
    }
  ]
}