{
  "id": "ecab403c-220d-464a-a859-71283a7dc053",
  "name": "Mark Talukdar",
  "youTubeChannelId": "UCfWiknE0u8RSUa_4kjmlfwg",
  "episodes": [
    {
      "id": "d18d0d81-358a-47d3-9a2e-4532bdbfa23c",
      "title": "#99 - From Cult to Creativity: Entrepreneurship Against the Odds with Gabo De Rose",
      "description": "In this episode of Peak Performance Perspectives with Mark Talukdar, we speak with Gabo De Rose, a resilient entrepreneur with a story unlike any other. Gabo’s journey began in Italy, where he was born into a cult. Moving to Mexico at a young age, he faced immense cultural changes and the restrictive, high-pressure dynamics of cult life. Gabo observed power and control up close, which, as he shares, sparked his initial understanding of influence and authority. As a young entrepreneur, he faced ups and downs, from starting a business in digital marketing to losing it all in the wake of a business betrayal. Yet, Gabo’s experiences led him to rebuild with a new sense of purpose and drive.\nToday, Gabo leads a successful digital marketing agency, managing high-profile clients and redefining what it means to deliver value through marketing. Through years of overcoming trauma, personal setbacks, and a battle with bipolar disorder, Gabo discovered that true peak performance lies not in flawless success but in showing up fully for his clients and himself. He opens up about his mental health journey and shares how professional maturity and self-awareness have been transformative forces in his life.\nGabo also shares insights into what he calls \u0022professional maturity\u0022—the realization that success comes from consistency, humility, and dedication to the client. He discusses the importance of prioritizing mental health, trusting oneself in the face of adversity, and, above all, finding joy in the work that fuels us. For anyone interested in the raw, unfiltered realities of entrepreneurship and personal growth, Gabo’s story is a powerful reminder that resilience, coupled with self-compassion, can lead to extraordinary growth.\nThis episode is a compelling listen for anyone facing their own uphill battles or seeking inspiration on building a meaningful life amid challenges. Join us as we explore how Gabo’s past has shaped his present, his lessons on resilience, and his enduring commitment to keep moving forward.\nOffer:\nThe unique opportunity to receive top-tier marketing services at Mexican prices\nMeet with our Guest:\nWith over 15 years of experience in marketing and advertising, I have successfully built my career by working with renowned brands like Mercado Libre, Rappi, Visa, and Bed Bath \u0026 Beyond, as well as leading automotive campaigns for Volvo, Audi, Hyundai, and Volkswagen. I am the founder of gb\u002B, a digital agency that operates globally from Mexico, delivering world-class results at competitive prices. I’m fluent in Spanish, Italian, and English, which allows me to connect with international markets and adapt strategies to local cultures. Now, I’m excited to expand my reach as a guest on podcasts in these three languages, where I can discuss digital marketing, entrepreneurship, and the power of data-driven strategies to achieve impactful results. One of my key messages for English-speaking companies is the unique opportunity to receive top-tier marketing services at Mexican prices, offering exceptional value without compromising quality. I’m passionate about discussing the intersection of creativity and data in marketing, how to leverage global insights for local success, and how businesses can expand into new markets while optimizing their ROI.\nConnect with Him:\nhttps://www.gbplus.agency/ \nhttps://www.linkedin.com/in/gaboderose/",
      "release": "2024-12-23T16:00:33Z",
      "duration": "00:26:40",
      "explicit": false,
      "youTubeId": "V7uhIGmxmTc",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=V7uhIGmxmTc"
      }
    }
  ]
}