{
  "_ts": 0,
  "id": "af692964-3c40-40dc-a7c7-3d690f66f88b",
  "name": "Mark Martin",
  "youTubeChannelId": "UCqdZcSrkp3sszfosWFOlXpw",
  "episodes": [
    {
      "id": "6322ddbe-0208-444b-b9b5-0de8591d3363",
      "title": "Bible vs Watchtower - Understanding The Image In Nebuchadnezzar\u0027s Dream (Part 1 of 6 Bible Prophecy)",
      "description": "Is the Bible inspired by God? This is part 1 of a 6 part series. Are its prophecies true and accurate? Because of the Watchtower\u0027s inaccurate interpretation of Bible prophecy, and for other reasons as well, quite a few ex-JW\u0027s seriously doubt the inspiration of the Bible and the accuracy of Bible prophecies. In this video I show Biblically and historically what the Image of Daniel chapter 2 reveals. I also share a few reasons why I believe the Bible is truly inspired by God. This is a simplified overview of Daniel chapter 2.",
      "release": "2021-02-27T12:52:18Z",
      "duration": "01:17:02",
      "explicit": false,
      "youTubeId": "QtEe18jvQ2E",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QtEe18jvQ2E"
      }
    },
    {
      "id": "90bc58d0-71e5-4bda-adbd-5e9750fdadf3",
      "title": "Has There Always Been A Governing Body?",
      "description": "Anthony Morris was the chairman of the 2020 Annual Meeting of Jehovah\u0027s Witnesses Part 1. In this video we will examine his teachings about the governing body as compared to what the Bible teaches.\n\nLink to meeting\nhttps://www.jw.org/en/library/videos/#en/mediaitems/StudioFeatured/pub-jwb_202101_1_VIDEO",
      "release": "2021-01-05T21:43:33Z",
      "duration": "00:19:17",
      "explicit": false,
      "youTubeId": "XHe1Q6VXNP0",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XHe1Q6VXNP0"
      }
    },
    {
      "id": "5344a037-de55-41f7-be5e-6877c59123ec",
      "title": "Jesus, The Literal Only-Begotten Son Of God!",
      "description": "This video is a \u0022must see\u0022 not only for Jehovah\u0027s Witnesses, but for those who believe in the trinity doctrine as well! You will see from the Bible that God is NOT a trinity, that Jesus is not \u0022co-equal\u0022 nor is He \u0022co-eternal\u0022 with the Father. However, He does share an equality with the Father. You will see clear Biblical proof that Jesus is in fact the Divine Son of God, NOT created but begotten.\n\nThis is a vital point which most Christians, whether Catholic or Protestant including Jehovah\u0027s Witnesses, Mormons and Seventh Day Adventists misunderstand.",
      "release": "2013-12-02T01:39:47Z",
      "duration": "00:29:12",
      "explicit": false,
      "youTubeId": "w3kQyllhRlQ",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Catholicism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=w3kQyllhRlQ"
      }
    }
  ]
}