{
  "_ts": 0,
  "id": "a0825240-9d7f-4667-a97b-6589eb453e43",
  "name": "Marla Renay",
  "youTubeChannelId": "UCTUVLF5M40e-bJIw-SrHM1Q",
  "episodes": [
    {
      "id": "e7ca54ff-5739-4633-97e8-b0ea9e7ea12b",
      "title": "Why I Left the JW Cult Part 2",
      "description": "In this video, I continue sharing my experience growing up as a Jehovah’s Witness—this time focusing on the deep isolation and loneliness that came with it. From strict rules about friendships to the constant fear of disappointing the congregation, I felt trapped in a world where I could never truly be myself. If you’ve ever felt alone in your faith or struggled with leaving a high-control religion, you’re not alone.\n\nI’d love to hear your thoughts and experiences in the comments. Let’s support each other!\n\n#exjw #jehovahswitness #highcontrolreligion #religioustrauma",
      "release": "2025-03-12T04:00:49Z",
      "duration": "00:38:17",
      "explicit": false,
      "youTubeId": "zkZWNc_aFeI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zkZWNc_aFeI"
      }
    },
    {
      "id": "f6c82e39-3af1-42eb-afc8-412b513c0e8d",
      "title": "Why I left the JW Cult",
      "description": "Growing up as a Jehovah’s Witness was rough, and I want to share my story. In this video, I talk about what it was really like—how it shaped me, the struggles I went through, and why I finally had to walk away. It wasn’t easy, but leaving was the best decision I ever made.\n\nIf you’ve ever felt trapped in a strict religion or just want to hear a real, honest experience, this video is for you. Thanks for watching, and don’t forget to subscribe if you want to hear more about my journey and where I’m at now.\n\n#ExJW #JehovahsWitness #ReligiousTrauma #MyStory #HealingJourney",
      "release": "2025-02-13T05:00:56Z",
      "duration": "00:32:52",
      "explicit": false,
      "youTubeId": "um-HoPkbsjM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=um-HoPkbsjM"
      }
    }
  ]
}