{
  "_ts": 0,
  "id": "a0825240-9d7f-4667-a97b-6589eb453e43",
  "name": "Marla Renay",
  "youTubeChannelId": "UCTUVLF5M40e-bJIw-SrHM1Q",
  "episodes": [
    {
      "id": "80dbc04a-41ef-469e-9beb-ae0a275efc1c",
      "title": "Are the JWs a Cult? Let’s Talk",
      "description": "Hey everyone!\nIn today’s video, I’m breaking down how Jehovah’s Witnesses match up with the BITE Model — which stands for Behavior, Information, Thought, and Emotional control — and why a lot of people (including me) see them as a cult.\n\nI’ll be sharing real quotes straight from their publications and showing screenshots to back it all up. This isn’t about hate — it’s about talking honestly about control and helping people see what’s really going on.\n\nIf you’ve ever been part of the JWs, or you’re just curious about how groups like this work, this one’s for you.\n\nThanks for watching — don’t forget to like, comment, and subscribe if this helped you!\n\n(And if you’ve got your own experience with the JWs or cult-like groups, feel free to share below. You\u0027re not alone.)\n\n#JehovahsWitnesses #BITEModel #CultAwareness #ReligiousTrauma #ExJW #FreedomOfMind #StevenHassan #ExposingCults #JWAwareness #CultSurvivor #MindControl #JWStories #LeavingACult #ReligiousRecovery",
      "release": "2025-05-01T04:00:02Z",
      "duration": "00:31:54",
      "explicit": false,
      "youTubeId": "as1GOpqW3cY",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=as1GOpqW3cY"
      }
    },
    {
      "id": "b665c766-ecfc-4323-8165-548fede76085",
      "title": "My Hidden Story: CSA in the Jehovah’s Witness Cult",
      "description": "In this video, I share my personal and deeply unique experience of CSA within the Jehovah’s Witness organization—a story that doesn\u0027t fit the typical narratives you\u0027ve heard. This isn\u0027t just about the trauma, but about the silence, the subtle control, and the emotional isolation I lived through. If you\u0027ve felt like your experience didn’t \u0022fit the mold,\u0022 this video is for you. I hope by speaking out, I can help others feel seen and begin to heal.\n\n#ReligiousTrauma\n#ExJW\n#CSAawareness\n#SurvivorVoices\n#JehovahsWitnesses\n#ChurchAbuse\n#SpiritualAbuse\n#SpeakYourTruth\n#CultSurvivor\n#BreakingTheSilence\n#HealingFromAbuse\n#ExJWCommunity\n#SilentNoMore\n#MyStoryMatters\n#TraumaRecovery",
      "release": "2025-04-18T04:00:59Z",
      "duration": "00:33:35",
      "explicit": false,
      "youTubeId": "hnAVH16akkI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hnAVH16akkI"
      }
    },
    {
      "id": "e7ca54ff-5739-4633-97e8-b0ea9e7ea12b",
      "title": "Why I Left the JW Cult Part 2",
      "description": "In this video, I continue sharing my experience growing up as a Jehovah’s Witness—this time focusing on the deep isolation and loneliness that came with it. From strict rules about friendships to the constant fear of disappointing the congregation, I felt trapped in a world where I could never truly be myself. If you’ve ever felt alone in your faith or struggled with leaving a high-control religion, you’re not alone.\n\nI’d love to hear your thoughts and experiences in the comments. Let’s support each other!\n\n#exjw #jehovahswitness #highcontrolreligion #religioustrauma",
      "release": "2025-03-12T04:00:49Z",
      "duration": "00:38:17",
      "explicit": false,
      "youTubeId": "zkZWNc_aFeI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zkZWNc_aFeI"
      }
    },
    {
      "id": "f6c82e39-3af1-42eb-afc8-412b513c0e8d",
      "title": "Why I left the JW Cult",
      "description": "Growing up as a Jehovah’s Witness was rough, and I want to share my story. In this video, I talk about what it was really like—how it shaped me, the struggles I went through, and why I finally had to walk away. It wasn’t easy, but leaving was the best decision I ever made.\n\nIf you’ve ever felt trapped in a strict religion or just want to hear a real, honest experience, this video is for you. Thanks for watching, and don’t forget to subscribe if you want to hear more about my journey and where I’m at now.\n\n#ExJW #JehovahsWitness #ReligiousTrauma #MyStory #HealingJourney",
      "release": "2025-02-13T05:00:56Z",
      "duration": "00:32:52",
      "explicit": false,
      "youTubeId": "um-HoPkbsjM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=um-HoPkbsjM"
      }
    }
  ]
}