{
  "id": "22efcd9a-7599-48e9-9aa3-25d8c4efcdd1",
  "name": "Married A.F. | Real Talk On Relationships",
  "spotifyId": "1VLJp64mqB2HdPoCLwT0eF",
  "appleId": 1584707046,
  "youTubeChannelId": "UCnZSsLPtxfrDAlkCuvIWfgQ",
  "episodes": [
    {
      "id": "10df858e-e4cb-44c7-b337-f9e769523659",
      "title": "Ruby Franke, Jodi Hildebrandt \u0026 the Cult That Broke a Family | The Dark Truth Behind ConneXions",
      "description": "A barefoot boy escapes a desert house with duct-tape burns on his wrists and asks a neighbor for a ride to the police.\n\nThat moment didn’t just expose abuse it unraveled an entire belief system.\n\nIn this episode, we trace the disturbing collapse of Ruby Franke, Jodi Hildebrandt, and the high-control ideology behind ConneXions from wholesome family vlogs to isolation, coercion, and harm done in the name of “truth.”\n\nWe follow the arc from the polished image of Eight Passengers to a system where:\n\nChildren became content pipelines\n- Shame replaced care\n- Sexual withholding was reframed as righteousness\n- Absolute obedience was sold as spiritual maturity\n- A therapist crossed every ethical line—moving into the home, separating a marriage, and redefining discipline as warfare\n- This isn’t shock content. It’s a case study.\n\nWe break down how influence, certainty, religion, and therapy fused into something dangerous—and how ordinary warning signs were missed until it was almost too late. From underground bunkers and journals that framed suffering as sacred, to a safe that opened with 1-2-3-4-5-6, the details are chilling but the lessons matter.\n\nWe also draw a clear line between grace-centered Christian faith and any system religious or therapeutic that:\n\nIsolates family members\n- Bans outside communication\n- Punishes vulnerability\n- Harms children under the banner of purity or “truth”\n- Along the way, we talk plainly about:\n\nThe red flags neighbors and viewers now wish they’d reported\n- How family vlogging can drift into exploitation\n- Why therapy must never become command or cohabitation\n- Healthy digital boundaries: opt-in consent, revocable participation, no child-as-employee dynamics\n\n⚠️ If you suspect child abuse, document patterns, trust your instincts, and call 1-800-422-4453 (1-800-4A-CHILD). Silence protects systems speaking up protects kids.\n\nStay to the end for a powerful trailer from our friend Sanchez Tannehill’s God Did It short film, an essential reminder that restoration is real, and darkness doesn’t get the final word.\n\nIf this episode helped you think differently about online family content, counseling ethics, or how to intervene when something feels off:\n👉 Subscribe\n👉 Share this with someone who needs to hear it\n👉 Leave a review so this story reaches the people who can stop the next one\n\nYour voice might be the first step that keeps a child safe.",
      "release": "2026-02-10T13:00:04Z",
      "duration": "00:45:43",
      "explicit": false,
      "spotifyId": "4sP836IKVb8X4RhkhJHQPn",
      "appleId": 1000749030282,
      "youTubeId": "aquLUNCR99Q",
      "subjects": [
        "Connexions"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4sP836IKVb8X4RhkhJHQPn",
        "apple": "https://podcasts.apple.com/podcast/ruby-franke-jodi-hildebrandt-the-cult-that-broke/id1584707046?i=1000749030282",
        "youtube": "https://www.youtube.com/watch?v=aquLUNCR99Q"
      }
    }
  ]
}