{
  "id": "0ffe7cfb-ac0c-4b94-8210-d102a9ff1ce4",
  "name": "Marvelous Videos",
  "youTubeChannelId": "UCNZMOOmPJStgwhiJ3x-MZ_A",
  "episodes": [
    {
      "id": "f7fff6d2-2c99-498e-9b86-f92fa4d1ccaa",
      "title": "Who Is Charles Dederich, What His Cult Synanon Is All About \u0026 Is It A Miracle Or Madness?",
      "description": "Dive into the dark side of charisma with Charles Dederich and Synanon! This video explores the rise and fall of a controversial movement.  We\u0027ll meet Dederich, a charismatic leader who started Synanon as a rehabilitation program for drug addicts.  His intense group therapy sessions, known as \u0022The Game,\u0022 promised a radical cure.  But as Synanon grew, so did Dederich\u0027s delusions of grandeur.  The video will explore how the \u0022miracle\u0022 cure devolved into a controlling cult, isolating members and resorting to intimidation tactics.  We\u0027ll delve into the ethical violations and shocking crimes committed by Synanon before its eventual downfall.  So, join us as we separate fact from fiction, and see how a movement built on helping others spiraled into a terrifying form of madness.\n#Synanon #CharlesDederich #CultLeader",
      "release": "2024-04-04T00:30:22Z",
      "duration": "00:12:47",
      "explicit": false,
      "youTubeId": "rXk7G_Ljr1g",
      "subjects": [
        "Synanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rXk7G_Ljr1g"
      }
    },
    {
      "id": "85992b5f-9f51-4c34-8f6a-c36e07bdb867",
      "title": "Rael The Alien Prophet Explored - The Human Cloning Cult Leader Who Shaped Creepy Modern Sprituality",
      "description": "Rael The Alien Prophet Explored - The Human Cloning Cult Leader Who Shaped Creepy Modern Spirituality\n\n#rael #alien #tvseries #tvshow",
      "release": "2024-02-12T21:30:00Z",
      "duration": "00:22:44",
      "explicit": false,
      "youTubeId": "aZcYmJdq2Dk",
      "subjects": [
        "Raëlism"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aZcYmJdq2Dk"
      }
    }
  ]
}