{
  "id": "c8672b51-2d8f-48c1-ab86-a2d540e23bc1",
  "name": "Massachusetts School of Law at Andover",
  "youTubeChannelId": "UCYDkoHuyBUb6yNlpGyQLQJw",
  "episodes": [
    {
      "id": "142bd634-2aba-4a6c-9a93-733e6c624718",
      "title": "Cults: An In Depth Look At The Experience Of Being In Cults And Breaking Free From Them",
      "description": "http://www.mslaw.edu  Power, Money, Sex - Most cult leaders are motivated by some combination of this triad.  Experts at the psychology of mind control, cults deprive their members of free will, often with disastrous consequences. \n\nFrom Jonestown to The Branch Davidians, To the Moonies, to Heaven\u0027s Gates, cults prey on the most vulnerable. What should one do if someone they love has joined a cult?  How is it that cults are so effective at controlling the thoughts and feelings of their members?  What happens to the children of cult members? What is it like being in a cult?  How does a cult member manage to find their way out, and are there dangerous consequences to leaving?\n\nProfessor of Law Diane Sullivan is joined by Dean Lawrence R. Velvel and former cult members Janja Lalich and Steven Hassan in this presentation of The Massachusetts School of Law\u0027s Educational Forum on the topic of cults. Ms. Lalich is a Professor of Sociology at California State University Chico, and Mr. Hassan is a cult expert, author, and mental health therapist.\n\nThe Massachusetts School of Law at Andover also presents information on important current affairs to the general public in television and radio broadcasts, an intellectual journal, conferences, author appearances, blogs and books.\n\n\n\nTHE MASSACHUSETTS SCHOOL OF LAW IS NEW ENGLAND’S MOST AFFORDABLE AND DIVERSE LAW SCHOOL. We are dedicated to growing tomorrow’s leaders; empowering them with professional skills taught by instructors with real world experience, in a fun supportive campus environment.   \n_\n\n➡YOUR FUTURE STARTS HERE!  Learn More at http://MSLaw.EDU \n\n\nConnect with MSLaw:\n\nFacebook: https://www.facebook.com/MSLAndover\nTwitter: http://Twitter.com/EDU_video\nVisit our site:  http://MSLaw.edu\n\n\nand - Subscribe to our Videos!  http://www.youtube.com/subscription_center?add_user=mslawdotedu\n\n-~-~~-~~~-~~-~-\nThe History of Iran / US Relations: \u0022American Imperialism - Stephen Kinzer on Overthrow Part 2: Vietnam, Iran and Chile\u0022 \n➨ https://www.youtube.com/watch?v=y7wECccLRec\n-~-~~-~~~-~~-~-",
      "release": "2011-08-08T22:38:35Z",
      "duration": "01:00:00",
      "explicit": false,
      "youTubeId": "VJ1w6lgrttE",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology",
        "Unification Church",
        "Branch Davidians",
        "Peoples Temple",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VJ1w6lgrttE"
      }
    },
    {
      "id": "2be2af9a-22c6-4fb6-abc2-71e018c57d22",
      "title": "Life In A Cult.",
      "description": "http://www.mslaw.edu\nProfessor of Law Diane Sullivan is joined by Dean Lawrence R. Velvel and former cult members Janja Lalich and Steven Hassan in this excerpt of The Massachusetts School of Law\u0027s Educational Forum on the topic of cults. Ms. Lalich is a Professor of Sociology at California State University Chico, and Mr. Hassan is a cult expert, author, and mental health therapist.\n\nThe Massachusetts School of Law at Andover also presents information on important current affairs to the general public in television and radio broadcasts, an intellectual journal, conferences, author appearances, blogs and books.\n\nThe Massachusetts School of Law also presents information on important current affairs to the general public in television and radio broadcasts, an intellectual journal, conferences, author appearances, blogs and books.\n\n\nTHE MASSACHUSETTS SCHOOL OF LAW IS NEW ENGLAND’S MOST AFFORDABLE AND DIVERSE LAW SCHOOL. We are dedicated to growing tomorrow’s leaders; empowering them with professional skills taught by instructors with real world experience, in a fun supportive campus environment.   \n_\n\n➡YOUR FUTURE STARTS HERE!  Learn More at http://MSLaw.EDU \n\n\nConnect with MSLaw:\n\nFacebook: https://www.facebook.com/MSLAndover\nTwitter: http://Twitter.com/EDU_video\nVisit our site:  http://MSLaw.edu\n\n\nand - Subscribe to our Videos!  http://www.youtube.com/subscription_center?add_user=mslawdotedu\n\nThe  Massachusetts School of Law is New England’s most affordable and diverse law school. We are dedicated to growing tomorrow’s leaders; empowering them with professional skills taught by instructors with real world experience, in a fun supportive campus environment.   Your Future Starts Here.  Learn More at http://MSLaw.EDU\n\n-~-~~-~~~-~~-~-\nThe History of Iran / US Relations: \u0022American Imperialism - Stephen Kinzer on Overthrow Part 2: Vietnam, Iran and Chile\u0022 \n➨ https://www.youtube.com/watch?v=y7wECccLRec\n-~-~~-~~~-~~-~-",
      "release": "2011-08-05T17:30:36Z",
      "duration": "00:06:14",
      "explicit": false,
      "youTubeId": "LHMYwtjaFjI",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LHMYwtjaFjI"
      }
    }
  ]
}