{
  "id": "e0cfdb7b-907b-4cec-a5c1-5fa25b8e5830",
  "name": "Matt Cullen",
  "youTubeChannelId": "UCWnnl39s0PsEo2a9GXdm8nw",
  "episodes": [
    {
      "id": "1c8da9e0-104b-4f4e-b0cc-b70aab3b9bf4",
      "title": "He Run’s Hawaii’s SCARIEST Hidden Cult (Still ACTIVE TODAY)",
      "description": "What started as a spiritual wellness group turned into one of the most disturbing cults in modern history. In this episode, I dive into the chilling true story of Buddhafield and its leader, Jaime Gomez (also known as Michel, Andreas, and Reyji) who manipulated his followers with promises of enlightenment, love, and healing… while hiding a dark, abusive truth.\n\nFrom the cult’s beginnings in 1980s West Hollywood to its eerie rebirth in Hawaii, this is a story of plastic surgery, power, psychological control—and the shocking sexual abuse allegations that rocked this so-called spiritual paradise. If you’ve seen the Holy Hell documentary, you know how disturbing it gets. But there’s even more to this story that didn’t make the final cut.\n\nAll the footage is pulled from the Holy Hell documentary. Check out the documentary, here: https://www.amazon.com/HOLY-HELL-Will-Allen/dp/B01KP1QRGE\n\n🤍 FOLLOW ME 🤍\n► Instagram: http://instagram.com/mattcullen\n► TikTok: https://www.tiktok.com/@queerdocumentary\n► Facebook: https://www.facebook.com/ourqueerlifewithmattcullen\n► YouTube: https://www.youtube.com/matthewlcullen\n► X: https://twitter.com/mattlcullen\n\nThank you for watching  \u0027Our Queer Life\u0027 - my series that shines a light on the stories of people in our queer community that have walked a different walk of life than most of us. I have had the most amazing time meeting all of the different queer people on the show and I truly feel so lucky to have them in my life now. \n\nIf you’d like to support my channel, here is my PayPal: https://www.paypal.com/paypalme/mattlcullen\nVenmo: @MattLCullen\n\n📢 BE ON THE SHOW:\nALWAYS looking for new stories, so if you are queer and have an interesting story/life event that you want to share, reach out to me! In the email, make sure to include where you are located, a paragraph or so about your story, and any social media links. Email me, here: matthewlcullen@gmail.com \n\n✔﻿ E M A I L : matthewlcullen@gmail.com\n\n❣️ PLEASE SUBSCRIBE:\nhttps://www.youtube.com/user/MatthewLCullen?sub_confirmation=1\n\ntrue crime, true crime story, true crime youtubers, true crime daily, true crime podcast, cult, cult leaders",
      "release": "2025-05-23T14:56:28Z",
      "duration": "00:10:35",
      "explicit": false,
      "youTubeId": "RInXP8U9yGY",
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=RInXP8U9yGY"
      }
    }
  ]
}