{
  "_ts": 0,
  "id": "bde13da4-791a-4bfd-b0e2-39e291525132",
  "name": "Maye Muses",
  "youTubeChannelId": "UCI-azkD2eJoAzrz0cijFhCA",
  "youTubePlaylistId": "PLrbdD-tc13FX5socxcv5FbSu7iyFvMQVz",
  "episodes": [
    {
      "id": "bb8eef2f-4264-40b3-aca3-ac8032e4d423",
      "title": "The Origins of \u0022The Woke Mind Virus\u0022",
      "description": "Hello, Good People. \u0022The Woke Mind Virus\u0022 has been a major point of contention. We do a deep dive today. Is it real? What is it? Where did it come from? Is it over?\n\nThis is a follow-up to Rate My Cult - MAGA. You can watch that here https://youtu.be/mILCex8CPzE\n\nCheck out the Wetiko / Mind Virus video here https://youtu.be/S9sYKy0bp5k\n\n#wokemindvirus #liberalism #psychology",
      "release": "2024-12-06T18:15:20Z",
      "duration": "00:58:40",
      "explicit": false,
      "youTubeId": "7Ajt2UTKi_s",
      "subjects": [
        "Psychology",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7Ajt2UTKi_s"
      }
    },
    {
      "id": "ea2bd76a-2bd8-4a6c-a0cf-f4255cf51666",
      "title": "Is MAGA the Most Powerful Cult in History?",
      "description": "Hello, Good People! MAGA may come back to power in January. No one would have guessed it would redeem itself after the last election, but here we are.  We take a good look on MAGA as a cult and its various elements.\n\nSome resources:\nJanuary 6th documentary - https://www.youtube.com/watch?v=ZC-Wo9nJ3O4\n\nSteven Hassan\u0027s Channel @drstevenhassan  for long form expert videos on the New Apostolic Reformation and Opus Dei, plus more MAGA \n\nIf you like this, check out my Patreon for more content:\nhttps://www.patreon.com/c/user?u=60002924\n\n#ratemycult #MAGA #trump",
      "release": "2024-11-01T18:42:52Z",
      "duration": "01:11:07",
      "explicit": false,
      "youTubeId": "mILCex8CPzE",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mILCex8CPzE"
      }
    },
    {
      "id": "56f24b9c-c562-4232-9f54-974349190bf8",
      "title": "Inside the Mind of a Cult Leader",
      "description": "Hello, Good People. We all need guidance from time to time, but who is a trustworthy spiritual mentor and who is a cult leader? This video aims to answer that question. Plus, we go into a little history on cult leaders, formerly known as false prophets.\n\nCheck out Daniel Shaw\u0027s paper here: https://www.icsahome.com/elibrary/topics/articles/the-relational-system-of-the-traumatizing-narcissist\nand you can find his book on the same subject here. You can listen for free with an Amazon account. https://www.amazon.com/Traumatic-Narcissism-1st-Relational-Subjugation/dp/B09MV499D7/ref=tmm_aud_swatch_0?_encoding=UTF8\u0026qid=\u0026sr=\n\nI\u0027m not getting paid and I don\u0027t know the guy, but he wrote the book on it!\n\nFor more content, join my Patreon https://www.patreon.com/user?u=60002924\n\n#cults #cultleader #narcissism",
      "release": "2024-10-04T00:07:11Z",
      "duration": "00:24:51",
      "explicit": false,
      "youTubeId": "K9jdh9K5Qz8",
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K9jdh9K5Qz8"
      }
    },
    {
      "id": "61c67ed7-f06d-4400-b00c-2d38219e9e00",
      "title": "Cult Tactics - How Groupspeak Brainwashes You",
      "description": "Hello, Good People! We all like to learn new phrases and new slang, but did you know that adopting certain words can isolate you? Cults and other groups use this tactic all the time. We learn how in this video.\n\n#cults #groupspeak #wording",
      "release": "2024-09-11T15:57:05Z",
      "duration": "00:16:07",
      "explicit": false,
      "youTubeId": "AAoXLqX-zgw",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AAoXLqX-zgw"
      }
    },
    {
      "id": "86884390-516c-454c-8c18-12179ccf4f66",
      "title": "The Most Ambitious Cult You\u0027ve Never Heard Of - Rate My Cult",
      "description": "Hello Good People! I\u0027ve been hearing rumors that Tulsi Gabbard is in a cult for a while, and I decided to take a closer look. I really didn\u0027t expect it to be this scandalous, but that\u0027s what the evidence shows. \n\nCheck out these great resources to find out more:\n\nChristine Gralow, Butler\u0027s Web https://www.meanwhileinhawaii.org/home/butlersweb\n\nDisciples, Deities \u0026 Development https://www.stuff.co.nz/timaru-herald/news/68483000/disciples-deities-and-development\n\nLalita\u0027s First Hand Account https://medium.com/@lalitamann/an-insiders-perspective-on-tulsi-gabbard-and-her-guru-e2650f0d09\n\nNew York Magazine https://nymag.com/intelligencer/2019/06/tulsi-gabbard-2020-presidential-campaign.html\n\nInsider https://www.insider.com/tulsi-gabbard-science-of-identity-controversial-religious-sect-2022-10\n\nRama Ranson vs The Cult https://ramaransonvsthecult.wordpress.com/page/2/\n\nIran Scandal \npt 1 https://www.youtube.com/watch?v=KBi00X-_BV8\npt 2 https://www.youtube.com/watch?v=G1cqiWrSBiA\npt 3 https://www.youtube.com/watch?v=L6OnqEpCulU\n\n#tulsigabbard #cult #hawaii",
      "release": "2023-08-18T04:15:30Z",
      "duration": "01:05:34",
      "explicit": false,
      "youTubeId": "CKkvjDDaAmI",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CKkvjDDaAmI"
      }
    },
    {
      "id": "059d88f2-6804-4fc6-b92f-4ea09343a413",
      "title": "Not Everything\u0027s a Cult - Social Movements",
      "description": "Hello, Good People. The word cult gets thrown around a lot, often by me, but not every group is a cult. Some of the groups giving us the most trouble are social movements. We go into social movements in this video - what they are, how they grow and how they\u0027re like cults.\n\nIf you want to read more about social movements, you can do so here for FREE... https://pressbooks.howardcc.edu/soci101/\n\nAlso, check out my Patreon for last week\u0027s video on social movement in-fighting... https://www.patreon.com/user?u=60002924\n\nIt\u0027s obvious why that video isn\u0027t on YouTube!\n\n#cults #socialmovement #crashcourse",
      "release": "2023-08-04T17:45:15Z",
      "duration": "00:32:22",
      "explicit": false,
      "youTubeId": "9IQtxbrWmHo",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9IQtxbrWmHo"
      }
    },
    {
      "id": "5f88a493-fdc0-4ade-acdc-bef146b04713",
      "title": "Would You Join a Cult? The Answer May Surprise You",
      "description": "Hello Good People. What kind of a person joins a cult? We laugh at them in the comments, but you\u0027d be surprised to learn what kind of a person actually signs up. In this video, I go over the warning signs that you or someone you know might be susceptible to cult indoctrination.\n\nThe papers I referenced are as follows:\n-Who Joins a New Religious Movement and Why: Twenty Years of Research and What Have We Learned? by Lorne L. Dawson\n-The Joiners by Saul Levine\n-Becoming a World-Saver: A Theory of Conversion to a Deviant Perspective by John Loftland and Rodney Stark\n\nFor more videos and my weekly podcast, join me over on Patreon https://www.patreon.com/user?u=60002924\n\nWe\u0027ve got a great video on social identity movements coming up on Patreon later this week, so stay tuned for that!\n\n#cults #indoctrination #toxicfriends",
      "release": "2023-07-27T15:32:59Z",
      "duration": "00:18:35",
      "explicit": false,
      "youTubeId": "Emxo-YgxLcA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Emxo-YgxLcA"
      }
    },
    {
      "id": "8a3c6c5a-b10d-4425-ace5-885b5444d401",
      "title": "Rate My Cult - Twelve Tribes",
      "description": "Hello, Good People. Have you seen one of these Yellow Delis? Apparently, the food is really good, but there\u0027s more to them than that. It\u0027s a cult!  Twelve Tribes models themselves on the early Christian Church. They\u0027ve got a lot of good aspects, but their dark side is really dark. We go into that here. \n\nWhat do you think? Is Twelve Tribes a net good or a net bad? Are they better or worse than the modern world? Would you join a cult for the food?\n\nCheck out the A\u0026E special on them here: https://www.youtube.com/watch?v=e_iX_JCTzSw\n\n#cults #twelvetribes #christianity",
      "release": "2023-06-14T15:37:06Z",
      "duration": "00:57:10",
      "explicit": false,
      "youTubeId": "BzxkNzOKlb0",
      "subjects": [
        "Twelve Tribes"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=BzxkNzOKlb0"
      }
    },
    {
      "id": "a19bcb7a-5b20-4435-bf56-d2146ec76cee",
      "title": "Occult Russia Breakdown",
      "description": "Hello, Good People! The occult is fascinating. We are so familiar with Western Occult, but I got the chance to dig into Russian occult recently through Christopher McIntosh\u0027s \u0022Occult Russia,\u0022 and I want to share some takeaways with you.\n\nCheck out Christopher McIntosh\u0027s interview with our friend Miguel Conner here @AeonByteGnosticRadio https://www.youtube.com/watch?v=5baqeUb-A6U \n\nThis video has nothing to do with the Russia/Ukraine War and I strongly condemn the invasion. It\u0027s unrelated to this.\n\nThis was originally a Patreon video. I\u0027m deep into cult research which can take many weeks, but I didn\u0027t want to leave my YouTube peeps hanging. \n\nFor new weekly videos that are not on YouTube, join my Patreon https://www.patreon.com/user?u=60002924\n\nI also give you fresh YouTube content every week, or every other week, but I can\u0027t put everything on here.\n\n#occult #russia #christophermcintosh",
      "release": "2023-05-26T15:02:39Z",
      "duration": "00:20:13",
      "explicit": false,
      "youTubeId": "ffeQ8hb9mEA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ffeQ8hb9mEA"
      }
    },
    {
      "id": "87c4e819-2d56-40d8-9c7f-82e194d0cc77",
      "title": "Rate My Cult - WACO \u0026 The Branch Davidians",
      "description": "Hello, Good People. Today is the 30 year anniversary of the fire at Waco, TX. The group formerly known as The Branch Davidians died under the crooked leadership of David Koresh. The ATF and FBI share a lot of that blame as well, but this video is about the group.\n\nIf you would like to learn more about the events of Waco, here are some great resources:\n\nThe Ashes of Waco, an Investigation by Dick J. Reavis\nThe Sinful Messiah Series, by the Waco Tribune\nWaco: Rules of Engagement (1997)\nWaco: The Longest Siege by the Smithsonian (2018)\nWaco: American Apocalypse (2023)\n\nThere were also two Congressional Reports and a Treasury Report that are useful if you\u0027ve got to write a paper.\n\n#waco #davidkoresh #cult",
      "release": "2023-04-19T15:49:02Z",
      "duration": "01:04:55",
      "explicit": false,
      "youTubeId": "zY8RE6ARtqY",
      "subjects": [
        "Branch Davidians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zY8RE6ARtqY"
      }
    },
    {
      "id": "5b827dd1-2ca7-4695-b6ce-d9c3edf627fd",
      "title": "The DMT Reddit Cult that Never Was (Cantelmoism)",
      "description": "Hello, Good People. Back with another Rate My Cult. We\u0027re talking Cantelmoism. Is this really a cult? You decide. \n\nCantelmoism is a religious startup made famous on Reddit. The controversial founder canceled himself in 2019, so this is all history.\n\n#cantelmoism #cult #reddit",
      "release": "2023-03-31T16:24:15Z",
      "duration": "00:35:32",
      "explicit": false,
      "youTubeId": "FNjXZVIs80c",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FNjXZVIs80c"
      }
    },
    {
      "id": "0eaffcbd-8519-4029-9a42-86467270d00b",
      "title": "Rate My Cult - The Hebrew Israelites",
      "description": "Hello, Good People! The (Black) Hebrew Israelites are in the news again, and they came at me in the comments, so I figured I\u0027d look into them more. You\u0027ll be amazed by what I found. \n\nPeople got so mad that I called them \u0027cult adjacent\u0027 that it became obvious they were cult proper. You know who doesn\u0027t get mad when people say they\u0027re in a cult? People not in cults.\n\nHere are some of the primary sources I used:\n\n\u00223 Days in Dimona\u0022 documentary about the African Hebrew Israelites of Jerussalem - https://www.youtube.com/watch?v=oiL7w486-UI\n\nSister Bree who lost her husband - https://www.youtube.com/watch?v=ALkLf9yDpuE\u0026t=1070s\n\nEx-Member Brother Marcus Interview with Adam Coleman - https://www.youtube.com/watch?v=cSo5QyJqgXc\u0026t=361s\n\nEx-Member Oscar Dunlap Testimony - https://www.youtube.com/watch?v=JO10v68FiWU\n\nJames White Interviews Elder Rawchaa - https://www.youtube.com/watch?v=KYtTSNjky0c\u0026t=1554s\n\nVocab Malone Interviews Ex-Member Chadash - https://www.youtube.com/watch?v=jVxWvVnTXfk\u0026t=536s\n\nDefinitely check out @VocabMalone on YouTube. His channel is full of resources, especially as it relates to religion \u0026 Christianity.\n\nBooks and articles are posted as screenshots in the video.\n\nAnd no, I\u0027m not doing a \u0027Rate My Cult\u0027 on the Irish Hebrew Israelites anytime soon. I know! I want that video too, so you better make it and tag me. \n\n#cults #hebrewisraelites #newreligiousmovement",
      "release": "2022-11-20T17:21:00Z",
      "duration": "01:00:12",
      "explicit": false,
      "youTubeId": "3feTEz6hdk8",
      "subjects": [
        "Black Hebrew Israelites"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=3feTEz6hdk8"
      }
    },
    {
      "id": "796e88c2-863e-400c-8f27-ad99b2a14cb7",
      "title": "Cult Accusations from a YouTube Exorcist",
      "description": "Hello, Good People. Not every group is a cult, especially not the group we\u0027re a part of. Other groups are cults. \n\nAnyway, Bob Larson of 1980\u0027s Satanic Panic fame is out here on YouTube exorcising demons and throwing cult accusations. I\u0027m here for it! \n\nWhat do you think? Should we trust him on what makes a cult? Can you exorcise demons over zoom? \n\nAlso.... WDYT the main difference b/w a cult and a religion is? \n\nDoes it matter if ritual is a show if it\u0027s helping people???\n\n#satanicpanic  #cults #1980s",
      "release": "2022-10-13T18:13:08Z",
      "duration": "00:32:57",
      "explicit": false,
      "youTubeId": "KfUPaFInWMY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KfUPaFInWMY"
      }
    },
    {
      "id": "ca3eccd4-0aab-4f06-b2ce-2e72faabf4fe",
      "title": "Leaving a Mind Trap - Interview with Pisce (Carbon Nation)",
      "description": "Hello, Good People! Pisce is a talented artist and rapper that just recently left a cult called Carbon Nation. In my last video, Rate My Cult - Carbon Nation, we went into the many mind traps that Nature Boy set for his followers to keep them mentally ensnared. Pisce got out.\n\nPisce and I talked about leaving and about rebuilding his life. Really, he\u0027s so young that he can do whatever he puts his mind and efforts to. He\u0027ll be performing in Virginia soon too, so if you\u0027re in the area, go to his show. What else you got going on? \n\nWe got cut off, but I\u0027m gonna have him back once he launched his own thing. I found him while researching CN, listened to his rap and sought him out because he was good. \n\nIf you or someone you love is in a cult, know that all the knowledge is out there for you to learn. No kind of real teacher even WANTS to control people. \n\n#carbonnation #pisce #movingforward",
      "release": "2022-08-03T15:15:42Z",
      "duration": "00:57:52",
      "explicit": false,
      "youTubeId": "biTWwYrJF1E",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=biTWwYrJF1E"
      }
    },
    {
      "id": "564088fb-d789-4ea0-9a3b-eedbe142f917",
      "title": "Black Excellence Gone Wrong - Carbon Nation",
      "description": "Hello, Good People. Welcome back to another Rate My Cult! This is the story of how one creator called Nature Boy turned his YouTube page into a thriving cult called Carbon Nation and then lost it all to ego. It\u0027s a tale as old as time, but how does this cult stack up against the rest?\n\nYouTube is a great tool for most of us, but for some, it\u0027s a weapon. The story of Carbon Nation is a cautionary tale. This is what happens when you believe in something! They\u0027d have been better off joining a yoga studio and going to the farmer\u0027s market.\n\nThis video might not be appropriate for sensitive viewers. Ads are limited, because YouTube assumes viewers are all children or simple. \n\nSo if you enjoy, feel free to Cash App $MayeOsborne \n\nShare this video with your friends/family who would enjoy it esp. that one family member you\u0027re afraid might fall into a cult one day. \n\n#cults #carbonnation #natureboy",
      "release": "2022-07-31T14:31:52Z",
      "duration": "01:12:53",
      "explicit": false,
      "youTubeId": "IiQpTnl5scU",
      "subjects": [
        "Carbon Nation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IiQpTnl5scU"
      }
    },
    {
      "id": "67e14ce1-0dd2-4f61-8a12-84ff4b10a19b",
      "title": "Rate My Cult - UFO Edition (Heaven\u0027s Gate)",
      "description": "Hello, Good People! Welcome to another Rate My Cult. I hope you all enjoyed the UFO hearings. We talked about it on the  @ComedianCP   podcast. In a few short years, UFO\u0027s have gone from fringe crazy to yesterday\u0027s news. \n\nThis video is about Heaven\u0027s Gate. They\u0027ve been the butt of jokes for many years, but their story has a lot to teach us. It\u0027s Christianity and New Age with a little SciFi. Plus, they went out in a bang. Most importantly, how do they stack up against other cults?\n\nI try to give them a fair shake here, but don\u0027t anybody get any ideas. Suicide is stupid, esp when there\u0027s no comet. You\u0027d just be throwing your life away on an average night sky. It\u0027s goofy.\n\n#cult #heavensgate #darkhumor",
      "release": "2022-06-11T19:59:42Z",
      "duration": "00:50:16",
      "explicit": false,
      "youTubeId": "l3UkovscWZY",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=l3UkovscWZY"
      }
    },
    {
      "id": "7c94223d-1395-4771-9848-dd014e1ff19b",
      "title": "Slogans, Catch Phrases \u0026 Cliches - How They Get You",
      "description": "Hello, Good People. We are unfortunately learning that humans can be programmed with hashtags and slogans. This technology is \u0022ethically neutral,\u0022 so we can also program ourselves to succeed with affirmations. Seems like a pretty powerful tech. Why do some people fall for them so hard for slogans? Are they dumb, or is it something deeper? What can we learn from the past?\n\nFor some of you this is a review. For some, it\u0027s the first time hearing it. However, it is so important that I feel it deserves its own video.\n\nRemember, never use any of this information for evil! You\u0027re better than that.\n\n#slogans #hashtags #banalityofevil",
      "release": "2022-05-18T17:05:59Z",
      "duration": "00:31:06",
      "explicit": false,
      "youTubeId": "M2OEj37nneY",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=M2OEj37nneY"
      }
    },
    {
      "id": "1babf0f2-2078-4572-9571-84f8eb0deb2c",
      "title": "Stans, Fandom and Celebrity Worship",
      "description": "Hello, Good People. Monia Ali is joining me today to talk about fandom, which is a culture of celebrity worship that has grown online over the past few years. She explains what fandom is, how it differs from regular stans and how they border on cults.\n\nTurns out, there are a lot of closeted fans \u0026 stans out there, so if your BFF has gone dark, it might not be drugs. S/he may be worshipping a celebrity. I had no idea One Direction fans were so militant.\n\nCheck out more of Monia\u0027s work on her Substack https://exiledfan.substack.com/\nand follow her on Twitter to learn more about fan culture @momovolution  \n\n#fandom #stans #cults",
      "release": "2022-05-11T11:22:05Z",
      "duration": "01:16:39",
      "explicit": false,
      "youTubeId": "mP-6DS13P0c",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mP-6DS13P0c"
      }
    },
    {
      "id": "8d552205-06de-423e-acb3-9321d23ac3f7",
      "title": "Proof Social Media Makes People Sick",
      "description": "Hello World! Recently, there was a case out of Germany of a YouTuber spreading Tourette\u0027s online. Seems impossible, and it is. What he was spreading wasn\u0027t Tourette\u0027s. It was MASS HYSTERIA! What\u0027s unique is that it was spread online rather than in person.\n\nHysteria is terrifying and complicated, particularly mass hysteria. Also, I don\u0027t know how much it matters if a person\u0027s illness is caused by their psychology or caused by an organic illness. If they\u0027re ill, they\u0027re ill. That\u0027s not the point of this particular video, but it needs to be said, and I didn\u0027t say it in this video, instead choosing to rag on them.\n\nHere is the paper if you want to read it thoroughly, but I must warn you, it will annoy and depress you unless you\u0027re a monk or a doctor or something:\nhttps://academic.oup.com/brain/advance-article/doi/10.1093/brain/awab316/6356504\n\nAlso, upon rewatching Pontypool last night, I see that it is brilliant and not goofy as I implied in the video. When I first saw it, I was very young and didn\u0027t consider it as an allegory for mass hysteria. It may be available on YouTube to watch for free. You didn\u0027t hear that from me.\n\nLet me know what you think about this case or Pontypool. Also, are you noticing any more mass hysteria spread online? I certainly am.\n\n#janzimmermann #masshysteria #socialmedia",
      "release": "2021-10-02T16:02:25Z",
      "duration": "00:15:02",
      "explicit": false,
      "youTubeId": "qAfT-s4WHaU",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qAfT-s4WHaU"
      }
    },
    {
      "id": "e97c9e84-b943-4732-b62d-bed7b546b9ce",
      "title": "Love Has Won \u0026 Mother God (Rate My Cult)",
      "description": "#lovehaswon #amycarlson #cult\n\nHello, YouTube! There\u0027s been lots of news on the cult front recently. 7 members of the cult, Love Has Won, have been arrested for mummifying their leader, Amy Carlson, AKA Mother God. Here is a breakdown of the story. \n\nThis is a recent story, and Love Has Won is already evolving and changing as an organization. I look forward to bringing you updates.\n\nThere\u0027s a lot more to this story, but the video had to end somewhere. Check out Amy\u0027s episodes of Dr. Phil, or the Last Podcast episode, or if you want the facts first-hand, you can still go to their YouTube page and sort through their livestreams. Also, check out Rising Above Love Has Won on YouTube.\n\nHere is a short video about the Japanese Ascetic mummies too https://www.youtube.com/watch?v=9m6K94CxHfc\n\nClips are for educational purposes. No copyright infringement intended.",
      "release": "2021-05-25T05:27:14Z",
      "duration": "00:50:06",
      "explicit": false,
      "youTubeId": "64TQs9qSanQ",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=64TQs9qSanQ"
      }
    },
    {
      "id": "ace1c346-9df1-4d46-86d4-3662833e930c",
      "title": "NXIVM - The Most Insufferable Hollywood Sex Cult",
      "description": "Hello, YouTube! There\u0027s so much talk about NXIVM, the Hollywood sex cult that branded its famous members, but how does it stack up against other cults? This is the first of many in the \u0022Rate My Cult\u0022 series. If you have a cult you\u0027d like me to rate, let me know!\n\nIf you suspect you\u0027re in a cult, check out these page that might help\nhttps://cult-escape.com/help/\nhttps://www.wikihow.com/Leave-a-Cult\n\nTo learn more about Contreprenuers, check out @MikeWinnet https://www.youtube.com/c/MikeWinnet/playlists\n\nIf you legit want some self-help, here\u0027s a link to the teachings of Marcus Aurelius, the undisputed self-help GOAT, https://www.youtube.com/watch?v=Hu0xDtK3g3Q\u0026t=219s\n\n#NXIVM #thevow #cults",
      "release": "2021-03-18T00:28:49Z",
      "duration": "00:19:32",
      "explicit": false,
      "youTubeId": "-mrgd_kx7qo",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-mrgd_kx7qo"
      }
    },
    {
      "id": "ff1754c6-bd85-4bf0-b5b9-c51ae74c3536",
      "title": "The Most Important Cult You Never Heard of",
      "description": "#fatherdivine #cult #blackhistorymonth\nHello, YouTube! So good to see you again. This is probably my favorite video to date. Rate My Cult - Black History Month Edition!!! We\u0027re discussing Father Divine and the International Peace MISSION Movement. (I kept saying Peace Movement. Please, forgive me.) \n\nWhat do you think about Father Divine\u0027s movement? Had you learned about him before? \n\nHere are some links to more information.\n\nFather\u0027s Kingdom Documentary - https://www.youtube.com/watch?v=fxkzhX_4zs8\n(This is free with ads on Tubi)\n\nThe International Peace MISSION Movement\u0027s YouTube \nhttps://www.youtube.com/channel/UCFY-OK3LNWNFfdsaZoi6Igw\n\nA great write up at World Religions and Spirituality\nhttps://wrldrels.org/2016/10/08/father-divine/",
      "release": "2021-02-26T16:59:08Z",
      "duration": "00:41:53",
      "explicit": false,
      "youTubeId": "ER_HZ_JBPOU",
      "subjects": [
        "International Peace Mission movement"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ER_HZ_JBPOU"
      }
    },
    {
      "id": "97fff6e8-93ca-4494-842b-4a2e1095c545",
      "title": "The Craziest Thing Happening on YouTube Right Now",
      "description": "Hello YouTube! I\u0027ve been spending a lot of time online doing research on the Great Flash and the Ascension. Some of you have never heard of it, but this video will let you know what\u0027s really going on.\n\nHere\u0027s the video about the grid from Real Engineering https://www.youtube.com/watch?v=LLO9WxVO9s8\n\nHere is Direct Currents\u0027 5D Ascension video so you can be prepared. Remember, Direct Currents loves you, and he is the one true YouTube prophet! https://www.youtube.com/watch?v=gqJ2CztOPxo\n\n#greatsolarflash #december21 #greatconjunction",
      "release": "2021-01-11T02:17:20Z",
      "duration": "00:15:57",
      "explicit": false,
      "youTubeId": "ObvmQGhySGM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ObvmQGhySGM"
      }
    },
    {
      "id": "5715c642-b771-45bf-8363-8e655809da8f",
      "title": "Are You in a Cult? Difference btw a Church and a Cult",
      "description": "Hello YouTube! Here is a much needed video in the cult series. It answers a question that keeps coming up - What\u0027s the difference between a church or a religion and a cult. \n\nLet me know if I left anything out in the comments below. And if you have any personal cult stories, it\u0027s rude not to share!\n\n#church #cults #religion",
      "release": "2020-12-09T04:22:47Z",
      "duration": "00:13:52",
      "explicit": false,
      "youTubeId": "Y1Yhk4ltoBk",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Y1Yhk4ltoBk"
      }
    }
  ]
}