{
  "id": "fea76bfe-1448-4893-b4c6-d689fdff214d",
  "name": "Mayim Bialik\u0027s Breakdown",
  "spotifyId": "6TgOe2poCdpZtQwKetQmU1",
  "appleId": 1546456269,
  "youTubeChannelId": "UCTOocPnDh2YQZZwh86K2OxA",
  "episodes": [
    {
      "id": "67a73283-72c0-4eb6-9c0c-fb51ab00b510",
      "title": "The CIA, MKUltra \u0026 The Patty Hearst Case: How Protect Yourself From The Mind Control Techniques Being Used Today",
      "description": "What if you could be persuaded to confess to a crime you didn’t commit—or believe an identity that was manufactured for you? Harvard historian and sociologist Dr. Rebecca Lemov (author of The Instability of Truth: Brainwashing, Mind Control, and Hyper-Persuasion) explores how the manipulation of belief has shaped modern society from Cold War psychology to today’s social media. Mayim and Jonathan discuss the case of Leonard Kyle, who claimed the government implanted devices in his brain… and turns out, it was true! They deep dive into the psychological transformation of Patty Hearst and why her brainwashing defense was rejected and how government experiments like MK-Ultra still influence policy today. Plus, understand the rise of hyper-persuasion in the digital age and how social media can manipulate your emotions through harvesting your trauma using targeted algorithms. Learn how to spot the signs of mind control in abusive relationships and why false confessions are more common than you\u0027d think. Whether you’re a fan of cults, psychology, digital ethics or government conspiracy theories, this episode is a mind-bending journey into how belief, identity, and freedom have transformed in ways we barely recognize. Rebecca Lemov\u0027s book, THE INSTABILITY OF TRUTH: Brainwashing, Mind Control and Hyper-Persuasion: https://wwnorton.com/books/9781324075264 Follow us on Substack for Exclusive Bonus Content: https://bialikbreakdown.substack.com/ BialikBreakdown.com YouTube.com/mayimbialik",
      "release": "2025-07-04T07:30:00Z",
      "duration": "01:21:36.6000000",
      "explicit": false,
      "spotifyId": "6Z3Q3dO6siwfc18WsIY1aj",
      "appleId": 1000715701910,
      "youTubeId": "sJOfCS9Ktyg",
      "subjects": [
        "Cult Psychology",
        "Symbionese Liberation Army",
        "Cult-Expert",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Z3Q3dO6siwfc18WsIY1aj",
        "apple": "https://podcasts.apple.com/podcast/the-cia-mkultra-the-patty-hearst-case-how/id1546456269?i=1000715701910",
        "youtube": "https://www.youtube.com/watch?v=sJOfCS9Ktyg"
      }
    }
  ]
}