{
  "id": "e175830e-adea-41f6-943b-4795c41d53b3",
  "name": "Mea Culpa",
  "spotifyId": "2DoVhLp34ysfvvJeKIe5Yn",
  "appleId": 1714009198,
  "youTubeChannelId": "UC9r9HYFxEQOBXSopFS61ZWg",
  "youTubePlaylistId": "PL36GQAccexbzLm-eb2KEe6PPkjRkl4lWY",
  "episodes": [
    {
      "id": "7117b4f4-ac42-448b-a8f0-b09b2470d9a3",
      "title": "The Cancel Cult \u002B A Conversation with Dr. Steven Hassan",
      "description": "Today on Mea Culpa, I welcome back Dr. Steven Hassan, mental health expert, author, and host of the Cults, Culture \u0026 Coercion podcast, for a chilling look at how MAGA operates like a mind control movement. Drawing from his own experience in the Moonies and decades of studying coercive psychology, Hassan explains why Trump’s followers remain loyal despite scandals, how repetition and fear fuel authoritarian obedience, and why MAGA loyalists must be seen as victims of psychological warfare. We dig into the overlap between cult tactics, Christian nationalism, and Trump’s constant attacks on the press, as well as how the ongoing Epstein revelations expose the lengths to which the powerful will go to protect themselves. From Putin’s playbook to Supreme Court rulings, this episode reveals how authoritarian influence spreads and how we can break its grip before it’s too late.\n\nThanks to our sponsors:\n\nEthos: Get your FREE quote at https://ethos.com/COHEN\n\nPrize Picks: Visit https://prizepicks.onelink.me/LME0/COHEN and use code COHEN and get $50 in lineups when you play your first $5 lineup!\n\nSubscribe to Michael\u0027s Substack: https://therealmichaelcohen.substack.com/\nSubscribe to Michael\u0027s YouTube Channel: https://www.youtube.com/@TheMichaelCohenShow\nJoin us on Patreon: https://www.patreon.com/PoliticalBeatdown\nAdd the Mea Culpa podcast feed: https://www.meidastouch.com/tag/mea-culpa-with-michael-cohen\nAdd the Political Beatdown podcast feed: https://www.meidastouch.com/tag/political-beatdown\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-09-19T04:00:00Z",
      "duration": "01:15:57",
      "explicit": false,
      "spotifyId": "2oAiCfzb6tQbcGXHUleeFU",
      "appleId": 1000727446887,
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2oAiCfzb6tQbcGXHUleeFU",
        "apple": "https://podcasts.apple.com/podcast/the-cancel-cult-a-conversation-with-dr-steven-hassan/id1714009198?i=1000727446887"
      }
    },
    {
      "id": "4a9c6af5-e9dd-45f1-a8af-f9205950d5ce",
      "title": "Killing the Cult of Trump \u002B A Conversation With Dr. Steven Hassan",
      "description": "Today on Mea Culpa, I’m joined by Dr. Steven Hassan, mental health expert, founder of the Freedom of Mind Resource Center, and author of several books, including The Cult of Trump. A former cult member turned leading authority on cults and authoritarian control, Dr. Hassan, walks us through how these tactics are being used to manipulate the American public and consolidate Trump’s power. From Supreme Court justices acting as ideological enforcers to mass deportations under the Alien Enemies Act, he explains how psychological warfare, religious extremism, and strategic mind control are shaping the political landscape. Drawing chilling parallels to past authoritarian regimes, this episode sounds the alarm and offers a path to reach those caught in the MAGA movement. Thanks to our sponsors: Shopify: Sign up for a $1 per month trial period at shopify.com/COHEN DeleteMe: Get 20% off your DeleteMe plan by texting COHEN to 64000 Subscribe to Michael\u0027s NEW Youtube Channel: https://www.youtube.com/@TheMichaelCohenShow Join us on Patreon: https://www.patreon.com/PoliticalBeatdown Add the Mea Culpa podcast feed: https://www.meidastouch.com/tag/mea-culpa-with-michael-cohen Add the Political Beatdown podcast feed: https://www.meidastouch.com/tag/political-beatdown Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-04-25T04:00:00Z",
      "duration": "01:12:54.0210000",
      "explicit": false,
      "spotifyId": "2uDv1ge1CRzfHoZye4ebDa",
      "appleId": 1000704842806,
      "youTubeId": "O4NfgZv4XQg",
      "subjects": [
        "Cult-Expert",
        "Qanon",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2uDv1ge1CRzfHoZye4ebDa",
        "apple": "https://podcasts.apple.com/podcast/killing-the-cult-of-trump-a-conversation/id1714009198?i=1000704842806",
        "youtube": "https://www.youtube.com/watch?v=O4NfgZv4XQg"
      }
    },
    {
      "id": "20c81eb5-9af6-4b33-acf1-e3e9ceffdb65",
      "title": "The Dumpster Cult Of Trump Must Go \u002B A Conversation with Steven Hassan",
      "description": "Steven Hassan, PhD, is one of the leading experts on cults and undue influence in the world. A former member of the right-wing Moonie cult, Hassan was deprogrammed 45 years ago and has dedicated his life to helping people out of cults and destructive situations. Dr. Hassan is a licensed mental health professional and has written four books, including The Cult of Trump and the seminal book Combating Cult Mind Control. On Mea Culpa, Steve will explain HOW mind-control works, and how to protect yourself from its grips. He will also address ethical influence as the podcast will address the entire Influence Continuum. Go to SIMPLISAFE.com/meaculpa to protect your home this summer with 20% off any new SimpliSafe system when you sign up for Fast Protect Monitoring. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-08-23T04:00:00Z",
      "duration": "01:19:45.0840000",
      "explicit": true,
      "spotifyId": "68oSVo7oIUYVnRpcWouJu8",
      "appleId": 1000666310624,
      "youTubeId": "bzRjJNoHZb4",
      "subjects": [
        "Cult-Expert",
        "Qanon",
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/68oSVo7oIUYVnRpcWouJu8",
        "apple": "https://podcasts.apple.com/podcast/the-dumpster-cult-of-trump-must-go-a/id1714009198?i=1000666310624",
        "youtube": "https://www.youtube.com/watch?v=bzRjJNoHZb4"
      }
    }
  ]
}