{
  "id": "60dffbbe-3fae-40f1-8fa8-7ad5eb130f00",
  "name": "Meatheads Are Governing America",
  "youTubeChannelId": "UC46WNpA8f8kIRy779b20ZDw",
  "episodes": [
    {
      "id": "8fcab1c8-698c-4075-80cf-2e3cdd9b3718",
      "title": "Lindy Li Left One Cult… and Joined Another | A Warning From an Ex-MAGA, Ex-JW",
      "description": "Lindy Li says she left the Democratic Party because of its extremism, but is she walking straight into another ideological trap? In this video, I speak as someone who’s been there — not just politically, but personally. As an ex-Jehovah’s Witness and former MAGA believer, I know what it’s like to escape one cult... only to find yourself seduced by another one wearing different colors.\n\nMany disillusioned conservatives, ex-Trump supporters, moderate independents, classical liberals, and politically homeless Americans feel trapped in a system that only offers two toxic choices. One is obsessed with identity politics; the other is infatuated with authoritarian strongmen and populist rage. But just because one side is right about some things doesn’t mean they deserve your loyalty. Neither party speaks for the silent majority — the 50% of us stuck between a woke mob and a MAGA cult.\n\nIf you’re tired of Trump 2.0, the neocon revival, or watching freedom of speech get crushed by both parties, you’re not alone. This channel is for dissenting voices, post-partisan thinkers, and those who reject the cult of personality in any form. Subscribe if you\u0027re looking for honest, anti-establishment political commentary that doesn’t pull punches — no matter who\u0027s in power.\n---\n👉 Subscribe for weekly videos that speak to the politically homeless. Let’s build something that actually makes sense.\n👉 If you’re a conservative sick of blind loyalty and media grift, this channel is for you.\n🔔 Subscribe for more anti-cult satire, real conservative values, and political truth bombs.\n----\n#LindyLi #exjw #magacult #cultsurvivor #PoliticallyHomeless #DisillusionedConservatives #AntiCultOfPersonality #TrumpFatigue #FreedomOfSpeech #PostPartisan #DissentingVoices #MAGAExodus #AntiAuthoritarian #CommonSensePolitics\n----\nMy Spreadshop store: https://the-liberal-circus.myspreadshop.com\nPayPal Me: https://paypal.me/keywordresearchco?country.x=PH\u0026locale.x=en_USHere is reason \nJoin this channel: https://www.youtube.com/channel/UC46WNpA8f8kIRy779b20ZDw/join",
      "release": "2025-05-13T03:45:41Z",
      "duration": "00:08:21",
      "explicit": false,
      "youTubeId": "EHghY-MlADo",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=EHghY-MlADo"
      }
    }
  ]
}