{
  "id": "40c46b83-c6fe-446d-bf55-ed317779e50c",
  "name": "Mechanics\u0027 Institute",
  "youTubeChannelId": "UCBdj_mp0p9oqPDzeN-Wjjlg",
  "episodes": [
    {
      "id": "4c3000e8-3426-4124-b1fe-93112d079231",
      "title": "And Then They Were Gone: Teenagers of Peoples Temple from High School to Jonestown",
      "description": "Judy Bebelaar and Ron Cabral were both instructors at Opportunity High, a public alternative school in San Francisco when, in September of 1976, Jim Jones enrolled all the Temple teenagers there. Within nine months, most had been sent to Guyana. Jones had told them that Jonestown was a tropical paradise where they would help create a model society. But by the time the young people arrived, Jonestown had become a jungle prison camp with hard labor and harsh punishments. On November 18, 1978, 918 people—one-third under eighteen, one-half in their twenties or younger—perished in the murder/suicides, the largest number of American civilians to be killed until September 11, 2001. Judy Bebelaar will talk about the idealistic young people from the Temple she and Ron met at Opportunity. The book follows their students to Jonestown and tells about the few survivors. To quote Judy from the Preface, “We hope this story about our young students—their hopes, their poetry, their efforts to help make a better world—will bring some light to the dark story of Jonestown.”\n\nAnd Then They Were Gone: Teenagers of Peoples Temple from High School to Jonestown by Judy Bebelaar and Ron Cabral has now won ten honors and awards, including four first prizes; the most recent a first from Chanticleer International Book Awards, the Nelly Bly journalistic writing contest. The book is available at your local bookstore via Ingram and Amazon.com.\n\nSeen through the eyes of two of their high school teachers, this book is a work of love and fond memories. It is also a testament to how youth and innocence can be hijacked. The dead cannot speak, yet Bebelaar and Cabral have done just that. It was comforting to hear their voices once more. --Deborah Layton, author of Seductive Poison: A Jonestown Survivor’s Story of Life and Death in the Peoples Temple",
      "release": "2020-11-19T00:05:42Z",
      "duration": "01:05:40",
      "explicit": false,
      "youTubeId": "oqDJ8h6WeP8",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=oqDJ8h6WeP8"
      }
    }
  ]
}