{
  "id": "244f7e2f-fac8-42f2-9c52-2943a446bff4",
  "name": "MedCircle",
  "spotifyId": "3NkI1UqUQE0VYUhdhe84s2",
  "appleId": 1836292339,
  "youTubeChannelId": "UCyGOloOIJWt8NlE4tnejQeA",
  "episodes": [
    {
      "id": "320c3275-7f09-4676-8ea0-ce197bb22ab6",
      "title": "The 4 Attachment Styles \u0026 How They Affect Us",
      "description": "Attachment styles play a vital role in the health of our relationships. Dr. Judy Ho explains the different types of attachment styles, their origins and how they influence our lives. She highlights the importance of understanding these styles to improve relationships and mental wellness. Dr. Judy also provides an overview of secure and insecure attachment styles and their impact on behavior. Recognizing and challenging unhelpful attachment beliefs can lead to healthier relationships and a more fulfilled life.\n\n#attachmentstyles #attachment",
      "release": "2026-01-05T11:01:08Z",
      "duration": "00:09:22",
      "explicit": false,
      "youTubeId": "YPKx31bF73s",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YPKx31bF73s"
      }
    },
    {
      "id": "40dffe7d-a3b3-4bb3-b00d-7719e9fbf6c2",
      "title": "How to Tell If Someone You Love Is a Sociopath | @DoctorRamani",
      "description": "Dr. Ramani Durvasula explains how to identify sociopathic traits in a partner, emphasizing behavioral patterns like verbal abuse and manipulation. She discusses the range of symptoms from emotional abuse to physical violence and urges seeking professional help. Dr. Ramani highlights the importance of evidence in therapy and assures that sociopathic individuals are unlikely to change. The choice lies in enduring or leaving the relationship. She also emphasizes the value of authenticity in therapy and the common oversight of red flags in relationships.\n\n#sociopath #personalitydisorder #aspd",
      "release": "2025-11-13T00:00:34Z",
      "duration": "00:12:27",
      "explicit": false,
      "youTubeId": "QrdsZn5EI0g",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QrdsZn5EI0g"
      }
    },
    {
      "id": "1853192b-56f0-48c4-83c9-b4b1596678a4",
      "title": "Leaving a Cult \u0026 Living with Purpose | Flor Edwards",
      "description": "Flor Edwards shares her extraordinary journey from growing up in the apocalyptic cult Children of God to becoming a beacon of healing and hope. Born into a world where death seemed imminent and freedom was an illusion, Flor\u0027s story is a testament to the unbreakable human spirit.\n\n#cult #narcissism",
      "release": "2025-10-01T11:01:42Z",
      "duration": "02:09:28",
      "explicit": false,
      "spotifyId": "5Q1YgVTZAU5VFa4qC9AAJz",
      "appleId": 1000729487042,
      "youTubeId": "tpB9Ap96TaU",
      "subjects": [
        "Children Of God",
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Q1YgVTZAU5VFa4qC9AAJz",
        "apple": "https://podcasts.apple.com/podcast/leaving-a-cult-living-with-purpose-flor-edwards/id1836292339?i=1000729487042",
        "youtube": "https://www.youtube.com/watch?v=tpB9Ap96TaU"
      }
    },
    {
      "id": "a590b2f2-7a11-4728-a150-dd3e46a06c86",
      "title": "Growing Up In A Cult",
      "description": "Flor Edwards was born into the apocalyptic cult Children of God. Throughout her childhood, she lived in 24 different locations preaching the cult leader’s narrative, which was: all of its members, like Flor, were “chosen” martyrs charged with saving the world from the Antichrist before a supposed apocalypse in 1993. \n\nWhen this date came and went and the world didn’t end, Flor went from anticipating death to facing the possibility of life.\n\nIn this video, discover what it was like for Flor Edwards to grow up in a cult.\n\nIn our FULL eye-opening series, you’ll learn what it was like for Flor to grow up in the confines of a cult and how its narrow constructs initially shaped her beliefs about life, love, and relationships. \n\nYou’ll discover what it was like to leave the only world she’d ever known after the cult disbanded, and how she navigated the tricky road of reconstructing her belief system as a teenager. \n\nAbove all, you’ll understand how she faced the mental health impacts that resulted from each stage of her journey.\n\nUnlike most media coverage of stories like Flor’s, this series doesn’t sensationalize. It educates. Flor’s journey is extraordinary, but it\u0027s relatable. \n\nWe all have obstacles to overcome and the ability to learn from them in order to create the life that we want, just like Flor has. Flor has rewritten her narrative since leaving the Children of God. \n\nThis series provides real insight into this authentic narrative - not the one sensationalized by most media outlets.\n\n #cults #mentalhealth #psychology",
      "release": "2022-08-05T19:30:00Z",
      "duration": "00:31:22",
      "explicit": false,
      "youTubeId": "4foRRIV2II8",
      "subjects": [
        "Children Of God",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4foRRIV2II8"
      }
    }
  ]
}