{
  "_ts": 0,
  "id": "244f7e2f-fac8-42f2-9c52-2943a446bff4",
  "name": "MedCircle",
  "youTubeChannelId": "UCyGOloOIJWt8NlE4tnejQeA",
  "episodes": [
    {
      "id": "a590b2f2-7a11-4728-a150-dd3e46a06c86",
      "title": "Growing Up In A Cult",
      "description": "Flor Edwards was born into the apocalyptic cult Children of God. Throughout her childhood, she lived in 24 different locations preaching the cult leader’s narrative, which was: all of its members, like Flor, were “chosen” martyrs charged with saving the world from the Antichrist before a supposed apocalypse in 1993. \n\nWhen this date came and went and the world didn’t end, Flor went from anticipating death to facing the possibility of life.\n\nIn this video, discover what it was like for Flor Edwards to grow up in a cult.\n\nIn our FULL eye-opening series, you’ll learn what it was like for Flor to grow up in the confines of a cult and how its narrow constructs initially shaped her beliefs about life, love, and relationships. \n\nYou’ll discover what it was like to leave the only world she’d ever known after the cult disbanded, and how she navigated the tricky road of reconstructing her belief system as a teenager. \n\nAbove all, you’ll understand how she faced the mental health impacts that resulted from each stage of her journey.\n\nUnlike most media coverage of stories like Flor’s, this series doesn’t sensationalize. It educates. Flor’s journey is extraordinary, but it\u0027s relatable. \n\nWe all have obstacles to overcome and the ability to learn from them in order to create the life that we want, just like Flor has. Flor has rewritten her narrative since leaving the Children of God. \n\nThis series provides real insight into this authentic narrative - not the one sensationalized by most media outlets.\n\n #cults #mentalhealth #psychology",
      "release": "2022-08-05T19:30:00Z",
      "duration": "00:31:22",
      "explicit": false,
      "youTubeId": "4foRRIV2II8",
      "subjects": [
        "Children Of God",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4foRRIV2II8"
      }
    }
  ]
}