{
  "_ts": 0,
  "id": "42380ba0-9742-4b57-888d-48f36aba3474",
  "name": "Meditation Conversation",
  "appleId": 1442136034,
  "episodes": [
    {
      "id": "4c7e6354-f6f2-4693-842d-8b206e9d279a",
      "title": "290. Escaping the Chains: A Former Jehovah\u0027s Witness Exposes Cult\u0027s Manipulation and Emotional Abuse - Scott Homan",
      "description": " \n  In the folds of a seemingly regular family, Scott Homan\u0027s journey began. But little did he know what would unravel before his eyes. A battle between two opposing ideologies shaped his early years, but what he discovered went beyond mere disagreement. Brace yourself as the story unfolds, revealing the dark underbelly of a faith that demanded everything. And as the echoes of his past reverberate, Scott\u0027s quest for freedom and identity takes an unexpected turn.\n \n  In this episode, you will be able to:\n \n    Uncover personal stories about the transition from a Jehovah\u0027s Witness to awakening independence.\n   Discover the underlying challenges faced by Jehovah\u0027s Witness artists after leaving the cult.\n   Come face-to-face with the perils of cult dynamics and the ostracizing and shunning practices of Jehovah\u0027s Witnesses.\n   Embark on a journey of self-discovery, rational thinking, and individual belief system development.\n   \n  My special guest is Scott Homan.\n \n  Scott is an unconventional filmmaker with a unique route into the industry.\n Born and raised in the wild northwoods of Wisconsin, Scott originally immersed himself in the regional music scene before transitioning to local news production. His roots in photography and digital media further honed his skills, ultimately culminating in the launch of his company, Banana Island Films.\n Scott\u0027s work marries his artistic talent with an intense personal journey, uncovering and challenging the oppressing practices within cults. He thrives in sharing untold stories of artists like himself, who have managed to escape such environments and flourished - a testimony to his resilient spirit.\n \n  The key moments in this episode are:\n 00:00:14 - Introduction\n \n 00:02:12 - Signs of Being Bound\n \n 00:04:02 - Scott\u0027s Background and Approach\n \n 00:08:30 - Personal Awakening\n \n 00:12:29 - Choosing Truth\n \n 00:14:45 - Personal Experience with Jehovah\u0027s Witnesses\n \n 00:15:31 - Putting on a New Personality\n \n 00:17:13 - Shunning and its Impact\n \n 00:20:24 - Compassion for Those Still in the Religion\n \n 00:24:23 - Cult-like Structures in Society\n \n 00:28:43 - Questioning Faith and Leaving Religion\n \n 00:34:11 - Rebuilding a Worldview and Meaning\n \n 00:36:59 - Spirituality and Personal Exploration\n \n 00:39:33 - The Commercialization of Spirituality\n \n 00:41:59 - Energetic Dart and Spiritual Retreats\n \n 00:43:05 - Rebuilding and Self-Trust\n \n 00:44:11 - Seeking Help and Personal Growth\n \n 00:46:21 - Lack of Qualifications in the Spiritual Community\n \n 00:50:28 - Prayer and Internal Self-Reliance\n \n 00:57:07 - Ways to watch the podcast\n \n 00:57:16 - Appreciation for the conversation\n \n 00:57:23 - Request for sharing,\n \n\n \n    Visit Witness Underground to watch the documentary and hear the stories of former Jehovah\u0027s Witness cult members who are artists..\n   Check out the Witness Underground podcast and YouTube series, XJW coming out.\n   Visit Karagoodwin.com or themeditationconversation.com for more information and links to the podcast sponsors.\n   Share this episode with anyone in your life who would be interested in the topic of artists escaping cults.\n   Subscribe to The Meditation Conversation podcast and rate and review the show to support its growth.\n   Take responsibility for your own spiritual journey and regularly check in with yourself to ensure you are aligned with your soul.\n   Ask your Higher Self for signs that you are on the right path and trust your intuition.\n   Be courageous and willing to dismantle the structures in your life that are not aligned with your truth and integrity.",
      "release": "2023-10-05T08:44:00Z",
      "duration": "00:57:53",
      "explicit": false,
      "appleId": 1000630289282,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/290-escaping-the-chains-a-former-jehovahs/id1442136034?i=1000630289282"
      }
    }
  ]
}