{
  "id": "d1ba4e19-1f89-48d2-8162-f366e5fb3034",
  "name": "Mega Maniacs",
  "spotifyId": "252Ent7EkVKOaCpy6qc4XP",
  "youTubeChannelId": "UCgMdoSukt5yLrM-84_pa1hw",
  "episodes": [
    {
      "id": "36659c46-9b17-4310-b365-9e6898880256",
      "title": "Escaping The Cult of World Harvest Church-Live Interview with Sandy DiVa: Mandela Effects Podcast",
      "description": "WELCOME, EVERYONE! Tonight, we will explore a topic other than the Mandela Effect! The topic: the CULT that is World Harvest Church and the personal experiences of Robyn Torgrimson \u0026 Josh! \nIf you haven’t questions, please save them until after the interview portion. Thank you \u0026 we hope you enjoy the show!\n\nSubscribe to MegaManiacs Robyn for more content like this!\n   / @megamaniacs-2024  \n______________\nOutro music care of Jeff Zanzibar with the “help of FRIEND” MrSuper! \u0026 also Boston Ray\nJEFF Song Parody Channel:    / @crazysongparodies669  \nBOSTON RAY MUDFLOOD ADVENTURES: https://tinyurl.com/Boston-Ray\nMRSUPERSIDEWINDER: https://tinyurl.com/MrSuper\n______________\nALL MUSIC \u0026 SOUND \u0026 SOME VIDEO, UNLESS OTHERWISE STATED, ARE PROVIDED BOTH COPYRIGHT FREE \u0026 SHARING FREE, WITH NO CREDIT NEEDED, THROUGH MY PAID POWER DIRECTOR VIP LICENSE \u0026 PAID GETTY IMAGES \u0026 MUSIC LICENSE\nSome graphics \u0026/or video footage provided free with credit from Vecteezy: https://www.vecteezy.com\n——————————\nWAYS TO SUPPORT MY WORK\nEvery single one of these helps to support my work, my channel \u0026 lets me know you appreciate \u0026 enjoy the content I make for you! \n1. The easiest (\u0026 FREE) way to support my channel: Please SHARE, LIKE \u0026 SUBSCRIBE so you  \n    never miss a video, short or live show!\n2. CashApp: https://cash.app/$MESandyDiVa\n3. Super Thanks: One Time Donation (takes a month or more to get)\n4. PayPal: https://www.paypal.me/SandraDiVenanzo\n5. Zelle: sandydivamandelaeffects@gmail.com \n6. Ko-fi: https://ko-fi.com/sandydiva \n7. Venmo: https://venmo.com/u/MESandyDiVa \n8. NEW Channel Merch store is COMING SOON!\n9. Amazon List of things needed for Improved Content: https://a.co/94SfItE\n————————————\nWHERE TO FIND ME:\nEmail: SandyDiVaMandelaEffects@gmail.com\nYoutube:    / @sandydiva  \nRumble: https://rumble.com/c/MandelaResidueRe...\nTikTok: https://www.tiktok.com/@sandy.diva.me...\nFlickr: https://www.flickr.com/photos/sandydi...\nX: @ResidueResearch\n———————————\nSUB TO MY CO-HOSTS!:\nSPLATTERIV/XX: https://tinyurl.com/SPLATTER420\nSAG. ARM MANDELA EFFECT (Jose):    / @mandela-effect-sag-arm   \nREAL OR NOT FOR REAL:    / @realornotforreal  \nPUSHNBUTTONS62    / @pushnbuttons62  \nASTRAL FUGITIVE    / @astralfugitive  \n———————————\nWHERE TO FIND MY FRIENDS:\nJEFF ZANZIBAR/JC GOOF \u0026 MAMACITA PARODIES: \nYoutube: https://youtube.com/@JeffZanzibar1976...\nRumble: https://rumble.com/user/Jasper76\nHebro77: I am a co-host on Shifty Sunday\n   / @ghostbusterguy20011   \nCURIOUS\u0026 CURIOUSER:\nLIVE Shows:    / @curiouscuriouser1352  \nOLD Videos:    / @poijkluh  \nPROPAGATE THIS LIGHT:    / @propagatethislight  \n\n#Cult #ChurchCult #WorldHarvestChurch #WHC #HarvestPrep #OhioMegachurch #RodParsley #PastorRod #Megamaniacs #WorldHavestFranchise #HCN #HarvestChurchNetwork #LeavingACult #Charlatan #LeapofFAith #WatchPArty #Rumble #RumbleAfterParty #FYP #fraudpastor #deciever #foryoupage #liveinterview #recommended #HomeScreen #youtubefyp\n\n\n🎙️ New to streaming or looking to level up? Check out StreamYard and get $10 discount! 😍 https://streamyard.com/pal/d/6746390351708160",
      "release": "2026-02-06T03:51:43Z",
      "duration": "02:36:49",
      "explicit": false,
      "youTubeId": "g4UkPuD1-jA",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=g4UkPuD1-jA"
      }
    },
    {
      "id": "141ad388-3788-4460-804c-d518c7708897",
      "title": "Mega Maniacs Podcast Season 2 Episode 10 - Mallory",
      "description": "In this episode, we dive into the story of a Christian college student who found herself in a place that felt less like a community of faith and more like a cult. From dealing with outlandish rules that governed every aspect of her life to the troubling expectation to worship the pastor instead of God, she shares her journey of confusion, faith, and eventual freedom. Join us as we explore how she navigated the pressures of man-made traditions, the toxic culture of idolizing leadership, and what it means to stand firm in your faith when everything around you feels wrong.",
      "release": "2024-09-17T00:00:00",
      "duration": "01:16:30.9760000",
      "explicit": false,
      "spotifyId": "6nijY3B79ubIYlXmLfiVKd",
      "youTubeId": "DieZzZ06v6g",
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nijY3B79ubIYlXmLfiVKd",
        "youtube": "https://www.youtube.com/watch?v=DieZzZ06v6g"
      }
    },
    {
      "id": "2c1e541c-2ec0-4fe6-aafd-7cb84bf59f0f",
      "title": "Mega Maniacs Podcast Season 2 Ep 9 - Betrayed by the Pulpit",
      "description": "In this episode, we explore the devastating story of a child who was molested by a church elder, only for the crime to go unaddressed for years. When the victim bravely came forward to report the abuse as an adult, the church leadership chose to protect their own instead of seeking justice. We’ll discuss the painful impact of such betrayal, the spiritual and emotional wounds it leaves, and how the Church must respond to allegations of abuse with truth, transparency, and accountability. It\u0027s a conversation about breaking the silence, healing, and restoring trust in faith communities.",
      "release": "2024-09-10T00:00:00",
      "duration": "00:38:45.2260000",
      "explicit": false,
      "spotifyId": "5toIYRok4whvS1x0U0DKys",
      "youTubeId": "zoHPa26CnHk",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5toIYRok4whvS1x0U0DKys",
        "youtube": "https://www.youtube.com/watch?v=zoHPa26CnHk"
      }
    },
    {
      "id": "6968e54d-30b3-45cc-96c1-8c050f59f447",
      "title": "Mega Maniacs Podcast Season 2 Episode 8 - Michael",
      "description": "In this gripping episode, we dive into the harrowing experience of a former acting security director who dedicated years of service to a church, only to face mistreatment and betrayal by the very leaders he trusted. Our guest shares the emotional journey of standing guard over a community of faith, protecting them from external threats, while grappling with the internal challenges posed by manipulative and abusive church leaders. Through his story, we explore the complex dynamics of power, loyalty, and the personal cost of speaking out against those in positions of authority. Tune in for a candid conversation about the darker side of religious institutions, and the strength it takes to reclaim one\u0027s voice after being silenced.",
      "release": "2024-08-27T00:00:00",
      "duration": "02:14:29.5470000",
      "explicit": false,
      "spotifyId": "4jXXu4r3ty5eMN5tj9HR7K",
      "youTubeId": "AwPGO3bu-Tw",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4jXXu4r3ty5eMN5tj9HR7K",
        "youtube": "https://www.youtube.com/watch?v=AwPGO3bu-Tw"
      }
    },
    {
      "id": "70f0349b-fbd4-421b-b14b-f7b265b741ae",
      "title": "Mega Maniacs Podcast Season 2: Episode 7 - Tyler",
      "description": "In this powerful episode, we hear from a former Valor Christian College student and online graduate, who bravely shares their story of witnessing and enduring abuse, mistreatment, and manipulation at the hands of those who were supposed to lead with Christ\u0027s love. This testimony sheds light on the dark side of spiritual authority gone wrong, exploring how the misuse of power by so-called Christian leaders can leave deep emotional and spiritual scars. Through their experience, we discuss the importance of discernment, the dangers of blind trust, and the hope for healing and restoration through true faith. Join us as we uncover the hard truths and find strength in the journey toward recovery and renewed faith.",
      "release": "2024-08-20T00:00:00",
      "duration": "02:24:41.1310000",
      "explicit": false,
      "spotifyId": "1O4wrvXLoPBJKTF73O8E6O",
      "youTubeId": "JwE5KgqVqTw",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1O4wrvXLoPBJKTF73O8E6O",
        "youtube": "https://www.youtube.com/watch?v=JwE5KgqVqTw"
      }
    },
    {
      "id": "0e0fc229-0042-49ff-b610-28b37def3638",
      "title": "Mega Maniacs Podcast Season 2 Episode 5 Mystery Guest Part 2",
      "description": "In this powerful episode, we sit down with mystery guest, who bravely shares their personal journey of enduring racism and abuse at the hands of church leaders. Join us as we delve into their experiences, uncovering the painful realities and systemic issues within religious institutions. This candid conversation sheds light on the intersection of faith, race, and power, and explores the path towards healing and justice. Don\u0027t miss this eye-opening and thought-provoking discussion.",
      "release": "2024-08-07T00:00:00",
      "duration": "01:23:43.7220000",
      "explicit": true,
      "spotifyId": "0QoOwu2QozuQV0I2r6s2VQ",
      "youTubeId": "TAFUiiK0-2A",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0QoOwu2QozuQV0I2r6s2VQ",
        "youtube": "https://www.youtube.com/watch?v=TAFUiiK0-2A"
      }
    },
    {
      "id": "4c79b51b-b410-42a7-9189-466a8b20bc20",
      "title": "Mega Maniacs Podcast Season 2 Episode 5 - Mystery Guest Part 1",
      "description": "In this powerful and eye-opening episode, we sit down with a mystery guest who bravely shares their harrowing experience of abuse within a church where sexual sin was alarmingly prevalent. This deeply personal account sheds light on the hidden scars and lasting impact of such traumatic events. Join us as we uncover the truth, discuss the complex emotions involved, and explore the journey towards healing and resilience. This episode is a stark reminder of the importance of speaking out and supporting survivors everywhere.",
      "release": "2024-08-06T00:00:00",
      "duration": "02:00:48.2560000",
      "explicit": true,
      "spotifyId": "1V4UMV2ks5v5sklzlCRcaP",
      "youTubeId": "F0kACwHLpVA",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1V4UMV2ks5v5sklzlCRcaP",
        "youtube": "https://www.youtube.com/watch?v=F0kACwHLpVA"
      }
    },
    {
      "id": "923ba7e0-7f4c-46e1-8618-e4cf284b082a",
      "title": "Mega Maniacs Podcast Season 2 Episode 4 Pastor Dan",
      "description": "In this powerful episode, we sit down with a former courageous church staff member who witnessed troubling events behind closed doors. They share their firsthand account of sexual misconduct, abusive language, and violent behavior from church leadership. Our guest also reveals instances of threats to their life, violence towards animals, and deceitful practices aimed at extracting more money from the congregation and viewers of the tv broadcasts. This eye-opening conversation sheds light on the dark side of WHC and the impact of such behavior on those who work and attend there. Join us for an important discussion about accountability, healing, and the pursuit of truth.",
      "release": "2024-07-30T00:00:00",
      "duration": "01:44:59.4770000",
      "explicit": false,
      "spotifyId": "0lWmZJ1eftOqFcJngNQGeS",
      "youTubeId": "Bk_YXx_F0Mk",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0lWmZJ1eftOqFcJngNQGeS",
        "youtube": "https://www.youtube.com/watch?v=Bk_YXx_F0Mk"
      }
    },
    {
      "id": "0291576f-af64-4533-91a9-5ced884e66a5",
      "title": "Mega Maniacs Podcast Season 2 Episode 3 - Todd and Stephanie",
      "description": "In this heartfelt episode, join us as we dive into the harrowing and deeply personal story of a husband and wife who faced abuse and mistreatment at the hands of their church and lead pastor. From manipulation and betrayal to emotional and spiritual harm, their journey is a powerful testament to resilience and the human spirit. Listen as they share their experiences, the challenges they overcame, and the path to healing and redemption. This episode sheds light on the often-hidden dark side of religious institutions and offers hope to those who may be going through similar struggles. Tune in for a raw and honest conversation that is both eye-opening and inspiring.",
      "release": "2024-07-23T00:00:00",
      "duration": "01:11:19.9780000",
      "explicit": false,
      "spotifyId": "0O1y1uXD0Y3dGqCp67T7dF",
      "youTubeId": "vDdqsaZExBk",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0O1y1uXD0Y3dGqCp67T7dF",
        "youtube": "https://www.youtube.com/watch?v=vDdqsaZExBk"
      }
    },
    {
      "id": "80a3b675-0fdb-422e-a2dc-6c78fb9475be",
      "title": "Mega Maniacs Podcast Episode 14 - The Puppet Master",
      "description": "In this gripping episode, we delve into the unsettling world of a church community under the spell of a narcissistic pastor. Behind the façade of spiritual guidance and leadership lies a manipulative figure who controls his congregation and staff with an iron fist. Join us as we uncover the harrowing stories of staff members who have endured his relentless berating and belittling, leaving them questioning their worth and their faith. Through an expert analysis, we expose the toxic dynamics at play and explore the psychological impact of such domineering leadership. Tune in for a compelling exploration of power, manipulation, and the courage it takes to reclaim one\u0027s voice in the face of spiritual abuse.",
      "release": "2024-06-19T00:00:00",
      "duration": "00:56:21.2690000",
      "explicit": false,
      "spotifyId": "1XOqbdJELIo1FlqhUOqXUM",
      "youTubeId": "9uB3b5SDVaA",
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1XOqbdJELIo1FlqhUOqXUM",
        "youtube": "https://www.youtube.com/watch?v=9uB3b5SDVaA"
      }
    },
    {
      "id": "c6000e67-0695-4706-99b2-06d25cc50f6b",
      "title": "Mega Maniacs Podcast Episode 13 - Abuse of Power",
      "description": "In this eye-opening episode, we delve into the dark underbelly of power dynamics within World Harvest Church. We uncover the complex interplay of faith, authority, and betrayal. We\u0027ll examine the systemic issues that allow such abuses to persist and discuss the path toward healing and justice. This episode is a must-listen for anyone seeking to understand the profound impact of power abuse in places meant to be sanctuaries of trust and solace.",
      "release": "2024-06-11T00:00:00",
      "duration": "00:42:57.9620000",
      "explicit": false,
      "spotifyId": "1gcJCdk0C1VYCNNGmZuTsy",
      "youTubeId": "nXMZUZgAvVc",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gcJCdk0C1VYCNNGmZuTsy",
        "youtube": "https://www.youtube.com/watch?v=nXMZUZgAvVc"
      }
    },
    {
      "id": "6f0dcaf9-71fb-40ac-b22f-b828c5874ba2",
      "title": "Mega Manics Podcast Episode 12 - Holy Terror",
      "description": "n this episode, we delve into a troubling and often overlooked issue within church communities: verbal abuse by church leaders. We explore a recent case where Rod Parsley was found to be openly and publicly berating his staff. In this episode, we seek to understand the impact of such behavior and discuss steps toward healing and accountability. Join us as we uncover the signs of verbal abuse in a spiritual setting, examine the repercussions for both individuals and the congregation. It\u0027s time to bring this dark side of church leadership into the light and advocate for a healthier, more respectful environment for all. **Trigger Warning:** This episode discusses verbal abuse and may be distressing for some listeners. Please listen with care.",
      "release": "2024-06-04T00:00:00",
      "duration": "00:21:30.7940000",
      "explicit": false,
      "spotifyId": "1np6udCeuJQPqBwnCrtC21",
      "youTubeId": "P-3_mcny_oI",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1np6udCeuJQPqBwnCrtC21",
        "youtube": "https://www.youtube.com/watch?v=P-3_mcny_oI"
      }
    },
    {
      "id": "7dee8eba-1587-4eac-9124-0182f113ce4d",
      "title": "Mega Maniacs Podcast Ep. 11 - Unholy Presence-Exposing the Sinister Spirits at World Harvest Church",
      "description": "In this spine-tingling episode of Mega Maniacs, we investigate the eerie occurrences at World Harvest Church. Beneath its pious exterior lies a dark history of sinister spirits and malevolent leaders. Join us as we explore unsettling eyewitness accounts, uncover chilling evidence, and reveal the truth about the evil forces controlling this sacred space. Prepare to confront the darkness that has taken root in the heart of WHC!",
      "release": "2024-05-28T00:00:00",
      "duration": "00:49:33.6740000",
      "explicit": false,
      "spotifyId": "05fnDu6CMguUWJqy22200x",
      "youTubeId": "GlkOIH9IuQQ",
      "urls": {
        "spotify": "https://open.spotify.com/episode/05fnDu6CMguUWJqy22200x",
        "youtube": "https://www.youtube.com/watch?v=GlkOIH9IuQQ"
      }
    },
    {
      "id": "2ff8b049-05a1-478e-b9b7-149079f06107",
      "title": "Mega Maniacs Podcast Episode 10 - HPS: The Aftermath",
      "description": "Description: In this eye-opening episode, we dive into the challenges faced by a Christian school grappling with ineffective leadership and its profound impact on students. Join us as we explore how poor support from administration has left students struggling academically and emotionally, falling significantly behind their peers. Through candid messages from teachers, parents, and students, we uncover the root causes of the school\u0027s issues and discuss potential solutions to restore faith in the institution. Tune in for a compelling discussion on the importance of strong leadership in education and the urgent need for change to ensure a brighter future for these students.",
      "release": "2024-05-21T00:00:00",
      "duration": "00:33:04.2130000",
      "explicit": false,
      "spotifyId": "4bxEraXYxBTxmFFS3XMBQ0",
      "youTubeId": "53ZRm_iekc0",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4bxEraXYxBTxmFFS3XMBQ0",
        "youtube": "https://www.youtube.com/watch?v=53ZRm_iekc0"
      }
    },
    {
      "id": "64aae343-62e8-4ecd-a6dd-73bf25a03bb7",
      "title": "Mega Maniacs Podcast Episode 9 - Ethical Education",
      "description": "Step into the controversial world of a Christian school plagued by ethical dilemmas in this eye-opening episode. Uncover the hidden truths behind questionable practices, from discriminatory policies to questionable teachings. Explore the moral complexities and the journey towards accountability in an institution built on faith but challenged by its own moral compass. Tune in as we delve deep into the shadows of an institution grappling with its identity and impact.",
      "release": "2024-05-14T00:00:00",
      "duration": "00:54:49.6000000",
      "explicit": false,
      "spotifyId": "1YXomqBIy2nP5k8kenb98X",
      "youTubeId": "_WKReHJsq6Q",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YXomqBIy2nP5k8kenb98X",
        "youtube": "https://www.youtube.com/watch?v=_WKReHJsq6Q"
      }
    },
    {
      "id": "f23980fa-9218-4eee-91df-71a3c6eff6cc",
      "title": "Mega Maniacs Podcast Episode 8 - Faithful but Forsaken",
      "description": "This episode tackles unveiling Discrimination in the Church. We will be delving into the often overlooked realm of discrimination within religious communities. Join us as we engage in candid discussions, sharing personal stories and strategies for fostering inclusivity and understanding in faith-based settings. From race and gender, to downright favoritism toward certain staff, we confront the complexities head-on, aiming to illuminate the atrocities at WHC regarding discriminatory practices throughout the organization!",
      "release": "2024-05-01T00:00:00",
      "duration": "00:34:34.6450000",
      "explicit": false,
      "spotifyId": "50Fk4LZPw9TGUyO5LxOqE2",
      "youTubeId": "W27HiQucGr4",
      "urls": {
        "spotify": "https://open.spotify.com/episode/50Fk4LZPw9TGUyO5LxOqE2",
        "youtube": "https://www.youtube.com/watch?v=W27HiQucGr4"
      }
    },
    {
      "id": "dc16b791-f256-4c45-8988-3d9f75d53488",
      "title": "Mega Maniacs Podcast Episode 7 - Who is Tim Anderson?",
      "description": "In this gripping episode, we unravel the layers of deception as we delve into the clandestine world of “hiding” in plain sight amongst unsuspecting staff. Explore the dark underbelly of power and manipulation, as we shine a light on the shocking truth lurking behind the facade of piety. Tune in as we navigate the treacherous waters of deceit and expose the secrets within the sacred walls of the church.",
      "release": "2024-04-23T00:00:00",
      "duration": "00:28:25.3860000",
      "explicit": false,
      "spotifyId": "4cM1bMlmBSY6cN12GXG2Kz",
      "youTubeId": "ODksKtNL9Nw",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cM1bMlmBSY6cN12GXG2Kz",
        "youtube": "https://www.youtube.com/watch?v=ODksKtNL9Nw"
      }
    },
    {
      "id": "5be82a83-33a1-48ba-a0b3-f33dfe3db638",
      "title": "Mega Maniacs Podcast Episode 6 - My Why",
      "description": "In this episode, join us as we delve into the depths “why” I’m so compelled to discuss abuses in the workplace especially a religious workplace! We uncover the shadows that have long shrouded the truth, shedding light on the systemic injustices and the brave individuals who dare to speak out. From some of my personal testimony, we embark on a journey of revelation and resilience as we confront the uncomfortable truths and explore the path towards healing and accountability. Tune in and become a part of the conversation that challenges the status quo and champions justice",
      "release": "2024-04-16T00:00:00",
      "duration": "00:29:32.6720000",
      "explicit": false,
      "spotifyId": "20mduF63CABGCsfXNAFjBy",
      "youTubeId": "TloTf8xh9kw",
      "urls": {
        "spotify": "https://open.spotify.com/episode/20mduF63CABGCsfXNAFjBy",
        "youtube": "https://www.youtube.com/watch?v=TloTf8xh9kw"
      }
    },
    {
      "id": "f095508e-d34f-475c-ab20-a598e8aada99",
      "title": "Mega Maniacs Podcast Episode 5 - The Gospel of Greed",
      "description": "In this episode, we examine a challenging topic: the disparity between the outward generosity of a church and the treatment of its own staff. We explore the tension between lavish gifts for guests, friends and leadership and neglect towards those who serve within the church walls. Tune in as we navigate the complexities of faith and practice, seeking to uphold the principles of justice and love within our spiritual communities.",
      "release": "2024-04-09T00:00:00",
      "duration": "00:26:46.2500000",
      "explicit": false,
      "spotifyId": "3jXV2YOYPAdKDk4zlti2jC",
      "youTubeId": "NqwwC65XVSw",
      "urls": {
        "spotify": "https://open.spotify.com/episode/3jXV2YOYPAdKDk4zlti2jC",
        "youtube": "https://www.youtube.com/watch?v=NqwwC65XVSw"
      }
    },
    {
      "id": "a33f8e08-a703-4659-8994-b940d94b1879",
      "title": "Mega Maniacs Podcast Episode 4 - Let Us Prey",
      "description": "In this episode, we discuss the predatory behavior of leadership involving several workstudy students and staff at WHC, particularly those that work for and directly with the Parsleys and leadership!",
      "release": "2024-04-02T00:00:00",
      "duration": "00:31:10.1010000",
      "explicit": false,
      "spotifyId": "5GLkc2NPJSA55bsVhkvQkq",
      "youTubeId": "0sb9eDsOj-8",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5GLkc2NPJSA55bsVhkvQkq",
        "youtube": "https://www.youtube.com/watch?v=0sb9eDsOj-8"
      }
    },
    {
      "id": "524ab064-3ca0-4992-873a-99f7657fca7a",
      "title": "Mega Maniacs Podcast Episode 3 - Buy Your Blessing",
      "description": "In this episode, we discuss several ways staff members, parishioners and broadcast watchers are manipulated and pressured into giving money to “receive a blessing” all meanwhile it’s making WHC leadership richer and richer",
      "release": "2024-03-27T00:00:00",
      "duration": "00:40:02.6660000",
      "explicit": false,
      "spotifyId": "5t5uxGtnsT6Baf53ZvK13x",
      "youTubeId": "MWXNVr5Zabo",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5t5uxGtnsT6Baf53ZvK13x",
        "youtube": "https://www.youtube.com/watch?v=MWXNVr5Zabo"
      }
    },
    {
      "id": "dde6b31f-8d0f-4ca1-85fe-52253bb69402",
      "title": "Mega Maniacs Podcast Episode 2 - Typical Tuesdays",
      "description": "In this episode, I discuss the verbal and emotional abuse that occurs in Tuesday’s Service Planning Meetings at World Harvest Church; and if it’s not enough to hear me say it, we have an audio recording of Pastor Parsley, in said meeting on another tirade! Lastly, we talk about the negative effects this behavior has on staff members and how Pastor Parsleys behavior lines up (or doesn’t) with scripture!",
      "release": "2024-03-19T00:00:00",
      "duration": "00:34:17.6850000",
      "explicit": false,
      "spotifyId": "0N5a3KkdUhigRKT87ZvpdN",
      "youTubeId": "MPalwofEMFg",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0N5a3KkdUhigRKT87ZvpdN",
        "youtube": "https://www.youtube.com/watch?v=MPalwofEMFg"
      }
    },
    {
      "id": "ba599a2a-b67e-4e95-89c0-0196a19f3436",
      "title": "Mega Maniacs Podcast Episode 1 - The Smoking Gun",
      "description": "In Ep. 1 of Mega Maniacs, titled The Smoking Gun, we are uncovering the toxic, abusive, and dangerous work environment of WHC! We first define the above, touch on what the EEOC says, and unpack a resignation letter that details the abusive behavior used by PRP to control and manipulate his staff!",
      "release": "2024-03-12T23:00:06Z",
      "duration": "00:26:49.4710000",
      "explicit": false,
      "spotifyId": "6aFtKt2FbXegilQ2pWsjb8",
      "youTubeId": "E1mqE05w4XY",
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aFtKt2FbXegilQ2pWsjb8",
        "youtube": "https://www.youtube.com/watch?v=E1mqE05w4XY"
      }
    }
  ]
}