{
  "id": "06db8670-8351-4192-90c3-ac54c39804dc",
  "name": "MelanieHamlett",
  "youTubeChannelId": "UCRW66WXeQGNdV1NtyAIv0Cg",
  "episodes": [
    {
      "id": "012db444-1b56-4afe-bd0b-1ddd309f3b18",
      "title": "Men Wanna Be a Cult Leaders So Bad—An Interview with Author, Daniella Mestyanek Young",
      "description": "The long form of this interview with Daniella Mestyanek Young (or @KnittingCultLady here) is over 2 hours and can be purchased here (if you don’t want to commit haha) \n\nhttps://www.patreon.com/posts/link-for-live-108237173?utm_medium=clipboard_copy\u0026utm_source=copyLink\u0026utm_campaign=postshare_creator\u0026utm_content=join_link\n\nTo see over a dozen other interviews with incredible  people , join my on Patreon. BUT DON’T JOIN ON THE APP! They will charge you way more!!! Do it on the patreon website! \nhttps://patreon.com/user?u=30750491\u0026utm_medium=unknown\u0026utm_source=join_link\u0026utm_campaign=creatorshare_creator\u0026utm_content=copyLink\n\nDaniella is the author of UNCULTURED: A Memoir \n\u0022A propulsive in the honest tones of a woman who didn\u0027t always think she\u0027d live to tell her story.\u0022 --NYT  \n\n\nDaniella is a Group Behavior Specialist / Veteran / Cult Survivor / Mother / Human.\n\n\u0022Daniella was born a third-generation member of the infamous Children of God religious cult, and grew up being trafficked around the world, before escaping that life and moving to America at age 15. She put herself through high school and graduated as college valedictorian before commissioning into the US Army as an intelligence officer. That’s where she really started to think about group behavior…and seeing it, well, everywhere. \n\nDaniella deployed twice to Afghanistan (2011, 2014) and became a member of one of the Army’s first Female Engagement teams (an experiment that put women into deliberate ground combat for the first time in Army history, and eventually led to the repeal of the sexist combat ban and the gender desegregation of the entire US military). \n\nShe is a proud daughter of the 101st, (that\u0027s the unit in Band of Brothers), and a recipient of the Presidential Volunteer Service Award (from Obama). She earned her Master of Arts in Organizational Psychology at the Harvard Extension School, where she focused her research on group behavior, social norms, culture, extremism, leadership, demagoguery and cults\u0022 \n(see more on her website referenced above)\n\n\nFollow if you’re not already:\n\nSee her website and  pre-order her new book with called The Culting Of America  with co-author @TheWhiteWomanWhisperer :\n\nhttps://knittingcultlady.com/?srsltid=AfmBOorODKkauFdMx00hI9iom59I0AqS7WI4toSJVVlLHDf1GftXOZzE\n \n\nMy articles, podcasts , etc are here: https://linktr.ee/MelanieHamlett\n\nAnd if you’re feeling generous…\n\nVenmo: https://venmo.com/u/Melanie-Hamlett\n\nPayPal : https://www.paypal.me/hamlettwriting\n\nCashapp: https://cash.app/$melaniehamlett77\n\nTo read any or all of my work, (over 60\u002B articles for Harper\u0027s Bazaar, Cosmo, Oprah Magazine, The Guardian, The Washington Post, Huffington Post, The Daily Beast, Glamour Magazine, Outside Magazine, Slate, Playboy, Shondaland, etc, etc) go here:\n https://www.melaniehamlett.com/publications\n\n\nTo access my mini workshop on how to break into writing for big publications, click here: \nhttps://www.melaniehamlett.com/pitching-workshop\n\n#cult #patriarchy #narcissist #survivor #feminism #decentermen #forwomen #charliekirk #america \n#melaniehamlett #empowerwomen #womeninmedia #patriachyproblems # #intersecionalfeminism",
      "release": "2025-09-24T17:52:07Z",
      "duration": "00:42:09",
      "explicit": false,
      "youTubeId": "E6k3bPAwfPE",
      "subjects": [
        "Children Of God",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E6k3bPAwfPE"
      }
    }
  ]
}