{
  "_ts": 0,
  "id": "0f036442-8e65-4a3c-bfbf-8043f63de670",
  "name": "Melissa Rivers\u0027 Group Text Podcast",
  "spotifyId": "0n5xb35lYchlOtYeCrrzda",
  "appleId": 1480914661,
  "youTubeChannelId": "UC6HUVquRPAaeMF-gD5gtxFA",
  "episodes": [
    {
      "id": "6597402e-f636-4009-afab-47bdc0e591d7",
      "title": "Bethany Joy Lenz on Breaking Free of a Cult",
      "description": "Before she was cast on the early-2000s hit series, “One Tree Hill,” actress Bethany Joy Lenz was already in the clutches of a religious group she calls the “Big House Family.” In her new memoir, “Dinner for Vampires,” Bethany describes the calculated isolation a man named “Les” put her through in order to manipulate her and pilfer over $2 million of money she’d earned. Bethany discusses with me how her family dynamics forced her to become independent at a young age, how her aversion to the “small talk” culture of L.A. initially led her to the “Big House Family,” and how ultimately her love for her daughter gave her the strength to leave its clutches. The only way “Group Text” happens is with YOUR support and support from mm amazing sponsors! Try VIIA! Head to Viiahemp.com and use the code GROUPTEXT Looking to lose more than 10 lbs? Let\u0027s get you started with 15% off and free rush shipping so you can add LEAN to you healthy diet and exercise plan. Visit TakeLean.com and enter GROUPTEXT for your discount. That\u0027s promo code GROUPTEXT at TakeLean.com Feeling drained and ready to get your energy and health back on track? Try Field of Greens! Use promo code GROUPTEXT at FieldOfGreens.com to get 15% off your first order and FREE rush shipping! Best day to improve your health is today! Go to UltraLuxHealth.com Get 20% off your order of Red Mini, UltraLux Clean, or Hydrogen Tablets with the promo code GROUPTEXT at checkout. This is another Hurrdat Media Production. Hurrdat Media is a podcast network and digital media production company based in Omaha, NE. Find more podcasts on the Hurrdat Media Network by going to HurrdatMedia.com or the Hurrdat Media YouTube channel! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-12-06T08:00:00Z",
      "duration": "00:43:04.3460000",
      "explicit": false,
      "spotifyId": "3I9HCdwMp2S21WewY4ULDW",
      "appleId": 1000679450250,
      "youTubeId": "7zUq7vcqn-I",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3I9HCdwMp2S21WewY4ULDW",
        "apple": "https://podcasts.apple.com/podcast/bethany-joy-lenz-on-breaking-free-of-a-cult/id1480914661?i=1000679450250",
        "youtube": "https://www.youtube.com/watch?v=7zUq7vcqn-I"
      }
    }
  ]
}