{
  "_ts": 0,
  "id": "07bd8ee0-6e80-4d1d-8def-3eea9d2c9724",
  "name": "Mendy Levy",
  "youTubeChannelId": "UCa3uHQph4vEpVTvUGm1G2ZA",
  "episodes": [
    {
      "id": "8f10e87c-b9b1-4929-9e4f-f9ab38ea6276",
      "title": "Rabbi Shea Hecht with New good Updates on the Lev Tahor Cult.",
      "description": "Video created by: Libby Schwartz (LibbyCS@gmail.com)",
      "release": "2025-03-03T19:23:22Z",
      "duration": "00:03:26",
      "explicit": false,
      "youTubeId": "AuoSaL-NC20",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=AuoSaL-NC20"
      }
    },
    {
      "id": "19981586-c337-4892-a2ed-2de93863cb55",
      "title": "Rabbi Shea Hecht, With new updates on the Dangerous Lev Tahor Cult.",
      "description": "You can donate directly to Rabbi Shea Hecht\u0027s organization, at this link: https://www.NCFJE.org/RescueMission\n\nVideo created by: Libby Schwartz (LibbyCS@gmail.com)",
      "release": "2025-02-13T00:43:51Z",
      "duration": "00:04:29",
      "explicit": false,
      "youTubeId": "365bv2y8sik",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=365bv2y8sik"
      }
    },
    {
      "id": "f76d44d4-b869-46be-9d7f-605097c39d2d",
      "title": "Rabbi Shea Hecht, Calls for immediate action in regard to the Lev Tahor Cult!",
      "description": "Call to action\nThe level of Lev Tahor cult has been busted. But the fight isn’t over. \nWe need your support. The recovery journey has just started.",
      "release": "2025-02-03T01:43:53Z",
      "duration": "00:04:20",
      "explicit": false,
      "youTubeId": "0CzATK2-MkQ",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0CzATK2-MkQ"
      }
    },
    {
      "id": "73127a25-b84e-457f-8d3a-045412bdfa0e",
      "title": "A message from Rabbi Shea Hecht and Rabbi Weiss on the Lev Tahor Cult!",
      "description": "Thank you to Rabbi Shea Hecht and Rabbi Weiss for speaking up on stopping this horrible, dangerous Lev Tahor Cult! \n\nPlease share this message, and we really hope this dangerous Cult will come to an end soon!",
      "release": "2025-01-24T07:18:54Z",
      "duration": "00:06:55",
      "explicit": false,
      "youTubeId": "4qj004JuqTw",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4qj004JuqTw"
      }
    },
    {
      "id": "88fdb663-19d9-464b-b814-319cb73da06b",
      "title": "Yoel Levy,  A Lev Tahor survivor speaking out on the current situation in Guatemala!",
      "release": "2025-01-12T22:56:39Z",
      "duration": "00:03:28",
      "explicit": false,
      "youTubeId": "KlFBSo1IdPQ",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KlFBSo1IdPQ"
      }
    },
    {
      "id": "529e94fc-dd89-4436-9791-1f49ff13f7a7",
      "title": "Yoel Levy, a Lev Tahor Cult victim, speaking on the recent raid in the cult. #levtahor #cult ￼",
      "release": "2025-01-05T19:23:35Z",
      "duration": "00:00:58",
      "explicit": false,
      "youTubeId": "vB6E9NbHjto",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vB6E9NbHjto"
      }
    },
    {
      "id": "326192a5-1ca9-4da4-a9f1-54b578a3cad9",
      "title": "You can watch the full video on YouTube: ​⁠@LivingLchaim  #levtahor #cult",
      "release": "2023-07-09T21:01:18Z",
      "duration": "00:00:18",
      "explicit": false,
      "youTubeId": "YQRR4DUv0fY",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YQRR4DUv0fY"
      }
    },
    {
      "id": "0cd530a1-f1fb-40f1-a107-79a6bf8ca5ff",
      "title": "MENDY LEVY POINTS OUT 10 REASONS WHY LEV TAHOR IS A JEWISH CULT",
      "description": "I was born into Lev Tahor, so I didn\u0027t know better. But now I see the world in a whole new lens. And I\u0027m hoping that this information will help shed more light on cults - so that no one has to experience the darkness I grew up in.\n\nWatch my story: https://youtu.be/TzzYokcjU0Q\n\nFor my information about Lev Tahor: http://www.LevTahorSurvivors.com\n\nFor more information on my journey follow me:\nInstagram - https://www.instagram.com/mendy.levy/\nTwitter - https://twitter.com/Mendy__Levy\n\nMORE ABOUT VOICE AUDIO IN THIS VIDEO:\n\nTeen-aged Lev Tahor teacher asks school principal to clarify his intention in requiring educators to beat children daily, in newly leaked audio.\n\n“I want to know what the principal meant to say when the principal said that ‘petch (a beating) needs to be given daily’?”\n\nThat’s a question asked by a distraught 17 year-old Lev Tahor teacher trying to do his job correctly.\n\nThe audio is included in a newly released YouTube video created to help educate the orthodox Jewish community about cults. \n\n“We recovered the whatsapp voice-note from a source inside the cult,” said Dovid, a member of Lev Tahor Survivors. “The raw audio is a disclosure of Lev Tahor’s horrific methodology. And it’s just the tip of a toxic iceberg.”\n\n\u0022Lev Tahor Survivors investigated the origins of the new audio leaks and have verified the following details,\u0022 said Dovid.\n\nFACTS EXTRACTED FROM AUDIO LEAKED\n\n1. The voice of the young teacher is that of a young man who’s clearly struggling with his directive. (We are withholding his name due to his age.)\u0022\n\n2. The teacher\u0027s boss, Moshe Yosef Rosner, is the principal of the boys and girls schools within the cult. The audio was sent to him on April 9, 2022 - shortly before the Passover holiday.\u0022\n\n3. Sending such audio is a change of norm for the cult. Members of the cult are required to send a detailed handwritten daily report to the leadership. The audio was sent instead of the written report because the teacher was in a different country at the time.\n\nThe teacher was in a Mexico hideout along with approximately 30 other cult members.\n\nThe leadership sent selective members to Mexico that were vulnerable to extradition due to family and/or guardians being outside the cult seeking to rescue their loved ones.\n\n4. Moshe Yosef Rosner was in Guatemala at the time the message was sent to him.\n\nIronically, the principal, Moshe Yosef Rosner was arrested a few months later in Mexico - but released due to \u0022lack of evidence.\u0022\n\nMORE ABOUT THE FILM\n\nThe film also includes a previous audio leak of a former Lev Tahor member recalling a speech given by Yaakov Nachum Weingarten (currently awaiting trial on kidnapping and abuse related charges) instructing mothers to execute their children if the authorities come to remove them from the community.\n\nYaakov Nachum Weingarten is considered the unofficial Rebbe, spiritual leader, of Lev Tahor. He married Moshe Yosef Rosner’s daughter when she was 15 years-old and he was 20. (His older brother Yoel, also married an underage Rosner girl when he was 26.)\n\nThe film parallels some characteristics of the infamous cult, People Temple, and their ultimate mass suicide at Jonestown.\n\n\u0022The reason we made this film\u0022, starts Dovid from Lev Tahor Survivors, \u0022is to define a cult to our Jewish Orthodox community.”\n\n\u0022The orthodox and Chasidic community have, unfortunately, become accustomed to being labeled a \u0027cult\u0027 in popular culture and mainstream media. So when they see Lev Tahor being persecuted as a cult in the media, some in our community mistakenly identify with them and come to their aid.\u0022\n\n“The film was created with a lot of research on cults and includes interviews of Mendy Levy, Rabbi Yaniv Assis, Rabbi Shea Hecht as well as Lev Tahor leaders Uriel Goldman and Shmiel Weingarten.”\n\nMORE ABOUT ME:\nI\u0027m Mendy Levy. I was born and grew up in the Lev Tahor cult. I escaped the cult in protest of the leadership setting me up with my 12-year-old cousin to be married.\n\nI spend my time on the outside trying to save my brothers and sisters still in the cult by bringing awareness to the plight of the blind followers.\n\nA year ago, I shared my story on YouTube in the hopes that people would stop donating to Lev Tahor and help my family get out. To my surprise it garnered close to 6 million views. This is a follow up video that is not only exposing Lev Tahor, but also takes preventative action to educate my friends in the the Chasidic community so that they don\u0027t find themselves in this or other cults.",
      "release": "2022-12-10T22:06:29Z",
      "duration": "00:20:59",
      "explicit": false,
      "youTubeId": "Ec-NFEsD1jw",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ec-NFEsD1jw"
      }
    },
    {
      "id": "7ffd186a-7d89-4ec1-b691-2d4f7398e308",
      "title": "Lev Tahor: Yoel Levy\u0027s Dramatic Escape After 3 Suspicious Deaths",
      "description": "My brother Yoely’s video is out!\n\nYou all saw my film on Lev Tahor. It went viral, brought tons of awareness about the cult, and helped give that extra push for several cult members to escape.\n\nIn fact, as those following me on social media know, I recently traveled to Guatemala to bring help someone who had fled his life of abuse.\n\nNow, watch my brother\u0027s story. It\u0027s loaded with information, and it\u0027s very dramatic.\n\nHis courage is what led to me leaving Lev Tahor and he spent months perfecting his film. Inside, you\u0027ll find newly leaked documents that PROVE some of the abuse (like placing children in other peoples\u0027 homes and throwing people out for vague, nonsense reasons with crazy conditions in order to return). Oh, and by the way, we have TONS more documents to leak and leak they will.\n\nYou MUST watch the video. And when you\u0027re done, channel that anger and share it with everyone you know. And tell them to share it too! The more people are aware of Lev Tahor\u0027s lies, abuse, and murders, the more trouble they\u0027ll have gathering support from certain Chassidim. The more a chance my family and 300 others will be free to live life as they wish (yes, even if they choose to live as strict Chassidic Jews!).\n\nSo share the video like crazy. Tell your friends about it! And give me a follow on Instagram for more regular updates and information as documents and videos continue to leak from Lev Tahor.\n\nLet\u0027s end the abuse!",
      "release": "2022-05-09T22:11:50Z",
      "duration": "00:35:38",
      "explicit": false,
      "youTubeId": "XeV6DPjCW9U",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XeV6DPjCW9U"
      }
    },
    {
      "id": "77c61625-b93c-4ef9-872f-d4cd876a3c58",
      "title": "Uriel Goldman exposed: the mastermind quietly operating Lev Tahor cult",
      "description": "Uriel Goldman has raised millions of dollars to fund the Lev Tahor cult, which has continued to thrive following the death of its leader Shlomo Helbrans.\n\nIn this video, we expose his method of telling people what they want to hear, including numerous outright lies, via leaked audio and video.\n\nLev Tahor\u0027s structure has kept changing since the death of the cult\u0027s leader and the imprisonment of numerous administrative members. The one constant driver managing the fundraising, abuse, and media representation, is Uriel Goldman.",
      "release": "2022-04-21T04:27:00Z",
      "duration": "00:04:05",
      "explicit": false,
      "youTubeId": "KNwybz7d-1Q",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=KNwybz7d-1Q"
      }
    },
    {
      "id": "2a857f3c-7682-44f0-b175-cdcf8481f733",
      "title": "I Grew up in the Extremist Jewish Cult of Lev Tahor I The Story of Mendy Levy",
      "description": "Here is a small part of my story escaping the Lev Tahor Jewish cult after forcing me to marry my 12-year-old cousin. \n\nThis will give you an idea of what Lev Tahor really is. Don\u0027t be fooled by their lies. Watch this video and learn the truth.\n\nFollow me on Instagram for more updates.\nhttps://instagram.com/mendy.levy\n\nPlease share with everyone. Spread the message, don\u0027t give Lev Tahor any money. \nHelp put an end to the abuse of Lev Tahor!\n\nRead More At\nhttps://www.insider.com/lev-tahor-jewish-extremist-group-life-after-escape-2021-11?amp",
      "release": "2021-11-22T00:43:39Z",
      "duration": "00:21:46",
      "explicit": false,
      "youTubeId": "TzzYokcjU0Q",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TzzYokcjU0Q"
      }
    }
  ]
}