{
  "_ts": 0,
  "id": "0d3599c7-8a01-4d53-920b-7372de06e3ae",
  "name": "Mental Matters Hosted By Asekho Toto",
  "spotifyId": "5nb2I3tTNCgrQEPpqbL7Gp",
  "appleId": 1511758808,
  "youTubeChannelId": "UCAC-LzuLdKsy30kIrQVVc-A",
  "episodes": [
    {
      "id": "8f63f836-56b6-47f6-8327-fc970514da15",
      "title": "#196 - Kim Peirano - Escaped Cult Member Reveals SHOCKING Truths About Spiritual Manipulation!",
      "description": "In this deeply introspective episode of \u0022Mental Matters,\u0022 host Asekho Toto sits down with a guest, Kim Peirano, who shares their transformative journey from the world of art to becoming a mental health coach. Our guest opens up about the unexpected path that led them from studio art and jewelry making into the realms of acupuncture, yoga, and ultimately, mental health, following a career that initially seemed unrelated. The conversation takes a compelling turn as our guest recounts their personal experience with a New Age cult, which they later discovered bore striking similarities to Scientology. Through this harrowing experience, they explore themes of coercive control, spiritual manipulation, and the process of reclaiming personal autonomy. Discover how they transitioned from victim to victor, employing Jungian psychology, shadow work, and a holistic approach to healing that integrates mind, body, and spirit. This episode sheds light on the psychological impacts of cult involvement, the journey towards recovery, and the empowerment of trusting oneself again. Whether you\u0027re interested in mental health, personal growth, or the complexities of spiritual groups, this episode offers profound insights into overcoming adversity through self-awareness and resilience. Sponsors and important links Subscribe to my newsletter: https://asekhos-newsletter.beehiiv.com/subscribe if you are interested in newsletter beehiiv is the place to go: https://www.beehiiv.com?via=Asekho-Toto Want to be a guest on Mental Matters Hosted By Asekho Toto? Send Asekho Toto a message on PodMatch, here: https://www.podmatch.com/hostdetailpreview/1604880114184x746605277921114400 You can buy my book on Amazon: https://www.amazon.com/gp/aw/d/B08BRLN7QV/ref=tmm_pap_swatch_0?ie=UTF8\u0026sr=",
      "release": "2025-01-20T02:00:00Z",
      "duration": "00:49:12.5830000",
      "explicit": false,
      "spotifyId": "3Rpn5D8ewimEuh200bGxk8",
      "appleId": 1000684631248,
      "youTubeId": "JKQokehLLKQ",
      "subjects": [
        "Foundation for Spiritual Development"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Rpn5D8ewimEuh200bGxk8",
        "apple": "https://podcasts.apple.com/podcast/196-kim-peirano-escaped-cult-member-reveals-shocking/id1511758808?i=1000684631248",
        "youtube": "https://www.youtube.com/watch?v=JKQokehLLKQ"
      }
    }
  ]
}