{
  "_ts": 0,
  "id": "7096b8d1-432e-4ad9-b41e-d9ff16dedd02",
  "name": "Mental Health, It’s a Trap!",
  "spotifyId": "4c4JhwUMnuYx5wWUsOiy57",
  "youTubeChannelId": "UCrND_UiWd2ByYc_Uw10iY7A",
  "episodes": [
    {
      "id": "8e963c41-5efd-4673-9602-c1a219ed773f",
      "title": "Escaping the Grip: Healing After Cults, Extremism, and Trauma – with Kevin Blanchette - Ep 33",
      "description": "What happens when your beliefs aren’t your own—but were shaped by fear, coercion, or control? In this compelling episode of Mental Health, It’s a Trap!, we’re joined by Kevin Blanchette, LICSW, a trauma therapist and peace activist who specializes in working with individuals impacted by cult dynamics, extremist groups, psychosis, and trauma. With training in EMDR, CBT, DBT, and Narrative Therapy, Kevin supports people in reclaiming their identities after years—sometimes decades—trapped in systems rooted in fear and manipulation. \u0026#x1f9e0; We explore: How people get pulled into cults, conspiracy-driven communities, or radicalized groups—and what keeps them stuck The trauma-informed path to exit and recovery Why finding your voice is the first act of freedom How clinicians can better support mandated clients and those questioning their indoctrination The role of nonviolence and peace activism in personal and collective healing Whether you\u0027re a clinician, survivor, or someone supporting a loved one, this episode offers insight, hope, and tools for healing from the inside out. \u0026#x1f3a7; Listen now and share with anyone questioning the stories they’ve been told—or the systems that shaped them.",
      "release": "2025-07-13T21:00:28Z",
      "duration": "00:43:38.7230000",
      "explicit": false,
      "spotifyId": "5MA6LVHiBRl9H0RXd9KFQZ",
      "youTubeId": "qlc9raqcsw4",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5MA6LVHiBRl9H0RXd9KFQZ",
        "youtube": "https://www.youtube.com/watch?v=qlc9raqcsw4"
      }
    }
  ]
}