{
  "id": "1dc6f0b6-6889-4019-be9d-bb51a29ac31e",
  "name": "MERCY NDARU",
  "youTubeChannelId": "UCmhnyUOFfkCJpO2UL363icg",
  "episodes": [
    {
      "id": "93db5866-1bb8-4fca-831c-e86640aa7afb",
      "title": "Mombasa Cult Involving Beach Boys And Wazungu\u0027s",
      "description": "Born in the ghetto, life gave me no mercy. I moved from Kilifi looking for honest work at a construction site, but after my contract was terminated, survival pushed me to the beach life. That’s where I met a white man and his wife — a meeting that changed my life forever.\nWhat started as small jobs turned into me becoming their chauffeur. On a trip to Machakos, we stopped overnight in Kibwezi. That night, I witnessed things I can never forget. The man began to change… into something not human. To return to normal, he needed my blood.\nThat was the night I was introduced to a dark cult, blood rituals, and secrets hidden from the world.\n#TrueStory\n#KenyaHorror\n#CultStories\n#BloodRituals\n#ScaryTestimony\n#RealLifeHorror\n#DarkSecrets\n#Kibwezi\n#BeachBoyStory\n#GhettoLife\n#SurvivalStory\n#HorrorExperience\n#AfricanHorror\n#CultExposed\n#NightOfTerror",
      "release": "2026-02-02T17:00:00Z",
      "duration": "00:53:17",
      "explicit": false,
      "youTubeId": "nKyW40CpM5I",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=nKyW40CpM5I"
      }
    },
    {
      "id": "ff5ca912-ac92-4852-b09c-39283e56d80e",
      "title": "Inside Highschool Cult That Led To Burning Of Schools",
      "description": "What started as a simple search for belonging quickly turned into a nightmare. I was introduced to a secret group in highschool that promised success, protection, and power. Little did I know, I was walking straight into a dangerous cult that would test my faith, loyalty, and even my life.\n\nIn this video, I reveal how I got recruited, the shocking rituals I witnessed, and the terrifying moment I realized I had to escape before it was too late.\n\nIf you\u0027ve ever been curious about how cults operate, especially among students, this story will open your eyes and warn you about the hidden dangers that might be lurking in plain sight \n**#SchoolCult #TrueStory #CultsExposed #highschoolLife #SurvivorStory #DarkSecrets #DangerousCult",
      "release": "2026-01-19T17:00:57Z",
      "duration": "00:57:31",
      "explicit": false,
      "youTubeId": "Ufr1wLjewgQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ufr1wLjewgQ"
      }
    },
    {
      "id": "2dc4d2b1-6a65-41b5-8101-af12874c7c00",
      "title": "Inside Family Cult That Ruined My Life And That Of Our Dad",
      "description": "When we lost our mother, our lives changed forever. Instead of finding healing, our father kept remarrying women who were cruel to us. One of them used witchcraft to manipulate my father and destroy our family. We lost love, protection, inheritance, and peace.\nThis is my true story of betrayal, spiritual manipulation, suffering, and survival. I share this testimony to expose the reality many children face in silence and to encourage anyone going through spiritual attacks, family rejection, or step-parent cruelty.\n#Witchcraft\n#TrueStory\n#FamilyTrauma\n#StepmotherAbuse\n#AfricanStories\n#SpiritualAttack\n#RealLifeTestimony\n#PainToPurpose\n#BrokenFamily\n#InheritanceTheft\n#DarkSecrets\n#SurvivorStory\n#HealingJourney\n#ChristianTestimony\n#ExposeEvil",
      "release": "2026-01-05T17:00:32Z",
      "duration": "00:52:05",
      "explicit": false,
      "youTubeId": "E8VPyoCeOVw",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E8VPyoCeOVw"
      }
    }
  ]
}