{
  "id": "3e165045-a868-4205-aa29-ebe3395b05b9",
  "name": "Michael Chambers - Online Tutor of English",
  "youTubeChannelId": "UC11LprCHqkKJrYc9y1oYGYw",
  "episodes": [
    {
      "id": "2ca36bc2-75e6-4ad5-9d8f-bae50f951a37",
      "title": "Opus Dei: foundational heresies, grandiosity and Escriva\u0026#39;s pride",
      "description": "In this video, I take you through selected parts of the foundational document of Opus Dei, \u0022Introduction on the supernatural spirit of the Work of God\u0022, 1934. This will show you how the character of the institution of Opus Dei was deeply flawed on many levels right from the start. I finish with hypothetical pastoral advice to the 32 year-old Escriva, who wrote the document at that age.",
      "release": "2025-03-06T21:53:11Z",
      "duration": "00:25:53",
      "explicit": false,
      "youTubeId": "9gwPHqFg4a0",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9gwPHqFg4a0"
      }
    },
    {
      "id": "3247df8f-bf26-438a-94f9-69a429ac1f77",
      "title": "Opus Dei, \u0022the bad shepherd\u0022 - an \u0022unthinkable\u0022  option, and spiritual direction",
      "description": "In this video, I refer to a witness statement from a current numerary which I received to support my legal case against Opus Dei and Catholic bishops for psychological abuse while I was a numerary. This statement mentions that Opus Dei describes spiritual direction and confession for lay people of Opus Dei with priests and others not of Opus Dei as going to the \u0022bad shepherd\u0022. I muse on how Opus Dei might react to this and why spiritual direction given by Opus Dei can only be damaging and not the will of God.",
      "release": "2025-02-25T16:06:46Z",
      "duration": "00:10:34",
      "explicit": false,
      "youTubeId": "7FmoMK1UZqo",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=7FmoMK1UZqo"
      }
    },
    {
      "id": "ffce9c80-ed33-47cd-b6f5-d9e9fe04fd30",
      "title": "Por qué me preocupo de aquellos de Opus Dei que dejé atras",
      "description": "En este vídeo (en castellano/español), explico por qué es tan importante que las personas del Opus Dei tengan más libertad y cómo mi acción legal puede ayudar.\nMi crowdfunding para mis gastos legales aquí \nhttps://www.gofundme.com/f/groundbreaking-legal-action-vs-opus-dei-rc-dioceses-in-uk \nMe represento a mí mismo, pero necesito pagar las tasas judiciales y los informes médicos.",
      "release": "2025-01-04T11:10:35Z",
      "duration": "00:07:28",
      "explicit": false,
      "youTubeId": "YcBybyG95qo",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YcBybyG95qo"
      }
    },
    {
      "id": "601ff1d8-40af-47ae-94f8-5b8a2d93896c",
      "title": "Why I care about those I left behind in Opus Dei",
      "description": "In this video (in English), I explain why it\u0027s so important that people in Opus Dei have more freedom and how my legal action may help. \nMy crowdfunder for my legal costs here https://www.gofundme.com/f/groundbreaking-legal-action-vs-opus-dei-rc-dioceses-in-uk I am representing myself but need to pay for court fees and medical reports.",
      "release": "2025-01-04T11:05:35Z",
      "duration": "00:08:36",
      "explicit": false,
      "youTubeId": "mKUwWwg-VYs",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mKUwWwg-VYs"
      }
    },
    {
      "id": "dae0ae15-2636-41bd-a0ae-5c0e7c51cea7",
      "title": "Opus Dei: call to action",
      "description": "It\u0027s time to recognise that we can make a difference to the level of freedom of oppression of people within Opus Dei and people affected by Opus Dei. We can do this if we work together and we make specific, polite, professional complaints. Opus Dei won\u0027t close down overnight so in the meantime, are there any people willing to stand up and make a difference with me?  \nContact me on Whatsapp \u002B44 7935 814938 or qzchambers@hotmail.com",
      "release": "2024-09-09T16:55:43Z",
      "duration": "00:09:48",
      "explicit": false,
      "youTubeId": "406NT1IFTNo",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=406NT1IFTNo"
      }
    },
    {
      "id": "37462dcc-244c-4b46-8e75-dd6a7d79c6e3",
      "title": "Opus Dei: testimonianza di un avvocato inglese, cause legali contro le diocesi, etc.",
      "description": "Sono stato numerario dal 1995 al 2004. Sto facendo causa alle diocesi britanniche per non aver vigilato sull\u0027Opus Dei. Vedo anche un percorso agevole per la riforma dell\u0027Opus Dei, ma dobbiamo fare la nostra parte. Ascolta la mia storia personale e come ho finito per seguire questo percorso d\u0027azione.",
      "release": "2024-08-03T06:17:24Z",
      "duration": "00:20:59",
      "explicit": false,
      "youTubeId": "9_oxLKWyRE0",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9_oxLKWyRE0"
      }
    },
    {
      "id": "b8c3d330-9104-4bf7-80f9-320ce91120cf",
      "title": "Opus Dei : Témoignage d\u0026#39;un avocat anglais, procès contre les diocèses, etc.",
      "description": "J\u0027ai été numéraire entre 1995 et 2004. Je poursuis légalement les diocèses britanniques pour leur manque de surveillance de l\u0027Opus Dei. Je vois également un chemin sans heurt pour la réforme de l’Opus Dei, mais nous devons faire notre part. Écoutez mon histoire personnelle et comment j\u0027en suis venu à suivre ce chemin.",
      "release": "2024-08-02T20:57:31Z",
      "duration": "00:21:19",
      "explicit": false,
      "youTubeId": "WYF4I7i3EgI",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WYF4I7i3EgI"
      }
    },
    {
      "id": "ebae1bd4-53ff-4b5c-b97c-57ffae51dc7a",
      "title": "Opus Dei: Aussage eines englischen Anwalts, Klagen gegen die Diözesen usw.",
      "description": "Ich war zwischen 1995 und 2004 Numerarier. Ich verklage britische Diözesen wegen mangelnder Aufsicht über das Opus Dei. Ich sehe auch einen reibungslosen Weg für die Reform des Opus Dei, aber wir müssen unseren Teil dazu beitragen. Hören Sie meine persönliche Geschichte und wie ich dazu kam, diesen Weg zu gehen.",
      "release": "2024-08-02T11:47:29Z",
      "duration": "00:21:42",
      "explicit": false,
      "youTubeId": "K7oz0_6_5E8",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=K7oz0_6_5E8"
      }
    },
    {
      "id": "ae9531d6-f5c5-4e12-a6ff-7c8923d48743",
      "title": "Opus Dei: getuigenis van een advocaat over de misstanden die hij door Opus Dei heeft geleden",
      "description": "Ik was numerair tussen 1995 en 2004. Ik klaag de Britse bisdommen aan omdat ze geen toezicht hebben gehouden op het Opus Dei. Ik zie ook een soepel pad voor de hervorming van het Opus Dei, maar wij moeten ons steentje bijdragen. Luister naar mijn persoonlijke verhaal en hoe ik uiteindelijk dit pad van actie heb gevolgd.",
      "release": "2024-08-01T18:21:06Z",
      "duration": "00:23:41",
      "explicit": false,
      "youTubeId": "e5z2k_E_4GE",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=e5z2k_E_4GE"
      }
    },
    {
      "id": "1e011b7d-086b-40bd-8b91-9da2b5fa6f07",
      "title": "Opus Dei: testimonio de un abogado ingles, los pleitos contra los diocesis, etc.",
      "description": "Fui numerario entre 1995 y 2004. Estoy demandando a las diócesis británicas por no supervisar el Opus Dei. También veo un camino suave para la reforma del Opus Dei, pero debemos hacer nuestra parte. Escuche mi historia personal y cómo terminé siguiendo este camino de acción.",
      "release": "2024-08-01T13:58:11Z",
      "duration": "00:23:03",
      "explicit": false,
      "youTubeId": "P5LfOpLsRtc",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=P5LfOpLsRtc"
      }
    },
    {
      "id": "84ae4338-ec87-4038-8333-def5030cea7b",
      "title": "Opus Dei: Recruiting kids/what led me into Opus Dei/my legal action vs dioceses /reform of Opus Dei",
      "description": "Opus Dei is back in the news for all the wrong reasons today - see https://www.ft.com/content/4e9aa330-44c3-4b9b-b5af-32990b80458b This article on the ongoing recruitment of children by Opus Dei includes a comment from me. \n\nIn this livestream, I will:\na) give you my backstory - how it made me vulnerable to joining Opus Dei as a celibate \u0022numerary\u0022 in the UK aged 23\nb) give you my recollection of the grooming of boys by Opus Dei in London\nc) explain why I am suing 4 dioceses in the UK for failing to supervise Opus Dei\nd) explain my ideas for a gentle but effective path of reform of Opus Dei for the lay people in the UK",
      "release": "2024-07-31T19:59:52Z",
      "duration": "00:28:27",
      "explicit": false,
      "youTubeId": "5_WRwkqGwVg",
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=5_WRwkqGwVg"
      }
    }
  ]
}