{
  "id": "cf7c981d-dea6-456c-a80d-59099184f13d",
  "name": "Middle East Eye",
  "youTubeChannelId": "UCR0fZh5SBxxMNYdg0VzRFkg",
  "episodes": [
    {
      "id": "556919b7-d75f-4a40-8a8f-d5924f761170",
      "title": "Who is UAE billionaire in the Epstein files? | MEE Live",
      "description": "US Attorney General Pam Bondi defended the justice department (or DOJ)’s handling of the Epstein Files during a congressional hearing on Wednesday. It descended into a shouting match.\n\nAt the heart of the dispute was the DOJ’s extensive and often erroneous redactions in the 3 million Epstein Files released last month– and their decision to withhold three million more.\n\nOn Monday, three US lawmakers were given access to unredacted files for the first time. They left with searing criticisms about what had been redacted. Specifically, the identities of powerful men.\n\n“If we found six men that they were hiding in two hours,” Khanna said in a speech to the House of Representatives on Tuesday, “imagine how many men they are covering up for in those three million files.”\n\nLater on in the show we’ll be speaking to survivor advocate Janey Starling about what the files spell out about gender justice.\n\nFirst, MEE has been looking into one of the “six men” mentioned. An Emirati billionaire linked to the highest levels of the UAE state. \n\nAfter seeing the unredacted files, Republican congressman Thomas Massie wrote on X:\n\n“Until tonight no one knew who sent the torture video to Epstein… our law requires VICTIM’s information to be redacted, not information of men who sent Epstein torture porn!”\n\n“The torture video” he refers to was a cause for disturbance after the original release included an email sent from Epstein in 2009 saying “he loved the torture video”. The recipient had been redacted.\n\nMassie claims the sender of the torture video was Sultan Ahmed bin Sulayem.\n\nIt’s a name that comes up in the Epstein files more than 5,000 times. The material does not demonstrate criminal wrongdoing and Sulayem has not been charged with a crime. But it is enough to cause serious potential problems not just for Sulayem himself, but one of the biggest cargo companies in the world– as well as the United Arab Emirates.\n\nSupport stories that matter. Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCR0fZh5SBxxMNYdg0VzRFkg/join\n\nCatch previous episodes of MEE LIVE, our biweekly news programme exploring the stories shaping our world through breaking coverage, expert analysis, and hard-hitting interviews.\n\nOriginally airing Tuesdays \u0026 Thursdays at 12pm ET | 5pm BST\nGot a story tip or question? Reach us at MEELive@middleeasteye.org\n\nSubscribe to our channel: http://ow.ly/AVlW30n1OWH\n\nSubscribe to MEE Telegram channel to stay up to date: https://t.me/MiddleEastEye_TG\n\nMiddle East Eye Website: https://middleeasteye.net\nFollow us on TikTok: https://www.tiktok.com/@middleeasteye\nFollow us on Instagram: https://instagram.com/MiddleEastEye\nLike us on Facebook: https://facebook.com/MiddleEastEye\nFollow us on Twitter: https://twitter.com/MiddleEastEye",
      "release": "2026-02-12T17:00:06Z",
      "duration": "00:16:05",
      "explicit": false,
      "youTubeId": "gsspsA9AX70",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gsspsA9AX70"
      }
    },
    {
      "id": "7e8b80c3-9fb0-43b7-b67c-3ad9614a018e",
      "title": "Watch this to find out who funds Tommy Robinson | Long Story Short",
      "description": "Why are America’s super-rich backing Tommy Robinson? \n\nRobinson - real name: Stephen-Yaxley Lennon - is the UK’s best known Far Right influencer.  \n\nHe’s attempting a glossy re-brand from “fringe extremist with a criminal record” to a self-styled “anti-Islam citizen journalist” with the ability to command large - sometimes violent - crowds.\n\nThat transformation is - in part - being turbo-charged by millionaires and billionaires in the United States.\n\nIn this two part special we profile Robinson’s rise and his relationship with the world’s richest man Elon Musk. \n\nBut first, we reveal the Conservative US pro Israel backers boosting his operation.\n\nSupport stories that matter. Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCR0fZh5SBxxMNYdg0VzRFkg/join\n\nCatch previous episodes of MEE LIVE, our biweekly news programme exploring the stories shaping our world through breaking coverage, expert analysis, and hard-hitting interviews.\n\nOriginally airing Tuesdays \u0026 Thursdays at 12pm ET | 5pm BST\nGot a story tip or question? Reach us at MEELive@middleeasteye.org\n\nSubscribe to our channel: http://ow.ly/AVlW30n1OWH\n\nSubscribe to MEE Telegram channel to stay up to date: https://t.me/MiddleEastEye_TG\n\nMiddle East Eye Website: https://middleeasteye.net\nFollow us on TikTok: https://www.tiktok.com/@middleeasteye\nFollow us on Instagram: https://instagram.com/MiddleEastEye\nLike us on Facebook: https://facebook.com/MiddleEastEye\nFollow us on Twitter: https://twitter.com/MiddleEastEye",
      "release": "2026-01-21T18:00:15Z",
      "duration": "00:12:41",
      "explicit": false,
      "youTubeId": "9Vqi6nmDPD0",
      "subjects": [
        "_America",
        "Evangelicalism",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9Vqi6nmDPD0"
      }
    }
  ]
}