{
  "id": "1a1d3dc5-78dd-40a3-b5c1-993a04aa9ef8",
  "name": "MIFF",
  "youTubeChannelId": "UCNFKSysHgOEBv76PeQmh-6g",
  "episodes": [
    {
      "id": "dff27f36-2152-434f-b241-eb61b01370e4",
      "title": "The Family | Trailer",
      "description": "THE FAMILY\nWorld Premiere at MIFF 2016. Check http://www.thefamilysect.com/ for details on the film\u0027s theatrical release in February 2017.\n\nAn incendiary, heartbreaking investigation into one of Australia\u0027s most notorious cults, and the scars its victims still bear today.\n\nAnne Hamilton-Byrne was beautiful, charismatic, delusional and damaged. She was also incredibly dangerous. Convinced she was a living god, Hamilton-Byrne headed an apocalyptic sect dubbed The Family, which was prominent in Melbourne through the 60s and 70s. With her husband Bill, she acquired numerous children – some through adoption scams, some born to cult members – and raised them as her own. Isolated from the outside world, the children were dressed in matching outfits, had identically dyed blonde hair, and were allegedly beaten, starved and injected with LSD. Taught that Hamilton-Byrne was both their mother and the messiah, the children were eventually rescued during a police raid in the mid 80s, but their trauma had only just begun.\n\nMelbourne director Rosie Jones (The Triangle Wars, MIFF 2011) has spent years digging into disturbing mysteries of The Family. With survivors and cult members telling their stories on camera (the now adult children\u0027s resilience is inspiring), alongside the Australian and international police who worked the case, this confronting MIFF Premiere Fund-supported documentary exposes not just what happened within the still-operating sect but also within the conservative Melbourne community that allowed The Family to flourish.",
      "release": "2016-08-18T05:35:57Z",
      "duration": "00:02:13",
      "explicit": false,
      "youTubeId": "X_KeVkZ_JhM",
      "subjects": [
        "Santiniketan Park Association"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=X_KeVkZ_JhM"
      }
    }
  ]
}