{
  "_ts": 0,
  "id": "b6940ae4-1d85-4330-8b68-69a59df842f0",
  "name": "Mind Your Head Podcast",
  "youTubeChannelId": "UCPhqci3exm15or8-LZlElCw",
  "episodes": [
    {
      "id": "55340bdc-1bfe-4296-8f75-2ee2bbd0b12f",
      "title": "Joel Mohamed\u0027s Story Of Growing Up In A Religious Cult",
      "description": "In this episode, Elliott welcomes Joel Mohamed. Joel shares his fascinating story of growing up in a religious cult and the stories that come along with such an experience. From countless church gatherings, speaking in tongues, and being given life-long contracts at the age of 16, Joel knew this life wasn’t for him. He shares his experience of leaving the cult and his incredible journey of reconnecting with his indigenous roots. They discuss the upcoming Australian referendum and their thoughts on what change needs to happen to bring non-ingenious and indigenous people together.\n\n\n\n\n\n\nTrigger Warning: This podcast episode discusses topics related to mental health, including depression, anxiety \u0026 drug addiction. Listener discretion is advised, as this content may be triggering or distressing to some individuals. If you are experiencing a mental health crisis, please seek professional help or contact a crisis hotline immediately.\n\n\n\n\n\n\nIG | @mind.your.head.podcast (http://@mind.your.head.podcast) \n\n\n\n\n\n\nHit FOLLOW or SUBSCRIBE so you don’t miss out on an episode!\n\n\n\n\n\n\nIf you like these episodes, leave us a review, tell your friends about us, or tag us on social media! \n\n\n\n\n\n\nThis podcast was brought to you by On Track Studio.\n\n\nwww.ontrackstudio.com.au (https://www.ontrackstudio.com.au/) \n\n\n@sophie.on.track.studio (https://www.instagram.com/sophie.on.track.studio/) \n\n\n\n\n\n\nFor advertising opportunities please email hello@ontrackstudio.com.au",
      "release": "2024-04-24T02:57:33Z",
      "duration": "01:26:35",
      "explicit": false,
      "youTubeId": "DNBiHSgCxog",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=DNBiHSgCxog"
      }
    }
  ]
}