{
  "id": "278a5c7e-1964-4022-9af5-7a26325cb693",
  "name": "Mind Over Murder",
  "spotifyId": "2jl4P567AGYJkg8XHkuw32",
  "appleId": 1494058129,
  "episodes": [
    {
      "id": "339aefa7-9eb6-4115-a50f-4ecf2507a590",
      "title": "Death in the Jungle w Candace Fleming",
      "description": "Join \u0022Mind Over Murder\u0022 co-hosts Bill Thomas and Kristin Dilley as they discuss the new book \u0022Death in the Jungle\u0022 with author Candace Fleming. The book tells the bizarre story of the People\u0027s Temple, a religious organization which was responsible for the murder of more than 900 temple members in Jonestown, Guyana in November 1978. The temple, which many critics said ultimately became a cult, was led by charismatic leader Jim Jones. Death in the Jungle: Murder, Betrayal, and the Lost Dream of Jonestown https://candacefleming.com/books/death_in_the_jungle/ American Detective TV series: Colonial Parkway Murders: https://www.youtube.com/watch?v=Fp3rNRZnL0E Washingtonian: A Murder on the Rappahannock River: https://www.washingtonian.com/2019/06/27/murder-on-the-rappahannock-river-emerson-stevens-mary-harding-innocence-project/ WTKR News 3: One year after development in Colonial Parkway Murders, where do things stand? https://www.wtkr.com/news/in-the-community/historic-triangle/one-year-after-development-in-colonial-parkway-murders-where-do-things-stand Won\u0027t you help the Mind Over Murder podcast increase our visibility and shine the spotlight on the \u0022Colonial Parkway Murders\u0022 and other unsolved cases? Contribute any amount you can here: https://www.gofundme.com/f/mind-over-murder-podcast-expenses?utm_campaign=p_lico\u0026#43;share-sheet\u0026utm_medium=copy_link\u0026utm_source=customer WTVR CBS News: Colonial Parkway murders victims\u0027 families keep hope cases will be solved: https://www.wtvr.com/news/local-news/colonial-parkway-murders-update-april-19-2024 WAVY TV 10 News: New questions raised in Colonial Parkway murders: https://www.wavy.com/news/local-news/new-questions-raised-in-colonial-parkway-murders/ Alan Wade Wilmer, Sr. has been named as the killer of Robin Edwards and David Knobling in the Colonial Parkway Murders in September 1987, as well as the murderer of Teresa Howell in June 1989. He has also been linked to the April 1988 disappearance and likely murder of Keith Call and Cassandra Hailey, another pair in the Colonial Parkway Murders. 13News Now investigates: A serial killer\u0027s DNA will not be entered into CODIS database: https://www.13newsnow.com/video/news/local/13news-now-investigates/291-e82a9e0b-38e3-4f95-982a-40e960a71e49 WAVY TV 10 on the Colonial Parkway Murders Announcement with photos: https://www.wavy.com/news/crime/deceased-man-identified-as-suspect-in-decades-old-homicides/ WTKR News 3 https://www.wtkr.com/news/is-man-linked-to-one-of-the-colonial-parkway-murders-connected-to-the-other-cases Virginian Pilot: Who was Alan Wade Wilmer Sr.? Man suspected in two ‘Colonial Parkway’ murders died alone in 2017 https://www.pilotonline.com/2024/01/14/who-was-alan-wade-wilmer-sr-man-suspected-in-colonial-parkway-murders-died-alone-in-2017/ Colonial Parkway Murders Facebook page with more than 18,000 followers: https://www.facebook.com/ColonialParkwayCase You can also participate in an in-depth discussion of the Colonial Parkway Murders here: https://earonsgsk.proboards.com/board/50/colonial-parkway-murders Mind Over Murder is proud to be a Spreaker Prime Podcaster: https://www.spreaker.com Join the discussion on our Mind Over Murder Colonial Parkway Murders website: https://colonialparkwaymurders.com Mind Over Murder Podcast website: https://mindovermurderpodcast.com Please subscribe and rate us at your favorite podcast sites. Ratings and reviews are very important. Please share and tell your friends! We launch a new episode of \u0022Mind Over Murder\u0022 every Monday morning, and a bonus episode every Thursday morning. Sponsors: Othram and DNAsolves.com Contribute Your DNA to help solve cases: https://dnasolves.com/user/register Follow \u0022Mind Over Murder\u0022 on Twitter: https://twitter.com/MurderOver Follow Bill Thomas on Twitter: https://twitter.com/BillThomas56 Follow \u0022Colonial Parkway Murders\u0022 on Facebook: https://www.facebook.com/ColonialParkwayCase/ Follow us on InstaGram:: https://www.instagram.com/colonialparkwaymurders/ Check out the entire Crawlspace Media network at http://crawlspace-media.com/ All rights reserved. Mind Over Murder, Copyright Bill Thomas and Kristin Dilley, Another Dog Productions/Absolute Zero Productions Become a supporter of this podcast: https://www.spreaker.com/podcast/mind-over-murder--4847179/support .",
      "release": "2025-12-29T11:00:08Z",
      "duration": "00:50:54.1430000",
      "explicit": false,
      "spotifyId": "3qZuEuo04GPpBOpEUUbitv",
      "appleId": 1000743044471,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3qZuEuo04GPpBOpEUUbitv",
        "apple": "https://podcasts.apple.com/podcast/death-in-the-jungle-w-candace-fleming/id1494058129?i=1000743044471"
      }
    },
    {
      "id": "ff9e4e35-eecd-43ed-9bf4-03f856ab395d",
      "title": "BONUS: The Doomsday Mother: Lori Vallow, Chad Daybell, and the End of an American Family",
      "description": "Bestselling true crime author John Glatt join \u0022Mind Over Murder\u0022 hosts Bill Thomas and Kristin Dilley for a discussion of his new book, \u0022The Doomsday Mother: Lori Vallow, Chad Daybell, and the End of an American Family.\u0022 This fascinating story gives the background on how a couple\u0027s obsessions led them to establish a cult that led them to madness and multiple murder. Lori Vallow is currently on trial for multiple murders, and her husband\u0027s trial will follow. This bonus episode originally ran on May 15, 2023.Book: \u0022The Doomsday Mother: Lori Vallow, Chad Daybell, and the End of an American Family\u0022 by John Glatt:https://www.goodreads.com/book/show/57693511-the-doomsday-motherWTVR CBS 6 News: Family of man killed in Colonial Parkway murders hopes for break in casehttps://www.youtube.com/watch?v=qCeLhZ-7L3EJoin the discussion on our Mind Over Murder and Colonial Parkway Murders pages on Facebook.Mind Over Murder on Facebook: https://www.facebook.com/mindoverpodcastColonial Parkway Murders Facebook page with more than 16,000 followers: https://www.facebook.com/ColonialParkwayCaseYou can also participate in an in-depth discussion of the Colonial Parkway Murders here:https://earonsgsk.proboards.com/board/50/colonial-parkway-murdersMind Over Murder is proud to be a Spreaker Prime Podcaster:https://www.spreaker.comNew Article in Virginia Gazette: 35 Years Later, Victims’ Families in Colonial Parkway Murders Still Searching for AnswersJoin the discussion on our Mind Over Murder and Colonial Parkway Murders pages on Facebook.Mind Over Murder on Facebook: https://www.facebook.com/mindoverpodcastYou can also participate in an in-depth discussion of the Colonial Parkway Murders here:https://earonsgsk.proboards.com/board/50/colonial-parkway-murdersFollow Othram\u0027s DNA Solves: You can help solve a case. Help fund a case or contribute your DNA. Your support helps solve crimes, enable the identification of John \u0026 Jane Does, and bring closure to families. Joining is fast, secure, and easy.https://dnasolves.com/Virginia Gazette: 35 Years Later, Victims’ Families in Colonial Parkway Murders Still Searching for Answers, Hope DNA Advances will Solve Case By Em Holter and Abigail Adcoxhttps://www.dailypress.com/virginiagazette/va-vg-colonial-parkway-murders-anniversary-1024-20211022-76jkpte6qvez7onybmhbhp7nfi-story.htmlMedium: The Colonial Parkway Murders — A Tale of Two Killers? By Quinn Zanehttps://medium.com/unburied/the-colonial-parkway-murders-a-tale-of-two-killers-1e8fda367a48Washington Post: \u0022Crimes of Passion\u0022https://www.washingtonpost.com/archive/opinions/1997/08/15/crimes-of-passion/0a38e8f9-6d04-48e4-a847-7d3cba53c363/Daily Beast: \u0022Inside the Maddening Search for Virginia’s Colonial Parkway Serial Killer\u0022 By Justin Rohrlichhttps://www.thedailybeast.com/what-happened-to-cathleen-thomas-and-rebecca-dowski-inside-the-hunt-for-the-colonial-parkway-killerCitizens! Check out our new line of \u0022Mind Over Murder\u0022 t-shirts and other good stuff !https://www.teepublic.com/stores/mind-over-murder-podcast?ref_id=23885Washington Post Op-Ed Piece by Deidre Enright of the Innocence Project:\u0022The FBI should use DNA, not posters, to solve a cold-case murder\u0022 https://www.washingtonpost.com/opinions/2021/06/25/julie-williams-laura-winans-unsolved-murder-test-dna/Oxygen: \u0022Loni Coombs Feels A Kinship To \u0027Lovers\u0027 Lane\u0027 Victim Cathy Thomas\u0022Loni Coombs felt an immediate connection to Cathy Thomas, a groundbreaking gay woman who broke through barriers at the U.S. Naval Academy before she was brutally murdered along the Colonial Parkway in Virginia.https://www.oxygen.com/crime-news/loni-coombs-feels-a-kinship-to-colonial-parkway-victim-cathy-thomasYou can contribute to help \u0022Mind Over Murder\u0022 do our important work:https://mindovermurderpodcast.com/supportFour one-hour episodes on the Colonial Parkway Murders are available on Oxygen as \u0022The Lover\u0027s Lane Murders.\u0022 The series is available on the free Oxygen app, Hulu, YouTube, Amazon, and many other platforms. https://www.oxygen.com/lovers-lane-murders Oxygen\u0022 \u0022Who Were The Colonial Parkway Murder Victims? 8 Young People All Killed In Virginia Within 4 Years\u0022 https://www.oxygen.com/lovers-lane-murders/crime-news/who-were-the-colonial-parkway-murder-victims Washington Post Magazine: \u0022Victims, Families and America’s Thirst for True-Crime Stories.\u0022 \u0022For Bill Thomas, his sister Cathy’s murder is a deeply personal tragedy. For millions of true-crime fans, it’s entertainment.\u0022 https://www.washingtonpost.com/news/magazine/wp/2019/07/30/feature/victims-families-and-americas-thirst-for-true-crime-stories/Daily Press excellent series of articles on the Colonial Parkway Murders: \u0022The Parkway\u0022 http://digital.dailypress.com/static/parkway_cottage/main/index.htmlColonial Parkway Murders website: https://colonialparkwaymurders.com Mind Over Murder Podcast website: https://mindovermurderpodcast.comPlease subscribe and rate us at your favorite podcast sites. Ratings and reviews are very important. Please share and tell your friends!We launch a new episode of \u0022Mind Over Murder\u0022 every Monday morning, and a bonus episode every Thursday morning.Sponsors: Othram and DNAsolves.comContribute Your DNA to help solve cases: https://dnasolves.com/user/registerFollow \u0022Mind Over Murder\u0022 on Twitter: https://twitter.com/MurderOverFollow Bill Thomas on Twitter: https://twitter.com/BillThomas56Follow \u0022Colonial Parkway Murders\u0022 on Facebook: https://www.facebook.com/ColonialParkwayCase/Follow us on InstaGram:: https://www.instagram.com/colonialparkwaymurders/Check out the entire Crawlspace Media network at http://crawlspace-media.com/All rights reserved. Mind Over Murder, Copyright Bill Thomas and Kristin Dilley, Another Dog Productions/Absolute Zero ProductionsThis show is part of the Spreaker Prime Network, if you are interested in advertising on this podcast, contact us at https://www.spreaker.com/show/4847179/advertisement",
      "release": "2023-10-26T00:00:00",
      "duration": "00:38:39.8830000",
      "explicit": false,
      "spotifyId": "4NpwxAhwb2qPknsP5q8YUG",
      "appleId": 1000632682683,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4NpwxAhwb2qPknsP5q8YUG",
        "apple": "https://podcasts.apple.com/podcast/bonus-the-doomsday-mother-lori-vallow-chad-daybell/id1494058129?i=1000632682683"
      }
    }
  ]
}