{
  "id": "c1220959-39cc-4937-9b3c-1b360660900d",
  "name": "Mind Disrupt",
  "youTubeChannelId": "UCeqNCs0kBvPie9Dk2K9onOg",
  "episodes": [
    {
      "id": "3c1da1cf-13d4-4077-b2d1-075c44c17180",
      "title": "Is Transcendental Meditation A Cult? Part 02",
      "description": "SIDE B: WHY IS TRANSCENDENTAL MEDITATION? \n\nEarly 20th Century: Where the Machiavellian Monk fakes his master’s will \n\nChronicles the early years the Brahamachari Mahesh, soon to be “The Maharishi Mahesh Yogi.” His time at university learning physics, alleged forging of the will of his master: Guru Dev, and Maharishi fleeing Jyotir Monastery. \n\n60’s: Christ figure on the lamb becomes Sexy Sadie \n\nHere we set the stage capturing the zeitgeist of the era. Where Maharishi Mahesh Yogi cultivates followers. We discuss his allure, and The Beatles\u0027 interest in Hinduism. After Beatles father figure Brian Epstein dies, Maharishi meets the Beatles. We discuss the far-out con-man Magic Alex. Which lead us into The Beatles infamous Rishikesh India trip.  \n\nWe break for more systems of purported ‘thought control’. This time confession.  \nThen we switch gears to ‘Forest Retreats’ at MIU; and explain what TM calls ‘rounding.’  \nThen we discuss long-term meditation and its adverse side effects. First from a historic perspective in the writing of songs such as Yer Blues, Dear Prudence, and Mother Nature’s Son. Then with academic Perspectives from: Michael Persinger Arnold Lazarus, a Stanford Study, then a German government study on the systemic extraction of wealth from individuals in the TM organization. \nWe return to Rishikesh where we chronicle the writing of the White Album. Bad business deals with Maharishi Mahesh Yogi and the leaving of Paul McCartney and Ringo Starr.  \nThen, there is testimony of Maharishi grooming 19 year old Theresa Olson since she was 10. As well as testamony by Judith Baroque and Prof. Robert Gordon McCutchen. We talk about the origins of the song \u0022Sexy Sadie\u0022 The hearsay and history of what happened between Maharishi and Mia Farrow, and Rosalyn Bonas which led to The Beatles\u0027 fallout. The 70’s ends with The Beach Boys\u0027 connections to Maharishi, their abusive father, and Dennis Wilson picking up another guru by the name of Charles Manson.",
      "release": "2025-01-27T21:00:09Z",
      "duration": "02:51:59",
      "explicit": false,
      "youTubeId": "GbdsGUb4aJI",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GbdsGUb4aJI"
      }
    },
    {
      "id": "218df2bd-aeb3-4733-8119-b97fff0b39af",
      "title": "Is Transcendental Meditation A Cult? Part 01",
      "description": "SIDE A: WHAT IS TRANSCENDENTAL MEDITATION?  \n\nHow to meditate for free. Estimates of wealth of the group. \n\nFormer members of the group purports suicides are seen as enlightened experiences \n\nTM as a Client/ Therapist relationship with in-groups and out-groups of cliental. \n\nLists of goods and services.  \n\nSystems of purported ‘thought control’ via sociologist Robert Jay Lifton’s demand for purity. \n\n“This is a religion and can’t be in public schools.” Religious qualities of the mantra and the puja, and the David Lynch Foundation trying to put this in public schools. \n\nWe discuss pseudo-science, religious belief, and language manipulation which brings about undue influence.  \n\nCelebrity director David Lynch endorsing faith healing practices.  \n\nDiscussion of the organization’s belief in levitation and other superpowers.  \n\nSystems of purported ‘thought control’ via environmental controls. \n\nDAMN DEMOCRACY! Leadership structures, and the ‘King of the Universe’ Tony Nader, the leader.  \n\nThe desire of leadership ‘to rule the world’ and control the populace through meditation... maybe?  \n\nTies to Hindu nationalist organizations. Who these Hindu Nationalists are. It’s ethnic cleansings of Muslims, and destructions of a Muslim Mosque.  \n\nSystems of purported ‘thought control’ of Mystical Manipulation (Planned Spontaneity) in the group",
      "release": "2025-01-26T21:00:05Z",
      "duration": "01:32:31",
      "explicit": false,
      "youTubeId": "8zc_j9rNqQI",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8zc_j9rNqQI"
      }
    }
  ]
}