{
  "_ts": 0,
  "id": "040127fd-83dc-4780-9749-55c5efb22d44",
  "name": "Mindful Minds",
  "spotifyId": "6yLBEZBEfMGPyoxOIubMG0",
  "appleId": 1560541171,
  "episodes": [
    {
      "id": "f2f48495-16f8-4cf6-bb38-67c86f0d9ef8",
      "title": "The All-Encompassing Impact of Religious Trauma with Dr. Laura Anderson - Ep. 83",
      "description": "Content warning: religious trauma \u0026 talk about triggers\n\nWelcome to the LAST guest episode of Mindful Minds!! As a little thank you, I have released my religious trauma sticker collection!! You buy the stickers on Etsy here!\n\n\nThis week we have a super special guest. I am so excited to welcome Dr. Laura Anderson (she/her) to the podcast!! Dr. Laura’s work has been so impactful in my personal deconstruction journey, and it was such an honor to have her on the show. \n\n\nDr. Laura Anderson (PhD, Saybrook University; LMFT) is a therapist, trauma resolution and recovery coach, writer, educator, and creator who specializes in complex trauma with a focus on domestic violence, sexualized violence, and religious trauma. Laura has a private practice in Nashville, Tennessee, and is the founder and director of the Center for Trauma Resolution and Recovery, an online coaching company where she and the other practitioners work with clients who have experienced high demand/high control religions, adverse religious experiences, cults, and religious trauma. \n\n\nIn 2019, Laura cofounded the Religious Trauma Institute with the goal of providing trauma-informed resources, consultation, and training to clinicians and other helping professionals who work with religious trauma survivors. \n\n\nYou can find Dr. Laura on social media at @drlauraeanderson , @traumaresolutionandrecovery , and @religioustraumainstitute . You can also visit her website. Dr Laura’s new book, “When Religion Hurts You: Healing from Religious Trauma and the Impact of High Control Religion” is out now!\n \n Products \u0026 Services we LOVE:\n- Skouts Honor: We are HUGE fans of Skouts Honor. Their probiotic products saved our pup from SO much itchiness. If you use code MINDFULMINDS at checkout, you can get 20% off of a purchase of $50 or more! Keep those pups happy \u0026 itch free.\n \n - Buzzsprout: I started my show with NO podcast experience and Buzzsprout made it so easy. If you are looking to start a podcast, or find a new host, try Buzzsprout! Listeners will receive a $20 credit by using our link and you’ll be supporting the show. \n\n\n\nPlease rate us 5 stars and leave us a review! You can find all things Mindful Minds here. You can buy our sticker collection here. You can also follow us on Instagram (@mindfulmindspod) or on Tik Tok where I do a lot of deconstruction content (@mindfulmindspod). Join our brand new Facebook group!!\n\n\n Mindful Minds is owned and operated by Serafina. All content belongs to Serafina. Please feel free to contact us at mindfulmindspod@gmail.com for any and all questions, sponsorships, or guest requests!",
      "release": "2024-01-26T14:00:00Z",
      "duration": "01:10:04",
      "explicit": false,
      "spotifyId": "6bdBOLIWTNhK5C9pTKpRSh",
      "appleId": 1000643081894,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6bdBOLIWTNhK5C9pTKpRSh",
        "apple": "https://podcasts.apple.com/podcast/the-all-encompassing-impact-of-religious-trauma-with/id1560541171?i=1000643081894"
      }
    }
  ]
}