{
  "id": "d2fa0ddc-746d-4d5d-9ce5-54e799f8db6e",
  "name": "MintPress News",
  "youTubeChannelId": "UCc9UUSOBWC6VCkJUqnh-CLw",
  "episodes": [
    {
      "id": "ebd710d6-21e6-4118-890f-18eec1f0fed1",
      "title": "The Finders: Harmless Cult or CIA-Linked Child Traffickers? A Discussion with Elizabeth Vos",
      "description": "It’s a story that has captivated many for over three decades. In 1987, locals in Tallahassee, Florida alerted police to a strange incident in a local park. Six dirty, hungry and poorly clothed kids — almost resembling feral children — were in the custody of two extremely sharply dressed men.\n\n\nBoth men were questioned but later released by police, although when it transpired that the men and the children were members of an obscure cult, situated in Washington, D.C. and called “The Finders,” the story went viral, causing nationwide hysteria. The incident occurred in the middle of the “Satanic Panic:” the fear that devil-worshipping gangs across the U.S. were kidnapping or even sacrificing children.\n\n\nThe trail would ultimately lead to allegations of a cult involved in ritual abuse, an international child-trafficking ring, evidence of child abuse confirmed and later denied, and ties with the CIA, which was alleged to have interfered in the case.\n\n\nInvestigative journalist Elizabeth Vos (https://twitter.com/ElizabethleaVos)  has been following the story and recent updates to it closely. Based in Arkansas, Elizabeth was the editor-in-chief of Disobedient Media and also hosts the CNLive webcast on Consortium News. Today, she joined Mintcast host Mnar Muhawesh Adley to discuss her latest trilogy of articles about the case, which can be found here: part 1 (https://www.mintpressnews.com/the-finders-cia-ties-child-sex-cult-obscured-media-coverage/277543/) , part 2 (https://www.mintpressnews.com/losing-finders-buried-documents-link-infamous-cult-to-cia/277756/) , part 3 (https://www.mintpressnews.com/finders-cult-us-government-worked-keep-cia-connection-secret/277948/) .\n\n\nElizabeth’s series focuses on the Finders’ close connections to the CIA, which suggest they may have been more than just an obscure group of people living an alternative, communal lifestyle: Isabelle Pettie, the wife of Finders’ head Marion Pettie, was employed at the agency between 1952 and 1961, while members of The Finders also trained CIA staff in computing. And, as Vos shows in the series, there is ample official evidence of an attempted CIA coverup, emanating from police and other federal agencies.\n\n\nIn 2019, the FBI released hundreds of documents from their investigation of The Finders into the public domain. Although many are heavily redacted, they do appear to legitimize many of the claims regarding CIA involvement made by agents.\n\n\nThe case and the subsequent alleged CIA coverup has led to all manner of wild speculations about who and what Th\n\n\nSupport the show (https://www.mintpressnews.com/donations/) \n\n\nMintPress News is a fiercely independent. You can support us by becoming a member (https://www.patreon.com/MintPressNews)  on Patreon, bookmarking and whitelisting us, and by subscribing to our social media channels, including Twitch (https://www.twitch.tv/mintpressnews/) , YouTube (https://www.youtube.com/user/MintPressNews) , Twitter (https://twitter.com/mintpressnews?lang=en)  and Instagram (https://www.instagram.com/mintpress/) .\n \n\nSubscribe to MintCast on Spotify (https://open.spotify.com/show/7qXgJyGwhTxDcgC8UeNF1s) , Apple Podcasts (https://podcasts.apple.com/us/podcast/mintcast/id1460817064) , and SoundCloud (https://soundcloud.com/mpnews) .\n \n\nAlso, be sure to check out the new Behind the Headlines (https://www.youtube.com/c/BehindTheHeadlines/videos)  channel on YouTube and subscribe to rapper Lowkey’s new video interview/podcast series, The Watchdog (https://www.mintpressnews.com/author/lowkey/) .",
      "release": "2025-07-10T16:38:51Z",
      "duration": "00:31:20",
      "explicit": false,
      "youTubeId": "uCAPkB1KZmQ",
      "subjects": [
        "The Finders",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uCAPkB1KZmQ"
      }
    }
  ]
}