{
  "id": "19857d4c-29cc-4cc4-8737-eb3b81d316b5",
  "name": "Table Rush Talk Show!",
  "spotifyId": "3V4IOe7kOJ4pvnbHVtmsb1",
  "appleId": 1541515693,
  "youTubeChannelId": "UCAC1FXTii5ibjpzYlhEVh1w",
  "episodes": [
    {
      "id": "e4a5185b-424e-4713-86f7-04826d8d416e",
      "title": "From Cult Upbringing to Podcast Powerhouse: A Conversation with Travis Chappell on Networki...",
      "description": "In this engaging episode, Mischa Zvegintzov interviews Travis Chappell, the visionary behind Guestio and host of the \u0022Travis Makes Friends\u0022 podcast. Travis opens up about his unique background, growing up in a tightly-knit religious community, and how it shaped his path to entrepreneurship.\n\n\nKey Takeaways:\n\n\nNavigating a Restrictive Upbringing: Travis reflects on his experiences within a secluded religious environment and the challenges he faced in seeking opportunities beyond it.\n\n\nThe Birth of Guestio: Discover how Travis identified a gap in the podcasting industry and created Guestio, a platform designed to streamline the process of booking high-caliber guests and securing podcast appearances.\n\n\nMonetization Insights: Learn about innovative monetization techniques, including the introduction of sponsored guest packages, and how these strategies can provide sustainable income for podcasters.\n\n\nBuilding Authentic Connections: Travis emphasizes the importance of genuine networking and shares methods to cultivate meaningful relationships that can propel personal and professional growth.\n\n\nTransitioning Careers: Insights into making bold career shifts and the mindset required to pursue one\u0027s passion against the odds.\n\n\nConnect with Travis Chappell:\n\n\nGuestio Platform: guestio.com (https://www.guestio.com) \n\n\nTravis Makes Friends Podcast: travischappell.com (https://travischappell.com) \n\n\nInstagram: @travischappell (https://www.instagram.com/travischappell/) \n\n\nLinkedIn: Travis Chappell (https://www.linkedin.com/in/travischappell/) \n\n\n\n\n\n\n \n\n\nMischa\u0027s Stuff!\n\n\nJoin my Podcast guest speaking Masterclass: Register Now (https://www.influencetour.com/go) \nThis Masterclass will teach you:\n\n  •  How to speak with confidence and authenticity.\n  •  How to find podcasts that attract your ideal audience.\n  •  How to get booked without the hassle.\n\nIdeal for coaches, course creators, and heart-centered entrepreneurs who want to generate leads, customers, and sales in a genuine way.\n\n\nJoin us and start your journey to becoming a podcast guest-speaking pro!\n\n\nRegister Now (https://www.influencetour.com/go) \n\n\n______________________\n\n\nFor social Media:      \n\n\nLinkedIn - https://www.linkedin.com/in/mischaz/\n\n\nSubscribe and share with your business associates who could use a listen!",
      "release": "2025-02-19T11:49:21Z",
      "duration": "00:55:27",
      "explicit": false,
      "spotifyId": "1VUI2pMy3kf6pwvEeonTth",
      "appleId": 1000693971864,
      "youTubeId": "cEchvwTz-zI",
      "subjects": [
        "Independent Fundamentalist Baptist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1VUI2pMy3kf6pwvEeonTth",
        "apple": "https://podcasts.apple.com/podcast/744-from-cult-upbringing-to-podcast-powerhouse-a/id1541515693?i=1000693971864",
        "youtube": "https://www.youtube.com/watch?v=cEchvwTz-zI"
      }
    }
  ]
}