{
  "_ts": 0,
  "id": "8270836f-53a2-468d-8252-f94ef6cd2a3b",
  "name": "Mitchell Report Unleashed Podcast",
  "spotifyId": "0cNW7dVij8lmE9VdAtcSBB",
  "appleId": 1543833273,
  "youTubeChannelId": "UCLcejD9aV-6JUwHORfyqp8Q",
  "episodes": [
    {
      "id": "f9442810-6596-40aa-962c-a39da8bfbdd9",
      "title": "Episode 541: How Michelle Dowd Healed After Escaping a Cult",
      "description": "Michelle Dowd is the author of Forager: Field Notes on Surviving a Family Cult, a powerful memoir detailing her upbringing in an extremist religious group and her journey of overcoming trauma. A sought-after speaker, she has shared her story on The Joe Rogan Experience (2024) and The Megyn Kelly Show, offering raw insights into resilience and self-discovery. Now, she joins The Mitchell Report Unleashed Podcast to discuss her book, the importance of nervous system regulation, and the profound personal growth she’s achieved through storytelling. Born into an ultra-religious cult—known as \u0022the Field\u0022—Michelle spent her childhood on a mountain in the Angeles National Forest. The group was founded in the 1930s by her grandfather, a domineering and charismatic figure who convinced generations of followers that he would live for 500 years and ascend to heaven upon doomsday. In this harsh environment, comfort and care were considered sins. Michelle was forced to endure hunger, thirst, and cold, learning survival skills that most could never imagine. She grew to trust animals more than people and developed an unbreakable connection to the natural world—lessons that would shape her resilience in the years to come. Chapters: 0:00 - Introduction 1:15 - The Hidden Meaning Behind “Forager” – Michelle Dowd’s Memoir 6:12 - Overcoming Adversity After the Cult – How Trauma Shaped Her Life 10:37 - How Cult Upbringing Rewires Your Nervous System 17:00 - The Breaking Point: When Michelle Escaped the Cult 22:06 - Love After Trauma: How the Cult Affected Her Relationships 37:12 - “Ask Me Anything” – The Question No One Dares to Ask 42:15 - Unpublished Victory: Michelle’s Biggest Win Beyond Her Book → CONTACT MICHELLE DOWD ON SOCIAL MEDIA ← Michelle’s Substack: https://mdowd.substack.com/subscribe Amazon Book: https://linktw.in/uaxUim \u0026#x1f6ce;️ Subscribe \u0026#x1f6ce;️ https://www.youtube.com/c/officiallyrory → CONTACT ME ON SOCIAL MEDIA ← 15 MINUTE DISCOVERY CALL: https://calendly.com/rorymitchell-biz/15-minute-discovery-call?month=2025-02 INSTAGRAM: https://www.instagram.com/officially.rory/ YOUTUBE: https://www.youtube.com/@officiallyrory BUY ME A COFFEE: https://buymeacoffee.com/officiallyrory X: https://twitter.com/officiallyrory HOO.BE: https://hoo.be/officiallyrory PAYPAL DONATIONS: https://www.paypal.com/paypalme/rorymitch \u0026#x1f3ac; CREDITS Created by Officially Rory Produced by Mitchel Report Unleashed Podcast \u0026#x1f449; If you enjoy this video please like and share it. \u0026#x1f449; Don\u0027t forget to subscribe to this channel for more updates. \u0026#x1f449; Remember to hit the notification bell so my videos appear in your feed.",
      "release": "2025-04-30T18:13:07Z",
      "duration": "00:51:44.8350000",
      "explicit": false,
      "spotifyId": "1YVBpfIrT7FUr9gM0GZak3",
      "appleId": 1000705591571,
      "youTubeId": "0z5Fj-yQAEE",
      "subjects": [
        "Kare Youth League",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YVBpfIrT7FUr9gM0GZak3",
        "apple": "https://podcasts.apple.com/podcast/episode-541-how-michelle-dowd-healed-after-escaping-a-cult/id1543833273?i=1000705591571",
        "youtube": "https://www.youtube.com/watch?v=0z5Fj-yQAEE"
      }
    }
  ]
}