{
  "id": "737c7c99-455a-4fd3-a57d-bd63fa2d1f27",
  "name": "Moconomy",
  "youTubeChannelId": "UCoOHTipX1_cNiC9seIPfUXA",
  "episodes": [
    {
      "id": "841e09e9-3817-40f4-8f6e-6db74b13f106",
      "title": "Seduced and Blackmailed | The Dark Cult Behind a Multi-Million Euro Scam",
      "description": "When Germany’s wealthiest woman, Susanne Klatten, became the target of a sleek Swiss con man, the public was shocked. But what began as a high-society scandal soon unraveled into a shadowy web of seduction, extortion, and spiritual manipulation—with millions of euros vanishing into thin air.\n\nSeduced and Blackmailed\nRelease date: July 7, 2018 (United States)\nDirector: Aldo Gugolz\nWrite: Romeo Regenass\nStars: Lina Geissmann, Aldo Gugolz\nCountry of origin: Switzerland\nLanguage: English\nProduction company: Prêt-à-Tourner Produktion\n\nIn Seduced and Blackmailed, we dive into the murky double life of Helg Sgarbi, a smooth-talking Swiss man with a magnetic charm—and a criminal plan. His target: Klatten, heiress to the BMW fortune. His weapon: intimacy, deceit, and blackmail. But when Klatten refuses to be a victim and calls in the police, Sgarbi’s scheme collapses—and the real story begins to unfold.\n\nBehind the scenes looms a more enigmatic figure: Ernani Barretta, an Italian so-called miracle healer who allegedly received the bulk of the stolen fortune. Was he simply a spiritual guide—or the true puppet master behind the crime?\n\nAs police dig deeper, Barretta’s world of rituals, followers, and secretive wealth accumulation comes to light. Sgarbi’s manipulation of vulnerable women, it appears, may have been just one part of a larger system of emotional exploitation and financial control.\n\nWith courtrooms, cults, and questions still unanswered, the documentary traces the high-stakes investigation that rocked Germany’s elite—and asks whether the most dangerous con is belief itself.\n\nFeaturing firsthand accounts, police transcripts, and chilling courtroom footage, Seduced and Blackmailed is a gripping psychological thriller about power, persuasion, and the price of trust.\n\n\nSUPPORT US!\n✘ Membership - https://bit.ly/3q5XPBh\n\nMORE DOCS!\n► Gold: https://bit.ly/2IRZ0OA\n► World Economy: https://bit.ly/36QlhEM\n► All Playlists: https://bit.ly/3lOiCll\n\n#finance #documentaries #economy\n\nCOPYRIGHT: All of the films published by us are legally licensed. We have acquired the rights (at least for specific territories) from the rightholders by contract. If you have questions please send an email to: info[at]moconomy.tv, Moconomy GmbH, www.moconomy.tv.",
      "release": "2025-05-27T16:00:06Z",
      "duration": "00:50:03",
      "explicit": false,
      "youTubeId": "9mC_gdKufDA",
      "subjects": [
        "Ernano Barretta",
        "Anthroposophy"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=9mC_gdKufDA"
      }
    }
  ]
}