{
  "_ts": 0,
  "id": "98cc8678-e07f-406e-8796-51dd633325b3",
  "name": "Modern Arizona",
  "spotifyId": "4vV7EzA80uzipzIXMCHhQ4",
  "appleId": 1535875718,
  "youTubeChannelId": "UCUir14Y00_F06-H_W7lxtoA",
  "episodes": [
    {
      "id": "5a6860d2-d36a-4177-9991-8968fb4c76d4",
      "title": "Tawni Browning: Exposing Hate, Polygamy, and Cults in Arizona and Beyond",
      "description": "Send us a text In this episode of the Modern Arizona Podcast, host Billie Tarascio welcomes Tawni Browning, who shares her experiences as a mother of five, an undercover investigator, and a producer of A\u0026E\u0027s Secrets of Polygamy. The conversation dives into some heavy yet important topics, including her undercover work with white supremacist groups, the dangers of hate-fueled organizations, and her work supporting women who have escaped polygamy. Tawni’s unique insights into cult dynamics, hate groups, and the human condition make this a compelling and eye-opening discussion. Listeners will hear how Tawni’s personal experience as the victim of a hate crime propelled her into working undercover to understand how individuals are drawn into extremist groups. She talks about the parallels between cult-like organizations and other abusive systems and shares her firsthand knowledge of the challenges women face when escaping polygamy. This conversation touches on the power of human connection, the dangers of isolation, and how communities can come together to combat hate and support those seeking a way out. This episode is filled with Tawni’s raw, personal stories, her passion for change, and the incredible impact she’s making on behalf of women and vulnerable communities. Whether it’s discussing polygamy, white supremacy, or the psychology behind hate, this episode is one you don’t want to miss. Episode Highlights: [2:00] Tawni’s undercover investigation into white supremacist groups and the shocking discovery of their presence in Arizona. [5:10] The importance of understanding the psychology of hate and the parallels with cult dynamics. [9:30] Tawni’s work with A\u0026E’s Secrets of Polygamy and how she became involved in the fight to help women escape polygamous sects. [14:00] Why polygamy is so closely tied to abuse and how cults use mind control and isolation to maintain power. [18:45] Tawni’s insights into the power of women in dismantling harmful systems like polygamy and why empowering women can create generational change. [24:00] The dangerous rise of extremist ideologies and cult-like behavior in modern politics and communities. Links \u0026 Resources: Learn more about Secrets of Polygamy on A\u0026E . Check out Tawni Browning’s book The Hate Next Door, available now. Visit Modern Law: mymodernlaw.com If you enjoyed this episode, please rate, review, and share the podcast with your friends. Stay tuned for more insightful conversations on important topics affecting Arizona!",
      "release": "2024-10-24T17:00:00Z",
      "duration": "00:42:18.8400000",
      "explicit": false,
      "spotifyId": "3S4H3szF9T6uG6oj1btseI",
      "appleId": 1000674331967,
      "youTubeId": "4vAisaUmQ2Y",
      "subjects": [
        "FLDS Church",
        "Latter Day Church of Christ",
        "Apostolic United Brethren",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3S4H3szF9T6uG6oj1btseI",
        "apple": "https://podcasts.apple.com/podcast/tawni-browning-exposing-hate-polygamy-and-cults-in/id1535875718?i=1000674331967",
        "youtube": "https://www.youtube.com/watch?v=4vAisaUmQ2Y"
      }
    }
  ]
}