{
  "id": "ab7a665d-5ac3-4f3f-96d0-8459d72557d3",
  "name": "Mojo Story",
  "youTubeChannelId": "UCrdPiSPVW0rtRsI002BX8iw",
  "episodes": [
    {
      "id": "da88f86d-49e1-4468-9a3d-a1d9b4ab02c4",
      "title": "Election 2024 | \u0022Modi Has Become A Cult Or More\u0022 | Swapan Dasgupta on #pmmodi this #election",
      "description": "#ManmohanSingh #NarendraModi #RahulGandhi #MamataBanerjee #AbhishekBanerjee #SwapanDasgupta #BarkhaDutt #BJP #TrinamoolCongress #Congress #LokSabhaElection2024 \n\nBecome A Mojo Story Member Now👇https://www.youtube.com/channel/UCrdPiSPVW0rtRsI002BX8iw/join\n\nWelcome to Mojo Story, where storytelling meets truth-telling in its purest form. Led by renowned journalist Barkha Dutt, we\u0027re dedicated to bringing you narratives that transcend time and format.\n\nFrom succinct 60-word snippets to immersive videos spanning up to 60 minutes, we explore the spectrum of human experiences and current events through a lens that prioritizes authenticity and integrity. In a world divided by polarization, we stand firm as a beacon of non-partisanship, refusing to be swayed by agendas or affiliations. \n\nHere, you\u0027ll find content that goes beyond the noise, beyond the rhetoric, and beyond the confines of bias. We\u0027re neither \u0027Chamcha\u0027 nor \u0027Morcha\u0027—we\u0027re advocates for the truth, champions of #PeopleFirst storytelling.\n\nJoin us on this journey as we navigate the complexities of our world with curiosity, compassion, and an unwavering commitment to the facts. Subscribe now and become part of a community that values truth above all else. Welcome to a space where every story matters, and where the voices of the unheard are amplified.\n\nSubscribe to us for more updates:\nFollow us on Twitter: https://twitter.com/themojostory\nLike us on Facebook: http://www.facebook.com/themojostory\nInstagram: http://www.instagram.com/mojostory.in\n\nDisclaimer: The views of guests who appear on Mojo Story, as well as the views of interviewees or speeches by public figures or those in the news, are their personal opinions. At no point do they reflect the views of the organization.",
      "release": "2024-05-30T15:33:59Z",
      "duration": "00:11:20",
      "explicit": false,
      "youTubeId": "2F9zwRQRuPM",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2F9zwRQRuPM"
      }
    }
  ]
}