{
  "id": "f621dc01-3917-4055-a5da-4984f858974f",
  "name": "Moment of Truth",
  "spotifyId": "5ATl0x7nKDX0vVoGrGNhAj",
  "appleId": 1555257529,
  "episodes": [
    {
      "id": "fa68d89f-ebf3-4a72-98d4-d758217e77a8",
      "title": "Our Souls and the Soil (ft. Jennifer Galardi)",
      "description": "This week on Moment of Truth, Nick is joined by Jennifer Galardi, Senior Policy Analyst at the Heritage Foundation’s Restoring American Wellness initiative. Jennifer shares her riveting journey from a progressive LA lifestyle to leading the Make America Healthy Again (MAHA) movement. Life has led her through many twists and turns, including time spent in a yoga cult before rediscovering Christianity and diving into health policy. Now she exposes the dangers of fast consumerism, GMOs, and a broken healthcare system. Dive into discussions on regenerative farming, the pitfalls of Big Ag, and the cultural shift needed to combat obesity and chronic disease. Jennifer’s insights on Ozempic, food dyes, and the spiritual crisis facing America are both compelling and urgent. Don’t miss this powerful call to reclaim wellness! Follow Jennifer: https://x.com/JennGalardi Follow American Moment across Social Media: X / Twitter – https://twitter.com/AmMomentOrg Facebook – https://www.facebook.com/AmMomentOrg Instagram – https://www.instagram.com/ammomentorg/ YouTube – https://www.youtube.com/channel/UC4qmB5DeiFxt53ZPZiW4Tcg Rumble – https://rumble.com/c/ammomentorg Check out AmCanon: https://www.americanmoment.org/amcanon/ Follow Us on Twitter: Saurabh Sharma – https://twitter.com/ssharmaUS Nick Solheim – https://twitter.com/NickSSolheim American Moment\u0027s \u0022Moment of Truth\u0022 Podcast is recorded at the Conservative Partnership Campus in Washington DC, produced by American Moment Studios, and edited by Jake Mercier and Jared Cummings. Subscribe to our Podcast, \u0022Moment of Truth\u0022 Apple Podcasts – https://podcasts.apple.com/us/podcast/moment-of-truth/id1555257529 Spotify – https://open.spotify.com/show/5ATl0x7nKDX0vVoGrGNhAj Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2025-08-11T11:00:00Z",
      "duration": "01:01:48.0030000",
      "explicit": false,
      "spotifyId": "4tkZtrlMCauZABebQmj95h",
      "appleId": 1000721498645,
      "subjects": [
        "Yoga Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4tkZtrlMCauZABebQmj95h",
        "apple": "https://podcasts.apple.com/podcast/our-souls-and-the-soil-ft-jennifer-galardi/id1555257529?i=1000721498645"
      }
    }
  ]
}