{
  "id": "befb33de-42ba-442c-8769-bd3bdc65faa5",
  "name": "Money Coach Gina Knox",
  "spotifyId": "3fDb1ToR8VolFiu2eqoCon",
  "appleId": 1629309098,
  "youTubeChannelId": "UCg9DXfJ1tkx27ix3jjdF9Vg",
  "episodes": [
    {
      "id": "b825a070-f2f5-4667-9827-5f3d98d99b2f",
      "title": "183. \u0022I built a million-dollar business after escaping a cult, but debt almost took me down\u0022",
      "description": "Samone Blakely is a dating coach for unchurched women of faith, and she has an INCREDIBLE story that she shares with us in this episode of Small Business Big Money. Samone tells us how she went from teen mom, to cult member, to overeducated Wendy\u0027s employee, to CPA at a big 4 accounting firm, to divorce, to million dollar business owner, to burning through all her savings and building debt. She shares with us how she saved her company from near closure.\n\n \nWe\u0027re hosting our very first FREE Debt Pay Off Masterclass! Register here: https://ginaknox.co/masterclass \nJoin us live on November 11th at 1pm CST. Register at the link above\n\n \n\nAbout Samone Blakely:\nTorahCents is known for her practical and unorthodox approach to dating for Women of Faith. She believes that dating should be delicious…and if it’s not…you’re doing it wrong.\n\nShe has helped thousands of women attract quality men, confidently date for the relationships they desire and has been fully launched on a mission to help women of faith create real options in men and choose themselves first (instead of waiting for a man to choose them).\n\n🔥She’s the Founder of Curved to Cuffed™️ - the #1 mentorship for successful women of faith who want to attract quality, marriage-minded men. ⁣⁣💍 And the Creator of the Triple Threat Success Method™️ that has helped women go from no dates to a wedding date in less than a year. ⁣⁣\n\nAnd when she’s not coaching you may see her releasing new episodes of her podcast, learning new tricks in her pole dancing class, spending time with her family and of course…having fun dating quality men. \u0022\n\n \n\nWhere to Find Samone:\nInstagram: www.instagram.com/torahcents Website: www.curved2cuffed.com \n\n \n\nTimestamps:\n00:00 - Introduction to Samone Blakely and Her Journey02:48 - Understanding Unchurched Women and Their Faith06:04 - Escaping the Cult: A Personal Story of Liberation08:53 - From Struggles to Success: Education and Career Path12:09 - Transitioning to a Dating Coach: The Journey Begins14:48 - Navigating Marriage and Divorce as a Dating Coach18:12 - Empowering Women of Faith: The Mission20:53 - Financial Growth and Challenges in Business24:13 - Lessons Learned: Spending and Financial Awareness26:06 - The Journey to Financial Neutrality30:39 - Building a System for Financial Management34:43 - Understanding and Managing Debt38:33 - Transforming Perspectives on Debt45:10 - The Power of a $19 Dress\n\n \nCategory: Entrepreneurship\n\n \n\nKeywords: dating coach, unchurched women, faith, personal growth, cult experience, financial challenges, empowerment, marriage, divorce, business success, financial management, money mindset, debt management, personal finance, coaching, abundance, financial neutrality, business growth, money school, financial healing",
      "release": "2024-10-29T12:00:00Z",
      "duration": "00:51:43",
      "explicit": false,
      "spotifyId": "01fFmSOrXg9Fy2yLywqFmY",
      "appleId": 1000674858868,
      "youTubeId": "rXTPV1d0f3E",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/01fFmSOrXg9Fy2yLywqFmY",
        "apple": "https://podcasts.apple.com/podcast/183-i-built-a-million-dollar-business-after/id1629309098?i=1000674858868",
        "youtube": "https://www.youtube.com/watch?v=rXTPV1d0f3E"
      }
    }
  ]
}