{
  "id": "3c85b02b-f543-4068-8e7d-09869ffd4dec",
  "name": "Money Magic Podcast",
  "spotifyId": "0S8AREZreRuLIGVdYwHyRd",
  "appleId": 1575231502,
  "youTubeChannelId": "UC7FpYMC6JyRq-2pFwrcMqcg",
  "episodes": [
    {
      "id": "a1060dbb-fa75-463f-b1db-c0857f90e383",
      "title": "Episode 123: Recognizing Financial Abuse: Breaking Free from Patterns of Control",
      "description": "In this week’s episode of the Money Magic Podcast, Vangile sits down with Brooke Kekos, an expert in helping women heal from abusive relationships, including financial abuse. Brooke shares her personal journey of enduring abuse from childhood that continued into her adult life, discussing the patterns of control and manipulation she experienced, particularly in financial matters. In this podcast episode Brooke explains financial abuse as a form of control where one partner restricts access to financial resources, making the victim feel powerless. This can involve controlling spending, withholding money, or making financial decisions unilaterally. She also shares her story of growing up with a controlling father and later entering a similar dynamic in her marriage, highlighting how familiarity with such patterns can trap individuals. Brooke also discusses her experiences with religious trauma, having been raised in a cult. She details the impact of this on her sense of self and autonomy, drawing parallels to financial and emotional abuse. The conversation emphasizes the importance of reclaiming autonomy, both financially and personally. Brooke talks about reconnecting with one\u0027s body and intuition through practices like meditation and yoga to heal from abuse. Overall, the episode is a deep dive into the complexities of financial abuse and its intersection with other forms of trauma. This is another insightful podcast. Tune in! During this episode, you will learn about: [02:08] – Introduction to Brooke Kekos [04:36] - Brooke shares her personal story and background [08:44] - Brooke talks about the control dynamics in her family and her past relationship [11:33] - Examples of financial control and how it manifests in relationships [12:52] - How financial abuse is identified and the importance of autonomy in financial decisions [18:16] - Identifying happiness in relationships and advocating for oneself financially [21:00] - The value of leaving an abusive situation early for better opportunities in the future [27:26] - The journey from survival to thriving by connecting with the body and intuition [31:13] - The guilt and shame associated with religious trauma, especially around sexuality [36:43] - How disconnection from the body affects decision-making and financial autonomy [39:59] - Meditation and yoga as tools for reconnecting with the body and healing [46:10] - The importance of releasing trauma stored in the body through yoga [50:52] - The importance of curiosity and exploring new belief systems [56:17] - The importance of support and community for healing and achieving goals [01:02:22] – Contact Brooke: Website: https://www.lifecoachinggoddess.com/ https://www.instagram.com/brookekekos https://web.facebook.com/profile.php?id=100075036248909\u0026_rdc=1\u0026_rdr Notable Quotes \u0022Our nervous system will choose a familiar situation over something that is not known.\u0022 \u0022I think a lot of the times people come into relationships where they have this dynamic because of how patriarchy has happened.\u0022 \u0022The brain hates the unknown, the nervous system hates the unknown. It\u0027s going to keep us trapped where we\u0027re at.\u0022 \u0022When we\u0027re not connected to the body, I think that we\u0027re dissociated from life.\u0022 “You get to be curious. Even if it\u0027s scary, take that leap. Trust that nudge that says, something doesn\u0027t feel good to me.\u0022 Additional money trauma resources: One on One Coaching: https://www.wealthy-money.com/coaching Money Magic course: https://www.wealthy-money.com/moneymagic 7 Day Tapping into Ancestral Money Wisdom Training: https://wealthy-money.com/training Let’s connect on Instagram: https://www.instagram.com/vangilemakwakwa/",
      "release": "2024-12-10T21:45:07Z",
      "duration": "01:06:40",
      "explicit": false,
      "spotifyId": "25IX5DrTT0QNIzGPUG8ptU",
      "appleId": 1000679937349,
      "youTubeId": "K-CEX_ap1VM",
      "subjects": [
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/25IX5DrTT0QNIzGPUG8ptU",
        "apple": "https://podcasts.apple.com/podcast/episode-123-recognizing-financial-abuse-breaking-free/id1575231502?i=1000679937349",
        "youtube": "https://www.youtube.com/watch?v=K-CEX_ap1VM"
      }
    }
  ]
}