{
  "id": "6353df6c-a2b1-4368-b78b-ad3b60ebfaeb",
  "name": "Highway to Hell",
  "spotifyId": "78v28JYE5W2gKTzKVsLrHR",
  "appleId": 1734945212,
  "youTubeChannelId": "UCMfoN9bDN77VAd83ZFvwShA",
  "episodes": [
    {
      "id": "82b0ead3-2f89-4d92-ab85-c80888007243",
      "title": "31. West Memphis 3- Part 2",
      "description": "The continuation of the West Memphis 3 case with a travel itinerary in Memphis!!! Want these episodes ad free? Subscribe to be a hellion at patreon.com/highwaytohellpodcast",
      "release": "2026-01-20T21:51:23Z",
      "duration": "01:14:55.7640000",
      "explicit": false,
      "spotifyId": "41dauE3aYRkdnwBTziuzdn",
      "appleId": 1000745959547,
      "urls": {
        "spotify": "https://open.spotify.com/episode/41dauE3aYRkdnwBTziuzdn",
        "apple": "https://podcasts.apple.com/podcast/31-west-memphis-3-part-2/id1734945212?i=1000745959547"
      }
    },
    {
      "id": "a254a6d5-69fa-47be-9ef2-90b125719d48",
      "title": "West Memphis 3 - Part One",
      "description": "On May 5, 1993, three eight-year-old boys—Stevie Branch, Michael Moore, and Christopher Byers—were reported missing in West Memphis, Arkansas. Their bodies were discovered the next day in a drainage ditch in an area known as Robin Hood Hills. The boys had been beaten, bound, and mutilated. The brutality of the crime sparked community panic.\n\nPolice quickly focused on three local teenagers: Damien Echols, Jason Baldwin, and Jessie Misskelley Jr., largely because Echols was interested in heavy metal culture and wore black clothing during the height of the “Satanic Panic.” Misskelley, who had an IQ below average and was interrogated for hours without a parent or lawyer, gave a highly inconsistent confession that he later recanted. No physical evidence linked the teenagers to the murders.\n\nIn 1994, the three were convicted—Misskelley and Baldwin received life sentences; Echols was sentenced to death. Over the next two decades, investigative journalists, forensic experts, and attorneys raised major concerns about coerced confessions, mishandled evidence, untested DNA, and alternate suspects.\n\nNew DNA testing (2007–2011) found no genetic material connecting any of the West Memphis Three to the crime scene. With growing legal pressure, the defendants entered Alford pleas in 2011, allowing them to maintain innocence while accepting time served. They were released after 18 years in prison.\n\nThe case remains controversial, with ongoing debate about wrongful conviction, police bias, and the influence of Satanic Panic on the investigation\n\n#truecrimecommunity #truecrimedocumentary #truecrimepodcast #westmemphisthree",
      "release": "2026-01-17T17:01:38Z",
      "duration": "01:15:30",
      "explicit": false,
      "spotifyId": "1wKVmyKxVrzRrelRR5SsIL",
      "appleId": 1000744945846,
      "youTubeId": "zczookYELdA",
      "subjects": [
        "West Memphis Three"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1wKVmyKxVrzRrelRR5SsIL",
        "apple": "https://podcasts.apple.com/podcast/30-west-memphis-3-part-1/id1734945212?i=1000744945846",
        "youtube": "https://www.youtube.com/watch?v=zczookYELdA"
      }
    },
    {
      "id": "3e27064c-1f54-4a3f-9f7c-a8c0e89b6855",
      "title": "Highway to Hell: Heaven’s Gate",
      "description": "In this episode, we examine the rise and tragic end of Heaven’s Gate, one of the most infamous cults in modern American history. Founded by Marshall Applewhite and Bonnie Nettles, the group fused New Age spirituality, Christian apocalypticism, and science-fiction belief into a rigid worldview centered on ascension to a higher evolutionary level. We trace the group’s origins in the 1970s, its recruitment tactics, isolationist lifestyle, and the psychological mechanisms that reinforced obedience, identity loss, and total devotion to leadership.\nThe episode culminates in a detailed breakdown of the 1997 mass suicide in Rancho Santa Fe, California, carried out in the belief that a spacecraft trailing the Hale-Bopp comet would transport members beyond Earth. We explore how apocalyptic thinking, charismatic authority, fear of the outside world, and technological alienation converged to produce one of the deadliest cult outcomes in U.S. history—and what Heaven’s Gate still teaches us about high-control groups, belief radicalization, and vulnerability in times of uncertainty. \n\n#truecrime #truecrimestory #truecrimedocumentary #truecrimecommunity",
      "release": "2025-12-13T17:01:07Z",
      "duration": "01:10:30",
      "explicit": false,
      "spotifyId": "6b9lxRVdYrdgImHhA2pGZc",
      "appleId": 1000741047759,
      "youTubeId": "bRIbLIHD490",
      "subjects": [
        "Heaven\u0027s Gate"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6b9lxRVdYrdgImHhA2pGZc",
        "apple": "https://podcasts.apple.com/podcast/25-heavens-gate/id1734945212?i=1000741047759",
        "youtube": "https://www.youtube.com/watch?v=bRIbLIHD490"
      }
    },
    {
      "id": "30363d11-c999-42d5-91b3-4c609ac15f71",
      "title": "Satanic Panic \u0026 the West Memphis 3",
      "description": "Please support this show by subscribing to patreon.com/montemader. Please leave a rating and review!\n\nHappy Halloween!!! In this episode, I am going to take you deep into one of the most bizarre and destructive moral panics in modern history — the Satanic Panic.\n\nFrom daycare witch hunts to heavy metal hysteria, the 1980s saw ordinary Americans convinced that the Devil had moved into their suburbs. Police were trained to spot pentagrams and candles as signs of ritual murder, therapists “recovered” memories of occult abuse, and media outlets like Geraldo Rivera and Oprah fueled the flames. Innocent people were imprisoned, reputations destroyed, and entire communities torn apart — all in the name of protecting children from imaginary cults.\n\nLets explore how this hysteria culminated in the West Memphis Three case — three teenagers convicted largely for wearing black and listening to Metallica. Nearly two decades later, DNA evidence revealed what fear had obscured all along: there was no cult, no ritual, and no Satanic conspiracy — just a community so terrified of darkness that it created its own.\n\nBut the story doesn’t end there. The same architecture of fear — hidden elites, child-trafficking conspiracies, and divine warfare — has found new life online through Pizzagate and QAnon. Monte connects the dots between the witch hunts of the 1980s and the algorithmic hysteria of the digital age, revealing how the Satanic Panic never really died — it just went viral.\n\nThrough history, psychology, and media analysis, this episode asks a haunting question:\n\n\nWhy do we keep needing a devil to blame?",
      "release": "2025-10-30T16:00:03Z",
      "duration": "01:12:12",
      "explicit": false,
      "youTubeId": "0IVQfIYmK64",
      "subjects": [
        "West Memphis Three"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0IVQfIYmK64"
      }
    },
    {
      "id": "c21d262f-e2d2-46f0-af33-b20f819cea23",
      "title": "The Well Trained Wife With Tia Levings",
      "description": "Tia Levings is an author and advocate who writes and speaks about the realities of Christian fundamentalism, evangelical patriarchy, and religious trauma. Her memoir, A Well-Trained Wife: My Escape from Christian Patriarchy, was released on August 6, 2024.\n\n\nIn her memoir, Levings recounts her journey into and out of the fundamentalist Quiverfull movement. Married at 19, she was indoctrinated into a belief system that emphasized strict discipline, isolation, and the submission of women as \u0022keepers of the home.\u0022 Her husband exerted extreme control over her life, dictating everything from her clothing to her daily activities, and subjected her to physical and sexual abuse—all sanctioned by their church. Levings details how she was taught to be more submissive and to accept abuse as part of her role. One night, when she realized she and her children wouldn\u0027t live, she fled.\nLevings\u0027 story sheds light on the hidden abuses within certain fundamentalist Christian communities and serves as a testament to resilience and the pursuit of freedom. Her work continues to educate and empower others who have experienced similar forms of religious trauma",
      "release": "2025-06-04T02:03:09Z",
      "duration": "01:03:18",
      "explicit": false,
      "youTubeId": "8yATDF5Oj6Q",
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=8yATDF5Oj6Q"
      }
    },
    {
      "id": "4c09616f-2624-431d-a941-caec2b2eb9a9",
      "title": "9. Highway to Hell- Children of God Sex Cult",
      "description": "Please like and subscribe.\n\nFounded in 1968 by David Berg, The Children of God started as a seemingly innocent religious movement during the counterculture era. But beneath its facade of peace and love lurked a world of manipulation, exploitation, and abuse. Led by the enigmatic and charismatic Berg, also known as \u0022Moses David,\u0022 the group quickly gained notoriety for its unconventional doctrines and alarming practices.\n\nFrom \u0022Flirty Fishing,\u0022 a method of using sex to recruit new members, to the harrowing tales of abuse from former members, the story of The Children of God is a chilling reminder of the dangers posed by unchecked power and blind devotion. Join us as we uncover the rise and fall of this infamous cult, hear the voices of those who survived, and examine the lasting impact it has had on its victims and society.\n\nSo sit back, listen in, and prepare to enter the unsettling world of The Children of God.",
      "release": "2024-06-05T03:40:38Z",
      "duration": "01:06:56",
      "explicit": false,
      "spotifyId": "4qDLD5MLPX8R5bYpZ4Uz8y",
      "appleId": 1000655536665,
      "youTubeId": "MzcOa-utb0s",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4qDLD5MLPX8R5bYpZ4Uz8y",
        "apple": "https://podcasts.apple.com/podcast/ep9-los-angeles-children-of-god-sex-cult/id1734945212?i=1000655536665",
        "youtube": "https://www.youtube.com/watch?v=MzcOa-utb0s"
      }
    }
  ]
}