{
  "id": "4db1659d-bd87-4a2c-bbbb-065349881d3e",
  "name": "Morbidly Curious Book Club Podcast",
  "spotifyId": "1v1uMNEKfqOrM3xMttO9UG",
  "appleId": 1727383201,
  "episodes": [
    {
      "id": "fb7ba8a5-3b2f-4c7f-b0ea-1cc647b1b09d",
      "title": "SEASON 3 (Trailer)",
      "description": "Check out our NEW website! morbidlycuriousbookclub.com\nHere is our 2026 lineup:\nJanuary \u0022Blazing Eye Sees All: Love Has Won, False Prophets, and the Fever Dream of the American New Age\u0022 by Leah Sottile\nFebruary \u0022Rabid: A Cultural History of the World\u0027s Most Diabolical Virus\u0022 by Bill Wasik \u0026 Monica Murphy\nMarch \u0022Whack Job: A History of Axe Murder\u0022 by Rachel McCarthy James\nApril \u0022Madame Restell: The Life, Death, and Resurrection of Old New York\u0027s Most Fabulous, Fearless, and Infamous Abortionist\u0022 by Jennifer Wright\nMay \u0022The Forever Witness: How DNA and Genealogy Solved a Cold Case Double Murder\u0022 by Edward Humes\nJune \u0022Still Life with Bones: Genocide, Forensics, and What Remains\u0022 by Alexa Hagerty\nJuly \u0022Madness: Race and Insanity in a Jim Crow Asylum\u0022 by Antonia Hylton\nAugust \u0022American Afterlives: Reinventing Death in the 21st Century\u0022 by Shannon Lee Dawdy\nSeptember \u0022Empire of the Scalpel: The History of Surgery\u0022 by Ira Rutkow\nOctober \u0022Spiritualism\u0027s Place: Reformers, Seekers, and Séance in Lily Dale\u0022 by Earls/Handley-Cousins/Rhodes/Masarik\nNovember \u0022Expert Witness: The Weight of our Testimony When Justice Hangs in the Balance\u0022 by Ann Wolbert Burgess and Steven Matthew Constantine\nDecember \u0022Society of the Snow: The Definitive Account of the Worlds Greatest Survival Story\u0022 by Pablo Vierci\nThank you for being here with me on this journey. I cannot wait to discuss these titles with you, and chat with these incredible authors! Which title are you most excited for? Have you read any already? Let me know!\nCheers!\n\n\nSupport this podcast at — https://redcircle.com/the-morbidly-curious-book-club-podcast/donations\n\nAdvertising Inquiries: https://redcircle.com/brands\n\nPrivacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2026-01-08T22:00:16Z",
      "duration": "00:02:46",
      "explicit": false,
      "spotifyId": "1jnktyKTLaxyxF0kfk5K77",
      "appleId": 1000744361219,
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1jnktyKTLaxyxF0kfk5K77",
        "apple": "https://podcasts.apple.com/podcast/season-3-trailer/id1727383201?i=1000744361219"
      }
    },
    {
      "id": "389f4733-a297-4577-91cd-47bfb78394b6",
      "title": "ARCHIVES: \u0022Scarred\u0022 with author Sarah Edmondson",
      "description": "I speak to a previously selected book club pick author. In 2024, I launched this podcast to delve deeper into our book club\u0027s nonfiction selections by engaging directly with the authors, the experts behind these compelling works. Over the years, our club has explored some exceptional books, and today, I got the chance to speak with Sarah Edmondson about her book, \u0022Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life,\u0022 a book we read in 2022! This episode is being released on a special day: around this time marks the 8-year anniversary of Sarah and her husband Nippy leaving the cult! About the book: \u0022Scarred is Sarah Edmondson\u0027s compelling memoir of her recruitment into the NXIVM cult, the 12 years she spent within the organization (during which she enrolled over 2,000 members and entered DOS—NXIVM\u0027s \u0027secret sisterhood\u0027), her breaking point, and her harrowing fight to get out, to expose Keith Raniere and the leadership, to help others, and to heal. Complete with personal photographs, Scarred is also an eye-opening story about abuses of power, female trust and friendship, and how sometimes the search to be \u0027better\u0027 can override everything else.\u0022 Sarah Edmondson is a Canadian actress who has starred in the CBS series Salvation and more than twelve films for the Hallmark Channel and Lifetime. She is also a well-established voice-over artist for popular series such as Transformers: Cybertron and My Little Pony: Friendship Is Magic. In 2005, when NXIVM, a personal and professional development company, promised to provide the tools and insight Sarah needed to reach her potential, she was intrigued. Over her twelve-year tenure, she went from student to coach and eventually operated her own NXIVM center in Vancouver. Questions kept coming up about the organization’s rules and practices, which came to a head in 2017 when she accepted an invitation from her best friend to join DOS, a “secret sisterhood” within NXIVM. In 2019, Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life , with Kristine Gasbarre. In this tell-all memoir, she shares her story from the moment she takes her first seminar to her harrowing fight to get out. Her full story as a whistleblower is featured in the CBC podcast Uncover: Escaping NXIVM (downloaded over 25 million times) and The Vow , the critically acclaimed HBO documentary series on NXIVM. Now with the launch of A Little Bit Culty , Sarah and her co-host/husband Anthony “Nippy” Ames are keeping the conversation going by discussing the healing process with the help of experts and fellow survivors. Links: PRE ORDER SCARRED Me in IG ALBC on IG Enjoy the episode! Support this podcast at — https://redcircle.com/the-morbidly-curious-book-club-podcast/donations Advertising Inquiries: https://redcircle.com/brands Privacy \u0026 Opt-Out: https://redcircle.com/privacy",
      "release": "2025-05-31T12:00:00Z",
      "duration": "00:59:01.9160000",
      "explicit": true,
      "spotifyId": "7osQhvjVl6jyhaZCIF1bCW",
      "appleId": 1000710661998,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7osQhvjVl6jyhaZCIF1bCW",
        "apple": "https://podcasts.apple.com/podcast/archives-scarred-with-author-sarah-edmondson/id1727383201?i=1000710661998"
      }
    }
  ]
}