{
  "id": "a72d49a9-a2bf-4b77-b83d-28be816df5f6",
  "name": "More Than Anxiety",
  "spotifyId": "55Myj9i9BzULSsatpHKDLO",
  "appleId": 1644101257,
  "youTubeChannelId": "UCReIdm4t_sFg64sPOKYHIGg",
  "episodes": [
    {
      "id": "e254162d-c079-4938-9275-3fb439480b58",
      "title": "Escaping Cult Control: Ryan Hernandez\u0027s Path to Healing and Resilience",
      "description": "I used to think it was rare to find someone who had been in an end-times cult. Turns out, it\u0027s not that rare! Join me in this episode of the More than Anxiety Podcast as Ryan Hernandez shares his incredible story. From a promising young life in Los Angeles to finding himself trapped in a religious cult that thrived on fear and deceit, Ryan courageously opens up about the challenges he faced, from sleep deprivation to the constant dread of divine punishment to making his way back to his authentic self. Ryan\u0027s story isn\u0027t just about surviving life in a cult, but about managing and healing from anxiety and reclaiming his identity through vulnerability. Key Moments: Ryan\u0027s early life and aspirations before joining the cult The gradual process of indoctrination and its impact on his identity The challenges and sacrifices faced as a member of the cult The pivotal moment that sparked his decision to leave The emotional and psychological toll of escaping the cult The healing journey and strategies for overcoming trauma The importance of seeking support and building a new life Be sure to check out Ryan\u0027s podcast Truth That Heals on Spotify and YouTube or find him at Creativity Worth Expressing. Send us a text Take this quiz to find out what\u0027s making you feel so overwhelmed and what you need to do to feel calm, confident, and have more time for fun! In Episode 111 of the More Than Anxiety Podcast , I had the opportunity to speak with Jennifer Geneve from LaVigne Natural Skincare. Jenn is offering a 15% discount for my subscribers and listeners. Simply enter code MEGANDEVITO when you check out! Thanks for listening! Did you know you can help others find this resource so they can calm, confident, and have more fun by leaving ⭐️⭐️⭐️⭐️⭐️\u0027s and a review wherever you listen. Thanks in advance! Find me on Instagram Find me on Facebook Schedule your consultation and let\u0027s talk coaching! You know you\u0027re overwhelmed, burned out, sick to death of work but also trying to do everyting for everyone at home. TAKE THIS QUIZ to find out why you\u0027re so overwhelmed and what to do about it.",
      "release": "2024-11-19T10:00:00Z",
      "duration": "00:56:02",
      "explicit": false,
      "spotifyId": "6tSftsC3ogcdIn9DGsSZRi",
      "appleId": 1000677452481,
      "youTubeId": "GNUoJQM8XwE",
      "subjects": [
        "Alliance of the Holy Family International",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6tSftsC3ogcdIn9DGsSZRi",
        "apple": "https://podcasts.apple.com/podcast/ep-115-escaping-cult-control-ryan-hernandezs-path-to/id1644101257?i=1000677452481",
        "youtube": "https://www.youtube.com/watch?v=GNUoJQM8XwE"
      }
    }
  ]
}