{
  "_ts": 0,
  "id": "3a998307-ad78-4925-bdfb-c1a3490697e9",
  "name": "More to the Story with H. Allegra Lansing",
  "youTubeChannelId": "UC0iqTqu1uEDFbEltglV9SdQ",
  "episodes": [
    {
      "id": "1f110f74-6075-4aca-929b-9b85182022b8",
      "title": "ORDER IN THE CULT! Courtroom Sketches of the Manson Family on Trial",
      "description": "During the Manson Family\u0027s 1970/1971 Trial for the Tate/LaBianca murders, at least two notable artists were employed to sketch the daily activities. Bill Lagnante and Bill Robles each contributed sketches during the trial that depict the notoriety and shock defendants Charles Manson, Susan Atkins, Patricia Krenwinkel and Leslie Van Houten depicted on jurors, the court, and the world. Plus, one more person came into the courtroom intending to sketch but wound up falling in love with MANSON!\n\nSketch images copyright to Bill Lagnante or Bill Robles. All other images cited as known.",
      "release": "2025-04-25T20:59:23Z",
      "duration": "00:06:01",
      "explicit": false,
      "youTubeId": "a2f4bX3m5DY",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=a2f4bX3m5DY"
      }
    },
    {
      "id": "388e4924-a793-41d6-b368-4e15d8dab8c8",
      "title": "MANSON to ZIZ and In Between: Faces of Modern Cults",
      "description": "Do you think people who join cults are stupid, uneducated or weak? You might be surprised to learn that very bright, highly educated and sophisticated people are also susceptible to cults and charlatans. In fact, every person on the planet is! In this video we explore some modern cults - from The Manson Family, to the Peoples\u0027 Temple, the Source Family, Aum Shinrikyo, Heaven\u0027s Gate, NXIVM and the most recent cult breaking news currently - the Zizians. #zizians",
      "release": "2025-02-22T05:00:09Z",
      "duration": "00:18:31",
      "explicit": false,
      "youTubeId": "boL9_keOfi8",
      "subjects": [
        "Zizians",
        "Manson Family",
        "Peoples Temple",
        "NXIVM",
        "Heaven\u0027s Gate",
        "Aum Shinrikyo",
        "The Source Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=boL9_keOfi8"
      }
    }
  ]
}