{
  "id": "634f9ee2-1c3c-47fa-b650-4d9e8ac71a44",
  "name": "Mormon.ish",
  "spotifyId": "7ldtXGx7fmVYjcddOKLD83",
  "appleId": 1655254481,
  "youTubeChannelId": "UCD71coYl-mS5LIBPPikICsA",
  "episodes": [
    {
      "id": "e42a0225-efa7-4e4a-b7f0-934e8819034f",
      "title": "The LeBaron Cult Murdered My Grandfather",
      "description": "On this episode of Mormonish Podcast, Rebecca and Landon are joined by our friend and previous podcast guest, Liz Phillips to discuss events portrayed in a recent Hulu documentary, \u0022Daughters of the Cult.\u0022The documentary portrays the story of a polygamous cult led by Ervil LaBaron and the atrocities it committed over decades. Liz\u0027s grandfather, Rulon Allred, prophet of the Apostolic United Brethern, was murdered by members of the cult in 1977. Liz discusses the far reaching effects of this tragic event and the generational trauma members of the family still experience. Link to Dorothy Allred Solomon\u0027s bookhttps://www.amazon.com/Predators-Prey-Other-Kinfolk-Polygamy/dp/0393049469 Don\u0027t forget to like and subscribe to Mormonish Podcast! How to Donate to Mormonish Podcast:We appreciate our Mormonish viewers and listeners so much! If you would like to financially support our podcast, you can DONATE to support Mormonish Podcast here: PayPal: https://paypal.me/BiblioTechMedia?cou...Venmo: @BiblioTechMedia Contact Mormonish Podcast: mormonishpodcast@gmail.com",
      "release": "2024-01-19T18:00:00Z",
      "duration": "01:31:46.5360000",
      "explicit": false,
      "spotifyId": "2dnGoMLzqqpXBRRVOIxe6c",
      "appleId": 1000642252873,
      "youTubeId": "AxEPob0p1zM",
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2dnGoMLzqqpXBRRVOIxe6c",
        "apple": "https://podcasts.apple.com/podcast/the-lebaron-cult-murdered-my-grandfather/id1655254481?i=1000642252873",
        "youtube": "https://www.youtube.com/watch?v=AxEPob0p1zM"
      }
    },
    {
      "id": "03f39f7c-1fc6-4934-9ac6-d7f538d3dbb7",
      "title": "The Book of Abraham, Smoking Gun of Mormonism: What\u0027s it Really All About?",
      "description": "On this extremely informative episode of Mormonish Podcast, Rebecca and Landon sit down with our knowledgeable friend, Andrew Schnobrich, to do a deep, yet accessible dive into The Book of Abraham. Andrew has created a slide show and presentation that helps all of us more clearly understand the overwhelming problems with the BOA translation and Joseph Smith\u0027s claim to have translated it from Reformed Egyptian.Andrew\u0027s comprehensive slide presentation takes us through this translation process step by step, to help us understand the multiple problems and discrepencies that exist in what is supposed to be a prophetic translation of a record written by Moses\u0027 own hand.Once you understand the real meaning of the characters and the drawings, it becomes obvious Joseph Smith did not translate this papyri correctly by any stretch of the imagination. This creates a big problem for the Pearl of Great Price and the LDS church itself.This is Part 1 of a two part series on The Book of Abraham. How to Donate to Mormonish Podcast:We appreciate our Mormonish viewers and listeners so much! If you would like to financially support our podcast, you can DONATE to support Mormonish Podcast here: PayPal: https://paypal.me/BiblioTechMedia?cou...Venmo: @BiblioTechMedia Contact Mormonish Podcast: mormonishpodcast@gmail.com",
      "release": "2024-01-19T00:00:00",
      "duration": "01:27:25.9680000",
      "explicit": false,
      "spotifyId": "0AwXKJoLvax1SmginLdWRt",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0AwXKJoLvax1SmginLdWRt"
      }
    }
  ]
}