{
  "id": "634f9ee2-1c3c-47fa-b650-4d9e8ac71a44",
  "name": "Mormon.ish",
  "spotifyId": "7ldtXGx7fmVYjcddOKLD83",
  "appleId": 1655254481,
  "youTubeChannelId": "UCD71coYl-mS5LIBPPikICsA",
  "episodes": [
    {
      "id": "883b7175-06f7-4829-b9e6-c1b7ce95d5ff",
      "title": "Rachael and Elizabeth\u0027s Journey: Finding Your Authentic Self",
      "description": "In this very special episode of Mormonish Podcast, Landon and Rebecca have a wonderful conversation with an Rachael and Elizabeth, amazing couple who found each other after decades of living their lives as the church told them to. This is their incredible and inspiring story and we\u0027ll let them tell it!***How to DONATE to Mormonish Podcast:If you would like to financially support our podcast, you can DONATE to support Mormonish Podcast here:https://www.mormonishpodcast.org/supportAlso at:PayPal: https://paypal.me/BiblioTechMediaVenmo: @BiblioTechMediaWe appreciate our Mormonish viewers and listeners so much!Contact Mormonish Podcast: mormonishpodcast@gmail.com",
      "release": "2024-02-02T00:00:00",
      "duration": "01:52:50.2310000",
      "explicit": false,
      "spotifyId": "5qUhjlQK2S1oAqM7dyZulJ",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qUhjlQK2S1oAqM7dyZulJ"
      }
    },
    {
      "id": "ff893c2d-9940-49fe-ab94-829cb4bee27e",
      "title": "Geez!  Mormon Swear Word Cost Me My Medical Care",
      "description": "On this episode of Mormonish Podcast, Rebecca and Landon are joined by special guest Wells Anderson as we delve into the world of swearing, Mormon swear words, and more.  Wells shares his recent experience of being denied medical care because he used the common expression \u0022Geez\u0022 in a text to his doctor. Taking offense at the use of that word, the doctor shared her religious point of view on \u0022swearing\u0022 and questioned whether Wells could be a patient. Social media has been discussing this situation with great interest and we are excited to have Wells tell us exactly what happened and join us for a larger discussion on the role of profanity in society and culture. ***How to DONATE to Mormonish Podcast:If you would like to financially support our podcast, you can DONATE to support Mormonish Podcast here:https://www.mormonishpodcast.org/supportAlso at:PayPal: https://paypal.me/BiblioTechMediaVenmo: @BiblioTechMediaWe appreciate our Mormonish viewers and listeners so much!Contact Mormonish Podcast: mormonishpodcast@gmail.com",
      "release": "2024-01-31T00:00:00",
      "duration": "01:43:41.4480000",
      "explicit": false,
      "spotifyId": "1YT9lDgKyrPXgyk3bpxFlN",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YT9lDgKyrPXgyk3bpxFlN"
      }
    },
    {
      "id": "6f1153fc-696d-472f-b9f4-53568f30f0bc",
      "title": "Is the LDS Church Sending Mixed Messages?",
      "description": "On this episode of Mormonish Podcast, Rebecca and Landon delve into the current environment of confusion at the apparent mixed messages the LDS church is putting out regarding LGBT issues and the church\u0027s trajectory. We explore the broader picture of a church that appears to say one thing from the pulpit and then by their actions, indicate another point of view. This is causing a lot of confusion among more conservative and orthodox members of the church and the more progressive members. We agree that everyone is completely justified in their confusion. When you are operating in a theocracy that you look to for instructons on how to live your life and even what opinions and beliefs you should hold, confusing or mixed messages from the top is not acceptable. Join Mormonish as we dig deeper into this issue and itsw  ramifications for everyone no matter where you fall on the Mormon spectrum.Jacob Hanson Videohttps://youtu.be/DXVL5AYQ8dY?si=Fb0GIabAmhQSZIfz Greg Matsen Videohttps://www.youtube.com/watch?v=26evOFf6mmoMormonish Podcast: Faith Matters Restorehttps://youtu.be/poBYvv9ClV4?si=Bk6pSkG2gvLjm4ZlHow to Donate to Mormonish Podcast:We appreciate our Mormonish viewers and listeners so much! If you would like to financially support our podcast, you can DONATE to support Mormonish Podcast here:PayPal: https://paypal.me/BiblioTechMedia?cou...Venmo: @BiblioTechMediaContact Mormonish Podcast: mormonishpodcast@gmail.com",
      "release": "2024-01-26T00:00:00",
      "duration": "01:25:11.0400000",
      "explicit": false,
      "spotifyId": "2i8eGwWlwlQ6D4UTnK1l4Z",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2i8eGwWlwlQ6D4UTnK1l4Z"
      }
    },
    {
      "id": "d8e8835e-05a1-4e00-858a-84754cd379b1",
      "title": "Dr. John Lundwall Responds to LDS Apologists",
      "description": "In this episode of Mormonish Podcast, Rebecca and Landon sit down with Dr. John Lundwall to review and respond to criticisms from LDS apologists regarding our 5 part series on Book of Mormon authenticity. Our series with Dr. Lundwall showcases his ground breaking dissection and analysis of he Book of Mormon\u0027s authenticity from several different scholarly and scientific angles. Dr. Lundwall\u0027s episodes have the highest number of views on Mormonish Podcast because this information has not been explored to this level before. We appreciate Dr. Lundwall sharing his expertise with us in this important series and we felt it was valuable to have him address the apologists who have discussed his work on other channels. We would love to see any apologists come on an episode of Mormonish to talk with Dr. Lundwall directly. It\u0027s an open invitation! Links to Dr. Lundwall\u0027s series: Pt 1https://youtu.be/xu6VV9Nfq3E?si=1L-malSnQ5CWmrWA Pt 2https://youtu.be/TszW4R90SQE?si=xuRu9rbhBJjNAetM Pt 3https://youtu.be/n6UzHA5QAH8?si=Hp_h-ZtySjWSW9Gl Pt 4https://youtu.be/MxEd4TQqDNw?si=dExqdZ97gIcvh7sr Pt 5https://youtu.be/AIHTx5WehhY?si=VyiDHHjaafcuPkmKDon\u0027t forget to LIKE and SUBSCRIBE to Mormonish Podcast How to Donate to Mormonish Podcast:We appreciate our Mormonish viewers and listeners so much! If you would like to financially support our podcast, you can DONATE to support Mormonish Podcast here: PayPal: https://paypal.me/BiblioTechMedia",
      "release": "2024-01-24T00:00:00",
      "duration": "02:12:26.9510000",
      "explicit": false,
      "spotifyId": "3xCCgUxXoiGbjig1vvBv2w",
      "appleId": 1000642718860,
      "youTubeId": "7pXtr864uF0",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xCCgUxXoiGbjig1vvBv2w",
        "apple": "https://podcasts.apple.com/podcast/dr-john-lundwall-responds-to-lds-apologists/id1655254481?i=1000642718860",
        "youtube": "https://www.youtube.com/watch?v=7pXtr864uF0"
      }
    },
    {
      "id": "e42a0225-efa7-4e4a-b7f0-934e8819034f",
      "title": "The LeBaron Cult Murdered My Grandfather",
      "description": "On this episode of Mormonish Podcast, Rebecca and Landon are joined by our friend and previous podcast guest, Liz Phillips to discuss events portrayed in a recent Hulu documentary, \u0022Daughters of the Cult.\u0022The documentary portrays the story of a polygamous cult led by Ervil LaBaron and the atrocities it committed over decades. Liz\u0027s grandfather, Rulon Allred, prophet of the Apostolic United Brethern, was murdered by members of the cult in 1977. Liz discusses the far reaching effects of this tragic event and the generational trauma members of the family still experience. Link to Dorothy Allred Solomon\u0027s bookhttps://www.amazon.com/Predators-Prey-Other-Kinfolk-Polygamy/dp/0393049469 Don\u0027t forget to like and subscribe to Mormonish Podcast! How to Donate to Mormonish Podcast:We appreciate our Mormonish viewers and listeners so much! If you would like to financially support our podcast, you can DONATE to support Mormonish Podcast here: PayPal: https://paypal.me/BiblioTechMedia?cou...Venmo: @BiblioTechMedia Contact Mormonish Podcast: mormonishpodcast@gmail.com",
      "release": "2024-01-19T18:00:00Z",
      "duration": "01:31:46.5360000",
      "explicit": false,
      "spotifyId": "2dnGoMLzqqpXBRRVOIxe6c",
      "appleId": 1000642252873,
      "youTubeId": "AxEPob0p1zM",
      "subjects": [
        "Church of the First Born of the Lamb of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2dnGoMLzqqpXBRRVOIxe6c",
        "apple": "https://podcasts.apple.com/podcast/the-lebaron-cult-murdered-my-grandfather/id1655254481?i=1000642252873",
        "youtube": "https://www.youtube.com/watch?v=AxEPob0p1zM"
      }
    },
    {
      "id": "03f39f7c-1fc6-4934-9ac6-d7f538d3dbb7",
      "title": "The Book of Abraham, Smoking Gun of Mormonism: What\u0027s it Really All About?",
      "description": "On this extremely informative episode of Mormonish Podcast, Rebecca and Landon sit down with our knowledgeable friend, Andrew Schnobrich, to do a deep, yet accessible dive into The Book of Abraham. Andrew has created a slide show and presentation that helps all of us more clearly understand the overwhelming problems with the BOA translation and Joseph Smith\u0027s claim to have translated it from Reformed Egyptian.Andrew\u0027s comprehensive slide presentation takes us through this translation process step by step, to help us understand the multiple problems and discrepencies that exist in what is supposed to be a prophetic translation of a record written by Moses\u0027 own hand.Once you understand the real meaning of the characters and the drawings, it becomes obvious Joseph Smith did not translate this papyri correctly by any stretch of the imagination. This creates a big problem for the Pearl of Great Price and the LDS church itself.This is Part 1 of a two part series on The Book of Abraham. How to Donate to Mormonish Podcast:We appreciate our Mormonish viewers and listeners so much! If you would like to financially support our podcast, you can DONATE to support Mormonish Podcast here: PayPal: https://paypal.me/BiblioTechMedia?cou...Venmo: @BiblioTechMedia Contact Mormonish Podcast: mormonishpodcast@gmail.com",
      "release": "2024-01-19T00:00:00",
      "duration": "01:27:25.9680000",
      "explicit": false,
      "spotifyId": "0AwXKJoLvax1SmginLdWRt",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0AwXKJoLvax1SmginLdWRt"
      }
    }
  ]
}