{
  "id": "c573200f-c80b-421d-a4b2-d037c3154e1d",
  "name": "Mormon to Muse",
  "spotifyId": "3AaLYMO5mdAtYokM0VGOLp",
  "appleId": 1817729811,
  "youTubeChannelId": "UCw3epE1v_zzB5YbXmKoUOHQ",
  "youTubePlaylistId": "PL3xei_K5l2PmugV4KMGLgyVLrebXw-3YT",
  "episodes": [
    {
      "id": "d7566762-97ac-42ba-ac58-c9b15c570306",
      "title": "Self Discovery Part 2",
      "description": "In Episode 8 of Mormon to Muse, we explore the essential steps to self-discovery for women navigating life after Mormonism. Leaving a high-demand religion can leave you feeling lost or disconnected from your true self. This episode is your roadmap to reconnecting with your values, desires, and authentic identity. We’ll walk through 8 clear, practical steps to help you: Get curious about who you really are Recognize old patterns and beliefs Clarify what matters most to you now Take small, courageous steps toward reinvention Whether you’re newly out of the church or years into your journey, these steps will help you move from confusion to clarity. Key Topics Covered: What self-discovery really means after religious deconstruction The difference between self-discovery and “creating a new self” 8 actionable steps for reconnecting with yourself How to deal with fear, doubt, and feeling “lost” Why Listen: If you’ve ever asked yourself, “Who am I without Mormonism?”—this episode will give you permission, tools, and hope to start answering that question. Mormon to Muse Connect with Me Instagram: @mormontomuse Website \u0026 Email List: Sunday Muse Sign-up steps to self-discovery, self-discovery after Mormonism, ex-Mormon healing, faith deconstruction, reclaiming your identity, post-Mormon podcast, therapeutic art for healing, spiritual trauma recovery, creative self-discovery. While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with #SelfDiscovery #FaithDeconstruction #ExMormon #PostMormonHealing #SpiritualTrauma #TherapeuticArt #MormonToMuse #WomenEmpowerment #RebuildYourLife",
      "release": "2025-07-13T11:00:00Z",
      "duration": "00:27:15.2160000",
      "explicit": false,
      "spotifyId": "0FXBxGZy2IW8YTgi2WAJPf",
      "appleId": 1000717038662,
      "youTubeId": "7WV6OjTBsJo",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0FXBxGZy2IW8YTgi2WAJPf",
        "apple": "https://podcasts.apple.com/podcast/self-discovery-part-2/id1817729811?i=1000717038662",
        "youtube": "https://www.youtube.com/watch?v=7WV6OjTBsJo"
      }
    },
    {
      "id": "12ca902c-e39b-4eb0-9976-5cfc33a9f1d3",
      "title": "Episode 7 - Self Discovery Part 1",
      "description": "Welcome to Mormon to Muse, the podcast for post-Mormon women ready to heal, reconnect with themselves, and create a life that feels truly their own. In Episode 7, we’re exploring barriers to self-discovery—the hidden obstacles that can keep you stuck, disconnected, and unsure of who you really are. Leaving Mormonism (or any high-demand religion) can feel like stepping into the unknown. Even after you reject old beliefs, you might find yourself repeating old patterns or struggling to know what you really want. Today we’ll look at why that happens—and what you can do about it. In this episode, you\u0027ll learn: The most common barriers to self-discovery for post-Mormon women (including fear, people-pleasing, and black-and-white thinking) Why high-control systems discourage self-exploration How to recognize when you’re avoiding your own desires, feelings, or needs Fear of disappointing others often keeps us small. You deserve permission to change your mind and redefine your life on your own terms. Related Episodes Episode 1: My Story – Leaving Mormonism and Finding Healing Through Art Episode 6: Waking Up to Control – The BITE Model Connect with Mormon to Muse If you’re ready to go deeper into healing after Mormonism, subscribe to the Sunday Muse newsletter for weekly therapeutic art prompts and reflections. SIGN UP FOR SUNDAY MUSE Follow along for more: YouTube: Mormon to Muse Instagram: @mormontomuse Apple Podcasts: Mormon to Muse While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with.",
      "release": "2025-07-06T11:00:00Z",
      "duration": "00:21:00.4310000",
      "explicit": false,
      "spotifyId": "7d59LJg8QdVyzCcnyp7p0a",
      "appleId": 1000715967802,
      "youTubeId": "sbGkep-NaD8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7d59LJg8QdVyzCcnyp7p0a",
        "apple": "https://podcasts.apple.com/podcast/episode-7-self-discovery-part-1/id1817729811?i=1000715967802",
        "youtube": "https://www.youtube.com/watch?v=sbGkep-NaD8"
      }
    },
    {
      "id": "7db09ea6-25a7-44bb-9589-b751fbbd2fee",
      "title": "Waking up to Control - Episode 6",
      "description": "Leaving Mormonism—or any high-demand religion—often means realizing that what felt “normal” was actually coercive control. In this episode of Mormon to Muse, we’re talking about waking up to those dynamics using Stephen Hassan’s BITE Model as our guide. The BITE Model is a framework for identifying authoritarian control in cults and high-control groups. It breaks manipulation into four clear categories: Behavior Control Information Control Thought Control Emotional Control By examining each piece, you can start to recognize the systems you were part of—not as personal failure, but as designed to keep you compliant. This conversation is for you if: You’re deconstructing Mormonism or any rigid belief system You want to understand why leaving feels so hard You’re working to rebuild self-trust and personal authority You suspect the group you left might have used coercive or manipulative tactics In this episode, we cover: What the BITE Model is and why it’s so helpful for ex-Mormons How Mormonism exerts control over behavior (dress codes, obedience culture, time demands) How information is tightly managed (approved sources, anti-Mormon labeling, correlated curriculum) How thought control shows up (thought-stopping, black-and-white thinking, prophetic authority) How emotional control keeps people in line (fear, guilt, shame, love-bombing) Signs you’re waking up to these forms of control in your own life Why naming these patterns is a key step in reclaiming your freedom Get the Sunday Muse Email: Want weekly art prompts and reflections to help you heal after high-demand religion? Sign up here: https://www.mormontomuse.com/sunday-muse-opt-in-86fbfcf3-573a-4a4c-978f-07f128d08264 You can find me on YouTube: https://www.youtube.com/@mormontomuse1 Follow on Instagram: https://www.instagram.com/mormontomuse/ Steven Hassan website and more information about he BITE model: https://freedomofmind.com/",
      "release": "2025-06-29T11:00:00Z",
      "duration": "00:28:06.0960000",
      "explicit": false,
      "spotifyId": "1zyH19hz1wBqikS6dfbafr",
      "appleId": 1000715002863,
      "youTubeId": "GpThoLHjffs",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zyH19hz1wBqikS6dfbafr",
        "apple": "https://podcasts.apple.com/podcast/waking-up-to-control-episode-6/id1817729811?i=1000715002863",
        "youtube": "https://www.youtube.com/watch?v=GpThoLHjffs"
      }
    },
    {
      "id": "9b1e777a-1c2e-4463-b47b-fc7a8f8714bb",
      "title": "How to Know the Truth - Episode 5",
      "description": "When you leave a high-demand religion like Mormonism, one of the biggest challenges isn’t just rethinking your beliefs—it’s learning how to think again without relying on external authority. In this episode of Mormon to Muse, I share a four-part framework that’s helped me rebuild critical thinking as a spiritual and creative practice: Logos (logic), Ethos (credibility), Pathos (emotion), and Duos (paradox). We’ll explore how each of these shows up in everyday decisions—and in your art. Because the truth is, how you approach a blank canvas often mirrors how you approach your own inner life. In this episode, you’ll learn: What each of the four modes means and how they work together How high-demand religion often distorts or suppresses these ways of thinking Why Duos—the ability to hold two truths at once—is especially vital for post-Mormons How you can apply each part of this framework not just to life, but to your creative process We’ll also discuss how: Logos shows up as structure, planning, and composition in your artwork Ethos guides your authentic voice and creative integrity Pathos emerges through color, emotion, and intuitive expression Duos invites you to hold tension in your art without needing to resolve it Want to go deeper? This episode is paired with a therapeutic art prompt called “The Four Voices Within”—available now in this week’s Sunday Muse email. Sign up here to get it: https://www.mormontomuse.com/monday-muse-opt-in-86fbfcf3-573a-4a4c-978f-07f128d08264 Let’s connect: YouTube (painting \u0026#43; podcast visuals): https://www.youtube.com/@mormontomuse1 Instagram https://www.instagram.com/mormontomuse Listen on Apple Podcasts: https://podcasts.apple.com/us/podcast/mormon-to-muse/id1817729811 While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with. #criticalthinking #exmormon #deconstruction #mormontomuse #faithtransition #therapeuticart #artheals #creativehealing #postmormon #logosethospathosduos #religioustrauma #artastherapy #lifecoachingforwomen",
      "release": "2025-06-22T11:00:00Z",
      "duration": "00:35:15.9830000",
      "explicit": false,
      "spotifyId": "1joY6fcbXIpiagpHpolQ9S",
      "appleId": 1000714041743,
      "youTubeId": "IvGyk-PXKy4",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1joY6fcbXIpiagpHpolQ9S",
        "apple": "https://podcasts.apple.com/podcast/how-to-know-the-truth-episode-5/id1817729811?i=1000714041743",
        "youtube": "https://www.youtube.com/watch?v=IvGyk-PXKy4"
      }
    },
    {
      "id": "bb163d76-481f-4e2a-af2c-b7ff2dc11404",
      "title": "9 Questions to ask yourself after leaving Mormonism - Episode 4",
      "description": "Episode 4: 9 Questions to Ask Yourself After Leaving Mormonism Mormon to Muse Podcast with Kristin Martineau Leaving Mormonism often means leaving behind a decision-making framework that relied on external authority—leaders, scriptures, promptings, and rules. But what happens when that structure is gone? How do you learn to trust yourself again? In this episode, I share 9 powerful questions that can help you rebuild self-trust and make confident, authentic decisions on your own terms. These questions are designed to reconnect you with your inner wisdom, clarify your values, and support your growth as a whole, autonomous person. Whether you\u0027re navigating relationships, career choices, parenting, or spirituality, these questions offer a grounded way to make aligned decisions—without guilt or fear. \u0026#x1f3a8; Want to go deeper? This episode is paired with Therapeutic Art Prompt #4, which guides you in visually exploring your decision-making process. \u0026#x1f4e9; Get the free printable prompt \u0026#43; join the Sunday Muse email: https://www.mormontomuse.com/monday-muse-opt-in-86fbfcf3-573a-4a4c-978f-07f128d08264 Follow me on Instagram for more creative healing tools: https://www.instagram.com/mormontomuse/ #exmormon #faithtransition #deconstruction #rebuildingtrust #selftrust #decisionmaking #mormontomuse #religioustrauma #therapeuticart #postmormon #healingjourney #creativehealing #lifecoachforwomen While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-06-15T06:00:00Z",
      "duration": "00:25:39.7200000",
      "explicit": false,
      "spotifyId": "0kMobXQCGqEjnQunXr2qvk",
      "appleId": 1000712934244,
      "youTubeId": "BEi25J9yQj4",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0kMobXQCGqEjnQunXr2qvk",
        "apple": "https://podcasts.apple.com/podcast/9-questions-to-ask-yourself-after-leaving-mormonism/id1817729811?i=1000712934244",
        "youtube": "https://www.youtube.com/watch?v=BEi25J9yQj4"
      }
    },
    {
      "id": "24cc0b15-6074-472f-92f0-834450eb151d",
      "title": "There\u0027s Nothing Wrong with You - Understanding the Stages of Faith - Episode 2",
      "description": "Sign up for Mormon to Muse - I\u0027ll send a therapeutic art activity right to your inbox for free every week. It\u0027s an easy way to get started on your creative healing journey. Episode Title: Navigating Fowler’s Stages of Faith in a Mormon Faith Crisis Episode Summary: In this episode of Mormon to Muse, we’ll explore James Fowler’s Stages of Faith Development and how they apply to the unique journey of a Mormon faith crisis. Whether you’re questioning your beliefs, leaving the LDS Church, or rebuilding your spirituality outside of Mormonism, understanding these faith stages can bring clarity, validation, and hope. I’ll breaks down each stage in relatable, down-to-earth language and share insights on how these stages show up in the experience of former Mormons. If you’ve ever wondered why faith deconstruction feels like starting over, or why it’s so hard to talk about your evolving beliefs with faithful family and friends, this episode is for you. What You’ll Learn in This Episode: An overview of Fowler’s 6 Stages of Faith Development How each stage relates to the Mormon faith journey Why a faith crisis is actually a sign of spiritual growth The challenges of moving beyond Stage 3 (Synthetic-Conventional Faith) in a high-demand religion Key Topics Covered: Mormon faith crisis Fowler’s stages of faith explained Leaving the LDS Church Faith deconstruction and reconstruction Stages of spiritual development Post-Mormon healing Religious trauma and faith transition Creative expression for healing Identity after Mormonism Stages of Faith - James Fowler Navigating Mormon Faith Crisis - Thomas McConkie The Sin of Certainty - Peter Enns Falling Upward - Richard Rohr While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-06-03T21:00:00Z",
      "duration": "00:24:16.2960000",
      "explicit": false,
      "spotifyId": "1yaSkQxDe6rbfX9X8M3DxS",
      "appleId": 1000711073597,
      "youTubeId": "lS5IHJwsYBE",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1yaSkQxDe6rbfX9X8M3DxS",
        "apple": "https://podcasts.apple.com/podcast/theres-nothing-wrong-with-you-understanding-the/id1817729811?i=1000711073597",
        "youtube": "https://www.youtube.com/watch?v=lS5IHJwsYBE"
      }
    },
    {
      "id": "b6b50aa4-a3db-4db6-ac8d-1e9951865be3",
      "title": "Mormon to Muse - My Story of Creative Healing - Episode 1",
      "description": "In this very first episode, I’m sharing a piece of my own story — how I navigated a painful faith transition and how art became a lifeline through the uncertainty, grief, and rebuilding that followed. Leaving the belief system I was raised in wasn’t just about walking away; it was about losing a whole framework for identity, community, and meaning. It was disorienting, heartbreaking... and ultimately, freeing. Through creativity — starting with simple watercolor paintings — I found a way to process emotions that words couldn’t touch. Art helped me reclaim my voice, rebuild my sense of self, and reconnect with a deeper, wiser part of me that religion had silenced. In this episode, you\u0027ll hear: A little about my upbringing and faith journey The unexpected role creativity played in my healing Why making art (even imperfectly) is such a powerful tool for navigating transition. What you can expect from this podcast going forward Whether you\u0027re deep in your own deconstruction or just starting to ask questions, I hope this story reminds you that healing isn’t linear — but it is possible. Thanks for being here. I’m so glad we’re doing this together. Sign up for Monday Muse to get a free creative healing exercise sent to your inbox every week. You can find me on instagram at Mormon to Muse and on YouTube While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-06-03T21:00:00Z",
      "duration": "00:25:24.6400000",
      "explicit": false,
      "spotifyId": "5j8zrIC7vcfqqqChp5Ueq4",
      "appleId": 1000711073822,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5j8zrIC7vcfqqqChp5Ueq4",
        "apple": "https://podcasts.apple.com/podcast/mormon-to-muse-my-story-of-creative-healing-episode-1/id1817729811?i=1000711073822"
      }
    },
    {
      "id": "da4e003b-6fca-4ec3-851c-cbd4a03020f6",
      "title": "Arrested Development - Episode 3",
      "description": "Arrested Development — 5 Ways Post-Mormons Are Like Teenagers Podcast: Mormon to Muse with Kristin Martineau Leaving Mormonism can feel like waking up in your own teenage rebellion—only this time, you\u0027re an adult. In this episode, I break down five ways post-Mormons are like teenagers and explore why emotional, spiritual, and developmental growth often gets paused in high-demand religions. We’ll talk about: Why leaving Mormonism often triggers a “second adolescence” The impact of obedience culture on emotional maturity How to reclaim autonomy, self-trust, and critical thinking The role of art and creativity in reparenting yourself How to move from stunted to sovereign If you’ve ever wondered why you feel like you\u0027re just now figuring out who you are—this one\u0027s for you. Subscribe, rate, and share with someone who’s healing after high-demand religion. Want the therapeutic art activity that goes with this episode? [Join the email list here.] While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-06-03T21:00:00Z",
      "duration": "00:23:43.8230000",
      "explicit": false,
      "spotifyId": "6YqG8U2YtmoigbHO4M5kmI",
      "appleId": 1000711073878,
      "youTubeId": "LFSTfPKB5W0",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YqG8U2YtmoigbHO4M5kmI",
        "apple": "https://podcasts.apple.com/podcast/arrested-development-episode-3/id1817729811?i=1000711073878",
        "youtube": "https://www.youtube.com/watch?v=LFSTfPKB5W0"
      }
    }
  ]
}