{
  "id": "c573200f-c80b-421d-a4b2-d037c3154e1d",
  "name": "Mormon to Muse",
  "spotifyId": "3AaLYMO5mdAtYokM0VGOLp",
  "appleId": 1817729811,
  "youTubeChannelId": "UCw3epE1v_zzB5YbXmKoUOHQ",
  "youTubePlaylistId": "PL3xei_K5l2PmugV4KMGLgyVLrebXw-3YT",
  "episodes": [
    {
      "id": "8ae36dc1-06d3-4801-a686-ab73374f3fb9",
      "title": "Episode 31 - The Stage Where Everyone Quits (The Four Stages of Learning)",
      "description": "What if the frustration, self-doubt, and awkwardness you feel when learning something new isn’t a sign you’re failing—but proof that you’re exactly where you’re supposed to be?\n\nIn this episode of Mormon to Muse, we explore The Four Stages of Learning and how this framework can help you understand your creative process, your healing journey, and your identity rebuilding after leaving a high-demand system like Mormonism. Whether you’re learning how to paint, how to feel your emotions, how to trust yourself, or how to live without external authority telling you what’s “right,” these stages explain why growth often feels uncomfortable—and why that discomfort is necessary.\n\nIn This Episode, We Explore: What the Four Stages of Learning are and how they show up in everyday life\n\nWhy unconscious incompetence can feel deceptively safe Why the second stage—conscious incompetence—is the hardest and most tempting place to quit How perfectionism and comparison keep us stuck\n\nWhy mastery is not a permanent destination but a moving relationship with growth How learning art mirrors emotional healing and identity reconstruction\n\nThe Four Stages of Learning: Uninformed Optimism – You don’t know what you don’t know\n\nInformed Pessimism – You see the gap, and it feels uncomfortable\n\nInformed Optimism  – You can do it, but it takes effort and attention\n\nMastery/Integration – The skill becomes integrated and embodied\n\nThis episode reframes frustration as information, not evidence that you’re “behind” or “not cut out for this.”\n\nWhy This Matters After Leaving Mormonism: Many women leave the church believing that if something is meant for them, it should feel easy or immediately clear. But learning—especially emotional and creative learning—doesn’t work that way. Understanding these stages helps you: Stop interpreting discomfort as disqualification Build self-trust instead of outsourcing authority Stay with yourself during the messy middle of growth.",
      "release": "2025-12-21T12:00:00Z",
      "duration": "00:18:06",
      "explicit": false,
      "spotifyId": "0q1i9XZhrVUdyKgnYzfjE3",
      "appleId": 1000742191410,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0q1i9XZhrVUdyKgnYzfjE3",
        "apple": "https://podcasts.apple.com/podcast/episode-31-the-stage-where-everyone-quits-the-four/id1817729811?i=1000742191410"
      }
    },
    {
      "id": "5fcabbea-21ac-4eeb-a2f5-aae4cbda1e19",
      "title": "Episode 30 - The Cost of Distraction",
      "description": "Get the Anxiety Soothing art prompts HERE\n\nDistraction isn’t a personal failure. It’s a symptom.\n\nIn this episode of Mormon to Muse, we explore distraction not as a productivity problem—but as an attention and devotion problem. Especially for women who were raised in high-demand systems, distraction often develops as a survival strategy: a way to avoid discomfort, override intuition, and stay externally focused.\n\nWe talk about how modern digital life mimics the same patterns many of us learned in religion—limited choices, constant input, and subtle pressure to look outward instead of inward. And we gently reframe attention as something sacred, powerful, and reclaimable.\n\nThis episode isn’t about deleting apps or becoming more disciplined. It’s about noticing where your attention goes, what it protects you from feeling, and how to return to yourself without shame.\n\n \n\nIn This Episode, We Explore Why distraction is often a nervous-system response, not a lack of willpower\n\nHow high-demand religions train us to outsource attention and authority\n\nThe hidden cost of constant stimulation and emotional avoidance\n\nWhy “paying attention” is a form of devotion How creative expression helps restore presence and inner trust\n\nWhat it means to gently return to yourself again and again Key Ideas\n\nAttention is not neutral—it shapes your inner life\n\nDistraction often protects us from emotions we were never taught how to feel You don’t need more discipline; you need more permission\n\nAwareness, not shame, is the doorway back to yourself\n\nReferences\n\nhttps://www.sciencedirect.com/science/article/pii/S2590291125005212?utm_source=chatgpt.com\n\nhttps://pmc.ncbi.nlm.nih.gov/articles/PMC8622754/?utm_source=chatgpt.com#sec6-ijerph-18-12257\n\nUpstream by Mary Oliver (Penguin Press, 2016)",
      "release": "2025-12-14T12:00:00Z",
      "duration": "00:23:03",
      "explicit": false,
      "spotifyId": "7M25i3bNkhhpO75M9UTiYZ",
      "appleId": 1000741213923,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "The Order of Nine Angles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7M25i3bNkhhpO75M9UTiYZ",
        "apple": "https://podcasts.apple.com/podcast/episode-30-the-cost-of-distraction/id1817729811?i=1000741213923"
      }
    },
    {
      "id": "10ebd877-b99d-4b2a-84dc-91258c2f5ba0",
      "title": "Episode 29 - Abundance as Rebellion",
      "description": "Leaving a high-demand system like Mormonism often leaves us with an unexpected residue — a deep, body-level sense of scarcity. Scarcity of time. Scarcity of worth. Scarcity of permission. Scarcity of possibility.\n\nIn today’s episode, we explore what it means to practice abundance as an act of rebellion. We look at how Claude Monet — yes, the Monet of water lilies and gardens — refused to let grief, loss, or tradition confine him. Instead, he expanded. He painted obsessively, repetitively, and on a scale that defied every expectation of what a “proper” painting should be. His art became a declaration of abundance: “I will not stay small. I will not be limited. I will create more.” After leaving the church, many of us feel “too late,” “too behind,” or “too broken” to begin again. But abundance isn’t about money or perfection — it’s about choosing expansion over contraction. It’s about reclaiming the parts of you that were muted, doubted, or dismissed. It’s about refusing to let your pain be the final author of your life.\n\nIn this episode, you’ll learn: Why scarcity wiring runs so deep after a high-control environment\n\nHow to identify when “I’m not enough” is actually conditioning talking\n\nWhat Monet can teach us about devotion, repetition, and creative expansion\n\nHow abundance becomes an internal stance, not an external circumstance\n\nWhy embracing beauty, pleasure, and creativity is rebellious for women raised in patriarchy\n\nThe small, daily shifts that open you to receiving more — more joy, more possibility, more self-trust\n\nWe also talk about the surprising truth: abundance isn’t something you wait to feel. It’s something you practice your way into. Just like Monet did.\n\nIf anxiety or old conditioning still pulls you into fear or scarcity, download my free Anxiety-Reducing Art Exercises — three simple creative practices to help your body soften and your mind reconnect with possibility. These practices are the first step toward the abundant, spacious life waiting for you.",
      "release": "2025-12-07T12:00:00Z",
      "duration": "00:24:00",
      "explicit": false,
      "spotifyId": "5NfHraa5Jk4uXCVGSGbKPw",
      "appleId": 1000740068358,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5NfHraa5Jk4uXCVGSGbKPw",
        "apple": "https://podcasts.apple.com/podcast/episode-29-abundance-as-rebellion/id1817729811?i=1000740068358"
      }
    },
    {
      "id": "64349fc0-2546-4edb-8fe2-37a024ce96a1",
      "title": "28- Reclaiming New Meaning: Holidays After Mormonism",
      "description": "Hi friends,\n\nGet my Anxiety Soothing Art if you need a small ritual to bring peace. \n\nThis week on the podcast, we’re talking about rituals—the ones we inherited, the ones we outgrew, and the ones we’re allowed to create now.\n\nIf you grew up in Mormonism, your life was full of ritual. Prayer, family home evening, blessings, temple ceremonies, holidays with strict meaning attached. There was a rhythm to everything, even if that rhythm came with pressure, perfectionism, and emotional suppression.\n\nLeaving the church often means losing that rhythm. Not just the beliefs—but the structure that held your days and seasons. And suddenly there’s this space. This quiet. This sense of floating. This question: What do I anchor myself to now? Here’s the truth I want you to hear: Ritual never belonged to the Church. Ritual belongs to you. Ritual is older than religion. It’s human. It’s creative. It’s nervous-system regulation wrapped in meaning-making. It’s what our ancestors used to mark time, soothe themselves, and feel connected to their lives.\n\nYou get to reclaim that now. You get to decide what opens your mornings. What closes your evenings. What your holidays look like. What your family gathers around. What moments you choose to call sacred—in the truest, most honest sense of the word. You don’t need permission. You don’t need a calling. You don’t need a handbook.\n\nYour rituals can be tiny: Lighting a candle. Taking one deep breath before dinner. Writing down three things you accomplished that day. A weekly walk. A monthly art night. A December tradition that feels like home to you. Ritual is simply attention repeated. It’s presence practiced. It’s choosing what matters to you now—and letting that guide your rhythm. This is part of becoming. This is part of healing your nervous system after years of external structure. This is part of learning to trust yourself again. This is you building a life that fits.\n\nGet my Anxiety Soothing Art if you need a small ritual to bring peace.",
      "release": "2025-11-30T12:00:00Z",
      "duration": "00:31:37",
      "explicit": false,
      "spotifyId": "0CkW9H2WHfOJDviq5udYcE",
      "appleId": 1000738986977,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CkW9H2WHfOJDviq5udYcE",
        "apple": "https://podcasts.apple.com/podcast/28-reclaiming-new-meaning-holidays-after-mormonism/id1817729811?i=1000738986977"
      }
    },
    {
      "id": "745c2013-8c16-49d5-9628-f52311cca58f",
      "title": "The Psychology of Internalized Constraint",
      "description": "What happens when the rules you grew up with continue running your life long after you’ve left the system that taught them? In today’s episode, we’re talking about internalized constraint—the invisible expectations, fears, obligations, and “shoulds” that live inside your nervous system and shape your choices without you even realizing it.\n\nWhether you grew up in Mormonism or any high-demand environment, you learned to be “good” in ways that required self-abandonment: don’t question, don’t feel too much, don’t want too much, don’t upset anyone, don’t take up too much space. Over time, those external rules become internal scripts. This episode helps you identify those scripts, understand how they form, and most importantly, learn how to dismantle them so you can make decisions from a place of inner authority rather than fear, guilt, or conditioning.\n\nIn this episode, you’ll learn: What “internalized constraint” actually means and why it’s not your fault How your upbringing trained your nervous system to override your intuition\n\nThe difference between internalized constraint and an internal locus of control\n\nWhy you still feel guilty or anxious even after leaving the church\n\nHow to recognize the internal cage vs. your authentic inner voice\n\nSmall, practical shifts that help you reclaim your agency\n\nHow creative expression helps loosen old conditioning and create internal spaciousness\n\nWhy this matters: You can leave the system but still have the system living inside you. Your healing isn’t about proving anything to anyone—it’s about learning to trust yourself again. And the good news? The moment you start paying attention to your feelings, your body, and your creativity, that internal cage begins to open.\n\n ➡️ Download my free “Anxiety-Soothing Art Exercises” HERE\n\nThey’re gentle, beginner-friendly, and designed specifically for nervous system regulation.",
      "release": "2025-11-23T16:21:00Z",
      "duration": "00:30:40",
      "explicit": false,
      "spotifyId": "6IV1wT2WfIxnRk55Upgp79",
      "appleId": 1000738000986,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6IV1wT2WfIxnRk55Upgp79",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-internalized-constraint/id1817729811?i=1000738000986"
      }
    },
    {
      "id": "5e67a0c8-efb8-4825-a841-b3757a3e7d5b",
      "title": "Episode 26- Recovering the Lost Stories: Why Myth Matters After High-Demand Systems",
      "description": "In this episode, we explore one of the most important—and misunderstood—stories in the feminine archive: Bluebeard.\n\nThis tale isn’t about morbid curiosity or a woman “disobeying.” It’s about awakening. About reclaiming the instinct to know what you know. About refusing to live in a house of secrets and silence. Bluebeard is the archetype of any system—religious, cultural, or relational—that says: “Don’t look. Don’t question. Don’t open that door.” But when a woman opens the hidden room, she isn’t betraying anyone. She’s returning to herself.\n\nWe talk about: Why the “forbidden room” is always the room of truth\n\nHow high-demand systems cultivate fear of inner knowing\n\nWhy awakening is never passive—it requires seeing what’s actually there\n\nWhat this story shows us about feminine intelligence, boundaries, and freedom\n\nThis is a must-listen if you were taught that obedience is safety, that questioning is dangerous, or that following your intuition makes you ungrateful or rebellious.\n\nBluebeard is the patron saint of every woman who has ever whispered, “Something feels wrong,” and then opened the door anyway.\n\nIf leaving a high-demand system has left your nervous system on constant alert—or if waking up to your own truth feels both empowering and terrifying—these simple art exercises will help. They’re gentle, grounding, and made for moments when your body says “this is too much.”\n\n👉 Download the free Anxiety-Soothing Art Prompts https://mormontomuse.mykajabi.com/anxietyart \n\nListen \u002B Share If this episode resonates, please share it with a friend who’s rebuilding her inner world. And if you love the show, leaving a rating and review helps other women find this work.\n\nReferences:\n\nZipes, Jack. The Origins of Fairy Tales: From the Middle Ages to the Present. Princeton University Press, 2012\n\nZipes, Jack. Fairy Tales and the Art of Subversion. Routledge, 1983\n\nZipes, Jack. The Trials and Tribulations of Little Red Riding Hood. Routledge, 1993\n\nClarissa Pinkola Estés, Ph.D., Women Who Run With the Wolves: Myths and Stories of the Wild Woman Archetype (New York: Ballantine Books, 1992)",
      "release": "2025-11-16T12:00:00Z",
      "duration": "00:24:00",
      "explicit": false,
      "spotifyId": "2Zi2guBbarJwek0ML6aNuD",
      "appleId": 1000736946072,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Zi2guBbarJwek0ML6aNuD",
        "apple": "https://podcasts.apple.com/podcast/episode-26-recovering-the-lost-stories-why-myth/id1817729811?i=1000736946072"
      }
    },
    {
      "id": "261427f0-90cb-4bb0-870c-6eea91c86c24",
      "title": "Episode 25- Learning to Trust Your Intuition",
      "description": "Get the free Prompts to calm anxiety\n\nWhen you\u0027ve spent years—or decades—being told what is right, what is true, and what is best for you, trusting yourself again can feel disorienting. Many women raised in high-demand religious systems were taught that external authority is more trustworthy than their own internal wisdom. So when they leave, they’re left asking: What do I actually believe? What do I want? And how do I know if my intuition is something I can trust?\n\nIn this episode, we talk about the process of rebuilding self-trust after religious conditioning. We look at why intuition can feel confusing, how emotional suppression plays into it, and why it’s common to fear making the “wrong” choice once there’s no longer a clear rulebook to follow.\n\nYou’ll learn how to relate to your intuition in a grounded, steady way—without needing it to be perfect or magical. Inside this episode: How high-demand systems train you to defer to authority Why intuition often goes offline when your nervous system doesn’t feel safe\n\nThe fear of getting it wrong, disappointing others, or making a choice you can’t undo Why intuition is quiet and subtle—not dramatic or urgent How to begin repairing the relationship with your inner voice through small, consistent acts of self-honoring\n\nThe difference between intuition and anxiety (and how to tell them apart) What it means to let yourself experiment without self-punishment Trusting your intuition isn’t about always knowing the answer. It’s about building a relationship with yourself that can tolerate uncertainty and still move forward. This is how personal authority is reclaimed—gently, slowly, one self-honoring decision at a time.\n\nMentioned in this episode: Download the free therapeutic art exercises to help soothe anxiety and reconnect with your inner wisdom: https://www.mormontomuse.com/anxiety-art\n\nIf this episode resonated with you: Leave a review, share it with someone who might benefit, and subscribe so you don’t miss future episodes.",
      "release": "2025-11-09T12:00:00Z",
      "duration": "00:23:02",
      "explicit": false,
      "spotifyId": "18YnWyv6BlRQa4vNmQiPYg",
      "appleId": 1000735950473,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18YnWyv6BlRQa4vNmQiPYg",
        "apple": "https://podcasts.apple.com/podcast/episode-25-learning-to-trust-your-intuition/id1817729811?i=1000735950473"
      }
    },
    {
      "id": "3efea9f5-fe6b-4e03-9153-f5473f529e72",
      "title": "Episode 24 - Anxiety",
      "description": "Get the anxiety reducing art prompts HERE\n\nWhen you’ve spent years under spiritual surveillance — constantly monitored for worthiness, obedience, and purity — your nervous system learns to stay on high alert. Even when you leave that system, your body doesn’t automatically feel safe. Freedom can actually feel threatening.\n\nIn this episode, we explore what anxiety really is: not a moral failure or a lack of faith, but a natural response from a body that’s been trained to survive under pressure. You’ll learn how to distinguish between real danger and emotional stretching, how to gently observe your anxiety without becoming it, and how art can help calm an overactive nervous system.\n\nIn This Episode:\n\n\n\nHow living under constant scrutiny wires your body for hyper-vigilance\n\n\n\nThe difference between fear (a signal of danger) and anxiety (a signal of growth)\n\n\n\nHow observation itself begins to change your emotional experience\n\n\n\nSimple ways to use art as a nervous system regulator\n\n\n\nLinks \u0026 Resources:\n\n\n\nDownload your free Anxiety-Reducing Art Prompts PDF\n\n\n\nSign up for Sunday Muse to receive weekly creative healing prompts\n\n\n\nFollow me on Instagram: @mormontomuse \n\n\n\nListen and subscribe on Apple Podcasts: Mormon to Muse\n\n\n\n The Gift of Fear, Gavin Debecker\n\nhttps://www.psychologytoday.com/us/blog/pathological-relationships/201003/the-gift-fearthe-curse-anxiety\n\nhttps://www.psychologytoday.com/us/basics/anxiety/the-causes-of-anxiety\n\n \n\nWhile this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-11-02T12:00:00Z",
      "duration": "00:23:46",
      "explicit": false,
      "spotifyId": "7juI7Y7GzcwLFJES4fBoB4",
      "appleId": 1000734821418,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7juI7Y7GzcwLFJES4fBoB4",
        "apple": "https://podcasts.apple.com/podcast/episode-24-anxiety/id1817729811?i=1000734821418"
      }
    },
    {
      "id": "dc67a3f8-096a-4d03-9380-18d73a3bab1d",
      "title": "Reclaiming Your Life - It’s Not Too Late",
      "description": "Have you ever caught yourself thinking, “It’s too late for me”? Too late to change careers, to create art, to follow that dream you tucked away years ago?\n\nIn this episode, Kristin shares a deeply honest conversation about regret, renewal, and the beauty of starting over — no matter your age or stage of life.\n\nWe’ll explore what it means to grieve the woman you could have been while still believing in the woman you’re becoming.\n\nYou’ll learn why time isn’t your enemy, how creative expression can reawaken lost parts of yourself, and why it’s never too late to begin again.\n\nBecause every season of life holds its own kind of creative power — and sometimes, the second act is where the real magic happens. 🌱\n\nIn this episode, you’ll learn: Why the feeling of “too late” is a myth rooted in cultural conditioning\n\nHow to process grief for missed opportunities without shame\n\nWays to reconnect with your creativity after years of silence\n\nThe healing power of starting small — even when it feels pointless\n\nHow art, reflection, and mindfulness help you rewrite your story\n\nWhile this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with.",
      "release": "2025-10-26T06:00:00Z",
      "duration": "00:18:04",
      "explicit": false,
      "spotifyId": "5vW4uiJp1rdJ2RHbnXmgez",
      "appleId": 1000733524795,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5vW4uiJp1rdJ2RHbnXmgez",
        "apple": "https://podcasts.apple.com/podcast/reclaiming-your-life-its-not-too-late/id1817729811?i=1000733524795"
      }
    },
    {
      "id": "41606e89-bc37-48a4-a7f3-41ba1ace5036",
      "title": "Episode 22 - Creating vs Consuming",
      "description": "Get a free therapeutic art prompt delivered to your email every week. CLICK HERE to join Sunday Muse. Have you ever noticed how scrolling, watching, or even listening to “inspiring” content can leave you feeling tired — not fulfilled? In this episode, Kristin Martineau explores the energetic difference between creating and consuming — and why creating, even in small ways, restores our sense of presence, purpose, and self-connection. We talk about why humans are wired to create, why women in particular feel called to express and make meaning, and how creativity becomes a radical act of healing after living in systems that discouraged individuality or expression. If you’ve been feeling overstimulated, disconnected, or creatively blocked, this episode will help you slow down, tune in, and rediscover the power of making something that’s yours. In This Episode, You’ll Learn: Why consuming (even “good” content) can leave you drained instead of inspired The biological and emotional benefits of creative expression Why women are especially driven to create — and how it helps us reclaim energy, identity, and voice How to shift from passive consumption to active creation in small, simple ways How art, journaling, and presence can reconnect you with your inner muse. While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-10-19T11:00:00Z",
      "duration": "00:11:31.8790000",
      "explicit": false,
      "spotifyId": "04fZ1g92jHEuI4fiXpGqgb",
      "appleId": 1000732510771,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/04fZ1g92jHEuI4fiXpGqgb",
        "apple": "https://podcasts.apple.com/podcast/episode-22-creating-vs-consuming/id1817729811?i=1000732510771"
      }
    },
    {
      "id": "78b576fe-ca71-4f22-9031-8e0de752f060",
      "title": "Reclaiming Desire - Episode 21",
      "description": "In this episode of Mormon to Muse, we’re talking about desire — that quiet pulse beneath duty, expectation, and fear. If you grew up in a system that taught you to distrust your longings or call them selfish, you’re not alone. Many of us learned to silence the very parts of ourselves that lead us toward joy, creativity, and growth. But what if desire isn’t dangerous? What if it’s a sacred form of guidance — your inner compass pointing you back to what makes you feel alive? Join me as we explore: Why high-demand systems condition women to fear their desires How suppressing longing leads to disconnection, resentment, and self-doubt The difference between impulsive wanting and soulful desire How creativity and art-making help you reconnect with what you truly want Simple ways to start listening to your longings again — without shame or guilt You’ll leave this episode with a deeper understanding of how desire can be a spiritual practice — one that honors your body, your emotions, and your becoming. Resources: https://www.simplypsychology.org/suppression-as-a-defense-mechanism.htm While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-10-12T11:00:00Z",
      "duration": "00:26:12.3360000",
      "explicit": false,
      "spotifyId": "4xTmBnwfGR6pA2d9H3g9nu",
      "appleId": 1000731434517,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xTmBnwfGR6pA2d9H3g9nu",
        "apple": "https://podcasts.apple.com/podcast/reclaiming-desire-episode-21/id1817729811?i=1000731434517"
      }
    },
    {
      "id": "ed15c24e-21e6-4c46-83dc-01fc6cffc04a",
      "title": "How to be Confident - Episode 20",
      "description": "Get your FREE tickets to the Energy Healing Conference October 18th in Sandy Utah. I\u0027ll be there all day at my vendor booth and I\u0027ll be speaking also at 5 pm. Come say hello! If you want to come to my class be sure to purchase the art kit ($10) ahead of time to guarantee your spot! Confidence is not something you’re born with or without—it’s something you create. In this episode, we explore what true confidence is, what blocks it, and how to start building it from the inside out. Growing up in a high-demand system like Mormonism often means confidence gets tangled up with perfectionism, obedience, and external approval. Many of us were taught to distrust our own inner knowing, leaving us uncertain of our worth or abilities. But confidence isn’t about being flawless or always right—it’s about trusting yourself to figure things out along the way. In this conversation, you’ll learn: The difference between real confidence and false confidence. How cultural and religious messages can undermine self-trust. Why self-doubt and confidence can exist side by side—and how to choose which one to nurture. The role of feelings in creating confidence (and why it’s a practice, not a personality trait). Get your free Sunday Muse reflections in your inbox each week: HERE Connect with me on Instagram: @MormontoMuse",
      "release": "2025-10-05T11:00:00Z",
      "duration": "00:22:55.0070000",
      "explicit": false,
      "spotifyId": "72SiPbaNmRdDRyiU0HseTe",
      "appleId": 1000730209169,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/72SiPbaNmRdDRyiU0HseTe",
        "apple": "https://podcasts.apple.com/podcast/how-to-be-confident-episode-20/id1817729811?i=1000730209169"
      }
    },
    {
      "id": "7cdadf13-e15f-46a7-8f3c-2d9101e7efed",
      "title": "Episode 19 -Stressed or Inspired? The Art of Using Stress Wisely",
      "description": "Come see me at the Energy Healing Conference Oct 18 in Sandy Utah. Get your FREE TICKET HERE!\n\n \n\nStress is one of those words that instantly makes our shoulders tighten. But what if not all stress is bad? In this episode, we unpack the complicated relationship we have with stress — from the kind that pushes us to grow, to the kind that wears us down — and explore how creativity can be a powerful tool for restoring balance.\n\nWhat You’ll Learn in This Episode\n\n\nGood Stress vs. Bad StressHow to tell the difference between the stress that fuels growth and the stress that drains your body and mind.\n\n\n\nThe Role of RestWhy rest isn’t just a luxury — it’s the key factor that determines whether stress strengthens you or harms you.\n\n\n\nWhy Americans Are So StressedA look at cultural pressures, overwork, and societal norms that keep us stuck in cycles of chronic stress.\n\n\n\nThe Science of Art \u0026 Stress ReliefWhat’s happening in your brain when you make art, and why creativity naturally soothes your nervous system.\n\n\n\nHarnessing Good StressPractical ways to lean into healthy stress for growth and resilience, while keeping it from tipping into overwhelm.\n\n\n\nSources:\n\nhttps://journals.plos.org/plosone/article?id=10.1371%2Fjournal.pone.0282789\n\nhttps://www.mdpi.com/1660-4601/21/8/1077\n\n​​https://pmc.ncbi.nlm.nih.gov/articles/PMC3671693\n\nhttps://our.utah.edu/wp-content/uploads/sites/35/2022/09/Christensen_J.pdf\n\nhttps://www.mdpi.com/2077-1444/14/6/701\n\nhttps://bmcpsychiatry.biomedcentral.com/articles/10.1186/s12888-023-05091-2 \n\n \n\nWhile this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with.",
      "release": "2025-09-28T14:00:00Z",
      "duration": "00:28:51",
      "explicit": false,
      "spotifyId": "4dzAtAAEql59WlsGeDpAxH",
      "appleId": 1000728891767,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4dzAtAAEql59WlsGeDpAxH",
        "apple": "https://podcasts.apple.com/podcast/episode-19-stressed-or-inspired-the-art-of-using/id1817729811?i=1000728891767"
      }
    },
    {
      "id": "fadb91f6-6bb0-4271-a3ec-b573a1c677e0",
      "title": "9 Reasons I Love Being Wrong",
      "description": "What if being wrong could actually be a gift? Most of us were raised to avoid mistakes at all costs, but in this episode I want to flip that script. Being wrong has been one of the most powerful teachers in my own life—helping me grow, deepen relationships, and even discover that I am an artist (thank goodness I was wrong about that!). What You’ll Learn in This Episode Why our brains resist being wrong and why it feels so uncomfortable Nine reasons I’ve learned to actually love being wrong Stories of the biggest things I’ve been wrong about—and how they changed me How perfectionism keeps us stuck in fear of mistakes Reflection questions to help you reframe your own “wrong turns” Release control and perfectionism See mistakes as opportunities Practice compassion and flexibility in your creative life Reflection Questions When was the last time being wrong turned into something unexpectedly good for you? How does perfectionism keep you from experimenting, in art or in life? What assumptions or beliefs about yourself might be worth re-examining? How could being wrong actually deepen your relationships or increase compassion? Listen \u0026 Subscribe If this episode resonated with you, be sure to subscribe so you don’t miss the next one. And if you’d like to dive deeper into using art as a tool for healing and self-discovery, join my Sunday Muse newsletter HERE Disclaimer: I’m not a therapist.These exercises are not art therapy, but they have been powerful tools for healing in my own life and in the lives of the women I work with. #BeingWrong #HealingThroughArt #MormonToMuse #Perfectionism",
      "release": "2025-09-21T11:00:00Z",
      "duration": "00:22:30.2950000",
      "explicit": false,
      "spotifyId": "18kC2Pvy9BaRGYVx01UoLW",
      "appleId": 1000727720630,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18kC2Pvy9BaRGYVx01UoLW",
        "apple": "https://podcasts.apple.com/podcast/9-reasons-i-love-being-wrong/id1817729811?i=1000727720630"
      }
    },
    {
      "id": "1d51b9f8-acc7-426d-a88f-0c7d110a0ce0",
      "title": "Episode 17 - Us vs Them",
      "description": "Have you ever noticed how leaders—religious, political, or otherwise—use “us vs. them” language to stir emotions, create loyalty, and shut down critical thinking? In this episode of Mormon to Muse, I break down how this kind of rhetoric works, why it’s so effective, and the impact it has on individuals raised inside high-demand systems.\n\nI share examples from Mormon leaders, extremist religious figures, and even both major U.S. political parties to show just how universal this tactic is. You’ll see how the same phrases that once felt “faith-affirming” are actually manipulative tools designed to create fear, division, and unquestioned loyalty.\n\nWhat You’ll Learn in This Episode\n\n\nWhy “us vs. them” language is emotionally powerful but logically empty\n\n\n\nHow political and religious leaders use this tactic to control narratives\n\n\n\nThe psychological impact of always viewing outsiders as dangerous or wrong\n\n\n\nWhy recognizing these patterns is a critical step in reclaiming your own voice and agency\n\n🎧 Listen and subscribe on Apple Podcasts \n\n📺 Check out therapeutic art prompts on YouTube \n\n📩 Join the Sunday Muse newsletter for weekly inspiration: Subscribe here \n\n📷 Follow me on Instagram  for behind-the-scenes art and reflections\n\n\n\nArticles referenced in this episode:\n\nPsychology Today  The Psychology of Us vs Them\n\nWeb MD What is the Us vs Them Mentality? \n\n \n\n \n\n \n\nWhile this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with.",
      "release": "2025-09-14T11:00:00Z",
      "duration": "00:21:06",
      "explicit": false,
      "spotifyId": "5jtiv7vBQ2PjnbO9CEmVPB",
      "appleId": 1000726746323,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5jtiv7vBQ2PjnbO9CEmVPB",
        "apple": "https://podcasts.apple.com/podcast/episode-17-us-vs-them/id1817729811?i=1000726746323"
      }
    },
    {
      "id": "ccaa8bca-4540-4411-8c61-61f075f50369",
      "title": "Episode 16- Breaking the Legacy of Suffering",
      "description": "Generational pain is real. Many of us carry not only our own struggles but also the unhealed wounds of our mothers, grandmothers, and the women who came before us. They were taught to endure, to stay small, to sacrifice themselves, and often to silence their own needs. Without realizing it, we inherit those patterns. But the truth is: the suffering doesn’t have to continue through us. We have the power to say the line ends here.\n\nIn this episode of Mormon to Muse, I explore what it means to break the legacy of suffering and create something new.\n\nTogether we’ll look at: How generational pain is passed down—silence, shame, and submission.\n\nWhat it looks like to honor the women before us while refusing to repeat their suffering.\n\nHow creativity, voice, and courage can help us heal and rewrite the future.\n\nPractical steps you can take to consciously choose what gets carried forward and what stops with you.\n\n 👉 Join my Sunday Muse newsletter for more inspiration: Subscribe here",
      "release": "2025-09-07T11:00:00Z",
      "duration": "00:28:26",
      "explicit": false,
      "spotifyId": "4ym8q9BP1AbTRWadp69vSN",
      "appleId": 1000725371276,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4ym8q9BP1AbTRWadp69vSN",
        "apple": "https://podcasts.apple.com/podcast/episode-16-breaking-the-legacy-of-suffering/id1817729811?i=1000725371276"
      }
    },
    {
      "id": "905adf35-1f1d-463a-b5fe-65937eed327e",
      "title": "Redefining Connection: How Faith Transitions Reshape Relationships - Episode 15",
      "description": "Leaving or deconstructing a faith system doesn’t just change what you believe—it changes how you relate to the people you love. Whether it’s family who remain devout, a spouse who doesn’t understand your journey, or friendships that once revolved around shared beliefs, relationships can feel like the hardest part of faith transition. In this episode of Mormon to Muse, I explore why relationships are impacted so deeply when your faith changes—and how you can navigate that shift with more clarity and self-trust. Drawing on life coaching tools and my own experience, I’ll help you see that while you can’t control others’ thoughts or feelings, you can create empowering relationships by redefining connection on your own terms. What You’ll Learn in This Episode: Why relationships often feel unstable after a faith transition How the Self-Coaching Model can help you take ownership of your thoughts and expectations T he concept of “manuals” and how they create hidden pressure in relationships How to set healthy boundaries without cutting yourself off from love Why unconditional love starts with your relationship to yourself Listen if you’re wondering: Why does it feel like my relationships are falling apart after leaving my religion? How do I navigate family tension when I no longer believe? Is it possible to feel connected without pretending to be someone I’m not? Resources \u0026 Links Mentioned in This Episode: Subscribe to the Sunday Muse email for weekly art prompts and reflections YouTube Follow me on Instagram Listen to more episodes of Mormon to Muse on Apple Podcasts Disclaimer: While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with.",
      "release": "2025-08-31T11:00:00Z",
      "duration": "00:18:07.6080000",
      "explicit": false,
      "spotifyId": "3SEkiuwXLlrHy9r8dtqo4U",
      "appleId": 1000724250458,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3SEkiuwXLlrHy9r8dtqo4U",
        "apple": "https://podcasts.apple.com/podcast/redefining-connection-how-faith-transitions-reshape/id1817729811?i=1000724250458"
      }
    },
    {
      "id": "4ba6cec0-5e4f-4dfa-a1dc-6b37380fe06f",
      "title": "How to Tell the Difference Between Leaving and Deconstructing Faith",
      "description": "How to Tell the Difference Between Leaving and Deconstructing Faith | Episode Summary: Leaving a high-demand religion and deconstructing your faith are not the same thing. In this episode of Mormon to Muse, we’ll explore the crucial difference between the two—and why understanding it matters for your healing and growth. What You’ll Learn in This Episode: The difference between leaving religion and deconstructing faith Why leaving can still leave you tied to old beliefs and patterns How deconstruction helps you rebuild trust in yourself and your inner authority The emotional impact of each path and what it means for your relationships Practical ways to notice if you’re still carrying chains from your old belief system Why This Matters: Many ex-Mormons (and people from other high-demand religions) struggle because they’ve walked away physically but are still living under the same mental and emotional framework. Deconstructing allows you to not only leave but also take apart the beliefs that no longer serve you—and begin building something new. Resources \u0026 Links: \u0026#x1f399; Listen to more episodes of Mormon to Muse: Apple Podcasts \u0026#x1f4fa; Watch Therapeutic Art Prompts: YouTube Channel \u0026#x1f4e9; Get weekly therapeutic art prompts: Sunday Muse Email \u0026#x1f4f8; Join the conversation: Instagram @mormontomuse Leaving the Mormon church, faith deconstruction, religious trauma recovery, ex-Mormon podcast, healing after religion, therapeutic art for faith transition, Mormon to Muse. While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-08-24T11:00:00Z",
      "duration": "00:22:08.2220000",
      "explicit": false,
      "spotifyId": "33qKai4x7Qu3r8XPNiW3SY",
      "appleId": 1000723301291,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33qKai4x7Qu3r8XPNiW3SY",
        "apple": "https://podcasts.apple.com/podcast/how-to-tell-the-difference-between-leaving/id1817729811?i=1000723301291"
      }
    },
    {
      "id": "a27f8047-7cc3-4154-b0f9-e64917f7afd3",
      "title": "The Art of Moving Forward - Episode 13",
      "description": "Change is inevitable, but moving forward with grace, courage, and creativity is a skill we can all develop. In this episode of Mormon to Muse, I explore why change feels so uncomfortable, how our brains resist it, and how we can use both mindset tools and the creative process to embrace new seasons of life. You’ll learn: The biological and cultural reasons we resist change—even when we want it. How predictability and control keep us stuck. Mindset shifts that can help you cope with transitions and see them as opportunities. The surprising ways art can teach us to release perfectionism and welcome growth. Whether you’re navigating faith transitions, relationships, career shifts, or simply the unpredictability of everyday life, this episode will give you fresh insight and practical tools for moving forward with more confidence. YouTube Channel Instagram Sunday Muse",
      "release": "2025-08-17T11:00:00Z",
      "duration": "00:18:37.5960000",
      "explicit": false,
      "spotifyId": "5HkqK8qQOaEdFX41hO7IeU",
      "appleId": 1000722282695,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5HkqK8qQOaEdFX41hO7IeU",
        "apple": "https://podcasts.apple.com/podcast/the-art-of-moving-forward-episode-13/id1817729811?i=1000722282695"
      }
    },
    {
      "id": "fbd5a596-2b2e-4440-9352-4a73f528071f",
      "title": "Pain, Power, and the Art of Allowing Emotion - Episode 12",
      "description": "UPDATE- In this episode I talk about the idea of creating beauty from pain. I meant to mention that this idea comes from Susan Cain\u0027s book Bittersweet: How Sorrow and Longing Makes Us Whole. If you want to build a life that feels aligned, meaningful, and free—you have to be willing to feel everything. In this follow-up to Episode 11 (Why You Are Emotionally Stunted), we dive into the how. How do you actually feel your feelings instead of resisting, reacting, avoiding, or spiritualizing them? What do you do with pain that won’t go away? And why is being emotionally willing the ultimate superpower in creating the life you truly want? Rooted in the Self-Coaching Model (CTFAR), this episode teaches you how to allow emotion without being consumed by it—and how to stop letting your feelings quietly run the show from the background. In This Episode, You’ll Learn: Why feeling your feelings is the key to long-term change How emotional resistance drains your energy and keeps you stuck What it really means to \u0022allow\u0022 an emotion (and what it doesn\u0027t) How spiritualizing pain can block healing What to do with emotions that seem to never go away Why discomfort is the price of living authentically—and why it’s worth it Get the Sunday Muse email Subscribe on YouTube: @mormontomuse1 Follow Kristin on Instagram: @mormontomuse #FeelYourFeelings #PostMormonHealing #SelfCoachingModel #TherapeuticArt #EmotionalWillingness #FaithTransition #CreativeHealing #MormonToMuse #ReligiousDeconstruction #EmotionalResilience While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-08-09T23:00:00Z",
      "duration": "00:24:31.7040000",
      "explicit": false,
      "spotifyId": "1tvqBvgkVmpfyrV5PxbwBg",
      "appleId": 1000721329455,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1tvqBvgkVmpfyrV5PxbwBg",
        "apple": "https://podcasts.apple.com/podcast/pain-power-and-the-art-of-allowing-emotion-episode-12/id1817729811?i=1000721329455"
      }
    },
    {
      "id": "26a782e7-5eca-4853-913f-28a3beeae608",
      "title": "Why You are Emotionally Stunted - Episode 11",
      "description": "Episode 11: Why You Are Emotionally Stunted \n\nIn this episode, I explore how emotional suppression—especially in high-demand systems like Mormonism and American culture—leaves many of us emotionally stunted, disconnected from ourselves, and stuck in cycles we don’t understand.\n\nWe revisit the Self-Coaching Model (CTFAR) and focus on the often-overlooked middle step: feelings. You’ll learn why feelings matter, how they drive everything we do (or don’t do), and what goes wrong when we resist, react to, avoid, or spiritualize our emotions.\n\nThis is part one of a two-part series that will help you build emotional literacy, reclaim emotional agency, and get back in the driver’s seat of your own life.\n\nWhat We Cover: Why feelings—not circumstances—create your experience\n\nHow American culture and Mormonism both discourage emotional honesty\n\nWhat happens when you resist, react to, or avoid your feelings\n\nThe spiritualization of emotion in high-demand religion Why reclaiming your full emotional range is essential to healing\n\nCLICK HERE to sign up for Sunday Muse. You\u0027ll get a weekly email with a free therapeutic art prompt to take this work to a deeper level.  \n\nFind me on Instagram and YouTube\n\nWhile this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with.",
      "release": "2025-08-03T04:00:00Z",
      "duration": "00:23:19",
      "explicit": false,
      "spotifyId": "0rQ55cV68m7HbGdJhZ7oA6",
      "appleId": 1000720460103,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rQ55cV68m7HbGdJhZ7oA6",
        "apple": "https://podcasts.apple.com/podcast/why-you-are-emotionally-stunted-episode-11/id1817729811?i=1000720460103"
      }
    },
    {
      "id": "d6c0e1a1-b6f8-4331-b754-76179782dcfd",
      "title": "Why You Aren\u0027t Making Progress (And What To Do About It) - Episode 10",
      "description": "You’re trying. You’re doing the things. So why do you still feel stuck? In this episode of Mormon to Muse, we unpack three hidden reasons you might not be making progress—and how the Self-Coaching Model can help you shift your mindset and create real change. Whether you\u0027re trying to heal after leaving Mormonism or simply reinvent your life in midlife, this episode will show you how to stop spinning your wheels and start moving forward with clarity and intention. What We Cover: Why trying to change your circumstances isn’t enough The mistake of taking action without shifting your thoughts and feelings first What it means when you don’t actually believe the thought you’re trying to practice How to use the Self-Coaching Model (C, T, F, A, R) to diagnose and solve your stuck points Why healing and growth require internal shifts, not just external effort Want the Related Therapeutic Art Prompt? Sunday Muse email: \u0026#x1f449; Join here Follow Kristin on Instagram: @mormontomuse #PostMormonHealing #LifeAfterMormonism #TherapeuticArt #SelfCoachingModel #EmotionalHealing #FaithTransition #ExMormon #CreativeHealing #MormonToMuse #MindsetShift While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with.",
      "release": "2025-07-27T11:00:00Z",
      "duration": "00:19:45",
      "explicit": false,
      "spotifyId": "4EUoDlPttArTt0P0YmnIaZ",
      "appleId": 1000719362387,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EUoDlPttArTt0P0YmnIaZ",
        "apple": "https://podcasts.apple.com/podcast/why-you-arent-making-progress-and-what-to-do-about-it/id1817729811?i=1000719362387"
      }
    },
    {
      "id": "d7566762-97ac-42ba-ac58-c9b15c570306",
      "title": "Self Discovery Part 2",
      "description": "In Episode 8 of Mormon to Muse, we explore the essential steps to self-discovery for women navigating life after Mormonism. Leaving a high-demand religion can leave you feeling lost or disconnected from your true self. This episode is your roadmap to reconnecting with your values, desires, and authentic identity. We’ll walk through 8 clear, practical steps to help you: Get curious about who you really are Recognize old patterns and beliefs Clarify what matters most to you now Take small, courageous steps toward reinvention Whether you’re newly out of the church or years into your journey, these steps will help you move from confusion to clarity. Key Topics Covered: What self-discovery really means after religious deconstruction The difference between self-discovery and “creating a new self” 8 actionable steps for reconnecting with yourself How to deal with fear, doubt, and feeling “lost” Why Listen: If you’ve ever asked yourself, “Who am I without Mormonism?”—this episode will give you permission, tools, and hope to start answering that question. Mormon to Muse Connect with Me Instagram: @mormontomuse Website \u0026 Email List: Sunday Muse Sign-up steps to self-discovery, self-discovery after Mormonism, ex-Mormon healing, faith deconstruction, reclaiming your identity, post-Mormon podcast, therapeutic art for healing, spiritual trauma recovery, creative self-discovery. While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with #SelfDiscovery #FaithDeconstruction #ExMormon #PostMormonHealing #SpiritualTrauma #TherapeuticArt #MormonToMuse #WomenEmpowerment #RebuildYourLife",
      "release": "2025-07-13T11:00:00Z",
      "duration": "00:27:15.2160000",
      "explicit": false,
      "spotifyId": "0FXBxGZy2IW8YTgi2WAJPf",
      "appleId": 1000717038662,
      "youTubeId": "7WV6OjTBsJo",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0FXBxGZy2IW8YTgi2WAJPf",
        "apple": "https://podcasts.apple.com/podcast/self-discovery-part-2/id1817729811?i=1000717038662",
        "youtube": "https://www.youtube.com/watch?v=7WV6OjTBsJo"
      }
    },
    {
      "id": "12ca902c-e39b-4eb0-9976-5cfc33a9f1d3",
      "title": "Episode 7 - Self Discovery Part 1",
      "description": "Welcome to Mormon to Muse, the podcast for post-Mormon women ready to heal, reconnect with themselves, and create a life that feels truly their own. In Episode 7, we’re exploring barriers to self-discovery—the hidden obstacles that can keep you stuck, disconnected, and unsure of who you really are. Leaving Mormonism (or any high-demand religion) can feel like stepping into the unknown. Even after you reject old beliefs, you might find yourself repeating old patterns or struggling to know what you really want. Today we’ll look at why that happens—and what you can do about it. In this episode, you\u0027ll learn: The most common barriers to self-discovery for post-Mormon women (including fear, people-pleasing, and black-and-white thinking) Why high-control systems discourage self-exploration How to recognize when you’re avoiding your own desires, feelings, or needs Fear of disappointing others often keeps us small. You deserve permission to change your mind and redefine your life on your own terms. Related Episodes Episode 1: My Story – Leaving Mormonism and Finding Healing Through Art Episode 6: Waking Up to Control – The BITE Model Connect with Mormon to Muse If you’re ready to go deeper into healing after Mormonism, subscribe to the Sunday Muse newsletter for weekly therapeutic art prompts and reflections. SIGN UP FOR SUNDAY MUSE Follow along for more: YouTube: Mormon to Muse Instagram: @mormontomuse Apple Podcasts: Mormon to Muse While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with.",
      "release": "2025-07-06T11:00:00Z",
      "duration": "00:21:00.4310000",
      "explicit": false,
      "spotifyId": "7d59LJg8QdVyzCcnyp7p0a",
      "appleId": 1000715967802,
      "youTubeId": "sbGkep-NaD8",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7d59LJg8QdVyzCcnyp7p0a",
        "apple": "https://podcasts.apple.com/podcast/episode-7-self-discovery-part-1/id1817729811?i=1000715967802",
        "youtube": "https://www.youtube.com/watch?v=sbGkep-NaD8"
      }
    },
    {
      "id": "7db09ea6-25a7-44bb-9589-b751fbbd2fee",
      "title": "Waking up to Control - Episode 6",
      "description": "Leaving Mormonism—or any high-demand religion—often means realizing that what felt “normal” was actually coercive control. In this episode of Mormon to Muse, we’re talking about waking up to those dynamics using Stephen Hassan’s BITE Model as our guide. The BITE Model is a framework for identifying authoritarian control in cults and high-control groups. It breaks manipulation into four clear categories: Behavior Control Information Control Thought Control Emotional Control By examining each piece, you can start to recognize the systems you were part of—not as personal failure, but as designed to keep you compliant. This conversation is for you if: You’re deconstructing Mormonism or any rigid belief system You want to understand why leaving feels so hard You’re working to rebuild self-trust and personal authority You suspect the group you left might have used coercive or manipulative tactics In this episode, we cover: What the BITE Model is and why it’s so helpful for ex-Mormons How Mormonism exerts control over behavior (dress codes, obedience culture, time demands) How information is tightly managed (approved sources, anti-Mormon labeling, correlated curriculum) How thought control shows up (thought-stopping, black-and-white thinking, prophetic authority) How emotional control keeps people in line (fear, guilt, shame, love-bombing) Signs you’re waking up to these forms of control in your own life Why naming these patterns is a key step in reclaiming your freedom Get the Sunday Muse Email: Want weekly art prompts and reflections to help you heal after high-demand religion? Sign up here: https://www.mormontomuse.com/sunday-muse-opt-in-86fbfcf3-573a-4a4c-978f-07f128d08264 You can find me on YouTube: https://www.youtube.com/@mormontomuse1 Follow on Instagram: https://www.instagram.com/mormontomuse/ Steven Hassan website and more information about he BITE model: https://freedomofmind.com/",
      "release": "2025-06-29T11:00:00Z",
      "duration": "00:28:06.0960000",
      "explicit": false,
      "spotifyId": "1zyH19hz1wBqikS6dfbafr",
      "appleId": 1000715002863,
      "youTubeId": "GpThoLHjffs",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zyH19hz1wBqikS6dfbafr",
        "apple": "https://podcasts.apple.com/podcast/waking-up-to-control-episode-6/id1817729811?i=1000715002863",
        "youtube": "https://www.youtube.com/watch?v=GpThoLHjffs"
      }
    },
    {
      "id": "9b1e777a-1c2e-4463-b47b-fc7a8f8714bb",
      "title": "How to Know the Truth - Episode 5",
      "description": "When you leave a high-demand religion like Mormonism, one of the biggest challenges isn’t just rethinking your beliefs—it’s learning how to think again without relying on external authority. In this episode of Mormon to Muse, I share a four-part framework that’s helped me rebuild critical thinking as a spiritual and creative practice: Logos (logic), Ethos (credibility), Pathos (emotion), and Duos (paradox). We’ll explore how each of these shows up in everyday decisions—and in your art. Because the truth is, how you approach a blank canvas often mirrors how you approach your own inner life. In this episode, you’ll learn: What each of the four modes means and how they work together How high-demand religion often distorts or suppresses these ways of thinking Why Duos—the ability to hold two truths at once—is especially vital for post-Mormons How you can apply each part of this framework not just to life, but to your creative process We’ll also discuss how: Logos shows up as structure, planning, and composition in your artwork Ethos guides your authentic voice and creative integrity Pathos emerges through color, emotion, and intuitive expression Duos invites you to hold tension in your art without needing to resolve it Want to go deeper? This episode is paired with a therapeutic art prompt called “The Four Voices Within”—available now in this week’s Sunday Muse email. Sign up here to get it: https://www.mormontomuse.com/monday-muse-opt-in-86fbfcf3-573a-4a4c-978f-07f128d08264 Let’s connect: YouTube (painting \u0026#43; podcast visuals): https://www.youtube.com/@mormontomuse1 Instagram https://www.instagram.com/mormontomuse Listen on Apple Podcasts: https://podcasts.apple.com/us/podcast/mormon-to-muse/id1817729811 While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with. #criticalthinking #exmormon #deconstruction #mormontomuse #faithtransition #therapeuticart #artheals #creativehealing #postmormon #logosethospathosduos #religioustrauma #artastherapy #lifecoachingforwomen",
      "release": "2025-06-22T11:00:00Z",
      "duration": "00:35:15.9830000",
      "explicit": false,
      "spotifyId": "1joY6fcbXIpiagpHpolQ9S",
      "appleId": 1000714041743,
      "youTubeId": "IvGyk-PXKy4",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1joY6fcbXIpiagpHpolQ9S",
        "apple": "https://podcasts.apple.com/podcast/how-to-know-the-truth-episode-5/id1817729811?i=1000714041743",
        "youtube": "https://www.youtube.com/watch?v=IvGyk-PXKy4"
      }
    },
    {
      "id": "bb163d76-481f-4e2a-af2c-b7ff2dc11404",
      "title": "9 Questions to ask yourself after leaving Mormonism - Episode 4",
      "description": "Episode 4: 9 Questions to Ask Yourself After Leaving Mormonism Mormon to Muse Podcast with Kristin Martineau Leaving Mormonism often means leaving behind a decision-making framework that relied on external authority—leaders, scriptures, promptings, and rules. But what happens when that structure is gone? How do you learn to trust yourself again? In this episode, I share 9 powerful questions that can help you rebuild self-trust and make confident, authentic decisions on your own terms. These questions are designed to reconnect you with your inner wisdom, clarify your values, and support your growth as a whole, autonomous person. Whether you\u0027re navigating relationships, career choices, parenting, or spirituality, these questions offer a grounded way to make aligned decisions—without guilt or fear. \u0026#x1f3a8; Want to go deeper? This episode is paired with Therapeutic Art Prompt #4, which guides you in visually exploring your decision-making process. \u0026#x1f4e9; Get the free printable prompt \u0026#43; join the Sunday Muse email: https://www.mormontomuse.com/monday-muse-opt-in-86fbfcf3-573a-4a4c-978f-07f128d08264 Follow me on Instagram for more creative healing tools: https://www.instagram.com/mormontomuse/ #exmormon #faithtransition #deconstruction #rebuildingtrust #selftrust #decisionmaking #mormontomuse #religioustrauma #therapeuticart #postmormon #healingjourney #creativehealing #lifecoachforwomen While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-06-15T06:00:00Z",
      "duration": "00:25:39.7200000",
      "explicit": false,
      "spotifyId": "0kMobXQCGqEjnQunXr2qvk",
      "appleId": 1000712934244,
      "youTubeId": "BEi25J9yQj4",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0kMobXQCGqEjnQunXr2qvk",
        "apple": "https://podcasts.apple.com/podcast/9-questions-to-ask-yourself-after-leaving-mormonism/id1817729811?i=1000712934244",
        "youtube": "https://www.youtube.com/watch?v=BEi25J9yQj4"
      }
    },
    {
      "id": "24cc0b15-6074-472f-92f0-834450eb151d",
      "title": "There\u0027s Nothing Wrong with You - Understanding the Stages of Faith - Episode 2",
      "description": "Sign up for Mormon to Muse - I\u0027ll send a therapeutic art activity right to your inbox for free every week. It\u0027s an easy way to get started on your creative healing journey. Episode Title: Navigating Fowler’s Stages of Faith in a Mormon Faith Crisis Episode Summary: In this episode of Mormon to Muse, we’ll explore James Fowler’s Stages of Faith Development and how they apply to the unique journey of a Mormon faith crisis. Whether you’re questioning your beliefs, leaving the LDS Church, or rebuilding your spirituality outside of Mormonism, understanding these faith stages can bring clarity, validation, and hope. I’ll breaks down each stage in relatable, down-to-earth language and share insights on how these stages show up in the experience of former Mormons. If you’ve ever wondered why faith deconstruction feels like starting over, or why it’s so hard to talk about your evolving beliefs with faithful family and friends, this episode is for you. What You’ll Learn in This Episode: An overview of Fowler’s 6 Stages of Faith Development How each stage relates to the Mormon faith journey Why a faith crisis is actually a sign of spiritual growth The challenges of moving beyond Stage 3 (Synthetic-Conventional Faith) in a high-demand religion Key Topics Covered: Mormon faith crisis Fowler’s stages of faith explained Leaving the LDS Church Faith deconstruction and reconstruction Stages of spiritual development Post-Mormon healing Religious trauma and faith transition Creative expression for healing Identity after Mormonism Stages of Faith - James Fowler Navigating Mormon Faith Crisis - Thomas McConkie The Sin of Certainty - Peter Enns Falling Upward - Richard Rohr While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-06-03T21:00:00Z",
      "duration": "00:24:16.2960000",
      "explicit": false,
      "spotifyId": "1yaSkQxDe6rbfX9X8M3DxS",
      "appleId": 1000711073597,
      "youTubeId": "lS5IHJwsYBE",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1yaSkQxDe6rbfX9X8M3DxS",
        "apple": "https://podcasts.apple.com/podcast/theres-nothing-wrong-with-you-understanding-the/id1817729811?i=1000711073597",
        "youtube": "https://www.youtube.com/watch?v=lS5IHJwsYBE"
      }
    },
    {
      "id": "b6b50aa4-a3db-4db6-ac8d-1e9951865be3",
      "title": "Mormon to Muse - My Story of Creative Healing - Episode 1",
      "description": "In this very first episode, I’m sharing a piece of my own story — how I navigated a painful faith transition and how art became a lifeline through the uncertainty, grief, and rebuilding that followed. Leaving the belief system I was raised in wasn’t just about walking away; it was about losing a whole framework for identity, community, and meaning. It was disorienting, heartbreaking... and ultimately, freeing. Through creativity — starting with simple watercolor paintings — I found a way to process emotions that words couldn’t touch. Art helped me reclaim my voice, rebuild my sense of self, and reconnect with a deeper, wiser part of me that religion had silenced. In this episode, you\u0027ll hear: A little about my upbringing and faith journey The unexpected role creativity played in my healing Why making art (even imperfectly) is such a powerful tool for navigating transition. What you can expect from this podcast going forward Whether you\u0027re deep in your own deconstruction or just starting to ask questions, I hope this story reminds you that healing isn’t linear — but it is possible. Thanks for being here. I’m so glad we’re doing this together. Sign up for Monday Muse to get a free creative healing exercise sent to your inbox every week. You can find me on instagram at Mormon to Muse and on YouTube While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-06-03T21:00:00Z",
      "duration": "00:25:24.6400000",
      "explicit": false,
      "spotifyId": "5j8zrIC7vcfqqqChp5Ueq4",
      "appleId": 1000711073822,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5j8zrIC7vcfqqqChp5Ueq4",
        "apple": "https://podcasts.apple.com/podcast/mormon-to-muse-my-story-of-creative-healing-episode-1/id1817729811?i=1000711073822"
      }
    },
    {
      "id": "da4e003b-6fca-4ec3-851c-cbd4a03020f6",
      "title": "Arrested Development - Episode 3",
      "description": "Arrested Development — 5 Ways Post-Mormons Are Like Teenagers Podcast: Mormon to Muse with Kristin Martineau Leaving Mormonism can feel like waking up in your own teenage rebellion—only this time, you\u0027re an adult. In this episode, I break down five ways post-Mormons are like teenagers and explore why emotional, spiritual, and developmental growth often gets paused in high-demand religions. We’ll talk about: Why leaving Mormonism often triggers a “second adolescence” The impact of obedience culture on emotional maturity How to reclaim autonomy, self-trust, and critical thinking The role of art and creativity in reparenting yourself How to move from stunted to sovereign If you’ve ever wondered why you feel like you\u0027re just now figuring out who you are—this one\u0027s for you. Subscribe, rate, and share with someone who’s healing after high-demand religion. Want the therapeutic art activity that goes with this episode? [Join the email list here.] While this isn’t art therapy, and I’m not a licensed therapist, these creative exercises have been powerful tools for healing in my own life and in the lives of women I work with",
      "release": "2025-06-03T21:00:00Z",
      "duration": "00:23:43.8230000",
      "explicit": false,
      "spotifyId": "6YqG8U2YtmoigbHO4M5kmI",
      "appleId": 1000711073878,
      "youTubeId": "LFSTfPKB5W0",
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YqG8U2YtmoigbHO4M5kmI",
        "apple": "https://podcasts.apple.com/podcast/arrested-development-episode-3/id1817729811?i=1000711073878",
        "youtube": "https://www.youtube.com/watch?v=LFSTfPKB5W0"
      }
    }
  ]
}