{
  "id": "c9a0b9eb-a502-421e-852f-f60d2a96c547",
  "name": "Motech",
  "youTubeChannelId": "UCiE2TNZpB649Ii15EU9Mj4A",
  "episodes": [
    {
      "id": "9e7461d2-ffda-462a-8104-6f2fbbc42bd6",
      "title": "The Deadly Cult That Worked For The CIA",
      "description": "February 4, 1987. It’s a chilly Wednesday morning over in Tallahassee, Florida. Right in front of Myers Park, a blue van pulls up. And out of it disembark two gentlemen in their mid-twenties with six kids aged 2 to 11 in tow.\n\nThe men look clean, neatly groomed, and well-dressed in their suits and ties. The kids, on the other hand, look dirty, unkempt, and seriously malnourished.\n\nThe odd-looking group immediately draws attention and suspicion. So someone calls the police, who immediately arrive and begin to question the suspects.\n\nThe men give their names as Douglas Ammerman and Michael Holwell. And they say that they are taking the children to Mexico to wean them from their mothers and start up a school for gifted children. \n\nThe looks of the kids, however, tell a completely different story. \nBesides their scruffiness, the kids do not appear to be aware of basic living amenities and modern technology, including electricity, phones, hot water, or even toilets.\n\nMore worryingly, none of the kids had underwear on, which raises suspicions of sexual abuse. Curiously, when police try to question the oldest kid about it, she gets fidgety and shuts down the interview.\n\nTwo days later, police find out that the men and children belong to a satanist, child-trafficking cult known as the Finders. A raid of the group’s property in Washington DC, reveals damning evidence of child pornography, international child trafficking, and blood rituals involving children.\n\nAs the public awaits a trial and conviction, they are shocked to find that the men are released barely one week after their arrest. Not only that, the children are also released right back to the Finders cult. \n\nPolice explain that it’s all a big misunderstanding and that the Finders are just a bunch of hippies, not devil-worshiping child molesters.\nThe truth, however, is much more sinister. \n\nResearch Links:\n\nhttps://theconsciousresistance.com/thefinders/ \nhttps://www.mail-archive.com/ctrl@listserv.aol.com/msg00344.html (Marion Pettie interview)\nhttps://www.tallahassee.com/story/news/local/state/2019/10/29/fbi-vault-the-finders-conspiracy-theories-florida-tallahassee-child-abuse-case-files/2487934001/\nhttps://archive.is/5Beu0 \nhttps://www.newspapers.com/article/tallahassee-democrat/32783274/\nhttps://www.mintpressnews.com/the-finders-cia-ties-child-sex-cult-obscured-media-coverage/277543/\nhttps://www.mintpressnews.com/losing-finders-buried-documents-link-infamous-cult-to-cia/277756/\nhttps://www.mintpressnews.com/finders-cult-us-government-worked-keep-cia-connection-secret/277948/\nhttps://dokumen.pub/qdownload/the-finders-lost-and-found.html\nhttps://washingtoncitypaper.com/article/287890/finders-keeper/\nhttps://archive.is/HsKJq/f489e78e30012deb07ef061e801e0da1b9c65f85.jpg\nhttps://vault.fbi.gov/the-finders/the-finders-part-01-of-04/view \n\nWelcome to Motech, On this Channel we share everything about Technology, Space and Artificial Intelligence. We help you explore cool advancements in Science and Innovation.\n\nConsider subscribing to get a sneak peek of our future world!\nSubscribe - https://bit.ly/3kTvUh6",
      "release": "2025-06-02T14:55:12Z",
      "duration": "00:50:37",
      "explicit": false,
      "youTubeId": "VYd66SySP30",
      "subjects": [
        "The Finders",
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VYd66SySP30"
      }
    }
  ]
}