{
  "id": "bfe3d2b7-125b-4b7c-bec5-5a23c33fc1e5",
  "name": "Motion Mysteries",
  "youTubeChannelId": "UCOzTR4dUcHlYzGsIzTzYNqA",
  "episodes": [
    {
      "id": "6275d833-7f8e-49d8-9477-3fa6a4175c36",
      "title": "Ziz’s Dark Doctrine: How Genius Turned Into Deadly Cult Leader | The Zizians | True crime story",
      "description": "The Shocking True Crime Story of Ziz: How a Genius Became a Deadly Cult Leader\nWhat happens when intellect and ideology collide with violence? This is the real, emotional story of Jack \u0022Ziz\u0022 LaSota, a brilliant mind who spiraled into madness, leading to multiple deaths in a chilling cult-like movement. From a NASA intern to a radical leader whose dangerous beliefs fractured lives, the Zizian doctrine spread devastation across America, leaving a trail of tragedy, betrayal, and unanswered questions.\nIn this voiceover documentary, we dive deep into the life of Jack LaSota—once celebrated for her intellect, now infamous for creating a cult that thrived on psychological manipulation, isolation, and ultimately, violence. Ziz’s followers, vulnerable and isolated, fell prey to a twisted ideology that ultimately led to murders, suicides, and a nationwide manhunt. This real true crime case is based on official court records, media coverage, and interviews with those impacted by the Zizian doctrine.\nThis video is completely original, written for narration, and fact-checked against reliable sources to ensure accuracy and respect for the victims involved. Please like, share, and subscribe for more real, emotional true crime stories. Your comments and thoughts are always welcome!\n#TrueCrime #ZizCult #RealTrueCrimeStory #VoiceoverDocumentary #CultLeader #truecrimedocumentary #crimeinvestigation #documentary  #reallifecrime  #crimestories #crimeinvestigation  #solvedcases #serialkillerdocumentary",
      "release": "2025-07-07T20:00:27Z",
      "duration": "00:27:13",
      "explicit": false,
      "youTubeId": "fCgxaw8_WWo",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=fCgxaw8_WWo"
      }
    }
  ]
}