{
  "_ts": 0,
  "id": "ac6346cc-1ee2-44e5-b23f-7832f4325a41",
  "name": "MoxieTalk with Kirt Jacobs",
  "spotifyId": "1ObcGk2RDsanwMLWcrQOwQ",
  "appleId": 1200680411,
  "episodes": [
    {
      "id": "c0e7e5e3-0a1e-4199-bd8a-6798c2a6ff23",
      "title": "MoxieTalk with Kirt Jacobs #383: Andrew Pledger",
      "description": "In the beginning, long before he was born. His parents were both devout fundamentalist Christians, \u0026 his maternal grandparents raised his Mother Methodist until they converted to fundamentalist Christianity \u0026 his paternal grandmother was a fundamentalist Christian \u0026 his grandpa eventually converted. Andrew’s parents met at Hyles Anderson College in the late 1980s; Hyles Anderson is known for being a strict fundamentalist school. His Father studied to be a pastor \u0026 his mother was going to be an English teacher. They got married in the early 90s \u0026 were excited to have children but had difficulties \u0026 after contemplating adoption, they prayed about it until it finally happened! They had 3 boys \u0026 Andrew was the middle child. They interpreted the birth of their children as a prayer answered \u0026 dedicated their children to the God of Christianity. Homeschooling was popular among fundamentalist Christians because of the separation from the world, outside influences, \u0026 TOTAL control of their children’s lives. Andrew grew up in the Independent Fundamental Baptist movement known as the IFB cult at Gospel Light Baptist Church in Walkertown, NC, pastored by Bobby Robertson until 2018. Robertson was called “America’s Pastor,” \u0026 Gospel Light is one of the larger IFB churches in the U.S. It is known for its extensive bus ministry, bringing in thousands of kids every week. Andrew idolized Robertson \u0026 acted like he was Jesus Christ. The most psychologically damaging was the hateful sermons on the LGBTQ\u0026#43; community because Andrew is openly gay \u0026 growing up gay in fundamentalist Christianity is unacceptable because they are considered “perverts that go around raping people \u0026 hurting children.” Adding to this trauma was being a child sexual assault survivor and keeping this a secret; he felt shame for his assault \u0026 hearing how he deserved nothing good. Loving yourself is difficult when you feel like the closest to you find you unacceptable \u0026 he was extremely hurt that the people who cared for him denied him healthcare. His trust in his parents eroded \u0026 was forever destroyed, \u0026 he read books constantly to expand his mind \u0026 get rid of “black-and-white thinking.” Today, Andrew is an influencer to bring awareness to religious trauma, \u0026 has shared his story on many podcasts; \u0026 as of this filming, he works for 1 of the world’s top cult experts, Rachel Bernstein \u0026 helps her with her social media marketing, for her podcast “IndoctriNation.” Andrew is on a mission to pursue psychology to become a therapist \u0026 eventually, a psychologist by researching religious trauma \u0026 helping present \u0026 future survivors of spiritual abuse!",
      "release": "2023-10-16T00:00:00",
      "duration": "01:43:30.5710000",
      "explicit": false,
      "spotifyId": "5K4qYay1XslXTbL3hlnb3D",
      "appleId": 1000631665773,
      "subjects": [
        "Independent Fundamentalist Baptist",
        "Bob Jones University"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5K4qYay1XslXTbL3hlnb3D",
        "apple": "https://podcasts.apple.com/podcast/andrew-pledger-cult-survivor-coach-content-creator/id1200680411?i=1000631665773"
      }
    }
  ]
}