{
  "id": "189fa6dc-861e-4839-b033-dd94ba1ca8e0",
  "name": "MsMojo",
  "youTubeChannelId": "UC3rLoj87ctEHCcS7BuvIzkQ",
  "episodes": [
    {
      "id": "7dcdafc1-a1e5-4378-b30b-b0e52e9499de",
      "title": "Allison Mack\u0027s NXIVM Cult Podcast: 10 Shocking Reveals",
      "description": "Dive into the dark and unsettling world of NXIVM as Alison Mack opens up on her controversial podcast. We explore the most shocking and revealing moments where she discusses cult secrets, personal struggles, and the intricate manipulation behind the scenes. From uncovering hidden rituals to exposing the psychological tactics employed by leaders, this video uncovers the startling truths that have come to light. Whether you followed the story closely or are discovering it now, get ready for an intense, eye-opening journey into the NXIVM scandal and its lasting impact.\r\n\r\nFOLLOW all our socials for more content here: https://linktr.ee/msmojo\r\n\r\nDon\u0027t forget to play our Live Trivia games at 3pm EST for a chance to win cash! The faster you answer, the more points you get!: https://www.watchmojo.com/play\r\n\r\nMsMojo is a leading producer of reference online video content of Top 10 Lists, Origins, Biographies, Commentary and more on Pop Culture, Celebrity, Movies, Music, TV, Film, Video Games, Politics, News, Comics, Superheroes. Your trusted authority on ranking Pop Culture.\r\n\r\n#NXIVM #AlisonMack #Cult #TrueCrime #Podcast #CultRevelations #MindControl #KeithRaniere #SexCult #Abuse #Scandal #SurvivorStories",
      "release": "2025-11-12T23:00:06Z",
      "duration": "00:10:02",
      "explicit": false,
      "youTubeId": "hBaNoWlguJI",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=hBaNoWlguJI"
      }
    },
    {
      "id": "ba8694de-93c6-457a-8cc0-febe988f2c5e",
      "title": "20 Popular Celebrities Linked to Cults",
      "description": "Even Hollywood\u0027s brightest stars aren\u0027t immune to the allure or dangers of controversial groups. Join us as we delve into the surprising connections between popular figures and organizations widely described as cults. From those born into them to others who joined later in life, these stories shed light on how fame and vulnerability can intersect with intense spiritual or social movements, revealing a darker side to the glittering world of celebrity. Our list explores famous names linked to groups like Children of God, Christian Science, NXIVM, and Scientology. Discover the tales of Joaquin Phoenix, Glenn Close, Allison Mack, Rose McGowan, Michele Pfeiffer, R. Kelly, Dennis Wilson, and the Arquette Family, whose lives were touched by these often-controversial organizations.\r\n\r\nFOLLOW all our socials for more content here: https://linktr.ee/msmojo\r\n\r\nDon\u0027t forget to play our Live Trivia games at 3pm EST for a chance to win cash! The faster you answer, the more points you get!: https://www.watchmojo.com/play\r\n\r\nMsMojo is a leading producer of reference online video content of Top 10 Lists, Origins, Biographies, Commentary and more on Pop Culture, Celebrity, Movies, Music, TV, Film, Video Games, Politics, News, Comics, Superheroes. Your trusted authority on ranking Pop Culture.\r\n\r\n#Cults, #Celebrities, #Hollywood, #Scientology, #JoaquinPhoenix, #RKelly, #RoseMcGowan, #GlennClose, #ValKilmer",
      "release": "2025-10-23T20:00:21Z",
      "duration": "00:21:59",
      "explicit": false,
      "youTubeId": "F8XK5HP3o1I",
      "subjects": [
        "NXIVM",
        "Scientology",
        "Children Of God",
        "Christian Science",
        "Moral Re-Armament",
        "Inedia",
        "Jasmuheen",
        "Manson Family",
        "Odyssey Study Group",
        "The Big House Family",
        "Andrew Keegan",
        "Sean Combs"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F8XK5HP3o1I"
      }
    }
  ]
}