{
  "_ts": 0,
  "id": "ebd4882e-7571-4fc7-976a-29536c24e467",
  "name": "MSNBC",
  "youTubeChannelId": "UCaXkIU1QidjPwiAYu6GcHjg",
  "episodes": [
    {
      "id": "c1710523-76ed-4170-852e-1accf3051efc",
      "title": "Rep. Raskin: It’s ‘disgraceful’ the GOP is being ‘reduced to a cult of authoritarian personality’",
      "description": "Former U.N. Ambassador Nikki Haley dropped out of the Republican primary after winning only Vermont on Super Tuesday. Rep. Jamie Raskin (D-MD) joins Andrea, Ana, and Jose to share his reaction and discuss the presumptive Biden-Trump rematch in November. “My assumption was that, of the Constitution itself, which is that someone who participates in an insurrection against the union should never be allowed to hold office again,” Raskin says. “And it is disgraceful that a great political party, much less Abraham Lincoln\u0027s party, a party of liberty and union, should be reduced to a cult of authoritarian personality in league with autocrats and kleptocrats and dictators all over the world.”\n\n» Subscribe to MSNBC: https://www.youtube.com/msnbc\n \nFollow MSNBC Show Blogs \nMaddowBlog: https://www.msnbc.com/maddowblog\nReidOut Blog: https://www.msnbc.com/reidoutblog\n\nMSNBC delivers breaking news, in-depth analysis of politics headlines, as well as commentary and informed perspectives. Find video clips and segments from The Rachel Maddow Show, Morning Joe, The Beat with Ari Melber, Deadline: White House, The ReidOut, All In, Last Word, 11th Hour, and Alex Wagner who brings her breadth of reporting experience to MSNBC primetime. Watch “Alex Wagner Tonight” Tuesday through Friday at 9pm Eastern. \n \nConnect with MSNBC Online \nVisit msnbc.com: https://www.msnbc.com/\nSubscribe to the MSNBC Daily Newsletter: https://link.msnbc.com/join/5ck/msnbc-daily-signup\nFind MSNBC on Facebook: https://www.facebook.com/msnbc/\nFollow MSNBC on Twitter: https://twitter.com/MSNBC\nFollow MSNBC on Instagram: https://www.instagram.com/msnbc\n\nRep. Raskin: It’s ‘disgraceful’ the GOP is being ‘reduced to a cult of authoritarian personality’\n\n#Trump #GOP #Politics",
      "release": "2024-03-06T18:51:33Z",
      "duration": "00:07:52",
      "explicit": false,
      "youTubeId": "47vct-1jBSs",
      "subjects": [
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=47vct-1jBSs"
      }
    }
  ]
}