{
  "_ts": 0,
  "id": "6e22f11d-04ae-46b2-90e1-8cf70afe93c8",
  "name": "Multispective",
  "spotifyId": "6Ww9d7Hmq6CfdKwN21CC09",
  "appleId": 1604126986,
  "episodes": [
    {
      "id": "73812025-563c-443e-9a31-5948f6d422aa",
      "title": "050 Two Lives: Escaping Jehovah’s Witnesses",
      "description": "In this episode, Stephan Menzel, shares his story of growing up in the restrictive environment of Jehovah’s Witnesses. Stephan discusses the challenges, restrictions, and eventual liberation he experienced after breaking away from the group. He sheds light on the recruitment process and expectations within Jehovah’s Witnesses, offering valuable insights into the tactics used by such groups to attract and retain members. He provides guidance on what to look out for and how to protect oneself from falling prey to cult-like organizations. This episode is a must-listen for those seeking to educate themselves on the signs of manipulation and coercion within closed religious communities. Support the Show. Additionally, you can now also watch the full video version of your favourite episode here on YouTube . Please subscribe, like or drop a comment letting us know your thoughts on the episode and if you\u0027d like more stories going forward! If you would like to offer any feedback on our show or get in touch with us, you can also contact us on the following platforms: Website: www.multispective.org Email: info@multispective.org Instagram: www.instagram.com/multispectiveorg Facebook: www.facebook.com/multispectiveorg Reddit: www.reddit.com/r/multispective Support the show: https://www.patreon.com/multispective Producer \u0026 Host: Jennica Sadhwani Editor and Engineer: Chris Trzcinski Editor, Marketing \u0026 Admin: Stephan Menzel",
      "release": "2024-05-20T11:00:00Z",
      "duration": "00:56:43.5160000",
      "explicit": false,
      "spotifyId": "18vR0T7S2bOVD8aDvaJRHl",
      "appleId": 1000656135798,
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/18vR0T7S2bOVD8aDvaJRHl",
        "apple": "https://podcasts.apple.com/podcast/050-two-lives-escaping-jehovahs-witnesses/id1604126986?i=1000656135798"
      }
    }
  ]
}