{
  "_ts": 0,
  "id": "2cf38f65-36b2-4caa-81e9-88e93367c65b",
  "name": "Murder, She Crocheted.",
  "spotifyId": "68Zi0aVH5EIcEzRHBBvXTI",
  "appleId": 1806977084,
  "youTubeChannelId": "UC6B04n3HDZo9fKjgSR7fOfg",
  "episodes": [
    {
      "id": "b5cdeac5-9d4a-43e2-9904-4bf08d1e9356",
      "title": "Episode 4: The Speedo, the Guru, and the abuse: The Buddhafield Cult",
      "description": "Imagine a cult leader who wears nothing but a Speedo, sunglasses, and a disturbing amount of control over hundreds of followers. That’s not fiction—it’s the real-life story of Jaime Gomez, also known as “Michel,” the manipulative guru at the center of the Buddhafield Cult.\n\nIn this episode, we slip into the bizarre and disturbing world of the Buddhafield—where promises of spiritual enlightenment masked decades of psychological abuse, manipulation, and trauma. Fueled by control, vanity, and fear, this cult thrived for over 20 years before its secrets unraveled through the lens of one insider’s camera. We’ll explore the rise, the followers, the breakdown, and the haunting impact that still lingers for those who lived it.\n\n\n\nCrochet pattern for the Tumbler sleeve can be found here: https://docs.google.com/document/d/17KS9anpy2iSQedNQo24Tq4fxiW_P1mrXgR8Q-Dz9Vaw/edit?usp=drive_link\n\n\n👻 Next week, we’ll dive into another case—and, as always, I’ll have a free crochet pattern to go with it. Don’t forget to follow Murder She Crocheted on Instagram, TikTok, and Facebook @MurderSheCrocheted. On Twitter, we’re @MSCPod. Check out our Pinterest boards to find the free patterns featured in each episode—and other fun, inspiring crochet projects. Got a case suggestion? A listener story? Pattern ideas? Send them to me at murdershecrocheted@gmail.com. And don’t forget to tag me in your crochet projects. I can’t wait to see what you create! Until the next twisted tale—stay crafty, stay creepy. 🖤",
      "release": "2025-05-12T05:00:32Z",
      "duration": "00:43:09",
      "explicit": false,
      "spotifyId": "4lMkduuzWnfQIStseArOaN",
      "appleId": 1000708057490,
      "youTubeId": "MZCIVI1DGRQ",
      "subjects": [
        "Buddhafield"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4lMkduuzWnfQIStseArOaN",
        "apple": "https://podcasts.apple.com/podcast/episode-4-the-speedo-the-guru-and/id1806977084?i=1000708057490",
        "youtube": "https://www.youtube.com/watch?v=MZCIVI1DGRQ"
      }
    }
  ]
}