{
  "id": "03a908e7-ec6d-4681-939e-6d1f5aea2c97",
  "name": "Murders \u0026 Minivans",
  "spotifyId": "4QjOPI6yt8boVPnmBcRBNO",
  "appleId": 1835522303,
  "episodes": [
    {
      "id": "d967691b-14a4-49ac-b698-2b8aba50c517",
      "title": "Lori Vallow and the Lies of Light and Darkness",
      "description": "When two children vanish, their mother insists they’re safe; but months later, they’re found buried in the backyard of her new husband, a man who writes doomsday prophecies. In this episode, we unpack the chilling story of Lori Vallow Daybell the so-called “Cult Mom” who believed she was chosen by God to lead 144,000 survivors into the end times. From a picture-perfect suburban life to murder charges, secret beliefs, and a trail of suspicious deaths, this case isn’t just about faith gone wrong; it’s about control, delusion, and the cost of blind devotion. Join Tali and Stephanie as we break down the timeline, the twisted ideology, and the haunting final moments of JJ, Tylee \u0026 Charles Dateline NBC — “The Doomsday Files: The Lori Vallow Story” (NBC News, 2020–2023) East Idaho News coverage archives (Nate Eaton reporting, 2019–2024) CourtTV Trial Archives – State of Idaho v. Lori Vallow Daybell, 2023 Netflix — Sins of Our Mother (2022) The Idaho Statesman — timeline of Lori Vallow Daybell case ABC News / 20/20 — “The Followers: Madness of Two” Fox10 Phoenix local coverage – Justin Lum reporting Arizona Republic archives on the deaths of Charles Vallow \u0026 Joseph Ryan Law \u0026 Crime Network — trial testimony summaries and sentencing coverage People Magazine — “Inside Lori Vallow’s Doomsday Cult Beliefs” (2021) Kauai Police Department press releases, February 2020 Maricopa County Court Records — Vallow divorce and custody filings (public access)",
      "release": "2025-12-08T07:05:19Z",
      "duration": "00:55:33.3290000",
      "explicit": true,
      "spotifyId": "2yQNxwgRaIePPCVvhEV9YT",
      "appleId": 1000740178283,
      "subjects": [
        "Chad Daybell"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2yQNxwgRaIePPCVvhEV9YT",
        "apple": "https://podcasts.apple.com/podcast/lori-vallow-and-the-lies-of-light-and-darkness/id1835522303?i=1000740178283"
      }
    }
  ]
}