{
  "_ts": 0,
  "id": "0923d6e8-c7f5-487f-afb0-da54d872cadd",
  "name": "Murder In The Morning | Daily True Crime News",
  "spotifyId": "5NyUzRmHmFkRDFmPyWNKvN",
  "appleId": 1738141279,
  "episodes": [
    {
      "id": "579b049c-765a-4e98-80ca-adc99fa1aef1",
      "title": "Sean \u0022Diddy\u0022 Combs Under Federal Investigation for Sex-Trafficking Allegations",
      "description": "Sean \u0022Diddy\u0022 Combs has engaged high-profile attorney Marc Agnifilo as a federal grand jury in Manhattan intensifies its months-long investigation into sex-trafficking allegations involving multiple accusers, as reported by Business Insider. Agnifilo, a seasoned criminal attorney known for representing notorious clients such as Martin Shkreli and NXIVM cult leader Keith Raniere, confirmed that the investigation was initially triggered by allegations from R\u0026B singer Cassie Ventura, Combs\u0027 former girlfriend. Ventura\u0027s lawsuit, which alleged that Combs coerced her into a \u0022drug-fueled lifestyle\u0022 and forced her to engage in sex acts with male prostitutes, settled just one day after it was filed last November. Agnifilo explained, \u0022When Ventura\u0027s bombshell lawsuit settled so quickly, additional accusers came out of the woodwork,\u0022 resulting in a sprawling investigation by prosecutors for the Southern District of New York. Federal authorities have executed searches of Combs\u0027 residences in Los Angeles and Miami, seizing phones and computers in March as part of the ongoing probe. Despite the intensifying investigation, Agnifilo remains optimistic about the outcome. \u0022We are firmly convinced that he did not violate any federal laws, and we hope we can work with prosecutors in reaching that conclusion,\u0022 he stated. The legal troubles for Combs have been mounting, with the Manhattan grand jury probe being the latest in a series of serious allegations. In May, CNN released a 2016 video showing Combs shoving, dragging, and kicking Ventura at a Los Angeles hotel. The video supported the claims of violence in Ventura\u0027s lawsuit, which Combs described as \u0022inexcusable.\u0022 \u0022I\u0027m disgusted,\u0022 Combs said in an apology following the video\u0027s release. In addition to Ventura\u0027s claims, Combs is battling nine sex-assault lawsuits since November, the most recent filed by porn star Adria English in federal court in New York. English accuses Combs of sexual assault and harassment, alleging that he demanded she engage in sex with guests at his high-profile \u0022white parties\u0022 from 2004 to 2009, charges which Combs denies. Agnifilo emphasized the Southern District\u0027s careful approach, noting, \u0022I think that the Southern District is appropriately taking its time and considering many different factors.\u0022 He also highlighted that Combs has not yet spoken with prosecutors and that his legal team is in regular communication with them. The high stakes of the investigation are evident as Combs\u0027 public appearances, including boarding his private jet and white-water rafting in Wyoming, have drawn criticism. Mitchell-Kidd, Ventura\u0027s attorney, commented, \u0022It feels like Diddy is checking off some bucket list items because he knows the walls are closing in and the indictment is waiting in the wings.\u0022 Combs\u0027 legal history in New York dates back more than 20 years when he faced a high-profile trial for gun and bribery charges after a nightclub shootout. Represented then by Benjamin Brafman, Combs was acquitted after a six-week trial. Brafman, who also represented Combs in the lead-up to Ventura\u0027s lawsuit, declined to comment on Combs\u0027 switch to Agnifilo, who was senior trial counsel at Brafman \u0026 Associates before the two parted ways in March. Want to listen to ALL of our podcasts AD-FREE? Subscribe through APPLE PODCASTS, and try it for three days free: https://tinyurl.com/ycw626tj Follow Our Other Cases: https://www.truecrimetodaypod.com The latest on The Downfall of Diddy, The Karen Read Trial, Catching the Long Island Serial Killer, Awaiting Admission: BTK’s Unconfessed Crimes, Delphi Murders: Inside the Crime, Chad \u0026 Lori Daybell, The Murder of Ana Walshe, Alex Murdaugh, Bryan Kohberger, Lucy Letby, Kouri Richins, Malevolent Mormon Mommys, Justice for Harmony Montgomery, The Murder of Stephen Smith, The Murder of Madeline Kingsbury, and much more! Listen at https://www.truecrimetodaypod.com",
      "release": "2024-07-12T11:00:00Z",
      "duration": "00:12:28.7030000",
      "explicit": false,
      "spotifyId": "38HYrM5Pqhg59XeIuekm8o",
      "appleId": 1000662016994,
      "subjects": [
        "Human Trafficking",
        "Sean Combs"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/38HYrM5Pqhg59XeIuekm8o",
        "apple": "https://podcasts.apple.com/podcast/sean-diddy-combs-under-federal-investigation-for-sex/id1738141279?i=1000662016994"
      }
    }
  ]
}