{
  "id": "951b4467-b389-44b5-a833-81b271681c3d",
  "name": "Murder Sheet",
  "spotifyId": "5lCbTxX7QAJUgVewVKmApA",
  "appleId": 1538289354,
  "episodes": [
    {
      "id": "1f7f7a4f-97d0-4aa7-a04a-fae90f39d2f4",
      "title": "The Delphi Murders: Baldwin\u0027s Complaint Part Three: Prosecutor Nicholas McLeland Responds",
      "description": "On February 13, 2017, a man named Richard Allen murdered two girls, 14-year-old Liberty German and 13-year-old Abigail Williams in Delphi, in Carroll County. Carroll County Prosecutor Nicholas McLeland and his team, Stacey Diener and James Luttrull, prosecuted him. Allen’s defense team consisted of lead counsel Brad Rozzi, Jennifer Auger, and Andrew Baldwin. That defense team established a consistent pattern of engaging in baseless personal attacks on prosecutors and detectives throughout their representation, and also put forward a flimsy theory of the case centering an alleged Norse pagan cult. Allen was convicted on November 11, 2024 by a jury of his peers. The Murder Sheet can now exclusively report that Baldwin filed a ridiculous complaint against McLeland this past summer with Indiana’s Disciplinary Commission, a body tasked with disciplinary complaints against lawyers. Baldwin\u0027s complaint was dismissed on its face. Now McLeland will weigh in on the whole situation. Find discounts for Murder Sheet listeners here: https://murdersheetpodcast.com/discounts Check out our upcoming book events and get links to buy tickets here: https://murdersheetpodcast.com/events Order our book on Delphi here: https://bookshop.org/p/books/shadow-of-the-bridge-the-delphi-murders-and-the-dark-side-of-the-american-heartland-aine-cain/21866881?ean=9781639369232 Or here: https://www.simonandschuster.com/books/Shadow-of-the-Bridge/Aine-Cain/9781639369232 Or here: https://www.amazon.com/Shadow-Bridge-Murders-American-Heartland/dp/1639369236 Join our Patreon here! https://www.patreon.com/c/murdersheet Support The Murder Sheet by buying a t-shirt here: https://www.murdersheetshop.com/ Check out more inclusive sizing and t-shirt and merchandising options here: https://themurdersheet.dashery.com/ Send tips to murdersheet@gmail.com . The Murder Sheet is a production of Mystery Sheet LLC. See Privacy Policy at https://art19.com/privacy and California Privacy Notice at https://art19.com/privacy#do-not-sell-my-info .",
      "release": "2025-12-03T22:00:00Z",
      "duration": "00:45:48.3950000",
      "explicit": false,
      "spotifyId": "4VBQDG69CXN3Cw9oxHt1Qe",
      "appleId": 1000739586877,
      "subjects": [
        "Richard Allen"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VBQDG69CXN3Cw9oxHt1Qe",
        "apple": "https://podcasts.apple.com/podcast/the-delphi-murders-baldwins-complaint-part-one/id1538289354?i=1000739586877"
      }
    }
  ]
}