{
  "id": "f458482f-70f5-4c2c-a3d9-4d75e7e89995",
  "name": "MUSE TV Network",
  "youTubeChannelId": "UC-pEu21rsX7rL3u9zTAKJOw",
  "episodes": [
    {
      "id": "d1c16117-249e-4d0b-9111-636dd77d4d3c",
      "title": "Jackie Speier on Escaping Jonestown in Nat Geo\u0027s Cult Massacre",
      "description": "NEWS x MUSE Michael Sandoval talks with former US Representative from California\u0027s 14th District. Jackie Speier as we talk about her experience and tragedy of Jonestown in the documentary series National Geographic Cult Massacre: One Day in Jonestown. In addition we bring the similarities of Jim Jones Peoples Temple and what is going on in America today. \n\nIn this consveration we also talk about her experience on January 6, 2021 as she was in the House Chamber during the insurrection attack on the Capitol of the United States. \n\nJackie Speier was a congressional aide to Rep. Leo Ryan. In 1978, as part of the preparation for Rep. Ryan’s expedition to Guyana, Speier heard stories about abuse taking place behind closed doors within Peoples Temple. Though concerned, she thought joining the congressman on the trip was important for her career.\n\nAfter long negotiations with Jones’ representatives, the group finally entered the camp. Speier got to work speaking to the community. She noticed that the responses were unnervingly similar, as though scripted. But the following day, people came forward asking to leave, and Speier began recording affidavits of those wanting to return to the U.S.\n\nHaving helped the defectors prepare to leave, Speier and the group traveled to the Port Kaituma airstrip, where she witnessed the murder of Rep. Ryan. She was shot five times and very nearly lost her own life. Speier finally evacuated 22 hours after the shooting.\n\nSpeier’s story came full circle 30 years after the tragedy, as the former legal aide was elected to Rep. Ryan’s old seat.\n\nWatch Cult Massacre: One Day in Jonestown on Hulu June 17. Learn more by visiting the link https://www.hulu.com/series/cult-massacre-one-day-in-jonestown-8acd6989-8323-4b09-b533-ceb4ead85d3f\n\nHost:\nMichael Sandoval\n\nAbout MUSE TV:\n\nMUSE TV features the best in film, television, music, lifestyle, tech and so much more.  If it is an interview with one of your favorite celebrities or musicians, special features from the red carpet or blockbuster movie, theme park or travel destination, a concert with your favorite band or experience an attraction from another part of the globe we\u0027ve got you covered!\n\nFor more coverage, follow MUSE at:\n\nWebsite: https://www.musetv.net​​​​​​​​​​​​​​​\nFacebook:  /musetv1​​​​​  \nTwitter: @MUSETV1\nTikTok: @musetv \n\n©2024 MUSE TV",
      "release": "2024-06-14T23:59:08Z",
      "duration": "00:09:33",
      "explicit": false,
      "youTubeId": "FbNLZOFoZFk",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=FbNLZOFoZFk"
      }
    }
  ]
}