{
  "id": "8c4735d7-4c14-40e4-98fe-ae3d2c449a24",
  "name": "Mutembei TV",
  "youTubeChannelId": "UClRWSjtKICEuSDJAzGCEddw",
  "episodes": [
    {
      "id": "b9346009-f785-4820-8308-a713bfbd18e1",
      "title": "SHOCKING! A CHURCH IN CHANGAMWE ACCUSED FOR PRACTISING CULTISM! NAMED SHAKAHOLA 2!!!!",
      "description": "TO SHARE YOUR STORY WHATSAPP US ON \u002B44 7769104552\nMutembei TV is a Kenyan media platform, primarily operating as a YouTube channel,Facebook Page,Tiktok,Twitter, that focuses on delivering news, entertainment, and cultural content. It covers a wide range of topics including local and international news, celebrity gossip, lifestyle, and human interest stories, often with a humorous or engaging twist. The channel is known for its video content, which includes interviews, skits, and commentary, appealing largely to a Kenyan and East African audience. James Mutembei, the founder, and his team of freelancers across Kenya produce and present these videos, aiming to inform and entertain viewers while reflecting everyday life and issues in the region.In case you want to contact us for any event that you want covered kindly send us an email admin@mutembeitv.com.Thanks for subscribing and feel at home.\nSHARE AND SUBSCRIBE!!\n\nFollow us on:\n\nWebsite:\nhttps://mutembeitv.com/\n\nTwitter :\nhttps://twitter.com/MutembeiTV\n\nFACEBOOK:\nhttps://www.facebook.com/MutembeiTV\n-----------------------------------------------------------------------------------------------------------\nCopyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for fair use for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\nKenya,kenya,kenya news,kenya politics,uhuru kenyatta,raila odinga,william ruto,kumekucha chris,ktn news kenya,citizen tv kenya,ntv kenya,herman manyora,trending news in kenya,2022 election,lee makwiny,the 5th estate,mutahi ngunyi,daily nation,jalango tv,strange news kenya,mutembei tv,kenyans in USA,Kenyans in diaspora,\n\n#Mutembei",
      "release": "2025-11-05T07:44:04Z",
      "duration": "00:01:43",
      "explicit": false,
      "youTubeId": "F6KT9pORdYs",
      "subjects": [
        "Good News International Ministries"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=F6KT9pORdYs"
      }
    }
  ]
}