{
  "id": "67bae9a1-912d-4b68-9375-fd60aafc5993",
  "name": "My Racist Friend",
  "spotifyId": "66xNfuBe1pLmdFQon4XvyI",
  "appleId": 1475465166,
  "episodes": [
    {
      "id": "7fc97948-816d-49c8-aaf7-4051d676583d",
      "title": "Episode 4.10: Let It Burn",
      "description": "In this episode, hosts Don and Amy discuss the MOVE bombing in Philadelphia, a tragic and often overlooked part of American history. They delve into the background of the MOVE organization, the events leading up to the bombing, and the aftermath, including the impact on the surrounding neighborhood. The conversation also touches on broader themes of racism, police brutality, and the challenges of fostering meaningful dialogue about these critical issues. Resources and topics mentioned in this episode: • \u0022The Africas VS. America: Remembering one of the deadliest instances of police violence in U.S. history\u0022 (podcast) https://www.cbc.ca/radio/podcastnews/the-africas-vs-america-remembering-one-of-the-deadliest-instances-of-police-violence-in-u-s-history-1.6738879 • \u0022MOVE: Philadelphia\u0027s forgotten bombing\u0022 by Charles Abraham (PDF) https://commons.lib.jmu.edu/cgi/viewcontent.cgi?article=1054\u0026context=jmurj • \u0022The Outsize Role of Immigrants in US Innovation\u0022 (article) https://www.nber.org/digest/20233/outsize-role-immigrants-us-innovation My Racist Friend is a podcast about the messy parts of relationships that help us grow together. Long-time friends Don Griffin, Jr. and Amy Makice, LCSW, enter into a transparent and ongoing conversation about complicated and difficult topics such as racism, gender, and social justice. Through the authentic lens of their strong mutual relationship, their goal is to model difficult conversations that can promote understanding and connection in a world that needs both. In this relationship, Amy is the inherently racist friend, who is working to change and better understand how racism impacts her relationship with people she loves. Donald Griffin Jr. is a Bloomington native, former Deputy Mayor for Bloomington, and a real estate broker, proudly serving his community for the past three decades. Since opening Griffin Realty in 2003, Don\u0027s dedication to excellence has helped to guide his company to be among the top producers in Indiana with nearly a half billion in individual lifetime sales. Amy Makice, founder of Bloomington Center for Connection, is a licensed psychotherapist based in Bloomington, Indiana. Her professional journey is rooted in her passion for Relational-Cultural Therapy (RCT), and her commitment to RCT extends into community building initiatives to promote the power of connection. Amy helps to bring the Relational Summits to Bloomington, featuring distinguished guests like Maureen Walker, Amy Banks, and Isaac Knapper. Buy \u0022Your Racist Friend\u0022 by They Might Be Giants on iTunes",
      "release": "2024-07-02T10:53:21Z",
      "duration": "00:37:37.3850000",
      "explicit": false,
      "spotifyId": "4sB1WSB1EQCyGHYLeHeJTT",
      "appleId": 1000660901700,
      "subjects": [
        "The Move Of God"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4sB1WSB1EQCyGHYLeHeJTT",
        "apple": "https://podcasts.apple.com/podcast/episode-4-10-let-it-burn/id1475465166?i=1000660901700"
      }
    }
  ]
}