{
  "_ts": 0,
  "id": "32c4ecf9-43a5-4ee0-9684-fe4496b2716b",
  "name": "My Wife Joined A Cult",
  "spotifyId": "1SDRbvAqx8IFGgq4SW67DN",
  "appleId": 1761404638,
  "episodes": [
    {
      "id": "fa650bbe-9fa5-426d-ac9f-97e7a886f5d1",
      "title": "Podcast Episode 04: Navigating the Impact of Cult Influence on Family Dynamics",
      "description": "In this episode, we delve into the profound and often devastating impact of cult influence on family dynamics. Our host recounts personal experiences with a family member who became deeply involved with a controversial group. The discussion highlights the manipulation, the resulting familial strain, and the painful journey of trying to reconnect and heal. This episode offers a raw and honest look at the challenges faced by those who lose loved ones to cults, emphasizing the importance of courage, truth, and resilience in the face of such adversities.",
      "release": "2024-08-09T15:05:02Z",
      "duration": "00:53:09.4310000",
      "explicit": false,
      "spotifyId": "3vK3wmJXtXYtxQy3uneAY5",
      "appleId": 1000664832328,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vK3wmJXtXYtxQy3uneAY5",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-04-navigating-the-impact-of/id1761404638?i=1000664832328"
      }
    },
    {
      "id": "a545ee2e-0bae-404b-8494-7d11005d253d",
      "title": "Podcast Episode 3: Laughter, Honesty, and the Fight for Freedom",
      "description": "In this episode, we dive into the power of humor and honesty, exploring how they intertwine in our personal lives and broader societal movements. Our guest shares their journey through comedy, revealing the ways laughter can break down barriers and uncover deep truths. We also discuss recent global events, including the ongoing fight for freedom and justice, highlighting the resilience and courage of individuals standing up for what they believe in. Join us for a thought-provoking conversation that blends light-hearted moments with profound insights.",
      "release": "2024-08-09T15:05:02Z",
      "duration": "00:42:41.3510000",
      "explicit": false,
      "spotifyId": "0hcBwjLm2sWOpFS6UhUR63",
      "appleId": 1000664832327,
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hcBwjLm2sWOpFS6UhUR63",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-3-laughter-honesty-and-the-fight/id1761404638?i=1000664832327"
      }
    },
    {
      "id": "1988d427-6909-4751-adba-d0ac53de5eec",
      "title": "Podcast Episode 2: Navigating Truth, Betrayal, and Resilience",
      "description": "In Episode 2, Our host dives deep into the challenges and heartaches of navigating a tumultuous relationship with his ex-wife. He shares personal anecdotes about how humor and resilience have helped him and his children cope with the fallout from deceit and betrayal. Through raw and candid reflections, Craig discusses the impact of a manipulative cult leader on his family, the emotional toll on his children, and the importance of maintaining high vibrations and spiritual practices to overcome adversity. This episode underscores the complexities of truth, the struggle for integrity, and the journey towards healing and personal growth.",
      "release": "2024-08-07T15:05:02Z",
      "duration": "00:31:38.9760000",
      "explicit": false,
      "spotifyId": "7E54aoVSHmmjQYw2KbCjpa",
      "appleId": 1000664606226,
      "urls": {
        "spotify": "https://open.spotify.com/episode/7E54aoVSHmmjQYw2KbCjpa",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-2-navigating-truth-betrayal-and/id1761404638?i=1000664606226"
      }
    },
    {
      "id": "8520dc5e-f63a-4fff-b970-52dd85c56a79",
      "title": "Podcast Episode 1: The Unraveling",
      "description": "In Episode 1, we begin our journey into the heart of a family\u0027s darkest hour. Our host recounts the early days of his ex-wife\u0027s alarming transformation, from subtle changes in behavior to her full immersion into a destructive cult. With gripping detail, he describes the initial shock and confusion, the red flags that were ignored, and the chilling moment of realization that his family was in grave danger. This episode sets the tone for the series, shedding light on the insidious nature of cult influence and the devastating impact it can have on loved ones. Join us as we explore the beginnings of this harrowing tale, where the fight for truth and the safety of his children becomes paramount.",
      "release": "2024-08-06T15:05:01Z",
      "duration": "00:59:06.1430000",
      "explicit": false,
      "spotifyId": "23SxSK7iMSjOp8ttO8UB92",
      "appleId": 1000664508167,
      "urls": {
        "spotify": "https://open.spotify.com/episode/23SxSK7iMSjOp8ttO8UB92",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-1-the-unraveling/id1761404638?i=1000664508167"
      }
    }
  ]
}