{
  "_ts": 0,
  "id": "32c4ecf9-43a5-4ee0-9684-fe4496b2716b",
  "name": "My Wife Joined A Cult",
  "spotifyId": "1SDRbvAqx8IFGgq4SW67DN",
  "appleId": 1761404638,
  "youTubeChannelId": "UCPPmdlC-tLQVrnfjCUWycBQ",
  "episodes": [
    {
      "id": "d20b4b66-8043-4704-8e2c-21e30387f554",
      "title": "Episode 17: Talking with Dani From Cult Chronicles Podcast",
      "description": "In this gripping crossover episode of \u0022My Wife Joined a Cult,\u0022 Craig Shoemaker joins forces with the host of Cult Chronicles to unravel his personal encounters with cult culture. From his father’s unorthodox lifestyle in the mountains of Pennsylvania to his ex-wife’s descent into multiple cults, Craig shares raw, unfiltered stories that dive deep into the psychological grip these organizations have on their followers. He reveals his theories on how cult leaders manipulate through praise, control, and shame, creating a dangerous allure that entraps the vulnerable. This episode offers a compelling exploration of the fine line between fascination and fear in the world of cults, providing listeners a unique glimpse into Craig’s own battles with the dark forces that have shaped his personal and family life.",
      "release": "2024-09-20T15:05:01Z",
      "duration": "01:33:33",
      "explicit": false,
      "spotifyId": "0tgwjwLGTig9gwpRRGE1I8",
      "appleId": 1000670181492,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0tgwjwLGTig9gwpRRGE1I8",
        "apple": "https://podcasts.apple.com/us/podcast/episode-17-talking-with-dani-from-cult-chronicles-podcast/id1761404638?i=1000670181492"
      }
    },
    {
      "id": "c888bab6-1abd-401a-b303-2f77c6fdc0e1",
      "title": "Episode 16: Jeff Cobher Unveiled: Exploring Cults, Meditation, and the Quest for Inner Peace",
      "description": "In this thought-provoking episode, Craig Shoemaker and special guest Jeff Cobher dive into the complex worlds of cults, wellness grifters, and meditation. They explore the allure of spiritual systems, the dangers of misplaced trust, and the quest for inner peace in a chaotic world. Through personal stories and candid insights, they unravel the challenges of seeking meaning amidst manipulation, urging listeners to look beyond the illusions. Join us as we discuss how to find true enlightenment and the courage to see beyond the surface.",
      "release": "2024-09-18T15:05:01Z",
      "duration": "01:14:08.9280000",
      "explicit": false,
      "spotifyId": "4LmThu0CtbTupad9ZRcU9E",
      "appleId": 1000669948122,
      "subjects": [
        "Self-Help",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LmThu0CtbTupad9ZRcU9E",
        "apple": "https://podcasts.apple.com/podcast/episode-16-jeff-cobher-unveiled-exploring-cults-meditation/id1761404638?i=1000669948122"
      }
    },
    {
      "id": "3cefc5c7-0a07-4080-928e-d90595716e85",
      "title": "Episode 15: Cult Vs. Scam with Guest Phil Maco.",
      "description": "In this episode, Craig Shoemaker sits down with Phil Maco, host of the \u0022Muddy Waters\u0022 podcast, to dive deep into the unsettling similarities between cults and scams. They explore how cult leaders and scammers use similar tactics of manipulation, vulnerability, and false personas to control and exploit their victims. From personal stories to shocking insights, this episode uncovers the dark connections between these two worlds and offers valuable tips on recognizing the warning signs before it\u0027s too late.",
      "release": "2024-09-16T15:05:02Z",
      "duration": "01:02:16.9680000",
      "explicit": false,
      "spotifyId": "3ifMBLeXCUPntWyc4VDMDP",
      "appleId": 1000669710162,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ifMBLeXCUPntWyc4VDMDP",
        "apple": "https://podcasts.apple.com/podcast/episode-15-cult-vs-scam-with-guest-phil-maco/id1761404638?i=1000669710162"
      }
    },
    {
      "id": "b3094d2c-d16c-4053-88be-a6d526bbc307",
      "title": "Episode 14: Throwing the Hat Over the Wall: Finding Peace Amidst Chaos",
      "description": "In this deeply introspective episode, our host dives into the unexpected journey of navigating life\u0027s most challenging and chaotic moments. Using the metaphor of \u0022throwing the hat over the wall,\u0022 they explore the relentless pursuit of solutions, peace, and healing in the face of mental illness, family struggles, and personal battles. Reflecting on their own experiences, they discuss the complexities of control, forgiveness, and the constant search for hope. This episode is a raw and honest look at the power of resilience, the importance of community, and the journey towards inner tranquility, even when faced with life\u0027s darkest moments. Whether you\u0027re going through your own struggles or supporting someone in theirs, this conversation offers a relatable and heartfelt reminder that you are not alone.",
      "release": "2024-09-13T20:47:19Z",
      "duration": "01:04:38",
      "explicit": false,
      "spotifyId": "6ARDKkTWTapVmikF508JT7",
      "appleId": 1000669482548,
      "youTubeId": "VfTBqD4IN3U",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ARDKkTWTapVmikF508JT7",
        "apple": "https://podcasts.apple.com/us/podcast/episode-14-throwing-the-hat-over-the-wall-finding/id1761404638?i=1000669482548",
        "youtube": "https://www.youtube.com/watch?v=VfTBqD4IN3U"
      }
    },
    {
      "id": "4e07a245-239b-4a66-b00d-0719e4c0631f",
      "title": "Episode 13 - From Chaos to Clarity: A Journey Through Hollywood and Home",
      "description": "In this deeply personal episode, our host reflects on a life marked by struggle, resilience, and the pursuit of authenticity. Growing up in Philadelphia and navigating the illusions of Hollywood, he shares stories of his humble beginnings, complex family dynamics, and the challenges of reconciling past traumas with present success. This episode delves into the contrasts between Tinseltown’s glittering facade and the reality behind it, offering listeners a raw glimpse into a lifelong journey of healing, self-discovery, and finding laughter amid adversity.",
      "release": "2024-09-11T17:29:06Z",
      "duration": "01:24:00.6480000",
      "explicit": false,
      "spotifyId": "0nutEQh4ozNj8p7EzSHtro",
      "appleId": 1000669182591,
      "youTubeId": "qck9jdDPah8",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0nutEQh4ozNj8p7EzSHtro",
        "apple": "https://podcasts.apple.com/podcast/episode-13-from-chaos-to-clarity-a-journey-through/id1761404638?i=1000669182591",
        "youtube": "https://www.youtube.com/watch?v=qck9jdDPah8"
      }
    },
    {
      "id": "470f5926-38fc-47f9-942e-8bbc9b8f8b4b",
      "title": "Episode 12: The Journey Within: Finding Forgiveness Amidst Chaos",
      "description": "In this deeply introspective episode, Craig navigates through a maze of personal pain, anger, and forgiveness as he discusses his tumultuous relationship with his ex-wife, who has become involved in a controversial spiritual community. Craig reflects on the complexities of trust, ego, and personal growth while shedding light on the dangers of blindly following charismatic leaders. He openly shares his journey toward self-discovery and love, touching on the struggles of being vulnerable and the power of true forgiveness. Tune in for a raw exploration of healing, love, and the search for inner peace.",
      "release": "2024-09-06T15:05:01Z",
      "duration": "01:17:30.6480000",
      "explicit": false,
      "spotifyId": "466AcouGjSoCNvDW9BQsWU",
      "appleId": 1000668628701,
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/466AcouGjSoCNvDW9BQsWU",
        "apple": "https://podcasts.apple.com/podcast/episode-12-the-journey-within-finding-forgiveness/id1761404638?i=1000668628701"
      }
    },
    {
      "id": "e06a105c-801b-4f02-942e-bec405a9cd32",
      "title": "Episode 11 Truth and Manipulation: Navigating Dark Waters",
      "description": "Craig Shoemaker sits down with his longtime friend, Adam Cox, a former radio personality and guest on Episode 11, as he shares his deeply personal experience of being connected to a cult through his sister, who fell under the influence of its leaders. He reveals the dark and complex dynamics that led to devastating consequences, including the manipulation and brainwashing of his family members.",
      "release": "2024-09-04T15:05:02Z",
      "duration": "01:08:57.8880000",
      "explicit": false,
      "spotifyId": "7iPqhkFm1fcJPHP8Fp4iP0",
      "appleId": 1000668350936,
      "youTubeId": "5m7l7fbZzqE",
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7iPqhkFm1fcJPHP8Fp4iP0",
        "apple": "https://podcasts.apple.com/podcast/episode-11-truth-and-manipulation-navigating-dark-waters/id1761404638?i=1000668350936",
        "youtube": "https://www.youtube.com/watch?v=5m7l7fbZzqE"
      }
    },
    {
      "id": "5ccbe1ac-b40b-477d-ad85-69171011c7ca",
      "title": "Episode 10: Free Falling From Grace",
      "description": "Join Craig Shoemaker as he dives into the highs and lows of the entertainment industry. With his signature humor and insight, Craig explores stories of spectacular success and the inevitable tumbles that follow. Hear from those who have lived through it, bounced back, and found grace in the free fall. This episode is a mix of laughter, resilience, and the real-life lessons that come from navigating fame and failure.",
      "release": "2024-09-02T15:05:01Z",
      "duration": "01:39:59.6400000",
      "explicit": false,
      "spotifyId": "4rPjRyObp6Alu0vSq4Y9nV",
      "appleId": 1000668063406,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4rPjRyObp6Alu0vSq4Y9nV",
        "apple": "https://podcasts.apple.com/podcast/episode-10-free-falling-from-grace/id1761404638?i=1000668063406"
      }
    },
    {
      "id": "5af46626-2ba9-41ad-99a6-405ee1514cc3",
      "title": "Episode 9: Sleepless in Cult Chaos",
      "description": "In this emotionally charged episode, Craig delves into the struggles of sleepless nights and the heavy burden of dealing with a loved one deeply entrenched in a cult. Join Craig as he shares personal stories that reflect the overwhelming sense of helplessness, frustration, and the devastating impact of secrecy and avoidance in relationships. This episode also explores the eerie parallels between cult-like behaviors in society and my own experiences, as I navigate the complex emotions of fear, anger, and the relentless pursuit of truth in a world clouded by deception.",
      "release": "2024-08-29T15:05:01Z",
      "duration": "01:35:57.1430000",
      "explicit": false,
      "spotifyId": "3gK8oglV1k9wpyL32cH0Rh",
      "appleId": 1000667159230,
      "urls": {
        "spotify": "https://open.spotify.com/episode/3gK8oglV1k9wpyL32cH0Rh",
        "apple": "https://podcasts.apple.com/podcast/episode-9-sleepless-in-cult-chaos/id1761404638?i=1000667159230"
      }
    },
    {
      "id": "09fcf56b-b074-47cb-9107-36321376e353",
      "title": "Episode 8: Letting Go, Moving Forward",
      "description": "In this episode, Craig Shoemaker shares a personal journey of love, loss, and spiritual growth. Reflecting on his marriage to his ex-wife, Craig opens up about the challenges they faced, including a miscarriage and external pressures that tested their bond. He explores the power of \u0022quantum shifts\u0022 in relationships, the impact of external influences, and the importance of vulnerability and self-awareness. Through candid storytelling, Craig offers insights on healing and the potential for spiritual awakening in the face of adversity.",
      "release": "2024-08-27T19:16:06Z",
      "duration": "01:36:26.6220000",
      "explicit": false,
      "spotifyId": "4zycDzfl1aYya5zYFJzj5X",
      "appleId": 1000666817947,
      "urls": {
        "spotify": "https://open.spotify.com/episode/4zycDzfl1aYya5zYFJzj5X",
        "apple": "https://podcasts.apple.com/podcast/episode-8-letting-go-moving-forward/id1761404638?i=1000666817947"
      }
    },
    {
      "id": "33482f3c-89db-4ca7-8b8f-bf712c996735",
      "title": "Podcast Episode 07: Parental Alienation and Resilience.",
      "description": "In this episode of \u0022My Wife Joined a Cult,\u0022 Craig Shoemaker shares personal experiences dealing with volatile personalities and emotional abuse. He reflects on parental alienation, co-parenting struggles, and ongoing legal battles. Craig offers advice on maintaining integrity and resilience, emphasizing the importance of emotional intelligence and accountability. Tune in for a powerful narrative of conflict, self-discovery, and the pursuit of truth and love.",
      "release": "2024-08-16T15:05:02Z",
      "duration": "01:16:55",
      "explicit": false,
      "spotifyId": "2SG7PR0bhmnv1Ug5l65Mu1",
      "appleId": 1000665641861,
      "youTubeId": "yohvi6XpCaQ",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2SG7PR0bhmnv1Ug5l65Mu1",
        "apple": "https://podcasts.apple.com/us/podcast/podcast-episode-07-parental-alienation-and-resilience/id1761404638?i=1000665641861",
        "youtube": "https://www.youtube.com/watch?v=yohvi6XpCaQ"
      }
    },
    {
      "id": "629cdc10-4cfd-416c-a891-d492d67275ca",
      "title": "Podcast Episode 06: Navigating Love and Loss: A Journey of Self-Discovery",
      "description": "In this episode, we dive into the complexities of relationships, self-discovery, and personal growth. Our host shares his emotional journey, reflecting on past traumas, the pressures of maintaining a marriage, and the impact of spiritual and personal transformation.We explore old Facebook messages from the host\u0027s former partner, shedding light on their relationship dynamics and the challenges they faced. This episode offers a raw and intimate look into love, loss, and the path to healing.Tune in for a heartfelt and insightful discussion on navigating the ups and downs of life and relationships.",
      "release": "2024-08-13T15:05:03Z",
      "duration": "00:44:46",
      "explicit": false,
      "spotifyId": "1mq9DolNU89uzoYmGnQva0",
      "appleId": 1000665156959,
      "youTubeId": "Av3i0Ta2mbI",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1mq9DolNU89uzoYmGnQva0",
        "apple": "https://podcasts.apple.com/us/podcast/podcast-episode-06-navigating-love-and-loss-a/id1761404638?i=1000665156959",
        "youtube": "https://www.youtube.com/watch?v=Av3i0Ta2mbI"
      }
    },
    {
      "id": "9f2073df-b89d-4e71-9137-ea6631fe3faa",
      "title": "Podcast Episode 05: Unmasking Manipulation – A Deep Dive into Cult Dynamics",
      "description": "In this episode, we explore the unsettling realities of cult dynamics and the manipulative tactics used by their leaders. Our host shares harrowing text messages and personal stories, shedding light on how a charismatic figure can exert control over individuals and families. We examine the psychological and emotional toll on those ensnared in such environments, the dangerous normalization of toxic behaviors, and the heartbreaking consequences on relationships and mental health. This episode is a compelling exposé on the dark underbelly of cults, urging listeners to recognize and resist manipulative influences.",
      "release": "2024-08-11T15:05:02Z",
      "duration": "00:47:58",
      "explicit": false,
      "spotifyId": "4hXep0rPQLoJXU3qptnWfj",
      "appleId": 1000664951083,
      "youTubeId": "03n4EtqoPA4",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4hXep0rPQLoJXU3qptnWfj",
        "apple": "https://podcasts.apple.com/us/podcast/podcast-episode-05-unmasking-manipulation-a-deep/id1761404638?i=1000664951083",
        "youtube": "https://www.youtube.com/watch?v=03n4EtqoPA4"
      }
    },
    {
      "id": "fa650bbe-9fa5-426d-ac9f-97e7a886f5d1",
      "title": "Podcast Episode 04: Navigating the Impact of Cult Influence on Family Dynamics",
      "description": "In this episode, we delve into the profound and often devastating impact of cult influence on family dynamics. Our host recounts personal experiences with a family member who became deeply involved with a controversial group. The discussion highlights the manipulation, the resulting familial strain, and the painful journey of trying to reconnect and heal. This episode offers a raw and honest look at the challenges faced by those who lose loved ones to cults, emphasizing the importance of courage, truth, and resilience in the face of such adversities.",
      "release": "2024-08-09T15:05:02Z",
      "duration": "00:53:09.4310000",
      "explicit": false,
      "spotifyId": "3vK3wmJXtXYtxQy3uneAY5",
      "appleId": 1000664832328,
      "youTubeId": "7gCB-CNqhts",
      "urls": {
        "spotify": "https://open.spotify.com/episode/3vK3wmJXtXYtxQy3uneAY5",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-04-navigating-the-impact-of/id1761404638?i=1000664832328",
        "youtube": "https://www.youtube.com/watch?v=7gCB-CNqhts"
      }
    },
    {
      "id": "a545ee2e-0bae-404b-8494-7d11005d253d",
      "title": "Podcast Episode 3: Laughter, Honesty, and the Fight for Freedom",
      "description": "In this episode, we dive into the power of humor and honesty, exploring how they intertwine in our personal lives and broader societal movements. Our guest shares their journey through comedy, revealing the ways laughter can break down barriers and uncover deep truths. We also discuss recent global events, including the ongoing fight for freedom and justice, highlighting the resilience and courage of individuals standing up for what they believe in. Join us for a thought-provoking conversation that blends light-hearted moments with profound insights.",
      "release": "2024-08-09T15:05:02Z",
      "duration": "00:42:41.3510000",
      "explicit": false,
      "spotifyId": "0hcBwjLm2sWOpFS6UhUR63",
      "appleId": 1000664832327,
      "youTubeId": "Kd9QRDr8bi8",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0hcBwjLm2sWOpFS6UhUR63",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-3-laughter-honesty-and-the-fight/id1761404638?i=1000664832327",
        "youtube": "https://www.youtube.com/watch?v=Kd9QRDr8bi8"
      }
    },
    {
      "id": "1988d427-6909-4751-adba-d0ac53de5eec",
      "title": "Podcast Episode 2: Navigating Truth, Betrayal, and Resilience",
      "description": "In Episode 2, Our host dives deep into the challenges and heartaches of navigating a tumultuous relationship with his ex-wife. He shares personal anecdotes about how humor and resilience have helped him and his children cope with the fallout from deceit and betrayal. Through raw and candid reflections, Craig discusses the impact of a manipulative cult leader on his family, the emotional toll on his children, and the importance of maintaining high vibrations and spiritual practices to overcome adversity. This episode underscores the complexities of truth, the struggle for integrity, and the journey towards healing and personal growth.",
      "release": "2024-08-07T15:05:02Z",
      "duration": "00:31:38.9760000",
      "explicit": false,
      "spotifyId": "7E54aoVSHmmjQYw2KbCjpa",
      "appleId": 1000664606226,
      "youTubeId": "lQM4iPUoawM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7E54aoVSHmmjQYw2KbCjpa",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-2-navigating-truth-betrayal-and/id1761404638?i=1000664606226",
        "youtube": "https://www.youtube.com/watch?v=lQM4iPUoawM"
      }
    },
    {
      "id": "8520dc5e-f63a-4fff-b970-52dd85c56a79",
      "title": "Podcast Episode 1: The Unraveling",
      "description": "In Episode 1, we begin our journey into the heart of a family\u0027s darkest hour. Our host recounts the early days of his ex-wife\u0027s alarming transformation, from subtle changes in behavior to her full immersion into a destructive cult. With gripping detail, he describes the initial shock and confusion, the red flags that were ignored, and the chilling moment of realization that his family was in grave danger. This episode sets the tone for the series, shedding light on the insidious nature of cult influence and the devastating impact it can have on loved ones. Join us as we explore the beginnings of this harrowing tale, where the fight for truth and the safety of his children becomes paramount.",
      "release": "2024-08-06T15:05:01Z",
      "duration": "00:59:06.1430000",
      "explicit": false,
      "spotifyId": "23SxSK7iMSjOp8ttO8UB92",
      "appleId": 1000664508167,
      "youTubeId": "gT9-9q9nvp0",
      "urls": {
        "spotify": "https://open.spotify.com/episode/23SxSK7iMSjOp8ttO8UB92",
        "apple": "https://podcasts.apple.com/podcast/podcast-episode-1-the-unraveling/id1761404638?i=1000664508167",
        "youtube": "https://www.youtube.com/watch?v=gT9-9q9nvp0"
      }
    },
    {
      "id": "b36a4ee6-067e-4aae-9e5f-9932afab6960",
      "title": "Prologue: Into The Shadows - My Wife Joined A Cult Podcast",
      "description": "In this prologue episode, we dive deep into the raw and unfiltered emotions of a family torn apart by betrayal and deception. Join us as our host opens up about the challenges and heartaches of dealing with a loved one\u0027s descent into a destructive cult. With dramatic personal anecdotes and reflections, he paints a vivid picture of his family\u0027s struggle to navigate through the lies, manipulation, and emotional turmoil inflicted by his ex-wife\u0027s radical transformation. This candid and heartfelt prologue sets the stage for the episodes to come, offering listeners a glimpse into a journey of resilience, truth-seeking, and the relentless pursuit of healing and protection for his children. Tune in and embark on this poignant journey with us.",
      "release": "2024-08-05T15:00:45Z",
      "duration": "00:56:10",
      "explicit": false,
      "spotifyId": "3K6wV4wLuku6QFdYwDV8Li",
      "appleId": 1000664508204,
      "youTubeId": "dV30LMkvDIk",
      "urls": {
        "spotify": "https://open.spotify.com/episode/3K6wV4wLuku6QFdYwDV8Li?si=21cfe938c37b4020",
        "apple": "https://podcasts.apple.com/podcast/prologue-into-the-shadows/id1761404638?i=1000664508204",
        "youtube": "https://www.youtube.com/watch?v=dV30LMkvDIk"
      }
    }
  ]
}