{
  "id": "942f72ee-303f-47eb-8fc5-ad0fd3dacf1b",
  "name": "MyNBC5-WPTZ",
  "youTubeChannelId": "UCO3KF4ZlaGjyels6A7riZug",
  "episodes": [
    {
      "id": "0fc32042-cdcb-4ef3-92e7-4aaa7fcaebc0",
      "title": "Judge allows members of Zizians group to work together on defense ahead of Maryland trial",
      "description": "Jack LaSota, Michelle Zajko and Daniel Blank are among a group of young, highly intelligent computer scientists drawn together by radical beliefs about veganism, gender identity and artificial intelligence.\n\nMyNBC5 is your home for Vermont breaking news and weather. For your latest Vermont news and weather visit: https://www.mynbc5.com/\n\nFor licensing inquiries: https://www.mynbc5.com/licensing",
      "release": "2026-01-16T22:15:50Z",
      "duration": "00:01:19",
      "explicit": false,
      "youTubeId": "gmaksHk6KWQ",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=gmaksHk6KWQ"
      }
    },
    {
      "id": "c69d5e22-a998-4d10-b8b0-f62698ece1c2",
      "title": "Member of cult-like Zizian group says she did not kill her parents",
      "description": "In the letter, Michelle Zajko denies the accusations that she killed her parents. The Zizians are linked to other deaths across the country, including that of a Vermont Border Patrol Agent.\n\nSubscribe to My NBC5 on YouTube now for more: http://bit.ly/1e9vG0j\n\nGet more Burlington/Plattsburgh news: http://www.mynbc5.com\nLike us:  https://www.facebook.com/MyNBC5/\nFollow us: https://twitter.com/mynbc5\nInstagram: https://www.instagram.com/mynbc5",
      "release": "2025-04-17T21:43:14Z",
      "duration": "00:01:22",
      "explicit": false,
      "youTubeId": "knZ3Z09fME8",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=knZ3Z09fME8"
      }
    },
    {
      "id": "68a7e3ed-72ee-4f8c-ab32-9f39169e596a",
      "title": "Leader, members of cultlike Zizian cult facing new gun charges",
      "description": "The leader and two members of a cultlike group that has been connected to six killings in three states face new gun charges in Maryland.\n\nSubscribe to My NBC5 on YouTube now for more: http://bit.ly/1e9vG0j\n\nGet more Burlington/Plattsburgh news: http://www.mynbc5.com\nLike us:  https://www.facebook.com/MyNBC5/\nFollow us: https://twitter.com/mynbc5\nInstagram: https://www.instagram.com/mynbc5",
      "release": "2025-03-21T16:11:11Z",
      "duration": "00:00:51",
      "explicit": false,
      "youTubeId": "xuLzPpZEnfA",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xuLzPpZEnfA"
      }
    },
    {
      "id": "3847f6dd-4d0b-4a87-b81e-ce338a4431f7",
      "title": "Criminologist says social media can radicalize cult-like groups following arrest of Zizians",
      "description": "An expert on the psychology behind the rise in cult-like activity online is speaking out about the dangers posed by social media following the recent arrests of several people tied to a group known as the Zizians.\n\nMichelle Zajko, the woman accused of purchasing the guns used in the fatal shooting of U.S. Border Patrol agent David Maland, is behind bars in Maryland following her arrest earlier this week. Zajko, Jack LaSota and Daniel Blank were all arrested Monday night on multiple charges, including trespassing.\n\nThe three individuals are suspected to be connected with a cult-like group known as the Zizians. LaSota began posting radical theories online in 2016 and is now the group\u0027s suspected leader. The Zizians are known to be made up of mostly young, transgender individuals with beliefs in radical veganism, anti-artificial intelligence and gender identity.\n\n\u0022Some kind of core ideology doesn\u0027t have to be bad,\u0022 said Dr. Elizabeth Gurian, director of the Norwich University School of Criminology and Criminal Justice. \u0022But, it\u0027s when it tips into criminal violence, that\u0027s when it becomes a concern.\u0022\n\n\u0022I think social media, again, draws people together and in some ways allows people with very extreme viewpoints to come together more quickly,\u0022 said Gurian.\n\nSubscribe to My NBC5 on YouTube now for more: http://bit.ly/1e9vG0j\n\nGet more Burlington/Plattsburgh news: http://www.mynbc5.com\nLike us:  https://www.facebook.com/MyNBC5/\nFollow us: https://twitter.com/mynbc5\nInstagram: https://www.instagram.com/mynbc5",
      "release": "2025-02-20T15:16:58Z",
      "duration": "00:03:08",
      "explicit": false,
      "youTubeId": "zwowgwbjjjw",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zwowgwbjjjw"
      }
    },
    {
      "id": "79b351c9-f5c9-4ad0-9f11-b10bdf4ee48d",
      "title": "Leader of cultlike Zizians linked to 6 killings ordered held without bail in Maryland",
      "description": "The Zizians have been tied to the killing of U.S. Border Patrol Agent David Maland near the Canadian border in January.\n\nThe leader of a cultlike group connected to six killings in three states was ordered held without bail Tuesday in Maryland, where she faces trespassing and other charges.\n\nJack LaSota, 34, of Berkeley, California, and two others arrested with her on Sunday appeared via videoconference for bail hearings in Allegany District Court. A judge ordered all three held without bail, describing them as dangerous flight risks.\n\nAllegany County State’s Attorney James Elliott said LaSota has faked her own death in the past and “appears to be the leader of an extremist group known as Zizians” that has been linked to multiple deaths.\n\nBut LaSota, who is known online as Ziz, asked for pretrial release, saying she was homeless with no means of traveling. Speaking haltingly, she also requested a vegan diet and said she was “in a mild state of delirium” due to lack of food.\n\n“I haven’t done anything wrong,” she told the judge.\n\nMembers the group, referred to by others as Zizians, have been tied to the death of a woman during an attack on a California landlord in November 2022, the landlord’s subsequent slaying in January, and the deaths of a Pennsylvania couple in between. Most recently, the group has been linked to a highway shootout in northern Vermont, referred to by locals as the Northeast Kingdom, that left a U.S. Border Patrol agent and a German national dead.\n\nSubscribe to My NBC5 on YouTube now for more: http://bit.ly/1e9vG0j\n\nGet more Burlington/Plattsburgh news: http://www.mynbc5.com\nLike us:  https://www.facebook.com/MyNBC5/\nFollow us: https://twitter.com/mynbc5\nInstagram: https://www.instagram.com/mynbc5",
      "release": "2025-02-18T21:14:14Z",
      "duration": "00:02:49",
      "explicit": false,
      "youTubeId": "UM4gqqoSSxU",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UM4gqqoSSxU"
      }
    },
    {
      "id": "3e502605-89c8-476f-bab3-db20519f5346",
      "title": "Two members of cultlike Zizian group arrested",
      "description": "Members of the group are allegedly connected to the shooting death of United States Customs and Border Patrol agent David \u0022Chris\u0022 Maland.\n\nSubscribe to My NBC5 on YouTube now for more: http://bit.ly/1e9vG0j\n\nGet more Burlington/Plattsburgh news: http://www.mynbc5.com\nLike us:  https://www.facebook.com/MyNBC5/\nFollow us: https://twitter.com/mynbc5\nInstagram: https://www.instagram.com/mynbc5",
      "release": "2025-02-17T21:14:05Z",
      "duration": "00:02:40",
      "explicit": false,
      "youTubeId": "Av9Xm1jVxsA",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Av9Xm1jVxsA"
      }
    }
  ]
}