{
  "id": "088f8ee0-b42b-4c54-bcb1-e59146cbe831",
  "name": "MyndKontrol",
  "youTubeChannelId": "UC_DhjIu5HilxZEVslHNGJZA",
  "episodes": [
    {
      "id": "252e5678-4605-4e8c-9de3-dc80ae740367",
      "title": "Cult Kids: Thought Police, Family, and Cults - A Conversation with Ex-members of Homestead Heritage",
      "description": "In this episode of MYNDKONTROL, I sit down with my sibling to share their personal story of growing up inside Homestead Heritage, a high-control religious community often described as cult-like. We discuss: What it was really like to be raised in Homestead Heritage The methods of control and manipulation used within the group The challenges of leaving and building a new life The ongoing journey of recovery, healing, and reclaiming our voices This episode is part of our mission to shed light on the hidden world of cults, religious trauma, and the resilience of survivors. If you’ve experienced similar situations or want to learn more about cult psychology, this conversation is for you. 👉 Don’t forget to subscribe to the channel for more episodes with survivors, experts, and advocates. #CultSurvivor #HomesteadHeritage #ExCult #CultRecovery #ReligiousTrauma #MindControl #BreakingFree #HealingJourney #SurvivorVoices #MyndKontrolPodcast",
      "release": "2025-10-13T01:12:31Z",
      "duration": "01:17:03",
      "explicit": false,
      "youTubeId": "NFBo6NX2NAM",
      "subjects": [
        "Homestead Heritage"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=NFBo6NX2NAM"
      }
    },
    {
      "id": "6cce6c24-046a-4898-9bfc-cd0ee76f5b87",
      "title": "Mind Control, Family, and Cults: Deprogramming Homestead Heritage - A Conversation with Ex-members",
      "description": "In this episode of MyndKontrol, I sit down with my brother to share our raw, unfiltered story of growing up inside a cult, and the journey of deprogramming, healing, and finally being free to live life on our own terms.\n\nWe talk about what life inside a cult was really like, the process of breaking free from controlling systems, and how we’re rebuilding our identities outside of it. This is more than just a conversation — it’s about resilience, reclaiming freedom, and choosing your own path forward.\n\nIf you’ve ever wondered about life after high-control groups, or you’re on your own healing journey, this episode is for you.\n\n✨ Don’t forget to like, comment, and subscribe for more conversations about breaking free, personal growth, and mental resilience.#MyndKontrol\n\n#CultSurvivor\n\n#LifeAfterCult\n\n#Deprogramming\n\n#HealingJourney\n\n#BreakingFree\n\n#LivingOnOurTerms\n\n#SurvivorStories\n\n#MentalHealthAwareness\n\n#SpiritualAwakening\n\n#FreedomToChoose\n\n#ReclaimYourLife\n\n#TraumaRecovery\n\n#FamilyConversations\n\n#BrotherTalk\n\n#PersonalGrowth\n\n#TrueStoriesPodcast\n\n#RealConversations\n\n#LifeUnscripted\n\n#HealingTogether\n\n#MindControlRecovery\n\n#FindingFreedom",
      "release": "2025-08-24T00:14:47Z",
      "duration": "01:19:07",
      "explicit": false,
      "youTubeId": "pRalTPTR6qA",
      "subjects": [
        "Homestead Heritage",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pRalTPTR6qA"
      }
    },
    {
      "id": "53a8d7b4-abf7-412b-bc6a-bb7192cd090d",
      "title": "Cathy S. Harris: Escaping High-Control Groups \u0026 Finding Freedom After Religious Abuse",
      "description": "In this powerful interview, Cathy S. Harris shares her journey of breaking free from a closed high-control group and reclaiming her identity after years of religious abuse. We discuss the emotional, psychological, and spiritual challenges of leaving, and how survivors can rebuild their lives with personal freedom and self-discovery.\n\nExpanded Description:\n\n    This episode dives deep into:\n\n        -What life is like inside a high-control religious group\n\n        -How to recognize the warning signs of spiritual abuse\n\n        -Steps for deconstructing harmful beliefs\n\n        -Finding your authentic self after leaving religion\n\n        -The role of community in recovery and healing\n\nWhether you’re questioning your faith, supporting someone who has left, or seeking stories of resilience, Cathy’s wisdom offers hope and guidance.\n\n    💬 Share your thoughts in the comments — your story might help someone else heal.\n    📌 Subscribe for more survivor stories and interviews on recovery, faith deconstruction, and personal freedom.",
      "release": "2025-08-18T00:05:21Z",
      "duration": "01:08:05",
      "explicit": false,
      "youTubeId": "j1yIyaXpUUw",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j1yIyaXpUUw"
      }
    }
  ]
}