{
  "_ts": 0,
  "id": "1163505b-d482-4397-ba75-f40ea5fa9516",
  "name": "Mystery and Murder: Analysis by Dr. Phil",
  "spotifyId": "11P6BQq19Gixw9SKFqyWyy",
  "appleId": 1459421450,
  "youTubeChannelId": "UCUzybWGzmOOS6w0KokFTRnQ",
  "episodes": [
    {
      "id": "c13e8fed-519d-47dc-a589-eafb221bcb2c",
      "title": "S15EP1: Playing God: Amy Carlson and the Love Has Won Cult",
      "description": "Amy Carlson, better known as \u0022Mother God,\u0022 started as a spiritually curious mom but became the leader of a notorious cult built on sleep deprivation, forced labor, and financial exploitation. She claimed to be Marilyn Monroe, Joan of Arc, and even Jesus—remembering, in vivid detail, being crucified. But how does someone go from a seemingly ordinary life to believing they are God? And how did it all spiral into one of the most bizarre and tragic cult stories ever told? Join Dr. Phil as he unpacks Amy Carlson’s rise to power, her shocking beliefs, and the eerie final days leading up to her grotesque and tragic end. With firsthand accounts from cult members and expert analysis, this episode is a deep dive into the psychology behind cult leadership and blind devotion. New episodes drop every Thursday. Follow, subscribe, review and share: YouTube | Apple Podcasts | Spotify | Amazon Music | Website Special thanks to our sponsors! Support the brands that support us! Visit them and let them know we sent you: Preserve Gold: Visit: https://drphilgold.com/ Get a FREE precious metals guide that contains essential information on how to help protect your accounts. Text “DRPHIL” to 50505 to claim this exclusive offer from Preserve Gold today. Jase Medical: Get emergency antibiotics at https://Jase.com/ \u0026 use code PHIL for a discount Balance of Nature: Go to https://balanceofnature.com/ or call 1.800.246.8751 and get this special offer by using Discount Code: “DRPHIL”. Get a FREE Fiber \u0026 Spice supplement, plus 35% OFF your first preferred set as a new Preferred Customer, with free shipping and our money-back guarantee. Start your journey with Balance of Nature.",
      "release": "2025-05-22T22:00:00Z",
      "duration": "00:52:54.2950000",
      "explicit": false,
      "spotifyId": "2CwBOJnItGFBlxE3xHEPsU",
      "appleId": 1000709497065,
      "youTubeId": "gKEgxqxCLH4",
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2CwBOJnItGFBlxE3xHEPsU",
        "apple": "https://podcasts.apple.com/podcast/s15ep1-playing-god-amy-carlson-and-the-love-has-won-cult/id1459421450?i=1000709497065",
        "youtube": "https://www.youtube.com/watch?v=gKEgxqxCLH4"
      }
    }
  ]
}