{
  "id": "7cd70242-2be1-4c34-a722-740445008120",
  "name": "Mysterious Crime World",
  "youTubeChannelId": "UCbfYttFopyZX0YEp5MtNEag",
  "episodes": [
    {
      "id": "5312c997-c24a-4983-9679-20c1c085f0d5",
      "title": "The Disturbing tale of The Mauerova Cult Family.",
      "description": "Welcome to Mysterious Crime World ! Delve into the chilling realm of unsolved mysteries and perplexing crimes that have captured the world\u0027s attention.The Disturbing tale of The Mauerova Cult Family. \nKlara Mauerova, a Czech woman, belonged to a religious cannibal cult. She and her sister beat the children – two adopted boys – with belts, put cigarettes out on them, sexually abused them, forced them to cut themselves with knives, and cut one boy’s skin and forced him to eat it. They kept the boys locked up in dog cages, forcing them to sleep in their own excrement. Mauerova was sentenced to nine years in prison in 2008.\n\n\n==================================\nthe mauerova family,klara mauerova,mauerova family,mauerova,klara mauerova caso,disturbing mysteries,scariest cults of all time reaction,scariest cults of all time,katerina mauerova,cults,inbred family,most dangerous active cults,dangerous cults,murderous cults\n\n\n========================\nDISCLAIMER\n1. All information, stories and everything shared on the videos of Mysterious Crime World channel is based on information collected from various sources like books, newspapers and internet. While we try our best to produce good content that seems authentic to our knowledge, Mysterious Crime World does not create or claim authenticity of any of the information provided in this channel. \n2. Any resemblance to real persons, living or dead is unintentional and purely coincidental. \n3. We do not intend to hurt any sentiments of our viewers. \n4. Some parts from this video like music, pictures and videos etc. are sourced from the web. Mysterious Crime World  does not declare any ownership of the pictures sourced in the Video.",
      "release": "2024-07-28T03:30:21Z",
      "duration": "00:05:17",
      "explicit": false,
      "youTubeId": "uEZQbB18YDk",
      "subjects": [
        "Kurim Case"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=uEZQbB18YDk"
      }
    }
  ]
}