{
  "id": "7fe994ba-bb36-4815-9b46-ed2ad6bfb824",
  "name": "Myth Cast",
  "youTubeChannelId": "UCyNCk-S6PlGdauoQwGR_BLw",
  "episodes": [
    {
      "id": "150bfc64-632b-4e03-a669-ce3677c5c361",
      "title": "Unveiling the Forbidden Bacchanalia: Rome\u0027s Secret Cult Exposed!",
      "description": "Unveiling the Forbidden Bacchanalia: Rome\u0027s Secret Cult Exposed!\nDiscover the shocking secrets behind one of ancient Rome\u0027s most feared and forbidden cults—the Bacchanalia. In this video, we take you on a journey through the mysterious rites of Bacchus, the Roman god of wine, and reveal why these rituals were banned by the Roman Senate. Explore the history, the rituals, and the lasting impact of these clandestine ceremonies that once shook the foundations of the Roman Empire.\n\nIn this video, we cover:\n\nThe origins of the Bacchanalia in ancient Greece and its transformation in Rome.\nThe frenzied, ecstatic rituals that allowed worshippers to commune with Bacchus.\nThe reasons why the Roman Senate considered the Bacchanalia a threat and ultimately banned it.\nThe legacy of Bacchus in modern festivals like Carnival and Mardi Gras.\nWhat the Bacchanalia tells us about human nature and the desire to transcend ordinary life.\nWatch until the end to uncover the terrifying truth behind these ancient rites and their influence on today\u0027s world. Don’t forget to like, comment, and subscribe for more deep dives into history and mythology!\n\nBacchanalia Rome\nForbidden cults\nAncient Roman rituals\nBacchus worship\nRoman Senate Bacchanalia\nDionysian rites\nHistory of Bacchus\nRoman mythology\nSecret cults of Rome\nAncient history mysteries\nAncient Roman mysteries\nCults in Roman history\nRoman festivals\nBacchus and Dionysus\nEcstatic worship\nRoman religious practices\nAncient cults\nSecret societies in Rome\nRoman pagan rituals\nBacchanal festivals",
      "release": "2024-08-13T13:45:06Z",
      "duration": "00:11:09",
      "explicit": false,
      "youTubeId": "ygixzjxuanQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ygixzjxuanQ"
      }
    }
  ]
}