{
  "id": "36001081-90d5-4f83-96c3-58d6b6257bd4",
  "name": "Nacho Fitness Coach",
  "spotifyId": "6jGt1u81Ou7lk3UksYJbHu",
  "appleId": 1666743159,
  "youTubeChannelId": "UCuwpTEotI7_nKwrC3TaaLkA",
  "episodes": [
    {
      "id": "2ec008b6-b0ae-446c-848f-6b69a3861cb1",
      "title": "Fitness Cults: So…This Is Kinda Weird, Right?",
      "description": "This mid-season bonus episode of Nacho Fitness Coach features Kathy Barron, Founder and Editor-in-Chief of Women Who Podcast Magazine and host of the Women Who Sarcast podcast, joining us to talk about one of our favorite uncomfortable topics: fitness cults. We get into how certain fitness programs, brands, and “communities” start out motivational and somehow end up requiring unwavering loyalty, strict rules, and a suspicious lack of questions. Totally normal stuff. We talk about hype culture, influencer authority, and how fitness can quietly shift from something you do into something you’re expected to believe. As always, there are side tangents, sarcasm, and a healthy amount of unserious commentary—but the point still lands: fitness should support your life, not become your personality. And if your workout plan feels more like a belief system than a tool…well. You’re not wrong to think that’s kinda weird. Women Who Podcast Magazine Women Who Podcast Magazine Instagram Women Who Sarcast Instagram Listen to Women Who Sarcast on your favorite podcast platform! Connect with us on social media! Instagram | TikTok | Threads | Youtube | Facebook | X (Twitter) | Website This podcast offers health, fitness, and nutritional information and is designed for educational and entertainment purposes only. You should not rely on this information as a substitute for, nor does it replace professional medical advice, diagnosis, or treatment. If you have any concerns or questions about your health, you should always consult with a physician or other healthcare professional. Do not disregard, avoid, or delay obtaining medical or health-related advice from your healthcare professional because of something you may have heard on this podcast. The use of any information provided by Nacho Fitness Coach podcast is solely at your own risk.",
      "release": "2025-12-17T11:00:00Z",
      "duration": "00:49:52.1080000",
      "explicit": false,
      "spotifyId": "5UbveesdAVrPXmU7x3OFkL",
      "appleId": 1000741667733,
      "youTubeId": "v7unla4XkT8",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5UbveesdAVrPXmU7x3OFkL",
        "apple": "https://podcasts.apple.com/podcast/fitness-cults-so-this-is-kinda-weird-right/id1666743159?i=1000741667733",
        "youtube": "https://www.youtube.com/watch?v=v7unla4XkT8"
      }
    }
  ]
}