{
  "id": "e02b16f6-f0f4-4dda-96c3-bec9e43cec8d",
  "name": "Naija Wifey",
  "youTubeChannelId": "UC-XqRt9f3j9-4Mt-tCgL4vg",
  "episodes": [
    {
      "id": "736fe380-7f5a-45b4-9c05-a2e3571fcba2",
      "title": "How Our Nigerian American Love Helped Us Escape a Cult | Our Intercultural Story (Full Documentary)",
      "description": "What happens when a proud Yoruba woman from Nigeria and an American man from South Carolina fall in love? You get a story so wild, it has to be heard to be believed.\n\nIn this episode of \u0022Our Sweet Wahala,\u0022 we sit down with Anu and Pablo from Familia PablAnu for a deeply honest and emotional conversation about their incredible journey. They share the hilarious story of how they met (it involves a headless rooster!), the cultural clashes they faced, and the massive life decisions that led them from America to Uganda, and finally to their new home in Nigeria with their five children.\n\nBut beneath the surface of their love story was a darker secret. Anu and Pablo open up for the first time about their experience with a controlling family cult, the \u0022red flags\u0022 they missed, and the moment that led them to break free. This is a powerful story of resilience, finding your own path, and the unbreakable bond of a family determined to build a life on its own terms.\n\nIf you are in an intercultural relationship, navigating complex family dynamics, or believe in the power of starting over, this story is for you.\n\nCHAPTERS:\n\n0:00 - Intro \u0026 The Culture Quiz\n05:10 - How We Met: The Headless Rooster\n14:45 - Meeting the Parents \u0026 First Cultural Clashes\n24:30 - Our Health Journey \u0026 The Move to Home Birth\n48:20 - Why We Left America for Africa (The Uganda Story)\n1:01:00 - The Decision to Move to Nigeria\n1:12:15 - Raising Trilingual, Un-Schooled Kids in Nigeria\n1:26:00 - The First Red Flags: \u0022Something Wasn\u0027t Right\u0022\n1:38:40 - The Hijacked Wedding\n1:47:00 - The Awakening: \u0022We Are in a Cult\u0022\n1:52:10 - The Breaking Point \u0026 Finding Freedom\n1:58:00 - Healing, Reconnecting \u0026 Our Final Advice\n\nFOLLOW OUR GUESTS:\n\nThe PablAnu Family on YouTube: @familiapablanu\n\nThe PablAnu Family on Instagram: @familia_pablanu\n\nFOLLOW Naija Wifey:\n\nInstagram: @naija.wifey\n\n\n#InterculturalLove #Yoruba #American #Nigeria #LeavingAmerica #CultSurvivor #FamilyStory #OurSweetWahala #naija #yorubamovie",
      "release": "2025-10-10T17:00:06Z",
      "duration": "01:12:17",
      "explicit": false,
      "youTubeId": "h-YBzEhSvUY",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=h-YBzEhSvUY"
      }
    }
  ]
}