{
  "_ts": 0,
  "id": "fba1bb31-902e-4a5b-8a0b-a2099145ca97",
  "name": "Narcissists, Gaslighters, and Cheaters, Oh My!",
  "spotifyId": "0v27iSjgIXa46AgxI1GbJU",
  "appleId": 1693133172,
  "episodes": [
    {
      "id": "bbfef21b-52d5-4bff-a8a1-51c79e57f347",
      "title": "Covertly Yours, Dick the Charmer",
      "description": "In this episode, we continue the harrowing story of Jena from episode five, who escaped the clutches of a cult only to find herself ensnared in another form of darkness. After leaving the cult, Jena thought she had found solace in the arms of Dick, a man who initially seemed like the perfect partner—comforting, strong, and gentle. They swiftly tied the knot after a year of seemingly blissful companionship.However, the facade began to crumble as Dick insidiously tore apart the very fabric of Jena\u0027s well-being and used her past against her. This episode explores the complexities of coercive control, examining the subtle ways in which emotional abuse can manifest in seemingly loving relationships. Join us as we unravel the layers of Jena\u0027s experience, shedding light on the silent struggles faced by survivors of cults and those ensnared in toxic relationships.Discussions in this episode:Pick back up with JenaWhy being called strong pisses her offMeeting Dick the charmerThe blissful slow burn to the truthThe unraveling of insidious abuseHow she broke freeA peaceful existenceListeners will gain insights into the signs of covert abuse, the psychological toll it takes, and the strength it requires to break free from the chains of manipulation. Jena\u0027s story is a testament to resilience and the indomitable spirit that empowers survivors to reclaim their lives. Don\u0027t miss this eye-opening episode as we navigate through the shadows to find the strength within.Content Warning: This episode discusses various forms of toxic abuse, narcissistic abuse, spousal abuse, rape, and any topics that may disturb some listeners. Listener discretion is advised. We are not doctors or therapists; you should not take our opinions as medical advice.Have a story you would like to share? Please fill out our form.Would you like to help support the show more? Donate or subscribe to our Patreon for exclusive content.Hosts: Behk \u0026 LAHFollow us on Instagram \u002B Facebook @ngcompodProduction \u0026 Design: LAHardenMusic: No Reason Why by Anchor Help us keep the show going on Patreon Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-02-07T06:00:17Z",
      "duration": "01:33:39.1210000",
      "explicit": true,
      "spotifyId": "1kdrix48sUQ3KlGp2pDlD3",
      "appleId": 1000644443167,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1kdrix48sUQ3KlGp2pDlD3",
        "apple": "https://podcasts.apple.com/podcast/covertly-yours-dick-the-charmer/id1693133172?i=1000644443167"
      }
    },
    {
      "id": "74b61f37-9271-4a83-9fc6-d91ddd51d8d9",
      "title": "Abusive Culty Toxicity",
      "description": "In this gripping episode, we dive into the harrowing journey of Jena, a survivor who grew up in a cobbled-together toxic Christiany cult. The cult\u0027s roots trace back to Southern California before its leader convinced the members to uproot their lives and relocate to the Bible Belt, White House, TN.Jena shares the chilling details of her upbringing within the cult, where a rigid doctrine based on perfection and blind obedience dominated every aspect of life. As a survivor of sexual abuse, she courageously opens up about the traumatic experiences she endured at the hands of the cult\u0027s leaders and members.Discussions in this episode:Meet JenaRelocating to CA and joining the “church”Childhood controlled by the cult400\u002B members migrate to the Bible BeltTrauma of it allExposing and escaping the abusive cultSurviving the stress of the news circusAs Jena transitioned into young adulthood, she found the strength to expose the cult and take legal action against them. Her brave pursuit of justice involved filing lawsuits for rapes, molestations, underage marriage, and a web of cover-ups that extended through generations within the congregation, often comprised of tightly-knit family members.Join us as Jena recounts her journey from darkness to light, shedding light on the complexities of escaping a manipulative cult, seeking justice, and ultimately reclaiming her life. This episode serves as a powerful testament to resilience, courage, and the human spirit\u0027s ability to break free from oppressive environments.Content Warning: This episode discusses various forms of toxic abuse, narcissistic abuse, child abuse, rape, religious abuse, and any topics that may disturb some listeners. Listener discretion is advised.We are not doctors or therapists; you should not take our opinions as medical advice.Have a story you would like to share? Please fill out our form.Would you like to help support the show more? Donate or subscribe to our Patreon for exclusive content.Hosts: Behk \u0026 LAHFollow us on Instagram \u002B Facebook @ngcompodProduction \u0026 Design: LAHardenMusic: No Reason Why by Anchor Help us keep the show going on Patreon Hosted on Acast. See acast.com/privacy for more information.",
      "release": "2024-01-31T06:00:16Z",
      "duration": "01:00:25.8220000",
      "explicit": true,
      "spotifyId": "6KRF9K2ltHUm3O8BNbQa3i",
      "appleId": 1000643620340,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6KRF9K2ltHUm3O8BNbQa3i",
        "apple": "https://podcasts.apple.com/podcast/abusive-culty-toxicity/id1693133172?i=1000643620340"
      }
    }
  ]
}