{
  "_ts": 0,
  "id": "0ae97be5-a4d6-43da-9ce3-f5f1af01e469",
  "name": "Narcissist Apocalypse",
  "spotifyId": "3MYWa9mrMlN3FSTLiFkK7F",
  "appleId": 1452117002,
  "episodes": [
    {
      "id": "027ea2da-1b59-4f56-96f4-7e498997668f",
      "title": "Tahiry \u0026 The Controlling Spiritual Abuser - Narcissist Abuse, Domestic Violence",
      "description": "Tahiry was in a long-distance relationship with a spiritual leader, but it wasn\u0027t until they moved in with each other that Tahiry started learning about his controlling and abusive behavior. As Tahiry did her best to cope with the abuse, she uncovered that her partner was also a sexual predator, using her as cover as he assaulted women in the spiritual community. It\u0027s a story of facades, being used, spiritual abuse, blame shifting, putdowns, sexual assault, addiction, hierarchies, predatory behavior, ptsd, and guilt by association. *** CONTENT WARNING - This episode discusses physical abuse and sexual assault. *** If you want to be a guest on our survivor story podcast, please click here or send us an email at narcissistapocalypse@gmail.com To help out our podcast, please fill out our listener survey, click here.  Thank you to our sponsor BETTERHELP. If you need online counseling from anywhere in the world, please do go to https://www.betterhelp.com/nap Get started today and enjoy 10% off your first month. If you or someone you know are experiencing abuse, you are not alone. DomesticShelters.org offers an extensive library of articles and resources that can help you make sense of what you\u0027re experiencing, connect you with local resources and find ways to heal and move forward. Visit www.domesticshelters.org to access this free resource.  If you need help moving due to domestic violence, Shelter Movers may be able to help you. They operate by referral. Clients may be referred by any person of authority (social worker, doctor, police, crisis counselor, teacher, etc.) or public agency (shelter, hospital, school, workplace, place of worship, sexual assault centre, etc.).  To reach them, click here.   Join our new Community Social Network at https://community.narcissistapocalypse.com/  Join our Instagram Channel at https://www.instagram.com/narcissistapocalypse  Join our Youtube Channel at https://www.youtube.com/channel/UCpTIgjTqVJa4caNWMIAJllA Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-23T00:00:00",
      "duration": "00:38:21.7270000",
      "explicit": true,
      "spotifyId": "5qezDCGjjH563kW4wPVw9C",
      "appleId": 1000635886387,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qezDCGjjH563kW4wPVw9C",
        "apple": "https://podcasts.apple.com/podcast/tahiry-the-controlling-spiritual-abuser-narcissist/id1452117002?i=1000635886387"
      }
    },
    {
      "id": "35f7980f-ee2f-4e9a-b3ae-dda000c80ed9",
      "title": "Cults \u0026 The Bite Model of Authoritarian Control - Narcissist Apocalypse Q\u0026A With Kacey Cult Vault",
      "description": "Brandon talks with Kacey from the Cult Vault Podcast about the different types of cults, coercive control, and the Bite Model of authoritarian control. Plus, they talk about the emergence of headless cults through online communities. To listen to the Cult Vault Podcast, click here. If you want to be a guest on our survivor story podcast, please click here or send us an email at narcissistapocalypse@gmail.com  To listen to the groundbreaking investigative true crime podcast about Munchausen by Proxy, NOBODY SHOULD BELIEVE ME, click here. Thank you to our sponsor BETTERHELP. If you need online counseling from anywhere in the world, please do go to https://www.betterhelp.com/nap Get started today and enjoy 10% off your first month.  If you or someone you know are experiencing abuse, you are not alone. DomesticShelters.org offers an extensive library of articles and resources that can help you make sense of what you\u0027re experiencing, connect you with local resources and find ways to heal and move forward. Visit www.domesticshelters.org to access this free resource.  If you need help moving due to domestic violence, Shelter Movers may be able to help you. They operate by referral. Clients may be referred by any person of authority (social worker, doctor, police, crisis counselor, teacher, etc.) or public agency (shelter, hospital, school, workplace, place of worship, sexual assault centre, etc.).  To reach them, click here.   Join our new Community Social Network at https://community.narcissistapocalypse.com/  Join our Instagram Channel at https://www.instagram.com/narcissistapocalypse  Join our Youtube Channel at https://www.youtube.com/channel/UCpTIgjTqVJa4caNWMIAJllA Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-07-07T00:00:00",
      "duration": "00:54:09.9460000",
      "explicit": false,
      "spotifyId": "5PwLLlqSx989gfy2xeiKgD",
      "appleId": 1000619734886,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5PwLLlqSx989gfy2xeiKgD",
        "apple": "https://podcasts.apple.com/podcast/cults-the-bite-model-of-authoritarian-control/id1452117002?i=1000619734886"
      }
    }
  ]
}