{
  "id": "59840149-18c1-4425-8365-269a10c17251",
  "name": "Narcissism Summaries",
  "youTubeChannelId": "UCo7boSvuLLhD-Ql8ZK93QiA",
  "episodes": [
    {
      "id": "13e0dfa9-7fb9-440d-bf30-54f550c912b9",
      "title": "Narcissism Is a Schizoid Split — Not Self-Love",
      "description": "Most people believe narcissism means too much self-love.\nObject relations theory reveals the opposite.\n\nDrawing on the work of W. R. D. Fairbairn and Harry Guntrip, and clarified by Jay R. Greenberg and Stephen A. Mitchell, this lecture exposes why narcissism is best understood as a schizoid split of the self — not grandiosity, not confidence, and certainly not love.\n\nYou’ll discover:\n• Why narcissism is rooted in withdrawal, not entitlement\n• How emotional emptiness, alienation, and unreality emerge from a split ego\n• Why American psychology calls it narcissism while British analysts call it schizoid personality disorder\n• How excessive attachment to internal objects replaces real relationships\n• Why modern society produces the lone wolf narcissist\n\nThe final section explores the most dangerous outcome of this process:\nthe isolated, paranoid, grandiose lone wolf narcissist — a figure seen in cult leaders, extremists, and radicalized individuals such as Ted Kaczynski and Charles Manson.\n\nThis is not a moral lecture.\nIt is a structural explanation of why narcissists withdraw — and what it does to society.\n\nFull video with:\nSUMMARY - https://vakninsummaries.com/narcissistinsane-you-envy-withdrawal-loner-narcissist/ \nTRANSCRIPTS - https://vaknintranscripts.com/2020/10/11/narcissistinsane-you-envy-withdrawal-loner-narcissist-2/ \n\nProf. Vaknin\u0027s YouTube channel: https://www.youtube.com/@samvaknin \n\n🔴 LIVE ANNOUNCEMENT\n\n📅 January 5 – LIVE with Prof. Sam Vaknin\n⏰ 2 hours – Open Q\u0026A \u002B 1 hour Members-Only Personal Advice\n📍 Narcissism Summaries YouTube Channel \n\nSuggested solution quote by Prof. Vaknin:\n\u0022Envy is the hallmark of narcissism and the prime source of what is known as narcissistic rage. The schizoid self – fragmented, weak, primitive – is intimately connected with narcissism through envy. Narcissists prefer to destroy themselves and to deny themselves rather than endure someone else\u0027s happiness, wholeness and \u0022triumph\u0022.\n\nThe narcissist fail his exams in order to frustrate the teacher he adores and envies. He aborts his therapy in order not to give the therapist a reason to feel gratified. By self-defeating and self-destructing, narcissists deny the worth of others. If the narcissist fails in therapy – his analyst must be inept. If he destroys himself by consuming drugs – his parents are blameworthy and should feel guilty and bad. One cannot exaggerate the importance of envy as a motivating power in the narcissist\u0027s life.\n\nThe psychodynamic connection is obvious. Envy is a rage reaction to not controlling or \u0022having\u0022 or engulfing the good, desired object. Narcissists defend themselves against this acidulous, corroding sensation by pretending that they do control, possess and engulf the good object. This are the narcissist\u0027s \u0022grandiose fantasies (of omnipotence or omniscience)\u0022.\n\nBut, in doing so, the narcissist must deny the existence of any good outside himself. The narcissist defends himself against raging, all consuming envy – by solipsistically claiming to be the only good object in the world. This is an object that cannot be had by anyone, except the narcissist and, therefore, is immune to the narcissist\u0027s threatening, annihilating envy.\n\nIn order to refrain from being \u0022owned\u0022 by anyone (and, thus, avoid self-destruction in the hands of his own envy), the narcissist reduces others to \u0022non-entities\u0022 (the narcissistic solution), or completely avoids all meaningful contact with them (the schizoid solution).\u0022\n\n#Narcissism #Schizoid #ObjectRelations #NarcissisticWithdrawal #Psychology #MentalHealth #LoneWolfNarcissist #personalitydisorders \n \nschizoid narcissism, object relations theory narcissism, lone wolf narcissist, narcissistic withdrawal phase, narcissist emotional withdrawal, narcissism and schizoid split",
      "release": "2025-12-27T16:00:48Z",
      "duration": "00:12:08",
      "explicit": false,
      "youTubeId": "Si9byv3xWyo",
      "subjects": [
        "Manson Family",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Si9byv3xWyo"
      }
    }
  ]
}