{
  "_ts": 0,
  "id": "fd2095e6-528b-41b1-8fc0-9d659d28c0a6",
  "name": "NARM Training Institute",
  "youTubeChannelId": "UCezENiBJtJQwTAw2wNomLVg",
  "episodes": [
    {
      "id": "5d1c124c-6c51-4b43-bfd7-764bfa956c06",
      "title": "Continuing the Conversation of Traumatic Narcissism and Recovery with Daniel Shaw",
      "description": "We’ve invited Daniel Shaw back to have a conversation with our host, Emily, to further discuss his work and his most recent book, Traumatic Narcissism and Recovery: Leaving the Prison of Shame and Fear.\r\n\r\n Daniel Shaw LCSW is an author, private practice psychoanalyst, faculty and supervisor at the National Institute for the Psychotherapies. He has provided professional counseling for former cultic group members, and their friends and loved ones since 1994. \r\n\r\n Daniel shares that he wants listeners to understand the ways that we become alienated from ourselves because of trauma and the internal antagonism between the part that wants to live, and the part that wants to shut down life. He also shares, “We within ourselves, have healing capacities, we have healing energy. That’s innate.” \r\n\r\n We hear from Daniel about his influences such as Sensorimotor Psychotherapy, Internal Family Systems, and EMDR, and how these models have supported his understanding of Trauma and the Self. “The benefit of subsequent training in trauma theories has been to understand that within us is always an energy trying to survive and trying to LIVE. We’re not just trying to survive. I think we’re trying to live,” he shares. \r\n\r\n Listen to our first conversation with Daniel on episode 28 of Transforming Trauma.\r\n\r\n  To read the full show notes and discover more resources visit http://www.narmtraining.com/podcast\r\n\r\n  ***\r\n\r\n  NARM Training Institute\r\n\r\n http://www.NARMtraining.com\r\n\r\n View upcoming trainings:\r\n\r\n https://narmtraining.com/schedule\r\n\r\n Join the Inner Circle:\r\n\r\n https://narmtraining.com/online-learning/inner-circle\r\n\r\n ***\r\n\r\n The NARM Training Institute provides tools for transforming complex trauma through: in-person and online trainings for mental health care professionals; in-person and online workshops on complex trauma and how it interplays with areas like addiction, parenting, and cultural trauma; an online self-paced learning program, the NARM Inner Circle; and other trauma-informed learning resources.  \r\n\r\n We want to connect with you!\r\n\r\n Facebook @NARMtraining\r\n\r\n Twitter @NARMtraining\r\n\r\n  YouTube\r\n\r\n  Instagram @thenarmtraininginstitute",
      "release": "2023-03-12T19:51:26Z",
      "duration": "00:51:43",
      "explicit": false,
      "youTubeId": "VgSVQQknPvI",
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=VgSVQQknPvI"
      }
    },
    {
      "id": "d3fcf11a-54d1-44dd-9c1a-7ff017db6f97",
      "title": "Transforming Trauma Episode 028: Traumatic Narcissism: Relational ...of Subjugation w/Daniel Shaw",
      "description": "In this episode of Transforming Trauma, our host Sarah Buino is joined by therapist, social worker, and author Daniel Shaw to discuss his seminal book Traumatic Narcissism: Relational Systems of Subjugation. Daniel explores the theme of traumatic narcissism from a developmental and trauma-informed perspective. In his work, he connects the challenging symptoms and behaviors of clients diagnosed with Bipolar Disorder and Borderline Personality Disorder to the deeper understanding that they were raised in a highly traumatic environment by narcissistic caregivers. His underlying message for listeners is that, “It\u0027s important to understand what\u0027s going on in the mind of the narcissistic traumatizer in order to help patients free themselves from those relationships, in order for therapists to help the patient, and in order for the patients to help themselves.”\n\nDaniel began his research in social work after leaving a religious group that he participated in for thirteen years, and which he later came to identify as a cult. In this group, Daniel experienced traumatic abuse through the cult leader, who “needed to inflate their own narcissism by controlling others.” This dynamic is exactly what he came to see represented in the relational system of the traumatizing narcissist, which he identified as a “system of subjugation.”\n\nUnlike perspectives that can ostracize or vilify narcissistic tendencies, Daniel’s perspective on narcissism is very similar to that of the NeuroAffective Relational Model (NARM). Narcissism is understood to be a common trait that all personalities experience to some degree. While Daniel acknowledges that this trait can be quite harmless, for example “sometimes people are just a little more self centered”, his work focuses on the narcissistic person who is predatory in their behavior, and who seeks to establish relational dynamics in which they can control others “through belittling and intimidating and humiliating.” Daniel describes these individuals as highly seductive at first, and then after their initial phase of seduction others become subjugated to the narcissist. “So that person actually … comes to believe that they are bad and the narcissist is good. And the reason the narcissist is cruel to them is because of their badness.” He goes on to explain that the victim of traumatic narcissism is so affected by this relational system, that it is incredibly difficult to stop blaming themselves or feeling alienated from themselves. \n\nIn a healthy parent-child relationship, the parent honors and understands a child’s natural dependency, and allows them to gradually grow more independent over time through healthy individuation. This healthy individuation celebrates the child’s growing independence, while also allowing the child to come back and check in to re-establish safety as they slowly venture farther and farther into the world. Daniel and Sarah come together with Daniel’s statement that “We are born completely dependent and there\u0027s… no reason on earth why a child should grow up ashamed of that dependency.” However, the narcissist is not brought up in this healthy environment. Narcissistic parents resent the child’s dependency, shame them for it, and create a traumatizing environment in which the child’s dependency on their parent becomes the source of pain and suffering. These children often grow up with one of two outcomes: to become profoundly depressed with low self-esteem, or to take on aspects of this narcissism themselves and recreate relationships with this relational system of power-over and control through humiliation. As Daniel states, the traumatized child can then become the narcissist, who begins “disavowing and denying any kind of dependency, any kind of need, and associating [need] with shame. And then the person that they choose to relate to has to carry that neediness and that shame for them.”\n\nSarah and Daniel discuss the common thread in Daniel’s work and NARM. Much like in NARM, in which the therapists support clients to reconnect with their own agency, Daniel’s intention in working with people that have experienced narcissistic abuse is to help them “retrieve a faith in themselves that has been taken from them by the narcissistic abuser.” In both NARM and Daniel’s work, the therapist supports the client to raise their awareness of what has become internalized from their childhood abuse, including the vicious ways that these clients often degenerate and belittle themselves throughout their lives. This is a  “powerful moment” in the therapeutic process, as the client begins to recognize that they themselves have taken on the role of their abuser through their own self-objectification. \n\nFull podcast description : https://narmtraining.com/transformingtrauma/episode-028/",
      "release": "2021-06-15T14:31:08Z",
      "duration": "00:48:59",
      "explicit": false,
      "youTubeId": "sKa4V8hVAA8",
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sKa4V8hVAA8"
      }
    }
  ]
}