{
  "_ts": 0,
  "id": "dfd2c87a-ac8a-4762-a018-dd3198a92a74",
  "name": "National Writers Series",
  "spotifyId": "7jXpvUUCTCOdtHCfmbzghd",
  "appleId": 1551179105,
  "youTubeChannelId": "UC75R7GPHWqMlE87HTm2aN9w",
  "episodes": [
    {
      "id": "f156bb60-2a82-40c1-adb4-90539d1f29cb",
      "title": "NWS Presents: Twin Flames—Burned!  A Survivor and Cult Expert Speak Out",
      "description": "Northern Michiganders were stunned when two major documentaries appeared about Twin Flames Universe, a self-help and wellness cult, with its leaders stationed in Suttons Bay.\n\nThe depth of emotional pain expressed by former members was hard to watch and raised more questions than it answered. What exactly is a cult? What is the seductive draw that entraps people? Can law enforcement play a role even when people voluntarily fork over their savings and agree to work for nearly nothing?\n\nKeely Griffin is a survivor of Twin Flames Universe and will talk on the NWS stage about her journey into the online group with the goal of  improving her life, relationships and finding her “twin flame.” After three years, she left the cult, losing everything, including her career, savings, and beloved sister, whom she encouraged to join TFU. Keely, who shared her experience inside the TFU cult in the Netflix documentary, “Escaping Twin Flames,” aspires to help survivors in the legal system.\n\nKeely will appear with Dr. Janja Lalich, author of “Take Back Your Life: Recovering from Cults and Abusive Relationships.” Her book includes advice for those who have escaped cults and eye-opening accounts of those who joined to grow spiritually, only to realize that the charismatic leader was engaged in criminal conspiracy, polygamy, slave labor, and sexual abuse of members, including minors.\n\nWe owe our success to generous sponsors, donors, volunteers, and friends… people like you! To support our efforts, please visit: \n\nhttps://nationalwritersseries.org/donate-and-support/\n\nWho\u0027s coming to the National Writers Series next? Check out our upcoming events:\nhttps://nationalwritersseries.org/upcoming-events/\n\nEverything we do is to help raise young writers around Northern Michigan. Learn more about our classes, scholarships, and other efforts here:\nhttps://nationalwritersseries.org/raising-writers/",
      "release": "2024-03-23T17:14:20Z",
      "duration": "01:25:10",
      "explicit": false,
      "youTubeId": "pU-fs5Vk-oY",
      "subjects": [
        "Twin Flames Universe",
        "Cult-Expert"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pU-fs5Vk-oY"
      }
    }
  ]
}