{
  "_ts": 0,
  "id": "910e98af-364f-4b32-beb7-3155fc9f47ee",
  "name": "National Park After Dark Podcast",
  "spotifyId": "5AenIJ6TA3JjWkqacYEBWL",
  "appleId": 1549433407,
  "youTubeChannelId": "UCl1CiUmO3ZOCtQiyeCVObTA",
  "episodes": [
    {
      "id": "bcca91f6-5a05-44cc-9b15-99e261e7275b",
      "title": "163: Forager. Field Notes for Surviving A Cult with Michelle Dowd",
      "description": "Today we speak with Michelle Dowd, the author of the newly released book, Forager. Field Notes for Surviving a Cult. Michelle was raised within the boundaries of Angeles National Forest inside of a religious cult her grandfather created. She was raised to believe that the end of the world was near and in turn, was taught to forage off the land, navigate by the stars, and survive. After enduring years of abuse, she finally escaped. Now, after years of healing and moving forward with her life, she has put out a book detailing her story. In this episode, we all get the chance to know Michelle as we discuss her book, her past, and where she is at in her life today.\n\n\n\nYou can buy Michelle\u0027s book here (https://www.amazon.com/Forager-Field-Surviving-Family-Memoir/dp/1643751859)  or at your local bookstore.\n\n\n\nWe love our National Parks and we know you do too but when you\u0027re out there, remember to enjoy the view but watch your back. Please take a moment to rate and subscribe from wherever you’re listening to NPAD! Become part of our Outsider family on Patreon (https://www.patreon.com/npadpodcast)   or Apple Subscriptions (https://t.co/ivJuzIBtuQ)  to gain access to ad-free episodes, bonus content, and more. Follow our socials Instagram (https://www.instagram.com/nationalparkafterdark) , Facebook (https://www.facebook.com/npafterdarkpodcast) , and Twitter (https://twitter.com/npadpodcast) . To share a Trail Tale, suggest a story, access merch, and browse our book recommendations - head over to our website (https://www.npadpodcast.com/) .\n\n\n\nThank you so much to our partners, check them out!\n\nEmbrace Pet Insurance (https://embracepetinsurance.com/npad) : Use our link to sign up for pet insurance today! \n\nMicrodose Gummies (https://www.microdose.com/) : Use code NPAD to get free shipping and 30% off your first order.\n\nMiracle Made (https://trymiracle.com/npad) : Use our link and code NPAD to save over 40% and get 3 free towels.",
      "release": "2024-08-21T14:06:18Z",
      "duration": "01:26:04",
      "explicit": false,
      "spotifyId": "0mgjST3cVheXWZ4DxHAyWX",
      "appleId": 1000622094675,
      "youTubeId": "0O_CsEQoqPo",
      "subjects": [
        "Kare Youth League"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0mgjST3cVheXWZ4DxHAyWX",
        "apple": "https://podcasts.apple.com/podcast/forager-field-notes-for-surviving-a-cult-with-michelle-dowd/id1549433407?i=1000622094675",
        "youtube": "https://www.youtube.com/watch?v=0O_CsEQoqPo"
      }
    }
  ]
}