{
  "id": "41642f0a-9856-4c55-a16e-1ee9ea72f966",
  "name": "Native Land Pod",
  "spotifyId": "43HHSELDOVMiqc9ZcYD93H",
  "appleId": 1724078118,
  "youTubeChannelId": "UCPwDm9ID1xdHlHnkYDizCCA",
  "episodes": [
    {
      "id": "ddff2203-04a9-46bc-8bb7-3166386e7711",
      "title": "Why this Conservative Evangelical Pastor Changed Sides | NLP Replay",
      "description": "What role have white evangelicals played in the current struggle against fascism? Once a political actor tasked with influencing SCOTUS to overturn Roe v. Wade, Reverend Schenck has since come to regret his involvement with the religious right, which he describes as a “cult.” He now calls himself a “dissenting Evangelical organizer.” Our hosts ask the reverend what brought him around. Join hosts Angela Rye, Andrew Gillum, and Bakari Sellers PLUS guest-host Tamika Mallory for this segment from episode #117 that aired 02-05-26 If you’d like to submit a question, check out our tutorial video: www.instagram.com/reel/C5j_oBXLIg0/ Welcome home y’all! —--------- We want to hear from you! Send us a video @nativelandpod and we may feature you on the podcast. Instagram X/Twitter Facebook NativeLandPod.com Watch full episodes of Native Land Pod here on YouTube . Native Land Pod is brought to you by Reasoned Choice Media. Thank you to the Native Land Pod team: Angela Rye as host, executive producer, and cofounder of Reasoned Choice Media; Andrew Gillum as host and producer, Bakari Sellers as host and producer, and Lauren Hansen as executive producer; LoLo Mychael is our research producer, and Nikolas Harter is our editor and producer. Special thanks to Chris Morrow and Lenard McKelvey, co-founders of Reasoned Choice Media. Theme music created by Daniel Laurent . See omnystudio.com/listener for privacy information.",
      "release": "2026-02-08T12:00:00Z",
      "duration": "00:35:12.4700000",
      "explicit": true,
      "spotifyId": "6sZaiGdU0gWlTGbgWEFFpB",
      "appleId": 1000748767811,
      "subjects": [
        "Political Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6sZaiGdU0gWlTGbgWEFFpB",
        "apple": "https://podcasts.apple.com/podcast/why-this-conservative-evangelical-pastor-changed-sides/id1724078118?i=1000748767811"
      }
    },
    {
      "id": "626b34a7-f748-430b-a029-9aa1a7658efd",
      "title": "Confessions of a White Evangelical feat. Reverend Schenck | Native Land Pod 117",
      "description": "On episode 117 of Native Land Pod, hosts Angela Rye, Andrew Gillum, and Bakari Sellers are joined by guest-host, Tamika Mallory. \n\nTamika Mallory is an attorney and activist, co–host of the TMI podcast, perhaps best known for organizing the 2017 Women’s march. She continues her work as an author and organizer online @tamikadmallory on Instagram. \n\nOur guest today is Reverend Dr. Robert Schenck. \n\nWhat role have white evangelicals played in the current struggle against fascism? Once a political actor tasked with influencing SCOTUS to overturn Roe v. Wade, Reverend Schenck has since come to regret his involvement with the religious right, which he describes as a “cult.” He now calls himself a “dissenting Evangelical organizer.” Our hosts ask the reverend what brought him around. \n\nFor Your Situational Awareness:\n\n– Country Music Artist Jelly Roll Gives an Emotional Grammys Speech\n\n– Secretary of War Meets with Jeff Bezos after Melania movie bribe\n\n– Powerful Testimony from Woman Pulled Out of Her Car by ICE\n\n– Update on Don Lemon / Georgia Fort Arrests\n\n– Epstein Files, Melinda French Gates Responds to Salacious Claims about Her Ex-Husband\n\nVote for NLP at the NAACP Image Awards: https://vote.naacpimageawards.net/categories/c1b34c1a-5f52-4d43-a442-08de2c5a3e90/entrants\n\n\nIf you’d like to submit a question, check out our tutorial video: http://www.instagram.com/reel/C5j_oBXLIg0/ and send to @nativelandpod. \n\nWe are 277 days away from the midterm elections. Welcome home y’all! \n\nContents:\n00:00:00 Start\n00:02:27 FYSA Headlines\n00:21:10 ICE Victims Testify to Congress\n00:37:25 Rev Rob Schenck \u0026 White Evangelicals\n01:12:00 CTAs\n—---------\n\n\nAs always, we want to hear from you. Send us a video @nativelandpod and we may feature you on the podcast.\n\nInstagram: https://www.instagram.com/nativelandpod/\nX/Twitter: https://twitter.com/nativelandpod\nFacebook: https://www.facebook.com/p/Native-Land-Pod-61555252803861/\n\nSubscribe and listen to new episodes of Native Land Pod every Thursday wherever you get your podcasts:\niHeartPodcasts: https://www.iheart.com/podcast/1119-native-land-pod-137190860/\nApple Podcasts: https://podcasts.apple.com/us/podcast/native-land-pod/id1724078118\nSpotify: https://open.spotify.com/show/43HHSELDOVMiqc9ZcYD93H?si=1oBFL1QgS6-15Y1hgiXQ1Q\n\nThank you to the Native Land Pod team: \n\nAngela Rye as host, executive producer, and cofounder of Reasoned Choice Media; Andrew Gillum as host and producer, Bakari Sellers as host and producer, and Lauren Hansen as executive producer; LoLo Smith is our research producer, and Nikolas Harter is our editor and producer. Special thanks to Chris Morrow and Lenard McKelvey, co-founders of Reasoned Choice Media. \n\nTheme music created by Daniel Laurent. https://www.daniellaurent.com",
      "release": "2026-02-05T21:50:06Z",
      "duration": "01:18:39",
      "explicit": false,
      "spotifyId": "0Qnkb4BDNTdavZH5Y3ZVkl",
      "appleId": 1000748365159,
      "youTubeId": "KtbzivuzMNk",
      "subjects": [
        "Political Cult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Qnkb4BDNTdavZH5Y3ZVkl",
        "apple": "https://podcasts.apple.com/podcast/confessions-of-a-white-evangelical/id1724078118?i=1000748365159",
        "youtube": "https://www.youtube.com/watch?v=KtbzivuzMNk"
      }
    }
  ]
}