{
  "id": "bebb8e80-c0fb-4b57-aa94-c5cf87076f63",
  "name": "Navigating Narcissism",
  "spotifyId": "2fUMDuTaHJrIhIeybVIfCz",
  "appleId": 1629909313,
  "youTubeChannelId": "UCNIdqrYztUJ6FEppTOi2mDw",
  "episodes": [
    {
      "id": "d1fcbff3-4d1d-45ea-a516-0b8563325b0d",
      "title": "The Untold Story of the Cult at Sarah Lawrence College - Pt 2 with Felicia Rosario",
      "description": "Felicia Rosario was a brilliant graduate of Harvard and Columbia when she was introduced to Larry Ray. Little did she know, her life would soon be destroyed by the man who had started a sadistic cult in his daughter’s dorm at Sarah Lawrence College. Now, Felicia is revealing never-before-heard details of her decade-long relationship with Ray and how she helped put him behind bars for 60 years. Watch and Subscribe to our YouTube Channel @NavigatingNarcissismPod Follow me on social:   Instagram - @doctorramani Pod Instagram - @navigatingnarcissismpod Facebook - @doctorramani Twitter - @DoctorRamani YouTube: Dr. Ramani’s YT - DoctorRamani  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com. I just might answer your questions on air. Guest Bio: Felicia Rosario was born in New York to immigrants from the Dominican Republic. She attended Harvard College and then Columbia University College of Physicians and Surgeons. She matched in psychiatry at the University of Southern California. She met Lawrence Ray in 2011 through her brother, a student at Sarah Lawrence College. Larry manipulated and enslaved Felicia for almost ten years. After his arrest in 2020, Felicia testified at his 2022 trial. Felicia is now a management consultant. She teaches SAT to underprivileged students in her spare time. She hopes to return to medicine and one day specialize in forensic psychiatry. Guest Information:  Instagram - @feliciarosario_official  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a healthcare professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. EXECUTIVE PRODUCERS Jada Pinkett Smith, Ellen Rakieten, Dr. Ramani Durvasula, Meghan Hoffman VP PRODUCTION OPERATIONS Martha Chaput CREATIVE DIRECTOR Jason Nguyen LINE PRODUCER Lee Pearce PRODUCER Matthew Jones, Aidan Tanner ASSOCIATE PRODUCER Mara De La Rosa ASSOCIATE CREATIVE PRODUCER Keenon Rush HAIR AND MAKEUP ARTIST Samantha Pack AUDIO ENGINEER Calvin Bailiff EXEC ASST Rachel Miller PRODUCTION OPS ASST Jesse Clayton EDITOR Eugene Gordon Eric Tome POST MEDIA MANAGER Luis E. Ackerman POST PROD ASST Moe Alvarez AUDIO EDITORS \u0026 MIXERS Matt Wellentin, Geneva Wellentin, VP, HEAD OF PARTNER STRATEGY Jae Trevits Digital MARKETING DIRECTOR Sophia Hunter VP, POST PRODUCTION Jonathan Goldberg SVP, HEAD OF CONTENT Lukas Kaiser HEAD OF CURRENT Christie Dishner VP, PRODUCTION OPERATIONS Jacob Moncrief EXECUTIVE IN CHARGE OF PRODUCTION Dawn ManningSee omnystudio.com/listener for privacy information.",
      "release": "2023-08-03T00:00:00",
      "duration": "01:45:23.2260000",
      "explicit": false,
      "spotifyId": "41SFjuT4zTsNC0ppZEnfWx",
      "appleId": 1000623281229,
      "youTubeId": "ty4JnkTSUQs",
      "urls": {
        "spotify": "https://open.spotify.com/episode/41SFjuT4zTsNC0ppZEnfWx",
        "apple": "https://podcasts.apple.com/podcast/the-untold-story-of-the-cult-at-sarah-lawrence-college/id1629909313?i=1000623281229",
        "youtube": "https://www.youtube.com/watch?v=ty4JnkTSUQs"
      }
    },
    {
      "id": "db499495-cbcf-4bb9-adf3-864eeeaea7af",
      "title": "The Untold Story of the Cult at Sarah Lawrence College - Pt 1 with Daniel Levin",
      "description": "Larry Ray was recently sentenced to 60 years for heinous crimes he committed while running a sadistic cult that began in his daughter’s dorm at the prestigious Sarah Lawrence College. Now, Daniel Levin, who survived years of torture, manipulation, sexual abuse and testified against Ray is revealing new details about what he endured. Watch and Subscribe to our YouTube Channel @NavigatingNarcissismPod Follow me on social:   Instagram - @doctorramani Pod Instagram - @navigatingnarcissismpod Facebook - @doctorramani Twitter - @DoctorRamani YouTube: Dr. Ramani’s YT - DoctorRamani  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com. I just might answer your questions on air. Guest Bio: Daniel Barban Levin holds an MFA in poetry from UC-Irvine. Nylon called his memoir SLONIM WOODS 9 (Crown) about surviving the abusive cult which began at Sarah Lawrence “a disturbing, extremely vulnerable and extraordinary account of what happened to Levin and the emotional and psychological fallout.” He executive produced the documentary STOLEN YOUTH (Hulu) which the New Yorker described as “…a remarkable work, advancing the prestige true-crime genre’s slow but steady reorientation toward centering victims.” He lives and writes in Los Angeles and teaches continuing education students how to translate difficult memories into powerful stories through Stanford University. Guest Information:  Website - https://danielbarbanlevin.com/about-2/  Instagram - @danielbarbanlevin Twitter - @DanBarbanLevin  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a healthcare professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. EXECUTIVE PRODUCERS Jada Pinkett Smith, Ellen Rakieten, Dr. Ramani Durvasula, Meghan Hoffman VP PRODUCTION OPERATIONS Martha Chaput CREATIVE DIRECTOR Jason Nguyen LINE PRODUCER Lee Pearce PRODUCER Matthew Jones, Aidan Tanner ASSOCIATE PRODUCER Mara De La Rosa ASSOCIATE CREATIVE PRODUCER Keenon Rush HAIR AND MAKEUP ARTIST Samantha Pack AUDIO ENGINEER Calvin Bailiff EXEC ASST Rachel Miller PRODUCTION OPS ASST Jesse Clayton EDITOR Eugene Gordon Eric Tome POST MEDIA MANAGER Luis E. Ackerman POST PROD ASST Moe Alvarez AUDIO EDITORS \u0026 MIXERS Matt Wellentin, Geneva Wellentin, VP, HEAD OF PARTNER STRATEGY Jae Trevits Digital MARKETING DIRECTOR Sophia Hunter VP, POST PRODUCTION Jonathan Goldberg SVP, HEAD OF CONTENT Lukas Kaiser HEAD OF CURRENT Christie Dishner VP, PRODUCTION OPERATIONS Jacob Moncrief EXECUTIVE IN CHARGE OF PRODUCTION Dawn ManningSee omnystudio.com/listener for privacy information.",
      "release": "2023-07-27T00:00:00",
      "duration": "01:31:26.5500000",
      "explicit": false,
      "spotifyId": "69NIgL8OHGVyHpBWb9RvZp",
      "appleId": 1000622488197,
      "youTubeId": "bvv43HecQ60",
      "urls": {
        "spotify": "https://open.spotify.com/episode/69NIgL8OHGVyHpBWb9RvZp",
        "apple": "https://podcasts.apple.com/podcast/the-untold-story-of-the-cult-at-sarah-lawrence-college/id1629909313?i=1000622488197",
        "youtube": "https://www.youtube.com/watch?v=bvv43HecQ60"
      }
    },
    {
      "id": "6dac5a40-e4e7-44cb-821f-928a0836708a",
      "title": "Twin Flame Relationships: Healthy or Abusive? With Candace Moon",
      "description": "Twin Flame online communities say they’re helping people search for their perfect partner, but have recently ignited controversy with members revealing shocking allegations of being encouraged to stay in abusive relationships. One of those members, Candace Moon, opens about what she refers to as “glamorized narcissistic abuse” within these groups. Watch and Subscribe to our YouTube Channel @NavigatingNarcissismPod Follow me on social:   Instagram - @doctorramani Pod Instagram - @navigatingnarcissismpod Facebook - @doctorramani Twitter - @DoctorRamani YouTube: Dr. Ramani’s YT - DoctorRamani  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com. I just might answer your questions on air. Guest Bio: Candace is a trauma recovery coach, a writer, a mom of two amazing sons, a mom of two adorable Corgis, and a domestic violence survivor. She offers trauma coaching for survivors and helps them create happy \u0026 healthy relationships on their own terms. Her mission is to support, advocate and hold a safe healing space for victims of narcissistic abuse and domestic violence. She is dedicated to standing up for survivors, helping raise their voices, and facilitating profound healing and peace. She has trained extensively in the holistic healing arts and personal development for over a decade. She gets it in a way that only someone who has been through it could. She knows the struggle and also knows how to help you come to peace. Guest Information:  Instagram - @unliving.the.lie Twitter - @CandaceRanee TikTok - candace.ranee.moon  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a healthcare professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. EXECUTIVE PRODUCERS Jada Pinkett Smith, Ellen Rakieten, Dr. Ramani Durvasula, Meghan Hoffman VP PRODUCTION OPERATIONS Martha Chaput CREATIVE DIRECTOR Jason Nguyen LINE PRODUCER Lee Pearce PRODUCER Matthew Jones, Aidan Tanner ASSOCIATE PRODUCER Mara De La Rosa ASSOCIATE CREATIVE PRODUCER Keenon Rush HAIR AND MAKEUP ARTIST Samatha Pack AUDIO ENGINEER Calvin Bailiff EXEC ASST Rachel Miller PRODUCTION OPS ASST Jesse Clayton EDITOR Eugene Gordon POST MEDIA MANAGER Luis E. Ackerman POST PROD ASST Moe Alvarez AUDIO EDITORS \u0026 MIXERS Matt Wellentin, Geneva Wellentin, VP, HEAD OF PARTNER STRATEGY Jae Trevits Digital MARKETING DIRECTOR Sophia Hunter VP, POST PRODUCTION Jonathan Goldberg SVP, HEAD OF CONTENT Lukas Kaiser HEAD OF CURRENT Christie Dishner VP, PRODUCTION OPERATIONS Jacob Moncrief EXECUTIVE IN CHARGE OF PRODUCTION Dawn ManningSee omnystudio.com/listener for privacy information.",
      "release": "2023-06-29T00:00:00",
      "duration": "01:18:54.6410000",
      "explicit": false,
      "spotifyId": "1I9vUHpPSGOWgzkQTseXtH",
      "appleId": 1000618716890,
      "youTubeId": "f_reFCZJx8Y",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1I9vUHpPSGOWgzkQTseXtH",
        "apple": "https://podcasts.apple.com/podcast/twin-flame-relationships-healthy-or-abusive-with/id1629909313?i=1000618716890",
        "youtube": "https://www.youtube.com/watch?v=f_reFCZJx8Y"
      }
    },
    {
      "id": "79f66877-b4f2-4398-a9bc-5a3743e01c6f",
      "title": "What is a Cult? With Dr. Janja Lalich",
      "description": "Dr. Janja Lalich, the world’s foremost expert on cults, reveals the four principles all cults share, how she survived ten years in a brutal cultic system and how these groups continue to abuse while evading authorities. Dr. Janja also shares an important warning on how to identify their manipulative tactics and keep you and your family safe. Watch and Subscribe to our YouTube Channel @NavigatingNarcissismPod Follow me on social:   Instagram - @doctorramani Pod Instagram - @navigatingnarcissismpod Facebook - @doctorramani Twitter - @DoctorRamani YouTube: Dr. Ramani’s YT - DoctorRamani  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com. I just might answer your questions on air. Guest Bio: Janja Lalich, Ph.D., Professor Emerita of Sociology, is an international authority on cults, extremism, and coercion. She specializes in closed systems (cults, narcissistic relationships, human trafficking, ideological extremism). Dr. Lalich is Founder and CEO of the Lalich Center on Cults and Coercion. The mission of the Lalich Center is to provide life-saving resources to survivors of cults, the Troubled Teen Industry, and narcissistic families/relationships. She is author of six books, including the now classic, Take Back Your Life: Recovering from Cults and Abusive Relationships; her theoretical work, Bounded Choice: True Believers and Charismatic Cults; and Escaping Utopia: Growing Up in a Cult, Getting Out and Starting Over. She also co-authored two books with Dr. Margaret Thaler Singer: Cults in Our Midst and “Crazy” Therapies: What Are They? Do They Work? In addition to working with survivors and their families, she conducts workshops for governments and international intelligence agencies, private companies, and educational institutions. Guest Information:  Website -  https://janjalalich.com/  www.lalichcenter.org Instagram - @janja_lalich Twitter - @Janja_Lalich  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a healthcare professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. EXECUTIVE PRODUCERS Jada Pinkett Smith, Ellen Rakieten, Dr. Ramani Durvasula, Meghan Hoffman, Fallon Jethroe VP PRODUCTION OPERATIONS Martha Chaput CREATIVE DIRECTOR Jason Nguyen LINE PRODUCER Lee Pearce PRODUCER Matthew Jones, Aidan Tanner ASSOCIATE PRODUCER Mara De La Rosa ASSOCIATE CREATIVE PRODUCER Keenon Rush HAIR AND MAKEUP ARTIST Samatha Pack AUDIO ENGINEER Calvin Bailiff EXEC ASST Rachel Miller PRODUCTION OPS ASST Jesse Clayton EDITOR Eugene Gordon Eric Tome POST MEDIA MANAGER Luis E. Ackerman POST PROD ASST Moe Alvarez AUDIO EDITORS \u0026 MIXERS Matt Wellentin, Geneva Wellentin, VP, HEAD OF PARTNER STRATEGY Jae Trevits Digital MARKETING DIRECTOR Sophia Hunter VP, POST PRODUCTION Jonathan Goldberg SVP, HEAD OF CONTENT Lukas Kaiser HEAD OF CURRENT Christie Dishner VP, PRODUCTION OPERATIONS Jacob Moncrief EXECUTIVE IN CHARGE OF PRODUCTION Dawn ManningSee omnystudio.com/listener for privacy information.",
      "release": "2023-06-22T00:00:00",
      "duration": "01:41:42.1250000",
      "explicit": false,
      "spotifyId": "0SSXEA0Hv2DonRNe6ALXYp",
      "appleId": 1000617939382,
      "youTubeId": "VQlmgC4S5ro",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0SSXEA0Hv2DonRNe6ALXYp",
        "apple": "https://podcasts.apple.com/podcast/what-is-a-cult-with-dr-janja-lalich/id1629909313?i=1000617939382",
        "youtube": "https://www.youtube.com/watch?v=VQlmgC4S5ro"
      }
    },
    {
      "id": "f28fd2d5-de30-4c38-9de3-89693be71006",
      "title": "Ask Dr. Ramani: What is Gaslighting?",
      "description": "Dr. Ramani answers your burning questions about gaslighting, a phenomenon so common, it was 2022’s word of the year. Watch and Subscribe to our YouTube Channel @NavigatingNarcissismPod Follow me on social:   Instagram - @doctorramani Pod Instagram - @navigatingnarcissismpod Facebook - @doctorramani Twitter - @DoctorRamani YouTube: Dr. Ramani’s YT - DoctorRamani  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com. I just might answer your questions on air. This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a healthcare professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. EXECUTIVE PRODUCERS Jada Pinkett Smith, Ellen Rakieten, Dr. Ramani Durvasula, Meghan Hoffman, Fallon Jethroe VP PRODUCTION OPERATIONS Martha Chaput CREATIVE DIRECTOR Jason Nguyen LINE PRODUCER Lee Pearce PRODUCER Matthew Jones, Aidan Tanner ASSOCIATE PRODUCER Mara De La Rosa ASSOCIATE CREATIVE PRODUCER Keenon Rush HAIR AND MAKEUP ARTIST Samatha Pack AUDIO ENGINEER Calvin Bailiff EXEC ASST Rachel Miller PRODUCTION OPS ASST Jesse Clayton EDITOR Eugene Gordon POST MEDIA MANAGER Luis E. Ackerman POST PROD ASST Moe Alvarez AUDIO EDITORS \u0026 MIXERS Matt Wellentin, Geneva Wellentin, VP, HEAD OF PARTNER STRATEGY Jae Trevits Digital MARKETING DIRECTOR Sophia Hunter VP, POST PRODUCTION Jonathan Goldberg SVP, HEAD OF CONTENT Lukas Kaiser HEAD OF CURRENT Christie Dishner VP, PRODUCTION OPERATIONS Jacob Moncrief EXECUTIVE IN CHARGE OF PRODUCTION Dawn ManningSee omnystudio.com/listener for privacy information.",
      "release": "2023-06-08T00:00:00",
      "duration": "01:05:33.5440000",
      "explicit": false,
      "spotifyId": "396xhgfcE6dL09DGTuRoDa",
      "appleId": 1000616111070,
      "youTubeId": "6ti7UIoNti4",
      "urls": {
        "spotify": "https://open.spotify.com/episode/396xhgfcE6dL09DGTuRoDa",
        "apple": "https://podcasts.apple.com/podcast/ask-dr-ramani-what-is-gaslighting/id1629909313?i=1000616111070",
        "youtube": "https://www.youtube.com/watch?v=6ti7UIoNti4"
      }
    },
    {
      "id": "3824536d-3c88-40a8-87f0-23496ce728c5",
      "title": "What Happened at Hillsong Church with Noemi Uribe",
      "description": "Former Hillsong member Noemi Uribe opens up about love bombing, gaslighting, manipulating and harmful practices Noemi says they experienced while involved with the disgraced megachurch. Watch and Subscribe to our YouTube Channel @NavigatingNarcissismPod Follow me on social:   Instagram - @doctorramani Pod Instagram - @navigatingnarcissismpod Facebook - @doctorramani Twitter - @DoctorRamani YouTube: Dr. Ramani’s YT - DoctorRamani  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com. I just might answer your questions on air. Guest Bio: Noemi Uribe (she/they) is a queer Latinx advocate living in Boston, MA. Growing up in a Latinx Pentecostal church shaped the way they saw homosexuality and Christian theology. After leaving their families church and attending a Hillsong church in Boston, they thought they had found a safe space to finally question their sexuality and faith. But what she experienced was the complete opposite leading to a mental health crisis. After leaving and surviving religious trauma, Noemi is now speaking out in order to warn others of the dangers of ill-equipped spiritual leaders and church ambiguity on LGBTQ\u002B policies. Guest Information:  LinkTree: https://linktr.ee/noemimi.u  Twitter: @noemimiu  Instagram: @noemimi.u  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a healthcare professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. EXECUTIVE PRODUCERS Jada Pinkett Smith, Ellen Rakieten, Dr. Ramani Durvasula, Meghan Hoffman VP PRODUCTION OPERATIONS Martha Chaput CREATIVE DIRECTOR Jason Nguyen LINE PRODUCER Lee Pearce PRODUCER Matthew Jones, Aidan Tanner ASSOCIATE PRODUCER Mara De La Rosa ASSOCIATE CREATIVE PRODUCER Keenon Rush HAIR AND MAKEUP ARTIST Samatha Pack AUDIO ENGINEER Calvin Bailiff EXEC ASST Rachel Miller PRODUCTION OPS ASST Jesse Clayton EDITOR Eugene Gordon POST MEDIA MANAGER Luis E. Ackerman POST PROD ASST Moe Alvarez AUDIO EDITORS \u0026 MIXERS Matt Wellentin, Geneva Wellentin, VP, HEAD OF PARTNER STRATEGY Jae Trevits Digital MARKETING DIRECTOR Sophia Hunter VP, POST PRODUCTION Jonathan Goldberg SVP, HEAD OF CONTENT Lukas Kaiser HEAD OF CURRENT Christie Dishner VP, PRODUCTION OPERATIONS Jacob Moncrief EXECUTIVE IN CHARGE OF PRODUCTION Dawn ManningSee omnystudio.com/listener for privacy information.",
      "release": "2023-05-18T00:00:00",
      "duration": "01:18:33.8220000",
      "explicit": false,
      "spotifyId": "1wYlzBi9zKUpA5MhWdXz49",
      "appleId": 1000613487797,
      "youTubeId": "ekq85yh34NU",
      "urls": {
        "spotify": "https://open.spotify.com/episode/1wYlzBi9zKUpA5MhWdXz49",
        "apple": "https://podcasts.apple.com/podcast/what-happened-at-hillsong-church-with-noemi-uribe/id1629909313?i=1000613487797",
        "youtube": "https://www.youtube.com/watch?v=ekq85yh34NU"
      }
    },
    {
      "id": "b0150d29-aeea-4282-8cda-38a486586f01",
      "title": "Confronting Complex PTSD with Stephanie Foo",
      "description": "Emmy-winning producer and author of the acclaimed memoir What My Bones Know Stephanie Foo opens up about how a childhood of abuse and abandonment shaped her and reveals how she navigates complex PTSD. Watch and Subscribe to our YouTube Channel @NavigatingNarcissismPod Follow me on social:   Instagram - @doctorramani Pod Instagram - @navigatingnarcissismpod Facebook - @doctorramani Twitter - @DoctorRamani YouTube: Dr. Ramani’s YT - DoctorRamani  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com. I just might answer your questions on air. Guest Bio: Stephanie Foo is a writer and radio producer, most recently for This American Life. Her work has aired on Snap Judgment, Reply All, 99% Invisible, and Radiolab. A noted speaker and instructor, she has taught at Columbia University and has spoken at venues from Sundance Film Festival to the Missouri Department of Mental Health. She lives in New York City with her husband. Guest Information:  Website - https://www.stephaniefoo.me/  Instagram - @foofoofoo Twitter - @imontheradio LinkedIn - Stephanie Foo  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a healthcare professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. EXECUTIVE PRODUCERS Jada Pinkett Smith, Ellen Rakieten, Dr. Ramani Durvasula, Meghan Hoffman, Fallon Jethroe VP PRODUCTION OPERATIONS Martha Chaput CREATIVE DIRECTOR Jason Nguyen LINE PRODUCER Lee Pearce PRODUCER Matthew Jones, Aidan Tanner ASSOCIATE PRODUCER Mara De La Rosa ASSOCIATE CREATIVE PRODUCER Keenon Rush HAIR AND MAKEUP ARTIST Samatha Pack AUDIO ENGINEER Calvin Bailiff EXEC ASST Rachel Miller PRODUCTION OPS ASST Jesse Clayton EDITOR Eugene Gordon POST MEDIA MANAGER Luis E. Ackerman POST PROD ASST Moe Alvarez AUDIO EDITORS \u0026 MIXERS Matt Wellentin, Geneva Wellentin, VP, HEAD OF PARTNER STRATEGY Jae Trevits Digital MARKETING DIRECTOR Sophia Hunter VP, POST PRODUCTION Jonathan Goldberg SVP, HEAD OF CONTENT Lukas Kaiser HEAD OF CURRENT Christie Dishner VP, PRODUCTION OPERATIONS Jacob Moncrief EXECUTIVE IN CHARGE OF PRODUCTION Dawn ManningSee omnystudio.com/listener for privacy information.",
      "release": "2023-04-13T00:00:00",
      "duration": "01:08:28.2510000",
      "explicit": false,
      "spotifyId": "0YW6Ny8Mue8nBH5emipAyE",
      "appleId": 1000608746647,
      "youTubeId": "qukGZ4-bQeE",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0YW6Ny8Mue8nBH5emipAyE",
        "apple": "https://podcasts.apple.com/podcast/confronting-complex-ptsd-with-stephanie-foo/id1629909313?i=1000608746647",
        "youtube": "https://www.youtube.com/watch?v=qukGZ4-bQeE"
      }
    },
    {
      "id": "50ddc3e2-1b46-4ffd-bf74-8105c2563ebd",
      "title": "NXIVM Whistleblower w/ Sarah Edmondson Part 2",
      "description": "In Part 2 Sarah Edmondson\u0027s story, we see how the truth slowly starts to unfold. Sarah realizes that Keith Raniere, Nancy Salzman, and NXIVM were abusing many of its female members. For the first time, Sarah sees the horrible truth about the organization, and how Keith was actually sexually abusing women behind closed doors. When Sarah was tricked into joining DOS, more insidious events unfold all around NXIVM, which lead to Sarah taking action to protect herself and the women around her. Listen to how Sarah\u0027s whistleblowing finally started the beginning of the end of NXIVM. Host Information:  Instagram: Dr Ramani\u0027s IG - @doctorramani Facebook: Dr Ramani\u0027s FB - @doctorramani Twitter: Dr Ramani\u0027s TW - @DoctorRamani  YouTube: Dr. Ramani’s YT - DoctorRamani Guest Information: Instagram: Sarah Edmondson’s IG - @sarahedmondson Facebook: Sarah Edmondson’s FB - Sarah Edmondson  Twitter: Sarah Edmondson’s TW - @sarahjedmondson  Book: Scarred Podcast: A Little Bit Culty  Guest Bio:  Sarah is a working actor and artist. She is known for her role in NXIVM; which initially intrigued her with its promise to provide the tools and insight she needed to reach her potential. It all came into focus when she accepted an invitation to join DOS, a “secret sisterhood” within NXIVM. It was a decision that resulted in a front page bombshell in the New York Times featuring her story as a woman on a mission to shut NXIVM down. Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life. Sarah’s journey as a whistleblower has also been featured in “The Vow”, the critically acclaimed HBO documentary series.  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com I just might answer you questions on air.  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a health care professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. Navigating Narcissism is produced by Red Table Talk Podcasts. EXECUTIVE PRODUCERS: Jada Pinkett-Smith, Fallon Jethroe, Ellen Rakieten, and Dr. Ramani Durvasula. Also, PRODUCER: Matthew Jones, ASSOCIATE PRODUCER: Mara De La Rosa. EDITORS AND AUDIO MIXERS: Devin Donaghy and Calvin Bailiff.See omnystudio.com/listener for privacy information.",
      "release": "2023-01-12T00:00:00",
      "duration": "01:00:10.5660000",
      "explicit": false,
      "spotifyId": "3PL7xJZAKJgkyzpytNGheb",
      "appleId": 1000593907639,
      "youTubeId": "c2_5tjR4lHs",
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PL7xJZAKJgkyzpytNGheb",
        "apple": "https://podcasts.apple.com/podcast/nxivm-whistleblower-w-sarah-edmondson-part-2/id1629909313?i=1000593907639",
        "youtube": "https://www.youtube.com/watch?v=c2_5tjR4lHs"
      }
    },
    {
      "id": "6e7a5646-fe0d-4764-a86a-afa084f32e9f",
      "title": "NXIVM Whistleblower w/ Sarah Edmondson Part 1",
      "description": "Sarah Edmondson was a young actress pursuing a career in film and television, when she hit a low point and was hoping to find a new purpose in life. She ran into renowned filmmaker, Mark Vicente, who spoke to her about NXIVM and eventually brought her into the organization. There she started following Keith Raniere and Nancy Salzman\u0027s mission. They encouraged Sarah to give her all. In part 1 of 2, we learn about how NXIVM\u0027s leadership undermined its followers and groomed them in such a conniving way, that no one knew what was happening to them. Sarah grew close to many members of the organization - which later turned out to be a cult, and even rose up in leadership. Listen to how Sarah\u0027s journey and newfound community helped her find a new meaning in life. Host Information:  Instagram: Dr Ramani\u0027s IG - @doctorramani Facebook: Dr Ramani\u0027s FB - @doctorramani Twitter: Dr Ramani\u0027s TW - @DoctorRamani  YouTube: Dr. Ramani’s YT - DoctorRamani Guest Information: Instagram: Sarah Edmondson’s IG - @sarahedmondson Facebook: Sarah Edmondson’s FB - Sarah Edmondson  Twitter: Sarah Edmondson’s TW - @sarahjedmondson  Book: Scarred Podcast: A Little Bit Culty  Guest Bio:  Sarah is a working actor and artist. She is known for her role in NXIVM; which initially intrigued her with its promise to provide the tools and insight she needed to reach her potential. It all came into focus when she accepted an invitation to join DOS, a “secret sisterhood” within NXIVM. It was a decision that resulted in a front page bombshell in the New York Times featuring her story as a woman on a mission to shut NXIVM down. Sarah published Scarred: The True Story of How I Escaped NXIVM, the Cult that Bound My Life. Sarah’s journey as a whistleblower has also been featured in “The Vow”, the critically acclaimed HBO documentary series.  I want to hear from you, too. Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com   I just might answer you questions on air.  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a health care professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. Navigating Narcissism is produced by Red Table Talk Podcasts. EXECUTIVE PRODUCERS: Jada Pinkett-Smith, Fallon Jethroe, Ellen Rakieten, and Dr. Ramani Durvasula. Also, PRODUCER: Matthew Jones, ASSOCIATE PRODUCER: Mara De La Rosa. EDITORS AND AUDIO MIXERS: Devin Donaghy and Calvin Bailiff.See omnystudio.com/listener for privacy information.",
      "release": "2023-01-05T00:00:00",
      "duration": "01:07:14.7680000",
      "explicit": false,
      "spotifyId": "0ZBi4N5mxV2slyB0vv0Jsi",
      "appleId": 1000592582549,
      "youTubeId": "L7KK0LixzN0",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZBi4N5mxV2slyB0vv0Jsi",
        "apple": "https://podcasts.apple.com/podcast/nxivm-whistleblower-w-sarah-edmondson-part-1/id1629909313?i=1000592582549",
        "youtube": "https://www.youtube.com/watch?v=L7KK0LixzN0"
      }
    },
    {
      "id": "808195dd-5567-4c04-8a0c-eb03b43c6961",
      "title": "Bikram Yoga and the Abuse of Power w/ Mandeep Kaur Sandhu",
      "description": "Mandeep Kaur Sandhu was already an award winning yogi in India, but by attending Bikram Chadhury\u0027s training school, she would be able to further develop her skills and eventually open her own studio. Chadhury changed the world of yoga in the US, with the added heat element, plus his charisma and demeanor which attracted a lot of his followers. However, Chadhury wasn\u0027t your regular guru. Mandeep explains how manipulative, contemptuous and abusive Chadhury was to his female trainees, employees, and teachers. He would gaslight his staff and groom the women in order to get what he wanted in the middle of the night. Mandeep details how Chadhury\u0027s sexual impropriety and abuse greatly affected his trainees; and led to his eventual downfall. Find out how Mandeep took a stand and stayed true to her own beliefs. Host Information:  Instagram: Dr Ramani\u0027s IG - @doctorramani Facebook: Dr Ramani\u0027s FB - @doctorramani Twitter: Dr Ramani\u0027s TW - @DoctorRamani  YouTube: Dr. Ramani’s YT - DoctorRamani Guest Information:  Instagram: Mandeep Kaur Sandhu’s IG - @mandeepkaursandhu_ Guest Bio: Mandeep Kaur has been practicing yoga for the last twenty years. She is the founder of Mandeep Hot Yoga Center and aims to build a presence that is to be recognized worldwide. In 2007, Mandeep Kaur left for the U.S. and rented a small studio space where she trained herself with various yoga institutes and centers to gain more knowledge in different styles of yoga; before she designed the innovative series of Mandeep Hot Yoga. Mandeep strives to share her vision in new ways, she has spent over a decade crafting training programs, articulating yoga education methods, attending and participating in conferences and events; all to empower individuals to positively change themselves and the world, through yoga. #NavigatingNarcissism I want to hear from you, too.  Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com   I just might answer you questions on air.  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a health care professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. Navigating Narcissism is produced by Red Table Talk Podcasts. EXECUTIVE PRODUCERS: Jada Pinkett-Smith, Fallon Jethroe, Ellen Rakieten, and Dr. Ramani Durvasula. PRODUCER: Matthew Jones, ASSOCIATE PRODUCER: Mara De La Rosa. EDITORS AND AUDIO MIXERS: Devin Donaghy and Calvin Bailiff.   See omnystudio.com/listener for privacy information.",
      "release": "2022-09-01T00:00:00",
      "duration": "01:11:19.0130000",
      "explicit": false,
      "spotifyId": "7yKocKvZHQzjTye3yRgt9p",
      "appleId": 1000578004420,
      "youTubeId": "g_4nN-JZj0g",
      "urls": {
        "spotify": "https://open.spotify.com/episode/7yKocKvZHQzjTye3yRgt9p",
        "apple": "https://podcasts.apple.com/podcast/bikram-yoga-and-the-abuse-of-power-w-mandeep-kaur-sandhu/id1629909313?i=1000578004420",
        "youtube": "https://www.youtube.com/watch?v=g_4nN-JZj0g"
      }
    },
    {
      "id": "f8f80d03-daf2-47c2-b385-665b25e1d746",
      "title": "Working for LuLaRoe w/ Roberta Blevins",
      "description": "Roberta shares her time at LuLaRoe, a multi-level marketing company that sells women\u0027s clothes; and how working for them changed her life forever. LuLaRoe started out as a great experience for Roberta, making new friends, climbing her way to the top, and making her a lot of money. However, it ended with her in financial wealth not being met amongst other broken expectations. LuLaRoe retailers were duped and manipulated by its narcissistic leaders by selling cheap material that pigeon-holed their employees in an endless loop of buying and selling, with many making no money. Listen and learn how LuLaRoe rose to the top, gained so much popularity; and how some of its former retailers are picking up the pieces today. Host Information:  Instagram: Dr Ramani\u0027s IG - @doctorramani Facebook: Dr Ramani\u0027s FB - @doctorramani Twitter: Dr Ramani\u0027s TW - @DoctorRamani  YouTube: Dr. Ramani’s YT - DoctorRamani Guest Information:  Instagram: Roberta Blevins’ IG - @therealrobertablevins Facebook: Roberta Blevins’ FB - @therealrobertablevins Twitter: Roberta Blevins’ TW - @mommylikewhoa #NavigatingNarcissism I want to hear from you, too.  Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com   I just might answer you questions on air.  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a health care professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. Navigating Narcissism is produced by Red Table Talk Podcasts. EXECUTIVE PRODUCERS: Jada Pinkett-Smith, Fallon Jethroe, Ellen Rakieten, and Dr. Ramani Durvasula. PRODUCER: Matthew Jones, ASSOCIATE PRODUCER: Mara De La Rosa. EDITOR AND AUDIO MIXERS: Devin Donaghy. See omnystudio.com/listener for privacy information.",
      "release": "2022-08-18T00:00:00",
      "duration": "01:14:09.7240000",
      "explicit": false,
      "spotifyId": "0Y1nOgHuTapPoeTKn8v1Ij",
      "appleId": 1000576458868,
      "youTubeId": "ZgLh-1K7MgM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Y1nOgHuTapPoeTKn8v1Ij",
        "apple": "https://podcasts.apple.com/podcast/working-for-lularoe-w-roberta-blevins/id1629909313?i=1000576458868",
        "youtube": "https://www.youtube.com/watch?v=ZgLh-1K7MgM"
      }
    },
    {
      "id": "c8685791-b6da-40d3-9e52-9455f8491bb2",
      "title": "No Such Thing as a Good Cult w/ Mark Vicente pt. 2",
      "description": "As we dive into part 2 of Mark Vicente\u0027s experience in the NXIVM cult, we go even deeper and discuss the root of the problem, Keith Raniere and executive team, who aided and abetted his actions of abuse. Mark talks about victim blaming, and points out that what happened to him could really happen to anyone. Mark breaks down his emotional journey after finding out and then accepting the truth about Raniere\u0027s abuse. With the justice system being flawed, we witness the rare occasion where the abuser receives a deserving sentence. Host Information:  Instagram: Dr Ramani\u0027s IG - @doctorramani Facebook: Dr Ramani\u0027s FB - @doctorramani Twitter: Dr Ramani\u0027s TW - @DoctorRamani  YouTube: Dr. Ramani’s YT - DoctorRamani Guest Information:  Instagram: Mark Vicente’s IG - @markvicente Twitter: Mark Vicente’s TW - @markvicente  Guest Bio: Mark was born in Johannesburg, South Africa in 1965. Taking his first photograph at age four, he quickly discovered his passion for being behind the camera. After attending film and drama school in South Africa, he began working his way up the ranks of the camera department. His first big break came as Director of Photography on the musical SARAFINA, starring Whoopi Goldberg. In 1992, he relocated to Los Angeles to shoot his first studio picture for Disney; FATHERHOOD, starring Patrick Swayze and Halle Berry. Over the next few decades, he went on to shoot an additional 14 feature films and numerous documentaries, music videos and commercials. Mark soon discovered untold stories he needed to express as a director. He was driven by the conviction that tales of greatness, nobility and introspection could be exciting and financially successful. Growing up during the Apartheid era in South Africa and its widespread iniquities, Mark learned early on to question fundamental assumptions and beliefs about human behavior, cosmology, existentialism, and mysticism. While that bold curiosity served him well, the path found him in direct contact with truly malignant pathologic personalities masquerading as forward-thinking philosophical leaders teaching self-improvement while inflicting unthinkable damage to their followers... and to Mark himself. His recent defection from the NXIVM cult was chronicled in the HBO series THE VOW. Mark and a few courageous whistleblowers exposed the criminal activities of this organization, resulting in multiple arrests and indictments. Mark is currently in production on a number of films including one on Narcissism and Narcissistic abuse. #NavigatingNarcissism I want to hear from you, too.  Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com   I just might answer you questions on air.  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a health care professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. Navigating Narcissism is produced by Red Table Talk Podcasts. EXECUTIVE PRODUCERS: Jada Pinkett-Smith, Fallon Jethroe, Ellen Rakieten, and Dr. Ramani Durvasula. PRODUCER: Matthew Jones, ASSOCIATE PRODUCER: Mara De La Rosa. EDITORS AND AUDIO MIXERS: Devin Donaghy and Calvin Bailiff. See omnystudio.com/listener for privacy information.",
      "release": "2022-08-04T00:00:00",
      "duration": "00:56:15.8300000",
      "explicit": false,
      "spotifyId": "5ioYtdPQmUxCiX8pkAsR3S",
      "appleId": 1000574973314,
      "youTubeId": "MB_BI1b-NuM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ioYtdPQmUxCiX8pkAsR3S",
        "apple": "https://podcasts.apple.com/podcast/no-such-thing-as-a-good-cult-w-mark-vicente-pt-2/id1629909313?i=1000574973314",
        "youtube": "https://www.youtube.com/watch?v=MB_BI1b-NuM"
      }
    },
    {
      "id": "36e599ed-d28c-4c67-99e3-f2696e10dcf5",
      "title": "No Such Thing as a Good Cult w/ Mark Vicente Part 1",
      "description": "Pyramid schemes, sex trafficking operations and cults, oh my! Mark Vicente, an award-winning director who was part of the NXIVM cult, became one of its whistleblowers and has vowed to continue to shed light into the atrocities that happened within the confines of Keith Raniere. Mark reveals how he was manipulated and coerced into joining NXIVM, and how Raniere and other senior members gaslit its female members and ran an underground sex trafficking rink. In part 1 of 2 of this episode, Mark explains how anyone can get wrapped up into a situation like this and why it took him so long to see how much of a narcissist Raniere really was. Host Information:  Instagram: Dr Ramani\u0027s IG - @doctorramani Facebook: Dr Ramani\u0027s FB - @doctorramani Twitter: Dr Ramani\u0027s TW - @DoctorRamani  YouTube: Dr. Ramani’s YT - DoctorRamani Guest Information:  Instagram: Mark Vicente’s IG - @markvicente Twitter: Mark Vicente’s TW - @markvicente  Guest Bio: Mark was born in Johannesburg, South Africa in 1965. Taking his first photograph at age four, he quickly discovered his passion for being behind the camera. After attending film and drama school in South Africa, he began working his way up the ranks of the camera department. His first big break came as Director of Photography on the musical SARAFINA, starring Whoopi Goldberg. In 1992, he relocated to Los Angeles to shoot his first studio picture for Disney; FATHERHOOD, starring Patrick Swayze and Halle Berry. Over the next few decades, he went on to shoot an additional 14 feature films and numerous documentaries, music videos and commercials. Mark soon discovered untold stories he needed to express as a director. He was driven by the conviction that tales of greatness, nobility and introspection could be exciting and financially successful. Growing up during the Apartheid era in South Africa and its widespread iniquities, Mark learned early on to question fundamental assumptions and beliefs about human behavior, cosmology, existentialism, and mysticism. While that bold curiosity served him well, the path found him in direct contact with truly malignant pathologic personalities masquerading as forward-thinking philosophical leaders teaching self-improvement while inflicting unthinkable damage to their followers... and to Mark himself. His recent defection from the NXIVM cult was chronicled in the HBO series THE VOW. Mark and a few courageous whistleblowers exposed the criminal activities of this organization, resulting in multiple arrests and indictments. Mark is currently in production on a number of films including one on Narcissism and Narcissistic abuse. #NavigatingNarcissism I want to hear from you, too.  Have a toxic topic you want me to explore? Email me at askdrramani@redtabletalk.com   I just might answer you questions on air.  This podcast should not be used as a substitute for medical or mental health advice. Individuals are advised to seek independent medical advice, counseling, and/or therapy from a health care professional with respect to any medical condition, mental health issue, or health inquiry, including matters discussed on this podcast. Navigating Narcissism is produced by Red Table Talk Podcasts. EXECUTIVE PRODUCERS: Jada Pinkett-Smith, Fallon Jethroe, Ellen Rakieten, and Dr. Ramani Durvasula. PRODUCER: Matthew Jones, ASSOCIATE PRODUCER: Mara De La Rosa. EDITORS AND AUDIO MIXERS: Devin Donaghy and Calvin Bailiff. See omnystudio.com/listener for privacy information.",
      "release": "2022-07-28T00:00:00",
      "duration": "01:03:36.4370000",
      "explicit": false,
      "spotifyId": "2yrb5zBwWmivV6lvLrabTQ",
      "appleId": 1000571422688,
      "youTubeId": "sfHQbWgFV2s",
      "urls": {
        "spotify": "https://open.spotify.com/episode/2yrb5zBwWmivV6lvLrabTQ",
        "apple": "https://podcasts.apple.com/podcast/no-such-thing-as-a-good-cult-w-mark-vicente-part-1/id1629909313?i=1000571422688",
        "youtube": "https://www.youtube.com/watch?v=sfHQbWgFV2s"
      }
    }
  ]
}