{
  "id": "3249954a-7071-4148-b32a-b1b97f6f0339",
  "name": "NCASVideo",
  "youTubeChannelId": "UCV62FVLw6MxUvO8XmnhE4Yw",
  "episodes": [
    {
      "id": "b06e1488-ff9b-490c-9e28-4837765b6f09",
      "title": "Steven Hassan Discusses His Book, \u0022The Cult of Trump\u0022",
      "description": "In The Cult of Trump, mind control and licensed mental health expert Steven Hassan draws parallels between Donald Trump and people like Jim Jones, David Koresh, Ron Hubbard, and Sun Myung Moon, arguing that Trump\u0027s presidency was in many ways like a destructive cult. He specifically details the ways in which people are influenced through an array of social psychology methods and how they become fiercely loyal and obedient. Hassan was a former “Moonie” himself, and he presents a “thoughtful and well-researched analysis of some of the most puzzling aspects of the [Trump] presidency, including the remarkable passivity of fellow Republicans [and] the gross pandering of many members of the press” (Thomas G. Gutheil, MD and professor of psychiatry, Harvard Medical School).\n\nAbout the Author (courtesy of Simon \u0026 Schuster)\nSteven Hassan, PhD, is a mental health professional and forensics expert who has been helping people leave destructive cults since 1976 after he was deprogrammed from the Moon cult by his family. He directs the Freedom of Mind Resource Center, a consulting and media production company, based in Massachusetts. He is the author of the books, \u0022Combating Cult Mind Control\u0022 and \u0022Freedom of Mind: Helping Loved Ones Leave Controlling People, Cults and Beliefs.\u0022 Dr. Hassan’s expertise has been featured in major media outlets such as CNN, ABC, NBC, and \u0022The New York Times.\u0022 He has developed The BITE Model™, the world’s first scientifically validated construct for evaluating authoritarian control, and hosts the podcast, The Influence Continuum.",
      "release": "2024-11-15T13:08:47Z",
      "duration": "01:03:15",
      "explicit": false,
      "youTubeId": "ViO6b1422Bo",
      "subjects": [
        "Cult-Expert",
        "Qanon"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ViO6b1422Bo"
      }
    }
  ]
}