{
  "id": "a01be65d-2517-4347-b26a-a72a3ad57c96",
  "name": "Nerds Rule The World",
  "youTubeChannelId": "UCtQm1GJsaeN67Kgy-RFaKfA",
  "episodes": [
    {
      "id": "29f60b92-b8d0-4eb8-b409-518f20626e20",
      "title": "Survivor, Yulanda Williams chats about Cult Massacre: One Day in Jonestown on Hulu! A NRW Interview!",
      "description": "Survivor, Yulanda Williams chats about \u0027Cult Massacre: One Day in Jonestown\u0027 from National Geographic on Hulu with Heather! A NRW Interview! Nerds Rule The World!\n\nCult Massacre: One Day in Jonestown (Streaming on Hulu now!): The three-part series tells the story of a religious organization led by the infamous Jim Jones, who set out to establish a utopian community in Guyana. What began as a peaceful movement seeking social justice ultimately spiraled into a mass casualty event that left 918 dead. Told by survivors and eyewitnesses, along with rare footage and rare Jim Jones recordings, the powerful series gives an immersive look into the final harrowing hours leading up to one of America’s darkest chapters.\n\nFOLLOW Heather at: https://www.instagram.com/heather_is_a_nerd\n\nEdited on Samsung Galaxy S21 Ultra 5G with App, CyberLink PowerDirector Video Editor.\n***\nGET THE N-E-W FROM THE N-R-W! The Strange World Presents... The NRW! AKA Nerds Rule The World! AKA New Release Wednesday! In Affiliation with The Nerds of Color! NRW celebrates pop culture in all of its forms providing a mountain of content for every Fan! NRW spotlights the latest weekly entertainment releases with: \u0027The NRW Show\u0027 showcasing the latest releases in Film, TV \u0026 Streaming and \u0027The NRW Checkpoint\u0027 showcasing the latest releases in Gaming! For Music fans, NRW features a weekly music spotlight show, \u0027The #HotOrNot Music Spot\u0027, giving opinions on trending music! NRW on WTOP is our weekly recorded radio replay of Executive Producer, Kuya P\u0027s Entertainment Picks that aired on 103.5 WTOP-FM Radio in Washington DC, Maryland and Virginia! For Wrestling Fans, NRW\u0027s weekly, \u0027KayFabeyBaby: The NRW Ring Generals Podcast\u0027 discusses all the latest going-ons in professional wrestling with WWE, AEW, NJPW and more! For Trading Card \u0026 Toy Collector Enthusiasts, \u0027NRW\u0027s What\u0027s In The Box?!\u0027 open ups and discusses our love for collecting and more! As a group of diverse nerds, NRW puts representation front and center with regular shows: \u0027ShoPowSho\u0027 exploring FilipinX History \u0026 Culture and \u0027AAPI Toy Heroes\u0027 spotlighting AAPI representation in toys! NRW is also the home of \u0027You\u0027re So Cool with Rob Medina!\u0027 featuring weekly Entertainment Industry based interviews. NRW\u0027s biggest highlights additionally include our weekly Artist \u0026 Celebrity Interviews, Trailer Reactions, Entertainment News \u0026 Reviews, Event/Convention/Show Coverage, Cosplay Music Videos and MORE!\n***\nFollow NRW on Instagram at @newreleasewednesday \u0026 Twitter at @TheNRW! Are you an artist, production company, or studio and want to spread the word on your upcoming project?  Interested in your project being reviewed, being an interview guest or sponsor of NRW? E-mail Producer, Kuya P aka Patrick Michael Strange at patrick.strange@nerdsruletheworld.org! We want to work with you for all things pop culture along with trailer reactions, cosplay, comics picks, gaming news, reviews and interviews, SUBSCRIBE to NRW on #YouTube!\n***\nLIKE! SHARE! FOLLOW! SUBSCRIBE!\nFacebook: https://www.Facebook.com/NewReleaseWednesday\nIMDb: https://www.imdb.com/title/tt12274714/\nInstagram: https://www.Instagram.com/NewReleaseWednesday\nTwitter: https://www.Twitter.com/TheNRW\nWordpress: https://NewReleaseWednesday.Wordpress.com\nYouTube:\nhttps://www.youtube.com/@NerdsRuleTheWorld\nhttps://www.YouTube.com/NewReleaseWednesday\n***\nTemple Far East Entertainment\nExecutive Producer: Patrick Michael Strange AKA \u0027Kuya P\u0027\nInstagram URL: https://www.instagram.com/thelegendkuyap\nTwitter URL: https://twitter.com/thelegendkuyap\nTikTok: https://www.tiktok.com/@thelegendkuyap\n***\n#NRW #NerdsRuleTheWorld #NewReleaseWednesday #NOC #TheNerdsOfColor #Nerd #Geek #Blerd #popculture #entertainment #podcast #comics #cosplay #film #tv #anime #wrestling #gamer #gaming #videogames \n***\n\u0022Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \u0022fair use\u0022 for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\u0022 \u0022Fair Use\u0022 guidelines: https://www.copyright.gov/fls/fl102.html",
      "release": "2024-07-15T02:06:48Z",
      "duration": "00:11:17",
      "explicit": false,
      "youTubeId": "syM-3evGTT0",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=syM-3evGTT0"
      }
    },
    {
      "id": "a1372467-b54a-4493-be38-1754f9178fc7",
      "title": "Cult Massacre: One Day in Jonestown (2024): A NRW Review! Hulu! NatGeo! Jim Jones!",
      "description": "Cult Massacre: One Day in Jonestown (2024): A NRW Review! Hulu! NatGeo! Jim Jones!\n\nNat Geo’s new docuseries, CULT MASSACRE: ONE DAY IN JONESTOWN premieres June 17th! This series chronicles harrowing moments leading up to the tragic events in 1978 that left 918 dead, using first-person accounts and newly digitized and never-before-seen footage. \n\nCULT MASSACRE: ONE DAY IN JONESTOWN tells the story of an idealistic religious organization led by the infamous Jim Jones, who set out to establish a utopian community in Guyana. What began as a peaceful movement seeking social justice ultimately spiraled into a mass casualty that left 918 dead. Told by survivors and eyewitnesses, along with rare footage and rare recordings of Jones, the powerful series takes an immersive look into the final harrowing hours leading up to one of America’s darkest chapters.\n\nCULT MASSACRE features first-person accounts from former Peoples Temple members, including Leslie Wagner Wilson and Yulanda Williams; former member of Congress and aide to U.S. Rep. Leo Ryan Jackie Speier; former Washington Post foreign correspondent Charles Krause; former Special Ops Air Force Sgt. David Netterville, who was among the first of three U.S. service members to enter Jonestown in the immediate aftermath of the tragedy and has never spoken about his experience for a documentary before; and Jim Jones’ son, Stephan Jones.\n\nFOLLOW Heather at: https://instagram.com/heather_is_a_nerd\n***\nGET THE N-E-W FROM THE N-R-W! The Strange World Presents... The NRW! AKA Nerds Rule The World! AKA New Release Wednesday! In Affiliation with The Nerds of Color! NRW celebrates art \u0026 pop culture in all of its forms providing a mountain of content for every type of fan! NRW provides two weekly entertainment shows spotlighting the latest releases: \u0027The NRW Show\u0027 showcasing the latest releases in Film, TV \u0026 Streaming and \u0027The NRW Checkpoint\u0027 showcasing the latest releases in Gaming! As Music fans, NRW features a weekly music spotlight show, \u0027The #HotOrNot Music Spot\u0027, giving opinions on trending music! As a group of diverse nerds, NRW features: \u0027ShoPowSho\u0027 exploring FilipinX History \u0026 Culture and \u0027AAPI Toy Heroes\u0027 spotlighting AAPI representation in toys! NRW is the home of \u0027You\u0027re So Cool with Rob Medina!\u0027 featuring Entertainment Industry based interviews and \u0027NRW on WTOP\u0027, the recorded radio replay of Executive Producer, Kuya P\u0027s Entertainment Picks on 103.5 WTOP-FM Radio! NRW also features Artist \u0026 Celebrity Interviews, Trailer Reactions, Entertainment News \u0026 Reviews, Event/Convention/Show Coverage, Cosplay Music Videos and MORE!\n***\nFollow NRW on Instagram at @newreleasewednesday \u0026 Twitter at @TheNRW! Are you an artist, production company, or studio and want to spread the word on your upcoming project?  Interested in your project being reviewed, being an interview guest or sponsor of NRW? E-mail Producer, Kuya P aka Patrick Michael Strange at patrick.strange@nerdsruletheworld.org! We want to work with you for all things pop culture along with trailer reactions, cosplay, comics picks, gaming news, reviews and interviews, SUBSCRIBE to NRW on #YouTube!\n***\nLIKE! SHARE! FOLLOW! SUBSCRIBE!\nFacebook: https://www.Facebook.com/NewReleaseWednesday\nIMDb: https://www.imdb.com/title/tt12274714/\nInstagram: https://www.Instagram.com/NewReleaseWednesday\nTwitter: https://www.Twitter.com/TheNRW\nWordpress: https://NewReleaseWednesday.Wordpress.com\nYouTube:\nhttps://www.youtube.com/@NerdsRuleTheWorld\nhttps://www.YouTube.com/NewReleaseWednesday\n***\nTake time for yourself! There is nothing more important than movies and... Self Care! Check out all the goodies from our sponsor: Bunnies \u0026 Cream: https://www.bunniesandcream.com/! Get 20% Off your total order plus Free Shipping after $20 with our Code: NERDSRULE.\n***\nThe NRW Team: Ashlee Doris, Natasha Francisco, Elden Hawkes, Heather Hurt, KUYA P aka Patrick Michael Strange, Glenn Lawrence, Loy Lee, Maki Roll, Rob Medina, Shawn Mongold, Roohkage, Brian Sapph, Tranquil Ashes and Justin Quizon!\n***\nTemple Far East Entertainment\nExecutive Producer: Patrick Michael Strange AKA \u0027Kuya P\u0027\nInstagram URL: https://www.instagram.com/thelegendkuyap\nTwitter URL: https://twitter.com/thelegendkuyap\nTikTok: https://www.tiktok.com/@thelegendkuyap\n***\n#NRW #NerdsRuleTheWorld #NewReleaseWednesday #NOC #TheNerdsOfColor #Nerd #Geek #Blerd #popculture #entertainment #podcast #comics #cosplay #film #tv #anime #wrestling #gamer #gaming #videogames \n***\n\u0022Copyright Disclaimer Under Section 107 of the Copyright Act 1976, allowance is made for \u0022fair use\u0022 for purposes such as criticism, comment, news reporting, teaching, scholarship, and research. Fair use is a use permitted by copyright statute that might otherwise be infringing. Non-profit, educational or personal use tips the balance in favor of fair use.\u0022 \u0022Fair Use\u0022 guidelines: https://www.copyright.gov/fls/fl102.html\n***\nEdited on Samsung Galaxy S21 Ultra 5G with App, CyberLink PowerDirector Video Editor.\n***",
      "release": "2024-06-10T03:31:47Z",
      "duration": "00:10:39",
      "explicit": false,
      "youTubeId": "cJ9JpL_Hlwk",
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cJ9JpL_Hlwk"
      }
    }
  ]
}