{
  "_ts": 0,
  "id": "67b565c7-c16d-427d-a35f-657ee9646727",
  "name": "Netflix",
  "youTubeChannelId": "UCWOA1ZGywLbqmigxE4Qlvuw",
  "episodes": [
    {
      "id": "3066cca1-3bb4-4009-8767-8a2bb1a8fe4f",
      "title": "CHAOS: The Manson Murders | Official Trailer | Netflix",
      "description": "Directed by Errol Morris, CHAOS: The Manson Murders untangles a web of conspiracy involving the CIA, LSD, Jack Ruby, the Manson Family, and Vincent Bugliosi, casting doubt on the official story of the 1960s’ most infamous killing spree.\n\nWatch on Netflix: https://www.netflix.com/title/81482892\n\nAbout Netflix:\nNetflix is one of the world\u0027s leading entertainment services, with 300 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nCHAOS: The Manson Murders | Official Trailer | Netflix\nhttps://www.youtube.com/@Netflix",
      "release": "2025-02-21T17:00:00Z",
      "duration": "00:01:43",
      "explicit": false,
      "youTubeId": "YwoA7NvaacI",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YwoA7NvaacI"
      }
    },
    {
      "id": "c325433c-ad9b-4c9a-8457-f309c026be5f",
      "title": "Sweet Bobby: My Catfish Nightmare | Official Trailer | Netflix",
      "description": "A decade of a catfishing tale... One friend request changes Kirat\u0027s life forever. As her online relationship with Bobby slowly turns to romance, she never guesses he\u0027s not all he seems. From the producers of \u0027The Tinder Swindler\u0027 and \u0027American Nightmare\u0027, Sweet Bobby: My Catfish Nightmare comes to Netflix, October 16.\n\nWatch on Netflix: https://www.netflix.com/title/81591286\n\nAbout Netflix:\nNetflix is one of the world\u0027s leading entertainment services, with 278 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nSweet Bobby: My Catfish Nightmare | Official Trailer | Netflix\nhttps://www.youtube.com/@Netflix\n\nKirat falls for a man she meets online, only to get swept up in a virtual relationship that upends her life for years, in this shocking documentary.",
      "release": "2024-09-24T11:00:03Z",
      "duration": "00:02:20",
      "explicit": false,
      "youTubeId": "w_CH-MZC3vw",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=w_CH-MZC3vw"
      }
    },
    {
      "id": "50b27158-84c9-448d-8909-c0e26fc7d4e8",
      "title": "Dancing for the Devil: The 7M TikTok Cult | Official Trailer | Netflix",
      "description": "A group of prominent TikTok dancers are trapped in a cult masquerading as a management company called 7M. Among them is Miranda Wilking, whose family is desperately trying to get their daughter out. As other dancers and former members escape and work to rebuild their lives, it isn’t until they come together to try and put a stop to the cycle of their abuser that the real healing begins. This three-part documentary series from director Derek Doneen, Dirty Robber and WV Alternative exposes the diabolical tactics used by cult-like organizations to exert control over people as well as the lengths families will go to keep their loved ones safe.\n\nWatch on Netflix: https://www.netflix.com/title/81638163\n\nAbout Netflix:\nNetflix is one of the world\u0027s leading entertainment services, with 270 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nDancing for the Devil: The 7M TikTok Cult | Official Trailer | Netflix\nhttps://www.youtube.com/@Netflix",
      "release": "2024-05-09T15:00:02Z",
      "duration": "00:02:15",
      "explicit": false,
      "youTubeId": "-CCG5RXbtwc",
      "subjects": [
        "7M Films"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=-CCG5RXbtwc"
      }
    },
    {
      "id": "48bd925f-7c79-45cc-9eb4-2dbc8f519c98",
      "title": "The Program: Cons, Cults and Kidnapping | Official Trailer | Netflix",
      "description": "Years after being sent to a disciplinary school, a woman still haunted by her experiences exposes the corruption and abuse of the troubled teen industry.\r\n\r\nWatch on Netflix: https://www.netflix.com/title/81579762\r\n\r\nAbout Netflix:\r\nNetflix is one of the world\u0027s leading entertainment services with over 260 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\r\n\r\nThe Program: Cons, Cults and Kidnapping | Official Trailer | Netflix\r\nhttps://www.youtube.com/@Netflix\r\n\r\nYears after being sent to a disciplinary school, a woman still haunted by her experiences exposes the corruption and abuse of the troubled teen industry.",
      "release": "2024-02-21T13:30:00Z",
      "duration": "00:01:51",
      "explicit": false,
      "youTubeId": "qUvj2dzBpcI",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=qUvj2dzBpcI"
      }
    },
    {
      "id": "0b41b06c-54a9-4c61-85c0-112c5b67a554",
      "title": "Full Episode: Cults, Explained | Netflix",
      "description": "This full episode of Explained looks at how cults lure people in and exert control. Learn a cult\u0027s telltale signs, and how loneliness in life and life online makes indoctrination easier than ever. \n\nExplained is on Netflix now with new episodes weekly on Thursdays.\nhttps://www.netflix.com/title/80216752\n\nSUBSCRIBE: https://bit.ly/29qBUt7\n\nAbout Netflix:\nNetflix is the world\u0027s leading internet entertainment service with over 158 million paid memberships in over 190 countries enjoying TV series, documentaries and feature films across a wide variety of genres and languages. Members can watch as much as they want, anytime, anywhere, on any internet-connected screen. Members can play, pause and resume watching, all without commercials or commitments.\n\nFull Episode: Cults, Explained | Netflix \nhttps://youtube.com/netflix\n\nThis enlightening series from Vox digs into a wide range of topics such as the rise of cryptocurrency, why diets fail, and the wild world of K-pop.",
      "release": "2019-10-18T18:00:01Z",
      "duration": "00:25:57",
      "explicit": true,
      "youTubeId": "6NWIfiV1_XQ",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=6NWIfiV1_XQ"
      }
    }
  ]
}