{
  "_ts": 0,
  "id": "d3548004-acd8-450d-983c-76b261927977",
  "name": "New Books in Literature",
  "spotifyId": "1ZXbZuz9fceV2YZUgEGilu",
  "appleId": 615392417,
  "episodes": [
    {
      "id": "5ab2d780-eb6b-4108-9d33-c197e640348b",
      "title": "Annie Dawid, \u0022Paradise Undone: A Novel of Jonestown\u0022 (Inkspot, 2023)",
      "description": "Paradise Undone: A Novel of Jonestown by Annie Dawid, (Inkspot Publishing 2023), opens long after 917 people died by drinking cyanide or by lethal injection on November 18, 1978. It’s 2008, and one of the survivors, who made it out earlier that day, is speaking to a reporter on the 30th anniversary of the “Jonestown Massacre.” When Jim Jones and his wife Marceline found Peoples Temple in the 1950s, they wanted to give hope to the poor and disenfranchised of all colors. They wanted to live honest lives earning their bread from the earth. They dreamt of their followers coming together as equals, loving each other as sisters and brothers, and building a commune in the British Guyana jungle. As the years passed, Jim Jones became more autocratic, he bedded his followers and sired children, and although Marceline hated what their marriage had become, she still loved him. Even unto death. Annie Dawid writes and teaches online in very rural Colorado, where she also makes rugs and assemblages as well as plays tennis and Scrabble. For the last 7 years, she’s taught in the master’s creative writing program for University College, University of Denver. She received her Ph.D. in 1989 from the University of Denver’s English Dept. in Creative Writing. For 15 years, she was professor of English and Creative Writing director at Lewis \u0026 Clark College in Portland, OR. Her last book, Put Off My Sackcloth: Essays, came out from The Humble Essayist Press in 2021. Her first book, York Ferry: A Novel, Cane Hill Press, 1993, second printing, was positively reviewed in The New York Times Book Review and the Los Angeles Times. It won the 2016 International Rubery Award in Fiction. Her second book was Lily in the Desert: Stories, Carnegie-Mellon University Press, 2001, followed by And Darkness Was Under His Feet: Stories of a Family, Litchfield Review Press, 2009, winner of their inaugural short story collection prize. In 2017, Finishing Line Press published her chapbook, Anatomie of the World: Poems. Along the way, her 10-minute drama, Gun Play, won the New Rocky Mountain Voices Contest and was performed in Westcliffe, Colorado. But most of the last 19 years have been devoted to researching, writing, revising, and searching for a publisher for her Jonestown novel, rewarded, at last, by Inkspot Publishing of the UK and published on the 45th anniversary of the Jonestown massacre. Learn more about your ad choices. Visit megaphone.fm/adchoices Support our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/literature",
      "release": "2023-11-14T09:00:00Z",
      "duration": "00:25:05.8540000",
      "explicit": false,
      "spotifyId": "2pU4O80vq6q93dbGdAnOdt",
      "appleId": 1000634747316,
      "subjects": [
        "Peoples Temple"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2pU4O80vq6q93dbGdAnOdt",
        "apple": "https://podcasts.apple.com/podcast/annie-dawid-paradise-undone-a-novel-of/id615392417?i=1000634747316"
      }
    }
  ]
}