{
  "id": "c95960c6-29d7-4626-b13f-f6d165c21c1a",
  "name": "New Kadampa Tradition Survivors \u0026 Supporters",
  "youTubeChannelId": "UCoUM_amiAOhS8Mb6b2OAkyg",
  "episodes": [
    {
      "id": "739bf7c2-9196-4a68-8763-94be4fd911aa",
      "title": "Anti-NKT Protest Outside Class in Putney - February 25, 2016",
      "description": "[On the video, the protesters are saying \u0027Stop exploiting Tibetan Buddhism\u0027, \u0027Shame on you\u0027 and \u0027Stay away from Tibetans\u0027...Neil Elliott can be seen walking past the protesters into the teaching venue accompanied by a Chinese NKT nun who teaches NKT Dharma in London in Chinese...]\n\nHi folks, just a brief report on today\u0027s demonstration against Neil Elliott held outside his teaching at Putney Library, SW London. Arriving at 1850hrs I met our Tibetan friends where we organised the leaflets (good work on those by the way). We began distributing leaflets to passers-by when a member of our party informed me that Neil and a nun were enjoying a beverage in a local coffee shop. Said party member told me that he thought Neil looked unwell and appeared somewhat frail - struggling to don his coat, scarf etc.\n\nShortly afterwards Neil and the nun came walking towards us where he was greeted with cries of \u0022shame on you\u0022, and other statements I didn\u0027t quite catch as I was too busy recording the event. Neil was shocked and taken aback by the event. This is certainly not something to which he is accustomed. Regaining composure, he appeared aloof and I dare say contemptuous.\nAround 11 members of the public attended the event. There were 9 activists. We stood with a banner where other members of the group distributed further leaflets to those attending the course and other passing members of the public. One gentleman became very angry with our demonstration, declaring he \u0022would not waste his time researching such nonsense\u0022. He was really very upset. He said he knows what he is talking about as he is a Buddhist. Perhaps lacking awareness that he was talking to 8 Tibetans. Someone mentioned they are campaigning for the NKT to stop exploiting their religion. He replied that \u0022Buddhism is a philosophy and not a religion\u0022. Everyone laughed. He became puce with anger and threatened to call the police.\n\nMembers of the public stopped and chatted with us, showing genuine curiosity and support for our course. Two even offered to take pictures for us (on our phones). Once the teaching started we left and had refreshments and conversation.\n\nMy concluding thoughts are: The event was a stark awakening for Neil. He will now be aware that we are serious in damaging his business and most importantly, offering those attending his classes a different narrative. Speaking to the public and those attending the class offered considerable value to what we are trying to achieve. Direction action is powerful, it means we are no longer words on a screen, or a figures in video clips, but real people with a voice and motivation to act with compassion.\n\nhttp://www.kmclondon.org/meditation-classes-putney",
      "release": "2016-02-25T22:09:49Z",
      "duration": "00:00:27",
      "explicit": false,
      "youTubeId": "GuCEyekJlzk",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=GuCEyekJlzk"
      }
    },
    {
      "id": "52df310c-e886-400f-81e7-617fbf3b884c",
      "title": "The Ugly Side of the New Kadampa Tradition",
      "description": "The New York Times recently described the NKT as a “militant sectarian” group who “stalk the Dalai Lama” wherever he goes, and Reuters has exposed the NKT as a religious sect which has been “co-opted by China in a global effort to smear the Dalai Lama”. \n\n*The NKT are not recognized by any mainstream Buddhist organizations.*\n\nThe New Kadampa Tradition is a renegade quasi Buddhist organization whose stated aim is to destroy the reputation and credibility of His Holiness the 14th Dalai Lama. Their members follow His Holiness from place to place, accusing him of being a liar, of being a hypocrite, of being the “false” Dalai Lama. They have proven ties to the Chinese Government who share the same goals as the NKT – namely to destroy the Dalai Lama and cause dissent and confusion amongst the Tibetan people. The NKT oppose the Dalai Lama because he has advised his followers not to propitiate Shugden. The NKT say their religious freedom is being taken away from them. This is obviously untrue as they are free to worship whomever they choose.\n\nThe Spiritual Leader of the Canadian NKT, a western “monk” who calls himself “Kelsang Khyenrab” (this mans real name is Steve Booth) dresses in Tibetan robes and takes a Tibetan name but in fact he has nothing to do with Tibetan Buddhism. “Khyenrab” is one of the most outspoken and aggressive critics of His Holiness.",
      "release": "2016-02-07T17:08:57Z",
      "duration": "00:02:40",
      "explicit": false,
      "youTubeId": "CJ-Cslo5U3w",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CJ-Cslo5U3w"
      }
    },
    {
      "id": "7d483aff-0c11-4309-841f-cc5810de1f63",
      "title": "New Kadampa Tradition Protest at Tibetan Refugee Fundraiser in Vancouver",
      "description": "The New York Times recently described the NKT as a “militant sectarian” group who “stalk the Dalai Lama” wherever he goes, and Reuters has exposed the NKT as a religious sect which has been “co-opted by China in a global effort to smear the Dalai Lama”. \n\n*The NKT are not recognized by any mainstream Buddhist organizations.*\n\nThe New Kadampa Tradition is a renegade quasi Buddhist organization whose stated aim is to destroy the reputation and credibility of His Holiness the 14th Dalai Lama. Their members follow His Holiness from place to place, accusing him of being a liar, of being a hypocrite, of being the “false” Dalai Lama. They have proven ties to the Chinese Government who share the same goals as the NKT – namely to destroy the Dalai Lama and cause dissent and confusion amongst the Tibetan people. The NKT oppose the Dalai Lama because he has advised his followers not to propitiate Shugden. The NKT say their religious freedom is being taken away from them. This is obviously untrue as they are free to worship whomever they choose.\n\nNKT monks and nuns dress in Tibetan robes and take a Tibetan name but in fact they have nothing to do with Tibetan Buddhism. \n\nRecent Articles Related to these Protests \n\nReuters (Chinese Connections)\nhttp://www.reuters.com/investigates/special-report/china-dalailama/\n\nGuardian (‘Extremist’ sect threatens protests)\nhttp://www.theguardian.com/world/2015/jun/13/dalai-lama-uk-visit-extremist-protests\n\nReddit’s Buddhism page bans support of the New Kadampa Tradition\nhttp://www.patheos.com/blogs/americanbuddhist/2016/01/reddit-buddhism-page-bans-support-of-the-new-kadampa-tradition.html\n\n\nOther Important Articles\nhttp://tibet.net/2015/09/statement-of-uk-buddhist-organisations-regarding-protests-against-his-holiness-the-dalai-lam\n\nhttp://www.dalailama.com/messages/dolgyal-shugden/dbo-statementa-by-the-international-shugden-community-new-kadampa-tradition/",
      "release": "2016-02-07T05:29:55Z",
      "duration": "00:00:57",
      "explicit": false,
      "youTubeId": "Ebk49sWcDJ0",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Ebk49sWcDJ0"
      }
    },
    {
      "id": "31f2d44f-ec71-4b6d-9dab-ba0323d2e671",
      "title": "Cult Alert: Anti-Dalai Lama Protesters Form A Creepy Anti-Dalai Lama Choir and Sing!",
      "description": "A substantial proportion of this choir are ordained and lay members of the New Kadampa Tradition: http://kadampa.org/\n\nRelated: \nBuddhist sect smearing and protesting the Dalai Lama gets clandestine backing from China according to groundbreaking Reuters article: http://www.reuters.com/investigates/special-report/china-dalailama/",
      "release": "2015-12-24T01:08:01Z",
      "duration": "00:03:13",
      "explicit": false,
      "youTubeId": "IT7nkwvURkQ",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IT7nkwvURkQ"
      }
    },
    {
      "id": "d7c007cb-6a47-4d49-867e-057129ac129c",
      "title": "What New Kadampa Tradition Nuns Do (But don\u0027t want you to see close-up)",
      "description": "New Kadampa Tradition nuns wearing t-shirts over their robes with a vandalized face of professor Robert Thurman that says: \u0022Robert Thurman False Buddhist). \nWould you like these people to teach you \u0027Beginner Buddhism?\u0027",
      "release": "2015-12-21T21:56:51Z",
      "duration": "00:00:13",
      "explicit": false,
      "youTubeId": "CDp8s2jJ9kY",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=CDp8s2jJ9kY"
      }
    },
    {
      "id": "85da73f0-cc16-4cf6-a4a7-ad9b42569edd",
      "title": "What New Kadampa Tradition Teachers Nuns \u0026 Monks Do (And don\u0027t want you to see close up.)",
      "description": "WHAT NKT TEACHERS DO - AND DON\u0027T WANT YOU TO SEE \u0027CLOSE UP\u0027! (Available in HD: https://www.facebook.com/NewKadampaSurvivorActvists/videos/vb.552379598241201/783726158439876/?type=2\u0026theater)\n\nThis is a repost of a video that \u0027disappeared\u0027 last week. It shows footage of the most senior teachers of the New Kadampa Tradition who live on stipends from NKT centres, posing as members of the \u0027International Shugden Community\u0027 as they demonstrate against His Holiness the Dalai Lama in Aldershot, July 29th 2015. Shortly after this video was taken, which is a walk through one of three NKT/ISC protest areas, the protesters crossed the road, facilitated by the police in the name of \u0027freedom of speech\u0027 and, standing directly behind the main stage at the gate of Aldershot Football Stadium shouted and drummed so loudly that neither the Dalai Lama nor the Mayor of Aldershot could be heard clearly.\nNear the end of the video Gen Kelsang Dekyong, Spiritual Director of the NKT, can be seen close to the camera. Neil Elliott can be seen in the first few minutes seated beside the table where attendees appear to be paying. You can experience what it feels like to be \u0027in\u0027 the NKT. Accounts of people who are now \u0027out\u0027 of the NKT can be found here:\n\nhttps://www.facebook.com/NewKadampaSurvivorTestimonies/\n\nNOTE that this footage was taken on a public right of way and is therefore legally taken and shown.\n\nRelated Update: \nBuddhist sect smearing Dalai Lama gets clandestine backing from China http://www.reuters.com/investigates/special-report/china-dalailama/",
      "release": "2015-12-18T20:42:40Z",
      "duration": "00:03:26",
      "explicit": false,
      "youTubeId": "i82uz6QxPu0",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=i82uz6QxPu0"
      }
    },
    {
      "id": "3046568c-bed4-4336-ab35-f892a4b2184e",
      "title": "Second Protest Speech at Bodhisattva Buddhist Meditation Centre, Brighton",
      "description": "On Dec, 13, 2015, a small but effective demonstration was staged today, organised by an independent, London-based Tibetan group outside Bodhisattva Centre in Brighton. It was attended by about about 15 to 20 people - both Tibetans and former members/survivors of the NKT. We also delivered about 1,000 information leaflets to houses and cafes in the surrounding area. \n\nHere is a speech from one of the activists\n\nRelated Update: \nBuddhist sect smearing Dalai Lama gets clandestine backing from China http://www.reuters.com/investigates/special-report/china-dalailama/",
      "release": "2015-12-18T06:52:44Z",
      "duration": "00:03:02",
      "explicit": false,
      "youTubeId": "vB1Y17Rcl9o",
      "subjects": [
        "New Kadampa Tradition",
        "_London"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=vB1Y17Rcl9o"
      }
    },
    {
      "id": "0733bcd1-9409-4b34-a6a8-0a9ce9c246c6",
      "title": "Activists Give Speech outside the New Kadampa Tradition\u0027s Bodhisattva Kadampa Meditation Centre",
      "description": "A small but effective demonstration was staged today, organised by an independent, London-based Tibetan group outside Bodhisattva Centre in Brighton. It was attended by about about 15 to 20 people - both Tibetans and former members/survivors of the NKT. We also delivered about 1,000 information leaflets to houses and cafes in the surrounding area. \n\nHere is a speech from one of the activists\n\nRelated Update: \nBuddhist sect smearing Dalai Lama gets clandestine backing from China http://www.reuters.com/investigates/special-report/china-dalailama/",
      "release": "2015-12-17T08:00:56Z",
      "duration": "00:03:28",
      "explicit": false,
      "youTubeId": "T0K4AcG71XQ",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=T0K4AcG71XQ"
      }
    },
    {
      "id": "b66adf2a-b34e-473d-baf0-fa679c377f63",
      "title": "Delivery of Letter to Bodhisattva Centre in Brighton, UK",
      "description": "NKT (New Kadampa Tradition) STOP STALKING THE DALAI LAMA!\n\nA letter addressed to Kelsang Chodor and the Spiritual Directors of the NKT was personally delivered today through the front door of the NKT\u0027s Brighton centre, asking them to please desist from their highly disrespectful, non-Buddhist, offensive and disturbing campaign of stalking the Dalai Lama all over the world, in order to villify, denigrate, ridicule and shout abuse at him. \n\nWatch for what the NKT person says when they open the door (\u0022We Don\u0027t Have Anything to Say to You...\u0022)...If only that was true the troubles would be over. Perhaps he did not notice the irony of his statement.",
      "release": "2015-12-17T07:50:14Z",
      "duration": "00:01:24",
      "explicit": false,
      "youTubeId": "WraytVAZN0M",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WraytVAZN0M"
      }
    },
    {
      "id": "d03eb11e-8491-4ac6-9186-6a12e64d52b4",
      "title": "New Kadampa Tradition Disrupt His Holiness the Dalai Lama\u0027s Teachings in Aldershot",
      "description": "It was widely known that the New Kadampa Tradition (ISC) had booked in to protest against His Holiness the Dalai Lama on June 29th, 2015 in Aldershot where he was being hosted to give Dharma teachings by the main Nepalese (Gurkha) Community in the UK that follows Tibetan Buddhism. \n\nI am sure you can understand that this only demonstrates the NKT/ISC\u0027s utter lack of compassion and consideration for others at a time of tragic crisis for the Nepalese people (shortly after the Nepalese earthquakes). We\u0027re still absolutely disgusted by this.\n\nRelated Update: \nBuddhist sect smearing Dalai Lama gets clandestine backing from China http://www.reuters.com/investigates/special-report/china-dalailama/",
      "release": "2015-12-17T05:42:08Z",
      "duration": "00:08:16",
      "explicit": false,
      "youTubeId": "2nz9hzENIso",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2nz9hzENIso"
      }
    },
    {
      "id": "0629060b-652d-4779-98f4-6bd9e524cd81",
      "title": "Tibetans \u0026 Former NKT Protest at Bodhisattva Kadampa Meditation Centre",
      "description": "Brighton, UK Sunday 13th December, outside the New Kadampa Tradition\u0027s Bodhisattva Kadampa Meditation Centre\n\nA small but effective demonstration was staged today, organised by an independent, London-based Tibetan group outside Bodhisattva Centre in Brighton. It was attended by about about 15 to 20 people - both Tibetans and former members/survivors of the NKT. We also delivered about 1,000 information leaflets to houses and cafes in the surrounding area.\n\nRelated Update: \nBuddhist sect smearing Dalai Lama gets clandestine backing from China http://www.reuters.com/investigates/special-report/china-dalailama/\n\nFor more about the New Kadampa Survivor Activists, visit our Facebook page: https://www.facebook.com/NewKadampaSurvivorActvists/?fref=ts\n\n\n\nThe Bodhisattva Kadampa Meditation Centre and its teachers:\n\nKelsang Chodor\nSteve Cansdale - Teacher in Horsham (Mondays)\nSara Gurton - Teacher in Crawley (Tuesdays)\nAlison Boseley - Teacher in Uckfield (Tuesdays)\nKelsang Lamchen - Teacher in Worthing (Tuesdays)\nJoanna Sancha - Morning Meditations (Wednesdays)\nJessica Green - Childrens Classes Teacher (Thursdays)\nKelsang Dana\nRob Lengfeld - Lunchtime Meditation (Fridays)\nKadam Bridget Heyes (National Spiritual Director)\n\nEmail: info@meditateinbrighton.com\n\nCall: \n(01273) 732917\n\nHours of Operation: \nTuesdays – Saturdays (11.00 am – 5.00 pm)\n\nMailing Address:\nBodhisattva KMC,\n3 Lansdowne Road,\nBrighton,\nEast Sussex.\nBN3 1DN \n\nVisit their website: http://meditateinbrighton.com/",
      "release": "2015-12-17T05:17:12Z",
      "duration": "00:02:24",
      "explicit": false,
      "youTubeId": "907XjJ7FqJI",
      "subjects": [
        "New Kadampa Tradition"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=907XjJ7FqJI"
      }
    }
  ]
}