{
  "id": "c784f579-28ad-4f4d-96a0-3f14299e8c06",
  "name": "New Thinking Allowed with Jeffrey Mishlove",
  "appleId": 1435178031,
  "youTubeChannelId": "UCFk448YbGITLnzplK7jwNcw",
  "episodes": [
    {
      "id": "9c65c869-fd84-4a93-933a-8a93988212b8",
      "title": "On Cults and Messiahs with Don Lattin",
      "description": "Don Lattin, a former journalist, is author of Jesus Freaks: A True Story of Murder and Madness on the Evangelical Edge; Following Our Bliss: How the Spiritual Ideals of the Sixties Shape Our Lives Today; The Harvard Psychedelic Club: How Timothy Leary, Ram Dass, Huston Smith, and Andrew Weil Killed the Fifties and Ushered in a New Age for America; Changing Our Minds: Psychedelic Sacraments and the New Psychotherapy; and Distilled Spirits: Getting High, and then Sober, with a Famous Writer, a Forgotten Philosopher, and a Hopeless Drunk. His newest book is God on Psychedelics.\n\nDon shares insights from his investigative work on cults, messianic figures, and the spiritual movements of the 20th and 21st centuries. Lattin explores the intersections of spirituality, psychology, and power dynamics in religious movements.\n\n00:00 Introduction\n04:04 Jonestown and the religion beat\n07:00 The evolution of cults and religion\n11:51 Adida and the Fijian Ashram stories\n23:01 OneTaste and sensual spirituality\n29:00 Christian nationalism and Trump as a messiah\n41:00 Historical roots of authoritarian spirituality\n44:44 Parallels between cults and modern movements\n45:57 The complexity of charismatic leadership\n46:58 Conclusion\n\nNew Thinking Allowed host, Jeffrey Mishlove, PhD, is author of The Roots of Consciousness, Psi Development Systems, and The PK Man. Between 1986 and 2002 he hosted and co-produced the original Thinking Allowed public television series. He is the recipient of the only doctoral diploma in \u0022parapsychology\u0022 ever awarded by an accredited university (University of California, Berkeley, 1980). He is also the Grand Prize winner of the 2021 Bigelow Institute essay competition regarding the best evidence for survival of human consciousness after permanent bodily death. He is Co-Director (with Callum Cooper) of Parapsychology Education at the California Institute for Human Science.\n\n(Recorded on September 28, 2025)\n\nFor a short video on How to Get the Most From New Thinking Allowed, go to https://youtu.be/aVbfPFGxv9o\n\nFor a complete, updated list with links to all of our videos, see https://newthinkingallowed.com/Listings.htm.\n\nCheck out the New Thinking Allowed Foundation website at http://www.newthinkingallowed.org. There you will find our incredible, searchable database as well as opportunities to shop and to support our video productions – plus, this is where people can subscribe to our FREE, weekly Newsletter and can download a FREE .pdf copy of our quarterly magazine.\n\nTo order high-quality, printed copies of our quarterly magazine: NTA-Magazine.MagCloud.com\n\nIf you would like to join our team of volunteers, helping to promote the New Thinking Allowed YouTube channel on social media, editing and translating videos, creating short video trailers based on our interviews, helping to upgrade our website, or contributing in other ways (we may not even have thought of), please send an email to friends@newthinkingallowed.com.\n\nTo join the NTA Psi Experience Community on Facebook, see https://www.facebook.com/groups/1953031791426543/\n\nTo download and listen to audio versions of the New Thinking Allowed videos, please visit our new podcast at https://itunes.apple.com/us/podcast/new-thinking-allowed-audio-podcast/id1435178031.\n\nYou can help support our video productions while enjoying a good book. To order a copy of New Thinking Allowed Dialogues: Is There Life After Death? click on https://amzn.to/3LzLA7Y (As an Amazon Associate we earn from qualifying purchases.)\n\nTo order the 2nd book in the New Thinking Allowed Dialogues series, Russell Targ: Ninety Years of ESP, Remote Viewing, and Timeless Awareness, go to https://amzn.to/4aw2iyr\n\nTo order a copy of New Thinking Allowed Dialogues: UFOs and UAP – Are We Really Alone?, go to https://amzn.to/3Y0VOVh\n\nDownload \u0026 read Jeffrey Mishlove\u0027s Grand Prize essay in the Bigelow Institute competition, Beyond the Brain: The Survival of Human Consciousness After Permanent Bodily Death, go to https://www.bigelowinstitute.org/docs/1st.pdf.\n\nTo order The Harvard Psychedlic Club by Don Lattin, visit https://amzn.to/3LnkUa8. \n\nTo order Distilled Spirits by Don Lattin, go to https://amzn.to/3L2d4kP. \n\nTo order God on Psychedelics by Don Lattin, click here: https://amzn.to/3N7vSC3",
      "release": "2025-10-20T02:00:13Z",
      "duration": "00:48:50",
      "explicit": false,
      "youTubeId": "Fo3moD1uWWo",
      "subjects": [
        "Evangelicalism",
        "NXIVM",
        "Onetaste",
        "Peoples Temple",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Fo3moD1uWWo"
      }
    },
    {
      "id": "e0528ffa-7645-43d8-a24c-e25770d778e4",
      "title": "Understanding Cult Behavior with Arthur Deikman (1929 - 2013)",
      "description": "This video is a special release from the original Thinking Allowed series that ran on public television from 1986 until 2002. It was recorded in about 1990. It will remain public for only one week. \n\nArthur J. Deikman was a clinical professor of psychiatry at the University of California, San Francisco, and a member of the editorial board of the Journal of Humanistic Psychology. He is author of The Wrong Way Home: Uncovering the Patterns of Cult Behavior in American Society.\n\nNow you can watch all of the programs from the original Thinking Allowed Video Collection, hosted by Jeffrey Mishlove. Subscribe to the new Streaming Channel (https://thinkingallowed.vhx.tv/) and watch more than 350 programs now, with more, previously unreleased titles added weekly.\n\nFree month of the classic Thinking Allowed streaming channel for New Thinking Allowed subscribers only. Use code THINKFREELY.\n\nFor a short video on How to Get the Most From New Thinking Allowed, go to https://youtu.be/aVbfPFGxv9o\n\nFor a complete, updated list with links to all of our videos, see https://newthinkingallowed.com/Listings.htm.\n\nCheck out the New Thinking Allowed Foundation website at http://www.newthinkingallowed.org. There you will find our incredible, searchable database as well as opportunities to shop and to support our video productions – plus, this is where people can subscribe to our FREE, weekly Newsletter and can download a FREE .pdf copy of our quarterly magazine.\n\nCheck out New Thinking Allowed\u0027s AI chatbot. You can create a free account at https://ai.servicespace.org When you enter the space, you will see that our chatbot is one of several you can interact with. While it is still a work in progress, it has been trained on 1,600 NTA transcripts. It can provide intelligent answers about the contents of our interviews. It\u0027s almost like having a conversation with Jeffrey Mishlove.\n\nTo order high-quality, printed copies of our quarterly magazine, visit https://NTA-Magazine.MagCloud.com\n\nIf you would like to join our team of volunteers, helping to promote the New Thinking Allowed YouTube channel on social media, editing and translating videos, creating short video trailers based on our interviews, helping to upgrade our website, or contributing in other ways (we may not even have thought of), please send an email to friends@newthinkingallowed.com.\n\nTo join the NTA Psi Experience Community on Facebook, see https://www.facebook.com/groups/1953031791426543/\n\nTo download and listen to audio versions of the New Thinking Allowed videos, please visit our new podcast at https://itunes.apple.com/us/podcast/new-thinking-allowed-audio-podcast/id1435178031.\n\nYou can help support our video productions while enjoying a good book. To order a copy of New Thinking Allowed Dialogues: Is There Life After Death? click on https://amzn.to/3LzLA7Y (As an Amazon Associate we earn from qualifying purchases.)\n\nTo order New Thinking Allowed Dialogues: Russell Targ – Ninety Years of ESP, Remote Viewing, and Timeless Awareness, go to https://amzn.to/4aw2iyr\n\nTo order New Thinking Allowed Dialogues: UFOs and UAP – Are We Really Alone?, go to https://amzn.to/3Y0VOVh\n\nDownload and read Jeffrey Mishlove\u0027s Grand Prize essay in the Bigelow Institute competition, Beyond the Brain: The Survival of Human Consciousness After Permanent Bodily Death, go to https://www.bigelowinstitute.org/docs/1st.pdf.\n\nTo order The Wrong Way Home by Arthur Deikman, go to https://amzn.to/41cJNNj",
      "release": "2025-08-09T02:01:18Z",
      "duration": "00:30:24",
      "explicit": false,
      "youTubeId": "2hKFHZ1I8SY",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=2hKFHZ1I8SY"
      }
    },
    {
      "id": "f4ae17d7-0314-4128-960e-e4ba3370d4ae",
      "title": "Deconstructing Cults and Undue Influence with Steven Hassan",
      "description": "Steven Hassan, PhD, is a licensed mental health professional, a recognized expert on cults and undue influence, and possesses professional experience both in the US and abroad. Over the course of his 47-year career, Dr. Hassan has assisted numerous individuals and families in their recovery from undue influence. He is highly sought after as one of the foremost authorities on the subject of undue influence by both controlling groups and individuals. Steve possesses a unique perspective, having experienced life as a former cult member who was successfully deprogrammed in 1976, and as a clinical professional who has dedicated his life to aiding others in similar situations. To reach him about an issue you might be concerned about contact him at: https://freedomofmind.com.\n\nSteven Hassan shares his personal experience of being in a cult and how he escaped. He discusses the concept of undo influence and the importance of psychoeducation to combat it. He emphasizes the need for nuanced thinking when it comes to cults and the influence continuum. \n\n00:46 Introduction and personal experience in a cult\n05:20 Escaping from the Moonie cult \n10:00 Continued learning and the concept of undue influence\n14:55 Is there a true self or are we only social constructions?\n16:49 Raising heathy children without a screen\n23:46 Ethical influence and the influence continuum\n38:40 Focusing on planetary survival\n41:50 Creating ground rules for talking to “the other”\n45:00 Building relationships based on respect and understanding\n50:45 The Twin Flame cult \u0026 forced gender changes\n55:36 Conclusion\n\nGuest host, Debra Lynne Katz, PhD, is author of You Are Psychic: The Art of Clairvoyant Reading and Healing, Extraordinary Psychic: Proven Techniques to Master Your Natural Psychic Abilities, and Freeing the Genie Within: Manifesting Abundance, Creativity, and Success in Your Life. She is co-author, with Jon Knowles, of Associative Remote Viewing: The Art and Science of Predicting Outcomes for Sports, Politics, Finances, and the Lottery. Debra currently serves as President of the International Remote Viewing Association. She founded the International School of Clairvoyance in 2005 and offers a variety of online courses in intuitive development. Her website is https://www.debrakatz.com/.\n\n(Recorded on June 18, 2024)\n\nFor a short video on How to Get the Most From New Thinking Allowed, go to https://youtu.be/aVbfPFGxv9o\n\nFor a complete, updated list with links to all of our videos, see https://newthinkingallowed.com/Listings.htm.\n\nCheck out the New Thinking Allowed Foundation website at http://www.newthinkingallowed.org. There you will find our incredible, searchable database as well as opportunities to shop and to support our video productions – plus, this is where people can subscribe to our FREE, weekly Newsletter and can download a FREE .pdf copy of our quarterly magazine.\n\nTo order high-quality, printed copies of our quarterly magazine: NTA-Magazine.MagCloud.com\n\nCheck out New Thinking Allowed\u0027s AI chatbot. You can create a free account at ai.servicespace.org. When you enter the space, you will see that our chatbot is one of several you can interact with. While it is still a work in progress, it has been trained on 1,600 NTA transcripts. It can provide intelligent answers about the contents of our interviews. It\u0027s almost like having a conversation with Jeffrey Mishlove.\n\nIf you would like to join our team of volunteers, helping to promote the New Thinking Allowed YouTube channel on social media, editing and translating videos, creating short video trailers based on our interviews, helping to upgrade our website, or contributing in other ways (we may not even have thought of), please send an email to friends@newthinkingallowed.com.\n\nTo join the NTA Psi Experience Community on Facebook, see https://www.facebook.com/groups/1953031791426543/\n\nTo download and listen to audio versions of the New Thinking Allowed videos, please visit our new podcast at https://itunes.apple.com/us/podcast/new-thinking-allowed-audio-podcast/id1435178031.\n\nDownload and read Jeffrey Mishlove\u0027s Grand Prize essay in the Bigelow Institute competition, Beyond the Brain: The Survival of Human Consciousness After Permanent Bodily Death, go to https://www.bigelowinstitute.org/docs/1st.pdf. \n\nYou can help support our video productions while enjoying a good book. To order a copy of New Thinking Allowed Dialogues: Is There Life After Death? click on https://amzn.to/3LzLA7Y (As an Amazon Associate we earn from qualifying purchases.)\n\nTo order the second book in the New Thinking Allowed Dialogues series, Russell Targ: Ninety Years of ESP, Remote Viewing, and Timeless Awareness, go to https://amzn.to/4aw2iyr\n\nTo order a copy of New Thinking Allowed Dialogues: UFOs and UAP – Are We Really Alone?, go to https://amzn.to/3Y0VOVh",
      "release": "2024-10-02T02:00:11Z",
      "duration": "00:58:36",
      "explicit": false,
      "appleId": 1000671617339,
      "youTubeId": "QS9p0i5JSFg",
      "subjects": [
        "Cult-Expert",
        "Cult Psychology"
      ],
      "urls": {
        "apple": "https://podcasts.apple.com/podcast/deconstructing-cults-and-undue-influence-with/id1435178031?i=1000671617339",
        "youtube": "https://www.youtube.com/watch?v=QS9p0i5JSFg"
      }
    }
  ]
}