{
  "_ts": 0,
  "id": "ae6cc846-bc6f-4595-bcaa-c31931e9ed8c",
  "name": "New Books in Neuroscience",
  "spotifyId": "7jKu4Dn87nOw7ARpwOvnkf",
  "appleId": 498978442,
  "episodes": [
    {
      "id": "bd891678-e665-45b7-9298-94ea3a979410",
      "title": "Rebecca Lemov, \u0022The Instability of Truth: Brainwashing, Mind Control, and Hyper-Persuasion\u0022 (Norton, 2025)",
      "description": "Because brainwashing affects both the world and our observation of the world, we often don’t recognize it while it’s happening—unless we know where to look. As Rebecca Lemov writes in T he Instability of Truth , “Brainwashing erases itself.” What we call brainwashing is more common than we think; it is not so much what happens to other people as what can happen to anyone. The Instability of Truth exposes the myriad ways our minds can be controlled against our will, from the brainwashing techniques used against American POWs in North Korea to the “soft” brainwashing of social media doomscrolling and behavior-shaping. In our increasingly data-driven world, anyone can fall victim to mind control. Lemov identifies invasive forms of emotional engineering that exploit trauma and addiction to coerce and persuade in everyday life. Tracing the word “brainwashing” from deep in the files of an operative of the U.S. Office of Strategic Services in the 1950s to the pioneering research of Robert Jay Lifton, to the public trials of cult leaders and the case of Patty Hearst, Lemov also studies how the idea of mind control has spread across the globe and penetrated courtrooms, secret labs, military schools, and today’s digital sites. The Instability of Truth offers lessons from mind-control episodes past and present. Truth is always subject to question in more mundane walks of life than most people believe, and Lemov equips us for the increasing challenges we face from social media, AI, and an unprecedented, global form of surveillance capitalism. The Instability of Truth develops a rigorous new understanding of both brainwashing’s paradoxes and its emotional roots, by giving voice to brainwashers, the brainwashed, and third-party observers alike. Learn more about your ad choices. Visit megaphone.fm/adchoices Support our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/neuroscience",
      "release": "2025-07-11T08:00:00Z",
      "duration": "00:37:39.4350000",
      "explicit": false,
      "spotifyId": "7jDwio5AHQJegW8Z40o4Il",
      "appleId": 1000716801984,
      "subjects": [
        "Cult Psychology",
        "Cult-Expert",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7jDwio5AHQJegW8Z40o4Il",
        "apple": "https://podcasts.apple.com/podcast/rebecca-lemov-the-instability-of-truth-brainwashing/id498978442?i=1000716801984"
      }
    }
  ]
}