{
  "_ts": 0,
  "id": "31adc657-6150-4462-a9d9-a321febf8f80",
  "name": "New Books in American Politics",
  "spotifyId": "38MywtGt0Wp5JGcLuDyQpv",
  "appleId": 1524639831,
  "episodes": [
    {
      "id": "801c2d0d-86d6-4b93-b5dd-292c532e090f",
      "title": "Hank Willenbrink, \u0022Performing for the Don: Theatres of Faith in the Age of Trump\u0022 (Routledge, 2024)",
      "description": "From his overwhelming embrace by evangelicals and other people of faith to his championing of policies and conservative judicial candidates long sought by right-wing Christians, Donald Trump’s candidacy, campaign, and presidency were empowered by believers of many stripes who employed different methods of rationalizing or Christianizing Trump and his administration. In Performing for the Don: Theatres of Faith in the Trump Era (Routledge, 2024), Hank Willenbrink examines this intersection of political power and religion through the lens of performance studies, in part via Trump’s own expressions but predominantly through mass media performances of his Christian supporters. From Trump’s affiliation with his “court evangelicals” and televangelists to the 2018 film The Trump Prophecy and other prophetic/apostolic movements latching onto Trump’s ascension in service of dominionistic ends, and from his support among very conservative Catholics to the “cult” of Trump that has coalesced in conspiratorial online spaces advocating QAnon beliefs, the last decade has witnessed a mainstreaming of theology and ideology ripe for an interdisciplinary analysis of the performative aspects of Trump’s faith-based support. Dr. Willenbrink joined the New Books Network to discuss all these subjects as well as Christian nationalism in the present American political climate. Hank Willenbrink (Ph.D. in Dramatic Art from the University of California, Santa Barbara) is Associate Professor in the Department of English and Theatre at The University of Scranton in Pennsylvania. A scholar and theatre artist, Hank has published on a range of topics like Hell Houses, the playwright Naomi Iizuka, the intersections of playwriting and nature writing, and the use of music in HBO’s Girls. With his wife, Dr. Yamile Silva, he co-edited an anthology of contemporary Spanish and Portuguese writing. Hank’s play, The Boat in the Tiger Suit, premiered in New York and is published by Original Works Publishing. He’s developed theatrical work internationally, including at Sala Beckett in Barcelona. Hank has also led several interdisciplinary, community-engaged projects that bring together students and community members of diverse backgrounds and disciplines to engage in deeper and more intentional ways through collectively created theatrical performance. Hank played in a number of questionable bands, co-founded the music blog We Listen for You, and hails from Toad Suck, Arkansas. He is currently continuing the research that he discusses on today’s podcast episode on his Substack: performingforthedon.substack.com . Rob Heaton (Ph.D., University of Denver, 2019) primarily hosts Biblical Studies conversations for New Books in Religion and teaches New Testament, Christian origins, and early Christianity at Anderson University in Indiana. He recently authored The Shepherd of Hermas as Scriptura Non Grata: From Popularity in Early Christianity to Exclusion from the New Testament Canon (Lexington Books, 2023). For more about Rob and his work, or to offer feedback related to this episode, please visit his website at https://www.robheaton.com . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-06-23T08:00:00Z",
      "duration": "01:27:22.8270000",
      "explicit": false,
      "spotifyId": "374npUCfGOhQ6v4weqgQc2",
      "appleId": 1000659938605,
      "subjects": [
        "Qanon",
        "Evangelicalism",
        "Catholicism",
        "Christian Fundamentalist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/374npUCfGOhQ6v4weqgQc2",
        "apple": "https://podcasts.apple.com/podcast/hank-willenbrink-performing-for-the-don-theatres/id1524639831?i=1000659938605"
      }
    }
  ]
}