{
  "id": "14c14ece-4b4a-44b9-a580-bbd7e23f6f81",
  "name": "Newscast",
  "spotifyId": "2A8GIhYh5xDSJJrnplUePR",
  "appleId": 1234185718,
  "youTubeChannelId": "UC16niRr50-MSBwiO3YDb3RA",
  "youTubePlaylistId": "PLS3XGZxi7cBU_AtRadnVPJPRC6LHrexaF",
  "episodes": [
    {
      "id": "aa9514f2-5f21-4537-829a-e59a716006ee",
      "title": "Has the Andrew Saga Changed the Relationship Between Parliament and the Palace?",
      "description": "Today, we discuss how the saga the led to Prince Andrew becoming Andrew Mountbatten Windsor might have led to a shift in the relationship between politicians and the Palace.\nPressure is also mounting on Andrew from politicians in the US as members of a congressional committee investigating the Jeffrey Epstein case have intensified their calls for Andrew to answer questions about his links to the late sex offender.\nAlex steps in for Paddy who’s away.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \u0022Ask BBC Sounds to play Newscast”. It works on most smart speakers. \n \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on \u002B44 0330 123 9480.\nNew episodes released every day. If you\u0027re in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\n \nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Laura Kuenssberg and Alex Forsyth. It was made by Chris Flynn with Laura Cain. The social producer was Sophie Millward. The technical producer was Mike Regaard. The weekend series producer is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.",
      "release": "2025-11-01T18:33:00Z",
      "duration": "00:23:30",
      "explicit": false,
      "spotifyId": "3PSEicRubuVOJ5xRJWgqZQ",
      "appleId": 1000734635631,
      "youTubeId": "dSo8rVSbi-Q",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PSEicRubuVOJ5xRJWgqZQ",
        "apple": "https://podcasts.apple.com/podcast/has-the-andrew-saga-changed-the-relationship/id1234185718?i=1000734635631",
        "youtube": "https://www.youtube.com/watch?v=dSo8rVSbi-Q"
      }
    },
    {
      "id": "9c3d8ff6-bd3d-463a-9470-8ee8a1399363",
      "title": "Why King Charles decided to strip Andrew of his title of ‘Prince’ | BBC Newscast",
      "description": "Buckingham Palace has announced it has stripped Andrew of his title of “Prince”. \n\nHe will be now known as Andrew Mountbatten Windsor - effective immediately. He will also have to leave his official residence, the Royal Lodge.\n\nAdam is joined by Victoria Derbyshire, Newsnight Presenter and BBC Royal Correspondent Daniela Relph. \n\nSubscribe here: http://bit.ly/1rbfUog\n\nFor more news, analysis and features visit: www.bbc.com/news \n\n#BBCNews",
      "release": "2025-10-31T06:08:50Z",
      "duration": "00:24:38",
      "explicit": false,
      "spotifyId": "2HXJEUKFz4TxwbQR88EsoV",
      "appleId": 1000734299907,
      "youTubeId": "lBHI3uTTxS4",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2HXJEUKFz4TxwbQR88EsoV",
        "apple": "https://podcasts.apple.com/podcast/andrew-stripped-of-prince-title/id1234185718?i=1000734299907",
        "youtube": "https://www.youtube.com/watch?v=lBHI3uTTxS4"
      }
    },
    {
      "id": "18f330d2-dc2b-408a-a1e1-7ab3aa89b937",
      "title": "The Virginia Giuffre Memoir And Prince Andrew",
      "description": "Today, we discuss the allegations made in Virginia Giuffre’s memoir against Prince Andrew. Virginia Giuffre passed away in April after taking her own life, but finished writing the book before her death. The book goes into detail about the allegations she has made against Jeffrey Epstein, Prince Andrew and Ghislaine Maxwell. Prince Andrew denies all of the allegations made against him, but gave up his royal titles on Friday. What does Giuffre say in the book, and how have the Royal Family responded? Adam is joined in the studio with BBC Newsnight presenter Victoria Derbyshire, and BBC royal correspondent Daniela Relph. You can now listen to Newscast on a smart speaker. If you want to listen, just say \u0022Ask BBC Sounds to play Newscast”. It works on most smart speakers. You can join our Newscast online community here: https://bbc.in/newscastdiscord Get in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on \u0026#43;44 0330 123 9480. New episodes released every day. If you\u0027re in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd Newscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi. The social producer was Sophie Millward. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.",
      "release": "2025-10-20T18:38:00Z",
      "duration": "00:26:14.8180000",
      "explicit": true,
      "spotifyId": "5TJnVGcyMGuFSZACrbsNdl",
      "appleId": 1000732692380,
      "youTubeId": "FH220cWGhT0",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TJnVGcyMGuFSZACrbsNdl",
        "apple": "https://podcasts.apple.com/podcast/the-virginia-giuffre-memoir-and-prince-andrew/id1234185718?i=1000732692380",
        "youtube": "https://www.youtube.com/watch?v=FH220cWGhT0"
      }
    }
  ]
}