{
  "id": "c46b1533-264c-4a98-ab00-df13d70bbc5f",
  "name": "News 12 Originals",
  "youTubeChannelId": "UC6Z6tdwvILugtU-18Au-yQg",
  "episodes": [
    {
      "id": "5e24fe1b-7da0-455a-8d87-99bc1cf3beac",
      "title": "Is the Sarah Lawrence College sex cult leader innocent? - Crime Files | News 12 Originals",
      "description": "News 12\u0027s Senior Reporter Tara Rosenblum delves into the mind of Lawrence Ray, the so-called Sarah Lawrence sex cult leader who moved into his daughter\u0027s dorm and abused her roommates and friends. \n\nNews 12\u0027s explosive new Crime Files special, \u0027Sex, Lies \u0026 Terror: The Larry Ray Tapes,\u0027 features the first interviews with Ray since he was sentenced to 60 years in prison for sex trafficking, extortion, and conspiracy, among other charges.\n\n0:00 - Introduction \n1:45 - Is the Sarah Lawrence College sex cult leader innocent?\n2:45 - Larry Ray speaks to News 12 Senior Reporter Tara Rosenblum after his prison attack\n5:32 - What happened to the students who knew Larry Ray?\n11:30 - Larry Ray reveals his past of abuse\n14:25 - Larry\u0027s career on Wall Street and alleged influence in the government \n17:04 - The arrest and trial of Larry Ray\n\n» Subscribe to News 12 Originals: https://bit.ly/n12youtubeoriginals\n\nAbout News 12 Originals: News 12 Originals feature exclusive television series and documentaries dedicated to entertainment and engagement. Explore the popular Long Island region in The East End, uncover secrets across NY, NJ, and CT in Revealed, and dive into the true crime docuseries Crime Files, which tells local crime stories through the perspectives of victims, detectives, and News 12 journalists. Additionally, watch Emmy Award-winning documentaries from the Team 12 Investigates journalists.\n\nConnect with News 12 Originals:\nWhere to Watch News 12: https://bit.ly/3Var02B\nVisit the News 12 Website: https://bit.ly/44CsG89\nSubscribe to News 12 Originals on YouTube: https://bit.ly/4dyeWzd\nFind News 12 on Facebook: https://bit.ly/4agiXWl\nFollow News 12 on Instagram: https://bit.ly/44E6SJw\nFollow News 12 on X (formerly Twitter): https://bit.ly/4dyezVl\n\n#CrimeFiles #newyork #crime \nIs the Sarah Lawrence College sex cult leader innocent? - Crime Files | News 12 Originals",
      "release": "2025-12-25T19:00:31Z",
      "duration": "00:20:34",
      "explicit": false,
      "youTubeId": "Nb_0h5SsIig",
      "subjects": [
        "Larry Ray"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Nb_0h5SsIig"
      }
    }
  ]
}