{
  "_ts": 0,
  "id": "f9c8c364-787f-47bc-9782-8aebc1bfd9f1",
  "name": "Next Up: Narcissism",
  "spotifyId": "1aeBenKtsnHZcAMy4JekqP",
  "appleId": 1737212532,
  "youTubeChannelId": "UCtp5Rvzjo-x-RM_FgRaYuaQ",
  "episodes": [
    {
      "id": "5b5ef3ac-1542-410e-bc08-196c403c8ddd",
      "title": "Episode 25: Coercive Control and Cult Behavior with Vanessa Reiser",
      "description": "“The narcissist will never be able to fix their corrupt disorder. It is a rigid disorder,” says Vanessa Reiser, a licensed clinical social worker and author who specializes in narcissistic and cult abuse. She joins Dr. Z to talk about the striking similarities between narcissistic relationships and cult dynamics, focusing on how coercive control plays a role in both. Drawing from her own life experiences and professional background, Vanessa shares insights from her book “Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People.” She breaks down how narcissists deploy tactics like gaslighting, isolating their victims, and enlisting enablers (often called “flying monkeys”) to keep control. But how does this connect to cult-like dynamics? Vanessa explains that these methods work by stripping away a person’s identity that will trap them in a mental prison that’s just as damaging as the control seen in actual cults. This episode reminds listeners of the resilience required to break free from these toxic environments and the importance of building supportive relationships that will help individuals reclaim their identities. Vanessa’s insights offer valuable tools and strategies for overcoming these challenges that encourage listeners to seek help and validation as they move toward healing and self-empowerment. Quotes “A real cult is always led by somebody who’s trying to control, groom, and manipulate others to get supply and attention. We see this in intimate relationships and families. What they’re doing is using the classic tactics of narcissists to manipulate others to do what they want. They will isolate and get you to basically only view their opinions.” (05:01 | Vanessa Reiser) “There’s this misconception that people who get sucked into ‘these cults’—whether it’s a cult of one, within a family system, or on a larger scale hiding behind a religious organization—have low self-esteem or no backbone. That’s not true… It’s important for people to understand that it has nothing to do with intelligence. The myth that you’re a weak person comes from the fact that once you’re in this cult—whether it’s a cult of one or something larger—the whole point is to gain control and power over you. And with that comes the loss of self-identity.” (07:48 | Dr. Z) “A narcissist will never be able to fix their corrupt disorder. It is a rigid disorder.” (16:49 | Vanessa Reiser) “A narcissist is allergic to your power and autonomy. They want to groom you and keep you ignorant, unaware, and not in the know.” (36:25 | Vanessa Reiser) Links Connect with Vanessa Reiser: https://www.facebook.com/vanessa.pugliese https://www.instagram.com/vanessareiserlcsw/ https://x.com/vanessareisersw https://www.youtube.com/channel/UCrYVROGoPdYqsEFkr2XYC9A https://amzn.to/3XPf9ad Connect with Dr. Z: https://www.drjaimezuckerman.com/ https://www.zgrouptherapy.com/ https://www.instagram.com/dr.z_psychologist/ https://www.tiktok.com/@dr.z_psychologist Shop my new Mindfully Messy hoodie here: http://www.drjaimezuckerman.com/apparel Get my FREE breathing exercise here: http://www.drjaimezuckerman.com/newsletter Register for my virtual workshops here: http://www.drjaimezuckerman.com/workshops Order my workbooks! http://www.drjaimezuckerman.com/books Podcast production and show notes provided by HiveCast.fm",
      "release": "2024-10-11T04:01:00Z",
      "duration": "00:43:40.3150000",
      "explicit": true,
      "spotifyId": "6NeFtIkRDO24alHpxLlCNW",
      "appleId": 1000672659197,
      "youTubeId": "UvNDqQe0lzg",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6NeFtIkRDO24alHpxLlCNW",
        "apple": "https://podcasts.apple.com/podcast/episode-25-coercive-control-and-cult-behavior-with/id1737212532?i=1000672659197",
        "youtube": "https://www.youtube.com/watch?v=UvNDqQe0lzg"
      }
    }
  ]
}