{
  "_ts": 0,
  "id": "f9c8c364-787f-47bc-9782-8aebc1bfd9f1",
  "name": "Next Up: Narcissism",
  "spotifyId": "1aeBenKtsnHZcAMy4JekqP",
  "appleId": 1737212532,
  "youTubeChannelId": "UCtp5Rvzjo-x-RM_FgRaYuaQ",
  "episodes": [
    {
      "id": "f1838a06-22d3-48da-a95b-71e0af578ea8",
      "title": "Episode 56: Trauma and The Fawning Response with Dr. Ingrid Clayton",
      "description": "Fawning isn’t a flaw to fix. It is a brilliant survival response that can quietly shape your entire identity until you finally have the words for it. In this episode, I sit down with clinical psychologist and author Ingrid Clayton for a conversation that I know will resonate deeply with so many of you. We talk about fawning, what it is, how it shows up, and why it’s so often misunderstood. If you’ve ever felt like you disappeared in a relationship or lost touch with your own needs just to keep someone else happy, you’re not alone. And chances are, your nervous system was doing exactly what it needed to do to keep you safe. Ingrid shares her own story as a survivor of complex trauma, and how that experience shaped the work she does now. We explore the difference between trauma that’s tied to a single event and the kind that builds over time in ways that can be hard to name. We talk about what healing actually looks like, how to start reconnecting with yourself, how to recognize the patterns that no longer serve you, and how to hold space for the grief that sometimes comes with change. This isn’t a conversation filled with quick fixes or five-step plans. It’s honest and validating. If you’ve ever asked yourself, “Why do I keep doing this?” or “What’s wrong with me?” I hope this episode helps you see that nothing about you is broken. There’s a reason for the patterns. And there’s also a way through. Episode Breakdown: 00:00 Introduction 02:08 How Personal Experience with Trauma Shaped Dr. Ingrid Clayton’s Work 03:17 What Complex Trauma Really Looks Like 10:20 Fawning as a Smart and Adaptive Trauma Response 14:03 Why Codependency and People-Pleasing Miss the Point 20:20 Real-Life Examples of Fawning in Adulthood 27:20 Why Trauma-Informed Therapy Matters 30:10 Rebuilding a Relationship with Yourself 36:09 How Healing Can Change Your Closest Relationships 40:41 Dr. Clayton’s Message to Anyone Who Feels Broken Links Book: Believing Me https://amzn.to/4lkulGy Website: https://www.ingridclayton.com/ Preorder ‘Fawning’ here: https://www.penguinrandomhouse.com/books/779579/fawning-by-dr-ingrid-clayton/ https://www.instagram.com/ingridclaytonphd/ Connect with Dr. Z: https://www.drjaimezuckerman.com/ https://www.zgrouptherapy.com/ https://www.instagram.com/dr.z_psychologist/ https://www.tiktok.com/@dr.z_psychologist https://www.youtube.com/@DrJaimeZuckerman Get my FREE breathing exercise here: http://www.drjaimezuckerman.com/newsletter Register for my on demand virtual courses here: http://www.drjaimezuckerman.com/workshops Order my workbooks! *Find Your Calm / Find Good Habits* http://www.drjaimezuckerman.com/books Shop my new Mindfully Messy hoodie here: http://www.drjaimezuckerman.com/apparel Podcast production and show notes provided by HiveCast.fm",
      "release": "2025-07-04T04:01:00Z",
      "duration": "00:43:55.4650000",
      "explicit": true,
      "spotifyId": "5TVlQ93fj5VjCc5PYrmCXR",
      "appleId": 1000715679161,
      "subjects": [
        "Psychology",
        "Cult Psychology",
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5TVlQ93fj5VjCc5PYrmCXR",
        "apple": "https://podcasts.apple.com/podcast/episode-56-trauma-and-the-fawning-response-with/id1737212532?i=1000715679161"
      }
    },
    {
      "id": "f070dac5-fb32-4dae-9f7d-9e2737bba356",
      "title": "Episode 45: Replay: Coercive Control and Domestic Violence with Laura Richards",
      "description": "Coercive control is about trying to take away someone’s autonomy and agency. It’s a form of domestic abuse that is often misunderstood and frequently dismissed. In this replay episode, I sit down with the incredible Laura Richards—renowned criminal behavioral analyst and expert on domestic violence—to break it all down. Laura and I discuss the misuse of terms like “narcissistic abuse” and “toxic relationships,” and why getting the terminology right is critical. When these words are misapplied, it can cause real harm, making it harder for victims to recognize what’s happening to them and for others to take it seriously. We also talk about the broader societal factors that allow domestic violence to persist and why these patterns are so deeply embedded. We take a closer look at high-profile cases like Gabby Petito and Lauren Dunne Astley to illustrate how coercive control plays out in real life and the devastating consequences it can have. Laura also sheds light on how the media often memorializes male perpetrators while subtly placing blame on victims, a pattern that continues to fuel dangerous misconceptions. Beyond analyzing the problem, Laura shares the incredible work she’s doing to have coercive control legally recognized as a form of domestic abuse. She explains why advocacy, education, and legal reform are essential to protecting victims and shifting the way society understands domestic violence. This is an eye-opening conversation, and one I hope will help others recognize coercive control for what it is. Episode Breakdown: 00:00 Introduction 02:29 Defining Narcissistic Abuse and Toxic Relationships 04:15 Misuse of the Term “Narcissist” 06:17 Psychopathy and Domestic Violence 09:04 Violent Resistance in Domestic Violence 11:43 Breakup Violence and Coercive Control 18:29 Gender Roles and Social Conditioning 26:15 Recognizing Non-Obvious Patterns of Abuse 30:18 Devaluation and Pedestalization in Relationships 33:56 Concept of Unfreedom in Coercive Control 38:50 Insidious Nature of Coercive Control 41:06 Cultural and Traditional Reinforcement of Male Privilege 47:35 Legal Recognition of Coercive Control Connect with Laura Richards: https://www.youtube.com/@crimeanalyst https://www.crime-analyst.com https://wondery.com/shows/real-crime-profile/ www.thelaurarichards.com https://www.dashriskchecklist.com/ Insta: https://www.instagram.com/laurarichards999/?hl=en https://www.instagram.com/crimeanalyst/?hl=en TikTok: https://www.tiktok.com/@crimeanalystpod?lang=en Twitter: https://twitter.com/laurarichards99 https://twitter.com/thecrimeanalyst Connect with Dr. Z: https://www.drjaimezuckerman.com/ https://www.zgrouptherapy.com/ https://www.instagram.com/dr.z_psychologist/ https://www.tiktok.com/@dr.z_psychologist https://www.youtube.com/@DrJaimeZuckerman The Z Group is now accepting patients nationwide! (Some state exclusions apply). Schedule here: https://www.zgrouptherapy.com/new-patient-form Get my FREE breathing exercise here: http://www.drjaimezuckerman.com/newsletter Register for my on demand virtual courses here: http://www.drjaimezuckerman.com/workshops Order my workbooks! *Find Your Calm / Find Good Habits* http://www.drjaimezuckerman.com/books Shop Mindfully Messy and Make Mistakes hoodies here: http://www.drjaimezuckerman.com/apparel Podcast production and show notes provided by HiveCast.fm",
      "release": "2025-03-14T04:01:00Z",
      "duration": "01:09:23.7340000",
      "explicit": true,
      "spotifyId": "3mzz1NYc4TyM9oOZ605kkX",
      "appleId": 1000699124504,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3mzz1NYc4TyM9oOZ605kkX",
        "apple": "https://podcasts.apple.com/podcast/episode-45-replay-coercive-control-and-domestic/id1737212532?i=1000699124504"
      }
    },
    {
      "id": "a50e02ee-ddc2-4242-a5fe-320b5450768a",
      "title": "Episode 42: A Deep Dive Into the Diddy Docuseries",
      "description": "Power and control shaped Diddy’s rise, but did they also define a long-standing pattern of abuse? Emmy-winning journalist Mara S. Campo joins Dr. Z to unpack the allegations, the fallout, and what it means when survivors finally feel safe enough to speak out. Mara, a contributor to the docuseries “Fall of Diddy,” shares what stood out most—the sheer weight of the stories, the patterns that surfaced long before fame, and the emotional toll of confronting uncomfortable truths. How do we reconcile admiration for a cultural icon with the reality of horrific accusations? What happens when the image we once celebrated no longer holds up? This episode isn’t just about Diddy. It’s about the power dynamics that keep survivors silent, the fear that stops them from coming forward, and the cultural shift toward believing survivors. Quotes “When I first read Cassie’s lawsuit, I will say this is the worst civil suit I have ever read.” (05:11 | Mara S. Campo) “My heart just breaks because I’m thinking about how young this woman was at the time. And now, I’m in my mid-40s, I’m a mom. And I just think about where I was at that place in my life when I was her age.” (08:44 | Mara S. Campo) “I think a lot of times when we see these powerful men getting in trouble, people come forward with these awful allegations. Sometimes you have to wonder, was it the power in the money that maybe corrupted them or did that empower them to be able to behave in this way?” (11:23 | Mara S. Campo) “There\u0027s kind of a grieving that takes place if you’re someone who loved Bad Boy and everything that it stood for and everything that it brought to the world. And for me, personally, that has absolutely been the case because I grew up on Bad Boy.” (23:15 | Mara S. Campo) “It’s important not to discredit those who have the courage to come forward, to listen, to hear, and to really have a lot of compassion.” (27:21 | Mara S. Campo) “The idea that there’s a statute of limitations on sexual assault to me is bananas. There should not be a statute of limitations on sexual assault because it takes victims years to process, to feel empowered enough to confront their abuser.” (31:10 | Mara S. Campo) Links The Fall of Diddy: https://www.max.com/shows/fall-of-diddy/a4d15a65-9071-43b9-abd8-ad905928743a Connect with Mara S. Campo: IG: @marascampo https://www.instagram.com/marascampo/ TikTok: @marascampo https://www.tiktok.com/@marascampo YouTube: Mara S Campo https://www.youtube.com/@MaraSCampo Connect with Dr. Z: https://www.drjaimezuckerman.com/ https://www.zgrouptherapy.com/ https://www.instagram.com/dr.z_psychologist/ https://www.tiktok.com/@dr.z_psychologist https://www.youtube.com/@DrJaimeZuckerman Get my FREE breathing exercise here: http://www.drjaimezuckerman.com/newsletter Register for my on demand virtual courses here: http://www.drjaimezuckerman.com/workshops Order my workbooks! *Find Your Calm / Find Good Habits* http://www.drjaimezuckerman.com/books Shop my new Mindfully Messy hoodie here: http://www.drjaimezuckerman.com/apparel Podcast production and show notes provided by HiveCast.fm",
      "release": "2025-02-14T05:01:00Z",
      "duration": "00:34:52.7540000",
      "explicit": true,
      "spotifyId": "2ZgT73DihHnpUtZemIyfC0",
      "appleId": 1000692133391,
      "youTubeId": "55nMUxqayk4",
      "subjects": [
        "Human Trafficking",
        "Sean Combs",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZgT73DihHnpUtZemIyfC0",
        "apple": "https://podcasts.apple.com/podcast/episode-42-a-deep-dive-into-the-diddy-docuseries/id1737212532?i=1000692133391",
        "youtube": "https://www.youtube.com/watch?v=55nMUxqayk4"
      }
    },
    {
      "id": "e74b8c9c-bc5f-481a-b076-a166403f97e2",
      "title": "Navigating the Narcissist\u0027s Playbook with Mark Vicente",
      "description": "Narcissists don’t just take what they want—they dismantle their targets in the process.\n\nIn this episode, Dr. Z welcomes filmmaker and author Mark Vicente to discuss the dark realities of narcissistic abuse and its psychological aftermath. Known for his work on HBO’s  “The Vow” and his upcoming documentary “Empathy Not Included: The Narcissist’s Playbook,” Mark sheds light on the manipulative behaviors of narcissists, the vulnerabilities they exploit, and the emotional fallout experienced by the survivors of their abuse. \n\nMark reflects on his personal journey of healing after being entangled with NXIVM, offering profound insight into how narcissists mirror their victims\u0027 deepest desires and vulnerabilities as a means to control them.  He also unpacks the chilling reality of how some narcissists knowingly cause harm—and sometimes even revel in it.\n\nDr. Z and Mark touch on the broader implications of narcissism in society, from media manipulation to cultural denial of the harm narcissists can cause. Whether you’re seeking to understand narcissistic abuse or rebuild after trauma, this episode offers a compassionate and empowering perspective.\n\nQuotes\n\u0022One of the things I learned as I began learning about what narcissism is and is not, I recognize that there was a certain place that people bumped up against. Most normal empathic people cannot imagine that these people exist.\u0022 (04:47 | Mark Vicente)\n“The thing about psychopaths that\u0027s so interesting is that they analyze us very unemotionally. and they learn about the way our data works, so to speak.\u0022 (16:15 | Mark Vicente)\n“People sometimes can\u0027t tell, they think it\u0027s excitement and it is, but sometimes that excitement is tinged with fear and desperation. And I always say when you\u0027re in that state with somebody, especially at the beginning, run. Because your cognitive thinking is going offline.” (20:26 | Mark Vicente)\n“When you\u0027re mapping the mind of an insane person, it does damage to you. And when you\u0027re mapping a psychopath, it\u0027s very confusing. It starts to do a lot of bad things to you internally, psychologically.” (26:11 | Mark Vicente)\n\nLinks\nConnect with Mark Vicente:\nhttps://www.markvicente.com/\nhttps://www.instagram.com/markvicente/\nhttps://x.com/markvicente\nhttps://www.empathynotincluded.com/\nhttps://www.instagram.com/empathynotincluded/\nPodcast: WTF is on my Mind?! https://podcasts.apple.com/us/podcast/wtf-is-on-my-mind/id1646783869\nYouTube Channel https://www.youtube.com/@markvicente7\n\n\nConnect with Dr. Z:\nhttps://www.drjaimezuckerman.com/\nhttps://www.zgrouptherapy.com/\nhttps://www.instagram.com/dr.z_psychologist/\nhttps://www.tiktok.com/@dr.z_psychologist\nhttps://www.youtube.com/@DrJaimeZuckerman\n\nGet my FREE breathing exercise here: http://www.drjaimezuckerman.com/newsletter\nRegister for my on demand virtual courses here: http://www.drjaimezuckerman.com/workshops\nOrder my workbooks! *Find Your Calm / Find Good Habits* http://www.drjaimezuckerman.com/books\nShop my new Mindfully Messy hoodie here: http://www.drjaimezuckerman.com/apparel\n\n\nPodcast production and show notes provided by HiveCast.fm\n---\n\nDr. Jaime Zuckerman is a licensed clinical psychologist and national expert in narcissistic abuse. She is a highly sought-after relationship coach for those experiencing narcissistic abuse, as well as the sole owner and founder of The Z Group, a private therapy practice specializing in anxiety, depression, and complex relationship dynamics. Dr. Z is the author of two interactive workbooks and host of Next Up: Narcissism, a podcast that tackles the hard questions about narcissistic abuse, relationships, and mental health. She is an accomplished and active media contributor, as well as an influential social media personality in the mental health space.\n\n*Get my FREE Breathing Exercise here*\nhttps://www.drjaimezuckerman.com/newsletter\n\n*Next Up: Narcissism podcast episodes our every Friday* https://www.drjaimezuckerman.com/podcast\n\n*To schedule one-on-one coaching or to work with me visit* https://www.drjaimezuckerman.com/\n\n*Check out my on demand workshops* https://www.drjaimezuckerman.com/workshops\n\n*The Z Group is now accepting patients nationwide (some state exceptions). To schedule a virtual therapy appointment* https://www.zgrouptherapy.com/new-patient-form\n\n*My Books* \nFind Your Calm: A Workbook to Manage Anxiety https://amzn.to/3Y6b2s9\nFind Good Habits: A Workbook for Daily Growth https://amzn.to/4eYWf8V\n\n*Follow me*\nInstagram @dr.z_psychologist: https://www.instagram.com/dr.z_psychologist/ \nFacebook @drjaimezuckerman: https://www.facebook.com/DrJaimeSpinellZuckerman/ \nTikTok @dr.z_psychologist: https://www.tiktok.com/@dr.z_psychologist \nX @drzpsychologist: https://x.com/DrZPsychologist\nPinterest: https://www.pinterest.com/drzpsychologist/\n\n*My website* https://www.drjaimezuckerman.com/\n\n*Shop my merch* https://www.drjaimezuckerman.com/apparel",
      "release": "2025-01-17T05:01:01Z",
      "duration": "01:03:33",
      "explicit": false,
      "spotifyId": "0MxnWdNKRuErm0MZ2AOlAq",
      "appleId": 1000684337270,
      "youTubeId": "9LavuXue2l0",
      "subjects": [
        "NXIVM",
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0MxnWdNKRuErm0MZ2AOlAq",
        "apple": "https://podcasts.apple.com/podcast/episode-38-navigating-the-narcissists-playbook-with/id1737212532?i=1000684337270",
        "youtube": "https://www.youtube.com/watch?v=9LavuXue2l0"
      }
    },
    {
      "id": "5b5ef3ac-1542-410e-bc08-196c403c8ddd",
      "title": "Episode 25: Coercive Control and Cult Behavior with Vanessa Reiser",
      "description": "“The narcissist will never be able to fix their corrupt disorder. It is a rigid disorder,” says Vanessa Reiser, a licensed clinical social worker and author who specializes in narcissistic and cult abuse. She joins Dr. Z to talk about the striking similarities between narcissistic relationships and cult dynamics, focusing on how coercive control plays a role in both. Drawing from her own life experiences and professional background, Vanessa shares insights from her book “Narcissistic Abuse: A Therapist’s Guide to Identifying, Escaping, and Healing from Toxic and Manipulative People.” She breaks down how narcissists deploy tactics like gaslighting, isolating their victims, and enlisting enablers (often called “flying monkeys”) to keep control. But how does this connect to cult-like dynamics? Vanessa explains that these methods work by stripping away a person’s identity that will trap them in a mental prison that’s just as damaging as the control seen in actual cults. This episode reminds listeners of the resilience required to break free from these toxic environments and the importance of building supportive relationships that will help individuals reclaim their identities. Vanessa’s insights offer valuable tools and strategies for overcoming these challenges that encourage listeners to seek help and validation as they move toward healing and self-empowerment. Quotes “A real cult is always led by somebody who’s trying to control, groom, and manipulate others to get supply and attention. We see this in intimate relationships and families. What they’re doing is using the classic tactics of narcissists to manipulate others to do what they want. They will isolate and get you to basically only view their opinions.” (05:01 | Vanessa Reiser) “There’s this misconception that people who get sucked into ‘these cults’—whether it’s a cult of one, within a family system, or on a larger scale hiding behind a religious organization—have low self-esteem or no backbone. That’s not true… It’s important for people to understand that it has nothing to do with intelligence. The myth that you’re a weak person comes from the fact that once you’re in this cult—whether it’s a cult of one or something larger—the whole point is to gain control and power over you. And with that comes the loss of self-identity.” (07:48 | Dr. Z) “A narcissist will never be able to fix their corrupt disorder. It is a rigid disorder.” (16:49 | Vanessa Reiser) “A narcissist is allergic to your power and autonomy. They want to groom you and keep you ignorant, unaware, and not in the know.” (36:25 | Vanessa Reiser) Links Connect with Vanessa Reiser: https://www.facebook.com/vanessa.pugliese https://www.instagram.com/vanessareiserlcsw/ https://x.com/vanessareisersw https://www.youtube.com/channel/UCrYVROGoPdYqsEFkr2XYC9A https://amzn.to/3XPf9ad Connect with Dr. Z: https://www.drjaimezuckerman.com/ https://www.zgrouptherapy.com/ https://www.instagram.com/dr.z_psychologist/ https://www.tiktok.com/@dr.z_psychologist Shop my new Mindfully Messy hoodie here: http://www.drjaimezuckerman.com/apparel Get my FREE breathing exercise here: http://www.drjaimezuckerman.com/newsletter Register for my virtual workshops here: http://www.drjaimezuckerman.com/workshops Order my workbooks! http://www.drjaimezuckerman.com/books Podcast production and show notes provided by HiveCast.fm",
      "release": "2024-10-11T04:01:00Z",
      "duration": "00:43:40.3150000",
      "explicit": true,
      "spotifyId": "6NeFtIkRDO24alHpxLlCNW",
      "appleId": 1000672659197,
      "youTubeId": "UvNDqQe0lzg",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6NeFtIkRDO24alHpxLlCNW",
        "apple": "https://podcasts.apple.com/podcast/episode-25-coercive-control-and-cult-behavior-with/id1737212532?i=1000672659197",
        "youtube": "https://www.youtube.com/watch?v=UvNDqQe0lzg"
      }
    }
  ]
}