{
  "id": "1cecb682-a9d5-44d0-881b-4452840f37eb",
  "name": "Next With Nick",
  "spotifyId": "1fIUtNzS9G0OqVJGVOORwW",
  "episodes": [
    {
      "id": "cb781ff7-1257-4f32-b05e-e45cade72f44",
      "title": "Next With Nick - Shane Jessop",
      "description": "Alright, get ready for a wild ride on this one. We\u0027ve got Shane Jessop in the house on \u0027Next With Nick,\u0027 and let me tell you, this dude\u0027s life reads like a novel you can\u0027t put down. Shane\u0027s a jack-of-all-trades—singer, songwriter, author, you name it. He\u0027s got his hands in everything from farming to real estate development. But here\u0027s the kicker that\u0027s gonna throw you for a loop: he\u0027s an ex-cult member. Yeah, you heard that right. His escape from a life most of us can\u0027t even imagine until he was 23 is nothing short of a movie script. The leap from that world to where he is now? Huge. The cost? Massive. But Shane\u0027s outlook on life, his unquenchable thirst for creating something meaningful, and, get this, his ambition to model for Levi\u0027s—man, it\u0027s just inspiring. There\u0027s an energy and a drive in him that you can\u0027t help but admire. And guess what? He\u0027s channeling all that into writing a book about his journey. If his story doesn\u0027t make you want to grab life by the horns, I don\u0027t know what will. This book\u0027s going to explode, no doubt about it. So, folks, buckle up. Shane Jessop\u0027s in the building, and this conversation is going to be one hell of a trip. Let\u0027s dive in and get the full scoop on this incredible journey from cult life to living large and in charge. Shane, welcome to the show, brother. @jessopshane on Instagram. I am @nickjohnston007 on Instagram!",
      "release": "2024-02-27T00:00:00",
      "duration": "01:11:26.5190000",
      "explicit": false,
      "spotifyId": "5wFhZttHCIU0urYJflj6sc",
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wFhZttHCIU0urYJflj6sc"
      }
    }
  ]
}