{
  "id": "6aaba13f-96fb-49d5-8fa2-9e2f8f4f281a",
  "name": "Ngomongin Uang",
  "youTubeChannelId": "UCOcta1Ij35IrXMIbhed3MNg",
  "episodes": [
    {
      "id": "4015bff9-de82-4807-a0bb-cc86c0e18f0a",
      "title": "Jeffrey Epstein: Kronologi Lengkap Skandal yang Mengguncang Elite Dunia",
      "description": "Jeffrey Epstein adalah salah satu nama paling kontroversial dalam sejarah modern. Seorang konsultan keuangan yang dikenal memiliki jaringan luas di kalangan elite dunia, mulai dari politisi, pengusaha besar, hingga figur publik internasional.\n\nNamun di balik gaya hidup mewah dan koneksi tingkat tinggi tersebut, Epstein terbukti secara hukum melakukan perdagangan seks terhadap anak di bawah umur. Kasusnya pertama kali mencuat pada 2005, berujung pada plea deal kontroversial tahun 2008, lalu kembali dibuka pada 2019 sebelum ia ditemukan meninggal di dalam tahanan.\n\nDalam video ini, kita membahas secara kronologis:\n\n• Siapa sebenarnya Jeffrey Epstein\n• Bagaimana ia membangun jaringan di dunia keuangan dan elite global\n• Kronologi kasus dari 1990-an hingga penangkapan 2019\n• Kontroversi plea deal 2008\n• Dokumen pengadilan yang dibuka ke publik\n• Fakta-fakta yang telah terkonfirmasi secara hukum\n• Dan misteri seputar kematiannya\n\nVideo ini disusun berdasarkan dokumen pengadilan, laporan investigatif media besar, dan informasi yang telah dipublikasikan secara resmi. Kemunculan nama dalam dokumen tidak otomatis berarti keterlibatan dalam tindakan kriminal, kecuali jika telah dinyatakan melalui proses hukum.\n\nKasus Epstein bukan hanya tentang satu individu, tetapi juga tentang bagaimana kekuasaan, uang, dan jaringan sosial dapat memengaruhi sistem hukum dan opini publik.\n\nTonton sampai akhir untuk memahami bagaimana skandal ini berkembang menjadi salah satu kasus paling banyak diperbincangkan di dunia.\n\n--------------------------------------------------------------------------\nTim Ngomongin Uang\nProducer : Glenn Ardi \nNarrator : Luna Cahya\nPenulis Script : M.Avisenna\nStoryboarder : Timothy Stevano \u0026 Rama Adira\nVideo Editor : Anggi Prayogi \u0026 Faizin Nursya\u0027bani\n--------------------------------------------------------------------------\nWebsite : https://ngomonginuang.com​​ | https://ngomu.id \nInstagram :   / ngomonginuang   |  ngomu.id   \nBusiness Inquiries : partnership@ngomonginuang.com | WA \u002B62 851-6291-0070 (Olgha)",
      "release": "2026-02-21T08:01:10Z",
      "duration": "00:16:02",
      "explicit": false,
      "youTubeId": "xKXH00GwpxY",
      "subjects": [
        "Human Trafficking",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=xKXH00GwpxY"
      }
    }
  ]
}