{
  "_ts": 0,
  "id": "3722c760-5ef9-463b-b804-19788e76d729",
  "name": "Nighttime",
  "spotifyId": "3nZztXBziqQv5KcPG1m5k8",
  "appleId": 1054220508,
  "episodes": [
    {
      "id": "f0ea7886-1235-4270-abee-9a1571cf6c06",
      "title": "Romana Didulo - 6 - The Religious Concepts of \u0022Queen\u0022 Romana Didulo (with Dr. Carmen Celestini)",
      "description": "Romana Didulo, the self declared Queen of Canada, has managed to convince her followers that she is leading this country with the help of both international partners and... well... aliens. In past Nighttime episodes we looked at this story in a variety of ways; we discussed the fake queen\u0027s background, we examined the attempt her followers made to arrest the Peterborough, Ontario police force, and we\u0027ve watched along with the ongoing siege of a small town in Saskatchewan the group is currently residing in. Throughout most of those episodes there was a bit of an undercurrent of \u0022how can people believe this?\u0022 Romana Didulo\u0027s followers view her as much as a religious deity as a political leader and that\u0027s why when I heard a professor and a lecturer from Queen\u0027s University\u0027s School of Religion published a research paper on Romana Didulo I had to learn more. \u0027Reviving the violet Flame\u0027 examines the religious concepts and ideas that have somehow found their way into the bizarre world of Romana Didulo. In this episode we are joined by Dr. Carmen Celestini to talk us through her research into this stranger than fiction phenomenon. Episode Links: Reviving the Violet Flame: http://www.carmencelestini.com/wp-content/uploads/2023/12/celestini-amarasingam-2023-reviving-the-violet-flame-the-new-age-conspiratorial-journey-of-canada-s-queen-romana-didulo.pdf Send a voicememo to the show: nighttimepodcast.com/contact Subscribe to the show: premium feed: https://www.patreon.com/Nighttimepodcast apple podcasts: https://applepodcasts.com/nighttime Musical Theme: Noir Toyko by Monty Datta Social Links: Website: https://www.nighttimepodcast.com Twitter: https://twitter.com/NightTimePod Facebook: https://www.facebook.com/NightTimePod Instagram: https://www.instagram.com/nighttimepod Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-23T05:06:00Z",
      "duration": "00:44:20.2050000",
      "explicit": false,
      "spotifyId": "5Yq89I8meiOyLJtrluNUCi",
      "appleId": 1000638818464,
      "subjects": [
        "Romana Didulo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5Yq89I8meiOyLJtrluNUCi",
        "apple": "https://podcasts.apple.com/podcast/romana-didulo-6-the-religious-concepts-of-queen/id1054220508?i=1000638818464"
      }
    },
    {
      "id": "0698da07-cc11-4813-8e3a-d8ed69bbf072",
      "title": "Romana Didulo - 5 - the Richmound, Sask SIEGE (as of Oct 12, 2023)",
      "description": "In a prior episode we learned how the self-declared Queen of Canada Romana Didulo (and her unconventional pseudo-government) had occupied an abandoned schoolhouse in Richmound, Saskatchewan. It may be difficult to believe, but this situation has only become more bizarre and complicated since then. In this episode, we are again joined by Tom who produces the guerilla news site Community TV for a discussion surrounding the more significant events that have played out since the Richmound protests. Send a voicememo to the show: nighttimepodcast.com/contact Subscribe to the show: premium feed: https://www.patreon.com/Nighttimepodcast apple podcasts: https://applepodcasts.com/nighttime Musical Theme: Noir Toyko by Monty Datta Social Links: Website: https://www.nighttimepodcast.com Twitter: https://twitter.com/NightTimePod Facebook: https://www.facebook.com/NightTimePod Instagram: https://www.instagram.com/nighttimepod Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-23T00:00:00",
      "duration": "00:48:03.2910000",
      "explicit": false,
      "spotifyId": "2fxzROzHNFkBYAWv8sj6so",
      "appleId": 1000631236214,
      "subjects": [
        "Romana Didulo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2fxzROzHNFkBYAWv8sj6so",
        "apple": "https://podcasts.apple.com/podcast/romana-didulo-5-the-richmound-sask-siege-as-of-oct-12-2023/id1054220508?i=1000631236214"
      }
    },
    {
      "id": "f4e132c5-0aa9-4196-8ab0-92ec8729bcb6",
      "title": "Romana Didulo - 4 - The People of RICHMOUND, SK. VS. QUEEN ROMANA",
      "description": "In a past episode, I shared the story of Romana Didulo, the Pilipino immigrant who, from a bedroom in a Victoria, BC boarding house, convinced a surprising number of Canadians that she is the true queen of Canada and our Kingdom\u0027s commander in chief. Via a series of follow up episodes we also heard how she and her followers attempted a sort of twisted siege of a Peterborough police station. Despite the failed arrest of a police force, Romana Didulo and her followers haven’t slowed down. Earlier this month they arrived in Kamsack, Saskatchewan with plans to rebuild the town under Didulo’s rule only to be chased out of town by locals… but they didn’t travel far. The Queen and her followers are now sheltering in an abandoned school house in the town of Richmound, Saskatchewan and the towns people have been circling it in protest almost since their arrival. In this episode, we are joined by Tom who produces the guerilla news site Community TV . When the protests started in Richmound Tom was there. Episode Links: Listen to this prior episode covering Romana Didulo’s background: https://www.nighttimepodcast.com/episodes/romana-didulo Listen to this 2 part series covering Romana Didulo’s attempted take over of the Peterborough Police Station: https://www.nighttimepodcast.com/episodes/peterborough-police-siege-1 https://www.nighttimepodcast.com/episodes/peterborough-police-siege-2 Send a voicememo to the show: nighttimepodcast.com/contact Subscribe to the show: premium feed: https://www.patreon.com/Nighttimepodcast apple podcasts: https://applepodcasts.com/nighttime Musical Theme: Noir Toyko by Monty Datta Social Links: Website: https://www.nighttimepodcast.com Twitter: https://twitter.com/NightTimePod Facebook: https://www.facebook.com/NightTimePod Instagram: https://www.instagram.com/nighttimepod Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-23T00:00:00",
      "duration": "01:02:32.9860000",
      "explicit": false,
      "spotifyId": "3sDyi306EV4EsxLzJW4amV",
      "appleId": 1000629232764,
      "subjects": [
        "Romana Didulo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3sDyi306EV4EsxLzJW4amV",
        "apple": "https://podcasts.apple.com/podcast/romana-didulo-4-the-people-of-richmound-sk-vs-queen-romana/id1054220508?i=1000629232764"
      }
    },
    {
      "id": "cf0e2445-a350-439a-9253-f4a583969fa5",
      "title": "Romana Didulo - 3  - First Hand Account of the Peterborough Police Siege (with Caryma S\u0027ad)",
      "description": "Caryma S\u0027ad is an Ontario based lawyer, journalist, and activist. When she heard the self declared queen of Canada was planning a siege of a police station she did what any reasonable lawyer/journalist/activist would do…She grabbed her helmet, hoped on an electric scooter, and got right in the middle of it. She was one of the first on the scene that day, and she left when Romana DIdulo did. In fact, Caryma all but chased her out of there. In this episode of Nighttime Caryma S\u0027ad will share her experiences with Romana Didulo and the Peterborough SIEGE. Send a voicememo to the show: nighttimepodcast.com/contact Subscribe to the show: premium feed: https://www.patreon.com/Nighttimepodcast apple podcasts: https://applepodcasts.com/nighttime Musical Theme: Noir Toyko by Monty Datta Social Links: Website: https://www.nighttimepodcast.com Twitter: https://twitter.com/NightTimePod Facebook: https://www.facebook.com/NightTimePod Instagram: https://www.instagram.com/nighttimepod Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-23T00:00:00",
      "duration": "00:42:54.6540000",
      "explicit": false,
      "spotifyId": "0QGclUMhkG6DDxqsvKaCoK",
      "appleId": 1000576631568,
      "subjects": [
        "Romana Didulo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0QGclUMhkG6DDxqsvKaCoK",
        "apple": "https://podcasts.apple.com/podcast/romana-didulo-3-first-hand-account-of-the/id1054220508?i=1000576631568"
      }
    },
    {
      "id": "7b36779a-7bb9-46e9-8b4b-ff3f821e4986",
      "title": "Romana Didulo - 2 -  the Peterborough Police Siege",
      "description": "Using little more than a Youtube account a middle aged woman living in a boarding house in Victoria, BC has convinced thousands of people across the country that a global group of allied countries have appointed her Queen of Canada and Commander in Chief of Canada. Her followers (who refer to themselves as We The People) believe her many royal decrees to be law and they act accordingly. One such decree, an end to all covid related mandates, slowly evolved and mutated into a group of her followers laying Siege to the Peterborough Police Station with the goal of arresting the staff and turning them over to the American military to face charges of crimes against humanity. In this episode of Nighttime, I\u0027ll be using Romana Didulo’s and her follower’s own words to explain exactly what led to, and what went down with Queen Romana and the Peterborough Police Siege Send a voicememo to the show: nighttimepodcast.com/contact Subscribe to the show: premium feed: https://www.patreon.com/Nighttimepodcast apple podcasts: https://applepodcasts.com/nighttime Musical Theme: Noir Toyko by Monty Datta Social Links: Website: https://www.nighttimepodcast.com Twitter: https://twitter.com/NightTimePod Facebook: https://www.facebook.com/NightTimePod Instagram: https://www.instagram.com/nighttimepod Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-23T00:00:00",
      "duration": "00:48:36.3360000",
      "explicit": false,
      "spotifyId": "6f7ZJNJo8yxvCDXdA25uwr",
      "appleId": 1000576525095,
      "subjects": [
        "Romana Didulo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6f7ZJNJo8yxvCDXdA25uwr",
        "apple": "https://podcasts.apple.com/podcast/romana-didulo-2-the-peterborough-police-siege/id1054220508?i=1000576525095"
      }
    },
    {
      "id": "beabdaeb-aaca-4917-8253-2428299f13bd",
      "title": "Romana Didulo - 1 - Introducing the self declared ‘Queen of Canada’",
      "description": "For nearly a year now, a middle aged woman in Victoria, BC has been publishing videos and releasing written statements in which she claims to have been appointed as Queen of Canada and head of government by a collective of allied nations. It may sound laughable, but Romana Didulo has been embraced by the online Qanon conspiracy subculture and as a result she has found herself with a large devoted following, upwards of 70k members in fact, and many of them believe her every word. Romana Didulo has declared the version of Canada she claims to lead a vaccination free country... and has declared vaccine administration a crime against humanity that is punishable by death... and she seems to have given her followers approval to carry out the enforcement. To help us understand the story, I\u0027ve turned to Peter Smith, a journalist with the Canadian Antihate network, who has been tracking Romana\u0027s activities since she first surfaced as an influential extremist leader. In this episode of Nighttime, Peter Smith and I will discuss the Story of Romana Didulo, the self proclaimed queen of Canada. Links: Canadian Anti Hate Network - https://www.antihate.ca Peter Smith - https://twitter.com/misterEpete Credits: Musical Theme - Noir Tokyo by Monty Datta Provide feedback and comments on the episode: nighttimepodcast.com/contact Nighttime Links: Premium Feed: https://www.patreon.com/nighttimepodcast Website: https://www.nighttimepodcast.com Twitter: https://twitter.com/NightTimePod Facebook: https://www.facebook.com/NightTimePod Instagram: https://www.instagram.com/nighttimepod Youtube: https://www.youtube.com/nighttimepod Premium Feed: https://www.patreon.com/Nighttimepodcast Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-23T00:00:00",
      "duration": "00:56:53.9420000",
      "explicit": false,
      "spotifyId": "7CQHPZBuxV2569NVxG5kVQ",
      "appleId": 1000543950383,
      "subjects": [
        "Romana Didulo"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7CQHPZBuxV2569NVxG5kVQ",
        "apple": "https://podcasts.apple.com/podcast/romana-didulo-1-introducing-the-self-declared-queen/id1054220508?i=1000543950383"
      }
    }
  ]
}