{
  "id": "0b87b55d-215d-43c2-9e1f-a5d8067c4978",
  "name": "NIUS",
  "youTubeChannelId": "UCQGqiGhMjc_p4lZEhSTb12g",
  "episodes": [
    {
      "id": "967b5347-a03b-49f8-a70f-08611829cc78",
      "title": "Epstein-Netzwerk enttarnt: Mit diesen Personen schrieb er am meisten | NIUS Live vom 13.02.2026",
      "description": "Die Epstein-Files – ein Skandal, der die Welt der Mächtigen erschüttert! Basierend auf einer frischen Recherche des britischen Economist, die mit künstlicher Intelligenz Epsteins E-Mail-Korrespondenz analysiert hat, enthüllen wir die verborgenen Netzwerke, die sich über Kontinente erstrecken. \n\nDie Analyse zeigt faszinierende Details: Wer schrieb am häufigsten zurück? Wir beleuchten die Top-Kontakte, darunter Peggy Siegel, die PR-Expertin, die Epstein zurück in die High Society bringen wollte, oder Michael Wolff und Steve Bannon – eine brisante Mischung aus Journalismus und Politik, die sogar Versuche andeutet, Donald Trump zu stürzen. Und dann die Tech-Giganten: Bill Gates und Elon Musk mit Fragen nach „guten Partys“.\n\nAber es bleibt nicht dabei: Kathryn Ruemmler hat gerade ihren Posten als Chef-Justizarin bei Goldman Sachs räumt, vermutlich auf Druck hin. Im Kongress verliert Justizministerin Pam Bondi die Fassung in einer hitzigen Debatte über Schwärzungen in den Akten und lenkt abrupt auf Börsenrekorde ab – ein klares Zeichen, dass die Nerven blank liegen. Wir diskutieren, warum Täter geschützt werden, während Opfer enttarnt sind, und warum Figuren wie Howard Lutnick über Kontakte lügen.\n\nAuch Europa ist betroffen: In Deutschland tauchen Verbindungen zur Burda-Familie auf, mit Fotos aus 2001 und E-Mails, die heute unglücklich wirken – alles im Rahmen legitimer Geschäfte, beteuert die Familie, doch die engen Kontakte über Jahre hinweg sorgen für Aufsehen. In Norwegen durchsucht die Polizei die Wohnung des Ex-Premiers und Nobelkomitee-Vorsitzenden wegen Korruptionsvorwürfen. \n\nUnd im schwedischen Königshaus? Prinzessin Sofia, die Ehefrau von Prinz Carl Philip und Schwiegertochter von König Carl XVI. Gustaf und Königin Silvia, stand in Kontakt zu einer engen Vertrauten von Jeffrey Epstein. Eine Beraterin und Vertraute des schwedischen Königshauses – zugleich involviert in die Kinderstiftung von Königin Silvia – schickte Epstein vor Sofias Hochzeit eine E-Mail mit einem Foto der damaligen Sofia Hellqvist und schrieb sinngemäß: „Guck mal, unsere Sophia, die wird jetzt sogar Prinzessin.“\n\nBei NIUS Live sprachen NIUS-Chefredakteur Julian Reichelt und NIUS-Reporter Julius Böhm mit Moderator Norbert Dobeleit über das Thema.\n\n⚠️👉Jetzt hier reinschauen, liken, teilen und abonnieren!\n\n\n📢 𝗡𝗜𝗨𝗦, 𝗱𝗶𝗲 𝗦𝘁𝗶𝗺𝗺𝗲 𝗱𝗲𝗿 𝗠𝗲𝗵𝗿𝗵𝗲𝗶𝘁 \nJetzt abonnieren \u0026 die Glocke aktivieren 🔔\nhttps://www.youtube.com/@niusde/streams\n\nWebsite: https://nius.de\nFacebook: https://www.facebook.com/stimmedermehrheit/\nX: https://twitter.com/niusde_\nInstagram: https://www.instagram.com/nius.de\nTikTok: https://www.tiktok.com/@nius.de\nSpotify: https://open.spotify.com/show/63drOxQwW5hvWzLlliFzRo?si=9c2f68f710554c5d\n\n\n#NIUS #NIUSLive #epsteinfiles #trump #epsteinakten",
      "release": "2026-02-13T10:45:38Z",
      "duration": "00:21:35",
      "explicit": false,
      "youTubeId": "YAyZ5eOzDYo",
      "subjects": [
        "Human Trafficking"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YAyZ5eOzDYo"
      }
    }
  ]
}