{
  "_ts": 0,
  "id": "5c2fad49-e20a-451f-b7f9-c5327cf7a260",
  "name": "Nobody Should Believe Me",
  "spotifyId": "0tU5rLsNkx7LeI2GhLlQ4X",
  "appleId": 1615637188,
  "episodes": [
    {
      "id": "f2a61036-1b55-4a22-a859-1b8ad795b61e",
      "title": "S05 Ep07: Who is This Bad Soul?",
      "description": "We examine perhaps the most important piece of the complex puzzle of the Hartman case: what Sophie wrote about it in her journals. We’re joined by Dr. James Hamilton, an MBP expert with a PhD in clinical psychology, to walk us through some of Sophie’s most chilling journal entries collected in the case files. We also look at Sophie’s disturbing internet search history during the time of C’s alleged Central precocious puberty (CPP) diagnosis. After being separated from Sophie, M and C are placed with Sophie’s mom and sister. Detective Lee discusses the problems that arise when placing children with people that are most likely going to side with the perpetrator. In April of 2022, C and M are returned to Sophie and criminal charges are subsequently dropped. Andrea offers a key insight into how this might have happened by revealing a surprising member of Sophie’s legal team: her sister, Megan Carter. *** Links and Resources: Dr. James Hamilton: https://www.munchausensupport.com/who-we-are/ Check out Olivia LaVoice’s podcast, The Bakersfield Three: https://www.iheart.com/podcast/867-the-bakersfield-three-128074552/ Learn more about our featured non-profit and mutual aid organizations: https://www.nobodyshouldbelieveme.com/nsbm-supports/ Check out You Probably Think This Story\u0027s About You: https://brittaniard.com/podcast Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2025-02-13T05:00:00Z",
      "duration": "01:04:49.2660000",
      "explicit": true,
      "spotifyId": "4OeIYbXVRD1uVVo2keDUDo",
      "appleId": 1000682376471,
      "subjects": [
        "One-on-one",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4OeIYbXVRD1uVVo2keDUDo",
        "apple": "https://podcasts.apple.com/podcast/s05-ep07-who-is-this-bad-soul/id1615637188?i=1000682376471"
      }
    },
    {
      "id": "2307f76e-499f-4a54-8ee0-76cde9fd2497",
      "title": "S05 Ep06: Human Timebomb",
      "description": "Sophie insists to police and others that the real problem isn’t that she’s abusing her daughter but that Seattle Children’s–a world class pediatric hospital–simply doesn’t understand her daughter’s rare condition: Alternating Hemiplegia of Childhood. But according to police interviews, very few people in C’s orbit ever witnessed an episode, and if they did, they described symptoms that, alone, are not indicative of AHC. We also hear snippets of interviews stating that Sophie often presented AHC as a terminal illness, a claim that Dr. Zupanc refutes. Dr. Jill Glick, a child abuse pediatrician from the University of Chicago, returns to talk us through the process hospitals go through when evaluating medical child abuse cases. We also go through a few of the many inconsistencies in Sophie’s reports to C’s various doctors. Sophie claims that C could die at any moment from AHC: but does she even have it? *** Links and Resources: Watch Human Timebombs: https://www.youtube.com/watch?v=0qbjprd9v9Y More about Dr. Mary Zupanc: https://www.childneurologysociety.org/awards/mary-l-zupanc-md/ More about Dr. Jill Glick: https://www.uchicagomedicine.org/find-a-physician/physician/jill-c-glick Learn more about our featured non-profit and mutual aid organizations: https://www.nobodyshouldbelieveme.com/nsbm-supports/ Check out You Probably Think This Story\u0027s About You: https://brittaniard.com/podcast Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-02-06T05:00:00Z",
      "duration": "01:14:11.7090000",
      "explicit": true,
      "spotifyId": "3F6QzDSF9PMkMJ47V9O81B",
      "appleId": 1000689535993,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3F6QzDSF9PMkMJ47V9O81B",
        "apple": "https://podcasts.apple.com/podcast/s05-ep06-human-timebomb/id1615637188?i=1000689535993"
      }
    },
    {
      "id": "31157a25-9c3b-4a93-a1e6-1c62942c4b92",
      "title": "The Mother Next Door: Medicine, Deception, and Munchausen by Proxy",
      "description": "It\u0027s pub day!! The Mother Next Door is officially out in the world. Thank you to everyone for all of your support! For our amazing podcast listeners, we have a very special treat for you: a 40 MINUTE exclusive excerpt of the audiobook! Enjoy! *** Order The Mother Next Door: Medicine, Deception, and Munchausen by Proxy https://read.macmillan.com/lp/the-mother-next-door-9781250284273/ Catch Andrea and Mike at their Seattle Book Launch Event: https://www.eventbrite.com/e/andrea-dunlop-and-mike-weber-the-mother-next-door-tickets-1097661478029 Catch Andrea and Mike at their Fort Worth Book Launch Event: https://www.instagram.com/p/DE0ynPhxLOo/ Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-02-04T13:00:00Z",
      "duration": "00:40:21.9160000",
      "explicit": true,
      "spotifyId": "17ddaDEIC16mk6Tf9YTmcT",
      "appleId": 1000688894672,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/17ddaDEIC16mk6Tf9YTmcT",
        "apple": "https://podcasts.apple.com/podcast/the-mother-next-door-medicine-deception-and-munchausen/id1615637188?i=1000688894672"
      }
    },
    {
      "id": "c763b13b-9e44-46d8-b5cc-1ff99cbba2ad",
      "title": "S05 Ep05: The Breaking Point",
      "description": "In 2020, the Hartmans grow even more isolated as Covid hits: Sophie pulls C out of school citing worsening health and breaks with the church community who’ve been supporting her and her daughters. Concerns for abuse grow as Sophie begins to push a new narrative that C has central precocious puberty (CPP), a condition that causes the body to go through puberty prematurely, After making an initial DCF report in 2019 and tracking Sophie’s demands for increasingly invasive procedures: Seattle Children’s Child Abuse Team files an official report to the Department of Children, Youth, and Families. Her daughters are subsequently placed in protective custody and Sophie is charged with assault of a child in the second degree. We hear from the Seattle reporter who broke the story, Olivia LaVoice and dig into the extensive documentation from the investigation with Detective Michael Lee, a major crimes detective in Texas and co-founder of the National Crimes Against Children Investigators Association.. Andrea also talks with Dr. Mary Zupanc, a pediatric neurologist and epilepsy specialist with over 30 years of clinical and research experience with AHC. She gives listeners a better understanding of AHC by describing the history of the disorder, the various symptoms, common environmental triggers, and how clinical diagnoses of AHC are made. *** Links and Resources: More about Dr. Mary Zupanc: https://www.childneurologysociety.org/awards/mary-l-zupanc-md/ Check out Olivia LaVoice’s podcast, The Bakersfield Three: https://www.iheart.com/podcast/867-the-bakersfield-three-128074552/ Chad Goller-Sojourner’s Sitting in Circles with Rich White Girls: Memoir of a Bulimic Black Boy will be adding show dates in spring 2025. Click HERE for more information. Preorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Catch Andrea and Mike at their Seattle Book Launch Event: https://www.eventbrite.com/e/andrea-dunlop-and-mike-weber-the-mother-next-door-tickets-1097661478029 Learn more about our featured non-profit and mutual aid organizations: https://www.nobodyshouldbelieveme.com/nsbm-supports/ Check out You Probably Think This Story\u0027s About You: https://brittaniard.com/podcast Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-30T05:00:00Z",
      "duration": "00:53:51.9210000",
      "explicit": true,
      "spotifyId": "5ZOJhHJBPpQf4xt4VvKb1b",
      "appleId": 1000687001625,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ZOJhHJBPpQf4xt4VvKb1b",
        "apple": "https://podcasts.apple.com/podcast/s05-ep05-the-breaking-point/id1615637188?i=1000687001625"
      }
    },
    {
      "id": "5fab15d3-6934-43b8-952b-0e0cccd2aead",
      "title": "S05 Ep04: When the Cameras are On",
      "description": "From corporate sponsorships to fundraisers large and small, Sophie Hartman was an expert at raising money for C’s various medical devices, mobility aids, and specialized treatments. But were any of these things actually needed? We hear audio from the police interviews of Sophie’s next door neighbors and a school aide who note that they rarely saw C in her wheelchair. We also take a closer look at C’s diagnoses with friend-of -the-show (our not-so-secret Florida doctor) Dr. Bex, joins us briefly to explain the process that pediatricians go through to provide a clinical diagnosis to their patients. We take a closer look at the narrative Sophie weaves on Instagram, documenting her daughter C’s medical journey on both her personal account and where she posts relentlessly about C’s health and includes pictures of her G-Tube and Cecostomy Tube. We listen to reports from both Sophie’s mother and father stating that C had no trouble eating by mouth, and we’re joined by Dr. Jill Glick, a Child Abuse Pediatrician from the University of Chicago, who explains why a child who can eat normally but still has a G-Tube, as requested by a parent, is incredibly troubling. *** Links and Resources: More about Dr. Jill Glick: https://www.uchicagomedicine.org/find-a-physician/physician/jill-c-glick Preorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Catch Andrea and Mike at their Seattle Book Launch Event: https://www.eventbrite.com/e/andrea-dunlop-and-mike-weber-the-mother-next-door-tickets-1097661478029 Learn more about our featured non-profit and mutual aid organizations: https://www.nobodyshouldbelieveme.com/nsbm-supports/ Check out You Probably Think This Story\u0027s About You: https://brittaniard.com/podcast Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-23T05:00:00Z",
      "duration": "00:47:04.0710000",
      "explicit": true,
      "spotifyId": "1ZFG5DqhDnMOzPUA7O3lws",
      "appleId": 1000682375085,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ZFG5DqhDnMOzPUA7O3lws",
        "apple": "https://podcasts.apple.com/podcast/s05-ep04-when-the-cameras-are-on/id1615637188?i=1000682375085"
      }
    },
    {
      "id": "1fa7785b-8ce8-443e-a51c-d760c9debaac",
      "title": "S05 Ep03: Constant Crisis",
      "description": "Immediately after moving with C and M from Zambia to Seattle, WA, Sophie starts bringing C to various doctors, reporting severe health issues. Just three days after C’s third birthday, she is diagnosed with Alternating Hemiplegia of Childhood (AHC), a rare, one-in-a-million neurological disorder. Simultaneously, Sophie enrolls her older daughter, M, in an elite gymnastics program. We speak to some of the moms who knew Sophie from the gym to get a better picture of Sophie and the two girls. They reveal a picture of a woman who, despite seeming to move from one crisis to the next, is somehow caring for a medically fragile child, nurturing an aspiring Olympian and financing all of this without a job or a partner. *** Links and Resources: Chad Goller-Sojourner’s Sitting in Circles with Rich White Girls: Memoir of a Bulimic Black Boy will be adding show dates in spring 2025. Click HERE for more information. Preorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Catch Andrea and Mike at their Seattle Book Launch Event: https://www.eventbrite.com/e/andrea-dunlop-and-mike-weber-the-mother-next-door-tickets-1097661478029 Check out You Probably Think This Story\u0027s About You: https://brittaniard.com/podcast Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-16T05:00:00Z",
      "duration": "00:54:22.8760000",
      "explicit": true,
      "spotifyId": "5tZO0DCi6RC3uDRk7ovCc0",
      "appleId": 1000682374615,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tZO0DCi6RC3uDRk7ovCc0",
        "apple": "https://podcasts.apple.com/podcast/s05-ep03-constant-crisis/id1615637188?i=1000682374615"
      }
    },
    {
      "id": "72d23c2b-0ed2-48ea-905d-bac32dbf31d9",
      "title": "S05 Ep02: Spiritual Warfare",
      "description": "In the second episode of season 5, Andrea dives into how Sophie’s Evangelical Christian beliefs colored her worldview. From claiming that adopting a child from Zambia was God’s path for her life to allegedly performing an exorcism, Sophie’s faith is an integral part of this case. We hear from Dr. Lauren Turek, an Associate Professor of History at Trinity University in San Antonio, TX and author of To Bring the Good News to All Nations: Evangelical Influence on Human Rights and U.S. Foreign Relations, gives us a context about Evangelical Christianity in the US and abroad and helps us understand Sophie’s religious upbringing and worldview. Andrea is then joined by some of the Nobody Should Believe Me team: Senior Producer Myrriah Gossett and Lead Researcher/Producer Erin Ajayi to attempt to fill in the many blanks left by Sophie’s memoir about her time in Zambia. The three of them lay out a timeline leading up to Sophie’s adoptions of M and C, while at the same time examining the series of omissions and half-truths riddling Sophie’s story. *** Links and Resources: Learn more about Dr. Lauren Turek: https://laurenturek.com/ Preorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Catch Andrea and Mike at their Seattle Book Launch Event: https://www.eventbrite.com/e/andrea-dunlop-and-mike-weber-the-mother-next-door-tickets-1097661478029 Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-09T05:00:00Z",
      "duration": "00:56:54.7260000",
      "explicit": true,
      "spotifyId": "276dbFfBcLngTxApmjnLCD",
      "appleId": 1000682373877,
      "subjects": [
        "One-on-one",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/276dbFfBcLngTxApmjnLCD",
        "apple": "https://podcasts.apple.com/podcast/s05-ep02-spiritual-warfare/id1615637188?i=1000682373877"
      }
    },
    {
      "id": "4eb7ef9b-ee1d-49f8-be57-95109c0e6cae",
      "title": "Sophie Saves Zambia",
      "description": "We begin the season by delving into Sophie Hartman’s 2016 memoir about her time in Zambia, Crowns of Beauty, where we learn about how a young woman from Michigan came to be the adopted mother of two Zambian girls by the age of 25. We learn about Sophie’s deep roots in evangelical Christianity and her state of mind prior to and during the adoptions of M and C; examining the way she portrays herself as both a martyr and savior. We’re also joined by Chad Goller-Sojourner, a performance artist and transracial adoption coach, to help listeners understand the complexities of transracial adoptions. \n\n***\nLinks and Resources:\n\nChad Goller-Sojourner’s Sitting in Circles with Rich White Girls: Memoir of a Bulimic Black Boy will be adding show dates in spring 2025. Click HERE for more information. \n\nMore information on Chad’s background with transracial adoption: https://drive.google.com/file/d/1q76t_IpbJil2vWQVsNnw7f8Ms8p_lstK/view\n\nPreorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy\n\nCatch Andrea and Mike at their Seattle Book Launch Event: https://www.eventbrite.com/e/andrea-dunlop-and-mike-weber-the-mother-next-door-tickets-1097661478029\n\nCheck out You Probably Think This Story\u0027s About You: https://brittaniard.com/podcast\n\nClick here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show!\n\nSubscribe on YouTube where we have full episodes and lots of bonus content.\n\nFollow Andrea on Instagram for behind-the-scenes photos: @andreadunlop\n\nBuy Andrea\u0027s books here.\n\nTo support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content.\n\nFor more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com\n\nThe American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-02T06:00:00Z",
      "duration": "00:45:02",
      "explicit": false,
      "spotifyId": "5MJBxpSxcTnaJp60Ixg9cL",
      "appleId": 1000682372689,
      "subjects": [
        "One-on-one",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5MJBxpSxcTnaJp60Ixg9cL",
        "apple": "https://podcasts.apple.com/podcast/sophie-saves-zambia/id1615637188?i=1000682372689"
      }
    },
    {
      "id": "6254b82e-f89e-4824-a798-1df6347bf407",
      "title": "The Psychology of Perpetrators with Dr. Cathy Ayoub",
      "description": "In this last bonus episode before our season 5 premiere next week, we’re airing Andrea’s conversation with Dr. Catherine Ayoub, an associate professor at Harvard Medical School, APSAC member, nurse practitioner, and counseling and consulting psychologist. Cathy tells listeners about her background and first encounter with Munchausen by Proxy. She and Andrea chat about the different groupings of perpetrators and the characteristics/background that may signal that an abuser can be rehabilitated. Cathy dives into family dynamics, and her current study on the long-term effects of this abuse. *** Links and Resources: More about Dr. Cathy Ayoub: https://www.childrenshospital.org/directory/catherine-ayoub Preorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-12-26T05:00:00Z",
      "duration": "01:24:05.2110000",
      "explicit": true,
      "spotifyId": "11wXIJioOwd1jO07NtxR3g",
      "appleId": 1000681709534,
      "subjects": [
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/11wXIJioOwd1jO07NtxR3g",
        "apple": "https://podcasts.apple.com/podcast/the-psychology-of-perpetrators-with-dr-cathy-ayoub/id1615637188?i=1000681709534"
      }
    },
    {
      "id": "c1b35115-8408-408a-80c7-cc92b6103e1f",
      "title": "Jesika Jones Part 4 with Detective Mike Weber",
      "description": "In the final part of our miniseries covering the Jesika Jones case, Andrea is once again joined by Detective Mike Weber, who shares the series of events from Jesika’s first bond violation through to her 60 year sentencing, from his perspective as law enforcement. He shares the differences in how seriously child abuse cases are taken when there’s a male vs female perpetrator, and the politics behind trying Medical Child Abuse cases in court. Andrea and Mike wrap up their conversation by talking about the systemic changes that need to happen, not only to protect kids from this abuse, but also to help families after the damage has been done. *** Links/Resources: Preorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-12-19T15:07:00Z",
      "duration": "00:49:56.1140000",
      "explicit": true,
      "spotifyId": "55znTW9ggfAOj2AYYS5Qk6",
      "appleId": 1000680983078,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/55znTW9ggfAOj2AYYS5Qk6",
        "apple": "https://podcasts.apple.com/podcast/jesika-jones-part-4-with-detective-mike-weber/id1615637188?i=1000680983078"
      }
    },
    {
      "id": "fd8a1f0e-8efb-4491-9030-3f976c5ff5be",
      "title": "Jesika Jones Part 3 with Derek Jones",
      "description": "Welcome back to the 3rd installment of our 4-part series on the Jesika Jones case. In this episode, Andrea is wrapping up her conversation with Derek Jones. Derek recaps the fallout after Jesika’s lies finally start to unravel: the frustrating journey of working with the DA on the case, Jesika’s sentencing, and how his kids are doing today. Stay tuned for the final episode next week, where Andrea is once again joined by Detective Mike Weber.\n\n***\n\nLinks/Resources: \n\nPreorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy\n\nClick here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show!\n\nSubscribe on YouTube where we have full episodes and lots of bonus content.\n\nFollow Andrea on Instagram for behind-the-scenes photos: @andreadunlop\n\nBuy Andrea\u0027s books here.\n\nTo support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content.\n\nFor more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com\n\nThe American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-12-12T20:18:00Z",
      "duration": "00:53:00",
      "explicit": false,
      "spotifyId": "07slwwSVOnyMW5yqILCWu4",
      "appleId": 1000680182574,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07slwwSVOnyMW5yqILCWu4",
        "apple": "https://podcasts.apple.com/podcast/jesika-jones-part-3-with-derek-jones/id1615637188?i=1000680182574"
      }
    },
    {
      "id": "c954d0f5-8c69-4eac-b42e-d827d28a76dc",
      "title": "Jesika Jones Part 2 with Derek Jones",
      "description": "In the second episode of Andrea’s coverage of the Jesika Jones case, she’s joined by Derek Jones, Jesika’s then-husband. Derek bravely tells the story of how he and Jesika met, their home life, and the decline in their daughter\u0027s health. Talking to Derek gives listeners insight into the manipulative nature of perpetrators, not only with their victims, but also with everyone around them, and the mental toll of coming to terms with such a monumental breach of trust. Stay tuned for part 2 of their conversation, coming next week. *** Links/Resources: Preorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-12-05T05:00:00Z",
      "duration": "00:55:36.0190000",
      "explicit": true,
      "spotifyId": "3JeovlXE1GGDJGyHd3tvvJ",
      "appleId": 1000679300860,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3JeovlXE1GGDJGyHd3tvvJ",
        "apple": "https://podcasts.apple.com/podcast/jesika-jones-part-2-with-derek-jones/id1615637188?i=1000679300860"
      }
    },
    {
      "id": "876520e3-fa68-4de6-a213-d09ff60a49ba",
      "title": "Jesika Jones Part 1 with Detective Mike Weber",
      "description": "This week on case files, Andrea is joined by Detective Mike Weber, a crimes against children investigator and long-time friend/contributor to the show, to discuss the Jesika Jones case. Detective Mike is called onto this case in mid-2022 after Jesika brings her 4 year old daughter into Cook Children’s Hospital multiple times for an alleged seizure disorder. As the case evolves, Mike learns just how compulsive an offender who is allowed to walk can truly be. *** Links/Resources: Preorder Andrea and Mike’s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-27T05:00:00Z",
      "duration": "01:04:35.0300000",
      "explicit": true,
      "spotifyId": "5BrB1bC0vQ4ePNc4vGpamS",
      "appleId": 1000678359666,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5BrB1bC0vQ4ePNc4vGpamS",
        "apple": "https://podcasts.apple.com/podcast/jesika-jones-part-1-with-detective-mike-weber/id1615637188?i=1000678359666"
      }
    },
    {
      "id": "1474bf78-bc58-41b3-bc51-fd71e67e3dab",
      "title": "Revisiting Season 3: Shelter",
      "description": "While the Nobody Should Believe Me team is hard at work on season 5, we’re revisiting the first episode of our third season, which covered the Kowalski v Johns Hopkins All Children\u0027s trial, also known as the Take Care of Maya Case. Next week, we have a brand new miniseries coming to your ears, so stay tuned. *** As the Maya Kowalski case heads to trial, we dig into the massive trove of documents about this case and begin to unpack what we know about what really happened during Maya Kowalski’s fateful stay at Johns Hopkins All Childrens in October 2016. The Netflix documentary about the case—and the prevailing media narrative---would have you believe that Maya was ripped from her parents by a corrupt system, and that this could happen to any parent of a sick child. But did Maya really have a deadly disease for which she required the massive amounts of ketamine and other drugs she was being given? Was the hospital unfairly biased against Beata Kowalski because she was difficult, or was something more sinister at play? We talk to national law enforcement expert on medical child abuse, Detective Mike Weber, as well as a Florida pediatrician who helps us unravel some of the myriad strange details about Maya’s medical history. The beginning of our multi-part deep dive into the case reveals the shocking events that led up to the family separation. *** Links/Resources: Join Patreon for a look at Andrea and Dr. Bex’s previous coverage of the Kowalski case: https://www.patreon.com/collection/548199 Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-21T05:00:00Z",
      "duration": "00:45:40.5320000",
      "explicit": true,
      "spotifyId": "0oTzLGTOq3Yye3X8uCW70L",
      "appleId": 1000677725193,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0oTzLGTOq3Yye3X8uCW70L",
        "apple": "https://podcasts.apple.com/podcast/revisiting-season-3-shelter/id1615637188?i=1000677725193"
      }
    },
    {
      "id": "a78cd2ad-f967-40eb-81b1-8c87f572afb1",
      "title": "Exploring the Disturbing World of Mitoaction.org",
      "description": "In this episode, Andrea and Dr. Bex discuss mitochondrial disorders, which Dr. Bex has seen first-hand in her pediatric patients, and their connection to medical child abuse, most notably in the Justina Pelletier case. Like most illnesses seen in Munchausen by Proxy cases, while there are tests that doctors run, mitochondrial disorders present challenges in distinguishing genuine cases because of the array of symptoms they present. They discuss how support groups and websites–while so important for families dealing with complex chronic illnesses–can serve as playbooks for offenders. \n\nAndrea and Dr. Bex take listeners through the website for Mitoaction.org and its advice that appears to be directed squarely at perpetrators of medical child abuse.\n\n* * * \nVisit mitoaction.org\n                                                                     \nPreorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy. \n\nClick here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show!  \n\nSubscribe on YouTube where we have full episodes and lots of bonus content. \n\nFollow Andrea on Instagram for behind-the-scenes photos: @andreadunlop\n\nBuy Andrea\u0027s books here. \n\nFor more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com\n\nThe American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here. \n\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-14T16:24:00Z",
      "duration": "01:38:23",
      "explicit": false,
      "spotifyId": "0Iei1Ie8RCIrP3YnkCXkXe",
      "appleId": 1000676974981,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Iei1Ie8RCIrP3YnkCXkXe",
        "apple": "https://podcasts.apple.com/podcast/exploring-the-disturbing-world-of-mitoaction-org/id1615637188?i=1000676974981"
      }
    },
    {
      "id": "2f192501-17f8-4732-a8be-4234444e134e",
      "title": "Introducing A Little Bit Culty",
      "description": "LIFE AFTER NARCS: DR. RAMANI DURVASULA ON NAVIGATING NARCISSISM\n\nAre malignant narcissists born or made? How do you recover after narcissistic abuse? In this episode, licensed clinical psychologist Dr. Ramani Durvasula tackles our burning narc-y questions. She’s the author of two books on the subject: “Should I Stay or Should I Go: Surviving A Relationship with a Narcissist” and “Don’t You Know Who I Am?: How to Stay Sane in an Era of Narcissism, Entitlement, and Incivility.” Her work has been featured at SXSW, TEDx, the Red Table Talk, the Today Show, and Investigation Discovery. You can also find her on her wildly popular YouTube channel where she dispenses wisdom on protecting yourself from hoovering, gaslighting and other narc trademarks.\n\n***\n\nJoin A Little Bit Culty on Patreon\nGet poppin’ fresh ALBC Swag\nSupport the pod and smash this link\nCult awareness and recovery resources\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-12T16:34:00Z",
      "duration": "01:17:07",
      "explicit": false,
      "spotifyId": "1jN6TtmyIEf12XqWsdARLY",
      "appleId": 1000676677025,
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1jN6TtmyIEf12XqWsdARLY",
        "apple": "https://podcasts.apple.com/podcast/introducing-a-little-bit-culty/id1615637188?i=1000676677025"
      }
    },
    {
      "id": "8f5d15b8-580b-4fee-8145-a87e72ea741b",
      "title": "On Combatting Hopelessness",
      "description": "In the wake of this week\u0027s election results, Andrea shares a minisode with her thoughts on committing yourself to a fight that feels impossible. Want to suggest a non-profit for us to support? Drop us a line hello@nobodyshouldbelieveme.com Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-08T21:18:00Z",
      "duration": "00:04:47.2420000",
      "explicit": false,
      "spotifyId": "04b2c2t3ilQNSj6ox7p6FJ",
      "appleId": 1000676254208,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/04b2c2t3ilQNSj6ox7p6FJ",
        "apple": "https://podcasts.apple.com/podcast/on-combatting-hopelessness/id1615637188?i=1000676254208"
      }
    },
    {
      "id": "1b64624d-6d18-43e5-9b11-411b9198eeb3",
      "title": "Justina Pelletier Part 4",
      "description": "Dr. Bex joins Andrea for the final installment of our Justina Pelletier miniseries. They pick up by giving an overview of the court case, and the eerie similarities to the Kowalski case. They chat about the experts who were brought in by both the Pelletiers and Boston Children’s, and the importance of looking into the background of expert witnesses. Dr. Bex and Andrea break down the connection between somatoform disorder and prolonged Medical Child Abuse, and how it may affect the recovery of the victim once they are separated from their abuser. Bex and Andrea also catch listeners up on where Justina Pelletier is now and what the trajectory of her life and health has looked like since being returned to her parents. *** Links/Resources: The Battle for Justina Pelletier: https://www.peacocktv.com/watch-online/tv/the-battle-for-justina-pelletier/5657866397468499112 Join Patreon for a look at Andrea and Dr. Bex’s previous coverage of the Justina Pelletier case: https://www.patreon.com/collection/507935 Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-11-07T05:00:00Z",
      "duration": "00:53:50.7200000",
      "explicit": true,
      "spotifyId": "46hdSkx5JdkctG9oEU1V9J",
      "appleId": 1000676010892,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/46hdSkx5JdkctG9oEU1V9J",
        "apple": "https://podcasts.apple.com/podcast/justina-pelletier-part-4/id1615637188?i=1000676010892"
      }
    },
    {
      "id": "ca36d74d-e5ad-4af2-b6fe-ae0f1ab0b75a",
      "title": "Justina Pelletier Part 3 with Beau Berman",
      "description": "In part 3 of our Justina Pelletier mini-series, Andrea and Beau pick up where part 2 left off, with the topic of mitoaction.org. They then get into the side story of Martin Gottesfeld, a hacker who did not know the family, but took on the mantle of saving Justina by hacking into the Boston Childrens’ system to pressure them into releasing her. Beau talks about the last time he was contacted by the Pelletiers, Lou Pelletier’s reaction to the media attention, and how Justina is doing currently. *** Links/Resources: https://www.mitoaction.org/ The Battle for Justina Pelletier: https://www.peacocktv.com/watch-online/tv/the-battle-for-justina-pelletier/5657866397468499112 Join Patreon for a look at Andrea and Dr. Bex’s previous coverage of the Justina Pelletier case: https://www.patreon.com/collection/507935 Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-10-31T04:00:00Z",
      "duration": "00:44:32.3520000",
      "explicit": true,
      "spotifyId": "07Fr2pibJy8ujGMyZaXVPy",
      "appleId": 1000675154659,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07Fr2pibJy8ujGMyZaXVPy",
        "apple": "https://podcasts.apple.com/podcast/justina-pelletier-part-3-with-beau-berman/id1615637188?i=1000675154659"
      }
    },
    {
      "id": "0357b38d-78a9-4150-a307-45be61abfcc1",
      "title": "Justina Pelletier Part 2 with Beau Berman",
      "description": "On this show we talk a lot about how Munchausen by Proxy cases are covered in the media, and today we’re getting the inside scoop from the reporter who broke one of the most high profile MBP stories. Beau Berman began covering the Justina Pelletier case back in 2013 as a young reporter and watched over the years as the case evolved and got stranger and stranger. He tells Andrea about how the story came across his desk and the complexities of trying to keep the balance on both sides while dealing with HIPAA. He reflects on his time with the Pelletiers and his thoughts on the case more than a decade after covering it. *** Links/Resources: The Battle for Justina Pelletier: https://www.peacocktv.com/watch-online/tv/the-battle-for-justina-pelletier/5657866397468499112 Read about Justina Pelleiter in The Boston Globe: https://www.bostonglobe.com/metro/2020/01/12/pelletier/0I2dQrYlZFJ9tNzscaXdAO/story.html Join Patreon for a look at Andrea and Dr. Bex’s previous coverage of the Justina Pelletier case: https://www.patreon.com/collection/507935 Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-10-24T04:00:00Z",
      "duration": "00:44:47.0330000",
      "explicit": true,
      "spotifyId": "4Zapwq2O8vgRHs5lQ2fqbt",
      "appleId": 1000674243771,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Zapwq2O8vgRHs5lQ2fqbt",
        "apple": "https://podcasts.apple.com/podcast/justina-pelletier-part-2-with-beau-berman/id1615637188?i=1000674243771"
      }
    },
    {
      "id": "71e616bf-8861-4310-8a15-c7d8fe91fca4",
      "title": "Justina Pelletier Part 1",
      "description": "Case Files is back with the first episode of a multi-part series on the Justina Pelletier case. Andrea and Dr. Bex covered this case in the subscriber feed, but, due to popular demand, decided to bring it to the main podcast. Justina Pelletier was a 14-year-old girl whose hospitalization at Boston Children\u0027s Hospital sparked a significant legal and media frenzy. Andrea and Dr. Bex’s discussion covers the medical background of Justina\u0027s condition, including mitochondrial disease and somatoform disorder, the treatment plans proposed by the hospital, and the escalating conflict between her family and medical professionals. *** Links/Resources: The Battle for Justina Pelletier: https://www.peacocktv.com/watch-online/tv/the-battle-for-justina-pelletier/5657866397468499112 Read about Justina Pelletier in The Boston Globe: https://www.bostonglobe.com/metro/2020/01/12/pelletier/0I2dQrYlZFJ9tNzscaXdAO/story.html Join Patreon for a look at Andrea and Dr. Bex’s previous coverage of the Justina Pelletier case: https://www.patreon.com/collection/507935 Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-10-17T04:00:00Z",
      "duration": "00:49:57.8900000",
      "explicit": true,
      "spotifyId": "34D8pfImeZXZ9I6VaP8ynF",
      "appleId": 1000673388537,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/34D8pfImeZXZ9I6VaP8ynF",
        "apple": "https://podcasts.apple.com/podcast/justina-pelletier-part-1/id1615637188?i=1000673388537"
      }
    },
    {
      "id": "d9981fd0-2375-488e-b764-88af5c6dcb65",
      "title": "Kowalski, Ketamine, and Matthew Perry",
      "description": "Welcome to the first episode of Case Files, our new series for episodes between seasons! Andrea, either solo or joined by guests, will be taking listeners through additional Munchausen by Proxy cases, updates on previously covered cases, and the broader societal impact of this form of child abuse. In this conversation, Andrea and Dr. Bex (our secret Florida doctor friend from season 3) delve into the growing popularity of ketamine usage and the public perception of the role that it played in the Take Care of Maya case compared to the death of Friends actor Matthew Perry. After giving a quick overview of the Kowalski v Johns Hopkins trial and an update on the appeal, they discuss how ketamine was used in Maya Kowalski’s treatment vs the current medical standard. Andrea and Dr. Bex then go on to recap and draw parallels to what happened to Matthew Perry. * * * Links/Resources: Join as a free Patreon member to listen to our interview with Ethen Shapiro about the appeal in Kowalski v Johns Hopkins All Children’s: https://www.patreon.com/posts/kowalski-case-to-110897045 Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-10-10T04:00:00Z",
      "duration": "01:20:16.6920000",
      "explicit": true,
      "spotifyId": "2H1OJKRwjzSbTrUwSP7rn3",
      "appleId": 1000672454778,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2H1OJKRwjzSbTrUwSP7rn3",
        "apple": "https://podcasts.apple.com/podcast/kowalski-ketamine-and-matthew-perry/id1615637188?i=1000672454778"
      }
    },
    {
      "id": "272939e1-2832-413b-8fa6-0a7cdb4efa8e",
      "title": "Answering Your Season 4 Questions with Producer Myrriah",
      "description": "Welcome to our Season 4 Mailbag Episode! We’re so excited to officially introduce our fabulous producer Myrriah Gossett, who works tirelessly behind the scenes to keep the many moving parts of Nobody Should Believe Me on track. Andrea and Myrriah reflect on their experiences reporting for season 4, ethically navigating survivor stories, and the considerations involved in sharing the intimate details of someone’s real life. They also address questions about the show’s coverage of dissociative identity disorder and several other common themes from this season. * * * Links/Resources: Check out Myrriah’s other work! https://www.myrriahgossett.com/ Mental Illness Happy Hour episode on DID: https://mentalpod.com/archives/7042 Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-10-03T04:00:00Z",
      "duration": "01:01:23.1080000",
      "explicit": false,
      "spotifyId": "3SvpFI87cGgln3tldNaTlD",
      "appleId": 1000671627927,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3SvpFI87cGgln3tldNaTlD",
        "apple": "https://podcasts.apple.com/podcast/answering-your-season-4-questions-with-producer-myrriah/id1615637188?i=1000671627927"
      }
    },
    {
      "id": "cc7c4901-63d3-41a1-a91a-3df1eaccb0d2",
      "title": "BONUS: Unabridged Interview with Carly Ostler",
      "description": "On this week’s unabridged interview from season 4, Andrea chats with trauma therapist Carly Ostler. The two of them dive into what complex trauma is, the difference between PTSD and complex PTSD, and the co-dependent nature of abusive families. Carly explains why abuse from parental figures affects survivors so deeply, as well as the complexity of grieving an abuser. * * * Links/Resources: Learn more about Carly: https://www.carlyostler.com/ Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-09-26T04:00:00Z",
      "duration": "00:50:29.6030000",
      "explicit": true,
      "spotifyId": "1go6FSARKt2UkgSVeS0PPm",
      "appleId": 1000670737173,
      "subjects": [
        "One-on-one",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1go6FSARKt2UkgSVeS0PPm",
        "apple": "https://podcasts.apple.com/podcast/bonus-unabridged-interview-with-carly-ostler/id1615637188?i=1000670737173"
      }
    },
    {
      "id": "d1b2c8b0-f703-45ed-bd05-d646c6a859c5",
      "title": "BONUS: Unabridged Interview with Jade Miller",
      "description": "This week, we are bringing you our full interview with Jade Miller, founder of Peer Support for Multiples and a multiple herself. This incredibly informative and demystifying conversation, goes into Jade’s journey to becoming a peer support mentor and the limitations of therapy for those with Dissociative Identity Disorder. Andrea and Jade also dive into practical ways to support those with DID, the spectrum of dissociation to multiples, and the realities of being a Multiple. * * * Links/Resources: Check out Jade’s peer support platform and books: https://www.peersupportformultiples.com/ Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive ethical true crime bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-09-19T04:00:00Z",
      "duration": "00:42:59.5910000",
      "explicit": true,
      "spotifyId": "25o7KP7bnna3vfoHPrwe1E",
      "appleId": 1000670006462,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/25o7KP7bnna3vfoHPrwe1E",
        "apple": "https://podcasts.apple.com/podcast/bonus-unabridged-interview-with-jade-miller/id1615637188?i=1000670006462"
      }
    },
    {
      "id": "1d38815d-877b-4486-804f-4ba5976c0fc1",
      "title": "BONUS: Unabridged Interview with Jackie Rodriguez",
      "description": "We are working hard on season 5 of Nobody Should Believe Me, but in the meantime, we’re bringing you a series of unabridged interviews from the experts we talked to during the making of season 4! This week Andrea chats with Jackie Rodriguez, LMSW, who specializes in dissociative identity disorder and complex trauma. Jackie and Andrea discuss the complexities of DID and the stereotypes that have been exacerbated by popular media. Jackie talks through what therapy looks like for someone with DID and gives helpful advice for anyone looking to support someone with DID in their lives. *** Links/Resources: Learn more about Jackie’s services: https://openpathcollective.org/clinicians/jackie-rodriguez/ Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-09-12T04:15:00Z",
      "duration": "00:49:09.5370000",
      "explicit": true,
      "spotifyId": "4wLa1zr7oKKgJ7GWWxGtXp",
      "appleId": 1000669236329,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wLa1zr7oKKgJ7GWWxGtXp",
        "apple": "https://podcasts.apple.com/podcast/bonus-unabridged-interview-with-jackie-rodriguez/id1615637188?i=1000669236329"
      }
    },
    {
      "id": "ed76e0b4-0a16-422b-a5a1-969621e71591",
      "title": "BONUS: Unabridged Interview with Bea Yorker",
      "description": "Law professor, nurse, and president of Munchausen Support, Bea Yorker, shares what first got her interested in working with Munchausen by proxy cases, and remembers the first time she was exposed to medical child abuse. She recounts how she first met Jo in the Munchausen by proxy Committee of the American Professional Society on the Abuse of Children. Bea and Andrea talk through the positive psychological effects of peer support groups for those coping with trauma and how to create a safe space for survivors to help each other. *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-09-05T04:00:00Z",
      "duration": "01:05:30.6180000",
      "explicit": true,
      "spotifyId": "5kM42tOegGMGcMqfKIvcDM",
      "appleId": 1000668423434,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5kM42tOegGMGcMqfKIvcDM",
        "apple": "https://podcasts.apple.com/podcast/bonus-unabridged-interview-with-bea-yorker/id1615637188?i=1000668423434"
      }
    },
    {
      "id": "574d4031-877a-4198-b4df-bdb919796fdd",
      "title": "No One is Coming to Save Us",
      "description": "In our season four finale, we talk about what justice looks like for survivors of abuse and how to recover from the loss of an abusive parent. We examine the importance of confronting the reality of what happened as a crucial first step in a survivor’s healing and ask what feels like an impossible question–when the systems fail, as they so often do–what do you do about someone like Jo’s mom Donna? *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more and follow therapist Carly Oster . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-08-22T04:00:00Z",
      "duration": "00:38:12.5840000",
      "explicit": true,
      "spotifyId": "0Ck76cnv0RW28MzfDu17J8",
      "appleId": 1000665669688,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Ck76cnv0RW28MzfDu17J8",
        "apple": "https://podcasts.apple.com/podcast/no-one-is-coming-to-save-us/id1615637188?i=1000665669688"
      }
    },
    {
      "id": "dac442f6-c2b6-4b82-88c4-26684124b4b2",
      "title": "Cleaning Up The Mess",
      "description": "In the aftermath of Donna’s death, Jo returns home to Hutchinson to plan their mother’s funeral and clean up her mess one final time. As Jo and their sister Crystal sort through the detritus of the filthy, overstuffed apartment where Donna spent her final days, they come across strange artifacts, including letter from Jo’s childhood self. We also talk to therapist and Complex PTSD specialist, Carly Ostler about the complexities of grieving for an abusive parent and why they can have an even stronger hold on their children than loving parents. *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more and follow therapist Carly Oster . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-08-15T04:00:00Z",
      "duration": "00:40:17.5540000",
      "explicit": true,
      "spotifyId": "72pHs0aO8fzyXMe3bg8YQF",
      "appleId": 1000664756296,
      "subjects": [
        "One-on-one",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/72pHs0aO8fzyXMe3bg8YQF",
        "apple": "https://podcasts.apple.com/podcast/cleaning-up-the-mess/id1615637188?i=1000664756296"
      }
    },
    {
      "id": "c2b5a82f-6de4-4bff-9500-791594062a84",
      "title": "The Long Goodbye",
      "description": "Just as Jo has made huge personal strides in the spring of 2023, Donna slides into a coma and Jo returns to Hutchinson to say what they will believe to be their final goodbyes. However, even Donna’s “deathbed” isn’t what it seems, and she ends up pulling through: leaving Jo to manage the complicated process of setting boundaries with their mother after yet another dramatic brush with death. Over the next year, Jo continues to thrive and heal their relationship with their sister: just in time for the two to receive a shocking phone call. *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-08-08T04:00:00Z",
      "duration": "00:41:33.8840000",
      "explicit": true,
      "spotifyId": "7id3sDITCSDpaoLudioj0s",
      "appleId": 1000663345435,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7id3sDITCSDpaoLudioj0s",
        "apple": "https://podcasts.apple.com/podcast/the-long-goodbye/id1615637188?i=1000663345435"
      }
    },
    {
      "id": "5b0a9108-87eb-40b4-9f0c-7a1b621099a8",
      "title": "The Body is a Battlefield",
      "description": "Jo starts to make big strides within their personal life. From building community and finding friends, to finally being able to take care of themselves in a way that feels safe. They’ve even rediscovered their love for cheerleading. But just as they’re starting to forge a new relationship with their body, an injury causes a major setback. We talk to two of Jo’s closest people–their therapist Angie and their roommate Spencer–about watching Jo struggle through this difficult time, and gain insights into how survivors can be cared for during a health crisis. *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-08-01T04:00:00Z",
      "duration": "00:39:09.5310000",
      "explicit": true,
      "spotifyId": "2QfAWMagw5caKfPZgv0s3f",
      "appleId": 1000661931724,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QfAWMagw5caKfPZgv0s3f",
        "apple": "https://podcasts.apple.com/podcast/the-body-is-a-battlefield/id1615637188?i=1000661931724"
      }
    },
    {
      "id": "b9a87003-689f-4b20-937b-68b3daba88d9",
      "title": "“I love you to death”",
      "description": "When Jo begins sharing their experiences online, they get a request from the producers of nationally broadcast television show “The Doctors” to tell their story to an audience of millions. During their dramatic confrontation on air, Donna continues to gaslight Jo and deny the abuse; Jo nonetheless finds healing and release in opening up about the truth. But even as Jo begins to break away, Donna finds ways to pull them back in and distort their reality. *** Links/Resources: Watch Jo’s episode of The Doctors Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-07-25T04:00:00Z",
      "duration": "00:40:21.4980000",
      "explicit": true,
      "spotifyId": "7rKw3AWAhYqc3Qj9R1qesT",
      "appleId": 1000661096603,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7rKw3AWAhYqc3Qj9R1qesT",
        "apple": "https://podcasts.apple.com/podcast/i-love-you-to-death/id1615637188?i=1000661096603"
      }
    },
    {
      "id": "d86a0b77-ccc1-4690-bbf9-fe3ab4a6641d",
      "title": "Revelations",
      "description": "Today we look back at Jo’s revelation in their twenties that they’d been a victim of Munchausen by proxy abuse: a moment that turned their world upside down. As Jo forges a path forward – reviewing their medical records and even confronting their childhood pediatrician – they discover how complex healing from this abuse truly is. Jo also opens up about their experiences with Dissociative Identity Disorder. We speak to Jo’s therapist, Angie, about their complicated system of coping mechanisms. We also bring in Jackie Rodriguez LMSW, QMHP-CS and peer support specialist Jade Miller to help us understand the deeply misunderstood and stigmatized condition of DID. *** Links/Resources: Jade Miler - https://www.peersupportformultiples.com/ Jackie Rodriguez, LMSW, QMHP-CS - Instagram Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-07-18T04:00:00Z",
      "duration": "00:53:42.8830000",
      "explicit": true,
      "spotifyId": "2uIyOAXuChS3xmnXQNjDp5",
      "appleId": 1000660931068,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2uIyOAXuChS3xmnXQNjDp5",
        "apple": "https://podcasts.apple.com/podcast/revelations/id1615637188?i=1000660931068"
      }
    },
    {
      "id": "3865db34-13e5-4f56-8486-cc616987c92f",
      "title": "Breaking Free",
      "description": "Jo reconnects with their friend, Kristin, who took them in as a homeless teenager after Jo was removed from Donna’s care due to her alcoholism. As a young mother in the midst of her own difficult situation, Kristin’s relationship with Jo had its challenges, but as they recount their time together, it’s a healing and clarifying moment for both of them. Jo continues on their rocky road to freedom from their mother’s clutches as they look for help from the medical community outside their mother’s influence. *A warning for listeners this episode does contain descriptions of disordered eating. Please take care. *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . National Eating Disorders Resources: https://www.nationaleatingdisorders.org/get-help/ Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-07-11T04:00:00Z",
      "duration": "00:50:06.2750000",
      "explicit": true,
      "spotifyId": "0EpSGN875xTWAfS50TuPk9",
      "appleId": 1000659593518,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0EpSGN875xTWAfS50TuPk9",
        "apple": "https://podcasts.apple.com/podcast/breaking-free/id1615637188?i=1000659593518"
      }
    },
    {
      "id": "04cc4ac6-32d5-4fad-989f-c184d67ce6dc",
      "title": "Not Without My Daughter",
      "description": "As we dig deeper into Jo’s history, we tackle one of the many confusing aspects of their childhood: their paternity. We navigate the many twists and turns around the father figures in Jo’s life. From abusive men in the home to a secret father they never knew about, we unravel another complex layer of Donna’s deceptions. We hear more from Jo’s sister Crystal and talk to Jo’s biological father, Reza, about what it was like to be on the other side of the big lie. *A note that this episode does include mention of sexual assault and may be difficult for some listeners. Please take care. *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . National Sexual Violence Resource Center Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-07-04T04:00:00Z",
      "duration": "00:38:55.7380000",
      "explicit": true,
      "spotifyId": "41erMZZ6A7UlbkyQHYx55p",
      "appleId": 1000659565476,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/41erMZZ6A7UlbkyQHYx55p",
        "apple": "https://podcasts.apple.com/podcast/not-without-my-daughter/id1615637188?i=1000659565476"
      }
    },
    {
      "id": "94b569db-2a0e-4f14-8291-ccdd00a32204",
      "title": "A Ride-along with The Dating Detectives",
      "description": "In this very special crossover episode with our friends at The Dating Detectives, Andrea joins private eye Mackenzie Fultz and comedian Hannah Anderson as they delve into a case of medical mystery and romantic deception. Mila joins us to tell her harrowing story about how her girlfriend’s tragic battle with brain cancer turned out to be something far more sinister. *** Check out The Dating Detectives ! Follow The Dating Detectives on instagram . Follow Hanna and Mackenzie on instagram. Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-07-01T16:11:00Z",
      "duration": "01:01:33.7140000",
      "explicit": true,
      "spotifyId": "2et3RrPQZMosFvNYyS5x9S",
      "appleId": 1000660816452,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2et3RrPQZMosFvNYyS5x9S",
        "apple": "https://podcasts.apple.com/podcast/a-ride-along-with-the-dating-detectives/id1615637188?i=1000660816452"
      }
    },
    {
      "id": "2498a164-772e-4d02-a62c-047d88755194",
      "title": "“I Brought You Into This World I Can Take You Out”",
      "description": "While visiting their hometown, Jo reconnects with their older sister, Crystal, to have the deeply honest and heart-wrenching conversation their mother never wanted them to have: one where they share the hard truths about the abuse they both suffered at her hand. Crystal and Jo reach a new level of understanding of their shared experiences and their love for each other. We also speak to Munchausen by proxy expert Bea Yorker to talk about the process of discovery and recovery for survivors. *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-06-27T04:00:00Z",
      "duration": "00:56:54.8830000",
      "explicit": true,
      "spotifyId": "2NKTgAzjAAWLhcn2rMfy42",
      "appleId": 1000659562825,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NKTgAzjAAWLhcn2rMfy42",
        "apple": "https://podcasts.apple.com/podcast/i-brought-you-into-this-world-i-can-take-you-out/id1615637188?i=1000659562825"
      }
    },
    {
      "id": "ae887420-5a3f-4290-8696-7aaab1f3bfb5",
      "title": "Welcome To Hutchinson",
      "description": "Welcome to Season 4 of Nobody Should Believe Me! This season we are following the story of Jordyn Hope as they unravel the secrets of their childhood. After revelations that they were abused as a child, Jo bravely returns to their small, deeply religious hometown to attempt to unravel their many lingering questions about their upbringing. Was their abuse a secret? If not, why didn’t anyone help them? Jo connects with her first grade teacher and childhood best friend as they begin their search for answers. Andrea travels with Jo, hoping to help her friend find healing, and to see what the future might look like for the survivors in her own life. *** Links/Resources: Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-06-20T04:00:00Z",
      "duration": "00:47:54.6440000",
      "explicit": true,
      "spotifyId": "0TfbmxGjUJAbohnF7IqJOJ",
      "appleId": 1000659544021,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0TfbmxGjUJAbohnF7IqJOJ",
        "apple": "https://podcasts.apple.com/podcast/welcome-to-hutchinson/id1615637188?i=1000659544021"
      }
    },
    {
      "id": "7cc4afce-2bcc-4584-b666-8622b7743244",
      "title": "Crime Close to Home: A Conversation with Madison McGhee",
      "description": "Andrea Dunlop interviews Madison McGhee, host of the Ice Cold Case podcast, about her personal journey investigating her father\u0027s unsolved murder in 2002. They discuss the emotional complexity of the investigation, the challenges of maintaining objectivity, and the broader implications of failings in the justice system. Madison shares insights into how her podcast developed, her experiences with family backlash, and her determination to find answers. * * * Listen to Ice Cold Case . Follow Madison on Instagram . Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy. Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-06-13T04:00:00Z",
      "duration": "01:01:49.9360000",
      "explicit": false,
      "spotifyId": "7Iy4MG9urmQ5BtjfADmGzx",
      "appleId": 1000658860073,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7Iy4MG9urmQ5BtjfADmGzx",
        "apple": "https://podcasts.apple.com/podcast/crime-close-to-home-a-conversation-with-madison-mcghee/id1615637188?i=1000658860073"
      }
    },
    {
      "id": "3f2b1f45-572a-475a-875f-743177ac01c3",
      "title": "A Survivor’s Journey",
      "description": "What if you woke up one day and discovered that your whole life had been a lie? When Jordyn Hope learned about Munchausen by proxy in a college psychology class, their life was immediately turned upside down. Everything about their history was suddenly cast in a new light: from the mysterious illnesses they’d been plagued with since birth to the constant emergency room visits to the gaslighting from their mother. Now, years later, Jo returns to their small, rural hometown of Hutchinson, MN to try to put the pieces back together and help make sense of their traumatic childhood. Along the way, the story of Jordyn’s life will be rewritten and their relationship with their mother takes a turn they never could have anticipated. This is a story of self-discovery unlike any other: one of resilience, healing, and surviving the unthinkable. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-06-11T04:00:00Z",
      "duration": "00:04:13.8840000",
      "explicit": false,
      "spotifyId": "1MyzsLLc0JDiLaNYzVwy2b",
      "appleId": 1000658552336,
      "subjects": [
        "One-on-one",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MyzsLLc0JDiLaNYzVwy2b",
        "apple": "https://podcasts.apple.com/podcast/a-survivors-journey/id1615637188?i=1000658552336"
      }
    },
    {
      "id": "8185c9b1-fa52-4682-b150-4141ebe26556",
      "title": "Answering Your Season 3 Questions with Dr. Bex",
      "description": "Welcome to the Season 3 mailbag episode! Andrea is joined by Dr. Bex (aka Secret Florida Doctor Friend), to sort through all the commentary and listener feedback from Season 3. They tackle the good, the bad, and the just plain weird from the comments, and answer burning questions about the Kowalski case. We hear what it was like to cover this case in real time and to go on the road to meet some of the key players. Come down the rabbit hole with us! * * * Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy . Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-06-06T04:00:00Z",
      "duration": "01:11:05.8740000",
      "explicit": false,
      "spotifyId": "531jJzzz9O9QtEP4Cjd0iU",
      "appleId": 1000658002445,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/531jJzzz9O9QtEP4Cjd0iU",
        "apple": "https://podcasts.apple.com/podcast/answering-your-season-3-questions-with-dr-bex/id1615637188?i=1000658002445"
      }
    },
    {
      "id": "6e0600ab-6093-4293-a301-266ed7ff50bf",
      "title": "Child Abuse Prevention: A Conversation with Kathleen Strader",
      "description": "This week Andrea is joined by Kathleen Strader, the National Director for Healthy Families America, the signature home visiting program of Prevent Child Abuse America. Following the Take Care of Maya film and media coverage of so-called \u0022medical kidnapping\u0022 and misleading coverage of child abuse, we move the conversation to solutions: what can we do to prevent child abuse? We delve into Kathleen\u0027s background dealing with child abuse cases and her work supporting families through home visiting programs. Their conversation touches on the complexities of child abuse, systemic issues, and the importance of supportive measures and interventions that meet families where they are. As we wrap up our coverage of the landmark Kowalski v Johns Hopkins All Childrens case, we issue a hopeful message of how we can alleviate one of society\u0027s most challenging problems. * * * Check out Prevent Child Abuse America . Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy. Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-05-30T04:00:00Z",
      "duration": "01:01:32.5380000",
      "explicit": false,
      "spotifyId": "2ounmULV3IRlma61yc5kMO",
      "appleId": 1000657242405,
      "subjects": [
        "One-on-one",
        "Landmark"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ounmULV3IRlma61yc5kMO",
        "apple": "https://podcasts.apple.com/podcast/child-abuse-prevention-a-conversation-with/id1615637188?i=1000657242405"
      }
    },
    {
      "id": "e122883e-095c-44e1-b1c0-5d13706f641d",
      "title": "What\u0027s Happening in Lehigh?",
      "description": "This week Andrea is joined by Dr. Marc Feldman as she dives into the complexities and controversies surrounding medical child abuse and the developing story in Lehigh, PA about \u0022overdiagnosis\u0022. They delve into the media’s role in shaping perceptions and the potential for a moral panic about doctors \u0022falsely accusing\u0022 parents of child abuse. Andrea and Dr. Feldman address the challenges in protecting children, critiques of the healthcare and legal systems, and the broader social and political movement emerging from these cases. * * * Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy . Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-05-23T04:00:00Z",
      "duration": "00:34:35.3760000",
      "explicit": false,
      "spotifyId": "2T1ft1PvaR68Nu1i1VpQ8X",
      "appleId": 1000656465787,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2T1ft1PvaR68Nu1i1VpQ8X",
        "apple": "https://podcasts.apple.com/podcast/whats-happening-in-lehigh/id1615637188?i=1000656465787"
      }
    },
    {
      "id": "1c358299-e192-4387-910f-3115f88c19ee",
      "title": "Kowalski Case Update with Ethen Shapiro",
      "description": "Join Andrea as she delves back into the ongoing legal battle of Kowalski v. Johns Hopkins All Children\u0027s Hospital, with Ethen Shapiro, the lead defense attorney for Johns Hopkins All Children\u0027s. They discuss the grounds for a retrial based on allegations of juror misconduct and the potential chilling effect on mandatory reporters following the substantial amount of money awarded to the Kowalski family by the jury. We also look at the the broader societal impacts on mandatory reporting and the protecting vulnerable children from abuse. * * * Get up to speed on the Kowalski case with our Kowalski Catch-Up Playlist on Spotify Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy . Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-05-16T04:00:00Z",
      "duration": "00:37:49.9100000",
      "explicit": false,
      "spotifyId": "6GUOGWVH4yhL4IZ2AwFXPb",
      "appleId": 1000655736176,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6GUOGWVH4yhL4IZ2AwFXPb",
        "apple": "https://podcasts.apple.com/podcast/kowalski-case-update-with-ethen-shapiro/id1615637188?i=1000655736176"
      }
    },
    {
      "id": "3411a07d-e1ea-45cf-b8ee-642e012e86ca",
      "title": "What Happened to Beata?",
      "description": "This week\u0027s episode delves into the intricate details surrounding Beata Kowalski\u0027s death, which was central to the Kowalski\u0027s lawsuit against Johns Hopkins All Children\u0027s, as well as the documentary \u0027Take Care of Maya\u0027. In court, Beata\u0027s death was presented as an act of maternal sacrifice and heroism. Through interviews and court deposition excerpts, we\u0027ll explore the odd circumstances leading up to and immediately after Beata\u0027s death that suggest a far more complex story might lie beneath the surface. * * * Get up to speed on the Kowalski case with our Kowalski Catch-Up Playlist on Spotify Preorder Andrea\u0027s new book The Mother Next Door: Medicine, Deception, and Munchausen by Proxy. \u0026#xfeff;Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-05-09T17:57:00Z",
      "duration": "00:43:54.9190000",
      "explicit": true,
      "spotifyId": "1myGQvvSKBpOCf9GDkViaE",
      "appleId": 1000655084837,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1myGQvvSKBpOCf9GDkViaE",
        "apple": "https://podcasts.apple.com/podcast/what-happened-to-beata/id1615637188?i=1000655084837"
      }
    },
    {
      "id": "0ac11dae-9788-4f92-96e6-00e9e012b99c",
      "title": "What Jack Knew",
      "description": "As we prepare to launch Season Four next month, we’re revisiting the subject of Season Three—the landmark Kowalski v. Johns Hopkins All Children’s verdict, in which a jury awarded Jack Kowalski more than $200 million dollars in damages following the suicide of his wife Beata while their daughter Maya Kowalski was in state custody because a medical child abuse investigation. Though the media has been largely sympathetic to Kowalski’s case—thanks in large part to the popular Netflix film “Take Care of Maya”—our exploration continues to reveal that nothing about this story is what is seems. With the case headed towards appeal, we take a closer look at newly released information about what was going on with the Kowalski family, as well as how this verdict is affecting mandatory reporting and the safety of children in pediatric hospitals all around the country. * * * Get up to speed on the Kowalski case with our Kowalski Catch-Up Playlist on Spotify Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Subscribe on YouTube where we have full episodes and lots of bonus content. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-05-02T04:00:00Z",
      "duration": "00:38:27.3950000",
      "explicit": false,
      "spotifyId": "0qyVrOyuoFgIToFq34X6ZA",
      "appleId": 1000654245050,
      "subjects": [
        "One-on-one",
        "Landmark"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0qyVrOyuoFgIToFq34X6ZA",
        "apple": "https://podcasts.apple.com/podcast/what-jack-knew/id1615637188?i=1000654245050"
      }
    },
    {
      "id": "1d82f737-16ad-4a5b-8d60-033973a57c26",
      "title": "Cons, Scams, and Adventures in Podcasting with Roberta Blevins and Terra Newell",
      "description": "On this week\u0027s episode, Andrea is joined by Roberta Blevins, creator and host of the Life After MLM podcast, and Terra Newell, who was featured in mega-hit Dirty John podcast and has since created and hosts Terra\u0027s Baddy Club. The audience gets to listen in as these three women talk about about the pros and cons of having a personal connection to the topics of their podcasts, how that affects their coverage of the topic, and the intersection between Munchausen by proxy, MLMs, and domestic violence. *Special thanks for Spotify, who provided recording support for this episode! * * * Listen to Life After MLM. Follow Roberta on Instagram . Listen to Dirty John . Listen to Terra\u0027s Baddy Club . Follow Terra on Instagram . Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-04-25T04:00:00Z",
      "duration": "00:41:53.0310000",
      "explicit": false,
      "spotifyId": "3a8B99aaEgesy0XoxxSAHF",
      "appleId": 1000653526808,
      "subjects": [
        "Multi-Level Marketing"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3a8B99aaEgesy0XoxxSAHF",
        "apple": "https://podcasts.apple.com/podcast/cons-scams-and-adventures-in-podcasting-with/id1615637188?i=1000653526808"
      }
    },
    {
      "id": "cb1699ca-6508-4982-bc64-c2ac2262130c",
      "title": "Unabridged Conversation with Hope Ybarra",
      "description": "Listen to an episode we\u0027re releasing from our subscriber vault -- Andrea\u0027s full conversation with Hope Ybarra, whose story we\u0027ve been revisiting in our look back at season one of the show. This conversation gives listeners a peek into the mind of a perpetrator and inspired the name of the show \u0022Nobody Should Believe Me\u0022. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-04-18T04:00:00Z",
      "duration": "01:22:19.5460000",
      "explicit": false,
      "spotifyId": "1KZTjoPDnaEOTbqniAsVcL",
      "appleId": 1000652808437,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1KZTjoPDnaEOTbqniAsVcL",
        "apple": "https://podcasts.apple.com/podcast/unabridged-conversation-with-hope-ybarra/id1615637188?i=1000652808437"
      }
    },
    {
      "id": "95cd1b3c-334e-4dab-930a-42eac1425ba9",
      "title": "Revisiting Season One: There\u0027s Hope (Season One Finale)",
      "description": "In the final episode of our look back at season one, Andrea reflects on her experience interviewing Hope Ybarra, how it impacted her in regards to her sister, and audience reactions to the conversation. * * * Andrea has made an intense connection with Hope Ybarra\u0027s family, and asked experts, doctors, and the detective so many of her burning questions about Munchausen by Proxy. But she\u0027s become increasingly fixated on talking to Hope herself as she comes to realize that it may be her only chance to get the insights she needs. In this stunning season one finale, Andrea travels to Mountain Home, Idaho, to meet with Hope Ybarra. In this intense, emotional back-and-forth, we hear straight from Hope what life is like for her after being released from prison. We find out what she\u0027s up to and what she hopes for from the future. Hope listens to her own family—all of whom she\u0027s estranged from with the exception of Robin—talk about what she was like before everything fell apart. She insists that she still loves her children, despite what she did. We see the human being behind the monstrous acts that splashed Hope\u0027s story across headlines and landed her in prison for a decade. Andrea asks Hope what might have been done to help her and what she might say to her younger self if she could go back. Finally, she tells Hope that if she really wants her family back, she should get treatment and offers to help her if she wants that. Hope is friendly and warm in person, but Andrea is left with the unsettling truth that she hasn\u0027t changed. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-04-11T04:00:00Z",
      "duration": "00:42:45.3810000",
      "explicit": false,
      "spotifyId": "4JeypdoyvSjmBYl2skJBim",
      "appleId": 1000652102872,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4JeypdoyvSjmBYl2skJBim",
        "apple": "https://podcasts.apple.com/podcast/revisiting-season-one-theres-hope-season-one-finale/id1615637188?i=1000652102872"
      }
    },
    {
      "id": "effeb4ef-f8d8-4a9f-b921-d31674341140",
      "title": "Revisiting Season One: Can They Be Saved?",
      "description": "After a look back at season 1 episode 7, Can They Be Saved?, Andrea reflects on how her thoughts regarding the psychopathology of Munchausen by Proxy has evolved over the years, as she has spoken to experts, survivors, and perpetrators of this abuse. * * * Andrea delves deep into her questions around the psychopathology of Munchausen by Proxy perpetrators. Floored by the similarities in the many cases she’s researched, she talks to two of the world\u0027s foremost experts on the disorder—Dr. Marc Feldman and Dr. Mary Sanders—about the characteristics, warning signs, and causes of the disorder that has upended the lives of so many people Andrea has spoken to throughout the course of the podcast. Why would a mother ever do this? What do they get from it? And most importantly, what could be done to stop them? Is it possible for someone who does these things to get treatment? * * * Follow Andrea on Instagram for behind-the-scenes photos: @andredunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-04-04T04:00:00Z",
      "duration": "00:43:18.7650000",
      "explicit": false,
      "spotifyId": "0jz2YaLj84BzPl1WdaPwEX",
      "appleId": 1000651383993,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jz2YaLj84BzPl1WdaPwEX",
        "apple": "https://podcasts.apple.com/podcast/revisiting-season-one-can-they-be-saved/id1615637188?i=1000651383993"
      }
    },
    {
      "id": "fb8f6829-00a3-467c-b68d-f10ee5a7b3c6",
      "title": "Revisiting Season One: Sisters",
      "description": "We\u0027re going back to the beginning with an extended version of our very first episode! Be sure to stay tuned until the end for a special postscript with Andrea as she gives a behind-the-scenes look at how this show began. *** We meet accomplished novelist and loving mother Andrea Dunlop as she embarks on a journey to understand the series of events that tore her family apart. We learn that her older sister has been investigated twice for Munchausen by Proxy abuse, which inspired Andrea to learn everything she could about this complex and misunderstood issue. We see Andrea become captivated by the story of Hope Ybarra and go along with her to meet Hope’s father, sister, and brother: the first people Andrea has ever spoken to who’ve actually lived through a case. But can anything prepare Andrea for the truth? Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Download the APSAC\u0027s practice guidelines here . *** Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-03-28T04:00:00Z",
      "duration": "00:40:09.2990000",
      "explicit": false,
      "spotifyId": "0CCRZKIbTRdIXEEj3FosqB",
      "appleId": 1000650687207,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CCRZKIbTRdIXEEj3FosqB",
        "apple": "https://podcasts.apple.com/podcast/revisiting-season-one-sisters-surviving/id1615637188?i=1000650687207"
      }
    },
    {
      "id": "b59474ff-1c93-4ad8-9146-526bdfaef0a5",
      "title": "Revisiting Season One: Nobody Would Believe Me: Dads Part 2",
      "description": "This is the 5th episode of our look back at season one of the show. We revisit Andrea\u0027s conversation with two more dads who were a part of Munchausen by Proxy cases. At the end of the episode, Andrea gives a brief update on one of the dads and shares her thoughts on how gender roles play into these cases and why such a high percentage of offenders are women. *** As we learn from Detective Mike Weber, the father in a Munchausen by Proxy case can be the most important ally--or the biggest obstacle--in protecting child victims from abuse. In part two of Andrea’s examination of the father’s role in MBP cases, Andrea speaks to “John”, a father devastated but the revelation that his ex-wife had subjected their son to unnecessary brain surgery. We also talk to Ryan Crawford, a man who found himself fighting for his son’s life against a disbelieving system. Plus we get a stunning real-time update on one of our cases as “John” decides to come forward with his true identity. You can listen to the follow-up interview with him here . * * * Follow Andrea on Instagram for behind-the-scenes photos: @andredunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com More about Ryan Crawford\u0027s story: https://www.dmagazine.com/publications/d-magazine/2019/august/the-boy-who-stayed-sick/ * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-03-21T04:00:00Z",
      "duration": "00:58:00.0840000",
      "explicit": false,
      "spotifyId": "75xMJ2kaj2zSuev1CjfSCR",
      "appleId": 1000649953159,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/75xMJ2kaj2zSuev1CjfSCR",
        "apple": "https://podcasts.apple.com/podcast/revisiting-season-one-nobody-would-believe-me-dads-part-2/id1615637188?i=1000649953159"
      }
    },
    {
      "id": "f0b6419d-1ae2-4ed9-aaf6-8aaa118a5036",
      "title": "Unabridged Conversation with Dr. Jessica Pryce",
      "description": "Andrea connects with Dr. Jessica Pryce, an expert on the frontlines of child wellfare work, research, and reform. She talks to Andrea about her book, Broken: Transforming Child Protective Services, the child welfare system as a whole, and how her work applies to the needs of children and families affected by Munchausen by Proxy. * * * Learn more about Dr. Jessica Pryce here . Purchase Broken: Transforming Child Protective Services here . Follow Andrea on Instagram for behind-the-scenes photos: @andredunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-03-19T15:00:00Z",
      "duration": "00:55:22.5920000",
      "explicit": false,
      "spotifyId": "1hGttg63NVpAIU7s4yu1Op",
      "appleId": 1000649727160,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1hGttg63NVpAIU7s4yu1Op",
        "apple": "https://podcasts.apple.com/podcast/unabridged-conversation-with-dr-jessica-pryce/id1615637188?i=1000649727160"
      }
    },
    {
      "id": "551906d3-f38b-48c6-8304-edb1d2d15e26",
      "title": "Revisiting Season One: Nobody Would Believe Me: Dads Part 1",
      "description": "During this re-aired episode, we revisit our conversation with 2 fathers affected by Munchausen by Proxy. At the end of the episode, we reconnect with George Hunnicut to discuss how life has been for him and his children after speaking to us on the show two years ago. *** As we learn from Detective Mike Weber, the father in a Munchausen by Proxy case can be the most important ally--or the biggest obstacle--in protecting child victims from abuse. We learn more about how Andrea’s own family became divided during the first investigation into her sister and we meet George Hunnicut, a veteran who discovered his young wife was abusing their infant son and found himself up against a system that had no idea what to do for him. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andredunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-03-14T04:00:00Z",
      "duration": "01:19:12.1690000",
      "explicit": false,
      "spotifyId": "3asqtB99f8gjS3JK9pnyp3",
      "appleId": 1000649146245,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3asqtB99f8gjS3JK9pnyp3",
        "apple": "https://podcasts.apple.com/podcast/revisiting-season-one-nobody-would-believe-me-dads-part-1/id1615637188?i=1000649146245"
      }
    },
    {
      "id": "2c68c209-ffe4-487f-bfd3-549cad281bcc",
      "title": "Revisiting Season One: What\u0027s in the Water in Tarrant County?",
      "description": "We take a look back at the third episode of the show. At the end of the episode, we catch up with Detective Mike Weber, friend of the show and expert in the investigation of Medical Child Abuse. *** Andrea speaks to Deanna Boyd, the crime reporter who broke the Hope Ybarra case and discovers that Hope\u0027s was one of many Munchausen By Proxy cases in Tarrant County that Deanna unearthed; all of which had flown under the radar. What\u0027s going on here? Why are there so many cases in this one area? As Andrea interviews Deanna and meets with Detective Mike Weber, as well as Dr. Jayme Coffman and Dr. Karen Shultz--two doctors involved with the Ybarra and many other MBP cases--she makes a chilling discovery. It\u0027s not that there are so many cases in Tarrant County, it\u0027s just that they\u0027re catching them. If the systems meant to protect children were functioning, every county would look like Tarrant. Andrea can only guess as to what truly went on behind the scenes in her own family\u0027s case, but she begins to grasp what the systems involved--CPS, the police, the doctors--are up against and why so many cases are destined to fail. Meanwhile, Andrea continues her maddening back-and-forth with Hope. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andredunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-03-07T05:00:00Z",
      "duration": "01:23:07.8980000",
      "explicit": false,
      "spotifyId": "69QsVoic0tFmtLwqZ4n444",
      "appleId": 1000648307588,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/69QsVoic0tFmtLwqZ4n444",
        "apple": "https://podcasts.apple.com/podcast/revisiting-season-one-whats-in-the-water-in-tarrant-county/id1615637188?i=1000648307588"
      }
    },
    {
      "id": "cecb145f-2e57-43ac-ba12-723b9a03756d",
      "title": "Unabridged interview with Patrick (son of Dr. Sally Smith)",
      "description": "In this bonus episode you’ll hear host Andrea Dunlop\u0027s full interview with Dr. Sally Smith’s son, Patrick. They discuss the impact of the slanted and sensationalized media coverage of Dr. Sally Smith’s work on him and his family. Patrick shares his pride in his mother\u0027s career as well as fears over the impact of the media coverage and the verdict in the Kowalski case. The full unbridged interview with Dr. Sally Smith will be available to subscribers. In the meantime, we are hard at work on season 4, stay tuned and subscribe wherever you listen to podcasts. *** Munchausen Support accepts donations and volunteers at www.munchausensupport.com Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Download the APSAC\u0027s practice guidelines here . *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-02-08T08:00:00Z",
      "duration": "01:10:20.0810000",
      "explicit": false,
      "spotifyId": "1IN1PoCoif94gYEQ038XIg",
      "appleId": 1000644602618,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1IN1PoCoif94gYEQ038XIg",
        "apple": "https://podcasts.apple.com/podcast/unabridged-interview-with-patrick-son-of-dr-sally-smith/id1615637188?i=1000644602618"
      }
    },
    {
      "id": "480b9ea5-8f7b-4ca3-908b-5639bcf7e0ee",
      "title": "Unbridged interview with Ethen Shapiro",
      "description": "In this bonus episode you’ll hear host Andrea Dunlop\u0027s full interview with Ethen Shapiro, lead attorney for John Hopkins All Childrens Hospital. Shapiro offers shocking insights into the trial and the media coverage of the Kowalski case, as well as what’s next for the defense team. We are hard at work on season 4, stay tuned and subscribe wherever you listen to podcasts. *** Munchausen Support accepts donations and volunteers at www.munchausensupport.com Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Download the APSAC\u0027s practice guidelines here . *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-02-01T08:00:00Z",
      "duration": "01:01:58.6350000",
      "explicit": false,
      "spotifyId": "5tBuLNQIJrKHouanGhcTcm",
      "appleId": 1000643771369,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5tBuLNQIJrKHouanGhcTcm",
        "apple": "https://podcasts.apple.com/podcast/unbridged-interview-with-ethen-shapiro/id1615637188?i=1000643771369"
      }
    },
    {
      "id": "b445f170-08e4-4cab-9d77-e4c21c724a28",
      "title": "Unbridged interview with Detective Mike Weber",
      "description": "In this bonus episode you’ll hear host Andrea Dunlop\u0027s full interview with friend of the show Detective Mike Weber. Mike—who wrote the FBI guidelines on investigating medical child abuse—digs into the police report about Maya Kowalski and helps Andrea put it in context, revealing the serious and disturbing nature of the case. NOTE: We recorded this interview in September before the Kowalski v Johns Hopkins All Childrens trial, so information revealed during the trial will not be reflected. *** More about Mike Weber: https://mikeweberconsulting.com/ Munchausen Support accepts donations and volunteers at www.munchausensupport.com Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Download the APSAC\u0027s practice guidelines here . *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-01-25T08:00:00Z",
      "duration": "01:24:25.1420000",
      "explicit": false,
      "spotifyId": "23TV69JXQYoGQdYoRaSPn6",
      "appleId": 1000642882729,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/23TV69JXQYoGQdYoRaSPn6",
        "apple": "https://podcasts.apple.com/podcast/unbridged-interview-with-detective-mike-weber/id1615637188?i=1000642882729"
      }
    },
    {
      "id": "7b0fc782-6dd1-4080-b791-59e8a4c0df40",
      "title": "Dangerous Women (Season Finale: Part 3)",
      "description": "In the third and final installment of our exclusive interview with Dr. Sally Smith, she shares her side of what happened in the Maya Kowalski case, revealing how perilous Maya’s situation truly was when she originally arrived at Johns Hopkins All Childrens in October of 2016. Dr. Sally Smith also reveals, for the first time, the details of the multi-million-dollar settlement with the Kowalski family and shares the impact that this case could have on medical providers and abused children going forward. And finally Dr. Sally Smith disclosess her concerns and her hopes for Maya and Kyle Kowalski—the two children thrust into the national spotlight by their father’s lawsuit—and lastly, her reflections on the work she’s devoted her life to. *** Munchausen Support accepts donations and volunteers at www.munchausensupport.com Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Download the APSAC\u0027s practice guidelines here . *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-01-18T08:00:00Z",
      "duration": "01:18:51.7420000",
      "explicit": false,
      "spotifyId": "47sAprKibjBAHvu1rXmFtc",
      "appleId": 1000642069926,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/47sAprKibjBAHvu1rXmFtc",
        "apple": "https://podcasts.apple.com/podcast/dangerous-women-season-finale-part-3/id1615637188?i=1000642069926"
      }
    },
    {
      "id": "276a08ff-336a-4308-b68b-5048b8ae0db2",
      "title": "Bad Press (Season Finale: Part 2)",
      "description": "In the second part of our exclusive interview with Dr. Sally Smith, we discuss how the media coverage of her reached a fever pitch and turned her life and career upside down. We explore how not only the Netflix film but a high-profile piece in New York Magazine rewrote the narrative of the Kowalski case and Dr. Smith’s involvement to cast her as a villain. We unpack the stories of the four other families in the Netflix film—featured as examples of “false allegations” made by Dr. Smith—and uncover the more complicated truth about what happened to the children involved. We hear from Dr. Smith about how the media has stoked outrage and real-life threats and harassment against her, her coworkers, and her family. We see the horrifying truth that what happened to Dr. Sally Smith could happen to any doctor in her position; looking at how the conspiracy theory of “medical kidnapping” is being constructed and affirmed by media on both sides of the political spectrum. *** Read Dyan Neary\u0027s New York Magazine piece here: https://www.thecut.com/article/child-abuse-munchausen-syndrome-by-proxy.html Watch the full video of John Stewart here: https://www.tiktok.com/@blind_gossip/video/7295142757612588334?_r=1\u0026_t=8gwrdSfC298 Records of the four families covered in the film here: https://drive.google.com/drive/folders/1FpSFjvX_8WB5cgPCI0E_cpXj1jaeVcC4?usp=sharing Munchausen Support accepts donations and volunteers at www.munchausensupport.com If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Download the APSAC\u0027s practice guidelines here . * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-01-11T08:00:00Z",
      "duration": "01:05:21.9200000",
      "explicit": false,
      "spotifyId": "4Se39EQjCJ6rqJeAz7UXGG",
      "appleId": 1000641065063,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Se39EQjCJ6rqJeAz7UXGG",
        "apple": "https://podcasts.apple.com/podcast/bad-press-season-finale-part-2/id1615637188?i=1000641065063"
      }
    },
    {
      "id": "047fce64-025e-4e49-bafd-1f16b9ab4aa1",
      "title": "The Trials of Dr. Sally Smith (Season Finale: Part 1)",
      "description": "In an exclusive interview with Dr. Sally Smith, host Andrea Dunlop travels to Florida to speak to the embattled child abuse pediatrician about her life and work and the Maya Kowalski case that saw her cast as the villain of a Netflix film. We get an inside look into Dr. Smith’s groundbreaking career as one of America\u0027s first board-certified child abuse pediatricians. We learn what it was like to face some of the most difficult cases imaginable all while raising two children of her own. And we see how the toughness necessary for her work led her to be ruthlessly judged in the public eye. This must-listen first installment of our season finale sets the stage for explosive revelations about the Kowalski case, the four other “falsely accused” families in the Netflix film, and much more. *** Munchausen Support accepts donations and volunteers at www.munchausensupport.com Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Download the APSAC\u0027s practice guidelines here . * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-01-04T08:00:00Z",
      "duration": "00:39:04.3330000",
      "explicit": false,
      "spotifyId": "3774Bpp4V28oqb0SgzOoES",
      "appleId": 1000640029451,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3774Bpp4V28oqb0SgzOoES",
        "apple": "https://podcasts.apple.com/podcast/the-trials-of-dr-sally-smith-season-finale-part-1/id1615637188?i=1000640029451"
      }
    },
    {
      "id": "d12c29b1-1835-47e9-a507-554b10de2a49",
      "title": "A survivor\u0027s perspective: unabridged interview with Jordyn Hope",
      "description": "In this bonus episode, host Andrea interviews regular guest and friend of the show Jordyn Hope, a survivor of Munchausen by proxy abuse. Jo shares their personal story of revelations of abuse and recounts the emotional toll of constantly having to prove their own sickness. Andrea and Jo discuss the Maya Kowalski case and Jo provides insight into the parent-child dynamics, including the enmeshment, lack of boundaries, and parentification often seen in abusive situations. Andrea and Jo grapple with the complicated feelings around Maya\u0027s continued defense of her mother. Jo also opens up about how painful it is for survivors to hear their abuse erased and denied. They offer a message of validation and fight to other survivors struggling with self-doubt in the wake of this high-profile case. This is a thoughtful, nuanced discussion around the themes of voice, compassion, and the ripple effects of denying abuse. *** Munchausen Support accepts donations and volunteers at www.munchausensupport.com Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Download the APSAC\u0027s practice guidelines here . *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-28T08:00:00Z",
      "duration": "01:12:37.3020000",
      "explicit": false,
      "spotifyId": "7avkzU0y4hDqe4bcF3QoqE",
      "appleId": 1000639895343,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7avkzU0y4hDqe4bcF3QoqE",
        "apple": "https://podcasts.apple.com/podcast/a-survivors-perspective-unabridged-interview-with/id1615637188?i=1000639895343"
      }
    },
    {
      "id": "a62ecca5-7d90-4f81-ae8f-99e997b58205",
      "title": "Media Circus",
      "description": "This week Andrea examines how the harrowing and complex story of the Maya Kowalski case turned into a pop culture moment, and spread dangerous misinformation in the process. We continue our conversation with Ethen Shapiro, lead attorney for Johns Hopkins All Childrens, about how the media coverage of this case got so out of hand and the risks it poses to doctors and children going forward. We take a deeper look at how entertainment reporter Caitlin Keating stumbled onto the story at her job at People Magazine, and despite her questionable grasp of medical child abuse issues, made a movie about a complicated case that was subsequently viewed by millions of people. Andrea shares revelations from Beata Kowalski\u0027s blog, written disturbingly in her young daughter Maya\u0027s voice, and wonders how anyone can ignore its terrifying contents. Stay tuned for a sneak peek of our exclusive interview featured in our season finale. *** Read Beata’s blog: https://drive.google.com/drive/folders/1FpSFjvX_8WB5cgPCI0E_cpXj1jaeVcC4?usp=drive_link Megan Fox YouTube interview with Gregory Anderson: https://www.youtube.com/watch?v=22eytc7v8oc\u0026t=9693s Kat and Nat Unfiltered: https://catandnat.ca/new-blog/hhttps/openspotifycom/take-care-of-maya-with-caitlin-keating Guys We Fucked podcast: https://www.youtube.com/watch?v=nlbosK25e7U Munchausen Support accepts donations and volunteers at www.munchausensupport.com *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Download the APSAC\u0027s practice guidelines here . Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-21T08:00:00Z",
      "duration": "00:46:05.7920000",
      "explicit": false,
      "spotifyId": "4Tnh96RHbX9jaKJTntfzqx",
      "appleId": 1000639000212,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Tnh96RHbX9jaKJTntfzqx",
        "apple": "https://podcasts.apple.com/podcast/media-circus/id1615637188?i=1000639000212"
      }
    },
    {
      "id": "c565c6b5-37f2-41a2-95df-e13da826f079",
      "title": "What Now?",
      "description": "Just when we thought the endless saga of Kowalski v Johns Hopkins All Childrens was over...it turns out it might only be beginning. In this episode, lead attorney for the Johns Hopkins All Childrens defense team, Ethen Shapiro, offers an insider\u0027s perspective on what happened in during the trial and what’s happened in the wake of it. Tina and Andrea discuss newly introduced evidence including Beata\u0027s requests to increase medications despite risks, Dr. Kirkpatrick\u0027s questionable diagnostic process, and communications illuminating Beata\u0027s substantial role in daughter Maya\u0027s care. Shapiro unpacks how harmful the verdict is for healthcare providers now unsure about reporting potential abuse and explains why the media coverage of this case and others like it is asymmetrical warfare. We discuss the motion for a new trial based on juror misconduct, what happens next, and what it all means. *** Read Beata\u0027s emails and view Ethen Shapiro\u0027s slide deck laying out the case: https://drive.google.com/drive/folders/1FpSFjvX_8WB5cgPCI0E_cpXj1jaeVcC4?usp=sharing Watch Ethen Shapiro\u0027s closing arguments on Law \u0026 Crime\u0027s YouTube channel: https://www.youtube.com/watch?v=3HBYKAN3BxM Munchausen Support accepts donations and volunteers at www.munchausensupport.com If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Download the APSAC\u0027s practice guidelines here . Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-12-14T08:00:00Z",
      "duration": "00:49:15.4930000",
      "explicit": false,
      "spotifyId": "2NaAAi50smDdvDE97mHhOI",
      "appleId": 1000638251281,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2NaAAi50smDdvDE97mHhOI",
        "apple": "https://podcasts.apple.com/podcast/what-now/id1615637188?i=1000638251281"
      }
    },
    {
      "id": "9b4ff96d-9865-4b0b-9b85-f2a6cdac5f18",
      "title": "System Override",
      "description": "With the jury\u0027s stunning $242 million verdict in favor of the Kowalski family, host Andrea Dunlop looks at why this case has struck such a nerve on both sides of the political spectrum. She examines why some mothers accused of medical child abuse are viewed as monsters and others as martyrs. Andrea looks at the charges against social worker Cathy Bedy the woman who became the face of the child welfare bureaucracy during the Maya Kowalski case and examines her testimony. We also seek out answers about the troubled state of child welfare in America by talking to Dr. Jessica Pryce, author of the forthcoming book Broken: Transforming Child Protective Services—Notes of a Former Caseworker. Dr. Pryce shares heart-wrenching stories of mothers whose lives have been turned upside down by investigations and sets out a compelling and urgent case for an overhaul of CPS. With her inside view of the system, she also gives insight on how doctors and other mandated reporters can do the best for the families they want to help even within the current, deeply flawed system. This episode grapples with the complexity around reporting child abuse suspicions and the potentially chilling ripple effects of the explosive verdict in Kowalski v Johns Hopkins All Childrens. It examines the lack of support for struggling parents in America, while leaving the listener with urgent questions about justice and equity. *** Pre-order Dr. Jessica Pryce’s book here: https://www.amazon.com/Broken-Transforming-Protective-Services_Notes-Caseworker/dp/0063036193 Learn more about Dr. Pryce’s work on her website: https://jessicaprycephd.com/ Munchausen Support accepts donations and volunteers at www.munchausensupport.com If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Download the APSAC\u0027s practice guidelines here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-30T08:00:00Z",
      "duration": "00:44:29.6620000",
      "explicit": false,
      "spotifyId": "4cQpTqhIDjCIKAeBma3EmU",
      "appleId": 1000635736696,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4cQpTqhIDjCIKAeBma3EmU",
        "apple": "https://podcasts.apple.com/podcast/system-override/id1615637188?i=1000635736696"
      }
    },
    {
      "id": "b1086925-0e0b-4c0b-b179-a42293a98c2f",
      "title": "Star Witness",
      "description": "As we continue to process the far-reaching implications of the shocking verdict in the Kowalski case, we take a closer look at Maya Kowalski’s testimony and what we know about her. She’s emerged as a divisive figure in the case: alternately being cast as a brave heroine or as a manipulator. But given the evidence of her possible abuse and the questionable motives of the adults surrounding her, the truth is far more nuanced. We bring in survivor Jordyn Hope and child and adolescent psychiatrist Dr. Mary Sanders to help unpack the impact of trauma on memory and the aftereffects of medical child abuse. As Maya continues to be thrust into the spotlight for a role she didn’t choose, we grapple with the outcome of what it could all mean for her. *** Munchausen Support accepts donations and volunteers at www.munhausensupport.com If you have a story about medical child abuse that you are ready to share you can tag @andreadunlop, email hello@nobodyshouldbelieveme.com or leave us a voicemail at (484) 768-0266 Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-22T08:00:00Z",
      "duration": "01:13:29.2080000",
      "explicit": false,
      "spotifyId": "2WTfkv6PJcf0rdxY5fJtFY",
      "appleId": 1000635209481,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WTfkv6PJcf0rdxY5fJtFY",
        "apple": "https://podcasts.apple.com/podcast/star-witness/id1615637188?i=1000635209481"
      }
    },
    {
      "id": "45a7c911-25df-4cf5-8ef1-7ad308f60ade",
      "title": "The Verdict Part 2",
      "description": "Andrea checks in with lawyer and trial consultant Jonathan Leach hours after the Kowalski verdict comes down. They talk about the judge’s decision to disallow testimony from the defense on medical child abuse, what happened with this jury, and the chances for a possible appeal for JHAC. With the medical community reeling from this news, Jonathan and Andrea unpack the dire consequences of the verdict and wonder — what now? *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-16T08:00:00Z",
      "duration": "00:34:24.2480000",
      "explicit": false,
      "spotifyId": "79Za2Z10cc2rCn0606NaVu",
      "appleId": 1000635013637,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/79Za2Z10cc2rCn0606NaVu",
        "apple": "https://podcasts.apple.com/podcast/the-verdict-part-2/id1615637188?i=1000635013637"
      }
    },
    {
      "id": "1039de64-97e0-43d9-bc55-813f483adcb7",
      "title": "The Verdict",
      "description": "Andrea and special guest Bex (aka our Florida pediatrcian friend) process the shocking verdict in the Maya Kowalski trial. After 9 weeks of testimony, the jury awarded the Kowalski family nearly $300 million in damages from Johns Hopkins All Children\u0027s Hospital. Bex shares her perspective as a pediatrician on how this verdict will impact the medical community and reporting of suspected child abuse cases. They discuss the implications for social workers and hospital staff who stood up and testified, and grapple with how the jury seemed to side with the emotional storytelling despite medical evidence. Andrea and Bex reflect on what this means for the U.S. justice system, mandatory reporting laws, and the public\u0027s willingness to accept that medical child abuse exists. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-10T00:00:00",
      "duration": "00:23:38.4750000",
      "explicit": false,
      "spotifyId": "7hU9KXkyicrrFCFlQcpFh5",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7hU9KXkyicrrFCFlQcpFh5"
      }
    },
    {
      "id": "250d2021-abc5-451d-9242-3e38469ec9be",
      "title": "Trial of the Century",
      "description": "With a verdict in the case days away, host Andrea Dunlop unpacks some of what’s happened so far in the Kowalski v Johns Hopkins All Childrens trial with lawyer and trial consultant Jonathan Leach. They analyze the dueling opening statements, consider what each side is likely to look for in jurors, and which of the charges—if any—might be most viable. Andrea shares insights on the lawyers after watching their interactions in court. She also weighs in on the extensive medical testimony so far, including a major revelation about the origins of Maya\u0027s controversial CRPS diagnosis. We also share a chilling account of Maya’s ketamine coma that was shared in court via missives written by Beata herself. As both sides begin their closing arguments Andrea weighs the merits of what each side has told the jury and considers what the ramifications of the imminent verdict might be. *** To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free, including weekly recaps of the Kowalski trial. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-07T08:00:00Z",
      "duration": "01:05:57.0020000",
      "explicit": false,
      "spotifyId": "63MKwRjiYmqTivJyeruQCV",
      "appleId": 1000633971144,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/63MKwRjiYmqTivJyeruQCV",
        "apple": "https://podcasts.apple.com/podcast/trial-of-the-century/id1615637188?i=1000633971144"
      }
    },
    {
      "id": "bf027420-448d-4624-86f1-12a10a94b48c",
      "title": "The Believers Part 2",
      "description": "As the Kowalski v Johns Hopkins All Childrens trial barrels forward, new information comes to light each day about what really happened to Maya Kowalski during her time in the hospital. In part 2 of The Believers, Andrea digs into the testimony from the doctors at the center of the case and finds medical professionals at odds. Did Maya really have CRPS or was something else going on? With trial watchers choosing sides and digging in: what does the evidence actually tell us? Andrea also talks more about her conversation with Laura Richards and her co-host Jim Clemente, following up on some of the leads they presented. NOTE: It came up in court on 11/1 in the rebuttal that Dr. Chopra did NOT attend Harvard Medical School, but rather an institution in India affiliated with HMS. He also clarified that he is a clinical assistant professor at Brown rather than a full professor. *** Read about Dr. Chopra’s beliefs about medical child abuse here: https://painri.com/epidemic-child-abuse-doctors-harming-children/ Crime Analyst: https://www.crime-analyst.com/ Real Crime Profile: https://www.realcrimeprofile.com/ Law \u0026 Crime Networks coverage of Kowalski v Johns Hopkins All Childrens: https://www.youtube.com/watch?v=FZTZxCMy8Oc To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free, including weekly recaps of the Kowalski trial. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-03T07:00:00Z",
      "duration": "00:55:33.8770000",
      "explicit": false,
      "spotifyId": "1VSOWDfpNcbnAqUFpUJHcN",
      "appleId": 1000633515169,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1VSOWDfpNcbnAqUFpUJHcN",
        "apple": "https://podcasts.apple.com/podcast/the-believers-part-2/id1615637188?i=1000633515169"
      }
    },
    {
      "id": "9814f81e-18fd-4918-aa82-fa9d3ae981a6",
      "title": "The Believers Part 1",
      "description": "In today’s episode, Andrea seeks an outside perspective on the controversial Maya Kowalski case. Laura Richards, host of Crime Analyst and cohost of the Real Crime Profile podcast, joins Andrea to talk through the complexities and contradictions of the Netflix documentary. The conversation reveals just how polarized interpretations of this case have become. With the verdict in the Kowalski v Johns Hopkins All Childrens looming, today we look at what’s been revealed by the both the vast amount of documentation on this case, as well as the trial unfolding before our eyes. *** Megan Phelps-Roper TED Talk: https://www.ted.com/talks/megan_phelps_roper_i_grew_up_in_the_westboro_baptist_church_here_s_why_i_left?language=en The Witch Trials of JK Rowling: https://podcasts.apple.com/us/podcast/the-witch-trials-of-j-k-rowling/id1671691064 Crime Analyst: https://www.crime-analyst.com/ Real Crime Profile: https://www.realcrimeprofile.com/ Law \u0026 Crime Networks coverage of Kowalski v Johns Hopkins All Childrens: https://www.youtube.com/watch?v=FZTZxCMy8Oc To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free, including weekly recaps of the Kowalski trial. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-11-02T00:00:00",
      "duration": "00:56:18.7550000",
      "explicit": false,
      "spotifyId": "3Nh9irlUV0N7FT0OI2DHka",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Nh9irlUV0N7FT0OI2DHka"
      }
    },
    {
      "id": "30819f6d-51b6-4dae-b3bf-c7b26145bd9e",
      "title": "Your Questions About Season 2",
      "description": "Host Andrea Dunlop and lead producer Tina Nole dive into listener feedback from season 2 of Nobody Should Believe Me. Addressing questions of gender issues and potential sexism around medical child abuse accusations, Andrea’s guest appearance on Real Crime Profile, pro-cop allegations and more. Plus, Andrea and Tina fill listeners in on what to expect for season 3 and beyond. *** To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free, including weekly recaps of the Kowalski trial. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-10-26T07:00:00Z",
      "duration": "00:21:36.7440000",
      "explicit": false,
      "spotifyId": "5BN3Z3PaQGitkQ6s0EJZHQ",
      "appleId": 1000632667559,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5BN3Z3PaQGitkQ6s0EJZHQ",
        "apple": "https://podcasts.apple.com/podcast/your-questions-about-season-2/id1615637188?i=1000632667559"
      }
    },
    {
      "id": "ef9442d0-4662-41a3-9f10-09d541f1c575",
      "title": "The Women",
      "description": "In the flattened version of the Maya Kowalski story that has dominated the headlines, Beata Kowalski is a mother who fell prey to age-old biases against women. This story attaches itself to the well-documented reality that women are all too often not believed when it comes to their own pain, the stories of their own lives, and their professional opinions. Beata is cast as the martyr in Netflix’s “Take Care of Maya” and two other women, Cathy Beady and Dr. Sally Smith, are cast as the villains. Today, we unpack the messy gender dynamics of this case. Cathy Beady is the social worker with a troubling past who’s been accused of grooming and assaulting Maya Kowalski. What do we know about what happened during Maya’s stay at Johns Hopkins All Childrens? Was Cathy Beady really hellbent on keeping Maya and Beata apart? Media coverage of the Maya Kowalski story has also done irreparable harm to the life and career of the respected doctor at the center of the controversy: child abuse pediatrician Sally Smith. She’s been accused of violating HIPPA in a single-minded crusade to create a case against Beata Kowalski. But is there evidence that Dr. Smith did anything other than her job? Did she drive Beata to death as the film suggests or is it possible her interventions saved Maya Kowalski’s life? As we break down the narratives and misinformation surrounding this case we get to the heart of the matter. The Kowalski legal team’s claims that Munchausen by proxy is based on “junk science” and that Beata Kowalski wasn’t guilty of medical child abuse because this form of abuse isn’t even real. *** To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free, including weekly recaps of the Kowalski trial. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-10-19T07:00:00Z",
      "duration": "00:35:48.4930000",
      "explicit": false,
      "spotifyId": "6dAkNoVSk2Z3V3RCtzgKls",
      "appleId": 1000631371991,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6dAkNoVSk2Z3V3RCtzgKls",
        "apple": "https://podcasts.apple.com/podcast/the-women/id1615637188?i=1000631371991"
      }
    },
    {
      "id": "0a1682d7-eaf7-4346-b898-495320f92617",
      "title": "Retaliation",
      "description": "Note: This episode contains sensitive content related to child abuse and suicide. Listener discretion is advised. Beata Kowalski’s tragic death by suicide in January of 2016 is at the center of the $220 million lawsuit Jack Kowalski has filed against Johns Hopkins All Childrens hospital. But did Beata really take her own life to free her daughter from the hospital keeping her captive as the plaintiff claims? As with everything in this story, the truth is much more complicated. The narrative told in the Netflix film “Take Care of Maya” is far from a complete picture of the harrowing series of events that led to Beata’s death. In this episode we go through the police reports of the incident and various testimonies of those who were present to fill in the gaps of the days and hours leading up to Beata’s death. We also examine the final court hearing Beata attended, which gives us a glimpse into where the case stood at the time of her death. *** To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free, including weekly recaps of the Kowalski trial. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-10-12T07:00:00Z",
      "duration": "00:47:37.2990000",
      "explicit": false,
      "spotifyId": "7e5X4cx4esir9EYe5nT6Po",
      "appleId": 1000630496027,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7e5X4cx4esir9EYe5nT6Po",
        "apple": "https://podcasts.apple.com/podcast/retaliation/id1615637188?i=1000630496027"
      }
    },
    {
      "id": "5ae43937-ae16-4b9c-b7d7-6c4c2ed27dee",
      "title": "In a Heartbeat",
      "description": "In our third episode, we look at a central piece of the story that was left unfinished at the time of Beata Kowalski’s death: the police investigation into her for medical child abuse. Along with Detective Mike Weber and our anonymous Florida pediatrician friend, we unpack shocking new details from the police investigation and from Jack Kowalski’s interview the Detective Stephanie Graham. Was Jack really just being pressured to throw his wife under the bus? Or did he have suspicions of his own about her? We also unpack some of the many discrepancies in Maya\u0027s medical history and the troubling behaviors of her mother Beata, showing that that this pattern of deceptive behavior went way beyond the question of whether her daughter’s diagnosis of CRPS was correct or not As the Kowalski v Johns Hopkins All Children’s trial unfolds in real time, we examine the facts of the case as they stood when Beata died and show how the prevailing media narrative about this case is getting it all wrong. *** To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free, including weekly recaps of the Kowalski trial. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-10-05T15:31:00Z",
      "duration": "00:45:20.2870000",
      "explicit": false,
      "spotifyId": "1gs5zVZC5OfojBfM9Y9TYs",
      "appleId": 1000629667763,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1gs5zVZC5OfojBfM9Y9TYs",
        "apple": "https://podcasts.apple.com/podcast/in-a-heartbeat/id1615637188?i=1000629667763"
      }
    },
    {
      "id": "667375af-7abe-4fb2-9023-6a7d36d861fa",
      "title": "Shelter",
      "description": "As the Maya Kowalski case heads to trial, we dig into the massive trove of documents about this case and begin to unpack what we know about what really happened during Maya Kowalski’s fateful stay at Johns Hopkins All Childrens in October 2016. The Netflix documentary about the case—and the prevailing media narrative---would have you believe that Maya was ripped from her parents by a corrupt system, and that this could happen to any parent of a sick child. But did Maya really have a deadly disease for which she required the massive amounts of ketamine and other drugs she was being given? Was the hospital unfairly biased against Beata Kowalski because she was difficult, or was something more sinister at play? We talk to national law enforcement expert on medical child abuse, Detective Mike Weber, as well as a Florida pediatrician who helps us unravel some of the myriad strange details about Maya’s medical history. The beginning of our multi-part deep dive into the case reveals the shocking events that led up to the family separation. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-09-28T07:00:00Z",
      "duration": "00:43:10.4060000",
      "explicit": false,
      "spotifyId": "4o6ZMiTd3OM8PVyUqPkfs3",
      "appleId": 1000628728271,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4o6ZMiTd3OM8PVyUqPkfs3",
        "apple": "https://podcasts.apple.com/podcast/shelter/id1615637188?i=1000628728271"
      }
    },
    {
      "id": "8415fbbe-51b2-4b0f-b398-71af84a875f8",
      "title": "Special Report: Watching Take Care of Maya (re-release)",
      "description": "Warning: This content includes references to suicide and child abuse. If you or someone you know is having thoughts of suicide, help is available. Call or text 988 to speak with a trained crisis counselor 24/7. You can also visit 988lifeline.org for additional resources and support. As the Jack Kowalski v. Johns Hopkins All Childrens trial gets underway today in Sarasota, FL, we revisit our conversation with top experts Bea Yorker, Dr. Mary Sanders, Detective Mike Weber, and survivor Jordyn Hope about “Take Care of Maya” the Netflix documentary about the Maya Kowalski case. Today we introduce our third season of Nobody Should Believe Me, where we will delve into the complex notion of “false accusations” of medical child abuse, getting into everything we’ve uncovered about the Maya Kowalski case and the broader conversations happening around the nation. Is there really an epidemic of over-diagnosis of medical child abuse, or are offenders slipping through the cracks? Andrea is a finalist for the Signal Awards! Best Host - Documentary Category: PLEASE VOTE HERE: https://vote.signalaward.com/PublicVoting#/2023/shows/craft/best-host-documentary For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-09-21T14:41:00Z",
      "duration": "00:48:43.8590000",
      "explicit": false,
      "spotifyId": "5nxcZsYIIEWrik7JBktLHv",
      "appleId": 1000628714610,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5nxcZsYIIEWrik7JBktLHv",
        "apple": "https://podcasts.apple.com/podcast/special-report-watching-take-care-of-maya-re-release/id1615637188?i=1000628714610"
      }
    },
    {
      "id": "511f4165-26f7-468a-a784-e8f39cc76f16",
      "title": "Exposing Medical Child Abuse (with Jordan Harbinger)",
      "description": "Today we’re sharing a special bonus episode from the Jordan Harbinger Show . Check out all things Jordan, including his helpful episode starter packs, on his website. We think NSBM listeners will be especially fascinated by his episodes on con artists and abnormal psychology. Our new season “Making Sense of Maya” drops NEXT WEEK! Andrea and Jordan discuss: · Munchausen syndrome by proxy (aka factitious disorder imposed on another): a form of medical child abuse where parents or caregivers fake or exaggerate their child’s health problems for personal gain. · How the widespread availability of medical information online, social media platforms, and crowdfunding has broadened the spectrum of people engaging in medical child abuse beyond professionals in the healthcare field. · What the long-term psychological toll looks like for children who survive such abuse and how they struggle to discern the truth as they grow older. · Why prosecution of medical child abuse cases is difficult when family courts may not thoroughly examine medical records and even accept a guilty parent or caregiver’s word as fact. · How we can keep an eye out for signs of medical child abuse, and who we should contact if we suspect the worst. · And much more… *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-09-15T20:49:00Z",
      "duration": "01:50:33.5340000",
      "explicit": false,
      "spotifyId": "7yqmZnIXLBgPQ6HNmxd9bM",
      "appleId": 1000628046494,
      "subjects": [
        "One-on-one",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7yqmZnIXLBgPQ6HNmxd9bM",
        "apple": "https://podcasts.apple.com/podcast/exposing-medical-child-abuse-with-jordan-harbinger/id1615637188?i=1000628046494"
      }
    },
    {
      "id": "5f64d4f8-79ef-4337-abfb-aa09fa34a505",
      "title": "Unabridged Conversation with Leah McGowan",
      "description": "In today\u0027s bonus episode, Andrea talks to family law attorney Leah McGowan about family and juvenile court and all of the many complications within those systems that create barriers for helping victims of medical child abuse. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-09-14T07:00:00Z",
      "duration": "00:44:43.2190000",
      "explicit": false,
      "spotifyId": "0mSuDKrr4X0J9x2HaPRjfr",
      "appleId": 1000627827797,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0mSuDKrr4X0J9x2HaPRjfr",
        "apple": "https://podcasts.apple.com/podcast/unabridged-conversation-with-leah-mcgowan/id1615637188?i=1000627827797"
      }
    },
    {
      "id": "5b1b9c44-d1d1-4639-a414-17d1623d78a6",
      "title": "Unabridged Conversation with Bea Yorker",
      "description": "In Andrea’s full conversation with law professor and nurse Bea Yorker, they discuss the complexities of medical child abuse, their work with survivors, and debunk some of the most common misconceptions about Munchausen by proxy/ medical child abuse. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-08-31T07:00:00Z",
      "duration": "01:04:32.7050000",
      "explicit": false,
      "spotifyId": "7k3m9JcnLGXD3il6pT9l5C",
      "appleId": 1000626294618,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7k3m9JcnLGXD3il6pT9l5C",
        "apple": "https://podcasts.apple.com/podcast/unabridged-conversation-with-bea-yorker/id1615637188?i=1000626294618"
      }
    },
    {
      "id": "1c9011e7-b311-4d3e-9f5a-be98989d9a69",
      "title": "Unabridged Conversation with Dr. Carole Jenny",
      "description": "In Andrea’s full conversation with renowned child abuse pediatrician, Dr. Carole Jenny they discuss Dr. Jenny’s fascinating history in the field, the intricacies of medical child abuse cases, and Dr. Jenny’s testimony and report in the state’s case against Andrea’s sister, Megan. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-08-24T07:00:00Z",
      "duration": "01:11:28.3650000",
      "explicit": false,
      "spotifyId": "0ie2sWukT6RiI3DfHZy4D8",
      "appleId": 1000625518883,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ie2sWukT6RiI3DfHZy4D8",
        "apple": "https://podcasts.apple.com/podcast/unabridged-conversation-with-dr-carole-jenny/id1615637188?i=1000625518883"
      }
    },
    {
      "id": "90c23cda-1901-460f-89b3-495ecd6524b9",
      "title": "Everything Everything Everything",
      "description": "In the finale of Season 2, we finally hear from the person at the center of our story: Alyssa Waybourn. Despite the immense challenges she has faced, Alyssa shines as a beacon of intelligence, strength, and resilience. Her story is a testament to the capacity of the human spirit to overcome even the darkest of circumstances. During a visit to Fort Worth, we meet Alyssa: a smart, happy, athletic teenager who is starting her new after-school job later that day. Alyssa has found solace and normalcy after enduring so much at such a young age. Her determination to move forward and create a brighter future is truly inspiring. Alyssa shares her memories of the abuse she endured, the experience of testifying against her biological mother, and the profound impact it had on her life. Despite the pain, she remains steadfast in her commitment to fight for those who are voiceless, even testifying before the Texas State Legislature in support of a bill that bears her name. Alyssa opens up about her hopes and dreams for the future, revealing the strength and resilience she has found in her family. We also get an update on Brittany as Andrea shares some final thoughts for the season. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-08-17T07:00:00Z",
      "duration": "00:37:32.2250000",
      "explicit": false,
      "spotifyId": "3lpjrh0bI3p3iURLDZv7Jc",
      "appleId": 1000624809979,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3lpjrh0bI3p3iURLDZv7Jc",
        "apple": "https://podcasts.apple.com/podcast/everything-everything-everything/id1615637188?i=1000624809979"
      }
    },
    {
      "id": "76e3e564-0cc7-4413-b757-6f69825476d3",
      "title": "Pandora’s Box",
      "description": "In this gripping episode, we delve into the heart-wrenching account of Jordyn Hope, another survivor of medical child abuse. Taking a brief departure from Alyssa\u0027s story, we shine a spotlight on a far more common outcome for MBP survivors in which they are never successfully protected from their abuser. From a young age, Jordyn was led to believe they were a chronically ill child by their mother. Life-threatening asthma, organ removal attempts, and countless hospital visits became their horrific norm. But everything changed in 2018 when Jordyn stumbled upon the concept of Munchausen by Proxy during a community college class. Suddenly, the veil of deception was lifted, and the true extent of their mother\u0027s abusive behavior came into sharp focus. As we explore Jordyn\u0027s journey, we uncover the painful aftermath of confronting their mother\u0027s manipulation and the ongoing trauma they continue to navigate. Jordyn illuminates how the deep bond between victims and their parents often shapes their very perception of reality, leading to a harrowing and profoundly destabilizing road to recovery. Tragically, Jordyn\u0027s story exemplifies the most likely outcome of a medical child abuse case: one in which a perpetrator is never brought to justice despite the concerns and reports of numerous family members and medical professionals. Jordyn shines a light on the terrifying reality of Munchausen by Proxy and shows us a way forward for survivors both in their lived example and their own work to help others. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-08-10T07:00:00Z",
      "duration": "00:43:55.8330000",
      "explicit": false,
      "spotifyId": "2M0rF6eMgM8QjantC7Pl3r",
      "appleId": 1000620805902,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2M0rF6eMgM8QjantC7Pl3r",
        "apple": "https://podcasts.apple.com/podcast/pandoras-box/id1615637188?i=1000620805902"
      }
    },
    {
      "id": "a48a901b-f9e5-4fb3-b858-a7bebf3a89d7",
      "title": "Only the Beginning",
      "description": "We return to Alyssa\u0027s story - In the aftermath of Brittany Philips\u0027 conviction, Alyssa faces a daunting new reality: the path to recovery. The long-term physical and psychological effects of Munchausen by Proxy abuse cast a long shadow for survivors, and bringing Brittany to justice is just the beginning of the healing process. In this episode, we delve into Alyssa\u0027s journey and witness her remarkable growth as she embraces her new life. Bravely refusing to let her past define her, Alyssa emerges as an inspiring overcomer, as aptly described by her adopted mother, Laura Waybourn. As a family, the Waybourns navigate the challenges with unwavering determination and resilience. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea’s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-08-03T15:37:00Z",
      "duration": "00:23:43.1770000",
      "explicit": false,
      "spotifyId": "4BUPzd2XIlD3UG9i1x0Kn2",
      "appleId": 1000620805309,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4BUPzd2XIlD3UG9i1x0Kn2",
        "apple": "https://podcasts.apple.com/podcast/only-the-beginning/id1615637188?i=1000620805309"
      }
    },
    {
      "id": "94b2d138-04d5-47ed-891d-a34e2135bba5",
      "title": "Megan",
      "description": "In the wake of obtaining shocking public records about her sister’s case, host Andrea Dunlop decides to divulge the details of the second investigation into her sister, Megan Carter. Seated alongside Detective Mike Webber, Andrea delves into the extensive documentation, and together the two unpack the devastating information about what reportedly happened to her niece. Despite video evidence, a successful separation test, and expert testimony from one of the most well-respected experts in the country, the juvenile court judge who reviewed the case returned custody of Megan’s two children. Andrea remains deeply concerned that her niece and nephew are victims of a flawed system incapable of addressing the horrifying reality of medical child abuse and makes public the evidence against her sister as a last resort to protect them. During their discussion, Andrea and Mike also examine an irresponsible and misleading article about Megan’s case published by NBC in collaboration with King 5, a local Seattle news outlet. In what has become a distressing pattern in media coverage of medical child abuse cases, this article attacks the doctor who reported the abuse and neglects to mention the evidence that made her do so. Meanwhile the judge’s order that returned custody of the two children—and on which the media’s reporting appears to have relied—contains shocking mistakes and untruths. Andrea talks to someone close to the case to set the record straight. The reporting in this episode is based on information in the public record. We have collected the relevant documents at the link below: https://drive.google.com/drive/folders/1AGfJiX-nZ39knECXhafzZ_TOItMmjXoD?usp=drive_link *** Buy Andrea\u0027s books here. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-07-27T07:00:00Z",
      "duration": "00:52:26.8400000",
      "explicit": false,
      "spotifyId": "4RJTL5d8d4AKL6YVxOVad3",
      "appleId": 1000621818389,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4RJTL5d8d4AKL6YVxOVad3",
        "apple": "https://podcasts.apple.com/podcast/megan/id1615637188?i=1000621818389"
      }
    },
    {
      "id": "48790048-ca15-42b4-a378-ad65c96f3967",
      "title": "The Trial",
      "description": "Despite the undeniable evidence against Brittany, the verdict takes a shocking turn. Dawn Ferguson, the prosecutor on the case elucidates the challenges of convincing a jury that a mother could engage in such abuse against her own child. After six months of review and preparation, the legal team enters the courtroom armed with reams of eyewitness accounts and, most damningly, Brittany’s grisly search history. Detective Mike Webber walks us through the complications of the trial and unpacks why the judicial system is not equipped to handle this form of abuse. Throughout the trial, the Waybourns strive to protect Alyssa but ultimately, the now seven-year-old girl has to take the stand to testify against her mother. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, subscribe on Apple Podcast s or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-07-20T00:00:00",
      "duration": "00:26:21.0350000",
      "explicit": false,
      "spotifyId": "7bh8wopQi60rCHqn7kqWI2",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7bh8wopQi60rCHqn7kqWI2"
      }
    },
    {
      "id": "999eddfe-9087-4504-b692-d2207eca313b",
      "title": "NSBM Special Report: Watching Take Care of Maya",
      "description": "We gather top experts Bea Yorker, Dr. Mary Sanders, Detective Mike Weber, and MBP survivor Jordyn Hope to discuss the Netflix documentary “Take Care of Maya” and the complicated case it covers. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, subscribe on Apple Podcasts or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The full APSAC guidelines for professionals can be accessed here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-07-17T16:33:00Z",
      "duration": "00:47:50.6220000",
      "explicit": false,
      "spotifyId": "4EWs6uaABy8GOxyYcXleGH",
      "appleId": 1000621416402,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4EWs6uaABy8GOxyYcXleGH",
        "apple": "https://podcasts.apple.com/podcast/nsbm-special-report-watching-take-care-of-maya/id1615637188?i=1000621416402"
      }
    },
    {
      "id": "184c0a22-d106-4fc1-b97d-fadbd00f0f46",
      "title": "Tangled",
      "description": "The Waybourns face the daunting task of safeguarding Alyssa against Brittany\u0027s relentless attempts to pull her back into her web. We hear more about Alyssa’s turbulent journey to become a Waybourn, as the family fights through a system that doesn’t know how to deal with medical child abuse. Beatrice Yorker, a child and adolescent psychiatric nurse, law professor and MBP expert, reveals the disturbing extent to which this crime is overlooked in our society. We also speak to a family law attorney who helps illuminate the complexities of these cases. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, subscribe on Apple Podcasts or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-07-13T07:00:00Z",
      "duration": "00:23:41.9750000",
      "explicit": false,
      "spotifyId": "2R3dQQR7Oe3D1iC4VCknEb",
      "appleId": 1000618527317,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2R3dQQR7Oe3D1iC4VCknEb",
        "apple": "https://podcasts.apple.com/podcast/tangled/id1615637188?i=1000618527317"
      }
    },
    {
      "id": "e9161697-428e-41af-80d6-5708f264fb0e",
      "title": "All In",
      "description": "In this season of Nobody Should Believe Me, we\u0027ve heard from Sheriff Bill and Laura Waybourn about their concern for Alyssa- who was a distant family member of theirs. Now, we take some time to get to know this incredible couple who’ve changed the lives of so many children. Laura, a former CPS worker and devoted mama bear and Bill a seasoned law enforcement veteran with a heart of gold, have opened their hearts and home to numerous children in need: eventually adopting nine kids. These tireless advocates for children will go on to spearhead the efforts to make all children in Texas safe from medical child abuse. *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, listen on Apple Plus or go to Patreon.com/NobodyShouldBelieveMe where you can listen to exclusive bonus content and access all episodes early and ad-free. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com *** Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! *** Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-07-06T07:00:00Z",
      "duration": "00:25:01.5960000",
      "explicit": false,
      "spotifyId": "42kCPl0uwQF0g4PiUVFLCc",
      "appleId": 1000617899478,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/42kCPl0uwQF0g4PiUVFLCc",
        "apple": "https://podcasts.apple.com/podcast/all-in/id1615637188?i=1000617899478"
      }
    },
    {
      "id": "62b12ba4-893c-491c-a9d7-b27044270b60",
      "title": "Where There’s Smoke",
      "description": "Detective Mike Weber dives into the digital rabbit hole of Brittany’s online activity and makes a discovery so shocking it turns his investigation on its head and reveals the depths of depravity offenders are capable of. Meanwhile, the fight to protect Alyssa ramps up and we meet Sheriff Bill Waybourn—a towering Texan lawman with a huge heart and an iconic mustache. He and his wife Laura will become a beacon of hope in Alyssa’s life as she changes the course of their family forever. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-06-29T07:00:00Z",
      "duration": "00:27:42.5630000",
      "explicit": false,
      "spotifyId": "45YvT6KZfNgJNL89Zu2skp",
      "appleId": 1000617076360,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/45YvT6KZfNgJNL89Zu2skp",
        "apple": "https://podcasts.apple.com/podcast/where-theres-smoke/id1615637188?i=1000617076360"
      }
    },
    {
      "id": "d2e59764-0c47-4ffe-974c-c596109212d1",
      "title": "What do we do about Brittany?",
      "description": "Heather Harris was one of many friends who was concerned about Brittany’s desperate need for attention for her daughter’s medical issues, and her inconsistent reports about Alyssa’s eating issues. In this episode we peel back the inner workings of Child Protective Services in the state of Texas, and uncover a deeply flawed system that despite many social workers’ best effort, leaves victims of medical child abuse in harm’s way. After a shocking incident pushed Heather to report Brittany to CPS, she was dismayed when no one intervened. Little did she know her report was one of many made to the agency. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com *** Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! *** Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-06-22T07:00:00Z",
      "duration": "00:30:27.3690000",
      "explicit": false,
      "spotifyId": "4YMm0pWCULmQTCKyTbrahS",
      "appleId": 1000617074841,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4YMm0pWCULmQTCKyTbrahS",
        "apple": "https://podcasts.apple.com/podcast/what-do-we-do-about-brittany/id1615637188?i=1000617074841"
      }
    },
    {
      "id": "9f50aedd-6f2b-47da-bbac-f68d883baef6",
      "title": "Blunt Force Instrument",
      "description": "Everyone in Brittany Philips’ life was worried about her daughter, Alyssa. Brittany was always talking about her child’s health issues, and complaining that she couldn’t keep food down—but it didn’t add up with what people were seeing. Still, no one quite knew how to intervene. It didn’t help that Brittany was a bulldozer, bullying anyone who disagreed with her and always causing maximum drama. Season 2 delves deep into a chilling case that exposes the shocking realities of Munchausen by Proxy and how it can show up. Unlike the charismatic manipulator in Season 1, Hope Ybarra, Brittany didn\u0027t need charm; she used force to get what she wanted. She wasn’t fooling anyone, but it still felt like no one could stop her. *** Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com Download the APSAC\u0027s practice guidelines here . *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! *** Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. *** Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-06-15T07:00:00Z",
      "duration": "00:33:39.1600000",
      "explicit": false,
      "spotifyId": "0RiW607GzohxR9S75P1E13",
      "appleId": 1000617039318,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0RiW607GzohxR9S75P1E13",
        "apple": "https://podcasts.apple.com/podcast/blunt-force-instrument/id1615637188?i=1000617039318"
      }
    },
    {
      "id": "b9524097-ea25-424f-810a-68381e7d12fd",
      "title": "Alyssa\u0027s Story",
      "description": "In Season 2, we head back to Tarrant County, Texas to explore the case of Brittany Phillips, a mother who medically abused her child in plain sight. For years, Brittany lied about her daughter Alyssa’s medical history and symptoms and subjected her to unnecessary medical procedures. Family members, healthcare providers, and even Child Protective Services knew something was wrong, but no one could figure out how to stop her. Detective Mike Weber, the lead investigator who helped put Hope Ybarra behind bars, is on the case once again; and we hear from more top experts in the field, family members, and survivors to help us understand the complexities of this abuse. Andrea will also reveal much more about her own family situation, unpacking the case against her sister that she touched on in Season 1. To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Note: This episode contains sensitive content related to child abuse. Listener discretion is advised. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-06-08T14:00:00Z",
      "duration": "00:01:21.1360000",
      "explicit": true,
      "spotifyId": "3xMzhw4SKVnbJzUZwI02G3",
      "appleId": 1000616153593,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3xMzhw4SKVnbJzUZwI02G3",
        "apple": "https://podcasts.apple.com/podcast/alyssas-story/id1615637188?i=1000616153593"
      }
    },
    {
      "id": "799e6210-63c8-402a-8a23-8072f147de69",
      "title": "Bonus: Questions Answered",
      "description": "In this bonus episode my producer Tina Nole from Larj Media and I respond to some of the questions that came up about Season 1, break down a few myths about Munchausen Syndrom By Proxy (Medical Child Abuse) and we’ll preview what’s coming up June 15th when we release Season 2 of the show. To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-06-01T20:10:00Z",
      "duration": "00:27:21.6910000",
      "explicit": false,
      "spotifyId": "1zX2qOOWSbcju4pLoQwnHY",
      "appleId": 1000615338067,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zX2qOOWSbcju4pLoQwnHY",
        "apple": "https://podcasts.apple.com/podcast/bonus-questions-answered/id1615637188?i=1000615338067"
      }
    },
    {
      "id": "aeb68969-e09b-49ab-b6b1-0bf59eb257ab",
      "title": "Bonus: Unabridged conversation with Dr. Mary Sanders",
      "description": "Listen to Andrea’s full conversation with Dr. Mary Sanders, director of child \u0026 adolescent psychology at Stanford and nationally recognized expert on Munchausen by Proxy. We discuss the possibilities of treatment for perpetrators as well as the effect this abuse has on victims and how they can heal. The American Professional Society on the Abuse of Children: https://www.apsac.org/ Munchausen Support: munchausensupport.com *** Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-05-18T07:00:00Z",
      "duration": "00:48:30.9280000",
      "explicit": false,
      "spotifyId": "4fjbCz0PGBPQ4Qj0yC66ab",
      "appleId": 1000613487173,
      "subjects": [
        "One-on-one",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fjbCz0PGBPQ4Qj0yC66ab",
        "apple": "https://podcasts.apple.com/podcast/bonus-unabridged-conversation-with-dr-mary-sanders/id1615637188?i=1000613487173"
      }
    },
    {
      "id": "46ccb671-17e6-4504-bc90-ed277bee667a",
      "title": "Bonus: Unabridged conversation with Dr. Jayme Coffman",
      "description": "Listen to Andrea’s full conversation with Dr. Jayme Coffman, the child abuse pediatrician who runs the CARE team at Cook Children’s Hospital in Tarrant County where much of our stories takes place. She shares with us the behind-the-scenes process of determining abuse, what it’s like for doctors to get caught up in one of these cases, and why this abuse is so misunderstood. Cook Children’s: https://www.cookchildrens.org/ Munchausen Support: munchausensupport.com Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-05-04T07:00:00Z",
      "duration": "01:00:51.2390000",
      "explicit": false,
      "spotifyId": "3CqsyEC2chwg9EyhGMLsV4",
      "appleId": 1000611697441,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3CqsyEC2chwg9EyhGMLsV4",
        "apple": "https://podcasts.apple.com/podcast/bonus-unabridged-conversation-with-dr-jayme-coffman/id1615637188?i=1000611697441"
      }
    },
    {
      "id": "993ce66b-028b-4569-8de5-2cf3ee6d3038",
      "title": "Bonus: Unabridged Conversation with Dr. Marc Feldman",
      "description": "In today\u0027s bonus episode, we share Andrea\u0027s unabridged conversation with Dr. Marc Feldman, one of the experts we heard from throughout season one of the show. Dr. Marc Feldman is a Clinical Professor of Psychiatry at the University of Alabama,Tuscaloosa and an internationally renowned expert on Munchausen by Proxy. He is the author of five books, more than one hundred peer-reviewed articles, and has appeared as an expert in dozens of television programs, print media, and documentaries throughout the world. Dr. Feldman is a longtime member of the APSAC’s MBP committee and originally nominated Andrea as a member. More about Dr. Feldman: https://www.munchausen.com/ Munchausen by Proxy is a serious and widely-misunderstood form of child abuse. It can result in a wide swath of destruction and trauma for everyone involved and lifelong devastation for survivors. Munchausen Support was created in collaboration with some of the world’s top experts and provides science- and fact-based information about Munchausen by Proxy. It is also intended to offer resources and support for professionals in the midst of a case, family members in crisis, and survivors seeking treatment. https://www.munchausensupport.com *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2023-04-20T07:00:00Z",
      "duration": "01:01:58.6870000",
      "explicit": true,
      "spotifyId": "09uCRLLXdYB6B8BQtKEXft",
      "appleId": 1000609770019,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/09uCRLLXdYB6B8BQtKEXft",
        "apple": "https://podcasts.apple.com/podcast/bonus-unabridged-conversation-with-dr-marc-feldman/id1615637188?i=1000609770019"
      }
    },
    {
      "id": "88eb7e87-0d4d-4a80-bfc1-5d71b4b6a64b",
      "title": "Bonus: The Making Of",
      "description": "Andrea and her Producer Tina at Larj Media talk about how the show came to be, the journey towards finding and talking with Hope Ybarra and what you can look forward to for season 2 of the show. *** Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-12-20T19:48:00Z",
      "duration": "00:37:19.8430000",
      "explicit": true,
      "spotifyId": "4E9827Z8Q9GygxxnpcqMhT",
      "appleId": 1000590784297,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4E9827Z8Q9GygxxnpcqMhT",
        "apple": "https://podcasts.apple.com/podcast/bonus-the-making-of/id1615637188?i=1000590784297"
      }
    },
    {
      "id": "00782c6c-e164-419c-84dc-5dd4a947a135",
      "title": "There\u0027s Hope  (S1E8 - Season 1 Finale)",
      "description": "Andrea has made an intense connection with Hope Ybarra\u0027s family, and asked experts, doctors, and the detective so many of her burning questions about Munchausen by Proxy. But she\u0027s become increasingly fixated on talking to Hope herself as she comes to realize that it may be her only chance to get the insights she needs. In this stunning season one finale, Andrea travels to Mountain Home, Idaho, to meet with Hope Ybarra. In this intense, emotional back-and-forth, we hear straight from Hope what life is like for her after being released from prison. We find out what she\u0027s up to and what she hopes for from the future. Hope listens to her own family—all of whom she\u0027s estranged from with the exception of Robin—talk about what she was like before everything fell apart. She insists that she still loves her children, despite what she did. We see the human being behind the monstrous acts that splashed Hope\u0027s story across headlines and landed her in prison for a decade. Andrea asks Hope what might have been done to help her and what she might say to her younger self if she could go back. Finally, she tells Hope that if she really wants her family back, she should get treatment and offers to help her if she wants that. Hope is friendly and warm in person, but Andrea is left with the unsettling truth that she hasn\u0027t changed. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-23T09:30:00Z",
      "duration": "00:36:43.7940000",
      "explicit": true,
      "spotifyId": "1XtW6aDJIgsDVJoUToyTa1",
      "appleId": 1000587237239,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1XtW6aDJIgsDVJoUToyTa1",
        "apple": "https://podcasts.apple.com/podcast/theres-hope-season-1-finale/id1615637188?i=1000587237239"
      }
    },
    {
      "id": "5b2e8a27-49cb-4167-80a3-8b6f28eb00d6",
      "title": "Can They Be Saved?  (S1E7)",
      "description": "Andrea delves deep into her questions around the psychopathology of Munchausen by Proxy perpetrators. Floored by the similarities in the many cases she’s researched, she talks to two of the world\u0027s foremost experts on the disorder—Dr. Marc Feldman and Dr. Mary Sanders—about the characteristics, warning signs, and causes of the disorder that has upended the lives of so many people Andrea has spoken to throughout the course of the podcast. Why would a mother ever do this? What do they get from it? And most importantly, what could be done to stop them? Is it possible for someone who does these things to get treatment? * * * Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-17T11:31:00Z",
      "duration": "00:35:55.8590000",
      "explicit": true,
      "spotifyId": "3Ndt5bvTg3zWLKabMlllB7",
      "appleId": 1000586560545,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Ndt5bvTg3zWLKabMlllB7",
        "apple": "https://podcasts.apple.com/podcast/can-they-be-saved/id1615637188?i=1000586560545"
      }
    },
    {
      "id": "5b576dd7-e682-4581-9237-d9af2b769856",
      "title": "Revisiting Season One: Sisters Surviving",
      "description": "During this look back at the 6th episode of our first season, we hear the story of twin sisters who survived Munchausen by Proxy at the hands of their foster mother. At the end of the episode, we get a visit from very special guest, Erica Blake (then Handt), one of the sisters we interviewed almost 3 years ago. Andrea reconnects with her to chat about life since that interview. *** As Andrea contemplates what the future looks like for survivors of Munchausen by Proxy, she gets an unexpected message from two young women who’ve lived it. After appearing with Marc Feldman on a podcast, Andrea hears from twin-sisters who survived MBP. Liz and Erica Handt were taken from one terrifying situation to another when the foster mom who adopted them turns out to be abusive, telling the girls they had Fetal Alcohol Syndrome and dragging them from specialist to specialist. The twins\u0027 story is harrowing but ultimately hopeful as they\u0027re now thriving. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andredunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-10T13:09:00Z",
      "duration": "01:14:16.9070000",
      "explicit": false,
      "spotifyId": "1g3W9KbTzWJpxrhSB4gQyK",
      "appleId": 1000585763737,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1g3W9KbTzWJpxrhSB4gQyK",
        "apple": "https://podcasts.apple.com/podcast/sisters-surviving/id1615637188?i=1000585763737"
      }
    },
    {
      "id": "fdf06514-615c-476f-beba-154d5744728b",
      "title": "Sisters Surviving  (S1E6)",
      "description": "As Andrea contemplates what the future looks like for survivors of Munchausen by Proxy, she gets an unexpected message from two young women who’ve lived it. After appearing with Marc Feldman on a podcast, Andrea hears from twin-sisters who survived MBP. Liz and Erica Handt were taken from one terrifying situation to another when the foster mom who adopted them turns out to be abusive, telling the girls they had Fetal Alcohol Syndrome and dragging them from specialist to specialist. The twins\u0027 story is harrowing but ultimately hopeful as they\u0027re now thriving. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . For more about the Handt twins: https://lotusesinbloom.com/ Erica’s Instagram: Erica Blake (Handt) (@erica_a_blake) • Instagram photos and videos Liz’s Instagram: Liz | Mental Health \u0026#43; Healing (@lizhandt) • Instagram photos and videos *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-10T00:00:00",
      "duration": "00:32:31.6860000",
      "explicit": true,
      "spotifyId": "51KtK1lkwaAw2yQUWtJuY2",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/51KtK1lkwaAw2yQUWtJuY2"
      }
    },
    {
      "id": "51a56d17-1ea0-4cb2-bb50-13413e2e5c65",
      "title": "Bonus Episode: Meet Doug Welch",
      "description": "Right before his story was released in episode five of NOBODY SHOULD BELIEVE ME, the father we referred to as “John” changed his mind about wanting to share his story anonymously after he learned a terrifying piece of news about his son. Now, Doug Welch shares the events that led up to his decision, where things stand in his family now, and what he wants his kids to know. Coverage of the case against Mary Welch https://www.kare11.com/article/news/investigations/mother-at-center-of-investigation-is-indicted/89-105671356 Detective Mike Weber’s arrest warrant for Mary Welch https://bit.ly/ArrestWarrent *** Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-08T18:27:00Z",
      "duration": "00:37:26.7910000",
      "explicit": true,
      "spotifyId": "1q698VV7FzKslTVyQPAp0k",
      "appleId": 1000585540883,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1q698VV7FzKslTVyQPAp0k",
        "apple": "https://podcasts.apple.com/podcast/bonus-episode-meet-doug-welch/id1615637188?i=1000585540883"
      }
    },
    {
      "id": "626198c3-3ea6-4fdb-aa82-7e0450e73df3",
      "title": "Nobody Would Believe Me: Dads Part 2  (S1E5)",
      "description": "As we learn from Detective Mike Weber, the father in a Munchausen by Proxy case can be the most important ally--or the biggest obstacle--in protecting child victims from abuse. In part two of Andrea’s examination of the father’s role in MBP cases, Andrea speaks to “John”, a father devastated but the revelation that his ex-wife had subjected their son to unnecessary brain surgery. We also talk to Ryan Crawford, a man who found himself fighting for his son’s life against a disbelieving system. Plus we get a stunning real-time update on one of our cases as “John” decides to come forward with his true identity. *** Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . More about Ryan Crawford’s story: https://www.dmagazine.com/publications/d-magazine/2019/august/the-boy-who-stayed-sick/ https://mikeweberconsulting.com/ *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-03T10:30:00Z",
      "duration": "00:48:56.2670000",
      "explicit": true,
      "spotifyId": "4uszuJ1LF5p3TUTzIB2th0",
      "appleId": 1000584918654,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4uszuJ1LF5p3TUTzIB2th0",
        "apple": "https://podcasts.apple.com/podcast/nobody-would-believe-me-dads-part-2/id1615637188?i=1000584918654"
      }
    },
    {
      "id": "858371a1-5510-44e6-913b-804185a2db6a",
      "title": "Nobody Would Believe Me: Dads Part 1  (S1E4)",
      "description": "As we learn from Detective Mike Weber, the father in a Munchausen by Proxy case can be the most important ally--or the biggest obstacle--in protecting child victims from abuse. We learn more about how Andrea’s own family became divided during the first investigation into her sister and we meet George Hunnicut, a veteran who discovered his young wife was abusing their infant son and found himself up against a system that had no idea what to do for him. Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . For more about Mike Weber, visit https://mikeweberconsulting.com/ More about George Hunnicut’s story: https://media.star-telegram.com/Munchausenmoms/ More about Ryan Crawford’s story: https://www.dmagazine.com/publications/d-magazine/2019/august/the-boy-who-stayed-sick/ *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-27T07:00:00Z",
      "duration": "00:40:08.0190000",
      "explicit": true,
      "spotifyId": "0XpMOG0WEBZdNgRmkysOpO",
      "appleId": 1000584057893,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0XpMOG0WEBZdNgRmkysOpO",
        "apple": "https://podcasts.apple.com/podcast/nobody-would-believe-me-dads-part-1/id1615637188?i=1000584057893"
      }
    },
    {
      "id": "0acc6d46-fa9e-4b51-b0a1-459a70d13b14",
      "title": "What’s in the Water in Tarrant County?  (S1E3)",
      "description": "Andrea speaks to Deanna Boyd, the crime reporter who broke the Hope Ybarra case and discovers that Hope\u0027s was one of many Munchausen By Proxy cases in Tarrant County that Deanna unearthed; all of which had flown under the radar. What\u0027s going on here? Why are there so many cases in this one area? As Andrea interviews Deanna and meets with Detective Mike Weber, as well as Dr. Jayme Coffman and Dr. Karen Shultz--two doctors involved with the Ybarra and many other MBP cases--she makes a chilling discovery. It\u0027s not that there are so many cases in Tarrant County, it\u0027s just that they\u0027re catching them. If the systems meant to protect children were functioning, every county would look like Tarrant. Andrea can only guess as to what truly went on behind the scenes in her own family\u0027s case, but she begins to grasp what the systems involved--CPS, the police, the doctors--are up against and why so many cases are destined to fail. Meanwhile, Andrea continues her maddening back-and-forth with Hope. *** Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . For more about Mike Weber, visit https://mikeweberconsulting.com/ Read Deanna Boyd’s original reporting: https://media.star-telegram.com/Munchausenmoms/ *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-20T07:00:00Z",
      "duration": "00:40:50.4680000",
      "explicit": true,
      "spotifyId": "2TAvCOy5XyKwZmf9DPzwc0",
      "appleId": 1000583269089,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2TAvCOy5XyKwZmf9DPzwc0",
        "apple": "https://podcasts.apple.com/podcast/whats-in-the-water-in-tarrant-county/id1615637188?i=1000583269089"
      }
    },
    {
      "id": "d142934c-ad16-4588-8a23-e631d788493c",
      "title": "Revisiting Season One: Who is Hope?",
      "description": "We take a look back at the second episode of the show. Stay tuned to hear Andrea share the story of how the show almost didn\u0027t air and what she learned from it. To learn more details about Andrea\u0027s sister\u0027s case, check out \u0022Megan\u0022. *** We delve deeper into the story of Hope Ybarra, a young mother whose family discovers she’s been faking her eight-year-long battle with terminal cancer and begins to suspect her own health isn’t all she’s lying about. We talk more to Hope’s family and her ex-husband Fabian Ybarra about their efforts to unravel Hope’s many sinister deceptions. We meet Detective Mike Weber, who was responsible for investigating Hope Ybarra, an early foray into what would become the main focus of his career: Munchausen by Proxy. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-13T07:00:00Z",
      "duration": "00:45:53.3840000",
      "explicit": false,
      "spotifyId": "1k2ocb0obCNuxMmVmmxc6g",
      "appleId": 1000582501645,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1k2ocb0obCNuxMmVmmxc6g",
        "apple": "https://podcasts.apple.com/podcast/who-is-hope/id1615637188?i=1000582501645"
      }
    },
    {
      "id": "5f56d66f-9261-426f-9a4d-7d5ab5511d9e",
      "title": "Who is Hope?  (S1E2)",
      "description": "We delve deeper into the story of Hope Ybarra, a young mother whose family discovers she’s been faking her eight-year-long battle with terminal cancer and begins to suspect her own health isn’t all she’s lying about. We talk more to Hope’s family and her ex-husband Fabian Ybarra about their efforts to unravel Hope’s many sinister deceptions. We meet Detective Mike Weber, who was responsible for investigating Hope Ybarra, an early foray into what would become the main focus of his career: Munchausen by Proxy. * * * Follow Andrea on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to Patreon.com/NobodyShouldBelieveMe or subscribe on Apple Podcasts where you can get all episodes early and ad-free and access exclusive bonus content. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com * * * Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-13T00:00:00",
      "duration": "00:34:24.4040000",
      "explicit": true,
      "spotifyId": "2hDdRDzfy2QevZ1b29MAlN",
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2hDdRDzfy2QevZ1b29MAlN"
      }
    },
    {
      "id": "9b6b8633-217f-468e-9bcd-18760a9f6b80",
      "title": "Sisters: Introduction  (S1E1)",
      "description": "We meet accomplished novelist and loving mother Andrea Dunlop as she embarks on a journey to understand the series of events that tore her family apart. We learn that her older sister has been investigated twice for Munchausen by Proxy abuse, which inspired Andrea to learn everything she could about this complex and misunderstood issue. We see Andrea become captivated by the story of Hope Ybarra and go along with her to meet Hope’s father, sister, and brother: the first people Andrea has ever spoken to who’ve actually lived through a case. But can anything prepare Andrea for the truth? * * * Follow host Andrea Dunlop on Instagram for behind-the-scenes photos: @andreadunlop Buy Andrea\u0027s books here . To support the show, go to https://apple.co/nobodyshouldbelieveme to listen on Apple Podcasts and just click ‘Subscribe’ on the top of the show page to listen to exclusive bonus content and access all episodes early and ad-free or go to Patreon.com/NobodyShouldBelieveMe. For more information and resources on Munchausen by Proxy, please visit MunchausenSupport.com The American Professional Society on the Abuse of Children’s MBP Practice Guidelines can be downloaded here . To learn more about Dr. Marc Feldman, visit Munchausen.com *** Click here to view our sponsors. Remember that using our codes helps advertisers know you’re listening and helps us keep making the show! Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-12T07:00:00Z",
      "duration": "00:28:55.3660000",
      "explicit": true,
      "spotifyId": "4PtzvLmoYcxgNuEQFMn2b3",
      "appleId": 1000582501783,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4PtzvLmoYcxgNuEQFMn2b3",
        "apple": "https://podcasts.apple.com/podcast/sisters-introduction/id1615637188?i=1000582501783"
      }
    },
    {
      "id": "5fb52b26-0fe1-4938-bc56-ecafb14c0175",
      "title": "Nobody Should Believe Me - Season 1 Trailer",
      "description": "Novelist Andrea Dunlop is looking for answers. When her older sister was first investigated for Munchausen by Proxy abuse more than a decade ago, it tore her family apart. This catastrophic series of events sent Dunlop on a journey to understand this most taboo form of abuse. In this groundbreaking podcast, she talks to some of the top experts in the world to explore the criminology and psychopathology behind Munchausen by Proxy and to reveal the wide swath of destruction these perpetrators leave in their wake. Along the way, she becomes captivated by the case of Hope Ybarra: Dunlop speaks to those most familiar with the case, from the reporter who broke the story, to the detective who investigated it, to the family who lived through it. In the dramatic finale, she’ll speak to Hope Ybarra herself.​ Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-09-29T21:49:00Z",
      "duration": "00:01:49.3740000",
      "explicit": true,
      "spotifyId": "0D2ZkAlfnSiDSS7tacGCUY",
      "appleId": 1000581083989,
      "subjects": [
        "One-on-one"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0D2ZkAlfnSiDSS7tacGCUY",
        "apple": "https://podcasts.apple.com/podcast/nobody-should-believe-me-season-1-trailer/id1615637188?i=1000581083989"
      }
    }
  ]
}