{
  "id": "28b42ae3-36ee-4342-9e35-cea376285e36",
  "name": "Not Your History Class Podcast",
  "spotifyId": "3KpMlFm5cYM68rBHe10hvo",
  "appleId": 1782220373,
  "episodes": [
    {
      "id": "d4b4895b-a7af-47d8-b6b4-e37efbae1594",
      "title": "The Moonies Cult in Korea Believed Their Leader To Be The Next Messiah.",
      "description": "The Japanese occupation of Korea lasted from 1910 to 1945, in which Japan spent their time systematically wiping out any sort of Korean culture and religious beliefs, stating that the Koreans should follow Japanese culture, traditions and beliefs. This erasure of Korean culture left many Koreans feeling lost and wanting to hold on to something familiar to them. The Korean preacher, Sun Myung Moon started to preach, bringing Christianity slowly back into Korea, despite the protests of Japan. However, Moon has had his own objectors and those who believed that he wasn’t just preaching the word of God, he was brainwashing and manipulating his followers into spending hundreds of thousands of dollars on artifacts, items that would promise to take away the sins of their ancestors and lead to future good luck. Not to mention the mass weddings that were held, people who would be meeting their future spouse for the first time, some not even speaking the same language. Thanks to Mike Meyers for the theme music, you can follow him on X @themikeshow42. Background Music: Ambient Breath, Kirk Osamayo, Free Music Archive, CCBY, https://tinyurl.com/ambientbreathkirko SOCIAL MEDIA LINKS www.notyourhistoryclass.com https://www.instagram.com/notyourhistoryclass/ https://www.tiktok.com/@notyourhistoryclass https://www.youtube.com/@notyourhistoryclasspodcast Sources are available on my website, notyourhistoryclass.com",
      "release": "2026-02-16T12:30:00Z",
      "duration": "00:59:49.1910000",
      "explicit": true,
      "spotifyId": "6RERCj3M1BQTaRs14vG6XA",
      "appleId": 1000749974790,
      "subjects": [
        "Unification Church"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6RERCj3M1BQTaRs14vG6XA",
        "apple": "https://podcasts.apple.com/podcast/the-moonies-cult-in-korea-believed-their-leader-to-be/id1782220373?i=1000749974790"
      }
    }
  ]
}