{
  "id": "345a834c-5240-431a-9281-2bc6b4ff39c9",
  "name": "not so Secret Dads Business",
  "spotifyId": "6suuUkXaXCvpSlOaGSnaki",
  "appleId": 1534276228,
  "youTubeChannelId": "UCXvchWz_1adjSNJjtFd5zqQ",
  "episodes": [
    {
      "id": "1ac277fd-fe20-4cc9-a47b-1bad7afaae3d",
      "title": "We Got Out: Leaving a Cult, Reclaiming Our Lives and Family Connections",
      "description": "Sarah and Nippy were in the NXIVM (said Nexium) cult for 12 and 16 years respectively. In early 2017, Sarah was invited into a secret women\u0027s sect of the cult called DOS. She was asked to strip naked, was blindfolded and led into a room with several other women. She was then instructed to repeat the words \u0022Master, would you brand me? It would be an honour\u0022 and she was branded with the cult leaders initials. It wasn\u0027t long after, that Sarah and Nippy along with a small band of close friends, blew the whistle and alerted the media and authorities about the crimes of Keith Raniere. He ended up being sentenced to 120 years in prison for sex trafficking and racketeering charges among others.\nIn this episode, I spoke to Sarah and Nippy about their experiences within the cult, how they got out and how they have begun their healing process to regain their lives and families. They now have a podcast in its 3rd season called A Little Bit Culty, where they speak to cult experts, whistleblowers and other cult survivors.\nIf you or someone you love are in a high control group otherwise known as a cult, check out the links below for resources that will be helpful to you. Otherwise check out the docuseries, The Vow, on HBO (or Foxtel and Binge in Australia) or check out Sarah\u0027s book, Scarred: The True Story of How I Escaped NXIVM, The Cult That Bound My Life.\n\nWeb Resources:\nwww.sarahedmondson.com/rescources\nwww.igotout.org\nwww.alittlebitculty.com\nSocial Media:\nInstagram: @alittlebitculty\n                @igotout_org\nFacebook: @alittlebitculty\n                @igotout",
      "release": "2024-04-22T07:52:15Z",
      "duration": "01:12:13",
      "explicit": false,
      "spotifyId": "4vrGPXQf5WHyEbMBeUlG85",
      "appleId": 1000550122983,
      "youTubeId": "rh-elwaznfA",
      "subjects": [
        "NXIVM",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4vrGPXQf5WHyEbMBeUlG85",
        "apple": "https://podcasts.apple.com/podcast/we-got-out-leaving-a-cult-reclaiming-our-lives/id1534276228?i=1000550122983",
        "youtube": "https://www.youtube.com/watch?v=rh-elwaznfA"
      }
    }
  ]
}