{
  "id": "954d2170-2635-4b10-983a-4a47f2cbe009",
  "name": "Nothingness: Antidote to Narcissism",
  "youTubeChannelId": "UCTg79xJ1-pDFkg-aBe9KXLw",
  "episodes": [
    {
      "id": "a0bb7a12-9142-467f-8bc7-78ada33e63bf",
      "title": "Are You Hypnotized or Awake?",
      "description": "Hypnoid states involve a choice to be hypnotized, empathy, a suggestible state of mind, people-pleasing, and role-playing within a shared fantasy.\n\nEntraining, Hypnotist’s introject (hence posthypnotic suggestion). \n\nThe narcissist uses on you entraining, a kind of trance.\n\nHypnosis as a shared fantasy with role-playing: \n\nOutsourcing reality testing;\nFitting into narrative (scripting) and affirming the delusions as realistic, acceding to goals;\nSuspension of disbelief/judgment of right and wrong (narcissist\u0027s introject);\nExternal regulation of moods and emotions, sense of self-worth, self-perception and self-image;\nConfusion of external and internal;\nAssigned role playing;\nSymbiotic-infantile merger/fusion with secure base parental figure;\nSelf-states.\n\nFind and Buy MOST of my BOOKS and eBOOKS in my Amazon Author Page: https://www.amazon.com/stores/Sam-Vaknin/author/B000APLOFK/allbooks",
      "release": "2025-10-30T15:27:43Z",
      "duration": "01:24:17",
      "explicit": false,
      "youTubeId": "XLlXc5vBtAg",
      "subjects": [
        "Psychology",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=XLlXc5vBtAg"
      }
    },
    {
      "id": "c80d6a8b-cf1e-470a-9337-2b3b9a24a504",
      "title": "Beware of Gurus, Coaches, and Other Predators",
      "description": "Increasingly more grandiose, people are injured and humiliated by and shun the truly intelligent, expert, knowledgeable, and insightful. They opt for ersatz fake gold.\n\nIt is not surprising that the latter - the Western trickster \u0022coaches\u0022 and conspiracy theorists - often quote the former (the Indian phonies) . They are specimen of the same family of lethal intellectual viruses in human form.\n\nThere is a tsunami of mental health disorders heading our way. It is projected to affect at least half the population, in all age groups.\n\nBut there are two additional waves inexorably coursing to our already dilapidated shores: irrationality and grandiosity.\n\nBuy most of my books in Amazon https://www.amazon.com/stores/page/60F8EC8A-5812-4007-9F2C-DFA02EA713B3",
      "release": "2025-10-12T15:03:12Z",
      "duration": "00:28:08",
      "explicit": false,
      "youTubeId": "YdgMTb8tuCo",
      "subjects": [
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=YdgMTb8tuCo"
      }
    }
  ]
}