{
  "_ts": 0,
  "id": "833f4733-57b1-4f81-83a1-277762f6d923",
  "name": "NowMedia TV",
  "youTubeChannelId": "UC413uGTh_H_a4MIGetTsQfg",
  "episodes": [
    {
      "id": "95fe8850-b1bd-4770-b7a8-4e188fbd1808",
      "title": "From Cult Escape to Entrepreneurial Success | Lydia Knight’s Journey of Empowerment",
      "description": "🌟 From Vulnerability to Victory: Lydia Knight’s Story of Overcoming Adversity\n\nIn this heartfelt episode of Mompreneurs: The Real Deal, hosts Jen Gode and Dr. Sarah Breen dive deep into the inspiring story of Lydia Knight, CEO of the SHE Center and renowned executive coach. Lydia shares her journey from growing up in a strict Mormon and cult environment to breaking free, navigating single motherhood, and building a successful entrepreneurial career.\n\nDiscover how Lydia turned personal challenges like an abusive marriage, a life-threatening eating disorder, and secret shame into tools for personal growth and transformation—helping over 1,000 women along the way.\n\n🔍 In this video, you’ll learn:\n🚪 How Lydia escaped a cult and redefined her life.\n🛠️ The tools she created to overcome shame and self-doubt.\n🌱 How her darkest moments became the foundation of her successful business.\n💬 The importance of vulnerability and authenticity in entrepreneurship.\n⏰ Timestamps:\n0:00 - Welcome back: Lydia Knight’s journey so far.\n2:10 - From Mormon upbringing to single motherhood: The pivotal moments.\n6:25 - Breaking free from a cult: Deprogramming the mind and body.\n10:50 - How Lydia’s deprogramming method became the foundation of her business.\n14:40 - Overcoming secret shame while running a business.\n18:35 - The power of authenticity: Connecting with clients through vulnerability.\n23:00 - Lessons in service-based entrepreneurship and community building.\n\n🔗 Stay Connected:\n💡 Follow Lydia Knight:\n\nWebsite: SHE Center Official\nInstagram: @LydiaKnight_SHE\n🎙️ Follow Mompreneurs - The Real Deal:\n\nInstagram: @MompreneursRealDeal\nFacebook: Mompreneurs Real Deal\n🔖 Hashtags:\n#Mompreneurs #LydiaKnight #EntrepreneurialJourney #Empowerment #OvercomingAdversity\n\n✨ Question for the Audience:\n💬 Have you ever turned a personal struggle into a source of empowerment? Share your story in the comments below!\n\n🔔 Subscribe for more real, raw, and inspiring mompreneurial stories.",
      "release": "2025-01-08T00:00:00Z",
      "duration": "00:12:30",
      "explicit": false,
      "youTubeId": "aBVO830peW8",
      "subjects": [
        "Cult Recovery",
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=aBVO830peW8"
      }
    }
  ]
}