{
  "id": "b6c0b707-4027-48bd-af95-885b6c0f002d",
  "name": "NXIVM on Trial",
  "spotifyId": "0Aqs2jgI9AD0fOqm1IBVKh",
  "appleId": 1462352368,
  "episodes": [
    {
      "id": "bea92dee-6eb8-42d0-bf95-dd07a5204f16",
      "title": "The \u0022Prefect\u0022 Ending",
      "description": "The HBO series \u0022The Vow\u0022 wrapped up its second season this week with a chronicling of events and players surrounding the sentencings of NXIVM leaders Keith Raniere and Nancy Salzman. Both are currently serving prison sentences for crimes that include sex trafficking, forced labor conspiracy, wire fraud conspiracy and racketeering.   On this episode of \u0022NXIVM on Trial,\u0022 we\u0027re joined by Moira Penza, the lead prosecutor in Raniere\u0027s trial, to discuss the final episode of \u0022The Vow,\u0022 and reflections on the case. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-22T16:57:00Z",
      "duration": "00:39:35.1050000",
      "explicit": true,
      "spotifyId": "1zczxysHxX4nWX6ka7x50u",
      "appleId": 1000587170164,
      "subjects": [
        "NXIVM",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1zczxysHxX4nWX6ka7x50u",
        "apple": "https://podcasts.apple.com/podcast/the-prefect-ending/id1462352368?i=1000587170164"
      }
    },
    {
      "id": "50214398-d7c8-4852-b0f8-08c3b5fa2342",
      "title": "The Shunning",
      "description": "The testimony of a women shunned by the NXIVM community and confined to a room in a suburban townhouse for two years was the focus of an episode in the second season of HBO\u0027s \u0022The Vow.\u0022 The witness, identified only as Daniela, took the stand for several days during former NXIVM leader Keith Raniere\u0027s trial in 2019. She detailed a pattern of years of grooming and manipulation by Raniere, who ordered her confinement in 2010 after she admitted to kissing another man.  On this episode of \u0022NXIVM on Trial,\u0022 Times Union Editor Casey Seiler, producer Jessica Marshall and reporter Robert Gavin discuss the episode, and many of the details left out of it that were revealed at trial. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-15T18:00:00Z",
      "duration": "00:25:53.0570000",
      "explicit": true,
      "spotifyId": "0Dvkpj6sfBP9FePgt4U0xb",
      "appleId": 1000586313005,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Dvkpj6sfBP9FePgt4U0xb",
        "apple": "https://podcasts.apple.com/podcast/the-shunning/id1462352368?i=1000586313005"
      }
    },
    {
      "id": "aff547e1-a686-4af9-9206-85e4a3d66b37",
      "title": "Level Up",
      "description": "Lauren Salzman\u0027s gut-wrenching testimony in the trial of NXIVM founder Keith Raniere took center stage in the fourth episode of the new season of HBO\u0027s \u0022The Vow.\u0022 Salzman\u0027s account painted an emotionally disturbing and revealing picture of Raniere\u0027s pervasive pattern of physical and emotional abuse of women in the organization—including holding their fertility hostage, forcing them into group sex acts, and gaslighting.   On this episode of \u0022NXIVM on Trial,\u0022 Times Union Editor Casey Seiler, reporter Robert Gavin and producer Jessica Marshall discuss the new installment of the series and how it handles the testimony of the prosecution\u0027s lead witness. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-08T18:40:00Z",
      "duration": "00:27:40.9430000",
      "explicit": true,
      "spotifyId": "1moVJjFnDAVmbr9yaVqdYQ",
      "appleId": 1000585544165,
      "subjects": [
        "NXIVM",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1moVJjFnDAVmbr9yaVqdYQ",
        "apple": "https://podcasts.apple.com/podcast/level-up/id1462352368?i=1000585544165"
      }
    },
    {
      "id": "ebf0dbf2-0c21-411e-bb86-e4940dbb4d08",
      "title": "NXIVM\u0027s Tourette\u0027s",
      "description": "The third episode of the second season of HBO\u0027s \u0022The Vow\u0022 explores NXIVM\u0027s unchecked claim to have used its programming to cure patients with Tourette Syndrome.   On this episode of \u0022NXIVM on Trial,\u0022 Times Union editor Casey Seiler, producer Jessica Marshall, and reporter Robert Gavin discuss the episode, and how the organization\u0027s experiment with Tourette Syndrome affected former members of the organization. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-11-01T15:44:00Z",
      "duration": "00:22:24.8090000",
      "explicit": false,
      "spotifyId": "2eZQmlf4CdL2yfv4efnQlO",
      "appleId": 1000584680172,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2eZQmlf4CdL2yfv4efnQlO",
        "apple": "https://podcasts.apple.com/podcast/nxivms-tourettes/id1462352368?i=1000584680172"
      }
    },
    {
      "id": "56b6182b-7dfc-4647-af05-de933fb919ac",
      "title": "Nancy\u0027s NXIVM",
      "description": "NXIVM co-founder and “Prefect” Nancy Salzman takes center stage in the second episode of the new season of HBO’s “The Vow.” We hear from her for the first time since the NXIVM organization fell. Salzman, who pleaded guilty to racketeering conspiracy charges connected to NXIVM, is currently serving a three and one half-year prison sentence.  In this episode of “NXIVM on Trial,” Times Union Editor Casey Seiler, reporter Robert Gavin and producer Jessica Marshall discuss Salzman’s interview and other developments in the series’ second episode. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-25T15:48:00Z",
      "duration": "00:22:11.0950000",
      "explicit": false,
      "spotifyId": "5n1YdU2IguaMWtUZ6bs08O",
      "appleId": 1000583851402,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5n1YdU2IguaMWtUZ6bs08O",
        "apple": "https://podcasts.apple.com/podcast/nancys-nxivm/id1462352368?i=1000583851402"
      }
    },
    {
      "id": "b614592f-94cf-48d7-93f2-d701e29cb227",
      "title": "\u0027The Vow\u0027 Returns",
      "description": "The six-part, second season of HBO’s documentary series “The Vow” continues to track the downfall of NXIVM, the purported self-help organization based in upstate New York. The new installment of the series follows the trial and sentencing of its leader, Keith Raniere, and features a first-time interview with NXIVM co-founder Nancy Salzman. Both are now serving prison sentences.  On this episode of “NXIVM on Trial,” Times Union Editor Casey Seiler, reporter Robert Gavin and producer Jessica Marshall discuss the revelations made in the first episode, which premiered this week. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-10-18T15:59:00Z",
      "duration": "00:27:45.6450000",
      "explicit": false,
      "spotifyId": "00yGYAdjwWlxUvvKeQe3bL",
      "appleId": 1000583050179,
      "subjects": [
        "NXIVM",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/00yGYAdjwWlxUvvKeQe3bL",
        "apple": "https://podcasts.apple.com/podcast/the-vow-returns/id1462352368?i=1000583050179"
      }
    },
    {
      "id": "a32bcc58-b0ca-4977-ad30-ea35c49467f4",
      "title": "Nancy Salzman: From Prefect to Prison",
      "description": "A federal judge sentenced NXIVM co-founder Nancy Salzman to three and a half years in prison this week. She was the last of the major players charged in criminal court in the NXIVM saga to receive a sentence.  In the courtroom, eight of Salzman\u0027s victims described her as a cold, calculating enabler and enforcer for cult leader Keith Raniere. Judge Nicholas Garaufis admonished the 67-year-old Halfmoon resident, saying her actions \u0022left trauma and destruction in your wake.”   On this episode of NXIVM on Trial, Times Union Editor-in-Chief Casey Seiler and criminal justice reporter Rob Gavin discuss the sentence and its significance. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-09-10T18:00:00Z",
      "duration": "00:17:49.3480000",
      "explicit": false,
      "spotifyId": "5x0BhmnEtAB9ZvlZo8ukCz",
      "appleId": 1000534957047,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5x0BhmnEtAB9ZvlZo8ukCz",
        "apple": "https://podcasts.apple.com/podcast/nancy-salzman-from-prefect-to-prison/id1462352368?i=1000534957047"
      }
    },
    {
      "id": "438968db-9094-4362-accf-0587aa6b14bd",
      "title": "From DOS to dogs",
      "description": "Last month a federal judge spared high-ranking NXIVM defector Lauren Salzman any prison time. Judge Nicholas Garaufis also sharply questioned why authorities in the Capital Region failed to bring a criminal case against Keith Raniere and what he termed the \u0022NXVIM sex cult,\u0022 despite abundant evidence of wrongdoing.  On this episode of \u0022NXIVM on Trial,\u0022 Times Union Editor Casey Seiler and criminal justice reporter Robert Gavin discuss Salzman’s sentence, the judge\u0027s admonition, and her mother, NXIVM co-founder Nancy Salzman, who is expected to be sentenced in September. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-08-06T19:30:00Z",
      "duration": "00:22:05.2170000",
      "explicit": false,
      "spotifyId": "5QHDuKi6gGAuV8ZJ6kxYGd",
      "appleId": 1000531263264,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5QHDuKi6gGAuV8ZJ6kxYGd",
        "apple": "https://podcasts.apple.com/podcast/from-dos-to-dogs/id1462352368?i=1000531263264"
      }
    },
    {
      "id": "e99bb5a3-ecb8-47a9-bf40-ef61bc162dd7",
      "title": "The Enabler",
      "description": "A federal judge sentenced Allison Mack to three years in prison this week for her role supplying sex \u0022slaves\u0022 to NXIVM leader Keith Raniere. During the sentence hearing in a Brooklyn courtroom, one of Mack\u0027s victims compared her to Ghislaine Maxwell, the alleged enabler of late sexual predator Jeffrey Epstein.  Times Union justice reporter Rob Gavin and producer Jessica Marshall traveled to Brooklyn for the former \u0022Smallville\u0022 actress\u0027 sentencing. On this episode of NXIVM on Trial, they discuss what when on inside—and outside—the courtroom.  Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-07-02T01:00:00Z",
      "duration": "00:30:19.8720000",
      "explicit": true,
      "spotifyId": "2t9tHkOrydbK45UyfoFJOG",
      "appleId": 1000527572234,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2t9tHkOrydbK45UyfoFJOG",
        "apple": "https://podcasts.apple.com/podcast/the-enabler/id1462352368?i=1000527572234"
      }
    },
    {
      "id": "00de0070-030b-4d97-b332-7c747bf33595",
      "title": "Allison Mack Awaits Her Fate",
      "description": "Former television actress and high-ranking NXIVM member Allison Mack awaits sentencing this week for crimes involving Keith Raniere\u0027s cult organization.  Mack pleaded guilty to racketeering and racketeering conspiracy charges in April 2019 and is scheduled to be sentenced June 30. In a sentencing memo last week, she distanced herself from Raniere, calling him \u0022a twisted man.\u0022  On this episode of NXIVM on Trial, former NXIVM coach Tabby Chapman shares her own experiences with Mack, with whom she worked closely with for a time. Chapman recalls Mack\u0027s infectious charisma and the \u0022Smallville\u0022 star\u0027s unpredictable darker side. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-06-28T14:35:00Z",
      "duration": "00:27:13.3840000",
      "explicit": false,
      "spotifyId": "5olJCXnJFukdNlN9jHs6nw",
      "appleId": 1000527129652,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5olJCXnJFukdNlN9jHs6nw",
        "apple": "https://podcasts.apple.com/podcast/allison-mack-awaits-her-fate/id1462352368?i=1000527129652"
      }
    },
    {
      "id": "1e961d41-0f99-4955-9125-afd8bd4323d7",
      "title": "\u0027Don\u0027t Call It a Cult\u0027",
      "description": "The now-convicted NXIVM ringleader Keith Raniere is tucked away in federal prison, likely for the rest of his life. High-ranking members of his inner circle still await sentence hearing dates. And a small faction of former members remain loyal to Raniere as he attempts to clear his name on appeal.   The ongoing NXIVM saga is the focus of former VICE senior editor and Vancouver-based investigative reporter Sarah Berman\u0027s new book, “Don’t Call it a Cult.” In it, she takes a three-part dive into the rise of NXIVM, its leader\u0027s uncanny ability to avoid legal consequences, and the federal probe that inevitably brought it all crashing down.  On this episode of NXIVM on Trial, Sarah Berman talks to Rob Gavin about the book.  Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-05-11T09:00:00Z",
      "duration": "00:27:14.3240000",
      "explicit": false,
      "spotifyId": "7r7O1c70FGG04QMhFteYUe",
      "appleId": 1000521368849,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7r7O1c70FGG04QMhFteYUe",
        "apple": "https://podcasts.apple.com/podcast/dont-call-it-a-cult/id1462352368?i=1000521368849"
      }
    },
    {
      "id": "2a91edc4-3c08-4a81-8287-1e00433555ea",
      "title": "\u0027Desperation Is a Stinky Cologne\u0027",
      "description": "For Sarah Edmondson and Anthony \u0022Nippy\u0022 Ames, life after NXIVM has been busy. The whistleblowers were heavily featured in the HBO Documentary \u0022The Vow,\u0022 Sarah wrote a book, and now they\u0027ve started a new podcast together called \u0022A Little Bit Culty,\u0022 focused on cult psychology and the stories of survivors.  Through it all, they say they\u0027re focused on their family, healing from the emotional trauma that the last decade has wrought on their lives, and helping others overcome similar traumas.   On this episode of NXIVM on Trial, Times Union Editor Casey Seiler and criminal justice reporter Robert Gavin check in with the pair to talk about their new podcast, their thoughts on Keith Raniere\u0027s sentence and the loyalists who continue to proclaim his innocence, and the process of moving forward with their lives. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-02-26T16:37:47Z",
      "duration": "00:55:12.1430000",
      "explicit": true,
      "spotifyId": "7wfQR2SrRcezKocFXo1vNx",
      "appleId": 1000510795492,
      "subjects": [
        "NXIVM",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7wfQR2SrRcezKocFXo1vNx",
        "apple": "https://podcasts.apple.com/podcast/desperation-is-a-stinky-cologne/id1462352368?i=1000510795492"
      }
    },
    {
      "id": "801d3477-1da7-4f5d-a6f0-6b09660c0fdb",
      "title": "Gone to Tucson",
      "description": "Former NXIVM leader Keith Raniere is now in federal prison in Arizona, planning the appeal of his 120-year sentence with a new attorney who once defended Bill Cosby.  On this episode of NXIVM on Trial, Times Union Editor Casey Seiler and reporter Robert Gavin discuss the latest developments in the NXIVM saga, including Raniere\u0027s new residence, a reported letter sent to former President Donald Trump seeking a pardon for Raniere, and an episode of CNBC\u0027s \u0022American Greed\u0022 that features the case.   Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-02-05T21:30:00Z",
      "duration": "00:22:50.4350000",
      "explicit": false,
      "spotifyId": "56GpyGyAnhgMB4qVugP4Kp",
      "appleId": 1000507932121,
      "subjects": [
        "NXIVM",
        "Qanon"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/56GpyGyAnhgMB4qVugP4Kp",
        "apple": "https://podcasts.apple.com/podcast/gone-to-tucson/id1462352368?i=1000507932121"
      }
    },
    {
      "id": "cb618457-0c97-4a37-93da-df12bbde2ea4",
      "title": "Among the Dead-Enders",
      "description": "The sentencing of Keith Raniere and Clare Bronfman capped off a long year of delays, documentaries and major developments in the NXIVM saga.  As the end of 2020 nears, Times Union Editor Casey Seiler and reporter Robert Gavin look back at what transpired in the past year, and what\u0027s likely to come in 2021. Could Allison Mack face sentencing? Mack, Nancy Salzman and others still await their fate. And what of the group of determined \u0022NXIVM dead-enders\u0022 who remain faithful to Keith Raniere? Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-12-29T15:30:00Z",
      "duration": "00:27:35.2480000",
      "explicit": false,
      "spotifyId": "3gOpakZw5xtCvJHGOC3KOn",
      "appleId": 1000503816753,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3gOpakZw5xtCvJHGOC3KOn",
        "apple": "https://podcasts.apple.com/podcast/among-the-dead-enders/id1462352368?i=1000503816753"
      }
    },
    {
      "id": "98b24313-2ac1-47eb-9af0-85e4765dd16b",
      "title": "\u0022Parasite\u0022",
      "description": "A federal judge in Brooklyn sentenced NXIVM leader Keith Raniere to 120 years in prison this week, following several hours of statements from victims who leveled words like monster, predator, parasite and terrorist at the man whose crimes included the sexual abuse of a 15-year-old Mexican girl.  In this episode, Times Union Editor Casey Seiler, Managing Editor Brendan Lyons and Courts reporter Rob Gavin discuss the event that sealed the downfall of the Saratoga County-based guru who cloaked his cruelty in the language of self-empowerment. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-10-28T18:15:00Z",
      "duration": "00:26:53.2170000",
      "explicit": false,
      "spotifyId": "287DWetIctFzxWNP7wr4wB",
      "appleId": 1000496384018,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/287DWetIctFzxWNP7wr4wB",
        "apple": "https://podcasts.apple.com/podcast/parasite/id1462352368?i=1000496384018"
      }
    },
    {
      "id": "2d4f1a76-e9ca-4efb-9a80-ab158328edf5",
      "title": "Judgment Day",
      "description": "NXIVM leader Keith Raniere is finally facing his sentencing in Federal court in Brooklyn in a few short days. Times Union Editor Casey Seiler and reporter Rob Gavin discuss the potential outcome, and take a retrospective look at why Raniere and his co-defendants\u0027 cases were tried downstate rather in than in their Capital Region backyard. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-10-23T07:00:00Z",
      "duration": "00:18:19.3630000",
      "explicit": false,
      "spotifyId": "46VJX6nEKxD3t9s0IFQslF",
      "appleId": 1000495762593,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/46VJX6nEKxD3t9s0IFQslF",
        "apple": "https://podcasts.apple.com/podcast/judgment-day/id1462352368?i=1000495762593"
      }
    },
    {
      "id": "3445c2ce-0416-4415-93d3-7a67516058b8",
      "title": "The Lost Daughter",
      "description": "India Oxenberg did not intend to become a “slave” or a television celebrity\u0027s “pet” in a strange city on the other side of the country from her family’s home in southern California.  Yet the daughter of actress Catherine Oxenberg spent seven years entrenched in Keith Raniere\u0027s cult-like organization, NXIVM. She was branded with Raniere\u0027s initials as a member of the secret female \u0022master/slave\u0022 group called DOS.  She left NXIVM after Raniere\u0027s arrest in 2018, and is now speaking out about her experience in the form of a four-part documentary series on Starz.  In this episode of NXIVM on Trial, reporter Rob Gavin sits down with both Catherine and India Oxenberg to talk about the new series, and how they\u0027re feeling as the sentencing for Keith Raniere approaches. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-10-16T07:00:00Z",
      "duration": "00:24:48.1430000",
      "explicit": true,
      "spotifyId": "3zYQt5cEG8ZWI036NESEbT",
      "appleId": 1000494955682,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zYQt5cEG8ZWI036NESEbT",
        "apple": "https://podcasts.apple.com/podcast/the-lost-daughter/id1462352368?i=1000494955682"
      }
    },
    {
      "id": "7be8a672-e039-4f71-b3da-25249fe0f9a4",
      "title": "Brooklyn Justice",
      "description": "Seagram\u0027s heiress and NXIVM financier Clare Bronfman was sentenced to more than six years in prison this week, following an hours-long hearing before a judge in Brooklyn during which victims read emotionally charged impact statements. Bronfman had pleaded guilty to charges of fraud and forced labor related to her role in the shadowy organization known as NXIVM. Times Union Editor Casey Seiler and reporter Rob Gavin discuss the first in what is to become a \u0022season\u0022 of sentencing that will bring punishment to NXIVM co-founder Nancy Salzman, actress Allison Mack, and NXIVM leader Keith Raniere. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-10-02T04:00:00Z",
      "duration": "00:27:19.7060000",
      "explicit": false,
      "spotifyId": "3d3pzapguoATmMTTdAogSG",
      "appleId": 1000493301855,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3d3pzapguoATmMTTdAogSG",
        "apple": "https://podcasts.apple.com/podcast/brooklyn-justice/id1462352368?i=1000493301855"
      }
    },
    {
      "id": "6d0d3d84-fbc2-4d9d-9007-0f914bdd3b70",
      "title": "Scrutiny on this judge",
      "description": "As Keith Raniere\u0027s October 27 sentencing nears, Times Union Editor Casey Seiler and courts reporter Robert Gavin discuss several developments in the NXIVM saga.  That includes a revelation that Raniere recently told a loyal NXIVM disciple that he wanted to \u0022get scrutiny\u0022 on Judge Nicholas Garaufis, and Seagrams\u0027 heiress Clare Bronfman\u0027s refusal to disavow NXIVM and Raniere as she stands convicted of NXIVM-related crimes. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-09-04T14:36:30Z",
      "duration": "00:21:03.7250000",
      "explicit": false,
      "spotifyId": "2QUHa8ik4QW1E000X9Xv2W",
      "appleId": 1000490088413,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2QUHa8ik4QW1E000X9Xv2W",
        "apple": "https://podcasts.apple.com/podcast/scrutiny-on-this-judge/id1462352368?i=1000490088413"
      }
    },
    {
      "id": "47e145a3-9587-4fa3-a2f5-6b2ca720ea44",
      "title": "NXIVM Exposed: A Post-Trial Talk - Part II",
      "description": "NXIVM founder Keith Raniere faces sentencing October 27 for his 2019 conviction on federal charges of sex trafficking, conspiracy, and conspiracy to commit forced labor. NXIVM whistleblower Toni Natalie and cult expert Rick Ross played large roles in the investigation that led to Raniere\u0027s downfall as head of the shadowy organization.  On this episode of NXIVM on Trial, hear the second half of a 2019 conversation between Natalie, Ross and Senior Editor Brendan Lyons at the Times Union\u0027s Hearst Center. During the discussion, they shine a light on the inner workings of NXIVM, including the role played by Seagram\u0027s heiress Clare Bronfman. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-08-28T16:00:00Z",
      "duration": "00:44:31.2550000",
      "explicit": false,
      "spotifyId": "5yE3NwTEz8QeoDOZ6Zf8he",
      "appleId": 1000489450267,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5yE3NwTEz8QeoDOZ6Zf8he",
        "apple": "https://podcasts.apple.com/podcast/nxivm-exposed-a-post-trial-talk-part-ii/id1462352368?i=1000489450267"
      }
    },
    {
      "id": "c1ca8246-bedf-45bc-8218-88ffe09f45cc",
      "title": "A different kind of Vanguard Week",
      "description": "On the eve of what would have been a week-long celebration of the birthday of disgraced former leader of NXIVM Keith Raniere, HBO\u0027s new documentary series \u0022The Vow\u0022 will premiere the first of nine episodes looking back at the organization and the downfall of its leader. The series, which will air weekly, coincidentally times out to conclude in tandem with Raniere\u0027s long-delayed October 27 sentencing.   In this episode of NXIVM on Trial, Times Union Editor Casey Seiler and reporter Robert Gavin discuss the documentary, the reaction from former NXIVM members deeply unhappy to be featured in it, and recent developments in the case of Seagram\u0027s heiress Clare Bronfman, who pled guilty to felony charges related to her involvement in NXIVM in April 2019. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-08-21T20:06:09Z",
      "duration": "00:18:27.0430000",
      "explicit": false,
      "spotifyId": "666OZU98smmU5nmBoJBrti",
      "appleId": 1000488843414,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/666OZU98smmU5nmBoJBrti",
        "apple": "https://podcasts.apple.com/podcast/a-different-kind-of-vanguard-week/id1462352368?i=1000488843414"
      }
    },
    {
      "id": "85d080f9-a4d8-4707-8e0c-840f4e9f583e",
      "title": "Dancing for \u0022Kay Rose\u0022",
      "description": "Every night since July 3, a group of people turn on music and dance on the street outside Brooklyn’s Metropolitan Detention Center. The group that organized the dancing say it\u0027s meant to support federal inmates during the pandemic, including one in particular: Kay Rose.  There is, however, no inmate by that name in the Brooklyn facility — or anywhere else in the federal prison population, for that matter. But \u0022Kay Rose\u0022 shares the initials of someone who has spent the past two years in the downstate lockup: Keith Raniere, the leader of the formerly influential and now shattered organization known as NXIVM.   On this episode of NXIVM on Trial, Times Union editor Casey Seiler and reporter Robert Gavin discuss the latest development in the NXIVM saga. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2020-07-17T09:00:00Z",
      "duration": "00:20:58.8660000",
      "explicit": false,
      "spotifyId": "6HjDYCbYokLTr3vIJBMnb6",
      "appleId": 1000485278162,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6HjDYCbYokLTr3vIJBMnb6",
        "apple": "https://podcasts.apple.com/podcast/dancing-for-kay-rose/id1462352368?i=1000485278162"
      }
    },
    {
      "id": "64767a8e-5457-4569-b648-69305f664293",
      "title": "NXIVM Exposed: A post-trial talk (part 1)",
      "description": "Times Union editor Brendan Lyons moderates a conversation between NXIVM whistleblower Toni Natalie and cult expert Rick Ross.  The episode highlights their personal interactions with NXIVM and its founder, Keith Raniere, who was convicted this summer on federal charges of sex trafficking, conspiracy, and conspiracy to commit forced labor.  Ross and Natalie shine a light on the inner workings of NXIVM and Lyons offers his own insights covering the shadowy organization.    Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-10-15T16:11:46Z",
      "duration": "00:53:09.4460000",
      "explicit": false,
      "spotifyId": "3KbElXAiGwb1sRIiMG9ZLw",
      "appleId": 1000453649716,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3KbElXAiGwb1sRIiMG9ZLw",
        "apple": "https://podcasts.apple.com/podcast/nxivm-exposed-a-post-trial-talk-part-1/id1462352368?i=1000453649716"
      }
    },
    {
      "id": "55642bd5-6008-4a06-bf76-7b81d1bc53ba",
      "title": "Vanguard Week anniversary special",
      "description": "Times Union managing editor Casey Seiler assembles the newspaper\u0027s NXIVM beat writers, Robert Gavin and Brendan Seiler, for an update on the shadowy cult since its leader, Keith Raniere, was  found guilty of federal racketeering charges and more.   The conversation addresses a lawsuit against NXIVM, the potential prison sentences for members of the cult and a  made-for-television movie debuting in September.  The episode also explores the doctor who had his medical license revoked by the state for conducting unsanctioned experiments on behalf of NXIVM.    Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-08-28T20:55:26Z",
      "duration": "00:26:37.4920000",
      "explicit": false,
      "spotifyId": "5fHFbBcFugddjKFtsAIPFg",
      "appleId": 1000448067674,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5fHFbBcFugddjKFtsAIPFg",
        "apple": "https://podcasts.apple.com/podcast/vanguard-week-anniversary-special/id1462352368?i=1000448067674"
      }
    },
    {
      "id": "34264bfb-403e-4356-a5eb-6e3a31f4d126",
      "title": "Swift Justice",
      "description": "In a special post-verdict edition of the Times Union\u0027s \u0022NXIVM on Trial\u0022 podcast, managing editor Casey Seiler and justice reporter Robert Gavin discuss Wednesday\u0027s speedy verdict in the trial of NXIVM leader Keith Raniere: guilty on all counts.  Gavin describes the scene in the courtroom when Raniere learned his fate, and the reactions from his defense attorneys and the people who have claimed their lives as well as those of their loved ones were ruined by the man known within NXIVM as \u0022Vanguard.\u0022  Daily coverage of the trial is available in print and online at www.timesunion.com/nxivm/. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-06-20T23:12:54Z",
      "duration": "00:19:32.4800000",
      "explicit": false,
      "spotifyId": "48dZ1HznaRhJBc7Ppy1TYX",
      "appleId": 1000442233302,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/48dZ1HznaRhJBc7Ppy1TYX",
        "apple": "https://podcasts.apple.com/podcast/swift-justice/id1462352368?i=1000442233302"
      }
    },
    {
      "id": "ac94337b-f7e5-4888-b08b-01348c56215e",
      "title": "\u0022Like in Rome or Whatever\u0022",
      "description": "The seventh episode of the Times Union\u0027s \u0022NXIVM on Trial\u0022 podcast breaks down the final week of testimony in the federal trial of Keith Raniere, and what\u0027s coming next week as jurors prepare to begin deliberations.  This week\u0027s episode, \u0022Like in Rome or Whatever,\u0022 features an interview with reporter Robert Gavin from Brooklyn, and looks at the testimony of the final prosecution witnesses, including two women who broke away from the shadowy \u0022master/slave\u0022 group within NXIVM and an FBI agent who introduced video evidence of Raniere discussing his belief that sexual relations between adults and children isn\u0027t necessarily abuse.  Daily coverage of the trial is available in print and online at www.timesunion.com/nxivm/. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-06-15T00:08:27Z",
      "duration": "00:15:41.4530000",
      "explicit": false,
      "spotifyId": "12q0rAZZTtxRNnGOVkPGds",
      "appleId": 1000441549113,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/12q0rAZZTtxRNnGOVkPGds",
        "apple": "https://podcasts.apple.com/podcast/like-in-rome-or-whatever/id1462352368?i=1000441549113"
      }
    },
    {
      "id": "8073edaa-7bc8-4a54-803c-cb1b4ba3fe50",
      "title": "A shadow over Knox Woods",
      "description": "The sixth episode of the \u0022NXIVM on Trial\u0022 podcast features an interview with Rob Gavin, the Times Union\u0027s reporter in the Brooklyn courthouse where Keith Raniere faced some of the most brutal testimony in the case thus far.  Gavin talks about the scene in the courtroom and the media covering it, and describes his visit to the Knox Woods neighborhood in Halfmoon, where neighbors of the NXIVM high command are only now learning what went on behind closed doors in the pleasant suburban homes all around them.  Also: Casey Seiler recaps the news from this week\u0027s three days of testimony, including a 31-year-old actress\u0027 account of her initiation into NXIVM\u0027s \u0022master/slave\u0022 club. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-06-07T22:44:09Z",
      "duration": "00:26:20.8780000",
      "explicit": false,
      "spotifyId": "3kXWFbKgr8JBAciMqc5Dd0",
      "appleId": 1000440893329,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3kXWFbKgr8JBAciMqc5Dd0",
        "apple": "https://podcasts.apple.com/podcast/a-shadow-over-knox-woods/id1462352368?i=1000440893329"
      }
    },
    {
      "id": "756e0fe2-3b11-4bbc-b0e0-26f41827d4e5",
      "title": "An Ethical Breach",
      "description": "The fifth episode of the Times Union\u0027s podcast \u0022NXIVM on Trial\u0022 offers analysis of the week-long testimony of a young Mexican woman who said she was placed in virtual confinement in a Halfmoon bedroom for two years on the orders of NXIVM leader Keith Raniere.  With justice reporter Robert Gavin in Brooklyn covering a Friday session of the trial, the podcast features managing editor Casey Seiler and investigations/Capitol Bureau chief Brendan J. Lyons.  Topics include how the woman\u0027s testimony appeared to play with the jury — the short answer: not at all well for Raniere — and how  \u0022Secrets of NXIVM,\u0022 a 2012 investigative series by the Times Union appears to have played a role in NXIVM\u0027s decision to transport her to the U.S.-Mexico border and cut her loose. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-05-31T22:58:49Z",
      "duration": "00:21:11.7710000",
      "explicit": false,
      "spotifyId": "7tItuRbjiPX8oLkqokChVN",
      "appleId": 1000440278693,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7tItuRbjiPX8oLkqokChVN",
        "apple": "https://podcasts.apple.com/podcast/an-ethical-breach/id1462352368?i=1000440278693"
      }
    },
    {
      "id": "c22ece39-14de-48d0-aaa0-a048bf3de246",
      "title": "“Almost Like a Sacrifice”",
      "description": "The Times Union\u0027s \u0022NXIVM on Trial\u0022 podcast features a discussion about the roller-coaster third week of testimony in the trial of Keith Raniere — a week that brought the accounts of two women who described Raniere\u0027s alleged emotional and physical cruelty in often excruciating detail.  Managing editor Casey Seiler, investigations and Capitol bureau chief Brendan Lyons and courts reporter Robert Gavin analyze the details in the testimony of former NXIVM insider Lauren Salzman and a young Mexican woman who said she remained captive in a room in a Halfmoon home for two years after she earned Raniere\u0027s disfavor by expressing interest in another man.    Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-05-24T22:16:00Z",
      "duration": "00:34:10.1150000",
      "explicit": false,
      "spotifyId": "2bqEwHay3M30wDwpa2zFni",
      "appleId": 1000439261500,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2bqEwHay3M30wDwpa2zFni",
        "apple": "https://podcasts.apple.com/podcast/almost-like-a-sacrifice/id1462352368?i=1000439261500"
      }
    },
    {
      "id": "23960caa-86e6-44e7-952f-41b6e06cdb74",
      "title": "Master/Slave",
      "description": "The third installment of the Times Union\u0027s weekly podcast \u0022NXIVM on Trial\u0022 features a discussion with reporter Rob Gavin on his way back from Brooklyn, where the trial of Keith Raniere swerved from the testimony of filmmaker Mark Vicente to the first appearance of cooperating witness and admitted Raniere \u0022slave\u0022 Lauren Salzman.  New episodes will be released every week during the federal trial.  Complete coverage is available at the Times Union website. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-05-18T02:47:11Z",
      "duration": "00:20:25.2470000",
      "explicit": false,
      "spotifyId": "33woyxvE5AUcv5FI9J2UmB",
      "appleId": 1000438716460,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33woyxvE5AUcv5FI9J2UmB",
        "apple": "https://podcasts.apple.com/podcast/master-slave/id1462352368?i=1000438716460"
      }
    },
    {
      "id": "09693ce6-89ab-4139-9777-a418f49844dd",
      "title": "Dunkirk in Brooklyn",
      "description": "Keith Raniere\u0027s shadowy reign as the leader of NXIVM came under fire this week during the start of  his federal trial in Brooklyn.  Times Union reporter Robert Gavin was in court for the first week of action, which included  allegations of sex with underage girls,  comparisons to Winston Churchill and  emotional testimony from people trapped in the organization.  All this and more is explored in the second installment of the  \u0022NXIVM on Trial\u0022 series, which is hosted by Times Union managing editor Casey Seiler.  New episodes are scheduled every week during the trial.  This coverage is supported by  Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-05-10T15:24:51Z",
      "duration": "00:23:02.4260000",
      "explicit": false,
      "spotifyId": "4tjS0psAnUrC3ixCF8yntZ",
      "appleId": 1000437725323,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4tjS0psAnUrC3ixCF8yntZ",
        "apple": "https://podcasts.apple.com/podcast/dunkirk-in-brooklyn/id1462352368?i=1000437725323"
      }
    },
    {
      "id": "aafba793-5320-41bb-880f-559e0a3c75d1",
      "title": "Vanguard Stands Alone",
      "description": "The details of Keith Raniere\u0027s shadowy reign as the leader of NXIVM, which has for years withstood allegations that it was a cult-like criminal enterprise, are expected to be fully revealed at his federal criminal trial in May.  Raniere, long known to his followers as \u0022Vanguard,\u0022 has for more than two decades been a captivating figure after founding the Capital Region-based organization that amassed thousands of followers and pledged to help \u0022humanity rise to its noble possibility.\u0022  But behind the programs that promised executive success and self-empowerment, Raniere\u0027s penchant for manipulating those who believed in him, especially the many women who would become his sexual partners, would lead to last year\u0027s collapse of NXIVM.  All these issues and more are covered by Times Union investigator editor Brendan Lyons for the first episode of the \u0022NXIVM on Trial\u0022 podcast series. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2019-05-02T20:29:01Z",
      "duration": "00:15:44.3780000",
      "explicit": false,
      "spotifyId": "1ngp5LlECysSo65sMiqKc2",
      "appleId": 1000437086516,
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ngp5LlECysSo65sMiqKc2",
        "apple": "https://podcasts.apple.com/podcast/vanguard-stands-alone/id1462352368?i=1000437086516"
      }
    }
  ]
}