{
  "id": "5a59e8de-5316-4e2d-b46a-a3920ddd10f3",
  "name": "Offline Xpression",
  "spotifyId": "1iSuraFHS7HlCJJxBYNcXs",
  "appleId": 1737496735,
  "youTubeChannelId": "UCuR_04jDVDST6urAhRZVjyw",
  "episodes": [
    {
      "id": "1df2faa0-949b-4b73-8529-9b7e80830d4a",
      "title": "From Religious Cult to Live TV Director: The Logan Dean Story",
      "description": "Dean Logan grew up in a religious cult where he couldn\u0027t watch sports, eat chocolate, celebrate holidays, or go to gym class. He was bullied relentlessly, became suicidal at 17, joined the Air Force to escape, survived two tours in Iraq, came home with PTSD, went through a divorce, hit rock bottom drunk at 3AM in Belgium, and then made a choice that changed everything. Today, Logan directs live television events for the biggest productions in the world: Super Bowls, World Series, French Opens, Wimbledon, Australian Opens. But more importantly, he\u0027s a Personal Integrated Growth Strategist who helps people break free from the limits they\u0027ve placed on themselves, because he knows what it\u0027s like to start from zero, work for free for six months, and rebuild your entire life from scratch. This episode is raw, real, and necessary. If you\u0027ve ever felt stuck, broken, or like your limit has already been decided for you, this conversation will prove otherwise. You\u0027ll Discover: ● How growing up in a religious cult shaped Logan\u0027s mental resilience ● Why Logan joined the Air Force (and the dream that didn\u0027t work out) ● What active warfare does to your brain (7 attacks a day for 6 months) ● How Logan got into live TV production (and why it started with theater) ● What a live TV director actually does during a game ● The career change gamble (30 years old, no network, $200 left) ● Why \u0022your limit is a lie\u0022 (neuroscience meets military strategy) ● The Personal Integrated Growth Strategist approach (multiple pillars of life) PLUS, we talk about the difference between falling and failing: Failing = never trying again, Falling = we do it all the time (expected) ✨ Watch now! \u0026#x1f49b; Don\u0027t forget to subscribe for more heart-centered conversations about mental health, reclaiming attention, and navigating life offline! About Offline Xpression: The Teen Art Revolution Hosted by Jeff Hinderscheid with Victoria Jones, our mission is to empower listeners to take control of their mental health and well-being. The podcast is an opportunity to connect with others in the arts world, along with professional coaches, doctors, spiritual leaders, authors, and professors, all with a common goal of creating a healthier society. Connect With Us Instagram https://www.instagram.com/offlinexpression/ Web https://offlinexpression.com/ Spotify https://open.spotify.com/show/1iSuraFHS7HlCJJxBYNcXs?si=5944358768dd4029 Support the show There\u0027s a beautiful world just waiting for YOU! Go out and seize the day, and retake control of your life\u0027s digital balance!",
      "release": "2026-01-07T18:00:00Z",
      "duration": "01:08:26.8400000",
      "explicit": false,
      "spotifyId": "462U8QKUU2xuxQIvB4WHjb",
      "appleId": 1000744164176,
      "youTubeId": "HZcLIK7m9sQ",
      "subjects": [
        "Cult Recovery"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/462U8QKUU2xuxQIvB4WHjb",
        "apple": "https://podcasts.apple.com/podcast/from-religious-cult-to-live-tv-director-the-logan-dean-story/id1737496735?i=1000744164176",
        "youtube": "https://www.youtube.com/watch?v=HZcLIK7m9sQ"
      }
    }
  ]
}