{
  "id": "126a2363-87ff-494a-8337-2e303e911ef2",
  "name": "Oh, Sister!",
  "spotifyId": "33qNPjxO1KWLOVw2tuOG7P",
  "appleId": 1787057647,
  "episodes": [
    {
      "id": "60529344-4106-4db3-a970-f71f929347c1",
      "title": "Silence is Golden",
      "description": "cw: discussion of attitudes around death, mention of violence in scripture I’m shining a light on how missionaries are prepped with coercive strategies and trained to manipulate! Today we’re learning about one of the goals from the 12-Week Training Program, “I am comfortable with silence as I teach.” I’ll give a glimpse into what this meant for me as a missionary, how I trained other missionaries on the topic, and how silence is actually in real life a very powerful thing that can be used to manipulate you. In week thirty-six, my journal entries include playing frisbee golf in my first-ever District P-day group activity, attending (virtually) the funeral service for esteemed Apostle Elder L. Tom Perry, and resolving to put my Mission President’s Wife’s phone number on speed dial when I got home. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Preach My Gospel, updated version (mine is old apparently!): Chapter 10 In-Field Training for New Missionaries: The First 12 Weeks Learn more: Heidi Priebe: What To Do About Heartbreaks (Grief) Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-10-06T10:00:00Z",
      "duration": "01:34:36.8260000",
      "explicit": false,
      "spotifyId": "6O2HcrNEAOkNVZO2SpO3Nv",
      "appleId": 1000730393337,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6O2HcrNEAOkNVZO2SpO3Nv",
        "apple": "https://podcasts.apple.com/podcast/silence-is-golden/id1787057647?i=1000730393337"
      }
    },
    {
      "id": "83c47b69-97b4-439e-9438-2d2295270cdc",
      "title": "More Cognitive Dissonance Give Me",
      "description": "cw: mention of pornography Zone Conference is once again upon us, and it’s just as toxic as ever. This week I’m focusing in on the theme of sacrificing yourself to receive the blessings of heaven, except it turns out that sacrificing and suffering can be really bad for people. I turn to the research behind Adverse Childhood Experiences, or ACEs, as a basic argument against the idea of suffering as a net positive. And in fact, it turns out that groups asking you to sacrifice is a known element of control in cults. An article by our friend Steven Hassan explains the concept of cognitive dissonance, handily connecting the Mormon Church’s obsession with sacrifice to another method of coercive control. In week thirty-five, my journal entries include luxuriating in the freedom we got from having 30 whole minutes on a P-day to wander around a parking lot and have FUN, cheerleading my new greenie through her first day of working through a fast, managing my disappointment when a Memorial Day trench-digging service project was cancelled, and unironically writing, “I’m pretty excited to be a wife \u0026 Mom. : )” Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! LDS Media Library: Praise to the Man Phoebe Hall, Brown University: Discussing The Body Keeps the Score Steven Hassan, Psychology Today: ⁠Cognitive Dissonance⁠ Learn more: Gabor Maté ACES: 5 min video American Society for the Positive Care of Children: 10 question ACE quiz Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-09-29T10:00:00Z",
      "duration": "01:58:38.3150000",
      "explicit": false,
      "spotifyId": "084J0n3367SqoFH35Yy5BC",
      "appleId": 1000729059649,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/084J0n3367SqoFH35Yy5BC",
        "apple": "https://podcasts.apple.com/podcast/more-cognitive-dissonance-give-me/id1787057647?i=1000729059649"
      }
    },
    {
      "id": "9b17e988-8e37-4558-9bc3-3cefb2c382e7",
      "title": "Your Habits Will Become Her Habits",
      "description": "cw: food shaming, discussion of death As foretold by my Sister Training Leader, I had finally been tasked with one of a missionary’s most important responsibilities—training another missionary. This week I’m discussing the gravitas surrounding the assignment to train, and I’ll also begin exploring the church’s seemingly retired In-Field Training: The First 12 Weeks program. In week thirty-four, my journal entries include worrying about my new trainee’s refusal to rest as she deals with a cold, playing the piano for a funeral service ran by (gasp!) a paid clergyman, and appreciating my companion’s willingness to get out of and “back” the car in the rain. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Church News: New Missionary In-field Training Extends MTC Experience That Helpful Reddit Post: Here’s Where “These Practices” Began Via the Way Back Machine: In-Field Training for New Missionaries: The First 12 Weeks Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-09-22T22:00:00Z",
      "duration": "01:40:26.0570000",
      "explicit": false,
      "spotifyId": "1XA0bN4j13VmgmSZuzUDvK",
      "appleId": 1000727950506,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1XA0bN4j13VmgmSZuzUDvK",
        "apple": "https://podcasts.apple.com/podcast/your-habits-will-become-her-habits/id1787057647?i=1000727950506"
      }
    },
    {
      "id": "ca5f4277-205b-4de7-a512-0f43da838f2e",
      "title": "Lose Your Self",
      "description": "A few weeks back an infamous talk came up in my journal, and today we’re unpacking it! I present to you \u0022The Fourth Missionary,\u0022 explained through the lens of psychological tactics used to manipulate and brainwash. In week thirty-three, my journal entries include giving Sister Feist her final farewell as she returns home with honor, meeting my new companion (my first trainee!), and receiving the inspirational priesthood-blessing-reminder that love is powerful because it lets us change people. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Angelito Malicse How to Spot Mind Manipulation and Brainwashing Lawrence E. Corbridge The Fourth Missionary Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-09-15T10:00:00Z",
      "duration": "01:34:38.3150000",
      "explicit": false,
      "spotifyId": "1O2srX2vzrSijKUQt6Ixi9",
      "appleId": 1000726882260,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1O2srX2vzrSijKUQt6Ixi9",
        "apple": "https://podcasts.apple.com/podcast/lose-your-self/id1787057647?i=1000726882260"
      }
    },
    {
      "id": "35ab4f8c-bf5e-4afd-a4e9-9f2e7c3b8e10",
      "title": "Motherhood: Your Purpose \u0026 Destiny",
      "description": "It’s Mother’s Day on my mission, and so I continue the theme from last week and discuss the LDS Church’s discourse on “the divine role of women.” This week I share general conference addresses that teach what a woman is meant for, what she should aspire to, what will bring her fulfillment, and where she should spend her time. Not surprisingly, these messages linger in my subconscious long after I stopped believing them. In week thirty-two, my journal entries include talking with my family for the second time on my mission, finally experiencing a big snowstorm (and getting our Jeep stuck in the snow), and receiving inspiration from God in one of his greatest and most common miracles—remembering where I left my camera. ; ) Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! 1981 LDS General Conference: The Honored Place of Women 2013 LDS General Conference: The Moral Force of Women Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-09-08T10:00:00Z",
      "duration": "01:52:34.2200000",
      "explicit": false,
      "spotifyId": "2rRQ086n0wOaOMtXOylJby",
      "appleId": 1000725501116,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rRQ086n0wOaOMtXOylJby",
        "apple": "https://podcasts.apple.com/podcast/motherhood-your-purpose-destiny/id1787057647?i=1000725501116"
      }
    },
    {
      "id": "22e93e16-2b20-4bfb-ad7c-99664cdf9a30",
      "title": "Because She was the Mother",
      "description": "cw: discussion of death and loss A big result of my missionary experience was quadrupling down on the idea that I needed to GET MARRIED and BE A MOTHER. I’ve been seeing more and more talk about this in my journal, and even in my emails home, so I’ve gotta’ talk about it once again. This week I’m drawing in the wisdom of Margi Dehlin, as she explained how orthodox Mormon teachings and culture harmed her over her life as a young woman, wife, and mother. I know this episode is a little longer but I think it’s worth listening to! In week thirty-one, my journal entries include returning to a regular two-by-two companionship after weeks in a trio, getting a chance to sing with my “real voice,” and doubling down with fasting and thought-stopping after a particularly frustrating day. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Margi Dehlin: Coming Home to Myself Sonia Johnson: From Housewife to Heretic (p. 72) LDS Church: Missionary Handbook (p. 31) Correction! Exponent II and its origins BYU Library: 1st published article of original Exponent Exponent II: History of the Publication Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-09-01T10:00:00Z",
      "duration": "01:46:46.4780000",
      "explicit": false,
      "spotifyId": "1AqlA40sMfqLWYRP9mKm9N",
      "appleId": 1000724368886,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1AqlA40sMfqLWYRP9mKm9N",
        "apple": "https://podcasts.apple.com/podcast/because-she-was-the-mother/id1787057647?i=1000724368886"
      }
    },
    {
      "id": "77cd4312-a5bd-4646-b879-c9c6faa96722",
      "title": "Polygamy, Posterity, \u0026 Perfectionism",
      "description": "cw: food shaming; discussion of stalking, suic*dality, \u0026 abuse; I swear in this episode Part of my unpacking process has drawn me to learning more about my family history—specifically, the stories of the women in my family who were first affected by the LDS church. I’ve been listening to the incredible work of Lindsey Hansen Park—the Year of Polygamy podcast—which has been (sadly) helpful with understanding my own family dynamics. This week, I’ll share how my great-great-great grandmother dealt with the difficulties of her unhappy polygamous marriage by turning to toxic perfectionism, which is passed down from generation to generation. In week thirty, my journal entries include a clothes-mending session that turns into a trauma dump, dealing with an emergency transfer, and struggling to help a young Native American Mormon woman in crisis. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Lindsay Hansen Park: A Year of Polygamy Mamie Wells Lovell: History of Caroline Ely Partridge Lyman Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-08-25T10:00:00Z",
      "duration": "00:57:24.7410000",
      "explicit": true,
      "spotifyId": "07Sp38qIHsQn3g1WzeML47",
      "appleId": 1000723423062,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07Sp38qIHsQn3g1WzeML47",
        "apple": "https://podcasts.apple.com/podcast/polygamy-posterity-perfectionism/id1787057647?i=1000723423062"
      }
    },
    {
      "id": "1697e2c1-570b-42b6-8bfb-0df921db9175",
      "title": "God Will Protect You",
      "description": "cw: discussion of stalking \u0026 fear of violence I always thought of missionaries as unstoppable messengers for God, and grew up hearing stories of how missionaries were miraculously saved from scary situations. This week, we see my cultural idea of missionary invincibility crash up against the reality of being a young woman with an obedient heart and zero tolerance for conflict. In week twenty-nine, my journal entries include splurging on artisan chocolate treats, dealing with one companion’s broken bone, and desperately gaslighting myself that I felt fine and safe after a scary interaction with a stranger. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Bailey, Exponent II: Essential Mission Prep Church Newsroom: Missionary Safety in 2024 Church Missionary Manuals: Missionary Standards for Disciples of Jesus Christ Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-07-28T22:00:00Z",
      "duration": "01:15:01.3940000",
      "explicit": true,
      "spotifyId": "3ccKrzUOrHEZVok69QuNnV",
      "appleId": 1000719557606,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ccKrzUOrHEZVok69QuNnV",
        "apple": "https://podcasts.apple.com/podcast/god-will-protect-you/id1787057647?i=1000719557606"
      }
    },
    {
      "id": "39c55ea7-2655-42dc-9ea8-1fd3200afada",
      "title": "The Trunky Trio Tripanionship",
      "description": "Although the standard grouping for missionaries is “two by two,” sometimes things come up and suddenly you’re in a TRIO. I’m kicking things off by explaining some of the ups and downs of being in a trio, as well as being with missionaries who are soon to go home. In week twenty-eight, my journal entries include actually going on a recreational hike on P-day, teaching a member with connections to a biker gang, and easily breaking into our apartment after locking ourselves out. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! PMG ch. 8 Weekly Planning PMG ch. 9 Importance of Working with Members Check out the new opera— Dark Sisters Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-07-21T10:00:00Z",
      "duration": "00:51:14.7160000",
      "explicit": false,
      "spotifyId": "0dQwXywUUqL6YdtwkxV2el",
      "appleId": 1000718292716,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dQwXywUUqL6YdtwkxV2el",
        "apple": "https://podcasts.apple.com/podcast/the-trunky-trio-tripanionship/id1787057647?i=1000718292716"
      }
    },
    {
      "id": "c3e812c2-1616-4d99-bc95-3f6380ac6a32",
      "title": "Pink Washing \u0026 The Necessary Superiority of Elders",
      "description": "Welcome to season 2! In line with my transfer to a new area, I start things out with an explanation of “pink washing,” leading into the patriarchal gender dynamics between Sisters and Elders. I found a fascinating historical timeline of LDS Sister Missionaries that was written in response to the lowering of age limits for missionary service. Dr. Radke-Moss posited that Sister Missionaries might be treated with more respect than was normal in the historical precedent; I’ll leave it up to you whether or not you believe this came true. In week twenty-seven, my journal entries include saying goodbye to everyone in my first area including my first golden investigator, being placed into a surprise tripanionship, and, accordingly, dealing with a massive tone shift in my missionary work. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Dr. Andrea Radke-Moss: An Overview of LDS Sister Missionary Service Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-07-14T10:00:00Z",
      "duration": "01:07:35.5100000",
      "explicit": false,
      "spotifyId": "0dhne5G3IKr6uzUKc3Vji3",
      "appleId": 1000717160333,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0dhne5G3IKr6uzUKc3Vji3",
        "apple": "https://podcasts.apple.com/podcast/pink-washing-the-necessary-superiority-of-elders/id1787057647?i=1000717160333"
      }
    },
    {
      "id": "8cb37b8d-fdb6-45fd-a672-7267f0677464",
      "title": "In God’s Image",
      "description": "cw: mention of dental work As a young woman trying to find myself as a sister missionary, I had a deep yearning to find my spiritual purpose—to not only feel my connection to the divine, but to see myself in the divine. Unfortunately, the Mormon theological world has almost no female representation. I’ll discuss how this environment of male-centric authority figures and spiritual philosophies lead to my increased self abandonment, as I tamped down every part of myself that didn\u0027t fit perfectly into the Church’s mould for women. This week’s journal entries include receiving personal revelation from Heavenly Father through a church broadcast, judging a woman in mourning for being “angry,” \u0026 finally getting that highly anticipated (and feared) transfer phone call... Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Amy McPhie Allebest: Why Religious Tools Don’t Work For Women Donna Lee Bowen \u0026 Camille S. Williams: Women in the Book of Mormon Erin Kane: Women less than 15% of Bible characters LDS Living: Timeline of Women’s General Conference Sessions from 1830-2022 Official Church Site: General Conference Research Guide (aka priesthood sessions) Liahona: 2015 General Women’s Session Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-07-07T10:00:00Z",
      "duration": "01:30:01.9130000",
      "explicit": false,
      "spotifyId": "5F4iGL3IHynNuWul71F21P",
      "appleId": 1000716104228,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5F4iGL3IHynNuWul71F21P",
        "apple": "https://podcasts.apple.com/podcast/in-gods-image/id1787057647?i=1000716104228"
      }
    },
    {
      "id": "1d5e2449-a739-4eb0-8038-099e2a5779cc",
      "title": "Snake Oil Skepticism \u0026 Priesthood Blessings",
      "description": "cw: incidents of racism, discussion of racism People tend to believe that “educated” and “intelligent” people would never be tricked into falling for a scam, but it turns out that we are all prone to blind spots when it comes to what is near and dear to the heart. I focus in on this idea, using the example of believing in literal spiritual healing while maintaining skepticism towards alternative essential oil medicine. This week’s journal entries include coming down with strep, getting a free haircut, \u0026 listening to uncomfortable conversations steeped in racist beliefs. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-06-30T10:00:00Z",
      "duration": "01:22:21.2700000",
      "explicit": false,
      "spotifyId": "541LQgSNkF7XrYD7enH6Dq",
      "appleId": 1000715122470,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/541LQgSNkF7XrYD7enH6Dq",
        "apple": "https://podcasts.apple.com/podcast/snake-oil-skepticism-priesthood-blessings/id1787057647?i=1000715122470"
      }
    },
    {
      "id": "25f708b9-0b1d-4e79-9b2d-a273714151de",
      "title": "The Widow\u0027s Mite",
      "description": "I’ve been saying for a while now that I want to discuss ableism and today I’m officially starting that discussion, with a focus on how the Church interacts with its elderly members. Spoilers—the church encourages the congregation to give to the church generously, while also discouraging “handouts” from the church back to the Ward members. This week’s journals include meeting a darling elderly widow, doubling down on the importance of corporate “key indicator” goals, and making pie for a random man because I am a woman and he is a man. : / Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Older Adults Living in Poverty: kff.org Principles for Providing Church Assistance: General Handbook 22.4 LDS Church Finances: wikipedia.org Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-06-16T10:00:00Z",
      "duration": "01:15:01.3420000",
      "explicit": false,
      "spotifyId": "3Ieg67F2qXfrwxXUO4DSZN",
      "appleId": 1000713076404,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Ieg67F2qXfrwxXUO4DSZN",
        "apple": "https://podcasts.apple.com/podcast/the-widows-mite/id1787057647?i=1000713076404"
      }
    },
    {
      "id": "a9f18c95-bc56-4b8f-b894-03818055a48c",
      "title": "(Financial) Sacrifice Brings Forth the Blessings of Heaven",
      "description": "We all know that “you can buy anything in this world with money” ; ), and “nothing is free.” You might think that at least going on a two-year proselyting mission for the LDS church would be free but you’d be wrong! I start today’s episode by breaking down the basics of financing a mission, with a focus on the Missionary Support Fund. This week’s journals include stressing out over a probable promotion, spacing out during my second baptism due to said stress, and eating gummy bears that tasted like cleaning products. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Primary Song: We’ll Bring the World HIs Truth Mission Prep Blog: Paying For Your Mission LDS Tools: Missionary Finances Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-05-26T10:00:00Z",
      "duration": "01:11:52.6070000",
      "explicit": false,
      "spotifyId": "68unyFokquO4nZmVWiah7i",
      "appleId": 1000709887536,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/68unyFokquO4nZmVWiah7i",
        "apple": "https://podcasts.apple.com/podcast/financial-sacrifice-brings-forth-the-blessings-of-heaven/id1787057647?i=1000709887536"
      }
    },
    {
      "id": "cbb92e4c-a09c-490c-bceb-5a05bc1ddb7e",
      "title": "Not for the Body or Belly",
      "description": "cw: discussion of restrictive eating, eating disorders, fatphobia, racism, diet culture strategies such as calorie counting Due to my journal’s constant focus on restrictive eating, it’s time we face the beast and learn about the history of fatphobia. The Church has not been silent on the topic of what is “healthiest” for people, especially women, to feed and do with their bodies, and I’m going to push back on how this messaging is not only incorrect but also harmful. This week’s journals include repenting for the sin of eating sugar, promising members that I would of course never ever leave the Church, and finally achieving the high of testifying of Joseph Smith to a nonbeliever. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! APA resource: Eating Disorders, Weight-Shaming and “Clean” Eating Hannah Carlan UCLA resource: Book Review of Strings’ “Fearing the Black Body” Amanda Montgomery UIC resource: Weight stigma and fatphobia in public health Carol Wolf LDS Ensign message: Physical Health: Weight Loss and the Word of Wisdom Recommended Reading: Sabrina Strings’ Fear the Black Body: The Racial Origins of Fat Phobia r/exmormon reddit: Self Esteem for the Latter-Day Saint Woman LDS General Conference 1978: Good Health—A Key to Joyous Living LDS Ensign message 2014: Nourishing Our Bodies and Our Spirits LDS Missionary Wellness Manual: Bodyweight Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-05-19T10:00:00Z",
      "duration": "01:33:10.6220000",
      "explicit": false,
      "spotifyId": "3rrzCLplE5Fh9nWTCV6fYu",
      "appleId": 1000708977471,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3rrzCLplE5Fh9nWTCV6fYu",
        "apple": "https://podcasts.apple.com/podcast/not-for-the-body-or-belly/id1787057647?i=1000708977471"
      }
    },
    {
      "id": "42732716-47f8-4531-8dad-ce70e4358f54",
      "title": "Put Your Shoulder to the Wheel",
      "description": "cw: mention of dental problems, discussion of restrictive eating Today we dive into the expectations of missionary WORK, reading sections of the White Handbook and Preach My Gospel that taught me to work myself to the bone, without proper rest or self care. This week’s journals include teaching my first lesson to a “drunk” investigator, reveling in the surprise visit from my mission president and his wife, and discovering the reason the Lord sent me to Scranton. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Preach My Gospel: Developing Christlike Attributes Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-05-12T10:00:00Z",
      "duration": "01:47:11.7910000",
      "explicit": false,
      "spotifyId": "3bJjffxgTfaxwSSAZWS3bm",
      "appleId": 1000708103800,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3bJjffxgTfaxwSSAZWS3bm",
        "apple": "https://podcasts.apple.com/podcast/put-your-shoulder-to-the-wheel/id1787057647?i=1000708103800"
      }
    },
    {
      "id": "b8679a16-ee49-42ba-bc99-661b01453b48",
      "title": "Blessed are the Hatemakers",
      "description": "cw: discussion of homophobia, mention of violent death \u0026 su*cide, of food restriction, \u0026 discussion of dental problems I kick things off today by discussing the LDS Church’s practice of demanding people play nice while simultaneously kicking them while they’re down. Politely, of course. I reference a news broadcast they did in 2015 that is focused on the topics of \u0022religious freedom and nondiscrimination,\u0022 but this wasn\u0027t just a single card in their hand—this is the playbook. This week’s journals include briefly freezing the pipes in our apartment’s kitchen, getting so many Valentine’s Day treats, and discovering a problem with my dental implant. \u0026#x1f62c; Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Youtube: Thought Slime’s Video Essay Transcript: News Conference on Religious Freedom and Nondiscrimination YouTube: News Conference on Religious Freedom and Nondiscrimination Press Release: News Conference on Religious Freedom and Nondiscrimination Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-05-05T10:00:00Z",
      "duration": "01:13:17.3740000",
      "explicit": true,
      "spotifyId": "5UE9prwmuuWqDmjglDkX1N",
      "appleId": 1000706343881,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5UE9prwmuuWqDmjglDkX1N",
        "apple": "https://podcasts.apple.com/podcast/blessed-are-the-hatemakers/id1787057647?i=1000706343881"
      }
    },
    {
      "id": "a758fc16-5df1-4c4d-af50-0149727a437e",
      "title": "Love Bombing \u0026 The Missionary Lessons",
      "description": "Today I’ll begin to cover the topics taught in the missionary lessons, as well as the instructions on how missionaries are to interact with people they teach. And, I’ll make my case for how these practices line up with the idea of undue influence, or coercive control, by using tactics like love bombing and withholding critical information. This week’s journals include calling my past self out for wasting time watching Netflix, developing a new unhealthy obsession with the popular missionary talk The Character of Christ, and finding my companion’s lost (!!!!) nametag. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Reddit: Love Bombing Freedom of Mind: Undue Influence Instagram: Love Bombing Preach My Gospel: Ch. 3 , Ch. 10 Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 mandolin sample from porch.wav by Jackie-makes-noiz -- https://freesound.org/s/545744/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-04-28T10:00:00Z",
      "duration": "01:41:04.6920000",
      "explicit": false,
      "spotifyId": "1TdeujZmNBPzvedSgaLdjF",
      "appleId": 1000705247293,
      "subjects": [
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1TdeujZmNBPzvedSgaLdjF",
        "apple": "https://podcasts.apple.com/podcast/love-bombing-the-missionary-lessons/id1787057647?i=1000705247293"
      }
    },
    {
      "id": "d32d49e8-173a-4782-bf0f-ea4644d460be",
      "title": "Good, Better, and Best",
      "description": "According to my mission leaders, there was not only a right and a wrong option for every choice, but there was always a good, better, and best choice. Today I discuss how this kind of thinking encourages religious scrupulosity. This week’s journals include a surprisingly low number of active young single adults in the area, several days of infuriating illness that kept preventing me from working hard, and the discovery of one of our “golden” investigators. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Recommended Listening: Conspiracy Primary Song: Choose the Right Way Hymn: Choose the Right McLean Hospital: Understanding Religious Scrupulosity Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-04-21T10:00:00Z",
      "duration": "01:38:25.6840000",
      "explicit": false,
      "spotifyId": "0Rd1V1tvEZClghFuv0ctMF",
      "appleId": 1000704288654,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Rd1V1tvEZClghFuv0ctMF",
        "apple": "https://podcasts.apple.com/podcast/good-better-and-best/id1787057647?i=1000704288654"
      }
    },
    {
      "id": "80659245-c171-4d4a-9d21-0b4f4ef9d646",
      "title": "The Baptismal Interview",
      "description": "cw: mention of r*pe, inc*st, discussion of abortion In line with this week’s focus on an investigator preparing for her baptism, today I’ll talk about one of the requirements for baptism into the LDS Church: the Baptismal Worthiness Interview. Since my investigator was a woman, I’ll focus in on the interview’s focus of female sexual purity. This week’s journal entries include actually written-out doubt about the inspiration to do missionary work in Ellendale, getting amped up by how cool a middle-aged member is since he wears a CTR ring, and the surprisingly anti-climactic first-ever-in-my-mission baptism. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Church handbook: Abortion Reddit: abortion in interview for elders Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-04-14T10:00:00Z",
      "duration": "01:28:50.5730000",
      "explicit": true,
      "spotifyId": "2v4fEw5So3PrlEzMEVFeNL",
      "appleId": 1000703445561,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2v4fEw5So3PrlEzMEVFeNL",
        "apple": "https://podcasts.apple.com/podcast/the-baptismal-interview/id1787057647?i=1000703445561"
      }
    },
    {
      "id": "2f9b4265-fddc-47c9-ad40-1e5d130b4cf9",
      "title": "The Patriarchy: A Proclamation to the World",
      "description": "cw: spouse abuse \u0026 murder, diet culture, child endangerment I believe that Mormon theology enshrines patriarchy as god-given doctrine, and I will die on this hill! Today we’re learning about the document The Family: A Proclamation to the World, and I discuss misogyny, patriarchy, feminism, and how they tie into the church’s teachings. In week sixteen, my journal includes the affirmation of conditional love and homophobia (barf!), more stressing about not being a good enough missionary, and a show-down between my companionship vs. our missionary leaders. Spoilers, we were the ones to back down. Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! wikipedia misogyny: helpful breakdown wikipedia patriarchy: helpful breakdown The Family Proclamation: official church website Women Are Doormats: reddit post Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-04-07T10:00:00Z",
      "duration": "01:53:36.7050000",
      "explicit": true,
      "spotifyId": "7KGh1Lb8EQxFFNA7G5nJwO",
      "appleId": 1000702501894,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7KGh1Lb8EQxFFNA7G5nJwO",
        "apple": "https://podcasts.apple.com/podcast/the-patriarchy-a-proclamation-to-the-world/id1787057647?i=1000702501894"
      }
    },
    {
      "id": "39bee8ca-4edc-40ff-9bc4-b5f9cf19f6a6",
      "title": "Don\u0027t You Dare Go Home",
      "description": "CW: discussion of dying for the church, food insecurity, food restriction. We start this week off with a reflection on a classic Elder Holland address to missionaries, with the chilling threat that \u0022I have chains in every room.\u0022 Yes, really! And of course, in this fifteenth week’s journal entries we once again come across the Mormon Message “Mountains To Climb,” so we’ll look into that message as well. This week’s experiences include the loss of my first-ever investigator, a fast from “disobedience,” the assistance of a family moving in -10 degree winter weather, and the decision to send personalized propaganda to my family in my regular letters with them. : / Support me monthly on patreon:D patreon.com/AllyChristiansen Make a one-time donation on Ko-fi: https://ko-fi.com/allychristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! recent reddit post: r/exmormon Don’t You Dare Go Home: ldsminds.com further reading: Don’t You Dare Go Home Mountains to Climb: video Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-03-31T10:00:00Z",
      "duration": "01:45:26.2820000",
      "explicit": false,
      "spotifyId": "3OeA0iIOhcc3dRAe75sWgH",
      "appleId": 1000701562663,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3OeA0iIOhcc3dRAe75sWgH",
        "apple": "https://podcasts.apple.com/podcast/dont-you-dare-go-home/id1787057647?i=1000701562663"
      }
    },
    {
      "id": "31cbe0c2-4b53-4cd8-80ea-87fdd875ea7c",
      "title": "Suffer the Children to Suffer",
      "description": "CW: heavy swearing. discussion of child abuse, child endangerment, violence, death, food insecurity, food restriction. In line with some darker themes that begin to pop up in this week’s journal entries, today I’m beginning with a brief recap of the LDS Church’s history of dealing with both perpetrators and survivors of abuse, children in particular. In addition to the heartbreaking situation that inspired today’s rant, this fourteenth week’s journal entries include putting a positive spin on running out of money for groceries, dealing with true North Dakota winter temperatures, and daydreaming of my future, carefree life as a housewife. Support me on patreon:D patreon.com/AllyChristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! Faith-safe resource for finding LDS offenders in your area: floodlit.org Mormon Stories Episode: Mormon Church Facing Sex Abuse \u0026 Trafficking Lawsuits Sam Young’s Website: Protect LDS Children 2008 First Presidency Letter: Responding to Abuse Current Child Protection Training Website: Protecting Children \u0026 Youth Church Handbook: 38.6.2 Utah Code 602: Child abuse and neglect reporting requirements -- Exceptions LDS song: A Child’s Prayer Composer’s Website: Consider the Lilies Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-03-24T10:00:00Z",
      "duration": "01:56:58.7620000",
      "explicit": true,
      "spotifyId": "5xL2TBZVB7y8lSiyvYetgd",
      "appleId": 1000700580625,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Human Trafficking"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5xL2TBZVB7y8lSiyvYetgd",
        "apple": "https://podcasts.apple.com/podcast/suffer-the-children-to-suffer/id1787057647?i=1000700580625"
      }
    },
    {
      "id": "53764faa-c799-4c08-8e5f-13787358ed28",
      "title": "\u0027Tis the Season for Conversion",
      "description": "CW: discussion of child abuse, discussion of over eating \u0026 food restriction It’s Christmas time! In this episode I’ll begin by explaining what Christmas means for missionaries—spoiler alert, it’s not a day to rest or party. After discussing the He is the Gift campaign, I’ll read the exhortations from my mission president about what to do during the Christmas season. This thirteenth week’s journal entries include facing my first Christmas away from home as a missionary, dealing with a scheduled baptism imperiled by sudden illness, and reckoning with the strict rules to limit contact with children while being asked to teach a primary class. Support me on patreon:D patreon.com/AllyChristiansen This project is very rewarding and very time consuming. Your financial support makes this possible, thank you! He is the Gift: ⁠mini lesson ⁠ He is the Gift: ⁠video ⁠ Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-03-17T10:00:00Z",
      "duration": "01:05:57.4460000",
      "explicit": true,
      "spotifyId": "3ld8wqGokftoXelUNjyX0L",
      "appleId": 1000699483034,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3ld8wqGokftoXelUNjyX0L",
        "apple": "https://podcasts.apple.com/podcast/tis-the-season-for-conversion/id1787057647?i=1000699483034"
      }
    },
    {
      "id": "19ad2f71-c24f-443f-8348-1d5717d3a6a7",
      "title": "Approved (\u0026 Unapproved) Reading Material",
      "description": "Today I dial into the concept of the Mormon church’s list of Approved Reading Materials for missionaries, which includes a small “Missionary Reference Library” and not much else. With the help of the beloved BITE model, I argue that this is yet another aspect of inappropriate control which led to my unhealthy personal development. This twelfth week’s journal entries include a day of distraction due to a “Ke$ha-style” Mormon kids-bop-style cd, a district meeting with the exciting focus on my favorite topic of the Atonement, and encouraging and receiving the trauma dumping of a random lady in the hopes of converting her to Mormonism. In an exciting turn of events, I even crack open my old set of mission scriptures! -Approved Missionary Reading List: latterdaysaintmissionprep.com -Dr. Steven Hassan’s Bite Model handout: BITE model Support me on patreon:Dpatreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-03-10T10:00:00Z",
      "duration": "01:15:44.4440000",
      "explicit": false,
      "spotifyId": "7FMudZbZ3wfd4xthZ1LfWD",
      "appleId": 1000698563845,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7FMudZbZ3wfd4xthZ1LfWD",
        "apple": "https://podcasts.apple.com/podcast/approved-unapproved-reading-material/id1787057647?i=1000698563845"
      }
    },
    {
      "id": "e8738fb1-fbe4-453b-a84b-351cd48b9129",
      "title": "Power in the Priesthood Be Upon Me",
      "description": "CW: discussion of grooming, and I swear heavily in this episode After weeks of holding it in, I can no longer keep myself from “dropping the f bomb” as I share a deeply formative priesthood blessing experience from my freshman year at BYU. I do a deep dive into the ramifications of power dynamics built into the church’s male-exclusive priesthood structure, explaining how much it messed up my own capacity for clear thought and judgment, among other things. Of course, my journal entries this week also include priesthood blessings for different people we were in teaching, as well as a firm denouncement of the Catholic church building as creepy (I know, I know) and a sudden move to a new town. Support me on patreon:Dpatreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-03-03T11:00:00Z",
      "duration": "01:43:45.2400000",
      "explicit": true,
      "spotifyId": "678QBzQCALVYeJBrOwuSTR",
      "appleId": 1000697369185,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/678QBzQCALVYeJBrOwuSTR",
        "apple": "https://podcasts.apple.com/podcast/power-in-the-priesthood-be-upon-me/id1787057647?i=1000697369185"
      }
    },
    {
      "id": "48ce40d6-7a3c-4e8e-ac69-f051c93f0533",
      "title": "Lock Your Heart",
      "description": "CW: discussion of sex, mention of r*pe culture Today I begin to dive into the strange world of Mormon sexual repression and control, with a discussion on Spencer Kimball’s infamous talk “Lock Your Heart.” My journal entries from week ten include even more worries about gaining weight, a micro-aggression around race and music, and the celebration of finding a place to “do service” as a missionary. Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. -Check out the whole Lock Your Heart talk: Lock Your Heart Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-02-24T11:00:00Z",
      "duration": "00:55:45.2140000",
      "explicit": true,
      "spotifyId": "1GLzNfjXhjQ5VyIYub5HDr",
      "appleId": 1000695504252,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1GLzNfjXhjQ5VyIYub5HDr",
        "apple": "https://podcasts.apple.com/podcast/lock-your-heart/id1787057647?i=1000695504252"
      }
    },
    {
      "id": "d50d70e6-1d8a-4624-8f0c-74a8757d0d21",
      "title": "The Virtue of Thought Stopping",
      "description": "I begin by connecting cult “mind control” techniques with the Mormon practice of thought stopping through music, along with the idea that one can use holy music to “keep out the devil.” (“Just hum your favorite hymn, sing out with vigor and vim...”) My journal entries from week nine include the celebration of a Sister Missionary’s 21st birthday, the misunderstanding that dealing with my symptoms of ADHD resulted in a “miracle,” and being taken down a peg by a self-righteous member missionary we had “abandoned.” Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. -check out Dr. Hassan’s pdf on undue influence (thought control): BITE model -check out the song: \u0022 Hum Your Favorite Hymn \u0022 Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-02-17T11:00:00Z",
      "duration": "01:13:45.5600000",
      "explicit": false,
      "spotifyId": "4yVMVxLLosvEiKeynLzTb1",
      "appleId": 1000693009236,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Cult Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4yVMVxLLosvEiKeynLzTb1",
        "apple": "https://podcasts.apple.com/podcast/the-virtue-of-thought-stopping/id1787057647?i=1000693009236"
      }
    },
    {
      "id": "e0c4830a-c60e-40e8-9bae-61d49e3c08f0",
      "title": "Dress \u0026 Grooming",
      "description": "Today I’ll cover one of the basic rules of missionary life: what (not) to wear. ; ) My journal entries from week eight include an admission that “missions are a good pressure cooker,” the story of one member’s inter-racial adoption, and my final days with my trainer before she is sent home to be released with honor. -check out Tara Herbert’s podcast: ⁠pouty mouth ⁠ -check out the YW lesson on marriage: ⁠ r/exmormon ⁠ -check out a digitized White Handbook: pdf Support me on patreon:Dpatreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-02-10T11:00:00Z",
      "duration": "01:01:27.0260000",
      "explicit": false,
      "spotifyId": "4XRjoSR7KJCy4nPIJYSeV6",
      "appleId": 1000690806269,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4XRjoSR7KJCy4nPIJYSeV6",
        "apple": "https://podcasts.apple.com/podcast/dress-grooming/id1787057647?i=1000690806269"
      }
    },
    {
      "id": "c63dee71-fe22-4efc-9054-00f7ea546ef0",
      "title": "Smile that Frown Away",
      "description": "In line with last week’s discussion of emotional manipulation, today I discuss the cultural idea of changing one’s own internal emotional landscape, as well as the results as I was trying to do it myself. My journal entries include friendly cats acting as evidence of our divine calling, going on my first “exchanges” with my Sister Training Leader, and the painful realization that I’ve never fully confided in anyone. LDS Music Library: \u0022Smiles\u0022 https://www.churchofjesuschrist.org/media/music/songs/smiles?lang=eng Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-02-03T11:00:00Z",
      "duration": "01:15:28.1430000",
      "explicit": false,
      "spotifyId": "7LrRkMuoVSLVRJ2Ay7i0v7",
      "appleId": 1000688497981,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7LrRkMuoVSLVRJ2Ay7i0v7",
        "apple": "https://podcasts.apple.com/podcast/smile-that-frown-away/id1787057647?i=1000688497981"
      }
    },
    {
      "id": "a809a4f4-d4e0-4e71-9648-b0038f85f73c",
      "title": "Manufacturing the Spirit",
      "description": "CW: discussion of restricted eating Today we’re focusing in on the practice of using emotionally manipulative language to manufacture \u0022the Spirit.” In this sixth week, my journal entries include trying to track down a potential investigator at her workplace, dealing with the lack of control over what we ate as missionaries (as well as the pressure to look a certain way as women), and contemplating gender-appropriate hobbies to pursue in life after my mission. Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-01-27T11:00:00Z",
      "duration": "01:02:39.8300000",
      "explicit": false,
      "spotifyId": "28LX436IouLXh5jo0seBg6",
      "appleId": 1000685634837,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/28LX436IouLXh5jo0seBg6",
        "apple": "https://podcasts.apple.com/podcast/manufacturing-the-spirit/id1787057647?i=1000685634837"
      }
    },
    {
      "id": "60e059a8-3c62-491f-987a-fd93185a711b",
      "title": "Sight \u0026 Sound",
      "description": "CW: discussion of overeating I open with a refresher on the rule to always stay within Sight \u0026 Sound of your mission companion, as we begin to see the effects of my constant external and internal surveillance. My fifth week begins with a detailed review of meeting notes from my first Quad Zone Conference, a commitment to stop the “habit” of complaining, and a moment of appreciation for the sacrifices Utah Mormons make when they move elsewhere for missionary work. Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-01-20T11:00:00Z",
      "duration": "01:32:32.0390000",
      "explicit": false,
      "spotifyId": "6un9zNM20usDvype1AtuhO",
      "appleId": 1000684686852,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6un9zNM20usDvype1AtuhO",
        "apple": "https://podcasts.apple.com/podcast/sight-sound/id1787057647?i=1000684686852"
      }
    },
    {
      "id": "ce2e91f2-449c-434e-8e95-ade988dc0d94",
      "title": "Every Good (or Anxious) Thought",
      "description": "Take a deep breath and pull on your serious boots, things start to get real as I deliver my soapbox on how the mission environment encourages neurotic religious scrupulosity. This week’s journal entries include the strange “love at first sight” (aka we were best friends in our past lives and we’ll be best friends forever) missionaries can have with people they just met, the ups and mostly downs of opening up a new town, and as always, the constant disappointment of inexact obedience. Examples of scrupulosity from https://scrupulosity.com/scrupulosity/ Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-01-13T11:00:00Z",
      "duration": "01:03:37.7950000",
      "explicit": false,
      "spotifyId": "1YEaPotZLo5TBZe5GeFYju",
      "appleId": 1000683769829,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YEaPotZLo5TBZe5GeFYju",
        "apple": "https://podcasts.apple.com/podcast/every-good-or-anxious-thought/id1787057647?i=1000683769829"
      }
    },
    {
      "id": "7fdea1ed-eba9-49b5-8370-0d3b6aac5f98",
      "title": "The Mission Assignment",
      "description": "CW: discussion of over-eating This episode unpacks my third week as a Sister Missionary. I start by sharing the mythology around and assignment of mission areas, and then we dive into my journal entries from that week. This week\u0027s journal entries include going to my first area and meeting my trainer, the attempted transplant of Utah Mormon culture into rural North Dakota, and my first experience of being over-fed for brownie points. Pun intended. ; ) Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2025-01-06T11:00:00Z",
      "duration": "00:53:34.4450000",
      "explicit": false,
      "spotifyId": "328zKfug33CzzAljPphn0n",
      "appleId": 1000682860830,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/328zKfug33CzzAljPphn0n",
        "apple": "https://podcasts.apple.com/podcast/the-mission-assignment/id1787057647?i=1000682860830"
      }
    },
    {
      "id": "fc89c3ac-4c7a-49e8-b13a-b3aa50e764c7",
      "title": "The MTC",
      "description": "This episode covers the second week of my time as a Sister Missionary. I give context for my time in the MTC (Missionary Training Center), then share my journal entries from that week. Covered topics include important family events that missionaries miss, the unspoken social beliefs around why a missionary would go home early, \u0026 the absolute naive audacity Mormon missionaries have regarding the trauma dumping that happens to people seen as authority figures. Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2024-12-30T11:00:00Z",
      "duration": "01:05:24.7930000",
      "explicit": false,
      "spotifyId": "2DiRQ4ELcWLPm3AuckIIfX",
      "appleId": 1000682124134,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2DiRQ4ELcWLPm3AuckIIfX",
        "apple": "https://podcasts.apple.com/podcast/the-mtc/id1787057647?i=1000682124134"
      }
    },
    {
      "id": "4637ae44-3db2-4962-848f-146fa59adb6d",
      "title": "My Purpose as a Missionary - pilot!",
      "description": "CW: mention of suicide In this first episode I explain my motivation for publicly sharing my personal journals. After explaining the \u0022Missionary Purpose,\u0022 I dive into the first week of my Mormon Mission with life in the MTC. Support me on patreon:D patreon.com/AllyChristiansen Written, read, edited, \u0026 produced by Ally Finlinson Christiansen. Music credits: Clown Music by Seth_Makes_Sounds -- https://freesound.org/s/677166/ -- License: Creative Commons 0 Church Music by Seth_Makes_Sounds -- https://freesound.org/s/678022/ -- License: Creative Commons 0",
      "release": "2024-12-23T20:37:03Z",
      "duration": "00:24:53.5770000",
      "explicit": false,
      "spotifyId": "5qF9svpo0HLcawY2qoQYZl",
      "appleId": 1000681468284,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5qF9svpo0HLcawY2qoQYZl",
        "apple": "https://podcasts.apple.com/podcast/my-purpose-as-a-missionary-pilot/id1787057647?i=1000681468284"
      }
    }
  ]
}