{
  "id": "4d292bdc-84ae-4235-a87f-8f72c953a3b9",
  "name": "Old Money Mansions",
  "youTubeChannelId": "UCb7-IKPS4DHQd2DBbwD39pA",
  "episodes": [
    {
      "id": "9813a867-29e1-4b3c-9ff2-8a2ccbdab720",
      "title": "The Gilded Age Mansion That Became A Cult Leader\u0027s \u0022Heaven\u0022: Woodmont",
      "description": "Quaker steel magnate Alan Wood Junior built the Gilded Age mansion Woodmont château for $1 million in 1892 to survey his Conshohocken furnaces, then sold for $75,000 in 1953 to Father Divine who claimed to be God, with 18 elderly followers still setting his place at the banquet table daily since his 1965 death.\n\n-------------------\n\nGain FREE access to secret full-length episodes on architecture and wealthy family history \u0022too scandalous for YouTube\u0022 by joining our newsletter: https://www.substack.com/@oldmoneyluxury\n\n-------------------\n\nTIMESTAMPS\n0:00 Introduction\n1:10 CHAPTER ONE: The Table That Waits\n5:03 CHAPTER TWO: Fire and Iron\n8:56 CHAPTER THREE: Biltmore\u0027s Echo\n12:59 CHAPTER FOUR: The Rooms He Left Behind\n16:41 CHAPTER FIVE: The Builder of Heavens\n20:29 CHAPTER SIX: The Mount of the House of the Lord\n\n-------------------\n\nAlan Wood Junior was born in Philadelphia on July 6, 1834 representing the third generation of a family that traced from James Wood\u0027s 1792 smithy near Hickorytown, Pennsylvania to commanding one of the nation\u0027s most successful independent steel operations.\n\nAfter attending Philadelphia\u0027s Central Institute, the 17-year-old assumed charge of the Delaware Iron Works in 1851, with the family philosophy demanding a Wood always live on-site to manage operations personally.\n\nIn 1885 the company incorporated as the Alan Wood Iron and Steel Company with Alan Junior serving as treasurer, and at 54 he retired from daily operations to travel Europe and contemplate something more permanent than quarterly production figures.\n\nIn the early 1890s he acquired three contiguous parcels totaling over 400 acres on the highest elevation in Montgomery County rising 475 feet above tidewater, commanding unobstructed views for 15 miles including his family\u0027s industrial complex in Conshohocken directly below.\n\nHe hired William Lightfoot Price, a fellow Quaker who had designed the Kenilworth Inn near Asheville in 1890-1891 gaining access to Richard Morris Hunt\u0027s Biltmore château under construction nearby.\n\nPrice specified local Wissahickon schist for walls articulated with Indiana limestone trim, and Alan Wood Junior imported Italian craftsmen to execute intricate carvings with final cost approaching $1 million—equivalent to over $30 million today.\n\nThe Great Hall rises over 50 feet to the pyramidal roof\u0027s peak with an immense limestone fireplace bearing the inscription \u0022where no wood is, there the fire goeth out\u0022—architectural wordplay on the family name from Proverbs.\n\nAlan Wood Junior occupied these rooms for less than a decade, dying in 1902, and his widow Mary sold to nephew Richard G. Wood who maintained the estate through the 1920s before economics forced subdivision.\n\nJ. Hector McNeal purchased the 73-acre core in 1929, and when his wife died in 1952 executors honored her wish to offer the château to Father Divine\u0027s religious movement.\n\nFather Divine purchased Woodmont for $75,000 cash in 1953, consecrating it as \u0022The Mount of the House of the Lord\u0022 on September 10, 1953 and declaring it fulfilled biblical prophecy from Isaiah.\n\nBy the mid-1930s Father Divine\u0027s movement generated an estimated $10,000 weekly in donations with over $15 million in real estate including the Divine Lorraine in Philadelphia purchased in 1948 for $485,000 cash—one of America\u0027s first racially integrated hotels.\n\nOn September 10, 1965 at 2:20 AM Father Divine died in the master bedroom from lung congestion, arteriosclerosis and diabetes at approximately age 89, and his widow Mother Divine assumed leadership for 52 more years.\n\nBetween 1966 and 1970 followers constructed the Shrine to Life housing Father Divine\u0027s body in a bronze coffin, and in 1971 Jim Jones arrived claiming Father Divine\u0027s spirit now resided in his body before Mother Divine ordered him off the property.\n\nMother Divine died in 2017 at age 91, and 18 elderly followers still maintain the 32-room château setting Father\u0027s place at the banquet table each morning with fresh flowers on his desk.\n\nThe Alan Wood Steel Company filed for bankruptcy in 1977, and the National Park Service designated Woodmont a National Historic Landmark in 1998 recognizing it as one of the finest château-style houses of 1890s America.",
      "release": "2026-01-11T15:00:16Z",
      "duration": "00:24:23",
      "explicit": false,
      "youTubeId": "4aUCmem3w4w",
      "subjects": [
        "International Peace Mission movement",
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=4aUCmem3w4w"
      }
    }
  ]
}