{
  "_ts": 0,
  "id": "db4ed178-5292-4849-affc-c089735f72ef",
  "name": "Old Money Allure",
  "youTubeChannelId": "UCVMHhPlUyHpgkzJWtfZ5j5g",
  "episodes": [
    {
      "id": "936641c4-2945-4c7a-a0a6-91f2abc7ccd6",
      "title": "The $28 Billion Heiresses Who Funded A Sex Cult: The Bronfman Sisters",
      "description": "They could buy anything except purpose.\n\nFour private jets sat in their hangars while the Bronfman sisters sought fulfillment through a self-help organization that would eventually face federal racketeering charges.\n\n----------------------------------\n\nThe \u0022Psychic\u0022 Princess Who Courts Controversy: Princess Märtha Louise of Norway -- https://youtu.be/AcqPoV4KcHE\n\n----------------------------------\n\nMary Astor\u0027s Purple Diary: The Scandal That Almost Destroyed Hollywood\u0027s Leading Lady -- https://youtu.be/0y8ORQl9tjs\n\n----------------------------------\n\nTIMESTAMPS\n0:00 Introduction\n1:26 Chapter 1: Booze, Billions, and Birthright\n6:05 Chapter 2: From Equestrian Dreams to Cult Extremes\n11:04 Chapter 3: Bankrolling a Nightmare\n17:00 Chapter 4: The Fall from Grace\n\n----------------------------------\n\nClare and Sara controlled billions from their grandfather\u0027s Seagram liquor fortune yet remained spiritually impoverished, creating the perfect psychological vulnerability for a predatory guru to exploit.\n\nTheir money funded fifty million dollars in aggressive litigation against critics, covered Raniere\u0027s disastrous sixty-five million dollar commodities trading losses, and provided the real estate where women were eventually held in conditions federal prosecutors compared to forced labor.\n\nEdgar Bronfman Senior watched helplessly as his daughters channeled their inheritance into an organization he publicly labeled a \u0022cult\u0022 – a denunciation that only strengthened their resolve to prove their loyalty to Keith Raniere.\n\nTwo heiresses to one of North America\u0027s greatest fortunes spent one hundred fifty million dollars funding an organization that permanently marked women with its leader\u0027s initials.\n\nThe Bronfman fortune began when their grandfather Samuel—whose surname appropriately translates from Yiddish as \u0022liquor-man\u0022—founded Distillers Corporation Limited in Montreal in 1924, thriving during American Prohibition when his legally produced alcohol mysteriously found its way across the border.\n\nBy 1978, the Bronfman wealth had swelled to an estimated seven billion dollars—approximately twenty-eight billion in today\u0027s currency—making them one of North America\u0027s richest families and establishing a dynasty that spanned the globe.\n\nClare Webb Bronfman, born in 1979, and Sara Bronfman, born approximately two-and-a-half years earlier, were daughters of Edgar Bronfman Sr. and his third wife, Rita Webb—an Englishwoman whose father owned a pub in Essex.\n\nThis cosmopolitan yet rootless upbringing left both sisters searching for meaning despite their extraordinary privilege—access to private jets, elite education, entrée to the highest social circles, and the expectation they would eventually take their place among the global elite.\n\nIn 2001, twenty-five-year-old Sara Bronfman walked into her first NXIVM seminar searching for meaning and walked out with a newfound purpose that would eventually cost her family millions.\n\nClare was immediately captivated by NXIVM\u0027s teachings and Raniere\u0027s supposed wisdom, quickly becoming one of his most devoted followers and eventually abandoning her equestrian career to dedicate herself fully to NXIVM.\n\nBetween 2005 and 2018, the Bronfman sisters channeled an estimated one hundred fifty million dollars into NXIVM and Raniere\u0027s various ventures—a staggering sum that could have funded multiple hospitals, universities, or humanitarian programs around the world.\n\nThe sheer magnitude of their financial support became apparent when they covered an astonishing sixty-five point six million dollars of Raniere\u0027s nearly seventy million in commodities market losses—a financial disaster that would have bankrupted most investment funds but was simply absorbed by the Bronfman fortune.\n\nNXIVM\u0027s carefully constructed façade crumbled in October 2017 when the New York Times published a devastating exposé titled \u0022Inside a Secretive Group Where Women Are Branded,\u0022 revealing how women in DOS were permanently marked with Keith Raniere\u0027s initials in painful ceremonies using a cauterizing pen.\n\nIn July 2018, Clare Bronfman was arrested in New York City and charged with racketeering conspiracy, identity theft, and money laundering—forcing the heiress who had funded lawsuits against NXIVM critics to face her own criminal indictment.\n\nOn September 30, 2020, Judge Nicholas Garaufis delivered a sentence that sent shockwaves through the courtroom: six years and nine months in prison—triple the maximum under federal guidelines and far beyond the twenty-one to twenty-seven months recommended by sentencing calculations.",
      "release": "2025-05-28T15:42:02Z",
      "duration": "00:23:19",
      "explicit": false,
      "youTubeId": "UyI0qx2RsmU",
      "subjects": [
        "NXIVM"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=UyI0qx2RsmU"
      }
    }
  ]
}