{
  "id": "038abba6-51ce-4443-b648-7ed21369fb7f",
  "name": "Old Money Luxury",
  "youTubeChannelId": "UCk5M6DI3_uollQflghQB4lg",
  "episodes": [
    {
      "id": "3f8a02f4-8779-4d1b-9895-7ec31a6a2918",
      "title": "The \u0022Old Money\u0022 Dynasty Who Gave Millions To A Cult Leader: The de Védrines",
      "description": "The de Védrines—a French \u0022old money\u0022 dynasty of Protestant nobles going back centuries who owned château of Martel near Monflanquin in southwest France—lost 4.5-6 million euros and their ancestral estate to Thierry Tilly, a self-styled guru who starting in the late 1990s convinced eleven family members they were under attack from Freemasons and paedophile rings, isolating them in darkened rooms without clocks before Christine de Védrines escaped in 2009, triggering Tilly\u0027s 2013 conviction for abuse of weakness and ten-year prison sentence.\n\n------------------------------\n\nGain FREE access to secret full-length episodes on wealthy families \u0022too scandalous for YouTube\u0022 by joining our newsletter: https://www.substack.com/@oldmoneyluxury\n\n------------------------------\n\nTIMESTAMPS\n0:00 Introduction\n1:13 Chapter One: The Château and Its Burdens\n4:36 Chapter Two: The Roots of Susceptibility\n8:23 Chapter Three: The Man Who Mapped Their Wounds\n11:55 Chapter Four: The Siege That Existed Only in His Words\n15:24 Chapter Five: Darkened Rooms and Drained Accounts\n18:56 Chapter Six: The Woman Who Broke the Spell\n\n------------------------------\n\nThe de Védrines belonged to Protestant nobility of southwest France, a distinct social stratum maintaining status through land and local influence rather than proximity to Versailles\u0027s Catholic aristocracy.\n\nTheir holdings included the château of Martel near Monflanquin in Lot-et-Garonne department, accumulated through inheritance and intra-clan arrangements spanning centuries with fragmented ownership among an aging matriarch, adult children, and grandchildren.\n\nBy the late twentieth century familiar pressures accumulated as châteaux became expensive to maintain, taxes consumed diminishing returns, and decisions about what to sell stirred buried rivalries that polite family dinners could no longer suppress.\n\nProtestant noble families in regions like Lot-et-Garonne had survived centuries of persecution following the Edict of Nantes in 1598, developing characteristics of pride combined with discretion and investing deeply in lineage while remaining suspicious of attention.\n\nThierry Tilly arrived in the late 1990s presenting himself as consultant, security expert, and fixer with access to discreet networks, hinting at intelligence work and connections to shadowy orders whose influence supposedly shaped events invisible to ordinary citizens.\n\nHe studied each individual with surgical precision, identifying the solitary and emotionally isolated, those trapped in unhappy marriages, those worried about health or professional failure, offering explanations tailored to their private fears.\n\nTilly constructed an elaborate narrative claiming the de Védrines were under attack from a sprawling coalition including Freemasons, corrupt tax inspectors, occult networks, and paedophile rings who supposedly plotted to seize their children and property.\n\nHe told the elderly matriarch she had played a crucial resistance role during World War II as a hidden heroine whose courage had been concealed by shadowy forces for decades—a story entirely invented but irresistible.\n\nFrom 2001 onward Tilly drew eleven family members into a progressively closed world, convincing them that remaining together inside their château was the only way to stay safe before moving them to rented accommodation in Oxford, England.\n\nFamily members were required to remain for long periods in darkened rooms with no clocks, deprived of normal markers of time and routine with telephones monitored or removed, correspondence filtered, and visits from non-aligned relatives forbidden.\n\nHe orchestrated systematic liquidation of the family\u0027s material base, persuading them that their château and properties were liabilities before consolidating investments, life insurance, jewelry, and movable wealth into structures he controlled.\n\nOver roughly a decade legal estimates converge around a loss of approximately 4.5 to 6 million euros, with several generations of accumulated property and capital draining away under the guise of emergency measures and spiritual duty.\n\nChristine de Védrines broke away from Tilly\u0027s orbit in England in 2009, returning to France to file formal complaints and publicly detail his methods, giving investigators a coherent narrative linking isolation, psychological pressure, and financial ruin.\n\nTilly was detained in Switzerland in 2009 following coordination between French prosecutors and European police, then extradited to France for trial.\n\nIn 2013 a Bordeaux court sentenced him to ten years in prison for abuse of weakness of vulnerable persons, violence without bodily harm, and unlawful deprivation of liberty.\n\nThe court awarded damages to family members though the sums came nowhere close to reconstituting lost patrimony, with descendants now living in modest accommodation rebuilding lives with help from social services rather than inherited rents.",
      "release": "2025-12-23T16:01:04Z",
      "duration": "00:23:07",
      "explicit": false,
      "youTubeId": "cjtDccADn8s",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=cjtDccADn8s"
      }
    }
  ]
}