{
  "_ts": 0,
  "id": "db15dec3-359c-4053-98e3-3ba52591f11a",
  "name": "O\u0027Leary Publishing",
  "youTubeChannelId": "UCU9YnKzQVy7N5DQqBK1U30w",
  "episodes": [
    {
      "id": "0d193331-5fd2-40c7-b5df-c7e7f6ce957a",
      "title": "Ep 70  Author Kendra Petty Cannot Believe She’s Not Dead",
      "description": "Step into the captivating world of the \u0022I’m Booked\u0022 podcast, a realm where the remarkable narratives of our cherished authors come to life. Join us in this riveting episode as we plunge into the extraordinary saga of one of our newest authors, Kendra Petty. Prepare to be enthralled by the pages of her gripping memoir, \u0027I Can’t Believe I’m Not Dead.\u0027\n\nKendra\u0027s poignant journey embarks on a remarkable odyssey, a narrative that unfolds with unwavering courage and tenacity. From confronting the shadows of childhood traumas to breaking free from the clutches of a cult, her story evolves into a tapestry of empowerment and survival. As the chapters unfurl, Kendra navigates the tumultuous waters of a toxic marriage and delves into the perilous realms of organized crime. Every twist and turn of her tale is a testament to her indomitable spirit and resilience, weaving an awe-inspiring narrative that transcends imagination.\n\nCuriosity piqued? Delve deeper into Kendra\u0027s gripping memoir and explore the intricacies of her journey by visiting her official website, a hub that encapsulates her remarkable odyssey. Connect with Kendra and immerse yourself in the compelling tapestry of \u0027I Can’t Believe I’m Not Dead\u0027 at www.kendrapettyofficial.com.\n\nPrepare to be spellbound by a story of courage, survival, and the unyielding strength of the human spirit. Join us as we traverse the captivating landscapes of Kendra\u0027s life, a journey that will leave an indelible mark on your heart and mind. Welcome to the enchanting world of the \u0022I’m Booked\u0022 podcast, where extraordinary tales unfold at every turn of the page.\n\nYou can catch this and other awesome episodes on your favorite podcast platform or online at https://olearypublishing.com/podcast. And, for a dash of fun, why not take our interactive quiz at https://olearypublishing.com/adventure? Discover where your publishing adventure may lead. Go on, we dare you to dive in!\n\n#WritersOfYouTube\n#BookTube\n#SelfPublished\n#Authorpreneur\n#BookPromotion\n#WritingJourney\n#IndiePub\n#BookLaunch\n#AuthorsJourney\n#EbookPublishing\n#PrintOnDemand\n#WritingInspiration\n#WritingAdvice\n#BookPublishers\n#BookCoverDesign\n#SelfPub\n#IndiePublishing\n#AuthorTube\n#WritingLife\n#BookWriting\n#WriteTip\n#BookCommunity\n#WritingProcess\n#WritingHelp\n#NovelWriting\n#FictionWriting\n#PublishingAdvice\n#ManuscriptSubmission\n#EditorialTips\n#AuthorPlatform\n#BookPublicity\n#WriteChat\n#Bookstagram\n#WritersBlock\n#Creativewriting",
      "release": "2023-08-10T14:19:29Z",
      "duration": "00:41:15",
      "explicit": false,
      "youTubeId": "COSRFJZNmn0",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=COSRFJZNmn0"
      }
    },
    {
      "id": "ad923f12-0166-4842-9319-a7421e692736",
      "title": "Kendra Petty | Book Launch Party | I Can\u0027t Believe I\u0027m Not Dead",
      "description": "I Can\u0027t Believe I\u0027m Not Dead written by Kendra Petty launched on March 8, 2023. This is her LIVE Zoom book launch party where you get to meet the O\u0027Leary Publishing team and hear her author experience from working with a ghostwriter, Jessica Jones, to our head editor, Heather Desrocher, our book designer, website designer and entire team. \n\nWelcome to the world of authorship, Kendra Petty! We\u0027re so thankful to have worked with you! To start your publishing adventure take our free author quiz at https://olearypublishing.com/adventure. We dare you! \n\n To purchase Kendra\u0027s book on Amazon visit https://amzn.to/3MWUjAi. For more about Kendra, visit www.kendrapettyofficial.com.\n\nHere\u0027s her book description for I Can\u0027t Believe I\u0027m Not Dead:\n\nHave you ever wanted to give up? I have. You can overcome insurmountable odds and create a life you love. I did. Just don’t quit.\n\nAs if surviving years of childhood abuse and narrowly escaping a cult and my mother’s insanity wasn’t enough, I ended up married to a physically and emotionally abusive woman with a hidden drug habit. I tried to make it work. I really did. Despite my success in climbing the corporate ladder my questionable instincts caused me to stay in a toxic business environment longer than I should have. Because of my warped sense of what was acceptable, and even desirable, I ignored countless red flags. Many times I wondered, How much more can one person take?\n\nAfter almost dying, I finally realized that the changes I needed to make were so vast and far-reaching that they could only be achieved by exploding the life I had and deliberately creating a new one. For me, it began when I realized that I worked for an organized crime family – who I suspect was trying to kill me for knowing too much. Does this sound impossible? Well, dear reader, I dare you to open the pages of this book, and be the judge. This is my story – the one that I wish wasn’t true, but is. Join me on this intense adventure, and here’s a spoiler alert – I’m not dead.\n\nKENDRA PETTY is a woman who has succeeded in an all-male industry, becoming an Executive Vice President at two firms. Kendra is a dynamic public speaker, powerful negotiator, and dealmaker. She loves bouldering and scrambling in the mountains of California, Nevada, and Arizona. A boater for many years, Kendra also loves fast cars and traveling. I Can’t Believe I’m Not Dead is her debut memoir.",
      "release": "2023-06-07T14:46:43Z",
      "duration": "00:44:23",
      "explicit": false,
      "youTubeId": "x22h5kS4H0o",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=x22h5kS4H0o"
      }
    },
    {
      "id": "c5f0b6c6-c12b-43fb-9c23-d860998683b9",
      "title": "I Can\u0027t Believe I\u0027m Not Dead | Kendra Petty | Booked Naples 2023",
      "description": "Kendra Petty’s life has been an obstacle course. Her memoir, \u0022I Can\u0027t Believe I\u0027m Not Dead,\u0022 chronicles her fascinating journey through trials, tribulations, and a shocking number of bizarre circumstances - like waking up naked on her neighbor’s balcony in the middle of the night, a bizarre occurrence that she, too, found hard to believe.\n\nBorn and raised in Oklahoma, Kendra was subjected to horrific abuse as a child. Her family, entwined in a self-started cult, held her captive in a toxic environment of manipulation and torment. It wasn’t until she reached adulthood that Kendra was able to break free from the chains of her twisted family life.\n\nDesperate to leave her past behind, she moved across the country to the bustling city of Manhattan. She hoped the vibrant city would offer a fresh start and allow her to blend into the crowds. Despite her high hopes, she discovered that you cannot escape your past simply by changing locations. Trauma, like an ever-present shadow, followed her closely, influencing her choices and leading her into a string of damaging relationships.\n\nKendra also found herself ensnared in a workplace that was as physically lethal as it was emotionally draining. Poisonous in more than a metaphorical sense, her job nearly claimed her life. But even in the face of death, Kendra\u0027s relentless spirit shone through, refusing to succumb to despair.\n\nThe narrative isn’t all doom and gloom, however. Amidst the tragedies and hardships, Kendra maintains her humor, recounting the absurdities of her life with a levity that offers an antidote to the heavier elements of her tale. She portrays her world in vibrant detail, weaving together the comical and tragic with a narrative flair that keeps readers both engrossed and entertained. \n\nMost importantly, Kendra\u0027s story is a testament to resilience. She has faced down the past that pursued her, battled against adversity, and slowly but surely, has shifted from mere survival to thriving. Today, Kendra Petty stands as a beacon of hope and strength, a shining example of the incredible power of human resilience.\n\nIn \u0022I Can\u0027t Believe I\u0027m Not Dead,\u0022 Kendra invites us into her world, encouraging us to laugh, to cry, and to marvel at the extraordinary saga of her life. Through her experiences, she demonstrates the power of tenacity and humor in overcoming even the most formidable challenges. Her journey is a testament to the indomitable spirit within us all and a reminder that no matter the depth of our struggles, there is always a chance for redemption and growth.\n\nTo download a free sample of her book or purchase an autographed copy visit https://kendrapettyofficial.com/.\n\nFor more about O\u0027Leary Publishing and to start your publishing adventure visit https://olearypublishing.com/.",
      "release": "2023-06-06T21:07:24Z",
      "duration": "00:13:48",
      "explicit": false,
      "youTubeId": "t2BFEHMmceI",
      "subjects": [
        "Family Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=t2BFEHMmceI"
      }
    }
  ]
}