{
  "id": "fa5294d1-4094-4616-a99b-f3be983ffd4a",
  "name": "One Thousand Gurus Podcast",
  "spotifyId": "3DGoAYS7gkBPdXe0awYRsA",
  "appleId": 1762554518,
  "youTubeChannelId": "UC_p7EJKrm5GItkMmdgJlMIQ",
  "episodes": [
    {
      "id": "9aff946c-292c-445b-b335-0458b6648b80",
      "title": "#55: Jae Kim - Math Tutoring to Coding, Leaving a Korean Cult, and Rebuilding a Life",
      "description": "In this episode of One Thousand Gurus, host J.R. Yonocruz welcomes Jae Kim, who shares his remarkable journey of leaving a Korean Christian cult after 10 years. Jae discusses how he rebuilt his life through open-mindedness, friendship, and love, exploring new hobbies like cooking and dancing, and forming new relationships. Key topics include Jae\u0027s background, the indoctrination and impact of the cult, and the eventual rediscovery of his Christian faith. The conversation also delves into Jae\u0027s professional trajectory from being a math teacher to a software developer, and his aspirations in the culinary field. Encouragement to question beliefs, the importance of friendships, and the value of personal growth are emphasized throughout the episode. Guest bio: After leaving a Korean cult of 10 years, Jae rebuilt his life with open-mindedness, friendship, and love. From exploring cooking and dance to new relationships, his journey is about community, growth, and celebrating life’s meaningful connections. Instagram: @seriouslyiamjaek / https://www.instagram.com/seriouslyiamjaek/ Instagram: @letsgetcookimjae / https://www.instagram.com/letsgetcookimjae/ Links/resources: In the Name of God: A Holy Betrayal (mini-series documentary - Netflix) Atomic Habits by James Clear (book summary) Send us a text Support the show One Thousand Gurus Podcast: Everyone has a compelling story to tell with insights we can all be inspired by. J.R. Yonocruz is a self-improvement blogger, relationship coach, and serial hobbyist with a passion for learning. He interviews unique guests from various fields to distill the strategies, habits, and mindsets we can use in our own lives. Each “guru” has a chance to give the audience a peek into a new world. \u0026#x1f4bb; Website: www.onethousandgurus.com \u0026#x1f517; All links \u0026 socials: https://bio.site/onethousandgurus \u0026#x1f4da; Learning guides: https://stan.store/marloyonocruz",
      "release": "2025-10-20T15:00:00Z",
      "duration": "00:44:07.8760000",
      "explicit": false,
      "spotifyId": "6vdkpkUNdyuWIhqj1HWJyX",
      "appleId": 1000732669902,
      "youTubeId": "MRv8WWdUXMM",
      "urls": {
        "spotify": "https://open.spotify.com/episode/6vdkpkUNdyuWIhqj1HWJyX",
        "apple": "https://podcasts.apple.com/podcast/55-jae-kim-math-tutoring-to-coding-leaving-a-korean/id1762554518?i=1000732669902",
        "youtube": "https://www.youtube.com/watch?v=MRv8WWdUXMM"
      }
    }
  ]
}