{
  "_ts": 0,
  "id": "a57ac1c3-3b8b-445e-b3f1-e17eb596c731",
  "name": "One Degree of Scandalous with Tom Zenner and Kato Kaelin",
  "spotifyId": "5EIaI8WfPDSxuMz8AAl9xA",
  "appleId": 1627046164,
  "youTubeChannelId": "UCRBCybyvysV0vLM_259A19w",
  "youTubePlaylistId": "PLzrTiwH8JU55vRVhpFXj5SQwjKm6f0tuA",
  "episodes": [
    {
      "id": "2c2aeb2c-5f23-4b8b-8f22-6097dd9f572c",
      "title": "This Man Turned Normal People Into Serial Killers",
      "description": "Charles Manson didn’t pull the trigger. He didn’t swing the knife. But he convinced others to kill for him — and they did. A Scary Ringmaster who turned hippies into killers. In the summer of 1969, a failed musician and self-proclaimed prophet manipulated a group of young followers and hippies into committing some of the most brutal murders in American history. This is the story of the cult that called him “God,” the Hollywood elite who crossed paths with him, and the nights that changed Los Angeles forever. A mix of mind control, LSD, broken dreams, and twisted ambition — the Manson Family was a cult disguised as a commune. Their crimes weren’t just murders — they were messages. Written in blood. This documentary reveals the full truth: \u0026#x1f52a; What happened on Cielo Drive and Waverly Place \u0026#x1f9e0; How Manson turned self-help books into a control system \u0026#x1f3b8; The shocking connection to the Beach Boys \u0026#x1f480; The forgotten victims\u0027 history left behind ⚖️ The trial that became a circus — and defined a decade. He wanted to be famous. He ultimately became a symbol of evil. This is the story of Charles Manson — and the people who killed in his name. Become a supporter of this podcast: https://www.spreaker.com/podcast/one-degree-of-scandalous-with-tom-zenner-and-kato-kaelin--6258576/support .",
      "release": "2025-06-16T11:45:07Z",
      "duration": "00:26:12.1990000",
      "explicit": false,
      "spotifyId": "5bFnnl92NadYtYxE3HtdEu",
      "appleId": 1000713085419,
      "youTubeId": "z0XD6NbRkko",
      "subjects": [
        "Manson Family",
        "Cult Psychology",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5bFnnl92NadYtYxE3HtdEu",
        "apple": "https://podcasts.apple.com/podcast/this-man-turned-normal-people-into-serial-killerso/id1627046164?i=1000713085419",
        "youtube": "https://www.youtube.com/watch?v=z0XD6NbRkko"
      }
    },
    {
      "id": "2948ce06-8f8f-49c2-bf68-bfb602509167",
      "title": "We Visited the Charles Manson\u0027s Kill Sites — Here’s What We Found",
      "description": "Step into the chilling world of # CharlesManson and his followers. In this special documentary episode of One Degree of Scandalous, Tom Zenner and Kato Kaelin visit the real crime scenes tied to the Manson Family murders. What happened at these places, what remains today, and where are the key figures now? Locations include: • Spahn Ranch – Manson’s base of operations. • LaBianca House: The home of the first victim. • Sharon Tate’s former residence — the site of the most infamous crime. We explore: • What happened at each location during the Manson murders. • Who the victims and perpetrators were. • What remains at these sites today. • Where the key figures are now. From Manson’s twisted cult beginnings to the gruesome murders that shocked the world, this deep dive reveals the dark underbelly of 1960s Los Angeles—and how the hippie dream turned into a nightmare. #CharlesManson #TrueCrime #HelterSkelter #MansonMurders Become a supporter of this podcast: https://www.spreaker.com/podcast/one-degree-of-scandalous-with-tom-zenner-and-kato-kaelin--6258576/support .",
      "release": "2025-05-02T11:05:07Z",
      "duration": "00:55:35.4480000",
      "explicit": false,
      "spotifyId": "3Iq82kue4ptZHyyiRTy5kJ",
      "appleId": 1000705831914,
      "youTubeId": "EkgE23lrZdg",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Iq82kue4ptZHyyiRTy5kJ",
        "apple": "https://podcasts.apple.com/podcast/we-visited-the-charles-mansons-kill-sites-heres-what/id1627046164?i=1000705831914",
        "youtube": "https://www.youtube.com/watch?v=EkgE23lrZdg"
      }
    }
  ]
}