{
  "id": "694b995e-53c0-45c6-a26f-718f09bdc9c9",
  "name": "One American Podcast",
  "spotifyId": "",
  "appleId": null,
  "youTubeChannelId": "UCubhMPKZ6C5LW9JSxkM0miA",
  "episodes": [
    {
      "id": "357d4c6e-f02c-4177-b567-3226efb85d80",
      "title": "Cults Inside Out: Is NXIVM A Cult? With Rick Alan Ross | One American Podcast",
      "description": "You’ve seen them in movies and on TV, but cults are more prevalent than you think—and they’re armed with strategies that can brainwash and persuade even the most unlikely of candidates. \n\nBut how do individuals get involved with cults in the first place, and what steps can be taken to “deprogram” and heal those who have been drawn into these damaging groups? \n\nThese questions and more are addressed in Cults Inside Out, written by a leading cult expert Rick Alan Ross. Over the course of three decades, Ross has participated in around five hundred cult interventions, provided expert court testimony, and performed cult-related work all around the world. \n\nWith the help of current and former cult members, Ross demonstrates many of the tactics the groups use for control and manipulation—and, more importantly, some of the most effective methods he and other experts have used to reverse that programming. \n\nAs a result, readers will find themselves armed with a greater understanding of the nature of destructive cults and an improved ability to assess and deal with similar situations—either in their own lives or the lives of friends and family members.\n\nRick Alan Ross is one of the leading experts on cults in the world today. He has consulted with the FBI, the BATF, and various other law enforcement agencies, as well as the governments of Israel and China, on the topic of cults. \n\nHe has been qualified and accepted as an expert court witness in eleven different states, including the US federal court. He has also worked as a professional analyst for CBS News, CBC of Canada, and Nippon and Asahi in Japan",
      "release": "2023-01-11T08:44:31Z",
      "duration": "01:10:14",
      "explicit": false,
      "spotifyId": "",
      "appleId": null,
      "youTubeId": "5QBOL2QxtUw",
      "subjects": [],
      "urls": {
        "spotify": null,
        "apple": null,
        "youtube": "https://www.youtube.com/watch?v=5QBOL2QxtUw"
      }
    }
  ]
}