{
  "id": "e2f343a9-ede9-42ee-aea2-182d8660d23c",
  "name": "OnTheStacks with Bill Corcoran Jr.",
  "spotifyId": "15yqMs7fTHz1lIjnbQa2Cl",
  "appleId": 1500356928,
  "youTubeChannelId": "UCrzv4QsdhipvgzIxAiDGUzA",
  "episodes": [
    {
      "id": "a1a86da3-c405-4dc1-9198-0314c6223dad",
      "title": "I’m a Cult Survivor: Former Member of Masters Commission | Ep.216: Amber Viola",
      "description": "This week in the MPP studio, Bill is joined by Amber Viola, a former member of Masters Commission, a discipleship program which has been widely criticized and considered to be a cult. In this episode, Amber bravely recounts her experiences living and working within a cultic environment, shedding light on the emotional and psychological toll of extreme indoctrination. Her vivid descriptions reveal a world marked by extreme control, financial strain, and emotional turmoil. Amber discusses the intense pressure to conform, the isolation from family, and draws parallels to the broader issues within evangelicalism and the damaging practices of conversion therapy camps. Her narrative is a powerful testament to the resilience required to break free from such environments and the importance of speaking out about these injustices. The episode concludes with a heartfelt exploration of Amber’s survival and recovery from cultic trauma, her journey as a military veteran, and the mental health challenges she faced. She discusses the therapeutic process of writing her book, aimed at inspiring and supporting other Veterans facing similar struggles. Enjoy! Thank you to our sponsors Montage Planning Partners : Visit them online at montageplanningpartners.nm.com Sweat Tent: Get $100 OFF your purchase with code OTS at Sweat Tent CANN: Cannabis Infused Seltzer: Get 20% your first order with code OTS at CANN (Must be 21\u0026#43;) Wilkes Consulting: A Ramsey preferred coaching firm making financial independence a reality. Learn more at wilcopa.com! FIT AF: Get 20% OFF your first purchase of 7 meals or more with code OTS at FitAfNutrition.com! Elevation Wellness : Get 10% OFF your first purchase with code STACKS at Elevation Wellness Brrrn: Burn a ton of calories without burning a ton of cash! Get 15% Off at shop.thebrrrn.com with code STACKS15 at checkout! StreamYard: Create \u0026 Edit Video Podcasts, Webinars, Recordings and Host Live Videos on Social Media \u0026#43; More! Tap here for a FREE 14 Day Trial of StreamYard! Creators Legal: Easy-to-use Contract templates that are perfect for Influencers \u0026 Content Creators in ANY industry. Tap Here To Try Creators Legal! DISCLAIMER: This description contains affiliate links. If you click and make a purchase, we will earn a small commission that helps us keep the mics on! Tap here to Support us on Patreon! Engage with us on social media: Instagram , Facebook , LinkedIn, or visit our website!",
      "release": "2024-08-21T23:15:21Z",
      "duration": "01:14:29.0760000",
      "explicit": true,
      "spotifyId": "07ECryVL3sbwiVMX0bfxuX",
      "appleId": 1000666181992,
      "youTubeId": "tOEQYGZaknM",
      "subjects": [
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/07ECryVL3sbwiVMX0bfxuX",
        "apple": "https://podcasts.apple.com/podcast/im-a-cult-survivor-former-member-of-masters/id1500356928?i=1000666181992",
        "youtube": "https://www.youtube.com/watch?v=tOEQYGZaknM"
      }
    }
  ]
}