{
  "id": "97175471-e113-4717-b635-152c0ab155f0",
  "name": "Operación Crimen",
  "spotifyId": "2U9Wh8ZheHnW9l2OVkCO6Q",
  "appleId": 1722264476,
  "youTubeChannelId": "UCftz5TRZe8Ub5AwdWl8QFeQ",
  "episodes": [
    {
      "id": "9abe7322-7384-4e32-b204-4d4b2c5f6d33",
      "title": "LEV TAHOR: Esta Secta Judía Ultraortodoxa llevaba N1ÑØS DESAPARECIDOS  por Todo el Mundo",
      "description": "En este episodio de Operación Crimen, investigamos el caso del grupo judío ultraortodoxo Lev Tahor, cuyos integrantes fueron ubicados por las autoridades colombianas en Yarumal, Antioquia, junto a 17 m***res de edad, cinco de ellos con alertas amarillas de Interpol. La intervención fue liderada por Migración Colombia y el GAULA Militar Oriente, en un operativo que generó atención internacional por las dudas sobre la situación migratoria, el traslado constante entre países y las posibles vulneraciones a los derechos de los menores.\n\nJunto a nuestro invitado Leonardo Aja, experto en fenómenos religiosos cerrados, y con el análisis forense de Belisario Valbuena, exploramos qué es realmente Lev Tahor, por qué ha sido investigado en varios países, cómo llegó a Colombia y qué hallaron las autoridades al revisar su documentación y su composición familiar. También analizamos el papel del ICBF, las restricciones que enfrentaron para evaluar a los menores y las implicaciones legales del proceso de expulsión.\n\nEpisodio disponible también en: https://open.spotify.com/show/2U9Wh8ZheHnW9l2OVkCO6Q\n\nOPERACIÓN CRIMEN reconoce y protege el derecho que tienen todas las personas a conocer, actualizar y rectificar las informaciones que se hayan recogido sobre ellas en bases de datos o archivos que sean susceptibles de tratamiento por entidades de naturaleza pública o privada.https://rafaelpovedatv.com/politica-de-datos/",
      "release": "2025-11-30T22:30:04Z",
      "duration": "00:38:13",
      "explicit": false,
      "spotifyId": "6L5a70mErb0QoGxdU7BwMl",
      "appleId": 1000739160239,
      "youTubeId": "K6tvW-iNhG0",
      "subjects": [
        "Lev Tahor"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6L5a70mErb0QoGxdU7BwMl",
        "apple": "https://podcasts.apple.com/podcast/lev-tahor-esta-secta-jud%C3%ADa-ultraortodoxa-llevaba-ni%C3%B1os/id1722264476?i=1000739160239",
        "youtube": "https://www.youtube.com/watch?v=K6tvW-iNhG0"
      }
    }
  ]
}