{
  "_ts": 0,
  "id": "37bdb4ab-60bb-4a58-a680-3d56f5bd5d71",
  "name": "Opinium",
  "youTubeChannelId": "UCDyoz_vGrOKGE4jJ6ZM-ybQ",
  "episodes": [
    {
      "id": "1c5b37ca-3f95-4906-b9a3-ba0ed8cb3c42",
      "title": "The Deceptive World of Transcendental Meditation - The Cult of Maharishi Mahesh Yogi",
      "description": "“The Deceptive World of Transcendental Meditation - The Cult of Maharishi Mahesh Yogi” is a critical commentary on the ways in which the Transcendental Meditation (TM) organisation has deceived their customers and followers since the 1960s, when the group’s leader, Maharishi Mahesh Yogi (also known as the Giggling Guru), became a prominent figure in the world of spirituality after attracting renowned celebrities like The Beatles to study with him. \n\nThe video explains how the Transcendental Meditation organisation (a.k.a TMO) targets children, sells products that fail to deliver on their promises, and attempts to gain scientific respectability by distorting research protocols and results. There’s a very good argument to be made that Maharishi was a con artist; a fraud, and his organisation’s science was - and remains - shabby at best (especially where the “Maharishi effect” is concerned).\n\nInformation is also given about the potentially negative side effects the meditation practice can have on people’s mental health if it is over-indulged in, and the question of whether TM is a religion or not is explored in the closing section. \n\nAlthough many people fail to recognise it, Transcendental Meditation is a cult. People who’ve learned TM often dispute this fact because they’ve only encountered the public-facing side of the TM movement, which is strictly intent on selling the Transcendental Meditation product. Those who seek to engage with the deeper levels of the organisation (by studying within Maharishi’s educational systems, becoming teachers or taking additional — and very expensive — courses) experience a very different world; an arguably crazy and highly deceptive one.",
      "release": "2022-08-31T06:14:02Z",
      "duration": "00:26:03",
      "explicit": false,
      "youTubeId": "wCUZXQ0b-MA",
      "subjects": [
        "Transcendental Meditation"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=wCUZXQ0b-MA"
      }
    }
  ]
}