{
  "_ts": 0,
  "id": "da75ddd2-5417-4477-8299-29b2869361e7",
  "name": "Osho\u0027s children",
  "spotifyId": "0khMKRjVGGRYKqgjUaODLs",
  "appleId": 1544457030,
  "episodes": [
    {
      "id": "fd45b568-1afc-4b6c-ab42-0f090247caa2",
      "title": "Ep. 14 | Healing the wounds - Amara part 2",
      "description": "by Roberta Lippi | In the second part of the story, Amara becomes aware of what happened to her: she was slowly pushed into the world of prostitution. She almost did not realize it, because when it happened she was only a teenager. A teenager, however, who becomes a woman and struggles for years to get out of that unhealthy mechanism. In this episode, Amara tells us about her difficult path to the ascent, a happy and fulfilling life away from the community, which, however, she continued to frequent for a long time after leaving the absurd world into which she sold herself. Today, back Sabine, she has received the answers she has been seeking for years in the words of other podcast witnesses and wants to tell how things really turned out for her and, she is now certain, many other sannyasin girls and children.",
      "release": "2023-02-08T09:00:02Z",
      "duration": "00:50:27.8790000",
      "explicit": false,
      "spotifyId": "2JxF0qvEisTQxz0DaQT4C4",
      "appleId": 1000598624820,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2JxF0qvEisTQxz0DaQT4C4",
        "apple": "https://podcasts.apple.com/podcast/ep-14-healing-the-wounds-amara-part-2/id1544457030?i=1000598624820"
      }
    },
    {
      "id": "b099171a-7b4d-48d5-82f0-809c7771135c",
      "title": "Ep. 13 | A whole new story - Amara part 1",
      "description": "By Roberta Lippi | Sabine is just a teenager when she comes into contact with the sannyasin world. t is the 1980s and in order to stay close to the group she decides to leave home, despite what her parents tell her. So she becomes Amara and she must learn to stay alone to continue living her quest for spirituality, to meet the expectations of the community and to be able to go to the Summer Festival in Oregon, the festival that brings together sannyasins from all over the world since Osho decided to create his ideal city in America, in that piece of land he called Rajneeshpuram. And so, between school and commune, Amara is slowly being introduced to a very simple way of making money, which is to do what so many other girls in the community already do and which until now has only been hinted at in the memories of adult and child sannyasins: selling herself.",
      "release": "2023-02-07T08:54:38Z",
      "duration": "00:35:28.1170000",
      "explicit": false,
      "spotifyId": "4N77qBBdN8iYI2588uzx1n",
      "appleId": 1000598451162,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4N77qBBdN8iYI2588uzx1n",
        "apple": "https://podcasts.apple.com/podcast/ep-13-a-whole-new-story-amara-part-1/id1544457030?i=1000598451162"
      }
    },
    {
      "id": "7ee0aaf2-822e-4ee3-a4c0-07ebc2d03e03",
      "title": "Dragon Lady - Part 6",
      "description": "By Roberta Lippi | After years of impositions and dramatic acceptance of a world totally out of reality, Deeksha realizes how fundamental her role was in the birth, growth and fall of the sannyasin world. Too many voices of those who have suffered and those who have been lost who have remained silent, too much violence and abuse. This is the definitive delivery of the truth, so that history does not repeat itself.To learn more: Rajneeshpuram: Inside the Cult of Bhagwan and Its Failed American Utopiaby Russell KingSins of My Father: A Daughter, a Cult, a Wild Unravellingby Lily DunnCharisma and Control in Rajneeshpuram: A Community without Shared Values(American Sociological Association Rose Monographs)by Lewis F. CarterMy Life in Orange: Growing Up with the Guruby Tim GuestBreaking the Spell: My life as a Rajneeshee, and the long journey back to freedomby Jane StorkThe Guru Papers: Masks of Authoritarian Powerby Joel Kramer and Diana AlstadBounded Choice: True Believers and Charismatic Cultsby Janja A. LalichThe Mother of Godby Luna TarloHoly Hell: A Memoir of Faith, Devotion, and Pure Madness by Gail TredwellCombating Cult Mind Control: The #1 Best-Selling Guide to Protection,Rescue, and Recovery from Destructive Cultsby Steven Hassan, Daniel Greenberg, et al.Bhagwan: The God That Failedby Hugh MilneWhen she comes backBy Ronit PlankWild Wild Sheela - Le 100 cose che Wild Wild Country non vi ha detto e state cercando su GoogleBy Roberta Lippi",
      "release": "2022-11-02T06:15:02Z",
      "duration": "01:23:14.1110000",
      "explicit": false,
      "spotifyId": "0pdPSE8ukomKaqUjKZGNct",
      "appleId": 1000584744176,
      "subjects": [
        "Bhagwan Shree Rajneesh",
        "Cult Psychology",
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pdPSE8ukomKaqUjKZGNct",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-part-6/id1544457030?i=1000584744176"
      }
    },
    {
      "id": "b07a6516-5305-419e-b4d9-b231f4736190",
      "title": "Dragon Lady - Part 5",
      "description": "By Roberta Lippi | Deeksha follows up on the guru\u0027s last requests, but as soon as he can he escapes Rajneeshpuram. His name now represents a danger to the whole community: bring her back in by any means or make her pay? But the intimidation was not effective on the woman who decided to return to give voice to the Dragon Lady in her.",
      "release": "2022-10-19T05:15:02Z",
      "duration": "01:03:34.1510000",
      "explicit": false,
      "spotifyId": "3yZ6Kd1p3UoXJrYRtvgDV3",
      "appleId": 1000583113806,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3yZ6Kd1p3UoXJrYRtvgDV3",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-part-5/id1544457030?i=1000583113806"
      }
    },
    {
      "id": "accfe813-b1c8-41a1-ad71-65e34fbd95ff",
      "title": "Dragon Lady - Part 4",
      "description": "In New Jersey, Deeksha and Sheela indulge the whims of the guru as they try to give life to the new commune of Rajneeshpuram, but suddenly the story takes a turn for one of the two: while Sheela indulges Osho in everything he does, asks and teaches, Deeksha has a brainwave: who is really the man she thought she had known ten years earlier and who has always considered a teacher? And what does he really want?",
      "release": "2022-10-05T05:05:01Z",
      "duration": "01:06:31.5360000",
      "explicit": false,
      "spotifyId": "2Ir53qV4viHUbRkfGWIw8W",
      "appleId": 1000581633584,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2Ir53qV4viHUbRkfGWIw8W",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-part-4/id1544457030?i=1000581633584"
      }
    },
    {
      "id": "9acb8227-4db4-4adb-ae53-171c8dfb0429",
      "title": "Dragon Lady - Part 3",
      "description": "by Roberta Lippi | The community has become so large that it is almost unmanageable, gossip about what happens in the ashram increases and strange events sharpen suspicions about what happens once you cross the gates of Poona’s Ashram. Sheela manages to get the power she so longs for and convinces the guru to move to America. Deeksha is in charge of organizing everything in advance and leaves for the United States.",
      "release": "2022-09-21T04:50:02Z",
      "duration": "00:58:56.3510000",
      "explicit": true,
      "spotifyId": "50IeIw3G3sGyAPlO4EjReq",
      "appleId": 1000580144074,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/50IeIw3G3sGyAPlO4EjReq",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-part-3/id1544457030?i=1000580144074"
      }
    },
    {
      "id": "6baed53d-5f7c-48a1-888b-51270e2ba546",
      "title": "Dragon Lady - Part 2",
      "description": "by Roberta Lippi | Deeksha has become one of the most feared and respected people in the community. The ashram grows excessively and she works without respite. Maybe that\u0027s why she doesn\u0027t even have time to realize that many, too many strange things are happening within the commune, and that she herself is inevitably involved.",
      "release": "2022-09-07T05:00:03Z",
      "duration": "00:59:06.5400000",
      "explicit": true,
      "spotifyId": "6pYYg37wWwK610pZhVIHJt",
      "appleId": 1000578658933,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6pYYg37wWwK610pZhVIHJt",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-part-2/id1544457030?i=1000578658933"
      }
    },
    {
      "id": "73214a8c-6f7f-49c9-9892-4c8365c3a9cf",
      "title": "Dragon Lady - Part 1",
      "description": "by Roberta Lippi | A young educated and rich woman has just taken a long trip around the world, after he received an inheritance. She will stop in Bombay, where an acquaintance tells her that there is a master she really needs to know and where she will start proselytizing for him to bring new Western followers.",
      "release": "2022-09-07T04:45:01Z",
      "duration": "00:52:01.2140000",
      "explicit": false,
      "spotifyId": "3VWOid1nxbbw38SaJuJk0U",
      "appleId": 1000578657136,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3VWOid1nxbbw38SaJuJk0U",
        "apple": "https://podcasts.apple.com/podcast/dragon-lady-part-1/id1544457030?i=1000578657136"
      }
    },
    {
      "id": "a30cce24-41e7-4297-9e64-b231964406e4",
      "title": "Trailer - Dragon Lady",
      "description": "This is Dragon Lady, the last witness, the sequel series of \u0022Soli\u0022 by Roberta Lippi.Her name was Deeksha, and she was one of the women of power in Osho\u0027s entourage, the famous Indian guru, and one of the few disciples to have direct access to the teacher.Deeksha was somewhat of a living legend in the ashram because many considered her to be a true tyrant. Osho often spoke of her as an exemplary figure, calling her Zen Master or Dragon Master, and still today the Sannyasins remember her this way. even if she has long since disappeared from the scene.Deeksha arrived in the United States and was destined to take over Rajneeshpuram together with Ma Anand Sheela, but suddenly decided to leave the commune. The reasons that prompted her to leave have remained secret for over 40 years. Today she has decided to talk and reveal everything about the community and the guru.",
      "release": "2022-08-31T05:00:03Z",
      "duration": "00:01:33.4970000",
      "explicit": false,
      "spotifyId": "5ha5OrJBgQ48j0OWaDUsWM",
      "appleId": 1000577876402,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5ha5OrJBgQ48j0OWaDUsWM",
        "apple": "https://podcasts.apple.com/podcast/trailer-dragon-lady/id1544457030?i=1000577876402"
      }
    },
    {
      "id": "47dd65d3-0cde-4730-a938-47e1864a8eae",
      "title": "Ep. 12 | The kicked out",
      "description": "Soli, by Roberta LippiIn this second part of the episode dedicated to Siddhartha, we continue to listen to the story of the Golden Boy, his travels in search of himself and his place in the world without ever forgetting the Master, his visits to Rajneeshpuram, which Siddhartha has ever seen as the Promised Land, and the constant abuse and harassment he suffered from Sheela. Who is Siddhartha today? How does he remember that period of his life and all the people who, when he was just a child, did everything but protect him?",
      "release": "2021-07-26T06:10:20Z",
      "duration": "00:34:23.7830000",
      "explicit": false,
      "spotifyId": "6wtz9FmbDVbDbOsDU1B91Y",
      "appleId": 1000530011925,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6wtz9FmbDVbDbOsDU1B91Y",
        "apple": "https://podcasts.apple.com/podcast/ep-12-the-kicked-out/id1544457030?i=1000530011925"
      }
    },
    {
      "id": "1cada8a5-5abf-4de6-a3ee-4507ee6e5c77",
      "title": "Ep 11 |  Siddhartha, the Golden Boy",
      "description": "Soli, by Roberta LippiNot a child of Osho, but THE child of Osho: the protagonist of this double episode of Soli is Siddhartha, the Golden Boy, Baghwan\u0027s favorite child with whom he established a unique and special bond. For this reason, Sid had become a friend with all the members of community, loved by everyone, but also very hated and abused by Sheela: how far can human envy go? What about the resilience of a little child?",
      "release": "2021-07-26T05:30:10Z",
      "duration": "00:37:22.8230000",
      "explicit": false,
      "spotifyId": "744EUhAie3YS6inT5pmhHR",
      "appleId": 1000530009081,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/744EUhAie3YS6inT5pmhHR",
        "apple": "https://podcasts.apple.com/podcast/ep-11-siddhartha-the-golden-boy/id1544457030?i=1000530009081"
      }
    },
    {
      "id": "52552f7a-41e9-4d11-8d52-49a2d63f35ef",
      "title": "Ep 10 | There is another truth",
      "description": "Soli, by Roberta LippiBindu\u0027s experience as an Osho\u0027s kid has something unique. Contrasted emotions emerge from her words as she recalls her time in the Osho\u0027s commune of Puna. Bindu is born there. She shares with us sweet memories of her childhood - and also bitter ones. Some of them are painful. Memories of great ideals, not always equally shared, but at least respected by everyone. Her story is full of sharp thought and a curious anecdotes. On of them allow us to unexpectedly close the circle and drew us back at the very beginning of \u0022Soli\u0022\u0027s journey.Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2021-06-24T05:30:05Z",
      "duration": "00:42:36.9690000",
      "explicit": false,
      "spotifyId": "1iIXlphchl6sLJ9mUCo4Xb",
      "appleId": 1000526696228,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1iIXlphchl6sLJ9mUCo4Xb",
        "apple": "https://podcasts.apple.com/podcast/ep-10-there-is-another-truth/id1544457030?i=1000526696228"
      }
    },
    {
      "id": "8b155be0-1ee1-4995-a686-6afb7ac71472",
      "title": "Ep 09 | I am only Bindu",
      "description": "Soli, by Roberta LippiBindu\u0027s experience as an Osho\u0027s kid has something unique. Contrasted emotions emerge from her words as she recalls her time in the Osho\u0027s commune of Puna. Bindu is born there. She shares with us sweet memories of her childhood - and also bitter ones. Some of them are painful. Memories of great ideals, not always equally shared, but at least respected by everyone. Her story is full of sharp thought anda curious anecdotes. On of them allow us to unexpectedly close the circle and drew us back at the very beginning of \u0022Soli\u0022\u0027s journey.Story continues in the next episode online on June 24th.Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2021-06-17T05:30:15Z",
      "duration": "00:44:52.5710000",
      "explicit": false,
      "spotifyId": "0jIiBnVVnH5oSPiQUOPf7s",
      "appleId": 1000525826311,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0jIiBnVVnH5oSPiQUOPf7s",
        "apple": "https://podcasts.apple.com/podcast/ep-09-i-am-only-bindu/id1544457030?i=1000525826311"
      }
    },
    {
      "id": "4906fbc1-5db5-4813-ba78-f941a0607a68",
      "title": "Ep 08 | Nobody wants to talk",
      "description": "The publishing of \u0022Soli\u0022 drew attention and got noticed by the sannyasin community. Some former Osho\u0027s kids came forward with their stories.We realized that we missed one last chapter, a tribute to those who decided to forget.At the center of this episode, Maroesja Perizonius, a Dutch director who in 2004 shot a documentary on her story as \u0022Child of the commune\u0022.Maroesja goes through her memories as sannyasin child, separated from her mother and living in different communes, alone.When she started to search for answers, she realized that nobody - including her mother - wanted to be accountable for how their choices affected Maroesja\u0027s life.",
      "release": "2021-05-13T05:30:12Z",
      "duration": "00:32:09.6960000",
      "explicit": false,
      "spotifyId": "6HLvow25abFFSCoqqLxFRo",
      "appleId": 1000521552593,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6HLvow25abFFSCoqqLxFRo",
        "apple": "https://podcasts.apple.com/podcast/ep-08-nobody-wants-to-talk/id1544457030?i=1000521552593"
      }
    },
    {
      "id": "cc7baead-8e5b-4943-a3cb-58e1eb6a31c0",
      "title": "Ep 07 | After the escape",
      "description": "Soli, By Roberta LippiCamila\u0027s story continues to reveal her best and worst moments in the commune. She recalls the difficulties of growing up in a split family, but mostly about ending up in the Medina commune, England, alone. She stayed there until her parents finally decided it was time to take her back home and leave the sannyasin for good. From that moment on, Camila had to fall back into the \u0022normal\u0022 world. There was no more room for Kamla, the child she had been for ten years. How did she cope with such a big change? What is her angle on this whole experience, now that she is a mother?   Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2021-04-27T06:06:11Z",
      "duration": "00:38:00.1910000",
      "explicit": false,
      "spotifyId": "4PsCCM9VCbvBRr8zGyuyjx",
      "appleId": 1000518808197,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4PsCCM9VCbvBRr8zGyuyjx",
        "apple": "https://podcasts.apple.com/podcast/ep-07-after-the-escape/id1544457030?i=1000518808197"
      }
    },
    {
      "id": "04db0692-d3cf-4dc2-a434-259587d893b1",
      "title": "Ep 06 | Where is my mother?",
      "description": "Soli, by Roberta LippiListening to their stories, we learn that most of the former sannyasin children seem to have developed special skills and potential.This theory is confirmed by Camila Raznovich, former MTV, VJ, now successful TV host in italy, born in 1974 from a melting pot family. She was raised as a sannyasin child since the day she was born.How were the first ten years of her life? How did she deal with that experience?Story continues in the next episode, online on 27th april 2021.Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2021-04-13T05:30:17Z",
      "duration": "00:33:26.5950000",
      "explicit": false,
      "spotifyId": "5wKKH6UBEq51jbfRSWuJw3",
      "appleId": 1000516912869,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5wKKH6UBEq51jbfRSWuJw3",
        "apple": "https://podcasts.apple.com/podcast/ep-06-where-is-my-mother/id1544457030?i=1000516912869"
      }
    },
    {
      "id": "81995956-da4e-4bd3-af63-467e64f44a97",
      "title": "Ep 05 | Forbidden games",
      "description": "Soli, by Roberta LippiOsho earned the definition of “sex guru” because his cult members were allowed to freely express their physical desire, even with multiple partners. The guru had no trouble in openly talking about sex and even gave practical advices to his cult members on how to get the best out of the intercourse. He also preached that children had to know the truth about everything, including sex - but he did not consider that children imitate adults. They want to be like them, do whatever they do. What happens if what they start to imitate is sex? At the center of this episode is Swami Anand Satish, who recalls how all the experiences in the sannyasin communes started far too early. All of them.Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2021-03-15T12:43:44Z",
      "duration": "00:24:40.9430000",
      "explicit": false,
      "spotifyId": "0xd30pSK3Dj6MkGo801eFr",
      "appleId": 1000513063772,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0xd30pSK3Dj6MkGo801eFr",
        "apple": "https://podcasts.apple.com/podcast/ep-05-forbidden-games/id1544457030?i=1000513063772"
      }
    },
    {
      "id": "0ba7eb24-7a8d-4ed4-a523-f7af6e8f1aa4",
      "title": "Ep 04 | Out of the commune",
      "description": "Soli, by Roberta LippiAt the center of this episode is Massimo, who never became a proper sannyasin, but knows very well what it means to be one, since he spent his whole childhood and with an Osho-devotee mother.She decided not to move to a commune abroad, but nevertheless she strictly followed the guru\u0027s teachings from her hometown, travelling to the communes all around Italy. How was Massimo\u0027s childhood?  Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2021-02-16T06:30:02Z",
      "duration": "00:28:25.7510000",
      "explicit": false,
      "spotifyId": "2AOrxGdBQ5OCjRPYelaMRs",
      "appleId": 1000509210395,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2AOrxGdBQ5OCjRPYelaMRs",
        "apple": "https://podcasts.apple.com/podcast/ep-04-out-of-the-commune/id1544457030?i=1000509210395"
      }
    },
    {
      "id": "876f8475-a17a-4c48-9386-d072121189e5",
      "title": "Ep 03 | Medina, the children\u0027s common",
      "description": "Soli, by Roberta LippiThe story of Venu and Anugatha continues: for a while, mother and son are separated. After the opening of Rajneeshpuram, in Oregon, all the children of the communes scattered around the world are sent to the kid’s Medina commune, in England, alone.What was Venu’s life back then, at the age of ten, without his mother beside, having to take care of himself?Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2021-01-19T08:59:44Z",
      "duration": "00:22:19.6080000",
      "explicit": false,
      "spotifyId": "3SWFEe6DJ8Ri6JWeKoGcnR",
      "appleId": 1000505770702,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3SWFEe6DJ8Ri6JWeKoGcnR",
        "apple": "https://podcasts.apple.com/podcast/ep-03-medina-the-childrens-common/id1544457030?i=1000505770702"
      }
    },
    {
      "id": "ab4fc92e-e125-4c11-b5d4-cc29c451efbe",
      "title": "Ep 02 | Let\u0027s go to Puna",
      "description": "Soli, by Roberta LippiAt the center of this episode is Khrisna Venu, whose sannyasin name means “The flute of Khrisna”. He got it at the age of 4, in India. His mother was renamed Ma Prem Anugatha, which means “A little love story”. She received her  sannyasin name in Puna too. Osho himself initiated both of them, giving them a new identity, along with a new destiny. Anugatha and Venu, mother and son, are deeply connected: they went through a bonding experience, that they lived together and separeted at the same time. Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2021-01-12T06:30:07Z",
      "duration": "00:18:12.3360000",
      "explicit": false,
      "spotifyId": "0SxOExAWrOLB5HniGRvEYN",
      "appleId": 1000505054871,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0SxOExAWrOLB5HniGRvEYN",
        "apple": "https://podcasts.apple.com/podcast/ep-02-lets-go-to-puna/id1544457030?i=1000505054871"
      }
    },
    {
      "id": "1d6f99c9-e3a5-480f-99b1-f53f6508a614",
      "title": "Ep 01 | The backstory",
      "description": "Bhagwan Shree Rajneesh, known as Osho, became an Indian spiritual guru in the 1960s. In the mid 70s, the members of his cult founded the Puna Ashram, a commune in India that soon attracted members from all over the world. Mostly, young adults pervaded by the hippie culture, taking their children along. But Osho had very clear ideas about them: \u0022The idea that children belong to you is wrong. Children belong to themselves\u0022. What happened to the hearts and souls of those children, that following the guru’s precepts were left alone to take care of themselves? What have they become today? This is the starting point of a journey through their memories and stories.Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2020-12-21T06:30:21Z",
      "duration": "00:17:38.3560000",
      "explicit": false,
      "spotifyId": "49wD54Sfikc5fAIp2h1Bvs",
      "appleId": 1000503064807,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/49wD54Sfikc5fAIp2h1Bvs",
        "apple": "https://podcasts.apple.com/podcast/ep-01-the-backstory/id1544457030?i=1000503064807"
      }
    },
    {
      "id": "06a7c1d2-f9bf-43cd-b5ed-e4db156b8189",
      "title": "Trailer",
      "description": "Soli is one of the first International productions by Italian podcast platform storielibere.fm. Through their memories and voices, we discover how they came to terms with something that deeply affected them, when their parents, suddenly, decided to leave everything and put them in common, at all levels. The International version of Soli has been translated by Edoardo Rialti, the official Italian translator of G.R.R. Martin. The International voice of Roberta Lippi is Cecilia Gragnani.Cover image by Martino PietropoliMusic by Smokelab",
      "release": "2020-12-11T14:21:18Z",
      "duration": "00:03:04.5760000",
      "explicit": false,
      "spotifyId": "74Z2kXOOSvM3MoiRkcsQQK",
      "appleId": 1000502066054,
      "subjects": [
        "Bhagwan Shree Rajneesh"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/74Z2kXOOSvM3MoiRkcsQQK",
        "apple": "https://podcasts.apple.com/podcast/trailer/id1544457030?i=1000502066054"
      }
    }
  ]
}