{
  "_ts": 0,
  "id": "eb694a1a-dfa0-439f-809d-f6ed8f1f531a",
  "name": "Our People: Holdeman Mennonite Stories",
  "spotifyId": "1KwYkbtbIswUN3z6JSrqz5",
  "appleId": 1740613045,
  "youTubeChannelId": "UCRS1mkLGStncbF7o4-WZOjg",
  "episodes": [
    {
      "id": "09c12978-e71d-443f-985e-ba93ffb2a285",
      "title": "Dennis’ Story of Church Reform and Life After Excommunication: A Voice From Norquay",
      "description": "In this episode of the Our People Podcast, Dennis Goossen tells how his life\u0027s story entered and then exited the Holdeman church, Church of God in Christ Mennonite. He begins by describing his conversion experience and joining the church. Then he tells about a faith crisis and subsequent reconsecration in his late teens. From there, he married and started a family within the church. Finally, he describes his involvement in an effort to reform the more legalistic aspects of the church which resulted in a letter called \u0022A Plea For Revival\u0022. He was subsequently excommunicated, expelled, after church authorities demanded that he recant and retract the letter. Finally, he describes building a life after the Holdeman church and his latest project, forming a Christian school. A Plea For Revival Letter: https://rb.gy/pxe143 If Dennis\u0027 story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠OurPeoplePodcastTeam@gmail.com⁠ with your thoughts or suggestions for future interviews. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-05-26T11:00:00Z",
      "duration": "01:17:44.4390000",
      "explicit": false,
      "spotifyId": "6ESiLJ1UNfzAk1CHoJnX6j",
      "appleId": 1000656791220,
      "youTubeId": "Ja1XE0mY-A4",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ESiLJ1UNfzAk1CHoJnX6j",
        "apple": "https://podcasts.apple.com/podcast/dennis-story-of-church-reform-and-life/id1740613045?i=1000656791220",
        "youtube": "https://www.youtube.com/watch?v=Ja1XE0mY-A4"
      }
    },
    {
      "id": "267c3dcd-1d92-492a-92ae-49d38dae1e6e",
      "title": "Lewis\u0027 Story of Faith, Family, and Forgiveness: A Voice from Fleetwood",
      "description": "In this deeply personal episode of \u0022Our People Podcast,\u0022 Lewis delves into his spiritual journey, exploring the shifts in his faith that have significantly impacted his personal and familial relationships. From his early days rooted in traditional Holdeman Mennonite religious teachings to his present-day embrace of a more fluid and open-minded spirituality, Lewis discusses the challenges and revelations that have marked his path. Lewis opens up about the transformative power of doubt and dialogue in his life. He shares insights from his explorations of scripture, myths, and the profound lessons he has gleaned from the complexities of theological debates. Throughout the episode, Lewis reflects on the impact of these spiritual evolutions on his family dynamics, detailing the delicate balance of maintaining bonds despite differing beliefs. This episode is not just a journey through Lewis\u0027 spiritual evolution but also a meditation on the nature of belief, the importance of inclusivity in faith communities, and the ongoing quest for personal and communal harmony. Listeners will be invited to reconsider their own beliefs, the importance of open conversation, and the value of embracing uncertainty in the spiritual journey. Join us as Lewis provides a candid look at his life\u0027s struggles and triumphs, offering up his story as a testament to the power of faith, the strength of family, and the freedom that comes from seeking truth on one\u0027s own terms. If Lewis\u0027 story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠OurPeoplePodcastTeam@gmail.com⁠ with your thoughts or suggestions for future interviews.",
      "release": "2024-05-19T11:00:00Z",
      "duration": "01:50:35.2180000",
      "explicit": false,
      "spotifyId": "2J15vET3KpGYO9gTSLQNf8",
      "appleId": 1000656047786,
      "youTubeId": "hpdnHQXSj8Q",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2J15vET3KpGYO9gTSLQNf8",
        "apple": "https://podcasts.apple.com/podcast/lewis-story-of-faith-family-and-forgiveness-a/id1740613045?i=1000656047786",
        "youtube": "https://www.youtube.com/watch?v=hpdnHQXSj8Q"
      }
    },
    {
      "id": "2528c0cf-db53-45f4-b622-584057d91a3b",
      "title": "Monica\u0027s Story of Self Discovery: A Voice From Carrot River",
      "description": "In this episode of \u0022Our People Podcast,\u0022 we delve into the life and experiences of Monica from the Carrot River congregation of Church of God in Christ Mennonite. Monica shares her early life on a Canadian farm and the predestined path to her baptism at age 14 into this deeply traditional Holdeman Mennonite community. As she grew older, critical events—including the tragic death of peers and a family move—spurred profound shifts in her beliefs and feelings toward her faith. Monica candidly discusses the pressures and struggles that came with conforming to church expectations, her battle with mental health, and the eventual, liberating decision to leave the church. This episode, \u0022A Voice from Carrot River,\u0022 explores Monica\u0027s journey of self-discovery, her efforts to redefine her spirituality, and the ongoing process of healing from religious trauma. If Monica\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠OurPeoplePodcastTeam@gmail.com⁠ with your thoughts or suggestions for future interviews.",
      "release": "2024-05-12T11:00:00Z",
      "duration": "01:34:01.4710000",
      "explicit": false,
      "spotifyId": "5okwIb4Z19CTFJYMC9rntB",
      "appleId": 1000655310203,
      "youTubeId": "Em8XWhHOGRE",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5okwIb4Z19CTFJYMC9rntB",
        "apple": "https://podcasts.apple.com/podcast/monicas-story-of-self-discovery-a-voice-from-carrot-river/id1740613045?i=1000655310203",
        "youtube": "https://www.youtube.com/watch?v=Em8XWhHOGRE"
      }
    },
    {
      "id": "104e42ed-4e4b-4dbf-b1a5-90c1d8fec1c9",
      "title": "Cam\u0027s Story of Building An Honest Life: A Voice from Crooked Creek",
      "description": "In this episode of the Our People Podcast, titled \u0022Cam\u0027s Story of Building an Honest Life,\u0022 we delve into the life journey of Cam Isaac. Now residing in northern Alberta, Canada, Cam reflects on his life\u0027s narrative, emphasizing his evolution from adhering to external expectations to embracing a life grounded in honesty and self-acceptance. Raised in the deeply rooted Holdeman mennonite farming congregation in Crooked Creek, Alberta, Cam shares his upbringing in a congregation with a legacy spanning nearly a century. He discusses the complexities of growing up as the eldest child in a Holdeman community, where he adopted the \u0022good boy\u0022 persona to secure approval and avoid conflict. However, this facade led him to a cycle of dishonesty—masking his true self to fit the mold expected by the church, his community. Cam’s turning point came with his decision to leave the Holdeman faith, a move that reshaped his relationships and his sense of self. He openly discusses the challenges and liberation that came with breaking free from the religious and social expectations that had defined much of his life. This journey of self-discovery is punctuated by his diagnosis of cancer and a heart condition, which he sees not as a setback but as an opportunity for profound personal growth and reassessment of his life’s priorities. Throughout the episode, Cam emphasizes the power of authenticity, the peace that comes with living true to one\u0027s self, and the importance of unconditional love, even when it means standing alone. His story is a testament to the strength found in vulnerability and the transformative power of living a life aligned with one\u0027s deepest truths. If Cam\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠ourpeoplepodcastteam@gmail.com⁠ with your thoughts or suggestions for future interviews.",
      "release": "2024-05-05T11:00:00Z",
      "duration": "01:06:04.0060000",
      "explicit": false,
      "spotifyId": "0xFXYwnj2eWqGgpmqlRtpm",
      "appleId": 1000654574558,
      "youTubeId": "Lp8330JdUn4",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0xFXYwnj2eWqGgpmqlRtpm",
        "apple": "https://podcasts.apple.com/podcast/cams-story-of-building-an-honest-life-a/id1740613045?i=1000654574558",
        "youtube": "https://www.youtube.com/watch?v=Lp8330JdUn4"
      }
    },
    {
      "id": "d03bd777-0877-46b4-b2af-f2644e36f909",
      "title": "A Voice from Brooksville: Elizabeth\u0027s Story of Overcoming",
      "description": "Join us on a difficult journey with Elizabeth Hunt, originally from the Brooksville, Mississippi congregation of Church of God in Christ Mennonite, as she opens up about her past struggles with bullying and the deep scars left by sexual abuse, along with the painful realization of her local church\u0027s failure to support her. Yet, her story doesn\u0027t end there. Now flourishing in a new city, Emily shares how she has rebuilt her life, found strength within herself, and learned to thrive against all odds. Tune in to hear about her powerful path to healing and empowerment. If Elizabeth\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠ourpeoplepodcastteam@gmail.com⁠ with your thoughts or suggestions for future interviews.",
      "release": "2024-04-28T11:00:00Z",
      "duration": "01:34:14.2920000",
      "explicit": false,
      "spotifyId": "4mXlyyZ6aTLoYLG8dGZmBq",
      "appleId": 1000653814868,
      "youTubeId": "Sl7jUlCbhNg",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mXlyyZ6aTLoYLG8dGZmBq",
        "apple": "https://podcasts.apple.com/podcast/a-voice-from-brooksville-elizabeths-story-of-overcoming/id1740613045?i=1000653814868",
        "youtube": "https://www.youtube.com/watch?v=Sl7jUlCbhNg"
      }
    },
    {
      "id": "9cd4c30c-2660-4ae4-9abe-d83cc482a14d",
      "title": "A Voice from Crooked Creek: Laverne\u0027s Story of Resilience and Healing",
      "description": "Join us as we delve into the life journey of Laverne Friesen. Born into the Holdeman Mennonite community in Crooked Creek, Alberta, Laverne shares his candid experiences of growing up within and eventually stepping away from the Church of God in Christ Mennonite. This episode explores the complex tapestry of faith, personal growth, and the arduous path to healing from religious trauma. Discover how Laverne confronted challenges from his upbringing, questioned deep-seated beliefs, and navigated through significant life changes—from moving across Canada to reassessing his spiritual and mental health. He also touches on the sensitive subject of childhood sexual violence and the subsequent coverup by church staff, offering insights into the resilience required to overcome such profound adversities. If Laverne\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ourpeoplepodcastteam@gmail.com with your thoughts or suggestions for future interviews. This episode is not just a recount of past experiences but a beacon of hope for those grappling with similar issues, highlighting the importance of emotional health, a topic often overlooked in religious communities. Listen in for a journey of courage, controversy, and the quest for emotional liberation.",
      "release": "2024-04-21T11:00:00Z",
      "duration": "01:27:44.1380000",
      "explicit": false,
      "spotifyId": "0ZHgVHKc9eO8xlzKw68Ceh",
      "appleId": 1000653105752,
      "youTubeId": "1-AtTZGG-xc",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZHgVHKc9eO8xlzKw68Ceh",
        "apple": "https://podcasts.apple.com/podcast/a-voice-from-crooked-creek-lavernes-story/id1740613045?i=1000653105752",
        "youtube": "https://www.youtube.com/watch?v=1-AtTZGG-xc"
      }
    },
    {
      "id": "18b252f6-cda9-47f7-ba80-b006d7f1f4ee",
      "title": "Trailer: Our People - Holdeman Mennonite Stories",
      "description": "Coming soon to every podcast platform known to man, the Our People podcast will feature guests with a variety of perspectives on live in and after the Holdeman church.",
      "release": "2024-03-09T12:11:48Z",
      "duration": "00:08:36.2110000",
      "explicit": false,
      "spotifyId": "4l2WJuZ3rqrVWWMubzMH08",
      "appleId": 1000652058893,
      "youTubeId": "f0ZXWtH0hEw",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4l2WJuZ3rqrVWWMubzMH08",
        "apple": "https://podcasts.apple.com/podcast/trailer-our-people-holdeman-mennonite-stories/id1740613045?i=1000652058893",
        "youtube": "https://www.youtube.com/watch?v=f0ZXWtH0hEw"
      }
    }
  ]
}