{
  "_ts": 0,
  "id": "eb694a1a-dfa0-439f-809d-f6ed8f1f531a",
  "name": "Our People: Holdeman Mennonite Stories",
  "spotifyId": "1KwYkbtbIswUN3z6JSrqz5",
  "appleId": 1740613045,
  "youTubeChannelId": "UCRS1mkLGStncbF7o4-WZOjg",
  "episodes": [
    {
      "id": "b552742b-4511-46eb-9676-0208cbf9e63e",
      "title": "Justin\u0027s Story of Roots and Reckonings: A Voice From St. Marys",
      "description": "In this heartfelt episode of Our People: Holdeman Mennonite Stories, Amanda and Waylon welcome Justin Hunt to share his remarkable journey through life, faith, and self-discovery. Born in 1990 in St. Mary’s, Ontario, Justin opens up about his early life as the youngest of five children, navigating the challenges of his parents’ separation and the pivotal decision of his mother to join the Holdeman Mennonite Church. Justin reflects on the sacrifices his mother made to raise five children as a single parent during the 1990s, working tirelessly to provide food, shelter, and stability. He acknowledges the significant support their family received from the church community, which offered a lifeline during their most challenging years. Despite the stability the church provided, Justin began to question aspects of its teachings and practices as he grew older. As Justin recounts his later years, he delves into the struggles of reconciling his own beliefs with the expectations of the Holdeman Church. He describes pivotal moments that led him to reexamine his faith, including how he started to see the church’s practices as limiting his personal growth and understanding of the world. Justin shares the emotional and spiritual challenges he faced in stepping away from the Holdeman community and how that decision impacted his relationships, identity, and worldview. Through candid and vulnerable storytelling, Justin discusses the difficult but ultimately rewarding process of forging a life outside the confines of the church. He reflects on the lessons he’s carried with him and how his journey has shaped the person he is today. From his early days in a tightly knit community to finding his voice and place in a wider world, Justin’s story is one of courage, resilience, and self-discovery. This episode offers a profound look at the intersections of faith, family, and personal growth. Whether you are familiar with the Holdeman Mennonite community or simply curious about stories of transformation and resilience, Justin’s journey will inspire and resonate with listeners. Follow us on Facebook: ⁠⁠https://rb.gy/cj55td⁠⁠ Subscribe on Spotify: ⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠ Subscribe on YouTube: ⁠⁠https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1⁠⁠ Subscribe on Apple Podcasts: ⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠⁠ Are you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcastTeam@gmail.com or message us on Facebook. We would love to hear from you. Support Us On Patreon: ⁠⁠https://patreon.com/OurPeoplePodcast⁠⁠",
      "release": "2025-01-12T10:00:00Z",
      "duration": "02:37:08.8490000",
      "explicit": false,
      "spotifyId": "7E7cDqvGeafJJZBwco3lvU",
      "appleId": 1000683650512,
      "youTubeId": "iODBP8IN9Ts",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7E7cDqvGeafJJZBwco3lvU",
        "apple": "https://podcasts.apple.com/podcast/justins-story-of-roots-and-reckonings-a-voice-from-st-marys/id1740613045?i=1000683650512",
        "youtube": "https://www.youtube.com/watch?v=iODBP8IN9Ts"
      }
    },
    {
      "id": "6bb7ba48-7fb8-469a-be14-d480ca5bd626",
      "title": "Walking Each Other Home: A Conversation With Cam Isaac",
      "description": "In this heartfelt episode of Our People: Holdeman Mennonite Stories, hosts Waylon and Carlie welcome guest Cam Isaac for an enlightening and deeply personal discussion. Cam, who previously delivered a widely resonated TED Talk, revisits some of the key lessons from his journey and expands on the life experiences that led to his transformative insights.\n\n\n\nThe episode delves into Cam’s evolving relationship with faith, authority, and community. He reflects on his upbringing, the challenges of navigating rigid structures, and the profound importance of humility and apology in parenting—a concept that challenges traditional norms of parental authority. The discussion also explores the value of collective fellowship over hierarchical leadership, emphasizing authentic connection and mutual support in spiritual practices.\n\n\n\nCam shares his emotional battle with stage-four lymphoma, highlighting the role of mindset, emotional awareness, and intuition in his recovery journey. He underscores the importance of listening to one’s body, processing emotions, and breaking generational cycles of trauma. These insights resonate as Cam talks about finding peace within himself, which he describes as the ultimate gift he treasures after years of struggle.\n\n\n\nThe conversation touches on themes of love for the Holdeman Mennonite community, even amidst the complexities of leaving and navigating life outside of it. Cam\u0027s message is one of hope and encouragement for anyone walking similar paths, emphasizing that connection and mutual support are integral to the human experience.\n\n\n\nThe episode concludes with a poignant reminder that life is about “walking each other home,” as the hosts and Cam express gratitude, love, and mutual respect for one another. This conversation is a moving testament to resilience, the power of shared stories, and the enduring impact of compassion and understanding.\n\n\n\n\n\nFollow us on Facebook:\n⁠https://rb.gy/cj55td⁠\nSubscribe on Spotify:\n⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠\nSubscribe on YouTube:\n⁠https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1⁠\nSubscribe on Apple Podcasts:\n⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠\n\n\nAre you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcastTeam@gmail.com or message us on Facebook. We would love to hear from you.\n\n\nSupport Us On Patreon:\n⁠https://patreon.com/OurPeoplePodcast",
      "release": "2024-12-10T02:40:29Z",
      "duration": "02:12:41.1260000",
      "explicit": false,
      "spotifyId": "6iStpalqKyQjxUNcyKbfft",
      "appleId": 1000679836790,
      "youTubeId": "wvLFhxEqYVg",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6iStpalqKyQjxUNcyKbfft",
        "apple": "https://podcasts.apple.com/podcast/walking-each-other-home-a-conversation-with-cam-isaac/id1740613045?i=1000679836790",
        "youtube": "https://www.youtube.com/watch?v=wvLFhxEqYVg"
      }
    },
    {
      "id": "1e346100-ba6f-4dd8-8911-648bcc90a75e",
      "title": "Spiral Dynamics and Religious Growth - Part 2",
      "description": "In this episode, Weylin continues his exploration of the theory of spiral dynamics, a psychological model for religious growth.\n\n\n\n\n\nFollow us on Facebook:\n⁠⁠https://rb.gy/cj55td⁠⁠\nSubscribe on Spotify:\n⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠\nSubscribe on YouTube:\n⁠⁠https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1⁠⁠\nSubscribe on Apple Podcasts:\n⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠⁠\n\n\nAre you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcastTeam@gmail.com or message us on Facebook. We would love to hear from you.\n\n\nSupport Us On Patreon:\n⁠⁠https://patreon.com/OurPeoplePodcast⁠",
      "release": "2024-12-01T12:00:00Z",
      "duration": "00:49:08",
      "explicit": false,
      "spotifyId": "4wkhOpie8PB4Qa7bCoLFg8",
      "appleId": 1000678780191,
      "youTubeId": "dqxcqx9Rsq8",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wkhOpie8PB4Qa7bCoLFg8",
        "apple": "https://podcasts.apple.com/podcast/spiral-dynamics-and-religious-growth-part-2/id1740613045?i=1000678780191",
        "youtube": "https://www.youtube.com/watch?v=dqxcqx9Rsq8"
      }
    },
    {
      "id": "a956186c-607b-4dac-98d5-809059031014",
      "title": "Mamzy\u0027s Story of Kidnapping and Abuse at a Holdeman Care Facility: A Voice From Crooked Creek",
      "description": "In this episode, Amanda and Weylin hear from Roberta, who was abducted from her mother by Hilltop Mission, a children\u0027s home that was then operated by Church of God in Christ Mennonite. Following her kidnapping, she details years of abuse including sexual assaults and regular beatings that left major emotional scars. Mamzy, as her loved ones call her, goes on to describe how her \u0022foster parents\u0022 turned her into a missionary, pressing her to try to convert fellow indigenous children. At one point, she recounts, she was told to hide several Indigenous children within the childcare facility so that their parents could not take them home. Eventually, police intervened, stopping the abduction. As she grew older, she left the church and built a life of her own. Mamzy pursued an education in Indigenous counseling and has a family of her own. If you would like to learn more about her story, her forthcoming book is titled The Lucky One: A Memoir of the Sixty Scoop Woman by Roberta McKinnen.",
      "release": "2024-11-24T12:00:00Z",
      "duration": "01:57:17.3100000",
      "explicit": true,
      "spotifyId": "5CA1n2ANXf6ZTsV3kdIunv",
      "appleId": 1000678062130,
      "youTubeId": "CVFf694Qnjc",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5CA1n2ANXf6ZTsV3kdIunv",
        "apple": "https://podcasts.apple.com/podcast/mamzys-story-of-kidnapping-and-abuse-at-a/id1740613045?i=1000678062130",
        "youtube": "https://www.youtube.com/watch?v=CVFf694Qnjc"
      }
    },
    {
      "id": "6a624730-6db5-4a5a-bfd4-1baab32c9bd6",
      "title": "Ray\u0027s Story of Faith and Family on the Mennonite Margins: A Voice From Fredonia",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, Waylon and Amanda welcome Ray, who takes us on a journey through his life as a member of the Church of God in Christ Mennonite. Ray begins by introducing himself as someone currently living in Muskogee, Oklahoma, but his story starts in the small, tight-knit congregation of Crooked Creek in northern Alberta, Canada. At just four years old, Ray’s family moved to Kansas, where he grew up in the Fredonia congregation, a community that profoundly shaped his worldview and sense of belonging. Ray shares vivid anecdotes from his upbringing, including the challenges of transitioning from one congregation to another at a young age and the deep familial roots that connected him to the church. His father was an outsider who joined the Holdeman faith, while his mother came from a well-established Holdeman family in Halstead, Kansas. These contrasting backgrounds provided Ray with a unique perspective on faith, tradition, and the sense of community within the church. One of the most impactful chapters of Ray’s life was his time in the Holdeman voluntary service units, an alternative to military service for conscientious objectors. He recounts how this experience gave him the opportunity to step outside the insular Holdeman world and connect with others in meaningful ways while still adhering to the church’s commitment to nonviolence. Ray reflects on the camaraderie, challenges, and moments of personal growth he experienced during his time in voluntary service, offering a rare glimpse into how this tradition shaped his understanding of work, service, and faith. His stories from this period reveal both the joys and the challenges of maintaining the Holdeman values in a broader societal context. Throughout the conversation, Ray reflects on the distinct practices and beliefs that defined his early life. He discusses the church\u0027s emphasis on unity, the simplicity of lifestyle, and the powerful role of family in shaping personal and spiritual identity. He also touches on the sacrifices and decisions his parents made in their faith journey and how those choices impacted his own understanding of what it means to grow up within a high-control religious group. Ray doesn’t shy away from discussing the challenges of Holdeman life. He talks about the cultural expectations placed on individuals and families and the way those expectations influenced his upbringing. His stories offer a nuanced perspective on the joys and struggles of belonging to such a close-knit faith community. This episode is a heartfelt exploration of roots, resilience, and faith as Ray offers a window into his life’s journey. Whether you grew up in the Holdeman church or are curious about its culture and traditions, this conversation is full of relatable moments and deep reflections on the enduring impact of faith, family, and service. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045 Are you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcast@gmail.com or message us on Facebook. We would love to hear from you. Support Us On Patreon: ⁠https://patreon.com/OurPeoplePodcast⁠",
      "release": "2024-11-17T12:00:00Z",
      "duration": "01:18:56.2980000",
      "explicit": false,
      "spotifyId": "1MU2z8jNu7xwQlOgweivcg",
      "appleId": 1000677221370,
      "youTubeId": "gI5Vlr28_Kk",
      "subjects": [
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1MU2z8jNu7xwQlOgweivcg",
        "apple": "https://podcasts.apple.com/podcast/rays-story-of-faith-and-family-on-the/id1740613045?i=1000677221370",
        "youtube": "https://www.youtube.com/watch?v=gI5Vlr28_Kk"
      }
    },
    {
      "id": "410180e5-37ac-44f8-930e-153ebdc38a42",
      "title": "Rosina\u0027s Story of Leaving and Living Fully: A Voice From Crooked Creek",
      "description": "In this heartfelt episode of Our People: Holdeman Mennonite Stories, we sit down with Rosina Friesen, who offers a candid and inspiring account of her life’s journey. Born in 1950 in Crooked Creek, Alberta, Rosina grew up as the third of nine children in a bustling, hardworking family. Now living in Peace River, Alberta, she reflects on her early years in a traditional, close-knit community, shaped by the teachings of the Church of God in Christ Mennonite. Rosina’s story takes us through her career as a licensed practical nurse, a path she pursued with determination and compassion. She speaks about the joys and challenges of working in healthcare, especially as she balanced her professional aspirations with the church\u0027s strict gender roles and expectations. Her nursing career became a place where she could channel her innate drive to help others, but it also highlighted the tensions she felt between her evolving personal values and the constraints of her faith. As Rosina began questioning the church’s teachings, particularly its emphasis on conformity and control, she faced an inner battle that ultimately led to her decision to leave. She reflects on the courage it took to walk away from the only community she had ever known, and the profound personal growth she experienced in doing so. Leaving the church was not just about stepping into a new chapter but about rebuilding her sense of identity and autonomy. While it came with heartbreak—especially in navigating relationships with loved ones still in the church—it also brought new opportunities for self-discovery. One of the most striking anecdotes Rosina shares is how, later in life, she took up running as a way to challenge herself and embrace her independence. She humorously recounts the struggles and triumphs of starting to run as an elderly woman, defying expectations and finding joy in surprising new ways. This anecdote reflects a recurring theme in her story: the resilience to embrace change, the courage to try something new, and the determination to live life on her own terms. Rosina’s journey is a powerful reminder that it’s never too late to reinvent yourself, seek freedom, and carve out a life that reflects who you truly are. With warmth, humility, and a spark of humor, she invites listeners to reflect on their own paths and the strength it takes to walk toward authenticity. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045 Are you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcast@gmail.com or message us on Facebook. We would love to hear from you.",
      "release": "2024-11-10T12:00:00Z",
      "duration": "00:59:58.1970000",
      "explicit": false,
      "spotifyId": "40ZqZWyhbpffnL4a3goYZ4",
      "appleId": 1000676362290,
      "youTubeId": "YGU6-OXC6gI",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/40ZqZWyhbpffnL4a3goYZ4",
        "apple": "https://podcasts.apple.com/podcast/rosinas-story-of-leaving-and-living-fully-a/id1740613045?i=1000676362290",
        "youtube": "https://www.youtube.com/watch?v=YGU6-OXC6gI"
      }
    },
    {
      "id": "8643d439-2280-489b-ab40-4ca3f675f417",
      "title": "Herman\u0027s Story of Discovering the Challenges of Freedom and Building A Life Outside: A Voice From Crooked Creek",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, Amanda is joined by Herman Friesen, who shares his deeply personal story of growing up in a Holdeman Mennonite family and his life after leaving the church. Herman begins by recounting his early years, including his father’s role as a preacher and the significant moment when his father was \u0022benched\u0022 from preaching when Herman was only four years old. He shares how he was converted at age 10 and baptized at 11, reflecting on the strong spiritual framework that shaped his childhood. As the conversation progresses, Herman dives into his experience of leaving the Holdeman church and navigating life beyond its strict boundaries. He talks about the struggles of breaking away from a high-control religious community, including the feelings of isolation, confusion, and loss. Herman opens up about how hard it was to reconcile the faith he was raised in with the new beliefs he was beginning to form. He shares the emotional toll of distancing himself from family and friends who remained in the church, highlighting the personal costs of leaving. Herman also discusses the sense of freedom he found after leaving, including the opportunities to explore different ways of thinking and living. He talks about building a new life, developing new friendships, and finding a different sense of purpose outside of the Holdeman church. His story is one of resilience, as he found ways to balance his respect for his roots with his desire for independence and personal growth. This episode provides an intimate, detailed look at what it’s like to grow up in and eventually leave a high-control religious environment. Herman’s honesty and vulnerability make this episode a powerful exploration of faith, identity, and the challenges of starting over. It’s a must-listen for anyone interested in the human side of religious transitions and personal transformation. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045 Are you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcast@gmail.com or message us on Facebook. We would love to hear from you.",
      "release": "2024-11-04T19:09:55Z",
      "duration": "02:10:57.9980000",
      "explicit": false,
      "spotifyId": "4heXL4XWTRxegfSC584a3o",
      "appleId": 1000675663821,
      "youTubeId": "fCXuW0Mki2Y",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4heXL4XWTRxegfSC584a3o",
        "apple": "https://podcasts.apple.com/podcast/hermans-story-of-discovering-the-challenges/id1740613045?i=1000675663821",
        "youtube": "https://www.youtube.com/watch?v=fCXuW0Mki2Y"
      }
    },
    {
      "id": "e3336853-da3f-4cba-bb79-ef09775a4236",
      "title": "Tyson\u0027s Story of Struggle and Recovery: A Voice from Edberg",
      "description": "This episode of Our People: Holdeman Mennonite Stories features Tyson, a guest who joins Amanda to discuss his journey of personal growth, healing, and self-discovery. Tyson starts off nervously but quickly opens up, sharing how he envisioned a podcast like this two years ago as a way for people with similar experiences to connect and heal. Surprisingly, Tyson discovered the podcast only a few months prior, making his appearance feel almost serendipitous.\n\n\n\n\nIn the episode, Tyson dives into his background, touching on the struggles and turning points he encountered while grappling with his faith, identity, and community expectations. He candidly reflects on moments of self-doubt and the process of unlearning some of the restrictive beliefs he grew up with. Tyson emphasizes the importance of acknowledging pain and past traumas as steps toward finding peace. He and Amanda discuss the broader themes of community, acceptance, and what it means to find freedom while staying true to one’s values.\n\n\n\n\nListeners will hear Tyson’s reflections on family and friendship, especially how relationships change when one\u0027s belief system evolves. His honesty offers an insightful look into how leaving or questioning a high-control church affects not only one\u0027s spiritual path but also personal relationships and self-worth.\n\n\n\n\nThis episode is a heartfelt and raw conversation, encouraging those who may feel isolated in their journey to find connection and support through shared stories. Tyson’s words will resonate with anyone who has experienced a period of questioning and transformation, particularly within tight-knit religious communities.\n\n\n\n\nIf you would like to reach out to Tyson, he can be reached at \u002B17802818686.\n\nFollow us on Facebook:\n\nhttps://rb.gy/cj55td\n\nSubscribe on Spotify:\n\nhttps://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490\n\nSubscribe on YouTube:\n\nhttps://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1\n\nSubscribe on Apple Podcasts:\n\nhttps://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045\n\n\n\n\nAre you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcast@gmail.com or message us on Facebook. We would love to hear from you.",
      "release": "2024-10-27T12:45:28Z",
      "duration": "02:09:55",
      "explicit": false,
      "spotifyId": "1s2BKfVgTRQZZl7pkln9GB",
      "appleId": 1000674607197,
      "youTubeId": "vvHLpcvgvwE",
      "subjects": [
        "The Church Of God In Christ"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1s2BKfVgTRQZZl7pkln9GB",
        "apple": "https://podcasts.apple.com/podcast/tysons-story-of-struggle-and-recovery-a-voice-from-edberg/id1740613045?i=1000674607197",
        "youtube": "https://www.youtube.com/watch?v=vvHLpcvgvwE"
      }
    },
    {
      "id": "e146f08f-4795-4969-a91e-67aa1894e37e",
      "title": "Nolan\u0027s Story of Questioning Tradition and Leaving the Fold: A Voice From Kidron",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, Weylin Unruh sits down with Nolan Raber to discuss his life growing up in the Church of God in Christ Mennonite community and his journey of leaving the church. Nolan starts by sharing his early years in Kidron, Ohio, where he spent the first eight years of his life. He reflects on the close-knit nature of the Holdeman community and the strong emphasis on conformity, which played a significant role in shaping his upbringing. Nolan opens up about the expectations and pressures he faced as a young member of the church, touching on the social norms that guided everyday life and the ways in which questioning or deviating from the established beliefs was often met with resistance. He describes how the church’s teachings permeated all aspects of life, from schooling to social interactions, creating an environment where adhering to the group\u0027s standards was seen as crucial for spiritual well-being. As the conversation unfolds, Nolan recounts the internal struggle he experienced when his personal beliefs began to diverge from those of the church. He discusses moments of doubt, the fear of disappointing loved ones, and the difficulties of reconciling his own questions with the teachings he was raised to accept without hesitation. These conflicts eventually led him to step away from the Holdeman faith, a decision that came with both loss and newfound freedom. Nolan also shares the challenges of adjusting to life outside the church, where navigating a world with different social norms, customs, and even dress codes was unfamiliar. He reflects on the process of building a new identity and forming relationships beyond the Holdeman community. Throughout the episode, Nolan\u0027s story is filled with moments of vulnerability, humor, and resilience, as he candidly talks about the ups and downs of transitioning from a life of rigid expectations to one of self-discovery. This episode not only provides a window into Nolan\u0027s personal journey but also explores broader themes of cultural conditioning, faith, and the search for meaning. It’s a compelling look at how leaving a tightly controlled religious environment can affect one\u0027s sense of self and worldview, and what it means to find one’s own path in life. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045 Are you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcast@gmail.com or message us on Facebook. We would love to hear from you.",
      "release": "2024-10-20T23:02:17Z",
      "duration": "00:56:12.2990000",
      "explicit": false,
      "spotifyId": "4m4FWaWenLYD0j5CM9tjvO",
      "appleId": 1000673775370,
      "youTubeId": "sRinEnnq0ok",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4m4FWaWenLYD0j5CM9tjvO",
        "apple": "https://podcasts.apple.com/podcast/nolans-story-of-questioning-tradition-and-leaving/id1740613045?i=1000673775370",
        "youtube": "https://www.youtube.com/watch?v=sRinEnnq0ok"
      }
    },
    {
      "id": "2b3ad841-6da3-4aec-ae62-12040e03c053",
      "title": "Spiral Dynamics and Religious Growth - Part 1",
      "description": "The episode of Our People: Holdeman Mennonite Stories features Amanda as the host and Waylon as the guest. The discussion dives into the concept of spiral dynamics, a psychological model used to explain human development and behavior, especially in the context of religion.\n\nWaylon introduces spiral dynamics as a tool that has helped him understand why people react in different ways depending on their stage of psychological development. He emphasizes that the model is not hierarchical, meaning no level is inherently superior to another. Instead, each stage represents a necessary step in a person\u0027s journey.\n\nWaylon describes spiral dynamics as particularly useful in explaining behaviors within religious communities, such as the Holdeman Mennonites. He talks about how his understanding of this model has influenced his view of human interaction and the ways people respond to religious teachings and authority.\n\nThe conversation touches on the nuances of how spiral dynamics can shed light on the conflicts and challenges people face when trying to engage with or leave high-control religious environments. Waylon provides examples of how people within these communities are often at different psychological stages, which can lead to misunderstandings or friction, especially for those who are questioning or evolving beyond the traditional teachings of the church.\n\nAmanda guides the conversation, asking questions to clarify the model and its applications. The episode offers listeners insights into the complexities of human psychology within the context of faith and the Holdeman Mennonite experience.\nFollow us on Facebook:\nhttps://rb.gy/cj55td\nSubscribe on Spotify:\nhttps://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490\nSubscribe on YouTube:\nhttps://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1\nSubscribe on Apple Podcasts:\nhttps://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045\n\nAre you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcast@gmail.com or message us on Facebook. We would love to hear from you.",
      "release": "2024-10-13T18:11:27Z",
      "duration": "01:28:01",
      "explicit": false,
      "spotifyId": "1ZDLG77X8DpMPwdLgPUdWe",
      "appleId": 1000672938699,
      "youTubeId": "Sr7I7vdOo4A",
      "subjects": [
        "The Church Of God In Christ",
        "Psychology",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1ZDLG77X8DpMPwdLgPUdWe",
        "apple": "https://podcasts.apple.com/podcast/spiral-dynamics-and-religious-growth-part-1/id1740613045?i=1000672938699",
        "youtube": "https://www.youtube.com/watch?v=Sr7I7vdOo4A"
      }
    },
    {
      "id": "6dadb9e6-617e-45fe-b6ab-67e3bc41bc0b",
      "title": "Avoidance Kills: A Discussion with Mary Byler",
      "description": "In this episode, titled \u0022Avoidance Kills: A Discussion With Mary Byler,\u0022 Amanda and Billy explore the impact of avoidance, a term used within the Church of God in Christ Mennonite for shunning. Mary Byler, founder of The Misfit Amish, discusses how the practice of avoidance, or shunning, within high-control Anabaptist communities perpetuates harm by isolating individuals and suppressing important conversations about abuse, trauma, and healing. Mary shares her personal journey of leaving a plain-dressing community and the work she now does to support others through her organization. She emphasizes how avoidance not only affects those who are shunned but also creates a culture where the most vulnerable are silenced. Throughout the episode, Mary discusses her advocacy work, which includes educating professionals like child advocacy centers on how to better serve survivors of abuse from these insular communities. This conversation sheds light on the psychological and emotional toll of avoidance, illustrating how it can cause lasting damage to individuals and communities. By tackling this issue head-on, Mary provides crucial insights into why addressing, rather than avoiding, these issues is vital for healing and justice. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045 Are you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcast@gmail.com or message us on Facebook. We would love to hear from you.",
      "release": "2024-10-06T20:41:53Z",
      "duration": "01:46:02.4330000",
      "explicit": false,
      "spotifyId": "2LOZIemd9pTXRsp8zh374j",
      "appleId": 1000671984134,
      "youTubeId": "dJo_wJlDn0k",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite",
        "Amish",
        "Anabaptism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2LOZIemd9pTXRsp8zh374j",
        "apple": "https://podcasts.apple.com/podcast/avoidance-kills-a-discussion-with-mary-byler/id1740613045?i=1000671984134",
        "youtube": "https://www.youtube.com/watch?v=dJo_wJlDn0k"
      }
    },
    {
      "id": "dd7510e6-932e-4374-bc1f-0b54d082463f",
      "title": "Amanda\u0027s Story of Moving On: A Voice From Phoenix",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, our very own Amanda Esau takes the spotlight to share her personal journey, while being interviewed by Starla and Jordie. Born in Phoenix to a mixed-race family, Amanda opens up about the challenges she faced growing up with a Hispanic mother and a Caucasian father. She recalls how the cultural and racial differences were met with resistance within the Holdeman church, sharing a painful moment when her father was told, \u0022I guess somebody has to marry them,\u0022 a reference to their interracial relationship. Amanda walks listeners through her early years in Phoenix before moving at age 10. Her childhood story is a powerful reflection on navigating a rigid religious community as someone with a biracial background. Throughout the episode, she discusses how the church\u0027s racial biases and conservative values shaped her family dynamics and personal development. As the conversation progresses, Amanda reflects on her eventual departure from the Holdeman church. Her story touches on deep issues such as family loyalty, the challenge of questioning long-held beliefs, and the courage it took to break away from a restrictive environment. Her journey reveals the difficulties of reconciling faith with personal identity, and the often-overlooked experiences of people of color within such a homogenous church community. The episode ends on a hopeful note, with Amanda reflecting on the growth and freedom she found after leaving the church, and how her past shaped who she is today. Starla and Jordie offer thoughtful questions, making this episode an intimate and heartfelt exploration of identity, faith, and resilience. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045 Are you or is someone you know interested in sharing a story on the podcast? Reach out to OurPeoplePodcast@gmail.com or message us on Facebook. We would love to hear from you.",
      "release": "2024-09-30T04:45:41Z",
      "duration": "01:24:14.9020000",
      "explicit": false,
      "spotifyId": "2DujulhizgSsax9nX1QAX7",
      "appleId": 1000671246830,
      "youTubeId": "v0x3DWcePj0",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite",
        "Self-Help"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2DujulhizgSsax9nX1QAX7",
        "apple": "https://podcasts.apple.com/podcast/amandas-story-of-moving-on-a-voice-from-phoenix/id1740613045?i=1000671246830",
        "youtube": "https://www.youtube.com/watch?v=v0x3DWcePj0"
      }
    },
    {
      "id": "7dfbeabe-3671-4741-a6f3-8d2e3b3aff0b",
      "title": "Jaclyn\u0027s Story of Searching and Discovery: A Voice From Kidron",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, hosts Weylin and Amanda sit down with Jaclyn (Jackie) Peachey to discuss her life journey, growing up within the Holdeman community and eventually finding her way out. Jackie opens up about her early life in Moundridge, Kansas, where her father left the family when she was just nine months old. She reflects on the strength of her mother, who went to nursing school and raised Jackie and her siblings on her own, becoming one of Jackie’s greatest role models. Jackie talks about her family’s move to Kidron, Ohio, when she was six years old, describing the community as somewhat closed off, rooted in an Amish-Mennonite background. However, her family ties in the area helped ease the transition, and Jackie shares her fondness for the close-knit environment, even though it could be isolating. The conversation turns more introspective as Jackie recounts her spiritual journey, including her struggles to fit in within the Holdeman church. She recalls feeling like an outsider, never quite connecting with the Holdeman way of life or understanding concepts like the Holy Spirit. This led to internal conflict, particularly after her baptism, when she initially felt a sense of joy but quickly slipped back into old behaviors, leaving her feeling guilty and disconnected. One pivotal moment in Jackie’s story came when, at the age of 15, she and a close friend began to question whether the Holdeman church was truly the \u0022one true church\u0022 as they had been taught. Their exposure to conservative Mennonites and Amish communities sparked deeper questions about faith, belonging, and the truth of their religious upbringing. Jackie shares the challenges of navigating these doubts in a community where questioning was discouraged, and how it impacted her sense of identity. Throughout the episode, Jackie reflects on the difficulty of feeling like she had to present a false version of herself to fit in, and the relief and eventual growth that came with leaving the Holdeman church. Her story is one of resilience, self-discovery, and the courage to question long-held beliefs in the search for personal truth. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-09-22T11:00:00Z",
      "duration": "01:01:30.9320000",
      "explicit": false,
      "spotifyId": "7sNFzzlbPzd0xi0gwd9mGE",
      "appleId": 1000670296730,
      "youTubeId": "N5TNsq0u3x8",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite",
        "Amish"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7sNFzzlbPzd0xi0gwd9mGE",
        "apple": "https://podcasts.apple.com/podcast/jaclyns-story-of-searching-and-discovery-a/id1740613045?i=1000670296730",
        "youtube": "https://www.youtube.com/watch?v=N5TNsq0u3x8"
      }
    },
    {
      "id": "dc4960dd-0c80-42a4-8145-ce9cc7814699",
      "title": "Laura\u0027s Story of Coping and Overcoming: A Voice From Monterey",
      "description": "This episode of \u0022Our People: Holdeman Mennonite Stories\u0022 features Laura Smith, who shares her journey growing up in the Church of God in Christ Mennonite and her eventual departure from the church at the age of 20. Originally from the Walker, Missouri congregation, Laura\u0027s family moved to Monterey, Tennessee when she was 12, and she describes the challenges and experiences that came with that transition. Laura delves into her early memories of the Holdeman Church, reflecting on the strict rules, community expectations, and the sense of belonging that defined her upbringing. She provides insight into the daily life of a young girl in the Holdeman community, including the limited access to mainstream culture and the emphasis on maintaining a lifestyle that aligned with the church\u0027s teachings. Laura speaks candidly about the internal and external pressures she faced, particularly as she grew older and began questioning the beliefs and practices she had been taught. As she recounts her teenage years, Laura discusses the pivotal moments that led to her decision to leave the church. She describes the complexities of navigating relationships with family and friends who remained in the church, as well as the emotional toll of stepping away from the only community she had ever known. Laura shares personal anecdotes that highlight the difficulties of breaking free from a high-control environment, including the fear of ostracism and the struggle to find her identity outside the confines of the church\u0027s doctrine. Throughout the episode, Laura\u0027s story is one of resilience and self-discovery. She speaks about the healing process and the new opportunities that opened up once she left the church. Laura also touches on the broader themes of autonomy, freedom of choice, and the journey toward self-acceptance, providing listeners with a heartfelt narrative that underscores the complexities of leaving a high-control religious group. This episode offers a deep, personal look into the life of someone who grew up in and eventually left the Holdeman community, providing a relatable and poignant account of the challenges and triumphs faced along the way. Laura\u0027s story is a testament to the strength it takes to pursue one\u0027s own path, even when it means leaving behind a deeply ingrained way of life. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-09-15T05:31:32Z",
      "duration": "02:08:16.5820000",
      "explicit": false,
      "spotifyId": "33FmJjcpSzQjN1779xsex7",
      "appleId": 1000669579151,
      "youTubeId": "bUVbkRKZ0Nw",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/33FmJjcpSzQjN1779xsex7",
        "apple": "https://podcasts.apple.com/podcast/lauras-story-of-coping-and-overcoming-a-voice-from-monterey/id1740613045?i=1000669579151",
        "youtube": "https://www.youtube.com/watch?v=bUVbkRKZ0Nw"
      }
    },
    {
      "id": "2d985c6d-dde0-4366-a930-e3040907a00f",
      "title": "Christine\u0027s Story of Leaving The Church and its Psychological Impacts: A Voice From Central Kansas",
      "description": "In this episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 Weylin sits down with Chris, a former member of a Central Kansas congregation of the Church of God in Christ Mennonite. Chris offers a candid look into her life, from growing up in a rural farming family to navigating her way out of the Holdeman church and redefining her beliefs. Chris recounts her childhood as the youngest of four daughters in a family that thrived on hard work and connection to the land. Her days were filled with farm chores, driving trucks during wheat harvest, and helping her father care for the animals. While she describes her upbringing as largely positive, she also touches on the underlying challenges, such as her family\u0027s financial struggles when a bad water well led to the loss of cattle—a hardship that cast a shadow on her early years and taught her resilience. From an early age, Chris sensed that she was different. She was introspective and often found herself questioning the practices and teachings of the Holdeman church. This questioning nature set her apart and made her feel disconnected within the large congregation she was a part of. Chris shares her experience of being an introvert in a community that often felt overwhelming and how she found solace in her relationships with non-Holdeman relatives, which broadened her perspective and introduced her to ideas beyond the church’s doctrines. Throughout the conversation, Chris delves into her psychological journey, detailing how she turned to various authors and teachers to explore new ways of thinking. She reflects on how her personality and experiences shaped her worldview, and how, over time, she began to see religion as often mirroring the personality of its founders—a realization that prompted her to question the foundations of her faith even more deeply. Chris also speaks about the emotional and mental challenges of leaving the church, including the process of unlearning deeply ingrained beliefs and coping with the sense of loss that accompanies such a profound change. She emphasizes the importance of finding one\u0027s own path to healing and hope, sharing personal stories of growth and the small but significant steps she has taken toward reclaiming her sense of self outside the church. In this heartfelt episode, Chris opens up about her ongoing journey—a journey that is not yet complete but is filled with determination and a desire for authenticity. Her story is a powerful reminder of the complexities involved in stepping away from a high-control religious environment and the courage it takes to pursue a life aligned with one’s true values. Join Weylin and Chris as they explore the nuanced paths of questioning, leaving, and ultimately, finding peace beyond the confines of a close-knit religious community. Follow us on Facebook: ⁠⁠⁠⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠⁠⁠⁠ Subscribe on Spotify: ⁠⁠⁠⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠⁠⁠⁠ Subscribe on YouTube: ⁠⁠⁠⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠⁠⁠⁠ Subscribe on Apple Podcasts: ⁠⁠⁠⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠⁠⁠⁠⁠",
      "release": "2024-09-08T09:29:51Z",
      "duration": "01:57:22.1220000",
      "explicit": false,
      "spotifyId": "77jCf7sU842oztJKhHWgb9",
      "appleId": 1000668768247,
      "youTubeId": "roV6zyPL6P8",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/77jCf7sU842oztJKhHWgb9",
        "apple": "https://podcasts.apple.com/podcast/christines-story-of-leaving-the-church-and/id1740613045?i=1000668768247",
        "youtube": "https://www.youtube.com/watch?v=roV6zyPL6P8"
      }
    },
    {
      "id": "9603f6f5-d89a-4432-b372-9be5bf8a2cc7",
      "title": "David\u0027s Story of Excommunication and Starting Over In Alaska: A Voice From Bonners Ferry",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, host Amanda sits down with David Justus, a former member of the Church of God in Christ Mennonite, to share his life journey that led him from the confines of the Holdeman community to the expansive wilderness of Alaska. David talks about his early years growing up in the Livingston congregation and later moving to the Bonners Ferry congregation, where strict rules and expectations shaped every aspect of his life. He reflects on the sense of community and belonging he initially felt, and the gradual shift as he began questioning the church’s teachings and the high control environment that governed his world. David opens up about the inner turmoil of trying to conform to the church’s strict doctrines while grappling with his own evolving beliefs. He shares personal stories that illustrate the conflict between maintaining his faith and the desire for personal freedom. As David’s doubts grew, so did his courage to explore life beyond the Holdeman church, despite knowing it would mean a painful separation from his family and friends. A significant part of David’s story is his move to Alaska, a bold step that marked the beginning of a new chapter in his life. He describes the challenges of starting over in an unfamiliar place, far from the only community he had ever known. In Alaska, David found both the physical and emotional distance needed to reflect on his past and rebuild his life. The vast landscapes of Alaska became a backdrop for his journey of self-discovery and the pursuit of a life aligned with his true beliefs. Throughout the episode, David shares the emotional highs and lows of leaving the Holdeman church, the difficulties of adjusting to life outside, and the resilience it took to carve out a new path for himself. Amanda guides the conversation with care, creating a space for David to share his story with honesty and depth. This episode offers listeners an insightful look into the complexities of leaving a high-control religious group and the unexpected places that journey can lead. David Justus’s story is one of courage, transformation, and the pursuit of freedom, set against the dramatic backdrop of Alaska’s wilderness. Join us as we explore his path from the Holdeman church to a life of independence and self-discovery. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-09-01T11:00:00Z",
      "duration": "02:43:56.5520000",
      "explicit": false,
      "spotifyId": "5lJoBB597OEWcGapL7sVf2",
      "appleId": 1000667956585,
      "youTubeId": "AiNtOBmaU5w",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5lJoBB597OEWcGapL7sVf2",
        "apple": "https://podcasts.apple.com/podcast/davids-story-of-excommunication-and-starting-over/id1740613045?i=1000667956585",
        "youtube": "https://www.youtube.com/watch?v=AiNtOBmaU5w"
      }
    },
    {
      "id": "a1998fc3-9569-40c2-829c-b29ae48d4e03",
      "title": "The Holdeman Church Through the Post-War Period: A Time Of Change",
      "description": "In this episode, Caleb Jesser and Dennis Goossen take listeners through the transformative decades of the 1940s to the 1960s for the Holdeman Church, officially known as the Church of God in Christ, Mennonite. This episode is part of the series \u0022Our Heritage: Holdeman Mennonite History,\u0022 which explores the critical changes and developments that shaped the church during societal upheaval. The discussion opens with a reflection on the immediate post-war era. Caleb and Dennis provide context about how World War II\u0027s end brought significant changes globally and within the Holdeman community. They discuss how conscientious objectors returning from alternative service units brought back new perspectives, sometimes leading to tensions and debates within the church. These returning members had been exposed to broader societal norms and ideas, which sparked internal discussions about the community\u0027s engagement with the outside world and interpretations of core doctrines, including the church’s emphasis on non-conformity to worldly practices. Moving into the 1950s, the conversation shifts to how the Holdeman Church responded to the rise of modernity and secularism. The hosts discuss the church leaders\u0027 concerns over the growing influence of radio, television, and other forms of media, which were viewed as potential threats to spiritual purity. These new technologies were believed to be gateways to worldly influences that could erode the community\u0027s values. As a result, church leadership enforced stricter guidelines and promoted a more insular approach to protect their members from perceived moral decay. As they explore the internal dynamics of the 1960s, Caleb and Dennis highlight the social and cultural shifts that impacted the Holdeman Church. This decade saw the church grappling with external pressures to modernize, which contrasted sharply with the desire to maintain traditional values. These discussions included debates on issues such as dress codes, musical influences, and levels of community involvement. These debates often created friction within the church, as some members pushed for a more adaptive approach while others sought to hold firmly to established traditions. A significant part of the episode covers the factions that split from the church during this time of change. Caleb and Dennis discuss various groups that broke away due to disagreements over doctrinal interpretations, lifestyle practices, or the church’s stance on modern influences. These splits often came after prolonged periods of internal conflict and were marked by deep divisions within congregations, reflecting the broader struggle between maintaining doctrinal purity and adapting to a rapidly changing world. The episode also touches on the evolution of the church\u0027s governance and decision-making processes during this period. With the increasing complexities of managing a growing congregation, the church\u0027s leadership structure adapted to better address the diverse challenges faced by the community. This led to a more formalized approach to governance that continues to shape the church today. In closing, Caleb and Dennis reflect on how the post-war period up to the late 1960s was a pivotal era of change for the Holdeman Church, setting the stage for its future. The church\u0027s responses to both external and internal pressures laid the groundwork for its modern identity and practices. This episode provides a rich, detailed look at a crucial period in Holdeman Mennonite history, offering valuable insights into the community\u0027s struggles, adaptations, and steadfastness in faith. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-08-29T19:46:35Z",
      "duration": "00:50:38.6060000",
      "explicit": false,
      "spotifyId": "5130tZTw6sofcNnG5UDG0A",
      "appleId": 1000667189939,
      "youTubeId": "b1QsCOyJtZs",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5130tZTw6sofcNnG5UDG0A",
        "apple": "https://podcasts.apple.com/us/podcast/the-holdeman-church-through-the-post-war-period/id1740613045?i=1000667189939",
        "youtube": "https://www.youtube.com/watch?v=b1QsCOyJtZs"
      }
    },
    {
      "id": "ec101b3a-fe5e-403e-a6c3-d153280b9460",
      "title": "Jordie\u0027s Story of Spiritual Abuse, Healing, and Transformation: A Voice From Linden",
      "description": "In this heartfelt episode of Our People: Holdeman Mennonite Stories, Amanda sits down with Jordie, formerly known as Julie, to explore her journey into and out of the Church of God in Christ Mennonite. Jordie shares candid reflections on her childhood, growing up first in Linden, Alberta, and later in Pincher Creek. She speaks warmly of her early years, recalling a childhood filled with love, family, and a sense of community. However, Jordie also opens up about the duality of her experience, where alongside the warmth and happiness, there was an undercurrent of fear deeply rooted in the church\u0027s culture. Jordie describes herself as a sensitive child who keenly felt the pervasive atmosphere of fear within the church environment. Despite the good memories, the fear she carried was something she internalized and never shared with others. Instead, she found solace in journaling and art, which became her private outlets for processing the complex emotions she experienced. As the conversation unfolds, Jordie delves into the nuances of her identity and the significant steps she took in reclaiming her life after leaving the church. She discusses her decision to change her name from Julie to Jordie, symbolizing a new chapter in her life and a break from the past. Through her story, Jordie offers listeners a profound insight into the challenges of growing up in a high-control religious environment and the journey of finding one\u0027s true self outside of it. This episode is a touching and relatable narrative for anyone who has grappled with the fear and expectations imposed by a strict religious upbringing. Jordie\u0027s story is one of resilience, self-discovery, and the power of creative expression in the face of adversity. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-08-25T11:29:12Z",
      "duration": "01:16:16.3220000",
      "explicit": false,
      "spotifyId": "6YD0RN3C8pb73uUUOg0VJT",
      "appleId": 1000666530109,
      "youTubeId": "Qf8QdJz3YTU",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6YD0RN3C8pb73uUUOg0VJT",
        "apple": "https://podcasts.apple.com/podcast/jordies-story-of-spiritual-abuse-healing/id1740613045?i=1000666530109",
        "youtube": "https://www.youtube.com/watch?v=Qf8QdJz3YTU"
      }
    },
    {
      "id": "d12e35d9-5ecd-4d9f-a991-bff6e4a86a5d",
      "title": "Doreen\u0027s Story of Childhood Abuse and Transitions of Faith: A Voice From Crooked Creek",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, Weylin sits down with Doreen from the Crooked Creek congregation of Church of God in Christ Mennonite. She tells of her childhood in the church, her path out of the organization, and her faith journey after leaving. Her story features candid discussion of childhood sexual abuse, emotional manipulation, and other traumatic events. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-08-18T11:00:00Z",
      "duration": "00:54:22.7490000",
      "explicit": false,
      "spotifyId": "1cpCM96fwVJbMI81Lr5DnE",
      "appleId": 1000665774977,
      "youTubeId": "UEdSCLtgH54",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cpCM96fwVJbMI81Lr5DnE",
        "apple": "https://podcasts.apple.com/podcast/doreens-story-of-childhood-abuse-and-transitions/id1740613045?i=1000665774977",
        "youtube": "https://www.youtube.com/watch?v=UEdSCLtgH54"
      }
    },
    {
      "id": "b14fc872-ff59-406b-ad44-01c9f47c3c5a",
      "title": "Carolyn\u0027s Story of Single Motherhood and Family Separation: A Voice From Crooked Creek",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, host Amanda sits down with Carolyn, who shares her deeply personal journey of growing up and living within the Holdeman Mennonite community. Carolyn’s story is one of resilience, especially as she navigates the complexities of being a woman and a single mother in a patriarchal and high-control religious system. Carolyn begins by reflecting on her early years in Crooked Creek, where the church\u0027s teachings and sense of community provided her with a foundation. However, as she matured, she became increasingly aware of the strict roles imposed on women within the church. The expectations were clear: women were to be obedient, submissive and focused on homemaking and child-rearing. Carolyn describes the immense pressure to conform to these roles, which left little room for personal growth or autonomy. As a single mother, Carolyn faced additional scrutiny and judgment from the church staff and the broader community. She recounts how her status as a single mother was often viewed with suspicion, as though it signified a failure to adhere to the church’s standards of marriage and family life. The lack of support for single mothers within the church only exacerbated the challenges she faced, leaving her to navigate motherhood largely on her own while still trying to meet the church’s demanding expectations. Carolyn also speaks candidly about her interactions with church and school staff, who often reinforced patriarchal norms that kept women like her in subservient positions. She shares instances where she felt marginalized and disempowered by the male-dominated leadership, who were more interested in maintaining control than offering compassion or understanding. The episode takes a significant turn as Carolyn questions the roles and expectations placed upon her. She reflects on the moment she recognized that her worth was not defined by the church’s patriarchal standards but by her strength and values. This realization became a catalyst for her decision to leave the church and pursue a life where she could be true to herself and her children, free from the oppressive structures that had once held her back. Carolyn’s journey is not just one of breaking free from a controlling religious environment but also a story of reclaiming her identity as a woman and a mother. Despite the emotional and societal challenges, she emerges with a profound sense of self-worth and a determination to provide a better life for herself and her children, outside the confines of the church’s rigid doctrines. This episode offers a deeply moving exploration of the intersection between gender, religion, and personal freedom. Carolyn’s story sheds light on the unique struggles faced by women and single mothers in high-control religious groups and underscores the courage it takes to defy patriarchal norms and forge a path of independence. Her testimony is a powerful reminder of the importance of self-empowerment and the strength that comes from breaking free of oppressive systems. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-08-14T05:09:34Z",
      "duration": "00:34:42.3560000",
      "explicit": false,
      "spotifyId": "7dxwdBVO385fuuVUTlFZta",
      "appleId": 1000665225040,
      "youTubeId": "Ig5w9RrB8aQ",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7dxwdBVO385fuuVUTlFZta",
        "apple": "https://podcasts.apple.com/podcast/carolyns-story-of-single-motherhood-and/id1740613045?i=1000665225040",
        "youtube": "https://www.youtube.com/watch?v=Ig5w9RrB8aQ"
      }
    },
    {
      "id": "15b6fdce-c62b-4a0f-b6a3-ef307ebc3403",
      "title": "Teran\u0027s Story of Not Fitting In and Getting Out: A Voice From Carson City",
      "description": "In this episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 Teran Rinehart shares the story of her life, focusing on her challenging experiences growing up in the Carson City, Michigan congregation of Church of God in Christ Mennonite and its school. Teran begins by recounting the remarkable story of her grandmother, who was born into a wealthy family in Santiago, Chile, but left it all behind to become a mail-order bride in Michigan. Yolanda\u0027s journey into the Mennonite community had a lasting impact on her family, including Teran. As Teran reflects on her upbringing, she opens up about the hardships she faced in the Holdeman church school. Teran describes how she was not well-liked and often felt miserable, struggling to make friends. The school environment was particularly difficult for her as a queer, autistic child, and she endured frequent bullying. Despite her intelligence, Teran found herself in a classroom where she was the oldest and often felt smarter than both her classmates and her teachers. She candidly discusses the inadequacies of the Mennonite teachers, many of whom only had an eighth-grade education and were more focused on finding a husband than on teaching. Teran\u0027s experiences were further compounded by the lack of support from the school staff, who failed to address the bullying she faced. She shares a particularly painful memory of a teacher dismissing her after she reported being physically abused at home, illustrating the broader issue of Mennonite teachers not complying with their legal obligations as mandatory reporters. The constant bullying and lack of support left Teran feeling like the laughingstock of the school, and these experiences had a lasting impact on her. Despite these challenges, Teran found solace in teaching Bible school, which became one of her biggest passions. She reflects on her attempts to be a \u0022good Mennonite,\u0022 actively participating in Sunday school and trying her best to fit in, even as she struggled with the rigid expectations of the church. This episode offers an honest and poignant look at the difficulties of growing up in the Holdeman Mennonite church, particularly within its educational system. Teran’s story sheds light on the emotional toll of being a child in an environment where conformity was prized over individuality, and where support was often lacking. Her experiences provide a valuable perspective on the challenges faced by those who didn’t fit the mold in a strict religious community, making this episode a powerful and eye-opening listen. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-08-11T09:56:15Z",
      "duration": "02:42:01.0570000",
      "explicit": false,
      "spotifyId": "1cV0eqR01IOULHaOAYc9Tw",
      "appleId": 1000664940334,
      "youTubeId": "_ScR2rx707w",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1cV0eqR01IOULHaOAYc9Tw",
        "apple": "https://podcasts.apple.com/podcast/terans-story-of-not-fitting-in-and-getting-out/id1740613045?i=1000664940334",
        "youtube": "https://www.youtube.com/watch?v=_ScR2rx707w"
      }
    },
    {
      "id": "3b418648-e88c-429d-9eda-25531d02a4b1",
      "title": "Wes\u0027s Story of Disillusionment, Loss, and Spiritual Growth: A Voice From Barron",
      "description": "In this episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 we had the pleasure of sitting down with Wes Friesen from the Barron, Wisconsin congregation of Church of God in Christ Mennonite. Wes takes us on a journey through his life, sharing intimate and heartfelt stories about his upbringing, experiences within the church, and his eventual path out of the Holdeman community. Wes begins by recounting his childhood in Barron, Wisconsin, a place where he spent the majority of his formative years. He reflects on the strong sense of community and belonging that characterized his early life, describing the close-knit nature of the Holdeman Mennonite congregation and the deep-rooted traditions that shaped his worldview. Despite the warmth and support of the community, Wes also touches on the restrictive aspects of growing up in a high-control environment, where conformity and adherence to church doctrines were paramount. As Wes delves deeper into his story, he shares poignant anecdotes about pivotal moments in his life. He speaks candidly about the internal struggles he faced as he began to question the teachings and practices of the church. These moments of doubt and introspection eventually led him to seek a life beyond the confines of the Holdeman community. One of the most compelling parts of Wes\u0027s narrative is his account of the personal and emotional challenges he encountered during his transition out of the church. He talks about the feelings of isolation and the loss of familial connections that often accompany such a significant life change. Despite these hardships, Wes\u0027s resilience and determination shine through as he describes how he rebuilt his life, forging new relationships and finding a sense of purpose outside the Holdeman Mennonite faith. Throughout the episode, Wes\u0027s storytelling is infused with a mix of humor, reflection, and raw honesty. He shares lighter moments that highlight the quirks and idiosyncrasies of life within the church, providing listeners with a nuanced perspective on the Holdeman experience. At the same time, his more serious reflections offer a profound insight into the personal cost of leaving a high-control religious group. Wes\u0027s story is not just one of leaving, but also of growth and self-discovery. He talks about the newfound freedoms and opportunities he has embraced since leaving the church, and how these have allowed him to explore his own identity and beliefs. His journey is a testament to the strength and courage it takes to break away from a life that no longer aligns with one\u0027s values and to seek out a path that is true to oneself. In this episode, listeners are invited to witness Wes\u0027s transformation from a young boy in Barron, Wisconsin, to a man who has navigated the complexities of faith, community, and personal identity. His story is a powerful reminder of the resilience of the human spirit and the enduring quest for authenticity and freedom. Join us as we listen to Wes Friesen\u0027s inspiring journey on \u0022Our People: Holdeman Mennonite Stories.\u0022 His tale is a compelling addition to our series, offering hope and encouragement to anyone who has ever questioned their path and sought to forge a new direction in life. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast?sub_confirmation=1 Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-08-04T07:22:00Z",
      "duration": "01:48:55.7390000",
      "explicit": false,
      "spotifyId": "6wMJfIp2nREll1tVIl3IVz",
      "appleId": 1000664264525,
      "youTubeId": "L9eIXi71rr0",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6wMJfIp2nREll1tVIl3IVz",
        "apple": "https://podcasts.apple.com/podcast/wess-story-of-disillusionment-loss-and-spiritual/id1740613045?i=1000664264525",
        "youtube": "https://www.youtube.com/watch?v=L9eIXi71rr0"
      }
    },
    {
      "id": "425c5110-958c-42a9-83b1-f8cc89a9b699",
      "title": "Sandra\u0027s Story of Strength Through Isolation, Abuse, and Healing: A Voice From Steinbach",
      "description": "In this episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 we sit down with Sandra Loewen, who hails from the Steinbach, Manitoba congregation of Church of God in Christ Mennonite. Sandra opens up about her unique life journey, beginning with her adoption into a Holdeman Mennonite family at just two weeks old. Raised within the church, Sandra’s early life was deeply rooted in the values and practices of the Holdeman community. She shares the love and nurturing she received from her adoptive parents, highlighting her father\u0027s caring nature and her mother\u0027s intelligence and strength. Sandra discusses the complex feelings she experienced growing up in the Holdeman church. Despite her deep connection to her family and faith, she sometimes struggled with the strictures of the religious environment. These moments of anger and confusion were tempered by her belief in divine providence—a protective, guiding force she felt directed her life. Sandra eloquently describes how this sense of spiritual guidance helped her reconcile her past struggles with her present understanding of purpose and destiny. Sandra also shares poignant stories from her time in the church, including being disallowed from speaking to girls for years after someone accused her of homosexuality. This accusation led to severe social ostracism, which deeply affected her mental and emotional well-being. Despite the harsh judgment and alienation, Sandra found strength within herself, drawing on her inner resilience to navigate these difficult times. Throughout the episode, Sandra reflects on her life beyond the Holdeman church. She and her husband, also raised in the Holdeman faith, built a life together, raising two daughters and enjoying the blessings of two grandchildren. Sandra’s narrative is a testament to the resilience and growth that comes from navigating the challenges of a high-control religious community while seeking personal identity and meaning. Join us as Sandra Loewen shares her heartfelt story of faith, family, and personal discovery. Her reflections provide a nuanced perspective on the intricate interplay between spirituality and identity, offering listeners valuable insights into life within and beyond the Holdeman Mennonite community. This episode is a compelling exploration of love, resilience, and the search for meaning in a complex world. Follow us on Facebook: ⁠⁠⁠⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠⁠⁠⁠ Subscribe on Spotify: ⁠⁠⁠⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠⁠⁠⁠ Subscribe on YouTube: ⁠⁠⁠⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠⁠⁠⁠ Subscribe on Apple Podcasts: ⁠⁠⁠⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠⁠⁠⁠⁠",
      "release": "2024-07-28T11:00:00Z",
      "duration": "01:41:34.6880000",
      "explicit": false,
      "spotifyId": "1Lg5jBMGcADeEmUTMNBuj3",
      "appleId": 1000663573330,
      "youTubeId": "jL8v4EH56r8",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1Lg5jBMGcADeEmUTMNBuj3",
        "apple": "https://podcasts.apple.com/podcast/sandras-story-of-strength-through-isolation-abuse/id1740613045?i=1000663573330",
        "youtube": "https://www.youtube.com/watch?v=jL8v4EH56r8"
      }
    },
    {
      "id": "0defabb2-f8c1-47d4-9db3-f30fd834dbe3",
      "title": "Stewart\u0027s Story of Losing Everything and Building a New Life In Kenya: A Voice From Carson City",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, we are joined by Stuart Litwiller, who shares his profound journey from being deeply involved in Church of God in Christ Mennonite to building a new life in Kenya. Stuart starts by recounting his early years in Carson City, Michigan, and his move to Murray, Kentucky, where he took on significant leadership roles within the church.\n\nStuart\u0027s story takes a pivotal turn as he describes his baptism at age 13, which left him feeling unchanged and disconnected from the spiritual transformation he had expected. By age 16, Stuart was ready to leave the church altogether, feeling a strong desire to break away from the faith that no longer resonated with him. He candidly shares the moment when a fellow youth member\u0027s genuine concern led him to reconsider his decision and ultimately resulted in his excommunication.\n\nStuart\u0027s path back to the church was fraught with uncertainty, yet he persisted in his search for spiritual fulfillment. His interactions with a man who would later become a minister, Tim Buck, were instrumental in his journey back to the church, where he was eventually reaccepted. Despite this, Stuart\u0027s spiritual journey continued to evolve, leading him to significant life changes.\n\nStuart recounts a cycle of excommunications and reacceptances, reflecting a continuous struggle with his faith. He shares how, at age 18, he enjoyed attending classes but found it difficult to return home, leading to another excommunication. This pattern repeated, with Stuart being reaccepted and then excommunicated again at age 22, shortly after his marriage.\n\nDespite managing to stay in the church until age 49, Stuart reveals that he never truly felt assured of his salvation or experienced the grace he sought. His final departure from the church was catalyzed by a disagreement with his wife over refinancing their debt, which escalated and involved church deacons. During a revival, Stuart was confronted by church leaders who suggested he was born again but never truly converted, leading to his excommunication.\n\nFeeling disillusioned, Stuart attempted to rejoin the church but ultimately decided to pursue a different path. He relocated to Katali, Kenya, seeking a fresh start. Stuart delves into the challenges and rewards of adapting to a new culture and building a new community. His resilience and determination shine through as he reflects on his journey from excommunication to establishing a fulfilling life in Kenya.\n\nListeners will be inspired by Stuart\u0027s story of leaving behind a restrictive religious environment, overcoming personal and spiritual struggles, and finding a new sense of purpose and community in Kenya. This episode offers a heartfelt exploration of faith, resilience, and the transformative power of new beginnings.\n\nJoin us for an insightful and moving conversation with Stuart Litwiller as he shares his remarkable journey of faith, loss, and renewal.\n\n\n\nFollow us on Facebook:\n\n⁠⁠⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠⁠⁠\n\nSubscribe on Spotify:\n\n⁠⁠⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠⁠⁠\n\nSubscribe on YouTube:\n\n⁠⁠⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠⁠⁠\n\nSubscribe on Apple Podcasts:\n\n⁠⁠⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠",
      "release": "2024-07-21T16:25:59Z",
      "duration": "01:23:24",
      "explicit": false,
      "spotifyId": "0CbC7Xss2x29cSmvacl7vK",
      "appleId": 1000662892029,
      "youTubeId": "h2VcJycBzn4",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0CbC7Xss2x29cSmvacl7vK",
        "apple": "https://podcasts.apple.com/podcast/stuarts-story-of-losing-everything-and-building-a/id1740613045?i=1000662892029",
        "youtube": "https://www.youtube.com/watch?v=h2VcJycBzn4"
      }
    },
    {
      "id": "8b7d10fe-3439-4200-a24e-9f4a0738c59a",
      "title": "Barb\u0027s Story of Being a Wild Child and Learning Self Love: A Voice From Fairview",
      "description": "In this episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 we sit down with Barb Wedel, who takes us on a journey through her life growing up in the Fairview congregation of Church of God in Christ Mennonite. Barb, a self-proclaimed wild child, shares how she always felt like a bit of a rebel in a community that prized conformity.\n\nBarb talks about her family\u0027s deep ties to the church, with both her parents raised within its strict confines. She recounts a touching story about her maternal grandfather, who, fearing for his soul, joined the church at the age of 90. This act underscores the intense pressure and indoctrination prevalent in their beliefs.\n\nThroughout the episode, Barb reflects on her spirited nature and the challenges it brought her in a high-control religious environment. She candidly discusses the moments that made her question her faith and ultimately led her to leave the church. A significant part of her story is discovering that being a wild child was not just okay but something to be celebrated.\n\nBarb shares how she saw herself in her daughter, who inherited her free spirit and zest for life. This realization helped Barb embrace her own nature, recognizing that her daughter\u0027s wonderful qualities were a reflection of her own.\n\nTune in to hear Barb Wedel\u0027s honest and heartfelt tale of growing up, rebelling, and finding freedom outside the Holdeman Mennonite Church. Her journey is a testament to the strength it takes to forge your own path and the joy that comes with living authentically.\n\n\n\n\nFollow us on Facebook:\n\n⁠⁠⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠⁠⁠\n\nSubscribe on Spotify:\n\n⁠⁠⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠⁠⁠\n\nSubscribe on YouTube:\n\n⁠⁠⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠⁠⁠\n\nSubscribe on Apple Podcasts:\n\n⁠⁠⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠⁠⁠⁠",
      "release": "2024-07-14T08:01:23Z",
      "duration": "01:29:34",
      "explicit": false,
      "spotifyId": "0pCnlZUzOM6sXVM22ZslkH",
      "appleId": 1000662156714,
      "youTubeId": "W4uy2ZYz9xc",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0pCnlZUzOM6sXVM22ZslkH",
        "apple": "https://podcasts.apple.com/podcast/barbs-story-of-being-a-wild-child-and-learning/id1740613045?i=1000662156714",
        "youtube": "https://www.youtube.com/watch?v=W4uy2ZYz9xc"
      }
    },
    {
      "id": "a800daff-7ec1-485e-a92d-97039968454d",
      "title": "Stanley\u0027s Story of Education and Being What He Must: A Voice From Greensburg",
      "description": "In this compelling episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 we sit down with Stanley Unruh to explore his unique journey into and out of the Holdeman Mennonite Church. Stanley, originally from the Greensburg Kansas congregation of Church of God In Christ Mennonite shares his deeply personal story of growing up within the high-control religious community, the pivotal moments that led him to question his beliefs, and the challenges he faced while transitioning to life outside the church. Listeners will be captivated by Stanley\u0027s honest and heartfelt reflections on the emotional and psychological impact of leaving a close-knit community. He discusses the struggle to find his identity and the liberation he felt upon embracing his true self. A poignant highlight of the episode is Stanley\u0027s reference to the lyric, \u0022Be what you must. It\u0027s part of the plan,\u0022 which encapsulates his journey towards authenticity and personal freedom. Stanley also offers a balanced perspective, acknowledging the positive aspects of his Holdeman upbringing, including the strong sense of community and values instilled in him. His story is one of resilience and courage, providing a relatable and inspiring narrative for anyone who has questioned their own path in life. Join us for an episode that delves deep into the complexities of faith, identity, and belonging, as Stanley Unruh\u0027s story unfolds with candor and insight. Whether you\u0027re familiar with the Holdeman Mennonite Church or simply interested in personal stories of transformation, this episode is sure to resonate and inspire. Follow us on Facebook: ⁠⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠⁠ Subscribe on Spotify: ⁠⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠⁠ Subscribe on YouTube: ⁠⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠⁠ Subscribe on Apple Podcasts: ⁠⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠⁠⁠",
      "release": "2024-07-07T09:47:17Z",
      "duration": "01:07:10.6570000",
      "explicit": false,
      "spotifyId": "0Hxcp1bSPrb8rPUETUSGEs",
      "appleId": 1000661430203,
      "youTubeId": "Bb8BTVGjnYo",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Hxcp1bSPrb8rPUETUSGEs",
        "apple": "https://podcasts.apple.com/podcast/stanleys-story-of-education-and-being-what-he-must/id1740613045?i=1000661430203",
        "youtube": "https://www.youtube.com/watch?v=Bb8BTVGjnYo"
      }
    },
    {
      "id": "14a0b1c2-b185-48ff-bb66-73c54e34a866",
      "title": "Larissa\u0027s Story of Struggle and Growth: A Voice from Ithaca",
      "description": "In this episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 host Waylon sits down with Larissa, a former member of Church of God in Christ Mennonite. Larissa begins by sharing her background, growing up in the Ithaca, Michigan congregation, which she considered her home despite living in a few other congregations throughout her life. She delves into her family history, mentioning that her parents owned and operated the Mennonite nursing home, Maple View, in Michigan. This setting significantly influenced her early life experiences.\n\nLarissa discusses her upbringing within the Holdeman community, providing insights into her childhood and the cultural and religious environment she was immersed in. She reflects on the values and traditions that shaped her identity and the pivotal moments that led her to question and eventually leave the church.\n\nThroughout the conversation, Larissa candidly shares her journey of self-discovery, the challenges she faced, and the personal growth she experienced after leaving the Holdeman Mennonite faith. Her story is a compelling narrative of resilience and the search for authenticity outside the confines of her religious upbringing.\n\nJoin us for an engaging and heartfelt episode as Larissa opens up about her past, her struggles, and the path she has forged beyond the Holdeman Mennonite community. Her story is a testament to the strength and courage it takes to redefine one\u0027s beliefs and find a new sense of belonging.\n\n\n\n\n\nFollow us on Facebook:\n\n⁠⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠⁠\n\nSubscribe on Spotify:\n\n⁠⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠⁠\n\nSubscribe on YouTube:\n\n⁠⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠⁠\n\nSubscribe on Apple Podcasts:\n\n⁠⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠",
      "release": "2024-06-30T08:17:53Z",
      "duration": "00:47:39",
      "explicit": false,
      "spotifyId": "2po0Ms79fiFj0ASXOVvX2H",
      "appleId": 1000660679295,
      "youTubeId": "CByx2YacWmQ",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2po0Ms79fiFj0ASXOVvX2H",
        "apple": "https://podcasts.apple.com/podcast/larissas-story-of-struggle-and-growth-a-voice-from-ithaca/id1740613045?i=1000660679295",
        "youtube": "https://www.youtube.com/watch?v=CByx2YacWmQ"
      }
    },
    {
      "id": "5acd2a23-bd8a-4742-9e3e-4a1a56e02052",
      "title": "The Holdeman Church Through The Early 1900s",
      "description": "In this special bonus episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 host Caleb sits down with historian Dennis Goossen for a comprehensive discussion on the history of the Church of God in Christ, Mennonite, also known as the Holdeman Church, during the early 1900s. This episode delves into critical historical moments and their lasting impact on the Holdeman community.\n\nDennis Goossen provides an expert\u0027s perspective on the leadership transitions following the death of John Holdeman, the founder of the church. The conversation explores the challenges and complexities of leadership succession during a period marked by internal conflicts and external pressures. Goossen discusses the key figures who stepped into leadership roles and the influence they had on the church\u0027s direction.\n\nThe episode also covers significant events such as the impact of the World Wars on the Holdeman community. Listeners will learn how the church navigated the tumultuous times of global conflict and how these events shaped the beliefs, practices, and cohesion of the community. The discussion offers a detailed look at the social and cultural dynamics within the Holdeman Church, providing valuable insights into the church\u0027s evolution during the early 20th century.\n\nThrough Goossen\u0027s scholarly lens, listeners gain a deeper understanding of the pivotal moments that have defined the Holdeman Church\u0027s history. This episode is a must-listen for anyone interested in Mennonite history, church leadership dynamics, and the resilience of religious communities in the face of adversity.\n\nTune in for a fascinating journey through the early 1900s history of the Holdeman Church, exploring the events and personalities that have significantly shaped its path.\n\n\n\n\nFollow us on Facebook:\n\n⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠\n\nSubscribe on Spotify:\n\n⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠\n\nSubscribe on YouTube:\n\n⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠\n\nSubscribe on Apple Podcasts:\n\n⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠",
      "release": "2024-06-26T08:31:00Z",
      "duration": "01:02:46",
      "explicit": false,
      "spotifyId": "4RsFpusBp6VzxJzaHkPMbY",
      "appleId": 1000660288658,
      "youTubeId": "zhok41xjwWE",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4RsFpusBp6VzxJzaHkPMbY",
        "apple": "https://podcasts.apple.com/podcast/the-holdeman-church-through-the-early-1900s/id1740613045?i=1000660288658",
        "youtube": "https://www.youtube.com/watch?v=zhok41xjwWE"
      }
    },
    {
      "id": "548d99be-d392-45d2-b4e0-baa42f89eace",
      "title": "Starla\u0027s Story of Resilience and Abuse Victim Advocacy: A Voice From Linden",
      "description": "In this compelling episode of \u0022Our People: Holdeman Mennonite Stories,\u0022 we sit down with Starla, an inspiring individual who opens up about her life growing up in and eventually leaving the Holdeman church, officially known as the Church of God in Christ Mennonite. Starla was born in the close-knit community of Linden, Alberta, where she was the eighth of nine children in her family. The episode begins with Starla sharing her early memories of life in a large family, where she often felt like a forgotten child, a sentiment that has profoundly shaped her perspective. Starla candidly discusses the unique challenges she faced while growing up in a high-control religious environment. She describes the rigid structures and expectations that defined her upbringing, offering listeners a glimpse into the everyday realities of life within the Holdeman church. Her narrative provides valuable insights into the social and emotional dynamics of living in a community where conformity and obedience are paramount. A significant portion of the episode is dedicated to Starla\u0027s transformative journey after leaving the church. She talks about the difficulties and triumphs she encountered as she navigated life outside of the only community she had ever known. Starla’s story is one of resilience and self-discovery, highlighting her determination to build a new life on her own terms. Starla’s work as a sexual abuse victim advocate is another focal point of the conversation. She shares how her personal experiences have fueled her passion for advocacy and her commitment to educating professionals about the intricacies of high-control religious organizations. Her advocacy work is crucial in helping survivors of abuse find their voice and in raising awareness about the often hidden challenges faced by individuals who leave such groups. Throughout the episode, Starla’s strength and dedication shine through. She reflects on the importance of support networks and the role they played in her journey towards healing and empowerment. Her story is a testament to the power of resilience and the human spirit’s capacity for growth and transformation. This episode is a must-listen for anyone interested in the complexities of high-control religious groups, the challenges of breaking free, and the inspiring stories of those who have found their voice and purpose beyond such communities. Join us as we listen to Starla’s extraordinary journey, filled with poignant moments, hard-earned wisdom, and a hopeful outlook. If Starla\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠ourpeoplepodcastteam@gmail.com⁠ with your thoughts or suggestions for future interviews. Follow us on Facebook: ⁠⁠https://rb.gy/cj55td⁠⁠ Subscribe on Spotify: ⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠ Subscribe on YouTube: ⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠ Subscribe on Apple Podcasts: ⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠",
      "release": "2024-06-23T11:00:00Z",
      "duration": "01:28:18.5910000",
      "explicit": false,
      "spotifyId": "13uhs2VDdMOx7fHHfJ3Am9",
      "appleId": 1000659946618,
      "youTubeId": "Payoy5JdDm8",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/13uhs2VDdMOx7fHHfJ3Am9",
        "apple": "https://podcasts.apple.com/podcast/starlas-story-of-resilience-and-abuse-victim/id1740613045?i=1000659946618",
        "youtube": "https://www.youtube.com/watch?v=Payoy5JdDm8"
      }
    },
    {
      "id": "3871ac76-0619-4499-afdc-8482a91bed17",
      "title": "Charlotte\u0027s Story of Family Separation and Healing: A Voice from Abbotsford",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, we sit down with a young woman from the Abbotsford, British Columbia congregation of Church of God in Christ Mennonite, who we will call Charlotte for this interview. At 22, Charlotte shares her life story, starting with her unique family background. Her father is a generational Mennonite, deeply rooted in the traditions and values of the Holdeman Mennonite community. Her mother, however, was not born into the faith; a Mennonite family fostered her after her mother passed away and her father was unable to care for her. Charlotte\u0027s parents faced significant pressure from both their families and the Mennonite ministers to marry young after her mother became pregnant. This pressure led them to a hasty marriage, with their first child arriving six months later. Initially living in Manitoba, they had two sons before moving to British Columbia, where they had two more children, including Charlotte. Charlotte delves into the complexities of her family life, describing how her parents struggled to balance their responsibilities and the expectations of their faith community. The ministers in BC played a significant role in their lives, enforcing strict adherence to the church\u0027s rules. When Charlotte was around six months old, tensions within the community and within her family began to escalate. A particularly harrowing part of Charlotte\u0027s story involves the family separation enforced by the ministers. Her brothers were taken from the family by the ministers, a decision that deeply impacted Charlotte and her siblings. This separation was a profound and traumatic experience, adding to the emotional turmoil within the family. Her father remained a steadfast member of the Mennonite community, while her mother sought a different path, leading to further strain and eventual separation. Charlotte also reflects on her own journey of growth and self-discovery after leaving the Holdeman Mennonite faith. She speaks candidly about the challenges of forging a new identity outside the community and the support she found along the way. Her story is one of resilience, courage, and the enduring search for belonging. Join us to hear more about Charlotte\u0027s inspiring journey, her experiences with family separation, and the lessons she has learned about faith, family, and finding one\u0027s own path in life. Follow us on Facebook: ⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠ Subscribe on Spotify: ⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠ Subscribe on YouTube: ⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠ Subscribe on Apple Podcasts: ⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠⁠",
      "release": "2024-06-16T07:33:10Z",
      "duration": "01:09:12.1410000",
      "explicit": false,
      "spotifyId": "1E5LwU9nsperExEJVMKZwG",
      "appleId": 1000659154475,
      "youTubeId": "EyJbgUz2ix4",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1E5LwU9nsperExEJVMKZwG",
        "apple": "https://podcasts.apple.com/podcast/charlottes-story-of-family-separation-and-healing/id1740613045?i=1000659154475",
        "youtube": "https://www.youtube.com/watch?v=EyJbgUz2ix4"
      }
    },
    {
      "id": "e2f575d8-a89a-43dc-8f9c-c99771f04d4a",
      "title": "Jules\u0027 Story of Escaping Abuse and Finding Freedom: A Voice From Steinbach",
      "description": "In this episode of Our People: Holdeman Mennonite Stories, hosts Waylon and Amanda engage in an intimate conversation with Jules Thiessen, offering a profound look into her life and experiences. Originally known as Jules Penner, Jules shares her journey from growing up in the Steinbach congregation, to forging a new identity outside the Holdeman Mennonite community. At the age of 25, Jules candidly recounts her departure from the church, a decision marked by personal and communal challenges. She provides an unflinching account of the struggles and triumphs encountered, including the difficult realities of leaving a tightly-knit faith community. Jules\u0027 story is one of resilience, courage, and the pursuit of authenticity amidst adversity. In a poignant and powerful segment, Jules discusses the abuse she endured, shedding light on the darker aspects of her past and the profound impact it had on her journey. This episode delves into the complexities of identity, faith, trauma, and healing, offering listeners a raw and honest portrayal of Jules\u0027 path to self-discovery and empowerment. Listeners will gain a deeper understanding of the Holdeman Mennonite culture, the emotional and psychological toll of transitioning away from a deeply rooted faith, and the strength required to rebuild one\u0027s life. Jules\u0027 narrative is not just about leaving a community but about reclaiming her voice and finding a new sense of self and belonging. Join us for an episode filled with reflection, resilience, and the transformative power of storytelling as Jules Thiessen shares her journey with vulnerability and bravery. Content Warning: This episode contains discussions of abuse. Please take care while listening. Follow us on Facebook: ⁠⁠⁠https://rb.gy/cj55td⁠⁠⁠ Subscribe on Spotify: ⁠⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠⁠ Subscribe on YouTube: ⁠⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠⁠ Subscribe on Apple Podcasts: ⁠⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠⁠",
      "release": "2024-06-09T08:47:10Z",
      "duration": "01:37:53.8150000",
      "explicit": false,
      "spotifyId": "6xoBZaqBSQ20qWHk4AJwVD",
      "appleId": 1000658342744,
      "youTubeId": "GV0ksiNZXHg",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6xoBZaqBSQ20qWHk4AJwVD",
        "apple": "https://podcasts.apple.com/podcast/jules-story-of-escaping-abuse-and-finding-freedom/id1740613045?i=1000658342744",
        "youtube": "https://www.youtube.com/watch?v=GV0ksiNZXHg"
      }
    },
    {
      "id": "bed86c8a-6101-441f-aaec-c5df4318565f",
      "title": "The Life and Legacy of John Holdeman",
      "description": "In this episode of \u0022Our People Podcast,\u0022 we dive deep into the fascinating life and legacy of John Holdeman, the founder of the Church of God in Christ, Mennonite. Our host is joined by Dennis Goossen, a CPA by profession and a passionate historian with extensive knowledge of Holdeman\u0027s life and the broader historical context of his time. Key Discussion Points: Introduction to the Episode: Introduction of the guest, Dennis Goossen, his background, and his passion for history. Setting the Historical Context: Discussion on the early 1800s, providing a backdrop to John Holdeman\u0027s life. Exploration of the social, economic, and religious climate of the time. Early Life of John Holdeman: Insights into Holdeman\u0027s upbringing and the factors that influenced his religious journey. The impact of his family\u0027s faith and the communities he was part of. Founding of the Church of God in Christ, Mennonite: The motivations behind Holdeman\u0027s decision to establish a new denomination. Key beliefs and doctrines that set the Church of God in Christ, Mennonite apart from other Anabaptist groups. Challenges and Controversies: Examination of the challenges Holdeman faced, including opposition from other religious groups. Controversies surrounding his teachings and how he addressed them. Legacy and Impact: The lasting influence of John Holdeman on the Church of God in Christ, Mennonite. Reflections on his contributions to Anabaptist theology and practice. Personal Reflections: Dennis Goossen shares his personal insights and reflections on studying Holdeman\u0027s life. Anecdotes and lesser-known stories about Holdeman\u0027s personal life and character. Conclusion: Summarizing the key takeaways from the episode. Encouragement for listeners to explore more about John Holdeman and his legacy. Listen to this episode to gain a deeper understanding of John Holdeman\u0027s life, his religious convictions, and the enduring legacy of the church he founded. ​ Follow us on Facebook: ⁠⁠https://rb.gy/cj55td⁠⁠ Subscribe on Spotify: ⁠⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠⁠ Subscribe on YouTube: ⁠⁠https://www.youtube.com/@OurPeoplePodcast⁠⁠ Subscribe on Apple Podcasts: ⁠⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045⁠",
      "release": "2024-06-05T08:37:20Z",
      "duration": "01:17:26.8020000",
      "explicit": false,
      "spotifyId": "4VN079gIoZk4oqJnoP1ha8",
      "appleId": 1000657907942,
      "youTubeId": "dlbL2NBGEb4",
      "subjects": [
        "The Church Of God In Christ",
        "Anabaptism",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4VN079gIoZk4oqJnoP1ha8",
        "apple": "https://podcasts.apple.com/podcast/the-life-and-legacy-of-john-holdeman/id1740613045?i=1000657907942",
        "youtube": "https://www.youtube.com/watch?v=dlbL2NBGEb4"
      }
    },
    {
      "id": "66e6141f-be70-460c-811a-8d687a945e78",
      "title": "Sylvia\u0027s Story of Community, Parenting, and Putting Down Roots: A Voice From Prescott",
      "description": "In this episode of \u0022Our People Podcast,\u0022 Sylvia Baize narrates her life\u0027s journey from Brazil to Arizona, sharing her experiences with faith, family, and adoption. As a Holdeman Mennonite, Sylvia faced significant challenges and judgment from her religious community, particularly regarding her decision to adopt children, including a son with special needs. Her story highlights the struggle against rigid community expectations and the transformative impact of finding a more supportive community in Arizona. Sylvia discusses her spiritual growth, the journey to adopt her children against community pressures, and her eventual move to a congregation that embraced and supported her family\u0027s choices. This episode offers a profound look at resilience, the power of supportive communities, and the courage to live one\u0027s truth through faith. Sylvia\u0027s book, It Was Meant to Be: https://a.co/d/4qXlQze Follow us on Facebook: ⁠https://rb.gy/cj55td⁠ Subscribe on Spotify: ⁠https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490⁠ Subscribe on YouTube: ⁠https://www.youtube.com/@OurPeoplePodcast⁠ Subscribe on Apple Podcasts: ⁠https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-06-02T11:00:00Z",
      "duration": "00:57:08.5540000",
      "explicit": false,
      "spotifyId": "13YtcYto9OA3vxz95Q5cWU",
      "appleId": 1000657560231,
      "youTubeId": "AqKyfqs6-Ag",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/13YtcYto9OA3vxz95Q5cWU",
        "apple": "https://podcasts.apple.com/podcast/sylvias-story-of-community-parenting-and-putting/id1740613045?i=1000657560231",
        "youtube": "https://www.youtube.com/watch?v=AqKyfqs6-Ag"
      }
    },
    {
      "id": "09c12978-e71d-443f-985e-ba93ffb2a285",
      "title": "Dennis’ Story of Church Reform and Life After Excommunication: A Voice From Norquay",
      "description": "In this episode of the Our People Podcast, Dennis Goossen tells how his life\u0027s story entered and then exited the Holdeman church, Church of God in Christ Mennonite. He begins by describing his conversion experience and joining the church. Then he tells about a faith crisis and subsequent reconsecration in his late teens. From there, he married and started a family within the church. Finally, he describes his involvement in an effort to reform the more legalistic aspects of the church which resulted in a letter called \u0022A Plea For Revival\u0022. He was subsequently excommunicated, expelled, after church authorities demanded that he recant and retract the letter. Finally, he describes building a life after the Holdeman church and his latest project, forming a Christian school. A Plea For Revival Letter: https://rb.gy/pxe143 If Dennis\u0027 story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠OurPeoplePodcastTeam@gmail.com⁠ with your thoughts or suggestions for future interviews. Follow us on Facebook: https://rb.gy/cj55td Subscribe on Spotify: https://open.spotify.com/show/1KwYkbtbIswUN3z6JSrqz5?si=0913b1c334724490 Subscribe on YouTube: https://www.youtube.com/@OurPeoplePodcast Subscribe on Apple Podcasts: https://podcasts.apple.com/us/podcast/our-people-holdeman-mennonite-stories/id1740613045",
      "release": "2024-05-26T11:00:00Z",
      "duration": "01:17:44.4390000",
      "explicit": false,
      "spotifyId": "6ESiLJ1UNfzAk1CHoJnX6j",
      "appleId": 1000656791220,
      "youTubeId": "Ja1XE0mY-A4",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6ESiLJ1UNfzAk1CHoJnX6j",
        "apple": "https://podcasts.apple.com/podcast/dennis-story-of-church-reform-and-life/id1740613045?i=1000656791220",
        "youtube": "https://www.youtube.com/watch?v=Ja1XE0mY-A4"
      }
    },
    {
      "id": "267c3dcd-1d92-492a-92ae-49d38dae1e6e",
      "title": "Lewis\u0027 Story of Faith, Family, and Forgiveness: A Voice from Fleetwood",
      "description": "In this deeply personal episode of \u0022Our People Podcast,\u0022 Lewis delves into his spiritual journey, exploring the shifts in his faith that have significantly impacted his personal and familial relationships. From his early days rooted in traditional Holdeman Mennonite religious teachings to his present-day embrace of a more fluid and open-minded spirituality, Lewis discusses the challenges and revelations that have marked his path. Lewis opens up about the transformative power of doubt and dialogue in his life. He shares insights from his explorations of scripture, myths, and the profound lessons he has gleaned from the complexities of theological debates. Throughout the episode, Lewis reflects on the impact of these spiritual evolutions on his family dynamics, detailing the delicate balance of maintaining bonds despite differing beliefs. This episode is not just a journey through Lewis\u0027 spiritual evolution but also a meditation on the nature of belief, the importance of inclusivity in faith communities, and the ongoing quest for personal and communal harmony. Listeners will be invited to reconsider their own beliefs, the importance of open conversation, and the value of embracing uncertainty in the spiritual journey. Join us as Lewis provides a candid look at his life\u0027s struggles and triumphs, offering up his story as a testament to the power of faith, the strength of family, and the freedom that comes from seeking truth on one\u0027s own terms. If Lewis\u0027 story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠OurPeoplePodcastTeam@gmail.com⁠ with your thoughts or suggestions for future interviews.",
      "release": "2024-05-19T11:00:00Z",
      "duration": "01:50:35.2180000",
      "explicit": false,
      "spotifyId": "2J15vET3KpGYO9gTSLQNf8",
      "appleId": 1000656047786,
      "youTubeId": "hpdnHQXSj8Q",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2J15vET3KpGYO9gTSLQNf8",
        "apple": "https://podcasts.apple.com/podcast/lewis-story-of-faith-family-and-forgiveness-a/id1740613045?i=1000656047786",
        "youtube": "https://www.youtube.com/watch?v=hpdnHQXSj8Q"
      }
    },
    {
      "id": "2528c0cf-db53-45f4-b622-584057d91a3b",
      "title": "Monica\u0027s Story of Self Discovery: A Voice From Carrot River",
      "description": "In this episode of \u0022Our People Podcast,\u0022 we delve into the life and experiences of Monica from the Carrot River congregation of Church of God in Christ Mennonite. Monica shares her early life on a Canadian farm and the predestined path to her baptism at age 14 into this deeply traditional Holdeman Mennonite community. As she grew older, critical events—including the tragic death of peers and a family move—spurred profound shifts in her beliefs and feelings toward her faith. Monica candidly discusses the pressures and struggles that came with conforming to church expectations, her battle with mental health, and the eventual, liberating decision to leave the church. This episode, \u0022A Voice from Carrot River,\u0022 explores Monica\u0027s journey of self-discovery, her efforts to redefine her spirituality, and the ongoing process of healing from religious trauma. If Monica\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠OurPeoplePodcastTeam@gmail.com⁠ with your thoughts or suggestions for future interviews.",
      "release": "2024-05-12T11:00:00Z",
      "duration": "01:34:01.4710000",
      "explicit": false,
      "spotifyId": "5okwIb4Z19CTFJYMC9rntB",
      "appleId": 1000655310203,
      "youTubeId": "Em8XWhHOGRE",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5okwIb4Z19CTFJYMC9rntB",
        "apple": "https://podcasts.apple.com/podcast/monicas-story-of-self-discovery-a-voice-from-carrot-river/id1740613045?i=1000655310203",
        "youtube": "https://www.youtube.com/watch?v=Em8XWhHOGRE"
      }
    },
    {
      "id": "104e42ed-4e4b-4dbf-b1a5-90c1d8fec1c9",
      "title": "Cam\u0027s Story of Building An Honest Life: A Voice from Crooked Creek",
      "description": "In this episode of the Our People Podcast, titled \u0022Cam\u0027s Story of Building an Honest Life,\u0022 we delve into the life journey of Cam Isaac. Now residing in northern Alberta, Canada, Cam reflects on his life\u0027s narrative, emphasizing his evolution from adhering to external expectations to embracing a life grounded in honesty and self-acceptance. Raised in the deeply rooted Holdeman mennonite farming congregation in Crooked Creek, Alberta, Cam shares his upbringing in a congregation with a legacy spanning nearly a century. He discusses the complexities of growing up as the eldest child in a Holdeman community, where he adopted the \u0022good boy\u0022 persona to secure approval and avoid conflict. However, this facade led him to a cycle of dishonesty—masking his true self to fit the mold expected by the church, his community. Cam’s turning point came with his decision to leave the Holdeman faith, a move that reshaped his relationships and his sense of self. He openly discusses the challenges and liberation that came with breaking free from the religious and social expectations that had defined much of his life. This journey of self-discovery is punctuated by his diagnosis of cancer and a heart condition, which he sees not as a setback but as an opportunity for profound personal growth and reassessment of his life’s priorities. Throughout the episode, Cam emphasizes the power of authenticity, the peace that comes with living true to one\u0027s self, and the importance of unconditional love, even when it means standing alone. His story is a testament to the strength found in vulnerability and the transformative power of living a life aligned with one\u0027s deepest truths. If Cam\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠ourpeoplepodcastteam@gmail.com⁠ with your thoughts or suggestions for future interviews.",
      "release": "2024-05-05T11:00:00Z",
      "duration": "01:06:04.0060000",
      "explicit": false,
      "spotifyId": "0xFXYwnj2eWqGgpmqlRtpm",
      "appleId": 1000654574558,
      "youTubeId": "Lp8330JdUn4",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0xFXYwnj2eWqGgpmqlRtpm",
        "apple": "https://podcasts.apple.com/podcast/cams-story-of-building-an-honest-life-a/id1740613045?i=1000654574558",
        "youtube": "https://www.youtube.com/watch?v=Lp8330JdUn4"
      }
    },
    {
      "id": "d03bd777-0877-46b4-b2af-f2644e36f909",
      "title": "A Voice from Brooksville: Elizabeth\u0027s Story of Overcoming",
      "description": "Join us on a difficult journey with Elizabeth Hunt, originally from the Brooksville, Mississippi congregation of Church of God in Christ Mennonite, as she opens up about her past struggles with bullying and the deep scars left by sexual abuse, along with the painful realization of her local church\u0027s failure to support her. Yet, her story doesn\u0027t end there. Now flourishing in a new city, Emily shares how she has rebuilt her life, found strength within herself, and learned to thrive against all odds. Tune in to hear about her powerful path to healing and empowerment. If Elizabeth\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ⁠ourpeoplepodcastteam@gmail.com⁠ with your thoughts or suggestions for future interviews.",
      "release": "2024-04-28T11:00:00Z",
      "duration": "01:34:14.2920000",
      "explicit": false,
      "spotifyId": "4mXlyyZ6aTLoYLG8dGZmBq",
      "appleId": 1000653814868,
      "youTubeId": "Sl7jUlCbhNg",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4mXlyyZ6aTLoYLG8dGZmBq",
        "apple": "https://podcasts.apple.com/podcast/a-voice-from-brooksville-elizabeths-story-of-overcoming/id1740613045?i=1000653814868",
        "youtube": "https://www.youtube.com/watch?v=Sl7jUlCbhNg"
      }
    },
    {
      "id": "9cd4c30c-2660-4ae4-9abe-d83cc482a14d",
      "title": "A Voice from Crooked Creek: Laverne\u0027s Story of Resilience and Healing",
      "description": "Join us as we delve into the life journey of Laverne Friesen. Born into the Holdeman Mennonite community in Crooked Creek, Alberta, Laverne shares his candid experiences of growing up within and eventually stepping away from the Church of God in Christ Mennonite. This episode explores the complex tapestry of faith, personal growth, and the arduous path to healing from religious trauma. Discover how Laverne confronted challenges from his upbringing, questioned deep-seated beliefs, and navigated through significant life changes—from moving across Canada to reassessing his spiritual and mental health. He also touches on the sensitive subject of childhood sexual violence and the subsequent coverup by church staff, offering insights into the resilience required to overcome such profound adversities. If Laverne\u0027s story resonates with you or you have your own story to share, consider joining us as a guest to further this vital conversation. Reach out to us at ourpeoplepodcastteam@gmail.com with your thoughts or suggestions for future interviews. This episode is not just a recount of past experiences but a beacon of hope for those grappling with similar issues, highlighting the importance of emotional health, a topic often overlooked in religious communities. Listen in for a journey of courage, controversy, and the quest for emotional liberation.",
      "release": "2024-04-21T11:00:00Z",
      "duration": "01:27:44.1380000",
      "explicit": false,
      "spotifyId": "0ZHgVHKc9eO8xlzKw68Ceh",
      "appleId": 1000653105752,
      "youTubeId": "1-AtTZGG-xc",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite",
        "Cult Recovery",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0ZHgVHKc9eO8xlzKw68Ceh",
        "apple": "https://podcasts.apple.com/podcast/a-voice-from-crooked-creek-lavernes-story/id1740613045?i=1000653105752",
        "youtube": "https://www.youtube.com/watch?v=1-AtTZGG-xc"
      }
    },
    {
      "id": "18b252f6-cda9-47f7-ba80-b006d7f1f4ee",
      "title": "Trailer: Our People - Holdeman Mennonite Stories",
      "description": "Coming soon to every podcast platform known to man, the Our People podcast will feature guests with a variety of perspectives on live in and after the Holdeman church.",
      "release": "2024-03-09T12:11:48Z",
      "duration": "00:08:36.2110000",
      "explicit": false,
      "spotifyId": "4l2WJuZ3rqrVWWMubzMH08",
      "appleId": 1000652058893,
      "youTubeId": "f0ZXWtH0hEw",
      "subjects": [
        "The Church Of God In Christ",
        "Mennonite"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4l2WJuZ3rqrVWWMubzMH08",
        "apple": "https://podcasts.apple.com/podcast/trailer-our-people-holdeman-mennonite-stories/id1740613045?i=1000652058893",
        "youtube": "https://www.youtube.com/watch?v=f0ZXWtH0hEw"
      }
    }
  ]
}