{
  "id": "3d26f034-0584-496f-9903-dbdaf5e6ecbd",
  "name": "Our American Stories",
  "youTubeChannelId": "UCRV2-urlp5O4DB2otEwOCPQ",
  "episodes": [
    {
      "id": "a2b8d8a1-c530-4b1c-87d9-351e60d36caa",
      "title": "How a Michigan Cult Leader Ended Up in a Glass Coffin Filled with Treasure",
      "description": "In Benton Harbor, Michigan, a cult leader named Benjamin Purnell promised his followers eternal life...as long as they gave up everything they owned and lived by his rules. His group, the House of David, became infamous for strict celibacy, lavish mansions, and mysterious rituals. But when Purnell died of tuberculosis in 1927, chaos erupted. To keep the illusion alive, his followers placed him in a hermetically sealed glass coffin inside the colony’s Diamond House mansion.\n\nFor decades, locals whispered about “the man in the glass coffin” and the treasures buried with him. The House of David itself began to fade, but its strangest relic, a cult leader on display in his tomb, only fueled the legend. Then in 1988, thieves smashed through the mansion’s walls. What they found looked like a pharaoh’s burial chamber: diamonds, gold, priceless art, and the body of Benjamin Purnell himself.\n\nThe robbery made national news, and while most of the stolen items were recovered, the cult leader’s massive 22-carat diamond ring and jeweled medallion vanished forever. To this day, the story of the House of David and the man in the glass coffin remains one of Michigan’s most bizarre pieces of history.\n\n🎧 Want to see more? Check out Our American Stories\nVisit our website: https://www.ouramericanstories.com\n\nListen to the podcast on your favorite platform:\nApple Podcasts: https://podcasts.apple.com/us/podcast...\nSpotify: https://open.spotify.com/show/6XliwyT...\nGoogle Podcasts: https://podcasts.google.com/?feed=aHR...\niHeart Radio: https://www.iheart.com/podcast/269-ou...\n\nFollow us for even more content:\nFacebook:   / oastories  \nX (Twitter):   / realoastories  \nInstagram:   / our_american_stories  \n\n\nTags: #HouseOfDavid #BenjaminPurnell #TrueCrimeHistory #CultStories #MichiganHistory #WeirdHistory #UnsolvedMysteries #CultsAndCrime #AmericanHistory #BizarreHistory #CrimeDocumentary #HistoricalMysteries #RealCrimeStories #TrueCrimeDocumentary #mysteryhistory \n\n\nThumbnail Attribution: https://www.flickr.com/photos/upnorthmemories/38385574834\nby\nhttps://www.flickr.com/photos/upnorthmemories/\n---- https://creativecommons.org/licenses/by-nc-nd/2.0/deed.en",
      "release": "2025-10-13T12:51:27Z",
      "duration": "00:07:58",
      "explicit": false,
      "youTubeId": "QB97JNE2NXc",
      "subjects": [
        "House of David (commune)"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=QB97JNE2NXc"
      }
    }
  ]
}