{
  "_ts": 0,
  "id": "fb959bb6-1005-4150-9cba-f585b0d4433a",
  "name": "OutoftheCocoon",
  "youTubeChannelId": "UCAmnSIGz8IFcslAToW-QZ3g",
  "episodes": [
    {
      "id": "00da3eea-f9d5-4183-90da-719b46bb2d20",
      "title": "Shunned Cult Survivor Battles With Decision to Tell Dad About Memoir \u0022Out of the Cocoon\u0022",
      "description": "In 2007, I visited the old homestead in Pennsylvania where I grew up.  The farm, built in 1864, belonged to Dad’s family for 147 years.  My great-grandma lived there when she was a child.  I despised that house as a teen.  My childhood haunted me.\n\nI had a secret to tell Dad, something I knew would devastate him and possibly destroy our relationship, but I knew I had to tell him.\n\nA year earlier (2006), my memoir, “Out of the Cocoon:  A Young Woman’s Courageous Flight from the Grip of a Religious Cult,” was published.  I wanted him to know how my mother, sister and brother’s decision to shun me since 1980 had impacted my life.  I was terrified of Dad’s reaction.  Would he be forced to shun me too?  I decided to stop running from my past and face it.  \n\nThe topic of “shunning” was taboo.  Anytime I brought it up, Dad admonished me:  “It’s in the past, let it go.” For years, I wondered why I couldn’t do that.  Then I came to an epiphany.  I couldn’t let it go because it would impact my life for the next 20, 30, 40 years.   I couldn’t simply pack it into a nice box and stuff it in the past, knowing that every day going forward, I wouldn’t have a relationship with my mom, brother, sister, four nephews or niece.  Shunning wasn\u0027t simply my past; it was my future!  \n\nIn this video diary I share my most intimate concerns, knowing this would be my last visit to the old homestead, a place I grew to love and appreciate as an adult.  In the final moments of this video diary, I ask, “What do you say to someone you love when you know you have less than 24 hours left with them?”  \n\nMy dad didn’t shun me after reading my book, but he did throw it away so Mom wouldn’t find it.  He said it would “kill her.”  I respected his wishes.  This is what I wrote on the inside cover:\n\nDad, \nOur alarm signals ought to go off as soon as someone tells us their way is the only right way....when our contacts and friendships outside the organization are censored...when we consider staying in a group because we cannot bear the loss, disappointment and sorrow our leaving will cause for ourselves and others we have come to love, we are in a cult.\n- Words from Deborah Layton from the book, Seductive Poison (a Jonestown survivor)\n\nSound familiar?  I hope this book will help you understand why I could not live with my eyes wide shut.  All my love, Always, Brenda 2007\n\nThen in 2013 I made a call to Mom, a year after my dad’s death.  You can hear that conversation in this video:  “Should I Study with Jehovah’s Witnesses.  They Seem Like Very Nice People.”    https://www.youtube.com/watch?v=K9aNj8bIXDA  \n\nBy then, she had dementia, so I don’t know how much she truly comprehended, but in the video, you’ll hear her hang up on me after denying she ever shunned me.  The truth was just too painful to accept.  \n\nThis religious cult (Jehovah’s Witnesses) run by the Watchtower Bible \u0026 Tract Society has destroyed millions of families.  I call it family genocide.  Buyer beware.  For active JWs, this could be you someday.  I was never disfellowshipped when I left at 18 but I was shunned nonetheless.  My story is not unique.",
      "release": "2018-08-28T20:26:51Z",
      "duration": "00:11:01",
      "explicit": false,
      "youTubeId": "kpaiS3VIhHU",
      "subjects": [
        "Jehovah\u0027s Witnesses",
        "Peoples Temple"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=kpaiS3VIhHU"
      }
    },
    {
      "id": "9e8fbc62-77e2-464f-b038-a2f4ac6c7956",
      "title": "Jehovah\u0027s Witnesses:  What\u0027s Behind the Watchtower Curtain?",
      "description": "Are Jehovah\u0027s Witnesses kept in the dark?  Travel the yellow brick road to New Light City and learn if Jehovah\u0027s Witnesses are told everything about their religion. What is an \u0022apostate\u0022 and why is anything revealing the truth about the Watchtower leaders/organization forbidden--likened to \u0022pornography?\u0022   What are most Jehovah\u0027s Witnesses REALLY  thinking when they come to your door on a Saturday morning? Are Jehovah\u0027s Witnesses Christ-like?  Do Jehovah\u0027s Witnesses have \u0022The Truth\u0022?  Watch with an open mind and decide for yourself (without Watchtower glasses).",
      "release": "2009-07-18T16:43:25Z",
      "duration": "00:10:01",
      "explicit": false,
      "youTubeId": "Eh8T7xYbl04",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Eh8T7xYbl04"
      }
    },
    {
      "id": "54d4cfcc-f4f7-4cc5-b4b9-3ec73600594d",
      "title": "Cult Survivors:  Was Membership Your Choice?",
      "description": "Interview w/cult survivor/author, Brenda Lee.  Like a proficient con artist, cults prey upon people at the most vulnerable time in their lives and subtly create a destructive metamorphosis, hollowing out the recruitee\u0027s identity and perverting his or her family dynamics.  If you are/were in a cult or know someone in a cult, don\u0027t miss this!",
      "release": "2008-08-17T14:39:28Z",
      "duration": "00:10:01",
      "explicit": false,
      "youTubeId": "a6w0ZdujeoU",
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=a6w0ZdujeoU"
      }
    }
  ]
}