{
  "id": "c039a63f-1993-4eaf-91f8-0b513ea01d72",
  "name": "OwnUP",
  "youTubeChannelId": "UC8RiaR1m9IMvLKvBVkVpseA",
  "episodes": [
    {
      "id": "c34e1bef-786f-4125-b942-f3f3eec144c3",
      "title": "Is Your Workplace A Cult? 5 Warning Signs You Shouldn\u0027t Ignore",
      "description": "Something feel off at work but hard to explain why?\n\nSometimes it starts with small things like feeling afraid to speak up, being rewarded for staying quiet, or slowly losing touch with who you are. It’s subtle, but over time, it can chip away at confidence, peace of mind, and even your sense of identity.\n\nThis video explores how toxic work cultures can mirror high-control environments and how those unspoken rules can impact mental health more than most people realize. From silent pressure to unspoken expectations, these patterns are more common than many think and easier to miss when they’ve been normalized.\n\nIf burnout, self-doubt, or emotional disconnection have become the norm at work, this might help connect the dots.\n\nAnd if the question “Am I really in control of my choices?” has ever come up, it’s worth watching until the end.",
      "release": "2025-05-04T16:28:48Z",
      "duration": "00:15:40",
      "explicit": false,
      "youTubeId": "TyBPmHbYGEc",
      "subjects": [
        "Corporate Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=TyBPmHbYGEc"
      }
    },
    {
      "id": "7bcd5dc7-e0ef-4f79-8491-628f8a721876",
      "title": "How Youtube Changed My Life: After Leaving A Cult (Jehovah\u0027s Witnesses)",
      "description": "Escaping the Jehovah\u0027s Witnesses was one of the hardest things I\u0027ve ever done, but starting a YouTube channel changed my life in ways I never expected. 🌱 \n\nIn this video, I share my journey from leaving a high-control religion to finding healing and courage through content creation. It wasn\u0027t easy—there were moments of doubt, fear, and taking breaks to work on my inner self. \n\nBut with each video I created, I uncovered hidden passions, rebuilt my confidence, and learned to live authentically.\n\nWhether you\u0027re an ex-cult member, going through a major life transition, or just looking for some inspiration to be true to yourself, this video is for you. 🙏\n\n I hope my story helps you turn your fear into fuel and start living your truth.",
      "release": "2024-10-12T12:45:13Z",
      "duration": "00:10:55",
      "explicit": false,
      "youTubeId": "IU37_-nF0Js",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=IU37_-nF0Js"
      }
    },
    {
      "id": "874003ec-1617-4b0c-a4d6-af3ff680770d",
      "title": "They Said I’d Be Nothing If I Left—But I Proved Them Wrong",
      "description": "Have you ever been told that leaving the Jehovah\u0027s Witnesses would ruin your life? \n\nAvi lived through that fear. \n\nIn this video, she shares her emotional journey from being a fourth-generation JW, baptized at 12, to breaking free with the help of her brave kids. \n\nDiscover how she overcame shunning, heartbreak, and found the strength to build a life—and a business—that truly makes her happy. \n\nThis is a story about courage, family, and choosing love over fear.\n\nConnect with Avi:\n👉 IG - https://www.instagram.com/aplateofselfcare?utm_source=ig_web_button_share_sheet\u0026igsh=ZDNlZDc0MzIxNw==\n\n👉  Website - https://mamaavi.com/",
      "release": "2024-09-07T13:57:51Z",
      "duration": "00:51:00",
      "explicit": false,
      "youTubeId": "OnwbzDEVj6U",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OnwbzDEVj6U"
      }
    },
    {
      "id": "c90d73fd-e4e3-49dc-b00e-56f811067b15",
      "title": "Ex Jehovah\u0027s Witness: Finding Strength After Losing It All At 55",
      "description": "In this powerful and deeply moving interview, Lori Cline, a former Jehovah\u0027s Witness of 55 years, shares her incredible journey of finding herself after losing everything. From being a devoted fourth-generation Witness with a rich \u0022spiritual heritage,\u0022 Lori faced unimaginable heartbreak, losing her family, community, and even potential careers. But through the pain, she discovered her authentic self and rose stronger than ever.\n\nJoin us as Lori bravely opens up about her struggles with the organization, the devastating loss of her family, and the turning point that led her to break free. She reveals how she overcame her battles with alcohol, confronted the harsh reality of the faith she once believed in, and found healing through mindfulness, meditation, and embracing her truth.\n\nLori\u0027s story is a beacon of hope for anyone who has felt trapped, lost, or betrayed by a community they once trusted. Her message is clear: it\u0027s never too late to restart your life, find your true purpose, and live authentically.\n\nWhether you\u0027re an ex-JW looking for support, someone struggling with self-identity, or simply seeking inspiration, Lori\u0027s journey will resonate deeply. Watch this interview to understand that you are not alone, and there is always a path to healing and happiness.\n\n\n00:00 4th Generation Jehovah\u0027s Witness\n05:10 Exposing a Pedophile and Questioning Teachings\n07:16 Struggles with Alcohol and Mental Health\n08:14 Attending Women Conference and Breaking Free During Pandemic \n13:00 How JW Teachings Affected My Self-Esteem \n18:00 How I Restarted My Life\n21:41 Deprogramming and Embracing Spiritual Practices \n24:40 Overcoming Fear and Guilt\n29:19 Benefits Being a Witness\n35:10 How To Be Authentic in our Business\n42:00 Starting Over and Reconnecting With You\n45:00 What Would You Tell Your Younger Self?\n46:30 What Do You Wish People Knew About Starting Over?\n47:06 Consequences of Staying and Leaving",
      "release": "2024-08-18T16:06:46Z",
      "duration": "00:52:24",
      "explicit": false,
      "youTubeId": "mB2R3IPy73c",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=mB2R3IPy73c"
      }
    },
    {
      "id": "b22fcc3f-42ff-47da-a486-3f12ed4ca2da",
      "title": "Ex Jehovah\u0027s Witness: Turn Your Life from Misery to Success",
      "description": "In this insightful interview, Sarah Warren  (ex- Jehovah\u0027s Witness) shares her inspiring journey from overcoming family tragedies, escaping cult indoctrination, to finding  personal and financial independence. \n\nHer story highlights the challenges and triumphs of rebuilding life after leaving a mind-controlling religion, offering hope and inspiration to others navigating similar paths.\n\n00:00 Intro\n01:12 Childhood in Jehovah\u0027s Witness Household\n01:10 Personal Tragedies Wake-Up Call\n02:45 Starting the Journey Out\n04:15 Professional Challenges Within the Organization\n06:00 Overcoming Gender Disparities\n07:30 Coping with End of the World Teaching\n09:15 Finding Happiness After Leaving\n10:30 Coping with Personal Tragedies\n12:55 Finding Happiness and Overcoming Challenges\n13:55 Advice for Ex-Jehovah\u0027s Witnesses\n15:30 Importance of Self-Trust\n16:45 Setting Boundaries for Personal Growth\n18:10 Reflections on Personal Resilience\n24:15 Overcoming Money Mindset Challenges\n28:00 Advice for Ex-Jehovah\u0027s Witness Women\n31:30 Cultivating Optimism and Setting Boundaries\n34:45 Conclusion and Final Thoughts\n\nFollow me:\nFacebook- https://www.facebook.com/groups/1170193527467959\nLinkedIn-  https://www.linkedin.com/in/aubrey-cruz-261725208/",
      "release": "2024-07-14T14:43:01Z",
      "duration": "00:44:46",
      "explicit": false,
      "youTubeId": "LXR234Z-NNQ",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=LXR234Z-NNQ"
      }
    },
    {
      "id": "2e0896d6-3afd-46ca-9e11-a3a8ae6cdee0",
      "title": "Ex Jehovah\u0027s Witness Elder: How I Rebuilt My Life from Rock Bottom",
      "description": "In this video, ex-Jehovah\u0027s Witness elder Jack Siwek shares his journey of rebuilding his life and business after hitting financial rock bottom due to the organization\u0027s restrictive advice. Watch to discover the surprising financial secrets of the Jehovah\u0027s Witnesses and how Jack found success by breaking away.\n\n0:00 Intro\n1:37 Conflicts between JW Beliefs and Business \n9:07 Taking Personal Responsibilty \n26:31 Running a Business Like a Religion \n31:24 Lack of Freedom and Control within the Organization \n34:30 Prioritizing Meetings and Service over Personal and Professional Goals \n41:50 Effort vs Results in the Jehovah\u0027s Witness World \n46:21 Overcoming the Mindset of Failure and Embracing Results in Business \n55:13 Creating a Vision and Stepping into Identity after Leaving the Jehovah\u0027s Witnesses \n58:27 The Importance of Direction and Vision in Life\n\nFollow Jack Siwek:\nFacebook- https://www.facebook.com/JackGreyJacekSiwek\nYoutube- https://www.youtube.com/@feartofreedom2972\n\nFollow Me:\nFacebook- https://www.facebook.com/profile.php?id=100084792379729\nLinkedIn-  https://www.linkedin.com/in/aubrey-cruz-261725208/",
      "release": "2024-06-15T12:49:24Z",
      "duration": "01:03:12",
      "explicit": false,
      "youTubeId": "JlUThd638EI",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=JlUThd638EI"
      }
    },
    {
      "id": "1f59127d-a49a-4ade-ae3d-bf032f603c65",
      "title": "How 10 Words Saved Me From a Cult",
      "description": "Ever felt trapped by control without realizing it? In this powerful video, I share how 10 transformative words woke me up from a religious cult and changed my life forever. Discover the insidious tactics of \u0022love bombing\u0022 and indoctrination, and learn how to distinguish between conformity and true unity. I\u0027ll take you through my battle with cognitive dissonance and how understanding the subconscious mind and practicing critical thinking helped me reclaim my identity. Join me on my journey of healing and the empowering concept of neuroplasticity. Don\u0027t miss out on learning how to own your story, own your power, and live your truth!",
      "release": "2024-06-06T13:00:40Z",
      "duration": "00:13:18",
      "explicit": false,
      "youTubeId": "bfhBZ8zhano",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bfhBZ8zhano"
      }
    }
  ]
}