{
  "_ts": 0,
  "id": "3870d009-9111-4090-a84f-015b3cb51bc7",
  "name": "Oxygen Plus",
  "spotifyId": "3MRjYOYHfsckC6cRr36jhi",
  "appleId": 1577454000,
  "youTubeChannelId": "UCsWNkE2kOy_QEyo2pUUhFKg",
  "episodes": [
    {
      "id": "921dc38c-e970-4b62-91de-e29942ab43f0",
      "title": "EP2: “What’s the Meaning of Life?” with Rick Alan Ross, leading cult expert, author and consultant",
      "description": "On this episode, we explore life\u0027s alluring question, \u0022What’s the Meaning of Life?,” with Rick Alan Ross – a prominent figure and expert in the study of destructive cults and controversial movements like Jonestown, NXIVM and Heaven’s Gate. A cult intervention specialist, media consultant and court expert who testifies in high-profile cult-related legal cases, Rick shares how his life’s work – educating people about destructive cults – gives him, and others, important meaning. Author of the well-researched, resourceful book, “Cults Inside Out: How People Get In and Can Get Out,\u0022 Rick shares how he was introduced to a destructive cult at his grandmother’s nursing home, and offers stimulating facts, deep truths and personal experiences that illustrate how people who join cults aren’t the only ones seeking a greater purpose in this world. Learn more about what a cult is – and why meaning and logical thinking are critical in our modern world – in this special episode of “We’re Not Blowing Hot Air.”\n\nDo us a solid and smash a subscribe, share or 5-star rating button for the show. That way more people can elevate their mental wellness as they explore some of life’s biggest, most important questions with remarkable and fascinating guests.\n\nOxygen Plus powers “We’re Not Blowing Hot Air.” Nice Guy Creative Services is our producer, and brought the beats. Lesley Blennerhassett is designer. Lauren Carlstrom is creator and host. Arlene Appelbaum is editor.",
      "release": "2024-02-22T20:31:25Z",
      "duration": "01:15:34",
      "explicit": false,
      "spotifyId": "3DcoOQwGoJaQJe4tvrk2Lj",
      "appleId": 1000646431467,
      "youTubeId": "E_nQn8fXhZI",
      "subjects": [
        "Cult-Expert"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3DcoOQwGoJaQJe4tvrk2Lj",
        "apple": "https://podcasts.apple.com/podcast/ep-2-whats-the-meaning-of-life-with-rick-alan/id1577454000?i=1000646431467",
        "youtube": "https://www.youtube.com/watch?v=E_nQn8fXhZI"
      }
    }
  ]
}