{
  "id": "66ac7428-92c1-4220-b11c-e05bc2583de2",
  "name": "Page Six",
  "youTubeChannelId": "UCNWsXxEbKkKXOYzw-SwaXoA",
  "episodes": [
    {
      "id": "4715f398-0930-4564-9d10-e47d8845a086",
      "title": "‘One Tree Hill’ star Bethany Joy Lenz reveals ‘cult’ she spent a decade in",
      "description": "“One Tree Hill” star Bethany Joy Lenz has revealed the name of the cult that she used to be in, accusing them of “draining” her TV income and using “manipulation, abuse, and fear” to keep her loyal.\n\nLenz, 42, announced on her Instagram on Thursday that her memoir, called “Dinner for Vampires,” is “about the decade I spent in an abusive, high-demand group (aka, cult).” \n\nShe continued, “Being a writer has been a great, private joy in my life since I was about 12. This isn’t the first book I thought I’d write, publicly, but as difficult as this subject matter is to untangle, I’m grateful I get to share my story, my way. It’s a story of forgiveness and a roadmap to how manipulation works, with heartache and humor along the way. We all make mistakes and I hope Dinner for Vampires reminds you that, no matter what weird roads you’ve gone down, you’re not alone.”\n\nThe cover of her upcoming book proclaims that it’s about “life on a cult TV show while also in an actual cult!”\n\nRead more at https://nypost.com/2024/03/01/entertainment/one-tree-hills-bethany-joy-lenz-the-big-house-family-cult-revealed/\n\n#bethanyjoylenz #onetreehill \n\nPage Six is your source for celebrity news, gossip, entertainment, pop culture, photos, video and more.\n\nCatch the latest news and gossip here:\nhttps://pagesix.com/\nFollow us on:\nFacebook - https://www.facebook.com/pagesix/\nTwitter - https://twitter.com/PageSix \nInstagram - https://www.instagram.com/pagesix/\n\nCheck out We Hear, our Page Six podcast!\nhttps://podcasts.apple.com/us/podcast/we-hear/id1479076951\nhttps://open.spotify.com/show/4A4v65sX7nIHpEtrYnInDm\n \nAnd Page Six Style has the latest news on celebrity style including fashion trends, red carpet photos, and beauty tips.\n\nCatch the latest news here: https://pagesix.com/style/\nFollow us on:\nFacebook - https://www.facebook.com/pagesix/\nTwitter - https://twitter.com/PageSix",
      "release": "2024-03-01T18:36:44Z",
      "duration": "00:01:06",
      "explicit": false,
      "youTubeId": "ftkYkVR-Jh4",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ftkYkVR-Jh4"
      }
    }
  ]
}