{
  "_ts": 0,
  "id": "ab3f3d09-2791-4803-8f5f-c6f507ae0d3a",
  "name": "Pandox",
  "youTubeChannelId": "UCv6vieqJr1C5RDXHY1m3Y6Q",
  "episodes": [
    {
      "id": "2a918a04-3aae-4439-bdac-e7788d63e9e7",
      "title": "The Zizians: The Darkest Internet Cult You’ve Never Heard Of",
      "description": "They set out to save humanity from a rogue AI—and ended up leaving a trail of bodies. This true crime cult story exposes the bizarre and disturbing rise of the Zizian Cult, an internet-born movement that blended Silicon Valley idealism and AI conspiracy theories into a dangerous cocktail of mind control, radicalization, and murder.\n\n⬇️SUPPORT PANDOX⬇️ \n💜PATREON – https://www.patreon.com/pandox_yt\n🐦TWITTER – https://twitter.com/PandoxYT\n📌REDDIT – https://www.reddit.com/r/pandox/\n\nJack “Ziz” LaSota was active in rationalist and transhumanist circles before growing disillusioned with mainstream AI ethics. She formed a fringe internet movement that sought to prevent an AI-driven apocalypse—but her utopian vision turned into a cult-like crusade of extremism and violence.\n\nThe Zizians, named after LaSota’s online alias, started as an online intellectual movement but quickly transformed into a closed, radicalized community. Fueled by apocalyptic AI conspiracies, anarchist ideals, and extreme vegan morality, Ziz and her followers retreated from mainstream society and adopted an \u0022ends justify the means\u0022 philosophy—a shift that would soon turn deadly.\n\nA Cult Fueled by AI Panic, Vegan Extremism, and Paranoia\n\nWhat began as forum debates and encrypted manifestos soon led to real-world crimes. Authorities believe the Zizians are responsible for six violent deaths across three states, including:\n\n🔺 Richard \u0026 Rita Zajko, attacked in their Pennsylvania home\n🔺 Curtis Lind, attacked in a Vallejo, CA\n🔺 Agent David Maland, attacked at the US-Canadian border\n🔺 Multiple Zizian followers, victims of the group’s extreme ideology\n\nUsing mind-control tactics that mirror the BITE model of cult manipulation, Ziz transformed online followers into real-world extremists, orchestrating crimes that baffled law enforcement.\n\nSOURCES: https://gist.github.com/PandoxVideos/5892354425aca9d3450f916a052bfdc5\nMUSIC: https://youtube.com/playlist?list=PLcHF7bMu6Dzwbv1xrQPS2a6bDhaJeGEmZ\u0026si=l76kGaPi0SJFr-se\n\n0:00 The End is the Beginning\n3:49 Jack Ziz LaSota\n7:47 Followers to Fanatics\n15:07 The Zizian Cult\n23:09 Acolytes Alone",
      "release": "2025-03-20T13:59:57Z",
      "duration": "00:41:51",
      "explicit": false,
      "youTubeId": "OOiSEi4j2Qg",
      "subjects": [
        "Zizians"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=OOiSEi4j2Qg"
      }
    },
    {
      "id": "76069396-51fa-4cc4-ae36-0a05e77c90d1",
      "title": "The Satanic Cult of Fall River",
      "description": "Feeling stuck? BetterHelp makes therapy simple, with 10% off your first month to help you get started: https://www.betterhelp.com/pandox (Sponsored by BetterHelp)\n\nIn the late 1970s and early 1980s, Fall River, Massachusetts, became the center of a series of violent murders linked to alleged Satanic rituals. The killings, which involved young women from the town’s criminal underworld, raised questions about the intersection of organized crime, ritualistic violence, and moral panic during an era consumed by fears of Satanism. The case unfolded at the height of the Satanic Panic era, fueling fears that an active cult was operating in Massachusetts.\n \n⬇️SUPPORT PANDOX⬇️   \n💜PATREON – https://www.patreon.com/pandox_yt\n🐦TWITTER – https://twitter.com/PandoxYT\n📌REDDIT – https://www.reddit.com/r/pandox/\n\nThe first victim, 17-year-old Doreen Levesque, was found under the bleachers of Diman Vocational High School. Her wrists and ankles were tied, and she had suffered extensive head trauma and multiple stab wounds. The positioning of her body and the evidence at the scene led investigators to suspect ritualistic elements, sparking fears that the crime was more than just an isolated killing. This theory gained momentum when, months later, another victim, Barbara Raposa, was discovered in a remote area of Fall River. Like Levesque, she had been brutally beaten, tied up, and left to die. Her murder suggested a pattern, and investigators soon connected both cases to a growing web of violence that extended into the criminal underworld.\n\nBy the time Karen Marsden was reported missing, authorities had begun to suspect that these crimes were linked to individuals deeply entrenched in Fall River’s vice trade. Marsden, who had known both victims, expressed fear for her life in the weeks before her disappearance. She claimed to know who was responsible for the murders and repeatedly stated that she believed she would be next. When her remains were found—her skull crushed, her body unrecognizable—it confirmed investigators’ worst fears. Unlike the previous victims, Marsden was not just another casualty; she had reportedly been speaking to police before her disappearance, making her murder a potential act of silencing a witness.\n\nAt the center of the case was Carl Drew, a violent figure with a long history of criminal activity. Drew was quickly identified as a suspect, with witnesses claiming that he was the leader of a cult that performed Satanic rituals deep in the Massachusetts woods. Witnesses, including Robin Murphy, alleged that Drew presided over rituals that involved blood sacrifices, physical abuse, and forced participation. Murphy later turned state’s witness, providing detailed accounts of what she claimed were ritual murders conducted by Drew and his followers. However, her shifting testimony raised questions about whether she was telling the truth or leveraging law enforcement’s fears to secure a better outcome for herself.\n\nThe investigation relied heavily on witness statements, many of which changed over time. Murphy’s role in the case became increasingly complex as she positioned herself as both a participant and an informant. Despite inconsistencies in testimony and a lack of forensic evidence proving the murders were connected to occult practices, Drew was convicted of first-degree murder and sentenced to life in prison without parole. Murphy, despite admitting to her involvement, struck a deal and received a significantly reduced sentence.\n\nOver the years, questions have persisted about the legitimacy of the case against Drew and whether the narrative of a Satanic cult was an exaggeration shaped by the moral panic of the era. While some argue that Drew was a dangerous figure fully capable of orchestrating these crimes, others point to the lack of concrete evidence tying him directly to the murders. No physical evidence has ever confirmed the existence of the cult rituals described in court, and some experts believe that the prosecution’s case was built more on fear and coerced testimony than on factual findings.\n\nThe Fall River murders stand as a grim reminder of how crime, hysteria, and public perception can shape the course of an investigation. The case remains one of the most debated in true crime history, with ongoing disputes about whether justice was truly served or whether the real story has yet to be uncovered. The lasting impact of these murders, the individuals involved, and the shadow of the Satanic Panic continue to make this case one of the most infamous in American criminal history.\n\nMUSIC: https://youtube.com/playlist?list=PLlCuwD7rcfV7DkclPtFyuj21h0iwlTS5l\u0026si=vjsHnhPKTmPArou5\nSOURCES: https://docs.google.com/document/d/e/2PACX-1vQim2bmFlbKOGRPzVYxhsNMHZTUxsHoRhEIUncZMGbhGvCrlVBZ6WqPCfBrxOauqIA0QnRWKCNVVXn2/pub\n \n0:00 - The Darkness of Fall River\n4:54 - Sacrifices to a Shadow\n24:45 - Judgment of the Devil\n\n#crime",
      "release": "2025-02-13T15:30:23Z",
      "duration": "00:36:42",
      "explicit": false,
      "youTubeId": "eMpDXaBrZm8",
      "subjects": [
        "The Fall River Cult"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=eMpDXaBrZm8"
      }
    }
  ]
}