{
  "_ts": 0,
  "id": "b4b7df94-9602-4906-901e-e4037d494b5e",
  "name": "Passion Frissons",
  "spotifyId": "3UbIza5vEFSTL009mz0QMh",
  "appleId": 1740012378,
  "episodes": [
    {
      "id": "01fe0984-ee11-4881-8e40-0be3dc5bc01f",
      "title": "Passion Frissons - Épisode 1 : Les groupes sectaires et les cultes",
      "description": "Épisode 1 : Les groupes sectaires et les cultes C\u0027est un sujet qui fait réagir et frissonner, qui me rend fondamentalement curieuse et intéressée à en savoir plus, surtout parce que j\u0027ai de la difficulté à saisir pourquoi s\u0027y embarquer... Les dynamiques humaines malsaines et les règles parfois farfelues sont au centre des groupes dont je vais vous parler dans cet épisode. Incrédule face à ce qui peut pousser une personne à adhérer à un culte, j\u0027ai engouffré plusieurs documentaires sur le sujet. Laissez-moi vous présenter 3 de mes découvertes : Escaping Twin Flames (2023) Cecilia Peck - disponible sur Netflix Don\u0027t Call It A Cult (2021) Sarah Berman - disponible en librairie ! Raël : Le prophète des extra-terrestres - disponible sur Netflix Sur le même sujet, ne manquez pas : Le balado Dérives - d\u0027Olivier Bernard, disponible sur Ohdio (3 saisons) - explore les croyances et les dérives associées L\u0027épisode sur Keith Raniere et NXVIM de Distorsion Podcast, disponible partout - raconte en détail l\u0027ascension de la secte et la tombée de Raniere L\u0027Épisode sur les sectes des Distorsion Podcast (#96), disponible partout - présente Unicult et Teal Swann Le podcast Recherche et animation : @xarapod (Sarah MP) Production, montage et habillage sonore : Lodio Studio Thème musical et musique d\u0027ambiance : L\u0027aéroport Fantôme par Undixgo Un grand merci pour votre soutien ! Hébergé par Ausha. Visitez ausha.co/politique-de-confidentialite pour plus d\u0027informations.",
      "release": "2024-05-16T18:09:03Z",
      "duration": "00:20:51.9960000",
      "explicit": true,
      "spotifyId": "4NaGc4iEMAsOVrxdlCMkiM",
      "appleId": 1000655831197,
      "subjects": [
        "NXIVM",
        "Twin Flames Universe",
        "Raëlism",
        "Teal Swan",
        "Unicult"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4NaGc4iEMAsOVrxdlCMkiM",
        "apple": "https://podcasts.apple.com/podcast/passion-frissons-%C3%A9pisode-1-les-groupes-sectaires-et/id1740012378?i=1000655831197"
      }
    }
  ]
}