{
  "id": "a9c71310-e587-4dac-94bc-3f1e85d819ae",
  "name": "Paula Pluck",
  "youTubeChannelId": "UCSW1z62ekSGbrcfgv0GFe_A",
  "episodes": [
    {
      "id": "90fbc23d-2d16-4bf0-9a81-03285c1d3eff",
      "title": "What Makes Leaving A Cult So Painful The Hidden Traps of Spirituality, Gaslighting \u0026 Narcissistic Co",
      "description": "In today’s episode, Paula sits down with Sandy Newbigging, Therapeutic Coach, bestselling author, and former monk, who had to extricate himself from a cult, after 14 years. With raw honesty and deep self-inquiry, Sandy shares his profound journey of healing and awakening, shedding light on the hidden dangers of cult mentality, gaslighting, and narcissistic control.\n\nTogether, they explore the fine line between spiritual enlightenment and manipulation, the deep wounds left by trauma, and why true healing requires us to meet our pain with presence rather than bypass it. This grounded and compassionate conversation invites us to tend to our mental and emotional injuries with the same care as physical ones—offering a powerful perspective on transformation, resilience, and the freedom that comes from facing our deepest wounds.  \n\nKEY TAKEAWAYS\n\nEmphasising the need to reconnect with the physical body and the earth, the discussion highlights how modern life can lead to neglecting our physical existence in favour of spiritual pursuits. Engaging with nature and physical labour can foster a deeper connection to oneself.\n\nThe conversation sheds light on the characteristics of cults, including love bombing, gaslighting, and the us-versus-them mentality. It stresses that these dynamics can exist in various organisations, not just traditional cults, and can manifest in personal relationships as well.\n\nThe journey of healing trauma is crucial for personal growth and understanding. The discussion points out that unresolved trauma can lead to a distorted perception of self-worth and can keep individuals trapped in unhealthy dynamics, whether in cults or personal relationships.\n\nThe need for authenticity often conflicts with the desire for attachment and acceptance. This conflict can lead individuals to suppress their true selves to maintain relationships, which can result in feelings of shame and unworthiness.\n\nThe importance of combining therapeutic practices with spiritual growth is emphasised. True healing involves addressing inner injuries and traumas, allowing individuals to experience genuine peace and connection, rather than relying solely on spiritual practices that may bypass deeper issues.\n\nBEST MOMENTS\n\n\u0022I decided to explore whether I had any trauma a few years ago. As I healed my trauma, certain things in the so-called \u0027spiritual community\u0027 stopped being okay for me.\u0022\n\n\u0022No one joins a cult, they join something good.\u0022\n\n\u0022The irony of it is that you can go around full circle back to, Oh, actually what I always was is actually really enough.\u0022\n\n\u0022If our authenticity ever threatens our attachment, our likelihood of being accepted, then our attachment will always trump authenticity.\u0022\n\n\u0022It starts with honesty. It\u0027s so fundamental because we\u0027re dealing with reality then.\u0022",
      "release": "2026-02-10T07:07:18Z",
      "duration": "01:01:38",
      "explicit": false,
      "youTubeId": "rHVZ-ai8W_8",
      "subjects": [
        "Cult Psychology",
        "_America"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=rHVZ-ai8W_8"
      }
    }
  ]
}