{
  "_ts": 0,
  "id": "fd058b45-77e1-4d9a-af7c-2e52eefac066",
  "name": "Peacock",
  "youTubeChannelId": "UCPgMAS8woHJ_o_OZdTR7kcQ",
  "episodes": [
    {
      "id": "bdb472af-b09f-48bf-b04f-66e732b7b905",
      "title": "Making Manson | Official Trailer | Peacock Original",
      "description": "Making Manson is streaming November 19 on Peacock: https://pck.tv/45hBP6q  \n\nSynopsis: An explosive series offering unfiltered insights into America\u0027s most notorious killer, Charles Manson. Through 20 years\u0027 worth of never-before-aired conversations, those closest to the case have their views challenged as Manson talks openly about his part in the infamous crimes, as well as his upbringing, criminal youth and his true feelings about \u0022The Family.\u0022 Manson reveals the cruelty he suffered in reform school and the childhood experiences that made him who he was. Former \u0022Family\u0022 members listen to the exclusive conversations and are taken back to the time when they \u0022would do anything for Charlie.\u0022 Manson recounts the early crimes that led to the murder spree in the summer of ‘69, laying out an explanation of loyalty and brotherhood that pushes against the accepted motive: his desire to incite Helter Skelter. In the final moments before his death, Manson reflects on his life in prison and shows rare tenderness for the man who spoke to him across the decades.\n\n#Peacock #MakingManson #OfficialTrailer \n\nPeacock is your go-to for hit movies, TV, live sports, and more. With the streaming service from NBCUniversal, you can watch new movies from theaters, current hits from NBC and Bravo, nonstop action from WWE, Premier League, Big Ten, and tons of other sports. Plus, stream exclusive Originals, NBC News, and your faves like The Office, Suits, Modern Family, and Yellowstone. Peacock is currently available to stream within the United States.\n\nGet More Peacock:\n► Follow Peacock on TikTok: https://www.tiktok.com/@peacock \n► Follow Peacock on Instagram: https://www.instagram.com/peacock \n► Like Peacock on Facebook: https://www.facebook.com/PeacockTV \n► Follow Peacock on X: https://twitter.com/peacock",
      "release": "2024-10-23T18:00:00Z",
      "duration": "00:01:51",
      "explicit": false,
      "youTubeId": "0gAigWxyemc",
      "subjects": [
        "Manson Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=0gAigWxyemc"
      }
    }
  ]
}