{
  "id": "6b2f315f-d520-4649-ba93-08757883acac",
  "name": "Penny Woolcock",
  "youTubeChannelId": "UCfLakFvRGkO0dzeSlVAp26w",
  "episodes": [
    {
      "id": "0ce90475-a1a6-4cb9-8d33-3d16c78650aa",
      "title": "Kindoki Witch Boy",
      "description": "On the 25th anniversary of Victoria Climbié’s tragic death, Kindoki Witch Boy sheds light on faith-based abuse in the UK. This 50-minute film, directed by award-winning filmmaker Penny Woolcock, tells the real-life story of Mardoche Yembi, who was accused of witchcraft by his family at just 12 years old.\n\nBorn in the Democratic Republic of Congo, Mardoche was sent to North London after his mother’s death, only to face horrific accusations of witchcraft fueled by religious beliefs. Rescued by a foster mother, he rebuilt his life and now speaks out to protect other children. \n\n“When I was a boy I was accused of being a witch and it was a very painful experience. I want this film to transform something that was bad into something good, to help other children going through the same thing. I hope children who are being accused will see that there is help out there and they can survive it,” said Mardoche.\n\nCo-written by Mardoche Yembi and Woolcock, the film features a mix of actors and local community members. It is followed by a discussion with Mardoche and others working to end faith-based abuse.\n\n📽 Watch the full film now and share the link to help spread awareness.\n\n🎧 Listen to Mardoche’s story on Barnardo’s podcast: https://www.barnardos.org.uk/podcast/witchcraft-mardoche-yembi\n\n \nFor media inquiries, contact:\n\n📩 Sophie Toumazis – sophie@tpr-media.com\n\n📩 Charlotte Maher – charlotte@tpr-media.com\n\n\n\nIf you, or anyone you know, is affected by accusations of witchcraft, please seek help and support.\n\nUnder 19’s call Childline (24hrs) 0800 1111 or email childline.org.uk\nAdults call NSPCC (24hrs) 0808 800500 or email help@NSPCC.org.uk\n\nDedicated to Victoria Climbié and all the other children who did not survive.",
      "release": "2025-02-21T17:31:07Z",
      "duration": "00:50:31",
      "explicit": false,
      "youTubeId": "jLLf8WYWB34",
      "subjects": [
        "_London",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=jLLf8WYWB34"
      }
    }
  ]
}