{
  "id": "f5e1e555-901e-4fd9-a487-dc158c333fe1",
  "name": "People of Poland",
  "youTubeChannelId": "UCeO10_Ft8xeLw8Brsi_b9Hw",
  "episodes": [
    {
      "id": "9901b044-10a1-4e6f-b65c-15e264ae0a02",
      "title": "How I Got Pulled Into a Cult: The Family International (Part 1)",
      "description": "🎥 In this video, I share my personal story of how I got involved in **The Family International** aka the children of god, a group widely regarded as a cult. What started as a search for purpose and belonging slowly turned into something much darker, spiritual control, emotional manipulation, and isolation from the outside world.\n\nThis is **Part 1** of a multi-part series where I break down:\n• How I was introduced to The Family  \n• The red flags I missed  \n• What life inside the group was like  \n• How they used religion as a tool for control\n\n⛔ This is NOT sensationalized. It\u0027s a real story. I lived it.\n\n🧠 If you’ve ever wondered:\n• \u0022What is The Family International?\u0022  \n• \u0022How do people get trapped in cults?\u0022  \n• \u0022Could this happen to me or someone I love?\u0022  \nYou\u0027re in the right place.\n\n📢 **Let’s talk in the comments**  \nHave you ever encountered a high-control group? Or noticed cult-like behavior in places you didn’t expect? I’d love to hear your story.\n\n💬 Drop a comment. Let’s make this a safe space for survivors, skeptics, and the curious.\n\n*****************************************************************************\nLinks:\nhttps://www.youtube.com/@UCUaliZ97qmVen7E6uFM9fFg \nhttp://www.exfamily.org/index.htm\nhttps://www.xfamily.org/index.php/Main_Page\nhttps://www.youtube.com/watch?v=kqil-rab84U\nhttps://www.youtube.com/watch?v=BE0cAIVE3Q8\nhttps://www.youtube.com/watch?v=URAQ9zznUNI\n*****************************************************************************\n\n⚠️ **DISCLAIMER:**  \nAll views expressed in this video are based on my **personal experiences and opinions**.  \nAny references to abuse, exploitation, or misconduct are **alleged**, based on public reporting, survivor accounts, and documentation widely available online.  \nNothing in this video should be taken as a statement of proven fact regarding individuals or the organization.\n\n\n🗣 I want to hear from you!\nAgree or disagree? Let me know in the comments! I value open discussion and different perspectives.\n\n🌍 What to Expect from People of Poland\n👥 This is a space for everyone—expats, native-born Poles, and Polish people living abroad.\n🚀 I see Poland rising as a global leader, and I’m excited to explore its culture, economy, and people.\n📍 I’ll also be doing street interviews in Krakow—stay tuned for updates!\n\n❌ No Topic is Off-Limits ❌\n✅ Politics \u0026 economics\n✅ Religion \u0026 culture\n✅ Conspiracy theories 🛸\n✅ Ghost stories 👻\n✅ Life in Poland 🇵🇱\n✅ And so much more!\n\nThis isn’t about creating an echo chamber—I’m here for honest conversations, different viewpoints, and real dialogue. 🎤\n\n💡 Want to be a guest?\nIf you have a unique perspective or story to share, I’d love to talk to you! Reach out! 📩\n\n🎬 A Work in Progress 🎬\n📸 Still learning editing, lighting, and camera work\n🎥 Remembering to actually hit record! 😅\n🚀 It’s only going to get better from here!\n\n🔔 Stay Connected \u0026 Support the Channel!\n📢 Like, share, and subscribe for more podcasts \u0026 street interviews!\n📍 Follow People of Poland:\n\n📌 𝕏 (Twitter): @PeopleofPoland 🐦\n📸 Instagram: @peopleofpoland89 📷\n📧 Email: peopleofpoland92@gmail.com ✉️\n\nThanks for being part of this journey! Can’t wait to bring you more episodes soon. 🚀\n\n\n=======================================================\nMusic : Roa - City Lights\nStream / Download : hypeddit.com/roamusic/citylights\nLicense : roa-music.com\n=======================================================\n\n\n🎥 Fair Use Disclaimer:\nThis video may contain copyrighted material, the use of which has not always been specifically authorized by the copyright owner. I am making such material available for the purpose of criticism, commentary, education, and review. I believe this constitutes a “fair use” of any such copyrighted material as provided for in Section 107 of the U.S. Copyright Act.\n\nIf you are the owner of any content used and have concerns, please contact me directly. I’m happy to cooperate and resolve any issues.",
      "release": "2025-10-25T08:44:26Z",
      "duration": "00:32:40",
      "explicit": false,
      "youTubeId": "E8w7gvwtVeA",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=E8w7gvwtVeA"
      }
    }
  ]
}