{
  "_ts": 0,
  "id": "3c2dc822-50f3-43c5-85eb-9c6ab5408b2a",
  "name": "People",
  "youTubeChannelId": "UCGbQJy-531_5vfphay-rChQ",
  "episodes": [
    {
      "id": "715afb84-a730-44ee-8adb-8686f599454a",
      "title": "Bethany Joy Lenz on Leaving a Cult After 10 Years and Starting Over | PEOPLE",
      "description": "One Tree Hill Star Bethany Joy Lenz talks with PEOPLE about how she got sucked into a cult for a decade — and how she finally got out of it. Bethany starred as Haley James in The WB / The CW show that aired for nine seasons. Bethany shares how her religious upbringing and her desire for connection lead to her joining a cult during her time at One Tree Hill:  \u0022I have always been looking for a place to belong, I kinda wish someone had told me when I was young this is the universal human condition.\u0022\n\nBethany discusses how her recovery after leaving the cult and her marriage lead to writing a memoir, Dinner for Vampires. \u0022I\u0027m not interested in a witch hunt, I didn\u0027t write this book to get revenge on anyone, I just wanted to tell an honest truth about what happened.\u0022\n\nSubscribe to People ►► http://bit.ly/SubscribetoPeople \n\n*CONNECT*\nWeb: https://people.com \nFacebook: http://facebook.com/peoplemag \nTwitter: https://twitter.com/people \nInstagram: https://www.instagram.com/people/ \nTikTok: https://www.tiktok.com/@people\n\n*PEOPLE* remains the trusted authority at the center of pop culture. The PEOPLE brand features a unique mix of breaking entertainment news, exclusive photos, video, unparalleled access to the red carpet, celebrities, and in-depth reporting on the most compelling newsmakers of our time. \n\nBethany Joy Lenz on Leaving a Cult After 10 Years and Starting Over | PEOPLE\n\nhttps://www.youtube.com/user/people",
      "release": "2024-10-15T12:02:27Z",
      "duration": "00:10:37",
      "explicit": false,
      "youTubeId": "ROZgNgVraTQ",
      "subjects": [
        "The Big House Family"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ROZgNgVraTQ"
      }
    },
    {
      "id": "83dda2df-7dc7-4514-8b4c-756182ffae22",
      "title": "How Glenn Close’s Family Recovered From Years In A Cult-Like Religious Group | PeopleTV",
      "description": "\u0022Each of us had to go through that process of forgiveness,\u0022 Glenn Close says.\nSubscribe to PeopleTV ►► http://bit.ly/SubscribePeopleTV\n\nPeople and Entertainment Weekly, two of the world\u0027s leading entertainment brands bring you PeopleTV. Watch everyday for free and get exclusive insider access to celebrities, pop culture, entertainment, lifestyle and human interest shows.\n\nWatch the newest celebrity interviews - From Jennifer Lopez to Jennifer Lawrence, Pop Stars to Movie Stars, Bachelors to Real Housewives, we’ve got it all:\nhttps://www.youtube.com/embed/?list=PLzS8B57pacxwyamvauL4pdzZkN_3j_daW\u0026autoplay=1\n\nStay on top of all the latest celebrity gossip - Scandals, news, rumors and more:\nhttps://www.youtube.com/embed/?list=PLzS8B57pacxyPxBFbzjY5NqiJmUBvHgTE\u0026autoplay=1\n\nCelebrity love, romance and relationships - Never miss out on who’s dating who, recent break ups and new hook ups:\nhttps://www.youtube.com/embed/?list=PLzS8B57pacxzBdPhE7vu69ONKbJemr4_l\u0026autoplay=1\n\nCelebrity style, fashion icons, outfit fails and the best dressed - Check out everything from Gigi Hadid’s legendary outfits to Eva Longoria’s timeless style:\nhttps://www.youtube.com/embed/?list=PLzS8B57pacxzWKYCRsB6uH7Y7MDdUFdck\u0026autoplay=1\n\nGet all access to A-list events, award shows and parties - Who wore what, which awards were won, and was there any drama:\nhttps://www.youtube.com/embed/?list=PLzS8B57pacxwXU_Gfe2aaqvb2E4CUI5Fg\u0026autoplay=1\n\nNo matter if you’re into Taylor Swift or Justin Bieber, we’ve got some of the best live performances right here:\nhttps://www.youtube.com/embed/?list=PLzS8B57pacxyPM1cEn5JXgA7xTFjlU7LJ\u0026autoplay=1\n\nKeep up with the Kardashians - get the latest on Kim \u0026 Kanye, and the rest of the hottest celebrity family around:\nhttps://www.youtube.com/embed/?list=PLzS8B57pacxz-JkjNRg3wCQ71l8xXITMY\u0026autoplay=1\n\nCONNECT WITH\nWeb: https://peopletv.com/ \nTwitter: https://twitter.com/peopletv\nFacebook: https://www.facebook.com/PeopleTVNetwork/\nInstagram: https://www.instagram.com/peopletv/\nGoogle\u002B: http://po.st/GooglePeople\n\nABOUT PEOPLE\nPEOPLE is the #1 online news source all things pop culture. Get your fix of the hottest celebrity news, celebrity gossip, celebrity interviews, exclusive stories, red carpet events, style and updates from the world of entertainment, involving your favorite stars. \n\nHow Glenn Close’s Family Recovered From Years In A Cult-Like Religious Group | PeopleTV\nhttps://www.youtube.com/user/people",
      "release": "2018-08-10T12:59:56Z",
      "duration": "00:03:44",
      "explicit": false,
      "youTubeId": "ajwhn8RHtF4",
      "subjects": [
        "Moral Re-Armament",
        "Cult Recovery"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=ajwhn8RHtF4"
      }
    }
  ]
}