{
  "id": "cfa8f065-8ce3-4b4b-bdb5-a4ac2baeb408",
  "name": "Permission to Play Podcast",
  "spotifyId": "7x1Y3ymiMwVmJa8ac7AdNR",
  "appleId": 1668718018,
  "episodes": [
    {
      "id": "024b1707-0bdc-47de-88ec-a1a960036d76",
      "title": "My Transformative Journey Into and Out of the Charismatic Christian Church",
      "description": "I have a question for you. Here’s the situation: You’re an ambitious, twenty-three year-old performing arts school grad. Trained by the best and bursting with dreams, you’re poised for greatness. Gonna take Hollywood and take her all the way. What would you do next? It’s obvious, right? You’d join a cult. Wouldn’t you? This episode features an interview with me by Allison Santana, host of Memoir Lane podcast. We discuss my memoir, Born Again, Again: That time I fell down a rabbit hole and spent twenty-two years as a Bible thumping, tongue speaking, Gospel preaching Born Again Christian. And then I woke up. We explore my decades-long deep dive into the Charismatic Christian church, the impact it had on me and my family, and how we eventually made our way out. The conversation explores the subtle manipulations that some religious institutions employ, the importance of questioning and challenging control masked as righteousness, and the powerful role that love and genuine connection should play in our relationships and community. My chat with Allison further underscores the relevance of self-actualization, being in tune with oneself, and listening to the innate wisdom within. Born Again, Again was a finalist for both the 2021 Next Generation Indie Book Awards and the 15th Annual National Indie Excellence Awards. *** Listen to Allison\u0027s podcast, Memoir Lane, on Apple , Spotify , or any of your favorite podcast platforms. My book, Born Again, Again: That time I fell down a rabbit hole and spent twenty-two years as a Bible thumping, tongue speaking, Gospel preaching Born Again Christian. And then I woke up. is available on Amazon: https://tinyurl.com/BornAgainMemoir *** I\u0027m so glad you decided to hang out with me. Thank you so much! Loved what you heard? Awww, that\u0027s so great. What\u0027s that? You WANNA HELP MY SHOW GROW ?\u0026#x1f603; Saweeeeeet! It\u0027s so easy. Leave a review! Here\u0027s a simple way to do that: just click THIS LINK (or copy/paste this url: https://ratethispodcast.com/permissiontoplay ), follow the quick-n-easy steps, and BAAM! You\u0027ve helped all the people find Chatty Kathy Martens and Permission to Play. See how easy that was? Thank you so much, it really does help! Here are some great ways to find more of me, your host, Chatty Kathy Martens (someday we\u0027ll talk about this ridiculous name on Episode...???): Here\u0027s a one-stop-shop to ALL MY CONTACT LINKS : https://linktr.ee/kathymartens You can stay up-to-date on newly released episodes and other fun happenings \u0026#43; get cool stuff I only release to my subscribers (like some of my writing!) by jumping on my EMAIL LIST : https://ck.kathymartens.com And check out my books and other writing on my WEBSITE: kathymartens.com",
      "release": "2024-03-03T01:00:00Z",
      "duration": "01:02:01.6390000",
      "explicit": false,
      "spotifyId": "4I1Mqy7DqTPsvdc91zVMgf",
      "appleId": 1000647795168,
      "subjects": [
        "Christian Fundamentalist"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4I1Mqy7DqTPsvdc91zVMgf",
        "apple": "https://podcasts.apple.com/podcast/my-transformative-journey-into-and-out-of/id1668718018?i=1000647795168"
      }
    }
  ]
}