{
  "_ts": 0,
  "id": "0d841f5a-f487-4c91-a1c7-4d21ea7c886f",
  "name": "Peta Thompson Yoga \u0026 Wellness",
  "youTubeChannelId": "UCCIrAVG60z-M6eCZNOphG5g",
  "episodes": [
    {
      "id": "7d335f74-e755-460e-b334-893ed45cfa7d",
      "title": "Episode 16. Cult Escape Artist with Calvin Wayman",
      "description": "Episode 16. Cult Escape Artist with Calvin Wayman\n\nIn today\u0027s episode, we meet Calvin Wayman - an entrepreneur, author, keynote speaker, digital creator, and… a former cult member. Calvin was born and raised in a Mormon Fundamentalist cult, where he had 5 moms and was the 11th of 44 siblings. Growing up on a secluded farm, Calvin never met any other kids or knew anything about the outside world, which he was taught to believe was pure evil.\n\nCalvin shares his incredible story of life inside this \u0027cave\u0027 and the moment he knew it was time to leave. He speaks about the painful loss of identity and everyone he\u0027d ever known as he stepped away from this life to go to college. Calvin\u0027s journey is a powerful testament to the courage it takes to step outside your comfort zone and begin the process of discovering who you really are from the inside out.\n\nTune in as Calvin Wayman reveals what it takes to rebuild your life, redefine your identity, and embrace the unknown.\n\nLearn more about Calvin below.\n\nhttps://www.calvinwayman.com\nInstagram:@calvinwayman\n\nMusic: www.nellabanner.com // instagram.com/nellabanner\nPodcast artwork: www.designbyaether.com // instagram.com/design_by_aether\n\nHow can you support the show?\n\nHaving a podcast is such a beautiful experience, however it is time-consuming and has its own expenses. To help support the show and keep it going by you can consider donating by using this link.\nhttps://www.paypal.com/donate/?hosted_button_id=K6BC9ET64DQSN\n\nFollow: @petathompsonwellness on Instagram\nFollow @howdyoudoitpodcast on Instagram\nLeave a review on Apple Podcasts\nSubscribe to @PetaThompsonWellness on YouTube\n\nTo work with Peta Thompson, head over to www.petathompson.com \n\nLearn about my \u0022Liberate your Life: Break Patterns \u0026 Find Freedom!\u0022 online course here: https://www.petathompson.com/courses\n\nAnd my Online Yoga \u0026 Meditation Platform \u0022Breathe, Move, Embody\u0022 here: https://www.petathompson.com/yoga-videos\n\n#storiesoftransformation #podcast #resilience #somatichealing  #addictionrecovery #compassionateliving #selfacceptance",
      "release": "2024-08-15T08:11:00Z",
      "duration": "01:13:27",
      "explicit": true,
      "youTubeId": "d42wdW7YqzM",
      "subjects": [
        "FLDS Church"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=d42wdW7YqzM"
      }
    }
  ]
}