{
  "id": "61307c9c-026e-4ba9-ab0c-37d5ea3687e2",
  "name": "Philip Seibel",
  "youTubeChannelId": "UC5lCgGxk5tARKBKUXtREAzA",
  "episodes": [
    {
      "id": "048f23b2-7ef0-4859-b5f3-be1f1b18c66f",
      "title": "Children of God cult survivor | CSA survivor | Religious trauma recovery | Ex-cult awareness",
      "description": "Children of God cult survivor | CSA survivor | Religious trauma recovery | Ex-cult awareness\n\nThis video confronts the stigma faced by survivors who dare to speak openly about the atrocities committed within The Children of God — the cult led by David Berg, also known as Moses David. Behind its façade of spiritual freedom and love, the group enabled and encouraged the exploitation and sexual abuse of children, producing materials and doctrines that normalized these crimes.\n\nI was one of those children. Like many survivors, I endured years of severe physical, emotional, and sexual abuse — including at the hands of my own parents. The trauma left deep scars that don’t fade with time.\n\nSpeaking out has come at a price: I’ve been shunned by childhood friends, lost jobs, and even been blocked by family members. Society often tells us to be quiet, to move on, to keep it secret — as if shame belongs to the victims rather than the perpetrators. That silence remains the abusers’ most powerful weapon.\n\nTo this day, my parents have never faced justice for what they did. Many survivors of the cult continue to battle depression, poverty, addiction, and lifelong struggles with mental health — while being gaslighted and dismissed as liars or attention-seekers.\n\nThis is not a sob story — it’s a statement of truth. The truth that countless children were robbed of their innocence under the guise of religion, and that justice has yet to come. Speaking out is how we reclaim our voices.\nThis is for every survivor who was told to forget.\nWe remember.\n\nI am a full time speaker, creator, musician and activist. I do not have a normal job, or receive government aid of any kind \nIf you like my channel and its tremendously diverse content, consider buying me a coffee or purchasing one of my songs/books here \n\nbuymeacoffee.com/seibelphil8\nhttps://www.philipseibel.com/\n\nAll content is performed, produced, written and recorded by Philip Seibel without AI #fuckaimusic #fuckaiart \n\nHashtags\n\n#CultstoConsciousness\n#ChildrenOfGod\n#CSASurvivors\n#ExCult\n#SurvivorVoices\n#SpeakOut\n#EndTheSilence\n#JusticeForSurvivors\n#ReligiousTrauma\n#WeRemember",
      "release": "2025-10-27T17:11:24Z",
      "duration": "01:13:06",
      "explicit": false,
      "youTubeId": "irLh0_XpptU",
      "subjects": [
        "Children Of God",
        "Cult Recovery",
        "Cult Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=irLh0_XpptU"
      }
    },
    {
      "id": "a3105341-a05b-4b7c-b994-ea51d1941670",
      "title": "My Horrific Childhood in the CHILDREN OF GOD Sx Cult   (original video Cults to Consciousness)",
      "description": "My childhood was living hell\nMaybe thats why when I ran away I was drawn to horror novels by Steven King, the depravity, fear and gruesomeness of his writings were fictional, and, yet, I felt like I had experienced similar in real life\n\nThere was not a day in my childhood, that I didn\u0027t wish I was dead\n\nNow I\u0027m back for vindication. Help me meet out justice to those who committed these crimes against humanity before its too late\n\nMy abusers still walk free and do and abuse as they please. You can HELP\n\nShare my story, read my book, and be the change that this world needs\n\nhttps://www.philipseibel.com/books\n\nMy books are available in print and as ebooks in GERMAN AND ENGLISH at the above link (amazon) if the book says \u0022not for sale\u0022  you need to search your local amazon store\n\nComments from original interview\n\nAs a sexual abuse survivor, I feel for him.\n\n3 months ago\nHow is he nowadays? Non of the links are working... :(\nMY links can be found here philipseibel dot com... Youtube flags comments with links sadly so its hard to connect with others\n\n\nI hope you guys read this...i realize this is a year old.  Philip is such an inspiration - so resliliant!!!\nGood for you and being able to build a life.\n\nSå trist😢\n\nWhat does ffing mean?\n\n@Philip-Seibel\nflirty fishing was a term coined by the cult leader to force women of the cult into prostitution you can read more here philipseibel dot com... I cant write the links otherwise Youtube will flag and delete the comments\n\nThank you for telling all of us that are not religios or in some kind of cult the real true.\nWe have been all to naive .\nI am sorry about that\n\nWhen he says :this is crime against humanity he is so true.\n\nDamn he was in a cult and living in Indian damn\n\n@Philip-Seibel\nhell on earth\n\nWhy were these creatures allowed to continue to operate under a new name? Beyond terrible.\n\n4 months ago\nI have to stop watching bc of the constant F word from your guest.\nReply\nGrow up! You being upset by cursing is the most ridiculous thing to feel and then feel entitled to say out loud and expect people to modify their behavior for the sake of your \u0022precious\u0022 feeling...all the while the ppl are talking about surviving the worst things imaginable...pls grow up and learn that the world doesn\u0027t revolve around you or particularly care for your feelings\n\nThe \u0022in detail\u0022 mentions of CSA was okay but god forbid someone uses a naughty word 😒\n\n4 months ago\nThe justice system still has a long way to go to truly bring \u0022justice\u0022, which will never undo the horror of course, but at least something is done.... How these unspeakable crimes even occur is beyond me. I admire Philip and hats off to what he has become.\nI know a Thai person who speaks no Thai but cultish English via his parents involvement in COG.\nThankyou so much Philip, and lovely lady who runs these talks, for speaking out and daring to share your story so clearly, you are an inspiration. I am just amazed Philip at how together you are, and that you managed to marry and have a family yourself :)). I know how hard the process of speaking out is, especially if there has been so much scapegoating, manipulation, punishment for doing so. It\u0027s taking me years, I seem to do it in waves, each wave getting stronger. \n\nMy story is , I think, so less worse than yours ( or myb I don\u0027t remember all of mine, which is hard bc then I feel it\u0027s not valid, or my feelings and suffering hasn\u0027t been valid ).  \n\nFor me too I had sexual or sexualised abuses by my own mother, and for years, any time I tried to talk about it to anyone, even therapists, she was seen as the victim, and it felt like I was invalidated, as though woman can\u0027t possibly behave or do these things. So it\u0027s healing for me to hear you own your rage, and hear you talk about it so openly. For me it\u0027s the injustice too that burns the most. The imprint it\u0027s left in me has been a difficulty to really have relationships with healthy people, and I always swore I\u0027d never have children unless I could bring them into a healthy environment, so they wouldn\u0027t suffer as I did. I am happy I honoured that. But I have had so much to grieve over the life I never got to live, that I feel I deserved to have.\n\nI truly hope I can heal one day, and have a life and relationship that doesn\u0027t echo the one of my childhood. I believe I deserve it.\n\nThankyou both so much",
      "release": "2025-10-22T06:41:52Z",
      "duration": "01:15:11",
      "explicit": false,
      "youTubeId": "sQH37o5ZsxU",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=sQH37o5ZsxU"
      }
    },
    {
      "id": "cb9abdcb-d522-45d1-982f-d1976b48579b",
      "title": "The Way to Be Happy Seminar about life in the cult children of god",
      "description": "Deutsche Beschreibung weiter unten\n\nIn this German video which i hope one day to make an English version of, I explain the propaganda tools that the cult used to recruit new members for their cause. In detail i explain how easy it can be for anyone to fall for the well rehearsed and polished lies that cult recruiters use to gain new followers, sponsors and donations\n\nMy name is Philip Seibel, a survivor of the notorious cult \u0022the children of god\u0022 in which I was born and raised\n\nAt the age of fifteen I had enough of the forced labor, sexual abuse, beatings and deprivation of speech and liberty and I ran away\n\nMy parents left me to die on the streets of Switzerland and soon after took my younger siblings to Africa. I would not see them again for almost ten years\n\nMy only instrument of survival was my voice and guitar… and lots of will power\n\nAs a former victim of child abuse, I try to make a difference by speaking out against the statutes of limitations. You can help by subscribing to my channel so that as many people as possible will know my story of abuse and survival after growing up in the cult aka the children of god which you can find in my diverse interviews and podcasts on this channel\n\nEver since my youtube channel was hacked and deleted I\u0027ve been re-uploading all my videos \n\nIf you want to know more about me go to my homepage www.philipseibel.com\n\nI am to this day self-employed and truly struggle to make ends meet. Your purchase of my wearables, books and music will really help me to cover the costs of my productions and activism. \n\nYou can also find links to donate on my homepage. Thank you for reading\n\n#stopchildabuse #survivalstory #sing with me #philip seibel #cult survivor\n\nIn diesem deutschen Video, von dem ich hoffe, dass ich eines Tages eine englische Version davon machen kann, erkläre ich die Propagandamittel, die die Sekte einsetzte, um neue Mitglieder für ihre Sache zu gewinnen. Im Detail erkläre ich, wie leicht es für jeden sein kann, auf die gut einstudierten und ausgefeilten Lügen hereinzufallen, mit denen Sektenanwerber neue Anhänger, Sponsoren und Spenden gewinnen\n\nMein Name ist Philip Seibel, ein Überlebender der berüchtigten Sekte „Die Kinder Gottes“, in der ich geboren und aufgewachsen bin\n\nIm Alter von fünfzehn Jahren hatte ich genug von der Zwangsarbeit, dem sexuellen Missbrauch, den Schlägen und dem Entzug von Rede- und Bewegungsfreiheit und lief weg\n\nMeine Eltern ließen mich auf den Straßen der Schweiz zum Sterben zurück und nahmen meine jüngeren Geschwister bald darauf mit nach Afrika. Ich sollte sie fast zehn Jahre lang nicht wiedersehen\n\nMein einziges Überlebensinstrument war meine Stimme und meine Gitarre ... und viel Willenskraft\n\nAls ehemaliges Opfer von Kindesmissbrauch versuche ich, etwas zu bewirken, indem ich mich gegen die Verjährungsfristen ausspreche. Sie können helfen, indem Sie meinen Kanal abonnieren, damit möglichst viele Menschen meine Geschichte von Missbrauch und Überleben erfahren, nachdem ich in der Sekte, auch bekannt als die Kinder Gottes, aufgewachsen bin. Sie finden sie in meinen verschiedenen Interviews und Podcasts auf diesem Kanal\n\nSeit mein YouTube-Kanal gehackt und gelöscht wurde, lade ich alle meine Videos erneut hoch \n\nWenn Sie mehr über mich erfahren möchten, besuchen Sie meine Homepage www.philipseibel.com\n\nIch bin bis heute selbstständig und habe wirklich Mühe, über die Runden zu kommen. Ihr Kauf meiner Wearables, Bücher und Musik wird mir wirklich helfen, die Kosten für meine Produktionen und meinen Aktivismus zu decken. \n\nAuf meiner Homepage finden Sie auch Links zu Spendenmöglichkeiten. Vielen Dank fürs Lesen\n\n#stopchildabuse #survivalstory #sing with me #philip seibel #cult survivor",
      "release": "2024-12-16T06:57:15Z",
      "duration": "00:22:13",
      "explicit": false,
      "youTubeId": "pD1cqMRTxYc",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pD1cqMRTxYc"
      }
    }
  ]
}