{
  "id": "61307c9c-026e-4ba9-ab0c-37d5ea3687e2",
  "name": "Philip Seibel",
  "youTubeChannelId": "UC5lCgGxk5tARKBKUXtREAzA",
  "episodes": [
    {
      "id": "cb9abdcb-d522-45d1-982f-d1976b48579b",
      "title": "The Way to Be Happy Seminar about life in the cult children of god",
      "description": "Deutsche Beschreibung weiter unten\n\nIn this German video which i hope one day to make an English version of, I explain the propaganda tools that the cult used to recruit new members for their cause. In detail i explain how easy it can be for anyone to fall for the well rehearsed and polished lies that cult recruiters use to gain new followers, sponsors and donations\n\nMy name is Philip Seibel, a survivor of the notorious cult \u0022the children of god\u0022 in which I was born and raised\n\nAt the age of fifteen I had enough of the forced labor, sexual abuse, beatings and deprivation of speech and liberty and I ran away\n\nMy parents left me to die on the streets of Switzerland and soon after took my younger siblings to Africa. I would not see them again for almost ten years\n\nMy only instrument of survival was my voice and guitar… and lots of will power\n\nAs a former victim of child abuse, I try to make a difference by speaking out against the statutes of limitations. You can help by subscribing to my channel so that as many people as possible will know my story of abuse and survival after growing up in the cult aka the children of god which you can find in my diverse interviews and podcasts on this channel\n\nEver since my youtube channel was hacked and deleted I\u0027ve been re-uploading all my videos \n\nIf you want to know more about me go to my homepage www.philipseibel.com\n\nI am to this day self-employed and truly struggle to make ends meet. Your purchase of my wearables, books and music will really help me to cover the costs of my productions and activism. \n\nYou can also find links to donate on my homepage. Thank you for reading\n\n#stopchildabuse #survivalstory #sing with me #philip seibel #cult survivor\n\nIn diesem deutschen Video, von dem ich hoffe, dass ich eines Tages eine englische Version davon machen kann, erkläre ich die Propagandamittel, die die Sekte einsetzte, um neue Mitglieder für ihre Sache zu gewinnen. Im Detail erkläre ich, wie leicht es für jeden sein kann, auf die gut einstudierten und ausgefeilten Lügen hereinzufallen, mit denen Sektenanwerber neue Anhänger, Sponsoren und Spenden gewinnen\n\nMein Name ist Philip Seibel, ein Überlebender der berüchtigten Sekte „Die Kinder Gottes“, in der ich geboren und aufgewachsen bin\n\nIm Alter von fünfzehn Jahren hatte ich genug von der Zwangsarbeit, dem sexuellen Missbrauch, den Schlägen und dem Entzug von Rede- und Bewegungsfreiheit und lief weg\n\nMeine Eltern ließen mich auf den Straßen der Schweiz zum Sterben zurück und nahmen meine jüngeren Geschwister bald darauf mit nach Afrika. Ich sollte sie fast zehn Jahre lang nicht wiedersehen\n\nMein einziges Überlebensinstrument war meine Stimme und meine Gitarre ... und viel Willenskraft\n\nAls ehemaliges Opfer von Kindesmissbrauch versuche ich, etwas zu bewirken, indem ich mich gegen die Verjährungsfristen ausspreche. Sie können helfen, indem Sie meinen Kanal abonnieren, damit möglichst viele Menschen meine Geschichte von Missbrauch und Überleben erfahren, nachdem ich in der Sekte, auch bekannt als die Kinder Gottes, aufgewachsen bin. Sie finden sie in meinen verschiedenen Interviews und Podcasts auf diesem Kanal\n\nSeit mein YouTube-Kanal gehackt und gelöscht wurde, lade ich alle meine Videos erneut hoch \n\nWenn Sie mehr über mich erfahren möchten, besuchen Sie meine Homepage www.philipseibel.com\n\nIch bin bis heute selbstständig und habe wirklich Mühe, über die Runden zu kommen. Ihr Kauf meiner Wearables, Bücher und Musik wird mir wirklich helfen, die Kosten für meine Produktionen und meinen Aktivismus zu decken. \n\nAuf meiner Homepage finden Sie auch Links zu Spendenmöglichkeiten. Vielen Dank fürs Lesen\n\n#stopchildabuse #survivalstory #sing with me #philip seibel #cult survivor",
      "release": "2024-12-16T06:57:15Z",
      "duration": "00:22:13",
      "explicit": false,
      "youTubeId": "pD1cqMRTxYc",
      "subjects": [
        "Children Of God"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=pD1cqMRTxYc"
      }
    }
  ]
}