{
  "id": "186c402d-1ea3-482f-adba-32ea4e7cb287",
  "name": "Phoenix Rising: Descending into the Threads \u0026 Rising from the Roots",
  "spotifyId": "4NBDs7SKiVV8yrrO8j0q3Z",
  "appleId": 1602943846,
  "episodes": [
    {
      "id": "63b6f623-6952-459b-b686-47652921c570",
      "title": "Ep 123: From Cult to Reconnecting and Deeply Trusting Yourself with Demetra Gray",
      "description": "In this episode, I’m joined by Demetra Gray, a wife, writer, and podcast host as she shares the complete shift she’s experienced in her life over the past year and a half, as she realized she was in a spiritual cult and left the cult.  How Demetra realized the community she was in was a cult.  The manipulation Demetra felt every time she got close to her next monetary goal.  What a spiritual cult is.  Quantum, ascension, energy, and codes. There\u0027s truth in everything, but it can be a detriment to others when it’s taken too far.   The spiritual connection back to Earth and nature.  Trusting the feminine and your own body.  The dangers of nervous system disassociation.  The power of faith and trusting in a higher power.  All the layers of us that are at play, beyond just the spiritual realm.   How the spiritual worlds teach us to question everything.  How Lisa\u0027s nervous breakdown and experiencing the fires of hell brought her to trust God. The filtering of New Age teachings.  Demetra’s food and hormone journey.   What made Demetra leave the cult.  Healing through speaking of her experiences, trauma, and growth.  The trend of cults in the coaching world.  The importance of deeply trusting yourself.  What Demetra’s work looks like now.  The #1 thing that contributes to a great marriage.   Guest Bio: Demetra Gray is a writer who lives with her husband, Jordan, on a little island off the West coast of British Columbia. She is also the host of the podcast \u0022The Demetra Gray Show.\u0022   Connect with Demetra:  Website: demetragray.com  Instagram: https://www.instagram.com/demetragray__/  SHARE THE MAGIC.  If you enjoyed this episode and it spoke to your soul in some way today, please be sure to take a screenshot, share it on Instagram, and tag me @lisa__hillyer. Also, please be sure to leave us a review and a five star rating if you\u0027re loving what we are doing. #phoenixrising  Join the Phoenix Rising Patreon Portal. Subscribe to Lisa\u0027s mailing list.  Let\u0027s connect on:  Instagram and Youtube.  Sponsors: QUEEN OF THE THRONES | Use discount code \u0027LISAHILLYER10\u0027 ⁠https://www.shopqueenofthethrones.ca/?platform=grin\u0026link_id=1572859\u0026token=7LWCG2nUcQOCWMhwU9UvTPrarooYPY1p\u0026contact_id=c80ec795-6d06-4be2-8b41-f0459af31c2d\u0026attribution_window=30⁠ FATSKN | ⁠https://fatskn.com/?ref=zalxd9sc⁠ WILD WHOLISTIC | Use discount code \u0027LISA\u0027 ⁠https://wildwholistic.com/?sca_ref=3666298.AHHDQrvkCW⁠ ⁠⁠REWILDING ROSES APOTHECARY⁠⁠⁠ | Use code PHOENIX for 25% off ⁠http://www.heartsoulhealthwellness.com/rewilding-roses-apothecary⁠   ---   Send in a voice message: https://podcasters.spotify.com/pod/show/lisa-hillyer/message",
      "release": "2024-01-06T03:16:48Z",
      "duration": "01:28:48.4680000",
      "explicit": false,
      "spotifyId": "2WyI0XKZPxR5W41SMomgUi",
      "appleId": 1000640682684,
      "urls": {
        "spotify": "https://open.spotify.com/episode/2WyI0XKZPxR5W41SMomgUi",
        "apple": "https://podcasts.apple.com/podcast/ep-123-from-cult-to-reconnecting-and-deeply-trusting/id1602943846?i=1000640682684"
      }
    }
  ]
}