{
  "id": "7cfead5d-11a0-4c5e-896b-707fac6d7219",
  "name": "Pod Candy - Cults, Crimes \u0026 Killers",
  "spotifyId": "4vWiWIYnqJtxu0DJwvzAaU",
  "appleId": 1813049296,
  "youTubeChannelId": "UCFmsbXlmisJfHco-hQqCsYA",
  "episodes": [
    {
      "id": "d11f8897-66ab-4472-896c-ac91af18df4e",
      "title": "The Cult of The Duggar Family",
      "description": "In this powerful and disturbing episode, Stacey, Dori, and Dr. John take a deep dive into Shiny Happy People, the chilling docuseries exposing the Duggar family and their ties to the Institute in Basic Life Principles (IBLP), a fundamentalist Christian organization led by the controversial Bill Gothard. What lies beneath the surface of big smiles and modesty? Abuse, control, and a dangerous culture of silence. The hosts dissect the teachings and tactics of IBLP, including blanket training, purity culture, and the cult-like authoritarian system that robbed countless women and children of agency and safety. With raw honesty and expert insight, they explore how this toxic ideology went mainstream—fueled by TLC’s reality TV empire—and how survivors are now bravely breaking their silence.",
      "release": "2025-08-05T09:00:00Z",
      "duration": "00:57:02.4400000",
      "explicit": true,
      "spotifyId": "2rcttCRKgCViaUh5qv4EIF",
      "appleId": 1000720697387,
      "youTubeId": "8PSwu-Z5iuw",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rcttCRKgCViaUh5qv4EIF",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-the-duggar-family/id1813049296?i=1000720697387",
        "youtube": "https://www.youtube.com/watch?v=8PSwu-Z5iuw"
      }
    },
    {
      "id": "308d08ac-b1ad-43af-a686-8ca31521bd87",
      "title": "Leaving an Orthodox Jewish Cult",
      "description": "In this powerful and emotional episode of PodCandy, Stacey, Dori and Dr. John dive deep into the harrowing yet inspiring story of Chavie Weisberger, a brave woman who escaped the confines of an ultra-Orthodox Hasidic Jewish sect—led by her own grandfather. From forced marriage and suppressed sexuality to a traumatic custody battle, Chavie’s journey reveals the dark side of religious extremism and the systemic control of women. With insight from psychologist Dr. John Mayer, the hosts explore themes of gender oppression, cult dynamics, and the resilience it takes to break free and reclaim your identity. Listener discretion advised—this episode includes discussions of sexual abuse and other sensitive topics. Based on the original interview featured on \u0022Cults to Consciousness\u0022 hosted by Shalise Ann Sola.",
      "release": "2025-07-22T09:00:00Z",
      "duration": "00:59:33.3200000",
      "explicit": true,
      "spotifyId": "6j5YDKZWuTqZIpOKc1lxf1",
      "appleId": 1000718440550,
      "subjects": [
        "Hasidic Judaism",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6j5YDKZWuTqZIpOKc1lxf1",
        "apple": "https://podcasts.apple.com/podcast/leaving-an-orthodox-jewish-cult/id1813049296?i=1000718440550"
      }
    }
  ]
}