{
  "id": "7cfead5d-11a0-4c5e-896b-707fac6d7219",
  "name": "Pod Candy - Cults, Crimes \u0026 Killers",
  "spotifyId": "4vWiWIYnqJtxu0DJwvzAaU",
  "appleId": 1813049296,
  "youTubeChannelId": "UCFmsbXlmisJfHco-hQqCsYA",
  "episodes": [
    {
      "id": "783e745b-9788-4da2-af53-9b0cf19261b8",
      "title": "Corey Feldman vs Angels and His Demons",
      "description": "In this episode of Pod Candy, Stacey and Dori dive into Corey Feldman Versus the World—a YouTube documentary filmed around 2016 that tracks Corey Feldman during a turbulent stretch of touring, isolation, and relentless public scrutiny. \n\nWhat starts as “wait…what am I watching?” quickly turns into something darker: the documentary’s “angels” era—young women recruited into Feldman’s orbit—raises unsettling questions about control, power, and cult-like dynamics, including reports of strict rules and basic-needs restrictions while on the road. \n\nJoining them, Dr. John zooms out from the spectacle and into the psychology—connecting paranoia, “dark media” conspiracies, and the “love and light” self-mythology to a broader pattern of delusion and grievance.  Stacey and Doris’ minds are blown when Dr. John drops his most provocative comparison: parallels to Charles Manson—the entourage structure, the messiah framing, and the obsession with being recognized as a “real” artist. \nFind out what happens when childhood fame, unresolved trauma, and the need to control the narrative collide… and who gets hurt along the way.\n\nContent warning: This episode discusses childhood trauma, abuse and mental health struggles.\n\nSource Documentary: \u0022Cory Feldman vs The World\u0022 on Youtube TV",
      "release": "2026-02-03T10:00:00Z",
      "duration": "01:01:35.5600000",
      "explicit": false,
      "spotifyId": "1YJMmCYzWuVMBhgo33STiu",
      "appleId": 1000747840367,
      "youTubeId": "Vj2s7st1P8I",
      "subjects": [
        "_Blank"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1YJMmCYzWuVMBhgo33STiu",
        "apple": "https://podcasts.apple.com/podcast/corey-feldman-vs-angels-and-his-demons/id1813049296?i=1000747840367",
        "youtube": "https://www.youtube.com/watch?v=Vj2s7st1P8I"
      }
    },
    {
      "id": "9f9499b1-4c72-4d34-8ea9-2e2b41a8f2a6",
      "title": "The Cult Behind Teal Swan",
      "description": "Stacey and Dori turn their attention to Teal Swan, a spiritual influencer whose teachings on healing and suicide have made her both magnetic and deeply controversial. Drawing from the docuseries The Deep End, the hosts unpack how Swan shapes her image, the unsettling dynamics within her inner circle, and why so many vulnerable people are drawn into her orbit. With Dr. John weighing in, the conversation digs into the psychology of manipulation, the ethics of self-proclaimed healers, and what this story reveals about belief, control, and the human need for answers. Source Documentary: \u0022The Deep End\u0022 on Prime Video",
      "release": "2025-09-30T09:00:00Z",
      "duration": "01:09:20.3590000",
      "explicit": false,
      "spotifyId": "0P0f8hS1RZM4zDT1EDdJgk",
      "appleId": 1000729254151,
      "youTubeId": "XkS2ct2OcYU",
      "subjects": [
        "Teal Swan"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0P0f8hS1RZM4zDT1EDdJgk",
        "apple": "https://podcasts.apple.com/podcast/the-cult-behind-teal-swan/id1813049296?i=1000729254151",
        "youtube": "https://www.youtube.com/watch?v=XkS2ct2OcYU"
      }
    },
    {
      "id": "d11f8897-66ab-4472-896c-ac91af18df4e",
      "title": "The Cult of The Duggar Family",
      "description": "In this powerful and disturbing episode, Stacey, Dori, and Dr. John take a deep dive into Shiny Happy People, the chilling docuseries exposing the Duggar family and their ties to the Institute in Basic Life Principles (IBLP), a fundamentalist Christian organization led by the controversial Bill Gothard. What lies beneath the surface of big smiles and modesty? Abuse, control, and a dangerous culture of silence. The hosts dissect the teachings and tactics of IBLP, including blanket training, purity culture, and the cult-like authoritarian system that robbed countless women and children of agency and safety. With raw honesty and expert insight, they explore how this toxic ideology went mainstream—fueled by TLC’s reality TV empire—and how survivors are now bravely breaking their silence.",
      "release": "2025-08-05T09:00:00Z",
      "duration": "00:57:02.4400000",
      "explicit": true,
      "spotifyId": "2rcttCRKgCViaUh5qv4EIF",
      "appleId": 1000720697387,
      "youTubeId": "8PSwu-Z5iuw",
      "subjects": [
        "Institute In Basic Life Principles"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2rcttCRKgCViaUh5qv4EIF",
        "apple": "https://podcasts.apple.com/podcast/the-cult-of-the-duggar-family/id1813049296?i=1000720697387",
        "youtube": "https://www.youtube.com/watch?v=8PSwu-Z5iuw"
      }
    },
    {
      "id": "308d08ac-b1ad-43af-a686-8ca31521bd87",
      "title": "Leaving an Orthodox Jewish Cult",
      "description": "In this powerful and emotional episode of PodCandy, Stacey, Dori and Dr. John dive deep into the harrowing yet inspiring story of Chavie Weisberger, a brave woman who escaped the confines of an ultra-Orthodox Hasidic Jewish sect—led by her own grandfather. From forced marriage and suppressed sexuality to a traumatic custody battle, Chavie’s journey reveals the dark side of religious extremism and the systemic control of women. With insight from psychologist Dr. John Mayer, the hosts explore themes of gender oppression, cult dynamics, and the resilience it takes to break free and reclaim your identity. Listener discretion advised—this episode includes discussions of sexual abuse and other sensitive topics. Based on the original interview featured on \u0022Cults to Consciousness\u0022 hosted by Shalise Ann Sola.",
      "release": "2025-07-22T09:00:00Z",
      "duration": "00:59:33.3200000",
      "explicit": true,
      "spotifyId": "6j5YDKZWuTqZIpOKc1lxf1",
      "appleId": 1000718440550,
      "subjects": [
        "Hasidic Judaism",
        "Cult Psychology",
        "Psychology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6j5YDKZWuTqZIpOKc1lxf1",
        "apple": "https://podcasts.apple.com/podcast/leaving-an-orthodox-jewish-cult/id1813049296?i=1000718440550"
      }
    }
  ]
}