{
  "_ts": 0,
  "id": "db8931f1-944a-4255-8fd3-80153804a47a",
  "name": "Podsauce",
  "youTubeChannelId": "UCt7WtPch6lzQ4Tizug3RaZw",
  "episodes": [
    {
      "id": "53b95e90-e682-4598-80cb-2e1284270a69",
      "title": "An Extended Interview with Caroline \u0026 Rebecca, Hosts of \u0027Trapped in Treatment\u0027",
      "description": "In this extended interview, hear Caroline Cole and Rebecca Mellinger, hosts of “Trapped in Treatment,” go into more detail about how their podcast exposes the troubled teen industry, the influence of their executive producer #ParisHilton, and how communities can support young people.\n\nThe idea for this podcast was sparked when Caroline and Rebecca accompanied Paris to a rally in Utah for survivors of the Provo Canyon School, a so-called mental health treatment school/facility for troubled teens that Paris attended. While these sorts of “troubled teen” facilities have been around since the 1960s, Senators and advocates have been trying to shed light on the abuses that they and others have suffered inside. The release of Paris’ 2020 documentary This Is Paris truly shifted the tides when Paris opened up about the PTSD she suffered from the four different “troubled teen” boarding schools she attended in her youth.\n\nAlong with Paris, Caroline and Rebecca realized that this is a pervasive issue that #TrappedInTreatment would not only expose to the public, but give other survivors of these schools a platform to share their stories.\n\nAlesha asks the two how parents are convinced to send their children to these schools and what they are told happens inside their walls. Caroline explains that with a lack of regulations, extreme marketing techniques, and lots and lots of lies and deception, parents don’t believe their children about what’s happening, and children are told to not even bother trying to accuse the schools of wrongdoing.\n\nRead the full article here: https://podsauce.com/episodes/trapped-in-treatment-extended-interview/\n\n#Podcast\n\nFollow us on social\n🌀 https://twitter.com/thepodsauce\n🌀 https://www.instagram.com/thepodsauce\n🌀 https://www.facebook.com/thepodsauce/\n\n🌀 Podsauce covers the world of podcasting to help podcast lovers and newbies #GetATaste for new series and can’t-miss episodes‼️",
      "release": "2022-03-04T17:00:15Z",
      "duration": "00:18:11",
      "explicit": false,
      "youTubeId": "Q3P_f-kMaHI",
      "subjects": [
        "Troubled Teen Industry",
        "Psychology"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=Q3P_f-kMaHI"
      }
    },
    {
      "id": "da61befb-dd64-499c-8376-71184a9e641c",
      "title": "The Hosts of \u0027Trapped in Treatment\u0027, Produced by Paris Hilton, Discuss The \u0022Troubled Teen Industry\u0022",
      "description": "The hosts of “Trapped in Treatment” discuss working with Paris Hilton, reporting on the Provo Canyon School, and interviewing survivors of the troubled teen industry. Plus, “Let’s Get Vulnerable” with a relationship podcast recommended by Alesha, and Dax’s latest Odd Pod.\n\nFollow us on social\n🌀 https://twitter.com/thepodsauce\n🌀 https://www.instagram.com/thepodsauce\n🌀 https://www.facebook.com/thepodsauce/\n\n🌀 Podsauce covers the world of podcasting to help podcast lovers and newbies #GetATaste for new series and can’t-miss episodes‼️",
      "release": "2022-03-02T17:00:10Z",
      "duration": "00:22:21",
      "explicit": false,
      "youTubeId": "j5YJU9iAXQU",
      "subjects": [
        "Troubled Teen Industry"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=j5YJU9iAXQU"
      }
    }
  ]
}