{
  "id": "73e6a36c-1d68-4179-aefc-2356f968f0b7",
  "name": "Polly",
  "spotifyId": "4SoNf4Dbya3qWh5ESb9U49",
  "appleId": null,
  "youTubeChannelId": "",
  "episodes": [
    {
      "id": "df479b3c-c149-4d26-be03-a5e96a5a5379",
      "title": "\u0027He thinks he\u0027s God\u0027: Australian author details the twisted mind of cult leader, sex predator William Kamm",
      "description": "In a follow-up to her powerful interview with Stefanie Hinrichs - who lost her childhood to one of Australia\u0027s most dangerous sex predators - Polly speaks with Megan Norris, the author of The Messiah\u0027s Bride. Stefanie was just 11 years old when she was forced to become the self-proclaimed Messiah\u0027s child bride. Norris, who is an investigative journalist, has detailed the story of Stefanie\u0027s journey. From moving to Australia to finding herself trapped in an illicit sexual relationship with the Doomsday cult leader William Kamm, also known as \u0027Little Pebble\u0027. \u0022He does suffer from a narcissistic personality disorder. He thinks he\u0027s God. He thinks he\u0027s more superior and cleverer than everybody and he gets off on that,\u0022 Norris told Polly. \u0022I do not know what the appeal of that odd little man could be. I just don\u0027t get it.\u0022See omnystudio.com/listener for privacy information.",
      "release": "2023-03-02T00:00:00",
      "duration": "00:40:36.2570000",
      "explicit": false,
      "spotifyId": "4m3nwnTkXIM5wj5VC4TZ22",
      "appleId": null,
      "youTubeId": "",
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4m3nwnTkXIM5wj5VC4TZ22",
        "apple": null,
        "youtube": null
      }
    },
    {
      "id": "4fd3b94e-8e67-4ea9-bb49-de306ce409a5",
      "title": "Stefanie Hinrichs survived a doomsday cult in Australia - this is her story",
      "description": "Polly speaks with Stefanie Hinrichs, a survivor of a doomsday cult in Australia run by a paedophile.William Costellia Kamm, or \u0027Little Pebble\u0027, portrays himself as a religious figure. But he is a malevolent individual. In the 1980s, he established a doomsday cult, and he convinced his followers that he could speak with the Virgin Mary. He also fabricated a story that God instructed him to take multiple wives to repopulate the planet.This deceitful man\u0027s actual goal was to engage in sexual activity with underage girls. He was apprehended and sentenced to a decade in prison. He\u0027s now out, and there are substantial concerns that he has returned to his former behaviour.See omnystudio.com/listener for privacy information.",
      "release": "2023-03-01T00:00:00",
      "duration": "00:38:36.8780000",
      "explicit": false,
      "spotifyId": "1hm0JYfrlInVdKel9pA7If",
      "appleId": null,
      "youTubeId": "",
      "subjects": [],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1hm0JYfrlInVdKel9pA7If",
        "apple": null,
        "youtube": null
      }
    }
  ]
}