{
  "id": "e487b759-fd07-4627-9b00-0c7c222e56f8",
  "name": "Pop Apologists",
  "spotifyId": "2lAfRnwSjb2NjxjtqMy3Wh",
  "appleId": 1507190937,
  "episodes": [
    {
      "id": "c9380ece-e254-4b37-8902-bcf57b730e77",
      "title": "MOTHER GOD: The “Love Has Won” Cult We’re Fascinated by ft. Kate Casey",
      "description": "This week Lauren and Chan are joined by Kate Casey from Reality Life with Kate Casey as they dive into the fascinating world of the Mother God cult featured in the HBO docuseries “Love Has Won: The Cult of Mother God.” Hear about cult leader Amy Carlson’s beliefs, including being 19 million year old and being helped by a team of dead celebrities, led by Robin Williams. The gals discuss Mother God’s rise to power and the bizarre practices she and her followers would take part in as part of their community. This docuseries is like a slow motion disaster— you can’t believe what you are seeing, but you also can’t look away.  Lauren, Chan, and Kate also talk about their favorite reality topics: The Golden Bachelor, Sister Wives, and Paris Hilton. Hear who Kate feels is the most powerful woman in unscripted television, as well as a genius idea for a TLC spinoff show.   Click here to try the most magical gummies by EarlyBird CBD! Use code POPAPOLOGISTS for 20% off! Shop Clean Simple Eats protein powder and use code POPAPOLOGISTS for 10% off!  To support the show, consider subscribing on Patreon, where you can get a bonus episode of Pop Apologists every Friday!  Please note this episode may contain paid endorsements and advertisements for products and services. Individuals on the show may have a direct or indirect financial interest in products or services referred to in this episode. Learn more about your ad choices. Visit podcastchoices.com/adchoices",
      "release": "2023-12-20T08:00:00Z",
      "duration": "01:13:05.6970000",
      "explicit": false,
      "spotifyId": "5LdNNjdkEbjJavZq4sXVh6",
      "appleId": 1000639184202,
      "subjects": [
        "Love Has Won"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5LdNNjdkEbjJavZq4sXVh6",
        "apple": "https://podcasts.apple.com/podcast/mother-god-the-love-has-won-cult-were-fascinated-by/id1507190937?i=1000639184202"
      }
    }
  ]
}