{
  "id": "fb9d28ec-c89e-4b01-bbf3-70b72889a4c9",
  "name": "Pouty Mouth",
  "spotifyId": "5Gt4PdldT1VEEezyXEqQZ4",
  "appleId": 1752590866,
  "episodes": [
    {
      "id": "e45ef93a-4529-4649-b4bb-50025f932d3c",
      "title": "Getting Mouthy w/ Adoptee Apostate",
      "description": "Episode 23 - Trigger Warning, mention of suicide Ideation, attempts and molestation. Sariah and I dive into her story as a Chinese transracial adoptee raised in a Mormon family. We get into her relationships with her adopted family, the complexities of navigating mental health, perfectionism and what happens when you\u0027re sexually assaulted by a family member as an adoptee in Mormonism . We discuss Sariah\u0027s struggles on her Mormon mission, the challenges of knowing she was a lesbian and not being believed when she came out to her Mormon family. We mouth off about our least favorite adoption teaching in Mormonism and we talk about what she\u0027s done to heal from her trauma. Follow Sariah @TheAdopteeapostate IG \u0026 TikTok Follow @poutymouthpodcast Join the Pouty Girlz Discord Server!",
      "release": "2025-06-03T06:00:00Z",
      "duration": "01:11:54.1740000",
      "explicit": true,
      "spotifyId": "3maxnBU877iMcGFIslDShd",
      "appleId": 1000710973556,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3maxnBU877iMcGFIslDShd",
        "apple": "https://podcasts.apple.com/podcast/getting-mouthy-w-adoptee-apostate/id1752590866?i=1000710973556"
      }
    },
    {
      "id": "d615316f-196f-49ac-a1da-97d36a9fadc4",
      "title": "Pouting About Mormon Reality Tv Moments",
      "description": "Episode 22 - I\u0027m diving into the portrayal of Mormonism in reality TV from the mid-90s to the present, focusing on key shows like \u0027The Real World\u0027, \u0027My Husband\u0027s Not Gay\u0027 and of course I had to end with this season of \u0027The Secret Lives of Mormon Wives.\u0027 What did these shows portrayals of Mormonism get right, what do they exaggerate and why does Mormonism fascinate pop culture? Let\u0027s talk about it! I get into how these shows have shaped public perceptions of Mormon culture, confused them about the differences between the mainstream Mormon church and its offshoots, and the experiences of individuals navigating their identities within the framework of Mormon beliefs. I highlight the impact of Mormon doctrine on LGBTQ\u0026#43; identities and the societal expectations placed on individuals, particularly women. The discussion also critiques the portrayal of these issues in reality TV shows, emphasizing the backlash against harmful narratives and the emotional toll on those involved. Ultimately, I reflect on how Mormonism serves as a mirror for broader American cultural themes and how it might actually be the \u0022best\u0022 tv villain we\u0027ve ever seen. Join the Pouty Girlz Discord Server⁠ ! @poutymouthpodcast @taramherbert The Most American Religion Want to catch up on the shows mentioned in today\u0027s episode? Get a 30 day Free Trial on Hulu!",
      "release": "2025-05-27T06:37:34Z",
      "duration": "01:11:45.7920000",
      "explicit": true,
      "spotifyId": "5FXvBMIEpatfYnF8c8pmyv",
      "appleId": 1000710051577,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5FXvBMIEpatfYnF8c8pmyv",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-mormon-reality-tv-moments/id1752590866?i=1000710051577"
      }
    },
    {
      "id": "b4e97bf1-e258-4a62-a928-d233c144d770",
      "title": "Pouting About Being a Soft Girl in a Hard World w/Sierra Nicole Rose",
      "description": "Episode 21 - Sierra Nicole Rose is here! We delve into Sierra\u0027s experiences with adoption, identity, and growing up as a black girl in a predominantly white community. Sierra shares her journey into modeling and acting, the development of her confidence, and her reflections on Mormon teachings and ancestry. We explore the weirdness that comes when mormon adoptees are doing temple work for their dead biological ancestors without knowing their living family. We get into how boring Mormonism truly is! We mouth off about the new garments, cognitive dissonance that makes it hard for our mormon families to understand where exmormons are coming. Socials: @sierranicolerose @poutymouthpodcast",
      "release": "2025-05-20T06:00:00Z",
      "duration": "01:28:28.3830000",
      "explicit": true,
      "spotifyId": "0rJA1YuDXWyYcqIvnPY22P",
      "appleId": 1000709106282,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0rJA1YuDXWyYcqIvnPY22P",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-being-a-soft-girl-in-a-hard-world/id1752590866?i=1000709106282"
      }
    },
    {
      "id": "96d705f2-c214-45d3-b4e6-264508e468cc",
      "title": "Mouthing off About Purity Culture",
      "description": "Episode 20. Welcome back to Season 2 of Pouty Mouth! I share my experiences living in Kyrgyzstan and the cultural shifts that have come with it. I reflect on my journey of personal growth, the importance of community, and my evolving sense of fashion and self-expression. I introduce new segments for listener submissions and share some spicy submissions about the most hilariously wrong things we believed about sex from being raised in purity culture. The episode concludes with the launch of a new Discord community for listeners to connect and share their stories. Join here: https://discord.gg/HpJ3YhTTqN . (must be 18\u0026#43;) Follow @poutymouthpodcast Chapters 00:00 Welcome to Season 2: New Beginnings 02:52 Life in Kyrgyzstan: A Cultural Shift 05:52 Reflections on Religion and Personal Growth 09:09 Community and Connection in a New Environment 12:10 Fashion and Self-Expression: A New Wardrobe 15:12 Health, Beauty, and Self-Care in Kyrgyzstan 17:55 Building a Podcast Community 20:51 Introducing New Segments 24:12 Oral Traditions: Exploring Purity Culture 29:51 Discord Community: Pouty Girlz",
      "release": "2025-05-12T18:00:00Z",
      "duration": "00:38:14.0850000",
      "explicit": true,
      "spotifyId": "6pIXXFdPtFHuVHAwEK55Jd",
      "appleId": 1000708173470,
      "subjects": [
        "Purity Culture"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6pIXXFdPtFHuVHAwEK55Jd",
        "apple": "https://podcasts.apple.com/podcast/mouthing-off-about-purity-culture/id1752590866?i=1000708173470"
      }
    },
    {
      "id": "fdf218f1-052c-4eaa-ae82-3c420c1a382f",
      "title": "EP. 19 Mouthing Off About \u0022Failed\u0022 Adoptions w/ Cadon Sagendorf",
      "description": "In this episode, I speak with Caden Sagendorf, a transracial adoptee, about his unique adoption story and experiences growing up in a predominantly white Mormon family and being placed into foster care. Caden shares his journey from being adopted at birth to navigating his identity as a Black and Latino individual in a community with few people of color. He discusses the challenges of growing up in a religious environment, the impact of racism and microaggressions, and his struggles with mental health. Caden also opens up about coming out as gay, the complexities of leaving the Mormon church at a young age, the importance of advocacy for foster care and adoption rights. Follow Cadon\u0027s advocacy work Follow @poutymouthpodcast",
      "release": "2025-02-25T10:00:00Z",
      "duration": "01:14:50.0420000",
      "explicit": true,
      "spotifyId": "5C73ZfxZYQULSjQaCQ0Vf9",
      "appleId": 1000695817122,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5C73ZfxZYQULSjQaCQ0Vf9",
        "apple": "https://podcasts.apple.com/podcast/ep-19-mouthing-off-about-failed-adoptions-w-cadon-sagendorf/id1752590866?i=1000695817122"
      }
    },
    {
      "id": "dd88dbfe-4f66-429e-a146-f21a4027e92d",
      "title": "Pouting About Belonging w/ Markeeda Elliott",
      "description": "In this episode of the Pouty Mouth podcast, Markeeda Elliott shares her profound journey as foster care adoptee raised in a Mormon household. She discusses her early experiences of being adopted, the complexities of her identity, and the impact of her upbringing on her mental health. Marquita reflects on her reconnection with her birth family and the challenges of navigating trauma, therapy, and the expectations of Mormonism. Her story highlights the struggles of adoptees in finding their place within their families and communities, as well as the importance of understanding and healing from past experiences. In this conversation, the speakers delve into the complexities of adoption, identity, and faith, particularly within the context of Mormonism. They explore the challenges of growing up in predominantly white spaces, the impact of trauma on personal development, and the ongoing journey of deconstructing religious beliefs. The discussion highlights the intersection of race and religion, particularly for Black individuals within the Mormon community, and the importance of building a supportive family environment amidst differing beliefs. In this conversation, we discuss the challenges faced by mixed-faith families and the impact of adoption on racial identity. Follow @poutymouthpodcast for discussions and updates",
      "release": "2025-02-18T10:39:00Z",
      "duration": "01:35:25.3900000",
      "explicit": true,
      "spotifyId": "0Kv8Xg21OSwQJ39IcTG8Lv",
      "appleId": 1000693431729,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0Kv8Xg21OSwQJ39IcTG8Lv",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-belonging-w-markeeda-elliott/id1752590866?i=1000693431729"
      }
    },
    {
      "id": "42b09d14-e4a9-45f8-8e78-257d89cb923f",
      "title": "Pouting About Abuse in Adoption w/ Coko Springer",
      "description": "In this episode of Pouty Mouth, host Tara Herbert speaks with Coko Springer about her unique journey through foster care and adoption by a Mormon Family. Coko shares her experiences of being adopted into a Mormon family, the complexities of identity and name changes, and the impact of her upbringing on her sense of self. The conversation delves into the challenges of navigating cultural differences, the importance of understanding one\u0027s roots, and the emotional struggles associated with being a part of a blended family. Coko\u0027s story highlights the resilience of individuals in the face of adversity and the significance of connection and belonging. This conversation delves into the complexities of growing up in a foster care system, the challenges of identity and belonging, and the impact of systemic racism. We share personal stories of warmth and loneliness, navigating cultural disconnects, and the struggles faced by their biological and adoptive families. They reflect on their experiences within the Mormon community and the journey towards understanding their identities as individuals raised in predominantly white environments. This conversation delves into the complexities of childhood trauma, family dynamics, and the impact of religion on personal identity. The speakers share their experiences with foster care, health struggles, and the journey of breaking free from toxic relationships. They explore the challenges of finding connection within their biological families and the importance of embracing life beyond societal expectations. Follow @poutymouthpodcast Share your thoughts on today\u0027s episode",
      "release": "2025-02-04T10:10:00Z",
      "duration": "01:20:21.0190000",
      "explicit": true,
      "spotifyId": "3Fva0FmskX961wq7IO7HQ5",
      "appleId": 1000688850349,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3Fva0FmskX961wq7IO7HQ5",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-abuse-in-adoption-w-coko-springer/id1752590866?i=1000688850349"
      }
    },
    {
      "id": "b548300f-1170-4bc6-b55f-044b1874b09f",
      "title": "Getting Mouthy with a Former Mormon Trad-wife w/Jennie Gage",
      "description": "In my conversation with Jennie we dive into her life as a former Mormon trad-wife, the choice feminism we were all raised with and how she\u0027s rebuilt her life after leaving an abusive marriage and Mormonism. Jennie gives such valuable insight into the ways Mormonism has harmed, continues to harm women and what we can do differently now. Follow Jennie @lifetaketwo Power, Priesthood and Pussy Follow @poutymouthpodcast",
      "release": "2025-01-28T10:00:00Z",
      "duration": "01:24:51.9270000",
      "explicit": true,
      "spotifyId": "3PANmZigfghizl4h5qMw1Q",
      "appleId": 1000686178968,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3PANmZigfghizl4h5qMw1Q",
        "apple": "https://podcasts.apple.com/podcast/getting-mouthy-with-a-former-mormon-trad-wife-w-jennie-gage/id1752590866?i=1000686178968"
      }
    },
    {
      "id": "24724694-2906-47d2-b885-682fa9b5ced8",
      "title": "Pouting About Mormon Women\u0027s Mental Health",
      "description": "*Spoilers Alert - Today I\u0027m getting into Shari Franke\u0027s book, \u0022The House of my Mother.\u0022 We get into the themes that stuck out to me and talk about how Mormon mom\u0027s makes for great social media influencers but often times are struggling with stunted development, deep shame and mental health issues. Tell me what you thought of this episode on IG @poutymouthpodcast",
      "release": "2025-01-21T10:00:00Z",
      "duration": "00:55:19.9190000",
      "explicit": true,
      "spotifyId": "5AYo8DyPu8TDq9ZDUdjMQ7",
      "appleId": 1000684825495,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5AYo8DyPu8TDq9ZDUdjMQ7",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-mormon-womens-mental-health/id1752590866?i=1000684825495"
      }
    },
    {
      "id": "e294213c-0ea6-44a3-bc32-51da215b9bde",
      "title": "Pouting About the BYU \u0022honor code\u0022 w/ Jayci Underwood",
      "description": "Jayci Underwood was branded with a scarlet letter when national news got out that she was pregnant with BYU\u0027s star athlete, Brandon Davies\u0027 baby. Brandon sat out the rest of the 2011 NCAA tournament and was encouraged by coaches and church leaders to not admit paternity to either of the two women he had gotten pregnant. Without support from her family, the father of the children, and at the encouragement from her church ,Jayci made the difficult decision to place her child for adoption. Jayci and I talk about her upbringing in the church, the circumstances that led up to her decision, the consequences she faced vs Brandon Davies and what her relationship is like now with her 13 year old son she placed and his adopted parents. Follow Jayci on IG and TikTok @Jayciunderwood Follow @poutymouthpodcast on IG Follow @taramherbert on TikTok",
      "release": "2025-01-14T08:19:00Z",
      "duration": "01:50:44.4130000",
      "explicit": true,
      "spotifyId": "29n2ZCUW5w0JSQPTRGv19P",
      "appleId": 1000683903388,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/29n2ZCUW5w0JSQPTRGv19P",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-the-byu-honor-code-w-jayci-underwood/id1752590866?i=1000683903388"
      }
    },
    {
      "id": "73fdca69-4eec-47e3-8965-3fcf26bd39b5",
      "title": "Pouting About Big Life Changes",
      "description": "In this episode I\u0027m pouting about into some personal big life changes, my mixed faith marriage, what it was like being companions with Whitney Leavitt from Secret Lives of Mormon Wives and some alleged tea that happen while we were on our missions. Follow along on IG: @Poutymouthpodcast Follow me on TikTok: @taramherbert",
      "release": "2025-01-07T10:45:00Z",
      "duration": "00:55:05.7550000",
      "explicit": true,
      "spotifyId": "0NEctPEQAwWvXl8CmxAAZJ",
      "appleId": 1000683004441,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0NEctPEQAwWvXl8CmxAAZJ",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-big-life-changes/id1752590866?i=1000683004441"
      }
    },
    {
      "id": "21fc799a-5151-4a18-b0de-54fb308e7eae",
      "title": "Pouting About De-influencing w/Aleja Briles",
      "description": "In this episode of the Pouty Mouth podcast, Tara Herbert interviews Aleja Briles, a former Mormon influencer who shares her journey from being a prominent figure in the Mormon community to becoming an ex-Mormon. Aljha discusses her upbringing as a Colombian immigrant in a Mormon household, the complexities of family dynamics, and the challenges she faced during her mission. The conversation delves into the expectations placed on women in the church, the struggles of identity, and the impact of cultural background on her experiences. She shares her journey from being a Mormon influencer to navigating her identity and faith after leaving the church. She discusses her unexpected romance, the rise of her influencing career, and the challenges of modeling within the constraints of modesty. The conversation culminates in her current adventures in van life, symbolizing her quest for freedom and self-discovery. Follow Aleja: @Alejabriles @aalejabriles Follow @poutymouthpodcast @taramherbert",
      "release": "2024-10-29T10:00:00Z",
      "duration": "01:18:12.6360000",
      "explicit": true,
      "spotifyId": "3zokAF9n9Y03DAKT4T2Ugw",
      "appleId": 1000674846691,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3zokAF9n9Y03DAKT4T2Ugw",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-de-influencing-w-aleja-briles/id1752590866?i=1000674846691"
      }
    },
    {
      "id": "be65d205-d0f9-445e-b845-4ab5e1df2bfb",
      "title": "Pouting About LDS Adoption Scam w/ Kauri Taylor",
      "description": "In this week\u0027s episode of Pouty Mouth, I\u0027m thrilled to have Kari Taylor join us to share her deeply personal journey through adoption, Mormonism, and the challenges of infertility. Kari opens up about her complex family dynamics and the trauma of being adopted into a large family while navigating her racial identity in a predominantly white religious environment. We delve into her experiences of leaving Mormonism and the revelations that came with understanding her adoption story more fully. Kari\u0027s story is one of resilience and healing, as she discusses the impact of racial identity, the church\u0027s influence on her self-perception, and the journey to find her own path outside of the church. Join us for an eye-opening conversation about faith, family, and finding one\u0027s true self. Join the Discussion on Social Media: https://www.instagram.com/poutymouthpodcast/profilecard/?igsh=MXNrMG5ycXVtdWUxMw== https://www.tiktok.com/@taramherbert?_t=8qk34XnAW6B\u0026_r=1 https://www.tiktok.com/@samoancoconutgirl?_t=8qk33zzAj5L\u0026_r=1",
      "release": "2024-10-22T15:46:10Z",
      "duration": "01:39:00.1050000",
      "explicit": true,
      "spotifyId": "2mykP0FzcNOpXE5XHyCCJS",
      "appleId": 1000673995246,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2mykP0FzcNOpXE5XHyCCJS",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-lds-adoption-scam-w-kauri-taylor/id1752590866?i=1000673995246"
      }
    },
    {
      "id": "01556d5d-70de-42db-b533-9e925bb3470f",
      "title": "Pouting About Race and Religion w/Channel Achenbach",
      "description": "This week I\u0027m pouting with Chanel Achenbach about her experiences with Mormonism, including her conversion, the challenges of navigating her racial identity within the church, and the impact of church teachings on her self-perception. Chanel shares her journey of seeking truth, confronting racism, and ultimately finding her own identity outside of the church. Our conversation highlights the complexities of being a black woman in a predominantly white religious community and the importance of building a supportive community. If you\u0027d like to attend a Bridgerton themed ball, hosted by Channel you can check out the details byhttps://www.tiktok.com/@bettenoir4?_t=8qAVzmNuk87\u0026_r=1",
      "release": "2024-10-22T14:07:20Z",
      "duration": "01:11:10.7300000",
      "explicit": true,
      "spotifyId": "7CHE7oHlAjz9CbjTLP2frV",
      "appleId": 1000671406581,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7CHE7oHlAjz9CbjTLP2frV",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-race-and-religion-w-channel-achenbach/id1752590866?i=1000671406581"
      }
    },
    {
      "id": "ab38308f-2c1e-4491-b61c-f98335a3e634",
      "title": "Pouting About Connection",
      "description": "Send me a voicemail or note with your thoughts about today\u0027s episode! Follow me on social media: TikTok - @taramherbert IG - @poutymouthpodcast In today\u0027s episode I\u0027m pouting about the complexities of my relationships with my adoptive parents, mixed-faith marriage, and biological family. I talk about the emotional challenges of navigating these relationships and the desire for deeper connections, while also addressing the impact of my upbringing on my parenting style. 00:00 Introduction to the Pouty Mouth Podcast 02:16 Navigating Adoption and Mormonism 10:44 Family Dynamics and Mixed-Faith Relationships 18:54 Exploring Biological Family Connections 30:03 Parenting in a Mixed-Faith Marriage 42:54 Closing Thoughts and Future Directions",
      "release": "2024-09-24T09:25:00Z",
      "duration": "00:38:18.8450000",
      "explicit": true,
      "spotifyId": "3lCNcwi1Vlea0ZeBwz9hqE",
      "appleId": 1000670513309,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3lCNcwi1Vlea0ZeBwz9hqE",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-connection/id1752590866?i=1000670513309"
      }
    },
    {
      "id": "98959d8f-c39a-4cbf-8f2c-84e3ed884fc3",
      "title": "Pouting About Motherhood and Womanhood w/Brittany Hartley",
      "description": "Follow Brittany on social media @nononsensespirtuality Leave a ⁠ voicemail⁠ or a ⁠ note⁠ with your thoughts and we\u0027ll discuss on ⁠@poutymouthpodcast⁠ . Today I\u0027m talking with Brittany Hartley! We discuss the impact of adoption, and deconstructing Mormonism, me as an adoptee and Brittany as an adopted parent. We explore topics such as the trauma of adoption, the ethical considerations of adoption, the importance of cultural connection, and the challenges of racial identity. We also touch on the internalized racism and shame that can be perpetuated by religion, our experiences with motherhood and the existential crisis that can arise from losing all anchors in life. We explore the feelings of uncertainty and the void that can arise when leaving a religious community, as well as the impact of adoption on their sense of connection and bonding with their children. Overall, our conversation highlights the healing and growth that can come from embracing vulnerability and redefining one\u0027s own values and spirituality as women and mothers. 01:18 The Impact of Adoption on Children and Families 04:48 The Importance of Acknowledging Racial Identity in Adoption 09:08 The Role of Shame and Anxiety in the Context of Religion and Adoption 15:49 Nihilism and the Loss of Anchors in Life 34:48 The Void and the Path of Uncertainty 36:44 Rebuilding Anchors and Rituals 38:56 Making Peace with Death and Embracing Uncertainty 40:14 Taking Risks into Authenticity 41:35 The Gifts and Terrors of the Void 42:25 The Healing Power of Psilocybin Mushrooms 44:58 The Impact of Religion on Motherhood 46:44 Reframing Values and Rituals 49:00 Finding Safety in Science and Authenticity 51:45 Creating Family Culture and Rituals 52:12 Respecting Individual Paths and Choices 53:30 Shifting from Leading to Holding Hands 55:34 Shadow Work in Motherhood57:21Leaving Gifts Behind 01:00:57 Defining Values and Creating Family Culture 01:02:44 The Gift of Imperfection 01:04:35 Maintaining Connection and Supporting Individual Paths",
      "release": "2024-09-11T02:18:56Z",
      "duration": "01:10:10.5900000",
      "explicit": true,
      "spotifyId": "5J4KxjIP86UkIFqZq8toai",
      "appleId": 1000669093357,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5J4KxjIP86UkIFqZq8toai",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-motherhood-and-womanhood-w-brittany-hartley/id1752590866?i=1000669093357"
      }
    },
    {
      "id": "238251c8-0cb9-4493-a811-1559269a758d",
      "title": "Pouting About LDS Family Services pt 1",
      "description": "Link to article from today\u0027s episode What are your thoughts on this episode? Leave me a voice message Write and anonymous message Join the discussion: Follow @poutymouth on Instagram Follow @taramherbert on tiktok Today we\u0027re pouting about adoption in the United States, and how LDS family services has shaped it. I get into how adoption legally works like, the loss of rights and access to biological family, immediate maternal separation, and the lack of consideration for biological fathers. I talk about the impact of adoption on mental health, the concept of the adoption fog, and the role of Mormonism in shaping my adoption experience. I emphasize the need for reform in the adoption system and challenges the notion that adoption is a solution to infertility and abortion. 01:29 Understanding Adoption in the United States 08:12 The Impact of Adoption on Mental Health 13:52 The Adoption Fog: Fear, Obligation, and Guilt 15:46 Mormon Teachings About Adoption 37:36 The Role of LDS Social Services in Adoption 43:27 Coercion and Unethical Practices in Adoption 45:23 The Changing Landscape of Adoption 53:33 The Need for Reform in the Adoption Industry",
      "release": "2024-09-03T11:00:00Z",
      "duration": "01:02:30.6720000",
      "explicit": true,
      "spotifyId": "4xnEWs6kdTf7nLkEZkQz1S",
      "appleId": 1000668156210,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xnEWs6kdTf7nLkEZkQz1S",
        "apple": "https://podcasts.apple.com/podcast/pouting-about-lds-family-services-pt-1/id1752590866?i=1000668156210"
      }
    },
    {
      "id": "487cd121-747c-4439-921b-b87e470403c4",
      "title": "The One About Navigating Identity as an Adoptee w/Marisa Cannon",
      "description": "TW: Self Harm, Sexual Assault Follow Marisa on Instagram @marisamaecannon Leave your thoughts in a voicemail Share your thoughts from this episode Today I\u0027m joined by Marissa Cannon, the 2023 Miss Bikini USA, she shares her story of being an adoptee and an ex-Mormon. She discusses her childhood in Arizona and the strict Mormon upbringing she experienced. Marissa talks about the challenges she faced in Utah, including the lack of racial diversity and the strict rules imposed by her parents. She also opens up about the bullying she endured and the impact it had on her self-confidence, particularly regarding her natural hair. Marissa reflects on the missed opportunities and restrictions she faced due to her parents\u0027 strictness, but also acknowledges that it may have kept her from engaging in certain negative behaviors. She also discusses her journey with bipolar disorder and the importance of seeking help for mental health issues. She discusses the challenges she faced, including ADHD, anxiety, and self-harm, as well as the trauma she experienced from being assaulted by her grandfather. 00:00 Introduction and Accomplishments 01:25 Childhood and Adoption 04:15 Growing Up in a Strict Mormon Household 07:01 Challenges of Racial Diversity 10:48 Cultural Shock and Switching Schools 14:06 Navigating Dating and Reactions to Race 20:12 Lack of Education on Adoption and Race 26:52 Self-Confidence and Hair Struggles 32:04 Missed Opportunities and Restrictions 37:14 Journey with Bipolar Disorder 00:32 Growing up as an adopted child in a Mormon family 10:48 Challenges faced: ADHD, anxiety, and self-harm 20:12 Trauma from assault and the impact on mental health 30:38 Discovering birth family and navigating relationships 40:36 Creating inclusive environments for transracial adoptees 49:54 Importance of accessing medical history 59:57 Supporting adoptees: financial assistance and amplifying voices 01:10:08 Leaving Mormonism and reclaiming identity 01:20:12 Final Thoughts",
      "release": "2024-08-27T11:15:00Z",
      "duration": "01:19:05.8330000",
      "explicit": true,
      "spotifyId": "3juGlSZt0g3g7SWdmnefBw",
      "appleId": 1000666776756,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3juGlSZt0g3g7SWdmnefBw",
        "apple": "https://podcasts.apple.com/podcast/the-one-about-navigating-identity-as-an-adoptee-w/id1752590866?i=1000666776756"
      }
    },
    {
      "id": "474523bb-441b-466d-bba9-ef7068b2a857",
      "title": "The One About Mormon Influencer Drama",
      "description": "Leave me a voicemail with your thoughts Leave me a note with your thoughts Follow @poutymouth on Instagram Follow me @taramherbert on TikTok I discuss the online drama surrounding the Ballerina Farm and the secret lives of Mormon wives. I share my thoughts on the controversial article about the Ballerina Farm and the patriarchal dynamics within Mormonism. I also talk about the marketing of Mormon influencers and the reduction of women to their traditional roles. I get into the drama surrounding the show \u0027The Secret Lives of Mormon Wives\u0027 and the reactions from the Mormon community, my excitement and support for my close friend, Whitney Levitt, who is a cast member on the show. The conversation also delves into the experiences of the cast members, including their relationships, adoption, and career choices. I host share personal anecdotes and reflections on Mormonism and the challenges faced by Mormon and ex-Mormon women. 00:00 The Online Drama of the Ballerina Farm 02:01 Exploring the Patriarchal Dynamics within Mormonism 07:16 The Marketing Strategies of Mormon Influencers 27:39 Drama Surrounding \u0027The Secret Lives of Mormon Wives\u0027 and Backlash 33:28 Representation of Mormonism and Community Reactions 41:31 Cast Members\u0027 Experiences: Relationships, Adoption, and Careers 45:19 Personal Reflections on Mormonism and Challenges Faced by Women",
      "release": "2024-08-20T11:15:00Z",
      "duration": "00:49:47.7340000",
      "explicit": true,
      "spotifyId": "3wN12cAy1TvW8wWivKQNQD",
      "appleId": 1000665995527,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3wN12cAy1TvW8wWivKQNQD",
        "apple": "https://podcasts.apple.com/podcast/the-one-about-mormon-influencer-drama/id1752590866?i=1000665995527"
      }
    },
    {
      "id": "fc237e02-1230-4e83-aa2a-260308159813",
      "title": "The One About Adoption Misconceptions",
      "description": "Leave me a voicemail with your thoughts on this episode - https://www.speakpipe.com/poutymouth Link to Girls Camp Episode - https://podcasts.apple.com/us/podcast/girlscamp/id1667706991?i=1000663198253 In this episode I address some of the comments and misconceptions surrounding adoption. I discuss the trauma of adoption, the complexities of adoptee experiences, and the need for reform in the adoption system. I share my feelings about being adopted and the challenges of forming attachments with my biological family. The challenges and sacrifices that adoptees and their families make, as well as the misconceptions and stereotypes surrounding adoption. I also want to emphasize the importance of compassion and understanding when discussing adoption and encourage an open dialogue and support for adoptees and their families. 00:00 Introduction and Addressing Comments 03:02 The Trauma and Complexities of Adoption 06:17 The Need for Adoption Reform 10:23 Challenges of Forming Attachments with Biological Family 32:53 The Complexities of Adoption 43:24 Navigating the Challenges of Leaving Mormonism 56:19 Breaking Down Stereotypes and Misconceptions 01:03:19 Fostering Compassion and Understanding in Adoption 01:04:46 Creating a Supportive Space for Adoptees and Families",
      "release": "2024-08-06T10:00:00Z",
      "duration": "00:56:06.8460000",
      "explicit": true,
      "spotifyId": "0OfhuzO8U6B6vVwcBncmyM",
      "appleId": 1000664468312,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0OfhuzO8U6B6vVwcBncmyM",
        "apple": "https://podcasts.apple.com/podcast/the-one-about-adoption-misconceptions/id1752590866?i=1000664468312"
      }
    },
    {
      "id": "57c07a5e-02b0-435b-aa4c-72ccbffd4b5d",
      "title": "The One About Adopted Sisters",
      "description": "TIGGER WARNING - talk of suicide If you or someone you know is struggling with mental health or substance abuse you can call the SAMHSA national hotline at (1-800) 662-4357 to find treatment near you. Looking for a therapist in your area that accepts your insurance? Search Headway.co , Psychology Today or ZocDoc . Today I\u0027m having a conversation with my sister Kailie and we discuss our different experiences growing up in the same adopted family. We talk about Kailie\u0027s adoption story, her challenges of being biracial, our experiences with Mormonism, and struggles with depression. We also touch on the erasure of our biological identities and the need for support for birth parents. Overall, the conversation highlights the complexities of adoption and the impact it can have on an individual\u0027s sense of self. We talk a lot about mental health and offer advice to adoptees and adoptive parents, emphasizing the importance of therapy, communication, and understanding. 03:06 Navigating Identity: Growing Up in an Adopted Family 06:02 The Challenges of Being Biracial 08:51 The Impact of Mormonism on Mental Health 12:04 The Erasure of Biological Identities in Adoption 15:10 The Need for Support for Birth Parents 29:32 Navigating Mental Health and Self-Discovery 45:39 The Complexities of Adoption 55:01 Therapy, Communication, and Compassion 57:14 Breaking Free from Religious Beliefs",
      "release": "2024-07-30T12:00:00Z",
      "duration": "01:00:00.7410000",
      "explicit": true,
      "spotifyId": "4xe914PxRlCWg0CgiA1Nt4",
      "appleId": 1000663793635,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4xe914PxRlCWg0CgiA1Nt4",
        "apple": "https://podcasts.apple.com/podcast/the-one-about-adopted-sisters/id1752590866?i=1000663793635"
      }
    },
    {
      "id": "331b2f5b-e8f3-4497-b2fe-0667fa12114a",
      "title": "The One About Gay Stuff",
      "description": "In this conversation, Dean and I discuss experiences and the challenges of being LGBTQ\u0026#43; in a religious community. We explore topics such as allyship, coming out, and the intersection of religion and sexuality. Dean shares his personal journey of coming out to his parents and the mixed reactions he received. We also touch on the lack of comprehensive sex education in our upbringing and the impact it had on our understanding of our own sexuality. Links to things we discussed: Black Menaces PrEP 01:11 Exploring Questions of Allyship and Coming Out 14:15 Challenging Cultural Norms in Utah 22:49 Discovering Sexuality and the Lack of Sex Education 25:50 The Impact of Inadequate Sex Education 29:42 Stigma and Anxiety Surrounding HIV 33:41 Double Standards in Relationships 42:37 The Milestone of Legalizing Gay Marriage 47:11 Concerns about Regression in LGBTQ\u0026#43; Rights 49:56 The Challenges Faced by Queer Students at BYU 50:43 The Impact of BYU\u0027s Policies on LGBTQ\u0026#43; Individuals 55:22 The Privilege of Not Having to Think About LGBTQ\u0026#43; Issues 01:02:05 Understanding PrEP and Its Relevance to the LGBTQ\u0026#43; Community",
      "release": "2024-07-23T12:00:00Z",
      "duration": "01:10:36.4570000",
      "explicit": true,
      "spotifyId": "31yxv1oLJxvajE4PhP0X6S",
      "appleId": 1000663086242,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/31yxv1oLJxvajE4PhP0X6S",
        "apple": "https://podcasts.apple.com/podcast/the-one-about-gay-stuff/id1752590866?i=1000663086242"
      }
    },
    {
      "id": "c62f21d6-168e-4f2f-ac53-1fde3a62f3f3",
      "title": "The Line Between Insanity and Religion",
      "description": "Welcome to the first episode of Pouty Mouth! I\u0027m your host Tara Herbert. In this episode I talk about my journey out of Mormonism, and explain who this podcast is primarily for, ex-Mormon and ex-evangelical women who are trying to find a life that feels less controlling. I caution active Mormons that the podcast may not be for them. I also explore the possible reasons why young women are leaving organized religion, including issues of sexism and limited individuality. I want to create a space for discussing adoption and race within Mormonism, as well as spirituality and leaving Mormonism. Follow me on IG: @poutymouthpodcast Share your thoughts and comments on the episodes ! Mormon Stories Part 1 Mormon Stories Part 2 Thats Church! Part 1 Thats Church! Part 2",
      "release": "2024-07-02T04:00:00Z",
      "duration": "00:37:23.3950000",
      "explicit": true,
      "spotifyId": "5xVbfjO2RfC7IHmJ9TViF4",
      "appleId": 1000660869009,
      "subjects": [
        "The Church Of Jesus Christ Of Latter-Day Saints",
        "Evangelicalism"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5xVbfjO2RfC7IHmJ9TViF4",
        "apple": "https://podcasts.apple.com/podcast/the-line-between-insanity-and-religion/id1752590866?i=1000660869009"
      }
    }
  ]
}