{
  "_ts": 0,
  "id": "2ec669fe-0d48-4486-8b6b-60dbfbb9ba39",
  "name": "Pretty Furious",
  "spotifyId": "6JGUoF8GATMzow8Ip6KxTS",
  "appleId": 1803949583,
  "episodes": [
    {
      "id": "2d452a7e-c048-4b4b-8ae8-b0784a319fea",
      "title": "Tia Levings: Pretty Furious about the Trad Wife Phenomenon",
      "description": "Tia Levings, author of \u0027A Well-Trained Wife\u0027, joins Mallory Hagan and Maggie Gehlsen-Burnett to talk about the intersections of Christian nationalism, the Tradwife movement, and the impact of religious trauma on women\u0027s rights, and personal autonomy. They explore the importance of education, visibility in activism, and the journey of healing from oppressive systems. Tia shares her personal experiences and insights on reclaiming individuality, the role of therapy, and the dangers of purity culture, while emphasizing the need for women to support each other in navigating these challenges. Chapters 00:00 Introduction to the Controversial Headline 13:53 The Impact of Christian Fundamentalism on Society 16:13 Understanding the Rise of Christian Nationalism 19:08 The Role of Women in Fundamentalist Ideologies 21:44 The Dangers of Abandoning Intuition 24:39 The Importance of Education in Dismantling Control 27:39 Therapy and Healing from Religious Trauma 30:00 The Future of Women\u0027s Rights and Education 37:53 Reclaiming Personhood and Self-Discovery 40:59 The Impact of Purity Culture on Women 44:42 Navigating Body Image and Patriarchy 48:15 Spirituality and Personal Beliefs 52:10 Empowering Women in High-Control Environments 56:57 Beauty, Self-Expression, and Personal Growth *This episode was recorded on July 2, 2025, and aired on July 7, 2025. Pretty Furious Pod is hosted by Maggie Gehlsen-Burnett and Mallory Hagan. Our mission is to validate the female experience, challenge societal norms, and drive conversation about newsworthy topics plaguing the modern woman’s world. Through impactful conversations and humor, we aim to inspire our audience to use the most powerful force in the world to drive meaningful change: their anger. Follow us or send guest/topic suggestions @PrettyFuriousPod on TikTok, Instagram, Substack, and YouTube. Visit our website at www.PrettyFurious.com. _______________________________________ This Week’s Product Mentions: Morphe Lip Liner L\u0027Oréal Lumi Liquid Blush DRMTLGY Skin Tint * Follow us on Instagram * Follow us on TikTok * Follow us on Substack * Subscribe on YouTube * Spotify * Apple Podcasts This is a public episode. If you would like to discuss this with other subscribers or get access to bonus episodes, visit prettyfuriouspod.substack.com",
      "release": "2025-07-07T10:58:00Z",
      "duration": "01:01:04.2410000",
      "explicit": false,
      "spotifyId": "1I6zMFoRqiKyr7CFX7xxy6",
      "appleId": 1000716170518,
      "subjects": [
        "Institute In Basic Life Principles",
        "Quiverfull"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/1I6zMFoRqiKyr7CFX7xxy6",
        "apple": "https://podcasts.apple.com/podcast/tia-levings-pretty-furious-about-the-trad-wife-phenomenon/id1803949583?i=1000716170518"
      }
    }
  ]
}