{
  "_ts": 0,
  "id": "80699243-26c9-410f-8615-6fb5949b114f",
  "name": "PRETEND",
  "spotifyId": "2vaCjR7UvlN9aTIzW6kNCo",
  "appleId": 1245307962,
  "episodes": [
    {
      "id": "7d9cf389-76cc-426a-a9f6-9c5b3393c100",
      "title": "2005: The Telepathy Tapes B-side part 3",
      "description": "Facilitated Communication is marketed as a miraculous tool for non-speaking autistic children. But what happens when this controversial method leads to devastating consequences? In this episode, we hear from Kevin Plantin, a father who was falsely accused of assault based solely on messages typed with the help of a facilitator. Despite the evidence, some courts and institutions still give FC credibility—with tragic consequences. In this episode, Kevin Plantin recounts how a letter typed via FC led to his wrongful imprisonment for 10 months on charges of sexual assault. We also revisit the story of Janyce Boynton, a former FC facilitator who now warns against the practice after witnessing its harmful effects firsthand. Featured guests in this episode: Kevin Plantin: Sharing his personal story of wrongful imprisonment. Janyce Boynton: Former FC facilitator and advocate against the practice. Additional Resources: Learn more about Facilitated Communication: https://www.facilitatedcommunication.org/ Read about Syracuse University\u0027s involvement with FC: https://dailyorange.com/2024/02/mixed-messages-how-facilitated-communication-persists-at-su/ Prisoners of Silence documentary: https://www.youtube.com/watch?v=OMn_sDCFAuI Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-02-11T08:00:00Z",
      "duration": "00:36:44.0550000",
      "explicit": true,
      "spotifyId": "1fVDE7r8jsU2NYw3RIwK2z",
      "appleId": 1000690831800,
      "urls": {
        "spotify": "https://open.spotify.com/episode/1fVDE7r8jsU2NYw3RIwK2z",
        "apple": "https://podcasts.apple.com/podcast/the-telepathy-tapes-b-side-part-3/id1245307962?i=1000690831800"
      }
    },
    {
      "id": "ad12a7cb-50d8-483b-8042-94e4d631d1f7",
      "title": "2004: The Telepathy Tapes B-Side part 2",
      "description": "A mother kills her autistic son. Why? Because he asked her to. The mother claims he used facilitated communication to ask her to help him die. This case is just one of many tied to the controversial method that claims to give a voice to non-speaking autistic individuals. But what if the voice wasn’t theirs at all? Share Your Thoughts: Have you listened to The Telepathy Tapes? What do you think about the claims it makes? We want to hear from you! Send a voice memo with your thoughts to javier@pretendradio.org, and your message might be featured in an upcoming episode. Resources Mentioned: ➜ Learn more about Amy Lutz’s work and her book Chasing the Intact Mind. https://amzn.to/4gg9Mbe ➜ Read Zaid Jilani’s articles on Facilitated Communication and The Telepathy Tapes on his Substack, The American Saga. https://www.theamericansaga.com/ ➜ Explore the history of Facilitated Communication in the documentary Tell Them You Love Me (available on U.S. Netflix). https://www.netflix.com/title/81783064 Stay Connected: Follow PRETEND on social media and subscribe to the podcast for more stories exploring deception and the human condition. ➜ BlueSky: https://bsky.app/profile/pretendpod.bsky.social ➜ Instagram: https://www.instagram.com/pretendpod/ ➜ TikTok: https://www.tiktok.com/@pretendpod ➜ YouTube: https://www.youtube.com/@pretendpod Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-02-04T08:00:00Z",
      "duration": "00:47:46.8860000",
      "explicit": false,
      "spotifyId": "5HL0P3fMcj29PSugdbdFf7",
      "appleId": 1000687151994,
      "urls": {
        "spotify": "https://open.spotify.com/episode/5HL0P3fMcj29PSugdbdFf7",
        "apple": "https://podcasts.apple.com/podcast/the-telepathy-tapes-b-side-part-2/id1245307962?i=1000687151994"
      }
    },
    {
      "id": "4e1820fc-9f21-4e50-9685-c570fbb0f36e",
      "title": "2003: The Telepathy Tapes B-Side part 1",
      "description": "The Telepathy Tapes podcast shot to the top of the charts, making bold claims about telepathic abilities in non-verbal autistic children. But are the claims rooted in science—or something else entirely? In this episode of PRETEND, we take a closer look at the phenomenon, the controversies, and the skepticism surrounding these extraordinary claims. We’ll discuss: ➜ The premise of The Telepathy Tapes and the experiments it presents. ➜ Scientific skepticism surrounding telepathy claims. ➜ Ethical concerns, including the history of Facilitated Communication and its controversies. ➜ Voices from parents, experts, and critics, including Zaid Jilani and Amy Lutz. Resources Mentioned: Learn more about Amy Lutz’s work and her book Chasing the Intact Mind. https://amzn.to/4gg9Mbe Read Zaid Jilani’s articles on Facilitated Communication and The Telepathy Tapes on his Substack, The American Saga. https://www.theamericansaga.com/ Explore the history of Facilitated Communication in the documentary Tell Them You Love Me (available on U.S. Netflix). https://www.netflix.com/title/81783064 Share Your Thoughts: Have you listened to The Telepathy Tapes? What do you think about the claims it makes? We want to hear from you! Send a voice memo with your thoughts to javier@pretendradio.org, and your message might be featured in an upcoming episode. Stay Connected: Follow PRETEND on social media and subscribe to the podcast for more stories exploring deception and the human condition. ➜ BlueSky: https://bsky.app/profile/pretendpod.bsky.social ➜ Instagram: https://www.instagram.com/pretendpod/ ➜ TikTok: https://www.tiktok.com/@pretendpod ➜ YouTube: https://www.youtube.com/@pretendpod Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2025-01-28T08:00:00Z",
      "duration": "00:44:52.0750000",
      "explicit": false,
      "spotifyId": "6mse1jaGSR9nJyT4z51c7g",
      "appleId": 1000685763817,
      "urls": {
        "spotify": "https://open.spotify.com/episode/6mse1jaGSR9nJyT4z51c7g",
        "apple": "https://podcasts.apple.com/podcast/the-telepathy-tapes-b-side-part-1/id1245307962?i=1000685763817"
      }
    },
    {
      "id": "7bd40ca2-2818-41f0-af56-0fb36dffc90f",
      "title": "S905: The Business of Cults part 3",
      "description": "Rebekah Sebastian and Javier Leiva visit businesses run by cults. Also, what happens when a cult leader dies or goes to prison? Can the cult go on without its leader? Find out which cults are trying to continue the organization without any clear leadership. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-02-22T00:00:00",
      "duration": "00:58:14.3470000",
      "explicit": true,
      "spotifyId": "4Zo4TbO6HLv1xZ0fbNzrCs",
      "urls": {
        "spotify": "https://open.spotify.com/episode/4Zo4TbO6HLv1xZ0fbNzrCs"
      }
    },
    {
      "id": "022f5055-7b20-454c-bb4d-99a89212f2e0",
      "title": "S904: The Business of Cults part 2",
      "description": "Cults are businesses too. Like any company, cults recruit, have middle management, and some even have succession plans. Many of these religious sects are tax-exempt. Like Scientology, even some fringe religions are recognized by the Internal Revenue Service. Not all cults are religious. At first glance, some cults don\u0027t seem culty at all. For example, take a closer look at businesses such as multi-level marketing companies. These companies are masquerading as a business, but in reality, they\u0027re run by narcissistic ego-maniacs. The Cult Startup Like businesses, cults go through different phases. First, there\u0027s a startup phase where an entrepreneurial cult leader leads a movement and brings new innovative and revolutionary ideas. Take, for example, Jim Jones , leader of the People\u0027s Temple. In the beginning, he integrated his congregation during the Civil Rights Movement. After that, he was heavily involved in politics and social activism. The allure was undeniable. But in the end, Jones ordered 909 commune members to end their lives. The Cult Franchise Then, there comes the point where the cult needs to expand its Business and influence. Take, for example, The Twelve Tribes religious sect. This organization, widely considered a cult, operates several businesses worldwide. I visited one of their Yellow Deli restaurants for the second installment of this series. The Cult Exit Strategy If you\u0027re not evolving, you\u0027re dying. And sometimes, literally dying. So, what happens when a cult becomes too big to fail? Some morally bankrupt cult leaders resort to mass suicide. Other cults grow so big and fast that they become worldwide institutional organizations. The Business of Cults The Business of Cults is a three-part series hosted by Rebekah Sebastian with the DIELAOGUE Podcast and Javier Leiva of PRETEND podcast . Part one focuses on The C Suite: Chief Cult Executives. Part two features an interview with former NXIVM member Sarah Edmondson. And Part three explores the question, can a cult survive without its leader? Listen to part two now on Patreon. Buy the t-shirt for this week\u0027s episode. Collage art by @kelletteworks https://pretend-radio-3.creator-spring.com/ Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-02-14T00:00:00",
      "duration": "00:43:41.5700000",
      "explicit": true,
      "spotifyId": "3M77XsF7OwYL3zyq22Qtkh",
      "subjects": [
        "NXIVM",
        "Twelve Tribes",
        "Multi-Level Marketing",
        "Peoples Temple",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3M77XsF7OwYL3zyq22Qtkh"
      }
    },
    {
      "id": "b0759d5b-08eb-449a-9aa9-4a60552dd6e1",
      "title": "S903: The Business of Cults part 1",
      "description": "Cults are businesses too. Like any company, cults recruit, have middle management, and some even have succession plans. Many of these religious sects are tax-exempt. Like Scientology, even some fringe religions are recognized by the Internal Revenue Service. Not all cults are religious. At first glance, some cults don\u0027t seem culty at all. For example, take a closer look at businesses such as multi-level marketing companies. These companies are masquerading as a business, but in reality, they\u0027re run by narcissistic ego-maniacs. The Cult Startup Like businesses, cults go through different phases. First, there\u0027s a startup phase where an entrepreneurial cult leader leads a movement and brings new innovative and revolutionary ideas. Take, for example, Jim Jones , leader of the People\u0027s Temple. In the beginning, he integrated his congregation during the Civil Rights Movement. After that, he was heavily involved in politics and social activism. The allure was undeniable. But in the end, Jones ordered 909 commune members to end their lives. The Cult Franchise Then, there comes the point where the cult needs to expand its Business and influence. Take, for example, The Twelve Tribes religious sect. This organization, widely considered a cult, operates several businesses worldwide. I visited one of their Yellow Deli restaurants for the second installment of this series. The Cult Exit Strategy If you\u0027re not evolving, you\u0027re dying. And sometimes, literally dying. So, what happens when a cult becomes too big to fail? Some morally bankrupt cult leaders resort to mass suicide. Other cults grow so big and fast that they become worldwide institutional organizations. The Business of Cults The Business of Cults is a three-part series hosted by Rebekah Sebastian with the DIELAOGUE Podcast and Javier Leiva of PRETEND podcast . Part one focuses on The C Suite: Chief Cult Executives. Part two features an interview with former NXIVM member Sarah Edmondson. And Part three explores the question, can a cult survive without its leader? Listen to part two now on Patreon. Buy the t-shirt for this week\u0027s episode. Collage art by @kelletteworks https://pretend-radio-3.creator-spring.com/ Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2022-02-08T00:00:00",
      "duration": "00:38:44.8970000",
      "explicit": true,
      "spotifyId": "4LqaIQHc9Dzac3XJCXxmm9",
      "subjects": [
        "NXIVM",
        "Twelve Tribes",
        "Multi-Level Marketing",
        "Peoples Temple",
        "Scientology"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4LqaIQHc9Dzac3XJCXxmm9"
      }
    },
    {
      "id": "bbb3bdf9-9259-46ee-8378-0a4c1190f105",
      "title": "S705: The Word of Faith Fellowship Update",
      "description": "If you haven\u0027t listened to The Prophet series, start here: http://pretendradio.org/the-prophet-word-of-faith-fellowship-revisited/ When I first started this podcast, I reported on a secretive church located in the foothills in western North Carolina called the Word of Faith Fellowship. The church is accused of being a cult and separating families—forcing them to break ties with non-believers. One teenager named Matthew Fenner pressed charges against five church ministers because he said they beat the gay demons out of him. And that\u0027s just the beginning. Several former members reported being forced into isolation in what is known as the lower building. Some male congregants say they lived in this makeshift storage unit for over a year. But perhaps they\u0027re best remembered for their signature style of prayer. It\u0027s known as blasting. As you can hear in this secret audio recording, blasting is a form of deliverance meant to cast out the devil. It has been said that crying babies were often held down and yelled at until the devil released its grip on the child. I\u0027ve experienced blasting first hand. In 2018, I was personally invited by the church\u0027s leader, Jane Whaley, to spend the day at the Word of Faith Fellowship. While interviewing her in her office, Jane Whaley looked me straight in the eyes, opened her mouth, and began shouting. It was terrifying. To this day, I still get chills. It\u0027s been 2 years since I finished my 11-part series on the Word of Faith. Since then, I\u0027ve been flooded with emails asking me to give them an update. They want to know, have there been any new allegations of abuse? Have any of the church leaders faced any criminal charges? Is Jane Whaley still running the church? Today, I plan to answer some of these questions. ______ Story idea? If you have a story to share, email Javier at javier@pretendradio.org. For more episodes like this, visit pretendradio.org. To get early releases and bonus episodes, go to pretendradio.org/donate Today\u0027s episode was written by Javier Leiva and edited by Logan Castrodale Reference: Covid-19 Timelines: https://en.wikipedia.org/wiki/Timeline_of_the_COVID-19_pandemic_in_the_United_States_(2020) https://ourworldindata.org/coronavirus Threats against Word of Faith church over coronavirus rumor https://www.charlotteobserver.com/article242307531.html Word of Faith church in NC received a PPP loan amid COVID https://www.charlotteobserver.com/living/religion/article244084852.html Lotz International LLC v. Burnette: https://www.courtlistener.com/docket/17404523/lotz-international-llc-v-burnette/ Case against Facebook commenters moves to state court: https://www.shelbystar.com/story/special/2020/09/23/case-against-facebook-commenters-moves-to-state-court/43180133/ Former Word of Faith member charged with breaking into minister\u0027s home: https://wlos.com/news/local/former-world-of-faith-member-charged-with-breaking-into-ministers-home Word of Faith member reaches plea deal in fraud scam: https://wlos.com/news/local/word-of-faith-member-reaches-plea-deal-in-fraud-scam Trump March: https://youtu.be/yxUksEHZGag?t=350 Trump Rally: https://www.youtube.com/watch?v=G7VJtRZBy-M Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2021-03-02T00:00:00",
      "duration": "01:11:09.6350000",
      "explicit": true,
      "spotifyId": "7kMXARm032palpWs7pO6mz",
      "subjects": [
        "Kenneth E. Hagin",
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/7kMXARm032palpWs7pO6mz"
      }
    },
    {
      "id": "921473bc-fe64-4fd8-9303-c40047f571b8",
      "title": "S311: The Prophet – Matthew Fenner vs. the Word of Faith Fellowship Cult Part 2",
      "description": "Let’s say a man speaks to another man. Perhaps he looks at him for too long or laughs at his joke. That’s gay. Maybe you’re standing too close. It doesn’t matter. If I’m a Word of Faith fellowship member and I think you’re gay—then you’re gay. I don’t have to prove it–I know it. And I can’t let you suffer from those gay demons. I have to pray for you to release the gay spirits out of you. And the way we pray at the Word of Faith Fellowship is through loud prayers. And it’s not only me praying over you—Sussie, Bobby, and Roger will join in. Soon, you’ll have 20 to 30 people screaming at you. And like Jane says, “people can get carried away.” So, it’s easy to imagine this prayer becoming more than a loud scream. I might hold on to your shoulders and give you a gentle tug. Then, I might punch you in the chest. Maybe my hands creep further up, and before I realize it, I’m wrapping my fingers around your neck. This hypothetical scenario I painted for you is exactly what Matthew Fenner says happened to him. Release the gay demons Tonight, it’s Matthew Fenner’s turn to receive an exorcism. Church ministers are praying over him. They’re trying to release the devil’s grip over his homosexual desires. Danielle Cordes was there the night. She says Brooke Covington, Jane’s so-called adopted daughter, was the one calling the shots. People who know Brooke’s style of worship say that she doesn’t have time to deal with your devils. So when it’s time to pray over you, it’s going to hurt. Brooke barks at Danielle and demands her to join in. “Brooke was the one coaching them through it,” explained Danielle. She says she too participated in the prayer. “I never slapped him or did any of that. I had my arm on him, but if I had like, I don’t know, I couldn’t do it. I just couldn’t do it.” The case against Brooke Covington and the Word of Faith Fellowship The night after the alleged attack, Matthew Fenner escaped the Word of Faith Fellowship. He went straight to the police and filed a report. Unfortunately for him, the authorities were only willing to file misdemeanor charges. It will take years for actual criminal charges to be filed. To give you an idea, this beating allegedly took place in January 2013. Matthew was 19 at the time. He’s 25 years old now. That’s almost 5 years and there’s still no resolution to this case. What happens next? This is the final installment of season 3 The Prophet. This might be the last episode of this series, but the story is far from over. To keep up with this story, follow John Huddle’s blog religiouscultinfo.com and Citizens against corruption and abuse on Facebook . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-12-04T00:00:00",
      "duration": "00:35:57.8710000",
      "explicit": false,
      "spotifyId": "6aITCMudcsHwcVDncLmjcv",
      "subjects": [
        "Kenneth E. Hagin",
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6aITCMudcsHwcVDncLmjcv"
      }
    },
    {
      "id": "06548062-fb78-4f25-ac94-6e18e7a763c0",
      "title": "S310: The Prophet – Matthew Fenner vs. the Word of Faith Fellowship Cult Part 1",
      "description": "Jane Whaley recently turned 80-years-old. Obviously, the Word of Faith Fellowship can’t go on forever. At least not the way we know of it today. So, who’s taking over? Can it go on without Jane Whaley’s vision and authority? Or will it all just fall apart? John Huddle, a former member, says that Jane’s biological daughter Robin Webster is believed to take over the church. But he suspects that, when Jane Whaley dies, there will be a power struggle within the church.The case against the Word of Faith Fellowship We’ll talk more about this alleged attack in the next episode. Today, we’re going to focus on how we got to this point. Before Brooke Covington was charged with kidnapping and beating Matthew Fenner, she was actually the person who recruited him into the church. How did she go from being his spiritual leader, to being charged with beating him? In order to understand the case against Brooke Covington and the Word of Faith Fellowship ministries, you first understand how Matthew Fenner joined the church. Cults recruit the vulnerable The biggest questions I get all the time is, how do people get sucked into a cult. Everyone says that they would never fall for it, so how did Matthew and his family become one of them? Before Matthew Fenner joined the Word of Faith Fellowship, he thought they were freaks. He heard rumors of the demonic possessions and members vomiting in buckets to evil spirits. Let’s just say that he wasn’t exactly a perfect candidate. And on top of that, Matthew was openly gay and considered himself an atheist. So, how does someone like him get sucked into a ultra conservative Christian cult? The Word of Faith Fellowship found Matthew Fenner, and his family, when there were at their lowest point. Matthew’s family rejected his sexuality, his mother was in a bad marriage, and they were running out of money. These were desperate times. Matthew attended his first service in February 2010. During this time he had friends, was a member of a dance troupe, and attended public school. By December of that same year, he cut ties with everyone he knew, quit dance, and enrolled in the church’s private school. How did it happen? How can someone go from gay atheist to a god-fearing cult member? Matthew Fenner describes his journey into the Word of Faith Fellowship. Listen to episode 10 of the Prophet on Apple podcast , Google Play , Spotify , or Stitcher . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-11-27T00:00:00",
      "duration": "00:29:50.5110000",
      "explicit": false,
      "spotifyId": "4fjKN4oR9vZHuZxVu4cnse",
      "subjects": [
        "Kenneth E. Hagin",
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4fjKN4oR9vZHuZxVu4cnse"
      }
    },
    {
      "id": "d3915216-2721-4d4d-87f6-67c4dc9d3b0d",
      "title": "S309: The Prophet – Inside the Mind of Cult Leader Jane Whaley",
      "description": "Christina Bryant is about to go face-to-face with the real Jane Whaley. In my previous episode, I got to see the political side of Jane—the Jane she wanted the world to meet. Christina, on the other hand, is about to talk with the real Jane Whaley—the one everyone fears. And she got it all on tape. Christina Bryant went undercover inside the Word of Faith Fellowship. She’s wearing a hidden microphone. It’s been 6 years since she last step foot in the church. You see, Christina is a former member who has been excommunicated and is forbidden to contact her family. If she ever wants to ever speak with them again, she has to go through Jane Whaley first. This 3-hour recording is completely engrossing. However, there are certain parts of this tape that brings up interesting legal questions regarding child abuse. Jane flat out says she’s not required by law to report sexual abuse because of pastor confidentiality. Is this true? How can this be true? Jane also claims if a child has bruising, the NC Department of Social Services doesn’t consider that abuse. Reporting Child Abuse and Neglect in North Carolina I reached out to my friend Rabia Chaudry from the Undisclosed Podcast for help. She put me in touch with her co-host Colin Miller , to walk me through what Jane says and how it applies to North Carolina law. I have to say, I’m shocked. I also spoke with NC licensed attorney Paul Ditz . He’s one of the few attorney’s to have ever questioned Jane Whaley on the stand. He tells me that just because DSS allows minor bruising and Jane is protected by penitent privilege, doesn’t mean that she’s not responsible. Take a deep breath because you’re about to go inside the mind of Jane Whaley. Sources: NC Article 7 – Competency of Witnesses Reporting Child Abuse and Neglect in North Carolina Parental Discipline: When Is It Abuse and/or a Crime? A\u0026E Documentary on the Word of Faith Fellowship titled “The Devil Next Door” postponed Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-11-20T00:00:00",
      "duration": "00:47:20.1110000",
      "explicit": false,
      "spotifyId": "6A93TRiKMTTuu8Ez0KYxnj",
      "subjects": [
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6A93TRiKMTTuu8Ez0KYxnj"
      }
    },
    {
      "id": "5c03c48c-445f-4489-afd2-13d65ef28767",
      "title": "S308: The Prophet - Meet Cult Leader Jane Whaley Part 3",
      "description": "The world first learned about the Word of Faith Fellowship after an Inside Edition exposé in 1995. The investigation, led by the Trinity Foundation, revealed accusations of abuse within the church. Watch the Inside Edition story: https://www.youtube.com/watch?v=YwE5fBT9RYE Jane Whaley\u0027s quiet little kingdom was suddenly in the spotlight. Hidden cameras captured Jane\u0027s signature screaming prayer. Church members told Inside Edition that they would strap children to chairs so they wouldn\u0027t run away. It was horrifying. After a brief press conference, Jane Whaley never spoke to the media on the record ever again. So why did she pick me as her first interview since 1995? I asked Jane, \u0022Why me?\u0022 She told me that God spoke to her after listening to my show. But why now? Jane says she wanted to contact me but said that she didn’t know how to reach me. During my visit, Sam Whaley told me that the closest they’ve come to talking to the media was when a BBC producer approached her about doing a story. She said he was very nice, just like me. But in the end, they decided it wasn’t right. Then, an A\u0026E documentary crew asked to interview Jane and bring cameras into the church. Jane flat out said no because they weren’t interested in the truth. Her lawyers told me that the TV crew and former members showed up unannounced to church member owned businesses and caused a spectacle. My interview with cult leader Jane Whaley of the Word of Faith Fellowship After the 3-hour service was over, Jane and I walked back to her office. Jane Whaley sat next to me. To my left sat her husband Sam Whaley. And across the room sat her two attorneys Mark Norris and Josh Farmer. Without ever even asking a question, Jane began to tell me about every controversial issue facing the church. She told me that she knows nothing about unemployment (Jane\u0027s referring to the recent the guilty pleas in the unemployment fraud cases .) When I asked her about the Brazilian slaves, she told me that some of the Brazilian\u0027s making these claims are entitled and lazy. During the meeting, Jane performed a blasting prayer for me. She also told me that she\u0027s gearing for a great confrontation and that they\u0027re ready for the end of times. National Domestic Violence Hotline I also want to take the time to thank the former members who have listened to the show and have written me emails, facebook messages about their experience at the Word of Faith Fellowship. It just reinforces that what I’m doing is important. Also, I know there are current members reading this right now. If you feel you’re in danger or just need someone to talk to, call the National Domestic Violence Hotline 1-800-799-7233. They’re available 24 hours a day, 7 days a week. They can help you find a place to stay near Spindale while you figure things out. Or you can contact the Citizens against corruption and abuse 828-289-7923. at area code Promos Southern Gothic Minds of Madness Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-11-14T00:00:00",
      "duration": "00:45:02.6020000",
      "explicit": true,
      "spotifyId": "5vI70pfRSpvgBaLBxZCI54",
      "subjects": [
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/5vI70pfRSpvgBaLBxZCI54"
      }
    },
    {
      "id": "ff47d375-d4f6-4f49-a875-59e5f7674440",
      "title": "S307: The Prophet - Meet Jane Whaley Part 2",
      "description": "Previously on Pretend Radio, I came face-to-face with pastor Jane Whaley of the Word of Faith Fellowship. When I arrived, we met in her office for a few minutes before the church service began. I was surprised by everyone\u0027s friendliness. Suddenly, the music started playing and we knew it was time to head into the main sanctuary. Jane Whaley held my hand as we walked down a long hallway towards the service. As we inched closer to the sanctuary, the music got louder and louder—it was ear drum busting loud. Jane and I walked in like rock stars. Her attorney escorted me to the second row behind Jane and her husband Sam Whaley. Word of Faith Fellowship sanctuary in Spindale, North Carolina Was the church service real or just a big show? The service started around 9:30am and ended around 12:30pm. It was a musical event filled with praise and worship. Old women were jumping up and down in their high heels, old men were singing as loud as they could, and the children appeared to be happy. Former members say that this is exactly what Jane Whaley wanted me to see. According to them, this service was tailored specifically for me. Bonus episode: Why did Paul McCartney\u0027s drummer join a cult? Joe English played drums with Paul McCartney and Wings. Today, he\u0027s a devoted member at the Word of Faith Fellowship church in Spindale, North Carolina. I met Joe English during my visit. Hear how Jane Whaley saved him from a life of drugs and rock n\u0027 roll. Listen to this exclusive Patreon episode . Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-11-07T00:00:00",
      "duration": "00:52:36.8710000",
      "explicit": true,
      "spotifyId": "2tRWby6YGqgkHG9CzmMAzb",
      "subjects": [
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2tRWby6YGqgkHG9CzmMAzb"
      }
    },
    {
      "id": "b93c51ed-0dc6-4a20-a671-b9ca9ff7aa1b",
      "title": "S306: The Prophet - Meet Cult Leader Jane Whaley Part 1",
      "description": "As far as I know, I\u0027m the first journalist who has ever interviewed pastor Jane Whaley. Heck, I might be the only member of the media to have attended church service. How was I able to pull this off? The short answer is, I have no idea. In fact, when the executive producer of the upcoming A\u0026E series on Word of Faith Fellowship found out about my exclusive interview, he gave me a call. He asked me, \u0022I just want to know one thing... how did you do it?\u0022 I told him, \u0022I just asked nicely?\u0022 (UPDATE: A\u0026E pulls the docu-series the night before it was scheduled to air ) My first contact with Jane Whaley The last people to get an invitation to the Word of Faith Fellowship got the cops called on them. However, that didn\u0027t stop me from contacting Jane. I have Jane Whaley\u0027s email address and intend to use it. Besides, what\u0027s the worst thing that could happen? Get arrested for trespassing? True Crime Podcast Festival | Chicago 2019 Also, I am excited to announce that Pretend Radio is going to be attending the first annual True Crime Podcast Festival on July 13, 2019 in Chicago! Trust me, start planning now. It’s worth traveling to. This is your chance to mingle with podcasters you listen to regularly. There will also be live episode recordings as well as panel discussions. In fact, I’m speaking in one of them. Some of the shows registered are All Crime No Cattle, Criminology, Canadian True Crime, Mugshot, Swindled, Sword and Scale, and so many more . You won’t want to miss this. Go to the website TCPF2019.com to find information on tickets and the hotel. Prices do go up the closer we get to the event so you won’t want to wait. When you buy your ticket, make sure you mention Pretend Radio on the ticket registration survey. This is going to be a blast. I can’t wait to meet everyone at the True Crime Podcast Festival! For more information, see the show notes. Many people have been writing me and sharing their stories. If you have a story to share, shoot me an email at info@pretendradio.org or follow me on Twitter , Facebook , and Instagram . Our theme music was composed by Joe Basile with thechicken.net. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-10-31T00:00:00",
      "duration": "00:31:37.9780000",
      "explicit": true,
      "spotifyId": "3gmw2SgQ57GkruRNcWUg40",
      "subjects": [
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3gmw2SgQ57GkruRNcWUg40"
      }
    },
    {
      "id": "cbc94cea-5b03-4620-9b0e-88667ed45f9c",
      "title": "S305: The Prophet - Brazil and the Word of Faith Cult",
      "description": "Did you know that the Word of Faith Fellowship has nearly 2,000 members internationally? They have affiliate churches all over the world including Brazil, Sweden, Scotland, and other countries. Brazil is by far the biggest territory ruled under Jane Whaley’s kingdom. They have churches in two southeastern Brazilian cities. The first church is in Soa Joaquim de Bicas which is about 6 hours north of Rio de Janeiro. They also have second church in Franco de Rocha which is an hour outside of Sao Paulo. Jane conquers Brazil and offers them salvation For a few lucky Brazilians, Jane blessed them with more than just salvation—an opportunity to live in the United States. Ana Albuquerque told the Associated Press that when she first arrived in Spindale, church members showered her with love. She said, \u0022The first time you go, they treat you well. But afterwards, they start treating you bad.” Ana says things turned ugly fast. She claims she worked full time as a teacher’s assistant and baby sat church member’s children at night–all without pay. Then the physical abuse started. Ana says that Jane and another minister spanked her with a wooden stick. She told the AP they blasted her with a screaming prayer because she was “unclean” and possessed by the devil. And we’re not talking a small tap on the butt kind of spank. Ana says the beatings lasted for at least 40 minutes. She finally was allowed to return to Brazil and has since left the church. 16 Brazilians come forward “It was a horror living there,” says Rebecca Mello. Her dreams of freedom quickly turned into a nightmare. She told the Associated Press that she was brought to the US in 2009 on a student visa. Immediately after she got here, church leaders took her passports and her money, and was quickly put to work. \u0022We’re made to get up early, make the kids breakfast, cook, do their beds, pick up the the laundry.” Thiago Silva says, \u0022We were there working, but we never got paid. If you’re not paid for something, even for your food, I would say that you’re a slave.\u0022 All in all, 16 Brazilian’s have come forward to share their personal story of abuse and enslavement. True Crime Podcast Festival | Chicago 2019 Also, I am excited to announce that Pretend Radio is going to be attending the first annual True Crime Podcast Festival on July 13, 2019 in Chicago! Trust me, start planning now. It’s worth traveling to. This is your chance to mingle with podcasters you listen to regularly. There will also be live episode recordings as well as panel discussions. In fact, I’m speaking in one of them. Go to the website TCPF2019.com to find information on tickets and the hotel. Many people have been writing me and sharing their stories. If you have a story to share, shoot me an email at info@pretendradio.org or follow me on Twitter , Facebook , and Instagram . Today’s episode was edited by the talented Molly Clay. Our theme music was composed by Joe Basile with thechicken.net. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-10-24T00:00:00",
      "duration": "00:34:12.1270000",
      "explicit": true,
      "spotifyId": "6msnptJxFzzoTEyGdXmqOo",
      "subjects": [
        "Kenneth E. Hagin"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6msnptJxFzzoTEyGdXmqOo"
      }
    },
    {
      "id": "a4a9ab4c-2d02-4876-8978-d397b7f4d456",
      "title": "S304: The Prophet - Allegations of Cult Abuse and Corruption",
      "description": "When Nancy Burnette was appointed by the courts to be a guardian ad litem, she knew her job wasn’t going to be easy. A guardian ad litem is someone who represents kids in the foster care system. It’s her job to place children in homes with the right parents. If she doesn’t get right, her decision can cause lasting damage on these vulnerable children. This was a challenge Nancy was willing to take. So, put yourself in Nancy’s shoes for a second. If you had to place a child in the custody of the Word of Faith Fellowship family, what would you do? This episode explores the series of questions surrounding the Word of Faith and accusations about their grip on local government. For example, did you know the Jane Whaley’s son in law, Frank Webster, was an assistant state prosecutor at a nearby county ? There are also accusations that a local social workers undermined abuse investigations at the Word of Faith Fellowship? The list of accusations go on and on. In this episode titled “Allegations of Abuse and Corruption,” I’ll do my best to describe some of the political controversy surrounding the Word of Faith Fellowship. ------- See the front page article on Pretend Radio and the church\u0027s response: http://pretendradio.org/word-of-faith-fellowship-prophet-allegations-of-child-abuse-and-corruption/ ------- Also, I am excited to announce that Pretend Radio is going to be attending the first annual True Crime Podcast Festival on July 13, 2019 in Chicago! Trust me, start planning now, it’s worth traveling to. This is your chance to mingle with podcasters you listen to regularly. There will also be live episode recordings as well as panel discussions. In fact, I’m speaking at one of them. Some of the shows registered are All Crime No Cattle, Criminology, Canadian True Crime, Mugshot, Swindled, Sword and Scale, and so many more . You won’t want to miss this. Go to the website TCPF2019.com to find information on tickets and the hotel. Prices do go up the closer we get to the event so you won’t want to wait. When you buy your ticket, make sure you mention Pretend Radio on the ticket registration survey. This is going to be a blast. I can’t wait to meet everyone at the True Crime Podcast Festival! For more information, see the show notes. —PROMO— Swindled Framed: An investigative story —MUSIC— Thechicken.net Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-10-17T00:00:00",
      "duration": "00:34:02.2260000",
      "explicit": true,
      "spotifyId": "2ZbtqmCdhGf5Zbx7153FLk",
      "subjects": [
        "Kenneth E. Hagin",
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/2ZbtqmCdhGf5Zbx7153FLk"
      }
    },
    {
      "id": "5617a812-a118-4869-9194-b8028df1ffd4",
      "title": "S303: The Prophet - Former Cult Members Speak Out",
      "description": "On April 7th, 2018, more than a dozen former Word of Faith Fellowship members reunited at the Spindale House in Rutherford County, North Carolina. It was an opportunity for former members to answer lingering questions for the citizens in the community. But in reality, it was probably an event designed to make good television for the documentary crew filming the whole thing. When I walked into the room, I expected a small gathering with a few chairs. Instead, I counted 6 professional video cameras and crew to match it. It was a huge production. I soon learned that today’s community event was part of an upcoming A\u0026E documentary series on the Word of Faith Fellowship. Each former member in the panel sat behind a microphone provided by the A\u0026E crew. About 80 to 100 people were in attendance—including current members of the Word of Faith Fellowship. The room was tense. John Cooper, former Word of Faith Fellowship Former Members speaks about his experience with the Department of Social Services in Rutherford, County. Survivors speak out against Pastor Jane Whaley This episode was especially hard to write because there were so many stories to tell. But there was one story that stood out more than the others. Former Word of Faith Fellowship member Jamey Anderson delivered an impassioned speech about leaving the church. He lamented about being cut off from his family and missing his own grandfather’s funeral. In the audience sat his mother with an emotionless expression on her face. You see, Jamey’s mother is still a member at the church and has cut all communication with her son. Jamey called her out and said, “I’m very happy to see that whatever I\u0027ve done has motivated her to show up today. So it\u0027s at least good to see her.” Jamey used his time behind the microphone to respond to his mother’s 30 minute YouTube video. In the video, his mother Patti, his grandmother Dot, and his step-sister Allison describe why they think Jamey’s a liar and justify why they have disowned him. ---SUBSCRIBE--- Apple Podcasts Google Play Stitcher Spotify ---PROMO--- Let\u0027s Talk About Sects Killafornia Dreaming ---MUSIC--- Thechicken.net Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-10-10T00:00:00",
      "duration": "00:25:39.7350000",
      "explicit": true,
      "spotifyId": "12qDRJu1rQkZL0mqkfDzlV",
      "subjects": [
        "Word of Faith Fellowship",
        "Kenneth E. Hagin"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/12qDRJu1rQkZL0mqkfDzlV"
      }
    },
    {
      "id": "6c957e02-4182-4207-840a-cafd97c607f1",
      "title": "S302: The Prophet - Who is cult leader Jane Whaley?",
      "description": "Who is Jane Whaley? Jane Whaley is the pastor at the Word of Faith Fellowship—a conservative, charismatic Christian church. Those who have left the church describe her as a ruthless cult leader. But, we don\u0027t know much about her. Where did she come from? How did she assume power? I spoke with John Huddle, a former Word of Faith Fellowship member, to learn more about Jane Whaley\u0027s past. To learn more visit pretendradio.org --Promo-- All Crime No Cattle --Music-- Thechicken.net Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-10-03T00:00:00",
      "duration": "00:34:02.6970000",
      "explicit": true,
      "spotifyId": "01AG6KvF34x29wdJhhTCLu",
      "subjects": [
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/01AG6KvF34x29wdJhhTCLu"
      }
    },
    {
      "id": "bfe5a664-4af8-42c6-98e7-8cd761657d02",
      "title": "S301: The Prophet - Word of Faith Fellowship Cult Revisited",
      "description": "Season 3: The Prophet - Word of Faith Fellowship Revisited I’m back with a whole new season of Pretend Radio. But this time it’s going to be a little different. Instead of telling you a different story each episode, I decided to do a serialize season where I tell you a single story, one episode at a time. So what is it about? It’s about the first episode I aired on this show—the Word of Faith Fellowship church. Back in season one, I met up with a man who says he escaped the cult. His name is John Cooper. I contacted him and asked \u0022Hey, do you want to meet up? I’m thinking about starting a podcast and would like to tell your story.\u0022 So, we just met up at a park in Chapel Hill, North Carolina. At this point, I didn’t know what this podcast was all about. All I knew was that he was part of a religious sect. And what he told me that day in that park blew my mind. But in the end, I feel like I didn’t do that story justice. It was one guy’s story. I needed to go out to the other side of the state, where the Word of Faith Fellowship is located, and do a little more digging. So, I got in my car and drove west. After I spending the whole day in Spindale, North Carolina, I thought to myself, there is no way I keep everything I just learned in one episode. If season one was about John cooper, season 3 is all about the town of Spindale. The episode you’re about to listen to is my first 3 episodes rolled into one. And I’m going to stitch them together by playing some ads for some non-profits organizations. And at the end of the episode there’s a preview of the new season. Now many of you have already heard this story, but trust me, even I had to go back and listen to these episodes. Once the season starts, I’m not going to spend a lot setting things up. We’re just going to get right to it. If you’re new to Pretend Radio, well this is a great place to start. Let me tell you, it’s pretty crazy. I got deeper into this story than any other journalist. The BBC has tried and failed. The Associated Press tried and they couldn’t get in. Even A\u0026E is producing a documentary on the WOFF and they didn’t get the access I got. So enjoy this flashback episode and revisit The Prophet from season one. And get ready for the season because it’s coming out very soon. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2018-09-28T00:00:00",
      "duration": "01:00:09.2080000",
      "explicit": true,
      "spotifyId": "4wvQwgTDC0XPEo5rkkW2Uj",
      "subjects": [
        "Kenneth E. Hagin",
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/4wvQwgTDC0XPEo5rkkW2Uj"
      }
    },
    {
      "id": "0049a4f5-c9fe-4146-bee6-5b1efec87989",
      "title": "S103: The Prophet Part 3 - Word of Faith Fellowship",
      "description": "In the Prophet part 3, we’ll look at the Word of Faith Fellowship from a completely different lens. We’ll hear from current sect members and get their version of the story. Plus, you\u0027ll hear the latest on trial against five ministers accused of beating and kidnapping Michael Fenner. If you enjoy the show, consider donating a dollar: https://patreon.com/user?u=5971503\u0026utm_medium=social\u0026utm_source=twitter\u0026utm_campaign=creatorshare2 Follow us on: Twitter: @pretend_radio Facebook: www.facebook.com/PretendRadioPodcast Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2017-06-22T00:00:00",
      "duration": "00:21:24.2840000",
      "explicit": true,
      "spotifyId": "6Txop3p2OAdkPnS8ugU2wJ",
      "subjects": [
        "Kenneth E. Hagin",
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6Txop3p2OAdkPnS8ugU2wJ"
      }
    },
    {
      "id": "043d173c-7183-4fb3-be87-d7105853fad0",
      "title": "S102: The Prophet Part 2 - Word of Faith Fellowship",
      "description": "John Cooper remembers one of the Word of Faith Fellowship ministers commanding him to beat his wife. He also describes his family’s attempt to what he describes as a cult. Then it finally happened. John escaped. We’ll listen to secret recordings of pastor Jane Whaley trying to lure him back. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2017-06-20T00:00:00",
      "duration": "00:22:30.2950000",
      "explicit": true,
      "spotifyId": "3oXEK1AdPipeDRzTO9Uzeu",
      "subjects": [
        "Kenneth E. Hagin",
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3oXEK1AdPipeDRzTO9Uzeu"
      }
    },
    {
      "id": "9c42203f-2131-4cf9-865b-8ebdb2f47486",
      "title": "S101: The Prophet Part 1 - Word of Faith Fellowship",
      "description": "///UPDATE/// Start with Season 3, episode 1 . After covering this cult, I was personally invited by the cult leader to spend the day with her. You won\u0027t want to miss it. ///UPDATE/// The Prophet part 1 explores The Word of Faith Fellowship. You will hear about the accused cult leader, Pastor Jane Whaley, who many inside the sect believe is a prophet with direct communication with God. John Cooper describes the day 20 to 30 sect members surrounded and attacked him. He also shares secret recordings of Pastor Jane Whaley commanding someone to throw someone down to the ground. Plus, you’ll hear “blasting prayers” — ear-piercing crying sessions meant to cast out demons. Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2017-06-06T00:00:00",
      "duration": "00:23:58.6410000",
      "explicit": true,
      "spotifyId": "0xjzbBBejx94g6gu5Br0Fq",
      "subjects": [
        "Kenneth E. Hagin",
        "Word of Faith Fellowship"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/0xjzbBBejx94g6gu5Br0Fq"
      }
    }
  ]
}