{
  "_ts": 0,
  "id": "3a7e7f2c-6db1-4e85-a1db-6c09f0fc89dd",
  "name": "Prevail with Greg Olear",
  "spotifyId": "3YhpZkaiQQK98IrGTuYys5",
  "appleId": 1553506699,
  "episodes": [
    {
      "id": "dd55b137-ae42-4742-963f-90e85d28629e",
      "title": "Opus Dei \u0026 Opus Knight (with Gareth Gore)",
      "description": "Gareth Gore is a financial journalist and editor with close to two decades of experience, who has reported from over twenty-five countries and covered some of the biggest financial stories. His writing has been published by Bloomberg, Thomson Reuters, and International Financing Review. He is the host of The Syndicate, which tells the behind-the-scenes stories of the biggest financial deals in history. His new book, five years in the making, is “OPUS: The Cult of Dark Money, Human Trafficking, and Right-Wing Conspiracy inside the Catholic Church.” In this conversation with Greg Olear, Gore delves into the controversial practices of Opus Dei, its financial manipulations, and the historical context of its formation. Gore highlights the cult-like control mechanisms employed by the organization, the allegations of human trafficking, and the dynamics of gender within Opus Dei. He also examines the appeal of the organization to its members and the significant political influence of key figures like dark money maestro Leonard Leo and the late Rev. C. John McCloskey III. The discussion raises critical questions about the implications of Opus Dei\u0027s actions for the Catholic Church, the United States, and society at large. Plus: the MAGA playbook! Follow Gareth Gore https://x.com/gareth_gore Buy his book: https://www.simonandschuster.com/books/Opus/Gareth-Gore/9781668016145 The Teneo Network: https://vimeo.com/806310279?share=copy Subscribe to The Five 8: https://www.youtube.com/channel/UC0BRnRwe7yDZXIaF-QZfvhA Check out ROUGH BEAST, Greg’s new book: https://www.amazon.com/dp/B0D47CMX17 ROUGH BEAST is now available as an audiobook: https://www.audible.com/pd/Rough-Beast-Audiobook/B0D8K41S3T Would you like to tell us more about you? http://survey.podtrac.com/start-survey.aspx?pubid=BffJOlI7qQcF\u0026ver=short",
      "release": "2024-10-04T09:00:00Z",
      "duration": "01:19:35.3920000",
      "explicit": false,
      "spotifyId": "3RfvtSdyAY51iYgtENQVWB",
      "appleId": 1000671761449,
      "subjects": [
        "Opus Dei"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/3RfvtSdyAY51iYgtENQVWB",
        "apple": "https://podcasts.apple.com/podcast/opus-dei-opus-knight-with-gareth-gore/id1553506699?i=1000671761449"
      }
    }
  ]
}