{
  "_ts": 0,
  "id": "9bb34bbb-06ed-4606-a046-b069ce32539a",
  "name": "Prodigal Ali",
  "youTubeChannelId": "UCLGdHcFInZ7U56wtuxeK8Pw",
  "episodes": [
    {
      "id": "6ccf9eb5-154b-4c5b-b256-e7005c14d826",
      "title": "SOS for Jehovah\u0027s Witnesses (message for \u0022worldly\u0022 people)",
      "description": "I just finished reading the book #LeavingTheWitness and I\u0027m grateful for people like Amber Scorah, Leah Remini, Lloyd Evans, Ray Franz, and many many others who sacrifice their time to help others still trapped in high control religions (#cults). \n\nThose of us who leave these organizations want nothing more than to preserve our relationships with our families and loved ones. But when we question the teachings, the leadership, or express doubts, we are branded #apostates and our entire community is told to shun us. Not even a simple hello. \n\nHigher education is strongly discouraged, blood transfusions are not allowed, and pedophiles are not automatically reported to the police because there must be #2witnesses to this heinous crime. Women are second class citizens and many disfellowshipped people commit suicide. \n\nThe well dressed, smiling people knocking at your door don\u0027t tell you this side of the religion because preserving the image of the organization is the most important thing ever. More important than protecting children, listening to the individual, comforting the weak, or practicing MERCY. \n\nThere are now literally hundreds of YouTube channels on this subject. Please reach out to these people in your communities when you see them. Perhaps YOU will be that person to help plant that first seed of freedom.",
      "release": "2019-06-20T02:06:25Z",
      "duration": "00:08:53",
      "explicit": false,
      "youTubeId": "bX9hbbCSmfE",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=bX9hbbCSmfE"
      }
    },
    {
      "id": "f6fc8c33-84b1-4e3f-a42b-e8d6d8566f88",
      "title": "JW 2019 Convention review",
      "description": "Hello again!  I had an unexpected weekend...I attended the Sunday of the 2019 Convention.  In this video I share some of my observations and a couple cool experiences (which is around the 45 minute mark)  The one thing I forgot to say in this video is that after the convention I CRASHED.  I was SOOOOO exhausted and drained.  I didn\u0027t feel particularly bad DURING the convention, but I guess my body and spirit really took a hit from all the propaganda and I slept 12 hours Sunday night.  Our bodies don\u0027t lie to us...and my body certainly let me know that that environment was NOT energizing.  I guess the lesson is to really have empathy and compassion for the JWs who day in and day out subject themselves to this religious legalism and hamster wheel of works based salvation.  \nThis week JWs will also be starting the book of Galatians in their midweek meeting.  This was one of the books of the Bible that really woke me up.  I encourage everybody to read this short and sweet book.  \nThank you to anybody who watches this video.  My goal is to add my voice to the ever growing wave of people who stand for freedom of speech, freedom of belief, freedom of thought and unconditional love. We can agree to disagree...respectfully.   May each of you come to experience the grace and shalom of our Father and Lord Jesus Christ.  \n\nAlso, I\u0027d like to apologize for not mentioning all the other youtube channels that have helped me along the way.  My mind blanks out when I hit the record button.  Big thanks to \nhttps://www.youtube.com/user/bridgetazaz\nhttps://www.youtube.com/user/WNFJ2008\nhttps://www.youtube.com/user/jointhebibleproject\nhttps://www.youtube.com/watch?v=zRHCvieqlfA\nhttps://www.youtube.com/channel/UC1l1Ac6tb16thxKa96Gm7XA\nhttps://www.youtube.com/channel/UC60-_nhyXerpfmv6TdbhFXQ\nhttps://www.youtube.com/channel/UC7NjVbq0UiqcXVoSl365IRg\nhttps://www.youtube.com/watch?v=R5B_KlPPoVM\nhttps://www.youtube.com/watch?v=caTEGJrzmkM\u0026list=PLRhx6DcBMgRXxlSCOI-yShL2yq1wajbAb\nhttps://www.youtube.com/channel/UChqAubATw4mUicQHaxherdw\nhttps://www.youtube.com/watch?v=mpLlPhAnFKc\u0026t=194s\nhttps://www.youtube.com/watch?v=Qc_AaXSxnuw\u0026list=PLcuruAFgv2HGnkbuCDlmKaBRlEe4qN1hh",
      "release": "2019-05-29T03:38:15Z",
      "duration": "01:00:39",
      "explicit": false,
      "youTubeId": "WYp9hEwkn7Q",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=WYp9hEwkn7Q"
      }
    },
    {
      "id": "c8a68f3b-00b4-4160-b6d6-6c85178ae9e7",
      "title": "Marked Jehovah\u0027s Witness first video (nervous!) Dec 2018",
      "description": "Agh!  Why is it so scary to share my story? Probably because I was told my entire life to forfeit individuality for the group.  Sorry this is so long...it\u0027s nothing extraordinary, but yet I never imagined my life would be turning out like this.  I am a born in JW and this is my story to Christian freedom.  I struggled with severe depression for most of my life.  But there is hope.  Here is my story.  The Truth shall set you free....but first it\u0027ll make you mad ;) \n\nIf you\u0027re a JW you might be asking \u0022But where else would we go? The organization isn\u0027t perfect, but we have the truth.\u0022  Actually, we were taught the wrong question...it\u0027s not WHERE should we go...but rather \u0022TO WHOM shall we go?\u0022  (John 6:68)\n\nAs a man was passing the elephants, he suddenly stopped, confused by the fact that these huge creatures were being held by only a small rope tied to their front leg.  No chains, no cages.  It was obvious that the elephants could, at anytime, break away from their bonds but for some reason, they did not.  He saw a trainer nearby and asked why these animals just stood there and made no attempt to get away.  \u0022well,\u0022 the trainer said, \u0022when they are very young and much smaller we use the same size rope to tie them and, at that age, it\u0027s enough to hold them.  As they grow up, they are conditioned to believe they cannot break away.  They believe the rope can still hold them, so they never try to break free.\u0022  The man was amazed.  These animals could at any time break free from their bonds but because they believed they couldn\u0027t, they were stuck right where they were.  \n\nGalatians 5:1 \u0022For such freedom Christ set us free.  Therefore, stand firm, and do not let yourselves be confined again in a yoke of slavery.\u0022",
      "release": "2018-12-07T02:48:09Z",
      "duration": "01:13:06",
      "explicit": false,
      "youTubeId": "zib3OixRFAM",
      "subjects": [
        "Jehovah\u0027s Witnesses"
      ],
      "urls": {
        "youtube": "https://www.youtube.com/watch?v=zib3OixRFAM"
      }
    }
  ]
}