{
  "id": "253589ec-18cb-4269-a1ad-8a840368646b",
  "name": "Professional Book Nerds",
  "spotifyId": "7m5gs3dP0L2IouApKubGtj",
  "appleId": 1065515588,
  "episodes": [
    {
      "id": "21b32e91-899d-4b48-8dfa-b92827c2f5d9",
      "title": "Cults: A Dive into Fiction and Nonfiction Reads",
      "description": "Join us as we dive into the captivating world of cults! We\u0027re recommending both fiction and nonfiction titles that explore that mysterious and chilling allure... From gripping thrillers to eye-opening accounts, we\u0027ve got recommendations that will keep you on the edge of your seat. We\u0027ll wax poetic on cult dynamics and discuss the enduring fascination with these enigmatic communities. Titles mentioned in this episode: Jill’s Titles: The Road to Jonestown by Jeff Guinn The Last Housewife by Ashley Winstead The Sullivanians by Alexander Stille The Centre by Ayesha Manazir Siddiqi Joe’s Titles: Member of the Family by Dianne Lake Those Who Prey by Jennifer Moffett The Project by Courtney Summers Sex Cult Nun by Faith Jones Emma’s Titles: The Girls by Emma Cline Say You’re Sorry by Karen Rose The Lightness by Emily Temple Heartbreaker by Claudia Dey Meredith’s Titles: Scarred: The True Story of How I Escaped NXIVM, the Cult That Bound My Life by Sarah Edmondson Fierce Little Thing by Miranda Beverly-Whittmore A Billion Years by Mike Rinder Don’t Call It a Cult by Sarah Berman Cults \u0026 Exteme Belief - A\u0026E (Kanopy) Readers can sample and borrow the titles mentioned in today’s episode in Libby . Library friends can shop these titles in OverDrive Marketplace . Looking for more bookish content? Check out the Libby Life Blog ! We hope you enjoy this episode of the Professional Book Nerds podcast. Be sure to rate, review and subscribe on Apple Podcasts , Spotify , or wherever you listen! You can follow the Professional Book Nerds on Instagram , Twitter , and TikTok @ProBookNerds. Want to reach out? Send an email to professionalbooknerds@overdrive.com . We’ve got merch! Check out our two shirts in The OverDrive Shop (all profits are donated to the ALA Literacy Clearinghouse). Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "release": "2024-05-23T07:00:00Z",
      "duration": "00:55:01.1720000",
      "explicit": false,
      "spotifyId": "6nmKW6Id6EZt05u9SCCJUd",
      "appleId": 1000656480280,
      "subjects": [
        "NXIVM",
        "Scientology",
        "Peoples Temple",
        "Sullivanians"
      ],
      "urls": {
        "spotify": "https://open.spotify.com/episode/6nmKW6Id6EZt05u9SCCJUd",
        "apple": "https://podcasts.apple.com/podcast/cults-a-dive-into-fiction-and-nonfiction-reads/id1065515588?i=1000656480280"
      }
    }
  ]
}